{"title": "Example of The Motley Fool spreading false information on TIPS", "selftext": "I have always been a vocal advocate that the Motley Fool is close to a scam in the world of investment advice. Their recommendations don't work and they window-dress their mutual fund products by closing down underperforming mutual funds (survivorship bias).\n\nIn [this article](https://www.fool.com/investing/dividends-income/2015/03/08/tips-treasury-inflation-protected-securities.aspx), The Motley Fool clearly doesn't understand how Treasury Inflation-Protected Securities (TIPS) work and overstates its protection against inflation to be twice of what it actually is:\n\n> Here's how it works: every month, the government releases the latest reading on the CPI. The Treasury then boosts the principal value of every TIPS issue by that same amount. Interest payments are calculated based on the changing inflation-adjusted principal value. For instance, say inflation **rose 1%** over the course of a given year. A bond initially issued for $1,000 would see its principal amount rise $10 to $1,010. If those bonds pay 1% interest **every six months**, then **the next interest payment would be $10.10** rather than $10, because of the boost from inflation.\n\nI have highlighted the error part. First, there is a minor error that the face value is adjusted by inflation, not the change of inflation. Second, there is a material error that the interest (coupon) payment is actually calculated based on a face value adjusted for the inflation **during the period equal to the payment frequency**, not \"inflation over a given year\". In the example, if inflation is 1% that year, then US Treasury will deem inflation to be only 0.5% for the six month period, and the interest payment will be only $10.05.\n\nI hope all fixed-income traders understand these products correctly and not misinformed by bad people.\n\n-----------------------------------------------------------\n\nEdit: Some good points brought up here by people. This afternoon I asked a specialized in this field for explanation. He told me I'm right and there are indeed some newer fixed income traders who can understand TIPS better. He informed me the US TIPS is just the way it is: semiannual coupon interest payments, and based on semiannual inflation rate.\n\nHe said it is impossible to predict what will the US Treasury do if one day they decide to offer annual pay TIPS or monthly pay TIPS, and therefore it is too bold for me to assume their will use annual and monthly inflation for these hypothetical products that don't exist. He also said he has seen some foreign (non-US) inflation-indexed bonds that have payment intervals in one length and are based on the CPI in the period of a different length.\n\nFor industry practitioners, an example that explains the mechanism of these products can be referenced in your level 1 curriculum volume 5 book's page 327: Exhibit 7 (Lemuria).", "id": "9sw11q", "created_utc": 1540964623.0, "score": 136, "upvote_ratio": 0.87, "num_comments": 38, "comments": [{"body": "[deleted]", "score": 56, "replies": [{"body": "You seem correct", "score": 20, "replies": [{"body": "The best kind of correct.", "score": 19, "replies": []}, {"body": "I don’t know enough about this subject to argue with him. Besides, that’s a lot of writing so he must know what he’s talking about!", "score": 6, "replies": []}]}, {"body": "It looks like in the Fool's example, since that $1,000 face (par) value bond pays a ~$10 semiannual coupon interest payment, its annualized coupon rate is a 2% and semiannual coupon rate is 1%. This we both understand.\n\nMy argument is how the principal ($1,000) is adjusted according to inflation. The Fool incorrectly thinks the principal is adjusted by **annual** inflation (1%), but in fact semiannual TIPS are adjusted for **semiannual** inflation (0.5%) for the calculation of coupon interest payments.", "score": 1, "replies": []}]}, {"body": "I don’t trust any service that consistently makes outlandish claims such as “this stock tips is like buying amazon at $3.45!”... it’s total bullshit and preys on the misinformed.", "score": 18, "replies": [{"body": "You know, a long time ago I thought I liked their website. Then I hated their over-the-top crap where you click forward like 500 times and it still never tells you the stock. \n\nOne time I got so pissed I decided to try to figure out what freakin stock it was without paying them or signing up. I feel like it was in 2014 and by looking at the sector and the chart I discovered it was BOFI.\n\nTHey pretty much doubled after that, then collapsed in half, then tripled. \n\nAre they a scam? idk... Sure they're over the top but they do pick some good winners sometimes. ", "score": 6, "replies": [{"body": "A broken clock is right twice a day. Doesn't mean shit they are simply a scam.", "score": 3, "replies": []}]}, {"body": "A lot of their stuff is click-bait. ", "score": 3, "replies": []}]}, {"body": "I purchased their Stock Advisor series, but I definitely don’t buy all of their recommendations. They recommended StitchFix, lmao.\n\nBut I do my due diligence based on what they recommend because I’m a Buy & HODLer and it’s nice to see when they have for *sell* recommendations, which have definitely saved me money over the years.", "score": 7, "replies": []}, {"body": "Yeah i never read these guys. Every other ad on yahoo finance is a “double down buy alert” from motley. They keep touting their early success with a handful of lucky breaks", "score": 10, "replies": []}, {"body": "Thanks for the post. Still a newbie and appreciate this alot", "score": 9, "replies": [{"body": "Hey, HotCredit, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": -18, "replies": [{"body": "Hey CommonMisspellingBot, just a quick heads up:  \nYour spelling hints are really shitty because they're all essentially \"remember the fucking spelling of the fucking word\".\n\nYou're useless.\n\nHave a nice day!", "score": 17, "replies": [{"body": " I upvoted you but also... you wrote back to a bot. And I thought about doing the same. \n\n... but it’s a fucking bot. Why do we care?\n\nThe world is getting really weird.", "score": 16, "replies": [{"body": "[removed]", "score": 16, "replies": [{"body": "ROBOTS ARE TAKING OVER! *panics in spongebob*", "score": 4, "replies": [{"body": "Am I the only real person on this post?", "score": 2, "replies": []}]}]}, {"body": "That's also a bot. So you're the one talking to a bot. Unless.... You're also a bot? ", "score": 3, "replies": [{"body": "Lmao someone made a bit to follow common misspellings bot around and trash it", "score": 2, "replies": []}]}]}, {"body": "Good bot", "score": 1, "replies": [{"body": "good human", "score": 1, "replies": []}]}]}]}]}, {"body": "I will always hate MF for their terrible clickbait...but David Gardner turned me onto OKTA, SQ, VRNS, TWLO, AYX and MDB way earlier than anyone else would have, and my bank account is forever grateful.", "score": 3, "replies": [{"body": "Damn didn't realize OKTA was doing that well.  I didn't bother investing because I thought their software was a commodity that AWS could easily implement themselves.  TWLO too.\n\nI guess each company has huge mindshare in their respective niches.", "score": 1, "replies": [{"body": "If the market behaves, OKTA should be $100 in a year, TWLO probably $125+. growth is insane. OKTA has been hiring any and all top salesmen in the space over the past 2 years. They are EVERYWHERE right now.", "score": 1, "replies": [{"body": "Their product is so bad tho lol I’m using it right now ", "score": 1, "replies": [{"body": "as was their $BB tout a few months ago", "score": 1, "replies": []}]}]}]}]}, {"body": "This company will be 40X Apple! Of course that would be $40T, or more than the entire US stock market.", "score": 5, "replies": []}, {"body": "I keep seeing their FB adverts saying \"CLICK HERE for rare triple down buy advice\"\n\nAnyone know what that is?", "score": 2, "replies": []}, {"body": "Listen to their podcasts and read their public articles, but don't sign up. Their best stuff is free, their paid stuff is useless and probably only self promoting. ", "score": 2, "replies": [{"body": "Long time subscriber to MF, you are wrong. The paid services are quality stock picking and education services, the free articles are trash and no better than what you could find in online forum, maybe with better disclosure.", "score": 2, "replies": []}]}, {"body": "I tried fool for the last year but I was so turned off by their continuing hyped-up up-sale shit, I got worn out in a few months. Hell if I subscribed to everything they wanted, I’d be paying $500 a month for shitty advise.", "score": 4, "replies": [{"body": "Interesting. I signed up for Stock Advisor when they did a $159 for 3 years \"promo\". It's been about a year and I haven't seen any cross-selling or up-selling emails from them. Could be I'm militant over unsubscribing from emails so maybe one came in an I immediately unsubscribed and forgot all about it.", "score": 3, "replies": [{"body": "Hmmm I only had one email address and while I do have spam filters, this wasn’t spam. Just another opportunity to sign up to the last second privileged information that I only had to pay another $99 a year to be a part of. I don’t know how you missed all of the emails I must’ve had hundreds. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Agreed. I think the Motley Fool intrinsically know anyone who trust them is actually being fooled. xD", "score": 0, "replies": []}]}, {"body": "Boat load of fools heavily short the most transformarive company today. Tesla.", "score": -1, "replies": [{"body": "Do you mean Motley Fool?  It has been a Stock Advisor pick for a long time now.", "score": 3, "replies": []}, {"body": "Anton wahlman is one such fool. Crying foul that tsla's last q is all bunk.", "score": 1, "replies": []}]}, {"body": "You all should just follow my posts on here instead of those useless services. Better than all of them combined.", "score": 0, "replies": []}]}
{"title": "r/Stocks Daily Discussion Wednesday - Oct 31, 2018", "selftext": "These daily discussions run from Monday to Friday and Friday's will stay up till Monday.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n * [Corporate News](https://www.streetinsider.com/Corporate+News)\n * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n * [Economic data](https://www.streetinsider.com/Economic+Data)\n * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/about/sticky) or see past portfolio discussions with [this link.](https://www.reddit.com/r/stocks/search?sort=new&q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&t=all&restrict_sr=on)\n\nSee past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  And use this link to see past stock [options discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+options%22&restrict_sr=on&sort=new&t=all)\n", "id": "9sxp95", "created_utc": 1540984051.0, "score": 7, "upvote_ratio": 0.89, "num_comments": 28, "comments": [{"body": "Not sure if this is the right spot for this but, I just turned 18 and I have 2000 dollars I would be willing to invest into the stock market. Where should I start? Does anyone have any helpful tips or tricks? ", "score": 3, "replies": [{"body": "Do you have $2,000 *investing* money or $2,000 in general? Also are you going to college? Do you have income?\n\nIf you have that money and don't know what to do with it, I'd say maybe buy a couple shares of Microsoft and Visa, but then hold on to most of it because as an 18 year old heading off to college, you're going to get hit with expenses left and right pretty soon.\n\nIf you're not going to college and have decent income, throw it in an index fund or ETF and let it grow.", "score": 3, "replies": [{"body": "I have about 2600$ of my own money currently, so maybe investing 2000 of that is a bit high. Although I make around 1100 dollars a every 4 weeks. And I have about 22000 dollars of money from my family just for university. I realize I'll have a lot of expenses coming up soon, do you think I could still afford to spend 1000 dollars or so on the stock market/other investments?", "score": 1, "replies": [{"body": "If you have decent income (which as an 18 year old it seems like you do), then yeah I don't think $1,000 is going to hurt you. When do you start university?\n\nBut for my advice:\n\nDo some reading like others have said \n\nInvest in good companies/know what you're investing in \n\nLearn about ETFs, index funds, Roth IRA, 401ks etc. I fuckin wish I was interested in investing when I was 18. \n\nAs far as stocks are concerned, only invest what you are willing to hold long term. Don't invest in a company hoping to make $50 profit in a month and then flip it for the profit. That's gambling and some times you will lose that game. \n\nDon't make the same mistake that I did. I got a new job, got a nice big paycheck, jumped in at the peak this year, and now there's a big market correction and I probably should've held onto that money as I'm looking to move into a new apartment right now. Moral of that story is that that wasn't money that I was willing to hold long term and I'm now having to decide if I have to sell off all of those stocks at a loss in order to afford all of these moving costs I'll have or if I should hold onto them and struggle to try to make the move work without that money.", "score": 2, "replies": [{"body": "Yeah that's rough, I hope it all works out. And thank you for the advice, I'll definitely be using it!", "score": 1, "replies": []}]}]}]}, {"body": "Buy a low cost index fund to start, like VTI", "score": 2, "replies": [{"body": "I'm not really sure what that is but I'll keep that in mind, thanks!", "score": 2, "replies": [{"body": "You're basically buying a piece of the whole stock market. If you buy VTI your investment will track with how the market as a whole does. There are other indeces that track just the S&P500, etc.", "score": 1, "replies": []}]}]}, {"body": "Read The Intelligent Investor ", "score": 2, "replies": [{"body": "Alright I'll look into it, thanks! ", "score": 1, "replies": []}]}]}, {"body": "What happens when a company buys another company? Specifically, a company I owned shares of was bought, does that mean my shares were automatically sold at the acquisition price? I don't see any record of that on Robinhood. \n\nEdit: I looked it up so I know how it works, but there doesn't seem to be any evidence of the transaction? The stock just disappeared ", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Its very hard to be perfect, its not late if you feel they are growing you can still buy.", "score": 1, "replies": []}]}, {"body": "Anyone has an opinion about why Ubisoft stock is still going down even if their earnings seemed extremely positive? I'm just trying to understand.\n\n\"Net bookings for the second quarter came in at €364.6 million against a target of €345m and was also a 38% year on year increase. Net bookings for the six month period, March to September 30th, came in at €746.1m and marked a 60% YoY increase over last years €466.2m. Operating income from this has come in at €110.2m, a 3550% increase from last years €3.1m.\"", "score": 2, "replies": []}, {"body": "Guess recession is over", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Why did you use the word 'or' we said the same thing.", "score": -1, "replies": []}]}, {"body": "I think you wanted to say \"correction\", not \"recession\"", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "futures up - second day in a row - most of earnings in even on fb miss they are up pre market and vix is way down. ", "score": 2, "replies": []}]}]}, {"body": "Good rally this morning.", "score": 1, "replies": []}, {"body": "Thank god for some green", "score": 1, "replies": []}, {"body": "IGT or SGMS going forward for sports betting investment? Both cheap and growing.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I believe they have a couple of law suits brewing. Could be why?", "score": 1, "replies": []}, {"body": "They cut dividend", "score": 1, "replies": []}]}, {"body": "What just happened to SPY???\n\n2 dollar drop from 3 pm to 4pm, EST", "score": 1, "replies": []}, {"body": "Thoughts on LUV at low 49? Seems bound to bounce back up. ", "score": 1, "replies": []}, {"body": "Bought puts and down $2500 on them. Overall down $3200 today.", "score": 1, "replies": [{"body": "Why are you buying so much instead of selling when the market is so uncertain? Just curious. ", "score": 1, "replies": [{"body": "Lost 1000 yesterday try to make it back ended up down a lot more. I made another earnings play with remaining money. I'm done trading if I fail again.", "score": 1, "replies": [{"body": "Honestly, you shouldn’t be buying puts or calls right now. The market is swinging too hard. \n\nBuy 100 shares of one stock that’s cheap or at its floor and trading sideways. Sell covered weekly calls on it just outside the money. You won’t make money as fast but it’ll be a hell of a lot more consistent. \n\nIf you’re going to buy any options, do it with contracts that are like 2-3 months out on something highly volatile. Buy a straddle, then sell each leg individually when they profit. \n\nPlaying with options and not having strategies for failure is just burning money. At least, imo. ", "score": 1, "replies": []}]}]}]}]}
{"title": "$TSLA Daily Investor Discussion - October 31, 2018", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q3 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/9r1iru/tesla_tsla_third_quarter_2018_results_and/).\n", "id": "9sx16q", "created_utc": 1540976674.0, "score": 8, "upvote_ratio": 0.9, "num_comments": 30, "comments": [{"body": "So! I sold the last of my Nov 02 Call options I bought months ago. Between time decay and that scary dip down to 260$ it wasn’t looking good for awhile there, went from being down in value for them of over 90% to selling the last of those ones today for a 40% profit overall. Going to be putting that money aside to add to just TSLA stock. Gotta say, FUD news is a helluva stressor when you’re holding Calls. \n\n\n", "score": 14, "replies": [{"body": "Just sold my calls today as well and I totally agree with the fud news being stressful", "score": 3, "replies": []}, {"body": "Holding on to Nov 9 and Nov 6 calls, I feel there's still some momentum left for the next couple weeks.", "score": 1, "replies": []}]}, {"body": "Thread so far is probably a good prediction of the intensity of trading today. /s", "score": 7, "replies": [{"body": "it actually might be... whenever somebody in these threads predicts large gains before the market actually opens, we generally end up in the red ;)", "score": 9, "replies": [{"body": "I predict a massive sell off! /s", "score": 11, "replies": [{"body": "Hope this works :)", "score": 4, "replies": []}]}]}]}, {"body": "340?", "score": 7, "replies": [{"body": "Don’t jinx it ;)", "score": 5, "replies": [{"body": "Woot!", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "We'll be back tomorrow!", "score": 1, "replies": []}, {"body": "super low volume today. Curious to see if this returns to contrarian trading on a less green market day, or whether we've exhausted the ER bump. I have my fingers crossed that the tariff battle with China resolves. That's a big deal imo because China is probably 20% of Tesla's market.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tesla has been pretty solid since the third quarter report.  Even when other tech stocks were down.  I think it will be over $400 if the 4th quarter remains positive.  ", "score": 6, "replies": [{"body": "I don't think we see $400 until macro turns green.  \n\nConveniently, I am predicting macro to turn starting next Tuesday. Although maybe we've already turned. ", "score": 2, "replies": [{"body": "Didn't it do that today?", "score": 1, "replies": [{"body": "Ya we may have hit bottom", "score": 1, "replies": []}]}]}]}, {"body": "Not 100% Tesla related but interesting.\n\n> GM calls for national EV sales program\n\nhttps://www.utilitydive.com/news/gm-calls-for-national-ev-sales-program/540964/", "score": 5, "replies": [{"body": "GM's move here is to gut the fuel economy standards and gut CARB's influence.", "score": 2, "replies": []}]}, {"body": "We're doing good those days ! Can't wait for Q4 numbers. I predict a 400m profit if we have 72k deliveries for the model 3. If you wanna know why i came to this prediction, I talked about it a little bit on the chat of this sub.", "score": 5, "replies": []}, {"body": "Everything is green premarket. Watch the US shit all over it again.", "score": 7, "replies": [{"body": "I hope it lasts. I’m worried the midterm elections will weigh over the the market.", "score": 2, "replies": [{"body": "We're gonna rally after midterms. I wrote about it here. https://www.reddit.com/r/investing/comments/9sey0f/what_are_thoughts_on_possible_impact_of_upcoming/e8oh9nq/", "score": 2, "replies": [{"body": "Agree with much of that.\n\nChances are the republicans win the senate, democrats win the house.  The market will be fine with gridlock.\n\nOn the out chance that democrats with both houses, the market will probably drop. But that’s looking less probable.", "score": 3, "replies": [{"body": "I caught on CNBC that every year after midterms has been up since 1948!", "score": 3, "replies": []}, {"body": "If we win both houses I will be ecstatic. Market can tank for all I care. ", "score": 4, "replies": [{"body": "Not me, I’m a pray for grid lock kind of guy.\n\nI’m happy if no one touches nothing, just let them fight and get nothing done. I hope the house and senate get split among the parties. \n\n(It doesn’t matter anyways the Fed are the ones with all the power right now. Powell better not bitch out, and fold to Trump)", "score": 1, "replies": [{"body": "I'm a long term guy so I'm looking for sensibility in our government. Gridlock keeps the status quo going. \n\nLong term GDP growth in US has been declining for decades. \n\nMy fantasy preference is a New Deal 2.0 including Universal Health Care and a Digital Bill of Rights. The short term uncertainty would drag on the market but the long term benefits to society would be immeasureable.", "score": 1, "replies": [{"body": "I’ve heard crazier ideas.\n\nLook at the cost of the new deal scaled by GDP vs the 2008 recovery act. Crazy... \n\nJust puts into scale how cheap the new deal really was, I mean we can debate the merits/efficacy’s of the policies, but it wasn’t that crazy in terms of cost. \n\nhttps://www.stlouisfed.org/publications/regional-economist/first_quarter_2017/the-recovery-act-of-2009-vs-fdrs-new-deal-which-was-bigger\n\n(I’m not sure I trust people to make things better tho)", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I thought the order date for the full tax credit had already passed.\n\nI also didn’t expect them to push the MR this year. Wonder what the mix will be for MR, vs LR, AWD in Q4.\n\nhttps://electrek.co/2018/10/31/tesla-urge-buy-model-3-mid-range-full-tax-credit/", "score": 6, "replies": [{"body": "I think that the date for \"garanteed\" delivery before end of Q4 has passed, but possibly still not out question if production and deliveries go smoothly.", "score": 5, "replies": []}]}]}
{"title": "S&P500 currently failing retest is 200ma on year - prepare thy anus for “The Great Algo Crash of 2018” as everyone tells there computers to average down.", "selftext": "[removed]", "id": "9t0w8h", "created_utc": 1541006799.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 36, "comments": [{"body": "The red one tastes like cherry ", "score": 7, "replies": [{"body": "Don't try the brown one...", "score": 4, "replies": []}, {"body": "Something tells me it's going to taste like burning.", "score": 2, "replies": []}]}, {"body": "Goddamn thing is up 1.6% in a day and all people can see is that it’s not getting past some line they drew. \n\nYou better be loading up zero day puts ", "score": 6, "replies": [{"body": "I just don’t want my fellow autists to get bull trapped man, looking out for the greater humanity!", "score": 3, "replies": [{"body": "This is why I hate TA. One autist says we broke out of a downward channel so we’re going up and another drew a line somewhere else and says it’s a failed retest and we’re about to plummet again. After the fact both will have reasons why they weren’t actually wrong. ", "score": 7, "replies": [{"body": "Ta man. Its right until it isn't ", "score": 3, "replies": []}, {"body": "While I agree, I get downvoted any time I challenge someone's TA so I don't fucking care anymore.", "score": 1, "replies": []}, {"body": "I agree - I never took technicals seriously until this down trend bc the averaging down of prices have been on point with the moving averages. I feel like the current market is an exception.", "score": 1, "replies": [{"body": "For every TA there is an equal but opposite TA.\n\nLooking at SPX today it’s hard to see anything failed about it. If you have a line that says the index needs to go up 2+% in one day or else it’s somehow failed you might wanna rethink that line", "score": 2, "replies": [{"body": "It’s the same line that sold off the 2%+ - when the market fluctuates so extreme you have to begin ignoring the movements and looking under the hood at the important parts. In this case it’s the 200ma. It’s still not breaking it, and if it doesn’t by EOD expect a sharp sell off today / tomorrow.", "score": 1, "replies": [{"body": "That’s if you’re looking at the EMA. If you look at the SMA (which has seemed to matter before) we’ve long since abandoned that and are basically in no man’s land right now.\n\nWhat’s the exact number it needs to break?", "score": 2, "replies": [{"body": "I’m seeing S&P500 @ 2,742 being the resistance level. You have to include a +/- like 5 points each way.", "score": 1, "replies": [{"body": "I hope you’re loaded up on puts then", "score": 2, "replies": [{"body": "I loaded up near the top today.", "score": 1, "replies": [{"body": "Nicely done. I got a 2720 turbo FD after that first big drop and made a quick $500. Kept me green for the day. Not sure if it’s the resistance or the fact it’s the last trading day of a month - final hour selloffs are very common on those days - either way gainz are gainz", "score": 1, "replies": [{"body": "Yeah - my concern is that the big boys are pumping equities right now so they can offload all the bags of turds onto unknowing investors. I really don’t have much confidence in this rally, and if you look at the chart there is an obvious average down algo being used by big money to risk off. The month chart is really good - you can see it moves from 200 EMA > 100EMA then trades intra-day at 50 EMA. I haven’t pinned down the exact series of combination their averaging-down strategy uses but I’m close - at least until they change the variables. The last time it went to 200 it averaged down for 3 weeks straight. It’s interesting, and I think this is far from over. People are only looking at the year and forgot about the bubble we created in 2017.", "score": 1, "replies": [{"body": "The way I’ve been looking at it - because frankly there’s way too goddamn many TA-based ways to look at it - is that we’re simply in a series of lower lows and lower highs. \n\nSince we entered this downward trend, every drop we have had bottomed around 1% below the previous low and bounced. That bounce would then topped out around 1% below the previous bounce and we’d continue down to a new low. You can find some lines to match that pattern but I don’t think it’s really needed.\n\nToday we managed to break that pattern, getting above Monday’s high of 2700ish but not really closing above it by enough to instill much confidence. If we drop here I would hope it finds support around 2680, otherwise we’re probably headed back to 2600ish or lower where we’ll bounce again around 2575", "score": 1, "replies": [{"body": "2,341 is the number you are looking for ", "score": 1, "replies": [{"body": "You think it’ll free fall to 2,341 before another fake ass bounce, or that’s when you think the selling is truly ‘over’?", "score": 1, "replies": [{"body": "I think that is when the selling is over ", "score": 1, "replies": [{"body": "Gotta ask what line you are basing that on?", "score": 1, "replies": [{"body": "5yr chart, 200 EMA - the reason for this is I am thinking this correction is going to adjust for 2017 as well which was a massive run up yet no pullback, like bubble market crash status.", "score": 1, "replies": [{"body": "200 what EMA? The 200 day SMA is like 2675 right now so I don’t know what 200 period moving average could be in the 2300s unless you’re using weeks or something ", "score": 1, "replies": [{"body": "Use EMA, modern, 200 on a 5 year chart", "score": 1, "replies": [{"body": "I’m still confused. The 200 day EMA is the same number whether you’re looking at 5 years or 3 days. \n\nKeep posting your shit tho - I don’t necessarily agree with it all but it’s better than 90% of the analysis on here and truth is it probably helped make me some money today", "score": 1, "replies": [{"body": "S&P500 still isn’t breaking past that 200EMA mark, puts are still safe. I’m betting big on another crash and slide downward. ", "score": 1, "replies": [{"body": "Feel like AAPL is gonna be the catalyst for a break one way or the other. Putting any $ there? Puts on that or QQQ would probably give better exposure ", "score": 1, "replies": [{"body": "Hourly wage report tomorrow too, prepare for inflation. I’m sending you a message on what I’m trading.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Can you wait until friday with this?  We're kinda have a catalyst coming up soon", "score": 3, "replies": [{"body": "I think biggly is trying to hand off as many bags as possible before Apple ER - Apple is showing a negative money flow.", "score": 1, "replies": []}]}, {"body": "I wouldn't say it's failing this retest unless it goes down on a given day.  So long as it even trades sideways, the retest of the 200ma hasn't failed yet.", "score": 2, "replies": []}, {"body": "its ok trump is going deport everyone with an immigrant parent and KO china with more tariffs this week. Market should jump up to 30k pretty fast", "score": 2, "replies": []}, {"body": "[Click Here to Vote to Remove this Submission](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=9t0w8h&message=9t0w8h) if it breaks the rules, is spam, or ought to be a comment in the Daily Discussion thread.\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=9t0w8h)\n___\n ^comment ^will ^disappear ^--- ^40 ^shitposts ^removed ^this ^session ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "I did. My account is pretty green.", "score": 1, "replies": []}]}]}
{"title": "$NVDA Calls thank you for the tendies", "selftext": "[deleted]", "id": "9t0wbz", "created_utc": 1541006820.0, "score": 186, "upvote_ratio": 0.96, "num_comments": 40, "comments": [{"body": "wow fuck you dude", "score": 96, "replies": [{"body": "Username checks out ", "score": 69, "replies": [{"body": "I'll break even on my calls if it hits $270 by January", "score": 17, "replies": [{"body": "Wow rip", "score": 6, "replies": [{"body": "If it gets to $250 by end of November, I'll have a shot of breakeven\n\nThey need to post equal results to Apple for the same quarter and I'll be set", "score": 1, "replies": []}]}]}]}]}, {"body": "NVDA calls challenge initiated. ", "score": 20, "replies": []}, {"body": "positions/strikes?", "score": 18, "replies": [{"body": "10 contracts of a 11/2 $215 Call when $NVDA was at $180. Sold this morning @ $210", "score": 37, "replies": [{"body": "Congratz. Good job bro", "score": 11, "replies": [{"body": "Thanks man. Feels good to be green coming out of this deadly month", "score": 24, "replies": [{"body": "I relate so much to this", "score": 3, "replies": []}, {"body": "Let’s be honest this is mostly right place right time .. love to see your positions on October 1 if they exist (I know they don’t and or they’re very small) ", "score": 2, "replies": []}, {"body": "Yeah this month's recession sucked", "score": 1, "replies": []}]}]}, {"body": "Was gonna say hold to assume your dominance, but your just a bitch.", "score": 6, "replies": []}, {"body": "Damn how much was original cost vs sold cost of contracts?", "score": 2, "replies": []}, {"body": "im new to this investing stuff so if this is a dumb question, i apologize.\n\nif you bought contracts for a $215 call option, when you exercise your option wouldn't you have to buy at 215? How could you sell at 210 and make a profit? Could you eli5 what you did", "score": 2, "replies": [{"body": "If the price of the stock is above the strike price, u keep the difference. If the stock is 220 and u exercise ur 215 contract. Then you basically get to buy the stock at 215 and the shares are worth 220. ", "score": 1, "replies": [{"body": "i understand that part, which is why I don't get how OP made profit. If his strike price was $215, how could he sell at $210?", "score": 1, "replies": [{"body": "Oh lol, you can resell the contract on the market. He bought the contract when the price of the stock was around $180, so he basically bought the contract for pennies at a strike of $215. Fortunately, it made a big movement upwards, now his contract is worth 50% more, so he resold back to the market for someone else to buy it at the current price.", "score": 2, "replies": [{"body": "Ahh, I thought you could only resell the contract when it reaches (or exceeds, in the case of a call) the strike price. ", "score": 4, "replies": [{"body": "That would be if you intend to exercise the contract, you can buy/sell whenever before market close & expiration date as long as there is another person on the other side willing to make that trade", "score": 3, "replies": []}]}, {"body": "Thank you for the clarification. Makes sense. ", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "what about your graveyard of worthless calls/puts? i have a few wins too, but they don't come close to my current and recent nvda losses", "score": 9, "replies": [{"body": "Bought in when $NVDA was at $180", "score": 8, "replies": []}]}, {"body": "SQ is not my friend anymore\nNvidia is my new daddy now. ", "score": 8, "replies": []}, {"body": "I had some 11/9 calls today too but fuck there was a lot of slippage ", "score": 2, "replies": [{"body": "Did you sell", "score": 3, "replies": [{"body": "Yeah I got a nice little gain I sold like 15 minutes after open ", "score": 6, "replies": [{"body": "Better than a loss", "score": 3, "replies": []}]}]}]}, {"body": "Sigh i sold mine yesterday at 10% gains. If I held :(", "score": 2, "replies": []}, {"body": "I made 50% on the Jan 300 I bought already, might go back for more tomorrow. Not sure what % gain I want to sell them at.", "score": 2, "replies": [{"body": "Listen here, take the damn profits. I went from +50% to -99% on my Jan AMD calls in a week. Don't be greedy.", "score": 2, "replies": []}]}, {"body": "You are very welcome!", "score": 1, "replies": []}, {"body": "wtf is up with nvda and semis in general, amd got rektt", "score": 1, "replies": []}, {"body": "I’m down like 8k but Nvidia just brought me back up like 1k but then one of my calls didn’t sell so now I’m scared of Red Thursday.", "score": 1, "replies": []}, {"body": "Didn't want to take a chance with all the recent negative news grats.", "score": 1, "replies": []}, {"body": "Very nice. Wish my TSLA put looked like that. ", "score": 1, "replies": [{"body": "First profitable quarter and elong is using his nutsack to tweet about driving your Tesla like an RC car with your phone.  Rip your put", "score": 1, "replies": []}]}, {"body": "rookie here, what app is this?", "score": 1, "replies": [{"body": "Robinhood for iOS ", "score": 1, "replies": []}]}]}
{"title": "Nvidia DD - Faulty Flagship Cards", "selftext": "Their latest cards are having a bunch of issues reported by users. Browsing /r/nvidia has shown that this issue is more common than normal. As of now, there's only one source covering it, CNET. I have a feeling that once more news outlets pick up this story, the stock won't fare too well (considering the current environment). \n\nCNET Link: \n\n* https://www.cnet.com/news/people-are-reporting-problems-with-their-nvidia-rtx-2080-ti-gpus/\n\nr/Nvidia: \n\n* https://www.reddit.com/r/nvidia/comments/9sysoa/survey_rtx2080ti_is_it_working_for_you/\n* https://www.reddit.com/r/nvidia/comments/9si1ww/nvidia_rtx_2080_ti_graphics_cards_are_dying_in/\n* https://www.reddit.com/r/nvidia/comments/9t1fwc/failing_rtx_2080_ti_source_discovered_its_the/ (top comment saying that Nvidia is using cheap MU memory, **puts on MU too**)\n\nThat's my DD. Nvidia down to $180.", "id": "9t2ngt", "created_utc": 1541018205.0, "score": 27, "upvote_ratio": 0.72, "num_comments": 30, "comments": [{"body": "is this my chance to be the next nvidia shark? eh probably not. calls it is.", "score": 21, "replies": []}, {"body": "Can you imagine what the stock market would be like if a company's stock price went down hard every time a small number of customers complained about a product?\n\nEvery stock would be red all the time. People love to complain. The media loves to report negative news. \n\nCompanies produce millions of products, and have millions of customers. Manufacturing does not have a 0% error rate - there will always be complaints. \n\nAND there will always be these shit clickbait news sites that LOVE to spit out low-effort 2 paragraph articles throughout the day that will convince idiots to click on it. Doesn't matter how big or small, or how true or false or newsworthy a problem really is when the goal is volume. How many articles has CNET published today? 50? 100? 500? Check it out. \n\nWhat I find weird and somewhat funny is 1) you bagholders keep clicking on these articles (CNET? Really?) 2) It appears you think EVERY SINGLE NEWS STORY YOU READ is going to move the stock (fucking nuts guys, get your shit together) 3) You come on here and shitpost and embarrass yourselves (this part I like and enjoy reading, keep it up please). \n\nCurious how did you get $180? What's the failure rate on these chips actually estimated at? If it's close to 15% then you may be right. \n\n\n\n\n", "score": 43, "replies": [{"body": "Yeah dude, as an engineer who's shipped millions of products, this is just how things go\n\nYou ship a million consumer devices, you're going to get at least 1000 customers with screwed up units.  Nowadays, they're going to congregate on Reddit or Facebook or somewhere and raise a huge shitstorm over it too.\n\nThe only way to prevent it is to use components with a zero failure rate/low tolerance, but those cost an order of magnitude more than normal electronics.  That's why everything in a hospital or an airplane is so fucking expensive, the parts all cost 50x as much because people would rather pay up front than have something break down in a critical moment.\n\nUnless people want to fork over $60,000+ for a graphics card on a 10 year upgrade cycle, they're just going to live with the possibility that they might need to send it back for a replacement/refund\n\nPresumably, NVidia and their retail partners are going to handle replacements smoothly since this is a regular occurrence.  I wouldn't buy any puts unless they tell their customers to fuck off and people start doing chargebacks en-masse and/or a class action lawsuit", "score": 19, "replies": []}, {"body": "this guy NVDAs", "score": 19, "replies": []}, {"body": "Same with Apple, always a ton of 'it's flawed' articles that amount to nothing", "score": 5, "replies": [{"body": "CALLS IT IS ", "score": 1, "replies": []}]}]}, {"body": "shit and you toss this up after market close? a lot can happen in 17 hours\n\ni have no idea if 4% rate is bad or good in that sample size tho heh", "score": 37, "replies": [{"body": "These reports came out monday", "score": 23, "replies": [{"body": "Yep. I'm surprised hit pieces aren't out yet.", "score": 13, "replies": [{"body": "That's cause big money scooped up massive shares at 180. This a minor issues considering their profit margins on these cards are probably 70% and if you want the best there is nothing on the market remotely comparable. First run of these cards can be susceptible to this type of malfunction and should be worked out in follow up production.", "score": 16, "replies": [{"body": "under $200 was a gift", "score": 7, "replies": []}]}, {"body": "Tweet this to Andrew Left ", "score": 5, "replies": [{"body": "Andrew Left probably covered by now.", "score": 5, "replies": []}, {"body": "He's actually been killing it lately. Short NVDA and ABBV and long TSLA before earnings", "score": 2, "replies": [{"body": "Yeah I actually want to buy calls when hitpiece comes out then recover.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Late. I’m docking you -10%.", "score": 8, "replies": []}, {"body": "Well I think we need to consider their growth markets more than their base market at the moment.\n\n&#x200B;\n\n  \nHere is my insider insight. I use v100s for deep learning. Amazon keeps running out of capacity on AWS, literally not a single v100 card available. Amazon cannot buy enough to meet demand. My friend down the street his company bought 8 v100s. My employer is buying product from NVDA. NVDA is setting the table on Mars waiting for Elon to show up.", "score": 14, "replies": []}, {"body": "Nvidia could have jensen huang drive around to every nvidia customers house and take a huge steaming shit on their cars and then ring their doorbells and they would still spend $1200 for 190fps instead of 150fps. Nvidia pulls this kind of crap every couple years and by the end of the month everyone just forgets about it and keeps buying their GPUs. Long NVDA", "score": 12, "replies": []}, {"body": "The amount of damage control within this thread is a contrarian signal.", "score": 6, "replies": []}, {"body": "Please oh god, go down before Friday ends", "score": 3, "replies": [{"body": "It's gonna gap down tomorrow no worries.", "score": 2, "replies": []}]}, {"body": "New tech with thiusands of sold units always has issues.", "score": 3, "replies": []}, {"body": "If you think professionals dont already know this youre even more autistic than you look (very)", "score": 2, "replies": [{"body": "My mum told me to stay away from people like you (meany). ", "score": 7, "replies": [{"body": "But you are people like him (autistic)", "score": 3, "replies": []}]}]}, {"body": "This is old news bro. Also people bitching on Reddit doesn't mean shit.  Also..\n\nThe reviews for rtx gpu's in Amazon don't really mention none of this bullshit, everything looks fine\n\nThe only solid information in the story was that people aren't getting their RMA back because the 2080ti is completely out of stock.... This to me screams sold out. \n\nLong NVDA", "score": 2, "replies": []}, {"body": "monopoly companies are nice   \n\nPeople don't even bother with AMD for compute because CUDA is so much better.   Do better DD this was a known issue Monday.", "score": 2, "replies": []}, {"body": "Gonna be red as fuck tomorrow SPY puts son.", "score": 2, "replies": []}, {"body": "Prayers to people shorting this stock long term. ", "score": 1, "replies": []}]}
