{"title": "The wheel went over me!!!", "selftext": "Tried the “wheel” strategy on Apple, (did not mind owning it at the time) \nSold a naked put when stock was in mid 170’s. Break even $170. \nApparently got away from me and now Apple at $140 or so. Now, I don’t want to get assigned at this point and tie up $17k. \n\nIm thinking of Keep rolling for a super tiny credit, plus maybe sell $170 calls at the same time for some pennies. Trying to buy time I guess. \n\nDo I have any other options? Anyone been there? \n\nEdit: really appreciate all the suggestions n feedback, even the eye rolls. :)\nNew to options and this is only one of the lessons I’m learning. \nThank you all. ", "id": "accoy8", "created_utc": 1546564294.0, "score": 36, "upvote_ratio": 0.86, "num_comments": 30, "comments": [{"body": "Firstly, if you want to trade the wheel, you should go into every trade assuming you're going to get assigned, and TRULY not mind getting assigned. The fact that you're feeling queasy and changing your mind now suggests you're not as comfortable as you thought you were. \n\nThat said, rolling an option this deep ITM may work for awhile, but not forever. Eventually someone will assign you the stock. \n\nI do not recommend turning this into a $170 straddle. If for whatever reason there's enough positive news for AAPL to shoot past that, and then you're going to be short stock. \n\nBtw, I'm short $182.50 Jan expiration, I'm going to roll it until I get assigned, then sell calls against it (if I can, call premium might be too thin if it stays where it is or goes lower).", "score": 48, "replies": [{"body": "I agree with darth, you should go into every wheel trade with the expectation you will own the stock. \n\nWith that said keep rolling and AAPL will not stay down long.  We've been here before on this volatile stock (another broken wheel guideline to trade stable steady stocks) and it will come back up.\n\nKeep rolling for a credit and see if you can drop down in strike price along the way, calculate and keep track of your net stock cost and be aware it can move up fast so be ready to roll your calls up.  Once you get above the net stock cost you can decide if you want to let it go or keep milking it for more premium.\n\nI think selling calls is the wrong thing as well.  If I did anything I would sell more CSPs (once the stock stabilizes) to juice returns and lower the stock cost faster, but be ready to take assignment of another 100 shares if need be.  \n\nWon't surprise me if you do not get assigned if you can keep rolling for a credit to keep the extrinsic value up and DTE out a month or more.  Keep in mind the stock drop was a knee jerk reaction to some bad news, let's see if the market has a short memory when some good news comes along . . .", "score": 14, "replies": []}, {"body": "I’m always do credit spreads, this was a rouge one that I did not think too much about regarding different outcomes. You are correct there. This one took me by surprise. \n\n Makes sense regarding straddle. Rolling it is. ", "score": 7, "replies": [{"body": "If it makes you feel better I sold naked AAPL puts back at 210 with the mind set of \"I don't mind owning Apple\".  My first options trade in my retirement account.....\n\n&#x200B;\n\nAfter rolling down a few times I could not longer roll for a credit and was thankful when I got an early assignment (basically a free gift of theta).   Now that I own AAPL if feel a bit less stressed out and and am okay just selling calls until they get called away.    I am slowing chipping away at my loss and think I will be at break even or profit in about 10 months which is not great but certainly better than just holding AAPL the whole time with a cost basis of 210.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;", "score": 3, "replies": [{"body": "What is your strike for selling calls? and what kind of premium are we talking about? Monthly? \nThx. ", "score": 1, "replies": [{"body": "Thats a good question.  I was using OptionPlay.com to mess around with different strikes and calls and trying to maximize the annual return with a 72-75% probability of profit.  The most recent call I sold was yesterday - the January 25  $152.50 strike for a 2.15 premium.  \n\nNot sure if there is a better way to do this (find the  highest profitable calls for a certain PoP)?\n", "score": 2, "replies": []}]}]}]}, {"body": "Same here. I’m short the $185 Jan expiration and will just roll every month about a week before expiration until I get assigned or the stock recovers. Still great cash flow, so I’m not worried about AAPL going down further.", "score": 2, "replies": []}]}, {"body": "An additional thought to consider:  A good conservative rule of thumb is to not have more than 5% of your account at risk in a position.  If $17,000 is more than 5% of your total account, you probably shouldn't have been in AAPL to begin with.  That's fine if your risk tolerance is higher, but then, this question wouldn't come up quite the way it did if it really was.  If this represented only a max 5% hit to your account, tying up $17K wouldn't be much of a concern.    \n\n\nNot doing this is why OptionSellers is no more.", "score": 12, "replies": [{"body": "This is a great post!\n\nNever enter a position where you will stress, or worse have it impact your account negatively if it goes wrong, as they will go wrong!  The 5% rule is good as you can take the loss and live to trade another day.", "score": 3, "replies": []}]}, {"body": "You can sell very far out $170 calls for good money.", "score": 4, "replies": []}, {"body": "> (did not mind owning it at the time) [...] I don’t want to get assigned at this point and tie up $17k.\n\nYou do realize this makes no sense, right? If you \"don't mind\" owning the stock, it means specifically that you are comfortable with tying up whatever amount of cash in case you get assigned.\n\nWhat's happening here is pretty simple: you were not fully aware of -- or at least not willing to fully accept -- the risks in the trade. The trade went (very strongly!) against you. Why insist on it? Why try to make pennies on top of a big loss, while risking greatly increasing your loss?\n\nYour best alternatively is likely to close the trade, and then spend some time figuring out what part of your risk analysis went wrong before you placed the trade -- you either didn't know about the risks, or you didn't know your risk tolerance.", "score": 10, "replies": []}, {"body": "If it’s any help, I sold an Iron Condor on NFLX the day before it’s price plummeted back in October. Shot right through my short put. Luckily, I was able to roll that put spread down and out *twice* each time for a credit (essentially got paid to reduce my exposure). Yes, I had to lengthen the duration of my trade and widen my spread, but eventually my short strike got so low, NFLX stopped challenging it after the October slump. Now, I didn’t really make any money off this trade, but I was able to turn a definite $600 loss into a breakeven trade, so I felt like a bad ass. So, yeah, keep rolling it down and out, but only if you can do so for a credit. The bonus is that constantly extending out the expiration date will reduce the chances of your put being exercised (since there’s still so much time value left in it). Good luck!", "score": 6, "replies": []}, {"body": "What’s the expiration on it?", "score": 3, "replies": []}, {"body": "Today with the stock up a bit, I was able to roll it to Feb exp with a credit of $0.95. ", "score": 3, "replies": [{"body": "Keep at it!  Your break even just went down nearly another buck!  You should be in the $160's, and the stock is moving towards $150, wouldn't be too surprising if it moved up $10 over the next few weeks.  \n\nER is coming up and with the bad news already out any good news could move it up.  At least I can't see it moving down much more, but who knows.", "score": 2, "replies": []}]}, {"body": "why do you say you will get tied up? if you get assigned, just sell immediately?\n\ni don't understand 'rolling'. Everyone does it, but it is just closing a bad position and opening another even worse (further out expiration). What if apple goes down further in the next few weeks? You would be down much much more. Only do it if you think apple will cycle back up. ", "score": 4, "replies": [{"body": "The intention of rolling is to force the market to hit another extreme again. If fundamentally, the stock did not deserve that drop or rise, its more likely to revert to the mean gain or loss %", "score": 3, "replies": []}, {"body": "Rolling can work, to wait for the stock to swing by in price, and if done for a credit each time, pays for the use of the trader's capital.  \n\nI don't think AAPL is going up any time soon, but this does not have to be a loss to the trader.", "score": 2, "replies": []}]}, {"body": "Going forward, you may want to only try the wheel on stocks where you can afford to \"tie up\" the capital for awhile in case this happens again.  $17k is a decent-sized chunk for many portfolios.  There are plenty of stocks trading between $10-60/share that may be better choices.  \n\n", "score": 3, "replies": [{"body": "Correct, the right course of action is to hold the stock and sell covered calls against it. If you have to long date, then long date it. With AAPL, the PE is low enough that its actually fair price, just hold it, if it drops rapidly, buy to close your CC and do it again while IV is high.\n\nThis exact scenario happened to me on spy. I sold some 270's and it plummeted to 240's when i took assignment. I had to open CC's 3 times (buying to close when i hit 20-30% profit) until i was in a no loss scenario. Now my cost basis is 261 and my CC contract+premium is 262 meaning that im mathematically in a no loss scenario. twice I had to roll my CC further out to make sure i can capture drops.", "score": 2, "replies": []}]}, {"body": "Oh wheely?  \nEdit: now you just have to sell calls until 2022 to break even. ", "score": 2, "replies": [{"body": "I hope not until 2022 but certainly a possibility.", "score": 1, "replies": []}]}, {"body": "I just came here to say that you missed the opportunity to title this post, “Broken on the Wheel”.", "score": 4, "replies": [{"body": "Shit could have been medieval", "score": 1, "replies": []}]}, {"body": "If you don’t like the position get out. Apple could definitely go down for a long time. It’s just the start of the bear.", "score": 2, "replies": [{"body": "Finally someone who one what's going to happen. Thanks for sharing. ", "score": 1, "replies": []}]}, {"body": "Originally Dec expiry, rolled it to Jan. ", "score": 1, "replies": [{"body": "What specifically did you do here? I don’t quite understand how you rolled a position you were deeply down on for a credit. ", "score": 1, "replies": [{"body": "Probably only dropped the strike a very small amount if at all.", "score": 1, "replies": []}, {"body": "I was able to roll the Dec exp to Jan for a credit of $0.55 without changing the strikes. Guess it was not as deep in the money that particular day. ", "score": 1, "replies": []}]}]}]}
{"title": "First Trade Worked! 6% in 3 Days", "selftext": "First Trade: $TXN Call Bear Spread (sell @ 105) (buy @ 110) with 25 Jan Exp for .41 a contract. I bought on Monday DEC 31 and sold Jan 3 for .12 a contract or 6% profit. \n\nIt’s not much but if I can continue this and get 6% a month then I’ll double all the money I put towards credit spreads every year with VERY little risk.\n\nSee Previous Post for Rules and Strategy: https://www.reddit.com/r/options/comments/a8ljfj/my_googl_995_put_spread_expired_atm_and_now_i/?st=JQHED5JO&sh=c23515b3\n\nNext Trade: $BA Call Bear Spread (sell @ 365) (buy @ 370) 15 Feb Exp for .37 a contract and sell for .11\n\nNote: 15 Feb is over 30 days away which adds risk to the trade. I would like to hold out sit on my 6% earned for the month and see but I might just put a order for the trade Friday anyways.", "id": "acdehq", "created_utc": 1546568950.0, "score": 12, "upvote_ratio": 0.7, "num_comments": 19, "comments": [{"body": "[deleted]", "score": 19, "replies": [{"body": "New to options, can you explain how OP is risking $459? I  thought buying options had little risk. ", "score": -12, "replies": [{"body": "$5 wide spread of which OP collected $0.41 equals $4.59. ", "score": 6, "replies": []}, {"body": "Oh no", "score": 15, "replies": []}, {"body": "Oh, my sweet, summer child.......", "score": 9, "replies": [{"body": "We get it, you watch Game of Thrones.", "score": 3, "replies": []}]}]}]}, {"body": "Famous last words:\n\n> I’ll double all the money I put towards credit spreads every year with VERY little risk.\n\nDo you realize the amount of risk you are taking with your strategy? You are risking ~460 to make ~30. In other words, if you lose one single time, it will wipe out 15 (FIFTEEN!) winners. In yet other words, one loss will mean 1.25 years of wasted effort and money. If you lose once *before* winning 15 times (which is more likely than only losing after winning 15 times), then not only you'll have wasted time and money, your account could get in a pretty bad shape.\n\n\"Double the money\" and \"very little risk\" aren't supposed to go together. Ever. If you think they do, then you are probably ignoring risks.\n\n\n", "score": 14, "replies": []}, {"body": "This is a strategy that can easily go wrong. You say \"VERY little risk\" but yet in a trade, you are risking $459 to collect $41 in premium....  \n\n\nSure the odds are low on losing the $459 but all it takes is that one odd time to wipe out 11 trades and I know the odds in a volatile market of something happening like this are greater than you may hope. There could be an unexpected buyout/merger, flash crash, dividend announcement, major news event, earnings reports etc all that can easily make you lose maximum loss on the trade.  \n\n\n  \nFor the future, I'm not saying this strategy can't work but please do more research on the company itself that you are going to use these spreads on and make sure you are up-to-date on macroeconomics events and their impact on the company's stock price.. ", "score": 12, "replies": [{"body": "Thanks for the info! Seriously. I’m actually hoping a trade goes the other way so that I can try and develop some kind of system (better than what I have) at minimizing loss.", "score": 1, "replies": []}]}, {"body": "Don’t expect to get 6% each month.", "score": 9, "replies": [{"body": "6% monthly is a huge return. It's pure gambling in my opinion.\n\nI would be very happy if I would get 1.6% monthly in a sustainable fashion.", "score": 2, "replies": [{"body": "Weekly covered calls/the wheel can achieve that 1.6% monthly long term. Only do it with stock you’re interested in holding for the long term as well.", "score": 1, "replies": []}]}]}, {"body": "Keep it up! I started selling premium with spreads on Dec 3rd and made 21% profit by dec 24th. Oh yeah and then the market went up 1000 points and I started to bleed my profit until I was down 50% lol. \n\nFinally today I was able to breakeven again to where I was on dec 3rd but lemme tell you, this volatile market anything can happen and I made sure I was risking less then my potential gain and still took a pretty hefty loss each day my trades didn’t work out.\n\nBe careful risking more for less potential profit, the market is too unpredictable.", "score": 3, "replies": []}, {"body": "A low probability of ruin is not a low risk. Low risk is risking a small amount of capital.  Unless 400 dollars is about .5% of your portfolio this is not low risk. And if it is, then why even do the trade for such a small amount?\n\nNo.\n\n", "score": 4, "replies": [{"body": "Ending with “No.” is not necessary. I agree with everything else though ", "score": 1, "replies": []}]}, {"body": "Great kid! Don't get cocky.", "score": 2, "replies": []}, {"body": "!remindme 2 months when OP loses all of his/her money", "score": 2, "replies": [{"body": "I will be messaging you on [**2019-03-04 14:26:17 UTC**](http://www.wolframalpha.com/input/?i=2019-03-04 14:26:17 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/options/comments/acdehq/first_trade_worked_6_in_3_days/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/options/comments/acdehq/first_trade_worked_6_in_3_days/]%0A%0ARemindMe!  2 months when OP loses all of his/her money) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! ed84kg9)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "don't forget, earnings are at the end of January -- IV is likely going to increase.  have you thought of having it expire before then?  earnings can also be such a gamble sometimes.", "score": 1, "replies": []}, {"body": "Placing a longer DTE spread (over 30 days) will actually be less risky than the previous spread (25 DTE) because of gamma risk.\n\nCongrats with TXN, I like the spread you have picked out for BA as well hope it goes well.", "score": 1, "replies": []}]}
{"title": "NFLX 240 put expiring 2/15. Be patient or dump?", "selftext": "", "id": "acj1f6", "created_utc": 1546614764.0, "score": 2, "upvote_ratio": 0.56, "num_comments": 23, "comments": [{"body": "I'm a little baffled on how NFLX continues to outperform everything including AMZN, GOOGL, etc.  this was supposed to be the weakest of the FAANG stocks.  Instead we got some mediocre news on that sandra bullock movie and now everyone thinks NFLX is the strongest FAANG stock.  If we are truly in a bear market I don't think $284 and rising price (Up 5%  again so far today) is going to stick.  Then again, who said the markets had to follow any type of logic?  What should I do here, just get my shitty $830 back or hold it for at least a few more weeks?", "score": 9, "replies": [{"body": "My opinion is more unemployed == more subscribers.  \nIf i were unemployed, @ 10-15$/ month Netflix would be at the bottom of the 'expenses to cut' list.   \n", "score": 3, "replies": []}, {"body": "Why are you baffled? They probably have some of the best growth prospects out of all of the FAANG stocks. Google, FB, AMZN, and Apple have all probably come pretty close to market saturation. Netflix hasn't even come close, and they're consistently growing revenues and margins. They actually reported a really decent quarter in Q3, but unfortunately it was amid the first brutal leg of the selloff in October.\n\nGranted, the multiples on this thing are outrageous, and it makes very little sense to me from a fundamental valuation perspective. Although markets can stay irrational longer than you can stay solvent.\n\nRegardless, there are a couple things you can do:\n\n* Has your fundamental view of the stock changed? If so, then you should look to exit on the next down day, or possibly flip it into a short put spread to try and recover some of your capital.\n* If not, then you can hold on a little longer (theta really starts to bite about 3 weeks to expiration), or look to roll it out and down.\n* If you still believe NFLX will go lower by Feb but you're unsure about the near term, you can sell the Jan 18 240 put against it to turn it into a calendar to reduce your cost basis, then look for a better exit after the Jan put expires.\n\n&#x200B;", "score": 3, "replies": [{"body": "Looks like NFLX bounced off new big resistance point at $208 today, and aiming higher.  At this point, now that the put is only worth $320 I'm thinking of using it to hedge on a buy position.  Is there a way to calculate the ideal number of shares to buy at a certain price point, using the put to insure against loss?  I know I'm probably doing the whole process backwards; buy shares first then cover with a put, but I'm it might be possible to do it the other way around.  Shares are $319 now ", "score": 1, "replies": []}]}, {"body": "cut losses quick and you'll always be better off. Can't risk it, especially in this ridiculous market", "score": 4, "replies": []}]}, {"body": "If you are still holding on, sell it on Wednesday when the trade deficit numbers come out.", "score": 2, "replies": [{"body": "Didn't sell yet but it was super tempting.  Still in denial about the 9% gain today while amzn,googl,appl, all less than 5%.  a gain of 15% in two days doesn't seem sustainable in the short term.  \n", "score": 3, "replies": []}]}, {"body": "Your rationale is sound but you forgot that the Fed has a mandate to \"listen attentively to markets\" and garbage like Netflix thrives when people believe this is a bull market. It is clear to me that people that just got their tax returns have been dying to buy Netflix, and I'm not willing to die on that hill fighting against them. If you still want Netflix downside, sell that put, buy a slightly OTM put debit spread for earnings week (probably 290/280), which should pay about 150% if you are right. ", "score": 2, "replies": []}, {"body": "I would be very careful.  \n\n&#x200B;\n\nThis came out last day or so.\n\n&#x200B;\n\n[https://www.cnbc.com/2019/01/04/goldman-says-netflix-is-one-of-its-favorite-trades-for-2019.html](https://www.cnbc.com/2019/01/04/goldman-says-netflix-is-one-of-its-favorite-trades-for-2019.html)\n\nNot that I agree or disagree with the GS call. \n\n&#x200B;\n\nIf there's 50% chance your put is going to 0.  Why hold for much longer.  \n\n&#x200B;", "score": 2, "replies": [{"body": "Yeah I find it interesting that NFLX is now being touted as the bread winner of FAANG, despite disney now entering direct competition with them, resulting in netflix cancelling all of their MARVEL properties.  Perhaps 2/15 is not nearly far out enough yet for this to be even considered by the masses.  I think Netflix probably did really well on this upcoming quarter, the Disney war may take a few years to play out.\n", "score": 1, "replies": []}]}, {"body": "i have a bear call spread 250/251 expiring the 18th that i'm now worried about. should i dump, take the loss, and roll out and up? i'm worried about being assigned. ", "score": 1, "replies": [{"body": "On NFLX?", "score": 1, "replies": [{"body": "excuse me, that's my crappy SPY position. I meant 290/295. ", "score": 1, "replies": []}]}]}, {"body": "What you SHOULD do is not buy puts after the major price moves have already taken place, but perhaps that's a different conversation.\n\nOwning puts require that you get time, direction, and magnitude correct.   I'm not convinced any of them will be right with Netflix at current levels, so I'd say dump it.", "score": 1, "replies": [{"body": "His put isn’t naked, naked would be short a put with no physical stock to back it up ", "score": 1, "replies": [{"body": "Brain farted.   Fixed it.   Thx.", "score": 2, "replies": [{"body": "Lmao at this post aging tho. Netflix surging 10% ", "score": 3, "replies": []}]}]}]}, {"body": "LMAO, have fun buddy, cuz everyone doesnt watch netflix, 130 million subscribers. 91%retainage rate of users. Thats the hardest, and most expensive part of having subscribers, have fun losing all your money.", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Just though of something to put how valuable data is, so trump was a failing business man but marketed an image of wealth and success, got a tv show and so on, attracting people to his brand from what people perceive as success. Going into the presidential election Jared kushner was a big data guy and would pay for research on areas and that’s why trump would make slightly different points in different areas. The data is what essentially allowed them to market themselves to people who would not have voted for establishment people on either side. So through targeted marketing to different markets, it allowed him to rant his way to the presidency. How valuable is owning that?", "score": 2, "replies": []}, {"body": "You know that Netflix records expenses as they spend them, so they have spent money on stuff through 2020 already", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Netflix reports costs as their spent, so whenever they spend something in production it’s recorded. So while you say their costs are rising, I’d say they have a bunch of content that they have already spent their money on and we haven’t even seen it yet.\n\n", "score": 1, "replies": []}]}]}]}, {"body": "Your comment is so edgey...\nWhat about their current valuation?", "score": 2, "replies": [{"body": "Fag", "score": 2, "replies": []}]}]}]}
{"title": "The wall that Trump should be focusing on is Wall Street", "selftext": "Trump tariffs are badly hurting the U.S. economy.  Apple's warning on revenues is just the latest evidence.\n\n", "id": "acekm7", "created_utc": 1546576996.0, "score": 4, "upvote_ratio": 0.54, "num_comments": 28, "comments": [{"body": "Maybe Apple could be seeing less revenue because there phones are overpriced and borderline priced as a luxury brand  ? Imagine that ? Admittedly, I didn’t read there report the other day so I could be wrong but many people in my life who have always upgraded to the next phone think this time it’s way over priced with not that many features for them to want to upgrade. Yes trump is a complete Lunatic and deserves blame for many things but I’m really tired of the it’s all Trumps fault bullshit and no other factors apply.  ", "score": 7, "replies": [{"body": "I agree, Trump is an idiot but Apple problems are their own. I was a loyal customer till they started doing things I didn’t like (ex: removing the headphone jack for no legitimate reason and slowing down the older models to force upgrades). Then they raised the prices on their phones to unrealistic prices without the software and technology to back it up. Not to mention they are suppose to get rid of iTunes this year which is also a negative for me. I think their bad ideas are catching up to them. ", "score": 1, "replies": []}]}, {"body": "I mean this a stupid post. This is just some guy who wants to push his political agenda. Random post with no real meaning. \n\nThanks for your opinion ", "score": 7, "replies": [{"body": "Yup and because he wants to agenda push with no real substance he gets a downvote from me chief. ", "score": 5, "replies": []}]}, {"body": "Think about the long term. ", "score": 4, "replies": [{"body": "Yeah, not having 20 million people in this country not paying taxes and abusing the entitlement programs. ", "score": 6, "replies": [{"body": "Immigration is a different story. What I’m talking about is the complicity of globalists to allow China to impose tariffs on US imports while have no tariffs on its exports. AND allowing China to steal IP with no repercussions. People may not like trump but at least he is consistent on a level playing field and fairness. Same with Europe not paying for NATO. ", "score": 6, "replies": []}]}]}, {"body": "Lol yea focus on the corrupt inside traders. Instead of protecting a vicious southern border that’s next to a shit load of Mexican criminals...???  The economy is broken, Wall Street doomed.", "score": 3, "replies": []}, {"body": "Ha. I see what you did there. ", "score": 1, "replies": []}, {"body": "*cries in liberal*\nOrange man bad.", "score": -1, "replies": [{"body": "Comment of the year. ", "score": 2, "replies": []}, {"body": "buttery male looking for more butter.", "score": 1, "replies": [{"body": "What's that", "score": 0, "replies": [{"body": "Keep up, gumby.", "score": 0, "replies": [{"body": "I don't speak your slang Sir, I am sorry.", "score": 0, "replies": [{"body": "Sorry is right.", "score": 2, "replies": []}]}]}]}]}, {"body": "Or maybe OP is just acknowledging the fact that trump has made multiple decisions that have negatively affected the market.", "score": -1, "replies": [{"body": "Can you name a few of them for me", "score": -2, "replies": [{"body": "Mostly China tariffs, stupid tweets about the fed and China and many other topics. Also, he is withdrawing from free trade agreements around the world. At least he lowered corporate taxes, that was good. ", "score": -1, "replies": [{"body": "Eh? Do you invest like at all? It sounds like things that make stupid people sell.", "score": -2, "replies": [{"body": "Oh I agree that it’s all temporary and in the long term doesn’t matter, it’s just sucks having clients constantly asking why this went down or why that stock tumbled. ", "score": 0, "replies": [{"body": "have you been watching the markets since he got elected? The DOW was at 18000, people said it would never hit 20000", "score": 2, "replies": [{"body": "> have you been watching the markets since he got elected?\n\n\nHave  you watched the markets at all?\n\n\nThey always say it will never hit xx,xxxx  all the time.  The actual number makes no difference.\n\n\nIf you haven't noticed the DJA is up over 740% since 1985.   Trump has only been president for 2 years.\n\n\nIf you look at the first 2 years Obama was president the DJA increased 35%, Trump 15%.  \n\n\nAlso, the DJA is a poor indicator of the US economy.  Total market index more resembles SPX which increased 43% in the first 2 years of Obama, Trump 8%.  \n\n", "score": 1, "replies": [{"body": "well the DOW was at 18000 when he got elected. a 3600 point move is 20% which is 21600. Even with the sell off we are 1000 above that. how did you get 15%? quick mathz?\n\nlmao the SPX was just under 2000 when he got elected. Again, even with the recent selloff, we are above 20%.... \n\nDid you just make those numbers up?", "score": 3, "replies": [{"body": "> well the DOW was at 18000 when he got elected. a 3600 point\n\n\nYou mean similar to 2013.  \n\n\nMy mistake I used DJA instead of DJI.  Again, compare Total Market Indexes not the top 30 for a better comparison.  The broader the index the better the economy. \n\n\nAlso, I used during his presidency.   After his election is hype, during his presidency are his policies.\n\n\nThe Nifty 50 NSEI has out paced the DJI and SPX over the past 2 years.  None of the companies listed in the index are are US based.\n\n", "score": 1, "replies": []}]}, {"body": "hello??", "score": 1, "replies": []}, {"body": "lmfao, i see you", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Instead of only thinking about your gains in the next month, you should think about your gains over the next several years. Bringing more jobs back to the USA and eliminating cheap illegal alien labor will raise wages and increase consumer spending.\n", "score": 1, "replies": []}]}
{"title": "Tesla's Q4 forecast. Profitable again", "selftext": "Hey guys I wanted your thoughts on Tesla's Q4 forecast. For reference, I have made a video estimating my own.\n\n&#x200B;\n\n[https://www.youtube.com/watch?v=ur9jL9J131I](https://www.youtube.com/watch?v=ur9jL9J131I)", "id": "acj12p", "created_utc": 1546614708.0, "score": 146, "upvote_ratio": 0.93, "num_comments": 25, "comments": [{"body": "$2.01 would be a heck of a quarter, i really like the detail and time you put into making the spreadsheet. If you put this much time into more value stocks you could do very well buying options before earnings announcements.  ", "score": 35, "replies": [{"body": "@themarketisopen and @phools Any recommendations on material for understanding options?", "score": 3, "replies": []}]}, {"body": "Id love it if you could also do something about Apple", "score": 5, "replies": [{"body": "Thanks! we just finished one on Netflix actually. The more people view these videos, the more we can spend time making them. Thanks for enjoying", "score": 10, "replies": []}]}, {"body": "Given that some of the accounting gymnastics that they used in Q3 could only be used once, I think we're in for an interesting earnings report. Plus, there was a huge 3,000 cars sold but not delivered in Q3, so it'd be interesting to see what happens to that number as well.\n\n&#x200B;\n\nThe reports on current inventory level is a little concerning. Overall optimistic on Q4 earnings. ", "score": 3, "replies": [{"body": "I don't think Q3 was such a stretch. I only saw a Wall Street Journal article mention gymnastics. the WSJ Said \"Tesla booked $189.5 million in credit revenue in the quarter, an unusually high result. Tesla had booked a total of about $135 million in the first two quarters of the year. These credits are almost pure profit for Tesla.\" https://www.wsj.com/articles/how-tesla-made-a-record-profit-1541436774\n\nSo basically the WSJ is whining about an extra $130 M of profit. This still would put Tesla firmly in the black at $190M of profit.\n\n", "score": 2, "replies": [{"body": "The issue is that those credits, like mentioned is unusually high. Also unsustainable. The credits could disappear at any time. Investors just wanted to see that they can make money just selling cars without sneaky accounting... \n\n&#x200B;\n\nThat being said, I'm still optimistic about Q4 profits... ", "score": 5, "replies": [{"body": "I agree, I also don't like government support either. The thing is even if you back it all out the company still made $311M - 190M", "score": 2, "replies": []}]}]}]}, {"body": "A quarterly report for Apple means a a lot more than a quarterly report for Tesla.  I guess you don’t understand the concept, good luck.", "score": 2, "replies": []}, {"body": "Nice analysis. Hope to see you discuss some value stocks at some point too", "score": 1, "replies": []}, {"body": "Perhaps he will lie again on Q4 and it’ll spike again!", "score": -2, "replies": []}, {"body": "Their CEO lied on twitter about raising money and about taking the company private. There's a criminal probe going on related to lying about their last Model 3 sales numbers. Their CEO is being sued for defamation because he called someone who called him out for a bullshit publicity stunt a pedophile. This is a pathological liar and an egomaniac - why are you trusting any forecast that comes out of Tesla? \n\nEDIT: Lotta real gullible weirdos showing up in the replies. I guess people like being lied to on twitter these days? ", "score": -13, "replies": [{"body": "Thank you for taking the karma hit to post this, the replies are absolute Cult of Tesla gold. You did us all a service by supplying comedy on this level.", "score": 5, "replies": []}, {"body": "How much did you lose on shorting it? ", "score": 3, "replies": [{"body": "The share price is still down $60 since the \"Funding secured\" lie tweet - your question doesn't even make sense.", "score": 13, "replies": [{"body": "They're so brainwashed that they think if you're not constantly cumming to the thought of Tesla then you must be short, there's absolutely no other possible explanation. ", "score": 4, "replies": []}]}]}, {"body": "That's like saying \"Elon said he was going to get me extra ketchup for my fries, but didn't, why do you trust he pays his taxes?", "score": -8, "replies": [{"body": "Not that much like it.", "score": 5, "replies": []}]}, {"body": "What are your thoughts on Edison?", "score": -5, "replies": []}]}, {"body": "If you are buying or selling Tesla based on any particular quarterly earnings you fundamentally misunderstand what it’s current market value implies and has priced into its future and you should not be making this bet.", "score": -1, "replies": [{"body": "you could say the same thing with any stock. A current quarterly reports means very little. It only means something if the current quarter is indicative of future trends.", "score": 2, "replies": [{"body": "When NVDA said in the last quarterly report, “our margins on gaming chips have collapsed but it will get better,” the market said goodbye without waiting to see whether it’s a long-term problem  or not. ", "score": 1, "replies": [{"body": " I never argued stock moves off of quarterly reports are always rational. I simply said a quarterly report only means a lot if something from it affects a longer term forecast.", "score": 1, "replies": []}]}]}]}]}
{"title": "Prediction: Apple to crash in price 50% to $70 in the coming years (detailed analysis)", "selftext": " \n\nSmart phones are about 10 years behind desktop computers in terms of performance. Remember the first iphone in 2007? It was \\~300mhz which was the speed of a pentium2 top-of-the-line desktop computer in 1997. If you look at the numbers you will find that this pattern roughly holds across many variables (memory capacity, gpu performance, cpu performance, etc.) . The first 1ghz CPUs arrived in 2000. First 1ghz smart phone? 2010.\n\n1997->2007 was a period of rapid increases in desktop and laptop capability. Because of the huge speed gains, people rushed to upgrade every 2-3 years triggering huge sales and a boom for many companies like Dell, HP, etc. replacement cycles were very short in this time period. In 1997 it might have been as low as 2 years! This hugely inflated sales numbers.\n\n2007 and 2008 were turning point years for desktop computers. It was clear then that the pace of improvement had slowed way down.\n\nOver time the replacement cycle steadily increased. This really became noticeable in the late 00's around 2009-2010. Computer capability simply was not getting that much better every year by then so replacement cycles skyrocketed. People started holding on to desktops and laptops for 5+ years. This caused the industry to go into decline in 2011 and only recently came out of that.\n\nI believe 2017 and 2018 were turning point years for smart phones. My personal phone (an iphone) was built in 2017 and I really have no plans to upgrade near term. How much better is the new one over a 2017 model? 20%? Is that worth $1000? I used to upgrade my phone yearly.\n\nI think the 10 year difference will hold here. Replacement cycles are going to start skyrocketing and the industry will go into decline for a while just as the PC industry did.\n\nBuying apple here is like buying DELL or HP back in 2009 but without the upside of selling to the corporate and server markets. Dell at least could sell servers to the booming web services economy. Apple is purely consumer.\n\nI suspect Apple is trying to stave off this decline by jacking up prices which they have done in the past year. This might back fire triggering an even faster spike in replacement cycles.\n\nApple could easily fall another 50% from where we are today. Steer the hell away from this name.", "id": "acde4q", "created_utc": 1546568885.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 20, "comments": [{"body": "That would make the market cap at 350Bish. They have 150B in cash alone. People are freaking out that the lowered their revenue guidance to 84B for the QUARTER. \n\nPeople just didn’t decide this year to be holding on to their phones longer they’ve been doing it for years. Their latest iPhones were uninspiring and really made it for the yearly upgraders had no reason to upgrade this cycle. Everyone else will continue on with their 2-3 year cycle as long as they bring something of substance to the next iPhone\n\nThey have plenty of avenues of growth including having the cash to buy any company they want", "score": 9, "replies": []}, {"body": "She had the \"APPLE BOTTOM\" jeans, boots with the fur...☝️Shhh.🤐", "score": 9, "replies": []}, {"body": "Apple's net cash is worth $27 per share on it's own. considering the company still generates a massive amount of cash each year, even if it were to shrink, I don't think they'd reach $70 /share. It's not like they're burning through cash right.", "score": 5, "replies": []}, {"body": "You can post as many threads about this as you want but your analysis is fundamentally wrong\n\nhttps://www.reddit.com/r/investing/comments/acd751/apple_is_going_to_go_into_a_huge_decline_here/?utm_source=reddit-android\n\n\nPeople are buying Apple's operating system which only runs on Apple hardware.  Just like they were doing with Apple computers since the company started.  ", "score": 3, "replies": []}, {"body": "In coming years they will have about $15-20 eps.   So I will backup the truck for Apple at about 6x earnings with a 4% yield ", "score": 2, "replies": []}, {"body": "Retard level right here. I think their low will be 125-130. That will be the bottom. ", "score": 4, "replies": [{"body": "Agree. Ridiculous uneducated post.", "score": 3, "replies": [{"body": "How much are you in the red on Apple?", "score": -1, "replies": [{"body": "I bought Apple (100% of portfolio) at $11 upward and sold at $100-ish and diversified... I’ve spent a lot of time reading about it.\n\nFollow Horace D and Bullish Cross (Andy Zaky) on Twitter if you want real info", "score": 1, "replies": [{"body": "When are you planning to buy back in?", "score": 1, "replies": [{"body": "No plans. I do have a side portfolio where I have a nice amount of Disney at 98.75 and a small amount of SQ at different levels.  My main account is diversified and doing very well.\n\nI diversified because it’s too much money to stress about. For part of my Apple investment I followed it down from $700 where I originally sold (then rebought) to $385 and back up to $100 (basically $700 again).... not fun.\n\nOf course I would have had a great ride to $232 but there’s no way I could have expected that valuation and it was well overpriced.\n\nCheck out Bullish Cross on Twitter.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Great analysis except nope. Your own view is biased because you aren’t taking samples of relevant data. I, for example, have the iPhone X and will likely buy the 2019 model, cash, and intend to upgrade my mom’s iPad, iPhone and get her an Apple Watch lol\n\n\nEdit: you did not state your position so how do we know you’re not just cheering its demise because you’re shorting it.\n\nI am long Apple. ", "score": 4, "replies": []}, {"body": "It has already fell 40% from its peak. 70 may be a bit too much but I do se it hitting double digit in next recession ", "score": 1, "replies": []}, {"body": "I tend to agree but I think AAPL will go to $100.  I'm not touching this stock long or short.", "score": 1, "replies": [{"body": "I can easily see $100", "score": 2, "replies": [{"body": "Yeah, I picked $100 not only because it's a round number but because it was a level that we saw not that long ago for AAPL - I think back in mid-2016.", "score": 1, "replies": []}]}]}, {"body": "In my opinion it is worse then OP says.  However in my opinion as internet speeds get faster we see more computations get diverted to the cloud.  A shitty phone connected to the internet can tap into much faster capabilities in some data center.  I think Apple needs to focus more on surviving that kind of world and invest more in cloud data centers.  Heck I could see myself only upgrading my phone in the future just to be able to watch the next level of video resolution.  And those leaps are pretty infrequent.", "score": 1, "replies": []}, {"body": "70 sounds very drastic, but who knows... it’s possible now that Jobs isn’t around and innovation is stagnant. Apple nowadays seems like a one trick pony. Nothing new besides a few expensiv gee-gaws and luxury items no one really needs imo.", "score": 1, "replies": []}, {"body": "This is an interesting perspective. I kind of like it. But one major difference is that Apple is now in the services business. This segment of their revenue continues to increase yoy. Dell and HP didn’t have this. But I agree that Apple has a lot of headwinds.", "score": -1, "replies": []}]}
{"title": "In a day of ridiculous ‘Apple is doomed’ Hype, another patent reveals Apple is dead serious in Tech Fabric( to be used in clothing and devices), Gaming and Ride hailing technology( to name just a few)", "selftext": "https://www.fastcompany.com/90287049/new-apple-patents-reveal-smart-fabric-and-gaming-ambitions\n\n\n‘This latest one–which was first filed in September 2016–shows just one image, with the title “Fabric,” of what appears to be ridged material; the patent describes the ridges as “contrasting appearance.” This may seem like a one-off diversion for the company, but over the last few years Apple has had a number of fabric-adjacent patents approved.’\n\n“That’s not the only thing on Apple’s design mind either–the company had 43 patents approved this time around, including one that focuses on multiplayer gaming and another that involves ride hailing implementation in Apple Maps.”\n\nYup. The company is so “ failing”\n\nMore evidence that they are looking to go BIG TIME into healthcare related products/services/Paraphernalia.( to say the least) This is in addition to the existing Watch ECG and Healthcare services they are looking to provide in the coming future.\n\nThis is besides the Patent filed for an Apple Glove for AR and VR applications\n\nhttps://appleinsider.com/articles/19/01/03/apple-researching-wearable-glove-input-device-to-simplify-interactions-with-ar-vr/amp/\n\nYeah- ill bet they are not going ANYWHERE. \n\n ", "id": "ace55m", "created_utc": 1546573980.0, "score": 9, "upvote_ratio": 0.72, "num_comments": 23, "comments": [{"body": "Don't worry. iPhone Xt Maxx Ultra Liquid Retina display will drive the masses back to Apple.", "score": 2, "replies": []}, {"body": "Can i buy it? No? Then i don't care. Apple is dead until it releases something innovative that sells. The iPhone will only get Apple so far and time is running out.", "score": -8, "replies": [{"body": "84B in projected revenue. That’s dead huh?", "score": 13, "replies": [{"body": "It's DOOMED! ^^^^^/s", "score": 8, "replies": []}, {"body": "I guess you just don't get it, but that's okay. You probably shouldn't be investing though.", "score": -2, "replies": []}]}, {"body": "My god, I hope you don’t invest with real money. ", "score": 1, "replies": [{"body": "I could say the same for you. You should stick to monopoly money.", "score": 1, "replies": []}]}, {"body": "I agree they won't grow a lot until they release something more innovative, but with 5g coming soon people will be more inclined to upgrade in coming years to get 5g capabilities. They also have a very solid customer base.\n\nSo time is not running out. They aren't going anywhere. ", "score": 1, "replies": []}]}, {"body": "They should have made acquisitions. Netflix, Square, Disney, Adobe...so many great companies. But no, they bought billions worth of their own stock instead.", "score": -5, "replies": [{"body": "Literally give me even one reason why Apple buying Netflix would not be idiotic.", "score": 3, "replies": [{"body": "Apple acquires a library of content that would instantly make it competitive with Amazon.\n\nNetflix adds $10 billion in annual revenue which apple could scale fairly quickly.\n\nThe team at Netflix can help Apple revamp it streaming video product.\n\nThe acquisition would immediately make apple the worlds leading Internet television network with over 90 million members and 190 countries.\n\nApple TV sales could be used by including free Netflix memberships for 6 to 12 months with each new purchase.\n\nI wouldn’t be surprised if Amazon and try to pick it up at some point.\n\nWho do you like better long-term? Amazon or Apple?", "score": 1, "replies": [{"body": "I'm long both AMZN and AAPL but probably Amazon. Why does Apple need to be competitive with Amazon? I think the content for Netflix is going to become too expensive eventually (happening now, imo) so they are forced to keep pumping out hit or miss originals. I just don't see what Apple gets and they should focus on things more in their wheelhouse like wearable tech and maybe vr glasses. Hopefully they get a large market share in China and India too. Apple is a luxury brand name that makes phones so I don't see why it would buy what is basically a production studio now. Before you say Apple music...they don't make the music.", "score": 1, "replies": [{"body": " Don’t get me wrong I would love to see bigger and better tech out of Apple. Better wearables, holograms, 3-D, augmented reality, EV, the list is endless. It pisses me off that they’re spending billions buying back their own stock when they should be making acquisitions or trying new markets. It’s this playing it safe strategy that is tarnishing a brand in my opinion. Tim Cook seems to have no imagination at all.", "score": 1, "replies": []}, {"body": "Also: https://www.washingtonpost.com/technology/2019/01/04/app-store-war-between-netflix-apple-is-heating-up/?utm_term=.b689d5bd1413", "score": 1, "replies": []}]}]}]}]}, {"body": "Lol, what's so great about this \"Tech Fabric\"? What does it even do, do you know? I'm really confused what you're trying to prove with this article. It really seems like you're just grapsing for anything positive about Apple to justify your stake.\n\nBTW, look up Google's Verily. Verily is way more advanced in health applications than anything we've seen from Apple's \"Tech Fabric\".\n\nApple's best chance at innovation and growth is probably the gaming industry with AR applications. But until we see the successful development of a cohesive product that is more attractive than something like the HTC Vive, I definitely would not be betting on the company.", "score": 0, "replies": [{"body": "You do realize Apple has other health products in the works with the apple watch such as glucose monitoring? What has verily produced yet? Same as apple, nothing yet. Actually the apple watch EKG has already saved a couple lives so you can argue they're ahead of Google.\n\n>Apple's best chance at innovation and growth is probably the gaming industry with AR applications. \n\nlmao no. Their best chance at growth is buying Tesla, Disney, or Netflix. Which they can do because they have so much fucking money ", "score": 1, "replies": [{"body": ">Their best chance at growth is buying Tesla, Disney, or Netflix.\n\nSo you're admitting that their best chance of success is acquiring another company and reaping off THEIR success.\n\nYea, definitely not a company I'd want to be invested in LOL.", "score": 0, "replies": [{"body": ">So you're admitting that their best chance of success is acquiring another company and reaping off THEIR success.\n\n\n\nuh... yes? ", "score": 0, "replies": [{"body": "So why the fuck are you buying Apple?\n\nIf Apple needs to acquire a company to stay successful, why not buy those \"successful\" stocks like Disney, Tesla, and Netflix?", "score": 0, "replies": [{"body": "holy shit u r fucking retarded\n\n", "score": 1, "replies": []}, {"body": "Are you new to the market or something? Google, Microsoft, Facebook, these are all companies who acquire other companies. That's a sign of good health.", "score": 0, "replies": [{"body": "The difference is that Google, Microsoft, and Facebook do not rely on acquiring other companies for growth. Their acquisitions accelerate their growth, rather than being the most important stimulant like you are saying for Apple's case. Very poor business model to make acquisitions your #1 chance for growth.", "score": 0, "replies": []}]}]}]}]}]}]}]}
{"title": "Why has Apple not continued falling today?", "selftext": "[deleted]", "id": "acmjf1", "created_utc": 1546635265.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 26, "comments": [{"body": "It has dropped 40% already.\n\nAnd the fact you think you know EVERYTHING Apple will release in the next 5 years is laughable.\n\n", "score": 14, "replies": [{"body": "[deleted]", "score": -19, "replies": [{"body": "Airpods. Watch. Those for sure were not leaked 5 years ahead.", "score": 12, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "This website will give you an idea what they are working on.\n\n[https://www.patentlyapple.com/](https://www.patentlyapple.com/) \n\n&#x200B;", "score": 2, "replies": []}, {"body": "Nope.  The Apple Watch came out in 2015. No one was talking about a possible Apple watch in 2011.  The first whispers happened in 2013.\n\nAirpods not a big ticket item? LOL.  Airpods cost more then the average Android phone.", "score": 1, "replies": []}]}]}]}]}, {"body": "Please state your position if you’re long or short on Apple.\n\nI’m long, I don’t see the concern or why it would continue dropping. I wasn’t concerned yesterday, I am not concerned today. ", "score": 9, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "So if you’re shorting it, is your post just because you lost money? Don’t let daily moves cloud your judgment. ", "score": 2, "replies": [{"body": "No I am long. This would be the worst time to sell.  My judgement isn’t clouded. This post came from a purely interested point of view and certainly not to either spur me into buying or selling. ", "score": 3, "replies": []}]}]}]}, {"body": "they're up solely because of powell's comments today and the announced china/us trade talks coming next week. macro news are important too ", "score": 4, "replies": [{"body": "And jobs and good numbers from China", "score": 1, "replies": [{"body": "unpopular opinion but i dont think the jobs report had anything to do with today’s rally. futures were already up 2% when premarket trading opened on news of china/US talks and when the jobs report came out, futures actually dipped to being up only 1.5%. two reasons why - a good jobs report would hypothetically give powell more ammo to say some hawkish remarks. another reason being that wage growth has grown higher than expected which is bad for a company’s bottom line. one of the smaller reasons for the long bull market was wage growth losing to inflation every year and only in the last 2 months have we seen the trend reverse. of course, all if this got trumped by powell’s unexpected and  extremely dovish remarks", "score": 2, "replies": [{"body": "Agree, too strong a job market is not necessarily a good sign, we normally had very strong job market right before the recession. The stock crash before the job market does. \n\nChina-US is still the biggest risk, considering the Chinese government’s hard-head attitude toward foreign negotiation with the stubborn Trump, I don’t know it will end well there. ", "score": 2, "replies": []}, {"body": "Bear market is over now right.", "score": 1, "replies": []}]}]}, {"body": "And with oil being down, more money in people's accounts.", "score": 1, "replies": []}, {"body": "Thanks. Didn’t check global news 👍", "score": 1, "replies": []}]}, {"body": "because it dipped and everyone ran to buy the dip", "score": 2, "replies": []}, {"body": "A rising tide raises all ships", "score": 2, "replies": []}, {"body": "Because it’s cheap. 6X enterprise value. ", "score": 2, "replies": []}, {"body": "The sell off in Apple had very little to do with its product lineup and a lot to do with fears of an upcoming recession (see FedEx). Today’s numbers gave pause to the recession fears and drove a market-wide rise in buying equities. Almost everything is up. ", "score": 1, "replies": [{"body": "I’m not US based and haven’t checked global news yet. Faux pas. Thanks.👍", "score": 3, "replies": []}]}, {"body": "A lot of the movement of large stocks like Apple or Google is just a reflection of the market as a whole.  If the market is up, chances are they are as well. If the market is down, the same for them.  They will overperform or underperform the market over time, but on any given day they will generally go in the direction the market is going.", "score": 1, "replies": [{"body": "Of course however I was curious in light of the previous nights events. I thought that would have overshadowed any general stock market mirroring. ", "score": 1, "replies": []}]}, {"body": "I'm gonna be buying more shares today. Last year in Feb. I bought x amount of shares for $163/share. Now that it is below $150, I'm buying again.\n\nEdit: if you find a problem with this, I'm 16 yrs and don't have much experience in the market. However, I see this as a good move until I want to sell what i bought today and spread my portfolio.", "score": 1, "replies": [{"body": "Dude you’re 16 and already learning about investments, you have a lot of time to ride out any dips and crashes. 👍", "score": 1, "replies": [{"body": "My dad wants me to take the chunk of money I'm putting into apple today into something else. Except I haven't found the time to do some hard research. So, instead of just sitting in a balance, it could be making revenue. Especially with how low it is currently and how much i think it should rise until I'm ready to invest in another stock/mutual fund.", "score": 0, "replies": [{"body": "Given time is on your side you are more likely than not to make a good return ", "score": 1, "replies": []}]}]}]}, {"body": "because it is cheap AF.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "acmte0", "created_utc": 1546636865.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 20, "comments": [{"body": "If you don't believe in the company and you don't follow stocks then why did you think it was a good investment?", "score": 12, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "What you experienced is FOMO and it will get you burned every time. ", "score": 2, "replies": []}]}]}, {"body": "if you have 1 share just hold it..don't you have a job in college ?", "score": 4, "replies": []}, {"body": "How many shares are you holding? If you’re worried about a substantial loss, sell.", "score": 3, "replies": []}, {"body": ">but I admittedly don’t follow stocks or anything as much as I’d like to. I’m mostly a short term investor\n\nWhy or how do you think you can be a short term investor without following the stocks? ", "score": 3, "replies": []}, {"body": "OP Do you mean losing 75-100 per share? Or is that how much you have invested.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "sucks. seems to have recovered a bit", "score": 1, "replies": []}]}]}, {"body": "It just got upgrade today and earnings are in two weeks. It’ll most likely see a run up to 330 before earnings. If you want to sell, wait to 330", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Mostly twitter. LiveSquwak and CNBCNow are good sources to follow ", "score": 1, "replies": []}]}, {"body": "Imagine if you’re wrong and he listens to your advice. Will you feel bad if he loses 50% of his investment? If I were you, I wouldn’t be so confident in a stock speculation that I go around telling people what to do with their stock.", "score": 0, "replies": [{"body": "You should always have a stop loss so if he loses 50% of his investment, that’s more of a risk management problem on his part. I could be wrong but based on how NFLX trades, it’s going to 330 most likely before earnings. What happens after earnings, I don’t know. It’s just simple momentum trading and knowing where support and resistance levels are. NFLX broke out of its downtrend at 283. 300 is the next resistance level and it closed right below that. With earnings comings up and China trade war news coming up this week, you have enough positive catalyst to move this up to its next resistance level at 330.", "score": 2, "replies": [{"body": "“I could be wrong”\n“It’s going to 330 most likely”\n\nI know how to read technicals and you know how to read technicals. But that doesn’t mean that I have an extreme conviction that I’m correct enough to convince others to do the same. If we want to talk just technicals, then it shouldn’t have broken through support levels near 400 twice. But outside factors weighed in on that. Look what China’s slowdown did to Apple as they slid through multiple support levels for the past 6 months. What if the same China news applies to NFLX? What if, technically speaking, NFLX looks more like a head and shoulders pattern right now? What if the US and China don’t reach a trade war agreement? What if more negative China news comes out during other company earnings? \n\nI’m being devil’s advocate on purpose. I’m long NFLX myself but if he originally told OP to just hold on to his one single share long term, that would be a safer recommendation. But to assume that it will automatically and without caution jump to 330 and OP should sell then is just a speculation. ", "score": 1, "replies": [{"body": "Most likely doesn’t mean 100%. If you know about technicals then you also know about probabilities. There’s always a chance something could play out differently. If you read most likely as 100 % certain then that’s on you. I still stand by my statement. NFLX will most likely go to 330 in the next two weeks in the run up to earnings.", "score": 2, "replies": [{"body": "“There’s a 50% chance I’m wrong but if I’m not wrong, there’s a 75% chance it will go to 330.”\n\nJust my interpretation. \n\nBut I could be wrong. ", "score": 1, "replies": [{"body": "Would you look at that? NFLX currently at 330 in the after hours trading after being upgraded by UBS. Thank you for your attempt at trolling, better luck next time ", "score": 1, "replies": [{"body": ">\"I’m being devil’s advocate on purpose. I’m long NFLX myself\" \n\nLMAO your pathetic attempt at trolling me has failed. Try not to let your ego get in the way. Better luck next time.\n\n&#x200B;", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I mean this subreddit is for discussion and speculation on the market. If you follow someone’s advice without doing any of your own research it’s your own fault if you lose 50% of your investment", "score": 1, "replies": [{"body": "Fair enough. IMO I just think it’s very bold of someone to assume that Netflix will shoot to the 330 Level simply based on earnings. Even more bold of them to recommend that a newbie who can’t handle a little bit of volatility should do the same. Just my opinion.", "score": 2, "replies": []}]}]}]}, {"body": "They can ask around 15-20 dollar's each person in the future (Without inflation) so if they can increase their users by around 5 times. They cant get around 120 billion in revenue at 20% net margin it will result in 24 billion of net income.\n\nBut this will be extremely hard and expensive to increase and before this they will use a lot of debt en money to get their originals out.\n\nSo in the future your free cash flow will be lower because you are paying off debts but at 24 billion income this is no problem.\n\nSo if they can get these users in 10-20 years it is worth buying but the question is can they?", "score": 1, "replies": []}, {"body": "Are you trolling? I can’t tell if you’re serious.\nU bought one stock?\n\nIn the case you aren’t and you absolutely have zero idea what to do, sell out and put it in your HYSA. \n\nThen, stay as far away as stocks/risks/investments as possible.", "score": 1, "replies": []}]}
{"title": "Tesla is now opening online design studio", "selftext": "", "id": "aci9rs", "created_utc": 1546609393.0, "score": 19, "upvote_ratio": 0.89, "num_comments": 19, "comments": [{"body": "So are reservations not a thing anymore? \n\nWill this strategy affect the Model Y should Tesla try to raise money via reservations again?", "score": 7, "replies": [{"body": "Tesla need to make the gap between announcing Model Y and being able to order and take delivery of a Model Y as short as possible. They don't want to make people who might buy a Model 3 wait for a Model Y.", "score": 12, "replies": [{"body": "True. But they also need to raise cash, and continue the growth story.\n\n(Would also be bad to announce the Y before the SR is out, probably a lot of bad press)", "score": 0, "replies": [{"body": "Will be interesting to see how much cash they need to raise for Model Y. If it's sharing the same chassis, battery pack, motors, computer, software, etc. as the Model 3 then it might not be that much. ", "score": 7, "replies": [{"body": "Either way that need a new factory. So lots", "score": 3, "replies": [{"body": "> need a new factory.\n\nOr just finish GF1.", "score": 9, "replies": [{"body": "Yeah. Would make a lot of sense to make Y at GF1. The batteries and drivetrains are already there.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yes, but they have a lot of debt to service.\n\nNot enough FCF to do both in the short term.", "score": 4, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Well 920mm due 3/19 or convert.\n\nAnother 520mm due 11/19 or convert\n\nThose are just the big ones I remember. So lots of debt this year, and that doesn’t include the wear-house line of credit and everything else.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They can’t convert them unless the price is above a certain limit. Not sure of the specifics, but it’s not as easy as “they can just pay with stock”.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Thanks for following up with this.\n\nI guess that’s why they said it’d be half cash half stock for the March debt.", "score": 1, "replies": []}]}]}, {"body": "Don't waste your time, fluff is a bear, he might be the gentlest one, usually, but he's still got his agenda to push.\n\nThanks for the thorough answers though. FCF should have increased dramatically in Q4 and it should continue to do so as they ramp further. Add to that they have plenty of cash on hand to pay off the debt as is and they're now profitable, it's a nothing burger.\n\nAs far as I'm aware they can't use the reservation money for anything. I think it's parked aside to accrue interest but that's it. Need someone with accounting knowledge to pitch in to confirm.", "score": -2, "replies": [{"body": "The reservations are not held in escrow, they can spend it as they want. But they are carried as liabilities on the books.\n\nAnd so what if I’m bearish, that doesn’t mean I have an agenda. ", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I see you haven't been around here long enough 😉\n\nJust look at the wording of the initial post:\n\n>Will this strategy affect the Model Y should Tesla **try to raise money via reservations again**?\n\nIt implies Tesla is using reservations as a way to raise money to fund its programs which isn't their purpose. They're just a way to gauge consumer interest.\n\nAgreed on your analysis. But fluff knows this all too well.", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You're right. I'm being a bit oversensitive from the opposite side.\n\nI just know fluff is smart enough to know better than that and I don't like seeing people waste their time explaining something to someone that already knows the answer/isn't interested in the answer. Or in this case insinuate stuff.\n\nStill, thanks for your contributions, you come across as a balanced person which we need more here. I can get a bit over optimistic at times 😊", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "No doubt. A lot, if not a majority of reservations holders had little benefit from reserving the 3. Model Y customers will see this and many will not bother reserving even if they are certain they are going to buy. I suspect Tesla may need to offer an incentive for reserving early if they want hundreds of thousands on the list. What that is, I don't know?", "score": 8, "replies": []}, {"body": "i plan on putting money down for the model Y", "score": 3, "replies": [{"body": "Same here.   The wife's car will just about need to be replaced when the Y comes available.   Once that happens we will be ICE free.    ", "score": 2, "replies": []}]}, {"body": "I would think while there is a backlog to fill, they'd prioritise deliveries to reservation holders ahead of the non-reservers.", "score": 1, "replies": []}]}]}
{"title": "This is AAPL's 4th \"big drop\" since 2008. Here is some DD and analysis of these drops. (more in comments)", "selftext": "[removed]", "id": "acdxtd", "created_utc": 1546572578.0, "score": 24, "upvote_ratio": 0.89, "num_comments": 27, "comments": [{"body": "Here are the interesting points: \n\n* For the prior 3 \"drops,\" AAPL regained its All Time High 22, 23, and 22 months after losing it. Remarkably consistent. If we apply this to the present drop, we're looking at about August 2020 of regaining the $233.47 All-Time High. \n\n* Six months after re-obtaining the previous high, the stock increased 34%, 28.6% and 20.8% from that original high\n\n\nAlso note that 2 of the 3 \"big drops\" since the 2008 financial crisis occurred in the Post-Jobs Era. Apple has had dark times without Jobs, yet have come out of steep declines and negative sentiment two times without Jobs. \n\nNear term catalysts: earnings, possible dovish Fed, end of shutdown, end of trade war \n\nLong term catalysts: release of 5G iPhone in 2020 (it's a hardware update, and will cause some people to buy the new iPhone). Also Apple has recent patents and hirings that point to the development of a AR/VR system\n\n\n\n", "score": 13, "replies": [{"body": "As someone with well above average knowledge of the state of AR/VR technology.\n\nThat shit will not save Apple.\n\nIronically I've been exposed to the 5G space too but not enough to claim to be much of an expert, but I'm not convinced anyone in the market desperately needs anything better than 4G.\n\nEven the people responsible for 5G don't know how to convince anyone else it's worth buying.", "score": 4, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Which is fine, but that doesn't mean they have room for infinite growth and the big fear right now is Apple has played all it's cards and can't find ways to motivate users to upgrade anymore.\n\nIt's not an unreasonable thing to be afraid of. There aren't any new features on any new phones that are that interesting.\n\nLogically if they can't get users to keep upgrading that means they need to find ways to get more money from users on their old hardware and Apple doesn't to our knowledge monetize user data.\n\nAnd even if they wanted to this would be a pretty bad time to try it.", "score": 1, "replies": []}]}]}, {"body": "What caused the 2012-2013 drop?", "score": 0, "replies": []}]}, {"body": "i just like that it's only AFTER these epic drops with NFLX, FB, or now AAPL that you get all the geniuses coming outta the woodwork fist pounding about out-of-touch leadership and how obviously flawed their strategies are", "score": 17, "replies": [{"body": "Idk what’s worse. That or the twats making it sound like they’re some kind of rogue who knows that Apple is still a solid investment. Like if that’s some kind of secret. ", "score": 6, "replies": [{"body": "Apple will still post record profits and earnings. Just overestimated how good a Q1 they would have. ", "score": 9, "replies": [{"body": "This is about more than just Apple's ability to turn a profit in Q1.\n\nManufacturing is down way more than projected. Hiring is up way more than projected. Profits are down way more than projected.\n\nHow do those three things mix? If the trend continues you eventually hire too many people, they eat into your profit margin because you're producing less product, you have to fire them and you enter a slowdown and very easily a recession.\n\nThis isn't just about Apple. All the data stirs up anxiety on a macroeconomic level.", "score": 1, "replies": []}]}]}, {"body": "Ya I agree. Analysts are pretty reactionary. \n\nI have strong hands rn, maybe to a fault. Otherwise, the analyst fear-mongering would have made me sell. ", "score": 2, "replies": [{"body": "How’s that push up today", "score": 2, "replies": [{"body": "After the doom and gloom of just 24 hours ago....it's pretty nice. ", "score": 2, "replies": []}]}]}, {"body": "It’s so OBVIOUS\n\n/s", "score": 0, "replies": []}]}, {"body": "or buy at the low, wait 2-3 years and rake it? seems legit...", "score": 2, "replies": [{"body": "Depends on you. I think we still have a little room to fall. \n\n[See this chart](https://imgur.com/a/mn68F4P), which makes it seem like about $135 will be bottom. \n\nIf you get in, there's a chance the play will take til mid to late 2020 to materialize. ", "score": 1, "replies": [{"body": "So you’re saying buy FD calls for the next 78 weeks? I’m in.", "score": 6, "replies": [{"body": "definitely what I'm not saying haha", "score": 1, "replies": []}]}]}]}, {"body": "I would be suprised to see Apple regain this time. Their products are now simply overpriced and somewhat under performing compared to competition. They also seem to focus on building monuments  instead of products. We all know what happen to civilisations that start to build monuments.", "score": 1, "replies": [{"body": "iPhone xs is overpriced but you can still buy a new iPhone 7 or 8 at reasonable price.\n\nAnd yeah iPhones aren't for me, but have you looked around at how many people own one and are unwilling to buy an Android phone? They have a huge most of loyal average consumers", "score": 5, "replies": []}, {"body": "I agree they need to start gaining more profit from different segments of their business. But I don't think this is the end of Apple. ", "score": 2, "replies": []}]}, {"body": "That was during the golden era with Steve Jobs... they have no vision and no new ideas hence the stock buy backs... no relation to precious crash", "score": 1, "replies": [{"body": "2 of 3 were not, if u read my comment", "score": 1, "replies": []}]}, {"body": "tHIs tIme iTs diFfeRenT", "score": 1, "replies": []}, {"body": "Initial drop on your data during 08 09 shit fest and all subsequent recoveries during massive 10 year bull market. Apple isn't going anywhere, just like GE isn't. ", "score": 1, "replies": []}, {"body": "Surely this drop is different from others as it's the first time guidance has been lowered since 2002.", "score": 1, "replies": [{"body": "We will see. Still posting record profits and revenues. \n\nThe big showtimes guidance revision could have been strategy to make Trump make a deal. \n\nOf course, you can buy puts if you truly believe it’s the end of Apple. ", "score": 1, "replies": [{"body": "You can't just lie about your guidance to pressure Trump. If they announced they're billions of dollars off target it's because it's true. If it turned out later they lied to create drama they would be sued by the shareholders for market manipulation.", "score": 1, "replies": []}]}]}]}
{"title": "RSI correlation and the DOW JONE", "selftext": "", "id": "acewgl", "created_utc": 1546579411.0, "score": 8, "upvote_ratio": 0.83, "num_comments": 22, "comments": [{"body": "I mean, doesn't an RSI over 70 constitute a drop in prices since it's overbought? Not really ground breaking, it's what should happen according to technicals", "score": 9, "replies": [{"body": "I have mine set to 80 because from what I’ve seen it usually hits 80 before actually coming down ", "score": 5, "replies": [{"body": "Oh yeah, I know it's not like it hits 70 and immediately drops... But if it's around any number above 70, it's bound to come down, just the degree of violence it falls is *somewhat* correlated with how overbought it is", "score": 3, "replies": []}]}, {"body": "70 means overbought in general but you'd have to look at previous RSI highs to see an individual assets true overbought max\n\nlike with everything, if the trend is, say always capping out at 74 before a drop, look for that resistance level", "score": 1, "replies": []}]}, {"body": "the chart is pretty self explanatory but for any of you autist out there the DOW has retraced 4/5 times when the RSI is above 80 ", "score": 7, "replies": [{"body": "But what is that on your chart? Because that's not the daily RSI, its currently at 46", "score": 1, "replies": [{"body": "It’s a stoch rsi ", "score": 1, "replies": [{"body": "ahhh thank you, now im on board", "score": 1, "replies": [{"body": "in that case i think this is less about the number, but when they crossover after hitting 90", "score": 1, "replies": []}]}]}]}]}, {"body": "#Fakenews. This is just a glitch. ", "score": 8, "replies": [{"body": "#ROUGE WAVE", "score": 3, "replies": []}, {"body": "i mean, its fake because the RSI is currently 46 and have no idea what OP is considering RSI here", "score": 1, "replies": []}]}, {"body": "Long Ambien", "score": 5, "replies": [{"body": "the sleeping pill ?", "score": 1, "replies": []}]}, {"body": "The D O W J O N E", "score": 3, "replies": [{"body": "D O M P J O H N S", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "It’s a 1 year chart ", "score": 2, "replies": []}]}, {"body": "What program is that", "score": 1, "replies": [{"body": "Trading view", "score": 2, "replies": []}]}, {"body": "The glitch jone ", "score": 1, "replies": []}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.1605  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/69438)", "score": 1, "replies": []}]}
{"title": "Goldman says Netflix is one of its favorite trades for 2019, sees nearly 50% comeback", "selftext": "", "id": "acipcp", "created_utc": 1546612504.0, "score": 34, "upvote_ratio": 0.93, "num_comments": 21, "comments": [{"body": "Anyone thinks $400 is out of whack? Even its share prices of $270 seems unbelievably lofty. NFLX has $8 billion in debt but only makes $500 million in net income. How the hell is it going to pay off its debt when it looks like the streaming market is becoming increasingly saturated with all sorts of streaming providers? ", "score": 34, "replies": [{"body": "They’re spending it on content. Content is king and $500 net income means they can afford their debt payments. Rolling debt is not a problem currently. \n\nBut all these reasons are why I’m long AT&T because their valuation isn’t absurd. ", "score": 15, "replies": [{"body": "1. Content is king\n2. Spend shareholder money on vast quantity of gargabe content\n3. Suprised pikacu meme\n4. Goldman ugprade your stock", "score": 9, "replies": []}, {"body": "Bullshit, their 'earnings' are due to amortization fuckery with their original content. The cashflow statement doesnt lie and shows the annual -$2 billion and it'll be even more next year all while credit spreads are rising", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "That's true but I also believe Netflix has spent way too much money on trash. $8 billion is so much money for the amount of income it is able to generate. Wow. ", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Netflix is way overvalued to be bought out. Theyre 130bn at the moment. A buyout would cost 200bn.   \nIt mitent even be accepted..   \nTheyve lost the rights to daredevil, jessica jones, iron fist etc.   \nHouse of cards is gone.   \nNarcos probably finished.   \nhttps://media.netflix.com/en/only-on-netflix#/new?page=1   \nThe only thing i can see there i want to know about is stranger things in june.   \nGranted they will get some decent originals but they lost all the marvel stuff i liked them for and its gonna be in disney or hulu now...   \nNetflix has the advantage its the default app on everything. But it could easily lose it.   \nThey need to be turning a profit of 5-10bn per year to justify their valuation imo.", "score": 2, "replies": []}]}]}]}, {"body": "I agree, and I think earnings will shed some light on these issues in a few weeks. I plan on shorting into earnings.", "score": 3, "replies": []}, {"body": "Well for starters they could make sure that 11 billion people aren’t sharing one account", "score": 1, "replies": []}]}, {"body": "It is from Goldman, you know what to buy. Boyz , all in put!", "score": 12, "replies": [{"body": "I fuxking hate the reverse WSB meme, but the Reverse Goldman DD is legit \n\nJust have to time the beast here, i got shook out of my puts today and may even ride calls up to earnings, after earnings in all bear on soyflix ", "score": 2, "replies": []}, {"body": "If anyone wants to listen to Goldman, wish you the best of luck,lol", "score": 1, "replies": []}]}, {"body": "Just got some more puts this morning. There is no way this company maintains 100+ P/E ratios in this market", "score": 6, "replies": [{"body": "fuck me, right?", "score": 10, "replies": [{"body": "Not the best day to buy put. Lmao, WSB is talented.", "score": 7, "replies": []}]}]}, {"body": "Goldman can't predict the future, and most of the 'predictions' they post publicly end up being awful plays. Muppets beware.", "score": 3, "replies": []}, {"body": "I'm wondering if their opinion was affected by the fact that Netflix just picked up ATVI's CFO", "score": 2, "replies": []}, {"body": "No matter what valuation metric I use, even with the most optimistic variables, I can never understand how NFLX trades at its market cap. And that's after it's share price has halved from ATH", "score": 2, "replies": [{"body": "Theyre bumping prices constantly. Its at 16dollars now per month.   \nBut yeah they need to be making 5-10bn a year in profit...   \nHulu disney and amazon will compete properly soon.   \nThe only saving grace they have is its the default app on tvs streaming boxes etc now so non tech people default to it.   \nI like the company but cant justify the valuation.", "score": 1, "replies": []}]}, {"body": "Fuck Goldman ", "score": 1, "replies": []}]}
{"title": "Why does the market care about jobs reports?", "selftext": "Today the dow is up based on a strong jobs report. What's the logic there? Thanks and I'll take my answer off the air.", "id": "aciskr", "created_utc": 1546613125.0, "score": 12, "upvote_ratio": 0.84, "num_comments": 23, "comments": [{"body": "Usually when more people have money it’s good for the economy ", "score": 28, "replies": [{"body": "I always thought my personal finances were better when I was jobless and living with my parents. ", "score": 7, "replies": []}, {"body": "Yeah but that's assuming the jobs actually pay enough to buy shit beyond   food and shelter", "score": 7, "replies": [{"body": "> Yeah but that's assuming the jobs actually pay enough to buy shit beyond food and shelter\n\nOP, I’ll ELI5 it to you:\n\nUnder normal circumstances…\n\n1.\tPeople with jobs = People with money.\n2.\tPeople with money tend to spend on things.\n3.\tCorporations tend to get money when people buy stuff from them.\n4.\tCorporations use money to employ people.\n5.\tThe cycle repeats.\n\nThis is WSB so…\n\n1.\tDegenerate gamblers with jobs = Degenerate gamblers with money.\n2.\tDegenerate gamblers spend money on MU $90C.\n3.\tMM get rich and spend money on blows & hoes.\n4.\tTrickle down economic occurs.\n5.\tThe cycle repeats.\n\n\n", "score": 19, "replies": [{"body": "*1.  People with jobs can borrow to spend, forcing them to continue working to service that debt. ", "score": 2, "replies": []}]}, {"body": "Food and shelter are pretty big parts of the economy. ", "score": 6, "replies": []}, {"body": "\"But all jobs these days pay minimum wage and errbody is poor boo hoo.\"", "score": 8, "replies": [{"body": "I mean, is that not relevant?", "score": 0, "replies": [{"body": "you seem to have mistaken this for r/ latestagecapitalism", "score": 5, "replies": [{"body": "I don't mean morally, I would never come to WSB expecting a moral compass. I mean is it not relevant for the performance of the market?", "score": 2, "replies": [{"body": "Well if everyone got payed more yes, they would have more money to spend ", "score": 2, "replies": [{"body": "So could a jobs report that shows a huge number of added jobs, but doesn't make note of how good or bad they are possibly overstate what that means as a forecast for consumer spending?", "score": 2, "replies": [{"body": "I mean it’s not the only measurement to go by but in general more jobs, even if they’re shitty minimum wage jobs, are a good thing because it means businesses are expanding and the economy is doing well. ", "score": 1, "replies": [{"body": "Also, people with jobs have access to credit through sketchy loans", "score": 2, "replies": []}]}]}]}]}, {"body": "Lmao.. clearly a Commie", "score": 1, "replies": []}]}]}]}]}, {"body": "Hmm that seems far-fetched, I'm gonna need a reference", "score": 1, "replies": []}]}, {"body": "Because you bought puts.", "score": 6, "replies": []}, {"body": "More jobs= more disposable income to spend to keep the economy going/room for growth. ", "score": 1, "replies": []}, {"body": "More jobs means more good boys means more tendies for all", "score": 1, "replies": []}, {"body": "I have a full time job and still can't afford both food and shelter. I make more than $20/hour.", "score": 0, "replies": [{"body": "Move out of NYC then. There are places in America where there are more $20+/hr jobs than there are people to fill them. And in those same areas, $20+/hr can single-handedly support a family of 4 if the money is managed somewhat appropriately.", "score": 1, "replies": [{"body": "I'm from Nebraska.", "score": 1, "replies": []}]}, {"body": "Yeah the revolution is imminent", "score": 0, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "acisup", "created_utc": 1546613172.0, "score": 38, "upvote_ratio": 0.97, "num_comments": 21, "comments": [{"body": "I’m hoping he revives my Puts from the dead. ", "score": 23, "replies": [{"body": "He’s gonna pop up, look in the camera and say “this one’s for you u/seaybl, no more interest rates America. May your Puts Rest In Peace in Peace.” Then he’ll likely mic drop and leave ", "score": 29, "replies": [{"body": "You’re like the Ms. Cleo of my misery. You can just see all the bad stuff happening to me. ", "score": 8, "replies": []}]}, {"body": "F", "score": 2, "replies": []}]}, {"body": "RIP my Puts. ", "score": 14, "replies": []}, {"body": "puts", "score": 22, "replies": [{"body": "Anytime I see Powell speak I grab Puts. Today I was feeling super autistic so I got calls instead (not total fd’s). Just take my money. ", "score": 22, "replies": [{"body": "looks like your super autistic spider senses paid off today", "score": 11, "replies": []}]}, {"body": "Powell is being a softie with his words. Calllllsss", "score": 7, "replies": []}]}, {"body": "You forgot that Wednesday 1/9 2pm is FOMC minutes", "score": 5, "replies": [{"body": "Read that as FOMO minutes. Still accurate", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "So you would rather him dig in his heels when he makes a mistake?", "score": 3, "replies": [{"body": "I remember when people were making the same argument against Hillary, \"she says one thing and when people disagree with her she changes her mind! No backbone!\" Granted I fucking hated her but aren't they supposed to go with what's best and not with whatever they stated day 1?", "score": 2, "replies": []}]}]}, {"body": "grabbed SPY puts at 9:45.", "score": 4, "replies": [{"body": "rip", "score": 15, "replies": []}]}, {"body": "Puts for next week ", "score": 2, "replies": []}, {"body": "[https://www.aeaweb.org/conference/livecasts/2019](https://www.aeaweb.org/conference/livecasts/2019)", "score": 1, "replies": [{"body": "thanks, you're the real hero for this.", "score": 1, "replies": []}]}, {"body": "gambling 1 SPX 1/4 2445 put for $150. \n\nfree money for now, sticking to my strategy to not chase the dragon and make consistent return. wait to see how this goes before making any decent moves.", "score": 0, "replies": []}]}
{"title": "Shortest Bear Market Ever?", "selftext": "[deleted]", "id": "ackn3b", "created_utc": 1546624429.0, "score": 46, "upvote_ratio": 0.92, "num_comments": 26, "comments": [{"body": "I averaged down my shorts today for this reason plus the basic realization that really nothing has changed. Trump and Xi are going to talk? Okay. Is the implication that they were never going to to talk? Job numbers blows out expectations? That doesn't exactly help the Fed lower rates, does it? The Fed re-affirmed that they are flexible, but didn't change their rate hike schedule at all? So basically exactly what they said in December was re-affirmed...\n\nNothing changed today. Global growth is still weak, which is precisely where most of the DOW has been slotting their growth expectations. Government is still shut and gridlocked. US economy is still calling for gradual rate increases. This is just normal market volatility designed to stop people out of their shorts before we move lower, which is exactly why I've been setting stop losses by buying OTM calls.", "score": 46, "replies": [{"body": "Thanks for the reply.  Newb question, but how do you go about averaging down your shorts?", "score": 4, "replies": [{"body": "I assume you mean the whole process? Here's my reasoning/strategy and it applies both directions. I'll do a short selling example here. \n\nOriginally start by selling short 100 shares. It has to be 100 so I can hedge with options. Hedging with options is especially important for shorts as stocks can gap up over 100% aftermarket due to mergers or acquisitions. \n\nNext, buy an OTM call to hedge at wherever your stop loss should be, which should be no more than 8%, or less if you see resistance nearer. The time frame can be tricky. Maybe try to capture at least the next ER, but if it's too far and too expensive, stay nearer term. Going 8% OTM should be cheap anyways. \n\nWhether it goes your way or doesn't, reevaluate as it hits your stop loss level or as the hedge expires. If you don't like the action, sell/cover everything and get out. If you still like it (and it's important to be objective and not prideful) then you want to calculate the cost of averaging down. Specifically with regards to the new hedge cost, which will be higher now, plus if you'll have to extend the hedge in the future. \n\nI like to track all the hedging costs plus the loss on the shares in a spreadsheet to find maximum risk. Once maximum risk hits about 10% loss on the total money being used on the strategy, it's time to walk. \n\nEdit: FWIW, this is called a \"synthetic\" in the option world. I prefer synthetics to long options for reasons I won't get into here that probably make me an options noob. ", "score": 11, "replies": [{"body": "Sometimes when I read stuff like this I realize I have no idea what I’m doing. ", "score": 19, "replies": [{"body": "Dude. I've been trading for about 2 years. Down about 13 grand. I finally started to realize I wasn't losing disproportionately, I was just losing big relative to my gains. So I started reading some books with risk management sections from which I've developed this strategy. I've been using this strategy for about 3 weeks and so far am only down, although it does feel good to limit my losses and actually sleep at night. \n\nAnyways, none of us know what we're doing. ", "score": 13, "replies": [{"body": "What are some good books you read?", "score": 2, "replies": [{"body": "Sam Weinstein's How To Profit in Bull and Bear Markets I think is basically required reading for all traders and investors. It changed my whole perspective on everything. It's even written in like 1988 so it feels like you're reading an old school text book. \n\nThe only other book I've read is Mark Minervini's Trade Like a Stock Market Wizard. That was helpful specifically with regards to risk management. ", "score": 4, "replies": []}, {"body": "The art of the deal by sun tzu", "score": 4, "replies": []}]}]}]}, {"body": "Very helpful.  Thanks very much for the detail!", "score": 1, "replies": []}]}]}, {"body": "Tell this to my Feb puts. I got my dick kicked in", "score": 3, "replies": [{"body": "Lots of time to go with Feb expiry. Ofc, I dunno what kinda time value you paid for. That's why I hate options. ", "score": 1, "replies": [{"body": "Well....when I bough them they were very deep ITM, then Uncle Jerome and his fucking traveling show of formee Fed heads came around today to pump up the market and now they are only slightly ITM....", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Fair enough. It's my first average though. I basically shorted the bottom of this market and now it's rallied to the 30 day wma in a really unconvincing way, so I'll average down here. ", "score": 1, "replies": []}]}]}, {"body": "A one day rally does not mean the market is over. Remember the biggest rallies that have happened, happened during bear markets. Global growth is slowing, it’s not over.", "score": 56, "replies": [{"body": "Was researching that, as well.  Feels like a good time to bet against a few of the biggest % gainers today, but this market seems extra crazy.  ", "score": 15, "replies": [{"body": "Here is the secret, the market will only go up 1000 points on the Dow, so if it reaches that, short the living shit out of it.", "score": 15, "replies": [{"body": "I’m sitting here going really?! 1000 points again?! Welp puts it is", "score": 3, "replies": []}]}]}, {"body": "If it *was* over ... would anybody be willing to admit it?", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "I'm honestly wondering why I go to the daily discussion anymore, I know what 99% of the comments will be before I open it based on if we're red or green.", "score": 4, "replies": []}]}, {"body": "How do those posters find the time to share their wisdom?  Shouldn't they be fully occupied eating caviar off of models asses in their space yachts? ", "score": 3, "replies": []}, {"body": "It's not over, just a bear rally with extra pumping from Trump and his PPT. ", "score": 2, "replies": []}, {"body": "WSB is getting bullish which means I’m getting bearish ", "score": 2, "replies": []}, {"body": "\" Lot of claims in other subs that the bear market is over. \" -- Hooray, bear market continues!!", "score": 3, "replies": []}]}
{"title": "Tarot Card Prediction for Friday, January 4th, 2019 Review", "selftext": "[deleted]", "id": "acmm4l", "created_utc": 1546635695.0, "score": 50, "upvote_ratio": 0.94, "num_comments": 22, "comments": [{"body": "👌 wsb is merging with sorcery ", "score": 41, "replies": [{"body": "at this point i think most wsbers would be fine with doing blood magic to bring mu to $90", "score": 15, "replies": []}]}, {"body": "This is the kind of autism I can get behind", "score": 24, "replies": [{"body": "by doing this I can convince everyone I'm spiritual and not autistic ;)", "score": 13, "replies": [{"body": "I see 501(c)(3) status in someone’s future...", "score": 5, "replies": [{"body": "If I become tax-exempt I promise to put all \"donations\" into a WSB run hedge fund ;)", "score": 7, "replies": []}]}]}]}, {"body": "Do this everyday please", "score": 15, "replies": [{"body": "Definitely going to do the tarot card drawing. Whether I do a reconciliation or just include it in the next day post I'll see. Think I might just put a \"Previous Day\" at the bottom of every new drawing and include some info.", "score": 13, "replies": []}]}, {"body": "Personally, just keep with only the initial reading. Reconciliation makes your position weak and we don't want people to flip flop", "score": 11, "replies": [{"body": "Yeah i think the initial reading is just fine. We can all laugh at how off base, or how scarily accurate some of the readings are.\n\nYou can do the \"reconcile\" reading via comments.\n\nIt's all just good fun.", "score": 6, "replies": []}, {"body": "Yeah I kinda just wanted an excuse to put a bear head on the stabbed dead guy haha", "score": 3, "replies": []}]}, {"body": "I prefer WizDaddy’s DD", "score": 7, "replies": [{"body": "You hedge WizDaddy with Tarot. That's what Buffet did when he averaged down his Apple shares", "score": 6, "replies": []}]}, {"body": "> An unfortunate misinterpretation for the first post of the series...\n\nAh I see you're familiar with our trading strategy.", "score": 5, "replies": []}, {"body": "To be honest, these three cards describe my day today.  \n\n10 of Swords: I overnighted some long positions which had dropped in value AH, leaving me with the feeling of failure.  \n9 of Cups: These long positions had ended up being rewarded throughout the day.  \n6 of Swords: Closed all of my positions prior to market close, regardless of the bullish signals, and took my wins.", "score": 4, "replies": []}, {"body": "Should be flaired DD imo", "score": 3, "replies": []}, {"body": "Could you please use deck without any swords for your next drawing? This shit is killing me.", "score": 5, "replies": [{"body": "That's me under the 10 of them. I feel your pain", "score": 4, "replies": []}]}, {"body": "What happens if somebody casts a spell on the market? Is TSLA haunted? ", "score": 3, "replies": []}, {"body": "My nipples are hard, but I wish you would’ve been right about your interpretation the first time ", "score": 3, "replies": []}, {"body": "Now this is shitposting!", "score": 3, "replies": []}, {"body": "after this I am a believer that tarot cards are at least as good as TA for predicting the market.", "score": 2, "replies": []}]}
