{"title": "My experience of wheeling in the past two months", "selftext": "Hi folks,\n\nI entered the market with 500K cash at the end of December, so pretty much near the peak. My goal is long term investment rather than cash generation. I read about wheeling, and decided to give it a shot with large ETFs: SPY and QQQ. I sold cash-secured puts, divided about evenly between the two ETFs. \n\nOf course, my timing was the worst due to the market crash, especially a very bad time for wheeling. I got assigned with all the cash (not at once, but over a few weeks). I don’t mind though, I was going to invest that money anyway. \n\nI now keep selling covered calls, but not too aggressively since I want to keep my stocks if there is a quick increase in stocks. Overall, I have made about $8K in options. Of course I am still in the red for 20-30K. My learnings:\n\n1) My return on capital due to options is about 1.5pct. If things go similarly, over a year, I expect up to 10pct return on capital due to options. Of course, if market crashes more, my calls won’t return as much and I won’t meet those targets at all. \n\n2) Overall I am still at a loss of about 5pct, but would be at 7pct if I had done no options and bought the stocks outright with limit orders. \n\n3) As you can guess, I am not doing wheeling aggressively. Especially with covered calls, I don’t sell as many contracts as I could, since I want to keep the shares in case the market moves up fast. Had I taken more risk (at the expense of losing upside in case market moves up), I could definitely generate much more ROI. \n\n4) High volatility is actually not bad. These 2pct up/down days helped me make several hundred a day, and I closed some positions in two days. \n\n5) Overall, it is not too much effort since I do not deal with individual stocks but large ETFs. I spend maybe 10 minutes a day, but I watch the market every five minutes or so.", "id": "t6atvw", "created_utc": 1646369094.0, "score": 76, "upvote_ratio": 0.9, "num_comments": 70, "comments": [{"body": "[deleted]", "score": 22, "replies": [{"body": "Good idea, thanks!\n\nHere are my trades:\n\n(Link removed)", "score": 16, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Thanks for the thoughtful response. \n\n1. Yeah, I am not good at market timing. I don’t think I will be good in the future, either 😀\n\n2. I am a bit scared to go to leveraged ETFs like UPRO/TQQQ, since losses could be amplified significantly. It might make sense to have a small portfolio of them though. \n\n3. My goal is not income, but long-term\ninvestment with returns that beat the indexes a few percent a year, consistently. I think over the long term, this would have a large impact. Thus, QYLD is not something I am considering (since its main goal is income). \n\n\n4. I see many others use CCs as an income strategy, I disagree that it can only be used for income. My goal is to slowly reduce my cost basis, and hope to never get called away. It is a bit different than traditional wheeling, I guess. \n\n5. The SPY 4/14 $456 call is around $3 a piece, maybe you looked up the wrong price? I have a limit order to sell it around $2.35, at about 50pct profit. \n\n6. Yeah, taxes will be a problem. For years that I have losses, I am going to harvest by selling stock that depreciated. This will help me zero-out stock losses and options gains. I wish my Roth IRA was large enough to do this there.", "score": 2, "replies": []}, {"body": "I disagree with the advice on the \"QE\". The Feds have been circle jerking us for 2 years about tapering. And even in December the Feds suggested very little of it.\n\nIt was the January minutes the ignited the powder keg. Very hard to \"time\" that. Because the Feds are basically liars and gaslighters now.\n\nBunch of worthless shjts.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes, I agree with what the Fed stated, but I'm suggesting that they were gaslighting so long that no one without any other \"tell\" would have given a shjt. I didn't give a shjt. And most people including me thought the December \"distribution\" was just tax-loss harvesting.\n\nThe fycking cabal probably wanted you to believe that.\n\nSaying you believed otherwise means you just guessed, because you had NOTHING to go on other than Powell's word, which is worth dog shjt.\n\nI mean lucky you, but he could have just rennegged again like he did 20x before and the market gone to the moon and you'd have been wrong...and missed gains...etc. etc.\n\nHindsight is easy to argue over. I'm just saying Powell is dog shjt and you can't trust him.\n\nLastly - the Russell was down for so long it wasn't a good indicator. And growth stocks were raging hard until the last minute. A lot of them lost 10%-15% in a single day when the Feds released minutes in January. I know...I was there... blech.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Just to share. I sold CSP's on SPY(460) and QQQ(390) in December 2021 (evenly split) for December '22 expiration. I would not do that again but right now I am break-even on the trade if I hold it because of the premium and could be up 5% if I sold vertical spreads against it.", "score": 5, "replies": [{"body": "That’s impressive if your cost basis was $390 for QQQ and are still at a wash when QQQ is at $340. This means you got >10pct in two months in premiums, which means 60pct gains in a year. Am I misunderstanding?", "score": 1, "replies": [{"body": "I don't see how he can possibly be at break even, he probably hasn't checked the QQQ lately. But 390s right now would be 2x more than they were when he sold them.\n\nThere's no way that covers the downside any more. I'd estimate he sold them around 30 per contract and they are now worth around 65 per contract.\n\nSince QQQ = $330s right now, he's probably at $360(adj cost basis) / $335 = minus 7% for the year if QQQ never sees above 335 again this year.", "score": 3, "replies": [{"body": "I was break even yesterday.  I went 50-50 on QQQ and SPY options.  My break even on QQQ is 354 (under water) but 423 on SPY (above water) to net a break even position", "score": 1, "replies": [{"body": "Ah I didn't complete the circle. Yeah that makes sense. Let's see I was about spot on with the QQQ then I estimated $360 cost basis.\n\nNot bad for having to reverse the trade, I have no historical data. :p", "score": 2, "replies": []}]}]}, {"body": "No - I sold one year out and got the 10% premium for the year.  I would not go that far again.  I am conservative and may not play 45 DTE the next time but probably 90-100 DTE.", "score": 2, "replies": [{"body": "Yes, that makes sense. Thanks for explaining.", "score": 1, "replies": []}]}]}]}, {"body": "View from 10,000 ft: You bought the top, and you're at -5%, congrats, you're doing something right.", "score": 5, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}, {"body": "Yeah you picked a very tough time to start wheeling.", "score": 8, "replies": [{"body": "Yes, indeed.", "score": 2, "replies": [{"body": "The good news is that if you get assigned anywhere near bottom you will make max gains which the market slingshots back up again.", "score": 1, "replies": []}]}]}, {"body": "Holy dick nuggets, if I had had $500k USD in free cash at the start of 2022, I would be in the Caribbean right now.\n\nSoups jelly, my man.", "score": 13, "replies": [{"body": "I have a family, and a large mortgage 😀", "score": 15, "replies": [{"body": "I hear you, but $500k USD would pay my mortgage and (looks both ways) *solve my family problem*...if you know what I mean.", "score": 16, "replies": [{"body": "I live in a very expensive area, and don’t feel rich at all with 500K to be honest.", "score": 18, "replies": [{"body": "I grew up rural US, lived in a few major cities, traveled the world...and every day it seems more and more like moving back to the rural US was 1000% the right choice.", "score": 16, "replies": [{"body": "My dream but different country.\n\nNeed a smaller account too!", "score": 3, "replies": []}]}]}]}]}, {"body": "What is 500k even in today's world? I took 860K EUR into cash in November 2021 and have been slowly returning to market now. \n\nI have a family with kids and no way is this enough money to support them in the long term unless I can sustain last year's 30% returns. I've figured I need another 500 + selling my home now maybe 600k and then I move to Spain for a cheaper cost and do some occasion consulting work which should cover living costs.", "score": 3, "replies": [{"body": "I get downvoted every time for stating this, but I can live very frugally and generally spend less than I earn. I live in the rural US in Flyover Country and we grow 25-40% of our own food. Until last year, every car I had ever owned was 15+ years old. I'm currently wearing a T-shirt from 2000 and some sweatpants I bought over a decade ago. I'm *a cheap-ass*.\n\nYou mentioned consulting work; that's my primary line of employment. It's feast or famine. In an excellent year, I might have $200k in billables. In 2019 however, the annual total was under $18k.\n\nWe made it work, no problem. We did not apply for any aid programs, even though we would have been technically eligible. The kids got free lunch and breakfast in 2020 due to Covid handouts for everyone. \n\nI have a sizable retirement account that I can't touch until I'm 60, if I live that long. If $500k magically appeared in cash for me, I could pay off the mortgage, install solar panels and a new heat pump, and have a big enough cushion to basically do whatever I felt like as life's direction with the rest. I'd only need to bridge about 30 years.\n\nIt's not a sum that one could call \"Fuck-You\" money....but it's pretty close to *Fuck-You-Maybe* given my financial situation and general thrifty ways.", "score": 5, "replies": [{"body": "How much is land out your way? What climate zone you in?", "score": 1, "replies": [{"body": "Irrigated farmland is selling for $8,000-$10,000 an acre near me; less if it is hilly, more if it is flat bottom ground. Grandma's paid off quarter-section 160 acre farm is an illiquid $1.6MM asset. Small vacant plots of reasonable residential size (5-15 acres), when you can find them, sell for quite a bit less per acre.\n\nI'm in USDA Growing Zone 5a.", "score": 2, "replies": []}, {"body": "Are there futures on rural land? Couldn't possibly go tits up", "score": 1, "replies": []}]}]}]}]}, {"body": "1. On your CSPs, what was the delta and DTE?\n\n2. In hindsight, would rolling the positions have made a difference?", "score": 2, "replies": [{"body": "1. Originally, I did weeklies. Now I do more of 30-45 DTE as suggested. I wait for up/down days to open and close positions. With this much volatility, a longer period gives more opportunities to trade. \n\n2. Not sure. I think I rolled only one trade. It probably would have helped if I rolled more, but I didn’t think the market would drop this much and wanted to get in.", "score": 6, "replies": [{"body": "weeklies is where you want to be in down markets, just my opinion.\n\nYou're selling to all the losers who wait last minute and need to roll at any cost.\n\nYou'd be surprised how long it takes to squeeze blood out of the turnip right now with theta. Options can keep 100% of their 45dte value up until expiring day, even when clearly out of the money. No joke.\n\nThe idea behind weeklies is why make a month long bet on where price will be when price will significantly move on you? Make shorter bets, adjust accordingly. And it costs less to buy back if  you're wrong.", "score": 4, "replies": [{"body": "I think weeklies could work, worth reconsidering my approach.", "score": 1, "replies": []}]}]}]}, {"body": "Damn! 500k on CSP’s is my dream! \nUnfortunate time obviously with what’s happening, but it’ll pass. \nI’m not so conservative, so personally I’d be doing TA on high IV, but solid companies.\nGains brother 🥂", "score": 2, "replies": []}, {"body": "Thanks for sharing. The wheel is more about cash generation and less about long term investment. Especially ETFs have low call premium, so writing CCs close to ATM and then going back to writing CSPs is better in terms of collecting credit. It seems you arrived in your desired position of being long ETFs with improved cost basis.", "score": 2, "replies": [{"body": "Yeah, I am not a traditional wheeler. I think traditional wheelers try to keep the cash and not to get assigned. My goal is a little opposite: Get assigned at a favorable price and avoid getting called away while selling CCs. It is more of a long-term appreciation method rather than income generation. \n\nI am still a long way from retirement, and have a job, so I think this makes more sense for my situation.", "score": 1, "replies": [{"body": "I'm new to this so pardon me if this a dumb question, but what's the big deal with being assigned on a CC if your strike price is still profitable? It certainly beats not being assigned because the price of the underlying dropped too much. I usually earn 2-3% extra if I'm getting assigned. After that, my money is free again to invest in a CSP. Is it about paying taxes?", "score": 1, "replies": [{"body": "Two main problems of getting called away:\n\n1) You lose the upside if market moves up. E.g.: Say QQQ is $340, you sell a call at strike $355 with 45DTE. Russia decides to withdraw from Ukraine, or inflation subsides or whatever, and stocks rip up quickly to $365. You either lose quite a bit of money closing the position, or get called away. \n\n2. Taxes as you mention. If you get called away, you lose your stocks. If you had a gain (strike price higher than cost basis), now you need to pay short term capital gains. For me that is a bummer, since I am in a high tax bracket.", "score": 1, "replies": [{"body": "Ok, I guess that's an American thing? I'm paying the same taxes regardless of how long I keep my shares (because my government are bascially thieves -.-).Im running my CCs usually for 2-3 weeks and I'm trying to set a strike price that is 2-3% above the underlying. So if I'm getting assigned I get a premium of 1.5-2% plus the profit from the stocks meaning an easy 3-4%.(gross) profit in 2 weeks which is pretty awesome.", "score": 1, "replies": []}]}]}]}, {"body": "I was going to say exactly this. OP \"wanted to hold on to the position\"-thats not wheeling. Indexes are different.  Its taken me awhile to get here but absolutely CC ATM.", "score": 1, "replies": []}]}, {"body": "I am in a similar position: I transitioned to selling options against the indexes and leveraged indexes toward the end of 2021. Patience is really going to pay off. If you get impatient and start selling calls at lower and lower strikes, taking on more risk, you might end up getting assigned when we eventually do find a bottom and lose big time. So be careful chasing premiums.\n\nI would also recommend solidifying a strategy as we enter what COULD be an extended down trend. Are you willing to hold through a 40% decline? How about another 10% down? Are you simply buying more if that happens or selling, then buying back in the following month after further declines? If you have a strategy defined it will help prevent you from making moves out of desperation if your shares really start to turn against you.\n\nGood luck!", "score": 2, "replies": [{"body": "Thanks! \n\nI am ok with further declines, this is long-term investment money. I am not sure what I would do, but most likely sell calls below cost basis but still far OTM to not get called away.", "score": 1, "replies": []}]}, {"body": "Similar sized portfolio for US stocks here. \nAlso started recently, and agree it's a tough time to start. I've been investing for 23 years but hadn't bothered with options too much until I had more spare time. Read alot of this subreddit and other resources, and grateful for the advice of /u/ScottishTrader and others. \n\n45dte, 0.3 delta, buy to close at 50% profit is what I picked up that suits me. Money/risk management based on simulation of a Black Swan 50% crash. \n\nUnlike most that started with the Put side, I used my existing portfolio of individual stocks to start with the covered call side intending to see them called away over time. This is in parallel to CSPs that I'm using cash obtained from shorting QQQ & Germany ETF. Instead of getting called away, alot of my covered calls hit my 50% profit target for early closure. \n\n$18k income from closed positions this month which is about 4.4% for the month.\n\nLosses on my Long shareholdings for the month are 9.14%.\n\nSo the options have cushioned my losses from 9% down to 5%, though it's a bit less lost because I shorted some ETFs to reduce delta risk. There's a few CSPs in the money but it's a very small % and I don't mind getting assigned if it comes to expiry like that. \n\nThough it's never fun to see losses, I can see the potential of this strategy in all markets and grateful that its bringing in income to soak up losses. Sure it's extra work, but I love seeing Theta eat away the value of the option each week and will enjoy having control over my income more instead of relying on market gods. \n\nMy mistakes so far have been mostly related to holding onto too many riskier stocks. Since I had sold out of crypto last year I picked up COIN, MARA, RIOT for some bitcoin exposure. Those have been very poor performers in 2022, though the options income is quite large it doesn't make up for the stock declines.", "score": 2, "replies": []}, {"body": "Who the fuck writes pct instead of %", "score": 4, "replies": [{"body": "People who type fast. Typing \"pct\" faster than shift + reach", "score": 11, "replies": []}, {"body": "Someone who is literally inclined, and not mathematically? Or someone with a limited ASCII character set on the keyboard?", "score": 4, "replies": []}, {"body": "Same number keystrokes on mobile, but they're all on the main menus rather than digging two alternative keyboards deep. Seems reasonable to me.", "score": 2, "replies": []}, {"body": "Sorry you folks were annoyed with pct, but as you guessed, I am on mobile and helps me stay on the same keyboard screen.", "score": 2, "replies": []}, {"body": "It's annoying, but if they are typing on a phone it's faster than switching to characters screen.", "score": 0, "replies": []}, {"body": "I was also irritated at the sight of it.", "score": 1, "replies": []}]}, {"body": "The problem isn't timing. The problem is diversification. \n\nVarious stocks and funds have done much better in recent months than SPY and QQQ.\n\nIn the fund area, take a look at XLU, XLE, VXX, SLV, GLD, SQQQ and others that have done well lately. TLT and TBT add bond diversification.\n\nPlease don't put all of your money into just SPY and QQQ. Diversification brings the risk level way down.", "score": 1, "replies": [{"body": "I think you might be misunderstanding my intent here. I am not a highly active trader that is trying to get in and out of positions quickly. My goal is investing in relatively lower risk, long-term investment in stock funds. I am not trying to build an actively managed fund to time the market, or pick specific sectors. \n\nVXX and SQQQ are for traders. XLU/XLE are bets on sectors. GLD/SLV are precious metals. All these combined, I wouldn’t consider putting more than 5pct of my portfolio. \n\nI could consider an extended market ETF like VXF or an international stock ETF, those are already in my retirement account.", "score": 2, "replies": [{"body": "With respect, I do understand your intent. Diversification provides lower risk. The funds I mention don't require timing the market. They are simply a way of avoiding severe downturns in funds like SPY and QQQ.\n\nThat said, a commitment of 5-10% of your portfolio is not unreasonable and provides the diversification I am suggesting.", "score": 2, "replies": []}]}]}, {"body": "I've never done options but I plan to with companies I like once they get closer to my range. So did your initial transactions consist of selling puts or what?", "score": 0, "replies": [{"body": "Yes, I sold cash-secured puts to get into the market. Wasn’t expecting to be assigned that quickly, but happened.", "score": 1, "replies": [{"body": "Okay. Just curious. Again, I've never used options but I've invested enough to know you'd wanna get assigned at favorable levels, therefore buying them outright likely would have yielded similar results, minus your premium.", "score": -1, "replies": [{"body": "The key there is \"minus your premiums\". The premiums is where thetagang makes money.", "score": 3, "replies": []}]}]}]}, {"body": "What is your opinion on selling puts instead of limit orders?", "score": -2, "replies": [{"body": "I obviously sold out-of-the-money cash secured puts. It helped me get in at a lower price than the peak in this market. Not sure how I would have felt if the market went up 😀", "score": 6, "replies": []}, {"body": "Limit orders don't pay you premiums.", "score": 1, "replies": []}]}, {"body": "These indices requires one puts down most liquid and can be costly.  I started with 1 contract Call and sold made some money. Finally decided to keep QQQ and SPY,", "score": 1, "replies": []}, {"body": "Cash would be a good position to have so you can buy on the way down if the market does tank. Just don’t lose all your money in the meantime lol", "score": 1, "replies": [{"body": "Yeah, not much cash left to buy unfortunately. I keep some cash to cover six months of expenses. My salary is coming in though, so I am slowly rebuilding my cash reserves.", "score": 1, "replies": []}]}, {"body": "How far OTM are your puts generally?\n\nare are you selling cash secured or portfolio margin(but coverable).", "score": 1, "replies": [{"body": "I sell only cash-secured puts. Generally about 5pct below the current price.", "score": 1, "replies": []}]}, {"body": "You can consider holding the 100 shares of long stock and doing a call credit spread against it.\n\nIf the underlying moves up rapidly, you will still lose the shares.  The loss will be reduced, however, and you can perhaps use the higher bought call to get back in at that strike.  You are in STCG land anyway, so this shouldn't be a huge tax concern.\n\nDepending on widths of the strikes, you might be able to net about the same premium per week if you moved the close strike closer to ATM.", "score": 1, "replies": [{"body": "Thanks for the suggestion, let me look into this!", "score": 1, "replies": []}, {"body": "Would you really net more than  wheeling/CC ATM tho?  I just feel like the risk of an underlying INDEX moving up so rapidly that there is significant ongoing opportunity cost, is low. The spread is just diluting your income?", "score": 1, "replies": [{"body": "OP was worried about shares getting called away.  Most people worried about that are not selling ATM strikes.\n\nIf OP was selling OTM, they could potentially move the short closer and put on a long and still get the same credit.", "score": 1, "replies": []}]}]}, {"body": "Any \"bear rally\" we get, you won't do yourself wrong by selling closer ATM or even ITM.\n\nAn example is last bear rally when SPY prices stalled at $457 especially the second time...you could have sold $450, or $445 calls easily and been confident you'll keep your shares.\n\nYou just have to understand the market we are in.\n\nI would think the next bear rally after this drop off cliff will peak around $425. So at $425, sell ITM.\n\nIf I were trading SPY I'd probably sell $425 calls for next week. If I absolutely wanted to keep shares, I'd sell ATM, next week looks like it'll be brutal.", "score": 1, "replies": [{"body": "I am just not good at market timing and knowing what is a bear market rally vs. a real rally. So I think I will continue to sell OTM calls.", "score": 1, "replies": []}]}, {"body": "I too started options in 2022 and have bumbled my way to  \\~8K in profits in Feb mostly selling -.10 Delta weeklys on QQQ, IWM, MSFT and a few others.  I caught the AMD falling knife this week and will have 300 shares come Monday at \\~10% loss (sold the 117Ps on Mon, whoops).  So I'll be selling CCs on those for the first time next week.  \n\nThe main thing I've noticed is I am WAY too emotionally involved in some of my trades.  Partly because my position sizing was stupid big.  For example I have 25 3/18 42P on BAC open right now which would be assigned if  they expired today.  I like BAC as a company but taking a 100K position in them was dumb given I didnt really want 100K of BAC.  Of course when I sold those CSPs two weeks ago, they were a -.10 Delta and BAC was in the high 40s so I thought I was safe, might still work out but definitely something I wont do again.\n\nAnother thing I learned is I have the opposite of whatever diamond hands is.  I guess chicken shit hands?  I keep selling off positions that are clearly not going to get assigned.  I had 65 135TLT contracts expired today that I BTC just because I was worried about some last second assignment which was never going to happen.  Cost me the commission plus a small amount on the transaction I didnt need to pay.  It was still profitable, just not as much as it could have been.  Opinions differ on where/when to take profits but this is one example where there was no real advantage to my BTC order because TLT wasnt going down by $5 with an hour left in the market.\n\nAnyways, point being you did pick a rough time but IMO it's also the best time because I've learned a ton about how I want to use options moving forward because of the turbulence (and dumb mistakes).  My plan moving forward is to sell 10x weeklys on IWM each Friday at -.20 Delta and just let them go until the following week.  It's something I actually wouldnt mind owning so I take out my assignment concerns and even if it drops off a cliff, I'm fine with it because it fills a gap in my longer term portfolio from an equity position.\n\nBest of luck on your trades!", "score": 1, "replies": []}]}
{"title": "COST WILL MOON SOON", "selftext": "Costco will moon sometime in the next year. \n\nInflation is driving people to buy in bulk. People fucking love Costco. \n\nHere’s the magic event, Costco hasn’t raised membership dues since June 2017. \n\nA quote from the CEO on recent earnings:\n\nMr. Galanti once again deferred on when Costco planned to increase membership fees. He said that the\nlast three increases over the last 15 years came out to an increase every five and a half years, with the last increase\nhappening in June 2017. \"I think the question will continue to be asked until we do or don't do something. But at the\nend of the day we certainly feel good about our member loyalty, our success getting members to move to executive\nmembership...you guys will know when we tell you and at some point it will happen,\" says Mr. Galanti.\n\n5.5 years is 2023 and I think they will raise membership rates around mid year. \n\nWhen they raise they will pop. \n\nLong dated calls should print.", "id": "t6caw1", "created_utc": 1646374225.0, "score": 30, "upvote_ratio": 0.66, "num_comments": 69, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|14|**First Seen In WSB**|1 year ago\n**Total Comments**|359|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/kttavl/nvax_fireside_chat_13th_annual_biotech_showcase/) [x](https://www.reddit.com/r/wallstreetbets/comments/lc5d78/cciv_my_balls_are_tingling/) [x](https://www.reddit.com/r/wallstreetbets/comments/l7avsp/nvax_results_finally/) [x](https://www.reddit.com/r/wallstreetbets/comments/qpgviq/cmps_results_soonish/) [x](https://www.reddit.com/r/wallstreetbets/comments/le15fg/dynatrace_the_magic_cloud_genie/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=t6caw1)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=t6caw1)\n    \nHey /u/MamothMamoth, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": [{"body": "Post your positions.  You will be banned if positions are not provided.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Lol did you miss the last 18 months? It’s already done that.", "score": 28, "replies": []}, {"body": "45 P/E ratio on a giant grocery store, and OP thinks it's underpriced because of a ballpark price rise estimate from years ago...", "score": 19, "replies": [{"body": "They haven’t raised rates. Margin is small and raising rates is a way to instantly increase profit. They haven’t done it in 5 years. Their stock is up because they are growing and have been growing.", "score": -5, "replies": [{"body": "Costco has about 50 million memberships.  Revenue is over 150 billion.  If they raise the membership cost $10, that's a 3% increase in revenue.  And it doesn't take into account the number of consumers who will see any increase as the straw that broke the camel's back and not renew.\n\nNot to say that Costco won't do well, but with the P/E ratio there's already a lot of growth priced in and a guess that they may have about a 3% increase in revenue doesn't tell me it's underpriced.  Let alone \"MOON SOON\".", "score": 2, "replies": [{"body": "I need to look up historical membership raises. I think it might be more like $50.", "score": -5, "replies": [{"body": "With a $50 raise I'd want to see what their customers retention was last time they boosted their membership cost almost 50%.  I trust them enough to know their best path, but I really don't see it causing \"MOON SOON\".  We'll see I suppose.", "score": 3, "replies": []}]}]}]}, {"body": "At least OP won't lose anyone money by suggesting this pick...", "score": 1, "replies": [{"body": "I dunno.  When is the market going to realize a 45 P/E ratio on an established grocery store is not sustainable?", "score": 1, "replies": [{"body": "The bottom half of PE is earnings. Earnings rise when they increase prices or increase members.", "score": 1, "replies": [{"body": "There's a balance between membership costs and member retention. It's like gyms, or Netflix, Spotify, except your average Costco shipper spends $2700 annually in addition to the subscription cost.  Unlike Spotify, when Costco loses a member over a $50 price increase they lose the membership revenue, but also over $2700 in purchases per year.\n\nI trust they're doing constant math to weigh this balance, but it's not as if it will all of a sudden be a huge boom.  If they could for instance increase profit 50% this year, why didn't they increase it last year?  Why not every year?", "score": 1, "replies": [{"body": "Costco only gains members. Costco is a cult.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Costco is one of the only stocks that only goes up. They been on a rocket ship since 2010.", "score": 30, "replies": []}, {"body": "You had me at “The people love Costco”, truest thing I’ve heard all week!", "score": 20, "replies": [{"body": "I live in Australia... can confirm everyone loves costco", "score": 2, "replies": []}]}, {"body": "That's what I thought too, except both BJs and Costco took a dive after their earnings today.\n\nInflation has been a known problem affecting people for months now, so you would think it would be reflected in their earnings. But it hasn't worked out that way. Maybe these businesses aren't as inflation-proof as you might think.", "score": 8, "replies": [{"body": "They have no margins and make money from the membership. I feel like inflation could totally hurt their already thin bottom line", "score": 6, "replies": [{"body": "Membership fees are pure profit.", "score": 3, "replies": [{"body": "Only profit *", "score": 2, "replies": []}]}]}, {"body": "Both Walmart and Target went up after ER. Both also saw huge drops since November whereas Costco barely moved. Maybe Costco will drop more.", "score": 5, "replies": []}]}, {"body": "![img](emote|t5_2th52|4259)", "score": 13, "replies": [{"body": "Puts on cost because every free sample meatball I eat will soon cost the cost 50$ per meatball. And I eat a lot of free meatballs", "score": 12, "replies": [{"body": "Chart looks ugly", "score": 3, "replies": [{"body": "Looks like the rocket ship took off with the fed stimmy money last year and the P/E ratio is over 40.  Wouldn’t touch it with a forty foot dick.", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4275)", "score": 1, "replies": []}, {"body": "THIS is the DD that I come to wallstreetbets for", "score": 1, "replies": []}]}]}, {"body": "Hot dog, you’re right", "score": 5, "replies": []}, {"body": "If I wasn't so balls deep in GME. I've always admired Costco like a forbidden love intrest. Told myself I'd buy when it was at 300, still looks like a decent paycheck dump at 530. Yet here I am only fondling my precious until Mayoboy is in a regular person cell. Wait for me COST. Wait for me.", "score": 15, "replies": [{"body": "Same.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Having a paid membership  weeds out a lot of low income people from entering the store. People with high disposable income can buy bulk and actually save on a lot of things. Oh, and they will make impulse purchases. Costco items are generally 25% cheaper ( I actually  track it) on most of their items.\n\nThat is their secret to ever growing income and profit.", "score": 6, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Smart people.\n\nFamily of 2…\n\nBuy frozen and easy to freeze food items and save literally thousands per year on food.\n\nTwo examples: \n- Pork Loin $1ish per pound…15Lb for $20ish…cut into 3LB portions and freeze…pork roasts for 5 meals…each meal feeds me for days.\n- Frozen Organic Fruit…2LB bag for less than a 8oz bag at the supermarket.", "score": 2, "replies": []}, {"body": "Of course if you are so poor you have to buy cheap, then you are at dollar general not Cost. If your middle class and you have enough to spend on basic needs but you are inflation squeezed, buying in bulk saves a ton.", "score": 1, "replies": []}]}, {"body": "In Russia, there is no Costco.", "score": 7, "replies": [{"body": "Pretty soon in Russia there is no Russia.  Hope they are loading up on potassium iodate pills because it's about to get real in a hurry.", "score": 8, "replies": [{"body": "😂😂", "score": 3, "replies": []}]}, {"body": "Lucky Russia", "score": 1, "replies": []}]}, {"body": "Welcome to Costco, I love you", "score": 5, "replies": []}, {"body": "They’ll raise in the fall. Buy September calls on any overall market weakness and start Jan calls as well, especially if there is an initial drop on the news from some dummies selling thinking membership retention will go down ( not a chance on the executive members)", "score": 2, "replies": []}, {"body": "Costco is just a great fukking company.\n\nI actually made fun of the product sizes before I ever went.\n\nActually amazing food deals…especially frozen…and stuff you can freeze.\n\nQuality products too.\n\nTotally agree…perceived Costco value will be amplified by inflation.", "score": 2, "replies": []}, {"body": "i’ve been bull costco since the pandy-wandy started. Been great so far", "score": 2, "replies": []}, {"body": "I'm concerned that NATO will have to deal with Putin and the market will nosedive.  Not sure which stocks will do well in that scenario.", "score": 2, "replies": []}, {"body": "i’ve been bull costco since the pandy-wandy started. Been great so far", "score": 1, "replies": []}, {"body": "Bulk tendies...", "score": 1, "replies": []}, {"body": "Have you heard of input costs? Their revenues can go up, but if their expenses rise with it, well, they got problems.", "score": 1, "replies": [{"body": "A membership fee raise is just gravy at this point.", "score": -2, "replies": []}]}, {"body": "I love costco chicken", "score": 1, "replies": []}, {"body": "Amazon also closed their pop up shops", "score": 0, "replies": []}, {"body": "Wish >>>> cost", "score": 0, "replies": []}, {"body": "![img](emote|t5_2th52|4259)", "score": -2, "replies": []}, {"body": "![img](emote|t5_2th52|4259)", "score": -2, "replies": []}, {"body": "![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4259)", "score": -2, "replies": []}, {"body": "“Welcome to Costco, I love you, Welcome to Costco, I love you”", "score": -2, "replies": []}, {"body": "“Welcome to Costco, I love you, Welcome to Costco, I love you”", "score": -2, "replies": []}, {"body": "“Welcome to Costco, I love you, Welcome to Costco, I love you”", "score": -3, "replies": []}, {"body": "Hot dog, you’re right", "score": 1, "replies": []}, {"body": "“Welcome to Costco, I love you, Welcome to Costco, I love you”", "score": 1, "replies": []}, {"body": "Up 80% in the last year and a P/E of 45 😬", "score": 1, "replies": []}, {"body": "The retard army is strong.", "score": 1, "replies": []}, {"body": "this isn't a \"moon\" stock and I'm sorry to tell you, it's likely a boomer stock.", "score": 1, "replies": []}, {"body": "When the economy gets bad all grocery stores moon lol right now it’s the prices of gas they are betting a lot of people plan to go less places outside of the weekly trip to the grocery store", "score": 1, "replies": []}, {"body": "This should be a $1600 stock instead of $CMG", "score": 1, "replies": []}]}
{"title": "$SST System1 -The millionaire maker makes massive acquisition", "selftext": "You saw my [DD post](https://www.reddit.com/r/wallstreetbets/comments/sjbtws/system1_sst_ready_to_pop/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) when this baby completed the SPAC merger. [Today they acquired a company with over 10M subscribers.](https://finance.yahoo.com/news/system1-acquires-couponfollow-133000870.html). Here's the [video ](https://twitter.com/system1co/status/1499758639069810688?s=21)\n\nNow each one of these users will see ads from other System1 properties. Many users will subscribe to other services owned by System1 as a result. This is how the System1 ecosystem works. It is increasingly less reliant on 3rd party ads and customers. Acquire subscribers to accelerate growth across the rest of the properties. Rinse and repeat.\n\nThis acquisition comes on the heels of [Road warrior](https://www.businesswire.com/news/home/20220210005992/en/System1-Completes-Acquisition-of-RoadWarrior) and [Protected.net](https://www.globenewswire.com/news-release/2022/01/27/2374708/0/en/Trebia-Acquisition-Corp-and-System1-Announce-Closing-of-Business-Combination.html)\n\nAnd follows the winning of [Microsoft's partner of the year.](https://finance.yahoo.com/news/system1-wins-microsoft-advertising-supply-180000948.html)\n\nFirst party ad data is the NEW OIL as cookies and other tracking mechanisms become increasingly less useful, due to European and American regulations against them. System1 has the perfect strategy in today's digital ad landscape and is on the path to become one of the largest software subscription companies on the planet. \n\nShorts are currently holding 138% of the float. 280% of the float is needed to be delta hedged. The stock is up over 50% since my DD post in late January. The potential for a mega short squeeze is there like few we have ever witnessed. Only this is a company with rock solid Financials and an outstanding and proven growth strategy. Once it pumps it's going to get on the radar of the major trading desks and share will be acquired in mass. \n\nSystem1 is positioned to become a digital ad giant. As meta gets crushed in the space there are plenty of ad dollars to flow to System1.\n\nNow we are patiently waiting for the first earnings report and news of more acquisitions.\n\nI hold 10,000 common [shares](https://ibb.co/g9Z2GrM).", "id": "t6klq8", "created_utc": 1646405380.0, "score": 37, "upvote_ratio": 0.83, "num_comments": 70, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|4 weeks ago\n**Total Comments**|29|**Previous DD**|\n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=t6klq8)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=t6klq8)", "score": 1, "replies": []}, {"body": "Positions or ban.", "score": 10, "replies": [{"body": "https://ibb.co/g9Z2GrM", "score": 5, "replies": []}, {"body": "Post your positions.  You will be banned if positions are not provided.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "I'm not allowed to post photos. Its not an option in the app. How do I post the screen shot?", "score": 2, "replies": [{"body": "You have to upload to something like Imgur.... But I see that this is not a good solution... I will raise this with admins.", "score": 3, "replies": [{"body": "Here is my position. https://ibb.co/g9Z2GrM", "score": 2, "replies": []}]}]}, {"body": "I hold 10,000 common shares of SST", "score": 4, "replies": [{"body": "screenshot autist", "score": 5, "replies": []}, {"body": "You’re a GOAT 😎", "score": 3, "replies": [{"body": "Thanks. Its just getting started", "score": 2, "replies": []}]}]}]}, {"body": "[removed]", "score": 6, "replies": [{"body": "LOL. Not a bad strategy.", "score": 2, "replies": []}, {"body": "You're doing well now friend.", "score": 2, "replies": []}]}, {"body": "This post aged well!", "score": 5, "replies": [{"body": "Thanks. I appreciate the mention. We are just getting started. Now on the radar of all trading firms. Short and gamma squeezess still in effect.", "score": 3, "replies": []}]}, {"body": "can you please provide proof of at least 2 other times you've been bigly right in the last couple years?", "score": 4, "replies": [{"body": "Take my advice or don't. I'm happy to make millions from System1. You all can do as you choose.", "score": 7, "replies": []}, {"body": "How stupid do you feel now?", "score": 3, "replies": [{"body": "I fucking applaud you to Jupiter my man. Is there still time or is this played out? Is it shares or options or both? I hope you make generational wealth here!", "score": 2, "replies": [{"body": "It's just getting started. Fair market value for the company is honestly over $150 per share in my opinion. I believe it's just started. I don't play options. I picked up 10k warrants and another 5k Commons.", "score": 3, "replies": []}]}, {"body": "not at all. you never gave me a screenshot. further, how much would i have invested here? maybe $2,500. maybe that would have doubled.\n\njust yesterday, an equally retarded person talked about Newegg. I invested zero. I see Newegg has fallen.\n\nMonths back Ironnet came up. that was at $30 a share, today it's a fraction.\n\n&#x200B;\n\nwould you have refunded me if i lost money?\n\ni guess long story short, go fuck yourself.", "score": 1, "replies": []}]}]}, {"body": "This post aged well!", "score": 3, "replies": []}, {"body": "I am trying to find the active PUTs. But, I don't see any! What am I doing wrong?  \n\n\nhttps://imgur.com/a/6lnya4y", "score": 3, "replies": [{"body": "Not sure. Maybe a tech issue.", "score": 2, "replies": []}]}, {"body": "I worked for System1 back when it was a little startup called OpenMail. Pretty amazing to see the growth - now that it’s on the radar let’s take off - I have 1300 bones 🚀🚀🚀", "score": 3, "replies": [{"body": "It's baby Google. Going to continue to grow over time. GG", "score": 3, "replies": []}]}, {"body": "This could be the opportunity of a lifetime. Setup highly similar to $ISPO but with loaded OI. S-1 has not been filed yet FYI.", "score": 4, "replies": []}, {"body": "https://ibb.co/g9Z2GrM", "score": 2, "replies": []}, {"body": "Now that earnings are out and it increased by a lot, is it a good time to buy at this price or wait? Or is it a bad time because we missed the action? Thanks in advance for the reply", "score": 2, "replies": [{"body": "Depends on your time frame. Long-term the stock will go up many múltiples from here. I'm the short term there will be a lot of volatility. It may go down substantially from here before it goes up again. I'll be adding shares first thing on Monday.", "score": 1, "replies": [{"body": "Okay thanks! Great DD btw, wish I read this much earlier. Do you have tickets under your radar that you may do DD like this?", "score": 2, "replies": [{"body": "Yes, there is another company I came across while trying to find comps to System1. I'll be doing a write up on it in the next week or so.", "score": 1, "replies": [{"body": "Awesome! Potential squeeze or the company just looks nice?", "score": 1, "replies": [{"body": "Awesome company.", "score": 1, "replies": [{"body": "Eager to see it!", "score": 1, "replies": [{"body": "Can you keep a secret? Dm me", "score": 1, "replies": [{"body": "Yes. I can’t dm you for some reason… can you try dm me?", "score": 1, "replies": [{"body": "I just followed you. Try following me and then we should be able to", "score": 2, "replies": [{"body": "I’m on mobile, I don’t know how to follow you💀", "score": 1, "replies": [{"body": "Click my name it should open my profile", "score": 1, "replies": [{"body": "Discord id: Karma2000#4751", "score": 2, "replies": [{"body": "Sent", "score": 1, "replies": []}]}, {"body": "I think it’s cause you’re Reddit premium that I can’t add you or something", "score": 1, "replies": []}]}]}, {"body": "I’m gonna send you my discord id, reply to me and I’ll send it instantly after", "score": 1, "replies": [{"body": "Ok", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "This stock has a market cap below our $1.5B minimum", "score": 5, "replies": [{"body": "The market cap is 1.7B", "score": 2, "replies": [{"body": "TD is showing me $900MM, can you give me a source? \n\nSorry, this happens a lot with SPACs. Shoot me some proof and then resubmit this, or I could reapprove.\n\nEdit: You know what, I believe you. Approved. Sorry for the inconvenience.", "score": 2, "replies": [{"body": "https://www.marketwatch.com/investing/stock/sst?mod=over_search\n\nSays 1.8B", "score": 2, "replies": []}]}]}]}, {"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Do you have a link? All I see is a bunch of disclosures.", "score": 2, "replies": []}]}, {"body": "Up 17% since post and still going hard", "score": 1, "replies": [{"body": "We go hard in the MF PAINT!", "score": 3, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Not really. My work is not appreciated here. People here are more concerned with playing games and telling jokes than making money. You're welcome to follow our group on Stocktwits if you want more information.", "score": 6, "replies": []}]}, {"body": "I read that S-1 filed for more shares which will be released by Tuesday 4/12 with the SEC? I guess it would squeeze if not by tomorrow.", "score": 1, "replies": [{"body": "That's not correct. Here https://www.youtube.com/watch?v=r_HJFzSo0s0\nI also wrote a post on this if you look at my posts in my profile", "score": 1, "replies": [{"body": "Thank you. I did buy a small call but now I might go in some more", "score": 1, "replies": [{"body": "Good luck!", "score": 1, "replies": []}]}]}]}]}
{"title": "Should JP Morgan and Chase be sanctioned for buying cheap Russian bonds?", "selftext": " \n\nPaywall removed (archived version):\n\n[Goldman (GS) and JPMorgan (JPM) Purchase Russia’s Cheap Corporate Debt - Bloomberg (archive.ph)](https://archive.ph/A4fez)\n\nBloomberg link:\n\n[https://www.bloomberg.com/news/articles/2022-03-03/wall-street-is-already-pouncing-on-russia-s-cheap-corporate-debt](https://www.bloomberg.com/news/articles/2022-03-03/wall-street-is-already-pouncing-on-russia-s-cheap-corporate-debt)\n\nAll while JP Morgan donates $1mil, which means nothing to them (they collected $1.5bn in overdraft fees alone during the pandemic in 2020) to save face\n\n[Responding to the humanitarian crisis in Ukraine (jpmorgan.com)](https://www.jpmorgan.com/news/responding-to-the-humanitarian-crisis-in-ukraine)\n\nThanks for responding to the humanitarian crisis while supporting Russian bonds. Assholes\n\nCredit to u/DeepBlue143", "id": "t6o5y9", "created_utc": 1646414956.0, "score": 408, "upvote_ratio": 0.92, "num_comments": 77, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|7|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=t6o5y9)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=t6o5y9)", "score": 1, "replies": []}, {"body": "Buying them sounds like enough of a punishment already.", "score": 95, "replies": [{"body": "\"It's nothing personal , Jack. It's just GOOD business\"", "score": 25, "replies": []}, {"body": "My impression (with absolutely zero evidence) is that the big banks are likely buying it to keep their clients happy. Their clients (other banks and companies) are forced for one reason or another to sell the bonds. They likely originally bought the bonds via Goldman or jpmc, large international banks with international connections into those markets. If some-fuck-hedgefund bought this shit via jpmc a year ago, and now wants to sell, that fund likely has no direct access to buyers, especially when everyone else is selling at the same time. \n\nThe conversation probably went something like \"you fucking sold it to us, now you fucking buy it back. Give me a price, any price, just give me a damn price\". \n\nAnd they might be holding it because they themselves can't find a buyer either. If you're forced to hold the shit, better to pretend you want to than that you're taking an obvious loss to maintain your clients. Hell, giving the impression that they are buying might induce others to also buy, and this give Goldman jpmc someone to sell to. \n\nSomehow this comes off as spin. I doubt the banks actually want to hold this shit.", "score": 6, "replies": [{"body": "Doesn't sound insane to me.\n\nAlso could be that they are trying to see what happens, high risk but very-very low cost. Provided they acquire it for almost nothing, if it's a write-off, whatever. But, IF suddenly the situation changes, a very large chi-ching may happen.", "score": 6, "replies": [{"body": "Kind of like buying a slightly OTM or ITM 0DTE in the closing  minutes, bu JP et al actually have a chance.", "score": 1, "replies": []}]}]}]}, {"body": "Where can I buy Russian Bonds?", "score": 34, "replies": [{"body": "Talk to the big guy.", "score": 25, "replies": [{"body": "Who’s the big guy Joe?", "score": 1, "replies": []}]}, {"body": "1. Have a European Brokerage or Russian Brokerage\n2. Buy either a EU listed Russian bonds ETF or buy Russian Bonds directly \n3. Profit or watch 2008 again", "score": 7, "replies": [{"body": "Easy peasy", "score": 1, "replies": [{"body": "I’ve opened one with an European brokerage, be sure to go to an actual bank ‘cause otherwise they won’t accept US Folks", "score": 0, "replies": []}]}, {"body": "> Profit or watch 2008 again\n\nIsn't that the best case scenario? Things went right back up after the crash.", "score": 1, "replies": []}]}, {"body": "If you find out, let me know.", "score": 6, "replies": []}, {"body": "Talk to Putin, I managed to get Russia’s 007 for peanuts", "score": 1, "replies": []}, {"body": "maybe you need an ISDA", "score": 1, "replies": []}, {"body": "Street. corner in Brooklyn", "score": 1, "replies": []}]}, {"body": "What better way to project power than owning your rival's assets. There's probably a Ferengi Rules of Acquisition assertion to be made here", "score": 38, "replies": []}, {"body": "I mean, we're talking about the bank that's metal trading desk settled charges of racketeering. Buying Russian bonds that may never pan out is probably the least shady thing they done recently", "score": 29, "replies": [{"body": "Or in the last century for that matter.", "score": 6, "replies": []}]}, {"body": "# I DEMAND LESS CORRUPTION, OR MORE OPPORTUNITIES TO PARTICIPATE", "score": 20, "replies": [{"body": "Put it on a shirt", "score": 1, "replies": []}]}, {"body": "No, my Broker should be punished.\nJp Morgan and Chase is allowed to buy them? Im not?\n\nThats not a free Market!", "score": 27, "replies": []}, {"body": "Banks gonna bank", "score": 12, "replies": []}, {"body": "Is this WSB or a fucking msm sub", "score": 5, "replies": []}, {"body": "\"To be sure, the sanctions on Russia haven’t outright banned trading in the assets.\"\n\nI too like to rage at banks when governments don't do their jobs.", "score": 14, "replies": []}, {"body": "Jesus WSB has gone down the tubes. Before you get angry about something maybe be sure you understand how it works.", "score": 5, "replies": []}, {"body": "JPM would have; and probably did, financed the concentration camps", "score": 12, "replies": [{"body": "They absolutely funded the Nazis. Check out chases logo, the swastika is still there, they don't even try to hide it", "score": 2, "replies": [{"body": "illuminerty conformed", "score": 1, "replies": []}]}]}, {"body": "So big banks can buy Russian assets directly even during war time, but citizens of these countries should have their crypto frozen because something something sAnCtiOnS", "score": 3, "replies": []}, {"body": "Why should they be? If they are trading the risk sits with those who purchase the assets. They could be buying from other banks, funds, individuals and not Russian entities or Russian individuals and still are within their rights. Move on, this is an utterly stupid topic to debate.", "score": 11, "replies": [{"body": "These firms are constantly involved in fraudulent and scandalist behavior. The fact that they can buy these securities and retail traders cannot is a reason for discussion. You can keep sucking the balls of the douche bags that steal from Americans everyday, but this is not an 'utterly stupid topic to debate'", "score": 3, "replies": []}, {"body": "Because by buying them they are helping keep Russian companies afloat. Imagine if big money flooded enough money into Russia to negate the effects of most of the sanctions.", "score": -5, "replies": [{"body": "running pretty close to the line of government control economy. I don't think it's wise to follow the foot step of china, where government can dictate the life or death of private company on a whim. I could see this evolve into the patriot act version 2.0 if it's not limited. Where government overreach can be justify by national emergency and never scale back down after the crisis is over.  \n\n\nIf they were selling weapon that can cause harm directly then there is a justified case. But suspect indirect support should not fall under that category.  \n\n\nIf we step into the realm of any and all possible sanction. It could set a dangerous precedent. What's next ? stop medical stuff from going into Russia, stop fertilizer import so they can't grow their food ? If the point of sanction to encourage population rise up to rebel against the government. Make the populace starving and sick is not really going to help, seems like a lot of excessive economic collateral damage. A lot of russian are protesting against the war, but they are getting collectively punish for the evil action of a few. So now the people who're protesting against the war not only have to face possible execution by putin they also need fear economic collateral destruction via sanction. I feel like a lot of bystander just got pull into without any choice on their side.  \n\n\nI don't think collective punishment should be the norm. You shouldn't be punish because the us government decide to spray agent orange in vietnam, causing generation of birth defect in the local population, not to mention tons of left over land mine litter the landscape. You also shouldn't be punish because we decide to invade iraq to find missing WMD. So I fail to see why russian need to be collectively punish for the act of the evil dictator.  \n\n\nA better more targeted approach would be to arm russian rebel group with military and intelligent support. Prop up an internal political opposition leader to take over power from putin will have the smoothest power transition. Other wise you'll get a chinese civil war situation after England depose of the last chinese emperor and left a huge power vacuum. And local warlords all sprung up after the chaos trying to take over political power.", "score": 3, "replies": [{"body": ">A better more targeted approach would be to arm russian rebel group with military and intelligent support. Prop up an internal political opposition leader to take over power from putin will have the smoothest power transition.\n\n_rubs nipples_ Russia gonna be a banana republic now, fuck yeah", "score": 1, "replies": []}]}]}, {"body": ">If they are trading the risk sits with those who purchase the assets. \n\nHow would that be any different if retail was also allowed to do it?\n\nMore or less, I think the point being made is that if some degen wants to YOLO their trust fund money into Russia, they should have the same opportunity as the big boys to do so.  If there's money to be made, why are you OK with the suits making it all while you slave away for a wage and pay your taxes until death like a good little bitch?  Are you a shill, or just a bootlicker?", "score": 1, "replies": []}]}, {"body": "anyone who thinks these russian big banks are going under have a smoother brain than me, and that's saying something considering how much i've lost. do you honestly think these big companies will just disappear because of this war? I think not, especially the big banks, they will no doubt continue to exist years after this conflict is over and it will just look like a nice V on their all time stock history", "score": 5, "replies": [{"body": "My bag hopes you’re right", "score": 3, "replies": []}, {"body": "They can easily declare bankruptcy- stock holders get shafted, debtors write off bad debt, they start again under a different name/get nationalized if they’re too important", "score": 2, "replies": [{"body": "I think they would get nationalized before needing to declare bankruptcy but maybe it’s better for them to declare bankruptcy to get rid of any bad debt", "score": 2, "replies": [{"body": "Yeah - main reason they might declare bankruptcy is because the sanctions have majorly fucked with their finances - they can't pay anything not denoted in ruble at the moment. Bankruptcy would get them out of their obligations to any western company.", "score": 1, "replies": []}]}]}, {"body": "They won't disappear, just any money foreigners have invested in them will disappear.  \n\n\nZero chance Putin is going to let anyone outside Russia profit off of this.", "score": 2, "replies": []}]}, {"body": "American banks doing American bank things.", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Can you tell us where to buy it already instead of telling us how you feel about it? Fuckin clown.", "score": 7, "replies": [{"body": "This guy is mad because he only loses money. These clowns should go back to GME with their righteous bullshit.", "score": 2, "replies": []}, {"body": "Твоя мать корова", "score": 1, "replies": [{"body": "Abopok btam robt", "score": 1, "replies": []}]}]}, {"body": "Business isn't, and shouldn't be, politically motivated. Obviously, someone thinks it's a good investment. Russia is still full of Russian people and companies who may or may not support Putin.  I expect most just want to live their lives.", "score": 4, "replies": []}, {"body": "No + L take + no bitches. They’re buying a dip. There’s nothing wrong with what they are doing until the government stops it. The only thing dropping faster then the rubble is the quality of the posts here", "score": 5, "replies": [{"body": "# The only thing dropping faster then the rubble is the quality of the posts here (*citation needed)", "score": 1, "replies": []}]}, {"body": "Well they literally profited off of the Nazi regime, so why would this be a surprise?", "score": 3, "replies": []}, {"body": "Bro chill dude we buy $lmt don't we...\nAll of us trying to make some dough", "score": 2, "replies": []}, {"body": "Puts on Citigroup  - oh meant that I'm selling Mar $53 puts on Citi.  If they excersize, ill wheel em", "score": 1, "replies": []}, {"body": "Yes, but they won't.", "score": 1, "replies": []}, {"body": "Lol taking down the biggest bank systems in the world, that’ll never happen", "score": 1, "replies": []}, {"body": "If this benefits Russian companies…YES\n\nDid US finance companies buy German company bonds in WW2?\n\nMaybe somebody should tell Jamie Dimon Russia is the FUKKIN ENEMY.", "score": -1, "replies": []}, {"body": "They are war criminals. They bought war bonds if they enemy.", "score": 0, "replies": []}, {"body": "Yes", "score": 0, "replies": []}, {"body": "Yes.\n\nThis isn't going to be popular on WSB, but the era of limitless capitalism is over. After the end of the Cold War, the West did nothing but party, and the fucking bills are coming due; existential environment crisis, a rising China, and a hollowed-out domestic society as the \"captains of industry\" outsourced all the jobs.\n\nAnd what do we have to show for all that partying? Did we bag some hot chicks at least? NO. The main human \"progress\" that came out of this period was basically FAANG. And God bless them for the amazing businesses that they are, but they are fucking useless; Google and Facebook to advertise plastic garbage to us, Amazon to sell them to us, etc.\n\nI am no retarded tankie, but we do need a new paradigm.", "score": -2, "replies": [{"body": "Limitless Capitalism?\n\nMinimum wage, socialized health care, public schools, food stamps and affirmative action are limitless capitalism?\n\nWell butter my biscuit.", "score": 1, "replies": []}]}, {"body": "yes", "score": -1, "replies": []}, {"body": "yes", "score": -1, "replies": []}, {"body": "Yes they should be![img](emote|t5_2th52|4258)", "score": -1, "replies": []}, {"body": "https://www.congress.gov/bill/110th-congress/house-bill/400/text", "score": 1, "replies": []}, {"body": "The sanctioner becomes the sanctionee!", "score": 1, "replies": []}, {"body": "“They should punish us as harshly as they punished us in 07” -Goldman exec", "score": 1, "replies": []}, {"body": "JPM's been dropping like a stone ever since sanctions started. I wondered if that meant \"we've been making money from CRIME, but now we can't CRIME so good so money go bye bye.\"", "score": 1, "replies": []}, {"body": "Banksters who will sell their own mother's to make themselves richer. They spoof the metals market, pay their multiple million dollar fines and then do it again", "score": 1, "replies": []}, {"body": "Yes ethically, but no practically.", "score": 1, "replies": []}, {"body": "Lol if they are buying them it’s literally a crap shoot. Russia is in very real risk of economic collapse and default.", "score": 1, "replies": []}, {"body": "They were never punished for funding the Nazis so why should this be any different?", "score": 1, "replies": []}, {"body": "These idiots sanctioned themselves. Today, right after these banks scooped up Russian debt, Putin signed into law a bill that confiscates all foreign assets. That means all Russian debt owned by American banks will not be paid. They are the greater fool. Russia will not be under their thumb.", "score": 1, "replies": []}, {"body": "Sir, this is a Wendy's.", "score": 1, "replies": []}, {"body": "You obviously don’t get how this works:\n\nEveryone was forced to sell GameStop style. They turned off the buy button.\n\nSo, who was taking the other side since every seller needs a buyer? Market Makers!\n\nYep, billionaires have been buying Russian shares for rubles on the dollar. \n\nThey lock the poors out from this opportunity bc it is a mass transfer of wealth to the politically connected. \n\nBased on who’s buying, I can bet that peace talks will commence, Russia will back off and take control of part of Ukraine, and the Russian market will go back up. \n\nBillionaires win. Poors lose.", "score": 1, "replies": []}]}
