{"title": "Markets up big on hope of end to conflict", "selftext": "[https://www.marketwatch.com/story/dow-futures-jump-more-than-400-points-on-hopes-for-russia-ukraine-talks-11646822544?mod=home-page](https://www.marketwatch.com/story/dow-futures-jump-more-than-400-points-on-hopes-for-russia-ukraine-talks-11646822544?mod=home-page)\n\n\"Wednesday’s climb comes ahead of a Thursday meeting between Russia’s and Ukraine’s foreign ministers in Turkey, as [Reuters reported](https://www.reuters.com/world/europe/russias-lavrov-hold-talks-with-ukrainian-counterpart-turkey-2022-03-09/), with analysts looking at an apparent thawing of positions. Ukraine President Volodymyr Zelensky said he is no longer pressing for NATO membership, one of Russia’s stated reasons for its invasion. Reports also have indicated that Zelensky is ready for a diplomatic solution to the hostilities sparked by Moscow’s unprovoked invasion of Kyiv.\"\n\nSo do we really think this is a sign of progress or just false hope? Or possibly just a dead cat bounce and the media looking for an explanation? I have my finger on the trigger to buy some commodity and fertilizer stuff...", "id": "tae5wf", "created_utc": 1646850551.0, "score": 34, "upvote_ratio": 0.72, "num_comments": 77, "comments": [{"body": "This rally is about the drop in crude oil, not resolution of Ukraine/Russia war.", "score": 91, "replies": [{"body": "It's all connected though. Crude oil is dropping on hopes of an end to the conflict, so investors are rotating back into equities. Or this could just be a breather after four down days.", "score": -27, "replies": [{"body": "No, oil dropped on OPEC+ announcing a large production increase to offset the loss of Russia's production. And frankly, I kind of expect that to be a bear trap in itself too. Oil was expected to be $120ish this summer *before* Russia invaded.\n\nTheir announcement has exactly zero to do with the conflict ending.", "score": 40, "replies": [{"body": "You don't know the precise reason.  Nobody knows.", "score": 5, "replies": []}, {"body": "This. People are completely insane to be dumping oil and buying up unprofitable SaaS trash. The market can avoid physics, but only temporarily.", "score": 2, "replies": []}, {"body": "Okay, but why would that lead to investors pouring money into equities? Is the thinking that lower oil prices reduces the risk of a recession/depression, so risk back on?", "score": 2, "replies": [{"body": "Yes that exactly", "score": 6, "replies": [{"body": "I see. Not sure why people are downvoting my question...", "score": 7, "replies": []}]}, {"body": "It didn't, lol. /ES was up 100 points before the bell opened. The oil drop was at 11AM ET.", "score": 3, "replies": []}, {"body": "vol today in SPY was half that yesterday. i don’t think the big boys were buying today", "score": 3, "replies": []}]}]}]}]}, {"body": ">  Or possibly just a dead cat bounce and the media looking for an explanation?\n\nThe market is up because shorts are covering prior to CPI data tomorrow. Today's move is almost identical to the one prior to February's CPI release.\n\nEditing to note that shorts covering doesn't imply anything about CPI data tomorrow. If you've been short equities since at least last CPI you're been banking and would have to be an idiot to not take profits. Shorts can reshort if they see more room down based on the report.", "score": 68, "replies": [{"body": "This is more likely than ANYTHING spewed in the article.", "score": 23, "replies": [{"body": "Just the title alone makes me chuckle. Ahh yes everyone seems so confident this conflict will resolve so thattts why market recovered....\n\nHas nothing to do with relief rallies, oil dropping, shorts covering.. but just the thought of possible war relief, who writes for these things", "score": 10, "replies": []}]}, {"body": "Other than the S&P having a 100+ handle for most of the afternoon and the DAX jumping over 1000 points, yeah, it is very similar.\n\nThe DAX is not jumping 1000+ points and nearly 8% based off the CPI report in the US for tomorrow (in fact, Europe occasionally ignores moves by the US). That was an absolutely startling move.", "score": 3, "replies": [{"body": "I agree the move today was large, but that's to be expected as volatility increases throughout a now 3 month sell off. \n\nShorts covering at the bottom of a downtrend causes other shorts to cover, causing bigger rallies. \n\nThe DAX jumped about 400 points the day before the last US feb CPI report, and perhaps more significantly sold off almost 1000 points in the two days following the feb CPI report - indicating there is significant correlation.", "score": 2, "replies": []}]}, {"body": "The CPI numbers weren't released against the backdrop of a war in Europe last month.", "score": 2, "replies": [{"body": "Sure, but if you've been short equities/long commodities for more than two weeks your positioning probably wasn't based on war.", "score": 9, "replies": [{"body": "Right, but I guess my point is that the CPI numbers won't have the same significance this month because of the geopolitical issues.", "score": 1, "replies": [{"body": "I think it'll be more significant. After this extended sell off the question is whether or not rate hike expectations have been accurately priced in. From the futures market the majority expectation is 7 .25 hikes this year or less.\n\nIf CPI is high, then there will be concern it is too far gone for the fed to control especially since war sanctions will not yet be factored in.\n\nIf CPI is at or below expectations, then it restores faith the fed can keep inflation under control and that current rate hike expectations are reasonable. Investors can return to equities with more confidence.", "score": 10, "replies": [{"body": "I just don't see it. One month's CPI data is irrelevant if we're headed for a major recession or depression caused by $150 oil and hyper-inflation.", "score": 2, "replies": [{"body": "If cpi is below expectations, that implies that we aren't in danger of that.", "score": 1, "replies": [{"body": "CPI is a point in time measure, it doesn't tell us where inflation might be in 6 months.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "So do I. The potential impact on basic agriculture products is frightening. Russia is by far the world's biggest exporter of fertilizers. Reduced fertilizer supply means lower yields for farmers, which means skyrocketing prices of things like wheat, corn, etc. I heard one expert predict that the price of wheat could 4x by the end of 2022 if this war doesn't end very soon.", "score": 1, "replies": []}]}]}]}, {"body": "Wars are overestimated in terms of impact on markets. Look it up.", "score": -1, "replies": [{"body": "Sure but the world is much more interconnected now than in the past, and modern wars didn't have the kind of economic consequences that this one has.", "score": 1, "replies": [{"body": "The economics are important.\n\nThe war is irrelevant unless it causes anxiety about nukes or Putin continuing his rampage.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This.", "score": -2, "replies": [{"body": "No, it's not this. Look at every equity market. German markets were up 7% today, UK was 3% up. The more likely explanation is probably this article, oil's huge fall and yesterday's fall following a report that said China could potentially offset the oil shortage by buying Russian oil, which would be cheaper for them and ease the current strain. I didn't get to read that report, but that was the basic explanation of it.", "score": 2, "replies": []}]}, {"body": "This makes sense.", "score": 1, "replies": []}]}, {"body": "If the market is up on hopes that this issue is resolved, it’ll tank when Russia starts bombing Ukraine again. Putin does not want to call a truce, Putin wants Ukraine.", "score": 27, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "has told himself he needs\\*", "score": 1, "replies": []}]}, {"body": "Poutine has backed himself into a corner and he keeps power only so long as the generals don't replace him - Zelenskyy people have already come out and said - we keep our territory, we keep our independence and we assurances this doesn't happen again - which essentially means - the UN/EU/Nato have to come onboard in some way to ensure Russia give up on a russian ukraine - Poutine loses that happens - so don't expect anything from this round of talks except maybe a chance to evacuate some more non combatants - ie women and children but that is the only real leverage Poutine has so don't expect that at this point!", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Russia, the people don't want the war, Poutine and his old guard backers do - this is all, going to be - about when enough economic damage is done and they are replaced - You have to understand the average russian isn't getting the truth on russian media, outside media has been mostly locked out - so when all those people aren't at week next week, the week after and so on - they will start protesting unemployment and that will be when poutine has problems - this is just getting started back in da USSR - remember this is only at the end of the second week!", "score": 0, "replies": []}]}]}, {"body": "You need money to find a war, though, and half of the 640 billion nest egg that Putin made for a Russia to weather sanctions is of limits to him and she estimated that the war costs him 20B a day. At some point, wants give way to reality. But sure when they happens, but it's worth noting.", "score": -2, "replies": []}]}, {"body": "Bottoms not here yet, don’t let the brief Green Day fool you.", "score": 28, "replies": [{"body": ">Green Day\n\nBoulevard of Broken Dreams or American Idiot might fit here? Maybe even Wake Me Up When September Ends", "score": 19, "replies": [{"body": "Why not just keep things simple. Dookie.", "score": 10, "replies": []}, {"body": "HAhaha nice, broken dreams for sure.", "score": 1, "replies": []}]}, {"body": "Look how hard oil was hit today! It lost a week of gains in only a day. That doesn't happen unless people believe there will be an easing of relations. In my experience, the only people saying the bottom isn't here yet are the ones with short positions.", "score": 9, "replies": [{"body": "I don’t have any short positions, just a short outlook lol.", "score": 1, "replies": []}]}, {"body": "Not agreeing or disagreeing, but what would make you think a bottom is in? I could easily see this being a bottom.", "score": 0, "replies": [{"body": "Nobody has ever pulled out an entire country from a number of markets and who knows that the ramifications will be for a myriad of companies globally. Until there is more certainty here or at minimum the war in Ukraine is over (which it won’t be until Russia takes over) I am not putting any money in. I have a few companies I am going to buy from a few sectors that I have been following for a while but it is going to be very, very targeted.", "score": 4, "replies": []}, {"body": "See the SPY chart?\n\nMeasure the decline starting in 07. Divide the total drop by the starting point.\n\nMeasure the decline starting in 21. Multiply the starting point by the number you just calculated. How close are we to that number?\n\nExtra credit: what were interest rates in 07?", "score": 2, "replies": [{"body": "Why do we need to reach those numbers?", "score": 2, "replies": [{"body": "Maybe we don't. Maybe it's magic, and things like trade deficit, inflation, and PPI don't actually mean anything.\n\nMaybe.", "score": 2, "replies": []}]}, {"body": "Gonna second this, we have barely dropped 10% from this war & a correction, 08 saw a near 50% drop in a lot of markets. I’m not sure what makes anyone think this is the bottom, more things will be priced in and the market will continue to drop IMO. I also still think we’re in a bull market that takes off whenever this conflict subsides (could be a year before it cools off, maybe longer could be less, who knows?) this means we shouldn’t drop as much as 08 (IMO), but 10% is nothing for what is happening here. \n\nNot a wizard, not financial advice", "score": 1, "replies": []}]}]}]}, {"body": "They just attacked a hospital. How is the market up? Makes zero sense", "score": 22, "replies": [{"body": "It’s up because everyone in here is bearish", "score": 17, "replies": []}, {"body": "As much as it pains me as Ukrainian to see what’s happening , hospital in Ukraine has zero effect on corporate earnings , market already repriced reduced income from Russia exit last couple days and everything that will follow is basicly noise", "score": 13, "replies": [{"body": "The issue of bombing a hospital has nothing to do with earnings, it's a sign that they aren't on the verge of an end to the invasion as the article suggests. The threat of this war dragging on is what is spooking the markets.\n\nI'm starting to think this is actually a really good opportunity to do some hedging.", "score": 4, "replies": []}]}]}, {"body": "Every other week it’s up on some good news. Then starts tanking again the next week\n\nI think the media just loves to play the game and control the narrative, because they’re paid to do so", "score": 12, "replies": []}, {"body": "They make stuff up for market “news” it’s literally all TA. The real article should be “Market Makers make bounce in the stock market.”", "score": 3, "replies": []}, {"body": "It's up because the market can't go down everyday even in bear market. No one actually knows why it is up.", "score": 5, "replies": [{"body": "Pump", "score": 5, "replies": []}]}, {"body": "\"Hope\". I guess if that's all the markets have then we're all fucked.", "score": 5, "replies": [{"body": "Putin can stay irrational longer than you can stay solvent.", "score": 3, "replies": []}]}, {"body": "Hope springs eternal. Russia is not known for compromise or being nice. They keep bombing during \"safe corridor\" times.", "score": 3, "replies": []}, {"body": "Can someone explain why the end of the war in Ukraine would correlate to the buying of stocks of companies in the US, most of which have no correlation to oil, or products from Ukraine or Russia? (I'm thinking of tech stocks among others)\nOr they all do in some way and I'm missing the big picture?", "score": 2, "replies": []}, {"body": "I hate that every movement in the market is attached to a news story. The price action can often be entirely technical.", "score": 2, "replies": []}, {"body": "Up? It’s like way down from last year and 2020", "score": 1, "replies": []}, {"body": "I am convinced this will end before the week is over. Putins army is in much worse shape than anyone thought. Plus the sanctions. No NATO or EU membership.", "score": -3, "replies": [{"body": "I actually thought that last week with the news of the convoy being halted and Russian soldiers deserting. But I suspect that was partly just media narrative. It doesn't seem to be slowing down and every expert I've heard comment on the crisis believes quite firmly that Putin has no quit in him and this could drag on for months.", "score": 5, "replies": [{"body": "I have same issues with reporting from Ukraine. Since according to current media reports Ukraine is rolling over Russia and this narrative somehow is only based on tweet's from Ukrainean officials. There is absolutely 0 reporting or news from russian side.\n\nAlso somehow Ukraine Ministry of Defence is able to report Russian casualties everyday, while at the same time they are not able to do same for Ukrainian army.", "score": 2, "replies": []}, {"body": "What about his ability to fund the war? Id heard it costs about $20B a day and that much of the money he stock piled was out of his reach (half of the 680B).", "score": 0, "replies": [{"body": "It seems that's NATO's plan, choke off the money so Russia eventually loses a battle of attrition.", "score": 1, "replies": []}]}]}, {"body": "Hahaha. Are you really saying Putin i.e. \"Mother Russia\" is going to retreat?? Think again. It's a country that's known to mutually starve its enemy, if needed, to win a war, or to lose one for both sides. I don't think Russians know \"surrender\", I don't think this has changed much. Putin may very well know the cost, he just doesn't care.", "score": 3, "replies": [{"body": "Not retreat but will take any exit offered", "score": -1, "replies": []}]}]}, {"body": "It's all a lie especially the US crop estimates. And opec might pump more, when? Look at all the countries taking their agriculture products off the market. No exports , none. Buy good now, rich are already hoarding", "score": 1, "replies": []}, {"body": "Watching the market go back up to the same levels as before, and before that, and before that is kind of like re-eating regurgitated food.", "score": 1, "replies": []}, {"body": "I'm really hoping the conflict is over really soon, and the market is right.", "score": 1, "replies": []}, {"body": "I don't think its a sign of peace. Both nations want to maintain an image that they want peace, but it's very unlikely they reach a compromise.", "score": 1, "replies": []}, {"body": "I don't know what people get from these types of articles except for hope.", "score": 1, "replies": []}, {"body": "Nobody knows what will happen tomorrow. Or in the next week.", "score": 1, "replies": []}, {"body": "Hope? More like cope", "score": 1, "replies": []}, {"body": "Are we sure that the oil will keep increasing?\n\nDidn't the UAE say they will increase production? Isn't the US approaching Venezuela because of the oil prices?\n\nI absolutely by no means know where the price of oil will go, but was just wondering if the US is going to use its political pressure to make Gulf States pump out more oil.\n\nHigher the oil price, higher the inflation. That's gonna hurt the American consumer and American industries (apart from the oil industry, of course), even tho fracking is popular in the US.", "score": 1, "replies": []}]}
{"title": "Inflation has peaked and Thursdays number wont be that bad.", "selftext": "One of the biggest factors in CPI is used car prices. According to the [Blackbook.com](https://Blackbook.com) used car index, Prices have started to come down as manufacturers produce more and demand drops. With the slight increase in rates we've already seen housing slow down as well and all the commodities that go into housing. Putin cant beat the Ukrainians with a broken economy and will sign a peace deal eventually once terms are met, bringing down oil to reasonable levels. They cant have millions of barrels of oil sitting at their docks, people need jobs. Overall inflation will start to come down, month after month. \n\n&#x200B;\n\n[https://www.blackbook.com/market-insights/market-insights-3-8-2022/](https://www.blackbook.com/market-insights/market-insights-3-8-2022/)\n\n&#x200B;\n\nhttps://preview.redd.it/4dj8p2vme9m81.png?width=1021&format=png&auto=webp&s=907ce83e576456e5ef3e65ddcb4ead45b816d0dd", "id": "t9w62a", "created_utc": 1646788949.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|1 month ago\n**Total Comments**|98|**Previous DD**|\n**Account Age**|1 month|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=t9w62a)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=t9w62a)", "score": 1, "replies": []}, {"body": "Don’t worry Apes, your new car will be 10% less than it was last week but your fuel is now 100% more….", "score": 60, "replies": [{"body": "And we promise to call you as soon as the parts come in for your seat heaters so we can install the parts you've been making payments on but don't have yet.", "score": 9, "replies": [{"body": "Bruh the switch on my seat went out in August. I'm ***still*** waiting on the part. Been almost a fucking year.", "score": 3, "replies": []}]}]}, {"body": "Dame, you're actually retarded.", "score": 30, "replies": []}, {"body": "![img](emote|t5_2th52|4641)", "score": 49, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 24, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 16, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 12, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 12, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 11, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 8, "replies": []}]}]}]}]}, {"body": "![img](emote|t5_2th52|8882)", "score": 5, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "Thursday's number is going to be very bad. It's pretty much expected at this point. Inflation does not cure itself. Prices will stay elevated until there is a surge is supply ( not likely over the last month) or demand is hit (tightening of monetary policy - which hasn't happened yet).", "score": 15, "replies": [{"body": "Short of the war ending tomorrow and a discovery of new dinosaur juice being found in Oklahoma the week after this is the “new, new normal” for some time", "score": 1, "replies": [{"body": "You mean the \"two week to curb the thing, transitory, unlimited QE, temporary increase supply bottleneck world war Z Ukraine new new new for some time\"", "score": 5, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Dino juice doesn't mean they want to develop it. Think it was 2016 when oil disappeared.... Then in 19...then in 20; too much investment into infrastructure", "score": 1, "replies": []}]}]}, {"body": "Funniest post of the year", "score": 13, "replies": []}, {"body": "\"Won't be that bad\"  ?  O wow, so it's totally OK now inflation has peaked at 19 fucking percent...  It's cool...  Totally not a problem.  Alls good now.  Thanks for the memo.  It's cool guys, he says it won't be too bad.  \n\nDumb cunt.", "score": 24, "replies": [{"body": "He’s an idiot, and it has not peaked not even close", "score": 3, "replies": [{"body": "Do they even count food and energy in the CPI ??", "score": 3, "replies": [{"body": "Food is PPi", "score": 0, "replies": []}]}, {"body": "So are you you don’t know shit", "score": -3, "replies": [{"body": "I know commas.", "score": 3, "replies": []}]}]}]}, {"body": "I haven seen some dumb shit on WSB but this is absolutely the dumbest shit yet.", "score": 42, "replies": [{"body": "I second this", "score": 9, "replies": [{"body": "Thirdly", "score": 8, "replies": [{"body": "Tree fiddy", "score": 8, "replies": [{"body": "Way over treefiddy once you factor in inflation🤷🏼‍♂️", "score": 2, "replies": []}]}]}, {"body": "I concur ![img](emote|t5_2th52|4887)![img](emote|t5_2th52|4887)![img](emote|t5_2th52|4887)", "score": 3, "replies": []}]}]}, {"body": "Positions or ban.", "score": 11, "replies": [{"body": "Ban bet with his dick", "score": 7, "replies": []}, {"body": "Post your positions.  You will be banned if positions are not provided.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": []}]}, {"body": "I know this is a sub of retards but this is next level", "score": 11, "replies": []}, {"body": "Oof.. look forward to watching this age", "score": 6, "replies": []}, {"body": "Lol funny", "score": 10, "replies": []}, {"body": "Whenever a sub gets really big you start getting these incredible news reports from anonymous people who suddenly seem to push what the mainstream media want you to hear.", "score": 9, "replies": []}, {"body": "All in bag holders..", "score": 3, "replies": []}, {"body": "I mean at this point Putin just needs to wait out the public opinion shaming which really doesn’t last as long as people would like to think + the rest of the world then swinging back dramatically when they see that it wasn’t just “thoughts and prayers” but large %’s of their retirement fund slashed and $7/g Gasoline. \n\nThere have been Sanctions in place on Russia since 2014 and the argument was the same back then “oh give that a week and they’ll be poor and hungry overthrowing Putin”. \n\nIs there anyone here who was alive and conscious in 2014 ?", "score": 6, "replies": [{"body": "lol....  right?!  I truly am wondering WTF is going on in Ukraine though...   At first I didn't believe it but lack of progress really is making me wonder...  is the Russian military performing that badly?  Doesn't really matter though, look at the Winter war and the beginning of the German invasion and look what happened to those guys.  The whole acting like Russias military is a laughing stock is the dumbest shit I have ever heard.  Those fuckers are hard as nails.", "score": 1, "replies": [{"body": "Yea the problem is that people are mistaking Putins meat shield for his real military. Upkeep on military equipment that’s 50+ years old is not cheap and currently he is getting rid of it while simultaneously turning Ukraine into a war torn nation with burned out trucks and unusable roads. \n\nUnderestimating your enemy is probably the biggest mistake you can make in war.\n\nIf I could give my enemy just one thing it would be I’ll founded confidence.", "score": 1, "replies": []}]}]}, {"body": "New cars are at least 6 months from catching up to demand. House prices are still increasing, and Russia can easily beat Ukraine.", "score": 5, "replies": []}, {"body": "You’re joking right?", "score": 2, "replies": []}, {"body": "I sat back and watched IMPP run from $.48 to $10, and every day I thought, \"oh this shit is about to tank\". And each day, it went higher. \n\nThe moral of the story is, I have no idea what Im talking about and the only time I make money is when I inverse my gut instinct.", "score": 2, "replies": []}, {"body": "Bahaha I’m inversing everything this dude says forever.", "score": 2, "replies": []}, {"body": "One of the biggest factors in the CPI is housing, and near zero interest rates, astronomically high lumber prices, and supply shortages all say you're going to have a bad time.", "score": 2, "replies": []}, {"body": "Thursday's number has largely become irrelevant. Recent big moves up in oil, metals, and Agri commodities this last week are not going to be included in Thursday's number.", "score": 2, "replies": []}, {"body": "Oil up car price down", "score": 3, "replies": []}, {"body": "Admire your positivity, buuuuuutttt", "score": 4, "replies": []}, {"body": "Just knowing palladium will be hard to get for catalytic converters, it’s scarcity increasing price and Russia producing 40% of the worlds supply, that still hinders new car production. Rising cost of metals, precious and more common, are also going to go up keeping new car prices at all time highs. Also, Putin is unpredictable and this war will wage", "score": 4, "replies": []}, {"body": "Based on what? We are going to be in a hyperinflationary cycle. There won’t be a recession but we are on a brink of depression. As the threat of a world war looms in Europa, oil will be cut by OPEC, China is seeking to enter Taiwan and North Korea will see this as an opportunity to advance into South Korea. NATO will be occupied with Ukraine and Russia. The US is obligated to assist South Korea and will be stretched thing to assist Taiwan. Japan, New Zealand and Australia will be blocked by China in assisting South Korea. Several countries will be brought down so people and governments will be moving assets into metals and crypto. \n\nWorld events are moving very quickly.", "score": 2, "replies": [{"body": "r/collapse", "score": 1, "replies": []}]}, {"body": "To be this retarded and  STILL remembering to breathe; it’s actually impressive 👍", "score": 1, "replies": []}, {"body": "Fucking retard inflation has only started read an economics book ffs", "score": 1, "replies": []}, {"body": "Problem with inflation right now is its mostly based in price gouging, rather than natural inflation.\n\nBut price gouging isn't sustainable either, so hopefully it was more opportunistic, and it's coming to an end.", "score": -6, "replies": [{"body": "Therapy gekko speaks the truth", "score": -4, "replies": []}]}, {"body": "!Remindme in 3 days\n\nThese post been really good/funny lately hoping for more laughs !\n\nAlso no ban bet ? Seems like you don’t believe the peak yourself OP ![img](emote|t5_2th52|4263)", "score": 1, "replies": []}, {"body": "Smoking something really harsh.", "score": 1, "replies": []}, {"body": "I don’t think I’ve read and seen someone more retarded as this. You my friend have probably made no money in stocks.", "score": 1, "replies": []}, {"body": "I don't agree with that at all. Gas pump up huge percentage increase in 13 days. Food bread, dairy, meat, seafood,  fruits/veggies. All up from last report.", "score": 1, "replies": []}, {"body": "It'll be bad but everyone's expecting it to be bad. If the number is horrendous, then we're doomed.", "score": 1, "replies": []}, {"body": "Holy fuck OP don't ever expose your last two brain cells like that, they're already working overtime as it is. Don't exert yourself too hard, I need a retard to keep opening up call positions. You'd make a good pet to this sub ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "I want to believe! Doesn’t make it so fren", "score": 1, "replies": []}, {"body": "I think it’s coming in hot, but bulls need a fucking reason to rally. When another headline supersedes the CPI print, you would be fuckt.", "score": 1, "replies": []}, {"body": "Inflation just magically went away without no hikes! Holy shit thats amazing", "score": 1, "replies": []}, {"body": "You haven't taken into account that while the demand for used cars is going to drop, the market for metals is insane. Used cars are going to be worth a fortune to scrap. Any sort of call out for relief is akin to the guy sitting in a cannibal's stew pot calling out that the hot tub is nice", "score": 1, "replies": []}, {"body": "Someone holding some out of the money calls", "score": 1, "replies": []}, {"body": "inflation is absolutely temporary, and we will be heading into a period of deflation.  at wife and i’s jobs, they arent doing COL adjustments to match current inflation numbers.  i work for a publicly traded company, and she works for a private billion dollar company.  hearing the same from others", "score": 1, "replies": []}, {"body": "Someone needs to tell the supermarket and gas station I go to.", "score": 1, "replies": []}]}
{"title": "Rivian DD", "selftext": "Not sure how to start this off but I think this is about a good time to buy Rivian, perhaps a once in a life time opportunity. \n\nYou may take a look at the stock price and see it dropping and think not to invest, but we have to look into why it is dropping. \n\nAmazon, the largest investor in Rivian, has a contract for 100,000 or so delivery vans from Rivian by 2025. Just recently, Amazon decided to get delivery vans from Stellantis. Investors hear this and think that Amazon is ditching Rivian, when in reality, Amazon did not sell their Rivian stock, nor have they cancelled the contract. They are simply getting electric vans from multiple companies, decreasing the risk that one company will not be able to fulfill the ev van contract. However, investors have panic sold regardless because that's what investors tend to do. \n\nHere's why I think Rivian will go back up.\n\nEventually people will realize that everything is fine and that the huge sell off was over nothing. Also, people will most likely be buying the dip. The most important reason perhaps is that Rivian has barely delivered any of its vehicles to customers yet as they have just started fulfilling orders. Based on reviews from influencers and people who have gotten their trucks, they are very good trucks. These are the perfect conditions for Rivian to take off because as Rivian delivers more trucks, they will definitely get a lot of positive attention from customers and a lot of people will be talking about the trucks.\n\nNow for the position itself. I am DCAing for a month. You may want to DCA over a shorter period of time if you think it will reverse sooner, or you may want to DCA longer if you think it will take a bit to really turn around. IDK what I'm doing, so I am just buying shares every day for a month. \n\n&#x200B;\n\nTLDR:\n\nPeople are panic selling Rivian over nothing and as soon as Rivian delivers more of their trucks, which people seem to love, they will get lots of positive attention, and people will buy back in. I recommend DCAing as it is impossible to time the bottom of the dip, but I think the dip is near.", "id": "t9yuej", "created_utc": 1646797636.0, "score": 10, "upvote_ratio": 0.6, "num_comments": 72, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|1 year ago\n**Total Comments**|1|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=t9yuej)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=t9yuej)", "score": 1, "replies": []}, {"body": "They have earnings report Thursday. Wait for the dip after that to open a position.", "score": 25, "replies": [{"body": "damn I didn't realize that. I only got like 10 shares rn and I'm buying 5 a day so I'll just buy 5 more tomorrow and see what happens ig. I'm just retarded like dat", "score": 5, "replies": [{"body": "This is why everyone who writes any DD, needs to post positions.\n\n**You got 10 shares....**\n\nBase on this, I am buying puts (1/10 of a put, since you got 10 shares)", "score": 31, "replies": [{"body": "10 shares? Sir this is a casino", "score": 3, "replies": []}, {"body": "lmfao", "score": -2, "replies": [{"body": "I bought 1 put (not 1/10). lol made a few hundred.\n\nThanks OP", "score": 2, "replies": []}]}]}, {"body": "Not a bad plan. Continue to buy the highs and the lows. Just dont yolo everything into it lol.", "score": 6, "replies": [{"body": "much love brother", "score": 0, "replies": [{"body": "🙏 me 2 :)", "score": 1, "replies": []}]}]}, {"body": "High conviction play! This is why “positions or ban”!", "score": 1, "replies": [{"body": "Post your positions.  You will be banned if positions are not provided.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "I will be on the opposite side of you, shorting this down to 10 or so.", "score": 16, "replies": [{"body": "This\n\nBut not sure it'll go to 10, maybe 25. Even Lucid seems to have a floor of 20.", "score": 6, "replies": [{"body": "Agreed, I can see this hitting a similar level to Lucid in the 20’s and then will buy some.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Way things are going not long 😂", "score": 1, "replies": []}]}]}, {"body": "Just wait for the next leg down in the stock market. Once spy gets to and maintains \\~400, LCID will be <20.  It will go to single digits before it sees 40 again", "score": 1, "replies": []}, {"body": "currently at 19.8 Nobody has a crystal ball.", "score": 1, "replies": [{"body": "I had one and slipped out of my hands and shattered. Now all I have WSB to help me.", "score": 2, "replies": []}]}]}, {"body": "Looks like you won.", "score": 1, "replies": []}]}, {"body": "This post is bad DD.  Rivian has been canceling everyone’s orders (mine included) because they want more money.  This means a lot when people are no longer able to use it for their tax credits.\n\nEdit:\nJust go to the rivian subreddit and watch the shitshow.", "score": 9, "replies": [{"body": "Nah I saw that they said they were raising prices but honoring original prices", "score": 1, "replies": []}, {"body": "but they are promising to secure the price at the time of order per letter they sent to those of us that ordered … but everyone after that, yeah shit show", "score": 1, "replies": []}]}, {"body": "Agree but there is no rush ! The prices are here to stay for a while considering the geopolitical and inflationary headwinds !", "score": 7, "replies": [{"body": "I'm going long so it probably doesn't matter that much in the long run.", "score": 1, "replies": [{"body": "If you are buying 1000 of shares yea .. but at 5 and 10 these add up ! Just wait to buy end of week after the dip", "score": 2, "replies": []}]}]}, {"body": "I'm an autist, and would much rather just buy Ford. The name Ford Lightning does something to my American DNA and the hair on my chest. Rivian sounds like a sustainable clothing brand that should be competing with Patagonia, but is really a startup EV company that will go bankrupt like the rest not named Tesla or with an established marquis. No I will not follow you with this YOLO, but I look forward to your loss porn soonly. 🍿", "score": 6, "replies": [{"body": "Rivian has a decent shot of actually directly competing with Tesla. I mean, compared to all other start up EVs they have delivered a working product now, have a good long term contract with Amazon, and actually looks decent in terms of consumer demand (as long as no crazy recalls happen in the next few years). Do I think they will overtake Tesla, no! But i do think they can cause enough of a stir and small competition to force Mr. Musk or ford/ Chrysler etc. to just outright buy the company and continue production under their own brand in years to come. That being said, no one knows shit about fuck about shit these days. It's all speculation.", "score": 3, "replies": []}]}, {"body": "This is not DD, this is cheerleading. The difficulty in scaling up production and the fact that Rivian is obviously not even able to keep its costs under control spell disaster, not optimism. \n\nAmazon has deep pockets, for sure. But there is a limit to the losses they will be willing to carry just to allow Bezos to try to parrot Musk.", "score": 4, "replies": [{"body": "Costs are a problem for everyone. You can't keep inflation or lack of supply under control. AMZN is an investor. Not a partner.  AMZN made enough money on that investment that the entire van order is free.", "score": 1, "replies": [{"body": "That’s not how corporate spending works. They already depreciate the costs of the cars they buy.", "score": 1, "replies": [{"body": "Who cares how bean counters move the decimal points around. The point is. That investment was a goldmine for AMZN. That saved their ass on the last earnings report.", "score": 0, "replies": []}]}]}]}, {"body": "Rivian puts for this Friday dawg", "score": 2, "replies": [{"body": "good.. I’m going to walk away with the premium", "score": 3, "replies": [{"body": "That’s fair", "score": 1, "replies": []}]}]}, {"body": "Tell us how/why they are worth 42B.   \n\nWhen GM and Ford are worth 58B and 64B", "score": 2, "replies": []}, {"body": "How will they possibly ramp up to 100k vehicles produced by 2025 when they’ve only delivered around 400 to date?", "score": 2, "replies": [{"body": ">re how to start this off but I think this is about a good time to buy Rivian, perhaps a once in a life time opportunity.\n\ncuz they just finished making the r1t an actual thing. Now that they have the car, they just have to make more.", "score": 1, "replies": [{"body": "Do you understand how complex it is to source electric car components at scale in this supply chain environment?", "score": 1, "replies": []}]}]}, {"body": "Yes they're down 58% yearly more than Nio which is also at a great price with a 49% yearly drop as well.", "score": 1, "replies": []}, {"body": "My biggest question is are they making skateboards? That’s the key to success and economies of scale. I see the Truck and SUV which is nice for the press, but they’re skateboards first, consumers second type of company from the way I understood when Ford and Amazon made investments.", "score": 1, "replies": [{"body": "idk. they have good publicity though from what I've seen and people really seem to like their trucks when they get them", "score": 0, "replies": [{"body": "But making a few thousand trucks vs 10’s of thousand of skateboards should mean more margin on the trucks and good money to keep the lights on and innovation going from the skateboard sales.", "score": 1, "replies": [{"body": "u right", "score": 1, "replies": []}]}]}]}, {"body": "There trucks are ugly.  Selling turds.  You never mentioned the product in your DD, are you going to buy one.  (I think they have made 10).  Post your sales receipt when you buy one and I will retract my statement.", "score": 1, "replies": [{"body": "bruh no need to hate. I'm to broke to buy a rivian but they are actually pretty good trucks. 920 have been delivered so far and I've seen one. I've seen videos of what they are capable of offroad too. Don't be fooled by it's looks. It looks amazing on the interior and that combined with its capabilities is why I think people like them. Also, regardless of the truck itself, the market over reacted to amazon's deal so this is an amazing dip to buy.", "score": 4, "replies": [{"body": "great drive, nice looking truck, good range (but not as good as tesla) but back order is ridiculous", "score": 2, "replies": [{"body": "The amount of orders shows that ppl want them and once they catch up with demand I think the stock price will go to the moon", "score": 3, "replies": [{"body": "I like the way you think …", "score": 2, "replies": []}]}]}]}, {"body": "not as fugly as the cyber truck", "score": 1, "replies": []}]}, {"body": "broke boy who has $430 worth of shares writes a DD. I'm betting against this clown", "score": 0, "replies": [{"body": "planning to have 6k invested by the end of the month.", "score": 1, "replies": []}]}, {"body": "!remindme 1 month \"how has RIVN moved from 42.21?\"", "score": 1, "replies": []}, {"body": "I say only three words: \nProduction is hard.", "score": 1, "replies": []}, {"body": "But Amazon did sell their shares in rivian. This thing has about 15-30% more to go down before it bottoms out.\n\nThe earnings release is going to be a shit show.", "score": 1, "replies": []}, {"body": "Is rivian actually making cars now or is wsb about to meme this stock again", "score": 1, "replies": []}, {"body": "I’ll pick this up in the 20’s.", "score": 1, "replies": []}, {"body": "Priced in", "score": 1, "replies": []}, {"body": "Rivian will go lower as well as most stocks , a crash is coming so buy it after the crash , maybe 25 , remember some idiots bought it at 175", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": " this is shitpost disguised as dd", "score": 1, "replies": []}, {"body": "I thought everyone's buying puts anticipating RIVN stock to crash?", "score": 1, "replies": []}, {"body": "Rivian has no scale, which is a death sentence in an environment where all the auto OEM’s are literally begging suppliers to allocate parts to them.  The only way Rivian doesn’t completely go under is if they get acquired.", "score": 1, "replies": []}, {"body": "Aged well", "score": 1, "replies": []}, {"body": "I am glad you only bought 10 shares", "score": 1, "replies": [{"body": "😭", "score": 1, "replies": []}]}, {"body": "Rivian has dropped by 3.41 dollars during this past month, I imagine OP has lost a decent amount of money", "score": 1, "replies": [{"body": "I went up $2000 and then right back down to where I started. I also timed spikes perfectly a couple times so despite the lower stock price I am even. I am still holding because I think rivian is a good company and I want to see it succeed. I've been seeing more rivian where I live recently.", "score": 1, "replies": []}]}, {"body": "This aged like gold. Good riddance!", "score": 1, "replies": []}]}
{"title": "Meta Platforms, The end of Facebook?", "selftext": "Alright everyone, I know that what is going on in the world has of course impacted the stock market, but seeing the Meta Platforms I can't help but think that it is a desperate attempt by Facebook to have an investment in for the future, personally I don't believe in the metaverse so maybe I just don't understand but i would love to get some thoughts on this", "id": "ta8dex", "created_utc": 1646834382.0, "score": 39, "upvote_ratio": 0.69, "num_comments": 74, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ta8dex)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ta8dex)", "score": 1, "replies": []}, {"body": "I feel like the metaverse is built for current 5 year olds.   Nobody in my peer group appears interested (36)", "score": 74, "replies": [{"body": "35 here, we were the generation that were early adopters to FB (needed college email to sign up) since then I don’t know anyone on Facebook anymore besides my parents and boomers. I have one for work that doesn’t have personal info and only industry associates and it’s a total shit show with paid ads, and endless features to make it look like a Geo Cities website.", "score": 28, "replies": [{"body": "I still enjoy FB", "score": 1, "replies": [{"body": "User name checks out", "score": 21, "replies": [{"body": "Thank you.  I do a lot of calisthenics.", "score": 8, "replies": [{"body": "Who needs a Peloton when you can do the same with a medicine ball?", "score": 2, "replies": []}]}]}]}]}, {"body": "That's true", "score": 12, "replies": []}, {"body": "I have an Oculus Quest. I live far from where I grow up so occasionally I will watch a sporting event in a virtual living room with friends from home. You look like avatars and it's a little harder to sip your beer, but I definitely see potential in this technology.", "score": 16, "replies": []}, {"body": "I'm 38 and I don't have a peer group because I don't have social media What the fuck is wrong with you people", "score": 15, "replies": [{"body": "They don't need to be built for you. You're gonna be almost 50 by the time this is fully outhtere and hence not relevant. They want the 16-20yo who in 10 years will have more money and he less financially smart", "score": 7, "replies": []}]}, {"body": "Something is wrong about the name. How can it be the meta of our universe? It’s like a VR powered social network where instead of a profile page you own some space in a 3D game.", "score": 5, "replies": []}, {"body": "Nobody (in the mainstream) was interested in the internet until it had boobs, videogames, dancing Jesus gifs and easy shopping.\n\nNot to say that the metaverse will be the new way to internet, but at this stage it's impossible to see what it will actually develop to.  It's a major risk, frankly I'm not too big on it.  But if you can find a \"better\" way to present the above list of things to people, you will win.  Or it can end up like second life.", "score": 4, "replies": []}, {"body": "I think you write it by accident, but there is a difference between built for “5 years old” vs “the current 5 years old”. \n\nIf it’s the latter , and Assuming they have the resource to shepherd it for 20 years, they are basically building for their future.\n\nSocial media is actually very fragmented by age. It’s easier to attract the next generation by billing a new platform than trying to change the old one.", "score": 6, "replies": [{"body": "The latter.   My current kids will be more interested in it that I ever will be.", "score": 6, "replies": []}]}, {"body": "It’s not 5 year olds paying tens of thousands of dollars for “virtual land”. But I do think that it will appeal to the younger crowd as the older crowd ages out from Facebook", "score": 1, "replies": []}, {"body": "Boomer cringe posts BUT IN 3D.", "score": 1, "replies": []}]}, {"body": "The real test will be porn. If porn adopts the Metaverse, the rest will follow…", "score": 22, "replies": [{"body": "You strap your headset on and wander into a 3d brothel. Riley Reid greets you and offers a vip experience to be paid in some crypto. You approve the transaction and moments later you're cumming in your pants with a headset on in a dark, poorly furnished room. This is the future we've all been waiting for.", "score": 6, "replies": [{"body": "Riley Reid? Should be Marilyn Monroe or Queen Elisabeth. Why some porn cooz when it can be anyone?", "score": 2, "replies": []}]}]}, {"body": "Feels like the only people interested in metaverse are certain tech fanboys and investors that fall for all the buzzwords and think there is big money to be made.", "score": 7, "replies": []}, {"body": "Vr is the future. Whether fb is the future of vr remains to be seen", "score": 23, "replies": [{"body": "AR will be the future, VR is too disconnected from the physical reality around you to get mainstream. Motion sickness and real world boundaries will remain a problem.\n\nI love VR for my flight sims, but that's about it.", "score": 11, "replies": [{"body": "VR/AR will merge so VR will go mainstream because it will have the perks of AR alongside it.\n\nAnd flight sims are not what most VR players are doing. 99% of VR users play other genres.", "score": 5, "replies": []}]}, {"body": "Sitting too close the TV is bad for your eyes", "score": 11, "replies": [{"body": "No it’s not. This is just bs your mommy and daddy told you to fuck off so they could get your lazy ass off the tv", "score": 6, "replies": []}, {"body": "This isn't true, and even if it was, a VR headset has an optical distance of 2 meters.", "score": 3, "replies": []}]}, {"body": "For some reason I'm not sold on this What if it becomes the next mini disc?\n\nI think there will be a different way to alter our reality than closing it off with a headset", "score": 4, "replies": [{"body": ">**“The truth in no online database will replace your daily newspaper, no CD-ROM can take the place of a competent teacher and no computer network will change the way government works,”**  \n>  \n>\\- [**Clifford Stoll**](https://www.newsweek.com/clifford-stoll-why-web-wont-be-nirvana-185306)\n\n&#x200B;\n\n\\-------\n\n&#x200B;\n\n>**within two or three years people will shrug and say, ‘”Uh yep, it was a fad of the early 90’s and now, oh yeah, it still exists but hey, I’ve got a life to lead and work to do. I don’t have time to waste online.” Or, “I’ll collect my email, I’ll read it, why should I bother prowling around the Worldwide Web or reading the Usenet” simply because there’s so little of value there.**  \n>  \n>[**Also Clifford Stoll**](https://blogs.mprnews.org/newscut/2012/02/the_internet_futurist_who_thou/)\n\n&#x200B;\n\n\\------\n\n&#x200B;\n\n>**\"The growth of the Internet will slow drastically, as the flaw in 'Metcalfe's law'–which states that the number of potential connections in a network is proportional to the square of the number of participants–becomes apparent: most people have nothing to say to each other!**  \n>  \n>**By 2005 or so, it will become clear that the Internet's impact on the economy has been no greater than the fax machine's.\"**  \n>  \n>**-** [**Nobel Prize winner in Economics, Paul Krugman**](https://www.laphamsquarterly.org/revolutions/miscellany/paul-krugmans-poor-prediction)", "score": 13, "replies": []}, {"body": "Mini disc was beaten by the MP3 format. \n\nOne type of VR might be more popular than others but it's not like there's a competing technology.\n\nAR and VR will both become mainstream as soon as a device the size of glasses can provide a good experience. AR especially will be normalised incredibly quickly, various militaries are already using it and its already incredibly sophisticated. Imagine a pair of glasses that apply Instagram filters, provide a heads up display, provide Google/Apple maps data as overlays. It may not even need glasses, holographic projections could achieve the same effect. \n\nIf/when it gets to the point it's normalised to have cybernetics both with become integral parts of human life.\n\nI don't think we're far away at all. I also think AR has far more commercial uses and that VR is ultimately the most sophisticated training tool there can possibly be. It also facilitates a non social, non coherent society becoming socialised. Big cities are full of strangers ignoring each other because fuck real people but everyone loves being ' social ' on social media when they can pick and choose interactions and narratives, VR will allow people to do that in a simulacrum of the real world. It will be a see change for how humans interact in the modern world.", "score": 2, "replies": []}, {"body": "The mini disk was designed to replace the original music CD.  We saw how that went.", "score": 1, "replies": [{"body": "Except you could record on them, not the way the industry was heading. Anybody recording music iso streaming these days?", "score": 1, "replies": []}]}]}, {"body": "It is not.", "score": 2, "replies": []}, {"body": "Humans are not evolved to use VR for long times IMO", "score": 1, "replies": [{"body": "Humans are very adaptable, especially kids.  If you grew up regularly using VR, without a doubt it will be much more enjoyable then a brain that fully developed without it.  Knowing this, we should all keep our kids off VR.  Social media is already a nightmare for mental health.  I can't imagine how bad the metaturd will become.", "score": 1, "replies": []}, {"body": "we've evolved for using MacBooks and iPhones you're right.", "score": 1, "replies": []}]}]}, {"body": "turn back time 10 to 15 years. Did you believe amazon, tesla, netflix, youtube had a future ? or did you think what ever their legacy rival industry incumbent makes more sense. Or did you believe tesla, amazon would go on and succeed ?  \nThis is more of a question on evaluating on how reliable your old believe system has work in the past. Then extrapolate on how likely your belief/evaluating system will work regarding meta platform in the future. If for the last 10 years your prediction system is wrong, then unless some thing change that improve your prediction system, and your prediction track record improves. Then it is likely your future will still be wrong.", "score": 5, "replies": []}, {"body": "Metaverse is just a legal business decoy to get fb away from the hot fire its set itself on over these years. Also to try to set a new image for the brand since its shattered its old one…", "score": 21, "replies": []}, {"body": "Metaverse will absolutely be a thing. I hate it, so it's probably going to the moon.", "score": 8, "replies": []}, {"body": "Its an amazing tool for 3d modeling (Adobe médium) For games is great but the graphic sucks. ( quest2 )", "score": 8, "replies": []}, {"body": "They rebranded to meta to reflect what the umbrella company actually does. Any social media app is a metaverse. It’s anywhere people can engage in imaginary world. They may fail at virtual reality but augmented reality is already here through social media. They can ditch oculus but still make billions.", "score": 8, "replies": []}, {"body": "fb will lose ppl\n\nbut meta will thrive\n\nmeta owns many platforms and I am certain that they will make the metaverse big especially with NFT and shit\n\nand to those who say: bUt wHaT aBoUt SEcoNdLifE?\n\nwhat about it?\n\nthe first ipad came in 2010 and it was a huge success\n\nppl said it was revolutionary and awesome and cool\n\nguess what?\n\nmicrosoft (like my bf's pp) made their first tablet back in 200 fucking 3 and it flopped\n\ntiming is everything in business and even giants like microsoft can fail\n\nso yea secondlife and other shit exist and existed\n\nbut the metaverse's timing couldnt be better with the pandemic and more and more ppl working from home\n\nmeta will still be around for the decades to come and it will still be one of the biggest companies ever\n\nmmw muppets", "score": 10, "replies": [{"body": "Have you seen Meta’s demo?\n\nA $500B company with best/brightest tech employees developed a platform that looks more goofy than Second Life.\n\nVery Uncanny Valley…", "score": 9, "replies": [{"body": "I was blown away with how bad their metaverse unveil presentation was - constant cringe. If anyone is going to pull off the future, it’s Apple with AR. Their presentations are sexy af compared to that Meta shitshow", "score": 5, "replies": [{"body": "Those who do not remember Second Life…are condemned to repeat the cringe.", "score": 2, "replies": [{"body": "Haha great point. That was the first thing I was thinking - this all seems so familiar, so 2005. Took me a minute to remember Second Life and of course the epic that was PlayStation Home and how many millions that dev bled of Sony", "score": 2, "replies": []}]}]}]}]}, {"body": "This was my exact thought upon seeing that Zucc actually went through with the rebranding. Straw grasping with his butt cheeks IMHO.", "score": 4, "replies": []}, {"body": "The end of Facebook is when the rest of my elderly relatives who took 10 years to learn it, all pass away, and everyone left alive can use Facetime and MMS.", "score": 3, "replies": []}, {"body": "Yup, BILLIONS in losses from Apple, Google is phasing in changes, so the bleeding will continue. Users are dropping like flies. Tons of bad press on well-being of users, both children and adults. Meta was a clear pivot to try and avoid failing with the FB brand, but it won't work", "score": 4, "replies": [{"body": "💯", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Which companies do you think of if you say web3?", "score": 1, "replies": []}]}, {"body": "VR is gonna continue to grow in relevance for gaming, there’s a lot of potential there. Meta is the top dog with oculus. It’s smart for them to want to own their own platform, it’s the only way a company like Facebook can survive long term. However, the actual metaverse is kinda lame (VR Chat proved that) so they need to focus more on getting triple A games on their headset now", "score": 2, "replies": [{"body": "I still think we are decades away from VR being relevant in gaming. Everytime I use VR I get a massive headache within 30 minutes.", "score": 7, "replies": [{"body": "> Everytime I use VR I get a massive headache within 30 minutes.\n\nPeople got sick from playing pong when it first came out too.\n\nKids will grow up playing with VR and have no problems playing all day, only boomers like us will struggle after a 30 minute VR sesh.", "score": 2, "replies": []}, {"body": "VR adoption is growing, .25% of total steam player base growth every month. The hardware is getting better every year, now you don’t even need a cord anymore and the headset can operate independent of a pc. The motion sickness part is real though, I struggle with that too.", "score": 1, "replies": []}, {"body": "Chew gum. Also check blood pressure and see an eye doc for stigmatizim", "score": 1, "replies": []}]}, {"body": "That's a very good point", "score": 3, "replies": []}, {"body": "Sounds like they are trying to compete with the company called Skillz when you word it like that.", "score": 1, "replies": []}]}, {"body": "Let's hope so.  I hate commy Facebook. Been in fb jail for  6 out of the  7 last months", "score": -2, "replies": []}, {"body": "So tired of armchair experts poopooing emerging technology. You don't think.maybe billion dollar companies have a bit more foresight than you do? 🙄", "score": -3, "replies": [{"body": "It's not like we haven't seen multi billion dollar companies fail before", "score": 11, "replies": []}, {"body": "Yeah, then we get the Dreamcast and Sega is fucking gone.", "score": 6, "replies": []}]}, {"body": "I bought 2 for my kids for Christmas. My boys are 8 & 10. They tried it for maybe a hour and got pissed at the interface.  None of their friends that come over even want to try it.\n\nIt’s a pain to adjust the head straps everyone you want to play, and then my eyeballs damn near touch the lens. Plus it sucks having a thing strapped to your head. \n\nIt’s a novelty thing at this point. My kids would rather play games on their tablets or Xbox.", "score": -1, "replies": []}, {"body": "I hope its the end of facebook", "score": 0, "replies": []}, {"body": "Just IMO:\n\nFacebook is bleeding money like a stuck pig. It's pretty much only a platform for old geezers like me to keep in touch with family, mostly the other old geezers. The kids are moving on now that we're there. Meta is a desperate attempt to keep from going under by leveraging their buyout of Oculus by creating a demand for the product. \n\nFrom what I can tell, it has not only crashed and burned, but it's flaming wreckage is tumbling down the track in a spectacular fashion like a race car crash in a highlight reel, taking the company with it.\n\nWhen I hear the news of Facebook's bankruptcy filing, my only reaction will be \"What took so long?\"", "score": -2, "replies": [{"body": "This is exactly my opinion 💯", "score": 1, "replies": []}]}, {"body": "Facebook as it is is a utility. Like an electric or phone company. They produce a product that has a large user base, and is mostly immune to things like recessions, but no new users are coming on and its existing users aren't going to be increasing their use. If anything their user base will decline as people either die or move on to the next shiny thing that does social networking better than Facebook does. \n\nSo it's fairly priced to a bit overpriced BUT should really be paying a 4% or so dividend, the way most utilities do. Until that happens it's not a buy.\n\nWho is to say that Facebook and only Facebook will figure out the \"metaverse\" anyway, assuming it becomes a thing bigger than Second Life? This stuff always ends up being created by new entrants pushing the old guard aside. Established companies by their very nature aren't good at this.", "score": 1, "replies": []}, {"body": "They still have billions of users worldwide and are down like 50% YTD.\n\nI hate boomer book as much as the next person but it'll take time to unwind from that many users.", "score": 1, "replies": []}, {"body": "Idk are all your karen mothers deleting it? No? Then it's not the end", "score": 1, "replies": []}, {"body": "Another feeble attempt to isolate people.  Imprisoned in your home and socializing through avatars?  No thanks.", "score": 1, "replies": []}, {"body": "The \"metaverse\" reminds me of one big SIMS game.... absolutely, positively nothing more. A play thing that intrigues the same class of ppl that make tik tok vids at 30 years old. Absolute garbage like nft's. Just something to create and generate buzz.", "score": 1, "replies": []}]}
