{"title": "Stock Market - Netflix", "selftext": "", "id": "tsoucz", "created_utc": 1648691149.0, "score": 1182, "upvote_ratio": 0.96, "num_comments": 72, "comments": [{"body": "Hey, stop diluting the value of my Netflix shares with this blatant copyright infringement", "score": 162, "replies": [{"body": "So is Netflix a good stock to buy or not? Because I just got into Derived Finance to trade stocks and only have Apple and Google on the list so far.", "score": 3, "replies": [{"body": "Buy index funds for the brunt of your money through S&P or Nasdaq 100, Composite etc. You’ll get nice exposure to all. Netflix in my opinion is at a nice price right now but so are a lot of FAANGs. \n\nPersonally Alphabet Class C (which historically performs slightly better than A), Microsoft, Apple and Meta would all be better imo. Not to mention growth/fintech stocks which have gotten slaughtered this yr.", "score": 2, "replies": [{"body": "I thought Meta wasn't doing as good as expected? So I can get these through Nasdaq 100 and not Derived? Microsoft seems like a good option too.", "score": 1, "replies": [{"body": "Meta was among the most picked up stocks by hedge funds managers last month mainly due to buy on weakness. It didn’t beat mkt expectations for a single earnings session and on top of growth pullback and comments about TikTok from Zuck. Still a great company with a considerable moat and which trades at an attractive P/E and EPS. \n\nAgain though from one stranger on the internet to another, my advice is to get exposure to these companies via indices which is easy as FAANGs are very heavily weighted in many of these funds.", "score": 2, "replies": []}]}]}]}]}, {"body": "I realized over a decade ago, about 10 years after I started investing, that we exist in a shareholder economy. As much as I support a workers’ economy, I will participate in the shareholder economy to my benefit. \n\nHowever, I’m fine with people fighting for a different economy. But I won’t ignore opportunities that may benefit me. \n\nThe problem with the shareholder economy… it takes some knowledge — and understanding/comprehension — to know how to make it work for you. So that crosses out the majority of people. And so populism and protectionism and reactionism (fascism) rules the day, all over the world.", "score": 116, "replies": [{"body": "I think a lot of people also don’t have enough disposable income to save/invest. It’s not easy when living paycheck to paycheck", "score": 28, "replies": [{"body": "... because it's not a worker's economy. And we came full circle.", "score": 16, "replies": []}]}, {"body": ">The problem with the shareholder economy… it takes some knowledge — and understanding/comprehension — to know how to make it work for you. So that crosses out the majority of people.\n\nI don't know, I don't think it really is that complicated for most people's goals. The problem is... ironically.... people get greedy and think \"I'll manage my own investments\". Then they get burned, and blame the stock market, calling it a casino.", "score": 24, "replies": [{"body": "Most people aren’t invested. Think bigger", "score": 20, "replies": [{"body": "They aren't invested because there is a lot of propaganda that portrays the stock market as a casino, and that propaganda gets turned up to 11 during a financial crisis. \n\nThis leads to a situation in which the majority of people are scared off of investing at the most opportune time, and only end up finally giving after and throwing huge sums of money into the market right at the end of a business cycle.", "score": 1, "replies": []}]}, {"body": "Shareholder economies are more efficient due to this added risk. Many people look for other types of economies which are less risky in nature. The issue is that in this global world, you need to be highly competitive else you lose out against other countries as well.", "score": -3, "replies": [{"body": "It sucks out the purchasing power of the \"proletariat\" though, sometimes to Burgundian levels. Also, once the shareholding regime failed to be democratised (or relapses), it becomes an oligarchy by any other means. They'll be hellbent on getting ahead of the exponential growth curve and turn much of it into assets named to them.", "score": 1, "replies": [{"body": "Agreed", "score": 2, "replies": []}]}, {"body": "Risk does not mean efficiency. It means risk. Importantly shareholder economies don't add risk, shareholders hate risk.\n\nManagement might be experts in a certain thing, and feel a lot more comfortable about an idea that defies all conventional wisdom or even (to an outsider) common sense. They're willing to take a gamble, and go hard on a new technology or a new market. That is spooky to shareholders, so they resist the move. This is why tech startups crushed the old giants like IBM, even though the big players had every advantage. Because the shareholders had far greater control on the established companies - whilst two VC investors and a family friend can be convinced on a 10 minute phone call to let some 20 year old with no experience be a cowboy.\n\nIt's also why Blockbuster failed. Blockbuster was building their own streaming platform - and Netflix was shit scared. They were getting squeezed by Blockbuster, they had maybe a few weeks of money left to keep the lights on, and then activist shareholders got control led by Carl Icahn. He canned the streaming project and instead fed all that money they were spending on innovation back to shareholders, because he saw the streaming project as a crazy risk. Stick to brick and mortar, sack everyone who isn't producing a profit (most importantly R&D), and make the company turn a profit today. The Blockbuster streaming team all got jobs at Netflix, Netflix got a flood of new investment from VC firms because they lost their only competitor and suddenly they could keep the lights on. Turns out the shareholders missed out on the next unicorn because \"Greed is Good\".\n\nCompanies with control over their own destinies take risks. Companies shackled by activist shareholders do not.", "score": 1, "replies": [{"body": "You’re not wrong, let me rephrase. When I said risk, I meant volatility- this can be extremely positive as well and humans love to bet on high positive events. \n\nAlso, I was thinking more in the traditional sense of ‘putting money to efficient use’ in the form of shares and loans. This form of transfer gives rise to the form of capitalism we see nowadays where a lot of capital is used for building large and large companies.  Then we get this money back + extra in form of interest or dividends. But the risk is that this money can be easily lost as well if defaults happens. Humans thrive in these risky environments and take better judgement calls, in contrast with communist regimes which lead to inefficient systems. \n\nHowever, this has led to major crashes as well, when people took on too much risk. I’m not arguing that capitalism is bad, i’m just saying it can never be perfect.", "score": 1, "replies": []}]}]}]}, {"body": "It takes no knowledge. There's evidence to show that the best outcomes from participating in the stock market is by those who are dead. An account owned by a dead person will beat a live one.\n  \nThe way to win modern capitalism is to have money to begin with. It's not a knowledge problem, it's a money problem", "score": 2, "replies": [{"body": "But even the knowledge passive investing beats active isn't known to most. It's a money problem but it's also a knowledge problem. I would to see this taught starting grade school.", "score": 2, "replies": []}]}, {"body": "It really doesn’t take that much knowledge. Wall Street perpetuates a myth that you need to be an expert to benefit from investing in the stock market. Let them handle your finances and don’t worry your pretty little head.", "score": 4, "replies": [{"body": "It takes knowledge to know it’s not that hard; and it takes knowledge to know you should be investing in the market, and in time you’ll see substantial gains. Most people think the market is not for them. \n\nCapitalism needs economic losers. Many of these losers show up at Trump rallies, for example.", "score": 3, "replies": [{"body": "Absolutely. In totality, it can be summarized in a few paragraphs to get a young investor started.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Exactly. I’m a beneficiary of a longtime subscription to motley fools stock advisor. More or less every stock in my portfolio is a pick from that or another of their services. I’ve beaten the market every year for the last 15 years. Their focus on investing in *companies* not stocks, on long term focus, eschewing technical analysis and emphasizing product, brand, management, and company culture, have very much shaped my investment outlook.", "score": 1, "replies": []}]}]}, {"body": "Is populism an inherently bad thing?  I see it exclusively used in a negative way, as in your comment.  Are popular policies inherently bad?", "score": 5, "replies": [{"body": "Interesting read:\n\nhttps://www.journalofdemocracy.org/articles/the-populist-challenge-to-liberal-democracy/", "score": 8, "replies": [{"body": "Cliff version?", "score": 1, "replies": [{"body": "[deleted]", "score": 39, "replies": [{"body": "Not sure if targeting previous comment or actually elaborating on link... looks like I'll have to go read.", "score": 14, "replies": [{"body": "This interaction basically just explained why populist policies don't work.\n\nExcept make the explanation 1000x more complex and longer with legal definitions you'll have to Google every other sentence.", "score": 9, "replies": []}, {"body": "Here is an excerpt from the article that I think represents part of the core thesis:\n\n>Populist leaders attack “enemies of the people” in moralistic terms, as corrupt, self-seeking, and given to conspiracies against ordinary citizens, often in collaboration with foreigners. Populism requires constant combat against these enemies and the forces they represent.\n\n>In this way, presuming the people’s monopoly on virtue undermines democratic practice. Decision making in circumstances of diversity typically requires compromise. If one group or party believes that the other embodies evil, however, its members are likely to scorn compromises as dishonorable concessions to the forces of darkness. In short, populism plunges democratic societies into an endless series of moralized zero-sum conflicts; it threatens the rights of minorities; and it enables over-bearing leaders to dismantle the checkpoints on the road to autocracy.\n\nIt is a really well written and thought out piece. I highly recommend giving it a thorough read. It's given me some pause for thought and reflection on our current circumstances.", "score": 9, "replies": []}]}]}]}]}, {"body": "Yes.", "score": 2, "replies": [{"body": "So, am I understanding it wrong, or is something like cannabis legalisation wrong because the majority supports it but the 'ruling elites' don't? Same thing with universal healthcare? And I was having a discussion on how more than 60% of voters support voter ID requirements- does that mean such requirement are bad?\n\nOr is there something I'm missing about the concept of populism?", "score": 0, "replies": [{"body": "You’re confusing majority support for populism. Populism doesn’t mean “popular.” Trumpism is a perfect example. A movement led by elites to activate “the common people” in their epic battle against the elite. Net result is everlasting tax cuts for the ultra wealthy and no cannabis legalization or universal healthcare.", "score": 3, "replies": [{"body": "Thank you- this is the explanation I was hoping for.", "score": 3, "replies": [{"body": "Happy to be of service. Populist movements, like nationalist movements (lotsa overlap), tend to focus on internal enemies and an “us vs them” ethos.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "How do I also participate.", "score": 1, "replies": []}]}, {"body": "#Now tell them about…\n\nhow market makers have privileges to sell you **fake shares** that don’t exist under the guise of “providing liquidity.”\n\nThey get your money. You get a fake IOU in the lemonade stand. \n\nIf the lemonade stand ends up bankrupt the market makers who sold you the fake shares get to keep all the money.\n\nImagine if the lemonade stand splits the entire company into 10 shares. But 100 people want to buy a share. So the market maker sells 90 fake shares because the systems allows them to do that. Now there are 10 real shares and 90 fake ones. This drives the price of the shares down, because there are so many of them. If you wanted to buy one, there are literally 100 people who could sell you one. Not 10 like it’s supposed to be. But since it’s their system, they don’t let you see how many fake ones they have sold. So all the shares aren’t worth as much. Worst part, you don’t actually know if you own a real share. \n\nSo get this, if the lemonade stand goes out of business the market maker get to keep all the money from the 90 fake shares they sold. Want to know what they do?\n\nThey pay the news company’s to spread fake news about the company. **“Breaking news: sources familiar with the matter say lemonade stand is giving people diarrhea.”**\n\nNow all of a sudden sales go WAY WAY DOWN. This drives down the share prices. At the same time, anyone who wants to buy a share thinking the company might actually survive will get sold an IOU from the Market Maker. (Since the market maker knows they will just get to keep your money, they are more than willing to sell you the fakes.)\n\n**This is known as short and distort** \n\nIt is illegal, however. If the market maker gets caught, he doesn’t actually get in trouble. He actually just has to share some of his profit with whoever caught him. The fine is so tiny that in the end, even with a fine, he actually gets to make way more money for running the lemonade stand out of business. \n\nNow imagine if the market makers have been doing this to startup technology companies for 30+ years. Imagine if they have been doing this to cancer research and startup medical device companies for 30+ years. \n\nImagine how much money they have stolen from regular working class people. \n\nHOLY FUCKING SHIT. This next one is going to make you shit your pants. \n\nYou know your 401k at work? The pension fund for your cities police? Or your cities firefighters?Who manages that money?\n\nIt’s the banks and market makers who manage it. So imagine if you have your lemonade stand and they issue 10 shares. The market maker decides that the firefighter pension fund is going to buy 900 shares of the lemonade stand. Who are they going to buy all those shares from? The fucking market maker is going to use the pension fund to buy fake shares from the market maker. \n\nThen the market maker is going to drive the lemonade stand out of business and they get to basically keep all that money from the firefighters pension fund! They get to steal right under our noses!\n\nWHAT. THE. FUCK.\n\n***Bonus content:** Imagine if there’s a global pandemic. There is a brick and mortar store that is in a ton of debt and sells an outdated product, let’s just pretend it’s video games.\n\nThis store is for sure going out of business. No doubt about it. \n\nThousands of people on reddit start buying shares in this game company to try and save them because they grew up with this company and want to see it survive. \n\nMarket makers are very very happy to sell every one of these buyers on reddit fake shares because they will get to keep all their money when the video game company goes bankrupt. \n\nSo let’s say there are now 70 real shares and 1000 fake ones!\n\nNow get this. What if some billionaire investor, who is an expert at selling products online, sees how cheap this company is and decides to buy 10% of the company. \n\nAs the largest individual shareholder he now get to join the board of Directors of the company. He replaces all of the top people in the company with his very successful friends who know everything about turning a company into a successful online store. \n\nThe market makers pay the news to spread false information about the company to drive down the sales: **“BREAKING NEWS: forget GameStop. Just download your games online.”**\n\nNow let’s say the people on reddit see this happening and it all fucking clicks. Holy shit they are using their special market maker powers to sell shares that don’t exist and they are doing it to drive good companies out of business so they can make billions of dollars. \n\nWell, we own 140% of the company. And the company is transforming into a technology company as we speak. \n\nWhat if we all just hang onto our shares and refuse to sell them. If the company starts making more money and doesn’t go out of business then the market makers will have to pay us back for all the fake shares they sold us. \n\nMarket makers see this and say: “holy shit, oh no, we are screwed.”\n\nThey launch a whole campaign to discredit these reddit investors. They try to make them seem like crazy conspiracy theorists to keep more people from joining them. \n\nSmaller hedge funds see this and they are forced to buy back the fake shares they sold because it’s now too risky. This drives the price up to $400. \n\nGameStop the company issues 5 million new shares. They pay off all of their debt with the new money they raise and they buy 1 billion dollars in inventory right before a huge supply chain issue. \n\nUh-oh. I would hate to be a market maker right now. Now the company is making tons of money with zero debt and the shareholders have started to request their share certificates. \n\nBut there are only 70 real certificates and 1000 fake ones. What is going to happen when all 70 certificates are accounted for and everyone realizes that the stock market is nothing but a giant deregulated shit show of a scam?\n\nWhat happens when other countries find out that the most trusted and largest market in the world is nothing but a Ponzi scheme by American banks?\n\nWait a minute. Half of the governments income is from financial services? The financial services that are manipulated?\n\nOh no, the government is making money by allowing the big banks and market makers to steal from their citizens?\n\nThis is not going to look good. \n\nAnyway. 125,000 people so far have registered and recalled about 25% of the publicly available shares in GameStop and when that number reaches 100% shit is going to get real real interesting. \n\nGo to (computershare .com) to purchase real shares of GameStop stock and hold onto it for dear life. We’re about to expose decades worth of crime on Wall Street that has gone on supported by our government and regulatory agencies like FINRA and the SEC. \n\nGOD SPEED EVERYONE.", "score": 7, "replies": []}, {"body": "All Movies & Documentaries about the stock market are shallow beyond belief. Great example here is how they talk about what Friedman believed, without going into why he believed it, and this gives an uncritical audience a false sense of perceived objectivity.\n\nAnother great example is in \"The Big Short\", in the scene that portrays how the credit ratings agencies were selling inflated ratings to the highest bidder. That was entirely true, although I'm not sure I believe the part where the employee outright admitted as such, usually in the real world people rationalize what they're doing to the point that you could never get them to even admit to themselves that they're benefitting off of a perverse incentive structure. Of course, like many Hollywood dramas about real world events, you have to pay attention to what ISN'T said. The question of how the ratings agencies got into such a position that they could sell fraudulent ratings is never asked, and that's because the answer doesn't really fit the narrative of the movie. The ratings agencies all had a regulatory monopoly.", "score": 35, "replies": [{"body": "Yeah this clip is trying to tell a story. The reality is way more complicated, to the point that very smart and informed people argue about what is happening and what should be done.", "score": 1, "replies": []}]}, {"body": "Money was printed. End of story.", "score": 5, "replies": []}, {"body": "Netflix has an agenda, it’s up to each of us to play their game or not.", "score": 10, "replies": [{"body": "You’ve got an agenda.", "score": -4, "replies": [{"body": "Everyone does. They just think theirs is better than anyone else's. Normal psychology although no one is willing to admit it.", "score": 4, "replies": []}]}]}, {"body": "The problem isn’t shareholders or capitalism.  The problem is the way our system creates money.  We run on a system that only works by monetizing debt.  This system creates inflation and short term decision making.  Sound money would go a long way in addressing the issues in this video.  Money is the life blood of society.  How it is created makes the entire system work or fail.", "score": 2, "replies": []}, {"body": "Some super investors like [Ray Dalio](https://smartmoneyunlock.com/hedge-funds/ray-dalio-bridgewater-associates) is selling their [NFLX](https://smartmoneyunlock.com/stocks/NFLX/nflx-netflix-inc/activity) Stock.", "score": 2, "replies": [{"body": "But  [Polen Capital](https://smartmoneyunlock.com/stocks/NFLX/nflx-netflix-inc) & [Joel Greenblatt](https://smartmoneyunlock.com/stocks/NFLX/nflx-netflix-inc) added more shares", "score": 1, "replies": []}]}, {"body": "THEY CAN'T KEEP GETTING AWAY WITH IT!", "score": 3, "replies": []}, {"body": "Stock go burrrr.", "score": 4, "replies": []}, {"body": "Great video on the stock market!", "score": 2, "replies": []}, {"body": "Oligarchy heads need to roll otherwise they won't hear us. 🤷🏼‍♂️", "score": 4, "replies": []}, {"body": "Bubbles pop, and we are in a bubble", "score": 1, "replies": [{"body": "Yea we've been hearing this since many years", "score": 2, "replies": []}]}, {"body": "The cool part is that we can innovate and evolve. This broken and rigged paper system that is as outdated as 90s grunge will be replaced soon with technology", "score": 0, "replies": [{"body": "smells like teen spirit", "score": 4, "replies": []}]}, {"body": "New documentary?", "score": 1, "replies": []}, {"body": "Peoples networth don’t go up becusse they continue to buy shit they don’t need. The shit they don’t need lines the pockets of companies", "score": -4, "replies": []}, {"body": "Biased video. That's why I'm not paying for Netflix.", "score": -5, "replies": []}, {"body": "This left me wanting more and more and more...", "score": -1, "replies": []}, {"body": "The only documentary you need to watch on the subject is Wolf of Wall Street. That’s how I learned everything I know.", "score": -1, "replies": []}, {"body": "Crime that's what.", "score": -1, "replies": []}, {"body": "u/savevideo", "score": 1, "replies": [{"body": "###[View link](https://redditsave.com/r/StockMarket/comments/tsoucz/stock_market_netflix/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/StockMarket/comments/tsoucz/stock_market_netflix/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)", "score": 1, "replies": []}]}, {"body": "Gg. What a news.", "score": 1, "replies": []}, {"body": "You could argue the same thing about a workers’ economy. The problem isn’t that it takes knowledge and understanding, the problem is you have to have money to invest in the first place. Lack of upward mobility + a system that doesn’t work for the majority = inevitable social unrest, populism on both sides of the political spectrum.", "score": 1, "replies": []}, {"body": "Market is fukt", "score": 1, "replies": []}, {"body": "Haha, wages aren’t paid with profits. I get what they’re saying, but that isn’t how the math works.", "score": 1, "replies": []}, {"body": "I sold all of Netflix made some nice coin. They got a ton of competitors fighting from market share now.", "score": 1, "replies": []}, {"body": "Netflix is definitely a good one to buy. And it also has the potential to grow because of the entertainment industry. \nAm looking to start trading stocks on derived finance very soon. \nAlready got Tesla and meta", "score": 1, "replies": []}, {"body": "Boom Shakalaka", "score": 1, "replies": []}, {"body": "Good information", "score": 1, "replies": []}]}
{"title": "Tesla once in a generation buying opportunity", "selftext": "", "id": "tss735", "created_utc": 1648702535.0, "score": 134, "upvote_ratio": 0.92, "num_comments": 76, "comments": [{"body": "Fun read, but this report is more bullish than ARK invest.", "score": 51, "replies": [{"body": "Doesn't mean it's wrong though.", "score": 35, "replies": [{"body": "Probably does though", "score": 1, "replies": []}]}, {"body": "If you think about it, all really great companies like, Apple, Amazon, Google, Microsoft did much better than any analyst ever dream of, even better than any Founder of the above companies ever dreamed of (at least publicly). So if you think Tesla is one of those companies, it should do better then really anyone thinks they will, even Elon him self. The catch is the time horizon is usually a bit longer than people think too. The market for Tesla is bigger then the above companies put together even without Tesla Bot. We are dealing with numbers here that are crazy to even think about and Tesla Bot could 10x basically any crazy number we might have came up with before. Not saying this is guaranteed or anything, but I think it’s more likely than not.", "score": 7, "replies": []}]}, {"body": "The once in a life time was at $500 pre first split", "score": 79, "replies": [{"body": "I put almost 70% of my lifetime savings at that point. In terms of absolutes, that isn't much because I am/was fairly young and didn't have a lot. But the market since then has taught me a lot about opportunity cost.", "score": 31, "replies": []}, {"body": "$180 pre-split in 2018 was my once in a lifetime opportunity and I failed the moment miserably and sold instead of doubling down. \n\nThen I got another chance at $490 pre split and bought more but sold that at $900 lol. Now my cost basis is $450 *post*-split.\n\nJust buy and hold people. When it dips buy more.", "score": 13, "replies": []}, {"body": "I bought at $80 pre split! I wish I was more bullish at the time. Had I used my final budget all at once, I now would be sitting on 1500 shares!", "score": 28, "replies": [{"body": "I bought my first lot almost 10 years ago at $32 pre split. That ~$1000 investment is worth about $164,000 now. But I ain’t stopping there.", "score": 32, "replies": [{"body": "I went all in when stock was at ~$15, never sold a single share. \n\nAccumulated some more around $600 a couple years ago.  Don’t plan to sell those either!", "score": 1, "replies": []}]}, {"body": "At least you have 535! That's decent. Just sit on it a bit and it'll grow", "score": 2, "replies": [{"body": "“That’s decent”….GTFOH, that’s awesome.", "score": 5, "replies": [{"body": "Unfortunately, I am 51. That's why it's a pity I had not the balls to go all-it from start. With 1500 shares I would now be retired. 535... not so much", "score": 4, "replies": [{"body": "Don’t get hung up on shoulda-woulda-coulda. \n\nI’m content with my 10 shares pre-split. $55k return on a $5k investment is still damn good.", "score": 4, "replies": []}, {"body": "> I am 51\n\nSo you can let them sit/ride for another decade.", "score": 1, "replies": [{"body": "well, at 51 I can almost to anything I could at 20. When I am 60, I am not so sure I will", "score": 1, "replies": []}]}]}]}, {"body": "I agree!", "score": 1, "replies": []}]}]}, {"body": "I really hope you’re wrong 🥺 because in my lifetime I wasn’t buying stocks at that point", "score": 11, "replies": [{"body": "\"The best time to plant a tree was 20 years ago, the second best time is now.\"  \n-George Washington.", "score": 28, "replies": [{"body": "Uhhh I think that was Albert Einstein", "score": 3, "replies": [{"body": "> Don't believe quotes you read on the internet. \n\n-Abraham Lincoln", "score": 11, "replies": [{"body": "\"I did not cut down that cherry tree.\"\nSteve Wozniak.", "score": 5, "replies": []}]}]}]}, {"body": "I started following Tesla in November of 2019. I wasn't even an investor at that point yet, and being afraid to dip my toes in the water, I held off buying TSLA.  \nThis was when TSLA was around 300$ pre-split.\n\nI spit on myself for holding off until august of 2020 when I finally took the plunge when it was at 440$ post split.\n\nBut hey, like u/simcrak said, the best time to plant a tree was 20 years ago, the second best time is now.\n\nI missed out on that early growth because I was afraid to enter the world of stock investing \"but what if you're wrong about Tesla? But shouldn't you diversify?\"\n\nToo bad for that.\n\nBut now I'm convinced that TSLA is far, _far_ from its peak, and even above $1,000, it's still the bargain of the century, and I'm buying with every spare cent.  \nSorry, I channeled Steven Mark Ryan for a sec.", "score": 13, "replies": [{"body": "The first stock I ever purchased was Tesla back in 2016. I knew very little about Tesla and even less about stocks. That was the best decision of my life. I do believe Tesla is still a bargain at $1100 in the long run. Give it 10 years, buy a Tesla Cybertruck with a fraction of the profits.", "score": 3, "replies": [{"body": "Hey investment buddy! We started at the same time!", "score": 3, "replies": []}, {"body": "Nice! I'm glad you held out amidst all the FUD in those early years.", "score": 2, "replies": []}]}, {"body": "yeah I was generally pro-Tesla last decade but didn't think they'd be able to grow past BMW (2M/yr) so thought they were over-valued.\n\nNow I fully buy into the 10M/yr by 2030 thesis (~1/6th the car market -- bigger than Toyota) which comes with a ~$3000 price target . . . FSD, energy storage, and AI are juicers but I'd be perfectly happy with 3X by 2030.", "score": 5, "replies": [{"body": "Man... I'm gonna be honest, if Tesla 3x's by 2030, I'm going to be pretty disappointed.  \nThat's a 14.7% APY over 8 years, which is _good_, but it doesn't blow my mind.\n\nI think of these elements completely differently.\n\nI think robotaxis, autobidder software, and now the Tesla bot will be the core of Tesla's valuation in the long run and car sales is going to be the juicer.\n\nHere's a [comment thread](https://urldefense.proofpoint.com/v2/url?u=https-3A__www.reddit.com_r_RealTesla_comments_neazk5_are-5Fwe-5Fgoing-5Fto-5Fsee-5Fcivil-5Fwar-5Famong-5Fsmall-5Ftime_gykgfm4_-3Futm-5Fsource-3Dshare-26utm-5Fmedium-3Dios-5Fapp-26utm-5Fname-3Diossmf-26context-3D3&d=DwMGaQ&c=dALik9aULZiu4HNQW1islLzi4DN7FT8uR-5WWUZfpEc&r=GV6KBGaTgOiAF_yuRstsmErS7Yoy1hyG4v5WWhQud5k&m=UeDA6jTjD-Kj0mHdHrFbQRJM767zz-byOdCMMkSYY_zz8DznVxCpVYkXP1XOuXpg&s=_dt1cpWyT463sWUkDYA7TvwCu2k0jrHF6F9v4ikEJ3A&e=) I had on r/RealTesla some time ago attempting to demonstrate how TSLA could be worth $16,000 just from FSD.", "score": 6, "replies": []}]}]}, {"body": "You'd be surprised how many once in a liftime opportunities you see in one lifetime lol", "score": 3, "replies": [{"body": "Let me know when you notice a new one pop up please!", "score": 1, "replies": []}]}]}, {"body": "Yeah now it's a once in a half century opportunity. Still time.", "score": 3, "replies": []}, {"body": "Or the $19 IPO", "score": 2, "replies": []}, {"body": "Ahem.", "score": -2, "replies": []}, {"body": "Holding @189/ea.  Literally never gonna sell, this is my generational wealth.  Too much profit to realize.", "score": 1, "replies": []}, {"body": "And 1100 pre this split", "score": 1, "replies": [{"body": "Put it this way, 10k last split is now 100k… it will take a lot longer for a 10k investment to turn into 100k this time", "score": 2, "replies": [{"body": "Tesla still has a 10x in it I believe.", "score": 1, "replies": []}]}]}]}, {"body": ">The world’s largest automakers are drowning in US$900 billion of debt, **with half related to customer vehicle financing**. The three main German automakers VW, BMW, and Mercedes Benz collectively hold US$450 billion of debt, while GM and Ford together hold US$250 billion, and Toyota holds US$150 billion. Each is also facing steep rising costs from factory closures and staff healthcare and retirement benefit expenses.\n\nSo they're not drowning in $900B of debt but $450B of debt. Seems an important distinction.", "score": 31, "replies": [{"body": "You get that what will make them implode will be the financing debt right? Or rather the collapse of the value of the collateral of that debt", "score": 8, "replies": [{"body": "I get that lots of people think that.\n\nHowever from digging through Ford’s reports I know that the financing is one of the most profitable parts of their business and is part of a giant ecosystem of financing that ford sits in the middle of. It’s not just loans secured by cars, it’s also to dealerships for inventory and facilities. It’s also the securitization of those loans to the market at large. \n\nAlso as EVs slowly begin to make up a larger portion of Ford sales, their debt will be backed more and more by vehicles which hold their value and, right now, appreciate at times. \n\nThis is not going to bring OEMs down. Most people are not going to stop paying their auto loan, even if their ICE car loses value. Right now we’re so short on cars that even ICE cars are appreciating. Even once this is sorted out the majority of those loans will be just fine.", "score": 15, "replies": [{"body": "One point ARK has made: people stopped paying their mortgage during the GFC but kept paying their car loans because they needed to drive. Uber and other rideshare services have come into being since then, so it's now much more likely that people would choose to give up their car if fuel prices keep going up or if other pressures raise the cost of living. Uber/Hertz is going to keep expanding their EV fleets which will make them seem like a better option than ICE.", "score": 14, "replies": [{"body": "And the car companies still went bankrupt then and they still exist now.\n\nIn a 2008 scenario, sure, they might go under but that’s not just because of the debt on the books. I’m simply pushing back against the idea that people will just default on that 450B debt due to ice vehicles losing value over the next few years.", "score": 4, "replies": []}, {"body": "People are lazy, they will not give up their cars.", "score": 3, "replies": [{"body": "I'm desperate for an EV. As soon as I get one I will literally park my ICE on the grass and give it away. \n\nI think there will be many people in the same position one day because fuel prices will keep going up and EVs will keep getting cheaper. If you can't sell the old car when you want to trade for a new one then ignoring the loan will be tempting.", "score": 4, "replies": [{"body": "Then they sue you for the money you're using to buy the new car.\n\nYou don't owe them a car, you owe them money.", "score": 4, "replies": []}, {"body": "This is not a rational or ethical thing and people will not do this en masse.\n\nIt’s also not financially wise. Your credit score will get wrecked. The only advantage you’ll have is an EV instead of a gas car. Your fundamental capabilities will not change and you’ll have messed everything up for naught.", "score": 2, "replies": []}]}]}]}, {"body": "yes I've made that same research after checking peoples' debt #s of the legacy makers.\n\nIn the 2008-10 Great Recession people stiffed their mortgage lenders to keep their car payments going.", "score": 2, "replies": []}]}, {"body": "I don’t see ice vehicle’s used car values imploding any time soon.  The “chip shortage” will keep the number of new and used cars expensive.  My old beater van is still worth $6k with 245k miles.  New vans are over 40K and hybrids are 53K.  \nTeslas dont have vans and entry level teslas have a year long waiting list.", "score": 4, "replies": []}, {"body": "The loans are still valid. People will still pay them off.", "score": 2, "replies": []}]}, {"body": "I think  I understand your comment as follow, please correct:\n\nThe customer vehicle financing is somehow a double edged sword: In the short term, the residual value of ICE leases will go up due to the reduced availability of used cars, giving the false impression of not being an investment risk, at least for the next 10 years.\n\nIn that sense, the actual lease \"debt\" may be even see as a very good investment, assuring an higher than expected return.\n\nFor the MBA in charge of LICE, all will look good, or at least not so bad, poisoning decisions for the future. Remember that most MBA in charge temporal horizon is just their tenure period or, more specifically, about one third of it, when they secure their golden parachute.\n\nTo recap, the reduction of global ICE sales of new vehicles, has put pressure on the used ICE market value, increasing the residual value of leased ICE cars, that will look good in the balance sheets, and possibly compensate for the reduction in car sales profits.\n\nSomehow it reminds me of GM before 2008, when their most profitable division was the car financing one, basically GM went bankrupt because of that division when people stopped making car payments. Nobody asked the CEO from where the money was coming from, they just look at the bottom line.", "score": 4, "replies": [{"body": "But remember most people have a car because they need to drive places. Even if their car loses book value, it retains intrinsic value to the household which owns it. \n\nAlso most people (absent an outside event like losing their jobs from a massive financial crisis) don't want to default on their loans.\n\nRemember, this is not a global crisis scenario. It's just normal up and down economy, with the caveat that ICE vehicle value is dropping. People aren't going to default on their ICE loan at above normal rates just because their car is losing value.\n\nAnd, currently, their cars are gaining value while they continue to pay off.\n\nThere's just no realistic, non global financial crisis, scenario where the car loan debt manufacturers hold is a bankruptcy threat. They're making money off of it. They're going to start substituting in more and more BEVs which will bolster their loan portfolios.", "score": 3, "replies": [{"body": "Why are you so confidently discounting the potential of a global crisis scenario?\n\n*in a perfect world* \n\nYes in a perfect world, we don’t live in that world…\n\nBetween geopolitical undercurrents (the rising tide of anti-democratic far right wing movements the world over), the potential for world war, ever-widening income inequality, increasingly catastrophic effects of climate change, accelerating inflation of fiat currencies and the headwinds the supply chain is facing due to all of these factors, not to mention the possibility of further pandemics, etc… there are countless opportunities for crisis to arise. \n\nHeck just a couple years ago we dodged a sub-prime auto lending crisis. \n\nWhat do you expect will happen once EV production scales and hits the steep part of the S-curve, and used ICE vehicles values tank?", "score": 4, "replies": [{"body": "I'm not discounting the chance, I am saying that under standard (not perfect, by any means) economic influences, the legacy auto manufacturers (Specifically Ford, GM, Toyota, VW - not speaking for every niche or struggling brand here) will not go bankrupt due to auto loan debt.\n\nAny number of black swan crises could arise in any number of ways with any number of outcomes. My point is actually strengthened by the history of 2008 - 2009: the automakers went bankrupt due to their loans, and were bailed out by the government and exist today. So *even* black swan events may not be strong enough to kill off government backed automakers.\n\nAs I said in the comment you responded to, even when ICE book values tank, their value to owners does not tank - it's still providing a way to move around. People aren't going to just stop paying their loan absent a drastic economic shock.\n\nEDIT: \n\nBlack Swan events will affect EV makers (see: VW production during Ukraine crisis) as well as ICE makers. Constantly expecting one to come along and destroy only your competitors is just a fantasy.\n\nAnd starting this year/next year US automakers' financing debt will start to include more and more BEVs. I am not very familiar with VW's financial dealings but I assume they've been financing BEVs for a few years now. As the mix of ICE and BEV vehicles in these companies' debt portfolio changes, they will be even less exposed to the potential drop in value of ICE vehicles. It will take some time to get to a truly ideal ratio for them, but the value drop in ICE vehicles is going to take a while as well, considering ICE values are currently *increasing* so now they need a few years to drop back to where they *were* before *actually* declining.", "score": 2, "replies": []}]}]}]}]}, {"body": "Tesla's revenue today is $53.1Bn. This report posits a bullish thesis of $1Tn in 2036, an 18.83x increase in value over the next 14 years. I know share price is never a linear multiplier, but if it was, that would put a theoretical value per share to... $20.75k/share in 2036.\n\nWhoa.", "score": 4, "replies": [{"body": "Amazon is at 3.300 dollars right now. It has been split by 12 since they went public. That makes them theoretically worth 39.600 dollars per (originally issued) stock.  \nSo this number isn't AS crazy as it might sound but still... boggles the mind.\n\n  \nMy favorite stat is still: Tesla isn't the only trillion dollar kid around. But *among* the 1T-club, it's the only member that has only about 2% of its own market!  \nApple, Microsoft, Alphabet (incl. Google) all have pretty much dominated their markets or just share it with 1 or 2 big competitors. They might still gain 5 % market share or such, but with Tesla, there's a lot of place to grow!", "score": 4, "replies": []}, {"body": "$53b for ~1m cars/year... 20m cars/year is 1.06t. Makes sense.", "score": 1, "replies": []}, {"body": "$53b for ~1m cars/year... 20m cars/year is 1.06t. Makes sense.", "score": 1, "replies": []}]}, {"body": "*With gigafactories in Nevada and Berlin opening soon, Tesla will have the necessary infrastructure in place to reach Holon’s 2025 production estimate of 5.5 million EVs per year.* nevada will open soon?", "score": 11, "replies": [{"body": "Pretty sure they mean Texas, lol", "score": 24, "replies": [{"body": "Makes me wonder what else they got wrong.", "score": 30, "replies": []}]}, {"body": "I wish more than one updoot for you.  Article is trash.", "score": 1, "replies": []}]}, {"body": "5 months old article\n\nPublished 01 Nov 2021", "score": 2, "replies": []}, {"body": "This is months old; what makes it relevant now?", "score": 2, "replies": []}, {"body": "Who wrote this? The Tesla Bull from Stealth Wealth Investing?", "score": 4, "replies": []}, {"body": "How is india going to build all these roads for 1/4th of all new EV sales?", "score": 0, "replies": [{"body": "Who cares", "score": 0, "replies": [{"body": "Oh yeah, who cares about critical thinking", "score": 1, "replies": []}]}]}, {"body": ">We believe governments globally will ban the sale of new ICE vehicles by 2040 and ban their use by 2050.\n\nI appreciate the article putting this at the start to clearly setup the fundamental misunderstanding of how many ICE vehicles exist. But hey let's continue:\n\n> The arrival of level 4 autonomous driving (driver attention still required) is also expected to arrive by 2025\n\nAlso great, but hey good luck it's always right around the corner cause Elon promised. It can't be done on the current hardware suite. Quote me on it. \n\n>  Tesla’s integrated energy solution combines solar panels, battery storage and electric vehicles to offer long-term savings unmatched by any other automaker. A family of four living in Sydney can save A$70,000 in electricity and fuel bills over the next 25 years, covering the purchase cost of a Tesla Model 2 in 2023\n\nOh yeah Tesla Solar the shining star of their buisness model. With perpetual delays and no better margins then solar companies a tenth of their size. \n\nAdmittedly I'm a Tesla bear but this article being upvoted to the top is just embarrassing. There is a bull thesis but this ain't it chief.", "score": -1, "replies": []}, {"body": "Cult like title", "score": 0, "replies": []}, {"body": "“Adding additional gigafactories over the next five years will allow Tesla to push its manufacturing capacity above 15 million by 2030, equal to 25-30% of global production.”\n\nSo they need to add what?  5-7 more Gigafactories over the next 5 years?  Seems like they are slow rolling that too much and should\nHave announced the next one or two already", "score": 0, "replies": [{"body": "It doesn't have to be linear. They afforded building two factories with one established and one having only been open for a year.", "score": 2, "replies": [{"body": "I guess its over the next 8 years too.  Still, 10 gigafactories is a lot of attention from management.  Not convinced they can pull it off see how much they have struggled with everything else (solar, semi, roadster, next gen batteries, berlin, FSD, customer service, build quality, insurance, cybertruck, etc). Stuff seems to fall off the plate, not in it", "score": 3, "replies": []}]}]}, {"body": "yup cant buy enough\nsold some to get a house last jan and i regretted it", "score": 1, "replies": []}, {"body": "but also...all its feeder companies such as Nickel, lithium, graphite are also about to surge (even more)...its a ripple effect upstream and downstream...\n\nhttps://www.greenleiter.com/post/not-all-nickel-is-created-equal-why-clean-nickel-is-vital", "score": 1, "replies": []}, {"body": "Never heard about GME I see", "score": 1, "replies": []}]}
