{"title": "Thoughts on Wal-Mart?", "selftext": "They are being really aggressive in ramping up their online presence. They are offering free 2-day shipping without any memberships and lot of the prices are lower on walmart.com than Amazon. \n\nWorth buying the stock? ", "id": "676i8a", "created_utc": 1493002120.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 19, "comments": [{"body": "I don't think so. But that's just me. Amazon has one click buying, prime video even though it not great. Amazon is the future, Walmart the past.", "score": 4, "replies": [{"body": "One huge plus with walmart i see that Amazon should fear is their ability to leverage their retail stores to slash the prices even further by offering option to pick up their item. Walmart said they can slash the price by significant amount if the customer chooses \"pick-up\" at check out. ", "score": 1, "replies": []}, {"body": "That's true, but don't forget that for some people AMZN is greatly expensive stock. ", "score": 1, "replies": []}]}, {"body": "I remember when Wal-Mart was opening a new store every 5 minutes. IDK why but i just can't see walmart.com working even when the data shows it is. ", "score": 1, "replies": []}, {"body": "Walmart and Amazon are the only two retailers I would ever own. Walmart is already the second largest competitor in the online space and like them or not they aren't going to be going anywhere anytime soon.", "score": 1, "replies": []}, {"body": "$WMT is gaining ecommerce market share thru Jet.com", "score": 1, "replies": []}, {"body": "Nah.\n\nI'd pass on Walmart. Online is the future, and to be frank Walmart isn't great with online.\n\nAmazon is great with online. But the stock is priced for them to grow sales 20% for the next decade. They missed and the stock tanks.\n\nInstead I'd go with SHOP. Read up on the name and you will see they have the potential to go up 500-800% in the next decade.", "score": 1, "replies": [{"body": "Wait for shop to drop or buy now?", "score": 1, "replies": [{"body": "I say buy now if you are willing to hold for the long term", "score": 2, "replies": []}]}, {"body": "Yeah but AMZN also is starting to cheap out on shipping services (for real, order something, it will come in a PT cruiser); I don't see any value besides literally have same day shipping and a large inventory. Walmart has both those via its online presence AND ability for store pickup. I think wmt is a great risk investment if you are forward thinking .... remember competition is always going to exist as long as customers have options. ", "score": 1, "replies": [{"body": "I think AMZN and WMT will destroy each others profitability. Not great for stock price. ", "score": 1, "replies": [{"body": "Maybe, but not any time soon. WMT will be the last of box stores to go under to the internet. By then they will have their own cyber presence anyways; but that's years from now. Still money to be made :)", "score": 1, "replies": []}]}]}, {"body": "Why shop and not etsy?", "score": 1, "replies": [{"body": "Etsy is more of a shopping site like Ebay.\n\nSHOP is a full blown platform for businesses to setup their own website instead of sharing a site with thousands of other sellers.", "score": 1, "replies": [{"body": "Just curious cuz a lot compare the two and shop has awful, awful P/E compared to Etsy does it not?", "score": 1, "replies": [{"body": "PE means nothing when a company is growing sales incredibly fast. Last year SHOP grew sales over 90%, while ETSY is only growing revenue 20%.\n\nSHOP is spending heavily on expanding and marketing to get new clients. They could easily rake in massive profits if they wanted to. But their emphasis is to grow the user base instead of profits.", "score": 1, "replies": [{"body": "Ah I get you...", "score": 1, "replies": [{"body": "but you caution is warranted. If SHOP's revenue growth slows then the stock will drop very fast.", "score": 1, "replies": []}]}]}]}]}]}]}]}
{"title": "$CHK good entry to buy the dip + DD", "selftext": "[deleted]", "id": "67a0na", "created_utc": 1493050233.0, "score": 14, "upvote_ratio": 0.85, "num_comments": 6, "comments": [{"body": "Upvote for putting detailed logic for why you trade this stock.\n\nI don't think I can bring myself to jump in on it. It definitely looks tempting in some aspects but to volatile for my tastes currently.\n\n", "score": 8, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Yeah I have looked at CHK previously at least once. I could definitely be wrong about not jumping in on it because it does have some future potential. But that is the nature of the beast, Doing DD and having the courage to believe in your convictions and research can make the difference.", "score": 1, "replies": []}]}]}, {"body": "I wouldn't touch this just yet. Based on my model, showing sell signals on the daily, weekly, and monthly charts. Still has further to drop before reaching a bottom. ", "score": 3, "replies": []}, {"body": "More down days coming. Just like the price of oil. The Saudi's can't just will $60 oil to get their Aramco IPO an ideal lift-off. ", "score": 1, "replies": []}, {"body": "First up: CHK Bearish if this support breaks! Use #MNM to request the next chart!", "score": 1, "replies": []}, {"body": "Are you buying this dip (current $5.23)? I am waiting for the $4's again.", "score": 1, "replies": []}]}
{"title": "AMZN vs MSFT", "selftext": "Amazon market cap is 430 B and expecting Q1 revenue: 35 B\nMicrosoft market cap is 520 B and expecting Q1 revenue: only 23 B.\n\nWhat am I missing? Is AMZN undervalued or MSFT overvalued? I'm sure the Market cap represents the revenue a company will generate.\n\nref: \nhttps://www.earningswhispers.com/stocks/amzn\nhttps://www.earningswhispers.com/stocks/msft", "id": "67bbsu", "created_utc": 1493062006.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 11, "comments": [{"body": "Revenue does not equal profit remember.\n\nAmazon profit margin is pretty thin , Microsoft is very high", "score": 8, "replies": [{"body": "thanks, I miss that point.", "score": 1, "replies": [{"body": "No problem\nBut to expand in year ending on 12/31/2016 MSFT had a net income of 16.798 BILLION \n\nAMZN had a net income of 2.3 billion \n\nSo Microsoft has 7x the profits of amazon .\n\nHowever MSFT is an established company and is not likely to see amazing growth AMZN is still building their company (and doesn't seem to stop) and at some point AMZN will stop trying to grow and can up their profit or will just keep growing and soon own the entire world.\n\n", "score": 3, "replies": []}]}]}, {"body": "MSFT share price is 67.62 and eps was 0.72\n\nAMZN share price is 908.24 and eps was 1.20\n\nSeems like CURRENTLY MSFT is quite the winner", "score": 6, "replies": [{"body": "That's because Microsoft isn't growing at remotely the rate at which Amazon is growing. ", "score": 1, "replies": []}]}, {"body": "You've got some good comments, I wanted to add mine:  AMZN and MSFT are not in the same exact business, it gets a bit more complex since they both have multiple lines of businesses, each at various stages of maturity, various Wall Street multiples, etc.\n\nIn a way you need to look at $AMZN and $MSFT as ~~Mutual Funds~~ *conglomerates*; they are the more modern version of $GE.\n\nPersonally I buy the entire F.A.N.G. ($FB, $AMZN, $NFLX, $GOOG) for my portfolio, to which I add $MSFT and $AAPL, and I am pondering adding $INTC and $IBM.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "YES, direct competition there.\n\nThen there's BING and Amazon interest expanding search above and beyond contextual ads within Amazon.com; but my take is that Google is safe (watch me eat crow few years from now).", "score": 1, "replies": [{"body": "I dunno - my main issue with Google is the search results are taking a dive.  I still like the format, but autosuggestions, didn't you mean, and having to implicitly include keywords (why the fuck would I put them there) are just a few of the things that piss me off.  There's room for someone else to capitalize on this.\n\nI still use Google daily because any iteration of any other service just doesn't feel right.", "score": 2, "replies": []}]}]}]}, {"body": "Buy both", "score": 1, "replies": []}]}
{"title": "Expensive stock with liquid weeklys", "selftext": "[deleted]", "id": "6779bn", "created_utc": 1493012737.0, "score": 6, "upvote_ratio": 0.87, "num_comments": 10, "comments": [{"body": "TSLA", "score": 4, "replies": [{"body": "What about with criteria of: high premiums far OTM? TSLA trades pretty eradically for low premium even at 16 delta (for weekly). ", "score": 1, "replies": [{"body": "nothing in this environment", "score": 1, "replies": []}, {"body": "Just go with TSLA broski. Can't go wrong.", "score": 1, "replies": []}]}]}, {"body": "GOOG", "score": 1, "replies": []}, {"body": "Rad", "score": 1, "replies": [{"body": "Are you that bored or just need some attention? Dumbass. ", "score": 3, "replies": []}]}, {"body": "$AUTSM", "score": 1, "replies": []}]}
{"title": "Earnings plays with DD", "selftext": "Here are some of the positions I'm taking for Monday and Tuesdays earnings.\n\n**$AA calls**\n\n* 2.5% short interest.\n\n* Higher aluminum prices and greater demand from last quarter.\n\n* EBITDA guidance for Q1 adjusted for $1800/ton Al.  Actual average was $1900/ton for the quarter.\n\n\n**$WHR puts**\n\n* MXN-USD is up.\n\n* Short interest is up (6.34%)\n\n* Raw material price higher from last quarter.\n\n* 10% dividend increase  with neutral pps reaction.\n\n**$JBLU calls**\n\n* Haven't forcefully dragged any passengers off of a plane yet\n\n**$MMM calls**\n\n* 5% growth in Q4.  Un-adjusted expectation of 1-3% for FY17\n\n* Recent suing rampage.\n\n**$DFS calls**\n\n* Rate hike = good\n\n* Even if earnings suck, Wednesday tax reform = gooder.\n\n**$LOGI calls**\n\n* Short interest down to 5%.\n\n* Jaybird earphones are retardedly overpriced yet they ran out of inventory last quarter somehow.\n\n* PartyUp speakers selling very well.  Also overpriced hipster shit.\n\n**$LXU calls**\n\n* Because /u/_Creatine_Shits said so.\n\nEdit: [Proof of positions.](http://i.imgur.com/zlMsVmH.png) \n\nUpdates:  \n\n* closed $AA at 150% gain\n\n* closed $LXU at 110% gain\n\n* closed $MMM at 5% gain.  (Broke even after fees)\n\n* closed DFS at 50% loss.\n\n* closed JBLU at 15% gain.\n\n* currently down 60% on $WHR\n\n\n", "id": "6790x7", "created_utc": 1493040473.0, "score": 18, "upvote_ratio": 0.88, "num_comments": 19, "comments": [{"body": "I don't agree with you on the Jaybird earphones. They are one of the best bluetooth solutions.", "score": 8, "replies": [{"body": "I guess you could say they're mid-range price when compared to the rest of the bluetooth earbud market.  I originally wasn't comparing them to the bigger, more well know name brands.  My concern is that the quality + brand reputation might not justify the pricing of the newer models.  Either way, high price product + high sales are great for Logitech at least short term.   \n\nedit:  I see now that their higher end models put them in the top ten brands for the past few years, and that alone would completely justify the pricing for those models.  My bad.", "score": 1, "replies": []}, {"body": "Those look like every made-in-china earbud that ever existed. You can get the same thing for $30. But their website and marketing is nice, so they'll sell.", "score": 1, "replies": [{"body": "Jay birds have really good quality sound for earphones", "score": 1, "replies": []}]}]}, {"body": "All in AA. Lets make some cash.", "score": 6, "replies": [{"body": "I'm supposed to go to AA every night.", "score": 10, "replies": [{"body": "Wait how can you day trade if you're not drunk?", "score": 3, "replies": []}]}]}, {"body": "Your dd leaves a lot to be desired. But hey, I'm not exactly complaining, its more than I contributed. ", "score": 3, "replies": [{"body": "I'm trying to improve my ability to provide better reasoning behind my decisions.  Let me know of any discrepancies or arguments you might have.  I'm a complete noob and my dd methods are not good.", "score": 1, "replies": [{"body": "I'm in $4200 at 32.78 a share. It missed earnings but still popped to $34 and I made a decent penny. Any idea why it is still up?", "score": 1, "replies": []}, {"body": "What you have is a good start but you need to expand, dig deeper. Try to disprove your own selling points. For instance, you may think Jaybird head phones are overpriced but that is merely an opinion. What matters is that they are selling at a profitable price (or stealing market share). Plenty of people loathe apple products and operating systems but that hasn't stopped apple from being the largest company on the exchange.", "score": 1, "replies": []}]}]}, {"body": "[ALL IN AA!!](http://imgur.com/a/JOU7T)", "score": 2, "replies": [{"body": "You cray", "score": 1, "replies": []}]}, {"body": "Haven't played any earnings in a while so I had to fill my itch after looking at this post. Grabbed 5, May 19 $34 calls on AA at 3:59 yesterday. Sold this morning near 100% profit on each. Thanks OP", "score": 2, "replies": []}, {"body": "anyone have time to school me on why buying calls vs just going long is the better move here on AA", "score": 1, "replies": [{"body": "You only have to pay the premium instead of buying an entire share to benefit from the price going up. \n\nSay the price goes from 100 to 110. If you went long you'd make 10%. You could take that same 100 bucks and buy an option contract. Say the premium was $1 per share. Since each option contract is 100 shares, you pay 100 for the contract. If the price goes up to 110 you exercise your option and buy 100 shares for 100 bucks each and then sell them for 110. You make 1000 bucks on that $100 investment. You're up 10x instead of 10%. ", "score": 3, "replies": [{"body": "Mention how the contact expires and what that means. ", "score": 2, "replies": []}]}]}, {"body": "MMM LMT RTN DPS NOK this week. ", "score": 1, "replies": []}]}
{"title": "bac.ws.b bagholders thread", "selftext": "sell or nah", "id": "67ajd9", "created_utc": 1493054900.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 13, "comments": [{"body": "Doesn't it have a pretty good chance to keep running up with some of the Dodd Frank stuff that's happening Wednesday?", "score": 8, "replies": [{"body": "i want to die", "score": 18, "replies": [{"body": "Me too thanks.", "score": 3, "replies": [{"body": "why is it down 5 cents after hours, smh good thing i sold before the closing bell", "score": 2, "replies": [{"body": "I don't show it down at all AH?  Where do you see it down 5 cents?", "score": 2, "replies": [{"body": "marketwatch, 0.79 on my etrade though, weird", "score": 1, "replies": []}]}]}]}]}]}, {"body": "My gut says to sell half if we hit .80 again and buy back in on the dip.\n\nMy inverse says to hold.", "score": 3, "replies": [{"body": "I saw a girl on YouTube who had this crazy idea of selling when it's high and buying when it's low. Haven't backtested her system yet but she may be on to something", "score": 8, "replies": [{"body": "No titties DD and you want to be taking seriously!?", "score": 2, "replies": []}, {"body": "Is this the one that draws the little stock diagram and somehow manages to sell high and buy low at the exact right moment?", "score": 1, "replies": [{"body": "Don't share this too broadly or the Algos will catch on and it won't work anymore ", "score": 4, "replies": []}]}]}]}, {"body": "Got to break even today and got the fuck out. ", "score": 2, "replies": [{"body": "i got the fuck out at a 10 cent loss per share", "score": 3, "replies": []}]}]}
{"title": "VIX ETNs (VIXY, UVXY, TVIX) are going to explode like Pyongyang", "selftext": "[deleted]", "id": "67c1du", "created_utc": 1493068602.0, "score": 15, "upvote_ratio": 0.89, "num_comments": 13, "comments": [{"body": "Yeah. Short as a mother fucker right now waiting for Friday.\n", "score": 4, "replies": []}, {"body": "really because XIV crushed it for me today", "score": 2, "replies": [{"body": "Oh fuck I forgot buy high sell low", "score": 2, "replies": []}]}, {"body": "Right, just like when Trump sent an armada to North Korean waters. Keep investing in that lottery ticket called TVIX.", "score": 2, "replies": [{"body": "If you're looking for a VIX underlying ETN for anything other than the short-term, you cannot and should not be saved. This is exclusively short term advice.", "score": 1, "replies": []}]}, {"body": "How's this going for you guys? :)", "score": 2, "replies": [{"body": "You tell me. VIX hit the second lowest point in the past six months today. At worst, it'll probably drop another six percent, but imho there's a 23% upside on the low end.", "score": 1, "replies": []}]}, {"body": "I hope my put calendar spread on SPX works out for buying vol. I was thinking about a UVXY or other VIX ETN play directly but the /vx futures were too high still today IMO. ", "score": 1, "replies": []}, {"body": "My VXX call losses are starting to make my GSE losses look nonchalant.  \nTo zero or to the moon.", "score": 1, "replies": []}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/wallstreetbets] [Always inverse WSB. Always](https://np.reddit.com/r/wallstreetbets/comments/68mctt/always_inverse_wsb_always/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)", "score": 1, "replies": []}, {"body": "1. Old news\n\n2. Nk doesn't have any international financial institutions \n\n3. You're only hope is if South Korea or Japan gets blown up", "score": 1, "replies": []}]}
