{"title": "Expiry question", "selftext": "Hey guys, sorry if this is a noob question. I've traded around 10 options contracts (Only buying calls/puts) now so I know the basics of options. However I recently bought AMZN Apr 17 calls that state they expire on the 22nd. I was curious as to what this discrepancy is as I've never seen that before and when they actually expire, thanks! \n\nEdit: Screenshot of what I mean\nhttp://imgur.com/a/JrsyB", "id": "63nzpy", "created_utc": 1491422164.0, "score": 3, "upvote_ratio": 0.8, "num_comments": 9, "comments": [{"body": "Optionshouse shows expiration dates a little weird, and not like most other brokers for a reason that is beyond me.\n\nThe \"Apr 17\" are the standard monthly options, and standard monthly options expire on the 3rd Friday of the month, which is the 21st. Again, not sure why Optionshouse shows the Saturday date as expiration, but Friday is the last day you can trade these. \n\nAnd another word of caution, Optionshouse does and will exercise options well before the market close on expiry day, so If you don't want to be assigned, get rid of them in the morning!", "score": 5, "replies": [{"body": "Are brokers even allowed to do that (exercise during the day like you said)? They are basically doing a market transaction on your behalf without you instructing them to do!", "score": 1, "replies": [{"body": "Sure they can. It's in the terms you agreed to when you signed up. Similar can happen if their risk department thinks you're overextended, they can close positions", "score": 2, "replies": [{"body": "Makes sense. Never seen automatic exercises though before the actual expiration! ", "score": 1, "replies": []}]}]}]}, {"body": "This is a technical answer to the question:\n\n* The last time an investor can trade an option on each trading day is 4:02 PM (you'll commonly see listed 4 PM ET close like equities, but there's actually a little-known lag to cover trades entered right before the close).\n* The last time an investor can exercise an option is 5:30 PM ET on the last business day before expiration (Friday)\n* Options expire at 11:59 PM ET on the Saturday following the third Friday of the month.\n\nThe confusion about all of that has to do with what is observed versus what is legal. So, option expiry IS the Saturday after the Third Friday of the month. However, from a practical standpoint, they \"expire\" on Friday as you can no longer trade them, etc. You'll notice the lag on assignments as to the trade confirms over the weekend, too.\n\nAnyway, I hope that wasn't too boring. But I think it does answer the question.\n\nAlso, to be perfectly technical, all of the times I entered are legally 1-hour earlier and quoted in Central Time as the CBOE is in Chicago, IL in the Central Time Zone.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I thought I remembered a rule change but couldn't confirm it. Thanks. \n\nThat's probably why it quotes Saturday, just the same.", "score": 1, "replies": []}]}]}, {"body": "There are no Amazon options expiring on the 22nd (which is a Saturday - options don't expire on a Saturday). There's an April 21st expiration. \n\nEdit (after you added your screenshot): why it says 4/22 is expiration is beyond me. That's idiotic.", "score": 2, "replies": []}, {"body": "BTW, all my options are settled on Saturday at Fidelity. That's probably what they mean, because they probably had a ton of these questions: \"what time on Friday do options expire?\", \"Is it at market open or market close?\", etc.", "score": 2, "replies": []}, {"body": "Like the others said, but I like to DOOOOOOGPIIIIIILE!  The 17 refers to 2017, and with no day date, it's the monthlies.", "score": 1, "replies": []}]}
{"title": "Best software stocks to consider this year", "selftext": "The software sector is continuously changing in terms of the most and least competitive companies. Given the fact that a great majority of the startups are tech or software, additionally to the well-known giants investors must also follow the companies that are still growing.\n\nStarting with the big names, they definitely have a share of my portfolio because of the good fundamentals and stability. The classic trio: Alphabet Inc. (GOOGL, GOOG), Facebook Inc. (FB) and Amazon.com, Inc. (AMZN) are key assets to hold for 2017. To analyse, in 2016 these three registered a stock return of 16%, 34% and 40% respectively. I would also add Cisco to the list above, especially after raising its quarterly dividend to $0.29 per share.\n\nHowever, a considerable revenue part is generated by the small cap stocks. These are more likely to bubble burst or rise exponentially and require more scrupulous analysis to use it in your own interest. The first potential stock to buy is Shopify (NYSE: SHOP). As an ‘under scenes’ beneficiary of the online shopping trend, Shopify had a very productive quarter so far. After a 18.5% rise in January, it continued to surge in February, having a very promising start overall. As for gaming industry, Amaya (NASDAQ: AYA) is one of the leading companies, providing their services to both customers and businesses. A good indicator is their performance during 2016, gaining around 12%. Another good investment might be F5 Networks, Inc. (NASDAQ: FFIV) considering that it was predicted to reach the $150 level soon.\n\nTo conclude, what are the best software stocks for 2017? Are big name companies a better investment or investors should rather analyse the rising companies?", "id": "63kzdg", "created_utc": 1491392431.0, "score": 24, "upvote_ratio": 0.94, "num_comments": 13, "comments": [{"body": "[deleted]", "score": 3, "replies": [{"body": "UBNT took a bath already this year, missed earnings and dropped prices to try to establish a foothold in a new market, but still didn't hit the volume they expected. I'm not saying they're dying, but I'm not sure they're in the \"sound and growing\" camp.\n", "score": 2, "replies": []}]}, {"body": "FB is also in my portfolio. I'm thinking to add SHOP and MSFT. ", "score": 2, "replies": [{"body": "it blows my mind how cheap MSFT shares are.", "score": 1, "replies": [{"body": "> MSFT\n\nThey are highest they ever have been.", "score": 0, "replies": [{"body": "> it blows my mind how cheap MSFT shares are.\n\nIs a reference to valuation. A stock can be trading at an all-time high and cheap. ", "score": 2, "replies": [{"body": "Agreed, but my experience tells me never to buy a mature stock at its highest value.  I'm just cautious like that.  ", "score": 1, "replies": []}]}]}]}]}, {"body": "I've been looking into $SHOP and $ATVI. I really think $ATVI has something in terms of E-sports, but they have made a few lousy choices this year, which is why im holding off. ", "score": 2, "replies": [{"body": "They are about to release the Overwatch league, which could be game changing for esports if it's successful.  I recently added more to a long position in ATVI.", "score": 1, "replies": []}]}, {"body": "Entered a position in FB this week. \n\nLooking at SHOP, might be a great time to buy that on the current dip. ", "score": 2, "replies": []}, {"body": "$BOX", "score": 1, "replies": []}, {"body": "Csco. Ibm. Bbry. ", "score": 1, "replies": []}, {"body": "I just started DD on Adobe. Looks like a solid stock to own based on past performance but that's about all I can say right now before I dig deeper.", "score": 1, "replies": []}]}
{"title": "To all the miserable bastards that missed the tsla rocket. Here is what your gainz could have looked like", "selftext": "", "id": "63iavs", "created_utc": 1491353146.0, "score": 13, "upvote_ratio": 0.7, "num_comments": 11, "comments": [{"body": "Did you seriously just take a picture of your screen?", "score": 47, "replies": [{"body": "Potato futures ", "score": 3, "replies": []}]}, {"body": "Oh god it's a snow mexican", "score": 24, "replies": []}, {"body": "command + shift + 4\n\nfucking savage ", "score": 11, "replies": [{"body": "I came to brag not to learn things ", "score": 27, "replies": []}]}, {"body": "450% not too shabby", "score": 3, "replies": []}, {"body": "what a piece of shit short this fucking turd", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "nice job fgt", "score": 1, "replies": []}, {"body": "Start > snippet > dont be a fgt", "score": 1, "replies": []}, {"body": "Fuck tesla, take a look at irbt...I've made 44% this year alone. Also, has a great P/E ratio, a great stock", "score": -1, "replies": []}]}
{"title": "BOFI DD", "selftext": "This is my first  DD so its probby gona be shit.\nWhat is BOFI? Bank of internet is a small cap banking company that has no physical branches and as a result has extremely over head.\nBasics stats\nCap Size: 1.57 Billion  \nP/E: 12.7\nForward P/E: 10\nP/B: 2.09\nDiv:0\n% Shorts: 34%\nreturn on Assets 1.71%\n\nThe most important things to notice are that the bank P.E is extremely cheap and is still growing at a high rate as shown by the even cheaper forward PE. Also the bank has a crazy high return on assets of 1.71 compared to other banks like BAC which has a RoA of .83%. Its twice as efficient as BAC since it doesnt have to pay for physical branches. Also there a chance for a short squeeze since 34% of the shares are currently short.\n\nHead winds and positives: Being a bank, BOFI gets many of the head winds as its peers. Rising interest rates means more money via loans. If Trump is  able to repeal dodd frank, that will also help BOFI since less regulation means more loans. Last BOFI has recently partnered up with H&R Block for the 2017 tax season which will help them cross sell and grow even faster.\n\nRisk: BOFI is currently being sued by a former employee which happened in Oct 2015 for money laundering. So far there no evidence of wrongdoing but if new evidence appears the company will tank. However I dont think any new evidence will show up since the bank has already survived a recent audit by the SEC. The most recent dip was caused by a shitty tabloid http://nypost.com/2017/03/31/feds-probe-bank-of-internet-for-possible-money-laundering/ .Its pretty much a rehash of the 2015 law suit and has nothing new.\n\nhttp://imgur.com/a/cBulg\ntl;dr buy the dip and get a cheap moon ticket", "id": "63ibdb", "created_utc": 1491353291.0, "score": 14, "upvote_ratio": 0.8, "num_comments": 11, "comments": [{"body": "I like turtles", "score": 3, "replies": []}, {"body": "Nice DD.", "score": 1, "replies": []}, {"body": "RemindMe! One year", "score": 1, "replies": []}, {"body": "Moon bitches", "score": 1, "replies": []}, {"body": "Their 5 year chart is pretty iffy doe... \n\n\nBut, they're large enough they shouldn't dissappear overnight at least, you'd have a good week to get out I suppose ", "score": 0, "replies": [{"body": "the dip in 2015 was caused by the mentioned law suit. ", "score": 2, "replies": []}]}, {"body": "If the forward P/E is lower than the current P/E, doesn't that mean that next year's earnings are expected to be lower than the past 4?", "score": 0, "replies": [{"body": "no? price/earnings. If the ratio is lower then ether price went down or earnings went up. Their earnings have been growing by double digs annually ", "score": 3, "replies": [{"body": "Ah ok yep I'm retarded", "score": 5, "replies": []}]}]}, {"body": "This is the same bank under investigation for fuckery of their books.   \n\nThey are facing some nice fines and lawsuits.   \n\nThey were great 2-3 years ago but until they clear this shit up I wouldn't touch them.  ", "score": 0, "replies": [{"body": "The investigation has been going on since oct 2015 and hasn't turned shit up. Odds it won't turn anything up since they been investigated for so long. Even if they did get caught doing something super illegal, I doubt the punishment would be anything other than a slap on the wrist. I mean wfc got caught opening illegal accounts and they got a slap on the wrist", "score": 2, "replies": []}]}]}
{"title": "Noob question on Option contracts.", "selftext": "So I am trading in Europe and my broker is DEGIRO. I just looked up amazon and they offered amazon call option for 13& with a strike price of 860 and maturity June 13. \n\nMy question: I just made an order out of curiosity and as far as i can see it was literally an order for the right to buy one share. Dowsnt usually an option contract consist of the right to buy 100 shares?", "id": "63ko3j", "created_utc": 1491387598.0, "score": 3, "upvote_ratio": 0.6, "num_comments": 9, "comments": [{"body": "[deleted]", "score": 3, "replies": [{"body": "degiro sucks. Use banxbroker. They are basically IB in europe. ", "score": 1, "replies": [{"body": "Can you elaborate a bit more? I'm not that convinced by degiro myself but never heard of banxbroker before.", "score": 2, "replies": [{"body": "I am only using them for 2 weeks but I already like them and think they are worth a try:\nPros:\n\nmargin Account (if you need this)\n\ndepots hosted by IB\n\ntrade almost everywhere\n\nrelatively cheap\n\ngood software \n\n", "score": 1, "replies": []}]}]}]}, {"body": "Yes 1 contract = 100 shares", "score": 2, "replies": [{"body": "And the price is only 13€? Seems rather low for 100 shares that are in the money.", "score": 0, "replies": [{"body": "1 options contract is for 100 shares but the price is denominated on a per share basis. So if the price is 13 the option's contract price is 13 x 100 equals 1300.", "score": 3, "replies": [{"body": "So that's what I was wondering about since it only cost 13€. So I basically bought the right to buy one share and not 100 which I never heard before.", "score": 1, "replies": [{"body": "Me either. Weird. I guess double check you bought the right option, but otherwise I'm not sure.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I just put amazon in the search bar and you will get a limited amount of options.", "score": 0, "replies": []}]}]}
{"title": "Amazon will be buying a stake of PLUG", "selftext": "[deleted]", "id": "63l5w9", "created_utc": 1491394761.0, "score": 6, "upvote_ratio": 0.69, "num_comments": 13, "comments": [{"body": "Shit is up over 70% already, worth it to buy in at open?\nWas watching plug forever and it wasnt doin shit, too bad", "score": 8, "replies": [{"body": "Seems like the problem with this kind of shit. You've got about 5 minutes to buy it before all the premium's gone.", "score": 6, "replies": []}, {"body": "Who gives a fuck about PLUG? I'm talking about Amazon ", "score": 2, "replies": []}, {"body": "And its dropping again", "score": 1, "replies": []}]}, {"body": "AMZN needs to split soon. Make it a hundred bucks per share already like Apple did a while back", "score": 7, "replies": [{"body": "what would happen to people holding stock if it split?", "score": 2, "replies": [{"body": "Your number of shares would increase by the ratio they decide to split", "score": 5, "replies": []}]}, {"body": "What's the reason/benefit in doing so, other than reducing the share price? ", "score": 1, "replies": [{"body": "When it is split, more investors can purchase shares. 1 share at $1,000 vs. 10 shares at $100 each allows more liquidity", "score": 2, "replies": [{"body": "So why hasn't Amazon done it yet? Any downside for them?", "score": 1, "replies": [{"body": "Not really any downside unless their stock tanks", "score": 1, "replies": []}]}]}]}, {"body": "why?  they don't need to", "score": 1, "replies": []}]}, {"body": "this is gonna be a good day", "score": 2, "replies": []}]}
{"title": "Butt $PLUG power 23% bought by AMZN", "selftext": "Up 88% pre market. I was holding some, but damn wish I had held more.", "id": "63lcsx", "created_utc": 1491397125.0, "score": 8, "upvote_ratio": 0.7, "num_comments": 8, "comments": [{"body": "That guys DD was right a couple weeks ago. Fuck. ", "score": 23, "replies": []}, {"body": "Sold all of mine a couple weeks ago because all it was doing was losing me money. ", "score": 6, "replies": []}, {"body": "how high is it expected to go? ", "score": 1, "replies": [{"body": "Dunno, but 600M contract with a good company says a lot. ", "score": 3, "replies": [{"body": "My cost basis for PLUG is $9 per share so I hope it at least goes above that!", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "People taking their profits from over night. ", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Idk. Kinda pissed. I had 1000 shares at 1.48 last week. Wasnt doing anything. Sold and now this. It's a good sign with Amazon but I think right now it's going to drop because of people trying to get their profits. I just bought back in at 2.15. Hoping for another nice push. ", "score": 2, "replies": [{"body": "Sorry bro.. I bought and it immediately decided to go to 1.93", "score": 2, "replies": []}]}]}]}]}]}]}]}]}
{"title": "Buy AAPL puts", "selftext": "[removed]", "id": "63lopr", "created_utc": 1491400863.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 10, "comments": [{"body": "No.", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Umm, I'm pretty sure EVERYONE'S super bullish on those super popular stocks haha", "score": 6, "replies": [{"body": "And what happens when everyone in the market starts thinking the same things?", "score": 2, "replies": [{"body": "Way ahead of you...closed most of my positions and took a nice profit a while ago. Just watching now.", "score": 1, "replies": [{"body": "Come on over to the AGRI thread i started, i am making money over there :) why sit there and do nothing?", "score": 0, "replies": []}]}, {"body": "Ooooh, I know, I know! The buying increases, the short squeeze occurs, and they continue to go up?", "score": 1, "replies": []}]}]}]}]}, {"body": "Well my 143/145 Call spread will be happier if it keeps coming down.", "score": 1, "replies": [{"body": "It hit a new all-time high again today.", "score": 1, "replies": [{"body": "And for that, my long stock is happy. Put on the spread as a hedge. Net/net I'm up, but not as much as I could have been.", "score": 1, "replies": [{"body": "Good for you. A better man than I am.", "score": 1, "replies": []}]}]}]}]}
{"title": "Favorite future tech stocks?", "selftext": "Instinctively I think AMZN, FB, GOOGL, MSFT, maybe TSLA, NVDA are all stocks that will likely own the future of tech and are great long term growth prospects.\n\nI think it would be difficult for a new company to rise up and compete with these big boys, but anyone watching any smaller players who could see a big growth spurt or be acquired in the AI/ML/Driverless car/VR/robotics/automation world?\n\nI also don't know much about robotics in general, any recommendations there to check out?\n\nIf you had to put all of your money in one future tech stock right now, what would it be and why?", "id": "63m4ff", "created_utc": 1491405198.0, "score": 3, "upvote_ratio": 0.63, "num_comments": 13, "comments": [{"body": "I would not touch tesla. They r the only one out of Those that isn't profitable. The rest all look great. I would do amazon caz they r the leader in online shopping and cloud computing ", "score": 11, "replies": []}, {"body": "Shopify. Huge rise in online small businesses.", "score": 3, "replies": []}, {"body": "IRBT is kind of a cool one. Do your own DD.", "score": 1, "replies": [{"body": "I'm not asking you to do DD for me, I'm on a forum where people come to share information about stocks and try to make each other rich so we can all ride yachts into the sun. I've shared my thoughts and knowledge, and I appreciate when others do the same. \n\nI don't think there's a lot of greed here in terms of not letting others know what you know, that is not the WSB way. This is my safe space, don't ruin it.", "score": 2, "replies": [{"body": "I meant do DD on IRBT. I wasn't shitting on you.", "score": 8, "replies": [{"body": "Cheers and sorry! Best friends again?", "score": 3, "replies": [{"body": "Yee", "score": 3, "replies": [{"body": "I foster positive relationships :-D", "score": 1, "replies": []}]}]}]}, {"body": "I think he was simply saying \"do your own DD\" in the capacity of \"make an informed decision to invest after doing your own research.\" not deriding you and implying you are looking for free information. \n\nRead into things much?", "score": 7, "replies": [{"body": "I guess usually I see the statement \"do your own DD\" said in that derogatory way and it's a trigger statement for me because I'm a sensitive guy with real feelings.\n\nApologies if that wasn't the case and thanks /u/boseballa2187 for calling me out and having a Reddit name I'll never understand but would like to. Do you own 2,187 Bose headphones? When you buy another do you have to change your name on Reddit?", "score": 3, "replies": [{"body": "Lolololol... snowflake :-P \n\nThe world will never know. ", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Downvoted on r/investing; what do you think?", "selftext": "Posted this in r/investing in response to someone saying the bull would charge ahead forever despite Trump. What do you think?\n\nCredit availability is at an 8-year high; Equity prices are at all-time highs; Fed can only go up with interest rates; The last 2,000 points on the DOW are pure Trump deregulation excitement; Consumer confidence is at 8-year high; Uncertainty is growing and there're rumblings that the sure-thing political machine doesn't have what it takes; All signs point to a correction within the year; not catastrophic, but definitely a price correction.", "id": "63oe4e", "created_utc": 1491425919.0, "score": 10, "upvote_ratio": 0.61, "num_comments": 10, "comments": [{"body": "Fuck those guys.  They down vote TA too.  Bunch of accountants\n\n\n", "score": 18, "replies": []}, {"body": ">last 2,000 points on the DOW are pure Trump deregulation excitement\n\nI disagree. Economic indicators and corporate profits are actually really good after having a very shaky 2015 that saw 2 corrections. I think the fair value of the Dow is probably below it's current value, but above 20k for sure.", "score": 6, "replies": []}, {"body": "When one of my credit card companies doubled my credit limit for no reason, it was a little confusing. \n\n\n8th inning of credit cycle - batter up!", "score": 3, "replies": []}, {"body": "I think Trump needs to spend serious money to keep the game going but he's just gonna cut cut cut and that's not gonna be enough. I doubt a major correction but the rallys gonna stall real quick\n\nEdit: and not defense spending. The war machine is overheated and needs a break.", "score": 3, "replies": [{"body": "yeah, i know theres a shitload of talk about war with iran or north korea, but im just not feeling the defense industry as a growth opportunity. \n\nbut then again, what do i know, i got locked into $1,000 bet on tvix thanks to wsb. still holding and waiting for the world to burn.", "score": 1, "replies": []}]}, {"body": "You've got a basic understanding of the problem. A correction IS coming. But you point to no indicators or motives why it will happen soon.\n\nAnyone can say the sky will fall. The real problem to answer is WHEN? \n\nuntil you have real info GTFO. Youll go broke betting against the market.", "score": 3, "replies": [{"body": "Sun cycles or something?\n\nIn all seriousness, though, I don't think there are solid indicators saying when.\n\nI personally think that indictments/impeachment will be the trigger, so in the meantime I'm hedging rather than trying to bet against the market.\n", "score": 0, "replies": []}]}]}
