{"title": "Bullish Ideas for Intel (again)", "selftext": "In case you missed it (and you didn't, you astute watcher of markets), INTC got knocked down again after earnings, just like last quarter.  So, just like in September when  I suggested [bullish option trades](https://optionsalary.com/cheap-chips) in Intel (Ticker: INTC) I'm doing it again.  Obligatory chart:\n\n&#x200B;\n\n[6 month chart of INTC](https://preview.redd.it/gtz5tt26cav51.png?width=757&format=png&auto=webp&s=ce2c90a075d6b92d0d95e4553dfde4ce5b179066)\n\nAfter last earnings cycle's drop, Intel basically stabilized and then climbed back, recovering a portion of the post-earnings loss.  We've again seen Intel meet or beat on its top line revenue as well as earnings per share.  The Data Center Group did come up a bit short on expected revenue and some point to that as the reason for the significant decline.  See all of the earnings details directly on Intel's [site](https://www.intc.com/news-events/press-releases/detail/1424/intel-reports-third-quarter-2020-financial-results). \n\n#### Trade Ideas\n\nWith the stock now back at levels similar to last earnings release, here are a few bullish Intel option trades for playing a recovery in the name:\n\n* 11/13/2020 expiration, sell the 45 put for 0.48 **or**\n* 11/13/2020 expiration, sell the 45/40 put spread for 0.40 **or**\n* Hold tight until after the election and re-evaluate\n* Prices are at the midpoint as of 10/23/2020\n* All trades are for educational purposes and do not constitute financial advice.\n\nSelling the puts outright would result in owning shares at an equivalent of $44.52 if INTC ends below 45 on the 13th.  The immediate return if the put expires worthless is 1.1% or almost 19.5% annualized as this is a 3 week trade.\n\nThe put spreads cap our downside risk in exchange for just 0.08 and also limits margin.  If the spread expires worthless, it will be a return of 8.7% on the $460 risked per trade ($40/$460).  \n\nThe 45 strike is outside of the expected move between now and November 13th.\n\nPersonally, I've put on a \"half\" position and will look to put on more after the election.  I also added a few shares.\n\n#### What's the downside?\n\nEarnings Just occurred and there may be some lingering volatility in the name.  Combined with the election, another approach is to simply wait a week and a half and then re-evaluate.  Another approach is to put on half the size now and wait until after the election to put on the other half.  \n\nMargins are down at INTC vs. one year ago and AMD is a 'flashier' name.  For put sales, I prefer the larger (INTC sells about 10x as much as AMD), slower moving INTC and its dividend in the near term, particularly now that it has gone \"on sale\".  I have and will continue to trade in and out of AMD.\n\nIntel's valuation is well below its 5 year averages and it continues to grow revenue and profits.  Now is (still) a reasonable time to try and pick up shares or at least profit from its currently depressed price.", "id": "jhyimp", "created_utc": 1603651169.0, "score": 157, "upvote_ratio": 0.9, "num_comments": 79, "comments": [{"body": "How do you have all this DD without any mention of what’s driving their financials. Namely their poor node execution and AMD’s consistent execution and taking performance crown for single threaded performance (AMD already having multi core crown).", "score": 86, "replies": [{"body": "They also lost apple for the iphone 12 chips,  which went to Qualcomm...that probably hurts a lot", "score": 13, "replies": [{"body": "Not at all.  That happened over 2 years ago actually.  Very small business/volume compared to the core business in servers/laptops etc.", "score": 6, "replies": [{"body": "~~Do you really consider a hypothetical 10% boost to Intels annual revenue as 'small business'?~~\n\n&#x200B;\n\nEdit: See below.", "score": 3, "replies": [{"body": "LOL was not even close to 10%...and wtf does 'hypothetical' even mean? I guess if Qualcomm hadnt created a monopoly on 5G chips and intel could have sold them to more than Apple(highly unlikley) it could have approached that but thats a big if and that boat sailed awhile back.", "score": 0, "replies": [{"body": "You are right, I was mixing it up with A# SOCs at TSMC. My brain didn't function this morning as my kid woke me up 3 hours too early.", "score": 1, "replies": []}]}]}]}]}, {"body": "I covered more of that in my last INTC recommendation, including the 7nm production delays.  The link is in the post. \nAMD absolutely has more room to run, but INTC is 10x the sales and I think a better candidate for a put sale this week. \nFor AMD there are better plays than selling puts, in my opinion.", "score": 5, "replies": [{"body": "> but INTC is 10x the sales \n\nNow 9... now 8... now 7.... now...", "score": 20, "replies": []}, {"body": "Is there a particular reason you focus on selling puts rather than buying calls though?( I don't actually trade but try to learn what I can, so maybe I'm missing something particular about your recommendations; seems you could just say \"go long\" though. Like main replier there, I'm more interested in hearing why you're bullish on INTC.)", "score": 2, "replies": [{"body": "Not sure if OP has the same idea but selling puts allows you to gain premium without requiring a large move in the price of the stock. INTC could stay exactly where it is and selling puts will make money whereas call options will expire worthless. For big movers buying calls may be a better play(though more risky). \n\nBottom line is determining whether you think the stock will move enough to the point where buying options will yield more profit than collecting premium.", "score": 3, "replies": [{"body": "Yes, this is most of the reasoning. While I do expect INTC to go up over the next three months, I’m not confident it will do so fast enough to beat the decay in the long call options.", "score": 1, "replies": []}]}]}, {"body": "So Intel has 10x the sales, AMD has the better product, yield, supply and momentum to continue taking market share, especially since Intel has so much share to offer, 10x apparently. We haven't even begun to see the notebook swing to AMD. The data centre swing will excelerate, Intel still has no answer to TSMC air curtain process in EUV, neither does Samsung.", "score": 1, "replies": []}]}, {"body": "I'll happily be educated on this one, but isn't Intel's single threaded performance of their i9 processor better than AMD's Ryzen?  This really has nothing to do with a 3 week trade, but am curious from a tech perspective.\n\nI think there are still years of good competition coming out of both companies.  People will tout AMD's recent surge in server market share (call it, 10%), but forget that they used to have 20% maybe 12-15 years ago.", "score": 2, "replies": [{"body": "They used to be better in single threads, but it is looking like the new ryzen are better. \n\nHere's the thing about semiconductors, it takes about 3-5 years to re-tool and design a new chip design that will last about 3-5 years. Expect Intel to lose ground of about 3-5 years as they need to re-tool and design their newest chips. \n\n Yes, Intel is a huge company and they make a ton of stuff and are huge. They are never going away, but they will dip and rise and dip and rise. Right now, it's in a dip. They aren't going anywhere anytime soon.", "score": 7, "replies": [{"body": "Thanks for clarification on performance.  \n\nAgree with your other comments, well said.", "score": 5, "replies": []}, {"body": "sounds like a good idea to sell premium on INTC", "score": 1, "replies": []}, {"body": "Soo calls on AMD?", "score": 1, "replies": [{"body": "Just note that earnings are this week in AMD if you decide to buy calls.", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": -1, "replies": []}]}, {"body": "I sold puts on INTC and think it’s a great play. However, I hate your strike price and expiration date. Not enough premium on your put to tie up that level of cash. Also, election concerns are overblown.", "score": 23, "replies": [{"body": "Sounds like we agree on the thesis.  Certainly adjust the strike/expiration to your liking.  It hits my required metrics, but not yours. Your preferred strike/expiration?", "score": 13, "replies": [{"body": "We definitely agree on the thesis. I think it’s an unbelievably solid risk/reward play in this market.", "score": 10, "replies": []}, {"body": "I sold the Nov. 6th puts at $47.5", "score": 3, "replies": [{"body": "I spent a lot of time selling that same strike after the last earnings event. I think the stock bottomed just below 47 at its lowest.", "score": 5, "replies": [{"body": "It did, that’s what I used as the resistance level for the trade.", "score": 4, "replies": []}]}, {"body": "For $1.3 on Friday", "score": 0, "replies": []}]}]}, {"body": "I think intel is just the first of a long list of companies to report poor earnings. I'm uncertain whether the market is going turn down as a result of realizing the impacts of a slowed economy or if investors will overlook everything. \n\nI love intel long term, but if there was a time for the ~$48 support to break, it would certainly be now. Also, completely agree in premium for risk / capital withheld.", "score": 0, "replies": [{"body": "It really wasn't that poor though. Just didn't blow anyone away and showed some weakness where it wasn't expected.\n\nI think INTC is in a good position for the future.\n\nAll the others that are tied in to production in taiwan could have difficulties if china ramps up its aggression.", "score": 7, "replies": []}, {"body": "Will be an interesting quarter.  Given that a lot of companies are \"tightening their belts\", which will mean delaying things like computer upgrades for their employees (which often have INTC's CPUs), I think you make a valid point.  \n\nINTC held up well around 47 last quarter (close to the 48 level you reference). I agree if it occurs, it would probably drop easily to 45 (rough low in March and August '19)", "score": 1, "replies": [{"body": "Yep! Cap Ex is always an easy and large item to cut back / eliminate. Also agree on the $45. Not a large drop but I think the short term upside is probably equally wide as the downside. I'll probably end up sticking with my existing exposure. Don't want to miss the eventual ride up.", "score": 2, "replies": []}]}]}]}, {"body": "Not getting enough premium for tying up the cash required to sell those puts. I'd rather just buy calls.", "score": 7, "replies": [{"body": "I have long exposure already (shares) and added a bit more.  I also have a risk reversal on a portion of the puts I sold.\n\nOne disadvantage of suggesting a specific strike when selling puts is that different people have different requirements for what is \"enough\" premium.  I'm quite content with targeting \\~20% annualized, but folks can adjust the strike to meet their needs.\n\nEdit: I do expect a drop in Vol post election which would lower the price of purchased calls.", "score": 1, "replies": []}]}, {"body": "My bullish idea for Intel is buying AMD", "score": 12, "replies": [{"body": "Good one.  \n\nSide note if you do - earnings this week", "score": 2, "replies": [{"body": "Oh yeah.  Closed my covered call on Thursday.", "score": 4, "replies": []}]}]}, {"body": "I bought calls @ 55 for Jan 2023 - Fingers crossed they go up a bit and I can unload for a bit of profit.", "score": 5, "replies": [{"body": "2023? Truly?", "score": 6, "replies": [{"body": "Hey sorry - I made a mistake - 2022 - Doing great so far, only down 20% lol", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Well, you may be right about that. The nice thing about having long calls like that is that you can keep losing hope over and over again. It is the same emotional loss with a partially reduced financial loss.\n\nNext time I consider purchasing options, I'll just Venmo you instead.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Intel is a long way away from a dying company. There’s a lot of intrinsic value here - writing puts 10% OTM isn’t exactly a speculative trade.", "score": 12, "replies": []}, {"body": "Intel will be printing cash for years to come.  They've got time to turn things around, start making 5nm at TSM, split off manufacturing like AMD did, hire a new CEO, etc etc.  Dont underestimate Intel, many people have been predicting their demise for a long time now and they are still the leader...if AMD does break their market share dominance i'd expect to see some major changes but until then, they'll just be rolling in cash.", "score": 3, "replies": []}, {"body": "Shrug. It is a short term trade and I'll be out of all INTC before their next earnings.  \n\nPurely for entertainment - Bezos was in finance.  He seems to have done ok.  Strict R&D,  no, but not drastically different than the eBay you referenced.  Tim Cook was definitely called a bean counter.   Is INTC in the same league as AAPL or AMZN.  No, of course not.   I do agree that a shift from engineering to financial engineering (if permanent) would be bad news for INTC.  I also know lots of engineers and they almost invariably complain about upper management and things like \"budgets\" or \"schedules\".  If top talent is leaving, though, that is a real issue.\n\nAMD and INTC have had their ups and downs over the years - I referenced in another reply the mid 2000s when AMD had basically caught up to INTC in market share.  Could this current shift be permanent?  Maybe, maybe not. I'll be out of the trade by the time we know, but as a bit of a tech-geek myself, it should be interesting to watch.", "score": 2, "replies": [{"body": "Yeah Nov 20 strikes will be fine. You know there will be people reading this thread and thinking to buy long term though. \n\nNot exactly - Bezos started with a EECS degree from Princeton, Cook started with a degree in industrial engineering from Auburn. IMO Cook wasn't a great choice product-wise but he has undoubtedly done a great job of creating new revenue streams. \n\nMy issue is that last decade INTC has been lazy and focused on cutting costs - Spectre and Meltdown are evidence that they are focused on producing okish products that maximize margins instead of investing into next-gen technology. You can see it most in the difference between NVDA and INTC. \n\n>  top talent is leaving, though, that is a real issue.\n\nFrom what I've been hearing the engs with 20+ years of experience have started to move on. YMMV depending on who you talk to ofc. Do your own DD etc.\n\n> the mid 2000s when AMD had basically caught up to INTC in market share. Could this current shift be permanent? Maybe, maybe not. \n\nINTC basically choked out AMD by paying bribing OEMs to the tune of billions. The feds would have fined INTC if not for GWB. \n\nYeah haha love talkin tech.", "score": 3, "replies": [{"body": "Bezos worked on wall street and Cook was Called a bean counter as many people worried he'd be too busy counting the beans.  But again, I cherry picked arguably the two best examples and completely ignored their degrees!  \n\nTo now actually take your side - MSFT is probably a 'classic' example - didn't really do much well under Ballmer and now they've been terrific under Nadella.\n\nI thing INTC preferred \"Discounts\" or \"Rebates\" or \"Facilitation\" or \"Exclusive Partnerships\" over bribe...  Certainly an advantage in having all the cash to spend.\n\nGood conversation - appreciate the points (and actually I think we're pretty much on the same page!)  I suddenly have a desire to go look at CPU Passmark scores...", "score": 2, "replies": []}]}]}, {"body": "This is such a common sheeple robbinholder WSB point of view, wee boy. Intel ain't goin nowhere.", "score": 1, "replies": [{"body": "Well then enlighten us nostradamus. Tell us why intel will go up within the next 5 years. \n\nIn all seriousness though I'd love to hear your thesis, because everything I am hearing from people I know who work at intel and those in the software industry is negative.", "score": 1, "replies": [{"body": "There's a space for sad jokes and laughs called wsb. I hadn't read your post history before, that was apparent from this thread, it's obvious when wsb toxicity leaks through. Please take all that greenness, meme stocks, emoticons, and other toys over there to play with the kiddos or else just take a few deep breaths and come back with rational mind.", "score": 1, "replies": []}]}]}]}, {"body": "Good insight", "score": 2, "replies": []}, {"body": "i bought 40c 6/18/21 to do PMCC after the dip\n\ni might close the call by next earnings though\n\nwhat do you think of that?", "score": 2, "replies": [{"body": "I'm thinking strongly about buying 6/18 c's in the a.m. - not sure how long I'd hold but I like this idea!", "score": 1, "replies": []}]}, {"body": "1% ROIC for selling a put? First time trading?", "score": 1, "replies": [{"body": "(Checks trading history, carries the 1, factors in leap (Not to be confused with LEAP) years, recalibrates abacus) - No.\n\nROIC (or simply ROC) is one metric and is borderline useless the way you are using it without considering the timeline that you get a return.  If I promise you 100% ROIC, but it takes 100 years, are you happy?\n\nI have PM, so the actually BP impact in my account is about $480.  Also note that one can buy an \"almost worthless\" 40 put that will only in rare circumstances impact the outcome of this trade and our \"ROIC\" goes up about 8x again, shows that ROIC isn't the best metric in a vacuum.", "score": 3, "replies": [{"body": "It’s 2 weeks out before a huge catalyst, it doesn’t seem worth it. Also that’s great you have PMZ but I was referring to it as a CSP as that is how many people will sell it. I actually do think buying the worthless put I’d smarter for maxing out ROIC unless u plan to have the put exercised and own shares", "score": 1, "replies": [{"body": "Agreed - without PM, for those with smaller accounts, or for those that can't sell naked puts, I often recommend spreading a trade.  That's why in the original write-up, I included both and referenced the margin treatment/risk benefits.  If that wasn't obvious in the write-up, let me know, though, and I'll use it to improve the posts in the future.", "score": 1, "replies": [{"body": "Most people here I’ve met think of selling outs as CSPs not naked (in my experience at least) and so I think it would help to clarify. \n\nAlso in general I would prob prefer to sell PMCC here because Intel IV dropped and if they somehow get any good news, it’ll blast up and doing a ratio of open LEAPs to PMCCs would work out to be more beneficial for me", "score": 1, "replies": []}]}]}]}]}, {"body": "INTC is dying. Not that I don't think you'll make $$ with your puts, but if you do get assigned I would want nothing to do with Intel", "score": 1, "replies": [{"body": "Yes, agreed I'll be fine on the puts short term.\n\nI certainly wouldn't want to be in charge of Intel's 7nm process right now, but I haven't convinced myself Intel is dying (yet).  I may simply be 'old', but I remember when INTC was declared dead back in the mid '00s (there has to be a better way to say that) and then they came back quite nicely and AMD plummeted.  I think for a time AMD even briefly had a higher market share. \n\nI guess we'll see how it plays out over the next several years.", "score": 2, "replies": [{"body": "Not sure they need 7nm for another year or two.  Their 10nm process has a higher transistor density than the 7nm TSMC process that AMD uses.  (See r/hardware threads).  So I don't think AMDs lead is as large as perceived. \nGoing long Intel.", "score": 1, "replies": [{"body": "AMD and TSM are 5nm soon", "score": 1, "replies": [{"body": "2022 before AMD uses 5nm TSMC from what I've read.  The current 5nm TSMC process is for cell phones. Can you point me to article that says sooner?", "score": 1, "replies": []}]}]}]}]}, {"body": "I sold the Nov 20th $47.5P for $1.50 on Friday.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Eh I guess people like an underdog story. But yeah I think the way OP kind of gives advice that seems really specific to only his profile is throwing me off right now. Guess it is what it is and he's just sharing.", "score": 2, "replies": []}, {"body": "Intel = Ford", "score": 1, "replies": [{"body": "Ford is actually trying though. They have good leadership and their products aren't as shit as their American competitors, but not better than their Japanese competitors.\n\nIntel isn't even trying. Every time they open their fucking mouth during their investor call I feel they're having an imposter syndrome.", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "So you're saying the idea, stock, and IV are Consistent?  My understanding is that consistency is key in trading, so I've got that going for me.  Which is nice.\n\nAll kidding aside, pick a stock and I'll add it to the list for a trade idea.  At least I'll get 1 out of 3 right guaranteed!", "score": 2, "replies": [{"body": "Even if it were a crappy stock, can still make money from it.\n\nI was looking at recently too w/dip. My only concern sometimes w/these sticks is 4th qtr woes, semiconductor seems to have cyclical issues. But if short term, maybe OK. I've picked up before & sell calls till they sell unless something I want to try & build a position (then sell calls further otm... Still go sometimes, but still make money).", "score": 2, "replies": []}]}]}, {"body": "INTC solid for mid-expiry calls. When it dips under $49, LEAPS are absolute steals (always sell *before* earnings for INTC  🔥)", "score": 1, "replies": []}, {"body": "I think it's a good idea. I'm long Intel based on current price. People are expecting them to fail and if they only do ok they will be in great shape.", "score": 1, "replies": []}, {"body": "Sold the 11/20 $48p for $1.83 on Friday", "score": 1, "replies": []}, {"body": "When intel ran from 48 to 54 last quarter you should also consider that SPY ran ~8% too.  \n\nI also think theres a bit of a meta with Intel.  Last time people got bullish on the dip and lost (opportunity cost).  This time people may have \"learned their lesson\" and given up or gotten impatient. \n\nI do agree about the best strategy for Intel being selling the puts.  \n\nBut I think its not something you'd  want shares in especially if the plan is to sell covered calls if assigned.  Because IV is too low.", "score": 1, "replies": []}, {"body": "I understand your analysis is purely technical, but why trade against the tide? I'd much rather wait for it to climb a bit and look for new short opportunities rather than risking the thing dropping a leg...", "score": 1, "replies": []}, {"body": "Thoughts on INTC 6/18/21 47.5c it was down over 45% Friday and has a 52 break even? Strongly considering picking up a few tomorrow unless someone can talk me out of it.", "score": 1, "replies": []}, {"body": "Works until it doesn’t. Am I right?", "score": 1, "replies": []}, {"body": "Shares seem like the best play here. Yield is halfway decent, limiting your downside.", "score": 1, "replies": []}, {"body": "Buy AMD. Problem solved", "score": 1, "replies": []}, {"body": "This is a fair idea, obviously dragged down by all the AMD fanboys. I do however concur that financials should be included in accordance to weaker guidance over amd’s prominence in the server industry", "score": 1, "replies": []}, {"body": "Intel is a fossil", "score": 1, "replies": []}]}
