{"title": "Another COVID 19 wave incoming?", "selftext": "Guys, I would like to hear your opinions. I feel like we might experience yet another market “crash” or “dip” or “pullback” because of this stupid COVID pandemic. Might be a good idea to sit on sidelines and speculate the market. Once it starts recovering, scoop up whatever companies you want. \nI honestly hope it doesn’t happen, but you never know", "id": "jiu2ei", "created_utc": 1603770422.0, "score": 4, "upvote_ratio": 0.55, "num_comments": 82, "comments": [{"body": "When did the 1st wave end?", "score": 35, "replies": [{"body": "Look at Europe Numbers, Hes probably talking about that", "score": 7, "replies": []}, {"body": "I believe EU stability/recovery started around late June so", "score": 2, "replies": []}, {"body": "What? Look at the stock market, you’ll know. Don’t be a jackass", "score": -1, "replies": [{"body": "[https://medicalxpress.com/news/2020-06-isnt-coronavirus.html](https://medicalxpress.com/news/2020-06-isnt-coronavirus.html)\n\n[https://www.newsweek.com/fauci-says-first-wave-covid-19-never-ended-us-current-spike-just-exacerbation-1542215](https://www.newsweek.com/fauci-says-first-wave-covid-19-never-ended-us-current-spike-just-exacerbation-1542215)", "score": 1, "replies": []}]}]}, {"body": "Don’t give a shit... with regard to what the market does. I buy every two weeks. 2 QQQ and 1 SPY. Market is down? Ok thanks for the cheaper shares. Market is up? Ok thanks for the shares. You see this face right here?... this is the face of a guy who invests stress free. Go ahead save this comment. Hit me up in 25 years. I’ll be wealthier than I am now, I guarantee it. And no wrinkles either. Stress causes wrinkles. I wouldn’t know, though.", "score": 123, "replies": [{"body": "I always hate cocky people, but this is definitely an exception", "score": 47, "replies": []}, {"body": "Super helpful analysis", "score": 13, "replies": []}, {"body": "Sorry I am a newb what does a QQQ acronym and SPY stand for?", "score": 7, "replies": [{"body": "Tickers for the 2 most common indexes. QQQ is top 100 NASDAQ (mostly tech) and SPY is top 500 across nasdaq and NYSE.", "score": 5, "replies": [{"body": "Thank you that actually means alot, and people here downvoting me hahaha. The competitiveness of some people", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I know but sometimes on the internet there is different information and I see this as a reliable source", "score": 1, "replies": []}]}]}]}]}, {"body": "Do you pay a lot of fees/commission on your purchases?", "score": 2, "replies": [{"body": "Most brokerages have $0 commissions and both of those ETFs have low fees", "score": 2, "replies": []}]}, {"body": "rock ancient hungry fear fuel ten wasteful capable bow attraction\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 2, "replies": []}, {"body": "No, actually I don’t see your face!\n\nThank you for your feedback!", "score": 6, "replies": []}, {"body": "Such a dumb and arrogant comment.", "score": 1, "replies": [{"body": "Haha. Why so serious?", "score": 1, "replies": [{"body": "Well it’s true. No online etiquette what so ever lol", "score": 1, "replies": [{"body": "It’s all good amigo. That’s the problem with texting, and comments like mine... you can’t judge tone. I wasn’t attempting to be arrogant in the least bit. I was attempting to be funny and witty but ya know, maybe didn’t come off that way. Again..... impossible to convey tone with a typed comment (or even when texting friends etc). It’s all good. Take care.", "score": 2, "replies": [{"body": "Yea, I agree. My mistake. I misunderstood. Maybe I’m just too negative lol", "score": 1, "replies": []}]}]}]}]}, {"body": "Damn.", "score": 1, "replies": []}, {"body": "Etf's dont make you rich they are there to preserve your wealth.", "score": -12, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Just invest in good companys with great growth opportunity. Fck dividends i rather see steady climb towards huge growth in revenue/profit margins", "score": -14, "replies": [{"body": "“Just invest in good companies with great growth” \n\nLol. Might as well say “buy low sell high” while at it.", "score": 10, "replies": [{"body": "Look dude it's not hard.   Just buy the companies. Don't buy the bad companies.  Pick the names that go up the most.  Boom, investing is easy.", "score": -2, "replies": []}]}, {"body": "Care to give some examples of good companies with great growth?", "score": 2, "replies": []}]}]}, {"body": "$8000 invested in an SP500 index in 1980 would be worth $682,416 in 2020. I'd call that wealth.", "score": 10, "replies": [{"body": "$8000 invested in Amazon 1998 would now be worth 5.359.498,95 thats what i call wealth", "score": -2, "replies": [{"body": "Good luck finding the company that will be the next Amazon 40 years from now in the midst of the the thousands of companies that won't even exist by then.", "score": 4, "replies": [{"body": "World is changing we can't burn fossil fuel forever. We are now entering an A.I. Era. With this knowledge you can buy a few company's that are leaders in that industry and still not fully grown to their full potentional. I wont say names you have your own brains. World is changing that change comes with great investment opportunity's.", "score": -3, "replies": [{"body": "Not sure what this has to do with what I replied to. I was simply replying to your comment that said ETFs (meaning index funds) can't build wealth.", "score": 1, "replies": []}]}]}]}]}, {"body": "In 15 years, just steadily putting in money without effort, thought, time, or stress  into total market funds and ETFs has given me over 250% in profit. \n\nAnd the raw profit keeps growing faster due to compound interest.\n\nInflation from 2005 to 2020 was 33%\n\nETFs reflecting most of the market certainly builds, not just preserve, your wealth and indeed may make you rich.", "score": 4, "replies": []}, {"body": "Lol 😂 donkey", "score": 3, "replies": []}]}, {"body": "Truth right here!", "score": 1, "replies": []}, {"body": "Its pretty easy to reverse skin aging nowadays for cheap, funny how people will still pay thousands of dollars for botox when they can read a few pubmed studies that'll show them how.", "score": 1, "replies": [{"body": "Then tell me!", "score": 1, "replies": []}]}]}, {"body": "What’s COVID? Should I buy it?? Can’t find the ticker anywhere though.", "score": 23, "replies": [{"body": "Acquiring COVID is not recommended for your health portfolio. If you get it, you might blow up your health account! \n\nYou’ve been warned!", "score": 13, "replies": []}, {"body": "I’m going 20% of my total portfolio on CVID - Chinese stocks are going nuts and this one is under the radar. I think it’s the next NIO, which I should have bought at $3!", "score": 1, "replies": []}]}, {"body": "I don't know that a panic will happen the same way that it happened back in Feb, even with multiple waves. A major sell off like that is caused by some novelty. The corona virus became pretty much a part of everyone's life by now. It sucks still, but it doesn't have that shock effect or panic effect that it had when it first spread around the world. Also, we didn't know much about it back then. We know a lot about it now. It's death rate, who it affects to a larger extent.. Etc.. In a sense, it became the new norm.", "score": 9, "replies": [{"body": "The realities of our troubled economy have not yet come home to roost. I can see a long, cascading effect on the market that, in the end, will be more dramatic than the last...but will happen at a much slower pace. Lean years are coming.", "score": 5, "replies": [{"body": "they have been saying that since 2015 that a 2% rate for the next decade is what they expect. What you have to realize is that destruction creates creation. New entrepreneurs and enterprise will rise up and create growth. And look at the wfh stocks . Adapt to the changes e", "score": 1, "replies": [{"body": "This is unprecedented. More deaths than WW2 and we're just getting started. Another housing bubble likely, student loan debt bubble, mass evictions/layoffs.", "score": 1, "replies": [{"body": "the rich are fine well the poor struggle. A potential Civil War. These thing are all real and could happen. The best thing to do is keep living and keep making small moves financially.  Keep investing. Keep out of debt. And adapt to change ..let it push you ahead.  This new life we live is the new norm it won't ever go away. Just like 1918s h1n1 is still with us to this day", "score": 1, "replies": []}]}]}]}, {"body": "Thats true even the death rate has dropped because they are learning what works best to treat it. Panic buying may happen if a lockdown comes into play but other than that I don't see a full crash when earnings are in line", "score": 1, "replies": [{"body": "The rates are completely overhyped, one of the international medical orgs released stats showing that it has a lower death rate than the flu up to the age of like 50. Add that in with the people who got it and never showed symptoms or didnt get tested, which some evidence shows is a lot.", "score": -1, "replies": []}]}, {"body": "I don’t think there will be a broad sell off like in March. I do think some industries will be affected though. \n\nWe’re hearing about hospitals filling up again in some areas, so I’m getting out of my Medical Devices holdings. I have a feeling the number of elective procedures will go down again.", "score": 1, "replies": []}]}, {"body": "Even without COVID we will experience market pullback or dip or correction. It’s just part of how the stock market operates. Another market crash would probably be another  unforeseen black swan event instead of the COVID. COVID has already been priced in since March’s crash.", "score": 11, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "We don’t know how long but we are adapting to this “new” way of living as shown by the recovery of some stocks. Even if the virus persist, human will still find ways to prevail for every setbacks.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Some companies which are weak are bound to be eliminated as time goes by. But the stock market as a whole will still be there as the companies switches in and out with time as stronger companies took stronger positions.\n\nIf you are investing in the entire market and is diversifying your investment you will still be gaining in the long run.", "score": 1, "replies": []}]}]}]}]}, {"body": "There are obviously many things coming together brewing up a good correction; a very contemptuous election, stimulus not likely to happen before it, layoffs, mortgage delinquencies, record covid cases, not to mention numerous indicators that are simply showing patterns under which other crashes happened. \n\nPeople always say time in the market > timing the market, but don't misunderstand it. Holding cash and waiting for a good (and likely) opportunity to invest at discount is simply common sense. Wait, buy the dip, and hold longterm.", "score": 2, "replies": [{"body": "Contentious is the word you’re looking for, though one candidate is certainly contemptuous.", "score": 3, "replies": []}]}, {"body": "Buy the dip if there is another one", "score": 3, "replies": [{"body": "Winter wave pullback before I slam in my 2021 IRA contribution Jan. 4 is fine by me", "score": 3, "replies": [{"body": "I’m trying to understand what you’re saying but can you ELI5", "score": 3, "replies": [{"body": "In the US, there are tax-advantaged accounts, such as IRA and 401k, that investors can use to save for retirement. \n\n401k plans are offered through employers and typically involve allocating a percentage of each paycheck to your 401k. These plans have a maximum annual contribution limit of $19,500.\n\nIRAs (“Individual Retirement Accounts”), as stated in the name, are individual accounts available to anyone making earned income. You can basically make contributions to your IRA at any time you want. The annual contribution limit for IRAs is typically $6,000. Some people to prefer to DCA (dollar cost average), which means averaging/spacing out contributions (ex. $500 per month), but others (such as myself) prefer to contribute a “lump sum” investment as soon as contributions are able to be made for the year. In this case, that would mean contributing $6,000 on January 4 (the first trading day of 2021). Lump sum investing historically has provided higher average returns than DCA (read more about it here [here](https://investor.vanguard.com/investing/online-trading/invest-lump-sum)) but one of the reasons that people decide to DCA is because they prefer the peace of mind, in case there are any market downturns.", "score": 1, "replies": [{"body": "Can I make contributions to 401K and IRA and save taxes on $25,500? Assuming I contribute $19500 to 401K and $6000 to IRA?", "score": 1, "replies": [{"body": "Yes you can contribute to both. I currently contribute to my 401K through my employer, and a Roth IRA on my own. Will be maxing the contribution limits for both accounts this year (stretching out my employer match for the rest of the year) and hopefully next year as well.", "score": 1, "replies": []}]}]}]}, {"body": "Smart man thinking the same thing", "score": 1, "replies": []}]}, {"body": "Theres literally always another dip", "score": 1, "replies": []}]}, {"body": "Dips will come and go no matter what.\nYes, there is a 2nd wave, coming bad and hard. That’s just news. \n  \n*Edit:* Tl;dr: Doom and gloom, caution, but time in the market beats timing the market.\n  \nAs for future predictions, my astrological, astral and Delphi oracles, foresee: we’re screwed. Very, very, screwed. But not yet.\n \n- Stimulus is a devastating necessity. You won’t get it before elections - don’t be silly. Guess is January.\n- Foreclosures are coming as soon as the stop lifts ~ mid 1st quarter to 2nd. More job losses. Sales will drop. More businesses out, more job losses, more foreclosures. \n- At this point, a couple huge companies (and a few banks) will make news - in a bad way.\n- International political pressure will be applied, especially to currency (you can only print so much before encountering big complaints).\n- A country or two (or more) will see this as a good opportunity to upend the status quo.\n- 2nd half of 21 will be bad, unless we see some truly inspired market and financial control. There’s effort already; but how long can it go? Interesting times.\n  \nA damn big dip, is probable. But we can’t time the market, losing opportunities. Play conservatively, be ready to buy big, be prepared to go long. \n  \nFor anyone interested in the exact Delphi oracle, here it is:\n \n#”Win shall not lose” \n  \n(Pythia said a full stop was missing but, but didn’t clarify whether it goes after “win”, or after “not”.)", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "😆 I go add a tl;dr", "score": 1, "replies": []}]}, {"body": "So should I wait to invest in the market?", "score": 1, "replies": [{"body": "Depends. Where do you think you should put the full stop?", "score": 0, "replies": [{"body": "Sorry what do you mean? Where do I plan on investing? In what stocks?", "score": 2, "replies": [{"body": "No, at the bottom of my post, Pythia’s Oracle. (Full stop = period). Just a joke.\n \nI’m investing very cautiously for now, while keeping free cashflow available (more than usual) for a possible big dip. And I’ll be very conservative until next May at least.\n \nI can’t tell you how/what to play, can only share my approach.", "score": 1, "replies": [{"body": "For sure, I’ve been saving money for so long, and I finally want to invest in the market but it’s definitely not a great time. In my mind at least. I know it’s time in the market first time in the market though but I feel like we’re going to go lower", "score": 1, "replies": [{"body": "Index, etf and solid companies (not memes), will be good - in moderation - even at this market.\nGood luck, you sound like you have a cool, reasonable, approach. 👍", "score": 1, "replies": [{"body": "Thanks man", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Just a flu dude", "score": -2, "replies": []}, {"body": "At least we got another justice", "score": -6, "replies": []}, {"body": "[deleted]", "score": -12, "replies": [{"body": "Everybody give a hand for John \"Myopic\" Robinson.", "score": 3, "replies": [{"body": "Might be dumbest post of the year", "score": 3, "replies": []}]}, {"body": "somebody give this the please vote award", "score": 1, "replies": []}]}, {"body": "What has informed your analysis?", "score": 1, "replies": [{"body": "News. Cases rising in Europe and here in US", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Gunna hang onto \"Stimulus Hopium\" lolol. At least til Nov 9", "score": 1, "replies": []}]}, {"body": "Question is whether it will do anything more than generate a small dip. Back in March, we had no clue if the world was ending. Now we know that outside a few markets the world goes on and some markets actually thrive in lockdown scenarios. I wouldn't be surprised if another wave meant nothing big for the market.", "score": 1, "replies": []}, {"body": "Incoming? It is already there", "score": 1, "replies": []}, {"body": "Dollar cost averaging,  just buy a set amount monthly  or weekly  . Also buy the pull backs on great companies.  I buy most 5% pullbacks . Have cash on the side ready to go .", "score": 1, "replies": []}, {"body": "You can't time the market. Time in the market is better than sitting on the sidelines waiting for another \"crash\". If you're thinking long term, just sit and forget, and buy dips. Your long term position in the market will get through any market volatility.", "score": 1, "replies": []}]}
{"title": "Elon Musk is set to receive the 4th tranche of his Tesla compensation package worth $3.5 billion | Markets Insider", "selftext": "", "id": "jjaiab", "created_utc": 1603834544.0, "score": 282, "upvote_ratio": 0.97, "num_comments": 84, "comments": [{"body": "Crazy how quickly they are hitting these marks", "score": 106, "replies": [{"body": "Just executing with excellence. No big deal.", "score": 21, "replies": []}, {"body": "I have a concern on what this means for SP500 inclusion. If he has got 4 payouts of 3 billion this year that means TSLA paid out 12 billion in stock based compensation. As their TTM adjusted EBIDTA (not including SBC) was 6 billion than their GAAP EBIDTA is -6 Billion . SP500 will not include till they have 4 quarters of GAAP EBIDTA not adjusted EBIDTA.", "score": 9, "replies": [{"body": "I think the loss for Tesla will be the maket price of Tesla options at the date of when the contract was signed and not the amount what elon gets.", "score": 8, "replies": [{"body": "Did tesla even lose a penny?  I mean they didn't pay Elon 12 billion.  They printed out a thing that says ok Elon now has this many shares of tesla.  \n\nHas elon ever sold back his shares?  If not then this really doesn't even hurt shareholders.  I mean this is the creator of the company, who cares if his company is giving him more shares of his company that he isn't going to sell?", "score": 3, "replies": [{"body": "If they ever pay dividends than it matters. \n\nit also matters for accounting.", "score": 3, "replies": [{"body": "1) This shouldn't even be considered, the market isn't expecting tesla to distribute dividends anytime soon as they are in growth phase.  That will be priced in when and if it ever occurs.  Also in what world would tesla share holders be HURT by tesla announcing a dividend (assuming it happens later rather than sooner, it would be suicide right now)\n\n2) How? EPS? This is why there is an adjusted EBITDA.  Also its not like analysts wouldn't consider that and the market is gonna be surprised by a \"lower\" eps (lower on a pershare basis even as tesla reports stronger profits).", "score": 3, "replies": []}]}]}, {"body": "Paying Elon costs Tesla nothing... His paycheck comes from teslas shareholders in the form of depreciation. I for one am happy to pay him:)", "score": 2, "replies": []}, {"body": "Paying Elon costs Tesla nothing... His paycheck comes from teslas shareholders in the form of depreciation. I for one am happy to pay him:)", "score": 2, "replies": []}]}, {"body": "If I'm not mistaken they are options, not shares and therefore there's no impact on the balance sheet until he executes.", "score": 6, "replies": [{"body": "Thats not how GAAP works. GAAP was introduced specifically to count SBC as the tech company earnings otherwise look very inflated. The use of options is common in tech. Part of the reason tech companies have been moving from options to RSUs after GAAP was introduced is the massive impact options have on the GAAP earnings. Musk however still has options not RSUs.", "score": 3, "replies": []}]}, {"body": "Tesla doesn't pay out the 3 billion in SBC.", "score": 3, "replies": []}]}]}, {"body": "He gets shares that he has to hold a few years. I think any serious investor in the company was aware of this payout and factored that in. Truth be told, for the company to achieve the targets is far more important than this.", "score": 88, "replies": [{"body": ">He gets shares that he has to hold a few years.\n\n5 years minimum\n\n[Not actually a payout, just a vesting of stock options. It may never pay out, as the stock can’t be sold for 5 years after exercise. The stock must be bought & income taxes paid, then hold value for 5 years.](https://twitter.com/elonmusk/status/1281503378527236096?s=19)", "score": 17, "replies": [{"body": "Pretty sure considering he is buying the stock with money that has already been taxed he only has to pay additional income tax when he sells 5+ years from now.", "score": 4, "replies": [{"body": "Could you explain this more? I didn't really understand it. Aren't we all \"buying stock with money that has already been taxed\"?", "score": 2, "replies": [{"body": "He’s not actually being given any shares. Instead he has stock options vesting. Stock options allow the holder to obtain shares of the company stock at the price the stock was trading at when the option was originally granted, typically a 1-5 years earlier. When the option is exercised taxes are incurred, but usually an employee doesn’t care because they’re just going to sell the resulting shares right away and pay the taxes with the proceeds. In this case, Elon can’t sell the shares so he’ll have to pay the taxes out of pocket. Because of this he may not be able to exercise the option in full before it expires, typically 10 years after grant.", "score": 4, "replies": []}, {"body": "Yes that was my point is that capital gains tax is only paid when you sell the stock.  The comment above me implied he would pay taxes when executing his options to buy the stock.  Pretty sure that wouldnt be the case.", "score": 4, "replies": [{"body": "Stock options are a form of compensation so federal and state income taxes, along with Medicare and social security, are due upon exercise. The exception to this would be if these are ISO grants instead of the much more common NQSO grants. If these are ISOs he wouldn’t have capital gains taxes or income taxes due on exercise, but would instead be subject to an alternative minimum tax calculation for the year he exercises. If that’s the case he’ll still have a substantial out of pocket expense, but it’d absolutely be worth it.", "score": 3, "replies": [{"body": "So is he taxedon the difference between the amount he has to pay to exercise the option and the market price on exercise?", "score": 3, "replies": [{"body": "Exactly! The spread represents the ordinary income recognized upon exercise. So an award granted at $10 that is exercised at $50 would have a $40 per share ordinary income tax liability times the number of shares exercised.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "I don’t think he has plans of ever selling any shares. Didn’t He say something along those lines?", "score": 31, "replies": [{"body": "Something about selling to fund a base on Mars", "score": 42, "replies": [{"body": "Gonna be more like selling to buy Mars.", "score": 10, "replies": []}, {"body": "Out of curiosity is there any laws for Mars or any type of government.  Could Elon just claim the planet and then set up his own country?  Is all this just unknown at the moment.", "score": 4, "replies": [{"body": "Everything is going according to the plan/simulation ;-O\n\n> \"The Martian government was directed by ten men, the leader of whom was elected by universal suffrage for five years and entitled 'Elon.' Two houses of Parliament enacted the laws to be administered by the Elon and his cabinet.\" \n  \nSource:. \nProject Mars by Wernher Von Braun (yeah the one and only..)\n\nYear: 1953\n  \nPage: 177\n  \nhttps://www.reddit.com/r/space/comments/2vg4fj/in_wernher_von_brauns_book_leader_of_mars_was/\n  \nhttps://www.reddit.com/r/elonmusk/comments/c7heu1/the_1953_book_mars_project_by_famous_rocket/", "score": 3, "replies": [{"body": "LOL", "score": 2, "replies": []}]}, {"body": "[Starlink TOS](https://www.reddit.com/r/starlink/comments/jjc270)\n\n[U.S. signs deal with SpaceX for Starlink](https://spacenews.com/u-s-army-signs-deal-with-spacex-to-assess-starlink-broadband/)\n\n[https://i.imgur.com/vXUdwts.gif](https://i.imgur.com/vXUdwts.gif)", "score": 2, "replies": [{"body": "tricky tricky", "score": 2, "replies": []}]}, {"body": "I guess that since SpaceX is alive it's due to USA funding it, Mars will inevitably be american", "score": -2, "replies": [{"body": "According to that same logic, America is British.\n\nAs soon as a Martian colony becomes self-sufficient, they will demand autonomy.\n\nSame with the US government power over spacex. Sure, right now spacex relies on the US for launch sites and a big part of their contracts. But when they have multiple bases on earth, the moon and Mars, the US will depend on spacex instead of the other way around.", "score": 5, "replies": [{"body": "in facts, America WAS British. it took a revolution and a war to claim independence. I guess this is going to happen in space as well (the whole Gundam saga is about this)", "score": 3, "replies": [{"body": "Or, alternatively, corporate states and colonies. Like altered carbon.\nEloncorp rules mars, while Amazon governs the spacestations in the asteroid belt.", "score": 2, "replies": []}]}, {"body": "I imagine that's one of the reasons he said that the Mars base must aim to be sustainable in case the ships from Earth stop coming.\n\nI'm honestly really excited to watch this play out.", "score": 2, "replies": []}]}]}]}]}, {"body": "He can just take loans using the shares as collateral. Don’t need to sell the shares", "score": 12, "replies": []}, {"body": " [Twitter ](https://twitter.com/elonmusk/status/1280597571459833863?s=21)", "score": 20, "replies": []}, {"body": "Any ceo who says he wants to sell his shares is a dumb ceo. It basically messages to the public: get out now. So its very logical that he said he won't ever sell his shares", "score": 1, "replies": [{"body": "True. But..\n\n> dumb ceo\n\n this is \"$420\" and \"overvalued\" guy we're talking about here, too lol", "score": 3, "replies": []}]}, {"body": "He is buying shares with his own money.", "score": 0, "replies": []}]}, {"body": "All serious investors voted in favor.\n\nAt the time, these goals were near unimaginable— the most highly valued company in the world was $700B and this was the goal post.", "score": 9, "replies": []}]}, {"body": "Good job! Deserves every penny. He’s created amazing products that people want, and are good for the world.", "score": 60, "replies": [{"body": "Meanwhile Bezos is overnighting dildos in neighbor friendly packaging.", "score": 13, "replies": []}]}, {"body": "Get it Elon", "score": 12, "replies": []}, {"body": "Elon will use that money to help establish a city on Mars. As a long term investor, I'm proud that I can help a bit with that goal. Elon deserves the compensation package.", "score": 28, "replies": []}, {"body": "https://www.reddit.com/r/TeslaLounge/comments/ez2fo2/elon_musk_compensation_in_detail/\n\nI think this is a well written post that explains it.", "score": 8, "replies": []}, {"body": "Doe giving Elon stock really cost them anything?", "score": 6, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "only if Elon sells, which he won't, also hes the creator of the fucking company so who cares if he owns more of his own company.", "score": 0, "replies": [{"body": "That's not true at all. It instantly dilutes the value of the outstanding shares by 1%. Whether the market evens it out or not is up to them but each share is 1% less valuable.", "score": 5, "replies": [{"body": "No, not if elon never sells.  Unless you are talking from a voting rights standpoint then yes, but who the fuck buys stock to vote anyway.  From a supply and demand standpoint, on a stock with a P/E of 1000 with an investor base that doesnt even know or care what P/E means... it doesn't change shit", "score": 1, "replies": [{"body": "Firstly you should vote if you truly believe you are an investor and not a trader of a stock.\n\nSecondly again that is incorrect. It is an instant dilution. Since you made the comment \"know or care what P/E means\" I'll assume you actually just don't know. Think about it this way. Company is worth $100 and there are 100 outstanding shares, then each share is worth 1% of the company. If tomorrow there are 101 shares then each share is now worth 0.99% of the company. It doesn't matter what the price is, they are now diluted. If the company were to sell tomorrow you would get 1% less. If they issued a dividend you would get 1% less. And if you voted you would be 1% less heard. \n\nThat is true value of the share. Supply and demand are actually the only things that don't get effected intrinsically. It's the markets responsibility to price in the change. Elon selling is the only directly impacts supply and demand.", "score": 3, "replies": [{"body": "LOL my bad I thought I was in wallstreetbets.  But also, that's not totally correct.  Ill try my best to explain, sorry for the tone earlier, WSB has a twisted way of showing affection towards one another. \n\nThe share price and \"share holder dilution\" are two different things which historically have a strong correlation (so its generally acceptable to assume that when shares outstanding go UP, Stock price goes DOWN).  This is all based on the fundamentals of supply and demand.  If supply goes up, demand for that good goes down.  If a company sells stock on the market to create capital, it causes the price to drop because the supply of stock has gone up.  (This is what you are arguing and I agree that is true)\n\nHowever, this is a different situation.  Because while technically the shares outstanding are up the public float is unchanged.  Go [here](https://www.investopedia.com/ask/answers/062315/what-difference-between-shares-outstanding-and-floating-stock.asp) for more info on shares outstanding and public float.  But here is a quote:   \n\n\"[Floating stock](https://www.investopedia.com/terms/f/floating-stock.asp) is generally the most narrowed metric of analyzing a company’s stock by shares. The floating stock is a measure that excludes closely-held shares. Closely-held shares are stock shares that are held by company insiders or controlling investors. These types of investors typically include officers, directors, and company foundations.\n\n**Many indexes use the floating stock of a company as the basis for market cap calculation**\"\n\nSo, since Elon acquiring new shares will unarguably be considered \"closely held\" the number of shares float is unchanged.  It even says that most indexes use shares float as the basis for market cap.  If you believe that the fundamentals of a market are based on supply and demand, it remains unchanged.  There is not the typical \"shareholder dilution\" that is typical with a company selling on the open market for capital.", "score": 2, "replies": [{"body": "All good man. I'm on wsb as well....tone leaks over all the time.\n\nThe first part of your comment seems to align with what I said.\n\nThe second part about market cap calculations...\nAgreed that these can be classified as closely held and consumer grade systems might not use them in their calculation but I would find it very surprising. Elon outright owns 20% of the company, if that much was unaccounted for it would be a massive swing in the market caps being reported. Not to mention a huge amount devoted to employee comps. They probably take unvested shares and classify those as closely held as they can't be sold.", "score": 2, "replies": [{"body": "In WSB terms: Its priced in.  This isn't news to the market.  If you buy into tesla you already know that Elon is expected to get a certain compensation.  Thus, no shareholder dilution if the market has already accounted for it.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Yes, from a book accounting perspective.", "score": 9, "replies": []}]}, {"body": "He literally put his money where his mouth is since the days near bankruptcy. Well deserved.", "score": 4, "replies": [{"body": "This!", "score": 2, "replies": []}]}, {"body": "One of these days I’d love to see Elon reject his comp tranche, just to mess with the shorts. Like, what would TSLAQ say? “They’re only profitable because Elon didn’t take his compensation, Elon deserves that money!”", "score": 9, "replies": []}, {"body": "All this is doing is giving Elon more of Tesla.  He can't sell it in the short term and he probably won't sell it ever it just means he is even more financially committed to Tesla which is definitely a good thing.", "score": 3, "replies": [{"body": "he can sell his old shares, use them to buy his new shares, and keep the same fraction of ownership.", "score": 1, "replies": []}]}, {"body": "How much is that in total?", "score": 2, "replies": [{"body": "A giga-fuckton I believe.", "score": 10, "replies": [{"body": "With the new battery tech, it's going to be a tera-fuckton.  That's an order of magnitude of giga-fucktons.", "score": 8, "replies": []}]}]}, {"body": "If Tesla is a company that looks past next quarter earnings and stock prices then why is his compensation so heavily based on stock performance instead of metrics like customer satisfaction, delivered cars etc? This seems like it follows the old guard and Tesla falls in the same traps as the legacy auto makers where short term performance (end of quarter deliveries) are heavily incentiviced?", "score": 1, "replies": [{"body": "It is not ONLY based on stock performance. There are two other criteria (Revenue growth and Profit growth). If they are not met, he won't get anything. In this case, profit milestone was hit with 3Q earnings. Stock milestone was hit before.\n\nAlso, he has to PAY money to exercise those options. And he CAN'T sell before 5 years. He usually takes out a loan against his shares to for these unusually large expenses. He doesn't even have the cash the buy them! \n\nNow you tell me how does this reward short term performance?", "score": 1, "replies": []}]}, {"body": "Were there conditions for these tranches? I feel like a condition should’ve been in place like the stock price/market cap must be able to stay at this price for x amount of weeks/months. Just to avoid a pump a dump you know? Because the run up in the last year surely felt like one (I know it’s not) and Elon could just peace out. If anyone has any information about any sort of conditions about the traunches please explain! :)", "score": -1, "replies": [{"body": "The tranches are tied to both market cap and revenue. He needs to reach both targets for each tranche and market capitalization needs to be above each target on both a six month and a 30 day rolling basis. \n\n[pay package details](https://ir.tesla.com/press-release/tesla-announces-new-long-term-performance-award-elon-musk)", "score": 15, "replies": []}, {"body": "Tesla has set a [dozen targets](https://i.imgur.com/omJV4o0.png), each $50 billion more than the next, all the way to a market value of $650 billion. In addition, the company has set a [dozen revenue and adjusted profit goals](https://i.imgur.com/doNisk4.png). Mr. Musk would receive 1.68 million shares, or about 1 percent of the company, only after he reaches milestones for both.", "score": 6, "replies": [{"body": "Just to be clear that's an additional 1% a google says elon ownes ~20% already", "score": 4, "replies": []}]}, {"body": "Best source on the matter: https://youtu.be/XfHWl_Lhf5o", "score": 5, "replies": []}, {"body": "The market cap targets are based on the average stock price of the trailing 6 months not just the price on the day so no pump and dump. Actually since to exercise the options Elon has to pay cash and he is fully invested in TSLA and SpaceX and cash poor he has been actively trying to crash the price so that the tranches dont vest till he can get some cash from the Starlink IPO. Hence the grumbling about TSLA price going up too fast. If he doesnt have cash to exercise the options they will expire after 10 years. And he cant just exercise and sell as he has a 5 year lockin on any shares he gets under the comp plan. He could sell his other shares in TSLA but the ultimate aim of this stock plan is to get majority ownership of TSLA not to make money. Than he can take it private without a vote.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": -14, "replies": [{"body": "As a shareholder I legitimately don't want Tesla to make large profits. I want them to keep spending for future growth as long as the capital can be used efficiently. Amazon has done well under that model.\n\nAlso, paying Musk in shares doesn't directly hit Tesla's cash flow.", "score": 63, "replies": []}, {"body": "I don’t think these awards cost Tesla any money. I think it’s more like us shareholders are paying him via dilution", "score": 4, "replies": [{"body": "It does effect the accounting , though not actual cashflow.", "score": 2, "replies": []}]}, {"body": "To be fair, I’m sure when they made the payout structure they expected the company to be making a lot more money by the time they reached this tranche\n\nNobody could’ve really predicted the explosive growth on the market cap", "score": 4, "replies": [{"body": "Except ARK invest.... Who predicted it in spades.", "score": 23, "replies": [{"body": "They didn't predict is was 1 year out. I think that was their 5 year prediction, which they also thought Tesla would be making significantly more money at that point", "score": -6, "replies": [{"body": "Tesla NPV under the ARK model is higher than the current share price.", "score": 6, "replies": []}]}]}, {"body": "Two years ago I explained why Tesla will become the largest company in the world. Many people knew.", "score": 2, "replies": [{"body": "I mean I \"knew\" too, I made over 100k on a 15k investment. But nobody *knows* what a company's stock will be one year from today, and I don't think Tesla made the payout structure thinking the market cap would 4x in 1 year", "score": 2, "replies": [{"body": "Congrats for your gain!\n\nTiming is hard to predict. But last year when the stock went below $180 that's pretty clear it's time to go loooong.\n\nAlso when it went above $361 with quarterly profit, that's a clear buy point.\n\nAlso when it broke a 4 year consolidation above $400, that's clearly time to add.\n\nAll price before split. \n\nOnly TSLA shorts don't understand all this stuff. Some people have to lose money, it's a casino.\n\nThe market cap will go north of $5T. It can take a while.", "score": 1, "replies": []}]}]}, {"body": "I actually did, when I started aggressively in Tesla 7 years ago and have been literally saying it for ever. People finally started taking me seriously this year", "score": 1, "replies": []}]}, {"body": "He has never received a bonus.", "score": 2, "replies": []}]}, {"body": "I think at some point this should be stopped and reinvested instead. He says he isn't bothered by money and driven by global change yet he's now had 12billion in comp.... Fair play to him but would even he prefer better allocation?", "score": 1, "replies": [{"body": "It's not cash? They can't reinvest it, it's an option to buy Tesla equity at a cheaper price.", "score": 2, "replies": []}]}, {"body": "Let’s go baby boy light a fat one up for this one Elon!! Almost half way there to Tesla world 🚀", "score": 1, "replies": []}]}
