{"title": "BBBY Puts", "selftext": "Alright you fucking autists, when was the last time you stepped into a bed bath and beyond? That piece of shit place is asss as hell and these fuckers closing stores left and right. Now some of you gonna say “bUt ThEyRe sHiFtInG oNlIne” yea suck my dick cause amazon and walmart still gon fuck em up. \n\n\nPosition: 15$ puts 11/20 BBBY", "id": "j56ry7", "created_utc": 1601846222.0, "score": 84, "upvote_ratio": 0.88, "num_comments": 79, "comments": [{"body": "tbh the run up sounded like a short squeeze ,they\n\n1) didnt post future outlooks\n\n2) retail still shet\n\n3) shets expensive", "score": 36, "replies": [{"body": "4. Sheets are expensive", "score": 15, "replies": [{"body": "400 thread count puts on sheets saying theyre 500 thread count", "score": 7, "replies": []}]}, {"body": "most likely.. short interest was 60% before good news..honna go higher after it goes back to shits..", "score": 3, "replies": []}, {"body": "Def was a short squeeze lotto play", "score": 1, "replies": []}]}, {"body": "I bought an $85 chef knife for $7 at BBBY. Can confirm this place is a shit hole other than the clearance items", "score": 38, "replies": [{"body": "lol no you got a 4$ chef knife marked up to $85 then listed on sale for 7$. come on brah", "score": 105, "replies": [{"body": "seriously this chump probably thinks those 20% coupons are really saving him money", "score": 20, "replies": []}, {"body": "Cuts like a champ so I dont care brah", "score": 0, "replies": [{"body": "kid cuts cans", "score": 2, "replies": []}]}]}]}, {"body": "I thought they would drop Friday after the initial run up on Thursday. But no. It went on to run even higher than it did on Thursday. Never thought that would happen. I bought in at $4.50 and finally sold all my shares at exactly $20. Because I thought there was no way it would hold a 30% pop.", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "90%? It didn’t run 90% between close Thursday and anytime Friday.", "score": 0, "replies": []}]}]}, {"body": "I bought puts before earnings expiring last week - RIP. I’m in again for November puts. Hold strong OP!", "score": 6, "replies": []}, {"body": "Friday price movement was a classic case of a short squeeZe", "score": 6, "replies": []}, {"body": "[deleted]", "score": 5, "replies": []}, {"body": "Don't ask me. FUCK BBBY\n\nQuarter earnings came 2 days before. I thought exactly the same. As a New Jerseyean, I know no one goes to BBBY. And even no one orders online from BBBY because their return policy and CRAP. I bought $15 put 10/9 and it got sky rocketed after earnings. \n\nTl;Dr FUCK BBBY", "score": 6, "replies": []}, {"body": "actually just ordered something today off BBBY dot com", "score": 8, "replies": [{"body": "Ok but do u really think theyre doing better than precorona levels? Cause 20$ is too high for them", "score": 7, "replies": [{"body": "nah but nothing makes sense", "score": 16, "replies": []}, {"body": "I don’t get why you think that amazon will be the only online retailer to survive...", "score": 4, "replies": [{"body": "because if I need to order something that bbby sells, I'm definitely just going to order it from amazon.", "score": 5, "replies": []}]}, {"body": "Yes. Speaking of my local BBBY store, they've had WAY more customers lately than they had pre-covid. My theory is that because people have been spending so much more time at home, they are buying things for around the house. \nThe current high short interest is also enough to keep me from opening a short position of my own. The potential short squeeze could be devastating.", "score": 2, "replies": []}, {"body": "Have you ever been in a crowded BBBY? Like, not even had to wait outside to get in, but one that was even close to full? Sure, you might have had to wait in line to check out, but the store itself always could take on people units. By this logic, I could see them maintaining some sort of consistency of sales or recovery to pre-covid levels more easily than other businesses. Gotta buy new towels and shit somewhere, and IKEA’s model isn’t as appealing in a pandemic.", "score": 1, "replies": []}]}, {"body": "Yea i ordered a heating blanket and they had the best deal I thought. Guess the \"beyond\" part is true.", "score": -2, "replies": [{"body": "That is not Beyond. That is Bed.", "score": 6, "replies": []}]}]}, {"body": "Nah, BBBY is good for the ladies to pamper at home. Even I still kinda like their stuff. I think theta will kill your puts. I made money on calls last week, but not nearly as much as I could have if only I held through earnings.", "score": 3, "replies": []}, {"body": "Yea I fucking bought 10/9 16.5p for $.32 before close Thursday and got raped for a 75% drop bruh y tf is this shit so high", "score": 3, "replies": []}, {"body": "10/16 $15 puts myself, yelling “witness” like mad max", "score": 3, "replies": []}, {"body": "This is the IRL version of the Shark and Minnows game.", "score": 5, "replies": []}, {"body": "Pretty sure share price was crazy depressed for a long while and had tons of shorts. Now they post improved numbers and are returning to a fairer value share price and you wanna buy puts? Lol have fun burning your money", "score": 5, "replies": []}, {"body": "I was shorting bbby when it was below $5 and made bank. It will go down. Their stores are poorly managed and full of trash.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "18p, going down with the ship if need be. BBBY can take my money but they can’t take my pride", "score": 3, "replies": []}]}, {"body": "I went in this weekend looking for a food processor. Inventory is low. Some interesting items. But foot traffic was low too. Gonna order elsewhere", "score": 2, "replies": []}, {"body": "Maybe they're stepping up their 'Beyond' and will be transitioning in to EV cars and their own Cloud System", "score": 2, "replies": []}, {"body": "i never go. never will. godspeed sir", "score": 2, "replies": []}, {"body": "I bought a metric fuck ton of 15$ 11/20 puts the moment it crossed 20$ a share", "score": 2, "replies": [{"body": "Is this free money?", "score": 1, "replies": [{"body": "Only if the blue crayons are your favorite.", "score": 1, "replies": []}]}, {"body": "How did that trade work out for you considering BBBY is still trading north of $15?  You had the correct idea, though, as the stock couldn't hold the gains from the ER.", "score": 1, "replies": [{"body": "It hurt big. Live and learn", "score": 1, "replies": []}]}]}, {"body": "Puts then", "score": 2, "replies": []}, {"body": "I highly doubt the people of wsb is BBBY’s target demo.  It’s all dudes here and you have to be able to get a girlfriend to need to go there", "score": 2, "replies": []}, {"body": "Specialty retail is dead. BBBY RIP in a few years", "score": 2, "replies": []}, {"body": "bull case for BBBY -- malls are open, stores are open, people don't have to buy shit online anymore. BBBY looks like a prime candidate for the $BECKY index \n\nI'm thinking $25 EOW", "score": 2, "replies": [{"body": "Puts to the moon budd", "score": 1, "replies": []}]}, {"body": "Bbby 10/9 $21p 100 contracts. Can't go tits up bud.", "score": 2, "replies": [{"body": "RE-inversed", "score": 1, "replies": []}, {"body": "To tha moon bud YOG", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Check it now bud.. looks like I was just a lil early to the party", "score": 1, "replies": []}, {"body": "Tendies baby", "score": 1, "replies": []}]}]}, {"body": "You may want to wait until a short squeeze is over.  It was 60% shorted....these guys are all deciding when to take their losses and buy shares back.", "score": 2, "replies": []}, {"body": "They are subsidized by unused gift cards.", "score": 2, "replies": []}, {"body": "After seeing a big ass pump at open. You son of a bitch, I'm in.", "score": 2, "replies": []}, {"body": "I sold at 12 back in September qq", "score": 1, "replies": []}, {"body": "Idk man, holiday season is upon us and now is that time to buy some late Nov-Dec calls...people love to shop, its a bit therapeutic.", "score": 1, "replies": []}, {"body": "Made a bunch on my 1/2022 5c that cost me 3.05 per contract. Go ask Becky about BBBY, My gf, her sister and mother disappeared into BBBY over the weekend and came out with $1000 worth of stuff and were really happy with that. The brand is very strong.\n\nThe new management team is turning this around. 5 years ago this was a 70 dollar stock. It's been run into the ground. That's the number you need to look at, not the pre-covid...", "score": 1, "replies": []}, {"body": "Hope you made those tendies XXX$ at least. Now its that time again to see what they will do next weeek...\n\n&#x200B;\n\nI am a bull this time. very very bull", "score": 1, "replies": []}, {"body": "Please post your losses in November I would love to have a good laugh", "score": 1, "replies": []}, {"body": "You’re fucked and no I’m not only saying that because I’m long", "score": 1, "replies": [{"body": "Bragging about size?  Classic short play!", "score": 3, "replies": []}]}, {"body": "I got a friend who is always talking this: covid leads to mass movement of people units to new homes which means the new owners have to hit up BBBY to buy trash to fill their new rooms. I don’t know if I totally buy that narrative, but it’s hard to bet against big boxes of trash for sale post-covid. It’s like betting against baseball or apple pie. If you’re long BBBY, DD with a hedge and get some WBA calls, too. That’s where reckless risk tolerance really could pay off.", "score": 0, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "A rube is born every minute", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I am far more educated than him though.", "score": 1, "replies": []}]}]}]}, {"body": "TIL that mortgage and energy bills cost less than cheap household goods", "score": 0, "replies": []}]}]}]}, {"body": "Don’t forget to post your losses retard", "score": 0, "replies": []}, {"body": "actually there are usually lines to get into BBBY here in nyc", "score": 0, "replies": []}, {"body": "I made a bunch of money on earnings. Anyone buying puts here is going to lose it all. The short squeeze is still underway. Their management team is going to turn around the ship. At 20 dollars, the market cap is 2.5 Billion on $12 billion 2019 annual revenue with a trash management team that had ZERO priority on eCommerce/online. This new management team will turn it around. I can't stress how much more important management is than everything else when investing in companies. BBBY is not going anywhere but up in the short term. There is enough room in online retail for several vibrant companies to flourish. I also love when you post \"when was the last time you stepped into a bbby?\" That is why you continue to lose money, because you think the world revolves around you. I asked many of my millenial married friends and their wives all have shopped @ Bed Bath recently.", "score": 0, "replies": []}, {"body": "You should play their next earnings, after they underwhelm black Friday", "score": 0, "replies": []}, {"body": "If Corona has been good for one thing, it's that it is forcing shitty companies to get a whole hell of a lot better really fucking fast.  BBBY had the choice: Do we keep closing stores and hope the pandemic ends before we're bankrupt?  Or do we fix our business model so that we stop getting murdered by Overstock and Wayfair?\n\nKeep in mind, with other retailers closing their doors, stores like Kohl's and BBBY will be gaining market share.  People will still go to brick & mortar to feel towels and bath mats before they buy them.  People will still walk in to go Christmas shopping for relatives they dont like or know really well.  The store still be huge in the wedding registry arena (which hasn't been a thing in 2020).  Mortgage rates will be low for a while, which will be good for the housing market, which drives business at BBBY.\n\nI'm just giving you the bull's case.  Do whatever you want, I do not care.", "score": 0, "replies": []}, {"body": "Just got married I live in that store baby.  To the moon\n\nI will also say this. Prices were low because they went a couple quarters without a CEO. I don’t think they’re moving much more up, but they were not a $12 stock. \n\nI have no skin in this one cause my dad picked them and I Fade him.", "score": 0, "replies": []}, {"body": "lol you like being cucked don’t you", "score": 0, "replies": []}, {"body": "You are a fool, best buy has been selling so much tech since the work from home became standard. They price match amazon. They actually had lots of people in stores before all this. There is no way they arent making tons of money. More like puts on your account value.", "score": -1, "replies": [{"body": "Bbby not bby", "score": 1, "replies": []}, {"body": "This isn’t about Best Buy jesus", "score": 1, "replies": []}]}]}
