{"title": "Bag Holders strategy for next week??", "selftext": "So I assume I’m not the only one here that got assigned on some puts yesterday.  I’m now the proud bag holder of Apple shares and a few others.  I’m not particularly concerned longer term as I didn’t sell puts on any garbage stocks.  It’s all high quality stuff but I am coming into the stocks with a basis of 7-10% above current market value.  Usually when I get assigned I just sell calls a couple weeks out with a strike at or near my basis and wait for a turn around.  With my basis 10% above market thats tough to do.  I’m thinking on Monday I immediately sell weekly calls at or near the money with the expectation of continued decline to capture premium and further reduce my basis.  If the stock gets called away just turn around and sell at the money puts the following week.  Another option might be to wait a bit for a recovery and then sell calls.  Market could recover next week, particularly after elections and some of this stuff might be oversold, but obviously who knows.    Wondering if any other bag holders here have any thoughts on strategy for next week??", "id": "jlhmiw", "created_utc": 1604147754.0, "score": 28, "upvote_ratio": 0.91, "num_comments": 82, "comments": [{"body": "Your next green day go sell the calls. Gotta buy puts into weakness and sell calls into strength", "score": 12, "replies": []}, {"body": "If you’ve held thru the last couple months then you’ve already pretty much committed to holding thru election", "score": 7, "replies": [{"body": "I don’t like to try to time the market.  I like to stay  invested", "score": 1, "replies": []}]}, {"body": "You need to take the longer haul if you wanna recover on this... be more patient. If you’re going to sell atm calls rn you’re pretty much for sure getting called away because we’re very near a buying point for large institutions. By being nearsighted and impatient all you’re going to do is lose money. Apple doesn’t stay down for long.", "score": 8, "replies": []}, {"body": "I recommend selling \\~7 DTE calls at 10-16 delta and letting them expire. Wait for the stock to get back up to a good price, and then sell 30-60 DTE 30 delta calls. That way you are collecting credit while the stock is at its bottom, and when it goes back up you will get juicy premium. You don't want to commit to a monthly short call right now because the stock has crashed and you will severely limit your upside.", "score": 9, "replies": [{"body": "Would you please explain the 30 delta rules? Thanks", "score": 3, "replies": [{"body": "It's a recommendation of where I feel comfortable selling covered calls, 30-35 delta. It balances good premium with good probability of profit. You can sell lower delta values if you are super bullish, or higher delta calls (40+) if you want more downside protection in return for limiting your upside some more. It's whatever you feel comfortable with or what your opinion is. Sometimes I sell two calls against 100 shares, one at a high delta and one at a low delta, but that strategy has its drawbacks.", "score": 2, "replies": []}]}]}, {"body": "Don't worry I've been bagholding for 2 weeks now. All you can do is collect your pennies on your calls and wait. If possible keep some cash on the side in case you want to average down if we drop more. I really don't want more aapl in my portfolio but if we go below 90 I'll average down again", "score": 4, "replies": [{"body": "What’s your exp date?  Mine are Jan 15 and already down 64%.  Don’t know what to do. Any advice welcome.", "score": 1, "replies": [{"body": "Expiry for calls or puts? Regardless I don't generally go out that far. I got assigned on stuff that dropped, so now I'll sell calls. Probably sell cheap weeklies so I don't miss a run up. Sell more puts to bring my average price down if we drop too much more.", "score": 2, "replies": [{"body": "Sorry I’m a newbie.  They were call at a $140 strike bought  in September.  Will they go up when Apple pops or is the climb from 65% loss impossible?", "score": 1, "replies": [{"body": "Mm you bought this call or it's a covered call? If you bought it I'd sell, but that's not theta gang strategies. If you sold it I'd buy to close, but I'd need your avg buy in price to advise what to sell next", "score": 2, "replies": [{"body": "3.43 and they are calls. Thanks for your help.", "score": 1, "replies": [{"body": "You misunderstand, did you buy to open or sell to open? Is it a long call or a short call/covered call?", "score": 1, "replies": [{"body": " It was buy to open", "score": 1, "replies": [{"body": "Ah I see. So this is not a theta gang strategy then, just old fashioned going long.\n\nSell to close. Everything looks bearish. Obviously anything can happen, and my main reason for doing theta strategies is that I don't believe I can time the market, but I'm not seeing on the chart aapl hitting 140,at least not in time for your call to retain any value", "score": 1, "replies": [{"body": "Yes just plain old call. So apple would have to rise substantially?  I’m looking to reduce losses, is 65% loss already insurmountable?  Sorry for my naïveté.", "score": 1, "replies": [{"body": "I would say that aapl would have to hit at least 125ish, probably 130 (off the top of my head) in the next 2 weeks or so for you to break even. Your entry was in retrospect poor. Pick a lower strike if you're still bullish, but it seems unlikely this will hit.\n\nAgain, obviously anything can happen, if the rally picks up again it'll probably print. But it doesn't look like that's happening in the short term", "score": 2, "replies": [{"body": "Many thanks ! That was a day play gone wrong.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "AAPL ex dividend date is November 6.", "score": 4, "replies": []}, {"body": "I wouldn’t think too much about it.  Write calls at or slightly above your CB every 1-2 weeks.  There really isn’t much more to do.  Stocks will likely go down next week...there might be a post election bump but we now have over 100K Covid infections and it will remain high for the next 1-2 weeks.", "score": 3, "replies": []}, {"body": "Yep... been trying to roll out my dkng and HYLN bags... Lol they are soo deep itm ive sold some calls against them lol", "score": 3, "replies": [{"body": "I’m also holding HYLN bags. Sold $45 puts at the beginning of October.", "score": 1, "replies": [{"body": "holy shit that was the literal top I hope the bag is light", "score": 2, "replies": []}]}, {"body": "deep in the money puts and there’s no early assignment? How long have you been holding them? I have a Tesla at strike $390 expiring 20th nov which is now in the money. Can I keep rolling if it stays itm without ever being assigned?", "score": 1, "replies": [{"body": "beauty of have CSP is you can always roll farther out. Im still bullish on DKNG long term.. but yea rather not have my cash tied up in shares. I've just been pushing them out. Hopefully by DEC they're back to ATHs lol", "score": 1, "replies": []}, {"body": "Only if price is close to strike (390). If goes too far away then time value disappears and near impossible to roll unless you turn it into a leap. I suggest roll it as soon as the price hits 390 to 385 by a week or 2 for credits.", "score": 1, "replies": [{"body": "Ok! I ll roll it come Monday if there’s still a chance to roll. Thank you so much.", "score": 1, "replies": []}]}]}]}, {"body": "I’d be cautious about short delta of any sort. So much money on sidelines waiting for clarity, could see so insane melt up days. You’ll have all year to sell vol after this...", "score": 2, "replies": []}, {"body": "Dude take the shares and run the wheel at your strike easy and end of story", "score": 2, "replies": []}, {"body": "You guys are crazy selling weeklies. Even monthlies are not optimal. To account for the real volatility of this market you need to go out 90 days.", "score": 5, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Don't sell a put for a price you wouldn't be willing to buy the stock at today. Then if you get assigned it, it's like you bought it and got paid to do it.", "score": -1, "replies": [{"body": "And then it immediately dropped 5% after and you realize why somebody paid you to buy it.", "score": 4, "replies": []}, {"body": "And if that stock takes off?  You had such a small delta exposure, and a tiny premium from the weekly, that you'll have made peanuts.  If you still like that stock, your only way back in is FOMO.", "score": 1, "replies": [{"body": "Oh waahhh, what if the stock goes off! Are you trying to hit home runs, or are you trying to make money?\n\nIf you're that worried about what happens if stocks take off, buy calls", "score": 3, "replies": [{"body": "While you keep getting off the train trying to hit singles and doubles with the vending machines, one day the train will leave without you and you'll be waiting for the next one. (or chasing the one you missed with FOMO)", "score": -3, "replies": [{"body": "Why would I be chasing? I'm happy getting paid 2% to wait. I can do that all week long. If you are that bullish on a stock, buy it. Don't get sentimental over the ones you didn't buy.", "score": 6, "replies": [{"body": "Something tells me you only started doing this after the covid crash.", "score": 0, "replies": [{"body": "You're getting downvoted but yours is only the sane comment in the thread. \n\n\\>  I'm happy getting paid 2% to wait \n\nis surely by someone coming after March 2020 and reading it's all free money", "score": 3, "replies": []}, {"body": "You're the one talking about FOMO and chasing stocks, not me", "score": 1, "replies": [{"body": "Everyone who wasn't close to 100 deltas per contract got sawed.  Pretty much, if you sold premium, you were sawed.\n\nYou'd have been cut in two with your 20 delta singles and doubles, sitting in cash like a deer in headlights as retail drove markets to new highs.  This is why I assume you weren't doing this back then.  You'd be singing a completely different tune.", "score": 0, "replies": [{"body": "And that's why pigs get slaughtered", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Is the risk profile really that different?? I mean yeah I been assigned on a weekly at 10% below my strike but I might now sell 10 calls before your contract expires.  Plus, if I had wanted to I coulda rolled that weekly for a small premium or even dropped the strike slightly but decided instead to take the assignment to start earning on some calls.  I kinda hate selling long dated options seems like they afford less flexibility", "score": 4, "replies": [{"body": "It's more about the black swan crashes.  Your method works great for normal dips, but the COVID crash type events will leave you bagholding too high to earn anything from short term calls and you'll have to sell 90+ day calls anyway.\n\nThe 90 day puts tend to skip over those dumps entirely, or they give you a big enough discount on the shares to keep you in the game.  This is mostly because 90 day strikes will get you close to where the 200 day MA will be 3 months out (in a typical monthly bull trend).", "score": 1, "replies": []}]}, {"body": "Weeklies would offer more premium than monthlies, no? Personal risk tolerance varies of course....", "score": 2, "replies": [{"body": "Monthlies have more time value because there's more vega.\n\nConsider this analogy:\n\nIf 4 week t-bills have a risk free rate of 2.5%, and 10yr notes have a yield of 2.4%, why would anyone in their right mind buy 10yr notes?\n\nLets say the Fed lowers rates to 0.  10yr notes yields falls to 1.0%.\n\nThe guy in 4-week notes only has 4 weeks left of making 2.5% annualized, while the guy with 10yr notes gets to keep making 2.4% for 10 years (or could sell early for a big capital gain)", "score": 1, "replies": []}]}, {"body": "Exactly this.", "score": -1, "replies": []}, {"body": "How far %wise OTM do you sell for 90 days covered calls?", "score": 1, "replies": [{"body": "That all depends on current IV and where the resistances are. Typically I would just sell at the strike I was assigned and go out as many days as necessary to provide a meaningful premium", "score": 1, "replies": []}]}, {"body": "This", "score": 1, "replies": []}]}, {"body": "People are overlooking the human element, yes stats and financials matter of course, but in the end the human mind is the one who alters prices based on who buys ur sells. People are always going to buy and sell out of panic or greed. U can make considerable money by being able to distinguish which movements are due to the human elements rather then actual investors selling/buying.", "score": 3, "replies": []}, {"body": "So you basically want to sell calls when the market is down and sell puts when it’s up? It’s the other way around my friend.", "score": 5, "replies": [{"body": "He’s talking about weeklies while the market is moving up or down. Keyword moving", "score": 1, "replies": [{"body": "That doesn’t change anything. That’s a losing strategy.", "score": 1, "replies": [{"body": "Could be, but so are most people’s strategies lol", "score": 3, "replies": []}, {"body": "Elaborate for the uninitiated?", "score": 1, "replies": []}]}]}]}, {"body": "If everyone in the world gets covid and 2% of the people die, humanity will still find a way to make the population increase by \\~1%.  There will be more mouths to feed, and thus more economic growth.\n\nIf Trump contests the election and riots break out, people will still want to replace their broken windows.  This will mean more demand!  Breaking things is always good for aggregate demand!", "score": 3, "replies": [{"body": "0.5% max.", "score": 1, "replies": [{"body": "Also, now's a good time to invest in cast iron bars for basement and first floor windows, and those metal rolling shutters to quickly protect business fronts.  Bad things are happening.  You're going to need these bars!", "score": 2, "replies": [{"body": "Probably a good time to get a new vehicle too... you know... after all the mobbers jump on your car...\n\nAnd a therapists, for people's daughters.\n\nEveryone will be shifting from PTON to these sectors.", "score": 3, "replies": []}]}]}]}, {"body": "Not an expert here... so feedback on this welcome. I would sell weekly calls with decent enough premium with the hope of not getting assigned unless you break even. If market surges and you get assigned below your break even price (which is currently far away) you can roll to a higher strike for the following week absorbing a little loss (if need be) so you can measure a bit better the following week... alternatively if you get assigned you can start selling puts again until you make up for it if (you see future in the stock that is... )", "score": 2, "replies": []}, {"body": "I would sell the stock at a loss and move on. We may see another market surge with a stimulus in nov-dec but we could also see further declines. AAPL is a good stock but it’s also extremely overpriced. \n\nThe message that weekly sellers should be taking away from this is how much more risk you take on with that short duration exp. Monthly sellers are shrugging their shoulders at the current market move. It could be bad but it could be manageable. That’s what time gives you along with a LOT more premium. \n\nIt’s hard to look at a financial publication in the last 6 months without seeing something about a tech bubble. Nasdaq stocks are super overpriced right now. Newbies are wondering how much lower the stocks will get. Experienced traders are wondering how they got so high to begin with. We are in a horrible pandemic, recession, record unemployment. Sell the stock bro. Fantasy market time is over.", "score": 1, "replies": [{"body": ">It’s hard to look at a financial publication in the last 6 ~~months~~ years without seeing something about a tech bubble.\n\nNo worries bro, I fixed that for ya! And I’d like to think I remained generous because the actual number of years is probably quite a bit more than 6 :).", "score": 5, "replies": [{"body": "Exactly, I’m glad I didn’t listen to all those naysayers over the last 6 years", "score": 0, "replies": [{"body": "The same people who are crying ‘sell it all’ right now will be the ones saying ‘wish I would’ve bought the dip’ later on. It’s a cycle that most can’t seem to get out.", "score": 5, "replies": []}, {"body": "But at many points over those 6 years the pessimists have been correct. The market is always about timing.", "score": 1, "replies": [{"body": "Yeah but it never crashes when everyone thinks it’s going to crash.  Im fully invested at the moment and sleep well at night", "score": 1, "replies": [{"body": "Wow, you have guts. I'm staying in nothing but BABA right now.", "score": 1, "replies": [{"body": "> Wow, you have guts. I'm staying in nothing but BABA right now.\n\nLol.... one might say you have the biggest guts then, due to the potential of China drama with BABA and what not (which is one reason it hasn’t rallied as hard as it could’ve otherwise). But nonetheless I do like the stock myself also.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "So OP is already down 10%. Forget options for a minute. The first question he should ask is: would I buy this stock right now? Given the current whirlpool of confusion in the market, especially in tech stocks, the answer has to be 'No'. Sell it all now and see what's happening in 3 weeks or so.", "score": 1, "replies": []}, {"body": "Too extreme but yeah, Apple shouldn’t be your company to sell puts", "score": 1, "replies": []}]}, {"body": "May need to adjust your strategy. Futures are down significantly probably due to the U.K. lockdown news.", "score": 1, "replies": [{"body": "Let me guess you think weekend dow is futures now", "score": 1, "replies": [{"body": "-always has been space meme-", "score": 1, "replies": []}]}, {"body": "Where are you seeing futures. Investing.com futures don't come up until Sunday", "score": 1, "replies": [{"body": "**I found links in your comment that were not hyperlinked:**\n\n* [Investing.com](https://Investing.com)\n\n*I did the honors for you.*\n\n***\n\n^[delete](https://www.reddit.com/message/compose?to=%2Fu%2FLinkifyBot&subject=delete%20garum6k&message=Click%20the%20send%20button%20to%20delete%20the%20false%20positive.) ^| ^[information](https://np.reddit.com/u/LinkifyBot/comments/gkkf7p) ^| ^<3", "score": 1, "replies": []}, {"body": "Yes. The true futures aren’t available till later but you can use this site. It’s accurate enough. \n\n\nhttps://www.ig.com/en/indices/markets-indices/weekend-wall-street", "score": 1, "replies": []}]}]}, {"body": "I sold 110 Apple puts. I set an alarm for around 3:55 yesterday and preemptively sold a 110 call expiring next week for a couple of bucks assuming I would get assigned on my 110 puts. Aapl was trading around 108 at this time. \n\nJust gonna wait for aapl to recover and get my shares called away. In the meantime the call premium is like an extra dividend payment.", "score": 1, "replies": []}, {"body": "I’ve also got some ITM puts, I rolled them all out a month and I’m deciding which ones I want to turn into strangles/straddles. \n\nWith IV elevated I was able to roll even my solidly ITM puts out for a credit that works out to 20-40% annualized return on notional value (fully cash secured at the moment).", "score": 1, "replies": []}, {"body": "I agree with your thinking. Sell calls Monday before the election. If Trump refuses to concede and tries to throw out Electoral College delegates, as reported, we're going to have a Constitutional crisis.\n\nEven worse, we just reached 100,000 covid infections a day, and they're climbing fast. Both are exceptional risks for an already overpriced market. But I would sell calls 30-45 days out and not weekly.", "score": 1, "replies": [{"body": "The flip side is if Biden wins Florida the election will effectively be over by the time most people go to bed and we could see a huge rally started Wednesday. Playing any result of this election is extremely risky because as they say in chess it's very double-edged - all three outcomes including clear Biden win, clear Trump win and contested for weeks are possible.", "score": 4, "replies": []}]}, {"body": "I bought back all my spreads this week. I didn’t want to hold through Apple earnings and I don’t want to be in anything volatile for the election .\n\nThat said, I did sell a November 173/172 put spread in GLD, hoping that if the market remains volatile then this will stay relatively flat or go up.", "score": 1, "replies": []}]}
{"title": "AMD is an absolute STEAL at $75", "selftext": "I have been a long-term investor in AMD and there was a lot of news to unpack in the last weeks as well as an election coming up in a few days. I wanted to give my opinion on the current state of AMD and why at current levels this company is an incredible opportunity for the medium- to long-term investor.\n\n&#x200B;\n\nSo three 3 major events happened in the last few weeks that I want to address:\n\n&#x200B;\n\n[**Q3 Earnings Report**](https://d1io3yog0oux5.cloudfront.net/_4a33e72ea85fe760bd81d3f9e8b71721/amd/news/2020-10-27_AMD_Reports_Third_Quarter_2020_Financial_976.pdf)\n\nFirst of all their Q3 results were above expectation again (same as in Q2). EPS = 0,41$ beating 0,36$ expectation and revenue = 2,80B beating 2,55B expectation. While keeping gross margins at 44%. Note two things here: first of all beating your expectation again in the current COVID pandemic. But also the exponential growth comparing to Q3 2019/Q2 2020. It indicates that AMD is really taking off. **Meanwhile their stock price is still at the same levels as after Q2 earnings (75$)**.\n\n&#x200B;\n\n[**35B Xilinx Takeover**](https://www.youtube.com/watch?v=iMfNlCZPsBQ)\n\nThen there was one of the reasons why the stock price went lower, namely the Xilinx takeover. Since I am not familiar enough with Xilinx I will let the following articles explain why this deal is a good deal from a fundamental standpoint:\n\n[AMD's 35B acquisition of Xilinx is another stroke of strategic brilliance](https://www.forbes.com/sites/davealtavilla/2020/10/28/amds-35-billion-acquisition-of-xilinx-is-another-stroke-of-strategic-brilliance/?sh=f76ffe71c9f8)\n\n[AMD buys Xilinx, troubles mount for Intel](https://analyticsindiamag.com/amd-buys-xilinx-chip-intel-impact/)\n\nSince this takeover is completely financed in stock, this has a downward effect on the stock price in the short-term. This is mainly because arbitrage traders buy Xilinx stock and sell AMD to take advantage of the price discrepancies. This means that the selling of AMD stock is not initiated from a valuation standpoint of AMD itself, hence there is a buying opportunity for the AMD shareholder. The main takeaway from this merger is, as Dr. Lisa Su puts it, the increase in **TAM: Total Available Market**. The takeover opens an array of markets; including automotive, aerospace and defence. Plainly said: more markets>more chips to sell> >more profits.\n\n&#x200B;\n\n[**New GPU Reveal**](https://www.youtube.com/watch?v=oHpgu-cTjyM)\n\nThen there was the revealing of their news 6000 Series graphics cards. As you can see in the presentation the new cards can go head to head with market leaders NVDA’s cards. This is a market where AMD performed poorly before. This means two things: a possibility to increase market share but more importantly: **their technology is enhancing so well they can even compete with NVDA in the GPU market.**\n\nThis has a lot to do with the fact that Dr. Lisa Su is an Electrical Engineer and **AMD (after the Xilinx merger) has 13,000 engineers under employment**. As Jim Cramer said: [He stopped being an Intel hawk when they appointed a MBA as CEO](https://www.youtube.com/watch?v=Z5ackqH7a40)\n\n&#x200B;\n\n**RISK**\n\nOf course there are still risks in investing in AMD as well. First off we have the (global) market risk, especially with the current election coming up. However, in the long-term both Biden or Trump won’t stop the semiconductor market from growing at a similar rate as it has been so far. The only risk is the geopolitical risk, because AMD heavily relies on TSMC (a Taiwanese company) for their production. But this is a segmented-market risk as well since NVDA and Apple also rely on TSMC. And with the current projection of Biden winning the election, hopefully US-China relations will improve in the near future. And hey, no risk no reward right?\n\n&#x200B;\n\n**Conclusion**\n\nI’ve been a long-term investor in (mainly) two companies, the other one being ASML. I saw the potential of ASML getting a monopolistic position in the EUV technology and invested heavily in them when their stock was around 80-90 euro. ASML doesn’t have the same potential anymore as AMD has now. Especially since AMD is still trading at the same levels after their Q2 update. I shifted my portfolio more towards AMD, and I am suggesting you do the same.\n\n&#x200B;\n\nPositions:\n\nAMD: 3,000 shares, 6,500 LT Warrants.", "id": "jli0x0", "created_utc": 1604149460.0, "score": 75, "upvote_ratio": 0.92, "num_comments": 77, "comments": [{"body": "It’s gonna be a steal if it gets below that too. This market looks too unstable to buy anything especially with the election next week. Who knows AMD could be below that due to the potential of a contested election", "score": 62, "replies": [{"body": "Fair point. But you can never time the low, and it is better to have buy orders in (at different levels perhaps) and keeping an eye on it rather then missing out.", "score": 18, "replies": []}, {"body": "Have you learned nothing? Buy every fucking dip to get rich.", "score": 16, "replies": [{"body": "If you bought the dip in mid October, you got fooked", "score": 9, "replies": [{"body": "But then you buy the next dip?", "score": 9, "replies": []}]}]}, {"body": ">It’s gonna be a steal if it gets below that too.\n\nWell here we are.", "score": 3, "replies": [{"body": "Haha 😆", "score": 1, "replies": [{"body": "You buy more?", "score": 1, "replies": [{"body": "No I haven’t bought anything. Waiting for election stuff to fizzle out. Buying opportunity will be start of next week IMO", "score": 1, "replies": [{"body": "I'm already at 300 shares but I've been selling covered calls on them.", "score": 1, "replies": [{"body": "Good way to play it", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Matey, this be a casino.", "score": 2, "replies": []}, {"body": "Wouldnt you agree that this market instability is when the prime opportunity to buy is?\n\nJust like march when covid “hit” \n\nJust have to find the right buy in point", "score": 0, "replies": [{"body": "Yes after election. So In the next week or two unlesss it’s still contested lol", "score": 1, "replies": [{"body": "Yeah, like a rat waiting to pounce on some stinky cheese", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "Banned for sound advice", "score": 10, "replies": []}]}, {"body": "I get assigned 3 puts at $77 so will be holding those till Q4 and sell covered calls", "score": 9, "replies": []}, {"body": "So is my 84$ call expiring 11/06 fucked or?", "score": 11, "replies": [{"body": "I have 110$ for 11/6...", "score": 13, "replies": [{"body": "92.5 for 12/16. Hoping. Praying. \n\nYeah we're fucked.", "score": 6, "replies": [{"body": "I bought a 91c monthly when it was at 87 - expired worthless :)", "score": 1, "replies": [{"body": "Bought it thinking they've already shown competition with Intel, if they beat earnings *and* their official GPU benchmarks are competitive with Nvidia, they'd get another bump.\n\nNot sure what I was expecting but it wasn't this.\n\nThat being said I did pick up 20 more shares today on Fidelity, which is my account that slowly gains money. Robinhood is for losing it quickly.", "score": 2, "replies": []}]}]}, {"body": "Oh fuck man. I suddenly don't feel as bad about my already fried call", "score": 3, "replies": []}, {"body": "You what now?", "score": 0, "replies": []}]}, {"body": "Likely. If you’re lucky you’ll be down 40%. I’m worried about my 80C 11/20.", "score": 3, "replies": [{"body": "I'm already down 95%. Dont see too much of a recovery, but I would like to cut losses if possible", "score": 1, "replies": [{"body": "Oh well then refer to page 16 of the WSB handbook: Go down 95% on calls and you have nothing to lose. \n\nBut seriously, I think it still has a shot at recouping some cash.", "score": 2, "replies": [{"body": "Appreciate the advice. I'm already down so much, so I'll likely hold until the end or if we get a good spike I'll sell then", "score": 2, "replies": [{"body": "Yea there’s no reason not to hold at this point. AMD tends to trend down and consolidate for long periods of time (compared to other tech) before spiking up and consolidating up. If it approaches 80 before 11/06 which it may after Tuesday, id definitely sell.", "score": 2, "replies": [{"body": "Sounds good man. I'll be keeping a close eye on it and see if i can cut some losses. My account is margin called right now so it'd be nice to use AMD to get me outta that", "score": 2, "replies": [{"body": "I’ll be rooting for ya brother. We have the right idea about AMD and su-bae, this thing will be trading for 120+ this time next year, just that our timing was off.", "score": 2, "replies": [{"body": "And such is the life of trading options. Live and learn, we'll be making good trades before we know it brother", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "I'm mentally prepared to lose it all. Should have just bought more NIO calls. But eh too late, at least we're in it together brother", "score": 1, "replies": []}]}]}, {"body": "Great price now, but it could go even lower over the next few days.", "score": 8, "replies": []}, {"body": "I like the AMD Jan 2022 140C. Bought a load around 6.10 and sold at 10. Now they are around 4.40. They go under 4.00 this week, and I'll probably throw $100,000 at them. AMD and TSM are some of my favorite names over the years.\n\nI expect Intel to keep being a mismanaged pile of shit for the foreseeable future.", "score": 7, "replies": [{"body": "If TSM ever goes under 80 again 🤤🤤🤤", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "No worries. We're all learning, brother. Have a reasonable understanding of the greeks, have appropriate risk size, don't overpay (either sell options or don't buy when IV is high), and practice is all. I have a lot of theoretical knowledge, but I cannot say that gives me a discernable edge. You get way more edge from having a plan, managing trades through various scenarios, and controlling emotions.\n\nThat contract has an approximately equal vega and delta. I was expecting a price run to the Ryzen reveal date (option benefitting from delta). Now, this sub absolutely loves AMD (and for good reason) and starts posting about it nonstop around key events. This causes lots of retail stock and option buying and IV rises everywhere on the option chain where there is a lot of volume. This is key because IV rising (option benefitting from vega) would give me profit even if AMD stock price went down somewhat.\n\nThe contract is so far out, I consider theta 0. I just have to have some reasonable sense of where IV/option demand and price might go. Historical IV trends and experience helps here.\n\nBtw, the contract is so far OTM that if there is massive IV drop AND price drop, which is uncommon but can happen, losses are magnified. This is a real risk and can happen after IV and price run up very high together (See AAPL after running to 140 with simultaneous insane IV expansion).", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">...but I have to ask, what's your thinking behind looking at Vega vs Delta?\n\nI consider all the greeks and mentally approximate higher order ones representing convexity risks, etc. For instance, if IV or time changes many common greeks you may know will change at different rates and accelerate their changes, and so on.\n\nSimple Example: if IV approaches 0, all ITM options approach delta 1, OTM approach delta 0 and gamma becomes 0 (except ATM).\n\nWhat I wrote above was simplified reasoning to help the poster above me. I could win by AMD price increase and no large IV drop (delta vs vega), or I could win by IV increase and no large IV drop (vega vs delta). I won both ways, so I cashed out and waited for another opportunity.\n\nNow, today AMD IV is way down but the delta exposure saved me. since AMD stock price is way, way up (delta/vega was sufficient and gamma is more spread out among strikes at further expiries, and other convexity considerations.\n\nIt's really hard to buy an option like I chose with the parameters I had in mind at a global maximum price. Hope this helps.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You're welcome. Yes, I made a vol and price prediction and was lucky enough to be doubly correct one time and correct enough about one the second. Yes, spread/widen. Convexity is a more complicated consideration than that...\n\nIt is true that gamma is greater around stikes near ATM strikes nearer expiry, and it is also true that gamma will not change greatly among strikes at far out expiries. However,  it tapers off quickly in OTM strikes near expiry.\n\nLook at Nov 4 SPY 360C (gamma .002) vs Nov 9 SPY 360 (gamma .015). Further out, but higher gamma. It is not linear, varies widely as all other parameters change, and is only a rough approximation that is not valid if other factors change greatly.\n\nMy choice was to go far out in time enough to not incur additional delta change risks by rapidly changing gamma. In fact, that had more to do with my choice than giving myself time to be right, hence \"more spread out gamma.\"\n\nThink of having a fixed amount of gamma. You can either spread it to all strikes very thinly, concentrate it strongly around a strike, or some mixture between those extremes. There are a long lists of risks n\\_1, n\\_2, ....n\\_k. You can push some down, but others will be amplified.\n\nglobal max option price = highest price over the life of an option. I am saying it is statistically hard to buy in at the absolute top if you are careful.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Did you? lol", "score": 1, "replies": []}]}, {"body": "More share dilution inbound.", "score": 4, "replies": []}, {"body": "I think so too. Decided to put my money where my mouth is last week. \n\n1/20/23 AMD $130c. It’s free money.", "score": 4, "replies": []}, {"body": "This is so fucking obvious I thought everyone knew this", "score": 5, "replies": []}, {"body": "102 pe, yes I'm older than 30 lol", "score": 4, "replies": [{"body": "Intel has a PE of 10 I believe. NVDA and AMD have 60+. I know which ones are the better choice though..", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "My broker. But long term calls are roughly the same so that would work as well.", "score": 2, "replies": []}]}, {"body": "Holding 300 shares, Dec 90c that are down like 60% and praying to mama su\n\nI know their Q4 earnings are gonna rock but my calls die before then... \n\nThinking of rolling into 90c Jan depending on how this week ends up", "score": 3, "replies": []}, {"body": "What are LT warrants?", "score": 4, "replies": [{"body": "Long term warrants", "score": 3, "replies": [{"body": "I know what warrants are, I just didn't think AMD had them anymore. Are they available through TD Ameritrade or Fidelity?", "score": 2, "replies": [{"body": "OP could be European where warrants and options are similarly used\n\nLong term options like AMD $100 Jan 2022 would be an example", "score": 3, "replies": [{"body": "I am European indeed.", "score": 2, "replies": [{"body": "What broker do you use? I am European as well and it is hard to find a broker that offers LT warrants.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "No no no no. AMD is nothing but tendie cancer. Do NOT listen to this guy at all. No matter what position you pick, it will go against you as soon as you click order. Spooky🎃", "score": 7, "replies": [{"body": "Spooky ghost 👻", "score": 3, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/alles_long don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "\"tldr, im overleveraged in my positions with amd so plz someone buy the dip\"", "score": 2, "replies": []}, {"body": "You posted this same thread in 5 different subreddits!", "score": 2, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Bag holder", "score": 0, "replies": []}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 0, "replies": []}, {"body": "Just buy in end of Nov and buy calls 2+ months out", "score": 1, "replies": []}, {"body": "Are investors scared about share dilution for the $35 billion all stock deal, or is that a problem for the end of 2021. I want to get back in but I’m worried they can drop any news about dilution and stock will tank", "score": 1, "replies": [{"body": "That dilution has already happened when they announced it would be an all stock deal with a ratio of 1.73.", "score": 1, "replies": [{"body": "The ratio of the dilution is confirmed yeah, but the actual dilution won’t happen until the end of the transaction in 2021", "score": 2, "replies": [{"body": "So do the arbitrage traders sell AMD in advance, driving price down now, or is there a big sell off when the deal is done in 2021, or both?", "score": 1, "replies": [{"body": "That’s my question as well. Amd at 75 is a steal, especially with upcoming Xbox and ps5 sales. I’m only worried about doing calls (maybe leaps) but idk if this dilution thing is priced in now or will dip leading up to the transaction.", "score": 1, "replies": []}]}]}, {"body": "do you have a source for that?", "score": 1, "replies": []}]}]}, {"body": "What's your average on those shares? That's a big position.", "score": 1, "replies": [{"body": "21. Warrants a bit higher, but they where 50 strike. I have been completely convinced of only two stocks all these years. So then I move in “bigly”", "score": 1, "replies": []}]}, {"body": "You have $225000 in amd shares? What should I buy if I only want to spend about $500? Buying shares would be pointless for me.", "score": 1, "replies": [{"body": "Yes. I would buy either shares or long term calls (‘23). Whichever risk profile suites you best.", "score": 1, "replies": []}]}, {"body": "I liked this stock a lot better at $13. Sold it back in February at $54. It’s overhyped, tech is overbought in general and the revenue won’t justify the price it’s currently at for years. \n\nI was hugely bullish on Amd for years but I think the play has run its course.", "score": 1, "replies": []}, {"body": "lmao. $75 is not even close to a steal.", "score": 1, "replies": []}, {"body": "Not buying AMD when I can buy XLNX and end up with AMD shares at a better price.", "score": 1, "replies": []}, {"body": "Are you still heavy into amd? I have a deep itm bull put spread on them for 90/92.5p March 21", "score": 1, "replies": [{"body": "Yes. I wouldn’t change because of one day.", "score": 1, "replies": []}]}]}
{"title": "Monday crash confirmed sell everything", "selftext": "", "id": "jlifid", "created_utc": 1604151183.0, "score": 858, "upvote_ratio": 0.99, "num_comments": 81, "comments": [{"body": "They’re removing the daylight savings time patch they applied back in March. 👀 \n\n“It’s not a bug, it’s a feature.”", "score": 335, "replies": [{"body": "[deleted]", "score": 153, "replies": [{"body": "Bro I’m still mad I lost so much money because of that bullshit", "score": 62, "replies": [{"body": "You would have just lost it anyways", "score": 13, "replies": [{"body": "I agree", "score": 10, "replies": []}]}]}]}, {"body": "Someone's going to manually change the time back an hour on all the servers.", "score": 91, "replies": []}, {"body": "LOL you beat me to it", "score": 29, "replies": []}, {"body": "That was leap year retard", "score": 28, "replies": [{"body": "Did they fuck up both??", "score": 17, "replies": [{"body": "Yes, fucked up both.", "score": 24, "replies": []}, {"body": "Leap year was why it was down a full day and it was a huge Green Day following 5 days of drilling. Puts were toast and ptsd is real.", "score": 11, "replies": []}]}, {"body": "[Called that shit](https://old.reddit.com/r/wallstreetbets/comments/fcfuux/robinhood_crash_megathread/fjarydn/)", "score": 6, "replies": []}]}, {"body": "I don't use RH but remembering what the world was like during the last daylight savings change somehow makes me bearish.", "score": 2, "replies": []}, {"body": "Clock needs to be set correct again on all Pentium 4 machines.", "score": 2, "replies": [{"body": "I had one of those!", "score": 1, "replies": []}]}, {"body": "The number of programmers who do time wrong is shocking.", "score": 2, "replies": []}]}, {"body": "What a piece of shit trading platform.", "score": 53, "replies": []}, {"body": "God I’m getting flashbacks from February when Robinhood crashed and the market was in free fall", "score": 77, "replies": [{"body": "Stop turning me on, that was the weirdest time in my life, scared for myself and everyone around me but also making a shit ton of money", "score": 6, "replies": []}]}, {"body": "The site is 100% going down. Glad I have no positions over the weekend 😂", "score": 31, "replies": [{"body": "Same. I have a few spreads but I gotta wait to see if rh fucking works on monday before I make any real trades.", "score": 9, "replies": []}]}, {"body": "FML Monday is going to be epic. They screwed my puts last time and market had one of the greatest rallies. Let’s see if we get a limit down this time", "score": 20, "replies": [{"body": "My 1 spy put would. Will save my portfolio if it crashes on Mondays", "score": 11, "replies": [{"body": "So far looks like it’ll be a bloody Monday", "score": 12, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "So get a poll going!", "score": 1, "replies": []}]}, {"body": "Yeah unless the wsb inverse happens and it moons like always", "score": 7, "replies": [{"body": "Dang.. hmm wonder what news will come\nSunday night or Monday morning to save the market", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 80, "replies": [{"body": "that's nothing for a vaccine stock", "score": 39, "replies": [{"body": "I think they meant the overall market", "score": 15, "replies": [{"body": "Positive vaccine news would be a...white swan.", "score": 13, "replies": [{"body": "Cuz of all the jizz?", "score": 4, "replies": []}]}, {"body": "that would be the biggest jump of all Time thank you brother", "score": 1, "replies": [{"body": "Market jumped +15% in 1933 ... also the market jumped 11% on the back of Trump just saying “we are gonna have this thing taken care of by Easter” and stimulus...\n\nSo if a vaccine was announced that was 100% effective and able to mass produce quickly the market could easily move 15%...", "score": 1, "replies": []}]}]}]}]}, {"body": "Really I thought they were doing maintenance Friday during market hours. Took 5 minutes to send a fucking order all day. What joke", "score": 12, "replies": [{"body": "No idea why you guys put up with this crap.  I opened a RH account last month to try it out and trade a specific strategy as an experiment.  Closed in less than 2 weeks after trying to actually use it.", "score": 7, "replies": []}]}, {"body": "Of all the fucking possible times and RH picks that", "score": 45, "replies": [{"body": "It’s Sunday night man... relax scoob...", "score": 41, "replies": [{"body": "You know damn well it’s gonna take them 12 hours to fix one thing and fuck up two others. It’s day light savings Sunday...don’t you remember the leap year autism?😂", "score": 65, "replies": [{"body": "Yeah, and its going to be the Jr. DevOps guy who was given shit documentation on how to roll the fix into their production environment. My guess, he's going to botch it, and RH will be down for 24 hours easy, all because an errant character winds up in the yml file that defines the environment. Since nobody there actually knows how Kubernetes works, they're going to be trying fixes they find on some nested comment on StackOverflow from fucking 2015. Look at r/sysadmin and r/kubernetes and possibly r/aws for downvoted post titled something like \"MY K8S CLUSTER CRASHED HELP IMMIDIATELY!\"", "score": 7, "replies": [{"body": "I can’t read idk what that means", "score": 4, "replies": [{"body": "Its geek speak for \"some rookie on RH's technical team is about to get fucking wrekt.\"", "score": 5, "replies": []}]}]}, {"body": "Yeah, good luck getting some rando contractor working unpaid overtime to actually fix this bug. Last 6 times daylight savings happened the app had the same exact issue", "score": 10, "replies": []}]}]}]}, {"body": "MRNA down almost 6% vaccine news incoming.", "score": 7, "replies": []}, {"body": "Monday's gonna be green. My puts are fucked.", "score": 17, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "And so will I brother🙏🏼 we will ride into battle on our trusty steeds", "score": 7, "replies": []}]}, {"body": "in what world would monday be green, the uk/europe is closing down completely, expect a red monday", "score": 21, "replies": [{"body": "It will be green because I bought puts. Obviously", "score": 50, "replies": [{"body": "If its green, I will blame you. And I will demand money.", "score": 6, "replies": []}, {"body": "I would appreciate a Green Day please double down", "score": 1, "replies": [{"body": "Yes. I bought two OTM SPY puts expiring Monday so you should expect a huge bounce up on Monday. You're welcome.", "score": 11, "replies": [{"body": "Thank you for your sacrifice", "score": 3, "replies": [{"body": "I hope I have served you well. Prepare for a red day tomorrow.", "score": 2, "replies": []}]}]}]}, {"body": "I have a bunch of puts on movie theaters. If I go green, the only possibility is that it's your fault or that there is a God and he is encouraging me towards a life of frugality and prudence.", "score": 1, "replies": []}]}, {"body": "Expect a red Monday —> Inverse Expectations —> Monday will be green", "score": 6, "replies": [{"body": "So 50/50 like every day.", "score": 1, "replies": []}]}, {"body": "Told you.", "score": 1, "replies": [{"body": "My puts are chilling a bit down, this rally won't last", "score": 1, "replies": []}]}]}, {"body": "Rip my call credit spread", "score": 1, "replies": [{"body": "idk i don’t see any reason for mon to be green who knows tho", "score": 1, "replies": [{"body": "That pump had me worried ngl. I sold 328’s it went to 327.8🌝", "score": 1, "replies": []}]}]}]}, {"body": "Wow, u/robinhoodteam you guys are definitely autistic", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Like what?", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Like what?", "score": 3, "replies": []}]}]}, {"body": "Like what", "score": 3, "replies": []}]}, {"body": " How many times have I told ya, get a real fucking broker. Get a real broker man, you need a real broker. It's a piece of piss, you can get it  on the social.", "score": 11, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "it puts the broke in broker", "score": 15, "replies": []}]}]}, {"body": "So in other words it’ll be down all day", "score": 3, "replies": []}, {"body": "Get away from Robinhood and get onto established platforms - they also offer free trades now too", "score": 4, "replies": [{"body": "Stock trades maybe. Robinhood is still very good for ordering 200 spreads and selling 10 mins later, and then doing that again and again all day. Which others have free option contracts and can do spreads?", "score": 2, "replies": []}]}, {"body": "Its all rigged boys and girls. Get ready for some monumental news right when you cant access your shit brokerage.", "score": 2, "replies": []}, {"body": "Won’t work for first 15 min Guaranteed !", "score": 2, "replies": []}, {"body": "Fml", "score": 1, "replies": []}, {"body": "Hoe Lee Sheet", "score": 1, "replies": []}, {"body": "I work in big tech and they are basically getting ready for huge volume next week", "score": 1, "replies": []}, {"body": "Joke fails.", "score": 1, "replies": []}, {"body": "[https://www.youtube.com/watch?v=tIJIU\\_Db7Zg](https://www.youtube.com/watch?v=tIJIU_Db7Zg)", "score": 1, "replies": []}, {"body": "Robin Hands is making an appearance! Ya'll gonna really love Monday", "score": 1, "replies": []}, {"body": "Fuck", "score": 1, "replies": []}, {"body": "OH MY GAWD", "score": 1, "replies": []}, {"body": "This is the kiss of death right here. \n\nAre circuit breakers back?", "score": 1, "replies": []}, {"body": "factsss monday crashgg", "score": 1, "replies": []}]}
