{"title": "Here is a Market Recap for today Tuesday, June 1, 2021", "selftext": "**PsychoMarket Recap - Tuesday, June 1, 2021**\n\nStocks traded mixed today, with the S&P 500 (SPY) and Nasdaq (QQQ) modestly declining while the Dow Jones (DIA) gained roughly 0.1%. After a volatile beginning to the May, it seems over the past several weeks fears of fast rising inflation causing the Federal Reserve to prematurely tighten monetary policy have tempered. As I have said for weeks, I thought the selloff in the first two weeks of May, that saw the SPY lose 4% in a few days, was overdone, and am very encouraged by the price action in the market recently.\n\nLast week, members of the Federal Open Market Committee once again reassured market participants that they see inflationary pressures as “transitory” and do not think a shift in monetary policy in the near-term is warranted. St. Louis Federal Reserve President James Bullard said he believed increases in inflation would be “mostly temporary” and that the Fed was “not quite there yet” when it came to discussing tapering its asset purchase program. In separate comments, Kansas City Federal Reserve President Esther George said she did not want the Fed to be “overly reliant on historical relationships and dynamics in judging the outlook for inflation.” \n\nRichard Clarida, Vice Chairman of the Federal Reserve, also said “there will come a time in upcoming meetings” when the Fed would consider tapering the asset purchase program but that “it is going to depend on the flow of data”. The Fed is currently buying $120 billion a month in government-issued and government-backed securities, and has pledged to continue doing that until the economy is more fully recovered.\n\nThis reaffirms the market that the Fed is not on a set timeline when it comes to rolling back current accommodative policies and will, as they have said time and again, wait for concrete data before any considerations are made. This follows a similar statement from Jerome Powell back in April 14, which proves market participants shouldn’t worry about quantitative easing tapering, in my opinion. Powell said, “We will reach the time at which we will taper asset purchases when we have made substantial further progress towards our goals from last December. That would in all likelihood be before, well before, the time we would consider raising interest rates. We have not voted on that order but that is the sense of the guidance.”\n\nLooking ahead, market participants are anxiously waiting for the May Jobs Report, which will be released this Friday. This report will highlight the state of economic recovery, showing whether the labor market has managed to further recover following the extremely disappointing April Job Report. Importantly, the job reports are also used by the Federal Reserve to ascertain if the economy is getting closer to its employment goal, at which point monetary support will begin to taper. \n\n**Highlights**\n\n* Late last week, President Joe Biden unveiled a $6 trillion budget proposal for fiscal 2022, which would include a number of proposals around improving the country's infrastructure, educational resources and health care system and which would be funded in part by higher taxes. \n* Construction spending rose only 0.2% in April over March, a sharp deceleration compared to March over February. Spending rose only 0.2% compared to 1% in March.\n* “Meme stocks” continue their strong performance from last week, with AMC gapping up more than 20% again today. Crazy stuff!\n* Coinbase (COIN) announced customers would be able to fund their account using Apple and Google wallets \n* The price of Tesla vehicles is increasing due to supply chain pressures across the auto industry, particularly for raw materials, Elon Musk said on Monday via Twitter.\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Dollar General (DG) target raised by Deutsche Bank from $226 to $231 at Buy. Stock currently around $203\n* Goldman Sachs (GS) target raised by Piper Sandler from $385 to $420 at Overweight. Stock currently around $372\n* Hess (HESS) target raised by Wells Fargo from $86 to $98 at Overweight. Stock currently around $84\n* UnitedHealth Group (UNH) target raised by Bank of America from $450 to $522 at Buy. Stock currently around $412\n* UPS target raised by Citigroup from $220 to $235 at Neutral. Stock currently around $215\n* The Gap (GPS) target raised by Deutsche Bank from $36 to $38 at Hold. Stock currently around $33.4\n\n“Someone's sitting in the shade today because someone planted a **tree** a long time ago.” - Warren Buffet", "id": "nq3ic1", "created_utc": 1622578739.0, "score": 437, "upvote_ratio": 0.95, "num_comments": 71, "comments": [{"body": "Thank you, hope your day has been good, cheers.", "score": 75, "replies": [{"body": "You as well my friend!! Have an awesome rest of your day", "score": 33, "replies": [{"body": "ur the best", "score": 2, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}]}]}, {"body": "Any thoughts on JNJ after today's supreme court decision?", "score": 14, "replies": [{"body": "Well, I'm not at all an expert in these sorts of cases so take this with a grain of salt.\n\nFrom the stock perspective, the decision it's definitely not good in the near-term but I don't expect it to reallly affect JNJ in the long run.\n\nOn a personal note, they deserved the punishment, really is horrible what they did. Companies, particularly in healthcare, need to be held accountable. Asbestos is a known carcinogen, horrible for it to be in the talc, particularly when used with babies and small children", "score": 55, "replies": [{"body": "Well said.", "score": 7, "replies": [{"body": "Thanks! Just my two cents about JNJ", "score": 2, "replies": []}]}, {"body": "Sounds like a buy recommendation.", "score": 3, "replies": []}]}, {"body": "Personal opinion here; I would want to invest long term in companies that are looking to improve the world.", "score": 10, "replies": [{"body": "I think that is a very good long term investing plan!", "score": 2, "replies": []}]}]}, {"body": "How about that SoFi\n\nGonna get hit by the post-SPAC-merger curse? Or is it legit enough to carry this momentum?", "score": 20, "replies": [{"body": "You're guess is as good as mine, can't predict the future and how a stock will act.\n\nThat said, I think SoFi is a very interesting company with an exciting business model in the growing fintech industry. But again, impossible to say what the stock will do in the near-term post merger", "score": 15, "replies": [{"body": "Haha, sure, more thinking out loud because your threads are usually attract more intelligent discourse than the daily.", "score": 9, "replies": [{"body": "Would love to hear what others think as well", "score": 6, "replies": [{"body": "I'm in. They're evolving pretty quickly.", "score": 2, "replies": [{"body": "Very nicely, I will definitely take a look again post-merger.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "So many shit stonks rallied today. Expected the opposite.", "score": 37, "replies": [{"body": "3 day weekend.. anything is possible after.", "score": 17, "replies": []}, {"body": "Impossible to predict what the market will do haha", "score": 9, "replies": []}]}, {"body": "I like the WB quote.", "score": 5, "replies": [{"body": "Glad to hear it!", "score": 2, "replies": []}]}, {"body": "You’re an absolute psycho man\n\nThanks so much for these posts", "score": 6, "replies": [{"body": "Thank you my friend!", "score": 5, "replies": []}]}, {"body": "Any idea why big tech has been so stagnant?", "score": 9, "replies": [{"body": "Big tech have a humongous market cap so they typically don't move much in the short-term. That said many like AAPL, FB, AMZN, MSFT, Google are way up year-to-date. \n\nLook for the longterm with the big techs they're businesses are solid and their stocks have performed exceedingly well in even in the last 6 months", "score": 16, "replies": [{"body": "Apple has been pretty flat in the last 6 months no? It was 135 last year Sept", "score": 8, "replies": [{"body": "XLK which tracks the biggest tech stocks in the S&&P 500 is up 7.48% year to date despite the volatility. While that not seem like much compared to 2020 gains, it's still a great performance historically", "score": 3, "replies": [{"body": "Odd. I guess its just amazon and apple that are a bit laggard. \n\nI'm holding Jan 2022 and June 2022 calls for apple 140s. Think I should keep holding? Bought these in Dec so theta has slowly been eating at them a bit", "score": 1, "replies": [{"body": "Apple are about to release 5g phone in July. I think this will have positive impact.", "score": 1, "replies": [{"body": "I think their current iphone 12 supports 5G", "score": 2, "replies": []}]}]}]}]}]}, {"body": "They doubled in a year, a lot of additional growth is now priced in.", "score": 3, "replies": [{"body": "Yea after a huge drop... can’t stand when people cherry pick to try and sound smart.", "score": 2, "replies": [{"body": "They went from $81 to $57 during the pits of COVID and now are $124. 53% above their previous ATH. 2020 revenue was only 10% higher then 2019.", "score": 2, "replies": []}]}]}]}, {"body": "I have never seen ABT lose this much in one day", "score": 4, "replies": [{"body": "Neither have I, wow. They cut their guidance for 2021 citing lower COVID testing demand", "score": 5, "replies": []}]}, {"body": "Thank you!!", "score": 3, "replies": [{"body": "My pleasure! Thanks for reading", "score": 2, "replies": []}]}, {"body": "If the jobs report is better than expected, what stocks will do well?", "score": 2, "replies": [{"body": "Predicting the future is a dangerous game, don't advise buying stocks simply based of news", "score": 5, "replies": [{"body": "Or more of a general question, if there is an increase in jobs, which stocks will do well?", "score": 0, "replies": [{"body": "In general they do, though that is no guarantee what will happen. Again predicting the future is a dangerous game", "score": 1, "replies": []}, {"body": "In general, signs of a healthy economy (i.e. strong jobs report) is good for stocks. That being said, in times like these the market is concerned that the fed will raise interest rates. So sometimes good news for jobs reports can result in the market responding. It's a strange, backwards mindset but that's how the market has shown to react in similar situations in the past", "score": 1, "replies": []}]}]}]}, {"body": "High Tide uplists to NASDAQ tomorrow... should be a crazy day!", "score": 1, "replies": []}, {"body": "mixed hum me thought everything except health care and copper went up  The teck etf I have an order on went down a tad..  32K worth of limit orders in if we get a correction.  And a ton of sell orders in if we get a rally...  I'm hoping AMBL becomes one of my diamonds...  Only GME and AMC are up more at this itme..", "score": 1, "replies": []}, {"body": "My favorite stock did awesome, buy nobody talks about it.", "score": -4, "replies": [{"body": "This type of intentional leaving out of important details reminds me of how every MLM pitch starts.\n\n\"I found some incredible life-changing thing!!! Just PM me for details because I won't post any of it here\"", "score": 8, "replies": []}, {"body": "Great to hear my friend!", "score": 4, "replies": []}]}, {"body": "Without first going to my own personal opinion, I’d be interested to hear what you think about GME?", "score": -5, "replies": [{"body": "No thanks, rather not go down that rabbit hole", "score": 9, "replies": [{"body": "Damn. Enjoyed your analysis so was hoping some other intelligent human being can see through that bullshit.", "score": 0, "replies": [{"body": "Just a can of worms a rather not open.", "score": 3, "replies": []}]}]}, {"body": "GME does not trade on fundamentals - that's pretty clear. It's a gamble...nothing more nothing less.", "score": 1, "replies": []}, {"body": "I think my puts are going to print.", "score": 1, "replies": []}]}, {"body": "Gme 🦸‍♂️🧀🌪🍼🤹🏼‍♂️🧩🎯", "score": -1, "replies": []}, {"body": "NAKD 🚀🚀🚀🌕🌕🌕 Wednesday 6/2", "score": -1, "replies": []}, {"body": "What is happening with “hack” attacks on US supply chained businesses? \n\nFuel / Meatpackers now \n\nIs this a play for competitor Tyson ? Or inside game to increase prices? \n\nOr it’s green activists trying to do their job in messing with those bsuiensses \n\nAnd why does Russia keep gets blamed lol", "score": -4, "replies": [{"body": "Honestly no idea, anything I say is pure speculation and I don't feel knowledgeable enough in the space of cyber security to form an opinion, would have to look deeper into it\n\nThat said, I agree with you, it is interesting to see what looks to be a rise in ransomware hack attacks (though that is my perspective not quantitatively backed)\n\nWish I could give you a better answer but anything really don't feel knowledgeable enough.", "score": 3, "replies": []}, {"body": "Why Russia is blamed for the attacks on US infrastructure and governmental institutions? Well maybe because they are doing that constantly and relentlessly since war in Ukraine began? And they keep saying that Kremlin is not in control of the hackers which is nonsense.", "score": 2, "replies": []}, {"body": "Now take what I'm about to say with a grain of salt but, I read a couple weeks ago that there was a rise in cyber attack from China, targeting smaller company, mainly going after Intellectual Property.. might be a bogus claim, but who knows.", "score": 1, "replies": []}]}, {"body": "Tremendous coverage", "score": 1, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}, {"body": "Do you feel like the effect of meme stocks reaches beyond the individual investment to the wider market?  I would love to hear opinions on this and how to navigate accordingly.", "score": 1, "replies": [{"body": "Maybe in the short term, back in late Jan, early Feb we saw a lot of volatility that may have been associated with meme stocks.\n\nThat said, apart from the short term, I dont see meme stocks affecting the broader market longterm. Just my two cents", "score": 1, "replies": []}]}, {"body": "Happy to see COIN making moves to improve their overall product in the market. I think more public companies will be open to accepting digital assets, similar to what $BTCS has done with them putting their cash reserves in digital assets. They were up by $14m just in Q1 with their digital asset holdings alone", "score": 1, "replies": [{"body": "Don't have a position in COIN (tho I am looking st it closely) Happy to see it doing well!", "score": 1, "replies": []}]}]}
