{"title": "Investing in Russian Hackers; low risk, high reward, hedge inflation", "selftext": "[removed]", "id": "nsz2b6", "created_utc": 1622909264.0, "score": 88, "upvote_ratio": 0.78, "num_comments": 74, "comments": [{"body": "Sounds very legit to me. Especially giving my bank account info and SSN to a rando 👍", "score": 39, "replies": [{"body": "I’m in", "score": 5, "replies": []}]}, {"body": "Dahhhh, how do I invest? 🤥", "score": 9, "replies": [{"body": "Dude- instructions were very clear.  Go for it! Oh, I see the problem, It should have had TO THE MOON!!! in the title and they left out all of the rocket ships🚀🚀🚀🚀", "score": -2, "replies": [{"body": "The sarcasm went right over your head, my guy.", "score": 2, "replies": [{"body": "Sorry,  usually starting something with \"dude\" is an indicator that what follows is joking", "score": 2, "replies": [{"body": "That’s interesting, because I text people all the time starting with “dude”. \n\nI’ll let you have that though, my fellow.", "score": 1, "replies": []}]}]}, {"body": "Thanks for your profile view.", "score": -1, "replies": [{"body": "You were joking that you didn't get it. I was joking that it was due to lack of hyperbole and emojis.  Why so serious?", "score": 1, "replies": []}]}]}]}, {"body": "I fucked up and invested in Russian hookers", "score": 6, "replies": [{"body": "ROI is roughly the same with hookers/hackers", "score": 2, "replies": []}]}, {"body": "###Take my money Pickle Bytch!", "score": 3, "replies": []}, {"body": "Russian hackers. LMFAOO. \n\nYou mean the American WEF assembly that has been testing these hacks for a year now. Even when you all were locked down...", "score": 10, "replies": [{"body": "Nice try, Igor", "score": 5, "replies": []}]}, {"body": "Very well written. Thanks for the DD", "score": 3, "replies": []}, {"body": "Can you take out that “word” - you know the one, u/impicklerickbytch?", "score": 2, "replies": [{"body": "got it!", "score": 2, "replies": []}, {"body": "Or I think, I assumed the word", "score": 2, "replies": [{"body": "Was bird the word?\n\n/u/FannyPackPhantom is very sensitive about the word bird right now.", "score": 2, "replies": [{"body": "^(sshhhh stop tellin’ people!)", "score": 2, "replies": []}, {"body": "Bababababa uuu mow mow baba umow mow.", "score": 1, "replies": [{"body": "Beautiful.", "score": 1, "replies": []}]}]}]}, {"body": "Was the word a WSB word or a Reddit word? Cause anti-evil took the post out =/", "score": 2, "replies": [{"body": "Damn - WSB dirty fake money word", "score": 1, "replies": [{"body": "Odd", "score": 2, "replies": []}]}]}]}, {"body": "Just curious: why did you choose this shelf steak 🥩 pic for the post?", "score": 2, "replies": []}, {"body": "I’m in. Take my money!", "score": 3, "replies": []}, {"body": "u/Gasolinepizza and u/flying_madman what are your thoughts on Innovative Computer Engineers?", "score": 4, "replies": [{"body": "A+\n\nWas this an unban post or just for love of the art?", "score": 2, "replies": [{"body": "He’s the one that said the pirate post could be better to your comment. We agreed he write one within a month and he pulled a WSB and wrote it that night on 10 beers.", "score": 1, "replies": [{"body": "Oh right!! Fuckin A", "score": 2, "replies": [{"body": "Yeah. Gotta think of a flair...", "score": 2, "replies": []}]}, {"body": "What's his flair?\n\nHe needs a flair.", "score": 2, "replies": [{"body": "Yeah, flairless...needs one to commemorate the event. Gotta think 🤔", "score": 2, "replies": [{"body": "I would say Innovative Computer Engineer but it might need a twist or something extra", "score": 2, "replies": [{"body": "My first thought was “Hackers are just Innovative Computer Engineers” but might be too long.", "score": 1, "replies": [{"body": "Why'd you leave the chat?  I miss you already.", "score": 3, "replies": [{"body": "Lol...uh...got any flair ideas Dirty Dan?", "score": 2, "replies": [{"body": "Yeah! Why'd you leave the chat before I even joined! >:(", "score": 2, "replies": [{"body": "👀", "score": 2, "replies": [{"body": "👁️👁️", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Vault 7 goes in to deeper analysis on where these attacks come from and they're always *Russian hackers*", "score": 2, "replies": []}, {"body": "What?", "score": 0, "replies": []}, {"body": "This is what lines of credit are for amiright?????", "score": 0, "replies": []}, {"body": "Your uncle’s speculative land investments in Gaza 🤣 ah yes. I wonder if that’s what the people in Gaza call it?", "score": 0, "replies": []}, {"body": "I'm tired of dealing with buying SPY calls, I'm YOLO on this", "score": 1, "replies": []}, {"body": "Looks like we have another space race about start. GME or Russian hackers to the moon first?", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": ">don't be surprised to see a crab pattern begin forming in Q4 2021.\n\n🦀🦀🦀🦀🦀 I'M IN 🦀🦀🦀🦀🦀", "score": 1, "replies": []}, {"body": "I was lucky enough to invest in a very competent innovative computer engineer last month named Ivana Twisthernipsoff. Now I have a mansion and 2 yachts...YOLO...", "score": 1, "replies": []}, {"body": "As soon as I saw the post title, I like where this was going!", "score": 1, "replies": []}, {"body": "Any body h3r3 h@cker???", "score": 1, "replies": []}, {"body": "Wsb isn’t compromised....\n\nReads this shit an posts about funding Pirates.\n\n🤨", "score": 1, "replies": [{"body": "Yeahhhhh long story short was drunk last night accidentally told a mod I’d do a better one than pirate guy, really didn’t want to get banned", "score": 1, "replies": []}]}, {"body": "Oh hell yeah. I was afraid I’d miss out on this. I’ll send you all my information, and I’ll send it directly to the Russian hackers. I figure the more ways I send out all my information, I’ll have an even better chance of getting invested. Thank you so much. Maybe I should borrow against my house and yolo into this all in", "score": 1, "replies": []}, {"body": "👀", "score": 1, "replies": []}, {"body": "PrinterGoBrrrr", "score": 1, "replies": []}, {"body": "When do I get money, just gave my SSN to the guy? Can’t wait !!", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "Is there sufficient short interest to fabricate a squeeeeze???", "score": 1, "replies": []}, {"body": "The Somali pirates sounded like a better idea but im in", "score": 1, "replies": []}, {"body": "BlackBerry known to block all the Russian ransomware, as mentioned by DarkSide", "score": 1, "replies": []}, {"body": "If you're in, I'm in.", "score": 1, "replies": []}, {"body": "Imma fomo in", "score": 1, "replies": []}, {"body": "Imagine believing a word the FBI says in 2021. \n\nRussian hackers….lol", "score": 1, "replies": []}]}
{"title": "Work Horse DD", "selftext": "**With the growing talk about a potential Work Horse short squeeze I looked into the company and here's what I think about it, and why I bought: TLDR at bottom**\n\n&#x200B;\n\nThere is a TLDR after each section for more in depth details. Or a very broad TLDR at end.\n\n# The Drone (CON)\n\n1. \"Horse Fly\" is Work Horses last mile delivery drone launched from their delivery vehicle. Sounds great in theory and this is exactly what we expected the future to hold, right? Sure. As a consumer though do you really want your package to be dropped in your [front yard](https://youtu.be/05BaPqBXNT0?t=207) and have to walk to pick up your package or have a person put in literally in front of your door? A loud drone is also a huge \"HEY COME STEAL MY PACKAGE\" alarm.\n   1. \"Horse Fly\" Me, the OP, being a student Pilot, I knew about airspaces and can Horse Fly even fly in the majority of US Airspace? Turns out they actually can, they claim on their website they have worked with the FAA to obtain permission which is a major PRO. As stated on their website: **\"The HorseFly system is designed to conform to the FAA guidelines for UAV operation in the U.S. \"**\n      1. However, you cannot really use this system in any densely populated area (like new york) for the simple fact you don't want drones flying around 10lb packages above thousands of humans heads all day. That's a lawsuit begging to happen.\n2. The drone is limited to a 10lb payload, this even further reduces the actual amount of packagesit will be able to deliver. Ultimately this drone is pretty fucking useless as it's only use is in very sparsely populated areas or small suburban areas.\n\n(1) **Tl;dr:**\n\nThe drones cannot be utilized everywhere in the USA, which greatly restricts their abilities considering the [majority of the US population lives in just a few different locations](http://ecpmlangues.u-strasbg.fr/civilization/geography/maps/US%20Population%20density,%202010.png) anywhere dark red would likely be unable for this drone. Drones are maintenance heavy and seem to still require human intervention. I just cant see the ultimate viability of drones compared to a human. Would be loud and attract thieves, and annoy customers.\n\n# Continued Revenue (CON)\n\n2.How will Work Horse continue to make money after i.e UPS buys all the trucks they want? Obviously UPS is not interested in buying the newest model every year, which means no new revenue for Work Horse. So what about maintenance? It appears as though Work Horse contracts out maintenance through Ryder Systems. [https://ryder.com/locations](https://ryder.com/locations). This would imply Work Horse will not be making money from maintenance.\n\n1. Drone Maintenance? I haven't found anything on their website about this, but would it really be worth it for UPS to have to be constantly shipping these drones back to Work Horse for repairs and needing to keep extra drones on hand and constantly accessible? Or just pay a driver who is significantly more reliable?\n\n&#x200B;\n\n(2) **Tl;dr:**\n\nTheres **no real potential for continued revenue** after workhorse sells a company their initial fleet, workhorse wont be the ones doing maintenance and the customer company wont be interested in a new fleet of the newest model each year.\n\n&#x200B;\n\n# Charging Costs (CON)\n\n[reuters.com](https://reuters.com) Did an article about workhorse charging costs. **\"Developing the battery plants and charging infrastructure to fund an electrified global vehicle fleet could require an investment of $2.7 trillion by manufacturers and governments \".**  Workhorse does not have anywhere near the required capital to build charging stations, which would likely leave the cost for UPS to cover. Not to mention EV doesn't change a god damn thing, we will create the electricity for the EV's by burning coal LOL [https://www.reuters.com/article/us-ups-workhorse-group-electric-vehicles/ups-workhorse-electric-van-deal-shows-progress-on-charging-costs-idUSKCN1G61RZ](https://www.reuters.com/article/us-ups-workhorse-group-electric-vehicles/ups-workhorse-electric-van-deal-shows-progress-on-charging-costs-idUSKCN1G61RZ)\n\n(3) T**l;dr** Infrastructure required will likely be so significantly expensive that the cost would never be recouped over any realistic time frame from the money being saved between electricity and petroleum costs by a customer company (like UPS). Besides, electricity on this size scale will be significantly more expensive than petroleum which just means you're consistently losing money by switching to an EV fleet.\n\n&#x200B;\n\n# Why Q4 FY 2020 Was so high (CON)\n\n\" **Sales for the fourth quarter of 2020 were recorded at $652,000 compared to $3,000 in the fourth quarter of 2019. The increase in sales was due to a higher volume of trucks produced and delivered.** \" [https://www.globenewswire.com/news-release/2021/03/01/2184359/0/en/Workhorse-Group-Reports-Fourth-Quarter-and-Full-Year-2020-Results.html](https://www.globenewswire.com/news-release/2021/03/01/2184359/0/en/Workhorse-Group-Reports-Fourth-Quarter-and-Full-Year-2020-Results.html). The majority of this large increase was actually due to an investment workhorse made in $RIDE. The only quarters that will generate a profit is those that WKHS made a good investment or sold vehicles, they have no recurring or stable revenue source.\n\n&#x200B;\n\n# The MOASS (MAJOR PRO)\n\nThis stock has a huge potential for the Mother of All Short Squeezes. From [marketbeat.com](https://marketbeat.com) they claim 38.5% of workhorses shares are shorted. This is massive, and literally we just caught the shorts with their [pants down](https://www.reddit.com/r/wallstreetbets/comments/ns4bqz/amc_ceo_shows_us_he_isnt_wearing_pants/).\n\n&#x200B;\n\n# So why the fuck did you buy it then?\n\nI bought it for the squeeze. WKHS Can gain a lot of potential with a larger capital if a squeeze were to occur.\n\n&#x200B;\n\n# Overall TL;DR:\n\nWorkhorse is a shit company in the long term and will never be able to scale appropriately given their current capital, but the short-term short squeeze could provide capital to allow for workhorse to build their own maintenance shops, charging stations, and dealerships around the US which will provide a stable revenue source. Currently they don't stand a chance against Amazon.\n\n**TL;DR OF THE TL;DR:**\n\nCompany shit, short squeeze good.\n\n&#x200B;\n\n**DISCLAIMER**\n\nDon't sue me because of your own personal decisions on the free-market this isn't financial advice, and **I don't guarantee anything in the post to be true or accurate.** I don't intend to influence any decision, this is simply information I collected to share with my fellow apes.", "id": "nt6478", "created_utc": 1622929147.0, "score": 201, "upvote_ratio": 0.78, "num_comments": 75, "comments": [{"body": "I’m just in for the squeeze potential 🤞🏻", "score": 45, "replies": []}, {"body": "So the company is garbage but the squeeze is possible.  Sounds like a couple other popular companies here. I'm in", "score": 91, "replies": [{"body": "This is the most intellectually honest comment in the subreddit.", "score": 60, "replies": []}]}, {"body": "I like this\n\nOn a source it mentions there short interest being at around 42% and was the highest out of the chart it included\n\nInstitutions holding higher percentage relative to inside traders according to Yahoo Finance", "score": 19, "replies": []}, {"body": "The horsefly Is specifically designed for rural application. You can hand deliver a package while horsefly delivers one to a farm house doorstep with a half mile driveway covered in cow manure.", "score": 14, "replies": [{"body": "Only if the package is less than 10 lbs, and thats only applicable for the small amount of farm houses in America. It's not scalable at all.", "score": 2, "replies": [{"body": "What if the drones lifted more, wouldn’t that be scalability", "score": 2, "replies": [{"body": "I think so. The drones are a very innovative and good idea, it's just unviable for say UPS to want this as they'd have to invest hundreds of billions just to use these drones.\n\nMaybe in the future when theres good infrastructure for recharging, repairing the drones. But Right now this is ahead of it's time and I see 0 potential with this company. It's a good buy if you don't mind holding for about 30-50 years.", "score": 5, "replies": [{"body": "While I will agree with you, with bigger adopters like $F bringing in the lightning, I think a more realistic time frame will be 10-20 years max. I plan to sell if it squeezed and by back in at a more realistic price target. ( position 250 shares at 14.10 )", "score": 4, "replies": []}, {"body": "I’m a pilot, helicopters. Drones are pretty much already taking over major sectors in this industry. A drone can legally weigh 55 lbs and lift much more than 10lbs. \n\n30-50 years... drones are already happening. We not longer fly cables to string telephone poles. A drone does it now for example. \n\nIn urban areas it will never happen. Airspace is too restricted and until they figure out dedicated airways for them to fly. It will not be a thing in any big city. \n\nBut rural areas and the advancement in lidar and gps. This is a few years away.", "score": 5, "replies": [{"body": "Work Horses drone is maximum of 10lbs. It will be 30-50 years before there are trillions of dollars invested into the infrastructure to support a massive fleet of electric vehicles which the drones will be launched from. Im a pilot too and they claim to already have respective FAA permits. This can like i said be used anywhere except densely populated Class Bravo airspace areas. Probably wont even be allowed in charlie airspace either.", "score": 1, "replies": [{"body": "I’m gonna assume you just have PVT ticket as C airspace really doesn’t exist other than a few airports. And BRAVO airspace is only restrictive to the surface a few miles from the field. Most major cities B airspace doesn’t touch the surface and drones will never fly to the first tier which is thousands of feet above the surface. \n\nFleet vehicles go back to a yard. A small charging station is all you need.", "score": 2, "replies": [{"body": "\"A Small charging station\" That you need for every single county in every single   \ncity for every single state in the USA. A small charging station which will use a huge amount of electricity which there is no capacity for. How much would it cost to build thousands of small charging stations, land costs, materials, and then the electricity? How much would it cost UPS to buy tens of thousands of new vehicles and electricity costs? \n\nAs I cited, this sort of infrastructure will cost trillions of dollars, who's paying that? The US Government? WorkHorse? UPS?", "score": 1, "replies": [{"body": "I’d like to explain it to you but your obviously don’t care to listen to it. \n\nI’ll assume they would phase out older vehicles and depots that they currently already own to newer EV type vehicles. Since they budget for new vehicles years in advance, they all ready have the money to invest in EV. They also already own property in almost every single county in every single state in the US. Adding two or three charging stations for the 3-5 EVs they will have really isn’t a huge cost when it’s spread out over a decade as older gas vehicles run out of life and they are upgraded to EV. \n\nThis isn’t happening over night. It will take years to phase out their fleets. But the cost of saving in fuel as the EV fleets get bigger with rapidly increase this process.", "score": 2, "replies": [{"body": "Sounds like you're talking about  Work Horse's customers. How the fuck will WKHS profit from UPS building their own charging stations? They don't. Work horse literally just sells their little trucks and that's it for them, no more income for them.\n\nI do agree with that, it wouldn't be hard for UPS to do this, I'm speaking in terms of WKHS building this infrastructure to profit from. They can't, they are too poor.\n\nIn the long term I really doubt it will be profitable for say UPS to switch to EV. It will cost a colossal fuck ton for a new fleet, for building costs, and electricity costs will likely exceed petroleum. In a case where electricity is cheaper than petrol, it won't be significant enough to ever recoup the massive loss of switching.", "score": 3, "replies": []}]}]}]}, {"body": "You don’t really know what you’re talking about. I’d assume if their drone can lift 10lbs then they did a critical analysis of what the weight is of 99% of Mail being delivered. Prolly less than 10lbs. \n\nIt doesn’t take trillions of dollars. Or massive infrastructure. \n\nA drone can launch from the bed of a truck and if the residence has a GPS pin the drone can fly to it while having a lidar sensor manage anything in its flight path. \n\nThis is already happening. It’s not 30-50 years away. We have drones that fly pipelines almost 100% AI with just gps waypoints.", "score": 4, "replies": [{"body": "No shit, this company launches their drones from an EV which requires large infrastructure that's not been built yet. That's my point but it clearly flew straight over your head\n\n\"Payload Weight:\t4,535 grams / 10 pounds\" [https://workhorse.com/horsefly.html](https://workhorse.com/horsefly.html)", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "I bought way more then I can afford 🦄🦄🦄🦄🦄", "score": 14, "replies": []}, {"body": "Honest, I like it.", "score": 11, "replies": []}, {"body": "I'm in on wkhs because I like wkhs 😂", "score": 7, "replies": [{"body": "Same like some of us actually believe in the company lol", "score": 2, "replies": []}]}, {"body": "I am on the fence about this one.....very interested though.\n\nAnyone else?", "score": 6, "replies": []}, {"body": "Not even kind of close to a shit company though", "score": 15, "replies": [{"body": "explain", "score": 3, "replies": [{"body": "You’re right, they’re in denial. I made a ton of money on WKHS riding it up from $1.50 to $30, I know it in and out and know it’s a shit company since they lost WKHS", "score": 2, "replies": []}]}, {"body": "You’re right. It’s not a shit company. \n\nIt’s a steaming fucking cesspool that wants to pose as a company.", "score": -1, "replies": [{"body": "I think you mean Nikola?", "score": 11, "replies": []}]}, {"body": "No kidding.  This dope doesn’t know what he is talking about.", "score": 2, "replies": []}]}, {"body": "I am in already proof below\n\nhttps://www.reddit.com/r/wallstreetbets/comments/ns9h1r/long_1000_shares_of_wkhs_short_squeeze_is_coming/?utm_medium=android_app&utm_source=share", "score": 4, "replies": []}, {"body": "Absolutely trash company with non-functioning tech outgunned by the big guys (Amazon, Tesla, Alphabet, Rivian, Ford, GM)…. I’m in.", "score": 5, "replies": []}, {"body": "GPRO patented silent drone technology recently haha", "score": 2, "replies": [{"body": "That's huge, Amazon will be wanting that at some point and will pay huge.", "score": 1, "replies": []}]}, {"body": "WKHS 🌙", "score": 2, "replies": []}, {"body": "Was holding many shares, and down 35 percent at one time. Sold entire stake for 20% profit during mini squeeze last Thursday. I no longer believe this company is a game changer in the EV space, and are in a losing battle against the big boys in this industry.", "score": 4, "replies": [{"body": "You are probably correct. But AMC and GME are also in the dumps, but here we are, both have skyrocketed.", "score": 10, "replies": []}, {"body": "I agree, they don't have enough to put into R&D to remotely compete with Amazon who is already an industry leader with unlimited capital. Amazon will also likely make their own infrastructure for last-mile delivery as they have a strong motive to do so, they eat a big loss by contracting last mile out to USPS and would save tons by making their own.", "score": 2, "replies": []}]}, {"body": "https://www.reddit.com/r/WKHS/comments/nt7vif/fellow_ape_brothers_and_sisters_please_review_my/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 2, "replies": []}, {"body": "Apparently it began being shorted around $30 so until the price gets over that this is just a baghold", "score": 3, "replies": [{"body": "Nah...the big halt the day this crashed was in the low $20s (halted about 15 minutes)...probably as some maker scraped up shares to sell into the panic...if we get this to $20, next stop is $50", "score": 9, "replies": []}]}, {"body": "So what’s the move just for next week? Cause to actually invest in this company is a big NO.", "score": 1, "replies": [{"body": "investing in wkhs is just for a potential squeeze, not cause it's actually good.", "score": 7, "replies": [{"body": "That’s what I just said", "score": -3, "replies": [{"body": "\"So what’s the move just for next week? Cause to actually invest in this company is a big NO.\"", "score": 0, "replies": [{"body": "Ok, so what’s the play?", "score": 0, "replies": [{"body": "investing in wkhs is just for a potential squeeze, not cause it's actually good.", "score": 7, "replies": [{"body": "Well I’m just looking  at the possibility of a squeeze", "score": 10, "replies": []}]}]}]}]}]}]}, {"body": "My play is probably not popular, but here it is anyway. Investing in WKHS through squeeze (1.4K shares @ 11.80). Selling on way down and using profit to buy more RIDE (currently 3K shares @ 11.03). Russell Index add, Lordstown Investor Week, and Sept production are near-term catalysts. When, if, hoping RIDE gets to $30, will start trimming, while still holding around 2K long.", "score": 1, "replies": []}, {"body": "Workhorse is basically a scam at this point, vague promises with nothing to substantiate them. They may catch a break eventually so I wouldn’t short them either, but buying now is just gambling and the odds are not in your favor", "score": -3, "replies": [{"body": "This is a casino.", "score": 23, "replies": [{"body": "But you will have better odds at roulette table.  This company is a joke and has twice the float as GME.  No squeeze here", "score": -6, "replies": [{"body": "Social sentiment will be what carries this one. Whether it is a trash company or not, it's small market cap will easily move upwards. If it turns out to be a dud, well, that's that.", "score": 2, "replies": []}]}]}]}, {"body": "If you want a better short squeeze, look at CLOV. Same short interest, better company, better catalysts", "score": -3, "replies": []}, {"body": "🐎 6/11 6/18 20c", "score": 1, "replies": []}]}
