{"title": "thoughts on AMD?", "selftext": "so i just purchased some shares of AMD at around 82, any thoughts on the future performance? just the other day they were at 87 so i’m hoping for it to at least go back up to that. i’m not too familia with aspects of the investing world, but just wanted to see if i could get some advice! (or if i made a mistake lol!)", "id": "o53l0b", "created_utc": 1624304487.0, "score": 78, "upvote_ratio": 0.78, "num_comments": 74, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "has potential but it’s pending a merger with xlnx. Been back and forth for months now but if the merger goes through and earnings are strong can definitely break out. AMD has so much going for them with their technology and chips in xbox, ps5, samsung phones, teslas. And if you know anything about cpus for computers the sentiment in the gaming world is intel=bad amd=good. Will reflect in market share in the long run.", "score": 83, "replies": [{"body": "Forget the gaming market, they are absolutely creaming Intel in the server space. Intel is atleast competitive in price for gaming but the server space is another story. Not only did it take them 2 years to offer a single socket 32 core CPU, but those cores are plain 10-16% slower than AMDs. The only reason to use Intel is for specialized workloads at this point. The enterprise market is where the main money for these companies is at and AMD is eating Intels market share as it stands.", "score": 42, "replies": [{"body": "The xilinx deal is essentially a good earnings base for amd. If you look at the revenue is 2020 vs 2019 you will see the huge transformation amd has gone through. The question is can amd keep beating earnings estimates. I'm betting that after a few good earnings it will go over 100 and surpass 52 week high either this quarter or 3rd quarter. Note they don't have to be blow out results as they only need to show investors that the downside risk is very low. \n\nIt's a wrap in the server space. One unique feature which is huge in new amd chips is the hyperviser security which essentially is specifically made for virtual containers made for cloud provider like Google cloud. The gaming market, especially the higher end is a kill too, but this is a very small business for amd.", "score": 7, "replies": [{"body": "XLNX is dead money. Unless Su has some magic synergy plan hidden away, AMD is paying way too much, and probably shouldn't be buying at all.", "score": 1, "replies": []}]}]}, {"body": "Intel=bad amd=good is a sentiment among a lot of supercomputing users, too.", "score": 8, "replies": []}, {"body": "I wonder if XLNX has more potential to grow with the merger announcement if it comes. It seems more volatile", "score": 2, "replies": [{"body": "Unlikely for Xilinx to have major growth based on FPGAs (including any combination with AMD tech). The merger expands AMDs business with more offerings but ASICS are king for all emerging tech.", "score": -1, "replies": []}]}, {"body": "> And if you know anything about cpus for computers the sentiment in the gaming world is intel=bad amd=good\n\nThis is absolutely not true. Amd has been gaining popularity recently because they're starting to get close to Intel in terms of quality while having lower prices. A lot of gamers still prefer Intel over AMD though, while content creators prefer AMD. In the end, when it comes to CPU's, Intel and AMD are both considered good", "score": 1, "replies": []}]}, {"body": "If you enjoy watching a stock move between 76 and 86 repeatedly, you’re in luck and welcome to the club", "score": 150, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "Only on the day I bought it.", "score": 41, "replies": [{"body": "I have shares at a $92 cost basis…tell me about it", "score": 6, "replies": []}]}, {"body": "ever checked historical stock performance? charts and stuff, you know.", "score": 8, "replies": [{"body": "i know that was probably a super dumb question but i’m not too sure with navigating the charts and stuff. i use the Webull app, i just started investing like 3 weeks ago cause my friend encouraged me to haha", "score": 1, "replies": [{"body": "AMD is a great stock in my opinion, and it's generally highly regarded on reddit, but if you don't know what you're doing why not just buy SPY or QQQ?", "score": 3, "replies": []}]}]}, {"body": "It has been as notherday described all year, hit 90 once or twice but never for long.", "score": 1, "replies": []}]}]}, {"body": "AMD is my long term, favorite stock. I've been adding 1 share a week for awhile. I even started doordashing just to maintain my ability to comfortably buy a share per week.\n\nI've been around computers for awhile, and I remember when AMD & ATI were separate companies. While Nvidia has no doubt pulled away in the GPU market, ATI at one point made the best cards.\n\nAMD as a company now is like if Intel and Nvidia had a child. Now, that child is finally maturing to a point at which it has all the opportunity in the world to keep growing.", "score": 48, "replies": [{"body": "Things were going badly for AMD so they changed their CEO and there she was, Lisa Su, who then gave the engineers more power basically is what I recall has happend", "score": 1, "replies": []}, {"body": "So does it piss you off that they keep issuing more shares instead of buybacks?", "score": -30, "replies": [{"body": "They just did a 4b buyback…", "score": 27, "replies": []}]}]}, {"body": "Long term hold for me.\n\nI like their products and the CEO seems competent.", "score": 16, "replies": []}, {"body": "I like AMD.", "score": 70, "replies": [{"body": "104 shares at $23. I like it too.", "score": 31, "replies": [{"body": "350 @ 2.65\n\nI like it too", "score": 29, "replies": [{"body": "Ummm. Excuse me….. 😆", "score": 9, "replies": []}, {"body": "You REALLY like it", "score": 4, "replies": []}]}]}]}, {"body": "It's the only red stock in my portfolio. But will continue to hold as their products will continue to be in demand in the future.", "score": 14, "replies": [{"body": "Jeez, it's my only green one after last week.", "score": 10, "replies": []}]}, {"body": "Bullish on AMD. I'm married to this one for a while.", "score": 21, "replies": [{"body": "Never divorce. You are perfect for each other!", "score": 4, "replies": [{"body": "Just wanna say that Chicken Bakes are GODLY.  I've never had a more perfect blend of chicken, cheese and spices wrapped in delicious bread.", "score": 2, "replies": [{"body": "Thank you for making me hungry! I was chronically deprived of chicken bakes now because of pandemic restrictions. Now that my local Costcos offer them, I truly feel like I am living again.", "score": 2, "replies": []}]}]}]}, {"body": "I like AMD long term, but after last year’s tremendous run, it’s been cooling off some and there’s a strong ceiling at 90ish. My plan has just been to add a little whenever it dips into the 70s and to be patient.", "score": 16, "replies": []}, {"body": "Buy it to hold it.. I bought as much as I could down at 73..   if you watch it short term it’ll drive you mad, so purchase and forget about it.", "score": 8, "replies": []}, {"body": "I walked around best buy this weekend and more than half the laptops on display had amd stickers.", "score": 5, "replies": []}, {"body": "AMD is a buy. I’m waiting to go back down again.", "score": 6, "replies": []}, {"body": "250 @ $81 for months.  I'm holding hard!", "score": 3, "replies": []}, {"body": "Been in since $14. No plans to sell", "score": 3, "replies": []}, {"body": "They have been consoliding in a range between 73-87.  I believe it’s a good time to accumulate\n\nThey have also announced a $4 billion share repurchase program to increase returns for shareholders.  It’s also a good sign, they have reached a deal with Google.\n\nI think once the merger with XLNX goes through to help meet their ever increasing demand.  I think we should see triple digits on the share price fairly soon\n\nDisclaimer: not financial advice", "score": 6, "replies": []}, {"body": "I think it's a GREAT BUY. I've been a holder since $14", "score": 4, "replies": []}, {"body": "I have been slowly gathering it. \n\nI started buying a lump at around $45 a share and am currently buying a few more shares every so often it dips to the mid 70s. \n\nI'm up to 75 shares now and plan on holding for a while. I eventually see this hitting at least the 100-110 price point over time.\n\nMore:\n\nThey are absolutely dominate in the cpu market right now. They own both playstation and Xbox (many year cycle) and are finally starting to make inroads in the data center CPU game. Nvidia is still dominating in GPUs, but AMD is starting to make some plays and recently his impressed with some upcoming features.", "score": 2, "replies": []}, {"body": "Sitting on a 3/2022 $90c. Once the XLNX merger goes through AMD is gonna rocket. Basically every analyst has a price target of $110 or higher for AMD. Merger is the only thing holding it back.", "score": 2, "replies": []}, {"body": "Long heavy for $100+", "score": 2, "replies": []}, {"body": "They're really being hurt by chip shortages as they are no longer able to gain marketshare in CPUs due to supply constraints. The longer this continues, the more time Intel has to catch up technologically (actually possible with their new management). I'm not bearish, but I'm less bullish than I used to be", "score": 2, "replies": []}, {"body": "Excellent stock to hold long term.\n\nI've been holding since $10, and also ~$50, $70, and $85. I sell CSP and CCs on it too.\n\nTheir products are superior, their software updates are nice, CEO is a competent engineer, marketing is on point, and they're competing against Intel and Nvidia at the same time. I couldn't ask for a more innovative and competitive leadership team.\n\nLong term my price target is $120 - $180.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Thanks for your thoughts. Disagree with your assessment though. My opinion is that your evaluation of the technology landscape, and of the competition is off the mark.\n\nThe global computing market demand grows exponentially year over year. I believe AMD is in a position to capture a growing slice of that demand. Supply is also flexible. Major foundries are ramping up as quickly as they can; and I am pretty sure AMD already secured some good long-term deals.\n\nIntel is not likely to offer equally attractive products for 2 years. They are experiencing serious issues with company's engineering culture, and their real next-gen chip still has a long way to go. Undercutting the price will have minimal impact if your offering isn't very  competitive. Just look at how hard AMD struggled several years ago.\n\nThe stock buyback, in my opinion, reflects the management's strong conviction that the business will grow beyond market expectation. I would be very surprised if AMD does not break $200 per share by 2024. While there are many hyped up tech stocks, I don't think AMD is one of them.", "score": 4, "replies": []}]}, {"body": "If the EU Antitrust Organization ok's AMDs merger with Xilinx in the next 3 weeks, and it's popular belief it will, the stock should flirt with its ATH around 100 pretty quickly. The real challenge comes next summer to push it past that level when the Chinese antitrust makes their ruling on it. \n\nIf EU denies the merger, look the fuck out because this baby's going down, and fast.\nIt's a high risk, high reward situation at this point. AMD posts great profits and gives good guidance on earnings and the stock has a tendency to dip anyway. It's maddening.\n\nIt's the most frustrating stock I've ever owned because of the vast difference between what I see in it and what the market seems to see in it. Make no mistake though, I will cut ties completely if the merger is denied by anyone.", "score": 1, "replies": []}, {"body": "I like amd", "score": 1, "replies": []}, {"body": "AMD is a solid investment that will steadily increase over time.  (Not financial advise.)", "score": 1, "replies": []}, {"body": "Great company, great products, terribly overvalued stock.", "score": -1, "replies": [{"body": "People won’t admit it’s overvalued. AMD has to do some close to impossible on their fundamentals to justify its today’s value.", "score": 2, "replies": []}]}, {"body": "Over valued. Have you done any valuations?", "score": -4, "replies": [{"body": "P/E is a bit high. Lol I still like this company.", "score": -2, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "How are we all being downvoted? 😄😄", "score": 2, "replies": []}]}]}]}, {"body": "I also entered last week. I'm excited about the q2 results and I am hoping the stock hits 95 next quarter. But this is just my two cents", "score": 0, "replies": []}, {"body": "I use their products and it's a stable company so I just keep it as long term investment.", "score": 0, "replies": []}, {"body": "Ahead of competition, good CEO with focus on R&D.", "score": 0, "replies": []}, {"body": "I'm not sure if these semiconductor stocks have the chip shortage properly priced in. I'll buy some more AMD in the 70s.", "score": 0, "replies": []}, {"body": "There are two ways to look at an AMD chart.  Looking at the YTD chart it undercut its last base and right now appears to be forming a cup with handle which would make it a first stage base.\n\nHowever if you zoom out to a one year chart you could argue that it almost looks like a head and shoulders pattern.  It’s at a very important level right now.  If it can get to 90 you are ok.  If it breaks below 80 I would get out of AMD.", "score": 0, "replies": []}, {"body": "Xilinx could be a very big deal. The whole world is looking for FPGAs right now and can’t get them, and most of those people are looking for Xilinx fpgas. FPGAs aren’t consumer products generally so most people don’t understand just how important they are.\n\nWith that said, I don’t know enough about how supply chain issues affect stock prices to tell you anything", "score": 1, "replies": []}, {"body": "Well it has done great for me since I bought it close to $11 just a bit over 2 years ago.\n\nMy decision has been to hold and not get taxed on the gains, but I haven't increased my position.\n\nI think AMD is a long-term buy. It is priced a bit high right now as investors are expecting growth and more revenue in the next couple of years, but that growth in the share price. If they beat expectations it will go up more. If there is macro-economic instability or other market problems, it might be prone to more volatility and greater decreases in value.\n\nIf your looking for short-term purchases, it might face some volatility at times. It is definitely a high growth stock and the market is pricing that in. Any small thing puts future gains in jeopardy will lower the price.", "score": 1, "replies": []}, {"body": "Like most things first im hearing of it. But hopefully one of these days I'll get the heads up on somethin!", "score": 1, "replies": []}, {"body": "I see they just announced it. Shares have been issued every year. About time", "score": 1, "replies": []}, {"body": "Just the other day I was going back and forth on whether I should buy AMD or MU. I ended  up buying MU as it has a higher upside($119 to $104 for AMD). So with that being said. AMD is a decent pick.", "score": 1, "replies": []}, {"body": "Definitely has potential, but need to keep an eye on it.", "score": 1, "replies": []}, {"body": "Like others suggested AMD is a great buy and forget for 8-10 years kind of a stock. Also whenever you discover options trading, this stock is a really good one for that. Just buy short term calls probably a month out whenever this stock dips below 80 again", "score": 1, "replies": []}, {"body": "Rock solid stock. Good growth, great management, trading at an attractive valuation. Whilst it's in a consolidation phase right now, it's a true long term hold that you should sleep well at night holding. There are plenty of stocks to gamble on, but this is a stock to invest in.", "score": 1, "replies": []}, {"body": "AMD is the kind of stock that you just set and forget. If I would lose access to my account and not touch it for the next 5 years, I would Valero well with AMD in my portfolio.With inflation or without it you can be sure that a good pipeline of products and great Management AMD will do good", "score": 1, "replies": []}, {"body": "amd is great if you enjoy edging yourself to the cusp of breakout and then going back down", "score": 1, "replies": []}, {"body": "NVDA way Better same field.. or LRCX and small Semi MRVL", "score": 1, "replies": []}]}
{"title": "Tesla AI day in ~ 1 month", "selftext": "", "id": "o52tyo", "created_utc": 1624302512.0, "score": 219, "upvote_ratio": 0.99, "num_comments": 70, "comments": [{"body": "*insert timeline joke*", "score": 66, "replies": [{"body": "[Indeed](https://media1.tenor.com/images/2b82b9ac8310d362f6c21286ea4320c9/tenor.gif?itemid=17245109)", "score": 20, "replies": []}, {"body": "You know Elon said when he gives a date, it means \"not before then.\"", "score": 11, "replies": [{"body": "NET for the NEETS", "score": 1, "replies": []}]}, {"body": "Got it. So in 3 months. Maybe.", "score": 16, "replies": [{"body": "6 months definately.", "score": 4, "replies": []}]}, {"body": "It's funny to me because they're doing such amazing things.  Not really directed at you but when people ridicule their missed deadlines I wanna ask them \"What are YOU doing with YOUR life that you think you can pass judgement on them for missing on hard problems?\"", "score": 13, "replies": [{"body": "Currently I’m missing my deadlines at work for building CRUD apps for the nth time", "score": 19, "replies": [{"body": "My boss always says: “If you reach your goals, they are not ambitious enough”. So missing slightly the deadlines or goals by a bit is not a bad thing.", "score": 2, "replies": []}]}, {"body": "You don’t get from zero to half a million cars last year by being realistic. You set crazy goals and miss them.", "score": 10, "replies": []}]}, {"body": "Plus or minus 2 weeks", "score": 2, "replies": []}]}, {"body": "What ever happened to the FSD button?", "score": 32, "replies": [{"body": "My guess:\n\nElon: \"Let's release this thing\"\n\nLawyers: \"lol no\"", "score": 73, "replies": []}, {"body": "I mean... I've had fsd for 4 years now. You'd think I'd be button ready!.. Sigh.", "score": 10, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Lol probably", "score": 4, "replies": []}]}]}, {"body": "The explanation from Elon was that they canned v8.3 that was supposed to have the button. They didn't feel there was any reason to do a broad testing expansion with a opt in button on a version that was going to soon be obsolete with the fundamental changes of V9. The data would be worthless to them. I believe he has said they will try again for a button sometime after v9 starts getting tested.", "score": 17, "replies": []}]}, {"body": "This should be exciting", "score": 14, "replies": [{"body": "This is where the fun begins", "score": 3, "replies": []}, {"body": "Or disappointing", "score": -12, "replies": [{"body": "Why would it be disappointing ? \n\nNot one self driving AI is as exciting as Tesla's. \nThere's literally no real competition.. so ya, to see what they're working on would be exciting", "score": 12, "replies": [{"body": "It’ll be disappointing in that people not familiar with the industry won’t understand the presentation, just like battery day, and that the actual date of the event will probably be 2-4 months from now rather than July", "score": 7, "replies": [{"body": "That would be their loss ..and only theirs \n\nInvestors still don't understand what Tesla is about", "score": 4, "replies": []}, {"body": "\"purpose is recruiting\"\n\nTranslation: We're far from done. We've just begun working on the new iteration. We're starting from scratch once we get DOJO online. We need help getting DOJO online.\n\n\"Purpose is recruiting\" is setting the bar very low. Don't get excited fellas. Or else you'll end up thinking 4680s are in the model s like the other nut jobs. Or that one guy on YouTube who thinks there's hidden range on the model s that will be unlocked via OTA when the time is right.", "score": 0, "replies": []}]}, {"body": "Or disappointing.", "score": -4, "replies": []}]}]}, {"body": "Exciting for us.\n\n&nbsp;\n\nBased on previous investor days - Market analysts: (⊙＿⊙')^o^^o^^^[huh...hold?]", "score": 1, "replies": []}]}, {"body": "November here we go", "score": 27, "replies": []}, {"body": "Cool, wake me up when it happens.", "score": 13, "replies": []}, {"body": "In Elon time that's 2 years 3 months and 69 seconds", "score": 6, "replies": []}, {"body": "So no FSD this year then?", "score": 8, "replies": [{"body": "did Elon say full FSD release this year? ive only heard v9 beta was supposed to be released \"mid june\"", "score": 1, "replies": [{"body": "Technically [he only said they would have Level 5 autonomy by the end of 2021](https://www.cnet.com/roadshow/news/elon-musk-full-self-driving-tesla-earnings-call/) not that FSD would be released.", "score": 1, "replies": [{"body": "well one could infer its release shortly after \"they have it\" but thats a very bullish outlook regardless of it being released or just having the actual capability.", "score": 1, "replies": [{"body": "Very much agree. I just want the beta!", "score": 0, "replies": []}]}]}, {"body": "He's been promising FSD for many years. The timeline of broken promises about \"full FSD\" goes back about halfway into the last decade at this point. I've yet to hear him acknowledge any of his missed deadlines.", "score": 1, "replies": [{"body": "Miyamoto had a great quote that went basically - \"when I make a game, and if I rush to get it out on time but it’s still not done the way that I want it to be and I put it out in a state that I’m not satisfied with, I’ll never be able to take it back and I will regret it for a very long time. I never had an intention of telling anybody that they’ve made a bad game, and that it will always be bad.”\n\nBetter to just wait until it is absolutely perfect. FSD has safety concerns and cannot be rushed to meet a timeline if it isnt 100%", "score": 1, "replies": [{"body": "No one's disagreeing with that. I don't want unsafe FSD on the roads any more than anyone else. I've just been absolutely disillusioned by:\n\n1. A company reaping thousands of dollars from people thinking they're buying into a beta testing program they've so far been excluded from.\n2. A CEO making childish promises that are totally divorced from reality, refusing to acknowledge his mistakes, then repeating the whole process with new promises. It's frustrating, insulting, and worrisome for anyone who actually wants this company to succeed.\n\nThe FSD issue alone turned me from a Tesla superfan into someone who's borderline allergic to the brand. I still love my M3P but I really don't see great things in the future as long as this utterly untrustworthy manchild is at the helm.\n\nKarpathy is a brilliant dude that I have a lot of faith in, but as long as his boss is in the picture I'll have major reservations.", "score": 2, "replies": [{"body": "You are an investor but \"borderline allergic to the brand\"? Do you own shares or just a vehicle?\n\nMy take is to ignore Elon on timelines and the negative aspects of his personality. I prefer to focus on the big picture of Teslas growth the eventual release of FSD whenever that is. I see plenty of great things in the future regardless of Elon which is why I have a sizeable investment and will hold it well past 2030.", "score": 1, "replies": [{"body": "I own a small number of shares and had been considering a much bigger stake in 2020 but decided against it over the last 6 months or so. My day job is in AI and I know how disconnected from reality Elon is when he talks about FSD—not Karpathy, mind you, just Elon—and I don't foresee it being a realistic product until late in the decade at the earliest (and even then I'm very open to the idea of there being long-tail problems/edge cases we just can't exhaustively verify for well beyond that). Throw in utterly bewildering decisions like the yoke, the lack of a exterior update to the \"refreshed\" S and X, his weird fixation on \"PS5-level gaming\", and I just don't trust this guy at all anymore.\n\nI was super excited to upgrade to a Plaid S this year, btw, until they actually unveiled it. God, what a let down. There's truly not a single thing about the car other than its speed that I'd actually pay for in 2021. If the Audi E-tron GT RS range catches up, that'll be the performance EV sedan to beat in my book. Tesla doesn't inspire or even surprise me (in a good way) anymore.\n\nTesla still rules the world when it comes to batteries, power trains, and the supercharger network. And I'm a sucker for fast cars so I don't mind their obsession with 0-60 times, irrelevant as that may be for most consumers. But I'm a lot less confident in their long-term prospects.", "score": 1, "replies": [{"body": "the audi looks great but the range and price tag would scare me away. im not a luxury sedan guy so its not really my thing anyway. also the model S is a very small part of teslas production. 3/y are where the volume and profit will come from. my outlook on FSD is more bullish than yours so if i was going to purchase a higher end sedan then i would want my $100k+ car to have that capability. Tesla has a >0% chance of having FSD and audi at 0%. Although if FSD does not come out soon then Tesla could have a real issue on their hands with shareholders and early FSD purchases that could cause the stock price to implode. Although there are ways around that issue by letting early adopters transfer their FSD purchase to a new vehicle or refunding those that dont buy a new tesla.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "There are two weeks in a month", "score": 3, "replies": [{"body": "Good bot", "score": 2, "replies": [{"body": "Thank you, Wood_Yi, for voting on SilentKiller96.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)", "score": 1, "replies": []}, {"body": "Are you sure about that? Because I am 100.0% sure that SilentKiller96 is not a bot.\n\n---\n\n^(I am a neural network being trained to detect spammers | Summon me with !isbot <username> |) ^(/r/spambotdetector |) [^(Optout)](https://www.reddit.com/message/compose?to=whynotcollegeboard&subject=!optout&message=!optout) ^(|) [^(Original Github)](https://github.com/SM-Wistful/BotDetection-Algorithm)", "score": 1, "replies": []}]}]}, {"body": "I will set a race, what will happen first, AI day or I will get my first covid shot", "score": 5, "replies": [{"body": "If you live in the US and haven't gotten one yet... what the hell?!", "score": 7, "replies": [{"body": "Not US, Brazil, where the president casually missed and ignored 80 emails from Pfizer selling doses for all the population for less than he spent increasing the salary for a few of his friends on the military", "score": 13, "replies": [{"body": "Ah, my deepest condolences then. It's like if Trump was still in power here.", "score": 6, "replies": [{"body": "The guy who cut regulations to get the vaccine faster?", "score": 4, "replies": [{"body": "No, the guy who said that the virus was a “hoax” and called it a “China Virus” to stoke anti-Asian racism.", "score": 0, "replies": [{"body": "This is a complete lie. Trump never called the virus a hoax. The ironic part is that he said “the media will use this as a hoax” and considering how they lied and said he called it a hoax I’d consider him to be correct. How many lies has the media directly told you that you believe in? Your literally spreading misinformation right now as a result of a media that lies daily. I’m a liberal that has come to terms with just how ridiculously much they lie and I hope you can as well. As if it wasn’t enough to lie about his quote they had to add an anti Asian angle too. I’m Asian dude so trust me when I say that Trump isn’t anti Asian at all.", "score": 1, "replies": [{"body": "https://media1.tenor.com/images/6e87b16151fa533e18087c7965aa21c9/tenor.gif?itemid=14041997", "score": 1, "replies": [{"body": "So you admit the media lied?", "score": 0, "replies": [{"body": "No, not at all. \"tHe MeDiA\" is such a lazy and ignorant trope and you are simply trolling. I dismissed it with a gif, which is all you deserved (if that). Please, stop. You're just embarrassing.", "score": 1, "replies": [{"body": "I called you out on a literal lie you told and your response is a gif. Have you seen the movie idiocracy?", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Indeed, he is our own Brazilian Trump and was huge Trump supporter, as you would expect\n\nBut I will be out of this place soon fortunately", "score": 5, "replies": [{"body": "Where are you going?", "score": 2, "replies": [{"body": "Canada, I think it will be a slightly improvement \n\nI think the /s is not needed lol", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Qtr earnings is about a month out. Perhaps a couple weeks after would be my guess. \n\nConcerning all the indirect references to Elon time, I concur, but when it comes to these events Tesla iterates so fast it is hard to nail a time down where the event is up to date and unlikely to totally change. I think this one is more at recruitment than an investor audience. I don't see them pushing it back to miss any new grads looking for a job. Not that Elon is impressed with sheepskin, but timing is important.\n\nMonday 2nd of August.", "score": 2, "replies": []}, {"body": "So does this mean no FSD v9 before AI day? Sigh", "score": 2, "replies": []}, {"body": "V9 when", "score": 2, "replies": []}, {"body": "I'm so interested in AI and would love to work for Tesla!\n\nI've always said the only issue with Tesla is their lack of better AI. Maybe a call for more talent and ideas is needed.\n\n I was thinking of working with Google because they are in the forefront of AI but Tesla would be an option I would consider.", "score": 6, "replies": []}, {"body": "How about we hold a \"Fix things that we currently know are broken\" day....", "score": 0, "replies": [{"body": "You aren't wrong", "score": 3, "replies": []}]}, {"body": "Let's all get our hopes up then be disappointed and watch the stock drop another 20% :)", "score": 1, "replies": []}, {"body": "I bought tesla shares, to be able to buy a model X, but instead I lost 2 of them so far👎", "score": 0, "replies": []}, {"body": "„Purpose is recruiting“ - so it will be very specific and technical. You all know what's going to happen right?\n\nMedia: \"uh oh, I don't understand, Cruise and Waymo are years ahead 🤡🤪\"\n\nWell for my part: I'm excited!", "score": 0, "replies": []}, {"body": "Will this make it reach a new ATH⁉️ That is the question. Will be 6 months very soon. 👎", "score": -3, "replies": []}, {"body": "Two weeks X2!", "score": 1, "replies": []}, {"body": "that's great to hear but probably not in 1 month lol. I say 3 months", "score": 1, "replies": []}, {"body": "How about this, Elon—instead of giving me access to the beta or even showing me new technology, just explain what *exactly* I paid for with this FSD option. All I *thought* I was getting was a spot in the world's most expensive beta testing program, but evidently even this was a wildly unrealistic expectation. So just tell the world what we've spent our money on. Surely this is a low enough bar for even you to ineffectually flop over, right?", "score": 1, "replies": []}]}
{"title": "Tesla Diamond Hands", "selftext": "", "id": "o4igri", "created_utc": 1624233812.0, "score": 191, "upvote_ratio": 0.88, "num_comments": 70, "comments": [{"body": "Old or fake.", "score": 1, "replies": [{"body": "Both", "score": 10, "replies": []}, {"body": "Agreed. I’d like to see a current picture of your “diamond hands”", "score": 1, "replies": []}]}, {"body": "Who holds a stock for 8 years?? What is this-investing? I thought this was a casino", "score": 94, "replies": [{"body": "Sir this is a Wendy's would you like options with those fries?", "score": 45, "replies": [{"body": "Casino opens tomorrow morning until then this is a Wendy's.", "score": 14, "replies": [{"body": "So is the casino in Wendy's or Wendy's in the casino?  Hmmmm....🤔", "score": 10, "replies": [{"body": "I'm just a fry cook with a cell phone. Those decisions are above my head.", "score": 8, "replies": []}]}]}]}]}, {"body": "Good gains, but when was this taken? Tesla hasn't been 700+ a share for at least a month or 2", "score": 44, "replies": [{"body": "Was taken on October 2021!! 😂 😂", "score": 49, "replies": [{"body": "*OP must be a confirmed time traveller*", "score": 30, "replies": []}]}]}, {"body": "Dad?", "score": 12, "replies": []}, {"body": "Cmon this ain’t r/investing butbifnibwere you I’d just sell the shit out of covered calls and just collect the premiums", "score": 16, "replies": []}, {"body": "So you bought shares of a tech company in 2013, 8 years later you’re calling it diamond hands.\n\nIf we all posted boomer shit this would turn into r/stocks", "score": 37, "replies": [{"body": "Go ahead and grab yourself another cup of Hatorade.", "score": 13, "replies": [{"body": "👀☕️![gif](emote|free_emotes_pack|joy)![gif](emote|free_emotes_pack|joy)", "score": 2, "replies": []}]}]}, {"body": "Inspect element, we meet again", "score": 13, "replies": []}, {"body": "Damn, that's also 10k a month on ultra OTM covered calls.", "score": 5, "replies": []}, {"body": "TSLA is so 2020", "score": 9, "replies": []}, {"body": "tsla is going to start mooning outta control at some point this year. and by that i mean it’ll be worth +1000 easy", "score": 5, "replies": [{"body": "I sold my Tesla and picked up Nvidia a few weeks ago.", "score": 5, "replies": []}]}, {"body": "Why can’t i up vote this badass post 😟", "score": 2, "replies": []}, {"body": "That’s gonna double soon", "score": 6, "replies": [{"body": "No it ain't lol", "score": 5, "replies": []}]}, {"body": "One hell of a trade", "score": 2, "replies": []}, {"body": "If you are in green on Tesla take it. ALL the other auto companies are turning around quick and Tesla’s market share in EVs are already dropping. Heggies are already slowly pulling out.", "score": -1, "replies": [{"body": "Tesla will still have its fanboy base just like Apple.\n\nThere’s a vast majority that will only exclusively buy/drive Tesla because of the name.", "score": -1, "replies": [{"body": "Yes they will. But the revenue Apple is able to create is far beyond what Tesla will be able to create. And at the end of the day revenue is what guides the big money towards a stock.", "score": 3, "replies": [{"body": "Have you heard about the autonomous taxi service? It'll probably be a few years, but that's gonna bring a ton of revenue.\nBasically you set your car to chauffeur mode while you're at work, the car goes off and makes money Uber style, then returns in time for you to go home from work. Meanwhile Tesla is taking a cut of that.", "score": 3, "replies": [{"body": "Yeah I have heard about it. There still is a long way to go. Have you taken into account how many new laws that must be in place for these cars to drive in an European or American city? There will come a time when it will happen but it will take time. And the point I’m trying to stress is that in the time it takes for EVs to get there, you will have 10+ already establish auto companies throwing billions of dollars into being the leader in EVs. Tesla had a head start, but everyone else is coming for them. And the price of the stock right now don’t reflect a realistic market cap.\n\nEdit: spelling", "score": 5, "replies": [{"body": "I feel you, your point is valid. But they don't just have a leg up in EV's, they have a leg up in autonomous vehicle, a big one.\n\nAutonomous vehicles are probably coming sooner than you think. There have been autonomous semis driving on highways for years now. I-10 in Texas is an experimental highway where autonomous heavy duty vehicles are allowed to operate. The laws will adapt quickly IMO, especially now that we're realizing and actively combating China's superiority in next gen tech.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "🙌💎🙌", "score": 0, "replies": []}, {"body": "I thought that was in the millions for a sec 😆", "score": -3, "replies": [{"body": "I mean $1.2 million is in the millions lol.", "score": 12, "replies": [{"body": "Wait What! It is in the millions. SHIT! GG 👍", "score": 3, "replies": []}]}]}, {"body": "GG", "score": 0, "replies": []}, {"body": "Lucid > tesla", "score": -1, "replies": [{"body": "Thats some next level delusion", "score": 3, "replies": []}, {"body": "Alex, is that you? Unblock me on Twitter you bitch", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Anyone on this planet think Tesla deserves a P/E of 20? I mean WalMart has a P/E of 32. If anyone deserves a high growth multiple it’s Tesla.", "score": 2, "replies": []}]}, {"body": "Bad news. Major investor just sold off Tesla shares. Gonna tank monday\n\nJerome Guillen\n\nEdit: why are you downvoting me? I'm right", "score": -5, "replies": [{"body": "Yeah, but I doubt it'll go down enough for this guy to see red.", "score": 4, "replies": []}]}, {"body": "Impressive", "score": 1, "replies": []}, {"body": "Can I borrow $5?", "score": 1, "replies": [{"body": "👀 I want 20,000 usd then I swear I won’t bother you anymore", "score": 1, "replies": []}]}, {"body": "You are a f**king legend", "score": 1, "replies": []}, {"body": "Semper Fi", "score": 1, "replies": []}]}
{"title": "Why nothing has changed with $CLNE and I’m still bullish", "selftext": "I saw a few people freaking out about CLNE after Friday didn’t work out. The gamma squeeze was not the main play with CLNE and while hitting it would’ve been cool, it is literally no big deal that it didn’t hit it Friday.\n\nHere’s the quick down and dirty on why I’m still bullish on CLNE:\n\n1. PRICE TARGETS: CLNE has price targets ranging from $12 all the way up to $30. The majority are averaging around the high teens to early twenties. Which means CLNE is still undervalued by half purely on the worth of the company (no squeezes, no pump plays, just value baby).\n\n2. AMAZON CONTRACT: This has been talked about to death, but Amazon has contracted to buy a massive amount of fuel from CLNE. Their current contract states that they will pay a minimum of $13 and some change for their shares. And before you think they’ll just immediately buy all their shares and dump them, they can only have 5% of the company at the time. So it is heavily in their best interest to get the stock as high as they can to profit on all their shares.\n\n3. NEW CONTRACTS IN THE PIPE: Everyone already knows about the current UPS contract, but there is rumors about an expanded contract coming down the pipe. UPS might be expanding its RNG capacities. Pure speculation, but if true, it will gas TF out of CLNE when announced.\n\n4. OPEN INTEREST OPTIONS: There is an enormous amount of calls open for July. Like 10,000 for each of the closest of strikes. I don’t get much into squeeze chatting but clearly people are bullish in general.\n\n5. COMPANY IS STILL BUILDING AND LOOKING FORWARD: Naysayers will always say “well why does CLNE break even on all of their financials”. It is because CLNE reinvests back into their business and increases their lead in the RNG space by leaps and bounds every quarter. RNG is the best solution right now for green trucking right now. EV can’t do it without a complete overhaul, meanwhile you can buy a kit and convert your current rig into RNG without spending a fortune.\n\nSo all in all, if Friday somehow scared you, it shouldn’t. All the DD is still the same and nothing has changed.\n\nPositions: 500 shares and a bunch of option contracts.", "id": "o56lpp", "created_utc": 1624312371.0, "score": 353, "upvote_ratio": 0.83, "num_comments": 68, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|6 months ago\n**Total Comments**|3267|**Previous DD**|\n**Account Age**|4 years ago|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "CLNE is also a long play, so there's that generally.", "score": 92, "replies": []}, {"body": "Im in with CLNE. My largest stock holding.", "score": 79, "replies": [{"body": "Me too bro!", "score": 27, "replies": []}]}, {"body": "I have $70 sitting in my account right now that needs to go somewhere...might as well up my $CLNE at open bell since I am not sure where else to put it.  Thought about more $TELL to average down a bit.", "score": 30, "replies": [{"body": "why not buy other meme stocks with more momentum?", "score": -20, "replies": [{"body": "Honestly not sure where to put it...the meme stocks overfloweth right now, so I think I might focus on the long term plays in energy since there is definitely going to be a shift in that sector.  Whatever I choose guarantee a -35% drop. ![gif](emote|free_emotes_pack|downvote)", "score": 10, "replies": [{"body": "in that case please choose PLTR", "score": -4, "replies": [{"body": "Done at opening. Prepare to gobble up a dip shortly after.", "score": 1, "replies": [{"body": "PLTR might be steadily climbing back to the $30s. We'll see if your theory holds water haha.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "I love CLNE🐄💨💨", "score": 33, "replies": []}, {"body": "I will be accumulating shares throughout the summer, adding to my 1,500.\n\nI like the stonk", "score": 20, "replies": []}, {"body": "If there was an insider trade would it be reported today? The activity today was really weird with a  wall of 250k shares at $11.10 and it was cleared out instantly when CLNE hit $11.09 … I just have a hard time believing a single person moved over $3 million in shares.\n\nSeems like abnormal activity to me but maybe I’ve just never seen the whales at play before.", "score": 17, "replies": [{"body": "It probably wasn't a single person but a fund buying shares for multiple people at the same time. From my Understanding this happens regularly.", "score": 6, "replies": [{"body": "The timing of it seems so weird though, I understand that 250k shares isn’t that large compared to the total amount of shares in the market but it’s a large sump to be set at one price and then instantly get bought out. I keep thinking there’s more behind it but Im probably just overthinking the situation.", "score": 3, "replies": []}]}, {"body": "What app do u use to view sell walls?", "score": 2, "replies": [{"body": "Robinhood order book, I was watching it for a bit after doubling down during the dip and once I noticed the sell volume for $11.10 my eyes were glued to the screen. I wanted to see if we’d even make a dent and seconds later 300k shares were bought.", "score": 3, "replies": []}]}]}, {"body": "There still are a lot of calls for 7/16 isn't there?  No reason at all this stock can't hit the mid twenties. \n\nI'm in!", "score": 33, "replies": [{"body": "12,000 on the twelve and thirteen each and a bunch more going up", "score": 15, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Idk why you’re getting downvoted. People around here act like an option coming in the money is the craziest thing to ever happen and a stock will moon because of it.", "score": 4, "replies": []}]}]}]}, {"body": "I added 200 shares at the end of the day.  I felt like the chart movement at the end of day was strong.  It deviated from GME, AMC, etc. movements. I like that.", "score": 33, "replies": [{"body": "Yes. This is what I have been noticing too. The volume in CLNE and WISH has been sustained. Idk why, but follow the money right?", "score": 17, "replies": []}]}, {"body": "Currently long 1000 shares on CLNE. Like this stock for the long play.", "score": 43, "replies": []}, {"body": "Putting another $1000 in today ! BUY THE DIP🚀🚀🚀", "score": 15, "replies": []}, {"body": "Got 7/16 for $15 a share. Probably gonna whiff but I believe.", "score": 16, "replies": [{"body": "This could actually work out, ngl.", "score": 7, "replies": []}]}, {"body": "I’m staying no matter what", "score": 14, "replies": []}, {"body": "Clne is gonna be a long hold 💎🙌", "score": 14, "replies": [{"body": "More time for poor apes like me to buy a a decent position over time.", "score": 4, "replies": []}]}, {"body": "I added to my position in CLNE today. Expecting a big rebound tomorrow", "score": 23, "replies": []}, {"body": "Locked and loaded in CLNE for the long haul. Easy to sleep at night knowing you got in on the ground floor of a rapidly growing company!!!!", "score": 24, "replies": []}, {"body": "🐄", "score": 13, "replies": []}, {"body": "Look at every major city bus (it’s subtle but a lot of them say powered by clean energy / RNG) \n\nIt’s just starting the devil is in the details", "score": 10, "replies": []}, {"body": "In big, about 20% of my $1.2M portfolio.", "score": 10, "replies": [{"body": "Fuck yeah my dude. I’m all in on my degen portfolio rn, it’s quite the ride", "score": 7, "replies": [{"body": "Just going to take a nudge on a slow day for it to fly. It has been rock solid high $10, low $11.\n\nMr Clean will take us to the promise land.", "score": 1, "replies": []}]}]}, {"body": "Gonna load up more later tonight, I like the stock", "score": 11, "replies": []}, {"body": "They will come back to CLNE, After panic sell on Wish tomorrow. Be patient and wait", "score": 50, "replies": [{"body": "WISH is getting traction; there won't be a sell of tomorrow !", "score": -9, "replies": [{"body": "Seems like a pretty clear cut pump and dump to me", "score": 7, "replies": [{"body": "Pump and dump with an $18 price target.", "score": 3, "replies": [{"body": "Could be, who am I to say!", "score": 1, "replies": [{"body": "Nobody. Doesn’t even make sense.", "score": 1, "replies": [{"body": "It's price target being $18 does not mean it is not a pump and dump.", "score": 3, "replies": []}]}]}]}, {"body": "I actually got in pretty early just sold off too early at 13.50 😑", "score": 2, "replies": []}, {"body": "Disregarding the hype, how about the valuation by the major financial institution analysts suggesting that it is undervalued?", "score": 2, "replies": []}]}, {"body": "In stock market, the future is uncertain. Sell off or no sell off is just a forecast...", "score": 2, "replies": [{"body": "True", "score": 1, "replies": []}]}]}]}, {"body": "I just loaded up with my 93 shares 🥺", "score": 8, "replies": []}, {"body": "I like CLNE, Amazon and ups deals make this stock a no brainer for me. 90 @11.49", "score": 3, "replies": []}, {"body": "Let's improve the world hand in hand with CLNE!", "score": 2, "replies": []}, {"body": "Clne🚀", "score": 2, "replies": []}]}
