{"title": "SoFi : the Amazon of Fintech. Owns Galileo $MQ Competition", "selftext": "https://investors.sofi.com/overview/default.aspx\nLink is for Current investors and interested Investors\n\nSoFi Is Pushing the envelope in the Banking Sector With last year 1.2 billion dollar Acquisition of Galileo and this year purchase Of A California Bank to expedite their Bank Charter. This means lower rates on All their Loans Soon.\nGalileo handles 70 of the Top 100 online Banking Company technology Including Chime, Dave, MoneyLion, Vavo,Current, Revolut, tomocredit and Most Recently RH and Verizon's Kid Debit Card announced Friday After Hours. This is important because this is directly Marqeta's or $MQs competition. They have Square but they account for 60%of their Revenue. Contract expires soon 🤙 SQ has Connections to Derek wolf, Galileo's New CEO. Could be interesting. MQ is going for $29 Bucks rite now And this is all they do Sofi is trading at $23 and offers A plethora of Services A list including Student loans, in school loans, Personal loans,Auto loans, Mortgages, Debit card that pays 2days early (chime tech/Galileo) Credit card 2%cash back that can be traded in for Crpto or back back loans with, Free Will Provided by Ladder, Crpto Purchases, Stock Purchases, Rewards program , IRAs, Educational Classes you can Sign up for And much more!!!For $23 I'd say I'm adding to my position Monday", "id": "o3qfcu", "created_utc": 1624138515.0, "score": 103, "upvote_ratio": 0.74, "num_comments": 84, "comments": [{"body": "I like SOFI because I am getting paid 37% interest on my loaned shares. If I am able to sell any of my portfolio at a profit in the current down market, the money will be used to buy more SOFI.", "score": 39, "replies": [{"body": "Usually brokerages take a massive cut of the loaned interest. What’s your cut? I’m thinking of doing something similar and looking to get the best rates", "score": 11, "replies": [{"body": "At Fidelity it's 50/50 between Fidelity and you.  I also lend out my shares and I get the same rate.  If you check the borrow rates on Sofi; they are \\~70-80%.", "score": 9, "replies": [{"body": "How can I do this? I'm on fidelity and sofi", "score": 1, "replies": [{"body": "Call and ask.  I received an email to join the program.", "score": 1, "replies": [{"body": "Sounds good, it'd be called a loan sharing program?", "score": 1, "replies": [{"body": "https://www.fidelity.com/trading/fully-paid-lending", "score": 3, "replies": [{"body": "Ah, I appreciate the follow up. I'm not fortunate enough yet to have the 250k requirement. Next goal for sure.", "score": 3, "replies": [{"body": "No worries, just keep it up and keep going forward and you’ll get there.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "If you see a short squeeze starting to happen you can call and take them off loan or enter a GTC sell order at a really high limit price ($100+).  That puts more pressure on the squeeze but you enjoy the interest payments in the mean time!", "score": 1, "replies": []}]}, {"body": "I believe that is his cut. Rates vary from day to day.", "score": 3, "replies": [{"body": "I was looking for a cut percentage, for example IBKR does 50% of the loaned amount goes to you", "score": 1, "replies": []}]}]}, {"body": "37%, are these are meme stocks?", "score": 15, "replies": []}, {"body": "I’m loaning out 1566 shares that get paid on the 15th from webull and have no idea how much that will make me, but I’ll be sure to post it.  I have a feeling the rates will drop with the short interest soon.  You literally can’t stop this stock!!!!", "score": 3, "replies": [{"body": "I think there’s probably 2-3 weeks left of high interest. I imagine once the lockup period end and some of the PIPE investors can sell, there won’t be as many shorts.", "score": 4, "replies": [{"body": "Agreed.  I think July will end the crazy amount of shorts.", "score": 1, "replies": []}, {"body": "Pardon my ignorance, but what are PIPE investors?", "score": 1, "replies": [{"body": "Private individuals that own a lot of shares in a company at below market rate when they bought in. It's a tactic used to raise funds quicker. SoFi was a SPAC so in the early days, when the price was $10, a PIPE investor may have gotten in at 8.\n\nTypically they also have a lockup period, meaning they are blocked from selling for a period of time. Once the lockup expires though, it's a free for all, so expect a lot of this PIPE investors to sell and walk away, taking the price down in the process.", "score": 3, "replies": []}]}]}]}, {"body": "Man I wish I had more so I could even get offered that lol", "score": 1, "replies": []}, {"body": "How are you getting paid 37% on loaned shares?", "score": 1, "replies": []}]}, {"body": "I believe in SoFi, but comparing share price? Really dumb to do, stopped reading after that", "score": 63, "replies": [{"body": "Just say your Holding MQ bro Don't be a Jerk about it 🤣😂🤣🤙", "score": -78, "replies": [{"body": "I think you’re missing his point. Comparing stock prices for companies with a vastly different number of shares outstanding makes zero sense. All that matters is market cap.", "score": 45, "replies": [{"body": "New age investors who think valuation is voodoo.  They will eventually become bitter old people when Mr market jacks their net worth", "score": 19, "replies": []}, {"body": "OP didn't put a single period in his entire post. Can't believe this post is upvoted like it's useful DD lol\n\nWeird capitalization makes me think this is a bot or someone just trynna pump up the bags they're holding", "score": 10, "replies": [{"body": "I'm thinking [some sort of SoFi marketing team larping as a WSB ape?](\nhttps://www.reddit.com/r/wallstreetbets/comments/nt85av/_/h0qm7kn)", "score": 1, "replies": []}]}]}]}]}, {"body": "SOFI IS THE FUTURE OF FINTECH🚀🔥", "score": 15, "replies": []}, {"body": "MQ is at 16b market cap. Sofi is at 18.3b.\n\nSoFi has lockup expiry end of June.\nI'm keeping my position but planning to add if lockup beats it up.", "score": 26, "replies": [{"body": "Where do you find the information about lockup expiry?", "score": 5, "replies": []}, {"body": "So July puts for beat down blast off?", "score": 2, "replies": []}, {"body": "I try not to get tied up in Market Cap just cause I don't look at that as an indicator for future growth like I said they MQ might not even keep their whale Square . Only time will tell but if I had to pick MQ or SoFi To build a Position now looking forward 5 yrs I'm taking SoFi All day Monday Don't get me wrong I bought MQ @ 29 Sold at 31 After that found out All they do is what Galileo does 🤷", "score": -24, "replies": [{"body": "> I try not to get tied up in Market Cap \n\nThat's nice to ignore one of the most important factors in determining how well a company is currently valued.", "score": 12, "replies": []}, {"body": "Do you understand why you’re getting downvoted? The number one most important thing when comparing companies’ valuations is MARKET CAP.", "score": 15, "replies": [{"body": "Why tho if Apple is A trillion dollar company and is $132 and Upstart is $130 and worth 12 billion.  New to this and from what I've read around so far Is that market cap has been Off lately due to Volatility. I'm speaking about today's Market and how it fluctuates is ridiculous look at orph. You mean to say I shoulda bought in when their market cap was Being inflated then stuck HOLDin the bag cause their market cap was good at one point ? I'm good I could care less about down votes . MARKET CAPS DON'T MEAN 💩 TO ME SO WHAT . go invest in NOKIA then since their market cap is more than MQ and SoFi combined . Does that make NOK a better investment No . So WTH you guys talking about, break it down for me if Im missing something 🤙", "score": -13, "replies": [{"body": "I can’t believe this is a real comment. This is the most ridiculous salad of word trash I’ve seen on this sub. \n\nBased on your own logic, you think Upstart is a comparable investment to Apple because they have the same share price?", "score": 13, "replies": [{"body": "God my eyes and brain hurt reading that.", "score": 8, "replies": [{"body": "Somebody might as well tell OP that once a stock hits $1,000 you get a membership to the platinum elite level shareholder club where you get a seat as a board member. And make sure to let them know that negative P/E businesses means that the company PAYS you cash to own their stocks. A financial statement must be witchcraft to you.  \n\n\nOP I hate to burst your investment thesis but JP Morgan Chase's (NYSE:JPM) share price is $148. So $148 > $23. Thus JPM > SoFi. So much for the fintech explosion going brrr", "score": 4, "replies": [{"body": " JP morgan being at 148 is an indicator that SoFi is superduperundervalued. I mean, that means that theres like 6.5x upside! /s", "score": 2, "replies": []}]}]}]}, {"body": "You should invest in companies whose market cap is below your target valuation.\n\nComparing the share prices of companies is meaningless. Say for example, Upstart does a 2:1 split. The company is still valued at 12 billion but the shares are now worth $65. Does it still make sense to compare to AAPL share price?\n\nPlease do some more research before peddling advice.", "score": 10, "replies": []}, {"body": "You need to learn about the Dunning Kruger effect. \n\nBut to answer what you’re missing,\na companies “price” is not their share price. A companies “price” is their total value (market cap). And you absolutely need to know what actual price you are getting. And the share price alone does NOT tell you this.\n\nFor example,\n$WMT share price is $135. Which means they have a total market cap of $378 billion. But this is a CHEAP stock. B/c you are getting a company that did $528 billion in revenue for $378 billion.\n\nWhereas, $PLTR is only $25. Which means their market cap is $40 billion. But this is an incredibly EXPENSIVE stock. Because you are buying a company worth 40 billion that only did *1* billion in revenue in 2020.\n\nNow cheap vs expensive alone does not tell you if it is a good or bad investment (I own both btw). But an investor needs to know WHY a company is “cheap” or “expensive”. Pretending the market cap doesn’t matter is literally nonsensical.", "score": 1, "replies": []}]}]}, {"body": "Sofi is my biggest semi speculative position for a 20 bagger haha", "score": 13, "replies": [{"body": "It's a steal really SPaC Noise over with now it's Go time.", "score": 1, "replies": []}]}, {"body": "You seem to have a fundamental misunderstanding how share prices works. The fact that you are trading stocks with such flawed logic is troubling.", "score": 4, "replies": []}]}, {"body": "MQ has got very low revenue!!!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "That's what I said 😏 but fr though it's the business model I stated that is undervalued lol just wait n see 🙈", "score": -33, "replies": [{"body": "Don't look at share price because there could be a different number of shares. Look at market cap", "score": 10, "replies": []}]}]}, {"body": "SOFI, SQ, & PYPL are the future.  Legacy banks are in trouble over next decade; many may not survive.  They will certainly have to evolve or will struggle.  Jamie Dimon knows this too.", "score": 11, "replies": [{"body": "I'm very bullish on SoFi. I think $30 by EOY, and within a couple of years will be well over $50.", "score": 6, "replies": []}, {"body": "I think some banks have begun to adapt like $GS with Marcus. Longer term, I just think that legacy banks will just acquire fintech companies and neo banks.", "score": 3, "replies": []}]}, {"body": "https://ofdollarsanddata.com/no-millennials-arent-poorer-than-previous-generations/\n\nThis is a pretty solid post and one of the reasons I'm so bullish on fintech companies.\n\nMillennials do have money, and wealth, and one could argue Gen z, who is behind them, has been the first generation to get introduced this heavily into investing, this young. Regardless of how this happened or what they're doing now, investing early means learning early. And that'll pay off in the long run.\n\nSo despite the pessimism that engulfs social media, when it comes to Millennials/Gen z and money. Look where they put it.\n\nBecause even if they don't have a lot now, banks are sticky as fuck, and what they do with it now is likely what they will do with it when they are 60 and actually have wealth.\n\nSo I'm not looking at BAC and JPM, their boomer banks. All the boomers have their money there, because they've had their money there since they were kids, and two things scare boomers. Change and buttons.\n\nBut Millennials/Gen Z are putting their money into companies like Sofi, not BAC and not Wells Fargo. That is the choice they are making now, and that is super bullish for companies like these over the next 40 years. \n\nIt starts with a checking account, maybe a savings, maybe a peer to peer transfer. \n\nThen they are getting car loans, home loans, and have IRA's and millions of dollars of networth tied to them. \n\nOnce you're in a bank, it has to really REALLY fuck up to lose you. Looking at you Wells Fargo...", "score": 33, "replies": [{"body": "Chase fucked me  over before Still use em but slowly transitioning away", "score": 15, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Nice Good luck I'm adding more Monday", "score": 4, "replies": []}]}, {"body": "I love their platform and I agree they are on the cutting edge of banking,I’m goin in next red day🦍", "score": 11, "replies": [{"body": "Me too I just used their money card to get half my check on Wednesdays it was pretty cool to have half my check early lol", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Agree. SoFi looks like an aggregator of services. For example their insurance offerings is through a 3rd party. Lots of these exist (eg. Credit Karma, Credit Sesame, etc). These modern banks also spread funds among multiple banks. For example SoFi claims 1.5m FDIC insurance which is likely due to spreading among a few banks other than Galileo.\n\nI wish Stripe was publicly traded, I'd buy loads of it", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Robinhood will also be a Galileo customer once they finish their Checking Account set up. as always time will till notbrokemex", "score": 1, "replies": []}]}]}, {"body": "Who is this Evolve? Never heard of them and google isn’t helping.", "score": 2, "replies": [{"body": "Dam I won't even waste my time now 🤣🤣😂", "score": -1, "replies": []}]}, {"body": "If you read I said MQ is competitor of Galileo which is like Saying the Joker is Robins Enemy too (SoFi being Batman) And I haven't even Heard of Evolve I'll look into em but stripe is ok just doesn't offer everything sofi does", "score": 1, "replies": []}]}, {"body": "I've seen a lot of shilling around the stock but it seems  bearish to me  \n\\- has lockup expire end of june\n\n\\- open options and institutional price targets are pretty bearish into the fall - highest is $30\n\n\\- has consistently rejected the $25 level, strong resistance there for some reasons  \n\n\nI would wait until july to seriously consider this stock, it's hovering in the low 20s and will probably crab there until a catalyst sends it higher.", "score": 6, "replies": [{"body": "The some reason is the SI they are having a hard time even finding shares to borrow . They are shorting this like crazy for some reason", "score": 4, "replies": [{"body": "They shorting it same reason they short anything else. Somebody with lotsa money doesn’t want any company to be successful that could affect their money flow/corruption. If a company is solid or working towards change, rich greedy boomers will attack it as always", "score": 3, "replies": []}]}]}, {"body": "I love the New stadium so when I started investing last year  I wanted SoFi and it wasn't there!!! So I've been patiently waiting for the Ticker change and now building my position AVG ing up from 15", "score": 2, "replies": []}, {"body": "And to those Worried About the pipe selloff. Buy Low Sell High right?. Isn't this the entry point you want ? I'm in @$17 avg so I'm good with a lil sale I'm holding. Buy when Everyone's Selling. Sell when Everyone's buying. At work on Father's day getting OT just to buy more", "score": 4, "replies": []}, {"body": "Yea yea whatever I'm learning . from Assholes is the best way, No sugar coating glad I posted this. So much Constructive criticism , I get that outstanding shares effect MC  and if they have more shares outstanding cheaper price and vice versa blah blah blah . Thanks for the lesson guys still won't use it to Pick stocks I wanna trade.", "score": 1, "replies": [{"body": "So how's SOFI doing for ya right now.", "score": 1, "replies": []}]}, {"body": "Motley Fool ruined \"the Amazon of...\", Now I cannot take anything that says that seriously anymore", "score": 1, "replies": [{"body": "Dammit", "score": 1, "replies": []}]}, {"body": "People getting caught up in the market cap My Bad Didn't know it was that important to some but still never said I was a financial advisor just A guy trying to make his Own Way. Next I would like to point out that everyone is different and not everyone trades the same. I look at growth stocks a lil different than just MC I look at intangibles because I'm holding for years Sofi and Tilray. I use my instincts just started trading last year so still learning but I will continue to look at intangibles And follow my Gut to the 80% gains I've accumulated since starting with 3k. Happy Father's Day Everyone thanks for the Comments and Constructive criticism. 🤙Good luck to all.", "score": -2, "replies": [{"body": "But do you understand why market cap is more important than share price?", "score": 7, "replies": [{"body": "Yea cause of outstanding shares the MC can be Diff I get it. I just don't apply to growth stocks Is All . How can I apply that to 5 yrs from now? They dilute, add, split by then who knows . I feel like people just like to be right and have everyone do it their way or it's wrong is such a boomer mentality. I'm up 80%on my portfolios and no worried that I don't stress over MC . I feel like we're more worried about my way of trading instead of what I'm trading. SoFis a winner therefore I win .🥳🥳", "score": 2, "replies": [{"body": "You don't seem to know what you are talking about at all. With this mentality you are going to end up getting burned real bad at some point. Just educate yourself in basic principles of the market. Trust me when I say that will benefit you over the long term.", "score": 8, "replies": [{"body": "Thanks for being cool about it . Oh yea those basic principles how could I forget .Cause those basic principles are really in Full Effect this past year right. The market manipulation isn't effecting stocks at all with short squeeze this and short squeeze that who knows what anymore. I like Sofi  I'm all in So i won't get burned unless SoFi and Tilray go outta business in the next 5 yrs . I don't day trade or swing trade so have fun looking at graphs all day I have 3 kids and a wife no time for math just work play screw shower repeat.", "score": 1, "replies": [{"body": "I'm not saying anything about staring at graphs all day. Clearly you aren't willing to learn so for all I care stay blissfully ignorant. This forum might just not be for you then. There's really no point in discussing anything related to the valuation of a business if you don't even understand the difference between share price and market cap. I wish u good luck in your trades but don't be suprised if you get burned investing in something you don't even understand completely.", "score": 5, "replies": [{"body": "Thanks GL too", "score": 0, "replies": []}]}, {"body": "You are painfully stupid.", "score": 2, "replies": []}]}]}]}, {"body": "Obviously not.", "score": 0, "replies": []}]}]}, {"body": "So I am a IT guy and geniunely trying to understand what fintech actually means. Can someone explain it to me? Again I have a deep IT background so feel free to use any tech terms. But whats the difference between these banks and \"old\" banks?", "score": 1, "replies": [{"body": "It’s not a traditional bank. It uses technology to attract and engage users and link them up silently with partner banks. SoFi provides the ui and assistance and the partner provides the funds.", "score": 1, "replies": [{"body": "Thanks and I know you tried, but that didnt help... I really dont understand how that is different than any other bank. When you say it \"uses tech,\" what does that even mean? And how is connecting to partners helpful?", "score": 1, "replies": []}]}]}, {"body": "Comparing share prices discredits this entire post.\n\nAnd if you think SQ will leave MQ because of a “connection”, you don’t understand business.\n\nI hold SOFI and MQ, foolish post.", "score": 1, "replies": []}]}
{"title": "What happens in the event a major cyber-attack hits the financial markets and causes a prolonged halt?", "selftext": "**Disclaimer:** If you scare easily just dip. This isn't meant to be FUD shit. This is meant to be someone in this shit trying to get an answer from others that may know the situation better than myself. I posted this at another place full of |experts| and got ran out of town for 'trying to strike fear into the market.' As if there isn't 8000 other things going on that is accomplishing that just fine. **/disclaimer**\n\nLet's start with the SIPC's statement on hacks and how they affect what they insure: https://i.imgur.com/hKGC2Pg.png\n\nIf I'm reading that correctly, they don't? I've reached out for clarification in the event of a wide-spread hack/cyberattack but haven't heard back at the time of this post.\n\nSo.. with cyberattacks being a hot topic lately in the news I was thinking after close today; hypothetically, what if next week the market was halted? Say for an entire week. What would happen on the following Monday at market open?\n\nWould all derivatives that expired during the halt be worthless? Would the ensuing panic possibly get some very shady financial institutions out of some *very* big holes?\n\nWhat if brokerage's records become corrupted? Would Cede have the paper/digital records of who owned what and reimburse lost shares? Lost options? What happens to ITM strikes? \n\nThe World Economic Forum is holding their annual exercise to address and implement some actions in the event of such attacks on July 9th. It's called \"Cyber Polygon.\" Maybe someone more familiar with their event knows how well protected our securities are?\n\nhttps://www.weforum.org/projects/cyber-polygon\n\nIt's a huge what-if scenario that I'm sure is practiced against daily.. but it is a big damn \"what if?\"\n\nI'll list some articles below that caught my eye with regards to such a thing happening. If pipelines can be halted, and meat production facilities can be halted, and other country's exchanges can be halted in the name of \"cyber attacks,\" where do we stand as retail investors on the NYSE?\n\nHopefully WSB has some expertise in the matter.\n\nhttps://www.bloomberg.com/news/articles/2021-02-04/how-a-dated-cyber-attack-brought-a-stock-exchange-to-its-knees\n\nhttps://www.investopedia.com/news/are-your-stocks-danger-getting-hacked/\n\nhttps://www.forbes.com/sites/forbestechcouncil/2021/04/14/could-the-next-stock-market-crash-be-potentially-caused-by-a-cyberattack/", "id": "o36gwp", "created_utc": 1624070955.0, "score": 16, "upvote_ratio": 0.62, "num_comments": 70, "comments": [{"body": "This is why I have money buried in coffee cans behind my house.", "score": 32, "replies": [{"body": "Safe place lol \n\n\nAt least safer than my money was in stocks this week.", "score": 14, "replies": [{"body": "Hi i am the prince from nigeria and would like to buy your house. Mail me your address.", "score": 17, "replies": [{"body": "Apparently we’re related. I’m waiting on a very large some of money from one of our mutual relatives. It takes time to process all the paperwork though.", "score": 7, "replies": []}, {"body": "blackrock opened up shop in nigeria now? fucking ay", "score": 5, "replies": [{"body": "I'm pretty sure they just outright bought Nigeria", "score": 3, "replies": []}]}]}]}, {"body": "Calls on shovels around this guy’s house.", "score": 5, "replies": []}, {"body": "I wouldn’t use metal containers just saying, easy to find. Use plastic or ceramic or whatever", "score": 3, "replies": [{"body": "And don't bury USD. That shit will lose value everyday.\n\nBury uranium instead.", "score": 2, "replies": [{"body": "*The feds have entered the chat*\n\nNo, no not the reserve, the other ones", "score": 2, "replies": []}]}]}, {"body": "I have some interesting literature you might want to read.  Send me your address and I’ll get it right to you", "score": 3, "replies": []}, {"body": "I like to use Igloo chests.", "score": 2, "replies": [{"body": "Dip it in resin to make it water proof", "score": 2, "replies": []}]}, {"body": "Where do u live?", "score": 2, "replies": []}, {"body": "Puts on your coffee cans after telling a bunch of degenerates where to look for them... completely unrelated but can I borrow your shovel? I know you have one...", "score": 2, "replies": []}, {"body": "Shit, I’ve been buying keurig.", "score": 2, "replies": []}]}, {"body": "Sounds super bullish for cyber security stocks, I'm in.", "score": 14, "replies": [{"body": "Ar9 is the go there imo. Just signed a contract with NATO", "score": 1, "replies": []}]}, {"body": "So... any company that cares about its data will have a business continuity plan. Since most of the financial business is based on ones and zeroes getting transferred around, let's assume they have a good one. That includes disaster recovery, which is hot sites, warm sites, and cold sites, where backups are stored and can roll back any data corruption or malware that may have taken place. When they're well prepared, these places are geographically separated and the cold sites are disconnected from any network. They're hardened against bombs and physical intrusion. They might lose recent data in the process of restoring it, but there's a lot of other mitigations that prevent a total loss of availability, such as having failover routes in case of network outages, multiple redundant servers that are geographically and virtually separated, creating accounts with the principal of least privilege and delegation of duties to remove the possibility that a single compromised account can do as much damage.\n\n\nBasically, if they have a good cybersecurity policy in place and pay those people well, any attack that will cause the kind of damage you're talking about would require multiple acts of war to accomplish. They lose more money (by the minute) by not having these protections if an attack would happen (because they make money by keeping the market open) than they would save by cutting corners. Class action lawsuits aside, the bigger players would each sue, individually,  for billions if they didn't have the necessary precautions in place and lost them big bucks.  One of the assurances you have about security in the stock market is that a lot of the unthinkably rich motherfuckers all have guns to each others' heads. No one group is going to strongarm the market into taking a dive for them because another would pull the trigger without hesitation once it seems like they're gonna get caught up in it. Mutually assured financial destruction.", "score": 15, "replies": [{"body": "This answer is the most comforting so far and I appreciate your explanation", "score": 8, "replies": []}, {"body": "Does AMC have a business continuity plan besides raising more capital every couple of months?", "score": 4, "replies": [{"body": "Fuck if I know lol.", "score": 3, "replies": []}]}]}, {"body": "I agree with another comment. A cyber attack on the stock market is an act of war and literally countries would be ruined and completely leveled. People would die. Hundreds of thousands. Probably would start WWIII", "score": 20, "replies": [{"body": "I actually didn't think of the ramifications it would have from a war perspective. If anything it would be another invisible enemy probably, but that's an interesting take. First and foremost though, wtf happens to my acct?", "score": 7, "replies": [{"body": "It would probably be a false flag to save wallstreet without the discontent that would follow even more bailouts.", "score": 10, "replies": [{"body": "Good point and I could completely see that nonsense happening to “save the world”.", "score": 3, "replies": []}]}, {"body": "Who knows. My opinion, it would be worthless and you wouldn’t care anyways bc your main goal would be to stay alive along with taking care of your family. \n\nLiterally a cyber attack (large and successful) on the stock market that stalled the market for a week? Holy shit. I can’t even imagine the fallout.", "score": 0, "replies": []}]}]}, {"body": "facts bro", "score": 6, "replies": []}, {"body": "When I started shredding important docs 10 years ago…people gave me truckloads of shit…I kept doing it anyway.\n\nI haven’t activated any paperless options on important accounts…and, people have given me shit for this too.\n\nI keep 10 years of paper records for all important accounts…brokerage too…good for taxes if I ever get audited…and good cyberattack insurance.\n\nNo company is safe from a cyberattack because:\n- Most companies don’t invest enough in cyber defense.\n- Human error usually gives the attackers access. \n\nPaper…cyberattack insurance.", "score": 3, "replies": [{"body": "I'll be standing there begging to SEC to let me play by showing them grainy screenshots off my wife's boyfriend's phone while you stroll up with the books laminated, indexed, and ready to go", "score": 5, "replies": [{"body": "I’ll KO your wife’s boyfriend…with a 10lb stack of paper…and your wife will gladly return to you.\n\nPaper…KO a boyfriend.", "score": 5, "replies": []}]}, {"body": "This is the way. Human error accounts for 98% of all security breaches, no matter how much is invested in cybersecurity.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "He’d be fucking you instead of your wife", "score": 7, "replies": []}]}, {"body": "The Markets were shut Tuesday through Monday after the 9/11 attacks.  In the first open week, markets were down about 15%.   It this all happened during the much larger dot-com bust downturn.  Markets bottomed in late 2002 and took a long time to get back to previous highs.", "score": 3, "replies": []}, {"body": "Then you buy PLTR calls, duh.", "score": 3, "replies": []}, {"body": "You’ll lose all your money which was going to happen anyway", "score": 3, "replies": []}, {"body": "Do I have to be the one to say it. its called Block chain technology, If technology system can reach its full potential, then anything in it can not be hacked.  This is years ahead and more research is needed.", "score": 5, "replies": [{"body": "I thought there have been a number of hacks, some of which have triggered hard forks in the tech?", "score": 1, "replies": [{"body": "Block chains can be hack but with the right group of miners and leadership. The hackers wont stand a chance but only time and resources can tell the true story.", "score": 1, "replies": []}]}]}, {"body": "$BB could prevent such an even from occurring. But for some odd reason nobody acknowledges what BlackBerry has proven it can do. Ask Dark Side hackers", "score": 6, "replies": [{"body": "No single company can prevent a focused state-sponsored attack against much of anything. Redundancies and best practices do the bulk of that.", "score": 2, "replies": []}]}, {"body": "Bb calls 🚀🚀", "score": 2, "replies": []}, {"body": "the first rule of fight club is you don't talk about fight club, retard.", "score": 2, "replies": []}, {"body": "Market closed for several days due to Sept 11.  Don't remember how many as i was getting drunk and most of that time is a blur.  \n\nFinding out what happened to option holders expiring during those days might be a good start.", "score": 2, "replies": []}, {"body": "They would just reboot into new servers and the Fed people would type $5000000000000 into the box that says \"Deposit Amount\" to get them up and running again.  These are all digital accounts that have no basis in reality.  The only reason the ransomware works against smaller companies is that they have no way of just resetting their accounts the way the Fed and Wall Street can.  A small company that gets all of it's infrastructure hacked has to actually come up with real money to pay the hackers off.  The Fed, and friends of the Fed, don't.", "score": 5, "replies": []}, {"body": "What happens? Absolute bedlam. \n\nAlso called : Frrreeeeeeeeeedoooooom.\n\nAnd death, lots of death.", "score": 2, "replies": [{"body": "Calls on guns, and lots and lots of ammo.", "score": 1, "replies": []}]}, {"body": "I hope uwmc moons.", "score": 2, "replies": []}, {"body": "Lol haven’t you watched Oceans 11? \n\nCasinos always get robbed.", "score": 2, "replies": []}, {"body": "*NDAQ moon*", "score": 1, "replies": []}, {"body": "I stopped reading after “Haven’t heard back at the time of this post” but I assume it only gets better", "score": 1, "replies": []}, {"body": "Go away 🌈🐻", "score": -6, "replies": []}, {"body": "I try not to worry about things that haven't happened, and I also try not to scare others with things that have not happened", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Holy shit. Calm down Chad Dickens.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "I prefer edibles with higher cbd/g as it prevents excessive paranoia", "score": 1, "replies": []}, {"body": "Do you know something about to happen we don't know?", "score": 1, "replies": []}, {"body": "Little known fact, a physical copy of every trade is kept on a type of microfiche in 3 different sites in the tri-state area.", "score": 1, "replies": []}]}
