{"title": "Is it likely that these protest, inflation, and the likelihood of this war between Russia/Ukraine is going to cause some crashes to happen?", "selftext": "I’ve saved some money in the past few years and I truly want to invest in some companies I believe will be doing good but I’m worried of being at absolute losses with these problems which is why I’m curious to see what other stock investors think.", "id": "srqdvf", "created_utc": 1644779617.0, "score": 2, "upvote_ratio": 0.52, "num_comments": 43, "comments": [{"body": "A reminder to everyone, please focus on how this is going to affect a specific stock or the stock market in general.\n\nIf your comment is pushing political agendas, memes, insults, trolling, etc then your comment is going to get removed and/or get you banned.\n\nIf you *have* to discuss just the politics, then post this topic to r/PoliticalDiscussion without linking back to r/stocks, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "When people are expecting a crash and the market is full of fear, the complete opposite normally happens", "score": 35, "replies": [{"body": "What a load of bullshit.\n\nAll crashes are unexpected and all booms are unexpected. If they were expected, they wouldn't be called crashes or booms.\n\nYour upvotes prove we are in WallStreetBets. Some people here are just spouting superstition and thinking they can wave their willy like a wand and all their claims will all sound very logical.", "score": 1, "replies": [{"body": "All booms are unexpected? We’ve been in a bull market the last 70 years", "score": 0, "replies": [{"body": "Not all upturns. All booms. A boom is an unexpected rapid upturn. The top-level commenter sees news coverage about unexpected upturns and assumes all upturns are unexpected", "score": 0, "replies": [{"body": "We will see buddy 👍", "score": 1, "replies": []}, {"body": "Any comment now buddy?", "score": 1, "replies": [{"body": "Not sure what you mean, sorry. Haven't been watching the market lately", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Russia is just going to take some outskirt town in Ukraine for some relevant influence.", "score": 7, "replies": []}, {"body": "based on your question， I can tell you are not well equipped with investing knowledge to navigate this market now.\nif you really want to invest, divide your money to 12 pieces and buy SPY with each portion every month.", "score": 33, "replies": [{"body": "This.", "score": 6, "replies": []}, {"body": "Ahh yup.", "score": 2, "replies": []}, {"body": "newbie here, why is it better to do this rather than buy all at once?", "score": 1, "replies": []}]}, {"body": "Any crash will be short-lived because economy is doing well and most earnings were great. Fundamentals are strong. Therefore buy the dip on your favourite stocks.", "score": 8, "replies": [{"body": "second this, personally i think we're still in for some volatility short term but going into spring/summer we will rally again", "score": 6, "replies": [{"body": "You'd be wrong. The biggest bubble in history is about to pop.  Market is going to 1000 and will not recover for about 30 years.", "score": -1, "replies": [{"body": "if i had a nickel for every time someone said this in the past decade, i'd have more money than if i bought the very bottom of the SPY and sold the very top", "score": 3, "replies": [{"body": "😆", "score": 1, "replies": []}]}]}]}, {"body": "Economy is not the Market", "score": 2, "replies": []}, {"body": "No. 90% crash starts tomorrow and will not recover to 4400 till 2060.", "score": 0, "replies": []}, {"body": "Sure, you’ll eventually make money buying the dip, but the idea that is guaranteed in less than a 10-year timeframe is pure recency bias.", "score": 1, "replies": []}]}, {"body": "I’m buying dips in the stocks I like. A little bit at a time.", "score": 2, "replies": [{"body": "Pton.", "score": -1, "replies": []}]}, {"body": "More likely to be a scapegoat than a cause.", "score": 2, "replies": []}, {"body": "You can buy in increments because no one can time the top or bottom maybe buy solid stuff once a week to average in", "score": 2, "replies": [{"body": "Thank you Ultimate!", "score": 2, "replies": []}]}, {"body": "Yes. Big players have been scrambling for the last crumbs of profit before it all ends. That explains the weird price movement and big after hours jumps.", "score": 2, "replies": []}, {"body": "Russia is not going to invade Ukraine, or not the way the west thinks, Russia is just going to annexe some Ukraine regions, Donbass will be annexed next week, 100% certainty, exercises are just so Ukraine can do nothing to avoid this.\n\nSo it's another strategic game of Putin, but the annexation will come at a cost, just as Transnistria, Krim and some other small regions that are occupied by Russia.\n\nIs a bit the tactic of Hitler, taking small parts, everytime a little more...if Putin gets greedy he risk a full scale war that's not his objective... \n\nAgainst China Russia has to show Force, because Russia had/has several disputed area's with the Chinese as well......", "score": 5, "replies": [{"body": "I’d be surprised if Putin tried to sack Kiev. But I’d also be surprised if he didn’t annex at least part of Ukraine.", "score": 3, "replies": []}]}, {"body": "What protests", "score": 2, "replies": [{"body": "The freedom protests spreading across many countries.", "score": 1, "replies": []}]}, {"body": "My experience has been, entering a market with fear of losing causes me to jump ship and lose.\n\nIf you're starting in the market you're going to need patience and keep developing patience.\n\nDD is VERY important, I still don't understand all the numbers but making some progress at least.\n\nHave a plan, in, out, and what if, and be cool with it ahead of time if the worst case end up happening.\n\nBest of luck.", "score": 1, "replies": []}, {"body": "Spy down 2% EOD friday. You do the math", "score": -1, "replies": []}, {"body": "There has been a correction already due to fears about a hawkish fed. The market is already pricing in significantly more severe rate hikes than what the Fed has communicated. The protests are short term so probably won't have much of an impact. War between Russia and Ukraine doesn't have much of an impact on US companies. Europe might be in trouble but that largely depends on Europe's reaction to the war.", "score": 0, "replies": []}, {"body": "No. \n\nIt's going to provide opportunity.", "score": 0, "replies": []}, {"body": "Nothing happened with Crimea.\nUS will just  sit back and look.", "score": 1, "replies": [{"body": "I mean yeah the government already told the world we aren’t going to do anything if Russia invades", "score": 1, "replies": []}]}, {"body": "Nobody can predict the future. One can speculate but nobody knows what will actually happen", "score": 1, "replies": []}, {"body": "\"some crashes\" isn't the correct term since it implies more than one crash. A crash is hard, sudden, and the market loses a lot of value, but crashes are many years apart. So it may cause \"a crash\" but not several.", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "Instead of saving the last few years you shoulda been putting money in weekly to either VTI and or QQQ.", "score": 1, "replies": []}, {"body": "You are not equipped to invest safely. Do not invest. Also, buddy how old are you? There's a lot of teens trading on here and risking a lot", "score": 1, "replies": []}, {"body": "More likely that the crash was always going to happen and the US will just pass the blame onto these instead of owning up to it's own fuck ups.\n\nI'd hold on to my money until it happens and then buy the dip. 100% stocks will be dropping in the near future.\n\nSome will say blah blah you cant time the market. That's true, but when you know some shit is about to go down it's more tha  likely going to go down and not up lol", "score": 1, "replies": []}]}
