{"title": "Is knowing how many users Snapchat and Fitbit gain worth anything?", "selftext": "[deleted]", "id": "6cdo1d", "created_utc": 1495325587.0, "score": 34, "upvote_ratio": 0.88, "num_comments": 28, "comments": [{"body": "Ah no no, that information is worthless.  \nYou should email me all of your work ... for science.", "score": 55, "replies": []}, {"body": "Sell your backdoor as ransom. Or leverage for a new job!", "score": 35, "replies": [{"body": "[deleted]", "score": 26, "replies": []}]}, {"body": "Come back when you confirm that all of SNAPs user growth is coming from a Bangladeshi click farm.  That information will be worth something.", "score": 28, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Bangladeshis dont have money to spend on it though.  Advertisers are going to keep track of penetration and see that theyre paying to advertise to sand people.", "score": 5, "replies": [{"body": "pretty sure bangladeshis are dirt people, not sand people.", "score": 6, "replies": [{"body": "They're going to be underwater people in like 50 years ", "score": 5, "replies": []}]}]}]}]}, {"body": "Yes it's worth something.\n\nTell me and I'll give you $10", "score": 14, "replies": []}, {"body": "Test it against what snap reported last quarter", "score": 8, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "Giving it out for free wouldn't be illegal...", "score": 29, "replies": []}, {"body": "selling the info seems sketchy. using it for yourself however...", "score": 11, "replies": []}, {"body": "Next quarter give it to your wsbros", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I actually have no idea what this is ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "K do that before earnings\n\nU seem smart. I'd yolo it", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm interested in it before earnings\n", "score": 1, "replies": []}]}, {"body": "Fukkin snitch\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "lol guessing they autoincrement an id somewhere.", "score": 5, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "lol might be more valuable if you could get WAU though.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Weekly average users.", "score": 6, "replies": []}]}]}]}]}, {"body": "Submit it to their bug bounty otherwise. If it's that sensitive there'll be a couple of grand in it", "score": 4, "replies": []}, {"body": "share that data fam 🔥🔥", "score": 3, "replies": []}, {"body": "Is it based on a small sampling or the actual figures? That sounds interesting; donno if classified as insider info tho (in my opinion it shouldnt as everyone can write such software)", "score": 1, "replies": [{"body": "Well you don't know how he got it. If he got it through hacking then yes, it is illegal. ", "score": 1, "replies": [{"body": "Of course. It got me thinking whether such thing is even possible. Honestly speaking, I doubt what OP is claiming. It could be reasonable if we had real-time active users stats or some other sign of the number of users out there. Search engine database is the only thing that comes to my mind but... more likely bullshitting.", "score": 1, "replies": [{"body": "Same here TBH.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "My point was, you can infer the number of new user (or growth as you call it) from the active users or some other statistics that is publicly available. Other option is if you have a database for a particular area (say you're working at AT&T and can monitor the traffic) -> small sample can be indicative. Neither of the two, however, will deliver a good approximation / have a large statistical error. Hence the strategy turns into a gamble.", "score": 1, "replies": []}]}]}]}]}, {"body": "Might it have anything to do with that SnapChat update that flooded the NTP time servers due to a bug?  \n\nThere are a finite number of ways to do this on a mass scale - namely any predictable outgoing requests to infrastructure like DNS queries or hits against a certificate provider.\n\nIf it is anything like I'm sure others have been on it for a while.  Banks and Hedges employ some of the best programmers and security engineers in the world.   If there is a legal way to get this info, and it is worth money,  I'm sure they already have it.", "score": 1, "replies": []}, {"body": "Reach out to the companies and ask if they intend for that info to be public. If not, offer a solution. Could turn into a job offer or some contract work.", "score": 1, "replies": []}]}
