{"title": "PayPal - The Digital Payments OG is now a Melting Cube!", "selftext": "PayPal has squeezed the last bit of juice in its SMB (35mn accounts) and Consumer (400mn accounts) business which are characterized by structurally high churn and mortality. For comparison, Dropbox has 17mn paying users out of 700mn registered users and yoy user base growth is \\~3% in its case. PayPal is now pursuing profitless growth with its focus on commoditized and low margin Braintree (Payment Aggregator/Gateway) offering and the string of acquisitions it has put together over last few years (Spent $10bn+ in mostly cash). \n\n[https://www.dropbox.com/scl/fi/fodnvnjore869nigs5zsn/PayPal-The-Digital-Payments-OG-is-now-a-Melting-Cube.pdf?rlkey=4wu9rorjack5bb7zbe1zwg2se&dl=0](https://www.dropbox.com/scl/fi/fodnvnjore869nigs5zsn/PayPal-The-Digital-Payments-OG-is-now-a-Melting-Cube.pdf?rlkey=4wu9rorjack5bb7zbe1zwg2se&dl=0)\n\nDisclaimer – No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above are purely my own. I am not a licensed securities dealer, broker, investment adviser or a research analyst licensed or certified by any institute or regulatory body.\r  \n\r  \nDisclosure – I do not hold a position with the issuer such as employment, directorship, or consultancy. I do not hold a material investment or a short position in the issuer's securities.\r  \n", "id": "16skft3", "created_utc": 1695725433.0, "score": 29, "upvote_ratio": 0.72, "num_comments": 41, "comments": [{"body": "\"string of acquisitions it has put together over last few years (Spent $10bn+ in mostly cash).\"\n\nPeople forget about the time it almost bought Pinterest for $45B.", "score": 39, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Ebay bought Paypal and later they spun off the company which means both are separately listed companies now.", "score": 2, "replies": [{"body": "Ok thanks", "score": 1, "replies": []}]}]}]}, {"body": "I think PayPal has potential", "score": 21, "replies": []}, {"body": "Still use it weekly.", "score": 7, "replies": [{"body": "I use it daily", "score": 1, "replies": []}]}, {"body": "love to see bear posts means the stock is likely heading upwards lol", "score": 50, "replies": [{"body": "most of people here are not bear on paypal. your up vote count and mine downvote count make my point.\n\nif you check reddit history on paypal you will see that theres a alot of people holding a big melting bag", "score": 4, "replies": [{"body": "Bags are meant to be held", "score": 7, "replies": []}, {"body": "It's the same way on Youtube based just on the recommendations I get from the channels I follow. So many stock pick youtubers have been calling it a screaming buy the entire way down.\n\nI personally wouldn't dare touch Paypal no matter how cheap it gets. I never use their products so I can't say that I understand the business. And I've heard so many bad things about their products from people who have been burned by them that I just wouldn't feel comfortable investing in their stock.", "score": 1, "replies": []}]}, {"body": "Hey, you the guy who made an appearance in finance junkies?", "score": 1, "replies": [{"body": "Yeah way back", "score": 1, "replies": [{"body": "Yeah like 3 months ago", "score": 3, "replies": []}]}]}]}, {"body": "PYPL is no longer a growth story. Also their margins could shrink.\n\nThey should start paying a dividend.", "score": 19, "replies": [{"body": "They are doing massive stock buy backs. No need for a dividend.", "score": 15, "replies": []}, {"body": "100%.\n\nAt the end of the day, over the past 4 quarters, the company has earned about $1 billion per quarter.\n\nThey have $10 billion in cash against about the same in long term debt.\n\nWould I buy PayPal in the competitive landscape they exist? No way BUT if they start paying a dividend, maintain the solid after tax income and keep their debt in check, I don’t think you would lose all of your money.\n\nThat being said, in my view, I’d be looking at big tech that has pulled back in the past 30 days, IE: Google, Amazon, Adobe and Apple.\n\nTarget could also be an interesting 3-4 month play, going into the holiday, for a pop at year end.\n\nPatience will pay off here and I don’t know that j would put PayPal at the top of my shopping list.", "score": 4, "replies": [{"body": "chocolate beer moose gold hoop ` this message was mass deleted/edited with redact.dev `", "score": 6, "replies": []}, {"body": "> They have $10 billion in cash against about the same in long term debt.\n\nWhen did they get the debt? If their interest rate is as low as 2020 mortgage/refinancer, shouldn’t they keep the debt and invest the money elsewhere?", "score": 1, "replies": [{"body": "The point of the comment was to illustrate that they can not only cover their debt with cash on hand but with cash flow.\n\nThe point of the comment was to show the company is very solvent!", "score": 2, "replies": []}]}]}]}, {"body": "I bought in at $59 last August 15. Going long.", "score": 4, "replies": []}, {"body": "I bought at $61. I’ll keep buying down to 50. If it goes past that I guess I’ll buy more. \n\nBuying good companies at low prices has always been good to me. They make plenty of money and trade very cheaply compared to other tech and seem to have some upsides with venmo and buy now pay later schemes that generate tons of transactions and fees.", "score": 4, "replies": []}, {"body": "paypal is going to be hhuge", "score": 6, "replies": []}, {"body": "Idk bout y’all but PayPal fees eat up into my profits and then it takes a few days to reach my business account (unless I use their business debit card )", "score": 4, "replies": [{"body": "Try TransferWise if you can.", "score": -2, "replies": [{"body": "How can my customers pay with transferwise? PayPal is already Integrated into my Shopify store", "score": 6, "replies": [{"body": "Hard luck then. Sorry!", "score": -2, "replies": []}, {"body": "So you still use it. Which is why it has value still", "score": 1, "replies": []}]}]}]}, {"body": "Uber teaming up with PayPal is a game-changer, man. That move alone could make their money triple, and you bet that's gonna make their stock price shoot up!", "score": 10, "replies": [{"body": "I estimated that It would increase transactions by 30% in a conservative case. Seems big if true.", "score": 3, "replies": []}]}, {"body": "F to all the PYPL bagholders. Guys must be getting jacked from holding all them bags.", "score": 3, "replies": [{"body": "Username checks out.", "score": 4, "replies": []}]}, {"body": "Use stripe", "score": 1, "replies": []}, {"body": "it's a zero", "score": 1, "replies": []}, {"body": "There is no reason to use Paypal anymore except for shady stuff like gambling and porn.", "score": -1, "replies": [{"body": "Really? I use it all the time if it’s an option at checkout on an online store. No need to fill in any info like address and CC and 1 click buy. It doesn’t cost me any more and saves me time.", "score": 26, "replies": [{"body": "Also they got a very decent 2% cashback card. It's 3% if you use it through the buy with PayPal button on merchant websites. Of course that sort of promotion is fucking with their margins though.", "score": 7, "replies": []}, {"body": "Same, I have it set up on a few auto payments for bills and the pay in 4 feature is nice when I need to pay for something expensive and would rather spread it across 4 months. As long as it doesn't cost me anything, I'm happy with it.", "score": 2, "replies": []}]}]}, {"body": "Paypal should (and could) let go of 90% of their employees. Wouldn’t harm the business. Decrease cost and then pay out dividends. Would be a cash machine", "score": 1, "replies": []}]}
