{"title": "S&P 500 DD", "selftext": "I mostly like to trade with basic TA, intuition, small positions and big dreams. I love buying cheap options on expiry and seeing how many I can flip for profit, for one. This is a pretty long post, so I have 3 sections - feel free to read just one if you want. a) inverse fsc b) What's next? c) How to make mad money imo\n\na) I think the most interesting thing happening in the market so far is how sentiment keeps flip-flopping from \"rate hike is good: signals strong economy\" to \"rate hike is bad: we still want our easy money\". To me, the market is looking for an excuse to go higher. But, it's weird - aren't we in the second longest bull market in history? Why on earth is gold AND the market rallying so hard together?!\n\nI feel that Brexit felt like the biggest kick in the balls to everyone that the world is going to shit, just much slower than it has in the past. I feel that smart money is slowly moving into gold with the newly available capital they are getting from covering their short and long term shorts. Moreover, foreign institutions have recently bid up US assets in general. If you think hedge funds like to play in bad times like Jan, you bet your ass they make MAD EASY money when the market rallies 5.12% in the week post-Brexit. We could have a rally for a good amount of time - anywhere from a month to a year in my opinion. Our lord and savior did the best inverse he could for all us plebs - he indirectly called the last bottom of this bull market...\n\nb) I think what happens next depends on the schedule of future global events. If Trump becomes President, who the fuck knows what can happen. Stocks will be volatile, I feel that's all I can say with certainty. If there is a surprise recession, the fed could cut rates and stocks could rally for a while in denial while more smart money gets out.\n\nI think there are two 'broader' outcomes, regardless of the timeline. Either the market 'stagnates' and cools off for a year or two, or we crash somewhat hard (thinking S&P 1700 or so). If we cool off, I think this will solely be because the US won't have it as bad as other countries. The picture worldwide isn't pretty. Yes, a lot of it is doomsday hearsay, but weren't we all about China? Oil? Fed? like 5 months ago? The US is just about 'okay', while China and now Europe have a lot of glaring problems that mostly boil down to financials. Investors are always trying to hedge their bets, and one would be a fool not to make money off that.\n\nOn the other hand, we could crash pretty hard. I think we would then recover slightly, but then enter a series of lower lows and lower highs. I feel that could go down for 2-3 years, before we stagnate and then enter into another bull market. Idk where the world is headed 50 years from now, but I personally feel certain issues like global warming and ISIS could evolve into something much nastier if the world leaves it unchecked.\n\nc) Money time boyz. Now, I'm pretty new to options, but I love it. There are a lot of fancy strategies that can definitely make you short term money, but this is a slightly longer term bet. But it's still a yolo. Just a yolo you need to be slightly lucky for. The luck comes in calling the bottom. For now, gold is a good bet, but keep some cash handy for when this bull market runs out of steam.\n\nAt the bottom, with as much money as you DO NOT GIVE A FUCK ABOUT, throw your dollars into a basket of OTM calls dated about 6 months - 1 year from then (depends on your preference and time frame). This has to happen at YOUR BEST GUESS FOR THE BOTTOM AS POSSIBLE. This is slightly inspired by the best Brexit DD post I saw, eventhough Brexit turned out to be a nonissue. /r/wallstreetbets/comments/4pkuhh/tomorrow_is_the_buying_opportunity_you_wait_years/\n\nThis guy got it right. Some nice OTM calls bought that Friday would have made a shit ton by today. I'm too lazy to math atm, but I'm thinking some calls that were worth $0.05 could easily have been worth $3-6 today.\n\nIf the S&P goes to 1800 within the next year, for the love of God pray that you have some cash to dump into far out expiry calls on your favourite stocks. Whatever you like to play.\n\nSome sub picks: FB, AMZN, NFLX, GOOG, TSLA, VRX, ABX, SWHC, AMD, etc.\n\nSome sub picks that I prefer: ATVI, EA, TTWO, SNE, NVDA (If I only had $1000, I'd put it all on this baby), HL (this one you can buy today and still have a good time).\n\nI wrote this long DD to be annoying, GFY <3", "id": "4s2yja", "created_utc": 1468108099.0, "score": 31, "upvote_ratio": 0.94, "num_comments": 41, "comments": [{"body": "We're reaching a triple top on the s&p500. That's all I need to know", "score": 12, "replies": [{"body": "So what's your play? Puts on spy?", "score": 3, "replies": [{"body": "I bought some 212's right before close on friday. I'll either be up 80% tomorrow or down 20. Not sure what will happen yet", "score": 6, "replies": [{"body": "Remindme! 1 day", "score": 2, "replies": [{"body": "Oh, I've got a fan, that's nice. ", "score": 5, "replies": [{"body": "So how did it work out?", "score": -1, "replies": [{"body": "Market isn't open til tomorrow so idk. ", "score": 1, "replies": []}]}]}, {"body": "I will be messaging you on [**2016-07-11 01:03:32 UTC**](http://www.wolframalpha.com/input/?i=2016-07-11 01:03:32 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/wallstreetbets/comments/4s2yja/sp_500_dd/d564zg5)\n\n[**5 OTHERS CLICKED THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/wallstreetbets/comments/4s2yja/sp_500_dd/d564zg5]%0A%0ARemindMe!  1 day) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! d56504j)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "> Remindme! 1 day\n\nWhats your expiration/cost?", "score": 2, "replies": [{"body": "Faggots delights of course. Cost was .87, currently worth .96 ", "score": 2, "replies": []}]}, {"body": "I'm not sure about your SPY puts... Good luck dude. ", "score": 1, "replies": [{"body": "Worst case scenario I lose 20%. No biggie.", "score": 1, "replies": [{"body": "Do you have a strangle on SPY? \n\nI think the market actually has some fuel left in the tank to rally into the Thursday unemployment report. Quite a bit of short-covering on Friday at the end of the trading session. Target price for this week is around 215.", "score": 1, "replies": [{"body": "a strangle wouldnt be ideal here since were reaching all time highs (possibly). Its better to just wait till monday, exit my position if the market goes up, wait til 214ish then buy puts for the inevitable turn around. A strangle works on volatility, and the market would have to swing up to 215 within a day or so to make decent returns. I just dont see that happening", "score": 1, "replies": []}, {"body": "I see financials posting earnings above estimates this week leading s&p to top and then...", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "We are at all time highs and everyone is so bearish...I think we will break out of the range but it may likely be a fakeout, just as retail finally goes long we will correct back down to 1800. Then I think give it a few months and they sell for cheaps, we recover and break out to make newer highs again. \n\nNo one actually  fucking knows of course. ", "score": 9, "replies": [{"body": "We were at all time highs when 2008 happened. The rally to hit all time highs actually happened just before the crash", "score": 0, "replies": [{"body": "The SP500 has been at all time highs so many times. In the long run it tends to go up.", "score": 1, "replies": []}]}]}, {"body": "How the fuck this is a \"DD\"?", "score": 7, "replies": [{"body": "Apparently a random smattering of thoughts is what counts as due diligence here. I love it.", "score": 3, "replies": []}]}, {"body": "I feel the top of S&P is near. What if I  do the opposite. Buy long puts instead?\n\nIs it safer to call a bottom than a top? Cause I keep hearing never short S&P.", "score": 6, "replies": [{"body": "If you don't know, straddle up!", "score": 1, "replies": [{"body": "If you want to make a slight directional play, a strangle may be a good idea too. Similar to a straddle, but with two strike prices (the option with the strike closer to the current price being the direction you are betting on). ", "score": 1, "replies": []}]}]}, {"body": "With such low IV (7pt+ change Friday) the SPY in either direction are great bets.  So pick a fucking side, load up, and watch IV explode because there's certainly no room for sellers.  ", "score": 5, "replies": [{"body": "Then but VXX. Win either way right?", "score": 2, "replies": []}]}, {"body": "Fundies wise it's all about the USD and yields and rush to anything of value. \n\nThat's the post Brexit deal.  Brexit and GBP weakness may have set off USD rampage PT. DEUX with CB divergence and BOE looking at easing to mitigate their incoming shitstorm.  \n\nSo its not just standard QE on, it's a flight to safety/yield/anything that will hold value so US treasuries and US equities and gold.  \n\nRuns the risk of crashing commodities and sucking all the liquidity out of EM and putting us right back in the shitter we were in at $30/whatever oil.\n\nSo the dumb ass limeys may or may have not fucked the world and we may or may not see a smash and grab at all time highs or we may see a big US rally while the rest of the world fire sales.  Nobody has got it fingered out quite just yet. ", "score": 3, "replies": []}, {"body": "id all in nvda if i had any choice as well : )\n\nthanks for the write up.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "2250 here we come!", "score": 5, "replies": []}, {"body": "Remindme! 31 Dec 2016 \"I might get to watch someone eat a watch\" ", "score": 5, "replies": []}, {"body": "What do you mean never for 2200? At some point SP will break upward. You think SP is stuck here indefinitely? I agree on the < 2150 by end of year. This market is way overbought. ", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Remindme! 31 Dec 2016 \"guy won't eat watch but will instead fuck it\"", "score": 3, "replies": []}]}]}, {"body": "Seconded", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "If this is a tripple top reversal the distance from the support break to the highs can be measured and subtracted from the support break for a price target. [source] (http://stockcharts.com/school/doku.php?id=chart_school:chart_analysis:chart_patterns:triple_top_reversal) .", "score": 1, "replies": []}, {"body": "If god gives me a 207 SPY tomorrow, I will buy a few people on here colorful dildos", "score": 1, "replies": []}, {"body": "I'm put out a little post about this too. I'm buying 202 puts for October, and should gain about 400% by then, given my prediction of 1989 spx is correct. All I got for you", "score": 0, "replies": []}, {"body": "ELI5", "score": -4, "replies": [{"body": "OP is a fuck boi.", "score": 5, "replies": []}]}, {"body": "This guy fucks ", "score": -2, "replies": []}]}
