{"title": "The hell is happening to DUST?", "selftext": "Bought shares @ average of $11/share, now down to $6.70/share. What's the upside of this stock? I thought it would go up in a bull market? Should I keep holding long term? It's history looks like shit.", "id": "4qyck7", "created_utc": 1467483655.0, "score": 14, "upvote_ratio": 0.95, "num_comments": 42, "comments": [{"body": "Buy more to average down bro, DUST about to get bought out by NUGT", "score": 62, "replies": [{"body": "lol OP so autist he won't be able to afford pizza from lil ceasars after this ", "score": 11, "replies": []}, {"body": "Listen to this faggot.", "score": 5, "replies": []}, {"body": "Thx m8 u the real mvp", "score": 1, "replies": []}]}, {"body": "Bro I'm gonna take the high road and give you some advice. I know we talk a lot of shit here but I think we also owe it to each other to help. I'm $6k in the red on a 3x oil ETF and if I can save you from similar pain maybe I'll get some karma. \n\nDUST is a 3x inverse ETF based on gold miners. In simple terms, it sorta tracks the price of gold by a factor of -3x. So if gold goes up 4%, DUST will go down 12%ish. Brexit is what killed DUST recently. \n\nOther things to consider:\n\n- Learn what \"decay\" is wrt leveraged etfs \n\n- If you don't know what causes gold to up/down, don't mess with DUST or NUGT\n\n- It's unwise to hold DUST over night and it's PANTS-ON-HEAD RETARDED to hold over a weekend or long-term\n\n- I fortunately only lost $90 on DUST from Brexit. Since then I've been able to make $100-200 here and there by buying and selling NUGT in a couple hour spans. \n\nHonestly DUST might climb up a little this coming week but my advice is to sell soon and cut if losses. \n\nGood luck and GFY", "score": 25, "replies": [{"body": "Thanks mate. Good advice. So it's not good to hold 3x ETF since it's so volatile right? Not just because it's involved with gold?", "score": 1, "replies": [{"body": "Not because it's volitle, because of it's leveraged nature, it's value decays very fast relative to the underlying. That is the cost of the leverage. Over time it will trend to zero, even if the price of gold holds steady", "score": 6, "replies": [{"body": "Oh shit. This makes so much more sense now. I had no fuckin clue. Thanks!", "score": 3, "replies": [{"body": "Here, watch these: http://www.direxioninvestments.com/jackjill", "score": 1, "replies": []}]}]}, {"body": "I mean you can hold it, it's volatile, but it will also go either up or down rapidly. It's best to play it by giving yourself the best odds possible. Study upcoming events, study earnings, and big companies that effect gold etc. don't hold it if you don't know what could happen over night/over the weekend. Just play smart.", "score": 4, "replies": []}, {"body": "Idk if this guy advising you knows but it's not smart to hold long term because it decays. Leveraged etfs decay no matter what gold does. And inversed etfs like dust do even worse. So even if gold were to stay flat you would still lose money on this. So you're losing money from x3 leverage, even more for it being inversed, and finally because obviously gold is going up. \n\nAlso gold is rising despite the market going up for three reasons. \n\nBrexit created future uncertainty for the market. \n\nBrexit caused uncertainty/volatility for currencies (safe haven) \n\nBrexit killed any chance for an increase in interest rate (interest rates increase the value of the dollar thus making it more valuable in relation to gold). \n\nYou could also easily argue gold has been under valued for a long time. \n\n\n", "score": 3, "replies": [{"body": "> vising you knows but it's not smart to hold long term because it decays. Leveraged etfs decay no matter what gold does. And inversed etfs like dust do even worse. So even if gold were to stay flat you would still lose money on this. So you're losing money from x3 leverage, even more for it being inversed, and finally because obviously gold is going up.\n> Also gold is rising despite the market going up for three reasons.\n> Brexit created future uncertainty f\n\nI've been holding NUGT and JNUG for 6 weeks now. I can't convince myself to sell at this point. ", "score": 2, "replies": [{"body": "Yea don't. I'd set a stop loss that still garners me a significant profit and chill. ", "score": 1, "replies": []}]}, {"body": "I told him to learn what decay is, so yeah I know ", "score": 1, "replies": []}]}]}]}, {"body": "You picked the shit end of the stick", "score": 7, "replies": []}, {"body": "You shouldn't ever hold bearish 3x ETFs long. With NUGT at least there is a glimmer of hope since markets and gold tend to go up long term. It's still shit to hold over a day though. Basically I don't understand why anyone would every buy a 3x bear ETF the risk/reward is so fucked. You win and you win reasonably, you lose and you lose all your money. Making an earnings gamble on a blue chip is way better; you lose and the company can still recover no risk of going to 0 generally.", "score": 4, "replies": []}, {"body": "> I thought it will go up in a bull market\n\nNot if the bull market is powered by cheap money and negative interest rates", "score": 3, "replies": []}, {"body": "The bounce this week isn't a \"bull market\" - all the defensive positions like gold and bonds are still strong because smart money isn't buying the bounce.", "score": 3, "replies": []}, {"body": "haha you are fucked.\n\nI lost more than I care to admit on this fucking thing.\n\nIt'll bounce to $8 this week, but from there I think its all down hill.", "score": 6, "replies": [{"body": "That view is why you got fucked.  \"oh yeah it will go up 20% this week\" if you actually believe that you should be putting your life savings into it", "score": 14, "replies": [{"body": "If I felt really strongly about it I would. But I'm not convinced it has hit bottom yet. \n\nI thought hues day was bottom, and Friday morning too. I was wrong twice. ", "score": 1, "replies": [{"body": "Then delete your post", "score": -6, "replies": []}]}]}]}, {"body": "It's a fucking meme stock, that's what's happening. ", "score": 2, "replies": []}, {"body": "You never hold any of these 3x etfs more than a day bro. They're only for day trading and risk takers. I can't believe you throw money in something you have not researched. My advice is identidy the next resistance and sell at the next bounce. ", "score": 2, "replies": []}, {"body": "You're a fucking idiot and clearly shouldn't be trading DUST bc it's obvious you don't even know wtf it is..", "score": 5, "replies": [{"body": "Calm your nipples FGT ", "score": 1, "replies": []}]}, {"body": "> What's the upside of this stock?\n\nIt's a bearish ETF, so the only upside to it is if you think gold is going to go down. But you shouldn't hold onto those 3x ETFs. They're more suited to day trading.", "score": 2, "replies": [{"body": "Sheeeiiiit. Thanks. ", "score": 3, "replies": [{"body": "keep jumping in the deep end of the pool.... you will learn to swim or you will drown.\n\nYOLO baby!\n\nhave you heard of uvxy by any chance?", "score": 3, "replies": [{"body": "> uvxy \n\none my my favorites for anal bleeding", "score": 1, "replies": []}]}, {"body": "You shouldn't be investing in this without knowing what it is ", "score": 3, "replies": [{"body": "Gfy", "score": -1, "replies": []}]}]}]}, {"body": "Uhhhh brexit, global uncertainty, Soros... you know what you're buying or naw?", "score": 1, "replies": []}, {"body": "Don't buy shit you don't understand. A cursory Google could've saved you the pain. ", "score": 1, "replies": []}, {"body": "Consider it a valuable lesson in 3xetf stock trading.  Don't hold on to this stuff long term.  Most people stay away from it altogether, because it means buying into something you know will go down in the long run.", "score": 1, "replies": [{"body": "That was my thinking too after reading these responses. Thanks man.", "score": 1, "replies": []}]}, {"body": "lmao. Do some research. Cash out and lick your wounds. People talking about holding things like DUST long are making you learn a lesson if you listen.", "score": 1, "replies": []}, {"body": "This makes you look totally clueless ", "score": -1, "replies": [{"body": "Maybe I am O_O", "score": 8, "replies": []}]}]}
