{"title": "Dave and Buster’s upcoming downfall", "selftext": "Dave and Buster’s fits into the category of stores, restaurants, and effectively any public place which is facing troubles due to the Coronavirus. However, PLAY is up 50%+ just today, based on no catalyst news. This is a clear dead cat bounce. \n\nShares of PLAY fell from ~$48 down to ~$5 in a matter of a month. Dave and Buster’s lost 90% of its stock value since Feb 21. Most of this drop was attributed to the Coronavirus fears.\n\n5 days ago, shares of PLAY jumped after management announced a “poison pill” plan. What is a poison pill?\n\nA poison pill is a somewhat controversial corporate defense strategy companies use to prevent a quiet takeover. An investor could theoretically start gobbling up shares on the open market at these low prices without one, meaning existing shareholders wouldn’t get any sort of premium for their stock. So companies cap those shares. \n\nIn simple terms, they limited the amount of shares one person/entity could purchase to 15% of total shares available to prevent a takeover of company stock due to the cheap trading price. \n\nAs a result of this new plan, shares jumped up ~60%. Such a jump makes sense. \n\nWhat doesn’t make sense is... 5 days later, shares are suddenly up 50%+ for the day for no apparent reason. It’s clear this is a dead cat bounce (a temporary recovery in share prices after a substantial fall, caused by speculators buying in order to cover their positions). There will definitely be a pullback. I would enter put positions EOD today. \n\nTLDR: PLAY 10p 4/17 - enter EOD (3/24)", "id": "fo9mmt", "created_utc": 1585072615.0, "score": 121, "upvote_ratio": 0.91, "num_comments": 72, "comments": [{"body": "Thanks for coming up with a reasonable writeup with an actual plan. The issue I see is the liquidity and more specifically the spreads. The ATM bid/ask for both puts and calls is well over a dollar wide. Hard to get good fills both on the way in and the way out.", "score": 59, "replies": []}, {"body": "There's not much volume on PLAY and IV is insanely high. I agree it will go down again but still seems risky to me", "score": 42, "replies": [{"body": "Sucks, was the same with APRN.  Looked at the prices and \"oh\"'d my way out.", "score": 11, "replies": []}, {"body": "Is there a way to evaluate if a premium is overpriced/underpriced?", "score": 2, "replies": [{"body": "That's what the Greeks etc are for. If you could deduce the actual value of the option you'd never make a wrong move. It all comes down to your personal risk tolerance and sense of the market. But you can look at IV specifically, high IV comes with high premiums. The d&b IV was like over 400% when I looked at some strikes earlier. In comparison SPY puts were like 70-120% which is still considered extremely high. Whether that's overpriced is up to you - if you are sure it's going to drop and you are going to time everything right then maybe it's a fair price for you.", "score": 6, "replies": []}]}, {"body": "I'm new to options but if you do a short call spread wouldn't you be safe waiting till expiration for the long call is worthless if all is correct?", "score": 1, "replies": [{"body": "Yes, but then you lose the ability to close the position if the price moves in the wrong direction. If the the option is liquid, you might be able to quickly act and minimize your losses. Another issue is that you can't exit when you hit, say, 50% of the maximum possible gain, an exist strategy which increases your probability of success relative to waiting for the maximum gain. TL;DR: It is like getting in a car and throwing the steering wheel out of the window, and hoping that you don't need it.", "score": 2, "replies": [{"body": "Wish I’d read this before I bought PLAY puts.", "score": 1, "replies": [{"body": "Why did you buy PLAY puts?  If it was because of this post and you’re a newer option trader, just be careful being loose with your plays based on a Reddit post that seems unique and different from what everyone else is doing. I know the feeling. You want that edge. You want that quiet tip that feels like you’re in the know. You read a comment, it sounds logical, it seems like an outside the box play, and it’s cheaper to enter. You toss money at it because it seems like a low risk/high reward gamble. Most of us have been there. Just be careful if you’re new. \n\nAnd if you’re not new and just acted hastily, then I guess you’ve already owned it and I’m preaching to the choir.", "score": 1, "replies": [{"body": "The first part is exactly what happened. I’m extremely new and had no business getting into options. A couple weeks ago it seemed like the easiest money. I went from being up 200% to down 50%. Now I’m just trying to figure out how the best way to get out. Spent a couple thousand dollars learning a pretty valuable lesson.", "score": 1, "replies": [{"body": "That’s good you recognize it. What strategies do you use?  I’m still a novice myself and have an understanding of the greeks, but not a great idea of how to implement it specifically. If I had to give any advice it would be to make sure whatever positions you enter have good liquidity. That will mean you can probably get out, and doing so won’t kill you based on the bid/ask alone. Look at a low liquid option and you’ll see the bid and ask spread is large. As soon as you enter that trade, assuming you get in somewhere near the mid, you’re at a loss. So, find legs with lot and lot of interest. If you don’t know what that is, research it and find where it sits on your trading UI. You’ll learn it better that way. \n\nAlso, if you’re wanting to learn without risking a lot, try selling premium with defined loss risk. I started almost exclusively selling iron condors with $5 spreads. Essentially, the Tasty Trade method. Sell one put and one call at the respective 1 SD strike, then buy strikes $5 lower and higher, respectively. Make sure those positions have high liquidity. Most people try to collect a third or more of the spread value, so $166 for a $5 spread and have about a 60-70 probability of profit. \n\nPeople have different strategies and strategies within the strategy. Just remember, nobody goes broke collecting a profit.", "score": 1, "replies": []}]}]}, {"body": "You learned it the hard way, but you can still count it as a win if you keep that in mind from now on.", "score": 1, "replies": []}]}]}]}, {"body": "So make it a small play or short the stock instead?", "score": 1, "replies": []}]}, {"body": "They noticed KKR buying up a lot of $5 shares and got scared KKR was planning a hostile takeover.  In response they wrote the \"poison pill\" language, which allows common stockholders 1 additional share per share owned (excluding the person purchasing 15%; in theory; KKR)  This would dilute outstanding shares to effect a positive defense against the hostile takeover.  The market loved it and doubled the share price.\n\nIDK what happened today, (65% increase) maybe KKR got pissed, sold out, and took their double while all the shorts were covering and the normies were betting on a merger/takeover.  Then again, If KKR was artificially depressing the price to effect a hostile takeover last week; and got caught, maybe this is just the result of KKR leaving town and letting it run.  \n\nI wanted in at $5, won't get in at $15", "score": 9, "replies": []}, {"body": "Bid $2 with ask $2.5.... I agree that PLAY is going to drop but this spread worries me. It’s keeping me from buying a put.", "score": 17, "replies": [{"body": "I thought the same earlier today when they were up almost 60%.\n\n\nAlso, when you look at their overall decline, they took a much larger hit when compared to other companies.", "score": 0, "replies": []}]}, {"body": "I picked up 29 more shares yesterday. I'm not going to trade options on this but the balance sheet is awesome on this company and long term the shares are cheap as fuck right now.", "score": 4, "replies": []}, {"body": "My dumbass lost after a put on the inital spike from the poison pill announcement.   \n\n\nPretty much cost me all 200 i had put in my account to play with, Still holding for 3/27 puts, ill be glad if i cut even.", "score": 3, "replies": [{"body": "Me too bruh", "score": 1, "replies": []}, {"body": "No volume! You can't sell.", "score": 1, "replies": [{"body": "That's what I saw yesterday. Wanted to get some puts but there was no sellers. Didn't want to get stuck holding the bag.", "score": 1, "replies": []}]}]}, {"body": "They're squeezing out the shorts. It will fall miserably once the people they're looking to destroy are out of business. They did this to [James Cordier](https://www.youtube.com/watch?v=VNYNMM0hXXY), TSLA, BYND and SPCE. This is just institutions flicking their dicks around to prove that they got the bigger dick.\n\nTiming is key.", "score": 3, "replies": []}, {"body": "I bought PLAY 13.5 3/27 today. Was that stupid?", "score": 4, "replies": [{"body": "Would also like to hear peoples advice on this, I feel like in these highly volatile times it could be a good risk / reward but then again with such little time to expiration and not a lot of buyers / sellers might be tough to even exit...", "score": 2, "replies": [{"body": "Not really sure if it’s a good play or not?! The Bid/Ask spread isn’t bad but there is no volume let alone an O/I of 0. I’m sure that once it starts going down more people may jump onboard but will there be any writers of the Put??!", "score": 2, "replies": [{"body": "I’ll write your autistic ass contracts whatcha want boss", "score": 4, "replies": []}]}]}, {"body": "Too short of expiry.\nI’d look to exit tomorrow if there’s a small decline.\nI don’t think Thursday will be too much of news to make everything drop.", "score": 2, "replies": [{"body": "You don't think the unemployment news will cause places like D&B to drop hard?", "score": 3, "replies": [{"body": "Not really. The numbers are out there already.\nAlso the stimulus package is all but signed already.\nThat’s not what will make the markets tumble.\nNot even the Q1 and Q2 reports.\nWhat makes the markets tumble must be the risks that the MM are not ready for - for example something huge with the repo market, with the trillions of debt. Banks failing.\nI don’t understand the underlying of all the bubbles so I can’t tell, but as someone cited - all big firms have run the analysis of their own for how this will affect them.\nAs far as we are moving all is according to the 2008 stimulus plan but I can’t see something bursting as the banks in 2008 because the Feds started infinite QE.\nYes it’s bad but noone can tell why it shouldn’t work.", "score": 3, "replies": [{"body": "RemindME! 3 days \"was this asshole right?\"", "score": 2, "replies": []}, {"body": "Well you were completely wrong. Sold my 3/27 put for almost 300%. Lol.", "score": 1, "replies": [{"body": "You were down 90% on Thursday, no?", "score": 1, "replies": []}]}, {"body": "RemindME! 2 days “see what happens in the future”", "score": 1, "replies": [{"body": "I will be messaging you in 1 day on [**2020-03-26 23:40:51 UTC**](http://www.wolframalpha.com/input/?i=2020-03-26%2023:40:51%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/options/comments/fo9mmt/dave_and_busters_upcoming_downfall/flex13c/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Foptions%2Fcomments%2Ffo9mmt%2Fdave_and_busters_upcoming_downfall%2Fflex13c%2F%5D%0A%0ARemindMe%21%202020-03-26%2023%3A40%3A51%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fo9mmt)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What's the volume like? I've never heard of anyone trading PLAY options before, is the liquidity even there?", "score": 2, "replies": [{"body": "A quick glance shows no liquidity", "score": 4, "replies": []}]}, {"body": "I worked there when they went public. Not sad about it.", "score": 2, "replies": []}, {"body": "Nice analysis. \n\nI would add that D&B could/will serve as a vector poont for Beer Virus. People touching and crowding around the videogames will lead to infections more easily as they shed the virus all over the surfaces and the next little knucklehead rolling up and getting it on themselves.\n\nThe CDC and others believe this virus can live for up to 17 days outside a host on a hard surface. Video games are a pretty hard surface and don't get cleaned as much as they will need to be cleaned to eliminate the beer virus.", "score": 2, "replies": []}, {"body": "Probably a short squeeze. My guess is it craters in the next day or so.", "score": 2, "replies": []}, {"body": "Bought leaps on play last week.   Not disappointed", "score": 2, "replies": []}, {"body": "Today I learned “Poison Pill” has a place in trading scenarios, nice one. I’ve been learnt.", "score": 2, "replies": []}, {"body": "I think there are better options out there. A 50% increase from 5 brings it to 7.50. Coming from ~48 that's still a massive drop. People need to remember that percentages up and down are VERY different. \n\n100 drops 50% = 50\nThat 50 gains 50% = 75\nBoth are 50% changes but you're still down 25%.", "score": 2, "replies": []}, {"body": "Agree with your point BUT one cannot make any money in this stock or options. All low volume stocks have similar issue.", "score": 3, "replies": []}, {"body": "Jesus those premiums are insane for a day like today and for DnB", "score": 1, "replies": []}, {"body": "I tried buying puts today but I was too stingy in my bid, gonna regret that on Friday and on the 4/17 as well, oh well maybe there will still be buoyancy tomorrow so the prior ITM levels near the low water mark aren't pricy", "score": 1, "replies": []}, {"body": "I did $13p 5/1. Any opinions/advice? Thought the same as op when I was watching it today.", "score": 1, "replies": [{"body": "Even If PLAY does go down, there’s zero liquidity on that strike you purchased.  So unless you plan on exercising, you may have a hard time exiting the trade. Not to mention the IV at 305% is gonna hurt", "score": 2, "replies": []}]}, {"body": "Can a newb ask a dumb question? What is the effect of being ITM or OTM on a put? I get what it means, but how does it effect the direction of the option itself and/or stock (if that matters) ?", "score": 1, "replies": [{"body": "OTM is time-decaying literally to zero cents. Where ITM volitility will be pegged to the underlying stock price... The strike price minus the underlying PPS is the premium at expiration.\n\nI know it sounds confusing, but it's not.", "score": 1, "replies": [{"body": "Maybe after another drink I'll get it.", "score": 1, "replies": []}]}]}, {"body": "Are their stores still open or closed due to the virus??", "score": 1, "replies": [{"body": "Most stores are temporarily closed.", "score": 2, "replies": [{"body": "Hmmm... Thanks for the post. It's too late for me to buy puts, but I've always liked D&B. May be a good buy or long call for me when this looks like we're at bottom. Haven't looked at their financials yet tho.", "score": 1, "replies": []}]}]}, {"body": "Seems like the best play would be a call credit spread given the IV concerns and the off chance the cat bounces a bit further.", "score": 1, "replies": []}, {"body": "Remindme! 3 days", "score": 1, "replies": []}, {"body": "Wait is this company going to go bankrupt? I can't believe I didn't buy some shares at 5 bucks. Given I don't trade this name, but that woulda been a good investment.\n\nI mean I don't know about this particular day to day options play but dang can't believe I didn't see this post when this company was 5 bucks.", "score": 1, "replies": []}, {"body": "Sorry that was me... I bought wayyyy too many shares.", "score": 1, "replies": []}, {"body": "bougthin without reading comments. Im kinda retarded.", "score": 1, "replies": [{"body": "If you made trading decisions based on the comments of strangers, would that make you smarter?", "score": 6, "replies": [{"body": "You're right. Gonna buy more.", "score": 6, "replies": [{"body": "Come join us in r/wallstreetbets", "score": 8, "replies": [{"body": "On my way.", "score": 1, "replies": []}]}]}]}, {"body": "I bought a few too 😆 Oh well, it’s just money.", "score": 2, "replies": []}]}, {"body": "Bought 8p 4/3 today and currently up 28%. Will probably try to sell tomorrow or Thursday - whenever the next drop is. I expect another rally when the stimulus package rolls out then some more drops once that hype is gone.", "score": 1, "replies": []}, {"body": "That's great DD. Definitely worth looking at puts.", "score": 0, "replies": []}, {"body": "People are going back to work 🦅🇺🇸", "score": -14, "replies": [{"body": "Are you retarded?", "score": 16, "replies": [{"body": "A country is not supposed to be shutdown 🇺🇸🦠🦅", "score": -16, "replies": [{"body": "You answered my question. What are your moves this week?", "score": 6, "replies": [{"body": "I like OPs play it makes total sense... the only thing I feel relatively safe with is long oil calls. Seems like politicians are really pushing people to go back to work though? We'll see what happens if the bodies start stacking up. [[[Inflation S👀n]]]", "score": -4, "replies": []}]}]}]}]}]}
{"title": "DD you should not believe—it’s not even very good", "selftext": "tl;dnr:\n\n-This is stupid and wrong and if you follow it you will be poor bc my only good trades came from copying WSBgod. \n\n-Of all the stocks that have been punished restaurants are the most likely to make up lost business. And some touched lows 500% off recent highs. \n\n-The dead cat bounce won’t be proportional. Punished sectors that have a glimmer of hope, like restaurants, will vastly outperform travel stocks and retail.  \n\n-Next Monday buy 250 SPY calls, 52.5 VIX puts and a basket of restaurant calls for the dead cat bounce. \n\n-Hide gains from your wife’s personal trainer. \n\n\nThe sheer fact that I’m typing these words means that COVID19 will destroy the world economy. This analysis will be 10O% wrong and if you do the opposite you will swim in tendies behind an iron gate to keep out the zombie infected boomers who want to take you down with them. \n\nI’m basing this on the (wrong) belief that we will have a temporary bottom after the jobless numbers on Thursday and stimulus passage Friday if we haven’t had one already. Smart people have called 210-215 on SPY for a run back to 270-280 in the short term, so let’s use that scenario. I’m also baking in the possibility that one of three things happens: 1.) One of the drug trials due in early April gives us a treatment and restrictions will be loosened as we ramp up production; 2.) The curve flattens China style and a percent increase in new cases peaks in 10 days (the dude who nailed the China numbers early on made this prediction); or 3.) Trump says fuck it and we go to a tiered lockdown that is focused on hot spots and vulnerable populations. \n\nIf those things happen (and again I must remind you they won’t) we are looking at enormous pent up demand from people desperate to leave their houses with that sweet sweet stimulus money in their pockets. The relief will make people feel good. The weather will make people feel good. The cabin fever will make people want to be out and the stimulus money will give them the means to justify it, at least for a while. This seems like common sense psychology, and because it seems so logical it’s doubly incorrect because the market will not be rational. \n\nThat leads us to restaurant stocks, which have been clobbered. This dead cat bounce won’t be proportional. And unlike travel stocks restaurants have the ability to make up some lost business. No one will be making 4 trips to Disney to make up for the 1 they cancelled, but they may shove their faces full of Texas Roadhouse a few extra times. \n\nHere are some brand leaders/recent highs/current prices:\n\nChipotle: 933.84/588.71\nDarden (Made me their bitch on my puts): 124/41.03\nStarbucks: 93.75/56.55\nTexas Roadhouse: 71.52/39.35\nDave and Busters: 48.80/9.96\nCAKE: 42.52/15.71\n\nIf you assume a 50% bounce from here that takes PLAY, for example, to $15. Still 225% off of their recent highs. Volume is thin right now but last price for the 7/17 $15 call was $1.45 (bid ask is .30/4.30 which is scary AF) and makes me hesitate\n\nDon’t do this. It won’t work. But it kinda seems like it could. If I do it you should  buy puts, because I am dumb and only make good trades when WSBgod tells me what to do.", "id": "fnwbz6", "created_utc": 1585013378.0, "score": 37, "upvote_ratio": 0.73, "num_comments": 65, "comments": [{"body": "[deleted]", "score": 118, "replies": [{"body": "I couldn’t even get past the first line.", "score": 7, "replies": []}]}, {"body": "A lot of what you are saying makes a certain amount of sense, that’s what I don’t like about it. Things don’t make sense right now. \n\nAlso, why Monday? Why not Friday?", "score": 31, "replies": [{"body": "Not sure I would want to hold anything over the weekend.", "score": 7, "replies": [{"body": "Sure as fuck won't be holding calls overnight, let alone the weekend.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "puts on depends", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "are you retarded? but yes, i bought a fuck ton of ammo, and yes aint no cops containing me", "score": 3, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "I like the cut of your jib", "score": 5, "replies": []}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "It's the 1000% scale, get with the program.", "score": 7, "replies": []}, {"body": "I read to that and then didn't bother to read any further.", "score": 2, "replies": [{"body": "This is a fair point. Return needed from low to get back to recent high is what I meant.", "score": 2, "replies": [{"body": "So you meant 80% below their recent highs? Jesus you're an autist of the highest order", "score": 1, "replies": [{"body": "Let me carry the 1 and get back to you.", "score": 2, "replies": []}]}]}]}]}, {"body": "Please add a graph.", "score": 9, "replies": []}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 17, "replies": [{"body": "attaboy", "score": 1, "replies": []}]}, {"body": "To quote a mod who replied to me recently, does this post come in audio book format? I have a spare hour of commuting time in the morning.", "score": 10, "replies": [{"body": "Something in my life needs to be long", "score": 17, "replies": [{"body": "Thicc is where it's at.", "score": 3, "replies": []}]}]}, {"body": "> buy calls\n\nAnd for this reason, I'm out", "score": 3, "replies": []}, {"body": "Can’t use China as the beer flu ideal case to aspire for because their numbers are faker than my wife’s tits", "score": 5, "replies": [{"body": "Will trade one graph of China’s curve for pics.", "score": 1, "replies": []}]}, {"body": "Love it.", "score": 3, "replies": [{"body": "Hate it.", "score": 1, "replies": []}]}, {"body": "That makes sense, but in reality people won't be going out like normal until mid-late summer time.  Then yes, new cases will have gone down, lots of people recovered from corona and the worse was over. People will be happy and spend money. So you think restaurants could go up now? We will have to go through some real shit and all of the market still has room to drop. I believe there will be a run up soon, but I don't think it has anything to do with any business that draw crowds. \n\nI do also believe there will be a mid-late summer rally for weeks. We will all be happy, being back out and whatnot. But, then case will start to flare up in certain areas and those cities/areas will go on some sort of lockdown, but wouldn't effect the whole country by early fall. Then the late fall winter time, the second wave comes, and a huge second market selloff. So, do your best to make money now so you got some to trade all year.", "score": 3, "replies": [{"body": "What are your thoughts on profiting from current run up? SPY?", "score": 2, "replies": [{"body": "First, I am going sell my fucking puts I bough right after the senate vote today, that was weird. Then I might just watch tomorrow, might through some small day trades in this week, but probably not holding anything over night.", "score": 1, "replies": [{"body": "I get FOMA on this bounce bc I feel like it’s short lived. Mainly cash other than EWZ puts. But gotta force myself to wait until I see Thursday’s numbers.", "score": 2, "replies": [{"body": "I feel ya, I might get foma too and throw a big trade if it looks right. But, I don't want to fuck it up and not have money for puts later on.", "score": 2, "replies": [{"body": "This may be a justified FOMO. Lotta those restaurant stocks are up 30% today and the 250 spy calls about doubled. FML.", "score": 1, "replies": [{"body": "You win some, you lose some, but you live....you live to fight another day", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "A lot of restaurants already had 50% bumps since last Wednesday.", "score": 3, "replies": []}, {"body": "Ok most of em don't like it,  I'm in !", "score": 3, "replies": []}, {"body": "I read this all. I wasn't bored.  It kind of makes sense to me.  I could totally see upscale franchise eateries benefitting from a \"we're not gonna die!\" consumer rally.\n\nSolid play", "score": 5, "replies": [{"body": "And seriously thank you for actually reading it.", "score": 4, "replies": []}, {"body": "User name checks out.", "score": 2, "replies": []}]}, {"body": "Well my take on the future from here is that Basically the treasury is open, I think defense stocks are gonna take off from here as we pissed in the face of the world with our money printer...", "score": 2, "replies": []}, {"body": " Chipotle: 933.84/588.71 Darden (Made me their bitch on my puts):  124/41.03 Starbucks: 93.75/56.55 Texas Roadhouse: 71.52/39.35 Dave and  Busters: 48.80/9.96 CAKE: 42.52/15.71 \n\n&#x200B;\n\ncan u explain what these fucking numbers are? are they 52 week high/lows?", "score": 2, "replies": [{"body": "Recent high and current price. So DRI recent high was $124 and eod was $41.03", "score": 5, "replies": []}, {"body": "Shhhh shhhhhhhh. Go back to licking the pretty window.", "score": 2, "replies": [{"body": "fuck u say to me u obese retard", "score": 2, "replies": [{"body": "I’m just giving you fuel for ongoing complaints about aggressive betas with huge tendies.", "score": 2, "replies": []}]}]}]}, {"body": "this guy doesn’t fuck", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "People do crazy things in commercials, like eat at Arby’s.", "score": 2, "replies": []}]}, {"body": "It's ok guys I bought a put on Delta today. When your 401k has restored all of its lost value and gained 50% by the time my put expires you're welcome.", "score": 3, "replies": [{"body": "Thank you for your sacrifice", "score": 3, "replies": []}]}, {"body": "Yeah, no", "score": 1, "replies": []}, {"body": "Sir, I am a sandwich", "score": 1, "replies": []}, {"body": "Tldr", "score": 1, "replies": []}, {"body": "yeah you're going to get wrecked by IV crush with your calls. bad idea.", "score": 1, "replies": [{"body": "That’s the only part I really 100% believe. Short VIX.", "score": 1, "replies": [{"body": "IV crush on VIX too bro", "score": 1, "replies": []}]}, {"body": "So then what’s the smart play? Stay cash gang for the run up and then buy puts again at the peak?", "score": 1, "replies": []}]}, {"body": ">Of all the stocks that have been punished restaurants are the most likely to make up lost business\n\nWhy?\n\nIn 6 months I can take the vacation that I was planning to take this month, but I'm not likely to be eating out every day for weeks just to make up for all the restaurant food missed out on.\n\nI'm gonna need an explanation of why you think restaurants are more likely to make up lost business.", "score": 1, "replies": [{"body": "Eating out is a cheaper escape, though still a luxury. Instant gratification for boredom. You may take that trip in 6 months. I bet your grandma goes to Olive Garden before then.", "score": 4, "replies": [{"body": "Grandma dead- beer flu", "score": 3, "replies": []}, {"body": "Yeah she will go back to eating at olive garden every Sunday afternoon, but she won't be eating there every day to make up for lost time.", "score": 1, "replies": [{"body": "DRI up 25% since I typed this.", "score": 1, "replies": []}]}]}]}, {"body": "This is my prediction: markets return to normal for a short period of time and it will not hold. 2 weeks max. The worse is yet to come according to my wife (doctor) who is currently in Brazil, I came home at the worst time. She mentioned they’re warning next two weeks will be terribly worse. Confirmed this watching a documentary by Vice where the girl, Medical Resident in New York says the exact same shit! Posted on the 20th! Edit: coincidence they both say this?\n\nSo SPY up to $230, UVXY $20. TVIX $50\n\nNews comes out. More deaths and scary WWZ crap. \n\nSPY $150-190. UVXY $110. TVIX $600\n\nAsk u/wsbgod for DD. He only wins. I always lose.", "score": 1, "replies": []}, {"body": "Where does wsbgod tell you what to do", "score": 1, "replies": []}, {"body": "I can't shake the feeling that once Americans have been conditioned to see going out to restaurants bars etc as a source of contagion, they're not gonna want to just head out when the epidemic is still dominating headlines.\n\nWe're going to still be seeing exponential growth in major population centers on April 1.  It's going to take a little while for people to resume normal activities even if Trump lifts the shutdowns.  That's a drag on recovery.  However, maybe it doesn't matter since stocks are pricing in how things look months down the line.", "score": 1, "replies": []}, {"body": "lmaooo", "score": 1, "replies": []}, {"body": "Dude restaurants aren't coming back anytime soon. After everyone recovers from beerflu who in the hell is going to have money to go out to a restaurant? If anything cloud kitchens and delivery services are major market players but dine in is on the back burner for a while.\n\nSource: I just moved in back of a C.B. Hannegan's\n\nHolding puts, [https://imgur.com/a/IKoBmSd](https://imgur.com/a/IKoBmSd)", "score": 1, "replies": []}, {"body": "We are all now stupider for having read this.", "score": 1, "replies": []}]}
{"title": "Instead of puts on TSLA how about Puts and shorts on Oil and Gas? They are definitely going down.", "selftext": "The best way to make money on Tesla could be buying putts and short-sales on Oil and Gas...   When this is all over, all the money will leave Oil and Gas and the smart money will go straight to Renewables and EV's.  Oil and Gas were already failling for the last decade... They are now doomed with or without a bailout.  A bailout would essentially be throwing money away.  \n\nThe great shakeout has begun. The market as a whole is down ~ 30%. But Oil majors BP & Exxon are down 50-70%. When investors come back to the market they won’t forget. The energy world will look a whole lot different after this is all over   https://www.ft.com/content/7afb4c04-6d58-11ea-89df-41bea055720b?", "id": "fo724t", "created_utc": 1585064030.0, "score": 18, "upvote_ratio": 0.68, "num_comments": 72, "comments": [{"body": "Sir, this is a COVID-19 drive through testing centre", "score": 73, "replies": [{"body": "Yeah ill take a retard test to go", "score": 15, "replies": []}, {"body": "Pickup your new Tesla and a COVID test to go.  I like It!  $TSLA calls it is.", "score": 5, "replies": []}, {"body": "hello I sneezed this morning what time will I die?", "score": 2, "replies": []}, {"body": "what's the menu?", "score": 1, "replies": []}]}, {"body": "Think it's time to buy long calls now.\n\nToo many WSB users going puts.", "score": 16, "replies": [{"body": "$USO calls for next year are cheap!  Capex is being reduced by everyone. Seems like free money!", "score": 1, "replies": [{"body": "I feel oil still hasn't hit the bottom.\n\nIt's up to Saudis and Russia.", "score": 3, "replies": [{"body": "It might not be at the bottom, but it isn't near the top...\n\n$XOM Jan $40C", "score": 3, "replies": [{"body": "If I did a oil play today, Chevron would be it. They have the best balance sheet and cut capex.", "score": 3, "replies": []}]}, {"body": "You were spot on,  way below zero today... We are witnessing history.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 32, "replies": [{"body": "It's actually an amazing time to buy in.", "score": 13, "replies": [{"body": "Way down today on Oil... minus 30..", "score": 2, "replies": []}, {"body": "I do expect a bailout bounce, then it is death going forward.", "score": -4, "replies": [{"body": "Oil can't remain below $20 for very long.  It's just not feasible unless Russia and KSA want to continue deplete their war chests.", "score": 2, "replies": [{"body": "Today it is way below zero!!!", "score": 1, "replies": []}]}, {"body": "( X )", "score": 1, "replies": []}, {"body": "The world isn’t going to stop using oil all of the sudden. It’s especially not going to stop using oil when it’s vastly cheaper than everything else out there. The transition will take a long time. Hard to justify a short position that requires at least 5+ yrs to hit big.", "score": 1, "replies": [{"body": "Small changes to supply and demand of this global commodity send their prices reeling, they are going to be facing constant downward pressure on the demand side.    Extrapolate these trends:  \n\"Renewable capacity has tripled in past five years, even faster growth than the ‘dash for gas’ of the 1990s\" [https://amp.theguardian.com/environment/2018/nov/06/uk-renewable-energy-capacity-surpasses-fossil-fuels-for-first-time](https://amp.theguardian.com/environment/2018/nov/06/uk-renewable-energy-capacity-surpasses-fossil-fuels-for-first-time?fbclid=IwAR2YY5areGbL3pkTwk_TT7_9IKko0UQYASZIogp4r2IG3edO8rFk0jO90UY)  \n\n\nSolar photovoltaic (PV) and wind costs have dropped an extraordinary 88% and 69% since 2009, respectively. Meanwhile, coal and nuclear costs have increased by 9% and 23%, respectively. [https://www.forbes.com/sites/energyinnovation/2018/12/03/plunging-prices-mean-building-new-renewable-energy-is-cheaper-than-running-existing-coal/#e87796231f31](https://www.forbes.com/sites/energyinnovation/2018/12/03/plunging-prices-mean-building-new-renewable-energy-is-cheaper-than-running-existing-coal/?fbclid=IwAR1hw6_3x2MJic0VtK0o5iCpFWRIdSi8opnyCkcz5j_fTguxNVaFJ_1MSWc#e87796231f31)", "score": 1, "replies": [{"body": "Coal will absolutely disappear one day. But not because of solar and wind in all places. Here in Ohio we have a massive amount of natural gas which could easily meet the power demands coal is currently fulfilling. But solar is out of the question. Wind is good in some spots, but it can’t be scaled across the state. So the transition will eventually happen, but that bridge between coal and renewable may be a lot longer (or shorter!) than anybody thinks. So in the meantime your money is tied up in a long term short position. You could make a lot more money during that bridge time doing something else and then revisit the death of oil when it’s a little more clear what the future looks like. Time value of money is a thing that cannot be dismissed.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": " \"The dominance of fossil fuels has come under growing pressure from clean power sources in recent years. At the start of the renewables revolution, technologies such as solar and wind were much more expensive than coal and gas, but a tipping point has been reached.\" [https://www.forbes.com/sites/mikescott/2020/03/16/clean-power-crowds-out-coal-as-costs-reach-tipping-point/?](https://www.forbes.com/sites/mikescott/2020/03/16/clean-power-crowds-out-coal-as-costs-reach-tipping-point/?fbclid=IwAR3Wae6qaqro0TSqlmZjMCL_v9wxPdpEgWfZSJ044VNcVYU-o52YJLOtuRI#3211246410e3)", "score": 1, "replies": []}]}]}]}, {"body": " China India, Countries all over Europe are phasing out Gas cars...  They are mandating that this happens...  The Global Oil lobby is getting its ass kicked.  \" \n\nThe news comes hot on the heels of the [Scottish government’s announcement](https://www.weforum.org/agenda/2017/09/scotland-wants-to-phase-out-petrol-and-diesel-cars-by-2032/) that it plans to phase out petrol and diesel cars by 2032.\n\nHere are some of the other countries that are gearing up to replace fossil-fuel powered cars.\n\n**The UK**\n\nIn July, the UK government unveiled plans to [halt the production of new petrol and diesel cars](http://www.independent.co.uk/news/uk/politics/uk-petrol-diesel-cars-stop-production-2040-climate-change-plan-a7842056.html) from 2040.\"  [https://www.weforum.org/agenda/2017/09/countries-are-announcing-plans-to-phase-out-petrol-and-diesel-cars-is-yours-on-the-list/](https://www.weforum.org/agenda/2017/09/countries-are-announcing-plans-to-phase-out-petrol-and-diesel-cars-is-yours-on-the-list/)", "score": 1, "replies": []}]}]}]}, {"body": "minus 37 dollars a barrel,  below 0,", "score": 1, "replies": [{"body": "So what's your gains then? You make that big short money when USO went from 5 to 3.80? \n\nLook at June's contract price and further out. \n\nBrent is still $26. \n\nLike I said, the time to short it was spoiler alert, before it dropped like a brick.", "score": 1, "replies": []}]}]}, {"body": "Fuck you im not subscribed to that", "score": 14, "replies": []}, {"body": "Fuck you because I just threw my whole account into 3/27 400", "score": 8, "replies": [{"body": "Oof.", "score": 2, "replies": [{"body": "im 350", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 9, "replies": [{"body": "I remember $6.75/bbl as a kid growing up in west Texas. Oil can always go lower.", "score": 6, "replies": []}, {"body": "Not the commodity, but the upstream and midstream co's that produce, transport, and retail it...  Though there is even talk of negative pricing of the commodity    \n\n# The oil market's threats combine 9/11 with the financial crisis - and could turn prices negative, analyst says[https://markets.businessinsider.com/news/stocks/oil-price-could-go-negative-coronavirus-opec-war-boosts-supply-2020-3-1029009784](https://markets.businessinsider.com/news/stocks/oil-price-could-go-negative-coronavirus-opec-war-boosts-supply-2020-3-1029009784)", "score": 2, "replies": [{"body": "But shorting the individual US retailers sound like a reasonable play; although, prices have already fallen like 50-70%", "score": 2, "replies": [{"body": "extrapolate these trends:  Wind costs have fallen by 67% since 2009 while utility-scale solar has dropped by 86% since that time, according to the financial adviser, Lazard. Source: https://www.lazard.com/media/450337/lazard-levelized-cost-of-energy-version-110.pdf\n\nLithium battery costs have fallen 18% in the last year, and have fallen 85% since 2010!!! (Source: Bloomberg)\" https://www.bloomberg.com/news/videos/2018-12-21/bnef-brief-lithium-battery-prices-fall-18-percent-video?", "score": 1, "replies": [{"body": "Your logic makes sense, and I agree that green energy will be used more in the future.\n\nMy point is that you're fighting against very rich and powerful industries. Big oil/gas is also trying to get into the greener energy market. I believe trump has cut solar (or just green energy) subsidize out while providing them for coal (or maybe it was oil). Trump and other politicians will have a heavy bias for giving these oil giants handouts over small green energy startups.\n\nI still believe that betting against all of them is not worth the risk/reward. Choosing the worst US oil provider and shorting it is a different story.", "score": 2, "replies": []}]}]}]}, {"body": "more than 30 below zero today!!!", "score": 1, "replies": []}]}, {"body": "you wanna short oil? you do it after russia and saudi have make up sex, not now lmao.", "score": 7, "replies": [{"body": "So a longer short then...    It is definitely going to get killed,   Not only the economics of renewables and EV's coming at them, but we have not seen the worse of Climate, and more and more people are waking up pissed off at the hot weather. Policy is going follow much stronger against Fossil fuels...", "score": 1, "replies": [{"body": "\"longer short\", you're talking like 10 years then?", "score": 1, "replies": [{"body": "2 to 5 tops.  Smart money is bailing on them and moving to renewables.  Their upside, if any,  is way too risky..", "score": 1, "replies": [{"body": "extrapolate these trends:  Wind costs have fallen by 67% since 2009 while utility-scale solar has dropped by 86% since that time, according to the financial adviser, Lazard. Source: https://www.lazard.com/media/450337/lazard-levelized-cost-of-energy-version-110.pdf\n\nLithium battery costs have fallen 18% in the last year, and have fallen 85% since 2010!!! (Source: Bloomberg)\" https://www.bloomberg.com/news/videos/2018-12-21/bnef-brief-lithium-battery-prices-fall-18-percent-video?", "score": 1, "replies": []}]}]}]}, {"body": "it was below zero today,, 30 dollars are more below...", "score": 1, "replies": []}]}, {"body": "I get my oil from my log of fat shits and gas from my anus", "score": 3, "replies": []}, {"body": "I will sell my oil calls and stocks when the trade war is over", "score": 3, "replies": []}, {"body": "Don’t fuck with commodities unless you’re an expert. They look simple but it’s a different game to equities, it’s very volatile, very specialist and if you don’t know what you’re doing you’ll end up getting raped.", "score": 2, "replies": [{"body": "agreed,  This commodity is going to be volatile...  Talking about the companies, producer midstream etc..", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": " This was all happening before the virus hit China: \"A bankruptcy boom has hit the oil and gas industry, and it’s just getting started. Investors have lost their appetite for shale, and energy debt has become among the least desirable in the market. The industry has been teetering on the verge of mass hysteria for much of 2019 as a record number of energy companies folded. \"  \n[https://oilprice.com/Energy/Energy-General/2020-The-Year-Of-The-Oil-Bankruptcies.html](https://oilprice.com/Energy/Energy-General/2020-The-Year-Of-The-Oil-Bankruptcies.html)", "score": 2, "replies": []}, {"body": "One of the highest performing ETF's of 2019 was a reverse Gas ETF:    \"Bear, inverse, and clean energy ETFs seem to be the only energy ETFs getting some joy in this market, and GASX is no exception.  \n \n\nGASX is designed to take advantage of both event-driven news as well as long-term trends in the natural gas industry.  \n\n\nWith a juicy nearly 130% return over the past 12 months, natural gas bears have been killing it with this ETF. By the same token, they could find themselves in trouble if gas prices suddenly reverse course.\"   [https://oilprice.com/Energy/Energy-General/5-Niche-Energy-ETFs-Youve-Probably-Never-Heard-Of.html? ](https://oilprice.com/Energy/Energy-General/5-Niche-Energy-ETFs-Youve-Probably-Never-Heard-Of.html?fbclid=IwAR22buVrF3U91-rUBDxmjJsNFWTl5WdaZ2RjJUVDDMPtbGF2-7Ohl_rfyFY)", "score": 1, "replies": []}, {"body": "when oil are at around 10-15, I would all in and sell bloody puts on uso.", "score": 1, "replies": [{"body": "The commodity price is going to be volatile, it may swing up to 200 from here and then back down again.  Companies cant have certainty here, there is too much risk.", "score": 1, "replies": []}, {"body": "now might be the right time, it was more than 30 dollars below zero today...", "score": 1, "replies": []}]}, {"body": "Don't be silly [BRRRRRRRRRRRRR](https://brrr.money/)", "score": 1, "replies": []}, {"body": "Gas and diesel are about to get really really cheap.  Cheap energy discourages development on other, more expensive, options for awhile.", "score": 1, "replies": []}, {"body": "That's beautiful on paper.\n\nIRAN HAS JOINED THE CHAT: \"fuck you again\"\n\nCNBC: \"oil is at 60$ a barrel and shows no sign of stopping. How could that retard OP not see this coming? Must fucking short sighted and unable to look at history at fucking all. Probably gay too , back to you jim\"", "score": 1, "replies": []}, {"body": "I can’t wait to hop in my solar powered fighter jet or my solar powered cargo ship. Fuck you are stupid. Please stop posting.", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}
{"title": "🐻 The science shows this is a FALSE RECOVERY! Read this thread from the Director of Johns Hopkins Center for Health Security.", "selftext": "[https://twitter.com/T\\_Inglesby/status/1242232846900756482](https://twitter.com/T_Inglesby/status/1242232846900756482)\n\n**Read the thread above by Tom Inglesby, Director Johns Hopkins Center for Health Security** \n\nTl;dr... because the infectiousness rate of coronavirus is so high, it is inevitable that without social distancing the hospitals will experience surge capacity where people who could have been saved can't be because the doctors and nurses are too busy, exponentially increasing the mortality rate.\n\nDoing a quarantine mitigates the spread and buys time to supply hospitals with masks/PPE and beds to handle the medical demand.  \n\n\\--------- \n\nSo analyzing that info, by not doing a quarantine for a few weeks, it actually risks an even greater drop in the stock market and even worse panic. \n\nPsychologically, it seems many non-scientist experts are quite literally in a grief cycle and in the denial stage trying to have their cake and eat it too and retreating and putting their head in the sand and/or fingers in their ears \"la la la la la\"... AMERICA NEEDS A THREE WEEK QUARANTINE TO SLOW THE SPREAD!\n\nI need to get more SPY July 70 puts because I no longer trust our experts to think logically-- granted I don't have the inside perspective and if that's true sorry for making fun but freedom of speech and I'm seriously worried-- but I don't trust this now because it doesn't make sense to me.  \n\nAs a country we have to not let the alleviation of temporary turbulence crash the system with optimism that is not rooted in science.", "id": "fo85w8", "created_utc": 1585067807.0, "score": 136, "upvote_ratio": 0.89, "num_comments": 70, "comments": [{"body": "I smoked pot with Johnny Hopkins.", "score": 69, "replies": [{"body": "You don’t know anybody named Johnny Hopkins", "score": 17, "replies": [{"body": "It was me, Johnny Hopkins, and Sloane Kettering. And we were blazin that shit up every day.", "score": 36, "replies": []}, {"body": "I actually do. He was a pretty cool dude. Didn't smoke the reefer though. More of a beer boi.", "score": 3, "replies": []}]}]}, {"body": "Bear gang leader", "score": 75, "replies": []}, {"body": "False recoveries can still make you rich", "score": 58, "replies": [{"body": "Not if you went all in yesterday before close.", "score": 31, "replies": [{"body": "I went in big on puts yesterday too but I bit the bullet and went in again today with some lovely TVIX at $250", "score": 8, "replies": []}]}, {"body": "Gaming a dead cat bounce requires 3XL-size balls but if you somehow pull it off the tendies will be absolutely insane", "score": 9, "replies": [{"body": "I made 400% on my SPY 250c 3/27s today.\n\nWas literally a last ditch YOLO after I lost 75% over the past 3-4 days", "score": 9, "replies": [{"body": "Same then dumped back into 6/19 spy puts", "score": 4, "replies": []}]}]}]}, {"body": "I’m in Oregon, we have a shelter in place mandate. It’s great, people can’t leave their house. Unless they want to go to work for most jobs, a coffee shop, on a hike, or pretty much fucking anywhere with an excuse. \n\nI was more nervous to be in the high school hallway without a hall pass than I am to go try to play golf today.\n\nPuts on everything...we compare our infections to China? They literally welded people into their homes. Our coffee shops are open.", "score": 26, "replies": [{"body": "It's mass denial.  So that tells me they are not self-actualized which means prominent people will be prone to actual panic.  Not good.", "score": 8, "replies": [{"body": "Yea and if you just watched the Town Hall, they’re basically not even saying you need to stay at home. It’s just about being a little bit more careful than normal. The guidelines are terrible.", "score": 5, "replies": []}, {"body": "Naw. I think it's just majorly oversold.  Prices aren't going to zero like the previous trajectory was showing.", "score": -1, "replies": []}]}, {"body": "China only welded quarantine violators into their homes.  You had to be caught outside willfully violating the quarantine.", "score": 1, "replies": [{"body": "The point still stands. They actually enforced quarantines. We have a president urging people to do the opposite.", "score": 5, "replies": []}]}]}, {"body": "Hydroxychloroquine is the new tide pod for boomers.", "score": 46, "replies": [{"body": "My grandma was prescribed that shit for her arthritis long long ago and she went blind. Died years later with arthritis and no vision.  True story.", "score": 16, "replies": [{"body": "Sorry to hear that, man. RIP grandma.", "score": 5, "replies": []}, {"body": "It kills your vision if you take it for 2+ years.   If it actually works for coronavirus (a big if), you won't notice any tiny vision deficits.", "score": 3, "replies": [{"body": "Good news for my Puts that the dumb ass in Arizona died from taking it.", "score": 1, "replies": []}]}, {"body": "Damn, back in my day we just went blind from masturbating.", "score": 2, "replies": []}]}, {"body": "Hydroxycut?", "score": 7, "replies": [{"body": "with ephedrine", "score": 3, "replies": []}]}]}, {"body": "There's a quarantine? Pretty sure the people that were still going to work, are still going to work. US is fucked, wait until all the warehouses become hotspots, and Amazon get blamed for spreading it to homes on cardboard boxes.\n\n&#x200B;\n\nPuts on ALL a month out", "score": 10, "replies": [{"body": "Yeah I am debating April also.", "score": 1, "replies": []}]}, {"body": "Tired of stupid science bitches", "score": 14, "replies": []}, {"body": "Yeah but line go up", "score": 4, "replies": []}, {"body": "bookmark these\n\n [https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6) \n\n&#x200B;\n\n [https://www.worldometers.info/coronavirus/](https://www.worldometers.info/coronavirus/)", "score": 6, "replies": []}, {"body": "[ \"According to a Goldman Sachs analysis of anecdotal reports from 30 states on the number of applications filed the first few days of the week, initial claims for unemployment benefits nationwide could rise to a record 2.4 million.\nGoldman economist David Choi said in a research note that a disproportionate share of claims may have been filed early in the week or that his sample was biased toward states with unusually large increases in claims.\nBut, he said, claims would still total more than 1 million, by far the highest on record.\"](https://www.freep.com/story/news/local/michigan/2020/03/22/michigan-jobless-past-108-000-covid-19/2894660001/)", "score": 4, "replies": []}, {"body": "Yes Yes Yes... but it's priced in", "score": 9, "replies": [{"body": "Your mom is priced in.", "score": 4, "replies": [{"body": "She's overbought", "score": 8, "replies": [{"body": "Hey that’s my wife you’re talking about", "score": 5, "replies": [{"body": "You need to hedge with a mistress", "score": 1, "replies": []}]}]}, {"body": "Her and everything she does", "score": 1, "replies": []}]}]}, {"body": "Well it'd be over quicker, there'd just be more deaths.", "score": 3, "replies": []}, {"body": "I'm at work right now.\n\nWould you like a Frosty with your meal?", "score": 2, "replies": []}, {"body": "Who is Johnny Honkins?", "score": 2, "replies": [{"body": "Billy Squawkins cousin", "score": 2, "replies": []}]}, {"body": "Will bears ever stop coping?", "score": 2, "replies": []}, {"body": "RESEARCH EVENT 201!!!!!!!!\n\n\nhttp://www.centerforhealthsecurity.org/event201/", "score": 1, "replies": []}, {"body": "Who cares we all gonna die anyway", "score": 1, "replies": []}, {"body": "> putting their head in the sand and/or fingers in their ears\n\nOr shoving Big Macs in their fat mouths after their boss tells them oUr mArsHmAlLowS aRE esSeNTiAl.", "score": 1, "replies": [{"body": "On a side not you can actually make mcdonalds healthier by taking off the bun and asking for it to be wrapped in lettuce.", "score": 1, "replies": [{"body": "Instructions unclear. Lettuce wrapped bun is disgusting.", "score": 1, "replies": []}]}]}, {"body": "The only thing false is your manhood and dignity", "score": 1, "replies": [{"body": "Actually if I had no manhood and dignity I would have been saying it's a nothingburger non-stop since January, loaded up on VIX calls or 3x leveraged VIX calls and continued to offer bad advice and making arguments counter to the safety of the world which would have contributed to coronavirus saturating the planet.  You are not as smart as you think you are.  I am trying to help people... I would much rather get calls on the economy.\n\nEdit:  I bet you are so low-awareness as to think the \"It's just the flu, bro\" meme means the person saying the meme thinks it's actually the flu-- it's sarcasm.  It's obviously not the flu at all.", "score": 1, "replies": [{"body": "Who the fuck is letting you people in", "score": 4, "replies": [{"body": "Both you mofos are in denial.", "score": -2, "replies": []}]}]}]}, {"body": ">it is inevitable that without social distancing the hospitals will experience surge capacity\n\nhydroxychloroquine has entered the chat", "score": 1, "replies": [{"body": "Smooth brained autist entered the bungalow", "score": 9, "replies": [{"body": ">Smooth brained autist\n\nthat's a lot of words to say 'bear'", "score": 2, "replies": []}]}, {"body": "Lmao you motherfuckers believe literally anything.", "score": 6, "replies": [{"body": "You better believe my high sex drive and quarantine will make me pound that ass without mercy.", "score": 1, "replies": [{"body": "What?  I mean, okay. But, what?", "score": 2, "replies": []}]}, {"body": "Yeah i believe the most cited scientist in the field\n\nHe litteraly said fuck it i'm not waiting for french's equivalent of FDA and treats EVERY covid positive case with it + an antibiotic\n\nhe and his team found out that even asymptomatic people can have lung tissue damage\n\nhe's highly controversial in france right now because he's an ass and quite arrogant but the man's a fucking specialist, probably the only one who knows what he's talking about compared to fucking journalists or nurses", "score": -1, "replies": [{"body": "\"Most cited\" at a time of global crisis. \n\nBruh.", "score": 3, "replies": [{"body": "I don't have the website right now but you can actually look him up, he's the most cited as in he appears in a fuckton of research, not cited RIGHT NOW you fucking retard\n\nProfessor Didier RAOULT", "score": 4, "replies": [{"body": "Preliminary findings in other places confirm HCQ + Zpack = cure\n\nNot an official study:\n\n [https://docs.google.com/document/d/1SesxgaPnpT6OfCYuaFSwXzDK4cDKMbivoALprcVFj48/mobilebasic?fbclid=IwAR1mdqaWAxiO4F0w7m\\_7Hx9haptUOlLYubYr1pJiNMlmOtdhbd23IrjZtn8](https://docs.google.com/document/d/1SesxgaPnpT6OfCYuaFSwXzDK4cDKMbivoALprcVFj48/mobilebasic?fbclid=IwAR1mdqaWAxiO4F0w7m_7Hx9haptUOlLYubYr1pJiNMlmOtdhbd23IrjZtn8)", "score": 4, "replies": [{"body": "Yup, his study isn't official as well, he's done it with like 36 patients he had on his hands\n\nMost of them were cured in days with no trace of covid in them afterwards", "score": 2, "replies": []}, {"body": "The only problem I have is that HCQ has been known about for a while, so why are we just now hearing about it if it works so well? Makes no sense.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Okay zoomer", "score": 1, "replies": []}]}]}
{"title": "Tendies incoming", "selftext": "https://imgur.com/a/LwWoYKL\n\nWas cash and SVXY gang. Sold my SVXY and bought 215K worth of puts on SPY and TSLA this morning after opening RH and wondering if I was hallucinating the massive bounce. Down 15K atm, but not even worried. No dimension in which this holds through Thursday at the latest. \n\nP.s.: my account as a whole is up 800% in the last 3 months, and 550% all time \n\nPositions: literally in the pic", "id": "foefbi", "created_utc": 1585088099.0, "score": 101, "upvote_ratio": 0.96, "num_comments": 69, "comments": [{"body": "Post goulash recipe or ban.", "score": 62, "replies": [{"body": "Where’s the gabagool?!", "score": 7, "replies": [{"body": "If the dressing is not on the side, I send it back.", "score": 3, "replies": []}, {"body": "Not sure why'd you put deli meat in that... but am intrigued.", "score": 2, "replies": []}, {"body": "eyy", "score": 1, "replies": []}]}, {"body": "Explain what goulash is, or ban.", "score": 14, "replies": [{"body": "Its where you go when you die on CoD Warzone.", "score": 19, "replies": []}, {"body": "https://en.wikipedia.org/wiki/Goulash", "score": 10, "replies": []}, {"body": "It's where the Soviet Union sent capitalist Russians in the cold war", "score": 9, "replies": [{"body": "Ha ha ha! It's fair to say that this is where people wish they were when presented with a bowl of goulash.", "score": 3, "replies": []}]}]}]}, {"body": "The retardedness of this sub never ceases to amaze me.  And I'm not talking about your positions.  \nHow the fuck you going to have 215k in your account and still using Robin Hood?", "score": 14, "replies": [{"body": "Honestly, I keep it there for 2 reasons:\n1. In this market I don't want to be forced to the sidelines while my funds transfer\n2. I think it's funny to intentionally piss other successful traders off by using this shitty platform", "score": 27, "replies": [{"body": "It's all fun and games till your platform crashes and your tendies get overdone.", "score": 4, "replies": []}, {"body": "Wiring some of it to a TD account is always an option.", "score": 2, "replies": []}]}]}, {"body": "**I'm with ya bro! Only 10k puts on SPY tho. We ride together, we die together bad boys for life!**", "score": 21, "replies": [{"body": "same. hope half of usa is unemployed. would help", "score": 5, "replies": []}]}, {"body": "Godspeed cosmonaut", "score": 8, "replies": []}, {"body": "!remindme 16 hours", "score": 4, "replies": [{"body": "There is a 1 hour delay fetching comments.\n\nI will be messaging you in 14 hours on [**2020-03-25 14:18:25 UTC**](http://www.wolframalpha.com/input/?i=2020-03-25%2014:18:25%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/foefbi/tendies_incoming/fleofo8/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffoefbi%2Ftendies_incoming%2Ffleofo8%2F%5D%0A%0ARemindMe%21%202020-03-25%2014%3A18%3A25%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20foefbi)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": [{"body": "!remindme 16 hours", "score": 1, "replies": []}]}]}, {"body": "please post loss porn as soon as you can", "score": 6, "replies": []}, {"body": "You are fucked.", "score": 24, "replies": [{"body": "Market could legitimately go up 10 percent tomorrow", "score": 15, "replies": [{"body": "Yea in our dreams. Look at futures. I wish futures didn’t exist. I’m sweating. I’m hungry. I switched from bear to bull overnight and now my account is 100% calls and I accidentally bought VXX puts instead of calls because I was taking a shit. Forget a hedge I guess let’s just lose 20% in one day. Fml. Up astronomical today so tomorrow will be absolutely red across the board except for GOLD. CAN WE JUST GET 2 GREEN DAYS IN A ROW FOR FUCK SAKE.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Off-set ri-sk? Wtf does that mean?", "score": 42, "replies": []}, {"body": "theres no risk when there is a 100% chance of profit", "score": 15, "replies": []}]}, {"body": "Autism at its peak", "score": 5, "replies": []}, {"body": "good luck, I'm with you", "score": 4, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. Find more YOLOs here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da. \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "Post all the shit your wife’s boyfriend buys with those massive tendies you are about to get.", "score": 3, "replies": []}, {"body": "futures up", "score": 5, "replies": [{"body": "Sadly red fml", "score": 2, "replies": []}]}, {"body": "May the bear be with us.", "score": 2, "replies": []}, {"body": "testing", "score": 2, "replies": []}, {"body": "God-fucking-speed you autist", "score": 2, "replies": []}, {"body": "Good luck my good sir, it was a pleasure yoloing with you", "score": 2, "replies": []}, {"body": "1. Denial", "score": 2, "replies": []}, {"body": "looks like people loaded up on short term calls. i think it’ll shift to long term puts after stimulus", "score": 2, "replies": []}, {"body": "im averaging in between today and tomorrow, they still didn't pass the stimulus, we'll get another pump even if short lived", "score": 2, "replies": []}, {"body": "Quite honestly I hope you hit .01 on those Tesla puts. I went the other way", "score": 3, "replies": [{"body": "Thank you for your kind wishes", "score": 5, "replies": [{"body": "To counter my selfishness I hope after tomorrow it tanks back to 350 cuz I'm buying some cheap puts", "score": 1, "replies": []}]}]}, {"body": "3/27 $SPCE 13.5p gang RISE THE FUCK UP MOTHERFUCKING FUCKERS", "score": 1, "replies": []}, {"body": "PEAK AUTISM!\n\nIm with BlepBlupe", "score": 1, "replies": []}, {"body": "Positions or ban", "score": 1, "replies": []}, {"body": "Paper trading?", "score": 1, "replies": []}, {"body": "bought 2k puts today lets go", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "Would have waited a day.", "score": 1, "replies": []}, {"body": "I'm shocked you bought Tesla. Tesla f***** my portfolio last week, apparently, an analyst believes they have enough money to survive the coronavirus issues and then they went up like 20% on the news.", "score": 1, "replies": []}, {"body": "Oh you are sooo fucked.", "score": 1, "replies": []}, {"body": "You still holding?", "score": 1, "replies": [{"body": "Yeah... down roughly 50%. Might rollover to dates with later expiry.", "score": 1, "replies": [{"body": "You end up doing or did you diamond hands it? Might be in good shape next week?", "score": 1, "replies": [{"body": "Diamond hands atm. If Monday isn't blood red though I'll have to bite the bullet and sell'em at a loss.", "score": 1, "replies": [{"body": "I hope for both of our sakes a bloody Monday. You’ll sell if green? Then it will immediately tank seeing how this market has been lol", "score": 2, "replies": [{"body": "I sold. My account has lost 50% value over the past week. I'm still up considerably from where I started so I shouldn't beat myself up too much about it.", "score": 1, "replies": [{"body": "Yeah should have done what you did. Took another 10% hit today. This is crazy", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Dude jesus, nobody expected the printer. \n\n\nYour positions followed logic, but nothing can beat Donald Pump", "score": 1, "replies": []}, {"body": "Haha Tesla puts...look how that worked out for me. I hope you claim some of my tendies back from Elon cuck", "score": 1, "replies": []}]}
{"title": "A message from the COVID19 Virus to all the 🌈🐻's Out there", "selftext": "Trump may have spoken big words, he may have thought this 2,000 point rally on the DOW was his \"big\" doing. But the virus has a response...\n\nPuts will be printed, markets have much to fall, and its not over yet....\n\nTrump Press Conference: \"Many new yorkers are fleeing outside of the state to avoid the Virus, however many of you may already be infected and may be taking the virus with you to other states\"\n\n[https://youtu.be/gHjronXyeqI](https://youtu.be/gHjronXyeqI)\n\n&#x200B;\n\n[Gay Bears Unite](https://youtu.be/gHjronXyeqI)", "id": "foeswt", "created_utc": 1585089410.0, "score": 83, "upvote_ratio": 0.92, "num_comments": 74, "comments": [{"body": "New Yorker here, can confirm we're a shithole. \n\nTL;DR: $SPY 180P 03/27", "score": 72, "replies": [{"body": "[deleted]", "score": 31, "replies": [{"body": "What are you actually seeing that’s telling you how bad it is?", "score": 8, "replies": [{"body": "NYC is especially fucked due to all the people that were out and about during the relatively good weather recently. There's probably another 20k who are just getting sick and still spreading it. \n\n\nSource: friends and family that live there.", "score": 15, "replies": [{"body": "Source: White House\n\nAnyone leaving NYC will need to quarantine for 14 days. \n\nTranslation if you commute to NYC for work you must take 14 days off before you can go back to work and then take 14 days off!\n\nNew York City Will be locked down!!!!????", "score": 5, "replies": [{"body": "I thought this was the land of the fucking free???", "score": 4, "replies": [{"body": "Yep land of the fucking free for privileged people. The not haves...sorry step to the side you are quarantined.", "score": 4, "replies": [{"body": "Move, peasants", "score": 5, "replies": [{"body": "That was sooo 8th century. In this day and age we call them employees.", "score": 4, "replies": []}]}]}]}]}]}, {"body": "Nothing, they're stuck in their apartment and can't see shit. I yeeted out of NYC 3 weeks ago, no one took it seriously then. It's mad wide spread but will peak in 2 weeks.", "score": 2, "replies": []}]}, {"body": "fucking Trump already wanting to end the social distancing shit lmao\n\nLuckily we got Cuomo making the rules tho.", "score": 10, "replies": [{"body": "Watch Trump declare martial law and send in the fucking army to drag people out of their houses and back to work so he can try to pump the market.", "score": 14, "replies": [{"body": "It's not that I don't wanna work (I'm equally pissed at Cuomo for the unemployment system crashing every time I try to fucking register), I don't wanna get sick and die.", "score": 7, "replies": [{"body": ">I don't wanna get sick and die\n\nSeems like a valid argument", "score": 3, "replies": []}]}, {"body": "Sad that this shit may happen 😂", "score": 2, "replies": []}, {"body": "The reverse martial law, noine allowed back home rofl", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "F", "score": 1, "replies": []}]}]}]}, {"body": "Another gay new yorker. Bunch of boomers still out and about, going to parks, supermarkets etc. Crowds of people out shopping for paint samples at a local home depot cuz their nothing else to do.", "score": 5, "replies": [{"body": "I've been grocery shopping a couple of times, but only for necessities. \n\nParks or shopping at non-essential stores is really fucking stupid rn tho.", "score": 2, "replies": [{"body": "Agreed, i leave my house and stay in my car just driving around. We foooked", "score": 2, "replies": []}]}]}, {"body": "Former area resident. It's garbage.", "score": 3, "replies": []}, {"body": "Hello fellow 180p holder", "score": 3, "replies": []}, {"body": "im so sorry bro :(", "score": 2, "replies": []}, {"body": "Yeah I've seen new York. No want to even visit that shithole metropolitan area. Hopefully the virus thins out the population enough to make housing something near affordable.", "score": 2, "replies": []}, {"body": "Is the state on lockdown? Can’t get in or out", "score": 1, "replies": [{"body": "Virtually. Don't know why you'd wanna come here rn but if you're coming for business most places are shut down anyway.", "score": 2, "replies": [{"body": "You americans have the best stocks.  The best.  Fuckin stocks skyrocket when you close down the company for a few weeks.  Good stuff, but bad for my puts", "score": 6, "replies": []}, {"body": "I’m thinking of the asymptomatic people there that would spread it. Stay safe out there man.", "score": 1, "replies": [{"body": ">I’m thinking of the asymptomatic people there that would spread it.\n\nThis. \n\nI'm not in the city. I'm in the western portion of the State, where our counties are running out of tests yet we already have 100+ positive cases. It's not good.", "score": 1, "replies": []}]}]}]}]}, {"body": "Green open tomorrow will really test who I am as a person.... and a man. 💎 fucking 🤙🏻 boys", "score": 28, "replies": [{"body": "Green open, or ideally a spike from the Stim package, will allow me to double down on my puts that are 40 days out. Slow and steady", "score": 15, "replies": [{"body": "This.", "score": 6, "replies": []}, {"body": "Did stim package pass?", "score": 3, "replies": [{"body": "3rd vote tomorrow", "score": 4, "replies": [{"body": "So it didn’t pass again?", "score": 2, "replies": [{"body": "Yeah it passed, but they just want to keep voting on it.", "score": 7, "replies": [{"body": "Cool cool sounds like something the senate would do", "score": 2, "replies": []}]}, {"body": "Wasn't voted on today, they were still working on it. Failed to pass vote to move forward twice now.", "score": 2, "replies": []}]}]}]}]}, {"body": "Mid April/May and June puts here. Currently jacked to the tits.", "score": 7, "replies": []}, {"body": "I had to close my app today and just take a nap. I couldn’t bear to watch the massacre I was enduring", "score": 4, "replies": []}]}, {"body": "One thing I’ve learned in my time here: inverse wsb. You’ll see much more gainz", "score": 10, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "unemployment reports tho", "score": 3, "replies": []}]}]}, {"body": "Just entered before close 5/1 SPY 231p. Idgaf if tomorrows green again. Averaging down bigly 🌈🐻🌈🐻🌈🐻🌈🐻🌈", "score": 11, "replies": []}, {"body": "Huge quantity of SPX puts expiring tomorrow were bought EOD [https://imgur.com/a/D88dfQf](https://imgur.com/a/D88dfQf)", "score": 8, "replies": [{"body": "And the will all be worth 0", "score": 8, "replies": []}, {"body": "I mean, it's not a bad gamble to try to mirror the market collapse.", "score": 3, "replies": []}]}, {"body": "Damn bears are spooked. \n\nI’m only semi spooked for my $JPM poots \n\n🥴", "score": 6, "replies": [{"body": "I heard when others are fearful, be greedy. Does that apply here", "score": 2, "replies": [{"body": "Hell yeah it does bro, get greedy with those pooters this definitely isn’t over yet, there’s another move down on the way", "score": 2, "replies": []}]}]}, {"body": "The moment trump's speech finished. The day care, I live by, let all the boomers out for a walk or stroll in their wheel chairs.\nIncoming RIP boomers.", "score": 6, "replies": []}, {"body": "anyone who has been to brooklyn knew that place was going to be the downfall of the world", "score": 5, "replies": []}, {"body": "Assuming this week is green and every week is red during April, if there aren't large drops, will it matter? IV crush and theta might just fuck over a lot of put holders even if spy drops quite a lot.", "score": 5, "replies": []}, {"body": "Blood rushing to pee pee go WOOOSH", "score": 5, "replies": []}, {"body": "Keep chanting  **🌈🐻 - tomorrow we will rise from our caves.** S&P Futures are down!", "score": 4, "replies": [{"body": "💎🤲🏼", "score": 1, "replies": []}]}, {"body": "did you miss the 6 trilllion reasons we are fucked?", "score": 9, "replies": [{"body": "wasn't it 6 billion gazillion dollars now?", "score": 4, "replies": []}, {"body": ">https://youtu.be/gHjronXyeqI\n\n[https://youtu.be/gHjronXyeqI](https://youtu.be/gHjronXyeqI) Just watch the video, this one reason is enough to combat the 6 trillion", "score": 3, "replies": [{"body": "Lmao okay", "score": 2, "replies": []}]}]}, {"body": "Holding all my 4/17 puts have to I guess", "score": 3, "replies": [{"body": "Right there with. Coulda sold last wed for a decent chunk. Got greedy. Now I'm down 60%. Trading is halted on my account so I can only exit. DIS 80p 4/17 at $6.57 was my entering price. Diamond hands precious.", "score": 3, "replies": []}]}, {"body": "California and NY, the countries largest economic hotspots has death in the streets. But we are opening the farmbelt bois 15% market rocket. Yeeeehaw", "score": 5, "replies": []}, {"body": "Trump has literally never spoken big words. He might've repeated words synonymous to big millions of times but has never spoken BIG words.  \nEdit: Also you fucking edited your post to put the same youtube link twice?", "score": 7, "replies": []}, {"body": "Let’s see if we can rally through previous top on the SPY 253.", "score": 2, "replies": []}, {"body": "The problem is guessing “when”.", "score": 1, "replies": []}, {"body": "God damn ya'll a bunch of pussies. These guys get one green day and all of you questioning your existence. Tomorrows going to be a shit show. Whatever happens, there will be volatility and massive swings so get in on one of them and make some fucking money.\n\nGOD DAMN IDIOTS", "score": 1, "replies": []}, {"body": "Futures are up again. Let’s hope it’s not another Green Day", "score": 1, "replies": [{"body": "It's gonna be green all week bro.", "score": 6, "replies": []}, {"body": "Futures mean nothing, we may be up tomorrow, but Thursday, once Job Losses are reported, we will shine", "score": 5, "replies": [{"body": "Too many people banking on the job losses. Just watch the Fed pass the bill right before or during the report", "score": 7, "replies": []}]}, {"body": "Green day tomorrow = Extended lightning sale on puts!", "score": 0, "replies": []}]}, {"body": "Reminder that Corona has killed around 17,000 people, total, world wide, and that all your doomsaying is based 100% on projections, estimates, and models with extremely uncertain inputs.", "score": -5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "OMG R2 0.992!\n\nI'm so scared of your projections and numbers, please save me from big bad corona!", "score": -1, "replies": []}]}]}]}
{"title": "Less than 1% US Covid-19 recovery rate thus far... The bottom has yet to come. 🌈 🐻 has yet to end. Selling I am fucking not.", "selftext": "[deleted]", "id": "fofagy", "created_utc": 1585091130.0, "score": 101, "upvote_ratio": 0.86, "num_comments": 68, "comments": [{"body": "Yes. Based on European numbers, it takes 2-3 weeks to die from this. The big surge of positives didn’t start until about 8 days ago. We may reach 1,000 deaths/day by next week. Don’t listen to the retard in chief, we are handling this worse than any country on earth", "score": 92, "replies": [{"body": "🏃🏼🏃🏽‍♀️🏃🏿‍♂️👩🏻‍🦽🦇🦇🦇🦇🦇", "score": 20, "replies": [{"body": "The best part is that they are leaving the wheelchair dude to the bats", "score": 6, "replies": [{"body": "Thats the good old America “treat everyone as if they have the virus philosophy”. 🇺🇸 \n\nAnd ill be damned if a wheelchair is in front of me, welcome to era Mad Max     \n🛢 🗽💣 🚓  🤳🏻🤾🏽🧎🏻‍♀️ 👴🏼⚰️ 🦇🦠", "score": 2, "replies": []}]}]}, {"body": "U mean Italy? Rest of Europe isn’t dying 1000 a day cause they aren’t old and dirty as shit like Italians", "score": -4, "replies": [{"body": "Spain is about to be worse than Italy. Only the nordics are handling it well", "score": 13, "replies": [{"body": "Is Germany/Austria nordic cause them bitches look immune", "score": 9, "replies": [{"body": "Stong genes or something", "score": 5, "replies": []}, {"body": "I keep looking at Germany, their death rate is at .001%  they are doing something right over there.", "score": 1, "replies": [{"body": ".", "score": 3, "replies": []}]}]}]}, {"body": "You’re retarded. Italy has one of the best healthcare system fuck your US system straight garbage you got a lot of ICU beds which no one can pay for plus no ventilators. Most common group that dies with pre existing conditions is being fking obese you fatty American. Here’s your DD.", "score": 36, "replies": [{"body": "Bro it’s okay I promise, now show me on the doll where Uncle Sam touched you", "score": 35, "replies": []}, {"body": "Lmao, this shit is gold.", "score": 15, "replies": []}, {"body": "Italians literally smoke cigarettes for breakfast and consume more carbs per capita by a multiple of a million than any country on earth", "score": 17, "replies": [{"body": "You mean Americans eating 3424312 pancakes drizzling with high-fructose corn syrup with solid 10 lbs of bacon that's going to be 200x of recommended daily intake of sodium and saturated fat? Oh and that crapton of juice and soda loaded with so much sugar that will make your blood flow like jello... Literally no other place on earth does that. Look at how fucking obese this country is. Imagine thinking a couple of cigarettes really matter lmao", "score": 6, "replies": [{"body": ">You mean Americans eating 3424312 pancakes drizzling with high-fructose corn syrup with solid 10 lbs of bacon that's going to be 200x of recommended daily intake of sodium and saturated fat? \n\nTalkin' dirty to me, sailor.", "score": 11, "replies": [{"body": "10 lbs is 4.54 kg", "score": 10, "replies": [{"body": "Sounds about one carbonara", "score": 2, "replies": []}]}]}]}]}, {"body": "U mad? Best healthcare system in the dirtiest piece of shit country out there.  They smoke and spit all over, dog shit on the streets and drinking sewer water .  Place is a dump", "score": 6, "replies": [{"body": "Was just in italy over the summer. Yes they smoke. Yes its old. Rome and Milan are crowded. That being said, there were some differences. \n\nI live in a city where stepping over used needles and human shit, and actual humans, is a normal way of life. Not so much there. \n\nWe are fucked, dude.", "score": 13, "replies": [{"body": "That could be a number of US cities but I'm going to guess you're in the public defecation capital of America: beautiful and totally affordable San Francisco!", "score": 11, "replies": [{"body": "Nope, but I worked in the bay area at the AC2 campus a couple years ago- can also confirm. \n\nTry its little, less temperate brother to the north. Not Portland.", "score": 7, "replies": [{"body": "Makes sense. Portland and Seattle are just SF lite. Portland wants people to think it's just cold Austin but we know they're full of shit.", "score": 6, "replies": []}]}]}]}, {"body": "Smoking okay, the rest would indicate a good immune system. Still, americans are fat and gonna drop like shit and you don’t understand social distancing. The healthcare system is literally garbage no one can pay for that shit. And hit up a chart that shows percentage of deaths under preconditions. (Lung) Cancer is way less mortal then being obese so you fattys gonna drop most can’t afford weeks of being on a fling ICU plus no social distancing. And I’m not mad living in the country with the best health care system we are ready it’s on", "score": -4, "replies": [{"body": "\"no one can pay for that shit\"\n\nI love it when people project the circumstances of the bottom 30% on the rest of the country", "score": 2, "replies": []}]}]}, {"body": "If you can afford it, America has the best healthcare. There’s a reason the rich (regardless of country) frequently come here for important medical care.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Italy and Japan are older", "score": 5, "replies": []}, {"body": "Old AND dirty.  Italians smoke and drink out of the toilet", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "I'm waiting for your mom to come over, I'll leave when she starts blowing me.", "score": 1, "replies": []}]}]}]}, {"body": "Agree on the puts. Unsure what I just read tho", "score": 15, "replies": []}, {"body": "On the real tho, we still 💎🖐?", "score": 15, "replies": [{"body": "🌈🐻💎🙌 4ever", "score": 4, "replies": []}, {"body": "Lol can someone explain the diamond hand thing to me?", "score": -9, "replies": [{"body": "Paper hands means your a pussy and sell when things get tough. Diamond hands means your a true autist and hold to the last possible moment to see if the market goes your way", "score": -3, "replies": []}]}]}, {"body": "May Zamorak slam the markets into the ground", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Guthix confirmed.", "score": 1, "replies": []}]}]}, {"body": "yes.", "score": 3, "replies": [{"body": "Can you like my post i tried hard", "score": -9, "replies": [{"body": "no.", "score": 9, "replies": []}, {"body": "+1 downvote", "score": 8, "replies": []}, {"body": "I did", "score": 0, "replies": []}]}]}, {"body": "We all gona be buried in Gucci suits though no cap", "score": 3, "replies": []}, {"body": "I doubt they test most positives after they're sent home so hard to know recovery. But obviously most do.", "score": 3, "replies": []}, {"body": "I came.", "score": 3, "replies": [{"body": "I saw.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "Wtf", "score": 2, "replies": []}, {"body": "Why did spce go 41 % today... I am dying", "score": 2, "replies": []}, {"body": "Do they have to be retested to be counted as recovered?", "score": 2, "replies": []}, {"body": "Why choose $SPCE when we have the $SPYDER. Much more gains. Cannot go tits up.", "score": 1, "replies": []}, {"body": "Guthix, rest", "score": 1, "replies": []}, {"body": "Free armour trimming", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "500/50000 x 100 = 1% I hope ur joking", "score": 1, "replies": [{"body": "Hmm, you're right... Looks like I need to have my Dr. change out my meds...", "score": 1, "replies": [{"body": "Try LSD", "score": 1, "replies": [{"body": "Hoo boy, batting 2/2 for bad trips with LSD. 2CI or Psilocybin for me thanks", "score": 1, "replies": []}]}]}]}]}, {"body": "These Walmart hookers you speak of... are they in the sporting goods section?", "score": 1, "replies": []}, {"body": "Yo guthix mad gay zammy clan all day nukka $INDA $15 4/17", "score": 1, "replies": []}, {"body": "The weak deserve to die, so the strong may flourish. This is the creed of Zamorak.\n\nno but really ban", "score": 1, "replies": []}, {"body": "Well it's still new in the US, relative mortality is going to rise but so will the recovery rate", "score": 0, "replies": []}]}
