{"title": "r/Stocks Daily Discussion & Technicals Tuesday - Mar 31, 2020", "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on technical analysis (TA), but if TA is not your thing then just ignore the theme and/or [post your arguments against TA here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&restrict_sr=on&include_over_18=on&sort=new&t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n  * [Corporate News](https://www.streetinsider.com/Corporate+News)\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n  * [Economic data](https://www.streetinsider.com/Economic+Data)\n  * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\n-----\n\n**Technical analysis (TA)** uses historical price movements, real time data, indicators based on math and/or statistics, and charts; all of which help measure the trajectory of a security.  TA can also be used to interpret the actions of other market participants and predict their actions.\n\nThe main benefit to TA is that everything shows up in the price (commonly known as **\"priced in\"**):  All news, investor sentiment, and changes to fundamentals are reflected in a security's price.\n\nTA can be useful on any timeframe, both short and long term.\n\nIntro to technical analysis by [Stockcharts chartschool](https://stockcharts.com/school/doku.php?id=chart_school:technical_indicators:introduction_to_technical_indicators_and_oscillators#benefits_and_drawbacks_of_leading_indicators) and their [article on candlesticks](https://stockcharts.com/school/doku.php?id=chart_school:chart_analysis:introduction_to_candlesticks)\n\nIf you have questions, please see the following word cloud and click through for the wiki:\n\n[Indicator - Trade Signals - Lagging Indicator - Leading Indicator - Oversold - Overbought - Divergence - Whipsaw - Resistance - Support - Breakout/Breakdown - Alerts - Trend line - Market Participants - Moving average - RSI - VWAP - MACD - ATR - Bollinger Bands - Ichimoku clouds - Methods - Trend Following - Fading - Channels - Patterns - Pivots](https://www.reddit.com/r/stocks/wiki/ta-themed-post)\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.", "id": "fs90mx", "created_utc": 1585642073.0, "score": 9, "upvote_ratio": 0.78, "num_comments": 67, "comments": [{"body": "Green again pre market. I'm so lost. I refuse to buy in yet though, there's no way this holds... Surely?!", "score": 13, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "> suspect. But the 2000 crash had 4 20% - 25% rallies that failed. The 2008 crash had 2 20% - 25% rallies that failed.\n\nThe arguments for a legitimate rally to blue skies are laughable. I understand the perma-bull argument (I'm actually much more optimistic towards the market than my recent posts). But anyone who argues that the bottom is in, and we have \"priced in\" this global pandemic in 11 days, and the recovery has started are delusional.", "score": 9, "replies": [{"body": "I think the Fed intervention has everyone feeling secure. There wasn’t this much money being thrown around In any of the past crashes. Gov is not gonna let this market down . I feel like the bottom has passed and we will have stagnant side ways trading for most of April some rallies and some minor sell offs as funds are rebalanced and  gains are realized by larger funds etc. I have DCA over the past 2 weeks and holding on to 20% cash ... so let’s see where we go from here . Does look like we didn’t really drop as much as it should have given are at 2019 Q4 valuations", "score": 4, "replies": []}]}, {"body": "the truth always hurts though", "score": 0, "replies": []}]}, {"body": "I called market bottom on March.20 and have been telling people to buy ever since. I made pretty handsome profits. I honestly hope people bought during the last two weeks. Surely you can wait for another dip but what if the market goes on a rally from here? You will miss out big time", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "Trump will suck this country dry to prop up the market lmao", "score": 12, "replies": [{"body": "True!", "score": 1, "replies": []}]}, {"body": "This whole situation is so idiotic we might actually find ourselves in a few weeks talking about the \"Corona rally\" as long as no one looks out the window and notices the medieval guy in the bird mask carting a pile of dead bodies down the fucking street.", "score": 9, "replies": [{"body": "Lol. Shh 🤫 if nobody says anything perhaps nobody will notice", "score": 2, "replies": []}]}]}, {"body": "How are airlines up 6% today. Southwest is cutting their flights by 40%", "score": 8, "replies": [{"body": "how are they not? makes zero since so greeeeeeeeeeeen", "score": 3, "replies": []}, {"body": "Think finally figured out the market! Bad news = stonks go up, good news = stonks go up more", "score": 4, "replies": []}, {"body": "Airlines fell negative by the end of the day. In the near term it's good they are cutting back as it preserves cash.", "score": 1, "replies": []}]}, {"body": "Norwegian Cruise Lines worth the risk? It’s so cheappppp.", "score": 6, "replies": [{"body": "I bought some, I really think it’s bound to go back up again. Aren’t some of the cruise lines disputing the stimulus?", "score": 1, "replies": [{"body": "Might not be the case. They just announced that they’re extending their suspension", "score": 1, "replies": [{"body": "Both NCL and RC are up 5% this morning.", "score": 0, "replies": []}]}]}, {"body": "Yay or Nay? Yay", "score": 1, "replies": []}, {"body": "They will eventually go up eventually; its just a matter of time.", "score": 1, "replies": []}]}, {"body": "If we average 3% daily gains, we'll be at the top again before April 14th.", "score": 5, "replies": []}, {"body": "Last hour of trading, end of quarter.  Things about to get wild.", "score": 6, "replies": [{"body": "Explain", "score": 5, "replies": []}, {"body": "Explain", "score": 4, "replies": []}, {"body": "Yes, and yes. It's about to get weird.", "score": 1, "replies": [{"body": "Exclaim!!!!", "score": 2, "replies": []}]}]}, {"body": "Red, green then red again? What was this day?", "score": 6, "replies": [{"body": "A disaster", "score": 3, "replies": []}]}, {"body": "start out red then greeeeeeeeeeeeen wtf", "score": 3, "replies": []}, {"body": "Not sure if this is the right place, but does anyone know how to find legal insider trading activity? E.g. I will read about a director from some publicly traded company who just sold $50 million in shares. How do people find this information?  \n\n\nEdit: I found  [http://openinsider.com/](http://openinsider.com/)  to be the best site with the info", "score": 3, "replies": [{"body": "Finviz has a nice box on bottom right of big trades, otherwise yahoo finance probably would", "score": 4, "replies": []}, {"body": "It's on the SEC website.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "i like it, but want it cheaper, good div, seems like a solid oil pick", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "i snagged some $HAL for my cheap cheap oil stock. honestly your probably right on Exxon need to just go ahead and buy some too and just DCA it when/if it drops. better to have some than none.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "OneOK for gas, i always hear about them being a solid \"set it and forget it\" stock i own a few shares at $21, missed the fire sale at $15 a share. If money no object id buy up some Disney, they own so much now (marvel, star wars, fox), and streaming service will be taking off. $100 a share seems cheap when they start taking off.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Man I picked Amarin as a risky play, and learned the hard way why a lot of people stay out of pharmaceutical stocks.  Good luck to those shareholders today.", "score": 2, "replies": []}, {"body": "Bought SQQQ at 24.83\n\nNo I'm not asking if I should sell, I know I'm perma fucked. But how is this the bottom? When New York is literally using semis to stuff dead bodies in. How the fuck does this market work", "score": 2, "replies": [{"body": "I bought in at 19.8, im considering selling too, is what it is. Sucks that fundamentals mean nothing when the FED has all power.  I was so sure another drop was coming, but at this point, who the fuck knows", "score": 1, "replies": [{"body": "I'm an idiot buying at 23 and not selling at 30 and ignoring everyone's advice to never hold long term", "score": 1, "replies": []}]}, {"body": "Is SQQQ the same as  PROSHARES TR/ULTRAPRO SHORT ? Can you explain this ETF?", "score": 1, "replies": []}]}, {"body": "Not sure where to post this question:\nGiven how volatile the market is right now, is it wise or are there any drawbacks for short term trading? It seems like you can find stocks that fluctuate between $12-$16 every few days so if I buy high volume at low price and sell at high, I can still make some money right? The only down side I know is that I get taxed more since I’m not holding it longer than 1 year. I’m new to the stock market and I’m trying to learn more and want to avoid any hidden pitfalls. \n\nIf this isn’t the right location to post this question, please let me know where I should post instead. Thanks!", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Haha yes. Everybody wants to “get rich quick”.", "score": 3, "replies": [{"body": "I consistently get poor quick.", "score": 1, "replies": []}]}]}, {"body": "you can do it, just remember your capital gain tax on stocks held for less than one year is just your normal tax rate depending on your tax bracket. For most people that means quick trades are taxed at 25-30% instead of 15%.\n\nAlso, doing this type of trading requires constant monitoring. Also, it hasn't been shown to be very profitable for most people. You can no more predict the market on a minute by minute or hour by hour basis, than you can on a year to year basis. It's still basically gambling. If that is fun for you, and it makes you a few thousand dollars here and there, by all means go for it. \n\nBut for many, it just comes down to time. I could do it, but I just have a lot of better things to do, that I like doing more, than sitting in front of my computer looking at stock charts.", "score": 2, "replies": [{"body": "Ya I think in “normal” stock market times I would be in it for the long haul but this seems to just be a very unique time in the market. OR I’m probably just rationalizing my “gambling” mentality from all this quarantine.", "score": 2, "replies": []}, {"body": "I just started trading throughout the day (2 weeks ago). Not day trader status but making a few trades each day. Reading the news and tracking trends. Starting with 50k, I'm now up to 80k. \n\nMostly finding positions of value and going in pretty deep and getting out when I thought the stock was over valued.\n\nMy gut feeling says I'm getting lucky and it's not maintainable. I have another month of working from home. We'll see how this turns out.\n\nTLDR: It is possible to do well but based on \"common knowledge\" it's not wise.", "score": 1, "replies": [{"body": "Awesome man. Besides a lot of research, I think you have to know when to stop/sell too.", "score": 1, "replies": []}, {"body": "are you sure you didn't just get lucky and start trading right when things were super cheap, and then we had that rally up? It's really easy to make money during a run like that. There will be other times where you won't find it that easy.", "score": 1, "replies": []}]}]}]}, {"body": "I have 17k that I’d like to make a short term profit on(leaving it in the market for a few months at most). Which stocks and when would be the best to invest into?", "score": 2, "replies": [{"body": "Mircosoft, and I can't stress this enough.\n\n This is merely opinion and not official financial advice.", "score": 3, "replies": [{"body": "Why Microsoft do you think?", "score": 2, "replies": [{"body": "Cloud demand, internet services, students that are taking online classes, teleconferencing, windows applications, device purchases in quarantine.", "score": 4, "replies": [{"body": "You can't even buy a good HD quality webcam right now. All of the high quality video conference cams are selling for twice to three times the price right now if available at all. I guess they are the new toilet paper.", "score": 1, "replies": []}]}]}]}, {"body": "I’ve been thinking about doing something similar with SHV but I don’t know yet.", "score": 1, "replies": []}]}, {"body": "BAM Or Starbucks for long term hold ? 5-10 years\nMicrosoft or Tesla for short term hold ? 3 months \nAny other recommendations that would be better for maximizing profits ?", "score": 2, "replies": [{"body": "Just bought some sbux today at 67 bucks 😨", "score": 1, "replies": [{"body": "I feel like they are both really good long term options. Starbucks won’t be going anywhere and has growing potential in the Chinese economy", "score": 1, "replies": []}]}, {"body": "Tesla short (earnings coming gonna be no bueno)\nBAM, Starbucks, MFST all solid long. SBUX is on sale as is all of the banking industry", "score": 1, "replies": []}]}, {"body": "It’s red!!!! Burn baby burn.", "score": 3, "replies": []}, {"body": "Maybe Thursday or Friday selloff.", "score": 1, "replies": []}, {"body": "Did GASX and GASL kick the bucket finally?  I can’t get a current quote for either and Fidelity isn’t showing them at all.", "score": 1, "replies": []}, {"body": "Just checked my portfolio and three stocks have rebounded from net loss to net gain: LMT, INTC and WTRG. Debt-focused ETFs are also showing good signs. But the biggest winner is IAU. Money is really flooding into gold and gold-related products.", "score": 1, "replies": []}, {"body": "Want to gauge the collective wisdom here:\n\n#[How will the S&P Close Wednesday, April 1?](https://www.polltab.com/MYqdiImZL2)", "score": 1, "replies": [{"body": "Dropping already.  Gonna be a bloody day tomorrow.", "score": 3, "replies": [{"body": "Yikes, 68% 🔴 so far", "score": 1, "replies": []}]}]}, {"body": "What so no one is buying ATVI?", "score": 1, "replies": []}]}
{"title": "Microsoft clarifies Teams usage surged 775% in Italy withdrawing an earlier statement that the surge was for its cloud services in regions around the world", "selftext": "[deleted]", "id": "fsd8c9", "created_utc": 1585662600.0, "score": 433, "upvote_ratio": 0.96, "num_comments": 69, "comments": [{"body": "Bad news, calls it is. MSFT 200C 04/17. Calls gang reunite \n\nEarnings report 50% lost in revenue. Stonks go up.", "score": 155, "replies": [{"body": "Microsoft has been doing this for a while. “Azure usage is skyrocketing!” While failing to mention it’s not any actual compute or anything, just office365.", "score": 29, "replies": [{"body": "And people think Azure is the best cloud provider. Almost half their revenue from cloud is office365.", "score": 11, "replies": [{"body": "It's obviously IBM cloud", "score": 16, "replies": [{"body": "No Oracle cloud, the best. Tremendous cloud, Amazing cloud, real talented cloud, great cloud.", "score": 15, "replies": [{"body": "A lot of people say it’s the best cloud, I don’t know if it is but a lot of people are saying it.", "score": 3, "replies": [{"body": "> It's the highest cloud in the sky, if you look up at all the other clouds this cloud...it's the highest one. I don't know of any other cloud that has ever been this high in history. You know...this cloud, it's going places no ones ever seen before, remarkable what clouds can do these days.", "score": 3, "replies": []}, {"body": "Great", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I loaded up on Jan 130's Wednesday morning.  +61% so far...", "score": 4, "replies": []}, {"body": "Link to 50% lost revenue pls?", "score": 4, "replies": [{"body": "Coming up retard. Not too soon, wait MSFT to moon", "score": 13, "replies": [{"body": "i'm retarded? lol", "score": -33, "replies": [{"body": "You are from r/all aren't you p***?", "score": 7, "replies": [{"body": "Nah. All users arent retarded. Thats reserved for our fellow autists. Pussies is usually the word.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Lol tech getting pumped and bought like it's a safe haven. This bubble is getting blown bigger than any other in the market. Teams is free FFS; we use it in our office.", "score": 103, "replies": [{"body": "😂", "score": 15, "replies": []}, {"body": "Right after all our puts expire. Only people making money on this shit going down are those with government connects", "score": 11, "replies": []}, {"body": "My tech stocks have dropped less than my 401k, so in a way it has been a haven.\n\n&#x200B;\n\nrip my calls though", "score": 10, "replies": []}, {"body": "They selling your information it’s not free retard, you are the product and they are milking you", "score": 24, "replies": [{"body": "Look who’s wife is getting data mined", "score": 25, "replies": [{"body": "Two straight husbands*", "score": 3, "replies": []}, {"body": "Impossible, my wife wouldn’t cheat on her boyfriend, Roberto is a great guy", "score": 1, "replies": []}]}]}, {"body": "Wait till you start to use eDiscovery because of a lawsuit, integrate PowerBI cause you know data and oh voice and video. Then MS has you by the balls.", "score": 2, "replies": []}, {"body": "Weekly calls free money", "score": 1, "replies": []}, {"body": "LOL that you don't understand: tech stocks were initially hit hard by Covid-19, yet the companies themselves are actually doing even better.  MSFT is still 20 points from where it was.  So yes, I loaded up on tech Wednesday.", "score": 1, "replies": []}, {"body": "🤣🤣🤣 Yeah because big US tech arent the ones with whole countries GDP worth of cash on hands. They could have 10 years of no revenue and still exist. Theyll probably come out of this stronger since most of the big tech's services are essential.", "score": 0, "replies": []}]}, {"body": "great misleading news: stock goes up\nCorrects great news with meh news: stocks goes up even more \n\nMSFT is the only stock I’m long on but Jesus Christ this shit makes no sense", "score": 27, "replies": [{"body": "You are long. Oh shit now buy puts", "score": 5, "replies": [{"body": "Lol obviously I think this whole market  is fucked but I saw msft at 137 and said fucked it I’ll buy 30 shares and just never sell. Buy more if it goes lower", "score": 6, "replies": []}]}]}, {"body": "Work for a school district with around 25,000 students and we're using teams for distance learning the rest of the year. Msoft going hard", "score": 8, "replies": [{"body": "Teams are free mate.", "score": 1, "replies": [{"body": "But that contract we just renewed with them damn sure don't run on dunkin'", "score": 13, "replies": []}]}]}, {"body": "IT Guy here. Can confirm teams is way better than slack. (yea it’s free it comes bundled in on o365 subscriptions. ) why spend money on slack when teams already integrates with products that are already widely in use.", "score": 35, "replies": [{"body": "Same here. Showed a few of my users how to use teams to work better together since we got O365. Now the org wants all 450 employees on it 😵😵", "score": 17, "replies": [{"body": "Azure is also a better cloud than AWS or Google. \n\nMSFT is a solid, long-term buy on fundamentals -- rare that you hear that these days.", "score": 8, "replies": [{"body": ">Azure is also a better cloud than AWS\n\nWow I do not agree with this at all.\n\nTheir SDKs and documentation are a mess, the portal is buggy as hell, basic features are still missing, the marketplace submission process is a joke, they regularly push broken updates to the az cli.\n\nI can see the attraction if you are a Microsoft shop but otherwise no thanks.", "score": 4, "replies": []}, {"body": "Azure is just way better organized. Good luck finding shit in AWS console.", "score": 8, "replies": []}, {"body": "We used both because cold storage is cheaper for us but definitely I do everything else in Azure", "score": 2, "replies": []}]}]}, {"body": "Been using Teams all month and it is incredibly good. Perfect tool set, great integration with Office, 100% uptime. MS made a really good product there.\n\nWhat is their profit model? Enterprise support?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "^ This. Everyone else is deep-throating $MSFT.", "score": 3, "replies": [{"body": "Everyone trying to pump MSFT with teams has never programmed anything. Slack is far superior.", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "More like the opposite. Someone will email you and then message you asking if you saw their email", "score": 6, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Prolly a boomer in denial", "score": 1, "replies": []}]}]}]}]}, {"body": "F", "score": 5, "replies": []}, {"body": "Yeah but Teams is MS's smokiest dumpster fire of a product so I think this means it's less trash products are also doing very well or better.", "score": 3, "replies": []}, {"body": "Btw, my office just switched from slack to Teams and teams is far better than Slack.", "score": 11, "replies": [{"body": "Why is it better", "score": 5, "replies": [{"body": "Interface is better and integration with office 365 suite.  Most companies use office on a regular basis so being able to IM your co worker a file stored on one drive and being able to work on it with them in real time is pretty useful", "score": 17, "replies": [{"body": "I can definitely see the 365 integration being nice. But that's not too useful for developers and software shops. \n\nMaybe Slack is for developers, Teams is for other offices.", "score": 5, "replies": [{"body": "If you're doing any documentation Teams works better but the way Teams handles thread is honestly pretty stupid.\n\nWorked with both Slack and Teams; frankly I'll take anything over Skype for Business at this point.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Click Format, More options, Code Snippet, top right is the syntax highlighting drop down. Must have 50 languages in there.\n\nAgree with channel vs. thread replies but I don't think it's much better in Slack, it's a user problem.", "score": 1, "replies": []}]}, {"body": "> Interface is better\n\nWhat a load of bullshit lol. Integration is indeed great, but interface? Are you a time traveler from 2005? Still using that Windows Phone?", "score": 1, "replies": [{"body": "Yeah ur right sorry that was so upsetting for u lmao", "score": 2, "replies": []}]}]}, {"body": "It's a copy of slack, but now with video conferencing, phone, screen sharing, chat, memes, 3rd party integrations, o365 integration, plus it's included with o365 subscription which most orgs pay for anyways.", "score": 5, "replies": [{"body": "Slack can do all of those.", "score": 2, "replies": [{"body": "I didn't know slack is included with o365", "score": 1, "replies": [{"body": "big tech stealing ideas exactly and then undercutting the little guy on price?\n\nnothin 2 see here folks just usa being usa\n\nat least china steals properly", "score": -1, "replies": []}]}]}]}]}, {"body": "My company did the same thing and I completely disagree. Slack was much better to use. Teams is a terrible UI, I get pinged constantly for other departments stuff to the point that all notifications are useless, copying a chat is a nightmare, and markup text support is a joke.", "score": 2, "replies": []}]}, {"body": "I bought Microsoft calls last Friday, sooooo cheap, 190c 9/18", "score": 3, "replies": []}, {"body": "Runs global cloud\n\nCan't PR a basic stat\n\nRIP MS", "score": 3, "replies": [{"body": "No no, bad info bad revenue stock go up. \n\n1 million die stock go up. Buy calls", "score": 1, "replies": []}]}, {"body": "so from 10 suckers/users to 77.5 suckers/users?  is that how percentages work?  i hate math", "score": 6, "replies": []}, {"body": "I just wish Teams didn't suck so bad.", "score": 2, "replies": []}, {"body": "Lies, damned lies and statistics: teams usage probably went from 1 person to 77.5 people.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}
{"title": "Snapchat will hit $11 and you will make a lot of money", "selftext": "Me and the autists over in the discord have been discussing our autistic stock, SNAP.\n\nAfter some research on GDP correlation to Online Marketing, OM decreases exponentially in relation to GDP loss. Further escalating this, the quarantine means movie marketing, retail marketing, and local business marketing budgets have tanked. This is a godzilla sized piece of SNAP's revenue. For the record, analysts predict a 9% GDP drop this quarter, and up to 30% second quarter.\n\n [https://finance.yahoo.com/news/goldman-sachs-slashes-second-quarter-134947909.html](https://finance.yahoo.com/news/goldman-sachs-slashes-second-quarter-134947909.html) \n\n [https://www.cnbc.com/2020/02/04/snap-earnings-q4-2019.html](https://www.cnbc.com/2020/02/04/snap-earnings-q4-2019.html) \n\nSNAP isn't currently profitable. Further more, losing a measly 5% of online marketing is going to severely hurt the company, watch for their Q1 earnings on Apr 21st after-market. Investors WILL anticipate massive losses this quarter.\n\nSnapchat is like TSLA, just without retard strength raising it to astronomical levels.\n\ntl;dr SNAP 4/17 $11 and SNAP 5/1 $9", "id": "fsiis4", "created_utc": 1585680005.0, "score": 65, "upvote_ratio": 0.84, "num_comments": 78, "comments": [{"body": "Hey correlate this:\n\nYou're gay", "score": 132, "replies": [{"body": "happy cake day, also you're gay snap dropped under 11", "score": 4, "replies": []}, {"body": "lul’d at this.", "score": -38, "replies": []}]}, {"body": "nice try i'm not buying your puts", "score": 44, "replies": [{"body": "volume is actually insane for those options", "score": 11, "replies": []}]}, {"body": "This sub wants me to invest in something? Its a message from the gods for me to NOT invest in it.", "score": 40, "replies": [{"body": "This is this guy's 69D chess strategy to get us to buy SNAP calls", "score": 12, "replies": [{"body": "Are you saying we inverse the inverse?", "score": 3, "replies": [{"body": "I'm saying you.....\n\n\nInverse inverse \n\n\nInverse inverse \n\n\nCha cha now ya'll, cha cha again.", "score": 6, "replies": []}]}]}, {"body": "This guy Stonks.", "score": 0, "replies": []}]}, {"body": "Imagine being this guy, not having the basic knowledge to know whether FB owned SNAP, and jumping into this subreddit to try to give other people investment advice.  Ban.", "score": 26, "replies": [{"body": "how those calls looking? your wife is worried.", "score": -16, "replies": []}]}, {"body": "bought SNAP 5/1 $9p", "score": 11, "replies": [{"body": "quantity?", "score": 3, "replies": [{"body": "1", "score": 15, "replies": [{"body": "U think we got cash laying around?", "score": 3, "replies": []}]}]}]}, {"body": "Earnings are on 4/21, why not make that $11 put for the 4/24 expiration?", "score": 8, "replies": [{"body": "I was seeing conflicting reports on what snap's earnings were on, 5/1 is playing it safe.", "score": -2, "replies": [{"body": "Got it. Thanks", "score": 1, "replies": []}]}]}, {"body": "I could see someone like Microsoft pull the trigger, but I don't know at what price. SNAP surely doesn't make sense as a standalone application anymore. I just tried out Snap Camera with teams and this shit belongs there 100%.", "score": 5, "replies": [{"body": "Someone will buy them at this rate, the question is are you buddy buddy with the dude who knows this before the market does?\n\nIf so let me know I won’t tell.", "score": 1, "replies": []}]}, {"body": "So I inversed this and am doing well", "score": 5, "replies": []}, {"body": "Gotcha, buying calls", "score": 3, "replies": [{"body": "No this tard doesnt know anything buy poots", "score": 1, "replies": []}]}, {"body": "I hope you realize there are maybe 15 articles all talking about anticipated low earnings for Snap. They already know this.", "score": 4, "replies": []}, {"body": "While OP may be an autist. Who uses Snapchat over things like Instagram video and tiktok anymore?", "score": 5, "replies": [{"body": "Eh, people who got used to using it 5 years ago. It's for direct communication whereas those other twos are more about updating an online gallery about yourself. All 3 can do both.", "score": 11, "replies": [{"body": "Yep. At this point it's just brand loyalty", "score": 0, "replies": []}]}, {"body": "? Snap is mostly used for sending videos and pictures from person-to-person. Instagram is just for stories and tiktok is literally Vine 2.0\n\nNone of these relate to one another", "score": 2, "replies": [{"body": "instagram you can just as easily send videos to people, snapchat is garbage", "score": 0, "replies": []}]}]}, {"body": "I wonder how much they rely on this cashflow to stay afloat. I'm sure they are underestimating the impact as well. Creative work (basically ad budget) is unfortunately the first thing that will be cut at these big corporations that advertise on SNAP.", "score": 3, "replies": [{"body": "\\-i accidentally said FB owns SNAP, they do not.", "score": 2, "replies": [{"body": "Facebook does not own snap retard", "score": 3, "replies": [{"body": "I corrected it", "score": 1, "replies": []}]}, {"body": "Would that mean that Facebook would keep them afloat through this crisis though? Looking through SNAP's 10k now to see how this year is looking for them.", "score": 1, "replies": [{"body": "Hey I fucked up, facebook doesn't own them. Ignore that. Snap's on their own.", "score": 0, "replies": [{"body": "Perfect then they are fucked, check their 10k. Going in on these positions with you man good luck.", "score": 1, "replies": [{"body": "What're you seeing in the 10k?", "score": 0, "replies": [{"body": "They raised $1.265 billion for debt financing that has about 19million in interest due semi-annually. I think this was probably a risky move when they filed for this in August of 2019 when the economy was booming. Now with the state of the world currently, and in the next two years, they will have some trouble with this load. Its not due until 2026 though not sure the implications of it.", "score": 2, "replies": [{"body": "They don't at all. 19 million is peanuts relative to their overall balance sheet. And due in 2026 just means they refinance then, when COVID is long gone. See my other comment and inverse this guy 100%", "score": 4, "replies": [{"body": "Got it I see what you are saying. Honestly the play is not the most ludicrous one and SNAP doesn’t feel like they are in a huge position to suffer from this virus. There are plenty of other companies that will be far more effected. I threw some money in just to see how it moves though cause this market is retarded.", "score": 1, "replies": [{"body": "hope you're happy with the gains <3", "score": 1, "replies": [{"body": "Cheers man I'm up 60%. Haven't sold yet gonna hold on and see how the rest of this week turns out.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "May 1 $11 were cheap....then this was posted", "score": 3, "replies": [{"body": "Welcome", "score": 1, "replies": []}]}, {"body": "inversed, let's see how that goes. just filed for unemployment. cannot get much lower anyway.", "score": 2, "replies": []}, {"body": "My 4/17 8p thank you for this reassurance.", "score": 2, "replies": [{"body": "if it hits 8 me and you will be swimming in tendies", "score": 1, "replies": [{"body": "Yea...prolly not happening but one can hope", "score": 1, "replies": [{"body": "after this press conference shit show don't lose hope haha", "score": 1, "replies": []}]}]}]}, {"body": "Goldman Sachs also said oil would go to 300. They're no different from this sub", "score": 2, "replies": []}, {"body": "Buying calls now.\nAlso you look like a girl.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "invert this screenshot it and i'll bet you that whoever of us is wrong gets banned", "score": 6, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "But its already $11.99", "score": 1, "replies": [{"body": "It's going lower. Puts print. Are you confused?", "score": 2, "replies": []}]}, {"body": "It's currently $11 and has been in the neighborhood of $11 for a month.  You are some sort of witch?", "score": 1, "replies": [{"body": "[How has it been in that neighborhood for a month? Also it is currently 11.9 (12.10 when I made the post) Where are you getting this information?](https://gyazo.com/5d7f4d10827b43b6eb150f39077cd404)", "score": 2, "replies": [{"body": "Down it goes, can’t wait for tomorrow.", "score": 1, "replies": []}]}]}, {"body": "Snapchat has a fuckton of cash though", "score": 1, "replies": [{"body": "no they dont....", "score": 1, "replies": []}]}, {"body": "Im holding 2022 leaps, what do I win?", "score": 1, "replies": []}, {"body": "My sister works for a global ad agency that’s making massive layoffs soon.\n\nCompanies aren’t paying for marketing.\n\nThis was a fantastic play to get into.\n\nFuuuuck", "score": 1, "replies": []}, {"body": "Snapchat is a garbage app anyways, hope it tanks out of existence", "score": 1, "replies": []}, {"body": "Got it. Bought SNAP 4/24 $19c", "score": 1, "replies": []}, {"body": "Isn’t SNAP part of SPY?", "score": 1, "replies": []}, {"body": "my only issue with this is that snap user activity has gone WAY WAY UP since the quarantine started.", "score": 1, "replies": [{"body": "this comment isn't aging well", "score": 2, "replies": [{"body": "lmao wtf are you talking about, this comment is 7 minutes old", "score": 2, "replies": []}]}]}, {"body": "I was following this. I guess the puts didn't work out. Hope you're ok.", "score": 1, "replies": [{"body": "i sold out for a 50% profit, didn't get greedy", "score": 1, "replies": []}]}, {"body": "Low revenues are definitely priced in, massive losses are the norm for snapchat anyway. They lose ~1 bn each year, real question is if they are facing solvency issues; with a working capital of ~2bn and a more than healthy quick ratio it's more than enough to tough out a shutdown for the whole year.  Your DD is garbage.", "score": 0, "replies": []}]}
{"title": "Bull Support Thread", "selftext": "[deleted]", "id": "fsji8s", "created_utc": 1585683045.0, "score": 127, "upvote_ratio": 0.72, "num_comments": 71, "comments": [{"body": "God damn it man, can we at least wait a little?? \n\nWe’re literally down less than 2% after getting fucked all of last week", "score": 263, "replies": [{"body": "Lmao right? Don’t jinx it.", "score": 82, "replies": []}, {"body": "Funny, but does not confirm my bias. Take my confused upvote", "score": 22, "replies": []}, {"body": "This is funny because it is going to RALLY tomorrow.", "score": 3, "replies": [{"body": "I'm a bull, but I'm gonna tell you this right now, the market opens red tomorrow. It might rally to green, but its opening red.", "score": 1, "replies": [{"body": "Green", "score": -1, "replies": [{"body": "Remind me! 9:30am 4/1/2020", "score": 3, "replies": []}, {"body": "Green huh? Premarket is -4%. Hope you didn't get too screwed on your calls.", "score": 1, "replies": [{"body": "Green", "score": 0, "replies": [{"body": "I made 200% this morning. How about you?", "score": 1, "replies": [{"body": "What are you a child?  I made 201%", "score": 0, "replies": [{"body": "Obviously I'm an obnoxious child.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "So far... Wed flat, thur-fri blood baths again. Just like every week since the bat dinner.", "score": 1, "replies": []}]}, {"body": "#too soon", "score": 94, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Green dildo as usual!", "score": 28, "replies": []}, {"body": "No, we will have a total closer to 10m unemployed.  The over 3m was just 1 week of claims, we already had over 2m unemployed before all of this, and this weeks will be 4m or higher from last weeks claims, if you can do math that is at least 9m confirmed unemployed", "score": 4, "replies": [{"body": "Wait, let me see. \n\nYeah, math checks out.", "score": 0, "replies": []}]}]}]}, {"body": "most bulls are probably up 100% or more if they bought early last week lmfao", "score": 48, "replies": [{"body": "If they sold by EOD Thursday, probably up 500%+. If they held until now, probably IV crushed to <100%.", "score": 10, "replies": [{"body": "But still gains, as in not down 70%+ like most SPY puts ~~diamond handers~~ bagholders", "score": 5, "replies": [{"body": "For sure. Should just be careful because today's gainholders are tomorrow's bagholders. Just like what happened to those SPY puts bagholders.", "score": 1, "replies": [{"body": "Implying we can’t make money anymore.\n\nAnybody with half a brain bought stuff far enough out to weather the storm. It’s bagholding when you close the position or your options expire worthless. Until then, it’s still a case of strong hands.\n\nSigned, a gay bear down 72% since the beginning of the month with puts expiring in May", "score": 4, "replies": [{"body": "Unless your put drops ITM far enough to actually cover the premium you paid, you're going to be fucked, and a lot of people with these absurd strike prices for SPY (anything below about $220) have literally not shot of getting ITM. At that point, continuing to hold just burns up time premium and IV crush will set in and fuck you", "score": 2, "replies": []}, {"body": "Bro, I am bag holding SPY puts too. It's ok to admit it. Bag holding means we are down but we are still holding. Yes the puts can (will?) still print, but until then they are bags.", "score": 1, "replies": []}]}]}]}]}, {"body": "Most bulls probably bought in yesterday judging from WSB", "score": 3, "replies": []}]}, {"body": "JPOW is changing toner. Wait a little you retard.", "score": 35, "replies": []}, {"body": "Gj you jinxed it.", "score": 8, "replies": []}, {"body": "I lost so much money today", "score": 9, "replies": []}, {"body": "Thanks dipshit", "score": 4, "replies": []}, {"body": "This sub is so fucking retarded now", "score": 4, "replies": []}, {"body": "Dumbass. We received a 2% decrease and you came in your pants. SPY noticed and is walking away.", "score": 4, "replies": []}, {"body": "THE FUCKENING HAS BEGUN!!!!!", "score": 9, "replies": []}, {"body": "Delete this and ban yourself", "score": 6, "replies": []}, {"body": "I NEED PUTS QUICK", "score": 5, "replies": [{"body": "Ford is gonna go down hard. Sales are going to be reported on April 2nd. Look at what happened to Chinese auto sales in Jan/Feb. Bought some sweet sweet puts near the peak today for April 3rd.", "score": 5, "replies": [{"body": "LOCKED IN", "score": 1, "replies": [{"body": "F $4.5P - 4/3 - 11 contracts\n\nF $4.0P - 4/3 - 10 contracts\n\nStanding by", "score": 5, "replies": []}]}]}]}, {"body": "Lolfest", "score": 2, "replies": []}, {"body": "This already aged poorly...", "score": 2, "replies": []}, {"body": "Buying the afternoon dip while big daddy JPOW massages his languid breasts as he prepares another PUMP everything short of a Holocaust was priced in nerds $retard ^^^", "score": 5, "replies": [{"body": "> JPOW massages his languid breasts\n\nI didn’t sign up for this", "score": -2, "replies": []}]}, {"body": "You fuckin idiot, wait for the market to close", "score": 2, "replies": []}, {"body": "Furloughs just started", "score": 1, "replies": []}, {"body": "This shit is fighting back btw", "score": 1, "replies": []}, {"body": "Fuck you look what you did.\n\nYou pissed off JPow and now we are all fucked", "score": 1, "replies": []}, {"body": "**BUY THE DIP F**", "score": 1, "replies": []}, {"body": "BuT EoM rEbAlaNcInG!", "score": 1, "replies": []}, {"body": ">implying people could predict a VIRUS OUTBREAK \n\nMad fucking bear who lost money on ALL HIS PUTS LMAO!! \n\nSTAY MAD BITCH!", "score": 1, "replies": []}, {"body": "This title made me so fucking angry I immediately opened the post only to see “JK”\n\nThank god, fuck these idiot bulls who didn’t get out of their calls today", "score": 1, "replies": []}, {"body": "Yeah I picked the wrong day to buy short calls to cover my long puts", "score": 1, "replies": []}, {"body": "I think we should stop fucking celebrating early.", "score": 1, "replies": []}, {"body": "You have to be a special type of retard not to see a drop coming and actually think this is a bull market. The markets been rising on no volume and the news is getting worse and worse. This is just a technical move, a simple chart pull back. You'd be crazy to think there was anything bullish about this market yet. I predict the Dow hits 16k when we bottom out and I hope that's as low as it goes.", "score": 1, "replies": []}, {"body": "My 7 day reminder just came in. Looks like puts are even more fucked now.", "score": 1, "replies": []}, {"body": "Sup ~~losers~~ bulls?", "score": 1, "replies": []}, {"body": "RemindMe! 7 days", "score": 1, "replies": [{"body": "There is a 30.0 minute delay fetching comments.\n\nI will be messaging you in 7 days on [**2020-04-07 19:33:45 UTC**](http://www.wolframalpha.com/input/?i=2020-04-07%2019:33:45%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fsji8s/bull_support_thread/fm1qkzj/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffsji8s%2Fbull_support_thread%2Ffm1qkzj%2F%5D%0A%0ARemindMe%21%202020-04-07%2019%3A33%3A45%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fsji8s)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "lmao I came to post something similar glad you are ahead of me", "score": 1, "replies": []}, {"body": "Not a single one of my put options are increasing in any way that would have me agreeing this is the resurgence. I want it to be, but I think y'all are being a bit preemptive.", "score": 1, "replies": []}, {"body": "Dude, kindly shut the fuck up. Please. The market has proven to be rigged already. It’s down 1.6% today after an inexplicable week of green and you’re acting like the jig is up and the fed has lost all control. \n\nIt hasn’t. They will print anything necessary to keep this bastard afloat. You sound like an absolute fucking retard. Did you just wake up after a three month nap? This market is completely and utterly irrational and is not governed by facts or reason at this point. I’m holding puts too but Jesus fuck, can you PLEASE at least wait for a circuit breaker or two to freak out? It’s like people don’t pay attention to anything", "score": 1, "replies": []}, {"body": "Youve identified a small correction in our current bull run. Sry bear. \n\nBut going cashgang before close since this rebalancing nonsense has me spooked.", "score": 0, "replies": []}, {"body": "Be ready for The Big Green Dildo Daily April! There is only one prophet - Papa Pow!!!", "score": -2, "replies": []}, {"body": "Lettttttt it burrrrrrrrrrrrrn🔥🔥🔥🐻🌈", "score": -2, "replies": [{"body": "🍆💦🔥🔥🔥...🌈🐻", "score": -1, "replies": []}]}, {"body": "🌈🐻🍆💦", "score": -2, "replies": []}, {"body": "Red finally. Popped a boner. 💎🖐🏻s my 🌈🐻s.", "score": -2, "replies": []}, {"body": "Just don’t fucking dance", "score": -4, "replies": [{"body": "Pussy", "score": 2, "replies": []}, {"body": "OPPA GANGNAM STYLE", "score": 1, "replies": []}, {"body": "Fuck you, I’m doing the merengue if I can get out of these puts lol", "score": 1, "replies": [{"body": "Hold you 🐻 🌈", "score": 0, "replies": []}]}]}]}
{"title": "WSB Tries to Predict the Market", "selftext": "Sup friends -\n\nI don't interact here much but I have found myself reading a lot of threads lately and everyone seems to have an idea about where the market will head in the next few months, my idiot self included.  Since I know none of you know what the hell you're talking about I figured I'd just show you that you don't with an experiment.  I have opened a google survey which will remain open until the end of the day tomorrow where each of us can put in where we think the dow will be at the end of April, May, ... all the way to September (6 months).  When the time comes I'll compare the results to what actually happened this next 6 months and we can finally see if the sub is too bear or bull.\n\nYes I am aware the S&P is a better indicator.\n\nAnyways please fill out the survey with numeric answers only so we can all see that we're mentally impaired.\n\n&#x200B;\n\nYou'll need a google account:\n\n[https://docs.google.com/forms/d/e/1FAIpQLScAxqs4Tz2aJDlyEpYbEVYWq1JFP-U63\\_LwrXSW1sMjmNYodw/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLScAxqs4Tz2aJDlyEpYbEVYWq1JFP-U63_LwrXSW1sMjmNYodw/viewform?usp=sf_link)\n\n&#x200B;\n\nEdit: Happy to release the predictions in a few days if this generates enough responses to be statistically relevant.\n\nEdit 2: Yes I am the FBI collecting your email addresses.  You're signing in so that nobody can respond more than once not because I get any of your information.  I can make a mod a collaborator on the survey so that they can see what I'm collecting, which is nothing but responses.\n\nEdit 3: Survey responses are slowing down, here' s a current summary for a little under 100 responses.  [https://imgur.com/a/r7dWau0](https://imgur.com/a/r7dWau0)", "id": "fsk37a", "created_utc": 1585684900.0, "score": 84, "upvote_ratio": 0.76, "num_comments": 71, "comments": [{"body": "[deleted]", "score": 180, "replies": [{"body": "so hard rn", "score": 30, "replies": []}, {"body": "WAT", "score": 16, "replies": []}, {"body": "Hold my hand", "score": 11, "replies": []}, {"body": "I wanna go lower...\n  \non you", "score": 10, "replies": []}, {"body": "Sep, with the knowledge you gained in the last few months, you should make videos .  I'd pay for that.", "score": 20, "replies": [{"body": "I read there was a twitch stream he/she did. I missed it", "score": 8, "replies": [{"body": "Here you go.\n\n[https://www.twitch.tv/videos/576598992](https://www.twitch.tv/videos/576598992)", "score": 6, "replies": [{"body": "Excellent. Thanks!", "score": 3, "replies": []}]}, {"body": "He’s done two w/ booyah", "score": 2, "replies": []}]}, {"body": "Gay porn only", "score": 2, "replies": []}]}, {"body": "Don't stop I'm almost there", "score": 6, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": []}]}]}, {"body": "That gap in the 2300s is looking tasty.", "score": 2, "replies": []}, {"body": "Just a quick thanks - I thought about your points on the price of gold from the live stream and had a look at GLD. To me, from a technical standpoint, the price was (due to drop)[https://www.tradingview.com/x/KcyQ7ovb/], so yesterday I bought puts. And today? What do ya know, (it broke out of its squeeze)[https://www.tradingview.com/x/7A4LdHez/] and fell. Yay, up 33% on those puts in 24 hours. \n\nI didn't get get on board because of TA though, I was conscious of your thoughts that overpriced gold is a ripe target both for portfolio rebalancing and for taking profits to shore up margin calls. I find it interesting that Gold had such movement today on an otherwise fairly flat day for the SPY.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "GLD puts? Nice. Hope it continues to drop!", "score": 2, "replies": []}]}]}, {"body": "DIX is up to a high right now. Are people feeling bullish again? Do you see SPY rising back up a substantial amount again?", "score": 1, "replies": []}, {"body": "So it is", "score": 1, "replies": []}]}, {"body": "Friends? We ain't even acquaintances.", "score": 95, "replies": [{"body": "I see you all as the enemy", "score": 37, "replies": [{"body": "Enemy of my enemy is my... autist", "score": 17, "replies": [{"body": "Enemy of my autist is a retard.", "score": 4, "replies": [{"body": "I am my enemy", "score": 5, "replies": [{"body": "can we forget about the things I said when I was drunk?", "score": 3, "replies": []}]}]}]}, {"body": "They're the enemy, they're the ones taking everything from us!", "score": 1, "replies": []}]}, {"body": "I’m not your buddy pal", "score": 1, "replies": []}]}, {"body": "Off to a good start here\n\n[https://imgur.com/a/VQtsJps](https://imgur.com/a/VQtsJps)", "score": 94, "replies": [{"body": "Why the fuck would you use dow? That will fuck the results up you retard nobody here trades the dow have you been here for 24 hours?", "score": 14, "replies": [{"body": "For fucks sake use SPY that's all we give a fuck about\n\nWe all use robinhood we don't have Dow or SPX", "score": 7, "replies": []}]}, {"body": "You asked a bunch of retards for predictions of the future...what did you expect?", "score": 7, "replies": []}]}, {"body": "The fuck is the dow", "score": 68, "replies": [{"body": "It’s like spy, but for old people.", "score": 46, "replies": [{"body": "So then SPY is like QQQ, but for millennials?", "score": 12, "replies": [{"body": "QQQ is like spy, but for gen X.", "score": 11, "replies": []}]}]}, {"body": "I think its the guy who cleans the stock room floor, MR. Dow.", "score": 8, "replies": [{"body": "Ah yes, where are all the stocks are stored. Must be a mess right now. Short Mr. Dow.", "score": 3, "replies": [{"body": "You're right, my grandpa said Mr. Dow was short as well.", "score": 1, "replies": []}]}]}, {"body": "It’s something with numbers something something", "score": 3, "replies": []}, {"body": "That thing they made shirts and hats off", "score": 1, "replies": []}]}, {"body": "Fuck you this is JPOW trying to figure out how to screw us as hard as possible", "score": 14, "replies": []}, {"body": "Predict the Dow ? Ok boomer", "score": 23, "replies": []}, {"body": "Pretty sure someone already does this and has been doing this\n\nu/_FundingSecured420 I think?", "score": 10, "replies": []}, {"body": "*Nice try, China.*\n\nI'm not giving you my email so you can sell it and try to make tendies.", "score": 6, "replies": []}, {"body": "Hold my pp in your mouf", "score": 11, "replies": [{"body": "Suck and blow move it abouf", "score": 1, "replies": []}]}, {"body": "I answered every blank: \"what is dow\" I expect that to be the top response", "score": 4, "replies": []}, {"body": "I did \n\n* April 18000\n* May 20000\n* June 22000\n* July 27000\n* August 30000\n* September 30000\n\nBasically peak infection is prob sometime April, so probably bottom is around there as well. I guess by end of august we would have recovered.", "score": 5, "replies": []}, {"body": "Market is going to make it's move before your results are out.", "score": 3, "replies": []}, {"body": "For my records\nApril 15000\nMay 13000\nJune 12000\nJuly 11000\nAug 12000\nSep 13000", "score": 3, "replies": []}, {"body": "I don't even know anymore", "score": 2, "replies": []}, {"body": "This is like baiting for autists' personal information. To quote the FB overlord, \"They trust me. Dumb fucks\"", "score": 2, "replies": []}, {"body": "Whoops, did that say DOW? I filled in a bunch of SPY numbers. Gonna need the apocalypse to happen now.", "score": 2, "replies": []}, {"body": "Don't do it. Scammer", "score": 2, "replies": []}, {"body": "I know without a doubt 100% it;s going to move", "score": 2, "replies": []}, {"body": "Where do I enter my brokers account password.", "score": 2, "replies": []}, {"body": "PAY FOR MY DATA", "score": 1, "replies": []}, {"body": "I don’t have an account, mind sharing yours?", "score": 1, "replies": []}, {"body": "It's difficult to predict the market with those fucking printers spitting out green papers.", "score": 1, "replies": []}, {"body": "google account username data scraping intensifies", "score": 1, "replies": []}, {"body": "Dow? Really brah? You know 90% of this forum is up to their eyes in SPY options right?\n\nA better question would be how much money do you think Jpow is going to print... since employment, economics, markets, logic, and news headlines don't matter when you have brrrrrrrrrrrrrrrrrr.", "score": 1, "replies": []}, {"body": "I haven't seen a single person on here trading DOW", "score": 1, "replies": []}, {"body": "I put all spy values OOPS", "score": 1, "replies": []}, {"body": "I’ve never even looked at the Dow. All I know is S&P. You fucked up.", "score": 1, "replies": []}, {"body": "Mods ban this POS", "score": 1, "replies": []}, {"body": "Open red down to mid 250s then start climbing, we'll be seeing peaks of 270 by EOW. This big bottoming that everyone is hoping for (myself included) is just fomo. We'll see another bottom for sure but not off a cliff.\n\nSwitching to calls and leaving my 4/17 puts alone since they are worthless anyways. \n\nSPY 4/8 280c", "score": 0, "replies": []}, {"body": "Bruh you didn't have drop downs fuck off.", "score": 0, "replies": []}]}
