{"title": "[deleted by user]", "selftext": "[removed]", "id": "fbn23p", "created_utc": 1583027862.0, "score": 50, "upvote_ratio": 0.92, "num_comments": 65, "comments": [{"body": "A god damn nursing home. Corona is really going for the kill on this one.", "score": 38, "replies": [{"body": "The beer already wrecked ppls liver", "score": 3, "replies": []}, {"body": "“Beer virus”?", "score": 2, "replies": []}]}, {"body": "You retard, unless the ceo's get sick nobody fucking cares.  I've had a cough and mucus for the last month, I probably have the beer virus and I feel great. Buying calls monday", "score": 58, "replies": [{"body": "This. If anything amazon is going to destroy earnings next quarter due to everyone scared to leave their stupid houses. They’d rather amazon drivers bring the virus to their door. Easier than licking door knobs of nursing homes", "score": 28, "replies": [{"body": "Ok. So here's my plan. Get sick, order Amazon, Dominos, Uber Eats, and cheap escorts and infect them... Then we wait with OTM puts 3 weeks out.", "score": 10, "replies": [{"body": "That's some billions HBO shit", "score": 10, "replies": []}, {"body": "Order amazon, cough all over packaging then return them...big brain time", "score": 2, "replies": []}]}, {"body": "COST is gonna destroy earnings next week too fam", "score": 5, "replies": [{"body": "Unlikely. The run on goods at their outlets doesn’t affect the membership numbers unless people are willing to trade the membership fee for slightly discounted goods. If anything it will be sentiment related increase to SP but likely unrelated to earnings or guidance. People who won’t go to the stores will order from Amazon. That being said, if Amazon drivers are quarantined...", "score": 1, "replies": []}]}, {"body": "Except Amazon is all shit 3 party sellers from Chinatown.", "score": 2, "replies": []}]}, {"body": "Buying Microsoft 300c 3/6", "score": 14, "replies": []}, {"body": "The pope is infected he’s the CEO of the largest business the Catholic Church.", "score": 5, "replies": []}, {"body": "Lol", "score": 3, "replies": []}, {"body": "Long call Microsoft for this fall", "score": 2, "replies": [{"body": "What price and what month", "score": 2, "replies": [{"body": "Idk 185 Sep is my goal when I shift my RH account to options on Monday. Also going to do tesla, Costco, and apple. Long calls. Remainder of the money in my account will be full send Yolo of the most autistic shit I see on WSB on monday.\n\nLet's be real I need to look it over more.", "score": 3, "replies": []}]}]}, {"body": "Corona virus is a dry cough with no nasal congestion or drip.\n\nAll it would take is a few people getting it, and the governor shutting down the campuses for a few weeks. They'd try to work from home but it would really fuck up their work flow.", "score": 2, "replies": []}, {"body": "You should def load up on calls monday, fuck all this bs", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 24, "replies": [{"body": "Google HQ is in Mountain View, CA.\n\nThey do have an office in Kirkland just like many other software companies.", "score": 23, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "I’m an autistic 🌈🐻 so what do I know? 🤷🏻‍♂️ \n\nI just roll the dice and hope for the best", "score": 5, "replies": []}, {"body": "You are correct af don’t let them doubt your vibe!", "score": 5, "replies": []}, {"body": "Campus? I didn’t know google was getting into education, hopefully online. Long google then", "score": 6, "replies": [{"body": "Yeah. I’m majoring in gay bear psychology at the University of Google Kirkland campus.", "score": 2, "replies": [{"body": "University of Google will be a thing one day, and much sooner when people realize corona is serious and going to kill their boomer loved ones if the country doesn’t mass quarantine", "score": 2, "replies": []}]}]}]}, {"body": "Also an office in Seattle near the water.", "score": 2, "replies": []}]}, {"body": "Costco too", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "It's infected. Bing instead", "score": 3, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "They got hacked. Silk road it is.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "amazon offices are in seattle in the city and microsoft offices are in redmond not kirkland, what is in kirkland is my house so buy puts on me thx bye", "score": 11, "replies": [{"body": "thousands of employees from both live there though, most of em don't live in the office... but thx for the tip, got puts for 3/20", "score": 2, "replies": []}]}, {"body": "180 employees and 108 residents. Teachers be like why can't I get that ratio.", "score": 9, "replies": [{"body": "Because boomers", "score": 5, "replies": [{"body": "Lol. Useless fucks taking resources.", "score": 4, "replies": []}]}]}, {"body": "More than just Microsoft and Amazon. The whole bottom is about to fall out of the market if any of this is remotely true.", "score": 7, "replies": [{"body": "WTF do you mean IF it’s remotely true?    \n\nIt’s fucking absolutely true my friend.", "score": 5, "replies": []}]}, {"body": "It doesn’t matter.  The buy the dip mentality will supersede the few sellers.", "score": 4, "replies": []}, {"body": "Stfu muh calls!!!!!!!!\n\nSeriously the whole world is beyond stupid and over reacting.", "score": 3, "replies": []}, {"body": "Y’all should be buying MSFT leaps while they’re on discount", "score": 3, "replies": []}, {"body": "The average MSFT employee is like 25 years old", "score": 3, "replies": [{"body": "lotta boomer execs though", "score": 3, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "sticky dongus nerd?", "score": 3, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": []}]}]}, {"body": "What? Is this suppose to scare us? Pfffft.. all in TQQQ calls", "score": 2, "replies": []}, {"body": "Aren't most tech employees setup to work remotely?", "score": 2, "replies": [{"body": "Not Microsoft and Amazon. Security concerns and ideas about teamwork.", "score": 2, "replies": []}]}, {"body": "The news really isn’t that bad so far this weekend.\n\nOne old, sick person died ... okay.", "score": 4, "replies": [{"body": "Well, 52 people in an nursing home probably have it and will start dropping like flies. So buy puts next week?", "score": 2, "replies": [{"body": "Absolutely what I’m doing", "score": 2, "replies": []}]}, {"body": "Ya like I said Friday, it's gonna take atleast an outbreak of 20+ in the states to change the momentum come tuesday.\n\nWHO said that rate of virus was decreasing finally in China and that it's containable. That statement alone is going to drive stocks for atleast half the week. Unless something like I mentioned above happens in the next 24 hours", "score": 1, "replies": []}]}, {"body": "Puts for both myt be out of reach by then", "score": 1, "replies": []}, {"body": "Reporting in from an amazon building in Seattle, business as usual bro", "score": 1, "replies": [{"body": "!remindme 30 days", "score": 3, "replies": [{"body": "I will be messaging you in 30 days on [**2020-03-31 07:13:45 UTC**](http://www.wolframalpha.com/input/?i=2020-03-31%2007:13:45%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fbn23p/msft_amzn_monday/fj5xdz4/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffbn23p%2Fmsft_amzn_monday%2Ffj5xdz4%2F%5D%0A%0ARemindMe%21%202020-03-31%2007%3A13%3A45%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fbn23p)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}, {"body": "Why u downvote tho", "score": 1, "replies": [{"body": "wasn't me", "score": 2, "replies": []}]}]}, {"body": "I have some leftover food that I swear isn't from a Kirkland based nursing home if you want it.", "score": 2, "replies": [{"body": "If it isn't tendies... i dun wan et", "score": 2, "replies": []}]}]}, {"body": "In the meantime how many deaths from other flus have occurred in the US?\n\nThe corona virus scare qualifies for retard status.", "score": 1, "replies": []}]}
{"title": "UPS worker here.", "selftext": "[removed]", "id": "fbrs7f", "created_utc": 1583055325.0, "score": 306, "upvote_ratio": 0.87, "num_comments": 71, "comments": [{"body": "wtf is going on with this sub man", "score": 227, "replies": [{"body": "When people making minimum wage start following options traders...", "score": 31, "replies": []}, {"body": "Those coughs weren't priced in. The market will have to adjust accordingly now.", "score": 264, "replies": [{"body": "What about sneezes?", "score": 30, "replies": [{"body": "Sneeze air is at least 4x faster so leverage more on those.", "score": 49, "replies": []}]}]}, {"body": "All the people from All. They here for the karma points, not the index points.", "score": 19, "replies": [{"body": "They’re all just a bunch of cucks", "score": 3, "replies": []}]}, {"body": "It's the Reddit trend.  A sub is created and has a core group that build it up.  A big post gets it to the front page.  A massive influx of high/middle schoolers join and just spam memes and shit posts for karma and because they think they're hilarious.", "score": 11, "replies": []}, {"body": "UPS workers trading options. Fucking lol.", "score": 9, "replies": []}, {"body": "Autistic children who don't get enough attention at home trying to belong.", "score": 43, "replies": [{"body": "Basically an t/teenagers invasion.", "score": 19, "replies": []}]}, {"body": "fucking hate this sub now", "score": 23, "replies": [{"body": "Thanks WSBGod. Now every retard is here in the sub and we are stuck with them until they blow their school loans on options.", "score": 37, "replies": [{"body": "ugh let us lose and gamble in peace tired of these 500$ accounts talking bjg “i hope theres a pandemic hurr durr *account goes 200$ up*”", "score": 23, "replies": [{"body": "Pretty much a spot on description for 95% of this sub right now. Genuinely wishing for beervirus to sweep the US and tank the market....just so they can get like $2000.", "score": 35, "replies": [{"body": "Hey 2k here 2k there and before you know it I'm at 100k getting my dick sucked off on a yacht. Next", "score": -45, "replies": [{"body": "kys", "score": 31, "replies": []}, {"body": "Man you're the wrong kind of autist", "score": 1, "replies": []}]}]}, {"body": "What happened to the minimum account position? That's a rule, and it never seems to get enforced. I'm here to blow more than mommy's allowance, and I want to see others do so too. I hate this shit. Either get rich all at once or don't bother.", "score": 7, "replies": [{"body": "I've been here years.  Don't recall the rule.  What was it?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -5, "replies": [{"body": "ok well until u have 63k losses i still dont respect u", "score": 20, "replies": [{"body": "\"The master has lost more times than the amateur has practiced\"\nAncient WSB proverb", "score": 9, "replies": []}]}, {"body": "But but but how?", "score": 1, "replies": []}]}]}]}, {"body": "Lol why?", "score": 1, "replies": []}]}, {"body": "I didnt know it was possible to hate this sub more than investing but here we are", "score": 3, "replies": [{"body": "You take that back.  r/investing was and is still telling people to dollar cost average the \"dip\".  And downvoting advice on buying puts to hedge.\n\nMiraculously WSB gives exponentially better above than investing.", "score": 1, "replies": []}]}, {"body": "wtf do you mean", "score": -4, "replies": []}]}, {"body": "Didn't know UPS hired from an outreach program.", "score": 49, "replies": [{"body": "Union.\n\nPretty much all the Teamsters are special ed graduates.", "score": 9, "replies": []}]}, {"body": "Did the breathing sound labored? Something like *Kuh roh nah*?", "score": 38, "replies": [{"body": "You know... now that I'm thinking about it, it did sound a lot like that damn mexican beer brand that is now making my puts print.", "score": 15, "replies": [{"body": "Ups causing two crashes then one now and one when your pensions collapse.", "score": 1, "replies": []}]}]}, {"body": "What was the hand job count?", "score": 23, "replies": [{"body": "29 OP did everyone else but not himself.", "score": 15, "replies": [{"body": "Not true he was wanking me and he started wanking himself too. Lots of eye contact also. Op definitely gay.", "score": 4, "replies": []}]}]}, {"body": "I’m a UPSer as well and we have 747’s come in almost daily from China. \n🤷‍♂️🤦‍♂️\nSo what better than a highly contagious virus to come into the most highly dense and 3rd largest employer in the city of Louisville, as well as directly into the Midwest. \nUgg", "score": 9, "replies": []}, {"body": "so will i get my “Tendies” shirt on time or not?", "score": 7, "replies": [{"body": "Well depends on if you want me to cough on it or not. It will be an extra 10 dollar charge.", "score": 2, "replies": [{"body": "Shit I'll pay extra for you to cough on some clothes for me. How much are you charging to spit right in my mouth?", "score": 2, "replies": []}]}]}, {"body": "I’ve read it’s still infectious for 9 days so boxes aren’t out of the question. To bad my current employer won’t let me do options.", "score": 6, "replies": []}, {"body": "Wow. The fear mongering here is making me not want to read this sub anymore.", "score": 11, "replies": [{"body": "At least this sub is only saying the markets are going to die, and not every single living human on earth like the media is.", "score": 9, "replies": []}, {"body": "It’s not fear mongering. This is good news for the 🌈🐻", "score": 0, "replies": []}, {"body": "Then stop", "score": -3, "replies": []}]}, {"body": "Hey man I work for FedEx I think we need to use our jobs as a way to spread the virus more quickly I say we make sure we get it and then cough on all our packages so we can spread it wider and faster, we can take out whole towns, SPY to $20 by EOW!!!", "score": 15, "replies": []}, {"body": "That is the way cough cough cough", "score": 2, "replies": []}, {"body": "I've literally just seen the post being delated. \n\nFells kinda cool, but I really wanted to read it.", "score": 2, "replies": []}, {"body": "I dont no why all this hate, he only started working ups two weeks ago when he blew his $5m accounts like all us other phags", "score": 1, "replies": []}, {"body": "It started like this in Germany, where the government also doesn’t allow the doctors to do tests... \n\nNow after 1 or 2 weeks... the serious cases are showing up in the hospitals of Frankfurt https://www.fnp.de/frankfurt/coronavirus-frankfurt-drei-maenner-infiziert-13563879.html", "score": 1, "replies": []}, {"body": "Arizona Beverage Company - workers are coughing and sneezing while preparing big batches of drinks to all over USA. GOOD LUCK USA.", "score": 1, "replies": []}, {"body": "Username checks out", "score": 1, "replies": []}, {"body": "200 spy??  That would be nice for my first tesla. Hmmm", "score": 1, "replies": []}, {"body": "AND a fucking mouth breather. Gross.", "score": 1, "replies": []}, {"body": "UPS Worldport?\nLouisville, KY here.", "score": 1, "replies": [{"body": "me wing b, do international load.", "score": 1, "replies": [{"body": "Was in wing E years ago. Switched to Magna in shepherdsville making seats for Ford. Good money and less bullshit", "score": 1, "replies": []}]}]}, {"body": "good dd", "score": 1, "replies": []}, {"body": "Wish you filmed it. Keep stoking the fear and I'll keep stroking my cock.", "score": 1, "replies": []}, {"body": "Whoa a sneeze? Spy going to $1", "score": 1, "replies": []}, {"body": "I’ll second this... mf dude in front of me was having a coughing party with the old chick next to him this morning on my way in.... We’re all screwed here mate...", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": [{"body": "But this is a shitpost", "score": 5, "replies": [{"body": "The bot knows something we don't.", "score": 2, "replies": [{"body": "Even the bot's an autist here", "score": 3, "replies": [{"body": "\"Bautist\"", "score": 2, "replies": []}]}]}]}]}, {"body": "Take one for the team man if it’s brown it’s down fedex will still be here they are faster anyway thanks goodnight", "score": -1, "replies": []}, {"body": "Plus you're handling everyone's packages giving more people the virus", "score": -1, "replies": []}, {"body": "all jokes aside tho, hope ure ok!", "score": -1, "replies": []}, {"body": "Hey asshole make sure my packages don’t get stolen !!", "score": -7, "replies": []}]}
{"title": "Time to short bonds is coming soon.", "selftext": "So I posted this as a comment elsewhere but maybe it needs its own discussion here. \n\nThis panic is getting close to overblown for the long term. People still need shit, companies are going to have to make products and provide services. There may be a supply shock in the short term and one analog to look at would be the oil crisis of the early 70s. There was a fierce bear market that dropped the market almost 50% in a year. Stonks are going to do fuck all this year if we start seeing economic effects. \n\nBut I think one possible outcome of this panic that's getting overlooked here is triggering inflation. What's going to happen when products start to become scarce and people need to outbid others for more of them? You guessed it. Yet the 10 year yield hit a record low. I think the coming rout in bond prices will be the next big shoe to drop if we start seeing actual supply shocks. I might wait until we get any announcement from central banks on rate cuts. That should be the final nail in the coffin and should cement an upward price (inflation) spiral. \n\nThis isn't necessarily about the short term supply shock which would sort itself out in a few months, but about central banks overreacting and getting on the wrong side of inflation.  Bond prices will have to crash to reflect higher interest rates as central banks start to play catch up. \n\nTLDR: start shorting bonds especially if you start hearing talk of rate cuts. This is a contrarian play. TLT puts, or buy TBF, TBX.", "id": "fbwk1z", "created_utc": 1583080738.0, "score": 39, "upvote_ratio": 0.79, "num_comments": 72, "comments": [{"body": "Counterpoint. The fed may lower the interest rate making all bonds currently out there more valuable since new bonds will have lower yields.  So your bonds will go up not down.", "score": 67, "replies": [{"body": "Aren’t bonds already pricing in the rate cut? Seems like the only way they’re falling is if the Fed surprises everyone by not cutting rates.", "score": 25, "replies": []}, {"body": "Realistically speaking what risk is it to put cash into $bnd vs a corp junk etf like $angl .. I never really held cash in account so never really been an issue until now .. I’d hate to lose money trying to chase 2% return", "score": 3, "replies": [{"body": "My thesis is that bonds will go up in value (ones already issued now) once the fed lowers rates.\n\nJunk bond etfs have higher risk because there are more defaults in a recession so they wont experience the same gains probably. But what do i know.", "score": 2, "replies": []}]}, {"body": "It may, but then that's the absolute wrong reaction for the Fed to have and would be a screaming short signal on bonds. Rate cuts may help with liquidity and a demand shock. But if all that develops from this is a supply shock, central banks will find themselves on the wrong side of inflation so quickly they will have to hike the other way to play catch up and it would be painful.", "score": 5, "replies": [{"body": "Yes please please please jack up interest rates so all these 🦇🍜loving property investors in Canada go broke and I can buy all their shit for a discount .. I know WSB is all options and stonks but the RE market is soooooo overbought in this country", "score": 14, "replies": [{"body": "And no one can afford a home. Once the boomers start dying, housing prices are gonna drop like a shit from heaven.", "score": 21, "replies": [{"body": "I cant wait", "score": 10, "replies": [{"body": "I've been squatting for 5 years and mooching off the neighbor's wifi/stealing from their garden \n\nWon't affect me", "score": 10, "replies": [{"body": "So it’s you?! I thought that was a squirrel digging up my carrots and potatoes. I bought my place in June 09, quite by accident timing the market perfectly. Been waiting for another opportunity like this for years. Hopefully this pans out. This is quite possibly the best chance for millennials and gen x’ers to get in the game that they will ever get.", "score": 5, "replies": [{"body": "^ this.\n\nThen again, I doubt millennials will be as likely to hoard equity and RE as fucking boomers were. Gen xers tho... They're some greedy fucks, too.", "score": 5, "replies": [{"body": "heh you got me there", "score": 3, "replies": [{"body": "Honestly, in your position, I would sell rn and move to an apartment. Take the profits and re-up in three years", "score": 3, "replies": [{"body": "Na dude its a home not an investment.. I have lots of dry powder and good credit for the next one.", "score": 1, "replies": [{"body": "That's fair\n\nPersonally, I don't get attached much to dwellings anymore. On average, I've moved more than once per year I've lived so 🤷‍♂️ lol", "score": 2, "replies": [{"body": "Fair enough.. i have two kids and don’t really wanna uproot the family etc. My parents moved every year when I was a kid I fuckin hated it always being the new kid at school etc. Trying to give them some stability as they grow up.", "score": 2, "replies": [{"body": "Ey, team nomad represent lmao\n\nAt this point, I doubt very much that I'll have kids. Too hard, too expensive, too shitty of a world. I'd love a place to call a permanent home, but frankly I have too little faith in how the world is run to even bother having hope", "score": 2, "replies": [{"body": "Pro tip. I wouldn’t either, would stay single also. /Dadvice", "score": 2, "replies": [{"body": "Trying, but man my roommate looks tasty as fuck", "score": 2, "replies": [{"body": "I didnt say dont fuck her, just dont let her own any of your shit", "score": 3, "replies": [{"body": "She's not on the lease and it's basically a running joke at this point\n\nFigured out the hard way after my ex somehow infested my brain and convinced me to throw away all my furniture so she could move hers in\n\nWhen she left, I was 23 and I owned a desk and a twin-size mattress from the guest room lmao", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "They will be once they get some money and opportunity, just the way the world works.", "score": 2, "replies": []}]}]}]}]}, {"body": "Who wants their shitty 10 bedroom mcmansions though?", "score": 7, "replies": [{"body": "Right? I ain't got servants enough for that", "score": 1, "replies": []}]}, {"body": "Can't wait.", "score": 2, "replies": [{"body": "Please grandma just die so I can get some sweet, sweet inheritance to gamble away", "score": 4, "replies": []}]}]}, {"body": "Boomers paid off their houses in the states, only way to pick those house up is if they go boom boom.", "score": 4, "replies": [{"body": "Coronavirus has entered the chat", "score": 5, "replies": []}]}]}, {"body": "Many said the same thing about the trade war, but it never happened.  Product sellers just absorb the short term impact, and never pass it to consumers.\n\nInflation continues to be low, and the short pressure from two quarters of supply shock is unlikely to pressure the Fed to raise rates. \n\nThat said the bonds are unreasonably high here.", "score": 3, "replies": []}, {"body": "We had this shit happen before with the OPEC oil crisis. Supply side exogenous shocks can't be solved by Fed rate cuts. They may do more harm then good as they dent Consumer confidence approaching the ZLB again.", "score": 2, "replies": []}]}]}, {"body": "I just want to be clear: Are you aware that the lower the price of a bond, the higher the yield?", "score": 17, "replies": [{"body": "Yes.  Short bonds means you expect yields to rise and bond prices to collapse.", "score": 6, "replies": [{"body": "Ok. Don't you think firms are going to be scrambling to borrow to get them through these tough times, driving bond prices sky high and yields way way down?", "score": 11, "replies": [{"body": "Depends on the firm. Some sectors will be hit harder than others like travel,  hospitality and maybe transportation and they might need loans.  They may also choose to issue bonds themselves. What's going to happen when the market is flooded with corporate bond offerings? \n\nBut others will still have customers and still need products. Case in point: shelves are going empty in grocery stores. This is a simplified example but what could start to happen is stores hike prices because they're running our of stuff and they're not sure when they're getting more. The consumer still demands goods so inflation increases at the consumer level. Farther up the chain companies are vying for goods from the same suppliers so they can get them to their customers and refill their inventory. But maybe vendors say sorry,  I already have this shipment going to your competitor. We'll have more next week and by the way the price just went up 10%. Now you start to see the problem....\n\nI believe this risk is being severely underpriced since the last time anything like this happened on a widespread level was 50 years ago and it's been forgotten from the collective consciousness at this point", "score": 7, "replies": [{"body": "Maybe firms scramble to borrow, but no one wants to lend, driving bond price to rock bottom and yields to new highs.", "score": 5, "replies": [{"body": "Now you're getting it.", "score": 4, "replies": [{"body": "How do I lend money to TSLA? I have 50 bucks Elon can borrow but I want it at 20% over 10 years.", "score": 3, "replies": []}]}]}]}, {"body": "Firms scrambling to borrow = firms selling bonds, pushing prices down and yields up.", "score": 3, "replies": []}]}]}]}, {"body": "POST YOUR TITS OR YOUR PORTFOLIO", "score": 12, "replies": []}, {"body": "Better option is to short junk bonds via JNK or HYG.  Spreads have been tight as everyone has been reaching for yield for years.  They’re gonna go down either way, if we go into a recession (spreads vs treasuries widen) or if inflation starts going up (all bond fall)\n\nÉdit: Plus they’re one of the least likely QE targets...", "score": 7, "replies": [{"body": "Junk binds gonna have a lot of defaults soon?\n\nJNK 100 June 18, 2021 leap puts are 4.70. That the play?", "score": 3, "replies": [{"body": "I'm not sure the exact holdings of JNK, doubt you'll see too many outright defaults soon expect possibly for some of the super leveraged small oil & gas companies.  \n\nBut I suspect spreads will widen.  Personally, I think the play is much shorter term.  FWIW I'm in 17 Apr 105/100 put spreads on JNK.  That's not a super aggressive way to play it though...", "score": 1, "replies": [{"body": "Thanks! Question please. When do you a spread like that you are buying the 105 put and selling the 100 correct? What did it cost you to do that？\n\nBecause, as I understand it, you need to have the reserves to cover the put you sold right? So that’s like 11k?\n\nOr is there some formula for when you execute that move that requires less money?\n\nThanks so much!", "score": 1, "replies": []}]}]}]}, {"body": "I came to the same conclusions you did. I will be buying puts on TLT if it gets north of $157 this week.", "score": 4, "replies": []}, {"body": "You forget about QE, my son", "score": 10, "replies": [{"body": "Fed won't be able to do QE if inflation spirals out of control. In fact that's the opposite reaction of what it will need to have. It will need to tighten policy and hike rates.", "score": 9, "replies": [{"body": "I think you're on to something. Low supply", "score": 4, "replies": []}]}]}, {"body": "Bonds only go up", "score": 3, "replies": []}, {"body": "We goin NEGATIVE like every other country", "score": 3, "replies": []}, {"body": "Take profit on TLT and don't buy more until US10Y goes near 1.5%.", "score": 2, "replies": []}, {"body": "I think this may happen at the end of the year but no way I'm touching that trade right now.", "score": 2, "replies": []}, {"body": "I mean, the fed trades bonds, right?\n\nAnd they're pretty public about their upcoming bond trading plans... \n\nSeems kinda simple, if they're expanding/easing = long\n\nIf theyre contracting/tightening = short\n\nIf they're lowering rates = long\n\nIf they're raisong rates = short", "score": 4, "replies": [{"body": "Is lowering and cutting rates not the same thing?", "score": 3, "replies": [{"body": "Fixed", "score": 1, "replies": []}]}]}, {"body": "So ive got a few million in the bank, what the fuck so i do. Am retarded. Help.", "score": 2, "replies": [{"body": "Buy SPCE, no CoronaVirus in space", "score": 3, "replies": [{"body": "Ohhhhh", "score": 1, "replies": []}]}, {"body": "Cash. Big puts on stocks. Small puts on bonds to protect your cash against inflation.", "score": 2, "replies": [{"body": "Big puts you say?", "score": 1, "replies": [{"body": "If I were in your shoes with a million dollars and this crisis I would not trust stocks bonds or cash\n\n1) stocks are crashing obviously\n2) factories closed, limited supply, inflation will run rampant so you need to hedge against inflation. Inflation will devalue both bonds and cash\n\nSolution: invest in commodities to hedge against inflation\n\nTIP would be a good hedge against inflation\n\nGLD would be a great bull stock during inflation\n\nRealestate is usually a good commodity but it's likely inflated. REIT ETF would be good to buy at the bottom of this collapse. People always need housing. \n\nAnd lastly I would put a percentage in PUTS to make money off this collapse. \n\nIf I had a million my first priority would be to protect it. I'd have none in stocks. 25% BND, 25% TIP, 25% GLD, 10% cash, 5% a mix of PUTS and CALLS. \n\nPUT Tesla, Nike, Apple\nCALL SQQQ, GLD\n\nAnd when inflation takes off be ready to sell BND and buy either GLD or REIT if the price is right", "score": 1, "replies": [{"body": "Cool thanks!", "score": 1, "replies": []}]}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "What is the timing of this though?  People are hiding their money at the moment and tlt is printing", "score": 1, "replies": [{"body": "I am willing to wait until any rate cuts are announced and then jump in. Could be within the next month.", "score": 1, "replies": [{"body": "So rate cut today, what’s your play tomorrow cause tlt ended in the green", "score": 1, "replies": []}]}]}, {"body": "Umm.. day late and dollar short. Hikes incoming.", "score": 1, "replies": []}]}
{"title": "DD: Chinese Manufacturing", "selftext": "Listen up, you smoothed brain retards. You think that just because the markets have fallen farther than your pants when you're at the urinal (with your shirt tucked under your chin) that it's time to buy the dip?   \n\n\nWell that's why you're a smoothed brain retard. we are going to have sustained supply chain disruptions well into Q3 and Q4 that will continue to provide 🌈🐻 gang with the premium non-generic brand tendies. \n\nChina released its Manufacturing PMI on Friday, which was a whopping \\*\\*35.7\\*\\*. For context, the lowest it's ever been was 37.8, and that was during november of 2008. Moreover, the only thing that china is consistently good at is lying about official numbers, so that numbers in reality are most likely closer to 25-30.\n\nhttps://finance.yahoo.com/news/china-february-manufacturing-pmi-drops-162233535.html  \n\n\nFurthermore, analysts were anticipating that number to be somewhere around 47, but clearly the yoga they have been practicing since new years has gotten them flexible enough to get their heads far enough up their asses to think that quarantining 700 million people in the largest manufacturing country on planet earth would only drop the index by 6-7 points - ie the true consequences of this supply chain disruption hasn't been priced in yet. \n\nWhat's the play? any retail that heavily relies on chinese imports. For example, WMT will most likely see the largest hit, as their logistics structures are centered around lean invetory management - meaning that they forecast and order from their vendors every week to keep inventory levels low so they don't waste money on storage and moving unnecessary products. Even if they order enough in large volumes now to get them through the next few months, it will be may-June that they start seeing major disruptions in their product lines because there's nothing coming behind it. And for a retailer that lives on 2-3% margin, they're going to get absolutely ass blasted. \n\nIf WSB wants to really vandalize the markets, start compiling lists of retailers and manufactures that rely on chinese goods - and start looking at puts with expirations of June-July. ", "id": "fc1c74", "created_utc": 1583099562.0, "score": 134, "upvote_ratio": 0.92, "num_comments": 72, "comments": [{"body": "Find companies that are dependent on Chinese supply chains that are smaller than WMT. They have the biggest dick on the table and whatever does come out of China will be theirs. I’m doing my research on it now, but we may see smaller players go completely under. WMT has a somewhat diversified supply chain and one of the best supply chain teams in the world. They will fare better than others. Hunt the others.", "score": 53, "replies": [{"body": "Wayfair puts.", "score": 7, "replies": []}, {"body": "Such as $FIVE", "score": 4, "replies": []}, {"body": "Rumors that Walmarts will become FEMA distro's", "score": 5, "replies": [{"body": "tldr: long FEMAmart", "score": 7, "replies": [{"body": "I just hope FEMA keeps making those little $.25 cherry pies with 60 grams of sugar in them. Shit gets bad I can live on them.", "score": 6, "replies": []}]}, {"body": "How do I go long on martial law?", "score": 2, "replies": []}]}, {"body": "What.would you think of Abercrombie? Nike? Ralph Lauren?", "score": 1, "replies": []}]}, {"body": "Practicing yoga? ...So LULU Calls?", "score": 23, "replies": []}, {"body": "I don’t see a fucking ticker or strike", "score": 51, "replies": [{"body": "VXX $300,000 3/2", "score": 18, "replies": []}, {"body": "Are you stupid?", "score": 7, "replies": []}, {"body": "Found the WMT shopper", "score": 9, "replies": []}, {"body": "WMT dipshit", "score": 8, "replies": []}]}, {"body": "I actually live in Bentonville Arkansas the world wide HQ for WMT. I walked up and asked the high level executives about their supply chains and products out of China. They told me to shut the fuck up and finish mopping the floor. So they are angsty...puts?", "score": 8, "replies": [{"body": "Alice Walton can lick a brick", "score": 3, "replies": []}]}, {"body": "not a single ticker, strike, or expiration -- this piece of shit", "score": 43, "replies": [{"body": "WMT - First line of second paragraph. Still way too much to read.", "score": 17, "replies": []}, {"body": "What the fuck do you need a ticket for.\n\nEdit: the scrub fixed the post to ticker. It said ticket. Such a loser.", "score": 1, "replies": [{"body": "They want to be spoon fed", "score": 1, "replies": []}]}, {"body": "Another retard", "score": -1, "replies": []}]}, {"body": "Ports facilities are a great one as well. Less containers coming in means Tendies opportunities", "score": 7, "replies": [{"body": "Ah smart", "score": 1, "replies": []}]}, {"body": "* If WSB wants to really vandalize the markets, start compiling lists of retailers and manufactures that rely on chinese goods - and start looking at puts with expirations of June-July. \n\nWhy don't you do some work yourself??", "score": 20, "replies": []}, {"body": "Anything that mentions ass blasting gets my money", "score": 4, "replies": []}, {"body": "This is the way.", "score": 9, "replies": []}, {"body": "https://www.wsj.com/articles/coronavirus-is-different-almost-no-company-is-safe-11583064000?mod=mhp\n\nIs the WSJ fake news too? Lmfao", "score": 3, "replies": [{"body": "I'm not clicking that link. Their paywall makes me furious. Fake news indeed.", "score": 1, "replies": []}]}, {"body": "amazon makes huge commissions on goods sold on amazon but shipped from china by chinese companies", "score": 3, "replies": [{"body": "But also has AWS, which only stands to benefit from a work-at-home situation", "score": 9, "replies": []}]}, {"body": "So buy calls?", "score": 3, "replies": []}, {"body": "How did you not mention the US ISM PMI numbers being released tomorrow at 10:00am EST? If those estimates are wrong ...it will also contribute to this shit show.", "score": 3, "replies": []}, {"body": "WMT 6/19 $105.\n\nYou're welcome.\n\nFFS...", "score": 3, "replies": [{"body": "by then it will have recovered. You're overpaying for the time, it will be priced in as soon as the CEO says they're getting dicked by this and then you're bag holding for another 3 months.", "score": -1, "replies": [{"body": "Yeah cause you're not allowed to sell before expiration huh.", "score": 6, "replies": []}]}]}, {"body": "Shut up and make me tendies. What is the play here?", "score": 4, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Solid thoughts... Thinking Nordstrom's is a strong play JWN Puts at $30 strike July 17th Expiration $2.63 as of now... would consider $3.00\n\nNordstrom's debt is looking tasty", "score": 2, "replies": []}, {"body": "They should limit posts to 140 chars. Gone after the first paragraph. 🤦🏻‍♂️", "score": 1, "replies": [{"body": "This is why you lose half of your portfolio in a day. You can’t take the damn time to read a couple paragraphs and get some knowledge about a stock you potentially might want to invest in. Go ahead and lose it all champ.", "score": 2, "replies": [{"body": "Sarcasm...", "score": 1, "replies": []}]}]}, {"body": "Fucking fairy dust it doesn't exist", "score": 1, "replies": []}, {"body": "Recreational MJ biz relies heavily on packaging and accessories from China. This is going to at minimum lower margin as they search for more costly product replacements", "score": 1, "replies": []}, {"body": "Jesus fuck, TLDR this for our smooth brains", "score": 1, "replies": []}, {"body": "Sounds like we should buy up WMT crap and eBay it", "score": 1, "replies": []}, {"body": "TJX, GES, TGT, DDS Puts", "score": 1, "replies": []}, {"body": "6 paragraphs and a link? Jesus Christ, how many puts do you have? You gonna shit your pants when the nasdaq closes above 8900 tomorrow", "score": 1, "replies": []}, {"body": "dont betray WMT...", "score": 1, "replies": []}, {"body": "I don't know which retards would expected anything above 30 when China already shutdown for whole month!!!!", "score": 1, "replies": []}, {"body": "Did you buy WMT puts? CALLS are up hundreds of % lol. People are stocking up like crazy from WMT and COST. China is getting back to work. \n\nUnless people get so sick they aren't going outside, these stonks are going up for now", "score": 1, "replies": []}, {"body": "DG and DLTR", "score": 1, "replies": []}, {"body": "You don't even need to be autistic to see China is asshole.", "score": 1, "replies": []}, {"body": "My company imports from China.  There is no way there will still be disruptions in Q4.  There may not even be disruptions in Q3.", "score": 1, "replies": [{"body": "Are you seeing delays now? No one knows what Q3 looks like now. That's obvious", "score": 1, "replies": [{"body": "Yes.  Factories are just now getting back to work at full capacity.  March and April will be the 2 months most small companies will be out of inventory.  We have been raising our prices to slow down sales.  I expect everything to be back to normal around the beginning of May.", "score": 2, "replies": [{"body": "Not sure what your factory mfgs, but I imagine airline industry having poor performance creates monsterous impacts to all supply chains. \n\nGuess we'll see how ISM PMI reports out tomorrow.", "score": 1, "replies": []}, {"body": "Keep in mind this is with current infections, not future infections. Things may get a lot worse.", "score": 1, "replies": [{"body": "I thought it is pretty much a consensus that the worst for China is over with?  That is how I have seen it playing out.", "score": 1, "replies": [{"body": "Cases are decreasing because the quarantines have been effective but it remains true that they are not accurately reporting the cases and little is known about this virus. Medical professionals don't seem to believe anything is certain.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Ban for repeating shit we already know", "score": -2, "replies": []}, {"body": "How do you pick the sweetest, ripest fruit to squeeze?  Do you look for high P/E ratios?  Read into the 10k for financial problems?  What are the red flags for the weakest of the herd?", "score": -1, "replies": []}, {"body": "Priced in baby. Stonks only go up.", "score": 0, "replies": [{"body": "I hope this guy actually bought WMT puts. Up like my dick when his sister comes over", "score": 1, "replies": []}]}, {"body": "Priced in retard.", "score": -9, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "fc34gf", "created_utc": 1583107013.0, "score": 135, "upvote_ratio": 0.97, "num_comments": 75, "comments": [{"body": "So I can buy futures at IB and sell at Investing and make free money?", "score": 91, "replies": [{"body": "Beat the market using this ONE WEIRD TRICK!", "score": 59, "replies": [{"body": "Brokers hate him", "score": 29, "replies": []}]}, {"body": "Is this arbitrage?", "score": 10, "replies": [{"body": "yes", "score": 6, "replies": []}]}, {"body": "r/shittyarbitrage", "score": 9, "replies": [{"body": "god I wish that sub were real", "score": 8, "replies": []}]}, {"body": "No arbitrage 4u", "score": 2, "replies": []}]}, {"body": "shrugs barely moving...maybe its gonna open green...sigh my puts...", "score": 21, "replies": []}, {"body": "Nothing Matters until it opens at 9:30 tomorrow", "score": 10, "replies": [{"body": "Well, that's not cool.", "score": -1, "replies": []}]}, {"body": "Only 25000 till zero", "score": 23, "replies": [{"body": "Buying dow 0 3/6 puts", "score": 29, "replies": [{"body": "Then we go into the negative and these bozos are paying me money to take their stonks. looks like I’m printing either way boys", "score": 2, "replies": [{"body": "Literally can't go tits up.", "score": 1, "replies": [{"body": "Stonks go up, bears go down", "score": 2, "replies": []}]}]}]}, {"body": "The best DD I’ve seen all weekend.", "score": 3, "replies": []}]}, {"body": "TL;DR, markets fucked", "score": 25, "replies": [{"body": "Bulls fckt", "score": 8, "replies": []}]}, {"body": "So what you’re saying is buy puts til your fingers bleed?", "score": 9, "replies": []}, {"body": "How often are futures wrong? Serious question.", "score": 14, "replies": [{"body": "They’re just not worth getting fired up for one way or the other.\n\nIn the last hour, they’ve already bounced from like -2.5% to -0.7%\n\nEnjoy the night and check in at opening bell ... no levers for you to pull between now and then anyways.", "score": 49, "replies": [{"body": "Thanks Burt.", "score": 13, "replies": []}]}, {"body": "Futures traders are some of the most retarded people on the planet.", "score": 27, "replies": [{"body": "Haha, after watching them every day this week I have to agree.", "score": 7, "replies": [{"body": "Futures traders are WSB on HIV laced Adderall. They're gambling harder than our puts were before the trade war fear phase", "score": 3, "replies": []}]}]}, {"body": "Remember when /es futures slid bigly when the us killed that Iranian guy, then they opened green the next day", "score": 10, "replies": [{"body": "I don’t. How big does the slide compare to tonight’s. I don’t really follow futures.", "score": 1, "replies": [{"body": "It opened tonight higher than Fridays lows. People are all worked up over nothing.", "score": 3, "replies": []}]}]}, {"body": "Never. Just like the market is never wrong", "score": 2, "replies": []}, {"body": "See look at futures now", "score": 1, "replies": [{"body": "Nasdaq green, Dow red, is that what you’re seeing.", "score": 2, "replies": []}]}]}, {"body": "It’s down about 600 points but staying fairly stable the last 45 min", "score": 7, "replies": []}, {"body": "Wtf is this retarded bullshit! Fucking markets fixed I'm going to jerk off with my tears as lube and sulk", "score": 3, "replies": []}, {"body": "*pokes with stick*\n\n\"is it dead, or is it just fakin'?\"", "score": 3, "replies": []}, {"body": "Can confirm investing.com is the most up to date source", "score": 8, "replies": []}, {"body": "Seem to be holding up considering.  We open down 300 or so, then we go green.", "score": 6, "replies": [{"body": "Why would it turn green? Does the current situation scream economic growth to you", "score": 15, "replies": [{"body": "It’s called panic, irrational selling and overselling.  I’ve done this professionally 23 years and it happens EVERYTIME.  It’s NEVER different.  Y’all just act like it is.  Name a time the market corrected and didn’t rebound to a new high?", "score": 8, "replies": [{"body": "No buddy I think the WSB autist with 6 months of experience dumping his entire portfolio value into meme stocks knows better than a fucking dumb professional.", "score": 14, "replies": []}, {"body": "It will rebound to a new high definitely. Just not right now", "score": 1, "replies": [{"body": "I’m not implying it is now.  But I do at least see a short term rebound and the panic subsiding some.  We may have another leg down, but I’d be wary of being short.", "score": 1, "replies": [{"body": "Panic subsidizing before announcing a pandemic in the US and before UK cities are locked down? You're a financial advisor with clients. You're just a glorified sales person. I was going to be an advisor until I realized I didnt want to sell people shit they dont need for my livelihood", "score": 5, "replies": [{"body": "Right.  With a degree in finance, Series 63,6,7,9,10 and insurance license and $120 million dollar book of business and published book on Amazon.  Tell me your qualifications again?", "score": 2, "replies": [{"body": "Masters in quantitative economics. Series 6, 7 and CFP. Yeah what's your name? Prove it. Otherwise you're just pandering. Anyone working at Edward Jones can have a book of business that large or just bought it from an advisor retiring", "score": 3, "replies": [{"body": "Like I’m going to post that on this sub.  I’m on brokercheck with JPMorgan.", "score": 1, "replies": [{"body": "So is it even your book of business or does JP morgan own it? You're full of shit then I have no reason to believe you. An advisor posting on gaming and trolling memes, okay. No advisor I know does", "score": 9, "replies": []}, {"body": "How did your big clients do last week?", "score": 1, "replies": [{"body": "It varies.  Some are flat for the year, some slightly negative.  They don't panic like the small investor's do.  It's why they have money and the little investor doesn't.  There's a reason it's called smart money and dumb money.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "That sweet sweet oversold bounce, reading this sub reminded me how stupid most people are on hrre", "score": 2, "replies": []}]}]}]}]}, {"body": "600 down already", "score": 2, "replies": [{"body": "You guys are doing the same thing he just mentioned in the title. Using two different metrics.", "score": 7, "replies": []}, {"body": "I’d look again", "score": 1, "replies": [{"body": "It's still down the same amount -- the reference point was just updated.", "score": 2, "replies": [{"body": "People don't understand that the market continued to go up after closing on Friday. So when these numbers are calculated from 4pm now, it doesn't take into consideration for the market continuing going up until 8pm. Technically it down 250 from the 4pm mark but it is really down 600 if you reference the post market 8pm numbers.", "score": 2, "replies": []}, {"body": "Big oof", "score": 0, "replies": []}]}, {"body": "Do basic maths. 25,700 - 25,100 =  _______", "score": -1, "replies": [{"body": "4pm close was 25,400.....", "score": 2, "replies": []}]}]}, {"body": "think you mean 350 nub", "score": 0, "replies": [{"body": "It closed at 25700, just because they count from 4pm doesn't mean it's any less bad.", "score": 0, "replies": []}]}]}, {"body": "Big re alert 🚨", "score": 1, "replies": []}]}, {"body": "lol its gree  yall, asia got a big ass green candle up their ass", "score": 2, "replies": [{"body": "Trump and Pence literally can’t go tits up!", "score": 1, "replies": []}]}, {"body": "Gold is mooning", "score": 2, "replies": [{"body": "I’m half tempted to sell my physical gold, but I think waiting till it hits $1800-2k is smarter.", "score": 1, "replies": [{"body": "Not easy to buy options on physical gold. Just sayin'.", "score": 2, "replies": []}]}]}, {"body": "This didn’t age well", "score": 1, "replies": []}, {"body": "Erm, change is suppose to calculated from previous day close or did they messup close time", "score": 1, "replies": []}, {"body": "I should change my name to Nostradamus", "score": 1, "replies": []}]}
