{"title": "Tesla has a secret lab trying to build its own battery cells to reduce dependence on Panasonic", "selftext": "", "id": "c5rek3", "created_utc": 1561563937.0, "score": 96, "upvote_ratio": 0.95, "num_comments": 27, "comments": [{"body": "Well F\\*&!-ing duh. What was Maxwell about? Improving Panasonic's lines? Seriously.\n\n&#x200B;\n\nIt's pretty clear that:\n\n1) Musk will take stuff in house as soon as a third party dependency starts to be a problem.  It's his natural tendency and he's just looking for an excuse.\n\n2) There's been no bigger third party dependency problem than Panasonic.\n\n3) Tesla is working on building better battery manufacturing capability with help from the Maxwell acquisition.\n\n4) Panasonic saw the writing on the wall a while ago back when they stopped further investments in GF1 and focused on just improving existing manufacturing lines.\n\n&#x200B;\n\nIn the shareholders meeting Musk and co were visibly restraining themselves from spilling the beans on how they're addressing the battery issue. There's an active plan in the works they feel great about, and it sure doesn't seem to include Panasonic.", "score": 78, "replies": [{"body": "You know, one interesting thing is once they solve the battery production issue they can actually start to make some money from the powerpack and industrial scale battery side of things.  So, they'd have to go completely bonkers on battery production to actually overshoot on supply.\n\nIf they really have 20%+ better margins than competitors on batteries, they can sell the stationary battery solutions at market value and make good money.", "score": 32, "replies": []}, {"body": "For what it's worth, I strongly suspect they will continue to buy everything Panasonic will sell them in addition to their in house lines.  If Tesla batteries are way better performance-wise, they can always direct the Panasonic cells to the storage business.", "score": 3, "replies": [{"body": "Yeah, I've said the same elsewhere.  However, at some point the Maxwell lines will be more cost effective and they'll phase out even on the stationary products.  I guess it depends on HOW much cost savings there is.  It sounds significant.", "score": 1, "replies": []}]}, {"body": "honestly this might be good for ev's as a whole. tesla gets cheaper, better batteries. panasonic gets a kick in the ass and becomes better. someone else teams up with panasonic and uses what they ave learned so far to make comparable evs. just spitballing.", "score": 1, "replies": [{"body": "It's hard to see Panasonic walking away from their GF investment... (how much was that, overall?)  So, they'll probably continue to make batteries there either for Tesla or others.  For Tesla to buy Panasonic out for old technology, it'd have to be at a steep discount.  Unless there's some contract provision or something it's hard to see that happening.  Most of the lines (although not necessarily most of the cost) are for ovens that Tesla no longer needs.\n\nThere's a definite use for those lines for a while... but possibly 6-12 months down the line that stuff gets sold off or retooled at a significant loss. Or Panasonic stays there but sends them to someone else.  They'll relatively quickly be relegated to stationary and industrial battery solutions, then cost will take even that away later on.", "score": 1, "replies": []}]}]}, {"body": "Did anyone not assume this was happening?\n\n&#x200B;\n\nI mean, hello:\n\n&#x200B;\n\n* Consistently mentioning they are battery constrained\n* Endless vertical integration\n* Acquired Maxwell tech", "score": 37, "replies": [{"body": "Plus I’m excited for it to put to bed the argument that Tesla has no proprietary tech/ battery advantage because some people claim its 100% on the Panasonic side.", "score": 18, "replies": [{"body": "Just wait til Tesla and Boring Company collaborate and begin mining...", "score": 5, "replies": []}]}, {"body": "Also job postings highly suggestive of battery cell manufacturing.", "score": 6, "replies": []}, {"body": "The word secret makes you click.", "score": 2, "replies": []}]}, {"body": "Behold the next short talking points:\n\n- Elon is delusional. Tesla can’t make batteries better than Panasonic.\n- If Panasonic thought Maxwell was valuable, it would have bought Maxwell itself.\n-  Fire in a Tesla! Who made these batteries?", "score": 28, "replies": [{"body": "\"Here's how producing cheaper, more durable/energy dense batteries will hurt Tesla\"", "score": 8, "replies": []}, {"body": "I’ve seen number 2 since the start of the buyout process.", "score": 10, "replies": []}]}, {"body": "*Had* a secret.", "score": 16, "replies": []}, {"body": "There is nothing secret about this. Elon’s been talking about this for months and already stated there will be an event later this year that will go into details. Actually they’re planning on vertically integrating even further by getting into the mining business as he mentioned in the shareholder meeting", "score": 7, "replies": []}, {"body": "Yeah that whole Maxwell deal was very secret.", "score": 16, "replies": []}, {"body": "A secret lab? What is this, 2nd grade?", "score": 4, "replies": [{"body": "Deedee get out of my lab-orah-tory!", "score": 1, "replies": []}]}, {"body": "Wow, the MSM is actually acknowledging Maxwell. They even mentioned them once in the article.", "score": 7, "replies": []}, {"body": "I don't think I've ever heard what part of the cell manufacturing process would be difficult for tesla to perform. It's conceptually possible that it was really just a function of Tesla getting to a scale where designing and building their own machinery made sense, rather than any inherent complexity.", "score": 5, "replies": []}, {"body": "A few years ago Tesla said they will eliminate level one suppliers. It's obvious they will produce their own batteries. They move fast with battery tech, if they always give the new tech to Panasonic or new suppliers, they would have trouble with competition. For example, every battery producer would find out Tesla's latest battery Chemistry.\n\nNow they control their own battery tech and production, this is the only way to move forward efficiently.", "score": 2, "replies": []}, {"body": "This is the best tl;dr I could make, [original](https://www.cnbc.com/2019/06/26/tesla-secret-lab-building-battery-cells-to-reduce-panasonic-dependency.html) reduced by 86%. (I'm a bot)\n*****\n> Employees in Tesla&#039;s battery R&D teams are now focused on designing and prototyping advanced lithium ion battery cells, as well as new equipment and processes that could allow Tesla to produce cells in high volumes, employees and former employees said.\n\n> Tesla has posted job listings in the last month for various engineers involved in battery cell design, equipment for producing battery cells and manufacturing processes to make batteries.\n\n> In recent weeks, following layoffs and other cost-cutting efforts by Tesla, Panasonic has hired a number of former Tesla employees at the Gigafactory in Nevada, including technicians, supervisors, and process and systems engineers, according to LinkedIn profiles and current and recent Tesla employees.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/c5zia9/tesla_has_a_secret_lab_trying_to_build_its_own/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~409325 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Tesla**^#1 **battery**^#2 **cell**^#3 **company**^#4 **Panasonic**^#5", "score": 1, "replies": []}, {"body": "I don't think Id fancy holding a big bag of Panasonic shares right now", "score": 1, "replies": []}, {"body": "\"secret\" \\*dr.evil fingers", "score": 1, "replies": []}, {"body": "Maxwell has a large factory in Arizona. Could be building there.", "score": 0, "replies": [{"body": "Doubt that Arizona would be any huge volume for battery production. Tesla needs to make the batteries close to assembly. Think Fremont or Reno. Those trucks go back to Reno empty each day.", "score": 1, "replies": []}]}]}
{"title": "Trump and Xi meet Saturday — If it goes poorly, the global economy could teeter into recession", "selftext": "https://www.cnbc.com/2019/06/25/trump-xi-trade-tariffs-still-seen-hurting-economy-even-after-g-20.html", "id": "c5mjnx", "created_utc": 1561531968.0, "score": 6, "upvote_ratio": 0.67, "num_comments": 29, "comments": [{"body": "It's gonna go like this:\n\nTrump tweets Saturday: \"Productive meeting with President Xi. Great man! Teams will meeting soon to continue great trade talks!\"\n\nTrump tweets Monday: \"China is unreasonable in their requests and going back on their word! If things don't pick up, more tariffs! MAKE CHINESE FOOD GREAT AGAIN\"", "score": 30, "replies": [{"body": "Idk man but Trump tweeting “Great man”  seems far fetched honestly, he would grab him by the pussy if he could", "score": 5, "replies": []}]}, {"body": "Trade wars are good, and easy to win.", "score": 15, "replies": []}, {"body": "Why is XI wearing lipstick?", "score": 10, "replies": [{"body": "Because Xi knows that he needs this deal too, and he’s prepared to do whatever it takes...", "score": 17, "replies": [{"body": "*What did it cost?*", "score": 6, "replies": []}]}]}, {"body": "90%", "score": 11, "replies": [{"body": "420 funding secured", "score": 7, "replies": []}, {"body": "MU 90???", "score": 3, "replies": []}]}, {"body": "Or it could you know... keep doing exactly what it has been doing. Why would this meeting going bad suddenly send the global economy into a tailspin? Trump and Xi have been playing tummy sticks for over a year and this is the one that is suddenly going to bring everything crumbling down?", "score": 12, "replies": [{"body": "I think the point is that this high is unstable and anything could be the catalyst for the inevitable downturn.\n\nBtw, upvote for using ‘tummy sticks’. Well done.", "score": 4, "replies": []}, {"body": "Highest stock market EVER...PERIOD!", "score": 2, "replies": []}, {"body": "The tarriffs haven't been implemented yet and if they were to be implemented -- would cause a major economic slow down.", "score": 1, "replies": [{"body": "Or would it cause the market to soar on the increased odds of better rate cuts?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I want NVDA back up in the 200s and this has something to do with it, in part. Reeeeeee", "score": 4, "replies": [{"body": "😭 take me back to 294", "score": 1, "replies": [{"body": "NVDA bros, remember August of last year? Those were the shareholder days.", "score": 2, "replies": [{"body": "Remember when GPUs were selling for a premium because of low supplies? Well those days are about to return.", "score": 1, "replies": []}]}]}]}]}, {"body": "Damn bags be heavy.", "score": 3, "replies": []}, {"body": "big if true.", "score": 2, "replies": []}, {"body": "Maybe trump will sit in a corner and pout like he did last time.", "score": 5, "replies": [{"body": "But HeS sO SmArT aT bUsInEsS", "score": 4, "replies": []}]}, {"body": "Why would it go poorly when they have been saying trade talks are going good?!\n\nLike at least half of the market gains from the December lows were due to those tweets and comments from munichin and kudlow", "score": 1, "replies": [{"body": "Uhh where were you the past few months", "score": 6, "replies": []}, {"body": "You're new, arent you", "score": 5, "replies": []}, {"body": "Day after I day, I watch as you successfully troll almost everyone here lol", "score": 1, "replies": [{"body": "Some day my real identity will be revealed but its more likely reddit will go defunct first. No lie I solved 2 millennium prize problems but 1 million dollars is garbage", "score": 1, "replies": [{"body": "You're a weird ass dude but I respect your dedication", "score": 1, "replies": []}]}]}]}, {"body": "Hope that all economy questions will be discussed and regulated during this meeting.", "score": 1, "replies": []}]}
{"title": "Goldman Options: Where positioning meets fundamentals: NFLX, REITs, AMT, STZ, OMC", "selftext": "", "id": "c5qayz", "created_utc": 1561558343.0, "score": 75, "upvote_ratio": 0.92, "num_comments": 34, "comments": [{"body": "This should just get auto posted all the time.", "score": 14, "replies": [{"body": "I didn’t read it. Where does it say to throw money and in which direction?", "score": 8, "replies": [{"body": "Literally the beginning. It even tells you whether to buy uppies or downies...", "score": 14, "replies": []}]}]}, {"body": "How do you get this report?", "score": 9, "replies": [{"body": "You work at GS\n\nOr have tendies", "score": 3, "replies": []}, {"body": "lol", "score": 3, "replies": []}]}, {"body": "Goldman Socks has a Bonner for Netflix like I never seen", "score": 10, "replies": [{"body": "Also have a weird ccl boner", "score": 2, "replies": []}]}, {"body": "havent seen these in awhile. thanks for sharing. i always like to see their picks even if like 50% of them never really materialize\n\nthey are good for events and potential movements catalyst that i otherwise wouldnt have bother finding out about.", "score": 8, "replies": []}, {"body": "Hey can you post this shady every week please. Subscribed thanks", "score": 7, "replies": [{"body": "This\\^\\^\\^\\^", "score": 2, "replies": []}]}, {"body": "AMT play already up 50%, damn", "score": 3, "replies": []}, {"body": "Where can I get my own reports like this from them?", "score": 3, "replies": [{"body": "https://360.gs.com/gs/portal/research/home/", "score": 6, "replies": [{"body": "how much net worth do I need to sign up?\n\nI have like negative tendies at the moment.\n\nEdit: This was actually a serious question. Do I have to call them to get access?", "score": 11, "replies": []}, {"body": "https://imgur.com/a/CZNXduh", "score": 3, "replies": []}, {"body": "That STZ prediction though....can you literally post this every time it comes out?", "score": 1, "replies": []}]}]}, {"body": "This is helpful. Thinking about getting in on some of these.\n\n&#x200B;\n\nThe real question is, which one of these do they profit off of you with?", "score": 3, "replies": [{"body": "All of them", "score": 7, "replies": []}]}, {"body": "NFLX trade seems legit. It’s been flat for like a year and ready to break out. The r2 value of content spend to new subs added is really interesting, and if they beat by how much Goldman is estimating, the stock will easily pop 10% and you’d double your money on those Aug $365s.", "score": 3, "replies": [{"body": "Idk man with NFLX a big issue for me is that a big chunk of sub growth had been from international audiences that pay at a way cheaper rate. I honestly think NFLX is running on borrowed time with the amount of competition springing up and rolling out within the next year. \n\nTLDR: Netflix subs may be increasing, but the international subs don't make as much 💰", "score": 6, "replies": [{"body": "Depends on which country. But last quarter they beat for both US and Int’l. And Int’l means UK, France, Germany, Spain, etc. Not just India.", "score": 3, "replies": []}]}, {"body": "Idk. I could see netflix dropping to $150 after Disney+ pulls all their movies and netflix loses half their content next year.", "score": 2, "replies": [{"body": "You are seriously misinformed if you think that half of Netflix’s content is Disney stuff. It’s not even 0.05%.", "score": 2, "replies": [{"body": "I only watch Netflix for Netflix originals. Which I'm done with within a week every year. Good content might not all b̡̰͗eͫl̪ͮo͍̅n̢̞ͧgͥͅ to Disney, but it does belong to many large media comps that are also following step and pulling content.", "score": 1, "replies": []}]}]}]}, {"body": "Thanks for these bro. Let’s see how these AMT puts go\n\nEdit: ez money", "score": 2, "replies": []}, {"body": "What the fuck kind of DD? Is this?? Kidding, thanks OP, even though GS is a turd", "score": 2, "replies": []}, {"body": "And.. I just bought calls today on AMT because it usually dips 3-4 days in a row following a dividend and then rises back again.. RIP", "score": 2, "replies": []}, {"body": "Multiple stickies? I like this trend", "score": 1, "replies": []}, {"body": "Love the omc put idea, but barely any volume or OI on that 80 strike.", "score": 1, "replies": []}, {"body": "Thanks for sharing this.", "score": 1, "replies": []}, {"body": "STZ crushed", "score": 1, "replies": []}, {"body": "Goldman, fuck you and your 90% r2 value for content spend vs new subs. Not even close.", "score": 1, "replies": [{"body": "For real.", "score": 1, "replies": []}]}]}
