{"title": "Anyone shorting AMZN?", "selftext": "I think AMZN is over valued and especially so climbing up to 1900. Looks overbought as well. Even though it's such a solid company, I think theres opportunity to short. Anyone thinking the same thing? Or am I just bat shit crazy and wishful thinking?", "id": "c2d9j7", "created_utc": 1560923927.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 28, "comments": [{"body": "Good fuckin luck homie", "score": 13, "replies": [{"body": "thanks dawg", "score": 5, "replies": []}]}, {"body": "Bat Shit Crazy....unless something. really bad happens with China and trade....this company is here for the long hall in the near future...also up $500 the past 6 months so like take ur chances", "score": 18, "replies": [{"body": "I don't think China deal would resolve any time soon. I mean, Trump always tweets bullshit then market goes up and couple weeks later China aren't happy with the way things are and market declines again. So idk I kinda see an opportunity. Then again I might be crazy and you might be right lol", "score": 3, "replies": []}, {"body": "Haul*", "score": 1, "replies": []}]}, {"body": "Why in the ridiculous shiteating fuck would you short a massive stock like AMZN while the trend is up? Wouldn't you at least wait for a trend reversal? The odds are so steeply against you its insane. You would be better off letting a shit bat pick your next move.", "score": 6, "replies": [{"body": "because you sell high and buy low. \n\nAmazon was on a massive uptrend in sept going to over 2,000 and then it crashed in Dec going below 1400, the same thing can easily happen again.\n\nI'm sure if you shorted when it was at 1900-2000 in sept people would have made the same comment saying you'd be ridiculous to go against the trend.", "score": 3, "replies": [{"body": ">sell high and buy low.\n\nYea, *with the trend*. Your probability of success when the trend is moving against you is not high. Always play the fucking trend.\n\n>people would have made the same comment saying you'd be ridiculous to go against the trend.\n\nRight. It would have been ridiculous, and you would have been lucky. You could have waited for signs of a trend reversal instead.", "score": 1, "replies": [{"body": "I know I'm ridiculous. I won't bother justifying my decision cause I can already smell the heat and hatred as it is.  I just see something that made me short AMZN, that's all.", "score": 1, "replies": [{"body": "Did you buy puts? What did you do?", "score": 1, "replies": []}]}]}, {"body": "Jan ‘20 exp, 3k for puts at 1500 strike, 2k if you go down to 1400", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "buying 100 shares of a $1900 stock isn't an easy thing to do", "score": 3, "replies": []}]}, {"body": "Either ur bag shit crazy or ur the next warren buffet ... or u have a crystal ball ...", "score": 5, "replies": [{"body": "Warren Buffett would never short AMZN. I don’t think he even shorts period", "score": 1, "replies": []}, {"body": "Probably the former 😂😂", "score": 1, "replies": [{"body": "Post it in r/wsb", "score": 5, "replies": []}]}]}, {"body": "Do you have any data to support this?  Or is a WAG?  \n\nAll the indicators I use show it to be in a neutral range and the 10-day chart shows a bullish trend with super low IV.\n\nGive us some data on why you think it is overvalued and looks overbought . . .", "score": 2, "replies": []}, {"body": "They should split someday,  but the cost of the stock is not that important.. it's the metrics behind it", "score": 1, "replies": []}, {"body": "No. Yes.", "score": 1, "replies": []}, {"body": "On the daily sure, it’s a gamble. Long term you are doing a bad thing.", "score": 1, "replies": []}, {"body": "In the short term it will move up and down - if you can predict these movements accurately, well, you don’t need to be asking others for advice. \n\nIn the long term this is an innovative and dominant company constantly extending into new markets. It has been and may well continue to be one of the best longs.", "score": 1, "replies": []}, {"body": "Bit crazy.. They're at the forefront of commerce and are moving into other area's or already have such as Twitch, this Christmas they are debuting their coverage of Premier League football matches which is a multi billion $ industry.  \n\n\nIf anything it would make sense for it to keep climbing.", "score": 1, "replies": []}, {"body": "I do not have charts up but I thought it bounced off support at $1725....  \n\nAt some point word will get out Amazon does nothing better than anyone and has destroyed the reputation of Whole Foods and the increased competition on same day deliveries.  Also fuck their new return policy bs.", "score": 1, "replies": []}, {"body": "Do you have any specific reasons to support your short thesis besides a stock price number? I hope you have deep pockets.", "score": 1, "replies": []}, {"body": "Short EA alb ctxs chrw \nSupershorts dva wfc jwn -zion-<—-zion is a great short right now look into it\nLong tlt smar wday twlo frpt", "score": 1, "replies": []}, {"body": "My number one rule of trading. ALWAYS trade with the trend.", "score": 1, "replies": [{"body": "🙄", "score": 2, "replies": []}]}, {"body": "I realize you're probably an option trader an intend on doing some option trade if you decide to short AMZN,  but the question you're asking is about AMZN, not options.  I ask that you use /r/options for the option part of the trade and discuss the future of AMZN on one of the stock market subreddits.\n\nThe same people that trade options also subscribe to the stock market subs, so it's the same audience plus some different investors too.", "score": 1, "replies": []}]}
{"title": "Walmart filed more drone patents than Amazon last year", "selftext": "https://www.cbsnews.com/news/walmart-filed-more-drone-technology-patents-than-amazon-last-year/\n\nIn 2018, Walmart edged out archrival Amazon when it came to filing for drone technology patents.\n\nWalmart filed 56 requests, while Amazon filed 54.\n\nThese initiatives reflect the changing nature of retail and consumers' \"want it now\" mentality.", "id": "c2cclq", "created_utc": 1560917434.0, "score": 210, "upvote_ratio": 0.96, "num_comments": 39, "comments": [{"body": "Ooh that's a tight race... I am glad to hear this", "score": 33, "replies": []}, {"body": "Walmart has the most to gain from drone delivery. They have a massive network of stores accross the USA.", "score": 26, "replies": [{"body": "Hey, beatdrop128, just a quick heads-up:  \n**accross** is actually spelled **across**. You can remember it by **one c**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": -17, "replies": [{"body": "dellete", "score": 15, "replies": [{"body": "Hey, noobie107, just a quick heads-up:  \n**dellete** is actually spelled **delete**. You can remember it by **one l**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'dellete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 3, "replies": []}]}]}]}, {"body": "They might just be filing them to prevent Amazon from using this tech as preventative measure? Not sure if this means wal-mart is committed to actually building drones out.", "score": 5, "replies": []}, {"body": "I mean IBM files the most patents usually every year. Hasn’t amounted to much for them.", "score": 11, "replies": [{"body": "IBM is the mainframe for most healthcare providers and retail chains, with servers using a software from the 80s. Seems like their patenting idea is working fine for them fwiw", "score": 4, "replies": [{"body": "Why hasn’t it translated to their stock performance then? And I work in healthcare no one uses ibm.", "score": -1, "replies": [{"body": "https://www.marketwatch.com/press-release/mainframe-market-2019-global-analysis-opportunities-and-forecast-to-2024-2019-02-11\n\n\nYou must be a nursing student or something. Every dollar runs through these systems", "score": 9, "replies": [{"body": "They’re talking about patents related to stock price growth. Of course we all know ibm has clients. Also I’m not a nurse, how dare you try to under play them. They are as knowledgeable as anyone else.", "score": 1, "replies": [{"body": "WOMP WOMP. Virtue signal elsewhere pleb", "score": 1, "replies": []}]}]}, {"body": "Every large insurer has a mainframe.", "score": 1, "replies": []}]}]}]}, {"body": "And I still do not own a Drone.", "score": 3, "replies": []}, {"body": "Doesn’t the hood have enough helicopters flying over it?", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Which credit card will they use today? Mr Robinson? Or Angela Freemont’s business card?", "score": 1, "replies": [{"body": "The maître d’ stops by to say hello to McDermott, then notices we don’t have our complimentary Bellinis, and runs off before any of us can stop him. I’m not sure how McDermott knows Alain so well—maybe Cecelia?—and it slightly pisses me off but I decide to even up the score a little bit by showing everyone my new business card. I pull it out of my gazelleskin wallet (Barney’s, $850) and slap it on the table, waiting for reactions.\n\n___\n\n^(*Bot. Ask me how I got on at the gym today.* |) [^(Opt out)](https://www.reddit.com/message/compose/?to=botrickbateman&subject=Opt%20out)", "score": 1, "replies": []}]}]}]}, {"body": "Walmart still has nothing compared to Amazon.", "score": 2, "replies": [{"body": "lol", "score": 22, "replies": [{"body": "It is true though, outside of america, Walmart doesn't have a lot of stores compared to Amazon, which you can basically shop at anywhere.", "score": -8, "replies": [{"body": "It's not true at all.", "score": 9, "replies": [{"body": "I don’t know. It’s on the Internet so it has to be true.", "score": 2, "replies": []}]}, {"body": "Walmart is affiliated and owned by the same companies that own many of the samw types of stores all over the world.", "score": 1, "replies": []}, {"body": "Not to mention the many successful subsidiaries Amazon owns. Walmart only has Walmart and brick and mortar stores are fading away with Amazon now offering free one day shipping. Does Walmart even have a successful subscription services involving percs? Walmart will be gone within a decade and bought out by Amazon if monopoly laws don't stop them.", "score": -17, "replies": [{"body": "You should really learn about companies before you talk about them.\n\nhttps://en.m.wikipedia.org/wiki/List_of_assets_owned_by_Walmart\n\nWalmart has more than just Walmart. For example they own the 2nd largest supermarket chain (Asda) in the UK for instance which generates around £22 billion a year.\n\nWalmart’s reported revenue is double Amazons.", "score": 17, "replies": [{"body": "This is all true, but walmart's reported net income is still lower than amazon's (roughly 40% or so).", "score": -5, "replies": [{"body": "And? This could be due to so many factors.\n\nWalmart for instance may be pumping more money back into all of their business' than Amazon resulting in a lower EBITDA to Amazon.\n\nWalmart generated 514 billion in revenue last fiscal year, Amazon generated 233 billion. The revenue share between them is 69% to Walmart and 31% to Amazon.\n\nLast year the net income between both companies drastically changed for one reason or another.Amazon went from 3.0 in 17 to 10 in 2018 and Walmart went from 9.9 to 6.7. Yet Walmarts total revenue keeps growing, all this means is Walmart and Amazon are spending the money they generate in different ways.\n\nFor example if we look at some other threads around Walmart vs Amazon in relation to stocks. One key figure that keeps being brought up is that the future of retail is \"omnichannel\" with a large mix of online/brick and mortar and collection services.\n\nWell Walmart sells online but they also have a incredibly large logistics network already set up and running for multi channel.\n\nWalmart have around 5,000 stores in the US alone which is probably where the majority of the revenue is being pumped back into, Amazon is online and run fullfilment warehouses. Amazon for instance has around 120 fulfilment warehouses in the US (much cheaper to run than 5,000 stores) which means their total cost to run the business is lower and that means more net revenue.\n\nThe question would be would you prefer to generate half a trillion in revenue and make less margin or would you prefer to make half of that at a slightly higher margin?  \n\n\nEdit: Another thing is think about the value of all the real estate Walmart owns in those stores and their own fulfilment warehouses.", "score": 6, "replies": [{"body": "I would prefer to make a 40% higher margin (which I wouldn't call that marginal), and also have a much more modern business. Walmart doesn't have the spectrum of opportunites that amazon does (as far as i can see), most of Walmart's companies and the assets they own are retail focused, amazon has a MUCH wider spectrum with AWS, twitch, audible, alexa, whole foods and so on.\n\n&#x200B;\n\nI do not believe for one second that Walmart with continue to grow at the rate that amazon is, i also do not believe that Walmart has as widely a recognized name as amazon outside the US and territories in which they operate.\n\n&#x200B;\n\nEven though Walmart has a ton of retail stores in the US, as you yourself mention, those are expensive to run and will always impact their net income, amazon does not have that problem, i do not see how this can be a positive for Walmart?\n\n&#x200B;\n\nIn regards to Omnichannel, retail will never beat online sales at any point, especially in regards to profits,I don't believe in a future where retail stores will be a huge factor (this is personal opinion though).\n\n&#x200B;\n\nEven 1 trillion dollar revenue doesn't exactly mean you have a great long term business, if your business also costs 1 trillion to operate, not for companies as mature as Amazon and Walmart. I am aware that obviously the valuation of the company is still huge, but the company isn't handling its business well. If you look here: [https://mgmresearch.com/amazon-vs-walmart-revenues-and-profits-comparison-1999-2018/](https://mgmresearch.com/amazon-vs-walmart-revenues-and-profits-comparison-1999-2018/), Walmarts net income has been steadily declining for 5 years. And on basically any other metric measured, it seems fairly clear that unless Walmart can turn around a 5 year trend, amazon will beat them. Wether Walmart can turn this around and use their size to battle Amazon, is exciting though.", "score": -6, "replies": [{"body": "You have zero concept of \"net income\", go learn what it means and how RnD costs, M&A affects it.", "score": 1, "replies": []}]}]}]}]}, {"body": "Lol. Amazon would have to offer like 3 trillion dollars minimum to buyout walmart and I bet they still wouldnt take it.", "score": 7, "replies": []}, {"body": "Yes they do. And they are also worldwide under different names.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Oof", "score": 1, "replies": []}]}]}, {"body": "Quantity over quality means nothing.", "score": 1, "replies": []}, {"body": "and how many were filed by each the previous year?", "score": 1, "replies": []}, {"body": "And the number of patents grant success or means anything more than actually having more patents 😂", "score": -1, "replies": []}, {"body": "[removed]", "score": -11, "replies": [{"body": "Quiet you.", "score": 2, "replies": []}]}]}
{"title": "r/Stocks Daily Discussion Wednesday - Jun 19, 2019", "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n  * [Corporate News](https://www.streetinsider.com/Corporate+News)\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n  * [Economic data](https://www.streetinsider.com/Economic+Data)\n  * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&t=all&restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+technicals%22&restrict_sr=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+options%22&restrict_sr=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+fundamentals%22&restrict_sr=on&sort=new&t=all) Friday.", "id": "c2ebgi", "created_utc": 1560931607.0, "score": 7, "upvote_ratio": 1.0, "num_comments": 31, "comments": [{"body": "What is going on with $SHOP? Madness!!", "score": 5, "replies": []}, {"body": "Disney's high dividend is coming up in couple months, is it a good time to buy it now?", "score": 2, "replies": [{"body": "Do tell. Hadn't heard about a higher dividend there. Currently it's at 1.26%.", "score": 1, "replies": []}]}, {"body": "Thoughts on Aphria, Canopy Growth and Aurora cannabis? Are these still safe bets for a long term hold?", "score": 1, "replies": [{"body": "Yes I would like the know that information as well.  I am new to this game, and I bought a couple of Aurora Cannabis.  Also, if anyone has insight on  Sunesis would be great!!\n\n#", "score": 1, "replies": [{"body": "Don't listen to these people, they are just pessimistic because they are riding their emotions and the sector has been pretty dark the last couple months.  ACB financials are a great bet for the long term, and I think they have a huge competitive advantage in the international med. market as well as the acquistion opportunities once US opens up.  ACB is prioritising long term growth which is great for us but bad for people like Outrun who look to make gains in months.", "score": 1, "replies": []}, {"body": "\"don't expect them to move much\" look at CWEB's stock the last 2 days... look at IIPR's stock.", "score": 1, "replies": []}, {"body": "Too late to make any real money. Weed bubble was 2016-2017, and now everything is coming back down to earth and stagnating. Don't expect them to move much.", "score": 1, "replies": []}]}, {"body": "Look at innovative industrial properties: IIPR. \nFalls into same category as these( I believe) if you needed any other reason to want to dump your money.", "score": 1, "replies": [{"body": "Dump as in waste your money?", "score": 2, "replies": [{"body": "Nono... it looks really appetizing right now and I want to throw lots of money in.. but I’m skeptical. There has never been a major downturn.", "score": 1, "replies": [{"body": "I'm so 50/50 on going balls deep on IIPR right now.  I think it could be huge, and since it's a real estate stock people can't really short it.", "score": 2, "replies": []}, {"body": "I got lucky, after investing in CGC the related news section on that stock in robinhood app recommended looking into IIPR, I got in at 65 and drop 1k into it. My friend is telling me to sell now, but I'm holding. What do you guys think? I have lots of stocks that are up by hundreds with no stop loss, last time i put a stop loss was on an investment of 1k into Beyond Meat at 64 again and look at that mf now ugh...", "score": 1, "replies": [{"body": "Meh If you need the cash then pull it but if you're fine with staring at it for 3-4 years then keep it in and become rich.... At this point it's just unlimited growth with bank legalization, illionois legalization, medical kicking off everywhere,,, NY and NJ voting on it in 2020. Idk I think the optimism is there, but could be some drops in the short term.", "score": 2, "replies": []}, {"body": "I’m going to let ride on all marijuana stocks. My assumption is lots of gains the more states legalize. Obviously. But I just recently bought CGC I think there is plenty to grow. I would hold. Because that’s what I’m doing 😂", "score": 1, "replies": []}, {"body": "IIPR seems relatively safe, the worse that'll really happen is that it will level off. It's not going to get shorted that fast.", "score": 1, "replies": []}]}]}]}]}, {"body": "What about hexo", "score": 1, "replies": []}, {"body": "Yeah, look at how much their revenues increased this year compared to last year.  Canopy Growth has their financials this week I believe and do your DD.  Aphria has had their share of problems but I really like ACB if you're looking long term and Canopy Growth as well.. CG just approved acquiring the biggest MSO operator in the states so once legalization happens.... BOOM huge growth on Canopy shares.", "score": 1, "replies": []}, {"body": "Ignore what Outrunx was saying to you.  The hype for cannabis companies is only dead for super short term investors/ people who pay attention to the motley fool too much.  Look up CGC's financials, they're getting released today.", "score": 1, "replies": []}, {"body": "Weed stocks were 2016-2017. Hype is dead, and new investors looking for those kind of profits like 2016-2017 are just not going to find them. Probably slow growth, with wild down swings on bad news, and slight upticks on good news. They have to prove themselves as actual profitable, boring businesses in a very risky, saturated market, and able to justify their current, astronomical prices.", "score": 0, "replies": [{"body": "US MSO's are grossly undervalued.  Idk how you can say they are overvalued in a saturated market? Marijuana was just legalized in ONE country and it will now be legal in some ways for a lot of the Industrialised world.  Completely ignorant to not see the exponential growth that is there.", "score": 1, "replies": [{"body": "Exponential growth was priced in in 2016-2018. Do you really expect these stocks to grow by another 1000-1500% like they did over past 2-3 years when, for example, CGC only has like 40 million in revenue? Do you really see their stock price soaring past 400? That's absolute insanity to think that would be the case over the next few years, or even decade. That's why by and large weed stocks have been flat or down over a 1 year period. Lay investors looking for huge gains missed the boat on this one by 2-3 years.", "score": 1, "replies": [{"body": "Are you serious? US recreation legalization is not priced into the majority of SP's.. US MSO's aren't open to huge stock exchanges which makes their trading volumes much lower and much more unstable. LMAO if you think CGC is the only cannabis producer that's stock will soar, sure I agree CGC is prob overpriced right now.  But comeon the US market is 4x bigger than the canadian market and it's not opened up other than CA and a select few... so  how can you say that's priced in?? You think MSO's aren't going to take advantage of this (mso's that are 1 year old) and that their 4-10 dollar share prices are the most their gonna grow? You sir are wrong and need to do more investigations into this sector.  Catalyst for the sector: the safe act, the states act, illinois legalization, pa legalization, az legalization, florida legalizaiton, nj legalization, ny legalization, FED BAN ON LEGALIZATION. unlimited catalysts and these companies have existed for 1-2 years so lmao if you've already forgotten.  Lmao it's called long term holding which you know, most successful people tend to do.", "score": 1, "replies": [{"body": "Calm down, bruh. It ain't that funny. What stocks do you have your eye on, and do you see popping in the future (1-5 years)?", "score": 1, "replies": [{"body": "MSO leaders I excpect to get popped or get consolidated.  Curaleaf, Cresco, GTII all have great financials and good management teams.", "score": 1, "replies": []}]}]}]}]}, {"body": "Wrong. American legalization will be huge", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "No they don't.", "score": 1, "replies": []}]}, {"body": "Anything new on an upcoming IPO for impossible foods?  I’m waiting to grab that one up.. I was  a few hours late on the beyond meat wagon", "score": 1, "replies": []}, {"body": "What is going on with BYND?", "score": 1, "replies": [{"body": "Wondering the same thing... a lot of researchers predicting a bust not sure if I should sell or hang in a bit longer.", "score": 2, "replies": []}]}]}
{"title": "JIM CHANOS' KYNIKOS ASSOCIATES WAS LONG ON TESLA <TSLA.O> PUT OPTIONS, NOT CALL OPTIONS, ON MARCH 31 - AMENDED SEC FILING", "selftext": "", "id": "c2le07", "created_utc": 1560972116.0, "score": 20, "upvote_ratio": 0.77, "num_comments": 37, "comments": [{"body": "They made an oopsie!", "score": 10, "replies": [{"body": "Man, falsifying SEC documents? Sounds like Chanos is a big Fraud!", "score": 31, "replies": [{"body": "Big fine incoming.  Wait, that doesn't apply for wall street.", "score": 13, "replies": [{"body": "Definitely not shorts.   Chanos was already caught red handed paying shill companies to manipulate the stocks he was shorting and the SEC did nothing.", "score": 1, "replies": []}]}, {"body": "That makes him a liar. Remember, he did something that turned out false, so now everything he does is fraud and all lies.", "score": 6, "replies": []}]}]}, {"body": "Can someone explain whats changed ?", "score": 6, "replies": [{"body": "Nothing, Chanos is still short. Fred’s rant was based upon incorrect data.", "score": 5, "replies": [{"body": "I'm still not completely clear on this. Incorrect data or an incorrect filing?", "score": 4, "replies": [{"body": "Filing", "score": 2, "replies": []}]}, {"body": "is Fred downvoting you?", "score": 2, "replies": [{"body": "Everyone down votes me.\n\nhttps://imgflip.com/i/33viri", "score": 9, "replies": [{"body": "I’ve found that people in this subreddit are pretty fair about downvoting incorrect or inflammatory comments, and upvoting correct quality material, regardless of who it comes from.", "score": 1, "replies": [{"body": "I mean I like the folks here, I keep coming back.", "score": 3, "replies": [{"body": "You’re also more reasonable than the average though", "score": 3, "replies": []}]}]}, {"body": "Eh, I think people downvote what you say, not necessarily you.\n\nHave an upvote, friend.", "score": 1, "replies": []}, {"body": "so yesterdays 420 Calls was fake news ?", "score": 0, "replies": [{"body": "False news; not fake news.", "score": 3, "replies": []}, {"body": "Yes. If you like that designation.", "score": 2, "replies": [{"body": "It was false news, sure.  But it was accurately based on the data available at the time, so not fake news.", "score": 2, "replies": [{"body": "So part of it was news. \n\nAnd then there was Fred’s take. That wasn’t news.", "score": 2, "replies": [{"body": "Correct.  Electrek is a blog, and Fred is free to post his opinions as he likes.\n\n*Edit - as long as Seth (Electrek’s owner) approves", "score": 1, "replies": [{"body": "Totally, not saying he isn’t. He just got egg on his face this time. It’s bound to happen with how many articles he publishes. I’m not trying to demonize him here. But I’d be lying if I didn’t say I  got a chuckle out of it.", "score": 1, "replies": [{"body": "Yeah he totally got an egg in his face!  Hopefully he updates the article to reflect the correct information.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": ">\tKynikos Associates LP has a history of taking positions in derivatives of the underlying security (TSLA) in the form of stock options. The firm currently holds 1,500 call options valued at $420,000 USD and 1,500 put options valued at $420,000 USD .\n\nhttps://fintel.io/soh/us/tsla/kynikos-associates-lp\n\nWhat are they actually up to?", "score": 6, "replies": [{"body": "Wtf is the point of that? They like paying fees?", "score": 1, "replies": [{"body": "That's a bet on volatility", "score": 5, "replies": [{"body": "The manipulators jobs are to create volatility and Chanos was caught paying firms to manipulate so he would profit off of them a few years ago.", "score": 1, "replies": []}]}, {"body": "This isn't like betting on black and red on the roulette table. https://www.theoptionsguide.com/long-straddle.aspx", "score": 3, "replies": [{"body": "Ah, that’s pretty cool. So basically it’s a bet that the stock is either Apple or Enron.", "score": 5, "replies": [{"body": "AKA the Adam Jonas price target position. 'on the one hand things could go well, on the other hand, things could go bad.'", "score": 1, "replies": []}]}]}]}]}, {"body": "Do we have a copy of the amended 13F?", "score": 3, "replies": []}, {"body": "Can't blame Fred for reporting on an sec filing, but he should probably update his story.", "score": 2, "replies": []}, {"body": "Why is this getting downvoted?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Options, I think?", "score": 1, "replies": []}]}, {"body": "> Dio’s Take: I think it’s completely hypocritical to call yourself a journalist and not attempt to contact the subject of your piece/ire, before publishing. The clerical error(covering all the small option positions) has been corrected, and the 13F amended. @FredericLambert\n\nhttps://twitter.com/wallstcynic/status/1141428270547836929?s=21", "score": -8, "replies": [{"body": "Uh huh. Worm.", "score": 4, "replies": []}, {"body": "Oh this is getting good....", "score": 1, "replies": []}]}]}
