{"title": "Ten years to twenty years from now. Retirement portfolio ideas", "selftext": "If you were to inherit lets say 150,000 dollars and wanted to create a stock portfolio that would be worth money in ten to twenty years, What stocks would you pick? I'm a thinking along the lines of INTC, GOOG, AAPl, Microsoft, MMM and GILD. In ten to twenty years would this be a good portfolio given this is a hypothetical scenario. ", "id": "3l8mf7", "created_utc": 1442448189.0, "score": 11, "upvote_ratio": 0.87, "num_comments": 37, "comments": [{"body": "If you're a retiree, don't overexpose on tech stocks. Have some commodities, industrials, utilities, financials, services, conglomerates, international equities, REITs, Index funds, bonds and other industries/sectors/regions. \n\nPersonally, I would have a 300k dividend growth portfolio on a 4% dividend threshold so I can receive 12k a year(1k a month) just to cover the bills, expenses and insurance and send the rest of my $$ to moderately aggressive growth portfolio.\n\nThis would be an out of the topic but I would also get an exotic car that bottoms out from depreciation cycle and would be worth more $$ in the future. Leisure in driving/maintaining and investment in one. Now that's a perfect retirement 20 years from now.", "score": 3, "replies": []}, {"body": "I'll throw in ECL, UNP, WBA/CVS, DHR. I'm not a huge fan of INTC/MSFT, but GOOGL (not GOOG), AAPL, MMM, GILD are fine.\n\nBAM and MKL are two others.", "score": 1, "replies": [{"body": "I am curois about walgreens and cvs, despite CVS huge growth in the past ten or so years, why is it in your opinion a good stock? And why not Intel or Microsoft. Both have been around for decades and both have proven themselves at the top end of their respective fields.", "score": 1, "replies": [{"body": "I have both INTC and MSFT. They're solid. I'm not sure about 20 years solid, but for now they're good imo. With the recent 16% bump in MSFT dividend it's staying in my portfolio for now.", "score": 1, "replies": [{"body": "Have you thought about GILD or AAPL? Is AAPL going to pay off ROI in the next twenty years? ", "score": 2, "replies": [{"body": "I also have both of those. In fact, nearly 18% of my portfolio is AAPL from multiple entries. It's been an amazing stock for me. I just recently got into GILD during the flash crash. ", "score": 1, "replies": []}]}]}]}]}, {"body": "gild is near the top of my list. jnj as well. bud was on it until it jumped 7% today. nke and sbux are great, i think sbux has more room for growth.", "score": 1, "replies": []}, {"body": "Assuming you're 50ish years old (retirement would then be 10-20 years away), I'd recommend diversifying across sectors much more than the above 6 stocks.  You'd have 2/3 of your exposure to the tech sector.  Do I think the tech sector is a good place to be? Absolutely.  But I don't think you should be that overweight in any given area, especially for a 10-20 year period.  I'd pick out your two favorite, high quality (aka not due to short term fundamentals) names in each sector and put around $7,500 in each.\nOf the above names, AAPL and GILD are my favorites.  I don't see a ton of growth in INTC, their earnings projections are pretty flat for the next 3 years.  I would look at MBLY, DAL, AMZN, MGA, MCK, YHOO, AMP.", "score": 1, "replies": [{"body": "I am 26 I am thinking actually more along the lines of twenty years.", "score": 1, "replies": [{"body": "Mad respect that you're planning on retiring at 46, must feel good", "score": 1, "replies": [{"body": "LOL I will still be paying of student debt by then. What I want is to slowly build a portfolio so that when I am close to 50 I'll have stock portfolio that is respectable. ", "score": 3, "replies": []}]}]}]}, {"body": "Why no AMZN?", "score": 1, "replies": [{"body": "high P/e ratio\nAlthough I would not say its a bad stock, looks promising. ", "score": 0, "replies": []}]}, {"body": "You can literally roll all those stocks into an ETF or a mutual fund which would be a lot safer. No point in investing that much money in a few popular stocks.", "score": 1, "replies": [{"body": "I really don't know much about ETF or mutual funds and am leary of letting other people handle my money, which is essence how stock trading works, but still would you care to explain a mutual fund that exists within the IT,software,hardware realm that would encompass the stocks I mentioned? ", "score": 1, "replies": [{"body": "you can look at the holdings for popular ETFs or mutual funds. often times a large percentage of their holdings (relatively) are APPL, GOOG, etc., a lot of the companies you are already interested in. but the benefit is that they also hold other companies, so its more diverse. so if the tech, IT, whatever isn't doing so well, and other industries are, well, your money is still growing, or you don't lose as much as you would if you just had a handful of tech stocks.", "score": 1, "replies": []}]}]}, {"body": "I'd throw in some dividend stocks like Chevron or MO.\nEdit-a letter.", "score": 1, "replies": []}, {"body": "The lack of Netflix is disturbing", "score": 1, "replies": [{"body": "Netflix is over priced. If you look at the price to earning ratio its all out of wack, like netflix and alibaba may be promising but they are way to pricey, you have to be a sucker to pay 15 to 1 or 10 to 1 on price to earnings. ", "score": 1, "replies": [{"body": "It's been like that for years. Obviously a lot of people don't really care about their PE. I don't see them suddenly caring about it in the near future. I think once they have saturated the global market, then we can begin to discuss if they are \"over priced\". Right now there is still too much hype.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "it's true. sometimes you simply have to forget the \"technical analysis\" and hop on the hype train. if it were as simple as simply doing \"technical analysis\", then everyone would be doing it and making gobs of money. markets thrive off hype. hype is sometimes just as important as \"technical analysis\".", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I agree with aguywithaplan I am not looking at hype. I am talking ten twenty years down the road. P/E ratios and Debt to Equity may even out in ten to twenty years, but I want solid solid companies that I know will have good solid ROI in decades ie why I mentioned AAPL and Microsoft, unless some untold disaster occurs these companies will exist and be profitable in the future as will netflix but netflix just like twitter or facebook in the past is way too hyped up for me.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "well lets just say some of the technical stuff can give you insight in to whether or not a company has redflags. For instance Netflix debt to equity is about 2.6 which means they own more than 2 times as much debt as they have in equity to me that means something. It could mean netflix is intending on expanding content and becoming even bigger, taking on that much debt means something its not just random prediction.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I am just commenting on p/e ratios and debt to equity. In my opinion the price to earnings is too high, and the debt to equity is too high. If you want to by a stock that is overpriced in the hopes that 5-10 years down the road it is actually worth its price, but currently I don't see it making as much as it valued(price ticker suggests). I am by now means calling anyone stupid perhaps overly optimisstic when it comes to netflix,alibaba,facebook, twitter and other such stocks that don't actually reflect the market cap or value in total assests and equity that is all I am suggesting the total equity to debt of Netflix is unfavorable even if in 5-10 years it might replace or is already replacing cable as we know it.", "score": 1, "replies": [{"body": "The market is replete with IT and software/hardware stock that is priced over what its equity and assets are worth netflix is one of dozens of example and a simple P/e Ratio or debt to equity ratio suggests that. Maybe you should do more research and stop letting hype dictate what you buy , before suggesting I am wrong", "score": 1, "replies": []}]}]}]}]}, {"body": "Tesla", "score": 0, "replies": [{"body": "You will certainly lose most of your money if you buy Tesla as a 20 year long.\n\nYou may make money as a 5-10 year long.", "score": 2, "replies": [{"body": "Why would you certainly lose money?\n\nIf there model 3 goes big and their battery storage takes off you will kill it. A lot of big funds have put a lot of money into tesla.", "score": 1, "replies": [{"body": "Yes, in the next 5-10 years. But if you're planning for 20 years you have to ask yourself if Tesla *really* has that kind of holding power. You seriously think they'll still be the EV of choice once GM, VWAG and Toyota have all had a chance to make cheaper, more reliable alternatives? I'd bet my money on those companies before Elon Musk's venture.", "score": 1, "replies": []}]}]}]}, {"body": "A mixture of stocks and bonds", "score": 0, "replies": []}, {"body": "Medical Marijuana ", "score": -1, "replies": [{"body": "What companies? and are these companies public yet?", "score": 1, "replies": [{"body": "Canadian medical cannabis i'm following: \ntweed, mettrum, bedrocan. it's more of a speculative play since their burn rates are so high but the 3 of them have the most market shares in Canada, doing the most expansion and they also sell internationally. No plans of buying though, cannabis regulations are too shaky right now. The market demonstrates, first in the market doesn't equate to advantage.", "score": 1, "replies": [{"body": "I am wondering if there are any marijuana companies that will go public in the next 10 years. If so I want to get on that as early as possible. ", "score": 1, "replies": [{"body": "My recommendation would be play either $PM or what I prefer, $MO. Nice and diverse, and I imagine they'll plug marijuana into their core once it becomes more broadly legal. Sexy dividends on both too!", "score": 1, "replies": [{"body": "Marijuana has the potential to be bigger than tobacco. Do you think as marijuana becomes legal tobacco companies will sell marijuana blunts and joints the same way as cigarettes is there any proof of this happening or to happen?", "score": 1, "replies": [{"body": "Seems logical to me. Plus this way even if they don't you're invested in a real company that makes money. I see little to be gained from the handful of pure pot plays. ", "score": 1, "replies": []}]}]}]}]}]}]}]}
