{"title": "Can you feel the YOLO? Can you FEEL it!?", "selftext": "Well its happened.   WSB has infected my regular portfolio, the portfolio where I keep T and AAPL and other boring things.   And now a substantial portion of my NON FRIGGIN YOLO portfolio is now YOLO.   Thanks /u/theycallme1, thanks WSB.   You'll see me living on the streets in my retirement yet!\n\nhttps://i.imgur.com/qpyXbtG.png\n", "id": "3khtom", "created_utc": 1441940746.0, "score": 42, "upvote_ratio": 0.89, "num_comments": 42, "comments": [{"body": "BGMD is religion. Watch and see. You'll be a trillionaire soon or never see your money again. wsb is life. wsb is the closest thing to burning money to heat the pool on your yacht up. ", "score": 19, "replies": []}, {"body": "Pfft, you're only at a 20% loss.  You're still in the hazing phase. ", "score": 15, "replies": [{"body": "I'm down 60% on them. This must be a really, *really* drawn out hazing phase.", "score": 3, "replies": [{"body": "ayyyyyy part of the club. ", "score": 2, "replies": [{"body": "There should be a No Fear T-shirt where, instead of an image of a hand grenade or some dumb 90s shit like that, it's just a picture of someone YOLOing BGMD.", "score": 2, "replies": [{"body": "I could be the model. I think it would look great with a dude crying into a bottle of whiskey and lighting money on fire. ", "score": 1, "replies": []}]}]}]}]}, {"body": " Lol idk if I can believe you lost 200k on this (real money)", "score": 14, "replies": [{"body": "Only 60k and it's not a real loss unless I sell, which I won't.   The catalysts (Earnings and FDA are solid).   With FDA this thing can outperform AVXL in the same period (more double potential at these prices on a MUCH smaller float with limited warrants that only make sense to dilute above $2).   Without FDA its a longer hold 6mo but earnings should see it @ 2-3 in six months which is STILL ~200% in six months.  I don't think T is going to do that ;)\n\nEdit: that's a real screenshot from my real fidelity account.", "score": 11, "replies": [{"body": ">It's not a real loss unless I sell\n\nThat's the spirit.", "score": 43, "replies": []}, {"body": "Jeeze man. well I really hope that turns around for ya :/", "score": 5, "replies": []}, {"body": "Not sure if legit\n\nor trying to pump and dump", "score": 4, "replies": [{"body": "I posted the screenshot so that in six months I could legitimately claim the next fsyolo mantle as one of WSB's WORST traders or i could berth my space yacht next to /u/theycallme1's on some island paradise in the Andromeda galaxy.\n\nSeriously though -- BGMD is a HUGE risk until after NASDAQ compliance is determined.  I averaged down the last bit this week because I don't want to chase a possible compliance verdict when I could have had the last 150k shares at these prices.  If I'm WRONG on compliance, which I could very well be, the downside risk @.60 is fairly limited since they're so close to cash on hand valuations, and the other catalysts later in the year should see me recover my investment.", "score": 11, "replies": []}, {"body": ">Not sure if legit\n\n>or trying to pump and dump\n\nOP's not doing much pumping if that's his goal.", "score": 6, "replies": [{"body": "Well its the whole \"I feel so confident in this that even though I've lost thousands I don't care because I know this will go up again for these reasons and my huge amount of money is safe\"", "score": 6, "replies": [{"body": "That is why its so great being a catalyst trader :)  Doesn't matter what the price does between now and then as long as you stay focused on your catalyst targets.   For instance $AVXL has traded as low as .98c since their last catalyst.  But it's OK because their next conference is their next catalyst and the day after they announce it the stock will be trading $1.50-$2 because people will be anticipating the next set of patients will also show improvement over 805.  And if it does then lord only knows what it will trade at after that.\n\nBGMD is the same.  It has undeniable MULTIPLE catalysts and it would take the failure of all FOUR (NASDAQ, FDA, 3rd quarter Abbot sales, 4th quarter Abbot sales) for me to at least not break even.  Compare that to AVXL which has ONE catalyst that we don't know the outcome of.\n\nSo I bought at .80 and it's down to .60 and may drop as low as .40 if NASDAQ turns sour, maybe even .10 if the shorts have their way.  It really doesn't matter because that's the failure of ONE catalyst and I have 3 more to bank on.", "score": 4, "replies": []}]}, {"body": "I'm the paid pumper, not /u/pcx99 . He's just a savvy investor with a large bankroll, excellent DD and poor decision making skills.", "score": 6, "replies": [{"body": "I laughed at that. Have an up vote", "score": 1, "replies": []}]}]}]}, {"body": "I usually don't consider giving advice, and less to you, but frankly it doesn't matter what the company has done, and what its going \"to do\". The sentimentality of the market for this stock is that its only a quick buck.\n\nAVXL didn't drop because its got super good results, it didn't drop because the risk to reward ratio is higher, and that makes it more optimistic for market sentiment. \n\nI dont see any upward pressure on the stock in the coming months, unless they partner which they probably aren't close to. ", "score": 2, "replies": [{"body": "Exactly!   Market sentiment turns on a dime.  It doesn't matter what BGMD did in the past, it doesn't matter what it's going to do in the future as far as market sentiment exists NOW.   But when FDA approval hits and when the new $ABT revenue streams kick in this thing turns on a dime on a TINY float, because the sentiment follows the all-mighty buck.\n\nDon't get me wrong.  AVXL, as long as the science remains true, IS GOIND TO CRUSH BGMD after six months.   And AVXL is still 90% of my YOLO portfolio (BGMD is my regular -- sigh).   I'm not suggesting that ANYONE get out of AVXL and put their money in BGMD.   But I am saying that I think BGMD is a chance to get in BEFORE market sentiment changes.  Pre-conference AVXL when it was still in the .40s.\n\nIt's a bet but it this is wallstreetbets eh? :)\n\n", "score": 2, "replies": [{"body": "I followed your YOLO post from a few days ago and almost put in a g but didn't like the trends of money flow and the oscillator.  Now that it's at .6 I see no reason not to take a risk now that the potential upside is too hard to ignore compared to the risk.  Come Monday I'll suffer or dance along with ya. ", "score": 2, "replies": []}]}, {"body": "They have been partnered with ABBOTT for 7 years. What in the fuck are you even trying to say?", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "I'm pretty sure I've researched this stock better than 99% of the professional traders.   They'll look at the charts and they'll look at the financials but they don't look ahead to what something like an $ABT revenue stream is going to do to those financials in six months because that hasn't shown up on the financials yet.  Your broker may miss the fact that they have an FDA decision thats due this year that could increase the valuation of the company more than 10 fold.  Amongst other things.  Because professionals don't spend hours and days researching stocks, they press a button on a computer and see if it flashes green or red.\n\nI could be wrong. I know this could, quite possibly, be the worst mistake of my financial life to date.  Its a bet, but if I didn't feel there were not enough odds in my favor I would not have made it. #YOLO", "score": 4, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "The offering was done to meet NASDAQ equity compliance.  Roth sold the warrant package for $2m for ~4m warrants @ $1.   The warrants make no real sense to exercise and dilute under $2.  Fully exercised their float goes from ~11m shares to ~15m.   This was HUGELY unpopular with the shareholders and stock tanked from $1.50 to .90 and has bleed ever since.\n\nI'd actually be really interested in your take on the company, especially the science.   For that I had to mostly rely on the fact that $ABT wants to sell their tests and I figured if it didn't have value, the medical professionals at $ABT wouldn't want anything to do with it.\n\nYou are correct on my understanding of buy side managers :)  There is an absolute SEA of stocks on NASDAQ, BGMD seems to have fallen through the cracks.  The catalysts for this stock are as undeniable as they are imminent, and if other professionals are looking at this just as hard as I am, I'd REALLY, REALLY like to know why they aren't buying in :)\n\nI did do DD on this if you'd like to critique it: https://www.reddit.com/r/pennystocks/comments/3k0ezt/bgmd_dd_36_month_play_nasdaqotc_150500/ \n\nEDIT: Believe it or not one of the guys who asked questions was a guy from this sub (or maybe stock twits.  /u/theycallme1 probably has better details :)  There were no \"professional\" analysts, only investors.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "NASDAQ is highlighted as a substantial and imminent risk in my DD.  I'll look into flagship a little more.\n\nEdit: Institutional holdings look good.   For the period reporting only 2 reduced stakes (minor) and quite a few increased their stakes.  Flagship's position hasn't changed but maybe they're price locked since they were in at IPO.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "They have no debts and thanks to the equity offering cash on hand through middle of next year even without taking into account ABT.    Shouldn't need to do another R/S if any of their catalysts hit.  So they're liquid.   _MAY_ be negotiating a buyout from ABT based on FDA approval of 2nd but that is pure speculation and I'll never put money on that.\n\nSince we're already trading as if the stock is delisted I'm really not too worried about going OTC.  If anything it will get rid of the robin hood 100 share sells (non stop) the short manipulators use to walk the stock down.\n\nSo we should be good there too.\n\nEdit: their -> they're", "score": 1, "replies": []}]}]}]}, {"body": "I don't have time at the moment to read the transcript, but there were some callers from Some firms calling in. It's a stock trading sub $1, can't expect the big dogs to be all over it. ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "If you can find a recording of the call, listen to it. It was one of the worst CC's I've ever heard. It was like Hall was scared for his life and so unsure of anything he said. If I didn't know any better you'd think someone had a gun pointed at his head. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "ok got in .... 1000 shares @ 0.62$ (including expenses)", "score": 5, "replies": [{"body": "Already down $10!   Welcome to BGMD!", "score": 2, "replies": []}]}, {"body": "one upvote = one respect", "score": 3, "replies": []}, {"body": "Just average down bro, you'll be fine. I mean it has to go up at some point, how can you lose?", "score": 3, "replies": [{"body": "NASDAQ decides to de-list, FDA approval doesn't come through, the medical community does not order enough tests for the company to become profitable by the 4th quarter.  :( \n\nI believe in my DD but I'm not going 100% on a stock in my regular portfolio :)\n", "score": 2, "replies": []}]}, {"body": "After reading the subject line of this post, I really want someone from here to record a cover of [Real Me](https://www.youtube.com/watch?v=H2h1MY70uag) with the lyrics changed to be about WSB.", "score": 3, "replies": []}, {"body": "This is not responsible yolo. This is not the wsb way. ", "score": 9, "replies": [{"body": "the hell it isn't", "score": 11, "replies": [{"body": "won't be here very long without some responsible yolos", "score": 1, "replies": []}]}, {"body": "This *is* responsible yolo. *That* is not the wsb way.", "score": 2, "replies": [{"body": "i tried to get 2 quintillion shares of TBEV but it crashed the browser because it couldn't understand that many zeros.  ;)", "score": 1, "replies": []}]}]}, {"body": "Lol. Yeah, you're cool for yoloing but this company is easily a 0. Just needs more time. Short to 0. ", "score": 2, "replies": [{"body": "We'll see in six months.  I'll either out fsyolo, or I'll be riding circles in my space yacht around your floaties :)", "score": 3, "replies": []}]}, {"body": "Any idea what this new filing is?  Seems like bad news soon...?\n\n\tCompany Name\tForm Type \t Received  \t Period  \t\t \n \tBG MEDICINE, INC.\t CT ORDER \t9/11/2015\tN/A\n\n\"Companies would typically seek a CTO in order to keep information that would otherwise put it at a disadvantage, a secret. For example, a company may apply for such an order to keep information regarding a pricing arrangement made with a partner, secret, since competitors finding out this information may go after the partner with a more competitive price.\"\n\n-from investopedia\n", "score": 2, "replies": [{"body": "On August the 17th BGMD filed an amended contract with ABBOT labs.  Schedule A i think, in the amended filing, had a price table that was censored as confidential.   Today's filing is to ensure those numbers stay confidential.\n\nAbbot has a \"no better rate\" clause in their contract and BGMD wants to be able to negotiate with other labs for a better rate than what they are giving Abbot.\n\nTL;DR: Has nothing to do with NASDAQ compliance, everything to do with negotiating with new customers which is something that wasn't factored into my DD (Only HDL and Abbot)", "score": 3, "replies": []}]}]}
