{"title": "Vix pop", "selftext": "Anyone watching the vix pop rn. What is the market getting ready to price, Wensday Powell talk?", "id": "gz66x6", "created_utc": 1591644944.0, "score": 1, "upvote_ratio": 1.0, "num_comments": 12, "comments": [{"body": "Yeah I sold everything when I saw that. I’m up way too big to risk anymore.", "score": 1, "replies": [{"body": "You sold everything off that little pop? Wow lol", "score": 1, "replies": [{"body": "Everything except a small position on SLV", "score": 1, "replies": [{"body": "Do you have some PTSD or just paper hands lol?", "score": 0, "replies": [{"body": "Definitely both. Was up 500% on Tesla and 50% on Visa", "score": 2, "replies": [{"body": "Lol. Well,  we just closed above probably the biggest resistance line there could be right now twice at 321 and well above the .786 fib. The .88 fib is at 325 and we should see resistance at 330 and 340 but if Nasdaq breaks 10k sitting at 9924 now we will make new ATH by august no later", "score": 0, "replies": [{"body": "Ok. I’m glad to know that information, but mainly I trade shorter term based on the fib retracements in my gut so when I see shit I don’t like I pull the shoot. Even if it’s early. I’ve been holding calls through selling pressure for 2 months, so I typically don’t have toilet paper hands.", "score": 3, "replies": []}, {"body": "Well well well", "score": 1, "replies": [{"body": "Nice call", "score": 1, "replies": [{"body": "*and for my next trick* \n\nlol I’ll probably lose everything I just saved haha", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Wasn't it just last week that this sub was talking about going short on VIX? LOL.", "score": 1, "replies": [{"body": "I'm beginning to wonder if there is more than one person here and they have different opinions. Crazy, I know..", "score": 4, "replies": []}]}]}
{"title": "Dude, how do I start", "selftext": "I'm 18 and I've been wanting to start trading stocks for a long time - I've watched plenty yt vids and all of that but I'm talking about the legitimate mechanics, where do you go to/how do you actually purchase the stock you want, how do you guess on the ups and downs, all of it. Please gimme ur personal experiences", "id": "gyx8xi", "created_utc": 1591614084.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 17, "comments": [{"body": "Start paper trading, until you figure out what you're doing. There are plenty of free apps on the play store.", "score": 8, "replies": []}, {"body": "Before you dive in, consider reading a few books on top of the YT videos you’ve watched. *One Up On Wallstreet* by Peter Lynch; *A Random Walk Down Wallstreet* by Burton Malkiel, and *The Intelligent Investor* by Benjamin Graham are all great books to read. Your main weapon, so to speak, will be knowing how to do your own Due Diligence (you’ll see it abbreviated DD on here a lot.) \n\nWhen you’re ready to start purchasing stocks, simply open up an account with Fidelity, TD Ameritrade, Vanguard, or the like. I personally use Fidelity, but IIRC TD Ameritrade is better for providing research tools.", "score": 4, "replies": []}, {"body": "My advice is to ditch the idea of trading and only invest. Put your money in popular S&P 500 Index funds and wait minimum of 10 years. It's extremely boring but you can easily become a millionaire in 20 - 30 years if you just continue to invest in Index funds. Put aside a set amount each month and just invest and forget it. Don't touch it till your 30. I wish someone told me this when I was 18. It's the best advice you can ever receive.", "score": 4, "replies": []}, {"body": "It is impossible to explain things here.\n\n1. Buy a really cheap course at Udemy, or somewhere learn basics of stock markets and analysis of charts\n2. Start with $100, teach yourself without fear of losing aim profits over percentage like 1%, 2%, etc...", "score": 3, "replies": [{"body": "I agree, this does not seem possible.", "score": 1, "replies": []}]}, {"body": "I joined TD Ameritrade in like 10 minutes.  You link up a bank account and transfer some funds.  Pick a stock you want to buy and how many shares.  If you're not too picky about price, it's a market order, meaning order will be executed (buy) at best price ASAP.  Most of the time, my buy order gets executed within 5 secs.  Rarely longer.  You now have a portfolio.  Good luck.", "score": 3, "replies": []}, {"body": "buy 100 out of the money spy puts for 0.01 per contract and watch your shit skyrocket", "score": 2, "replies": []}, {"body": "Yeah, I’m 25 and started investing back in March as soon as the pandemic drop happened. I’m also VERY NEW I would take my advice with a grain of salt.\n\nI use Robinhood (you get a free share of a stock if you use a share code so it can be anything from Apple to some startup). I started only putting in $200 into it, low risk but also generally low gain. At the time I had a gain of about $70+ .So far I’ve put in $750 and my gains are at $400+. The majority of my money are in long term investments since Robinhood is not for low cost day trading (I only learned the difference like last month). I’ve been very lucky that I went in during such an opportune time.\n\nOne of the main things you have to do before buying shares is just read up on what is going on market wise. Idk if there’s one answer on WHERE to start but before I buy I usually look at its history from the past year to see if I can figure out what affects that stock price and where it could end up in the next week or a few months from now. \n\nOne of the biggest things: DIVERSIFY, it’s really important to be in multiple types of stocks. I have stocks in oil, real estate, retail, etc. It’s the basic rule of not putting all your eggs in one basket. My last bit of advice is that you gotta be decisive, don’t sit on buying something or selling something for too long because the market can be very volatile. Oh and look up the taxes with stocks.\n\nEdit: Got fucked the last 2 days and I’m now crying.", "score": 2, "replies": []}, {"body": "Look at dumb money on YouTube", "score": 1, "replies": []}, {"body": " I use questrade. You need 1k minimum.", "score": 1, "replies": []}, {"body": "Download Robinhood (an app) and link your bank account. Robinhood is the hip, fun, less robust platform.\n\nYou can also open up with Vanguard. They mostly use a website. Vanguard is the mature, boring, and robust platform.\n\nUse Google to track the history of the stock price. Example Google: \"Boeing stock\" then you can see and manipulate a useful graph.", "score": 1, "replies": []}, {"body": "Remember that the stock market does not function as most folks think it does. Recommend reading [this thread](https://www.reddit.com/r/pennystocks/comments/gwqv7g/for_new_and_inexperienced_traders_please_read/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) to get you off to a good start.", "score": 1, "replies": []}, {"body": "I’m 18 too, I literally just started 4 market days ago (because they don’t run on weekends). I already made a quick $100. The best way to make money is to pay attention to the news and world events. With this whole pandemic thing, it’s the best time to get involved. I been investing in things directly affected by the pandemic. A big one I’d say to invest in is Boeing. I bought it at 145usd, it’s already $203, and was $217 a few days ago. Plus I’m Canadian so the currency change is amazing! And for apps, use wealthsimple TRADE. It has everything. The only thing is if your from Canada you will be charged 1.5% rate on usd, but profit works out usually. But, for your own currency it should be cheap!", "score": 1, "replies": [{"body": "You must be a stock market god.", "score": 1, "replies": [{"body": "ahhh y the downvote", "score": 1, "replies": []}]}]}, {"body": "read the intelligent investor, take notes, read it again.", "score": 0, "replies": []}]}
{"title": "Is this what a bubble looks like?", "selftext": "I'm hoping to generate some discussion on if we're in a bubble, and what kind of data we can look at to help us reach a consensus.\n\nFrom [Investopedia](https://www.investopedia.com/articles/personal-finance/062315/five-largest-asset-bubbles-history.asp):\n\n\"An asset bubble occurs when the price of a financial asset or commodity rises to levels that are well above either historical norms, the asset's intrinsic value, or both.\"\n\nNow, the P/E ratio of SPY is currently around 27 according to [WSJ here.](https://www.wsj.com/market-data/stocks/peyields) That's extremely rich, but it's not entirely accurate. Earnings reports are backward looking, so even before we have Q2 reports showing the full impact of COVID, the market is arguably overvalued.\n\nI looked around today and saw something I've never seen in my nearly 10 years in the market (I know I've still got lots to learn). Hertz, a company on the verge of bankruptcy, went up over 100% today.\n\nZM and NKLA are two more examples of stocks that have P/E's in the thousands, and from the trading activity, it looks like a game of greater fool to me.\n\nSo is this what a stock market bubble looks like?", "id": "gz87wd", "created_utc": 1591650552.0, "score": 20, "upvote_ratio": 0.92, "num_comments": 20, "comments": [{"body": "I have heard people walking down the street talking about how easy it is to make money in the stock market right now. People that have never invested before getting into the markets now to \"make a shit ton fast\" and talking about dumping at the first sign of trouble.\n\nSounds like bitcoin 2.0\n\nshrug.\n\nI follow a few stocks very closely for the last few years. There is no reason for DIS to be 127ish at this moment...and I love Disney.\n\nDisney use to tank at the first sign of anyone getting sick from their rides via any bug/virus. No one is watching movies in theaters and their movie business is directly correlated to their toy sales.", "score": 30, "replies": []}, {"body": "Back in spring of 2000 I remember  hearing waitresses talking about how they are making a ton of money in the market. They were giving me tips and that was after I told them I was involved as broker.\n\nI knew that was a top of of the Market that day. Looking back that day in March was close what the actual top of the market of the tech bubble.\n\nThis is also nuts not quite like that period but clearly people don’t understand that fundamentals matter.  I suspect fractional shares and Robinhood investors here. \n\nIt also will not last long.  The drop here will crush a lot people even hedge funds who think it is different this time.", "score": 11, "replies": [{"body": "Honestly the valuations these days are insanely high. If you compare the March 2009 lows to the March 2020 lows it's clear that the recent downturn is NOT the bottom. \n\nMarch 2009 P/E: 13.30\nMarch 2020 P/E: 24.90\n\nMarch 2009 Buffett Indicator: 52%\nMarch 2020 Buffett Indicator: 120%", "score": 4, "replies": []}]}, {"body": "I don’t think anyone knows that answer.  It’s probably too obvious, but when companies start releasing poor forward guidance at the end of Q2, maybe then we have sellers?  But then again, companies haven’t been punished for not issuing guidance.  And maybe customers will have returned in mass so earnings aren’t bad?  Maybe companies will have reversed course with CapEx spending? There is so much liquidity with no where to put it, I have no idea what will deflate valuations.  I personally don’t think equities are attractive at these prices, but I’ve been wrong so far.    \n\nAt a certain point, starting your own business or getting into pre-IPO investments will yield far more than these equities.  We are saying that we are willing to make an investment and in 27 years we will get the principal back.  That is crazy!  I would rather pay down my mortgage at that rate.", "score": 9, "replies": []}, {"body": "As long as the FED keeps blowing, the bubble can keep on getting bigger.", "score": 7, "replies": [{"body": "But the bigger the rise the greater the fall. \n\nWe're already at record valuations as is.", "score": 5, "replies": []}]}, {"body": "I follow these channels to make sense of current market state and price actions:\n\nhttps://youtu.be/3cARjvs9fns A take on S&P valuation. With his input numbers fair value 2930, depending how you tweak it you can get numbers from below 2400 to 3400+ (distributions included)\n\nThis one relies on TA and his model results, I watch daily videos and he is quite accurate https://youtu.be/mOqSTSG8k-s\n\nWeekly talks on fundamentals with bullish bias https://youtu.be/jsxZvJ6eUC4\n\nWeekly pure TA overview https://youtu.be/gy2K4dC7M2g", "score": 6, "replies": []}, {"body": "This is what irrational exuberance looks like", "score": 7, "replies": [{"body": "It is irrational exuberance based on earnings this minute but the market is already assuming normalcy over the next 6 months. Im not sure why they didnt figure all the protesters would create a second rally in Covid.   \n\n\nI know it spreads more difficultly outdoors but still-and defunding the police??? Are you kidding? We all saw what happened when they were just distracted by the peaceful protesters-Imagine the looting when there are 70% less police. I guess the market knows that aint gonna happen", "score": -2, "replies": [{"body": "They are probably predicting a Trump win, in which case they know that he and the Republicans will prop up the markets with federal bailouts regardless of what actual earnings/employment figures show. Which is terrifying.", "score": 1, "replies": [{"body": "I really dont think they are predicting a DT win-His numbers are falling fast and the more they fall the less scared other repubs will be and will begin to  say what most are afraid to say right now because he is so vengeful. The man isn't right", "score": 4, "replies": [{"body": "I hope you're right. If I were a ruling-class elite, I would be pretty pissed at how he has been managing things so far.", "score": 3, "replies": [{"body": "It isnt a coincidence that Trump's mismanagement of the virus has had knock-on effects like the horrific economic situation and literal riots in the streets. \n\nFrom a good governance standpoint alone the whole country should want him gone. He's been an unmitigated disaster.", "score": 4, "replies": []}]}]}, {"body": "Read an article tonight that basically said the government will not let any publicly traded company go bankrupt. That is bonkers and makes no sense until you read the daily financial times", "score": 1, "replies": [{"body": "I'll give it a read. Thanks!", "score": 1, "replies": []}]}]}]}]}, {"body": "The US is a fascist command economy currently manipulating markets on a scale never seen in modern history.\n\nSo, the short answer is: Nobody knows what's gonna happen.\n\nMost likely, it will lead to massive inflation and a complete lack of confidence in the US stock market once the Fed stops pumping fake money into people's pockets. Unsecured debt relies on creditors' confidence. In case of a national security, that means its people and the rest of the world trading with the US. The US likely won't be able to back its fake money supply with sufficient increases in productivity, so its credibility will be marred and its money will lose value. \n\nThis entire situation is also very likely to lead to war (fascist nations that fail generally try and distract their suffering population by externalizing blame).\n\nThis kind of upcoming economic depression is what primarily [drove Germany](https://encyclopedia.ushmm.org/content/en/article/the-great-depression) into voting for Nazis and starting to exterminate Jews and start wars against several of its neighbours at the same time. The US has already spent the past decade doing nothing but spam anti-Chinese propaganda nonstop, so their victim is gonna be China.\n\nNot a lot of nice things to be looking forward to.\n\nIt's either the collapse of the US economy and decades-long recession for its people that will drag down the entire West and will hand the future to China... or it will be the US regime starting a World War against China. In either case, people will get fucked, regardless how big and nice the numbers on their bank accounts look.", "score": 18, "replies": [{"body": "Upvote for an honest opinion of the situation and possible outcomes. That is all I come here for. Real people not props. Honest opinion not spin. This is all new even for the big boys sitting around sleepless nights trying to figure out what levers to pull and what might work. This is all un-charted and so far by measure of the stock market they pulled it off. Will the makeup come off this pig in our lifetime...TBD", "score": 6, "replies": []}]}, {"body": "No one knows , apparently there’s a lot of money on the way to the moon right now though . The stock market rarely follows logic these days", "score": 1, "replies": []}, {"body": "Yes, I can't believe Hertz went up another 100%.  Surely that's a telltale sign of a bubble.", "score": 1, "replies": []}, {"body": "When Biden becomes president. Maybe.", "score": -2, "replies": []}]}
{"title": "Anyone got calls on $SPCE?", "selftext": "I got eyes on $20+. The company reminds me a lot of $TSLA... people believe it was a 1 time pump and will be surprised when $SPCE goes back to $40 highs again. \nPeople thought $TSLA was a meme at $900 and look at it now 😂😂 dropped to 4-500 and right back at $900.\nBullish asf on $SPCE!", "id": "gz9g28", "created_utc": 1591654059.0, "score": 4, "upvote_ratio": 0.71, "num_comments": 10, "comments": [{"body": "$TSLA may be a meme, but at least it has revenues", "score": 5, "replies": [{"body": "I will agree with that, but we both know financials don't matter with the current market... company can be going bankrupt and pump 1000%", "score": 4, "replies": [{"body": "Very true. Who tf knows anymore lmao", "score": 1, "replies": []}]}]}, {"body": "I got some SPCE, sold half my position at 17.19 today, leave the rest to run higher", "score": 4, "replies": []}, {"body": "SpaceX will help energize the space market and SPCE will benefit from that. $900s like Tesla; probably not. Space tourism isn't going to be as accessible to people as Teslas are, at least not for a while.  $100+, absolutely! #believer", "score": 3, "replies": [{"body": "Yeah I believe in innovation, not so much in this becoming a reality anytime soon but I do expect to see price rocketing :)", "score": 3, "replies": [{"body": "I think commercial space will put people in orbit soon... not on a large or cheap scale anytime soon.", "score": 4, "replies": []}]}]}, {"body": "Spce was the meme before the recession happened", "score": 2, "replies": []}, {"body": "\\>  I got eyes on $20+ \n\nWhat's your expiration?", "score": 2, "replies": [{"body": "6/19 being a little flexible :) could easily happen this week though!", "score": 1, "replies": []}]}]}
{"title": "This week's Market Musings and why I'm 99% cash", "selftext": "Hey everyone, made a market musings video on why I'm 99% cash right now and what I'm looking at this week. I also share a new ETF I came across that offers exposure to the growing world of online betting. Summary below for those that prefer that and for those interested in a link, let me know - happy to share:\n\nI'm in heavy cash because I definitely see tremendous downside potential. Between the rally we've see while still being in a pandemic, the fed's intervention that will eventually have to cease, and my perception that we likely will see another serious wave of COVID as things open back up. I'm absolutely okay maintaining small exposure here.\n\n\\-AstraZeneca / GILD merger talks\n\n\\-OPEC production cut - 9.6M bb per day\n\nTicker Talk:\n\nVRM - IPO. I typically like to watch IPOs, they're interesting events to me and typically offer a volatile trade for those interested. I am not necessarily passionate about online car sales however, so I personally will be waiting until options are available to trade this one.\n\nAAL DAL. AAL made a 70% run up, DAL a 35% run up. These are both short candidates for me due to the price extremes in conjunction with the fact we are still quite a ways from completely opening up.\n\nBETZ. This was a neat ETF I found that offers exposure to online betting. Overall, a market I imagine will continue to expand so I'm hopeful that this will have options on it soon.\n\nFor the haters that there's a video - I still don't sell anything and have no affiliates. If you don't want to see the video, don't go to it. I've been having awesome interactions with people on the channel so I absolutely will continue to do what's more helpful for our community regardless negativity. I prefer to help each other out, not tear one another down.\n\nTrade on!\n\nErik", "id": "gyo0m0", "created_utc": 1591574875.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 10, "comments": [{"body": "How long have you been at 99% cash?", "score": 6, "replies": [{"body": "This past week I started with over 80 lots out, I ended with 10 out. As I hit my profit measures, I just kept closing out of things. So i'd say thursday is when I dropped below 20 lots", "score": 2, "replies": []}]}, {"body": "JPOW used Print. It’s Super Effective.", "score": 5, "replies": []}, {"body": "Another ticker, FMCI really about to blow up", "score": 3, "replies": [{"body": "Thanks for sharing - what makes you say that?", "score": 1, "replies": [{"body": "They are about to merge with a very big plant based meat company. Company is still unknown but if you check out r/SPACs people have narrowed down to a few that it could be. They are also having a meeting tomorrow.", "score": 3, "replies": [{"body": "Very cool. Thanks for calling this out.", "score": 2, "replies": []}]}]}]}, {"body": "Futures green", "score": 1, "replies": [{"body": "Yep yep. Unemployment numbers looked better than expected so that will def help out.", "score": 1, "replies": [{"body": "Fake numbers but nonetheless here we are. I have November puts on SPY 10% out of the money. Getting hosed now but I’ll se to close if we see a little pullback.", "score": 1, "replies": []}]}]}]}
{"title": "Slack partnered with Amazon, good buy?", "selftext": "Anyone got more information on this? Worth the buy?", "id": "gyqx2h", "created_utc": 1591586340.0, "score": 26, "upvote_ratio": 0.76, "num_comments": 15, "comments": [{"body": "They just announced it, no one here would really know what type of features or stuff theyre gonna add and how competitive its going to be. When they do announce features months down the line, expect it jump up, but I don't expect any real advances in the short term (except the general bullish trend for many symbols this week).", "score": 10, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "You heard the man. Seems like a solid option if they already have the general framework.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": []}]}]}, {"body": "But Amazon is a good buy cause it is VERY BULLISH this month. She's gonna pop the fuck up.", "score": 1, "replies": [{"body": "Buying call at open tmrw say less", "score": 1, "replies": []}]}]}, {"body": "I thought Slack was a great product back in 2017 when I first used it. Been trying to get my current company to use it forever. Amazon or not I think it's a great app to invest in.", "score": 4, "replies": [{"body": "The problem for Slack (and Zoom, Okta, etc.) is the Microsoft treatment.  Microsoft will just duplicate their features to be close enough and then bundle it in with other Microsoft products.", "score": 3, "replies": []}]}, {"body": "Hell yea imo. I bought it at the dip on Friday right after earnings and already up 5%. I see this rebounding big this week. Huge overreaction from the market.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Teams sucks no one like it", "score": -10, "replies": [{"body": "Meh, I don't mind teams. I preferred slack at my last company, but is it worth the extra few bucks a month per person, eh.\n\nTeams was hot trash for a while. Not so much anymore.", "score": 9, "replies": []}, {"body": "I like it", "score": 3, "replies": [{"body": "It sucks my company has it and no one like it", "score": -7, "replies": []}]}, {"body": "Teams gives more features and is highly cost effective at enterprise level if you are already in M365 platform.", "score": 5, "replies": []}]}]}, {"body": "Short term play I think so. I don’t see what the fuss is about Slack, it’s not replacing Outlook.", "score": 1, "replies": []}, {"body": "Old news and priced in, if there was a movement, we would’ve saw it", "score": -1, "replies": []}]}
{"title": "Healthy skepticism can save accounts", "selftext": "I recently shared a post of a segment I do called market musings. I essentially just run through some current news and tickets that look interesting to me. (Check out BETZ). In that video, I shared that I’m currently largely in cash (99%) and some folks made it seem like that was the dumbest thing they’ve ever heard. Which made me nervous for my fellow traders. \n\nThey don’t need to agree with my assessment but to completely dismiss the notion that we may possibly be overextended is dangerous. I’ve been trading since 2007 and I’ve learned quickly markets crash down - not up. I caution those that don’t consider the SP500 went through a 36% drop and we are now just 6% off those same all time highs. Unemployment is still high. The fed is still maintaining low interest rates, still buying bonds that should be counted as government debt - which is expected to top $3.7 trillion this year - 18% of our GDP. We’ve yet to see the true damage for individual companies being shut down for an extended period of time, that will come out in the next few quarters. \n\nDespite all that, I’m still bullish in our economy long term and by no means think it’s doomsday. But the complete disregard some folks had towards the topic of the market being over extended and being dumbfounded why I’m heavy cash made me extremely nervous for the thought process our peers are applying here. Again, not saying anyone knows, or that any thought is correct. But to not even consider another perspective is dangerous. Gotta have skin in the game to grow the account but healthy skepticism can save your account. \n\n- side note, I came into cash as of Friday. I had 80 lots out start of the week, closed out with 10. I will maintain exposure but won’t exceed 10% for the next week or so. Then will scale to normal allocation based on where things sit. \n\nTrade on,\nErik", "id": "gyt0z0", "created_utc": 1591594951.0, "score": 2, "upvote_ratio": 0.62, "num_comments": 18, "comments": [{"body": "Being in cash now is a super strong position.", "score": 5, "replies": []}, {"body": "Corona and bankruptcy??\n\nStonks go only up⬆️🚀. ⛔🐻", "score": 4, "replies": [{"body": "This made me laugh haha", "score": 1, "replies": []}]}, {"body": "I agree, A lot of investing rules you hit in this post. Lol @ the comments though.", "score": 1, "replies": []}, {"body": "The race is long - for those that have been around, they know longevity is what truly matters in this business.", "score": 1, "replies": [{"body": "And you know, actually owning stocks...", "score": -2, "replies": [{"body": "I rarely own stock, maybe 10-15x per year. I trade derivatives. But another naive assumption on your end. Seem to be full of them.", "score": 1, "replies": []}]}]}, {"body": "“Be fearful when others are greedy, be greedy when others are fearful”", "score": 1, "replies": []}, {"body": "Well you missed the biggest rally in history. Congrats.", "score": 0, "replies": [{"body": "Adjusted the post to add clarity. But the snide comment added no value. Folks like you are why our investing community has become pretty hostile. So unnecessary. \n\nI had over 80 lots out Monday as of Friday 10 lots. I’m now sitting in cash.", "score": 2, "replies": []}, {"body": "They said the same thing before the crash.  A broken clock is right twice a day.", "score": 1, "replies": [{"body": "Ok well you just keep holding you cash while everyone else becomes rich. I don’t mind haha", "score": 0, "replies": [{"body": "Just waiting for new lows, hope you pull out some of your profits.  Nobody can say things are healthy right now.  Things weren't healthy before covid.", "score": 2, "replies": [{"body": "We’re not going to see new lows. At least in the next year...", "score": 1, "replies": [{"body": "13% unemployed in a pandemic with increasing numbers and no cure, pass the champagne.\n\nEdit: 16.3% unemployment per a misclassification at the bottom of the latest jobs report, per washington post.", "score": 2, "replies": [{"body": "Hahahahaha this cracked me up. Good on you for keeping with the dialogue.", "score": 1, "replies": []}, {"body": "Don’t forget, if things look a little bad, we can just fire the printer up. How much you want??", "score": 1, "replies": [{"body": "The lack of fiscal responsibility by both parties even pre covid with the last budget is pretty frustrating.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}
{"title": "What you guys think about Wells Fargo?", "selftext": "I haven't done much DD but assuming they're in the same business as JPM. Do you think WFC has the potential to go to 45 before EOY?\n\nI think it's coming off a double bottom and looks like ready to breakout and now is a good time to buy.", "id": "gyxsrk", "created_utc": 1591616659.0, "score": 5, "upvote_ratio": 0.67, "num_comments": 19, "comments": [{"body": "Still relatively cheap, I know they have had their issues but I don't think the government would let them go under. Too big to fail IMO.", "score": 11, "replies": [{"body": "Same thought here", "score": 2, "replies": []}, {"body": "Agree with this, i like both JPM and WFC but i think wells has more runway", "score": 2, "replies": []}]}, {"body": "I’m heavy into WFC. I’m sure hoping it burst over $42", "score": 9, "replies": []}, {"body": "Its a good stock to hold.  Has more upside.  Super undervalued right now.", "score": 2, "replies": []}, {"body": "Slow mover. Bought $2k 7 weeks ago and still waiting on a pop.", "score": 1, "replies": []}, {"body": "I'm looking at an October 37.50c option for$1.80 per contract... so, thoughts on ability for this to pop to over 40 by then? \n\nOr maybe go closer to maximize profits on a shorterm pop...", "score": 1, "replies": [{"body": "Most likely yea", "score": 1, "replies": []}]}, {"body": "I bank with them but they are dirty rotten scoundrels.", "score": 1, "replies": []}, {"body": "I'm heavily invested in WFC and JPM. So far they're some of my most solid long term buys", "score": 1, "replies": [{"body": "If you had to pick one to hold for next year which one would you go with ?", "score": 1, "replies": [{"body": "I'd definitely say JPM. JPM makes up a large chunk of my portfolio and I've been pleased with it so far", "score": 1, "replies": []}]}]}, {"body": "$WFC will jump after fed meeting on the 9th and 10th is my bet. Especially if they comment on how well things are going ... which well they are.", "score": 1, "replies": [{"body": "lol", "score": 1, "replies": []}]}, {"body": "Jpm is the better bet", "score": 1, "replies": [{"body": "I already have some JPM, was looking for more value? And saw that WFC hasn't taken off yet.", "score": 1, "replies": [{"body": "Wells is weird, they were bailed, then the whole scandal issue. They’re not in great positions financially either. It’s a high risk reward kinda play.", "score": 1, "replies": []}]}]}, {"body": "Yea I just don’t see it as a longer term hold compared to chase", "score": 0, "replies": [{"body": "Yeah- they are notoriously shady. Every now and then something comes up that halts any substantial growth.", "score": 1, "replies": []}]}]}
{"title": "Taking profits or staying long?", "selftext": "So I'm new to investing and I'm not exactly a math whiz so I could use some help. I'm thinking this market rally is way overdone so I've heard that it may be a good time to take some profits. But if I for instance sell some of my DIS which my cost basis is $88  and buy back in when the market starts to correct, wouldn't I just be raising my cost basis when I go back in? Would it be better to just stay in and buy more with the next dip? Or is it the same difference? Unless of course the stock drops below my original cost basis of $88 which I doubt. If it's all the same, or if it's better to just wait and buy the next dip, then why do some people say to take profit and mitigate risk?", "id": "gyyj6w", "created_utc": 1591619842.0, "score": 1, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "Hold DIS forever. $88 is an excellent cost basis.", "score": 11, "replies": []}, {"body": "I'm not going to address whether you should buy or sell. But I can help you with the math.\n\nYou have $1000.  \nYou buy 1000 shares of a company at $1. The company has 100,000 shares total.  \nYou own 1% of the company. Your cost basis is $1.  \nThe shares rise to $2.  \nYou sell.\n\nYou have $2000.  \nThe price drops to $1.80.  \nYou buy 1000 shares. You still own 1% of the company. Your cost basis is $1.80. You have $1800 in stock AND you have $200 cash.\n\nIf you had not chosen to sell, your cost basis would still be at $1, but you would not have the $200 cash. You would ONLY be holding $1800 in stock. Consideration of cost basis ends once you exit THAT position with a sale. After that, it's meaningless (until it's tax time).", "score": 4, "replies": [{"body": "Thanks that explains it perfectly. Just couldn't wrap my head around it lol.", "score": 2, "replies": [{"body": "You're welcome. You really did make a great decision snagging that stock at $88 though. :D", "score": 1, "replies": []}]}]}, {"body": "if you take profits now, you will just buy in at higer cost basis LATER\n\ntrust me on this. learn from my mistakes", "score": 1, "replies": [{"body": "Appreciate the advice, I'm leaning toward just letting it ride and buying future dips.", "score": 1, "replies": []}]}, {"body": "Do you need cash ? if not i dont see the point to sell some of your DIS stocks to buy some later", "score": 1, "replies": [{"body": "No I don't I was considering it more from the standpoint of protecting what I've gained so far.", "score": 1, "replies": []}]}, {"body": "Timing the market is almost always a bad idea. If you are 99.99999% sure it's going down again go for it. Otherwise, let it ride.", "score": 1, "replies": [{"body": "Yea I think this is what I'm leaning towards", "score": 1, "replies": []}]}, {"body": "I've been having the same conundrum! There should be an online calculator for this. \n\nI'm new as well, purchased good long term stocks that have netted very well in the last few weeks. I'm holding, even through the dip. Though, I think I'll be selling my airlines next week.", "score": 0, "replies": []}]}
{"title": "Protesting leading to another crash?", "selftext": "[deleted]", "id": "gyz4m6", "created_utc": 1591622163.0, "score": 0, "upvote_ratio": 0.25, "num_comments": 11, "comments": [{"body": "No one cares about covid anymore", "score": 13, "replies": [{"body": "Fucking amen", "score": 2, "replies": []}]}, {"body": "I don't think second widespread lockdown chances are very high at this point. We would need to see that, plus a fair amount of fear to have circuit breaker like days again.\n\nThat does not mean that we shouldn't see pullbacks though as we should at some point.", "score": 3, "replies": []}, {"body": "no", "score": 3, "replies": []}, {"body": "😂😂😂", "score": 3, "replies": []}, {"body": "I don't know if its widely accepted as a high risk.  There is a risk, but at least to me, I'd say it's low.", "score": 1, "replies": []}, {"body": "&#x200B;\n\nProtests and COVID19 do not matter anymore because the money printer goes brrr", "score": -2, "replies": [{"body": "No because reopening creates jobs and income", "score": 2, "replies": [{"body": "And creates more covid-19 cases ........", "score": 0, "replies": [{"body": "So what.", "score": 2, "replies": []}]}]}]}]}
{"title": "Citi Says Bear Market Rally Since March \"Driven By Short Covering\" (05/29/2020)", "selftext": "[removed]", "id": "gz5w8y", "created_utc": 1591644063.0, "score": 17, "upvote_ratio": 0.87, "num_comments": 13, "comments": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Well, technically whoever is responsible for this alleged 'short covering rally' was probably short for a very long time, but of course, you can never be sure.", "score": 4, "replies": []}, {"body": "Yes, the past 2 months of $11T+ rally is due to shorts covering. <\\s>", "score": 3, "replies": []}]}, {"body": "so when does the movie the big squeeze come out?", "score": 9, "replies": []}, {"body": "Maybe, maybe not. Our guess is as good as anyone else's.", "score": 5, "replies": []}, {"body": "It’s only makes sense that buybacks have partially inflated the market, now short covers are causing the market rally . Lol. No actual improvements in fundamentals.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Matt Levine said something like that on February 26, 2020 in one of his \n\n\n\n..........\"things\"\n\n\n https://www.bloomberg.com/news/newsletters/2020-02-26/money-stuff-reddit-posters-pick-the-stocks-now", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "There's a reason why they push options so much: the brokers own that place.\n\nThey promote the idea of being  stupid, selfish and superficial so people are stupid with their money  I think...\n\n**sick**", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm pretty sure they have a large influence over the sub, as they're constantly pushing options -- a fictitious product that they invent out of nothing. If you ever try to bash options in there, you will instantly be downvoted into oblivion.  Reddit is the #1 source of news online, and Wall Street Bets is king when it comes to stock gambling, which is where the brokers make a large\n percentage of their income, so it only makes sense that their tentacles are slithering everywhere in that place.", "score": 3, "replies": [{"body": ">  a fictitious product that they invent out of nothing\n\nOptions are \"fictitious\"? What do you mean by that?", "score": 1, "replies": [{"body": " * it's just a deal that almost always expires worthless. \n* an agreement.  \n*  Doesn't actually exist.\n*  Not rocket science.\n* only represents something else", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "1. QE++++\n\n2. Feds buying bond ETFs\n\n3. Real reason? Blackrock is buying equities for the Fed", "score": 2, "replies": []}, {"body": "omg imagine if the bull rally was actually a major uptick in short sellers", "score": 1, "replies": []}, {"body": "If big investors are short covering wouldn’t that mean now they can go long?", "score": 1, "replies": []}]}
{"title": "The next Tesla Stock", "selftext": "Idk if this was already made but will there be another stock like Tesla who spikes in price", "id": "gz5zlz", "created_utc": 1591644346.0, "score": 0, "upvote_ratio": 0.22, "num_comments": 16, "comments": [{"body": "If anyone knew that for sure they wouldn’t be on Reddit discussing it...they would be on their private island doing coke off of Beyoncé’s ass.", "score": 25, "replies": [{"body": "Unless ur jay z", "score": 2, "replies": []}, {"body": "Sound like a great time...", "score": 1, "replies": []}]}, {"body": "You have nkla now. Over hyped they don't have a product to show yet", "score": 3, "replies": [{"body": "I agree. I cant even find their income statements", "score": 1, "replies": [{"body": "Because they don't have any. They will show their product soon though.", "score": 1, "replies": []}]}]}, {"body": "Well NKLA spiked hard today bc a company invested 250 mil into it so who knows if it’ll go up consistently or drop since they aren’t starting production til 2021", "score": 3, "replies": [{"body": "They also announced a date for pre-order of their pickup truck The Badger. Still quite a jump from $35ish at last close...", "score": 2, "replies": [{"body": "Almost to a 100% jump so maybe it’ll drop after it all dies down a bit but definitely surprised me", "score": 2, "replies": []}]}]}, {"body": "PLUG", "score": 3, "replies": []}, {"body": "yes there will definitely be another stock sometime in the future that spikes like Tesla", "score": 1, "replies": [{"body": "Betz", "score": 5, "replies": []}]}, {"body": "Serious question what does everyone think Electromeccanica Vehicles Corp. aka SOLO", "score": 1, "replies": []}, {"body": "Nah. From here on, no other stocks will ever spike in price again.", "score": 1, "replies": []}, {"body": "Nio seems promising", "score": 1, "replies": []}, {"body": "Are you referring to NKLA?", "score": 1, "replies": []}]}
{"title": "Is this what a bubble looks like?", "selftext": "I'm hoping to generate some discussion on if we're in a bubble, and what kind of data we can look at to help us reach a consensus.\n\nFrom [Investopedia](https://www.investopedia.com/articles/personal-finance/062315/five-largest-asset-bubbles-history.asp):\n\n\"An asset bubble occurs when the price of a financial asset or commodity rises to levels that are well above either historical norms, the asset's intrinsic value, or both.\"\n\nNow, the P/E ratio of SPY is currently around 27 according to [WSJ here.](https://www.wsj.com/market-data/stocks/peyields) That's extremely rich, but it's not entirely accurate. Earnings reports are backward looking, so even before we have Q2 reports showing the full impact of COVID, the market is arguably overvalued.\n\nI looked around today and saw something I've never seen in my nearly 10 years in the market (I know I've still got lots to learn). Hertz, a company on the verge of bankruptcy, went up over 100% today.\n\nZM and NKLA are two more examples of stocks that have P/E's in the thousands, and from the trading activity, it looks like a game of greater fool to me.\n\nSo is this what a stock market bubble looks like?", "id": "gz886n", "created_utc": 1591650573.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 7, "comments": [{"body": "America’s favorable treatment of businesses lately amidst the pandemic has led the public to believe that America won’t let a well known company go under, and that bankruptcy does not mean a failing company, it just means a cheap buying opportunity.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "So if earnings don't matter, then what does?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I believe it will ultimately be decided on Q3 earnings. Everyone knows Q2 will be a dumpster fire so the market is writing that off, and the market is also predicting a Q3 earnings beat at this rate.\n\nWe'll see if the market is right.", "score": 1, "replies": []}]}, {"body": "I regards to tech? Growth and hype. That's usually how it goes for the sector anyways.", "score": 0, "replies": [{"body": "That's true, but all the FAANG names are profitable (except maybe Netflix, haven't looked into that one), they have massive **earnings** growth and expected future earnings growth, which is why the stocks do so well.\n\nStocks like NKLA, HTZ, and ZM reek of greater fool mentality, and when I look at the moves in some of these stocks combined with the high valuation on the overall market, it seems quite frothy and bubbly.\n\nIf it's not a bubble, could you explain why you think so so I could get a better idea of your perspective?\n\nThanks", "score": 1, "replies": [{"body": "FAANG were all in this situation before they became FAANG. AMZN, for example, IPO'd in 1997. It wasn't profitable until 2001. ZM, which I got burned shorting before, is seeing record growth thanks to the proliferation of its product. Meanwhile, NKLA, fairly or not, is being treated as another TSLA (Roadster in 2008, IPO 2010), which still isn't profitable. \n\nI'm not saying ZM or NKLA is a good buy, but that's how these types of companies have been valued in the past. What I hope is for price movement slows for some of these stocks until their fundamentals can catch up, but even then, tech valuation by normal standards is always a bubble. There's no rhyme or reason. \n\nHTZ doesn't really fit in that group since it's a rental car company facing bankruptcy, and yes, that price is absolute nonsense.", "score": 1, "replies": []}]}]}]}]}, {"body": "I don't think this is a bubble.", "score": -2, "replies": []}]}
{"title": "Up >10% today and >30% MTD - here's my portfolio", "selftext": "I have a day job that has nothing to do with the stock market. I pay attention to it, have always handled my own portfolio and dedicated small amounts of time here and there to building my skills and knowledge over the last 7-8 years. In the last 12 months I've stepped up my efforts and have been beating the market consistently.\n\nI generally invest in three buckets, in order of position size:\n\n1. Alpha - 3x ETFs (long or inverse depending on outlook)\n2. Long term holdings - 1x ETFs and long-term stock holdings\n3. Speculative plays - undiscovered small caps set to explode\n\nHere's my list of holdings in alphabetical order. Listed by position size in the image link in the comments below:\n\nAMP, AMZN, BNKU, BRZU, CARE, COG, CVX, DFEN, ERX, FAS, FMCI, GUSH, IBTX, IBUY, IJS, JETS, LABU, LBJ, MARK, MCK, MFA, MIDU, MSFT, MTG, NAIL, NKLA, NRZ, OPRA, PAGS, PAYC, PYPL, PYR, QQQ, RDFN, RDN, REML, RQI, SCHB, SOXL, SPCB, TQQQ, UDOW, URTY, VRAY, XLE, XLF\n\nI tried posting links to uploaded images to my account and holdings by position size but wasn't able. I'm somewhat new to reddit so if someone could tell me how, I'd be happy to share.\n\nI use what I know, combined with the Value & Momentum Breakouts subscription on SeekingAlpha  which primarily helps me know how bullish or bearish I should be at any given time based on author JD Henning's proprietary Momentum Gauge. This is extremely important when taking on large positions of 3x ETFs.\n\nIf I can do it, so can you!", "id": "gz8pny", "created_utc": 1591651944.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 17, "comments": [{"body": "In the most polite way possible, what am I supposed to do with this?", "score": 11, "replies": [{"body": "You read through it and decide if there's anything helpful for you. If so, great; if not move on without criticism unless you're trying to discourage contributions to the community. Peace out.", "score": 1, "replies": []}]}, {"body": "Cool story bro", "score": 5, "replies": []}, {"body": "and why do we care ?", "score": 3, "replies": [{"body": "You don't have to care. Some find encouragement when others share their experiences and successes. Ciao.", "score": 1, "replies": []}]}, {"body": "Too many.", "score": 3, "replies": [{"body": "I manage multiple accounts and not all account holders are authorized to trade in leveraged positions, so some of it is duplicative (e.g. FAS is leveraged, but some account holders can only hold XLF). \n\nEven then, I agree with you and am trying to reduce down positions as it is a lot to keep track of.", "score": 2, "replies": []}]}, {"body": "Hey man, thanks for sharing this! I know a lot of people are shitting on you right now and that’s not cool. I really appreciated this post and I found it helpful. I’m really considering getting positions in GUSH but I’m a big pansy.", "score": 2, "replies": [{"body": "Thanks u/MountainDoMew. Of course, I had to quickly exit many of those leveraged ETF positions in order to preserve profits from the last couple of days. I figure the more experiences we can share and collectively learn from--both good and bad--the more we all learn.   \n\n\nNone of us is as smart as all of us.", "score": 2, "replies": [{"body": "Exactly really well said. I don’t just wanna hear success stories, I wanna hear the good and the bad. That’s how we learn and grow. Like you said, that’s how we all learn.", "score": 2, "replies": []}, {"body": "Pm sent. Curious about the subscription. Cheers!!", "score": 1, "replies": []}]}]}, {"body": "My portfolio holdings by position size (large to small):  [https://ibb.co/XS1Y7p4](https://ibb.co/XS1Y7p4)", "score": 1, "replies": []}, {"body": "So you made like 1/3 of it on the NKLA run? Lol", "score": 1, "replies": []}, {"body": "Account screenshot showing returns:  [https://ibb.co/vjFzZnB](https://ibb.co/vjFzZnB)", "score": 1, "replies": []}, {"body": "Bro, 30% gain is hella weak considering the market we are in.", "score": -2, "replies": [{"body": "S&P 500 is up 6.1% MTD. That's ***month*** to date. I'm up over 30% since June 1. That's beating the market by 500%. \n\n🤣", "score": 3, "replies": []}, {"body": "Now while I don’t think it’s anything worth posting in this market. I’m also up 30% MTD. It is not weak as you can reference it’s destroying S&P 500", "score": 2, "replies": []}]}]}
{"title": "Tesla shares hit record closing price", "selftext": "https://www.cnbc.com/2020/06/08/tesla-shares-hit-record-closing-price.html\n\nTesla shares hit a record closing price Monday.\n\nThe stock climbed after data from China suggested Tesla sales have recovered from Covid-19 impacts there.", "id": "gzabtv", "created_utc": 1591656849.0, "score": 14, "upvote_ratio": 0.86, "num_comments": 19, "comments": [{"body": "?? It hit 969 in feb", "score": 1, "replies": [{"body": "Closing price?", "score": 2, "replies": [{"body": "That was intra day, this is highest close", "score": 2, "replies": []}]}]}, {"body": "Is it going to push into $1,000? I'm picking it up tomorrow. Always late on the TSLA rally but after May reports for high sales this is a price ceiling to be shattered.", "score": 1, "replies": [{"body": "The classic buy high sell low strategy", "score": 19, "replies": [{"body": "Ole reliable", "score": 1, "replies": []}, {"body": "WSB FTW", "score": 1, "replies": []}]}, {"body": "Someone (name slipped my mind) will be on squawkbox tomorrow morning talking about TSLA. His words could move this further short term.", "score": 1, "replies": [{"body": "Ron Baron", "score": 2, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}]}, {"body": "Just do it. Dont look back.", "score": 0, "replies": []}]}, {"body": "Bought 1 share at 448 and sold at 888,wish I would of just kept it for long term.", "score": 1, "replies": [{"body": "It’s not too late to buy in again and wait for the future long term gains", "score": 1, "replies": [{"body": "If it dips again I may.", "score": 1, "replies": [{"body": "Dipped today haha\n\nI guess it’s still more than it was at this comment tho so it’s not too relevant of a dip", "score": 1, "replies": [{"body": "Yes it did, unfortunately so did everything else in my portfolio. Lost about $500 in 2 days, rough 2 days.", "score": 1, "replies": [{"body": "I feel you! It’s all good though the markets all about ups and downs. You just gotta stick it out and over the years, with the right company, you’ll make some solid gains!", "score": 1, "replies": []}]}]}]}]}, {"body": "I check Elon's twitter every hour on the hour. I'll know when to sell when he says something controversial.", "score": -1, "replies": []}]}, {"body": "China sales gave the stock a shot in the arm, even though it really should have been expected after April's low sales.\n\nEssentially everyone was expecting Tesla to cut their prices in China (due to changes in the EV subsidies rules, Tesla had to do it to remain eligible), and they did. Those events basically moved a bunch of April sales into May, hence why Tesla had a great May in China.", "score": 1, "replies": []}]}
{"title": "Netflix - why down so much?", "selftext": "Title pretty much explains it - I had 6k in Netflix and it's currently down by quite a bit. I couldn't find out why online; any insights?", "id": "gzaxhr", "created_utc": 1591658808.0, "score": 4, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "Probably because people are doing things outside again. *I am not a financial advisor*", "score": 10, "replies": [{"body": "Hahaha, that's what I kind of suspected.\nWondering how long till the fall ends.", "score": 2, "replies": []}]}, {"body": "Because people are chasing big gains and While Netflix is obviously great long term, people want those 5-10% daily gains to be found in airlines, cruise lines, retail, etc.\n\nIt will reverse back soon though", "score": 6, "replies": []}, {"body": "Because airlines, Boeing, nikola, cruise lines, banks, and oil. America!", "score": 5, "replies": []}, {"body": "I’ve always been bearish on Netflix tbh. Not enough to short or to buy puts because it’s lumped into the FANG gang, but it still isn’t cashflow positive and it is facing serious competition in its only business. Sentiment fuels this stock, a few bad quarters (or quarters that don’t justify its 49 forward PE) can crush this stock. If a second stock market shock comes there could be a pump into NFLX due to its position regarding the pandemic, but long term it’s just past its prime imo", "score": 6, "replies": [{"body": "This is what's recently come to my attention, too - I'm hoping I can get out of my large NFLX investment long term exactly for that reason.", "score": 2, "replies": [{"body": "Don’t sell all at once. Create a progressive liquidation plan because I could see technical traders buying simply cause it is pushing into some oversold territory, which could pump up the price. Maybe not ATH, but good enough. My thesis for NFLX remains the same for if the stock market caves again, see above. Also make sure you have a plan for the capital going out. I’d recommend some stability over risk, balance sheet juggernauts over pumped-up consumer discretionary picks, or perhaps simply hold it in an etf. Hope it goes well.", "score": 2, "replies": []}]}, {"body": "Yes, exactly. They're losing tons of content to competitors and they're producing a lot of their own content, which is expensive. I think they're headed for a crash, frankly.", "score": 1, "replies": []}]}, {"body": "Stay at home stocks have been getting sold recently in order to get capital to buy small caps and banks.  I think Netflix needs the virus coming back in order to get back up there.", "score": 2, "replies": [{"body": "Interesting - would you go for banks at the moment?\nAlso - do you think without the virus Netflix has the potential to get back up to ATH?", "score": 1, "replies": [{"body": "Ever since the mini bottom a few weeks ago, small caps and banks have been the outperformers.  I actually follow NFLX and Zoom to see what's going on with virus stocks, and both are in downtrends while small company stocks are up.  http://schrts.co/TBnyxKrv\n\nThat is a chart of the banks vs NFLX.  Actually, NFLX is oversold compared to the banks bigtime.  You might want to wait it out.", "score": 1, "replies": [{"body": "Very interesting - thank you!\nI've been meaning to pick up some airlines and banks recently.\nI'll not be selling Netflix at a loss, or at least - not yet.\nLooks like I'll be watching and waiting.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I'm hoping to sell and get out of it too. I'd rather not do it at such a big loss, though; I'm alright with leaving my shares for a while if that's what it takes.", "score": 1, "replies": []}]}]}
{"title": "Tesla Was Top-Selling Chinese EV Brand In May, Sales Jump 205%: Report", "selftext": "", "id": "gyza6b", "created_utc": 1591622728.0, "score": 116, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "Remember Tesla shorts made it a big deal that Tesla's April sales in China was low? We laughed at them that they are so stupid we didn't bother to explain why April was low. Never listen to TSLAQ, they are always wrong.", "score": 25, "replies": [{"body": "No joke this is the only finance thread on reddit that has not been completely full of shit over the past few months.", "score": 2, "replies": []}, {"body": "What was the reason April was so bad?", "score": 1, "replies": [{"body": "When I know EV will have a discount next month due to new EV incentives, I wouldn't buy this month. When a big incentive is ending next month, then this month's sales would jump. \n\nThe point is ALWAYS ignore stupid people, in this case ignore TSLAQ. They have been proven to be truly stupid in the past 10 years through numerous examples. Just do your own research that's way more valuable than listening to TSLAQ.", "score": 8, "replies": [{"body": "OK, which brings me to my next question: So if people stopped buying last month because of the impending incentive, wouldn't that mean May's number contain most of April's delayed sales and thus May's numbers should be looked at more like a 1.5-2 month total?", "score": 0, "replies": [{"body": "On the surface that logic is right. But there are many other factors in the play:\n\nCar buying has a little delay effect. You decide to buy this month, the car might be delivered in a few weeks. End of March was scary in the world. Most people don't buy big items even if they had the money. In April, we see a lot of recoveries everywhere. So incentive is only one factor, stock market and economy recovery is another factor. \n\nThen it comes the biggest factor: Tesla cars sell Tesla cars. This has been so obvious to Tesla investors, but TSLAQ crowd can't udnerstand this ever since 2012. They still can't understand this point after we tried to educate them again and again, to a point it's not funny anymore.\n\nChina's demand for Tesla vehicle will reach 5 million per year. In a few year you will see my estimate is conservative. So I don't understand why people pay so much attention to monthly numbers.", "score": 2, "replies": []}]}]}]}]}, {"body": "The future is now..", "score": 8, "replies": []}, {"body": "Lol at \"shares[edit: sales] jump 205%\", of course they did when April was what it was", "score": 2, "replies": [{"body": "I think we'd all be happy if shares jumped 205%! They're on their way!", "score": 1, "replies": [{"body": "Fuck. Shares* haha", "score": 2, "replies": [{"body": "SALES* wtf", "score": 3, "replies": []}]}]}]}]}
{"title": "Today’s gains thanks to holding BA over the week and sending some $$ into NKLA when it was up 20% this AM. Watch me lose it all tomorrow.", "selftext": "[deleted]", "id": "gz7ahk", "created_utc": 1591648059.0, "score": 7, "upvote_ratio": 1.0, "num_comments": 12, "comments": [{"body": "The cuckening  has begun!!", "score": 3, "replies": []}, {"body": "Got 2 NKLA 55c 6/19 for 2.75 and they are now at 21.55. Going to hold forever and ever", "score": 4, "replies": [{"body": "Sold my 30c 6/19 two days after the merge 🤡🤡, grats and fuck you", "score": 3, "replies": [{"body": "This is the way! And thank you xoxo", "score": 1, "replies": []}]}]}, {"body": "Grats.....I like WeBull, it’s just takes ages to deposit funds", "score": 2, "replies": []}, {"body": "I sold my 55c this morning at $60 and will be crying myself to sleep", "score": 2, "replies": [{"body": "You’ll get it next time.. right??", "score": 1, "replies": [{"body": "Probably going to jump back into tomorrow am 😜", "score": 1, "replies": []}]}, {"body": "sold my $41c debit spread for a $50 profit this morning. in crying with you", "score": 1, "replies": []}]}, {"body": "The craziest part is I was down to $70 on 5/25.", "score": 1, "replies": []}, {"body": "Risk Level Caution?", "score": 1, "replies": []}, {"body": "Risk level? What the fuck is that?", "score": 1, "replies": []}]}
{"title": "NCLH, BAC and C...Friend suggested I post and now a follower!", "selftext": "", "id": "gz7vp9", "created_utc": 1591649649.0, "score": 197, "upvote_ratio": 0.91, "num_comments": 17, "comments": [{"body": "Withdraw all but 28k so u can day trade with some risk\n\nEdit; what are your positions?", "score": 52, "replies": [{"body": "This is my goal. Ended today at 23.5K. Hoping to withdraw all past 28K and grow past that", "score": 21, "replies": [{"body": "Agreed, that’s been my play all along (and been hurt by it since I would have made more by holding but I’d rather take profits as I go) \n\nIt’s mostly been been buying and selling call options on Norwegian, citi and BAC mostly \n\nBought the following today except been holding ladr (dividends)\n\nNCLH call at 24 and 30 (expiring 6/12 and 6/19)\nCPE 4 dollar call expiring 6/19\nC 75 call expiring 7/24\nAlso have 95 shares of LADR", "score": 5, "replies": []}]}, {"body": "Withdraw enough to pay taxes as well.", "score": 2, "replies": [{"body": "lose it and you dont have to pay taxes, in fact the government will pay him to lose it.", "score": 5, "replies": []}]}]}, {"body": "Positions or ban", "score": 17, "replies": [{"body": "NCLH call at 24 and 30 (expiring 6/12 and 6/19)\nCPE 4 dollar call expiring 6/19\nC 75 call expiring 7/24\nAlso have 95 shares of LADR", "score": 4, "replies": [{"body": "I have NCLH call at 24.5 expiring 6/19 are you holding till expire?", "score": 1, "replies": []}]}]}, {"body": "How many contracts and how long did you hold them?", "score": 10, "replies": [{"body": "This!  Positions !", "score": 4, "replies": []}, {"body": "At this point pick anything and it’ll go up", "score": 5, "replies": [{"body": "I'll inverse that by picking nothing and complaining that I didn't pick X stock when it was a penny cause it skyrockets like it's trying to leave the fucking atmosphere in 3 years.", "score": 13, "replies": []}]}]}, {"body": "Wait I don’t understand... why are there no sharp drops in that chart?", "score": 3, "replies": [{"body": "Because the market is broken 🤷‍♂️", "score": 6, "replies": []}]}, {"body": "We only do red graphs here.", "score": 2, "replies": []}, {"body": "Welcome, this sub is great place for you to wipe it all out. Just be sure to post after.", "score": 2, "replies": []}, {"body": "Shut up bitch", "score": -3, "replies": []}]}
