{"title": "6-9-22 SPY Daily TA (bonus CPI day trade breakdown)", "selftext": "Well aint that a beautiful site to see! Finally a beautiful trend day. And one that gave us many answers that I said we were missing yesterday in our daily TA. My overnight puts paid out a nice 33% at open too ( I was busy with family stuff so I took profits instead of letting them eat). \n\nhttps://preview.redd.it/pe0inyakwo491.png?width=975&format=png&auto=webp&s=a06292154f34a2cae61af40b40403d16e03ebef7\n\nAfter that morning “breakout” and rejection at 411.7 it was pretty much down hill all day from there. Bulls actually put up a convincing fight at 1pm that then led to a massive 2.3% drop over the next 3 hours. I was not able to capitalize as much as I would have liked to on this dip only because I have major trust issues with SPY. With the last two week full of BS reversals and fake outs and huge drops followed by bigger rips I just couldn’t stay in the way I wish I coulda have. But I was still able to grab some small wins. I will have more trust in SPY and an overall direction/ trend once CPI and FOMC are over. \n\nhttps://preview.redd.it/wvjtqovkwo491.png?width=975&format=png&auto=webp&s=100cddfee3da6a4eba87292bf0449564b3278b39\n\nYesterday I mentioned the VIX had bounced off the key 23.8 level and that I would be looking for the bounce to 25.5 intraday and eventually 30 over the next few days (if not tomorrow). Well we closed at 26 today. That means we are officially back in the 25.5 to 34.5 VIX channel that we spend almost a month and a half trading within. With that rejection off 23.8 and breaking 25.5 I suspect we will see some red ahead and will be looking for 29.6 VIX tomorrow. \n\n&#x200B;\n\nhttps://preview.redd.it/hvf3ffdlwo491.png?width=975&format=png&auto=webp&s=285d0cff5ee4e442c753833063c8e9c9491b6aa6\n\nThe daily chart looks a little busy but let me explain it so you can see what I see. Yesterday I mentioned that we were right at a key support for a massive ascending wedge on the daily (red dotted lines) well today we confirmed broke that and broke some other major supports. I was watching for support at 407.9 but today SPY broke through a ton of major supports that gives me confirmation of some bearish days ahead. We not only broke the daily 8/20 ema we closed below them. We also broke the purple channel which means there is not support bounce coming. IT should be pretty much red from here on out. If you track the blue arrows you will see the breakout, rest/ rejection and now the impending dip back to 380-390. It actually looks like an inverse cup and handle forming to me. \n\n&#x200B;\n\nhttps://preview.redd.it/o374090mwo491.png?width=975&format=png&auto=webp&s=7c920b8a55e4758dc9f88dd37b9fe0b1c55d092c\n\nHere is a cleaned up and updated daily SPY. What I am going to look for tomorrow IF we don’t just open and drill is a possible bounce and rejection of 405.5 resistance (there is a slight possibility we see 406.6 which is the 15min major channel resistance). I wouldn’t be surprised to see a red open after CPI, the usually morning breakout followed by the 1030 am dump. I think we will see SPY close EOD near 395-398 support (with 398 being the next major support on the daily). \n\n&#x200B;\n\nhttps://preview.redd.it/utomnzimwo491.png?width=975&format=png&auto=webp&s=2736be072873b6b1d13ceb79c692a7fa287db0ae\n\nI had also mentioned yesterday that we are seeing a triple top on the weekly chart and well with this drop today we are now seeing SPY at the V shaped recovery support line with 400 being a confirmed break of support. We also are pretty much outside of a MASSIVE 3%+ green day tomorrow confirming our 2nd red week in a row now. That means 9 of the last 10 weeks for SPY have been red. I anticipate a closure of SPY under 400 tomorrow for the week and that we will retest 380 range next week with FOMC being the catalyst to really spike VIX and drill SPY. \n\n&#x200B;\n\nhttps://preview.redd.it/gwicr72nwo491.png?width=975&format=png&auto=webp&s=8d5e769ad44018327ff43ad48908c225e14535e7\n\nOverall looking at the last 5 CPI releases you can see 3 of the last 5 were red opens with two of them being significantly red (I posted this in a separate post early and someone corrected me that I had made the April 12th open red instead of green). The odds of a red open tomorrow is fairly good in my opinion. This is also the biggest drop for the two days leading to CPI yet. With this massive afternoon drop and how unusually bullish everyone has been speaking about CPI and that the recession is off I think we are gearing up for a huge miss. If markets and big money truly expected a great CPI tomorrow we would closed 2.5% green not 2.38% red today in my opinion. \n\n&#x200B;\n\nhttps://preview.redd.it/yox1xqmnwo491.png?width=975&format=png&auto=webp&s=6002452bdbb0f02f3e5292ad30a4c602ce688ba9\n\nCurrently markets are expecting along with consensus of a 8.3% CPI which is the SAME as last month. I have a feeling we come in near 8.4 to 8.5%. Which will mean inflation has not quite peaked and will definitely mean inflation is not coming down. Now if the off chance we come in higher then 8.5% (February missed by 0.3%) that would really in my opinion drill SPY into the ground tomorrow as there would be no hiding that inflation hasn’t peaked then. It is going to be interesting to say the least. \n\n&#x200B;\n\nhttps://preview.redd.it/p74bf64owo491.png?width=881&format=png&auto=webp&s=431320541bdfe193668aaeedbd758383ebf955e7\n\n&#x200B;\n\nhttps://preview.redd.it/830lfloowo491.png?width=845&format=png&auto=webp&s=eb26555f9c9d0d7646f12401896094c34a203aa1\n\n&#x200B;\n\nhttps://preview.redd.it/74o4u98pwo491.png?width=975&format=png&auto=webp&s=73f23cf752096c1668d8e6c5b823f40bb6038a4b\n\nAs you can see backtesting that the last 5 CPIs no matter opening green or red we will see the peak of the day around 1030am. From there SPY had 5 out of the 5 last times dumped or at minimum traded back at open. Its pretty safe to assume we will open and see a pop till 1030 and then see a drop from there on out. I had called out to my server I was definitely going to play puts just for the favorable odds not only over night but intraday that I at minimum would see a break even. IF you took puts with me I highly recommend taking profits at open. The Only reason I would not take profits at open is if we see 8.5% or higher CPI and markets show no recovery pre-market. If CPI truly comes in bad enough there is a chance we might see markets just drill all day long. The VIX is low enough to allow a -3 to -4% day without much effort. I also will not be taking a loss on my puts at open if we happen to open green and will let them ride till EOD with expectation of the same trend. \n\nAlso looking at the last 5 CPIs (refer back to my chart above) you can see that 3 of the last 5 CPIs the FOLLOWING day saw a massively red day. Also to note that 5 of the last 5 opened red the following day (the May -0.1% day is deceiving as we actually saw SPY open -0.8% and reach a low of 1.9% before it recovered that day). I will be almost certainly regardless of CPI outcome taking a high probability put position EOD tomorrow. \n\n10% challenge\n\n&#x200B;\n\nhttps://preview.redd.it/5bifm8wpwo491.png?width=489&format=png&auto=webp&s=e1a859020ab8ca30061c0f4d83f4093b2e37e8b6\n\nI definitely was scared money today. I still reached almost 5x my daily goal but I had a hard time trusting the EOD drop. I just was waiting every 10 seconds for the 1% rip green. I was happy to still lock in some profits and that overnight put was excellent. My indicators were 5 of 5 lighting up bearish too but I still had trouble trusting it. This market has made it very hard to trust the obvious. \n\n&#x200B;\n\nhttps://preview.redd.it/kl5bdsbqwo491.png?width=659&format=png&auto=webp&s=87f75e8d9cde77f6c9503dd451e76f9dfffd65a9\n\nRocking this bad boy overnight with the expected VIX spike and probable red open should be looking at a nice 30-50% at open.", "id": "v8vbnd", "created_utc": 1654821610.0, "score": 131, "upvote_ratio": 0.95, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|193|**First Seen In WSB**|1 year ago\n**Total Comments**|1754|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/v8vbnd/6922_spy_daily_ta_bonus_cpi_day_trade_breakdown/) [x](https://www.reddit.com/r/wallstreetbets/comments/ur9t1w/51622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/spxvil/spy_210_the_bear_rages_on/) [x](https://www.reddit.com/r/wallstreetbets/comments/uyxorz/52722_spy_pre_market/) [x](https://www.reddit.com/r/wallstreetbets/comments/skp8ci/24_spy_recap_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/us0d0d/51722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/rj1up5/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/v23784/53122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v6ewtr/6622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/up5w3m/51322_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/up5xtr/51322_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/lyng6s/buy_the_rumor_sell_the_news_hear_me_out_here/) [x](https://www.reddit.com/r/wallstreetbets/comments/riyt4w/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/usqmwy/51822_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v2sj0k/6122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v7clxo/6722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uwdhxd/52322_spy_daily_ta_bonus_fomc_minutes_reaction_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uwdk8h/52322_spy_daily_ta_bonus_fomc_minutes_reaction_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v3mubg/6222_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v82mas/6822_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/rgqp0q/spy_dec_14th_recap_and_dec_15th_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/v48yk1/6322_spy_weekly_ta_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/uthl4s/51922_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uthspd/51922_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/ux4ri2/52422_spy_daily_ta_fomc_minutes_prediction/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v8vbnd)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v8vbnd)", "score": 1, "replies": [{"body": "this is this stuff i look forward to every evening 😌 My puts need to feast", "score": 2, "replies": []}]}, {"body": "This is some good fucking shit", "score": 34, "replies": [{"body": "One of the most consistent quality posters here, thx daddy", "score": 6, "replies": [{"body": "Yes thank you. Great insight and very appreciated", "score": 1, "replies": []}]}]}, {"body": "Holding 4 390p for 6/15 and 3 416c for tomorrow to hedge just incase the market decides cpi is fine and we run up. Hopefully cpi 8.5 or up. Carrying one 2205p on Google for tomorrow also. Figured if we dump hard that was a good gamble. Free play for me after scalping  Google a couple times on iv spikes.", "score": 7, "replies": []}, {"body": "You’re way too smart for us fkn retards on here. Great post", "score": 23, "replies": [{"body": "I see big red candle I enter puts \nI see big green candle I enter calls \nIs supposed to be easy no?", "score": 6, "replies": [{"body": "No I do opposite. I buy call then big red candle. I buy put but then big green candle. 60% of time\nIt work every time", "score": 8, "replies": []}]}]}, {"body": "Funny thing is. I took 3 calls at open after the first couple reds. All 3 plays bang hit beautiful and I was done for the day. Completely missing out on the massive end of day dump. Outside of some lotto 390p I took at the top", "score": 6, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "It was actually a pretty banging day. Except I was playing super small. 2 100% and a 50% in my first 3 plays. And the 390p went 3x by end of day", "score": 3, "replies": []}]}]}, {"body": "Really like this analysis. Glad I'm not the only one who didn't trust the drop today and closed out the short wayyyy too early.", "score": 5, "replies": []}, {"body": "Thanks ![img](emote|t5_2th52|4270)", "score": 4, "replies": []}, {"body": "Why does it always seem to poop at 10-10:30a?  Is the market sentient? Does it sense the coffee poop is kicking in for everyone, and tries to take their money while they are distracted by the destruction of toilet stalls across the east coast?\n\nJust asking, as this is prime coffee poop time in my office...\n\n:)", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "nopes, the close is around 11:30 am to around 12:30.\n\nThe dump is the profit taking.", "score": 3, "replies": []}]}, {"body": "#SIMPLE ITS RIGGED", "score": 0, "replies": []}]}, {"body": "Thanks for this great post. Made me a weeks pay :)", "score": 3, "replies": []}, {"body": "yep thinking of buying 380p expiring eom at open cus I think we open green", "score": 2, "replies": [{"body": "I think it opens red in a gap down.\n\nUsually(4/5 times) id agree that when momentum closes the day in a spike, next day starts in premarket counter rally. \n\nThis is likely that 1/5, where momentum continues in premarket.\n\nBear pullback ended in consolidation that broke to the downside. Cpi at 8am will show inflation rather unchanged. Fed want assets crash because they can't print to bail it out and no other tool to pop inflation bubble. Quantitative tightening has begun or will soon 🤔", "score": 6, "replies": [{"body": "it has, it started last wednesday", "score": 7, "replies": []}]}]}, {"body": "Looking at the historical reaction to CPI misses/hits, couldn’t one assume that this is being priced in after this week?\n\nSeems like the first time we’ve drilled consecutively leading into the report. Just a thought. \n\nThanks for the update!", "score": 2, "replies": []}, {"body": "Thanks for this. Doubled my money this afternoon on 398P. Sold half and letting the rest ride for tomorrow.", "score": 2, "replies": []}, {"body": "I opened 406p 6/10 spreads mid-day, should max profit there\n\nHow do you think TQQQ responds? I opened 30p spreads expiring 6/10 there as well. After hours is showing me 30.07, so we're getting close, but I need another sustained downward movement to close out tomorrow with my intended profit. Should go as SPY goes right?", "score": 2, "replies": []}, {"body": "surprise upset, all that volume was at the very bottom of the day.", "score": 2, "replies": []}, {"body": "This morning’s small bump made me sell out some double bagger FDs for small profit, but I did end up taking some overnight put positions as well (shipping sector, a lot of fud already wrecking them (port worker strikes) and I think bad CPI will do them in as well despite their high profits from port congestion.\n\nThanks for the usual daily ta breakdown.", "score": 2, "replies": []}, {"body": "Do you still expect a dump if the CPI comes in slightly better or the media massages the headline to make it look good?", "score": 2, "replies": []}, {"body": "Thank you nate", "score": 2, "replies": []}, {"body": "Thanks for the detailed post. My technicals show that the market is gearing up for a strong relief rally (today's dip notwithstanding). Now a very bad CPI number will obviously kill that but anything 8.4 or lower will give us a good rally IMO. I went long QQQ at 299.", "score": 2, "replies": []}, {"body": "Excellent analysis", "score": 2, "replies": []}, {"body": "Green is Tomorrow. \n\nEveryone and their boomer grandpa knows they want Red.", "score": 2, "replies": []}, {"body": "Thanks DD, gotta sell out of this 0DTE 402C asap on the pump. Pre market looks like it’s pumping\n\nEdit: I spoke to soon, time to cry ![img](emote|t5_2th52|4260)", "score": 2, "replies": []}, {"body": "Think I'll grab a put today around 10ish after it bumps up. Do you think spy will continue to drop next week and test May lows?", "score": 2, "replies": []}, {"body": "Fidelity has me stalemated currently. Was gonna buy 400 405p yesterday but they have my trading restricted because of some worthless fucking document I had to sign that they didn’t make me aware of until my account was restricted. Thanks for the daily analysis, wish I could’ve played this one.", "score": 2, "replies": []}, {"body": "A gentleman and a scholar ![img](emote|t5_2th52|8882)", "score": 2, "replies": []}, {"body": "You’re my daddy. In all seriousness, way to absolutely peg these past two days!", "score": 2, "replies": []}, {"body": "🐻 Why say lot word when few do trick 🐻", "score": 6, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "You are a fool. This guy gives good info everyday.", "score": 10, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "His Charts & Data are nice though. Gives a lot of info that you generally would have to research yourself (Past CPI days etc). You say no hate but you comment hate on a post that he took his time to put out for free. No need to disrespect is all I’m saying. If you don’t like the post or it isn’t useful for you then just keep it moving.", "score": 10, "replies": []}, {"body": "Maybe, but it's better than the half assed memes all over the front page.", "score": 2, "replies": []}, {"body": "....with the data to back his \"why\"", "score": 0, "replies": []}]}]}, {"body": "[removed]", "score": 5, "replies": [{"body": "Wish i had read this this morning. Some long dated bullish trades were made", "score": 1, "replies": []}]}]}, {"body": "I have not traded SPY yet at all, but I've been reading your posts and past TA, I think maybe tomorrow I'll try my first SPY trades and I'll be using you're support and resistance points to plan my entry and TP, thanks for the DD, I never have time as I'm currently at work, have been since 2 and won't get home until 2 am", "score": 2, "replies": []}, {"body": "Thanks!", "score": 1, "replies": []}, {"body": "Giving more confidence for poots, eh? Thank you 🙏", "score": 1, "replies": []}, {"body": "After reading yesterdays post I bought 12 6/17 390 puts at an average of 1.29 and held on to them all day. Thanks For all the great posts!", "score": 1, "replies": []}, {"body": "Thanks OP", "score": 1, "replies": []}, {"body": "Thank you papi", "score": 1, "replies": []}, {"body": "this TA get my DH", "score": 1, "replies": []}, {"body": "I wonder how oil is going to hold up when the CPI shows inflation has gone up again \\[even if only slightly\\].\n\nI read reports that there are more people in work. This means that there will be more payroll taxes coming in. People in work will also be spending their money which means more sales taxes.\n\nA lot of inflation is naked greed from corporations. Why is the FED not taking into account, or at least acknowledging, that corporations are a major driver for inflation because of this?\n\nIf at least part of the inflation is due to corporate price gouging, why does the working world need to be bludgeoned into submission for something they did not cause and have no influence over?", "score": 1, "replies": []}, {"body": " CPI at 8 est?", "score": 0, "replies": []}, {"body": "What are you expecting the VIX to open at if the CPI is bad?", "score": 0, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "That would be lovely for my $UVXY calls. Lol thanks for the input. Your post are always appreciated. I view them daily.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "It’s been down & consolidating for so long. It’s bound to make a move upward at some point. I’m surprised it wasn’t earlier in the week but I expect it to keep rising with all the uncertainty tomorrow & next week.", "score": 3, "replies": []}]}]}]}]}, {"body": "What is the inverse of uvxy? I loaded up on UVXY yesterday but will need to inverse myself in a couple weeks.", "score": 1, "replies": [{"body": "YXVU", "score": 1, "replies": []}]}, {"body": "Here we go! How bad ya think this drilling?", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Do you still see open then rally til 10:30 before dumping. You mentioned if it came in at 8.6 just drilling", "score": 2, "replies": []}, {"body": "That’s it? Lol", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Pre market already bounced of $391\n\nToday is going to be a bloodbath", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "The 8:40 candle is showing on Questrade a low of $391.01", "score": 1, "replies": []}, {"body": "Looks like there is support there for premarket?", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "I'm surprised we chopped sideways all day.  With how many times SPY got rejected moving up, I thought it would break 389/390.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Looking to buy puts over the weekend, is it better to buy more contracts on 13 June that are deeper otm or a hand few on 15 that are not too deep. How does theta play a part in this assuming I expect spy to drill over the weekend.", "score": 1, "replies": []}, {"body": "I'm new to puts and I can't totally make sense of this analysis. Would a put option at 395 expiring EOD be a good play?", "score": 1, "replies": []}, {"body": "You think spy might just pull a major reversal on us like last time?", "score": 1, "replies": []}]}
{"title": "You think this is a crash... it is merely a blip.", "selftext": "Some simple math for y'all...\n\nSPY is down about 19% from its high.\n\nIn the prior 20 years or so the market has had much larger declines. After the dotcom bust it declined about 42% and during the Housing bust it declined about 48%.\n\nA measly 19% drop off outrageous highs is a mere curiosity.\n\nIf you want to know what will happen with the market... it might decline another 20% or so, it might go up or it might stay flat. In the long-run it should go up especially with inflation going to drive nominal increases long-term in earnings.", "id": "v9b7vi", "created_utc": 1654877438.0, "score": 87, "upvote_ratio": 0.79, "num_comments": 85, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|8|**First Seen In WSB**|1 year ago\n**Total Comments**|2918|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/p36ywi/ride_why_lordstown_motors_is_headed_to_zero/) [x](https://www.reddit.com/r/wallstreetbets/comments/pzcpyn/ride_still_headed_to_zero/) [x](https://www.reddit.com/r/wallstreetbets/comments/pzcsqv/ride_still_headed_to_zero/) [x](https://www.reddit.com/r/wallstreetbets/comments/qs2xmj/ride_part_3_and_perhaps_my_final_post_about_them/) [x](https://www.reddit.com/r/wallstreetbets/comments/uu37a4/buy_puts_sp500_overvalued_2025/) \n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v9b7vi)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v9b7vi)", "score": 1, "replies": []}, {"body": "“In the long-run it should…”\n\nYou lost us there. We will all be insolvent from our shitty leveraged bets by 3pm, lol.", "score": 70, "replies": [{"body": "🤣🤣🤣\n\nSome of us actually have investments that we hold for years and not all a bunch of FD's.", "score": -57, "replies": [{"body": "We don’t like your kind round here boy", "score": 49, "replies": []}, {"body": ">investments\n\nBro forgot which sub he was posting in", "score": 14, "replies": []}, {"body": "Then leave", "score": 22, "replies": []}, {"body": "![img](emote|t5_2th52|4886)", "score": 2, "replies": []}, {"body": "This is a get rich quick scenario here muh boiiii", "score": 1, "replies": [{"body": "Well, my next post was going to be about how you should pay me $100 a month so I can tell you have to navigate these troubled waters. Either that or write a book about how to get rich quick. Would use all sorts of big words to impress people, when the real secret is getting people to buy your book.", "score": 0, "replies": []}]}]}]}, {"body": "Dropped 42% and 48% over two years*\n\nLast ath was 6 months ago", "score": 23, "replies": [{"body": "Yeah, it was an extended bear market. Did not see the point of getting into such detail. Rather the key point was the market did decline those approximate amounts.", "score": -3, "replies": []}]}, {"body": "All I have to do to turn this entire global meltdown, and put it all back in the green is sell at my 80% loss. After that it will immediately moon. The whole fucking thing would moon 300% in one day. But it will never happen because of my measly 20k is holding back the entire global economy.", "score": 23, "replies": [{"body": "We are better off chipping in and getting your 20k back and off to the races then!!", "score": 3, "replies": [{"body": "I would just make the dip more dipper. Dippier?", "score": 2, "replies": [{"body": "Your account would have to be deleted once refunded so you can’t enter back in and cause more dippers", "score": 2, "replies": [{"body": "More chippies, less dippies.", "score": 1, "replies": []}]}]}]}]}, {"body": "All this is, is an opportunity to reduce cost/basis for anyone who actually had their head out of their ass and didn't YOLO\n\nThis is (possibly just the start of) the buying opportunity people have wanted for 2 years now", "score": 10, "replies": []}, {"body": "Thanks for calling the bottom", "score": 8, "replies": []}, {"body": "I don’t think we have seen the real crash of this year yet.", "score": 22, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": ">China and India are strong, the worlds biggest players, if they were in trouble we’d know something was early wrong…\n\n**\\*Evergrande Group has entered the chat\\***", "score": 11, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "That old chestnut! Tired old news, not relevant.", "score": 2, "replies": []}, {"body": "It’s just one company ![img](emote|t5_2th52|4641)\n\nFantasia holdings, sunac and co: yeah… just one", "score": 1, "replies": []}]}]}]}, {"body": "Well if inflation is high then why don’t stocks go up if it outperforms inflation ![img](emote|t5_2th52|4886)", "score": 17, "replies": [{"body": "Nobody wants to buy going into a recession", "score": 10, "replies": []}, {"body": "We all know why: 🌈🐻\n\nStocks outperform inflation over time. Extreme fear is on the menu today.", "score": 8, "replies": [{"body": "It may be on the menu but I haven't seen any orders yet.", "score": 2, "replies": []}]}, {"body": "Inflation is a retrospective measure not a forward looking one. Lot of other factors at play as well. Just was pointing out that we can see a much larger decline still, but not that it is a necessary outcome.", "score": 2, "replies": [{"body": "You’re trying to talk sense to a bunch of monkeys throwing feces at each other. Grab a handful or gtfo.", "score": 3, "replies": []}]}, {"body": "Because a bear market first absorbing inflation shocks and interest rates hike have far more to lose to correctly price equities for the dropping liquidity, earnings, and rate hikes than their longer term strength as an inflation hedge.  \n\nIt also takes a lot of years for that inflation fighting effect to accumulate, because a lot of it is a function of companies adjusting to the market.  This is compared to the market repricing a sea change rapidly.  \n\nAlso, one of the reasons in the 70’s stocks earned that title is energy was a huge portion of the market, which skewed inflation performance upward heavilu.  That isn’t the case now.", "score": 0, "replies": []}]}, {"body": "These mother fuckers haven’t the slightest idea what a red days like. Limit down, tripping multiple circuit breakers on the same day. 😂 There will be blood. We’re closer to ATHs.", "score": 6, "replies": [{"body": "After watching my account get destroyed in the dotcom bust (small money back then) I know. I took a long-term view to investing since, until beginning of 2021 when I made money on GME and thought I was able to make money trading... Whatever, back to what I know works, which is long-term investing.", "score": 2, "replies": [{"body": "Good for you on striking GME. Better than most", "score": 1, "replies": []}]}]}, {"body": "Thanks for typing that last paragraph really insightful", "score": 3, "replies": [{"body": "People afraid to invest need to understand that if you have a long-term perspective there is no reason to really be afraid. Stocks long-term will be a hedge against inflation. I believe Buffett has expressed this idea a few times. Obviously, wsb is gambling and short-term focused...", "score": 3, "replies": [{"body": "I'd invest but I have no money because I lost it all investing", "score": 6, "replies": [{"body": "U belong here", "score": 2, "replies": []}]}]}]}, {"body": "So it can fall twice as much still. Got it 👍", "score": 3, "replies": []}, {"body": "insightful perspective on inflation", "score": 2, "replies": []}, {"body": "In the last 22 years, the stock market has only had 2 declines larger than this one.\n\nThis is the worst start to a year in history for the NASDAQ.  \n\nIt’s all how you frame it.", "score": 2, "replies": []}, {"body": "Prices go up = profits go up. Time to buy the blip!", "score": 3, "replies": []}, {"body": " U dump fuck back then not everyone is broke and in debt for3 genrations ahead and there is no roomforthe usponzi to expand like back in the 90s this is the end print into hyperinflation or default", "score": 3, "replies": [{"body": "Dump fuck can’t even put together a cohesive paragraph", "score": 2, "replies": [{"body": "Fuck you understand what I am saying dumbass", "score": 1, "replies": []}]}, {"body": "Go look at national debt at end of WW2 and inflation then.\n\nWho is to say this will not mimic that. Assumptions of gloom and doom are not given. As to everyone being broke, that is nonsense and perhaps economically meaningless. The economy is in many ways expressed as Real GDP which as long as that goes up per capita means that people are apparently wealthier. The balance in the bank account is a number on a balance sheet.\n\nAs to economic growth, I think you are seriously underestimating the ability of continued innovation and better technology to improve efficiency and hence economic growth.", "score": 2, "replies": [{"body": "Tell me what the losses are in spx and the bond market combined in terms of market cap destruction. Wealthy/older people are rarely, if ever 100% equity exposed. The only thing holding up the economy right now is that most of these loses have been countered by record high home values. Clearly though, that’s about to correct. I bought my house three years ago. If I were to buy it today, my payment would be more than twice as much all-in. That is unsustainable.", "score": 3, "replies": [{"body": "Investing works as a long-term endeavor. Short-term volatility makes it very difficult. This is nothing new.\n\nSPX, 5 years ago was at 2,433 and is now at 3,917, so not factoring in dividends, in 5 years you would be up about 61%. Over those 5 years inflation might have been 20-30% (not sure where it is up to through date) so  you would have easily outperformed inflation.\n\nIf SPX drops 20% it is down to 3,134 which would be up 29% over the 5 years (not including dividends) which should meet or beat inflation at least (actually is better since dividends have to be added to the returns).\n\nI am not estimating anything with the bond markets as a lot of bond investing can be based on getting an exact return for a given period. Inflation is a concern there as rising inflation reduces the real returns in bonds. Anyone investing in bonds for retirement needs to understand what they are doing and make sure they are structured so that inflation does not wipe them out. If they don't understand this, they should not be investing in bonds.", "score": 0, "replies": [{"body": ">Investing works as a long-term endeavor. Short-term volatility makes it very difficult. This is nothing new.\n\nWe do not know if it will be short-term volatility. The market is on its own, the Fed will not be stepping in to slash interest rates. I point you to the multiple \"lost decades\" where returns have been negative nominally or inflation-adjusted even adjusting for dividends for years at a time.\n\nThis market has been fueled by cheap debt for many years now and it is uncertain how it will perform without it.\n\n&#x200B;\n\n>I am not estimating anything with the bond markets as a lot of bond investing can be based on getting an exact return for a given period. Inflation is a concern there as rising inflation reduces the real returns in bonds. Anyone investing in bonds for retirement needs to understand what they are doing and make sure they are structured so that inflation does not wipe them out. If they don't understand this, they should not be investing in bonds.\n\nI do not see anything here that makes me think YOU are at all qualified to be opining on what is a blip or what isn't.\n\nAbout World War II... go pick up a history book. Yes, we were in debt but also had all of Europe owing us money as well as great wealth and a soon to be exploding population growth. We were net exporters at least partially responsible for rebuilding Europe. We soon invented the transistor after the war and thus began the information age. In the decades after world war II, we were a young and hopeful country. All huge positives for the economy. We are not that now.", "score": 4, "replies": [{"body": "[https://dqydj.com/sp-500-return-calculator/](https://dqydj.com/sp-500-return-calculator/)\n\nI don't know how accurate the above calculation is, but put in Jan of just about any year and end in Dec, 10 years later and adjust for inflation and I don't think you will find a 10 year period where returns are negative. Maybe if you start in Jan 2029 you will get flat results. So not sure about this idea of lost decades. Maybe you are referring to Japan and not the US.\n\nAs to the Fed not stepping in to slash interest rates... I think you are clearly wrong. Historically interest rates might have been greater than the inflation rate, but if you look now you will see the interest rates are lower than inflation. Hmmmm... something to chew on. Perhaps the Fed is a lot more predictable in their approach here. The Fed is limited in how high interest rates can be based on inflation as their (perhaps unstated) objective is to help ensure inflation reduces the national debt, which only works by keeping down the interest rate (now lower than the inflation rate). Meaning while they will raise interest rates to help curb excessive inflation, they will keep that rate as low as they can and will lower it as inflation comes down, making using debt to fund investment attractive again. The only way this will ever reverse is if the national debt declines substantially and can be serviced via tax revenues.\n\nAs to your points about WW2... I am not very familiar with the war debt amounts. US National Debt by 1946 peaked at 269B (from about 40B in 1939) and I doubt amounts owed to the US then by others was a substantial part of that. Most of that debt was the US's own borrowing.\n\nSaying we had great wealth, does not  mean much. How do you even quantify that? In any case, US Household wealth was recently estimated at 150T vs national debt of about 30T. In 1946 I think that number was estimated at 885B vs national debt of 269B. So recently was about 5X the national debt and at end of WW2 was 3.3X the national debt. So seems when you look at the actual data, we are far better off now.\n\nAs to being net exporters... Who cares. The US dollar was not the global reserve currency prior to WW2. Further prior the 1970's the US was on a gold standard which impacted this a lot. Once the 1970's are over and the US is off the gold standard the need for balancing net exports against dollars in circulation and USD held out of the US is very different. As long as global demand for dollars remains high, there is no reason for the US to be a net exporter of goods and services.\n\nAs to innovation and invention. Look at Tesla and EV's coming to change the vehicle and help usher in a new age of green energy. What about developments in AI beginning to translate into meaningful things that will help us?\n\nYou are wrong on stock market returns, wrong about the Fed and interest rates, wrong about wealth and the national debt at the end of WW2 as compared to now, wrong about the meaning of being a net exporter, and I think very wrong about technology and the future.\n\nYour grammar is good.", "score": 0, "replies": [{"body": ">I don't know how accurate the above calculation is, but put in Jan of just about any year and end in Dec, 10 years later and adjust for inflation and I don't think you will find a 10 year period where returns are negative. Maybe if you start in Jan 2029 you will get flat results. So not sure about this idea of lost decades. Maybe you are referring to Japan and not the US.\n\n1968-1979 - negative real returns\n\n2000-2010 - negative real returns\n\n&#x200B;\n\n>As to the Fed not stepping in to slash interest rates... I think you are clearly wrong. Historically interest rates might have been greater than the inflation rate, but if you look now you will see the interest rates are lower than inflation. Hmmmm... something to chew on. Perhaps the Fed is a lot more predictable in their approach here. The Fed is limited in how high interest rates can be based on inflation as their (perhaps unstated) objective is to help ensure inflation reduces the national debt, which only works by keeping down the interest rate (now lower than the inflation rate). Meaning while they will raise interest rates to help curb excessive inflation, they will keep that rate as low as they can and will lower it as inflation comes down, making using debt to fund investment attractive again. The only way this will ever reverse is if the national debt declines substantially and can be serviced via tax revenues.\n\nInterest rates cannot be reduced until inflation comes down. we have a likely negative GDP number next month and thus the 2nd consecutive quarter of contraction needed for us to officially be in recession.\n\n&#x200B;\n\n>As to your points about WW2... I am not very familiar with the war debt amounts. US National Debt by 1946 peaked at 269B (from about 40B in 1939) and I doubt amounts owed to the US then by others was a substantial part of that. Most of that debt was the US's own borrowing.\n\nThe debt from WWII is unimportant given the astronomically large benefits to the US because of the war destroying large swaths Europe, the Nazis, and the Japanese while we were relatively unaffected. The war was a great investment for us. Additionally, with women entering the workforce for the first time, we tapped an additional source of labor that put downward pressure on wages while increasing total productivity. When technology and improved educational attainment is factored in, the increases in per capita productivity increased the value of companies and thus equities.\n\n&#x200B;\n\n>Saying we had great wealth, does not mean much. How do you even quantify that? In any case, US Household wealth was recently estimated at 150T vs national debt of about 30T. In 1946 I think that number was estimated at 885B vs national debt of 269B. So recently was about 5X the national debt and at end of WW2 was 3.3X the national debt. So seems when you look at the actual data, we are far better off now.\n\n$150T as of what date? To increase from 3.3x to 5x in 76 years when small increases in interest rates now threaten our ability to service our debt cannot seriously be considered \"better off\" especially given the economy has been fueled by debt and given all of the technological advancements in the last 75 plus years. The transistor hadn't even been invented yet.\n\n&#x200B;\n\n>As to being net exporters... Who cares. The US dollar was not the global reserve currency prior to WW2. Further prior the 1970's the US was on a gold standard which impacted this a lot. Once the 1970's are over and the US is off the gold standard the need for balancing net exports against dollars in circulation and USD held out of the US is very different. As long as global demand for dollars remains high, there is no reason for the US to be a net exporter of goods and services.\n\nPlease go read an economics book. This knocked your IQ down at least 10 points in my mind. If I had read this first, I wouldn't even have bothered to respond.\n\n&#x200B;\n\n>As to innovation and invention. Look at Tesla and EV's coming to change the vehicle and help usher in a new age of green energy. What about developments in AI beginning to translate into meaningful things that will help us?\n\nWhat's more important, a car that runs on batteries or the invention of the  transistor? Keep in mind, we already had perfectly functional vehicles.\n\n&#x200B;\n\n>You are wrong on stock market returns,\n\nDemonstrated to be factual above using your link.\n\n&#x200B;\n\n>wrong about the Fed and interest rates\n\nNo.\n\n&#x200B;\n\n>wrong about wealth and the national debt at the end of WW2 as compared to now\n\nNo.\n\n&#x200B;\n\n>wrong about the meaning of being a net exporter,\n\nNo.\n\n&#x200B;\n\n>and I think very wrong about technology and the future.\n\nNo and hopefully.\n\n&#x200B;\n\n>Your grammar is good.\n\nYou don't like being treated the way you treat others and you're not worth any extra effort to make my words look pretty.", "score": 2, "replies": [{"body": "Your points are for the most part ridiculous with perhaps the exception of women joining the workforce helping increase real GDP post WW2.\n\nAs to your question about which is more important, a car that runs on batteries or the invention of the transistor... Well for one you left out my mention of AI, which might be a change that is more important than all the rest. Second, you might be ignoring that EV's are just one aspect of moving to green energy. As to quantifying this... Who knows. I can write essays about some of the potential these things enable. Just use your imagination.", "score": 0, "replies": [{"body": "These are fairly basic concepts... \n\nPeople have been talking about AI for about 70 years and that's only because of the transistor. Anyone trying to say that the most important invention of the last 100 years isn't the transistor is wrong. None of this stuff is possible without the transistor.", "score": 0, "replies": [{"body": "What are you going on about?\n\nThat the transistor is a fundamental building block of computers and so on is not something I disagree with.\n\nMy point the first time I mentioned EV's, Green Energy, and AI was that these are examples of things that may enable substantial economic growth.\n\nYou decided that this meant we should get into a pointless debate about whether this or the transistor is more important, with your clever catch that all those things I mention depend on the transistor.\n\nWhatever man. You are just being ridiculous.", "score": 0, "replies": [{"body": "Cars already exist, AI already exists. Many of the \"innovations\" we've seen as a result of cheap money are not actually innovations and will have limited gross benefit on a societal basis as well as economically. Importantly, what they cost is never factored in these delusional predictions or how one is going to get the skilled labor need to reach the adoption targets. All the AI in the world can't change that FinTech companies just want to be banks. AI doesn't help marketers where marketing budgets are getting slashed and privacy is becoming more and more important to people. I could go on.\n\nEveryone wants to talk about green energy but never about the costs. Why are we putting solar panels on roofs and in open areas when we're worried about rising temperatures? The politicians getting paid to push this crap never talk about the heat island effect when obviously they should. Why is the US so fixated on reducing on our carbon footprint when India and China put out 1/3 of the global emissions by themselves? Answer: it's what they think are good politics, but it's not logical. \n\nYou're free to stop responding at any time, but I won't stop punching unless you do.", "score": 1, "replies": [{"body": "Computers apparently existed going back to the antikythera mechanism... Agriculture existed before fertilizer was able to be easily produced...\n\nYour conclusions are non sequitur.\n\nYou talk about the Heat Island effect, which is a local event due to heat being reflected into the air and not absorbed into the ground and which dissipates over distance (it should have a net zero impact on global climate change)... Is Heat Island an issue in non-inhabited areas? Who does it hurt? In urban environments the buildings already cause a Heat Island effect and in-fact Solar Panels may reduce it! Further it reduces the heating of homes from the sun, reducing the need to use A/C so it actually helps with things being too hot. Don't forget the reductions in CO2 emissions as well.\n\nAs to India and China putting out 1/3 of global emissions, considering they make up 35% of world population seems about right. The US on the other hand puts out 14% of global CO2 emissions and only makes up 4% of the world population. Just because they are bigger countries does not mean the US should not do its part to cut its CO2 emissions by as much as possible. If China and India were to increase emissions to match the per capita amounts in the US it would be an incredible increase in global emissions. If that does not scare you, you are not thinking. The US has a long way to go if they are to tell others what to do here.\n\nAnyways, this is my last response here. I really wonder where you get your info from and how much effort you put into thinking things through. The things you say just don't add up and are reflective of some agenda driving your thinking rather than trying to approach problems with an open mind and arriving at conclusions even if they are contrary to whatever political or other belief you subscribe to.", "score": 1, "replies": []}]}]}]}]}, {"body": "![img](emote|t5_2th52|6880)Ignorence is bliss ![img](emote|t5_2th52|6880)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "So the inflation recession into WW3 should be something special.", "score": 2, "replies": [{"body": "War in asia will begin this month taiwan which is going to spread with india japan and rest of the asia defaults like srilanka and currency devaluations so asia is the ventilator for western countries after 1970s now who is going to save the west adia can survive on its own", "score": 0, "replies": []}]}, {"body": "U ignorance is at peak after ww2 america paid its debt by producing stuff to rest of the world and by 1970 it's gone broke and ditched gold in and 1980s hyperinflation is stopped by oil deal with saudis and asia opening and usa ponzi expanding that worked until 2008 and then rest of the world going into massive debt and currency devaluations just to save the system now there is no countries for the us Ponzi scheme to expand everyone is filled in debt for 4 generations there is no need for new things and the population is declining so no more new buyers  to support the debt ponzi", "score": -1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Me too! Was afraid of cpi outcome", "score": 2, "replies": []}]}, {"body": "So, real retard here! Everyone talks about SPY but I cant find it under any exchange.....is it a company?", "score": -1, "replies": [{"body": "It's an etf", "score": 3, "replies": [{"body": "Thanks!", "score": -1, "replies": []}]}]}, {"body": "The market does not “have to” go up.  Nor “should” it.   It is a direct correlation to efficiency and consumerism.  And a whole bunch of other data points.  If world population flattens/declines, or we become less efficient then the market wont go up.", "score": 0, "replies": [{"body": "I would be more concerned with longevity increasing without correlating increases in world population, thereby driving more of GDP to a larger class of nonworking people resulting in a net decrease in GDP. Of course if AI Robots can make up for the lack of working people, GDP can increase still.", "score": 1, "replies": [{"body": "No doubt, its gonna be a fun ride.  Im not doom and gloom.  But its going down down down the rest of this year", "score": -1, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}]}]}, {"body": "20% and then another, and then another, and then another… SPY will just go down from now on.", "score": 0, "replies": [{"body": "I would be very surprised if even in a complete meltdown we see more than a 50% decline in value. I think 20% more is about the limit of where it might go. I would not assume the market goes up much in the coming decade or two (I think when factoring in dividends, returns will be fine and someone investing now will come out ahead).", "score": 2, "replies": [{"body": "There are no limits.", "score": 1, "replies": []}, {"body": "Nikkei went down 85%", "score": 0, "replies": []}]}]}, {"body": "I think it's a correction", "score": 0, "replies": []}, {"body": "definitely going left to right.", "score": 1, "replies": []}, {"body": "So long as the Dow doesn’t hit 5000 points or lower I’m not worried.", "score": 1, "replies": []}, {"body": "Tell that to the guy who lost 750k in SPY vertical puts", "score": 1, "replies": []}, {"body": " Hipshot sez hard 15% drop coming across all trading equity classes. But I am usually wrong..my red trading account proves it. So. Whatever.\n🌞😐☠️", "score": 1, "replies": []}, {"body": "The bottom should had already been hit, hit hard but JP wants a soft landing. They pump a little, dump some more until we're 50 to 75% down. We'll get there sooner or later.", "score": 1, "replies": []}, {"body": "Outside of a week who gives a shit. Stock go up good, stock go down good.", "score": 1, "replies": []}, {"body": "Oh man,thata not the way to do it.\n\nYou should also add:\nIf it drops 0.5% it'll be this\nIf it drops 1% it'll be this\nIf it goes up 0.5% it's this\nIf it goes up 1% it's that\n\nSlap a TA in the title and then everyone will clap in the comments.", "score": 1, "replies": [{"body": "I am afraid to ask but what is a TA in the title?", "score": 1, "replies": [{"body": "Technical Analysis", "score": 2, "replies": [{"body": "Thanks.", "score": 1, "replies": []}]}]}]}]}
{"title": "Inflation to the MOON YOLO! 🚀🌕😢", "selftext": "", "id": "v9bdxf", "created_utc": 1654877898.0, "score": 4934, "upvote_ratio": 0.99, "num_comments": 85, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|73|**First Seen In WSB**|1 year ago\n**Total Comments**|304|**Previous DD**|[x](https://www.fool.com/investing/2021/12/12/these-2-meme-stocks-legitimate-long-term-upside/) [x](https://www.reddit.com/r/wallstreetbets/comments/pdy3u2/part_2_bb_blackberry_the_sleeping_giant_papa_chen/) [x](https://www.reddit.com/r/wallstreetbets/comments/nwsj7y/wkhs_workshop_still_413_short_interest_apes_let/) [x](https://www.reddit.com/r/wallstreetbets/comments/szszsx/clov_the_comeback_kid_positive_earnings_revenue/) [x](https://www.reddit.com/r/wallstreetbets/comments/qhunee/mnmd_mindmed_and_the_psychedelics_shroomboom/) [x](https://www.reddit.com/r/wallstreetbets/comments/qi0iws/the_upcoming_psychedelics_sector_shroomboom/) [x](https://i.redd.it/h2t0kk7si2e81.png) [x](https://www.reddit.com/r/wallstreetbets/comments/ptidr0/bb_blackberry_unleash_the_beast_post_earning/) [x](https://www.reddit.com/r/wallstreetbets/comments/sdbnz1/bb_blackberry_call_options_active_patent_sale/) [x](https://www.reddit.com/r/wallstreetbets/comments/pazmes/bb_blackberry_the_sleeping_giant_potential_2/) [x](https://www.reddit.com/r/wallstreetbets/comments/r1hc4x/hit_me_bb_one_more_time_papa_chen_about_to_close/) [x](https://www.reddit.com/r/wallstreetbets/comments/rafgfj/bb_blackberry_is_ready_to_launch_list_of_upcoming/) [x](https://www.reddit.com/r/wallstreetbets/comments/pslpax/bb_blackberry_earnings_play_potential_2_billion/) [x](https://zolmax.com/investing/perceptive-advisors-llc-invests-10-32-million-in-clover-health-investments-corp-nasdaqclov/6044342.html) [x](https://www.reddit.com/r/wallstreetbets/comments/qx3zmd/tilray_tlry_short_squeeze_analysis_germany/) [x](https://www.reddit.com/r/wallstreetbets/comments/qd14fm/ocgn_who_world_health_organization_covid_vaccine/) [x](https://www.reddit.com/r/wallstreetbets/comments/qjqkza/the_upcoming_psychedelic_sector_opportunity_fda/) [x](https://www.reddit.com/r/wallstreetbets/comments/pjskid/papa_chen_please_take_bb_blackberry_to_the_moon/) [x](https://www.reddit.com/r/wallstreetbets/comments/pjsou7/papa_chen_please_take_bb_blackberry_to_the_moon/) [x](https://www.reddit.com/r/wallstreetbets/comments/mzbarf/tomorrow_mindmed_mnmd_kicks_off_the_psychedelics/) [x](https://www.reddit.com/r/wallstreetbets/comments/ncaasu/mnmd_mindmed_about_to_take_off_monday_lsd_for/) [x](https://www.reddit.com/r/wallstreetbets/comments/mydrl0/mindmed_mnmd_and_the_upcoming_psychedelics/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v9bdxf)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v9bdxf)", "score": 1, "replies": []}, {"body": "Punctuation matters!", "score": 119, "replies": [{"body": "Let's eat, grandpa", "score": 40, "replies": [{"body": "Let's, eat grandpa", "score": 23, "replies": [{"body": "Don’t threaten me with a good time", "score": 13, "replies": []}]}]}, {"body": "I had to help my uncle jack off a horse.\n\nI had to help my uncle jack, off a horse.", "score": 26, "replies": [{"body": "I had to help a horse jack off my uncle.\n\n&#x200B;\n\nThere, all better.![img](emote|t5_2th52|12787)", "score": 23, "replies": [{"body": "jack off my horse uncle, help had I", "score": 8, "replies": []}, {"body": "I had to help my horse jack off my uncle", "score": 1, "replies": [{"body": "Bo Jack?", "score": 1, "replies": []}]}]}, {"body": "Except you don't put a comma before a prepositional phrase. The second is just grammatically incorrect", "score": 2, "replies": [{"body": "it's actually supposed to be about capitalization", "score": 3, "replies": []}]}]}, {"body": "All punctuations matter.", "score": 3, "replies": [{"body": "All. punctuations. are. equal.", "score": 3, "replies": [{"body": "grammar c0mmie", "score": 2, "replies": []}]}]}]}, {"body": "You said no money down! You read that wrong! Free contingency? no, money down!", "score": 49, "replies": [{"body": "So close.  \n  \nWorks on contingency? No, money down!", "score": 19, "replies": [{"body": "Yes!!!", "score": 5, "replies": []}, {"body": "I usually don’t check whether I got a Simpsons quote 100% right because I know y’all got my back.\n\n“Belt of Scotch?”", "score": 5, "replies": [{"body": "BEER?", "score": 2, "replies": [{"body": "C-O-", "score": 3, "replies": [{"body": "B-E-", "score": 3, "replies": [{"body": "I see you’ve played knifey-spoony before…", "score": 3, "replies": []}]}]}, {"body": "Thats the kinda thing you just gotta know", "score": 1, "replies": []}]}]}]}, {"body": "Lionel Hutz\n\nis a GOD", "score": 10, "replies": [{"body": "You mean Miguel Sanchez?", "score": 2, "replies": [{"body": "Milhouse Baby!", "score": 1, "replies": []}]}]}, {"body": "“I should probably get rid of that Bar Association logo.”", "score": 1, "replies": []}]}, {"body": "The market has 19% more to lose before it bottoms out.\n\nSource: trust me.", "score": 28, "replies": [{"body": "Kendrick Lamar is a great rapper\n\nSource: The Source", "score": 7, "replies": [{"body": "Everyone knows that", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4641)", "score": 12, "replies": [{"body": "![img](emote|t5_2th52|4886)", "score": 8, "replies": []}]}, {"body": "Commas ruin lives", "score": 8, "replies": [{"body": "No Tres Commas saves lives!...actually...No, Tres Commas saves lives!", "score": 2, "replies": []}, {"body": "Commies and Comma's", "score": 3, "replies": []}]}, {"body": "No funny, uh, I mean no, funny. 🤣", "score": 16, "replies": []}, {"body": "Have you guys not figured out to buy 0 DTE puts the day before CPI releases?! 🤦‍♂️", "score": 15, "replies": [{"body": "i dont need the money but thanks anyway", "score": 8, "replies": []}]}, {"body": "calling it early, meme of the day 🏆", "score": 7, "replies": []}, {"body": "It’s comical when Mfs say “it peaked” or it’s “priced in”.. lmao if things are changing daily, no way those statements will be true", "score": 6, "replies": []}, {"body": "***I*** didn't say we should kill him.\n\nI ***didn't*** say we should kill him.\n\nI didn't ***say*** we should kill him.\n\nI didn't say ***we*** should kill him.\n\nI didn't say we ***should*** kill him.\n\nI didn't say we should ***kill*** him.\n\nI didn't say we should kill ***him***.", "score": 10, "replies": [{"body": "Yes", "score": 1, "replies": [{"body": "*Yes*", "score": 1, "replies": []}]}]}, {"body": "All us illiterates are like I don't get it.", "score": 4, "replies": []}, {"body": "grandmas and baby seals everywhere agree, punctuation is important.", "score": 4, "replies": []}, {"body": "Can't stop laughing", "score": 4, "replies": []}, {"body": "Y'all motherfuckers need physical gold and silver.", "score": 5, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 4, "replies": []}, {"body": "Should have bought a house.  Only the taxes and insurance can go up.", "score": 6, "replies": [{"body": "They are 500k minimum in my area", "score": 4, "replies": [{"body": "Well they were 400k last year with a 3% interest rate.", "score": 1, "replies": [{"body": "And two years ago that same house was 250k at 4.5%... If I was able to buy one I would've. Also utilities go up as well. Not just tax and insurance.", "score": 3, "replies": [{"body": "Combined they don't go up anywhere near as much as rent.", "score": 2, "replies": [{"body": "I know, just let me cope in peace.", "score": 2, "replies": []}]}]}]}, {"body": "The house or the insurance?", "score": 1, "replies": [{"body": "The house lol. That's the minimum. More like 570-600 for something I'd actually want.", "score": 1, "replies": []}]}]}]}, {"body": "The [Death of Stalin \"No,..... Problem\" twist](https://youtu.be/kasSSZlBFDs).", "score": 3, "replies": []}, {"body": "No, problem!", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|8882)", "score": 2, "replies": []}, {"body": "Man I love this meme.", "score": 2, "replies": []}, {"body": "That cat is pretty smart", "score": 2, "replies": []}, {"body": "How do I invest in inflation? It seems to be going up", "score": 2, "replies": [{"body": "Go long on /10Y.", "score": 3, "replies": []}]}, {"body": "Historically, and in the current environment, stock valuation takes a big hit during periods of excessive inflation.  I understand how rising interest rates (often used to curtail inflation) would impact growth stocks.  What I'm not clear on is why inflation should add such a large downward pressure on valuation across the board.  Shouldn't folk want to own assets in times like these?  Or are there asset classes that have outstanding performance during inflation, so people rotate into them?  Genuine question... my instinct when I hear bad inflation news is to get out of cash asap.  I'll take the cheaper stock valuations while I'm buying, but I don't understand it.", "score": 1, "replies": [{"body": "This is wsb. The only thing we buy and hold is crayons and gme.\n\nSeriously though, I think everybody should be very careful applying any knowledge to the situation and consider it safe investments. This crisis has a lot of different factors that we haven't seen before. And there are a lot of issues left unsolved from previous crises that have been can-kicked.\n\nI'm trying to pick up value stocks and \"funny internet money of which we don't speak here\" that seems extremely cheap. It all keeps dipping but I still feel confident it's going to be amazing in 5-10 years", "score": 1, "replies": []}]}, {"body": "Biden moment 😆", "score": 0, "replies": []}, {"body": "Read my lips. Know new taxes.", "score": 0, "replies": []}, {"body": "No, money down!", "score": 0, "replies": []}, {"body": "Mods, do your job.", "score": 0, "replies": []}, {"body": "A global pandemic sore the last two years, and most of the economic solution to it was printing money. And you still have a 1 digit annual inflation.\n\nStop fukin crying so much about this.", "score": 0, "replies": []}, {"body": "LOL", "score": 0, "replies": []}, {"body": "A proper use, of commas, makes a big, difference", "score": 0, "replies": []}, {"body": "Inflation got it by inflation....", "score": 0, "replies": []}, {"body": "god thats retarded", "score": -5, "replies": []}, {"body": "Oxford comma,,,", "score": 1, "replies": []}, {"body": "Buy Puts kitty bitch", "score": 1, "replies": []}, {"body": "Free consultation? NO. Money down!", "score": 1, "replies": []}, {"body": "How do I but inflation tho?", "score": 1, "replies": []}, {"body": "INFLATE DEEZ NUTZ!", "score": 1, "replies": []}, {"body": "calls on inflation", "score": 1, "replies": []}]}
{"title": "MarketWatch on inflation", "selftext": "", "id": "v9c51w", "created_utc": 1654879988.0, "score": 1179, "upvote_ratio": 0.94, "num_comments": 86, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|13|**First Seen In WSB**|1 year ago\n**Total Comments**|438|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v9c51w)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v9c51w)", "score": 1, "replies": []}, {"body": "What the fuck does that even mean? No way anyone with even an elementary level education wrote that.\n\nEdit: just noticing that the futures market is CUM and MILF on the top lol", "score": 329, "replies": [{"body": "You missed ASS, huh?", "score": 114, "replies": [{"body": "No way ASS is down more than cum - do you have any idea the logistics cost gap between the two??? NOT A FUCKING CHANCE", "score": 31, "replies": [{"body": "Yesterday FACE was down and ASS was up", "score": 24, "replies": [{"body": "That…… is the way I like to FUK", "score": 9, "replies": []}]}, {"body": "MILF was holding strong for so long!", "score": 5, "replies": [{"body": "MILF is not a long term investment, just a trade", "score": 5, "replies": []}]}]}, {"body": "I miss ASS, ever since inflation hit 20% I cant afford it any more.", "score": 24, "replies": []}, {"body": "[LYN AS is a great stock!](https://www.bing.com/search?q=lynas+corporation&cvid=4303759dde904fda87373fd0ed72f3c2&aqs=edge.0.0j69i57j0l7.1711j0j1&pglt=41&FORM=ANNAB1&PC=U531)", "score": 9, "replies": []}, {"body": "He get no ass", "score": 1, "replies": []}]}, {"body": "Stop hating the teachers!", "score": 23, "replies": [{"body": "Wished I coulda got more love from my 6th grade math teacher", "score": 14, "replies": [{"body": "He wishes he would have loved you more too.", "score": 15, "replies": [{"body": "Yes I do.", "score": 2, "replies": []}]}]}]}, {"body": "Holy hell. I didn’t even see that. Fuckin hilarious", "score": 9, "replies": []}, {"body": "And ASS is the killer 👍", "score": 3, "replies": [{"body": "Usually when $ASS is up $CUM is down…", "score": 3, "replies": []}]}, {"body": "You are probably holding CUM and MILF.", "score": 1, "replies": []}, {"body": "Coffee and blowjobs", "score": 1, "replies": []}]}, {"body": "I stole these teachers pensions by buying a stock that I like.", "score": 99, "replies": [{"body": "[The more bankrupt the pension funds get the more the puts print!](https://youtu.be/nSbKqGtv--k?t=435)", "score": 9, "replies": []}]}, {"body": "Looking forward them accepting coffee for fines at the big casino 🎰", "score": 26, "replies": []}, {"body": "Ah I see the old MILF etf is down should we go long on  STPSIS", "score": 26, "replies": [{"body": "Puts on stpsis as they like to go down", "score": 7, "replies": [{"body": "Calls on $STUCK", "score": 6, "replies": []}]}]}, {"body": "Wait I hate teachers??", "score": 12, "replies": []}, {"body": "Love those tickers!!!!", "score": 5, "replies": []}, {"body": "Learn to code, teachers!", "score": 7, "replies": []}, {"body": "Thought it was real until I saw the tickers", "score": 8, "replies": []}, {"body": "At one point t in Russias history, teachers were paid in vodka\n\nhttps://www.google.com/amp/s/inshorts.com/m/en/amp_news/teachers-were-once-paid-in-vodka-in-russia-1491918475051", "score": 10, "replies": [{"body": "That is greatest little blurb ive read all day, especially aeeing they had been offered food and were like, \"fuck that, liqour or no deal.\"", "score": 9, "replies": []}]}, {"body": "How tf are those 2 things even remotely related? Lmao. Clown show", "score": 24, "replies": [{"body": "[deleted]", "score": 40, "replies": [{"body": "Or the sub-header at the bottom. Or the absurdity of the big bold statement lol", "score": 28, "replies": [{"body": "Well the one on the bottom is believable, the SEC I’d that stupid", "score": 7, "replies": []}]}, {"body": "I instantly noticed that it's fake, but I still don't get the joke.\n\nWhat do teachers have to do with any of this.", "score": 2, "replies": [{"body": "Look up clips of Ken Griffin mentioning the downfall of Melvin Capital and and blaming redditors buying a stock took down teachers pensions instead of, you know, the managing entity for those funds being overleveraged and improperly doing risk assessments.", "score": 12, "replies": []}, {"body": "Some clown ruined teachers' pensions when he placed a wrong bet, and blamed it on WSB.", "score": 7, "replies": []}]}]}, {"body": "We destroyed their 401k!!!!!", "score": 1, "replies": []}]}, {"body": "My portfolio when that ASS dips", "score": 3, "replies": []}, {"body": "Stop buying Memes, my mum needs pension!", "score": 3, "replies": []}, {"body": "This isn’t true if I really hated teachers I would run for congress and not give them a raise and do little to nothing about making sure schools were safe.", "score": 3, "replies": []}, {"body": "Market Watch as legitimate as a Phone call to extend your car warranty.", "score": 3, "replies": [{"body": "JohnnyKayak, I have been trying to reach you about your car's extended warranty", "score": 2, "replies": []}]}, {"body": "I almost thought this was a serious article at first", "score": 2, "replies": []}, {"body": "I wonder which financial terrorists syndicate group paid for this hit piece🤔. It mayo drip all over it... Cordele is that you?", "score": 2, "replies": []}, {"body": "Brilliant", "score": 2, "replies": []}, {"body": "Am I the only person who hates the expression \"doubling down\" on something", "score": 2, "replies": [{"body": "Yes", "score": 3, "replies": [{"body": "Ok. Lol", "score": 1, "replies": []}]}]}, {"body": "THEYRE FINALLY RECOGNISING OUR EFFORTS", "score": 2, "replies": []}, {"body": "This right here is gold.\n\n Close enough to the truth to be believable", "score": 2, "replies": []}, {"body": "This right here is gold.\n\n Close enough to the truth to be believable", "score": 2, "replies": []}, {"body": "Even after you understand it's a joke it makes even less sense.", "score": 2, "replies": []}, {"body": "This is an Onion article right?", "score": 2, "replies": []}, {"body": "“And then they blamed the teachers and immigrants and poor people” -Big Short", "score": 2, "replies": []}, {"body": "Sorry everyone, I personally collapsed the world's economy with my meme stonks I bought from working behind the Wendy's dumpster", "score": 2, "replies": []}, {"body": "I like video games and I like stocks so I bought a stock that sells video games. Sorry teachers 🤷🏼‍♂️", "score": 3, "replies": [{"body": "You bought MSFT?", "score": 1, "replies": []}]}, {"body": "Written by a proud BOT!", "score": 1, "replies": []}, {"body": "I bet Marketwatch fired all their writers and decided to use an “AI” to create stories. Why not… lol", "score": 1, "replies": []}, {"body": "Are you fucking kidding me??", "score": 1, "replies": []}, {"body": "Fun fact. I work at a university and my retirement is through TIAA CREF. It’s a teacher’s retirement plan with different options. Just yesterday I did a proxy vote for my TIAA retirement and wouldn’t you know…..they use computershare. Big fücking smile", "score": 1, "replies": []}, {"body": "Lmao please tell me that title is real. No fucking way. If it is my God Kenny boy using his power for sooooo much manipulation", "score": 0, "replies": [{"body": "Smartest wsb user ☝️", "score": 4, "replies": []}]}, {"body": "This looks photoshopped, is there a link?", "score": -1, "replies": []}, {"body": "Hey do you have the link I can't find it?", "score": -3, "replies": []}, {"body": "Is this for real???wtf", "score": 1, "replies": []}, {"body": "This is a joke headline? No seriously, this is a joke headline right?", "score": 1, "replies": [{"body": "Context clues strongly suggest \"yes\".", "score": 7, "replies": []}]}, {"body": "No they accept free porn as a fine payment", "score": 1, "replies": []}, {"body": "Believable headline", "score": 1, "replies": []}, {"body": "Good, I'm shorting MLF and CUM", "score": 1, "replies": []}, {"body": "Oh man . So evil", "score": 1, "replies": []}, {"body": "I’m not actually sure - does this mean things are 8.6% more expensive than last June? Or that shit hit the fan within months?", "score": 1, "replies": []}, {"body": "Every 1 r fuk", "score": 1, "replies": []}, {"body": "The amount of people thinking this is real is too damn high", "score": 1, "replies": []}, {"body": "“What do they do during a recession…blame the middle class and even the teachers -Jared venner, the big short", "score": 1, "replies": []}, {"body": "$MILF to the moon boys", "score": 1, "replies": []}, {"body": "Yeah fuck those teachers they are the ones naked short selling stocks daily... wait? Teachers aren't capable of naked short selling... hmmmmmmmm??? Well market watch should point the fucking finger correctly next time.", "score": 1, "replies": []}, {"body": "I knew this had to be a joke when I saw MILF futures were negative.  That only goes up IRL.", "score": 1, "replies": []}, {"body": "Good Gawd! I saw the byline \"SEC Starts program to accept coffee instead of money when issuing fines\" and I just lost it!!!\n\nFor reference, I caught an interview between John Stewart and Gary Gensler and the SEC was accepting coffee donations because it wasn't in their budget to buy K-Cups for employees.\n\nOh, and the ticker was hella funny too.", "score": 1, "replies": []}, {"body": "Milf cum ass", "score": 1, "replies": []}, {"body": "FUCK MARKET WATCH", "score": 1, "replies": []}]}
