{"title": "Why the fed wants to keep the market where its at", "selftext": "I just had a realization about the stock market and how the fed chairmen might be thinking about where prices are. If you [look at a chart of the S&P](https://imgur.com/a/hXZTTUZ), you see that we've been oscillating around this trendline since the 2009 lows. When you adjust this pace upwards for inflation, it can in a way represent society getting more wealthy over time. Thanks to human ingenuity the average person is much more well-off than someone 100 years ago. It could be argued that the 11 years before the pandemic were fairly sustainable, people were consuming but also working/being productive and contributing their fair share to the pie. The pandemic created a massive crash, but thanks to fed stimulus, an unsustainable trajectory for the S&P 500, the stock market and society as a whole. Now the fed has removed this stimulus and the S&P 500 has dumped back to this long-term trendline starting in 2009.\n\nThe way I see it, the S&P 500 following the upward trajectory of this trendline would be a \"soft landing\". Things go back to the way they were pre-pandemic, on average people are decently well-off, increasing modestly each year. So it's no surprise the fed \"floated a trial balloon\" on potential rate hike pauses. But the S&P aggressively rising off of this trendline would be a sign to the fed that our society still exists in an unsustainable condition, so inflation won't come down. Kind of an abstract and theoretical way to think about the price of the S&P 500. But as a general barometer of the stock market which itself is a gauge of societal wealth, it makes sense. So what I would like to see is for us to maintain a modest trend upwards along this trendline over the next months and years, which would be a good sign that society has returned to a period of sustainable growth.", "id": "v5748t", "created_utc": 1654408769.0, "score": 13, "upvote_ratio": 0.58, "num_comments": 82, "comments": [{"body": "Way to many words just to draw an arbitrary line that you just want to believe in. It makes no sense that the “low of 2009” should be the base of “society’s trajectory” lolz. Trend lines are meaningless TA.", "score": 29, "replies": [{"body": "sounds like someone hasn't had their himalayan pink salt", "score": 3, "replies": []}, {"body": "Tangential, point, but... I don't think trend lines are meaningless. You can see tickers that follow a very obvious slope; that price action happened and could continue to happen. *Why* it's happening is where  (I think) the TA folks tend to jump the shark and lose me. In other words, charts can show effect, but they can't show cause.", "score": 1, "replies": []}, {"body": "I don't need to believe in it, it's been going up at this pace for 13 years. So if you don't believe it will continue the burden is more on you to be able to articulate why it won't than it is for me to argue for the status quo. That's why the fed wants to maintain this trajectory, because they're going for a soft landing and they told us this outright. If the S&P 500 dumps below this trendline and never touches it again, without question we got a recession and no soft landing. Mark my words. If it maintains above it or bumps against it consistently as resistance then we got a soft landing.", "score": -7, "replies": []}]}, {"body": "A lot of words with a lot of sketchy assumptions to say, \"line looked like this before, fed try to make line like this again\".\n\nAlso this \"But as a general barometer of the stock market which itself is a gauge of societal wealth\".\n\nThe whole things reminds me of the Billy Madison speech.", "score": 12, "replies": [{"body": "I award you no points and may God have mercy on your soul.", "score": 4, "replies": []}]}, {"body": "Fed doesn't care about the market, they care about the economy.", "score": 58, "replies": [{"body": "They stopped caring about the market when they were forced to sell for ethics reasons, been all downhill since then", "score": 20, "replies": [{"body": "Very interesting timing on that wasn’t it? All of a sudden it’s a conflict of interest for them to hold stocks? Right at the market top, just before QT… it’s always been a conflict of interest for them to own stocks when they control the narrative. Timing was no accident.", "score": 19, "replies": []}, {"body": "[They stopped caring about the market in 1977, when Congress wrote into law that the Fed was only supposed to care about maximum sustainable employment, moderate long-term interest rates, and stable prices.](https://www.federalreservehistory.org/essays/fed-reform-act-of-1977)", "score": 3, "replies": []}, {"body": "\"Forced\"", "score": 1, "replies": []}]}, {"body": "True to an extent, but the wealth effect has become a big part of how they influence the economy. Now since inflation is not mostly contained to financial assets any more they are being forced to act to protect the economy long term through pain in the short term (to both stocks and the economy).", "score": 3, "replies": []}, {"body": "That’s giving them too much credit. They have three goals; maximum employment, stable prices and moderate long-term interest rates\n\n(Source FED)", "score": 5, "replies": []}, {"body": "They actually don't care about either lol. They create the boom and bust cycle to enrich the banks and politicians.", "score": 5, "replies": [{"body": "Exactly, the FED is bankers and future politicians. Look at Janet Yellen.", "score": 6, "replies": [{"body": "And her moron accomplice Mary Day.", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": -3, "replies": [{"body": "You’re getting voted, but most Americans own stock so the stock market is part of the economy for most people.", "score": 0, "replies": []}]}]}, {"body": "this is basically TA disguised as a non-TA view of the market", "score": 12, "replies": []}, {"body": "I don’t really understand your write up.", "score": 21, "replies": [{"body": "Just a lot of words saying we're near mean reversion.", "score": 26, "replies": [{"body": "That makes sense. Concise language is key.", "score": 5, "replies": []}]}, {"body": "This is Reddit lol some people just want attention", "score": 1, "replies": []}]}, {"body": "I really don’t buy that. They would be fired if they stopped adjusting the economy when it’s needed just because they wanted the stock market at a certain level.", "score": 11, "replies": [{"body": "The question is whether it's needed, or if they need to over-correct and tighten the economy too much to bring inflation down so that it can then return to a stable state.", "score": -1, "replies": [{"body": "I don’t get what you mean, we have increasing inflation so yes they need to adjust it. When you see inflation going the opposite direction they can slow down. The market will react however it will. You should learn about stock market technicals and you will understand why the market behaves like it does.", "score": 3, "replies": [{"body": "Maybe I wasn't clear enough, if the S&P 500 loses this trendline and stops at least using it as a ceiling like 2011-2020, then it probably means the economy is tightening more than necessary. But I guess that's only if you believe that the economy will grow as it did before the pandemic, and I'm sure that is what the fed is shooting for. Whether they're actually looking at the stock market closely and pivoting based on it, we'll never know for sure. There are plenty of theories and schools of thought for why the market behaves the way it does, I'm fairly well researched on the subject.", "score": -1, "replies": []}]}]}]}, {"body": "Why did you pick 2009 low? And I think your trend line will always (visually) validate the result if you tie it to the last data point.\n\nFor example, if you tied it to the pandemic low, we have more to go.", "score": 11, "replies": [{"body": "Unless you’re of the belief that the pandemic should’ve been the start of a secular bear market, it’s fair to overlook it and look at the past decade+ instead, because if COVID was not a thing, I don’t think the flash crash in 2020 is a thing. You likely just get another 2016/2018 in that there’s a struggle at times, but no actual officially official bear market on a closing basis.\n\nThe past decade+ trend does not get you to 4800 but it would have probably gotten you to 4k and many things would be different in this alternate world.\n\nNow since that alternate world doesn’t exist, it is fair to ask if whether we should be at trend and if whether we should be in the beginnings of a secular bear in the US. For now, my answer would be no on the latter. It’s normal for the S&P to see the 200 WMA. \nThat’s around 3400-3500. Unless you see a spike below that and don’t recover, my presumption would be that this is a cyclical bear in a secular bull (which actually starts in 2013 as that’s when it breaks from the old highs of the early 00s and 2007 from good).\n\nIt'd be fair to question if whether we should be at trend though because inflation is crippling many.", "score": 4, "replies": []}, {"body": "This trendline has the largest number of significant interactions/market pivots against it since the financial crisis. That is clear to see by looking at it. Price has been in a tango with it since the first correction in 2010. And believe me I'm not a TA guy, most of the time trendlines are garbage, and an arbitrary distraction. But the significance of this trendline is clear to see, I'm under the impression it's why we've bounced here. If we revisit it, there WILL be powerful action off of it.", "score": 0, "replies": []}]}, {"body": "So, reversion to the mean. Thx.", "score": 4, "replies": [{"body": "That line he drew is not mean though...", "score": 9, "replies": []}]}, {"body": ">on average people are decently well-off, increasing modestly each year\n\nAdjusted for inflation, I am making less than last year (as do all my colleagues).", "score": 3, "replies": [{"body": "Your anecdote isn't worth much. But, obviously the stock market was higher last year than it is now wasn't it? So your anecdote fits into my thesis perfectly. My whole point is that the environment our economy has been in since March 2020 is unsustainable, that's why inflation is going up. If everything kept on the way it was in 2021, people on average would take more than they're giving to society and it would gradually deteriorate. And as far as the S&P I'm not saying there's a direct correlation, but on average people are more well-off now than they were in times that the S&P is lower than it is now. With any luck, the S&P will continue modestly bouncing around on this trendline, and by extension you'll be making a little bit more than you are now, adjusted for inflation.", "score": 1, "replies": []}]}, {"body": "I don’t think you are totally wrong. I think the market today is pretty tied to the stock market. Pensions, retirements, savings are all largely in stocks. So if the Fed hurts stocks that has a massive impact on how rich people feel and how much they spend.", "score": 2, "replies": []}, {"body": "> Thanks to human ingenuity the average person is much more well-off than someone 100 years ago.\n\nAre they, though? Sure you have iPhones, but do you have unbroken families? Sure, it’s impossible to go hungry, as long as you don’t mind getting cancer later. Sure, there have been medical advancements, so many advancements that half the population is on meds. Sure, there are a lot of zeroes in your annual salary, but can you raise a family of five with it?", "score": 2, "replies": [{"body": "I’m with you, the population is getting sicker. Solid relationships are harder to find. That’s not really relevant to what I’m talking about. But yes it would be easier supporting a family of 5 than 100 years ago.", "score": 1, "replies": [{"body": "It’s relevant because you frame the S&P (and presumably the market as a whole) in this narrative of advancing civilization and unlimited economic growth. I take issue with the ideas. Neither is real. For my entire lifetime we’ve done nothing but monetize debt and squandered real wealth. I think people are poorer than they have ever been, and the market is only beginning to catch up.", "score": 1, "replies": []}]}]}, {"body": "You may be giving the Fed way too much credit.", "score": 4, "replies": [{"body": "Not really, their job is quite literally to manipulate the dial of economic prosperity to keep us on an even keel over time. Whether they can navigate a soft landing remains to be seen, but society does most of the work on its own.", "score": 0, "replies": []}]}, {"body": "I like how you imagine the nation as being basically well off and stable, not declining, at the bottom. Rosey.", "score": 2, "replies": [{"body": "Well, less % of people are in poverty than pretty much every year decade going back many centuries. It's not rosey, we get into dicey periods of time but overall I'm not a nihilist and if you look at the history of this country that's not a stretch.", "score": 2, "replies": [{"body": "You may be looking at older data than this:\n\nhttps://www.povertycenter.columbia.edu/news-internal/monthly-poverty-january-2022\n\nThe end of pandemic-era relief programs has spiked poverty hard.", "score": 0, "replies": [{"body": "Comparing to 2021 numbers is ridiculous. Let's see pre-pandemic comparisons.", "score": 0, "replies": [{"body": "Get some new goalposts. Those are too heavy for you.", "score": 1, "replies": []}]}]}]}]}, {"body": "Source: Trust me bro", "score": 1, "replies": [{"body": "Watch for the way the fed's language is regarding rate hikes based on where we are in relation to this trendline. You can look in the past too. Notice the fed pivoted dovish at the bottom of the pandemic, then we shot up above this trendline more or less the same amount and the fed said we need to start rate hikes and QT. Now they're being kind of precarious. \"Maybe we can pause in September\" *Market rallies a bit* \"Pausing? Eh, dunno about that\". They're playing a game. The chart is a chart of human psychology, how good people think the economy is and how much they can be a hedonist vs. a scrooge.", "score": 1, "replies": [{"body": "Then why are other fed members speaking up saying they don’t agree with a pause hike in September?", "score": 1, "replies": [{"body": "I'm not saying this is the whole entire reason by any means, but as you can see we've rallied off from our break below the trendline. Probably more than some of the members think is healthy. Some are dovish and some hawkish, I'm sure Bullard would like to see us lose this trendline entirely. Somewhere in the middle would be for us to maintain it, and tangle with it for years to come.", "score": 1, "replies": []}]}]}]}, {"body": "Technical analysis makes as much sense as reading tea leaves.", "score": -1, "replies": [{"body": "Technical analysis is no different than reading tea leaves but the problem is a lot of institutional investors use technical analysis as well.\n\nIt’s a self-fulfilling prophecy.", "score": 0, "replies": [{"body": "Do they? What sort of institutional investors?\n\nI thought the analysis they carry out is more data driven modelling and arbitrage focused (relative pricing), not analysing a chart. You don’t need any quant knowledge to do this sort of analysis but that doesn’t work the other way around.", "score": 0, "replies": [{"body": "Look up how popular VWAP is used as an entry or exit point by institutional investors.\n\nEdit: Pension & mutual funds use TA. Another popular TA indicator used by institutional investors is TWAP.", "score": 1, "replies": []}]}]}]}, {"body": "So what you are saying is, we‘re nearly back to where we „should be“ from pre-covid to know considering the avg growth since 2009?", "score": 0, "replies": []}, {"body": "Let me all-caps this so you get it clearly:\n\n#THE FED DOES NOT GIVE A DAMN ABOUT THE STOCK MARKET\n\n[\"The Federal Open Market Committee (FOMC) is firmly committed to fulfilling its statutory mandate from the Congress of promoting maximum employment, stable prices, and moderate long-term interest rates.\" (PDF)](https://www.federalreserve.gov/monetarypolicy/files/FOMC_LongerRunGoals.pdf)", "score": 0, "replies": [{"body": "Not overtly, no. But you'd have to be thick not to understand what I'm really getting at here. The trend up could be considered representative of sustainable progress in our economy. The fed wants us to maintain this rate of sustainable progress, so their goal is to *indirectly* keep the S&P 500 moving along this trend.", "score": -1, "replies": [{"body": "I understand what you're getting at, I just think the premise of it is so wrong as to invalidate the rest of it, and it perpetuates the presumption of a false cause for the actions of a regulated body.\n\nThey have no direct or indirect goal regarding the stock market. They don't care if their actions make it go up or down. You may assume that their actions to coax rates, employment, and inflation into a nominal range may cause certain side effects like a steady uptrend in equity prices, but that's nothing to do with their wishes.\n\nNor is it likely to be what happens. The S&P will whipsaw each time the Fed changes the direction it's turning one of its knobs to affect the things it cares about, and it will likely have to flip the script multiple times before all three of them are moving sideways.\n\nIt's okay to extrapolate from their actions to the effects they have on anything else, but it's a huge mistake to think they intend to have all of the effects they end up having.", "score": 2, "replies": [{"body": "Sounds like we're on the same page. To say they don't care though, eh that's a strong statement. Imagine being in their position, and seeing the markets absolutely shit the bed because of your choices in being the economy's puppet master. That's bad for millions of people, it stokes fear in the heart of the public and destroys savings and retirement funds. They care deeply about economic conditions, and the stock market is a pretty significant thing in our economy.", "score": 1, "replies": [{"body": "They don't care. They care if employment drops or rates or prices spike.\n\nThey don't care about your retirement fund, they care about the inflation rate that affects it the most. They don't care about your meme stocks, they care that companies can borrow to stay solvent and keep people on the payroll. And they don't care about your yolo into funny-money exchanges, like, at all.\n\nTheir job isn't to prevent individual bankruptcies. It's to stabilize the playing field so that employers and workers and bank account holders see minimal economic uncertainty.\n\nIt's up to business owners and the investing public to turn that into stock prices.", "score": 1, "replies": []}]}]}]}]}, {"body": "\"soft landing\" refers to the economy, namely GDP and unemployment. NOT the equities market. You're so far off base it's genuinely amusing.", "score": 0, "replies": [{"body": "And the fact that you think the two are completely uncorrelated is amusing. Maybe you haven’t been in the markets for long.", "score": 1, "replies": [{"body": "When did I suggest that the two were uncorrelated? Of course they are correlated. I'm here to tell you the same thing that someone else in this thread already has: you're focusing on a side effect as though it's their goal.", "score": 1, "replies": [{"body": "I'm focusing on the side effect that I can trade off of, obviously. Never said anything about it being their goal, but that it's a good indication if not for them, for me, that they're doing their job well.", "score": 1, "replies": []}]}]}]}, {"body": "You're confusing so many concepts that I think you need to take a step back and reevaluate.  First, the Fed doesn't have a mandate for the stock market.  They care about jobs and pricing, and they don't care about anything else outside of its ability to affect jobs and pricing.\n\n\"Soft landing\" refers to the real economy (jobs), not the stock market.", "score": 0, "replies": [{"body": "The correlation between the stock market and the things you mentioned are blatantly obvious,  it sure what else to tell ya.", "score": 1, "replies": [{"body": "In some cases, yes.  But not always.  2000 features massive market pain but relatively little real economy pain.  And whether there is a correlation or not isn't really the point.  The question is whether the Fed is using markets as a decision-making data point.  They aren't.", "score": 1, "replies": []}]}]}, {"body": "So to put it simply…..  \n“Stonks goes up, so Ape with diamond hands must HODL”. 🦍", "score": -4, "replies": [{"body": "To put in a moronic and strawman way with no rebuttal...*", "score": 0, "replies": []}]}, {"body": "I appreciate this", "score": -3, "replies": []}, {"body": "You should follow the (CMA) century moving average. It has never turned down in all of history.", "score": 1, "replies": []}, {"body": "In other words, the bull market since 2009 will never end? Dude please…", "score": 1, "replies": [{"body": "Who said never? I said months and years. People are closedminded though, if technology and innovation continue at the rate they have been we'll be in something close to a utopia in 100 years. That's not wishful thinking it's just literally looking at the rate of accelerated progress in society for the past centuries.", "score": 1, "replies": []}]}, {"body": " \"Things go back to the way they were pre-pandemic\"\n\nInflation was rising and we were heading into a recession right before the pandemic hit the US.", "score": 1, "replies": []}, {"body": "I agree the fed wants to hold longer until it's next rate hikes.. it's therefore a bull market. Biden met up with Jpow because of this. My theory.  Crashing the economy now would make it look really bad for Bidens potential second term. We just got out of a (recession) COVID economy. If he crashes now, we would have crazy supply side inflation vs demand side.", "score": 1, "replies": []}, {"body": "If it’s clear to see and you trust it, react and post your trades. Trend lines always look correct in retrospect. If you take a trade and be plummet and keep plummeting will you hold knowing to your logic we should come back up and bounce off the trend line? Or will you sell because all the sudden the story to the right of the chart is blank and not filled in yet?", "score": 1, "replies": [{"body": "I’ve been longing since we opened slightly above it on May 26, and proceeded to rocket off from it. I’m taking profits as we go, but overall I’m optimistic unless we enter into a significant energy crisis. But there is a good risk/reward when we’re close to this line, and if we break below turning it back into resistance then there would be very good risk/reward short trades off of it. I’m bullish on the economy and markets but considering this is a strong pivot, there could be good trades in either direction. Right now I want to get in the mindset of the fed chairs, and obviously I’ll take profits when I feel the markets are making them nervous. And load up when the market dumps and they feel nervous.", "score": 1, "replies": []}]}, {"body": "I rate the effort and thought you put into this, but I think it's waffle. The FED has a double mandate, and it has nothing to do with keeping the f'ing stock market within a trendline that was laid through a chart of historic performance.\n\nAlso, guess what? If we had 10 years of downtrending now, the trendline would run differently.", "score": 1, "replies": [{"body": "True, their goal is price stability and maximum employment and they've been forthright they will do what it takes to bring inflation down. But then the more fundamental question arises of what is a sustainable growth rate for our economy in an environment of stable prices and maximum employment. They're essentially trying to bring the economy into homeostasis. My thesis is that this trendline is congruent with that homeostatic environment, so long as the energy market can reach some kind of homeostasis as well. It very well could spiral out of control, who knows. \n\nAlso, I don't think the fed is necessarily fixated on this trend for the stock market either. But it could be considered representative of the current economic conditions/outlook. So if we drop significantly below this trendline, even if the fed isn't looking at it directly, their other indicators should start flashing red. For example, if the S&P starts speeding down toward $3,000, you can be pretty sure that employment numbers are going to start looking really bad and the economy will be in trouble.", "score": 1, "replies": []}]}, {"body": "All I know is keep buying on every weakness, take debt when ever interest is low and you can service it , fed does give a damn about the markets think 2009", "score": 1, "replies": []}]}
