{"title": "Should PYPL acquire SOFI?", "selftext": "PayPal stock is crushed and they’ve been posting declining EPS for a few quarters now due to eBay and free money government shit show ending. The payments fintech sector is an absolute cess pool of competition and must consolidate at some point. with apple getting involved now it’s only going to mean more pressure on PayPal. They saw the writing on the wall when they tried to make a move for PINS which was idiotic and that’s putting it nicely. \n\nHowever, acquiring SOFI would be huge for them imo. SOFI, as a stock, is having issues due to being held down because of how it came public and political BS from Biden admin, among other things that have nothing to do fundamentally with how the company is performing. They are crushing it as a company though, delivering huge growth numbers and consistent earnings beats with guidance raises. They Have banking capabilities now which is even more valuable in this rate environment. Having deposits is huge. And as recently stated their deposits are growing exponentially. \n\nThis seems like a Match made in heaven to me. PYPL keeps its FCF producing business, but returns to growth with SOFI and its added banking ability. Provides them more of a moat against apple and the other big dogs. I would see this as the equivalent of google acquiring YouTube. Paypal and SOFI would be an absolute monster\n\nAnyone else think this would be a good move for both companies?", "id": "vf5u8g", "created_utc": 1655557486.0, "score": 3, "upvote_ratio": 0.53, "num_comments": 79, "comments": [{"body": "They should all merge and consolidate. That's what this oncoming recession is about, trimming the fat from a lot of these VC backed companies.\n\nThey're not going bankrupt but they're too bulky and need to merge to remove a few people and drive up unemployment.", "score": 5, "replies": []}, {"body": "SoFi will be fine long term. Student loans doesnt matter much they are doing fine without it.(It does help but not required) \n\nI mostly invested in SoFi not their banking capabilities but on their tech stack.A lot of Neo banks around the world use their tech (Galileo) and they keep expanding. \n\nSoFi is also making expansions around the world.\n(SoFi HK , SoFi Singapore, SoFi UAE (Rumors) , LATAM)\n\nI know its a risky play and its all about execution.\nBut I have nothing to doubt yet. They are steering in the right direction.\n\nMy position in SoFi is fucked but I will believe in my DD until something changes.", "score": 7, "replies": [{"body": "Agreed. But this goes to what I was saying. the basis for SOFI being dragged down is not based on the companies performance but rather elements they have no control over. Like being dragged down by sector, lumped in with spacs/fintech, and this obsession with student loans. \n\nThey can’t seem to rid themselves of this fallacy that they are a student loan company even after consistently proving they can succeed without the business. \n\nThis is why I feel like it’s a good buyout candidate. They are succeeding as a company but failing as a stock.", "score": 3, "replies": [{"body": "This is true. My preference is not being acquired I want to see this growth story play out. \n\nBut if it comes to it so be it. \n\nI just want to make money in the end. :)", "score": 2, "replies": [{"body": "Mine too. I’m just looking at the sector as a whole. There’s to much competition. PayPal specifically I singled out because of their situation. They were uniquely bloated by the pandemic response and now are deflating. It’s clear they see it too and are worried about it because what they tried to do with PINS.  So just makes sense to me at least for them integrate SOFI", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I would agree with that. I could see maybe end of 2023 there would be more interest, but doubt SOFI would want to consider a take over at this point given they are executing and based on the Sp they’d be selling low so to speak. \n\nThat said I still think the big dogs are keeping an eye on it. PayPal looks to be in dire straights to me which is why I could see them trying to make a move sooner, but like you said maybe SOFI wouldn’t even be interested. \n\nI doubt apple. They want the whole world for themselves and they want to be the masters of their own design rather than take over someone else’s", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "PayPal doesn’t have banking license. They need to add growth and absorb competition.", "score": 9, "replies": [{"body": "But I have a PayPal savings account?", "score": -3, "replies": [{"body": "Their using an outside bank.", "score": 17, "replies": []}]}]}, {"body": "Isn't Klarna basically the same as PayPal + some minor features?\n\nThis raises the same question as you asked above. What's stopping PayPal from just doing what Klarna does themselves", "score": 4, "replies": [{"body": "paypal already does what klarna does. They launched Paypal pay in 4 back in 2020", "score": 2, "replies": []}]}, {"body": "It would take PYPL years to do what SoFi is doing.\n\n&#x200B;\n\nAlso, SoFi isn't getting pounded anywhere.. SoFi is guided growing revenue of 45% this year, neutral contribution by the end of the year, non GAAP profitability by the end of 2023 and profitability in 2024.\n\nThey are one of the few companies that are raising guidance rather than lowering it.", "score": 8, "replies": []}, {"body": "klarna is way out of reach for paypal", "score": 2, "replies": []}, {"body": "SOFI is killing it on earnings. What are u smoking. Read the numbers and listen to a conference call. Absolutely delusional", "score": 6, "replies": [{"body": "They reported revenue growth 49% yoy last quarter. \n\nAdded 408k new members - up 70% \n\n689k new product adds - up 84% \n\nRaised their full year guidance. \n\nThey Did all this in the face of one of their business segments being completely suspended. \n\nIf you paid attention to earnings this last quarter A lot of companies are slowing/losing members and/or EPS, while SOFI is gaining steam.", "score": 10, "replies": [{"body": "Dude I’m saying SOFI is killing it lol. The comment I replied to said SOFI is getting “pounded” on earnings. SOFI is growing rapidly and killing it on all metrics.", "score": 3, "replies": [{"body": "\"Earnings\" means profit.", "score": 1, "replies": []}, {"body": "My bad misread that lol", "score": 1, "replies": [{"body": "No worries lol. People will downvote us for saying SOFI is killing it on earnings, but they are just delusional “investors” thinking SOFI is just a student loan business.", "score": 7, "replies": [{"body": "💯", "score": 2, "replies": []}]}]}]}, {"body": "This is a small point, but a 70% increase isn't exponential growth.", "score": 0, "replies": []}]}, {"body": "How are they killing it on earnings if they have no earnings?  \"Earnings\" means profit.", "score": -2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Sure.  I never argued they won't make money.  I said they aren't currently making money, and \"earnings\" refers to net income, not good margins.", "score": 0, "replies": []}]}, {"body": "So basically you wouldn’t have bought Tesla or Amzn back in the day because they didn’t have “earnings” \n\nProbably should stick to ETFs", "score": 5, "replies": [{"body": "When did I say one shouldn't buy companies that don't have earnings?  I didn't say one shouldn't buy SOFI.  I simply said they don't make money right now, and that's what \"earnings\" means. \n\nThis is indisputable.  It's finance terminology 101.", "score": 1, "replies": []}]}, {"body": "Please learn how a company is ran. Every company starts off as unprofitable and then they become GAAP profitable. The one way thinking in this sub is crazy. No hurt in being a lazy investor and just putting your money in cash machines like apple and google, but the more diligent investors find growth companies that are increasing over 50% yoy and see a path to profitability, and will become a cash machine.", "score": 5, "replies": [{"body": "You need to read my comment again.  I never said anything about SOFI's future profitability prospects.  I said they are not currently profitable, therefore it makes no sense to say they are killing it on earnings when they have no earnings.\n\nSave the snark for when you've read the comment correctly.", "score": 1, "replies": []}]}]}]}, {"body": "The fact they'd have to apply for all of the licenses, then create a product from scratch then market it enough to become a billion dollar company.\n\nInstead, they buy it for a billion then make money on the recovery.", "score": 0, "replies": []}]}, {"body": "What \"political BS\"? Do you mean student loan payments being on pause?", "score": 8, "replies": [{"body": "Yeah that's what he meant.", "score": 2, "replies": []}, {"body": "The fact that the administration can’t make up their mind on what they are going to do. The fact that they are just endlessly extending the deadline every 4 months or so based on “covid” the fact that company had to indefinitely suspend student loans guidance even though there is technically a deadline because the company knows it’s being used a political chess piece and will be extended again before midterms. \n\nThe admin has no fucking clue what to do, there just dangling this thought of forgiveness but can’t decide when or if or how much to do", "score": 0, "replies": [{"body": "It's not being dangled, it's obviously being saved for 2 pretty clear economic reasons.\n\nA. Inflation is still high, so there's no need to increase liquidity in the system\n\nB. Student loan forgiveness is expected to increase GDP by 0.4/5%, best to save it for when it is needed during GDP recession.\n\nSomeone's definitely letting their stocks cloud reason, you should have factored this in from the outset, this has been on going from March 2020. Never expect things to change just because you want them to.", "score": 7, "replies": [{"body": "Restarting loan payments would be deflationary as it would take money out of peoples pockets, lowering demand for other goods.\n\nWhat are you talking about?", "score": 7, "replies": [{"body": "It's obvious I'm talking about loan forgiveness.", "score": -1, "replies": [{"body": "Considering op is clearly talking about resuming payments, which keeps getting extended, it is not.", "score": 7, "replies": []}, {"body": "Except that has nothing to do with SOFI.", "score": -5, "replies": [{"body": "I don’t understand why you keep saying that. SOFI literally started as a student loan business…. Do you not think people refinance their federal student loans?", "score": 8, "replies": [{"body": "The person I responded to was referring to loan forgiveness:\n\n*It's obvious I'm talking about loan forgiveness.*\n\nI don't see how it gets much clearer than that.", "score": 1, "replies": []}]}]}]}]}, {"body": "Hell yes. Keep government student loan interest at 0% please. This has been game changer. \n\nI may have been scammed and fucked by the American education system, at least I don't have to pay extra on top of getting scammed", "score": 4, "replies": []}, {"body": "Increasing liquidity into the system is being done by not restarting student loan payments. The pause itself is inflationary. That money should be going to pay back loans not sloshing around in the system. \n\nThat’s beside the point. The point is the inability for the administration to take ANY action. Indefinitely extending a temporary extension is not a policy. In fact, it’s harmful to the students themselves. Think of how many students did not refi their loans because they are assuming extensions, then once the Spigot does turn back on we’ll be (and already are) in a much higher rate environment. \n\nEither do something or don’t but can’t just stay in limbo indefinitely. They should just forgive 10k and restart payments…that simple.", "score": 2, "replies": [{"body": "An extension of existing policy is action. What it comes down to is you expected change when there was no indication there was going to be one. You made an investment in a highly inflated stock based on an over optimistic scenario", "score": 5, "replies": [{"body": "Lol, and you clearly took out to much in student loans and don’t want to pay them back. I understand. \n\nThe fact is the student loan pause was because of COVID. Did you forget that? where are we now….3.5% unemployment, so called booming economy (the best in the world as Biden likes to say) mask mandates off, sold out stadiums, concerts, events everyone out traveling and spending, eviction moratorium long over….. \n\nSo how is coivd still a logical excuse for student loans pause? \n\nBut again, your still missing the point. The extension TEMPORARY. If they’re gonna do somethjng then fine, fuck forgive 20 or 30k whatever BUT DO SOMETHING…. \n\nHow is permanent temporary extensions a good solution? Every 3 months the student has to stress if the payments are coming back or not???", "score": -5, "replies": [{"body": "It’s always funny to see someone make up an imaginary scenario in their head about the person they are arguing with as an attempt to discredit their argument in someway. You turned to troll pretty quick.", "score": 4, "replies": []}, {"body": "I am neither a student nor American, so... Students should prepare for payments to come back, you as an investor should expect them not to come back. It doesn't really change my point, you bought into Sofi at a vastly inflated price with a known issue with no definitive ending timeline, that's no one else's fault but your own.\n\nI can't believe the amount of people who play the blame game instead of learning where they went wrong with their stocks", "score": 6, "replies": []}]}]}, {"body": "When you say Biden administration, do you mean Trump administration? That's who initially put the pause on loans and started the program to send everyone checks.", "score": 5, "replies": [{"body": "Well that’s because had this thing called a pandemic that hit in March 2020 and the market as well as the economy collapsed as well as shut down. I’m not exactly sure but I think trump did it as a result of that. \n\nBut in 2022 the economy is open, unemployment is low, and nobody is concerned about coivd being a threat anymore.", "score": -5, "replies": [{"body": "No I can understand that, I just wonder why the moratorium on loans wasn't a 6 month thing or less in the first place, especially with people getting all of that free money. Clearly, the current administration has a different view on student loans. A difficult point, and the reason why I sold SOFI a while ago and cut my losses at 20-30% is that now we're staring at a recession and based on the initial reasoning that loan payments were paused due to an economic downturn, I don't see how this changes anything. \n\nWith that said, I am eying NAVI and ALLY, but pauses could extend through the year, even through the entire presidency, since it was an executive order, was it not? I might be wrong on that. Then again, the pauses may end at any moment.\n\nThe history of student loans is interesting, Bidens work actually led to the inability for loans to be absolved in bankruptcy, so is he trying to atone? IDK,  but that policy was based on reports that doctors/lawyers were taking student loans and declaring bankruptcy upon graduation to dismiss them, which didn't actually happen. There's a good podcast episode on the Argument or maybe it was A16Z, learned about it there and looked it up out of interest.", "score": 1, "replies": [{"body": "The whole response was a cluster fuck. I personally wasn’t happy with trumps response. After the first initial shock of covid and people realized it wasn’t as bad as suspected they should have began normalization. Then once the vaccines came out they should have really began normalization instead both Biden and trump wanted this free money shit to essentially buy votes for 2020. Then when Biden won he just took it to a whole new level with idiotic inflationary actions and now we’re all getting hosed on it. Trump at least had some excuse in the beginning because nobody really knew how bad it was or wtf was going on the first few months. \n\nWhatever the case we’re paying for it now. The sooner the world can normalize back to pre void the better.", "score": -1, "replies": []}]}]}]}]}, {"body": "> It's not being dangled, it's obviously being saved for 2 pretty clear economic reasons.\n\nI'm 99% sure it keeps being pushed off because reinstating student loan payments in an election year is a bad look for the party in power. It's the same reason why the white house was thinking of sending gas rebate cards to Americans.. they care more about maintaining power rather than the actual impact of their actions on the economy", "score": 1, "replies": [{"body": "I’ll raise that to 100% that’s exactly what it’s all about.", "score": 2, "replies": []}]}, {"body": "The proposed forgiveness only applies to federal student loans, people!  You're talking about an issue that has absolutely nothing to do with SOFI.  The government isn't considering forgiving privately-held debt!", "score": 1, "replies": []}]}, {"body": "The forgiveness only applies to federal student loans.  What does that have to do with SOFI?", "score": 1, "replies": [{"body": "Refis", "score": 1, "replies": [{"body": "Who is doing a refi under current rate conditions?  I must be missing something here.  What does the Biden administration have to do with refis?", "score": 1, "replies": [{"body": "Pretty much nobody is refi hence the reason SOFI has had suspend that business/guidance  for the most part. Biden is not restarting the payments therefore existing loan holders aren’t refinancing their loans. The pause was done on the basis of covid and the economy shut down. Both of which are no longer viable excuses. The only reason for extending them is political points with voter base. On top of covid/economy no longer being an issue, these extensions are also inflationary as well. \n\nThat being said student loans are not a big deal for SOFI other than the fact it’s one more excuse for shorts to hit the stock. frankly I could care less what Biden does, just think he should have the guts to make a decision on it one way or the other. If he wants to forgive 50k just do it already….", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Why doesn't SOFI make money when other student loan servicers like NAVI and ALLY generate profit and have P/E <4 and pay a nice dividend? I feel like those are the better plays, especially since they're also at 52wk lows and they, you know, actually make a profit and have a >3% dividend.", "score": 2, "replies": [{"body": "Their business is divided into 3 segments, the lending segment has 50% profit margin, the technology segment has 30% profit margin (intentionally due to investment back into growth) and the financial services is their money losing segment due to marketing, excluding marketing that segment is also profitable.\n\n&#x200B;\n\nSoFi got a bank charter in January this year, comparing the most important thing to a bank, deposits, shows that SoFi's deposits in Q1 surpassed the deposits Ally got.\n\nIn Q1 Ally has received $917mil in deposits, SoFi has received $1.16B in deposits in Q1 and that is while Ally is been around a lot longer.\n\nOn top of that, SoFi's deposits have picked up massively since then and are growing at about 150mil a week at this point, since the reporting date of Q1 SoFi has already gathered another $1B, as per June 9th.", "score": 8, "replies": []}, {"body": "SoFi is focused on growth.\n\nAlly is a good play as well. However, they've been around a while and obviously are turning a nice profit.", "score": 6, "replies": []}]}, {"body": "If valuations stay suppressed I feel we’re going to see a lot of M&A. In prior downturns companies set themselves up for years, ORCL & AVGO particularly come to mind, by taking out or merging with competition. Whether fintech or SAAS there are a lot of great product, not yet good businesses, who could be highly accretive years out for companies where the current losses would have minimal impact.", "score": 2, "replies": [{"body": "Agreed. Fintech is out of control. Fintech and streaming are the two most washed out sectors just way to many companies", "score": 2, "replies": []}]}, {"body": "Ha ha.  Visa and Mastercard will soon swoop in to take all.", "score": 2, "replies": []}, {"body": "The smartest thing would be for Bank of America or Wells Fargo to acquire sofi.", "score": 2, "replies": []}, {"body": "Should APPL acquire SOFI?", "score": 2, "replies": [{"body": "Crazy shout\n\nGood crazy", "score": 2, "replies": []}]}, {"body": "Man OP, I have no idea, but I need SOFI to hit $6 over the next couple weeks. Really hoping it will happen.", "score": -1, "replies": []}, {"body": "Sounds good to me", "score": 1, "replies": []}, {"body": "Sofi isn't that special, and they are a bank, while PayPal is a payment processor. If PayPal wants to get into banking they could do it for way less than it would cost to buy sofi. \nHowever, why would PayPal want to drop $6 billion or so to buy sofi (4.5 bil market cap + a premium). What does this add to PayPal? Nothing. It is diworsification at its finest.", "score": 1, "replies": [{"body": "PayPal is clearly decelerating. They still have nice FCF, but what is their plan for growth? The era of stimulus and zero rates is over. There many payment options to choose from now other than PayPal Venmo. At the moment they are still on a decent position given how entrenched they are, but competition is heating up and the macro environment is deteriorating at the same time. That’s not good spot to be in. \n\nYour right buying SOFI isn’t their only option but imo it’s a good one. You say SOFI isn’t that special, well their growth rate would suggest otherwise. They are greatly increasing members and have multiple diversified revenue streams/business.  Their deposits are growing big time on the banking side. \n\n“it took us three years to get to a $1 billion of deposits. And it took us three months to add another $1 billion and they're high quality coming from direct deposit customers.” - ceo Anthony noto \n\nSo if PayPal were to add this it puts them back into a dominant growth position but this time it won’t be a temporary one like it was during stimulus pandemic response", "score": 1, "replies": [{"body": "Are companies looking for unprofitable growth right now? Everything I've heard is that everything now is about cash. Hold cash, make cash, don't borrow.", "score": 1, "replies": [{"body": "Companies that have cash and free cash flow should absolutely be looking for growth while valuations are discounted", "score": 1, "replies": []}]}]}]}, {"body": "No. \n\nI have shares in both and I don't want that. \n\nPayPal haven't posted declining EPS, not really. PayPal are compared to a period before eBay decided to work on their own system. PYPL will return to growth naturally once this comparison passes.\n\n&#x200B;\n\nSoFi would decline an acquisition attempt either way likely and they don't need PYPL.", "score": 1, "replies": [{"body": "I too have shares in both. What concerns me more about PayPal is the competitor that’s brewing. As a PayPal share holder, Are you concerned about the new apple payments. Tapping iPhones to send money, with all the iPhones out there I feel like this is devastating to Venmo", "score": 1, "replies": [{"body": "I am not worried.\n\nPayPal isn't only a BNPL business, one of their vectors is a BNPL. Will Apple hurt that vector? Definitely, but the rest won't be affected by Apple's BNPL though.\n\nPayPal will likely do M&A to diversify even more, I don't know into what but I am not worried about PayPal at all in terms of Apple's BNPL right now. Venmo works for both Apple and non Apple users, if the terms would be the same then no real reason to prefer Apple over Venmo.", "score": 1, "replies": []}]}]}, {"body": "SQ is better", "score": 1, "replies": []}, {"body": "No. Banking licenses comes with a ton of regulation. I am actually confused why Sofi became chartered. The efficiency from not being highly regulated is lost. I don't see how they can give the better rates and fees, because just like traditional banks they now need to abide by the personal requirements that make them less efficient. \n\nEverything from income verification for lending, to local HMDA requirements, to much broader compliance division. Even if they are willing to take less than a Chase or BOA, they will not be undercut by credit unions who are exempt from the regulation. On top of that, if they do win more market share, the big banks can simply cut their price points to starve them out. \n\nPaypal is better off still trying to still be a competitor to Visa, MC etc. If anything they should acquire Square. Then they would have terminals in point of sale that is powered by Paypal.", "score": 1, "replies": []}, {"body": "This is actually not a bad idea given they have lost growth.", "score": 1, "replies": []}]}
