{"title": "'You know who you are!’: Jeff Bezos challenges rival retailers to match Amazon’s pay and benefits", "selftext": "https://www.cnbc.com/2019/04/11/jeff-bezos-challenges-other-retailers-to-match-amazon-pay-and-benefits.html\n\nJeff Bezos issues a challenge to competitors to match Amazon’s pay and benefits.\n\n“Do it! Better yet, go to $16 and throw the gauntlet back at us,” Bezos says in his annual letter to shareholders.\n\nWalmart and Target have both been making investments in pay, but they’re still behind Amazon.", "id": "bbytzi", "created_utc": 1554982783.0, "score": 460, "upvote_ratio": 0.95, "num_comments": 197, "comments": [{"body": "Walmart, McDonald’s, and Amazon have all made significant investments in automation and cutting the amount of labor hours that are needed, and now are aggressively pushing higher minimum wage laws. \n\nThe obvious reason is to sink anyone who hasn’t invested in automation, including the mom and pop shops that are left.", "score": 460, "replies": [{"body": "So lets tackle the issue.. Should these companies not automate or should they not raise minimum wage?\n\n&#x200B;\n\nWe're as a society trying to get people out of non-essential jobs.  Grocery stores in the 70s had bagging clerks but then people said we can just do that ourselves and rather save money", "score": 113, "replies": [{"body": "I would say that automation is not necessarily a bad thing, if it is driven by the market price of labor rising to where automation is cheaper. We’ll have more stuff being made, productivity goes up, and we won’t be leaving a bunch of people behind.\n\nWith a big raise to minimum wage, however, you get an artificial push towards automation that is going to leave a lot of people without a lot of options.", "score": 39, "replies": [{"body": "I'd go further and say that automation is a fantastic thing, and we should want more of it where possible.\n\nThe issue here isn't automation, it's assuming a 1950's style labor market is the best way to run a society.", "score": 7, "replies": [{"body": "Again, automation that occurs due to natural market forces is fantastic. Automation that is a response to wages raised arbitrarily by legislative fiat can be terrible for the people locked out of labor markets.", "score": 5, "replies": [{"body": "What's the substantive difference? Bad minimum wage policy may lead the inevitable to happen n years earlier, but ultimately it's the same outcome. If anything, they may get lucky to be on an earlier wave before the retail exodus.", "score": 1, "replies": [{"body": "The substantial difference is that the taxes on corporations should balance the level of automation / labour cutting they do. Ie social programs from tax revenue should offset the labour market big companies used to need. Also big companies need to figure out that they need people employed and / or with money to spend otherwise they won't have enough people to sell to. \n\n\nAlso please understand that I'm not talking basic universal income here but more like using taxoney to build public projects to ensure the population isn't just sucking on the teat in the future. \n\nIdea is to keep everyone occupied fed clothed and paid the motivation for big companies to facilitate this is purely for their future if they can't sell anything cause not enough of the population is gainfully employed then they're fucked.", "score": 2, "replies": [{"body": "Just to clarify, the question was about the substantive difference between automation that occurs due to natural market forces and automation that is a response to wages being raised arbitrarily, other than shifting the inevitable outcome by n years forward.", "score": 1, "replies": [{"body": "Think I read what I wanted to read and just went rabble rabble after hitting reply lol, sorry", "score": 2, "replies": []}]}]}]}]}, {"body": "The problem is that people think of \"honest work\" as a moral, rather than practical issue. Automation should mean things become cheaper, most of the population no longer needs to work, and we all live in a post scarcity future of plenty. But because the idea of people not starving to death if they don't work 8 hours a day, even if that work is completely unnecessary sounds like a mortal sin to lawmakers, we might not get the proper social infrastructure in place to prepare for mass automation.", "score": 4, "replies": []}]}, {"body": "Universal Basic Income may be needed to address the potential massive job losses do to automation.", "score": 14, "replies": [{"body": "How much of the 350 billion annually you going to chip?", "score": 6, "replies": []}, {"body": "People have been saying that automation and labor saving machinery was going to take all of our jobs and make us poorer for hundreds of years (see the Luddites). So far they have been hilariously wrong. The only way I can see it going differently this time is if the push to automation comes not from wages rising organically, but from a huge raise to the legal minimum wage.", "score": 10, "replies": [{"body": "The difference being that machines in the past couldn't think and solve problems like they can now. They could only do menial, repetitive tasks. Soon they'll be able to think faster, work faster, and learn new skills more efficiently than you or I could ever hope to.", "score": 42, "replies": [{"body": "not to mention there have been HUGE strides in robotics and programmable logic chips.  my cousin worked for a company as a PLC developer and he sometimes hated it, because his job was to go into a factory or warehouse and come up with designs to replace workers, while they were right fucking there working.  on average he would reduce each places work force by at least 20%.", "score": 26, "replies": [{"body": "My brother does the same for a private company that has massive automation in laser guided vehicles . They can go in and replace every single forklift with a robot that will drive to a truck , pick up pallets , and export endlessly .  They also self recharge ...", "score": 10, "replies": [{"body": "jesus, thats amazing if you think about it.  my cousin was doing this 15 years ago, i cant imagine how far some of the tech has gotten by now", "score": 5, "replies": [{"body": "Check out the company Electric 80 .  I can’t talk too much about clients , but can tell you they’re a game changer .", "score": 4, "replies": []}]}]}, {"body": "Many companies have some sort of policy that any emoloyees whose jobs are rendered unnecessary due to continuous improvement efforts will be retrained and reassigned rather than let go.\n\nOf course can't speak for everywhere but I study industrial engineering and the ethics of automation come up in class quite a bit.", "score": 4, "replies": [{"body": "Retrained and reassigned to do... what?\n\nCompanies automate to reduce one of their largest expenses, people.  Some places like the EU there's more hurdles, but in many states in the US it's very easy to quietly reduce workforce.\n\nEven for publicly traded companies, layoffs only need to be reported publicly over a certain threshold.  They can be under the guise of \"restructuring\", lasting several years or indefinitely.", "score": 2, "replies": [{"body": "Some people would have you believe that all those people will be retrained to repair and maintain robots.", "score": 2, "replies": [{"body": "lol the people replaced wouldn't begin to be qualified.  As with other industrial equipment, there will be significantly less people required.  Why make cookies by hand when you can make 50,000 cookies a second.", "score": 1, "replies": []}]}, {"body": "Do you understand the difference between line and staff positions?", "score": -1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "ah my bad about the C.  but this was also many years ago in a very small company, so my details may be mistaken as thats when the conversation took place.  but he definitely went onsite and worked with the other guys on his team to see what they were going to try to design", "score": 1, "replies": []}]}]}, {"body": "Found the Cylon.", "score": 1, "replies": []}, {"body": "Which is why some sort of UBI may soon be needed.", "score": 1, "replies": [{"body": "yeah we need a lot of things that we don't get", "score": 1, "replies": []}]}, {"body": "plus they don't ever need pee breaks, cigarette breaks, lunch breaks, or conversation breaks, or video game breaks, or cell phone to the spouse breaks .... and they do what their bosses tell them to, first time, every time, with no complaints ... no sick leave, no annual leave, no depression or menstural cramps ....the arguments are endless.....", "score": -1, "replies": [{"body": "no sex in the delivery vans that are waiting to be loaded", "score": 1, "replies": []}]}]}, {"body": "Poor response of someone living in a bubble and obviously not impacted.  I can point you to a dozen news articles that prove you wrong.  Automation is and will continue to make a huge impact to everyone from cashiers to coal miners, car makers, taxi drivers, truck drivers, construction works, doctors, lawyers and others.  For every 1 job moved offshore, 6 have been automated away.", "score": 1, "replies": [{"body": "Over half of the population worked in agriculture 250 years ago. Automation destroyed almost all of those jobs. Less than 2% of people work in ag today. Everyone is going to be impacted, including myself, and it will be harder for some people, but the people that remain in jobs that already exist today will be dramatically more productive than they are today, and everyone else will be freed up to do all kinds of new productive things we haven’t even dreamed of yet. What percentage of jobs that we have today existed 250 years ago? 100 years ago? Mine was in its infancy 50 years ago, and that’s probably relatively old by modern standards. How many jobs that people are doing today even existed 20 years ago? \n\nThe idea that we are going to be sitting around surrounded by an abundance of machine-produced goods and services with no money to buy any of it is absurd.", "score": 1, "replies": [{"body": "The difference is in what markets are opening up to replace those lost jobs. Farmers moved to manufacturing and construction which were booming. Accountants got automated and the market shifted to computer software.\n\nNow we're losing the last of our manufacturing jobs and starting to lose service jobs. What burgeoning new industry needs so many workers and has a low skill barrier?", "score": 2, "replies": [{"body": "Who knows? But if you told a 1850s farmer that one day relatively soon there would be as many cashiers and almost as many bartenders, servers, and baristas in America as there were farmers, he would have laughed in your face. The future reality will probably sound as absurd to us.", "score": 1, "replies": []}]}]}]}]}, {"body": "UBI is never the answer", "score": 1, "replies": []}, {"body": "If a massive amount of people are laid off then who’s going to spend money at these businesses? They may have lay offs due to automation but robots don’t spend money and won’t provide them with business. \n\nPeople without jobs and no source of income aren’t going to have money to spend.", "score": 1, "replies": []}, {"body": "And who pays for that Mr. Yang Gang ?", "score": 0, "replies": [{"body": "We're going to pay whether we want to or not. The services that these people will require when they lose their jobs and become homeless is going to eclipse the amount we'd spend via UBI by quite a lot.", "score": 16, "replies": []}, {"body": "The robots. Tax the output of automated systems to pay UBI and unemployment. It's a win win. Either the systems are efficient enough that they can support profits and paying people that they replaced, or they aren't and we get people back in those jobs until the robots are more efficient.", "score": 7, "replies": []}]}, {"body": "There won't be mass job loss as this ain't happening overnight.  More so we have been automating for decades and we been just fine.  And no UBI isn't needed nor should it ever be considered.", "score": -8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Despite the fact other jobs would be created that one be able to take up.  Really the whole no jobs thing is a meme talking point at this time. And really this whole no job thing is nothing but fake news.  [Even John Oliver has effectively said so.](https://www.youtube.com/watch?v=_h1ooyyFkF0&t=)  But trying to tell you nay sayers otherwise is clearly not going to work.", "score": 1, "replies": [{"body": "Even John Oliver? Well then, god forbid anyone disagree with HIM. You must be right then. /s", "score": 1, "replies": [{"body": "I am pointing out that even a liberal person is saying your wrong here.  This is besides the fact that history itself has shown you to be wrong.  But telling you and others is talking to a brick wall.", "score": 1, "replies": [{"body": "John Oliver is not the final word on this or any other issue. There are much more knowledgeable people in the field who see a massive displacement coming up. And past performance is not a predictor of future results. But I guess that makes me a brick wall.", "score": 1, "replies": [{"body": "Its like you and others don't even realize we been automating for years and all it has done really is created new jobs.  And the people that claim displacement are largely lefties who think the world is falling and think only socialism can save us.", "score": 1, "replies": [{"body": "It would be helpful if you would let go of your preconceived stereotypes about political associations. I'm not a lefty, I'm fiscally conservative and socially liberal. But the fact is that automation is advancing into new territory and displacing more jobs, and this is going to progress rapidly. Maybe new kinds of jobs will appear as they have in the past, but that's not a guarantee and you shouldn't be thinking of it as one.", "score": 1, "replies": [{"body": "And how exactly would it be helpful to let go about such thing when they continually get proven time and time again?  What your preaching is left wing talking points, but congrats on being libertarian?  The thing is automation always advances into new territory and displacing jobs but it also creates other jobs.  It going to progress rapidly is purely speculation.  \n\nThe thing is is that you continue to believe this talking point all without doing your research.  There's a lot of people and that primary left wing people who are fear mongering about this.  If you actually look at the facts we been automating as early as the Roman Empire.  As if you look at what the economists and those that actually research this that don't have an agenda to push say it's [quite](https://www.cnbc.com/2018/09/17/wef-machines-are-going-to-perform-more-tasks-than-humans-by-2025.html) the [opposite](https://venturebeat.com/2017/09/07/automation-replaced-800000-workers-then-created-3-5-million-new-jobs/).", "score": 1, "replies": [{"body": "Do you think there's any possibility that you could be being a little closed-minded here? You don't have a crystal ball, and neither do I. There's a certain arrogance that comes with being so certain when dismissing future risks, and it tends to make a fool out of people.\n\nI will say that I've been following the field of automation for several years now and I've spent many hours reading and watching conferences and interviews with actual experts at the top of the field. These people are not all just lefties to be dismissed in a knee-jerk fashion, nor is any view that disagrees with yours automatically a left-wing talking point.\n\nI also don't find your links very compelling. The first one is about a report which was based on a survey not of experts in robotics and artificial intelligence but of people in HR and managerial roles. The second is a handful of anecdotal stories in which automation ended up benefiting workers. I won't dismiss the opinions of the people in that survey, and I'm also happy that the workers in those stories had good outcomes.\n\nI still see a massive displacement in jobs on the horizon, and I still think it's going to be difficult for society to adapt in the way it has in the past due to the pace and scale of the changes that will be happening. You're free to see it differently.", "score": 1, "replies": [{"body": ">Do you think there's any possibility that you could be being a little closed-minded here?\n\nNope.  Do you not think you are fear mongering here?  \n\n>I will say that I've been following the field of automation for several years now\n\nYet you continue to ignore the past.  Something I been looking at.  As I been saying and something you continue to ignore is that we been automating for decades if not eons.  And we adjusted just fine.  New jobs got created that didn't exist before and this is going to be the case going forward.  Hell we are doing that right now with people making a living off of social media and video game streaming.  Those jobs only recently existed but something we never thought of before.  \n\n>These people are not all just lefties to be dismissed in a knee-jerk fashion, nor is any view that disagrees with yours automatically a left-wing talking point.\n\nEveryone that is spewing your talking points by and large have been left wing.  And seeing the sort of nonsense the left wing is spewing ya I am going to dismiss it.  As its by and large bullshit.  As you can only automate so much least with our current tech.  We be long dead before AI can even replace all blue collar workers for example.  By then the economy be much different than it is today.  Right now AI can barely drive a car and can't drive it nearly as decent as a human can.", "score": 1, "replies": [{"body": ">Nope. Do you not think you are fear mongering here?\n\nOf course not. I'm talking about my actual views on the direction of technology and the possible ramifications for society in the future, views which are shared by many people with much more expertise than you or I will ever have. Even if those views turn out to be wrong, they're certainly not baseless ideas that I'm throwing around because I want to scare people.\n\n>Yet you continue to ignore the past. Something I been looking at.\n\nI didn't ignore the past. I specifically addressed this argument that since society has adapted to previous automation things will go smoothly here also:\n\n\"And past performance is not a predictor of future results.\"\n\n\"Maybe new kinds of jobs will appear as they have in the past, but that's not a guarantee and you shouldn't be thinking of it as one.\"\n\n>Hell we are doing that right now with people making a living off of social media and video game streaming. Those jobs only recently existed but something we never thought of before.\n\nNew types of jobs will definitely be created. But we don't know how many, and replacing the many millions of jobs that will be displaced in relatively short order is not something we can just assume, even though you may disagree.\n\n>Everyone that is spewing your talking points by and large have been left wing. And seeing the sort of nonsense the left wing is spewing ya I am going to dismiss it. As its by and large bullshit.\n\nAmazingly closed-minded. You're literally not open to considering what I'm saying, because you perceive it to be associated with being left wing, and left wing is bad. Never mind the fact that I'm not particularly left wing, or that I've formed my opinions by spending a lot of time listening to experts on the topic, or that a quick browse through my comment history would show that I'm not a \"left wing talking points\" kind of guy. You are by definition failing to keep an open mind.\n\nRead back over our discussion. Which one of us is making unproven assumptions about the future and ad hominem attacks about political underpinnings, and generally being highly opinionated to the point of being obtuse? And this is coming from someone who seems to have little previous interest in the subject. Which one of us is \"spewing\" opinions here?\n\n>As you can only automate so much least with our current tech.\n\nWho says we're only taking about our current tech? The entire point is that technological advances are being made, and they're being made rapidly. Billion dollar companies are actively building out systems to replace all human drivers, all warehouse and stockroom workers, and the vast majority of clerical and analytical workers, not to mention many people in professions that were never considered possible to automate before. Those people can't all be YouTube stars or Instagram influencers, and they can't all become web developers or data scientists.\n\nSure, new types of jobs will be created, and there will always be service workers. But I don't share your unbound enthusiasm that the displacement of millions and millions of jobs wiped out by automation is going to go smoothly. I hope you're right. But I don't KNOW you're right, and neither do you. You just think you do.\n\n>We be long dead before AI can even replace all blue collar workers for example.\n\nAll? Probably not. The vast majority, particularly the ones doing predictable, repeatable tasks? Almost certainly, and well before we're dead.\n\n>By then the economy be much different than it is today.\n\nI agree with that, but for a different reason. I think the economy will be much different because very little human labor will be required to produce the vast majority of goods and services that society consumes. And without that need for human labor, most of the jobs will go away, and concepts like UBI will become entirely mainstream for the simple reason that they'll have to. Furthermore, I think we'll all be better for it, as we'll be able to spend our time doing what we choose instead of having our survival tied to a company's ability to make use of us as essentially human robots.\n\n>Right now AI can barely drive a car and can't drive it nearly as decent as a human can.\n\nGoogle's self driving cars have driven millions of miles and seem to be doing pretty well. The remaining kinks in the technology (handling inclement weather, for example) are being worked on.\n\nI actually think a lot of human drivers are pretty shitty. Every time I'm in the car I see someone tailgating, or texting, or swerving between lanes, or driving under the speed limit in the left lane. The other day a car in the parking lot backed into me, even though I was sitting there honking over and over to let him know I was there. Not only didn't look in his rear view but literally ignored the fact that someone was directly behind him honking non-stop. I can not wait for the day that human stupidity is removed from the equation when it comes to driving.", "score": 1, "replies": [{"body": ">Even if those views turn out to be wrong, they're certainly not baseless ideas that I'm throwing around because I want to scare people.\n\nYou haven't provided anything to support your views though.\n\n>You're literally not open to considering what I'm saying, because you perceive it to be associated with being left wing, and left wing is bad.\n\nMaybe if the left wing didn't spew so many wrong talking points I might be more open minded.  But when they push for things like guarantee jobs which I think is an idiotic ideal ya I am going to be closed minded.  More so I don't think the sky is falling like that the left wing is making it out to be.  As if you actually step back and look at what they are saying they are making it as if we are going to lose millions upon millions of jobs all within the next 5 years.  Has anyone even looked at current day automation and the progression of it?  \n\n>Which one of us is \"spewing\" opinions here?\n\nWe both are.  \n\n>But I don't share your unbound enthusiasm that the displacement of millions and millions of jobs wiped out by automation is going to go smoothly.\n\nI never said nor claim it would go over smoothly.  I simply said other jobs will be created, jobs we often not thought of today.  Again go back to my example with people making a career on social media and Twitch.  For a while there society was balking at the idea of that being a job let alone a career one could do and make money at.  Fast forward today and society overall finds it as an acceptable career.  As people seen you can make a living off it.  Obviously not everyone will be able to do this but still.  \n\n>The vast majority, particularly the ones doing predictable, repeatable tasks?\n\nSure when it comes to manufacturing, but not so when it comes to construction though.\n\n>concepts like UBI will become entirely mainstream for the simple reason that they'll have to.\n\nUBI is how you kill your economy.  As it will causes a lot of issues to say the least main one being inflation.  Even though I am a capitalist and hate socialism, I more see us going to a socialist based economy that has capitalists elements in it than going the UBI route.  Primary because UBI isn't well sustainable.  As one of the talking points of automation is there only be a few workers and loads of people not working.  And the working few aren't able to be able to support a large unemployed population.  It doesn't mater how you cut up the numbers.  This is where the socialism thing comes into play.  Where you have things like government housing and such.\n\n>Google's self driving cars have driven millions of miles and seem to be doing pretty well.\n\n[Its making progress but having noticeable issues.](https://www.youtube.com/watch?v=spw176TZ7-8)", "score": 1, "replies": [{"body": "> You haven't provided anything to support your views though.\n\nThese automation technologies are being worked on. That's a fact. They automate millions of jobs. That's also a fact. Where we get into opinion is with the question of whether society will adapt quickly enough with the creation of new jobs or social programs to avoid some level of crisis as the current jobs are displaced. I hope we can. I definitely think that when goods and services are widely produced without the need for human labor, we'll have to rethink how the economy works, where people get money from, what the responsibilities are of the companies that own all of the resources and means of production, etc.\n\n> Maybe if the left wing didn't spew so many wrong talking points I might be more open minded. But when they push for things like guarantee jobs which I think is an idiotic ideal ya I am going to be closed minded.\n\nMost left wing politicians aren't out there pushing for UBI or guaranteed jobs. There are a few like AOC (who I can't take seriously for other reasons) who have talked about things like this, but it's not a common position yet.\n\n> More so I don't think the sky is falling like that the left wing is making it out to be. As if you actually step back and look at what they are saying they are making it as if we are going to lose millions upon millions of jobs all within the next 5 years. Has anyone even looked at current day automation and the progression of it?\n\nI'm not going by what the left is saying about automation, dude. Where are you coming up with this? I'm going by what I read and hear from experts in the fields of robotics and artificial intelligence. I agree with you that it won't be five years. But things are going to change a shitload over the next 20-30 years.\n\n> I never said nor claim it would go over smoothly. I simply said other jobs will be created, jobs we often not thought of today.\n\nI agree with that, but I think the question is indeed whether it will go over smoothly. In other words, will enough new jobs emerge? Because if they don't, we're going to have to figure something out. Things like UBI will have to be considered.\n\n> Sure when it comes to manufacturing, but not so when it comes to construction though.\n\nOh man, all kinds of construction jobs will be (are being) automated. Pre-fab homes, aerial drone surveys, brick laying robots, self-driving dozers and excavators... if computers can be trained to build modern automobiles or beat world-class chess champions, most of what happens on a construction site can be automated.\n\n> UBI is how you kill your economy. As it will causes a lot of issues to say the least main one being inflation. Even though I am a capitalist and hate socialism, I more see us going to a socialist based economy that has capitalists elements in it than going the UBI route.\n\nI would view UBI and other forms of wealth redistribution as being forms of socialism.\n\n> Primary because UBI isn't well sustainable. As one of the talking points of automation is there only be a few workers and loads of people not working. And the working few aren't able to be able to support a large unemployed population. It doesn't mater how you cut up the numbers.\n\nI don't think it would be the working few paying for the rest. Essentially we're going to have goods and services being produced through automation, and money would just be a mechanism by which to select what goods and services you want. This gets into higher level questions like where money actually comes from, and what it actually is. At the end of the day, we'll have the ability to gather resources and turn those resources into stuff without most humans having to work. So we'll just give society the ability to select what we want (within reason) by allocating a certain amount of money to each person. Which is pretty awesome if you think about it. The only way that doesn't happen is if we reject ideas like UBI and don't require the companies that own the resources and means of production to bear a responsibility to society (in the form of automation taxes or something similar).\n\n> This is where the socialism thing comes into play. Where you have things like government housing and such.\n\nI'm not sure what it will look like. More shared housing is a possibility. I can tell you that I think the future is going to look a lot different, and it has the potential to be great.", "score": 1, "replies": [{"body": ">Most left wing politicians aren't out there pushing for UBI or guaranteed jobs.\n\nThey aren't, but they are by and large pushing idiotic ideas though with the vast majority of their ideas being an utter joke.  I can point to all sorts of examples but least to say there's a reason why I don't take the left wing politicians seriously.  And that I mock their ideas at every corner.  As they yet to present realistic ideas and more so solutions for problems.  As they are certainly not helping anything spewing fear over the whole automation thing.  No one has a clue how it will play out.  But as I mention in the past it has worked out just fine.  Its also not something going to happen in the next 5 years either.  It's going to happen over decades like it has been ever since we been automating things.  \n\n>But things are going to change a shitload over the next 20-30 years.\n\nTalk to some baby boomers and ask them about changes in their lives.  I think you find a lot has changed in their life time as well.\n\n>Oh man, all kinds of construction jobs will be (are being) automated.\n\nThey are really not though.  There's efforts being made but its not something going to be totally automated as you going to need AI way more advanced than what we have to totally take the place of all blue collar work.  As there's a lot of nuances that go on with such work.  Hell even with white collar jobs they aren't going to be automated, but more the tasks white collar workers do will be automated not their job themselfs.  Which is already a thing, see current version of Excel for example that does a lot of the work for you now.\n\n>Essentially we're going to have goods and services being produced through automation\n\nDude we are eons away from such a thing.  We aren't even close to a world like that and as I said we be long dead when you have more automation going on anyway.  As to your question about money and such, I do think society and that matter the world will either go the way of Star Trek where currency isn't a thing and we live in utopia basically or go the Star Wars route where we have one universal currency and humans and robots coexist and doing similar jobs and what have you.  I mentions those as I have no doubt we will go back exploring space again and that go to Mars and further out, and this where where automation either takes over completely or counties but we remain capitalistic.  But we both be long dead at that point though.", "score": 1, "replies": [{"body": "I think we've exchanged some interesting points. Where we disagree is mostly on the pace of the changes that automation will bring. The reason I think it will be more extreme than during the earlier years of the baby boomers, for example, is because technology in general is exploding. The combination of advances in robotics, artificial intelligence, data science, and so on is just so profound. I see things changing dramatically over the next couple of decades. While I don't think the scenario I described above will have fully played out in 20-30 years, I'd be very surprised if there isn't a substantial displacement of jobs and the introduction of something like UBI to address it during that time. This isn't a certainty, of course, but I think it's a reasonable prediction.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "You sound smart and well informed.", "score": 5, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "My first statement created the middle class. There was virtually no middle class to speak of when more than half of the population was employed in agriculture. Today, thanks to automation and technology, less than 2% of the population is in agriculture, and we are tremendously better off for it. The chances are good that your job didn’t exist 100 years ago. There is no reason to believe we won’t be doing jobs 100 years from now that don’t exist today.", "score": -2, "replies": []}]}, {"body": "I think it's an issue that huge companies with massive amounts of revenue aren't funneling that back adequately to their workers or to their country. Amazon pushing for a higher minimum wage solely because they have more automation seems unethical to me. The reasoning behind their push is monetary gain and it's kind of sickening. Why can't we hold companies like this to an ethical standard?", "score": 1, "replies": [{"body": "These companies, especially WalMart and other big box stores, generally [cost municipalities more than they pay in property tax to serve with infrastructure](https://www.strongtowns.org/journal/2017/11/3/big-box-stores-are-costing-our-cities-far-more-than-we-ever-imagined) and that’s before the [huge subsidies](https://www.strongtowns.org/journal/2016/9/23/how-local-cronyism-hurts-americas-cities) that they get to attract them to the municipality in the first place.\n\nWe’ve created an economy where economy of scale is the only way to make it through the regulatory environment and bribe or bully your way into an unfair advantage. Instead of worrying about holding these companies to some kind of subjective standard, I think we should work to make it a place where a [Jimmy’s Pizza ](https://www.strongtowns.org/journal/2013/11/25/the-fool-proof-city.html) can really thrive, and not just [Dunkin’ Donuts](https://www.strongtowns.org/journal/2014/1/20/dunkin-our-future.html?rq=Waffle%20house).", "score": 3, "replies": []}]}, {"body": "Its a bad thing becuase of the population problem everyone chooses to ignore.", "score": 1, "replies": [{"body": "Is Malthus going to weigh in here alongside the Luddites? How many debunked theories are we going to go through?", "score": 0, "replies": []}]}]}, {"body": "Grocery stores today still have bagging clerks...", "score": 5, "replies": []}, {"body": "Totally wrong.\n\nCompanies continue to externalise costs.   Companies said, we’re no longer going to bear the cost of packing for you, because that eats profit.", "score": 2, "replies": []}, {"body": "We shouldn't raise the minimum wage.  Minimum wage isn't extra money in your pocket, it is a prohibition against work unless you are worth that much money.", "score": 4, "replies": [{"body": "The minimum wage was a stop-gap measure to address the oversupply of labour during and after the Great Depression. The fact that it exists in the first place indicates that unskilled labour can no longer negotiate a livable wage on its own merit. Instead of addressing this underlying issue, we went on for almost a century artificially inflating the minimum wage while demand for unskilled labour kept dwindling.\n\nThe only way out of this mess that I can see is Universal Basic Income. When people no longer have to worry about making ends meet, they can be free to pursue whatever work they want and get compensated for what the work is actually worth.", "score": 13, "replies": [{"body": "> The fact that it exists in the first place indicates that unskilled labour can no longer negotiate a livable wage on its own merit.\n\nI don't think that follows. It assumes the only reason people would want/vote for a minimum wage is because they feel they can't negotiate a livable wage.", "score": 4, "replies": [{"body": "Why would people want or vote for a minimum wage if they were receiving a livable wage? The whole point of the push for higher minimum wages is that current ones AREN'T livable.", "score": 3, "replies": [{"body": "> Why would people want or vote for a minimum wage if they were receiving a livable wage?\n\nSo your position would assume that people making over $70,000, say, wouldn't vote for a minimum wage increase because they are receiving a living wage?", "score": -3, "replies": [{"body": "It would assume they would have no reason to request one for themselves, but I'm not saying someone wouldn't fight for a minimum wage when other people aren't receiving a living wage.", "score": 3, "replies": [{"body": "> but I'm not saying someone wouldn't fight for a minimum wage when other people aren't receiving a living wage.\n\nBut you just did though.", "score": -1, "replies": [{"body": "Actually, no, what I'm saying is that if everyone had a livable wage there would be no need for a minimum wage, but thank you for playing.", "score": 1, "replies": [{"body": "> Actually, no, what I'm saying is that if everyone had a livable wage there would be no need for a minimum wage\n\nThat wasn't what you said in your first post, nor your following post.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Most people can do tasks that benefit companies above the minimum wage though. Like 99% will be worth that, and those that arent probably arent in a position to join the workforce anyways.", "score": 1, "replies": [{"body": "You're severely overestimating the modern value of unskilled labor and the straight up volume of the issue.", "score": 0, "replies": []}]}, {"body": "And if you raise the minimum wage,then everyone over that threshold is technically making less.", "score": -1, "replies": [{"body": "Reddit just amazes me sometimes.  Like, these people with such ignorant theories and worldviews are actually allowed to drive a car, buy alcohol, vote.  Just madness.", "score": -4, "replies": []}]}, {"body": "Spoken like a teenage libertarian who's never lived in the real world", "score": -2, "replies": []}]}, {"body": "You should read Life 3.0", "score": 1, "replies": []}, {"body": "my grocery store still has baggers", "score": 1, "replies": []}, {"body": "So then stores make you bag it yourselves AND charge you for the bag now! It's a win-win for everyone! /s", "score": -1, "replies": []}]}, {"body": "Pulling a rug under your competition.", "score": 24, "replies": [{"body": "Exactly. It would be like if Uber rolled out a fleet of electric vehicles and called for a huge increase in the gas tax.", "score": 48, "replies": [{"body": "Yeah, they are advocating for something that a large section of america wants, but they are advocating purely for monetary gain. Not for the benefit of their workers. It seems very two faced to me.", "score": 4, "replies": [{"body": "It’s the old [Baptists and bootleggers](https://en.m.wikipedia.org/wiki/Bootleggers_and_Baptists) alliance.", "score": 5, "replies": [{"body": "**Bootleggers and Baptists**\n\nBootleggers and Baptists is a concept put forth by regulatory economist Bruce Yandle, derived from the observation that regulations are supported both by groups that want the ostensible purpose of the regulation, and by groups that profit from undermining that purpose.For much of the 20th century, Baptists and other evangelical Christians were prominent in political activism for Sunday closing laws restricting the sale of alcohol. Bootleggers sold alcohol illegally, and got more business if legal sales were restricted. \"Such a coalition makes it easier for politicians to favor both groups. ...\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/stocks/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "score": 6, "replies": []}, {"body": "Desktop link: https://en.wikipedia.org/wiki/Bootleggers_and_Baptists\n***\n ^^/r/HelperBot_ ^^Downvote ^^to ^^remove. ^^Counter: ^^250443", "score": 1, "replies": []}]}, {"body": "Meanwhile, Chic-Fil-A, Arby's, Hardees/Carl Jr's are hot on the trail. We can never legislate fairness without stifling creativity and innovation. This has been proven a thousand times throughout history. Have you studied WalMart's, McDonald's or Amazon's performance lately? Amazon is still solvent but losing their center core; WalMart is on a slow trek to Sear's, McDonald's is struggling to maintain a market share, they're serving Egg McMuffins 24/7.", "score": 1, "replies": []}]}]}, {"body": "Sounds like everything in the modern world. Housing, job opportunities, education, healthcare, environment etc", "score": 3, "replies": []}]}, {"body": "And then selling the solution to automate to those who haven't caught up yet. Amazon specifically is tailored to usher this in, not just in a Mechanical Turk kind of way, but with an actual software / infrastructure solution.", "score": 8, "replies": []}, {"body": "haha exactly. Dont think Jeff is all the sudden a charity guy", "score": 5, "replies": []}, {"body": "Classic. Pulling up the drawbridge.  Operate at \n, or just beyond the very lower limits of law, make your money, then agitate for better laws.\n\nZuckerberg is doing this right now.   Make his billions on the fringes of privacy law,  now advocating for legislation to stop others doing the same", "score": 5, "replies": []}, {"body": "Spot on. Besides Walmart he's talking to cosco who has been more aggressive raising wages with much less to work with. He's the bad guy he's talking about. \n\nCongratz Jeff you beat cosco by 1$ per hour when their company is worth 1/10th of yours.", "score": 3, "replies": []}, {"body": "In a nutshell, this was my precise thought.  Amazon have invested a lot of effort and money in automation; and as an online retailer do not carry most of the higher costs that Walmart, Target, etc. all have to shoulder.", "score": 1, "replies": []}, {"body": "Yes. You see the truth.", "score": 1, "replies": []}, {"body": "So, they played the game well ?", "score": 1, "replies": []}, {"body": "Yeah, but I can't blame them if it's more profitable. They are not charities. I blame our democratically elected government that theoretically should work for those laborers yet either passively stands by under Democrats or actively works against them under Republicans.\n\nThis goes along with my belief that if you can't offer an employee a living wage, you should not hire that person. You're just mooching off our welfare for profits and essentially enslaving someone who needs that job but has no hope of improving their lot.", "score": -5, "replies": [{"body": "It will actually cause their costs to go up as well, but will allow them to either raise prices by more or undercut the competition, as all of their competitors will see bigger cost increases. \n\nI tend to lean more libertarian-ish than I think you probably do, just because you tend to see this kind of alliance of bootleggers and Baptists often, and a lot of well intentioned policies end up having less than ideal outcomes.", "score": 7, "replies": []}, {"body": ">This goes along with my belief that if you can't offer an employee a living wage, you should not hire that person. You're just mooching off our welfare for profits and essentially enslaving someone who needs that job but has no hope of improving their lot.\n\nThis doesn't make sense to me. You'd rather have someone unemployed and on welfare than have someone working and on welfare?", "score": 6, "replies": [{"body": "I think they meant that it’s the responsibility of the employer to ensure they can pay a worker a living wage. And if not, don’t offer a job and let that person find work elsewhere", "score": -1, "replies": [{"body": "\\>employee provides $20/hr income from work to company\n\n\\>company spends $10/hr to keep business running\n\n\\>employee keeps the other $10/hr.\n\nEmployer and employee mutually agreed to this arrangement. Everything is good. \n\n&#x200B;\n\n\\>employee provides $20/hr income from work to company\n\n\\>company spends $10/hr to keep business running\n\n\\>government demands company pay employee $15/hr\n\n\\>company looses $5/hr on the employee. \n\n\\> employee is fired. \n\n&#x200B;\n\nYou can't legislate the value of labor. Price controls don't work. If employees can find a job with better pay, then don't you think they would? If it's not worth working that job, then they just won't do it. In your comment you're basically admitting that minimum wage laws limit the number of jobs available. Isn't having some amount of income better than nothing?", "score": 4, "replies": [{"body": "I don’t really think I was admitting anything. I meant what I said and nothing more.", "score": -1, "replies": [{"body": "The logical implications of what you said were that people might lose their jobs, but it's for their own good. The political notion that \"it's for your own good\" is incredibly dangerous.", "score": 3, "replies": [{"body": "Worked for Obama.", "score": 2, "replies": [{"body": "Worked for Stalin, Moa, Chavez, Hitler...", "score": 2, "replies": [{"body": "Their methodology only prevails until either the economy collapses or they have reached the point that there is no one left to bribe, blackmail or eliminate. Stalin executed all of the leading medical practitioners way early; with extreme prejudice against the Jewish doctors. All of the ones; including Barry, you and I listed are megalomaniacs for lack of a better term. Too bad Stalin eliminated all those doctors; they were the only ones who might have saved him as he slobbered on the floor of his Dacha. All my life I have recognized that many among us are gullible fools waiting for someone to sway them. This thread is exhibit one.", "score": 1, "replies": []}]}]}, {"body": "The logic is literally: company can’t pay an employee a living wage, so they don’t post a job offer. I don’t understand your attempt of extrapolating arguments to uncover hidden implications beyond the text", "score": 1, "replies": [{"body": "Because your argument makes no sense. You're saying it's better to be unemployed at $15/hr than employed at $10/hr.", "score": 3, "replies": []}]}]}]}, {"body": "I think the issue is that employees aren't getting a fair shake. Profits are rising but wages are not. The large majority of the profit of these large corporations is going to the owners not the laborers. Pushing to raise the minimum wage could fix a little bit of that, but it's still a systemic issue that owners are allowed to profit so immensely at the expense of their employees.", "score": -2, "replies": [{"body": ">but it's still a systemic issue that owners are allowed to profit so immensely at the expense of their employees.\n\nWhy should owner's pay more when the federal government has offered to subsidize low skill worker's wages with social welfare and employees are happy to accept welfare?", "score": 1, "replies": [{"body": "Because employees are absolutely not happy. You're dreaming if you think people are happy to allow uber wealthy business owners to exploit them for every dollar that they can and pay them the absolute minimum. If you're born into money you can be an owner and exploit workers. If you're not born into money, tough luck?", "score": -1, "replies": [{"body": "From the outside- don’t know if you meant to, but you sound like a socialist.", "score": 3, "replies": []}, {"body": "In what world is voluntary labor exploitation?", "score": 1, "replies": [{"body": "In a world where the minimum wage is not a living wage? In a world where a rich owner earns two thousand times more than an average employee does on an hourly basis? Where the poor and undereducated are being taken advantage of by the wealthy who have political and economic power to lobby for laws and policies that allow them to grow their wealth while keeping the masses poor?", "score": -1, "replies": [{"body": "Big business loves big government.", "score": 1, "replies": []}]}]}, {"body": "Stop. Do you; honestly, believe that 62% of the American people are exploited and miserable? All of us poor wage slaves are raging against the machine? Do you work for a living? Just how old are you? God help us if you are in your late twenties and still believe that bullshit.", "score": 1, "replies": []}]}]}, {"body": "You cannot run a company in the US and refuse to share your profits with your employees. They will flee to your competitors who will pay them more. Even large corporations do not run in a vacuum. When you develop and nurture a successful company; regardless if it's a local three employee lawn mowing business or Microsoft, your employees are your main advantage over the other companies trying to take more of the revenue stream available. As an aside; none of the companies mentioned in this thread start their employees at minimum wage. My son worked at McDonald's when he turned sixteen three years ago and his initial hourly wage was 13.20 cents. You have no actual realistic knowledge of what you are saying.", "score": 1, "replies": [{"body": "I don't even know how to respond to something so idiotic. Your son worked at McDonalds three years ago so you have more knowledge about wage disparity in america than I do? I have personally worked a minimum wage food service job, thank you.\n\nI trust 2,000 reported wages from McDonald's workers over your figure. I'll save you a click, the average reported hourly rate is $9.28. That's lower than the living wage in basically every state in america.\n\n[https://www.indeed.com/cmp/McDonald's/salaries](https://www.indeed.com/cmp/McDonald's/salaries)\n\nYou've replied to every one of my comments with insulting and aggressive language. You honestly sound like a child. I feel for your son, best of luck in life.", "score": 1, "replies": []}]}, {"body": "> Profits are rising but wages are not.\n\nWages are rising.", "score": 1, "replies": [{"body": "Take a look at this: https://www.advisorperspectives.com/dshort/updates/2018/10/16/u-s-household-incomes-a-51-year-perspective\n\nThen take a look at this (make sure to choose max data range):\nhttps://tradingeconomics.com/united-states/corporate-profits", "score": -1, "replies": [{"body": "Why would I choose the max data range when wages started outpacing inflation in the last 2 years unless you're just trying to hide the data you don't like?", "score": 2, "replies": []}, {"body": "Troll.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "But but but reddit told me the minimum wage has zero effect on unemployment!!", "score": -2, "replies": []}]}, {"body": "He is doing this to get his entire competition to raise the cost of their labour while bezos is so close to automation he can taste it. \n  \nThen when you have a massive automated workforce and your competitors are all locked into expensive work payrolls you win.\n  \nIts a long con.", "score": 50, "replies": [{"body": "McDonald's did this, too.\n\nThey're ready to automate like crazy", "score": 13, "replies": []}, {"body": "Amazon is nowhere close to automation. It's still at least a decade away.", "score": 1, "replies": [{"body": "Really? Interesting. AMZN used less workers this holiday season than any other holiday season. 20,000 fewer. It's aquisition Kiva systems a company that BUILDS warehouse robots. The times did a doc on Amazon's palletizer robots, and shows straight up that this isnt that far off. Certainly not a decade. \n \nBezos knows he can lobby hard to increase wages and cut into his competitors profits and suffer with them because automation is his ace up his sleeve. When everyone finally catches up to a livable wage he will slap it down on the table and announce lay offs.", "score": 14, "replies": [{"body": "Could it be because amazon switched many positions to 1099 instead of W2?", "score": 3, "replies": []}, {"body": "Having robots pack individual boxes is still far off, yes they do have robots that already pick the product to pack but they still need to pack it and then load those packed boxes into a truck. \n\nI spoke with an Amazon Ops manager and although he said that is something that Amazon wants to move forward with, it's still some way off considering that the robot has to determine which size box to pack and also how would it load an 18 wheeler.", "score": 1, "replies": [{"body": "Its the things that are not square. that cause issue. Amazon could easily mitigate this by requiring sellers to pack all items in packages with specific dimensions. Or at least note those specific dimensions. Once items are able to be palletized they are loaded onto a truck with no human interaction needed. Its getting all those odds and ends into a standard size box that can be palletized that is needed for humans right now. They system knows what boxes things need to be in (the reason you get a battery in a giant box with some bubble wrap) they just need the human portion to put the battery into that box. \n\n&#x200B;\n\nStandardizing the items before they get to the palletization process would eliminate the need for a human to repackage the item.", "score": 2, "replies": []}]}]}]}]}, {"body": "Weirdest rap battle ever", "score": 12, "replies": [{"body": "He's a goofy eminem", "score": 3, "replies": []}]}, {"body": "I could write a lengthy post about how piss poor the working conditions in amazons warehouses are but just read the source yourself https://www.google.com/amp/s/www.newsweek.com/amazon-drivers-warehouse-conditions-workers-complains-jeff-bezos-bernie-1118849%3famp=1. Hypocrite.", "score": 36, "replies": [{"body": "they only pay well because it's the only way to get people to withstand the conditions haha", "score": 19, "replies": [{"body": "Probably cheaper to pay people to deal with poor conditions vs spending money to actually improve conditions.", "score": 9, "replies": [{"body": "they would need more workers to improve conditions, so definitely cheaper.", "score": 2, "replies": []}]}, {"body": "That's pretty much every warehouse ever, it's a shitty job.  I remember making $16/hr working in a freezer warehouse 15 years ago.  Thought it was awesome initially, only lasted a year and quit for a $6/hr pay reduction.  Fuck that job (this is in Ontario for the record).", "score": 5, "replies": []}]}, {"body": "Amazon warehouses are considerably better than the competition.", "score": 0, "replies": [{"body": "That's simply not true. Mind you, most of my experience is with non-profit warehouses but still. Amazon is not \"considerably better\" by any stretch of the imagination.", "score": 1, "replies": []}]}]}, {"body": "Ok, now can Bezos match BoA and go.up.to $20? I know BoA is not a retailer but that was a good stunt they pulled the other day", "score": 39, "replies": [{"body": "Bank jobs are much lower in potential working hours than amazon", "score": 17, "replies": [{"body": "And Amazon is the most valuable company in the planet, and Bezos the richest man. I'm sure they can raise they're minimum wage for their warehouse worker to $20 an hour.", "score": -10, "replies": [{"body": "Do you even know the name of their CFO?", "score": 10, "replies": [{"body": "Why is this relevant? Do you know who’s on their board of directors?", "score": 0, "replies": [{"body": "No, but I’m not making financial tough-guy statements about how a multi-billion dollar company should increase their operation costs by up to <25%.\n\nKnowing who the CFO at minimum will explain to me if you are familiar Amazon’s business practices and how they operate on a corporate level. Many people speak about Amazon like Bezos decides everything, does nothing and pockets 99% of the cash.", "score": 12, "replies": [{"body": "Okay, that’s a fair response and for the most part I agree with you. And yes I agree that people calling for immediate minimum wage increase don’t fully understand the shock that raising wages would create", "score": 3, "replies": [{"body": "A good rule of thumb when you suggest a number is to figure out what % increase that is.\n\nI’m not convinced raising the minimum wage is great for the economy as a whole. I see it as a more rapid inflation rate which reduces the middle class ironically increasing the gap between the lowest and the highest paid since the people who have the money on the lower end of the salary scale are always going to face increased costs.\n\nI’d prefer if we as a society legally defined the minimum quality of life a fully employed person should have and have every job provide the current salary rate as a minimum with an additional salary based on performance of the company& job role and an annual bonus based on personal performance.\n\nAnd I mean that these rules should only apply to large businesses and we should take into consideration ownership by a conglomerate for smaller companies.\n\nWe can have a society that works for everyone, we just need to stop entertaining failed and vestigial ideas from past administrations and crack down on the monolithic behemoths that be.", "score": 3, "replies": []}]}, {"body": "Love the white knights who run around defending the most powerful companies on earth.", "score": -7, "replies": [{"body": "Sorry to shatter your echo chamber with a different opinion from a person with a different world view to your own. I don’t mind name calling, it just shows you don’t have anything to bring to the conversation.\n\nDo you get mad at gorillas for having larger muscles than you?", "score": 6, "replies": []}]}]}]}]}, {"body": "Why not make it $50?", "score": 3, "replies": [{"body": "Now we’re cooking", "score": 2, "replies": []}]}, {"body": "There are literally millions of Amazon shareholders other than Jeff Bezos... You can't just selectively hurt one shareholder of one of the biggest publicly-traded companies in the world.", "score": 2, "replies": []}, {"body": "Companies don't work for their employees, they work for the shareholders. This isn't bad or evil, it's how our economy and almost EVERY company works.\n\nRaising min wage at Amazon doesn't help the shareholders right now, it won't happen.", "score": 1, "replies": [{"body": "As a shareholder; I agree with this statement. If Amazon does not pay working wages then they cannot run a profitable company. If they are no longer making a profit then I; along with about twenty million independent investors will sell, and FANG will become FNG. All publicly traded companies are obligated to perform efficiently and effectively or us folks backing them will move on to greener pastures,", "score": 2, "replies": []}]}]}]}, {"body": "Different sectors different market wages", "score": 7, "replies": []}]}, {"body": "Temporarily this is \"good\" for employees, but these tactics are gross at best and scummy at worst.", "score": 19, "replies": []}, {"body": "\"Worlds richest retailer ignominiously invites competitors to slice their own throats to cement growing monopoly\" could be another headline", "score": 11, "replies": []}, {"body": "So... work them to death for what’s barely a living wage and make them fear losing their job if they have to pee? Cool cool cool", "score": 4, "replies": []}, {"body": "Pissing into a diaper in a freezing warehouse? The benys keep raining down on us!!", "score": 3, "replies": []}, {"body": "They pay their software developers shit though. I work at Facebook and their offer was literally 2x the compensation that Amazon was willing to pay.", "score": 3, "replies": []}, {"body": "ITT: Amazon haters that probably use Amazon Prime every week.", "score": 9, "replies": []}, {"body": "Walmart strikes back:  [https://twitter.com/danbartlett6/status/1116345822130712577](https://twitter.com/danbartlett6/status/1116345822130712577)", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "They’re not replacing humans. They employ over 600,000, nearly double what they employed 2 years ago.", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They lease the warehouses.  Someone else is building them.  The automation narrative is PR, like drone delivery.  \n\n> Amazon Robotics VP Brad Porter told The Information. \"When it comes to using robotic manipulation for item picking, while we're encouraged by the work in the research community, the simple fact is the current state of the art is not capable of handling the diversity of Amazon's product selection.\" He added that humans are also more capable of responding to problems, like catching a leaking bottle of detergent before it's shipped out, for example. https://www.engadget.com/2018/10/12/amazon-building-picker-robots-fulfillment-center/", "score": 1, "replies": []}]}]}]}, {"body": "Am I the only one who thinks that Bezos is a big fraud? Really don’t like this guy", "score": 10, "replies": [{"body": "PR, he’s a businessman 😐", "score": 19, "replies": []}, {"body": "You are in a wrong sub then, who invests in stocks because you “like” some guy? Just find a way to make money, not care about the personality", "score": 14, "replies": [{"body": "I don’t ‘’like’’ the effect Amazon have on the economy, just wait until there is only one retailer in the US.\nAWS should have been forced to be spun off a long time ago, there is no way to compete with a retailer who is selling things at a loss. Amazon is an abomination, I guess everyone is going to understand that when it is too late", "score": 4, "replies": [{"body": "Theres no way to compete because Amazon is pretty genius about finding a very profitable business model, killing competitors while raking cash. Other top companies could have done, but bezos was way better at the executions. Dont try to use any of amazon product, and see how uncomfortable your life is", "score": 4, "replies": [{"body": "Very profitable business model?! If you take out AWS Amazon is losing money and have been losing money for more than two decades now. In a normal market economy this thing would have been extinct years ago. Their competitive advantage is selling products at a loss. Once they eradicate all of the competition they are going to boost their prices and you will have the chance to shop at either Amazon or Amazon.", "score": 11, "replies": [{"body": "Amazon is not just an ecommerce company, wake up! Amazon is a combination of different fields, ultimately making the entire company very profitable. Idk why some ppl just stuck on analyzing amazon only on “selling items at a loss.” Do you not understand what bezos did earlier and how recent startups are copying his business plan? Just dont invest in amazon, ill keep investing and continue my 100% increase. Bezos is smarter than your entire family generation can ever be. Just trust the guy", "score": 3, "replies": [{"body": "Sarcasm or lunatic, cant decide.", "score": 4, "replies": [{"body": "Both, in eyes of those who couldnt and still cant ride on the amazon train", "score": -2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "You definitely use services USING Amazon services\n\nAWS provides solutions to a lot more companies than you’d think, to the point of keeping some afloat in today’s big data, big internet-traffic world. Netflix found it much cheaper to drop all their infra and use exclusively AWS, GE cut operating costs by nearly 50% moving internal apps and pipelines to it. Others on AWS include AirBnb, Lyft, McDonald’s, Kelloggs, Sony, Spotify, NASA,  SoundCloud, Yelp, SquareEnix, several US fed departments, even the NASDAQ OMX!", "score": 1, "replies": []}, {"body": "You sound as equally dramatic as my comment. \n\nGood stuff. Amazon still has a market to penetrate in US! Long amzn", "score": -2, "replies": []}]}]}, {"body": "I agree. Amazon will continue to try to monopolize the retail space because it's their only avenue for growth at this point. But at this point it is becoming detrimental to the economy, whereas I believe when they were a market disruptor to Walmart it was a net benefit. \n\nI do not invest in Amazon because I hope our government will do it's job and apply anti-trust laws to maintain a competitive market. That may not be the case and Amazon may continue to dominate but I don't want to be a part of such growth.", "score": 2, "replies": []}, {"body": "At some point Amazon can't be taking a loss on their retail side.  Once they stop taking a loss they won't have an easy time.", "score": -1, "replies": []}]}, {"body": "I don't like ea, but their stock has made me a lot of money. Bought low, sold before the crash, bought low again.", "score": 1, "replies": [{"body": "Thats all it matters in investment. These people are getting so emotionally attached to stock market, what a dumb idea", "score": 3, "replies": []}]}, {"body": "Ethics are an important part of business. They drive sustainable profits. If you ignore ethics, you can find that the market is much more volatile and this is bad for long-term returns.", "score": -1, "replies": [{"body": "Ethics as in destroying competitors is a bad part? Amazon seems to be good at following their code of ethics for internal employees", "score": 2, "replies": []}]}]}, {"body": "Do you think any business owner is not a complete asshole? It's a requirement to get to the top. You have to be ok with manipulating, exploiting and backstabbing. The weak are culled.", "score": -10, "replies": []}]}, {"body": "Obviously this is a PR move, but it's shocking how critical people are of everything. Yes, Amazon is using this to hide poor working conditions and yes they are going to automation.\n\nBut one of their competitors in Walmart has horrible treatment of workers as well. This doesn't justify it, but signals to me that this is a widespread issue in the retail sector that the government should address. Company ethics should exist, but end of the day right now the wage for multiple workers has increased and we are complaining about an industry wide problem that the government should be addressing.\n\nAnd the whole automation thing is even crazier to me. People understand that automation is the future, but seem to throw a fit whenever any steps toward it are made. Of course automation will hurt the retail workers, just like renewable energy hurts coal miners and self driving cars will hurt taxi/Uber drivers. As a business, why should Amazon be criticized for optimizing their processes and improving their systems? Their goal is to make money when possible", "score": 2, "replies": []}, {"body": "Says the guy that paid 0 in Federal taxes and cut the whole foods emoyees hours after raising the minimum.", "score": 3, "replies": []}, {"body": "Says the company that profited 12billion and didnt pay any taxes.", "score": 3, "replies": []}, {"body": "Working at Amazon is harder.   You can be a lazy overweight woman and do some easy task at Walmart and just collect a paycheck. Amazon has to pay more since no one would work for them if they didn't.  They are still probably paying the bare minimum that they can to maintain their workforce.", "score": 2, "replies": [{"body": "Walmart sales associates walk anywhere between 7-12 miles a day. Poverty and poor nutrition education lead to higher rates of obesity.", "score": 2, "replies": []}]}, {"body": "So basically he said a \"come at me bro\" but in retail form", "score": 1, "replies": []}, {"body": "Umm, peeing themselves? I’ll take a pass brah.p", "score": 1, "replies": []}, {"body": "When you are excused from hundreds of millions in taxes, yeah, you should probably pay people somewhere near a living wage", "score": 1, "replies": []}, {"body": "Too bad he keeps most of his warehouse staff as part time, even though most work over 8 hours a day, just to not have to let them have benefits.", "score": 1, "replies": []}, {"body": "pay your taxes first lmao", "score": 1, "replies": []}, {"body": "\"I have to pay MacKenzie how much? ..raises for everyone!\"", "score": 1, "replies": []}, {"body": "Let’s compare apples to apples. Amazon’s workers are not the same those at Walmart and Target. \nWalmart’s warehouse worker makes [$15 dollars per hour](https://www.glassdoor.com/Hourly-Pay/Walmart-Warehouse-Worker-Hourly-Pay-E715_D_KO8,24.htm) on average. \nCan’t compare a cashier to a warehouse employee.", "score": 1, "replies": []}, {"body": "A lot being read into those lines. People make companies. Min wage impacts the lower skilled workers. Automation or not I think this really is just a knock on other companies who have yet to follow suit. Just good old american shit talking IMO.", "score": 1, "replies": []}, {"body": "**\"I love you, alive girl!!!!!!\"**", "score": 1, "replies": []}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/yangforpresidenthq] [The topic of Automation and how it will affect the job market is spreading.](https://www.reddit.com/r/YangForPresidentHQ/comments/bc6cgz/the_topic_of_automation_and_how_it_will_affect/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 1, "replies": []}, {"body": "Bezos has been paying them $15 for only like 6 months.  And most of those jobs have terrible conditions", "score": 1, "replies": []}, {"body": "Doesn't seem like the whole \"$15 wages are communism\" narrative is doing so hot right now.\n\nWhen the most successful business on the face of the planet are actively spitting in that narratives face it kind of loses its ground.", "score": -2, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - April 11, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q419 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/alewpn/tesla_q4_2018_financial_results_and_qa_webcast/).", "id": "bbxmyf", "created_utc": 1554973474.0, "score": 9, "upvote_ratio": 0.92, "num_comments": 115, "comments": [{"body": ">“We will of course continue to make new investments in Gigafactory 1, as needed,” a Tesla spokesman said in an emailed statement. “However, we think there is far more output to be gained from improving existing production equipment than was previously estimated.” [source](https://www.bloomberg.com/news/articles/2019-04-11/tesla-panasonic-freeze-expansion-of-gigafactory-nikkei-says)\n\nSo while Panasonic is clearly watching demand, there are likely decisions being made on whether to build more factory space/machines or optimize existing machines/process. This might also be tied to Maxwell.", "score": 11, "replies": [{"body": "Sounds like that time back in the middle of November when Tesla said they'd need minimal additional capex to get Model 3 production up to 7k per week, but yet they only were able to produce 4,850 per week during Q1.", "score": 9, "replies": [{"body": "We have zero idea of what their true run rate is, nor do we know if they've spent time on the improvements they mentioned last year. Lots of factors here, and yes, demand could be one of them.", "score": 3, "replies": []}, {"body": "This was also in regards to the Fremont assembly lines.  If they are cell/pack constrained, there is nothing wrong with this, and makes sense as Panasonic has been adding new lines to Giga.  I don't know if they've spent the capex at Fremont yet, but why would they until they could use the additional capacity?", "score": 2, "replies": [{"body": "I'm not saying the fact that they haven't increased production more substantially is necessarily a bad thing, I'm just pointing out that the company routinely makes statements about their output that turn out to be nonsense.", "score": 6, "replies": []}]}, {"body": "That doesn't actually make them wrong.  They may have needed a lot of time to make the upgrades rather than capex.  \n\nGiven the newness of the technology surprises on the upside are much more likely compared to the mass production of gas cars.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Man he is really unloading.", "score": 1, "replies": [{"body": "I don't think anyone but Ol' Musky actually uses their options to buy stock.", "score": 1, "replies": [{"body": "He's dumped thousands of shares 5 or 6 times in the last 30 days.", "score": 1, "replies": [{"body": "If you mean Musk, he *has* bought them previously (even outside the $420 fines). Not always, obviously.", "score": 1, "replies": [{"body": "No, I mean Gracias has unloaded lots and lots of shares in the past month.", "score": 1, "replies": []}]}]}, {"body": "Technically he uses them and then sells the shares immediately. Pretty sure those options can't be sold on the market.", "score": 1, "replies": []}]}]}]}, {"body": "So uh... -4% premarket?", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "maybe a reaction to the news Tesla will release the Q1 Earnings Report early?", "score": 2, "replies": []}]}, {"body": "As Elon Musk would say, \"Blue skies and sunshine in Shortville!\"\n\nEdit: In case anyone doesn't remember this gem from April 3, __2017__ when TSLA closed at $298.52, 11.5% higher than it currently is in pre-market: https://twitter.com/elonmusk/status/848935705057280001?lang=en", "score": 5, "replies": []}]}, {"body": "I am blown away the stock is only down ~2.8% today. That's a huge gift for bulls, tbh.\n\nPanasonic is the single largest investor in Tesla's business from an operating standpoint (not shareholder, but investor in the operations). It effectively controls the supply of the most critical products (batteries) and the quantities in which they flow to Tesla. \n\nPanasonic has a role in just about every one of Tesla's product lines. It's probably the only supplier with that kind of visibility into Tesla, and it's been with Tesla for years. It understands Tesla inside and out.\n\nSo for Panasonic to come out and say it's worried about demand and will revisit investing more money into Tesla is really something. \n\nThat Tesla came up with a seemingly unplanned investor day about autonomous vehicles for later this month suggests that the only interesting story left to tell at Tesla is software. \n\nThe hardware/manufacturing story is not good right now, and Tesla wants to rebrand its investor story as one all about software. Software, conveniently, can't be measured as easily as the number of cars that roll off the line. Elon can say they're already there to FSD and people might believe it. He can't say \"we're producing 10k cars a week\" when the numbers every quarter say differently.\n\nI suspect Tesla moved up its quarterly earnings date because it's going to try to raise capital on the autonomy story in the near-term. We'll have to see if Tesla can convince Wall Street to ignore the problems on the hardware side.", "score": 14, "replies": [{"body": "Musk often falls short on promises.  He promised cross country FSD two years ago and may only deliver 5 miles of FSD two years late.\n\nIts quite probable that Musk is overpromising on the software side.  But I think their progress has been good enough to justify a higher valuation than the current one.", "score": 3, "replies": []}, {"body": "The only thing that's been said is that there's sufficient battery infrastructure at GF1.  There's tons of reasons why this could be including process improvements, new partners, and even technology shifts.  It's also possible Panasonic is saving face for an error on their end as their head of battery storage was replaced a month or two ago. We just don't know and probably won't until the week of the 20th.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "[This article](https://asia.nikkei.com/Business/Companies/Panasonic-cuts-Tesla-risk-with-Gigafactory-freeze) has new info. It looks like the same article, but it isn't.", "score": 5, "replies": [{"body": "Most notably:\n\n>Tesla CEO Elon Musk often calls Tsuga directly to press for lower battery prices, Panasonic sources say. \n\nPanasonic isn't making money on the Gigafactory. \n\n>Operating losses in Panasonic's Tesla battery segment are estimated to have widened sharply in the year ended March 31, to 20 billion yen.\n\nLooks like Panasonic is in \"recoup our investment\" mode and won't be so generous on terms. If Tesla isn't going to grow in the US, and CATL is doing the China business, Panasonic has no incentive to sacrifice margin for future business that it isn't going to win.", "score": 10, "replies": [{"body": "I understand this to mean that their Tesla operations would be profitable if they could sell the batteries they produce and possibly are operating their lines slower than their max capacity to match demand.  \n  \nSo they want Tesla to ramp anything with a 2170 in it before they put money into expanding capacity. I don't think they would build a factory that would never be profitable, so that would mean it's either not running at capacity or they have millions of cells of overproduction waiting to be bought by Tesla.  \n  \nDid I understand that correctly?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "And yet the stock is down over 3%.  Maybe you are wrong, maybe the institutional traders managing billions of dollars are wrong.  I guess we'll never know....", "score": 2, "replies": [{"body": "He said move it beyond the initial drop. Apologize!", "score": -1, "replies": [{"body": "Not until he gets rid of that little asterisk next to his post!", "score": 2, "replies": []}]}]}]}]}, {"body": "Paywall. Can you copy the relevant bits?", "score": 1, "replies": [{"body": "/u/stockbroker copied the new relevant info. There is not a lot of it.", "score": 1, "replies": []}]}]}]}]}, {"body": "[https://news.yahoo.com/1-panasonic-says-reviewing-further-100749168.html](https://news.yahoo.com/1-panasonic-says-reviewing-further-100749168.html) \n\nUpdated w’ response from Panasonic:\n\n“Panasonic Corp is studying further investments in battery production at its Gigafactory venture with Tesla Inc, the company said, responding to a media report that the two companies had frozen previous plans.\n\n\"Panasonic established a battery production capacity of 35GWh in Tesla's Gigafactory 1 by the end of March 2019 in line with growing demand,\" Panasonic said.\n\n“Watching the demand situation, Panasonic will study additional investments over 35GWh in collaboration with Tesla.\"”", "score": 6, "replies": [{"body": "So if demand warrants it they'll invest more, but right now they are suspending further investments based on their current view.  I'm not sure that adds anything to what was in the original article.", "score": 5, "replies": []}, {"body": "Translation: \"We've hit the maximum we budgeted for. We are reviewing whether we need to (and can afford to) increase the budget.\"\n\nEDIT: \"We\" = Panasonic", "score": 1, "replies": []}, {"body": "Hopefully this is the first harbinger that Tesla is going to kick Panasonic to the curb. They are just a waste of space if Tesla plans to transition to DBE cells as it’s a totally different production.", "score": -2, "replies": []}]}, {"body": "Why no official response from Tesla?", "score": 3, "replies": [{"body": ">Panasonic Corp and Tesla Inc are holding off on further investment in the U.S. electric carmaker’s Nevada Gigafactory while they squeeze more out of existing resources and study market demand, the companies said on Thursday. \n\nhttps://www.reuters.com/article/us-tesla-gigafactory-panasonic/panasonic-reviewing-further-investment-in-tesla-gigafactory-idUSKCN1RN117", "score": 4, "replies": []}, {"body": "They did, see my post below.", "score": 5, "replies": []}]}, {"body": "[Tesla and Panasonic freeze spending on $4.5bn Gigafactory](https://asia.nikkei.com/Business/Companies/Tesla-and-Panasonic-freeze-spending-on-4.5bn-Gigafactory)\n\nTesla lost their [battery supply chain negotiator](https://www.benchmarkminerals.com/vivas-kumar-joins-benchmark-minerals-from-tesla/) yesterday too.", "score": 9, "replies": []}, {"body": "Everyone is reading way too much into it. They just finished the ramp up. They’re not going to invest an immediate 4.5B to make more batteries than necessary in consideration of their car production. Where would they pile up the extra batteries?\n\nThe decision makes sense. The acquisition of Maxwell also comes into play. \n\nAnd i’m not certain, but that 4.5B would impact potential profits? Making the S&P500 asap would be better for their growth right now.\n\nEdit : whoops, wrong topic...", "score": 4, "replies": [{"body": "> Making the S&P500 asap would be better for their growth right now.\n\nlol", "score": 11, "replies": [{"body": "I know it sounds funny, but it would show that Tesla’s growth is sustainable to everyone in doubts.", "score": -2, "replies": [{"body": "Making the S&P500 should realistically not matter in the slightest in that regard. The underlying financials, yes.", "score": 7, "replies": [{"body": "Making the S&P 500 is critical to ending the volatility of Tesla's share price.", "score": 1, "replies": [{"body": "Sorry, but I don't see why the volatility is a problem for Tesla. I thought that was only relevant for short term investors and speculators", "score": 6, "replies": [{"body": "Tesla has near term problems related to the model 3 ramp which may require an equity raise due to high interest rates associated with the negative perception of the company.\n\nInclusion in the S&P 500 would engender a bunch of goodwill from very large market making institutions and their clients. The perception of the company would improve and an equity raise would be avoided.", "score": 1, "replies": [{"body": "In that regard yes, but I would take a wild guess and say S&P inclusion is not gonna happen short term, where Tesla needs an equity raising.", "score": 2, "replies": [{"body": "They will be included after q2.", "score": 1, "replies": [{"body": "But will they still get included if Q1 is not profitable?", "score": 2, "replies": [{"body": "As long as they have 4 quarters that are profitable as a whole.  q1 would have to be a big loss for that to be the case given q2 guidance.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I think the market just really doesn't like a cautious Tesla. They would rather they take more risk and grow as fast as possible, but Elon has been being really safe since the model 3 production hell.", "score": 1, "replies": [{"body": "Tesla has always pushed Panasonic to build battery capacity ahead of demand with the promise it would buy all the batteries it could produce in real time.\n\nPanasonic puts its money at risk in this deal by investing in the capacity. In a perfect world, Tesla can afford to buy all the batteries it can produce because Tesla can sell enough cars to always need the batteries.\n\nPanasonic is the weak link here. This isn't about Musk being cautious. Panasonic doesn't want to risk more money in this business before its proven that all the money it invested to date will actually generate something for itself. \n\nAs the Nikkei article states:\n\n>Panasonic's Tesla EV battery business had operating losses exceeding 20 billion yen in the financial year that ended in March, up from a year earlier. The losses were exacerbated by delays in the start of production of the Model 3.\n\n>Tesla's unit sales fell about 30% in January to March versus the previous quarter, hurt by slower growth in China, smaller tax breaks for electric vehicles and problems with logistics. This has made the companies more cautious about the future, although they plan to continue joint operation of the plant.", "score": 4, "replies": []}]}]}, {"body": "I was just doing some napkin math... it seems to me that unless they are planning on switching S/X to the same cells as model 3, they already have at least a third more capacity than they need for even the upper end of their sales estimate this year.\n\nI don’t really see why, based on any of Tesla’s statements or even Elon’s more optimistic estimates, they’d actually need more battery capacity than 35 GWh until perhaps mid/late 2021 when more models have ramped up\n\nSeeing that the stock went down though I assume I’m missing something here, or messed up my math?", "score": 5, "replies": [{"body": "Tesla's current stock price is based on the assumption that car production numbers will continue to ramp up quickly in the future while the cost of producing cars continues to decrease (or at least stay constant). The fact that Panasonic appears to not be interested in investing more capital in order to increase future battery production capacity means that either:\n\na) Tesla will not be able to increase car production past a certain point due to not having enough batteries, or \n\nb) Tesla will have to find batteries from a different (presumably more expensive) source, which increases costs since batteries are a very expensive component.\n\nBasically, Tesla's valuation is based more on the company's future profitability rather than its near-term profitability, and this news throws some of that future profitability in doubt since the company's future profitability is based in large part on the ability to have a large supply of cheap batteries at all times.", "score": 8, "replies": [{"body": "I understand that, however I don’t think anyone expects Tesla to be making many more than 500k vehicles annually in the US until more models start becoming widely available in 2021+ (Y, pickup, etc). So it seems to me that the current capacity is enough to supply cells for even bullish estimates of near-term demand.\n\nI guess I’m implicitly assuming that once we get closer to model Y production time, more capacity investments will be made. However it seems totally illogical to me to make those capacity investments right now, 2 years ahead of when they will be needed.", "score": 2, "replies": [{"body": "Capital investment for even a small projecttakes at least 2-3 years to go from initial planning to actually being used in production. A lack of additional investment currently being planned means that it'll be at least 2-3 years until battery capacity increases (likely longer though since it seems like Panasonic can't make money off of battery production at the prices that Tesla is asking for).", "score": 5, "replies": []}, {"body": "Also the Gigafactory in China will be producing batteries, and I think Elon said it will match/exceed the current capacity of GF1.", "score": -1, "replies": [{"body": "Do you have a source for this? My understanding was that Tesla was looking to source batteries from Chinese suppliers for GF3. They might assemble the battery packs in GF3 (possibly even the modules, but I doubt that). I find it doubtful they would be manufacturing their own battery cells in the Shanghai facility.", "score": 2, "replies": []}]}]}]}, {"body": "I reach a similar conclusion:- [https://www.reddit.com/r/teslamotors/comments/bc3uuf/tesla\\_disputes\\_todays\\_gigafactory\\_fud\\_story/eko9l7x?utm\\_source=share&utm\\_medium=web2x](https://www.reddit.com/r/teslamotors/comments/bc3uuf/tesla_disputes_todays_gigafactory_fud_story/eko9l7x?utm_source=share&utm_medium=web2x)", "score": 1, "replies": []}, {"body": "Then why is the wait for powerwall so long?\n\nSome people have been trying for YEARS to buy one.", "score": 1, "replies": []}]}, {"body": "Here is my opinion on Tesla right now:  I am 100% confident they will be first to market in autonomy.  I believe they will be a market leader in automation in not just vehicles but manufacturing, agriculture, and more.  Obviously this is worth a ridiculous amount of $$.   However, I'm worried about the runway between now and getting to full autonomy.   I would really like to see signs of improving demand in Q2.   We saw some good signs near the end of Q1 but we are still seeing a 6 - 8 week delivery estimate on standard range model 3.   Tesla will live on no matter what.  But the value of their current public shares is hard to gauge.  It looks like they need to raise money.  Autonomy day should be the start of a capital raise.  I don't know how many investors will see the potential I see in Tesla's automation technology.   We shall see.   But I have pared down my stake in Tesla.\n\nReminder:  This is not investment advice.  Do your own research.", "score": 5, "replies": [{"body": "Agreed, I think the same thing. \n\nBut it’s going to be a lot harder to raise now, since the Panasonic news makes it unclear how they will expand. How do they grow past the 500,000 cars per year number? That’s a lot to do, and release the Y which doesn’t have a factory yet.\n\nhttps://www.reddit.com/r/teslainvestorsclub/comments/bbw7x8/comment/ekmbz1o?st=JUCTFWWC&sh=62017768", "score": 7, "replies": [{"body": "> How do they grow past the 500,000 cars per year number?\n\nAre you not aware that they are building a factory in Shanghai as we speak? I would bet you almost any money that this will push them over 500k for 2020.", "score": 0, "replies": [{"body": "Are you not aware that is for 3000/week run rate for the model 3. To hit 7000/week, combined with the 2,000/week S and X run rate to get to 500,000 a year. (Yes the math doesn’t add up, but that was the last guidance. I think it didn’t assume increased 3 capacity at Fremont)\n\nAlso Shanghai doesn’t have any battery manufacturing or pack assembly lines planned last time it was discussed. Also the site in fairly small compared to Fremont so I don’t think it’d fit.\n\nAlso Musk said the most likely place to manufacture the Y is Giga.\n\n(So yea, I’m aware of “a little place called Shanghai”)", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "the only way that could happen is if others were able to sell it in a consumer car too.  Tesla will sell everything they can make once FSD works.", "score": 2, "replies": []}, {"body": "Lol. Existing investors would never let bankruptcy happen. Autonomy is worth 100s of billions of dollars.", "score": -1, "replies": [{"body": "> Autonomy is worth 100s of billions of dollars.\n\nWhen?", "score": 10, "replies": [{"body": "Apply whatever time frame and discount rate you want. It's still worth more than Tesla's entire current valuation.", "score": -3, "replies": [{"body": "That assumes they hold the technology solely.\n\nThe longer the time frame, the less advantage they have.", "score": 7, "replies": [{"body": "Not at all.  \n\nThe avoided insurance costs of autonomous driving are 800 billion a year in the US alone. The amount of money to be made if you have 5% of the autonomy market is astronomical.", "score": -2, "replies": [{"body": "But Tesla doesn't pay the insurance, the car owner does. That's a consumer benefit, not producer", "score": 1, "replies": [{"body": "Here's an hour long talk by a stanford prof. on the kinds of things you can expect to happen.\nhttps://youtu.be/2b3ttqYDwF0", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "My default assumption is that demand improves in Q2, but you see another cliff in Q3.  So the time to take profits in my opinion would be about half way into Q3.\n\nThat being said I've pared back from larger positions in the past.", "score": 3, "replies": []}, {"body": "when did you invest. when did you “pair” down ?", "score": 3, "replies": [{"body": "Pare*", "score": 1, "replies": [{"body": "looks like i’ve thought of it the wrong way or at least my own way. i always think pairing down losses against my gains.", "score": 1, "replies": [{"body": "Yeah, it's paring like a paring knife.", "score": 1, "replies": []}]}]}]}, {"body": "> I am 100% confident they will be first to market in autonomy.\n\nCan you give a bit more color on what you mean by this?  \n\nWhat does automation in agriculture refer to?", "score": 5, "replies": [{"body": "The automation of menial labor.", "score": 0, "replies": [{"body": "https://m.imgur.com/dSal1el", "score": 6, "replies": []}, {"body": "In agriculture?  I'm not really sure Tesla has much competency there.  And its not like existing players haven't already solved most menial labor issues: https://www.youtube.com/watch?v=Dvw8IFVAi04", "score": 5, "replies": []}]}]}]}, {"body": "How many more demand levers other than sales are left?", "score": 2, "replies": [{"body": "75% of all electric car sales in the US are teslas, model 3 is one of the best selling cars in every country. I think tesla will grow with the electric market. Europe is pushing countries to be co2 neutral.", "score": 2, "replies": [{"body": "That doesn't really address the point. A demand lever is (roughly speaking) anything that a company can do to increase demand for its products at a given point in time. So sales, adding features, or in this case, leases. By my count the major demand levers left are discounts and advertising. Am I missing anything?", "score": 3, "replies": [{"body": "Leasing was only released in the US so far, so that is one.", "score": 1, "replies": [{"body": "The lease deal sucks though. The implied residual value is around 55% and you don’t get the option to buy it out. I think a lot of people will take their chances on a Model 3 depreciating less than 45% in three years. \n\nThe lease looks like it was introduced to get people to buy. Tesla is pricing it in such a way that suggests it really doesn’t want you to lease.", "score": 1, "replies": []}]}]}]}, {"body": "Advertise, push test drives, lobbying. \n\nWe’ve only had ONE month of overseas sales so there is a ton of demand there. \n\nThe fact that Tesla has survived 15 years with no advertisements is nuts. \n\nLobbying is a big one. 1000:1 payback, easy, on buying laws.", "score": 2, "replies": [{"body": "> We’ve only had ONE month of overseas sales so there is a ton of demand there.\n\nThen how come they already have started selling the SR+ in all overseas markets?", "score": 1, "replies": []}]}]}, {"body": "I'd have to stick it with the bears this time, what kind of schizofphrenic logic is this.", "score": 2, "replies": [{"body": "Your welcome kit is in the mail", "score": 4, "replies": []}]}, {"body": "Meaningless statements fly across the terminal and the stock jumps. LOL\n\n>Tesla spokesperson says both Tesla and Panasonic continue to invest substantial funds into Gigafactory\n\n>Tesla spokesperson says our demand for demand for cells continues to outpace supply\n\nBet Musk drops some hype tweets shortly after market close today.", "score": 3, "replies": [{"body": "Daily volume isn't remarkable at all given the news.  Market is treating the whole thing as a big nothing.  Meandering trading range.", "score": 3, "replies": [{"body": "Yeah, looks like we might end up with just slightly over average volume for the day. We'll see what happens going into close. Any big investor is going to wait until the liquidity party that happens in the last 15-30 minutes of the day to trade.", "score": 2, "replies": []}]}, {"body": "Where did those statements come from?", "score": 3, "replies": [{"body": "Bloomberg terminal. Maybe someone at BBG will write an article soon. Until then, you’ll just have to believe me.", "score": 1, "replies": []}]}, {"body": "Source?  \n  \nBut yeah, that spike in volume.", "score": 2, "replies": [{"body": "Bloomberg terminal. Maybe someone at BBG will write an article soon. Until then, you’ll just have to believe me.", "score": 3, "replies": []}]}]}, {"body": "How long until we see who's financing the leases? That'll be in the 8-k, right?", "score": 1, "replies": []}, {"body": "Dangerous prediction: Stock drops 4% tomorrow, as market is confused by the death of the $35K Model 3.", "score": 1, "replies": [{"body": "I think the introduction of leasing is at least as big of a deal.  And I really doubt the market likes that either.", "score": 1, "replies": []}, {"body": "I was expecting the same, but premarket is up 1.15% atm.", "score": 1, "replies": []}, {"body": "P.S. The SR+ is now available worldwide. I should update my estimate, but I won't. International demand isn't the savior it was supposed to be.\n\nEdit: To the downvoters, man up and share your own predictions.", "score": 1, "replies": [{"body": "You underestimate how strong the grip of europe is, they are pushing electric cars like crazy. Model 3 is the best selling car in a lot of countries.", "score": 1, "replies": [{"body": "Model 3 was the best selling car by revenue in the United States not too long ago. What about now?\n\nLook, man, if demand were that high, Tesla wouldn't be rolling out the SR+ one quarter after rolling out the high ASP cars. Tesla at least got ~1.5 quarters out of the high ASP cars in the US before rolling out the MR.", "score": 3, "replies": []}]}]}]}, {"body": "However, Panasonic shortly after released a statement saying it was studying further investment in its joint battery production venture with Tesla. \"Watching the demand situation, Panasonic will study additional investments over 35GWh in collaboration with Tesla,\" the company said.", "score": 1, "replies": [{"body": "Translation - we aren't putting another dime into the factory unless the demand outlook improves.  The market thinks (quite obviously) that this is bad news.", "score": 14, "replies": [{"body": "Better Translation - you now have enough cells to make \\~500,000 cars in North America.  Since you plan to make less than that until Y spools up, we're going to pause for now.", "score": 9, "replies": []}]}]}, {"body": "[https://finance.yahoo.com/news/tesla-panasonic-freeze-expansion-gigafactory-091234304.html](https://finance.yahoo.com/news/tesla-panasonic-freeze-expansion-gigafactory-091234304.html)", "score": 1, "replies": []}, {"body": "I don't know why everybody thinks the stock should drop, IMO this is a good sign from Tesla.\n\nThey are right now very, very close to produce their own batteries at mass(which they are right now, the new 2170 although not many).\n\nThe only problem I see for this year is that they are just able to produce 400.000(Bottleneck) if I recall it correctly and it is easily scalable.\n\n&#x200B;\n\nSo what do we have here? Tesla being an independent of other Manufacturers. This should be a good sign!\n\n&#x200B;\n\nEdit: words! Guess I hit some bear's 👌", "score": -13, "replies": [{"body": "Battery production is very capital intensive. They're not at the point where they can just spin up their own battery production.", "score": 4, "replies": [{"body": "[Just gonna put a tweet from a fellow bull here:](https://twitter.com/AngelNDevil2/status/1116310827974516736?s=20)\n\n>  \n>  \n>Don’t forget folks - Panasonic already has invested enough at GF1 to produce 35GWHs of batteries per year. If you do the math that can in principle allow Tesla to make 8974/wk M3s with 75kwh batteries. More if smaller range models are considered. [(link: http://electrek.co/2018/10/31/tes) electrek.co/2018/10/31/tes](https://t.co/xgdB4KQAab?amp=1)….\n\n8000 M3 \\* 52 Weeks a year, and we are above 400.000 cars 🤷‍♂️", "score": 1, "replies": []}]}, {"body": "Do you mind putting this into actual sentences?  I'm not really sure what you are trying to say.  If you are suggesting Tesla is going to start manufacturing battery cells themselves, I do not think there has been any indication that is their intent.", "score": 8, "replies": [{"body": "> Do you mind putting this into actual sentences?  I'm not really sure what you are trying to say \n\nChill mate. English isn't my first language... And you seem to understand my main message. \n\n> I do not think there has been any indication that is their intent. \n\nReally? Are we talking about the same company? Maxwell, Gigfactory in Nevada and China incoming, it was just a matter of time for Tesla to look elsewhere for Battery Cells. Don't forget their new self engineered 2170 which are used in the Model 3 right now.", "score": -5, "replies": []}]}, {"body": "But you know Panasonic produces the 2170 cells, right?", "score": 6, "replies": [{"body": "Tesla is producing those batteries in their Gigafactory in Nevada and their lithium supply is also based in Nevada. They are produced since 2017, but saying just Tesla is producing them sounds like its all their tech, it's a Tesla and Panasonic Techship...\n\n&#x200B;\n\n[Source](https://www.bloomberg.com/news/articles/2017-01-04/tesla-flips-the-switch-on-the-gigafactory)", "score": -4, "replies": []}]}]}, {"body": "[deleted]", "score": -17, "replies": [{"body": "This is nonsense dude.  Just think about it for a second - if someone has a sell order in at $290, why are they going to sell if the stock drops to $280?  A bunch of sell orders at a price makes it tough for the stock to go higher than that, but it can't cause the stock to crash lower than that.  A lack of buyers at lower prices causes a crash.", "score": 16, "replies": []}, {"body": "Your buddy doesn't know anything.", "score": 15, "replies": [{"body": "I prefer to give the buddy the benefit of the doubt and assume that this OP butchered whatever his buddy was actually trying to tell him.", "score": 2, "replies": []}]}, {"body": "You misunderstood what your buddy was saying.  He was saying he was \"broker than hell\" because of both his ignorance and participation in the stock market.\n\n....yeah his English isn't great either.", "score": 5, "replies": []}]}]}
{"title": "Tesla and Panasonic freeze spending on $4.5bn Gigafactory", "selftext": "", "id": "bbxvpr", "created_utc": 1554975625.0, "score": 36, "upvote_ratio": 0.83, "num_comments": 132, "comments": [{"body": "Is there any new info here?\n\nWas Panasonic ever  in serious contention for producer in Shanghai given Chinese  funding. \n\nAlso was the expansion cancelled? Or rather is expansion proceeding in line with demand, like was always the plan?\n\nStock price already tanked after delivery report pointed to lower demand, so there is nothing new here.", "score": 16, "replies": [{"body": "This is a non-event.\n\n&#x200B;\n\nFrom Electrek: \\[Panasonic\\] manufactures custom 18650 li-ion cells in Japan for **Tesla's Model S** and Model X vehicles.  \n\nThe Model 3 and model Y use Tesla's own batteries from Nevada, the 2170, which is completely vertically integrated into Tesla's business.  It uses 75% less cobalt than VW's current battery.\n\nTesla is in the process of buying dry cell technology company Maxwell.  \n\n&#x200B;\n\nIf I put those facts together, it spells fewer batteries from Panasonic going forward and ending completely once the S and X get a refresh.   I think Tesla is waiting to see if they can scale the dry cell battery before changing the S and X models rather than even try retooling for the 2170.  Whatever the new battery is, Tesla is going to make it.", "score": 12, "replies": [{"body": "No Panasonic makes the 2170 at Giga for Tesla.\n\nAnd the Maxwell deal hasn’t closed.", "score": 21, "replies": [{"body": "I meant that in the traditional sense of supplier.  It's a Tesla patent, it's a Panasonic production line.    The 18650 was a contracted deal for supply,  2170 is co-developed and Tesla branded.", "score": 7, "replies": [{"body": "There is a lot to that statement. Don’t have time to follow up. But you’re wrong on the details, and right on the impact to Tesla. \n\nPanasonic has a lot of the rights to the cell, and manufacturing. But it’s nothing that would stop Tesla from finding another supplier. They even approved another supplier a few months ago. Honestly the cells Tesla uses aren’t all that special, they can easily find another vendor.", "score": 6, "replies": [{"body": "As you state in the outcome, this is my point exactly!   The press narrative to the investor community makes the context of just \"not expanding\" production like it's a huge distinction, not just \"part of the process\" of planning production and not taking into account other factors.", "score": 5, "replies": [{"body": "I mean I’m not arguing with you, you’re facts are just glaringly wrong. \n\nI don’t take issue with your assumptions, just wanted to interject to provide a little more detail. I’ll find you the supplier contract and Giga agreement later. It’s dry, but interesting.", "score": 5, "replies": [{"body": "No problem.  I'm an investor and I want the most accurate picture I can get of the company free of hype or the WWE smackdown talk that seems to take over everything.", "score": 6, "replies": [{"body": "Agreed", "score": 2, "replies": []}]}, {"body": ">dry, but interesting\n\n🤯🤯🤯🤯🤯🤯🤯🤯🤯", "score": 2, "replies": []}]}]}, {"body": ">Panasonic has a lot of the rights to the cell\n\nLink source? They assemble them but tesla owns the chemistry IP and the 2170 cell itself was invented by a samsung+lg partnership.  Panasonic is just the assembly line employee for North America.", "score": 2, "replies": [{"body": "> The high performance cylindrical '2170 cell' was jointly designed and engineered by Tesla and Panasonic to offer the best performance at the lowest production cost in an optimal form factor for both electric vehicles (EVs) and energy products.\"\n\nIt’s a partnership. So it’s confusing, but Panasonic has Ip in the manufacturing. Look my point isn’t that this is a deal breaker. Tesla can source cells from other vendors, the chemistry isn’t that different from what other make.\n\nBack to my point above, I’ll find the contract later and post it. It’ll just take time.\n\nhttps://evannex.com/blogs/news/panasonic-talks-tesla-and-teases-the-future-of-car-tech-video", "score": 2, "replies": [{"body": "Manufacturing of 2170 is done by  every battery company, including its inventors.  Tesla can have them build cells too, the assembly process is just an assembly line.  I assume Panasonic was doing it cheaper than Samsung or LG but they can't stop the cells' inventors from building their own cells, or Tesla from using its own chemistry.  They've had Samsung and LG make batteries for them in the past.  Tianjin Lishen was tapped to build TM3 2170 batteries at the China GF months ago.\n\nTesla used to make their own glass, now they also have contractors do it.  Same deal, more assembly lines and different ways to deliver the same parts.  This won't even be the first time they've done it to increase battery supply.", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Yes Panasonic is, they make the battery and are the supplier for the cells. All Tesla makes is the housing for the cell.\n\nTesla makes the battery packs for the cars. But Panasonic is the on-site supplier for the actual 2170 Cells and owns the equipment.\n\nDon’t get the battery and the battery module mixed up. It’s confusing, and some articles get that wrong. But Panasonic is the sole battery supplier for Tesla’s cars, Samsung supplies some cells for storage. Panasonic also owns the equipment in the Gigafactory to manufacture the cells. They have exclusive contracts for those facilities as well.", "score": 8, "replies": [{"body": "But how do you know that is right?   Source?", "score": 2, "replies": [{"body": "Fair question, and the shitty answer is I don’t have the time right now to find the filing. Sorry, if I find time later I’ll swoop back.\n\nBut Panasonic is the supplier, and owns the equipment. Trust me on that one. They invested a ton of capital into Giga, and have rights to the facility. Tesla can’t operate the cell production lines without them, unless they renegotiate.", "score": 9, "replies": []}, {"body": "The point of this article is Panasonic freezing investment at GF1. Why would they even be involved if they weren't the ones making the battery. \n\nDon't use Wikipedia as a source.", "score": 4, "replies": []}, {"body": "The 10-K spells it out that Panasonic owns the equipment:\n\n>Panasonic has partnered with us on Gigafactory 1 with **investments in the production equipment that it uses to manufacture and supply us with battery cells.** Under our arrangement with Panasonic, we plan to purchase the full output from their production equipment at negotiated prices. As these terms convey to us the right to use, as defined in ASC 840, Leases, their production equipment, we consider them to be leased assets when production commences. \n\n>This results in us recording the value of **their production equipment** within property, plant and equipment, net, on the consolidated balance sheets with a corresponding liability recorded to financing obligations. For all suppliers and partners for which we plan to purchase the full output from their production equipment located at Gigafactory 1, we will apply similar accounting. During the year ended December 31, 2018, we recorded $766.6 million on the consolidated balance sheet.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "https://cleantechnica.com/2019/02/03/all-your-cell-are-belong-to-us-any-high-energy-density-2170-will-do-for-tesla/\n\nLooks like they may want to start sourcing from other manufacturers, ie. from China. Smart to not put all eggs in one basket.", "score": 2, "replies": [{"body": "(Eventually) using Chinese made cells may be part of the deal for GF Shanghai with the Chinese government all along.\n\nThe government wants to tag along Tesla to further grow the quality of the supply chain of battery vehicles.", "score": 1, "replies": []}]}]}, {"body": "In short:\n\n* Panasonic won't invest to increase capacity of GF1 from 35 GWh/year to 54 GWh/year as originally planned. \n* Panasonic won't participate in Gigafactory Shanghai, and Tesla will have to find cells from other suppliers.\n\nThe article lists no sources but is on the frontpage of nikkei.com, so I'll believe it. This is a major blow to Tesla. As a shareholder I'm terrified.", "score": 18, "replies": [{"body": "That's enough to make 400,000 Model 3's.", "score": 12, "replies": [{"body": "What about the Y?", "score": 2, "replies": [{"body": "Asia sources.\n\n\"Tesla is committed to buying batteries for the cars built at the Shanghai factory from a number of makers.”\n\nSo we already know they have other sources.", "score": 2, "replies": []}, {"body": "Doesn't hit volume until 2021. And more Model 3 sales will come from China on top of the capacity at GF1.", "score": 2, "replies": []}]}, {"body": "So, this news isn't bad for Tesla then??", "score": 6, "replies": [{"body": "> So, this news isn't bad for Tesla then??\n\nSure, it’s bad news.  I think Tesla is a big startup, and there’s a question about its future demand.  Pausing investment to validate demand makes sense, especially by a non-startup like Panasonic. Their investors don’t have the same risk tolerance as Tesla’s.\n\nI think you’ll see the stock price fall to less frothy levels (down by half or down to a quarter of current value).  \n\nIn the typical startup environment, if a company stops growing, it also can’t fundraise. What investor wants to buy more of a non-growing company.  \n\nIf they can generate sufficient demand with the SR and SR+ (and be cash flow positive), then it’ll be back to investment and high growth mode.  I think their 400k reservations validated EV demand, but only at the $35k price point.  They need to hit that price point, otherwise bad things will happen.", "score": 4, "replies": [{"body": "Can you have  > 40k employees, be in business for 16 years, and still be considered a \"startup\"?", "score": 7, "replies": [{"body": "Yes.  Startup defines the way a company operates.  Startups have no established business model.  They are constantly running experiments to find the right market, product, and processes.  Once they find it, they reduce innovation and scale.  They stop burning cash, and profits happen along with size.", "score": 4, "replies": []}, {"body": "Startup is generally used to justify a lack of profits and no visibility for near-term profitability.", "score": 5, "replies": []}]}]}, {"body": "Are you saying the number is not relevant because this is 'bad news' anyway?", "score": 6, "replies": [{"body": "I am absolutely, positively saying that, yes.\n\nWhen your biggest and most important supplier says they won't invest in you anymore, that's not good", "score": 4, "replies": [{"body": "I agree it's not good, but I'm surprised you find no value in 400,000 cars compared to say 0.", "score": 6, "replies": [{"body": "That wasn't the question.  \n\nIf Tesla is limited to 400,000 cars annually, what justifies their current valuation?", "score": 12, "replies": [{"body": "Maybe the current valuation isn't justified, but if it is, it is the future growth potential. Tesla is not limited to 400,000 cars indefinitely because of this decision.\n\nTo understand the significance of the news I think the number of cars they are currently limited to is very important. It is still higher than they have been forecasted to produce this year, and as it says in the news, they are planning to re-evaluate the situation with regards to the expansion next year. \n\nNot all bad news are equal, some are less bad than others.", "score": 6, "replies": [{"body": "> It is still higher than they have been forecasted to produce this year\n\nI thought Elon said they were going to produce around 500k vehicles this year?", "score": 1, "replies": [{"body": "Do you believe that's a good and accurate forecast of Tesla's production this year? How much of the 500k will be produced in China?", "score": 4, "replies": [{"body": "The company defended it in court, are you saying they were lying in their legal arguments to a federal judge?", "score": 2, "replies": [{"body": "Why do I need to say anything about that? If you want to bring the 500k into this discussion it's up to you how you justify it.", "score": 1, "replies": [{"body": "I wasn't justifying the number, I'm just saying the company itself has said they would be producing about 500k vehicles this year, and then proceeded to defend that number in court.  My justification for that number is it comes straight from Elon Musk, is that not good enough?", "score": 1, "replies": [{"body": "If you believe that number is realistic I'm willing to speculate what this news would mean in that context. Just let me know if you do.\n\nIf you don't, then we are two people neither of who believe the number, so I don't see why we would discuss that scenario.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tesla is still guiding for 360k-400k. Elon said the run-rate will be 500k a year by the end of this year. Are you being willfully ignorant of this since it suits your narrative?", "score": 2, "replies": [{"body": "Sorry, it just gets really confusing when the company makes filings in federal court saying guidance is for 500k then makes filings with the SEC saying their guidance is 360k-400k.", "score": 1, "replies": [{"body": "So, willfully ignorant it is.", "score": 1, "replies": [{"body": "Yoda?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Well thats a faulty premise if I ever saw one. \n\n\n\"Tesla is committed to buying batteries for the cars built at the Shanghai factory from a number of makers.”\n\nPlenty more cars coming your way", "score": 4, "replies": [{"body": "Nothing you said made sense.  If this doesn't strike you as a harbinger of slowing demand, nothing will", "score": 6, "replies": [{"body": "Securing batteries for a brand new factory from local sources. You couldn’t be more wrong.", "score": 0, "replies": [{"body": ">Securing batteries for a brand new factory from local sources.\n\nWhere have they said that they've secured them?", "score": 0, "replies": [{"body": "The article said they committed to multiple battery sources.", "score": 2, "replies": [{"body": "Those are not the same things. You can commit to doing something without another party yet agreeing to do it.", "score": 1, "replies": [{"body": "They're only truly committed if they're contractually committed. Otherwise they could have just said they decided to work with multiple sources. Either way its not much of a surprise. It's exactly what Musk said they were going to do in November.", "score": 1, "replies": [{"body": ">They're only truly committed if they're contractually committed.\n\nYou can certainly interpret it that way if you want, but you have no confirmation that they've actually secured the contracts. Committed simply doesn't necessitate that reading.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "They can make that many Model 3s in the US. China will me a different source of batteries. Also, as stated, this is only through 2020.", "score": 2, "replies": []}, {"body": "They actually [specifically](https://news.yahoo.com/1-panasonic-says-reviewing-further-100749168.html)  said that they will invest if needed. \n\nSeems like a lot of good pieces are falling together here. Panasonic confirming that they want to invest more in Tesla, confirmation of other suppliers, Maxwell acquisition, existing factory way ahead of schedule....", "score": 4, "replies": [{"body": ">Panasonic confirming that they want to invest more in Tesla\n\nThis is the peak of denial and delusion.  The headline is literally THEY DON'T WANT TO INVEST MORE IN TESLA.", "score": 11, "replies": [{"body": "> The headline is literally THEY DON'T WANT TO INVEST MORE IN TESLA.\n\nI think you're reading too much into a journalist's marketing line, but it doesn't actually say that. It says Tesla **AND** Panasonic freeze spending, so you don't actually know which party doesn't want it from the headline.\n\nAlso to continue with the literal interpretations it only says that either or both parties don't want to do it before 2020.", "score": 6, "replies": []}, {"body": "I guess you missed the part where they said if they would if needed. Did you not read their response at all?", "score": 3, "replies": [{"body": "Right, but the whole point is for the time being more investment is not needed.  Saying they'll invest more if there is a business case is so obvious it doesn't even really need to be said.", "score": 3, "replies": [{"body": "No that's not the whole point. He was saying that Panasonic didn't want to invest in Tesla anymore.  That's clearly not the case. They clearly do and are actively looking for opportunities too beyond where they are now (which is right on track). It's also not that they don't want to invest in Shanghai either, the article confirms that Tesla has decided to go with multiple other sources for expanding Asia. \n\nBrand new factory. Right around the corner.", "score": 5, "replies": [{"body": "Panasonic doesn't want to invest anymore in Tesla right now because the demand situation doesn't warrant it.  Of course they would want to invest more if there was demand for it.  Water is also wet.  They also don't want to invest in Shanghai, and the article confirming Tesla has been forced to talk to multiple potential suppliers and still hasn't locked down any agreements indicates suppliers are negotiating for advantageous terms.", "score": 1, "replies": [{"body": "Summary: \n- gigafactory is on track\n- Panasonic confirms they continue to work with Tesla in the same extent as before.\n- Tesla has some sort of commitment with MULTIPLE local battery sources for Shanghai. Exactly like Musk said in Nov.", "score": 1, "replies": [{"body": "Summary: - planned gigafactory expansion cancelled because of demand outlook - Panasonic confirms they'll only invest more only if demand picture improves.  - Tesla committed to buy batteries for their electric vehicles produced in Shanghai, but no suppliers named or contracts announced.", "score": 2, "replies": [{"body": "\"We think there is far more output to be gained from improving existing production equipment than was previously estimated\" - Tesla\n\nCue Maxwell.", "score": 1, "replies": [{"body": "> What people should absolutely have zero concern about, and I mean 0, is that Tesla will achieve a 10,000 unit production week by the end of next year.... I think people should really not have any concerns that we won’t reach that outcome from a production rate.", "score": 1, "replies": [{"body": "He was right though. They didn't hit it and it didn't matter.", "score": 2, "replies": [{"body": "I mean, the stock is down 22.57% since he said that, during a period when the broader market is up almost 20%, so I'd say it did matter.  But the general point was that the company says a lot of shit that you shouldn't believe.", "score": 1, "replies": [{"body": "The stock price doesn't have anything to do with that statement. The point he made still stands. They didn't need to hit 10,000 a week to be successful. It was a self assigned goal that they didn't need to meet and no one needed to worry about. They set hard goals for themselves.", "score": 3, "replies": [{"body": "Are you seriously parsing \"I think people should really not have any concerns that we won’t reach that outcome from a production rate.\" as \"People should not have concerns that we won't make 10,000 cars a week because it won't matter if we do or not.\"?\n\nAnd clearly it matters, because the company is going to post a loss for Q1 in part because unit costs aren't dropping because the company can't even maintain 5k Model 3s for the quarter.", "score": -1, "replies": [{"body": "It literally doesn’t matter long run. It’s that simple.", "score": 2, "replies": [{"body": "Hah, yeah, there's no value in being able to sell 500k Model 3s per year.", "score": 0, "replies": [{"body": "Didn't say there was no value. Just that Elon was right. Investors didn't need to worry about it. They were profitable without it and they will get there eventually. It wasn't critical to their success.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Will if needed later = it's not needed now.", "score": 2, "replies": [{"body": "\"We think there is far more output to be gained from improving existing production equipment than was previously estimated\" - Tesla\n\nCue Maxwell.", "score": 5, "replies": [{"body": "Oh, you mean the acquisition that has been delayed three times now?  Ok.  Sure.\n\nSaving this to remind you when Tesla isn't making batteries in 6 months.", "score": 0, "replies": [{"body": "Lmao yeah is this your first acquisition? \n\nAgain: \"We think there is far more output to be gained from improving existing production equipment than was previously estimated.”\n\nYou keep spinning your little narrative all you want but at the end of the day they already have enough for all the cars and walls they need even accounting for massive massive growth in cars. That's not even accounting for the Shanghai factory with even more growth sourced by even more battery suppliers. \n\n35GWh and counting.", "score": 1, "replies": [{"body": "You are literally spinning this away from the title - Panasonic froze spending.  There is no way, in any form, that is a positive development.  Yet here you are.\n\nAnd, factually incorrect.  If they build 100,000 S/X at 100kWh, that's 10Gwh.\n\nThat leaves 25 gwh for Model 3, at an average of 70 kWh, which is about 365,000 cars.  That's less than guidance, with ZERO cells going to Powerwall.", "score": 0, "replies": [{"body": "You’re the one spinning a no news article as negative. Basically they are completely on track in every way and reiterated (maybe even started contracts) working with multiple battery suppliers in China. Top it all off they established that there is far more output they can get from existing equipment. \n\nYou just grab a headline and run. No surprise at all. They are perfectly on track for production and  are continuing to increase capacity. If they can’t increase it through optimizations then Panasonic has confirmed their desire to invest even more into the plant. Done deal. \n\nThey have wayyyy more than enough capacity at GF1 today. They are scaling up to meet the yearly goals and China is a big part of that number. As they scale the cars they scale the factory. It’s that simple. This isn’t rocket science.\n\nAnd that’s IF (big if) they switch to the new cells for the S&X.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "> if needed.\n\nThat is sort of the key thing here.  Right now it looks like more investment is not needed, which isn't great for the growth story.", "score": 5, "replies": [{"body": "I guess you missed the part where Shanghai batteries were secured and that they are well on track in GF1", "score": 4, "replies": [{"body": "I did miss that, can you point me to a source showing they have finalized arrangements with battery suppliers for the Shanghai factory?", "score": 5, "replies": [{"body": "\"Tesla is committed to buying batteries for the cars built at the Shanghai factory from a number of makers.\"", "score": 2, "replies": [{"body": "Not to get into an argument about what \"secured\" means since people here seem to have a lot of trouble with that concept, but Tesla being committed to buy a necessary component in their vehicles is not the same as actually having contracts in place to buy those components.  They are only \"secured\" if someone has actually agreed to sell Tesla the batteries.", "score": 4, "replies": [{"body": "Multiple sources. Not just one. You wanted to know where the battery are coming from to support the growth. There it is in black and white.", "score": 2, "replies": [{"body": "Tesla can be committed to whatever they want, but until they have an agreement with someone that doesn't mean shit.  If they are committed to building a time machine, that doesn't mean time travel is secured.  It is frankly absurd that this needs to be explained to people.\n\nEdit: And just so it is clear why this is an issue - Tesla is going to have a very hard time getting good terms from other suppliers if those other suppliers think Panasonic made out poorly from their dealings with Tesla.  Why jump into bed with Tesla if Tesla's existing supplier is wary of committing to further investments?", "score": 3, "replies": [{"body": "We can argue semantics till you're blue in the face, but Tesla is only truly committed to something if there is a contract in place. Either way, Panasonic is not getting the Shanghai battery contract.", "score": 1, "replies": [{"body": "> but Tesla is only truly committed to something if there is a contract in place.\n\nThis seems very ironic in a discussion of whether something is secured or not.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "That's a good point, I may have misjudged the importance of the first point in my initial panic after reading the article. In fact, I would say it's likely more Model 3s -- at 65 kWh per vehicle it comes out to 550,000 Model 3s a year (you have to discount this figure to take the energy storage business into account but half a million vehicles/year or so seems like a reasonable estimate). So this basically means that Model 3 + Model Y sales will stay at that level since at least late 2020, which only represents a few months' delay of the current timeline. But their pulling out of Gigafactory Shanghai is definitely terrible news.", "score": 3, "replies": [{"body": "Don't think they were even in the Shanghai gigafactory fans, how can they pull out?", "score": 8, "replies": []}]}]}, {"body": "Is this a good time to buy more stock?", "score": 5, "replies": [{"body": "Are you taking investment advice from a reddit thread?", "score": 4, "replies": []}, {"body": "No", "score": 2, "replies": []}, {"body": "Always.  Classic market overreaction on speculative news.", "score": 2, "replies": []}]}, {"body": "Why terrified? That is more than enough capacity to hit targets for the year and the Chinese gigafactory will more than make up the difference after that. And as for that plant tesla was already looking to get other battery suppliers instead of Panasonic, so them not being involved in that is not a big deal", "score": 3, "replies": [{"body": "its saying with the internal data they have Panasonic doesnt believe tesla can sell more than they can currently build even at a 35k pricepoint.  it means they don't see need in the near future to expand capacity. you cant just plop down factory capacity overnight so you have to plan for the future.  this is saying they dont think there is going to be enough sales to max out the factory capacity.", "score": 1, "replies": []}]}]}, {"body": "The article is released with perfect timing for shorts to cover as tesla announced early earning call which usually means the stock is going to 🚀", "score": 9, "replies": [{"body": "That would be great but I doubt the stock will be rocketing anywhere after this earnings call :/\n\nLower ASP + Lower Deliveries + $1B bond payment = negative cash flow.\n\nI am Tesla’s biggest fan.", "score": 15, "replies": [{"body": "That's true but I am hoping Q2 guidance will justify.", "score": 2, "replies": []}]}, {"body": "Take a look how the stock did after the last earnings call.", "score": 2, "replies": []}, {"body": "The FUD machinery is running hot past days. Means one of two things (pick according to the kind of animal you are):\n\n- demand falls off the cliff, or\n- demand falls up the cliff", "score": 1, "replies": []}]}, {"body": "Bloomberg article: https://www.bloomberg.com/news/articles/2019-04-11/tesla-panasonic-freeze-expansion-of-gigafactory-nikkei-says?srnd=premium", "score": 2, "replies": []}, {"body": "Good buying opportunity. This is probably result of broken negotiation between the two which is due to Tesla going for the dry battery manufacturing process. Plus, Tesla has been talking about partnering with the Chinese.", "score": 1, "replies": [{"body": "Always a good sign when negotiations with your key suppliers fall through!", "score": 8, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "How?", "score": 1, "replies": [{"body": "It's a joke. Basically the crypto people kept saying any news, no matter how bad or unrelated was 'good for Bitcoin'.", "score": 1, "replies": []}]}]}, {"body": "Thank you for overgeneralization.\n\nI am offering my take. Pick it apart by all means.", "score": 1, "replies": [{"body": "My take is this makes negotiations with other potential battery suppliers much more difficult.  Someone like CATL is going to think to themselves (i) hey, one less potential competitor I have to worry about undercutting the bid I make and (ii) if Panasonic doesn't want to commit to doing more business with Tesla, maybe I should be a bit more careful with my own terms.", "score": 3, "replies": [{"body": "First of this is an expansion project.\nLet's consider your take. If this is somehow due to falling demand in ev. The points you raise do not exist because no manufacturer will have bargain power since batty will be oversuplllied. If we flip it, ev is hot and will grow like crazy. I don't see why Tesla suddenly would just let this expansion through, only hundreds of millions we are talking. \nSo your take does not fit reality in my estimate. My take is more probable.", "score": 2, "replies": [{"body": "You seem to be assuming Tesla is a dominant player in places like China, where in fact they represent a tiny percentage of the market.  Stagnant demand for Tesla doesn't necessarily mean stagnant demand for EVs.  A company like BAIC that has 15% of the market in China (as opposed to Tesla's 1%) probably has a bit more bargaining power.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "> Japanese company also suspends planned investment in Shanghai plant\n\nhttps://asia.nikkei.com/Business/Companies/Tesla-and-Panasonic-freeze-spending-on-4.5bn-Gigafactory", "score": 2, "replies": [{"body": "Also \n\n\"Tesla is committed to buying batteries for the cars built at the Shanghai factory from a number of makers.”", "score": 6, "replies": []}, {"body": "Is this the first time we heard they were planning to invest in it?", "score": 4, "replies": [{"body": "I always thought it was more local suppliers to save money there.", "score": 4, "replies": []}]}]}, {"body": "People should view any Nikkei report with skepticism.  I’ve been following Apple for years, and Nikkei has habit of publishing reports about Apple that turn out to be untrue.  For a good summary of this years-long disinformation campaign by Nikkei:\n\n[https://iphone.appleinsider.com/articles/18/01/29/another-january-another-misleading-iphone-supply-cuts-story-from-nikkei](https://iphone.appleinsider.com/articles/18/01/29/another-january-another-misleading-iphone-supply-cuts-story-from-nikkei) \n\n“Nikkei has claimed Apple is slashing production orders for iPhone X due to \"slower than expected holiday sales\" the U.S., China, and Europe. The report comes right after CIRP noted that iPhone X outsold iPhone 8 Plus, and that both larger models outsold the standard sized iPhone 8. iPhone X by itself outsold the now very attractively-priced iPhone 7, as well as the combined sales of all iPhone 6s, 6s Plus and SE models—despite being on sale for five fewer weeks than all of those other models.”\n\nNikkei spread similar rumors of “collapsing” iPhone demand based on alleged low supplier demand after the launch of iPhone 7, 6s, and 5c.   All of these reports ultimately proved untrue.", "score": 0, "replies": [{"body": "> Panasonic Corp and Tesla Inc are holding off on further investment in the U.S. electric carmaker's Nevada Gigafactory while they squeeze more out of existing resources and study market demand, the companies said on Thursday.\n\n> The two companies were responding to a report by Japan's Nikkei that said they had frozen previous plans to raise the capacity of the plant, which supplies battery packs for Tesla cars.\n\nhttps://www.reuters.com/article/us-tesla-gigafactory-panasonic/panasonic-says-reviewing-further-investment-in-tesla-gigafactory-idUSKCN1RN117", "score": 3, "replies": [{"body": "The point is that Nikkei cannot be counted on to provide full context.", "score": 1, "replies": [{"body": "Tesla responded to it.", "score": 1, "replies": [{"body": "And like I said, Nikkei published incomplete info (as they did to Apple on numerous prior occasions), which has now spread all over the Mainstream Media and Twitter.  Your own article link states as much:\n\n[https://www.reuters.com/article/us-tesla-gigafactory-panasonic/panasonic-says-reviewing-further-investment-in-tesla-gigafactory-idUSKCN1RN117?utm_source=share&utm_medium=ios_app](https://www.reuters.com/article/us-tesla-gigafactory-panasonic/panasonic-says-reviewing-further-investment-in-tesla-gigafactory-idUSKCN1RN117?utm_source=share&utm_medium=ios_app) \n\nYour linked article says:\n\n““Both Tesla and Panasonic ***continue to invest substantial funds*** into Gigafactory,” a Tesla spokesperson said.  \n\nwe believe there is far more output to be gained from improving existing production equipment than was previously estimated.””\n\nAND,\n\n“Giving no details of its sources, the Nikkei reported here that financial issues had led the companies to rethink plans to expand the capacity of Gigafactory 1 by another 50 percent next year.”\n\nPeople are seriously downvoting me for pointing out that Nikkei has done this before to another company?   Nikkei has a credibility problem.", "score": 2, "replies": []}]}]}]}]}, {"body": "'a Tesla spokesperson'", "score": -1, "replies": [{"body": "Why would they lie about that? Do they need each spokespersons full name and title?", "score": 10, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "I think 'them' is referring to EV's in general but the sentence isn't really clear.", "score": 7, "replies": []}, {"body": "No, there are more manufacturers of ev batteries. Both parts of the sentence refer to electric vehicles, there is nothing in the second sentence that changes the subject. Basic grammar :-)", "score": 7, "replies": [{"body": "Umm.. Tesla IS the \"subject\" of the first clause! And regardless, \"them\" is simply ambiguous in the second clause, like a dangling participle would be. So... uhhh .... no u!", "score": -3, "replies": [{"body": "I’m with you there but it appears that this subreddit disagrees. I guess they also didn’t notice the missing word in that sentence either. The written language is becoming a lost art and the mob rules apparently. I don’t know why I even bother to try and have intelligent recourse here ...", "score": 3, "replies": [{"body": ";)", "score": 1, "replies": []}]}, {"body": "Hey man, would the sentence make any sense if it read like this?\n\n> and Panasonic one of the biggest producers of the batteries that power Tesla.\n\nNo, of course not.  Because Panasonic's batteries don't power Tesla, they power the cars that Tesla makes.  Now, does this make a bit more sense?\n\n> and Panasonic one of the biggest producers of the batteries that power electric vehicles.\n\nSee how that works much better?  The \"them\" is not ambiguous because it makes no sense in context as a reference to a company.", "score": 4, "replies": [{"body": "I meant *grammatically* ambiguous. For example, the following sentence is valid;\n\n> Tesla's vehicles are a major fraction of all electric vehicles, and Panasonic makes all the batteries that power them.\n\nThe person I was responding to said \"basic grammar\" and referenced the \"subject\" ; I was pointing out that it isn't a matter of knowing grammar, but of using context + logic to parse it the right way.", "score": 1, "replies": [{"body": "You're parsing it the wrong way, sorry to break it to you.", "score": 2, "replies": [{"body": "No I'm not! I never said one way or the other which way I parse it (though, for the record, I agree that \"them\" refers to \"electric vehicles\"). All I said was that both parsings are allowed under the rules of English grammar. Then it's left to context + logic to determine which is the correct parsing. (Eg. The fact that Tesla is a company, and isn't powered by batteries)", "score": 0, "replies": []}]}]}]}]}]}]}]}
{"title": "Tesla and Panasonic freeze spending on $4.5bn Gigafactory", "selftext": "", "id": "bby4bm", "created_utc": 1554977516.0, "score": 169, "upvote_ratio": 0.94, "num_comments": 102, "comments": [{"body": "This is not good for my shares", "score": 98, "replies": [{"body": "I am gonna be a sad man too today.", "score": 26, "replies": []}, {"body": "But a good way to get more shares at (some) discount", "score": 14, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "I hope this is sarcasm. Tesla value? Elon is selling iphones on wheels with a T instead of an 🍏 logo.", "score": 14, "replies": []}]}]}, {"body": "my calls...", "score": 8, "replies": [{"body": "F", "score": 1, "replies": []}]}, {"body": "I have made a killing shorting Tesla. Sounds like I might need to start doing that again.", "score": 6, "replies": []}, {"body": "The secret reason is tesla is firing panasonic, they bought maxwell to produce batteries in house so they could have a complete vertical integration. Having to rely on other companies for the most important piece of your product is bad business sense.", "score": 6, "replies": [{"body": "Uh no. This is a drastic foreshadowing of independent market verticals calling fud on Tesla. The winds of innovation for Tesla is shifting and not in a good way.", "score": 12, "replies": [{"body": "60% of US EV sales are model 3 alone, you think e-tron is gonna eat that much pie with it's crappy 200 mile range and horrible efficiency?\nOr their non-existent charging infrastructure? lol\nOr the taycan that is gonna cost twice as much?\nOr maybe the crappy bolt that they had to cut the price on because it was selling so poorly?", "score": 11, "replies": [{"body": "The crappy thing about the bolt is the logo on the front. It’s an excellent car, but Chevrolet and parent GM haven’t recovered their image from the bailout crisis.", "score": 9, "replies": [{"body": "TQN:.^RDu[U.Hp:7n9VX@DKyOQ@o.:&9,rODJnU&K8cZUTId[lO4,iUX,$hiy3mI#5[mf0UPH@bSPIQhJ54W1C#bOTlPxITETB9e*;f3UeV7-", "score": 3, "replies": []}, {"body": "Bailout my ass. They've had a shitty domestic reputation for decades.", "score": 6, "replies": []}, {"body": "and that it looks like ass..... It looks like a sanding block with wheels. Tesla made EV's that look like normal cars.", "score": 1, "replies": [{"body": "Yeah well the volt was REALLY made for the people, whereas only the bourgeoisie can afford a Tesla.", "score": 1, "replies": [{"body": "Is it too much to ask for it to look like a sonic? Or an impala? Something normal. =[", "score": 1, "replies": []}]}]}, {"body": "I owned a Bolt. Excellent car, can’t say enough good things, except for the spontaneous combustion risk. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "... Because the typical American drives around doing 100mph on the daily...", "score": 9, "replies": [{"body": "Lol at that comment.  Someone's been reading too much Popular Mechanics.", "score": 2, "replies": []}, {"body": "range is pretty variable based on conditions it's why most require more than 100 miles per charge to avoid range anxiety.", "score": 2, "replies": []}]}, {"body": "Excessive wind noise is exactly why I didn’t purchase an S.  I dropped the 3 reservation as well from it’s crappy suspension and weird ass touchscreen controls.\n\nThat said, I did buy $100k of shares last week for some reason.", "score": 4, "replies": []}]}]}, {"body": "highly unlikely that other cars will catch up to tesla soon. I will still wait untill Maxwell deal though. If the Maxwell deal doesn't happen, tesla is fucked. If the Maxwell deal happens, then panasonic deal doesn't matter.\n\nhttps://i.redd.it/nom06a5c8bq21.jpg", "score": 2, "replies": []}]}, {"body": "yeah, no. Maxwell makes capacitors, specifically high-voltage high-capacity ones are their specialty.", "score": 2, "replies": []}, {"body": "I want to believe....  source?", "score": 1, "replies": []}]}]}, {"body": "who needs panaGAY when we've got\n\nmAXwELL TaChnOogiEs\n\nthe tendie offer is gonna go thru ANY DAY NOW", "score": 77, "replies": [{"body": "What you know about super capacitors could fit in an 18650 cell.", "score": 27, "replies": [{"body": "What do you mean by this", "score": 6, "replies": [{"body": "18650 cell = small battery", "score": 12, "replies": [{"body": "18650 = 18mm x 65mm\n\nIt is exactly the size of the cell.\n\nBattery is a term for a group cells. a \"battery\" of cells.", "score": 3, "replies": [{"body": "shield battery is 4 shield cells in a tube like tennis balls??", "score": 1, "replies": []}, {"body": "it's what tesla uses for their car batteries... basically multi-generationally old tech, terrible fill factor. The future is towards specially-shaped-to-fill-space batteries, ala Apple laptop batteries.", "score": 1, "replies": [{"body": "They perfected the form factor and can make large runs. I think this is always beneficial in the long run.  I think they were leveraging the fact that consumer electronics already uses them in mass. Anything custom is more expensive.", "score": 2, "replies": [{"body": "the form-factor is non-ideal, and was perfected long before TSLA came on the scene. (18650s have been a thing for a while now.) Agreed re: custom being expensive but at the scale involved, it would be relatively minor expense that would eventually be amortized and ultimately result in better product. Meaning, esp. if you are building a $5b factory, build it to make something more ideal than 18650s.", "score": 1, "replies": []}]}]}]}, {"body": "and maxwell makes supercapacitors, not batteries.", "score": 2, "replies": []}]}]}]}]}, {"body": "I sold puts yesterday\nF", "score": 18, "replies": [{"body": "Which one just for fun... We're in the same boat", "score": 5, "replies": [{"body": "4/18 267.5", "score": 2, "replies": [{"body": "> 4/18 267.5\n\nDamn. You're just a haircut away from getting fuck. I sold 4/26 $245P so I'm a bit better than you but it's TSLA so we might both get fucked.", "score": 2, "replies": [{"body": "Earnings got anounced for the 24...", "score": 2, "replies": [{"body": "Damn. They moved ER date? Wasn't it originally on 5/1?", "score": 1, "replies": [{"body": "It originally was 5/1. And they moved it. Not the first time they move earnings forward a week. But yeah, sucks.", "score": 1, "replies": [{"body": "Oh well, that's Melon Tusk for ya. Let hope it'll recovers and time decay kills the premium.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "No sources and published in a Japanese paper (thus avoiding US laws and regulations). Smells like bullshit but it will probably make TSLA go down 3% until Elon tweets about how this is fake and gay", "score": 87, "replies": [{"body": "Wait until the Mongolian newspapers have their say.", "score": 45, "replies": [{"body": "We are already on it.", "score": 84, "replies": [{"body": "Fucking love this place.", "score": 22, "replies": []}, {"body": "r/beetlejuicing", "score": 7, "replies": []}]}]}, {"body": "I respect Japanese journalism more than i do the American variety.\n\nIn Japan, you get caught spouting bullshit, you get fired, nobody else hires you and your family starves.\n\nIn America, you get caught straight up lying, you just yell \"FaKe NeWz!\", then smirk \"I got paid for that, bitch\"... followed by high fives all the way around.  Maybe the publisher has to print a retraction a week later.", "score": 44, "replies": [{"body": "You forgot, you also get a multi-million year gig as a talking head on msnbc.", "score": 16, "replies": [{"body": "lol. you are not wrong.", "score": 7, "replies": []}, {"body": "so is fox", "score": -1, "replies": [{"body": "That's right :)", "score": 1, "replies": []}]}]}]}, {"body": "Yahoo reported they responded to the news. I firmly believe it isn’t FUD.\n\n[https://news.yahoo.com/1-panasonic-says-reviewing-further-100749168.html](https://news.yahoo.com/1-panasonic-says-reviewing-further-100749168.html) \n\nThen again, you’re not looking for reasonable responses and discussion, eh?", "score": 17, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "When your dad has sex with your girlfriend or wife.", "score": 3, "replies": []}, {"body": "Fear Uncertainty Doubt\n\nOR\n\nFomo Unlimited Dollars", "score": 1, "replies": []}]}, {"body": "What’s FUD? Based on context I’d guess bullshit news to manipulate stock price?", "score": 1, "replies": [{"body": "Yes.\n\nThere is real FUD out there but TSLA fanboys have gotten into the habit of saying all negative news items are FUD.\n\nThey aren’t capable of handling bad news like an investor would. Name calling gets resorted to real fast also.\n\nIt’s the number one mistake when investing - getting emotional about an investment.", "score": 16, "replies": [{"body": "Haha yeah I see that. I invest in TSLA because their product is such high quality. Reminds me of when the iPod came out. But I’m not blind to market demands and the possibility of failure. \n\nJust curious- does FUD stand for something?", "score": 1, "replies": [{"body": "Fear / uncertainty / doubt to make you pull the sell trigger pushing prices down more so shorts achieve their goal.", "score": 5, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}]}]}, {"body": "Everything anti-tesla is FUD, even if it's real.", "score": 2, "replies": []}]}]}, {"body": "The first thing may be true. Keeping it at 35GWh isn't a huge blow, they can still make over 400k Model 3s a year with that output and it saves a lot of Capex. This of course puts into question where they plan to make the Model Y and storage packs. I got a feeling they will produce the batteries through there Chinese partner and import them along with the cheaper Model3/Y.\n\nThe part about freezing in China is BS. Its been pretty well reported Tesla was choosing a local Chinese battery partner. So is Panasonic freezing investment or did they just not get picked to supply Tesla China? Feels like the later since we never heard anything about Panasonic being involved other than the CEO saying they wanted too.", "score": 12, "replies": [{"body": "It might be true that Panasonic is considering reducing Capex but that could be for a multitude of reasons. The fact that they cite Model 3 demand makes it obvious this is a hit piece. Tesla still has tons of orders for Powerwalls that aren't getting filled because battery demand is so high for Model 3 plus X/S. If battery demand lowered for cars they would be producing those power walls. Tesla hasn't even started shipping Model 3s to half the countries they will be sold in, so they can't have already gauged worldwide demand and analyzed their capacity. \n\nOr it could be 100% made up bullshit. Panasonic could deny it in a few hours and this article will be forgotten. No SEC investigation because no jurisdiction in Japan. Tesla stock will take a dive and shorts will make some money, and nobody will be the wiser.", "score": 9, "replies": [{"body": "We need to retool the \"Everyone that disagrees with me is Hitler\" meme into a \"Every fact I don't like is FUD\" meme.", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "You can't criticize heroic local green energy companies in the US, that's illegal.\n\nYou can make up buyout offers that's very cool and very legal.", "score": 21, "replies": []}]}, {"body": "News reported on Bloomberg too.\n\nDon’t try to spin everything that’s negative as fud.", "score": -2, "replies": [{"body": "This is obvious FUD. It was posted in a Japanese paper (so they don't get sued), with no sources, at 3am PST when Elon most likely can't respond because he's asleep and it was published minutes after Tesla investor relations disclosed the date for the autonomy seminar.", "score": -7, "replies": [{"body": "It's a Japanese paper reporting on a Japanese company plans to pull back on investments. You might be overthinking this.", "score": 23, "replies": [{"body": "They’re not pulling their investments. They’re rearranging them into existing infrastructure. If that means they cut their investment in the giga-factory expansion because they don’t need as much money to invest in what’s already in place then they can use that free money for other investments or whatever.", "score": 0, "replies": []}]}, {"body": "Or too busy watching anime", "score": 10, "replies": []}, {"body": "It’s reported at a reasonable time by a Japanese news source. Not everything revolves around US time.\n\nIf it really is FUD it wouldn’t be as effective to release it during non-market hours in the US as it gives people plenty of time to digest and investigate the news before the market opens.", "score": 5, "replies": [{"body": "Extended market trading opens at 3am PST you idiot. They did it at the exact start of market hours. They don't want people to have time to \"digest\" the info because it's made up bullshit. The more time people have to see though the bullishit, the less the stock will tank. Makes perfect sense why they released it at this exact time.", "score": -2, "replies": [{"body": "It actually starts at 1am pst tough guy. Terrible way to do a hit piece. No one is trading, volume is light.\n\nDon’t get too worked up fanboy.", "score": 12, "replies": [{"body": "Oh so they did release it during market hours? What the fuck were you talking about then when you said it wasn't during market hours?\n\nYou didn't even know extended hours existed until I just told you. You thought the market was closed.", "score": -4, "replies": [{"body": "No one considers after hours “market hours”. Unless you’re an amateur sitting at home the market opens at 9:30 and closes at 4pm and you’re hitting happy hour.", "score": 11, "replies": [{"body": "Dude, you thought the market was closed. Lmao. You probably don't even have a brokerage, just a wandering Tesla hater.", "score": -4, "replies": [{"body": "Where did I say that? I said non-market hours.\n\nYou seem a little upset and emotional.\n\nYou’d probably cry if you knew what my situation was but being the internet there’s no need to brag.", "score": 12, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Rip my call 😭", "score": 8, "replies": []}, {"body": "love buying puts the day before this lol", "score": 15, "replies": [{"body": "SEC, this guy right here.", "score": 53, "replies": []}]}, {"body": "This is worse than holding MU at above 45. Can never get out. Fuck.", "score": 13, "replies": [{"body": "It really does feel a exactly like that. MU 45, Tesla 300 same same..", "score": 7, "replies": []}, {"body": "been bagholding for two straight months now lol", "score": 5, "replies": [{"body": "You’re still buying? Increase that DCA. Keep holding imo.", "score": 2, "replies": [{"body": "Nah, no more fund to average down", "score": 4, "replies": [{"body": "Get a job! The bums lost!", "score": 1, "replies": []}]}, {"body": "Yes yes, throw more money into the dumpster fire. Surely it will eventually put out the flames.", "score": 1, "replies": [{"body": "Dumpster fire lol", "score": 1, "replies": []}]}]}]}]}, {"body": "Tesla is fucked boys. That's a wrap", "score": 12, "replies": [{"body": "yea onto the next one", "score": 2, "replies": []}]}, {"body": "Peak lithium... (at least for now)", "score": 3, "replies": []}, {"body": "I think Elon gonna tweet something about Mr. SEC being pedo or a MEME review with pewdiepie", "score": 3, "replies": []}, {"body": "I was looking for a good entry to buy calls.  The comments in this thread are telling me it’s time.", "score": 3, "replies": []}, {"body": "> Panasonic will also suspend its planned investment in Tesla's integrated automotive battery and EV plant in Shanghai.\n\nUnLiMiNiTeD dEmAnD", "score": 13, "replies": [{"body": "I have a gut feeling this has more to do with the trade war than anything.. I don’t feel so good", "score": 0, "replies": [{"body": "I have a feeling this actually has to do more with Pana changing the guy in charge the of this sector.\n\nThe previous guy was the one who signed their agreement with Tesla and was quite encouraging and lenient towards Tesla.\n\nNew guy has a bit of a reputation of an SOB.", "score": 12, "replies": []}]}]}, {"body": "FUD FUD FUD FUD FUD Lol\n\nGo ahead, buy more Enron stock", "score": 4, "replies": [{"body": "Pls don’t talk about Tesla like that here", "score": -1, "replies": []}]}, {"body": "Buffett teased that back in December he was looking into purchasing a large share of a company on “planet earth” with Berkshires cash. Tesla is on planet earth. If Tesla crashes would Daddy Buffett uncharacteristically invest?", "score": 1, "replies": [{"body": "No", "score": 6, "replies": []}]}, {"body": "Maybe time to roll these calls in case there’s a pre-earnings run up. Then get the fuck out of this asshole stock and never look back.", "score": -4, "replies": []}]}
