{"title": "Why would anyone buy stock now?", "selftext": "[deleted]", "id": "3rdv3c", "created_utc": 1446575518.0, "score": 20, "upvote_ratio": 0.73, "num_comments": 63, "comments": [{"body": "Because only a small percentage of the world has an Aluminum foil hat collection.", "score": 37, "replies": [{"body": "Sounds like a huge potential market to me. All in Alcoa.", "score": 8, "replies": [{"body": "choo choo", "score": 4, "replies": []}, {"body": "I'm more of a CENX guy", "score": 1, "replies": []}]}, {"body": "This. Contrary to what you read on ZH, nothing is really \"scary\" in the market right now.\n\nWhen you have billion dollar hedge funds going belly up left and right, when banks start going bankrupt, when the whole system is on the verge, then people will have reason to sell.\n\nIs that happening now? No, it's not. Hence, rally.", "score": 2, "replies": []}]}, {"body": "You wanna know what the problem with you is dude? You don't sit in a $700 chair. Because you're a little BITCH dude, you get NO pussy.", "score": 31, "replies": [{"body": "wsb + mde... i have found home...", "score": 9, "replies": []}]}, {"body": "\"Market is at an all time high.\" Isn't every year an \"all time high\"? How is anything supposed to grow withought ever being at an \"all time high\"?", "score": 25, "replies": []}, {"body": "[deleted]", "score": 14, "replies": [{"body": "My apologies for such a newb question.. But when someone says \"buy some puts\", what does \"puts\" mean exactly? ", "score": 0, "replies": [{"body": "Hey since you're new your posts are shadow banned. If they aren't showing up, PM a mod. I cleared this one for you. If you're asking pretty basic questions, try checking investopedia.com or use the google box first. ", "score": 8, "replies": [{"body": "Such a nice guy :-D", "score": 4, "replies": [{"body": "I'm like a sunflower covered in sunshine. ", "score": 2, "replies": []}]}]}, {"body": "It's a type of option contract. There are puts and calls. Puts means you are betting on the market going down, calls mean you are betting on the market going up. Options are super risky because you have to correctly chose both the time and direction, but the reward is there if you do it correctly.", "score": 2, "replies": []}]}]}, {"body": "Can't say you're wrong, but this isn't r/investing. I don't hold shit for long.. well besides 1. Nawmsayin", "score": 19, "replies": [{"body": "no ragrets", "score": 9, "replies": [{"body": "Not even a single letter?", "score": 4, "replies": [{"body": "Except for that one time at camp.", "score": 1, "replies": []}]}]}, {"body": "I hold my shit for a while and get hemorrhoids for the funsies", "score": 3, "replies": [{"body": "Does that really happen?", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Bro...", "score": 7, "replies": []}, {"body": "I go to your mom for good dividends. ", "score": 11, "replies": []}, {"body": "God damn it, this is actually fantastic advice! That and selling baby yolo puts on a stock you're pretty sure you wouldn't mind owning at a specific price. -6 puts on apple December exp 110 strike. I'll take that $500 please and thank you ", "score": 1, "replies": []}]}]}, {"body": "Fucking casual. You only look for stocks in hope they go up. There are many ways to make profit.\n\n\nYou can long it.\n\nYou can short it.\n\nYou can buy/sell puts.\n\nYou can buy/sell calls.\n\nYou can make profit from pretty much any movement. The worst thing that a stock can do is stagnate.", "score": 16, "replies": [{"body": "Sell calls/puts if its stagnate. Problem solved.", "score": 7, "replies": []}, {"body": "i read this in the voice of the late great nate dogg. ", "score": 7, "replies": [{"body": "You can be handy with the steel to earn your keep. ", "score": 6, "replies": []}, {"body": "The regulator. ", "score": 1, "replies": []}]}, {"body": "Although not my cup of chowder, you can make money by collecting premiums when it stagnates.  ", "score": 2, "replies": []}, {"body": "[deleted]", "score": -18, "replies": [{"body": "\"Whatever bro\" yeah I stopped reading right after seeing that, what are you a high school robin hood investor?", "score": 15, "replies": [{"body": "wot u got against high school robin hood investors? Thats how waren buffé started", "score": 8, "replies": [{"body": "I have nothing against Robin Hood high school investors when it's not blatantly obvious they are a Robin Hood high school investor ", "score": 3, "replies": []}, {"body": "nah bro, buffett created da stock xchange", "score": 2, "replies": []}]}, {"body": "Nah man, afe grayde RH YOLO champ.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": []}]}]}, {"body": ">  oil is guaranteed a comeback because of the UAE's budgets\n\nCould someone ELI5.", "score": 6, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Ok well, oil is an enigma to me, so explain why you know so much? Please\n\n", "score": 1, "replies": []}]}, {"body": "And that will raise the price how exactly? They'll just start charging more?", "score": 1, "replies": []}]}]}, {"body": "Best odds for a fucking space yacht brah. Dafuck?", "score": 3, "replies": [{"body": "I'm putting in a down-payment for one as soon as I YOLO some Friday put options on TSLA.", "score": 2, "replies": []}]}, {"body": ">Oil is guaranteed a comeback\n\nThen buy a shitload of oil stocks at massive discounts and some calls as well if you're that sure.", "score": 3, "replies": []}, {"body": "My stock portfolio is up 15% month to month, it's hard to get out right now when I'm averaging a 0.5% gain a day, but I'm putting up stop losses juuust in case.", "score": 6, "replies": [{"body": "Portfolio goals. ", "score": 2, "replies": []}]}, {"body": "OP --> https://i.imgur.com/DEfnmbEh.jpg", "score": 2, "replies": []}, {"body": "totally agree, which is why i fucking bought 75 shares of tvix a month ago only to lose 54% on those. no clue what's happening so im in cash until further notice", "score": 6, "replies": [{"body": "You only bought 75 shares?\nAnd here I was dumping over 10k in it\nGoddamn ", "score": 3, "replies": [{"body": "yeah i only bought 75 shares. wasnt a lot of money on the line but i was planning on USING THOSE PROFITS to go on vacation in fucking december. now i only have enough to buy like 3.5g of shrooms and a bottle of vodka which i will consume alone in my apartment.", "score": 4, "replies": [{"body": "I feel you bro I canceled my cancun trip too after that trip. ", "score": 2, "replies": []}, {"body": "ill do shrooms wit u they make me happy", "score": 2, "replies": [{"body": "thx m8", "score": 1, "replies": []}]}]}]}, {"body": "how about just not buying TVIX for more than a day ever. at all. seriously never buy it for more than a day. when it's above $6 ", "score": 2, "replies": [{"body": "i know. i went full retard. so stupid of me", "score": 2, "replies": []}]}]}, {"body": "The delayed rate increase makes bonds really unattractive. We're in the negative territory on short-term paper and everyone is selling the long-term bonds to the Central Banks via QE.\n\nDown the horizon (possibly March) when rates rise, there will probably be devastation on a worldwide scale. The exit from government debt will actually accelerate as rates rise, because the interest expenditures on the debt are going to be astronomical. The budget of every government will go bust. This is because, as I said before, there has been a massive sell-off on the long end and most outstanding debt expires in 2-5 years now. The Fed keeps talking about the need to \"normalize\" (i.e. raise) rates because they need to save the pensions.\n\nCalPERS had a return of just 2.4% last year. Pension structures are based off an average annual return of 8%, so this is becoming a serious problem. Many (if not most) pensions are required by law to hold a large % of their portfolio in government debt. Illinois just had its credit rating dropped to one step above junk, and they will delay their pension payments for November and December. \n\nSo governments worldwide are broke, and they want you to pay them negative interest for their debt, which is supposedly AAA, but if you look at Detroit, Puerto Rico, and Illinois under a microscope you see that many munis aren't so risk-free after all. The Netflix tax is a perfect example of what we have over the horizon. Instead of addressing the fundamentally unsound structure of the system, they just find someone or something else to tax. As governments go broke, they will go on the tax hunt, and that will cause a shift of assets. The most attractive by far is the stock market, where the tax has a cap of 15% if you hold on to shares for more than a year. \n\nWhere else are you going to get your returns? Stocks are portable. Try leaving France with a suitcase of gold coins. Why is it that we are seeing record art auctions? Art is a portable way to store wealth. Gold, unfortunately, isn't. Neither are bonds or real estate as they just peaked again. \n\nTLDR: Pensions and investors have nowhere else to go but the stock market given the fact that everything else sucks.", "score": 3, "replies": [{"body": "What do you read to learn all this?", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Thanks, I appreciate the response. Sounds like someone I'll enjoy reading.", "score": 2, "replies": []}]}, {"body": "I couldn't even make it through his whole post. Not sure how he actually gathered that much info", "score": 1, "replies": []}]}, {"body": "> The most attractive by far is the stock market, where the tax has a cap of 15% if you hold on to shares for more than a year. \n\nIt's already set at 20%", "score": 2, "replies": [{"body": "Still better than anything else you put your money into. What is your graduated rate? 28%? 35%?", "score": 2, "replies": [{"body": "Depends on the tax bracket. but short term is 35%.  Futures is 60-40(60% taxed at 20%, 40% taxed at 35%).", "score": 2, "replies": []}]}]}]}, {"body": "This single handily maybe the dumbest thing I have read all day...\"Why would anyone buy stock now?\" Could that not be said at ANY point EVER? \"Market is to down better not invest just yet\" Then \"Market is flat nothing to invest just this moment\" into \"The market is so High...crash coming any day now...better wait\" Then just rewind that for EVER. Something else you said is fucking madness also \"The fed merely delayed a rate increase...\" Are You saying after they do everything is going bottom out? Bc if so that is the 2nd dumbest thing I have read today. Short term drop maybe. Longer term its a huge plus...if you don't know why let me fill you in...When the fed raises the rate what they are saying is \"We believe the economy can handle a increase in interest rates.\" Along with more loans blah blah. Enjoy your Oil ride into 2018. ", "score": 1, "replies": []}, {"body": "Biggest danger is an interest rate hike. It would be a fucking disaster that would make 2009 financial crisis look like a joke. Back then a few dumb hicks in Florida lost their houses because they couldn't afford their poorly structured mortgage payments and look at the chaos that resulted. Imagine what would happen if all of a sudden doctors, lawyers, bankers, pension funds, VCs, and even yacht captains couldn't pay their mortgages. It would be 9/11 times a billion. Luckily the central bankers know this and don't dare make a move. But they are starting to worry too because, who the fuck knows what happens if interest rates stay low forever? They don't, really no one does. ", "score": -3, "replies": [{"body": "Pensions are in too much trouble to have rates hold at 0% since they are obligated to hold government debt. CalPERS had a 2.4% return last year vs the industry standard 8%. They need yield or grandma won't get her check. \n\nWhen you make interest rates this low, which in many arenas are now negative, then capital will look elsewhere for returns. As rates rise, capital will be even less inclined to park in debt since all assets will rise as well. Remember that MONEY is on the opposite side of ASSETS.\n\nInterest rates in a developed economy reflect the “option” value on the expected decline in purchasing power of money. If I expect it to decline by 5%, then I expect a profit, and say want 8%. You in turn will pay the 8% only if you think you also can make a profit above 8%, perhaps 10%+.\n\nThere is a notion out there that the equity market will crash once rates take off. There is no historical precedent for such a notion. In fact, historically the opposite is true. Stocks RISE when interest rates rise. ", "score": 3, "replies": [{"body": "Pensions hold real estate though was my thinking. But I guess debt is a non-issue for them so fair point, they would probably benefit from rising yields.", "score": 1, "replies": []}]}]}]}
