{"title": "Stagflation 2023: The Looming Economic Nightmare You Can't Afford to Ignore", "selftext": "Stagflation is a term used to describe a situation where the economy is stagnating, there is high inflation, and rising unemployment. It's a bad situation because as the economy slows down, people lose their jobs, and the cost of daily living expenses continues to go up. This creates a double whammy effect, and investments see lower returns. Stagflation has happened twice before in the US, in 1974-75 and 78-82. It's caused by supply shocks, bad monetary policy, or bad fiscal policy. Supply shocks happen when something goes wrong in the supply chain, and it could be de-globalization or an oil embargo, as it was in the 70s. Bad monetary policy or bad fiscal policy can overpower the recessionary effects and keep stagflation high.", "id": "125wsx4", "created_utc": 1680115158.0, "score": 78, "upvote_ratio": 0.79, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|1 year ago\n**Total Comments**|25|**Previous Best DD**|\n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "We have yet to see unemployment increase in any meaningful way. Tech companies are shedding the highest paid workers that can find new jobs in less than two weeks. We have a job market where there’s 2 jobs for every available worker. Covid caused many to leave the job force for good and they ain’t coming back. This is creating an interesting environment and we def are in for some pain, I’m just not sure where it’ll come from", "score": 72, "replies": [{"body": "Unemployment calculations were changed in 2008 or 09 to allow part time/temp/short term work to count as \"employed\" removing you from the unemployment #'s.\n\nNumbers haven't been true since then", "score": 13, "replies": [{"body": "I know they changed the formula somehow. You’re saying the number is higher than what is presented right?", "score": 4, "replies": [{"body": "look up labor participation rate", "score": 3, "replies": [{"body": "Look up u6", "score": 2, "replies": []}]}, {"body": "Much higher.  I'll dig up the info for you.  There were multiple ways the calculations changed.", "score": 3, "replies": []}]}, {"body": "Not in the U6 they aren't. And that number is low as shit.", "score": 1, "replies": [{"body": "U6?", "score": 1, "replies": [{"body": "Unemployment number has several categories. U3 is what's commonly reported in the news and looks at people who are unemployed and looked in the past 4 weeks. U6 doesn't include that time restriction, includes people who've given up looking either cause they are discouraged or have left the work force but plan to come back at a later date, and includes part time workers who want full time work.", "score": 5, "replies": [{"body": "Thanks. Cheers mate! 🥂", "score": 2, "replies": []}]}]}]}]}, {"body": "Unemployment is a *lagging* indicator. Jfc it’s like people can’t read a simple chart.", "score": 17, "replies": [{"body": "Banks failing are also a lagging indicator. If JPOW stops raising rates now, we’ll feel the effects towards the end of the year. It’ll be interesting to see if unemployment ticks up meaningfully in the next few months or not", "score": 8, "replies": [{"body": "Timing is difficult to pin down, but a fairly difficult recession is baked in the cake at this point. Love how the goal posts have moved from “soft/no landing” to “shallow recession”.", "score": 3, "replies": [{"body": "Got quite a few hard landing predictions out there now too", "score": 2, "replies": []}, {"body": "Well it started as \"transitory inflation\". Recession wasn't even in the discussion!", "score": 1, "replies": []}]}, {"body": "I don't think it will unless something drastic happens. I get the feeling like this is a unique situation in that the largest generation in history just jumped out of the workforce, but they are still alive and consume the same. So while the amount of net work required hasn't changed, there are no longer enough people to do it, who are now demanding more money. So inflation is rising, but unemployment is not going down because it literally can't unless the amount of work required to run society gets whittled down to the bare bones of what the current workforce can handle based on their numbers.\n\nThere are only 2 solutions I see. First, that the FED kills all unnecessary/unprofitable work via interest rates and a lot of people have to downgrade their job functions or just not work, which could last 20 years or longer based on the fact that lots of people have been deciding to not have kids. Second option is that AI rides in to save the day. That 300 million jobs affected figure should be viewed as a godsend, not a doomsday predictor. Countries should be dumping funding in to AI or it is going to get real bad for the kids currently being born.", "score": 1, "replies": []}]}]}, {"body": "Tech is not hiring.", "score": 2, "replies": []}, {"body": "Unemployment numbers are fudge.\n\nIf you go to the poorest housing project the unemployment rate will be under 3% because nobody is eligible to collect unemployment.\n\nEmployment rate is around 60%", "score": 5, "replies": [{"body": "Lol", "score": 25, "replies": [{"body": "Mad max/famine situation unemployment will be 0% strong strong jobs market.", "score": 1, "replies": [{"body": "Long as you have a fast truck and big guns", "score": 9, "replies": [{"body": "and brass nuts", "score": 1, "replies": []}]}]}]}, {"body": "🤦 \n\nPlease stop using the internet", "score": 17, "replies": [{"body": "What would happen to the unemployment rate if they changed the amount of time people could collect benefits to 99 weeks like in 2009?\n\nWould we still have a super strong job market with 3% unemployment?\n\nPeople who get their news from Good Morning America think 3% unemployment = 97% employment.", "score": 2, "replies": [{"body": "Those who fall off unemployment benefits are not seeking jobs. They are not unemployed. \n\nSenior citizens don't have jobs so should they be counted as unemployed?\n\nNo.", "score": 7, "replies": [{"body": "Unemployment rate uses the same math as Chairman Maos grain harvests.", "score": 8, "replies": [{"body": "Always a drought.", "score": 1, "replies": [{"body": "Always excellent grain harvests. Economy is strong.", "score": 3, "replies": [{"body": "5 year plan going well?", "score": 3, "replies": [{"body": "No because of the (insert minority party) meddling.", "score": 1, "replies": [{"body": "Same as it ever was.", "score": 2, "replies": [{"body": "Only since Nixon. Before that the US built all sorts of massive infrastructure projects like China does now.\n\nWe're only affluent now because everyone believes our tulips are actually worth something.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "So if they eliminated unemployment, nobody would be looking for a job and the rate would be 0%?", "score": 2, "replies": [{"body": "That's an utterly moronic thing to say. \n\nUnemployment rates reflect those who are seeking jobs and can't find one. \n\nThere are complexities with skill set misalignment and other factors that are hard to gauge. \n\nYour claim that true unemployment is at 40% is absolutely absurd. There are millions of job openings currently. A stay at home mom who is not seeking a job is not unemployed.  There are people who will not work, ever.", "score": 10, "replies": []}]}]}, {"body": "Learn what the labor force participation rate is ffs", "score": 2, "replies": [{"body": "What do you prefer as your source of propoganda? USA today or Good Morning America?", "score": -1, "replies": []}]}]}]}, {"body": "> Employment rate is around 60% \n\n\\*Hands 5 year olds and 90 year olds shovels to work in the mines because u/Fun-Transition1230 thinks they should be included in employment metrics\\*", "score": 7, "replies": [{"body": "It was around 60% in the 1950s when women stayed at home. Now workforce is about 46% women and it is still 60%?", "score": 0, "replies": [{"body": "Most adult women actually worked in the 1950s, you're thinking about the 1920s.\n\nAnd it's ALWAYS in the 60% range because about 1/3rd of the population is always either not of working age or infirm in some sense. This is why we don't judge unemployment against the whole census population.\n\nThe fluctuation over 100 years of the workforce participation rate is about 5%, topping off as the baby boomers hit the nadir (that means top) of their working age curve.\n\nBasically, you're complaining about a roughly 4% difference between now and the top in 1998 and hoping no one else is smart enough to realize what you're doing LOL.\n\nAgainst trend from 2000-2019, the participation rate is actually about 1% OVER projections and that's against 2020 census numbers, so it's an undercount.", "score": 6, "replies": [{"body": "LOL yes the same amount of women were in the workforce in the 1950s as today. Truck drivers, police officers, engineers, surgeons, etc... women didn't stay at home in the 1950s..\n\nAll of the baby boomers were raised by single moms too?", "score": 0, "replies": [{"body": "It doesn't surprise me that you're a binary thinker, because that's how people like you are.\n\nSo it's either \"women worked in everything\" or \"women didn't work.\"\n\nWhat they did in the 1950s, like my baby boomer grandmother, was to work part time jobs because demand was so high and pay was so good. Typically it was in the service industry, manufacturing, or administrative work... many worked as nannies, nurses, and teachers.\n\nYou're thinking of the 1920s and 1930s and prior when women were career-locked to specific positions like nurses. That ended with WWII when women entered the workforce and filled jobs as men were drafted.\n\nRemember Rosie the Riveter and the drive to employ women in manufacturing during WWII?\n\nOf course you don't, you don't actually know anything about this... in fact, you don't have any opinion that hasn't been given to you.\n\nBut go on, binary thinker, take that shovel and keep digging that binary thinker hole. Eventually you'll get it deeper than 2 inches LOL. Just try harder.", "score": 5, "replies": []}]}]}]}]}, {"body": "Real unemployment is approaching 20%\n\nYes the unemployment numbers are BS. Also the recently let go tech workers are not finding new jobs in 2 weeks.\n\nU6 is at 7.7% currently which is the closest we can get as it’s still based on people who have answered surveys about employment status.", "score": 3, "replies": []}]}, {"body": "U in Walla Walla, WA? Just had some Cayuse Syrah last night. funky like this market.", "score": 1, "replies": [{"body": "No, but you’re not the first person to ask me that.", "score": 2, "replies": []}, {"body": "Cayuse is lovely stuff. Bionic Frog?  Or?", "score": 0, "replies": [{"body": "Oh, a fellow cult wine bro. Just had their Cailloux. Bionic Frog's definitely for special occasions. I've only had one of their bionic frogs (02') and it was on another level. Didn't even taste like wine anymore.\n\nLike if Rick Sanches made it on Gazorpazorp.\n\nCan't wait to pop my 17' 'god only knows' grenache.\n\nI like Cayuse because it's the bridge between conventional wine and natural wine in the PNW (and maybe even the US). Critics scoring it 100 and saying they don't like biodynamic wines, yet with Cayuse, they make an exception.\n\nCheers!", "score": 0, "replies": []}]}]}, {"body": "Unemployment on its own though doesn’t tell\nYou the full picture.\n\nShifting demographics can cause labour force participation to be lower which would keep the unemployment rate low as well.", "score": 1, "replies": []}, {"body": "You are 100% Correct. Inflation will fix itself (because JPOW cannot) ,when things are to expensive people will not buy them. Interest rates should always run about 5 to 7 percent. I agree on the job market I personally will not be going back into the workforce.", "score": 1, "replies": []}]}, {"body": "JNUG then?", "score": 6, "replies": [{"body": "Back to the always dependable levered gold miners. Solid", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "This is the thing. Due to inflation, revenues could actually grow... but will be worth less...", "score": 2, "replies": []}]}, {"body": "And this sub will still not buy value. Small cap V is gonna kill it over the next decade my ass will be sipping martinis with gold flakes in them.", "score": 4, "replies": []}, {"body": "But in the late 70s, early 80s, mortgages were 13%, 15%, even higher.  Auto loans were in the low 20s.  I don't see interest rates getting that high or even close to it.  Color me skeptical of comparisons of today's economy to the stagflation when Eagles were pre-Joe Walsh.", "score": 3, "replies": [{"body": "We’ll need to see the gamblers go nuts over 25bps, as long as they do, 100bps is in the future", "score": 2, "replies": []}]}, {"body": ">Stagflation is definitely a difficult situation to be in. The economy slows down, people lose their jobs, and the cost of living expenses goes up. This creates a very tough environment for investments, as they tend to see lower returns during periods of stagflation.", "score": 7, "replies": []}, {"body": "We've seen stagflation play out in the past year. We will soon be heading into just straight up stagnation/deflation very soon.", "score": 2, "replies": []}, {"body": "Is this the support group for put holders?  Fear mongering seems to help justify mistakes", "score": 4, "replies": []}, {"body": "Stagflation? Bullish ![img](emote|t5_2th52|4276)", "score": 4, "replies": []}, {"body": "More fear porn.. market will not fall under $380 the bottom is in.. calls on AI", "score": 4, "replies": [{"body": "So you're saying there's a chance it goes back to 380? Like b4 Friday?", "score": 3, "replies": []}, {"body": "I’d invest in a cardboard box before you’re priced out.", "score": 2, "replies": []}, {"body": "Its going to $330", "score": 1, "replies": []}]}, {"body": "Imma ignore it. Thx", "score": 1, "replies": []}, {"body": "Agree stagflation is bad, but that seems to me a particular phenomenon of the mid-to-late 1970s and not anything to worry about now.", "score": 0, "replies": [{"body": "Oh yea I’m sure it’s different this time…", "score": 2, "replies": []}]}, {"body": "I live in ID. I was mailed 2 papers. \n\n1 was a paper stating that I was denied my unemployment request.\n\nThe 2nd was a paper stating that I was denied PUA  with my unemployment request. \n\nI have been self employed since 2017.\nI have NEVER filled unemployment from 2017 forward OR PUA. \nIt shows my unemployment quarterly earnings was $9k each for 2019?🤷🏻‍♂️ but nothing after that. \n\nIs Idaho Labour Department shadow filing for people to inflate unemployment or denile of unemployment benefits to alter statistics? I know of 2 others here locally, that are self employed, that have recieved the same papers. NEVER FILING. I don’t know what this would do for statistics. I’m only asking questions. \n\nPUA = Pandemic Unemployment Assistance\nThe $200/wk or $600/mo thing that people were given. \n\nI never got it. It ended in 2021 June as far as i know.🤷🏻‍♂️", "score": 0, "replies": [{"body": "Could be fraud", "score": 6, "replies": []}, {"body": "Sounds like someone is stealing yalls identities.", "score": 2, "replies": []}]}, {"body": "Ask people in UK about Brexit", "score": 0, "replies": []}, {"body": "Inflation is coming down too fast still. It’s a topic for debate apparently but I don’t think we will see stagflation. Unless it will last for 3-6 months, in which case, who cares", "score": 0, "replies": []}, {"body": "Is it puts? On what? History lesson was great but get to the point.", "score": 1, "replies": []}, {"body": "You don’t know what I can and can’t afford", "score": 1, "replies": []}, {"body": "Are you really still taking about supply chain? You absolutely belong here. lmfao", "score": 1, "replies": []}, {"body": "wsb : where chimps who gamble like to have delusions of grandeur that they are economists", "score": 1, "replies": []}, {"body": "We never had it with a gold standard.  We avoided it after the unofficial PEG of oil to dollars. The petro dollar system is eroding, especially after the deal between Brazil and China", "score": 1, "replies": []}, {"body": "And I don't see much being headlined in the news about the US Dollar's dominance coming to it's end, about It's impact here at home. It's really concerning given the current situation with these regional banks and big ones.", "score": 1, "replies": []}]}
