{"title": "Will the death of the regional banks be the death of US economy?", "selftext": "What do you guys think? How deep can this crisis spread?\n\nThere's a ton of fear in the market and healthy banks are going down the drain. To the extreme, that would create a monopoly on the banking sector by the too big to fail banks. In that case, does it actually matter for the economy? China only has a handful of state owned banks, and they pretty much can't fail since they are backed by the printer. So maybe it's something that's solved once and for all? \n\nSince banks can only operate on a fractional reserve basis (ie they lend out 1000 dollars when they have 100 in deposits), or else we'd be paying the banks to safeguard our money. Whenever people pull out large sums of money at once, no bank can actually withstand that.\n\nWould this scenario be possible:\nDeath of small banks> feds printing money to cover insured deposits> devaluation of USD > sell off of USD for Euros > further decline of USD > inflation due to higher import fees plus the printing", "id": "11x7tbh", "created_utc": 1679376390.0, "score": 42, "upvote_ratio": 0.7, "num_comments": 67, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|3 days ago\n**Total Comments**|9|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Small banks are very important as they are not held by the same lending standards as big banks, it is easy to get a personal loan or a car loan or a small business at a small bank like a credit union than a big bank", "score": 43, "replies": [{"body": "Yeah that's what I'm thinking too. The big banks are quite automated, and you have to fit the cookie cutter portfolio unless you are a big company. Consolidation is going to hurt small local businesses.", "score": 16, "replies": [{"body": "Well if the plan is to own nothing and not be able to compete nothing seals the deal like a move like consolidation of banks.", "score": 5, "replies": []}]}]}, {"body": "I think the \"death\" of regional banks is a fear tactic to get people to big banks. Don't buy in and let's see if the big banks can collapse. Small banks across the country have really clean balance sheets and managed risk. In fact about a month before all this hit, we had a meeting on bank risk and how larger banks were tending to have riskier profiles than their small bank counterparts that are partners.", "score": 27, "replies": [{"body": "This is absolutely what's going on.\n\nManufactured panic for the imminent collapse of banks was rampant after the initial two collapses until a day or so ago. Just big banks or regards who bet for back failure", "score": 12, "replies": []}, {"body": "Yeah but if they don't care about small banks?", "score": 1, "replies": []}]}, {"body": ">There is a very real possibility that this crisis could lead to the death of small banks, as well as inflation due to the printing of money by the Federal Reserve. If people begin selling off USD for Euros, it would further devalue the dollar and lead to even higher import fees.", "score": 10, "replies": [{"body": "Huh? You think people are going to flee to the Euro?  Do you know what’s going on in Europe right now??? On top of all the crap going on in Europe, our government virtually acknowledged that they are going to guarantee all deposits.  The eurozone does not have a monolithic FDIC and is insured on a country by country basis, if at all.  Capital is coming to the US brosef, from Europe.", "score": 1, "replies": []}, {"body": "This mod smashes! ![img](emote|t5_2th52|8882)", "score": 0, "replies": []}]}, {"body": "US is one of the few countries that have regional banks at all. Well be fine.", "score": 10, "replies": []}, {"body": ">sell off of USD for Euros\n\nNope. After energy separation Europe from Russia, US literally have full control of Europe. If shit really hit the fan, US crush Eurozone and start capital run into USD.", "score": 8, "replies": []}, {"body": "As funny as it is to meme about bank failures, it's really really bad for us all if regional banks start to fail. I hope the fearmongering ends soon and the banking sector goes back to normal.", "score": 22, "replies": [{"body": "I'm still using the toilet paper I hoarded from covid![img](emote|t5_2th52|27189)", "score": 2, "replies": [{"body": "You never got a bidet? F’ing savage", "score": 4, "replies": []}, {"body": "Toilet paper? I’m hoarding the long CVS receipts with coupons and selling the hoarded paper. The rich have to wipe their asses, too.", "score": 5, "replies": []}]}]}, {"body": "Banking will follow the trend of every single other industry and consolidate. 5 years from now, the number of banks will be less than half. And half again after that until there's only half a dozen left.", "score": 16, "replies": [{"body": "Until the only bank is the Fed and the Dollar is the CBDC.", "score": 5, "replies": [{"body": "There's no banksters profit in that. The CBDC will be licensed out to the trusted few banks who will run the issuance of the currency.", "score": 5, "replies": []}]}]}, {"body": "Trillions of global bonds are underwater relative to inflation and current bond prices. If governments print, inflation will kill savings but erase debt. It will be bad for people who did the right thing. If governments fight inflation, the system could collapse into a deflationary recession and cause a lot of unemployment. People will be out of work, savers could lose their investments as these companies collapse.\n\nIt’s a damn if you, damn if you don’t situation but the Fed is trying to thread the needle or kick the can down the road. Chances for a soft landing is extremely slim now.", "score": 4, "replies": []}, {"body": "You know there is no fractional reserve requirement in the United States since 2020 right? 💀💀 you been bamboozled now you can see why lending infinite money you don’t have can possibly cause a issue now lmfao", "score": 4, "replies": []}, {"body": "The economy already died in 2008-09, when Fed Congress started printing trillions of dollars to keep the so called \"free market\" afloat and let rich people keep hoarding as much money as they could. Then a massive tax break as soon as Trump become president. That literally popped the nasdaq double in value in 4 years time. This economy is dead man walking. Someday the world will lose faith in dollars and the whole whole global economy will crash. There will be no rich and poor as money won't mean anything. Half of the world currency already has no value compared to USD. Inflation running 50-100% around half of the world. The modern concept of money and the economy is already broken.", "score": 11, "replies": [{"body": "Doomers are too fucking funny", "score": 6, "replies": [{"body": "Srsly.  These dudes out here jacking off to the “death” of the economy have never taken anything beyond a high school Econ class.", "score": 3, "replies": [{"body": "Growing up I heard this exact same thing but the moment the economy became dead man walking it was Nixon taking us off the gold standard. It was probably Bretton Woods before that. And before that WW1, bimetallism before that, Civil War before that.", "score": 1, "replies": []}]}]}, {"body": "While the dollar may collapse, real estate and similar assets will still have value.", "score": 2, "replies": []}, {"body": "The dollar is doing well right now, it seems this crisis is only helping it.  The US by some miracle has only managed to strengthen our currency during each crisis instead of the opposite, folks were probably saying the same thing when we came off the gold standard in the 70s.", "score": 1, "replies": []}]}, {"body": "I don’t think all or most regional banks will fail, unless they took heavy risks. But small ones should survive or be bailed out just like how they bailed out the recent ones. I am just preparing my stuff early so that I can get a good spot in a Hooverville. I guess nowadays it would just be tents by the side of the road.", "score": 3, "replies": []}, {"body": "No. But yellen sure is trying.", "score": 3, "replies": []}, {"body": "No death of small banks.  They serve customers big banks don't want.", "score": 6, "replies": []}, {"body": "No. Full stop.", "score": 2, "replies": []}, {"body": "Hello, Canada’s calling. What are regional banks lmao", "score": 2, "replies": [{"body": "It's like national Bank of Canada and bank of Nova Scotia", "score": 3, "replies": [{"body": "Bank of Nova Scotia operates in all provinces", "score": 1, "replies": []}]}]}, {"body": "Yes. Yes it will be…this time is different…or maybe not they’ll print 10 trillions like everytime…", "score": 2, "replies": []}, {"body": "US economy is broken because both banks and people operate on a fractional reserve base. The banks get a 100 and lend out a 1000…the people make a 100 and borrow a 1000.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "What’s the correlation between client form of payment and the economy lol.", "score": 9, "replies": []}, {"body": "That’s crazy. I heard the signature thing is what’s really causing the whole crisis.", "score": 9, "replies": [{"body": "Lmao. If only they stopped using signatures before it was too late", "score": 5, "replies": [{"body": "One signature down, hey how many signatures we have on here?!", "score": 2, "replies": []}]}, {"body": "No that's a myth, it can all be traced back to Cramer's big mouth.", "score": 0, "replies": []}]}]}, {"body": "small banks have been dying for a long time. Actually allowing SIVB to fail and tarnishing the venture capitalist industry/Silicon valley would have been a much greater death blow, since VC  tech is the one thing US leads the world in", "score": 2, "replies": []}, {"body": "nah the economy has been a zombie for years. this just might get it finally put down.", "score": 0, "replies": []}, {"body": "No, Its commercial RE, Insurance and finally our dear homes. Frothy needs to come out until naked!", "score": 1, "replies": []}, {"body": "Well I’d say the economy died a long time ago…but no, the big banks will just get bigger", "score": 1, "replies": []}, {"body": "Market is nuclear green and flipping over the 200ma with positive macd right now. Not sure I'd agree with \"a ton of fear in the market\". Today, the market is acting like the bottom is in and the worst is behind us.", "score": 1, "replies": []}, {"body": "Bitcoin is the future. Banking is a thing of the past now. Get with the times boomer.", "score": -11, "replies": []}, {"body": "It’s very much possible. \n\n\nBut you also have to consider that it is not", "score": 0, "replies": []}, {"body": "I'm hoping it'll lead to UBI", "score": 0, "replies": []}, {"body": "Did you just miss how fucked Europeans are..? CS isn’t America. We’ll be fine in comparison.", "score": 0, "replies": []}, {"body": "We seem to do just fine in Canada without small regional banks. You’ll be fine", "score": 0, "replies": []}, {"body": "You must not know how a capitalist economy works. When the inferior competitors go out of business, better competitors pop up in their places, without a doubt you have to believe that the Mega banks are already drafting charters for \"regional wing\" banks", "score": 1, "replies": []}, {"body": "The US economy died a while ago.  We have been surviving on the corpse of Fait for decades.  All this consolidation will do is 'maybe' extend the elites capacity to continue ruling us for a little while longer.", "score": 1, "replies": []}, {"body": "Maybe not death, but another huge crisis definitely.", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "maybe", "score": 1, "replies": []}, {"body": "Who needs banks with cbdc?", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "I feel banks backing crypto are the ones accidentally failing.", "score": 1, "replies": []}, {"body": "Idk I’m just buying BTC", "score": 1, "replies": [{"body": "Crypto and DeFi are my safe bets right now. Besides I can now make online payments with crypto payment gateways like Utrust, Bitpay, and Pay Bolt which is one of the reasons why I need fiat.", "score": 1, "replies": []}]}, {"body": "Lol nobody trusts the euro either", "score": 1, "replies": []}, {"body": "The boom bust cycle is all about debt. When money stops being borrowed, a bust occurs. And a boom starts when money starts being borrowed again. So the leaders going under will create a bust.", "score": 1, "replies": []}]}
