{"title": "Credit Default Swaps on Charles Schwab!", "selftext": "[Charles Schwab CDS](https://64.media.tumblr.com/d657b70a75a4bf968f876bb4583b7e73/17988cc52eae4625-67/s2048x3072/3fee0969c902ba0beb39076696a391799d246795.pnj)\n\nvs\n\n[JPM CDS](https://64.media.tumblr.com/a5d4dc5ec44f1775aa68e48f8b24e2da/0cbba1ffa7e70d15-c0/s2048x3072/15b0ae38ff5d80d474829d6a30f6f6993309a428.pnj)\n\nYou can even seen the price go up well before SVB (banking crisis as a whole) went under. If I had to take a guess, the company owns a ton of US treasury bonds that are all low rates from 2020/2021 (or before) and fed rates going up have started to burn up those investments which means a potential liquidity crisis for them as rates climb. So for their sake, they need rates to stop at the fed's target rates otherwise it could be GG for them if the fed doesn't stop at it's target rate.\n\nIf it means anything, many other US banks are seeing the same thing.\n\nSo take what you will from that.", "id": "1253buq", "created_utc": 1680039632.0, "score": 116, "upvote_ratio": 0.8, "num_comments": 77, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|1 week ago\n**Total Comments**|104|**Previous Best DD**|\n**Account Age**|1 week|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "As someone who has basically all my money in schwab, schwab can't possibly be in trouble.... ![img](emote|t5_2th52|18630)![img](emote|t5_2th52|18630)![img](emote|t5_2th52|18630)", "score": 150, "replies": [{"body": "I'm with you on that one. Tdameritrade.", "score": 43, "replies": [{"body": "I miss ScottTrade", "score": 19, "replies": [{"body": "Scotty doesn’t know", "score": 14, "replies": [{"body": "ScotteVest is a way better name. Too bad it’s a vest.", "score": 2, "replies": []}]}, {"body": "I interned there when they got bought out and also that place was depressing as fuck.", "score": 6, "replies": []}]}, {"body": "Td all day . So schd¢€??", "score": 3, "replies": []}, {"body": "Isn’t Schwab buying tdameritrade", "score": 1, "replies": [{"body": "They already did a few years ago. I assume I fall under the Schwab umbrella even though everything is still under tdameritrade.", "score": 1, "replies": [{"body": "Ah okay I was gonna say the think or swim app is changing to Schwab or something soon probably offer the same thing just different advertised name I’m thinking.", "score": 2, "replies": [{"body": "Yep. It was supposed to roll over last year. Got delayed.", "score": 1, "replies": []}]}, {"body": "Former Scott trade now TD ameritrade account holder here. I just got an email last week that everything will transition over to Schwab over the Memorial Day weekend.", "score": 2, "replies": [{"body": "Nice. Thank you for the heads up!", "score": 1, "replies": []}]}]}]}]}, {"body": "I was swapped to schwab by usaa after they shuttered their investment banking segment. Fairly sure the government will step in and keep schwab going, considering how many past military families got forced to use them.", "score": 8, "replies": [{"body": "Government save veterans? ![gif](emote|free_emotes_pack|joy)![gif](emote|free_emotes_pack|joy)![gif](emote|free_emotes_pack|joy)", "score": 21, "replies": [{"body": "I agree that is perhaps one of the dumbest things I’ve heard in a while. <1% of the population knows someone who served in the military = zero political pressure to not completely screw these unfortunate souls (myself included). Schwab would simply make less money if all deposits were withdrawn.", "score": 1, "replies": []}]}]}, {"body": "It’s not. It’s fine. \n\n\nAOCI is accumulated other comprehensive income. It’s where mark to market losses go. The bonds they hold to earn revenue from are low yielding so when you adjust their value to market, it’s less. \n\n\nIf they classify them as they’ll hold them to maturity then no loss reporting required. \n\n\nQuite a dumb differentiation that has to be reported and for some reason people think is an important piece of information. \n\n\nSchwab isn’t over leveraged, doesn’t have any connected big groups like Silicon Valley did, and only earns half its revenue (not income) from traditional bank activities. \n\n\nAt worst, if people did move their investment accounts out of Schwab en masse, then Schwab would just make less money. \n\n\nInvestment accounts aren’t handled like banking with fractional reserves. So any bank run won’t lead to the bank failing. For deposit side, with fed liquidity door open there is no issue in providing people their money. \n\n\nRisk of failure is zero. \n\n\nRisk of lower profits is existent.", "score": 35, "replies": [{"body": "so risk of lower profits = PE drops = their stock can be $5 vs $50 but no bk?", "score": 4, "replies": [{"body": "Ya essentially", "score": 4, "replies": []}]}, {"body": "Yeah, I know...", "score": -2, "replies": [{"body": "No you don’t", "score": 17, "replies": [{"body": "Alright. Guess I'll go drool on myself and stare at the sun somewhere else then.", "score": 24, "replies": []}, {"body": "Lol", "score": 3, "replies": []}]}]}]}, {"body": "You're money are in blown up shitty ass US treasury bonds selling at discount yielding a 1% return lol. \n\nTranslation:\n\nYou're poor now, congrats.", "score": 2, "replies": [{"body": "Aggressive....\n\nactually the sweep on my account is into mm yielding 4.5%. This and other schwab funds would likely have problems in the event of inadequate liquidity. But no, my money is not in Schwab savings or checking...", "score": 8, "replies": []}, {"body": "F your puts", "score": 3, "replies": []}, {"body": "Why are you the way you are?", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|29093)", "score": -1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 29, "replies": [{"body": "A 10 day old account with 15 posts, of which 4 are related to Schwab… Not suspicious at all", "score": 14, "replies": []}]}, {"body": "This guy has had an account for a week. Guess he bought options", "score": 25, "replies": [{"body": "I’ve always had options.\n\nI recently deleted my main for posting stuff here I shouldn’t of", "score": -19, "replies": [{"body": "Shouldn’t have* you regard. I don’t take financial advice from someone who can’t write at an 8th grade level", "score": 24, "replies": []}, {"body": "Now I just wonder what whacky shit you said that made you delete your main account lol", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I found him, FBI, come get him!", "score": 1, "replies": []}]}]}]}, {"body": "he go all in on long puts", "score": 1, "replies": []}]}, {"body": "Rates went up fast. The damage is done. Rates maybe up another .50. Not a big deal. What’s done is done. \n\n\nRisk of failure is zero. \n\n\nAt worst, lower profits, that’s all. \n\n\nSchwab performed among the top for stress testing.", "score": 37, "replies": [{"body": "Didn’t Credit Suisse ace the Fed stress test?", "score": 8, "replies": [{"body": "No. They had along the highest additional capital requirements imposed on them.", "score": 21, "replies": []}]}, {"body": "Why would their cds be spiking if they performed so well in stress tests? That doesn't really make a lot of sense.", "score": 4, "replies": [{"body": "Stress test is historical genius.", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|29093)", "score": 10, "replies": [{"body": "Perfect!", "score": -7, "replies": []}]}, {"body": "Can we start calling them “Credit Default Schwabs” instead ?", "score": 36, "replies": []}, {"body": "Their average maturity is 3 years, the most they have lost on average is 10%", "score": 3, "replies": []}, {"body": "it’s the accounting rules that they have to recognise a loss for hold-to-mature treasuries.\n\nIf the bank does not sell its HTM treasuries and holds them until maturity, then the accounting principles for HTM securities generally do not cause any trouble for the bank. The bank will continue to earn interest on the securities and will record the interest income on its income statement.\n\nHowever, since interest rates rise, the value of the HTM securities may decline in the market, but the bank will not have to record this decline in value on its balance sheet as long as it continues to hold the securities until maturity. This is because, under HTM accounting, the securities are not marked-to-market and are instead recorded at their amortized cost.", "score": 4, "replies": []}, {"body": "A credit default swap is a financial swap agreement that the seller of the CDS will compensate the buyer in the event of a debt default or other credit event. That is, the seller of the CDS insures the buyer against some reference asset defaulting.\n\nThis shows that Schwab is actually a well managed company and the ceo actually has a brain and can see there's a possibility of a credit default so he's essentially hedging beforehand to profit from the collapse.\n\nBut Schwab, like many other banks, has been losing deposits as rates have risen with people moving their cash to higher yielding accounts. Schwab had $366 billion in deposits at the end of 2022, down 17% from the end of 2021.\n\nSo Schwab holds $83.18B in cash and $37.88B Debt. So in the case of a bank run where will have to cover $366B deposits which they don't have. Schwab has $8.25B in HTM (Held to maturity) securities that are deep in the red that they can borrow off of.\n\nBanks can borrow against their bonds since fed is backstopping everything so they will have a extra $8.25B + $83.18B cash so a total of $91.43B for withdraws. So they can cover 25% of their total deposits in the case of a bank run.\n\nThe required reserve ratio for banks is 0%. On March 15, 2020, the Federal Reserve set the reserve requirements for banks to zero. As of February 2, 2023, the reserve requirement for banks is still zero. As such, there is no requirement that banks have to keep any portion of customer deposits on hand.", "score": 4, "replies": []}, {"body": "Say « SWAPS SCHWAB » 10 times looking at you in the mirror and you become Jason Maraz", "score": 3, "replies": [{"body": "That's very creative malar. Gold sticker for you!", "score": -4, "replies": [{"body": "My first one!! Where is it?", "score": 2, "replies": []}]}]}, {"body": "They’re good, the Fed will save them.", "score": 3, "replies": [{"body": "Ya all good!", "score": -1, "replies": []}]}, {"body": "You can see what investments a bank is holding and how much their unrealized losses are. Banks file quarterly financial statements called “call reports” which are public information. Do a search for call report, then find the investment information in schedule rc-b.", "score": 3, "replies": []}, {"body": "I don’t know what “GG” means.", "score": 4, "replies": [{"body": "Grandmas Gooch", "score": 20, "replies": []}, {"body": "Good game.", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4258)", "score": -2, "replies": []}]}]}, {"body": "Holy shit!  Are they that fucking regarded? Time will tell!", "score": 2, "replies": []}, {"body": "Can you explain in emojis?", "score": 1, "replies": [{"body": "I can.\n\n&#x200B;\n\n![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4267)  \n![gif](emote|free_emotes_pack|downvote)\n\n![img](emote|t5_2th52|4641)\n\n![gif](emote|free_emotes_pack|downvote)\n\n![img](emote|t5_2th52|29093)\n\n![gif](emote|free_emotes_pack|downvote)\n\n![img](emote|t5_2th52|19738)", "score": 6, "replies": [{"body": "Uh oh!", "score": 1, "replies": []}]}]}, {"body": "so what you are saying is… they will lost 100% of their depositors, all brokerage customer will leave and loans get defaulted on. under those condition they wont be able to operate and therefore is a bad company? I am sorry but its like saying if tomorrow onwards no one buys anymore apple product appl will eventually go under…", "score": 1, "replies": [{"body": "Yep! Exactly.", "score": -1, "replies": []}]}, {"body": "Inb4 they spin of their banking segment and it implodes", "score": 0, "replies": []}, {"body": "I heard they changed the UI of their trading platform and its fucking miserable yo use now.", "score": -3, "replies": [{"body": "They are taking over think or swim", "score": 1, "replies": []}]}, {"body": ">I'm not sure what you're trying to say. Are you saying that the price of SVB stock is going up because they own a lot of US treasury bonds? If so, I don't see how that would be relevant since the price of those bonds would go down if interest rates rise.", "score": -10, "replies": [{"body": "Bot needs his oil changed...", "score": 11, "replies": []}]}, {"body": "Looking at its balance sheet…best of luck to y’all", "score": 1, "replies": []}]}
