{"title": "$META and $SNAP watching the TikTok CEO getting roasted by Congress and eventually banned", "selftext": "", "id": "11zlm4w", "created_utc": 1679580681.0, "score": 794, "upvote_ratio": 0.96, "num_comments": 69, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|471|**Previous Best DD**|\n**Account Age**|10 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Is this copium for those who bought snap at $70", "score": 156, "replies": [{"body": "Those are rookie numbers. Gotta pump that average up!", "score": 20, "replies": []}, {"body": "Bought SNAP after it was cut more than 50% and still reeling from that trade. Luckily I bought it around the time Elon bought my TWTR. Not sure if the folks who bought at $70 will ever see their money back or if they just gave up and tax lost harvested.", "score": 6, "replies": [{"body": "My average is $12.3, and I am not sure if I can break even any time soon. I’ve been waiting since July 2022.", "score": 5, "replies": [{"body": "$12.3 should be fine if you can diamond hands for real. \n\n[The guy who lost his life saving on Luckin Coffee](https://www.reddit.com/r/wallstreetbets/comments/gveon3/ive_lost_240k_on_luckin_coffee_all_my_life/) would have been in the green if he had held after it dropped to less than $1 and then rebuilt itself to the $25-30 range where it is now.", "score": 5, "replies": []}]}, {"body": "Why is there a cap on investment losses and why is it so low?", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|18630)", "score": 2, "replies": []}, {"body": "Absolutely. Snapchat, Facebook and Instagram are all boomer apps now. If tiktok sheds users they won’t migrate there.", "score": 1, "replies": []}]}, {"body": "Aren't you supposed to remove that tag off the sleeve after you buy it or is he leaving it on there so he can return it to the store after he wears it a couple of times?", "score": 32, "replies": [{"body": "Traditionally yes, but now it's become the same thing as keeping the sticker on your baseball cap... it all started with Gucci suits too...", "score": 15, "replies": [{"body": "Here's a GQ story from 2003 discussing how it was a trend in the recent past ... back then.  [https://www.gq.com/story/label-on-sleeve](https://www.gq.com/story/label-on-sleeve)\n\nI am personally used to seeing labels on the inside lapel.  Maybe I just bought the wrong brands.  \\*shrug\\*\n\nAs for the shirtless wearing of suit jackets, I don't know how to explain that.", "score": 6, "replies": [{"body": "Man, I guess fashion is cyclical, cause this article was written 20 years ago 😂", "score": 5, "replies": [{"body": "Yeah, exactly!", "score": 2, "replies": []}]}]}]}, {"body": "https://www.youtube.com/watch?v=5pKt4gaErvU", "score": 2, "replies": []}]}, {"body": "I wouldn’t say roasted. Looked more like the people asking questions didn’t know what they were talking about. I especially like the CEOs comment on Cambridge Analytica. If they really cared about our data they would finally address consumer privacy.", "score": 15, "replies": []}, {"body": "Metas algo is already similar to TikTok. I already see the same people I did on TikTok. Similar content too.", "score": 11, "replies": []}, {"body": "Meta at 99 was a good buy for me...let's go!", "score": 9, "replies": [{"body": "When are you getting out?", "score": 3, "replies": [{"body": "When it drops to 50 of course", "score": 12, "replies": [{"body": "https://preview.redd.it/rrmt8a32qmpa1.png?width=2391&format=png&auto=webp&s=fedf6cce1fd9f50ef688ee0faa1bc03b0fa4cce4", "score": 3, "replies": []}, {"body": "But not before it breaks out to 180 then tumbles all the way back down to 50", "score": 2, "replies": []}]}]}]}, {"body": "$SNAP call", "score": 5, "replies": []}, {"body": "Remember we would all together collectively laugh at these techno-illiterate old geezers asking questions that make no sense?\n\nNow people are backing them and their ridiculousness just because it's TikTok.  😭", "score": 9, "replies": [{"body": "The number of times the TikTok CEO guy paused out of confusion, not sure if he was properly understanding the stupid ass questions he was being asked was hilarious.\n\nOne guy was literally like IS YER APP SCANNIN’ MUH EYEBALLS\n\nNot to mention the guy that asked if the app connected to his home Wi-Fi network as if that’s a malicious action\n\nThere were a couple times he looked around the room like “Is anyone else hearing this shit? Am I going nuts?”\n\nYou could see this dudes brain short circuiting as he realized he’d have to explain like 9 different things about the way apps, phones, and networks function to explain why the questions were stupid in the first place\n\nSo fucking funny", "score": 13, "replies": []}]}, {"body": "Wait till they don’t ban it", "score": 5, "replies": []}, {"body": "Imagine telling somebody from 1995 that a social media internet page would be worth 500 billion dollar.\n\nI think Apple is overvalued too, but at least that equipment is useful.\n\nFacebook is neither useful nor entertainment - just addiction.", "score": 9, "replies": [{"body": "It's worth 500 billion because it generates 100 billion in revenue each year, and 25 billion in pure profit, it literally prints money out of thin air, it's also super useful and entertainimg to literally 3 billion monthly active users, I have no idea how u think it's overvalued", "score": 7, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Internet forum", "score": 2, "replies": []}]}, {"body": "‘Nor entertainment -just addiction’ my friend that’s contradictory", "score": 1, "replies": []}]}, {"body": "Nobody under 35 is going on Facebook, even if it was the only option. It’s been the “old people” social media platform for years. Just dump Meta stock before they try something like creating a “new” palm pilot and hailing stylus technology as something people want", "score": 8, "replies": [{"body": "Dumb take.  \n \nMeta owns insta and FB, both of those are the best monetized social media platforms out there, nobody else has a business model that lends easily to proper monetization... Which is why Twitter is failing and TikTok, while popular, was just losing boatloads of money as well.  \"Influencers\" getting paid to advertise products doesn't make TikTok any money. \n \nBusinesses can setup on fb and insta and they can market direct to customers in specific areas in incredibly easy ways for relatively extremely cheap.  \n \nPeople sleep on that because of dumbshit VR, but that was just a great opportunity to buy more.", "score": 37, "replies": [{"body": "I still wonder if people being influenced by influencers even exist", "score": 10, "replies": [{"body": "I mean, I mock \"influencers\" because the title is fucking stupid, but they are snake oil salesmen, it's sales just like every other sales person since the first person tried to sell something to someone else.  \n \nSocial media is simply the means by which they reach an audience.. and there is unbelievably incredible amounts of money in providing that audience . Hell that's googles entire business model, providing an audience.  \n  \nMarketing is massive, which is why meta is good, because the other social media platforms pay all the money to build the audience but have no real effective wab to monetize the monetization of that audience. Both FB and Instagram are well positioned, FB because it's easy for local business to advertise to local people, and Instagram because it's easy for businesses to advertise to interests or areas.  \n \nSo you, as a business, can effectively advertise via those mediums and see decent returns on your money vs paying, say google, and hooing people are searching for you.  \n \nTiktok is easily monetized by influencers who have a large audience via the app.. but like vine before it, it struggles to find an effective way to monetize it's platform. How dk you make money off others selling goods on your platform when they don't do it through your platform... \n  \nAnd that's why meta will continue to print money and they don't really have the competition that people think they do.   \n  \nStuff like Pinterest to me is much more likely to be a lot more successful moving forward, and if TikTok managed to do Pinterest like product tie in maybe they would change the game.. but they are a long ways from that and who knows if they could actually even pull that off", "score": 2, "replies": []}, {"body": "Of course they exist, i mean; never heard of propaganda and opinion forming? When enough people force one narrative or another, you get what you get. And if you are talking about fashion and stuff, i guess VANS kid built an insane business just form influencers, so i guess it works.. \n\nOh yeah, Beats by dr DRE, when every celebrity were wearing those and it influenced everyone to buy that overpriced garbage which sounded awful, whilse costing 200$ and were worse than 30$ headphones, at least when apple bought them, fixed the sound issue somewhat.", "score": 1, "replies": [{"body": "I may be living under a rock then, potentially next to a pineapple for all I know.", "score": 1, "replies": [{"body": "Im with you on this one, the examples i told you were from \"general knowledge\" i cant care less about influencers, or chasing the next \"fad\" or other nonsense, but masses do get influenced, you just have wrong friends, or id say right ones, if you never encounter that bullcrap.", "score": 1, "replies": []}]}]}]}, {"body": "And WhatsApp - don’t think ppl in the 🇺🇸 realise everyone in europe uses it", "score": 4, "replies": [{"body": "*Everyone outside the USA. It has 2 billion active monthly users...\n\nIts not really social media though, it's just a better messenger than the others.", "score": 2, "replies": [{"body": "Yep not debating whether it’s social media. I’m more surprised that people on here seem to judge meta’s worth by whether People use Facebook or not instead of looking at all the diff parts of the company. Eg do Americans know how widely used WhatsApp is?", "score": 1, "replies": [{"body": "Does whatsapp make money? I've had it years and never seen an ad or anything", "score": 1, "replies": [{"body": "There’s a business version , which can auto reply to queries etc", "score": 1, "replies": [{"body": "Which does charge", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I agree. the whole bandwagon of zuck bad rreeeeee is moronic.", "score": 6, "replies": []}, {"body": "So what is their business?", "score": 3, "replies": [{"body": "Marketing.  \n \nData sales and advertising. That's their business, just like google. FB and Insta are just a hook to build advertising profiles, which they then sell to companies or individuals looking to sell products.   \n  \nThat is FBs business, and it is still good.  \n  \nI disagree with the person above, I think them trying to reinvent the wheel is just taking on costs they don't really need.. apple is what apple is not because they are on the cutting edge of tech. They never were. They have always stolen other people's ideas after the other people did all the hard work. Apple is one thing: simple products for simple people.  \n \nIf you struggle with complex stuff you can buy the apple version and it will do exactly what it was advertised to do very intuitively out of the box. Reliably.   \n  \nIf you need an apple to do anything outside of it's little design box you will either struggle, or it won't do it. But as long as it's within that little box of what apple decided you were allowed to do with it, you will do well.  \n \n \nI think FB should expand into a Pinterest style option, more e-commerce support but not quite all the way Amazon or the like.  They could easily compete with Etsy,Pinterest, etc without spending much or taking much of the risk on, and it would fit well within their current ecosystem. Obviously Pinterest isn't making huge amounts of money, that's not the point though.. if they found a way to combine social media in general with product advertising like on Pinterest in a not overly intrusive way then all the data they collect and advertising they sell would be in-house more and less suceptible to outside forces like apples privacy settings on their phone (because apple wants to be the one making money off you not meta or google). They need to not just be the middleman and the billboard, but provide a platform that bridges that last gap. Marketplace kind of starts that but it really isn't all the way there yet.. I feel like they have a LOT of room tk expand in that direction still and in doing so they would make their data and advertising much move valuable.\n \nBut that's just me.", "score": 6, "replies": []}]}]}, {"body": "Nobody buys shit advertised on FB, unless it’s some pro gun tshirts or MLM garbage", "score": -4, "replies": []}]}, {"body": "When India banned TikTok, Instagram Reels became the main replacement.", "score": 1, "replies": []}]}, {"body": "I hope TikTok does not get banned. I use it for so much fun and information.", "score": 4, "replies": [{"body": "Lol such a bot.", "score": 4, "replies": [{"body": "no I'm human", "score": 1, "replies": []}]}]}, {"body": "He’ll just make some campaign donations and all will be well.", "score": 1, "replies": []}, {"body": "Conclusion: Americans are racist towards Chineses ![img](emote|t5_2th52|4271)\n\nLet's see how many downvotes i get", "score": 1, "replies": []}, {"body": "Youtube Shorts will take over if Tiktok closes. So basically, buy GOOG.", "score": 1, "replies": []}, {"body": "His demeanor suggests either he is cocky / arrogant or nervous or having a remote controlled butt plug or in a face-sitting session", "score": -2, "replies": []}, {"body": "Seriously it’s a joke tho. All of the things that Tik Toc does that the committee was asking about Meta and Snap do already it’s just Tik Toc has ties to the CCP which is the real concern", "score": 0, "replies": []}, {"body": "It will never get banned ( unless ww3 ) this is all a dog and pony show", "score": 0, "replies": []}, {"body": "As much as TikTok sucks, and is probably funneling data to the CCP. I think banning it is the wrong move, it’s what China would do. I think it’s wrong to use the playbook of a totalitarian regime.", "score": -2, "replies": []}, {"body": "You’d have to be stupid to turn shit in.\n\nLet the sweaties do all the work.", "score": -1, "replies": []}, {"body": "Nobody is going back to Facebook or Snap. its all over TikTok, people hate these platforms and love TikTok.", "score": -2, "replies": []}, {"body": "We aint going back to Meta.\n\nIf tiktok gets banned, then we aren't using social media any longer.", "score": -2, "replies": []}, {"body": "I hate private companies. Now I can't short this shit..... just sad.", "score": 1, "replies": []}, {"body": "Too bad we can't invest in tiktok. Fuck all those boomers", "score": 1, "replies": []}, {"body": "I trust american companies more than chinese ones. and I'm asian", "score": 1, "replies": []}, {"body": "The questioning really hurt the validity of the ban.. seems like they pretty much just confirmed they were lobbied into action by American competitors losing market share.. it turned into buzz words and “China bad” after like 20 seconds.", "score": 1, "replies": []}]}
