{"title": "Is this a good time to buy bank stock?", "selftext": "Given the recent decline in bank prices, is it a good time to buy into bank stocks? I currently hold BAC, C and USB at the moment, but am looking at buying into BMO and perhaps JEF. The dividends of these stocks look good and their prices (maybe except C) looks exceptionally good with the recent decline. \n\nCurrent concentration in my portfolio: \nAmazon/Apple/Google/Microsoft: 30%\nBAC/C/USB: 30%\nTSMC: 10%\nOXY: 5%\nVTI: 5% \nCash: 20%", "id": "11oa67t", "created_utc": 1678507323.0, "score": 21, "upvote_ratio": 0.7, "num_comments": 80, "comments": [{"body": "Schw way oversold", "score": 19, "replies": [{"body": "This is a prime example of people in this sub talks out of their asses. When was the last time you looked at their balance sheet?\n\nThey are not at SVB level, but nothing in their balance sheet screams undervalued", "score": 6, "replies": [{"body": "Make sure you revisit your post Friday!", "score": 1, "replies": []}]}, {"body": "My take as well. Went in for 50 shares damn near the bottom tick at 58.06 today ~10min before the close. If it keeps tanking I’ll double up.", "score": 6, "replies": [{"body": "I picked up 50 calls and 20 shares $58.50", "score": 2, "replies": [{"body": "Thanks for this. I needed the confirmation bias to calm my nerves about my position.", "score": 2, "replies": [{"body": "I figure it’s not really going to hit Schwab much so I bought June ITM calls. Could be a great pick, could be a dumb move. It’s only money.", "score": 3, "replies": []}, {"body": "Hindsight is always 20/20. How many times have you heard  “Man I wish I would have bought the dip.” Fortunes are made by taking risks. I bought the deep dip, already up 20% from a late Friday uptick. Maybe it was wrong call but scared money don’t make money", "score": 3, "replies": []}]}]}]}, {"body": "I agree", "score": 5, "replies": []}, {"body": "just going to leave this here\n\nhttps://twitter.com/FloridaMoonMan/status/1634222469396459521", "score": 2, "replies": [{"body": "See ya Friday", "score": 1, "replies": [{"body": "I was thinking who a buyer for SCHW could be if needed, and SCHW bought TD ameritrade a few years ago from TD Bank, so Maybe TD comes in and buys SCHW.", "score": 1, "replies": [{"body": "And guess who would win", "score": 1, "replies": []}]}]}]}, {"body": "Yeah, that’s the regional style bank I’d give a look, otherwise, I’d be too scared to right now and would stick with a big name.", "score": 1, "replies": []}]}, {"body": "I’m feeling pretty good about my jpm holdings", "score": 34, "replies": [{"body": "Pretty sure Cramer just called JP a fortress, good luck  👍 inverse Cramer has been on 🔥 lately", "score": 60, "replies": [{"body": "I am so god damn sick of hearing about jim Cramer. A good company will not tank because it’s one of jim Cramers ten thousand coke fueled picks. Stop giving this dude attention, including negative attention", "score": 66, "replies": [{"body": "You're severely underestimating the predictive power of Cramer stock calls.  And I like Coinbase to $495.", "score": 20, "replies": [{"body": "I wonder if he just missed a decimal. $4.95?", "score": 7, "replies": []}, {"body": "Woods just loaded up in coinbase the day before it got hammered. Kiss of death 🤣", "score": 8, "replies": [{"body": "That’s the buy signal. Cathy buys, stock tanks, then you buy couple days later.", "score": 3, "replies": [{"body": "That was the plan when money was free. Now her entire business plan is FUBAR", "score": 1, "replies": []}]}]}, {"body": "Honestly, Cramer made a few good stock calls. Example would be Bowlero $BOWL", "score": 1, "replies": []}]}, {"body": "Is this comment actually from jimmy himself?", "score": 3, "replies": [{"body": "Yup. It’s me. Jimmy Cramer. Christ almighty this dude lives rent free in the heads of Redditors", "score": 3, "replies": []}]}, {"body": "Someone had to say it!!\n\nThe only reason it seems like that is because everyone just finds the time he recommended it. He’s recommended a ton of stocks, not all of them have fallen though. The data is just cherry picked.", "score": 3, "replies": []}, {"body": "Literally look at his track record though.", "score": 2, "replies": [{"body": "When you make thousands of calls it’s easy to find both good and bad picks. I see absolutely no value in Jim Cramer but the passion around inversing him is just as ridiculous", "score": 4, "replies": []}]}, {"body": "Calm down bro.. I didn't click on shit. It was a title of some sort not like I can escape that 🤡 either. Your right though it wouldn't tank because of him, more the 50b in unrealized loss compared to something like svb 15b.", "score": 1, "replies": []}, {"body": "NETFLIX! BUY!", "score": 1, "replies": []}]}, {"body": "Correction, the market has been on fire lately. Anything short is doing well right now.", "score": 1, "replies": []}]}]}, {"body": "I would wait a min but that’s just me", "score": 31, "replies": []}, {"body": "People were asking the same thing in March 2008.  The bottom was 12+ months off and it took 10+ years to ultimately recover.  NFA - but don’t be in a rush.  From your portfolio - you already have 30% exposure.  You’d be way way overexposed but buying an additional 5-20%.  Just my thoughts!", "score": 18, "replies": [{"body": "But back in 2000, when people asked it, they sucked 2 more shitty years. This time is bigger", "score": 1, "replies": []}]}, {"body": "I'm gonna wait", "score": 10, "replies": []}, {"body": "Bank stocks are still higher than October, they are getting better priced but I'd love jpm at 120 or lower", "score": 4, "replies": []}, {"body": "go on twitter and reddit and you will see everybody calling for depositors to not be made whole bc they are VCs and rich people and cash burning startups. If that is the prevailing sentiment and it gets TV time, all banks are in trouble", "score": 6, "replies": []}, {"body": "They say no guts, no glory but I’m being very cautious rn. The fed raised rates and QT last year at the fastest pace in history. My concern hasn’t been what happens to MSFT. It’s watching for cracks in the financial system. Just like last time. It doesn’t all happen at once but in hind sight it’s so obvious. Maybe this is an isolated incident. Maybe it’s the start of something bigger. Who knows but I’m not willing to step out in front of that steamroller until I know it’s safe. Will I miss the next 10% jump? Probably. Do I think thats worth the price of missing the next 30% down? Definitely \n\nStay safe out there", "score": 4, "replies": []}, {"body": "If you ask the people who bought SIVD yesterday, the answer is NO!", "score": 5, "replies": []}, {"body": "On the one hand, most likely these major banks are secure, and higher rates for longer will continue to feed them windfall NIM.\n\nOn the other hand, a key factor is SIVB's crisis was the fact that savers have become fatigued with the anemic bank products and have been flocking to alternatives like tbills and bonds.  \n\nBanks have been reluctant to pay anything for deposits, but this signals they might have to, and that goes against margin.", "score": 3, "replies": []}, {"body": "Not quite at October lows, but a decent opportunity to scoop shares if you missed out.", "score": 2, "replies": []}, {"body": "Check out Bridgewater bank. Small bank in my area that has consistently done well. They specialize in shorter term loans for real estate investors etc. So they charge higher interest rates, require more money down etc. I learned of them from a guy I happened to work for as he was one of the original investors.", "score": 2, "replies": []}, {"body": "I am holding JPM, GS, CS.", "score": 2, "replies": []}, {"body": "I bought some TD and RBC today - will buy more if they draw back further", "score": 2, "replies": [{"body": "Interesting. Canadian banks (esp. BMO) has always been on my radar. Any thoughts on why TD/RBC over BMO?", "score": 4, "replies": [{"body": "Canadian banks are not quite the same as US banks. I would feel much safer holding canadian banks right now.", "score": 5, "replies": []}, {"body": "I have been waiting and watching a drop like this for almost 6 months.\n\nI do not know whether you like this bank. I just got **NYCB** as today price is lowest in the last 20 years with nice dividend 9.23%.\n\nI understand this is very tiny bank (high risk), but just bought a portion of my cash.", "score": 0, "replies": []}, {"body": "I’d buy BMO TD or RY, I’d (personally) start away from BNS and CIBC. I like TD and royal because they have huge market shares in Canada but also have been aggressively expanding into the US. TD for example is the number one bank in the greater Boston area and top 5 in NYC. BMO’s French Canadian market share is basically untouchable. \nNow I’m never expecting a home run buying those buuuttt I’ll take my dividend and hopefully a couple % avg growth along with it annually 🤷‍♂️", "score": 1, "replies": []}]}]}, {"body": "I'm comfortable taking long positions in JPM/BAC/MS/C/GS right now.", "score": 2, "replies": []}, {"body": "Why Not SOFI ?", "score": 2, "replies": [{"body": "This is more than likely the way", "score": 1, "replies": []}]}, {"body": "It depends on whether J Pow will screw it up. As of Q4 2022, BAC had 31% securities portfolio (Treasuries, MBS etc). SIVB which just collapsed, had 57%. These were not marked to market, and instead values reported as \"held to maturity\" (HTM). You can check out Fed's own data on Assets and Liabilities of commercial banks. There has been significant increase in deposit outflow in Feb 2023, and bank's own borrowings (bank liabilities) has steadily increased in the past 6 months. This is not a good look. Forget about hiking interest rates, staying the same for \"high and longer\" will continue to cause massive deposit outflow from banks. You are at the mercy of an unhinged Fed if you own bank stocks. The Fed's actions for the past 2 months were wrong and excessive. J Pow's most recent testimony is highly destabilizing. Insiders within the financial elites knew this, yet just today so many \"don't worry about it\" and \"no contagion\" articles were being mass produced. Caveat emptor!", "score": 1, "replies": []}, {"body": "I bought 10,000 shares of Pacific Western. I need to believe it’s going to skyrocket.", "score": 0, "replies": [{"body": "It might take a few days but there is no reason it shouldn't recover back to 20 at the least bit. They also made a statement as well Friday evening that they are just fine.", "score": 1, "replies": []}]}, {"body": "No financials. Ever.", "score": 0, "replies": []}, {"body": "I hear svb is really undervalued right now", "score": 0, "replies": []}, {"body": "If you want money right now, short fucking everyone. There's a catastrophe decades in the making about to unfold.\n\nMoney printer go brrrr until the paper tray runs out, and it just did.", "score": -9, "replies": [{"body": "When this comment gets 100 downvotes, that’s when you know it’s time to short the market. 😬\n\nEvery huge selloff that I have lived through has seemingly taken everyone by surprise. Short the masses. The situation we are in rn, the fed is not going to save the market until it looks systemic. \n\nJMHO", "score": 1, "replies": [{"body": "How many selloffs were erased by subsequent rallies?", "score": 2, "replies": [{"body": "All of them but it takes time. After I held steady in 2000, it took 10 years to get back to even in a lot pf my tech stocks. In 2008 I sold early and bought back in a little late but still way below where I sold. \n\nI get the desire to pick that bottom but my father told me when I was young to buy stocks on the way up, not on the way down and it has worked pretty well. To each their own", "score": 1, "replies": []}]}]}]}, {"body": "Yes theyre perfect for bull runs", "score": 1, "replies": []}, {"body": "Sold my energy stock and bought TD. It’s the retirement move for me with a dividend reinvestment plan. \n\nI’ll keep buying the dips maybe even looking at RY or a Canadian bank ETF like ZEB.TO in the future.", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No I wasn’t. $FRC went from 19$ to 36$. That’s almost 100% intraday.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They all went up intraday buddy, by a ridiculous amount. Be quiet", "score": 1, "replies": []}]}]}]}]}, {"body": "I bought a huge amount in BAC on Friday", "score": 1, "replies": []}, {"body": "If you love losing money it is", "score": 1, "replies": []}, {"body": "BLX and MFG will do well.", "score": 1, "replies": []}, {"body": "Doy!!", "score": 1, "replies": []}, {"body": "It’s a good time to play volatility imo, I have a plethora of straddles set up on regional/community banks and ETFs. One thing is for sure, shits not gonna trade sideways. Big ups or downs is my play.", "score": 1, "replies": []}, {"body": "I started a position in Schwab at $59 . Hope to get much lower to have a full position", "score": 1, "replies": []}, {"body": "I was surprised to see FRC take a hit as I bank with them with a student loan. They always seemed good to me so I casually bought in yesterday not knowing what was going on. I'm still  thinking of buying more knowing what's going on. It's hard to know how things that don't seem connected are connected.", "score": 1, "replies": []}, {"body": "I bought some SOFI shares and ITM call options yesterday when it was down 12%. Apparently their CEO also picked up a couple hundred thousand shares too.", "score": 1, "replies": []}, {"body": "I’ll be waiting.", "score": 1, "replies": [{"body": "For what? What’s your expectations?", "score": 1, "replies": []}]}, {"body": "Definitely if you want to loose money", "score": 1, "replies": []}, {"body": "Every day is a good day to buy stock. However, as the other commenter mentioned, I’d probably look to diversify right now. 30% is already a lot.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "11omuwb", "created_utc": 1678548363.0, "score": 40, "upvote_ratio": 0.78, "num_comments": 70, "comments": [{"body": "Circle tweeted that $3.3b of their ~$40b of reserves were at SVB. USDC is now trading at $0.92. Seemingly the market has written off that $3.3b entirely, which doesn't really make sense, since Circle should be getting most of it back as SVB's assets are liquidated.\n\nAnother problem could be that it's the weekend and Circle doesn't have access to most of its reserves till Monday.", "score": 25, "replies": [{"body": "They will probably get at least most of it back. However, I don't think trading at $0.92 is wrong even if that's the case.  The bigger issue here is that this calls into question the whole point of even having stable coins? Clearly, even when backed by cash, they lack the stability of government fiat.", "score": 10, "replies": [{"body": "Sure, stablecoins suck as an asset, but the price has more to do with beliefs about whether Circle will be able to resume redemptions on Monday. If they're able to process redemptions, it can stay at $1 even as the market cap goes down.", "score": 3, "replies": []}]}, {"body": "A question I have, I see this statement about companies should get most back when SVB is liquidated…but didn’t this all start due to the realization they don’t have everyone’s money anymore…\n\nso is liquidating what they have left enough to pay everyone back in full?", "score": 4, "replies": [{"body": "No bank can give everyone's money back if everyone asked for it today. Not even JPMC/Citi/Wells Fargo/BoA. That's just not how modern banking works, it's 'fractional reserve'.", "score": 3, "replies": [{"body": "And they removed the reserve part at the beginning of Covid. They literally dropped the reserve requirement to zero.", "score": 2, "replies": [{"body": "In a strictly mathematical sense I guess 0/x where x is anything except 0 is technically fractional lol.", "score": 1, "replies": []}]}, {"body": "I know that. That’s not my question", "score": 2, "replies": [{"body": "Once the FDIC comes in they’ll run the bank liquidation process. They’ll either find a buyer or sell the loans to other banks who’ll buy them. Therefore recovering the deposits. \n\nThe reason SVB ran into trouble is mounting losses (especially incurred in the bond market) dwindling reserves due to cash burn by their depositors, and apparently risky loans meant people lost cash confidence. By the time the bank tried to raise money it was too late and only sparked more fear. \n\nAnyway, most of the money is probably there tied up in loans it’s just that the bank wasn’t able to raise funding fast enough to not get taken over by the FDIC which is the banking version of bankruptcy.", "score": 2, "replies": [{"body": "Thanks! That makes sense", "score": 1, "replies": []}, {"body": "Another thing that contributed was SVB had a lot of deposits from startups. Since venture capital funding is way down, those startups had to withdraw their cash to stay operational.", "score": 1, "replies": []}]}]}]}]}, {"body": "Circle isn’t solvent and is going to blame it all on banks as an affinity scam thing", "score": 9, "replies": [{"body": "Source?", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "#best source.", "score": 2, "replies": []}]}]}]}]}, {"body": "Then they'd best keep trading of USDC halted until they are able to prove they can recover those reserves.\n\nI think a bigger problem is that people will want to redeem USDC for USD mass scale due to the collapse of trust (and especially if USDC remains depegged for an extended period of time), which would then put a **lot** of pressure on Circle.", "score": 2, "replies": []}, {"body": "It will regain its peg when the banks open on Monday I hope , svb will likely just be absorbed by another bank. Svb was solvent by the way", "score": -4, "replies": [{"body": "Were they solvent if you mark their bonds to market? I thought they only looked solvent because they had HTM bonds (bonds they planned to hold to maturity) which they didn't need to mark to market.", "score": 6, "replies": [{"body": "Maybe solvent, but not liquid, which is a pretty serious issue if you are a bank.", "score": 9, "replies": []}]}]}]}, {"body": "What are the implications of this depegging? Is it not an isolated event?", "score": 11, "replies": [{"body": "Not when almost every stablecoin has depegged?", "score": 6, "replies": []}]}, {"body": "Why would the fed/government step in? If you invest in crypto shit, you deal with the consequences of crypto shit\n\nThese “stablecoins” sure do seem have a problem staying stable", "score": 17, "replies": [{"body": "Tell me you don't understand crypto without saying you don't understand crypto 🤣", "score": -23, "replies": [{"body": "The stablecoins creators don’t seem to get it either if they keep on being volatile\n\nCrypto people love how decentralized it is until something goes wrong and want the government to bail them out. Riskier bets are risky and not a guarantee, and it’s not the government’s or Fed’s job to step in because a speculative asset went to shit", "score": 9, "replies": [{"body": "What crypto people are calling for a bailout though lol just because a centralized stable coin unpegs doesn't mean shit for \"crypto\" decentralization.", "score": 4, "replies": [{"body": "Did you read OP’s post? “Does this force the Fed’s hand?”\n\nWhy do you think scams, schemes, and market failures are endemic to the crypto space? It is a consequence of decentralization and lack of regulation.", "score": 1, "replies": [{"body": "I'd say it's just human nature. Fraud and scams happen everyday in every market it's not only crypto. \n\nI would read forcing the feds hand as stopping rate hikes. Not bailing anyone out.", "score": 1, "replies": [{"body": "Fraud happens in every market sure, but it certainly seems to be very common in crypto\n\nNot hiking rates to save crypto? Lmao\n\nCreating moral hazard, especially in the crypto market, is the last thing the Fed wants to do. \n\nStuff like this is a feature of rate hikes. It “cleanses” our financial system from low quality assets. This shows the rate hikes are working, not that it’s time to stop. Crypto is a low interest rate phenomenon, and it’s not the Fed’s job to prop it up, whether through bailouts or stopping rate hikes", "score": 1, "replies": [{"body": "Again, fraud and scams happen in all markets and are common. Financial institutions have a long history of fraud. You can find replicas of any major brand you want to, they're very common. It means nothing that there are also frauds and scams in the crypto space other than there are people out there willing to lie for possible financial gain. \n\nNobody was saying this, it was just a question OP posed about whether or not the fed would take into account things happening in the crypto space. I don't read that as him hoping the fed could or even would do anything to \"save crypto\". Crypto will be fine regardless of if the issues of the stable coins have the reserves to back up the asset they have been selling. \n\nCrypto really began when interest rates were around 5%. I wouldn't correlate it to low interest rates in any way even though 5% is historically somewhat low. Coins like BTC and eth have nothing to do with interest rates other than institutions holding them may react and sell in a panic but that won't change the protocols or staking/mining that are happening. Interest rates aren't even apart of the formula. If a few stable coins issued by companies fail that's on the companies and the tokens they issued, not crypto.", "score": 1, "replies": []}]}]}]}]}, {"body": "So you know who the stable coin creators are right? Hedge funds, are taking your money and not actually buying the underlying securities. patience boomer", "score": -3, "replies": [{"body": "Who the creators are is irrelevant. \n\nOutsized gains cannot be achieved without outsized risk. If you invest in very speculative assets (which crypto is), you have to deal with the consequences of your risk. \n\nThe Fed’s job is to maintain market functionality. Speculative, risky assets sometimes going to shit is a feature of functional markets, not a bug\n\nThe government isn’t liable for people’s bad decisions making", "score": 6, "replies": []}]}]}]}]}, {"body": "Why is this in r/stocks?", "score": 13, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "So report it lol", "score": 1, "replies": []}]}]}, {"body": "Mods are asleep.", "score": 13, "replies": []}, {"body": "You'll see why on Monday", "score": 5, "replies": [{"body": "What did I miss? It’s back at $1", "score": 1, "replies": []}]}, {"body": "I’m curious as well. But USDC is issued by Coinbase + circle. So it should have implications for at least COIN price on Monday for sure. Still questionable .", "score": 2, "replies": []}]}, {"body": "Some start ups who probably needed to go out of business anyways will get wiped out quicker. This isn’t as big an issue as some people think it’s going to be.", "score": 2, "replies": []}, {"body": "The reality is that the cryptocurrency market is so small and mostly filled with fraud and unregulated securities that even if it were to collapse completely it wouldn’t have a lot of effect on the rest of the financial markets. And it would be a net benefit to society as a whole given how much fraud and theft there is. \n\nThe second/third largest exchange in that market collapsed, FTX, and literally nothing happened with the wider financial markets. \n\nThat’s how tiny and insignificant cryptocurrency is to the rest of the world.", "score": 4, "replies": []}, {"body": "The Fed could give a fuck about some scam crypto bullshit. Y’all are getting what you deserve for betting on something any sane person told y’all was a scam. Reap what you sow.", "score": -15, "replies": [{"body": "Stupid doesn't know HF are invested into usdc and could go under. In this world, nothing is isolated. If a Chinese farmer farts you will smell it in NYC at some point.\nSo spare us your ignorance and stay in your little dream. Safes everyone tons of time.\n\nI don't think this event is big enough to cause havoc because in the end it is \"just\" a 10% depeg. Probay not enough to liquidate anyone big. But usdc is a $40b asset and if losses occur, someone has to pay aka liquidate real-world assets. Ever thought about what happens if circle has to liquidate their holdings to cover a bank run on usdc redemption? If you have the ability and time to read, you will understand that usdc is like a savings account without time locking of funds. Anyone can at any point in time redeem usdc for $. If $ are scarce, assets need to be liquidated.\nThis is one thing where usdc is fully backed by dollar. The other scenario is where usdc is not fully backed (happening right now). At least the market presumes its not fully backed anymore because 3billy or so are momentarily lost. This means the last bite the hounds like the saying goes and a bank run will leave the last ones holding the bag aka write offs. And if those are not small investors but big entities, one HF going down may be the first domino to fall. Think about citadel just for real this time.\n\nI don't think this is going to happen because if enough people redeem 1 usdc for $0.9 real dollar the losses are limited and the peg will crawl back to $1 slowly. But ofc one never knows....market psychology can ruin everything.", "score": 10, "replies": [{"body": "This is the intelligent discourse I was hoping for. Thankyou", "score": 4, "replies": []}]}, {"body": "I think you have a misunderstanding as to what USDC is. It’s basically just a digital dollar backed by real dollars. The failure here was an American bank, not crypto. The money backing it is not available over the weekend now that the bank failed. USDC will regain their peg as soon as their funds are released/covered. A bigger bank will step in next week.", "score": 10, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "It’s almost like they’re taking a page right out of WallStreet’s playbook with stocks!", "score": 3, "replies": [{"body": "That's their target market ;) lol", "score": 1, "replies": [{"body": "Indeeeed", "score": 2, "replies": []}]}]}]}, {"body": "I though it being pegged to the dollar was debunked long ago.", "score": -8, "replies": [{"body": "Im pretty sure its tether that was the fishy thing.  This is more serious", "score": 6, "replies": []}, {"body": "My understanding was that they've survived a lot of scrutiny, so I assumed that against all odds (and to my disbelief) it is indeed somehow tethered to usd.", "score": 1, "replies": []}]}, {"body": ">It’s basically just a digital dollar backed by real dollars.\n\nWhat's the purpose of that?  We can just use dollars.", "score": -1, "replies": [{"body": "But dollars have a paper trail and are harder to commit crimes with", "score": -1, "replies": [{"body": "It's actually easier to trace digital currency because every transaction is recorded in the Blockchain forever. So not even that. Cash is almost impossible to follow.", "score": 3, "replies": [{"body": "Easier in small quantities. \n\nBut when you try to deposit a large amount at a bank, they’re gonna ask questions because of anti-money laundering laws. That doesn’t happen if you just convert your crypto to a “stable” coin that is tied (in theory) to the dollar.", "score": 0, "replies": []}]}]}, {"body": "It allows traders to convert profits and keep them on the blockchain instead of cashing out through banks every time. Faster, less processes.", "score": 1, "replies": []}, {"body": "You can move them instantly to anywhere in the world. Much more difficult to do that with a bank and more expensive. Banks are also closed on the weekends while the Ethereum network that these are on is running 24/7.", "score": 1, "replies": []}]}, {"body": "It’s not basically that at all!", "score": -2, "replies": []}]}, {"body": "\"y'all\".  1st off Im not invested at all in crypto. 2nd id love to know how ur port looks from way up there lookin down on folks. Anyway im Just wondering the repercussions of the SVB fallout. That usdc is directly related.", "score": -2, "replies": [{"body": "It’s actually y’all as it is the contraction of you and all.", "score": 3, "replies": [{"body": "I know what it is.  I was curious who you were talking to.  Cause its not me", "score": 2, "replies": []}]}]}, {"body": "There are others who say banks are a scam, and crypto is a scam... USD is backed by nothing, USDC is backed by USD lmao. Let's not wish others misfortune ignorant one.", "score": 1, "replies": []}]}, {"body": "Why would anyone want to buy a digital dollar that has the same value of a physical dollar?", "score": -2, "replies": [{"body": "Stablecoins just allow traders to convert profits to dollars (a representation of dollars) which saves them time and effort than going through banks (banks are not crypto friendly). \n\nSome people like using stablecoins to earn interest on their deposits, which is basically the same as a savings account but with higher yield and more risk. (risk aka what's happening right now)", "score": 3, "replies": []}, {"body": "For ease of use in the crypto. Once you have a stablecoin it’s easy to send it around, stake it (earn interest) trade it for BTC or another token, etc.\n\nStablecoins make crypto trading a lot easier. Also one can buy a stablecoin and store it in their crypto wallet. Something you can’t do with USD.\n\nOverall, stablecoins allow for a blockchain asset to have all crypto properties with the fixed dollar price.\n\nIt’s pretty useful when it doesn’t depeg 🤣", "score": 2, "replies": []}]}, {"body": "Hmm... another stable coin depegging? Its almost like the Fed is preparing the way for their Central Bank Digital Currencies...", "score": 1, "replies": []}, {"body": "So when banks all go tits up on Monday and they try to divide everybody’s money by zero (because that’s how much they actually have), the whole system is gonna glitch out.", "score": 1, "replies": []}]}
{"title": "How major US banks could be at risk of sweeping defaults", "selftext": "\nWith the recent implosion of SVB (Silicon Valley Bank), it's important to start looking under the rug before all of the roaches start running all over the place. In a nutshell, we know a few things have happened:\n\n1. Trillions of dollars were printed and we aren't going to escape the effects of it.\n2. Interest rates are up enough to really start killing off borrowing demand, to the tune of 20% volume of mortgage starts versus one year ago.\n3. US consumer credit debt is way up, and personal savings are way down.\n4. Treasuries are paying 4.5%+ and mortgages are up near 7%. Companies with too large of a disparity between what they pay out in corporate bonds and what they receive from risk free interest will be especially in danger, much like SVB.\n5. If you look here- [https://www.federalreserve.gov/releases/h8/current/default.htm](https://www.federalreserve.gov/releases/h8/current/default.htm) you'll find that all the major US commercial banks have about $2T in residual (assets minus liabilities), about a 10% margin over their liabilities. Assets=22T, Liabilities=20T.\n\nAll it takes to start forcing banks to sell assets is 2 trillion dollars in losses. That's it. SVB is imploding over a $15B loss and JP Morgan is rumored to have $47B in unrealized losses on their books. *EDIT: the big 4 banks are at $114B in losses as of this moment with some estimates showing $600B in total unrealized losses across the banking sector* It's not a loss til you sell, right? Consumer credit card debt alone has reached $1 trillion. Most people no longer have adjustable rate mortgages, so we can discount that one, but the commercial mortgage industry isn't so tidy. It was more or less forgotten when regulations were tightened post-2008.\n\nThe numbers as of March 1st 2023-\n\nMBS (mortgage backed securities) makes up 2.7 Trillion dollars\n\nCommercial real estate makes up 2.9T\n\nResidential makes up 2.5T\n\nThese are just a few, the link above has all the data.\n\n[https://fred.stlouisfed.org/series/DRCCLACBS](https://fred.stlouisfed.org/series/DRCCLACBS) shows that the credit card loan default rate has crept up to 2.25% as of Q4 2022.\n\n[https://www.usatoday.com/story/money/2023/03/06/auto-loan-delinquencies-up-in-2022/11393399002/](https://www.usatoday.com/story/money/2023/03/06/auto-loan-delinquencies-up-in-2022/11393399002/) \\---6% of all subprime auto loans are late on payments.\n\nOh, and let's not forget inflation is somewhere between 6-8% YoY, and real inflation is as high as 20% solely based on dollars printed and money devalued. AND the M2 money supply is shrinking at a rate synonymous with economic depressions. M2 has only decreased from $21.7T to $21.2T since Feb 2022, representing a $500B drop or 2.3%.\n\nAll of this is to say, for the banks to be squeezed to the tune of $2 trillion from all of the above factors isn't much. If you take away the drop in M2 money supply, you're at $1.5T. If you take away an additional 8% from their assets since Feb 2022 due to inflation, you're already in the red ($1.5T-1.76T= -.26T). Now, that might be an exaggeration or conflation of factors. But if you even start to get close to 5-8% default rates on commercial loans (which are going to be hit harder due to a drop in consumer spending)- you wipe out another $150 Billion to $232 Billion. Not to mention what happens if MBS counted as assets on the banks books start to get dumped (again). Technically, if MBS, commercial, and residential properties collectively lose 10-30% of their value, this whole thing starts to get really ugly. This can all get out of hand quickly, especially if there are people who try to pull all of their money out of the banks because as we know, fractional reserve banking means they probably don't have enough to assuage the fears of the public at large.....\n\nEven if the banks don't fully go into the red due to defaults, if they start to get close there's a good chance they'll have to start selling assets and unwinding liabilities to maintain adequate reserves per federal regulation, or risk going down completely. And once that selling starts, you better buckle up because the more of those assets that hit the market from various commercial banks, the less those assets will be worth on the open market due to supply outweighing demand.\n\nWe will more than likely end up in a situation where the Fed raises rates, attempting to execute a 'soft landing' but once the dominoes start to fall, it's very difficult to stop rolling defaults. First, consumers default on credit card loans, then home loans and auto loans, then businesses default on loans and fail to pay their leases, REIT's start to get squeezed, banks are unable to recover a large chunk of loaned out money, and all of a sudden you have banks creeping up on default, requiring a bailout from big daddy warbucks, the government. Even assets sold to recuperate borrowed money will become worth less than the loan value itself if there is too much selling at once.\n\nThe ideal play here is to be cash heavy once the selling really starts. You could try to time the market and buy some puts, but you might also get royally screwed if the party keeps going for longer than expected. The issue that stocks will find themselves in is that treasuries at 4.5% look very attractive if you're expecting a down year, which as more banks start having problems, people may very well get spooked and sell off their equities to sit in cash or treasuries/money market funds.\n\nI've moved to about 20% cash, piled some into FAZ to short the banks with leverage (not ideal due to decay, I know), and I'm piling up cash in the event that real estate becomes more attractive, because you'd be able to buy at a discount and refinance once this all cools down in 3-5 years as is historically typical. Ultimately I like my stronger stocks like AAPL, GOOG, etc. I've sold over half my NVDA stake after the recent run-up because well, 100% gains in a few months is a little much, don't you think? A good bit of my cash on hand is sitting in a fund gaining 4.5% until I decide to deploy it in the event of a massive cascading selloff.\n\nUPDATE 04/01/2023\n-Fed Reserve opened u $2T of backstop liquidity. Not saying I was right about $2T being the magic number, but pretty coincidental considering that's what St. Louis Federal Reserve site data said. \n-SVB now being absorbed by First Citizens bank, curious to see if it backfires, but FC probably believes that the fed will keep stepping in, so much for QT as the feds balance sheet shot up $400B in two weeks to bail out regional banks. \n-Made some quick money on FAZ by selling the day after the fed announced the liquidity backstop. Glad I got out immediately.  \n-The next stop on the market crash train ride will be when rates finally peak and come back down- that's historically when the market crashes. Til then, party like its 2006 yeah? \n\nUPDATE 5/3/2023\nFRC goes down, absorbed by JPM. Talk of another bank selling. Treasury talks buybacks starting in 2024. JPOW and friends hike rates another .25%, as expected but remain neutral but slightly hawkish. People are expecting them to turn dovish before too many more banks go down. Total bank collapses are now greater than 2008, at around $550 billion. Add that to the amount withdrawn from the system (M2 money supply), portfolio losses, credit and auto defaults, and we start approaching $2T in losses rather quickly.", "id": "11o5jer", "created_utc": 1678493875.0, "score": 80, "upvote_ratio": 0.87, "num_comments": 73, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|2 years ago\n**Total Comments**|311|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: Banks are screwed, and it might be a good idea to go to cash now before things really start to unravel.", "score": 1, "replies": [{"body": "just remember to keep your cash in the bank because its safe", "score": 3, "replies": []}]}, {"body": "The big fallacy in your argument is that you fail to mention that banks are not expected to mark to market their losses on bonds. So the risk of sweeping default exists only if the banks have more unrealized losses then their equity and a bank run happens like it did for svb. Also for svb unrealized losses were almost 100% of their equity. This isn't the case for most other US banks.", "score": 15, "replies": [{"body": "I don’t think all banks will go under, that would be dramatic. However- there’s a possibility that consumer defaults, commercial defaults, and small/medium sized bank defaults really start to have a negative impact.", "score": 2, "replies": [{"body": "The savings and Loan institutions didn't ask go under but many did just a few decades ago when the interest rates were high, inflation was high, credit cards had been invented and big banks were charging hefty fees to have accounts. I inherited from my father a Post Office Credit Union account that survived. Whenever I saw people banging on S&L doors I'd look to see if I knew anyone, often I did.", "score": 2, "replies": [{"body": "The situation is starting to look similar to that in some ways", "score": 2, "replies": [{"body": "The last time \"money was created\" was via the credit card which of course created debt to the user or credit card company if the user filed bankruptcy. This time money was created with crypto. Real money was used to buy crypto, some made money, some lost but it had similar characteristics to credit cards plus exactly opposite characteristics. \n\nThe key to both was money was seemingly created for some people. I'm not a financial guy but a retired engineer. Do you think the default rates on credit cards and the importance of crypto taking a large gain and the a large loss in recent years could be behind this issue now with the banks? If so, without shooting bank stocks, many will fail, maybe 10-20%, with the stock aspect, 50%?\n\nI don't want financial advice, just a sounding board.", "score": 1, "replies": [{"body": "Sun is looking shiny for you. Stay bright.\n\nWe haven't even begun to create money with crypto yet. CBDCs soon.  \nThe bank was a liquidity issue. There's no shock testing currently.", "score": 1, "replies": [{"body": "What does CBDC stand for? \n\nBy the bank being a liquidity issue, the recent drops led to this result, am I reading this correctly. Shock testing I understand only not from a financial perspective.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I think the issue with the financial system is the lack of understanding of how it all tied together due to complexity.\n\n2008 makes sence afterwards but lead up to it, the problem was the very solution to minimize risk.", "score": 1, "replies": [{"body": "Basically bonds are very low risk …. Until they aren’t and then they’ll cause a giant catastrophe", "score": 2, "replies": [{"body": "Yeah taking a 20% haircut on bonds seems impossible but.... here we are.\n\n\nWhat's wrong with SPY + option hedge for volatility. Seems like it would beat the normal returns be more liquid and could even profit from massive sell offs.", "score": 1, "replies": []}]}]}]}, {"body": "The funny thing about the SVB failure is that they themselves did nothing wrong; in fact they were extremely conservative with their financial practices. The problem is so inherent in the banking system we have today and the monetary policy of the fed that this could’ve happened to any bank. I predict it will start with the regional banks which will start failing one by one, and gradually spread panic into the market causing bank runs. Just my two cents", "score": 41, "replies": [{"body": "You have two cents?", "score": 8, "replies": []}, {"body": "Buying long duration bonds against an extremely un-sticky deposit base is just plain dumb.", "score": 23, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 15, "replies": []}, {"body": "They were advised by the FED to do just that.", "score": 7, "replies": [{"body": "But why on earth did they not just start selling off older bonds and then repurchasing newer bonds with higher yields as rates rose. I feel like that would have at least mitigated their losses", "score": 1, "replies": [{"body": "Yeah, I feel like this is them being lazy. Everyone knew the Fed would raise rates and that the bonds would invert.", "score": 0, "replies": []}, {"body": "Already did that.", "score": 1, "replies": []}]}]}]}, {"body": "No SVB was not smart here. There’s a reason no other banks are defaulting or going under and it’s because they didn’t expose their entire Covid money rush of deposits against interest rate hikes.\n\nOthers could have made the same mistake, but they should have known the risks more.", "score": 5, "replies": [{"body": "Weird to assume no other banks are defaulting this early", "score": 1, "replies": []}]}]}, {"body": ">I agree that a market sell-off is possible, and even likely. However, I believe that the market will eventually rebound as it always does. Therefore, I am not selling my stocks but rather holding onto them for the long term.", "score": 20, "replies": [{"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 26, "replies": [{"body": "Of course you did \nBots stick together eh", "score": 24, "replies": []}, {"body": "The bots have become self aware and self promoting.... what could go wrong with that?", "score": 9, "replies": []}, {"body": "Y’all done jacking each other off?![img](emote|t5_2th52|29093)", "score": 5, "replies": []}]}, {"body": "Fuxk your Warren Buffet-like advice this is a casino", "score": 5, "replies": []}]}, {"body": "nvda is being pumped heavily at the moment while gpu sales are down 40% YOY.  Way over valued.  Plus the company itself is selling.", "score": 8, "replies": []}, {"body": "Look here buddy. This is the united mother fucking states of America. This is a country where you can derail a train and burn pollutants so toxic it destroys the ecosystem of north eastern America and the stock prices don’t move. This is a place where our rates of cancer and autism skyrocket every year and we don’t fuxking question the commie pricks who say we’re using too many antibiotics in the meat, we just find a start up pharma bro company to solve the fuxking problem. This is a country where we celebrate war and all its 0DTE call options on weapons companies. The USA AINT goin NOWHERE brother. 2008 sucked, but we rallied back. You think warren buffet gave a mother fuck? Buffet sat there shot gunning cokes and snorting lines off a complimentary iPhone he was given. Never bet against the US economy.", "score": 30, "replies": [{"body": "![img](emote|t5_2th52|8882)", "score": 4, "replies": []}, {"body": "Amen brother! (Said in a gravelly southern accent like some guy that lives in a trailer, smokes a lot and shoots his gun into the air on occasion)", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|29093)", "score": 1, "replies": []}, {"body": "Hahahaha I salute you sir", "score": 1, "replies": [{"body": "I was piss wasted when I wrote this", "score": 2, "replies": [{"body": "Abraham Lincoln would approve 🇺🇸", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}, {"body": "The Fed needs to halt interest rate increases.  The recession they aimed for is here", "score": 4, "replies": []}, {"body": "https://preview.redd.it/rl7rogck82na1.jpeg?width=1080&format=pjpg&auto=webp&s=e182f27a36ec9acdc6851e7ff26672c33cab8108", "score": 4, "replies": []}, {"body": "I’m beginning to build up a portfolio of straddles on community/regional banks and ETFs to play volatility.", "score": 2, "replies": []}, {"body": "Post positions or ![img](emote|t5_2th52|4263)", "score": 3, "replies": [{"body": "This", "score": -2, "replies": []}]}, {"body": "The failure of SVB has nothing at all to do with economic stimulus. It was driven by bad investments in crypto, high deposits, and the recent increase in interest rates and the fact that SVB was long in bonds at lower rates because they couldn’t invest their deposits fast enough.", "score": 4, "replies": [{"body": "No it was bonds my dude and interest rates making those bonds unaffordable.", "score": 6, "replies": [{"body": "Yes exactly what I said only you’re less coherent", "score": 3, "replies": [{"body": "I’m regarded so checkers out.", "score": 1, "replies": []}]}]}, {"body": "My point was that the amount of money printed caused inflation, causing a need to hike rates and a devaluing of the dollar", "score": 0, "replies": [{"body": "And your point is wrong. Inflation is global, not localized to the US and has nothing to do with how many dollars are being printed", "score": 3, "replies": [{"body": "No point in arguing with someone whose post consists 100% of memed, rewritten tweets. I fucking laughed at it before I got into the second paragraph. I’d be pissed off if I paid for an econ degree and that was the result, or I’d stop paraphrasing nonsense.\n\nStraight up jibberish is what OP posted.", "score": 2, "replies": []}, {"body": "This is specific to the US, which is why I’ve literally included federal reserve data referencing assets and liabilities of commercial banks.", "score": 1, "replies": [{"body": "No it’s not. Read something. Pretty much anything. The Economist. The Financial Times. Even Fox news. Inflation is global and it’s far worse elsewhere than in the US. \n\nOr don’t. And out yourself as a tinfoil hat, flat earth, mindless drone drinking the pap squirted from teats of billionaires seeking to suck every last dollar from as many people as possible.", "score": 1, "replies": [{"body": "My post is specific to the US, I am not covering international banks or inflation.", "score": 1, "replies": [{"body": "You cannot take an international economic problem and magically make it a local problem just by saying “I limit the scope of my statement”\n\nThat would be like me saying, “it’s limited to uour household, stop spending beyond your means”", "score": 1, "replies": []}]}]}]}]}, {"body": "The inflation was triggered mostly on supply side. Not demand side.", "score": 1, "replies": [{"body": "So many people selectively ignore that.", "score": 1, "replies": []}]}]}]}, {"body": "Funny I thing is this reminds me of exactly when ANB collapsed which had $2.1 billion back in 2008 for those of us old enough to remember. Honestly it’s about freaking time we need a reset just like 2001 & 2008.", "score": 4, "replies": []}, {"body": "Always remember: The market can stay irrational longer than you can stay solvent.\n\nThis crash could take a few quarters to play out even if everyone knows it will hit in the end.\n\nFed might slow down interest rate increases and live with higher inflation for a while.\n\nIt also takes companies a long time to go under even if they are at a loss for a year.\n\nBear sterns went down in March 17 2008 but the rest of the market did not collapse till late September.", "score": 2, "replies": [{"body": "100%- many companies do have cash reserves and ways of delaying serious issues, it might be a game of how long they can last. I’m confident that I won’t become insolvent, I’ll still have a cash position and some money markets at a minimum on the sidelines.", "score": 0, "replies": []}]}, {"body": "Here comes the flood of 2008 posts.. lmao", "score": 2, "replies": []}, {"body": "Here comes the scare posts .  Big o nothing burgers", "score": -1, "replies": []}, {"body": "Calm down people ! Everybody is going to be fine .", "score": 1, "replies": []}, {"body": "Lots of typing, not a lot of thinking.", "score": 1, "replies": [{"body": "What’s your take?", "score": 1, "replies": []}]}, {"body": "You really think JPM, BofA, Wells will default?  ![img](emote|t5_2th52|4641)", "score": 1, "replies": [{"body": "I think it’s more likely that there are multiple smaller defaults that lead to fear of contagion and lead to broader bond, equity, and MBS sell offs. They can’t become insolvent and once they start approaching the $2T in total unrealized or potential losses, they’ll be forced into selling some things.", "score": 1, "replies": [{"body": "Then fix your post title", "score": 1, "replies": []}]}]}, {"body": "You don’t get to say inflation reduces a bank’s assets, that’s nonsense", "score": 1, "replies": []}, {"body": "It only takes one. \n\nCredit Sussie could fail and start the domino effect to impact other banks.", "score": 1, "replies": []}, {"body": "Yawn", "score": 1, "replies": []}]}
{"title": "What inflation", "selftext": "", "id": "11ofx0z", "created_utc": 1678527239.0, "score": 1819, "upvote_ratio": 0.96, "num_comments": 70, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|2 years ago\n**Total Comments**|1|**Previous Best DD**|\n**Account Age**|9 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Don’t worry another bank will come to collect soon", "score": 655, "replies": [{"body": "Right? When banks are liquidating, they sell off all their assets - include all mortgage notes and loans. The debt doesn’t just vaporize.", "score": 369, "replies": [{"body": "What if you blow up the credit card buildings like in fight club?", "score": 248, "replies": [{"body": "It takes them a day longer to collect.", "score": 213, "replies": [{"body": "So invest it. That way you can lose the money before that", "score": 49, "replies": []}]}, {"body": "You have to go the Mr Robot route and fry all their datacenters.", "score": 44, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Considering how shit the IT departments are in a lot of companies. Especially since a lot of companies felt that’s the first place they should look for layoffs. You could just get a script from GitHub to do it, just saying 🤷‍♂️", "score": 9, "replies": []}]}, {"body": "Or maybe just drive by the offices in a van with a big magnet?", "score": 4, "replies": []}]}, {"body": "They now build them with sturdy outer casings to prevent fall-apart.", "score": 4, "replies": []}, {"body": "Sup?", "score": 3, "replies": []}, {"body": "I thought we weren’t supposed to talk about that….", "score": 3, "replies": []}, {"body": "Or like in 9-11", "score": 0, "replies": []}]}, {"body": "So just buy your own debt at a decreased cost?!?!?!?\n\n\nAbsolute big brain play.", "score": 29, "replies": []}, {"body": "Technically if it is most likely unsecured debt, so he can just stop paying the new debt owner and get to keep his cakes and smash'em too", "score": 9, "replies": []}, {"body": "But it does get shuffled into various debt bonds full of millions of dollars of defaulted on debt. Realistically once your debt it sold off it is no longer “your debt”. It’s the debt of your creditor.", "score": 6, "replies": [{"body": "Tell that to the sheriff evicting you", "score": 6, "replies": []}]}, {"body": "\"The debt doesn't just vaporize\".\n\nSure, unless you happen to be the federal government.", "score": 7, "replies": []}, {"body": "This one simple trick the mortgage companies don’t want you to know about….just delete the app!", "score": 2, "replies": []}, {"body": "It should", "score": 0, "replies": []}, {"body": "It gets written off! Well it does here after 6 years and if during that 6yrs you are not taken to court", "score": -1, "replies": []}]}, {"body": "They will collect and the best part is you will be able to actually negotiate for a lower rate than what they were originally paying for. Because it’s better to get something than nothing.", "score": 6, "replies": []}, {"body": "Pssst, it’s Goldman", "score": 6, "replies": []}, {"body": "use the card to buy the bank, and cancel the debt... ez!", "score": 4, "replies": []}, {"body": "Just give them the card back that’s what they really want!", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|29093)", "score": 2, "replies": []}, {"body": "I find it hilarious. Any penny over 250k that belonged to you is lost and you'll never get it back.... But make sure you pay off that $1100 on your loan.\n\nDoesn't affect me either way, I'll likely never have anywhere close to 250k", "score": 3, "replies": []}, {"body": "Seems like a job for RENO-911", "score": 1, "replies": []}, {"body": "Delete the app.", "score": 1, "replies": []}]}, {"body": "All laughs and giggles till some other bank who took on their operations comes knocking on your door.", "score": 170, "replies": [{"body": "Just delete the app 👍🏻", "score": 80, "replies": [{"body": "If that doesnt work just play dead", "score": 8, "replies": []}]}, {"body": "I closed my account and ignoring the phone calls. Easy", "score": 60, "replies": []}, {"body": "That’s a lot of Wendy’s dumpsters to hunt through.", "score": 9, "replies": []}, {"body": "![img](emote|t5_2th52|4641)", "score": 1, "replies": []}]}, {"body": "Great idea!\n\nToo bad the credit will be moved to another creditor.....", "score": 59, "replies": [{"body": "Tell them that you were not FDIC insured and that the money is gone, and there’s nothing they can do.", "score": 42, "replies": [{"body": "Well, they can ruin your credit score and take you to small claims/arbitration.", "score": 15, "replies": [{"body": "At which point, declare yourself dead and reborn under the name Fernando Montalbano.", "score": 49, "replies": []}]}]}]}, {"body": "Just broke the card. Everything will be paid!", "score": 35, "replies": []}, {"body": "Pay off secured debt with unsecured debt. Walk away a winner, just like the big boys.", "score": 32, "replies": [{"body": "Unless you know, you have a job and don’t like garnishments.", "score": 7, "replies": []}]}, {"body": "[removed]", "score": 23, "replies": [{"body": "/r/economy level knowledge", "score": 5, "replies": []}]}, {"body": "I just cross out the numbers so no one can read them.", "score": 9, "replies": []}, {"body": "My team and I had a nice seafood lunch hours before our SVB cards were cancelled.", "score": 7, "replies": [{"body": "My company used SVP for business credit cards, real joy seeing them fall apart then realizing I have a shit ton of work come Monday because I need to call a bunch of hotels that my team members are traveling to this next week to adjust the cards on file... \n\nMy company is gonna love seeing all the reimbursement requests come through too while these folks are traveling and using their own money since their Pcards are dead", "score": 1, "replies": []}]}, {"body": "his face when he realizes someones going to buy his debt at auction or liquidation sale from the FDIC", "score": 5, "replies": []}, {"body": "I just cut up the cards and threw them in the lake. Can’t trace any of it back to me now.", "score": 6, "replies": []}, {"body": "![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4640)", "score": 4, "replies": []}, {"body": "OP is fucking dumb. I know I am on WSB and we all fucking turds. But OP just put it out there for everyone to c. 🤡", "score": 4, "replies": [{"body": "I think he was just making a funny meme to collect karma. If he’s serious, this is another whole new level of stupidity even for WSB", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": -5, "replies": [{"body": "You realize that the U.S. has only sent a small portion of its defense budget in American made equipment to Ukraine. And that it has been used to great success against our 2nd biggest geopolitical enemy. \n\n\nIt's a great victory. And not to be blamed for inflation.", "score": 4, "replies": []}]}, {"body": "So who has the deed?", "score": 1, "replies": []}, {"body": "🤣😂🥲😅", "score": 1, "replies": []}, {"body": "was about to say, I know op is just making a joke, but they'll sell their assets (your debt) to another bank, and the agencies have the authority to call your loan in full early...", "score": 1, "replies": []}, {"body": "No way this doesn't work ![img](emote|t5_2th52|4275)", "score": 1, "replies": []}, {"body": "so, the FDIC is holding your “assets”.", "score": 1, "replies": []}, {"body": "OP has never declared bankruptcy. If another bank comes calling, he’ll just transfer his debt to William Charles Schneider and it all just goes away.", "score": 1, "replies": []}, {"body": "OP has clearly bought many houses (with credit cards, no less)", "score": 1, "replies": []}, {"body": "Noon you are in debt to the fdic joker", "score": 1, "replies": []}, {"body": "Or max out your card buying crypto.  Then report a theft of your bag that had your cold storage wallet in it.", "score": 1, "replies": []}, {"body": "That is not how it works. Your debt is part of the banks' assets that will be sold to someone else. You will just be someone else's bitch", "score": 1, "replies": []}]}
{"title": "So basically, any bank holding long-term low yielding bonds can be at risk to go kaboom?", "selftext": "From what I've gathered of the SVB bank is that they got fucked from holding long duration bonds that didn't roll over fast enough that we're low yielding because of intrest rates at the time then Jerome Powell raises that shit fast af and now all that losses some of its value. Then, because of that, people pulled their money out  way faster than they could ever get paid back or sell their bonds for because they got devalued.\n\nQuestion is what banks that we all use on this reddit have that problem also? If they have enough treasuries in 3m, 6m, 1y, 2y duration bonds, they should be fine, but if most capital is tied up in 5y, 10y then arnt they at risk?", "id": "11ohv7f", "created_utc": 1678534166.0, "score": 90, "upvote_ratio": 0.9, "num_comments": 70, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|39|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Any bank run would kaboom any bank.\n\nSivb just slowly had to realize losses due to outflow of deposits and when it communicated these losses, it failed its communication miserably. Not to mention the VC guys calling for panic.", "score": 67, "replies": [{"body": "When all your customers are basically the same handful of guys with groupthink, this is going to happen.", "score": 19, "replies": []}, {"body": "hOw DiD tHiS hAppEn tHE CeO sAiD sTaY CaLm?", "score": 3, "replies": []}]}, {"body": "asset liability mismatch is the key. a bank having a big mismatch is most likely to go under.\nit starts from poor risk management practices. and lack of corporate governance.\na prudent bank would have kept the mismatch to the minimum and took small losses by adjusting the maturity of their bond portfolio. a bank with poor corporate governance and less than adequate risk management would have sat over the htm losses.", "score": 10, "replies": [{"body": "Yes this is absolutely it.  A bank I work for did this months ago with securities to get ahead of it.", "score": 2, "replies": []}]}, {"body": "Imo svb bank run was caused by pussy ass peter thiel. He's the one who told everyone to cash out and caused panic. Same shit that CZ did to Bankman (except sbf actually did commit fraud). If it wasn't for thiel, svb would've been fine.", "score": 41, "replies": [{"body": "Peter Thiel is a ghoul of the highest calibre but I don't think anyone has an obligation to keep their money inside a failing institution. The real problem is that all the money in the Bank is so highly correlated that some VC dipshit can empty your coffers", "score": 12, "replies": []}, {"body": "Thiel is better not shorting the stock. If yes, hope he goes to jail for creating this and putting thousands out of work", "score": 13, "replies": []}, {"body": "it's not Peter Thiel's job to make sure SVB stays solvent. It's SVBs job.\n\nIf SVB had better risk management (ie not lending to no credit startups, not investing in 10 year bonds when they were literally at their lowest point in history) this would never have happened.\n\n&#x200B;\n\nEdit: Peter's job is to do right by his firm, and his partners, which he did a very good job at.", "score": 3, "replies": []}, {"body": "Peter Thiel is looking smart right now.", "score": -1, "replies": []}]}, {"body": "I think SVB was very concentrated in companies with huge cash burns ex. high growth tech startups. Most banks are much more diversified, so a bank run is much more unlikely.\n\nAlso, they may have been the biggest banking beneficiary of the covid bubble.", "score": 26, "replies": [{"body": "The issue is that it is a lot easierbto have a bank run when your deposits are concentrated in very few customers. Most major banks serve many people and not just a small set of businesses, they will be fine.", "score": 9, "replies": []}, {"body": "This.", "score": 4, "replies": []}, {"body": ">Also, they may have been the biggest banking beneficiary of the covid bubble.\n\nThe biggest macro goal of the feds is to get that \\~$3tril covid stimulus money out of circulation and drive unemployment to \\~4%. Mission accomplished.", "score": 6, "replies": []}, {"body": "They have $200B in deposits!  And most start ups are funded by big companies and banks with a lot of cash.", "score": 1, "replies": []}]}, {"body": "I bet FDIC employees are pulling some sweet, sweet OT this weekend", "score": 9, "replies": [{"body": "hopefully their payroll isnt done through ripple", "score": 15, "replies": []}]}, {"body": "No, the main reason is that svb customer base is skittish af and they overreacted. Banks are supposed to hold long duration assets.", "score": 7, "replies": [{"body": "Maybe don't do that in the fastest rising rate environment in recent memory?", "score": 2, "replies": [{"body": "Again, all banks do this, they just are able to manage it better than svb did. Svb didn’t even have a chief risk officer until 2022. Inept management team.", "score": 2, "replies": [{"body": "I'm not sure what you mean by \"manage it better\". How are you supposed to be managing long duration assets right now other than to have sold it long ago?", "score": 1, "replies": [{"body": "Last I read they bought $80 billion in 10 year bonds around a year and a half ago. So they bought bonds yielding like .25%, at the same time that the government was money printing $5 trillion in stimulus money. \n\n1) you'd have to be a dumbass to not think there would be at least SOME inflation. Super basic economics, not sure why everyone has acted so shocked by this. Print money, it's worth less. Econ 101\n\n2) when inflation is too high, tightening the supply of money is the way to stop it. How do you do this? Almost exclusively by raising interest rates.\n\n3) what do rising rates do to bonds? They wipe out their value. A bond that was worth $100 with a .25% coupon is now worth let's say $85, because today I could buy a bond with a 4% coupon.\n\nThey held tons of money in bonds that all had the same duration. They managed risk terribly. They could have managed it better by not being fucking idiots. Would you put 75% of money into 10 or 20 year treasuries right now if they were yielding .25%? Would you do it if you owed potentially all of that money to other people? Probably not, because there is always the chance rates go up, which would wipe out your investments value. Congratulations, you're smarter than everyone in the c-suite of what was formerly the 16th largest bank in the country.", "score": 2, "replies": [{"body": "So don't go long duration in 2020-2021, like I said. Somebody above keeps writing about that's what all banks do.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Someone fucked up is the short answer.", "score": 19, "replies": [{"body": "Isn't that usually the answer?", "score": 2, "replies": []}]}, {"body": "Personally, I believe the issue is that banks no longer had to hold 10% of all deposits in cash. That limit was removed. It was okay when they were practically getting money for next to nothing from the fed central bank. Once the fed started raising rates, the jig was up. Now they are forced to go back to depositors to get capital. That’s why we are seeing CD rates at close to 5%. Another problem is that banks will buy T-bills and other bonds. With rising interest rates, their existing bonds liquid values are getting hammered in the open market because new bonds have much higher interest rates. This is why you’re seeing money markets at close to 4%. They need capital to buy more long term bonds. In short, many banks are probably suffering liquidity issues. This is just the first one that had to make it known.\n\nPS… given enough time, these banks existing bonds would mature and be worth full face value. It’s just a huge problem in the now.", "score": 7, "replies": []}, {"body": "Regional banks are in danger cuz they are more exposed to commercial property.  Like SVB it would be a  sector- specific crisis", "score": 4, "replies": []}, {"body": "Startup founders yelling fire in a crowded theatre and creating mass panic all trying to withdraw their deposits probably didn't help the situation...", "score": 3, "replies": []}, {"body": "Can someone explain why they were so leveraged on hold-to-maturity investments? The banks customers are mostly venture capitalists correct? And they most likely need to withdraw frequently to fund various projects..... So why did SVB place so much of that money where it's not easily obtainable?", "score": 3, "replies": []}, {"body": "Risk management at SiVB should have known better.  The Feds did not raise rates over night, their rate hikes have been a well communicated long process.\n\nSiVB wants to gamble and loss, now they pay the consequences, this should apply to every single banks who did not manage their risk in a rising rate environment.", "score": 3, "replies": []}, {"body": "Well if their asset duration doesn't match their liability duration, then the banks sitting on a lot of low yielding long term bonds is in trouble", "score": 3, "replies": [{"body": "All banks have duration mismatch. It’s literally the business model.", "score": 3, "replies": [{"body": "The duration of their assets should be somewhat dependent on the duration and risk of their liabilities, no?", "score": 1, "replies": []}]}]}, {"body": "When will the Netflix docu series come out?", "score": 2, "replies": []}, {"body": "You’re missing a step. Raising fed interest rates in and of itself wasn’t the problem that triggered the run. SVB needed capital because they have a client base of VC backed customers that are in a cash burn stage and weren’t raising as much money to replace the burn so the SVBs deposit base was decreasing. SVB had stupidly put too many reserves in the long term bonds. Because of the mark to market bond losses they instead tried to issue stock, but then everyone got spooked and the run was on.", "score": 2, "replies": []}, {"body": "When you have a fractional banking system any bank is at risk.", "score": 3, "replies": [{"body": "That doesn't sound correct. I thought that the primal bank can print new money to bail out other normal banks?", "score": 2, "replies": []}]}, {"body": "The capital buffers at the big banks are 5 fold bigger than they were in 2008. SVB was a unique case, with a unique customer base, where a influential person (Peter Thiel) decided to start a bank run on.", "score": 2, "replies": []}, {"body": "It's a special situation.\n\nGo read a Wall Street Journal article.", "score": 2, "replies": [{"body": "You mean bezos’ corp propoganda paper?\n\nRight lmao ![img](emote|t5_2th52|4271)", "score": -3, "replies": [{"body": "You’re thinking of the Washington Post.", "score": 7, "replies": [{"body": "yh you are right im regarded why are people upvoting me", "score": 3, "replies": [{"body": "blind leading the blind?", "score": 2, "replies": []}]}]}]}]}, {"body": ">There is always risk when investing in any type of security, but I believe that if a bank has a diversified portfolio across different sectors and maturity dates, they should be able to weather most storms. That being said, no one can predict the future with 100% accuracy, so there is always some element of risk involved.", "score": 1, "replies": []}, {"body": "Apparently there might be allot of them", "score": 1, "replies": []}, {"body": "Yes! Mortgage-backed securities strike again", "score": 1, "replies": []}, {"body": "The answer is yes but the bank you put your money in isn’t going to go down because of it. They pay some team of nerds 500k a year each to do the basic arithmetic to see if they’re screwed when interest rates rise and withdrawals increase. It’s not complicated to model or hedge relative to other risks. SVB was likely a mix of incompetence and greed", "score": 1, "replies": [{"body": "You do realize that incompetence and greed are the two most common traits on earth right?", "score": 0, "replies": [{"body": "That’s why I’m here", "score": 2, "replies": []}]}]}, {"body": "You are correct", "score": 0, "replies": []}, {"body": " Anna should not be public. SVB would have been fine if it wasn’t.", "score": 0, "replies": []}, {"body": "This has 2008 GFC vibes all over it", "score": 0, "replies": []}, {"body": "Relax.  Most solid banks with a temporary liquidity problem would issue newer bonds at a more attractive rate.  All banks make money based on fee income, so rising rates benefit the banking industry as a whole.  Since rates were so low, mortgage defaults will be minimal unless we have massive unemployment for a long period of time. In other words, your money should be safe a long as you stay away from subprime lenders.", "score": 1, "replies": []}, {"body": "Only if they talk about it. The raise that svb did amd the pr surrounding it caused a bank run.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "Short squeeze your competition. Pop", "score": 1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": [{"body": "Pop", "score": 1, "replies": []}]}]}, {"body": "it was an attack on the bank", "score": 1, "replies": []}, {"body": "What other banks are like svb?", "score": 1, "replies": []}, {"body": "DPST puts.", "score": 1, "replies": []}, {"body": "This story aged like milk - you can run but you can't hide, tech bros!\n\n[https://www.wired.com/story/tech-layoffs-are-feeding-a-new-startup-surge/](https://www.wired.com/story/tech-layoffs-are-feeding-a-new-startup-surge/)", "score": 1, "replies": []}, {"body": "Only if an “organized” run on it occurs", "score": 1, "replies": []}, {"body": "SVB tied up too much cash in treasuries that were impossible to get out of without taking a hit due to the rate hikes. When customers asked for cash they kept having to sell at a loss. \n\nWhy a bank would buy so many treasuries after a gigantic money printer explosion is beyond me. It must be that the VC tech circle really did believe that people were going to want to stay at home forever even after COVID, even though people were so bad at staying at home that the COVID was spreading around like a wildfire.", "score": 1, "replies": []}, {"body": "Not necessarily, SIVB was in a unique situation where both their liabilities and assets were extremely sensitive to interest rates. February deposits being much lower than anticipated and putting them in a liquidity crunch forced them to sell their assets for a loss, but if that never happened they could have held their bonds to maturity and collected their yield. If your entire banking clientele is startups who don’t actually generate cash flow and need a low interest rate to survive AND youre holding long term bonds you end AND you completely fuck up your messaging towards your current clients then yes you will be at risk of going kaput.", "score": 1, "replies": []}, {"body": "If forced to liquidate to have cash for operations then yes. If they have enough reserves they may not need to go kaboom.", "score": 1, "replies": []}, {"body": "Money printer go brrrrrr", "score": 1, "replies": []}]}
