{"title": "I hope the recession isn't as deep as the yield inversion", "selftext": "", "id": "11sdjrv", "created_utc": 1678924082.0, "score": 186, "upvote_ratio": 0.96, "num_comments": 72, "comments": [{"body": "You can’t have so much money floated around ffsssss…. Have no choice but to raise rates… if they don’t, it’s gonna be worse in the long run that’s it", "score": 51, "replies": [{"body": "The issue is that the rates being raised at the current pace has caused bonds w/ lower interest to devalue to the point where the financial system is failing.", "score": 21, "replies": [{"body": "Don’t worry guys the government will waive your losses on those bonds (if you’re a bank)", "score": 2, "replies": []}]}, {"body": "Hi", "score": 5, "replies": []}]}, {"body": "What people keep ignoring is that the markets have already taken a pretty big tumble.  The Nasdaq dropped almost 40% from peak to trough, the S&P dropped 25%.  You might be waiting around for a crash/recession that already happened.  Remember that the market historically recovers well before the recession ends, sometimes before the recession is even recognized as a recession.", "score": 73, "replies": [{"body": "The market was almost parabolic, would be unrealistic to consider this correction done.", "score": 7, "replies": [{"body": "its parabolic because they print trillions of dollars, and they wont stop printing.", "score": 2, "replies": []}, {"body": "It is not \"irrational\" because of the money printing scheme. If they were not printing money at 0% interest rates well then you could say its obviously a bubble.", "score": 1, "replies": []}]}, {"body": "this is true. maybe in 2030 we realize then that the 2020 dip was the very bottom of the market.", "score": 14, "replies": []}, {"body": "Markets still look overvalued based on historical ratios. If rates stay high, there is no reason for the markets to be at a higher valuation.", "score": 3, "replies": []}, {"body": "Markets are still higher than they were before the pandemic, and they were considered really hot then.\n\nIf you bought around that peak, you’re going to have a bad time.", "score": 13, "replies": [{"body": "I’d be willing to bet the markets are higher in ten years than they are today. My 401k bi-weekly contributions will gladly buy the dips.", "score": 13, "replies": [{"body": "This guy gets it", "score": 3, "replies": []}, {"body": "The market has moved side ways for decades before. Especially when you count for inflation, your real returns could be close to zero for the next 10 years easily.", "score": 0, "replies": []}]}]}, {"body": "Youre so valid", "score": 6, "replies": []}, {"body": "Does everyone seem to just ignore the fact that in 2007 the Dow had a 15% loss, rebounded a little bit, and THEN crashed 40%? \n\nI guess history just doesn’t matter anymore.", "score": 2, "replies": []}, {"body": "40% for the nasdaq isn’t that much though. S and p only fell 20%. Considering banks are just starting to fail, inflation is still very high (especially when you learn how they calculate it) and interest rates are too. Personal savings is the lowest it’s been and decades. Credit card debt the highest.\n\nThe thing is, inflation is a double edge sword for people in debt. You raise rates, people can’t afford to pay their debt (not necessarily mortgages, though it’s important to note that high interest rates cause housing declines). And if you let inflation win, they keep adding debt because wages are extremely low right now. \n\nWhat’s the right answer here? It seems like we are trapped and they’re going to choose big business over everyday people. Though, maybe trickle down economics will actually work and we will end up keeping our jobs because businesses were more resilient! /s", "score": 2, "replies": []}, {"body": "I think so too. People keep comparing to charts from 1929, lol. I’m sorry, but what? A lot has been shaken out. Double bottom on nasdaq. I think now we reverse. Crypto too. Winter might be over. I’m exhausted and I think I want a sabbatical.", "score": 1, "replies": []}, {"body": "I thought it takes years after the rates are lowered to come back to par.\n\nWhy would you buy before a possible hike?\n\nAlso war - after it ends - usually inflation peaks then?", "score": 0, "replies": []}, {"body": "It’s tricky cause the Biden administration keeps manipulating numbers", "score": -12, "replies": []}, {"body": "To add to your point, its been 4 months of bull market since the last spx bottom, which means it's almost certainly been a reversal, and not a bull trap.", "score": -2, "replies": []}, {"body": "In previous crashes like 2001 and then 2008, there was a series of steps down and people were saying \"it can't possibly get any worse\" at every stage - and then it did. Some individual stocks went from down 40% to down 80% - to down 90%.\n\nSo while I think you have a point, that doesn't really mean anything. We haven't seen panic yet, but watch to see if the prolonged downtrend starts to get investors nervous. As the price drops below their entry point and they get nervous, they could start pulling out of the market to preserve their investment, which could in turn generate panic.\n\nIt's difficult to call the bottom.", "score": 1, "replies": [{"body": "We have seen multiple step downs over the last year, and there are a TON of individual stocks that have gone down 80-90%.  You aren't describing anything that we haven't already seen.  Could it get worse?  Maybe.  But you can't sit here and say that we haven't seen any similar signs to 2001 and 2008, because we absolutely already have.  It's entirely possible that the bottom has already occurred.", "score": 1, "replies": []}]}]}, {"body": "Govt bailing out the banks with free cash..and making people poor..no economy is strong without people.", "score": 38, "replies": [{"body": "Exactly…", "score": 5, "replies": []}, {"body": "Thank you.", "score": 1, "replies": []}]}, {"body": "And yet it’s been financial suicide to short. God bless America and our unrelenting desire to gamble. Bearish.", "score": 14, "replies": [{"body": "I'll keep buying quality stocks at a discount. Fuck it.", "score": 11, "replies": [{"body": "Where are there quality stocks at a discount?  Valuations are still pretty high and most are predicting softer earnings through the rest of this year.", "score": 12, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Sounds like technical analysis, which typically isn’t about finding discounts, but is more about using data to predict trends.   I don’t see any P/E ratios in many tech stocks that are anywhere near a discount.  P/E isn’t the end all and be all, but it’s hard to call something a discount with a P/E of 30-40-50-100", "score": 1, "replies": []}]}, {"body": "I see Bank of America May rise 30% , so I wld take that.", "score": 1, "replies": []}]}, {"body": "This is the way.", "score": 0, "replies": [{"body": "Assymetric R:R. This is NOT the way. Maybe for our parents, but we’re on the tail end of the largest credit cycle in history. EMs are the only place I see good risk-on opportunities at the moment.", "score": 5, "replies": [{"body": "What's an EM", "score": 2, "replies": [{"body": "Emerging Markets is my guess.", "score": 1, "replies": [{"body": "Ta", "score": 1, "replies": []}]}]}, {"body": "Good shout.", "score": 0, "replies": []}, {"body": "Morgan Stanley Wealth Management desk agrees with you... fwiw anymore.", "score": 1, "replies": []}, {"body": "That being said. Credit cycles often take 4-7 years to recover at max. The question is whether this will be the long term debt credit cycle which will eventually cause a severe depression that resets the entire financial system.", "score": 1, "replies": [{"body": "You’re right, and that’s for each person to decide for themselves. I’m pretty confident in my conclusion, and it’s not a very pretty outcome. \n\nBut… what country is really ready to take the throne as the new global power? I long thought China, but their Real Estate market is insanely more inflated than the US(it’s hard for me to believe too). Gonna be an interesting few decades to say the least", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I don't think it is looking very good.", "score": 18, "replies": []}, {"body": "God I wish I understood", "score": 8, "replies": [{"body": "https://www.investopedia.com/terms/i/invertedyieldcurve.asp\n\nIt's a comparison between 2 year and 10 year interest. Basically negative means you expect the economy to tank and force FED to lower rate soon.", "score": 16, "replies": [{"body": "FED: We learned from the 80s. Inflation comes in waves\n\na few moments later: we need to cut interest rates \n\nWhats your opinion guys. Will we cut the interest rates? Will we see a new wave of inflation in 2024-2025? \n\nHow long will we drive the pain train ?", "score": 1, "replies": [{"body": "Interest will be cut when unemployment rises and there is downward wage pressure instead of upward.\n\nThis is of course very simplified.", "score": 3, "replies": [{"body": "yeah totally right, but once again, this happened in the 80s and lead to economic recovery + inflation. \n\nman, the FED is rly in a bad position.\n\nWill the recession dampen the inflation enough ...Can we cut the interests rate without a new wave of inflation ? \n\ndo we have enough ink for the money printer...\n\nso many questions..", "score": 1, "replies": [{"body": "In the end it's just a supply and demand problem. Money have to be tight enough to not be able to cause inflation. The problem now is that trade war with China and Russia can lower supply even more.", "score": 1, "replies": []}]}]}]}]}, {"body": "A yield curve inversion occurs when the interest rates (or yields) on short-term government bonds become higher than those on long-term government bonds. This phenomenon is often seen as a negative indicator for the economy for a few reasons:\n\nPredicting economic slowdown or recession: Historically, an inverted yield curve has been a reliable predictor of an upcoming recession or economic slowdown. It suggests that investors expect lower interest rates and weaker economic growth in the future.\nDisincentivizing long-term investments: When short-term interest rates are higher than long-term rates, investors may be less likely to commit to long-term investments, as they can earn more by simply reinvesting in short-term bonds. This can lead to a decrease in long-term capital investments, which can negatively impact economic growth.\nTighter credit conditions: An inverted yield curve can signal tighter credit conditions, making it more difficult for businesses and consumers to obtain loans. This can lead to reduced spending and investment, further contributing to an economic slowdown.\nImpact on financial institutions: Banks and other financial institutions typically borrow money at short-term rates and lend money at long-term rates. An inverted yield curve can reduce their profit margins, leading to decreased lending activity and potentially causing stress in the financial system.\nIt's essential to note that an inverted yield curve is not a guaranteed predictor of an economic downturn, but rather an indication that market participants are expecting weaker economic conditions. Other factors, such as fiscal and monetary policies, international economic conditions, and geopolitical events, can also influence the overall economic outlook.", "score": 17, "replies": [{"body": "Thank you!", "score": 2, "replies": []}, {"body": "Thank you chat GTP", "score": 2, "replies": []}]}]}, {"body": "This yield curve is literally a ski slope.  The opposite of what it should be.", "score": 2, "replies": []}, {"body": "It will be similar to balls deep so no worries", "score": 2, "replies": []}, {"body": "Correlation =!= causation \n\nRemember, the yield curve inverts because people expect interest rates to decrease, which generally only happens during a recession.\n\nThe yield curve is mostly inverting now to prevent a banking crisis, rather than recession expectations, so claiming a severe yield curve means a severe recession is a spurious conclusion.", "score": 3, "replies": [{"body": "The banking crisis is last week while inversion have been happening for months.", "score": 14, "replies": []}, {"body": "lol exactly this chart didn't happen overnight. I've seen this invert yield happening since before this year began", "score": 1, "replies": []}]}, {"body": "Something doesn’t smell right", "score": 2, "replies": [{"body": "Your username.", "score": 3, "replies": [{"body": "🚽 👀 🥣", "score": 1, "replies": []}]}]}, {"body": "It's coming soon folks!", "score": 1, "replies": []}, {"body": "Astute observation.", "score": 0, "replies": []}, {"body": "It will be...", "score": 1, "replies": []}, {"body": "I keep seeing a lot of posts like this and can not help but think: is this just a reflection of massive money printing followed by what is going on now", "score": 1, "replies": []}, {"body": "Depth, balls.", "score": 1, "replies": []}, {"body": "what does the chart show?", "score": 1, "replies": []}, {"body": "Dang, we’ve been so spoiled with record low interest rates for so long, that is just how people think it should work.  I do think rates came up too fast, though, they needed to come up.  They should have started coming up before the pandemic.  I think we’ll see a pause, but rates will still come up, just slower.", "score": 1, "replies": []}, {"body": "Not too concerned if ones strategy is already in place.  Diversity really helps to get through difficult times.", "score": 1, "replies": []}, {"body": "What is this, 10-2? 30-2?\n\nOf course it's negative, inflation (and thus FFR) is high, but inflation isn't expected to be this high for decades. that's not inherently predictive of a recession, esp because inflation is so high thanks to an overheated economy.", "score": 1, "replies": [{"body": "10-2", "score": 1, "replies": []}]}, {"body": "That’s what she said bro", "score": 1, "replies": []}, {"body": "The cause of the inversion is more indicative of the depth of the recession.", "score": 1, "replies": []}, {"body": "Of anything it'll be like 1980", "score": 1, "replies": []}, {"body": "Don't worry bro, I is un-inverting, so we should be fine *sarcasm off*", "score": 1, "replies": []}]}
