{"title": "Leveraging owned underlying", "selftext": "I started reading up a lot more on options trading and have a lot more to learn. But after reading a few different ways to trade options it got me thinking - is there a good way to leverage and make income on stock that I own? \n\nI have around 250 shares of $MSFT through accumulation over the years with a pretty low cost basis.\n\nI don’t mind selling the stock since I have a lot of exposure already - so I’m ok to take on risk to some extent. \n\nIs selling covered calls the only method I could use to get passive income? Is there something else I could do?", "id": "l1njhq", "created_utc": 1611191691.0, "score": 5, "upvote_ratio": 0.73, "num_comments": 29, "comments": [{"body": "If you start selling covered calls on MSFT make sure you're ok with letting the shares go at your chosen strike price. Our feed is FLOODED with people who grew emotionally attached to their shares and ultimately dont want to let go. They end up having to buy their contracts back for a loss.", "score": 5, "replies": [{"body": "That's because they are okay with 5% until they see 10 or 15 and get greedy.", "score": 1, "replies": []}]}, {"body": "Covered calls is the best way to play this. When I owned msft I sold for about 2 weeks out and could generally make a couple hundred per contract. I would generally just keep adding to msft position. Should try this until you have 300 shares. Also go to theta gang on Reddit.", "score": 3, "replies": []}, {"body": "As far as I know. Cover calls is your only play. In this market don’t make the calls too tight, unless you go very tight on the time frame. Once you lose the stocks you can sell puts to get the stocks back.", "score": 2, "replies": []}, {"body": "I normally sell cover calls. I take profit at 50% and 75%. I sell way otm stock need really good news for the stock to reach my strike. I don’t sell cover call during earning! Leaning to read charts if you want to sell cover calls.", "score": 2, "replies": []}, {"body": "You could utilize a ratio spread to capture more upside at the expense of some of your upfront credit.\n\nScenario 1: Sell 2/19 $235 call for 3.40 credit.  If stock goes to $240, you make 10.00 from appreciation plus the 3.40 premium, total of 13.40 per share. \n\nScenario 2:  Sell two 2/19 $240 calls and buy one $2.35 call for 1.20 credit.  You collect less credit up front, but if stock goes to $240 you make $15 from appreciation, plus 1.20 premium, plus 5.00 from the additional debit spread, total of 21.20 per share.  You're giving up 2.20 to possibly make an extra 7.80 vs scenario 1.\n\nI use scenario 2 for stocks that I hold that have depreciated and am trying to recover from.  My long strike will be ATM in that scenario, so that any recovery at all will benefit the debit spread.", "score": 2, "replies": []}, {"body": "Covered calls and using current holdings for free leverage by selling naked calls and naked puts. Watch out for margin calls. Would recommend only using 10-20% leverage to get a feel.", "score": 1, "replies": [{"body": "CCs offer no leverage. Other than if you bought shares with margin.", "score": -1, "replies": [{"body": "Yes they do. It allows you to still hold current holdings and use them as leverage. Always someone willing to argue over the internet.", "score": 1, "replies": []}, {"body": "You obviously do not understand the difference of margin and leverage. Get educated before you pass along false information to people.", "score": 1, "replies": [{"body": "I clearly do. You are the one who is misinformed.\n\nA margin account allows you to borrow broker money usually at a 2x multiple. Allowing you to have buying power 2x the amount of money you put in. Theoretically if you bought shares, you would only be putting up 1/2 the share price in \"real money\". Real money being money that you own.\n\nNotice that you have 2 different numbers in your margin account, stock buying power and option buying power. Your stock buying power will be reduced by the share price (roughly, depends on what margin you are using exactly, I am not familiar with how portfolio margin works because I am a peasant.)\n\nA CC takes the same amount of buying power whether you are in a cash account or a margin account, seeing as a CC requires you to own shares.", "score": 0, "replies": [{"body": "You’re actually dumb.", "score": 1, "replies": [{"body": "So how does margin work then?\nWhat is leverage then?", "score": 0, "replies": [{"body": "If you go back to my post. I said you can use your current holdings as leverage, not margin. I said to watch out for a margin call. There’s a difference, you are wrong and chose to just read what you wanted. Good try, better luck next time.", "score": 1, "replies": [{"body": "How are your current holdings providing leverage?", "score": 1, "replies": []}]}, {"body": "You’re making yourself look beyond dumb by how wrong you are. I have my series 7 and do this for a living. Fucking dumbass.", "score": 1, "replies": [{"body": "You do not.", "score": 0, "replies": [{"body": "Yes, I do.", "score": 1, "replies": [{"body": "I actually believe you are stockbroker, because you clearly have no idea what you are talking about.", "score": 0, "replies": [{"body": "You obviously do not understand how this works. You’re dumb. Can someone else please jump in here.", "score": 1, "replies": [{"body": "I still have yet to hear from you how margin works.", "score": 1, "replies": [{"body": "You’re a fucking dumb fuck and a piece of shit", "score": 1, "replies": [{"body": "I know", "score": 1, "replies": []}]}, {"body": "You cannot use margin to buy an type of margin. You’re fucking stupid", "score": 1, "replies": [{"body": "That is not an explanation of margin", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "So selling calls (covered calls, CC) trades delta for theta. This lowers your overall leverage by reducing your delta. With 250 shares your delta is 250. Selling 2 call contracts at 10 delta, for example, puts you in the same position as selling 20 shares (minus 20 delta). If you want to leverage up you need to increase delta, not decrease it. You can do this by buying calls or selling puts, ie trading theta for delta. Think of theta like the interest you pay to get delta exposure. Or you can enter into a more complex (multi-leg) position.\n\nBut options are always an exchange of  greeks. You can sell delta off and lose some upside with CCs, or you can rent delta, or you can do something else.\n\nAnd since options are a zero sum game, you can actually assume that the market (collection of all market participants) thinks the money made by selling 20 shares is exactly the same as by selling two 10-detla call contracts.\n\nSo, only trade options when you think that the market is missing something, or overreacting to something.\n\nEdit: to the last point, risk is worth something. Selling options means you are taking uncertainty. This is not one of the greeks, so you can make money by just hopping on the roller coaster and hoping to stay solvent. This is kind of the only way to make money with options that doesn't presuppose you knowing more than the institutional investors. :)", "score": 1, "replies": [{"body": "Wow, I can't believe I never thought of it as trading Greeks for other Greeks. That is a seriously good way to put it. I will have to think about that for a while.", "score": 3, "replies": []}]}, {"body": "Just want to add to what others wrote - if the shares you write a covered call against do get called away, you'll be paying short term capital gains tax on the gains those shares have made, regardless of how long you've been holding them.", "score": 1, "replies": []}, {"body": "As I stated in my Original response, you are able to write uncovered options.", "score": 1, "replies": []}]}
{"title": "Would it be smart to put $1,000 into AAPL now before the supposed third stimulus checks?", "selftext": "[deleted]", "id": "l1tuzv", "created_utc": 1611215350.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 23, "comments": [{"body": "It would be very dumb to go in on AAPL now and expect short term gainz to the moon.\n\nIt would be extremely smart to go in on AAPL now and hold forever.", "score": 14, "replies": [{"body": "Yes I’m not expecting short term gains, I mean more so is it smart to treat AAPL as a secondary savings with a potential to have a high interest rate? I’d be holding for 5-10 years as long as nothing major happens in like where I don’t need every penny i have", "score": 3, "replies": [{"body": "that’s pretty much the basic idea of investing, so you’re on the right track", "score": 5, "replies": []}, {"body": "Only thing is, it might take you up to a week or maybe a tad longer to actually get that money from the apple stock into your bank account.  It shouldn't take long at all to sell, almost instant, your apple stock, but the long wait would be from taking that money out of your broker and putting into the bank.  Think it takes a few days for the funds to 'settle' and then another few days to get it from broker into bank.  So plan for a week or so to get the funds in emergency situations.  If money is need NOW, use credit cards and then pay off when funds arrive in bank.", "score": 1, "replies": []}, {"body": "Everyone should have at least some AAPL long term. Go for it. AMZN is another one.", "score": 1, "replies": []}]}, {"body": "Bb", "score": -1, "replies": [{"body": "What are you doing? get a grip", "score": 3, "replies": []}]}]}, {"body": "There’s nothing wrong with that, I personally have around 1000$ invested in Apple right now. It’s a good company that has made me decent returns since I bought it, it’s one of those companies that you own and not trade.", "score": 2, "replies": [{"body": "When you say own and not trade, do you mean more so you treat it as a separate, more risky savings account?", "score": 1, "replies": [{"body": "no, I mean that you don’t sell it and only buy more until you retire or it becomes ridiculously overpriced.", "score": 2, "replies": []}]}]}, {"body": "Yes but I believe your money will grow more in the other fruit company. Long term", "score": -1, "replies": [{"body": "Other fruit company?", "score": 2, "replies": [{"body": "Blackberry!", "score": 0, "replies": [{"body": "i’ll buy BB after the wsb pump", "score": 0, "replies": [{"body": "Why don't you spend 500 on a June call and then exercise the option....", "score": 0, "replies": []}]}]}]}]}, {"body": "Good choice just buy in the dips. I have about 2k invested during their split and I've stayed in the green since.", "score": 0, "replies": [{"body": "I just put $100 in it while it’s at 133, perhaps that wasn’t smart. What dip should I be looking for?", "score": 1, "replies": [{"body": "Any huge dip. There is no specific dip, just watching when the market falls down sometimes it's a couple bucks sometimes it's a couple cents. Buy low sell high but in this case keep onto it for a couple years", "score": 0, "replies": []}]}]}, {"body": "Apple is a good long term hold. For short term not so much \n\nhttps://discord.gg/rx3HKkYYAB", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Damn you bought 100k worth? That’s insane, I’m really happy for you that you’re able to do that man.", "score": 3, "replies": []}]}, {"body": "Buy some under value stock $NOK or $AMC.", "score": 1, "replies": []}]}
{"title": "I thank I've come up with a great selection of Trading 212 pies. Most are based on my individual investments and background/experience in tech. Any feedback or suggestions would be greatly appreciated?", "selftext": "**EV & Auto Tech Pie**\n\n[https://prnt.sc/xcy5px](https://prnt.sc/xcy5px)\n\nI searched long and hard for a suitable ETF and while a few keep getting mentioned like CRIV and iDRV I couldn't access these on the platforms I use. So I came up with this selection, which ranges from popular EV manufacturers like Tesla and Nio to battery and component stocks. They've performed very well individually and the great thing about this pie is that I can re-adjust the weightings when needed. Currently Tesla and Plug Power are very prominent due to current growth but it won't last forever and then I will be moving more into the component space (e.g. batteries and lithium)\n\n**5G, Semiconductors & Microchips Pie**\n\n[https://prnt.sc/xcy8h4](https://prnt.sc/xcy8h4)\n\nI follow Fool.com who were heavily promoting 5G stocks but I didn't want to pay for the subscription. I did my own research and this is a collection of stocks I have been investing in for around 1 year and they've all seen excellent growth. This is the pie that I'm most confident about long-term. With the exception of AMD and Nvidia Who are fairly well-known, many of these of stocks aren't known very well in terms of the brand names involved but they play a significant role in our lives and I expect will play an even greater role in the years to come. I'll be updating this soon with a couple of additional stocks that I've been tracking.\n\nYou'll notice a pattern as many of the companies feature across pies, especially in the semiconductor/chip space. The ones below are more speculative based on my research. I don't have as much experience investing in these sectors but I feel they have great potential and would really like to get feedback on these:\n\n**Hydrogen & Fuel Cell Energy Pie**\n\n[https://prnt.sc/xa4nmv](https://prnt.sc/xa4nmv)\n\nThis one is linked to my EV pie but with more of a broader focus on energy solution suppliers working in the Hydrogen space.\n\n**Uranium Mining & Energy Pie**\n\n[https://prnt.sc/xa4lsr](https://prnt.sc/xa4lsr)\n\nMany of these stocks are near an all time low given uranium/nuclear power's lack of popularity historically, but times are changing and demand for uranium and nuclear is growing so I can only see this going up in the years to come.\n\n**Crypto, e-Payment Platforms & Blockchain Pie**\n\n[https://prnt.sc/xa4me0](https://prnt.sc/xa4me0)\n\nMany of the players here are well know and are getting on board with crypto in a big way, e.g. Visa, PayPal, DocuSign, etc. Others provide the chips and hardware to make bitcoin/crypto mining possible, e.g. AMD and Nvidia. Then I've included some of the companies actually involved in the bitcoin mining. I know less about these companies so have given them a lower weighting.", "id": "l1vldc", "created_utc": 1611223370.0, "score": 13, "upvote_ratio": 0.93, "num_comments": 20, "comments": [{"body": "Looks pretty good to me, get rid of Nikola though. Hyln would, imo, be a better pick", "score": 3, "replies": [{"body": "Thanks for the tip, I added that one in at the last minute.", "score": 0, "replies": []}]}, {"body": "Wow didnt know Samsung was finally on T212.. wanted to invest in them for a long time 👌", "score": 1, "replies": [{"body": "I know, it’s not on other platforms I use like Freetrade. It might be a new addition to 212", "score": 0, "replies": []}]}, {"body": "Looks sweet, tempted to get into that crypto and blockchain one.", "score": 1, "replies": [{"body": "I can only see this going up. I’ve got smallish investments in BTC and ETH using Revolut, which have exploded recently (especially ETH) but I wanted to get more involved with the actual companies making this happen. With the weighting more towards microchip and e-Pay providers included within the pie, this also helps to minimise the risk of a drop.", "score": 1, "replies": []}]}, {"body": "Looks cool but honestly switch out Nikola and lower the percentage of Plug Power. Kinda missing NEL in this pie aswell.\n\nI might be super retarded but how do I create my own pies in t212? I'm probably super blind but I cant find it anywhere (logged in with my browser, not on my phone)", "score": 1, "replies": [{"body": "I think pies are just on the mobile app at the moment under Portfolio. You can then see pies tab next to investments where you can click \"+\" to add a pie or \"open pie library\" to view or copy other pies.", "score": 2, "replies": [{"body": "Thanks, got it! Hopefully they bring the function to their webiste aswell.", "score": 1, "replies": [{"body": "I'm sure this is being added soon", "score": 1, "replies": [{"body": "It's already on the website has been for a while, in the  portfolio section towards the bottom of the page", "score": 1, "replies": [{"body": "Thanks for confirming, does this include the ability to copy pies and add comments? I knew certain features were restricted to mobile only currently but I wasn't sure which", "score": 1, "replies": [{"body": "Honestly haven't tried, but I imagine they would have included both features, would be strange to make them app exclusive", "score": 2, "replies": []}]}]}, {"body": "If you add /beta to the URL (t212 . com /beta) it will give you access to pies on the web", "score": 1, "replies": []}]}]}]}]}, {"body": "All in URG", "score": 1, "replies": []}, {"body": "Tempted to try out the microchip etf. And potentially bitcoin etf", "score": 1, "replies": [{"body": "If you can’t find them, send me a direct message and I’ll try to share the link", "score": 1, "replies": [{"body": "Managed to find it, annoyingly we aren't able to put pies in a pie yet", "score": 1, "replies": [{"body": "Haha you can add an ETF to a pie though. I just  wonder how much diversification is really a good thing in a single pie", "score": 1, "replies": [{"body": "Agreed.  I tend to just target a few sectors which I think will grow, and then allocate a small 10% to a s and p fund.\n\nI just prefer to do that all in 1 pie rather than having multiple pies.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Canoo ($GOEV): Some predict it'll go sub-$10, some project $30/share by year's end. What does this sub say?", "selftext": "I've been in Canoo since under $11 in the HCAC days. I've believed in their skateboard tech and been there to see the partnerships (Hyundai), potential partnerships (Lyft), and even the failed rumors (Apple) along the way. However, I am also now fancied by CCIV and their rumor of getting Lucid Motors, so the shine has come off Canoo a bit.\n\nAs such, I've been Googling forecasts for Canoo and they run the gamut of being \\~$7 in a year to around $30. Curious what this sub has in terms of possible forecasts for this stock.", "id": "l24rle", "created_utc": 1611254807.0, "score": 4, "upvote_ratio": 0.67, "num_comments": 25, "comments": [{"body": "so what you are saying -  \"Should I sell a legit EV company for a spac which is rumored to get an EV company\"\n\nas with any startup, it is all potential. Every stock can go to $0, but there is much less chance for others to do so for obvious reasons.\n\nguess it all comes down to what YOU want - a possible quick buck, or an even bigger payout way down the line.\n\nme personal opinion? well i cannot advise you, but All I can say is - if Hyundai/Kia believe in canoos tech and Apple tried to buy them, they obviously have something that others don't have\n\nIf Kia build Apples car, there is absolutely no way in hell canoo wont have some kind of input.\n\nStock forecasts do not mean fucking shit either. Big names said Tesla was basically destined to be a bankrupt penny stock lol\n\n&#x200B;\n\nEDIT: Apple buying canoo was not even a rumors it seems", "score": 8, "replies": [{"body": "I actually was considering selling Canoo to free up cash for Ethereum. As far as CCIV maybe getting Lucid, it's still a huge SPAC with potential regardless of target. \n\nI do see your point with the love other company's have for Canoo, which is why it's been my largest position for months.", "score": 2, "replies": [{"body": ">Ethereum\n\nI guess the way i look at it is that i just do not think at all that someone like Hyundai would give a startup a second look if they did not have something good.\n\nAlso, if you have not done so already - go check out canoos job listings. If that is not a company with something around the corner, then they are just hiring for the fun of it instead of burning notes and using it to snort crack lol", "score": 4, "replies": [{"body": "Again, I've been bullish on Canoo when it was a hint of an HCAC LOI rumor. That said, I've got an Ethereum itch my liquid funds can't scratch - hence my dilemma.", "score": 1, "replies": [{"body": "Yeah i get your dialemma - you want the possibility of very quick gains and large ones aswell. Problem is, we still dont know what canoo is going to put out there.\n\nI remember having this werid hinch that Apple may have been involved back in HCAC days (due to rumors early on) and everyone thought it was a fairytale.\n\nPersonally, there is wat too many clues for what could be instore for canoo. The hyundai/kia partnership and the apple relation, aswell as a massive opening for job positions etc all point to posiblilties. They do not even pump their stock which kind of spells out they dont need to for good reason.\n\nI think in this EV race, IP and liecening is what is going to make you the constant money, especially if you are starting out. \n\nAgain, all my own words and do what you have to do!", "score": 3, "replies": []}]}, {"body": "Then you can also look at it as the way of buying up your competition before they become real competition", "score": 1, "replies": []}]}]}, {"body": "They have not really shown us anything to put any trust in them. All we have is marketing videos and nothing of real substance.", "score": 0, "replies": [{"body": "What? That’s not true at all. They introduced their working van an adventure vehicle and hinted at a sedan and truck. They actually don’t do enough marketing IMO.", "score": 4, "replies": [{"body": "'Working Van' is questionable, it is a working prototype Van. They are claiming limited production of this Van in 2022 which say it all. They are far from mass producing anything at this point in time. They have not shown to us that they have a legitimate working platform that they can manufacture.", "score": 1, "replies": [{"body": "What do you consider a working platform? They have been working on safety/ and gearing up for production: \n\nhttps://www.cnet.com/google-amp/news/canoo-driving-skateboard-platform-\n\nOr the recent unveil:\n\nhttps://electrek.co/2020/12/18/canoo-electric-delivery-van-teases-electric-pickup-truck/amp/\n\nThey’ve been saying 2022 from the start with full production to begin in 2023. That’s not far off and I think their current price reflects that. \n\nI’m in at 10.70 and this is the only SPAC I’ve held though merger due to their potential and partnerships. If you don’t like them I get it but let’s be fair.", "score": 5, "replies": [{"body": "It is not that I don't like them, I am just not convinced of them yet. There are as a long shot as Tesla was when they started. The difference being, they seem to be betting on partnerships with auto manufacture which is not going to be easy at all. Manufactures will only go to them if they think they have completely missed the ball or lagging behind by to much.", "score": 1, "replies": [{"body": "But they have a partnership with Hyundai now? \n\nAgree, they are still in their infancy stage. The price currently isn’t that high and I think reflects your own trepidation.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "$GOEV is the \"picks and pans\" of the EV Gold Rush. The money they can save a company by licensing out their skateboard platform will be a necessity for any auto makers to compete going forward. I'm also interested in their own designs, but it's that skateboard chassis I'm really investing in.", "score": 7, "replies": []}, {"body": "Bought GOEV over the last couple of days. \n\nIt’s what I’m going to start buying on a regular basis. Potential to be the ones supplying their skateboard through Hyundai for the Apple Car. This thing has explosive potential written all over it.", "score": 4, "replies": []}, {"body": "I’ll take $1, Bob!", "score": 7, "replies": [{"body": "Bullish I see.", "score": 2, "replies": []}]}, {"body": "Have 388 shares of $GOEV currently, holding till $25-$30", "score": 3, "replies": []}, {"body": "Look at GOEV’s revenue forecast for the next 4-5 years. I have 132 shares and am holding for a long time.", "score": 2, "replies": [{"body": "I have 112 and I planned on that as well, it's just Ethereum's siren song and all... \n\nI'm sure I'll hang onto Canoo and CCIV in hopes of Lucid. I'm also holding XPEV because I like them better than NIO.", "score": 2, "replies": [{"body": "Let me ask you, why ethereum and not Bitcoin? I played this same game in 2017 and remember ethereum as being the improved network. However, there’s no inherent value in ethereum, it’s just the gas that runs it. Whereas Bitcoin is seen as both blockchain and currency. All other coins follow Bitcoin, however when they all fall, it’s Bitcoin that rises. \n\nI’m just curious, what’s the justification (and don’t tell me because it’s cheaper and can 10x, cuz that will never happen).", "score": 1, "replies": [{"body": "It's cheaper and can 10x.", "score": 1, "replies": [{"body": "Ya definitely stick with GOEV then.", "score": 2, "replies": []}]}]}]}]}, {"body": "Sell, it’s over valued based on a rumor with Apple and the general EV hype.", "score": 0, "replies": []}, {"body": "Yeah when the EV bubble inevitably pops, they’ll be sub $10 no doubt. Definitely a chance they see $30 before that happens though", "score": 0, "replies": []}, {"body": "For what it is worth, I like them and own  a  little of their stock.  I do believe electric vehicles are coming on very strong.  Even bought back into Ford yesterday because of their move into electric vehicles.  I am just not sure about these holding companies looking for the next big deal.  The high ups are compensated a little too much for my taste while they are \"looking\".  Plus you may have to wait years for a big payout...  Still learning about them", "score": 1, "replies": []}]}
{"title": "Thoughts on holding vs selling out for 2021?", "selftext": "Not trying to be political, but with the new polices that are trying to be pushed (covid relief, signing the Paris agreement, student loan relief, etc.) does anyone feel like the market will be looking at another crash? I want to hold my investments long term but feel another early 2020 repeating itself. Might be an opportunity to sell out and buy back in at lower costs and wanted thoughts. Not looking for advice just some other opinions.", "id": "l1ng6z", "created_utc": 1611191402.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 27, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I am personally very optimistic for 2021. I think the market is overrun but there’s still a lot of positive catalysts coming. I’d also evaluate your own risk tolerance. Is this money you might need this year? If so then I would take your money out. Is it money your going to have put away for a couple years? Then don’t touch it. It will be fine. A democratic government doesn’t mean a bad economy. There’s a lot of evidence that points to the contrary", "score": 10, "replies": [{"body": "Biden will spend 3 trillion dollars in his first month. He promised the world.", "score": 1, "replies": []}]}, {"body": "don't sell anything, time in the market beats timing the market, but I personally am not buying anything new right now, idk who's buying at these levels but the euphoria is real", "score": 7, "replies": [{"body": "This is contradictory.", "score": 2, "replies": [{"body": "No its not because you can't time the market you could believe it will crash only for it to go up for 2 years, just holding is the best option always unless you know something or are really confident in your position", "score": 1, "replies": [{"body": "Not buying is timing the market...", "score": 3, "replies": [{"body": "I'm not buying because I dont see any good deals at the moment, but selling is actively saying i think the market is going to crash soon", "score": 1, "replies": [{"body": "That's just technicality. You either dont time the market and just buy into index funds, etc monthly or try to time the market by selling/not buying/etc.", "score": 3, "replies": [{"body": "I consider selling a far more bearish move than not buying, because by selling you think your going to get a better price than what yoy bought soon, while not buying is just saying I dont feel comfortable buying something at double the price", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "How many posts can we get everyday?", "score": 3, "replies": []}, {"body": "“Not trying to be political” ... but you failed. \n\nLook at what happened last time a Democratic President took office in middle of an economic crisis and had the backing of his party in both houses of Congress. Six weeks into it proved to be the market’s low point, and an 11-year bull market followed, only interrupted by the second once-in-a-lifetime economic crisis to occur under consecutive Republican presidencies.\n\nTl;dr - stfu and invest in clean energy and chipmakers, and turn off Fox News. They were telling you to be afraid of the “radical liberal agenda” while the national guard was mobilizing 20,000 people to protect democracy from—wait for it—people who watch too much Fox News.", "score": 6, "replies": [{"body": "Preach", "score": 1, "replies": []}, {"body": "But you failed. With your poor comparison. The DJIA saw its worst inaugural performance (since its inception in 1896) with Obama. By contrast, it set a record high today. Owing the stock market’s success to either party’s 4-8yr term is nuts.", "score": 1, "replies": [{"body": "I failed? You saw that I was posting a reply, right? Like to another post? Where he’s doing exactly that? About a specific President, who happens to have a very relevant previous situation he already stepped into without tanking a market, yet he’s all zomg switch to cash, gold, and ammo and hope I survive? \n\nYou’re right that history is very clear about the fact that neither party is “better for the market.” But let’s not pretend not to notice that today is the day that “it’ll just go away like a miracle” finally stops being the centerpiece of our country’s covid response. Don’t give me that both-sides-are-the-same garbage. \n\nAnd wtf is an inaugural performance? Are you talking about the performance of a single day? Lol gtfo.", "score": 0, "replies": []}]}]}, {"body": "There was a post a few months back, pre-election of a guy afraid the market was going to crash if Biden wins.  He went to all cash and lost out on tons of gains.  Even if the market crashed like it did last year it recovered pretty quickly.  Look at sp500, dow, nasdaq charts.  All go up over time.  Don't fight the trend.", "score": 2, "replies": []}, {"body": "Time in the market beats \"timing\" the market, every crash is a buying opportunity, people who bought the 2020 crash made incredible returns, sell now and you will end up buying higher later.", "score": 3, "replies": []}, {"body": "You are dumb af think bidens policies are bad for stocks. There’s a reason your asking for advice on Reddit I guess. \n\nYou forget who was the Vice President that help create the amazing economy that trump inherited and almost destroyed by millions of jobs with his shit handling and polices. Crashes historically have always happen at the hands of a republicans policy.... please know your history", "score": 1, "replies": []}, {"body": "Everything is politics. Especially money and futures. Don't kid yourself.", "score": 1, "replies": []}, {"body": "You gotta time the market right twice by selling before the crash and buying in at the bottom. Just hold and buy the dip you anticipate.", "score": -5, "replies": [{"body": "Good luck with that lol", "score": 4, "replies": []}]}, {"body": "Only thing that could possibly cause a market crash IMO would be a large scale lockdown, and Biden has clarified he intends to leave restrictions to state and local governments, so it's not very likely to happen. \n\nUS based green energy stocks and ETFs are a no-brainer to buy now and hold over the next 4+ years. Tons of predictable catalysts that haven't been priced in yet.", "score": 1, "replies": []}, {"body": "I don’t think any legislation that would cause a significant pullback would happen until 2022. 2021 will be all about the virus.", "score": 1, "replies": []}, {"body": "Yes sell lol", "score": 1, "replies": []}, {"body": "The USD is gonna crash, so stocks might keep going up", "score": 1, "replies": []}]}
{"title": "So who's scared the market has gone up to quick", "selftext": "So it's simple this week the market has gone up alot we are due for a pull back \n\nIf we look at Google for example it's up to 1900\n\nThe s&p500 is breaking new levels and the Nasdaq is also breaking new levels\n\nAmazon tho is finally going up after a long time stuck at the 3100 levels\n\nAnd Microsoft is at a high level with a historical high pe ratio \n\n\nShould we be sacred? \n\nWill a pull back come?", "id": "l1zn5o", "created_utc": 1611239905.0, "score": 2, "upvote_ratio": 0.58, "num_comments": 20, "comments": [{"body": "Probably - but if you’re investing a pullback is just an opportunity to buy more", "score": 9, "replies": [{"body": "Yeah my strategy is to buy quality companys at a good price then do nothing", "score": 2, "replies": [{"body": "Prices are at an all time high right now though. How do you know if it is a good price?", "score": 0, "replies": [{"body": "There are some gems in London stock exchange and there is Berkshire and Starbucks at good prices lots of great opportunitys still here \n\nWalmart is great buy imo", "score": 5, "replies": [{"body": "I thought about buying some starbucks shares just because of how popular it has become and how popular it is with our youth.", "score": 1, "replies": [{"body": "Yeah and great growth from china", "score": 2, "replies": []}]}, {"body": "Which stocks on the lse are you looking at?", "score": 1, "replies": []}]}, {"body": "Personally if you’re a long term investor - things like Apple, MSFT, Amazon - the entry price doesn’t matter as much.\n\nIf you buy today at $100 and in 2 months it’s at $90 - buy the dip, DCA, whatever you want to call it - that entry at $100 in 20 years when it’s $250 won’t make a significant difference in terms of your overall growth.", "score": 2, "replies": []}, {"body": "Look at their fundamental. Stock is a share of the company. Price is just how much people willing to pay for that share of the company.", "score": 1, "replies": []}]}]}]}, {"body": "It’s going to happen but no one knows when. Don’t try to time it. Buckle down and ride it out. Buy more when it dips.", "score": 5, "replies": [{"body": "Yeah buy and hold", "score": 1, "replies": []}]}, {"body": "HOLD STRONG AND BUY THE DIPS", "score": 6, "replies": []}, {"body": "Will be scared when interest rates go up", "score": 2, "replies": [{"body": "Yeah 😂😂😂 2023-2025 probably then when they go up", "score": 2, "replies": []}]}, {"body": "Stock market is almost always breaking new levels, and of course it moves in ups and downs. What you’re talking about is volatility and it’s nothing to be scared of if you understand it.", "score": 2, "replies": [{"body": "Yeah but right now nothing is backing the stock market to go up its going up for no reason and going up to fast", "score": 2, "replies": [{"body": "There are reasons.  And they have been stated on this sub before.", "score": 3, "replies": []}, {"body": "No, there are reasons", "score": 3, "replies": []}]}]}, {"body": "I fell like I'm in a stock car race. A little scared, but petal to the metal non the less.", "score": 1, "replies": []}]}
{"title": "$RECAF -An undervalued OTC that is on the cusp on a major catalyst", "selftext": "Ok so lets get this out of the way, Recon Africa is a oil company... yes yes I hear you clicking away in disgust as you sit in your tesla, but allow me to tell you why Recon Africa has HUGE upside potential. First the company owns the rights to operate in 8.5 million acres of land in NE Namibia and NW Botswana, on the Kavango Basin. Why this is a big deal? Because the basin, according to chief geochemist on the team Dan Jarvie, is estimated to be home to 120 BILLION barrels. At a conservative estimate (.58x NAV) Haywood Capital Markets places a price target at $7/share. This would represent a 233% increase from the current price of $3.\n\nThey started drilling on January 11th and state that they will find out if the basin has deposits in 45 days. That is the catalyst, and yes I know the obvious downside would be that the basin does not have oil which would drive the price to basically zero. But here's a quote from the President and Chief Geoscientist of Earthfield Technology, Bill Cathey, \"No where in the world is there a sedimentary basin this deep that does not produce commercial hydrocarbons\"\n\nor maybe this quote tickles your fancy\n\n“Given the nature of this basin and the tremendous thickness, this is pretty much a no-brainer… it will be productive and I’m expecting high-quality oil.” -Dan Jarvie\n\nEven if oil isn't your thing, which originally its not mine either, this company imo will be criminally undervalued if they find oil (which a high probability) and I can't just stand by and watch as this potential 10 bagger goes unnoticed.\n\nInvestor Presentation-[https://reconafrica.com/wp-content/uploads/ReconAfrica-Investor-Presentation.pdf](https://reconafrica.com/wp-content/uploads/ReconAfrica-Investor-Presentation.pdf)\n\nHaywood Report 1/18/21-[https://clients.haywood.com/uploadfiles/secured\\_reports/RECOJan182021.pdf?inf\\_contact\\_key=b19dbaa7c446441fe385e2b2c42f509d680f8914173f9191b1c0223e68310bb1&fbclid=IwAR3SQSzfAoZq\\_iqNilVdRmmWZ9k8tqVqWY3kkBrFbbMnSp3Sx9HJbrnNx8c](https://clients.haywood.com/uploadfiles/secured_reports/RECOJan182021.pdf?inf_contact_key=b19dbaa7c446441fe385e2b2c42f509d680f8914173f9191b1c0223e68310bb1&fbclid=IwAR3SQSzfAoZq_iqNilVdRmmWZ9k8tqVqWY3kkBrFbbMnSp3Sx9HJbrnNx8c)", "id": "l26wpb", "created_utc": 1611260685.0, "score": 18, "upvote_ratio": 0.88, "num_comments": 20, "comments": [{"body": "It’s a buy the rumor sell the news. Will go up on optimism . Will drop if bad news . A little higher if good news . In my opinion I plan on holding till day before news drops", "score": 1, "replies": [{"body": "\\*salutes captain obvious\\* I plan to hold also but with sell limits, why sell if good news? that's just near sighted", "score": 1, "replies": [{"body": "yeah this is a loooooong hold for me if they hit oil/gas. They have their own rig, optimistic government backing (10% stake), lots of funding, and they have worked with the big oil companies in the past. Oil will come roaring back over the next few years. I plan on scooping up another 500 shares Monday at least", "score": 2, "replies": []}]}, {"body": "Well, there should be some reports on results in a few weeks.   Another play in the oil field in Canada that may benefit from the cancellation of the XL pipeline would be OBELF (Obsidian).", "score": 1, "replies": []}]}, {"body": "oilz is dead", "score": 1, "replies": [{"body": "Oil/ natural gas makes up 80% of the worlds energy supply, by 2040 the IEA estimates oil/ natural gas to still make up 80% of the worlds supply. You may buy an EV but do you know where your energy comes from?", "score": 4, "replies": [{"body": "IEA is probably miscalculating the trend especially the changes that covid brought. Models get it wrong all the time", "score": 1, "replies": [{"body": "Um no, this model was released in October of 2020 and was specifically adjusting for the worlds energy consumption based on Covid. The projection actually stated that world consumption of oil would actually increase by .3% by 2040. \"After recovering from the \"exceptional ferocity\" for the COVID-19 crisis, world oil demand will rise from 97.9 million b/d in 2019 to 104.1 million b/d in 2040.\"\n\n[https://www.spglobal.com/platts/en/market-insights/latest-news/natural-gas/101320-key-oil-market-forecasts-from-the-ieas-2020-world-energy-outlook](https://www.spglobal.com/platts/en/market-insights/latest-news/natural-gas/101320-key-oil-market-forecasts-from-the-ieas-2020-world-energy-outlook)", "score": 1, "replies": [{"body": "there are many shorts on Tesla too up to this day. People also were buying Casino stocks because etc etc. That's bs. The trend is ESG/Eco especially now with Biden. But ok, burn your monies in dying industries.", "score": 1, "replies": [{"body": "I know the future is renewables, but there is some called intrinsic value, and I know oil isn't sexy but right now the price per barrel is about $53, and there is an estimated 120 billion barrels in that basin... just because you may not like it, the world is still gonna be using oil and natural gas for the next 30 years as the majority energy supplier.", "score": 2, "replies": []}, {"body": "Coming back and looking at EEENF this comment didnt age well", "score": 2, "replies": [{"body": "sure if you play the short game and look at charts daily", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "anyone know why this stock isnt on weBull or Robinhood. Must be a scam", "score": 1, "replies": [{"body": "It’s an OTC", "score": 2, "replies": [{"body": "yes, i know so which app is it on? Or OTC are not on apps? I'm so confused, looking everywhere to buy this stock", "score": 1, "replies": [{"body": "I know it’s on E*TRADE, maybe Charles Schwab... look around there’s definitely a post about where it’s traded", "score": 1, "replies": []}, {"body": "You need to get a real brokerage account. Robin Hood and Webull ain't it. I recommend Fidelity.", "score": 1, "replies": [{"body": "Beep. Boop. I'm a robot.\nHere's a copy of \n\n###[Robin Hood](https://snewd.com/ebooks/the-merry-adventures-of-robin-hood/)\n\nWas I a good bot? | [info](https://www.reddit.com/user/Reddit-Book-Bot/) | [More Books](https://old.reddit.com/user/Reddit-Book-Bot/comments/i15x1d/full_list_of_books_and_commands/)", "score": 1, "replies": []}]}]}]}]}, {"body": "You were right. thinking about OBELF, any thoughts?", "score": 1, "replies": [{"body": "Don't know anything about it, will say just to do your research before buying. I did a lot of reading before I got into RECAF. I'm not a oil picker, I just try to find companies with potential. Good luck.", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "l286ra", "created_utc": 1611264339.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 22, "comments": [{"body": ">its been uphill since I've started\n\nNot sure if you know what that phrase means", "score": 18, "replies": [{"body": "By that I meant a bull market", "score": 2, "replies": [{"body": "Usually uphill means struggling", "score": 10, "replies": [{"body": "To be fair, downhill usually means struggling too haha", "score": 4, "replies": [{"body": "“It’s all downhill from here” - someone without struggles", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I've heard it will be 11.04am ???", "score": 8, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "10.59 for me then. Can't let you get ahead of me", "score": 1, "replies": []}]}, {"body": "Thanks will set up a stop loss", "score": 1, "replies": []}]}]}, {"body": "No", "score": 2, "replies": []}, {"body": "No way to predict it.", "score": 2, "replies": []}, {"body": "No, it’s very hard to predict a correction. Just hold good companies and buy the dips and you’ll be fine.", "score": 2, "replies": []}, {"body": "None of of the previous crashes were foreseen. The March sell off occurred bc people THOUGHT it would dip, so it crashed more than it should have.\n\nIn any case it’s best to keep your money in and never sell unless you’re cashing out purposefully (I.e. you need the money).", "score": 2, "replies": []}, {"body": "There is no way to predict it or not. Numerous false positive reports have been made for market crash, which never happens. It will happen at some points (whether it be market crash or corrections), but no body knows because if they know, then it wont happen because they will prepare on it. \n\nYou can look into some indicators such as Treasury 10 years, M2 currency, and employment, but I dont think anyone can truly predict it.\n\nIf anything, it will be artificial intelligence who accumulates all indicators and learn the pattern in pre-market crash or corrections. Some days, we might be able to, but not right now.", "score": 2, "replies": []}, {"body": "Did you happen to read this question or maybe say it out loud to yourself before you hit “send” ? \n\nYour money sounds like it would be better off in a HISA because the minute this market moves in any direction other than green, your shaky hands ( as well as everyone else thinking like you ) will be the reason it goes even faster in that direction. \n\nUnless your investing for a purpose in a year from now, put your money on and stop worrying. \n\nOh .... to answer your question..... no you CANNOT predict the market. If you could ..... market “crashes” wouldn’t be the surprising thing that they are.", "score": 2, "replies": [{"body": "*you’re", "score": 2, "replies": []}, {"body": "Only reason why I would worry about such a thing is because of the options I am holding. If not for that then I would hold and buy the dips.", "score": -4, "replies": [{"body": "Being so new to investing I hope you have a solid understanding of how options work.", "score": 4, "replies": [{"body": "Multiple youtube videos, reading a few books, and learning from my first few attempts is what made me confident enough to trade options so I believe I have a solid understanding.  No better way to learn than by messing up though I think.", "score": -2, "replies": [{"body": "Start small, get your shit pushed in, then play it smart next time.", "score": 1, "replies": [{"body": "Scared money = no money", "score": 0, "replies": []}]}]}]}]}]}, {"body": "No, and even if you could, the next question is whether you would know what to do. Look back around March 13, 2020 on just about any stock. There is a massive dip, including on the ones that in hindsight made absolutely no sense to sell.  Now those stocks are all well above their pre-pandemic highs.", "score": 1, "replies": []}]}
{"title": "Tesla 4th quarter registrations in California jump 63%", "selftext": "[deleted]", "id": "l1svmk", "created_utc": 1611210998.0, "score": 301, "upvote_ratio": 1.0, "num_comments": 29, "comments": [{"body": "[deleted]", "score": 24, "replies": [{"body": "CA went back into  lockdown mode in the 4th qtr, first closing indoor dining then outdoor dining too. No place to eat out means more people using drive through, pick up orders and eat in their cars. Same reason why drive in theaters, which were almost extinct before the lockdown, are now booming.", "score": 9, "replies": [{"body": "How is that related? If people needed a car before lockdown that didn’t change.", "score": 7, "replies": [{"body": "A lot of people are spending more time in their cars and are upgrading.", "score": 3, "replies": [{"body": "Yep. People spending way more time in their vehicles and their homes, and are spending the money they saved from going out, traveling and socializing to trade up their cars and houses.  the latter benefits tesla energy. Tsla is one of the biggest winners of the lockdown, notwithstanding factory shutdown in the early days.", "score": 1, "replies": []}]}]}]}]}, {"body": "**R.I.P.**: \"BuT WhAt AbOuT US GrOwTh & DrOpPiNg CaLiFoRnIa SaLeS?\"", "score": 42, "replies": [{"body": "The shorts will still have carbon credits to keep them warm.", "score": 15, "replies": [{"body": "They car burn those short slips over a barrel fire to stay warm", "score": 3, "replies": []}]}, {"body": "\"It's a busted growth story.\"\n\n/S", "score": 3, "replies": [{"body": "Gordo is one busted nut.", "score": 1, "replies": [{"body": "We're up about 10 'Gordons' on the month 😎👍", "score": 1, "replies": []}]}]}, {"body": "No matter what happens, there will always be some negative story to spin. Tesla sales on the south pole are minuscule!", "score": 2, "replies": []}]}, {"body": "YoY is the most important metric (which is looking good for Tesla too)", "score": 9, "replies": [{"body": "Really? \n\n\n\nWith Tesla headlines like these investors must think that California sales are increasing exponentially. Here's the bigger picture, CA registrations from the last 3 years.\n\n\n\n\n2018 - 70,300 units\n\n\n\n2019 - 72,600 units\n\n\n\n\n2020 - 71,300 units", "score": 2, "replies": [{"body": "What are those numbers?", "score": 1, "replies": [{"body": "California registrations last 3 years. Edited my original reply.", "score": 1, "replies": [{"body": "Those are model 3 sales I think", "score": 1, "replies": [{"body": "Nope, total sales, sorry.\n\n\n\n> At about 11,417, registrations in the state for Tesla’s Model Y compact crossover utility vehicle surpassed those for the Model 3. California registrations for Tesla’s Model 3 mass-market sedan fell 34% on a yearly basis to 7,044.\n\n\n\nHere’s total EV’s for CA:\n\n\n\nhttps://www.veloz.org/wp-content/uploads/2020/11/Q3_2020-2.pdf", "score": 1, "replies": [{"body": "I mean none of that was directly relevant. I believe you though", "score": 0, "replies": []}]}]}]}]}, {"body": "What? Who cares about localized sales? The only thing that matters is global sales. Go ahead and post those....", "score": 1, "replies": []}]}]}, {"body": "*Demand problem*", "score": 10, "replies": [{"body": "Delivery problem.\n\nSolution: Build more factories in different locations to satisfy demand and shorten delivery distance and time.\n\nPlease, let's see if we can get Elon to recognize this! /s", "score": 3, "replies": []}]}, {"body": "But Iraq.... 0 demand gg", "score": 8, "replies": []}, {"body": "So MY YOY is looking good? :-)", "score": 3, "replies": []}, {"body": "That article made a fundamental mistake.  Tesla hit the 500k goal.  That’s rounding to three significant digits.  If one wants to make an accurate statement, Tesla would have had to specify their goal was 500.0k (4 significant digits and they missed by only hitting 499.6k).  Which of course is ludicrous.", "score": 3, "replies": [{"body": "The old dogs are treating a 500k target like a strict EPS report. Lol 449.6k is within margin of error.", "score": 3, "replies": []}]}, {"body": "\nWith Tesla headlines like these investors must think that California sales are increasing exponentially. Here's the bigger picture, CA registrations last 3 years:\n\n\n\n\n2018 - 70,300 units\n\n\n\n2019 - 72,600 units\n\n\n\n2020 - 71,300 units", "score": 3, "replies": []}, {"body": "This is amazing news , largest market for Tesla having such positive growth. This could be one reason for the Euro market not being as strong , why would they ship out vehicles when there domestic market is booming. Once Berlin goes online it will be lights out for the German legacy vehicles.", "score": 2, "replies": []}, {"body": "Thanks Go ev", "score": 2, "replies": []}]}
{"title": "TSLA til the end ‼️", "selftext": "", "id": "l1nnhx", "created_utc": 1611192049.0, "score": 33, "upvote_ratio": 0.86, "num_comments": 27, "comments": [{"body": "So... you bought the high, retard?", "score": 18, "replies": [{"body": "why else would I be on WSB? 📈📈", "score": 30, "replies": []}]}, {"body": "Same. Was up 368% a few weeks ago but I trust in papa Elon. 2/19 $1200C", "score": 10, "replies": [{"body": "This will happen , big news coming", "score": 2, "replies": [{"body": "Better be homie", "score": 1, "replies": []}]}]}, {"body": "My 1/29 1030c feels the same pain lmao.", "score": 4, "replies": [{"body": "Might happen", "score": 2, "replies": []}, {"body": "unless you bought that a long time ago, why tf would u buy so far OTM with so little time?", "score": 1, "replies": [{"body": "Bought it 2 weeks back when Tesla hit $880", "score": 1, "replies": []}]}]}, {"body": "It’s happened to us all. Learn from mistakes and ride this baby out. TESLA TO THE FUCKING MOON BITCH", "score": 3, "replies": []}, {"body": "3/19 1525c TSLA boutta moon million miles", "score": 3, "replies": []}, {"body": "985 call?", "score": 2, "replies": []}, {"body": "My 860c feels your pain too!", "score": 1, "replies": [{"body": "My 1/22 860c feels the same", "score": 3, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "It is. My life is betting on this", "score": 4, "replies": []}]}, {"body": "As do mine...guh", "score": 2, "replies": []}]}]}, {"body": "bro these are gonna be green when the market opens. congrats on your diamond hands", "score": 1, "replies": [{"body": "You're saying 1000 by market open?", "score": 1, "replies": [{"body": "no but i think tesla opens up like 3-4 percent which means these will be up a lot", "score": 1, "replies": []}]}]}, {"body": "I approve", "score": 0, "replies": []}, {"body": "💎🤲", "score": 0, "replies": []}, {"body": "Buy and hold dummies", "score": 0, "replies": []}, {"body": "Ples fly", "score": 1, "replies": []}, {"body": "You’re supposed to sell to lock in profit 🤦🏾", "score": 1, "replies": []}, {"body": "Tesla needs more mentions!!", "score": 1, "replies": []}]}
{"title": "Does Tesla have a never ending supply of good news?", "selftext": "", "id": "l1nvkg", "created_utc": 1611192784.0, "score": 50, "upvote_ratio": 0.9, "num_comments": 21, "comments": [{"body": "Per my car repair shop, parts are incredibly backordered. I miss my tesla but they need to get aftercare sorted. \n\nThe tesla cam did save me thousands when I could prove no fault though. State farm tried to screw me, they didn't know I had video in my backpocket.", "score": 28, "replies": [{"body": "Fuck insurance companies.  They promise the world with their dancing smiling \"families\" on TV, and then fuck you when you actually need them 5 years later.\n\nI really need to get a dash cam stat.", "score": 15, "replies": [{"body": "Just get a tesla", "score": 8, "replies": []}]}]}, {"body": "I think it's time for a secretary of alternative energy and I think we have our guy.", "score": 7, "replies": [{"body": "And he should come from wsb", "score": 6, "replies": []}]}, {"body": "Is buying an $865c 1/22 FD too retarded? please tell me", "score": 5, "replies": [{"body": "Did you buy already? I bought 860c", "score": 7, "replies": [{"body": "Placed the order. Hopefully it gets filled immediately tomorrow haha. Either we print or we get fucked 🚀🚀", "score": 3, "replies": [{"body": "Hope you get filled and immediately gap up and never look back", "score": 1, "replies": []}]}]}, {"body": "I’m thinking run up until earnings then a selloff after earnings regardless of what they report", "score": 3, "replies": []}]}, {"body": "Let’s fucking go", "score": 5, "replies": []}, {"body": "My shares are about to have grandkids. I’m so excited!!!", "score": 4, "replies": []}, {"body": "Let’s fucking go", "score": 4, "replies": []}, {"body": "Let’s fucking go", "score": 2, "replies": [{"body": "$1000 by end of the week!", "score": 8, "replies": []}]}, {"body": "Let’s fuck! Ho!", "score": 2, "replies": []}, {"body": "Let’s  fucking go", "score": 4, "replies": []}, {"body": "It's because people are only reading what they want to hear. There never was much any chance the company would become profitable without exploiting diamond handed weebs.", "score": 0, "replies": []}, {"body": "It’s almost like they have a super charged battery.", "score": -3, "replies": [{"body": "Wat", "score": 1, "replies": []}]}, {"body": "There was a time when they had nothing but bad news and hit pieces about them, they deserve this after being dragged down for so long.", "score": 1, "replies": []}]}
{"title": "Tesla (TSLA) gets first $1,000 price target from top analyst on lead with autonomous vehicles - Electrek", "selftext": "", "id": "l1wq47", "created_utc": 1611228633.0, "score": 52, "upvote_ratio": 0.93, "num_comments": 23, "comments": [{"body": "@Electrek\n\ni, water_boat, declare tsla’s PT of $2000 and i am a self-proclaimed top analyst at a top 4 hedge fund that is currently heavily long on GME.\n\nfeel free to write another article about this", "score": 23, "replies": [{"body": "[Collin](https://imgur.com/rPrWOQZ) has a 74% return rate and is in fact one of the top ones (64% success rate)\n\nI wouldn't post that shit here otherwise.", "score": 9, "replies": [{"body": "[Emmanuel](https://imgur.com/tbcZjiK) on the other hand put a PT exactly where TSLA sits now. But Emmanuel has a +16% average return rate and, like a copper penny, is only right about half the time.\n\nDon't be a Soyboy. Don't be Emmanuel.\n\nBe a Chad. Be Collin.", "score": 6, "replies": []}, {"body": "1% of WSB has a 1000%+ return rate. What's your point? jk", "score": 1, "replies": []}]}, {"body": "Hear, hear! So it is declared", "score": 1, "replies": []}]}, {"body": "who in their right mind has any money left for tesla at this point. a possible 20% upside vs GME right now is just irresponsible", "score": 12, "replies": [{"body": "So what you're saying is that TSLA should split so we can all squeeze a few more dollars in?", "score": 4, "replies": []}]}, {"body": "[Thank You Colin for the additional TSLA Rocket Fuel.](https://imgur.com/rPrWOQZ)", "score": 4, "replies": []}, {"body": "TSLA just got another $1,200 price target from the top WSB analyst", "score": 3, "replies": []}, {"body": "Nobody gives a fuck. We need to focus on GME if we want to win", "score": 2, "replies": []}, {"body": "To be honest, the risk to reward on TSLA vs something like GME looks really dogshit right now. Like reeeally poop.", "score": 1, "replies": [{"body": "Tesla is the future of many industries while gme is just a game to squeeze the shorts.", "score": 2, "replies": [{"body": "I am not talking about the quality of the company. I am talking about risk/reward in terms of gains. But hey, keep buying high and selling low. Good for you.", "score": 4, "replies": [{"body": "Buying high and selling low? I'm up over 400k for the year so far.", "score": 3, "replies": [{"body": "Tell me. What is the risk of TSLA falling in price and what is the potential upside? Thank you.", "score": -1, "replies": [{"body": "ARKs valuation on TSLA for when they reach full autonomy is between $3k and $4400 per share. Risk of Tesla dropping significantly in price is very slim with so much tailwind from Bidens green new deal and positive catalysts incoming this year and next.", "score": -1, "replies": [{"body": "But this is not a conversation about fundamentals. Its a conversation about returns. With a p/e of 1500ish you can imagine that even if everything goes to plan, you cant expect more than 10ish% annualised. Which is not bad. But this drops very sharply if everything does not go to plan. And historically, TSLA has overestimated their ability to deliver many times.\n\nWith a p/s of 0.3ish for GME and regaining profitability, a new promising bussiness model and so on, I will take my bet with GME. Its a pure value play and historically value has outperformed growth over the long run.\n\nSince you seem like a reasonable person I strongly suggest you look into the podcast \"the rational reminder\" where they talk about investing in technological revolutions.\n\nI edited the comment to provide more value.", "score": 4, "replies": [{"body": "Which ep is that?", "score": 1, "replies": [{"body": "Its in the last 10-15 episodes. There are 2 parts. You will know it when you see it.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Some one just be holding heavy bags. Probably the OP and analyst.", "score": 1, "replies": []}, {"body": "Wow, so bold. Wood says $1400.", "score": 1, "replies": []}]}
{"title": "The stock market frenzy feels like 1999 dot-com bubble, global investor Barry Sternlicht warns", "selftext": "", "id": "l20b2u", "created_utc": 1611241997.0, "score": 0, "upvote_ratio": 0.49, "num_comments": 25, "comments": [{"body": "This only means I need to invest more. Fucking retard. I am poor all my life. Losing this what I have doesnt change anything for me.", "score": 32, "replies": []}, {"body": "[deleted]", "score": 23, "replies": [{"body": "Plz explain", "score": 1, "replies": [{"body": "It looks like a bubble until you look at underlying financials...then it looks fine", "score": 20, "replies": []}]}]}, {"body": "Fuck em", "score": 6, "replies": []}, {"body": "🐻🌈 Cry harder pls", "score": 20, "replies": []}, {"body": "unoriginal, next", "score": 7, "replies": []}, {"body": "fuckin boomer, old investing out, new yolo investing meme stocks in. Get used to it buddy.\n\nEdit: every stock ever 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 6, "replies": []}, {"body": "Retarded millennials have entered the game.  Alone we are poor, together we can swing markets.  When will they realize that?", "score": 14, "replies": []}, {"body": "They’ve been saying this for like 3 years now.", "score": 4, "replies": []}, {"body": "I don't speak crooks. BB only goes up  🚀!", "score": 8, "replies": []}, {"body": "Listen here 'kids'.  I sold all my positions in one account to buy GME.", "score": 7, "replies": [{"body": "Just one?", "score": 2, "replies": [{"body": "Man I was looking at my other account (Schwab) when you posted thinking the same thing.  Fuck it I closed all other positions and went long at 39.   No one getting my shares for less than $420 each.", "score": 2, "replies": []}]}]}, {"body": "I’m not gonna listen to a guy whose head looks like my dick", "score": 6, "replies": []}, {"body": "These articles are being published daily. All these fuckers just want to be the next Burry. Of course there’s gonna be a correction. Maybe tomorrow maybe in a year from now. Who fucking knows.", "score": 7, "replies": [{"body": "in the 1920s, it took almost a decade", "score": 2, "replies": []}]}, {"body": "every chode in the investing world has been saying this for the past 6 years", "score": 2, "replies": [{"body": "Biggest fucking mistake. I had 30% in cash trying to wait for an opportunity. It took covid for it to come, and the window was open 2 months.", "score": 1, "replies": [{"body": "I sat around with my dick in my hand because tHe CrASh iS cOMinG and missed out. These dumb ass articles drop every few months and mean nothing", "score": 1, "replies": [{"body": "Deploy 90% of capital, 10% cash. Be ready to quickly reposition. With enough diversity, which is not a term people use here, I think it’s ok to go balls to the walls on equities.", "score": 1, "replies": []}]}]}]}, {"body": "So there’s going to be a sale on leaps?", "score": 1, "replies": []}, {"body": "Im guessing we didnt get behind his spacs.", "score": 1, "replies": []}, {"body": "I remember when I use to blow Bubbles", "score": 1, "replies": []}, {"body": "This guy is stupid, comparing dot-com with retail investment growing.\n\nRetail investment will reshape how markets works, get used to it boomer", "score": 1, "replies": []}]}
{"title": "Where's my $AMZN gang at? To the moon!", "selftext": "", "id": "l20kuu", "created_utc": 1611242866.0, "score": 37, "upvote_ratio": 0.87, "num_comments": 30, "comments": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I'll be okay with a 20. Add a share split and my OTM leaps will jizz", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Oh ya I know. People who own shares and gets a split won't make any difference, but the news will definitely put a psychological pump.", "score": 3, "replies": [{"body": "They just will not do it, I believe they did a split twice in like 1999 IIRC...but never again since.", "score": 1, "replies": [{"body": "They did 3 times? I believe in total it was worth a 18:1 ratio.\n\nWho knows? Its been stagnant around 3k for several months and maybe a 3:1 split can pump and allow more investors to go in. \n\nNo one likes fractional shares", "score": 1, "replies": [{"body": "They did a split 3 times, have done one in the 21st century.   \n\n\nThis is part of the problem with WSB, it's not really good for companies to get pumped to death and massively inflate their share prices, if they do a buyback it's somewhat beneficial for them but things like Tesla will not sustain at those levels.   \n\n\nDon't hold your breath on an amazon split", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Amazon doesn't care lol I'm telling you. They will not split. They've had ample opportunity to do so in the past TWENTY years and have not.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Amzn gang checking in!!", "score": 3, "replies": []}, {"body": "Loaded up 2 days ago! Up 78-88% on my calls already", "score": 3, "replies": [{"body": "Is still 200 short from their ATH. 3500 before earnings, wouldn't be surprise if it hits 3700 or even 4000 post earning", "score": 4, "replies": [{"body": "Exactly, see my comments in the post I made last night if you're interested in my thoughts on this.", "score": 3, "replies": [{"body": "Bought OTM 4/16c after NFLX catalyst. Knew a run up was expected", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "To be fair, 4k+ would be ideal after ER", "score": 3, "replies": []}]}, {"body": "My calls went up to +95% today but went back down to +40% im trying not to paperhand lol Normally i sell right away when i see +50% or more on a call. butt im very bullish on this", "score": 3, "replies": []}, {"body": "I just closed out my 4 shares to load up on GME. But same as you I bought close to the ATH @3345", "score": 2, "replies": [{"body": "Buy calls. Easy money", "score": 3, "replies": []}]}]}]}, {"body": "how the heck can you guys afford this? this is like 165k a pop....", "score": 3, "replies": [{"body": "What?", "score": 2, "replies": [{"body": "if im reading this right u have like 3365c expiring jan 22. thats like 35k each right?", "score": 1, "replies": [{"body": "I'm going to sell the contract, not exercise it.", "score": 1, "replies": [{"body": "yeah but the cost for this is 35k to own the contract.\nso this is like 6digits in amzn contracts?  \npoor plebs like me cant get in on the action right?", "score": 2, "replies": [{"body": "Please don't try to get in on the action until you understand options trading comma which is clear you do not. I'm not trying to be a jerk, but it's clear your understanding how this works is not at all correct. Do a bunch of research, and then give it a crack. Best of luck.", "score": 3, "replies": []}, {"body": "My guy, all these contracts combined are roughly $6,000~ when he first purchased", "score": 1, "replies": [{"body": "yeah that showed the purchase price. i always viewed the last X price so i got confused.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Buy OTM if you have the balls for it. Otherwise ask your wife's BF for more money, or your sugar momma", "score": 1, "replies": []}]}, {"body": "Gang gang 🚀🚀", "score": 2, "replies": []}, {"body": "I wasn't as autistic, but didn't sell when it went to 3330. Diamond handed it to 3305 and sold at 3330. #trAdinGpLan", "score": 1, "replies": []}, {"body": "yah baby !", "score": 1, "replies": []}, {"body": "What's the strategy in spreading it out like this?", "score": 1, "replies": []}, {"body": "I was bag holding my debit spreads since early Jan... finally starting to print.", "score": 1, "replies": []}]}
{"title": "Update. $AMZN Feb 19th $3140 YOLO. Up another 10k", "selftext": "", "id": "l20lrf", "created_utc": 1611242949.0, "score": 20, "upvote_ratio": 0.92, "num_comments": 21, "comments": [{"body": "you're only helping bezos complete world domination", "score": 9, "replies": [{"body": "He deserves to be the richest tendies in the land. Musk can have Mars.", "score": 7, "replies": []}, {"body": "Ok, but we want money too. He can have the world, i just want Lambo", "score": 3, "replies": []}]}, {"body": "Bezos Gang less go.", "score": 5, "replies": []}, {"body": "gotta get Bezos back to richest man in the worldddd", "score": 2, "replies": [{"body": "He's there already. Up by 7 b's", "score": 2, "replies": []}]}, {"body": "Amazon gang letsgoooo 🚀🚀🚀", "score": 2, "replies": []}, {"body": "$AMZN $AMZN? THIS IS 2021 NOT FUCKING 2020 GET IN THE GME AND BB GAME FELLA", "score": -4, "replies": [{"body": "You mad bro?", "score": 3, "replies": [{"body": "Sounds mad. Maybe he sold me the calls.", "score": 5, "replies": []}, {"body": "we are supposed to control the market together brother not show off", "score": -1, "replies": [{"body": "Bring back old WSB. Yolo FD plays during tech earnings.", "score": 3, "replies": [{"body": "YOU MEAN WHEN INSTITUTIONAL INVESTORS DIVIDED AND CONQUERED US?!? NEVER AGAIN", "score": -2, "replies": [{"body": "Jesus dude, chill out.", "score": 1, "replies": [{"body": "$GME $400 EOM $BB $60 EOW simple as", "score": -1, "replies": [{"body": "Those aren't paying my medical bills this week, but you do you boo.", "score": 2, "replies": []}]}]}, {"body": "Either few eat tendies and many starve\n\nOr everyone gets a piece or skips a meal", "score": 1, "replies": []}]}]}]}]}, {"body": "Did you seriously get drunk on 🐒 piss?", "score": 1, "replies": []}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/MarcellusBoom the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I sold 2 days ago for about 3120. Just to buy GME and BB at the top. I hope it rockets hard lol", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I was hoping to get out before. But IV is so slow. Waiting for that to pop to 60", "score": 1, "replies": []}]}]}
{"title": "ViacomCBS (VIAC) - Sleeping Streaming Giant", "selftext": "Gonna keep it simple for the tards\n\n**DD:**\n\nViacomCBS(🚀🚀) is a media & entertainment company. They own **CBS, Showtime, Paramount, Nickelodeon, MTV, Comedy Central, BET, & a few others.** So they own a shit load of content.\n\nTo deliver this content, they have:\n\n*Pluto TV*\n\n* free streaming service that's been growing at a crazy pace. \n* No subscriber revenue, but lots of ad revenue.\n*  Motley fool - \"*While PlutoTV reached $1 million in daily advertising sales in 2019, it has already achieved its first $3 million day this year. Furthermore, ViacomCBS markets its paid products -- CBS All Access and SHOWTIME -- to Pluto customers. Based on rapid subscriber growth on the paid side, that seems to be working well. \"*\n* This service is underrated. It allows companies to generate ad revenue from their old content.\n\n*CBS All Access*\n\n* soon to be rebranded as Paramount+. \n* Main focus of investor day.  \n* Huge catalog with access to live tv and sports.\n* Motley Fool - *\" In Viacom's most recent quarter, it was its streaming business that stood out. Revenues for the segment grew to $636 million year over year, representing 56% growth. Its domestic subscribers jumped to 17.9 million, which prompted CEO Bob Bakish to raise his company's year-end subscriber target for the second straight quarter. \"*\n\n*Showtime*\n\n* This is their premium content service\n\nVIAC is a huge netflix competitor with free content, live TV & sports, and a huuuuge content library of popular titles. \n\n&#x200B;\n\nHere's the kicker. VIAC market cap: 27b. Netflix market cap: 256b.\n\nThere is huge potential here because VIAC is not being treated as a streaming service but rather a content creator like fox or mgm.\n\n**Catalyst:**\n\nInvestor day 2/24\n\nEarnings in February, exact date TBD\n\n**The play:**\n\nANYTHING on or after 3/19/21 45-60c\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n\nEdit: forgot to mention, guess who's hosting the superbowl this year. You guessed it, streaming on CBS. They're also hosting the Masters (golf) if you're into that", "id": "l20tf6", "created_utc": 1611243612.0, "score": 37, "upvote_ratio": 0.83, "num_comments": 28, "comments": [{"body": "Pump and dump", "score": 5, "replies": [{"body": "Check the price homie. Could have made some $$", "score": 6, "replies": [{"body": "Nothing has happened with it yet, got an article on Zacks and thats it, you are impatient.\n\nKinda also overshadowed by Gamestop x6 everyones money", "score": 5, "replies": [{"body": "Not sure what you mean. It's gone up 30% since I posted", "score": 5, "replies": []}]}]}, {"body": "dang you caught me", "score": 3, "replies": []}, {"body": "Weekly reminder, up $30 since I posted. The pump is going great, yet to dump my shares and calls though", "score": 1, "replies": []}]}, {"body": "It’s not sleeping. Viacom has been doing streaming for months already and only just decided to merge their different services together. It’s also an archaic as fuck company that doesn’t innovate whatsoever. I’d play FUBO or something else for streaming, but Viacom is a fuckin dinosaur", "score": 9, "replies": [{"body": "Check the price, up $18 since I posted DD", "score": 3, "replies": []}, {"body": "You're right, but they are hitting the tipping point. They are restructuring and shedding depreciating assets, paying down debts, and their streaming service now has some name recognition. You're right that they're dinosaurs, but shit is changing. This is similar to BB, they were dog shit at some point but they've started to pivot successfully.\n\n&#x200B;\n\nAlso look at their 30 to 90 day chart. I sure as shit wish I got in 3 months ago. This has been on a constant uptrend", "score": 5, "replies": []}, {"body": "Up $30 since posting. Don't say you weren't told", "score": 1, "replies": [{"body": "That's pretty much a flat out lie. Yes it's up, but it isn't \"up $30 since posting\" by any means. You posted at 10:40am Jan 27th. It opened on Jan 27th at $52.27 and at 10:40am it was at $56.03.     \n   \nSo yes it's up by about $15, but not the $30 you're trying to claim.", "score": 1, "replies": [{"body": "I bought in at 42 so my brain goes to that. You're right though, I'm trippin. Still, it's up almost $20 since posting", "score": 1, "replies": []}]}]}, {"body": "That’s just not true, you are not paying attention pal it’s ok.", "score": 0, "replies": []}]}, {"body": "Pics of positions or get the fuck out", "score": 5, "replies": []}, {"body": "This DD 2 months ago and I’d be impressed.  Trend is already too far in into action", "score": 2, "replies": [{"body": "I'd love to have seen this 2 months ago too lol. But plenty more upside, look at their ATH. Also as mentioned, major catalyst coming in feb.", "score": 2, "replies": [{"body": "After downside\nThen I’ll take the upside", "score": 1, "replies": []}]}, {"body": "Lol I posted 2 months ago an everyone screamed at me for not being long GME...", "score": 1, "replies": []}]}, {"body": "This is making AH moves big time 55 end of week", "score": 2, "replies": [{"body": "Definitely. I didn't realize it, but it's also kind of a short squeeze candidate. With all short squeeze articles, this may catch some attention with it's 20% short float", "score": 2, "replies": [{"body": "It’s gonna get squeezed on 2-24 after streaming investor day\n\nToday is just the start", "score": 2, "replies": []}]}]}, {"body": "Do you mean wait until 19th of March 2021 to buy in? Thanks", "score": -2, "replies": [{"body": "Investor day is on 2/24, get contracts dated after that", "score": 3, "replies": []}, {"body": "He’s talking about options. It’s a different way to trade. I’d read up on it before trying it yourself. The appeal is “infinite potential gains” with the only risk being what you pay up front.", "score": 2, "replies": []}, {"body": "He was talking about buying calls with an expiration on or after 3/19. You don't need to leave this place lol\n\nAlso, like the other commenter said. Look into options before trying them. Watch some videos explaining how they are done and the the risk/reward is. Good luck!", "score": 2, "replies": []}]}, {"body": "Ty good sir 👍", "score": 1, "replies": []}]}
{"title": "Apple price target upgraded to $152 by Morgan Stanley, ''Investors aren’t optimistic enough about Apple Inc.’s upcoming earnings report'' 🚀🚀🚀", "selftext": "[deleted]", "id": "l22hct", "created_utc": 1611248392.0, "score": 55, "upvote_ratio": 0.95, "num_comments": 20, "comments": [{"body": "2/5 140c reporting 🚀🚀🚀🚀", "score": 16, "replies": [{"body": "Same", "score": 2, "replies": []}]}, {"body": "Not only are they going to have great earnings from their iPhones, but their new Apple-designed M1 chip is getting rave reviews everywhere and suddenly Macs are super popular again. As a result I not only have a position in APPL, but also in TSM who manufactures all their chips and is the largest contract chip manufacturer in the world. They are bound to get a big bump from Apple's earnings announcement and recent news that Intel is also to subcontract some of their designs to them to manufacture. 🚀🚀🚀🚀🚀🚀🚀 on both!", "score": 6, "replies": [{"body": "\nIf I had any spare cash I would go into TSM right now!!! They also manufacture AMD chips too 😭 either way APPL will pave the way", "score": 2, "replies": []}]}, {"body": "140 1/22 do or die time", "score": 5, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "what are your positions?", "score": 0, "replies": []}]}, {"body": "133c for 2/26", "score": 3, "replies": [{"body": "Are you fucked yet?", "score": 1, "replies": [{"body": "Huh? \n\nI'm up over $300", "score": 1, "replies": []}]}]}, {"body": "My 145 Leaps are getting exited.", "score": 2, "replies": []}, {"body": "$130 29Jan calls checking in and seeing good returns so far. I'm going to purchase a weekly call on Monday to hopefully catch a spike like Netflix after earnings.", "score": 2, "replies": []}, {"body": "Morgan Stanley already bought in bro, why would I listen to someone who got in before I did?", "score": 1, "replies": [{"body": "Because I'm confident the stock hasn't priced in the upcoming earnings yet", "score": 1, "replies": [{"body": "Okay well it's never a bad idea to buy apple so you're gonna be fine", "score": 1, "replies": []}]}]}, {"body": "GME", "score": -7, "replies": []}, {"body": "When is earnings", "score": 1, "replies": [{"body": "Next Wednesday I believe", "score": 4, "replies": [{"body": "Yup", "score": 3, "replies": []}]}, {"body": "27 Jan", "score": 1, "replies": []}]}, {"body": "Been thinking about picking up a couple of Feb calls.", "score": 1, "replies": []}]}
{"title": "$TSLA bounce coming", "selftext": "", "id": "l278vl", "created_utc": 1611261674.0, "score": 16, "upvote_ratio": 0.79, "num_comments": 23, "comments": [{"body": "Buy GME, got it.", "score": 14, "replies": []}, {"body": "Some of y’all reading charts like a bum telling a fortune in his dip cup.", "score": 3, "replies": [{"body": "This works way better https://www.allure.com/story/how-to-read-tea-leaves-tasseography", "score": 1, "replies": []}]}, {"body": "What does that mean", "score": 3, "replies": [{"body": "Someone threw crayons at a chart and predicted it was either going to go up or down", "score": 9, "replies": [{"body": "Bingo", "score": 1, "replies": []}]}, {"body": "Ya lol bounce up or bounce down", "score": 1, "replies": [{"body": "fr", "score": 1, "replies": []}, {"body": "Thanks I’m dumb", "score": 0, "replies": [{"body": "But probably go up. Been trading flat for a lil", "score": 2, "replies": []}, {"body": "No I'm w your question idk what the fuck he means I'm retarded", "score": 2, "replies": []}]}]}]}, {"body": "Tesla will hit 900 through sheer will.", "score": 2, "replies": []}, {"body": "Prep for blastoff", "score": 1, "replies": []}, {"body": "The fuck am I looking at?", "score": 1, "replies": [{"body": "Flag Day 🚩", "score": 0, "replies": [{"body": "No, I mean that I can see the MA lines for 50 and 200, but there’s no explanation as to why a bounce is coming or what that really means", "score": 3, "replies": [{"body": "About is coming because Tesla has not gone up for a while and it's time to go up again hop on the elevator boys", "score": 3, "replies": []}]}]}]}, {"body": "The fuck does this mean", "score": 0, "replies": [{"body": "It means STONKY GO UPPY. What a maroon.", "score": 1, "replies": [{"body": "Your mom thinks im smrt", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "From Long Island", "score": 2, "replies": []}]}]}]}]}, {"body": "yes but the bounce will occur next week. tsla about to moon", "score": 0, "replies": []}, {"body": "Probably we will have a big rally for the Q4 this  Wednesday", "score": 1, "replies": []}]}
{"title": "To whoever did the DD on INTC a little while ago- thank you 💎🤲🚀", "selftext": "", "id": "l27u11", "created_utc": 1611263321.0, "score": 51, "upvote_ratio": 0.88, "num_comments": 20, "comments": [{"body": "[deleted]", "score": 18, "replies": [{"body": "Needs 80% in BB then do whatever", "score": 11, "replies": []}]}, {"body": "INTC  💎 BOOMER  🙌🏻", "score": 8, "replies": []}, {"body": "You don’t have enough $ to be this diversified tbh", "score": 6, "replies": []}, {"body": "Schwab gang 🤟🤟", "score": 4, "replies": [{"body": "Is that the mobile app on ios? It looks a little different on android (also couldn't have taken this screenshot on Android).", "score": 2, "replies": [{"body": "Yeah my IOS mobile app looks exactly like this", "score": 2, "replies": []}]}]}, {"body": "Sold a CC for $52.5....never did I think it would go up so quickly.\n\nLesson learned. :(", "score": 2, "replies": [{"body": "They had an earnings. It's was on news stops all over if ya research. Maybe next bud, there's 🚀💲 everywhere", "score": 1, "replies": [{"body": "I sold the initial CC for Dec expiry...rolled it forward to Jan hoping for a drop so I could buy to close....\n\nOh well...small profit.", "score": 1, "replies": []}]}]}, {"body": "Contemplating between INTC and AMD for next week  earnings.", "score": 1, "replies": [{"body": "You know INTC earnings was today, right?", "score": 6, "replies": [{"body": "you know we are retarded", "score": 6, "replies": [{"body": "It's ok, just BBBY $30c 02/05/2021 and you'll be good.", "score": 2, "replies": []}]}]}, {"body": "Ohhh AMD looks good. \n\nAny reason why I shouldn't cash my spy LEAP and buy multiple ATM options on AMD?", "score": 1, "replies": [{"body": "For real tho, it’s so cheap currently. Can someone explain to me why amd is so Acheson currently?", "score": 1, "replies": []}]}]}, {"body": "Boomer diversification", "score": 1, "replies": []}, {"body": "Cool stocks bro", "score": 1, "replies": []}, {"body": "Scroll, scroll, scroll, ah.. GME...., scroll, scroll, scroll", "score": 1, "replies": []}]}
{"title": "Change in leadership. Get on the Intel train. Choo Choo.", "selftext": "", "id": "l281qy", "created_utc": 1611263943.0, "score": 3, "upvote_ratio": 0.55, "num_comments": 20, "comments": [{"body": "Nope. My money (if I had any left after GME) is on AMD. The new CEO came from VMWare and has a guy who works with their products on a daily basis.... I wouldn't touch anything Vmware related with a 10' pole. \n\nYou also didn't put any rockets. Big no no around here.", "score": 21, "replies": [{"body": "That is true. I did drop the ball with the lack of rockets. \n\nHow can we merely be excited about trains when we could have rockets.\n\nMy bad. As far as Intel. \n\nAMD was a great play 8 years ago.... I still love her but i'm not going to add positioning at this point. \n\nNow we're in 2021* and Intel will carry me to salvation.", "score": -2, "replies": []}]}, {"body": "I’m sorry I misunderstood... where are the rockets?", "score": 7, "replies": [{"body": "The Rockets are in GME, go get them.", "score": 3, "replies": []}]}, {"body": "LOL this aged well. Choo Choo to hell", "score": 4, "replies": [{"body": "It's cause you didn't buy! You're the one to blame.\n\nAlso lets not over react here... It will be up tomorrow. Revenue beat expectations by a considerable margin.", "score": 0, "replies": []}]}, {"body": "My AMD threadripper says nah.", "score": 6, "replies": [{"body": "OK boomer. It's 2021. AMD is so 5 years ago.", "score": -4, "replies": [{"body": "Ha. A boomer could not build this future-proof setup.  This thing time travels.  previous builds were all intel. AMD has taken the lead.", "score": 6, "replies": [{"body": "Taken the lead in terms of what? Revenue? Gross profits?\n\nNot even close. \n\nI own AMD and Intel. I will soon be integrating a semiconductor right into my brain. You'll see. You'll all see.", "score": 0, "replies": [{"body": "Haven't look at Financials of either. Lead in technology.  Ha nice, ok - I won't argue with a cyborg", "score": 3, "replies": []}]}]}]}]}, {"body": "AMD is better", "score": 4, "replies": [{"body": "They are both my mistresses and will carry me into the future on a chariot of semiconductors.", "score": 2, "replies": []}]}, {"body": "I personally wouldn't bet against AMD. They owned CES. Intel's new high performance processor they're working on seems promising though.", "score": 3, "replies": [{"body": "I expect earnings to be good. Looking right now.", "score": 2, "replies": [{"body": "Yes intel earnings already came out.", "score": 4, "replies": [{"body": "\"came out\" literally 5 minutes before I posted that....", "score": 2, "replies": []}]}]}]}, {"body": "Intel just signaled the victory for AMD. See you at the moon bud #AMDgang", "score": 2, "replies": []}, {"body": "Don't say I didn't tell you. \n\nhttps://www.marketwatch.com/story/intel-11611263160", "score": 1, "replies": []}, {"body": "leadership wont matter if they're stuck on 14nm for 1 more year. they should have been on 7nm years ago. TSMC is printing money with 5 right now.", "score": 1, "replies": []}]}
{"title": "CSIQ still chronically undervalued", "selftext": "Okay if you look through all the companies individually in these clean energy etfs most are in a bubble . No profits or earnings and/or a p/e multiple in the thousands. Canadian solar has a P/E ratio of under 20 and beat the last earnings report estimates by 160 percent .\n\nThey are getting massive contracts, recently a 330 MW (125 000 homes) project in California including battery storage and also have the catalyst of listing in china. You are getting canadian Chinese big brain 🧠 management while being headquartered in Ontario Canada and subject to their accounting audits . \n\nAnother catalyst is a listing in China. Yes that’s right a company headquartered in Canada raising money in China. This will give it a larger share of its manufacturing division. Q2 2021 estimate for ipo in China. \n\nA goal of this company is vertical integration and with a 75 percent ownership of their manufacturing arm in China and tier 1 solar panel quality (considered investable by institutions) profit margins will be much higher than competitors. \n\nThey have a pipeline of 16, 000 mw diversified across the world and project sales to double by 2024. Very heavy presence in North America which means big boost from Biden incoming .", "id": "l28foo", "created_utc": 1611265049.0, "score": 24, "upvote_ratio": 0.81, "num_comments": 25, "comments": [{"body": "Already up 180% in the last year. Think they still have lots of room to grow?", "score": 10, "replies": [{"body": "Yep compare the earnings and P/E ratio to sun power. They are doubling their sales by 2024 with increasing margins and we should see pe expansion for solar companies in the meantime . 120 dollar price target conservatively in a years time .", "score": 5, "replies": []}]}, {"body": "Hey I love CSIQ. It’s my second largest play next to GME. 💎🙌🏻 baby!", "score": 8, "replies": []}, {"body": "I think this is very interesting. Lots of Canadian companies in WSB right now. But, no **🚀🚀🚀** so how can I trust this DD?", "score": 6, "replies": [{"body": "It gets the advantage of canadian branding but the management is mostly Chinese . Think of Alibaba levels of profit and growth but with canadian branding 🚀 🚀 🚀 🚀 🌝", "score": 2, "replies": []}]}, {"body": "As always a post on a company that's up 10+% today. Where was this yesterday numbnuts? Gimme a ticker that's going up 10%+ tomorrow", "score": 8, "replies": []}, {"body": "I bought 120 shares of CSIQ today before I saw your DD... man I am I glad to see at least one other autist doing the same thing. I spent about 10 minutes researching this and I feel really good about it, 🚀🚀🚀🚀🚀🚀 for sure (also still holding my GME, in Cohen we trust, \\*obligatory statement)", "score": 3, "replies": [{"body": "I got into baba at rock bottom when everyone was scared and got gme at 12 dollars a share  so you’re in 💎 🤚🏽 company.", "score": 4, "replies": []}]}, {"body": "Positions? Are you just holding shares are do you have calls as well", "score": 4, "replies": []}, {"body": "Good stock OP. While I think CSIQ has more room to go up and is one of the better solar picks now, you can't just compare P/E across industry like that. \n\nSPWR and CSIQ are good stocks IMO but there's a reason that one has a p/e of 100 and one has a p/e of 15. Companies that develop tech are priced differently than companies that just manufacture solar panels because they have way higher margins.", "score": 5, "replies": []}, {"body": "Just saw that there is a lot of interest going on around this stock and decided to make a subreddit - [https://www.reddit.com/r/CSIQ/](https://www.reddit.com/r/CSIQ/), feel free to join.", "score": 3, "replies": []}, {"body": "Do you think I’d be too late to get in on this? Looks like a great stock.", "score": 2, "replies": [{"body": "Not too late until\nThe p/e reaches 35 -40", "score": 1, "replies": [{"body": "Thanks for the reply!", "score": 1, "replies": []}]}]}, {"body": "Shut up please I'm still loading calls! Come here in a month please 😜", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "If I can make money on something who cares . Tesla and Apple make a ton of money in China ....and most of Amazon is Chinese made goods.", "score": 3, "replies": []}]}, {"body": "Position?", "score": 1, "replies": [{"body": "Jul 75 dollar\nJan 22 80 dollar \n 500 shares", "score": 5, "replies": [{"body": "Cool, I will check it out.  GL", "score": 2, "replies": []}]}]}, {"body": "When is the Q4 2020 earnings report out for CSIQ?\n\n&#x200B;\n\nOn websites it says 24th march. my question is HOW CAN Q42020 come out this late??\n\n&#x200B;\n\nSomeone please help.\n\n&#x200B;\n\nI have 400 commons in CSIQ.", "score": 1, "replies": []}, {"body": "Buying the dip as we speak! Great opportunity to get in.\n\nAlmost sounds too good to be true ?!?!", "score": 1, "replies": []}]}
{"title": "Loaded up on Intel puts expiring tommrow🌈🚀", "selftext": "**Heres my big brain autistic DD**\n\nLast two earnings calls (Q3/Q4 of 2020) Intel tanked the next day even though they beat their forecasted EPS. The last one (10/22) they drilled 13.5%  on the 23rd. \n\nSaw them up nearly 8% before the closing bell....Sooooo why not YOLo OTM puts expiring tommrow amiright? If this sophisticated investing subreddit taught me anything its never doubt your vibe. If your wrong fuck it MM are the ones responsible.\n\n\n\n*Positions:*\n\n**1/22 $61p**\n\n**1/22 $60.5p**\n\n~~~~~~~~~~~~~~~~~~~~\n\n**Update: to the doubters, thats how you make a quick flip. Doubled what I threw in, never doubt your vibe.**", "id": "l28iza", "created_utc": 1611265310.0, "score": 31, "upvote_ratio": 0.84, "num_comments": 24, "comments": [{"body": "I too bought 57.5 puts expiring tomorrow at .60 x 10\nI am screwed.", "score": 11, "replies": [{"body": "Checked my TA tools & did the math:\n\nThe price Intel needs to be for you to breakeven is $57.39 *(will fluctuate depending on volatility)* RH currently list $INTC at $59.40 after falling 5% after-hours.\n\nIf intel opens at $59.40 you'd only need the stock to dip 3% to breakeven. You profit $1000 if the stock falls 5.7% to the price of $56.00\n\nHonestly your not totally fucked, still in a position to at the least breakeven and if things get exciting could walk away with some tendies.", "score": 3, "replies": [{"body": "Thanks for the math, in a similar situation! I threw in right at end of day and thought all hope was lost 30 seconds after I sent it", "score": 2, "replies": []}]}]}, {"body": "I wish I did this with ibm lol", "score": 6, "replies": []}, {"body": "Ballsy.", "score": 7, "replies": []}, {"body": "It depends.\n\nShare pride pullback is a common phenomenon following earnings release, because the “rumor” has often already been bought and sold. Share price climbs in anticipation, and then sell offs (to lock in profit) just before earnings release cause a dip in the price.\n\nBecause of this, earnings releases are often priced into the option premium. But always a chance they aren’t, or that the price swing is greater than the value priced in.", "score": 3, "replies": []}, {"body": "You do realize that the full impact of AMD fucking intel in the ass won’t show until Q2.21? But whatever. GO YOLO!", "score": 3, "replies": []}, {"body": "Same boat balls deep\nEdit: positions - \n72 × 01/22 $57 put", "score": 2, "replies": []}, {"body": "I like this call Godspeed retard just read an article about intel hitting June highs so pullback could be coming", "score": 2, "replies": []}, {"body": "Absolutely fucking based. Good job. Hope the IV doesn't crush you too hard.", "score": 2, "replies": []}, {"body": "Came to check back in on this and cheers you on your way to trendy town", "score": 2, "replies": [{"body": "Thanks boss 😎", "score": 1, "replies": []}]}, {"body": "NICE", "score": 2, "replies": []}, {"body": "New CEO announced. Care for the 🌈🐻trap.", "score": 2, "replies": [{"body": "Sounds like intel is having issues to me, why else change the CEO of the company. Plus that news was already priced in.", "score": 6, "replies": [{"body": "Intel is having issues. But this is old news. Changing the CEO is literally one of the cures. I think Intel might move strongly in either direction. \n\n(A) They come out and announce a breakthrough in their manufacturing woes or they announce a partnership with $TSM + outsourcing their own foundry. 🚀🚀🚀  \n(B) They do neither of the above. 🔻🔻🔻", "score": 2, "replies": [{"body": "I thought they already announced (A)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Idk dude if my company was killing it and its future growth looks really promising I wouldn't change the head of the company. Changes like that are more often when things aren't doing so good or the company's growth is pretty unclear.\n\n Just saying all the good looks for intel where soaked up and priced with that 7-8% green candle before closing today. (Loaded puts at that peak before bell)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Thanks dog. Won't know for sure until tommrow but the 'after-hours' do look promising. Be interesting if this spontaneous play actually pays off.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/LaMouth the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "F", "score": 0, "replies": []}, {"body": "Didn’t the earnings release early like before the bell that’s why it spiked?", "score": 1, "replies": []}]}
{"title": "So much for \"sell the news\" $INTC 😭", "selftext": "[removed]", "id": "l295n6", "created_utc": 1611267174.0, "score": 7, "upvote_ratio": 0.74, "num_comments": 20, "comments": [{"body": "Welcome home, brother", "score": 3, "replies": [{"body": "Thank you 🥴", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I think I'll do that. Thanks fellow retard.", "score": 1, "replies": []}]}, {"body": "I mean they beat and it still experienced a little selloff. You should consider yourself lucky", "score": 2, "replies": [{"body": "Eh I guess but a little selloff doesn't mean anything for my puts expiring worthless 😅", "score": 1, "replies": [{"body": "What’s the strike? You should be able to sell at open to avoid a total loss unless it’s way OTM", "score": 2, "replies": [{"body": "Maybe depending on how much it drops. Strike 57, and breakeven is 56.37.", "score": 1, "replies": []}]}]}]}, {"body": "You might be lucky it's dropping fast.", "score": 2, "replies": [{"body": "Well I'll be damned, it's below 60. Maybe there is a chance if it continues down in the morning. I am visualizing the tendies... 👏👏👏", "score": 2, "replies": [{"body": "Haha now you know why they say diamond hands. I sold my GOEV puts early at 15c when I could've sold them at 50c later in the day. There is a reason why you bought those intel puts and there was a reason why I bought those GOEV puts.", "score": 1, "replies": [{"body": "A-men dude. Don't doubt your vibe. Im gonna ride them until expiry most likely.", "score": 1, "replies": []}]}]}, {"body": "That would be reeeeeeally lucky. I'm trying not to check every 2 minutes.", "score": 1, "replies": []}]}, {"body": "I’m on the same boat brother. It’s gonna drop hard tomorrow.", "score": 2, "replies": [{"body": "Looks like we just might get lucky 🤜🤛", "score": 2, "replies": []}, {"body": "Let's fkin hope brother 🙏", "score": 1, "replies": []}]}, {"body": "Boohoo. 7,500 -> 750 -> 10,000 \n\nIts called GAMESTOP 😂", "score": 2, "replies": [{"body": "Pat yourself on the back. 🤜🤛 Good job. 👍", "score": 2, "replies": []}]}, {"body": "Past performance is not an indicator of future outcome", "score": 2, "replies": []}, {"body": "I'm holding long on INTC, but your on here so I hopes it drops for you than skyrockets for the next year. New Ceo who has massive incentives to  boost stock price.", "score": 2, "replies": [{"body": "Thanks buddy. But I wholeheartedly believe Intel aint got shit but hype and history. Maybe in a year or two.", "score": 2, "replies": []}]}]}
