{"title": "[deleted by user]", "selftext": "[removed]", "id": "11omuwb", "created_utc": 1678548363.0, "score": 39, "upvote_ratio": 0.77, "num_comments": 70, "comments": [{"body": "Circle tweeted that $3.3b of their ~$40b of reserves were at SVB. USDC is now trading at $0.92. Seemingly the market has written off that $3.3b entirely, which doesn't really make sense, since Circle should be getting most of it back as SVB's assets are liquidated.\n\nAnother problem could be that it's the weekend and Circle doesn't have access to most of its reserves till Monday.", "score": 26, "replies": [{"body": "They will probably get at least most of it back. However, I don't think trading at $0.92 is wrong even if that's the case.  The bigger issue here is that this calls into question the whole point of even having stable coins? Clearly, even when backed by cash, they lack the stability of government fiat.", "score": 10, "replies": [{"body": "Sure, stablecoins suck as an asset, but the price has more to do with beliefs about whether Circle will be able to resume redemptions on Monday. If they're able to process redemptions, it can stay at $1 even as the market cap goes down.", "score": 3, "replies": []}]}, {"body": "A question I have, I see this statement about companies should get most back when SVB is liquidated…but didn’t this all start due to the realization they don’t have everyone’s money anymore…\n\nso is liquidating what they have left enough to pay everyone back in full?", "score": 4, "replies": [{"body": "No bank can give everyone's money back if everyone asked for it today. Not even JPMC/Citi/Wells Fargo/BoA. That's just not how modern banking works, it's 'fractional reserve'.", "score": 4, "replies": [{"body": "And they removed the reserve part at the beginning of Covid. They literally dropped the reserve requirement to zero.", "score": 2, "replies": [{"body": "In a strictly mathematical sense I guess 0/x where x is anything except 0 is technically fractional lol.", "score": 1, "replies": []}]}, {"body": "I know that. That’s not my question", "score": 2, "replies": [{"body": "Once the FDIC comes in they’ll run the bank liquidation process. They’ll either find a buyer or sell the loans to other banks who’ll buy them. Therefore recovering the deposits. \n\nThe reason SVB ran into trouble is mounting losses (especially incurred in the bond market) dwindling reserves due to cash burn by their depositors, and apparently risky loans meant people lost cash confidence. By the time the bank tried to raise money it was too late and only sparked more fear. \n\nAnyway, most of the money is probably there tied up in loans it’s just that the bank wasn’t able to raise funding fast enough to not get taken over by the FDIC which is the banking version of bankruptcy.", "score": 2, "replies": [{"body": "Thanks! That makes sense", "score": 1, "replies": []}, {"body": "Another thing that contributed was SVB had a lot of deposits from startups. Since venture capital funding is way down, those startups had to withdraw their cash to stay operational.", "score": 1, "replies": []}]}]}]}]}, {"body": "Circle isn’t solvent and is going to blame it all on banks as an affinity scam thing", "score": 8, "replies": [{"body": "Source?", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "#best source.", "score": 2, "replies": []}]}]}]}]}, {"body": "Then they'd best keep trading of USDC halted until they are able to prove they can recover those reserves.\n\nI think a bigger problem is that people will want to redeem USDC for USD mass scale due to the collapse of trust (and especially if USDC remains depegged for an extended period of time), which would then put a **lot** of pressure on Circle.", "score": 2, "replies": []}, {"body": "It will regain its peg when the banks open on Monday I hope , svb will likely just be absorbed by another bank. Svb was solvent by the way", "score": -5, "replies": [{"body": "Were they solvent if you mark their bonds to market? I thought they only looked solvent because they had HTM bonds (bonds they planned to hold to maturity) which they didn't need to mark to market.", "score": 6, "replies": [{"body": "Maybe solvent, but not liquid, which is a pretty serious issue if you are a bank.", "score": 8, "replies": []}]}]}]}, {"body": "What are the implications of this depegging? Is it not an isolated event?", "score": 10, "replies": [{"body": "Not when almost every stablecoin has depegged?", "score": 5, "replies": []}]}, {"body": "Why would the fed/government step in? If you invest in crypto shit, you deal with the consequences of crypto shit\n\nThese “stablecoins” sure do seem have a problem staying stable", "score": 19, "replies": [{"body": "Tell me you don't understand crypto without saying you don't understand crypto 🤣", "score": -22, "replies": [{"body": "The stablecoins creators don’t seem to get it either if they keep on being volatile\n\nCrypto people love how decentralized it is until something goes wrong and want the government to bail them out. Riskier bets are risky and not a guarantee, and it’s not the government’s or Fed’s job to step in because a speculative asset went to shit", "score": 8, "replies": [{"body": "What crypto people are calling for a bailout though lol just because a centralized stable coin unpegs doesn't mean shit for \"crypto\" decentralization.", "score": 5, "replies": [{"body": "Did you read OP’s post? “Does this force the Fed’s hand?”\n\nWhy do you think scams, schemes, and market failures are endemic to the crypto space? It is a consequence of decentralization and lack of regulation.", "score": 1, "replies": [{"body": "I'd say it's just human nature. Fraud and scams happen everyday in every market it's not only crypto. \n\nI would read forcing the feds hand as stopping rate hikes. Not bailing anyone out.", "score": 1, "replies": [{"body": "Fraud happens in every market sure, but it certainly seems to be very common in crypto\n\nNot hiking rates to save crypto? Lmao\n\nCreating moral hazard, especially in the crypto market, is the last thing the Fed wants to do. \n\nStuff like this is a feature of rate hikes. It “cleanses” our financial system from low quality assets. This shows the rate hikes are working, not that it’s time to stop. Crypto is a low interest rate phenomenon, and it’s not the Fed’s job to prop it up, whether through bailouts or stopping rate hikes", "score": 1, "replies": [{"body": "Again, fraud and scams happen in all markets and are common. Financial institutions have a long history of fraud. You can find replicas of any major brand you want to, they're very common. It means nothing that there are also frauds and scams in the crypto space other than there are people out there willing to lie for possible financial gain. \n\nNobody was saying this, it was just a question OP posed about whether or not the fed would take into account things happening in the crypto space. I don't read that as him hoping the fed could or even would do anything to \"save crypto\". Crypto will be fine regardless of if the issues of the stable coins have the reserves to back up the asset they have been selling. \n\nCrypto really began when interest rates were around 5%. I wouldn't correlate it to low interest rates in any way even though 5% is historically somewhat low. Coins like BTC and eth have nothing to do with interest rates other than institutions holding them may react and sell in a panic but that won't change the protocols or staking/mining that are happening. Interest rates aren't even apart of the formula. If a few stable coins issued by companies fail that's on the companies and the tokens they issued, not crypto.", "score": 1, "replies": []}]}]}]}]}, {"body": "So you know who the stable coin creators are right? Hedge funds, are taking your money and not actually buying the underlying securities. patience boomer", "score": -2, "replies": [{"body": "Who the creators are is irrelevant. \n\nOutsized gains cannot be achieved without outsized risk. If you invest in very speculative assets (which crypto is), you have to deal with the consequences of your risk. \n\nThe Fed’s job is to maintain market functionality. Speculative, risky assets sometimes going to shit is a feature of functional markets, not a bug\n\nThe government isn’t liable for people’s bad decisions making", "score": 5, "replies": []}]}]}]}]}, {"body": "Why is this in r/stocks?", "score": 13, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "So report it lol", "score": 1, "replies": []}]}]}, {"body": "Mods are asleep.", "score": 11, "replies": []}, {"body": "You'll see why on Monday", "score": 4, "replies": [{"body": "What did I miss? It’s back at $1", "score": 1, "replies": []}]}, {"body": "I’m curious as well. But USDC is issued by Coinbase + circle. So it should have implications for at least COIN price on Monday for sure. Still questionable .", "score": 2, "replies": []}]}, {"body": "Some start ups who probably needed to go out of business anyways will get wiped out quicker. This isn’t as big an issue as some people think it’s going to be.", "score": 2, "replies": []}, {"body": "The reality is that the cryptocurrency market is so small and mostly filled with fraud and unregulated securities that even if it were to collapse completely it wouldn’t have a lot of effect on the rest of the financial markets. And it would be a net benefit to society as a whole given how much fraud and theft there is. \n\nThe second/third largest exchange in that market collapsed, FTX, and literally nothing happened with the wider financial markets. \n\nThat’s how tiny and insignificant cryptocurrency is to the rest of the world.", "score": 4, "replies": []}, {"body": "The Fed could give a fuck about some scam crypto bullshit. Y’all are getting what you deserve for betting on something any sane person told y’all was a scam. Reap what you sow.", "score": -13, "replies": [{"body": "Stupid doesn't know HF are invested into usdc and could go under. In this world, nothing is isolated. If a Chinese farmer farts you will smell it in NYC at some point.\nSo spare us your ignorance and stay in your little dream. Safes everyone tons of time.\n\nI don't think this event is big enough to cause havoc because in the end it is \"just\" a 10% depeg. Probay not enough to liquidate anyone big. But usdc is a $40b asset and if losses occur, someone has to pay aka liquidate real-world assets. Ever thought about what happens if circle has to liquidate their holdings to cover a bank run on usdc redemption? If you have the ability and time to read, you will understand that usdc is like a savings account without time locking of funds. Anyone can at any point in time redeem usdc for $. If $ are scarce, assets need to be liquidated.\nThis is one thing where usdc is fully backed by dollar. The other scenario is where usdc is not fully backed (happening right now). At least the market presumes its not fully backed anymore because 3billy or so are momentarily lost. This means the last bite the hounds like the saying goes and a bank run will leave the last ones holding the bag aka write offs. And if those are not small investors but big entities, one HF going down may be the first domino to fall. Think about citadel just for real this time.\n\nI don't think this is going to happen because if enough people redeem 1 usdc for $0.9 real dollar the losses are limited and the peg will crawl back to $1 slowly. But ofc one never knows....market psychology can ruin everything.", "score": 10, "replies": [{"body": "This is the intelligent discourse I was hoping for. Thankyou", "score": 4, "replies": []}]}, {"body": "I think you have a misunderstanding as to what USDC is. It’s basically just a digital dollar backed by real dollars. The failure here was an American bank, not crypto. The money backing it is not available over the weekend now that the bank failed. USDC will regain their peg as soon as their funds are released/covered. A bigger bank will step in next week.", "score": 11, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "It’s almost like they’re taking a page right out of WallStreet’s playbook with stocks!", "score": 3, "replies": [{"body": "That's their target market ;) lol", "score": 1, "replies": [{"body": "Indeeeed", "score": 2, "replies": []}]}]}]}, {"body": "I though it being pegged to the dollar was debunked long ago.", "score": -7, "replies": [{"body": "Im pretty sure its tether that was the fishy thing.  This is more serious", "score": 6, "replies": []}, {"body": "My understanding was that they've survived a lot of scrutiny, so I assumed that against all odds (and to my disbelief) it is indeed somehow tethered to usd.", "score": 1, "replies": []}]}, {"body": ">It’s basically just a digital dollar backed by real dollars.\n\nWhat's the purpose of that?  We can just use dollars.", "score": -1, "replies": [{"body": "But dollars have a paper trail and are harder to commit crimes with", "score": -1, "replies": [{"body": "It's actually easier to trace digital currency because every transaction is recorded in the Blockchain forever. So not even that. Cash is almost impossible to follow.", "score": 3, "replies": [{"body": "Easier in small quantities. \n\nBut when you try to deposit a large amount at a bank, they’re gonna ask questions because of anti-money laundering laws. That doesn’t happen if you just convert your crypto to a “stable” coin that is tied (in theory) to the dollar.", "score": 0, "replies": []}]}]}, {"body": "It allows traders to convert profits and keep them on the blockchain instead of cashing out through banks every time. Faster, less processes.", "score": 1, "replies": []}, {"body": "You can move them instantly to anywhere in the world. Much more difficult to do that with a bank and more expensive. Banks are also closed on the weekends while the Ethereum network that these are on is running 24/7.", "score": 1, "replies": []}]}, {"body": "It’s not basically that at all!", "score": -2, "replies": []}]}, {"body": "\"y'all\".  1st off Im not invested at all in crypto. 2nd id love to know how ur port looks from way up there lookin down on folks. Anyway im Just wondering the repercussions of the SVB fallout. That usdc is directly related.", "score": -2, "replies": [{"body": "It’s actually y’all as it is the contraction of you and all.", "score": 3, "replies": [{"body": "I know what it is.  I was curious who you were talking to.  Cause its not me", "score": 1, "replies": []}]}]}, {"body": "There are others who say banks are a scam, and crypto is a scam... USD is backed by nothing, USDC is backed by USD lmao. Let's not wish others misfortune ignorant one.", "score": 1, "replies": []}]}, {"body": "Why would anyone want to buy a digital dollar that has the same value of a physical dollar?", "score": -1, "replies": [{"body": "Stablecoins just allow traders to convert profits to dollars (a representation of dollars) which saves them time and effort than going through banks (banks are not crypto friendly). \n\nSome people like using stablecoins to earn interest on their deposits, which is basically the same as a savings account but with higher yield and more risk. (risk aka what's happening right now)", "score": 3, "replies": []}, {"body": "For ease of use in the crypto. Once you have a stablecoin it’s easy to send it around, stake it (earn interest) trade it for BTC or another token, etc.\n\nStablecoins make crypto trading a lot easier. Also one can buy a stablecoin and store it in their crypto wallet. Something you can’t do with USD.\n\nOverall, stablecoins allow for a blockchain asset to have all crypto properties with the fixed dollar price.\n\nIt’s pretty useful when it doesn’t depeg 🤣", "score": 2, "replies": []}]}, {"body": "Hmm... another stable coin depegging? Its almost like the Fed is preparing the way for their Central Bank Digital Currencies...", "score": 1, "replies": []}, {"body": "So when banks all go tits up on Monday and they try to divide everybody’s money by zero (because that’s how much they actually have), the whole system is gonna glitch out.", "score": 1, "replies": []}]}
{"title": "RECESSION?!?!", "selftext": "What’s up my fellow degenerates? With all this news about SVB coming out, I’m thinking we’ve finally seen a catalyst that we haven’t seen in a long time. I’m personally cool with a recession, because it’s just my neighbor losing his job. What I’m concerned with is a depression, because I’ve heard that it would be me losing my job!", "id": "11o54wu", "created_utc": 1678492852.0, "score": 54, "upvote_ratio": 0.79, "num_comments": 61, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|2 years ago\n**Total Comments**|189|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "We've been in a recession since 2020, but it got muddied because of the mass amount of money that was printed and handed out. Now all that money is drying up for the commoners, only the wealthy still have savings. History repeats itself, and this summer will bring with it the worst economic times that many have ever seen. Exciting time to be alive boys and girls.", "score": 54, "replies": [{"body": "Exactly.", "score": 3, "replies": []}, {"body": "May you live in interesting times", "score": 5, "replies": []}]}, {"body": "Yeah but things aren't Russian nukes in the air bad...", "score": 11, "replies": [{"body": "Fair but you could say that always right ? \n\nCongrats on that bombshell of a mindset though 👍", "score": 1, "replies": []}]}, {"body": "I don't have to tell you things are bad. Everybody knows things are bad. It's a depression. Everybody's out of work or scared of losing their job. The dollar buys a nickel's worth, banks are going bust, shopkeepers keep a gun under the counter. Punks are running wild in the street and there's nobody anywhere who seems to know what to do, and there's no end to it. We know the air is unfit to breathe and our food is unfit to eat, and we sit watching our TVs while some local newscaster tells us that today we had fifteen homicides and sixty-three violent crimes, as if that's the way it's supposed to be. We know things are bad - worse than bad. They're crazy. It's like everything everywhere is going crazy, so we don't go out anymore. We sit in the house, and slowly the world we are living in is getting smaller, and all we say is, 'Please, at least leave us alone in our living rooms. Let me have my toaster and my TV and my steel-belted radials and I won't say anything. Just leave us alone.' Well, I'm not gonna leave you alone. I want you to get mad! I don't want you to protest. I don't want you to riot - I don't want you to write to your congressman because I wouldn't know what to tell you to write. I don't know what to do about the depression and the inflation and the Russians and the crime in the street. All I know is that first you've got to get mad. You've got to say, 'I'm a HUMAN BEING, God damn it! My life has VALUE!'", "score": 55, "replies": [{"body": "You good bro?", "score": 47, "replies": [{"body": "He’s not looking too good \n\nhttps://youtu.be/mBMS_6DGYwk", "score": 25, "replies": [{"body": "Haha", "score": 9, "replies": []}, {"body": "This made me uncomfortable", "score": 2, "replies": []}]}, {"body": "I think he meant the other meaning of depression", "score": 5, "replies": []}]}, {"body": "Everything around me is still hiring and begging for workers, one of my coworkers just took off for a competitor that will pay him 115k to work one week on one week off, so 6 months off a year. This is the kind of hob you just need experience in and a high-school diploma.  \n\nThis is how the enter key works.", "score": 17, "replies": [{"body": "What kind of job is that?", "score": 6, "replies": [{"body": "It ain’t working behind the Wendy’s dumpster, I can tell you that.", "score": 15, "replies": [{"body": "The W.D. has actually a fairly reasonable arrangement of health, life and dental insurance plans.", "score": 2, "replies": []}]}, {"body": "Running a cement batch plant for a mine site near us.  You do have to get MSHA, but they do that for you after getting hired, so no real big deal.", "score": 6, "replies": []}]}]}, {"body": "i’m mad as hell and i’m not gonna take it anymore!", "score": 6, "replies": []}, {"body": "I’m as mad as hell and I’m not gonna take it anymore!!!", "score": 4, "replies": []}, {"body": "Get out of your house and take a walk dude. Stop watching so much news and go outside.", "score": 5, "replies": [{"body": "It's a quote from the critically acclaimed film *Network* (1976).", "score": 9, "replies": []}, {"body": "This is a complete quote, from I don’t know where but it’s in this song which OP didn’t credit:\n\nhttps://youtu.be/CmFJerrGv-g", "score": 5, "replies": [{"body": "Ha, thanks for the context", "score": 3, "replies": []}]}]}, {"body": "I think you need to go to r/collapse.", "score": 5, "replies": []}, {"body": "https://youtu.be/CmFJerrGv-g?t=02m04s\n\nCredit this OP", "score": 0, "replies": [{"body": "Should be crediting the film that song is reusing material from: *Network* (1976).", "score": 6, "replies": []}]}]}, {"body": "We’ve been in a recession. This is the beginning of a depression", "score": 32, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 8, "replies": []}, {"body": "For a recession everything's been pretty chill. If we've been in a recession then it ain't so bad. I'm thinking the recession starts now.", "score": 15, "replies": [{"body": "It's called a mehcession", "score": 7, "replies": []}]}, {"body": "What comes after a depression?  famine?  Extinction?", "score": 9, "replies": [{"body": "If you find a reason to live (love is mine), you’ll do everything in your power to exist. \n\nYou don’t have to die friend", "score": 4, "replies": [{"body": "Gayyyyyyyyyyyyyyyyyyyyyyy", "score": 45, "replies": [{"body": "🤣🤣\n\nTake my upvote and get outta here you son of a bitch", "score": 9, "replies": []}, {"body": "😂 gotta love WSB", "score": 2, "replies": []}]}, {"body": "\"Love is mine\" ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)", "score": 7, "replies": []}, {"body": "Username checks out", "score": 1, "replies": []}]}, {"body": "WAR", "score": 2, "replies": []}]}]}, {"body": "Don't worry, the US is trying hard to go to with Mexico to keep a depression from occurring", "score": 10, "replies": []}, {"body": "Depression is fine with me. Your money will be worth more.", "score": 3, "replies": []}, {"body": "I take Prozac when I am depressed, but what should I take when I am recessed?", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Is this an antirecessant?", "score": 1, "replies": []}]}]}, {"body": "we have been in a recession", "score": 2, "replies": []}, {"body": "It’s like people saying the time to buy is when there is blood in the street not understanding it will be their blood", "score": 2, "replies": []}, {"body": ">You're right, a depression would be much worse for everyone involved. However, I'm not too worried about it happening. The economy is strong and the market is still doing well overall. So while there may be some bumps in the road ahead, I think we'll avoid anything too major. Thanks for your question!", "score": 1, "replies": [{"body": "Oh you stupid stupid", "score": 6, "replies": [{"body": "I feel like someone broke the bot.  It sounds like Cramer now instead of inverse cramer", "score": 4, "replies": [{"body": "Earlier he was saying SVB was a good company", "score": 3, "replies": []}]}]}]}, {"body": "If u have money, u don’t need a job. Duh", "score": 1, "replies": []}, {"body": "Michael Burry will allow it", "score": 1, "replies": []}, {"body": "Lost 20k trading growth stocks and options since 2020 but still hold a small fortune and dollar cost averaging every week. I will never stop investing it’s a means to a better way of life. I have no fear only love", "score": 1, "replies": [{"body": "Gave me goofbumps", "score": 3, "replies": [{"body": "What is a goof?", "score": 1, "replies": []}]}]}, {"body": "Just wait till you see the Monday rally for literally no reason", "score": 1, "replies": []}, {"body": ">I’m personally cool with a recession, because it’s just my neighbor losing his job\n\nas a gentleman's fluffer I guess you'll be gainfully employed", "score": 1, "replies": []}, {"body": "Depression is the right term", "score": 1, "replies": []}]}
{"title": "So basically, any bank holding long-term low yielding bonds can be at risk to go kaboom?", "selftext": "From what I've gathered of the SVB bank is that they got fucked from holding long duration bonds that didn't roll over fast enough that we're low yielding because of intrest rates at the time then Jerome Powell raises that shit fast af and now all that losses some of its value. Then, because of that, people pulled their money out  way faster than they could ever get paid back or sell their bonds for because they got devalued.\n\nQuestion is what banks that we all use on this reddit have that problem also? If they have enough treasuries in 3m, 6m, 1y, 2y duration bonds, they should be fine, but if most capital is tied up in 5y, 10y then arnt they at risk?", "id": "11ohv7f", "created_utc": 1678534166.0, "score": 92, "upvote_ratio": 0.9, "num_comments": 70, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|39|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Any bank run would kaboom any bank.\n\nSivb just slowly had to realize losses due to outflow of deposits and when it communicated these losses, it failed its communication miserably. Not to mention the VC guys calling for panic.", "score": 68, "replies": [{"body": "When all your customers are basically the same handful of guys with groupthink, this is going to happen.", "score": 18, "replies": []}, {"body": "hOw DiD tHiS hAppEn tHE CeO sAiD sTaY CaLm?", "score": 3, "replies": []}]}, {"body": "asset liability mismatch is the key. a bank having a big mismatch is most likely to go under.\nit starts from poor risk management practices. and lack of corporate governance.\na prudent bank would have kept the mismatch to the minimum and took small losses by adjusting the maturity of their bond portfolio. a bank with poor corporate governance and less than adequate risk management would have sat over the htm losses.", "score": 11, "replies": [{"body": "Yes this is absolutely it.  A bank I work for did this months ago with securities to get ahead of it.", "score": 2, "replies": []}]}, {"body": "Imo svb bank run was caused by pussy ass peter thiel. He's the one who told everyone to cash out and caused panic. Same shit that CZ did to Bankman (except sbf actually did commit fraud). If it wasn't for thiel, svb would've been fine.", "score": 41, "replies": [{"body": "Peter Thiel is a ghoul of the highest calibre but I don't think anyone has an obligation to keep their money inside a failing institution. The real problem is that all the money in the Bank is so highly correlated that some VC dipshit can empty your coffers", "score": 14, "replies": []}, {"body": "Thiel is better not shorting the stock. If yes, hope he goes to jail for creating this and putting thousands out of work", "score": 14, "replies": []}, {"body": "it's not Peter Thiel's job to make sure SVB stays solvent. It's SVBs job.\n\nIf SVB had better risk management (ie not lending to no credit startups, not investing in 10 year bonds when they were literally at their lowest point in history) this would never have happened.\n\n&#x200B;\n\nEdit: Peter's job is to do right by his firm, and his partners, which he did a very good job at.", "score": 3, "replies": []}, {"body": "Peter Thiel is looking smart right now.", "score": -1, "replies": []}]}, {"body": "I think SVB was very concentrated in companies with huge cash burns ex. high growth tech startups. Most banks are much more diversified, so a bank run is much more unlikely.\n\nAlso, they may have been the biggest banking beneficiary of the covid bubble.", "score": 30, "replies": [{"body": "The issue is that it is a lot easierbto have a bank run when your deposits are concentrated in very few customers. Most major banks serve many people and not just a small set of businesses, they will be fine.", "score": 10, "replies": []}, {"body": "This.", "score": 5, "replies": []}, {"body": ">Also, they may have been the biggest banking beneficiary of the covid bubble.\n\nThe biggest macro goal of the feds is to get that \\~$3tril covid stimulus money out of circulation and drive unemployment to \\~4%. Mission accomplished.", "score": 6, "replies": []}, {"body": "They have $200B in deposits!  And most start ups are funded by big companies and banks with a lot of cash.", "score": 1, "replies": []}]}, {"body": "I bet FDIC employees are pulling some sweet, sweet OT this weekend", "score": 9, "replies": [{"body": "hopefully their payroll isnt done through ripple", "score": 16, "replies": []}]}, {"body": "No, the main reason is that svb customer base is skittish af and they overreacted. Banks are supposed to hold long duration assets.", "score": 4, "replies": [{"body": "Maybe don't do that in the fastest rising rate environment in recent memory?", "score": 2, "replies": [{"body": "Again, all banks do this, they just are able to manage it better than svb did. Svb didn’t even have a chief risk officer until 2022. Inept management team.", "score": 2, "replies": [{"body": "I'm not sure what you mean by \"manage it better\". How are you supposed to be managing long duration assets right now other than to have sold it long ago?", "score": 1, "replies": [{"body": "Last I read they bought $80 billion in 10 year bonds around a year and a half ago. So they bought bonds yielding like .25%, at the same time that the government was money printing $5 trillion in stimulus money. \n\n1) you'd have to be a dumbass to not think there would be at least SOME inflation. Super basic economics, not sure why everyone has acted so shocked by this. Print money, it's worth less. Econ 101\n\n2) when inflation is too high, tightening the supply of money is the way to stop it. How do you do this? Almost exclusively by raising interest rates.\n\n3) what do rising rates do to bonds? They wipe out their value. A bond that was worth $100 with a .25% coupon is now worth let's say $85, because today I could buy a bond with a 4% coupon.\n\nThey held tons of money in bonds that all had the same duration. They managed risk terribly. They could have managed it better by not being fucking idiots. Would you put 75% of money into 10 or 20 year treasuries right now if they were yielding .25%? Would you do it if you owed potentially all of that money to other people? Probably not, because there is always the chance rates go up, which would wipe out your investments value. Congratulations, you're smarter than everyone in the c-suite of what was formerly the 16th largest bank in the country.", "score": 2, "replies": [{"body": "So don't go long duration in 2020-2021, like I said. Somebody above keeps writing about that's what all banks do.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Someone fucked up is the short answer.", "score": 19, "replies": [{"body": "Isn't that usually the answer?", "score": 2, "replies": []}]}, {"body": "Personally, I believe the issue is that banks no longer had to hold 10% of all deposits in cash. That limit was removed. It was okay when they were practically getting money for next to nothing from the fed central bank. Once the fed started raising rates, the jig was up. Now they are forced to go back to depositors to get capital. That’s why we are seeing CD rates at close to 5%. Another problem is that banks will buy T-bills and other bonds. With rising interest rates, their existing bonds liquid values are getting hammered in the open market because new bonds have much higher interest rates. This is why you’re seeing money markets at close to 4%. They need capital to buy more long term bonds. In short, many banks are probably suffering liquidity issues. This is just the first one that had to make it known.\n\nPS… given enough time, these banks existing bonds would mature and be worth full face value. It’s just a huge problem in the now.", "score": 5, "replies": []}, {"body": "Regional banks are in danger cuz they are more exposed to commercial property.  Like SVB it would be a  sector- specific crisis", "score": 5, "replies": []}, {"body": "Startup founders yelling fire in a crowded theatre and creating mass panic all trying to withdraw their deposits probably didn't help the situation...", "score": 3, "replies": []}, {"body": "Can someone explain why they were so leveraged on hold-to-maturity investments? The banks customers are mostly venture capitalists correct? And they most likely need to withdraw frequently to fund various projects..... So why did SVB place so much of that money where it's not easily obtainable?", "score": 3, "replies": []}, {"body": "Risk management at SiVB should have known better.  The Feds did not raise rates over night, their rate hikes have been a well communicated long process.\n\nSiVB wants to gamble and loss, now they pay the consequences, this should apply to every single banks who did not manage their risk in a rising rate environment.", "score": 3, "replies": []}, {"body": "Well if their asset duration doesn't match their liability duration, then the banks sitting on a lot of low yielding long term bonds is in trouble", "score": 4, "replies": [{"body": "All banks have duration mismatch. It’s literally the business model.", "score": 5, "replies": [{"body": "The duration of their assets should be somewhat dependent on the duration and risk of their liabilities, no?", "score": 1, "replies": []}]}]}, {"body": "When will the Netflix docu series come out?", "score": 2, "replies": []}, {"body": "You’re missing a step. Raising fed interest rates in and of itself wasn’t the problem that triggered the run. SVB needed capital because they have a client base of VC backed customers that are in a cash burn stage and weren’t raising as much money to replace the burn so the SVBs deposit base was decreasing. SVB had stupidly put too many reserves in the long term bonds. Because of the mark to market bond losses they instead tried to issue stock, but then everyone got spooked and the run was on.", "score": 2, "replies": []}, {"body": "When you have a fractional banking system any bank is at risk.", "score": 5, "replies": [{"body": "That doesn't sound correct. I thought that the primal bank can print new money to bail out other normal banks?", "score": -2, "replies": []}]}, {"body": "The capital buffers at the big banks are 5 fold bigger than they were in 2008. SVB was a unique case, with a unique customer base, where a influential person (Peter Thiel) decided to start a bank run on.", "score": 2, "replies": []}, {"body": "It's a special situation.\n\nGo read a Wall Street Journal article.", "score": 0, "replies": [{"body": "You mean bezos’ corp propoganda paper?\n\nRight lmao ![img](emote|t5_2th52|4271)", "score": -2, "replies": [{"body": "You’re thinking of the Washington Post.", "score": 7, "replies": [{"body": "yh you are right im regarded why are people upvoting me", "score": 5, "replies": [{"body": "blind leading the blind?", "score": 2, "replies": []}]}]}]}]}, {"body": ">There is always risk when investing in any type of security, but I believe that if a bank has a diversified portfolio across different sectors and maturity dates, they should be able to weather most storms. That being said, no one can predict the future with 100% accuracy, so there is always some element of risk involved.", "score": 0, "replies": []}, {"body": "Apparently there might be allot of them", "score": 1, "replies": []}, {"body": "Yes! Mortgage-backed securities strike again", "score": 0, "replies": []}, {"body": "The answer is yes but the bank you put your money in isn’t going to go down because of it. They pay some team of nerds 500k a year each to do the basic arithmetic to see if they’re screwed when interest rates rise and withdrawals increase. It’s not complicated to model or hedge relative to other risks. SVB was likely a mix of incompetence and greed", "score": 1, "replies": [{"body": "You do realize that incompetence and greed are the two most common traits on earth right?", "score": 0, "replies": [{"body": "That’s why I’m here", "score": 2, "replies": []}]}]}, {"body": "You are correct", "score": 0, "replies": []}, {"body": " Anna should not be public. SVB would have been fine if it wasn’t.", "score": 0, "replies": []}, {"body": "This has 2008 GFC vibes all over it", "score": 0, "replies": []}, {"body": "Relax.  Most solid banks with a temporary liquidity problem would issue newer bonds at a more attractive rate.  All banks make money based on fee income, so rising rates benefit the banking industry as a whole.  Since rates were so low, mortgage defaults will be minimal unless we have massive unemployment for a long period of time. In other words, your money should be safe a long as you stay away from subprime lenders.", "score": 1, "replies": []}, {"body": "Only if they talk about it. The raise that svb did amd the pr surrounding it caused a bank run.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "Short squeeze your competition. Pop", "score": 1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": [{"body": "Pop", "score": 1, "replies": []}]}]}, {"body": "it was an attack on the bank", "score": 1, "replies": []}, {"body": "What other banks are like svb?", "score": 1, "replies": []}, {"body": "DPST puts.", "score": 1, "replies": []}, {"body": "This story aged like milk - you can run but you can't hide, tech bros!\n\n[https://www.wired.com/story/tech-layoffs-are-feeding-a-new-startup-surge/](https://www.wired.com/story/tech-layoffs-are-feeding-a-new-startup-surge/)", "score": 1, "replies": []}, {"body": "Only if an “organized” run on it occurs", "score": 1, "replies": []}, {"body": "SVB tied up too much cash in treasuries that were impossible to get out of without taking a hit due to the rate hikes. When customers asked for cash they kept having to sell at a loss. \n\nWhy a bank would buy so many treasuries after a gigantic money printer explosion is beyond me. It must be that the VC tech circle really did believe that people were going to want to stay at home forever even after COVID, even though people were so bad at staying at home that the COVID was spreading around like a wildfire.", "score": 1, "replies": []}, {"body": "Not necessarily, SIVB was in a unique situation where both their liabilities and assets were extremely sensitive to interest rates. February deposits being much lower than anticipated and putting them in a liquidity crunch forced them to sell their assets for a loss, but if that never happened they could have held their bonds to maturity and collected their yield. If your entire banking clientele is startups who don’t actually generate cash flow and need a low interest rate to survive AND youre holding long term bonds you end AND you completely fuck up your messaging towards your current clients then yes you will be at risk of going kaput.", "score": 1, "replies": []}, {"body": "If forced to liquidate to have cash for operations then yes. If they have enough reserves they may not need to go kaboom.", "score": 1, "replies": []}, {"body": "Money printer go brrrrrr", "score": 1, "replies": []}]}
