{"title": "Backtesting options strategies is pointless and dangerous. Change my mind.", "selftext": "**FINAL EDIT**: My point here is that backtests like what I described are worthless. Right now retail traders are being pushed to backtests like what I wrote as awesome and useful and worth learning by people who profit from the material. I wanted to convince people that was not true and they shouldn't use them or they could find themselves in a dangerous situation based on a flawed methodology. Somehow that turned into _me_ not knowing how to do backtesting correctly, instead of me warning people against these kinds of backtests, because I know what the difference is. Which is unfortunate and really distracted from what I was trying to get across. If you have professional tools where these objections do not apply, then by all means ignore this, but 99% of what is sold to beginners **is not that**.\n\n**EDIT**: This mostly applies to trading options directly without an opinion on the movement of the underlying (a.k.a more delta neutral), not using options as leverage for a stock strategy. \n\nI took 6 months off of options trading and spent some time in automated real-time crypto algos which was... interesting. Real-time algo strategies are more viable there than in the traditional financial markets at a retail level, but I don't trust the space long term and its crowed already. Since I've been gone the market changed _a lot_, so I am coming back with my algos and wanted to revisit a point from a [previous post](https://www.reddit.com/r/options/comments/72met5/there_is_no_edge_in_selling_premium_discuss/) that is all the more important with the return of volatility and really needs to be hammered home to these folks coming from stocks: Backtesting _options_ is for suckers and you shouldn't do it or trust anything anyone says based on a \"study\" from 2008-Date.\n\n**Backtesting makes assumptions about fills that are unrealistic**: If you're new to options from stocks you may have noticed that the spread is suddenly a thing now. Almost every stock has penny fills but individual options can have huge spreads of $0.05-$0.25 and higher. You have to make an _assumption_ about what it would trade for and while estimating the midpoint on a $0.01 stock spread is fine, estimating the midpoint on a $0.25 option spread is wildly inaccurate. You can't assume the worst case (no algo will have a positive return with that). You can't get around it by only trading ATM because you'll eat the spread when you close it OTM/ITM. Very liquid options will help because you can use the last trade, but there are far fewer of those than you think.\n\nThe spread is a source of _error_ (called 'slippage'). Errors are bad. Error from a couple equity trades every month and $0.01 spreads is going to be minimal no matter how far back you test. Errors from a strategy involving $0.25 spreads with 2-4 options in every trade ($1 spreads!), adjustments, rolling, possibly hundreds of times over 7-8 years; the cumulative effect of those errors makes the range of results  (or the average result which is what you see) nearly useless.\n\n**Backtest parameters don't mean what you think**: There are only so many options, so you will never find an exact fit for a parameter. If your strategy calls for 40 delta options you might end up with 35.27 or 45.16 delta options. If you want 'one strike away' that could be $1 or $0.50, or 0.5% or 0.1%, who knows? This causes 'error' where your actual trades differ in unexpected (and unpredictable) ways. Errors are bad and cumulative.\n\n**Leverage is all over the place in practice**: This applies mostly to naked or cash-secured short options, but these always have a concept of buying-power reduction where you have to set aside some portion of your balance as uninvestible even though its not in the trade. When backtesting you will find that BPR can change, which changes the amount of capital you can actually trade. If I sell a cash-secured put on a $10 stock and that stock doubles to $20 I have a nice profitable trade and my backtest starts out great. But the next put I sell will require twice the BPR, which means I can sell fewer puts than I did before and my leverage goes down. We expect the results to go up and down during a test (that's the test) so if there is another thing going up and down (leverage) in ways that it might not again then it introduces error when we go to apply the test in the future. \n\nThese reasons are mostly based on backtesting in thoery, but I want to add one more objection based on the reality of the market today. **Why do you think a strategy tested from 2008-2017 would be at all relevant now?** Have you looked at a chart lately? Read a paper? IV is a 'fear gauge' and fear is irrational, but IV is what drives option prices. Do you think the reaction to fear in the market (and consequently how the IV responds to moves in the underlying) is the same today as it was during a 10-year bull market with as recently as 6 months ago was the lowest IVs ever recorded? Have you controlled for the increasingly correlated returns of individual stocks and the SPX due to index ETFs? Several funds trading the VIX (based on IV) product literally collapsed a few months ago from a relatively normal move in the market where they were fine before. Algorithmic hedge funds are struggling where they were great before. \n\nAll the evidence I see is saying that the options market is way different now than it was in the past even to professionals, so why should we be talking about backtests? Are there things we _can_ learn from backtesting, even if we can't learn from simple \"is it profitable\" questions?\n\n\n", "id": "8aztyz", "created_utc": 1523291834.0, "score": 29, "upvote_ratio": 0.78, "num_comments": 61, "comments": [{"body": "[deleted]", "score": 20, "replies": [{"body": "EDIT: never mind I made an edit to the post. Sorry for the confusion. I wasn't implying that _you_ could not accurately backtest, just that the backtests being sold to beginners suffer from what I wrote and are dangerous and pointless. I assumed that most people here were more retail traders and I applied that to you by assuming you were using a sophisticated argument for why the midpoint was ok to use, but in fact you were arguing there are  other ways of doing it that don't use an explicit spread-based assumption, which is fair and good and I wish more people published backtests like that.", "score": 2, "replies": [{"body": "Correct, most software and products aimed at retail are trash.  It's unfortunate but it's true", "score": 1, "replies": []}]}, {"body": "^(Hi, I'm a bot for linking direct images of albums with only 1 image)\n\n**https://i.imgur.com/sVOKZfv.png**\n\n^^[Source](https://github.com/AUTplayed/imguralbumbot) ^^| ^^[Why?](https://github.com/AUTplayed/imguralbumbot/blob/master/README.md) ^^| ^^[Creator](https://np.reddit.com/user/AUTplayed/) ^^| ^^[ignoreme](https://np.reddit.com/message/compose/?to=imguralbumbot&subject=ignoreme&message=ignoreme) ^^| ^^[deletthis](https://np.reddit.com/message/compose/?to=imguralbumbot&subject=delet%20this&message=delet%20this%20dx2v9ir) ", "score": 2, "replies": []}, {"body": "Aw, you deleted your comment. :-( I'm putting it here because I think it adds to the discussion about how realistic them midpoint it.\n\n> You can't predict option fill price, implied volatility isn't constant so you can't predict an option price with a closed form solution, make assumptions that are realistic. Your execution (getting filled or not) will be related to your order aggressiveness (being (ask+bid)/2 neutral and anything above that an agressive order, generally speaking)\n\nI think we are disagreeing on the ability to make realistic assumptions on the fill price in backtesting, specifically how realistic the mid price is. I do not think it is realistic to use the mid price. I don't typically get filled at the mid with wider spreads, I typically _start_ at the mid and work towards one end until it fills. While that is possible in real-time, its not possible in a backtest, which means you have to have some rule of thumb in the backtest, which may or may not be realistic going forward.\n\nDoes that make sense?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I think we're violently agreeing here, you are using the option pricing parameters to get a rule of thumb for what the trade would fill at if you entered it. I guess we will have to agree to disagree about how realistic that is. :-)", "score": 1, "replies": []}]}]}, {"body": "The link you gave is a backtest on the _underlying_, which is not what I'm really talking about. I agree there can be profitable strategies just trading underlyings. \n\nYou may be speaking from a perspective of using options primarily as leverage, such that you are finding a strategy for the underlying and then just buying/selling options at whatever price in order to magnify the returns. That's not really what I'm talking about either since that's not really \"options trading\" its just stock trading with leverage.\n\nBut even if you're not, I just don't know how you so easily dismiss challenges estimating the fill prices as nonsense? Your fill price assumption has a *huge* impact on the strategy's returns.", "score": 1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I didn't say I couldn't backtest, I even authored [open source software](https://github.com/philipodonnell/paperbroker) to _support_ backtesting, I just don't think we should backtest because of how much error there is in estimating the fill price.\n\nI don't see anything in your comments that addresses that? How do you estimate the fill price?", "score": 6, "replies": [{"body": " You develop strategies robust enough to accept an estimated fill range", "score": 1, "replies": [{"body": "Any rule of thumb for how wide you would want an estimated fill range to be? I don't think any strategy could ever beat a fill at the bid/ask (whatever is worse). Somewhere in between becomes more reasonable, maybe halfway between the mid and the worst fill, but it still seems pretty arbitrary.", "score": 1, "replies": [{"body": "It would entirely depend on the strategy and e.g. whether or not I had a quoting engine. If I'm putting up quotes and able to pull them quickly then I'd probably be placing and pulling orders for better prices hoping to get filled.\n\nFor instance is it a market making strategy? If so and you don't have a <50microsecond execution capability you're going to get worse fills and probably don't actually have an edge\n\nI would imagine most options strategies are strategies you would describe as dealing more with the underlying. Are you basically talking about the 'q side' of quantitative? (i.e. pricing)\n\nThere absolutely are models for options pricing strategies (crazy black scholes Merton formulations, novel things, etc), they just can't be effectively executed on retail hardware and connections\n\nSummary: if your strategy requires getting good consistent fills you need to be a SHFT or UHFT shop, or executing through some broker with similar capability, otherwise you have to develop strats that do well with shit fills. Trying to do it anyway is coming to a gun fight with a foam pool toy", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I agree, OP doesn’t sound like he understands crypto trading if he can’t understand the spread on options", "score": 1, "replies": [{"body": "Do you disagree that wide spreads in options are a source of error for backtesting that does not apply to stocks/crypto? It didn't really seem controversial, I was more focused on the cummulative nature of them that is hard to recognize when you make trades one at a time.\n\nCrypto spreads were actually pretty good most of the time, if weird to me because big orders would \"lock up\" the market at a penny difference and market orders would fill back and forth until one side collapsed, at which point the spread would widen before narrowing at the next lockup. That doesn't happen to options except super liquid SPY and a few others.", "score": 2, "replies": []}]}, {"body": "What is the strategy in the chart provided? ", "score": 1, "replies": []}, {"body": "LOL!!!!!!! I love this. \n\nThe problem starts when they dink dey gud but dey not. ", "score": 0, "replies": []}]}, {"body": "Much of technical challenges you mentioned are mitigated by good markets in SPY. The idea is to backtest on it, and transpose findings to other stocks. I don't think it's viable to backtest in individual stocks (apart maybe from a couple in the FANG club).", "score": 5, "replies": [{"body": "For the most part I would agree that SPY gives you the _lowest_ errors compare to other underlyings ($0.50 strikes, good spreads), but I still feel that the current market environment differs so much from 2008-2017 that even backtests on SPY won't help with the market the way it is now in terms of how IV responds to changes in the SPY itself. The VIX blowups would seem to support that. \n\nTo your \"transpose\" idea, have you ever seen any studies of how closely a particular backtest replicates when run on SPY vs a component? I'm not averse to the concept, it just doesn't immediately strike me that an SPY backtest will work on a bank.", "score": 0, "replies": [{"body": "The market is *not* that different today than it was a couple of years ago. If you really think that then whatever you're doing wasn't any actual strategy or approach to the market. It was a flash in the pan couple of trades that you got lucky on. Environments change and trading styles need to adapt but the way you make money isn't fundamentally different.", "score": 2, "replies": [{"body": "My point wasn't that _markets_ or the approaches to capturing value were different in any fundamental way now, it was a very specific observation that simple backtests along the lines that I described above that optimize SPY strategies for the period from 2008-2017 will produce sub-optimal results if applied to the current market. That's it.\n\nIf you've developed your own trading strategy independently that works for you then by all means keep using it. But if you've developed a strategy by reading about simple SPY backtests, then you need to be aware of just how vulnerable those strategies are to changing market environments, and my opinion is that we are in a changed market environment for the purposes of the applicability of those backtests.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "You are correct. I am speaking to a non-professional audience. I will update the post.", "score": 3, "replies": [{"body": "The non professional options trading audience are largely dumb money/prey animals, but they do NOT want to hear it.\n\nIt's taken as an insult instead of a structural disadvantage. Are you trading on an extremely low latency connection with professional tools? \n\nNo? Then you are going to get long-run smoked. It is a fact and doesn't matter how smart you are. You are in a sword fight with a wet loaf of bread", "score": 1, "replies": []}]}, {"body": "Agree with this entirely.\n\nWhat are you trading in South America? I'm trying to get our clearing house to clear Brazil exchanges. That's where I think we want to start trading next.", "score": 1, "replies": []}]}, {"body": "Some very good points. Also, some very overreaching conclusions here and again.", "score": 3, "replies": [{"body": "I always enjoy the discussion, feel free to comment on the conclusions. :-)", "score": 1, "replies": []}]}, {"body": "Using SPY from 2005 to present, for example, is a very tight set data points. Furthermore, when TT provides 100 different type of studies and they start to overlap and support common mechanics/themes it leads to optimization. Take Poker, we could go in circles on how to play AK optimally based on backtesting and EV, but the  same thing could argued about replication (e.g., fold equity). None the less, in the world of game theory there are probabilities and exploitation, backtesting is how we learn the best path forward. ", "score": 2, "replies": [{"body": "I agree with you in thoery, but there is a basic assumption that what happened in the past during the backtest will happen again with roughly the same probability in the future (and that the players will react in different ways with basically the same probabilities). With poker that is true, cards come up at a certain rate, hand situations occur with predictable probabilities. The players can vary, but poker backtests usually build one or more generalized player models and assume those player models remain relatively constant.\n\nI think its true that the TT studies do start to overlap and support common mechanics/themes, but I don't think that's relevant unless you can go back and trade 2005 to present. Just for SPY specifically, I think the TT studies are far, far too path dependent on a steady upward trajectory for SPY over that time (the preference for short puts and rolling). Its just not a time period that's likely to be relevant over the near term, IMHO.", "score": 1, "replies": [{"body": "Ok, to carry the poker analogy...how do you differ playing AK between small tournaments, large tournaments and cash games? (one format would dictate a fold, another shove for example) Same thing can be looked at with Options and context. Buy or sell?, DTE, management, P/L, winning % and # days, excess risk, etc, etc. Back testing allows us to go to the lab and run these scenarios at a high number of occurrences within a range and expected deviation. ", "score": 1, "replies": [{"body": "Its a good analogy and I don't disagree with what you wrote (I have a few poker bots under my belt, haha), but I think where it breaks down is the number of independent occurrences and the consistency of the rules while you are playing. \n\nLets say a particular underlying=game format (small tourney) and lets use the classic 45-22DTE short strangle. Over 10 years * 50 weeks / 2 week avg holding period (for early closes) is roughly 250 occurrences. Also the rules (what options are available for your parameters) are changing slightly over time (flush beats a straight sometimes and vice versa other times). I just don't think you can figure all those factors out over 250 hands while simultaneously accounting for shifting rules. If you say you'll only limit yourself to the exact same rules (_only_ when flush>straight) then you have less than 250. \n\nYou could enter a different format (underlying) to expand your number of independent occurrences, true, but a) you still only have 250 hands at that one and b) you will have to figure out how applicable will it be to the other format going forward.\n", "score": 1, "replies": []}]}, {"body": "And for what it's worth...TT doesn't preach selling puts and rolling. ", "score": 1, "replies": [{"body": "I'll let Tom answer that from https://www.tastytrade.com/tt/shows/market-measures/episodes/rolling-puts-12-07-2016\n\n> The average P/L went from a negative -$40 [ed:not roll] to a positive $49 [ed: roll] and the win rate rose from 53% to 82%. Tom added, “This is what trading is all about! This is what strategy is! This is how you create value to finance. This means that by rolling the Put you lower the number of losers in all the 1 SD short Puts from 14% down to 3%-5%, and the rest are winners.”\n\nSo my point was that a result like this is because of the slow upward trajectory of the market, not because rolling puts is inherently better in all market conditions is all.", "score": 2, "replies": [{"body": "The same has been said/shown about selling and managing calls on TT, even though puts pay 2:1 to calls (typically) and the relentless positive drift over the last 10 years...  ", "score": 1, "replies": [{"body": "True, but I do not think anyone expects the market to experience a slow relentless positive drift in the near future, thus is questionable whether strategies which optimize for it will continue to experience similar results?", "score": 2, "replies": [{"body": "Those strategies aren’t optimized for any market in particular...but do prove to be profitable. You’re arguing that backtesting doesn’t guarantee future results, but backtesting does validate the past 100% accurately.  1987, 1989, 2000, 2007, brexit, 2010, and now 2018 included. In fact, TT shows the hardest climate to trade Vol was in a low IV / low VIX bull market like 2017...  \n  \nNot sure if you have been trading Feb/March but holy balls it’s amazing. ", "score": 2, "replies": [{"body": "I haven't, I just got back because vol is back up, it looks much more exciting than last October!\n\n> 1987, 1989, 2000, 2007, brexit, 2010, and now 2018 included\n\nDo you have a link to that? Reason I'm asking is that most studies I have seen just go forward across these periods and have a positive number at the end. Saying it was profitable _despite_ the bad months is different from being profitable _during_ the bad months. If you say _despite_ then you're assuming a similar mix of up/down months in the future, and that's my objection, esp when the up way outnumber the down.\n\nNow, if you looked at the backtest and saw that it was profitable _during_ the down months and during the up months, then I agree that is much more compelling because you no longer have to assume a similar up/down, it won't matter.\n", "score": 1, "replies": [{"body": "The bigger TT takeaways are management, allocation, strategy. They don't pretend like their portfolio is weatherproof...in fact, making the wrong mechanical mistakes can wipe out any edge or distinction.   Look at strangles...during a market crash, TT shows losses being less, the deviation lower, and the average time to make back losses quicker than just short puts or long calls for example. To me, TT studies show the paradox of risk...it's easy to think defined risk, or taking less risk is an optimal path. When really, more risk is more profitable, IF properly positioned and managed. Risk is in the size not the position.", "score": 3, "replies": [{"body": "Well said.  This is something I've learned after years of back and forth.  Proper trade size allocation is what keeps you from getting blown out of the market, and no matter how \"solid\" the strategy is, black swan events will happen.  Which is why we have Murphy's Law.  ", "score": 1, "replies": []}]}, {"body": "Are you really arguing about this, at all? It's a long position in the underlying:\n\nhttp://www.cboe.com/products/strategy-benchmark-indexes/putwrite-indexes/cboe-s-p-500-putwrite-index-put", "score": 1, "replies": [{"body": "We were talking about rolling puts, not just selling puts. That study a few posts up showed just selling puts (a.k.a put-write) to be a loser, but selling puts and rolling them was a winner, and specifically identified rolling as the part of the strategy that has alpha. \n\n> Our second study looked into rolling the tested Puts. If there were more than four weeks to expiration we did nothing and held the trade to expiration. If there was less than that we rolled out to the next expiration using the same strike. We rolled only once to keep the study simpler. A second results table showed that rolling to the next monthly cycle the “tested” puts produced much better results than taking no action. The average P/L went from a negative -$40 to a positive $49 and the win rate rose from 53% to 82%.\n\nBut that seems crazy, right? A simple mechanic like that creates alpha?\n\nThe only reason I can think that a backtest would show that rolling creates alpha if it was path-dependent, that is, the particular pattern of slow upward drift means the puts are being pushed further out if the index pulls back and then gives more time to catch that upward drift. _That's_ why the rolling strategy appears more profitable, not because there is any inherent alpha to blindly rolling puts at some trigger. \n\nIf the market had been drifting down then the rolling would have produced much larger losses, which you could see by looking only at the down periods as opposed to only looking at the final number.", "score": 1, "replies": [{"body": "Well, the essential Greek we're really dealing with here is delta--so, yes, it's just the time to recover based on a trading range and delta. Sure, theta helps a bit, too--but the major driving force is just hanging with the trade and waiting for \"mean reversion\" with regard to price (if that's a thing--I'm not equipped to argue over the existence of such a phenomenon as I've never bothered to study it out. Empirically, I never feel like an opportunity is ever really lost in the market; things do seem to present themselves again as it pertains to a price point. But that goes back to my belief that markets don't trade at a price point despite the appearance of such at any finite interval but instead in a range.)", "score": 1, "replies": [{"body": "I had a similar belief about the spread; that the spread merely represents a range of probabilities over which a trade may hypothetically execute with a mean of roughly halfway between the midpoint and the worst price. Transactions entirely within the spread then do not represent any particular movement of the price, its only the probabilities playing out.", "score": 1, "replies": [{"body": "I wasn't talking about the b/a spread but rather the \"market price\" of an asset. When we look at an asset price over time--it's a range rather than a point of singularity. Hence, option prices are set by that same range.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I think you should change your title to Backtesting strangles/straddles is pointless and dangerous. In this case, I would agree with you.", "score": 1, "replies": [{"body": "I tried to address that in an edit, but excellent point.", "score": 1, "replies": []}]}, {"body": "I mean if you backtest with all those shitty assumptions of course it will be worthless. You can fix almost all of those problems you just have to pay a lot of money for data. More money than a retail trader can afford. ", "score": 1, "replies": [{"body": "First, most people reading this are doing/seeing backtests based on these assumptions and also being told they are accurate and awesome. Almost all tools marketed to retail traders to run backtests are based on these same assumptions. I am specifically telling them that backtests based on these assumptions are worthless, which you seem to agree, so I upvoted your comment!\n\nSecond, even given professional-level tools and data, do you disagree that backtests based on 2005-Date are not applicable over the next several months given the changed market conditions?", "score": 1, "replies": [{"body": "It depends on your trades time horizon. If you are scalping vol with trade lengths of a few seconds then the data is fine and probably overkill to look past a few years.  I don't have much insight on longer time scales (3+ months). My intuition is that there is enough data with just OHLC bars since 05 but I'm not super confident.", "score": 1, "replies": [{"body": "Totally fair. I made an edit to the post but am mostly addressing the kind of 2005-Date \"adjust once a day\" backtesting studies marketed to beginners. Intraday vol scalpers such as yourself are a different animal entirely!\n\n> My intuition is that there is enough data with just OHLC bars since 05 but I'm not super confident.\n\nThat's probably a time-horizon thing as well. These are generally talking about a 2-3 week hold time, even over the last 20 years that's only 500 trades in a single underlying. You can probably do that in a day.", "score": 1, "replies": []}]}]}]}, {"body": "Yeah, historical results are totally worthless...", "score": 1, "replies": []}, {"body": "Yes, poor backtesting is pointless and gives a false sense of security\n\nNo kidding? ", "score": 1, "replies": [{"body": "You jest, but I think you'd be very surprised how many products are marketed at beginners based on exactly the approach I've outlined here. Except its presented as proof of a strategy's profitability instead of how you and I treat it.", "score": 3, "replies": [{"body": "I'm not surprised at all, although I'm disappointed by the clearly unethical behavior. Most products marketed to beginners in this field are on the spectrum of sub-par to scam. It's a problem ", "score": 1, "replies": [{"body": "I do think the more we can point out exactly why these things don't work, the more we can help people. But the issue is the people pushing this play two cards:\n\n* The distrust-of-authority card (\"here's what professional traders don't want you to know\")\n* The so-easy-a-beginner-can-do-it card (\"just learn our simple mechanics\")\n\nThat's a tough combo to fight. The person hearing it will disregard professionals dismissing it as nonsense. And they'll never understand why its nonsense because knowing why it doesn't work requires a level of knowledge they don't have yet (And they're told they don't need). They'll just lose a lot of money and stop.\n\nIts a big problem.", "score": 2, "replies": [{"body": "I've found painting it in terms of ecosystems helps. What sort of animal are you, what size, what hunts you and what do you hunt? What strategies will help you survive and thrive? What types of hunting grounds are going to be rich with prey animals for you right now, which hunting grounds are diminished and should be avoided? Is there a wounded large animal behaving unusually?\n\nThis type of exploration often helps get the thought process going in the other direction \n\nSome absolutely will not try it, or they're just too attracted to the notion of easy/fast money. You can't help willful ignorance, and at a certain point it becomes tempting to sell them the panacea they think exists \n\n", "score": 1, "replies": []}]}]}]}]}, {"body": "Excellent points, each of them came back to bite me when I was currency trading. After a year of dry testing on a live market with phony trades, I started trading for real. \n\nSeveral times the spread, (they promised .02c) went as high as 12c when I placed the trade. Several times they closed my position just before a major move in my direction, (because of \"market instability\")\n\nSuddenly changing margin requirements, or even margin calls mid position. \n\nAt first I lived with it, but eventually I saw I could never make a consistent profit if they arbitrarily kept changing the rules.\n\n", "score": 1, "replies": []}, {"body": "Agreed. Any options-based back test will not take into account rolling or trade adjustments (at least not well). Sure, an unadjusted 8 Delta IC 80 days out may be profitable 96% of the time, but is that the best use of capital? And can you handle the heat when you have a 300% loss without adjusting? Not realistic imo.\n\nI personally feel that every trade has its own context and should be played based on assumptions on current and future conditions, not the past. \n\nJust because a backtest says X strategy had the highest win rate/profit factor, that doesn't mean you can't make more being flexible and doing things your own way.\n\ni.e. I have a delta neutral IC on in the S&Ps at the 30 delta that will net me a good return even after rolling out several times. You can't back test for that. ", "score": 1, "replies": []}, {"body": "No, actually options and all options strategies are pointless and dangerous. I was down 30% on the year trading various options spread strategies, I finally said screw this and started day trading straight up stocks (not options!) In the last week I have already recouped HALF of what I lost trading options.\n\nThe big problem with options is it is a rigged market and whoever is in charge of pricing options based on volatility ALWAYS puts you at a disadvantage. \n\nOptions trading is a suckers bet and it is rigged for the average retail trader to fail in the long run. Stay away from them\n\nMy favorite is the Iron Condors trap \"all the stock has to do is stay within a range and I'm golden\" lol straight up suckers bet, pure and simple", "score": 0, "replies": [{"body": "Ya finding mispriced options is hard, to do it successfully as a retail trader you basically have to be expressing a view on the underlying\n\nStep 1: assume almost everything is correctly priced ", "score": 2, "replies": [{"body": "He's a goner, you won't see this name around here. Wanted you to know if you were gearing up for a discussion.", "score": 2, "replies": [{"body": "Was he banned or something? ", "score": 1, "replies": [{"body": "Yup, been going on for a while. He reached my threshold, but others swooped in and did it - apparently I was behind in keeping my strikes tally :)", "score": 2, "replies": [{"body": "He did seem a bit unpleasant even from that one post. Thanks for the info!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Backtesting any trades is useless. It's like if you finance an oil rig today, and expecting to become the next Rockefeller...", "score": 0, "replies": []}]}
