{"title": "Long $WMT", "selftext": "", "id": "d3hyee", "created_utc": 1568338468.0, "score": 52, "upvote_ratio": 0.9, "num_comments": 61, "comments": [{"body": "I feel this is maybe not good for my OTM AMZN calls that expire tomorrow", "score": 18, "replies": [{"body": "Depends how far out we’re talking here", "score": 5, "replies": [{"body": "Out so far you can't even see it on the horizon anymore", "score": 6, "replies": []}]}, {"body": "lmao", "score": 2, "replies": [{"body": "This is good for my Oct 20 $WMT calls.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 41, "replies": [{"body": "Amazon tried to do it by paying the post office and shipping from one of their distrubution centers.  Theres a walmart within 10 minutes of probably 50% of the population. Logisitically they are way more set up to make this profitable than amazon is.", "score": 41, "replies": [{"body": "It’ll probably pay employees to take the groceries on their way home.", "score": 4, "replies": []}, {"body": "There’s no Walmart in nyc", "score": -7, "replies": [{"body": "IKR, and that's where about 83% of US population lives. \n\n*punches numbers on calculator*\n\n*realizes calculator is a tuna sandwich*", "score": 65, "replies": [{"body": "I am so incredibly glad I didn't find this thread at work.\n\nI've been laughing hysterically for the past 20 mins. Like doubled over, tears, drooling at the mouth laughing.\n\nThanks for the awesome start to the weekend boys. Between this and my dollar and oil shorts coming in I can tell it's gonna be a good one.\n\nMay your tendiez remain forever saucy.\n\n<Raises volume on track> https://youtu.be/bEeaS6fuUoA", "score": 5, "replies": [{"body": "Oh no, I'm not getting pulled into your prison rape scheme. You take it back!", "score": 2, "replies": [{"body": "You've got it all wrong brother: this global currency collapse is for all of us.", "score": 1, "replies": [{"body": "Hm. So you're saying prison rape is the only safe currency. \n\nI'm all in.", "score": 2, "replies": [{"body": "Yes. But we prefer to call it Aristocrats!", "score": 2, "replies": []}]}]}]}]}, {"body": "Trade you my $scd for sammy", "score": 3, "replies": []}, {"body": "*realizes tuna sandwich was delivered by Walmart, in nyc*\n\n*gapes as realization hits*", "score": 3, "replies": []}]}, {"body": "Imagine being this retarded.", "score": 7, "replies": []}, {"body": "There's one in Queens kinda near JFK.\n\nWith that being said, I doubt they'll be schlepping your icecream onto the subway to deliver it to Manhattan.", "score": 4, "replies": []}, {"body": "Fake news", "score": 1, "replies": []}]}]}, {"body": "Something tells me a $330B corporation might be more right than you.", "score": 15, "replies": []}, {"body": "They are taking amazons approach, don’t make money, just fuck the competition.", "score": 13, "replies": [{"body": "That was Walmarts approach first.", "score": 24, "replies": [{"body": "Back to basics!!!!", "score": 17, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Something something slippery slopes", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It was just some casual racism.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Bro.... everyone in the country is going to sign up for this. I hate walmart but I'll 100% pay $8 a month to have my shit delivered and never have to set foot in their store.", "score": 15, "replies": [{"body": "Okay, but they'll lose money when they have to send people through their store to get me a days worth of food, load it in a car, and deliver it here every day for like 30 cents a day", "score": 9, "replies": [{"body": "I already use their pickup service. So someone already shops for me. It’s kind of smart, because they are cutting out Instacart as a middle man. Safeway did deliveries when I lived in Cali for a small fee. They seemed to do a lot of business with it.", "score": 1, "replies": [{"body": "Coupons man.", "score": 1, "replies": []}]}, {"body": "Line item price increases or concessions from suppliers help their margins and more than absorb any loss from shipping. Squeezing Kroger and regional stores today helps them down the road.", "score": 1, "replies": []}]}, {"body": "They may be able to pull this off for a few months, but this is the same place that opens 4 out of their 200 checker lines. \n\nA couple months, you'll get mangled bread, bruised bananas, expired milk - and they'll forget your motherfucking tendies.", "score": 6, "replies": []}, {"body": "Lol so true, long Walmart. They know their stores are shit", "score": 1, "replies": []}, {"body": "I won't. More in-store clearance for me.", "score": 1, "replies": []}]}, {"body": "No, but in a downturn I bet WMT can get more loans to beat amazon. Especially,  if AWS suffers, they may have to out their delivery plans on hold and/or raise prices.", "score": 1, "replies": [{"body": "Amazon makes more profit than Walmart", "score": 1, "replies": [{"body": "https://mgmresearch.com/amazon-vs-walmart-revenues-and-profits-comparison-1999-2018/\n\n\n\nThey do not make more profit, and if there is a downturn and people look for the cheapest option, Than I think Wal Mart would have the advantage. Plus so much of Amazons profit is due to AWS, and I feel like with the current competition they will have a much harder time when companies look to save money in a recession and fewer startups get funded.", "score": 2, "replies": [{"body": "bruh, how autistic are you? \n\nFrom your own source: \n\n>In 2018, Amazon reported a net income more than the Walmart. Amazon reported a net income of $10.1 billion, whereas Walmart net income was $6.7 billion. In 2018, Amazon net income share was 60%, whereas Walmart net income share was 40%.", "score": 1, "replies": []}]}]}]}, {"body": "Unless they strike a deal with Uber and Lyft or whatever other 3rd party app comes up (that they might create). It's not hard and it's not expensive when you're not trying to automate driving.", "score": 1, "replies": []}, {"body": "The price could be rolled into the items themselves. Fresh direct isn’t cheaper than going to the super market, but I get free delivery with the delivery pass. Probably how they do it.", "score": 1, "replies": []}, {"body": "I wonder if they're hoping it will reduce theft by reducing foot traffic in store", "score": 1, "replies": []}, {"body": "Actually... In my humble opinion, I believe that it WILL be profitable!", "score": 1, "replies": []}]}, {"body": "WALL-E is becoming more of a reality everyday", "score": 11, "replies": [{"body": "Will I be able to connect to robinhood via satellite internet from my fucking log cabin in the mountains away from all the fat people?", "score": 3, "replies": []}]}, {"body": "Losing money is the new black. WMT is basically a triple unicorn so if they can start losing money they’ll be a quad unicorn in no time. YOLO", "score": 11, "replies": []}, {"body": "I don't care about WMT, but I want to fuck Lauren Thomas", "score": 6, "replies": []}, {"body": "What I find troubling about this is the risk of people overspending with funds they don't have. Savings rates are down, real wage growth nonexistent and apathy abound. Yet while I stand with my stack of coupons at the register people before and after me drop $200 on a cart of groceries. Imagine them clicking away online.", "score": 3, "replies": [{"body": "Long time online grocery shopper of \\~4 yrs.  It actually doesn't work like that.  If you never set foot in the store you are less likely to overpurchase.  No impulse-buy items, you miss products that aren't listed online, you aren't in the building where all the stuff is.  You literally have to stop, think about what you need, and search for it before adding it to your cart.", "score": 1, "replies": []}]}, {"body": "Well there goes the only exercise these welfare recipients get each week", "score": 3, "replies": []}, {"body": "game changer- google express was just a bunch of expensive groceries from whole foods and didn't have department stores in my area. If this saves a 2 hour trip to the store every week I'm down", "score": 2, "replies": [{"body": "My wife does the free grocery pickup every 5 days. \n\nI guarantee she will jump on this service as soon as it's available.", "score": 1, "replies": [{"body": "Am someone's wife; do online grocery pickup; can confirm.", "score": 2, "replies": []}]}]}, {"body": "I don't think y'all see that this is a step towards automating the food delivery process", "score": 2, "replies": []}, {"body": "I like to feel my produce before buying it to make sure it's got some nice crisp.  Delivery wouldn't care as much", "score": 2, "replies": []}, {"body": "Tendies are on me tonight", "score": 1, "replies": []}, {"body": "Can already use Shipt.", "score": 1, "replies": []}, {"body": "By 50%$ of the country they probably mean land, not people.", "score": 1, "replies": []}, {"body": "Short the news", "score": 1, "replies": []}, {"body": "With the quality of employees and customer base,  I see the food delivery failing. Individuals that can afford the delivery service are not shopping at Wal-Mart.  If online service ever makes a footprint in the market I agree longing. However, extremely slow growth.  $msft has a better chance of doubling with in a year versus walmart.", "score": 1, "replies": []}, {"body": "They don't even price match anymore unless it is on the Walmart website. Walmart is competing with itself.", "score": 1, "replies": []}, {"body": "Say you get delivery once a week. That’s 52 weeks making the delivery fee less than 2$ each time. LOL guess the name of the game is to pay a dollar to make 80c or in this case pay a dollar to maybe make like 10c. Let’s see how long this cheap money bubble lasts.", "score": 1, "replies": []}]}
{"title": "Goldman Sachs cuts Apple, predicts 26% stock drop on TV+ accounting", "selftext": "", "id": "d3p1sl", "created_utc": 1568380273.0, "score": 101, "upvote_ratio": 0.96, "num_comments": 59, "comments": [{"body": "Ah it’s that time again where the analyst community gangs up on AAPL and knocks 30% off the price. Timing seems odd but OK", "score": 91, "replies": [{"body": "Every time too haha. Whenever apple gets up a bit there is always something from analyst to keep it around $200", "score": 29, "replies": []}, {"body": "Maybe those apple AR glasses are real after all.", "score": 1, "replies": [{"body": "Don’t forget about the car too", "score": 1, "replies": []}]}]}, {"body": "Goldman Sachs thinks that an accounting change is worth 110 billion dollars, or 1.4 Goldman Sachs. This is next level autism.", "score": 48, "replies": [{"body": "not autism when you realize they just want to buy some shares at discount they themselves caused", "score": 42, "replies": []}, {"body": "AAPL to buy GS tomorrow and force GS to short themselves", "score": 12, "replies": [{"body": "Take my gold", "score": 1, "replies": []}]}]}, {"body": "calls it is. time to inverse The Sach", "score": 30, "replies": [{"body": "That sounds painful", "score": 20, "replies": []}, {"body": "Last time I inverse the The Sach, I made so much money. So I think you're right.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I also agree that ditching the “r” and “c” on the cheaper model is suspicious as fuck. Now the quacks buying the “11” won’t know they’re getting the cheap iPhone. Idk it’ll most likely be profitable. I just don’t fw it", "score": 1, "replies": []}]}]}, {"body": "AAPL is going to do a share buyback this year of $120 billion.", "score": 11, "replies": [{"body": "There it is. They’re in cahoots. This should be a conflict of interest. \n\nGS cuts guidance, Apple buys back at lower price, Goldman and Apple both win.", "score": 11, "replies": [{"body": "So short AAPL?   I did that when it was $225.   Who cares now that the free cream is off?", "score": 1, "replies": []}]}, {"body": "Bingo", "score": 1, "replies": []}]}, {"body": "But did they see the third camera?", "score": 20, "replies": [{"body": "Even amount of cameras, stock is a buy. Odd amount of cameras, stock is a sell.", "score": 13, "replies": []}]}, {"body": "I read this 10 times and still had no clue what the author of this article was trying to actually say.", "score": 17, "replies": [{"body": "Essentially Goldman fiends think apple’s plans for their hardware (iPhone + computer) and e-services.  So the make a post/article like this, so investors will think oh shit, time to bail the apple ship. If enough people bail the stock price is lowered.   \n  \nHere’s the plot twist. Sachs can now buy the apple shares at the lowered price and make bank.  \n  \nSource: no background in Econ, but seems like Sachs trying to stir up bad press for apple", "score": 16, "replies": [{"body": "Just like what they did to AMD when its $9.", "score": 11, "replies": []}, {"body": "Dam I feel like they’ve done this a few times now", "score": 11, "replies": [{"body": "Yep, one of the top market manipulators. They also have multiple (thousands) of small corps (third party) doing the work", "score": 14, "replies": []}]}, {"body": "It’s a downgrade/sell at current price and upgrade/buy at a lower price. Is it even manipulation when they are doing exactly what they say.\n\n(Technically these are completely different siloed departments as well as the Apple Card, so it really doesn’t matter)", "score": 0, "replies": []}]}, {"body": "they are just frigtarded dipshits who want to drive the price down so they can buy in cheaper. nothing to see here, typical ANALists.", "score": 5, "replies": []}, {"body": "Because of the apple+ tv trial for all new iPhones, the margin per phone will be $60 less on their next earnings report, so people will freak out.", "score": 2, "replies": [{"body": "You really think the $4.99 per month is going to increase the cost by $4.99×12?  Like people at the factory are going to Apple.com, buying a 1 year gift card, and putting the code in each box?\n\nThe impact to cost will be minimal, and it will be applied to the cost of running the streaming service \\(advertising\\), not the cost of the phone.", "score": 3, "replies": [{"body": "It means it will just affect accounting, the revenue will shift from the phone margin to the services but it will still be there. What they also say is that they defer that income because the service is for 12 months so initially revenue will go down a bit.", "score": 2, "replies": [{"body": "I'm talking about his comment, the hardware sales and margin in isolation.", "score": 1, "replies": []}]}]}, {"body": "Ah I see. Still going long on Aapl 1/17/20 $210 bc this is all stirred up bs", "score": 3, "replies": []}]}]}, {"body": "My puts need this. Keep it coming please.", "score": 22, "replies": []}, {"body": "Apple is half-assign the tv service, they could have bought HBO or DC Comics or even entire Sony productions division", "score": 4, "replies": [{"body": "they want their own home-grown stuff, not leftover shitty programming with endless baggage from those has-been networks.", "score": 1, "replies": [{"body": "Having 9 shows is not a streaming service, it’s a weekend binge watching marathon, Tim Cook is really messing up, Apple TV should have been free with Apple Music sub", "score": 5, "replies": []}, {"body": "Yes nothing says \"not half assing it\" like garbage shows staring washed up 90s actors.\n\nBuying DC comics means they own all those properties, they could have redone DC like Marvel and printed money. Instead, its Jennifer Aniston doing kinda sorta Rachel again!\n\nsigh.. goldman is right, this thing is a mess", "score": 3, "replies": []}, {"body": "This is going to cost them a fuckton, just look at nflx", "score": 1, "replies": [{"body": "I think they can swing it.", "score": 1, "replies": []}]}]}]}, {"body": "I get that there is a separation b/w divisions but GS is doing business with AAPL with AAPL card. You would think somebody higher up at GS wouldn't authorize this.", "score": 18, "replies": [{"body": "I promise you Goldman sent out this hit piece so they can BTFD later\n\nThey are proven manipulators and inversing their upgrades/Downgrades is a good strategy.\n\nI remember they downgraded AMD when it was at $10 back a few years ago. And then the following SEC filings showed they increased their stake in AMD lol", "score": 50, "replies": [{"body": "Well, we know that they're the vampire squid of wallstreet. So, wait for the AAPL drop and then go long. That's the strategy?", "score": 14, "replies": []}, {"body": "GS and Morgan Stanley occupy the lowest rung of Hell. Fuck Morgan Stanley in particular.", "score": 7, "replies": [{"body": "Well Fargo is much worse than MS; look at the all they had so far.", "score": -1, "replies": []}]}]}, {"body": "Why would anyone listen to what GS says if they let this impact their predictions.", "score": 4, "replies": []}, {"body": "That may be a breach of the firm protocols to separate information.\n\nIBD/GIR/whoever produces this business doesn’t concern CIMD’s.\n\nIt often happens that one part of a bank shorts a stock at another’s expense... all large banks will have “inconsistent” opinions on stock", "score": 3, "replies": []}]}, {"body": "Calls it is", "score": 3, "replies": []}, {"body": "Fuck literally anything GS says.", "score": 3, "replies": []}, {"body": "Sounds like they want to buy more", "score": 2, "replies": []}, {"body": "Sorry for being retarded, but isn't GS in bed with AAPL on Apple Card? Unless they wanna buy more shares at a discount how would downgrading them would be viable", "score": 2, "replies": [{"body": "Different parts of the company handle different things and in theory they should be making their decisions in a vacuum. Google chinese walls", "score": 2, "replies": []}]}, {"body": "Lol what a dumb move. AAPL is forever King.", "score": 4, "replies": []}, {"body": "How does Goldman Sachs maintain any credibility whatsoever with predictions like that? I mean, who needs mango man?", "score": 2, "replies": []}, {"body": "Okay, you fucking autists, I'm new here. Someone tell me this: If the consensus here is that GS is trying to manipulate the market in order to lower Apple's stocks, wouldn't it be a good strategy to buy puts on Apple, sell those, and then buy calls? Or am I being retarded?", "score": 1, "replies": [{"body": "You're being retarded", "score": 2, "replies": [{"body": "Thanks", "score": 1, "replies": [{"body": "Puts in the short term, calls at the end of the dip. Can't go tits up", "score": 1, "replies": []}]}]}]}, {"body": "fucking goldman. i fucking hate this company. \n\ntheir call is straight up bullshit and everyone knows it. even apple said it was bullshit. fuck you GS. some cocksucker had puts/shorts that needed to be in the money.", "score": 1, "replies": []}]}
