{"title": "TSLA Advice..", "selftext": "Bought 17 shares of tesla on Friday, and am currently eating crow after it has dropped 20$ a share. Advice on what to do with it? Way too much red in my portfolio right now. ", "id": "5vquyu", "created_utc": 1487862324.0, "score": 19, "upvote_ratio": 0.74, "num_comments": 65, "comments": [{"body": "[deleted]", "score": 76, "replies": [{"body": "Not too much at all. Just trying to learn from people who know more about stocks than I do so I figured I'd ask early. ", "score": 13, "replies": [{"body": "You have to ask yourself what you think TSLA is worth? And what you think people will pay for it? And how long you anticipate on holding it?\n\nI think there is a case that the shares could be $100/share in a year.\n\nI also think there is a case that it could be over $500/share in a year.\n\nThis is a pretty high risk/reward equity. And people were 'eating crow' on dips and being ridiculed for investing in this since it was $30/share. \n\nI had a buy on this in November at $180 and it never hit... it made it to like $182, so the buy never happened. Sucks, right? And it does - but I feel pretty ok with having a thesis, sticking to it and executing. At least I am living by my rules and know that I will win one on the future. It is the same reason I am heavy GLD right now and the same reason I rode FB from 19.50 to 131. You are playing a game and you will lose some. Hopefully, you will win some, as well. \n\nOverall, my opinion is that you need to find yourself an opinion. ", "score": 18, "replies": [{"body": "I got this stock at 188, could only hold on till 225. So much hype, they're on the front page of Reddit nearly every day. It's hard to believe it, . this is basically the biggest tech startup in history. massive infrastructure but no earnings. At least they have a revenue model. But it's pretty much anyone's guess what it's actually worth, and I think you are likely paying a premium for any future earnings at these prices. In fact, I think you will always have to pay a premium for shares of this company, their pr machine isn't going to suddenly stop.", "score": 1, "replies": []}]}, {"body": "If you want to make some quick cash, then you may want to think about cutting it and putting the money elsewhere.\n\nIf you believe in Tesla long term as a disruptor and game changer, then you should consider holding it for a 5+ year period through thick and thin no matter how much it falls.", "score": 1, "replies": []}]}, {"body": "thats stupid advice, im not just trying to be mean but thats actually bad advice. lots of people cut losses at 5% or even less depending on context. ", "score": 1, "replies": [{"body": "It's great advice. However, yes the people who sell after 5% drop shouldn't have even bought in the first place. Imo the buyer didn't even have confidence in the stock in the first place. ", "score": 1, "replies": [{"body": "youre talking about investing, im talking about trading.  the OP never specified which hes doing so to be fair we could both have good points. ", "score": 1, "replies": []}]}]}]}, {"body": "Buy more? If you bought it back then, you must have thought it would keep going. All it did today was go on sale! ", "score": 28, "replies": [{"body": "\"The financial markets are the only store that customers run out of when everything goes on sale\" ", "score": 8, "replies": []}, {"body": "Yeah I've been taking it up the butt with call options the last 2 days, so I'm thinking I'll cut my losses and get in on the tesla sale once it stops falling. ", "score": 1, "replies": []}]}, {"body": "hold long. This is a growth stock. Expect volatility along the way. I started my position with 10 shares at $185, and have averaged up a little bit along the way, to currently hold 17 shares avg of $217. I am holding TSLA for years. ", "score": 9, "replies": [{"body": "Smart. When did you get in at 185? Before this big rally? Or year before? ", "score": 1, "replies": [{"body": "I got in at 185 before this big rally, back around Nov or Dec.\n\nIf TSLA dips back down to those levels, I am backing the truck up and buying as much as possible.", "score": 2, "replies": []}]}]}, {"body": "Do you really want to know or... are you just asking?\n\nI suggest you go back to the drafting board and read (or re-read) about investing.  Without knowing your specific situation these are some possible scenarios that might have happened:\n\n1. You're a trader/Speculator.  The earning call was coming up and your analysis led you to the conclusion that $TSLA was going up, you took your position, unfortunately you were on the wrong side of the trade.  If that's the case liquidate, and move onto your next trade.\n\n2. You're an investor and you were trying to time the market.  Some people believe that the market can be timed, some people don't believe so. See #3 below.\n\n3. Some investors like yours truly decide how much to allocate to a certain position, then they *accumulate* the position. For instance in Dec 2016 I decided to allocate a certain amount of $ from my portfolio to $TSLA, I divided that amount by 14 and I make 1 buy every month on the first business day of the month for the entire 2017; that's 12 buys.  The extra 2 are reserved if $TSLA were to take a dip (buy low).  Note also that if you're investing in stocks, one of the basic pillars is that there's inherent risk associated with investing in stock, especially with companies like $TSLA; another basic pillar is diversification, and one more is that the time horizon for a stock investors is 5 years or longer.\n\nYou asked for comments, and this is my opinion.  It works for me, YMMV.", "score": 7, "replies": [{"body": "Assuming no trade fees for option 3, correct? (or your volume is high enough where it doesn't matter?) ", "score": 2, "replies": [{"body": "No fees is better than paying fees. Always. Everywhere.", "score": 2, "replies": []}]}]}, {"body": "If you look at the MACD, I think TSLA will drop more for the next week or two.\n\nI'm looking to get back in at $240ish. \n\nOverall, TSLA should go higher, as it's still February and Model 3 production will hit by H2 and deliveries by late 2017/early-mid 2018. TSLA shares always rocket higher when there is a new model release. \n\nI expect TSLA to hit $350 by 2018. \n\nAnyway, Colos316, I would probably hold for now and just buy more at a lower price ($240ish). You could risk it and sell now, and buy more later. But that, in itself, is also a risk. ", "score": 11, "replies": [{"body": "That's where I was leaning for sure. I definitely want a large holding,  especially with the outlook, I just wanted to figure out if minimizing losses by selling now was a good idea and I think I'll just hold on. Thanks!", "score": 5, "replies": [{"body": " You only realize gains and losses once you sell. Right now your holdings are ***valued*** a little bit lower if you think that tesla is going up then selling now means you realise a loss. I understand you dont want to be a bag holder but if you want to grow your savings you buy low sell high. What you propose here is the opposite. I strongly suggest you visit r/investing.", "score": 1, "replies": []}]}, {"body": "Can you share a bit more insight on the MACD and how you are reading it?", "score": 5, "replies": []}, {"body": "MACD?  The 0.09 or $52?", "score": 1, "replies": []}]}, {"body": "Stocks is one place where asking what to do will never get you a consensus and often leave you more confused than when you started.  People just have so many varying opinions on what will happen to a stock.  One of the most important things for me, is deciding on what kind of trade I want to make.  Am I going into it with a plan to hold for a few minutes, days, weeks, months, or years?  Some people will say it's going down.  Some people will say it's going up.  And yet, if you ask more questions they might actually agree about the long term prospects, they were just talking about different timetables. I bought TSLA too recently.  If it drops 75% I'll add.  Otherwise it's a hold for me for many years.  ", "score": 5, "replies": []}, {"body": "Buy High and Sell Low.", "score": 15, "replies": [{"body": "wait.....okay", "score": 1, "replies": []}]}, {"body": "lean back and enjoy the ride", "score": 4, "replies": []}, {"body": "Well, don't sell low. Patience grasshopper.", "score": 5, "replies": []}, {"body": "if you're investing: consider buying more or just hold.\n\nif you're trading: consider cutting losses.", "score": 3, "replies": []}, {"body": "buy more and average down", "score": 6, "replies": []}, {"body": "This will happen, you thing NOW is the time to buy in, and then a few days later some news comes out and send the price down. \n\nyou have to ask yourself \"would I buy TSLA where it is now, given the new news?\" If your answer is yes, then you should hold or buy more if you can. if your answer is \"no\" then you should sell.\n\nPersonally, I don't own any TSLA, but I've been eyeing it for a while now, I like their position long term, but I did think the price was a bit inflated before the drop. I may start a position in them tomorrow when I get more funds in my account. ", "score": 3, "replies": []}, {"body": "Stocks is a long term game. If you are confident with the company that you invested in, then occasional losses are just opportunity to buy more.  If you're new to stocks, it's better to buy when the stock is going down, not when it's going up. With a company like tesla, it's going to be volatile since its operating at a loss, and every earning report will see a major flux. ", "score": 3, "replies": []}, {"body": "Hi there, please ignore anything anyone is saying to do with news on TSLA. The only thing that should ever concern you is the chart. If you look on the daily(ill include link to my notes below) TSLA has been in a very aggressive uptrend for the past several weeks with no look backs until well, today. Now, taking a look on the overall picture of TSLA, a key resistance level has been between 280 to 290, exactly where it happened to drop from recently.... My advice? Get out. Ive included the chart and you can clearly see with the horizontal line on top when TSLA has hit this range its dropped right down consecutively and you can easily expect it here. Unless you want to take a major hit in the coming month(s) (Expected, not telling you this is going to happen for sure) I would get out and take your money to cheaper stocks where you can buy more shares in which smaller moves add up to easier wins. Last thing before I link the chart, keep your losses small and your winners as big as possible. As soon as a stocks loss becomes to itch at you get out and find something else!  Dont half to be stuck to one stock waiting, hoping for the day it brings you money. For winners, you dont always need to bring in the thousands of dollars. If a stocks made you few hundred take it and dont risk it getting out of your hands.\n\nMy technical analysis on TSLA https://invst.ly/3bxtf", "score": 3, "replies": [{"body": "\"Charts\".  Lol.", "score": 1, "replies": []}]}, {"body": "I agree with most here. either buy more or hold tight. I don't see them being down for too long.", "score": 2, "replies": []}, {"body": "I got out with a decent profit recently @ 255, waiting for it to dip more before picking it up again. Long term I do think it will go to record highs but it's not going to be a smooth road getting there. Don't be surprised at all if it drops another 10-20%.", "score": 2, "replies": []}, {"body": "I'm waiting for it to hit 200 again. I know it won't happen soon, probably not for months, and it will probably go higher again, before falling down there again. But I'm patient. I know it will fall to around that level sooner or later. In the long term I'm definitely long on the stock though. \n", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Being strictly technical... Just a rough S/R draw: http://imgur.com/a/5fofZ These are the levels on the TSLA chart I see. Of course there are many other factors to consider. \n\nBtw good buy!\n", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "This is the platform from plus500 and is not really that good. I'm just testing the broker. I needed one with stock cfds to play around a bit. Usually the MT4 platforms have good charts. Try for example a demo account on fxpro. They offer stocks too.\n\nYes I know. If the Model 3 is going to be a huge hit the price will skyrocket. Especially if they would be able to achieve their 500k yearly production goal in the next years. \n\nI previously also thought that the price won't go back below 200, but it did. Once to 120 in Nov 2013 just to go back to 250 about 3 months later. Then it did the same last Feb - down to 140 and up to 260 in a short time. And again this winter when it hit the bottom at 180 on Dec 1 and went to 280 this week, again in a 3 months time. Based on that IMHO it could happen again.\n\nThe triggers in the past were about Tesla's being dangerous, because one or two caught fire, etc. But it was all just temporary. I mean, the petrol engine cars catch fire too, right?! :) One such trigger now might be a delivery delay of the Model 3. I consider Elon Musk a great visionary and everything, but Tesla has had some delays with its delivery goals in the past. And it can happen again. Also the stock getting higher and having an ever bigger market cap is based on the assumption they will hit the 500k production goal. Delaying it should also make the stock go down. Usually, after big breakdowns the price stops around old S/R levels. \n", "score": 2, "replies": []}]}]}]}]}, {"body": "Send the shares over here bro", "score": 2, "replies": []}, {"body": "TSLA is one of the most volitile stocks around....so either sell now for a loss as it will likely drop more in the next week, or just stop worrying about it because it ***will*** go back up in the next couple months", "score": 1, "replies": [{"body": "Better to just buy more ", "score": 1, "replies": []}]}, {"body": "TSLA has been in overbought territory for close to two months. Not much support or resistance between here and the 50 day moving average at $238 so it may continue it's downward spiral to the point. Hold until $238 if it reaches that point and buy more if bounces up off of major support. I doubt the believers of Elon Musk will let it get that far though ", "score": 1, "replies": [{"body": "I'm relatively new to investing, any recommended reading on what you mean by support and resistance?", "score": 1, "replies": [{"body": "http://stockcharts.com/school/doku.php?id=chart_school:chart_analysis:support_and_resistance", "score": 1, "replies": []}]}]}, {"body": "Why did you buy it at all?! Long-term? - Better to wait. ", "score": 1, "replies": []}, {"body": "tsla just got rejected off a all time previous high resistance, it broke below an uptrend line its been bouncing off since december (which has been supporting this whole bull run its had). However, todays lows bounced off a previous downtrend line and that is now acting as support but it is still facing resistance at 265$. ", "score": 1, "replies": []}, {"body": "Tsla is an extremely volatile stock. They report earnings. It's always a lot of swing around now", "score": 1, "replies": []}, {"body": "Oil. ", "score": 1, "replies": [{"body": "Well now im curious if tesla and oil have a negative beta", "score": 1, "replies": []}]}, {"body": "Don't panic and rely on TSLA for long terms. Of course, volatility happens here (as well as to each stock), but that doesn't prevent me from being a shareholder. ", "score": 1, "replies": []}, {"body": "This is definitely not a short term stock. You might see some minor fluctuations in the stock price but this is one to hold onto long term. The analytics look strong and there is absolutely no reason to panic. Hold until you don't believe in what the company is doing anymore. ", "score": 1, "replies": []}, {"body": "Tesla is here to stay dude. It's one of those king term stocks. A little dip like this is nothing.", "score": 1, "replies": []}, {"body": "Go back to sleep.", "score": 1, "replies": []}, {"body": "Buying high and selling low is , has anyone made money doing that?", "score": 1, "replies": [{"body": "r/wallstreetbets", "score": 1, "replies": []}]}, {"body": "First rule: buy when others are selling, and sell when others are buying. If a stock dips and your reaction is to sell, stocks are going to be an emotional roller coaster for you. When I see Tesla dip, I buy more. But that's also because I'm bought into the bigger picture of vertical solar integration and see it as a \"sit and never sell\" type stock. Obviously you'll do what's best for you, but remember that earnings season is a volatile time for stock prices. And Tesla especially is going to go up and down a lot. Focus more on quarter to quarter, or year to year, and less on day to day. That is, unless you've got $25k eating a hole in your pocket and you want to day trade. Then that is a whole other thread. ", "score": 1, "replies": []}, {"body": "Meh, 340$ loss doesn't seem bad. ", "score": 1, "replies": []}, {"body": "Tlsa is going big. This is a long term investment. They dont even have all their gifafactoys up yet. ", "score": 1, "replies": []}, {"body": "If you're gambling, you should double down.  If you *think* you're \"investing\", run far and fast from a hype machine like TSLA.  Pretty sure it's doomed to bankruptcy.\n\nIt's gonna be a spectacular thing to watch.", "score": -4, "replies": [{"body": "lol", "score": 1, "replies": []}, {"body": "I disagree. It's far from bankruptcy. Worst case it gets bought out by GE or some other company. Although I feel AAPL has a better shot. ", "score": 1, "replies": [{"body": "Maybe not bankruptcy, but if any other company not named Tesla deferred payments to suppliers to artificially fatten their cash position, set up a new capex in the range of $2-$3 billion (because they're essentially out of money), missed their production goals, jettisoned their CFO, pushed back release of their latest-greatest thing for another month or more, and on top of that are all mixed up with a goofball merger that makes only sense in the Musk's mind...all on top of overhanging dilution....people would be running the other direction. RSI just ran below 70%, plenty of room to a $230 floor (or worse) near-term. You know the old saying, though....\"fools rush in where angels fear to tread.\" ", "score": 3, "replies": [{"body": "Bankruptcy is absolutely a possibility.  If this were not happening at a time of *FREE* money, it would have gone the route of Fisker long ago.", "score": 1, "replies": [{"body": "Touche.", "score": 1, "replies": [{"body": "Well you did say \"maybe not\".  :)", "score": 1, "replies": []}]}]}]}, {"body": "Laughable.  They have no \"tech\" worth speaking of.  What on earth would Apple want with it?  They're not dumb enough to try to make money manufacturing cars.", "score": 1, "replies": []}]}]}]}
{"title": "NVDA DOWN 4% IN PREMARKET. BUY BUY BUY", "selftext": "", "id": "5vpwdj", "created_utc": 1487849305.0, "score": 30, "upvote_ratio": 0.81, "num_comments": 59, "comments": [{"body": "What prevents these analyst cunts from shorting a stock before downgrading it? Or telling an acquaintance to short it before the downgrade?", "score": 19, "replies": [{"body": "Nothing. Analysts who post these targets and ratings are on the sell side. Take with a grain of salt. ", "score": 15, "replies": []}, {"body": "Maybe not shorting, but I feel like they want to pick up some shares on the cheap.  Scare out all the little money, then come back buying big blocks.", "score": 3, "replies": []}, {"body": "Insider trading is illegal.", "score": 1, "replies": [{"body": "Have you been in America lately? Illegal doesn't mean shit if you have money.", "score": 18, "replies": [{"body": "TIL Martha Stewart didn't have money.", "score": 5, "replies": []}]}, {"body": "Not sure if this one counts as insider trading if you're writing news pieces.\n\nPersonally ithink those fuckers should be jailed, but that's me.  I'd totally do the same.", "score": 3, "replies": [{"body": "It would most definitely be illegal if they did not disclose they were shorting the stock in their report. ", "score": 1, "replies": []}]}]}]}, {"body": "Slowdowns in gaming? Please I work in this industry this shit isn't slowing down for a long time. Bullshit", "score": 15, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Marketing for an indie publisher", "score": 2, "replies": []}]}, {"body": "Yeah..that's the most retarded statement I've heard this week. Gaming is going to fucking explode once VR comes down in price.", "score": 1, "replies": []}]}, {"body": "Is this a meme or should I buy the dip", "score": 16, "replies": [{"body": "I bought more. I'm avg share price at $113. I got like 400 sharers. Holding for a year", "score": 7, "replies": [{"body": "fucking hell, i hope you've saved some money on the side for some rope. shits taaaaanking", "score": 16, "replies": [{"body": "nah i will be fine, its gonna be $150 by the end of the year. people are just scared cause of some shit analyst. that same analyst has AMD at a PT of $3 LOL", "score": 7, "replies": [{"body": "word, but BMO downgraded too, which means a couple other analysts  might review their PTs now which might cause it to tank another leg. I'm not too sure about $150... but $125 by 2018 seems reasonable.", "score": 3, "replies": [{"body": "Time for that rope then. It's only a loss if you sell ;)", "score": 3, "replies": [{"body": "yeah looks like we're fucked on this one", "score": 1, "replies": [{"body": "Ppl are panic selling lol.", "score": 2, "replies": []}]}]}]}]}, {"body": "When calculating how much people are buying dividend their shares by 100. That guy most likely bought 4 shares.", "score": 1, "replies": []}]}]}, {"body": "You should buy :)", "score": 8, "replies": []}]}, {"body": "LEAVE MY GAINS ALONE FKN MARKET", "score": 13, "replies": []}, {"body": ">[Analyst Concerned About Slowdown In Gaming](https://www.benzinga.com/analyst-ratings/analyst-color/17/02/9083445/nvidia-falls-following-nomura-downgrade-analyst-concerne)\n\nriiiiiiiiiiiiight", "score": 8, "replies": [{"body": "If you haven't tried a current gen VR system then any opinion on the future of gaming is worthless imo, I'm definitely buying the dip.", "score": 1, "replies": [{"body": "Though I haven't personally used it, I see it as a deep market. It's like the wii. It's niche (which sells). Not a GTA platform but they find ways to use that technology to it's fullest potential like that 3D painting game or that engineering game where you build machines.\n\nAlso, as someone well versed in the world of eSports, I see that as another growing industry that will support gaming's future. \n\nThe only downside is that Valve isn't public.\n", "score": 1, "replies": [{"body": "VR it's going to be huge, porn at the very least is going to be a huge deal. I've only tried the Vive once for about 10 minutes at a Microsoft store, but it's fucking wild. Even at the grainy resolutions they have now it's pretty impressive, I was a lot more impressed than I thought I would be.", "score": 1, "replies": []}]}]}]}, {"body": "this is market manipulation ... trying to scare all the pussys like me who bought high into selling before NVDA takes off again.  Buy the dip.", "score": 8, "replies": []}, {"body": "lol @ everyone in this thread who bought", "score": 6, "replies": []}, {"body": "another downgrade just happened", "score": 8, "replies": [{"body": "Glad I shorted 500 shares on Monday.", "score": 4, "replies": []}, {"body": "source", "score": -1, "replies": [{"body": "you lazy fucking idiots can't even use google?\n\nhttps://www.benzinga.com/analyst-ratings/analyst-color/17/02/9083445/nvidia-falls-following-nomura-downgrade-analyst-concerne", "score": 4, "replies": [{"body": "You crazy? this is \"just\"?? Every body knows this already\n", "score": 4, "replies": [{"body": "BMO downgraded it too - announced pre-market", "score": 2, "replies": []}, {"body": "https://www.benzinga.com/stock/nvda/ratings", "score": 1, "replies": []}]}]}]}]}, {"body": "im buying this train all the way down to zero. no falling knifes here. just falling gold", "score": 3, "replies": []}, {"body": "Wow, nearly -10% now.", "score": 3, "replies": []}, {"body": "OP legit retard", "score": 3, "replies": [{"body": "This", "score": 1, "replies": []}]}, {"body": "[feelsbadman.jpg](http://imgur.com/qQSsBGX)", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Unique Negative Gain Opportunity", "score": 3, "replies": []}]}, {"body": "it's back to where it was last week... ", "score": 1, "replies": []}, {"body": "I'm going to close my short puts at a loss today it seems. I don't really want to be assigned the shares.", "score": 1, "replies": []}, {"body": "Shares of Nvidia Corp.(NVDA) sank 4.3% in premarket trade Thursday, after Instinet swung from bullish to bearish on the graphics chip maker, citing concerns over a slowdown in gaming. Analyst Romit Shah downgraded Nvidia(NVDA) to a rare reduce rating from buy, and slashed his stock price target to $90, which is 19% below Wednesday's closing price of $ 110.76, from $100. Only 5% of the companies covered by Instinet were rated reduce through Wednesday. \"We believe consensus is underappreciating a slowdown in gaming and the potential negative impact to the multiple,\" Shah wrote in a note to clients. He recommended investors take profits on their Nvidia(NVDA) stock and rotate into Intel Corp.(INTC) . Intel's(INTC) stock ticked up 0.2% in premarket trade. Shah said that in addition to Nvidia's(NVDA) stock trading at a \"significant premium\" to its peers, \"investors should recognize that the market's enthusiasm for Nvidia's(NVDA) emerging businesses is historically shortlived.\" Nvidia's(NVDA) stock has more than tripled over the past 12 months, while Intel(INTC) shares have rallied 25%, the PHLX Semiconductor Index has soared 64% and the S&P 500 has climbed 23%.\n\n-Tomi Kilgore; 415-439-6400; AskNewswires@dowjones.com \n\n", "score": 1, "replies": [{"body": "Why is he propping INTC before AMD? Seems like there is greater opportunity in AMD for capitalize on GPU and CPU market as opposed  to staying in one side.", "score": 3, "replies": []}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -2, "replies": []}]}, {"body": "Holy shit my limit buy of June 120 calls at $3.70 actually filled ", "score": 1, "replies": [{"body": "Those don't seem very solid right now though", "score": 3, "replies": [{"body": "Of course not, but plenty of time until strike to breathe. If we're still around 100 around April earnings then I'll have a serious problem", "score": 2, "replies": [{"body": "Fair enough. I'm giving it a few days before getting back into calls. I got wrecked this morning and sold at the open", "score": 1, "replies": [{"body": "Also fair enough haha. This is my first time buying anything NVDA since the $50 days", "score": 1, "replies": [{"body": "nah you're good, 99% this bounces back to ~$110-115 by next ER", "score": 2, "replies": []}]}]}]}]}, {"body": "Nice move.", "score": 1, "replies": [{"body": "Thanks haramBae. Nothing like some emotional, mean reversion options plays", "score": 1, "replies": []}]}]}, {"body": "$stock NVDA", "score": 1, "replies": []}, {"body": "crashed through 50ma and it's a long way down to 200ma, major momentum loss, solid competition (AMD, INTC)\n\nthose aren't buy signals to me, I'd wait to buy calls", "score": 1, "replies": []}]}
