{"title": "Anyone wants to ask questions about Chinese stocks?", "selftext": "[deleted]", "id": "77mfpi", "created_utc": 1508509796.0, "score": 39, "upvote_ratio": 0.82, "num_comments": 122, "comments": [{"body": "What do you think of BSTI? ", "score": 22, "replies": [{"body": "I'm not very familiar with this supply chain company. I know its existence, but in China we tend to use other companies such as SF more. I see that Baba invest a lot of money in BSTI, but I don't see any chance it would dominate the supply chain market very soon. They got too many competitors out there. ", "score": 2, "replies": [{"body": "Thanks for the info & much appreciated. ", "score": 1, "replies": [{"body": "My pleasure :)", "score": 1, "replies": []}]}]}, {"body": "This.", "score": 1, "replies": []}]}, {"body": "Thoughts on Tencent? Naspers has a large stake in them and Tencents growth has been pushing Naspers price through the roof. Its actually causing some concern here.", "score": 5, "replies": [{"body": "Please see my other comment. ", "score": 2, "replies": []}]}, {"body": "What about Chinese Electric Vehicle companies? Kandi and BYD Company", "score": 4, "replies": [{"body": "Please see my other comments. ", "score": 1, "replies": []}]}, {"body": "BSTI?", "score": 5, "replies": [{"body": "Please see my other comments.", "score": 1, "replies": []}]}, {"body": "What about BZUN? Any opinions on that? Are they catching on?", "score": 3, "replies": [{"body": "I've been told BZUN is like the Chinese SHOP. Its not big yet so I don't expect most people to know of it. I just heard of it recently myself.", "score": 3, "replies": []}, {"body": "I have never heard of them before you asked me that question, so I guess it answers the question.", "score": 5, "replies": [{"body": "Lol thanks", "score": 5, "replies": [{"body": "There are plenty of companies that the average person has not heard of that make large amounts of money. Just because he hasn't heard of BZUN doesn't make it a bad investment. \n\nI'm not saying it's a good investment either. \n\nDisclaimer: BZUN is ~0.5% of my Robinhood portfolio, 0% of my retirement accounts. ", "score": 3, "replies": [{"body": "I agree with you that there are plenty of companies that average people have never heard of and make large amounts of money. For me, it's TTD. I hold a lot of TTD stocks. But I just don't know about Baozun. And its Chinese website looks sketchy to me. However, I'm kind of offended that you assume that I am a \"he\" but actually I'm a \"she\". ", "score": 2, "replies": []}]}]}, {"body": "Growing company. Alibaba invested massively in Baozun, I believe they still have over 30% of the company.", "score": 2, "replies": []}, {"body": "You're here giving advice on Chinese companies and you don't know about BZUN.? LOL. ", "score": 0, "replies": [{"body": "I'm not giving advice, I'm new to the stock market, I'm just simply answering questions about companies I know. Just go ahead ask any Chinese about BZUN, see if anyone knows it. And btw, it's not a bad idea to respect others, and I definitely know more about Chinese companies than you.", "score": 0, "replies": [{"body": "Lol. You know nothing about me, and I heard about BZUN for my Chinese roommate. From what I've read ITT, your \"advice\" has been awful. I RES tagged you as \"AdviceFraudster.cn\".", "score": 1, "replies": [{"body": "Cao Ni Ma!", "score": 1, "replies": []}, {"body": "Oh I see you have a Chinese roommate so you think you know more than a real Chinese. Funny. And let me say it again, I'm not giving advice, I'm answering questions. You could just leave if you think my \"advice\" is awful. And btw, I feel sad for people who are around you because how awful you are as a human being. \n\nIn Chinese, we call people like you 傻逼，蠢货，恬不知耻的网络喷子. Ask your Chinese roommate what I mean. ", "score": 1, "replies": [{"body": "Many of you're (mostly bad) answers imply advice.      \n      \nI mentioned my roommate only because you said Chinese people don't know about BZUN -- not to imply any knowledge of anything further. You assumed I meant more, which only makes you appear an ass. Ask your American friends what that means.      \n     \nAnd, sure, I could just leave and let you spew falsities, but that sort of cowardice in our culture is what made Trump president. Calling bullshit bullshit is important. If you walk away, it lets bullshitters trick the young and naive.", "score": 1, "replies": [{"body": "You could just say whatever you want or try to shut me down but I will keep sharing my thoughts. You call me bullshit and I am just gonna be louder. At least I'm contributing my thoughts while you are merely criticizing others. And please get your facts straight, I never gave advice, I answered questions. ", "score": 1, "replies": [{"body": "Critique is contribution. Preventing the spread of bad ideas is equally as important as promoting good ideas.               \n      \nRegarding:    \n    \n> ...get your facts straight...     \n         \nBy \"answering\" a question like, \"I would bet on BABA\" (your words from another comment ITT), it implies that you \"advise\" others to bet on BABA. That is essentially giving advice, hense my statement:        \n    \n> Many of you're (mostly bad) answers imply advice.      \n      \nThat isn't to say people shouldn't (or should) bet on BABA; I am simply illustrating that you can disguise \"advice\" as \"answers\" all day as loud as you want. I'll still call it bullshit when it is, and I'll do it just as loudly. Good day, sir. ", "score": 1, "replies": [{"body": "I don't just go there to give the \"advice\" you stated. I answered their questions when they ask me which stock I prefer. Another example of your stupidity is that you assume I'm a \"sir\" while I'm not. ", "score": 1, "replies": [{"body": "Lol. You're still arguing the Answers/advice angle? ...and calling me stupid? ...k.      \n    \nAnd, now you're resorting to the \"you assumed my gender\" bullshit. Pathetic. ", "score": 1, "replies": [{"body": "Say whatever you want but it doesn't change the fact that you called me \"sir\". If that is not assuming my gender, I don't know what is. I don't want to argue with you because you are not worth my time. For me, you are nothing but a hater, a troll, a pathetic human being, and a sexist. Just like you said, calling bullshit bullshit is what matters, and now, i'm calling your assuming my gender and not admitting it play a typical and pathetic patriarchy example. \n\nI'm not gonna reply to anything you write anymore. Your bullshit is something I don't need. I'd rather go watch Trump on telly than reading your hateful comments. At least he bullshit around with his face and his name out there, and you, you are nothing but a hater hiding behind \"gizamo\". ", "score": 0, "replies": [{"body": "I said, \"Good day, sir\", which is an joke from Charle and the Chocolate factory and memes all over Reddit all the time. Jfc, you're the most ridiculous person I've met on Reddit since trolling t_d during the elections, and most of them were Russian shills and bots. Wow. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "BZUN is partially owned by BABA (I believe it's about 24% ownership).  The company provides end-to-end e-commerce services for international brands looking to penetrate the Chinese e-commerce market. It has often been called the Chinese Shopify.\n\nhttp://www.barrons.com/quote/stock/us/xnas/bzun\n\n\n\n", "score": 2, "replies": []}]}, {"body": "I tend to stay away from Chinese stocks because of any one of them only exist at the pleasure of its all powerful regulators, what are your thoughts on that? If any of these upsets the party they could get shut down and replaced the next day no? Or do you think some of these names are \"too big to fail\" or too entrenched in party politics?", "score": 2, "replies": [{"body": "I definitely think Baba and Tencent are too big to fail. I admit there is regulation and censorship in China (which I hate very much), but I don't see the Chinese government would shut down the companies and replace them the next day. For example,they tried to promote their own version of \"Weibo\" but eventually failed. My generation is not like our parents. We grew up using these companies I mentioned everyday, and we rely on them. Shutting them down would just make the society unstable. ", "score": 2, "replies": [{"body": "I liked your comment about Baidu... and that's my take on these tech companies -- they thrive in a regulatory bubble -- these companies wouldn't otherwise survive in a true competitive environment vs. Google or Amazon (Baidu or Baba) because they imitate instead of innovate. Are there any tech companies with any products / services you feel are truly new, i.e. ahead of international competition?", "score": 1, "replies": [{"body": "Baidu definitely, but baba is not purely existing in the regulatory bubble. Chinese manufacturing has always needed a more direct outlet to the general public; alibaba is able to fully represent the bulk of China's production capability. ", "score": 1, "replies": []}]}]}]}, {"body": "What's your opinion on TAL and HTHT?", "score": 2, "replies": [{"body": "Oh my gosh, I thought I was the only one that knew about TAL.  Not OP, but I love them.", "score": 2, "replies": [{"body": "Same! Would love to hear OPs take on TAL and EDU. ", "score": 1, "replies": []}]}]}, {"body": "You are such a good person for doing this - thanks!\n\nCan you explain why Weibo's stock has been having a hard time for the past month? :)", "score": 2, "replies": [{"body": "Bra it went up 60% last 3 months ", "score": 2, "replies": []}, {"body": "Yeah they had their rise in past three months. I think what they are facing now is a healthy pullback.", "score": 1, "replies": []}]}, {"body": "What about SINA? One of my realtor friends dealt with a high profile CXO at SINA who was buying investment properties in the US (Boston specifically). I was told its a solid buy through this contact but I am not quite sure yet. Any thoughts?", "score": 2, "replies": [{"body": "Well Sina does own a huge portion of Weibo. But other than Weibo, Sina hasn't presented anything innovative in a long time. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I think Baba is a better company in terms of its business diversity, but the price is a little bit high. If I don't have to think about the price, I will bet on Baba. ", "score": 1, "replies": []}]}, {"body": "Wechat, and tencent holdings?", "score": 1, "replies": [{"body": "Basically no one texts anymore in China. Everyone uses WeChat. But WeChat has the same problems like Weibo, the censorship. WeChat is trying to build its own social media ecosystem, but since it is a closed social media, it is not as influential as Weibo. Tencent is also famous for its video game industry. It owns the most popular mobile game King of Glory, which has more than 200 million players.", "score": 3, "replies": [{"body": "Is the payment functions of wechat popular? ", "score": 2, "replies": [{"body": "Yeah it is popular but people tend to use Baba more. Wechat is a closed ecosystem, which means you can't pay people you don't friend. ", "score": 2, "replies": [{"body": "I've heard rumors regarding tencent partnering with baba. Could you confirm?", "score": 1, "replies": [{"body": "I will be surprised. They are rivals in terms of the paying tool.", "score": 1, "replies": []}]}]}]}, {"body": "How big Tencent gaming is? I know they own LoL, which is huge here too, and has the biggest esport attraction in the world. Is this a good enough reason to invest them? Or just go on BABA instead. Thanks", "score": 1, "replies": [{"body": "They also own King of Glory, which is the most popular mobile game in China. Tencent and Baba are both good companies. They benefit a lot from the government regulation.", "score": 1, "replies": []}]}]}]}, {"body": "Are there any major Chinese companies currently utilizing, or talking about getting on board with blockchain technologies? ", "score": 1, "replies": [{"body": "Not any big ones I'm aware of. It is highly regulated by the government. There is a online lending company called Qudian just launched their IPO. However, from what I heard, it is a fraud company and could be regulated anytime soon.", "score": 1, "replies": [{"body": "Yeah I know that there's a lot of regulation talks on the ICOs and crypto exchanges, but wasn't sure if there was any actual talks around things like NEO or QTUM. ", "score": 1, "replies": []}]}]}, {"body": "Bought Nov 10. $180 4 calls. For all the single men and women ", "score": 1, "replies": [{"body": "Good luck to you!", "score": 1, "replies": []}]}, {"body": "Thoughts on HTHT? I personally think it has room for lots of growth and will continue going up, but wanted your opinion as well.", "score": 1, "replies": []}, {"body": "Any opinions on JP?", "score": 1, "replies": []}, {"body": "Do you think the censorship will be Weibo's downfall or is everyone kind of brushing it off because there's no alternative. ", "score": 1, "replies": []}, {"body": "I used alixpress for the first time this month (I live in the  US). Terrible experience and customer service. Demonstrated how behind alibaba is  behind western ecommerce sites like Amazon. Yes they have tons of stuff for cheap but they lost a potential customer. No way I'm investing in them.", "score": 1, "replies": [{"body": "more info about the experience?", "score": 1, "replies": [{"body": "Made a purchase and decided I did not want the item ,within in an hour I was trying to cancel which is impossible. SO I contacted support a few times, getting bounced around, telling me they would take care of everything and contact the seller and I would not be charged anything. That did not happen, seller still shipped the item and refused to cancel the order and refund me. He offered a $1 discount on my next purchase, eventually got him to take $2 off my order. I could understand if I wanted to cancel the order days into the process but I tried cancelling 15 minutes after buying. \n\nCompared to Amazon where they try to do everything to help the customer whether it be returning broken items, refund or cancelling order in a timely fashion, Alixpress is way behind. I think it's more of a cultural problem/difference, but Alibaba wants to expand globally and they need to change the way they interact with customers. I understand they probably don't give a shit what's one customer when they have close to 2 billion in China alone but that is going to hurt them in the long run. ", "score": 1, "replies": [{"body": "How much cheaper was the item on Aliexpress rather than Amazon?  Aliexpress doesnt care, they are selling quantity over quality.  In fact Im pretty sure >60% of the stuff sold on amazon is bought off of aliexpress or similar site.  ", "score": 2, "replies": [{"body": "Amazon didn't have it. It was a Chinese phone but Ebay had it as well. Went through them and it was cheaper. ", "score": 1, "replies": []}]}, {"body": "What do you mean it is impossible to cancel an order? It's just like Amazon and any other site. You go to your account, go to the order and click cancel. Cant get more straight forward than that.\n", "score": 1, "replies": [{"body": "Nope. They had to contact the seller and he didn't do anything. In the end I got charged for the full product. I am waiting to see if the seller give me my $2 refund.", "score": 1, "replies": []}]}]}]}, {"body": "Can I just say that Alixpress and Taobao are totally different two websites and companies....", "score": 1, "replies": [{"body": "Both are owned by Alibaba", "score": 1, "replies": [{"body": "But in China not many people use Aliexpress. Taobao is the company you should look at. ", "score": 1, "replies": []}]}]}]}, {"body": "I am currently holding MOMO WB CQQQ CWEB\nCan you give me some suggestions?\n\nThanks.", "score": 1, "replies": [{"body": "I can't give you many solid suggestions because I'm not an expert. But I personally don't like MoMo, it has so many competitors and people don't use it anymore. ", "score": 1, "replies": []}]}, {"body": "Yeah I want to know exactly how fudged are chinese numbers? Both economy as a whole and at company level.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "YY was a huge hit in China but now there are many streaming live companies out there and YY has lost is domination.", "score": 2, "replies": []}]}, {"body": "I love Baba, Tencent and am pretty high on Baidu and JD personally. \nIs there any other chinese stocks I should take a look at?\n\nThese are my top 4. I invest about 30-40% of my money into Chinese stocks.\n\nActually the 2x ETF I am holding has these holdings and tbh I don't know much about them outside of the ones I mentioned XD:\n\nAlibaba Group Holding Ltd\t10.61\nTencent Holdings Ltd\t10.57\nBaidu Inc\t9.06\nJD.com Inc\t5.68\nTAL Education Group\t5.47\n58.com Inc\t5.05\nAutohome Inc\t4.82\nCtrip.com International Ltd\t4.78\nWeibo Corp\t4.50\nSINA Corp/China\t4.26", "score": 1, "replies": [{"body": "Wow you do love Chinese stocks! I only invest in companies in familiar with, so I'm afraid I can't give you much advice. But I would say keep an eye on Ctrip, be aware. it has a bad reputation in China and just had a huge fraud scandal. ", "score": 1, "replies": []}]}, {"body": "Any information on SMI?", "score": 1, "replies": [{"body": "I'm sorry I'm not very familiar with that company. ", "score": 1, "replies": []}]}, {"body": "Thank you very much! It was interesting to read your post. \nWhat do you think of NTES?", "score": 1, "replies": [{"body": "Thank you! Please see my other comments. ", "score": 1, "replies": []}]}, {"body": "Chinese Insurance companies...apparently a growing market. Also wealth management firms like JP.. any others like this? Any leaders you recommend? What about FANH for life insurance? (not JD)", "score": 1, "replies": [{"body": "I'm not very familiar with insurance companies, but the most popular insurance company in China is PingAn.", "score": 2, "replies": [{"body": "Its name is very apt.", "score": 1, "replies": [{"body": "PingAn means “safe” in Chinese.", "score": 1, "replies": [{"body": "Yes, I know. I speak a bit of Chinese. \n\nI meant that it's name is very appropriate. Hilariously so.", "score": 1, "replies": [{"body": "I guess that's what made it most popular in China. (Just kidding) ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What are some popular trendy fashion brands in China?", "score": 1, "replies": [{"body": "We don't have huge trendy fashion brands like Zara, Madewell, HM. Because we have small business on Taobao (owns by Baba). Most of my friends buy clothing from Taobao or foreign websites. ", "score": 1, "replies": []}]}, {"body": "Thoughts on tencent. Specifically WeChat as a competitor to AliPay?", "score": 1, "replies": [{"body": "Tencent has the biggest online chatting apps (WeChat and QQ) and the most popular mobile phone. WeChat is a competitor to AliPay, but WeChat is a closed ecosystem which means you could only pay your friends, while on the other hand, AliPay is much easier and open. I personally prefer AliPay and put all my money in AliPay instead of bank. ", "score": 1, "replies": []}]}, {"body": "I Ignore Chinese stocks. Been there, learned it. Fuzzy quarterly reporting- unreliable economic government data. Strange accounting practices which are legal, total government control over the market.   ", "score": 1, "replies": [{"body": "Well I think you are being kind of judgmental. I am not a huge fan of Chinese government, but I would say the economic development in China is not \"fake news\". We have our weak spots, but we are also much more ahead of America in terms of infrastructure, online payment platforms, and even education in some sort. Just be open-minded. You can ignore Chinese stocks, but you can't ignore Chinese markets. ", "score": 1, "replies": [{"body": "True. To back this up, the Chinese have had a huge effect on copper futures a couple weeks back. Not sure what happened because I don't trade futures, but savvy traders made a lot of money shorting those. ", "score": 1, "replies": [{"body": "Thank you for your info. I don't trade those either. As I said, we live in a globalized world that we are all connected. It's always good to take a look on other markets.  ", "score": 1, "replies": []}]}]}]}, {"body": "Thought on IDCBF ..interesting stock to me ", "score": 1, "replies": [{"body": "I'm not really sure which stock you are referring to. Can you be more specific? ", "score": 1, "replies": [{"body": "Industrial and commercial bank of China Ltd ..is the name ", "score": 1, "replies": [{"body": "Oh it's 工商银行\nI'm not sure about its cash flow or anything else, I'm not an expert. I could only say the customer experience is not very good. For me, it sucks just like how Bank of America sucks (again, in my opinion) ", "score": 1, "replies": []}]}]}]}, {"body": "I am trying to buy utility companies outside the U.S. what do you think about HNP, what is the best Chinese utility? Also with the one belt one road project coming up what are some large and stable Chinese construction/infrastructure companies? Thank you for your help and time.", "score": 1, "replies": [{"body": "I'm not really familiar with the energy, construction , and infrastructure companies. But one thing I'm certain is the energy business is controlled by government in China. So HNP would not have many competitors domestically. ", "score": 1, "replies": []}]}, {"body": "How stable is $JD now?  At a peak or still a sound investment? ", "score": 1, "replies": [{"body": "I hold near 100 stocks in JD. I don't think it is at a peak, it was at a peak in August.", "score": 2, "replies": []}]}, {"body": "What do you think of NetEase/163.com?", "score": 1, "replies": [{"body": "163.com was a big thing when I was a kid, but now it's just mediocre. NetEase has definitely lost its battle with Weibo in social media, but now it is expanding its business to online shopping. I heard good things about its online shopping service, but I am still skeptical at this point. ", "score": 1, "replies": [{"body": "NetEase is making a lot of money with gaming. It is one of Tencent competitors", "score": 1, "replies": []}]}]}, {"body": "If you’re still around, I’d like to hear your thoughts on BYD ($BYDDY). Do they have a very wide moat in the EV market? Any threat from further $TSLA expansion or other automakers?\n\n", "score": 1, "replies": [{"body": "BYD is definitely going somewhere. In China, or at least in the city I'm from, the government will give you something like \"tax cut\" if you buy EV or hybrid cars. Tesla is cool but it's way more pricey for Chinese people. Last time I checked, a tesla is near 1 million Yuan (because of the import tax)", "score": 2, "replies": [{"body": "What about Zhidou or BAIC ?", "score": 1, "replies": [{"body": "Zhidou's sale ranked the third in Chinese EV market in September. ", "score": 2, "replies": [{"body": "Sorry I should of been more precise. What I'm more interested in learning is how do you think Chinese people view the brand. To me the vehicles look kind of ugly and funny. But that might not be the case there. Thank you for your insight.", "score": 1, "replies": [{"body": "I have to be honest that it is not a very popular brand. When Chinese (people I know)  talk about EV, we mean BYD or Tesla.   And for me, their cars look cheap and sketchy, but I'm not an expert interested in cars, so I could be wrong. ", "score": 1, "replies": [{"body": "Okay thank you. This is really useful, because it is hard to know how people see brands in China when you don't actually live there. I was trying to see which companies could actually compete with Tesla there.", "score": 1, "replies": [{"body": "Then I would definitely say BYD. Their sale ranked the first in September. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Just an update from today's news. Tesla is going to build a new factory in my hometown Shanghai. Think about the 25% tax tariff. I think it's a good news. ", "score": 1, "replies": [{"body": "That’s good news! For $TSLA investors. I think Tesla is being smart about things — after learning lessons early on — and is building infrastructure while also cultivating the right relationships in China. $TCEHY has a 10% stake in $TSLA and I’m long both.", "score": 1, "replies": [{"body": "And if any city in China is up for EV, Shanghai is definitely the one. ", "score": 1, "replies": [{"body": "Thanks! :)\n\nThe NY Times is also reporting on this today: https://www.nytimes.com/2017/10/22/business/tesla-plant-in-china-may-be-a-first.html", "score": 1, "replies": []}]}]}]}]}, {"body": "This might be a little personal and a bit off topic, but what kind of US stocks are you following? Also, do you think any US companies have an effect on the Chinese market or vice versa?", "score": 1, "replies": [{"body": "I personally love tech stocks - Netflix, TTD, PayPal, and others. I only follow companies that I'm familiar with. But I also love BA, as my long-term investment. US companies definitely have effect on the Chinese market in many ways. For example, Starbucks is one of the biggest coffee retailers in China. Although the regulation in China is influential, Chinese economy is still impacted by the global market. We live in a globalized world and we are all connected. ", "score": 1, "replies": []}]}, {"body": "Does China have their own Elon Musk?", "score": 1, "replies": [{"body": "I would say Jack Ma. In China, we call him Papa Ma.", "score": 1, "replies": []}]}, {"body": "Solid pump job OP", "score": 0, "replies": []}]}
