{"title": "Should I invest in Netflix?", "selftext": "", "id": "8wfhky", "created_utc": 1530835772.0, "score": 7, "upvote_ratio": 0.71, "num_comments": 13, "comments": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Disney is way undervalued but I doubt it ever getting to where it should be any time soon so I'm all for Netflix instead. Disney will EVENTUALLY climb, but nowhere as much as Netflix. \n\nBut so far the only stats that matter are this...in the last 3 years, Disney is DOWN 5%. It hasn't risen in 3 years. \nNetflix the last 3 years...up just over 400% \n\nSeriously. If you invest $10,000 is Disney 3 years ago, you would have $9,500 now. \n\nIf you invest $10,000 in Netflix 3 years ago you'd have over $40,000. ", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "The investing public doesn't care. These posts about Disney have been non stop the past 3 years and nothing has changed or got better even with all the future endeavors. Never got priced in or rose up. People keep saying Disney is a great long term stock, maybe if you hold for 20+ years, but there are still a lot better choices. \n\nDisney prints money. Blockbuster movies constantly. The rights to Star Wars. Theme parks always crowded. Merchandise everywhere. One of the biggest, most known, and most profitable companies in the past 50 years...but their stock price has sucked the last 3 years. Yes the 5 years before that was good, but the history before that wasn't good either. \n\nDisney is like Coke. Just because it's one of the most known and profitable companies in the world...it doesn't mean it's stock price is going up. It should. But I can't explain it. We live in a world now when a meaningless tweet can tank the indexes 1.5%\nBut when Disney only went up 2% in 2017 with the news of their future prospects and billion dollar movies while everything else rose a lot more, you know investors simply don't like it. \n\nDisney SHOULD be higher. Especially when comparing to Netflix. But right now, if you had $10,000 to choose between Disney and Netflix...would you seriously choose Disney?\n\nI could maybe see an argument for 20+ years from now, but for 1,5,10,15 years from now...do you honestly think Disney will have a higher percentage gain than Netflix?\n", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I had Disney for nearly 5 years. It was one of my first and longest held stocks. I got rid of it late last year and put it in Netflix when it was still under $200. I now recently doubled my money in that short of time. If I would have held on to Disney, I'd be down. I could be down about 3%...but instead up just over 100%. \n\nWill Netflix's amazing rise continue to stay as sharp as it has been? Probably not. Rarely do great gains keep going up so high and consistent so I expect a pull back eventually, but not a huge one, and not for a long time. \nMainly because...think of all the people that have Netflix. Think of all the young adults getting their own places about to start a new Netflix account. It's a monthly payment, one that will most likely go up, that a large majority of people world wide have. \nOther than watching ESPN, I rarely support a Disney related thing throughout the year. A lot don't. I bet there are more people that pay for a monthly Netflix account than see a superhero movie or go to Disney theme park each month or year. \n\nNetflix will have more competition in the future and I believe die down a bit in the future, but I've made more off Netflix in 7 months than Disney would make in their 3 best years. The only way I would ever regret switching to Netflix stock from Disney is if/when Disney reaches $225 a share and Netflix stays at $400. \n\nIf that I ever happens, then I made a mistake and you are right. Thing is...I don't ever see this happening. \n\nEdit-Good day in the markets today. Too bad Disney went down .5% while Netflix went up another 2.5%. Disney can't even break even on good market days and Netflix always doubles what the Nasdaq does. Just do yourself a favor and come over to Netflix. Don't bother wasting your time and money with Disney until you actually see it trend up for at least a month. ", "score": 0, "replies": []}]}, {"body": "Not before 20 years but Netflix is burning money like no other. I’d personally hold Disney for 20 years. ", "score": 1, "replies": []}]}]}]}, {"body": "Thank you!", "score": -1, "replies": []}]}, {"body": "I would say no. The competition Netflix has is only getting larger. Amazon video is becoming very popular and Hulu is growing very fast. The time to invest in Netflix has been gone for some time now. ", "score": 2, "replies": []}, {"body": "Amazon Prime has better options. Not more, but better. Quality over quantity. Prime is also 10x better for kids with a lot more options. ", "score": 1, "replies": []}, {"body": "YES.\nthey continue to dominate in industry and getting into one of the larger content producing positions. ATnT or Comcast or one of these giants is going to have to buy them someday", "score": 1, "replies": []}, {"body": "Short answer yes.... look at the options chain for 2-3 years down the road... insane! ", "score": 0, "replies": [{"body": "Awesome thanks :)", "score": 0, "replies": []}]}, {"body": "10/10 Great question", "score": 0, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "if investors have been pumping it up, when does it dump?  They have been pumping for like 6 years.\n\nIQ has been here for like 6 weeks...", "score": 1, "replies": []}, {"body": "The last time I checked IQ wasn't installed on every TV/media device made in the last 5-6 years.\n", "score": 1, "replies": []}]}]}
{"title": "Bear Market of 2000-2002", "selftext": "Were you any of you guys trading during this period? I only have been trading since last year and am wondering what it was like trading during this long down period after the exuberant late 90's.  ", "id": "8wgwmd", "created_utc": 1530848748.0, "score": 3, "upvote_ratio": 0.71, "num_comments": 11, "comments": [{"body": "Imagine not having your phone to get out of your position. Like being at work and using slow ass dial up connection to trade. I wasnt trading but fuck could you imagine ", "score": 26, "replies": [{"body": "The funny thing is we’d all probably be richer, no Robinhood so no options and we would actually have to think about our trades before going through with them", "score": 14, "replies": []}, {"body": "DSL was a thing then", "score": 2, "replies": [{"body": "As was cable internet, T1 and T3.", "score": 1, "replies": [{"body": "Exactly ", "score": 2, "replies": []}]}]}]}, {"body": "Honestly we are probably going to know here pretty soon. Having something similar to 2000-2002 in the next year would probably be a good thing rather than let the market build up to Dow 30k and then fall from a greater height. Having a stock market drop without a full-blown recession would be a good thing IMO.", "score": 11, "replies": [{"body": "That sounds less profitable", "score": 2, "replies": [{"body": "Yeah but I’d rather push the next recession another 10 years down the road rather than have it now.", "score": 3, "replies": []}]}]}, {"body": "You’re going to relive the experience soon enough, no need to ask ", "score": 8, "replies": []}, {"body": "Had to go to the public library to day trade because there were no mobile apps and bossman was always in the area.  YOLO’d DIA puts at the bottom and had my face ripped off.", "score": 3, "replies": []}]}
{"title": "Short TSLA - Tesla made over $2 billion in China last year", "selftext": "[removed]", "id": "8wid80", "created_utc": 1530864861.0, "score": 29, "upvote_ratio": 0.82, "num_comments": 10, "comments": [{"body": "[removed]", "score": 16, "replies": [{"body": "Also, Hong Kong cut back on EV subsidies. The region as a whole should see sales decline ", "score": 6, "replies": []}, {"body": "This is exactly like in Silicon Valley when Jin Yang gets kicked out of the US. He moves to China and is forced to innovate instead of steal. Long China bois.", "score": 2, "replies": []}, {"body": "So long uxin?  Got it. ", "score": 1, "replies": []}]}, {"body": "Lots of reasons to short TSLA. So hard to pick just one. ", "score": 16, "replies": [{"body": "So many reasons to long when so many short", "score": 7, "replies": []}, {"body": "I can't think of any reasons. ", "score": 1, "replies": []}]}, {"body": "Positions or ban. Why do you even bother posting this basic bitch trading strategy? It's probably the least original trading idea on earth", "score": 9, "replies": [{"body": "Good one, Gordon Gekko", "score": 1, "replies": []}]}]}
{"title": "SHORT SQUEEZE OF THE CENTURY HAPPENING TODAY !", "selftext": "Elon said it would happen in 3 weeks, 3 weeks ago.  This is the day boys I’m so excited thank u Elon I put all my money in Tesla calls I’m going to be rich !!!! ", "id": "8wil6t", "created_utc": 1530867774.0, "score": 29, "upvote_ratio": 0.87, "num_comments": 14, "comments": [{"body": "Proof or ban, faggy!", "score": 22, "replies": [{"body": "https://mobile.twitter.com/elonmusk/status/1008450201885872129?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed&ref_url=https%3A%2F%2Fd-34312568731789053496.ampproject.net%2F1530567757224%2Fframe.html\n\nNo Tendies for you", "score": 6, "replies": []}, {"body": "It's legit. I'm too lazy to scroll through all his tweets though ", "score": 1, "replies": []}]}, {"body": "Down 0.5 is a short squeeze? Bruh save some chromsones for the rest of us", "score": 11, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Hope so. I put a strangle on yesterday. ", "score": 4, "replies": []}, {"body": "What’s eod ", "score": -17, "replies": [{"body": "end of day you pleb", "score": 33, "replies": [{"body": "What’s pleb ", "score": -13, "replies": [{"body": "you", "score": 39, "replies": []}]}]}, {"body": "Watch Hurt Locker 7 or 8 times and take notes", "score": 7, "replies": []}]}]}, {"body": "Down 1.5% PM. Hell of a short squeeze", "score": 3, "replies": []}, {"body": "He said \"about 3 weeks.\" It was the production report, dumbass, which sucked.", "score": 3, "replies": [{"body": "I thought Elon was taking us to mars 😢", "score": 1, "replies": []}]}]}
{"title": "Anyone playing Comcast", "selftext": "Thesis is with DIS getting the nod to acquire Fox and hoping Comcast does not put on another bid. Looking to see them rally over the next few months with PT of $38.\nI believe the Fox board votes in mid July right now.\nAny thoughts for or against the position? \nHave Jan 35 calls ", "id": "8wjn8d", "created_utc": 1530879885.0, "score": 6, "upvote_ratio": 0.75, "num_comments": 11, "comments": [{"body": "Nah comcast is the scummiest company on earth even if it’s a good play", "score": 9, "replies": [{"body": "Ethics in wsb? Get out of here.", "score": 6, "replies": [{"body": "I will literally buy any other company but them. I just dont think ive ever hated anything more than comcast", "score": 2, "replies": [{"body": "Seconded. I’d buy private prison stocks before I bought Comcast. They’ve jerked me around 10 ways til Sunday. ", "score": 3, "replies": []}]}]}, {"body": "They are scummy but it is a good play. ", "score": 2, "replies": []}]}, {"body": "I've had $34 calls for a while, started with 7/20's and have slowly been taking profits when they hit ITM and reinvesting in longer expirations. Definitely a great play but Id wait for the price to dip again which it probably will and check options prices because IV might be high now because of the shareholders meeting. Definitely the least retarded investment I've made all summer though would reccomend if you can find a good entry point. \n\nEdit: Jan 35 calls you will be all set, I think now they will make a bid for Sky at most but it seems they're having trouble coming up with funding for another bid. I don't think they were expecting Iger to flop his cock on the table the way he did with that counter bid. ", "score": 3, "replies": []}, {"body": "I'm long 1,700 shares. Definitely think it's going back up unless they bid for another company. ", "score": 1, "replies": []}, {"body": "I got some 10/19 $40 Calls ", "score": 1, "replies": []}, {"body": "No but comcast is playing me", "score": 1, "replies": []}, {"body": "Have ‘20 calls. People may hate them, but they use them. \nI like Charter Communications more though. Better fundamentals and less PR snafus. ", "score": 1, "replies": []}, {"body": "Buy puts on $DIS, sell puts on $CMCSA.", "score": 0, "replies": []}]}
{"title": "$TSLA down 1,65% in the premarket. $280 eod hype", "selftext": "[removed]", "id": "8wk0j8", "created_utc": 1530883266.0, "score": 3, "upvote_ratio": 0.67, "num_comments": 11, "comments": [{"body": "Your cant lose money on TSLA under $300 or so they say. ", "score": 5, "replies": []}, {"body": "Please stop, Tesla. I feel bad making all this money on puts ", "score": 3, "replies": []}, {"body": "I put all my money in 265 puts expiring today. I've got a good feeling.", "score": 7, "replies": [{"body": "Lube that anus and prepare for a victory fuck", "score": 7, "replies": []}, {"body": "I suppose the day is still young.", "score": 2, "replies": []}, {"body": "How's that going for ya?  I'm pretty sure this week's dip is just big-shorts conning little-shorts in to keeping the game up so they can cover their disastrous positions.", "score": 1, "replies": [{"body": "Mostly a jab at how everyone here had SPY puts expiring today. I tend to like my contracts ITM and a couple months out.", "score": 1, "replies": []}]}]}, {"body": "All put holders will get a Lambo by market close.", "score": 2, "replies": [{"body": "wouldn’t it be something to make so much money off TSLA puts that you can buy a model 3?", "score": 1, "replies": []}]}, {"body": "If it breaks through 300 we are going to two fiddy boys.", "score": 2, "replies": []}, {"body": "Cool. I sold $280 7/13 calls. ", "score": 0, "replies": []}]}
{"title": "Russian guy murders his friend over argument about which graphics card is better: nVidia or AMD", "selftext": "", "id": "8wkvfy", "created_utc": 1530890142.0, "score": 14, "upvote_ratio": 0.73, "num_comments": 10, "comments": [{"body": "Looks like the guy who liked NVDA murdered AMD guy\n\nLong NVDA, apparently they know how to take care of competition", "score": 12, "replies": []}, {"body": "Happened a year ago and the guy only got 9 1/2 years. Lol wtf. ", "score": 8, "replies": [{"body": "Russia", "score": 1, "replies": []}]}, {"body": "Well the nVidia guy was right so you cant really blame him", "score": 3, "replies": []}, {"body": "mods", "score": 4, "replies": []}, {"body": "Guy got a 9 year sentence; so he’ll know which is better at the end. ", "score": 2, "replies": []}, {"body": "Only 9 years too, wtf... I guess Russia agreed that NVDA is better then AMD ", "score": 2, "replies": []}, {"body": "r/WTF", "score": 1, "replies": []}, {"body": "Gaming is serious business. ", "score": 1, "replies": []}]}
{"title": "Thoughts on bullish SBUX?", "selftext": "", "id": "8wmb4a", "created_utc": 1530900449.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 11, "comments": [{"body": "I have calls so I’m bullish. I mean it was above 60 so it should go back there. Right?! That’s all my DD ", "score": 12, "replies": [{"body": "I hope those calls are far out or not that high.  Price is ~$10 below 180 day SMA and 18 day EMA is pointing down.  Could bounce up a couple of dollars to the EMA, but the only way this bounces back up to 60 soon is if they announce Elon as CEO", "score": 3, "replies": [{"body": "I wouldn’t rule this out, a lot for him to innovate in the coffee industry ", "score": 2, "replies": []}]}, {"body": "Seems like they gotta recover, they still sell a ton of coffee.  Plus the nitro brew did well.", "score": 1, "replies": [{"body": "The nitro cold brew is amazing", "score": 1, "replies": []}]}]}, {"body": "Does anyone know the bearish side? I'm thinking of maybe placing calls and wanna see the full picture ", "score": 0, "replies": [{"body": "I've said this a dozen times, stay away from this stock\n\nThey are struggling, just closed stores and laid off employees\n\nNew CEO\n\nDon't catch the knife, or in other words, just because it was up, don't expect it to bounce back. This isn't dropping because of temporary news (ie, a hack), this is dropping because the company is beginning to struggle", "score": 4, "replies": []}, {"body": "I replied to a comment elsewhere.  Charts just dont look good.  Something drastic has to happen, else, best case scenario is this thing flattens out for awhile before it starts to tend up. ", "score": 2, "replies": []}, {"body": "New CEO, not a cool place to go anymore, tying business to SJW politics, weak management ", "score": 2, "replies": []}, {"body": "They're entering the Chinese market which can be good long term upside if they can prove their is a demand in the territory. Short term they are closing stores throughout the U.S. and have to compete with McDonalds and specialty cafes/coffee houses that are springing up which offer a comparable (some better, some worse) experiences to SBUX.\n\nI don't have a horse in the race but short term the stock has traded sideways and downward so I'd expect more of the same until we get closer to the end of year.", "score": 3, "replies": [{"body": "They're already in the Chinese market. They have announced an expansion I believe. ", "score": 1, "replies": []}]}]}]}
{"title": "$TSLA You can't make this shit up", "selftext": "[deleted]", "id": "8wn39f", "created_utc": 1530906426.0, "score": 0, "upvote_ratio": 0.48, "num_comments": 16, "comments": [{"body": "I remember from when I did my finance course at university that \"a safe dollar today is better than an unsafe dollar tomorrow\".\n\nHas this changed since 2015? ", "score": 11, "replies": [{"body": "Thought the same. The marshmallow test doesn't really apply in this case since we're not dealing with a risk-free security.\n\nAlso that quote is still accepted according to my corporate finance class currently in progress ", "score": 4, "replies": []}, {"body": "I don’t follow. It’s a deposit regardless, how does attaching it to a higher margin product make it less safe? ", "score": 2, "replies": [{"body": "Maybe he gets tired and walks away with it, making tesla get $0 instead of what he put down? \n\nhttps://www.investopedia.com/terms/t/timevalueofmoney.asp", "score": 4, "replies": [{"body": "Time value of money requires interest rate to make up the difference between $64k and $53K--it doesn't. And deposit is non-refundable. ", "score": 1, "replies": [{"body": "0% interest rate is still a interest rate, and where does it says its non-refundable? ", "score": 0, "replies": [{"body": "In the tweet? Also huge story about it last week? \n\nAlso that’s not how math works. ", "score": 3, "replies": [{"body": "That is how math works, it's called the trivial case.", "score": 1, "replies": [{"body": "Please show me that math. How does time value of money account for an $11k difference (~20% dif against base price) over a period of a few months when your interest rate is 0%. Hell make it 10%. \n\nEdit: shitty spelling ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "If a Tesla fanboy deposit isn't a safe dollar I don't know what is.", "score": 2, "replies": []}]}, {"body": "Dude remaking that car takes like 3 weeks for Tesla factory. Right call", "score": 5, "replies": [{"body": "Remake the car? Why not just give to the next person on the waitlist? ", "score": 4, "replies": [{"body": "Tesla may need someone like you. ", "score": 2, "replies": []}]}]}, {"body": "The chanosbots are on reddit now. Stealing customer deposits is bullish.", "score": 5, "replies": []}, {"body": "They should fire that fucking guy for the improper use of loose.", "score": 1, "replies": []}, {"body": "[Link to tweet ](https://twitter.com/Trillility/status/1015320390749573121)", "score": -2, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "8wn8xg", "created_utc": 1530907582.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 7, "comments": [{"body": "[deleted]", "score": 6, "replies": []}, {"body": "Can you tell me what application is that ??", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Really ?? It shows you orders ?! I thought it's just a practice tool. Are you aware of any other apps that show you the realtime orders coming as well as the charts,  that are more accurate ?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Thx.", "score": 1, "replies": []}]}]}]}, {"body": "Grindr", "score": 3, "replies": []}]}, {"body": "Think short sellers like the \"X days of losses in a row\" headline. Or it was a VWAP sell, booked at EOD.", "score": 2, "replies": []}, {"body": "Elon gets margin called because he bought his own stock too high. Classic. ", "score": 1, "replies": []}, {"body": "Elongated Muskrat had to sell some shares to pay back JPMorgan in order to not get Tesla foreclosed for the 48th time this month.", "score": 1, "replies": []}]}
{"title": "AMD", "selftext": "[deleted]", "id": "8wopjg", "created_utc": 1530919509.0, "score": 13, "upvote_ratio": 0.92, "num_comments": 20, "comments": [{"body": "Bull trap. Gonna buy puts at $17", "score": 29, "replies": [{"body": "Nah. Headed to $18. ", "score": 8, "replies": []}, {"body": "Same 👊🏻", "score": 2, "replies": []}, {"body": "i should’ve bought puts today", "score": 0, "replies": []}]}, {"body": "I miss the good old day of buy below $10 & sell above $13.", "score": 10, "replies": []}, {"body": "Maybe, maybe China ", "score": 3, "replies": []}, {"body": "On what basis is it reaching back to the ATH levels? Seems shaky. ", "score": 3, "replies": [{"body": "Well you see there is supply and demand.", "score": 2, "replies": [{"body": "I don't know enough about AMD so I was just wondering. You guys follow these companies way more than I do. ", "score": 2, "replies": [{"body": "Mods, you know what to do.", "score": 2, "replies": []}]}]}]}, {"body": "Puts at $16 7/20. On Monday the stonk will go down and my put will go up and I sell.", "score": 4, "replies": [{"body": "How’d this trade go", "score": 2, "replies": [{"body": "50% modest gains https://i.imgur.com/oEZdALQ.jpg", "score": 1, "replies": []}]}, {"body": "modest gains but gains", "score": 1, "replies": []}]}, {"body": "Set up a $16.5 straddle around lunch today. I don't care which way it goes. ", "score": 3, "replies": []}, {"body": "Bought in a $2, dont matter to me if it goes down.", "score": 2, "replies": []}, {"body": "Bought puts 1 month out. Hopefully didn't buy early.", "score": 2, "replies": []}, {"body": "Earnings in two or so weeks? 🤔", "score": 1, "replies": [{"body": "P R I C E D  I N", "score": 8, "replies": []}]}, {"body": "I've learned that there's no way to be sure.", "score": 1, "replies": []}]}
{"title": "Daddy musk is working on submarine Tesla’s now , buy TSLA$", "selftext": "[deleted]", "id": "8woqoc", "created_utc": 1530919775.0, "score": 27, "upvote_ratio": 0.96, "num_comments": 12, "comments": [{"body": "I was thinking today when the hell is he gonna get in the boat market. I’m fully torqued right now, and looking for buttholes!", "score": 24, "replies": [{"body": "He got tired of swimming I imagine ", "score": 8, "replies": []}]}, {"body": "This is how good PR is done. TSLA to $400. ", "score": 12, "replies": []}, {"body": "I guess they can't burst into flames under water.", "score": 9, "replies": [{"body": "They can only drown..", "score": 1, "replies": [{"body": "I'm sure there's a way to make them explode too.", "score": 1, "replies": [{"body": "I think they implode.", "score": 3, "replies": []}]}]}]}, {"body": "Didn’t they do this in one of the episodes of the new Lost in Space series? Except there is was a lake of tar. ", "score": 2, "replies": []}, {"body": "I thought Models S is already a boat https://arstechnica.com/cars/2016/06/tesla-model-s-floats-boat-video/", "score": 1, "replies": []}, {"body": "Disappointed. \n\nWas really hoping he would cure cancer first, or solve our lack of teleportation problem. \n\n", "score": 1, "replies": []}, {"body": "I'm hoping that the SpaceX people are payed to just hang around and when appropiate yell:\n\nTHIS ISN'T ROCKET SCIENCE YOU KNOW? ", "score": 1, "replies": []}]}
{"title": "Sonos S1 Filing", "selftext": "Sonos filed an [S1 today](https://www.sec.gov/Archives/edgar/data/1314727/000119312518213468/d403417ds1.htm#toc403417_4). Now I know most of you can't think past next week, but hear me out: Amazon could singlehandedly neuter this company.\n\nMy biggest takeaway: read pages 18/19 ***Conflicts with our distribution and technology partners could harm our business and operating results.*** Specifically, they name Amazon as having a right to disable Alexa interfaces with Sonos speakers at anytime. Same with Apple. And Google. And <whatever shitty voice assistance you use>.\n\nBut wait - I thought Sonos is just a speaker? Nah. Read their own description: \"Ask most Sonos customers what we build at Sonos, and they’ll say speakers. But ask them about the experience, and they’ll describe a system.\". Again, Amazon Alexa is specifically mentioned.\n\nAnyways, IPO won't be for a bit, but do take a look at some of these points. Doesn't paint a good picture.", "id": "8wounc", "created_utc": 1530920770.0, "score": 12, "upvote_ratio": 0.88, "num_comments": 10, "comments": [{"body": "Not only can Amazon kill Sonos, it’s already playing with the idea. ", "score": 5, "replies": []}, {"body": "Sonos is going to be categorized with fitbit and gopro. Userbase wont grow enough without new ideas. Going to pop and drop.", "score": 3, "replies": []}, {"body": "Oh no, they can disable the voice assistants, sonos still made money making those speakers and now Amazon bricked them?\n\nOkay, guess I'll have to make more to sell\n\nI don't think they are a great company, and yes, losing a contract with Amazon for the speakers would suck, I think the fact that they have those partners to lose is a good thing", "score": 5, "replies": []}, {"body": "Been rocking Sonos since the beginning. Awesome. I use it daily. I love the zone feature. Alexa integration is shit. ", "score": 2, "replies": []}, {"body": "Their going to be a Bose wannabe competitor. Their prices are similar and the Bose soundbar blows this crap out of the water", "score": -1, "replies": [{"body": "Bose sucks balls, Sonos must really suck balls.", "score": 7, "replies": [{"body": "There are many, many balls to be sucked in the consumer audio industry.  ", "score": 9, "replies": [{"body": "Can we add Beats to this list? I guess they're now part of Apple, but still...", "score": 2, "replies": []}, {"body": "No highs, no lows...must be bose.", "score": 5, "replies": []}]}, {"body": "QC35s are an excellent travel headphone. And this is coming from someone who owns audeze-lcd2s with a headphone amp ", "score": 1, "replies": []}]}]}]}
