{"title": "Tesla discussion", "selftext": "Hello everyone, I wanted to bring up something that a lot of people don't really discuss about companies. People talk about price technicals, p/e ratios, gross margins etc. But those things only impact the quarterly results and short term price movement. But what is a big driver of the long term trajectory of a company? Vision + culture. \n\nThe reason I'm bullish about tesla in the long term is because I like their energy+ autonomy vision and they have a culture to disrupt. Tesla is full of brilliant people who work extremely hard. Now ofc, hardwork does not always yield results, you have to be working on the right things and working smart thats why I said you also need vision. Over long periods of time vision + culture = disruption. Over the short term I have no idea what tesla will do, but in the long term I believe tesla has all the ingredients to be making some of the most disruptive products/services in society in the next 5-10 years and therefore will be the largest company in the world. \n\n", "id": "1b84mad", "created_utc": 1709743919.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 52, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 4 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "It was all good until x", "score": 1, "replies": []}]}, {"body": "The problem is that ketamine has a known side effect of damaging your vision", "score": 44, "replies": []}, {"body": "The problem is Musk has his attention in so many other things, TESLA is not his priority these days, so I am not sure what Tesla will do long term.", "score": 13, "replies": [{"body": "And the fact that he is begging US politician to put more protective measure up against Chinese EVs is not a good look. As it looks right now, Tesla is getting eaten up by BYD that can produce similar quality for a much more competitive price due to their vertical integration. And with Tesla and other EV Automaker using BYD batteries, I can't really see why people should pay a premium to buy a Tesla. I can't really see Tesla making a dent outside the US and Europe market.", "score": 6, "replies": []}]}, {"body": "You're about 8 years too late on this post", "score": 10, "replies": [{"body": "Could have said the same thing about warren buffet buying apple in 2016 ;). Thats the thing about good companies, they continue to create value over the long term.", "score": -7, "replies": [{"body": "Warren Buffet buys great companies at a great price. He doesn't just buy good companies at any price. This is where your analogy falls apart.\n\nIn 2016 Apple started the year with a PE of just 10x lol. It was the best company in the world at an amazing price. You can't say the same about Tesla's valuation. Stagnating growth and a forward PE of 58x.", "score": 7, "replies": [{"body": "he buys great companies at a good price\\*. Charlie Munger taught him that it is better to buy a great company at a good price than a decent company at a great price.", "score": 2, "replies": [{"body": "This man Mungers", "score": 3, "replies": []}]}]}, {"body": "No one is doubting Elon or Tesla's vision, it's all the other things about a business that is a hurdle for them now", "score": 0, "replies": [{"body": "I doubt it - guy is a glorified salesman and a narcissist", "score": 0, "replies": [{"body": "Aren't we all?  /s", "score": 1, "replies": []}, {"body": "and selling is the most important part of a business.. people say \"salesman\" as if its a bad thing", "score": 1, "replies": []}]}]}]}]}, {"body": "Hello fellow bagholder", "score": 4, "replies": []}, {"body": "Sounds like cope to me. Im in. Jk ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 7, "replies": []}, {"body": "I agree, there are a lot of smart people there, but that doesn't always sell product. The CEO engages in attention seeking behavior that often pushes away his target demographic, and the Chinese consumer wants to buy Chinese.", "score": 8, "replies": [{"body": "I am the exact target demographic for \"High-tech, groundbreaking electric vehicle\", but instead bought a boring ass stupid corolla all because Musk just makes it straight up embarrassing to own a Tesla.", "score": 6, "replies": [{"body": "You contradict yourself. If you truly are the target demographic then you'd be driving a Lucid instead of a $23,000 Corolla. You were not the target demographic.", "score": 0, "replies": [{"body": "Bro Lucid costs like $100k. If they were $30k like Tesla then yes I'd have bought one.\n\nI'm not, and will never be, target demographic for a $100k car.", "score": 6, "replies": []}]}]}, {"body": "I think the china numbers are more impacted by a cyclical downturn in EV industry (byd numbers also down) and a geopolitical  rivalry maybe causing a nationalistic trend to buy Chinese (iPhone underperformed huawei). Overall, I don't think the Chinese media follows elons tweets like the US. The fact is disruptors breed haters, media is clearly out to make tesla/elon look bad.", "score": -1, "replies": [{"body": "All that and China,s economy is in a serious shitter .... the target demographic who is buying TSLA,s in China currently is experiencing a 25% unemployement rate.( highly educated younger upper wage earners)", "score": 3, "replies": []}]}]}, {"body": "Buy 2026 calls and post your wins in 2 years 👌", "score": 2, "replies": []}, {"body": "Here's a choice: 1) read this \"analysis\" or 2) eat a giant burrito, shatter the toilet, pick the corn out.\n\nIt's 2) all the way.", "score": 3, "replies": []}, {"body": "In my mind, Tesla is an easy buy because the emotional reaction to Elon Musk has caused people to undervalue Tesla.", "score": 2, "replies": []}, {"body": "https://youtu.be/rw9vUYuTW4s?si=1hwv_t0VFQ6mOqBz", "score": 1, "replies": []}, {"body": "Markets are finally realising this is just a… fken car company", "score": 1, "replies": [{"body": "I look at tesla more like an engineering firm. I think a lot of people are skeptical of tesla's fsd because of years of delay. But I believe computer vision systems are similar to text to text problems just significantly more computing/data is required. My thought is we will eventually cross a threshold where suddenly these systems seem to become very good out of nowhere much like chatgpt. Long term I believe tesla's value will be from their computer vision investments, not just fsd but also optimus. Their energy business + computer vision business i think will be highly disruptive because it will completely change the nature of the economy.", "score": 1, "replies": []}]}, {"body": "Big driver = ELON’s FANBOYS", "score": 1, "replies": []}, {"body": "I think people understand now that Elon is a total conman.  All those poor dumb shits who paid all that money for FSD which still doesn't exist.", "score": 0, "replies": []}, {"body": "When Tesla solves FSD it will be the most valuable company in the world. And then it is too late to buy in. Check those youtube FSD 12 videos. They are really close.", "score": 2, "replies": [{"body": "> They are really close.\n\nWe’ve been hearing this for the last 8 years, and at every new “beta” release. The reality is, this is a system that fails n average every few miles. It needs to be about 100,000x better to be actually autonomous, which is something they’ll never achieve with the current hardware setup.", "score": 2, "replies": [{"body": "it actually doesn't have to be much better than a human.  if they get to the point where the average fsd mile traveled was half as likely to be in an accident as a human guided mile that's about all they need.  and it may be there already.", "score": -1, "replies": [{"body": "It’s not even close to that. The current system requires a takeover on average about every 10 miles for a critical safety issue. Humans crash on average about once every 500,000 miles. So it still needs 50,000x improvement.", "score": 3, "replies": [{"body": "If the accident or injury rate for a tesla is half that of an equivalent manually driven car I think that most  people will accept it as good enough.  Even with the takeover every 10 miles people are paying for this option and it remains popular.  \n\nI don't have any figures on what the injury-per-mile or accident-per-mile rates are for tesla fsd vs other - do you?", "score": 1, "replies": [{"body": "The question is about autonomy, not whether people will pay for a shitty ADAS system.", "score": 3, "replies": [{"body": "I think that the market has spoken.  as terrible as you think it is, it's a $15k option that people are buying and paying monthly for. Would you agree?", "score": 1, "replies": [{"body": "Again, read the above thread. This isn't about how long people will fall for a scam of autonomy \"next year\" it's about the technical feasibility of building an actual autonomous system.\n\nAnd given that adoption is dropping as people are realizing it was always a scam, no, I wouldn't agree.", "score": 1, "replies": [{"body": "[you've looked at the adoption rates since 2022, right?](https://www.quora.com/How-many-FSD-beta-Tesla-are-there-now-in-North-America#:~:text=As%20of%20today%2C%20January%2023,users%20reported%20in%20September%202022.)", "score": 1, "replies": [{"body": "That’s not adoption rates. Tesla opened up the program to people who had previously bought it in November 2022.\n\nAnd again, this is about autonomy, not the number of people who fall for a scam.", "score": 1, "replies": [{"body": "you have individually determined what autonomy means to you, and while that's interesting, it's not really relevant.  the product that tesla is marketing as FSD seems to be satisfactory to the folks who are buying it in large numbers.  \n\nIf you're saying that is not the adoption rate, what IS the adoption rate?", "score": 1, "replies": [{"body": "No, Musk very clearly said autonomy is when the car requires no liable driver.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Its a valid point that the intervention rate needs to be much lower. But I think even if it needs to get 50,000 times better that path may be very nonlinear and may come sooner than you think. Kind of like how chatgpt kind of came out of nowhere and can pretty much pass the Turing test at this point. I think computer vision systems will follow a similar path just offset by several years because  vision problems are computationally more complex (consider the brain uses most of its computing power to process vision data)", "score": 1, "replies": []}, {"body": "Its a valid point that the intervention rate needs to be much lower. But I think even if it needs to get 50,000 times better that path may be very nonlinear and may come sooner than you think. Kind of like how chatgpt kind of came out of nowhere and can pretty much pass the Turing test at this point. I think computer vision systems will follow a similar path just offset by several years because  vision problems are computationally more complex (consider the brain uses most of its computing power to process vision data)", "score": 0, "replies": [{"body": "Sure, it’s non-linear, but that’s because it’s already converged at a lower rate. So no, it’s not exponential, or whatever buzzword the dipshits pretending to understand AI use. The current setup is never going to be anywhere near autonomous.", "score": 2, "replies": [{"body": "I agree its very hard to know, I believe we are all pretending to understand artificial intelligence because we don't even understand real intelligence so how can anyone truly know? But I just base it off of how our text to text systems evolved, they seemed to converge at a low rate and then boom a step change improvement. Its still a philosophical thing to consider if we can emulate intelligence, but it seems to be the trend that our data and classical hardware/software methods seem to do a good enough job. But when/if we will cross those thresholds its impossible to know for sure.", "score": 0, "replies": [{"body": "In terms of understanding AI, we do understand it. I design AI algorithms, and can absolutely say we know how these things work. And no, there isn’t a magical “step change”. That’s just do to the public not paying attention to new models and hardware. With the fixed inference hardware in this system, there will be no significant improvement.", "score": 2, "replies": [{"body": "Sorry let me elaborate, you can understand an algorithm, but will you know what will happen if you feed it 10TB of data instead of 1TB? Or change an algorithm from 1billion parameters to 10billion? What i mean is they are inherently black box systems, you only understand what is going in and what is coming out after you run the model. And I mean, we don't understand how artificial intelligence evolves RELATIVE to our own intelligence. They are both inherently black box systems, and that is why it is hard to know truly how these systems will evolve.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "https://www.reddit.com/r/interestingasfuck/comments/nkufvj/man_wont_fly_for_a_million_years_december_8_1903/", "score": 1, "replies": []}, {"body": "Check Waymo already doing FSD/driverless Robotaxi for years its nothing new. Tesla will never have full FSD/Robotaxi cuz they don't want the liability.", "score": 0, "replies": [{"body": "Waymo is fake FSD. Only works in small area and there have to be huge amount of workers helping when the car gets stuck.", "score": -1, "replies": []}]}]}, {"body": "Fixed it for you:\n\nX is full of brilliant people who work extremely hard. Now ofc, a whiny, racist, delusional douchenozzle CEO does not always yield results.", "score": -3, "replies": []}]}
