{"title": "Playing Amazon dead cat bounce", "selftext": "[deleted]", "id": "2k77do", "created_utc": 1414161982.0, "score": 3, "upvote_ratio": 0.72, "num_comments": 11, "comments": [{"body": "Dead cat bounces typically don't last beyond the first 30 mins of the opening. The downtrend is already continuing. You missed out. Look for a different pattern.", "score": 2, "replies": [{"body": "I thought dead cat bounces could last a couple days? Not saying you're wrong just wondering what you're basing that opinion on.", "score": 1, "replies": []}, {"body": "I wasn't expecting a reaction to the oversold condition until next week.", "score": 1, "replies": []}, {"body": "I bought Dec. ATM calls on Friday. You are right, now they are no longer in the money.", "score": 1, "replies": [{"body": ":(", "score": 2, "replies": [{"body": "Turn that frown upside down! :)", "score": 3, "replies": [{"body": "You can't control me, robot.", "score": 1, "replies": []}]}]}]}]}, {"body": "Should of waited til Monday. I can see amazon go lower.", "score": 1, "replies": [{"body": "Ya, I think too many people have amzn on their radar today.", "score": 1, "replies": []}, {"body": "Bought too soon, but I am not trying to pick a bottom.  I bought 290 strike calls  with December expiration", "score": 1, "replies": []}, {"body": "You're right, I could have squeezed some more premium out of the Dec ATM calls.", "score": 1, "replies": []}]}]}
{"title": "What's in your portfolio?", "selftext": "Thought it would be an interesting take to see everyone's portfolio currently and what they are interested in buying/researching for next week. Maybe we all could give a little insight too. Anyways, here's what I'm holding with a percentage increase/decrease since I bought...\n\n**CYBR** (+6%)\n**NBG** (+13%)\n**ONVO** (-6%)\n**AAL** (+20%)\n**SGYP** (-8%)\n**ATTU** (-3%)\n**YDLE** (+18)\n**FB** (200%) long term hold\n\nCompanies I'm thinking to get in but haven't bought as of yet...\n**MA**- Mastercard\n**EKSO**- Esko Bionics\n**AGIO** - Agios Pharma\n**DGLY** - Digital Alley\n**MZOR**- Mazor Robotics\n**SNSS**- Sunesis Pharma (this one's been seeing a huge run up today, annoyed I didn't get in).\n\nAnyways, there's my portfolio at the moment. I'd like to think I'm doing well but then again, the market's been up, so there's that, haha. So what does everyone else have?\n", "id": "2k7zy9", "created_utc": 1414177389.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 19, "comments": [{"body": "Retirement: NQ\n\nLife Savings: NQ\n\n", "score": 13, "replies": [{"body": "I love you ", "score": 0, "replies": []}]}, {"body": "Long term (1 year or more): AAPL, F, GOOGL  \nIRA & Life savings: index funds and large caps (money manager handles it)  \nPlay Account: GILD, GILD, GILD, and, oh some more GILD  \n", "score": 5, "replies": [{"body": "told you that gild would pay off fold! I knew from their presentation that thing was going to pop good. Good to see you doing well buddy take care", "score": 3, "replies": [{"body": "Haha yea man thanks for that. I've been trading it off and on ever since you mentioned it earlier this year. Holding a few Nov $110 options right now, debating on whether or not to hold them through earnings", "score": 2, "replies": [{"body": "I'm holding those $110 calls through earnings. I might sell some off to recoup some earlier losses. Another one like GILD is Celgene, CELG.  ", "score": 1, "replies": []}]}]}]}, {"body": "IRA: AAPL, GE, GOOGL, QCLN, SCTY, TAN, WFM\n\nIndividual (long term): BLDP, BWEN, ESYS, FUJHY, GTAT, HYSR, PLUG, SGLB, SPWR, WFM\n\nIndividual (short term): ABX jan. 2015 $15 calls, FB nov. 22 $77.5 calls,  GE jan. & mar. 2015 $27 & $28 calls, PLUG jan. 2015 $10 calls, SPWR nov. 22 $35 calls", "score": 4, "replies": []}, {"body": "UPRO stock, Nov 7 109 UPRO put.  I'm up 5k this week, which probably beats the average member of this sub by at least 6k.  ", "score": 2, "replies": []}, {"body": "Wow it's like you created a Reddit portfolio.", "score": 2, "replies": []}, {"body": "SGMS, AKS, PBR, KNDI, NQ, CPSS", "score": 1, "replies": [{"body": "Nice play on KNDI and NQ. I'm interested to see how ER turns out for KNDI. Consensus is positive I think.", "score": 1, "replies": [{"body": "serious consolidation in the gaming space. sgms is now SHFL + BYI +SGMS , synergies and operational efficiencies will start to be realized q1 2015. Not to mention, sgms ceo has worked at both SHFL and BYI so he knows all the parts of these companies and how to effectively cut costs and increase efficiencies. they are already laying off staff. ", "score": 1, "replies": []}]}]}, {"body": "TMUS(+1.27)OI(+5.85)", "score": 1, "replies": []}, {"body": "MXWL, PXLW, MNKD", "score": 1, "replies": []}, {"body": "CHL (-9%), NQ (+29%), ONCS (-13%)\n\nAlready sold most of my NQ though - keeping a sliver of it just in case they miraculously do put out a 20-F. ", "score": 1, "replies": []}, {"body": "* Options (ITM Calls) Expiring Nov22:  CELG, GILD, YAHOO\n* LT Stocks: CELG, ILMN, AAPL, TSLA, YOKU, DIS, GOOGL, AMZN, \n\n* Want to get rid of soon: CIMT. (Bought it after the post by \n3dprintingstocks) \n* XIV -- Expecting volatility to drop soon and make a quick buck out of this. \n\n", "score": 1, "replies": []}, {"body": "My portfolio follows Bruce Lee's advice. ", "score": 0, "replies": [{"body": "he said a lot of things... ", "score": 1, "replies": [{"body": "Be formless... like water. ", "score": 1, "replies": []}]}]}]}
