{"title": "TSLA - Friday Correction or Moon?", "selftext": "[deleted]", "id": "idgerv", "created_utc": 1597949788.0, "score": 25, "upvote_ratio": 0.86, "num_comments": 84, "comments": [{"body": "Tsla 2200 tomorrow. Never doubt our lord and saviour papa big cock elon musk", "score": 63, "replies": [{"body": "Flame thrower cock that has a starlink satellite , powered by lithium batteries .", "score": 7, "replies": []}, {"body": "$2,099 max before split", "score": -2, "replies": []}]}, {"body": "Why does profit taking early and you could have made more hurt more than actually losing money?", "score": 21, "replies": [{"body": "Cause it means we are weak paper handed little bitches :(", "score": 15, "replies": []}, {"body": "I feel you man, hindsight is the worst sometimes.", "score": 2, "replies": []}, {"body": "Profits are profits, it sure sucks but hey, you could have created a website where people post pics and be a billionaire. Also sucks holding onto 500% gains then look away for 5 mins and be left with -50%.", "score": 2, "replies": []}, {"body": "Had 2 contracts for 1870 calls and 1 for 1960. Dipped this AM and sold my 1960 call for -50%. The other two I sold at 1985 and then ofc they shot up to $2015 an hour later", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 37, "replies": [{"body": "What does this mean for people who buy after tomorrow?", "score": 4, "replies": [{"body": "If you buy after tomorrow, whoever held it on the record day owes you the additional shares when it splits.", "score": 4, "replies": [{"body": "So it actually doesn't matter except for accounting shit. No one will see a difference in trading or anything.", "score": 10, "replies": [{"body": "Noooo. Keep repeating that it matters and that anyone who buys next week will not get the extra shares.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "What’s the point of the record date then?", "score": 7, "replies": []}, {"body": "Thanks! So do you think we’ll see a correction and low volume from Aug 21-31 because people don’t want to be confused?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sweet. Good luck to us both.", "score": 2, "replies": []}]}]}]}, {"body": "I was wondering that as well. If you buy a Tesla stock on Monday does it just decrease in value drastically?", "score": 1, "replies": [{"body": "No who ever you bought the share from owes you the others come the split. It's the same as a dividend.", "score": 2, "replies": []}]}]}, {"body": "What does this mean? What happens between 21 and 31st? Why will it drop?\n\n(I read dividends of upcoming quarter results will be given to the owners as of Aug 21 but nothing much else)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, I can understand that. I want to know what “last day to be on record for stock split” exactly means.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Thanks! I really don’t understand the point of record date (Aug 21). It seems completely meaningless", "score": 2, "replies": []}]}]}]}]}]}, {"body": "isn't split overhyped? when retail customers can buy fractional shares via almost any brokerage service provider.", "score": 11, "replies": [{"body": "Yes, but but any mildly good Tesla news is incredible godly news for it's stock 😂", "score": 4, "replies": []}, {"body": "_in america_, globally its not the same.", "score": 3, "replies": []}, {"body": "Not too mention you are literally exchanging a dollar for four quarters.", "score": 2, "replies": []}, {"body": "Idk, Fridays are usually shit", "score": 1, "replies": []}, {"body": "A lot of people don’t know about fractional shares", "score": 1, "replies": [{"body": "strange, when it is being advertised so hard", "score": 1, "replies": []}]}]}, {"body": "Let me use my time machine to check for u. Brb", "score": 18, "replies": [{"body": "Well?", "score": 6, "replies": [{"body": "Time machine error404", "score": 14, "replies": [{"body": "Unplug it, then plug it back in!", "score": 1, "replies": []}]}, {"body": "Massive sell off boy", "score": 1, "replies": []}]}]}, {"body": "ASK yourself this, when Tesla splits, who wants to sell when a stock price becomes cheaper for Robinhood kids to buy in?", "score": 9, "replies": []}, {"body": "At this point I don’t know if we’ll see a correction before the election. Everything screams it should be happening but people just won’t stop buying.", "score": 8, "replies": [{"body": "October is a great month for crashes historically, might go cash gang from then until after the election.", "score": 2, "replies": [{"body": "All I have is a feeling but I'm dreading mid- to late-September. \n\nNo reason, no DD. Just a feeling.", "score": 2, "replies": []}]}]}, {"body": "I gots 2100c 8/21 this baby gonna keep mooning for me or I’m fcked", "score": 12, "replies": [{"body": "Cucked deep in the AHole.", "score": 3, "replies": [{"body": "Hell nah yella bling coming tmo , +300% today", "score": 2, "replies": []}]}]}, {"body": "Well this thing shot right passed my 1990/2000 spread I opened around 1860 this morning so for the sake of my butthole I hope there is a minor correction. Although mostly bull, TSLA has murdered any slight hint of bear in me.", "score": 7, "replies": [{"body": "That’s when it crashes", "score": 2, "replies": []}]}, {"body": "I hope it corrects. I'm still regretting selling my 1700c yesterday...missed out on additional 11K", "score": 10, "replies": []}, {"body": "Tesla just following aapl at this point, but doing so in Tesla fashion", "score": 5, "replies": [{"body": "AAPL has resistance at 470 it can’t seem to break, TSLA on the other hand....", "score": 2, "replies": [{"body": "I thought this as well but eventually it’s crossed 470.", "score": 2, "replies": [{"body": "It tested it and failed like 4 times today. Glad it finally broke through. There’s a guy who’s eating cat food if it doesn’t close above 475 tomorrow so there’s that to look forward to as well.", "score": 4, "replies": []}]}, {"body": "Lol look at Apple... puts too early maybe", "score": 2, "replies": [{"body": "I’m holding 475 calls. Clearly my pessimism paid off.", "score": 1, "replies": [{"body": "LOL did u inverse yourself", "score": 1, "replies": [{"body": "I did. Magically it worked. I bought it two days ago. The theta decay has been killing me and I thought with the 470 resistance I was dead but I’m up now and if it gaps up again tomorrow morning I can sell for a profit.", "score": 1, "replies": []}]}]}]}, {"body": "Sold my 8/21 470 calls just to break even on them because it kept hovering around 470 but couldn’t stay above. 5 min later it was low 469 and I was feeling good about it. Checked it later this evening now I’m sad.", "score": 1, "replies": [{"body": "Thank you. You’re the reason my options is ITM now.", "score": 1, "replies": []}, {"body": "Sold shortly after open this morning and apparently left $1000+ on the table. Made $500 but it’s still roaring up.", "score": 1, "replies": [{"body": "I’m crying watching it. Sold my 2 470c yesterday for $600 and was happy to have broken even. Left $1800 and climbing on the table.", "score": 1, "replies": []}]}]}]}]}, {"body": "Musk say, TSLA Friday at $2420.40", "score": 13, "replies": [{"body": "Praying this happens lol", "score": 1, "replies": []}]}, {"body": "Gap up and run tomorrow. FOMO is a helluva drug", "score": 3, "replies": []}, {"body": "2100 FOR 420 AFTER SPLIT LETS GOOOOOO", "score": 9, "replies": []}, {"body": "Moon? Bro, there's a Tesla in an elliptical orbit between Earth and Mars. The stock is trying to catch up to where the car is. The market for Tesla isn't detached from reality, the market is trying to get *back* to reality. The stock has to go to Mars before it corrects.\n\nSee you on the Starship boys.", "score": 3, "replies": []}, {"body": "2100", "score": 5, "replies": []}, {"body": "Drop tm, moon all next week, moon Next Friday, dip following Monday mid morning", "score": 4, "replies": [{"body": "The odds of it dropping on the day of record is unlikely.  Sideways maybe, but definitely not going to dip.", "score": 1, "replies": [{"body": "You mean not like last time?", "score": 2, "replies": [{"body": "When was the last time Tesla crashed?  In March with everyone else?  Or in July when it was below 1500 for an entire day?  Every stock has some loss and gain on any given day, but statistically, it's not going to \"crash\" on the day of record for the future split.\n\nBut I mean, I've only made 30k this month playing Tesla, what do I know.", "score": 3, "replies": [{"body": "The day I bought in of course, last ah. I didn't say crashed, but it certainly gonna dip some, People made a shit ton of money some gonna cash out for sure. If you are smart you sell for profit, then buy back in when it dips some.", "score": 1, "replies": [{"body": "There's definitely going to be a decline in its value at some point, I just don't believe tomorrow is going to be that day. I'd say Monday-Wednesday you'll see a correction down to high 1800s, with it reaching ATH by 8/28.", "score": 1, "replies": [{"body": "Maybe, maybe not. I'm saying no more or less. I just doubt the majority gonna hold over the weekends. That's quite rare after a week of massive gains. Not that meme's care for my sentiments.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Tesla will open at 2100 then stay there until it splits to 420. It is the will of the people", "score": 4, "replies": []}, {"body": "At this point, it's just being pushed by what ever analysis throws out. 2000, 2500, 3000...", "score": 2, "replies": []}, {"body": "Most bought Options that EXPIRE the 28th", "score": 2, "replies": []}, {"body": "2150 tomorrow. Moon 🚀", "score": 2, "replies": []}, {"body": "I got a put credit spread on this bad bhoy. I'm planning on letting it use tonight's theta and closing it tomorrow morning hopefully at 50% profit. Ideally it moons so I can let it ride and maybe get a dank 80% gain on it", "score": 2, "replies": []}, {"body": "Does anybody know exactly when the SEC just decided to stop investigating stock market manipulation?  Just curious.", "score": 3, "replies": [{"body": "Where’s the manipulation?  Just because TSLA levitated at 2000.20 for 3 minutes prior to close means nothing 😂", "score": 2, "replies": [{"body": "Elon is rich and has a lot of rich friends.  Maybe...i dunmo..he got them together and said \"drive the stock up and when they give me $50 billion for performance I'll take care of you\"...????", "score": 2, "replies": [{"body": "Elon is rich and has 38m friends of all social classes. Only like 50-60m shares that are not owned by insiders or institutions. Everyone is buying to hold and not liquidating. Finite supply, increasing demand. It’s not fraud it’s simply the market at work", "score": 3, "replies": [{"body": "It just seems so convenient that a growth company (with falling Yoy deliveries) just happens to go vertical right around the time the CEO's equity conp is being set off of stock price......", "score": 1, "replies": [{"body": "Are you trying to insinuate that big daddy long cock done did something bad? wtf BAN! mods I need you over here", "score": 1, "replies": []}]}]}]}]}]}, {"body": " I’m hoping it sits.  I bought a 1950-2000-2050 butterfly.  Need is somewhere between 1960 and 2040 to make a profit", "score": 1, "replies": []}, {"body": "Buy the dip don’t sell it, I sold at 1865 premarket today expecting a little $10-20 dip only to buy back in around 1900 A few minutes later, nice way to hop over a perfectly good 1.8%.", "score": 1, "replies": [{"body": "lol shares", "score": 1, "replies": []}]}, {"body": "Wfc to 40 by Monday", "score": -1, "replies": []}]}
