{"title": "Is it too late for TSLA?", "selftext": "So I know this is all people probably see on this subreddit, but I feel like this is a step above a noobies post (lol probably not)\n\nSo I’ve been pondering for months, do I buy tesla ? And I’ve been thinking this every day since it was at $400 at the crash and every day it just gets higher and higher.\n\nToday I went to buy in as abit of a YOLO, but the market just closed and my order didn’t go through.\n\nAfter chatting to my old man (Dad) he believes i’m just chasing after what I have missed out on and really just running into the FOMO trap. \n\nI still want to buy in but I’m not sure to buy in pre-split and look to liquidate some of the position straight away or buy post split with the price potentially being Inflated. \n\nMy feeling is that after the split a lot of people will look to liquidate some of there positions to earn some profit after holding for so long, therefore dipping the price abit. \n\nHowever being tesla who even knows anymore, it just feels like it’s going up and will never stop 🚀\n\nBut who knows, might just expand my position on NIO at this point - see if it’s the new TSLA\n\nI’d be interested to see other peoples feelings and if anyone else is having these thoughts", "id": "ih7mnp", "created_utc": 1598476477.0, "score": 5, "upvote_ratio": 0.59, "num_comments": 83, "comments": [{"body": "If you’re making investing decisions based on what the stock price is doing, you’re doing it wrong. That’s FOMO. If you just want to speculate, do whatever you want. \n\nMy advice: value Tesla on the basis of expected future cash flows and see what you get. I think you’ll find that Tesla is highly overvalued based on any reasonable estimate. I’d avoid it and look for boring stocks which aren’t constantly being talked about.", "score": 17, "replies": [{"body": "this aged well", "score": 3, "replies": []}, {"body": "Future cash flow or future revenue? If you're looking at revenue it's still highly undervalued on a 5 year timeline, if you're looking at cashflow any growth stock like Tesla is going to be overpriced since they're investing all their profits into more growth.", "score": 0, "replies": [{"body": "Valuation is based on future cash flows. A company’s value only increases if its cash flows increase. If a company’s returns on capital are greater than the cost of capital, then free cash flows will increase.\n\nThere are plenty of companies with strong growth in revenues. Doesn’t mean they’re getting any more valuable.", "score": 2, "replies": [{"body": "That's absolutely not true. If the capex increase is permanent/recurring you're right, but if a companies spends a billion on a new factory that will increase their revenue in the future, that absolutely increases the company's value because they will both have more assets and, provided they don't build another factory immediately after, more income from the increased production. If you're not taking this into account when valuing a company, you're always going to miss the biggest growth opportunities.", "score": 1, "replies": [{"body": "Capex is definitely taken into account in a free cash flow valuation, as are things like marketing and R&D spend. If a billion is invested into a new factory, free cash flow for the current year is reduced by a billion. For the investment to add value, incremental future cash flows discounted at an appropriate rate better have a higher present value than a billion. Not revenues, cash flows.", "score": 2, "replies": []}]}]}]}]}, {"body": "I remember when my TSLA investment tripled in about a year. It went from $33/sh to about $112. I thought I was a fucking genius and sold it...because, how much further could it really go? It had hit $120 and came back down a bit, so I thought it must be done. Good guess right?", "score": 14, "replies": [{"body": "Oh man that’s painful. Their stock is a little over 1k atm and I’m debating if I should buy lol", "score": 1, "replies": []}]}, {"body": "Anyone telling you not to is crazy, battery day very soon this could be another big opportunity", "score": 8, "replies": [{"body": "This might be dumb, but what is battery day and when is it?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Errr. Wrong. Watch what happened after the earnings call 22-23 July. Share Price dropped 400 USD in one week.", "score": 9, "replies": [{"body": "I have a feeling that there will be many of these 'mini' corrections in Tesla's future. I don't think we'll see any major corrections like what the bears are expecting though.", "score": 1, "replies": [{"body": "I tried to play these corrections. It's impossible. When I sell it rises when I buy and hold it goes down. This company is only to invest if you truly believe in it, else you are better off health-wise investing in another stock.", "score": 4, "replies": [{"body": "Oh I agree, I'm not taking any chances. I wanna hold for 10yrs at least.", "score": 1, "replies": []}]}]}]}]}, {"body": "If you can afford to just ignore your buy for 10+ years then sure why not. However if you wanna gain a bit short term then you’re currently playing Russian roulette with your money especially if you need that money. In the end it’s only worth it based on the amount of risk you’re willing to take.", "score": 10, "replies": [{"body": "Agreed - I have the money to spare but I’d rather not loose any of it if I can help it", "score": 6, "replies": [{"body": "Got news for you- you WILL lose money in the markets. Just have to win more than you lose", "score": 7, "replies": []}, {"body": "Its only a loss if you sell at a loss. If you wait long enough, it will (probably) make money", "score": 4, "replies": [{"body": "Yeah, but waiting too long means you can’t invest in other things that could make your losses back and then some much quicker.", "score": 3, "replies": []}]}]}]}, {"body": "I’d say wait for a price correction. This stock is a hot potato for anyone who’s bought this month. Lots of big firms are saying to hold or betting against it. Then again they’ve thought that for a while. Price correction is coming but hard to say when and where.", "score": 17, "replies": [{"body": "Exactly my thoughts - but people have been saying that for month. \n\nHow many time’s has it got to land on green before you finally place your bet....\n\nMaybe investing is slightly more complex then roulette but you get me", "score": 6, "replies": [{"body": "I don't think green is an option when your betting on roulette, but to extend your analogy, the probability is the same for each spin of the wheel in roulette and it's a fallacy to think that a streak has an impact on your next bet. Tesla could drop hard on any unexpected news. It's a risky investment.", "score": 3, "replies": [{"body": "I meant 0 - it’s usually coloured green on some tables lol", "score": 6, "replies": []}]}]}, {"body": "If it goes up to $3,000 and then \"corrects\" to $2,500 will you still think its a buy?", "score": 6, "replies": [{"body": "That’s when I’ll load up lol 😛🤤", "score": 2, "replies": []}]}, {"body": "The price is continuing to efficiently correct upwards, you just don’t understand the company", "score": 3, "replies": []}, {"body": "agree , there is a crash coming in weeks not months ; TSLA is risky to buy now", "score": 1, "replies": []}, {"body": "Lets be real, price correction -5%? 10? 25?", "score": 1, "replies": []}, {"body": "THERE'S NO PRICE CORRECTION! Fuck Tesla and it's idiotic valuation. Every $100 increase in share price represents it's ceiling. I've known this since $800. Because once it hits $900 it will crash. It didn't? $1000 must be the max? $1200? $1300?? It can't go beyond $1500. $1600? Split? $2100?\n\nAm day trader and have refused to buy since $1000. I'll let you know when I buy and short the fuck out of it", "score": -5, "replies": []}]}, {"body": "Tesla doesn’t believe in physics \n\nIt only goes up never down", "score": 5, "replies": []}, {"body": "Yes buy now. Then buy when it drops. Then buy when it goes back up. Just keep buying.", "score": 8, "replies": [{"body": "Exactly I’m up 50% just buy it, do full DD and see the potential it will keep growing for at least the next 10 years", "score": 1, "replies": [{"body": "what happens after 10 years", "score": 2, "replies": [{"body": "It’s hard to know, if all of Tesla’s plans come to fruition by 2030 any more growth would really come from expanding the software, the robotaxi network and the power storage. But since Tesla will have changed the world and itself so much it’s gonna be hard to predict what they’ll do but they’re most likely going to focus on all the little things like I said software, insurance, energy storage and movement.", "score": 1, "replies": []}]}]}]}, {"body": "I own TSLA but its a very risky time to \"invest\" in it.\n\nI will rather checkout some other promising stocks.", "score": 4, "replies": []}, {"body": ">but the market just closed and my order didn’t go through.\n\nExtended hours to the rescue. Limit EXT and you're almost guaranteed to get a fill if you buy directly at the ask.", "score": 3, "replies": [{"body": "Honestly I’m kinda glad the market order diddnt go through in time \n\nThinking of holding off for abit now - think FOMO is just hitting abit too hard", "score": 4, "replies": [{"body": "Don't FOMO. Stop it. STOP IT.", "score": 5, "replies": []}, {"body": "I’d say go with what big money on wallstreet algorithms say, and that’s that there is a price correction coming very soon.", "score": 3, "replies": []}, {"body": ">think FOMO is just hitting abit too hard\n\nRespectable answer, that is.", "score": 1, "replies": []}]}]}, {"body": "It's going to 2500/500 no doubt", "score": 3, "replies": [{"body": "So 5?", "score": 0, "replies": []}]}, {"body": "I think it is never too late. I bought it at $2000 few days ago and already got some profit. I have put trailing stop limit and keeping an eye on its price value so if something happens it will be sold by itself.", "score": 3, "replies": []}, {"body": "You're WAY overthinking it.\n\nDo you think it's a good company?  Do you think they will continue innovating?  Have you heard of Tesla Insurance?  Have you heard of FSD?  Have you heard of Tesla solar?\n\nRemember, \"the market\" doesn't actually exist, it's just a billion people all making decisions at the same time.  The aggregate of those decisions is the stock price.  The vast majority of those people just see a company they like and decide to buy the stock.\n\nYou are sitting here trying to time \"the market\", which clearly, based on your track record, you are terrible at.", "score": 3, "replies": []}, {"body": "If you plan on holding for long term, buy now and wait for the dips to buy more. I currently hold TSLA and plan on selling some shares after the stock split to cover my initial costs, then play with house money.", "score": 3, "replies": []}, {"body": "No.\n\nThere's heavy resistance at 2000 due to being a round number, and both 1880 and 1680 due to heavy handed Chinese investors who bet on lucky numbers.\n\nDo you think Tesla is going to magically stop growing tomorrow (even with three factories being built?) Do you think investors are going to stop piling money into a company that keeps growing?", "score": 3, "replies": []}, {"body": "i have been doing what you were doing and finally caved in at $1400+... Making over 49% (wished i had put in more lol!)...", "score": 2, "replies": []}, {"body": "Look into LI, I’m in on TSLA too. I’m very high on LI in the next 10 years. I believe they have the best shot to give TSLA a run for their money. Currently they attractive because of their onboard generators and it’s worth nothing currently they aren’t pure BEV and still use combustion engines but I think as more people shy away from traditional vehicles they will release pure BEV models that use onboard generators. IMO NIO battery swaps is going to be irrelevant post battery day because I think huge news is coming. Watch this short video below on TSLA (worth noting I love TSLA and getting in now for the long haul is worth it)\nhttps://m.youtube.com/watch?v=PDlzhWbr0TI", "score": 2, "replies": []}, {"body": "Buy ARKK. 10%TSLA", "score": 2, "replies": [{"body": "Or just buy tsla which has no expense ratio.", "score": 1, "replies": []}]}, {"body": "It's too late until it's not. You've my blessing mate!", "score": 2, "replies": []}, {"body": "Do what you intend on doing, unless your dad is Elon or Buffett his advice is just as good as any other redditors.      \nThere is a strange psychology of people that are afraid of buying stocks as they rise but have no problem keeping stocks that keep dropping.", "score": 2, "replies": []}, {"body": "Jeffries raised their PT to $2500, aside from that they are the leader in the industry.  I'm a tsla bull and it never let me down.", "score": 2, "replies": []}, {"body": "Damn hindsight is 20/20", "score": 2, "replies": [{"body": "Lol tell me about it", "score": 1, "replies": []}]}, {"body": "I think Tesla is still a good buy. But it could go down, but I personally don’t think it will.", "score": 7, "replies": [{"body": "The company is valued larger than Walmart. Think about that. \n\nThis is a bubble.", "score": 4, "replies": [{"body": "It’s not a bubble there is a lot of growth still to come", "score": 2, "replies": [{"body": "Pets.com will be priceless once they start to grow! Get in while you can!", "score": 4, "replies": []}, {"body": "Walmart retail over 300 billion.\n\nTesla retail 25 billion but is valued the same as Walmart. \n\n\"ThErE iz RoUm tO gRoW\"", "score": 3, "replies": [{"body": "Tesla is fundamentally overvalued but if they can double their market share of the automobile market every year for 5 years then their current market valuation will make sense. They are also leaders in autonomous driving tech and other software stuff for cars on the market. No one else has anything like it to compete with. Google spent ages twiddling their thumbs on autonomous driving tech while never releasing anything commercially for the mainstream market.", "score": 1, "replies": [{"body": "Double every year for five years? VERY unlikely!", "score": 2, "replies": [{"body": "Except they’ve been doing it and have been building gigafactories, they will be able to produce 1.2 million vehicles by the end of 2021 and will be selling around 24 million by 2030", "score": 2, "replies": [{"body": "Uh, have you noticed what is going on with the economy right now? And how long it is expected to last? And you're expecting a doubling of revenue every year for five years on a high end vehicle? \n\nAnd you're basing this on the assumption that little to no meaningful competition will emerge.\n\nThat is a lot of if's you're banking on going your way. \n\nSounds to me like you're seeking information that confirms your bias and ignoring the question marks.", "score": 1, "replies": [{"body": "No it’s actually just that if you look at the facts Tesla is in such a big lead that there is no way anyone is coming close to them. All automakers share their revenue with dealers and have no idea how to make battery cars and ramp up production for them while keeping good energy density. Tesla has been doing it and selling cars and been profitable while doing it which is really hard to do, but they are vertically integrated and constantly changing and improving their products. With every consequent Tesla sold they make a little more margin with the new improvements, as soon as Full Self Driving comes out it will cost a lot of money and Tesla will be profiting on most of it. Then comes the autonomy taxi service where Tesla plans to sell its cars in fleets to companies or just personally deploy them as taxis. There’s a lot more there including full vertical integration of energy as well with the solar panels and storage which allows you to sell extra energy. But anyways it’s all in the Tesla master plan that Elon wrote they have been following it very closely and delivering everything", "score": 1, "replies": [{"body": "I am looking at the facts. I am also looking at the negative facts that you're not even acknowledging, too.", "score": 1, "replies": []}]}, {"body": "You are trying to predict the market by pointing out current macroeconomic trends when you should be doing the opposite. The market is a leading indicator. \n\nTesla’s tech edge is significant. Name one competitor with autonomous driving tech on the market ? How about a similar EV with performance and quality of model 3? Which company is even close?", "score": 1, "replies": [{"body": "But the valuation has to survive doubling, assuming no viable competition emerging, for five years. And the longer term economic downturn is yet to be seen.\n\nI am not saying that Tesla won't maintain it's current valuation, or even go up, I just have very little confidence in it maintaining that with everything in play right now.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Remindme! 5 years", "score": 0, "replies": [{"body": "Petty.\n\nIf you're trading on emotion, you're going to lose.", "score": 1, "replies": []}, {"body": "I will be messaging you in 5 years on [**2025-08-26 22:48:50 UTC**](http://www.wolframalpha.com/input/?i=2025-08-26%2022:48:50%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/ih7mnp/is_it_too_late_for_tsla/g2ynli3/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fih7mnp%2Fis_it_too_late_for_tsla%2Fg2ynli3%2F%5D%0A%0ARemindMe%21%202025-08-26%2022%3A48%3A50%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ih7mnp)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}]}, {"body": "For sure it's gonna drop when people cash out some of its shares after split. Buy during that time before battery day and annual shareholder meeting bring the price back up to $700", "score": 3, "replies": []}, {"body": "Personal opinion, look elsewhere. Any company under hype screams risk and overvaluation.  But it depends on your goals. Looking for a quick profit? Maybe swing it. Honestly believe in the company and not buying for the stock gains? Then buy and hold. Other than that, ignore the noise and look around. A lot of the market is being ignored right now. You don't need every big winner in your portfolio to do well. Just a couple really solid picks to come out ahead. It sucks watching potential gains leave but if you're asking is it too late, then it's probably too late.", "score": 3, "replies": [{"body": "Definitely not too late. Every car in the world will be electric eventually", "score": 1, "replies": [{"body": "Well, probably, that's a start but what's the timeline? Theres other issues that go with that like having enough sustainable energy to allow for that. So before we get there, we have to figure out or energy problem and at the rate we are going, its gonna be a bit. Then again, Tesla has more to offer than just cars so...again goes back to how much do you believe in Tesla as a company and not so much as a stock to retire on.", "score": 1, "replies": []}]}]}, {"body": "It's pretty simple tbh. If you're going to be in for the long run (let's say 10+ years) today's valuation is still very low. Provided Tesla executes on most of the things they're working on, they're still going to 10x from here. In this scenario it also doesn't really matter if you buy in for 2100 or 1800, as it just as well could be 2400 in a week/month.\n\nThat said, if you're just looking to get in because it went up a lot, you're looking to make a quick buck and you're not going to be comfortable holding onto this stock if it goes to 1500 in a month, stay away.\n\nAs for Nio, it's a solid stock as well imo but it still has a lot more unknowns than Tesla. If you're in Nio I'd highly recommend getting into Tesla too. One of them could disappoint, but it's unlikely both of these companies won't be way bigger than they are today with EVs becoming 100% of the car sales.\n\nIf you're looking for the new Tesla, it's still Tesla. People were looking for the new Amazon 4 years ago. Guess what? It was Amazon and it went 4x in 4 years. Tesla could do the same with battery day coming up and them potentially taking over the semi, pickup, solar and ridesharing markets.", "score": 3, "replies": []}, {"body": "Nobody anywhere has any idea what this stock will do, but just remember that it keeps going up.", "score": 1, "replies": []}, {"body": "Why dont you buy a quarter of the position you want. If it pulls back, great you can  add more. If it runs, at least you have some piece of the pie.  People always trying to time the market, never works out", "score": 1, "replies": []}, {"body": "Wait for the split", "score": 1, "replies": []}, {"body": "Buy it, there is still plenty of room to grow and you will regret missing out on this company, when it’s competing with apple for biggest company in the world you will think why didn’t I just buy it at 2000?", "score": 1, "replies": []}]}
{"title": "I Can Feel The Apple Post Split FOMO & Feeding Frenzy In My Loins", "selftext": "[removed]", "id": "igysi6", "created_utc": 1598448444.0, "score": 84, "upvote_ratio": 0.92, "num_comments": 80, "comments": [{"body": "After the split it’s going to sky rocket. It’s over like 120% for the year. It’s only going to go up and with the pandemic dragging on I feel like it will go up.", "score": 57, "replies": [{"body": "I mean, you realize the stock will move 4x as slowly right?", "score": -40, "replies": [{"body": "You realize that makes no sense", "score": 30, "replies": [{"body": "Maths. The market cap is staying the same right? Right now, if the market cap goes up 10% the stock goes up 10%. After the 4-1 split, if the market cap goes up 10% then the stock will go up 2.5%.", "score": -12, "replies": [{"body": "People aren’t buying the market cap though, they’re buying the stock. Just because the outstanding shares increase, doesn’t mean the stock will “move slower”.", "score": 19, "replies": [{"body": "speak for yourself i buy the entire $2 trillion every time i buy i have a direct line to mr apple he hooks me up", "score": 7, "replies": [{"body": "Damn dog, lemme get that number tho", "score": 1, "replies": [{"body": "1-800-Timmy-Stonks", "score": 1, "replies": []}]}]}]}, {"body": "each individual share would move 10% so that the sum moves 10%. \n100*0.04 = (50 + 50)*0.04 = (50*0.04 + 50×0.04)", "score": 4, "replies": [{"body": "Yes, but all the people who will \"jump on aapl\" because of the price won't be buying 4 stonks right? Cause if so, they would have bought it at the pre-split price. The argument is that they will buy because it's cheaper now. So if retards buy one stonk, you need four times to retards to move the stonk.", "score": -4, "replies": [{"body": "In the long run, yeah,  it'll stabilize prices in theory. It isn't like each share has to go at a certain price point before it goes up though, that's still ignoring the effects of derivatives.\n\nI think it will run til mid/end of next week, then you'll get downward pressure as \"profits are taken\"", "score": 3, "replies": []}, {"body": "There are plenty of people that won't buy unless they can afford 100 or whatever number they have in their head. Now that it'll be 4 times cheaper they'll buy 100 rather than buying 0.", "score": 1, "replies": [{"body": "Sure. The argument wasn't that aapl won't go up. It might. The argument was that it will go up 4x slower, because the people you're talking about are only buying 1 stonk, not 4.", "score": 2, "replies": [{"body": "I absolutely get your point, someone putting in a million dollars or whatever is still putting that same amount and just getting less shares.\n\nThis makes sense in a rational market where people invest based on numbers and not just sentiment. Clearly not the market we're in.\n\nI do think overall interest in the stock will increase heavily after it's more \"affordable\" causing an influx of smaller investors. Those may in turn bring in more of the bigger money who see that happening.\n\nMaybe I'm just making shit up, who knows. \n\n\nTBH: 550C 9/4", "score": 2, "replies": []}]}]}, {"body": "Or maybe... a person who wouldn’t buy one stock at $500 wouldn’t mind buying two for $250.  \n\nWhat the fuck is this retard doing here? Mods ban this motherfucker", "score": 1, "replies": []}]}]}, {"body": "bro if the market cap goes up 10% it's because the price of each share went up 10%, split or no split.\n\nserious question: are you retarded?", "score": 2, "replies": []}, {"body": "Buying stock doesn’t directly increase market cap", "score": 1, "replies": [{"body": "I understand that.", "score": 1, "replies": []}]}, {"body": "Lmao no", "score": 1, "replies": []}]}]}, {"body": "Found the retard", "score": 2, "replies": []}, {"body": "Never go full retard.", "score": 1, "replies": []}]}]}, {"body": "I just bought a sept 4 $510 call based on this post", "score": 14, "replies": [{"body": "just bot 4 x 470 put for the same date based on yours", "score": 16, "replies": [{"body": "😐", "score": 1, "replies": []}]}, {"body": "Not a good idea. It will be 127.5 after split. That's not a nice round number. Less people will want to buy it.", "score": 3, "replies": [{"body": "That’s a good point", "score": 1, "replies": []}]}]}, {"body": "What date retard?", "score": 19, "replies": [{"body": "Split is on 8/31. Buy calls once it adjusts so you don't get stuck with \"non-conforming\" contracts that could experience liquidity issues. \n\nThank you for coming to my TED talk. \n\nPS. Buy call debit spreads OCT. expirations.", "score": 31, "replies": [{"body": "Buy calls before and let em get split too", "score": 14, "replies": []}, {"body": "Oct debit spread gang 😎", "score": 6, "replies": [{"body": "Nov debit spread gang brother up 300% already", "score": 3, "replies": []}, {"body": "What strikes? I hate buying debit spreads so far out because they're a bitch to close out for full price when both legs are ITM, but am thinking of getting in on this.", "score": 1, "replies": [{"body": "Ive been having issue closing ITM debits as well. \n\nThinking of sticking to put credit spreads. \n\nHowever closing far OTM debit spreads have been easy.  But that isn't exactly a theta gang strategy.", "score": 2, "replies": []}, {"body": "Oops 10/2 495 and 10/2 500. I just got approved for spreads so this is my first one.. Do you end up having to lower the price to close? By how much?", "score": 2, "replies": [{"body": "Tough to say. I'm currently sitting on NVDA 8/28 spreads this morning that should be worth $2.50 a piece and are super deep in the money. My top leg is $445 and NVDA is at $510 right now. I tried closing them out for $2.30 a few times last week with no luck. I wanted to buy something else today so I submitted a close order at $2.48 today with no luck. Just going to let them expire for the full value at this point.\n\nThis is all through Robinhood by the way. Not sure if other brokers yield better results.", "score": 2, "replies": [{"body": "Oof okay thanks for the info. I'm on ToS so we'll see if it's any different.", "score": 2, "replies": []}]}]}]}]}, {"body": "So buy calls on Monday? I was thinking about going all in on friday", "score": 2, "replies": []}, {"body": "im holding 3 sep18 440 calls. Was going to let them roll through the split. I assumed they would just turn into 12 110 calls.... Will they still be \"non-conforming\"?", "score": 1, "replies": [{"body": "Non conforming is literally not an issue. If your contracts are 20% in the money do you think the market is gonna say “nah fuck that contract it doesn’t end in an even number”? 😂", "score": 8, "replies": [{"body": "Aren't there even minor pricing inefficiencies?", "score": 1, "replies": [{"body": "Sure, until the computer algorithms that are running nonstop detect an arbitrage event of an option trading at a discount relative to exercise value, and buy them - driving up the price.", "score": 2, "replies": [{"body": "Ah yes the algos. Makes sense. Thank you.", "score": 1, "replies": []}]}]}]}]}, {"body": "Or you could just buy calls that evenly divide instead of waiting for their premium to double before buying 🤡🤡 also, I’m sure the market will completely snub $121.25C contracts even when the stock is trading at 175 lol", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "No", "score": 1, "replies": []}]}]}, {"body": "Anything before the election", "score": 2, "replies": []}]}, {"body": "is AAPL really worth 32% more than it was just 4 weeks ago?\n\nIt's been awhile since stuff has gone down. But it does go down.", "score": 13, "replies": [{"body": "Are YOU really worth 32% more than you were a month ago?\n\nStonk only go up ⤴️", "score": 49, "replies": [{"body": "Lmao damn", "score": 9, "replies": []}]}, {"body": "puts on YOU, calls on AAPL", "score": 4, "replies": [{"body": "The Court of the Future Cannot Be Predicted awaits our trial.", "score": 2, "replies": []}, {"body": "I hold sept TQQQ for this very reason", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Lolz", "score": 1, "replies": []}]}, {"body": "doesn't fucking matter if it's really worth this much. it only matters if it will keep going up. just set ur trailing stop losses and let that shit ride.", "score": 2, "replies": []}, {"body": "shh", "score": 1, "replies": []}, {"body": "There's no school!! All remote learning. Every fucking soccer mom bought 3 iPads for there kids", "score": 1, "replies": []}]}, {"body": "Apple 600c for 1/15/2021, snagged then back when they were 9.60. Now they're over 20 and still on the up and up", "score": 3, "replies": [{"body": "Sitting on a couple 6/2021 600c. Not planning on selling for a bit.", "score": 2, "replies": []}]}, {"body": "Gonna be funny when AAPL goes -5% on monday and everyone on this subreddit goes bankrupt.", "score": 8, "replies": [{"body": "Facebook Limitless Market Cap Theory checked out. We good.", "score": 2, "replies": [{"body": "Not saying its guaranteed, but just keep in mind that it had an over 25% runup in the past month so a comparatively small correction isn't out of the question.", "score": 0, "replies": [{"body": "i think you are smewhat right.  If you look at the last split stock, their was a small correction but a few weeks after the split.  I think especially now with robinhood and people not understanding that a stock split is just cutting up a pizza but they actually somehow think they are getting more out of it.  So i think that pumps it up and then loike 2 weeks later we see some small correction until Late september when iPhone 12 is announced and people start dumping money back into aapl.", "score": 1, "replies": []}]}]}]}, {"body": "calls on AAPL puts on your loins", "score": 2, "replies": []}, {"body": "This is as simple as it fucking gets gentleman, buy AAPL/TELSA calls, the market is literally giving us a freebie.", "score": 2, "replies": [{"body": "I PICKED UP SOME CALLS THIS MORNING ON APPLE LETS GO", "score": 3, "replies": []}]}, {"body": "A friendly reminder that Dow Jones indices are going to have to sell \\~3/4 of their apple shares post split, and those indices are passive and completely dumb, and for a dumb reason they aren't market-cap weighted. They currently have 9% of their net value in apple shares. So 24B \\* 0.09 \\* 3/4 = 2.8B worth of apple shares are about to be sold by the biggest Dow Jones ETF DIA alone, so around 5-6 million shares are going to be sold by indices alone. So it's actually comparable to a single day volume of AAPL shares.\n\nIf I had to guess who is bigger, retail FOMO or 2.8B of passive money, I know my bets are on the passive money.", "score": 2, "replies": [{"body": "Why do indices need to sell their shares?", "score": 3, "replies": [{"body": "Because the dumb Dow Jones index isn't market cap weighted, but actually weighted according to single shares prices (a totally arbitrary number). So once apple's share are split, their proportion needs to change. If you want to know why was it designed that way - it's one of the oldest indices, I'm not even sure if they had the concept of stock splits back in the late 1800s.", "score": 1, "replies": []}]}]}, {"body": "isnt aapl free money? if you buy in now your avg is around 125$ after the split and it should skyrocket right..?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "nobody buys fractional shares, herp derp", "score": 3, "replies": []}, {"body": "For me it matters because I can sell covered calls now. And in general options will be cheaper to play. So I think that will have a big effect as well", "score": 2, "replies": []}, {"body": "you still have some folks like my parents who are old school.  You tell them apple stock is like 500 bucks a share and they like oh no, not at that price.  You tell them AAPL is only 125, they gonna say give me some of them.  Its just a different mindset.", "score": 2, "replies": []}]}, {"body": "It has more than quadrupled since the last split (didn't want to look up the word for 5x).", "score": 1, "replies": [{"body": "Quintuple, is the word for 5X", "score": 2, "replies": []}]}, {"body": "Was Monday the last day to grab options before the split? I got some calls today so I'm assuming they would also split?", "score": 1, "replies": [{"body": "Whatever you have open going into the weekend will hit the 4X1 split, it would be crazily inefficient to run a market with the same asset trading at multiple levels.", "score": 1, "replies": []}]}, {"body": "We think we've seen autist feeding frenzy and fractional share fuzzery... oh sweet baby just wait for those juicy $AAPL and $TSLA splits...", "score": 1, "replies": []}, {"body": "I have 100 shares and I hope to get a Lambo soon.", "score": 1, "replies": [{"body": "Ahh... The age old practice of using good investments to make bad ones.", "score": 14, "replies": []}]}, {"body": "AAPL 590 C reporting for duty", "score": -1, "replies": [{"body": "hopefully your strike is like 1/18/2021 or something", "score": 1, "replies": []}]}]}
{"title": "Jpow's Speech Tomorrow", "selftext": "I don't see any of you retards talking about this.\n\nJPOW will be speaking at the national Economic Policy Symposium tomorrow, and will announce the fed's upcoming goals regarding inflation and interest rates. That, and consumer confidence reports came in low, unemployment numbers are still high, COVID cases are rising again, and unemployment benefit claims are increasing.\n\nExperts are mostly predicting that Jpow will continue to keep interest rates low and pump inflation higher than normal to make up for low inflation from previous years to reach their 2% average.\n\nThis is probably the reason why the market is pumping today, people are expecting dovish policies tomorrow. This is what's going to determine if you should switch to being a gay bear or remain a chad bull.\n\nIT'S TIME TO PLACE YOUR BETS.\n\nMy Position: 4 TQQQ covered calls, strike 160", "id": "ih4i14", "created_utc": 1598466848.0, "score": 61, "upvote_ratio": 0.81, "num_comments": 76, "comments": [{"body": "Yep, nobody talking about his speech. except hundreds of people on this sub this week. Everything, that pumps after JPow promises more printing, has already moved since this morning. Almost like he already delivered the message. We, humans, often think that brilliant ideas come to our mind only to discover that the same thought visited so many others.", "score": 153, "replies": [{"body": "Love that last line.", "score": 16, "replies": [{"body": "Great thots have a way of getting around.", "score": 27, "replies": []}]}, {"body": "\"You know the worst part about inventing teleportation? Suddenly, you're able to travel the whole galaxy, and the first thing you learn is, you're the last guy to invent teleportation\"", "score": 7, "replies": []}, {"body": "you dont have to be a dick to the poor guy", "score": 2, "replies": [{"body": "Be dick to the poor guy. He sucks.", "score": 5, "replies": [{"body": "he is but a child", "score": 3, "replies": []}]}]}, {"body": "I haven't seen anything.", "score": -46, "replies": [{"body": "I see you still doing the Birdbox challenge", "score": 18, "replies": [{"body": "I almost never scroll past front page :)", "score": -13, "replies": []}]}]}]}, {"body": "I'm calling it.\n\nJPow stands up, purses lips, puts finger to lips and goes \"brrrrrrrrrrrrr\".", "score": 85, "replies": [{"body": "Then laughs maniacally.", "score": 11, "replies": [{"body": "Supreme money shooter in one hand, iPad with Robin Hood app in the other. He will be shooting freshly printed 100$ bills into the crowd saying that money’s not an issue as long as you’re here in ‘murica", "score": 11, "replies": []}]}]}, {"body": "“Our 4:1 split of the US dollar has gone well. As you can see the markets have priced it in accordingly. We now wait for that to filter through to the US consumer and the price of ordinary goods. I am the Fed chair and we have always been at war with inflation. We have always been at war with East Asia.”\n\nJ-the pump Powell", "score": 51, "replies": [{"body": "National coin shortage. You split the dollar into 4, how will I do my laundry?", "score": 2, "replies": [{"body": "With rocks down by the river bed peasant.", "score": 1, "replies": []}]}]}, {"body": "I sold 250k of options today. Speech may pump the market, but I’m taking zero risks. I’ll jump back in tomorrow once it becomes more clear what’s going on", "score": 47, "replies": [{"body": "Fucking lol. \"I'm taking zero risks.\" While holding $250k in options.", "score": 50, "replies": [{"body": "Was holding\\* But lol!", "score": 6, "replies": []}, {"body": "😂", "score": 1, "replies": []}]}, {"body": "Sold almost all my SLV positions today. Left myself with a put debit spread and a lone call spread in case we get some wild swings", "score": 4, "replies": [{"body": "You realize if cash is worthless, metals are money. I don't know where it's going to go, but metal has a better odds of moving. What direction is anyone's guess.", "score": 3, "replies": [{"body": "up or down but not sideways", "score": 1, "replies": []}]}]}, {"body": "Wew laddie, good luck!", "score": 3, "replies": []}, {"body": "positions... \n\n🥺👉👈", "score": 1, "replies": []}]}, {"body": "Market already pricing this has bullish... loading on SPY calls", "score": 19, "replies": [{"body": "What positions are you holding? I got some SPY calls expiring 8/31.", "score": 7, "replies": [{"body": "SPY 360 Nov , 400/420 jan 2021", "score": 6, "replies": []}]}, {"body": "Kind of wild, still don't know what do expect tbh. There were multiple golden sweep puts towards the end of the day today", "score": 1, "replies": []}]}, {"body": "Yeah youre right. NO ONE has been talking about this", "score": 29, "replies": [{"body": "Front page or bust.", "score": -34, "replies": []}]}, {"body": "im shorting the market, so you are all safe to buy calls.", "score": 12, "replies": [{"body": "Thank you brave martyr.", "score": 9, "replies": []}]}, {"body": "the vix says otherwise, SPY up along with vix is kinda concerning.  Either all that volatility unwinds and we rocket up or some serious stuff goes down tomorrow", "score": 8, "replies": [{"body": "im thinking the same thing, might just be a self fulfilling prophecy though", "score": 2, "replies": []}]}, {"body": "Loaded the boat on rocket 🚀 shares and calls. Hoping he threatens to pump inflation to the moon so I can have more worthless numbers", "score": 7, "replies": []}, {"body": "MMs are preparing to skim the cream, there’s a huge drop coming tomorrow", "score": 24, "replies": [{"body": "What? Everything's pointing to a surge", "score": 7, "replies": [{"body": "U r greedy. Surge is happening. Buy the rumors, sell the news", "score": 13, "replies": [{"body": "Instructions unclear, taking a third mortgage and yoloing", "score": 19, "replies": []}, {"body": "This adage hasn't been working on the recent market. Unless Powell deviates from the assumed plan, there simply is no catalyst to drop us. If anything, mid-term zero rates and overshooting inflation goals will continue to pump the markets.", "score": 7, "replies": [{"body": "by this logic, there was no catalyst for any of the previous dips we've experienced since QE was started back in March", "score": 1, "replies": []}]}]}, {"body": "That's exactly why MM will leave retail holding the bag.", "score": 2, "replies": [{"body": "You know market makers are zero delta right? Do you mean the banks and other institutions? \n\nThink of it this way. If they sell, they’ll have cash. Great. Now what to do with the cash? With inflation and a lower dollar value, if you’re not making money on the cash, you’re losing money. \n\nSo even if they sell and hold cash, they lose money. Better to keep it in the market. Where it can earn more money.\n\nIf anything, JPOW is allowing an increase of inflation, which further drives money into markets instead of holding cash.", "score": 2, "replies": [{"body": "I was talking out of my ass to make a joke, but thanks for the real info! Actually learned more about how the system works.", "score": 1, "replies": [{"body": "The MM do manipulate the market. That part is true. It’s just they don’t do it to make money. They do it to maintain a zero risk portfolio. Zero risk also means zero reward too though. It’s like buying a call and a put at the same time. \n\nYou buy a call. They short sell the stock, driving the price down. But if the market keeps pushing it up in spite of that, the MM will make as much money as they lose to your call you buy from them.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Exactly where it was 2 days ago!", "score": 2, "replies": []}]}]}, {"body": "Good thing my penny reit calls can't drop in price. Outside of those, I'm colossally fucked - like most of WSB - if there's a sell off. \n\nMy colleague is still holding 2,000 XOM $50 Jan 2021 calls. I'll tell him to visit this sub in 4 months", "score": 2, "replies": []}, {"body": "I FUCKIN HOPE SO", "score": 1, "replies": []}, {"body": "Last speech:\n\n“We aren’t even thinking about thinking about stopping [the printing]”\n\n*market drops 15%*", "score": 1, "replies": []}]}, {"body": "Printer gonna continue going BRRRR", "score": 5, "replies": []}, {"body": "All he has to say it's all good, chill your ass I got this then walk off the podium", "score": 5, "replies": []}, {"body": "Just buy more tech", "score": 4, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "https://www.reuters.com/article/us-usa-economy-housing-idUSKBN25L1SC", "score": 1, "replies": []}, {"body": "I'm talking about recent spikes, not the overall trend.", "score": -9, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I'm looking at regional cases, like the midwest.\n\nYes, overall the trend is down but some states are worsening.", "score": -3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "YW", "score": 1, "replies": []}]}, {"body": "Lmfao. Sometimes I think about trusting advice on this sub and then I realize there’s people this fucking dumb here. “LiKe ThE mIdWeSt” fuck outta here", "score": 0, "replies": [{"body": "yes, I'm sure the midwest contributes minimally to the US economy. \nfuckin dumbass", "score": -5, "replies": [{"body": "Swallow your pride and move on bud you’re making a fool of yourself.", "score": 1, "replies": [{"body": "Look up the combined GDP of the midwestern states.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "https://www.federalreserve.gov/newsevents/calendar.htm\n\nFilter by \"speeches\"", "score": 7, "replies": []}]}, {"body": "I sell long OTM covered calls on bear traps. What does that make me besides retarded?", "score": 3, "replies": []}, {"body": "\"We will backup the market and the economy with our many tools(money creation), rates arent going up and banks are strong, digital dollar would help fight the virus. that is all\"", "score": 4, "replies": [{"body": "Oh and \"there isnt enough inflation\"", "score": 9, "replies": []}]}, {"body": "bought more $SLV calls today for this", "score": 2, "replies": [{"body": "What calls did you get", "score": 1, "replies": [{"body": "All of them.", "score": 3, "replies": []}]}]}, {"body": "If this all happens, housing market is gonna keep flying.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/yosimba2000 don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "QQQ pigs still holding into JPOw tmrw will get bear fucked. \n\nLong IWM/QQQ.", "score": 1, "replies": []}, {"body": "What time is the speech?", "score": 1, "replies": []}, {"body": "What's your strike date on those calls?\n\nI ran the numbers for 9/4 and it's bloody red with theta.", "score": 1, "replies": [{"body": "Expiry was end of this Friday.\n\nI actually pussied out and closed them for -$20 lol. Way too volatile for me, I'm not ready yet.\n\nReplaced them with four SPY 354 calls exp. this Friday.", "score": 1, "replies": []}]}]}
