{"title": "Should I buy Apple NOW or Later?", "selftext": "Stocks for Apple are currently going for 425usd . 569.87cad for me. I want to start stocks with only $1,000. Should I do it now, or do you think it will dip with the 4 for 1 split?", "id": "i2pvan", "created_utc": 1596425588.0, "score": 24, "upvote_ratio": 0.75, "num_comments": 87, "comments": [{"body": "If you see them as a $2T company and most people do. Getting in now would be very beneficial. If you got in on Friday and they did the split you would see a 12% return when all the R H push the company to $2T. A lot of people are going to see the $100 price tag as affordable which is why Apple did, it's cosmetic and plays the physiological game. It's already working because a lot of my friends are already saying \"I'm gonna wait for the $100 price tag.\" So those people are going to drive your return up. Apple is always a long term play though but to capitalize on the stock split, definitely now.", "score": 30, "replies": [{"body": "Appreciate it dude, definitely helps me with buying it now, rather than later! I have to set up an account still (unsure on what to go with!) and buy it!", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I appreciate ya! 3$ fee for a month aint bad ! I’m 21, so that’s a hype! haha \n\nI’ll definitely check it out! I’m with Scotia, so I looked at iTrade, but fees are just sucky!", "score": 2, "replies": []}]}]}, {"body": "So buying it now could potentially be cheaper than waiting until it drops to $100 range in Aug 25?", "score": 0, "replies": [{"body": "Sounds like what he’s saying will happen is that people will see $400+ right now and say, “Let’s wait until they split”. When they split it will look cheaper and people will buy like they’re rabid which will drive the price up which will increase your original investment.", "score": 5, "replies": []}]}]}, {"body": "Time IN the market beats TIMING the market. Buy it now and if it drops, buy it again.", "score": 46, "replies": [{"body": "Appreciate it! I was going to buy it at the beginning of the month for 373, missed out cos I was nervous on buying stocks at first.. dunno why!", "score": 5, "replies": [{"body": "You’re investing $1,000...start to try and be realistic. The government literally gave people $1,200. If you’re scared to lose $1,000 you can’t afford to invest at this time. Once again though be realistic, is Apple going to go bankrupt anytime soon? Invest in good companies like Apple and you will be fine.", "score": 6, "replies": [{"body": "Very true! I actually appreciate this comment. The government didn’t give me any money, (I am very grateful to have a job throughout the covid season), but now I know that everything will be fine. \n\nThank you!\n\nHope you’re having a good night.", "score": 8, "replies": [{"body": "Post a screenshot on here when you buy your stock 👍", "score": 1, "replies": [{"body": "Will do! \n\nThanks for your comments :)", "score": 3, "replies": []}]}]}]}, {"body": "While you’re generally right, that advice has only been tested and is therefore only applicable for the broader market, not individual stocks. \n\nAnd while, with Apple, I think you should get in now, you can’t use that adage with every company. Otherwise you’re going to have a bad time.", "score": 1, "replies": [{"body": "Very true! I posted this last night and it was at 425. I didn’t get to set up my account last night, missed buying in and its fluctating 435+ .. those small money matters actually mean a lot to me, due to the USD to CAD conversions. Just don’t know whether to drop in now, or wait and see if it dips!", "score": 1, "replies": []}]}]}]}, {"body": "Well, now's the best time to buy if you want more shares.\n\nAt least that is what my Robinhood YouTube mentor told me.", "score": 22, "replies": [{"body": "Just remember your dollar value doesn't change at all. You're not gaining anything, its a cosmetic change to the stock.", "score": 11, "replies": [{"body": "I don't need the lesson. Although, given OPs response, perhaps others don't get the joke.", "score": 4, "replies": [{"body": "I didnt, aha... got downvoted and was embarrassed by it.. so thats why I deleted the comment — sorry!", "score": 4, "replies": [{"body": "No worries. Just remember, investing is a long game. What is happening today isn't normal under any circumstance. There will be a leg down and it's going to be depressing for newbie millennial traders.", "score": 2, "replies": [{"body": "Very true! & yes, I’m actually sure of that! aka me? haha! I’m really excited to start in the stock game!", "score": 1, "replies": [{"body": "It's not a game. Read this. Especially if you trade on Robinhood.\n\n https://www.profgalloway.com/iaddiction\n\nGood luck.", "score": -1, "replies": [{"body": "I’m just getting new to stocks, I don’t have an account set up just yet. \n\nI think I definitely may have used the wrong word choice! Stocks aren’t a game, and it can be seriously addicting & unhealthy! Games that eager people onto stocks, and get them addicted to some extent would be EA’s Ultimate Team game modes (buying cards low, selling cards high) and Animal Crossing’s Turnip “Stocks” (same concept) could potentially grab peoples interest in a bad way. \n\nSorry for the miscommunication, and following me up with an article to read. I appreciate your comment! \n\nThank you. \n\nHope you are doing well :)", "score": 3, "replies": [{"body": "You're welcome. You too.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "i get the joke. i liked your joke :)", "score": 1, "replies": []}]}]}]}, {"body": "Time in the market beats timing the market", "score": 7, "replies": []}, {"body": "Don’t listen to the negative comments here. IMO it depends on how much you want to invest, if you are able to pay for a current share of AAPL you should definitely do it know before the stock split. If you have less capital and want to diversify a bit, you could wait for the split share and maybe buy 2 shares and and the same time buy maybe 1-2 MSFT shares🤷🏻‍♂️", "score": 5, "replies": [{"body": "Thanks man! I’m new here & new to the stock game..lots of my games (NHL HUT, if you heard of it, ACNH - lol) have to deal with buying low, selling high. I’ve been doing it for awhile now, and really enjoy it! \n\nI’m thinking of doing a share or 2 of apple, a share of Microsoft, and a share of Disney! maybe something else, but I’m very unsure. My budget to start is 1-2k.", "score": 2, "replies": []}]}, {"body": "Apple is always a good investment for the foreseeable future. It won’t be “quick” money, but it’s a good long term play.,4-1 split should be good because it will allow smaller investors to take part. I say invest Monday and hold for the time being.", "score": 10, "replies": [{"body": "Exactly this. Companies like Apple and MSFT are past the potential of turning into 5 baggers in a year’s time... but they will almost assuredly give you years and years of steady growth.", "score": 3, "replies": []}, {"body": "How can something always be a good investment irrespective of price? Answer: it can’t. AAPL is a lousy investment if you overpay. \n\nStock splits don’t create value.", "score": 2, "replies": [{"body": "The value of the company does not change, but  it has had a bullish effect on stock in the past cases. According to David Ikenberry on average the stock undergoing a split beat the market by 7.9% over the year and 12% over the three yrs.", "score": 2, "replies": [{"body": "That happens because stock splits signal that the company expects further improvement in economic fundamentals. This was already priced into AAPL at the time of the stock split announcement. \n\nBut it’s not the split itself that adds lasting value to the share price; increasing cash flows do.", "score": 1, "replies": [{"body": "Do what you will with his study, I feel now is not optimal to buy in.", "score": 1, "replies": []}]}]}]}, {"body": "Not OP but on the same boat. \n\nQuick question about the 4-1 split. If I get 1 share, at the split will I get +4?  I apologize if that’s a basic question. I plan on buying some tomorrow as well to prepare for this split.", "score": 1, "replies": [{"body": "Correction, you get 3 additional shares for each share you own. For instance, if you own 1 share now, post split you will own 4 shares.", "score": 7, "replies": [{"body": "Awesome. Thanks.", "score": 1, "replies": [{"body": "Remember, post split, value of 4 stocks is same as 1 stock of record at the close of business on August 24", "score": 1, "replies": []}]}]}]}, {"body": "awesome, appreciate it! it’ll be my first stock I wanna buy!", "score": 1, "replies": [{"body": "Also consider Amazon, Microsoft, and PayPal for sure. E-commerce is the future.", "score": 2, "replies": [{"body": "what is this 2005?", "score": 11, "replies": []}, {"body": "I was lookin at microsoft, might be a good buy if they pick up TikTok! If not, I can see it fallin, but I’d probably just hold onto it! \n\nI was lookin at Air Canada, too! It is low , and stock could go to 0, but its a big airline company, so never really know. I appreciate it!", "score": -3, "replies": [{"body": "Microsoft is not falling just because they’re not buying TikTok lol", "score": 15, "replies": []}]}]}]}]}, {"body": "Buy now and hold long. \n\nYou can also maybe buy fractional shares depending on your broker, if u can't afford it. Or wait for the split.\n\nCheers", "score": 3, "replies": [{"body": "Appreciate it bro!", "score": 2, "replies": []}, {"body": "I’m doing a little research in this. Since I don’t have the full amount for 1 share, would I benefit from buying fractional shares before the split? Or should I just wait for split.", "score": 1, "replies": []}]}, {"body": "> or do you think it will dip with the 4 for 1 split?\n\ndepends on your definition of drop. a split doesn't change the market cap, it just splits the  value of the stock among more shares.\n\nif you own 1 share valued at $400 before the split, after the split you'll own 4 shares worth $100 each. it's like getting four quarters for your dollar. you didn't gain or lose anything, you just changed how it's represented.\n\nas far as what it will do after the split, who knows. if you're only looking to invest $1000 total, i'd avoid apple and go towards companies that are solid but more in the $30-$60/share range.", "score": 3, "replies": [{"body": "That’s fair! I made my own little portfolio, just have to set up the aaccount.", "score": 1, "replies": []}]}, {"body": "Are you looking at short term gain? If so, there are plenty stocks to pick from. If long term, buy anytime at any red days, or any days aapl just don’t move much.", "score": 2, "replies": [{"body": "Long term gain, I gotta list of stocks I wanna buy! \n\nI appreciate it man!", "score": 1, "replies": [{"body": "Sure. Aapl is the first stock I bought in 2008. Hold it til this day (kind of forgot about it since I have no plan to sell). Spent $1000 on it and it’s worth $33k now. You won’t regret it.", "score": 8, "replies": [{"body": "Damn! Nice profits man! I totally appreciate your comments :) \n\nIs it okay if I PM you? I’m new to stocks, and you seem to know what you’re doing!?", "score": 1, "replies": [{"body": "Pm anytime. I’m just really lucky about buy and hold Apple stocks.", "score": 1, "replies": []}]}]}]}]}, {"body": "Anyone know why Apple is suddenly in the mid 400s when it’s been in the high 300s for so long?", "score": 2, "replies": [{"body": "Earnings were much better than expected and the 4-1 stock split. Typically, Apple rallies after they split their stock.", "score": 2, "replies": [{"body": "So when they split last time i bought like 5 @ 92ish. Wish I would’ve gotten more but that’s what was in my account at the time. Any suggestions about buying more when it splits?", "score": 1, "replies": []}]}, {"body": "Think earnings", "score": 1, "replies": []}]}, {"body": "Whatever you decide to do (I bought AAPL for $210 10 years ago and held) open up a TSFA and protect all of those juicy gains and dividends from the taxman. Trust me on this!", "score": 2, "replies": []}, {"body": "Now a later!  Just continue to buy!\nMore info in splits:\nhttps://youtu.be/9WwECYoLNBQ", "score": 2, "replies": []}, {"body": "Haha I’m the same. I bought Apple while in the shower changing my finance podcast a few days back at 400USD, now at 440USD. \n\nTime in the market for sure— if it dips, buy more. Keep in mind if you buy 1 stock, on the split date (I believe the 25th if august), you’ll have 4. Long term that’s a beautiful op.", "score": 2, "replies": []}, {"body": "NOW is the time for Apple!\n\nOnce their stock splits, there will be a huge rally since everyone will see it as \"cheaper\" and put their free stimulus money into it", "score": 4, "replies": [{"body": "NOW I should really make an account to buy stocks!! I definitely should’ve done this back when market crashed..kept talking about it to my friend, neverr did... definitely should’ve!! \n\nI’m gonna make one tomorrow :)", "score": 2, "replies": []}]}, {"body": "If you are talking right this moment/week, I would reccommend waiting. It is overvauled right now(Went up 10% Friday) and hit new highs. I would wait until it dips.", "score": 2, "replies": [{"body": "It already started to dip", "score": 2, "replies": []}, {"body": "and went up another 7% today on european market", "score": 1, "replies": []}]}, {"body": "I say it $376 and thought it would dip. Then it rose to $400 and then to $414. It dipped Friday to $406 and I still didn’t but because I wasn’t liking the overall market.\n\nI said fuck it and threw a few thousand at it $418 and now it’s $442 basically Apple stock is as safe as it gets.", "score": 2, "replies": []}, {"body": "What broker you using for US stocks in Canada?", "score": 1, "replies": [{"body": "I’m using scotia’s iTrade, parents wont let me use IB.", "score": 2, "replies": [{"body": "Why not? I use IB and it’s real good", "score": 1, "replies": [{"body": "my parents don’t want me usin a 3rd party website for trades n such, makes sense! they’re used to the bank, so", "score": 1, "replies": [{"body": "That doesn’t make sense, they are insured all the same. The bank has no more protection than any other regulated broker", "score": 1, "replies": [{"body": "I’m very unsure myself. I just know that’s what they said, and maybe later on I’ll switch to IB.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "hey OP, just wondering if your purchased any? I purchased 5 shares worth and hoping for the best! Good luck :)", "score": 1, "replies": [{"body": "Hey! \n\nI tried to set up an account way back when I posted this, but I kept getting stuck at a part. \n\nI finally got an appointment booked with my bank (iTrade) — yes I know commission fees suck, and such! but I wanted to try an account with my bank first. Then I might make the move to IB, or somewhere else!\n\nI got an appointment for the 13th! & I’ll buy a share then! I think I might hold onto it though for a long term investment, though! thoughts? \n\nGood luck!! Hope it does well for you! \n\nSoon it will be my first stock purchase, along with Disney!", "score": 2, "replies": [{"body": "That sounds great! I’m new to investing too so I decided to just open a Robinhood account since I heard how easy it is to navigate in the app.\n\nI am also planning to hold Apple for long term because I feel like they could be a lot of growth in the future. Apple is a leading phone brand anyways so I can trust holding onto their share! \n\nThe stock market fluctuates a lot so it could be intimidating but since I am doing long term hold, I am just going to try to stay positive. Good luck and would love to hear more about how it goes for you! :)", "score": 1, "replies": [{"body": "Oh sweet!!\n\nYes, I am too! Even tho it is intimidating cos it fluctuates a lot,, I’m sure it’ll actually be fine!!!\n\nThanks!! You as well!! \n\nI’ll probably follow up witha post later on when I buy my shares for long hold + some short term ones which will help in buying more long term stocks && saving in general!", "score": 2, "replies": []}]}]}]}, {"body": "I don't buy stocks at all time highs and I wouldn't advise someone to do it.", "score": 1, "replies": [{"body": "That is a very fair point!", "score": 0, "replies": []}]}, {"body": "let me ask my crystal ball", "score": -3, "replies": [{"body": "wicked, whats it say?", "score": 4, "replies": []}]}, {"body": "🙄🙄🙄🙄🙄🙄🙄🙄", "score": -1, "replies": []}, {"body": "dude no one here has a clue just buy the dam stock . Stupid questions everyday about apple give us all a break", "score": -14, "replies": [{"body": "I’m pretty new to the sub, hah. I’m just gettin into stocks, and wanted an opinion. Sorry if this is on the feed a lot, I wasn’t trying to make any harm, was just curious.", "score": 10, "replies": [{"body": "Ignore the trolls.", "score": 6, "replies": []}, {"body": "The dude’s just a bloody boot licker. Questions like these are fine in this subreddit. We’re a community and we’re here to help, friend.", "score": 3, "replies": [{"body": "Thank you!", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": -12, "replies": [{"body": "Something something plant a tree", "score": 2, "replies": []}]}]}
{"title": "I got $850 back from Airbnb from covid cancellation... what’s the yolo?", "selftext": "Edit: So far I will buy on open monday\n1x MSFT Call\n1x HMHC Call\n1x PEIX Call\nand 100 shares of BNGO\nAirbnb refunded my 2 week stay in Costa Rica... so here I am with $850 I forgot about, back in my pocket. \n\nSo tell me autists, what CANT go Tits up?\n\nEdit: got removed because it wasn’t long enough, idk what else to say... if this play doesn’t workout my wife’s boyfriend is going to murder me, he wants to reschedule the costa trip so he can fuck my wife in a new country.", "id": "i2ors9", "created_utc": 1596420994.0, "score": 64, "upvote_ratio": 0.85, "num_comments": 85, "comments": [{"body": "puts on airbnb obviously have you not seen a movie before thats called foreshadowing", "score": 106, "replies": [{"body": "NVM privately owned", "score": 42, "replies": [{"body": "Lololol fuckkk", "score": 28, "replies": []}, {"body": "Now its not", "score": 3, "replies": [{"body": "time to buy puts and cash in on this insider information, thanks for the bump brother", "score": 2, "replies": []}]}]}]}, {"body": "AAPL especially with ex dividend coming up, who in their right mind would sell it??", "score": 31, "replies": [{"body": "Priced in", "score": 9, "replies": []}, {"body": "“Ex dividend” ?", "score": 0, "replies": [{"body": "Google is your friend 🥴", "score": 22, "replies": []}, {"body": "Yeah its dividend is going ex bro", "score": 11, "replies": [{"body": "Ex gonna give it to ya!", "score": 21, "replies": [{"body": "What?", "score": 6, "replies": []}, {"body": "Most underrated post of the year", "score": 2, "replies": []}]}]}]}]}, {"body": "AAPL October 500c.", "score": 25, "replies": []}, {"body": "Damn wish I could forget $850", "score": 15, "replies": [{"body": "It’s easy just make enough money to buy cocaine, and then poof you forgot $850", "score": 34, "replies": []}, {"body": "It’s easy, just forget about it.", "score": 12, "replies": []}]}, {"body": "Silver has seen insane and I mean completely insane call volume.\n\nI was researching it over the weekend and I don't know if I have this exactly right but I think there was more call volume on silver in the past couple weeks than there has been in the past 3 years.\n\nSome of the options that I saw were over 15 million dollars per strike price.\n\nIt seems like the overwhelming majority of the long positions on Silver are going to October and November and they consist of in the money strike prices all the way up to $40 for the silver ETF   .\n\nI will begin to take a very close look at buying the  Nov. 20th 27$ strike price for 1.46.  If silver happens to open down I will double down on that position and just hold it", "score": 11, "replies": [{"body": "Do you have a source on this activity? And how has volume on gold been?", "score": 1, "replies": [{"body": "Gold has been off the charts how do I put pictures on here?    I tried doing it before I'm not going to get into a long rant but I did it before as an original post on like five different things that paid off in huge amounts but for some reason the moderator deleted all of them so can I just post it on here?", "score": 2, "replies": [{"body": "I got no clue 🤷‍♀️ I'll check the Google-verse. Thanks for the heads up \n\nI'm holding long dated GLD calls ($240) and SLV mid August calls at $22 for 8/21\n\nThinking about selling SLV this week and going further out if there's a dip", "score": 2, "replies": [{"body": "Just look at an option table I'm sure you can do that.   Look at options table for silver in October and November and then look at the volume the volume is just absolutely insane right now.   When you see over a hundred and fifty thousand calls that's really crazy off the charts if you multiply that by 3 that's $450,000 and then add two zeros that's 45 million bucks.    People aren't playing when it comes to Silver and Gold for that matter", "score": 2, "replies": []}]}]}, {"body": "Yes but I don't know how to put it on here let me try", "score": 1, "replies": [{"body": "Imgur.com", "score": 2, "replies": []}]}]}]}, {"body": "Long dated KODK puts", "score": 11, "replies": [{"body": "Bought Jan 5p for Kodak when the stock was at 38 dollars for 1.5/contract; stock is now 21 dollars. Wow with a drop of 45 percent in a few days you'd think my puts skyrocket right? Nope, down $0.5 since then. Why? Couldn't fuckin tell ya\n\nEDIT: Jan is the farthest out I could buy and the price was cheap as shit anyways", "score": 2, "replies": [{"body": "Bought 2.5p aug 21 when kodak was trading 40 ish. Dropped to 20's and realized I was losing money despite such a drop so I sold them for a small loss. Next day would been down even more lol", "score": 1, "replies": [{"body": "you're wiser than me, I'm just taking my loss (I only own 1 contract and I can afford to lose 100 dollars) - still got a few months to make a little bit", "score": 1, "replies": []}]}, {"body": "Go to profit options calculator, put the ticker in, Kodak’s stock price, then current price of option and implied volatility. It’ll graph exactly what you need at what for profit.", "score": 1, "replies": [{"body": "Thanks and yea I’ve looked at that before but I’m too much of a retard to understand anything besides green good red bad", "score": 1, "replies": [{"body": "No you're not. I can help you, pm me.", "score": 1, "replies": []}]}]}, {"body": "Same. I have 1/21 $2.5 puts and they’re cheaper now than they were when I bought near the top.\nIt’ll come around though. The company is dogshit and no one is in KODK long term. Below $10 end of month", "score": 1, "replies": []}]}]}, {"body": "Msft 8/7 210c", "score": 9, "replies": []}, {"body": "HMHC calls", "score": 8, "replies": [{"body": "No one else is talking about this here and idk how I feel about that.", "score": 2, "replies": [{"body": "ZVO killed it and it sitting in the $4.8-5 range and will go up as more school districts, like Chicago try to go all online", "score": 1, "replies": [{"body": "Alright I'm banking this is the move then.", "score": 1, "replies": []}]}]}]}, {"body": "I’d wait until after market open to buy msft. Luckily WFH tmr so i get to watch those candles.", "score": 4, "replies": []}, {"body": "PRPL 35c 8/21", "score": 5, "replies": []}, {"body": "Microsoft 💰", "score": 7, "replies": [{"body": "For real?", "score": 2, "replies": []}]}, {"body": "Aapl", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Inversed", "score": 2, "replies": []}]}, {"body": "Trade on NFLX pivots this week; 475 support and 505 resostance", "score": 3, "replies": []}, {"body": "EV company called Tesla that shoots apes in to space on the weekend", "score": 4, "replies": []}, {"body": "1 chgg90 and 1 msft call", "score": 3, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/kitkarsten the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "ELY $20 8/21", "score": 2, "replies": []}, {"body": "CLX 260? Maybe a little late but still a runner imo.", "score": 2, "replies": []}, {"body": "UVXY Calendar Spreads", "score": 2, "replies": []}, {"body": "It's only fair that you hold that $#@& for the AirBNB IPO.\n\nIt's the least you can do.", "score": 2, "replies": []}, {"body": "NWARF and BNGO", "score": 3, "replies": [{"body": "Why", "score": 1, "replies": [{"body": "BNGO has countless catalysts plus they have a consortium this week.\n\nNWARF just hit 52 week low, but are poised to bounce back. From $5 to now $0.26. Nowhere to go but up.", "score": 6, "replies": [{"body": "This has aged well 🚀🚀🚀🚀", "score": 4, "replies": []}]}]}]}, {"body": "Not financial advice, just want I’m doing. 1 word.\n\nPuts.", "score": 4, "replies": []}, {"body": "XLK or TQQ calls dated two months out, cash when they're nicely profitable next bump.\n\nIf you want something riskier,  OTM call on HRC with a short expiration", "score": 1, "replies": []}, {"body": "https://www.marketwatch.com/amp/story/mens-wearhouse-jos-a-banks-parent-tailored-brands-files-for-bankruptcy-report-2020-08-02", "score": 1, "replies": []}, {"body": "AirBnB puts obvi", "score": 1, "replies": []}, {"body": "Hewlett Packard is my sneaky play.", "score": 1, "replies": [{"body": "Why", "score": 1, "replies": [{"body": "Its a great Value Play. Lots of people WFHing and using corporate laptops, its trading pretty damn close to its 52 week low, and is one of the few companies that has been in the green one the past couple days. Id buy some HPE now rather than wait. Not to mention its super cheap, so load up lol.", "score": 1, "replies": []}]}]}, {"body": "PLNT 9/18 70c", "score": 1, "replies": []}, {"body": "CVS", "score": 1, "replies": []}, {"body": "Jumia put or Etsy call", "score": 1, "replies": []}, {"body": "The senator buying a bunch of AAL stocks has me interested. Buy AAL calls. \n\nOr puts, I don’t know if any of us are sure how this works.", "score": 1, "replies": []}, {"body": "Preorder two NKLA Badger's for $500.  Take the rest and buy NKLA calls.   \nYour two preorders will double the total number of preorders they have, causing NKLA to moon.", "score": 1, "replies": []}, {"body": "UVXY", "score": 1, "replies": [{"body": "What’s that", "score": 1, "replies": [{"body": "Clearly a play that can’t go tits up. Shut up and do puts... or calls...", "score": 6, "replies": []}, {"body": "A yolo play", "score": 1, "replies": [{"body": "Fuck yab", "score": 1, "replies": []}]}]}]}, {"body": "BIL", "score": 1, "replies": [{"body": "Imma send you a bil", "score": 2, "replies": []}]}, {"body": "Take your initials, throw them in the trash.\n\nPEIX calls 8/21 idk what strike cause it’ll change on Monday but like 15% OTM", "score": 1, "replies": [{"body": "Yo take that shit back to r/pennystocks, have some respect.", "score": 3, "replies": [{"body": "Just buy like, more contracts", "score": 3, "replies": []}]}, {"body": "PEIX yo the top", "score": 0, "replies": [{"body": "Huh", "score": 1, "replies": []}]}]}, {"body": "KODK calls, furthest strike out expiration Friday", "score": 0, "replies": []}]}
