{"title": "Tsla will double again purely from stupidity", "selftext": "[removed]", "id": "iiu0dr", "created_utc": 1598713983.0, "score": 61, "upvote_ratio": 0.87, "num_comments": 88, "comments": [{"body": "$900 is still cheaper than $2200", "score": 65, "replies": [{"body": "\"For only 10 easy payments of $899.99...\"", "score": 19, "replies": [{"body": "I also have an amulet I can sell to you that controls the Tsla stock price when rubbed.", "score": 8, "replies": [{"body": "If Musk really does come up with a million mile battery, forget the $5,000 target (or $1,000 as of Monday), the target will be more like $20K. There's a lot of reason in his madness as well as in his company's stock price.", "score": 1, "replies": []}]}, {"body": "And 1 complicated payment", "score": 2, "replies": []}]}, {"body": "Lol", "score": 5, "replies": []}]}, {"body": "This will apply with AAPL as well", "score": 40, "replies": [{"body": "Are you guys saying it's wrong to buy in on Apple and tesla on monday? Because I don't see their valuations going down, I was actually going to buy Apple myself on monday.", "score": 7, "replies": [{"body": "There will be plenty of people who will see the new market price for TESLA and AAPL and go all in thinking its super cheap now when they aren't aware the value is still the same", "score": 8, "replies": [{"body": "Well the reasoning may be wrong but the action is not yeah? Splitting a stock is pretty much always a good sign for growth.\n\nBut yeah like when some burger company released a 1\\3 pound burger and it failed because consumers thought it had less value than the quarter pounder.", "score": 3, "replies": [{"body": "My point is that they're not buying in for the right reasons, so who knows what their intentions with their shares will be. Buying in on Monday's open is not bad if considering as a long-term investment.", "score": 1, "replies": []}]}]}, {"body": "Apple is a great buy going forward. They are still undervalued imo", "score": 1, "replies": [{"body": "I saw an article saying the pre split stock price going as high as 700 even, which didn't sound unreasonable to me. I was gonna buy it yesterday but all my money was in a mutual fund and I didn't get it sold until today so I didn't get in before the split. As long as I buy in the open though it shouldn't really matter right? I'm really new to this sorry for the stupid questions.", "score": 2, "replies": []}, {"body": "Their PE ratio is great for a tech stock and growth isn’t slowing down much even during covid. Best tech stock to buy a bunch of and sleep on for a few years/ forever lol", "score": 2, "replies": []}]}]}]}, {"body": "This is a good thing for my 15 shares after the split lol", "score": 16, "replies": [{"body": "Ayyy Ill have 15 too.", "score": 3, "replies": []}]}, {"body": "Like I said, 35% for Tesla and 20% for Apple. People think I’m joking, but human psychology wins out.", "score": 31, "replies": [{"body": "That’s what I’m banking on too. Increased my holdings in both- mostly Apple since Tesla makes little sense to me. I hope you’re right.", "score": 4, "replies": [{"body": "Good guy Dolphin", "score": 4, "replies": []}, {"body": "Every time I see Tesla I get madder and madder.\n\nI refuse to buy in. You can literally scroll through the NASDAQ blindfolded right now and pick a stock with comparable rates of return and a safer foundation.\n\nThat said, if it accelerates the EV wave into normalcy and majority then I'm for that.", "score": -3, "replies": [{"body": "That’s fine. I mean, on paper you’re right. They don’t have the numbers to back up that valuation.\n\nBut if I may play devil’s advocate, people said the same thing about Amazon and Netflix. If you’re waiting to see the results, it’s too late. A good investor has a good imagination. Otherwise you’re just an accountant. And there’s an argument to be made that Tesla is the tech company of the future.", "score": 2, "replies": [{"body": "That's fair. I'm new to this and have a lot to learn. Still probably gonna stick with Apple though.", "score": 1, "replies": [{"body": "Hi new to this and have a lot to learn, I'm Dad👨", "score": 1, "replies": []}, {"body": "Sometimes being conservative is the right move. I’m going in to Tesla with eyes wide open- this might be the stupidest 2K I’ve ever blown. But I am willing to gamble it at this point. \n\nIt’s wise on your part to realize it as such.", "score": 1, "replies": []}, {"body": "Sometimes being conservative is the right move. I’m going in to Tesla with eyes wide open- this might be the stupidest 2K I’ve ever blown. But I am willing to take a gamble on it at this point. \n\nIt’s wise on your part to realize it as such.", "score": 1, "replies": [{"body": "Nah well I'm only 24 so...after liquidating my mutual fund...I am caving and am buying just one share of tesla on the open. Just cause it's 400. Go for growth.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I DONT CARE HOW STUPID IT IS AS LONG AS I MAKE MONEY", "score": 25, "replies": [{"body": "Exactly. Like the market always makes sense. \n\nJust another whiny post.....", "score": 10, "replies": [{"body": "Boomer sad that he didn't buy it at $200 :P I wouldn't pay attention to these.", "score": 2, "replies": []}]}]}, {"body": "Agree. The same will happen with Apple.", "score": 6, "replies": []}, {"body": "Ride that fucking wave boys", "score": 7, "replies": []}, {"body": "i won‘t be mad about it", "score": 6, "replies": []}, {"body": "I hope so, I'll be buying some Deep OTM LEAPS on it.", "score": 4, "replies": []}, {"body": "I'm buying the week leading into battery day, should be a sell off as that begins. \n\nEither way there will be a good run the first two weeks of Sept as most can afford shares.", "score": 3, "replies": []}, {"body": "Who cares? \n\nRide the wave and stop complaining.", "score": 3, "replies": []}, {"body": "True", "score": 2, "replies": []}, {"body": "Lets hope so 🤞🤞🤞", "score": 2, "replies": []}, {"body": "That would be ideal", "score": 2, "replies": []}, {"body": "Doubling again? I am your huckleberry", "score": 2, "replies": []}, {"body": "Keep buying tsla.", "score": 2, "replies": []}, {"body": "I am hoping that the broader retail market agrees with the same ideas presented here - but for AAPL. I put 30k speculating that AAPL goes back to 500 / share within the next 12 months - effectively doubling my bet.. because thats what this is at this point.", "score": 2, "replies": [{"body": "Okay, a 10 trillion market cap with a PE ratio of nearly 200 makes complete sense (with your prediction of a 5x)\n\n/s (it’s sad it’s needed nowadays)", "score": 1, "replies": []}]}, {"body": "Average volume is just about 15 mil... that would be a lot of retail (read: RH) investors", "score": 1, "replies": []}, {"body": "I think it’ll ride back up until battery day and then level out or drop. Can’t see it going up-to 2k again, but let’s see.", "score": 1, "replies": [{"body": "Never underestimate the stupidity of people", "score": 1, "replies": [{"body": "Yeah, people are so stupid making 400% gains while the smart boys like you are on the sidelines making $0.", "score": 8, "replies": [{"body": "Since reading comprehension isn’t your thing... I said people are stupid and will probably run Tesla up again. \n\nAnd nice assumption retard...Who’s on the sideline? I’ve made plenty in Tesla during this run up. \n\nPutting your 🤡 show on full display this morning", "score": 0, "replies": [{"body": "You must be fun at parties.", "score": 2, "replies": []}]}]}]}]}, {"body": "Might go the other way for the same reason", "score": 1, "replies": [{"body": "So what you’re saying is buy more?", "score": 2, "replies": [{"body": "Honestly at this point, I am clueless, made so much money with this meme stock and no idea why or how.", "score": 1, "replies": []}]}]}, {"body": "It's just unbelievable how so many ppl dont even know splits dont make any changes in market caps. You will be surprised by the number of posts saying \"AAPL and TSLA are so cheap now. ALL IN!!\". Not sure about \"doubling\", but they will go up for sure next week.", "score": 1, "replies": [{"body": "Ya but $1 off at safeway is more attractive than normal price even though the product is the same", "score": 1, "replies": []}]}, {"body": "So, if we know it’s going to double, is it stupid to buy Tesla, or smart?", "score": 1, "replies": []}, {"body": "Lol. This sub is so trash nowadays.\n\nIt has a market cap of 500b and is primarily owned by institutions. Retail is not gonna pump this to a 1T market cap it doesn’t have the buying power.", "score": 1, "replies": []}, {"body": "People are dumb? This isn’t news. Intelligent people make money on this :).", "score": 1, "replies": []}, {"body": "I think people overestimate the power of the combined weight of the retail investor to move stocks.  Institutions know splits don’t mean diddly and they won’t be so keen on moving the stock in my opinion", "score": 1, "replies": []}, {"body": "Imagine what an Amazon split would do to their stock. My God", "score": 1, "replies": [{"body": "id go all in on announcement", "score": 1, "replies": []}]}, {"body": "Gonna squeeze for a bit while rebalancing and profit taking happens, all the while Robinhood gang buys and buys and buys...\n\nEdit:  also keep in mind, 5x the float now so it’ll be going up, but a bit slower than before.", "score": 1, "replies": []}, {"body": "Traders = Follow the action (up or down) just get tendies with the flow. I’m with OP. \n\nInvestors = Don’t buy if you don’t believe in the long-term fundamentals and growth. \n\nPositions: AAPL $510c 9/4", "score": 1, "replies": []}, {"body": "Free 99", "score": 1, "replies": []}, {"body": "Up 13% .....", "score": 1, "replies": []}, {"body": "When I checked to see how much calls/ puts are going for on AAPL and TSLA it wouldn’t allow me to. Are we not able to buy options because they just split?", "score": 1, "replies": [{"body": "Available on Monday", "score": 2, "replies": []}]}, {"body": "Brilliant analysis. You should have your own tv show.", "score": 1, "replies": []}, {"body": "I would think this idea is already priced in. Why else would tsla and aapl have already skyrocket after they announced the split?", "score": -5, "replies": [{"body": "Fundamentals?", "score": 6, "replies": [{"body": "HAHAHA!  Good one.", "score": 3, "replies": []}, {"body": "No I was genuinely asking and admit I don’t understand the fundamentals.", "score": 1, "replies": []}]}, {"body": "People see cheap stocks and buy. Look at the bump after Apple’s last split.", "score": 3, "replies": [{"body": "Well I sold my calls on Friday after no action, so let’s see if I regret it on Monday. But if we’re talking about buying shares then I’m all for it.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Exactly. This “get in on aapl/tsla before the split because they will skyrocket” thing just feels like one of those scenarios where I’ll lose a bunch of money if I listen. Not gonna FOMO this one. I’d rather hope for a dip and pick up some shares if it does.", "score": 1, "replies": []}]}]}]}, {"body": "“Priced in”", "score": 1, "replies": []}]}, {"body": "Tesla will not become a 800bn dollar company anytime soon.\n\nYou're dreaming if you think it's worth as much as Facebook that made over 5bn in profits the last quarter or over 20 billion annualized.\n\nThey would need to grow their profits by more than 1000% keeping in mind  their profit only exists because of regulatory credits.", "score": -4, "replies": [{"body": "> keeping in mind their profit only exists because of regulatory credits.\n\nGetting a bit tired of people constantly saying even thought anyone who's done some research on their numbers knows it's not true.", "score": 7, "replies": [{"body": "Didn't they report 105 millions in profit while they received 428 millions in regulatory credits last quarter?", "score": 1, "replies": [{"body": "Yes, but they also spent a ton of money on things they didn't have to spend money on but decided to do anyways because they could.\n\nSo yes, if you deduct the ZEV credits they operated at a loss, but that's a ridiculous statement to make because a company decides how much money to invest based on their income. Without the ZEV credits they still would've been profitable, they just would've invested less money into non-essential stuff.", "score": 1, "replies": [{"body": "Yes most likely, but what OP said is still true, the company delivered only 90k cars in Q2 and went from being a 90b company to a company worth 300b during the same time period then won 100b in valuation because of a split. (And will most likely gain even more)\n\nI don't agree with OP that the company will not be a 800b company any time soon because of speculation and the meme factor, but the current valuation of the company is just insane when you look at current earnings or sale number of most of the other companies in the top 30. \n\nUnless there is a factor that I am unaware of that happened in the last 4 months, I don't think this company should be worth 800b or even 400 b.", "score": 1, "replies": [{"body": "I think it's mainly that people are focused on the wrong things.\n\n\"The company delivered only 90k cars in Q2\" may be true, but they also stayed even on auto sales while the rest of the market dropped 30-50%. And Tesla isn't even just an auto company.\n\nOn top of that, they had a profitable Q2 during a global pandemic, which many people thought would be impossible. Tesla's always had a lot of potential, but after Q2 it also seems to have very little risk. That probably made a lot of long term investors who were afraid of them going bankrupt get on the boat.", "score": 1, "replies": [{"body": "Most of the investor got on board before the Q2 numbers were released thought. The stock actually went down a little for about 2 weeks until tesla announced splitting stocks which made it moon by bringing in an influx of investors and speculators. I am not denying they had a great Q2, just that they did not have a good enough Q2 to make the company be worth five time what they were at the start of the pandemic. \n\nI actually think that tesla is a great company, just that the current valuation is mainly motivated by a gigantic speculation bubble. I might be wrong and they might have be making 20b every quarter and be worth 2t next year, but I decided at 2k that it was time for me to sell and not fomo back in.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Should it have become a $400 billion company in the first place?", "score": 2, "replies": []}, {"body": "I’m sorry you’re so short-sighted", "score": 2, "replies": []}]}, {"body": "And I can bet Tsla won't be selling any meaningful amount of cars in the near future\n\nWe are at least a decade too early to have the infrastructure to support pure EV\n\nI could be a fool by the end of all this, but I'm prolly gonna put all my savings and my ballz on VHT, yeah I have a weak heart", "score": 0, "replies": []}, {"body": "It will take more to bring it up cause its diluted right?", "score": 0, "replies": []}, {"body": "And that’s when the rug gets pulled", "score": -1, "replies": []}]}
{"title": "Tesla releases new software update to visually detect speed limit signs, and more", "selftext": "", "id": "iizuhu", "created_utc": 1598733878.0, "score": 251, "upvote_ratio": 0.98, "num_comments": 75, "comments": [{"body": "FINALLY\n\nThe fact that the speed limit is wrong 50% of the time is so annoying. The car has navigation data from 2019, but the speed limit data used here is most likely 5-10 years old. Hopefully now Autopilot will actually have the correct speeds.", "score": 79, "replies": [{"body": "You can actually update the map by making an account at openstreetmap.org and update the road and street signage and more including speed limits.\n\nIt take about a month for it to get approved and then into the Tesla map but it’s where the car gets it’s map data from. Heck you can even map out parking lots and have enhanced summon work even better at places you commonly use or would like to use that feature.", "score": 21, "replies": [{"body": "**I found links in your comment that were not hyperlinked:**\n\n* [openstreetmap.org](https://openstreetmap.org)\n\n*I did the honors for you.*\n\n***\n\n^[delete](https://www.reddit.com/message/compose?to=%2Fu%2FLinkifyBot&subject=delete%20g3blq9s&message=Click%20the%20send%20button%20to%20delete%20the%20false%20positive.) ^| ^[information](https://np.reddit.com/u/LinkifyBot/comments/gkkf7p) ^| ^<3", "score": 6, "replies": [{"body": "Good bot!", "score": 5, "replies": []}]}, {"body": "Maybe that works in America but it makes no difference in Europe, at least not when I've tested. Navigation data in the car (listed on the Software screen) is also still from about a year ago.", "score": 1, "replies": []}]}, {"body": "I’m surprised they didn’t do this till now, and thought they did as BMW and others have been doing it this way for 5+ years now.", "score": 7, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "And a LOT of other brands use mobileye", "score": 7, "replies": [{"body": "BMW, Daimler, Fiat-Chrysler and Nissan AFAIK use MobilEye-tech.", "score": 6, "replies": [{"body": "And VW too!", "score": 2, "replies": []}]}]}, {"body": "Ah, i thought this worked but thats because I had an AP1 S before upgrading to AP2 X...", "score": 1, "replies": []}]}, {"body": "Why don't the other brands set the cruise control speed limit to the value detected? Ive driven a few brand new bmw and fords (rentals) and this has always bugged me. The speed limit according to tge signs is shown in the same screen as the cruise control is set... Is it an extra they want you to pay for?", "score": 2, "replies": [{"body": "Wouldn't surprise me if it's simply that the speed detection comes from one supplier (likely MobileEye), and the cruise control is from another (or in-house). Connecting the two is too much work for legacy automakers.", "score": 2, "replies": []}, {"body": "Well, as someone who has a car that detects speed limit signs, I can share the biggest issue. In California there are two speed limits on most freeways, one for cars (usually 65) and one for trucks (usually 55). The sign for the trucks is always after the sign for cars. So, my car will read 65 and then seconds later read 55 and say that is the speed limit. School zones pose a similar issue.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Last night, when the highway was empty. Happens kind of often for those who use a car besides commuting at rush hour. I find it useful to avoid speeding tickets, all the time.", "score": 1, "replies": []}]}]}]}]}, {"body": "https://www.teslafi.com/firmware.php to see how it's being rolled out for TeslaFi subscribers.", "score": 17, "replies": [{"body": "Woah, I’m 1 of 6 model Y performance (1 of 17 model Y’s) installs (tracked by teslafi) on day 1. It’s a cool update. Works well, not so sure about the green light chime but so far it seems good.", "score": 3, "replies": [{"body": "What's the process for this? Do you sign up and you have to tell them when you get new software? Or is it automated somehow? Would love to contribute!", "score": 1, "replies": [{"body": "its just [teslafi.com](https://teslafi.com) you sign up with them and give them an api key to your car and it automatically detects it on your car.", "score": 1, "replies": [{"body": "Love it, thanks!", "score": 1, "replies": []}]}]}]}, {"body": "Only North America. Typical. Hope the roll out is quick", "score": 3, "replies": [{"body": "No, this is just the soft testing phase. You won’t get just .36, it will probably be .36.1 or .2. It will come in 2 weeks minimum.", "score": 4, "replies": []}]}]}, {"body": "How did they avoid the patent from MobileEye?", "score": 17, "replies": [{"body": "Maybe they're just going for it and telling them to sue or fuck off. It's a stupid patent and shouldn't hold up anyways. I mean what's next, a patent for seeing the color blue.", "score": 62, "replies": []}, {"body": "I’d imagine an easy way to get around the patent would be to make the cameras not be used to check the speed limit, but be used to check the maps data against the real world signs, then the car adjusts and auto updates the map data based on what the camera sees. \n\nSo the Tesla use case would be: seamless, continuous, instant map updates using cameras.", "score": 41, "replies": [{"body": "That's a really clever strategy.", "score": 14, "replies": []}, {"body": "I was thinking about this too, it is worded strangely: \"Speed Assist now leverages your car's cameras to detect speed limit signs to improve the accuracy of speed limit data on local roads. Detected speed limit signs will be displayed in the driving visualization and used to set the associated Speed Limit Warning.\"\n\n_Improve the accuracy_? Set the speed limit _warning_?\n\nIt doesn't actually say the camera sets the current speed. It says it helps improve the data. It says that you'll see the sign in the visualization, but that's not the same as _setting the speed_. But it could show you the sign, update the map data, and then the map data just so happens to eventually adjust the speed.", "score": 9, "replies": [{"body": "Interestingly enough it really only says that it detects the speed limit sign.\n\nI'd say the easiest way to get around the patent would to have a database of signs rather than trying to read the number.\n\nEg a sign with 55 on it sets the speed limit to 55 not because it is reading the 55, but because it is seeing the 55 and pulling 55 from a database.", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "What matters are the actual claims in the patent.  Everything else in that patent is filler... from a legal attack surface point of view.", "score": 1, "replies": []}]}, {"body": "IIRC a simplified explanation of their patent says that MobileEye stores the captured image in a buffer to be processed. Tesla's neural net does not use a buffer in the same fashion so from what I heard it is an entirely different process. Patent law am I right?", "score": 8, "replies": []}, {"body": "Tesla actually came up with another method of detecting it. I believe the key was that MobileEye was passing that detection off to a sub-component/algorithm to detect it and was able to patient it that way.\n\nTesla on the other hand (from my memory which may be flawed) ended up baking this feature into the core functionality and model of autopilot, and not handing it off to be a sub task, but as an overall task that is happening as a part of the overall model.", "score": 1, "replies": []}, {"body": "I'd like to think safety is more important than patent rules.", "score": 1, "replies": [{"body": "False.", "score": 9, "replies": []}]}]}, {"body": "That's pretty amazing. It's all falling together 1 piece at a time.", "score": 45, "replies": []}, {"body": "Sounds like they'll be able to count more deferred revenue.", "score": 10, "replies": []}, {"body": "[deleted]", "score": 16, "replies": [{"body": "I thought this was already implemented; VW, Audi and Daimler already have it", "score": 1, "replies": []}]}, {"body": "Hopefully the road segment speed detected gets fed back to the network. If I leave town A and it seems the speed is 55 and not 35 that's great, but if I turn onto that road past the speed limit sign, without this feedback, the car will want to go 35. \n\nIt's a good first step. Let's hope they don't stop at just detection.", "score": 3, "replies": []}, {"body": "A random but related shower thought I had about speed limits and FSD: speed limits will become antiquated when FSD arrives as the car itself will decide what speed it should drive on any stretch of road.", "score": 9, "replies": [{"body": "But that’s a long ways off. As long as any humans are still behind the wheel of any vehicle, speed limits will still exist. In the US alone we have 400 million passenger cars - those would all need to be replaced or substituted (ride share etc) for autonomous ones.", "score": 20, "replies": [{"body": "Well speed limits will exist unless you're Germany ;)\n\nJokes aside, I'm aware this is a long way off. Just another way FSD will change things.", "score": 6, "replies": [{"body": "> unless you’re Germany ;)\n\nAs a German, that’s because Germans are already robotic and, more often than not, void of any and all emotion. In other words, they’ve had robo taxis since the invention of the automobile.", "score": 16, "replies": [{"body": "I KNEW IT!!!", "score": 2, "replies": [{"body": "FSD was solved over 100 years ago. TSLAQ wins, RIP to Tesla.", "score": 2, "replies": [{"body": "Germans didn't make the Tesla killer. They *are* the Tesla killer!", "score": 3, "replies": [{"body": "Komm zu r/mauerstrassenwetten", "score": 1, "replies": [{"body": "Ich bin schon da!", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm half German and my wife would approve of this message.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Uh, no?\n\nHe's defined feature complete at a rather low bar...  just \"can it do stop signs/lights\", \"is it capable of driving in any type of road environment?\", that kind of thing.\n\nIt's not at all \"can it drive without intervention all the time\"...\n\nIt seems a little like slight of hand to me...  he might as well define it as \"can the car steer itself, brake and accelerate by itself\".\n\nIt does seem that currently the robotaxi target is level 5 though.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Hmm, interesting...  I'm not sure I've seen that.\n\nFeature complete as a phrase has definitely not been level 5 before.  In fact, I'd say it's incompatible with the criteria for level 5.  Level 5 is not about features, it's about reliability.  He phrases things strangely at one point, but then gets right back to the heart of what level 5 is which is basically accomplishing level 4 at a high enough reliability.\n\nHe's talked about feature complete often, and has lately been equating that to \"is CAPABLE of driving on highway and city streets\".  Basically, \"can it stop at a stop light and go when it's green?\" being all that seems to be left for his definition of this.  I'd be interested to know if anyone's got the actual criteria he's stated he considers to be \"feature complete\"...", "score": 2, "replies": []}]}]}, {"body": "Feature complete is still Level 2 (supervised).  Elon doesn’t use levels.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Elon clarified his feature complete means all functionality there, but needs supervision.  Levels 3-5 need no supervision.\n\nTesla (nor anyone else) will hit level 5.  Level 5 would mean it could park itself in a fairground following shouted instructions and made up signs of where to go.", "score": 1, "replies": []}]}]}]}]}, {"body": "True but.. there could certainly be speed limit exemptions for fully autonomous vehicles :) I don't know if that would actually happen but in theory I think it would make sense", "score": 1, "replies": [{"body": "Speed limits in the US are critical funding sources for small towns.  They need to solve that issue before speed limits go away.", "score": 1, "replies": []}]}, {"body": "Depends on the environment. Where cars need to join traffic like a driveway on a busy street that has a bend, a car traveling greater than 30mph might not give the joining car enough time to safely back out and get up to speed. additionally areas where pedestrians may be near the roadway need speed limits. Even with a perfect driver there’s risk of a pedestrian falling or running into the roadway. A car strike at 20 mph has very low chance of fatality. A 40 mph strike is almost certain chance of fatality - 95% vs 5% \n\n[link for data](https://www.thecarcrashdetective.com/pedestrian-fatality-rates-increase-with-speed/)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "We’ll be there pretty soon. If there’s something people own a lot of here it’s cars and guns. I could do without the guns.", "score": 1, "replies": []}]}]}]}, {"body": "I got 2020.32.5 in Europe today, what's that about?", "score": 2, "replies": [{"body": "I got that today too. In Canada. We are already one or two update behind lol", "score": 2, "replies": []}, {"body": "They skipped 34/35", "score": 1, "replies": []}]}, {"body": "I'm actually sick of the AP slowing me down to speed limit on turns not on highway. Example, a turn marked at 30mph, I usually go 35mph comfortably, but AP slows it to 30 and below, and people behind me almost slams on me.", "score": 4, "replies": [{"body": "But you should be slowing down ;) and people behind you should be keeping safe distance.", "score": 2, "replies": []}, {"body": "If there are any driveways or cross roads those reduced speeds may be so that people can join the road. You can’t see each other around the bend and if youre too fast they can’t pull out safely. By the time they see you it’s too late.\n\nIt’s not always about the cars performance or drivers skill. Just orderly flow of traffic joining and leaving the road.", "score": 2, "replies": []}, {"body": "In my area it sometimes goes faster than the turn speed limit.  Maybe not quite as fast as a normal human, but not too bad.", "score": 1, "replies": []}, {"body": "What gets me are overpass highway exits.  Occasionally, they'll momentarily pick up some speed limit of a side road underneath and want to slam on the brakes from 50 to 30.\n\nIt's been a couple months so maybe it's better/fixed by now.", "score": 1, "replies": []}]}, {"body": "nice", "score": 1, "replies": []}, {"body": "*AP1 has entered the chat*", "score": 1, "replies": []}, {"body": "Thank goodness they found a solution.  95% of my commute, if we ever go back, has a huge discrepancy between the actual speeds and the database.", "score": 1, "replies": []}, {"body": "just you wait, autopilot restricted to sign read speed limits, we need speed \"limits\" increased, this isn't the 1970s, and speed limit really should be a limit not the default speed.", "score": 1, "replies": [{"body": "That’s what they are. They are literally the limit of speed you should be going. Just because you can go 5-10+ over doesn’t mean you should. Now if you increase the limit, what’s to stop people from going an additional 5-10+ over that new “limit”?", "score": 2, "replies": [{"body": "Agreed", "score": 4, "replies": []}]}, {"body": "But your town or state needs revenue, and an excuse to pull over anyone that looks suspiciously brown. You might need to search them for Marijuana as well.", "score": 2, "replies": [{"body": "i'm confused, are we even arguing???", "score": 3, "replies": [{"body": "Would you like to?", "score": 5, "replies": []}]}]}, {"body": "Often speed limits are not based on the ability of a car or driver. For example if a car needs to join traffic from a driveway they need time to do so. If you’re buzzing through at 50 they can’t join safely. If there is a bend they can’t see far enough down the road to determine if they have time to pull out. By the time they see you come around the bend you’re on top of them. In addition other considerations for traffic flow like the number of lanes often contribute to the limit. \n\nWhen it’s not for the flow of traffic, Consider the average car and average driver and their ability in sub optimal conditions and you get speed restrictions to reduce the chance of incident. \n\nWhere there are potential pedestrians you always have a chance of incident no matter how good the car or driver. Someone falls or runs across the road. So speeds are typically 25-35. A car strike at 20 MPH has a 5% chance of fatality a strike at 40 has a 95% chance and less time to react for both parties.", "score": 1, "replies": []}]}, {"body": "I'm guessing the cool stuff will as usual only be available to HW3 cars in the US. :-<", "score": 1, "replies": []}, {"body": "I'm on 32.3, but my car exhibited weird behavior (speed limit-wise) today that I'd never seen it do on this road. I turned from a street that was 35 to one that was 45, but until I passed a speed limit sign on the 45 street, the car behaved like it was 35. I actually mentioned to my wife: \"weird. Did they turn on speed limit sign detection?\"\n\nThe behavior in this case was actually worse than it was prior, though. \n\nHonestly, it probably wasn't doing it, but it sure acted like it...", "score": 1, "replies": []}]}
{"title": "Apple will correct short-term after the split on Monday morning", "selftext": "Apple is going down short term after the split:\n\nHistorically the days following $AAPL splits have been red. Check yahoo finance. Take a look at June 9, 2014 and February 28, 2005.\n\nTim Cook sold shares in advance of the split: [https://www.barrons.com/articles/apple-ceo-tim-cook-sold-shares-ahead-of-stock-split-51598650147](https://www.barrons.com/articles/apple-ceo-tim-cook-sold-shares-ahead-of-stock-split-51598650147)\n\nWhat was that about it not being a \"sell the news\" event again?\n\n$AAPL banned Epic Games' developer account: [https://9to5mac.com/2020/08/28/apple-has-now-terminated-epic-games-app-store-account/](https://9to5mac.com/2020/08/28/apple-has-now-terminated-epic-games-app-store-account/)\n\nMom will be buying the kids Android phones.\n\n$FB is getting tired of $AAPL app store monopoly: [https://www.benzinga.com/news/20/08/17281937/facebook-says-apple-wont-let-it-tell-users-about-the-app-store-tax](https://www.benzinga.com/news/20/08/17281937/facebook-says-apple-wont-let-it-tell-users-about-the-app-store-tax)\n\nI wouldn't underestimate Zuckerberg's leverage here. Apple might need Facebook more than Facebook needs apple.\n\nRemember the $2000 Facebook machine meme?\n\nChinese may boycott $AAPL: [https://www.intellasia.net/chinese-consumers-could-boycott-apple-if-us-bans-wechat-ministry-warns-805390](https://www.intellasia.net/chinese-consumers-could-boycott-apple-if-us-bans-wechat-ministry-warns-805390)  I don't really care about this, I just wanted to add more gay bear shit to my post.\n\nDid I mention this is a speculative bubble? The stock only rallied up to 500+ because of split related hype.I have $AAPL 500p 9/4, soon to be $AAPL 125p 9/4. [🌈](https://emojipedia.org/rainbow/)🐻\n\nI probably should've sold a call credit spread, but whatever.\n\nMonday morning at open might not be too late to get in. If I were to do it again I'd sell a call credit spread on the $120-$125 strikes.\n\nEDIT:\n\nProof of position: [https://imgur.com/6hG6Sr1.png](https://imgur.com/6hG6Sr1.png)\n\nI had more but I lost 11k on puts already ;)\n\nalso I'm a dumbass because Google also banned Fortnite from Play.\n\n&#x200B;", "id": "iiinxc", "created_utc": 1598659851.0, "score": 0, "upvote_ratio": 0.41, "num_comments": 86, "comments": [{"body": "Historically? Have you been under a rock? Logic applies not to the current state of the market. Historically, stocks like Tesla wouldn’t be up 500%+ Be sure to post your sell off after split. God speed. (You’ll need it) lol", "score": 62, "replies": [{"body": "Agreed. It’s 2020, there are no rules anymore", "score": 32, "replies": []}, {"body": "We don’t play by historical rules anymore. This is twenty twenty 😂", "score": 6, "replies": []}, {"body": "FUCK MY LIFE FOR LISTENING TO YOU", "score": 2, "replies": [{"body": "Let me guess— Apple begins to uptrend- you reverse into calls while it uptrends 14 points but then it reversed and you get melted? Seems legit", "score": 2, "replies": [{"body": "I think robinhood is broken\n\ndelete app and problem goes away tho", "score": 2, "replies": []}]}]}, {"body": "btw, if I have to back out I'll just sell puts at a higher strike and roll into a put credit spread.", "score": 3, "replies": [{"body": "Smart", "score": 2, "replies": [{"body": "yeah it was a smart idea except what I did was flip flop and buy calls\n\nmental game\n\n:/", "score": 2, "replies": [{"body": "At 200 iv?  Oooof. I sold iron condor. Will be collecting today", "score": 1, "replies": [{"body": "I switched back into puts and vix calls this morning and I made 400%\n\nso far progress:\n\n15k -> 4k -> 2k -> 500 -> 2k", "score": 2, "replies": []}]}]}]}, {"body": "How come it went up on June 9th though 2014 on yahoo finance", "score": 1, "replies": [{"body": "It went up long term. If you read my post more carefully I said \"in the days following\"\n\nmake sure you are looking at a daily candlestick chart", "score": 1, "replies": []}]}]}, {"body": "Thanks, we'll see what happens!\n\nYou do realize that nothing lasts forever, right?", "score": -9, "replies": [{"body": "You so fuky ha ha ha", "score": 1, "replies": []}, {"body": "you were right", "score": 0, "replies": [{"body": "No shit but guess what? I'm in fucking calls now lol.", "score": 2, "replies": []}]}]}]}, {"body": "While I also believe tsla and aapl will drop Monday based of logic and history, no stocks have ever run up so hard pre split and market is peaking with retards", "score": 21, "replies": [{"body": "Speculators speculating that there will be more speculators! The speculators already speculated! That's my speculation.", "score": -5, "replies": [{"body": "While this is a fair assessment. Stonks only go up my retard.", "score": 9, "replies": []}]}]}, {"body": "I want your entire portfolio on Puts at open on Monday, with proof, if you believe so hard in your DD. \n\nOtherwise, you’re just like the rest of us. Hoping and praying for our positions to print because no one knows what the fuck is really going to happen.", "score": 12, "replies": [{"body": "Sir, my entire portfolio is already all in puts, but it's only 9k. I had more but I lost 11k on SPY puts.\n\nProof that I am a retard: https://imgur.com/6hG6Sr1.png", "score": 0, "replies": [{"body": "Stupid bear", "score": 6, "replies": []}]}]}, {"body": "Epic and Facebook are both amateurs in this space compared to OG Apple Mudbone. They are The Godfather of computing, any company that challenges will probably get stomped out. Epic better be careful.", "score": 11, "replies": []}, {"body": "I bought calls and I just need apple to hit 125 on Monday. So I guess we are the opposite. I know splits mean stocks suppose to go down but its 2020 and this years been really bad at logic. Everything right seems wrong.", "score": 10, "replies": [{"body": "Thanks for being a good sport good luck to you! Do your calls really expire mon?", "score": 3, "replies": []}, {"body": "My portfolio is relying on Apple being at least at 125 come Monday. If not I’m killing myself. I bought calls like an idiot", "score": 2, "replies": [{"body": "lol me too, lets go in halves on some rope\n\nseriously though don't do that, hit me up if your calls don't print", "score": 1, "replies": [{"body": "Lol yeah man investing in $rope. I’m buying!", "score": 2, "replies": []}, {"body": "You guys could auto-asphyxiate together as you jack each other off.", "score": 2, "replies": []}]}]}]}, {"body": "I’ll be happy as fuck if AAPL goes down on Monday, perfect opportunity to go long for cheap", "score": 8, "replies": [{"body": "me too, I love apple stuff\n\nI will grab shares if there's a big dip", "score": 2, "replies": [{"body": "Always hedge your portfolio with at least 50% shares .", "score": 2, "replies": []}]}]}, {"body": "9/11 $515 calls. Your puts can suck a bag of dicks", "score": 8, "replies": [{"body": "Like a paper bag, with them all sticking out like baguettes? or like a plastic bag, where they are all mushed together at the bottom like chicken parts?", "score": 3, "replies": []}]}, {"body": "How long do you think it'll be before a nice run up with apple?", "score": 7, "replies": [{"body": "Monday", "score": 29, "replies": [{"body": "lol", "score": 4, "replies": []}]}, {"body": "the two past stock splits dipped for a period of 1-2 weeks before it rose again\n\nall we can do is guess though, long term buyers don't need to care", "score": 4, "replies": []}]}, {"body": "A share of Apple for sale at $125 or so, is going to be plastered on every goddamn media surface from here to gyna. That shit aint goin down. That shit is gunna moon. Every child in the USA will be given Appl stocks for christmas. Bank on it. One last thing. That dip you saw was brief. Then it fucking cranks. You forgot that part.", "score": 7, "replies": []}, {"body": "Dip already happened 5min before EOD", "score": 6, "replies": [{"body": "I dunno if I'd call that a dip so much as a massive rocket that failed to reach escape velocity.", "score": -1, "replies": []}]}, {"body": "1. Sell was planned\n\n2. Judge just agreed that Epic needs to comply with app store rules and has been blocked from making any updates or new apps but the unreal engine still works\n\n3. Fuck FB and these data stealing SM companies. Apple is leading the way for user privacy rights to be restore and these are changes to comply with GDPR and new California privacy regulations coming in 2021\n\n4. There wont be a ban, China makes 90% of the iPhone why would they ban them. It's a bad decision on thier part.\n\nSummation = 🌈🐻\n\n505c 9/15 800c 3/19/21", "score": 7, "replies": [{"body": "yeah, the sell was planned because he knew the stock was going to go up on the split and sell off immediately after, it's a separate sale from the sale of his bonus days earlier\n\nimo your second position is guaranteed, your first position could work even if I get my 2-3 red days", "score": 1, "replies": [{"body": "Yeah I bought them at .97 so they should still pay nice even if next week is a little red. Anything under 110 next week and its gets dicey", "score": 2, "replies": []}]}]}, {"body": "Honestly didn’t read but historically Robinhood wasn’t going full retard buying ‘dips’", "score": 4, "replies": [{"body": "based on the number of stocktwits posts I have read by said retards saying \"what happens to my shares after the split\" I'm pretty sure they were all smart enough to get in before the split so that \"when everyone buys it after the split\"  they'll profit.\n\ndon't underestimate robinhood\n\nI figure on monday when they see that isn't what happened, that lots of weak hands will drop those shares fast.", "score": 2, "replies": [{"body": "Lol good point. I’m excited to see which retards come out on top.", "score": 2, "replies": []}]}]}, {"body": "AHEM........\nAHEEEMMMM.....\nWHO GIVESSS A FLYING FUCK?", "score": 6, "replies": []}, {"body": "Back in June 2014 and Feb 2005 16 year olds weren’t day trading the market.\n\nAAPL $550C 9/25 (now $137.50 strike price)", "score": 8, "replies": []}, {"body": "Durrrrrrrrr based on my cALcULaTiOnS of the last pandemic apple post split, dude just stop. Nobody knows what the fuck is going to happen. All bets are off, nothing going on this year is predictable, I mean yes AAPL will go up, that is law, but enough about bubble trouble and tim cook bullshit, if it was my company hell yeah I'd sell half the shares, I mean what good does it do him to keep so many shares? let the man live, chinese are def not boycotting apple, no kids are asking for androids no one gives a fuck about fortnite, I won't even talk to someone if their texts are green, I remember using a apple computer where the monitor was attached to a keyboard when I was in grade school, we used to laugh and them, look who's laughing now, they are dominating the world and good for them for connecting everyone, it's great for business. What you don't seem to understand is if everyone's iPhones and MacBooks disappeared tomorrow the world would not be what it is today, also 500c 9/11", "score": 9, "replies": [{"body": "I am long term bullish on apple and plan to buy some if my puts print. Don't be so nervous about your calls.", "score": 3, "replies": []}]}, {"body": "this is a pandemic, w/e the fuck u think is out the window.  There is no rational, literal retarded post", "score": 3, "replies": []}, {"body": "*Buy the dip, Faggot*\n\n-Warren Buffet\n\n520c 10/14/2020", "score": 3, "replies": []}, {"body": "Post that loss porn FGT", "score": 3, "replies": [{"body": "it's not a loss until I sell! started to recover towards EOD. I'm sticking to my guns for now.\n\nI will definitely be posting it, though.", "score": 1, "replies": [{"body": "iTs nOt A LoSs UnTiL i sELL!!1 :-))", "score": 2, "replies": [{"body": "I sold, and I posted loss porn\n\nno one cared though\n\nstill have a little left in my account... trying to pray the gay bear away now", "score": 1, "replies": [{"body": "ouchie ouch", "score": 2, "replies": []}]}]}]}]}, {"body": "You’re going down hard boy", "score": 5, "replies": [{"body": "slay me daddy", "score": 3, "replies": []}]}, {"body": "Past performance is not indicative of future results", "score": 6, "replies": [{"body": "Sir let me ask you something: if a man was fucking your wife, and you caught him twice, would you invite him over your house?\n\nYou probably would, I rest my case.", "score": 2, "replies": []}]}, {"body": "Stonks only go up. That being said...\n\nAAPL $400p 9/11", "score": 2, "replies": [{"body": ">Where were you, on 9/11  \n>  \n>Where were you, when Apple fell from Heaven.\n\nI think I got a hit in the works here.", "score": 3, "replies": [{"body": "Gold record label", "score": 1, "replies": []}]}, {"body": "this gives me hope\n\nif it works out for me i'll probably buy some shares", "score": 1, "replies": []}]}, {"body": "Unless a market wide crash occurs, Apple will only go up. \n\nWhich other company you betting on? AMD? Lol, computer processor company will rise while Apple crashes? No chance. Coke? You betting legacy products and variations of the same soda profile will out innovate tech? Square? Apple Pay. Netflix? Apple TV. Cloud? LOL\n\nApple literally has everything, this isn’t just an iPhone company.", "score": 2, "replies": [{"body": "I only want it to be red for like 2 days man\n\nit absolutely will go up after that ;)", "score": 1, "replies": [{"body": "Thats tough cookies for you sir- St. Patty’s was rescheduled this year- it’s on Monday- we are all wearing green. Don’t choke and die on green 🍏 Monday.", "score": 2, "replies": []}]}]}, {"body": "Historically speaking we have never had a market that is going through a pandemic that halted the world as well as the US printing money like a highschool assignment 5 mins before deadline. The current state of the market is new and very unpredicable, especially with all the new investors over the last 5 months. Any logic or historical stats went out the window.", "score": 2, "replies": [{"body": "I acknowledge this but even if you look at recent months there are sprinklings of red days.\n\nI'm not playing the buy calls every day strategy but I see the merits of it.", "score": 1, "replies": [{"body": "There are yes, it won't last forever but weeklies seem to be a good thing right now until the eventual correction. pre election probably won't move down, it's post election that would have the biggest move depending on the winner.", "score": 2, "replies": []}]}]}, {"body": "Monday morning at open might not be too late to get in. If I were to do it again I'd sell a call credit spread on the $120-$125 strikes.\n\numm, are you seriously doing an ITM call credit spread?\n\nI'm on board with your theory but I'd rather sell it OTM for extra protection", "score": 2, "replies": [{"body": "thanks for the tip, I am not a pro", "score": 1, "replies": []}]}, {"body": "Apple doesn’t need Facebook at all. Also, parents are not going to be buying android phones for their kids just because a video game is no longer available on the phone.\n\nAlso, using past performance to predict the future of a stock is a brilliant move. I’ve noticed that the stock market is cyclical and it’s super-easy to time the market. \n\nThe thing that’s going to crater aapl and all of the other phones is the announcement that blackberry is getting back in the game. It was number 1 in the past so it should be number 1 when it launches again. I can’t wait to BBM with you all soon.", "score": 2, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**AAPL**|**$500**|**BUY PUT**|**2020-09-04**|**$13.17**|**$499.23**|**7702**|**17761**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckeex4kp41ogc0753mhmj4fg0) | [Track Record](https://www.pickmojo.com/user/toughc0okies/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "This is #FakeNews. Stop spreading this dirty anti-Apple propaganda. Stocks only go up", "score": 1, "replies": []}, {"body": "Sooooo Calls on Windows phone?", "score": 1, "replies": []}, {"body": "There are people reading this right now saying to themselves, \"I guess this week will be a good time to buy\" and i've heard a lot of boomers talk about how they don't want to own just 1 or 2 shares of these companies. They seriously think more shares are better (and they know nothing of options). Also there is no where for money to go right now... monday tuesday and wends will be huge green dildos.", "score": 1, "replies": []}, {"body": "Shut up. You acting as if shit makes sense in this market. Shit is so wacky maybe Apple will fucking go to the moon. Nothing makes sense. Just yolo shit", "score": 0, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "iioci0", "created_utc": 1598685725.0, "score": 37, "upvote_ratio": 0.8, "num_comments": 90, "comments": [{"body": "How Many Times Do We Have to Teach You This Lesson, Old Man?", "score": 88, "replies": [{"body": "\"When you play the game of thrones, you win or you die. There is no middle ground\"\n\nReplace *thrones* with *tendies*", "score": 29, "replies": [{"body": "OR you get fucked with a big green dildo, which is what you gay bears really are after.", "score": 13, "replies": []}, {"body": "as long as your willing.", "score": 2, "replies": []}, {"body": "The Red Wedding is Red for Bears. The Bulls send their regards.", "score": 1, "replies": []}]}, {"body": "🤡🤡🤡", "score": 2, "replies": [{"body": "You won this time  🌈🐻", "score": 1, "replies": []}]}]}, {"body": "You’re the dumbest gay bear of them all. Anyone who seen winter come aka Season 8 of Game of Thrones knows it’s complete shit, a disappointment, and a let down.\n\nSPY 360c 09/23", "score": 52, "replies": [{"body": "Haha I disagree expect for GoT S08... Don't remind me of that clusterfuck of worst possible ending 😠😑", "score": 12, "replies": [{"body": "You sir got rubberducked", "score": 5, "replies": []}]}, {"body": "Yikes..", "score": 1, "replies": []}]}, {"body": "Came to make fun of a bear, left with a uvxy long call. \n\nSIKE RETARDS, stonks only go up and that’s proven fact, even if the market pulls back 5, 10% who cares? I already made 20/30% riding the wave up and will continue to do so till I crash and burn 😤", "score": 21, "replies": [{"body": "Haha why not ride the wave down now 🐻😎", "score": 7, "replies": []}, {"body": "It's not a proven fact, we already had 2 huge bear markets and countless corrections this century.", "score": 1, "replies": [{"body": "With a decade in between...", "score": 3, "replies": [{"body": "Guess how long it has been since the last one", "score": 2, "replies": [{"body": "Not long enough ;)", "score": 5, "replies": [{"body": "Lmao check a SP500 valuation historical chart and downvote this too", "score": 2, "replies": [{"body": "Ok 🌈🐻 have fun with losing more money", "score": 1, "replies": [{"body": "[bears gay le epic printer brrr jpow daddy musk and bezos stonks only go up!](https://ih1.redbubble.net/image.899605138.9733/flat,750x,075,f-pad,750x1000,f8f8f8.jpg)", "score": 5, "replies": []}]}]}]}]}]}]}]}, {"body": "VIX doesn't work the way you think it works\n\nIf you buy Oct options, you are buying options on the futures contract for Oct. \n\nIf there is a flash crash in Sept, Sept options will feel 100% of that, Oct options will see maybe 80%, Nov 50%, Dec 10%\n\nVIX is forward month 30 day, not backwards month. \n\nSo if you think something is going to happen in Sept, you buy Sept options to get the full amount. Yes, theta will fuck you but the VVIX will fuck you harder.", "score": 15, "replies": [{"body": "He would probably  Be better off buying calls on vxx (which would at least be American options)", "score": 6, "replies": []}]}, {"body": "Good strat if we are invaded by aliens and that one asteroid starts having a better than .41% chance to hit us.", "score": 7, "replies": [{"body": "Given the retarded level of this market, even that can be interred as bullish somehow IDK", "score": 7, "replies": [{"body": "Destruction breeds creation, haven’t you seen Fifth Element?", "score": 4, "replies": [{"body": "Is that a movie ?", "score": 2, "replies": [{"body": "Yes highly recommended. Very pertinent to the markets right now. Due to 🚀", "score": 6, "replies": []}, {"body": "Yes, Avatar: The Last Airbender. Go watch it.", "score": 2, "replies": []}, {"body": "[IMDB of The 5th Element](https://www.imdb.com/title/tt0119116/). Enjoy.", "score": 2, "replies": []}]}]}]}]}, {"body": "Trump wont let the market down. Might be a little pull back like june 12 and that is it", "score": 8, "replies": [{"body": "That's precisely why I don't yolo on OTM puts rn despite being fully bearish. But I am curious as to what he can pull off at this point to pump up which he already hadn't ?", "score": 5, "replies": []}]}, {"body": "&#x200B;\n\n>Any suggestions or ***counter arguments*** or improvements to this plan are wholeheartedly welcome.\n\nCounter argument:    JPow's tendie printer goes brrrrrrrr.\n\nSuggestion:   People should stop playing tribal camps and be willing to play both sides of the market.  The goal isn't to entrench yourself into some group, but to make money.   Play the market, not yourself (don't fold into some bull/bear-only camp mindset).\n\nImprovement:   I think we could see a pull back on the market in October induced by politically motivated groups.  But, even IF we do, it won't last long.   Yes, some sectors are big bubbles, but it doesn't matter so much as long as the tendie printer is online.   So, even if we do see a downturn, expect the market to continue to climb shortly after.  And don't get too stuck on expecting another March 2020 to occur any time soon.", "score": 7, "replies": []}, {"body": "This is retarded. If you're a bear, you're better off timing periodic drawdowns on individual stocks that show a reversal. But in broad strokes, you're going to get rekt if you sell calls or buy puts.\n\nNobody disagrees that the market is overvalued...but it doesn't fucking matter. QE Infinity means stonks really will go up for the foreseeable future.", "score": 6, "replies": []}, {"body": "Bears keep looking for an entire market crash that isn't coming. if a drop comes, its going to be corrections for Tech (maybe) and Covid lockdown winners (likely) as institutions rotate into the still-relative bottoms of Covid lockdown losers like oil, most of the travel industry, and retail since they all missed most of the recoveries of the winners.\n\nTLDR: if you're worried about corrections start looking at solid post-Covid tickers for mad tendies.\n15 min Covid test = mass opportunities.", "score": 4, "replies": [{"body": "Ya that just means short tech, isn't it ?", "score": 2, "replies": [{"body": "hey man we're bulls here.\n\n.......\n\nbut tendies are tendies", "score": 2, "replies": []}]}]}, {"body": "I’ve been taking a portion of every win and going long in VXX in a variety of ways. I still don’t think any semblance of a correction happens until next spring, but I’m making small hedges with my profits.", "score": 3, "replies": []}, {"body": "Lol. You think we can read?  I agree though. Winter is coming. I’ll consolidate and wrap myself in hundreds till the election is finalized. Bears are a sad breed though.", "score": 5, "replies": [{"body": "I think a crash or correction will happen before election.  Market always prices shit in advance.", "score": 3, "replies": [{"body": "It does but trump and the republicans will do whatever it takes ( even if that kills the US in the future) to have the best economy by the time of the election. Don’t you see that?", "score": 8, "replies": [{"body": "I do. But I guess they have already blasted their full arsenal.", "score": 2, "replies": [{"body": "Then you underestimate the Arsenal my friend.", "score": 8, "replies": [{"body": "No no I am open to that possibility, that's precisely why I don't yolo on OTM puts rn despite being fully bearish. But I am curious as to what he can pull off at this point to pump up which he already hadn't ?", "score": 1, "replies": [{"body": "He can do whatever he wants. Most powerful man in the world. He won’t let the economy kill itself before the election. There’s just no way. Even with Biden being as senile as he is I’m not risking my entire portfolio on trump winning. I’ll slowly pull out by October then sit and wait for the results.  I hope I have enough money to build a isolated self sustainable bunker by the time the next dem gets elected president though.", "score": 1, "replies": [{"body": "Psst. He's a president, not a king. There are limits. Congress can do much more.", "score": 1, "replies": []}, {"body": "He and Powell have already done whatever they want for too long I guess. Btw how come none of Dems side worry about Biden's health ? What if he goes unhealthy/dies ? Kamala becomes the president as I have seen in House of Cards ?", "score": 1, "replies": [{"body": "kamalas just gonna put cages over cities entirely and say they were guilty and she stands by her decision", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Thanks donut burner", "score": 2, "replies": []}, {"body": "Deep OTM LEAP puts... got it.", "score": 2, "replies": [{"body": "That's the spirit 😆🐻", "score": 2, "replies": []}]}, {"body": "It's not the way the market movers can absorb the most money from participants. This will be bullish until the economy has turned the corner (and thus can absorb tightening) then ease down to enable people waiting for pullback to enter, then it will continue to fall back to future fair valuation.", "score": 2, "replies": []}, {"body": "Bum fuck September", "score": 2, "replies": []}, {"body": "There is no other market to invest money into right now... \n\nSo, correction before the election - yes. Bear market - no. \n\nAfter the election, monetary policy can change...", "score": 2, "replies": []}, {"body": "Stop trying to turn everyone gay", "score": 2, "replies": []}, {"body": "Wait, I thought bears hibernate in the winter.", "score": 2, "replies": []}, {"body": "I'm a gay bear... and even I am completely bullish this week... weeklies are the MOST expensive way to insure your positions or profit from a crash... they cost the most on a daily average... I keep a couple 3 month out puts and roll em over at 2 months (small position). Rest of the time im riding this bull wave with 10-30 percent of my portfolio at a time depending on my confidence in the next few days. As for volitility plays, when we do bleed out it's unlikely to be fast. Bubble is being inflated in an equality pressurised room (fed's new policy on inflation, and no where to put your money) also precious metal calls are bear plays that pay and you haven't even mentioned them.", "score": 2, "replies": []}, {"body": "!Remindme 31 Days", "score": 2, "replies": [{"body": "I will be messaging you in 1 month on [**2020-09-29 21:20:11 UTC**](http://www.wolframalpha.com/input/?i=2020-09-29%2021:20:11%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/iioci0/a_vengeful_bears_gameplan_for_the_blood_red/g3a993w/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fiioci0%2Fa_vengeful_bears_gameplan_for_the_blood_red%2Fg3a993w%2F%5D%0A%0ARemindMe%21%202020-09-29%2021%3A20%3A11%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20iioci0)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "I agree, markets hate uncertainty and Biden winning is a big one. Last time I checked his odds on pinnacle.com he was leading by a hair.\nI’ve exited a lot of my longs on Thursday and was buying gld and slv calls last few days on the dip. Rn the plan for me is go half cash gang and other half split stocks and metals calls. If correction in the near time happens, it won’t be big, it will be healthy for the market to shake off weak hands and excess leverage, so a good opportunity to buy the dip. Other scenario is that it goes parabolic, or vertical in NQ case, and then a flash crash once the world runs out of suckers to buy higher. That will be an opportunity to buy longer dated puts and make a fortune.", "score": 2, "replies": []}, {"body": "I thought I bankrupted all you 🌈🐻", "score": 2, "replies": []}, {"body": "You had me at \" triple digit IQ\"...I'm in you crazy bastard\n$IQ 100c 9/4", "score": 2, "replies": []}, {"body": "I believe a Flash crash is more likely, everyone believes we're in a huge bubble, and when there is a spark to set it off, all the bulls will stampede off a cliff.... My biggest fear is a flash crash due to after market news, you'll watch your portfolio vanish in the pre-markets by 40% before you can even dump all your positions at the opening, and if you're all in on options calls, you're absolutely fucked.  \n\nI got out of everything a couple of weeks ago, and now only hold UVXY shares and a few options, I'm ready for the Bearish winter ahead...", "score": 4, "replies": [{"body": "Good to see some of my bear brethren on this thread. 🐻🔥\n\nI too think Flash Crash is the logical outcome of this scenario but I am scared of Trump and Powell's pump potential.", "score": 2, "replies": [{"body": "Powell's money printer can't pay people's rent, I believe terrible rent payments data might spark the crash, renters were already a staggering 40% behind at the end of July, and at risk of eviction, and that was BEFORE the $600 weekly Unemployment checks ran out!  There's also mass Business Bankruptcies just around the corner....", "score": 2, "replies": [{"body": "Anyone at risk of homelessness doesn’t have money in the market. The people who are able to work right now are busier than they’ve ever been.", "score": 2, "replies": [{"body": "All those tens of Millions of folks use to pay rent and bills, buy shit, and pay taxes that supported other folks higher up the food chain.... And now they're gonna be a huge drain on resources......", "score": 2, "replies": [{"body": "Or they go and live with their boomer parents who have all stayed in their high paying executive jobs for much longer than previous generations. Too much weight is being placed on the unemployment numbers, without recognizing that the amount of stimulus is still only being felt right now. Each new level of help from the Fed is pre-emptive as opposed to reactionary like 2008/2009. If there is more real stimulus from the government, then we’ll see companies have a huge rebound in sales.\n\nRight now we’re seeing companies with access to free money loans. 2008/2009 we actually saw much more financially influential individuals and companies fail. These were localized failures of massive amounts of capital. We will not see anything nearly as localized over time as people respond to their new financial stresses. So the effects are much more spread out, we have stimulus helping, and unfortunately the cause and solution of the unemployment question hinges on wealth inequality - boomers supporting millennials and gen z children / grand children through this period.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "OP Fuk you, markets don’t turn on a dime like that. Small corrections maybe but what you are talking won’t happen. Trump won’t let you Gay Bears win, he is riding the stock market to Valhalla as 2nd term office POTUS and anyone against that can get the F out of the way", "score": 1, "replies": []}, {"body": "Stopped reading after \"too much addicted\". Nigga do you English?", "score": 0, "replies": [{"body": "Not my mothertongue, sorry for that, but I guess you got my point.", "score": 4, "replies": [{"body": "youre not even american? no wonder ur a gaybear, puts are for commies", "score": 2, "replies": [{"body": "Haha an Indian. But I guess at this point every market on earth is just more or less mirror scrip of SPY.", "score": 3, "replies": [{"body": "im going to guess ur super new here. dont underestimate jpow", "score": 1, "replies": [{"body": "I am not new here, and am certainly not underestimating him. I am just saying he too has some limits.", "score": 4, "replies": [{"body": "Yea but i think the boat has sailed now. The markets been inflated for years. And now come election it may be another quick selloff and back go ath next month. Just buy calls dude", "score": 2, "replies": [{"body": "I might be wrong with my above DD, but I am certainly not going to buy calls here. Hell no.", "score": 1, "replies": [{"body": "Well if ur buying puts ur just gonna lose money on it and im garunteeing it. dont think rationally, this isnt the run of the mill market compared to foreign markets. i had a friend who said the exact same thing as you. Do you really think no one knows the market is a bubble? everyone knows. Buy calls. Buy calls. Buy calls. usa. USA USA", "score": 2, "replies": [{"body": "I agree the market is a bubble for sure, but with 6 trillion dollars pumped into the economy, and with bonds being trash people have no where else to invest their money. So it's not a surprise we have these prices. Plus it's not like everything is super over priced. Majority of overpriced stonks are only some tech stonks, so people will continue to buy. 65% of stonks are 30%+ lower than their February high price. Like industrials, financials, travel & leisure, retail, & especially energy, all that shit is easy down 20-60% down. All that money had to go somewhere. People are too great to let the money sit and do nothing, so all that happened is that money went into the tech and now it's overpriced, add in all the shit the fed did with all that extra money, and it's not too surprising we have these prices. I can actually see another 10% rise before we have a flash crash. Maybe a 1-2% intraday drop here or there, but the market is still full bull mode. Yes it's retarded and there's no logic, but that's what happens when the fed steps in and turns on the money printer on over drive and kills bonds. How many people have been saying this exact same thing about prices being to high for the circumstances for the last 3 months bears have been getting killed since the June flash crash. We should see a decent red day this coming week, but don't expect anything not than just a dip and another rip.", "score": 4, "replies": [{"body": "Why do you expect a red day the next week?", "score": 2, "replies": [{"body": "I expect it to be either Monday or Thursday. Just off what I have been seeing over the last 4 months. There will be some profit taking. I expect Monday to open up pretty  green, but might see a sell off at some point in the day as people take profit from all these new highs. If that doesn't happen, I expect a good amount of new highs Monday, on a solid green day, with some consolidation Tuesday/Wednesday and a sell off Thursday. But that's just my guess. And Spx coming up to key channel resistance on chart from February high linked to 2017 high. 2% away from there.", "score": 1, "replies": [{"body": "I see, thank you!", "score": 1, "replies": [{"body": "Big red Thursday 🤑", "score": 1, "replies": [{"body": "Damn impressive!", "score": 1, "replies": []}]}]}]}]}, {"body": "I agree on Fed liquidity point. But I think we will see enough red soon to reward a bearish play as I am planning.", "score": 1, "replies": [{"body": "better set a faaaar out expiry", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Blasphemy", "score": 0, "replies": []}, {"body": ">market is insanely overvalued at this point.\n\nYour entire theory relies on this premise. \n\nWhat if you're wrong?", "score": 0, "replies": []}, {"body": "Gay", "score": -1, "replies": []}]}
{"title": "An AAPL prophecy from a 10 year old boy.", "selftext": "The year is 2010. I had been invited over to a friends house to play video games and had to make a guest account. Within a second the name that came to me was “Ratsapple”. I never knew why but I’ve always stuck with this name through my gaming career, though now it makes sense. As far as gaming goes, Apple recently shit on Fortnite, which is always good news. As far as the “Rat” half goes, 2020 is the year of the rat. This year AAPL is going to 🚀🚀🚀 GET IN NOW OR YOU’RE MISSING THE PROPHETIC GAINS", "id": "iizrsg", "created_utc": 1598733618.0, "score": 278, "upvote_ratio": 0.91, "num_comments": 80, "comments": [{"body": "Apple is bassicaly a no brainer, so naturally, my entire portfolio is in tsla 2500c", "score": 177, "replies": [{"body": "[deleted]", "score": 38, "replies": [{"body": "Because I'm an autist, not a retard.", "score": 68, "replies": [{"body": "no retard thinks they're a retard.", "score": 27, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "You sound more like an autist to me", "score": 5, "replies": [{"body": "Your reatrded", "score": 3, "replies": []}, {"body": "Sounds like something a fellow retard would say, ngl.", "score": 2, "replies": []}]}]}]}, {"body": "Debatable", "score": 1, "replies": []}]}]}, {"body": "Only a retard thinks a portfolio is a yolo", "score": 2, "replies": [{"body": "it's a portfolio because it's a month out\n\nPOINT: ME\n\nEdit: get rekt", "score": 2, "replies": []}]}, {"body": "Tesla is so overvalued", "score": 2, "replies": [{"body": " 🌈🐻s been saying that since 600 so idgaf", "score": 24, "replies": [{"body": "It will definitely keep skyrocketing", "score": 9, "replies": [{"body": "TSLA 10,000 eoy", "score": 7, "replies": [{"body": "TSLA 10T valuation here we come", "score": 7, "replies": []}]}, {"body": "Tesla could be worth next to nothing in 3 years. I’m talking $100 a share. I’m gonna wait until 2021", "score": 0, "replies": [{"body": "shut up pussy🌈🐻", "score": 1, "replies": []}]}]}, {"body": "You misspelled 300", "score": 2, "replies": []}]}, {"body": "It's got that R E T A R D  S T R E N G T H 🤪🏋️‍♂️", "score": 6, "replies": []}, {"body": "Would it be overvalued if there was a brain chip that allowed you to summon your Tesla by just thinking it or detect someone that farts in your tesla and shock them? Tesla is a growth co so it’s value is based on the markets belief in its future value... if Elon can make that happen then fucking right it’s undervalued at $2,200.", "score": 6, "replies": [{"body": "That’s neuralink, not Tesla.", "score": -1, "replies": [{"body": "Durrr.. He literally talked about integration of the chip for tesla users.", "score": 3, "replies": []}]}]}, {"body": "Lol value", "score": 1, "replies": []}, {"body": "Mods! Ban this guy!", "score": 1, "replies": []}]}]}, {"body": "I hate that I don't hate this post.", "score": 117, "replies": [{"body": "Well I do and want that minute of my life back.", "score": 11, "replies": [{"body": "Read faster", "score": 3, "replies": []}]}]}, {"body": "I’m holding calls through the split... the wait this weekend is making me sick. 🤢 500c 9/18", "score": 42, "replies": [{"body": "Bro you got 3 weeks relax", "score": 22, "replies": [{"body": "I’m trying to relax but I just keep shitting my pants repeatedly. \n\nCalls on Hanes.", "score": 38, "replies": []}]}, {"body": "Weekends fucking suck", "score": 18, "replies": [{"body": "I hate how empty I feel on the weekends now.", "score": 19, "replies": [{"body": "I trade cfds which are a lot like futures so the market opens at 6pm on Sundays so its not as bad. But yeah weekends are kinda lame when you have goals for your trading. I work full time and I would love to spend my earnings on the weekends but I'm saving for a house and houses in Toronto are 1.2 million at least...", "score": 2, "replies": [{"body": "Yeah, don’t live there.", "score": 2, "replies": [{"body": "I love my city 🥺", "score": 4, "replies": [{"body": "But we want you to have a nice life, don’t chase the Chinese investors my friend.", "score": 3, "replies": [{"body": "Yup Chinese investors thats correct. I kinda wanna get into it myself. They make good money with real estate. But I'll be doing stocks for now.", "score": 3, "replies": []}, {"body": "And I lived in one of their houses through uni. He was cheap af. I dint think he understood tax deductions yet. There was a leak in the ceiling of the basement unit and he screwed a plastic lunch tray to the ceiling and drilled a hole in the corner and fed a plastic tube through it draining into the sink.😂😂😂", "score": 2, "replies": [{"body": "Bro what in the fuck lol. \n\nTake about engineering a solution.", "score": 1, "replies": [{"body": "Yeah he was a clever one. Some of the ghettoest shit I've ever seen though.", "score": 1, "replies": []}, {"body": "And a new roommate from that house went missing and the feds came and questioned me and dusted for fingerprints like it was CSI 😳  I dont think they found him...", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I’ve got 2x 9/18 500c, 1x 9/18 520c... we’ll see how it goes!", "score": 4, "replies": []}, {"body": "You'll be printing harder than JPow at a used IT shop an hr before his thesis is due", "score": 4, "replies": []}, {"body": "I got 2x 9/4 505c bought at the ATH last Monday... I’m in the same boat shitting my pants", "score": 4, "replies": []}, {"body": "You’ll be chilling by the end of the week", "score": 3, "replies": []}, {"body": "Holding 505c 9/16 since 7/31, been a looooong month of waiting. This next week or 2 should be fun!", "score": 3, "replies": []}]}, {"body": "This is so stupid it might actually work I’m in", "score": 51, "replies": []}, {"body": "I bought calls and they are already down 88%!!!! \n\nDid I do it right", "score": 9, "replies": [{"body": "It ain’t a loss till you sell", "score": 8, "replies": [{"body": "False. Sometimes I realize losses because options expire.", "score": 1, "replies": []}]}]}, {"body": "Where my 500c 9/4s at holla", "score": 7, "replies": [{"body": "530c", "score": 7, "replies": [{"body": "You got some big balls 9/4 exp? I'm pullin", "score": 3, "replies": [{"body": "I'll be a bit nervous around 9am tomorrow 😶", "score": 1, "replies": [{"body": "I've been waiting for monday all weekend...the suspense is killing me", "score": 1, "replies": []}]}]}]}, {"body": "495 9/4 reporting for duty", "score": 5, "replies": [{"body": "OUTSTANDIN SIR 🚀", "score": 4, "replies": []}]}, {"body": "Sold my 8/28 435c (back when Apple was 400) for only 200 dollar gain. Paper hands really a bitch.", "score": 1, "replies": []}]}, {"body": "Great thinking! Never thought about about this company, didn’t realize they make this thing called the iPhone", "score": 7, "replies": []}, {"body": "Username doesn't check out", "score": 5, "replies": []}, {"body": "the prophecy called for puts, not calls. You're fucking yourself.", "score": 6, "replies": [{"body": "Blasphemer!! \n\nThe Golden Child has forsaken you!!!!", "score": 4, "replies": [{"body": "Blaspheme my hairy nuts. That golden child is both bronze and hath been borne a retard.", "score": 1, "replies": []}]}]}, {"body": "oh my God, hes a prophet...DUDE", "score": 2, "replies": []}, {"body": "I never bought anything from apple.", "score": 2, "replies": [{"body": "I did once, what a mistake", "score": -1, "replies": []}]}, {"body": "the 10 year old sounds gay as shit", "score": 2, "replies": []}, {"body": "It's a year of bat, not rat SMH", "score": 2, "replies": []}, {"body": "When I realized you’re only 20 years old I stopped giving a fuck about your dumb story\n\nEdit: actually ended up reading and wasn’t wholly disappointed tbh", "score": 2, "replies": []}, {"body": "Ratsapple is a cool name.  My names are always fucking stupid.", "score": 1, "replies": []}, {"body": "makes perfectly no sense.", "score": 1, "replies": []}, {"body": "fuck your fart dude !", "score": 1, "replies": []}, {"body": "I think most analysts agree it's the best investment in the market right now by far. Apple for life.", "score": 1, "replies": []}, {"body": "8 aapl 1/15 $155c", "score": 1, "replies": []}, {"body": "Apple is a full 67% higher than it was on december 31st and you’re telling me it’s “going to” rocket?", "score": 1, "replies": [{"body": "Do you.. doubt the golden child?", "score": 2, "replies": [{"body": "I don’t doubt that Apple will hit 150 post split price by EOY", "score": 1, "replies": [{"body": "Interesting", "score": 1, "replies": []}]}]}]}]}
