{"title": "Any advice for a 30 year old entering the world of trading?", "selftext": "So I pretty much wasted all my 20's smoking weed and being useless (not recommended). I've been reading up on the wiki for new investors on this subreddit and is very helpful and informative.\n\nPretty much want to be in it for the long game, making and securing small profits, I say I don't want to do day to day trading but it seems like it could get pretty addictive. I have about 4k to start off with.\n\nI have a government scheme for retirement/buying a house, but it's just not enough, especially being self employed I don't get employer contributions.\n\nI'm thinking of starting just getting a couple shares in MSFT, AAPL and maybe a couple others for long term holds and then going from there.\n\nDoes it make it much harder if you live outside the US? I guess you can just place orders and stop losses etc just won't be there for when the markets open. (Live in NZ)\n\nAny advice, helpful or not would be much appreciated, happy trading y'all!!", "id": "i3vdfc", "created_utc": 1596587689.0, "score": 30, "upvote_ratio": 0.73, "num_comments": 80, "comments": [{"body": "Buy better weed", "score": 63, "replies": [{"body": "This is facts", "score": 10, "replies": []}, {"body": "Damn that's what I was doing wrong so obvious!", "score": 6, "replies": []}]}, {"body": "I wrote a huge ass guide just for people like u. It’s on my profile if u wanna take a look. Good luck my man", "score": 14, "replies": [{"body": "Legend mate I'll head over have a look a bit later cheers.", "score": 1, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "Dj Khaled?", "score": 7, "replies": [{"body": "ANOTHER ONE.", "score": 1, "replies": []}]}, {"body": "True that I'm just at work don't think the boss would be too impressed haha", "score": 2, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "No worries mate I'm a lot like that too, I've given up the daily habit and just keen to invest the 150 a week I'd spend on weed on something worthwhile. Hindsights a bitch huh? It's definitely held me back and I've always been interested in the stock market but was just too lazy to act on it.", "score": 2, "replies": []}]}]}, {"body": "Don't get kids with your mentality 😅", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I have a huge mental list of things I'm going to lookup once I get a few hours over lol", "score": 0, "replies": []}]}]}]}]}]}, {"body": "trading is no guarentee return. bettere to invest long term. If you really want to trade, then just only trade what you can afford to lose it all. \n\nAlso, watch out for curreny fluctuation (as u are in NZ looking to buy US stock), the stock can rise and you still lose money if USD gets weaker", "score": 13, "replies": [{"body": "When you say invest do you mean buy big stocks and hold? That's a good point about currency cheers man! I mean I could trade on local markets but they're rather boring.", "score": 2, "replies": [{"body": "Yeah man you have to factor in the cost of that into your investments. Also in NZ and it works out the currency conversion fee and back again is 2% (if the currency stays the same)", "score": 2, "replies": []}]}]}, {"body": "Don’t trade, buy and hold", "score": 13, "replies": [{"body": "I tried it all. Swingtrading, day trading, pennystocks, options.\n\nThe only thing that made me money was stocks.\n\nBought AMD a week ago, up 50% obviously miracle but stocks are much safer than the others", "score": 3, "replies": [{"body": "Sounds to me like you haven't made any money at all and you're still in the red as far as stocks are concerned", "score": 1, "replies": [{"body": "No stocks is about the only thing I made money on. Bought AMD at 10, Nvidia at 250 and a few others. Stocks is pretty simple, just get growth stocks and hold", "score": 1, "replies": []}]}]}, {"body": "That's the plan just gotta try make some safe holds, some great suggestions on here.", "score": 1, "replies": []}]}, {"body": "If you want long term, I'd recommend either some top blue chip stocks or index funds", "score": 4, "replies": [{"body": "Yea the plan is to buy into blue chip stocks when I can.", "score": 1, "replies": []}]}, {"body": "ETFs and hold.", "score": 5, "replies": []}, {"body": "[removed]", "score": 24, "replies": [{"body": "Ahh some solid fundamentals cheers man!", "score": 10, "replies": []}, {"body": "I think you meant to type this at r/wallstreetbets", "score": 6, "replies": []}]}, {"body": "[removed]", "score": 4, "replies": [{"body": "Good plan this 4k is leftover Covid money so I can afford to lose a bit and would be keen to mess around in day trading while holding big stocks", "score": 2, "replies": []}]}, {"body": "But low sell high", "score": 3, "replies": [{"body": "Buy High sell Stoned", "score": 4, "replies": []}]}, {"body": "Buy big \"blue chip\" companies and hold them forever. Even if they dip, just hold. Diversify and wait until retirement. \n\nIf you think you're smarter than Wall Street, use a small amount of money to buy and sell. Give it 6 months or a year and if you've done well, try it with more money. If, like the rest of us, you lose more than you make, diversify and hold.", "score": 3, "replies": []}, {"body": "[https://ark-invest.com/](https://ark-invest.com/)", "score": 3, "replies": [{"body": "Now this is an interesting site!", "score": 1, "replies": [{"body": "I started this year at 34. Was also going to recommend ARK, especially ARKW. \n\nAs someone who started late, I am looking to aggressively grow my modest capital, and have made some silly mistakes which resulted in losses along the way (buying SQQQ thinking the market should fall, buying TVIX at the top, and speculating on a politically contentious gold mine stock). That said, I've also made some nice gains ....\n\n- NPI.to has nice capital appreciation, a monthly dividend with low payout and is well run, growing, has very low beta and jives with my ethical framework. \n- XBC.vn is a Canadian pennystock, but is seeing enormous growth and they are in a strong upward trend. It won't be long before they are uplisted to the TSX and grow beyond pennystock status. They do fluctuate up around earnings, but overall, they are less volatile than most pennystocks and are actually on a good growth trajectory, IMO. \n\nI was in ARKW until a couple days ago. Took profits at $96, and it's at $103.xx now :S. Alot of volatility in the stock; it trended from ~$90 to past $100 twice in a month, so I figured i'd take profit before it dropped again. It's at ATH now. I switched over to MSFT, which resulted in a 5% profit compared to the ~7% from ARKW. \n\nLots to learn. Try not to get too greedy. \n\ngoodluck.", "score": 2, "replies": []}]}]}, {"body": "Trading us a marathon not a spring, build your knowledge account and the financial will follow.", "score": 3, "replies": []}, {"body": " So I pretty much wasted all my 20's smoking weed and being useless (not recommended) \n\n&#x200B;\n\n&#x200B;\n\n\\- I felt this, one advice is don't dump your life savings of $40,000 into options and lose it all.", "score": 3, "replies": [{"body": "Haha no waaaay I don't even have access to all my savings anyway so that's good but definitely don't want to invest all I have.", "score": 2, "replies": []}]}, {"body": "Look up some YouTube videos to get a general idea of how the market works", "score": 2, "replies": []}, {"body": "Don’t ever stop learning. Read and then read some more. Also check out long term investing.", "score": 2, "replies": []}, {"body": "Hey man I’d suggest buying broke millennial takes on investing by Erin Lowry. A lot of easy to read easy to breakdown information that is useful", "score": 2, "replies": []}, {"body": "Learn about macro economics. Learn how money works and flows. Start with ray dalio videos on youtube.", "score": 2, "replies": []}, {"body": "Read “A random Walk down Wall Street” - quite in line with what people already advised :)", "score": 2, "replies": []}, {"body": "Trading, at the first time at 30... hmmm...\n\nMy first thought is start very slow. If you take 5 years figuring out your method, that's fine, but don't spend 5 figures getting there. You will absolutely hate (or love) yourself for the amount of money you turned into ash for things you  could've learned for free.\n\nSecond, being a *successful* trader is a professional pursuit that requires tons of self-discipline. Really think if you need work there. Do not pass GO until you have an understanding of how you routinely self-sabotage. I assume because you're 30 you know exactly what I mean. Dont underestimate that shit. Seriously.", "score": 2, "replies": []}, {"body": "Wow this gained much more traction then I thought it would. I have tons of reading and watching to do now will pour over heaps of crap and hopefully start in a few days, maybe chat to my accountant or look up how the tax etc works trading in foreign markets. A couple blue chip companies sound like safe holds anyway.\n\nI will post an update in a few months when I've lost everything and am selling myself on the street, stay safe and out of the red everyone!", "score": 2, "replies": []}, {"body": "Don't buy individual stocks, buy ETFs.", "score": 2, "replies": []}, {"body": "Aside from reading u/lord_v0ldemort guide, which is very good, I wouldn't just jump into AAPL or the like. Stick with smaller $100-200 stocks and secure gains first. I recommend SE personally. I have a sizeable position and I just keep making money.", "score": 2, "replies": []}, {"body": "Don't trade for starters. Buy and hold and contribute to your brokerage regularly until you have at least 25-30k. Learn some intermediate technical analysis and fundamentals for trading, listen to prominent swing traders talk, and join communities for trading (not like Reddit or Facebook. Meet people on twitter and join private discords if possible) \n\nOnce you're established take 1-10% of your portfolio and start practicing (or use the 100k paper account some brokers provide). \n\nIt's easier to lock in long profits over time than make a bunch of small deals for small wins. Eventually your win/loss takes a skew and you're down big and have a bag of useless shares.", "score": 2, "replies": []}, {"body": "Just be pretty confident, focused, and self-disciplined. And no matter what age you begin trading, the rule applies to everyone.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Solid advice, that's one of the first things I figured just read the shit out of everything, just hope my judgement in stocks turns out better then my previous judgement!", "score": 1, "replies": []}]}, {"body": "If you want (semi) guaranteed returns, just invest in the top dogs in tech and hold long. That’s pretty much all there is. Make it a goal to buy something like Microsoft once a month. Don’t trade options and you should have all your money at the end of the day. Good luck, man. Better to start late than never!", "score": 2, "replies": [{"body": "Yea hard, the money I save from buying weed can easily buy a couple big dog stocks. Cheers!", "score": 3, "replies": []}]}, {"body": "Hey man don't knock the weed with stonks.\n\nOf course I do my own DD while sober, but it's always fun to use something that just helps me with focus and creativity aittle bit. Helps come up with projections for future growth areas. \n\nIt's actually served me very well, but I am a very light user in the first place. \n\nAs for advice I would recommend ETFs if you just want slow and steady. \n\nYou do not have to buy ETFs to be steady. They typically take the risk factor down, but that also means you are less likely to grow quickly with good news. \n\nI personally only buy ETFs rarely, but I do have some.\n\nI prefer to buy growth stocks with medium to high dividend yields, kind of hybrid to what people suggest. \n\nRight now I would recommend buying:\n\nMSFT - Great company all around with great products, hard to say something bad about them in the first place. When they acquire TikTok, it will open many doors for them in to new sectors, raising the potential value for the future. It's not necessarily the acquisition itself that is important, but that they are acquiring a social media company, and personally I feel like that is a big move.\n\nRTX - Aerospace, Defense, Cyber/Security, Satellite. Raytheon recently merged with United Technologies and they are trading a distance below their high before COVID.\nSolid dividend that should grow in the future.\n\nA few others; CSCO, AMD, ENPH, UMC, JPM, T, and XEL (my largest holding, I've held for years and I will probably hold for the rest of my life). I have lots of other holdings, about 48 or so total, but these are most of my serious holds.", "score": 2, "replies": [{"body": "Haha problem is it became a daily habit and a necessity rather then something that could give a little creative buzz. Appreciate the write up and suggestions, I feel companies like MSFT and AMZN will just keep growing, although I wonder what could happen to AMZN once shops open back up.", "score": 1, "replies": [{"body": "Personally I am much less in to Amazon. My family owns and operates a relatively small business, and in recent years we have found ourselves doing business on their platform. It is hell. Don't get me wrong, it's great from the consumer side, but pretty much anything and everything is blamed on the sellers, and we lose money on shipping just about every package as they always push down on us with pricing. \n\nWe make much more using our own website, even paying for all the services we need. We basically use Amazon as an advertisement cost for our store.\n\nAmazon shares are also incredibly expensive with no dividend and no splits in sight. \n\nNow this is just my personal experience with them, obviously other people will have a different experience selling on their platform. \n\nTheir marketplace is also just an advertisement for their real business, AWS. I don't know a ton about AWS. I know they do incredible work and know what they are doing, but off of my personal feelings for the company, I would prefer to invest in Microsoft or IBM.", "score": 2, "replies": []}]}]}, {"body": "Im more interested in your scheme for buying a house (as a sole proprietor and self employed myself, there sure ain't shit out there)", "score": 1, "replies": [{"body": "Well I used to be employed which is where most of my house savings came from (about 50k) but the local housing market is insane (700k average in Auckland for a smaller 3 bed house) so I'd love to move somewhere else, but it's much harder self employed, I'm going to study construction management and transition from building so I can hopefully earn a solid income and get employer/govt contributions again.", "score": 1, "replies": []}]}, {"body": "The time frame for investing is more than just a couple of years. You make money, but slowly due to compound interest. Most people don't best the market. If you're a beginner, look to buying VOO, an ETF that tracks the S & P 500 index.\n\nIf you start day trading, you will likely lose money before making any sort of gains. When do you want to buy a house by?", "score": 1, "replies": [{"body": "The money I have for a house is pretty close to a deposit depending where I buy, I would like to buy a house in the next 5 years and probably need another 30k deposit, I'll hopefully buy with my partner but prefer to think of it as just me and my money atm anyway.", "score": 1, "replies": [{"body": "Yeah if you need a house within the next 5 years, investing in stock market may not guarantee returns. If you're on the lucky side then you can make 50% to 100%+ of your money within that time, but it's also possible you'll be down money even with \"safe\" stocks like AAPL, AMZN, or MSFT. Investing is all about your tolerance for risk and if you're willing to hold long term. If you don't absolutely need to withdraw your entire portfolio by 5 years, I think big tech stocks or the QQQ ETF is probably a decent choice. I personally prefer ETFs over individual stocks but I know most like buying individually. Another one to look into is ARKK", "score": 2, "replies": []}]}]}, {"body": "Do nothing today.", "score": 1, "replies": []}, {"body": "Stop buying weed, start buying MJ", "score": 1, "replies": []}, {"body": "Another thing to consider is to budget your self by making a financial plan and sticking with it. You might be surprised and have more than 150$ to invest every month. If you would like help I have no problem with that or if you want me to walk you through it that can be done as well. It surprises me how many people don’t do this first. As well as separating things and understanding a want versus a need when making a purchase.", "score": 1, "replies": [{"body": "I'm hoping for 100 a week on investing then put the other 50 into my retirement fund (that's the 150 a week I spent on weed) I'm always open to advice or a bit of help man but I don't wanna be too much trouble but feel free to pm me for a chat.", "score": 1, "replies": []}]}, {"body": "AAPL is a strong buy right now, if you can scrape up another 500 you can buy 10 shares that’ll turn into 40 shares once they split. Then you’ll get the annual growth that you seek with 40 shares of AAPL. Not to mention you can always add to your brokerage like a savings account, my return this year was high because I got lucky on some bottom floor plays. But you won’t get nearly as much return from a regular savings account vs buying into a company like KO every time you get paid. KO offers a .41¢ dividend.", "score": 1, "replies": [{"body": "apple is quite overvalued and their dividend isn't that great. I would suggest GOOG or MSFT over AAPL.", "score": 1, "replies": [{"body": "I will probably end up going MSFT, but isn't AAPL coming out with new ARM chips? Seems like a big deal in the processor market just wondering how much effect that would have on stock price.", "score": 2, "replies": [{"body": "Yes they are. Apple still has a strong fanbase. Apple also a huge stack of cash so they can be u profitable for years and still be alive.", "score": 1, "replies": [{"body": "Since I last posted this Apple has come up $60", "score": 1, "replies": []}]}]}]}]}, {"body": "\"Trading\" implies low holding times.\n\nLow holding times imply  losses are going to be large and frequent.\n\nBest to have really long term macro oriented strategies.", "score": 1, "replies": []}, {"body": "So if you want to make logterm gains, you should probably visit r/dividends. I wouldn't touch Apple - it's neither growth or value imo. I hold MSFT for longterm growth and I will only sell it in case of emergency. \n\nIf I were you, I would wait for major dip and buy some stocks then.\n\nI live outside of US too and my only problem is with dividends when I have to pay my taxes. It really depends whether NZ has anti-double-taxation agreement with US if you want to receive some good cash from dividends.\n\nThere is always r/wallstreetbets if you want to gamble your soul.\n\nSorry if that didn't make any sense I'm drunk", "score": 0, "replies": [{"body": "Mate I've received much worse advice from drunk people cheers!", "score": 2, "replies": []}]}, {"body": "Buy weed stocks lol", "score": 0, "replies": [{"body": "No joke my country will probably legalize or at least decriminalize this year and hemp products are slowly becoming more popular here too.", "score": 1, "replies": []}]}, {"body": "i suggest moving to a real country", "score": -8, "replies": [{"body": "You mean like Canada?", "score": 6, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Cheers buddy, we got pretty lucky been a little island but even during our mandatory lockdown, it was a ghost city, everyone stayed home and most people wore masks etc, hang in there I hope it gets better for you guys soon!", "score": 1, "replies": []}, {"body": "I leave the house everyday lmao", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I ain’t 70 and the northeast is fine. I’m sorry you live in shit states", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Just know... you’re not going to make money.\nBetter have some strong emotions when you start investing and watching it all go away within the hour.\n\nGood luck.", "score": -7, "replies": [{"body": "What are you talking about? It’s spy 330 and everything is green.", "score": 1, "replies": []}]}]}
{"title": "If you could only pick 5!!", "selftext": "Now , I’m talking for the rest of your life. Forget ETFs/Index Funds!\n\nIf you could only pick 5 stocks to invest in, what would they be. Consider the future, what will life look like? Will these stocks continue to grow? These are the 5  stocks you will put money in every week/month, what are they??? You can put a few honorable mentions as well.\n\n1.Apple\n2.Amazon\n3.Tesla\n4.Microsoft\n5. I’ll pick after I read the comments lol", "id": "i3vwge", "created_utc": 1596589772.0, "score": 12, "upvote_ratio": 0.67, "num_comments": 85, "comments": [{"body": "AAPL, MSFT, NET, V, MA", "score": 28, "replies": [{"body": "Have all these I agree", "score": 4, "replies": []}, {"body": "If you had to pick ma OR v which one", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "theyre both GOOD but only 5 for life", "score": 4, "replies": [{"body": "No. GOOD is a REIT.", "score": 2, "replies": []}]}]}]}, {"body": "buy VGT then", "score": 1, "replies": []}]}, {"body": "1.) MSFT \n\n2.) V \n\n3.) WM \n\n4.) NET\n\n5.) Chasing growth with CHWY, TSLA, or SE", "score": 16, "replies": []}, {"body": "1. Amazon: No guesses why\n2. Facebook\n3. Plug: Forget electric, hydrogen cells are the future\n4. Walmart: Only challenger to Amazon\n5. Paypal, Visa, Mastercard", "score": 13, "replies": [{"body": "I wonder if Costco could pivot to be a competitor to Amazon. Of course, they sell in bulk and mostly rely on memberships but it doesn't seem like it'd be that hard for them to set up the infrastructure to also be a delivery/warehouse business too. \"Free Shipping with Costco Prime\" (I don't own them).\n\nI'm very interested in how Walmart is going to grow its delivery business. It should be interesting to watch them and Amazon fight it out.", "score": 1, "replies": [{"body": "I doubt it. Shipping costs would eat into any competitive advantage they have as a wholesale club. Amazon has a huge distribution network and they rely heavily on the us postal service as it is.", "score": 2, "replies": []}]}]}, {"body": "1. AMZN\n2. MSFT\n3. GOOG\n4. AAPL\n5. JNJ\n6. Honorable Mention BRK.B, V, VZ, UNH, PEP, LMT, JPM", "score": 10, "replies": []}, {"body": "Got a few Visa picks in there, I like it. To use Square and PayPal, gonna use Visa a lot.", "score": 4, "replies": []}, {"body": "For life? Fuck, that's anyone's guess. Literally anything could happen. But, I'll say...\n\nAmazon, visa, MasterCard, Google, Tesla", "score": 9, "replies": [{"body": "Yes, and that’s the point of the question, anything could happen in the next month technically", "score": 4, "replies": []}]}, {"body": "AMZN. GOOG. AMD. FB. SHOP", "score": 7, "replies": []}, {"body": "Microsoft. Amazon. Walmart. Dollar General. Google. \n.\n.\nOr all in TQQQ 🤔", "score": 7, "replies": [{"body": "imagine suggesting a leveraged etf to hold long holy fuck lmao", "score": 11, "replies": [{"body": "Screw data!\n\nLet's all just talk trash about levered ETFs without having any idea what we are talking about!\n\nScrew all those \"studies\" that show levered ETFs can actually work decently when combined with inversely correlated assets and regular rebalancing and all that nonsense.", "score": 3, "replies": [{"body": "Shit, they absolutely work.  An easy search proves it.", "score": 1, "replies": []}]}, {"body": "Imagine getting 90% return annually by just buying and holding. Where’s the problem in that?", "score": 6, "replies": [{"body": "doubling down lmao jesus", "score": 2, "replies": [{"body": "Lmao", "score": 2, "replies": []}]}, {"body": "Losing 50% to taxes", "score": 2, "replies": []}]}]}]}, {"body": "I smell 1 of the 4 will not be a big player in 10 years.", "score": 6, "replies": [{"body": "Which you thinking? Tesla?", "score": 5, "replies": []}]}, {"body": "My actual portfolio: Tesla 35%, Square 20%, Fastly 12%, Livongo 12%, Sea Limited 12%.\n\nA few percent in docu and peloton and okta.", "score": 3, "replies": [{"body": "Ive got about 40-50 stocks in my portfolio in pies M1 finance. R u familiar?\nPretty much designing your own Index funds. Im up 16% on the year. \nBut ive been considering drastically dropping the amount of stocks to just 5, hence the idea for this discussion. \nSo you favor the handful of stocks rather then diversification??\n\nAnd wow, Sea Ltd looks great, never heard of them before.", "score": 1, "replies": []}, {"body": "As far as growth companies go that is a great portfolio IMO.", "score": 1, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}]}, {"body": "1. Tesla \n2. Uber\n3. PayPal \n4. AMD \n5. Plug", "score": 3, "replies": []}, {"body": "MFST, TTD, AMZN, CVNA (yes, wait till they get new car contracts, car salesman are irrelevant), SQ", "score": 2, "replies": [{"body": "Carvana has definitely had amazing growth the last 2 years, from 22 to 174 since Rona.", "score": 1, "replies": [{"body": "My father has been in the car business since the early 80s and the way of buying a car isn’t the same anymore. People don’t want hassle. I work with a few people that have bought cars off Carvana, it’s definitely an A+ model.", "score": 1, "replies": []}]}]}, {"body": "WM, NEE, COST, MSFT, and UNH", "score": 2, "replies": []}, {"body": "AMZN, AAPL, JNJ, V, MSFT. Maybe swap out one of them for FB", "score": 2, "replies": []}, {"body": "MSFT/AMZN/GOOGL/MA/BRK.B", "score": 2, "replies": []}, {"body": "Amazon\n\nMicrosoft\n\nTesla\n\nMcDonald's\n\nTencent (Just in case the American market stops growing well; I think that this huge conglomerate is the safest way to get exposure to the Chinese market as a backup.)", "score": 2, "replies": []}, {"body": "O, APHA, TRSWF, UTG, and fuck it TTCM hail mary.", "score": 2, "replies": []}, {"body": "AAPL, MSFT, V, MA, INTC (its dirt cheap right now based on fundamentals alone).", "score": 2, "replies": [{"body": "Ok since INTC is cheap right now, you would chose it among all  possibilities and think it's one of the best options to hold long? Hm.", "score": 1, "replies": [{"body": "Ok, INTC might not be the best stock to hold for life. \nBut for the short to medium term, its a great stock. \n\nI would pick GOOGL or ASML instead then as a long term hold.", "score": 1, "replies": []}]}]}, {"body": "Wow, if the future will be like the past everyone is fine here:)", "score": 2, "replies": []}, {"body": "I like Tesla, but it wouldn't be in my top 5 for life. \n\nApple, Amazon, Microsoft, Google, WalMart", "score": 2, "replies": []}, {"body": "SQ. For the upcoming generation, there will be zero reasons to take out a bank account in the traditional sense.\n\nBig banks have to adapt or are going to bleed from this consumer shift.\n\nYou’re welcome for the hot tip, boomers/gen X.", "score": 7, "replies": [{"body": "Yup, love Square. Bank accounts are becoming utterly useless. And Savings accounts?? Probably the most disgraceful thing in all of American finance.", "score": 6, "replies": [{"body": "How worrisome is the news about Apple buying the Canadian startup recently to compete with Square? Is it just Apple trying to play catch up?", "score": 1, "replies": [{"body": "I don’t think you understand how culturally influential CashApp is", "score": 0, "replies": [{"body": "How culturally influential is it??", "score": 1, "replies": [{"body": "It's basically the most culturally significant thing to happen in America since jazz.", "score": 1, "replies": [{"body": "Well if CashApp is cool, consider me Miles Davis!", "score": 1, "replies": []}]}, {"body": "Go do your own DD", "score": -4, "replies": []}]}]}]}]}, {"body": "How does square come into play with this ?", "score": 3, "replies": [{"body": "Guess you’ll have to find out on the next episode of dragon ball z", "score": 8, "replies": [{"body": "Ok", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "What’s your cost basis on SQ tough guy? (:", "score": -1, "replies": []}]}]}, {"body": "1. Amazon\n2. Tesla\n3. TSM\n4. Google\n5. Square\n\nTo be transparent, I only hold 1 of these stocks but I can see the continuing growth and dominance in all of these 5 stocks from my own DD.  I have read the comments and the others have presented all great picks as well!", "score": 3, "replies": []}, {"body": "1. MSFT\n2. BABA (Chinese version Amazon, with 14B population)\n3. FB (Social Media & Ads beast)\n4. SQ (Best growing Fintech, best potential to circulate money in the system without take it out) \n5. OTIS (once elevators sold, maintenance & repairs fee $$ keeps coming in, pandemic or not, they still need the regular maintenance services.)", "score": 3, "replies": []}, {"body": "SQ, SPOT, DIS,APPL,MSFT", "score": 2, "replies": []}, {"body": "1. MSFT (diversified business)\n2. AMZN (diversified business)\n3. Qualcomm\n4. AMD\n5. Netflix (entertainment is not going away anytime soon)", "score": 2, "replies": []}, {"body": "We are talking the rest of life: we want to avoid everything consumer, and only focus on infrastructure, basic tech, health. Since it's such long term and we don't necessarily want grow stocks (growth stop eventually, and growth is a large part of the capitalization) we want to focus on dividends.\n\nI'd go: Pfizer, JPM, DIS, AAPL, AMZN( which I'm quite sure will split becoming a holding)\nWe are covered in financials, healthcare, entertainment, tech, infrastructure (I consider AMZN as infrastructure due to both marketplace and cloud)", "score": 1, "replies": []}, {"body": "AAPL, NET, QTWO, TESLA, and MSFT\n\nTech is the future in the long run. Think back to AOL days and to think what we have now.", "score": 1, "replies": []}, {"body": "1. Amazon\n2. Microsoft\n3. Apple\n4. Disney\n5. AMD", "score": 1, "replies": []}, {"body": "MSFT, BRK.B, V, BAM, PEP", "score": 1, "replies": []}, {"body": "I said if i was forced", "score": 1, "replies": []}, {"body": "Carnival American Airlines spirit ncl Ford", "score": -5, "replies": [{"body": "Short future for this guy.", "score": 3, "replies": []}, {"body": "Sarcasm?....I hope", "score": 2, "replies": [{"body": "As long as Carnival doesn't go bankrupt they should be a great play long term.  It should 5 or 6 bag over the next decade just recovering from COVID, same for AAL.", "score": 2, "replies": [{"body": " That much growth in cruises? It seems like more of a boomer thing.", "score": 1, "replies": [{"body": "5-6 bagging is just getting them back to where they were before COVID hit. I've never been on one personally, but several friends from college have taken multiple and they're all Millenials so I don't think it's just a boomer industry.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tsla, tsla, tsla, tsla, tsla.", "score": 0, "replies": [{"body": "Lol I like Elon Musk and believe in Tesla but the cult around him and Tesla is something else. Tesla has 5+ years priced in and it doesn’t have anywhere near the market share of Honda or Toyota to show for it.\n\nDo you honestly think the car giants will sleep and won’t frogleap with EV when demand gets there? you remember how successful the Prius was right? there is a reason why Toyota pulled back on r&d.", "score": 1, "replies": [{"body": "Tesla is not just a car company tho lol", "score": 2, "replies": []}, {"body": "Hey if i was forced to put every dime i have into Tesla forever, id have no problem sleeping.", "score": 1, "replies": [{"body": "I think that’s nuts but you do you..", "score": 1, "replies": []}]}]}]}, {"body": "1. TSLA (EVs. & autonomous driving are the future)\n\n2. SEDG (Solar is the future)\n\n3. BYND (Plant based meat is the future)\n\n4. APHA (Marijuana is the future)\n\n5. FB (Social media is going nowhere)", "score": -1, "replies": []}, {"body": "1. iQ (Netflix of china)\n2. GE\n3. Hertz, it's coming back strong\n4. AMD\n5. Domino's", "score": -1, "replies": [{"body": "Ok please explain dominos. I tried their new recipe it is still pretty nasty. Their global franchises are garbage too. Believe me In times of desperation in Asia I’ve tried Dominoes they fucking suck.", "score": 1, "replies": []}, {"body": "Car rental is such a shitty business model with terrible margins. Idk what you mean coming back strong", "score": 1, "replies": []}]}, {"body": "For anyone that cares about serious long term gains, they need to choose companies which don't yet exist.", "score": 0, "replies": [{"body": "This is a good way to lose all your money.", "score": 2, "replies": []}, {"body": "Nah I'm happy with 100% yearly gains. Just profit, pick a new stock. Tried pennystocks, fuck that", "score": 1, "replies": []}]}, {"body": "In no particular order:\n\n\\- Amazon\n\n\\- NIO\n\n\\- SPCE\n\n\\- Microsoft\n\n\\- Google", "score": -1, "replies": [{"body": "NIO and SPCE aren't even short-term holds, much less life-long holds.", "score": 3, "replies": [{"body": "To each their own", "score": 1, "replies": []}]}]}]}
{"title": "MSFT announces cloud gaming service will charge $15 launching Sept 15th.", "selftext": "Originally MSFT said it would be a free add-on to Game Pass subscribers but now they're gonna charge $15 as a standalone service.  \nAlong with the Tik-Tok acquisition, Jedi contract announcement (hopefully), and US and China announcing they'll meet to work out the trade deal, this has all got to be bullish for MSFT. \n\nhttps://www.cnbc.com/2020/08/04/microsoft-reveals-more-details-about-its-xcloud-game-streaming-service.html\n\nMSFT 8/21 $220, 9/18 $230", "id": "i3ypao", "created_utc": 1596601402.0, "score": 118, "upvote_ratio": 0.95, "num_comments": 80, "comments": [{"body": "My $10k in msft 03/21 calls like this kinda news.", "score": 60, "replies": [{"body": "strike?", "score": 10, "replies": [{"body": "$230.", "score": 10, "replies": [{"body": "I have the exact same calls. Let's moon together bro.", "score": 17, "replies": [{"body": "Same here 😎 welcome to tendiestown", "score": 3, "replies": []}]}, {"body": "0ob0v.mpmllllp\nL\nL", "score": -3, "replies": []}]}, {"body": "$10k", "score": 2, "replies": []}]}]}, {"body": "This is very misleading. The price of $15 is their ultimate game pass tier (pc + Xbox),  so this is a free add on to that and Currently isn't available in the cheaper tiers of gamepass.", "score": 20, "replies": []}, {"body": "How is Google Stadia, and Apple Arcade doing?", "score": 24, "replies": [{"body": "These services are failing because so much of our country has shit internet", "score": 36, "replies": [{"body": "Ok, well MSFTs cloud gaming would use the same internet.", "score": 32, "replies": [{"body": "5g is supposedly going to solve the latency issue. Not sure about the rest though. It will get there eventually and it'll be the new norm. Just not right now", "score": 5, "replies": [{"body": "I don't think 5G sub-6Ghz will solve any latency issues plus it will be too expensive for most folks to stream games on.", "score": 2, "replies": []}, {"body": "Why gamble on MSFT and these other games providers when you can make $ on the service integrators?  Eg TMUS, VZ, even T.  They should see data use explode and subscriber base increase.  Especially TMUS which reports this Friday.", "score": 1, "replies": []}]}]}, {"body": "Stadia is also failing because of the lack of games and the fact you still have to purchase the game on top of the subscription", "score": 7, "replies": [{"body": "This is wrong. You don't need the subscription. If you buy the game, you can play it without any subscription.", "score": 2, "replies": []}, {"body": "Not true. Stadia uses the PS Plus model. The subscription gets you a few games each month.\n\nOtherwise, you can buy games, no subscription needed.", "score": 2, "replies": [{"body": "I stand corrected. But still, this isn't a good business model when compared to how Microsoft has presented their service. Even PS+ includes a much better incentive through discounts on games.", "score": 1, "replies": [{"body": "Stadia also provides that incentive.", "score": 2, "replies": [{"body": "I have yet to find a discount that isn't available on all platforms or that is better than other platforms", "score": 1, "replies": []}]}]}]}]}, {"body": "That is why MSFT doesn’t talk about 4k.", "score": 1, "replies": []}, {"body": "Lol, nope. No reason to shit on a service that actually works flawlessly for people like me. I live close to Redmond and support one of the bigger companies in the state but my love for Microsoft doesn't blind me from what's real.", "score": 0, "replies": [{"body": "take a chill pill broh. not once in this whole thread have i shit on these services.\n\ni'm bullish on these services, i'm saying they're not already huge because a lot of the country has shit internet...", "score": 1, "replies": []}]}]}, {"body": "neither of them have the game library nor the already established gaming community that Xbox has", "score": 4, "replies": [{"body": "I've dabbled with stadia. I really like it. It's smooth and works well. I notice no lag. But dear lord there is no player base. When I try to do online games, there is no one to play with. Its rough. I always just go back to my playstation.\n\nI have 250mb down and 200mb up. So my internet is great for it", "score": 4, "replies": []}, {"body": "I don’t see already established gaming community of Xbox using this additional $15 service. \n\nI don’t know a anyone that uses Xbox’s game pass, a similar service to what you’re describing for $1 a month.", "score": -2, "replies": [{"body": "\\> I don't know anyone that uses Xbox's game pass\n\n[Try over 10 million subscribers.](https://www.theverge.com/2020/4/29/21242004/xbox-game-pass-10-million-subscribers-microsoft-q3-2020-earnings) \n\n&#x200B;\n\n\\> A similar service to what you're describing\n\nThey are completely different models, gamepass is a collection of 100+ games that you can play with either an xbox or a pc, xcloud, on the other hand, is a service that lets you play said games on an android phone or tablet (pc support coming soon)\n\n&#x200B;\n\n\\> $1 a month.\n\nIt's 1 dollar for the FIRST month, then it's around 16 dollars a month. This will also include xcloud on September 15th, I don't know where op got the information that xcloud would be a standalone service.", "score": 3, "replies": [{"body": "Additionally Microsoft quietly stopped selling 12 months xbox live. The assumption being microsoft wants to merge the two services together.", "score": 1, "replies": []}]}]}]}, {"body": "Never heard of them. Is the microsoft thing similar to the nvidia shield?  \n\n\nI tried one once, but was underwhelmed. Casual gaming was fine, but street fighter (4 or 5 I forget) was noticeably laggy.", "score": 1, "replies": [{"body": "It’s similar to the shield except there is no dedicated hardware. The Shield is like the failed Steam console. These games are played on the phone, or computer via “the cloud.”\n\nStadia failed so bad they are giving it away for free now.", "score": 1, "replies": []}]}, {"body": "What's that?", "score": 1, "replies": [{"body": "Type them into google and read", "score": 6, "replies": [{"body": "It helps others that may peruse this thread to just answer his question.\n\nYou can save hundreds from googling.", "score": -1, "replies": [{"body": "No", "score": 3, "replies": []}]}]}]}]}, {"body": "xcloud is going to be garbage. MSFT fucks up every acquisition and they always overpay. Jedi is a $10b contract to a $1.6T company. Chinavirus. Nevertheless, it’s going to hit $230. I sold my $210 calls yesterday and today the stock dropped (one of the few times I got lucky) so I’m going to just buy more shares and wait it out that way. When we got to $220-$225, I’ll buy some weeklies @$230.", "score": 58, "replies": [{"body": "I'm in the xcloud beta and used it for the last few months. It's legit 720p streaming but pretty good experience and with a huge library. Its basically like Netflix for video games and by bundling it with Xbox game pass will have a huge user base over other streaming platforms. On the other hand, idk how much gaming is to msft bottom line 10-20 percent?  Bullish overall though", "score": 25, "replies": [{"body": "thanks for the insight", "score": 5, "replies": []}, {"body": "Gaming for MSFT will be like less than 3% I would imagine, they have an enormous enterprise customer base that pay them monthly revenue forever at this point.", "score": 4, "replies": []}, {"body": "Did you experience any latency? I always had it, but that could just be my internet connection I guess.", "score": 2, "replies": [{"body": "I did on a normal router. I upgraded my modem and got a google nest router. It honestly worked so good I was amazed in the beta. I loved having to shit while playing my xbox and sending my game to my phone which clipped to my controller and taking nice long shits while not losing gaming time.", "score": 1, "replies": [{"body": "Wait, I dont think we are talking about the same thing here, are you talking about streaming from your Xbox to your phone? Because xCloud is about not needing an Xbox, streaming from the cloud.", "score": 1, "replies": [{"body": "xCloud had two functionalities in beta test.\n\nStream from cloud to device from their ultimate game library.\n\nThe other was stream from your xbox to your device... Anywhere and the switch from TV to device was almost as quick as pulling a Nintendo switch off dock. I assume they retained this feature as well.", "score": 1, "replies": [{"body": "Oh, I didn't know about the stream from device part. The big thing here though is the stream from cloud part, lot of companies offer stream from device, but streaming from cloud is tough without the customer base having excellent internet connections", "score": 1, "replies": [{"body": "I'm pretty sure they acknowledge this and the technology is just coming out early.\n\nWhen 5G is fully implemented in another two years or so it will be a non issue.", "score": 1, "replies": [{"body": "I actually sideloaded the xcloud beta onto my shieldtv which is wired into my router. There's still latency on a gigabit connection but oddly enough you get used to it. Latency with quick time events was awful though hopefully we can just get rid of that fad. I agree that 5g will make it easier for mobile devices as far as video compression and input latency", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "i sold and took profits yesterday on 8/7 $207.50's too thankfully, and rebought and rolled out on today's dip.  these new revenue streams and potential should be a catalyst for the stock price considering this is the most news i've seen outta MSFT in a while.", "score": 7, "replies": []}, {"body": "Ok. I agree wit u they fuck up most of the time. I was very pissed on how they fked up skype so bad when it had so much potential. But think about it. Noone fks up every fking time. They should have learnt something from all these fk ups and might fking nail it with these upcoming acquisitions. Ms fking ft to the fking moon baby.", "score": 2, "replies": []}, {"body": "1) Wait till it peaks. 2) Spend thousands on inflated premiums. 3) Complain that $MSFT is a Boomer stock. 4) Nervously hold till you profit $1 for every $10k spent....Very retarded (yet common) WSB strategy with $MSFT.", "score": 1, "replies": []}]}, {"body": "20k worth of msft shares  lets go.", "score": 14, "replies": [{"body": "Shares, lol", "score": 29, "replies": [{"body": "Wait... Whats he sharing?", "score": 25, "replies": [{"body": "Your wife.", "score": 22, "replies": [{"body": "Watch your damn mouth! I only share her with her boyfriend.", "score": 22, "replies": [{"body": "But i am her boyfriend.", "score": 6, "replies": [{"body": "Dad ?", "score": 6, "replies": []}]}]}]}]}]}]}, {"body": "Msft 300 29/8", "score": 2, "replies": [{"body": "The retard is strong in this one", "score": 2, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/Roksteady1 don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "What do you mean by the jedi contract announcement? Is there expected to be news that Microsoft is for sure keeping the whole contract?", "score": 1, "replies": []}, {"body": "video game streaming ain't going to be a thing until major ISPs lift their data caps....which they'll never do.\n\nas soon as Lord Elongated Muskrat launched spaceLink or whatever his satellite direct-to-consumer internet service then we can talk about video game streaming", "score": 1, "replies": []}, {"body": "Thank you for the added 8/21 215c confidence Jesus fuck", "score": 1, "replies": []}, {"body": "8/21 217.5c need a boost", "score": 1, "replies": [{"body": "hopefully green today since they almost never have 3 red days in a row", "score": 1, "replies": [{"body": "Hoping it makes up for my autist atvi call.", "score": 1, "replies": []}]}]}, {"body": "MSFT has no business getting in this vertical.  They should fire whoever thought of it.  Lot better businesses to capitalize on.", "score": -2, "replies": [{"body": "they're already big in gaming and cloud. they're just merging synergies.", "score": 13, "replies": []}, {"body": "OP is wrong. Its included with game pass ultimate now and they dropped gold so this is just an added benefit to subscribe. \n\nI beta tested it and this thing will be flawless once 5G is widespread.", "score": 4, "replies": [{"body": "Good to know.", "score": 1, "replies": []}]}, {"body": "How do you figure they have no business getting in this?", "score": 3, "replies": [{"body": "My wording is too extreme.  My meaning is xcloud gaming in particular on the basis the ROI is going to be poor to average at best.  It is not going to meaningfully move their market cap either.  \n\nSeems more like they’re slinging pasta (money) on a wall and seeing what sticks.  Since they have so much money.  \n\nPerhaps there’s a bigger picture I’m missing?  \n\nI agree with OP on the synergy between content delivery under Azure with handling media traffic plays.  \n\nThey likely already do this though in some manner for gaming.  Tik Tok would be big cost synergy, yes, assuming it can be transferred from Akamai/Fastly over time.  \n\nMSFT will be successful for certain.  Just this is nothing to write home about in a heavily competitive / commoditized space.", "score": 2, "replies": [{"body": "From what I understand, Microsoft is trying to extend “MSFT Services” into every facet of gaming. They don’t want to just compete with SONY, they want to be ingrained in the infrastructure of the industry. \n\nI’ve commented this before but I am fully expecting MSFT to continue to buddy up to Nintendo and Steam, and eventually try to establish a partnership of sorts with the two where MSFT infrastructure supports all platforms. They’re very much not trying to participate in “Console Wars” going forward from what I’ve heard, they want to move beyond that.", "score": 1, "replies": [{"body": "This would make a lot more sense.  Epic Games, Steam, etc. makes it a very tight space.  \n\nAnd looks like I screwed up.  Even my own post my gut was TikTok revenue was an at risk issue for Fastly - and they just announced on ER is 14% of revenue.  Fuck me for not adding more severe puts on my calls/shares.", "score": 1, "replies": []}]}]}]}]}, {"body": "nobody gonna buy it", "score": -1, "replies": []}, {"body": "Don't consider Xbox when trading MSFT. It will not stand a chance against PC and PS4.", "score": -8, "replies": [{"body": "But MSFT wins when PC wins...", "score": 14, "replies": [{"body": "Generally YES. But when u are valuing MSFT and considering its risk factors where Xbox play as role then it's future cashflow could be at risk from Xbox sales alone", "score": -6, "replies": [{"body": "It seems all their moves lately have been to commodify gaming hardware and push the division to be a MRR generator regardless of platform. Every Xcloud sale on non-Xbox hardware probably has higher margins since they aren't subsidizing the console, getting the same subscription revenue, and then collecting on licensing from the partner that sold the device.", "score": 4, "replies": [{"body": "Someone in this comment mentioned they bought equity, so I  said don't consider Xbox because even when Xcloud is available to all platforms in the upcoming future it will not generate expected revenues for atleast few years.\n Play options!\n\n\nPS: It will take months for Xcloud to get going on other platforms and I think it will not be available for other platforms such as PS4 anytime soon.", "score": 1, "replies": [{"body": "not sure what ur talking about. they'll generate revenue immediately starting Sept 15th when people start paying for the subscription. And while it'll be available for android phones and pc i think first, and prolly apple soon. Of course it won't be available on Sony's PS4 cuz fuck them.  The whole point is it gives access to the games and community for everyone without having to pay for expensive hardware like xbox and PS4.", "score": 2, "replies": []}]}]}]}]}]}]}
{"title": "The Bullish Case for Airlines Right Now: (SAVE, ALK, LUV, UAl, AAL)", "selftext": "[removed]", "id": "i3yrvw", "created_utc": 1596601725.0, "score": 52, "upvote_ratio": 0.89, "num_comments": 85, "comments": [{"body": "Ngl, I expected a shitpost but this is refreshingly surprising.", "score": 24, "replies": [{"body": "Thanks my man", "score": 9, "replies": [{"body": "What was the post? It shows removed", "score": 2, "replies": [{"body": "Mods removed it because it wasnt PRPL", "score": 1, "replies": [{"body": "paste it here?   Don't know wtf PRPL is.  And fuck mods.  Let Reddit decide what should be upvoted and downvoted.", "score": 1, "replies": []}]}]}]}]}, {"body": "tl;dr I’m in.", "score": 15, "replies": [{"body": "Lets do it", "score": 6, "replies": []}]}, {"body": "No love for the big BA", "score": 7, "replies": [{"body": "Naaa too dicey for me. I like their government contract but so many issues", "score": 5, "replies": [{"body": "Say the Beirut explosion comes back as preplanned attack, would that change your mind?", "score": 3, "replies": [{"body": "That is a really good question I’d have to sleep on for the answer too. What are your thoughts?", "score": 2, "replies": [{"body": "I already bought calls on the dip when BA dropped to 155. DFEN was 35 dollars for 8/21 $12 strike, this happening being an unfortunate event, I think will make my calls PAY", "score": 4, "replies": [{"body": "Just donate a few bucks to relief and you good my dude", "score": 3, "replies": []}]}, {"body": "Judging by this, and if he tweets about this tomorrow saying it was an attack, yeah, I may grab more. \n\n\nhttps://www.google.com/amp/s/www.usnews.com/news/politics/articles/2020-08-04/trump-massive-explosion-in-beirut-was-likely-an-attack%3fcontext=amp", "score": 3, "replies": [{"body": "You son of a bitch. \n\nI’m in.", "score": 3, "replies": [{"body": "You can thank me later.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I just wanna see it dip to 153 and it’s a buy for me. Two years and they’ll be back to 400", "score": 1, "replies": []}, {"body": "You realize that\n1. that’s not an airline\n2. They gave backlogged orders till 2023\n3. They aren’t getting cleared anytime soon", "score": 1, "replies": []}]}, {"body": "I’m jacked to the tits with tech, but I’m looking to add some value plays back into my portfolio and honesty airlines will come roaring back eventually\n\nJETS 9/18 20c", "score": 5, "replies": [{"body": "Yeah I feel like tech profits bout to filter into travel bigly", "score": 4, "replies": []}]}, {"body": "I only like delta", "score": 4, "replies": [{"body": "Legit only fly DAL and JBLU domestic. Inversing everything he said.", "score": 6, "replies": []}]}, {"body": "My AAL sep calls are already 50% up", "score": 4, "replies": [{"body": "Nice", "score": 3, "replies": []}]}, {"body": "You son of a bitch. I've been looking at airlines the last few days and now you're going to let the memers in. Asshole.\n\nHere's what I liked that you didn't mention. People have been flying and we're not seeing outbreaks tied to flights or airports. It might actually be safe with proper precaution.\n\nI like UAL personally as a long term play. 2-3 bagger if you can be patient.", "score": 3, "replies": [{"body": "😂 I had luck with UAL in the past but some articles scared me off. Why you rollin with them", "score": 3, "replies": [{"body": "Really just about upside potential and they're big enough that I think the gov will keep them afloat while Rona ravages. Plus they got some China biz which is already ticking up. You're spot on with your idea about going with airlines not so dependent on biz travel though. Safest play is probably JETS, but why go safe when you're dumpster diving?", "score": 3, "replies": [{"body": "Lol my sentiments exactly. Gonna be punching air when UAL to the moon though", "score": 1, "replies": [{"body": "Why did the post get removed? Ain't mad because maybe now the autists here won't ruin the plays, but it seemed like a decent post with good chatter.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "$30???? Why so fucking far OTM?", "score": 5, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "You realize that works both ways right", "score": 4, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": ">feels like AAL is damn near near it's bottom\n\nFamous last words", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">Pardon me, let me be more specific. I think they're near their immediate bottom.\n\nNew famous last words", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You also forget that you're on a leap, way out of the money", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Fuck you make some sense. I've been wanting to make a profit play off volatility, and the 30c's are cheap enough for me. I'll grab 6 at open and add them to my hodge podge portfolio.", "score": 1, "replies": [{"body": "No, this doesn't make sense.", "score": 2, "replies": [{"body": "Made 85$ off 180$ in a day trade doing this. soooo...", "score": 1, "replies": []}]}]}]}, {"body": "JBLU?", "score": 3, "replies": []}, {"body": "RYAAY. Highest Altman Z score (Metric of how likely a company is to go bankrupt) of all airlines \\~2.5 (higher is better). Virgin Atlantic, a direct competitor, just filed for bankruptcy after hours today. Domestic european airlines saw big jump after virgin news.", "score": 3, "replies": [{"body": "Oh shit thank you for this. I’m gonna look into them", "score": 2, "replies": []}]}, {"body": "Where's JBLU OP? Never flown them, but the big ones all suck and LUV and spirit are for the Poors.", "score": 3, "replies": [{"body": "I hear good stuff about JBlu but I have anecdotal bias— airport near me is actually closing and they are the only JBLU around. I think they have those fringe contracts in a few big cities. I’m sure JBLU will track the index, at a minimum, but they just aren’t on my radar/ personal experience bias", "score": 2, "replies": [{"body": "What about JETS? I know of it's existence, but that's kind of it.", "score": 1, "replies": []}]}]}, {"body": "I’d be weary of states issuing mandatory quarantine measures for [domestic travelers](https://www.google.com/amp/s/www.nytimes.com/2020/07/10/travel/state-travel-restrictions.amp.html) as I feel this might discourage people from flying. I don’t think it’s right to say that there’s no way that they won’t bail out the airlines. They might get something, but as it stands spending is at an all time high, and something has to take the bullet eventually.\n\nThat being said, with school beginning across the country and with the risk that they might close again, and the even bigger risk that this virus flares up again and media hysteria takes hold of the country, I can’t see a huge travel surge in the fall... at least not until next spring at the earliest. Not to mention... not many people are traveling during the school year. Christmas is another story... but it’s just too risky to make any moves that far. Not to mention the election in November....", "score": 2, "replies": [{"body": "That’s fair. I’m more playing the investor recovery than sold out flights, per se, but I’d agree there are a lot of potential obstacles given sensitivity to the news cycle", "score": 1, "replies": []}]}, {"body": "I scooped up DAL shares yesterday. Its less than half what it was pre-covid. They are also in better financial shape than most other airlines. They burned more cash than expected on last earnings call, but Delta isn’t going anywhere.", "score": 2, "replies": []}, {"body": "Didn't read most after the third sentence, but since it's Milt, I hope you covered the fact a large chunk of revenue comes from business flyers.", "score": 2, "replies": [{"body": "Lol si", "score": 2, "replies": [{"body": "That's why I'm weary. Shares, sure. But for Jan 2021 calls, I like the gaming companies more because the revenue source which has been decimated comes from one source which is easier to model.", "score": 1, "replies": [{"body": "Hmph. That’s fair food for thought", "score": 1, "replies": []}]}]}]}, {"body": "JETS 8/6 18p locc , gon be itm at da bell", "score": 2, "replies": []}, {"body": "JETS. That is is all.", "score": 2, "replies": []}, {"body": "Businesses are not going to let their employees go back to flying around like crazy any time soon. The last months have demonstrated that almost all meetings can be done online.. soo.... Not holding my breath for a quick recovery in airlines, even if covid was magically gone tomorrow.", "score": 2, "replies": [{"body": "Si. that’s why I said I’m not playing international/business airlines like UAL and instead looking at domestic leisure like SAVE", "score": 1, "replies": []}]}, {"body": "How do you feel about DAL ?", "score": 2, "replies": [{"body": "I like them. I think they’re the most stable of the majors", "score": 2, "replies": []}]}, {"body": "UAL 6/18/21 33c\nAlso holding shares / selling puts", "score": 2, "replies": []}, {"body": "Thank you , I needed the reassurance 👍", "score": 2, "replies": [{"body": "Np", "score": 2, "replies": []}]}, {"body": "This has to be one of the WEAKEST most UNEDUCATED DD’s I have EVER read in this sub. Sure it may rally a little, but it’s certainly not going on a bullrun.\n\nYou managed to stretch what could have been summarized by “well hopefully we get corona under control quickly, so I think airlines will go up!”\n\nI’m in.... shares..... been selling you calls for weeks.", "score": 2, "replies": [{"body": "If you've been making money off him, why would you be so mad?  I'd take him out for a steak dinner, but that's just me.", "score": 5, "replies": [{"body": "Lmao I’m up like 700% the last month so I sincerely doubt they have sold me a damn thing 😂", "score": 1, "replies": [{"body": "Yeah this was a bit of a dick post saying it’s awful DD.\nAnytime anything vaccine or stimulus related comes up, airlines pump... even if for just a day or two. Likely a safe bet we’ll see something this or next week for quick profit and I like it long too. Although who knows what Fall has in store for us!\nNot saying airlines to the moon, but you’re not wrong at all that we’ll have some movement eventually with stimulus.", "score": 2, "replies": []}, {"body": "700% on airline options ??", "score": 1, "replies": [{"body": "Haha Na but sometimes yes. I went like QQQ-AAPL-VXX-UAL-PYPL-SQ-MSFT-TDOC back to backs almost no fucking diversification lol", "score": 1, "replies": []}]}]}]}]}, {"body": "I’m not getting on an airplane for at least 6 months. Probably a year. And when I do, I’m gonna do it with the 100% credit money from the flights I canceled when Rona hit. Those plays are all way too short.", "score": 2, "replies": [{"body": "I don’t think that’s an unfair response at all . But anecdotally, I live in a coastal city and am seeing lots of friends chomping at the bit to fly cross country to visit friends and family cross country as soon as it’s socially acceptable. \n\nI don’t think they’ll recover by absurd percentages, strike prices not insanely far out.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Same for many people. But I think there’s a difference between willingness to fly and investors seeing an opportunity in a slowly recovering industry", "score": 6, "replies": []}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**SAVE**|**$17.5**|**BUY CALL**|**2020-09-18**|**$1.62**|**$16.5**|**3552**|**632**\n|**SAVE**|**$20**|**BUY CALL**|**2020-08-21**|**$0.33**|**$16.5**|**8635**|**2770**\n|**ALK**|**$35**|**BUY CALL**|**2020-09-18**|**$2.68**|**$34.3**|**74**|**20**\n|**LUV**|**$32.5**|**BUY CALL**|**2020-09-18**|**$1.93**|**$31.4**|**3087**|**235**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckdgvhmez3y7p0786164uw85p) | [Track Record](https://www.pickmojo.com/user/MiltDavis/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "that last line \"Once there is a pullback tomorrow AM\", what do you mean lol im stupid im sorry", "score": 1, "replies": [{"body": "Haha no worries. They had a good run today and AH, so I’d like them to cool down before I get in and I’m hoping that opportunity is tomorrow", "score": 3, "replies": [{"body": "ohh okay okay thank you", "score": 2, "replies": []}]}]}, {"body": "I bought some AZUL 9/18's today.", "score": 1, "replies": []}, {"body": "No fucking way stimulus passes this week. Airlines are going to be a smoldering mess until next stimulus and those calls are going to be a lot cheaper.\n\nI wanna go on a long rant here about how fucking insane u think it is that Covid disappearing makes stimulus even more likely to pass but I'll hold up. But seriously like where the fuck is the fucking logic in that statement I don't get it.\n\nStimulus doesn't pass until something seriously breaks socially or in the capital markets.\n\nEDIT: that being said we might see another technical rotation thru travel idk and maybe idk wtf I'm talking about but there's no way we see a stimulus this week", "score": 1, "replies": [{"body": "I had seirous doubt about stimulus being done this week especially when they said the two weeks. I write about the stimulus alot, and I’m thinking they’re going for a rabbit out the hat affect with McConnell saying he’s on board. \n\nThat said, it may not pass this week. I didn’t say COVID is making the stimulus pass, but maybe I didn’t explain clearly— I was saying the subsiding of COVID cases WITH an upcoming stimulus are complimentary to travel. Not that one is in some way effecting the other. But sorry if that wasn’t clear. \n\nDeep breaths my dude. We’re not that far apart on our logic lol", "score": 1, "replies": [{"body": "haha sorry\n\ni just realized i've read some of your other posts and in general i've learned from them, you have some good insights. cheers homie", "score": 2, "replies": [{"body": "Lol don’t even trip bruh. This is what the internet is for 😂", "score": 1, "replies": []}]}]}]}, {"body": "You would need calls past winter for this information to be applicable. Prices won’t move till demand makes a massive comeback. So option moves aren’t relevant short to mid term.", "score": 1, "replies": []}, {"body": "Same line of thinking. I’m in SAVE and DAL since last week Friday", "score": 1, "replies": []}, {"body": "Mods, u/SignedUpWhilePooping why was this removed?", "score": 1, "replies": []}, {"body": "What about Allegiant? $ALGT. I used to work for them, and my coworkers told me originally alot of flights were canceled or consolidated, however in the past month the location I worked at is now having the same amount of flights as it did last summer(busy season for Allegiant), and airplanes are often close to full as well, hence the added flights.", "score": 1, "replies": [{"body": "I actually glanced at Allehiant and read good stuff about them. Seem to have the same general qualities and upside as SAVE, just couldn’t find enough to strongly recommend. More lack of info than lack of love. I think they are the most interchangeable with LUV", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/MiltDavis don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}
