{"title": "Adjusting your LEAPS contracts", "selftext": "This might be a stupid quesion, but does it make sense/ can it be more profitable to readjust my LEAPS?\n\nI bought a LEAPS on AMD a few weeks back with a strike of 85 .5 and an 85 delta expiring in Jan23. Now AMD dropped around 20%  to 105. I am still very bullish and wanted to know if it could make sense to close this position (about 600$ loss) and buy a new contract at strike around 70 with again an 85 delta.\n\nMy main idea is that my new contract has a higher delta and could outdo my losses if AMD price rises, or will it be more or less a zero sum game?\n\nI  was not able to find how to enter past positions on optionsprofitcalculator to calculate myself. Maybe someone knows how to do that.\n\nCheers!", "id": "tdr37d", "created_utc": 1647239895.0, "score": 12, "upvote_ratio": 0.76, "num_comments": 11, "comments": [{"body": ">I was not able to find how to enter past positions on optionsprofitcalculator to calculate myself. Maybe someone knows how to do that.\n\nIf you want to know the profit characteristics of closing at a $600 loss and opening a similar position then just add $600 to the cost basis of the new position. \n\nThis is what will happen on paper anyway because you'd be getting into a wash sale. Which means if you carry over the new LEAPS into 2023, then you won't be able to claim the $600 loss on your 2022 taxes", "score": 6, "replies": [{"body": "I dont think going from a same date LEAPS strike of 85 to a strike of 70 constitutes a wash sale.", "score": 6, "replies": [{"body": "It's not completely clear.. if they were both deep ITM then it would definitely constitute buying a \"substantially similar security\". Wash sale rules for OTM options are not as well-defined. But if the broker didn't mark it as a wash sale on the 1099 (which is unlikely), then OP could still be on the hook in the event of an audit.\n\n\nConsidering the profit characteristics of those two LEAPS, and LEAPS in general for that matter, I believe it would constitute a wash", "score": -2, "replies": []}]}]}, {"body": "Why don’t you just dollar cost average the same contract?", "score": 1, "replies": [{"body": "OTM vs ITM contracts are handled slightly differently I'd say. I did what OP did but with Microsoft. I left my position and opened another at a lower strike", "score": 2, "replies": []}, {"body": "Right? Double down while the contract is cheap. If OP’s convictions are still strong. I’ve been eyeing LEAPS on AMD but kinda waiting for a little break out one way or the other. Been hovering around $100-$110 every time I check it out", "score": 1, "replies": [{"body": "I bought some 120c 1/23 as well. Ready to average down if necessary", "score": 1, "replies": []}]}]}, {"body": "My 2 strategies would either be to straight up close. I’m bearish in the short term so this would make sense for me.\n\nIf you wanted to keep the position open this would be my strategy. Sell a front ratio call. 2 118 short call and buy 1 call at the 115 expiring 39 days away for roughly a $2 credit. \n\nBuy a put calendar of some variation of a horizontal spread as a way to hedge against a downturn plus its short theta so you are being paid to hold this hedge. I won’t tell you what expiries or strikes as I haven’t traded AMD in a long time and I have literally no clue what it’s price movement will look like nor do I know what is optimal for this stock. It should be cheap to put on. Maybe a couple $100.\n\nIf AMD has a nice rebound you can just close your call debit spread embedded in the call ratio for a nice profit. What you chose to do with the remaining put calendar or the remaining short call is up to you. I probably would roll the calendar upwards hopefully for a credit. Then let the short call ride and hopefully it goes back to being OTM by expiration. Rinse and repeat. \n\nIf the put calendar gets touched you can either close for a profit or you can roll the short call and make a bearish diagonal hopefully for free. It really is up to you.", "score": 1, "replies": []}, {"body": "Be cautious about adjusting too much or for the wrong reasons. Explainer here:\n\nhttps://www.reddit.com/r/options/wiki/faq/pages/mondayschool/yourroll", "score": 1, "replies": []}, {"body": "i have exactly the same situation on my hands. But i will wait a few months while receiving income from the calls. If things go to hell i ll just roll to 2024.", "score": 1, "replies": []}]}
{"title": "Intel eyes subscriptions to grow software sales from 2021's $100m", "selftext": "https://www.theregister.com/2022/03/11/intel_software_expansion/\n\nIntel CEO Pat Gelsinger lately said he wants to grow his company's software business \"rapidly\" with new software-as-a-service products and software platforms that will help the chipmaker better compete against rivals.\n\nWith more than $100m in software revenue last year, this is a natural next step.\n\nDuring Intel's investor meeting last month, the semiconductor giant, which has ambitions similar to Nvidia's in software, revealed for the first time how much it's made from slinging code. Greg Lavender, the head of Intel's new software group, told shareholders software is a \"great opportunity,\" and that he expects to grow the business to $150m this year.\n\nOf course, this figure is a pittance compared to the chipmaker's roughly $70bn in annual revenue, most of which comes from silicon, but remember Gelsinger's software business pedigree as former VMware CEO during that virtualization titan's boom.\n\n\"It's not much at that level for a company our size,\" Gelsinger said at the February 17 meeting, commenting on his \"software-first\" approach. \"We're going to grow it rapidly, but we're going to pull through platform differentiation, which is going to [have a] very disproportional business benefit, even though the near-term revenues are rather small.\"\n\nIntel's paid software efforts span across its business units, including the PC-oriented Client Computing Group, the Datacenter and AI Group, and the Network and Edge Group. Its stable of offerings today represent a mix of homegrown products and those gained through acquisition.\n\nGelsinger said this strategy – like Nvidia's – will allow Intel to collect recurring revenue on top of the money it receives from one-off sales of silicon such as microprocessors and other components. \"We're going to begin layering in differentiated software that pulls through our platform value and creates SaaS service revenue on top of it,\" he said.\n\nAn example of how this software revenue puzzle fits together is the recently acquired Israeli startup Screenovate, whose technology will debut in select Intel Evo laptops by the end of the year. The startup has developed screen duplication technology – demonstrated below – that supports interaction between different devices with different operating systems. This will enable, for instance, users to easily set up a tablet as a second screen for a laptop or access the functions of a smartphone or wearable on a PC.\n\nGelsinger said Screenovate is all about \"driving the ecosystem experience for the PC,\" and that Intel will monetize the technology – though The Register suspects computer makers and not end users will likely foot the bill.\n\nAnother example is with a recent Intel acquisition called RemoteMyApp. The Poland-based startup enables businesses to provide cloud gaming services. During Intel's investor meeting, Gelsinger said the company will use the technology for a cloud gaming service code-named Project Endgame, which will arrive later this year and make use of Intel's upcoming Arc discrete GPUs.\n\nResponsible for the execution of Intel's SaaS and software strategy is Lavender, who was Gelsinger's former CTO at VMware and was hired last year to serve as the chipmaker's CTO and lead the newly configured Software and Advanced Technology Group.\n\nIn a statement that will likely make small and medium businesses a little jealous — OK, maybe a lot — Lavender said Intel built its $100m software business \"without us really trying to sell it.\"\n\nDuring his breakout session, Lavender said Intel's new SaaS and platform products represent \"market-making technologies\" that are built on top of the chipmaker's frameworks, tools and libraries — which includes Intel's oneAPI toolkits —  as well as the BIOS, firmware, operating system and virtualization technologies that serve as the foundation of the company's software efforts.\n\nIntel's paid software efforts also include artificial intelligence products from Cnvrg.io and SigOpt, two software startups the company acquired prior to Gelsinger joining Intel as CEO in 2021. Cnvrg.io is a managed AI service that aims to make it easy to run and move workloads across cloud instances, on-prem servers and edge gateways while SigOpt provides optimization software for large AI models.\n\nThose two businesses, combined with Intel's homegrown OpenVINO software for deep learning inference, represent key products that \"drive much larger valued, market-making capabilities that enable customers, partners, [independent software vendors] and Intel itself to monetize that level of the stack,\" according to Lavender.\n\nLavender displayed these and other solutions at the top of Intel's software stack in a diagram during his presentation, but he said Intel has \"significantly more technology\" than what was shown.\n\nOther examples of revenue-generating software include the Intel vPro platform, which lets businesses take advantage of hardware-based security and management features in Intel vPro CPUs; Intel Unite, a teleconferencing and collaboration solution; and Intel Data Center Manager, a real-time monitoring and management solution. Intel also makes money through support services for oneAPI and OpenVINO.\n\nLavender said Intel will continue to build new paid software offerings through internal development and through acquisitions in the future.\n\n\"We intend to continue to invest and grow our offerings in this SaaS subscription service level and the platform layer both organically and in organically,\" he said.", "id": "tdl0yi", "created_utc": 1647218713.0, "score": 34, "upvote_ratio": 0.87, "num_comments": 11, "comments": [{"body": "Still not confident in Intel.\n\nOn paper looks great. But I can't get past the fact that when they did great over the years their stock never moved. Intel is the step son who will never be loved no matter what he accomplishes in life. Plus prospects look dim for the next 2 years or so as they spend all their money on the new factory and catching up to their competitors.", "score": 16, "replies": [{"body": "I can't bring myself to invest in Intel when Lisa Su is on AMD's side.", "score": 1, "replies": [{"body": "I will be investing heavily in both once they drop further. Shares of intc and leaps of amd.", "score": 2, "replies": []}]}]}, {"body": "Not this shit again. Soon every component of your computer will have a yearly fee.", "score": 16, "replies": [{"body": "Most people I know either pirates or finds alternatives once subscriptions are involved. \n\nWhilst it may temporarily gain a few extra bucks, it may also lose lifelong customers as it becomes the most expensive option again.", "score": 8, "replies": [{"body": "Likewise. As someone that was bullish AF on this stock, I hope they do not go this route.", "score": 1, "replies": [{"body": "If I have to pay a monthly fee for owning an already more expensive intel, then I'll move to AMD.", "score": 3, "replies": [{"body": "Who wouldn't?", "score": 2, "replies": []}]}]}]}, {"body": "Then, you will need to pay a for a subscription to manage all of your subscriptions.", "score": 0, "replies": []}, {"body": "Maybe I am just missing this but where are they saying this above? I only read they will offer subscriptions for software.", "score": 1, "replies": []}]}]}
{"title": "Hello Staflation?", "selftext": "I have been discussing the potential of stagflation with few friends couple of weeks ago and just noticed this following tweet which is why I think Stagflation is inevitable.\n\n[https://twitter.com/elonmusk/status/1503184467397128194?cxt=HHwWhMC5seKTsdwpAAAA](https://twitter.com/elonmusk/status/1503184467397128194?cxt=HHwWhMC5seKTsdwpAAAA)\n\nIts a false sense that economy is good because even though business is booming, company profits are getting smaller and smaller due to cost of doing business.   At some point, since companies could start closing due to negative margins,   unemployment will start rising.\n\nIm a firm believer that the only constant is change.  We are going to go through a rough period hoping that the fed will take the medicine and stop the printer so we can ride a small correction/recession for a couple of years.   Ride it out for a couple of years hoping to bring inflation under control.", "id": "tdnbt7", "created_utc": 1647226131.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 10, "comments": [{"body": "I'm not sure why it took Elon's tweet to highlight this issue to you - this is one of the key contributors to the market declining over the last 6 weeks or so.", "score": 7, "replies": []}, {"body": "Markets going down and prices going up. Last time this happened was with Nixon as president. He banned Russian imports of oil and at that point it blew up… history is just repeating", "score": 5, "replies": []}, {"body": "What does that tweet have to do with stagflation?  I get how it's relevant to the \"flation\" part, but not the stag part.  \n\n\nRight now, there's no evidence that we are headed toward a no-growth economy.  Who knows if that will happen, but it's extreme overstatement to say it is inevitable.  \n\n\nAnd \"the only constant is change\" is a meaningless phrase.  You should stop basing investment decisions on cliches.", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": ">No evidence, or are you burying your head in sand?\n\nno evidence\n\n&#x200B;\n\n>Price of commodities going up -> companies profit margin decreases or go bankrupt -> unemployment rate goes up -> GDP goes down or stays the same while inflation goes up.  \n>  \n>There, we got stagflation.\n\nYou laid out quite a parlay and presented it as though it's a given.  I didn't say there was no plausible means for us end up with a no-growth economy.  I said there's no evidence that we are headed in that direction.  Headwinds exist all the time.  It doesn't mean everyone ends up bankrupt and unemployed.", "score": -1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "1. Why are you being so combative?  I'm happy to discuss this, but I don't see the need for personal insults because you disagree with me.\n2. A lot more went into the stagflation of the 70s than just currency and oil supply.  And we are much less dependent on foreign oil now than we were in the 70s (in fact, our net imports are 35% lower today than in the 70s, and that's in absolute barrel terms, not relative terms).  The critical question here is economic growth.  No one doubts that we have inflation.  That's obvious.  But most economists are not calling for a recession in the next twelve months.  It's possible, sure.  But it's not a given, and it's probably not likely.  High oil prices don't equate recession.  \n\n\nEdit to add: There were also a lot of other factors that went into the stagflation of the 70s.  A recession preceded inflation, for example.  We have inflation now, and he have some economic headwinds.  That doesn't equate stagflation, though.", "score": -1, "replies": []}]}]}]}, {"body": "Margins are getting smaller and smaller and eventually turn red then companies start laying off with unemployment increasing which willl push us into staglation", "score": -3, "replies": [{"body": "Wow, you sure do have a clear picture of the future.  That must be nice.", "score": 3, "replies": []}]}]}, {"body": "50 day and 200 day moving average are reaching the death cross. We may be in for another couple of months of declines if historical trends are an indication.", "score": 2, "replies": []}, {"body": "Like I'm going to take advice from someone who can't even spell the world right.", "score": 1, "replies": []}, {"body": "Stagflation was inevitable since 2020...\nAlso would like to point out that since the US debt can't allow it to last. We will see inflation wreak havoc.\n\nPeople like to point out that Japan has more debt but they entered their Stagflation in much better form than the current US. And their debt exceeded the 200% despite of that. It is worth mentioning that is in part due to the actions they did to curve the stagnation. Unfortunately I doubt The US will be able to do a 'Japan'.", "score": 1, "replies": []}]}
{"title": "Qualcomm almost given back all of the huge gains", "selftext": "A lot of semiconductor stocks have been hammered lately. But Qualcomm especially is taking a hard turn today. Probably because people associate them with Apple, and the news about Chinese cities shutting down due to Covid is probably spooking investors.\n\nI was wondering if anyone has any insights on whether Qualcomm is really that badly affected by the covid shutdowns in China. I remember just a few months ago Qualcomm was bragging about how their multi-source strategy has left them much less affected.\n\nSome possible questions for discussion:\n\n* How badly is the covid chinese shutdowns going to affect Apple and Qualcomm?\n* Is Qualcomm a stock you would consider buying now, why or why not?\n* Do you think covid or the Russian war is going to have long term affect on Qualcomm (beyond 3-4 months)?\n* What semicondutor stock would you buy over qualcomm?\n\nI already have a long position on Qualcomm (as well as amd, nvidia, intel, and marvell).", "id": "te48ow", "created_utc": 1647282558.0, "score": 9, "upvote_ratio": 0.81, "num_comments": 10, "comments": [{"body": "Yes. I am sad about it.", "score": 4, "replies": []}, {"body": "TSM is a good 5 year play as a leader in the market  until the chip shortage and recession goes away. China won’t invade Taiwan anytime soon due to Russia’s failures, and their need for political stability. Not to mention the worlds reliance on TSM right now. \n\nINTL is a good 10 year disruptive play once they have their infrastructure sorted out in the US and make good use of their upcoming government contracts. \n\nOther than that, you could just park your money in NVDA/Apple and call it a day for steady growth.", "score": 4, "replies": [{"body": "s/INTL/INTC", "score": 1, "replies": [{"body": "TSM is a good 5 year play as a leader in the market  until the chip shortage and recession goes away. China won’t invade Taiwan anytime soon due to Russia’s failures, and their need for political stability. Not to mention the worlds reliance on TSM right now. \n\n**INTC** is a good 10 year disruptive play once they have their infrastructure sorted out in the US and make good use of their upcoming government contracts. \n\nOther than that, you could just park your money in NVDA/Apple and call it a day for steady growth.\n\n^^This ^^was ^^posted ^^by ^^a ^^bot. ^^[Source](https://github.com/anirbanmu/substitute-bot-go)", "score": 1, "replies": []}]}]}, {"body": "Hold it for a couple years at least.  They seem like they will be a winner.", "score": 3, "replies": []}, {"body": "I like AVGO but they also have a lot of exposure to Apple.", "score": 2, "replies": []}, {"body": "I bought qcom at 120 if it goes that low damn", "score": 1, "replies": []}, {"body": "What was the big jump in October related to?", "score": 1, "replies": [{"body": "Ah, announcement of $10B buyback?", "score": 1, "replies": []}]}]}
{"title": "UPDATE 2-Musk says Tesla, SpaceX see significant inflation risks", "selftext": "", "id": "tdrkdj", "created_utc": 1647241848.0, "score": 26, "upvote_ratio": 0.89, "num_comments": 12, "comments": [{"body": "Removed because Reuters changed a word in Elon's tweet: exchanged \"pressure\" with \"risks\" - which materially changed the meaning of the tweet:\n\n> \"Tesla & SpaceX are seeing significant recent inflation pressure in raw materials & logistics\"\n\nSince supply-constrained Tesla can pass down costs to customers without losing sales, it's not a \"risk\" to Tesla.", "score": 1, "replies": []}, {"body": "Here is the link of the tweet. Don’t need to link to yahoo : https://twitter.com/elonmusk/status/1503184467397128194?s=21", "score": 15, "replies": [{"body": "That should be Twitter's slogan -\n\n*Twitter - better than Yahoo, I guess*", "score": 6, "replies": []}, {"body": "So far I have resisted Twitter, is there an easy way to follow Elon's tweets without being distracted by the other billion?", "score": -1, "replies": [{"body": "If you only follow him 🤔 ?", "score": 7, "replies": []}, {"body": "I just follow him (and Ghostcrawler but that's not related) and I don't even use the feed. Just go straight to his profile.", "score": 1, "replies": []}, {"body": "If you want you can subscribe to Elon only and even get texts when he tweets.", "score": 1, "replies": []}]}]}, {"body": "Elon at [https://twitter.com/elonmusk/status/1503222294277197829](https://twitter.com/elonmusk/status/1503222294277197829):\n\n\"As a general principle, for those looking for advice from this thread, it is generally better to own physical things like a home or stock in companies you think make good products, than dollars when inflation is high.\n\n\"I still own & won’t sell my Bitcoin, Ethereum or Doge fwiw.\"\n\nNo opinion on the second statement, but agree with the first statement that in times of inflation the stock of successful companies tends to go up relative to cash.", "score": 5, "replies": [{"body": "Unless those companies have high valuations highly dependent on low rate environment. Inflation will typically bring higher rates, and even if inflation is 5-7% this year, that very will could be less than the drawdown in even the best companies' stocks.  \n\nAAPL down 14% YTD...", "score": 2, "replies": []}]}, {"body": "As everybody can see around them. At least the oil-price inflation will help demand for EV's :-)", "score": 3, "replies": [{"body": "The demand was already there. It was always a supply constraint that limited the companies growth in any meaningful way, otherwise there was no ceiling. Now the costs of even the most basic delivery operations have gone up tremendously all the way down to the level of increased cost getting employees to work each day. War only ever ends in two ways, in a mountain of corpses or at a negotiation table. Putting aside putrid nationalism of any kind, it's pretty goddamn obvious which one is in the best interest of general humanity, but, as history has repeatedly demonstrated, pride is the fucking devil. I have no plans to change my long position at all, but in as respectful disagreement as I can muster, I believe there is absolutely no silver lining to be found here.", "score": 7, "replies": [{"body": "Agree demand was always there. But many folks outside the Tesla-bubble didn’t believe that. Now more folks will believe that lasting BEV demand is here. It’s silly. But that’s the way it is…", "score": 1, "replies": []}]}]}]}
{"title": "Tesla may lower Safety Score requirement to 95 if FSD Beta v10.11 performs well | TESLARATI", "selftext": "", "id": "te75s3", "created_utc": 1647290236.0, "score": 32, "upvote_ratio": 0.81, "num_comments": 10, "comments": [{"body": "If it’s an “article” based on a one sentence tweet, just link to the tweet instead of giving these “journalists” clicks.", "score": 23, "replies": [{"body": "But then the poster would have to read the article? Sir this is Reddit…", "score": 5, "replies": [{"body": "Touché salesman", "score": 4, "replies": []}]}]}, {"body": "Doesnt matter.  Ive been at 99 for 3 mths and nothing", "score": 4, "replies": [{"body": "What year and model? I have a 2021 PM3 that has beta, and a 2019 PM3 that’s been at 100% for 2 Months, and nothing.", "score": 3, "replies": [{"body": "2018 M3P.  I reserved in store before the car was unveiled.  Supposedly early access according to elon tweets…", "score": 5, "replies": []}]}]}, {"body": "Is v11 still going to be wide release?", "score": 3, "replies": []}, {"body": "some regressions - https://www.youtube.com/watch?v=IxtnHSwbPFU", "score": 2, "replies": [{"body": "I’ll take half assed if I can just get something for the money I paid haha", "score": 2, "replies": []}]}, {"body": "Wen wide release?", "score": 1, "replies": []}]}
{"title": "Expiration is 4 days away for my NVDA CSP at the 300 strike. I'm thinking of just taking assignment instead of rolling it out another month? Still very bullish despite all of the nonsense going on. Is anyone else in a similar situation? Thoughts and perspectives are welcome.", "selftext": "", "id": "te19lq", "created_utc": 1647274834.0, "score": 7, "upvote_ratio": 0.89, "num_comments": 11, "comments": [{"body": "[removed]", "score": 5, "replies": [{"body": "Yeah it's a hefty 6k loss at the moment. I'm banking on a fairly quick recovery, if not then I'm going to opt for the waiting game. Luckily the gains from previous puts I have sold on AMD and NVDA have offset the bulk of the damage and I was expecting to find myself in this situation sooner or later because of the high IV and the fact that I sell 1SD otm. What would you do as an alternative to this strategy? I'm not seeing very many other liquid high premium stocks out there that I am interested in as long-term buy/holds.", "score": 2, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "I rolled the other day, but I'm near break even. Go figure. I really hope this rally continues and the market knows something we don't.", "score": 1, "replies": []}]}]}]}, {"body": "I have 195-190 spread for this friday.", "score": 2, "replies": []}, {"body": "Yes, about half my positions in varying underlyings. All will get this treatment prior to expiration.\n\nex. CHWY: I am short 45 puts and 40 calls (inverted strangle), with 11 DTE... not happy with that position, but this is the game. \n\nSoon I will close the whole position, wait for earnings to pass (I do not trade through earnings), then sell a just ITM put and add a 30 delta call. Rinse and repeat until the position is profitable, IVR is below 20, or if liquidity dries up.", "score": 2, "replies": []}, {"body": "In truth your pretty fucked in the short term. Either take the loss and move on from NVDA or sell a call ratio way below cost basis with short calls at the expected move. 39DTE 245/235 seem the best strikes in my opinion.\n\nThe reason I say this is because if your short strike gets touched you can close your embedded debit spread and chose to roll the short call up and or out, take the the profit and hope your short calls expire OTM,use the profit to buy more shares and average down or may other things. \n\nYou will also lower your cost basis whilst being short theta albeit at a slower rate but in a safer way imo as you have less risk of selling way below cost basis. I personally like to open hedges and or roll the short call up and out.", "score": 1, "replies": []}, {"body": "245 strike expires for me on Friday as well. I am most likely going to take assignment unless fed meeting on Friday bumps the market high enough fir me to roll out", "score": 1, "replies": [{"body": "Did you do anything today? Nvda rallied a bit.", "score": 2, "replies": [{"body": "Yes was able to roll out a month. New strike 230", "score": 3, "replies": [{"body": "I just rolled today too, might as well collect the extra premium!", "score": 2, "replies": []}]}]}]}]}
{"title": "VXX, OIL creation is halted", "selftext": "https://www.businesswire.com/news/home/20220314005483/en/Barclays-Suspends-Until-Further-Notice-Further-Sales-and-Issuances-of-Two-Series-of-iPath%C2%AE-ETNs-the-%E2%80%9CETNs%E2%80%9D\n\nI'm not even sure what this means. Right now VXX is trading at about 10% over NAV. No clue for Oil\n\nVol in both products has gone through the roof. near term VXX is about 200iv. long term 150iv\n\nVXX is trading at a premium to UVXY, vix futures, vix options.", "id": "teb9qu", "created_utc": 1647301682.0, "score": 20, "upvote_ratio": 0.82, "num_comments": 19, "comments": [{"body": "VXX is most likely going to experience a massive short squeeze. Everyone who has short VXX calls is absolutely boned right now. If you buy VXX shares or calls it goes to cash in the fund not VX contracts. See VXX price vs VXX NAV. Be careful this is going to get next level stupid.", "score": 21, "replies": [{"body": "Wait so if you bought shares of VXX could you ride the wave or would you be unable to buy or sell them?", "score": 6, "replies": [{"body": "I don't disagree there'll probably be a squeeze at some point.  It's trading +10% right now.  Question is: will it hit 12%? 20% or 200%?", "score": 5, "replies": [{"body": "Ok. Everything you said on this thread went over my head. I need someone to translate this to redneck.", "score": 5, "replies": [{"body": "NAV = Net asset Value. the amount of money that a ETN or ETF is worth based on amount of money held under management.\n\nu/Reeeeeekola (nice name lol) is saying that VXX will likely be short squeezed, meaning that all the people that borrowed shares from others to sell, hoping to buy back in lower and pocket the difference, will have to buy to cover to prevent losses from mounting up as VXX climbs higher and higher; volatility indices are known to squeeze in high volatility environments, which usually happen once or twice a decade. \n\nUsually, shorting volatility, or buying etfs that mock shorting volatility, can be highly profitable for long periods of time, with one flash crash in the market causing you to be liquidated. See SVXY for proof of this. From 2011 to 2018, this short volatility index went from ~$23 to $550; then it flash crashed in the 2018 government halting in the US down to the $35-$40 range. Highly profitable, until it wasn't...", "score": 2, "replies": []}]}, {"body": "I am wondering what the mechanics of such a squeeze on a volatility instrument that is decoupled from volatility, and how current OI might affect that, but I'm not experienced enough to understand...", "score": 0, "replies": [{"body": "TVIX did this in 2012. It went about 20% above NAV, but flirted with 100% above NAV and was hard to borrow. the period spikes became a regular source of idiosyncratic risk beyond that of just the vol of vol itself", "score": 3, "replies": [{"body": "Interesting. Were you around? And how did that end up? Meaning how did the fund ultimately close? Asking because I have a bunch of VXX calls I bought before they announces, and since this is a pretty idiosyncratic event, I haven't the foggiest about when to get out.", "score": 2, "replies": []}]}]}]}]}, {"body": "Would market makers need to hedge their gamma exposure through long/short limited vxx shares or VIx futures? If futures then it will be hard for any gamma related squeeze since Option flow is meaningless then.", "score": 1, "replies": []}, {"body": "Happy cake day!", "score": -1, "replies": []}, {"body": "Boom. Hope you all bought calls at open like I did. Back to green on the year. Hell of a ride.", "score": 1, "replies": []}]}, {"body": "Forget ETN => VXX => https://www.businesswire.com/news/home/20220314005483/en/Barclays-Suspends-Until-Further-Notice-Further-Sales-and-Issuances-of-Two-Series-of-iPath%C2%AE-ETNs-the-%E2%80%9CETNs%E2%80%9D", "score": 3, "replies": []}, {"body": "Arb opportunity via short VXX and long UVXY?", "score": 6, "replies": [{"body": "VXX is already pulling uvxy out of NAV", "score": 5, "replies": [{"body": "Think it's a good time to go long UVXY or VIXY?", "score": 2, "replies": [{"body": "I think I'll migrate my trading to UVXY and XIV", "score": 2, "replies": []}]}, {"body": "Da fuck does that mean 🤣 sorry but please explain to an ape", "score": -6, "replies": [{"body": "VXX is an ETN that contains /VX futures contracts but with the ETN demand it is now becoming hard to buy since all the shares are being bought up bidding up the price much higher than the futures markets price which is the NAV. As the shorts try to buy shares to cover the product is being squeezed.  Also typically these products that have to roll futures contracts have decay but since /VX is in backwardation it is organically being purchased as a hedge to SPY. I do not know why Barclays can’t just issue more shares to fix their product because without it, it is broken.  I think the play here would be something defined risk to the downside as the product gets back to NAV. Maybe a ZEBRA.  I wouldn’t want anything to do with a naked short on VXX", "score": 5, "replies": []}, {"body": "https://www.businessinsider.com/what-it-means-that-credit-suisse-is-suspending-creation-units-in-tvix-2012-2", "score": 0, "replies": []}]}]}]}]}
{"title": "When going against Elon actually worked out", "selftext": "https://i.imgur.com/5kg2vM6.jpg\n\nPosition: TSLA $820 01 Apr 2022 6 contracts Put\n\nWsb ppl said never go against elon. But then i remembered inversing this community is better than inversing cramer. So suk my tiny bear pee pee 🐻 uwu.\n\n… i still luv you elon ❤️❤️❤️", "id": "te61re", "created_utc": 1647287290.0, "score": 77, "upvote_ratio": 0.88, "num_comments": 13, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|14|**First Seen In WSB**|1 year ago\n**Total Comments**|69|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=te61re)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=te61re)", "score": 1, "replies": []}, {"body": "I'm like up $3k from shorting TSLA. Feels dirty", "score": 12, "replies": [{"body": "I shorted TSLA three times, made a total of over $6k. Best trades I have ever made and the only reason my total portfolio is still green among a sea of red positions. \n\nFeels great.", "score": 2, "replies": []}]}, {"body": "![img](emote|t5_2th52|8883)", "score": 6, "replies": []}, {"body": "You should short amc and gme for a year while at it.", "score": 6, "replies": [{"body": "How…is that the same? You have more apes than me in your fuckin flair dude, do a better job.", "score": 2, "replies": []}]}, {"body": "GUH", "score": 2, "replies": []}, {"body": "When’d ya buy?", "score": 1, "replies": [{"body": "Bought 2 at the beginning at beginning of march and bought 1 each on each day.", "score": 3, "replies": []}]}, {"body": "Technically not going against him since he recently sold a lot too. He already won, he’s the richest person in the world. Now if Tesla could just get back to a decent valuation I’d love to get back in.", "score": 0, "replies": [{"body": "Oh man you really got him good on that technicality", "score": 0, "replies": []}]}, {"body": "Fuck you fucking fucking fuck you. Inversing Kramer is always the best way to go.", "score": 1, "replies": []}]}
