{"title": "[OC] Warren Buffett's 2022 Portfolio Update at Berkshire Hathaway", "selftext": "", "id": "tp5vrv", "created_utc": 1648332823.0, "score": 42, "upvote_ratio": 0.98, "num_comments": 12, "comments": [{"body": "Missing all the non-public companies.", "score": 8, "replies": [{"body": "It's also missing some public companies like Verizon. This data is off...", "score": 2, "replies": []}]}, {"body": "Another example of “cash” not being defined properly.", "score": 4, "replies": []}, {"body": "Where did IBM go?", "score": 2, "replies": [{"body": "🗑", "score": 8, "replies": []}]}, {"body": "not terribly useful without knowing if this is shares or value of shares", "score": -6, "replies": [{"body": "Implicitly, it would be values of shares. Why would it be number of shares? I can't see how that would be of use to anyone. The number of shares is of no importance.", "score": 6, "replies": [{"body": "disagree.\n\n&#x200B;\n\nnumber of shares change would show if buffet is increasing or decreasing his position, value of position is more impacted by the market's overall preference at the time.\n\n&#x200B;\n\nfor instance buffet recently reduced his chevron position 50% BEFORE the run up in oil.  However, oil/chevron stock also has nearly doubled over the same time period so via this value based chart chevron would not change.\n\n&#x200B;\n\nEven though buffet both missed the oil run up AND decreased his position this chart is not indicative.  Multiply this error by every stock in his portfolio and this chart is really quite useless.\n\n&#x200B;\n\nWith all that being said I would still work as a janitor at brk to parrot his genius trades.\n\n&#x200B;\n\nhave a peaceful day", "score": -4, "replies": [{"body": "I think you are correct If percentage of the company owned is considered instead of the quantity of shares. The number of shares is quite arbitrary and is meaningless for any serious value investor. With all being said, there's a lot of limitations on the data you can get in a concise form as this. \n\nHave a good day.", "score": 2, "replies": []}]}]}]}, {"body": "Can't stand these animations of charts that could be static line graphs. I'm not waiting around. Pie charts are the least information dense, the manager's favorite.\n\nCongrats you turned 1000 bytes of data into 10 million or whatever.", "score": 1, "replies": []}, {"body": "This is way too cool! Thanks for the post!", "score": 1, "replies": []}, {"body": "WB nailed it with Freddie Mac & Petro-china. Both went bust after he sell it.\n\nSame with the Gillette™, I think P&G had to do a massive writedown on Gillette™ back in 2017 I think.", "score": 1, "replies": []}]}
{"title": "Bear Put Spread on AAPL?", "selftext": "I never traded options before and I probably won't do this strategy, but I feel a bear put spread on AAPL would work right now (Monday 3/28/2022). Can someone explain if this could or could not work? Thank you", "id": "tp6xdq", "created_utc": 1648335799.0, "score": 3, "upvote_ratio": 0.8, "num_comments": 10, "comments": [{"body": "It will work if the stock goes the direction you need it to, depending if you are doing a credit or debit spread.", "score": 6, "replies": []}, {"body": "if you buy a put debit spread and it goes below your strikes, yes it would work...", "score": 4, "replies": []}, {"body": "Are you wanting to bet that AAPL is going to go up or go down?  You called it a \"bear\" put spread, so I assume (but want to make sure) that you believe that AAPL will go down.\n\nSo AAPL closed Friday just below $175.\n\nThis is the weekend, so option prices are going to change Monday when the market opens, but as of the close of market Friday, you could have done this:\n\n* Sell a $175 AAPL put with an expiration of 4/1/2022 for $2.30/share, or $230\n* Buy a $177.50 AAPL put with an expiration of 4/1/222 for $3.85/share, or $385\n\nMost brokerages charge roughly a $0.50/option commission, so add a dollar to your cost and you would have spent $156.\n\nSuppose that come Friday afternoon, AAPL is trading at $165/share (or any number safely below $175 where there is no worry about a sudden spike).  You will simply do nothing.  Your $177.50 option will be exercised for you.  You will sell 100 shares of AAPL and receive $17,750  Your $175 option will be assigned. You will buy 100 shares of AAPL, at a cost of $17,500.\n\nThe difference between these two numbers if $250.  Subtract the $156 you spent and you will have profited $94.\n\nOn the flip side, suppose, come Friday afternoon, AAPL is trading safely above $177.50, say, $190.  Both options are simply going to expire as worthless and you will have lost the $156 that you spent on the options to begin with.\n\nIf AAPL is anywhere near the $175-177.50 range, then you will want to close out the options yourself (which will cut into your theoretical profit because there will be a time premium).  The WORST thing that can happen is that ONLY ONE of the options gets exercised/assigned, then there is some big news over the weekend that moves against you, and you find yourself in a big hole.  \n\nSuppose that you're looking at AAPL, you see it is $174, and you figure, great - maximum profit!  But then, a few seconds after close, it shoots up to $175.01.  Now, the $175 put you sold will expire as worthless.  But your $177.50 put will be exercised for you.  You will find yourself short 100 shares of AAPL with an extra $17,750 in cash.  Now suppose over the weekend, there's some great economic news and AAPL shoots up to $190.  Now, instead of your \"maximum loss\" of $156, you're going to lose a whole lot more because you're short shares that are worth $19,000.", "score": 4, "replies": [{"body": "thank you so much for your explanation I had no idea the possible risks were that large, I think my best bet is to practice with paper money.", "score": 2, "replies": []}, {"body": "great info. thanks", "score": 2, "replies": [{"body": "I wonder if /u/thirst4combat21 did a bear put spread on AAPL expiring today.  AAPL finished at $174.31, so the example above would have earned him a cool $155.\n\nI did a short $172.50 put on AAPL expiring today (so a bullish play) and made $160 on that.", "score": 2, "replies": []}]}]}, {"body": "I’m sorry to ask this but what does debit and credit mean for the puts", "score": 1, "replies": [{"body": "Credit means you sell the option and receive a premium. Debit means spending money to buy option.\n\nImagine yourself as an insurance company when you sell option for credit. And insurance policy buyer when you spend money to buy an option.", "score": 2, "replies": [{"body": "Thank you so much that helps a lot", "score": 1, "replies": []}, {"body": "He's actually referring to debit/credit in regards to a put spread I think. Credit spread means you sell the near put and buy the far (cheaper) put, for a net credit. Debit spread is the opposite.", "score": 1, "replies": []}]}]}]}
{"title": "Seeking El Dorado - Finding the next Amazon amid all the hype", "selftext": "Recently, I came across [this viral tweet](https://twitter.com/stephsmithio/status/1500986096745779200) that tried to capture the various generation-defying stats of our time. The story is that Jeff Bezos left his high-paying job at a private equity firm to start Amazon after seeing that the internet was growing by 2,300% per year! The tweet prompted a lot of great examples of industries and tech that are growing extremely fast.\n\nWhile not all of us can leave our jobs to follow a fast-growing trend, something we can do is invest in such companies/industries. For example, over the past 20 years, tech (QQQ) has given [2x the return](https://marketsentiment.substack.com/p/red-pill?s=w) of the S&P 500 while almost having a similar risk profile and max drawdown.\n\nAnother fantastic example is Moore’s Law in microprocessors. Gordon Moore, the co-founder of Intel, hypothesized in 1965 that the number of transistors that will fit on a microprocessor will double every two years while simultaneously costing less. More than 50 years later, we still observe Moore’s law in effect and it has left a lasting impact on both computing and electronics\\[1\\].\n\nThe reason I brought up these two examples is to highlight the disproportionate returns you could have generated investing in these fields early on - Imagine getting into e-commerce in the early 2000s or microprocessors in the early 80s. So in this issue, let’s deep-dive into some of the fastest-growing industries of our time and see where and how we can invest in them!\n\nhttps://preview.redd.it/gvpdxc0ghqp81.png?width=1272&format=png&auto=webp&s=924093f8a5c19295dc33ea527d6939ec3d0460d4\n\nhttps://preview.redd.it/5zakywchhqp81.png?width=1728&format=png&auto=webp&s=77a7d073a4812096ed8cde4fcb60927e6e4838b7\n\n**Lithium-Ion Batteries**\n\nhttps://preview.redd.it/phiizunihqp81.png?width=741&format=png&auto=webp&s=dbec8fc0e33a754f008f219dae75d85ac008f45e\n\nThe price of lithium-ion batteries has fallen more than 97% in the last 3 decades. It is in ubiquitous use, in everything from our phones to electric cars. If you are still not convinced about the breakthroughs here, the fastest-growing 10-year-old company in the world is battery-maker [CATL](https://twitter.com/tsungxu/status/1491912243658858499). The company has grown 125% in its 10th year with a revenue of $15 Billion. That makes it double the growth rate of Stripe, Facebook, and AWS when they were 10 years old!\n\nThis is literally comparable to selling shovels during a gold rush as all the electric car manufacturers trying to one-up each other using VC money **have to buy batteries from these companies.**\n\nhttps://preview.redd.it/8u6v80wjhqp81.png?width=906&format=png&auto=webp&s=70453708b41f25ae5f7e64217716aa77a268b2f8\n\nThe accelerating rate of battery technology/demand is captured perfectly by [LIT ETF](https://etfdb.com/etf/LIT/#etf-ticker-profile) where in the first five-six years of its inception it barely gave any return but in the next five, it has doubled the return generated by the S&P 500!\n\nhttps://preview.redd.it/9nli2tdhhqp81.png?width=1728&format=png&auto=webp&s=5fc0ec062dad6c555ae3c9f1116314fc836130a8\n\n**Gene Mapping**\n\nhttps://preview.redd.it/z3dyxielhqp81.png?width=1272&format=png&auto=webp&s=bdac7f6d3b53f4933e88d940ce36d5e050b9609a\n\nThe cost of mapping a Human Genome has fallen from $100MM in 2001 to less than $1k in 2021. That’s a 1,00,000x reduction in price over a period of 2 decades. This has beaten Moore’s law and then some! If you are wondering about the applications of genome mapping, it can be used to identify genes that cause hereditary diseases, cancer, and can also identify favorable traits in farming and animal husbandry. There are broader uses such as in Forensics as well as in creating personalized treatments for diseases.\n\nhttps://preview.redd.it/8t5sqf6mhqp81.png?width=940&format=png&auto=webp&s=d7279bd5d1bc6cb8ad0b91bbab84f84ac9483f96\n\nOne of the largest ETFs that tracks Genomic improvements is ARKG. It has returned in line with S&P500 after its inception in 2014. But at its ATHs in 2021, the fund almost had 5x the return of the S&P 500!\n\nhttps://preview.redd.it/0mvb2dehhqp81.png?width=1728&format=png&auto=webp&s=60333072f63e22685da3d570cdbf70f4c7ca1cc4\n\n**Lab-Grown Meat**\n\nhttps://preview.redd.it/u0ar5kbnhqp81.png?width=600&format=png&auto=webp&s=f27533dcd08fda55a441c6a2e80f8eb266a3f00f\n\nWe all know that eating meat has a [high environmental impact](https://www.bbc.com/news/explainers-59232599). But the good news is that the cost of lab-grown meat has dropped 90% in the last 2 years and it’s expected to drop another 99.5% in the next 3-4 years. Once/if the artificial meat develops the same taste profile as the real thing and costs much less than the current method of animal husbandry, there would be a massive shift in the dietary habits (especially in the case of fast foods where we are already seeing an increasing shift towards plant-based meats).\n\nI could not find any active ETFs that have a stake in these companies as most of the players in this space are currently still private. The only one I could find was a London-based venture capital firm called Agronomics that focuses on investing in Cellular agriculture. It has returned 289%\\[2\\] since its inception (Oct’20) when compared to 40% returned by the S&P 500 during the same time period.\n\nhttps://preview.redd.it/z0vecwehhqp81.png?width=1728&format=png&auto=webp&s=ef837b4d372569f9bee89e71baf90861b0e29b6e\n\n**Space Flight**\n\nhttps://preview.redd.it/zfu7cepohqp81.png?width=660&format=png&auto=webp&s=12f8c4cbef35f545d888e661747272f83d27fe9e\n\nThe cost of space flight has also undergone an exponential reduction in the last few decades with the cost to send 1kg into orbit being more than $50k in the 1980s to less than $1k now with SpaceX coming into play, with its reusable stages and fairings.\n\nIt’s not just big players such as SpaceX and ULA that are in the race to reduce the cost of space flight. There are 100s of [small players ](https://en.wikipedia.org/wiki/List_of_private_spaceflight_companies)who are trying their hand at getting into orbit in a variety of different ways. All of this means that we would get cheaper access to satellite internet, more accurate GPS, and better weather and terrain mapping.\n\nThere are only limited ETFs in the space as its a pretty new field for private players. The biggest one I could find was [UFO (Procure Space ETF)](https://procureetfs.com/ufo/) with $90MM+ under management. We do not have any meaningful backtests as the fund was launched only in 2019.\\[3\\]\n\nhttps://preview.redd.it/59c1shfhhqp81.png?width=1728&format=png&auto=webp&s=e71043e38505b42cc541d4f46f16d63a45126e14\n\n**Cyber Security**\n\nhttps://preview.redd.it/gqimgycqhqp81.png?width=300&format=png&auto=webp&s=a11280ae023c901e25afd77fb062e0ee41febca6\n\nThe number of cyber-attacks against companies and individuals is increasing exponentially. Ransomware attacks now cost more than $20B in damage every year. Companies going virtual due to the Covid crisis have only accelerated the trend. Adding to this, the number of IoT devices has exploded in recent years contributing to more weak spots for hackers to exploit.\n\nWhat is more concerning is that there are [more and more attacks](https://securityboulevard.com/2020/02/20-ransomware-statistics-youre-powerless-to-resist-reading/) against critical government organizations such as power stations, nuclear plants, schools, and municipalities. All of this means that companies in the cybersecurity field are expected to rake in a fortune in the next decade.\n\nhttps://preview.redd.it/w86yko8rhqp81.png?width=928&format=png&auto=webp&s=2858d895da0e15abf0aa4bbdac17392c647eb834\n\nOne of the biggest ETFs in the cybersecurity field is the First Trust Nasdaq Cybersecurity ETF with more than $6.5 billion under management. Since its inception in 2015, it has slightly outperformed the S&P 500.\n\nhttps://preview.redd.it/u78cs6ghhqp81.png?width=1728&format=png&auto=webp&s=0f0a9417bd26604b316f0f501cacf8de82d4699e\n\n**Other Promising Industries**\n\nI cannot possibly cover all the high potential industries and their performance in a single article. So here are some industries that I think have the potential to disrupt our world in the next few decades and some of the most popular ETFs associated with them.\n\n1. Solar/Clean energy - A new solar plant is now 3x cheaper than a coal one and the cost per unit of solar energy has dropped by a factor of 5x in just the last decade ([iShares Global Clean Energy UCITS ETF](https://www.ishares.com/uk/individual/en/products/251911/ishares-global-clean-energy-ucits-etf?switchLocale=y&siteEntryPassthrough=true))\n2. [E-Sports](https://twitter.com/stephsmithio/status/1443403507957002242) \\- E-sports viewership has outpaced major league sports, and the prize money has grown more than 4,000x in the last 2 decades.\n3. Crypto Adoption - Crypto adoption is closely following the internet adoption trend and the current trajectory predicts more than 1B users by 2027!\n4. AI - The scale of AI models has grown [more than 1,00,000x](https://twitter.com/stephsmithio/status/1501729837366452224?s=20&t=0vlq_iPiTKl5TwV06W-BWA) in just the last 3 years. This would be instrumental in creating self-driving tech as well a starting point for Artificial General Intelligence (AGI) ([BOTZ - Robotics & Artificial Intelligence ETF](https://www.globalxetfs.com/funds/botz/))\n5. Autonomous driving - This will be closely associated with the development of AGI. Whoever cracks this is going to have a monopoly over a multi-trillion dollar industry. Think about it. If you have fully autonomous driving, all Ubers can be driver-free, all inter-state transportation can be done without truckers, etc. The applications would be endless ([iShares Self-Driving EV and Tech ETF](https://www.ishares.com/us/products/307332/ishares-self-driving-ev-and-tech-etf))\n6. [Global Fertility Rates](https://ourworldindata.org/fertility-rate) have halved over the past 50 years. This represents an unprecedented issue where the number of old people would overtake the number of young people leading to a demographic crisis. All our capitalistic systems such as Pension, 401K, healthcare, taxes, etc. are designed under the assumption that the number of people in the workforce would far outweigh the number of retirees. A sudden shift might be catastrophic.\n\nhttps://preview.redd.it/2hjv6nghhqp81.png?width=1728&format=png&auto=webp&s=62e09cbb312fc9f05b0fe0fd55df6b131c3db598\n\n**Some Caveats**\n\nBefore you try to invest in any of these industries/stocks, you should be aware of the following.\n\n**On Returns**\n\nWhile judging the returns, please note that most of the above would fall into the category of extreme growth stocks. As such, their returns would have taken an extra hit in the current bear market that we are in. The S&P500 is down 8.2% YTD. Growth stocks generally have a high Beta which would cause them to drop down even further. All these backtests would have looked very different just 3 months back - Remember, [what Beta giveth, Beta taketh away](https://www.investopedia.com/terms/b/beta.asp) just as easily.\n\n**On ETFs vs Stocks**\n\nI have focused on broad ETFs here because that’s the easiest and safest way to get exposure to these industries. There is definitely a higher likelihood of abnormal gains if you are willing to take the risk of finding an individual company that you can invest in for the long haul. For reference, over the past 2 decades, Nasdaq gave a 965% return but Amazon gave a 21,800% return!\n\n**On Hype**\n\n>it's much easier to remember the technologies that succeed (we're surrounded by them) rather than the technologies that fail. - **Michael Mullany**\n\n[This](https://www.linkedin.com/pulse/8-lessons-from-20-years-hype-cycles-michael-mullany/) is an excellent article that highlights hindsight and survivorship bias that we show while predicting the future. Not all the technologies that are hyped for their growth make their way into mainstream usage (Ultrawideband, RSS Enterprise, Desktop Linux), and technologies that were under the radar the whole time suddenly exploded into popularity (eg. Open Source, NoSQL, x86 virtualization).\n\nhttps://preview.redd.it/cvwbr4hhhqp81.png?width=1728&format=png&auto=webp&s=7472e8da03ed6d3d7442111c5094116a1a1dd8a7\n\n**Conclusion**\n\nIt’s very hard to predict the future. For every Amazon, there are 100s of pets.com. For every promising industry that became mainstream, there were a hundred others that were equally promising and died out. Maybe we wouldn’t end up liking the lab-grown meat, or some phenomenal breakthrough in Nuclear Fusion could make all the other renewable energy like Wind and Solar obsolete overnight!\n\nWe are definitely minimizing the risk by betting on industries instead of single companies. I would like to think of it as running our own private equity firm. By making a lot of small bets on these upcoming industries, when we are wrong (which we would be the majority of the time), our losses would be small but when we get it right, the outsized returns would dwarf all our other small losses!\n\nMaking an investment against all of these uncertainties is certainly difficult. But then again, if it was easy, everyone would be doing it!\n\n***Comment below in case I missed out on any big trends that you think should be covered. I will keep adding to the list.***\n\nhttps://preview.redd.it/vxtr3khhhqp81.png?width=1728&format=png&auto=webp&s=9877dbc507c943ed6cef9cc9e123345238e514df\n\n**More interesting reads**\n\n[Deep Work:](https://www.calnewport.com/books/deep-work/) I am generally not a big fan of self-help books but this one is an exception. Cal Newport delves into the ability and importance of focusing on something without being distracted. Think about the last time you worked for 2 hours without being distracted by either your phone or an email. This book shows you that you can get more work done in lesser time if you just focus on the task at hand.\n\n[Steph Smith](https://twitter.com/stephsmithio): This article was made possible only because of her insightful thread. She has an amazing podcast as well as fun-to-read threads on Twitter that are a treasure trove of information. [Check out](https://twitter.com/stephsmithio/status/1485354599091367937) this one where she compiled the best tools on the internet.\n\n**Footnotes**\n\n**\\[1\\]** Microprocessors are ubiquitous now and are present in almost all the electronics we use. There are [some arguments ](https://www.brainspire.com/blog/end-of-moores-law-whats-next-for-the-future-of-computing)around how Moore’s law will end soon.\n\n**\\[2\\]** Please note that this company can be considered as a penny stock (valuation of around \\~$200MM only)\n\n**\\[3\\]** Though it has significantly underperformed S&P500 since its inception", "id": "top1rx", "created_utc": 1648303141.0, "score": 68, "upvote_ratio": 0.91, "num_comments": 18, "comments": [{"body": "Nice article.", "score": 14, "replies": [{"body": "Thank you! You can check out my [best articles here](https://marketsentiment.substack.com/?sort=top) and our subreddit r/market_sentiment where we discuss these articles :)", "score": 5, "replies": []}]}, {"body": "Bezos' connection to hedge funds is exactly why Amazon has become as big as it has.", "score": 6, "replies": []}, {"body": "TLDR - but do you know how many e-commerce companies created in 2000 are still around today?", "score": 5, "replies": []}, {"body": "Catl is Chinese.. stay away!", "score": 8, "replies": []}, {"body": "Excellent write up. Definitely got me thinking.\n\nI’ve been trying to do an analysis of hydrogen fuel cell ($HYZN). I think there’s incredible potential, if production costs follow the pattern of lithium ion batteries. I just can’t figure out it’s mass adoption potential", "score": 3, "replies": [{"body": "Hydrogen goes boom.", "score": 2, "replies": []}]}, {"body": "you realise that catl is chinese?", "score": 9, "replies": [{"body": "So?", "score": -8, "replies": [{"body": "ok", "score": 4, "replies": []}, {"body": "\"Check out our new flavor of Chinese Stock Cereal: Oops, All Nationalized!\"\n\nThat's why people are mildly hesitant to invest in them.", "score": 1, "replies": []}]}]}, {"body": "Don’t let the “how I became a billionaire from scratch” fairy tales get you worked up. Stay grounded in reality.\n\nWe’re heading into a recession. You don’t have to worry about which gene editing company comes out on top. Just have awareness of the market cycle and you can make a killing.", "score": 2, "replies": []}, {"body": "Stopped reading at ARKG, just because an ETF provides sector exposure doesn’t mean it’s a quality holding. And *exposure* is the key word, they certainly aren’t a genomics-pure, or even therapeutics-pure, fund with TDOC as their 2nd largest holding at almost 8%. Grift", "score": 0, "replies": []}, {"body": "Very good article.", "score": 1, "replies": []}, {"body": "!remindme 2 days", "score": 1, "replies": [{"body": "I will be messaging you in 2 days on [**2022-03-29 01:39:54 UTC**](http://www.wolframalpha.com/input/?i=2022-03-29%2001:39:54%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/top1rx/seeking_el_dorado_finding_the_next_amazon_amid/i29ica2/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Ftop1rx%2Fseeking_el_dorado_finding_the_next_amazon_amid%2Fi29ica2%2F%5D%0A%0ARemindMe%21%202022-03-29%2001%3A39%3A54%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20top1rx)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "This is awesome, thanks.", "score": 1, "replies": []}]}
{"title": "What do you think of MMM after they just got another 50M lawsuit? If they get cheaper will you consider buying them?", "selftext": "https://www.google.com/amp/s/www.foxbusiness.com/technology/3m-50-million-army-veteran-earplugs-lawsuit.amp\n\n\"Friday's judgment is the second-largest related to earplugs produced by 3M. In January, a federal jury awarded $110 million to two Army veterans who claimed they suffered hearing damage because of the product.\"\n\nSo basically more than 280,000 former and current military members have sued 3M over the earplugs and veterans were award 110M and now another 50M (25/03).\n\nWill 3M recover from this? If they do and if you have the possibility of buying them under $140 do you think it can pay out?", "id": "tozqhk", "created_utc": 1648319471.0, "score": 12, "upvote_ratio": 0.76, "num_comments": 20, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Yes, I do believe a 85 billion dollar company will recover from a 50 million dollar lawsuit.", "score": 21, "replies": []}, {"body": "All I know is that they make good electrical tape. The other brands are so shit. But that’s all I know about them", "score": 10, "replies": [{"body": "Their products are so good they sometimes carry a risk of cancer!", "score": 2, "replies": []}]}, {"body": "They have a much bigger lawsuit coming up. The PFOS poisoning in Belgium. https://nl.m.wikipedia.org/wiki/PFOS-schandaal#/search\nIf anything, I’d go very short on them.", "score": 6, "replies": [{"body": "It says they settled?", "score": 2, "replies": [{"body": "For cleaning the soil, but not for individual health cases. Thousands of people have too high pfos bloodvalues and that’s related to all kinds of diseases and cancers. \nIf this was the US, lawyers would enjoy this thoroughly.", "score": 3, "replies": [{"body": "Ah ok, might be a pretty big class action then. Seems like 3M could have a lot of pain ahead. \n\nCheers", "score": 2, "replies": []}]}]}, {"body": "Belgium is not the US. Belgium is known for a lackluster judicial system. Neither is there a culture of mass claims / lawsuits.  \n\nI wouldn't go short on 3m based on this.", "score": 1, "replies": [{"body": "I wouldn’t call it “lackluster” even though that’s a very nice word. I had to Google it. But you’re definitely right about there not being a class act culture. If this WAS the us, they would be in for huge claims.", "score": 2, "replies": []}]}]}, {"body": "Stay away from this. There’s better places to put money that don’t have lawsuits up the ass on the horizon", "score": 6, "replies": [{"body": "Also they are just a shit company with profit over morals. Trust me I'm from Belgium.", "score": 2, "replies": [{"body": "De Haan & Gent!!! represent!!! Whoop whoop!!!", "score": 1, "replies": [{"body": "Antwerp representing here", "score": 1, "replies": [{"body": "Hell yeah! Antwerp in the house!!!", "score": 1, "replies": []}]}]}]}]}, {"body": " BUY", "score": 2, "replies": []}, {"body": "As a veteran, I can tell you:\n\n1) Those earplugs were just foam, but I don't know how any \"better\" earplugs would be any better.\n\n2) There's no test for tinnitus. Just the yes or no question \"Do ever hear ringing in your ears?\" Like at any time ever. Not always or just right now. I'm not saying people are lying, but it's a very easy 10% disability and you shouldn't use any stats that the V.A. might report.", "score": 0, "replies": []}, {"body": "Ok I did not know that…", "score": 1, "replies": []}, {"body": "I feel like 3M should get some kind of award for keeping unemployment numbers so low within the legal industry", "score": 1, "replies": []}, {"body": "Why do people need 110M in fines? Pretty sure you can fix your hearing for cheaper.", "score": 1, "replies": []}]}
{"title": "According to a new permit application filing made on March 25, 2022, Tesla is looking to build an up to 53 acre Battery energy storage system and a switchyard at their Giga Texas factory.", "selftext": "", "id": "tol5qk", "created_utc": 1648288031.0, "score": 172, "upvote_ratio": 0.98, "num_comments": 18, "comments": [{"body": "Part of master plan part 3. Become the largest energy company in the world.", "score": 56, "replies": [{"body": "Yasss", "score": 13, "replies": []}, {"body": "Nice, that is exactly what i want to see. Stop selling megapacks, use them all themselves. They now have the cash to do it.", "score": 10, "replies": []}, {"body": "Scaling to infinity ftw", "score": 3, "replies": []}, {"body": "I put half my money into Tesla in 2017 because of the disruption in energy. It’s finally happening!", "score": 2, "replies": []}, {"body": "Pretty sure part 3 is making the freest social media platform of them all.", "score": 2, "replies": []}]}, {"body": "Hm. A Megapack is the size of a standard shipping container. You can fit about 17,000 containers in that area. Assume a packing density of say 10% (for infra, space between containers, the switchyard etc), it's about 1700 Megapacks, equivalent to about 5 GWh. That is what, three times the size of the largest currently operating grid battery?", "score": 28, "replies": [{"body": "Everything is bigger in Texas.\n\nOn a different note, is 5GWh enough to power giga Texas?", "score": 11, "replies": [{"body": "For a while, but in order to figure out how long the while would be, someone should look at the permits to see what Tesla estimates as the power consumption of the factory.", "score": 5, "replies": []}]}, {"body": "Think vertical, typical cargo ships carry roughly \\~20,000 Containers (Megapack size analog)\n\nReference: Moss Landing (older article, size has increased since to 1.6) was 256 Megapacks. https://www.teslarati.com/tesla-megapack-moss-landing-update-video/\n\nPlease fasten your seatbelts…ding", "score": 2, "replies": []}]}, {"body": "I have no idea how much energy a system at that size could store, but given the problems that the Texas grid has had in the recent past it makes a lot of sense to build something like this. Plus they might be able to save a lot of money by just using battery power (to some extent) at peak hours and recharge when power is cheaper.", "score": 20, "replies": []}, {"body": "Elon wants a Mars Colony. A Mars Colony would need its own energy solution.\n\nAnd it would be so much easier to make prototypes on Earth first, before sending them into Space. \n\nAnd if Elon truly made his factories energy independent? That would be a major step for energy independence for the rest of the human race.", "score": 32, "replies": [{"body": "I think this is more related to getting off fossil fuels on earth. Martian bateries will require super high energy density if they come from earth", "score": 2, "replies": []}]}, {"body": "https://abc.austintexas.gov/public-search-other?t_detail=1&t_selected_folderrsn=12902637&t_selected_propertyrsn=156696", "score": 6, "replies": []}, {"body": "I wonder how much of the surrounding area they could balance with this. Could become a significant part of the local grid?\nBe interesting to see the cost savings for the factory itself with the amount of solar they're installing on the roof. And in the shape of their logo too. Great talking point as people fly by.", "score": 9, "replies": [{"body": "Giga Nevada was originally planned to be mostly solar powered when it was completely built out. Obviously Nevada has not kept pace with the original plan, so I'm wondering if Giga Texas is going to try and implement that. The layout of the solar panels makes me think they aren't going at that grand of a scale, but I was curious if Giga Texas could back feed to the grid on scale during off-peak hours as an additional cost-saving measure.", "score": 3, "replies": []}]}, {"body": "NEWS: According to a new permit application filing made on March 25, 2022, @Tesla is looking to build an up to 53 acre Battery energy storage system and a switchyard at their Giga Texas factory.\n\nI imagine Tesla would use their own Megapacks for this BESS. \n\n---\n\nPhotos in tweet | [photo 1](https://pbs.twimg.com/media/FOv4IFJXwAUOa5t.jpg)\n\n---\n\nposted by [@SawyerMerritt](https://twitter.com/SawyerMerritt/)\n\n---\n\n^(If media is missing, please DM me with a link to submission url and tweet. I will do my best to solve the issue)", "score": 2, "replies": []}, {"body": "Would be wild if they build a 53 acre approximate solar panel layer ontop of the megapacks and then surrounded the entire lots perimeter with wind turbines, and fed both sources back into the megapacks.\n\nhttps://www.usgs.gov/faqs/how-many-homes-can-average-wind-turbine-power#:~:text=According%20to%20the%20U.S.%20Energy,is%202.75%20megawatts%20(MW).\n\nAverage wind turbine generates 843MW per month, which comes to be 28.1MW a day at like 40% efficiency.\n\nhttps://www.semprius.com/how-much-space-does-a-wind-turbine-need/\n\nAssuming a 1 acre buffer at each corner, you'd get 51 wind turbines per side of the lot x4 sides for the lot, and you'd get 204 turbines that would generate 5,732.4MW per day @ 40% efficiency. In theory, a 53 acre square lot is sufficient to power this ~3GW giga or terapack, and sell the rest back to the grid for profit or direct much of it to giga Austin, have the plant as peaker/backup, and whatever is left over is sold to the grid for profit.\n\nAssuming my math checks out.", "score": 1, "replies": []}]}
{"title": "Full text of today’s Elon interview with Axel Springer", "selftext": "Elon Musk discusses the war in Ukraine and the importance of nuclear power — and why Benjamin Franklin would be 'the most fun at dinner'\n\nMathias Döpfner2 hours ago\nMathias Döpfner speaks with Elon Musk at Tesla's Gigafactory in Berlin.\nMathias Döpfner speaks with Elon Musk at Tesla's factory in Fremont, CA.\nJason Henry\nMathias Döpfner, the CEO of Insider's parent company, Axel Springer, recently met with Tesla CEO Elon Musk for an interview.\n\nThe interview took place at Tesla's factory in Fremont, California, and the men discussed Russia's invasion into Ukraine, space travel, and what makes human beings special.\n\nYou can read a transcript of the conversation below.\n\n\nMathias Döpfner: Before we talk about the future, let's look at the present. There is war in Europe. If you see the horrible images of Putin's troops invading Ukraine, killing people. What are your thoughts?\n\nElon Musk: It is surprising to see that in this day and age. I thought we had sort of moved beyond such things for the most part. It is concerning. If you can get away with it, then this will be a message to other countries that perhaps they could get away with it too.\n\nDöpfner: Have you been surprised by Putin's behavior? I mean, I remember the discussions in the recent weeks when most of the Europeans thought he is not going to do it. A lot of Americans were convinced he is going to invade. What was your expectation?\n\nMusk: My best guess was that he would seek to capture the Eastern third of the country. Frankly, if you just listened to the rhetoric, then it is clear that he was going after at least portions of Ukraine that have a significant percentage of Russian speakers. He did that already in Georgia.\n\nDöpfner: In a way, if you listen carefully to dictators, they very often say what they want to do. You just had to take it seriously.\n\nMusk: Yeah. They are not subtle.\n\nDöpfner: But so far, there is a possibility that Putin achieves pretty much the opposite of what he wants to achieve. He wants to disentangle America from Europe. He wants to weaken NATO. So far, he has strengthened NATO. He has united the west. It is almost a bipartisan topic that unites democracies and open societies. With regard to the long-term outcome, are you rather pessimistic that it is going to strengthen Putin and thus, paving the way for other examples like China or elsewhere? Or are you more optimistic that it could be a turning point for a different security policy of the West?\n\nMusk: I do think this will strike the West. I suppose of course that people realize, maybe we should not have all these internal squabbles when there are more serious threats.\n\nDöpfner: Volodymyr Zelenskyy put it very clearly. \"I need ammunition, not a ride\". Europe, particularly Germany, struggled a long time. How about the American government?\n\nMusk: I think the American government has done more than people may realize. But it is just not been very public. But it is important to do something serious. We cannot let Putin take over Ukraine. This is crazy.\n\nDöpfner: Parts of the world, particularly Europe, have learned the wrong lesson from the Third Reich and the Holocaust. And that lesson is: no military intervention ever again. Trying not to get involved. Now, there is the opportunity that we learned the real lesson, and that is never ever racism, never ever genocides and never ever appeasement.\n\nMusk: Appeasement obviously did not work against Hitler. And how much better would the world had been if they had stopped him early. Better for everyone.\n\nDöpfner: You did something very concrete, 48 hours, upon the request of the digital minister of Ukraine. And that was delivering Starlink material in order to grant internet access. What was the motivation, and how is it developing?\n\nMusk: We did think that Starlink might be needed, and we took some preemptive actions to ensure that it could be provided quickly. When the request came, we acted very rapidly. It is worth noting that the satellite internet connectivity of Ukraine was taken offline by a cyberattack on the day of the invasion permanently. The cell towers are either being blown up or they are being jammed. There is a major fiber backbone which the Russians are aware of. It was quite likely that they will sever that fiber link. This would leave Ukraine with very few connections open. So Starlink might be, certainly in some parts of Ukraine, the only connection.\n\nDöpfner: What happens if the Russians and Chinese are targeting satellites? Is that also a threat for Starlink?\n\nMusk: It was interesting to view the Russian anti-satellite demonstration a few months ago in the context of this conflict. Because that caused a lot of strife for satellite operators. It even had some danger for the space station, where there are Russian cosmonauts. So why did they do that? It was a message in advance of the Ukraine invasion. If you attempt to take out Starlink, this is not easy because there are 2000 satellites. That means a lot of anti-satellite missiles. I hope we do not have to put this to a test, but I think we can launch satellites faster than they can launch anti-satellites missiles.\n\nDöpfner: Russia said that they are going to stop the delivery of rocket engines. Is that a threat or an opportunity for SpaceX?\n\nMusk: At SpaceX, we design and manufacture our own rocket engines. So we did not really own any Russian components at all.\n\nDöpfner: Is it dangerous for the United States of America?\n\nMusk: Boeing and Lockheed have strongly relied on the Russian RD-180 Engine. Which I should say, to be fair, is a great engine. They are hoping to move away from that in the future with engines from Blue Origin. There is also the Antares which uses the RD-180, I believe. They will not be able to fly as a result.\n\nDöpfner: With knowledge, products and services, Elon Musk is almost a strategic weapon in modern warfare. How do you see your role in that context?\n\nMusk: I think I can be helpful in conflicts. I try to take a set of actions that are most likely to improve the probability that the future will be good. And obviously sometimes I make mistakes in this regard. I do whatever I think is most likely to ensure that the future is good for humanity. Those are the actions that I will take.\n\nDöpfner: A couple of months ago we had an exchange about Ernst Jüngers famous book \"Storm of Steel\". You were very fascinated by that book, which has been published roughly a hundred years ago, about Jüngers experiences in the First World War. Why is that book so important for you?\n\nMusk: I read a lot of books, and for some reason I am fascinated by war and history in general. It is not just history of war, but just history in general. Jüngers book is an excellent personal account of World War One. The lesson taken from that book is we don't ever want to do that again.\n\nDöpfner: There is a big controversy around that book. Some people are saying this is glorifying war...\n\nMusk: It is definitely not!\n\nDöpfner: …It is rather positive nor negative. It is just describing what happened in a terrible way.\n\nMusk: Nobody is reading that book and says, I want to do that too. For me, it is just fascinating to read about history. I mean, learn the lessons of history, such that we do not repeat the mistakes of the past.\n\nDöpfner: History doesn't repeat itself, but it rhymes. And we see a rhyme these days. Back to the big strategic picture. The terrible actions of Putin are, to a certain degree, also a result of strategic mistakes that Europe, particularly Germany, has made, the dropout of nuclear energy in 2011.\n\nMusk: It is very important that Germany will not shut down its nuclear power stations. I think this is extremely crazy.\n\nDöpfner: If we really want to reduce Putin's power as well as Europe's and Germany's dependence on Russian energy, we have to decarbonize. It's the only way. Is more nuclear energy the key to free ourselves from dictators and autocrats like Putin.\n\nMusk: I want to be super clear. You should not only not shut down the nuclear power plants, but you should also reopen the ones that have already shut down. Those are the fastest to produce energy. It is crazy to shut down nuclear power plants now, especially if you are in a place where there are no natural disasters. If you are somewhere where severe earthquakes or tsunamis occur, it is more of a question mark. If there is no massive natural disaster risk-which Germany does not have-then there is really no danger with the nuclear power plants.\n\nDöpfner: Aren't there any safer alternatives that could have a similar effect? Solar and wind won't do it. Do you have any other ideas in mind about future energy policy?\n\nMusk: I think long term, most of civilization's energy is going to come from solar, and then you need to store it with battery because obviously the sun only shines during the day, and sometimes it is very cloudy. So you need solar batteries. That will be the main long-term way that civilization is powered. But between now and then, we need to maintain nuclear. I can't emphasize that enough. This is total madness to shut them down. I want to be clear, total madness.\n\nDöpfner: Let's see whether this very clear words are heard in Germany.\n\nMusk: I would say this is a national security risk.\n\nDöpfner: How is the climate issue going to look like in 15 years? Better than today?\n\nMusk: From a sustainable energy standpoint, much better.\n\nDöpfner: So we are going to solve this problem?\n\nMusk: Yes, absolutely. We will solve the climate issue. It is just a question of when. And that is like the fundamental goal of Tesla.\n\nDöpfner: You once said that the decrease of birth rate is one of the most underestimated problems of all the times. Why?\n\nMusk: Most people in the world are operating under the false impression that we've got too many people. This is not true. The birth rate has been dropping like crazy. Unfortunately, we have these ridiculous population estimates from the UN that need to be updated because they just don't make any sense. Just look at the growth rate last year. See how many kids were born and multiply that by the life expectancy. I would say that is how many people will be alive in the future. And then say, is the trend for birth rate positive or negative? It is negative. That is the best case, unless something changes for the birth rate.\n\nDöpfner: That is also why we need alternatives. You have recently presented Optimus, a human robot, and shared great expectations, what that could do for the world. I assume it is not only about the first visit to Mars that could be done by Optimus, but it might also be a game changer in AI. Could you share this vision?\n\nMusk: With respect to AI and robotics, of course, I see things with some trepidation. Because I certainly don't want to have anything that could potentially be harmful to humanity. But humanoid robots are happening. Look at Boston Dynamics. They do better demonstrations every year. The rate of advancement of AI is very rapid.\n\nDöpfner: Concretely, Optimus is going to be used in Tesla factories. That is one of the use cases, but what is the broader use case beyond Tesla?\n\nMusk: Optimus is a general purpose, sort of worker-droid. The initial role must be in work that is repetitive, boring, or dangerous. Basically, work that people don't want to do.\n\nDöpfner: Why has Optimus two legs? Just because it looks like a human being, or is it more practical? I thought four legs were better.\n\nMusk: Haha, four legs good, two legs bad. Kind of reminds me of Orwell. Humanity has designed the world to interact with a bipedal humanoid with two arms and ten fingers. So if you want to have a robot fit in and be able to do things that humans can do, it must be approximately the same size and shape and capability.\n\nDöpfner: Do you think that Optimus is going to play a role in our daily life, helping us in the household and things like that?\n\nMusk: Yes. A general focused humanoid.\n\nDöpfner: The prototype is going to be ready by the end of this year. When is it a product that can be mass marketed?\n\nMusk: I think we will have something pretty good at the prototype level this year, and it might be ready for at least a moderate volume production towards the end of next year.\n\nDöpfner: You said the potential is bigger than the potential of Tesla. If that is true, then it must be really a mass market product. But anyway, Optimus is also an answer to the problem of dropping birth rates. If we have not enough human people, we need more bots to get work done.\n\nMusk: Optimus will be helpful with respect to dropping growth rates. But if these things continue, then what happens? Humanity dies out. Is that what we want?\n\nDöpfner: Or replaced by artificial intelligence. Human beings powered by Neuralink.\n\nMusk: Neuralink in the short term is just about solving brain injuries, spinal injuries and that kind of thing. So for many years Neuralink's products will just be helpful to someone who has lost the use of their arms or legs or has just a traumatic brain injury of some kind. That is what Neuralink will be useful for many years.\n\nDöpfner: Could you imagine that one day we would be able to download our human brain capacity into an Optimus?\n\nMusk: I think it is possible.\n\nDöpfner: Which would be a different way of eternal life, because we would download our personalities into a bot.\n\nMusk: Yes, we could download the things that we believe make ourselves so unique. Now, of course, if you're not in that body anymore, that is definitely going to be a difference, but as far as preserving our memories, our personality, I think we could do that.\n\nDöpfner: The Singularity moment that the inventor and futurist Ray Kurzweil has, I think, predicted for 2025 is approaching fast. Is this timeline still realistic?\n\nMusk: I'm not sure if there is a very sharp boundary. I think it is much smoother. There is already so much compute that we outsource. Our memories are stored in our phones and computers with pictures and video. Computers and phones amplify our ability to communicate, enabling us to do things that would have been considered magical. Now you can have two people have a video call basically for free on opposite sides of the world. It's amazing. We've already amplified our human brains massively with computers. It could be an interesting ratio to roughly calculate the amount of compute that is digital, divided by the amount of compute that is biological. And how does that ratio change over time. With so much digital compute happening so fast, that ratio should be increasing rapidly.\n\nDöpfner: Talking about speed, you have the vision that one day, Starship could be able to get from A to B in 30 minutes all around the globe. Is that correct? It's like a global super taxi. You can just go from San Francisco to Nairobi?\n\nMusk: The landing will be loud. So you would probably be connecting cities that are next to oceans or seas. So you can land far enough offshore that the landing noise is not disturbing to people\n\nDöpfner: Coast to coast would be a realistic option?\n\nMusk: Yes, it is like an intercontinental rocket.\n\nDöpfner: You have solved so many problems of mankind and presented so many solutions. I'm surprised that one topic does not seem to fascinate you as much: Longevity. A significantly increased life span. Why aren't you passionate about that? Aren't you personally interested in living longer?\n\nMusk: I don't think we should try to have people live for a really long time. That it would cause asphyxiation of society because the truth is, most people don't change their mind. They just die. So if they don't die, we will be stuck with old ideas and society wouldn't advance. I think we already have quite a serious issue with gerontocracy, where the leaders of so many countries are extremely old. In the US, it's a very, very ancient leadership. And it is just impossible to stay in touch with the people if you are many generations older than them. The founders of the USA put minimum ages for a local office. But they did not put maximum ages because they did not expect that people will be living so long. They should have. Because for a democracy to function, the leaders must be reasonably in touch with the bulk of the population. And if you're too young or too old, you can't say that you will be attached.\n\nDöpfner: Is there a kind of ideal, maximum age? How old would you like to get?\n\nMusk: I think for political leadership, you want to be ideally within 10 or at least, 20 years of the average age of the population. And for me, I certainly would like to maintain health for a longer period of time. But I am not afraid of dying. I think it would come as a relief.\n\nDöpfner: You may not be able to see the vision of SpaceX come true in your life?\n\nMusk: I would like to live long enough to see that.\n\nDöpfner: How do you feel, being - at a net worth of USD 260 billion roughly - perceived as the richest person on earth?\n\nMusk: I do think that Putin is significantly richer than me.\n\nDöpfner: You really do?\n\nMusk: Yeah.\n\nDöpfner: Do you know John Law?\n\nMusk: No.\n\nDöpfner: John Law used to be the richest person on earth 300 years ago. He was a Scottish guy and lived in the end 17th century and the early 18th century. He was a gambler, 'un homme à femmes', then a very successful investor, and financial engineer. He was the biggest art collector on earth. He created a stock market bubble in France through a rush behind the shares of the Mississippi company. And was ultimately the reason for one of the first financial crises. John Law used to own roughly 30% of the United States of America then. In the end, he went bankrupt. Did you ever think about what would happen if something were to go wrong and you were to lose everything?\n\nMusk: There have been many times when I expected to lose everything. Who starts a car company and a rocket company expecting them to succeed? Certainly not me. I had less than 10 percent chance of success. After the third failure of SpaceX in 2008, I knew that if the fourth launch failed, SpaceX would be dead. We had no money for the fifth launch. Tesla's been on the verge of bankruptcy many times. We even closed on the last day of the financing round in 2008. Remember, back then General Motors and Chrysler had gone bankrupt and Ford was on the brink of it. So, imagine trying to raise money for an electric car startup while General Motors was going bankrupt. People were very angry that I even asked. But we were able to raise just enough money to squeak by. And closed the financial round for Tesla on the last hour of the last possible day in 2008. Christmas Eve. Had we not closed the round then, we would have gone bankrupt two days after Christmas.\n\nDöpfner: Elon Musk is not only an entrepreneur, he is also a philanthropist. What are the goals of your foundation?\n\nMusk: I do want to emphasize that SpaceX and Tesla fundamentally intend to improve the quality of the future. Especially in terms of usefulness to humanity. Tesla by accelerating sustainable energy. And SpaceX by making multiplanetary intercourse possible. This is more than I can do myself. When it comes to donations, I'd say it is very difficult to give away money effectively. If you care about the reality of doing good and not the perception of doing good, then it is very hard to give away money effectively. I care about reality. Perception be damned. So, there's obviously environmental causes, there is education, especially science and engineering education. Pediatric healthcare. Hunger these days is more of a political and logistics problem than it is not having enough food. There is a lot of food. In the US and many countries, the issue is more obesity than it is hunger. So, I'm always looking for ways to give away money that are effective.\n\nDöpfner: If you google Elon Musk, I think you would have more than 200 million search results and nearly 80 million Twitter followers. You are definitely one of the most popular people on earth. Is popularity a pleasure or a liability for you?\n\nMusk: It makes it difficult to go buy coffee at the corner. It is hard to go around places, or at least be able to just go to the store or walk down the street. Now it is quite difficult to do that.\n\nDöpfner: It reminds me a bit of a former chancellor of Germany, Helmut Kohl, who once told me, you cannot imagine how terrible it is to go into a restaurant and everybody recognizes you, comes to your table, asks you for an autograph. That is terrible. There is only one thing in life that is worse. And that is: if nobody comes to your table anymore.\n\nMusk: Hahaha. I just try to find a corner table that is in a dimly light or something, where I can stay out of the way.\n\nDöpfner: Is there anything that you most urgently want to achieve?\n\nMusk: In the short run, and the most pressing is completing full self-driving, so that we have full self-driving operating at a substantially safer level than humans. Basically, it comes down to solving the problem of real world AI. That consumes a lot of my mind. And getting the starship to work. Not only getting it to orbit but achieving rapid reusability - which is really the holy grail of rocketry that is necessary for humanity to become a multiplanet species. And I think those things might happen this year.\n\nDöpfner: Anything that you really would like to achieve, which you think is going to be impossible?\n\nMusk: Impossible is a strong word.\n\nDöpfner: You don't like that word.\n\nMusk: It's a strong word. I approach things from a physics standpoint and the word impossible is more or less banned in physics. I'm really worried about this birthrate thing. That's been troubling me for many years, because I just don't see it turning around. Every year it's worse. And I drive my friends crazy with this.\n\nDöpfner: Walter Isaacson is planning your biography. He has written about the lives of Albert Einstein, Steve Jobs, Benjamin Franklin, and Leonardo DaVinci. Among the four, with whom would you like to meet and have a glass of wine?\n\nMusk: I would be honored to meet any of them. I think Benjamin Franklin would be the most fun at dinner.\n\nDöpfner: And who is the one you think you are closest to? Would it be Leonardo DaVinci?\n\nMusk: I am pretty different. But it might actually be Benjamin Franklin. He did a lot of science and engineering. DaVinci wrote a book, seeing himself first and foremost as an engineer. Actually, in his application for the position that eventually enabled him to create all of the art, it was all about his engineering ideas. Just in the end, he mentioned doing some art. I think it's funny that DaVinci really thought of himself as an engineer. But he was pretty impressive for his time.\n\nDöpfner: You said that you cannot be alone. I very much share that feeling. Where does it come from?\n\nMusk: I think it's just a natural human reaction.\n\nDöpfner: A lot of people are happy if they are alone.\n\nMusk: Really? I think most people are not happy being alone.\n\nDöpfner: Do you feel lonely?\n\nMusk: I mean, there are times when I feel lonely, yes.\n\nDöpfner: Because you cannot find people with whom you like to share your feelings and thoughts? You are one of the most popular and looked after persons on earth. Everybody wants to speak with you. But it seems not to work.\n\nMusk: There are times when I'm lonely. I'm sure there are times when everyone is lonely. But it's pretty basic. Say if I'm working on the starship rocket and I'm just staying in my little house by myself, especially if my dog is not with me, then I feel quite lonely because I'm just in a little house by myself with no dog.\n\nDöpfner: What is your biggest fear?\n\nMusk: What are the existential threats that humanity faces? I spent a lot of time talking about the birthrate thing. That might be the single biggest threat to the future of human civilization. And then there's the concern of artificial intelligence going wrong. I think religious extremism is another concern.\n\nDöpfner: What is your biggest hope?\n\nMusk: My biggest hope is that humanity creates a self-sustaining city on Mars.\n\nDöpfner: You have once said, if I'm not in love, I cannot be happy. Are you happy at the moment?\n\nMusk: I think there are degrees of love. But certainly, for one to be fully happy, I think you have to be happy at work and happy in love. So, I suppose I'm medium happy.\n\nDöpfner: Can love for projects, for work, compensate for love among people?\n\nMusk: I tried to be as literal as possible. I would be happy if humanity has a self-sustaining city on Mars because then, probable lifespan of humanity is much greater. I think we really just got this little candle of consciousness, like a small light in the void. And we do not want this small candle in the darkness to be put out.\n\nDisclosure: Axel Springer is Business Insider's parent company", "id": "tp1k7p", "created_utc": 1648323936.0, "score": 49, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": ">Musk: There are times when I'm lonely. I'm sure there are times when everyone is lonely. But it's pretty basic. Say if I'm working on the starship rocket and I'm just staying in my little house by myself, especially if my dog is not with me, then I feel quite lonely because I'm just in a little house by myself with no dog.\n\n\nLonely Elon with no dog makes me sad", "score": 26, "replies": [{"body": "Doge gonna crash", "score": 7, "replies": []}, {"body": "https://www.ndtv.com/offbeat/elon-musk-shares-another-cryptic-tweet-about-his-shiba-inu-dog-fuels-cryptocurrency-confusion-2563011 floki", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "![gif](giphy|UVf3cUlZHr12hveaQp)", "score": 3, "replies": []}]}, {"body": "Amazing interview. Great stuff.", "score": 7, "replies": []}, {"body": "Is there a video link?", "score": 7, "replies": [{"body": "https://www.businessinsider.com/elon-musk-interview-axel-springer-tesla-war-in-ukraine-2022-3?utm_source=reddit.com", "score": 3, "replies": []}, {"body": "It is just an article I think", "score": 1, "replies": []}]}, {"body": "Thanks for providing this!", "score": 3, "replies": []}, {"body": "Thank you for sharing this, great interview.", "score": 2, "replies": []}, {"body": "\\> I hope we do not have to put this to a test, but I think we can launch satellites faster than they can launch anti-satellites missiles.  \n\n\nwow, what an absolute flex...and he's right", "score": 1, "replies": []}]}
{"title": "SPY Weekly TA 3/25/22", "selftext": "[removed]", "id": "to9nt7", "created_utc": 1648254952.0, "score": 18, "upvote_ratio": 0.75, "num_comments": 11, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|126|**First Seen In WSB**|1 year ago\n**Total Comments**|1195|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/spxvil/spy_210_the_bear_rages_on/) [x](https://www.reddit.com/r/wallstreetbets/comments/rj1up5/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/lyng6s/buy_the_rumor_sell_the_news_hear_me_out_here/) [x](https://www.reddit.com/r/wallstreetbets/comments/rgqp0q/spy_dec_14th_recap_and_dec_15th_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/riyt4w/december_17th_spy_recap_and_next_week_anticipation/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=to9nt7)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=to9nt7)", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|8883)", "score": 3, "replies": []}, {"body": "Cant believe you are actually luring people to pay for your crayon drawing. Don’t fall for it guys, at the end, you’ll eventually lose money and OP will be out on top collecting your money even if you lose money", "score": 1, "replies": []}, {"body": "Nioce", "score": 1, "replies": []}, {"body": "Solid  \nDo I need to DM for the Friday Weeklies or you're saying they'll still be posted here, just not the dailies? 🤔", "score": 0, "replies": [{"body": "[removed]", "score": -5, "replies": [{"body": "Mod ban self promoter", "score": 4, "replies": [{"body": "Fr mods need to ban this fool, no one wants to pay for his discord", "score": 1, "replies": []}]}, {"body": "How much?", "score": 0, "replies": []}]}]}]}
{"title": "Dead Bear Market", "selftext": "", "id": "tos6qt", "created_utc": 1648306497.0, "score": 171, "upvote_ratio": 0.87, "num_comments": 19, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|48|**First Seen In WSB**|1 year ago\n**Total Comments**|219|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=tos6qt)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=tos6qt)", "score": 1, "replies": []}, {"body": "Is that a 🌈 🐻?", "score": 11, "replies": [{"body": "Yes and I’m pretty sure when we get the autopsy results back he will have died from market crash shilling.", "score": 4, "replies": []}]}, {"body": "Cramer said bear markets over. Looks like this cute little guy is going to make it afterall.", "score": 7, "replies": []}, {"body": "Reported. Using my picture without consent.", "score": 5, "replies": []}, {"body": "Dead bear bounce?", "score": 5, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Businesses dont need mortgages. Businesses are buying all the property and turning them into rentals.", "score": 1, "replies": []}]}, {"body": "Damn bulls r savages! Bers r so beyond fuk!", "score": 5, "replies": []}, {"body": "Shake the bear!", "score": 3, "replies": []}, {"body": "This makes me feel much better about those 439 3/31 SPY PUTS", "score": 3, "replies": [{"body": "Mine are dated for July.  I'm not sure if that makes it better or worse.", "score": 1, "replies": [{"body": "Safer tbh", "score": 0, "replies": [{"body": "They're less likely to go to 0 for sure, but my strike was about the same so I have more riding on it per contract.", "score": 2, "replies": [{"body": "Yeah, I’m not planning to hit strike. Going to dump these for premium before Weds or take the L and hedge with calls Monday if I’m getting blown out at 9:45am", "score": 1, "replies": []}]}]}]}]}, {"body": "this is hilarious", "score": 1, "replies": []}, {"body": "🤣", "score": 1, "replies": []}, {"body": "Savage!", "score": 1, "replies": []}, {"body": "Target funders \"riding it out\" ![img](emote|t5_2th52|4641)![img](emote|t5_2th52|4641)![img](emote|t5_2th52|4641)", "score": 1, "replies": []}]}
