{"title": "NFLX went from $420 to $295", "selftext": "NFLX is has gone from $420 to $295. Increased competition from Disney's new streaming service Disney+. However, I don't believe Netflix is going away anytime soon. Is this a good buying opportunity? ", "id": "9x0lfg", "created_utc": 1542206002.0, "score": 408, "upvote_ratio": 0.95, "num_comments": 250, "comments": [{"body": "Netflix has a lot of headwinds upcoming, and increased competition is one of them. Disney is pulling all their content from Netflix next year and there is a rumor that they will also buy out the rest of Hulu. Let's also not forget that Netflix is also trading at over 100x earnings, has a negative cash flow, and is spending billions and billions on content that will only increase as content providers begin rolling out their own streaming services. \n\n\n\nNetflix does have first mover advantage, but it is not a stock I would want to hold long term right now. They were once the only game in town, and that is not and will not be the case anymore. ", "score": 406, "replies": [{"body": "Disney & Hulu is not a rumor, if the Disney fox deal goes through, Disney will receive fox’s 30% share of Hulu on top of their own 30% share. Disney will becomes the 60% owner of Hulu, its only a matter of when.", "score": 67, "replies": [{"body": "Is Disney a buy then judging by your analysis.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "There is no Hulu stock, its owned by Disney (30%), Fox (30%), comcast (30%), and at&t (10%).", "score": 41, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "In theory if they both were listed stocks then your assumption would be correct the company being acquired would increase and the acquirer would drop. ", "score": 2, "replies": [{"body": "I see that happen several times. Why is that? Because the acquirer has to be a sucker and pay premium?\n\nThen how comes when AMZN acquired Whole foods, their market value jumped up? I remember the stock went from $960 to $990", "score": 3, "replies": [{"body": "People thought it was a good decision and the purchase occurred at the correct price.", "score": 2, "replies": [{"body": "Gotcha, thanks.", "score": 2, "replies": []}]}, {"body": "The acquirer would be increasing costs short term because of integrating the company it has bought so investors expect short term the acquirer will spend more to ensure the m&a is successful. When the drop is severe then in some cases yes, investors may not believe the premium is worth it. \n\nAMZN is different because investors understand what their strategy is and they felt at the time Whole Foods would add value to AMZN long term goals.\n\n&#x200B;", "score": 1, "replies": [{"body": "Thanks a lot. That certainly explains it for me.", "score": 1, "replies": []}]}]}]}, {"body": "Idiot", "score": -17, "replies": [{"body": "calm d f down bud, go watch a disney movie for positivity! haha", "score": 4, "replies": []}]}]}]}, {"body": "lol. good one, disney or disney? I pick disney!", "score": 1, "replies": []}]}]}, {"body": "Amazon's prime video service keeps improving too", "score": 109, "replies": [{"body": "Funny, because the app sure doesn't. ", "score": 288, "replies": [{"body": "The Prime Video interface on Xbox One is like mid-2000s level terrible. I've commented on this multiple times on Reddit every time this discussion comes up because while I like their selection and the ability to rent movies I absolutely despise the interface and believe it loses them potential subscribers.", "score": 89, "replies": [{"body": "I don't use it because of this", "score": 45, "replies": []}, {"body": "Yes, that's the main reason I only pop it open after I've exhausted Netflix and HBO. The interface makes me want to jump out a window.", "score": 19, "replies": []}, {"body": "Amazon's consumer-facing software sucks balls.  It's app is terrible too, I'm surprised they don't put as much effort into it as their competitors do.", "score": 7, "replies": []}, {"body": ">The Prime Video interface on Xbox One is like mid-2000s level terrible.\n\nTotally agree. I loathe using it on my PS4", "score": 3, "replies": [{"body": "Whaaaat?? I love Amazon Prime Video interface on my PS4..  But then again, I'm used to my Sony Smart TV apps and the Prime Video and Netflix apps on the TV are terrible, so the bar is set low.", "score": 6, "replies": []}]}, {"body": "I almost never check it. It's almost impossible to browse, unless I have a very specific movie in mind I don't use it. ", "score": 3, "replies": []}, {"body": "I am not particularly fond of the Prime Video UI but as far as Android TV apps go, I would say it is better than Hulu. Streaming quality also tends to be better than Hulu as well. ", "score": 4, "replies": []}, {"body": "Same goes for PS4 too. Sometimes I look at the competition of Netflix and think how much I am spoilt by Netflix's interface and smoothness. Right now in terms of usability and ease none of its competitors are even close\nNot to say that they can't beat them but I will it will be a while.\nNetflix's content on the other hand is a different story they seem to be investing a lot on various content and it has been a mixed bag there!\n", "score": 2, "replies": []}, {"body": "Yeah I run it on my Nvidia Shield and it's... bad.\n\nThe search menu actually kinda doesn't work. It's like I can't confirm my searches via the virtual keyboard that pops up. \n\nThe quality of the streams is very good however, and it supports HDR10+ which looks very nice on compatible TVs/Devices.", "score": 1, "replies": []}, {"body": "This is also the reason I don't use Hulu.", "score": 1, "replies": [{"body": "I absolutely hate the Hulu app on Roku.  It's so unintuitive.", "score": 1, "replies": []}]}, {"body": "Blows my mind seeing this, as i don't have a single issue with it.", "score": 1, "replies": []}]}, {"body": "That's something Netflix has.  On all devices over the years Netflix has been much more stable than other streaming apps.", "score": 7, "replies": []}, {"body": "User interface is so bad!  ", "score": 3, "replies": []}, {"body": "The app it trash.  They don't care.", "score": 2, "replies": []}, {"body": "Really? I’ve had no problem with the prime video app on my phone. It’s actually been great, and I used it before I realized Netflix has offline streaming. ", "score": 2, "replies": []}, {"body": "Talk about the Hulu app as well! I just detest it for some reason, I guess it’s just not as user friendly as Netflix is! Not to mention their content sucks for the most part as wel", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "For me there’s too many good Netflix originals to cancel it. I’m invested in a lot of their shows. The other streaming services don’t compare for me. ", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": []}]}]}, {"body": "The shows are definitely worst than netflix, but i guess it can only get better as long as Amazon is willing to invest in it to drive people to subscribe to prime. ", "score": 5, "replies": [{"body": "One opinion.  Two Amazon isn't as invested in streaming content as its not its core business.  \n\n", "score": 1, "replies": []}]}, {"body": "Fuck, I have amazon prime and a PS4, and I never even think about using it.  What's getting better about it?\n\nI just remember thinking it was a poor-man's version of netflix.  Same essential service, less top-shelf movie selection.  But also a lot of strange/obscure shit.", "score": 3, "replies": []}, {"body": "Yeah the interface sucks because it's centered around getting you to rent and buy movies that you aren't getting through your PREMIUM subscription to prime, but it does have a good selection.", "score": 2, "replies": []}]}, {"body": "I'm confident NFLX will remain dominant streaming service in 5 yrs despite DIS , Hulu, AMZN.\n\nHowever their valuation is high and I remain cautious of momentum names as the stock market has turned . (I bought NFLX in 2016 @ ~126$ and sold in Aug 2018 @ 320$ so I love growth stories but also aware of the market) ", "score": 14, "replies": [{"body": "I doubt it honestly. You're missing SlingTV, YoutubeTV, all of the specific channel apps, etc. Netflix sells movies/TV shows which isn't a unique product that nobody else can sell. I would imagine that their 'market share' will continue to decrease overtime.  \n  \nI've had Netflix for a couple years now and I'm too the point where I've seen almost all the types of movies/shows I'm interested in. They don't really upload new shows/movies that quick and they seem to only have good movies available for a couple months. If they actually had all of their movies availble including the ones that are used for rentals I think Netflix would be the best app.", "score": 2, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "ehh I guess your right but they do have movies/TV shows but the main difference is the LiveTV and sports. YoutubeTV has some good mainstream movies though that usually aren't available on the other apps. I expect that TYV will continue to add to their movie/show collection though.", "score": 0, "replies": []}]}]}, {"body": "I think it will too, but just on name recognition.\n\nI feel like Hulu is superior to netflix in content right now aside from their originals", "score": 1, "replies": []}, {"body": "They remain dominate I wager in the middle age demographic and at that with those single and casually dating.  Netflix doesn't have the family appeal or content like Disney does.  ", "score": 1, "replies": []}]}, {"body": "This assumes people will only use one streaming service. Having Netflix + Disney + Hulu is still much cheaper than cable and without commercials. ", "score": 20, "replies": [{"body": "> Use only one service\n\nIt says that *some* ppl will sacrifice Netflix to use a different service.\n\nNot an all or nothing prospect...\n\nJust recognizing with more competition, Netflix may find it harder to hold on to / gain new subs as our entertainment budgets get pulled in multiple directions.\n", "score": 8, "replies": [{"body": "Drastic times call for drastic measures. ", "score": 1, "replies": []}, {"body": "Seems fairly chicken little, IMO, as Disney isn't even trying to take Netflix head on.", "score": 1, "replies": [{"body": "You said:\n\n> This assumes people will only use one streaming service.\n\nAnd, I was pointing out you misunderstood this aspect re: One or the other & nothing in between.\n\nThat's all, no other commentary here.", "score": 2, "replies": []}]}]}, {"body": "Exactly. I actually listened in on the Disney earnings call a week or two ago, as I am very interested in Disney+.\n\nIt sounds like Iger wants to build a service that wouldn't REPLACE existing streaming services (especially since Disney owns 60% of Hulu), but they want to build something that would supplement the current streaming services. Iger even said they would have a discounted price to reflect the initial limited content that would be on Disney+ when compared to the competition.\n\nStill not sure what Netflix is worth, as growth will definitely be slowing long-term. I think I'd buy around the $220 range.", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Netflix has a ton of family friendly content though? ", "score": 2, "replies": [{"body": "Not to the level of Disney though.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "No. ", "score": 2, "replies": []}]}]}]}, {"body": "As the growth slows the PE will get better, though, so that should help valuation. Expanding into new markets and growing content from scratch is expensive. Soon their original content library will be large enough they won't have to expand their OC library at the current expensive rate.", "score": 1, "replies": [{"body": ">Soon their original content library will be large enough they won't have to expand their OC library at the current expensive rate.\n\nI don't think they plan to slow the growth of their OC library. I don't think they should either. People love new shows.", "score": 2, "replies": [{"body": "I can't claim to follow all the new content carefully, but damn there's a lot of garbage in there.\n\nBut one example was the discontinuing of Sense8. I know the LGBT community was vocal about their support of it, but it was an expensive disaster of a show. I don't fault them for canceling it and think it was a wise move. ", "score": 2, "replies": [{"body": ">damn there's a lot of garbage in there\n\nAgreed.\n\nThe 80% of failure seems to be worth the 20% of wild success, though.", "score": 2, "replies": [{"body": "I have not been a fan of all the stand up acts. I feel like the cost:reward ratio can't be very good on those. And aren't they adding some reality TV and baking shows? Nobody needs more of that shite. ", "score": 0, "replies": [{"body": "It seems like they're collecting as much data as they possibly can, and the best way to collect data on what works and what doesn't is just by trying everything.\n\nI don't think Netflix is focused on quality rn, they're focused on quantity. And they're very good at data gathering and analytics. Once they figure out what viewers want most of, they'll probably begin to stress quality.", "score": 1, "replies": [{"body": "Yeah, I tried to tell someone else in this thread that at some point Netflix will be able to reign in the original content and they seemed to think that meant completely stop new content.\n\nBut I agree with your premise that they are gathering data right now. They don't release viewer data, but I'm sure they're keeping a close eye on it. That PE ratio will look much better when they trim the fat at some point.", "score": 1, "replies": []}]}]}]}]}, {"body": "Right but it's more expensive and much harder to captivate an audience with new IP over and over again. Alternatively, Disney can try and fail with new IP, and fall back comfortably on Pixar, Marvel and Lucas. Netflix doesn't have marquee brands like Disney.", "score": 1, "replies": [{"body": "What is IP?\n\nFrom my understanding after listening to the earnings call, Disney is producing new content in each of those subcategories: Pixar, Marvel, and Lucasfilm. For example, they are releasing a new Star Wars TV show directed by Jon Favreau called \"The Mandalorian\". They are releasing all of this new conent exclusively on Disney+.\n\nSo I believe they are really pushing new content, and I'm not even sure the extent of the old content they will be including on Disney+.", "score": 2, "replies": [{"body": "Intellectual Property. While these are new shows, they're extensions of already proven, profitable IP in the Star Wars/Marvel brands and thus, are far less likely to fail. Netflix doesn't have much content that they can extend to create a brand like Marvel, so the pressure is on to keep producing great, brand-new content, which is really hard and expensive.", "score": 1, "replies": [{"body": "Yes I agree. IMO, Netflix should be branching out and instead of calling each of its shows \"Netflix Original\", it should have sub-brands. Netflix Original is way too vague, it could mean House of Cards production level or it could mean complete garbage.\n\nIt would give Netflix a beginning to the same kind of advantage you're talking about. Obviously Disney has the edge because the history of Lucasfilm, Marvel, and Pixar goes way further. But there's no reason why Netflix couldn't begin doing the same.\n\nEDIT: Also one more thing, on the earnings call, Iger was really excited about the interface of Disney+. He said that the programmers did a great job making the UI immersive and giving a separate space for each Pixar, Marvel, and Lucasfilm, while still keeping it as a unified app. Netflix could learn from something like this. Even though Netflix touts its algorithim in helping users find shows that they'll like, I still feel like it's a jumbled mess.", "score": 5, "replies": [{"body": "Exactly. They need brands that can stand on their own, from which many different types of content can be spun off. Even better would be content that other companies (notably Consumer Packages Goods) want to licenae. House of Cards bed sheets and Orange is the New Black action figures don't quite work.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Um... \"not expanding at the current rate\" is not the same as \"not expanding at all.\"\n\nLook at HBO as an example. What is it, like $15 for HBO Go? How many good shows does HBO have? Netflix is cheaper than HBO and has much more content worth watching. It also brings a lot of shows from the BBC to the US which is nice.\n\nNetflix could easily cut back on their OC at some point and still maintain a high level of OC. The current level just seems crazy to me, but then again I'm all for quality over quantity. I only have so many hours in a day.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No, but there are a lot of markets left to get in on.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Seems pretty easy to just have 1 plan but switch plans and binge the shows for a month on a particular service.", "score": 2, "replies": [{"body": "What % of the population actually does that, though? (hint: it's negligible)", "score": 0, "replies": [{"body": "Seems a huge portion of the younger crowd are sharing netflix accounts. I wouldn't be surprise of that type of mentality carries over when there are no-contract services.", "score": 2, "replies": []}]}]}, {"body": "And with pretty primo content across the 3 platforms. Seinfeld alone is worth a Hulu subscription!", "score": 2, "replies": [{"body": "I didn't even realize that's where Seinfeld went. With so much new content I haven't even thought about rewatching old shows that I've seen 100%.", "score": 1, "replies": [{"body": "With so much crap content, I gravitate towards the classics - especially since I don't have to give them my full attention. Like putting on jazz radio in the background.", "score": 1, "replies": [{"body": "There's a lot of good content, though. Just gotta find it.\n\nRe: Jazz\nhttps://www.dailymotion.com/video/x30k6jc\n", "score": 2, "replies": []}]}]}]}]}, {"body": "Company and content are great, but the stock is ahead of itself, imo. Valuation coming down is normal. Growth may be present, just at above-the-market rates of return. As a dad, I have found no better UI, programming and lineup of shows. \n\nMy concept for TV has always been what NETFLIX is and can be, and that is content distribution studios won't do or commit to, with the exception of MAYBE HBO. I'm thinking Blizzard game spin-offs, book spin-offs (Dark Tower series), and really anything with a huge fan-following, needs a long runway of time to play out, using small to medium budget and really any actors not big-name. \n\nI look at the warchest of content a company like Activision/Blizzard has and if ATVI doesn't go it on their own, then a platform like Netflix would be awesome! Only HBO has come close and other big powerhouses are closing in, but the big networks cannot touch it and are dying off. \n\nMy son and I love the kids shows on NFLX, I can watch it anywhere, there's a ton of shows that are non-Disney, non-Nick, easily located, recommended quickly and a show like Dinotrux spun off into DinoTrux Supercharged. Before that, it was seasonal content, like Halloween and Christmas. Mind you, maybe some of that is big-name network like Disney that will be lost once it is official, however, this can be the future of Netflix, on top of the rights of other companies and more importantly...being Global, something really only DISNEY and maybe HBO have done (to my knowledge). \n\nAs it goes for adult programming, I'm always torn between live sports, HBO, Amazon Prime, etc. I don't find those platforms have a 'sexy' UI that makes it easy to login, get a show and even locate a new show for me. More often, I'm just played out on the whole thing. I do find Prime and HBO's football content great (Hard Knocks, All or Nothing, Ballers) to be enjoyable. For me, it's about core shows then spin-offs. There's too much to watch, so jumping from Streaming service to Streaming service simply for Seinfield, the Office or whatever, isn't worth it. HBO will cash in if they do Game of Throne spinoffs now, keep Westworld rolling, etc. AMC has a potential in American Gods, too. Prime having Thursday night football is awesome, because the graphics are great, they do a wonderful job on delivery and I can go up to my 2 monitor computer at night, work, and keep the game on if I want during the week. That's the benefit to streaming IMO, or put it on a notebook, etc. \n\nThe rest, imo, is filler. I don't get excited about that kind of stuff, so these providers really need some kind of flag pole or main stake franchise or a few to wrap around, then branch-off. As a 38 yo, I wish I had just plunked down some dough on NFLX way back when seeing what they become. Growth is always there when no on expects it because the market then OVER-REACTS to the story it missed and gives it the valuation it has long since deserved. ", "score": 2, "replies": [{"body": "NFLX has a valuation waaaay over what it deserves.  Growth stocks will overshoot a lot of the time.  Look how long MSFT was dead money.  NFLX won’t grow into its current valuation for a decade IMO.", "score": 5, "replies": []}]}, {"body": "Damn you and your “fundamentals”, they have a cool logo and the Internet!", "score": 1, "replies": []}, {"body": "yeah but how many content providers have successfully rolled out a streaming service? They're all flopping. ", "score": 1, "replies": [{"body": "There has not been a serious competitor aside from maybe Amazon. With the Disney service, that will be the *only* avenue consumers can view Disney content, and Disney owns a huge amount of content, specially with the pending Fox transaction. It may not cause NFLX to lose customers en mass, but it could slow growth, especially for young families who's children will want to watch Disney movies. ", "score": 1, "replies": []}]}, {"body": "Something to note is that they are now making deals with television providers, netflix is going to be included in a sky TV package soon for example.", "score": 1, "replies": []}, {"body": "You can't discount the political right canceling en mass either. Those numbers add up.", "score": 1, "replies": [{"body": "It doesn't look like they are losing customers en mass. The biggest risk is that they will need to spend lots of money on content to keep subscribers as they lose third party content. They must keep growing their subscriber base to keep up, but even then they will keep burning cash. ", "score": 2, "replies": []}]}, {"body": "This is great news for blockbuster's online streaming service.  Oh wait...nvm", "score": 1, "replies": [{"body": "Lol....oh you’re right. I forgot blockbuster also had the content portfolio that Disney has! Totally the same thing. Good comparison ", "score": 0, "replies": []}]}, {"body": "Look at outside US. Hulu is a non-factor.", "score": 1, "replies": [{"body": "As was NFLX until a few years ago. I still think people are underestimating the rise in competition. NFLX is moving from a tech company to more of a media company. At some point, it won't be priced as a fast growing tech company. ", "score": 1, "replies": []}]}, {"body": "Unless they change Hulu up a ton, I don’t see that as a positive.  I used to love Hulu and defend them.  But now with live tv, stations are not letting their current season go to on demand   And also the ad free option only works on certain network.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Tell that to FXX, all have ads, and offers their OWN add on purchase to remove ads.  Also current episodes of its always sunny are not available.  Need to have live TV and DVR them", "score": 1, "replies": []}]}]}, {"body": "Disney content leaving is going to do a damn thing to Netflix. ", "score": 0, "replies": [{"body": "Maybe not, but I think it's a bigger deal than you think it will be. ", "score": 1, "replies": []}]}, {"body": "Good. I HATE Netflix. \n\nI hope competitors eat their lunch.  ", "score": -6, "replies": [{"body": "There's definitely some garbage on Netflix but come on $12 a month for all that content? I probably used to spend 15x that a month on cable and dvd's back in the day. ", "score": 1, "replies": []}]}]}, {"body": "420$ for NFLX was a completely ridiculous valuation. No they aren't not going away but even the \\~290 it's worth now is pretty absurd. PE over 100 with nothing but trouble for them on the horizon, no thanks.", "score": 45, "replies": [{"body": "Seriously lol. Of course they’re not “going away” but at $420 their PE was like 220. ", "score": 4, "replies": []}, {"body": "They are expanding into new markets. That's very expensive. Once they get those markets in the bag, the PE will change drastically. ", "score": 5, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "That's what people keep saying and then they beat the market penetration expectations every time.\n\nThey seem to be doing pretty well so far: https://www.businessinsider.com/netflix-countries-most-popular-user-penetration-2018-7", "score": 5, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "I'm beginning to think you don't understand how expansion works. If they keep beating expectations, eventually they've taken over the market.", "score": 4, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "What service is newer than Netflix over there that has more subscriptions than Netflix? Netflix has only been there since 2016.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "So all those \"other services that are newer and have a larger base\" turned out to be one service that is older? Good job.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I'm not hiding behind anything, but it seems you're hiding behind a technicality since you didn't even realize Hotstar had been around in India longer. We both knew Netflix has been in business longer than Hotstar has been a thing, but we obviously weren't talking about that. \n\nIndia is just one location. Stumbling out of the gate doesn't spell certain doom.\n\nGood luck with your short position. /s\n", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> It’s netflixs big answer\n\nIs it, though? https://www.livemint.com/Companies/tTEEs67nVAlrjhaHIzMaoN/The-fight-between-Netflix-Hotstar-and-Amazon-Prime-Video-fo.html\n\n“In India, to be a mass product you also have to be in 20 languages and also do certain types of content,” Hastings said in an interview. “We’re targeting well-off people comfortable with English-language entertainment.”", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Different services. Amazon is $15/year over there. Amazon streaming is just part of the package and it isn't very good. Netflix is $5/mo and aimed at a more premium market than Hotstar which is largely used to watch cricket. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Indian people do have idea about netflix(and it's not b rated) as they had recently released few kickass originals for indian audience, one of them being 'sacred games' which is currently the most popular web series in india. They are doing great with the regional content (better than Amazon prime or hotstar) but the price comparison between netflix and other services is the problem but i am sure there user base in india will increase tremendously in india as younger generations are more likely to spend more on these services as compared to the present generation and india do have a lot of young people.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yes they are integrated with biggest media companies but the problem is that the people in India purchase hotstar as an alternative for Cable Tv to watch television shows and most of the the shows are pretty darn old(like 5-6 years and some even more) and trust me those shows are pathetic and are losing audience day by day, hotstar regional content is very vast but netflix is doing way better. Also people buy hotstar for streaming sports and no other streaming service has that option. Inshort, if a person has access to a cable TV he will not buy hotstar buy will buy Netflix because the quality of content it has.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Very nice said", "score": 1, "replies": []}]}, {"body": "I bought the dip after last month's big correction, now I'm down a bit on it, but I'm holding. Yes, Netflix has spent a ton of money on rights and production, but they have a sensible model. You notice how as the years go by a greater and greater percentage of the shows and movies popping up are produced by Netflix? They own these. They are switching from a model of having to pay in perpetuity for content to a model of owning a vast library of their own stuff. Eventually the library will be so huge that new subscribers will come on board and watch the content for years, even if Netflix never spends another cent on rights or production.", "score": 58, "replies": [{"body": "They needed to produce their own content.  They’d be just a streaming service if they didn’t, and that’s pretty much a commodity...", "score": 19, "replies": [{"body": "Agreed, and their original content is solid, second only to HBO...if not equally good!", "score": 5, "replies": [{"body": "Pretty good.  How much is HBO worth?", "score": 5, "replies": [{"body": "About tree fiddy", "score": 10, "replies": [{"body": "Lolz.  Datswhutimtalkinbout.", "score": 2, "replies": []}]}, {"body": "HBO is either reliant on cable providers or will have to compete as a streaming service with Netflix and Prime, or sell out to one of them. ", "score": 1, "replies": [{"body": "You don’t know that much about HBO, do you?", "score": 1, "replies": [{"body": "Not really. I just watch it through comcast or HBOGo", "score": 1, "replies": [{"body": "Good reply to my asshole comment.  I like you.  HBO is basically owned by AT&T.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "But Netflix's current value is based on subscriber growth. That is eventually going to level off. Also, there are still plenty of opportunities for competitors because the entry cost is so low. There are no longer contracts to buy into and you can purchase 3 - 5 different streaming service for the price of cable. They have in no way cornered the market that would make their continued subscriber growth possible. There might be short term opportunity when they enter foreign markets like they are doing in India but will face almost the same competition there that they do here. Plus, I am sure the native companies will draw advantages that Netflix won't have in their own countries. ", "score": 3, "replies": []}, {"body": "Two shows I liked and both got cancelled.  Actually 3 now that I think about it.  The only movie I like they did was that Will Smith gig with the magic wand", "score": 3, "replies": [{"body": "The movie bright? I found it amazing. Never understood why it drew so much criticism.", "score": 3, "replies": [{"body": "Yeah it was on the tip of my tongue.  I think that movie is awesome, I've probably watched it 3 or 4 times", "score": 1, "replies": [{"body": "I concur. Love the idea of the context. Then again the person replied to you shows how much people's opinions vary on this movie.", "score": 2, "replies": []}, {"body": "Are you all serious?! The only “bright” spot of this shit show was Smiths line “it’s the mother fucker with the wand!” Pure comedy ", "score": 1, "replies": [{"body": "Says the guys who watched the librarians", "score": 1, "replies": []}]}]}]}]}, {"body": "I actually avoid shows created by them most of the time lol  \n  \nNot sure why the downvote? Just my opinion. Sorry to make the investors butthurt lmao I'm not a TV show person anyway. Mainly use netflix for movies.", "score": 5, "replies": [{"body": "You shouldnt. 3/5s of them are great.", "score": 0, "replies": [{"body": "more like 5/7", "score": 1, "replies": []}, {"body": "I honestly don't know how people have time to even watch all of these TV shows anyway lol I've only watched 3 TV shows all the way through in my life. Breaking Bad, Shameless and Power.", "score": -1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Let me borrow that crystal ball of yours sometime.", "score": 2, "replies": []}]}]}, {"body": "With a PE of 100....anything could happen. I wouldn't call it a good value buy. ", "score": 21, "replies": [{"body": "PE is somewhat irrelevant...earnings highly compressed due to interest costs and depreciation/amortization.  Better measure is EV/EBITDA, which is a solid proxy for valuation when a company had big capital outlays and uses leverage to grow.", "score": 1, "replies": [{"body": "Can they sustain 100x earnings forever or will they eventually fall to 25x?", "score": 3, "replies": [{"body": "PE is an output, not a driver of anything...and yes they can.  You can even sustain negative earnings for a very long time, making your PE infinite.  Reason is because earnings are not cash flow.  Earnings (net income after D&A, interest and taxes) is used for PE measures and is an accounting artifact, used for calculating corporate tax.  This is something commonly managed down in order to lower the tax bill.  Manage earnings down, you lower taxes but raise your PE.  Look at EBITDA.  Better measure of solvency...that is what banks and many professional investors commonly use.\n\n\n\n", "score": 4, "replies": [{"body": "if your earnings are negative, so is your p/e. It is not infinite. And the answer is no. Netflix cannot sustain 100x earnings forever. They cannot grow at such a huge percentage every year. Eventually, they'll will slow down, and so will their PE. See apple or facebook. If NFLX drops down to 25x earnings, the stock will drop by that factor as well. ", "score": 2, "replies": [{"body": "Infinite, negative, same to me re: PE.  All I'm saying it is irrelevant for NFLX.  Ebitda is a better profitability measure for valuation measurement.", "score": 1, "replies": [{"body": "It doesn't matter what's a better valuation metric. If Netflix  is not going to have 100x earnings multiple, they will have less, if the have less, the stock will be cheaper, (unless earnings grow 4x, or the COGS drops 4x)", "score": 1, "replies": []}]}]}, {"body": "Free cash flows have been negative for years. Q3 cash flow from operations was -690 million. That's not sustainable at all. \n", "score": 2, "replies": [{"body": "I'm not saying they can sustain negative free cash flow.  I'm saying they can sustain a tiny or negative earnings level...net income.  That is what PE is measured off of.  ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I think if you want to judge Netflix long term, the question comes down to what they had told everyone else.  Could they become HBO before HBO becomes them.\n\nSince they said that, they absolutely have become HBO (look at all their originals), before HBO could become them.  Instead of HBO though, you have CBS and Disney.\n\nThis is all to say, the battle comes down to original content.  Can they create enough original content people demand better than other people can.  The scary part here is that the original content is a hard fight to win.  You need to build up tent pole series (Think GoT for HBO, Orange and House of Cards for Netflix, Star Trek for CBS, and all disney for Disney).  In this world, CBS and Disney have an advantage in IP.  HBO has historical ability to do it.  \n\nTLDR.  Netflix next has to compete one things which it doesn't have advantage (content) from the position of 1st.  My personal judgement says its scary and not worth the multiples today.  But if you believe they can create some great IP in the next 3-4 years, I would say they are a buy.", "score": 24, "replies": [{"body": "Now that AT&T is giving HBO a larger budget and might also package their other Time Warner stuff into a service HBO could become Netflix-like very quickly", "score": 8, "replies": [{"body": "Its hard to say.  Its not clear that HBO can be scaled up.  If you give HBO 4x the budget, it seems unlikely it can find 3 more GoT.\n\nHBO has shown that it can consistently have 1 to 2 must see highly talked about shows going on (off top of head, I think True detective season 1, sopranos, sex and the city, etc etc ) at any given time.  If you 4x the budget, do you think they can steadily have 4 to 8 of those types of shows at one time?  \n\nMy personal opinion is no they can't, so I wouldn't bet on HBO to grow that big.  On the flip side, I also don't think NFLX can have 4 to 8 at that level and so I would expect them to drop.\n\nOf course I didn't ride them up (At the time, I chose to go with AAPL instead) so what do I know.", "score": 1, "replies": [{"body": "Unless AT&T creates a streaming service which includes multiple channels where one is HBO, they already kinda do this, with DC Online, Boomerang and a few others.", "score": 1, "replies": [{"body": "Funny enough, I am long AT&T right now.\n\nBut other than HBO, none of the others you've listed have created pillar style programming.  ", "score": 1, "replies": [{"body": "what do you mean pillar style?", "score": 1, "replies": [{"body": "Programming which will make a person sign onto the service (or prevent people from leaving a service).  While all programming has that sort of effect, some programming has an outsized effect.\n\n&#x200B;", "score": 1, "replies": [{"body": "that's true, I can see them using HBO as the seller and using everything else to pad the service though.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Seems like they can create content though, you mentioned orange and house of cards. Stranger things, black mirror, 13 reasons why and even the new Haunting of hill house are all widely acclaimed and/or popular.  They can keep up, and they also serve a pretty different audience than Disney. Sure they will cannibalize some, but HBO is a closer comparison imo.\n\n&#x200B;", "score": 2, "replies": [{"body": "That is true.  Though their market cap is 125 or so today.  HBO is 30 or so (based on quick google search). \n\nIf I think of it that way.  Is netflix's content creation 4 times better than HBO's?\n\nI don't think any of those shows hit at the level of Game of Thrones or even Westworld.\n\nThough I'm not trying to convince anyone anything.  I think individuals can make a judgement on Netflix based on their content creation capabilities.", "score": 7, "replies": [{"body": "To me, that's all HBO has going for it (GoT and WW). Those shows account for maybe 10 hours of viewing each per season and they haven't even been able to produce them at a rate of one season per year. So from a volume watched standpoint I think Netflix is far and away 4 times better than HBO. As for weighing the quality of each person's two favorite Netflix shows vs. HBO, that's going to be difficult. Personally, I love GoT and WW and they definitely edge out my favorite two Netflix shows, but not by a lot. I really enjoyed Altered Carbon and would rate it close in production value to WestWorld, although the writing wasn't quite as good.", "score": 2, "replies": [{"body": "Interestingly, its not even about how much you like a show vs not like.\nThe questions is whether the show can make you sign up for subscription.\n\nAs an example, I cancelled HBO, but when GoT final season comes back on, I plan to resubscribe.  I currently have Netflix, but haven't contemplated removing it from my list because I feel like they don't have a show I can live without.", "score": 1, "replies": []}]}, {"body": "I agree wholeheartedly, Netflix should be valued on the same basis as HBO going forward, the writing is on the wall.  Netflix valuation should be cut down to less than half.", "score": -1, "replies": [{"body": "How many hours per year do you watch of HBO? How many hours of Netflix? Personally, I only watch WW and GoT on HBO which accounts for 20 hours or less per year. The amount of Netflix I watch dwarfs the amount of HBO I watch. As much as I like those two shows, if I had to choose one service over the other, it wouldn't be a tough call at all. But luckily for HBO, most cord cutters don't limit themselves to one streaming service.", "score": 2, "replies": [{"body": "If HBO had an online service in Canada I'd probably pay for it.  But good point, not sure how deep its library is.  ", "score": 1, "replies": [{"body": "The main question is not if you'd pay for HBO Go, but if you'd cancel Netflix in order to pay for HBO Go.", "score": 1, "replies": [{"body": "I think the real question is, would you pay for Disney+, Hulu and HBO Go instead of Netflix and any of those options.  We are going to a situation where you buy individual channels of content for streaming, and with more options,  I could see people \"cycling\" through subscriptions, holding one or two at once and cancelling the others.  Then when they get bored of the content they receive, they would rotate into other services.  Netflix does not thrive in an environment with lots of competition/choice, they need to acquire HBO or be acquired by Disney in order to stay a powerhouse.", "score": 1, "replies": [{"body": "That's certainly the frugal way to go, but in reality how many people will actually go through that trouble?\n\nPersonally, I like to have options so I've got Netflix, Hulu, and Prime right now with no intention to cancel any of them. I will almost certainly add Disney when it is available. With HBO's limited library, it is the only one worth the trouble of adding and removing, IMO.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Just wanted to point out that Netflix doesnt actually own many of the series you mentioned, they just pay to stream them.", "score": 2, "replies": [{"body": "If it says \"Netflix Original\"  That means they own them completely.  What you might be talking about is that they bought many of them instead of producing them themselves.  Which means they're still paying market price for the finished product.  Another layer is that Netflix is pay licensing fees for all the stuff that isn't a netflix original e.g. The Office, and Disney movies.", "score": 1, "replies": [{"body": "Nope.\n\nIt just means it’s originally on Netflix:\n\nhttps://www.vox.com/2015/6/11/8766869/netflix-shows\n", "score": 2, "replies": []}]}]}]}]}, {"body": "[removed]", "score": 15, "replies": [{"body": "Link please? And what was it exactly about if you couldn't find the link? Thanks.", "score": 1, "replies": []}]}, {"body": "Disneys streaming service will biggest threat to netflix in my opinion. Disney has lot more IP than netflix will ever have. If disney pulls out marvel and other movies which there are plenty, then what can netflix provide in terms of content? Disney however, at that PE ratio has loads more to gain. \n\n&#x200B;\n\nI would personally switch over to disney whenever that service is online given they have better content. ", "score": 3, "replies": [{"body": "So is Disney a buy now?", "score": 3, "replies": [{"body": "Wait for it to come down to $112 level. ", "score": 2, "replies": [{"body": "I don’t see Disney coming down to $112 anytime soon. Unless they post a bad quarter or the market takes a huge turn for the worst they are extremely stable at $116-$118 range right now. Anything lower then $116 is a great buying opportunity.", "score": 0, "replies": []}]}]}, {"body": "Personally I don't find the Disney content that exciting. Also, I think most people will carry more than one streaming service. Netflix has too much original content for people to ditch it. Nobody wants to watch the Little Mermaid again while other people are watching the new season of Stranger Things. ", "score": 2, "replies": [{"body": "at least for now it doesn't really matter what new content Disney, every parent in america will pick up the streaming service for all the old stuff. It's almost like skyrim where just porting snow white to whatever new tech will allow it to sell all over again.", "score": 1, "replies": [{"body": "I can't personally vouch for it, but the \"kids\" content on Netflix is said to be pretty solid. So I doubt parents will feel the need to add Disney just for their kids.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I don't have kids, but I'm told the kids content on Netflix is very good. So what's more efficient? Utilizing the kids content of a service you already have for your own entertainment or paying for an extra service that *might* be better? Plus, we're talking about little kids. As long as they're quiet, that's all that matters, right? So I see the kids content as a binary item... either it works or it doesn't. Being slightly better doesn't really matter.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Hah, well, I take it you do? What's your take on Netflix's \"kids\" content? I have friends who have kids and they've said it's pretty good.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Here's what I wonder about.  At present people are assuming the current business environment will persist. \n\nMy question is how does Netflix survive or change in a world where the telco/mso charges each of their subscribers a flat fee for access to a streaming bundle. \n\nWe have examples of this today, e.g. t-mobile is already doing zero rating content services with their \"Binge on\" feature.  They're not collecting subscriptions from their subscribers yet, but when 5G rolls, will they start subscription bundles? Or, how hard, or complex would it be for Comcast, or at&t to offer a ~$20 bundle that aggregates content they already own (NBCU + Hulu for Comcast, and TW, incls HBO, for at&t) with other content from Netflix + Disney?\n\nUnder this kind of scenario wouldn't netflix would be more comparable to a ~discovery networks?\n\n*EDIT*\n\nBy discovery networks I meant NASDAQ:DISCA\n", "score": 1, "replies": [{"body": "> Under this kind of scenario wouldn't netflix would be more comparable to a ~discovery networks?\n\nSorry, not sure what you mean by a discovery networks.\n\nAs for being bundled, I assume in that model that T-Mobile would be paying the Netflix fee in that scenario, possibly at a discounted rate.", "score": 1, "replies": [{"body": "Ah, it's Discovery Communications, aka NASDAQ:DISCA.\n\n", "score": 1, "replies": [{"body": "Oh, I gotcha. I don't think that scenario is very likely, though. I am not familiar with the \"Binge on\" feature so I'd need to read up on that. I just imagine people will maintain direct accounts with Netflix rather than going through their cell service, especially as often as people switch cell services these days. There's a benefit to having a continuous profile with Netflix, plus a lot of people share accounts. With the 5 individual profiles per account, it's pretty easy to do.", "score": 1, "replies": []}]}]}]}, {"body": "I would beg to differ. Netflix does have original shows and many of them are based on marvel heroes which disney is taking away from them. House of cards is probably not gonna last too much longer either since the  main cast is gone. The only other show i can see ppl would like is stranger things which they seem to be taking too long to produce.   \nDisney on the other hand has way too much IP and cash in hand to produce shows. They are not selling bonds like netflix to produce cash. Disney has all the content for kids as well while netflix doesn't. Lastly disney will be pricing their service lower than netflix.   \n\n\nGiven all these point, I just cant think of a reason to keep netflix.", "score": 1, "replies": [{"body": "You obviously don't have a clue about their OC if you think \"many\" of their original shows are Marvel. They've got a few Marvel shows, but they are a drop in the bucket. I also don't think Disney will be able to take those shows, as Netflix produced them - they are not licensing them like they do network sitcoms. \n\nDisney has already stated they won't be able to rival other streaming services in content (which is *why* Disney will be pricing their service lower than Netflix), so I think you are way off on your content estimates for both companies. ", "score": 1, "replies": []}]}, {"body": "Disney isn't just little mermaid. They have big block buster names like Marvel and Star Wars. They have many TV stations and are on the forefront to bring esports to TV.\n\nAnybody claiming they have no interest in Disney content is somebody that doesnt watch TV.", "score": 1, "replies": [{"body": "I'm not claiming to have no interest. In another post I said I'm almost certainly going to get their streaming service when available, just that I consider it an add-on.", "score": 1, "replies": []}]}]}]}, {"body": "I bought a few shares of NFLX at $350 so I'm down about $250 dollars now. I want to hold in hopes of an increases, but it looks like a slow decline from here on out. I came to here for advice and maybe some positivity that I wont need to stop my losses, but I haven't found much. ", "score": 3, "replies": []}, {"body": "Sold nflx wayyyyy overvalued and wayyyy too much competition with better content creators. ", "score": 3, "replies": []}, {"body": "Why doesn't Netflix sell rentals for the movies and TV that they're missing? Also partner with grubhub to let you order food through the movie interface. \n\n\"Hey Brian, we see you're watching a romantic comedy, that means your girllfriend is there and you want to order sushi, right?\"\n\n\"Ummm sure Netflix/Grubhub.... she's totally here and that's why I'm watching this.....\"", "score": 3, "replies": []}, {"body": "Given the correction last month, increasing competition, and the fact that, imo, Netflix doesn't have as great of stuff to watch compared to the past, i think they have a hurdle to get over.\n\nI heard Disney is taking all of its stuff off Netflix and Hulu...If others start doing the same Netflix might be in for trouble?\n\n", "score": 2, "replies": []}, {"body": "I love Netflix as a consumer but would never touch the stock. They are burning cash right now to attract eyeballs, which is great for revenue growth. What happens if competition steps up and growth stops. Then you have a lot of debt and nothing to offset. Content will go down and ppl will drop it. Way too much risk imo and right now it is priced for perfection. ", "score": 2, "replies": []}, {"body": "Bubble \n\nWhat’s weird is that the perceived “smart” investors at motley fool money shill this stock like crazy", "score": 2, "replies": [{"body": "I mean Motley Fool is joke now but they did recommend Netflix years ago when it was sub $2 a share. so it makes since that they talk about it a lot", "score": 1, "replies": [{"body": "Ah gotcha, yeah there’s one analyst where I honestly cannot stand. Dunno his name but loves to talk about Netflix whenever he can, and you can tell he’s just rehashing some blog article about how great international subscriptions have been ", "score": 2, "replies": [{"body": "Yea I can definitely see that. ", "score": 1, "replies": []}]}]}]}, {"body": "Like amazon their price is over inflated. To expensive for what they make. ", "score": 2, "replies": []}, {"body": "I cannot time the market, but I honestly don't think anything is a good buy right now. I think every BTFD robot will continue to lose money. ", "score": 2, "replies": []}, {"body": "Let's just look at it from a consumer point of view. Disney got marvel. With power like Disney they will destroy Netflix. Netflix with negative cash flow and its debt, Disney will easily take over. Just my opinion with light dd", "score": 2, "replies": []}, {"body": "How is Disney not considered a monopoly", "score": 1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Also they're not horizontally integrated with any MVPD", "score": 1, "replies": []}]}, {"body": "They don't own the cable distribution pipeline for which their content is served. The SVOD is technically an OTT service, which will have some exclusive content, but the lion's share will still be technically available elsewhere for purchase (EST) or linear/on-demand consumption (via cable).", "score": 1, "replies": []}]}, {"body": "I really don't know. The market reacts weird at the moment. People don't value potential anymore and expect utopia to become true.", "score": 1, "replies": []}, {"body": "In this business content is King, and Disney/fox is the juggernaught. The competition was incredibly slow to launch their streaming services but it's finally happening.", "score": 1, "replies": []}, {"body": "It will be even better opportunity in 6 months. Growth is slowing in rate of change terms. Growth names do horrible in these environments. Give it 3-6 months to continue to sell off. You’ll get an opportunity but now is not it. ", "score": 1, "replies": []}, {"body": "people will probably just buy both. I have netflix and hulu and if disney had a shit ton of stuff to watch for 10 bucks a month i would get that too", "score": 1, "replies": []}, {"body": "Generally buying companies with insane PEs that have shown signs of growth slowdown isn’t the safest bet.", "score": 1, "replies": []}, {"body": "I dont know who would buy it at $420, it was so overvalued it's insane.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "**Defaulted to one day.**\n\nI will be messaging you on [**2018-11-15 17:15:59 UTC**](http://www.wolframalpha.com/input/?i=2018-11-15 17:15:59 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/9x0lfg/nflx_went_from_420_to_295/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/9x0lfg/nflx_went_from_420_to_295/]%0A%0ARemindMe!  when the stock goes down to $69. Aaaw yeee) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! e9ovx0o)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Netflix is replaceable. Disney owns more content by multiples.", "score": 1, "replies": []}, {"body": "I figure Roku Hulu and Prime will push them out more than Disney will", "score": 1, "replies": []}, {"body": "No, it's a long term put opportunity", "score": 1, "replies": []}, {"body": "I dont know that disney will provide the same sentiment. Partly because netflix was in a game of its own in recent times. But that being said, the value of netflix should seemingly drop since they now have more competition and the hype will be gone.\n\nI wouldn’t buy", "score": 1, "replies": []}, {"body": "Netflix is garbage i would never buy it", "score": 1, "replies": []}, {"body": "I also don’t believe Netflix will be profitable anytime soon either.", "score": 1, "replies": []}, {"body": "Never grab a falling knife  OR a sinking turd.", "score": 1, "replies": []}, {"body": "Disney and chill", "score": 1, "replies": []}, {"body": "> Increased competition from Disney's new streaming service Disney+\n\nPeople are very eager to trade on a service that hasn't even launched yet. Amazon also has all the money in the world and can't pull off a reasonable streaming experience, and is an _actual_ tech company. What makes you think glorified movie studio can pull it off? ", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Owning IP and building a world-class streaming service are not the same thing. I maintain that launching a netflix competitor is more akin to becoming an ISP than a film studio. Making Toy Story 4 and being responsible for 15% of the entire internet's bandwidth aren't the same problems. HBO has great content too, and has been in the game for years now and their streaming experience is still dogshit compared to Netflix. ", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Oh do tell.", "score": 1, "replies": []}]}]}]}]}, {"body": "i would look past the numbers and analyze the people at the helm. Most companies who increase in stock prices are idea-strong instead of being motivated by numbers.", "score": 1, "replies": []}, {"body": "No, too many headwinds and no moat outside of the expensive content curation strategy.", "score": 1, "replies": []}, {"body": "Price movement is inverse TSLA...", "score": 1, "replies": []}, {"body": "Went from overvalued to less overvalued but it's still overvalued. It's like saying \"Tilray was 400 Dollar and is now 102. So it should be a good buying opportunity\". They are not going away for sure, but the can't justify their valuation.", "score": 1, "replies": []}, {"body": "If your going long term,  wait it out until mid December. \n\nEither it will have made it's decision to bounce up marking a buy signal or possibly break monthly support and dip even lower. ", "score": 1, "replies": []}, {"body": "i just want to be able to rate stuff again, a \"dont suggest\" button on certain content, and to be able to remove trash shows/movies i never finished watching.", "score": 1, "replies": []}, {"body": "Disney, Amazon, ATT/HBO is going to give them serious competition for once. Not to say they will go bankrupt, but the days of high double digit returns in its stock price annually is behind it now. ", "score": 1, "replies": []}, {"body": "And they owe a lot out money that's getting more expensive. A LOT of money", "score": 1, "replies": []}, {"body": "I think if DIS does not crush NFLX, it sure as hell would put a severe dent.", "score": 1, "replies": []}, {"body": "good buy opportunity for DIS, not NFLX\n\n&#x200B;\n\n\\* I hold no position in NFLX.  I am LONG DIS and do hold shares", "score": 1, "replies": []}, {"body": "Gonna keep buying puts", "score": 1, "replies": []}, {"body": "Netflix is still everywhere and in every device. Their original content is pretty fantastic, heads and tails above the field, as well as far reaching in terms of global footprint. I have a young kid and I’m a huge Marvel/Star Wars need and there’s still not a chance in hell I’m paying for Disney’s service. The only reason I have Prime Video is because my wife orders every household item imaginable through it. I think this is a bit severe correction, perhaps overdue, but they aren’t losing subs.", "score": 1, "replies": []}, {"body": "I've been waiting on it for awhile now.", "score": 1, "replies": []}, {"body": "So glad I sold at $385 (bought at $115).", "score": 1, "replies": []}, {"body": "I think nflx also doubled its market cap in 6 months so it couldnt continue that momentum. Seems like nflx just kinda bubbled a little and will possibly end up back in the $200 range before finding a bottom. Likely lots of bull traps until then. Maybe consider waiting until the downtrend is broken before opening a position. Also consider not buying all at once (it will be important to pick it up cheaper if opportunity presents itself.)", "score": 1, "replies": []}, {"body": "Like others have said, there are better stocks to be bought right now. All of fang right now has some really intense technical damage that will take time to work out of. It's not going to be the quick trade up like it has been in the past. ", "score": 1, "replies": []}, {"body": "One might wonder if the stock market is in a bubble...", "score": 1, "replies": []}, {"body": "I already bought 280 Dec Puts. \n\nStill think it got more to drop", "score": 1, "replies": []}, {"body": "Disney+ is not even live yet!", "score": 1, "replies": [{"body": "It’s possible the announcement caused investors to panic a bit, right?", "score": 1, "replies": [{"body": "I think nflx just ran way too up too fast.. maybe after disney+ comes out it will go down even more .. maybe It won't .. maybe it's just at the fair value now ..", "score": 3, "replies": []}, {"body": "Netflix is a debt machine look at there financials. They are burning cash and have been for some time. This has been rising so fast it was no way in hell sustainable ", "score": 2, "replies": [{"body": "As in all of the film and show production with some above average talent? I can definitely see how the costs pile up from that. ", "score": 1, "replies": [{"body": "A hit every 100 shows/movies is not enough for them.  also netflix hit shows are getting pulled left and right like there own sponsored content is not enough. after there last earnings it said users increased over sea but not nearly as much domestically. Personally i think Netflix has gone to shit and is gonna fall at Disney’s feet\n", "score": 2, "replies": [{"body": "This is a bad take. I think cutting some shows is smart. For a while they were just producing shows long after I thought they should have, so it's good to see some frugality. As for the debt, it takes a while to build a library of OC and it takes money to enter new markets. Once they get into those new markets things are going to look better and better. As for domestic growth, you have to expect it to slow down. Do you know anyone who doesn't already have Netflix? I know the market isn't saturated yet, but my demographic is certainly close to saturation. ", "score": 0, "replies": [{"body": "My point being i know a multitude of people who have cancelled there netflix subscriptions. As far as cancelling content goes, my point being removing popular shows that have been on there already (ie Family guy, How I Met Your Mother etc). Your point of saying they have to take on debt to make money is quite foolish as they already had the debt prior to making original content(go look at there 10k’s from a few years back) They announced they were gonna be putting out original content while already sustaining a massive pile of  debt. If you truthfully beleive Netflix can compete with content of Disney you truly are mistaken so put your money where your mouth is and let it play out. Not saying Netflix can’t put out a decent show every here or there, but compare it to Disney content and lets be real.", "score": 1, "replies": [{"body": "A multitude? I haven't quizzed my friends and colleagues, but I can honestly say I've only met one person that cancelled Netflix and they ended up re-subscribing.\n\nI didn't say they had to take on debt to make money. I specifically said it takes a while to build a library of OC and it takes money to enter new markets. Nothing foolish about that. Just facts.\n\nSpeaking of facts, I don't think you know what you are talking about at all. Disney has already said they won't have much content available compared to Netflix and the price of the steaming service will reflect the lower content. They are hoping to be an add-on service, not to replace Netflix.", "score": 1, "replies": [{"body": "Prove me wrong. show your positions. if you firmly believe in something you should have no hesitation to invest in some long dated OTM Netflix calls. otherwise you’re just arguing for the sake of arguing ", "score": 1, "replies": [{"body": "I don't like to flaunt my positions, but I have 700 shares of NFLX.", "score": 1, "replies": [{"body": "So essentially you have an unrealized loss of close to 75k from Nextlfix’s ATH 😂", "score": 1, "replies": [{"body": "Actually, I don't want to give too much away, but I will tell you that while I own 700 shares, I only bought 100 shares. So with a little detective work you'll see I'm actually doing just fine in regard to NFLX.", "score": 1, "replies": [{"body": "Hahaha little detective work i like that. all i say is that agree to disagree on the whole netflix/disney debate. Maybe both will still continue to be quite successful and we both can profit! Netflix burned the hell out of me after there last ER. my puts were buried in the fucking dirt😂 What strike were you selling your naked puts at that you got assigned? Personally i think that’s best strategy after you discover your price target you  wanna buy a stock into. Just always hope it doesn’t go more south then you hope", "score": 1, "replies": [{"body": "With NFLX making up about 20% of my portfolio, I can't justify buying more, but I can't justify selling it, either. I think it will continue to grow. Even if slowly, I want to be along for the ride. Netflix keeps eating up new markets and has become ubiquitous in the US. \n\nFor me it was one of those \"find a company whose product you like and buy their stock\" type of investments (I want to say this was back in 2011). While I'm not wild about all (or even most of) their new original content, they have been producing some shows I really like (Altered Carbon, Big Mouth, Dark, Stranger Things). \n\nAnd like him or hate him, Reed Hastings seems to know what he's doing. ", "score": 1, "replies": [{"body": "if you own so much why don’t you just sell covered calls at a ridiculously high strike that even if i did get exercised you would be comfortable selling after getting that high of a swing and if doesn’t hit the strike you just collect premium?", "score": 1, "replies": [{"body": ">Not a terrible idea, but I really don't know what I'd put the money into (I'm already like 30% cash) and it's been a wild ride so far so I kind of just like letting it ride.\n\nThat (above) was what I replied to you but I got an automod notification that a seekingalpha article I linked recommending not selling covered call options resulted in my comment being deleted.", "score": 1, "replies": [{"body": "😂😂 shit and really i think selling covered calls is really a good idea in utilizing this irrational market when you want to remain in stocks you already own. Collecting premiums is really just a way to slowly pull in gains. My recent strategy is i’ve been straddling DIA and SPY with all this big market information occurring and when the swing goes quickly one way i just close out that end of the position for the gain. Sometimes if i buy the strikes close enough and the Dow bounces back i can end up profiting from both legs of the strategy", "score": 1, "replies": [{"body": "You're probably right, but I've had these shares for so long. They're practically family. Hell, like I was saying, they even reproduced while I had them. I actually had 200 shares at one point... sold half of them for like a 200% profit (so much regret) and then those 100 remaining split 1:7 a few years later. I can't risk letting them go now. If they can recapture their magic, they'll help me retire early.\n\n", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Still seems expensive. ", "score": 1, "replies": [{"body": "Totally agree. PE of 101.73. That's not for me. If it drops near 50 then maybe.", "score": 1, "replies": []}]}]}
{"title": "Long $AMZN. Papa Bezos just got $2.5 billion of New York taxpayers money! He’s not rich enough!", "selftext": "", "id": "9wzxte", "created_utc": 1542200859.0, "score": 767, "upvote_ratio": 0.98, "num_comments": 134, "comments": [{"body": "What an exceptional illustration.  ", "score": 303, "replies": [{"body": "MMH NO NO NO\n\nAMAZOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOON", "score": 42, "replies": [{"body": "I sometimes gaze up at the moon and wonder if Carlos is looking at that same moon. ", "score": 10, "replies": []}]}, {"body": "Add fire coming off the helicopter and the picture illustrates wsb too.", "score": 8, "replies": [{"body": "needs to be a dude with a bucket of cash standing in front of a private jet on the tarmac with the cash just getting sucked through the turbine intake. ", "score": 5, "replies": []}]}, {"body": "The illustration clearly shows that Bezos has not one but TWO monies... so $AMZN to $3100.", "score": 3, "replies": []}]}, {"body": "How can I apply to work for Amazon since my mu calls bankrupted me ", "score": 137, "replies": [{"body": "Just send dick pics to their HR. Employment guaranteed.", "score": 123, "replies": [{"body": "[deleted]", "score": 61, "replies": [{"body": "What you're talking about is actual investing. We're all too broke for that. ", "score": 23, "replies": []}]}]}, {"body": "Do they take uneducated Highschool dropouts ?", "score": 12, "replies": [{"body": "Can you piss in a bottle on the go", "score": 67, "replies": [{"body": "Underrated comment ", "score": 4, "replies": []}]}, {"body": "Everyone needs janitors", "score": 8, "replies": []}, {"body": "It's how we all looking with the market falling ", "score": 2, "replies": []}]}, {"body": "be indian and lie on your resume", "score": 36, "replies": [{"body": "Have your friend interview for you and hope they don’t notice the difference when you start working", "score": 7, "replies": []}]}, {"body": "you don't want to work there. word on the curb is, the pay is great but they will break your spirit. Hey, at least you get some sweet fucking RSUs out of the deal. ", "score": 6, "replies": [{"body": "Dude I lost 13k today MY SPRIT DIED A LONG TIME AGO", "score": 5, "replies": [{"body": "Oh, theres a product for that. It's called Getting Shit Faced and Shitting on The Cat™", "score": 5, "replies": []}]}, {"body": "the pay sucks dick compared to other tech giants and they work you harder. ", "score": 1, "replies": [{"body": "I did the math and I realized if you started working at Amazon in 2014 and received standard stock grant you would have half a million on hand in todays dollars. \n \nNow I know why certain friends are buying up property in Seattle ", "score": 1, "replies": [{"body": "i dont think thats true at all... you would need to have accumulated 315 RSUs in 5 years?\n\nthe typical employee is def not getting 63 RSUs per year for the past 5 years -- they also adjust their grant plans i think by either 12 or 24 months so you get less RSUs as the stock price goes up.  maybe for AWS but not for retail\n\nThe pay is def okay but honestly better off at microsoft or facebook in seattle", "score": 1, "replies": [{"body": "Huh! Good to know, I've been trying to find accurate numbers regarding RSUs but nothing seems to come up and I can't trust the jokers on Blind. ", "score": 1, "replies": []}]}]}]}]}, {"body": "It’s very easy. They hire en masse for the holidays.", "score": 1, "replies": []}]}, {"body": "Pennsylvania offered something like 4.5 billion. \n\nCities are retarded. ", "score": 153, "replies": [{"body": "\\> Pennsylvania\n\n\\> city \n\n\\> retarded", "score": 249, "replies": [{"body": "is it not Pennsylvania?!?\n\n1. Penny cheese steak\n2. the Penny Fanatic\n3. \"In west Pennsylvania born and raised,  On the playground where I spent most of my days\"", "score": 75, "replies": [{"body": "I agree, Pencilveineya is amazing, not sure what these other people are going on about.", "score": 21, "replies": [{"body": "Especially the area between philly and Pittsburgh which is surprisingly similar to the Deep South ", "score": 7, "replies": [{"body": "Pennsyltucky", "score": 7, "replies": []}]}]}]}, {"body": "It was Pittsburgh specifically.  But Im sure a good chunk of the money was coming from the state coffers. ", "score": 22, "replies": [{"body": "Look at the bright side! Now they have the money to fix the roads! /s", "score": 19, "replies": [{"body": "Why would they do that? the road's still there.", "score": 3, "replies": []}]}]}, {"body": "He belongs here", "score": 1, "replies": []}]}, {"body": "My city is stupid af. They were willing to suck Jeff Bezos dick for HQ2, meanwhile they are not giving proper water and sewage systems and giving a \"fuck you\" to the native businesses who are actually exporting shit to other states and countries. They gotta go to DC for help and grants it's embarrassing as hell. ", "score": 49, "replies": [{"body": "My old city, Duluth, Minnesota, will lick a tourist’s sweaty, shit-covered asshole, but when it comes to replacing their crumbling water network, much of which was installed in the late 1800s?   Nope. ", "score": 9, "replies": [{"body": "Huh. Been trying to decide where to go for my next vacation--thanka for the tip! ", "score": 11, "replies": [{"body": "Your rusty sheriff’s badge would come home spotless. ", "score": 6, "replies": []}]}, {"body": "The business community has to always ask grants from DC for basic shit like roads and water. Shit only costed like 2 million dollars to do and the city instead wastes millions money on shit unnecessary projects like a streetcar. But when Washington finally approves the grant guess which places get taxed up their ass for properties now worth more? ", "score": 1, "replies": []}]}, {"body": "Corrupt politicians will always be corrupted! It’s crazy that the only person protesting this was that new communist chick from Queens.", "score": 26, "replies": [{"body": "Dat ass tho", "score": 19, "replies": []}, {"body": "[https://www.dailywire.com/sites/default/files/styles/article\\_full/public/uploads/2018/07/alexandria\\_ocasio-cortez\\_3.jpg?itok=GDcE-CYx](https://www.dailywire.com/sites/default/files/styles/article_full/public/uploads/2018/07/alexandria_ocasio-cortez_3.jpg?itok=GDcE-CYx)", "score": 15, "replies": []}, {"body": "Bruh she is basically the \"#ResistCapitalism\" written on an iPhone meme lol", "score": 16, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "She is a complete loon, but at least she’s principled and actually cared about her voting base on this issue, which is impressive for a politician. Give her a year in Washington and she’ll be 100% corrupt like Auntie Maxine with a $20 million house and $300k per year admin jobs for her 300 closest friends and family.", "score": 7, "replies": []}]}, {"body": "she is like if that dumb girl at your work suddenly becomes a representative  \n\n\n\"Like ummm I dunno, just raise taxes.\"", "score": 7, "replies": []}]}]}, {"body": "Cities were a mistake ", "score": 14, "replies": [{"body": "Civilization was a mistake.", "score": 10, "replies": [{"body": "Language was a mistake.", "score": 5, "replies": []}]}]}, {"body": "My favorite attempt at getting the Amazon HQ2 is when Tuscon Arizona sent Jeff Bezos a 21 foot cactus with a note on it. Amazon rejected it lol. ", "score": 8, "replies": [{"body": "Please tell me the note said \"Are you brave enough?\"", "score": 8, "replies": [{"body": "nah I think it said something like \" come grow with us jeff\" or some shit ", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "It's 2.5 NYC, 2.5 Nova", "score": 3, "replies": [{"body": "Seems like a good deal for NYC", "score": 2, "replies": []}]}]}, {"body": "I guess Lord Bezos didn't want his employees getting shot at by naggers.", "score": 3, "replies": []}]}, {"body": "that reporter would do well here.  pays 11B gets back 2.5B, thinking amazon got 2.5B.  Be broke in no time.\n\n", "score": 29, "replies": []}, {"body": "Last 3 purchases I made from amazon were overpriced, poorly constructed, China made crap which I returned. Somehow I began to hate shopping on amazon now. ", "score": 27, "replies": [{"body": "Totally agree. They have been swamped with China fakes. The worst thing right now are the ads for stuff you’re NOT searching for that show up on top of search results. It’s a short.", "score": 16, "replies": [{"body": "Thats why i just switched to AliExpress. Like yeah, for 14 bucks i can buy two longsleeve batman workout shirts..on amazon thats like 20 per.", "score": 7, "replies": [{"body": "Batman workout shirts, that’s the fashion item the season. Go bro!", "score": 3, "replies": []}, {"body": "Long baba", "score": 2, "replies": []}]}]}, {"body": "But I bet that return was the easiest thing in the world. Amazon has the best return policy bar none.", "score": 4, "replies": []}]}, {"body": "Seriously, will amzn get bloated and less profitable due to operating out of $$$$ nyc?\n\nMaybe, but that's probably decades away.\n\nThank you NY taxpayers!", "score": 20, "replies": [{"body": "amazon is already bloated and has way too many crappy engineers.", "score": 24, "replies": [{"body": "Average pay of $150,000 doesn’t sound like SWEs.", "score": 3, "replies": []}]}]}, {"body": "\\>He's not rich enough!\n\nThis is an actual LateStageCapitalism quality title", "score": 15, "replies": []}, {"body": "Amazon has peaked. ", "score": 6, "replies": []}, {"body": "Everyone wants to be rich and at the same time don’t want other people to be rich. “hE’S nOT rIcH ENoUgH”", "score": 42, "replies": [{"body": "They don't want people to get rich off their tax paid money.", "score": 99, "replies": [{"body": "Nah man. It's the NYPost. It's owned by Daddy Murdoch. Murdoch is just pissed that Bezos is richer than him by starting an online bookstore. ", "score": 50, "replies": [{"body": "you can be a reptilian piece of shit and also occasionally correct ", "score": 45, "replies": []}]}, {"body": "Except no one digs into the details of the expense. Let’s just ignore the benefits of a trillion dollar company having it’s headquarters in a city. Surely no tax revenues would be generated from the jobs nor would anyone spend money in the city who works at the company. The media likes to take a very elementrary look at this and focus on someone making a lot of money.", "score": 36, "replies": [{"body": "[removed]", "score": 8, "replies": [{"body": "the break is 2.5B not 12.5B unless I'm missing something?", "score": 26, "replies": [{"body": "You're right, $2.5B. I fat fingered and then rolled with it like an idiot. Thanks. ", "score": 3, "replies": []}]}, {"body": "I honestly can’t believe that NY is this desperate to have Amazon HQ. ", "score": 5, "replies": [{"body": "NYC metro is 20 million fucking people. 25k jobs, even paying $125k+, is not going to have a noticeable impact. Yes this is a good thing for the economy over the next 10-20 years but it's not huge. NYC will definitely get back more than $2.5 billion in payroll taxes alone, though.", "score": 16, "replies": [{"body": "Luckily they will completely ignore the 25k influx of Subway riders on what is an already dilapidated and run down Yellow line. What could go wrong? It barley runs on time 3 days a week.", "score": 9, "replies": []}, {"body": "If you don't live in NYC, I wouldn't suggest commenting on this. If you do, you are delusional. The railroad and subways are strained as is, and real estate prices are extremely expensive as is. ", "score": 5, "replies": [{"body": "I can't speak to the yellow line specifically but adding 25,000 people to a city of ~20,800,000 is not going to spike real estate prices in what is already one of the most expensive locales in the country. And this ignores the fact that this won't magically drop 25,000 new residents in Queens, a lot of those employees will come from other companies already in NYC.\n\nAnd for fuck's sake there is nothing so special about NYC that you can't comment intelligently on it if you don't live there, but for what it's worth I did live there for several years.", "score": 6, "replies": [{"body": "yes yes and yes", "score": 6, "replies": []}, {"body": "This is going to drop more than 25k residents in Queens, if they hire locally other companies will reach outwards, and some of these people coming in will have families consisting of more than 1 person.. also don't ignore several thousand will be moving from.their current office. \n\nNYC mass transit can really only be commented on if you live in the area, Queens real estate will see a massive jump with 25k+ jobs and a ~1% increase in the population. Have you seen the state of the LIRR lately? Seeing as they are doing a massive overhaul, not sure how well they can accommodate a good chunk of extra commuters. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "The government doesn't cut Amazon a 2.5B cheque, Amazon will pay 2.5B less than full price on it's taxes over a period of time. The economic stimulus that business will bring to the region will make up for that many times over. ", "score": 17, "replies": [{"body": "It's still bullshit. If everyone stands their ground then Amazon will have to select somewhere and pay full taxes. This whole thing to see who would go lowest was a sham to circumvent taxes. There should be no tax breaks at all and Amazon should pick a city based on the merits of that location, not on who is willing to suck them off more.", "score": 10, "replies": [{"body": "Maybe cock sucking ability is how Amazon judges merit.", "score": 8, "replies": []}]}, {"body": "How do you know? These big corporations aren't known for liking to pay their taxes. So that would mean it comes from the employees living in these cities, spending money etcetera.\n\nBut if you're a small business owner you're on your own, the government doesn't let you pay less taxes. And greedy Bezos does. There is nothing wrong with big corporations, but let there at least be a level playing field.", "score": 3, "replies": [{"body": "> These big corporations aren't known for liking to pay their taxes.\n\nName someone who likes paying taxes. They pay the taxes they're legally required to pay, the same as you and me. If you want to suck Ocasio-Cortez's socialist cock feel free but don't pretend corporations can just *decide* not to pay taxes.\n", "score": 23, "replies": [{"body": "No, you and me pay the taxes that we should. These corporations, like Starbucks, and Amazon included, do everything they can to pay less taxes. Like letting revenue pass through legal entities in countries like Ireland, Luxembourg or the Bahamas, and fuck around with laws about royalties and intellectual property.\n\nAnd yes I would suck her cock.", "score": -12, "replies": [{"body": "\"Should\" means what you're legally required to pay. If Amazon is breaking the law you stand to make quite a bit of money by proving it.\n\nThere is no morality is paying your taxes. You pay the amount you're legally required to pay. Which Starbucks, Amazon, and all these corporations are doing.", "score": 23, "replies": []}, {"body": "If you're not also doing everything you can to pay less taxes then you're a dumbass for filing your taxes wrong", "score": 20, "replies": []}]}]}, {"body": "Level playing field? Friend, this is America. Life ain’t fair and it sure ain’t fair here either. ", "score": 22, "replies": []}, {"body": ">But if you're a small business owner you're on your own, the government doesn't let you pay less taxes. And greedy Bezos does.\n\n\"greedy Bezos\" pays more taxes in a day than you'll pay in your lifetime ", "score": 10, "replies": [{"body": "Greedy bezo makes more in a day than this entire sub combined will make in their life", "score": 2, "replies": [{"body": "Imagine that, allowing someone who has generated a massive amount of wealth for society to be wealthy in return", "score": 6, "replies": []}]}]}, {"body": "Small companies can’t lobby so politicians don’t give a fuck", "score": 5, "replies": [{"body": "Small companies absolutely do lobby", "score": 1, "replies": [{"body": "Not as much. Lmt pumped tens of millions in donations for their over priced f35 project", "score": 1, "replies": []}]}]}, {"body": "Even if “Amazon” does not pay its fair share of taxes locally, Amazon employees will. 25000 x 60k (average lets say), so 4% of that is a lot of $b back. Plus sales tax property tax etc these people have to eat. Any state will gain a lot more then invested, this is not Foxcon Wis deal 😂. But this stupid narrative that states should do this and this.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Fair share would be the tax % a local company pays to the state in a similar industry, retail. However we know how the tax system works and \"fair share\" is replaced by \"legally obligated to pay share\". My point was not to say Amazon does not pay enough taxes, my point was Amazon + employees will pay plenty of $B in taxes. The state ROI will be great in the long run.", "score": 1, "replies": []}]}]}, {"body": "hey I definitely agree with you there, huge corporations shouldn't get to bargain with the government for favorable tax exemptions. \n\nthese cities obviously did a cost benefit analysis and see the 2.5B in lesser revenue as taking a smaller slice of what Amazon will make a larger pie of tax income for the city/region over the long run. \n\nBut that's the problem with such big government with so much power, I don't hate Amazon for being the player, I hate big government having the power to rig the game. ", "score": 2, "replies": [{"body": "Hell yeah brother, cheers from Iraq ", "score": 1, "replies": []}]}, {"body": "Large corporations like Amazon have a disproportionately higher economic impact on local communities than thousands of \"smol bsns\" combined.\n\nAmazon will actually bring educated white collar professionals to further gentrify a place like Long Island City which was a dump just a few years ago.\n\nSmol Bsns only hire brain dead minimum wage monkeys lmao.", "score": 2, "replies": [{"body": "Small business employ more people over all than large corporations in America.  And learn to spell you brain dead monkey. ", "score": 1, "replies": [{"body": "Listen bud. I am sure you are a passionate \"Smol bsns\" advocate. The facts still remain what they are. I would rather have a small satellite office of any white collar multinational corporation move into my neighborhood than hundreds of \"smol bsns\" which are mostly run by uneducated blue collar types and employ only minimum wage cash register operators with criminal records.\n\n", "score": 1, "replies": []}]}]}]}]}, {"body": "How about the additional 25k jobs they brought in ? Or nah doesn’t matter?  Using tax money to help create jobs for your citizens, what a shocking misuse of tax money...", "score": 3, "replies": [{"body": "The argument a lot of people are making is that these jobs aren’t for NY residents and most of the positions will be filled by recruiting software engineers from other states driving current residents out. This isn’t necessarily true but this is what many people assume will happen. ", "score": 4, "replies": []}]}]}]}, {"body": "If Bezos drops a $50 note, by the time he picks it up he's probably $500 richer....", "score": 3, "replies": [{"body": "yea well 200k in 1 minute. He probably going to have to start picking up $50 notes now since of the harsh and struggling times hes about to go through. \n\n&#x200B;\n\n/s", "score": 1, "replies": []}]}, {"body": "lol when we pay our taxes, its our money. when amazon pays their taxes, its the tax payers money. ", "score": 3, "replies": []}, {"body": "ITT: People not realizing cities can incentivize large corporations to bring large-scale economic benefits to them & the surrounding area. A huge influx of high-paying jobs means huge increase in tax revenue. The low-income jobs means lower unemployment rates & more contribution to the economy.\n\n\"Bu..bu..b.uu....government shouldn't have to incentivize companies! Everything should be equal! The govt should get together and ban this practice!!\"\n\nFuck off , poindexter. \n\n ", "score": 17, "replies": [{"body": "Except cities/governments are generally retarded, when a profit making entity negotiates with retards who do you think wins. Not the retards.\n\nThis is not capitalism. It's autism.\n\nBTW this tax revenue is going somewhere in the country anyway, now the government in poorer overall, the winning cities may be a bit richer, and everyone else gets shafted.\n", "score": 43, "replies": [{"body": "I mean I'm outlining the strategy of the game and you're highlighting that the players are mostly retarded. I don't think we are disagreeing on much, here. ", "score": 0, "replies": []}]}, {"body": "Except this is a zero sum game. NYC getting these large scale benefits, means another city just missed out. So as a whole, the country just lost some tax revenue. The exception to this might be if you're bidding against international options, and I don't think this is the case. You can't both be pro subsidy and an economic liberal, so I'm kinda confused what your economic philosophy is.", "score": 4, "replies": []}, {"body": "Define huge. ", "score": 1, "replies": [{"body": "Fuck off dweeb, you can google it as well as I can.", "score": 1, "replies": []}]}]}, {"body": "Oracle lost the protest of the JEDI contract bid. Amazon is likely to win it now. ", "score": 2, "replies": []}, {"body": "He must bring 25000 jobs or he doesn't get that much money from the state. Just a heads up", "score": 1, "replies": [{"body": ">He must bring 25000 jobs or he doesn't ~~get that much money~~ *get excused from paying that money to* the state. Just a heads up\n\nFTFY\n\nNo party is \"given money\" in a tax break, it's just less taxes that have to be paid. They will come in and still pay billions in taxes. ", "score": 9, "replies": [{"body": "Exactly, thanks ", "score": 1, "replies": []}]}]}, {"body": "Can the stock go back up now please? ", "score": 2, "replies": []}, {"body": "Does this mean long AMZN??", "score": 1, "replies": []}, {"body": "Funny how my amazon calls costed me more than every thing i ever spent at amazon. A 14k spending spree on amazon would have been smarter and actually helped the stupid stock. ", "score": 1, "replies": []}, {"body": "The post with the best art in the game besides the New Yorker", "score": 1, "replies": []}, {"body": "Wait, doesn’t every skyscraper have a helipad?\n\n(The not pointy ones of course...... those have dirigible ports) ", "score": 1, "replies": []}, {"body": "This is why I love capitalism! \n\nMy dude finessed the government! ", "score": 1, "replies": []}, {"body": "*T,AoCI2.:Z@#]0s2#wqgR%JWSrT)uUbNVGV@dwi$gi0UZ0eL1Mi#ZKAQI;4HBpv>Mc7lDU1A$lTgB+]dKL<52unzAP$0Gg]m3KU~BJRDJf,gcwa&s3iK56$tFZv^l.mm+Dr;[uoBxOp0)9JbEw1qfBx-6a6WNd)27ia:8r^I[[q-rLuW85.(-8E0<LOkc>D#nH5r-SJ^Xh5TVdZXE8h4#Pe(^PZG1-(>Waw-vcN6ky.RC6HV4RdP39KTDH1,3p3U7Fy2<[()mgpu1&DzIM4~RPpw-]7#dN~;G-.!gW(26N4GyQDrp!9e\n\nKpF4$^zCr(4hiqP-2<ID;OmDVpxMVO!Q8t4@L67bJT+rf5wP.cC5MBtrXRunTm7O:8LlJzTPS<%Q$KD%#FP4dX", "score": 1, "replies": []}, {"body": "He didn’t “get” their money.  That’s just money the company doesn’t have to pay.  Also, it’s not like the public has to make up the difference in an increase.  It is an incentive to entice the company to open there; which arguably will provide more benefit to the public through jobs and revenue than the tax money he’s not paying.  But what do I know...I lurk on WSB", "score": 1, "replies": [{"body": "If they could sticky this", "score": 1, "replies": []}]}, {"body": "Why not simply make this kind of thing illegal for every city/state. Not like amazon is suddenly going to stop doing business in the USA", "score": -1, "replies": [{"body": "Because opening up shop in a location will bring more jobs, opportunities, revenue, and that sweet sweet same day service.  It’s very similar to a signing bonus; or your ability to write off your insurmountable college debt interest.  The dude played the game right; the city knows what Amazon brings to the table in extra benefits.  Enough said.  If it wasn’t mutually beneficial, do you think NY you allow for that benefit?...think my friend, don’t be a sheep", "score": 2, "replies": [{"body": "If no one one could give them a tax break they would still have to grow their business and the cities would still get those benefits?", "score": 1, "replies": [{"body": "If taxes weren’t the benefit, something else would be the benefit.  Be thankful that it is something that is visible to the public-(ish) and quantifiable.  The way that this article is portrayed it appears that he is getting all kinds of money from the city.  It’s just money they do not have to pay to the city/state in the form of various taxes.  Is it true that it is 2.5B less in tax revenue that NY can blow on dumb s***...yes...but it’s also hundreds if not thousands of jobs, a very enticing service, and increased taxable revenue.  The govt is still taxing the employees pay checks and everything that is purchased from Amazon.  The money will still be available in abundance to the city.  Once again; this is mutually beneficial even though the article portrays it as one sided.\n\nEdit: typo because I suck", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "You’re looking for r/politics chief ", "score": 4, "replies": [{"body": "You're right that was not required.", "score": 1, "replies": []}]}]}]}
