{"title": "Little known outside the wireless community: 5G is coming", "selftext": "\"In our 5G trials, we achieved download speeds roughly 30-50 times faster than what is possible with 4G. Data moves so quickly on 5G that Ronan Dunne, our executive vice president and group vice president, has argued:\n“5G isn’t just another iteration of wireless innovation,” he says. “Just as the next generation of the television industry reinvented content based on the unique properties of the medium itself, the potential of the fifth generation of wireless technology demands that we fundamentally rethink what can be done on a wireless platform.”\n\nLong calls boys\n\nApple planned to debut their first 5G phone in 2019, but it's been postponed to a lackluster Intel chip. ", "id": "9u3ib1", "created_utc": 1541339902.0, "score": 64, "upvote_ratio": 0.78, "num_comments": 92, "comments": [{"body": "[deleted]", "score": 151, "replies": [{"body": "Don't worry, it will drain your battery so fast, you never hit your cap! ", "score": 52, "replies": [{"body": "I have my phone hardwired into my router and plugged in.", "score": 2, "replies": [{"body": "Someone should invent an internet that just stays plugged in so you don't have to worry about charging or poor signal!", "score": 5, "replies": [{"body": "They did but my mom still picks up our rotary phone.", "score": 1, "replies": []}]}]}]}, {"body": "Exactly, fuckin long the carriers", "score": 12, "replies": []}, {"body": "Facts.", "score": 3, "replies": []}, {"body": "caps are gay", "score": 3, "replies": []}, {"body": "Something, something, net neutrality. ", "score": 1, "replies": []}]}, {"body": "With data caps in place, it means basically nothing.", "score": 58, "replies": [{"body": "What i'm thinking here is it makes cable obsolete. \n\n&#x200B;\n\nContent providers can throw up a tower in major cities and bypass the need for cable infrastructure for the most part. \n\n&#x200B;", "score": 23, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "I'd imagine govt mandated monopoly as well as having massive startup costs. ", "score": 19, "replies": [{"body": "We are talking about massive startup costs? Don’t these companies have somewhere close to 500b lying around in cash?", "score": 8, "replies": [{"body": "Buy them out dude. They could raise that in 8 days from Robinhood alone.", "score": 7, "replies": []}, {"body": "google stopped expanding google fiber bc the costs were so onerous", "score": 2, "replies": []}]}]}, {"body": "The margins aren't good compared to selling software and overpriced phones.", "score": 6, "replies": []}, {"body": "Google already has Google fi, a cellular service provider ", "score": 3, "replies": []}, {"body": "AT&T is Fortune 8. Verizon is 16. Fucking yuuuuge. ", "score": 1, "replies": []}]}, {"body": "So every content provider spends billions for the infrastructure to get into a low margin business?\n\nAlso, \"a tower\"? Do you realize 5G is extremely short range? They would need thousands of antennas in a single metro area.", "score": 4, "replies": [{"body": "Put them inside the cell phone.\n\n\n- points at head", "score": 2, "replies": [{"body": "Johnson, hire this brilliant motherfucker!", "score": 1, "replies": []}]}]}, {"body": "PBS to buy out Netflix?", "score": 1, "replies": []}]}, {"body": "I mean data caps as we know them will therefore evaporate. ", "score": 1, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "Because competition for users will incentivizing companies to be the first to provide a differentiating service so they can steal market share", "score": 1, "replies": [{"body": "Why would 5G cause different competition than 4G?", "score": 1, "replies": [{"body": "It wouldnt necessarily, I'm just saying data rates as we know them would most likely shift to accomodate the new performance paradigm", "score": 1, "replies": [{"body": "What? That's a lot of words that don't explain anything.\n\nData caps exist on 4G because the speeds are too *high*. 5G increasing speed makes data caps *more* likely. Do you know what a backhaul circuit is?", "score": 0, "replies": [{"body": "If you have the opportunity to offer a better service than a competitor to gain an edge, you will take that opportunity. Innovation isn't static\n", "score": 1, "replies": [{"body": "Do you know what a backhaul circuit is and how bandwidth is delivered to a tower?", "score": 1, "replies": [{"body": "I don't but I do know that the topology of the network will be significantly different to those prior. I'll look it up. But I explained why data caps will increase like you asked. They will", "score": 1, "replies": [{"body": "They won't because you don't understand how bandwidth is delivered to a tower. Changing a tower and a phone to 5G doesn't magically increase the bandwidth on the tower. The bandwidth comes from the circuit (backhaul) connected to the tower. Did cable companies have data caps when speeds to your home were slow? No. Why? Because you couldn't saturate the network. Connection speeds go up, and data caps are put in place. ncreasing connection speed to devices = data caps.", "score": 1, "replies": [{"body": "It's a bit different than that in 5g implementation. I understand what you are saying but I guarantee the engineers behind the new protocol have addressed the issues you describe.", "score": 1, "replies": []}, {"body": "https://youtu.be/GEx_d0SjvS0 IEEE does a pretty good job at explaining the major differences in  implementation. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "What data caps? I pay €35/mo for true unlimited.", "score": 1, "replies": [{"body": "Many people are capped/throttled in the US", "score": 16, "replies": [{"body": "Only 4% of the world population. Either you'll fall behind or you won't. Doesn't really matter regardless.", "score": -6, "replies": [{"body": "Yes and clearly population size is the only relevant metric about the US market ", "score": 25, "replies": [{"body": "I have 2 rocks and elephant poop. Give me ulimited data!", "score": 2, "replies": []}, {"body": "Pretty much. It just means that we will move on and have more advanced cellphone plans. People won't think \"oh the Americans have it so bad with their capped 4G/5G\"", "score": 0, "replies": []}]}, {"body": "Funny how 4% of the population = most powerful and important country in the world lol", "score": 19, "replies": [{"body": "I wonder how long Rome repeated this similar mantra. ", "score": -2, "replies": [{"body": "About 2000+ years. They thought they were the shizz right up to the end. Sure, it didn’t last forever, but they had a good run.", "score": 2, "replies": []}, {"body": "around a millenium", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yes, and Western countries will steam ahead while you pay for our defense <3", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 39, "replies": [{"body": "[deleted]", "score": 3, "replies": []}, {"body": "I'm autistic, cut me some slack 😤", "score": 6, "replies": []}]}, {"body": "I’m long QCOM specifically for 5g. Not a part of the wireless community at all, but who doesn’t know 5g is coming, and Qualcomm seems to be setting itself up well", "score": 8, "replies": [{"body": "The trucking industry relies heavily on QCOM, 5g Qualcomm devices would do a lot of good for it", "score": 5, "replies": [{"body": "They're also making a huge portion of the markets processors, what's good for mobile is always good for Qualcomm. But the release to the market of Samsung's chips is a tad worrisome (verge says they're the largest as of this year). ", "score": 3, "replies": []}]}]}, {"body": "Work as a rf Engineer \nMainly build sites for sprint and verizon and I'll tell you one thing \nAll in Boys \nNo dd needed", "score": 8, "replies": []}, {"body": "I don’t even get full 4g speeds with Verizon in my area. 10 miles outside a major city. Wtf am I gonna do with 5g lol ", "score": 23, "replies": [{"body": "5g is fiber ran straight to rrh radio so you get all the speeds you dont get full speeds because the nearest tower is either far away or gets alot of traffic\n ", "score": 2, "replies": []}, {"body": "i dont get any gs cuz we dont have cell reception where i live rofl", "score": 2, "replies": []}]}, {"body": "I'm looking at the 1 Billion dollar contract with Nokia for this in China. As for the US there's a ton of different cogs in the machine. Hardware, software, vendor, carrier, it's a long list. We're also talking about microwaves here and I'm not sure as some others have said of the health implications. China doesn't give a fuck about that last one so a 2 year play on Nokia might be doable and insanely cheap. Hard to say. ", "score": 22, "replies": [{"body": "Seems to make sense. I'll probably dump my entire portfolio into it and lose it all. ", "score": 20, "replies": [{"body": "Well, that's what we do here and advocate to others so, yeah.", "score": 10, "replies": []}, {"body": "Well, here in Finland it is a national necessity to own Nokia if one is an investor. I honestly dont know anyone who wouldnt own at least a little bit.", "score": 0, "replies": []}]}, {"body": "There are no health implications.  The wattage of these 5G AMPs and antennas is no greater than the current 4G AMPs and antennas.  You're bathed in radiation everyday, and quite a bit of 4G is microwave.  The sun hammers you harder to be honest.  \n\nNokia/QCOM are a go.", "score": 6, "replies": [{"body": "I've yet to look at the specs on the 5G, I was just going by what someone else said here and assumed they have. As for 4G being microwave, yup I commissioned a lot of those towers for Ericsson/Sprint a few years back. There were mostly Samsung PRAS towers with dragonwave microwaves attached. We did Huaweii for a while until the US government said no more Chinese hardware on our infrastructure.\n\nSo yeah, looking at 2 year LEAPS on Nokia at the moment. I know Sierra Wireless will be a supplier and Qualcomm obviously. And it looks like AT&T and Verizon for carriers, at least in the beginning.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Transport Tycoon Deluxe?", "score": 5, "replies": [{"body": "Tranny’s Tits n’ Dong", "score": 5, "replies": [{"body": "Toronto Tranny Delights", "score": 1, "replies": []}]}]}, {"body": "Ten toes down", "score": -1, "replies": []}]}, {"body": "Oh cool now I can use all 4gb of my allotted data in 4 seconds", "score": 3, "replies": []}, {"body": "I’m long on $T. They’re climbing out of a ten-year low right now. Perfect time to get in. ", "score": 3, "replies": [{"body": "I like that ", "score": 1, "replies": []}]}, {"body": "Lowell McAdam was promising the same thing not long ago. I'm skeptical. ", "score": 2, "replies": []}, {"body": "$TMUS fellas.. Wait for a dip though.", "score": 2, "replies": []}, {"body": "This is being advertised a ton in twitter by tmobile", "score": 2, "replies": []}, {"body": "I went to a rich boarding school and one of the kids told me a little something about apple not hopping on the 5g train.", "score": 2, "replies": [{"body": "Damn, I wonder how he knew...", "score": 1, "replies": [{"body": "He could be full of shit but then again a kid at that school would fly home on a private jet. He claimed his uncle is pretty high up at apple but then again he was kinda a fag so idk what to think.", "score": 2, "replies": [{"body": "maybe he was one of the twinks that tim cook keeps around the office", "score": 2, "replies": [{"body": "I wouldn’t be surprised ", "score": 1, "replies": []}]}]}]}]}, {"body": "And nobody gives a fuck about mmWave. You can literally stop that spectrum with your finger. It can't penetrate shit and it's more expensive. Gigabit LTE will stay around for a long time. We haven't even reached 100 Mbps don't come me with 20 Gbps. And what's the point if my data cap is still 5 GB?", "score": 1, "replies": [{"body": "It all goes down to traffic", "score": 1, "replies": []}]}, {"body": "This is good for mu", "score": 1, "replies": []}, {"body": "I’m guessing CTL?", "score": 1, "replies": [{"body": "They're the gamestop of the industry.", "score": 2, "replies": [{"body": "Lol", "score": 1, "replies": []}, {"body": "That dividend though ", "score": 1, "replies": []}]}]}, {"body": "I am VERY concerned with the effect 5G will have on the human body anne frankly I don't really want it adopted unless the shit is fixed", "score": -1, "replies": [{"body": "Ok Ted Kaczynski. What the fuck are you posting from? A type writer? ", "score": 6, "replies": [{"body": "I know there is this image of reddit being this upper middle class/lower upper class user base, but the last couple of years makes me think it's more cleetus class with a few of former being very very loud. ", "score": 5, "replies": []}]}, {"body": "I hate people like you when working on my sites\nLike you use a microwave dont you ? Electric oven remote control your phone ??? A fucking tv??\nIt all transmits frequency quit whining", "score": 3, "replies": [{"body": "I don't use a microwave, generally use a gas oven, and don't own a tv :')\n\n[here's](https://www.saferemr.com/2017/09/5G-moratorium12.html?m=1) a portion of my reasoning", "score": -3, "replies": [{"body": "You do realize the Sun has more radiation than a microwave? Do you also avoid the sun 24/7? ", "score": 4, "replies": []}, {"body": "How can I short you?", "score": 6, "replies": []}]}]}]}, {"body": "5g the idea is great, the tech is crap and will lead to headaches+more maintenance for the ISP. Not to mention the health implications of 5g as well. I actually see 5g as a negative from a business standpoint. ", "score": 0, "replies": [{"body": "Isn’t the spectrum it uses really shit too. Like almost line of sight and the equipment needs to be super densely dispersed. ", "score": 1, "replies": []}]}]}
{"title": "$TSLA Model 3 outperforms Corvette", "selftext": "[deleted]", "id": "9u75ow", "created_utc": 1541365844.0, "score": 78, "upvote_ratio": 0.85, "num_comments": 119, "comments": [{"body": "But Tesla's don't shoot out bald eagles from the exhaust pipes...", "score": 91, "replies": [{"body": "Don't need to. Tesla shoots bald eagles at fucking Mars! ", "score": 32, "replies": []}, {"body": "You clearly don't know how a bald eagle sounds. ", "score": 9, "replies": [{"body": "Kkeeeeeeeee", "score": 7, "replies": [{"body": "No fag, it's kahkaaaaaa", "score": 3, "replies": [{"body": "kahkaaaaaa is a Mexican bald eagle. Disgusting", "score": 3, "replies": [{"body": "You sexist scum", "score": 3, "replies": [{"body": "Calling someone Mexican is sexist - whaaaat?", "score": 1, "replies": [{"body": "Silly you, you think you live in a world that makes sense. I mean wtf is a pansexual... Like seriously...", "score": 1, "replies": [{"body": "> I mean wtf is a pansexual\n\nOh, that's someone that has sex with pancakes, regularly.", "score": 1, "replies": [{"body": "Then I am fo so a tendysexual", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Yeah no shit its an electric motor. That's like saying Corvette louder than Tesla", "score": 77, "replies": [{"body": "I modded my tesla tail pipe with a fire cracker why it no loud?", "score": 19, "replies": [{"body": "Have you tried pinning a baseball card in the spokes of the wheel?", "score": 16, "replies": []}]}, {"body": "Exactly, way more torque with the electric motor, giving more initial acceleration. Make the race longer and the Corvette beats the Tesla.", "score": 7, "replies": []}, {"body": "Wait, hwat?", "score": 0, "replies": []}, {"body": "Huh? That should put the tesla at more of a disadvantage. Gas has more energy per inch than any other resource.", "score": -42, "replies": [{"body": "It's a matter of how fast you can turn your energy into motion, and an electric motor can be full bore as soon as you say go. ", "score": 41, "replies": [{"body": "Yeah I was expecting to call all you guys retarded when I first clicked the link.\n\n&#x200B;\n\nElectric motors go from zero to full power instantly. Gas cars have to build up torque to reach max speed. Electric car will beat oil/gasoline car 9/10 times if they have similar power.\n\n&#x200B;\n\nI was an engineer once. \n\n&#x200B;", "score": 7, "replies": [{"body": "Also a gas engine needs to shift gears.", "score": 7, "replies": []}, {"body": "> Electric car will beat oil/gasoline car 9/10 times if they have similar power\n\nThe catch is they usually don't have similar power. The motor just delivers its power instantly, while an ICE operates best at high revs", "score": 1, "replies": [{"body": "yep -- only for acceleration ", "score": 1, "replies": []}]}]}, {"body": "for a limited time...", "score": 2, "replies": []}]}, {"body": "This guy autisms ", "score": 17, "replies": []}, {"body": "Then why are the biggest haul trucks electric? Torque and horsepower look up the difference ", "score": 10, "replies": []}, {"body": "Energy per inch doesn’t make sense. You mean energy per mass or maybe per volume. Gasoline has a higher energy density than Li-Ion batteries but less than diesel. The highest-density resource is probably plutonium-239. In any case, many orders of magnitude more than gasoline.\n\nAnyway, this doesn’t even matter as it’s more about the range of the vehicle than the speed or acceleration. Electric motors are more efficient than combustion engines. They always have been. Also, they have near-constant torque over their whole RPM range and therefore typically don’t need a geared transmission to hold them in the sweet spot.", "score": 3, "replies": []}, {"body": "\"energy per inch\"\n\nLol", "score": 3, "replies": []}, {"body": "Energy per inch? That's a new one.", "score": 1, "replies": []}, {"body": "Even the gasoline engine is only 60% efficient at converting the amount of energy in the fuel. Heat and noise are all wasted energy sent directly into the ambient area rather than propelling you forward. By the time the engine moves the person and his/her cargo, it's less than 1% of the energy of the gasoline consumed. (EDIT: apologies, approx 1.5% depending on weight of the fatass(es))\n\ndownvotes 4 science.\n\n>Less than 30 percent of the energy from the gasoline you put in your car is used to move it down the road. The rest of the energy is wasted as heat and sound, or used to power accessories, like headlights, radios, and air conditioners. Because typical vehicles weigh around 3000lbs and typical people weigh around 150lbs, only about 5% of the energy gasoline translated into motion is used to move the driver, which amounts to just 1.5% of the total energy in gasoline.\n\nsauce former GM VP of Research: https://www.amazon.com/Autonomy-Quest-Driverless-Car-Reshape/dp/0062661124\n", "score": 0, "replies": [{"body": "Less than 1%? Fucking lol, no it is not.", "score": 2, "replies": [{"body": "> Less than 30 percent of the energy from the gasoline you put in your car is used to move it down the road. The rest of the energy is wasted as heat and sound, or used to power accessories, like headlights, radios, and air conditioners. Because typical vehicles weigh around 3000lbs and typical people weigh around 150lbs, only about 5% of the energy gasoline translated into motion is used to move the driver, which amounts to just 1.5% of the total energy in gasoline.\n\nVERY sorry I did say less than 1%, when the cited source states 1.5%. Unintentional error on my part.\n\nAlso VERY sorry but I think I'll side with the former VP of Research & Planning of GM & top-advisor to Waymo vs. your \"fucking lol\" academia, professor. ", "score": 1, "replies": [{"body": "You mean the source that just proved you wrong? ", "score": 1, "replies": [{"body": "Wait ... You're referring to my \"under 1%\" vs \"1.5%\" ? Which is a rounding error and could change based on the weight or number of passenger(s)?\n\nDon't even try to act like the 0.5% diff is close to whatever calculation your undoubtedly amazing knowledge of automotive transportation came up with lol. On what authority do you have to even doubt the figure? Did it just seem unreasonable to you? So now you just reject things you have no fucking clue about? Lmao. Oh sweet child.\n\n\nBut no problem, you learned something today, glad I could help someone understand how terribly inefficient the current vehicles are at moving humans. Go buy some GOOGL shares and ride the Waymo future. ", "score": 1, "replies": [{"body": "You made a 50% error, that's pretty far off bro.", "score": 1, "replies": [{"body": "REEEEEEEEEEEEEEEEEE", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "A car that gets 100 percent of its torque right away won a drag race? Huh who would of thought.... ", "score": 66, "replies": [{"body": "I am hyped for the new roadster. A real sport car with electric torque", "score": 18, "replies": [{"body": "Rimac has existed for years", "score": 5, "replies": [{"body": "Finally i see that name pop up. Nevermind tesla, the Rimac has been an electric hypercar for some time now.  ", "score": 4, "replies": []}, {"body": "But does it have funding secured?", "score": 1, "replies": []}]}, {"body": "They've done it already, but they discontinued them.", "score": 1, "replies": [{"body": "No I am talking about the new 2020 roadster ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It was just an eletric lotus", "score": 2, "replies": []}]}]}]}]}, {"body": "It's also a c6 Corvette, it's at least 6 years old at this point.", "score": 15, "replies": [{"body": "I don’t think that would make a huge difference at this point car technology hasn’t changed that much. I’m building a 1966 mustang right now and they sit at around 2,800 pounds giving me a lot more power/weight ratio. An electric sports car will almost always win though.", "score": -6, "replies": [{"body": ">car technology hasn’t changed that much\n\nBruh, **Hyundai** is shitting out hatches with 275hp and 260 ft-lb torque.\n\nYour 66 Mustang weighs more, and puts out the same power and torque in an engine twice as big.", "score": 9, "replies": [{"body": "My mustang is 300 pounds lighter then the Hyundai veloster which a quick google search would show you its 3100 pounds. But mine has a small block 331 that’s putting out 350ish horsepower at the crank... if it was stock the Hyundai would win but vintage cars and in general very light because they have no computers or safety shit. That Hyundai has to deal with crumple points and etc. I actually just re googled 1966 mustang curb weight and it claims it’s 2450 pounds which seems too light to me. Also if you looks at the dimensions of a 1966 mustang and a veloster they are very similar in size. ", "score": 1, "replies": [{"body": "Lol Fucking mustangs", "score": 1, "replies": [{"body": "All I was trying to say is that cars are still similar enough in design that 6 years isn’t going to change jack shit. I can bolt up modern parts to an engine from the 60’s.... Its the worst option when it comes to price for performance but the people buying cars from the 60’s and restromodding them aren’t looking for the best price performance ratio.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "I think the word would be high angular jerk, the rate of change for the torque. ", "score": 1, "replies": []}, {"body": "Not really, the corvette beat him off the line by quite a bit.", "score": 1, "replies": [{"body": "Batteries are heavy as fuck", "score": 7, "replies": []}, {"body": "That doesn’t change the fact that electric vehicles have almost full torque right away.", "score": 1, "replies": []}]}]}, {"body": "Long tsla ", "score": 13, "replies": []}, {"body": "Heavy awd sedan with instant on torque beats light rwd car on street tires, news at 11. ", "score": 24, "replies": []}, {"body": "9 year old $65k car loses to brand new $65k* car.\n\nAnd the crowd goes mild.\n\n*Price includes $1,200 delivery fee.\n\nThat being said electric cars fucking rock.", "score": 50, "replies": [{"body": "$180k in Australia ", "score": 8, "replies": [{"body": "I assume in AUD? ", "score": 1, "replies": [{"body": "Nah dallaroos ", "score": 3, "replies": []}]}, {"body": "Which one? Also [DAAAAAAAAMN!](https://giphy.com/gifs/friday-myposts-ddd0HBTakik00)", "score": -3, "replies": [{"body": "Model s ", "score": 1, "replies": [{"body": "Oh, the Model S is anywhere from $77,000 to $153,000 here in the states.\n\nThe one in the video is the Model 3 Performance which is anywhere from $65,200 to $73,700 here in the states.", "score": 6, "replies": []}, {"body": "But the one in the video is a Model 3.", "score": 1, "replies": []}]}]}]}]}, {"body": "Model s is the fastest 0-60 sub 200k but they don’t handle as well as gas cars. Well they feel fat compared to things like miata", "score": 22, "replies": [{"body": "There are lots and lots of gas cars that don't handle as well as a Miata, though. ", "score": 39, "replies": [{"body": "Ya but the model s feels extra fat.  I think it weights about 3x a Miata", "score": 2, "replies": [{"body": "Nah. Only 2x", "score": 7, "replies": [{"body": "Only...", "score": 2, "replies": [{"body": "Miata is 10x my motorcycle.      \nSo... ¯\\\\\\_(ツ)_/¯     \n      \nEdit: it’s actually 6x the weight. ~2,400 lbs. vs ~400. ", "score": 3, "replies": [{"body": "I bet you rev the engine just to hear the reeee...", "score": 2, "replies": []}]}]}]}, {"body": "That's because the tesla carries most of its weight underneath the car in the center. Then for the miata they put a faggy little go-kart engine in the front so retards pretend they have a sports car. ", "score": 7, "replies": [{"body": "Don’t hate on the Miata. Best sports car hands down under 35k. Also one of the most reliable ones out there excluding the first gen 2016s", "score": 9, "replies": [{"body": "Mazda makes great cars. I have one of their SUVs, best vehicle I’ve ever owned. Handles far better than anything else I test drove. I wish they still made pickups because I’d totally buy one. ", "score": 1, "replies": [{"body": "Hi, dad!", "score": 5, "replies": []}]}, {"body": "The miata is a boring slowmobile built so middle class dads who spent their entire lives driving driving camry's can have a midlife crisis and buy a \"sports car.\" It doesnt even get close to 100 mph in the quarter mile. It gets beat to 60 mph by the new f150s. ", "score": -4, "replies": [{"body": "Try turning any of those f150s at 60", "score": 2, "replies": [{"body": "Miata maxes out at .88 lateral g's on the skid pad so maybe dont jerk off over slightly above average cornering ability. Also I'm not sure I'd want to brag about my car handling better than a full size pickup. ", "score": 1, "replies": []}]}]}]}, {"body": "Sports cars aren't about necessarily about power, they're about handling and being lightweight. Don't say that shit in /r/cars lol", "score": 4, "replies": [{"body": "Ya lost me at the 3rd \"about\".", "score": 6, "replies": [{"body": "Regardless, a 180 HP Lotus Elise is a sports car, a 707 HP Challenger Hellcat is not. 500+ HP difference doesn't matter in the classification.", "score": 7, "replies": [{"body": "I'm with ya, my dude. Am motorcyclist.     \n     \nPower-to-weight ratio is 👌", "score": 5, "replies": [{"body": "Ayyyy do you frequent /r/calamariraceteam?", "score": 3, "replies": [{"body": "Ha. Fucking squids. Love that sub.    \n    \nI never learned to do much more than woolies. Some of those stunt guys are incredible, and the idiot posts in that sub are hilarious. It's not unlike the autists here. Plenty of autists making brilliant trades, but many idiots being stupidly funny. ", "score": 3, "replies": []}]}]}]}]}, {"body": "That's just something people with slow cars say. Like \"true beauty is on the inside\"", "score": -3, "replies": [{"body": "What do you drive?", "score": 1, "replies": [{"body": "18 mustang gt.", "score": 0, "replies": [{"body": "Enjoy oversteering into a crowd of onlookers as you leave Cars and Coffee.\n", "score": 6, "replies": [{"body": "I will, thank you! Fun fact - the mustang gt actually corners faster and pulls more lateral g's than the miata. The reason the miata doesnt have any oversteer is because the tiny little engine cant push enough power to the wheels to make it happen. ", "score": 0, "replies": [{"body": "It's clear you've never driven a ND Miata, oversteer is very easy lol. ", "score": 3, "replies": [{"body": "You're right I've driven maybe 20 miles in a miata a couple years ago. Im mostly just talking shit for fun. I mean they're kind of pussy cars but I dont actually hate them. ", "score": 1, "replies": []}]}, {"body": "Eh, I've never had any problem getting my friends 92 NA to slide, you just need to make sure you've got it revved nice and high.\n\nI'm just teasing you, I've got no stake either way in the argument.  17 Focus RS here whaddup Ford fam.", "score": 1, "replies": [{"body": "The bitches at the dealership wont even let me test drive the rs. Even when I was there with cash in hand to close on my mustang gt they told me you only get to drive the rs if you're actually buying it. They said market demand for that car is so high that they made the decision to keep them virgin until they're actually sold. \n\nI've heard nothing but praise for the rs but I've never actually been able to drive one. ", "score": 2, "replies": [{"body": "That's wild!  I had never heard that before.  Yeah, I have nothing but good things to say about the car.  It feels SO GOOD in the corners.  It's also super entertaining when the fake anti-lag kicks in and makes the exhaust pop.  Keep your eyes peeled for used ones; they'll let you take it for a spin.  I'm really bummed they're ending production in the US after this year.\n\nI've gotta hop behind the wheel of a Mustang at somepoint.  I've heard especially with recent models they've gotten the handling to a much better place than it used to be.  I do really like the styling of the newer ones as well.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Which also is why I like driving the model 3 more than the model s. The performance model s has better acceleration, but the model 3 is more fun to drive imo since it feels more nimble as a smaller car with its shorter wheel base.", "score": 8, "replies": [{"body": "Go back to Europe. If you value anything above straight line drag speed you're basically a communist. ", "score": -1, "replies": [{"body": "Motorcyclist here.     \n    \n¿porque no los dos?", "score": 2, "replies": []}]}]}]}, {"body": "I still can't believe that musk was the first to figure out that if you made an electric car *fast* then maybe it would sell more. ", "score": 13, "replies": [{"body": "The big insight was giving them enough range, even if that cost a fortune in batteries. Everyone else who tried electric was selling $30k cars with no range to greenies. They figured that was the only market. Nope...techbros.", "score": 11, "replies": []}]}, {"body": "I'd still take the Corvette. It came in .03 seconds slower but almost 7 mph higher trap speed. ", "score": 14, "replies": [{"body": "Vette would crush on a rolling start, no doubt. But instant torque at any speed is much more fun on a day-to-day basis.", "score": 10, "replies": [{"body": "I would argue no. Have you ever driven a vette? For me it is the sound plus the acceleration that makes the car. Model 3 just looks ugly af too, but that's preference I guess. Vettes are really fun to drive, especially on curvy roads.", "score": 9, "replies": []}]}]}, {"body": "I drove 400 miles non stop in a Corvette though.", "score": 3, "replies": [{"body": "roadster will do 600", "score": 2, "replies": [{"body": "There is no roadster 2 yet. What is also important is charge vs. tank rate. With the same supercharger power the roadster will full charge \\~2 times longer.", "score": 2, "replies": []}]}]}, {"body": "Remember when you had a remote control car as a kid and it would go flat out for 4 minutes then you had to wait 4 hours for it to charge? Yeah it's the same with a Tesla...", "score": 3, "replies": []}, {"body": "I know the owner of that vette, funny seeing this here.\n\nAlso, this is at altitude. That Vette would be about 1 to 1.5 seconds faster at sea level. Tesla loses no power at altitude. ", "score": 3, "replies": []}, {"body": "Let's see the Tesla do it 5 times without going into limp mode when the battery gets too hot.  ", "score": 7, "replies": [{"body": "Gas cars overheat too... Was on a race track and Corvette had the hood open to cool down after a few laps", "score": 3, "replies": []}]}, {"body": "Chevy Bolt is the competition.", "score": 3, "replies": []}, {"body": "Waz the Corvette driven by a pedo?", "score": 4, "replies": []}, {"body": "All that torque.", "score": 1, "replies": []}, {"body": "$nio would crush both ", "score": 2, "replies": [{"body": "I m still waiting to see a nio car ", "score": 3, "replies": [{"body": "so is Nio", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Oh my god you’ve cracked the code! Philosophers have argued about this since the time of Socrates. Who would of thought that it was a random guy on the internet to figure out people can have more then 1 hobby....", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I fully understand the point it’s just a retarded comment to make.", "score": 1, "replies": []}]}]}]}, {"body": "Source: https://www.teslarati.com/tesla-model-3-performance-vs-chevrolet-corvette-drag-race/", "score": 1, "replies": []}, {"body": "\"Telsa beats 65 year old man in drag race infront of his step-children\" would have been a better title.", "score": 0, "replies": []}]}
