{"title": "Easy question: Is Apple a good buy now?", "selftext": "Just curious to hear some opinions on Apple. I currently own Apple, and bought it around $120. Watched it march up above $225, then tank with the rest of tech. But unlike my Amazon which is looking like a sucking chest wound with a 98 P/E, Apple is at 15.9.\n\nI guess I'm wondering what price point you think buying more Apple makes sense?", "id": "9ylzs8", "created_utc": 1542668199.0, "score": 102, "upvote_ratio": 0.89, "num_comments": 149, "comments": [{"body": "I bought at 167 and I remember reading how anyone who buys at 167 is an idiot and that is a ludicrous price, so just buy and either average down or be happy", "score": 48, "replies": [{"body": "I bought AAPL during the IPO at $22. I’m writing this with my mind using technology only available to billionaires. People said I was nuts to invest in a company named after a fruit but I took the plunge anyhow. Now I bathe in money and own a yacht, a train, a submarine, a jet, and a dinosaur.\n\nIt’s your call, OP.", "score": 51, "replies": [{"body": "It’s sad that more rich people don’t own trains. ", "score": 15, "replies": [{"body": "[so sad.](https://i.imgur.com/00OJ2.gif)", "score": 7, "replies": []}]}, {"body": "Weak.", "score": -6, "replies": []}]}, {"body": "Given the price action in the market, it looks like a test of the of the October lows is likely and if that level doesn't hold then the market could go lower to the February lows. That's not a prediction, just a likely possibility.\n\n AAPL is now down 20% and as a stock, that's a bear market. Although it's been hit because of the reaction to results last quarter and the fact that they will no longer be breaking out unit sales, the sales were still strong and the service revenue continues to show strong growth...it should be fine when things settle out.\n\nBuying a little now might be okay if your cost basis is higher or you want to start a position, but I would rather wait for the market to turn around or if AAPL has some bad news and the stock doesn't go down as that's usually a sign of a bottom.  ", "score": 2, "replies": []}]}, {"body": "I've been long on AAPL since 2016. I got in at $96 and I'm never getting out. Not buying anymore right this second either.", "score": 23, "replies": [{"body": "When *would* you buy?", "score": 5, "replies": [{"body": "When it hits 96$ again by his logic.", "score": 30, "replies": []}, {"body": "Honestly, now is as good a time as any I imagine. I doubt it'll drop enough to justify waiting much longer. If you are going for the $LONG APPL then it doesn't much matter if it drops a little more. There is still plenty of room for big growth in the long-term.\n\nI'm not buying any this second because I don't have the capitol to increase my position any meaningful amount.", "score": 6, "replies": [{"body": "I guess a good indicator would be the next iPhone. Since pictures look so good on the current screen size and the resolution is great, how can you really digitally improve the camera? Is there a way to make the camera any better without ML and instant post-processing? Is the iPhone reaching Nokia territory? They went for smallest phone, but Apple and Samsung are trying to sell as big as a phone possible? Are we just reaching plateaus and have to be satisfied with the development and have to be stuck with it for a long time?\n\nThe combination of FAANG technology merging is reaching an end, and the synergy of the technologies full stacks are simply great enough and fulfilling their potential. I hope this \"bear market\" will bring something new to the game, as buying pants recommended from your FaceBook friends on your iPhone from Amazon based on reviews from Amazon is getting old, but not stale.\n\nI think the biggest error of Apple long term will be their focus on hardware specs rather than on human aspects of the software.", "score": 1, "replies": [{"body": "There is a upcoming super cycle with 5g on the horizon. The next iPhone or the one after it will have it. Apart from that I see more growth potential for tablets and smartwatches, writing this on a iPad Pro 12“ and it’s a good device with plenty room for improvement same for the Apple Watch. I like that, it means they can sell a better version next year without making people unhappy now.\n\nThey also have no real competition there unlike with phones. Android SmW ... not great products generally. Even the good ones get abandoned and become deprecated real quick.", "score": 1, "replies": [{"body": "What can you do with 5G vs 4G on an iPhone or any other consumer device? 5G is post consumer. It is for high risk industrial operations that require ultra low latency and may pave the road for stuff like autonomous driving. \n\nAnyways, the Apple Watch seems to be doing great.\n\n\"UBS expects the Apple Watch market to grow even more next year, however, with a 40% year-over-year increase to about 33 million watches sold across the year predicted.\"\n\n\"The most impressive part about Apple Watch sales is the estimated 57.5% YoY growth for the holiday quarter and 55.9% YoY growth for 2017. This data lines up with a Canalys report we saw last month and tracks with the vague details Apple shared during its last earnings call.\"\n\nI guess people who have a 1000 dollar phone may have the purchasing power to add a 400 dollar accessory to compliment their Apple lineup. I have tried the Watch, and have reverted to a traditional watch, as I find the device too nerdy and gimmicky like their \"Pro\" Touch Bar, but it makes sense to buy an 400 dollar watch instead of going for a 4000 dollar or more Rolex. The watch market is simply a 40 dollar Timex, or a 400 dollar Apple Watch or a 4000 dollar Rolex.\n\nTablets. As much as I love cellular portability on my main device, the hardware doesn't seem to get support from the software on those devices. I can consume a lot on the iPad and monitor stuff, but I can't really create on it. Difficult to do hardcore stuff like databases and programming. Cumbersome to do spreadsheets and trying to use fingers on huge rows of information is challenging. I'm testing most of the devices, including phones, in order to scrap laptops and desktops, but I am still typing on this traditional computer. The user base for desktop/laptop has barely changed in the last 20 years.\n\nContrary to the Watch, they are not entering a new market, and the iPad hasn't really hit any new territory since the 2013-2015 plateau. I think they are hitting a wall with their limited software, and most reviewers share my point of view. I haven't really been into the iPad since 13-15 myself, and still rock a iPad Air 2, which is good enough for consumption and light productivity, which the new models are great at too.\n\nI think the difference between Android and iOS, is that the iOS devices still have a life after a few years due to software updates contrary to the fragmentation in APAC and Google devices.", "score": 2, "replies": [{"body": "I agree mostly, with regards to tablets especially. The thing is I see the potential in the hardware now, it just takes time for the professional software to catch up. \n\nFor example I was looking for a powerful image processing app, something like Photoshop or gimp, that doesn't seem to exists beyond photo editing. So I ordered a Surface pro for our company where we needed that. Last week however I read that Adobe will release full feature Photoshop for the ipad, that would have affected my decision, to late for us, but it will increase the use of iOS quite a bit.\n\nI hope that with the power the current mobile chips have and some big names paving the way we will see more serious apps coming to the ipad the next year or two. I am aware that doesn't affect this quarter or even the next couple, but it gives them a nice long-term perspective.", "score": 1, "replies": [{"body": "In a professional setting I wouldn't want to be an early adopter.\b I think the Surface Pro was a good choice, and while you have computers that you know will work for the near future, you can monitor how PS will actually pan out on the iPad. I got burned switching to Mac when they went with Intel, and with Rosetta emulation, even a 300 dollar Windows desktop could burn laps around the new Intel Macs in Adobe apps.\n\nComparing ARM vs x86 is impossible as the existing software on x86 has many years of tried and true solutions compared to ARM. ARM in devices you can pick up from the shelves are simply consumer goods and I think touch gestures are not as established as keyboard/mouse right now. That may change, but I wouldn't gamble on it in a professional setting. Despite of the iPad being in is ninth year of existence, it has still to show that it can be a productivity tool outside of niches, like drawing with the pencil, and be a fulfilling tool like the laptop with broad cases of usage.\n\nAs much as I love upgraded specs and pure power in any device, I fancy how a computer appeals to me as a human. Innovation is progress, but it doesn't mix with ruthless ambitions, and it will never take the throne from intuition. Interacting, rather than arguing, with a device is what made Apple the most valuable company in the world in 2011, but I'm still wondering if it was cheap credit that made Apple a trillion dollar company.", "score": 1, "replies": [{"body": "All true. I’m perfectly fine with wait and see on the iPad, I just see the potential in the hardware now, the new apple processors are absolute beasts. But to develop the potential into an actual use case we need professional software, and that means relying on third parties that don’t necessarily care about delivering a good product on what is a niche device now.\n\n", "score": 1, "replies": []}]}]}]}, {"body": ">writing this on a iPad Pro 12“ and it’s a good device with plenty room for improvement\n\nCan I recommend you try the Microsoft Surface? It's amazing. It's pretty much a tablet and a PC combined. You can install anything and everything on it.", "score": 1, "replies": [{"body": "I just ordered one for my job, I'm intrigued by it but do not have use case for it privately as I have a proper workstation at home and do not desire lengthy typing sessions on the couch.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "You can initiate a small position now and wait to see how Q4 results and 2019 guidance will look like in January. Right now, traders are throwing a fit because they don't like how Apple is going to hide their units sold figures in future earnings. Lower, revised expectations going into 2019 may also help set the bar lower for a beat. Personally, I want to see some news on the development of Apple Car because that will be the next major catalyst for the company after the iphone. ", "score": 55, "replies": [{"body": "That's the thing. Apple just doesn't excite me as a company any longer. They IMPRESS the hell out of me, but I'm less and less impressed that they are increasingly becoming a services company.\n\nThey have enough money to buy the next creative company. I just wish they still were THE creative company.\n\nSo, I guess that's part of my concern. Do the numbers show it's a good buy? And is Apple still the company that made it what it is? (In other words, LONG TERM will Apple continue to innovate?)", "score": 35, "replies": [{"body": "I read they might be working on AR/VR, solid state batteries, and microLED screens. All of those things really excite me.", "score": 12, "replies": [{"body": "None of those things hugely excite me tbh. Micro led screens are just a quality improvement, vr/ar requires high consumer interest and investment, and any battery increases within the world of phones will just end up being sucked up by larger processors so consumers will never see a benefit. ", "score": 1, "replies": []}]}, {"body": ">I just wish they still were THE creative company.\n\nIf they keep going up 20% per year I don't care how creative or uncreative they are.", "score": 5, "replies": []}, {"body": "I think you answered your own question with \"Apple just doesn't excite me as a company any longer\". Long term, you'll make a return of course but personally, I prefer buying into companies I believe in. I've been an avid Apple user for a long, long time and I've experienced more problems with laptops/phones in the last 1-2 years than all combined.", "score": 9, "replies": [{"body": "15-16 PE range? That price to earnings *sounds* boring as fuck.\n\nIt, however, gives me a bit of a chubby. I am buying. A lot of possibilities and far less drama than FB.", "score": 2, "replies": []}, {"body": "\n>but personally, I prefer buying into companies I believe in.\n\nGot any good tips? ;)\n\nI believe in Mercado Libre (MELI) and have made them a significant chunk of my portfolio. The price swings wildly, so there are really good buying/selling opportunities. I have a core amount that I'll hang on to for a long time, but I buy/sell whenever their rollercoaster is doing its thing.\n\nWhat companies do you really believe in?\n\n", "score": -1, "replies": [{"body": "Currently I’m kinda believing in SWCH.", "score": 1, "replies": [{"body": "Oof. That 1-year chart looks bloody.", "score": 3, "replies": [{"body": "Yep.  Bad charts generally don’t faze me.", "score": 1, "replies": []}]}]}, {"body": "Never heard of MELI but I'll check them out for sure. I trade all of the companies I'm long on frequently (chasing 3%-5% returns every other day) which includes: TSLA, AMZN, SHOP, TEAM, DIS, GLUU, SPY. TSLA is my favorite by far  and I mostly trade on volatility. ", "score": 1, "replies": [{"body": "Please let me talk you out of ever day trading Mercado Libre. \n\nIronically, the recent volatility of Mercado Libre is sometimes compared to the volatility of Tesla. Why? Both companies have very polarized sentiment (in the short term) as well as significant sentiment volatility. Both have a decent amount of short interest (MELI \\~ 8%, TSLA \\~18%) as well as high prices for both puts and calls. For a day trader, all of this makes Mercado Libre very attractive.\n\nThe fact that you day trade TSLA successfully means you are smart enough to profit off of the volatility in Mercado Libre. I just don't think it will be worth your time. Why? Mercado Libre has significantly more moving parts than TSLA and is in an market (Latin America) that you are unfamiliar with. \n\nIf you want to day trade it here is where I would start:\n\n* Mercado Libre is basically a combination of Amazon, Ebay, PayPal. Which means you have to keep track of a lot of different revenue streams. They are also moving into brick and mortar stores and money lending. \n* A decent amount of recent volatility has come from the adoption of ASC 606 accounting standards, which impacts revenue recognition. \n* Currencies in Latin America are currently very volatile.\n* Amazon is now competing against Mercado Libre in both Mexico and Brazil. \n\n&#x200B;", "score": 3, "replies": [{"body": "Very well put!", "score": 1, "replies": []}]}, {"body": "What do you think about MSFT?", "score": 2, "replies": [{"body": "I like MSFT but I would wait before entering. In fact, the entire market right now is pretty uncomfortable. Right now, I'm looking to buy TSLA around $340, BAH around $48, SHOP around $125. I'm sure this will change tomorrow though. BAH I don't buy/sell..only buy. I'll scoop more AMZN later in the week if it starts trading up.", "score": 1, "replies": []}]}]}]}]}, {"body": "They still are innovating. If you look at what they’ve always done, like with the iPod and the iPhone, and even their original Apple computers, it’s just taking things that already exist and making them the best in terms of quality and usability. Right now the Apple Watch is *the* smart watch. Look on the street. At least where I’m at, nobody is wearing anything else. \n\nThe services business is much higher margin, and they realized a while back that they weren’t gonna be able to continue growing via hardware. There’s only so much you can charge for a hardware device like a phone. So they started focusing on that to continue driving revenue. That’s a sign of excellent management right there, and it’s post Steve Jobs, which means Tim Cook is doing an excellent job. \n\nFull disclosure, I’m long and waiting until the end of Q1 to buy more. ", "score": 3, "replies": [{"body": "\\+1\n\nAnalysts don't think like you and try to implement same rules to every company. These analysts are the same people that were upgrading every mortgage company that was giving a $500k loan to a McDonalds burger flipper before 2008 crash.", "score": 1, "replies": []}]}, {"body": "Well put. ", "score": 2, "replies": []}, {"body": "> Apple just doesn't excite me as a company any longer\n\nsaid everyone in 2015", "score": 2, "replies": []}, {"body": "Not without Steve Jobs. He brought both innovation and focus to the company. Without him they're lost. What you see now is merely a shadow of what he left behind.", "score": 1, "replies": []}, {"body": "I disagree Apple doesn’t innovate, FaceID is just the beginning. Androids don’t use VSCELs yet and combining a 3D camera with AR will revolutionize everything. Imagine the App Store being reborn. This will even lead to self driving cars IMO. People think Nividia processors are the answer but I think it’s actually apple’s FaceID laser capabilities. LiDar and 3D sensing.", "score": 1, "replies": []}, {"body": "that's because tim cook is a caretaker not an innovator. as a CEO he hasn't pushed the company to innovate in any new creative ways despite their stockpiles of available cash. he's just there to crank out iphones and he's even failing at that as evidenced by the various reports and their decision to hide iphone unit sales. ", "score": 0, "replies": []}]}, {"body": "I think the Apple Watch is honestly the next catalyst. I think they'll become as ubiquitous as iPhones. Also, perhaps their rumored glasses tech ", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "False. There's a lot more room for adoption.", "score": 3, "replies": []}]}]}]}, {"body": "My Finance professor would roll his eyes at the comparison between Amazon's P/E to Apple's.", "score": 11, "replies": [{"body": "I get it. Growth, yada yada yada.\n\nI'm probably older than you. MY finance professor would've had a STROKE at the sky-high P/E ratios we commonly see now. But hey - markets and market sentiments change over time, right?", "score": 11, "replies": [{"body": "Yeah, it's totally different this time. Wink. Check 2000-2001 P/E charts for reference. ", "score": 6, "replies": []}, {"body": "Nah, PEs slowly coming back to earth", "score": 4, "replies": []}]}, {"body": "I just don’t see amazon being able to double sales again and have a revenue 60-70% greater than Walmart has currently. This is what is implied by its current price. \n\nIf the argument is that it isn’t a retail company, then it should split up. The odds of them being able to do a dozen things very well are slim. ", "score": 3, "replies": [{"body": "Combine the small companies, split the big ones, makes perfect sense.  Upper management written all over you.", "score": 1, "replies": []}]}]}, {"body": "Yes. It's a good buy right now. That isn't to say it won't drop more. However, AAPL has a fortress balance sheet. Your dividend will keep growing and management will keep buying back shares. I just looked up their stats on morningstar. Their ROIC has averaged around 25% for the last 10 years. That's almost twice that of the S&P 500. \n\nNot to mention, the best value investor of our time known to hold his shares for decades has bought close to $60 billion of AAPL over the last year. If you're holding for the long term, these prices will generate solid returns. I don't own any AAPL shares directly, but I've bought a decent chunk of BRK.B this year. Essentially 10% of my BRK.B holdings are now AAPL. ", "score": 6, "replies": []}, {"body": "yes it is", "score": 21, "replies": [{"body": "Why?    Is iPhone sales not going to continue to slow as replacement cycles increase?", "score": 0, "replies": [{"body": "Yes. But it doesn’t matter, they have multiple growing revenue streams. ", "score": 7, "replies": [{"body": "Enough to counter the iPhone sales decreasing?\n\nThink iPhones are still over 50% of their revenues.", "score": 1, "replies": [{"body": "Sure. Sooner or later phone sales are going to slow down. You buy AAPL for their innotion. In 2001 everyone was worried laptop sales was going down, then we got the iPod, then iPhone, iPad, Apple Watch, HomePod, etc. For their EPS, this is an amazing price for such company. Stop looking at day to day prices, check back in a couple years. ", "score": 2, "replies": [{"body": "\"innotion\"\n\nInnovation?    I kind of hope not.   We have not seen any innovation out of Apple for a while now and do not think that is going to change.\n\nHomePod is a poor product that is not selling well.  It uses Siri which is a joke.   It is now to a point they might have to change the name of Siri after fixing.\n\nPlus the HomePod has poor margins on top.\n\n\"Apple HomePod build cost hints at thin margins\"\n\nhttps://www.slashgear.com/apple-homepod-build-cost-hints-at-thin-margins-14519606/\n\nApple has really let themselves fall really behind in AI which is scary.\n", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Easy answer: yes.", "score": 5, "replies": [{"body": "Why?   Is iPhone sales not going to continue to slow?   Why do you think it is a buy?", "score": 1, "replies": [{"body": "Every product eventually slows in sales, but the iPhone is the foundation for Apple Services that is growing double digits. People will not leave their house without their iPhone and will eventually upgrade after 2-5 years, but laptops and desktops could get the job done for 6-10 years. ", "score": 2, "replies": [{"body": "\"Every product eventually slows in sales \"\n\nWell that most certainly is NOT true.  \n\nBut the point was more that Apple needs to transition to more recurring revenues.   The phone subscriptions where you get a new iPhone each year is a great example.  That way you are increasing each year instead of declining.\n\nYou look at Google financials for example.\n\nhttps://www.statista.com/statistics/267606/quarterly-revenue-of-google/\n\nSee how it has gone up every quarter since day 1?    As in YoY for every quarter including through the recession?   That is what they need to thrive for.\n\nThey are now growing at over 20% and just rolling out Waymo which can then continue to fuel the growth for a very long time.\n\nThey will NOT sell the cars but instead use for a service and that will keep it increasing indefinitely.   IF they instead decided to sell the cars then you get into the situation that Apple finds itself.\n\nGoogle does this with many things.  They have the most powerful AI chips you can get but will NOT sell them.  They rent them out.   That way you have recurring revenue that just keeps growing quarter after quarter.\n\n\n\n", "score": 1, "replies": [{"body": "Google is paying Apple 9 Billion to stay relevant on a product that everybody is saying is dying.\n\nhttps://searchengineland.com/report-google-to-pay-apple-9-billion-to-remain-default-search-engine-on-safari-306082", "score": 2, "replies": [{"body": "That is the rumor but Google has indicated that will now decline as it is tied to TAC.   Google has the competition almost gone something will be able to.\n\nHeck Bing lost 25% of their market share in just the last 2 months.\n\nhttp://gs.statcounter.com/search-engine-market-share\nSearch Engine Market Share Worldwide ...\n\nbing down to 82 bps on mobile.  Not enough to have a viable product.\n\nhttp://gs.statcounter.com/search-engine-market-share/mobile/worldwide\nMobile Search Engine Market Share Worldwide | StatCounter Global ...\n\nSearch is an AI application today and you have to have users.  Smart to get rid of the competition and then do not need to pay.", "score": 1, "replies": [{"body": "The price keeps going up every year on a product that is dying.\nGoogle may have paid Apple $3 billion to remain the iPhone's default search engine\nhttps://www.businessinsider.com/google-paid-apple-3-billion-remain-iphone-default-search-engine-analyst-estimate-2017-8", "score": 1, "replies": [{"body": "We do not know as it is not disclosed.   But Google has shared on ER will no longer increase but instead decrease.  I now get it as they are killing off the competition.\n\nBing down below 1% on mobile\n\n\nhttp://gs.statcounter.com/search-engine-market-share/mobile/worldwide\nMobile Search Engine Market Share Worldwide | StatCounter Global ...\n\nBut Google has so many other things like Waymo for example.\n\nGoogle has never declined for a single quarter YoY.   Compared to apple bumpy and negative outlook.", "score": 1, "replies": [{"body": "Google does not like to admit that they have to pay money to the competition while Android sinks into the FRAGMENTED mess that is Android land.", "score": 1, "replies": [{"body": "What?  Where in the world has Google taken any position? \n\nBizzare.\n\nThe fact is Apple financials are choppy and Google has never had a single quarter where they did NOT grow YOY and that was even through the great recession.\n\nTake a look at the chart.\n\nhttps://www.statista.com/statistics/267606/quarterly-revenue-of-google/\n\nDoes not get any prettier then that.\n\nGoogle has now put up over 20% growth for the last 8+ quarters in a row.  But the big thing is they are just starting to roll out the self driving taxi service where they have up to 82k cars on order.\n\nSelf driving technology is worth more than a trillion a year in revenue when you factor in transportation and shipping/logistics.\n\nBut it will take a long time so nice fuel to keep the incredible growth going.  That is the problem for Apple  Where are they going to get growth with the iPhone replacement cycles getting longer?", "score": 1, "replies": [{"body": "https://www.statista.com/statistics/234529/comparison-of-apple-and-google-revenues/\n\nGoogle has to double everything to match Apple that just stays stagnant. Google cant grow the market share in search engines considering the fact they are the backbone of the internet. All google does is buy one company and hopes it works out and if it fails they sell it. Boston robotics and NEST come to my mind.\n\nI like Google, but you make it sound like as if this company is the answer to anything and everything because of SDC that every other company is putting their efforts in. Other companies are not full of bunch of retards and will put up a competition. \n\nApple services Growing double digits.\nApple watch is the only brand people actually use and buy even with so many cheap Android watches that failed.\nWarren Buffet knows what he is talking about.", "score": 1, "replies": [{"body": "Google is half the age of Apple.   When Apple was the same age they were of one hundredths of the size of Google.    Apple started in 1976, BTW.\n\nBut if we look at size we can see that Google will overtake Apple in revenues in less than 5 years.  Earlier with profits.\n\nIn the last three years Google will more than double profits while Apple, whose year has already ended, has increased 10%.\n\nhttps://www.statista.com/statistics/267728/apples-net-income-since-2005/\n\nBut that is all the past.  It is all about the future.   Google just has a lot more things to keep the growth going while Apple is really dependent on iPhone sales.\n\nWaymo for example will be going after an opportunity that is over a trillion a year.\n\n\"Other companies are not full of bunch of retards\"\n\nThat is NOT a word people use.  It is offensive.  Are you 12?\n\n", "score": 1, "replies": [{"body": "Go tell WARREN BUFFET he doesn't know how to pick stocks. FYI, WB added another 500k Apple shares which was reported last week.", "score": 1, "replies": [{"body": "Warren Buffet purchased IBM.   I am NOT exactly sure the relevance?\n\nBTW, if he added then he has lost a lot of money.   Apple is down to $177 from $233.   That is over 20% decline in a pretty short period of time.\n\nBut honestly we are looking at things going forward and NOT the past.\n\n\n\n", "score": 1, "replies": [{"body": "ok, I'm going tell Apples execs that they should prepare the bankruptcy papers because they are done. ", "score": 1, "replies": [{"body": "Apple will NOT go bankrupt.  Do not worry about that.  Heck IBM is still in business.  BTW, another company purchased by Warren Buffet.\n\nBut you might not get a ton of appreciation.  You will get a nice dividend like IBM.   Would think a little more like IBM a decade or so ago.   Might end up similar.\n\nThere is other investments that will probably get you a better return.  A great example is Google.\n\n\"Warren Buffett buys $10bn IBM stake\"\n\nhttps://www.theguardian.com/business/2011/nov/14/warren-buffett-buys-ibm-stake\n\nThat was 2010 so maybe Apple is like IBM in 2010.   \n\nFunny WB biggest mistake he has indicated was not buying Google and Amazon.\n\n\"Warren Buffett: I was wrong on Google and 'too dumb' to appreciate Amazon\"\n\nhttps://www.cnbc.com/2017/05/06/warren-buffett-admits-he-made-a-mistake-on-google.html\n\nI know he is your idle.  Is it like \"Lets be like Warren\"?", "score": 1, "replies": [{"body": "He did admit it was a mistake not buying it, but he could of easily bought both of the stocks and he didn't. Probably did not see what you see in google. Did he make mistake with IBM? Yes, but he is still the best investor because the bottom line says he is that good.", "score": 1, "replies": [{"body": "The point was that he makes mistakes.   It is appearing like Apple is looking more like IBM when he purchased.\n\niPhone replacement will continue to slow.    Not go bankrupt and NOT cut back dividend.   But not much upside like other options including Google.\n\nFull disclosure.  I own Apple and have for well over 10 years.   Made a ton of paper money.  But does NOT take a rocket scientist to see what is happening.      I am just someone that does not get caught up with emotions.    Also own Amazon and Google.  Both not long after their IPOs.   To me it was obvious.\n\nFuture is Google and Amazon a lot more than Apple.  Love Amazon but hate crazy pricing.   Google is better as dirt cheap and incredible opportunity.    Google forward PEG is less than 1.0.\n\n", "score": 1, "replies": [{"body": "No emotions. \n\nI buy and keep buying with real time observation. My niece ran around the house because she found out she was the same age as the iPhone her exact words \"Mommy mommy, guess what?? I'm the same age as an iPhone. How cool is that?\". Apple store is the only store at the dying malls that still has foot traffic. I saw a coworker regret buying a Microsoft Surface and saying \"Damn this MacBook Pro is amazing\" after buying back in the Apple world. I saw a coworker not tell the wife about purchasing iPhone and hide it in a case. I always hear coworkers complaining about the plastic POS PC computers at our work and always talk about last company where they had Apple computers, but nobody complains about having to use Apple instead of PC. Every year another app comes out that destroys another industry like UBER and all of these new cool companies are working on iPhone and pumping money into Apple services. Fortnight existed but it became ridiculously popular overnight once they made iOS version.\n\nI will burn it all down, when the consumer turns their back on it and right now that is not the case.", "score": 1, "replies": [{"body": "\"No emotions. \"\n\nGood.  I see it all the time.  NEVER fall in love.  I see it a lot for some reason with Apple.  I have owned for over a decade and made a ton of money but can still think critically.\n\nI run into this discussion all the time on the iPhone.  I have 8 kids and every single person in my house either has an iPhone or a Pixel.    I actually carry one of each.\n\nThe question is NOT the iPhone being popular.   That is actually the curse.   The problem is the replacement with them popular is and will continue to slow down.   Apple revenue is dominated by iPhone sales.  So being super popular is why the future is looking questionable.\n\nThat is what you are missing, IMO.\n\nPlease realize the iPhone will stay popular and will not make any difference with the decline.   PC sales stayed popular and the Dells, HP, etc all declined.\n\nApple should have transitioned a lot more while they could.  Try to be more like Google and/or Amazon where you have a chart like.\n\nhttps://www.statista.com/statistics/267606/quarterly-revenue-of-google/\n\nNow that is beautiful.\n\nGoogle growth has actually accelerated as they get bigger.   Over 20% without any end in site.  But they just rolled out their robot taxi service in Phoenix.  But just one example of their ability to fuel future growth.\n\nApple needs similar things.  Instead of AirPods.   Love AirPods and great product.  But NOT going to move the dial.\n\n", "score": 1, "replies": [{"body": "I listened to you and added Google to my portfolio today and will add a little more down the road.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Google has had the market cornered for a solid 5 years. People still make google their default search engines on Apple products. The reason they pay the money is because iPhone is that much better compared to FRAGMENTED  ANDROID mess. Companies always produce their apps for iOS before Android because the ROI is much better than Android.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "no its not, been hitting ATH recently, most likely will come down along with the whole stock market imo.\n\nBuy low, apple isn't low enough right now.", "score": 2, "replies": []}, {"body": "I won't pretend to be an expert in stock (do please do critique but try to be respectful), but what I can say is a lot of this seems to be correlated to panic sales. People saw it starting to drop like a brick and started selling. This, in combination with talk of increased regulation and oversight by government entities has concerned investors in tech. However, to me this is all just contextual and will come to pass. I firmly believe that Apples management is up to par and I feel like this would be a great opportunity to capitalize on this dip once it bounces back. \n\nHowever, at the end of the day the only piece of truth I've accepted is to never invest more than youre willing to potentially lose. \n\nHope that provided some insight, but I apologize if this all seems \"obvious\"", "score": 2, "replies": []}, {"body": "We may not have reached the best price point to buy yet.\n\nNew Street Research analyst Ferragu predicts that iPhone unit shipments will fall 9% in fiscal 2019, which is in the same ballpark as the 8% drop in 2016. For now, Wall Street analysts are still expecting only a 2% decline in fiscal-2019 iPhone unit sales. If Ferragu is correct, then there is a good bit of downside to go. Using the nearly 30% drop from 2015 to 2016 from the last subpar iPhone cycle, Apple could bottom out in the mid-$160s vs. $176.98 price it closed at today.\n\nIn the early 1990s, Goldman Sachs analyst Dan Benton wrote his rules for successful technology investing that was avidly passed around Wall Street. The list downplayed valuations, for two key factors: 1) “sell technology stocks when estimates are being reduced,” and 2) “buy technology stocks only for positive earnings surprises.”\n\nUsing those maxims as a guide and taking Ferragu's prediction into account, investors should probably wait until the rest of Wall Street fully appreciates Apple’s weak product cycle.", "score": 2, "replies": [{"body": "Thanks for your input.", "score": 1, "replies": [{"body": "You are welcome. Hope the analysis was useful.", "score": 2, "replies": [{"body": "Umm... So, I just noticed the username and the brand-spanking new karma score. Care to give some more info about the team behind your Reddit account and your goals?", "score": 1, "replies": [{"body": "Sure. Thank you for your interest in our team and goals. I’m Jessie Shi, audience engagement fellow at Barron’s. Our team also includes Alyssa Zeisler, managing editor of audience and Alessandra Freitas, engagement editor. Alessandra and I write comments and posts. We send most of them to Alyssa for edits before posting them.\n\nI would like to give an overview of our goals in a different comment soon. Our team talked about  the goals a few days ago, especially about establishing rapport with highly engaged Redditors, but I would check with Alyssa and Ale first to make sure we agree on the details. We are all new to Reddit and are learning by doing. Back to you soon!", "score": 2, "replies": [{"body": "Thanks for the response. I'll be looking forward to seeing your posts. Good luck!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Yes you are dumb if you dont buy it today\n\n&#x200B;\n\nyou had a chance to buy it last week when it was just as low and ppl thought it would never dip but you got a second chance today", "score": 2, "replies": []}, {"body": "I’d stay far away for now, or buy a small position and continue to add I think this has more to drop. That stunt they pulled, withholding iPhone sales was a huge blunder, you may not think it’s that bad but it matters more what the titans holding millions of shares think. Less transparency is never something that puts investors at ease. Huge ball drop from an otherwise outstanding company. To this day...what were they thinking?", "score": 2, "replies": [{"body": "I think its pretty obvious why they are withholding numbers. They took a calculated risk that the stock \"fallout\" from them doing this would be less than the drop will be over the next X Quarters providing accurate numbers. There's literally no other reason for them to do it", "score": 9, "replies": [{"body": "Ya. Dumb strategy IMO, “calculated risk”... how calculated?  It looks shady when you try and hide numbers, just say: “hey we’re bored of killing iPhone sales we wanna focus more on services, but we’ll still bring in the bacon, deal with it”", "score": 2, "replies": [{"body": "> calculated risk”... how calculated\n\nby asking yourself if the benefit of doing X greater than doing Y with heaps of market research", "score": 6, "replies": [{"body": "I don’t know any precedent for something like this, it would be less calculations and more speculation IMO", "score": 1, "replies": []}]}, {"body": "Phone sales are down, how can anyone be shocked.", "score": 1, "replies": []}]}, {"body": "It makes no sense for a company that's realigning their strategy to have their earnings call focused on their old business model. Imagine if GE today was still reporting the amount of light bulbs sold as the headline of their earning calls - that'd be AAPL still reporting iphones sold numbers in a decade or two.\n\nThe timing of the move is unfortunate in so far that it coincides with a reported drop in units sold so people are frightened, but it was going to happen at some point as AAPL tries to refocus to different facets of its company. Controlling the narrative is not just about hiding bad numbers, it's about putting the focus on the stuff that AAPL thinks is important in the future.", "score": 2, "replies": []}]}, {"body": "Thanks. I knew of the decision (to no longer report), but didn't realize its impact.", "score": 4, "replies": []}, {"body": " Funny, Wall Street did not throw a temper tantrum when Microsoft did it.\n\nMicrosoft stops reporting Xbox console unit sales, shifting focus to Xbox Live active users\n\n[https://www.geekwire.com/2015/microsoft-stops-reporting-xbox-console-unit-sales-shifting-focus-to-xbox-live-active-users/](https://www.geekwire.com/2015/microsoft-stops-reporting-xbox-console-unit-sales-shifting-focus-to-xbox-live-active-users/)", "score": 1, "replies": []}]}, {"body": "No", "score": 2, "replies": []}, {"body": "I actually lean more no.    There are better options, IMO.  Perfect example is Google which is growing at 20% plus and their sister company, Waymo, is just starting to roll out their self driving cars in Phoenix.\n\n", "score": 2, "replies": [{"body": "Every car company is rushing to get their self driving cars on the road. When Waymo cars hit the streets they will not be the first and they will deal with a lot of regulations and or shutdowns of the systems for a solid decade because of accidents.  The real trials start when everybody and their mothers are in a self driving car.", "score": 1, "replies": [{"body": "It will be winner take all or at least most.   Waymo is years ahead of everyone else.\n\nWaymo cars already hit the streets.\n\n\"Alphabet’s Waymo begins charging passengers for self-driving cars\"\n\nhttps://www.ft.com/content/7980e98e-d8b6-11e8-a854-33d6f82e62f8\n\nThey have up to 82k cars on order and will scale up the business and be at scale long before anyone else.\n\n\"Waymo adds another 62K Chrysler Pacificas to self-driving fleet\"\n\nhttps://www.mlive.com/auto/index.ssf/2018/05/fca_waymo_double-down.html\n\n\"WAYMO AND JAGUAR WILL BUILD UP TO 20,000 SELF-DRIVING ELECTRIC SUVS\"\n\nhttps://www.theverge.com/2018/3/27/17165992/waymo-jaguar-i-pace-self-driving-ny-auto-show-2018\n\nYou are a bit behind what is happening.\n\nYes, Waymo was the first.   Well they are also the only.  The question is how long until someone else?  I suspect a long time.  Once get to scale the game is over.\n\nSDC like most things should be winner take all.   We had billions and billions spent on Ecommerce and now just have one, Amazon.\n\nThere were tons and tons of search engines and now Google has 92% of the market.   Heck, #2, MS, lost over 25% of their market share in just the last 2 months.\n\nhttp://gs.statcounter.com/search-engine-market-share\n\nThe key is having something really big that can fuel growth for many years.  Amazon and ecommerce is a perfect example.\n\nWaymo should be able to fuel growth for Alphabet for over a decade.  Probably more like thirty years.\n\nIt is NOT just the transportation angle.  But as much if not more with shipping/logistics.  These are over a trillion a year opportunity.\n\nBut will take a long time which is ideal with investing.\n\n", "score": 1, "replies": [{"body": "Thanks for the detailed reply.\nSDC in Arizona don't mean jack until that car can easily drive around Boston all four seasons. \n\nDo you really think the government is going to let thousands of 3,000lb objects in the streets around human beings?\n\nTesting and hitting the market is totally different with a car than compared to phone or a laptop. A bug in a phone makes phone calls to your ex, but a bug in a car can accelerate you to 80 mph on a busy street. You do remember what happened with Toyota cars with stuck accelerators?\n\nI'm all for SDC, but we are long ways before people are going to hand over $30-80k comfortably.", "score": 1, "replies": [{"body": "80.0 mph ≈ 128.7 km/h ^(1 mph ≈ 1.61km/h)\n\n\n\n^(I'm a bot. Downvote to remove.) \n\n_____\n\n  ^| ^[Info](https://www.reddit.com/user/Bot_Metric/comments/8lt7af/i_am_a_bot/) ^| ^[PM](https://www.reddit.com/message/compose?to=Ttime5) ^| ^[Stats](http://botmetric.pythonanywhere.com) ^| ^[Opt-out](https://www.reddit.com/message/compose?to=Bot_Metric&subject=Don't%20reply%20to%20me&message=If%20you%20send%20this%20message,%20I%20will%20no%20longer%20reply%20to%20your%20comments%20and%20posts.) ^| ^[v.4.4.6](https://www.reddit.com/user/Bot_Metric/comments/8o9vgz/updates/) ^|", "score": 1, "replies": []}, {"body": "They have tested in 25 cities across 6 states.  But you want to move to production in the easiest place first and expand.  Rumor is they will do to more cities next year.   They have up to 82k cars coming.\n\nThe gov already allows as legal in Phoenix and in California.    So yes they will allow as they already do.\n\nWill not be sold direct to consumer.  You are thinking in terms of the old world.  Will be offered as a service which Waymo has already started doing.\n\nhttps://www.ft.com/content/7980e98e-d8b6-11e8-a854-33d6f82e62f8\nAlphabet's Waymo begins charging passengers for self-driving cars\n\nWill be far safer than humans.", "score": 1, "replies": [{"body": "Established car companies are not going to rollover like the overnight startup search engines of the 90s.  Two companies like Toyota + UBER are not going to let one company just walk all over themselves.\nhttps://www.techworld.com/picture-gallery/data/-companies-working-on-driverless-cars-3641537/", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Buffet says it should double in the next three to five years....I have been buying the dip. He said that as it hit a trillion...and he said it will go to two trillion. Long term that is pretty good money. I have 400 shares and holding long. I have traded this stock for years and should have just held it. ", "score": 1, "replies": [{"body": "I bought SYF at a lower price-point than when Buffet bought it. It hit a 52-week low today. I keep telling myself that Buffet believes in it and so should I. It's testing my nerves, for sure. Not sure how that applies to Apple other than to say Buffet might end up to be correct, but the interim sucks.", "score": 1, "replies": [{"body": "I do. It own many single stocks as I can’t stand the interim....but appl BrkB MU I am long. I like the numbers. The world might not agree right now but in a ten year window everything goes up. ", "score": 1, "replies": [{"body": "Your last statement is very far from true. There have been a number of 10 year periods during the last 100 years where stocks did not move at all. ", "score": 1, "replies": []}]}]}, {"body": "500 shares here and looking to add probably another 50 soon.", "score": 1, "replies": []}]}, {"body": "Not a fan of Apple. They're not innovating well, releasing phones with marginal upgrades and jacking up their prices. I love their products but they really need to start making major feature additions to their phones or cut their prices to a more reasonable range", "score": 1, "replies": []}, {"body": "From my perspective, most likely no. Apple’s current revenue model (majority of sales from devices) is reaching a demand peak. The incentive to buy new products decreases every year, but Apple has done a good job of supporting demand. If you look at recent mergers and acquisitions you can see that Apple is taking steps to shift their business model with the various services they offer. \n\nI would not buy Apple stock  yet, but they will be a good buy in the future. \n\n$135+-25", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I acknowledged their eco system and the potential revenue outlets that can further grow. Those sales are minuscule in comparison to the iPhone sales, which produce more than 56% of revenue shown in Apple’s recent financial reports. \n\nI never said a single product tells a whole story, but if that product consists of over 50% of company costs then you bet your dumb ass it’ll tell a good portion of the story. \n\nDenial is a killer. ", "score": 6, "replies": []}]}, {"body": "You must be a comedian on the weekends. LOL", "score": 1, "replies": [{"body": "If I’m a comedian then you must be blind. It’s okay, maybe your Amazon stock will do just as well as your Apple stock! New ATH’s all around the board! We’re only down 20% but here we come! \nDon’t let your bias blind you. ", "score": 1, "replies": [{"body": "Apple going to your price range means the whole market will be taking a beating.  I can understand going with analysts, but taking a stand against WB takes some balls.", "score": 1, "replies": [{"body": "All it would take is one more leg down, or an 11% drop to reach my first buy target. This could more likely than not be a temporary trend reversal for the whole market. It’s been 10 years of positive gains. \n\nA trade war with one of the most effective countries in the world, combined with countries who are trying to remove reliance of their currencies tied to the USD. Federal interest rate increase, and 1.5T student loan debt are just some factors that could influence the market. ", "score": 1, "replies": []}]}]}]}]}, {"body": "MSFT all the way.\n\n&#x200B;\n\nWhat's AAPL going to do next? Make an Apple Necklace? I don't know, they peaked imo. Still great products, but I don't see any real innovative technology they can produce anymore.\n\n&#x200B;\n\nMSFT is doing a lot with VR and AI which is going to shape the future.", "score": 1, "replies": [{"body": "Think MSFT is doing well in the cloud but on the consumer side they seem to be dying.\n\nThey just announced they would be selling Alexa devices for example.\n\nCortana never caught on.   MS really does not have any plays in so many different consumer type things.\n\nEven K12 they are losing to Google.\n\nTo me the one with the most opportunity ahead is Google.  They are growing at over 20% and are just rolling out their self driving cars with their sister company, Waymo.\n\n", "score": 3, "replies": []}, {"body": "Most of their vr headsets are garbage, but they do innovate in cloud, ai and software in general.", "score": 2, "replies": []}, {"body": "Who is actually using MSFT VR ??? MS operating system still has the blue screen of death.", "score": 0, "replies": []}]}, {"body": "Been hearing and reading that Apple is suppose to get iHeart Radio. Don’t know when though. ", "score": 1, "replies": [{"body": "Relevance?", "score": 1, "replies": [{"body": "another revenue stream?", "score": 2, "replies": [{"body": "This is much bigger than that, and not just Apple.", "score": 1, "replies": []}, {"body": "That would probably be my guess but to somehow gain traction on the radio market since a lot of people are turning to other means of releasing music.  ", "score": 1, "replies": []}]}]}]}, {"body": "Only looking at one parameter to gauge a stock isn't a great way of valuing it, look at revenue, debt, future possibility, forward PE ratio, etc etc. Amazon's gonna catch up", "score": 1, "replies": [{"body": "Yeah. I didn't mean to imply that P/E or EPS is the end-all. But the fundamentals show that Apple is a better buy than AMZN, imho. Both are large components in my portfolio (and I'm feeling the pain). But I don't think I'd buy Amazon right now. Pondering Apple, though.", "score": 1, "replies": [{"body": "I wish Apple was more diversified, but they do have loyalty. But I'd rather hold Amazon for 10 years due to revenue growth and online dominance, Apple has trouble innovating", "score": 1, "replies": []}]}]}, {"body": "There is no way to know. Maybe it is, maybe it isnt.", "score": 1, "replies": []}, {"body": "I think Apple is a good buy at 120. I’d sell and buy again when gets back to 120.", "score": -2, "replies": [{"body": "The whole market will be in the sewers if Apple hits $120", "score": 1, "replies": []}, {"body": "I’ll grow a tail before Apple goes to $120 again", "score": 1, "replies": [{"body": "Start grow it than recesion is here apple gone hit $120 :)", "score": 3, "replies": [{"body": "I mean I don’t claim to know what the future holds, but that’s highly unlikely.", "score": 2, "replies": []}]}]}]}, {"body": "Apple under $200 has been a good buy. At $185 it’s a steal.", "score": -1, "replies": [{"body": "Think how good it’ll be at $160!", "score": 10, "replies": [{"body": "Or $17 would be even better.", "score": 3, "replies": []}, {"body": "No point in trying to time the market though, if you are wary at its current price then buy half of what you were going to originally invest and then average down if it does drop.\n\nEdit: at $160 it should be a crime to be so low", "score": 1, "replies": [{"body": "It’s not timing the market to find a price you think is fair and not be willing to buy for more than that price. Prices matter and I’m not so interested in beating the return on money markets that I’d invest in bonds and stocks without making sure that is a rational choice. ", "score": 2, "replies": [{"body": "Oh gotcha, didn’t know you valued Apple at $160, thought you meant you think it will drop to $160.", "score": 1, "replies": []}]}]}]}]}, {"body": "Honestly I don’t think so.  Until they bring back a fingerprint scanner I think a lot of potential purchasers are holding off.  They have other revenue streams besides the iPhone but I don’t think they matter.  If they don’t bring it back in the next version of the phone I really think they will have an issue.", "score": 0, "replies": [{"body": "I used to think the same way and realized it was from the stone age once I used facial recognition.", "score": 1, "replies": [{"body": "Not saying facial recognition is bad, but they need to offer both or else will keep losing customers", "score": 0, "replies": []}]}]}, {"body": "No. It's no longer a creative company. It's just a phone manufacturer dependent on cheap Chinese labor", "score": 0, "replies": []}, {"body": ">unlike my Amazon which looks like a sucking chest wound\n\nFound the EMT. Or ER nurse. Grab an occlusive dressing, and find a decent trauma surgeon to get a chest tube placed. \n\nAAPL looks decent to me right now, but I'm honestly waiting to see what happens in the UK with brexit before I pull the trigger. I understand that the entire tech sector is being brought down with the whole market, collectively right now, but a large part of the *many things that contribute to overall market uncertainty right now is also the limbo that is brexit. The UK is the 5th largest economy in the world, and represents 21% of the world's total gdp in 2017. \n\nThere are so many other factors going on with the trade war, sector rotation, and other interesting macro factors such as forex stuff, but they all add up to an uncertain future. Traders hate uncertainty. I'm waiting to see what happens with brexit, and also hopefully AAPL hits a bottom and starts to trend up as well. Just don't expect it to trend up quickly, as there will still be uncertainty after brexit.", "score": -1, "replies": [{"body": "How does the UK's GDP and decision to leave the European Union or not impact the market?  \n\nIt's not like 21% of the world's GDP will just vanish overnight...", "score": 1, "replies": []}]}, {"body": "I personally prefer bananas or strawberries. ", "score": -3, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - November 19, 2018", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q3 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/9r1iru/tesla_tsla_third_quarter_2018_results_and/).\n", "id": "9yf4tr", "created_utc": 1542618265.0, "score": 11, "upvote_ratio": 1.0, "num_comments": 112, "comments": [{"body": "Feels a bit short squeezy. Can't be many short's left with an entry price above $360.", "score": 13, "replies": [{"body": "Pretty sure a lot entered at over 380 in August", "score": 7, "replies": [{"body": "Haha. Anyone who entered at $380 and then watched the price go to $250 and then back up to where we are now without covering at least some of their position deserves to loose all their money.", "score": 4, "replies": []}, {"body": "I suspect a range but most way under 380. Some might have but that is difficult to time. How many Longs got in at 250?", "score": 2, "replies": [{"body": "I'm long, bought 10 shares at $260. I decided to buy the dip before the SEC lawsuit and kept my faith in Musk through the SEC lawsuit (feel bad for anyone who sold at the time). Every time the price goes down, I've considered selling but have been dissuaded by the following day's boom. I'm feeling pretty good right now, Tesla is doing the exact inverse of everything all the other tech stocks are doing.", "score": 1, "replies": [{"body": "Good on you man! Are you planning to hold longterm (5+ years)?", "score": 2, "replies": [{"body": "Oh ya. I have a very detailed bull thesis. \n\nThe Model 3's gross margins, exponential production ramp and seemingly inexhaustible demand have proven the vehicle to be truly transformative (if Tesla is Apple, this is the first IPhone). They've transformed so many elemets of the automotive industry, from direct-to-consumer sales online & with trendy showrooms, to regular software updates, to their ecosystem of solar roofs, powerwalls, superchargers and other assorted products. Tesla has built a world-class lifestyle brand and a devoted following behind a visionary founder (similar to what Steve Jobs did with Apple).\n\n They've found their market in mass-market premium (not luxury) by making highly compelling vehicles that, while slightly out of the normal purchase-price range of most buyers, are considered worthwhile for most people who can to spend more. A $35,000 Bolt can't compete with a $46,000 Model 3. They've done this through vertical integration, automation, and economies of scale. Similarly, the Model Y is set to outcompete the other electric SUVs due to its lower price, similar capabilities and status-brand-name. I fully expect Semi to outcompete Nikola. \n\nGrid-scale energy storage and solar are also an exponentially growing industry so even if their proportional share of the pie shrinks (they've lost some in solar installations, but more than compensated for by growing share in energy storage) the absolute size of their slice will continue to explode. In terms of vehicular autonomy, I see Tesla as easily being ahead of the competition thanks to the massive amount of data they're pouring in to train their neural network from hundreds of thousands of Teslas. Looking at the competition, its obvious that nobody else (except maybe Waymo) is taking vehicular autonomy and electric drive as seriously as Tesla. \n\nMusk is brilliant with engineering. I think Larry Elison puts it best. This guy is landing rockets on reusable drone rafts in the ocean. He's doing things that the largest corporations and governments have failed to do for decades (even with the resources and know-how). He's a tech-manufacturing juggernaut. This isn't software, this is automotive assembly lines and Saturn-V-class rockets.", "score": 1, "replies": [{"body": "Nice summary!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I’m feeling lucky", "score": 2, "replies": []}]}, {"body": "$500 could come really soon. ", "score": 10, "replies": [{"body": "Apple became a trillion dollar company with phones. How much do we spend on phones? Tesla has the potential at least for a trillion, probably way more! 60%-120% growth per year the next few years.", "score": 5, "replies": [{"body": "I hope to god this is true, but damn if it isn't very positive, maybe a bit too positive?", "score": 1, "replies": []}]}, {"body": "I see it going much higher than that in the long term, but what are you basing this on? And what timespan would you consider to fit your 'soon' prediction?", "score": 3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "My end 2018 target is still $450 from a valuation perspective. ", "score": 1, "replies": [{"body": "RemindMe! 42 days", "score": 1, "replies": [{"body": "I will be messaging you on [**2019-01-02 01:57:11 UTC**](http://www.wolframalpha.com/input/?i=2019-01-02 01:57:11 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/teslainvestorsclub/comments/9yf4tr/tsla_daily_investor_discussion_november_19_2018/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/teslainvestorsclub/comments/9yf4tr/tsla_daily_investor_discussion_november_19_2018/]%0A%0ARemindMe!  42 days) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! ea534ap)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}]}]}, {"body": "If somebody believes it will be much higher in the long term, they will want to get onboard before that happens. If everybody believes this, then the only way to guarantee you don’t miss the train is to buy now", "score": 2, "replies": []}]}, {"body": "Would be awesome", "score": 2, "replies": [{"body": "Will be awesome :)", "score": 6, "replies": []}]}]}, {"body": "Elon on twitter:\n\n> Lot on our plate, so it’s either get van gliders (no battery, powertrain or compute tech) from Daimler & produce sooner or do all & produce later. Not a big difference to total vehicles produced either way. Priority list is Model Y, solar roof tiles, pickup, semi, Roadster.\n\nhttps://twitter.com/elonmusk/status/1064624811794526208?s=21\n\nLooks like the semi and roadster are a few years away.", "score": 10, "replies": [{"body": ">In order of resource priority, but not necessarily production ramp, as that depends on thousands of parts & processes, which are extremely difficult to forecast\n\n[https://twitter.com/elonmusk/status/1064636946121613313](https://twitter.com/elonmusk/status/1064636946121613313)\n\n>What really matters is time to volume production, not initial market intro. Apart from brief moments, Tesla vehicle production is limited by total battery output.\n\n[https://twitter.com/elonmusk/status/1064636393333252097](https://twitter.com/elonmusk/status/1064636393333252097)\n\nSo we can't draw any meaningful conclusions from this, timewise.", "score": 3, "replies": []}, {"body": "http://www.autoline.tv/journal/?p=55776\n\nInteresting talk about making electric conversion vans", "score": 1, "replies": []}, {"body": "Most interesting to me is pickup's position here.", "score": 1, "replies": []}]}, {"body": "in combination with an insane amount of shorted stocks this baby has incredible potential upwards. the match is lit the powder is dry", "score": 7, "replies": [{"body": "hear how Jim and David cry", "score": 1, "replies": []}]}, {"body": "there are times when I wanna short the shorts. they must be quite in the red", "score": 8, "replies": [{"body": "Where do you buy short shorts?", "score": 2, "replies": []}, {"body": "You can. Buy calls. Sell OTM puts. ", "score": 1, "replies": []}]}, {"body": "Crazy how good were doing in this market ", "score": 8, "replies": [{"body": "thats what happens when you are disciplined and follow actual business performance and not just chase the latest whims of the crowd!", "score": 12, "replies": [{"body": "260 was ridiculously low. I'm glad you made a shitload of money on those calls. If you kept them. ", "score": 3, "replies": [{"body": "Not exactly a shitload of money, would have been better if i just bought stock.  we were at 250 that day.", "score": 1, "replies": []}]}]}]}, {"body": "dibs on 360 today", "score": 6, "replies": [{"body": "just hit it ...\n\n&#x200B;", "score": 3, "replies": [{"body": "and it's below 360 again ...", "score": 1, "replies": [{"body": "No it isn't ;) (edit: $362)\n\nInteresting movement here. Nasdaq down 1%, Tesla up again.\n\nMight be related to that RBC rumor.", "score": 1, "replies": [{"body": "It dipped, but it's on a decent rally. \n", "score": 1, "replies": [{"body": "I know, just joking around.\n\nNasdaq dropping even further at 1.85%. Tesla even further up to $364.\n\nI'm intrigued.", "score": 1, "replies": []}]}]}]}, {"body": "took less time than I thought", "score": 1, "replies": []}]}]}, {"body": "360!!", "score": 7, "replies": [{"body": "362... Woot!", "score": 3, "replies": [{"body": "364.. ", "score": 1, "replies": []}]}]}, {"body": "NASDAQ is down 1.77% and Tesla goes up. I, to this day, find that incredibly impressive. ", "score": 6, "replies": []}, {"body": "Sentiment is changing in a big way. Combined with shorts covering. Combined with people leaving “safe” tech stocks. 🚀", "score": 4, "replies": [{"body": "or TSLA becoming a save stock due to recurring profitable quarters", "score": 4, "replies": [{"body": "Safer yes and more investable.", "score": 5, "replies": []}]}]}, {"body": "ahh this is significant: https://electrek.co/2018/11/19/tesla-mercedes-benz-electric-sprinter-van-elon-musk/", "score": 5, "replies": [{"body": "naw. that was just classic Elon brainstorming on Twitter", "score": 7, "replies": [{"body": "A long way from a deal but a willingness to partner to achieve more form factors more rapidly is interesting. It's been a pocket theory for me.", "score": 3, "replies": []}]}]}, {"body": "It was fun while it lasted", "score": 4, "replies": [{"body": "we get to do it again tomorrow!", "score": 4, "replies": []}, {"body": "grey crawl glorious butter seed command cable existence consist snow\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 3, "replies": []}]}, {"body": "Rumor:\n\n[https://twitter.com/TimKelleherCorp/status/1064490588731527168](https://twitter.com/TimKelleherCorp/status/1064490588731527168)", "score": 3, "replies": [{"body": "Do we have any idea what this would relate to?", "score": 1, "replies": [{"body": "China gigafactory would be done through local financing so that is not an option. They have told numerous times that they can pay off the convertible in march 2019. \n\nMaybe they want to accelerate the development of something?", "score": 3, "replies": [{"body": "Yeah that was my thoughts too. I can't think of anything that we know they would want to get more cash for currently. Paying off debt earlier also seems weird to do if they don't have to just yet. ", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I think its up to the people Tesla needs to pay. Not sure though. If Tesla pays a premium it might be a possibility, however I am not sure that is a smart play. I am retarded so who knows.", "score": 3, "replies": [{"body": "I am too. But I find your level of full disclosure refreshing", "score": 2, "replies": []}]}, {"body": "Maybe they think that the potential of selling a bunch of stock is capping the price.", "score": 1, "replies": []}]}]}]}, {"body": "RBC have so much money they want to buy a fleet of semis to drive it all around the country", "score": 3, "replies": []}, {"body": "I feel like this is not interesting.", "score": 2, "replies": []}]}, {"body": "Model Y or semi?", "score": 1, "replies": []}]}, {"body": "Wtf", "score": 4, "replies": [{"body": "maybe folks selling who bought purely on the rbc rumor ?  Meeting at 12pm.", "score": 2, "replies": []}]}, {"body": "**Nissan to oust Carlos Ghosn after finding 'significant acts of misconduct'**\n\nhttps://www.cnn.com/2018/11/19/business/carlos-ghosn-nissan-renault/index.html\n\nWow Carlos was pretty much the reason the leaf existed, and huge EV proponent. Arguably he is one of the most important people in being EVs to the masses. Wonder what this will do to Nissans electrification plans.", "score": 6, "replies": [{"body": "this sounds serious. sounds like he under reported his compensation not only to the tax authorities, but perhaps even to his employer. \n\nI wonder if his ousting will change Nissan's EV strategies", "score": 2, "replies": [{"body": "Not just Nissan, Renault and Mitsubishi. Renault sold a lot of Zoe’s.\n\nThey’ve sold more EVs than any other company. ", "score": 3, "replies": [{"body": "yes now it looks like Renault is also going to fire him. I have the impression that the Renault-Nissan alliance will crumble.", "score": 2, "replies": [{"body": "Eh, don't get carried away now.\n\nGhosn was already on the way out before this.\n\nAnd at this stage I doubt it will have any impact on Renault-Nissan-Mitsubishi's plans both EV and non-EV.", "score": 3, "replies": [{"body": "true. even if the alliance crumbles.", "score": 1, "replies": []}]}]}]}]}, {"body": "Maybe Musk's previous stupid Tweets are finally being seen in comparison to the other auto CEOs who've been arrested? Audi's guy was still in jail last time I heard too", "score": 4, "replies": []}]}, {"body": "Looks like we are headed to 365...", "score": 3, "replies": [{"body": "Just this second hit it. Been an interesting day already.", "score": 2, "replies": []}]}, {"body": "Woot! 366...", "score": 3, "replies": []}, {"body": "Could we be seeing some short covering going on because people are getting margin called because their other stuff is dropping?\n\nAnyone?", "score": 3, "replies": [{"body": "I think they could just be covering because they decide it is a bad short.  My guess is that for the most part the shorts only have a small portion of their money shorting.", "score": 7, "replies": [{"body": "Hmm, I doubt they think it's a bad short, but maybe you're right.", "score": 1, "replies": [{"body": "Bad compared to the rest of the tech stock", "score": 3, "replies": [{"body": "Ok I see where you're going, that makes sense. Thanks!", "score": 1, "replies": []}]}]}]}]}, {"body": "Thoughts on when the majority of shorts will cover? After profitable results for Q4 are released? If the price hits $420?", "score": 3, "replies": [{"body": "I'm thinking profitable Q4 and Q1, Q2.  They need to show sustained profitability with the lower priced M3, IE real strong continued demand.  Shorties seems to think the mid 40s prices are not sustainable for demand long term.  My guess is say summer next year to really get the squeeze.  Though, I think you could see a panic squeeze before then if it breaks like $400 - $420.  It seems the squeeze is somewhat slow and steady right now...like every week that percentage short goes down slightly.  If a real squeeze hits that will change fast though. Disclosure I have call options and stock.", "score": 4, "replies": []}, {"body": "S&P 500", "score": 4, "replies": []}]}, {"body": "Yeah, I am worried about rest of the market tanking...hopefully it won't catch up with TSLA.", "score": 2, "replies": [{"body": "Given that TSLA is going up as the market is taking I'd imagine shorts are probably switching to tech", "score": 2, "replies": [{"body": "Seems like the rest of tech is dropping too. Only TSLA seems to be up", "score": 1, "replies": []}]}]}, {"body": "Those HODLers are getting crushed some more. Probably a bit of a double whammy with most of them also holding NVDA thinking that's diversification (or not really caring). Probably a lot of crypto fans interested in buying Teslas, but I don't know what the total number of them is. Probably fairly small.", "score": 2, "replies": [{"body": "My three biggest holdings are TSLA, NVDA, Crypto lol.\n\nAt least 1/3 doing well nowadays. Usually at least 1/3 is doing well.", "score": 2, "replies": []}, {"body": "You mean the folks shorting?  I'm confused.", "score": 1, "replies": [{"body": "Bitcoin longs are known for screaming HODL (a mispelling, but who needs precision in a bull market).", "score": 2, "replies": [{"body": "Lol what", "score": 2, "replies": []}, {"body": "That’s rarely used around here even during the massive dips this year.", "score": 1, "replies": []}, {"body": "Right and its sort of a 'bad word' for us super sophisticated investor types ;).  But Tesla is climbing so why would folks be getting crushed?", "score": 1, "replies": [{"body": "sigh.. bitcoin is getting smashed yet again, Nvidia is also down substantially. It's interesting in general to watch a potential mutually reinforcing bubble blow up. And it's mildly connected to Tesla because bitcoin lottery winners were often buying Teslas as hard-earned toys.", "score": 2, "replies": [{"body": "Ok, cool.  I get it now. Thanks for carrying me along :).", "score": 1, "replies": []}]}]}, {"body": "As much as I hate the HODL mentality, I believe it’s an acronym for “hold on for dear life” and not misspelling ", "score": 1, "replies": [{"body": "It's a backronym for that, apparently.", "score": 1, "replies": []}, {"body": "That's what is called a backronym. ", "score": 1, "replies": []}]}]}]}]}, {"body": "365!!", "score": 2, "replies": []}, {"body": "aaaand were back over 360.", "score": 2, "replies": [{"body": "for 30 seconds", "score": 3, "replies": []}]}, {"body": "This is why I bought QQQ puts to hedge my risk. ", "score": 2, "replies": []}, {"body": "A Tesla board member [sold all of her stock](https://www.reddit.com/r/teslainvestorsclub/comments/9yl2xv/tesla_board_member_linda_johnson_rice_sells_all/). Deepak also sold $1.2 million shares of Tesla.", "score": 4, "replies": [{"body": "Please don't downvote. Even though we (majority in this sub is long I guess) might think that this should not influence the stock the markets may disagree. Therefore in my opinion it's relevant. Maybe add your perspective? e.G.: \"She always sells her stock options the minute she can do so\"\n\nI for one come to this sub to get \"explanations\" why the stock is moving the way it is moving.", "score": 6, "replies": [{"body": "It's old hat. This is from last week. If it mattered it's already in the stock price.\n\nI've seen some mentions of the fact she's been selling other stuff as well so she seems to be in need of the cash for whatever reason.", "score": 4, "replies": [{"body": "Today was the first day that this news could have entered the market since it was disclosed after market close on Friday. ", "score": 2, "replies": [{"body": "My bad, you're right. I thought it went out before Friday.", "score": 3, "replies": []}, {"body": "So that's why stock went up heavily on opening and lasted for half a day instead of falling 3% as NASDAQ does?\n\nPlease consult that with Jim. ", "score": 0, "replies": [{"body": "That’s not what I said. ", "score": 2, "replies": []}]}]}]}, {"body": "i up voted per your instructions - however i think its irrelevant.", "score": 2, "replies": [{"body": "FTFY.", "score": 1, "replies": []}]}, {"body": "Not eager to get \"explanations\" from the boy who cries wolf.", "score": 1, "replies": []}]}]}]}
{"title": "What will be the next 'subprime mortgage crisis'?", "selftext": "[deleted]", "id": "9yd3m9", "created_utc": 1542599399.0, "score": 48, "upvote_ratio": 0.9, "num_comments": 112, "comments": [{"body": "The great tendies shortage of March 2019.", "score": 109, "replies": [{"body": "Tasty if true ", "score": 8, "replies": []}, {"body": "!remindme 4 months ", "score": 2, "replies": []}, {"body": "SHORT $TNDS!", "score": 2, "replies": []}, {"body": "!RemindMe 4 months ", "score": 2, "replies": []}, {"body": "!remindme 4 months", "score": 1, "replies": []}, {"body": "!remindme 4 months", "score": 1, "replies": []}, {"body": " !remindme 4 months ", "score": 1, "replies": []}]}, {"body": "When people forget about the movie \"The Big Short\"", "score": 51, "replies": [{"body": "[deleted]", "score": 26, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "^^it's ^^a ^^woozy", "score": 5, "replies": []}]}, {"body": "Just gotta find what credit was made on the inflated margins. ", "score": 1, "replies": []}]}]}, {"body": "In order of most to least likely IMHO:\n\n**1.** Leveraged Loans\n\n**2.** dollar denominated EM debt\n\n**3.** Junk bonds\n\nThe student loans are a fucking disaster that should never have been allowed to happen, but they can't actually create a financial crisis (just a social and generational one).  Reasons: **one**, they can't be shaken, filing for bankruptcy can't get rid of them and the IRS can be used to acquire their payment from those on the hook so they are forced to pay those student loans as much as they are taxes.  If you are fucked with US student loans your only hope is to flee the country (no I am not joking).  **Two** even for those who flee the country, the student loans in the US are backed by the government, so the tax payer ends up on the hook for them, even if like $1T worth of former students flee the country Uncle Sam covers (and then Uncle Sam makes the rest of us cover).  **Conclusion** US student loans are a toxic disaster that should never have existed, but they can't really create a financial crisis.", "score": 46, "replies": [{"body": "What if all the unprofitable degree students make a pact to either flee the country or start offing themselves en masse?", "score": 5, "replies": [{"body": "Well that would be a terrible social and generational crisis that will deeply damage the country, but it won't actually be a financial crisis, as on the financial end Uncle Sam will cover the short-fall monetarily.  Don't get me wrong, I think what you propose would be an abhorrent and terrible tragedy, and perhaps the greatest social and generational crisis of the US in all its history.  But the question OP posed is what will cause the next financial crisis, not what is the largest and most terrible self-inflicted tragedy that can befall the US in the near future.", "score": 7, "replies": [{"body": "Thats a good point", "score": 3, "replies": []}]}]}, {"body": "Flee the country? Or get a job and start paying those fuckers off like you are supposed to ", "score": 9, "replies": [{"body": ">Or get a job and start paying those fuckers off like you are supposed to \n\nWell sure that would be great but while possible for many individuals in the bigger picture as a whole that actually isn't an option.  If you look at the types of jobs that actually pay enough after subtracting the cost of living in the areas that these jobs exist such that it is possible to actually pay off a lot of these student debts, the fact is there just are not enough such jobs that all of these student debts can be repaid.  That is just math, the number of jobs profitable enough to cover the student loan shortfall after cost of living (higher paying jobs typically only exist in more expensive locals) simply do not exist in the US.  So what you are asking for is physically not possible in the big picture as a whole.\n\nFor instance, I work a job that requires two technical B.S. degrees (4 years total 'cause I busted my ass) a highly technical PhD (took 6.5 years), and a highly technical postdoctroal research fellowship (took 5.5 years).  I am fine because I am one of the lucky assholes who had family be able to pay my way, but if I had to do that on US student loans, after absolute minimal cost of living in any of the urban centers that actually have such positions, my salary would not be able to cover the student loans.  Indeed while their are many lucrative (and important) jobs looking for my credentials (I get job offers emailed to me all day even though I am not looking), none of them would cover the hypothetical student loans I would need to get where I am after my cost of living.  If I had needed student loans to get all the way through my only option would be to flee the country.  The implication there would be that such positions can only be filled by foreigners who come from countries where they aren't cruel enough to punish and destroy their future for the sake of making some boomers a few extra bucks now, or for the children of rich people.  Again not a problem for me, but a huge social issue with very negative social implications generally.\n\nYou need to understand in a well-functioning capitalist society, [moral hazard](https://www.investopedia.com/terms/m/moralhazard.asp) (which has nothing to actually do with ethics and morality, it is a critical economics and investing concept that people increasingly seem to have forgotten) **goes both ways**.  In the case of student loans \"moral hazard goes both ways\" means that when a student loan is enacted, it is both the responsibility of the student to pay the loan back, and also the responsibility of the loan originator not to make stupid loans.  In any case where both parties came to the situation open and honestly but the loan cannot be repaid, in a normal healthy capitalist society then **BOTH** parties need to be punished.  In a normal healthy capitalism setup when this occurs the student has to take a massive hit to their credit rating and suffer all the other consequences of bankruptcy, and the lender has to accept that loan will not be repaid in full.  This encourages students not to take bad-loans and lenders not to make bad loans and for capitalism to function properly around loans **BOTH** parties need to have such risks.\n\nIn the current sett up though, the lenders have no risk.  This creates the moral hazard where they do everything they can to make sure that everyone goes to college for **SOMETHING, ANYTHING** including say tran-gendered lesbian interpretive improvisational music on the butt-bongos, and that these are done anywhere including at for-profit colleges that are just scams and won't even help students get the actual degree that is worthless anyway.  Indirectly these lenders massively encourage this incredible waste of social resources because they get guaranteed profit off of it, and will happily encourage, advertise, etc... to increase this unfathomable waste of resources and destruction of the future for their guaranteed profit.  These are loans made in bad faith because the one-sided protection of the system in US student loans is such that it is socialism for the rich (the lenders) and capitalism for the poor (the students) creating a toxic hybrid system that is worse then all the worst parts of socialism and capitalism individually if combine.  If the lenders encouraged students to go to ... whatever ... to do ... whatever ... knowing that they were socialized and protected in their predatory lending, then the only way to even begin to equalize out the moral hazard and thus restore the necessary balancing market forces required for normal capitalism is for students that simply can't repay to flee the country.  Sadly this still doesn't equalize the moral hazard because Uncle Sam will pay, instead the lenders should go bust in such situations a normal healthy and functioning capitalist system that is adequately responding to actual market forces instead of market-distorting one-sided socialism for only the most predatory of the rich as the current setup has.", "score": 31, "replies": [{"body": "I like reading your comments", "score": 5, "replies": [{"body": "Thanks!\n\nIt means a lot to hear that.  I do generally try to make good comments (though of course I still do shit-post), but I am a bit long winded.\n\nThere was a reddit user analyzer bot I found one time that would analyze a user to conclude various things about them based on their posting history.  I ran it on myself out of curiosity and in concluded that both my number of posts and amount of writing relative to up-votes received for them was incredibly low – which confirmed my worries that I spend a lot of time trying to (mostly) make thoughtful posts and yet the general response is \"Ewwww, wall of text.  Skip.\"  Its a depressing revelation: \"what am I doing with all this time and effort?  Almost no one cares!\"", "score": 9, "replies": [{"body": "No problem, I think your comments are good. I don’t mind long-winded posts at all, but I’m sure lots of redditors would read a TLDR if they didn’t want to commit to reading the wall of text.\n\nI’m sorry that you think no one cares. 5 days ago I replied to one of your comments and asked something like why “shit was about to go down in emerging markets”. You replied and I read it all, but I never replied back said thanks. So when I saw your comment here I wanted to let you know that I appreciate the effort you put in. :)\n\nTLDR: ewww wall of text shut up\n\n", "score": 4, "replies": []}, {"body": "Tldr", "score": 1, "replies": []}]}]}, {"body": "That’s a lot of words for ‘big debt, no jobs’. ", "score": 3, "replies": [{"body": "If you look waaaaay back into my comments, I used to do shorter responses like that.  But then people argue back and forth that it isn't true, need examples or elaboration, etc... and in the end I end up writing even more just distributed over many comments and basically even fewer people read it all then.  So now I give the big blob, and it is still net-shorter.", "score": 1, "replies": []}]}, {"body": "I majored in trans gender lesbian interpretive improvisational music on the butt bongoes! With a minor in neo gendered cat studies. 95k in debt but my local Starbucks is hiring. ", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Because you were 17 when a trillion dollar industry with a massive moral hazard enticed you to take a loan they would never have made if they had to be held responsible for delinquency as if it was literally any other type of loan. ", "score": 2, "replies": []}]}]}, {"body": "Student loans can create a financial crisis.\n\nToo much debt across a significant percentage of the labor force will hurt savings, as has already been demonstrated. Lower savings (s) -> lower capital stock -> lower gdp & slower gdp growth as future investment/reinvestment becomes more expensive (Solow growth model). Lower gdp will lead to unemployment/underemployment increasing. \n\nlow gdp + low growth + unemployment = bad recession", "score": 6, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "no but cutting down the corporate and high-income earner tax rate, running a worse deficit, and *then* having a bunch of students default on loans might be", "score": 2, "replies": []}]}, {"body": "It can have a depressive effect on savings but that’s not the same as the MBS crisis where defaults provided a direct catalyst event", "score": 8, "replies": [{"body": "So kinda like the difference between a heart attack and cancer.", "score": 3, "replies": [{"body": "The goal here isn't to make the world a better place, it's to get rich off some piece of knowledge!!!\n\nThe only way to get rich off student loans is to loan money to students.  Worst case, you might need to get a pal in the government who can help you keep them from weaseling out on paying you back", "score": 2, "replies": []}]}]}, {"body": "This kids gonna pass his macroecon exam", "score": 9, "replies": [{"body": "I mean, I got a 99, thanks for asking. And it's Development Economics, I actually did pretty shitty in macro because I screwed around in most HS stuff.", "score": 0, "replies": []}]}, {"body": "I agree with you the burden of these debts will vastly damage the future economy and vastly slow growth. **BUT** that is more of an economic and socio-generational crisis.  Financial crises are abrupt and acute damage to the financial system – like sudden cuts in liquidity as per 2008 where the repo market basically just stopped.  I agree with your analysis, but it won't result in a sudden cut in the financial system, instead it will result in one or more generations worth of slow anemic growth.  It is a major disaster with major economic implications, but it will play out slowly over a long period of time (many decades) instead of behaving like a metaphorical bomb just went off somewhere in the financial sector.\n\nIts like the difference between a metaphorical earthquake leveling a city (financial crisis), and a city slowly and painfully being displaced and leveled by encroaching glacier from an ice age (social/generational-economic crisis).  The later may actually kill more people and do more damage if only indirectly, but it will play out over a much longer slower time period and is a very different beast.", "score": 3, "replies": [{"body": "Eh alright, I can see the distinction. Though the recession may lead to any number of other reasons for a financial crisis to begin (more specifically the junk bond thing), and I'd argue that student loans would still have a sort of causal effects in *that* financial crisis.\n\nThe student loan recession would be like a catalyst for the junk bonds to, idk, undergo combustion? Something like that.", "score": 1, "replies": [{"body": "Generally I agree, but I think the time-scale that the student debt crisis will play out over will vastly change its perception and what it can effect.  Recessions are where economic activity dips relative to \"normal,\" but the size and the scale of the US student debt crisis and the time span it will play out over is such that it will probably create a \"new normal.\"  Most of this \"new normal\" will likely look like a recession if compared to earlier periods of US economic growth, but as it will become the new baseline for measuring recessions it won't be a recession itself, instead recessions will become defined relative to it.  The student debt crisis is a killing glacier, people will just stop talking about it and accept it as if it were as intrinsic to reality as gravity even as it continues to consume lives and property in the background at an accelerating rate - a \"new normal.\"\n\n>The student loan recession would be like a catalyst for the junk bonds to, idk, undergo combustion? Something like that.\n\nI see what you are saying.  Yes that is certainly possible, but IMHO many other things will set-off the Junk Bonds or other potential financial crisis long before the slow-creeping student debt crisis will.  Indeed I think the economic damage the student debt crisis will do will be so slow and creeping it may never be able to topple any teetering financial crisis triggers even though the student debt crisis will over time be doing colossal economic harm.\n\nFor comparison: Opiods now kill 49k people a year in the US.  This is a very real crisis, but it is still slow enough moving that even the most fragile bits of the financial system completely absorb its shock with no effect.  So even if the student debt crisis leads to like 200–300k people a year fleeing the nation or committing suicide, it still probably wouldn't be enough to set off things like the junk-bond bubble even though 200-300k people a year fleeing the country or committing suicide would be a staggering social and economic tragedy in its scale.", "score": 4, "replies": [{"body": "Good to hear another perspective, I appreciate the write-up.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Government deficit is interesting. Tax cuts to corporations for buy backs doesn’t seem like it’s healthy for the economy.", "score": 26, "replies": [{"body": "in a similar vein, when all the bonds bought during QE on the feds balance sheet need to be rolled, the private markets will not be able to absorb that supply. We'll likely see QE again in the next few years. ", "score": 7, "replies": []}, {"body": "A us government debt default would result in the worst depression mankind has ever witnessed since the fall of Rome. No one can fathom it.\n\nA regular recession would be caused by something way less bad than that. The MBS fiasco comes nowhere close to a government debt failure scenario", "score": 5, "replies": [{"body": "Hey, do you have any info on what negative effects (if any) we can expect from rampant deficit spending?\n\nIt seems like a lot of investing bigshots like Warren Buffett are terrified of it, but maybe that's only in the case of countries where it can lead to hyperinflation and/or default.  I can't wrap my brain around the intermediate steps between where we are now, and a complete worldwide financial meltdown from the US government defaulting.  (And I can't find any useful info online, since this has been a highly politically-charged topic for the last hundred years...)", "score": 6, "replies": [{"body": "there's some decent speculation (or at least rundown) on deepthroat IPO blogspot from the perspective that China is actively manipulating foreign currency markets and will likely be the source of the next big crisis\n\nspeculation on how to recover from that is exactly that - speculation; we've never had this type of global economy before and so we don't really know what the results of a bad actor will be, safe to say it's not going to be pretty", "score": 4, "replies": []}]}]}]}, {"body": "I think it's gonna be junk bonds.  Once the 10 year gets up to 4-5% I think we might see some people that are playing with leverage in the bond market get burned creating a cascade effect.  It's very analogous to the 90s bond crash.\n\nhttp://fortune.com/2013/02/03/the-great-bond-massacre-fortune-1994/\n\nWhether it's a crash or a recession will depend on how robust other parts of the economy are.  ", "score": 11, "replies": [{"body": "you mean Tesla is not a profitable company?", "score": 3, "replies": []}]}, {"body": "Chinese shadow banking and real estate", "score": 46, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Deepthroat blogspot IPO (google it) - that dude has been on a crusade against the flow of funny money and the use of dual currencies in China for 3-4 years now and has explained it way better than I can\n\nChinese ADR/ADS scams always seem to surprise US investors and yet they have been happening in various forms for decades now, seem to cycle through every 3-5 years\n\nThis one is going to be exacerbated by trade wars and the wanton printing of currency and government funded loans, as well as the purchase of US treasuries, that the CCP has been ramping up for the last 3 years \n\nDownside protection is tough because we are talking about the global financial system, but long dated puts on Chinese companies would be a start\n\nAmerican real estate has also been a huge benefactor of the currency flow out of China, so shorting financial institutions with a heavy mortgage portfolio is again in play", "score": 25, "replies": [{"body": "RE in seattle is already declining at a rapid pace. seems the chinese buyers have really dried up. ", "score": 16, "replies": [{"body": "ohho, you're not kidding:\n\nhttps://www.zillow.com/seattle-wa/home-values/\n\nlooks like 2% over the last couple of months, I dunno if it's Chinese money or just regular old cold feet though", "score": 7, "replies": [{"body": "Chinese money. Strong dollar and weak economic growth in China plus its harder to transfer money out of China ", "score": 10, "replies": []}, {"body": "you tell me, check Vancouver, Toronto, Sydney, and New York \n\nbasically every super hot RE market in the world had a huge flow of Chinese money that disappeared almost overnight", "score": 5, "replies": []}]}]}]}]}]}, {"body": "The next \"sub prime mortgage crisis\" will be the next sub prime mortgage crisis.\n\nBecause politicians buying votes didn't learn that framing \"the American dream\" as \"everyone deserves to own their own home\" so they make government hand out money to anyone who asks and guarantees the loans results in a shitload of people being over leveraged\n\nAnd because consumers didn't learn that they can't spend more than they make forever and rather than having magic credit cards pay for everything, they actually need savings to protect against an economic downturn.\n\nAnd because no systemic changes were made to the causes of the first subprime cataclysm, it's definitely going to fucking happen again", "score": 25, "replies": [{"body": "> And because no systemic changes were made to the causes of the first subprime cataclysm, it's definitely going to fucking happen again\n\nmeh that's not entirely true. the US banks are better capitalized and have less leverage this time around. Chinese banking system is far more vulnerable than ours. ", "score": 10, "replies": [{"body": "The most recent recession is always the one people are afraid of.  It's almost never the same thing twice in a row.", "score": 7, "replies": [{"body": "agreed. history rhymes, not repeats. ", "score": 2, "replies": []}]}]}]}, {"body": "Yeah corporate shit debt seems most likely\n\n", "score": 26, "replies": [{"body": "Yeah the corporate debt thing is the most worrying.", "score": 12, "replies": []}]}, {"body": "I’m game for WW3 ", "score": 15, "replies": [{"body": "FPS games need more content.", "score": 16, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Germany of course, who else would want to? ", "score": 26, "replies": [{"body": "Austria-Hungary, obviously. They sat out the last one, now they're going to instigate again", "score": 12, "replies": [{"body": "What are you talking about? Both Austria and Hungary fought in WW2", "score": 2, "replies": [{"body": "Doesn't count if they're separate.", "score": 1, "replies": []}]}]}]}, {"body": "Thailand ", "score": 5, "replies": [{"body": "lady boy revolt? ", "score": 12, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "you're supposed to get it treated before you need to go to the hospital\n\nthe first rule of 'does this look right' is to have a professional take a peek", "score": 1, "replies": []}]}]}]}, {"body": "I'm gonna go with World War 5: [https://www.youtube.com/watch?v=0dZIutRz9hw](https://www.youtube.com/watch?v=0dZIutRz9hw)", "score": 1, "replies": []}]}, {"body": "The subprime crisis only became a global financial crisis be Use of bad Math.\n\nCdos were mispriced. They had assumed a AAA - A but the underlying asset were in reality B.\n\nThis error in probability on trillions of asset lead to insolvencies then a liquidity crisis.\n\nFo there to be another global financial crisis you'd need another situation of bad math on trillion of asset \n\nThe nearest event would be chinese property bubble popping.", "score": 6, "replies": [{"body": "It wasn’t really bad math. The AAA bonds were filled with subprime mortgages from different areas of the country. The belief back then was that collapses were regional. They never imagined a collapse of that scale would occur nationwide. Therefore, due to that mindset, these bonds were classified as AAA instead of B. ", "score": 5, "replies": [{"body": "So it was bad logic?", "score": 3, "replies": []}]}]}, {"body": "MU bag holders.", "score": 12, "replies": []}, {"body": "my guess is china. https://www.cnbc.com/2018/11/19/china-corporate-bonds-experts-warn-of-more-defaults.html?yptr=yahoo\n\nalso American consumer debt is out of control\nhttps://www.google.com/amp/s/www.fool.com/amp/retirement/2018/09/23/10-years-later-how-has-americas-consumer-debt-evol.aspx\n\ncombined with corporate debt \nhttps://www.google.com/amp/s/www.forbes.com/sites/jessecolombo/2018/08/29/the-u-s-is-experiencing-a-dangerous-corporate-debt-bubble/amp/\n\nputs all around ", "score": 5, "replies": []}, {"body": "The auto industry is eventually going to tank hard, the signs are already there. It will probably dominoe into the dealerships who seem to finance and hand out cars to anybody, especially those who can't afford to make payments. Don't think it will reach subprime mortgage level crisis but it's gonna be pretty bad.", "score": 4, "replies": [{"body": "Cars are more liquid than houses. I doubt that would happen. ", "score": 1, "replies": []}, {"body": "So, short every major car company?", "score": 1, "replies": []}]}, {"body": "Chinese debt", "score": 8, "replies": []}, {"body": "There won’t be a student loan debt crisis because there is no collateral tied to it.  A lender can foreclose on a house, they can’t just take your degree.  ", "score": 3, "replies": []}, {"body": "junk bonds, fallen angels, and corporate debt defaults is the correct answer this time around. also sub prime auto lending. loooots of crap car loans have been made to poors this cycle. ", "score": 8, "replies": [{"body": "agreed on the auto loans, I think this is being mentioned a lot less. subprime auto loans is pretty high atm   ", "score": 6, "replies": []}, {"body": "and on such good terms! buying used cars on 6+ year loans is astonishing to me", "score": 3, "replies": []}, {"body": "I am pretty shocked the number of negative equity, consistently losing companies whose debt trades near/below par.  Who exactly is buying this debt?  It is so confusing.", "score": 1, "replies": []}]}, {"body": "Twittler-maggedon.", "score": 3, "replies": []}, {"body": "I bet on ww3", "score": 3, "replies": []}, {"body": "You'll have to wait another 68 years", "score": 3, "replies": []}, {"body": "median house price for houses sold has been above the 2007 peak since 2013. tons of young people are saddled with tens of thousands of student loan debt. they're gonna say its another housing crash caused by the student loan bubble.\n\nboth were lies. Tesla delevered cars in 2008; tesla reported a profit in october 2018", "score": 3, "replies": [{"body": "ah so it's corporate junk bonds then", "score": 2, "replies": []}]}, {"body": "It's going to be unemployment due to automation and unskilled workers. Social security is a giant pyramid scheme and half the US population is going to lose their jobs over the next 20 years. People are having less kids, living longer, and there will be fewer jobs. ", "score": 4, "replies": []}, {"body": "OPs mom finding out she's ghey", "score": 6, "replies": []}, {"body": "CMBS", "score": 2, "replies": []}, {"body": "Foreign Exchange Credit Swaps before the etf bubble bursts. ", "score": 2, "replies": [{"body": "oo i like this one\n\ni was reading about it the other day, it's almost incredible that we allow this to happen\n\nbest question is: how to profit off failure?", "score": 1, "replies": []}]}, {"body": "A jump in inflation, and subsequent interest rate spike would fuck things up pretty well.", "score": 2, "replies": []}, {"body": "Huge national  brick and mortar companies that have to make insane revenue to eek out a bit of profit to cover all their leases, employees, and garbage inventory.  Amazon and small online shops making them drop the soap.  See past toys r us & bed bath and beyond, future see BBY and LB.  ", "score": 2, "replies": []}, {"body": "EM debt (usd denominated)", "score": 2, "replies": []}, {"body": "!remindme 3 months", "score": 1, "replies": []}, {"body": "!remindme 2 months", "score": 1, "replies": []}, {"body": "I think Trumps gonna lose the next election and the USA will crash hard. The only thing that can save the US economy now is Trump 2020 which won’t happen cause of the fake media", "score": -11, "replies": [{"body": "The only thing that can stabilize the US economy is us putting a president with moderate social views, aggressive climate and resource views (alternatives and resource management NEED to be a priority or industry will pay the price before consumers.  There is a tipping point), and conservative fiscal views.\n\nTrump 2020 would be an unmitigated disaster for this country’s future on the world stage. And our global standing contributes much to our economic standing.", "score": 4, "replies": []}, {"body": "Man trumpets are so dumb. The reason the bull market didn't continue is his idiotic trade policy.", "score": 2, "replies": []}]}, {"body": "This wont happen for a while, I work in banking everybody has a job now and most people are working. Things are very strong as it stands.", "score": -16, "replies": [{"body": "The irony in this response is amazing. Put yourself in the shoes of the banking industry in early 2007. What a ducking moron", "score": 15, "replies": [{"body": "Bitch I was 9 at that time stay with the present Ok this is wsb. One of us here will end up being a millionaire one day.", "score": -16, "replies": [{"body": "One of us in this thread will be a millionaire?! And only 40 of us have commented so far! 1in 40! I like those odds! \n", "score": 3, "replies": [{"body": "Well if your here means u love money and stocks is a way to make alot. One of us will keep doubling his profits.\n\nRich involves luck and brains but luck plays just as a much of a part ", "score": -1, "replies": []}]}, {"body": "So, you’re s kid who doesn’t know what the hell hes talking about? Maybe, sometimes, you should listen to others and not share your ignorant bullshit. ", "score": 5, "replies": [{"body": "Says the idioy who invester in that oil stock and is down on his money ", "score": 0, "replies": []}, {"body": "Yet I have a 56k portfolio mabey your stupid old ass should stfu and listen to new generation stargety. Unless u have at least 100k u went tought 2008 a huge opportunity and have nothing to show for it be useful and show me all the money u made ", "score": -2, "replies": [{"body": "Prove it ", "score": 4, "replies": [{"body": "Ok I'll send u a pic of my cock right before I cum ok I'll squeeze the head before all the yummi sperm tendies come out ", "score": -2, "replies": [{"body": "Yikes seek help", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "RemindMe! 1 year", "score": 2, "replies": [{"body": "Dude look around u everyone is working companys are all hiring. Shit is good now and most of the people in college I know have debt but student debt not housing or anything else that actually matters stop wearing a tin foil ", "score": 1, "replies": []}]}]}]}
