{"title": "CD Project and the CyberDunk 2020 - and the rebound", "selftext": "Put your bananas aside, I have something for your handful of brain cells.\n\nLet's quickly recap the Cyberdunk 2077 release:\n\n* Awesome teaser trailer 8 years ago.\n* Insane hype train accelerating over the years:\n   * I mean just look at videos like this from 2019: [WhatAPromoVidSoCoolDisGame](https://www.youtube.com/watch?v=l2KozvzdKr4)\n   * Keanu Reeves\n* Stock hits $128\n* Release postponed to December\n* Stock drops to $88, rises again to $119\n* Release:\n   * Bugs bugs bugs\n   * Bad graphics on old consoles\n   * Big shitstorm\n* Stock dips and dips and dips and dips… Now around $42\n\n**Ok just sounds like they totally botched it. But did they?**\n\n1. Bugs everywhere..  \nDoes anyone remember the Witcher 3 release though? It was also pretty buggy. Ok, maybe not AS much. But still, CD Project has a history of releasing buggy games and fixing the issues later on. Witcher 3 is now one if not the most iconic RPG games. Search [Reddit](https://www.reddit.com/r/witcher/comments/36ewbt/official_bug_thread/?sort=confidence), browse [Youtube](https://www.youtube.com/watch?v=KpAGtIdANK4) or whatever to get an impression of the bugs.  \nFor Cyberpunk they have [plans for fixing and free DLCs already released](https://en.cdprojektred.com/news/cyberpunk-2077-our-commitment-to-quality/). Given their history, I trust CD Project to fix the game and make it one of the best.\n2. [13.7 mio. copies sold in 2020](https://www.cdprojekt.com/en/wp-content/uploads-en/2021/04/management-board-report-on-the-activities-of-the-cd-projekt-group-and-cdc-projekt-sa-in-2020.pdf) (65)  \nThis is the number of copies sold in 20 days. To put this into some relation, CD Project sold [20 mio. of Witcher 1, 2 and 3 together](https://www.cdprojekt.com/en/wp-content/uploads-en/2016/03/FY_2015_results_presentation.pdf) (4) in the whole year of 2015, the release year of Witcher 3 (which was released in may, so 8 months of selling).  \nAlso worth mentioning: [Only with the pre-orders](https://www.cdprojekt.com/en/wp-content/uploads-en/2020/12/current-report-no-652020.pdf)  of digital distribution channels (\\~8 mio.) CD Project covered all  development cost of Cyberpunk 2077 as well as all marketing and  promotional cost until the end of 2020. So the revenue on more than 5  mio. is solely going into the pockets.  \nSo overall some damn good  numbers. And there is still potential. Consider that some degenerates  like myself didn't buy the game yet but probably will, when most bugs  are fixed.  \nCD Project also wants to massively extend the Cyberpunk universe.\n3. The refunding campaign  \nFollowing up to the disastrous release, CD Project started a refund campaign for Cyberpunk 2077.  \nI couldn't find the number in official documents, but [some sources](https://www.ign.com/articles/cdpr-issued-some-30000-refunds-for-cyberpunk-2077) say 30 000 copies were refunded.  \nThis is 0.2% of the sold copies!! Doesn't look like a bad game to me. I wouldn't be worried if the refund numbers would exceed 1% or more, and even that is so far from where we are. Sounds a lot for shitstorm and media cryout. \n4. The hack  \n[CD Project got hacked](https://twitter.com/CDPROJEKTRED/status/1359048125403590660)! And the attackers stole the source code from Witcher 3 and Cyberpunk!  \nOk, cool down. Pick up your banana again. CD Project gives a shit about  copy protection. None of their games have any, because they believe that  people who love the games will pay for them. Their Backups weren't compromised. So again just negative media coverage.\n5. The Witcher  \nIs not suddenly gone. The games sell and there is more in the pipeline. A  next gen version of Witcher 3 and an AR mobile game (hunting monsters in  the real world instead of throwing Pokeballs at them) are announced  this year.  \nYou probably also watched the Netflix series in your  basement, missing some action of your wife and her boyfriend upstairs.  It was the most successful series on Netflix until then. CD Project has  all rights on Witcher. So guess what's gonna happen when the second  series is released in August.\n6. The financials  \nI don't want to overload your brain cells. Just let me tell you the company is rock solid. Liabilities could be paid right away. Net margin of >30% since 2015.  \nIf you think you can handle more numbers, check the [report](https://www.cdprojekt.com/en/wp-content/uploads-en/2021/04/consolidated-financial-statement-of-the-cd-projekt-group-for-2020.pdf).\n7. Conclusion  \nIt seems to me that the sky high anticipation paired with the disappointment was the best food for the media, journalists, click baiters and everyone who could profit from a dramatic coverage. And boy they did. If it was such a  bad game, more people would have used the refund campaign, so it was probably trashtalked it into oblivion.  \nThat's why the numbers speak a different language. Cyberpunk seems to be a success and the Witcher was always gonna continue.  \nSo looking at the whole picture, what has happened, what is going on and what is coming, I can only see this stock going upward.\n8. Positions  \nHolding 30 @ $87.08, 30 @ 74.49, and now bought another 30 @ $47.27\n\n**TL;DR**\n\n* Cyberpunk was financially a huge success, despite the bad media coverage.\n* The Witcher will fuel the rockets with a Witcher 3 overhaul, a mobile AR game release and the second season on Netflix.\n* Solid financials.\n* Ticker is OTGLF\n* 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nIf you find anything about the short interest, that would be something interesting to look at, too. I just found [this](https://otcshortreport.com/company/OTGLF/), stating that the daily percentage of volume shorted in April in some  days was <2% and some days >96%. Can anyone with a brain help me?\n\nDo your own DD and don't just buy stonks because some retard says it's good when he made only losses with it.  \nNumbers converted to USD from EUR or PLN.", "id": "n71qu6", "created_utc": 1620402882.0, "score": 35, "upvote_ratio": 0.75, "num_comments": 68, "comments": [{"body": "I've heard rumors that during the Witcher 3 times, they had a ton of obviously incredibly talented employees, but whom were being underpaid because they were in Poland. After Witcher 3 came out, they didn't get raises so most of them left for other studios. CP2077 didn't really start until after Witcher 3 completed. \n\nHard to imagine they get back to that level of competency without paying higher salaries and reducing profit. And they've burned all their hype or goodwill with CP2077, which is a truly broken clunky game at the core. No amount of bug fixes will help. Witcher 3 was a little buggy at first but the actual game was incredible and deep from the start.", "score": 14, "replies": [{"body": "It's true. I work in the same industry and even the best jobs there pay less than half of what they pay in other parts of the world. With the Witcher 3 under your belt you basically have a passport to work anywhere in the world. Why would those talented people stick around?", "score": 5, "replies": [{"body": "They were underpaid because they were in Poland. Just adding that the cost of living is also a lot lower there.\n\nAnd of course, if you participated in the Witcher your resumee is awesome.\n\nSome employees leave of course, that is part of general business. I haven't heard of a mass movement of devs.\n\nWhy they should stick around? CD Project is by far the biggest publisher in Poland. The company itself is safe, financials again. If they leave for better pay, they also leave their family. Not a thing for everyone.\n\nI don't think the change in staff is impairing the company.", "score": 2, "replies": [{"body": "If you choose to believe that, I won't stop you. I merely wanted to offer an inside perspective on the industry and share why I personally wouldn't invest. That's not to say it's not a good idea, and in fact there is a good chance that this massive decline could be quite lucrative. \n\nAs for moving across country lines for better pay, it's very common in my industry, especially europe. Since you can just hop on a plane for a few zloty and see your family every weekend anyway, not to mention you would actually have weekends unlike if you are working for cdpr. Ironically, you might actually see your family more.", "score": 3, "replies": [{"body": "Thanks for that!", "score": 2, "replies": []}]}]}]}]}, {"body": "you can’t be fucking serious man, the cyberpunk fiasco was one of the worst launches in history of gaming. i love how you spin this and cherry pick but here’s the reality not lalaland that you live in :\n\n• Cyberpunk is not back on consoles even half a year after release, that’s how bad it is\n\n• the game is still full of bugs, 5 patches later and it’s still a buggy mess\n\n• Promoted features that don't even exist in the game, straight up lying to customers faces. Demo gameplay rigged with features that don't even exist in the final game\n\n• DLC not even announced\n\n• the game only sold because of the hype, go to Steam and check the numbers, nobody plays Cyberpunk anymore\n\n• top dogs at CDPR rewarding themselves with 5 mil $ bonuses while employees work their asses off 15 hours a day + overtime\n\n• worst management ever putting all the resources in marketing instead of R&D, forcing developers to release unfinished garbage\n\n• top employees who made Witcher great left the company\n\n• lawsuites from stakeholders or did you forgot about those ?\n\nDo you work at CDPR in marketing cause you’re hyping this stock like they hyped Cyberpunk last year.", "score": 29, "replies": [{"body": ">• Cyberpunk is not back on consoles even half a year after release, that’s how bad it is\n\nIt's not back on the PS store, it's still available on the Xbox.  \n\n\n>• the game is still full of bugs, 5 patches later and it’s still a buggy mess\n\nThe game is still full of buggs on the base xbox and PS games, i play the PC version and it's wonderfull. I personally do not believe the game will run like it should on these versions. The next catalyst for the stock will be the Next gen release later this year.  \n\n\n>• Promoted features that don't even exist in the game, straight up lying to customers faces. Demo gameplay rigged with features that don't even exist in the final game\n\nWhich gaming studio is not hyping their game before the release? \n\n&#x200B;\n\n>• DLC not even announced\n\nFair point\n\n&#x200B;\n\n>• the game only sold because of the hype, go to Steam and check the numbers, nobody plays Cyberpunk anymore\n\nThey sold 13M copies (with 1 million refunds), which is huge in the gaming business. This is an extraordinary number. The Witcher 3 sold for 30M copies, which is also extraordinary.\n\n&#x200B;\n\n>• top dogs at CDPR rewarding themselves with 5 mil $ bonuses while employees work their asses off 15 hours a day + overtime\n\nBobby Kotick receives hundreds of millions of compensation while firing hundreds of developers. I don't see the issue here with a 10% bonus payout to management.\n\n&#x200B;\n\n>• worst management ever putting all the resources in marketing instead of R&D, forcing developers to release unfinished garbage\n\nThat is not true, 50% of budget went to R&D and 50% went to marketing.  \nDo better research\n\n&#x200B;\n\n>• top employees who made Witcher great left the company\n\ngreat point, there is developer turnover after the release of the Witcher 3, which can be a significant risk.\n\n&#x200B;\n\n>• lawsuites from stakeholders or did you forgot about those ?\n\nI don't see any significant impact from these lawsuits.\n\n&#x200B;\n\nAt the current valuation below $5B USD, i am very bullish on CDPR with the current risk-reward. The Next-gen release of the Witcher 3 will do great later this year and we need to see if Cyberpunk 2077 will be succcessfull on the PS5 / Xbox Series X.  \nFrom my experience in investing in gaming companies, I am pretty confident that the valuation will rise in anticipation for the release of the Witcher 4 + Cyberpunk sequel.", "score": 3, "replies": []}, {"body": "The game Cyberpunk itself was an epic fail, we are on the same page there. And this is definitely on the management.\n\nWould you give me the source for the employees leaving? From what I've come across two people leaving was in the news. One was a guy balancing quests, items etc and one was a toxic lead director. So not really what I would call crucial to the Witcher success.\n\nThe CD Project allocated money for the lawsuits. And until there is an outcome, it doesn't make sense to speculate over it.", "score": 2, "replies": []}, {"body": "cdpr don't do DLCs. Thats why gamers love then", "score": -2, "replies": [{"body": "sure, that's why Witcher 3 had 16 DLC + 2 expansions, cause they don't do them. why even talk if you don't know what you're talking about ?", "score": 6, "replies": [{"body": "He meant paid dlc. The witcher only has paid expansions, the rest of the dlc is free.\n\nI agree with your original post. What scares me more is that, even after cdpr fixes the hot mess that is currently cyberpunk, they might call it a day without introducing any of the proper features. Content is simply missing, and most of the current side content is as bland as it can be. Even if the game runs perfectly, it is still an empty shell of a game.", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "I don't think the next game is gonna make or break them, the Witcher seems to easily carry them. And I do think the over pessimism is showing in the price. Their earnings were good.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Don't they own GoG?", "score": 3, "replies": [{"body": "Yes, they do. But GoG seems to be a black zero.", "score": 1, "replies": [{"body": "GoG is legit, I've bought games from them. I like it more than steam.", "score": 5, "replies": []}]}]}, {"body": "I actually think 80 could be still possible this year. Depends a lot on how their roadmap is working out.", "score": 1, "replies": []}]}]}]}, {"body": "Didn't they just lose the dude that did Witcher 3(the best RPG of all time)? I won't be buying..", "score": 10, "replies": [{"body": "They lost the Lead Director, yes. Under his lead there was probably mobbing though, so I see this as an opportunity for getting better leadership.", "score": 4, "replies": []}]}, {"body": "Nope 🙅🏻 not for me call me a 🌈🐻 on this one", "score": 8, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Guess you played on a computer?\\^\\^", "score": 2, "replies": []}]}, {"body": "2 million copies were fefunded\n\nAccording to community reports *", "score": 3, "replies": [{"body": "Would you give me a link? :)", "score": 1, "replies": [{"body": "It was a YouTube community poll. I'm sure plenty of people lied.\n\nHowever, 30k is definitely lower than the proper amount refunded. That 30k is solely counting people who used the help me refund button on CDPRs site.\n\nThere were a myriad of other ways to refund", "score": 4, "replies": []}, {"body": "Yeah it was a poll by upper echelon gaming, here's a link to an article covering it.\n\nhttps://www.google.com/amp/s/www.gamingbible.co.uk/news/games-nearly-2-million-copies-of-cyberpunk-2077-have-been-refunded-20210205.amp.html", "score": 2, "replies": [{"body": "Thanks for that!", "score": 2, "replies": [{"body": "Yes sir, not a problem", "score": 1, "replies": []}]}]}]}]}, {"body": "This is a down stock that I foresee actually having a big rebound. Only question is where is the bottom? It could be around current levels, but it might be a little further down.\n\nIf one does time the bottom on this, they'll stand to make a good chunk.", "score": 4, "replies": [{"body": "Yeah, noone knows where the bottom is. The current price is quite a good bet I think, as they had only negative press recently and with the Witcher positive coverage is around the corner.", "score": 1, "replies": [{"body": "I'm invested. However, it's still super risky as the downtrend has yet to show decent signs of breaking. I would encourage those not in to add it to their watchlists though. It has big potential. Just needs to show a little more.", "score": 4, "replies": []}]}]}, {"body": "Puts on Panam. ( ͡° ͜ʖ ͡°)", "score": 5, "replies": []}, {"body": "I've been following cdpr for at while now and I think it's oversold because Americans got the worst experience on ps4 with cyberpunk, and think cdprs success somehow is hanging on a thread connected to cyberpunk. This is far from the truth, and despite the failed launch of cp2077, their Financials are looking solid and still growing revenue. Mobile witcher go game could be a huge success and cyberpunk re-release to Playstation store is gonna happen at some point.\n\nThere are too many angry nerds on reddit, that bought into the overly hyped best game ever made bullshit, like they were somehow gonna get their first orgasm by playing cyberpunk.", "score": 4, "replies": []}, {"body": "Just one comment from Polish guy,\nIt's better to buy actual stock on Warsaw stock Exchange (WSE: CDPR) where the volumes are really low and even small investment can make it skyrocket :)", "score": 3, "replies": [{"body": "Did you have some success there? :)", "score": 2, "replies": []}]}, {"body": "Same here. Long", "score": 3, "replies": []}, {"body": "Maybe I'm an idiot. Can someone explain the difference between OTGLF and OTGLY? I've bought stocks of OTGLY, and some articles say that is CD Project Red's ticker symbol. But OTGLF seems to also be the same.", "score": 3, "replies": [{"body": "OTGLY is a quarter of a stock. They are both CD Project.", "score": 6, "replies": []}]}, {"body": "this is shit DD. game companies usually do shit unless they monetize the fuck outta everything. Cyberpunk can't even get a QA going on their flagship. fucking selll naked calls out a year and buy PUTs on this mofo with your premium. that's the play. this thing is going nowhere but down.", "score": 3, "replies": [{"body": "How was CD Project so successful when they didn't monetize the fuck outta Witcher?", "score": 1, "replies": []}]}, {"body": "I was honestly surprised at how little attention AC:Valhalla received regarding the bugs it was full of. There were easily 20 game breaking bugs when it was released, at least a dozen ongoing bugs that were discovered within the first month of its release, and every update creates new issues. I think CyberPunk just caught the media's attention and CD Projekt experienced an overreaction with its stock.\n\n\nEdit: after reading some other replies, the stock may actually be at appropriate levels lol. I still stand by my feelings towards Valhalla, though.", "score": 3, "replies": []}, {"body": "Umm as in avid gamer, and somebody who fell in love with the company within hours of playing Witcher 3... I have zero trust for CD project red. And it won't be back for a good long time. Many people share my sentiment, and I don't believe they will recover UNTIL they release an honest to God great game and it's viewed as underrated before it explodes. And that's gonna be a good long while. So no. They're not gonna rebound any time soon, or at all.", "score": 3, "replies": []}, {"body": "I have CD Projekt stock too, think it has room for a rebound. \n\nThey basically made a racing, shooter and open world game with Cyberpunk 2077, have trust in the studio that they belong to one of the top game developers. So PE is about 14 now compared to 32 for ATVI for example. It might take a little while, but I think there is potential!", "score": 3, "replies": []}, {"body": "As a long term investor I am very bullish on CD projekt RED.In my bull case the price shoots up to PLN 400 over the next 4 years and in the worst case it goes down to PLN 100 (+100% vs -41%). High risk, high reward suitable for my own risk tolerance.\n\nThere are a couple of catalyst this year that will help this stock:- Next gen release of the Witcher 3 to PS5 / Series X / PC- Next gen release of Cyberpunk 2077 to PS5 and Series X\n\nAnd they are currently transforming CDPR to develop The Witcher 4 and Cyberpunk 2077 sequel at the same time. So they will be able to launch titles in shorter timeframes.The Development team of CD Projekt RED is extremely passionate about creating games and you can follow the stream from Pawel Sasko every sunday where he goes to the development process of Cyberpunk 2077.\n\nWe are at a point in the gaming industry where the publishers are trying to maximize profits by overmonetizing games and focussing on mobile games.And that true triple A development is becoming less lucrative.The big dogs that understand Triple A development are buying the gaming studio's dedicated at creating these titles looking at you Sony, Microsoft (if you want to be safe, invest here).And the big publishers are starting to dissappear from this space except for the ones that are playing close attention to providing value at consumers, looking at you Capcom.\n\nCapcom is focussed on deliverying value to the customer after playing around with overmonetizing DLC etc.. This is noticeable in their huge succes from the latest years (resident evil 8 launch, Final Fantasy remake etc.) and their stock is being rewarded for this.As a small cap gaming studio: CDPR that is focussed on providing value to the customer with a passionate development team behind this, I am confident in placing a long term bet here.", "score": 3, "replies": []}, {"body": "If they continue to drop, could be prime for MSFT to acquire.  They are not done picking up developers and this would be a serious blow to Sony, with Bethesda already being acquired by MSFT.", "score": 6, "replies": [{"body": "I had this scenario in my head as well.\n\nAt the latest earnings call it was adressed whether CDPR was open to being acquired.  \nThey clearly stated they were not interested in being acquired. And looking at the structure of CDPR, management positioned themselves to not being acquired and having the largest stake in CDPR. I actually don't see management selling CDPR to another company based on this information and their attitude.", "score": 1, "replies": [{"body": "It all depends on the offer.  They seem to have a working relationship with Microsoft given the Witcher series being on GWG and GP.  I don't think any of the studios Microsoft bought were \"looking\" to be acquired.  Also that sounds the opposite to me, in the event of an offer who gets the biggest payout?", "score": 1, "replies": [{"body": "I kind of think that CDPR management views themselves as in the same position as Mark Zuckerberg. If i should believe the stories the napster guy persuaded him to keep control of the company and never sell out because of the upside potential.\nI wonder if that is the reason management wants to keep control.\nImo it is a good thing, since studio's that are acquired might need to focus on profitability instead of making good games.", "score": 1, "replies": [{"body": "Maybe, but if you're offered big money and shares in Microsoft it's hard to turn that down especially if your own share price is stagnant or your company name has been tarnished....  The potential upside of being on board with the company that had a serious long term gameplan and more cash on hand than just about any other company out there is one worth considering.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "They have this [https://thewitcher.com/dk/en/monster-slayer](https://thewitcher.com/dk/en/monster-slayer) coming out soon-ish, I think they have some early release / beta now. I still see some people play Pokemon GO, so this might be a steady revenue-stream with how many seem to enjoy The Witcher - and kinda free publicity with the netflix series, season 2 coming later this year.\n\nJust looking at their financial statement, I don't think CDPR is going to die anytime soon at least.", "score": 2, "replies": []}, {"body": ">Smartest thing would be for them to make a follow-up to the Witcher 3 in the same engine; Writing, design, textures (and even then W3 on PC was comparable to some recent titles now) & a handful of new mechanics on-to that engine would then be all that would be needed from a project standpoint. That would maximize returns & allow them to coast by on a less experienced team.\n\nuhm.. there is a next gen release coming out later this year for The Witcher 3. Using the same engine as Cyberpunk 2077.", "score": 1, "replies": []}]}, {"body": "They have a class action lawsuit against them, for investors. I don’t think this is a good “sale” right now maybe in a couple of years though.", "score": 2, "replies": [{"body": "They put money aside for that. Still not putting a dent in the finances. I don't think you can get a better sale than this ;)", "score": 2, "replies": []}]}, {"body": "The product is so broken it is beyond repair at this point. They won’t see the tail of sales they saw with TW3. And the company has suffered a huge hit to their reputation and are experiencing brain drain \n\nThis company is a mess and they have no way of changing the narrative in the short term given they rely on one game every few years", "score": 4, "replies": []}, {"body": "I agree. This is a great time to take advantage of the dip. Theyve stumbled, but they are way more valuable then their current price.", "score": 2, "replies": [{"body": "Last time they traded this low was around new year 2018/2019", "score": 1, "replies": []}]}, {"body": "I bought some yesterday. They still made so much money with Cyberpunk. And the Next Gen Version is still coming this year, so more sales incoming.  \n\n\n80$ ez", "score": 2, "replies": [{"body": "The next gen version will help a lot, I think the Witcher will do even more.", "score": 1, "replies": []}]}, {"body": "Tnx but no. Shitty company. 100% angry employees, shitty product, horrible bug fixing, still banned (at least in my country) by the playstation store. After a week it was already on ebay for 5-10 euros. They can fix bugs, but the product is still trash…as the company. Maybe a fairvalue could be 50-60…no more. Next failed lunch will bankrupt this company", "score": 2, "replies": [{"body": "Have you looked at their Financials? The failed launch of CP haven't had a big negative impact on earnings. Game is fine on pc and probably ps5 aswell. Will get re-released on ps4 at some point too. I think cdpr will be doing just fine in the next couple of years. Definitely oversold atm.", "score": 3, "replies": []}, {"body": "Yeah cyberpunk was a strong net positive on the company’s financials — may not have been as big as they had projected but it’s certainly deep in the black.", "score": 2, "replies": [{"body": "That's the thing. Even with how badly they fucked it up it is still financially a success.", "score": 2, "replies": []}]}]}, {"body": "Are you really trying to spin this shit company? Jesus Christ dude, just sell at a loss already and stfu", "score": 1, "replies": []}, {"body": "This may be a dumb af question. But I have an active WeBull account and an inactive RobinHood account, and you cannot trade in this for either of them. Why is that?", "score": 1, "replies": [{"body": "Maybe they have the second Ticker, OTGLY? It is a quarter of a stock", "score": 1, "replies": [{"body": "Both are OTC", "score": 2, "replies": []}]}]}, {"body": "Look at the stock prices around the Playstation Store takedown of Cyberpunk. It hit them hard. I don’t see the bounce happening until Sony puts them back on the shop when they announce the PS5 version.", "score": 1, "replies": []}]}
{"title": "If you sold EV stocks since April, congrats, you got whamboozled by whales.", "selftext": "Especially if you panic sold and sold them at a loss. You literally fell for the the easiest trick in the book and now your losses are gonna gobbled up for MASSIVE future gains.\n\nAnd of course you sold them for a loss, you bought them at triple price in February. \n\nYou also ignored basically 100% of analysts listing them as hold or buy, even the trashy ones like RIDE and NKLA.\n\nOf course you don't know how to read a stock's RSI.\n\nTLDR; have fun buying back these stocks for 10x the price in a few years like you did with Amazon.", "id": "n756vm", "created_utc": 1620411670.0, "score": 21, "upvote_ratio": 0.63, "num_comments": 68, "comments": [{"body": "So buy more Ride right now? Got it", "score": 19, "replies": [{"body": "Thank you for reminding me to buy puts on ride!\n\nOh, damn, it's already 40% lower than it was last time I checked...", "score": 2, "replies": []}]}, {"body": "I’m buying EV on the massive dip", "score": 13, "replies": [{"body": "Check out the Lion Electric Company $LEV, just entered the market today. They are signed with Amazon and Ikea among others.", "score": 6, "replies": [{"body": "Do you mean LVE?", "score": 1, "replies": []}]}, {"body": "\"DURRRR NO EVS ARE A SELL RIGHT NOW.\"\n\n-People with 90 IQ or lower", "score": 0, "replies": [{"body": "What tickers is your post referring to", "score": 1, "replies": []}]}]}, {"body": "Just bought some more RIDE today at 7.90", "score": 16, "replies": [{"body": "Quick question, what made the price dip so hard in the first place?", "score": 2, "replies": [{"body": "Whole sector is down, plus withdraws from spacs first of all. Then if you add a couple of stupid comments from the CEO which drew the attention of short sellers, and on top of all that sprinkle on top a lawsuit and a terrible showing at a highly publicized race in the desert you have the shit show that it is today! But the factory alone is worth more than what it’s priced at today even though sentiment is down, the product is still there. EV is coming and they have their own niche. I wanted to get in to EV and this is the company I chose! I believe they will end up successful", "score": 5, "replies": [{"body": "They are quite behind in technology and have A lot of issues to solve to be able to develop a functioning car. A lot of this bad news was exposed so it dipped harder than just the whole sector... even below spac  price.\n\n\nIt has 176.5 million shares, @ 7.99 a share the company is valued  ... 1.4 Billion\n\n(It went public at a 1.5 Billion valuation)\n\nLucid Motors is valued at 4 billion\nTesla is valued 646 billion\nXL Fleet is valued 859 million\nNikola valued 4.5 billion\nNio  is valued 50 billion\nXpeng  valued 582 million \nCanoo  valued 2.1 billion \n\n\n.... well it's valued higher than XL Fleet which maybe is not a good sign as XL Fleet seems to be closer to actually selling the cars", "score": 2, "replies": [{"body": "Closer than September?", "score": 2, "replies": []}, {"body": "What are your thoughts on Fisker?", "score": 1, "replies": [{"body": "Fisker  valued at 1.8 or 3.3 billion its nearing its opening price... maybe wait for it to go under 10, seems like its at a good buying point if you believe in the company", "score": 1, "replies": []}]}]}, {"body": "Appreciate the info man , will definitely look to invest sooner than later", "score": 1, "replies": [{"body": "There’s a lot of info on there. I got in at about $15 a share and kept averaging down so now I’m at about $12.40 a share, so it’s definitely super cheap right now. There is an earnings call on May 17, we’re not sure if you’ll be good or bad news or indifferent, but they are doing it on Monday pre-market, so I’m hoping it’s good news.", "score": 2, "replies": []}, {"body": "Checkout the Lordstown motors sub", "score": 1, "replies": []}]}]}]}]}, {"body": "Ride will make 💰", "score": 17, "replies": []}, {"body": "Guess this post doesn’t include workhorse, because I am just taking a beating.", "score": 7, "replies": [{"body": "People still getting whamboozled. \n\nWhen people are scared be greedy, and you will prosper.\n\nWKHS is a buy IMO.", "score": 8, "replies": [{"body": "I feel the same way. I consolidated some of my gainers this week so I can average down next week.   I have time, patience and the cash.", "score": 3, "replies": [{"body": "Wkhs is a buy now but not before, the lawsuit fucked them", "score": 2, "replies": [{"body": "Lawsuit is BS. Everyone sues everyone in America.", "score": 5, "replies": [{"body": "So true. I think half my portfolio is being sued right now", "score": 4, "replies": []}]}, {"body": "Ya lawsuit killed them parlayed with losing the USPS bid", "score": 1, "replies": []}]}]}]}]}, {"body": "“Things nobody gives a fuck about for 500 Alex!”", "score": 27, "replies": [{"body": "That's how you keep getting bested by fatty whales.", "score": -34, "replies": [{"body": "Maybe that’s how you get fucked on stonks lol. Congrats on feeling the need to talk shit to whoever’s trading EV stonks because you finally made a profit after probably being -99% ROI lmfao.", "score": 6, "replies": [{"body": "I laugh at ANYONE who sells future stocks that are at all time lows.\n\nIts literally the worst thing you could do.", "score": -17, "replies": [{"body": "I’m 50% Tesla shares and 50% Tesla leaps but you sound like a loser who bought the top on the shitty spacs.", "score": 10, "replies": [{"body": "My averages are in the $10 range, so no. \n\nThough I'm definitely laughing at all the people who bought over $20 and selling at $9.", "score": -8, "replies": []}]}]}]}]}]}, {"body": "Don't worry, you'll have a chance to buy them back at a discount next month... Or next year... Or the year after that.", "score": 6, "replies": []}, {"body": "Bitchplease i'm not gonna sell my Tesla shares until never.", "score": 11, "replies": []}, {"body": "RIDE is not trashy.", "score": 5, "replies": []}, {"body": "Easiest trick in the book?\n\nPls tell me it was a short-ladder, pls?!", "score": 10, "replies": []}, {"body": "ACCURATE", "score": 5, "replies": []}, {"body": "Just buy bp or shell undervalued and with the reopening coming soon demand will shoot up. We’re seeing a medium term shift from growth to value", "score": 4, "replies": []}, {"body": "So my plug will go back up? I’m still in the black, but kicking myself for not selling at 70", "score": 6, "replies": [{"body": "Wait you have plug. I am waiting for it to go up", "score": 2, "replies": [{"body": "I got in when it was worth nothing.", "score": 1, "replies": [{"body": "Still want it to go up right? Coz it feels like it's nothing ATM", "score": 2, "replies": [{"body": "I got in for about $2 a share. So I’m 10x on my investment. But I was as high as $74 a share and decided to keep holding", "score": 2, "replies": [{"body": "Nice, I got in at $39 and went all the way up to $74 and still didn't sell.\n\nGuess you happier than I am lol.", "score": 1, "replies": [{"body": "Yeah, I truly know knotting. Just seemed like a cheap stock, and I didn’t know better when it hit 74. Maybe someday I’ll be twice as dumb as the apes on this sub, then I’ll be smarter than I am now.", "score": 1, "replies": [{"body": "Well good luck!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "You sound a bit upset you ok there bud?", "score": 8, "replies": []}, {"body": "EV stocks are manipulated by big crooks. Just look at NIO and XPEV. All good news but stocks are hammered pretty bad. These crooks are trying scare away small investor so they can steal their shares. I think, it is time to teach them lesson.", "score": 3, "replies": [{"body": "Same with Workhorse", "score": 1, "replies": []}]}, {"body": "We all cope in different ways, yours is this", "score": 6, "replies": [{"body": "My position isn't that bad.\n\nMy averages are between 9 and 12 bucks between many EV stocks. \n\nThere's nothing to cope. \n\nNow if I bought in at the height or anywhere near it, I'd be shattered.\n\nIf it unexpectedly goes south then you'll see some hardcore coping lol", "score": 1, "replies": [{"body": "You're coping with not selling the top on the most retarded valuation of an industry since the dot com bubble", "score": 7, "replies": [{"body": "I didn't even own any til they were under $12.", "score": 0, "replies": []}]}]}]}, {"body": "Bought RIDE and WKHS both this week. We’ll see.", "score": 2, "replies": []}, {"body": "I’m just wondering what inspired this retard tirade? Who made you mad with there EV moves?", "score": 2, "replies": [{"body": "Anyone who sold for a loss. Selling at a guaranteed loss (and we know its a guaranteed loss because a lot of these stocks are at all time lows) is basically being the guy who hits on 15 at the blackjack table when the dealer is showing a 6.", "score": 1, "replies": []}]}, {"body": "I sold at a profit.  But I’m thinking about just focusing on some blue chip dividend stocks.  \nHedges are really fing with stocks.  Att and Pepsi have been pretty good to me this year so far.", "score": 2, "replies": []}, {"body": "Nio and Xpeng going to the moon🚀🚀🚀. Above 100 EOY. Buying the dips.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "I'd honestly rather gamble my money 100x and lose it all then buy one stock and get rich 10 years from now. Like, where's the fun in that? \"Oh look at me, I did a smart and now I'm living in a McMansion and driving a German car! My wife doesn't even have a boyfriend anymore!\" You'd look like a complete asshole.", "score": 1, "replies": []}, {"body": "that mean i get my tendies back from FSK, HYLN, CCIV, GOEV, etc etc etc......????", "score": 1, "replies": []}, {"body": "2021 NIO loser checking in...Made a killing on them last year so I'm not crying.", "score": 1, "replies": []}, {"body": "I owned RIDE and sold it for a profit. It wasn't a panic sale. The EV market is rapidly evolving. The leading companies today, could have a misstep and loose their dominance. The big automakers are just starting to tool up to convert all or most of their production to EV.\n\nAny analyst worth their salt, would look at the total vehicle market, current and future trends, talk to auto executives,  to make their best estimate of where future demand will be.", "score": 1, "replies": []}, {"body": "Haven't stopped buying since Feb 2020", "score": 1, "replies": []}, {"body": "LEV to the mooooooooon", "score": 1, "replies": []}]}
