{"title": "GME, AAPL, TSLA, MVIS - All rolled into one company", "selftext": "**Sony**\n\n($SONY *formerly SNE*)\n\nGiven the GME interest, here is an investment idea.  Sony makes & sells games direct to consumers, without relying on a middle man (like Apple). Sony makes & sells the most sought after gaming machine - demand will likely exceed supply all year (at least). They're also into VR (and make & supply the small OLED displays that power VR headsets & viewfinders).\n\nSony has a well established music & movie studios.  They  recently signed large streaming deals with Netflix and Disney.\n\nSony is also the top producer of image sensors - from mobile phones (iPhone) to high end cameras (they also produce their own line of stills & cinema cameras and lenses) to industrial sensors for cars & other machinery (ahem MVIS).\n\nIn addition to car sensors, they are now road testing their own EV - way ahead of Apple and many of the recent TSLA-wannabe startups.  They are a key supplier for other companies (Apple, Nikon, Panasonic, et al.) and they use their parts for their own products (the competition helps to subsidize their own products like Samsung).\n\n&#x200B;\n\n**STATS & PEERS**\n\n&#x200B;\n\n**SONY**\n\n2020 Revenue $75.4B\n\nCap $126B\n\nP/E 11.8\n\n&#x200B;\n\n**AAPL**\n\n2020 Revenue $274B\n\nCap $2.2T\n\nP/E 29.5\n\n&#x200B;\n\n**SAMSUNG**\n\n2020 Revenue $212B\n\nCap $493B\n\nP/E 21.2\n\n&#x200B;\n\n**MSFT**\n\n2020 Revenue $143\n\nCap $1.9T\n\nP/E 34.3\n\n&#x200B;\n\n**NINTENDO**\n\n2020 Revenue $12B\n\nCap $69.5B\n\nP/E 17\n\n&#x200B;\n\n**TSLA**\n\n2020 Revenue $31.5B\n\nCap $683.4B\n\nP/E 710\n\n&#x200B;\n\n**CANON**\n\n2020 Revenue $29.7B\n\nCap $24.9B\n\nP/E 24.7\n\n&#x200B;\n\n**Notable Products**\n\n[Sony Semi](https://www.sony-semicon.co.jp/e/)\n\n[Sony Car](https://www.sony.net/SonyInfo/vision-s/)\n\n[Sony Cameras](https://www.sony.com/electronics/interchangeable-lens-camera-products/t/interchangeable-lens-cameras)\n\n[Sony Content](https://www.sonypictures.com/)\n\n[PS5](https://www.playstation.com/en-us/ps5/)\n\n&#x200B;\n\n**Revenue & Profits**\n\n[\\(in yen\\)](https://preview.redd.it/ldjqbne8xxw61.png?width=842&format=png&auto=webp&s=580c6bb9c64ab32fa56a2da955e5eeddee0b2441)\n\n&#x200B;\n\n**TL,DR**\n\n$SONY - Sony Corp 🚀\n\nSony is well-diversified, their product pipeline is promising, imaging & semi continue to grow and they are undervalued compared to many of their peers.\n\n*I'm not an investment professional, this is not financial advice. Invest at your own risk. Do your own research (please share relevant info).*\n\n*I own shares of SONY - I like the stock.*\n\n&#x200B;", "id": "n3m6m0", "created_utc": 1620010039.0, "score": 142, "upvote_ratio": 0.7, "num_comments": 70, "comments": [{"body": "I’ve been buying since it was $52 and I only have 19 shares cuz I’m a poor ape eating expensive name-brand crayons instead of great value crayons", "score": 79, "replies": [{"body": "Nice gain", "score": 21, "replies": []}, {"body": "Don't buy the boxes with the built in crayon sharpener, you can save money by getting a separate sharpener to put your dick in.", "score": 9, "replies": []}]}, {"body": "I think it's undervalued also, but I can't read, so what the fuck do I know.", "score": 24, "replies": []}, {"body": "But dont you think Sony like Apple are kind of plateaued at their current price?", "score": 16, "replies": [{"body": "sony went from 60 to over 100 in the last year and apple went from 71 to 132 in the last year, and you think they've plateau'ed? \n\nSony is a great stock, just like Apple. Only going to keep getting more valuable.", "score": 10, "replies": []}]}, {"body": "I worked for Sony during its hay day 2000’s it’s stock hit what I believe was it’s all time high it went on a roller coaster ride down hill and it started going back up this year I think it’s a safe bet going forward but then you shouldn’t listen to me I eat crayons 🖍", "score": 8, "replies": []}, {"body": "Didn't know Sony was also going into EV.  I hope their entertainment system and batteries will be great.  I don't know anything about their Autonomous Driving/A.I. efforts. They can design chips, just don't know much about their software side and user interface side.  Only recently have they started to improve their camera menu interface, after such a long time since the E mount Alpha cameras came out. Hope they will hire the right people to make those work.  Sony has a soft spot on many who grew up with their TVs, discman, and playstations. More recently, my favorites are cameras, and for a minority of people-high definition audio devices.  Even before Apple computers revamped to be cool again, Sony Vaio computers were the cool and powerful ones.  I look forward to see Sony fight back on other consumers products fronts.", "score": 5, "replies": [{"body": "They announced they won't produce their own car, this is just to test their equipment. I remember seeing an announcement from them in saying that they do not intend to manufacture cars", "score": 4, "replies": []}, {"body": "For what's it worth Sony batteries were the gold standard in electronic cigarettes' hay day.", "score": 3, "replies": []}]}, {"body": "Sony is at an all time high up 300% over the last 5 years. Are they really doing anything to justify entering at 100ish per share with the expectation they will keep growing at this rate? And that they’re not peaking right now with a pull back expected at any moment/in the near future? At least they themselves are being honest saying the expect profits to slip after a boom during the pandemic.", "score": 4, "replies": []}, {"body": "And it is on sale. It was a deal before this 10% drop. Only worry is that it's like some other companies like IBM or BB circa 2012, they have good financials but no spark.", "score": 8, "replies": []}, {"body": "https://twitter.com/KoolaidDont/status/1389025273551757313?s=19\n\nThis seems weirdly timed. Just 2 cents.", "score": 10, "replies": [{"body": "In 2019 GMEs market cap was 300million or something, while Michael Burry calculated that their net assets were worth over 1 billion.\nSo it was priced at 3$ but it was definitely worth much more.\n\nSecondly, their revenue was 6.4 billion, while their total costs were 6.7 billion. The costs were so high because they needlessly wasted a ton of money on an airplane and too many stores. With a few tweaks they could've easily turned a profit over 500million\n\nLastly, the gaming market is much bigger than games, so it's a little bit simple to only look at games. \n\nMaybe GME makes it or does not we'll see", "score": 1, "replies": []}, {"body": ">https://twitter.com/KoolaidDont/status/1389025273551757313?s=19\n\nI posted this weeks ago but didn't have sufficient karma at the time - it was deleted.", "score": 2, "replies": []}, {"body": "I mean for years it was getting shorted into the dirt, had ftds, and had institutional ownership >100%", "score": 1, "replies": []}]}, {"body": "BUY SONY at $100 or i could buy the supplier who makes the parts for sony and appl for a far cheaper price.  Foxconn $8.16.   AKA:  HNHPF also makes the parts for XBOX (MSFT).  and they are positioning themselves for 5G with patents.   True they are not listed on NYSE, you have to buy GDR through TD Ameritrade.  All true.  but i like the stock that makes the parts for the APPL iphone, and the parts for SONY playstation, and parts for MSFT xbox, many others, etc...  I have been holding a 100 share position for a long time. Finally seeing some movement. +17% YTD.", "score": 11, "replies": [{"body": "Foxconn going to get shit on this year by the state of wisconsin. Foxconn is a terribly mismanaged, dishonest company. Check out the what they did in Kenosha, WI.", "score": 11, "replies": [{"body": "Ex-roomie's friend in China worked at Foxconn. They made everyone live in gender-specific barracks. House \"Dad\" was a creep who had master keys regularly had his way with whomever whenever.", "score": 3, "replies": []}]}]}, {"body": "Holy shit sony bought gme AND aapl, but this guy only bought shares", "score": 6, "replies": []}, {"body": "[https://www.reddit.com/r/wallstreetbets/comments/l3me3t/sne\\_massive\\_double\\_dick\\_inside\\_poised\\_to\\_moon/](https://www.reddit.com/r/wallstreetbets/comments/l3me3t/sne_massive_double_dick_inside_poised_to_moon/)\n\n  \nThere was a massive DD on sony on wsb a while back", "score": 3, "replies": []}, {"body": "Sony has most of the anime platforms now too after buying crunchyroll from at&t already own aniplex and funimation. The new demons slayer movie also set records in the us and world wide.  Im not sure if the anime has anything to do with the stock but I know Sony dose own all of those.", "score": 3, "replies": [{"body": "For some reason, the Music division is the owner of crunchy roll / anime stuff and not Sony Pictures.  The anime releases were a big part of that division's revenue & profits.", "score": 2, "replies": [{"body": "Dose the music part have a stock i can buy?", "score": 1, "replies": [{"body": "$SONY", "score": 3, "replies": [{"body": "Roosterteether also might be getting sold by at&t and thats right up sony alley.", "score": 1, "replies": []}]}]}]}]}, {"body": "samsungs cap is $493?", "score": 7, "replies": [{"body": "Added the B to put it back in the three comma club.", "score": 5, "replies": []}, {"body": "Damn I spent a Samsung at the bars over the last week", "score": 3, "replies": []}]}, {"body": "Good read, but why do you think is undervalued?", "score": 2, "replies": [{"body": "P/E is under $19.6\n\nhttps://www.currentmarketvaluation.com/models/price-earnings.php", "score": 4, "replies": [{"body": "That chart in the article sort of looks like a crash is upcoming", "score": 5, "replies": [{"body": "Yes it does but there is a lot of money out there and Interest rates are pretty low but yes do your DD", "score": 1, "replies": []}]}]}]}, {"body": "I get your logic but remember logic doesn’t apply to the stock market. Shit goes down when its supposed to go up.", "score": 2, "replies": []}, {"body": "And don't forget, AMD puts chips in those Sony PS5's....", "score": 2, "replies": []}, {"body": "I’m buying!!", "score": 3, "replies": []}, {"body": "I don’t invest in Japanese companies. They are too conservative. They don’t take risks. They don’t want to grow and change the world. They want to make consistent, moderate profit and growth forever. \n\nNothing inherently wrong with that, but definitely not WSB style.", "score": 3, "replies": [{"body": "Sony at least innovates and pushes forward with their PlayStation division", "score": 3, "replies": []}]}, {"body": "Did you forget to predict a shirt squeeze? I'm not used to seeing stock suggestions without seeing that. Am I still at Wendy's?", "score": 4, "replies": []}, {"body": "So for the title you just chose 4 buzzword stocks, right?", "score": 4, "replies": []}, {"body": "Undervalued and I love Sony. But they are in a Japan, US leadership struggle and transformation now. They also are a company that doesn’t follow through and take enough risk. Leading to three quarter baked products. Also each day, Microsoft threatens their dominance in the consoles market. Exclusives will only take you so far. They have to do more.", "score": 2, "replies": []}, {"body": "ETFs are the new CDOs. Clown world", "score": 1, "replies": [{"body": "No one mentioned any ETFs.", "score": 5, "replies": []}]}, {"body": "I have good money sitting on two of them stocks,sold but sold buy and buy and keep buying I just want a lambo", "score": 2, "replies": []}, {"body": "I called SNE for a long ass time, with their digital PS5 that 30% online purchased cut will give them enough money to kill a short hedge fund!", "score": 2, "replies": []}, {"body": "Bad comparison I bought Sony once I saw Dolby beat earnings \n\nSony and Dolby are both audio companies headphones speakers \n\nNot comparing Dolby with them is a disservice\n\nDolby earnings also come tommorrow if they beat I would buy Sony calls if they fall buy Sony puts\n\nSony of course has more business so more revenue streams outside audio", "score": 1, "replies": [{"body": "While Sony sells audio products it is not an audio company.  The headphone & speaker business is tiny compared to their other core businesses (sort of like Beats is to Apple).  Electronics are their second smallest segment (see charts that I added to original post).", "score": 1, "replies": []}]}, {"body": "Here we go again", "score": 1, "replies": []}, {"body": "MVIS to the Moon !", "score": 0, "replies": []}, {"body": "Ok boomer.", "score": -1, "replies": []}, {"body": "I buy more shares 💎 ✋🚀AMC", "score": 0, "replies": [{"body": "The poor mans GME", "score": 8, "replies": []}]}, {"body": "Why not invest in Nintendo instead? They will release the new Switch soon and together the new wave of games \"missing\" from the current switch generation (like new Zelda, new Mario Kart, new Mario game)", "score": -1, "replies": []}, {"body": "If you want to invest in the gaming sector, GME is the play.they have partnerships with msft and Nintendo. Sony is the next to be announced.\n\nIt's not even close.\n\nGme is the way to go.\n\nAapl and Tesla are fundamentally different companies, and mvis is a p&d.", "score": -2, "replies": [{"body": "At least a quarter of the PS5 units sold are digital only.  Sony gets a 30% cut of all game sales through the PSN that does not go to re-sellers.  \n\nSony has a working EV in road testing in Europe, I don't know if they intend to sell it or merely showcase their sensor tech.  In any event, Sony is a key EV / modern car supplier of sensors and this will grow explosively as self-driving becomes a thing.", "score": 2, "replies": [{"body": "The technology is the same. Osram also built sensors and sold them to mercedes I think to be used in EVs, as well as rwe for smart houses.\n\nMy point is: Sony will always be a gaming first company. And as such, it will be capped in its niche.\n\nGme is the right play if you want to invest in gaming,and eventually Sony will pay them to sell their shit, just like Nintendo and Microsoft do. If you want to invest in EV, go for EV. If you want IoT, go IoT. But don't hope that a conglomerate gets good at many different things and dominates everything.\n\nAnd if you want a conglomerate, get Samsung or Amazon or Google.\n\nSony is not the way. Sorry to be so harsh.", "score": 0, "replies": [{"body": ">My point is: Sony will always be a gaming first company. And as such, it will be capped in its niche.\n\nThe Game division brings approx a quarter of their revenue.\n\n[https://www.sony.com/en/SonyInfo/IR/library/download/sony\\_group\\_summary\\_E.pdf](https://www.sony.com/en/SonyInfo/IR/library/download/sony_group_summary_E.pdf)", "score": 1, "replies": [{"body": "Good point. I should have said entertainment. Sony will always be an entertainment company, and as such boxed in the niche being the producer. They will end up paying the number one retailer in this space to partner with them.", "score": 0, "replies": [{"body": "The top two entertainment retailers are paying Sony about $3bn:\n\n[https://www.yahoo.com/entertainment/disney-sets-massive-movie-deal-203046508.html](https://www.yahoo.com/entertainment/disney-sets-massive-movie-deal-203046508.html)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "GME is on sale one wise monkey Once said.", "score": -2, "replies": []}, {"body": "[removed]", "score": -17, "replies": [{"body": "Stfu stupid.", "score": 8, "replies": [{"body": "hahahahha you mad cuz you're even more poor/ get back to flippinthose burgers you bum", "score": -6, "replies": [{"body": "More poor? Lol what a moron.", "score": 2, "replies": []}]}]}]}, {"body": "I thought most of their reported revenue came from their insurance and financial service.", "score": 1, "replies": [{"body": "[https://www.sony.com/en/SonyInfo/IR/library/download/sony\\_group\\_summary\\_E.pdf](https://www.sony.com/en/SonyInfo/IR/library/download/sony_group_summary_E.pdf)", "score": 1, "replies": []}]}]}
{"title": "Why You Should Short The Intel Fab Play", "selftext": "Intel has risen on news that it will spend $20B on establishing chip manufacturing factories in Arizona, but this news is more bearish than bullish to me.\n\nInvesting in Intel now, is nonsensical once you consider the full situation. I reiterate my bearish position on Intel and recommend a diagonal put play.\n\nI’ve more-or-less officially been an Intel bear for a few months now. As of late, many have asked me whether I am changing my stance on Intel due to its $20B manufacturing facility (FAB) production project. As much as I would love to reverse directions and proclaim myself a born-again Intel bull, I must objectively call Intel’s announcement as another bearish catalyst. In light of this news, I am happy to double down. Today, I will explain my viewpoint.\n\n*The Fab Ahab:*\n\nAhab was the seventh king of Israel. He inherited a powerful kingdom but was eventually brought down due to his own vices and not upholding his responsibilities. Many consider Ahab to be Israel’s worst king.\n\nIntel shares many similarities with Ahab. The company easily dominated the chip kingdom with its x86 IP, but this made Intel a bit too complacent: Easy money from x86 led the company to focus more on maintaining the status quo than moving the foundry market forward. In its comfort, Intel has lost its partnership with Apple (AAPL), who has successfully developed M1, a chip much more efficient than the previously used Intel x86 chips; failed to keep up with the shrinking node trends, currently struggling to produce 10nm chips while others are working on 3nm; and has even been overtaken by AMD, which long sat in Intel’s giant shadow. Intel’s story – to me – looks like a downfall story in the making.\n\nIntel finally sees the need to fight back, and the two fabs in Arizona, due 2024, at the cost of $20B is the latest strategy. However, it is a risky strategy. Adding fabs to the business is not just a one-time cost of the $20B but requires consistent upkeep and upgrade costs, something more like $20B per year, which, over the coming decade, would be more than Intel’s total current equity. Intel is thus further adding operational costs to its business during a time when the company is expected to see shrinking revenue and earnings. Typically, the responsible reaction to such earnings decay is to cut down on costs. Intel would seemingly rather throw Hail Marys.\n\n*Hail Mary:*\n\nI call the fab announcement a Hail Mary not because adding fabs is inherently a bad idea but because Intel seems to have little time remaining on the clock to benefit from this action before it finds itself well behind its competitors. Intel should have built fabs years ago when it was still the market leader and still growing earnings. Intel could have become the go-to chip manufacturer in the US, but now it faces an uphill battle in light of how strong Taiwan Semiconductor Manufacturing Company (NYSE:TSM) and Samsung (OTC:SSNLF) have grown over the past decade.\n\nAt roughly the same time as Intel’s announcement to build fabs in Arizona, TSMC (henceforth TSM) announced its own fab construction in Arizona. Clearly, there is a rush to build fabs in the US, and the reason, too, is clear: China. The US reliance on Taiwanese fabs combined with increasing concerns over a Chinese invasion of Taiwan means that the US would love a modern fab stateside. That is, Intel’s decision to create fabs at this time was not decided in a vacuum; instead of the decision being a business-focused decision, it is a situation-focused decision – a decision of convenience rather than one for the sake of shareholders.\n\n*Intel’s Fab Focus In Question:*\n\nIntel could be attempting to cozy up to the US government with its new fabs. The Department of Defense certainly wants some fabs stateside as China’s shadow grows over Taiwan. Intel might be playing the Tesla (TSLA) game by looking for taxpayers to help subsidize its business, gaining a novel edge over AMD.\n\nIn any case, I don’t see the news fabs to be transformative for Intel in the positive sense. If Intel is really going all-in on fabs, we will need many years before we see a significant payoff. Investing in INTC now, during a time of nose-bleed tech valuations and during earnings contractions is not a smart investment decision.\n\nAnd if Intel is looking for government subsidies by being the main US chip manufacturer, this is essentially a white flag; Intel cannot compete in the game of technological advancements and needs a handicap. This is not Tesla being subsidized as it forays into a fledgling industry but an old, stubborn company attempting to stay afloat via means outside its own merits. You would be better off investing in AMD or TSMC if you want exposure in US chip design or manufacturing.\n\nOverall, I reiterate my bearish outlook on Intel relative to the rest of the chip industry. The upward momentum in Intel and its current price are not sustainable by the news: The fabs and other aspects I’ve mentioned in previous articles are perceived as bullish while they are in fact bearish.", "id": "n45xj8", "created_utc": 1620072470.0, "score": 38, "upvote_ratio": 0.69, "num_comments": 67, "comments": [{"body": "Response to this.  No position either way. For Intel,   I do know however that as you increase your technode you must increase your equipment technology.  20 B for new Fabs is not an eye shocking number and anyone who knows semiconductor companies knows this.  \n\nLook at the foundry TSMC majority of output is in Taiwan with only 2 8-inch wafer facilities in the USA.   8 inch wafer facilities are money losers, you spend the same amount to produce them as a 12 inch wafer, but netting less chips, industry current standard or 300 mm or 12 inch.  Those fabs wont be around much longer and they will eventually need to be retooled, and most likely completely rebuilt.    \n\nWhy building in the USA will be so important in the future.   \n\nLook at Taiwan and Singapore two places China would love to control.  Let's say tensions with China intensify and a skirmish or war breaks out there.   There would be a strangle on a lot of chip manufacturing.  Pay attention to trouble brewing in the south china sea.  \n\nIf Intels fabs are up and running they would continue to build un-harrassed in the USA.   \n\nI agree that any time a company takes money for capital expenditures when it is running behind is risky. TSMC IS SPENDING 25 TO 28 BILLION THIS YEAR ON CAPITAL EXPENSES.  Samsung  is spending 28.1 billion this year. The reason Intel is producing more fabrication facilities is so that is can have more capacity which it does not have access to currently.  So the numbers being thrown around are normal for the industry.   \n\nI would have to agree in the short term intel is behind and it will take time for them to get back up.   I do however believe they will be much better positioned going forward.   Their stock already looks discounted. \n\nJust remember semiconductor companies are always playing texas hold em.   They have to put tons of money upfront and then hope everything works out to stay profitable.   Loss of power, interuptions in supply chain i.e. south china sea, would be devastating to any company producing there.  \n\nThe only thing that would push intel higher right now would be an announcement of more capacity,  upgrading to 450 mm wafers, or some new advanced processes that blows away the competition.   They are making more capacity but that yield will be 18 months or more out.  Not a bull or bear hear just my two cents.", "score": 27, "replies": [{"body": "If any of the things you think are going to help intel is going to happen, I will gladly buy ASML", "score": 5, "replies": [{"body": "ASML for more medium term (outfitting new fabs with equipment), and ENTG for long term (selling consumables).\n\nThey both crossover in to equipment and consumables but the above is the general trend. Between the two, I view ENTG as the better bet given the forward-looking nature of the market.", "score": 2, "replies": []}]}, {"body": "Samsung and Intel scrapped 450mm\n\nThe costs for 450mm is too much, even the equipment size is huge and the fab will be very costly\n\nPortland d1x was meant for 450mm, but they are running 12inch wafers there\n\nThe 300mm asml euv tool is a mammoth in size (footprint), can't imagine the 450mm asml euv footprint", "score": 3, "replies": []}, {"body": "Tin solder position", "score": 1, "replies": []}, {"body": "china will never control Singapore lol", "score": 1, "replies": []}]}, {"body": "so many big pigs in on intel. stock should be dropping like a brick in water especially after AMD’s earnings put to rest the conspiracy theory they were trying to pass regarding their decline. crazy how they are announcing all this expansion in the mist of getting swallowed up by their competitors, alas, old heads are keeping it afloat for now. I’m down 3k on my 115 09/17 AMD call options, & i have no plans on selling. over my cold dead body will i let these manipulators stifle AMD’s growth for the sake of intel. something really fishy is going on, but until then, i’m still sitting cockpit in this rocket waiting for AMD to hit pluto!", "score": 16, "replies": [{"body": "Intel is already dirt cheap. How low is it supposed to go? 5x FCF? I would gladly buy", "score": 11, "replies": [{"body": "Would you? Doesn't take many -3 to -5% revenue quarters combined with declining gross margin to suddenly be a lame duck and out of money.", "score": 1, "replies": [{"body": "I have to look into this more to see if I think this will happen. It has been growing revenue and cash flow at a good rate for awhile though", "score": 1, "replies": [{"body": "Check it on macrotrends.", "score": 1, "replies": []}]}]}]}, {"body": "i think AMD is getting sandbagged to make the $ amt of 1.7 shares for XLNX lower on paper. maybe after the acq is complete, it'll finally take off. unfortunately the acq is only set to close by EoY.", "score": 5, "replies": [{"body": "Perfect. Just enough time for my LEAPs to die", "score": 6, "replies": [{"body": "LMFAO SAME", "score": 2, "replies": []}]}]}]}, {"body": "Bought more AMD today", "score": 18, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "So is this what drove down AMD today?  Like 3.5%. \n\n\nDon’t factories take like years to build, finish out, staff and all that jazz?  And correct me if I’m wrong, but $INTC technology is waaay behind $AMD stilll.  Right?\n\nSeems like underweight $INTC and overweight $AMD, all else being equal", "score": 1, "replies": [{"body": "There not that far behind", "score": -1, "replies": [{"body": "AMD is nearly two generations ahead?  Intel is not fucked by any means but they're definitely not in a great spot.", "score": 3, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "I'm in with MU. It keeps running up to 90ish then falls back down. I'm not making crazy money but I'm sadly ahead of your loss. Earnings are coming next month I think. \n\n10 shares @ 87", "score": 3, "replies": [{"body": "Mu earnings were a couple weeks ago.", "score": 1, "replies": [{"body": "I'm seeing June 28th.", "score": 1, "replies": []}]}]}, {"body": "It was and is the play, you were just poor with timing.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm a big advocate and student of elliot wave principal. The daily chart looks like a perfect setup to start a 3rd impulsive wave. 3rd waves are the most violent and volume intensive and will usually retrace 161.8 fib of the 1st wave (which was about 83-142). Thats a PT of around 175. The timing is not precice but i see that in the coming 4-5 months. The wave 2 correction retraces 61.8 fib which is exactly where we are (for the second time) now.  \n\n\nThe wave 2 of 5 is generally an ABC pattern which will break out into other identifiable patterns. A is 1-2-3-4-5 B is a Zig Zag (ABC) and C is 1-2-3-4-5. On the 4 hr chart I can see these complete and all line up.   \n\n\nThis leads me to believe we are begining the 3rd wave which is the most fun and explosive. It's longer and more steep than the 1st wave and can also be broken into another smaller 1-2-3-4-5.   \n\n\nBEWARE: I've been studying this daily for a few months now, but am not perfect. This chart is damn near text book, but I'm a poor smooth brained idiot. If you would like to know more, or hear alternate possibilities lmk...but I'm all in on some FDs for the coming months. Wave 3 almost always outruns theta. I'll be playing 1%-5% OTM Calls for giggles and may pickup some longer dated calls that I see as a more sure thing. To hedge i'll keep my day job.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Thanks for the kind words!   \n\n\n1 weeks options are a straight gamble and high risk. No judgement here though, I usually play shorter term as well. I'm impatient and not super rich. If your goals are more than just fun and gambling then I'd reccomend saving a bit and picking up something 60-90 days out then sell 2-4 weeks before expiration. You won't loose so much on theta decay and won't go to 0 week after week on your bad picks.    \n\n\nI hope we both pick great and make great returns! Feel free to DM if you want to discuss ideas or positions further. I always enjoy bouncing ideas around and sharing knowledge as much as I can.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Intel has partnerships with US government laboratories across the country. I think the US gov will let Intel look behind the curtain to get a leg up. The US views chip dominance as defense spending people. The most advanced chips delivers the dominant military advantages.", "score": 7, "replies": []}, {"body": "AMD TO THE MOON", "score": 6, "replies": []}, {"body": "$AMD 🚀🚀🚀", "score": 4, "replies": []}, {"body": "I'm just gonna say this after looking through their financials and reading up some halfassed dd. For a dying company, they're making a shit ton of money. I wouldn't risk my nuts going short Intel. Nor would I pay the extreme premium for AMD.", "score": 3, "replies": []}, {"body": "NVDA is the long play", "score": 5, "replies": [{"body": "I’d love a good NVDA DD. They outsource fab to TSMC but by the time that becomes an, er, “issue”, INTC might be able to fab for them onshore.", "score": 2, "replies": [{"body": "Why would they go to INTC when they have contracts with Samsung on a better node?", "score": 1, "replies": [{"body": "Samsung loses the node advantage this year when Intel mass produced Alder Lake on 10nm, 7nm equivalent. Then if you look at the semi wiki's, Samsung is expected to get worse while Intel passes them. TSMC likely wont be passed unless there is some major issue, but TSMC currently cant keep up with demand, even before the pandemic, which is why Apple gets basically a year of the latest node before AMD or Nvidia even have a chance to use it.", "score": 2, "replies": []}, {"body": "Good q, didn’t even know that. Where are the Samsung fabs?", "score": 1, "replies": [{"body": "South Korea.", "score": 2, "replies": [{"body": "Still in dicey waters, lol.", "score": 0, "replies": [{"body": "Who is?", "score": 1, "replies": [{"body": "I was implying that South Korea has a shadow looming over it as well. I didn't convey that very well though, sorry.", "score": 0, "replies": [{"body": "I guess. You could also say Taiwan has a looming threat as well.", "score": 1, "replies": [{"body": "Yes, that was the correlation m", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "True, see the longer thing I wrote", "score": 1, "replies": []}]}, {"body": "Who is captain Ahab?", "score": 3, "replies": []}, {"body": "You are not wrong, however, apple didn't really develop a new cpu. They bought a architectural license from ARM (technically: NVDA) and got a bunch of support to build this chip for a really nice fee. So Intel lost to ARM not to apple. A lot of ppl here forget it is not Intel vs AMD, it's 3 parties (all the other alternatives basically hibernate or have died)\n\nAlso, x86 was really nice for intel, but they had to buy AMD64 licences from AMD to get into the 64 bits market. Intel lived a very long time because of FUD.\n\nIntel has been in trouble since 2017, when it turned out their [https://en.wikipedia.org/wiki/Speculative\\_execution](https://en.wikipedia.org/wiki/Speculative_execution) was causing security issues. Even though AMD had \\~50% of the same problems (since they where part of the architecture) ARM had none.\n\nNot financial advice, quite obvious IT explaining here", "score": 3, "replies": [{"body": "Has the nVidia buying arm deal already been done? I thought that was still pending/not final yet.", "score": 2, "replies": [{"body": "There is a reason I keep calling it ARM", "score": 1, "replies": [{"body": "Ah alright. What threw me off was the \"(technically nvda)\" you wrote^^. All clear then, thanks!", "score": 2, "replies": []}]}, {"body": "No. It is still processing regulations. The ARM deal will take a while for it to go through.", "score": 1, "replies": [{"body": "If it goes through.  There are more hurdles than what the public are aware of.\n\nOur company was in a similar position, 1 1/2yrs later, still couldn't get approval (mostly because of China).  Whole deal off the table now and major loss of money for both companies.", "score": 1, "replies": []}]}, {"body": "not happening", "score": 1, "replies": []}]}, {"body": "Why are you getting downvoted, you're right lmao.", "score": 1, "replies": [{"body": "Well, sometimes it's more important to explain things right than get karma.", "score": 2, "replies": [{"body": "It's painfully obvious OP has no idea what he's talking about.  It doesnt take $20b to run ALL the fabs at Intel. \n\nOP is fake and gay.", "score": 1, "replies": []}]}]}]}, {"body": "I am bearish on INTC, however, they do manage to pull profits somehow every quarter despite AMD. They have a current opportunity in the short term to take some market share from AMD with the current GPU shortage. They are coming out with their own GPU, which will sell like crazy, even if it is complete garbage. All on Intel processors have in built graphics, which run decent. AMD's chips don't have any of that. Considering no one can buy a GPU right now, if I was building a pc and didn't have a GPU, I would have to go with Intel to even use my computer, and once you do that, you won't change your CPU for a couple years at least.\n\nAnother factor, Intel is changing their chips, along with AMD, to dividing 8 cores into 4 small efficient and 4 large ones. This is similar to what ARM chips does. They also are coming up on 10 nm, hopefully without any delays. They have a CEO in charge who is an engineer from the early stages of the company, the are coming out with a 7nm TILE design, similar to AMD's chiplet design, and also did I mention how much cash they have? 5 billion in raw cash. You can do a lot with that.\n\nNot to mention its very dangerous to have a concentration of foundries in Taiwan, and yes TSMC is building one in the US in a couple years, but a lot can happen.\n\nI think Intel is at high evaluation for what is happening, but don't bet against the giant. Both AMD and INTC are giants now. It's a fools game, without a catalyst.", "score": 3, "replies": [{"body": "That was shockingly well written", "score": 1, "replies": []}]}, {"body": "Smart. I'm all in", "score": 2, "replies": []}, {"body": "Where's the TLdR?", "score": 1, "replies": []}, {"body": "probably trying to gain the infrastructure to start using smaller nm chips like amd. Im sure amd will keep beating them till they up their game in that area. might be getting that one going so they can phase out the old technology and or eventually convert their other facilities to support better technologies", "score": 1, "replies": []}, {"body": "Agreed!  Big mistake by Intel.  They need to make better CPUs and embrace ARM as it's the future of everything rather than trying to make Fabs.  Focus on your core competency, don't try to create a new one especially since history has shown you sucked at it (making fabs).", "score": 1, "replies": []}, {"body": "My Ryzen 7 3700x agrees with this post. Fucking shitty Intel.", "score": 1, "replies": []}, {"body": "I agree, but be carefull from quantum i expect intel to come back strong in 5-10 years so if i played bear side i would try to exit position in next 4 years.\n\nPple say quantum pcs arent meant for personal computing and only good on some applications, guess what application they good at? Destroying whole cybersecurity as if it never existed; i expect quantum being needed to defend from quantum and that means a big af wave of demand and high institutional adoption; then again if mastodontic amounts of money are thrown into it maybe they even get usefull as personal pcs who knows.", "score": 1, "replies": []}, {"body": "INTC is a great play, I'm waiting for that sweet $40 share price. INTC can become more than just data center chips. [https://www.intel.com/content/www/us/en/research/quantum-computing.html](https://www.intel.com/content/www/us/en/research/quantum-computing.html)", "score": 1, "replies": []}, {"body": "The best way to play the increase in fabs is to invest in Tin. They use it for solder. Over 50% of the tin produced goes to solder. It's currently in a shortage and will remain short for decades until it is depleated.\n\n$AFMJF🚀🚀🚀 is the only tin miner you can buy stock for. Compare it to a copper or silver miner and its dirt cheap.\n\n$JJT🚀🚀🚀 are 2038 tin futures via Barclay ETN\n\nThey had more silver on hand then tin at the LME back in February.  Now that's a short squeeze.🚀🚀🚀 Given the spot prices run in the last week, I suspect the same thing is happening right now. I'm kind of excited to see the spot price update tonight.\n\nWhy have you never heard about tin and always hear about copper and silver? Because it's a small niche market and most analyst companies don't even cover it. \n\nGo check out tins spot price performance vs copper vs silver\n\n🚀🚀🚀", "score": 1, "replies": []}, {"body": "Intel is, perhaps, the most vertically integrated semiconductor manufacturer in the world.  The integration is so intricately woven via their culture and long legacy, that using their fab services will be like going to another planet.  I predict that a cottage industry will spring up around Intel, run by former Intel engineers and lawyers, who will provide consulting services for dealing with Intel's new business.  Intel's fab success will depend upon the success of this cottage industry, and they better hope that layer of overhead remains thin.", "score": 1, "replies": []}]}
