{"title": "Should I sell some of my AMZN shares for long dated options", "selftext": "[deleted]", "id": "8f92nr", "created_utc": 1524804459.0, "score": 14, "upvote_ratio": 0.95, "num_comments": 42, "comments": [{"body": "Wsb is no place for sexual tension", "score": 25, "replies": [{"body": "Speak for yourself.", "score": 11, "replies": []}]}, {"body": "Are you talking about taking a synthetic long position by purchasing deep ITM LEAPs or are you talking about purchasing OTM LEAPS?\n\nLiquidity is very low on options like those, so it can be hard to exit the trade if you need the money again for some reason or if the trade moves against you and you're no longer comfortable with it.", "score": 11, "replies": [{"body": "ATM leaps, I was kind of thinking start with15-16k and everytime it goes up around 10% I sell the option buy a share and roll it into longer dated ATM options for around the same 15-16k price, just to kind of check point my gains and if I feel amzn has run up to much I can hold off on rebuying for a week or whatever", "score": 1, "replies": [{"body": "Probably not going to be able to sell the leaps at a reasonable price. Very few people want to buy in the money leaps.", "score": 1, "replies": [{"body": "Would algos pick one up that’s slightly below breakeven already like if I bought atm it went ITM and I sold for a slight loss compared to actual share price", "score": 1, "replies": [{"body": "Probably not because the bid ask spread will be large so you'd have to give up a lot. Find a call and keep an eye on it. Or look up the options history.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "[I did](https://imgur.com/a/Rt3GM)  now I want quicker gains", "score": 9, "replies": [{"body": "[deleted]", "score": 24, "replies": [{"body": "Roger that, liquidating all assets as I type this", "score": 16, "replies": []}]}, {"body": "DAM SON", "score": 5, "replies": []}, {"body": "Cash out completely, buy the 10 year, and wait to get back in once the recession hits and bottoms.", "score": 5, "replies": []}, {"body": "How do you still have Scott? They forced everyone over to td", "score": 2, "replies": [{"body": "Looks like an iPhone 4.. ", "score": 3, "replies": []}, {"body": "Old screen cap I’m too lazy to upload a new one to imgur, current price of those now is like 33k", "score": 1, "replies": []}]}, {"body": "Wow, congrats! When did you buy it?", "score": 1, "replies": [{"body": "2000", "score": 1, "replies": [{"body": "Congrats! So did you hold through the dot com bubble bust?", "score": 1, "replies": []}]}]}]}]}, {"body": "What if the recession comes? It can last for 2-3 years easily.", "score": 6, "replies": [{"body": "Then OP is screwed and bargains for people with cash to buy the dip.", "score": 2, "replies": []}, {"body": "Then I guess I cry", "score": 1, "replies": []}]}, {"body": "I think you should keep the shares. After a rally like this there has got to be a correction at some point, which could fuck you over badly", "score": 3, "replies": []}, {"body": "I would be selling vertical spreads against your shares. If you're willing to sell your shares at any time, you can set up trades that will either break even or make you money without any risk other than Amazon tanking. It's a good play if you're going to bahghold anyway.", "score": 1, "replies": [{"body": "He only has 20 shares... Can't sell even one covered call, let alone a vertical spread.", "score": 3, "replies": [{"body": "If it’s selling a spread it just add some negative delta, which is against his shares as it reduce his long position. Unlike writing covered calls you do not need to own the underlying... ", "score": 1, "replies": []}, {"body": "What do you mean let alone? They limit the risk compared to uncovered calls, which would be the case if he tried to just sell options.", "score": 1, "replies": [{"body": "Dude, options are contracts for lots of 100 shares. He only has 20.. Sooo OP can't sell even one covered call, let alone multiple in a vert spread.", "score": -1, "replies": [{"body": "How is nobody understanding my comment? I know what a goddamn call option is.", "score": 3, "replies": [{"body": "So if you understand how do you not understand that he can't sell a covered call, any call option he would sell would be naked.", "score": -1, "replies": [{"body": "I never said to sell uncovered calls. I said sell vertical spreads. Jesus christ man.", "score": 4, "replies": [{"body": "Your original comment suggests to \"sell vertical spreads against your shares\", which suggests selling covered calls, OP can't do that since he only owns 20. My gosh you are dense.", "score": 1, "replies": []}, {"body": "Just to clarify, because it doesn't seem like you understand options very well. If you want to sell 1 covered call, you must own 100 shares of the underlying, for 4 covered calls you must have 400, simple math. Otherwise you are just selling naked calls.", "score": 0, "replies": [{"body": "Which is why I suggested vertical spreads. But you've made abundantly clear you have no grasp on how owning shares, and selling vertical spreads work in tandem. \n\nHow embarrassing. ", "score": 3, "replies": [{"body": "Man, you said \"against your shares\". I understand vertical spreads. By saying \"against your shares\" it seems to me you are suggesting that the call he sells in the spread is a covered call, but he can't sell a covered call without 100 shares. ", "score": 1, "replies": [{"body": "I apologize. I could have been more clear. \n\nWhat I'm suggesting is he sells vertical spreads, and uses the shares to leverage any potential loss on the vertical spreads. If he ends up paying on them he can sell his shares to break even. \nIf he plays them well and they expire he can rinse repeat.", "score": 1, "replies": [{"body": "Thanks, I'm glad we've reached a consensus. Though I think with Amazons price action selling calls wouldn't be the smartest idea unless way otm, and then you wouldn't be collecting much premium. Further if unable to exit the position having the calls possibly be executed puts one at substantial risk.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "20 shares dawg 20", "score": 1, "replies": []}]}, {"body": "sell all of your amazon, that company will collapse under its own weight soon enough. sell some puts in spx and watch the gainz roll in.", "score": -3, "replies": [{"body": "Even I’m not retarded enough to agree with you", "score": 15, "replies": []}, {"body": "It's not called The Cloud anymore, it's called The Amazon Cloud™", "score": 7, "replies": [{"body": "They should call it the AMZN jungle\n\nIt's got fun and gainz\n\nAlright I'm going to bed", "score": 2, "replies": []}]}]}]}
{"title": "Official Amazon FOMO Thread", "selftext": "I picked the wrong stock to play yesterday and the FOMO is hitting me real hard. I know I'm not the only one out there.\n\nMicrosoft isn't down, but it's not Amazon. I miss you Daddy Bezos...I should've never doubted you at $900/share\n\nHell, even Square and Micron are up more than Microsoft just from bullish sentiment of tech sector again. Damnit.", "id": "8fbb9d", "created_utc": 1524832732.0, "score": 29, "upvote_ratio": 0.86, "num_comments": 41, "comments": [{"body": "It's not FOMO anymore it's MO", "score": 63, "replies": [{"body": "lol", "score": 7, "replies": []}, {"body": "You could always buy in at ATH if it keeps going higher", "score": 12, "replies": [{"body": "> You could always buy in at ATH if it keeps going higher\n\nI agree. Buy high and sell low. The greatest strategy for tax credit harvesting.", "score": 11, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 31, "replies": [{"body": "Username checks out", "score": 29, "replies": []}, {"body": "95% tech and 5% defense here. Just need fucking Tencent to get its shit together. Tech till I die.", "score": 4, "replies": [{"body": "> Just need fucking Tencent to get its shit together.\n\nThat makes no sense to me. League makes fucking bank, Baidu is used by 1 billion people, and they're basically the vehicle for the Chinese gov't in tech besides Hauwei. How the fuck are they not raising up like AMZN?\n\nThe Chinese gov't just launched a 1.2 trillion dollar plan to increase Asian trade to sell *more* Chinese shit to half of the planet. \n\nThe fuck?\n\nEdit: \"rational market\", even though they haven't increased much since Jan 2018", "score": 2, "replies": [{"body": "makes no sense its annoying, china did implement some regulation on social media data though b/c of FB scandal perhaps this is why there is bad investor sentiment who knows tho :(", "score": 2, "replies": []}, {"body": "They also own both PUBG and Fortnite", "score": 2, "replies": [{"body": "> They also own both PUBG and Fortnite\n\nThe market: Who?", "score": 1, "replies": [{"body": "Of the market doesn't know means still plenty of non priced in upside ", "score": 2, "replies": [{"body": "you got any more of that uhhh\n\nleaded paint", "score": 1, "replies": []}]}]}]}, {"body": "Ikr? Quite a few of their games make banks. I do have one problem with what you said tho:\n>Baidu is used by 1 billion people\n\nDo you mean WeChat? Baidu is a totally different company.\n\n>The Chinese gov't just launched a 1.2 trillion dollar plan to increase Asian trade to sell more Chinese shit to half of the planet.\n\nI always thought that's what triggered the ego of Trump and began this whole trade war nonsense.", "score": 2, "replies": [{"body": ">Do you mean WeChat? Baidu is a totally different company.\n\nBaidu is the Google for China. China has a population of 1.6 billion. Google makes 98% of their revenue from ads from search. I suspect that Baidu is similar. \n\n>I always thought that's what triggered the ego of Trump and began this whole trade war nonsense.\n\n[He fired Comey because he was unable to golf because it was raining.](https://www.npr.org/templates/transcript/transcript.php?storyId=586190739)\n\nIt was probably something like he saw made in China on his tie, and then got pissed.", "score": 1, "replies": []}]}]}, {"body": "If the South Africans keep selling, it will continue to pressure the stock. ", "score": 1, "replies": [{"body": "I think they said that they won't sell for another 5 years.", "score": 1, "replies": [{"body": "Yeah, I've heard that. I'm a little skeptical though ", "score": 1, "replies": []}]}]}]}, {"body": "What sauce do you like w your tendies ", "score": 1, "replies": []}, {"body": "You could've just bought a fang ETF and saved yourself the trouble...", "score": -2, "replies": [{"body": "Yes juggling 5 whole stocks at the **same time** has been the downfall of even the best investors. ", "score": 20, "replies": []}]}]}, {"body": "Sold a deep OTM bull put spread, so at least I didn't completely miss out. Sadly only made $100. Meanwhile people here making $10k+ from having balls and buying calls.", "score": 13, "replies": [{"body": "Don't worry bud you can still make plenty of tendies just buying the underlying. https://imgur.com/bC0WMix\n\nJust scrap together 100k or so to start and you should be good.", "score": 4, "replies": [{"body": "Switched to options since it's more fun.", "score": 4, "replies": []}, {"body": "Random but why does your phone report 4G and LTE simultaneously?  What carrier or phone does that and what the heck does that even mean?", "score": 1, "replies": [{"body": "$TMUS", "score": 1, "replies": []}]}]}, {"body": "I told myself to stop being a dumbass and sold my 1510 call Wednesday for $22. Fuck me right", "score": 1, "replies": []}, {"body": "Well sells like 30-40 and buy 3-4 calls for more bullish play yet still in premium? Edit: and get more premium by selling atm, I’d avoid been far otm especially with a spread ", "score": 1, "replies": []}]}, {"body": "Right there with you. Sold off just after it hit $1k. ", "score": 8, "replies": [{"body": "Same.  Gainz is gainz.", "score": 1, "replies": []}]}, {"body": "If I would have bought 20 contracts for May 18 1535 calls I would have made $187K. \n", "score": 4, "replies": [{"body": "don't get too caught up with hindsight...figure out what caused the hesitation while it was happening, and learn from it.\n\n", "score": 7, "replies": [{"body": "I learned I need a time machine. If I had that $187k I'd be able to start development of one.", "score": 2, "replies": []}]}]}, {"body": "So you picked a winning play and you're bitching because you didn't pick a more winning play? Well, you can always buy some $1700 FDs on AMZN for next Friday. Go ahead! Try it! :) ", "score": 5, "replies": [{"body": "For a brief time during premarket action I'm sure this crossed some people's mind. Hell at 9:31 AM this morning too...", "score": 1, "replies": [{"body": "Scary. I want no part in a company with a forward P/E of 325. Maybe when we get an eventual return to fair value I'll be for it but for now it's a little overpriced. However, not buying it when it was at $1350 or whatever the low was was just stupid. This market isn't going to fail yet. ", "score": 1, "replies": []}]}]}, {"body": "i had it ready to buy yesterday at 1448. I didnt.   I am still in debt.", "score": 2, "replies": []}, {"body": "On any given day there are thousands of plays that are better than anything you did.  \n\nThat doesn't mean you can't improve your financial position. \n\nIf you go fishing,  you don't catch every fish in the lake, do you?", "score": 2, "replies": []}, {"body": "Welcome to the MSFT world. It's a long term slow play, always has and always will be. You don't play MSFT going into earnings expecting it to run like AMZN. ", "score": 1, "replies": []}, {"body": "I panic sold during the Trump Twitter Trade Tirade. Went from up $20k to up $11k and got out. Bought a few shares yesterday just to avoid earnings FOMO but of course now wish I had stayed all in.", "score": 1, "replies": []}]}
{"title": "Top Laughs from Personal Finance - AMZN", "selftext": "https://www.reddit.com/r/personalfinance/comments/8fbabp/amazon_prime_subscription/\n\nthere are people who are actually concerned with a $20/year of extra expenses. ", "id": "8fcfya", "created_utc": 1524842321.0, "score": 41, "upvote_ratio": 0.91, "num_comments": 47, "comments": [{"body": "[deleted]", "score": 91, "replies": [{"body": "I can return 100% on that 300k in a year, no fees", "score": 19, "replies": [{"body": "is this a 100% AMZN portfolio?", "score": 13, "replies": [{"body": "2000% if you leverage it in HK", "score": 7, "replies": []}]}]}, {"body": ">I just inherited 300K from my uncle, which zero risk ***max reward *** investment should i put it in?\n\nlmftfy", "score": 12, "replies": [{"body": "If they wanted max risk zero reward they should have just asked WSB for advice.", "score": 1, "replies": []}]}, {"body": "- Just started a new job, wtf is a 401k?", "score": 14, "replies": [{"body": "Could be worse. I saw a I opened a 401k and left it all in cash for 5 years caz I am too stupid to buy spy", "score": 8, "replies": [{"body": "What an idiot! They missed out on freakin bull  AF market. ", "score": 1, "replies": [{"body": "Basically if u bought anything that wasn’t sears, u made money", "score": 1, "replies": [{"body": "But now I own 70% of Sears and it only cost a nickel", "score": 3, "replies": []}]}]}]}, {"body": "\"what the fuck is this 'deductions' on my pay stub and why am I paying for it?\"", "score": 4, "replies": []}]}, {"body": "You guys should check out r/pfjerk they make hilarious parodies of pf posts", "score": 7, "replies": [{"body": "Which one of you beautiful bastard did [this](https://www.reddit.com/r/PFJerk/comments/6surjg/vanguard/?st=jgi8ord8&sh=d8656e53)", "score": 5, "replies": [{"body": "Omfg I'm dying hahahaha he answered every comment that way too", "score": 2, "replies": []}]}]}, {"body": "Thanks for the tip. I was wondering what to do with those retardedly long CVS receipts. ", "score": 2, "replies": []}, {"body": "Boo hoo I'm 26 and make 150k but I'm not smart enough to figure out how to invest.", "score": 2, "replies": [{"body": "not even invest... just like, how the fuck are you making $150k and can't figure out how to become financially secure when you're still that young and likely have no real fixed expenses and obligations?", "score": 1, "replies": []}]}, {"body": "Put it in a nice .5% CD so you can end up literally fucking yourself without the dildo. ", "score": 1, "replies": []}]}, {"body": "\"Pay monthly and complain every time a shipment takes longer than two days to arrive . They give you a free month every time. Recently most of my prime orders arrived in four days. Ive gotten 4 months free so far.\"\n\nAnother Gem. Do these people actually enjoy living like shoeless 3rd worlders or is it some weird mental illness. ", "score": 38, "replies": [{"body": "Half of them probably are, the kind of people who buy single ply and wash paper towels", "score": 8, "replies": []}, {"body": "I know people in real life like this, it's terrible.\n\nWent to dinner with my wife's friend, a dentist. She didn't want any salsa when she found out it cost $5. Just bring the free chips.\n\nMisers.", "score": 5, "replies": [{"body": "Brings back PTSD from a previous roommate. She read some article once on standby power and would go around unplugging almost everything in the house. Like bitch, you seriously think the fraction of a penny per month you're saving by not running the LED clock on the microwave is worth the effort of plugging/uplugging it multiple times per day? And even worse was that she'd leave her PC on 24/7 because it 'took too long' to boot. She'd get mad when I'd leave shit like a lamp plugged in (with an obvious hard switch) and wouldn't listen to reason. We were both working as engineers at the time so its not like she couldn't afford it.\n\nWe had a falling out partially related to this and she moved out two months early, paying double rent for those two months. I hope the couple thousand extra it ended up costing you was worth those few nickels you saved us on the electric bill. Goddamn bitch. \n\nOh yeah, she also unplugged the dehumidifier I had in my room (in the basement in a very humid region) when I left for a few weeks, which ruined a lot of my shit. Fucking goddamn fucking bitch.", "score": 9, "replies": [{"body": "dude you can drop dead from a heart attack at like any second who the fuck cares about spending a couple bucks on electricity", "score": 3, "replies": [{"body": "That bitch sure did", "score": 3, "replies": []}]}]}]}, {"body": "I had a bitch at them about missing a Saturday delivery last year and got the whole year refunded but they never cancelled the membership. This might be their master plan to recoup their losses over the next 5 years....", "score": 1, "replies": []}]}, {"body": "jesus christ just don't buy starbucks for 4 fucking days and you've paid for the difference", "score": 11, "replies": [{"body": "You think these people can afford Starbucks? ", "score": 17, "replies": [{"body": "if they were OK paying $99 for amazon prime they fucking better be able to afford starbucks", "score": 7, "replies": [{"body": "Idk I can see them being like \"I buy all my coffee from Costco and brew it myself. I saved a fortune last month by not going to Starbucks!!\" ", "score": 8, "replies": []}, {"body": "i dunno man... i would pay $300/year for prime before I could justify the expense of starbucks on a daily basis. ", "score": 1, "replies": []}]}]}]}, {"body": "It’s literally $10/month. Same as Netflix now and you get more value out of it", "score": 12, "replies": [{"body": "I get more than $120/year worth of rewards points alone from my amazon prime visa... i use it for gas, car insurance, groceries... all my other living expenses besides my car loan payments and rent. ", "score": 3, "replies": []}]}, {"body": "It's not even some sort of ascetic nobility or genuine poverty, it's just penny-pinching peasant logic", "score": 9, "replies": []}, {"body": "What is wrong with this sub and being cheap? Can’t buy that beautiful Yacht if you’re spending that money on stupid shit. ", "score": 4, "replies": [{"body": "maybe that time spent figuring out how to make money rather than how to penny pinch? \n\nhttps://www.princeton.edu/news/2013/08/29/poor-concentration-poverty-reduces-brainpower-needed-navigating-other-areas-life", "score": 4, "replies": [{"body": "Why not both? \n", "score": 1, "replies": []}, {"body": "Think about what that extra $199 per year being put to work in the market could do. \n\nSay you cancel that subscription for and save $119 per year for 10 years, and put those savings into an index fund at a 7% return on an index fund. That’s a NFV of $2,749.47. ", "score": 1, "replies": []}]}]}, {"body": "20% is how ya gotta look at it if you’re amazon ", "score": 3, "replies": []}, {"body": "If 20 more bucks a *YEAR* is fucking ground breaking they probably shouldn't be using amazon at all.", "score": 2, "replies": []}, {"body": "To be fair I have no reason to keep prime because I don't use any of the services outside of shipping. \n\nI dropped it before the price hike. MEH.", "score": 2, "replies": [{"body": "Exactly. Prime video is ass compared to Netflix and I only use it for the free two day shipping. Isn't worth another price increase", "score": 1, "replies": []}]}, {"body": "I pity their ways.", "score": 1, "replies": []}, {"body": "I should post something from linkedin. It went like this:\n\"2007-2014 - Prime 79 to 99\"\n\"2014 to 2018 - Prime 99 to 119\"\n\"I guess inflation was worse during 2007-2014\"\n\nDates may be wrong but point is people forget how much value Amazon Prime has added in the last 5 years. It isn't just 2 day shipping anymore.", "score": 1, "replies": []}, {"body": "for a sub dedicated to making personal finance choices, they sure have a surprising lack of ability to carry out simple cost-benefit analysis. ", "score": 1, "replies": []}, {"body": "What a bunch of bitches. If you don't get any value from then just don't get it, don't go to the internet and bitch about how it's a ripoff because YOU don't use it. ", "score": 1, "replies": []}]}
