{"title": "How to invest 70K", "selftext": "My wife and I are fairly young with good paying jobs. We have stayed out of the market over the last year or so thinking it was going to come down but it has not. \n\nSome advice please on what to buy in this crazy market? So far, I have been eyeing the following: DWDP, BAC, INTC, MSFT, FB, TXN, AMGN, BABA, IBM, AAPL, PYPL, UNH.\n\nAs you can see, I am leaning what too heavily into tech even though they have moved the highest because I think they are the future. On the other hand, I want to diversify.\n\nMy current stocks are: 3 Canadian banks (large positions), a Canadian utility and Visa. As I mentioned, we have fairly decent salaries and so we should always have more cash to deploy (fingers crossed).\n\nThanks for all the help.", "id": "7gtgh6", "created_utc": 1512112483.0, "score": 15, "upvote_ratio": 0.75, "num_comments": 51, "comments": [{"body": "Man, you missed one hell of a ride.", "score": 38, "replies": []}, {"body": "Index funds", "score": 22, "replies": [{"body": "I agree, index funds with a focus on proper asset allocation.", "score": 8, "replies": [{"body": "He means you should buy some fixed income (bonds and CDs) too. Especially since equity prices (and indexes too!) are insane st the moment. \n\nEdit: Buffett is 40% cash right now (fixed income) and you should be too!", "score": 3, "replies": [{"body": "Bonds and cds are paying absolutely nothing. OP also mentioned they’re young. No reason to have a fixed income portfolio ", "score": 4, "replies": [{"body": "This. If he's young, he doesn't need to focus on timing the market if he plans to be invested for decades. No one knows when the bull market will end, and sitting on the sidelines may cause him to miss out on another leg up before the pause or decline. ", "score": 7, "replies": []}, {"body": "Buffett isn’t in 40% cash because he is old or because he doesn’t understand real interest rates/inflation. It’s because he wants to wait to deploy his capital when assets are cheap and protect it against downside risk. Also, your age based asset allocation theory is non-sense. You might want to read up on that. Furthermore, when stocks decline - I know never going to happen, this time is different, etc. - cash and fixed income out performs equities. ", "score": 0, "replies": [{"body": "If thats even true that’s because buffet has capital to deploy hes running a multi billion dollar company. Hes not running his retirement account obviously. Time in the markets beats timing the market and we’re looking at another 2-3 year bull run. So yea be my guest and put 40% of your 50k ira in something thats earning less than inflation which btw means you are losing money. Age based asset allocation isn’t nonsense its about risk. So like i said go earn negative interest on your measly investments and let OP make at least mediocre gains in an index fund", "score": 5, "replies": [{"body": "Another 2-3 years of a bull market run? That's a pretty bold prediction, can you back that up with any evidence?", "score": 2, "replies": [{"body": "Global QE is still happening and GDP just printed at 3.3%. Oh and unemployment is still falling. \n\nThat enough evidence?", "score": 2, "replies": [{"body": "Nope. Been seen before followed by a recession. Remember the late 90s? There are tons of metrics that point to a continued thriving economy and some that point to a nearing recession. If predicting the market were as easy as reading statistics we would all be rich. ", "score": 1, "replies": [{"body": "Well don't you know everything", "score": 1, "replies": [{"body": "I don't know everything nor would I ever claim to. But if you're going to be snarky I can be snarky right back :)", "score": 1, "replies": [{"body": "You started it", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes it is a little bold and to be fair it's not my prediction. I was given this prediction during a forum I recently attended. The prediction comes from a relationship between the federal funds rate and a 2yr annuallized % change in nominal GDP. The latter being greater than the former currently and he said stated that once these cross is when we will see the beginning of a bear market. Given how often and by how much the fed funds rate is raised its about a 2-3 year window until they cross. You obviously have no idea who I am and have no reason to believe me so yea you can take that information however you want", "score": 1, "replies": []}]}, {"body": "Sounds good friend. Good luck.", "score": -1, "replies": []}]}]}]}]}]}]}, {"body": "What do you see in BABA. Just curious because I'm young and new.", "score": 4, "replies": [{"body": "TLDR: The Chinese Amazon. \n\nA quarter of the world's population lives in SE Asia, where they are experiencing rapid economic growth, urbanization, and middle class growth. The middle class is the main driver of retail spending. Whatever company captures that spending, many think it will be BABA, will have revenues that American companies cannot begin to imagine, strictly because there is so much population in SE Asia. BABA saw [$18 billion](https://www.cnbc.com/2017/07/10/alibabas-singles-day-is-amazons-prime-day--on-steroids.html) in sales during Singles Day. Total Black Friday sales were only [$5 billion](https://techcrunch.com/2017/11/24/black-friday-deals-net-640m-in-sales-so-far-mobile-60-of-all-traffic/). **All** American companies had 1/3rd of the sales of just **one** Chinese company, BABA, in their respective largest shopping holidays.", "score": 8, "replies": [{"body": "Seriously and it’s relatively cheap right now for no good reason beyond a pullback on tech, which is a bit odd because I’d say baba is less tech than most tech companies. \n\nI’m seriously considering dumping a load more $ in baba if it dips another 5%. ", "score": 2, "replies": [{"body": "I thought it was cheap? But not if it doesnt drop 5%?", "score": 1, "replies": [{"body": "If amazon was 5% less than it is right now, would you shift a good chunk of money into it? Okay what if it was 15% less? 50% less? What I’m getting at is something can be a bit undervalued in your mind but not so much so you’re willing to be aggressive and re-arrange your portfolio. There are only a few times I was reasonably sure a stock was going up and dumped a good amount of $ into it. Otherwise I usually am 70% SPY or equivalent and 30% tech/misc companies I believe in over the long haul. If baba fell another 5-10% I’d probably shift some stocks around, maybe even dip down to 65% SPY. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Don't buy ea. Ever", "score": 4, "replies": [{"body": "I'm a heavy gamer and I second this.  EA will lose market share as time goes by. If ur interested in the gaming sector, consider  UbiSoft.", "score": 3, "replies": [{"body": "Funny how before november all ppl recommended ea beeing the best gaming stock. ", "score": 3, "replies": []}]}]}, {"body": "I personally like MSFT, Canadian banks. Maybe get a few defensive stocks in there, unless you're not worried about holding for 10-30 years through recessions", "score": 3, "replies": []}, {"body": "Thank you all for the replies. Let me elaborate a bit...my investment horizon is 20 years and can save quite a bit of money every year (~$60k/year) so not too worried about getting caught without cash on a downturn.\n\nI know I should probably get an advisor with the size of my portfolio  (already have $140k in stocks) in addition to the cash but I think I can do it myself.\n\nI have been reading a lot about this and so not completely clueless but I find there is wisdom in what large groups of people have to say and hence my post....does not mean i will blindly flow it. Also reason I like Seeking Alpha.\n\nI am not really interested in Bonds or anything outside the stock market. I am think of allocating 20% to index funds but would like bulk in stocks.\n\nI am looking mostly at dividend stocks with growth and a few pure growth ones. Most of my stocks will be in companies with good fundamentals, good cash flow, good sector and good growth and mostly large stocks with a few medium and couple small ones in there.\n\n", "score": 3, "replies": [{"body": "sounds like your canadian right? max out TFSA and RRSP and those funds should all be in S&P500 / the DOW / major canadian banks are decent as well. Everything else 30% tech 30% financials 20% Weed ( huge gains here soon in canada i wouldnt miss the boat on this one ) remaining 20% split between retail/telecommunications & recession free stuff like HD . good luck", "score": 2, "replies": []}]}, {"body": "Stayed out for a year? That's what you get for listening to fake news :P\n\nJust get into some etfs like voo, rsp, ijr, whatevs you'll be good. ", "score": 4, "replies": []}, {"body": "You're new. Buy into some dividend paying stocks for long term holding. I would suggest a couple of index funds for the bulk of it and then 20-25% or whatever to individual companies and riskier investments. \n\nThere are ETFS out there that will hold a lot of these companies and also diversify limiting your risk. ", "score": 2, "replies": [{"body": "> could of \n\n Did you mean could've? \n\n-------------------------------------- \nI am a bot account.", "score": 6, "replies": []}]}, {"body": "if your buying stocks just know don't put money in that you are not prepared to lose. if you're looking at tech I would say wait for some change it's looking like the price of a lot of tech stocks is still dipping from yesterday and you should wait till you think its at its lowest.", "score": 2, "replies": []}, {"body": "I assume you are trading in the TSX? \nlook into the following: \nENB (really good dividend payout and slightly undervalued)  \nCVE (heavily undervalued oil company if you think the energy sector will do well)  \nACB (marijuana companies are showing promising growth)  \nAC (air canada are destroying earnings every quarter)  \nCCO (uranium company, uranium prices kind of suck right now but if they start going up then CCO will skyrocket)  \nOnce again, do you're own research but its good to diversify into various different sectors and have stocks for dividend yield / income / growth purposes.  \n\nGood luck  \n(Edit: Formatting)", "score": 2, "replies": []}, {"body": "As Warren buffet said.. invest on you education first.\nJust like learning to swin or karate.. start with safest\nAnd most basic stuff with very low amount of money just to get the real experience which is very important step which will motivate you..so try something that makes sense then you will have questions and you will auto look for answers and that's what will drive you to learn . \nUse free practice accounts.. learn fundamental,technical analysis.. read the best investing books. Watch the free you tube videos of best investors Warren buffet,ray dalio etc. Just slowly.  Make sure you get the most info as free as possible for first few months except for books. There are free stock apps. . Websites like finviz.com seekingalpha.com.. benginza daily stock market radio/podcast  free on YouTube.  And my best advice for you is since you also have a wife.. both can do something like this.. each study/try something then discuss and share what you learned to each other. . Both focus on different topic like that. Gl bro. ", "score": 4, "replies": [{"body": "Can also look into investing psychology which is totally different than savers and employee mindset. It's a new type of life of rich. For example, a lion is called the king of jungle coz of his mindset.. hes not the bigggest.. strongest.. fastest.. yet hes the king.. he sees an elephant and thinks food. So my favorite teachers to change your mindset or cleanse it are.. Jim rohn, Robert kyosaki, nityananda (just focus on their talks concerning wealth).\nBooks like richest man in Babylon.  ", "score": 1, "replies": [{"body": "Try fucking with these strategies on a sight called \"wall street survivor\" you get a fake 100k to invest.", "score": 1, "replies": []}]}, {"body": "Why not read books?", "score": 1, "replies": []}]}, {"body": "I suggest a lot of it in MSFT, their cloud computing department is bound to grow just due to the fact its Microsoft.  There is a lot of software from large companies that run on Windows, which makes Azure their default partner for offering their software on the cloud.  With its huge growth potential and with it being relatively stable large cap stock I think its a no brainer.  \n\nTheres also AMD.  A meme stock that has already proven to beat Intel at heat efficiency in laptops with 3x the graphics performance of Intel along with freesync, and is able to offer more cores for a fraction the price of Intel in the server market.  If we assume the new consoles sell well during Xmas it will also go up.  There are a lot of 20$+ price targets on it for good reason, and its taken a large dip lately.", "score": 1, "replies": [{"body": "would not recomend AMD to volatile at the moment they filed for bankruptcy in 2016 and have had crazy last year or so go up and down If you are looking to get AMD wait till it lowers some more and then buy big and then look for a quick turn around when you see some okay return. ", "score": 1, "replies": []}]}, {"body": "what about TCEHY or JD for some chinese exposure", "score": 1, "replies": []}, {"body": "Don't invest it all until you completely understand what you're doing. Not even half of it. ", "score": 1, "replies": []}, {"body": "Find a financial advisor you can trust, ask your family to see if they have someone they would recommend. Please don't take advice off of Reddit for an investment that large...", "score": 1, "replies": []}, {"body": "If your company(s) offer good 401k plans max that out first. That's going to be your best bet. If not, follow the advice of people below.", "score": 1, "replies": []}, {"body": "Most of us are probably tech heavy because so many have had explosive growth over the last couple years. If you're not sure which tech stocks to get I'd recommend a tech sector mutual fund until you get a good feeling about specific stocks you want. My Fidelity tech mutual fund has returned about 53% in the past year. \n\nI like your strategy of starting with Canadian companies since you probably know those best. Start with what you know. ", "score": 1, "replies": []}, {"body": "Buy leaps in aapl \nIf you’re worried just buy 1 and sit tight.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Thought the rally was overextended and due for a breather...especiallt with unpredictability of Trump.", "score": 1, "replies": [{"body": "Sorry to these that man, you really missed out /:\n\nI saw that you have  good amount already in your portfolio, yada yada yada... I'd say just go ahead and go to a financial advisor. One that you trust.\n\nI went to the family FA once I had an amount I was going to lose through stupidity or greed. I'm no risk analyst and dyslexic af so now I just manage my IRA with easy to understand ETF's / SP500. Outside of that I give myself a low amount to roll dice with.\n\nYou seem like in a much better cash position compared to a lot of other younger people, so my 0.02 is be as careful as possible and look heavy into an FA.", "score": 1, "replies": []}]}]}, {"body": "If you're young, invest in small cap index funds. Many will agree, and many will disagree with the following statement. *If* you're risk averse and want to try and strike it rich, timing the market isn't ***that bad*** of an idea. ", "score": 1, "replies": []}, {"body": "If I was in your position, I'd park all my money in VOO or SPY. Then adjust accordingly.", "score": 0, "replies": []}]}
{"title": "PSA for people bagholding MU shares", "selftext": "I thought \"buy high, sell low\" was just a meme but some of you really do this, you need to stop ASAP\n\nI bought 50 shares of AMZN at an ATH of $1079 back in July in a terribly moronic attempt to play earnings, got mauled by the drop to $990ish, and watched it sink further over the course of months to $930. Every time it would slowly start recovering, it would eventually shit itself. That's months of staring at a big fat negative number and learning to ignore it.\n\nAMZN recovered all of that and then some with the last earnings, I sold too many shares too soon but I didn't lose any money.\n\nMore importantly there were two lessons, one which I learned and one which I have yet to:\n\n- don't sell low if you believe it will recover and the fundamentals haven't changed\n- don't buy anywhere near an ATH (increasingly difficult these days), even if it means waiting, time your fucking entry and don't buy in like an ape\n\nNow of course I fucked up on the second half and bought into MU earlier this week instead of today, but I will baghold like a fucking champion and not sell now, and I'd advise you'd do the same.", "id": "7gvusi", "created_utc": 1512143683.0, "score": 142, "upvote_ratio": 0.93, "num_comments": 41, "comments": [{"body": "Thanks for dropping these jewels on us fam.", "score": 68, "replies": []}, {"body": "There's a caveat. Amazon and Micron are two highly different companies - one company is a consumer retail company with a highly diversified revenue stream and the other is a company that feasts and starves on the price of DRAM. \n\nMU has a higher IV for this reason. I think MU will be absolutely fine if you have a time horizon of 5 years or more, but I'd watch carefully what the DRAM supply and demand are like in 2018 - and they will talk about this in their earnings report in three weeks. \n\nTheir earnings will be stellar, but their forecast better be stellar too.", "score": 33, "replies": [{"body": "Absolutely, but I was thinking mostly of the run-up prior to earnings as a way for people to exit while minimizing losses", "score": 9, "replies": []}]}, {"body": "Do we baghold SQ like champions too?", "score": 24, "replies": [{"body": "Yes", "score": 8, "replies": [{"body": "SQ to $50 by Jan? \nWhen's this charter BS going to be approved. This is not the SQ I signed up for...", "score": 7, "replies": [{"body": "By June is my bet ", "score": 3, "replies": [{"body": "The old SQ would be up 150% by then.. :'(", "score": 6, "replies": [{"body": "Sad reacts only", "score": 5, "replies": []}, {"body": "that one weak where SQ went up by 10% every day. feels like such a long time ago", "score": 5, "replies": []}]}]}]}]}]}, {"body": "Look at this fag teaching us how to make money.", "score": 25, "replies": []}, {"body": "Ok", "score": 12, "replies": []}, {"body": "MU is sitting pretty compared to MOMO. MOMO dropped so hard the PE is actually reasonable. ", "score": 7, "replies": [{"body": "been bagholding this garbage for a while. there are way better investments if you're looking to buy on a dip. I keep trying to find a decent price to cut losses but this shit will not stop dropping", "score": 4, "replies": [{"body": "Yeah, I keep thinking it has to stop dropping at some point, because it actually has a pretty good valuation now, especially compared to other tech stocks. But then they release another earning that beats by like 20%, but has 1 or 2 bad factors and it plunges 25%. ", "score": 2, "replies": []}]}]}, {"body": "Can the same be said about AyyMD?", "score": 6, "replies": [{"body": "AyMD's P/E is... oh wait they don't have earnings. Forgot they were a start up.", "score": 15, "replies": [{"body": "Startup since 1969", "score": 11, "replies": []}]}, {"body": "AMD's fundamentals are weaker. ", "score": 4, "replies": []}]}, {"body": "Sold my $AMD bag at a small loss and put it all into my $MU bag.", "score": 5, "replies": [{"body": "Just did this with my BSTI shares", "score": 1, "replies": [{"body": "You feel fine with giving up BSTI? I’m still holding the bag on mine, I got too hyped on the “FEDEX of China” meme, but don’t know if it’s worth giving up on them.  ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Also can't go up. Check mate.", "score": 5, "replies": []}]}, {"body": "just invested $10k avg cost basis $41.47, this is the pllback i was waiting for\n\nam i a genius or a retard?", "score": 3, "replies": [{"body": "> genius or a retard?\n\nTime will tell.  Make a post in February.", "score": 3, "replies": []}]}, {"body": "I got in MU today at $41.51, and BABA at 175.97\n\nI hope you're right. ", "score": 3, "replies": []}, {"body": "Helter Skelter in a summer shelter", "score": 2, "replies": []}, {"body": ">don't buy in like an ape\n\nSolid", "score": 2, "replies": []}, {"body": "STOP BEING A FAGGOT", "score": 2, "replies": []}, {"body": "but SQ has been making all times highs since 27? Thats a run up of a 100 percent. and the only reason im able to survive this olocost", "score": 2, "replies": []}, {"body": "tldr: baghold", "score": 2, "replies": []}, {"body": "Only on wsb will someone (who got shafted by MU this week) condescendingly explain why people should've been smart enough to not get shafted by MU.", "score": 2, "replies": []}, {"body": "I'm gunna short OP", "score": 1, "replies": []}, {"body": "Since you contradicted yourself, are you selling now or not?", "score": 1, "replies": []}, {"body": "> time your fucking entry and don't buy in like an ape\n\nThat's solid advice, i'm slowly starting to learn that too. Sometimes its better to wait a bit.  Also grab earnings if you think a stock rises to high too quick for its own good, just sell at a profit and wait for it to drop back.  ", "score": 1, "replies": []}, {"body": "True for shares.\n\nToo bad I bought options and have to factor in Vega and Theta.", "score": 1, "replies": []}, {"body": "Real strong close today. Unless those retards in washington fuck up (likely) it should be a good monday. There no way this doesn't runup pre-ER ", "score": 1, "replies": []}]}
