{"title": "Tesla is breaking out. Will reach $225 by 30th June.", "selftext": "[deleted]", "id": "bxopkv", "created_utc": 1559870701.0, "score": 32, "upvote_ratio": 0.73, "num_comments": 77, "comments": [{"body": "I've maintained 250 by earnings. Once earnings is reported, who knows.", "score": 13, "replies": [{"body": "Good thinking. But nobody expects Tesla to be hugely profitable in Q2.\n\nModel 3 SR is still being sold at $35,400 (however in low volume) at below marginal cost ($37,000). They make up for it through sale of regulatory credits and sort of break even for marginal cost.", "score": 0, "replies": [{"body": "It's basically been the floor for a while before the trade war caused a massive panic sell.", "score": 5, "replies": []}, {"body": "Isn’t 37k the cost for the LR RWD?", "score": 4, "replies": [{"body": "Cost? Marginal cost of Model 3 SR (or SR+, both are same) is $37,000", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "No they did not!", "score": 1, "replies": []}, {"body": "Sandy Monroe", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "The one where he said $37,000 in US, and 25% less in China.\n\nCannot be last summer.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Okay.\n\nQuite possible, either you heard wrong or I heard wrong.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "What is there? You can share it here.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "He is probably talking about the price of SR+(the then price) not cost.\n\nCost to the customer.\n\nPossibly SR with AP", "score": 2, "replies": [{"body": "His tear down was the LR RWD.  Not the SR.  And he said it was a 30% margin.  I don’t think anyone knows the margin on the SR.", "score": 1, "replies": [{"body": "You are talking of last summer. I am talking of interview he gave after his China visit", "score": 1, "replies": [{"body": "Also there’s an email from Elon in November which says the cost at that point was still 38k for the SR.   Since he raised the price to 39k I’m gonna say the marginal cost is not yet under 35k.  I hope there’s a plan to improve margin.", "score": 1, "replies": [{"body": "The only way out is to discontinue SR", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "If Q2 is a miracle quarter with earnings beating 2018 Q3 earnings then it would be a crazy situation. If retooling in Q1 was really what hurt S/X demand and they've been selling high ASP model 3's with FSD and increased capex then the company would just be in a objectively better state than Q3 earnings in every possible metric, they raised capital and everything. The stock jumped to $340 after Q3 earnings. With $9 billion in shorted stocks being 25% of float then it would just be chaos. Not to mention how much normal auto manufacturers would dip since their sales are declining 10-30% y/y.", "score": 1, "replies": [{"body": "Did I say that Q2 will be hugely profitable?\n\nAll I said that most people believe that Tesla will be able to achieve its guidance regarding deliveries for Q2. Even the Tesla guidance regarding profit/loss doesn't say that it will be very profitable.", "score": 4, "replies": []}, {"body": "For that to be true, Tesla would have been stupid to not raise capital in Q4 or early Q1; the only logical explanation is that they were reactive in the change, but had it on the drawing table for a while.", "score": 1, "replies": []}]}]}]}, {"body": "I'm really worried about the S/X sales. I think Tesla should just announce the refresh and take preorders. These leaks really destroyed the demand in Q 1 and now they're probably gonna do the same at the end of Q2 and 3. So it'll still be uncertain till they come out with that pogchamp 450mile and 400mile models of S and X.", "score": 8, "replies": [{"body": "I think their strategy is to wait to announce until it is a foregone conclusion, and be ready to deploy (almost) immediately.  This precludes much in the way of external long-lead items changing, as the move would be telegraphed too far in advance.  \n\nPersonally, I would most prefer to see S/X production consolidated onto a single assembly line, clean up the “spare” line, and run the modified line with the updated model, then cleaning up the other line for the Y.", "score": 3, "replies": []}, {"body": "I agree", "score": 2, "replies": []}, {"body": "Demand was dead when Model 3 <exists>. There was really no avoiding that so I agree they should go for broke and really rev up the hype for new S and X since there's no putting the genie back in the lamp", "score": 1, "replies": []}, {"body": "I think the free super charging for inventory S' and X's on top of tax credit halving will increase sales to around 3k for each for June, although I expect q1 numbers for q3 because of looming refresh.", "score": 1, "replies": []}, {"body": "Hopefully, enough potential S/X buyers don't like the idea of a more minimalist interior on the higher end cars.\n\nJust from the rumors, I'd buy before the update. They'd probably make it work and after seeing it I would change my mind... but from rumors alone I'd prefer not to have my 100K+ car interior \"minimalized\".\n\n&#x200B;\n\nThe Raven updates were purely performance improvements... so that surely hurt them.\n\n&#x200B;\n\nWe -almost- returned our X upon delivery to re-order and get the Raven updates. From a purely selfish point of view I probably should have. I just decided the car was still every bit as good as it was when I placed the order back in March.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 6, "replies": [{"body": "What is b***s***?\n\nThat nearly 20 million shares were bought yesterday as against 11 million on an average day?", "score": 3, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "Market makers are those who buy or sell shares.\nYesterday nearly 20 million shares were bought. Check with Nasdaq.", "score": 1, "replies": [{"body": "You really should look that up.  Small buyers and sellers do not “make” the market— that is large institutions and day traders.\n\nThe volume spike can easily be explained by closing of short positions.", "score": 2, "replies": [{"body": "Do you think that \"small buyers and sellers\" (your words not mine) bought 20 million shares in one day? And please read carefully what I have written, and do not put words in my mouth and then criticize it.", "score": -1, "replies": []}]}, {"body": "This is not correct.\n\n&#x200B;\n\nTheOtherPete's explanation is accurate, and bonghits is being a bit rude, but he's also correct.", "score": 2, "replies": []}, {"body": "There's more to it than that.  They have to continuously buy *and* sell shares at advertised rates.\n\nThe existence of a market maker helps put a bound on the value of a security... there's always a buyer / seller available at *some* price.", "score": 2, "replies": []}]}]}]}, {"body": "Though you opinion is valid you need to be nice.   2 days off.", "score": 1, "replies": []}]}, {"body": "Just one point:\n\n&#x200B;\n\n\" Market makers are convinced that Tesla will reach it's guidance\"\n\n&#x200B;\n\nMarket makers don't take positions like this, and don't pay attention to company guidance or probability of success or anything like that, and the vast majority of market makers trade delta neutral or close to it.\n\n&#x200B;\n\nIt's institutions, banks, and retail that care about that stuff.", "score": 4, "replies": [{"body": "Market Maker is one who understands the market and who gives it direction. You can keep quibbling on the definition, if you like.", "score": -2, "replies": [{"body": "I work for a market maker, and I have worked for two others.\nYou are 100% incorrect.  I'm not trying to be a dick about it, your understanding is wrong.\n\nMarket makers offer a price to buy and sell and have to meet certain requirements of resting size and percentage of series with quotes available for a %age of the day.  In exchange they get rebates or decreased fees.\n\nIn order to do this they can only trade positionally very slightly by leaning their bid and offer to one direction only a little bit.\n\nThey do NOT read earnings reports, they do NOT care about guidance.  They trade delta neutral and make money ff f combo spreads, mispricings, volatility, etc.", "score": 6, "replies": [{"body": "\"The most common type of market maker is a brokerage house that provides purchase and sale solutions for investors in an effort to keep financial markets liquid. A market maker can also be an individual intermediary, but due to the size of securities needed to facilitate the volume of purchases and sales, the vast majority of market makers work on behalf of large institutions.\"\n\nOperative part is \"work on behalf of large institutions.\"", "score": -1, "replies": [{"body": "It doesn't matter who they work for, it matters what they do and how they do it.\n\nThey are usually part of large institutions because the capital needed to quoted thousands of options all day and not go bankrupt is huge.\n\n\" that provides purchase and sale solutions for investors in an effort to keep financial markets liquid\"\nis the only relevant point in what you posted, and it again explains what you do not understand.\nYou need to stop arguing, you are basically arguing that the sky is green.  Nothing you find or post and misunderstand will change that.", "score": 3, "replies": [{"body": "Now, you are being a (I don't want to say it).\n\nMoreover, you missed the message.\n\n\"Tesla is breaking out. Will reach $225 by June 30\"\n\n210.38USD  4.43 (2.15%)\n\n7 Jun, 10:41 am GMT-4 ", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Okay, if that pleases you. \n\n(It is quite obvious that you have never been part of the strategy team of a market maker which fixes the bid and ask price)", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Poor TheOtherPete!\n\nHow old are you?\n\nSince you claim to be expert, what's your take on the title of the post?", "score": -1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "/tangent \n\nprob gonna get hate for this: there are exceptions e.g. young tech-employees and hipsters, but people who use Robin Hood generally don't have a lot of money individually or are yet financial saavy; it has utter shit trading times and ridiculous spreads on ask, they advertise features for gold which you pay for that are free on almost all other platforms (like instant access to deposits to trade), worse pre/post market trading hours which is pivotal for any non-hobbyist trader, shit/barely existant customer service, bad selections automatically for tax lots (the worst imho), etc. At the average account holdings (1k-5k) it's also a rip-off.\n\nWhat they Excel at is tricking young people with nice marketing and fake intentions -- it is a VC backed start up that profits on your data and gambling money that's sitting between transactions. If you need to worry about $2-5 per transaction on a $200 security, you are doing it all wrong.\n\nSource: young tech employee, but not a noob.", "score": 8, "replies": [{"body": "agree with this.  also agree its a tangent.", "score": 5, "replies": []}]}, {"body": "All of us, who buy or sell shares.", "score": -1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Yes", "score": 0, "replies": []}]}, {"body": "incorrect. Individual buyers outside of people who work for the company make up a very insignificant percentage of shareholders (at least the ones who are not doing options trading).\n\nEdit: source: https://investors.morningstar.com/ownership/shareholders-major.html?t=TSLA", "score": 3, "replies": [{"body": "Correct, this was a large part due to fidelity and T Rowe exiting their position.\n\nThe big boys are the one ms selling. Will the buy back in? That’s a whole different question.", "score": 3, "replies": [{"body": "Plus an additional 12-13 M shares shorted, which will have to be unwound.\n\nOuch!", "score": 1, "replies": [{"body": "In the future, yes.  But that’s not what brought down the price.", "score": 0, "replies": [{"body": "Why would 12M shares shorted not bring down the price?", "score": 3, "replies": [{"body": "Oh boy that’s a long one, with lots of research on both sides. You start getting academic real quick.\n\nSome people believe it suppresses the price, since shares are sold; others believe its a mechanism that allows more liquidity in trading, and helps the market price in information quicker.", "score": 1, "replies": [{"body": "It’s the same downward price as a tute selling 12M shares.", "score": 1, "replies": [{"body": "Yes, but the question is does it provide more liquidity so the stock can more quickly react to information?", "score": 1, "replies": [{"body": "\"Long\" term you are right, \"short\" term s/he is.", "score": 1, "replies": []}, {"body": "Nope.  That is not what the question was.", "score": 1, "replies": []}]}]}]}, {"body": "A better question would be how does a short existing bring down the price? They are a symptom of the record lows, not what caused them.", "score": 1, "replies": [{"body": "Shorts exiting raise the price the same as any other buyer.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I'm going to leave this post but its just opinion.", "score": 2, "replies": [{"body": "True, it is an opinion. But the facts quoted in original post are undeniable.", "score": -5, "replies": [{"body": "the \"facts\" are wrong because of your misunderstanding of what a market maker is, and confusion between them and institutional investors.", "score": 3, "replies": [{"body": "Market Maker is one who understands the market and who gives it direction. You can keep quibbling on the definition, if you like.\n\nBut what was the message? \"Tesla is breaking out & will reach $225 before June 30\"\n\n209.21USD 3.26 (1.58%)\n\n7 Jun, 10:06 am GMT-4", "score": -1, "replies": [{"body": "I work for a market maker, and I have worked for two others.\nYou are 100% incorrect.  I'm not trying to be a dick about it, your understanding is wrong.\n\nMarket makers offer a price to buy and sell and have to meet certain requirements of resting size and percentage of series with quotes available for a %age of the day.  In exchange they get rebates or decreased fees.\n\nIn order to do this they can only trade positionally very slightly by leaning their bid and offer to one direction only a little bit.\n\nThey do NOT read earnings reports, they do NOT care about guidance.  They trade delta neutral and make money ff f combo spreads, ispricings, volatility, etc.", "score": 3, "replies": [{"body": "\"The most common type of market maker is a brokerage house that provides purchase and sale solutions for investors in an effort to keep financial markets liquid. A market maker can also be an individual intermediary, but due to the size of securities needed to facilitate the volume of purchases and sales, the vast majority of market makers work on behalf of large institutions.\"\n\nOperative part is \"work on behalf of large institutions.\"", "score": -1, "replies": []}]}, {"body": "Perhaps this will help you:\n\nhttp://lmgtfy.com/?q=what+is+a+market+maker\n\nYou will find:\nmar·ket mak·er\n/ˈmärkət ˌmākər/\nnoun\na dealer in securities or other assets who undertakes to buy or sell at specified prices at all times.\n\nNow, please learn instead of arguing.", "score": 3, "replies": [{"body": "\"The most common type of market maker is a brokerage house that provides purchase and sale solutions for investors in an effort to keep financial markets liquid. A market maker can also be an individual intermediary, but due to the size of securities needed to facilitate the volume of purchases and sales, the vast majority of market makers work on behalf of large institutions.\"\n\nOperative part is \"work on behalf of large institutions.\"", "score": -2, "replies": []}]}]}]}, {"body": ">Market makers are convinced that Tesla will reach its guidance for deliveries in Q2\n\nIs there a citation for that \"undeniable\" fact?", "score": 4, "replies": [{"body": "Yes. But depends on what you call citation. For one, you can read the elektrek article.", "score": -2, "replies": [{"body": "Why I call a citation?  Probably the same anyone else would call a citation.  That isn’t a controversial term. \n\nI don’t know what electret article you are referring to, nor is it relevant since it is just a blog.\n\nEdit:  do you have a citation for your comment about the  analysts?   Since this is an investing sub, that would be good information to share.", "score": 5, "replies": [{"body": "Okay", "score": -2, "replies": []}]}, {"body": "it's false.", "score": 2, "replies": []}]}]}]}]}, {"body": "While I wouldn't be surprised to see more by the end of next week this is gonna be a massacre if the q2 deliveries don't add up to the hype.", "score": 2, "replies": []}, {"body": "!remindme 21 days", "score": 1, "replies": [{"body": "I will be messaging you on [**2019-06-30 03:47:54 UTC**](http://www.wolframalpha.com/input/?i=2019-06-30 03:47:54 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/teslainvestorsclub/comments/bxopkv/tesla_is_breaking_out_will_reach_225_by_30th_june/eqh8k2e/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/teslainvestorsclub/comments/bxopkv/tesla_is_breaking_out_will_reach_225_by_30th_june/eqh8k2e/]%0A%0ARemindMe!  21 days) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! eqh8yxn)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Good call. Already hit $225 AH today. What is the next target?", "score": 1, "replies": [{"body": "Can  say only after the Q2 deliveries are known.", "score": 2, "replies": []}]}]}
{"title": "I love Tesla", "selftext": "I love Tesla. All the drama, the memes, the community surrounding it, it's really something. But what I love most about it is knowing that in couple years I will be a billionaire. It's not even a 99% chance, it is quite literally guaranteed. As a result of that knowledge, I stopped showering and brushing my teeth over a year ago. There is simply no reason for me to do it when I know I'll be rich. I will be fucking whores every night and laughing as they're throwing up from my disgusting, stinky body and mouth. As they kiss me on my rotten teeth, or suck my dirty, 2 year unwashed hog. It will be quite something. In fact I am already seeing effects of my stinky adventure. Yesterday I went to a shop to buy some cheese and make a stop at McD's for a big mac and the cashier at the store was visibly gagging at the smell of me and trying to hide it. Other customers were standing like 5 meters behind me. It was truly hilarious. And none of them have any idea of my guaranteed, future riches. They must already be so jealous of me. The stinkiest billionaire ever.", "id": "bxw4ig", "created_utc": 1559922302.0, "score": 1153, "upvote_ratio": 0.95, "num_comments": 78, "comments": [{"body": "TIL I’m a fucking idiot for being a Tesla bull because of animals like this.", "score": 529, "replies": [{"body": "except hes actually an upset tesla bear", "score": 168, "replies": [{"body": "Wait so he’s not a guy on the internet unironically  pretending to be revolting? Thanks for keeping me in the loop.", "score": 50, "replies": []}, {"body": "Why would a Tesla bear be upset? Unless they have a phobia of money or have been a bear since 2012?", "score": 15, "replies": [{"body": "no no, they likely started being a bear at $179", "score": 36, "replies": [{"body": "As is tradition for WSB", "score": 28, "replies": []}]}, {"body": "I was selling what I thought were deep OTM calls and then the stock just 15%", "score": 7, "replies": [{"body": "Oh okay, yeah so that's a pretty decent reason, I'll give you that.", "score": 4, "replies": []}]}]}, {"body": ">upset Tesla bear\n\nlol most Tesla bears have been shorting for longer than 2 weeks", "score": 1, "replies": []}]}, {"body": "When you, OP and the Ark ladies end up in the homeless shelter you can argue about who can suck his hog first.", "score": 11, "replies": [{"body": "> Ark ladies\n\nArk, Survival Evolved?\n\n[https://i.ytimg.com/vi/yfv30vcX8-Y/maxresdefault.jpg](https://i.ytimg.com/vi/yfv30vcX8-Y/maxresdefault.jpg)", "score": 5, "replies": []}, {"body": "Who’s hog? Elon’s? Not sure I like your tone. I would obviously be first.", "score": 7, "replies": []}]}]}, {"body": "You are an inspiration and it’s because of people like you that I got into finance in the first place.  Thank you.", "score": 80, "replies": []}, {"body": "*uses meters and never showers* \n\ndude, you are making europeans look bad, m'kay?", "score": 134, "replies": [{"body": "Maybe he's just french", "score": 54, "replies": [{"body": "French wouldn't eat a big Mac, maybe Canadian", "score": 17, "replies": [{"body": "Isn't McDonald's in France better?", "score": 2, "replies": [{"body": "[deleted]", "score": 45, "replies": [{"body": "LMAO", "score": 2, "replies": []}]}, {"body": "I was gonna say they don't call it a big mac in France, but looking on their website they actually do. That being said, a French person wouldn't use the slang McD's, I don't think it works in French. They actually say McDo on their website.", "score": 3, "replies": [{"body": "Quarter Pounder is a Royal with Cheese", "score": 9, "replies": [{"body": "No. Royal Cheese.", "score": -6, "replies": []}]}, {"body": "El Bigo Maco", "score": 2, "replies": []}, {"body": "Where I am from, we call it McDicks", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I'm going to be rich soon as well. I'm shorting TSLA.", "score": 29, "replies": [{"body": "Maybe bears and bulls are not so different. They can live together side by side in harmony and both be stinky billionaires.", "score": 9, "replies": [{"body": "I can live together with $4000 Tesla bull cutie no problem.", "score": 3, "replies": []}]}, {"body": "☝️", "score": 1, "replies": []}]}, {"body": "Investing in this copypasta for all Tesla threads. #longelon", "score": 24, "replies": []}, {"body": "This should be a copypasta", "score": 18, "replies": []}, {"body": "> Other customers were standing like 5 meters behind me \n\nWe speak American around these parts.", "score": 13, "replies": []}, {"body": "Don't forget to only flush your toilet ever 10-15 shits. Right before you decide to flush, make sure to wash your feet in your newly found shit filled toilet. What's it matter anyways? Your toilet a couple years from now will be made of gold! After washing your feet in your fecal matter, make sure to never wear socks and only wear flip flops while walking around. If you're feeling generous, place your feet up on tables at restaurants so the servers can grab a little snack from under your toe nails. If you manage to get them to throw up, guide them to the nearest empty glass and grab a little of what they're coughing up. Swish it around the glass, savor the aroma, then drink it. The goal is to make yourself throw up on the table next to you. That's when people really know you got money coming you way. Everyone will then stand up and clap, and as they do, grab a little shitty toenail fungus and begin jerking off in the middle of said restaurant to an applause comparable to Freddy Mercury at the peak of his career.\n\nYou're welcome.", "score": 94, "replies": [{"body": "what the fuck", "score": 72, "replies": [{"body": "ohh like you've never done that before!", "score": 11, "replies": [{"body": "Believe me i am fully autistic but this.....this is just something else entirely", "score": 1, "replies": []}]}]}, {"body": "How do I forget this", "score": 22, "replies": [{"body": "Embrace it.", "score": 14, "replies": []}, {"body": "Take the losses I incurred as a tsla bear last week. You'll forget it real fucking quick.", "score": 2, "replies": []}]}, {"body": "Thanks for making me feel better about losing $14000 in plant meat puts", "score": 35, "replies": []}, {"body": "r/cursedcomments", "score": 7, "replies": []}, {"body": "That was beautiful", "score": 6, "replies": []}]}, {"body": "the amount of people on this sub willing to suck Elon's dick is unreal.", "score": 22, "replies": [{"body": "The dirtiest hog of them all", "score": 5, "replies": []}, {"body": "eLONG musk amirite?", "score": 2, "replies": []}, {"body": "Big AFRICAN dick", "score": 1, "replies": []}]}, {"body": "Who needs to go to the toilet when you can just pee into pee bottles. When you become a billionaire, those bottles will be worth more than bottles of Mountain Dew!", "score": 9, "replies": []}, {"body": "funny... but untrue because it will be ME who will be THE stinkiest billionaire ever", "score": 6, "replies": []}, {"body": "Calm down man.", "score": 13, "replies": []}, {"body": "This thread is cash money", "score": 7, "replies": []}, {"body": "Hang on a second. Are you single?", "score": 6, "replies": []}, {"body": "the most unbelievable thing about this is that you think it'll just take 2 years", "score": 6, "replies": [{"body": "it'll be 2 years until SPaceX send a japanese billionnaire to the Moon and have enough cashflow from their internet satellites to be able to buy Tesla wholesale @ 420, so I can believe it", "score": 1, "replies": [{"body": "i think musk wants to distance tesla and spacex as much as possible. spacex is a for sure thing already worth way more and more potential. tesla is risky as hell", "score": 1, "replies": []}]}]}, {"body": "you might want to start showering and looking for a job because I just bought more tsla shares yesterday.  That can only mean ONE thing because the god of trading fucking hate me, TSLA is gonna reverse down to 50$.", "score": 5, "replies": []}, {"body": "this post made me a little nauseous", "score": 4, "replies": []}, {"body": "I'm going to love when people go broke because Tesla goes bankrupt", "score": 4, "replies": []}, {"body": ">  standing like 5 meters behind me. \n\n&#x200B;\n\nWhat Mcdonalds has a 15 foot berth at the ordering counter?", "score": 3, "replies": []}, {"body": "Your musk will be unfathomable. ;) Your wealth and status will be so great, the perfume/cologne industries will rush to try and capture your essence. Everyone will want to smell like you.", "score": 4, "replies": []}, {"body": "Drove past a Tesla dealer ship not to long ago . They look like they are doing well for themselves /s", "score": 6, "replies": []}, {"body": "I lost 30 IQ points after reading this", "score": 5, "replies": []}, {"body": "HQ shitpost only real Pepe’s will understand.", "score": 5, "replies": []}, {"body": "Oh my sides!", "score": 2, "replies": []}, {"body": "Red Monday confirmed", "score": 2, "replies": []}, {"body": "Great DD! Need to liquidate my position immediately.", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "This is my favorite.", "score": 1, "replies": []}, {"body": "Anyone got thoughts on NIO?", "score": 1, "replies": []}, {"body": "Going to be hilarious when shorties get destroyed, I hope they doubled down on this pop", "score": 1, "replies": []}, {"body": "If you are not trolling and are serious, you need to start storing your shits in mason jars. Just dedicate a ladle for your bathroom or just directly shit in the jar. The shit jars will fetch a pretty premium when you are famous. You may probably not need money at that time in which case you can donate them to museums who will be falling over themselves to showcase your pre-billionaire feces.", "score": 1, "replies": []}, {"body": "I’m saying this only once.... \n\n\nSHORT CHERNOBYL", "score": 1, "replies": []}, {"body": "post proof of your position or u should ban urself", "score": 1, "replies": []}, {"body": "Wsbspypredict hi", "score": 1, "replies": []}, {"body": "Wsbspypredict hhahshdhdbddhhdh", "score": 1, "replies": []}, {"body": "The joke is that Tesla stock is shit", "score": -3, "replies": []}, {"body": "Wsbspypredict hi", "score": 0, "replies": []}]}
{"title": "Huge bearish signal for my fellow old people", "selftext": "[deleted]", "id": "by04ot", "created_utc": 1559943111.0, "score": 308, "upvote_ratio": 0.96, "num_comments": 81, "comments": [{"body": "This is the DD that I come here for", "score": 213, "replies": [{"body": "SPY Putz YOLO", "score": 17, "replies": []}, {"body": "100% quality, quadruple distilled bullshit indeed", "score": 6, "replies": []}, {"body": "My schfinkter jus titaned up and i kno that its ending", "score": 0, "replies": [{"body": "Titaned up instead of tightened? Must have a big ol asshole and thats what Im here for", "score": 7, "replies": [{"body": "Lmao\n\nEdit: Tite like a GoD", "score": -4, "replies": []}]}]}]}, {"body": "I'm an old person. I remember razor skooters, but they are nothing like the things now. Also the .com crash was different than today, back then people were all hyped on this new thing called the interwebs and \"electronic mail\".  People bought stock in anything with dot com in the name and things like yahoo went up literally 10,000% in the matter of a few weeks. \n\n\"You've got mail!\" \n\nThen it all came crashing down. I lost $10,000 one day, and this is back when 10K was actually some money. I learned a valuable lesson that day. \n\nIn any case I'm old now and I forgot what the fuck I was talking about. Stay the fuck off my lawn with them damn skooters. Oh, and diversify.", "score": 95, "replies": [{"body": "Can I remind you of the two taxi companies with a combined market cap of a bit over $90B?", "score": 33, "replies": [{"body": "They actually offer a product people demand. It’s not a facade like the dot com. If they went away, something similar would quickly replace them, and for that reason, they probably aren’t going any where.", "score": 20, "replies": [{"body": "I bet I could corner the market on something if I sold it at half the price of what it takes to make money", "score": 5, "replies": [{"body": "Someone is gonna figure out how to make money doing it. Nobody wants to ride in taxis anymore. Uber and Lyft have a very, very big headstart in being the ones that figure it out.", "score": 1, "replies": [{"body": "The ones that will \"figure it out\" are waiting for true self driving tech. Paying a person to drive you is the reason you can't be profitable at Uber prices. The moment that there is a fleet of cars running 24/7, never stopping, never sleeping, never eating, that is a gold mine.\n\nAnd that's what Uber and Lyft are waiting for.", "score": 2, "replies": []}, {"body": "lol and how are they going to \"figure it out\"? taxi rates are at their level for a reason.", "score": 1, "replies": [{"body": "self driving electric cars is the end game right? get rid of the drivers all together.", "score": 3, "replies": [{"body": "Yup. A shit ton of their revenue goes to the drivers", "score": 1, "replies": []}, {"body": "and if you do some hw into that industry,  you'll quickly realize it's a massive fraud.", "score": 1, "replies": []}]}]}]}]}, {"body": "Cool theory.. except when you factor in the rate increases that will make Uber or Lyft no more competitive than your local cab companies that have been around since the automobile was invented.. even longer actually if you count horse drawn carriages.", "score": 2, "replies": [{"body": "Even if the rate was the same, people would still choose Uber. The experience is so much better and the idea of ride sharing is ingrained in society. Ridesharing isn’t going away, it can’t. Even if that means rolling debt and secondary offerings to kick the can until  autonomous vehicles are viable.", "score": 2, "replies": []}, {"body": "Even if that becomes true, I’d still choose Uber 100/100 times. Hail it using my phone, no pressure for cash tip, tracked on gps with map of route and estimated arrival, cars are generally nicer, drivers are often friendlier. It’s not even remotely close when it comes to experience. If it costs as much than so be it", "score": 0, "replies": [{"body": "It is a little better I guess than when the horses would fill the streets with shit.", "score": 1, "replies": []}]}]}, {"body": "their \"product\" is not sustainable or viable. it's not economically feasible to offer poor people a private car service to the liquor store and back.", "score": 2, "replies": []}, {"body": "Weedstocks too when weed is easy to grow and the black market stuff is better and cheaper (in Canada at least) and we won't even have shatter or proper extracts and most people I know are actually continuing to buy off black market out of principle over any other reason.\n\nYes, weed is a product people want. Just not from some government regulated industry when a better industry is already thriving.\n\nOh and the roll out of stores / online was totally messed up too.\n\nI just buy the legal stuff cuz I'm a normie now. Most people are normies, but most normies have no interest in weed.", "score": 3, "replies": [{"body": "The black market won't go away overnight but it will fade over time, I guarantee it. A couple decades from now, people who were born in 2019 will be able to buy weed and they will never have known a world where it was illegal. They will just go to stores because that's the obvious thing to do, they won't be clinging to some notion of how things used to be.", "score": 3, "replies": [{"body": "Will probably grow their own in larger numbers too though.", "score": 1, "replies": []}]}, {"body": "Plus increased enforcement of illicit dealing that make it too risky to deal with the business.", "score": 2, "replies": [{"body": "That hasn't worked for literally a century every time they've tried bro. It's why we legalized.", "score": 1, "replies": []}]}, {"body": "Government will come in clutch at the right time and sling mud on the black market, probably try to scare people with fentanyl lacing rumours and what not.", "score": 1, "replies": [{"body": "They're already trying. It won't work. Good luck with apha. I'm in too, but at $5.85 CAD average so not worried too much.", "score": 1, "replies": [{"body": "Well things take time..", "score": 1, "replies": []}]}]}]}]}, {"body": "Now imagine 1000s of those only even higher and more absurd; petfood delivery dot com! No business plan, no logistical plan, no sector expertise, no experience of any kind, just; \"dot com, give me money\".", "score": 2, "replies": []}, {"body": "I still don't understand how that is possible.", "score": 2, "replies": []}, {"body": "If you multiple multiply their EPS, it's pretty high.", "score": 1, "replies": []}]}]}, {"body": "The scooter curve has inverted", "score": 105, "replies": []}, {"body": "We have reached peak economy when people need the help of scooters to move their large gluttonous bodies around congested cities during work hours.", "score": 22, "replies": [{"body": "Wall E in it's infancy", "score": 6, "replies": []}]}, {"body": "OMG I remember people scooting in the office all the time around 2000", "score": 41, "replies": [{"body": "As stupid as it sounds when I was in elementary school in 2004-2008 it was really a trend for people to drive scooters. It might sound dumb but I think op is right. This is the new scooters thing and the crash will happen in 4 years max. I hope it comes sooner but we'll never know.", "score": 19, "replies": [{"body": "You were in elementary school between 2004 - 08?! \n\n&#x200B;\n\nI need to stop reading this sub", "score": 68, "replies": [{"body": "So they're 20. Are you really that triggered that 20 year olds share the internet with you?", "score": 19, "replies": [{"body": "Yes, THE POST WAS FOR OLD PEOPLE FOR CHRISTS SAKE!", "score": 68, "replies": [{"body": "Some Millenials are grandparents now. #Triggered", "score": 15, "replies": []}]}, {"body": "It has nothing to do with being upset about 20 year olds on the internet.  It's that people who were in elementary school in 2008 are not permitted to be 20 years old.", "score": 19, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The only way for a Gen Z dude to retire in a timely fashion is to start investing now", "score": 4, "replies": []}]}]}, {"body": "I entered elementary in 2006", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "At least you have more money to trade than me, I can only do 10k.", "score": 2, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Most people from bookend generations around millenials don't understand how financially fucked we got. What a difference 10 years makes. The first 5 years of my career was frought with layoffs and employment gaps that forced me liquidate 401ks to pay important bills and all my student loans defaulted. It's been fun.", "score": 3, "replies": []}, {"body": "Pssshhh...  I invested in high risk oil wells and when I finally had some success, I sold those for a fraction of their worth and moved to Colorado to grow and sell medical marijuana. \n\n Obviously, I am losing any profits on FDs and oil futures...", "score": 2, "replies": []}, {"body": "): I’m sorry to hear all that tbh. But yo fuck what you did in the past. The crazy thing is, as long as you’re living, you still have time to be the person you want to be. Both you and I can learn and become better than we were yesterday. \n\nI lost hundreds of dollars trading $1,000 at 15 years old. I ended at $300 (at 18 years old) before quitting stocks and just wage cucking it for a year and smiling at people who would tell me to go fuck myself even if I was breaking my back to help them. \n\nI wage cucked to about 6.5k, and just started aggressively using everything I’ve learned with the new leverage I had, and these days I regularly wake up with an extra $200 in my account now. I could buy my mom an Apple Watch for Mother’s Day. I could buy a 4K monitor. I could buy a new Radeon 7 Lisa Su edition. I could remodel my bedroom. I could afford Supreme clothes. I was frugal for a year while everyone else was being retarded, and now people sit in shock watching how I do nothing and magically have $1000 every month to blow (not that I will, I’m still frugal af).\n\nI urge you to learn from yourself and improve yourself and also vote Bernie too so things don’t get worse for you lol.", "score": 2, "replies": []}]}]}, {"body": "Entered in 86?  Ha. Graduated in 82.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Scooters - they are more important than any presidential tweet or the Fed!", "score": 16, "replies": []}, {"body": "So there’s hope for my autistic SPY 272 puts?", "score": 9, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Bruh, wtf. If someone bought SPY puts to 245 I'd be afraid they'd have plans to set off a nuke in NYC", "score": 21, "replies": [{"body": "Tbf it would have taken a lot less than a nuke in NYC when I bought these puts", "score": 3, "replies": [{"body": "Fair enough. \n\nShould have sold though. Every time you look at your options you should think \"would I buy this today\" and if the answer is no, you sell that shit fast.", "score": 6, "replies": [{"body": "Even though i would buy the 245s, this is one of the wisest fuckin things ive ever read around here.   Too bad i wont remember it by the time pre-market rolls back around.", "score": 3, "replies": [{"body": "Dabbing on yourself not being able to remember Friday from Monday, lol\n\nBut, yeah. I learned that by losing a lot of money", "score": 1, "replies": []}]}]}, {"body": "Like... A plane?", "score": 1, "replies": [{"body": "Like a bird or a blank tweet from trump", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "SPY is overbought right now anyway. We'll see...", "score": 3, "replies": []}]}]}]}, {"body": "After they expire.", "score": 1, "replies": []}]}, {"body": "Google trends back this up: https://trends.google.com/trends/explore?date=all&geo=US&q=Scooter\n\nLast time interest in scooters was this high was jan 1 2008...", "score": 7, "replies": []}, {"body": "I’m old and have a Segway minipro.  For real lazy people cause you just lean.  Fucking love the thing.", "score": 6, "replies": []}, {"body": "Nokia is also looking like a reasonable buy which should concern everybody", "score": 6, "replies": [{"body": "Nokia is going to print money by the end of the year.", "score": 2, "replies": []}]}, {"body": "my god its real \n\narticle from May 2000:\n\nhttps://www.wsj.com/articles/SB958698918555324718?mod=searchresults&page=1&pos=3\n\nhttps://www.microkickboard.com/micro-downtown", "score": 11, "replies": [{"body": "yep.\n\nRemember the 1990 recession?\n\n[https://www.nytimes.com/1990/07/28/style/consumer-s-world-scooters-increase-and-so-do-state-laws.html](https://www.nytimes.com/1990/07/28/style/consumer-s-world-scooters-increase-and-so-do-state-laws.html)", "score": 3, "replies": []}]}, {"body": "I saw a lot of people that had no business riding those in 2000 in NYC", "score": 5, "replies": []}, {"body": "Some new electric motor scooters company (sit down kind) got introduced here in nyc. I see them all over.   Basically you can just hop and go. Im not gonna lie, i wanted to hop and ride that thing . I literally saw a guy go right up one with his app and unlock a helmet and press the green button and just ride. Pretty slick imo and i definitely want to try it.  Cars are not the dominant means of transportation in many cities it makes sense that there be more alternative source of transportation. I could see it, but idk what valuation shoudl be, and if they can maintain profits and could be hazardous ....", "score": 6, "replies": []}, {"body": "Yea but you bought that scooter with allowance money, not rented with allowance money. \n\nWebvan is the indicator", "score": 4, "replies": []}, {"body": "I like the pets.com/chewy.com analogy better", "score": 4, "replies": []}, {"body": "Remember when Yahoo had a higher evaluation that the entire Kiwi stock market, fellow Boomer.", "score": 2, "replies": []}, {"body": "You're late by like 3 years with this scooter thing.", "score": 1, "replies": []}, {"body": "Well get off my lawn!", "score": 1, "replies": []}, {"body": "How old are you, daddy?", "score": 1, "replies": []}, {"body": "What fucking ghost town do you live in? That shit has been around so long south park made an episode on it 2 seasons ago.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "those unions made pretty good deals for the boomers. High School drop out could buy a house and feed a family without the wife working.", "score": 10, "replies": [{"body": "My favorite thing in the world is when someone from the greatest generation starts to complain about millenials and how all they want is free stuff... OH yeah free stuff eh? How did you get your first house again? Oh the GI bill ok...", "score": 2, "replies": [{"body": "Technically the GI bill wasn't free.", "score": 1, "replies": []}]}]}]}]}
