{"title": "Call Options", "selftext": "I have very little capital ~$1000 so if I bought a $AAPL call contract for $.5 do I need the capital to buy the shares? If I only sell the option contract do I still need to purchase the shares? Also if the option expires do I only lose the $.5 per contract or the stock? I will be buying vertical options. Not on WSB YOLO amount yet.", "id": "3q3rg6", "created_utc": 1445739203.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 11, "comments": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Additionally, you can also protect yourself from the stock going down and your call becoming worthless, by also buying a put that will allow you to make profit as long as the stock price goes up or down and doesn't stay stagnate. This strategy is called a straddle if both put and call have identical strike prices, or a strangle if they have different strike prices.", "score": 1, "replies": [{"body": "So the most money you could lose is the price of contracts i.e max loss? ", "score": 1, "replies": [{"body": "Yes whenever you buy an option...your max loss is the price for that option. Selling option is another different story.", "score": 1, "replies": [{"body": "So after I buy a call and the stock's price is greater than the break even price with 50% profit when I sell I get the profit, but what do you selling an option is more difficult. So it isn't just buy and sell whenever? ", "score": 1, "replies": [{"body": "70%+ of options expire worthless, so there are very compelling reasons to sell options. Add on top of that the option spread, theta decay, and commissions, there are many obstacles to just buying options. \n\nMany hedge funds sell options. They are the Geico, state farm, and Allstate on wallstreet equities. It's dangerous because of tailed end risks or black swan events, so option sellers will make steadily over time but will have to make a big pay out once in a while...like Geico does for car claims. Basically, you assume the risk of a big loss 30% of the time to win 70% of the time.", "score": 1, "replies": [{"body": "Should I be looking at Tier 1 or Tier 2 if I have low capital and want to trade verticals. \n\n Tier 1 – Covered\nWrite covered calls;\nwrite cash–secured puts\n\n Tier 2 – Standard Cash\nPurchase options\nWrite covered calls\nWrite cash–secured puts", "score": 1, "replies": [{"body": "Tier 2 - use optionshouse and you will be approved immediately!", "score": 1, "replies": []}]}]}, {"body": "Dude. Investopedia", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Not necessarily true. I've had many times where my naked puts didn't get exercised on expiration when it was up to 20 cents in the money. It just highly depends on the person who bought your contract. From my experience, majority of the time up to 50 cents in the money you should be safe from exercise. Also I only sell options 2 to 3 days before expiration.", "score": -1, "replies": []}]}]}]}]}, {"body": "$AAPL | Ask:119.17 | PctChange:+3.10% | YearRange:92.00 - 134.54 | MktCap:679.08B | PERatio:13.77  \n", "score": 1, "replies": []}, {"body": "lol How did you get options approved then?", "score": -1, "replies": []}]}
{"title": "Bet half of the farm on a correction this week", "selftext": "[deleted]", "id": "3q5l0z", "created_utc": 1445785374.0, "score": 17, "upvote_ratio": 0.91, "num_comments": 15, "comments": [{"body": "Well if my strategy of always being 100% wrong 100% of the time every time continues to be perfectly effective at destroying all of the money I will ever have - then you're going to have a stellar week :)", "score": 17, "replies": []}, {"body": "You gonna get rekt lol", "score": 34, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I'm just dicking around. I'm not convinced enough we'll see a small pullback to actually get puts but it certainly could happen with the crazy end of last week. Best of luck with it", "score": 2, "replies": []}, {"body": "Why wait for the open?  Watch the futures right now: http://www.investing.com/indices/us-spx-500-futures", "score": 1, "replies": []}]}, {"body": "isn't the bearish case the us budget bill, treasury authorization? or is that a few weeks out still", "score": 2, "replies": []}]}, {"body": "your yacht / portfolio\nhttp://i.ytimg.com/vi/o1XrWfBL8kI/hqdefault.jpg", "score": 7, "replies": []}, {"body": "earnings have been pretty badass bro, yeah oil and related services sucks, but energy/metals/commodities declining is literally good for everyone else so lol you make bad decisions", "score": 6, "replies": [{"body": "I was going to say the same thing. Lot of earnings reports next week, and the ones so far have been pretty positive.", "score": 2, "replies": [{"body": "Aren't basic material more keyed into demand then finished goods? So the slow down hits them first then filters through. I mean the global slow down case is what kept/ and will keep our interest rates low. ", "score": 1, "replies": []}]}, {"body": "Very thoughtful analysis, thanks.", "score": 1, "replies": []}]}, {"body": "Please post an update on Friday", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Stochastic oscillator has been around 95 for the past 5 days or so; could be nothing but at the same time adds to the prospect of a (possibly small) correction coming.", "score": 1, "replies": []}, {"body": "yeah none of that has mattered ever since the central banks buy everything.", "score": 0, "replies": []}]}, {"body": "Newbie here. \n\nFrom what I've been learning about technical indicators, it seems that $spy $f $ge are all over bought according to the charts from stockcharts.com. Shouldn't that mean that, at some point soon, we should be expecting a correction?  Analyst are recommending people buy $spy $f $ge. Am I missing something? Lol thanks ", "score": 2, "replies": [{"body": "That is what overbought RSI's would indicate... But the case OP is making is more macro than technical ", "score": 2, "replies": []}]}]}
