{"title": "How is Dropbox still not being crushed by the competition?", "selftext": "Since google, Microsoft, apple, Amazon and slew of other huge companies and medium companies offering cloud consumer services, how is Dropbox like the little engine that could? \n\nThe stock keeps rising. People still seem to use it and be happy with it, including myself, but how does it still stay up there? Does other services suck that much?  Does Dropbox offer something others don’t? My guess is not trying to “get you” in their ecosystem but other apps offer bundled service etc. \n\nIs Dropbox still viable for the future or the mega tech will eventually knock Dropbox out?\n\nhttps://www.morningstar.com/stocks/dropbox-earnings-solid-revenue-margins-amid-tough-macroenvironment-maintain-valuation", "id": "16b3wn8", "created_utc": 1693956343.0, "score": 197, "upvote_ratio": 0.88, "num_comments": 100, "comments": [{"body": "Entire company focused on one thing versus giant conglomerate's side project usually ends up as a better experience/product/service for the end user. Same reason companies like Snowflake and Databricks can make billions despite Microsoft, Google and Amazon offering the same thing.", "score": 311, "replies": [{"body": "Yup, Dropbox is always there not trying to get you into a social universe recommending you to share your spreadsheets and pdfs with your friends.", "score": 165, "replies": [{"body": "The whole reason Dropbox became so successful in the beginning was the social engineering aspect, they got you to refer all your friends and each friend who signed up gave you like 500MB bonus storage for free.", "score": 123, "replies": [{"body": "They also had much more free storage back then. I’m still having 8GB, despite nowadays 2GB limit. And I’m pretty sure I never invited that many people, rather none.", "score": 26, "replies": [{"body": "I have free 30GB, mostly acquired from Dropbox sponsored hackathons where they give you like 5GB for trying to use their API", "score": 11, "replies": [{"body": "I have free 8 GB from my university days as well. There was a UC competition but I forget for what.", "score": 5, "replies": [{"body": "I have not used Dropbox in years, but you made me go look to see how much space I have since I remember participating in those quests to get more space!\n\n4.13 GB of 12.84 GB used!", "score": 3, "replies": [{"body": "Having all those GB on the cloud during those days was a godsend. I'm talking 2011\\~2012. It was infinite space for school work.", "score": 4, "replies": []}]}, {"body": "competition to see who can go for 48 hours with the least amount of sleep and come out with a semi-functioning website/app", "score": 1, "replies": []}]}]}]}, {"body": "The best part was the referral didn’t have to be linked through email or anything, it was a simple URL. So I ran a Google AdWords campaign for something like $20 bucks and I’ve had 25gb free ever since.", "score": 4, "replies": []}]}, {"body": "Lol, but that's the exact direction Dropbox is heading to.\n\nThey want to be a collaboration tool instead of just a simple backup folder.", "score": 14, "replies": [{"body": "They have really impressive user growth\n\n[Dropbox News Release](https://dropbox.gcs-web.com/news-releases/news-release-details/dropbox-announces-second-quarter-fiscal-2022-results)  \n\n\n>Paying users ended at 17.37 million, as compared to 16.14 million for the same period last year. Average revenue per paying user was $133.34 , as compared to $133.15 for the same period last year.\n\nSo their Average user is paying $11 which suggests they make the bulk of their money from the cheapest plan. I wonder how they're acquiring a million paying customers per year.", "score": 3, "replies": [{"body": "My business uses Dropbox and we pay about £550 a year for the privilege. I wouldn’t use anything else and as a business once you’ve got something that works for everyone involved you don’t really want to switch unless there’s an issue. I’d imagine a lot of their clientele are businesses.", "score": 3, "replies": []}]}]}, {"body": "The place I work at is changing from Dropbox to Microsoft offerings... I don't think it's gonna be good.", "score": 1, "replies": []}]}, {"body": "Mega nz does the same thing but with 10x the storage while still being free though", "score": 29, "replies": [{"body": "Mega has a terrible reputation", "score": 26, "replies": []}, {"body": "The kim dotcom thing? The one who were all the customer data got impounded and never released? Yeah makes sense they can't sell their service, no one wants to get their shit impounded by a foreign government.", "score": 34, "replies": [{"body": "Mega is a different company than MegaUpload, which has yet to go to trial.\n\nIMO the fact that the US government hasn't even been able to get Kim DotCom extradited in over 10 years since seizing MegaUpload shows just how weak that case probably is.", "score": 13, "replies": []}]}, {"body": "I have been using iDrive and it gives traditional backups and file sharing. The file sharing is not as good as Dropbox but the cost is much less and when I signed on I got 10tb. I think they are offering 8tb now but the first year is like 5$. I tried it out and realized I don't need Dropbox anymore.", "score": 7, "replies": []}, {"body": "Mega NZ isn’t being used by businesses.", "score": 6, "replies": []}]}, {"body": "Has search become better in db? The reason we use google Drive .", "score": 3, "replies": []}, {"body": "Who told you snowflake is making billions? They’re losing money haha.", "score": 2, "replies": [{"body": "Talking about revenue", "score": 2, "replies": []}]}, {"body": "Microsoft apple and google are highly glorified software companies which are more business than utility. \nTheir bad design and general incompetence is mind boggling compared to some other alternatives.", "score": -4, "replies": []}, {"body": "You saying Dropbox is good?", "score": 1, "replies": []}, {"body": "Databricks and Snowflake offer a pretty unique sweet of features (eg Databricks delta tables, mosaic ML features, acid txs, etc) that can be launched on AWS or another cloud platform in minutes. I don't think there is FAANG version of these products including all those range of features, or are you talking about something else that's sort of similar?", "score": 1, "replies": []}]}, {"body": "They pay no dividend despite having a finished product and the stock has been static for 5 years now. What's the point in investing in Dropbox?", "score": 134, "replies": [{"body": "Absolutely none.\n\nTo discuss such a hopeless stock is just laughable, company barely makes a profit 17 years after being founded.", "score": 91, "replies": [{"body": "It was overvalued before. It's reasonably valued now. Not saying it's the best investment in the world, but if they can maintain profitability there's no reason to think it would underperform from here.\n\nI think people sometimes forget a company doesn't need to be growing for their stock price to go up. DBX is trading at around 13x cashflows, just returning that to shareholders with no growth would result in a \\~7.5% annual return. But they are growing...\n\nThat's pretty reasonable if you compare it to something like AAPL where even if they used all of their current cashflows on stock buy backs you'd only get an annual return of 3.5% – and AAPL has almost no growth.", "score": 3, "replies": []}]}, {"body": "Got in pre-ipo and lost my ass. Sold at $24 finally but still these pre-ipo investment ops are rigged by the big players while retail got crushed. It's not up. It's not even back to IPO levels. Maybe it will finally do something for someone, but I thought it had a decent moat back then. Surely not now", "score": 17, "replies": []}, {"body": "They buy back stock 150mm a quarter, offsetting the 75mm SBC so net 300mm buybacks a year or 3%", "score": 4, "replies": []}, {"body": "As someone that lives in a country without capital gains tax. While there is a dividend tax. Dividend make no sense for people in my country, and thus many other countries as well.", "score": 3, "replies": [{"body": "Dubai?", "score": 1, "replies": [{"body": "The Netherlands :) although there is a wealth tax.", "score": 5, "replies": []}]}, {"body": "Cool but I can't stare at my stocks all my life or just watch their price go up or down, it's pointless to own a business that doesn't pay dividends, what's the point of it? If tomorrow you can't trade your stock or nobody wants to buy it what do I do with it?", "score": 1, "replies": []}]}]}, {"body": "It is a little comical how slow steady this company is growing top and bottom line. I barely changes but there is no volatility to their income.", "score": 26, "replies": []}, {"body": "Pretty simple, they’re platform agnostic so they can reach everyone. Dropbox works with just about anything, affordable, and pretty easy to use. They stay in their lane instead of trying to create new product lines that nobody wants and they make a proper profit while doing so.", "score": 52, "replies": [{"body": "So does Google Drive though", "score": 14, "replies": [{"body": "Well I had an 12yo iPad in the drawer that I wanted to use to read PDFs. All google services weren’t available and their browser version said “I wasn’t supported”, but downloaded Dropbox and works very fast", "score": 8, "replies": []}, {"body": "[deleted]", "score": -17, "replies": [{"body": "Bad take", "score": 8, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "That has nothing to do with “google selling your data”. And btw every major cloud provider has Soc 2 audits along with ISO and fedramp. Plenty of major banks, telecom, healthcare, and govt agencies host their data infrastructure with gcp. And often times those tools that are banned from use within enterprises aren’t due to those tools lacking security. More often than not it’s because their security teams don’t have the bandwidth or incentive to review and approve security for vendors they aren’t under contract with and then by default ban their use. If I’m a head of infosec and my BI team has a contract with Power BI/MSFT, why would I voluntarily go through months of a security review process for Tableau/Salesforce? \n\nYou’re conflating a lot of things that aren’t related - “google selling your data” very specific security policies within individual entities, and why people choose Dropbox over Google drive. I work in cloud with major highly regulated enterprise clients so think twice before you accuse me of not knowing what I’m talking about. See here if you don’t believe me: https://www.defense.gov/News/Releases/Release/Article/3239378/department-of-defense-announces-joint-warfighting-cloud-capability-procurement/", "score": 8, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "Ironically everything spewing out of your mouth is something anyone can Google. \n\nhttps://services.google.com/fh/files/misc/google-workspace-encryption-wp.pdf\n\nhttps://workspace.google.com/blog/product-announcements/gmail-and-calendar-client-side-encryption\n\nYou realize Verizon and countless other major enterprises with strict security standards are on gmail  and workspace? You should be fired if you’re a lead architect", "score": 11, "replies": []}]}]}]}]}, {"body": "Downvoted u for ur funny edit", "score": 2, "replies": []}, {"body": "Who gives a shit. People will generally go for whatever is more convenient or cheaper.", "score": 1, "replies": []}, {"body": "Room temp IQ", "score": 1, "replies": []}, {"body": "People don’t really care about that tbh. Not enough to make a marketable difference anyways.", "score": 0, "replies": []}, {"body": "Google cloud and google ads are different business units with strict rules on data sharing. Google isn’t doing anything with your data that every other tech giant isn’t.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Wrong. The DoD which you repeatedly site has approved intragency procurement for all three major cloud providers as part of JEDI/JWCC: https://www.techtarget.com/searchcloudcomputing/news/252528168/Amazon-Google-Microsoft-Oracle-win-JWCC-cloud-contract", "score": 1, "replies": []}]}]}]}]}, {"body": "Yep. Our family has Windows, Mac, and Linux users, and the family Dropbox account just works across all three, and has done for a very long time. Google Drive might work also, but why switch when we're all happy and the cost isn't too exorbitant?", "score": 2, "replies": []}, {"body": "Mega is on everything as well, with 50gb free", "score": 1, "replies": []}]}, {"body": "I feel like dropbox is easier for people who don't have dropbox. It took me just a couple minutes to figure out how to use it and I can send secure yet sharable links that will even play music right out of the file in high def... \n\nIs there anything else that does that? If there is it's not well advertised.", "score": 23, "replies": [{"body": "Dropbox has killed this feature in a recent update unless the receiver is also signed into an account. Tried sending files this weekend and person didn’t want to sign up.", "score": 11, "replies": [{"body": "If that’s true I’ll be dropping my account - and we pay $100 a month.", "score": -1, "replies": []}]}]}, {"body": "Dropbox was my first ever cloud storage sign up.\n\nBut for the last 8/10 years I've just been stuck on full storage of 2GB. \n\nI use google now.", "score": 5, "replies": []}, {"body": "Tbey are losing money and getting crushed, right?", "score": 3, "replies": []}, {"body": "Easy. The other sucks doing what dropbox does. \n\nAlso, I can keep my dropbox separate from the rest of my profile/personal uses.", "score": 9, "replies": [{"body": "Whatcha hiding", "score": 4, "replies": []}]}, {"body": "I like how easy it is to integrate. I can immediately access files from my pc on my iPhone. I can use apps to scan documents into it. I can attach to email from my phone or computer or iPad or any other electronic device. I use my Dropbox every single day. I couldn’t function without it. The pricing is reasonable. The functionality is great and switching to another service is way too much effort", "score": 3, "replies": []}, {"body": "The UI is simple and clean, and streamlined across multiple platforms. I like to use it even for transferring photos that I just took from my phone onto my desktop PC. I love how well Dropbox integrates with the File Explorer.\n\nI just wish the \"free storage\" was a bit larger but I make do.", "score": 3, "replies": []}, {"body": "Every time they tell me I'm at risk of losing my free gigs.   Free user since the start.   I move more files to Google drive.   Pathetic company.  Never gave them a dime so who is?", "score": 5, "replies": []}, {"body": "Dropbox has some of the best engineering culture and smartest engineers I’ve ever encountered", "score": 14, "replies": [{"body": "lmao you should encounter the engineers at stripe or citadel. also dropbox down 15% since ipo c'mon now", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Woah!!! That’s awesome", "score": 1, "replies": []}]}]}, {"body": "Laughable.  The entire tech stack could currently be written in a weekend.", "score": -25, "replies": [{"body": "You couldn’t replicate their ML codebase if you had 10 lifetimes", "score": 7, "replies": [{"body": "[removed]", "score": -11, "replies": [{"body": "You’re clearly unfamiliar with the tech industry and technology in general, I’m not going to waste my time with this", "score": 11, "replies": []}, {"body": "Trolling, insults, or harassment, especially in posts requesting advice, is not tolerated.  Please try to keep discussions on /r/stocks civil by providing straightforward responses without including any insults or harassment.\n\nContinual abuse of /r/stocks rule #5 regarding trolling, insulting and harassment will result in your account being banned.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 2, "replies": []}]}]}]}]}, {"body": "Half of you are missing the critical parts in the approval workflows that Dropbox provides. Lol idiots", "score": 2, "replies": []}, {"body": "Google drive is confusing as hell to share links. I still don’t know if it’s private or public", "score": 2, "replies": []}, {"body": "Dropbox is great, works automatically, is easy to use and it’s fast. $100 a year for 2 TB. And I prefer my pets files stay in their vault as opposed to one of the big data collectors.", "score": 4, "replies": []}, {"body": "I fucking hate Dropbox. Everytime one of my clients shares media files on Dropbox, I cringe. What a terrible UX.", "score": 5, "replies": [{"body": "Their UX is so terrible that, as dumb as it may be, I won't use them because of it.", "score": 1, "replies": [{"body": "I completely agree, and the only time I use it is when someone sends me a Dropbox.", "score": 1, "replies": []}]}]}, {"body": "Dropbox been around a long time, people are used to it. Also most don't care about privacy etc. Used Drobox for years. Been paying for it for a while. I won't renew this year.  I have never really trusted their security and always encrypted files before putting them there. Now use Cryptomator which makes everything nice but still. I still do not really have a whole lot of trust in Dropbox.  \n\n\nI also have Proton mail which gives me 500gb of secure e2e encrypted storage along with VPN and other stuff.  \n\n\nAlso came to the realization that everything doesn't need to be synced to the cloud and available 24/7. Just more stuff that can be compromised. Also better privacy with places like Proton or even iDrive which offers traditional backups as well as file sync at a fraction of the cost and more storage (it is a bit slow on the uploads). Which is pretty much where I have wound up. Using iDrive for traditional daily backups and using Proton Drive for file transfers and sharing.   \n\n\nBye Dropbox.", "score": 4, "replies": []}, {"body": "Tech?\n\nDropbox?\n\nWhen have you heard of Tech companies with single digit profit margins?\n\nDropbox is an internet company, that's been around for roughly 2 decades and barely makes a profit.\n\n\"Pure play\" companies with zero IP are extremely easy to kill, just take a look how Facebook attempted a Twitter-cide with zero repercussions.", "score": 4, "replies": []}, {"body": "It’s a great product but people also underestimate the marketing value of a catchy name. What the heck is a “one drive”?! No one knows. Just like no one knew what an “Xbox one” was. \n\nWith Dropbox, the name does 90% of the work in describing the product.", "score": 1, "replies": []}, {"body": "My Client is using this garbage sometimes it would take me 3 to 4 days just download a 7gig file, my net speed is 5mbps but somehow it will stop midway or at 88% the problem is there lousy server doesn't accept reconnect request from either the browser or IDM so you need to redownload it and sometime it could happen 3 to 10 times sometimes I need to try 10-20 times just to finish downloading. The only reasoon it is still afloat is its dirt cheap but the experience I have with dropbox is as worse as what I feel with Adobe softwares Like if ever I encounter a dropbox employee I'd just punch him in the f\\*ce to vent out my frustration.", "score": 1, "replies": []}, {"body": "It sucks so bad. And I'm convinced it's deliberately set up to get more and more money out of its users. Like, why is so hard to delete things and free up space? I'm just trying to delete some image files right now, and you'd think I was trying solve a hieroglyphic riddle to escape the mummy's tomb. Absolutely useless. And it has been this way FOR YEARS. Christ only knows why every company I've ever worked with insists on using it.", "score": 1, "replies": []}, {"body": "Ohhh it is trust me. Dropbox is nearing unusability, and the people there don't give 2 shits. ", "score": 1, "replies": []}, {"body": "Every day, part of their Millions of legacy users are filling up their dropbox and converting to paid subs ?", "score": 0, "replies": []}, {"body": "Garbage product (for video anyway)", "score": 1, "replies": []}, {"body": "From an It technicians point of view we migrate people away from Dropbox at their request very regularly at the moment and it’s usually because they prefer the Microsoft licence packages as a whole rather then just the cloud storage and it ends up being a bit cheaper for some clients with large amounts of data.", "score": 1, "replies": [{"body": "I used db some time ago and then MS offered 3eur subscription per month (via mobile operator) for o365 licence and 1tb onedrive for up to 5 devices. There is literally no reason for me to use anything else.", "score": 1, "replies": []}]}, {"body": "maybe the tooling to migrate isn't there yet and people just keep paying because migrating is a hassle. Their user retention stats might be great", "score": 1, "replies": []}, {"body": "I use Dropbox and have about 2 terabytes of storage for $10 a month. It's so worth it to me  excuse I can back everything up and not worry about losing anything", "score": 1, "replies": []}, {"body": "I use Dropbox instead of the competitors. My company laptop won’t let me share onedrive links outside the company. I was able to install Dropbox without needing it permission.", "score": 1, "replies": []}, {"body": "Moved to MEGA years ago, 20GB free, end to end encrypted private storage, client on every platform. It's better in every way", "score": 1, "replies": []}, {"body": "I think competitors are starting to crop up - check out BLZE. Not as many sharing features, but a godsend for media professionals backing up data. Up 50% the past two weeks too.", "score": 1, "replies": []}, {"body": "I‘m a paying Dropbox user since the early days. In my opinion it is still a great solution 👍. It also works fine with a personal and 👔business account at the same time and on the same devices. It does exactly what it should while being almost invisible. And that‘s its biggest plus. 🚀💪", "score": 1, "replies": []}, {"body": "Over 50Tb on Dropbox in one volume. Stays in sync. New install of DB re-syncs  in 3 days on M1 Mac mini! Fully supports MacOS metadata, OS tags, permissions including ACLs, Flexible online/offline files and control over what syncs and what stays on the cloud.\n\nDropbox is better for me and my business than our previous usages of Google Drive and MS drives. It's also cheap for the storage even compared to AWS when you get to enterprise licensing.", "score": 1, "replies": []}, {"body": "“Your company is a feature…not a product”", "score": 1, "replies": []}, {"body": "As a user I use them because I have yet to see a breach. And because they upload/download fast, and they don't demand me to log into my social media accounts. \n\nAnd they're reliable.", "score": 1, "replies": []}, {"body": "I don't get it, maybe there focus is purely enterprise. Microsoft Family is 100 a year w 1TB of storage for each member up to 6.", "score": 1, "replies": []}]}
