{"title": "Tesla price cuts made possible by battery costs plunge as it decimates automaker margins and worker salaries", "selftext": "I'm a little concerned about these price cuts.  Seems like JACC nowadays.", "id": "16b56zu", "created_utc": 1693959609.0, "score": 157, "upvote_ratio": 0.84, "num_comments": 103, "comments": [{"body": "This is wonderful news.", "score": 13, "replies": [{"body": "While it’s unfortunate to know I could have saved money waiting a few more months to buy the car, it’s great to hope batteries will be significantly less expensive if and when they need to be replaced", "score": 4, "replies": [{"body": "Don’t forget it just killed your cars value. 15K of value gone over night. Unless you got X or s and then it’s 40k", "score": 1, "replies": [{"body": "Keep seeing this but who sells their car 6 months of purchase. Most still after or near the warranty existing and by then the depreciation settles down to roughly the same. It didn’t mean your car is not worth $40k let’s 5 years from now; it just means yes 1 depreciation is alot  more steep.", "score": 7, "replies": [{"body": "And no dealer will take your car as a trade-in.", "score": 1, "replies": []}, {"body": "Not everyone keeps a car for 5 years. Id love to have traded mine at year 3.", "score": 1, "replies": [{"body": "Tons of people trade cars in within a year or two. Not me personally, but used lots always have recent cars. Some of those will be repos, probably a lot more will be Teslas soon with the massive depreciation/price cuts.", "score": 1, "replies": []}, {"body": "If people like to throw away money for a nicer car every 3 yrs for a tesla, maybe 15k drop shouldn’t make a dent to your budget enough to matter.", "score": 1, "replies": [{"body": "The idea is you aren't throwing away money. I figured you picked up on that.", "score": 1, "replies": []}]}]}, {"body": "Probably doesn’t happen a lot but I know someone that bought a Tesla while waiting for their R1T to ship and they were convinced it would appreciate or flat line in value. Spoiler, it did not.", "score": 1, "replies": [{"body": "> they were convinced it would appreciate\n\nYou lose a good percentage just driving it off the lot.  This guy is delusional.", "score": 0, "replies": [{"body": "He believed what Elon said lol", "score": 2, "replies": []}]}]}, {"body": "Haha I tried to sell my Y after 7 months.  When they dropped the price on the X but I’m too poor hahaha.", "score": 1, "replies": []}, {"body": "Even after 5 years its worth a lot less than it wouldn't if there wasnt a price drop. \n\nin January 2022 a Model X at 121k and is now 80k. \n\nUsing arbitrary estimated numbers:\n\nSo in 2027 if a Model X remain at 80k then:\n\n2026 model will be worth 65k\n\n2025 model will be worth 58k\n\n2024 model will be worth 52k\n\n2023 model will be worth 47k\n\n2022 model will be worth 43k.  \n\n\nTotal loss for January buyer is 78k for 5 years.\n\nIf the Model X price remained at 121k then:\n\n2026 model will be worth 103k\n\n2025 model will be worth 93k\n\n2024 model will be worth 85k\n\n2023 model will be worth 77k\n\n2022 model will be worth 70k\n\n&#x200B;\n\nTotal loss of 51k. Difference is 27k. Almost the price of a new model 3 after tax rebates. \n\nMy numbers aren't accurate but just showing a quick example.\n\n&#x200B;\n\nThe price drop affects even the model 3 and y on the used market. Now someone might be willing to buy a 2 year old Model X instead of a new model Y.", "score": 1, "replies": []}, {"body": "Better hope you don’t get in to an accident and insurance totals the car out, because there’ll be a new book value for the car based on the price cuts, and you could end up underwater between what gets paid out and what is owed.", "score": 1, "replies": [{"body": "That is what gap insurance is for, I'm pretty sure if you have it then you are covered.", "score": 1, "replies": [{"body": "Sure. \n\nNow you’ve gotta add gap insurance to your policy because your car is worth less than you owe on it now though.\n\nIt’s a nice double-whammy: you get to pay more for insurance, and your car is simultaneously worth less. Nice!", "score": 1, "replies": []}]}]}]}, {"body": "Cars are not an investment", "score": 5, "replies": [{"body": "What!!?? You mean my M3 is not an appreciating asset ? Who woulda known!!! They dont tell you this in Econ 101!! /s", "score": 3, "replies": [{"body": "Right? I usually smash some windows and shit just so my non-tesla drops 25% overnight. Get that devaluing out the way early!", "score": 1, "replies": []}, {"body": "Funny enough - Elon told people it was going to be an appreciating asset because of robotaxis", "score": 1, "replies": []}, {"body": "I don’t think your M3 lost 30k in value essentially overnight", "score": 1, "replies": []}]}, {"body": "people are blinded by greed like mofo, property shouldn't be an investment either since it's a living necessity", "score": 0, "replies": [{"body": "When has property not been an investment?", "score": 1, "replies": [{"body": "for some it is, for some it isn't.  Is sure as hell was not for me", "score": 1, "replies": [{"body": "If the value the asset increased it’s an investment even if you had no intention for it to be", "score": 1, "replies": []}]}]}]}, {"body": "No, but trade in values do matter.", "score": -2, "replies": [{"body": "But trade in value is never guaranteed for any car.", "score": 1, "replies": [{"body": "Certain cars maintain their trade in values with enough confidence that one can make an INITIAL purchase decision based on the fact that in a few years, your existing car will absolutely contribute to you moving up to a newer model.  No \"guarantee\" but if that market dynamic breaks down, you'll hear about it.\n\nTesla does not have that.  Effectively you're trade in is zero.  Thus you're initial decision needs to be pretty much, \"this is a total write-off\".  Run your [DCF](https://www.investopedia.com/terms/d/dcf.asp) based on that (i.e., Tesla's NEED to be cheaper because they don't hold value).", "score": 0, "replies": []}]}]}, {"body": "Lost value is expected but not 25% in the first couple months.", "score": -2, "replies": []}, {"body": "Thank you RamboTrucker, id imagine you were greatly impacted by this.", "score": 1, "replies": []}]}, {"body": "maybe you shouldn't use a living necessity ( at least in USA) as an investment vehicle", "score": 1, "replies": [{"body": "But it’s not and no one is, reducing depreciation is not an investment.", "score": 1, "replies": [{"body": "if you need a car to drive from a to b, then you buy a car and drive from a to b, why worry about lost value? Everything is kind ftup right now so best to sit on the sidelines and wait for things to stabilize....", "score": 1, "replies": [{"body": "Why worry about it? Because you can sell or trade it in and recoup some of your money", "score": 1, "replies": [{"body": "I mean if you have 40/50k to drop on a Tesla and you already are thinking about selling it 6 months later maybe you should research the car a bit more before buing one?", "score": 1, "replies": [{"body": "Yeah but that doesn’t change the fact  that they are concerned about the trade in value…. And understanding depreciation does not equate to using a care as an investment.", "score": 1, "replies": [{"body": "The market fluctuates, there may be a \" shortage \" of parts next month and prices go back up...they are speculating the worth of their cars...when I buy a car I keep it for 10 years min, buy a house...I keep it long term...I am not worried about the prices. because I need those things to live. Those folks just have too much time on their hands and obsess over the value of their stuff", "score": 1, "replies": [{"body": "Yeah, people seeming have different ways of operating. But not caring at all about the future value of your car or home implies that you are able to afford to not care.", "score": 1, "replies": [{"body": "I just live within my means, people want the newest and shiniest things, I did mention my car is 10 years old no? People can't sacrifice and care wayyyy too much what they drive and how big their house is so let them worry about the values of their necessities, glad I don't", "score": 1, "replies": []}]}]}]}, {"body": "Who said they're concerned about 6 months? People who owned one for years just lost 25% OVERNIGHT. \n\nStay on topic or at least in reality.", "score": 1, "replies": [{"body": "did they really? Well should have bought a Toyota mine worth more than I bought it for..", "score": 1, "replies": [{"body": "Toyota with the Midus Touch lol I cant say I feel bad because youre right, they definitely took on risk with that high price of a vehicle and Elon behind it. But Dayum its like a kick to the balls.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Why does your car need value AFTER you buy it? Cars depreciate soon as u drive off the lot. Unless you’re in the used car sales business, what does it matter?", "score": 1, "replies": [{"body": "You must not care about your financial welfare. I can’t sit here and have a conversation with an idiot.", "score": 1, "replies": [{"body": "Huh? How do you come to that conclusion from my comment? Lol. And I’m an idiot? Again, lol", "score": 1, "replies": []}]}, {"body": "Are you implying people should be happy they potentially lost out on ten of thousands of dollars just by waiting a few months???\n\n🤔", "score": 1, "replies": [{"body": "It's that what you pulled from my comment? No they shouldn't be happy. But how mad can ya get when u go in expecting to spend 40kon s Tesla and drive it off lot for $38 after negotiations. Your happy then right?  Yes it sucks if it sells cheaper right after you buy, but is it going to make you so wanting Tesla's?", "score": 1, "replies": []}]}]}, {"body": "Meh. I’m fine with it if it gets more EVs on the road and makes a better planet for my son. Now let’s get better recycling of the cars.", "score": 1, "replies": [{"body": "I don’t think EVs are gonna make the planet better. Everything has a cost. It is what it is. Your child will be ok. Don’t fall into them scare tactics the media portrays.", "score": 1, "replies": [{"body": "I disagree. Our science shows they overwhelmingly have an impact on emissions. The part that gets really crazy is China an authoritarian government that can basically do whatever the fuck it wants also believes the science. That’s when I really started to believe they might make a difference.", "score": 1, "replies": [{"body": "That’s fine if you disagree. I’m not worried about it.", "score": 1, "replies": []}]}]}]}, {"body": "Cars are bought for utility not investment.", "score": 1, "replies": [{"body": "Holding its value and going down slightly over time is normal. Losing 15k-40k in 3 months is not.", "score": 1, "replies": []}]}, {"body": "Also buying a Tesla now is a risk.  Why buy today when it could be cheaper in 6 months.  deflation in action.", "score": 1, "replies": []}]}, {"body": "Yes and no. Did you buy your car cash? If you did, then yes. If you didn't, the new high interest rates are compensating for the fall in price.", "score": 1, "replies": [{"body": "I paid cash.", "score": 1, "replies": []}]}]}]}, {"body": "\"Tesla price cuts made possible by battery costs plunge as it decimates automaker margins and worker salaries\"\n\nThis title implies that Tesla employees had their salaries cut? However, the article itself doesn't state that. It suggests that some suppliers had their margins under pressure. This results in a softening hiring of new employees.", "score": 7, "replies": [{"body": "This post omits the word Chinese from the title of the article and uses “automakers” in place of “Chinese automakers”.\n\nThis error (or omission)makes the title seem like it’s bad news for Tesla when in fact it’s bad news for other companies.", "score": 3, "replies": []}]}, {"body": "It decimated them. That’s a 10% reduction.", "score": 4, "replies": [{"body": "My newspaper has ads from car dealerships where almost every car has been decimated in price. Sometimes you can even get the employee discount. I’m worried.", "score": 1, "replies": []}]}, {"body": "The title makes no sense. Tesla can lower prices because the batteries have gotten cheaper. That does not mean profits are down.", "score": 4, "replies": []}, {"body": "Misleading post… try again", "score": 3, "replies": []}, {"body": "Tesla is becoming the office printer of the auto industry. Sell the initial product inexpensively then tie the consumer into proprietary repairs and insurance. Plus, they price control charging at Tesla charge stations. Since traditional dealerships won't accept Teslas on trade, they control trade-in value as well. \n\nTesla is disrupting the auto industry, unfortunately the disruption is not consumer friendly in the long run.", "score": 2, "replies": [{"body": "Why don't dealers buy them on trade? I was not aware this was a common practice.", "score": 1, "replies": []}]}, {"body": "Any chance Tesla will reduce the price of replacement battery packs?  2012-4 Model S batteries cost about the same as a car", "score": 2, "replies": []}, {"body": "Just bought a Y a few months ago. Thanks?", "score": 2, "replies": []}, {"body": "These garbage cars with their dangerous blinding headlights are everywhere. Why are the feds allowing them on the streets?", "score": 2, "replies": []}, {"body": "So underpaying people is the secret…", "score": -4, "replies": [{"body": "Yeah.... Capitalism yay", "score": -2, "replies": [{"body": "don’t like it? you *can* work somewhere else.\n\nthat’s the beauty of capitalism. nobody is making workers stay if they don’t like the conditions", "score": 0, "replies": [{"body": "Listen, pal.  I'm a 1%'er, so I don't need your advice.  I eat out when I want, house is almost halfway paid off, 3 cars etc.  Go impart your wisdom to someone who can gain something from it..", "score": 1, "replies": [{"body": "sounds like you’re soaking up a lot of benefits for someone who just said “Capitslism… yay” lmao", "score": 1, "replies": [{"body": "It's a solid life.  I pay my people well.", "score": 1, "replies": [{"body": "So does Tesla…they are some of the highest paid workers in the industry. The article was referring to Chinese EV automakers in regards to worker pay and profit margin decimation.\n\nWhy would you be worried about the price cuts if they benefit American companies, American consumers, etc?", "score": 1, "replies": [{"body": "They start at $18/hr in Austin.  Read up.", "score": 1, "replies": []}]}]}]}]}, {"body": "The beauty of capitalism is you get to bribe the government for policies that favor your business and screw over your workers and other citizens.", "score": 1, "replies": []}]}]}]}, {"body": "Tesla's COGS declined by 1% while their prices declined by 16% and its going to get worse in the 2H as they have too much inventory already which will be exacerbated by the CEO outing himself as a nazi.", "score": -1, "replies": [{"body": "Too much inventory is the real answer.  There are so many more competitors to Tesla now that Tesla has to respond with a pricing adjustment.  Lithium supply is going down.  Batteries are going to become more expensive.", "score": -1, "replies": [{"body": "Incorrect.  Tesla only has 16 days of inventory.  That’s the lowest in the industry.", "score": 3, "replies": [{"body": "Why are they dropping the price then?  Low demand?  You don’t drop the price this much if there was high demand at that price point.  Simple economics.", "score": 1, "replies": [{"body": "You stated the inventory was high.\nThat is false.\n\nTHE END", "score": 2, "replies": [{"body": "the inventory is low for a traditional automaker, but for tesla it’s pretty damn high. i used to rarely see “existing inventory” on the website at all, but now they have a lot of different cars, in basically every config, all discounted", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That makes no sense.  Not even a little.  If it is cheaper to build and they can keep the same price point, why wouldn’t they take the opportunity to increase their profit margins?  That makes zero sense.  Absolutely none.", "score": 1, "replies": [{"body": "increased competition and tesla wants to make moves to stay ahead of their position as the best value EV on the market?\n\nis that really that hard to understand?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "well, they’re planning on making the model 2 outside the U.S., which would mean it wouldn’t qualify for the credit unless some special exemptions were made.\n\n$25k without a credit is still nuts if they can actually do it though", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "they talked about it in an investor call earlier this year or last, can’t remember.\n[made in mexico](https://en.m.wikipedia.org/wiki/Gigafactory_Mexico)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "yeah i’m sure they’re optimizing their process to make the most sense for consumers looking to buy - battery one would make sense for sure", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Lol, umkay, sure.  “Trust me bro” doesn’t go very far with me.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Good thing they don’t care about profit margins.  👍", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Why do other companies offer 0.9% financing or thousands in incentives? It’s all the same dude", "score": 1, "replies": [{"body": "No.  It isn’t.", "score": 1, "replies": []}]}, {"body": "1) This article is only about China. So it doesn't affect anywhere that doesn't get their Tesla / battery from China.\n\n2) The updated Model 3 was just announced. The old model of any car will always drop in price when an update is released, so they can clear out the inventory of the old version to make room for the new version.\n\n3) In 2021, and 2022, new and used car prices were MASSIVELY INFLATED due to chip shortage etc. It was always expected that the prices would come back down.", "score": 1, "replies": []}]}]}, {"body": "that's what people said about oil every decade for the past 50 years as well. There are always new innovations that will fill a slowing supply of lithium", "score": 1, "replies": [{"body": "Right, just ignore it then….  It will fix itself.", "score": 1, "replies": [{"body": "i mean, these LFP batteries are basically infinitely recyclable, if they ever even end up going bad in the first place. i’m really not worried about “lithium shortages” as we have enough easily accessible lithium in this country to support the entire world’s demand for EVs", "score": 1, "replies": [{"body": "Sounds like you have it all figured out.  👍", "score": 1, "replies": [{"body": "i didn’t figure any of it out, that’s all battery chemists in the last 20 years. really going to solve most of these potential future problems around lithium storage", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "No stonk no cars\n\nWho will buying a new car with 50%+ loss in stock market from ATH.\n\nSalaries? Tesla workers need skyrocketed TSLA instead of money", "score": 1, "replies": []}, {"body": "Tesla started a MARKETSHARE war by planning annual 50% production increases for this decade.\n\nTesla would have very happily not started a price war were they able to grow deliveries 50% annually to move all of that production with the old prices.\n\nSo it’s inaccurate to say Tesla started a price war recently because of lower costs.\n\nThe actual war for marketshare has been going on since GigaShanghai, Berlin and Austin were built with gigantic production capacities.  Tesla’s low costs are what gave them the confidence to plan that large of production because they knew they could adjust prices if necessary.\n\nTesla does not cut prices because costs reduce.  Tesla SETS prices such that incoming order flow roughly matches near term production goals.  That keeps the order book at about 2-4 weeks.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "They pay like $18 an hour in Austin....", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "Oh no, not dealer margins!!!", "score": 1, "replies": []}]}
