{"title": "[deleted by user]", "selftext": "[removed]", "id": "167dxpe", "created_utc": 1693590478.0, "score": 344, "upvote_ratio": 0.95, "num_comments": 126, "comments": [{"body": "See you next month Space Cowboy", "score": 155, "replies": [{"body": "Watch me go down to 0😂", "score": 62, "replies": [{"body": "Pretty sure taking screen shots and post shit like this is the last sign before your fall. Be careful homie!", "score": 45, "replies": [{"body": "Yup, I’m aware, seen too much accounts blown up here, and just stir things up a bit.", "score": 5, "replies": [{"body": "It looks like you have found a strategy or something that works for you, DO NOT CHANGE IT 👍  Also, stay off WSB..", "score": 7, "replies": [{"body": "Yeah, too many money chaser degenerates😂", "score": 1, "replies": []}]}]}, {"body": "Yep... but it's cool to be a statistic.", "score": 1, "replies": []}]}, {"body": "Hope you don’t", "score": 5, "replies": []}]}, {"body": "Wheee", "score": 1, "replies": []}]}, {"body": ",Turn that 30k into 3 million, Wise trader,", "score": 61, "replies": []}, {"body": "Show me the way master", "score": 20, "replies": [{"body": "(Ain’t master since this is just a trend line for a month, not years)\n\nDiscipline, perspective of money, and time.\n\nDiscipline can be simplified into the psychology of when to sell your holdings.\n\nPerspective of money can be explained as how much is too much, how much is too little, and how much is enough.\n\nTime is when do you enter the position, do you have other evidences that backed up your decision other than just pure guesses and emotions.", "score": 3, "replies": [{"body": "You said a lot of nothing bro.", "score": 172, "replies": [{"body": "Different people will get different take aways, so it is something but not nothing😂", "score": -38, "replies": [{"body": "[removed]", "score": 38, "replies": [{"body": "It's like entrepreneurs who leave the most fucking useless suggestions for how to start a business", "score": 14, "replies": []}, {"body": "Agreed, but don't come into this sub expecting anything more substantive.\n\nSuper smart people have spent billions trying to have fool proof way to make money in markets. So far, the only ones to consistently do it is citadel buying flow from robin hood and front-running all your idiot day traders", "score": 6, "replies": []}, {"body": "It's like those people that sell courses on investing and starting a business. Like wow? \"I knew that already\" or \"that much is obvious\"", "score": 3, "replies": []}]}]}]}, {"body": "0DTEs and discipline don’t fit in the same sentence. Shutup and post an update in a few months regard.", "score": 30, "replies": []}, {"body": "That's a lot of words to explain having really good luck", "score": 12, "replies": []}, {"body": "The best advice I have received ! Thank yiu sensei", "score": 1, "replies": []}, {"body": "One of us is jumping off this balcony.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I think I’m fine.", "score": 0, "replies": []}]}]}]}, {"body": ">I think you're doing a great job! Keep up the good work!", "score": 50, "replies": [{"body": "this is not visual mod wtf happen to visual mod", "score": 35, "replies": []}, {"body": "No vm, he is poor and stupid.", "score": 7, "replies": []}]}, {"body": "Up $30k to 10k lmao", "score": 43, "replies": [{"body": "Cuz I cashed out👀", "score": 42, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "“Never Cash Out”\n\nSome people just want to spend and get pleasure, not take it to the grave.", "score": 23, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Cool so you spent the money and now you have none left and you are 23. Now what", "score": -3, "replies": [{"body": "23? Damn how can you ever recover at the old age of 23?  Omg he spent 30gs at 23 and will die poor now. I mean 23 is so close to death", "score": 11, "replies": [{"body": "Disregard, didn’t realize it was WSB, forgot its full of regards here.", "score": -7, "replies": [{"body": "Did you look in the mirror and remember?", "score": 3, "replies": [{"body": "Cute, whatever makes you feel better.", "score": 1, "replies": [{"body": "Calling yourself cute to your mirror self will probably not make you feel better.", "score": 1, "replies": [{"body": "Speak for yourself.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "How do you make money being a bear? That's incredible really", "score": 7, "replies": [{"body": "Stairs up elevator down", "score": 9, "replies": []}, {"body": "August was a bear month except for the last week Lol", "score": 1, "replies": []}]}, {"body": "Good to see no odte SPX those killed me this year lol", "score": 5, "replies": [{"body": "I will switch to Thinkorswim for no purchase limit for contracts once my buying power goes up and go for SPX eventually - less time decay in the premiums. But yeah, risk management need to be online, 0DTE with SPX is a big amount.", "score": 5, "replies": []}, {"body": "Why? I like to day trade those to cut down on trading fees  \nTrading SPY I often have to buy 250 contracts.", "score": 3, "replies": [{"body": "I get greedy and averaged down and blow up.  Did it 3 times this year.  $15k losses total.  I Need to learn how to trade the odte SPX", "score": 3, "replies": [{"body": "Oh yeah controlling those emotions with 0dte is incredibly difficult.   \nGet addicted to protecting your money instead of seeking a home run and someday that account will be a home run. Good luck!", "score": 4, "replies": [{"body": "I did this last year and lost over 100k. Learned my lesson kinda..", "score": 2, "replies": []}, {"body": "I do a few days out now because of my experience too", "score": 2, "replies": []}]}]}]}]}, {"body": "Nice work. Make sure you show us the red graph after you lose it all next month", "score": 6, "replies": [{"body": "Yes sir", "score": 5, "replies": []}]}, {"body": "Strategy? Or how many trades per week or day?", "score": 4, "replies": [{"body": "Usually everyday, this week for example I skipped Tuesday, and played spy at Monday + Wednesday. Played Tesla at Thursday, 240p for next week, sold today. Entered nvda put at 10:18am this morning, sold at 10:56. Yesterday to today gained 2.5k.", "score": 7, "replies": [{"body": "What reason are you using to join these trades?", "score": 2, "replies": [{"body": "News event + technical analysis. I make shorts due to various market conditions, but one thing that didn’t change is I always short when it’s overbought, or it is on a down trend, but market decides to buy, then I short.\n\nOr when it hits the resistance, then I short. If it’s going towards support, I sell before it gets there.", "score": 8, "replies": []}]}]}]}, {"body": "!remindme 30 days", "score": 4, "replies": []}, {"body": "I trade the same way! Up 30% this year trading and I don’t know how to buy a call", "score": 3, "replies": [{"body": "Finally a comrade, a fellow day trader🙆‍♂️", "score": 2, "replies": []}]}, {"body": "Open a discord group, sell memberships, i will be the first one, sir!", "score": 2, "replies": []}, {"body": "👏", "score": 2, "replies": []}, {"body": "Nice looks like you got decent control of stop loses, be sure to update when you're back at zero", "score": 2, "replies": []}, {"body": "Can someone educate me on what the hell a 0DTE is and how do i buy them I want to become a degenerate", "score": 2, "replies": [{"body": "For Robinhood, go to setting, investing, scroll to the bottom, and click option settings, enable trade on exportation day.\n\nWelcome onboard, captain. Watch out for entry and not paying for the premium. Remember this: if you can’t profit from a $1000 account, then there is no way that you will be able to manage a $100,000 account. Profit is profit, don’t get greedy.", "score": 1, "replies": [{"body": "What is the ticker for 0DTE spy options", "score": 0, "replies": []}, {"body": "Is robinhood good?", "score": 1, "replies": [{"body": "I'm not a fan of Robinhood.", "score": 2, "replies": []}, {"body": "Good for small accounts, easier to make trades as beginners. Thinkorswim is the more advanced platform. Webull has good looking charts, but NEVER put your money inside their platform.", "score": 1, "replies": [{"body": "Why not?", "score": 1, "replies": []}, {"body": "Why not webull?", "score": 1, "replies": [{"body": "Their institution is not completely American, and personally (among some others) does not trust to give money to agencies that is not entirely American.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This is what mine looked like before it didn’t", "score": 2, "replies": []}, {"body": "You buying slightly OTM? How much are you dropping on each of these trades typically ?", "score": 2, "replies": [{"body": "10-30% of my buying power. When I felt the market is way overbought, and I felt super bearish, I go all in with a stop loss of 20%. I don’t do stop loss on small purchases.", "score": 1, "replies": [{"body": ">OTM\n\nCan you tell how far OTM do you buy normally?", "score": 1, "replies": [{"body": "Usually I buy at the less crowded puts where the price is around $0.40 per contract, which is less premium and will get rewarded big once market drops. So it’s not OTM really, usually it’s around the resistance level.", "score": 3, "replies": []}]}]}]}, {"body": "Great! I'm thinking of applying the same strategy. What did you do on low range days to keep on making money?", "score": 2, "replies": [{"body": "Normally I don’t trade when volume is super super low, but for SPY when volume is low, it usually go sideways or goes up, barely goes down. When it’s overbought + bond + dollar signaled for economy is still bad, I’ll go in for short.", "score": 2, "replies": []}]}, {"body": "Hey you pulled some money out!\n\nCongrats!!!", "score": 2, "replies": [{"body": "Alright did👍 this 10k was made from 1k of leftovers.", "score": 1, "replies": [{"body": "Damn right!!!", "score": 1, "replies": []}, {"body": "How did you do it! How many trades?", "score": 1, "replies": [{"body": "For every bump you saw on the trend line, that’s how many trades I have did, around 10-13 trades throughout this 20 day period.", "score": 2, "replies": [{"body": "You must have a cash account??", "score": 1, "replies": [{"body": "Yeah I use cash account. I can repeat my trades, that’s all I need.", "score": 2, "replies": []}]}]}, {"body": "How I traded it? You can DM me.", "score": 1, "replies": [{"body": "Will DM you. Thank you", "score": 1, "replies": []}]}]}]}]}, {"body": "Good job bruh \nKeep it up don’t want to see you around here anymore with us degenerates make something of yourself.", "score": 2, "replies": []}, {"body": "See you at $0 next month", "score": 2, "replies": []}, {"body": "Your actually a liar that’s crazy", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|7 months ago\n**Total Comments**|66|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 2, "replies": []}, {"body": "Double down. 0DTEs only results in gains.", "score": 2, "replies": []}, {"body": "You sick duck. Congrats.", "score": 1, "replies": []}, {"body": "The screenshot is such a photoshop so obvious based on pixels hahaha", "score": -3, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "What is your strategy. Teach me !!!!", "score": 1, "replies": [{"body": "RSI + MACD + EMA + volume + news event. That’s basically what I use, and sell on time (not sell at the bottom, sell while it’s going down)", "score": 3, "replies": [{"body": "What time frame?", "score": 1, "replies": []}]}]}, {"body": "What was your initial investment?", "score": 1, "replies": [{"body": "After I cashed out at august 10 ish, I had 1k left. Then worked the way up here.", "score": 3, "replies": []}]}, {"body": "What is 0DTE? Asking for a friend.", "score": 1, "replies": [{"body": "an option that expires that day", "score": 3, "replies": [{"body": "I’m kind of new. Is it 100 contracts per?", "score": -3, "replies": []}]}]}, {"body": "  \n.Discipline, money sense and time sense.  \n.Discipline can be simplified as the psychology of when to sell your holdings.  \n.The money perspective can be explained as how much is too much, how much is too little, .and how much is enough.  \n.Time is whether you have evidence other than pure speculation and emotion to support your .decision when you enter the position.", "score": 1, "replies": []}, {"body": "Man pulled some of his bread out, not one of us", "score": 1, "replies": []}, {"body": "Bro what did u buy options on ?", "score": 1, "replies": []}, {"body": "How do you do these ODTE?", "score": 1, "replies": [{"body": "Buy at the right moment with the signals I got from the indicators I followed, and sell asap when it’s in my favor. Don’t try to maximize profit, take it when it is on your side.", "score": 3, "replies": []}]}, {"body": "Are you selling or buying 0 dte options", "score": 1, "replies": [{"body": "Buys 0DTE puts, and sells the ones I bought.", "score": 1, "replies": []}]}, {"body": "Whats the indicator or signal that you look for most when buying puts?", "score": 1, "replies": [{"body": "RSI, MACD, EMA, bond market, and dollar market. Once all of these 5 indicators agreed to one another, and the market is volatile around the resistance level, then that’s the moment I go in.", "score": 1, "replies": [{"body": "So you look for SPY downtrend or crossover on macd, rsi, and EMA. Plus bond market and USD going up?", "score": 1, "replies": [{"body": "Bond market down, dollar up. And the rest yes. But I suspect this week will be a chop week, unless we have other form of news. The best thing to do is nothing, unless the indicator pointed something out, and do a quick trade.", "score": 1, "replies": [{"body": "Why bond market down? Wouldn't it be inversely correlated to stocks? I would think that bonds are considered a safety net...or is cash the safety net?", "score": 1, "replies": [{"body": "The key is when equity market is going up while bond market going down in a high interest rate environment, often equity market will catch up to where the bond is signaling. The moment bond goes up while stock goes down, the put premium in the contracts are already expensive.\n\nI make plays before bond goes green, so that’s why I can execute 0DTE fairly quickly.", "score": 1, "replies": [{"body": "Makes sense. Is there an index fund you use to track the bond market? Or do you just look at the 10 year Treasury or something?", "score": 1, "replies": [{"body": "SHY for short term, which is policy sensitive. Then TLT, which is the major one.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Can we see the 1 day loss next week?", "score": 1, "replies": [{"body": "My plan is to not play anything for Tuesday, and play the post CPI day. Will see if it goes red or not👀", "score": 2, "replies": []}]}, {"body": "Looks like we use the same indicators except volume. How to you factor volume into your decisions? I haven't tried 0DTE but they look fun, I wanna give it a shot.", "score": 1, "replies": [{"body": "I factor volume as how active the market will be today. If volume is high, fueled with other indicators, things can be one directional instead of side ways. Sometimes low volume can lead to short term bullishness as well.", "score": 2, "replies": []}]}, {"body": "What timeframe do you usually use? 5m, 30m, hourly?", "score": 1, "replies": []}, {"body": "Here we go again…*unzip pants*![img](emote|t5_2th52|4260)", "score": 1, "replies": []}]}
