{"title": "$AAPL could fall below $100 - analyst", "selftext": "", "id": "zy4bzk", "created_utc": 1672317181.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 8, "comments": [{"body": "I'm an analyst and I say it can go above $500 in 2023. Saying something \"could\" happen is such a cop out.\n\nDon't even click and give them the win on the clickbait.\n\nAnd they're not even wrong, AAPL could go down below $100. Earnings are going to be rough and markets overreact. AAPL is a historically great company and while there is a threat of them being the next GE, I think they'll be great long-term, but I don't have that much money where if they went to $0 my life would be significantly affected.\n\nJust don't be an idiot and over-leverage on a single stock (or in general), and make sure you have a 6 month emergency fund ready.", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Betting that the biggest company in the world will become eight times bigger than it already is seems like a rather insane thesis", "score": -2, "replies": [{"body": "Meanwhile they’ve already done these same sort of things over and over and over again…", "score": 0, "replies": []}]}]}]}, {"body": "Could.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Always a dead cat bounce from oversold, could still go lower.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Good luck with that.", "score": 2, "replies": []}]}]}]}, {"body": "Aapl going to $900 tomorrow I just know it", "score": 1, "replies": []}, {"body": "Apple could goto $1 and it could goto $1,000.00.", "score": 1, "replies": []}]}
{"title": "How are we expecting the Quarterly results to look?", "selftext": "Christmas? Supply problems? Inflation? I know Apple can spin the data any way they want but keen to hear opinions. I’m very long on this stock but might have to trim some of my holdings in Jan to cover some expenses. \n\nWeighing up selling now or waiting for results…", "id": "zyhhfv", "created_utc": 1672350374.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 12, "comments": [{"body": "The market is not rational when it comes to the Cupertino crew. Add the recent market turmoil and volatility and you’ve got a lot of uncertainty amplified. Depending on your situation you could borrow against your holdings and enter an options trade. Do an options straddle through the earnings, take your profits post earnings to pay your expenses. This has a lot of moving parts that can go against you but if you want stress, excitement and the thrill of living that James Bond, wolf of Wall Street lifestyle, here’s your chance.", "score": 5, "replies": [{"body": "Haha thank you! As I mentioned I’m super long in this game and am up, so I’ll sell a little soon. I’ve had enough drama for a while!", "score": 1, "replies": [{"body": "I understand selling to raise money but you could use the shares you own to purchase options. Take a look at the option strategy that allow you to profit regardless of the stock direction. Google ‘neutral option strategies’. You employ calls and puts to make money regardless the direction, post earnings. If your expiration date is well after earnings, you can ride through any market turbulence or craziness post earnings. It’s worth it to invest a couple hours of your time. I’d recommend NOT selling. Take a look at doing a straddle or iron condor. https://www.elearnmarkets.com/blog/5-best-neutral-options-strategies/\nHold on to your shares, be conservative but adventurous… 👊🏽👍", "score": 4, "replies": [{"body": "I'll second Juz.  I've learned to sell options (calls, since I'm long) and have made a good deal of income just from this.  There are a ton of strategies for different objectives but do look into them rather than selling outright.", "score": 2, "replies": [{"body": "Totally agree! Do not sell!", "score": 1, "replies": []}]}, {"body": "Thanks for this, I’ll take a look.", "score": 1, "replies": [{"body": "Yep! keep your dividend compounding… there’s a strong case for not selling any shares.", "score": 1, "replies": []}]}]}]}]}, {"body": "Just got back from purchasing an Apple Watch series 8 from the Union Square Apple Store in San Francisco. It was packed and I ended up having to wait 15 minutes to get a chance to buy from a rep. Qualitative observation for sure, but seeing high-end products literally flying off the shelf makes me think AAPL is going to be just fine.", "score": 2, "replies": [{"body": "When have they not been, just fine. In fact you may have to go back to CEO Gil Amelio in the mid 90’s for actual drama. Since our Man Jobs returned to the helm, the Cupertino crew have rocked!😎 Market perception has been the recurring issue.", "score": 2, "replies": []}]}, {"body": "I believe it will be a bloodbath \n\nLong term this year don’t expect much\n\nSplit adjusted the shares may retreat to 2019 prices as the stim juicing is gone the economy is worse than 2019 and now we have inflation recession which we didn’t in 2019.  My logic is sound \n\nMy calls for this year were pretty good crushing numbers and making calls.  I expect mid to high 2 digits as the ‘23 low.  Spy I think retreats another 100 points to 275\n\nInvestors I think are going to have difficulty wrapping their minds around this until they realize and embrace much lower forward multiples. 5x not 10-20 x.  Great stock great product bad times skittish buyers including those with more disposable income.  \n\nThis bad news arc is not done by a long shot so keep your powder dry.  Investors don’t have to invest every week or even every month to be called investors.  Meanwhile park your in vesting cash in a liquid 4% acct\n\nAlso it is questionable when the fed overshoots and starts cutting and things get bad and government offers “some” stimulus that it will be a buyers party.  While it looks like inflation has peaked it is likely to spike one more time in 23 before deflation rips at things \n\n2023 looks like a year of hell.", "score": 1, "replies": []}, {"body": "When are they due ?", "score": 1, "replies": [{"body": "Last week of January.", "score": 2, "replies": []}]}]}
{"title": "Short auto-parts retailers as EV adoption increases?", "selftext": "Retailers like Autozone (AZO) and O-Reilly's (ORLY) are currently trading at nearly all-time highs.\n\nBetween declining overall market expectations, giants like Amazon trying to get into the space, bans on gas car sales, and rapidly increasing EV adoption, is anyone anticipating a pullback in these companies?  \n\nThoughts? \n\nAnd if one were to speculate on this, what would be your strategy? Was thinking perhaps 2025 LEAPS puts.", "id": "zygzbl", "created_utc": 1672349201.0, "score": 2, "upvote_ratio": 0.56, "num_comments": 10, "comments": [{"body": "Those places don’t sell as much engine parts in comparison to brakes and suspension, which electric cars still have. Not to mention people’s gas powered cars aren’t going anywhere", "score": 12, "replies": []}, {"body": "You probably haven't heard, but the word is that we're heading for a recession. Seeing that EVs are significantly more expensive than most used vehicles, I'm not so sure that it's time to short the auto parts suppliers just yet", "score": 8, "replies": []}, {"body": "My thought is that, at least for the next few months, ev adoption will slow as people choose to continue servicing the current cars they have instead of spending on a new ev. OEMs cranked up average selling prices the last few years and shrunk incentives. Incentives are slowly coming back, but with current rates and general market sentiment, I think new ev sales suffer.", "score": 5, "replies": []}, {"body": "People may hold on to their car for longer as they make spending cuts, so rather than buy a new car, try fix their old one and spend more money in auto parts stores. \n\nOr, they put off fixing their car completely, and spend no money in auto parts stores.\n\nCould go either way imo.\n\nThe second hand car market is falling, which indicates this portion of the population is already hit, and not looking to upgrade, but maybe stay with what they have for longer. This may actually be bullish for these companies. I'm not touching it though. \n\nAs someone already said, EVs still need auto parts, just not the engine bits.", "score": 5, "replies": []}, {"body": "EV = sub-5% of cars in America\n\nGas cars that need AZO and ORLY = 95% of Cars in America.", "score": 3, "replies": []}, {"body": "Yeah used car demand is super high right now. Some day shorting maybe, but not anytime soon. \n\nYouTube has made even the scariest car projects manageable for many too.", "score": 3, "replies": []}, {"body": "….to wait 2 years to gain absolutely nothing", "score": 1, "replies": []}, {"body": "AZO & ORLY have really reasonable P/E ratios ... just something to consider", "score": 1, "replies": []}, {"body": "You could be right over decades, but you can’t make an options play lasting that long. In the short term of 1-2 years I don’t see that play working out.", "score": 1, "replies": []}, {"body": "may not be a good idea just because it is too expensive - about $35,000 for 1 AZO 2500 2025/1 put", "score": 1, "replies": []}]}
{"title": "Southwest Airlines Co., a perfect SHORT in a bear market?", "selftext": "Recent cancellations have introduced every investor, trader, portfolio manager and speculator with the symbol of $LUV, the airline that has cancelled about 30% of its flights due to winter storm. More than 200 flights to and from Phoenix alone were canceled Tuesday, according to FlightAware. Nationwide, the airline axed 65% of its flights with similar cuts in the next few days. With advance notice, fewer passengers have reason to go to the airport.\n\nPositive aspect is that the airline, just in early December announced “reinstating its quarterly dividend after more than two years as the airline says it is confident that the travel recovery will continue next year.” Southwest suspended the payment early in the Covid-19 pandemic, when carriers were bleeding cash and weren’t sure when travelers would return. Southwest is the first major carrier to bring back its dividend, and will start making the payments of 18 cents a share—the same amount as before the pandemic—in January. The payout amounts to $428 million a year.", "id": "zxq7a8", "created_utc": 1672273774.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 18, "comments": [{"body": "Read about their point to point ops model last night. That combined with their policy of not having a ticket exchange with other carriers made them especially susceptible. I think decision to not follow the hub-and-spoke model in favor of point to point was supposed to be their edge over others but when it comes to weather, they’re the most vulnerable. \n\nRemains to be seen what happens to customer stickiness after this. That’s usually a feature, but it’s now become a big issue.", "score": 4, "replies": [{"body": "Thanks. Appreciate your valuable comments.", "score": 2, "replies": [{"body": "Article: https://www.nytimes.com/2022/12/28/travel/southwest-airlines-flight-cancellations.html?smid=nytcore-ios-share&referringSource=articleShare", "score": 2, "replies": [{"body": "Now it is weather and then recession, lack of credit (easy money) and higher joblessness (on job being afraid) and conscious spending may impact negatively along with very bad damage to the brand image due to winter storm. I am studying the company’s fillings but I have a feeling that I may end up shorting it.", "score": 2, "replies": [{"body": "I’m intrigued. Hasn’t crashed like most stocks, pe of 27x w forward pe of 10.3x. What’s your proposed timeframe for the short?", "score": 2, "replies": [{"body": "To be honest, I am not proposing short, I am actually asking here if this idea of shorting the stock makes sense. What better way is to analyze by democratizing the study of stocks and other securities?\n\nDisclosure: I have a small short position in the stock since May 2022.", "score": 1, "replies": [{"body": "Ah ok. Makes sense yep. Let me know if you end up opening anything!", "score": 2, "replies": [{"body": "I added a disclosure that I have a small short position in the stock since May 2022. However since December 7, I am studying and so far it feels a right choice to increase my position. I am seeing falling cashflows and mounting debt.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Well said. I think as far as customer stickiness they might be nearing an all time low….which imo was a large part of what kept them afloat", "score": 2, "replies": []}, {"body": "I think they don’t follow the hub and spoke model. That’s why they have the issue.", "score": 1, "replies": [{"body": "Whoops I got that flipped around. They follow the point to point model.", "score": 1, "replies": []}]}]}, {"body": "I don’t know about the perfect short but I do know it’s a pile of shit.", "score": 2, "replies": [{"body": "Me too", "score": 1, "replies": []}]}, {"body": "I think it's worth shorting for a number of reasons. In addition to those previously mentioned, it looks like China has largely given up efforts to contain the pandemic. More travel restrictions are a very real possibility. Consumer data indicates 2023 won't be a splurge year for vacations regardless, and Southwest's latest goof was big enough to sour people away from the brand, at least for awhile.\n\n\nEither the pandemic or coming unemployment surge will kill demand while the airlines' main costs of operation are not dropping proportionately. If both of those hit in tandem, I expect half the industry to end up in Chapter 11.", "score": 2, "replies": [{"body": "Can’t agree more. Love you.", "score": 2, "replies": []}]}, {"body": "I mean if you aren’t short or have open puts on LUV with the last few days of news. That on top of clear misguided leadership when it comes to possible “worst case” scenario…then you aren’t an “active” trader. \n\nSorry just saying this having had a decent last 3 weeks “playing” options.", "score": 1, "replies": [{"body": "I am certainly not an active trader. I am more like a tortoise when it come to trading in securities.", "score": 3, "replies": []}]}, {"body": "I know this isn’t what this thread is about but maybe consider shorting beyond meat or Carvana January will be rough for them", "score": 1, "replies": []}]}
{"title": "Milan: 50% of passengers on flights from China have COVID", "selftext": "Global bear market for 2023?", "id": "zxtshl", "created_utc": 1672282951.0, "score": 41, "upvote_ratio": 0.89, "num_comments": 15, "comments": [{"body": "Deja vu January 2020", "score": 11, "replies": [{"body": "Same story never goes twice, probably huge economic collapse is ahead", "score": 2, "replies": []}]}, {"body": "2023 here we come", "score": 11, "replies": []}, {"body": "This will make sure everyone stays positive 🤣", "score": 6, "replies": []}, {"body": "Trojan Planes!", "score": 6, "replies": []}, {"body": "Even without this, there is the same number of cases globally as at the end of 2020. Just no one cares anymore.\n\nsource: https://coronavirus.jhu.edu/map.html", "score": 3, "replies": [{"body": "The number is probably higher now, however hospitalizations and deaths are down in countries that had vaccinations that worked. Chinas problem was it used an old school method of vaccination, it didn’t work, and they had to wait to get the formula from the west to make their own second vaccine. Cases are up but severity is down, that’s a good thing.", "score": 2, "replies": []}]}, {"body": "Again what happens in milano stays in milano", "score": 3, "replies": []}, {"body": "How fun!", "score": 2, "replies": []}, {"body": "Oh no! Again!!!", "score": 2, "replies": []}, {"body": "Nobody is scared of Covid anymore. Maybe our immune system is now stronger than before again Covid .", "score": 1, "replies": []}, {"body": "Quick. Someone get Ackman his soapbox so he can tell us about hell is coming (again).", "score": 1, "replies": []}, {"body": "So are people going to admit covid 0 was never going to happen and we always had to learn to live with it?", "score": 1, "replies": [{"body": ">So are people going to admit covid 0 was never going to happen and we always had to learn to live with it?\n\nI thought the lockdowns were a good idea.\n\nAnd I also admired China's response (well, parts of it anyways).", "score": 1, "replies": []}]}]}
{"title": "Humble opinion 2: Four signs market may have bottomed", "selftext": "This follows my first humble opinion: \n\n[https://www.reddit.com/r/stocks/comments/zwiglo/humble\\_opinion\\_market\\_has\\_bottomed/](https://www.reddit.com/r/stocks/comments/zwiglo/humble_opinion_market_has_bottomed/)\n\nThe fact that it received so many down votes is a good sign. \n\nI maintained the same sentiment: \n\nBottoms reached for SPY and QQQ on 13 October 2022. \n\nBottoms reached means that the 52w low on 13 Oct 2022 will not be significantly breached.\n\nToday I present four more signs that market may have bottomed, using 2008 crash as a case study. All news articles listed here were published between February to March 2009, just before one of the largest bull market in history.\n\nSign #1: MSM tells you all hopes are lost. Here's an article suggestion to millennials it's better to become pirates (piracy is the only \"growth\" industry left). \n\n\"Forget Wall Street, You Can Be A Real Pirate\"\n\n[https://www.cnbc.com/id/29136882](https://www.cnbc.com/id/29136882)\n\nSign #2: The most hated guy in the market is trying to doom the economy (and you).\n\n\"Obama Declares War on Investors, Entrepreneurs, Businesses, And More\"\n\n[https://www.cnbc.com/id/29434104](https://www.cnbc.com/id/29434104)\n\nSign #2 (alternative): The most hated guy in the market said he is trying to help the economy (and you). Here's an example Obama was telling people to buy stocks literally just before the huge bull market.\n\n\"Obama: Buy stocks now\"\n\n[https://www.politico.com/story/2009/03/obama-buy-stocks-now-019567](https://www.politico.com/story/2009/03/obama-buy-stocks-now-019567)\n\nSign #3: The Big Boys finally succumbed to cutting jobs. Here's an example.\n\n\"Bloomberg L.P. Cuts 100 Jobs, a First for the Company\"\n\n[https://www.nytimes.com/2009/02/05/nyregion/05bloomberg.html](https://www.nytimes.com/2009/02/05/nyregion/05bloomberg.html)\n\nSign #4: The wrongest guy in the market gets called out in anger, except this time he's finally RIGHT. \n\n\"CNBC Jim Cramer Repetitive Bear Market Bottom Wrong Calls\"\n\n[http://www.marketoracle.co.uk/Article9369.html](http://www.marketoracle.co.uk/Article9369.html)\n\n&#x200B;\n\nFast forward to 2023, there are many similarities, but change the date, and change the most hated guy in the market to J Pow. The wrongest guy is still the same. \n\nHappy 2023 to you all!", "id": "zxydyz", "created_utc": 1672296330.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 12, "comments": [{"body": "The put to call ratio tells us we’ve reached a temporary bottom. But just the very fact that you posted this article tells me that a secular bottom probably hasn’t happened, you’re not excluded from your own contrarian indicators lol. \n\nWe’ve barely had a bear market, only some tech stocks have truly felt pain and in fact most are still up huge since the start of the pandemic.", "score": 10, "replies": [{"body": ">The put to call ratio tells us we’ve reached a temporary bottom\n\nDue to 0dte options that ratio is completely useless now sadly.", "score": 2, "replies": [{"body": "Yeah. Similar situation with VIX being useless now.", "score": 0, "replies": []}]}, {"body": "It's just bewildering to me that people thinking a handful of people on Reddit thinking a bottom might be in is somehow enough to influence the market.  There will always be people thinking we are at the bottom and there will always be people thinking we have further to fall.", "score": 2, "replies": []}, {"body": "While I cannot be 100% certain, but I do think that we're somewhere close to the bottom. There was another massive bubble where the play money was made and lost which was Crypto. So, the 20-21 stock bubble could have been smaller than the 08 bubble. It's all a prediction of course. I could be wrong. So, I am slowly DCAing my money again.", "score": 1, "replies": []}]}, {"body": "\"Many down votes is good sign\"...but many upvotes is also good sign?", "score": 6, "replies": []}, {"body": "Its just cherry picking something to base your wish upon, IMO.\n\nIt cannot stand against the serious macroeconomic situation that almost the whole world faces. Growing inflation, war in Europe, central banks continuing rates hikes, the isolation of Russia (the market of 150 mil people) for the coming decades, growing tensions with China...", "score": 5, "replies": []}, {"body": "I don't know how to balance the sky high pe ratios of large modestly growing companies. Walmart @41. Wm at 28. Costco. Ko. And so on.\n\nBut I do agree that some companies are becoming quite appealing bargains.", "score": 3, "replies": [{"body": "PE ratio can be misleading. Take WMT for example. TTM EPS at latest quarter is $3.23, but at previous quarter TTM EPS was $5.00. This is because latest quarterly EPS is negative. EPS always shrunk during market bottom, and shrunk EPS leads to high PE. When EPS goes back to normal, so will the TTM PE.", "score": 3, "replies": []}]}, {"body": "Not today satan, you won’t get me", "score": 2, "replies": []}, {"body": "No way. Now you hold apple stocks, you expect 1. Earnings to be bad 2. Fed to keep interest high. Why would you hold through 2023?", "score": 1, "replies": []}, {"body": "\"The fact that it received so many down votes is a good sign.\"\n\nThis logic, which I hear from perma-bull contrarians is the dumbest logic ever. Like because so many people are bearish, its all of a sudden going to short squeeze the $SPY to all time highs. Grow up Peter Pan.... Count Chocula! Markets dont work like that. Markets react to FED stimulus, Low rates, and economic optimism and we have the opposite of all of those.\n\n&#x200B;\n\nBut hey, feel free to keep fighting the Fed for as long as it takes to get wiser. Cheers", "score": 1, "replies": []}]}
{"title": "what if we get deflation?", "selftext": "I am generally of the opinion that the Fed really can do nothing  about deflation because every country that has tried rounds of QE can never escape. That said, the one thing it does seem to do is inflate the  hell out of equities. And the more ineffective the QE becomes the more  trashed in real and nominal terms become bonds and treasuries. Truly  worthwhile bonds begin to trade at such premiums you effectively lose  much of the ROI.  \nCommodities, including silver and gold, are an  alternative to treasuries, not stocks. Conservative portfolios will  always want that. And the zero return of gold is still better  than the negative returns you lock in with treasuries. I think just  sitting on stocks is the way to go with inflation. They have been barely  outpacing inflation over the past 10 years. Gold or silver only become  worthwhile when your currency is going to zero, and you want to leave  your country. Forget Zimbabwe, that was the case in both Venezuela and  Turkey.  But what if we get deflation?", "id": "zy5daw", "created_utc": 1672320356.0, "score": 0, "upvote_ratio": 0.37, "num_comments": 12, "comments": [{"body": ">But what if we get deflation?\n\nBonds would go insanely high and stocks would drop as earnings would be crushed.", "score": 12, "replies": []}, {"body": "Deflation would be catastrophic for equities", "score": 14, "replies": [{"body": "Not necessarily, when deflation happens and interest rates shift downward, investors may shift back to growth stocks", "score": 3, "replies": [{"body": "Earnings get crushed in a deflationary environment. When top lines shrink earnings fall dramatically due to operating leverage. You don’t have to have a whole lot of top line pressure for earnings to get crushed, depending on the company’s cost structure.", "score": 3, "replies": []}]}]}, {"body": "This kinda explains it the best lots of different examples https://en.m.wikipedia.org/wiki/Deflation#Historical_examples", "score": 4, "replies": []}, {"body": "I think we will get deflation. It will likely be super brief and be associated with a change of policy\n\nToo many purchases relative to supply chain is inflationary and an issue as more people buy worried that waiting will mean paying more\n\nDeflation causes people to wait and do nothing because they expect prices to fall. That is much worse. Cash must move and history shows deflation is followed with swift action", "score": 4, "replies": []}, {"body": "To be honest most countries that did QE did escape deflation. Only Japan didn't. And Japan has its own special circumstances: \n\n- A majority import country can't manipulate it's correct easily because it'll make imports more expensive\n\n- An aging population. Low birth rate. And choosing not to make up the difference with imkigration", "score": 6, "replies": []}, {"body": "I think u answered ur own question?", "score": 3, "replies": []}, {"body": "\"They have been barely outpacing inflation? I don't know what numbers you are looking at, but inflation has been 2.41% annualized from Jan 2012 to Dec 2022 while the S&P 500 has been 12.47% annualized in that same time frame. 10% real return is hardly what I would call \"barely outpacing inflation\"", "score": 3, "replies": []}, {"body": "\\> I am generally of the opinion that the Fed really can do nothing about deflation because every country that has tried rounds of QE can never escape\n\nBut this just isn't true. Lower rates and QE does stimulate economic activity which does result in higher demand. It pushes up asset prices too, but again higher asset prices will help stimulate economic activity.\n\nIf we get deflation then the Fed will probably be forced to pivot because unchecked deflation is even worse for the economy than inflation. If the Fed pivots aggressively stocks and bonds will likely rally. If they do a weak pivot then stocks will probably drop and bonds will do better.\n\nPrecious metals metals should preform well in an environment of negative real yields, but again this depends on what the Fed does. And another thing to consider here is that precious metals are often used as a source of liquidity in bear-markets so even if fundamentally they're attractive they may struggle to perform initially.\n\nIf you're worried about deflation your best bet is probably to buy bonds now, then rotate into other assets depending on how things play out.", "score": 4, "replies": []}, {"body": "Can't you just hand out stimulus checks until deflation is gone?", "score": 1, "replies": []}]}
{"title": "Predictions and Sectors to Watch Out for in 2023: Thoughts and Discussion", "selftext": "2022 has been tough for me as a rookie individual investor: so many uncertainties, fluctuations, and major policy shifts. I would like to humbly offer my thoughts on investment trends and sectors to watch out for in 2023.\n\n======\n\nMacro/Policy Trends\n\n\\-Fed must slow down rate hikes to rejuvenate the economy, but they will still have to tame inflation both for economic and for political reasons (I don’t believe in Fed neutrality anyway). Projection: the rate would top in summer-autumn 2023 and it would stay there for a while till Fed officials figure out what to do. A rate slash may not come until winter of 2023 or even early 2024 (coincidentally or not, to pave the political way for the next presidential election).\n\n\\-Russo-Ukraine war has exhausted both the Western powers and Russia, although it may have exhausted Russia more severely. The battlefront has largely been a stalemate since November, and there may not be any profound situational change until early Spring of 2023, when the weather and the terrain become suitable for large-scale actions again. Talks of peaceful resolution are circulating out there, but my projection is that neither side wants to settle quickly until the Spring 2023 actions produce a clearer view of situations. Hence, the geopolitical uncertainties of this war would linger for quite a while.\n\n\\-China’s U-turn of COVID lockdown policy, having been brewing for a while, still comes as a major surprise at the year’s end. However, although I do not condone the China-Imminent-Collapse view, I do not expect China to regain momentum soon. All the talks about supply chain relocation and investor cautions aside, the three-year lockdown (and especially the more draconian 18-month lockdown since mid-2021) has severely depleted China’s foreign reserve, rattled its consumption power and confidence, disrupted its labor force, and exposed its crippling weakness in social welfare provision. Even if China could power through the current wave of infection, it would still need some time to reset, restart, and contemplate what type of economic relations it wants with Western powers. What’s more, Xi Jinping has literally botched every grand strategic initiative since his second term starting in 2017-18: Belt and Road, hostility towards Western powers, indigenous high-tech development, ambition to bridge the domestic wealth gap, crackdown on tech and real estate sectors, Xinjiang/Uyghurs region, Hong Kong…. you name it. Now, the only major opportunity for him to garner some additional legitimacy for a fourth term and maintain the current surveillance state structure would be a war to invade/” reunite” Taiwan. With the COVID lockdown gone, his anxiety might cause him to take increasingly hostile moves against Taiwan, maybe even launch a preemptive (and hasty) strike soon. All in all, I do not expect much good news out of China and would refrain from investing heavily in its reopening/rejuvenation of the economy at least until winter of 2023.\n\n\\-Continuing the geopolitical trend, and finally as a wrap up, the major difficulty for me is to identify a geographical region exhibiting clear momentum of growth in 2023 that could inject new rigor into the world economy. Even amid the pandemic, China’s lockdown-and-keep-producing strategy allowed it to maintain decent economic growth in 2020; when China began to lose its steam in 2021, USA, Japan, and some major economic powers of South America as well as Europe began to walk out of pandemic lockdown and took over the banner for growth. But for 2023 it seems every major region in the world is grappling with their own economic difficulties and no one is ready to take the helm. Besides, the increasingly inward-looking mentality and security-based concerns might cause a new round of severance/reformulation of global economic connections. My view may be overly grim, but for me 2023 would continue to be a muddy, rough, and restructuring year.\n\n======\n\nSectors/Investment Options (Both Positive and Negative Views)\n\n\\-Energy/Clean Energy: With the Russo-Ukraine war still having no end in sight, global energy security continues to be an issue. Major powers will continue to spend strenuous efforts to secure only oil and gas resources, but also the pipeline carrying them. Talks about clean and alternative energy continue to thrive, but it appears the major concern is safeguarding more traditional options. I would probably maintain a 60-40 mix of traditional/fossil energy and clean/alternative energy.\n\n\\-Healthcare/Pharmaceutical: Another major sector I will be keeping an eye on. With COVID still raging in some parts of the world, vaccination/dedicated medicines still pose some opportunities. One interesting thing I would love to track is whether China would finally give up its “not losing face” stance and start importing foreign COVID vaccines (they rejected foreign mRNA vaccines but have begun importing medications in small amount). Even with COVID pandemic in rear mirror, global population continues to get older, and needs for combating new viruses/difficult diseases continue to exist. This is a long-term sector I will keep investing in.\n\n\\-Real Estate/Housing: With Fed rate hikes, house buying seem to have seceded from the 2021 frenzy. I plan to shift my focus on housing and housing-related real estates to alternative options such as warehouse and storage, tech data centers, and telecommunication infrastructures. With global travel recovering steadily, I may also look at some opportunities in hospitality real estate.\n\n\\-Tech: the majority of my loss this year comes from trying to identify “growth” stocks and catch up with market trends, only to be taught by the market to stop doing something I am just not good at. So, tuitions paid, and lessons learned. I plan to stay way for the first quarter of 2023 and only start investing in tech companies exhibiting good fundamentals later.\n\n\\-Food and Beverage: Like energy, food supplies are also strained due to geopolitical concerns, but contrary to energy, a raw material shortage is no great news for food and beverage businesses. With this amount of ambiguity, I would be extra careful in this sector trying to identify what companies could best weather through the supply shortage.\n\n\\-Precious Metal: Since 2018 I’ve been buying both physical gold and silver and ETFs of gold and silver. They may not be the best performing hedge or alternative investment options in 2022, but they are still some of the most easily accessible for individual investors like myself, and their price hike in the past few years also make up with some of my losses this year. I will keep regularly investing a dedicated amount of cash into precious metal.\n\n\\-Bonds/Debts: I have to say I am not knowledgeable in this sector. I do hold mixed bond ETFs (performing roughly the same as my entire portfolio), and I’ve heard recommendations on investment-grade bonds and municipal bonds (munies), but I did not do much homework on them. Any suggestions are welcome.\n\n\\-High-yield Savings Account: I put whatever emergency and surplus cash in several high-yield savings accounts, and they have been able to generate enough interests to cover at least my grocery spending every week. It’s always good to earn a few extra bucks on idle cash. Since I do not see a rate slash soon, I will keep saving into these accounts.\n\nYour critique and thoughts are warmly welcomed. Hope everyone has a fruitful 2023 in investment! Happy New Year in advance!", "id": "zybmqt", "created_utc": 1672336631.0, "score": 13, "upvote_ratio": 0.77, "num_comments": 14, "comments": [{"body": "I expect steadied rates and 2% inflation\n\nStocks up 20% at least from ending of tightening\n\nRussia loses most of strategic air force, Mariupol retaken, Crimea cut off, armistice by end of year, Crimea Ukraines. \n\nEnergy and tech up 50% from now by end summer.\n\nWest eyes realignment in central Asia.", "score": 2, "replies": [{"body": "Very interesting predictions indeed. I may be overly cautious on rebound and sectoral prospects. And you did bring up the important geopolitical restructuring of Central Asia. A succesful realignment would mean the total collapse of Russian \"Empire\" and more strategic pressure for China, making the latter less inclined toward Taiwan strait war I guess.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Nobody in the west cares about either of those countries.", "score": 9, "replies": [{"body": "I thought that was where Owen Wilson crashed his jet in the 90s?", "score": 4, "replies": []}]}, {"body": "Wait huh? Why what's going on with them?", "score": 1, "replies": []}, {"body": "They may be small countries but I am very afraid of that conflict.", "score": 1, "replies": []}]}, {"body": "I have a lot of confidence in renewable energy and it seems we are already seeing a shift in that direction. But I image it will be a long, slow and bumpy ride. With that said my enphase buy from earlier this year has been killing it", "score": 1, "replies": [{"body": "Absolutely, I do hold a clean energy ETF which I bought into, unfortunately, during the height of 2021. Would love to see it rebound.", "score": 1, "replies": []}]}, {"body": "US Big Tech extreme rebound Q3\n\nChina Tech extreme rebound Q2", "score": 1, "replies": [{"body": "Will check back to see if these come true :)", "score": 1, "replies": []}]}, {"body": "Ironically, giving the beating that real estate and tech companies took this year, I am personally watching these very closely for 2023.\n\nA low cost tech index fund might be a good long term buy and hold. Would definitely stay away from individual companies.\n\nIn real estate, I am watching realogy and various home builders. Will probably take a small position on realogy and larger positions in some top home builders.", "score": 1, "replies": [{"body": "Thanks for the discussion. Yes I am quite cautious and conservative since I took quite a beating in 2022, but I do hold index funds and ETF covering these two sectors. I just plan to be more cautious making additional investments.", "score": 1, "replies": []}]}, {"body": "Cyber security is going to go way up in the future", "score": 1, "replies": []}]}
{"title": "Safe, long term agriculture/trades investments for a young person looking to diversify?", "selftext": "I realized my (23) portfolio is mostly tech. I’ve got a good amount of Vanguard ETF and some random stuff like John Deer and BlackRock, but I’m definitely lacking in diversity.\n\nWhat are some good options to safely diversify into sectors a stupid young person like me wouldnt typically think to invest in, but a well rounded portfolio “should” have?\n\nI’m thinking things like real estate(I obviously can’t afford to buy a house), agriculture, metal work, etc.\n\nI’m working full time at 25/h (CAD) so I’m not rolling in it but I feel I’m in a position to start thinking long term.", "id": "zybumo", "created_utc": 1672337138.0, "score": 3, "upvote_ratio": 0.67, "num_comments": 9, "comments": [{"body": "I hear ornamental gourd futures are the way", "score": 5, "replies": []}, {"body": "I’m of the opinion that you either Invest in what industries and companies you “know”, or you should just invest in an index fund and call it a day. \n\nDo you have the time to research random metals companies to figure out which one will outperform it’s competitors? Do you know if the industry is cyclical and what cycle it is in? Are you willing to read and keep up with quarterly/annual earnings filings? Watch the news for all of your companies?", "score": 4, "replies": [{"body": "Cool thanks I’ll looks, are there any real estate or aggreculture specific infix funds or etfs that are the safest", "score": 1, "replies": []}]}, {"body": "Unfortunately, agro biz currently trades at high PE like tech companies. Wait until interest rates peak next year and you will find much better investments.", "score": 3, "replies": []}, {"body": "Buy a COW, haha https://etfdb.com/etf/COW/#etf-ticker-profile\n\nLook under the analyst report they give a few alternatives. Categories https://etfdb.com/etfs/", "score": 2, "replies": []}, {"body": "$LAND", "score": 0, "replies": []}, {"body": "I have some DOLE stock and it is holding up pretty well right now.  In at 8.75 and happy to have it.  Pays a divi too.\n\nFell all the way to 7.3 at one point though.\n\nIts P/E ratio is kinda high at 18, but its book value is 2x its market cap.", "score": 1, "replies": []}, {"body": "If your looking for actual Ag companies vs land ETF's/land buyers between Agco, john Deere and CNH your covering probably 90% of most used equipment brand wise (i.e. New Holland, Case, Fent, Massy Ferguson and obviously John Deere) as a farmer I'm pretty confident to say that at a guess 99% of farms (in the western hemisphere) will have at least 1 piece of equipment from the above brands (ignoring more niche farms such as for example vineyards). While there's a lot of money made from purchasing the equipment a significant amount made from parts (which the cost of are through the use and the expected hourly life span are relatively short)\n\nOther companies i look are ones such as Pilgrims pride (PPC) and Tyson food (TSN) both companies that cover a relatively large range of the protein market.\n\nThis isn't based of things such as P/E its going of my exposure to these companies and the general agriculture community as a whole, and while they may not have expediential growth i personally think there a pretty secure bet long term. I'm quite heavily weighted to a diverse range of Agriculture and food based stocks as quite simply land and food doesn't go out of fashion.", "score": 1, "replies": []}, {"body": "Buy land rent it out.", "score": 1, "replies": []}]}
{"title": "Question about tech stocks", "selftext": "Hi, just a newbie in trading here…. Anyone have any idea why the tech stocks are falling? Meta, MSFT, Amazon and Alphabet are all falling…. Is there a particular way these should be traded or should I buy the dip?", "id": "zycf0i", "created_utc": 1672338525.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 17, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Rates are rising, meaning the present value of future earnings are falling, meaning PE multiples go down, meaning prices drop.", "score": 7, "replies": [{"body": "Thank you very much… this explanation helps a lot.", "score": 2, "replies": [{"body": "Also call out, investors have more options of where to put their money, since higher rates means bonds pay better. \n\nInvestors want companies that are generating free cash flow and returning capital back to investors. \n\nA lot of tech companies don't really return value back to share holders, since they take cash flow and invest back in the company for growth.", "score": 2, "replies": []}]}]}, {"body": "Just a big bear market for tech this year.\n\nThere's a handful of ways to buy in if and when you choose.\n\nYou can lump sum and hope you didn't try to catch a falling knife, you can DCA and not worry about missing the bottom, or you can sell some cash secured puts and wait for the stock to reach the strike.\n\nAll have positives and negatives.", "score": 3, "replies": [{"body": "Ah ok…. I think I will DCA for the time being… thank you very much for this info.", "score": 1, "replies": []}]}, {"body": "Pretty much all of the answers that I saw are right.   I just want to add one thing:  This is what tech stocks do.   They run up hard and they fall hard.   \n\nFollow this simple advice from Warren Buffet:  \"Be Fearful When Others Are Greedy and Greedy When Others Are Fearful”\n\nI would also like to add, don't try to hunt for the bottom.   You may miss out on those last few %, but you are more likely going to miss opportunity if you try to time the bottom.", "score": 3, "replies": []}, {"body": "Many people have had a very expensive lesson this year about the risk of chasing big gains with a concentrated portfolio of tech stocks. You can learn the same lesson but for free by avoiding the same mistake.", "score": 3, "replies": []}, {"body": "Recession is coming, tech stocks were inflated during the near zero interest rates.  The economic outlook is not good.  Institutional investors are taking out their profit/cash and waiting for the economy to pivot.", "score": 2, "replies": [{"body": "Did someone say pivot!@@!", "score": 2, "replies": []}]}, {"body": "There’s other factors at play with all of them but, in general, tech valuations rely heavily on future cash flows. As interest rates increase the value of future cash flows decrease which results in discounting of current share price to account for that.\n\nWhether or not to buy the dip depends on your time horizon. Sounds like you’re a trader based on what you said so I’ll let others who think they can predict the short term jump in here", "score": 1, "replies": [{"body": "Thank you very much for this. I am very much a newbie and am hoping for long term investments. I am just worried these stocks may not recover ever to there original value.", "score": 0, "replies": [{"body": "Understood, unfortunately no single stock is immune from going down to $0. If you’re worried about them never recovering I would just buy the whole stock market with $VTI. I’d only recommend buying individual stocks if you’re trying to beat the market but know that the majority of people who do fail. If you still want to buy individual stocks despite the risk learn how to assess financial statements and read earnings transcripts. Formulate an investing checklist or copy someone else’s. You’ll have losers with individual stocks, no way around it. But your winners over the long term will far exceed your losers if you increase your chances by doing thoughtful DD (due diligence)", "score": 2, "replies": [{"body": "Sure I will just do DCA for tech and defence stocks and then invest in VTI or Vanguard S&P 500", "score": 1, "replies": []}]}]}]}, {"body": "Due to rates there is a preference for value stocks over growth.   After such a big bull run these were over due for a correction.   Tech can’t always be the best option and we are going through a different cycle.  They will come back when the time is right but I don’t think that is anytime soon", "score": 1, "replies": []}, {"body": "The economy is in the shitter", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "zykvlh", "created_utc": 1672358365.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 19, "comments": [{"body": "People already figured this out ...The bus left the station by summer this year when Ukraine got worse  and is already priced in. ESG was just another wall st marketing novelty that has lost its shine. The bad guys are now the good guys. It's time to get some retail suckers in this now that it's all priced in...so they've just announced anti-esg etfs. That's when you know the easy money has been made.  Europe wants a lot of oil and defence now....they are even starting up coal plants and just declared nuclear and natural gas as sustainable forms of energy for Gaya. But all this is old news and has already been priced in ...that's why oil companies are still at all time highs even though the price of oil has gone down by more than 40% from highs", "score": 15, "replies": [{"body": "The price of oil is down from the highs, but it's still above average.   I don't trade the commodity,  but I'm still heavily in oil companies.   \n\nSure,  the nobrainer easy money has been made,  but there is still plenty of upside left for the oil companies. \n\nAlmost all of them are singing the same refrain,  no low return new projects,  pay off debt,  buy back shares instead.   Every day oil stays above $60/bbl they are making a lot of money,  money that used to be spent on more exploration and drilling,  but now is going back to the shareholders instead. \n\nThat lack of new supply is going to keep oil expensive in a virtuous cycle for shareholders and keeps the risk weighted towards higher prices.\n\nI'm long XOM, SU, and CVE.  I haven't been buying more lately only since I've reached my limit of 25% in energy stocks.", "score": 1, "replies": []}, {"body": "ESG was not pushed by wall street, it was in response to clueless government regulation. Anyone with experience on the street knew it was fishy from the start", "score": -1, "replies": []}]}, {"body": "I'd say  AAPL, AMZN, GOOGL are pretty terrible.\n\nAdd Altria and Coca Cola, Mondelez", "score": 2, "replies": []}, {"body": "Most ESG funds are not investing in companies that are committed to making a positive difference in the world. The funds that do that are called impact funds. There are not a lot of them. \n\nThe bulk of ESG funds are designed to account for ESG **risks**. For example, a company that would be greatly impacted by drought or coastal flooding would not receive as big of an allocation, a company that is under the microscope for shady business practices might be excluded. But it has nothing to do with making the world a better place, it’s about limiting exposure to known esg risks. Once you understand this, some of the holdings (like nestle, chevron, etc) make sense.", "score": 2, "replies": []}, {"body": "I see no reason not to enjoy your portfolio being green in a sea of red in this short period between now and environmental collapse/nuclear holocaust ![gif](emote|free_emotes_pack|trollface)", "score": 1, "replies": []}, {"body": "I love Tobacco, Tequila, and Trucks...\n\nESG is just a Mirage. These companies don't GAF about it...", "score": 1, "replies": []}, {"body": "$YALL", "score": 1, "replies": [{"body": "Ha, that's sweet.", "score": 1, "replies": []}]}, {"body": "When Exxon has higher ESG rating than Tesla, you know it is nothing but fraud created by corrupt govt to divert the investments.", "score": 1, "replies": []}, {"body": "Go long [ITA](https://finance.yahoo.com/quote/ita?ltr=1).  Defense will never never never be cut in the United States.  RTX is among my largest holdings and it's almost totally offset my tech losses for 2022.\n\nMO is a cash cow with a 👀👀 dividend, but there's always that lingering risk that needling politicians will crack down on Tobacco.  \n\nBig oil has had quite the run already.  How about auto?  TM, specifically.", "score": 0, "replies": [{"body": "Toyota used to have dealer markups now I reminded them of recession and alternatives at msrp with dealer incentives they removed dealer markup and finally proce msrp but they all raised prices and recession thus all the autos will likely suffer for at least next yr or 2", "score": 1, "replies": []}]}, {"body": "Nuclear isnt considered ESG?  I even think its dumb oil gets such a bad rap but... jfl.", "score": 0, "replies": [{"body": "Esg does not exclude sectors by itself", "score": 2, "replies": []}]}, {"body": "I love that AAPL,. Company that ha products built in sweat shops, is ESG approved, but MO, a company that makes cigarettes that people choose to smoke is bad. \n\nI think ESG is mostly there to help people feel good, but the actual companies are far more nuanced than they appear.", "score": -1, "replies": []}, {"body": "There is a $VICE etf but the returns have been lackluster.", "score": 0, "replies": []}, {"body": "STRV?", "score": -1, "replies": []}, {"body": "Buy DRLL", "score": -1, "replies": []}]}
{"title": "Tesla CEO Elon Musk Just Had His First Margin Call for Twitter Loan", "selftext": "", "id": "zybtdy", "created_utc": 1672337056.0, "score": 0, "upvote_ratio": 0.22, "num_comments": 10, "comments": [{"body": "Articles like this is why FUD exists and decouples stock price from reality …", "score": 3, "replies": []}, {"body": "What a shitty article, doesn't prove or point to anything. Saw some similar posts earlier.", "score": 4, "replies": [{"body": "can you confirm whether it's the same as this one: [https://techstory.in/elon-musk-the-ceo-of-tesla-recently-made-his-first-margin-call-for-a-loan-to-twitter/](https://techstory.in/elon-musk-the-ceo-of-tesla-recently-made-his-first-margin-call-for-a-loan-to-twitter/) ? I can't see past the paywall but the one on techstory is just basic arithmetic and lots of assumptions - agree it's complete garbage. Plus no Form 4s.", "score": 1, "replies": []}]}, {"body": "fud - https://www.reddit.com/r/teslainvestorsclub/comments/zy97xv/tesla_ceo_elon_musk_has_just_had_his_first_margin/j24tii2/", "score": 2, "replies": [{"body": "agreed, didn't see the other thread. wtf is up with this sub these days? almost no activity.", "score": -1, "replies": [{"body": "No activity? Well, if you provided better articles then maybe you’d see a better crowd.", "score": 2, "replies": [{"body": "I wasn't referring to my post, i was referring to the post someone else made about the same subject 2 hours before me which had received so few upvotes i had to scroll down quite a lot just to find it.\n\nI've been reading this subreddit for probably like 4 years now, and the level of activity and attention something like this receives today is nothing compared to 4 years ago.", "score": 0, "replies": []}]}, {"body": "uncertainty makes people uncomfortable - does not spark joy", "score": 1, "replies": []}]}]}, {"body": "BEWARE: PROBABLY FUD\n\nBarron's just printed this article/headline 2hours ago which coincides EXACTLY with the intraday top. Coincidence? I think not!\n\nAnyway, i don't have Barron's access so can't read what's behind the paywall.\n\nLooking for someone who does to confirm whether it's the same article/information as this one: [https://techstory.in/elon-musk-the-ceo-of-tesla-recently-made-his-first-margin-call-for-a-loan-to-twitter/](https://techstory.in/elon-musk-the-ceo-of-tesla-recently-made-his-first-margin-call-for-a-loan-to-twitter/)\n\nIn the techstoryu article, the author merely does some basic arithmetic while operating under the ASSUMPTION that Musk had maxed out his available margin loans (at which point in time is not clear).\n\nThen, based on the price of the stock on Dec 22nd, he assumes Musk would have been margin called.\n\nBe very cautious here! Until we have an official source this is purely speculative and entirely dependent and multiple assumptions. Should any of the assumptions be incorrect the entire arithmetic falls apart and the conclusion falsified.\n\nFurthermore, unless there are some special exceptions or exemption in the event of emergency sales due to margin call, if Musk had indeed sold shares on Dec 22, we should have seen a Form 10-4 by monday night at latest.\n\nAnd as far as i know, there have been no Form 4s. Which means he didn't sell on Dec 22. If he had been margin called on Monday, we should have known by the end of yesterday.\n\nThis reeks like a desperate attempt by short sellers to allow them to cover while they can at the lowest possible price. Beware!", "score": 1, "replies": []}, {"body": "All they are doing is inferring based on price. There is no confirmation. The title is seriously misleading. It should say \"Has Musk Received his First Margin Call?\" because all they can do is speculate, but no, they want clicks.", "score": 1, "replies": []}]}
{"title": "The vibes are off at Tesla", "selftext": "", "id": "zycwgj", "created_utc": 1672339665.0, "score": 0, "upvote_ratio": 0.28, "num_comments": 13, "comments": [{"body": "And the fundamentals never looked better. As Buffett says, the best time to buy is when nobody wants it.", "score": 19, "replies": []}, {"body": "dont give \"The Verge\" any clicks", "score": 11, "replies": []}, {"body": "This is one of verge’s more fair articles on tesla, actually", "score": 3, "replies": []}, {"body": "Layoffs, lawsuits, delays, Twitter chaos, stock in free fall, factory shutdowns — What happened to America’s favorite electric car company?", "score": -40, "replies": [{"body": "Dude if you could just go and suck some balls and stop posting fud about Tesla. Thanks.", "score": 28, "replies": []}, {"body": "The CEO pissed off the corporate media", "score": 7, "replies": [{"body": "No they just see an easy way to get clicks.", "score": 9, "replies": [{"body": "Not mutually exclusive", "score": 7, "replies": []}]}, {"body": "The verge has always basically existed to criticize Elon, they hate him. Nothing new", "score": 3, "replies": []}, {"body": "Ah, yes... the evil corporate media... the accurately reports what he tweets... and seeks to get his comments on bullshit stories he pushes (Jet Tracking guy harassing him, but jet wasn't used that day, the incident wasn't near the airport, and his security was actually wanted by the cops for vehicular assault)... so he bans them instead... and the media barely covers it.  CoRpORaTe mEDiA is sO uNFaIr!!!", "score": -4, "replies": []}]}]}, {"body": "Watch all the replies come in hot saying this is just FUD or noise when literally 6 months ago this negative PR didnt even exist on this topic.", "score": -18, "replies": [{"body": "This isn't PR. This is an article. PR wouldn't do anything here. \n\nIt's still FUD. The company is exceedingly successful. The article makes it seem like they aren't.", "score": 16, "replies": []}]}]}
{"title": "Musk tells Tesla workers not to be 'bothered by stock market craziness'", "selftext": "", "id": "zy2we4", "created_utc": 1672312356.0, "score": 37, "upvote_ratio": 0.88, "num_comments": 14, "comments": [{"body": "Tesla doesn't trade on fundamentals.  As long as they hit production numbers they are good long term", "score": 9, "replies": [{"body": "If they were hitting the numbers why was musk selling? He knows the numbers. He sold high", "score": 0, "replies": [{"body": "Share holders like Musk do not sell like regular people like us. It's not like he goes to robinhood and sells. He is selling to inject more cash into Twitter. Cashflows make and break a company.\n\nYou could be a profitable company but your cashflows are depleted, it can cripple a company.", "score": 1, "replies": [{"body": "Been there lol. Shit sucks. You’re profitable but asking for receivable loans.", "score": 1, "replies": [{"body": "Typically companies want you have around a 1 to 2 debt/cash ratio. If your 1 to 1. Buckle up, gonna get bumpy", "score": 1, "replies": []}]}]}]}]}, {"body": "Valid point for shareholders as well, not only for company stuff!", "score": 7, "replies": []}, {"body": "Yes musk yes", "score": 3, "replies": []}, {"body": "After selling like a madman", "score": 8, "replies": []}, {"body": "Oh yes, don't be bothered! It's only the majority of your compensation packages going to shit as I dump my stock! 🤣😭", "score": 4, "replies": []}, {"body": "“Pay no attention to me trashing your wealth to help insurrectionists tweet again.  I need you to hold your stock and keep the price up while I sell!”", "score": 2, "replies": [{"body": "Why are people downvoting this, it's 100% correct.", "score": 1, "replies": []}]}, {"body": "Well if you have stock options now underwater that sucks.", "score": 0, "replies": []}, {"body": "sounds about right", "score": -3, "replies": []}, {"body": "I think they are bothered about his craziness.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "zya3mt", "created_utc": 1672332909.0, "score": 3, "upvote_ratio": 0.57, "num_comments": 10, "comments": [{"body": "\"FUD Filters | We need standards to crack down on spam.\n    If you have any suggestions, please reply here, and we can make sure others can view/agree/disagree and we do this right, together.\n\n  Creating post saying you sold shares\n  - If you're creating a post stating you sold shares at a loss, a screenshot of your sold position will be required, else it will be removed as spam.\n\n  Creating a post regarding a tweet\n  - If you're creating a post regarding a tweet, the original TWTR url must be linked on the post as well, else it will be removed as spam.\n  - Flair used must be TWTR\n\n  Creating a self-harm post\n  Creating a Poop Post or Low Effort Post\n  - Yes, these will automatically be removed.\"\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "Fake news.\nThese are false assumptions based on the original deal which was then modified. In the final deal Twitter took on the debt, rather than Elon taking debt with TSLA shares as collateral.", "score": 5, "replies": []}, {"body": "Fake news lol", "score": 4, "replies": []}, {"body": "Seems speculative? Either way the whole Twitter debacle is a shitshow. Musk really outkicked his coverage on this one. He probably could have gotten Twitter sub $10B had he waited.", "score": 5, "replies": []}, {"body": "Fake, Musk doesn't owe money for Twitter, twitter does. \n\n[https://www.npr.org/2022/11/30/1139964806/how-elon-bought-twitter-with-other-peoples-money](https://www.npr.org/2022/11/30/1139964806/how-elon-bought-twitter-with-other-peoples-money)", "score": 3, "replies": []}, {"body": "*Very* speculative, yet the headline conveys certainty.", "score": 3, "replies": []}, {"body": "Everyone saying fake news. Maybe a half truth.\nWhat are the SEC filings in which he collateralized his shares.\nWhy DID he sell three months in a row?", "score": 1, "replies": []}, {"body": "Barrons changes their story: [https://www.barrons.com/articles/tesla-elon-musk-margin-call-twitter-loan-51672328580?st=vkafis57atdf99u](https://www.barrons.com/articles/tesla-elon-musk-margin-call-twitter-loan-51672328580?st=vkafis57atdf99u)\n\n\"How Elon Musk Dodged a Potential Margin Call Bullet by Following His Own Advice\"", "score": 1, "replies": []}, {"body": "Fake news from media.", "score": 1, "replies": []}, {"body": "They have had to retract this, thanks to Gary Black", "score": 1, "replies": []}]}
{"title": "Musk is down $140 billion YTD... Nothing a few $TSLA green days can't fix...", "selftext": "&#x200B;\n\nhttps://preview.redd.it/eytfs9cf4w8a1.png?width=1056&format=png&auto=webp&s=74ac032bb1e6b91bc5e7ea303afe583da6fd8c99", "id": "zyebnf", "created_utc": 1672342908.0, "score": 18, "upvote_ratio": 0.88, "num_comments": 13, "comments": [{"body": "\"FUD Filters | We need standards to crack down on spam.\n    If you have any suggestions, please reply here, and we can make sure others can view/agree/disagree and we do this right, together.\n\n  Creating post saying you sold shares\n  - If you're creating a post stating you sold shares at a loss, a screenshot of your sold position will be required, else it will be removed as spam.\n\n  Creating a post regarding a tweet\n  - If you're creating a post regarding a tweet, the original TWTR url must be linked on the post as well, else it will be removed as spam.\n  - Flair used must be TWTR\n\n  Creating a self-harm post\n  Creating a Poop Post or Low Effort Post\n  - Yes, these will automatically be removed.\"\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Everybody is down. The more you had the more you lost in absolute numbers.", "score": 3, "replies": []}, {"body": "Where's all the talk of unrealised loss tax rebates?", "score": 2, "replies": []}, {"body": "Don't worry, SBF won the award for this year by going 32B$ to zero.", "score": 2, "replies": []}, {"body": "Well yeah. \n\nWe're about to have a recession that will expose traditional ICE manufacturers.\n\nTesla is rolling out Model S, 3, X, Y, Semi 1 & 2, Cybertruck and the RoboTaxi/$25K EV is on showcase soon.\n\nAs well as the revolutionary Autonomous Self Driving - which is *finally* almost done, the BETA test going very well. \n\nGoing to be a massive year for Tesla, solidifying their hold of this dacade.", "score": 4, "replies": [{"body": ">The beta test is going very well\nHAHA good joke", "score": 1, "replies": []}, {"body": "FSD is decades away from being at the point where you can legally nap while your car drives… even if it is “ready” in two years.\n\nFSD being “ready” anytime soon isn’t a guarantee either.\n\nThere’s also a metric ton of hidden costs besides development which could prevent profit anytime soon. Like the insurance, lawyers and lobbyists this will take.\n\nGovernments and the public have to trust this tech fully and regulate it.\n\n\nHow will Tesla prove it’s safe from cyber attacks? How will they figure out the insurance aspect; lobby against the interests that won’t want it widespread like trucking unions or delivery unions.\n\nAs a citizen I’d be afraid of remote hijacking.\n\nThe automatic elevator took decades to come into use after it was ready due to trust issues. Gaining public and government trust for self driving cars won’t be easy.\n\nThey know it’s pandora’s box.\nLevel 3 is the most that’s been approved and companies have trouble with that.\n\nEven if it’s a grey area, regulation will prevent it from being Level 5 for a long time.", "score": 1, "replies": []}]}, {"body": "Then there is the last day of tax harvesting tomorrow. 😣", "score": 0, "replies": [{"body": "I believe the last day for tax harvesting was yesterday b/c of T+2 rule for settlement.", "score": 2, "replies": [{"body": "I thought about execution time. Yet for general rules for single or joint family filing one can sell on 31 December. \nIndividuals would still have the same execution time. \n\nSuppose I presumed the point of the execution of the contract was the time at which the sale would be concluded verse the time (I recall it being a day now due to the MM issues with the past meme short squeeze resolution) of 1 day to close.\n\nContractually from my experience, the date of execution of the agreement us the date of the transaction, and in that regard one, an institution would/could sell and count it as a 2022 transaction. The work of the broker or intermediary would seem to be irrelevant.\n\nI suppose it depends on how the governing legislation is written. 😒\n\nReally wish I knew, but probably another thing I will have to look up on my own.", "score": 2, "replies": []}]}]}, {"body": "\"Shit post/low effort\"  total nonsense from mod.  Do they not want people to discuss?", "score": -2, "replies": [{"body": "Not saying I don't agree but mods get complaints from reposts that discuss the same things. They are our friends", "score": 1, "replies": []}]}, {"body": "I'm Joe Biden and I approve this message.", "score": 1, "replies": []}]}
{"title": "Jeff Amazon is coming for your gov benies y’all.. #eatthepoor?", "selftext": "[removed]", "id": "zxpsot", "created_utc": 1672272785.0, "score": 3, "upvote_ratio": 0.62, "num_comments": 11, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|1 year ago\n**Total Comments**|183|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "That's a great deal!\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 4, "replies": []}, {"body": "The discount should be considered income.", "score": 2, "replies": []}, {"body": "Used to be like $3 a month", "score": 1, "replies": [{"body": "Yea I have ebt and I still pay $3 a month, I had to contact customer support and REALLY exaggerate how broke I am. Nothing I said was a lie, they make a ton of money off my purchases", "score": 3, "replies": [{"body": "That's cool they still honored it! Good on you going for it.", "score": 1, "replies": []}]}, {"body": "inflation", "score": 2, "replies": [{"body": "And the flip to profitability.", "score": 2, "replies": []}]}]}, {"body": "A lot of the stuff they sell is EBT eligible and it's a reliable service to provide.", "score": 1, "replies": [{"body": "Yup I have ebt and I can order food off of fresh and have it delivered. Absolute lifesaver imo. I pay $3 and change per month tho so I’m disappointed to see $7", "score": 1, "replies": []}]}, {"body": "meh if you know stats on meal delivery services like door dash you know the more poor, the more they use the service", "score": 1, "replies": []}]}
{"title": "Musk tells Tesla workers not to be bothered by stock market craziness", "selftext": "", "id": "zxpzuf", "created_utc": 1672273267.0, "score": 8, "upvote_ratio": 0.83, "num_comments": 15, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|3 days|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "I too, would tell people not to stare at the train wreck.", "score": 20, "replies": [{"body": "👶", "score": 1, "replies": []}]}, {"body": "Telling his employees not to panic while he cash out his shares..![img](emote|t5_2th52|12787)", "score": 14, "replies": []}, {"body": "It's his craziness that is concerning", "score": 6, "replies": [{"body": "He’s so crazy😂😂 unlike the global financial system, which isn’t a complete fraud", "score": 3, "replies": []}]}, {"body": "Dear Tesla workers, please raise your hands if you want to receive your wages in shares.\n\nI'm waiting people, I've got a meeting to attend to.\n\nIt is not as bad as they're saying it is.\n\nWho would you trust, your boss, who has plans to take everyone to space or someone who sits in a TV studio, sipping fruit juice.\n\nAlright, your loss will be my gain.\n\nCiao.", "score": 2, "replies": []}, {"body": "Easy for him to say, would be shocked if most tsla workers didn’t have something at stake", "score": 2, "replies": []}, {"body": "The promoter shakes with trepidation at the idea *he may have to start paying employees in actual dollar bills*, as his Teslabucks® company scrip becomes worthless.", "score": 2, "replies": []}, {"body": "Don’t Mind the Gap", "score": 1, "replies": []}, {"body": "I think they are more bothered by his craziness...", "score": 1, "replies": []}, {"body": "Maybe that's why it pumped toward the end of the day? On the premarket audio cast, someone pointed out there was unusual activity during the opening.", "score": 1, "replies": []}, {"body": "He's not that off is he?\n\n\"The market’s downturn in 2022 can be attributed to the rising level of uncertainty for investors,” says Rob Haworth, senior investment strategy director at U.S. Bank Wealth Management. Three key events contributed to the environment, including persistently high inflation, a significant change in monetary policy by the Federal Reserve and the economic fallout from Russia’s invasion of Ukraine. Other contributing factors were continued uncertainty created by the presence of COVID-19 and a contentious election season in the United States.\"\n\nhttps://www.usbank.com/investing/financial-perspectives/market-news/is-a-market-correction-coming.html", "score": 1, "replies": []}, {"body": "Translation: the place is on fire, the building is on fire, the whole block is on fire, get the fuck out any way you can. We're all gonna die. We're dead, actually. We're already dead. By the time you read this message, you've been dead for a while, and now you're a ghost.", "score": 1, "replies": []}, {"body": "As long as the average factory worker has their pay deposit hit on time, why should they give a fuck about the stock price?", "score": 1, "replies": []}]}
{"title": "SQQQ Vs SPXU", "selftext": "I have been in SQQQ (-3x of NDX100) since couple of months. I do believe there will be some sort of recession, and over the course of another 6-7 months the markets(NDX, S&P500) won’t give a +ve return. More likely to give a -ve return. Given this assumption, I wonder if it’s better to be buying SPXU (-3x of S&P500) as compared to SQQQ. \n\nAs shown below, in the line chart, NDX100 has fallen to June, 2020 levels as compared to S&P500, which has fallen to Jan 2021. If the crash is going to be relatively neutral, there might be more room in S&P500.\n\nLine Chart of NDX100 vs S&P 500 (normalized)\nhttps://imgur.com/gallery/nkycJ6j \n\nBox Plot of Daily Returns of NDX100 vs S&P500\nhttps://imgur.com/gallery/OcdkjKL\n\nOn the other hand, the crash might not be relatively neutral. The rise of NDX100 was outsized, and so is it’s volatility (box plot in above link). Also, the P/E ratio is NDX100 ~30, and S&P500 is ~20. So with rising rates, it might impact NDX100 more as compared to S&P500.\n\nAssuming you are betting on recession, which one would you pick to invest - SQQQ or SPXU?", "id": "zxq1jr", "created_utc": 1672273377.0, "score": 3, "upvote_ratio": 0.62, "num_comments": 21, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|1 day ago\n**Total Comments**|1|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)\n>TL;DR: If you are betting on recession, it is better to invest in SPXU as compared to SQQQ.", "score": 1, "replies": []}, {"body": "I had 500 shares of SQQQ this morning. I sold 200, I think the Tesla short covering rally will begin and Nasdaq will get a bump.\n\nBut SQQQ and TQQQ are the correct plays", "score": 5, "replies": [{"body": "Is this your major play? In other words, is this a significant % of your portfolio?", "score": 2, "replies": [{"body": "I say that, but I guess now I have more cash after the sale. Will evaluate my next moves but I'm good selling cash secured puts to earn money and maybe I'll get assigned", "score": 2, "replies": []}]}]}, {"body": "TSLS has been doing a lot better than SQQQ", "score": 4, "replies": [{"body": "Omg I wish I knew this existed a month ago lmao", "score": 4, "replies": [{"body": "I think you have short funds for TSLA and AMZN.", "score": 3, "replies": []}]}]}, {"body": "Historically QQQ & IWM, had better returns either way vs SPY... so SQQQ/TQQQ set or TZA/TNA would do better... personally I do prefer FNGD/FNGU or BERZ/BULZ for 3x leveraged returns..", "score": 4, "replies": [{"body": "Why do you prefer those etfs over the ones mentioned?", "score": 2, "replies": [{"body": "If market is down the most overvalued are the fangs stocks & bounce more when market is up; not always but most of the time", "score": 2, "replies": []}]}]}, {"body": ">I would pick SPXU because it is more likely to give a negative return than SQQQ.", "score": 4, "replies": [{"body": "So you are saying both are worse in the event of recession? Or, are you questioning recession assumption itself?", "score": 1, "replies": [{"body": "You're talking to an AI bot", "score": 14, "replies": [{"body": "That is very regarded ![img](emote|t5_2th52|4641)", "score": 1, "replies": []}]}]}]}, {"body": "Look at what each holds finance and energy still holding qqq has much less of that", "score": 1, "replies": []}, {"body": "Whichever one moves more. These 3x ETFs can suck if the underlying doesn't move much. So in this case, SQQQ. I bought some shares at little under $39. Already sold most of it. Hoping it drops back under $45 so I can rebuy.\n\nThe risk is when the market does bottom and bounces, SQQQ will drop faster since tech will spike up faster.\n\nI had SPXU shares at the end of 2019. Then the covid crash happened. Too bad I didn't have diamond hands.", "score": 1, "replies": [{"body": "Now it is at 39. Do you many more this time?", "score": 1, "replies": [{"body": "Haven't bought back in yet. Waiting for around $35. Whether it gets down there though, I don't know.", "score": 1, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "zxrput", "created_utc": 1672277548.0, "score": 16, "upvote_ratio": 0.94, "num_comments": 16, "comments": [{"body": "Biggus Dickus chart", "score": 3, "replies": [{"body": "Be careful, a short term retracement to the base of the tip is possible.", "score": 3, "replies": [{"body": "Thanks for the *tip*. ![img](emote|t5_2th52|4641)", "score": 3, "replies": []}]}]}, {"body": "If you live in the Midwest, you know Casey's is THE shit. Honestly feel really stupid for not getting some shares even though I knew Casey's was growing and people love them.", "score": 2, "replies": []}, {"body": "Not the dumbest thing I’ve seen on here", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|2 years ago\n**Total Comments**|216|**Previous Best DD**|\n**Account Age**|8 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "I'm not sure what you're asking me, but I'll give it a shot. Casey's General Stores is a company that operates convenience stores and gasoline stations. It has been in business for over 50 years and currently has over 2,000 locations across the United States. The company went public in 1983 and its stock is traded on the Nasdaq exchange under the ticker symbol CASY.\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "All you have to do now is suck it", "score": 1, "replies": [{"body": "And swallow", "score": 1, "replies": []}]}, {"body": "Also, arbitrage sports betting is also recession proof.", "score": 1, "replies": []}, {"body": "Is this like the Wawa of the west? If Wawa ever goes public I'll give them every penny of my money", "score": 1, "replies": [{"body": "Midwest yes. Good comparison. They're in every small town. Constantly full of people.", "score": 2, "replies": []}]}, {"body": "That’s some BDE right there", "score": 1, "replies": []}, {"body": "And then it nuts downward", "score": 1, "replies": []}]}
{"title": "Walmart", "selftext": "[removed]", "id": "zxxdl2", "created_utc": 1672293182.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 14, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|2 weeks ago\n**Total Comments**|2|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "Must have all been shipped to my local Wal-Mart. Went today and looked completely normal (crowded with people of Wal-Mart and a mess).", "score": 4, "replies": [{"body": "is it for real?i live in colorado and not able to find eggs from last 2 weeks i believe 🤯", "score": 0, "replies": [{"body": "Eggs are expensive and hard to find right now because of the Bird Flu.", "score": 3, "replies": [{"body": "Are they slaughtering chickens to keep it from spreading or something? Because the price of chicken is way down. The grocery stores here have chicken for $1-2 a pound.", "score": 1, "replies": []}]}, {"body": "King Soopers in Denver just got restocked the other day. Went from 5.69 a dozen with one per customer to 11.69 today, no limits though! Lol", "score": 2, "replies": []}]}]}, {"body": ">It definitely sounds like it might be time to buy some put options! I would keep an eye on the situation at your local Walmart and see if the shortages continue. If they do, then it could be a good opportunity to profit from the situation.", "score": 1, "replies": []}, {"body": "Sounds like you could use a grocery store.", "score": 0, "replies": []}, {"body": "not just 1 experience i tried 4 tyms from the 13th of this month and couldn’t find 60 case eggs and tomatoes i tried twice in this week", "score": 0, "replies": []}, {"body": "🌈🐻 alert", "score": 1, "replies": []}, {"body": "So just from 1 experience, you are thinking of buying puts? Wouldn't you check a few more stores, and know the reasons for such low footfalls, and then come to a decision to do something?", "score": 1, "replies": []}, {"body": "That's like every Friday at my Walmart", "score": 1, "replies": []}, {"body": "Walmart Q4 earnings report absolutely crippled by Banana and Egg shortages", "score": 1, "replies": []}, {"body": "the preppers holding $egg and $milk are gonna be rich", "score": 1, "replies": []}]}
{"title": "Elon dropped Tesla's stock by 84% for the everyday investor to invest in it. He did what we said he would do", "selftext": "[deleted]", "id": "zxyi7i", "created_utc": 1672296713.0, "score": 7, "upvote_ratio": 0.63, "num_comments": 11, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|8 months ago\n**Total Comments**|15|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "That’s pre split you jack ass, 🤤", "score": 21, "replies": [{"body": "No no, those don't exist 🤫\n\n*I figured people would get the sarcasm of this post and stock splits, but I have greatly overestimated the regards that are here", "score": -5, "replies": [{"body": "Stfu, u killing my brain cells…", "score": 2, "replies": []}]}]}, {"body": "Your charts are wrong.  You didn't account for the 5 to 1 and another 3 to 1 split.  If you hold the stock since that tweet, you are still up like 400%", "score": 6, "replies": []}, {"body": "I completely agree with Elon Musk that Tesla's stock price is too high. I believe that it is overvalued and people are overestimating the company's future prospects.\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 4, "replies": []}, {"body": "The stock definitely wasn't made lower by 2 stock splits...", "score": -1, "replies": []}, {"body": "TSLA stock splits are like my wife banging her boyfriend, just pretend it didn't happen.", "score": -1, "replies": []}, {"body": "The most expensive red pills in history.", "score": 1, "replies": []}]}
{"title": "Elon Musk tells Tesla employees don’t be ‘bothered by stock market craziness’", "selftext": "[removed]", "id": "zy3x8j", "created_utc": 1672315836.0, "score": 35, "upvote_ratio": 0.87, "num_comments": 19, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|7 months ago\n**Total Comments**|95|**Previous Best DD**|\n**Account Age**|8 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)\n>TL;DR: [https://www.cnbc.com/2022/12/28/elon-musk-tells-tesla-employees-to-ignore-stock-market-craziness.html](https://www.cnbc.com/2022/12/28/elon-musk-tells-tesla-employees…", "score": 1, "replies": []}, {"body": "'This is fine'", "score": 11, "replies": []}, {"body": "I sold a put strike $100. That's where I will start accumulating.", "score": 9, "replies": [{"body": "Thanks for the reminder on selling the puts to acquire at the lower price plus the premium paid discount.  Good strategy.", "score": 4, "replies": []}]}, {"body": "Ha! Run", "score": 4, "replies": []}, {"body": "We all know TSLA is hopelessly overvalued. Yes it has dropped a lot, but I am very certain it will drop a bit further. Like 80-90$. I am not sure what will happen today yet, I still have puts and I might be f'ed and lose some money, but it might also dip again. We have had some strong upward movement today, but seeing how most stocks tanked yesterday and TSLA didn't shows it is mostly a hype bubble yet again. With this news and Twitter stuff calming down a bit I can see it being sold off today when market opens once again. Right now there is nothing that speaks for TSLA and the whole market is going down for the most part. So, I think TSLA has further wiggle room to go down but I don't know whether that will be today, tomorrow or the coming week.", "score": 5, "replies": [{"body": "Yeah tesla price shares seem to simply be moving by internet noise. In a week who even will remember tiny testicles. Lol", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4267)", "score": 2, "replies": []}, {"body": "Sure the Deep State is fighting Musk for his Twitter and free speach attack on them. Check out ESG delisting of Tesla - Shell e.g. has it still\nIts a big fight - buy silver", "score": 3, "replies": []}, {"body": "Okay, let's say this all has primarily to do with Elon.. so let's jump on a company with a single point of failure then I guess. WCPGW?", "score": 3, "replies": [{"body": "It also has to do with “imagined value” -like I don’t imagine his new conservative fans buying EVs. I bought the Nissan.", "score": 3, "replies": []}]}, {"body": "First tarket 100 but expect 80 and below in 23\n\nThey need year on year growth of 35 percent to justify today's price. Without a cheap model I can't see that happening. If it manages 25% growth that would suggest it's 30% overvalued.", "score": 3, "replies": []}, {"body": ">I am currently bullish on Tesla (TSLA) despite the stock's recent sell-off. I believe that Elon Musk is a visionary CEO and that Tesla is one of the most innovative companies in the world. The stock may be down in the short-term, but I believe it has tremendous upside potential over the long-term.", "score": -7, "replies": [{"body": "You are wrong, he is dumb as dirt.", "score": 8, "replies": [{"body": "> You are wrong, he is dumb as dirt.\n\n👍 yep", "score": -1, "replies": []}]}, {"body": "He’s got visions all right. Of grandeur and infallibility.", "score": 3, "replies": []}]}, {"body": "He's right the market always comes back. People lack patience and do stupid stuff", "score": 1, "replies": []}]}
{"title": "News for Regards Dec 29", "selftext": " \n\n### TLDR: Market Sentiment at the Open:\n\n**Low volume means more swings; likely upward swings**\n\n#### Bulls may like this\n\n* China’s earlier reopening could hit supply chains in the short term, but boost growth in 2023\n\n#### Bear thesis\n\n* Russia Rules Out Peace Talks With Ukraine. On Thursday morning launched more than 100 missiles at Ukraine, hitting capital Kyiv and other cities\n* **Asia-Pacific markets fall but European markets mixed**\n\n#### Stock Specific\n\n* Musk tells Tesla employees don’t be ‘bothered by stock market craziness. Cathie added more TSLA on Tuesday\n* Southwest may be close to resuming relatively normal operations.\n* Apple is reportedly concerned over the performance of iPhone 14 Plus\n* Google employees are concerned over a new employee evaluation system that could be used to cull the workforce.\n* The US House of Representatives banned TikTok on government-issued phones- Could help META which is struggling with VR headset sale reduction\n\n### Significant Events Calendar:\n\n##### Time >>>>> Event >>>>>>> Interpreting the report (Oversimplified)\n\n08:30 ET >>> Jobless Claims >>> Dont expect any impact today", "id": "zy6ccc", "created_utc": 1672323119.0, "score": 40, "upvote_ratio": 0.82, "num_comments": 12, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|3 weeks ago\n**Total Comments**|40|**Previous Best DD**|\n**Account Age**|3 weeks|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)\n>TL;DR: * The Best: Dallas Fed Manufacturing Survey, Consumer Sentiment Index, Existing Home Sales", "score": 1, "replies": []}, {"body": "Thanks fellow regard", "score": 8, "replies": []}, {"body": ">Jobless claims are a lagging indicator, so they don't have much impact on the market today.", "score": 3, "replies": [{"body": "You don’t get it bot. If someone says they smelled a person lose a job the market will go up.", "score": 1, "replies": []}]}, {"body": "China's reopening, especially international travel, pretty much guarantees outbreaks of whatever they're coughing from rn, elsewhere in the world (read: especially places like UK who have blatantly stated they're not going to test how dirty incoming travellers are).\n\nProbably a good time to load up soon on garbage like NVAX, which just tanked itself begging for more alms.\n\nPersonally, once the rumors of a new spike in Chinese crematorium use came out, I started wondering at the time efficiency of a vacuum furnaces vs a normal industrial cremation furnace...", "score": 0, "replies": [{"body": "Is your idea that Covid hasn’t spread and needs to come from China to get in other countries? Are you posting from three years ago?", "score": 3, "replies": []}]}, {"body": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "[https://roopnsi.substack.com/p/nsi-dec-29-actionable-news-in-2-minutes](https://roopnsi.substack.com/p/nsi-dec-29-actionable-news-in-2-minutes)", "score": 1, "replies": []}]}, {"body": "Appreciate the summary. Not sure I agree with China removing lockdowns being bullish (short or lobg term).  I would link China's new covid policy direction to Asian market's downturn for a glimpse into how that's going.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|27189)", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|12787) A whole lot of molasses. Just nothing moving any good direction to give any indication of which way we will go. Ugh.", "score": 1, "replies": []}, {"body": "No one uses social media on a government issued cell phone 😂. I worked for the give for ten years and I wouldn't even pull up Facebook on my office computer. Idk seems like some weird flex on Congress's part, but I highly doubt it'll have any effect on performance tbh", "score": 1, "replies": []}]}
{"title": "Tesla puts or calls", "selftext": "[removed]", "id": "zy8pds", "created_utc": 1672329427.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|5 months ago\n**Total Comments**|204|**Previous Best DD**|\n**Account Age**|5 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": ">Tesla is a overvalued company that will eventually come crashing down. I would not invest in Tesla at this time.", "score": 7, "replies": []}, {"body": "Tesla puts. Musk just got margin called on his Twitter loan.\n\nhttps://www.barrons.com/amp/articles/tesla-elon-musk-margin-call-twitter-loan-51672328580", "score": 5, "replies": [{"body": "Excellent ! Used my call profits from today to buy puts expiring tomorrow", "score": 2, "replies": [{"body": "Anddd the profits are gone", "score": 1, "replies": []}, {"body": "This is the way.", "score": 1, "replies": []}]}]}, {"body": "calls. elon will have to use tesla share buy backs to prop up yhe price for his margin calls", "score": 2, "replies": []}, {"body": "Bring bandaids.", "score": 1, "replies": []}, {"body": "Theta wheel", "score": 1, "replies": []}, {"body": "I'm up 100% so far today on tsla calls. I do have a stop at 124.50 tho", "score": 1, "replies": []}]}
{"title": "$Tesla CEO Elon Musk Just Had His First Margin Call for Twitter Loan", "selftext": "[removed]", "id": "zyakd7", "created_utc": 1672334016.0, "score": 2, "upvote_ratio": 0.56, "num_comments": 14, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|1 month ago\n**Total Comments**|33|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "How about providing some proof?", "score": 6, "replies": [{"body": "-trust me bro", "score": 9, "replies": [{"body": "![img](emote|t5_2th52|4641)", "score": 1, "replies": []}]}, {"body": "Not the OP, but I posted a link in another thread. According to Barron's, this did happen. https://twitter.com/barronsonline/status/1608490356026261505?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet", "score": 1, "replies": [{"body": "Tesla stock is up a bit today so I wonder if he can appreciate his way out of the margin call?", "score": 1, "replies": []}, {"body": "Paywall", "score": 1, "replies": []}]}]}, {"body": "How the fuck do you know what Twitter is worth? Gtfoh with this bullshit that you're just pulling out of your ass.", "score": 5, "replies": [{"body": "It’s worth what the market will bear, and will continue to bleed red until it is purchased or shuttered. What do you believe it’s value is?", "score": 0, "replies": [{"body": "We're the ones asking for your proof on how you came up with the arbitrary valuation.", "score": 3, "replies": []}]}]}, {"body": "Here are the details from todays Barron’s.\n[Musk’ First Margin Call](https://www.barrons.com/articles/tesla-elon-musk-margin-call-twitter-loan-51672328580)", "score": 2, "replies": []}, {"body": "[Elon Musk never took a margin loan to buy twitter](https://www.forbes.com/sites/abrambrown/2022/05/25/elon-musk-margin-loan-twitter-equity-deal-takeover-bid-buyout/?sh=3ffd9b6e20af).", "score": 2, "replies": []}, {"body": "Do even know what Elon is worth. Some dumb shit on here today.", "score": -1, "replies": [{"body": "So the margin calls will be no problemo eh? ![img](emote|t5_2th52|4275)", "score": 0, "replies": []}]}]}
{"title": "Tesla CEO Elon Musk Just Had His First Margin Call for Twitter Loan", "selftext": "", "id": "zyatax", "created_utc": 1672334634.0, "score": 13, "upvote_ratio": 0.94, "num_comments": 19, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|3 months ago\n**Total Comments**|1403|**Previous Best DD**|\n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "I'm beginning to ponder if this man is in fact an idiot.", "score": 18, "replies": [{"body": "It's hilarious that the life Twitter destroyed most was its CEO's.\n\nTextbook example of why you should never get high on your own supply.", "score": 7, "replies": []}, {"body": "Arrogance - he's Nero...", "score": 3, "replies": []}]}, {"body": "So upsies or downsies.", "score": 4, "replies": [{"body": "Why upsies? He will be selling more & more; not him, but his bank.", "score": 6, "replies": [{"body": "So downsies. Got it.", "score": 3, "replies": []}, {"body": "> not him, but his bank\n\nSo he didn't technically lie when he said no more selling.", "score": 2, "replies": []}]}]}, {"body": "😂", "score": 2, "replies": []}, {"body": "Elon, delete the Robin Hood app from your iPhone.", "score": 2, "replies": []}, {"body": "Sir, I have the bank on the phone.\n\nHa, they probably want more Teslas.\n\nWell yes sir, I believe they want more \"of\" Tesla, not necessarily just the cars.", "score": 2, "replies": []}, {"body": "I will not sell TSLA stock. Period.", "score": 5, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 11, "replies": []}, {"body": "clown", "score": 3, "replies": []}, {"body": "Factually correct:\n\nYour broker sells your TSLA when closing out your margin.", "score": 1, "replies": []}]}, {"body": "*smiles in $70p*", "score": 1, "replies": []}, {"body": "Wait, he took out a loan…to keep Twitter running?", "score": 1, "replies": [{"body": "To buy it & run it! He is a degenerate, up to his neck in debt!", "score": 1, "replies": []}]}]}
{"title": "Jerome Powell will continue to talk down inflation BUT......", "selftext": "[removed]", "id": "zyctic", "created_utc": 1672339483.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 16, "comments": [{"body": "No Advertising/Self Promo. Please review the rules. \n\nAlso asking for karma is not allowed (and lame).", "score": 1, "replies": []}, {"body": "> It would be great to receive some Karma to help grow my account faster. Upvotes would also be appreciated. Thank you for your support\n\nI can't find a specific rule for it but I'm sure the mods here do not want people farming for karma in this sub.", "score": 9, "replies": [{"body": "I wasn't aware that I was farming it, I just wanted to get past 100 so I could post more. I had 0 and didn't expect to make 100 in the first day", "score": -1, "replies": []}]}, {"body": "Tesla is a $20 stock, all day long.", "score": 10, "replies": [{"body": "You really think we go that low?", "score": 4, "replies": [{"body": "it was $12.5 just over 3 years ago.. yes it can, will it? nobody knows", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 3, "replies": []}, {"body": "I'm betting on it!!!", "score": 1, "replies": []}]}, {"body": "Just watch!", "score": 1, "replies": []}]}]}, {"body": "Value invest when interest rates are up. Growth invest when interest rates are dropping.", "score": 2, "replies": [{"body": "This is because when interest rates are high, investors are more risk-averse and prefer investments that provide a consistent stream of income, such as dividends. When interest rates are low, however, investors may be more willing to take on more risk in search of higher potential returns, making growth investments more appealing.", "score": 1, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|1 day ago\n**Total Comments**|3|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": ">It is more likely that we will see a decrease in inflation to around 2%. The Fed has been very clear that they are not considering raising the inflation target above 2%, so I think it's unlikely that we'll see an inflation rate of 3-5% in the next few years.", "score": 1, "replies": [{"body": " \n\nThere are a few factors that could potentially contribute to inflation remaining at or above 3-5% in the future:\n\n1. Increased demand for goods and services: If there is a strong demand for goods and services, it can put upward pressure on prices, leading to higher inflation.\n2. Increased production costs: If the cost of producing goods and services increases, companies may pass on those costs to consumers through higher prices, leading to higher inflation.\n3. Weaker currency: A weaker currency can lead to higher import prices, which can contribute to higher inflation.\n4. Looser monetary policy: If the central bank (in this case, the Federal Reserve) adopts a more accommodative monetary policy, it can lead to an increase in the money supply, which can contribute to higher inflation.\n5. Higher taxes: If taxes are increased, it can lead to higher prices for goods and services, leading to higher inflation.\n\nIt's important to note that these are just a few potential factors that could contribute to higher inflation. Ultimately, the level of inflation will depend on a variety of economic factors and can be influenced by both demand-side and supply-side factors.", "score": 3, "replies": []}]}, {"body": "So, that's great and all - but what happens if inflation refuses to drop off pretty soon? Wouldn't the fed still need to either adjust their inflation expectations long-term or maintain reasonably higher interest rates to attempt to pull inflation back in line? If inflation refuses to come down in spite of higher interest rates, the case for a bull market dictated by easier money looks a lot weaker.\n\n\nSure, inflation might come down and then bulls would be good to go if the fed follows through and brings rates back along on down as well. I can't really see that being a very sure thing though.", "score": 1, "replies": [{"body": ">So, that's great and all - but what happens if inflation refuses to drop off pretty soon? Wouldn't the fed still need to either adjust their inflation expectations long-term or maintain reasonably higher interest rates to attempt to pull inflation back in line? If inflation refuses to come down in spite of higher interest rates, the case for a bull market dictated by easier money looks a lot weaker.  \n>  \n>Sure, inflation might come down and then bulls would be good to go if the fed follows through and brings rates back along on down as well. I can't really see that being a very sure thing though.\n\n It's true that if inflation refuses to drop off, the Fed may need to adjust their inflation expectations or maintain higher interest rates to try to bring it back in line. However, it's also important to consider other factors that could affect the market, such as economic growth and unemployment rates. If the economy is strong and unemployment is low, it may be able to withstand higher interest rates without having a significant impact on the market. Additionally, the Fed has a number of tools at its disposal to help manage inflation, such as adjusting the money supply and using forward guidance to communicate its policy intentions. Ultimately, it's difficult to predict exactly how the market will respond to any given situation, and it's important to consider a range of potential outcomes when making investment decisions", "score": 7, "replies": []}]}]}
{"title": "$TSLA Who is seeing a candlestick pattern here? Let me know. If you do, what are some of the indicators? Comment below.", "selftext": "", "id": "zygrzt", "created_utc": 1672348733.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 16, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|2 days ago\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "The indicators are that I bought calls for tomorrow. Therefore, the stock will drop", "score": 7, "replies": []}, {"body": " I see Cathie Wo0ods in crotchless panties", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 3, "replies": []}]}, {"body": "That looks like the pattern I see I'm my head when a candlestick impaled my ass", "score": 4, "replies": []}, {"body": "Tesla is overvalued. The stock is due for a correction.\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 7, "replies": []}, {"body": "One bad tweet away from a dumpster fire 🔥 bigger than a candle imo", "score": 2, "replies": [{"body": "I personally don't have an issue with his tweets.  I think they're hilarious", "score": 1, "replies": [{"body": "I don’t like my ceo’s to be funny, but hey! It’s only money!!", "score": 1, "replies": []}]}]}, {"body": "It looks like a flame out pattern", "score": 2, "replies": []}, {"body": "Looks like a classic gap fill. Now that it has filled the gap, it may (or may not) continue its downtrend.", "score": 2, "replies": []}, {"body": "You posted on CFA subs in the past and now asking WSB for patterns/indicators? \n\nYou've fallen a long way.", "score": 2, "replies": [{"body": "Yeah I need to educate some fallen people now!", "score": 0, "replies": []}]}, {"body": "Dead battery pattern", "score": 2, "replies": [{"body": "* burning battery", "score": 2, "replies": []}]}, {"body": "[Squint your eyes until you see it](https://imgur.com/t/dickbutt/49y4w5A)", "score": 1, "replies": []}]}
{"title": "He drank the Tesla koolaid", "selftext": "", "id": "zyjs1i", "created_utc": 1672355746.0, "score": 11, "upvote_ratio": 1.0, "num_comments": 10, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|2 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "ParsimoniusParsimmon is an idiot. Tesla is a terrible company and its stock will never recover. I would short Tesla if I could, but unfortunately my hedge fund won't let me do that anymore.\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 4, "replies": [{"body": "🤣🤣🤣", "score": 2, "replies": []}, {"body": "Ban me for a week on WSB if my 133 1DTE Call options dont print tomorrow", "score": 1, "replies": []}]}, {"body": "Tesla Cuck", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|18630)![img](emote|t5_2th52|18630)![img](emote|t5_2th52|18630)", "score": 1, "replies": []}, {"body": "Great drag your parents down w/ya.", "score": 1, "replies": []}, {"body": "Bro ain't even getting any Vaseline with this", "score": 1, "replies": []}]}
