{"title": "Berkshire hathaway / Buffet is still buying Synchrony Financial stock", "selftext": "$SYF - \n\nhttps://www.forbes.com/sites/greatspeculations/2018/01/11/synchrony-financial-offers-buffett-style-blend-of-growth-and-value/#6adb39b239c4", "id": "88hyyy", "created_utc": 1522494496.0, "score": 87, "upvote_ratio": 0.89, "num_comments": 13, "comments": [{"body": "[deleted]", "score": 24, "replies": [{"body": "This is awesome. Thank you!!", "score": 1, "replies": []}]}, {"body": "[$SYF is only 0.42% of the overall portfolio](http://www.dataroma.com/m/holdings.php?m=BRK)", "score": 3, "replies": [{"body": "It's illegal to hold more than 10% of a bank stock without registering as a bank holding company ", "score": 11, "replies": [{"body": "Fun fact ", "score": 1, "replies": [{"body": "huh? not sure if sarcasm.. that is actually a legal requirement. Buffett spoke about it in an interview about Wells Fargo not long after the scandal broke. ", "score": 1, "replies": [{"body": "It’s a fun fact ", "score": 1, "replies": []}]}]}]}, {"body": "0.42% of his portfolio is multiples larger than the average portfolio. ", "score": 5, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "True but i'm extrapolating the % of portfolio to their importance placed on the stock. To say SYF is something more important than their % holdings of WFC or BAC is what i'm pointing out. ", "score": 2, "replies": []}]}]}, {"body": "He’s always been a big fan of banks with deceptive/aggressive sales strategies. ", "score": 1, "replies": [{"body": "Well, those of us who held on too $WFC too long paid the price with their latest scandal. Lack of regulation and incentive to pass legislation to do so is a perpetual problem regardless of party line. ", "score": 1, "replies": [{"body": "The financial industry is one of the most regulated industries and is one of the most corrupt industries. I don’t think it’s because there is too much regulation. ", "score": 2, "replies": [{"body": "I’m misunderstanding the line between “lack of regulation” and “corruption”. I guess the better term would be “ineffective” regulation. Lol\n\nAll wordplay aside, financials are still some of the safest investments since they are still “too large to fail”. I mean seriously, the big ones have eaten up way too many small ones without any opposition. ", "score": 1, "replies": []}]}]}, {"body": "You’re right he has some “interesting” businesses ", "score": 1, "replies": []}]}]}
{"title": "Can some please ELI5 Options to me? Particularly puts.", "selftext": "Hi all,\n\nI need just a quick explanation on puts and how, under what conditions I can be profitable buying a specific put for a specific date. Or rather, which put I should buy, given my prediction for price action over the coming months.\n\nBasically, I'm of the belief that a crash is fairly likely in the next year, let's not get into that particular debate but let's just assume this is my mindset. I want to buy puts on such over-valued gems as NFLX and TSLA and maybe FB and TWTR and GOOG given the recent FUD on those names and the potential crash I see. But I can't figure out which option to buy and will be profitable at the time closer to expiry if said crash does happen.\n\nLet's just do NFLX as I can extrapolate my belief systems about the others and pick the proper puts once I figure this out. So I suspect NFLX will be sub $200 by next January. I want to buy puts that will be very profitable next January if indeed we see NFLX sub $200. So, should I be looking at the strike price primarily? Obviously I'm looking at January 2019 puts right now. I see $200 strike price, the premium is $9.50ish right now. So what does that mean, like if I buy that option for $9.50, under what conditions will I be profitable come next January or come the crash say if it hits in June or September or whenever if it is well ahead of January?\n\nI know I should probably not buy puts if this stuff isn't clear to me, I have not purchased any and I won't until I am clear on this stuff. This is what I'm trying to do. So let's just look at a few January 2019 NFLX puts, and can you guys explain the various conditions that may take place for that put to be profitable?\n\n$200 strike, $9.50 premium\n\n$150 strike, $4.20 premium\n\n$100 strike, $0.70 premium\n\nAnd if I wanna go real YOLO with maybe just a few contracts. $50 strike, $0.15 premium.\n\nOr is it easier for me to just say, NFLX, January 2019, if it is $175ish at the time (my belief is it could be there abouts by then) which put should I buy today for the best return? If I get the $200 put for example, and by January 2019 NFLX is $150, then that's bad and I lose either way? Or do I win simply because NFLX is significantly lower then than it is now? This is kinda where my confusion is laying right now.\n\nThe plan is probably not to hold until expiry, just hold until it is a highly profitable position, or I guess until what? NFLX reaches the strike price or lower? Then I can exercise for profits? See this is where I'm getting confused here...I'm just not sure, for all of these puts, just how low NFLX has to go for them to become highly profitable positions whether via trading, or via exercising. If NFLX falls to $240 in the next month, do we expect to see really any rise in the $50 strike price options, for example?\n\nDamn options are confusing, I think I get calls a bit more. Like You get a $300 call for $45.58, if by January 2019 NFLX is $345.58 or higher and the option expires, you can buy NFLX shares for $300 + the $45.58 you paid for the option so you are profitable to some extent or another, like if NFLX is $400 you've profited over $50 per share if exercised, I get that, that seems pretty straight forward. But puts are confusing me a bit more, and I'm currently looking bearish, so I want puts not calls of course.\n\nThanks so much whoever takes the time to read and explain to an options noob like myself. :)\n\nAlso do I really need to worry about covered calls? What exactly is that compared to just \"calls\"? And are there covered puts? Or a \"covered call\" equivalent in puts?\n\nThank you :)", "id": "88jfg9", "created_utc": 1522510788.0, "score": 3, "upvote_ratio": 0.58, "num_comments": 18, "comments": [{"body": "Netflix 50$put? Lol you should stay away from options and just go to the casino.", "score": 6, "replies": [{"body": "Oh thanks for *all* the help. I ask a million questions in a long post and this is all you can provide? A cheap joke? $50 is not close to where I'm aiming. Indeed I said I believe it may be around $175. I could see $130 or even $85ish be where it finds support though, simply based on the technicals, if we do see a big crash. People are so quick to forget, and get so used to highly inflated stock prices so quick. NFLX was $85 as recently as July 2016 (I had last January here before, edited, dunno wtf I was looking at on my charts lol), and it currently has a P/E of what? Like 250ish? So whilst I'm buying, why not throw $200 or something at $50 puts as a YOLO? Now that I'm looking at charts, sure I'm probably gonna select $90 or $80 instead, but c'mon... This is very little risk to extremely high reward so yeah, I do like plays like that. Highly speculative, highly over-valued stocks get slaughtered in a crash.\n\nBesides, I don't like casinos, I prefer the stock market for my gambling needs. Shoot me? I also use it primarily for more thoughtful plays but hey, nothing wrong with a gamble once in a while either.", "score": -2, "replies": [{"body": "> This is very little risk to extremely high reward so yeah.\n\nSo you think throwing away $200 is a good idea...\n\nPutting it in a slot machine would have a better reward then a fucking $50 nflx put. \n\nYou are literally betting on a market crash? Or nflx dissolving?\n\nThat's fucking retarded. You want to make calculated bets...not a blind YOLO. \n\nThere's realistic ways to hedge to market...then there's just pure degenerate unlikely scenarios....which is what you are doing, betting that we are going into a massive recession/nuke war...", "score": 12, "replies": [{"body": "I'm expecting a stock market crash and an over-valued company with a P/E of 250 like NFLX to get slaughtered in it. $50 is insane. I won't buy $50 after looking at the longer term chart. $130 will be the lowest I buy much of, but yeah, $100-200 at $80 or $90 puts doesn't seem a terrible play to me either.\n\nAgain, I don't like casinos so why can't I simply throw my money away in the stock market instead? You recommend a casino, as if that is somehow a more noble way of risking your money? No...I prefer this way...\n\nI literally said I don't want to get into the debate over a crash. It could happen, it may not happen. I wish to place some bets on it happening and I see no problem with that if that's what I want to do. I've lost $1000s on \"calculated bets\". I've made $10,000s on calculated bets. I wish to take a small part of those winnings, and put them on YOLO bets. I'm only planning to risk $1000 total here or so. To me that is well worth that risk for the possible rewards. I don't see why people have so much problem with that. They just don't want to hear that their super over-valued NFLX shares might be sub $150 one year from now? And that some gambler type kid might make a fortune off that loss if it comes to pass? That is my guess.", "score": -4, "replies": [{"body": "K go for it. You wanna bet on a market crash fine. It's your money. Do whatevrr. You wanna know rewards? Use a basic calculator. If you wanna be lazy, use the link below\n\nhttp://www.optionsprofitcalculator.com", "score": 6, "replies": [{"body": "This is gold! how accurate is this though because technically wouldnt IV constantly be changing", "score": 1, "replies": [{"body": "It's ight. Gives your ball park estimates. ", "score": 1, "replies": []}]}, {"body": "Thanks man!", "score": 1, "replies": []}]}]}]}, {"body": "Instead of taking 5 mins to Google or YouTube options you typed out this post and continue to type out more. Lmao. You are the kind of sheep that I make money off in the stock market", "score": 3, "replies": [{"body": "I've researched and I'm confused still. I've watched like 50 minute videos on the subject. Calls seem clear, puts are less so in my mind, especially on longer time frames in this particular scenario.\n\nI can't wait to buy my options and wait 9 months. I'm gonna be soooo happy when the stock market crashes and know people like you remember that dumbass kid who's rolling in it now. OR! I might lose $1000! I lost $2000 this week. And I made it back the following day. Easy come, easy go, why should I give a shit about $1000 on a 9 month time horizon, when I'm winning and/or losing many $1,000s more than that within one week trading? Fucking chump change guy.", "score": 0, "replies": [{"body": "Puts are exactly like calls, but in reverse. If you buy the $200 puts for $9.50, your breakeven price on the stock is $190.50. \n\nIf NFLX is at $190.50 on expiry, your puts have $9.50 of intrinsic value and you have $0 profit or loss. If it's fallen farther, you make money.\n\nThat said, there is a LOT more to it than this. You really need to get into delta, gamma, and implied vol to know what you're doing.\n\nDon't worry about jackasses like /u/kstockgainz. I'd honestly stay away from this sub if you're doing anything other than buy and hold. People here are not sophisticated, they just buy and pray things go up. They've been spoiled by this unusually calm market for the past decade. I actually have been calling for a big correction in tech for 3 months, and I made a small fortune these past few weeks. There is alpha to be had out there if you're willing to put the time in to find it.\n\nJoin us on /r/options to learn more of the advanced stuff.", "score": 1, "replies": [{"body": "Thanks for the very good explanation! I will definitely come over to r/options and do some reading. Didn't realize I was in the buy and hold and pray zone haha, yikes.. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "So a Put is the right - but not an obligation - to sell a stock before a certain date.  If the strike price is below the current stock price, then the put option is “out of the money”. Once the stock price falls below your strike price, the option is “in the money” and you could sell the put option for a gain.  Out of the money put options will decline in value the closer you get to the expiration date.  Also, you probably won’t ever exercise your options (convert to shares); rather, you’ll just sell your options for a profit prior to expiration date. ", "score": 1, "replies": [{"body": "Thank you :) So if I buy $130 put options for example, I need NFLX to drop below $130 before I'm ever gonna see much in the way of gains? Or at least, it's gotta be getting pretty close and the market is beginning to foresee $130 as becoming more and more likely, yeah? Especially if we're still a few weeks/months out and market conditions are rocky, logically in my head I'm thinking a $130 put option would become more valuable at such a time, than it is today, right?", "score": 2, "replies": [{"body": "Exactly.", "score": 1, "replies": []}]}, {"body": "If you just keep your in the money put till expiration (and not see the options prior), does it convert to shares? ", "score": 1, "replies": []}]}, {"body": ">Damn options are confusing, I think I get calls a bit more.\n\nIf you get calls then you get puts. \n\nIf you don't , then that means you don't know basic addition and subtraction. \n\nYou calculated the profit/breakeven for that $300 strike nflx call ...it's the same method as calculating the put...except you do subtraction \n\nFor example $300 puts going for $40 premium? That means you will breakeven after nflx hits $260... anything lower than $260 is the profit range.", "score": 1, "replies": [{"body": "Ok awesome! Thank you! That was all the explanation I think I needed in the end! :)\n\nObviously if I plan to trade the puts, rather than execute, I need to start taking into account all the greeks and such, especially as we're getting closer and closer, but this made it really clear now if I plan to hold until a time of execution.\n\nThank you!\n\nThe confusion, I guess, now I'm thinking again, is this:\n\n$300 put, $40 premium, so if NFLX is under $260 then I profit at time of execution, but how? Like, the option, isn't it to buy NFLX shares? At $300? Or OH! It's to *sell* NFLX shares at $300, right? So Basically, what happens at time of execution, is I need to first buy the shares off the market at current price that's in the money so let's say $240 it is at, and then I get to sell those immediately for $300? IE $60 profit on each share, but minus the premium so $20 profit on each share? That's not bad!\n\nOK, so given my outlooks etc, I do need to buy somewhat higher priced puts if I wanna make a lot of money like I've been thinking/hoping to, though I understand the *premium* value probably spikes up a ton in comparison to what I may buy at today, and that's where the money is to be made, rather than the execution. $50 puts are obviously insane, NFLX needs to drop to like $25ish to really make the whole risk to reward scenario all that much compelling, so to me yeah, that's not at all a good play, though maybe it is if I'm trading the premium, and it does get below $50 at all, and I bought the option at like $0.10 then the premium may be worth several dollars at that point which is massive gains. Yeah, much better just trading the option, not executing, in a long time horizon like this if I do get it right.\n\nThank you very much. I think it clicked now.", "score": 2, "replies": []}]}]}
{"title": "Fellow $TSLA putitas - this crash might sadly help out our puts", "selftext": "", "id": "88fyjb", "created_utc": 1522465740.0, "score": 7, "upvote_ratio": 0.64, "num_comments": 11, "comments": [{"body": "There is a market for Autonomous Driving and it should be the elderly. Musk should exploit the retirement funds of the yesteryears and he'll profit. Tech yuppies and middle aged bros who like to exploit limits are pretty much a crash test dummy for this system. ", "score": 10, "replies": [{"body": "You know what I want to do when I am sitting behind the wheel in my car -- not drive. I just want to sit there and let the car drive while I watch because I'm super lazy. Steering is hard. ", "score": 4, "replies": []}]}, {"body": "Alternative source: https://finance.yahoo.com/news/tesla-says-crashed-vehicle-had-030414425.html\n\nApparently he had 5 seconds to react to the warning system, but probably fell asleep.", "score": 5, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Why didn't it apply the brakes once it realized the human didn't? ", "score": 4, "replies": []}]}]}, {"body": "When I first saw this article from wsj.com, its title was:\n> Tesla Says Autopilot Was Engaged in Fatal Crash Under Investigation in California\n\nHere are some other articles about this story:\n\n* The Verge: [Tesla says Autopilot was engaged during fatal Model X crash](https://www.theverge.com/2018/3/30/17182824/tesla-model-x-crash-autopilot-statement)\n* zacks.com: [Tesla, Inc. - TSLA - Stock Price Today](https://www.zacks.com/stock/quote/TSLA)\n* Bloomberg: [Tesla Recalls About 123,000 Early Model S Cars](https://www.bloomberg.com/news/articles/2018-03-29/tesla-recalls-early-model-s-cars-to-retrofit-power-steering-part)\n* Washington Post: [Tesla’s ‘transformative year’ is hitting a brick wall](https://www.washingtonpost.com/business/economy/teslas-transformative-year-slams-on-the-brakes/2018/03/30/96f498be-32bf-11e8-8abc-22a366b72f2d_story.html)\n* mercurynews.com: [Tesla Model 3 put to the test by Car and Driver](https://www.mercurynews.com/2018/03/30/tesla-model-3-put-to-the-test-by-car-and-driver/)\n* valuewalk.com: [Whitney Tilson: My Advice To Tesla, 'Odds At 10-20%' Buffett Buying GE](https://www.valuewalk.com/2018/03/telsa-inc-tsla-ge/)\n* Reuters: [Tesla says crashed vehicle had been on autopilot prior to accident](https://www.reuters.com/article/tesla-crash/tesla-says-crashed-vehicle-had-been-on-autopilot-prior-to-accident-idUSL1N1RD01Y)\n* Forbes: [Now You're A 'Hater' If You Want Tesla To Keep Musk's Promises On Your Stock, And Your Model 3](https://www.forbes.com/sites/dalebuss/2018/03/30/now-youre-a-hater-if-you-want-tesla-to-keep-musks-promises-on-your-stock-and-your-model-3/)\n* barrons.com: [Lessons From Tesla's Tumble](https://www.barrons.com/articles/lessons-from-teslas-tumble-1522454402)\n* Breitbart: [Tesla Recalls Half the Cars it Ever Produced; Credit Rating Downgraded](http://www.breitbart.com/california/2018/03/30/tesla-recalls-half-cars-ever-produced-credit-rating-downgraded/)\n* sfgate.com: [Troubled Tesla needs a recharge after a year of setbacks](https://www.sfgate.com/business/article/Troubled-Tesla-needs-a-recharge-after-a-year-of-12794852.php)\n* wired.com: [The Worst Thing About Tesla's 123000-Car Recall? Crummy Timing](https://www.wired.com/story/tesla-model-s-steering-bolt-recall/)\n* cleantechnica.com: [Tesla Exec (In Employee Email): Daily Model 3 Production Well Into The 200s](https://cleantechnica.com/2018/03/30/tesla-exec-in-employee-email-daily-model-3-production-well-into-the-200s/)\n* cleantechnica.com: [Germany Reverses Decision To Remove Tesla Model S From Incentives-Eligible Vehicle List](https://cleantechnica.com/2018/03/30/germany-reverses-decision-to-remove-tesla-model-s-from-incentives-eligible-vehicle-list/)\n* wired.com: [Tesla's Autopilot Was Involved in Another Deadly Car Crash](https://www.wired.com/story/tesla-autopilot-self-driving-crash-california/)\n* uk.reuters.com: [Tesla says crashed vehicle had been on autopilot prior to accident](https://uk.reuters.com/article/us-tesla-crash/tesla-says-crashed-vehicle-had-been-on-autopilot-prior-to-accident-idUKKBN1H7023)\n* jalopnik.com: [US Labor Agency Files Amended Complaint Against Tesla For Alleged Worker Rights Violations](https://jalopnik.com/u-s-labor-agency-files-amended-complaint-against-tesla-1824214422)\n* abc7news.com: [ONLY ON ABC7NEWS.COM: Autopilot part of Tesla crash investigation, I-Team rides in Model X to site](http://abc7news.com/automotive/exclusive-autopilot-part-of-tesla-crash-investigation-i-team-rides-in-model-x-to-site/3284757/)\n\n-----\n\nI am a bot trying to encourage a balanced news diet.\n\nThese are all of the articles I think are about this story. I do not select or\nsort articles based on any opinions or perceived biases, and neither I nor my\ncreator advocate for or against any of these sources or articles. It is your\nresponsibility to determine what is factually correct.\n", "score": 7, "replies": [{"body": "Good bot", "score": 10, "replies": [{"body": "Great Bot", "score": 3, "replies": []}]}]}, {"body": "Wsj comment section is like the fox news comments section, but for people that finished high school.", "score": 6, "replies": [{"body": "Both Rupert Murdock properties tho", "score": 6, "replies": []}]}, {"body": "Oye machito. Better stc those puts before we rally into 300+", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I guess I'm just too soft for this", "score": 1, "replies": []}]}]}
{"title": "$TSLA won’t finish red next week or I’ll eat my own shoe", "selftext": "[removed]", "id": "88g94w", "created_utc": 1522469111.0, "score": 15, "upvote_ratio": 0.76, "num_comments": 13, "comments": [{"body": "[deleted]", "score": 60, "replies": [{"body": "Someone make this his flair", "score": 13, "replies": []}, {"body": "It's a month-old novelty account tho.", "score": 1, "replies": []}]}, {"body": "Hard to tell. $TSLA investors are irrational and actually seem to love bad news bc the stock jumps every time conventional wisdom says it shouldn’t. I swear all Musk has to do is tweet something like “Tesla is a good company” and the investors just throw money at him for it, which he quickly loses", "score": 17, "replies": []}, {"body": "Look at this fatcat humblebragging about still having shoes.  I lost mine in the megadepression of 2018.", "score": 11, "replies": [{"body": "2018 ain't over yet buddy. There's still more to lose.", "score": 9, "replies": []}]}, {"body": "we don't need another one of these karmawhores, do we folks? I say deport.", "score": 3, "replies": [{"body": "if he posted an actual position i'd take it", "score": 2, "replies": []}, {"body": "Ya if he posts proof of position I would take it too", "score": 1, "replies": []}]}, {"body": "It couldn't have come this far without living on hopes and dreams. \n\nTo the Mars!", "score": 2, "replies": []}, {"body": "no bamboozle or banboozle", "score": 2, "replies": []}, {"body": "Never bet against the Musk.. You just don't..", "score": 1, "replies": []}, {"body": "Possibly not. It'll trade sideways for a while until the next crisis sends it back on the road to hell.", "score": 1, "replies": []}, {"body": "You don't own any shoes. You sold them to the thrift shop, remember?", "score": 1, "replies": []}]}
