{"title": "Since bitches wanna call me out and I'm here...", "selftext": "Who's got me a decent volume software ETF to short?\n\nIGV doesn't have a whole lot of volume, prices all over the charts.\n\nLookin' to piss on these turds going into the summer.  Who goes to Best Buy and buys Quicken and Norton AV in a box?  Your grandma?  Who pays to rent AutoCAD and have their engineering firm's files held hostage indefinitely on Autodesk's cloud storage service?!  No one in their right mind, that's who.\n\nEveryone else has suffered that should have suffered (biotech, Apple, yadda yadda).  Software dinosaurs have not suffered but for Microsoft.\n\nThe rest need to start suffering too, lookin' to get short these pitiful excuses for a dead industry.\n\n", "id": "4adzuw", "created_utc": 1457975536.0, "score": 3, "upvote_ratio": 0.71, "num_comments": 12, "comments": [{"body": "If you think Intuit is failing you're out of your mind.", "score": 5, "replies": [{"body": "Shhh let him lose his money. I want to watch it makes me hard.", "score": 6, "replies": []}, {"body": "Yeah this guy's crazy\n\nGuess he doesn't understand what legacy frameworks are", "score": 1, "replies": [{"body": "I am a legacy framework, 7 years in a dot-com from 1999 to 2006, I'm fuckin' old school yo.\n\nThe software business was shit then and it's more shit now.\n\n*\"Bro, we got some Russian teenagers making this stuff now so yeah it's worse than it was in 2009 but on the upside, you're not paying for it once, you're renting it month to month!\"*\n\n", "score": 1, "replies": []}]}, {"body": "*\"In October 2015, Adobe made its Lightroom photo editing software free for Apple (AAPL) iOS and Google (GOOGL) Android. This move will likely take the company a long way in the mobile and smartphone space, which is currently dominated by Apple’s iOS and Google’s Android. It also explains why it has emerged as the fastest growing app.\"*\n\nPartying like it's 1999!  Nothing says profit like 'free'!\n\nI'm seeing plenty of these stories out there in snooping around the ole news sites.  Since biotech (XBI collective P/E around 20) and solar hippy funtime (value somewhere around bankruptcy) have returned to reality, this looks to be the most overpriced sector.\n\n\n\n", "score": -1, "replies": [{"body": "You do realize Adobe and Intuit aren't the same company right? Intuit offers you free tax filing software (for now, it wasn't like this every year) and if you do something stupid like forget to print out your return you have to shell out $30 to get premium. It's a play to dominate market share before charging money again. It also has a switching cost aka it's a real pain in the ass to switch off of Turbotax once you begin filing using it so many people will stay out of sheer laziness. I concede many biotechs are overrated (REGN) but some certainly aren't (GILD).\n\nEdit: To clarify, Intuit is in the midst of gathering customers to move to a subscription model.", "score": 3, "replies": [{"body": "Yes, I also realize that Intuit spun off a huge future promise from their cloud business, which they will not be the only one to do.\n\nThis is the case with any tech R&D shift in corporate America.  In 1999 anything with the word \"internet\" on it was made of gold even though most had no prayer of profitability.\n\n\"Cloud\" and \"IOT\" are the exact same thing repeated in 2015/2016.\n\nIn the case of Adobe, their expectations are so lofty that at some point the steam will run out.  Then it's back to reality.\n\nMight be Thursday ;).", "score": 1, "replies": [{"body": "Wow you're an idiot and completely out of touch. Enjoy losing money.", "score": 1, "replies": []}]}]}]}]}, {"body": "lmao", "score": 3, "replies": []}, {"body": "snort IBM ", "score": 3, "replies": []}, {"body": "Don't forget about that bloated pig XRT, it's not exactly software, but Best Buy is included.\n\nYou could look at XSW, but 2.3K shares traded today, hahhaha.   That's not a decent volume anything.", "score": 1, "replies": [{"body": "Yeah, there's apparently a shortage of software based ETFs.  IGV is the only one with volume worthy of options.\n\nIndividual turds it is!", "score": 1, "replies": []}]}]}
{"title": "Bought TSLA at 213 before it tanked to 148. Scared don't eat!", "selftext": "[deleted]", "id": "4af4v3", "created_utc": 1457989923.0, "score": 14, "upvote_ratio": 0.94, "num_comments": 5, "comments": [{"body": "[deleted]", "score": 15, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Then trade options", "score": 2, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "[deleted]", "score": 6, "replies": []}]}]}, {"body": "That sounds like a strategy that will work until it doesn't.  TSLA will eventually go BK, but that's aight.", "score": 0, "replies": [{"body": "Its overvalued but its not going bkt.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Yeah, I'm pissed I didn't buy at 140. ", "score": 1, "replies": []}, {"body": "options are a great leveraging tool. Build your networth Im sure your fi will let you buy on margin one day.", "score": 1, "replies": []}]}
