{"title": "Should I buy Netflix stock?", "selftext": "I can afford to buy 2 shares of NFLX stock as of right now at $354/share. Should I go for it? ", "id": "2jj29n", "created_utc": 1413563636.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 21, "comments": [{"body": "Still overpriced son", "score": 9, "replies": []}, {"body": "Middlemen all get squeezed in the end.", "score": 5, "replies": []}, {"body": "This is going to take a few weeks if not months to settle.  You will probably get a shot under 300 at least.  I cant see why it will recover until after their next good earnings report whenver that happens.  ", "score": 4, "replies": []}, {"body": "LOL!!! No. ", "score": 7, "replies": [{"body": "$392 as of now. ", "score": 1, "replies": [{"body": "Why, certainly. 16 days later. LNKD is at $228 from $188, and ZEN is at $26 (up from $22). Horrible choices for investment. I would not have recommended any of them. \n\n\nI quote myself from two weeks back:\n\n*NFLX could totally rebound ... and STILL be a poor choice. If it gained +70 points over the next week, it is STILL a poor choice for investment. Why? Because no dividends, and it's (IMO) far overpriced for its intrinsic value, and lost opportunity costs in much higher quality stocks.*", "score": 1, "replies": [{"body": "NFLX isn't a \"long term\" stock in that respect. It's a Momentum stock to build capital. The percent gain in the stock is where you make your big bucks. ", "score": 1, "replies": [{"body": "That's only if you time it right. They have this weird tendency to hug the envelope, and there is practically no warning when they drop or rise. Their unpredictable trajectory is a serious problem for a momentum investor like myself - my technical indicators aren't helpful, here. They had a clear channel between $416 and $484 for months, but that went out the window with the huge drop. Combined with their fundamentals, they are a gamble to play. They could easily hit resistance at $416, and never regain that lost ground. If they had clearer tells, sure, the potential for profit is there. But that comes with a huge dollop of risk, and at $400 per share, there are many other, safer choices out there that will turn a nice sum. \n\n\nI don't even know what to make of the past two weeks, except that the market and a lot of stocks are headed upwards. I predict some sad faces on Wednesday, though. ", "score": 1, "replies": []}]}]}]}, {"body": ">LOL!!!\n\nReally, kid? Thanks for your valuable input. ", "score": -5, "replies": [{"body": "Come on, be serious! A BUY? After gapping down 25%? Then you look at their candles .. steady steady BOOOOM!  Plus, you are asking the Internet if you should buy a stock, with no qualifiers. \n\n\nIf you trade on the candles, you know that a gap down typically is a new level of resistance. You also know that this is a general rule that can be broken. So candle charting might not be in your skillset.\n\n\nIf you trade on technicals, you know that an RSI under 30 is generally a \"Buy\" signal, but the vector on the MACD indicates more loss ahead. So Technicals might not be your skillset.\n\n\nIf you trade on the fundamentals, you know that NFLX produces no dividend and they have negative free cash flow. So Fundamentals may not be in your skillset.\n\n\nYou can learn candlestick charting by reading Steve Nison's book, \"Japanese Candlestick Charting techniques\".\n\nYou can learn Technical Analysis by reading \"Technical Analysis for Dummies\".\n\nYou can learn Fundamental Analysis by reading \"Fundamental Analysis for Dummies\" - I'm reading that book now, because intrinsic value is important to trading, even for me. \n\n\nNFLX could totally rebound ... and STILL be a poor choice. If it gained +70 points over the next week, it is STILL a poor choice for investment. Why? Because no dividends, and it's (IMO) far overpriced for its intrinsic value, and lost opportunity costs in much higher quality stocks. \n\n\nIf you are going to gamble, try LMT (Lockheed martin), or RTN (Raytheon). RTN just got a contract for some missiles.\n", "score": 4, "replies": [{"body": ">Because no dividends\n\nWhat is with your fascination with dividends? All companies that don't pay dividends are a bad buy? The order of your sentence should've been valuation first, then icing on the cake (like dividends). The way you have it seems to imply that you think a dividend outweighs valuation. Paying out a dividend essentially means the money is taking away from its growth potential - rather than reinvest the money in itself, it gives it to shareholders, effectively losing company value. Unless you reinvest the dividends, you're scaling down your position every quarter too. Also, the reinvested dividends is basically the exact same performance as if the company didn't pay a dividend in the first place and instead reinvested in itself - hell, it may even be worse. \n\nIf you have a company that has tons of cash and limited potential future growth, sure, a dividend is icing on the cake for an investment... but it shouldn't be a principle consideration unless you fundamentally misunderstand dividends.", "score": 2, "replies": [{"body": "So true!\n\n\nValuation came afterwards because I was never educated on the importance of valuation, but I am reading up on it now. So that's why I wrote Dividends first, Valuation second, even though valuation is clearly more important. I swing trade - so a dividend payout is my \"consolation prize\" for having to hold something longer than I would like. \n\n\nOne of my goals is being able to use a valuation model to at least ballpark a stock's intrinsic value and also get a better handle on fundamentals. Even for swing trading, it's nice to know if a company is headed for stormy weather or if the future couldn't be brighter (realistically). ", "score": 2, "replies": []}]}]}, {"body": "Lol and thank you for your valuable post! No one knows the answer to your question, if they did, they would make millions off of said answer. Even if you were looking for a discussion, you could have at least provided some of your own thinking instead of expecting to have your hand held as you throw money at stocks blindly.", "score": 3, "replies": [{"body": "All I asked was the opinion of this subreddit. You don't have to be such a fucking cunt about it. Jesus Christ. ", "score": -2, "replies": [{"body": "So you can be a cunt but I can't? Virgin Mary.", "score": 2, "replies": [{"body": "There's a difference between being sarcastic and being a nasty fuck like you are being. ", "score": -2, "replies": [{"body": "[http://i.imgur.com/pJy8YLV.jpg](http://i.imgur.com/pJy8YLV.jpg)", "score": 6, "replies": []}, {"body": "Lol who was the first to swear and call the other a derogatory name? Please show me where I was a \"nasty fuck.\"", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Do your own analysis.  I bought a bit.  I don't think they had a bad quarter - they weathered raising revenues alright.  But it's not just about quarters, it's about long term.  Netflix is also handling all these extra charges from ISPs and becoming a force.  \n\nThe same people saying it's overpriced have been saying Amazon has been overpriced for the last 10 years.  ", "score": 1, "replies": []}, {"body": "Buy $TSLA:\nNot all were in panic this week.\nA bullish article on Tesla published 2 days ago before markets opening:\nhttp://iknowfirst.com/tesla-stock-forecast-algorithmic-prediction-bullish-tesla\nTesla traded that morning around $220 levels, now TSLA@234,\n5.5% gain in 2 days.\n", "score": -1, "replies": [{"body": "I know they hit 218 two days ago! ", "score": 3, "replies": []}]}]}
