{"title": "which indicator do you use to know when the pump's gonna end? when the momentum is about to stop?", "selftext": "let's take  as an example  Tesla.. if  there  wasn't  the corona virus pandemic  which  indicator  would you have used   in order  to know when  to exit  from this ''irrational pump'' ? \n\n How  to know when  the trend  is  about to run out  of  fuel?", "id": "g02mli", "created_utc": 1586718329.0, "score": 20, "upvote_ratio": 0.76, "num_comments": 38, "comments": [{"body": "Gut feeling.  Seems as good indicator as anything nowadays.", "score": 18, "replies": [{"body": "And it is always wrong", "score": 11, "replies": [{"body": "I should have inverse’d my gut every time for the past 3 weeks.", "score": 6, "replies": []}, {"body": "Maybe it’s hangry, feed it more.", "score": 3, "replies": []}, {"body": "Market is random, it can't be always wrong.", "score": 1, "replies": []}, {"body": "Usually just inverse whenever wsb is peak bear/bull for a whole week or so.", "score": 1, "replies": []}]}, {"body": "People believe this but RenTec would like to have a word with you", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "I'd be interested in learning more about how this chart works, and what you mean by 90% - any reading material?", "score": 8, "replies": [{"body": "It’s tracking sentiment", "score": 2, "replies": []}]}, {"body": "Interesting chart. Care to explain more on the other numbers aside from the 93.33% percentage?", "score": 6, "replies": [{"body": "If the sentiment is 93% bullish GTFO because \"Buy when others are fearful, sell when others are greedy\"", "score": 2, "replies": [{"body": "So 50-70 I assume that means stay the course? How about when it is at 86 now?\n\nAnd 0-20 means buy in?", "score": 1, "replies": [{"body": "You need to have your own criteria and come up with your own analysys, what you could do is compare this graph with SPY and see how SPY usually reacts", "score": 2, "replies": [{"body": "Alright. Thanks for your help!", "score": 1, "replies": []}]}]}]}]}, {"body": "Soooo, this is saying the market is about to shit the bed?", "score": 4, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Gotcha. Any insight on how this is impacted by the Fed's pumping though? I guess since it is so unprecedented and all it is a hard call either way?", "score": 3, "replies": []}]}]}, {"body": "Awesome insight. I wish I had known this indicator existed on the 23rd. Anyone got a time machine? For what it's worth this is good condition bias on my short positions right now ;)", "score": 1, "replies": [{"body": "Elon musk is working on one", "score": 1, "replies": []}]}, {"body": "Wait.  There is 93.3333% bullish sentiment?  WTF? And it was 0 a few weeks ago???", "score": 1, "replies": []}, {"body": ">https://stockcharts.com/h-sc/ui?s=$BPINDU\n\nThat chart crashed on march 16th. Bottom was march 23rd. Might as well just catch it on the way up then, eh?", "score": 0, "replies": []}]}, {"body": "I use a mix of fundamentals and sentiment analysis personally. I consider technicals a little, but not as much as fundamentals or sentiment.\n\nFirst thing I to do is calculate my own valuation which I use as a starting point to set a price target. If the stock hits that target I will sell as I believe it's at that point the stock starts to become a liability to hold as risk begins to outweigh reward. I change my price targets frequently on new data, but I always have an exit strategy in place.\n\nWith a fairly stable stocks like Google I find I constantly raise my price target and so it ends up as long term hold. However TSLA is one of those names where it will often hit my price target and I'll sell and try to buy back in later.\n\nAs a general rule, if I see extremely bullish sentiment I tend to lower my price target because once sentiment is at its peak the only place it can go is lower. Similarly, if a stock is getting a lot of unfair hate I tend to raise my price target. It's a little more complicated than that though, but I'm not sure I could really explain exactly what I do. I know I trust my gut about sentiment a lot more than I'm comfortable with.\n\nMy main advise would be to not try selling at the top. Try to sell at the place where it starts to become too risky to hold the investment. I sold TSLA last year when it reach around $450~. And that may seem like a bad move in hindsight because it ended up reaching $900~, but at that point I was 50% up on the trade and the risk/reward of it going even higher was far higher than the risk/reward I could have got from other stocks. You'll make more money overtime by trying to maximising your portfolio's running risk/reward then the total reward of any single trade. If you think there is a 75% chance that a stock will go up you should be selling and buying a stock you think has a 90% chance of going up.", "score": 4, "replies": []}, {"body": "Volume. Look at $SPY and how weak it's been over the course of this run up since March 23rd.", "score": 3, "replies": [{"body": "Volume is the only reliable indicator, everything else is psychology.", "score": 4, "replies": [{"body": "Curious about this. Can you expand on this, what would high/low volume mean then?", "score": 1, "replies": [{"body": "Stocks usually move between price action points under high volume, and coast stable or slightly lower under without volume.\n\nEssentially, this means that low volume stocks are essentially in maintenance mode and our job is to decide which ones to buy into or sell out of before or right after the next volume spike.\n\nIt's like electron chemistry... Every atom/molecule has stable states and volume is the energy being put in or pulled out to create a state change.  Not enough volume, change is minimal or just entropy...\n\nThis is the physics of stocks.", "score": 8, "replies": [{"body": "Albert Einstock", "score": 5, "replies": []}, {"body": "Unless you get a hot tip from the CEO of the NYSE that the pandemic is about to lead to collapse.  Then, it's a no brainer.  Especially when that NYSE CEO got the info from his wife, a Senator sitting in on the intel meetings.  They should both hang.  And the recipients of the tip should be forced to regurgitate the profits and pay a penalty of 200%, to bankrupt them and teach their buddies they must play fair.\n\nIMO, this one act by the CEO to a couple of his buddies at Goldman, and the ilk, led to shorts, puts and sales of positions.  Truly, they too should be hung.  They all cheated every other player by front running the game.", "score": 2, "replies": []}]}, {"body": "High volume is confidence, low volume is weakness.", "score": 1, "replies": []}]}]}]}, {"body": "What about RSI?", "score": 1, "replies": []}, {"body": "In general the overbought and oversold indicator can be applied to most stocks, \"williams %r\"", "score": 1, "replies": []}, {"body": "Car sales are plummeting as of this moment and they will take months to recover. And when people affected by the recession need a new car and have to choose between a dream Tesla using credit to their limit or a cheaper Toyota I think I know what they are going to do. Every day that goes on increases the chances that the stock goes down by 30-40% but there are dozens of factors into play and it can take weeks or months. If someone has the magic timing indicator I don't think he will share it here :)", "score": 1, "replies": []}, {"body": "One space", "score": 1, "replies": []}, {"body": "A legendary trader once told me: “sell when you want to buy and buy when you want to sell”, it works like a charm", "score": 1, "replies": [{"body": "Except I want to do both", "score": 1, "replies": []}]}, {"body": "The angle of the short term parabolic growth curve", "score": 0, "replies": []}, {"body": "How tight my sphincter is or isn’t", "score": 0, "replies": []}, {"body": "Tesla is a bubble (stemming away from fundamentals) its going to stop when the recession hits and they need to raise cash or Elon has to buy more shares", "score": -3, "replies": []}, {"body": "the sound of brrrrrr", "score": -6, "replies": []}]}
{"title": "Tesla Model Y vs Model 3 casting comparison shows that legacy auto’s ‘soil-your-pants’ moment is at hand", "selftext": "", "id": "g02k8y", "created_utc": 1586718123.0, "score": 113, "upvote_ratio": 0.95, "num_comments": 50, "comments": [{"body": "Link to Sandy’s channel where these vids are and Teslrati got their info.  Guy needs the clicks.\n\nhttps://www.youtube.com/channel/UCj--iMtToRO_cGG_fpmP5XQ", "score": 38, "replies": []}, {"body": "Yeap! Most people still don't understand what is coming, although in many ways it's already here. Many automakers will go bankrupt and Tesla will not only be the largest automaker in the world, but also the largest company that has ever existed. By far.\n\nEdit: Its hilarious how differently it's received when I make a comment like this in this sub to when I make one on any other sub :D", "score": 67, "replies": [{"body": "SpaceX might become bigger, but yeah. 🤠", "score": 22, "replies": [{"body": "Could be, but not necessary at all. The difference is that Tesla's path has become much more clear already so I can confidently make the statement I made.", "score": 8, "replies": [{"body": "> Could be, but not necessary at all.\n\nVery much so, hence the \"might\" qualifier. 🤠\n\n> The difference is that Tesla's path has become much more clear already so I can confidently make the statement I made.\n\nAbsolutely, although for SpaceX Starlink has become very clear as well, and that's a trillions of dollars market right now as well, with no realistic competition in sight **at all**.\n\nIn the longer run, \"SpaceX Industries, headquartered at Olympus Mons, UMJP (United Mars and Jovian Planets)\" doesn't sound small either.", "score": 5, "replies": [{"body": "\"Today, for his 493rd annual address... BDFE Elon Musk will address the recent Belter declaration of independence. A Neuralink level three presentation environment will be available, for those appropriately fitted.\"", "score": 3, "replies": []}]}]}, {"body": "True, interplanetary travel will bring in the big bucks...", "score": 2, "replies": [{"body": "Space Internet is where the bux are.", "score": 5, "replies": []}]}, {"body": "Then merged HBTX (HyperBoringTeslaX)", "score": 1, "replies": []}]}, {"body": "> Tesla will not only be the largest automaker in the world, but also the largest company that has ever existed. By far.\n\nThe Dutch East India Company was worth about $8.3 Trillion, adjusted for inflation.", "score": 18, "replies": [{"body": "Wow", "score": 2, "replies": []}, {"body": "yeah and basicly goverment owned", "score": 2, "replies": [{"body": "Yeah, maybe analogous to the Saudi oil company that recently went public -- Aramco -- which is 98.5% owned by the government, I think.", "score": 5, "replies": []}]}, {"body": "I wasn't counting it, but I believe that Tesla will be worth more than that in the decades to come.", "score": -4, "replies": [{"body": "That’s an extremely bullish view.  I’m long but 8.3T? That’s a stretch even by ARK standards.", "score": 3, "replies": [{"body": "Ark's golden goose scenario puts Tesla at around 3.5T in 5 years. Their base scenario puts it at around 1T. So I don't see how it's a stretch by Ark's standards to say Tesla will be worth many trillions in the next decades.", "score": 1, "replies": [{"body": "I'm hoping it happens, don't get me wrong and I'm not saying it won't be worth trillions.  But more than $8.3T in our lifetimes?\n\nHere are the ark estimates: [https://i.imgur.com/V4Lxf3q.png](https://i.imgur.com/V4Lxf3q.png)\n\nBase case (most likely) is $612B ($8.3T is 14x bigger).  Their golden goose, everything goes right and stars align (unlikely to happen) is still only half way there.\n\nOnly four companies in the modern era have hit the $1T mark.  It took Apple 39 years to get there, MS 34, Amazon 23, and Google 16.  A lot has to happen for these companies to double in size from here, and there is no guarantee that all four of them will.  So for Tesla to hit $8.3T everything has to go right for many years and they have to grow into a company far beyond the value of tech giants like those four listed.  Then it has to double again from THAT point.\n\nThat is why I think it's an extremely bullish view.  Impossible?  No  Unlikely? Yes.", "score": 1, "replies": [{"body": "Dude, Ark projection are for 4.5 years from now.  I am talking within the next few decades. Realize that.", "score": 1, "replies": [{"body": "I hope you're right, stock has to hit $46K/share given float today (75 fold increase over today).  I think I'll sell well before then and enjoy my retirement :)", "score": 2, "replies": [{"body": "Yeah mate I know, it sounds crazy and nothing is certain, but this is my belief according to the data and my projections for the future. Let's see!", "score": 1, "replies": []}]}]}, {"body": "Yeah, but like the effects of a prolonged CV lockdown, we're in uncharted territory.\n\nI can't think of when a company had the potential to pull Apple-level margins from such high value products.... across multiple industries.  All the while, going so vertical as to potentially set new standards for low cost of manufacture.  If there was a company to go there, this is what it'd take.", "score": 1, "replies": [{"body": "That is why I have a significant % of my investments in TSLA.  I too think this company will climb much higher from here.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "That could take up to a decade to play out in my opinion. I understand this is a buy-and-hold stock (and an incredible one at that) but that's why so many people doubt Elon & Tesla. We're in it for the long game but Elon's making statements like \"functionality for robo-taxis in 2020 is ready, we just need regulatory approval,\" and the hype around Tesla living out it's underdog story makes it seem overvalued and it makes us look like fanboys. I'm aware it's all going to come to fruition, it's only a matter of time, but it's going to take far longer than what we make it seem. That's all.", "score": 3, "replies": []}, {"body": "Most people can't see what's coming in the next hour, far less in 10-15 years...\n\nThen they go on and criticize those trying to change the world (like Tesla with FSD) and when it's finally a reality they take it for granted. Then, 10 years after it's everywhere in society, they're like : \"I should have invested in it\", and they finally buy the stock while they miss the next train to the moon.", "score": 3, "replies": [{"body": "Precisely old timer.", "score": 3, "replies": []}]}, {"body": "I don’t think many people doubt the quality of the design, battery technology and a lot of the other parts of Tesla. I think the design is great! \n\nI think there’s a big question on the supply chain and operations side of the house still and keeping costs down.", "score": 2, "replies": [{"body": "In my view, with the extreme vertical integration culture that Tesla operates, Tesla is the least likely automaker to face supply chain issues in the future. Also, in the last quarters Tesla has demonstrated stellar capabilities to efficiently drop their operating costs while growing exponentially. I don't see where the problem is in those areas and why you would say that.", "score": 10, "replies": [{"body": "They’re getting better for sure. I say that from anecdotal conversations with people inside Tesla and at their suppliers. The demand planning is garbage, the pricing is not competitive, they just seem to be struggling with some things still. I think they will get better over time, an automotive supply chain is deep and complex so it will take some growing pains.", "score": 2, "replies": []}]}, {"body": "But that’s the point of him saying that. It’s talking about the manufacturing efficiencies and cost savings that they have already incorporated into the Y. The trunk alone went from hundreds of parts to like 4 or 5. This not only saves them money on both parts and labor but also simplifies the supply chain. They have done similar things with most of what sandy had said they needed to fix.", "score": 2, "replies": []}, {"body": "Thats where vertical integration is key.", "score": 1, "replies": []}]}, {"body": "Bigger than Microsoft? Bigger than Amazon?", "score": 1, "replies": [{"body": "My two cents is that people will be rubbing their eyes in disbelief in a decade at how large Tesla will be. We are on the verge of a new industrial revolution and Tesla is poised to become the first and largest benefactor of this revolution. Valuations of entirely different magnitudes than today will be possible soon. I believe Tesla withing the next 20 years or so, is likely to reach market caps in the order of at least 6-10 trillion.", "score": 7, "replies": [{"body": "Because we'll keep printing money, so dollars will be worth less? Or a trillion in today's dollars?", "score": 6, "replies": [{"body": "Today's.", "score": 2, "replies": []}]}, {"body": "I'd guess closer to $2T.", "score": 6, "replies": []}]}]}]}, {"body": "What is the TLDR comparison? It wasn't clear from a quick skim of the article.", "score": 8, "replies": [{"body": "Car expert that tore down model 3 sent Elon a list with 300 things wrong with it. They are all fixed in the model y. And some stuff even exceeds his expectations.", "score": 35, "replies": [{"body": "I've only seen his Model Y videos, but he's hardly said a bad thing so far /any possible improvements. I get that it's a better vehicle, but is there any way that it's perfect? Seems like he's not being fully honest? I guess I'll hold that thought until the end of his review in case he makes some overall recommendations.", "score": 11, "replies": [{"body": "Well, compare it to his model 3 teardown. He thought it was rubbish until he got to the power train.", "score": 13, "replies": [{"body": "How does this translate for the user? What real world benefits should I be seeing between the Y and 3 as an owner? I get that the Y might be comparatively easier or cheaper to manufacture, but how do these underbody improvements materialize day to day? \n\nReliability beyond 200K miles? Stronger structure for accidents? Like if that’s the only case, then most users won’t even feel the benefits beyond technological additions like the heat pump and heated radar per se.", "score": 2, "replies": [{"body": "The company will still exist in the years to come, thats a benefit i would value a lot as a consumer..", "score": 3, "replies": []}, {"body": "Better repair service", "score": 5, "replies": []}, {"body": "He showed several things that he said were huge improvements in terms of safety. Also, it’s just a very well built car. And less likely to have manufacturing issues. So maybe not you personally, but it definitely helps model Y owners as a whole.", "score": 2, "replies": []}, {"body": "Y will be more solid and quieter (as preliminary reports suggest).\n\nBut the biggest benefit, is that it is cheaper for Tesla to produce. Or to be accurate, it is the same cost as a model three to produce, even though it is a larger vehicle, with some other advancements over the model 3", "score": 1, "replies": []}]}, {"body": "Good call. Will search for that (the channel I see his model y stuff is no other cars, but I didn't bother to look up his stuff more broadly).\n\nEdit: so odd. When I visit his channel now, I see way more videos. Not sure how I missed then before. Oh well thanks for the suggestion.", "score": 1, "replies": []}]}]}, {"body": "*200, allegedly, btw. But point still holds.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "by a BIG margin", "score": 4, "replies": []}]}]}, {"body": "Tesla's just get better, gas cars are trash forever", "score": 7, "replies": []}, {"body": "As far as I can tell, he points out that the model 3 used techniques that were not state of the art even when it was built.   I expect that that is because this was their first all-steel build, and their first high volume build, and they focused on getting the product out over perfection, which makes sense, as they were setting up the lines.  \n\n\nThe model Y teardown shows that they have improved processes -- it should make the build a bit lighter, and a bit more cost-effective.  \n\n\nThe video didn't imply that this was revolutionary -- just that Tesla had caught up to the other automakers in this specific category.", "score": 1, "replies": []}]}
{"title": "The Fall of the US Banking Sector", "selftext": "Over the last 20 years we have noticed interest rates have been much lower than the previous 20 years, reaching new lows after each cycle. Accommodative monetary policies have become the standard tool to jumpstart economies after each downturn. This is no different in 2020 as we feel the effects of COVID-19 where long term interest rates have again fallen to the same levels as those experienced in the GFC. Low interest rates usually stimulate the financial equities markets by increasing spending and credit, lowering the discount rate and making the higher returns provided by equities more attractive. However, do we see the same effects in the banking sector which has a unique and more direct relationship with interest rates?\n\nInterest rates in Japan and Europe have been at or below zero for the last decade which has also coincided with significant downwards pressure in the stock price of each regions banking sector. I want to investigate the validity of a causal effect in this relationship and how it may affect US banks in the next decade as the US heads back towards the zero lower bound and potential negative rate territory.\n\n**Banking Sector Performance in a Low Interest Rate Environment**\n\nFollowing the global financial crisis all three bank indices in the US, Japan and Euro area saw their prices drop more than 60% (see Fig. 1). Banks in Japan and the Euro area never saw their prices make meaningful recoveries since in the backdrop of zero to negative interest rates. However, banks in the US recovered to their 2007 highs in the backdrop of increasing interest rates. \n\n[Figure 1: Central Bank Interest Rates and Performance of Bank Indices Over 20 Years](https://imgur.com/Cu3fCE6)\n\n\nAn argument could be made that this could simply be a reflection of the US stock market having had one of the best bull markets this last decade whilst both Japan and Euro stock markets have struggled. The counter argument is that although the US bank index (KBW) has largely tracked the US market index (SPY) both the Japan and Euro bank indices (TOPIX and SX7E) have de-coupled from their respective market indices (Nikkei and EURO Stoxx 50). Both the Nikkei and EURO Stoxx 50 have largely recovered their losses from the GFC but again the banks in either region have not. \n\n[Figure 2: Performance of Bank and Market Indices in Japan, the Euro Area and the US](https://imgur.com/G263RPz)\n\nAnother argument one could make is that the difference in price growth could be due to a result of the proliferation of share buybacks that has occurred in the US stock market compared to that of Japan and the Euro area. Banks also usually yield high dividends which are not reflected in the chart in Fig. 1. I don’t have the data to explore the impact of share buybacks and dividends further, but I assume the significant divergence in the indices are little explained by share buybacks and dividends alone.  \n\nFor the same trends we see in Japan and Europe to hold true in the US an assumption must be made that the Federal Reserve (FED) will hold interest rates near or potentially even below zero for a significant period. I believe there is a high probability that this will be the case as we saw in 2018 tightening monetary policy resulted in fear in the financial markets. It will become ever more difficult for reserve banks to unwind reserve assets and pull back from accommodative policies as low interest rates become the framework on which the new economy is built on. \n\n**Interest Rate Effects on Bank Profitability**\n\nFirst, I want to examine the effect of reserve bank interest rate policies on bank profitability. The impact that interest rate changes will have will depend on a range of variables such as the banks asset and debt portfolio, the maturity gap between its assets and liabilities and non-interest portion of income (such as fee income for products and services). \n\nThe effect of lower interest rates on profitability come directly from the level of rates and the yield curve. The effect of the level of interest rates can be summarized as follows:\n\n* Banks partially fund their operations with retail deposit at rates set as a markdown on market rates. This markdown is compressed as interest rates decrease because the deposit rate cannot fall below zero. Therefore, as interest rates decrease, the net interest rate margin on banks also decreases. \n\n* Lower interest rates will generally induce more lending and investments in riskier assets in search for higher returns. This is the whole point of accommodative monetary policy (low interest rates) and may increase net interest rate margins. However, this depends on economic conditions as a weak economic outlook (precisely the reason why rates may be low) can limit demand for loans. \n\nThe effect of the yield curve is explained by the operation of banks taking short-term loans and granting longer term loans. Therefore, net interest rate margins are compressed when the yield curve flattens and increased when the yield curve steepens.\n\nIf we examine the net interest rate margin of banks in all three regions, we see an overall downtrend, in-line with that of central bank interest rate policies (see Fig. 3). The net interest rate margin is lowest (Japan) for the region with the lowest average interest rate over the last 20 years and vice versa (US). The average net interest rate income growth follows the same trend, where the growth is lowest (Japan) for the region with the lowest average interest rate over the last 20 years and vice versa (US). \n\n[Figure 3: Interest Margins and Net Interest Income Performance over the Last 20 Years](https://imgur.com/qa6tGk2)\n\nIn all three regions, despite a low interest rate environment, the average net interest income portion of total income remains steady (except for the period following the GFC). Banks have seemingly not been able to supplement the loss in net interest margin with non-interest income through this period. \n\nIn conclusion there will likely be downwards pressure on the income and share price of bank stocks in the US in the next cycle. I don’t believe we will see the same catastrophic failure of the banking sector like we saw in the GFC. Banks are extremely well capitalized with healthy liquidity and stable funding rates following the GFC and resulting stringent regulations through Basel III. Liquidity issues have been further dampened by the FED initiating ‘infinite QE’ and buying up seemingly every type of asset save for equities.\n\nTLDR: Banks fcukd, buy calls.", "id": "fzs0eg", "created_utc": 1586674916.0, "score": 58, "upvote_ratio": 0.87, "num_comments": 39, "comments": [{"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 38, "replies": [{"body": "Good bot.", "score": 8, "replies": []}]}, {"body": "Aren’t you guys tired of these doomsday theory’s ..it’s obviously not gunna crash until 04/20 duh", "score": 38, "replies": [{"body": "Day after all the 4/17s expire", "score": 19, "replies": []}]}, {"body": "Haha you guys are funny, if I had to make a recommendation I'd buy extremely long dated puts. I'm definitely not saying this is gonna crash in a ball of fire next week. This is a long term prediction of the entire banking sector and I would simply not invest long term in this sector at this point.", "score": 21, "replies": [{"body": "Will we see some red days next week?", "score": 3, "replies": [{"body": "Dude we are never going to see red days again. Jerome Powell is here to save the day.", "score": 23, "replies": [{"body": "You will still see the red day in your account though", "score": 3, "replies": []}, {"body": "Yup op is stupid. The feds will bail anyone out. Anyone who think they feds won’t hesitant to bail out banks is silly. They did it in 2008 and they will do it again. Not to mention there is way more popular support now", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "He is saying faz prob not good either. The descent may be so slow that puts aren't good either. He is probably just saying banks will never return to their former glory. I tend to agree.", "score": 3, "replies": [{"body": "Yup, that's exactly what I'm saying.", "score": 3, "replies": [{"body": "Good writeup bro thanks for putting it together", "score": 5, "replies": []}]}]}]}]}, {"body": "Does this happen Monday? My puts could use an answer", "score": 8, "replies": []}, {"body": "Buy calls for earnings and puts long term = print. Ur welcome", "score": 6, "replies": [{"body": "But seriously, this.", "score": 2, "replies": [{"body": "You two are like dumb and dumber", "score": 1, "replies": []}]}]}, {"body": "So.... calls?", "score": 8, "replies": []}, {"body": "GFC = Geezus Fucking Christ\n\nTook me a minute, but I figured it out.", "score": 4, "replies": []}, {"body": "TL DR OR BAN!!\nPOSITIONS OR BAN!!", "score": 19, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Why would you use arrows over guns...", "score": 3, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Umm just bury them in your backyard and say you lost them if it comes to that \n\nI guarantee you no one will be turning guns in while shit is hitting the fan", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}, {"body": "Molon Labe. Lol", "score": 1, "replies": []}]}]}]}, {"body": "Finally found a banking post:\n\n[Credit is 🥶 ](https://www.investing.com/news/stock-market-news/exclusive-jpmorgan-chase-to-raise-mortgage-borrowing-standards-as-economic-outlook-darkens-2137836) \n\n#Puts \n\na whole new spin on Brrrrrrrrr happening in the markets now.\n\n^(see whut I did there)\n\nEdit:\n\n> Banks are extremely well capitalized with healthy liquidity and stable funding rates following the GFC and resulting stringent regulations through Basel III. Liquidity issues have been further dampened by the FED initiating ‘infinite QE’ and buying up seemingly every type of asset save for equities.\n\nNobody tell him about the shit ton of easy credit (subprime auto, furniture, etc.) debt and shale oil financing that’s like a lighter fluid soaked BBQ pit waiting for a match.", "score": 3, "replies": []}, {"body": "“BaNkS aRe ExTrEmElY wElL cApItAlIzEd” when everyone says shit like this even tho they have no idea what banks’ exposures are, THAT is when you need to get worried. never forget cramer recommending bear stearns right before it went bankrupt.", "score": 3, "replies": []}, {"body": "Great post!", "score": 2, "replies": []}, {"body": "So make sure to load up on 4/17 bac 28c gotcha", "score": 2, "replies": []}, {"body": "Banks will never collapse as long as  central gov gives them loans which they will unless u r a private bank . It’s that simple", "score": 2, "replies": []}, {"body": "Your argument is flawed due to the assumption that interest rate changes are here to stay", "score": 2, "replies": []}, {"body": "The big unknown is do we get low, negative rates for a while or do we eventually get global inflation as governments run trillion dollars deficits.\n\nIf there's no inflation, governments won't have any reasons not to have huge deficits. They'll cut taxes, spend money.\n\nOnce there is inflation, central banks might not raise rates for a while but eventually they will have to.", "score": 2, "replies": []}, {"body": "STONK UP OR DOWN???", "score": 2, "replies": [{"body": "S I D E W A Y S  B R R R R R R R R R R R", "score": 3, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "What impact do the different regulatory environments have?", "score": 1, "replies": []}, {"body": "The reason US performed better than Europe and Japan is because of USD being the world's major reserve currency. There is a status quo of the world (mostly Asia) using USD earned from selling goods to US to buy all kinds of US assets. This flow of goods and capital is continuous unlike Japan and Europe who are on their own.\n\nUS interest rates getting lower and lower is not only pumping liquidity into US economy but also into world trade, particularly on the \"special relationship\" between US and Asia (China/Japan). As China was willing to do whatever it takes to grow through steering state-directed capital into infrastructure and what not, the flow of capital from China back into the US has benefited from the massive expanding of Chinese economy and Chinese production / development.\n\nHowever, the more liquidity you have, the less return on investment you will experience eventually. And China has long decided to gradually wean off its addiction to cheap debt or stop low-cost credit creation being a big portion of their GDP. They want to redirect that excess production for the American market towards their booming middle class and its growing demand instead. This spells trouble for when the U.S goes into negative interest rate territory. The excess liquidity will outpace demand of world trade and capital flow.\n\nEither the world has to wean itself off the addiction to the USD in conducting trade or will face off a worse reality - having to constantly scramble to park their cash (any currency really as they all have to follow the lead of USD) into assets to avoid the effect of USD loosing value while still conducting trade through the USD.\n\nTLDR: asset prices to the moon.", "score": 1, "replies": []}, {"body": "this is the kind of shill post that is the hallmark of this sub. Follow his advice at your own peril.", "score": 1, "replies": []}, {"body": "Stimulus flows through the Banks, and they pay dividends, and investors want the juice now more than ever.  Nobody cares about the long position, it is evident in options prices and deltas.  A long position is better off in shares, otherwise you're wasting your money letting it sit when we're seeing weekly fluctuations big enough to make fortunes.  Your advice to buy long dated puts is retarded, just wait until they are about to go down, then buy your puts.", "score": 1, "replies": []}, {"body": "priced in", "score": 1, "replies": []}]}
{"title": "Chinese ADRs: If you can't say something nice...", "selftext": "Good weekend autists,\n\nIt's Kimchi with a quick little bit of helpful advice (though may be a bit late for those of you $LK bagholders this time around) regarding Chinese ADRs and the first thing you should check before ever diving into a Chinese company.\n\nThis isn't a full write-up like my oil contango [explanation](https://www.reddit.com/r/wallstreetbets/comments/ft1tz0/carry_on_my_wayward_son_why_term_structure_will/) or my [story-time](https://www.reddit.com/r/wallstreetbets/comments/fxrc95/hitler_cuckoldry_and_racecars_the_story_of_the/) on the greatest short-squeeze of all time, but don't worry... I have a post in the works on \"Equity Risk Premium: Why Stonks Only Go Up (Until They Don't)\" that should be posted up soon-ish.\n\n**Chinese Stonks**\n\nSo there's a subset of you guys who are of the \"all Chinese companies are scams\" mindset... and that's OK. If you don't like quick moving, high octane companies with grandiose expectations of growth... go check out r/investing. I'm sure they'll welcome you with open arms.\n\nThat being said, I don't trade Chinese companies at all, but there's a guy on my desk who trades only Chinese companies (ADRs, A-H, etc) and I occasionally go over to shoot the shit when I'm bored at work. We were chatting a few months back (didn't really think much about it back then... recalled the conversation after the $LK debacle) and we ended up on the topic of ADRs\n\n**Conversation**\n\nKimchi: Dude so $TSLA is fucking killing it... how's $NIO doing?\n\nChinese Trader: *Blah blah blah...Something about balance between cash crunch and high sales*\n\nKimchi: What about $BABA? Haven't heard anything lately\n\nChinese Trader: *Something about transition after Jack Ma retirement*\n\nKimchi: How about $LK... seems like they're killing $SBUX\n\nChinese Trader: *Dude.... don't touch $LK*\n\n**Chinese ADRs, Patriotism and Sell-Side Coverage**\n\nThe thing about Chinese sell-side companies (and most of the sell-side in Asia) is that they're not typically allowed to say shit about their own. Part of it is b/c they're trying to get business from the companies they cover and part of it is b/c Big Brother typically frowns down on sell reports.\n\nFor example... the big boy on the block of ADRs is $BABA. $527bn or so in market cap, it's going to have a couple of companies covering it, right?\n\n[$BABA analyst recommendations](https://preview.redd.it/tklcbk3oxcs41.png?width=1502&format=png&auto=webp&s=fec36ef2522ab289f8f92ae864868640d74e0e2c)\n\n64 public sources w/ 100% buy ratings. Whether that's b/c they really believe $BABA can only go up... or because they want those #JackMaTendies... well who knows.\n\nOk then... what about another company that's been in the news... $IQ?\n\n[$IQ analyst recommendations](https://preview.redd.it/aum6zm7kycs41.png?width=1504&format=png&auto=webp&s=9f1f55e89cea213c072fb8a94b0a67b4bede58f7)\n\nOK... this is a bit more like it... a couple hold recs, but note that most Chinese sell-side firms still have a \"Buy\" on the name. 23 public ratings on the name.\n\nWhat about a smaller, shittier company that most people don't know about? Say like a $600m market cap company like $DQ? (Note: Just an example, **not** a recommendation)\n\n[$DQ analyst recommendations](https://preview.redd.it/rdq1ei4fzcs41.png?width=1484&format=png&auto=webp&s=ced031f8875ea8f529b79811dd5659dda2977e60)\n\nOK... now we're getting to a company that's small enough that not too many people cover it. Still all Buys and a couple Chinese sell-side companies covering the name.\n\nSo if a micro-cap like $DQ had 12 companies covering it, including 6 Chinese firms... a company like $LK that had a $12bn market cap at its peak should've had a ton more, right? *Wrong.*\n\n[$LK analyst coverage](https://preview.redd.it/bgcpu3841ds41.png?width=1501&format=png&auto=webp&s=2862fee34c9ea760e47555ebee9bf4bf92d13e11)\n\nNo major Chinese domestic outside of CICC (and let's be honest... they only do so because they're essentially an SOE) covered the name even though it had a market cap of $12bn (about what $IQ is at right now). \n\n**If you can't say something nice, don't say nothin' at all**\n\n[Thumper = Chinese sell-side](https://preview.redd.it/6snb39609ds41.png?width=625&format=png&auto=webp&s=41a4122eb2474fac85ec4172fb7f4ff399a22ce7)\n\nAs can be seen w/ $BABA, $IQ and $DQ... pretty much no Chinese investment bank is going to put out a hold, much less a sell rating on another Chinese company. What they will do (with the exception of a company like CICC) is not rate the company at all. If a super niche, micro-cap name like $DQ can have 12 sell-side guys covering it... it's a major tell that something's rotten in the state of Denmark when a $12bn mkt-cap company only has 6 ratings w/ 3 Chinese ratings (and 2 of those are months old).\n\nObviously, even the Chinese sell-side guys could be unaware of sketchiness and fraud going on at some of these companies... but if a sufficiently large ADR isn't being covered at all? Don't even think about touching that shit.\n\n**tl;dr:** If a Chinese ADR doesn't have much analyst coverage... it's probably a piece of shit.", "id": "fzuslx", "created_utc": 1586689229.0, "score": 117, "upvote_ratio": 0.93, "num_comments": 45, "comments": [{"body": "Pretty interesting. Could you run a screen on mid to large cap ADRs with low to no Chinese sell side coverage as a list to short?", "score": 30, "replies": [{"body": "Prob could use a screen to flag certain companies, but don't think there would be enough names to make a short basket & timing would be difficult.\n\nWould think it would be better left as a method to screen out potential long positions.", "score": 14, "replies": []}]}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 19, "replies": [{"body": "Good bot.", "score": 11, "replies": []}]}, {"body": "💎💎", "score": 13, "replies": [{"body": "\\#💎💎\n\nHappy Cake Day", "score": 7, "replies": [{"body": "🙏🏾🙏🏾", "score": 4, "replies": []}]}]}, {"body": "You fucking retard, kimchi is KOREAN.", "score": 41, "replies": [{"body": "Kimochi is Japanese", "score": 18, "replies": [{"body": "I learned that watching Japanese actresses", "score": 10, "replies": [{"body": "This guy knows what's up.", "score": 7, "replies": []}, {"body": "There's not that much acting in Japanese AV. 🤣😂", "score": 4, "replies": []}]}]}, {"body": "Your wife likes kimchi, she told me last night.", "score": 6, "replies": [{"body": "While she was touching your pp?", "score": 1, "replies": []}]}, {"body": "There’s a reason racism is strongly correlated with stupidity.", "score": 3, "replies": []}, {"body": "You learn something new everyday", "score": 7, "replies": []}]}, {"body": "This is actually a pretty interesting.  Curious what your thoughts are on shorting any of these, given that timing this would probably be pretty tough given how opaque the chinese market is no? Yeah you could still make a ton of money, but can these firms stay propped up longer than you/I could stay solvent?", "score": 8, "replies": [{"body": "Maybe you just lie in wait with your blacklist for a black swan event to come along that knocks these companies off their financial sand foundations.\n\nOh wait...", "score": 3, "replies": []}]}, {"body": "Is Jim Chanos like the boogey man to these companies", "score": 6, "replies": [{"body": "I think that title belongs to Muddy Waters.", "score": 2, "replies": []}]}, {"body": "So what’s the next play?", "score": 3, "replies": []}, {"body": "What source/tool are you using for those ratings btw?", "score": 2, "replies": [{"body": "Screenshots are from my Bloomberg terminal, but plenty of free online sources exist for (somewhat) up-to-date company ratings.", "score": 6, "replies": [{"body": "Ah I see looks pretty good overall.", "score": 1, "replies": []}]}]}, {"body": "Thanks for this post. What do you think of $baba as a  leap call options play? I'm thinking of buying June/2021 or Jan/2022 calls for $250-300. I dont see what can go wrong... I honestly think it shouldn't have dropped as much as it did, compared to JD and Amazon, and I dont think their financials are shady like $LK. I'm thinking of entering my positions towards the end of April, before their earnings in May. Any comments or feedback is greatly appreciated, thank you.", "score": 2, "replies": [{"body": "You still playing BABA? I bought some 5/22 $210C today, feeling good about it.\n\nMight do a write up about it later.", "score": 1, "replies": [{"body": "Yes I'm holding some 5/22 and 5/22 $210C, but didnt end up buying leaps due to macro chinese economy concerns and trade war 2.0 brewing. I think playing earnings is still a good idea though.", "score": 2, "replies": [{"body": "I scooped mine while it was at $196.50 this morning. Thought about adding more with todays dip, but wanted to read through the last quarterly report first and of course now it's rising again.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Your broker's trading platform should be a good place to start. Yahoo Finance also has a wide range of upgrades/downgrades.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "A-shares and H-shares", "score": 1, "replies": [{"body": "I find A and H shares really hard to trade.", "score": 2, "replies": [{"body": "I leave A-H trading to people who are much smarter than I. It takes a special breed of autist for sure.", "score": 1, "replies": [{"body": "I'm in HK and even then it's a black box. Things move for no obvious reasons and it's all based on rumors and who's in charge", "score": 2, "replies": []}]}]}]}]}, {"body": "So out of curiosity. You would most likely avoid SNP based on what you are saying above?", "score": 1, "replies": []}, {"body": "I checked all 13 stock analysts recommend strong buy. At $196 it seems to be fair price. My entry point was at 50.", "score": 1, "replies": []}, {"body": "Doesn't it work like this with US firms? I don't remember the last time I took coverage all that seriously.", "score": 1, "replies": [{"body": "Not so much with US companies. Even with Chinese companies, it's not a matter of their rating as much as \"this large company has no one covering it... something's not right\"\n\nIf you're an institutional trader, I've found that for the US, EPS re-rating (not the amount, but rather the % of analysts increasing or decreasing EPS predictions over a time period) is a very robust factor (obv works better in a basket of factors)", "score": 1, "replies": []}]}, {"body": "Awesome stuff as always", "score": 1, "replies": []}, {"body": "What is your friend's thought on PDD?", "score": 1, "replies": []}, {"body": "thoughts on $gsx?", "score": 1, "replies": []}, {"body": "Bro we get it, you have a bloomberg terminal", "score": 1, "replies": []}, {"body": "BAN", "score": -3, "replies": []}, {"body": "What about ZM? Does Zoom have Chinese sellside recommendations?", "score": -1, "replies": [{"body": "$ZM's CEO is Chinese, but the company is American. It's not an ADR.", "score": 9, "replies": []}]}]}
{"title": "Don't listen to the gay bears 🚫🐻", "selftext": "Lmao all these bears going around chatting shit like \"spy 270\" and \"red week ahead\". These idiots are mad that they bought shitty puts which are now dumping value as we approach their expiration and volatility decreases. \n\nThey say things like UnEMPloYmeNT as their reasoning, but little do they know that all that shit is clearly priced in by now - everybody knows those statistics are and will be terrible, just nobody really gives a shit.\n\nYou see, these naysayers are going against JPOW and the money printer: literally trillions of dollars are being pumped into the economy to stop a crash, but they still think the market is gonna spontaneously collapse this week despite slowly improving news because of their blinding pessimism.\n\nWe're gonna have a green week, spy 350+, just you wait", "id": "fzzev4", "created_utc": 1586707779.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 50, "comments": [{"body": "Ah, so this is the peak. Puts printing, inverse WSB confirmed", "score": 49, "replies": [{"body": "Wsb is priced in.", "score": 4, "replies": []}, {"body": "profit cause teeny tan disarm salt judicious juggle wakeful placid", "score": -28, "replies": [{"body": "CAW-CALLS!\n\ncalls... calls... calls.. CAW CALLS!", "score": 10, "replies": []}, {"body": "Money printer goes BRRRRRRR", "score": 1, "replies": []}]}]}, {"body": "Don’t you talk about my puts like that. Only I get to shit talk them!", "score": 53, "replies": [{"body": "Positions or ban", "score": 10, "replies": []}]}, {"body": "Wow. I can’t wait to read this post when the tides turn. How can it all be priced in when no one knows what the fuck the rest of the year will look like? Apple just waived guidance because they have no clue what to expect for sales and countless other corps will soon follow suit. There’s a lot of irrational confidence in the market right now, which means it’s easier to go down from here, not up. \n\nI’ll tell you what is priced in at this current moment, all the fucking good news that could possibly come of this, including JPOW’s big green dollar printing dick.\n\nYou can keep saying brrrr all you want, but at some point we will all be looking back saying, uh duh, how the fuck could you not see another major crash coming? \n\nYou’re telling me the market should be trading higher than where we were mid last year? After a GLOBAL SHUTDOWN? Sorry, you’re a liar.", "score": 30, "replies": [{"body": "RemindMe 1-3 months", "score": -1, "replies": []}]}, {"body": "I have calls too but damn bro you’re retarded I might sell them cause of this", "score": 14, "replies": []}, {"body": "Oh look, another brand new trader", "score": 13, "replies": []}, {"body": "U do realize we’re heading into whats probably gonna become a Great Depression right?", "score": 23, "replies": [{"body": "Yeah, but not by 4/17 or 4/24", "score": 1, "replies": []}, {"body": "[deleted]", "score": -10, "replies": [{"body": "Liquidity crunch\nDebt crisis\nHousing market crisis\nCorporate market debt crisis\nStagflation\n8 mil unemployed for multiple months\nCoronavirus\n\nWhy is the market going up again", "score": 13, "replies": [{"body": "in 2008 the worlds financial geniuses discovered QE, which is an instant cure for any problem, financial or other. Now they are just going to use this hammer again for this nail-looking problem. If you squint anything looks like a nail after all.", "score": 5, "replies": []}, {"body": "Cuz warm is getting out and powJ RRRRRRRRRRB", "score": 1, "replies": []}, {"body": "jellyfish tan serious weary pot uppity noxious safe shocking sharp", "score": -5, "replies": [{"body": "We have literally every economic problem possible, happening at the same time.  I bet u didnt know that, how is that even close to priced in", "score": 6, "replies": [{"body": "I think the market is currently fairly valued. The next week kicks of the earnings season for many companies, so we will only partially see the extent of the impact of the virus. It will be a volatile week ahead but really could go either direction. There’s a lot of optimism in the market right now which can also quickly reverse on some bad news.", "score": 3, "replies": []}]}, {"body": "I’m in Toronto and I know 3 families who rent and build spec homes to sell. (Infill developments.) And their all leveraged to the tits.  Building houses that are supposed to sell for 4 million +, and their right in the middle of the build leveraged to the tits with no buyer in site.  \n\nTo boot 1/3 of their rental tenants are asking for rent extensions, and they presume it will only get worst seeing as roughly half of them work in retail and food services.  Plus plus plus these rental houses are loosing money because they were all speculative investments.  \n\nI’m poor so I don’t know lots of rich people but I feel like there are a lot more people out there leveraged past the nipples, and right upto their gag leash.\n\nGay bear season is just starting, cover up those assholes and sell your calls.", "score": 2, "replies": [{"body": "Toronto on the map! #gaysincanadatoo!", "score": 1, "replies": [{"body": "We got a gay district in Toronto.  Church and Wellesley. \nThe gay bears at the black eagle/ Pegasus bar have been waiting for these red days for ages.  🐻🌈👉🤸🏼‍♂️", "score": 1, "replies": [{"body": "Yeeeeeeee", "score": 1, "replies": []}]}]}]}, {"body": ">No such thing, it has gone up a lot, so if something is priced in, that means it would of stayed there till there is change.", "score": 1, "replies": []}]}]}]}]}, {"body": "Love how mad people are at this.", "score": 3, "replies": []}, {"body": "Imagine thinking the economy is healthy", "score": 6, "replies": []}, {"body": "I mean you’re right. \n\nUnemployment is getting paid weeklies that are based on a 60k salary. \n\nThe market knows it’s a sickness and we had that HUGE HUGE crash and now they think well it can really go up from here what don’t we know at this point? \n\nCould it resurface and kill more old people? Sure are the small business closing down feeding into profits for larger competitors? Absolutely\n\nYou’re kicking yourself because you missed the elevator to 280 \n\nYou now have the chance to take the stairs to 290 \n\nDon’t play yourself. Keep the lotto ticket puts but if you bet any more this week for the love of god just make calls", "score": 7, "replies": [{"body": "U right", "score": 1, "replies": []}]}, {"body": "The markets just only don’t go down. \n\n#Deep OTM calls it is.", "score": 2, "replies": []}, {"body": "Wow, you’re so right! Why don’t we just always print money/keep the reserve ratio super low? Sounds like no-risk free money to me! In fact, why should anyone go back to work? We can just keep handing out more dollars and if everyone pretends they’re worth something then SPY 500!\n\nJust kidding you lint licker. Ban", "score": 2, "replies": []}, {"body": "It’s not priced in lol\n\nYou guys are going to learn a hard lesson in the coming months. I wouldn’t short now, but I wouldn’t buy this rally.\n\nWe’ll see if it’s priced in after Q1 reports and guiding statements are made.", "score": 2, "replies": []}, {"body": "Right on. Buy SPY calls people. My targets are 4/17 285, 4/24 295, 5/1 305. \n\nThe market will be range bound (consolidation) after that 280-305. \n\nNext leg up will be in July/Aug when we are headed to 340+", "score": 2, "replies": []}, {"body": "Woah, autism is strong in this one", "score": 3, "replies": []}, {"body": "No one tell him about the trailing effects caused by half the labor force just not fucking working. This retard actually thinks things are slowly getting better.", "score": 4, "replies": []}, {"body": "Another whole thread, just to say 'brrr'. \n\n.... mods?", "score": 1, "replies": []}, {"body": "Yeah sure, shits going to be closed till december but it’s “priced in” -15%? Lies lies, shits going RED in 2-3 months despite the brrrrrrrrr. Puts go brrrrrrrrrrrrrrr next", "score": 1, "replies": []}, {"body": "It’s funny when people new here think priced in isn’t a meme", "score": 1, "replies": []}, {"body": "Looks like this guy heard about the oil deal", "score": 1, "replies": []}, {"body": "Prove your 350 Call or ban.", "score": 1, "replies": []}, {"body": "You do know that people pumping puts on here are the ones selling them...", "score": 1, "replies": [{"body": "Cuck\n\nCAW-CALLS!\n\ncalls... calls... calls.. CAW CALLS!\n\nCAW PUTS... CAW PUTS! POOTS! CAWL YOUR GRANDMA! POOT YOUR CALLK IN MY HOLE", "score": 1, "replies": []}]}, {"body": "So what you're saying is, everything is priced in except brrrrr? Really convincing thesis.", "score": 1, "replies": []}, {"body": "not true, some of us are mad because we missed tesla at 360 and are now sitting on a pile of useless fucking cash waiting and waiting", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "\"... but my iq is high enough...\"", "score": 2, "replies": [{"body": "🤣🤣", "score": 2, "replies": []}]}]}, {"body": "You do realize that spy 350+ would be all time highs right? Holy fuck this sub is shit😂", "score": -2, "replies": [{"body": "No way, how'd you figure that one out brainiac?", "score": 0, "replies": []}]}, {"body": "I don't think there's any chance it goes up much more than 2900 in the short term, and it will likely putter down to a new low but not for a few months yet.\n\nThey will do everything they can to keep it pumped - because the truth is that the Fed is just a PR firm basically - but the reality that by owning stocks in the majority of companies you are owning an asset that isn't going to generate any earnings for 2 years at LEAST, and the government bailouts, if taken - will dilute the hell out of shareholders, will really start to weigh on it!\n\nBut any hopes for another steep decline that one can make money on by buying an inverse ETF or getting some near term puts for cheap - dont' think that is going to happen!  So those of us who missed the rally just need to wait", "score": -1, "replies": []}]}
{"title": "PSA on up to 100k worth of 401k Coronavirus Distributions: You don't have to repay the money back to your shitty employers account with their limitations, you can choose any broker(s) to repay the funds to (functions like a tax free rollover so you get more choices/options/better fees).", "selftext": "[deleted]", "id": "g03da0", "created_utc": 1586720804.0, "score": 87, "upvote_ratio": 0.92, "num_comments": 48, "comments": [{"body": "Unironically smart, too bad gonna get delete by the mods now", "score": 21, "replies": []}, {"body": "Why not just take the 100k and immediately deposit it with another broker? That way you don't have to worry about not having the cash to pay it back", "score": 14, "replies": [{"body": "This may be a real possibility.  \n\nAs long as you qualify for a distribution under the ACT, you can pay it back at any time:  \n\n* Who’s diagnosed with COVID-19 by a test approved by the Centers for Disease Control and Prevention,\n* Whose spouse or dependent (generally a qualifying child or relative who receives more than half of his or her support from you) is diagnosed with COVID-19 by such a test,\n* Who experiences adverse financial consequences as a result of being quarantined, furloughed, laid off or having work hours reduced due to COVID-19,\n* Who’s unable to work because of lack of childcare due to COVID-19 and experiences adverse financial consequences as a result,\n* Who owns or operates a business that has closed, had operating hours reduced due to COVID-19 and has experienced adverse financial consequences as a result, or\n* Who has experienced adverse financial consequences due to other COVID-19-related factors\n\n&#x200B;\n\nHere's a great reference.  \n\n[https://www.yeoandyeo.com/resource/stay-afloat-with-tax-favored-coronavirus-related-distributions](https://www.yeoandyeo.com/resource/stay-afloat-with-tax-favored-coronavirus-related-distributions)", "score": 6, "replies": [{"body": "I had to pay $5 for each toilet paper roll.   \n\n\nYa think that will fly for the last rule?  “Who has experienced adverse financial consequences due to other COVID-19-related factors“", "score": 3, "replies": []}]}]}, {"body": "Retarded is retarded.  Take 100k tax and penalty free then wonder how you can repay it back before the 3 years is up.  Nobody is going to and they’ll be FUCKED.", "score": 12, "replies": [{"body": "Invest 100k in SPY. \n\nStonks go up. \n\nUse SPY to take our margin loan (100k) and pay back loan.", "score": 6, "replies": []}, {"body": "Fucked how? A 10% fee?", "score": 4, "replies": [{"body": "and tax on 100k if not roth401kay", "score": 2, "replies": []}]}, {"body": "....not if it’s roth", "score": 1, "replies": []}]}, {"body": "And when you can’t repay because of your losses you’ll be fucked on taxes", "score": 6, "replies": [{"body": "I think the idea is essentially a rollover whole in-service with the employer", "score": 3, "replies": []}]}, {"body": "Does losing my life savings on SPY 150P count as \"adverse financial consequences due to other COVID-19-related factors\"", "score": 4, "replies": [{"body": "Yes.", "score": 2, "replies": []}, {"body": "\"I had to pay extra for my toilet paper on the tp black market\" should qualify", "score": 2, "replies": []}]}, {"body": "Where does it say you don’t need to pay taxes?  Only the 10% penalty is eliminated.  You are still on the hook for income tax on a 401k withdrawal.", "score": 5, "replies": [{"body": "https://www.yeoandyeo.com/resource/stay-afloat-with-tax-favored-coronavirus-related-distributions\n\nIF you repay the loan in 3 years, it's all tax free and treated as a rollover.", "score": 8, "replies": [{"body": "Try to pay it back in first year. If you wait you have to amend past tax filings.", "score": 2, "replies": []}]}]}, {"body": "Thank you OP !!", "score": 3, "replies": []}, {"body": "“You can choose to spread the taxable amount equally over three years, apparently starting with 2020. But here it gets tricky, because the 3-year window won’t close until sometime in 2023. Until then, it won’t be clear that you failed to take advantage of the tax-free CVD rollover deal. So, you may have to amend a prior-year return to report some additional taxable income from the CVD. The IRS is expected to issue additional guidance to clarify this issue.”\n\nThis is interesting, thanks.  If you can avoid having to pay taxes in year 1 and 2 and can repay full amount in year 3 then this is a no brainer to take it out now and put it into stocks or leap calls.  Even if you don’t buy at the low, you should still have solid gains after 3 years.", "score": 2, "replies": []}, {"body": "Need to be careful though -- you rollover a pre-tax 401k into a pre-tax IRA, now you can't make backdoor Roth contributions. Definitely not worth messing that up to save a few bps on fees", "score": 2, "replies": []}, {"body": "Will they audit us and ask for proof that we qualify?", "score": 2, "replies": [{"body": "Nope.", "score": 1, "replies": []}]}, {"body": "So after reading your post and thought about it for a few days, I'm taking 100k out and sticking it in an IRA to yolo a bit.  Wish me luck!", "score": 2, "replies": [{"body": "Do you have to show proof? This has affected all of us in one way or another.", "score": 1, "replies": [{"body": "Maybe if you get audited", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You should be good.  403b is similar to the 401k (both retirement plans just for different types of organizations).  401ks is for companies, 403b is for tax exempt plans like hospitals, non profits, etc.     \n\nShould have the same rules apply for 403bs.", "score": 0, "replies": []}]}, {"body": "Would be great if having my salary reduced by 20% qualified. I could possibly move 100k from my employer 401k with Principal (not great mutual fund options) and put it in my Vanguard account using their funds.", "score": 1, "replies": [{"body": "\"CVDs must be taken between January 1, 2020, and December 30, 2020, by an eligible individual. That means an individual:\n\nWho’s diagnosed with COVID-19 by a test approved by the Centers for Disease Control and Prevention,\nWhose spouse or dependent (generally a qualifying child or relative who receives more than half of his or her support from you) is diagnosed with COVID-19 by such a test,\nWho experiences adverse financial consequences as a result of being quarantined, furloughed, laid off or having work hours reduced due to COVID-19,\nWho’s unable to work because of lack of childcare due to COVID-19 and experiences adverse financial consequences as a result,\nWho owns or operates a business that has closed, had operating hours reduced due to COVID-19 and has experienced adverse financial consequences as a result, or\nWho has experienced adverse financial consequences due to other COVID-19-related factors.\nIRS guidance on how to interpret the last two factors is needed and is presumably forthcoming. Contact your tax advisor for the latest developments.\"\n\nYou should be good as your pay was reduced thus qualifying you for a CVD distribution.  Talk to your employer/fund company tomorrow and check.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "\"CVDs must be taken between January 1, 2020, and December 30, 2020, by an eligible individual. That means an individual:\nWho’s diagnosed with COVID-19 by a test approved by the Centers for Disease Control and Prevention, Whose spouse or dependent (generally a qualifying child or relative who receives more than half of his or her support from you) is diagnosed with COVID-19 by such a test, Who experiences adverse financial consequences as a result of being quarantined, furloughed, laid off or having work hours reduced due to COVID-19, Who’s unable to work because of lack of childcare due to COVID-19 and experiences adverse financial consequences as a result, Who owns or operates a business that has closed, had operating hours reduced due to COVID-19 and has experienced adverse financial consequences as a result, or Who has experienced adverse financial consequences due to other COVID-19-related factors. IRS guidance on how to interpret the last two factors is needed and is presumably forthcoming. Contact your tax advisor for the latest developments.\"\n\nYou should be good as your pay was reduced thus qualifying you for a CVD distribution. Talk to your employer/fund company/tax person this week.", "score": 2, "replies": []}]}, {"body": "*Important: The CARES Act also may allow you to take tax-favored CVDs from your employer’s qualified retirement plan, such as a 401(k) or profit-sharing plan, if the plan allows it. If allowed, the tax rules for CVDs taken from qualified plans are similar to those for CVDs taken from IRAs. Employers and the IRS have lots of work to do to figure out the details about how CVDs taken from qualified plans will work. Contact a tax professional or the appropriate person with your company for more information. But be patient. It may take a while for the details to fall into place.*\n\nIt does not explicitly state that I can take my 401k money and put it back in into an IRA versus back into the 401k. I’m sure most 401k plan will stipulate pitting the money back into the 401k, when taking a loan from it.", "score": 1, "replies": [{"body": "The CARES act changed several pieces of retirement savings.  You can get money out via a traditional 401k Loan (option A) and also a Coronavirus distribution (CVD or option B) that are similar yet completely different.  \n\nThere are 401k loans from your employer account usually are paid back to your employers account.  The cares act changed the terms that say you can borrow up to 100% of your account balance up to 100k and delay any payments until end of of this year (6 year total payback period.  \n\nThe Coronavirus distribution (CVD) is NOT required to be paid back to your employers account (its considered a tax free withdrawal/rollover if paid back in 3 years)\n\na 401k loan has to be repaid to your employers account, a CVD does not.", "score": 1, "replies": [{"body": "*“The Coronavirus distribution (CVD) is NOT required to be paid back to your employers account (its considered a tax free withdrawal/rollover if paid back in 3 years)”*\n\nOk so paid back into where? An IRA? IRAs have a 6k yearly contribution limit. Also if one is taking the CVD then that adds to one’s yearly income and it would put people out of the range to qualify for an IRA contribution.\n\nTrust me, I would LOVE to dump my shitty and expensive company’s ROTH 401k plan and roll all of it into a ROTH IRA.", "score": 1, "replies": [{"body": "The CVD is paid back into whatever IRA you choose to pay in back into from whatever broker you want that has IRA's (Fidelity, vanguard, TDA, Schwab, tasty, etc).  You make the choice as long as its an IRA.   \n\nMy understanding is because your current employer 401k ROTH is after tax and the rollover entity (roth ira) is after tax it might be ok but I haven't looked into the ROTH stuff yet.  I don't know what happens if you  want to rollover your pretax CVD repayment into a post tax ROTH.  Here's an article on the ROTH issue:  https://www.cnbc.com/2020/03/31/how-some-people-may-game-the-retirement-rules-in-the-coronavirus-law.html\n\nOne dubious strategy popping up is taking a $100,000 “coronavirus-related” distribution from your traditional pre-tax retirement account, stashing the money into a tax-free Roth IRA and paying the resulting taxes over three years.\n\nThis might not pass muster with the IRS, and experts suggest avoiding the tactic.\n\nWithdrawing the full $100,000 from an IRA or a 401(k) and then depositing it into a Roth IRA may be treated as an excess contribution by the IRS — that is, a deposit that runs over the $6,000 limit (plus $1,000 for those aged 50 and over) for 2020, said Hopkins.\n\nExcess contributions are subject to a 6% tax as long as the additional cash remains in the account.\n\nWhat would be kosher, however, is just converting a portion of your IRA to a Roth – and doing so without a creative interpretation of the COVID-19 relief bill.\n\n“There’s definitely the argument now that you should just think about converting because tax rates and account values are both down,” said Hopkins", "score": 1, "replies": [{"body": "Thanks for the info.", "score": 2, "replies": [{"body": "lemme know if your employer lets you rollover the ROTH or not!  I hope they do!", "score": 1, "replies": [{"body": "Thanks. \n\nI doubt that they will since this would be a CVD and not a rollover. If I decide to call my 401k people and find out, I’ll let you know.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Do I have to show symptoms of bat flu to qualify?", "score": 1, "replies": [{"body": "No. \n\nSelf attestation.", "score": 1, "replies": []}]}, {"body": "Good idea. Cash out $100K, put it in Interactive Brokers and play futures instead of weak ass options.", "score": 1, "replies": []}, {"body": "Post of the year.", "score": 1, "replies": []}, {"body": "It is self certification by the way. No one is checking.", "score": 1, "replies": [{"body": "Is this something that may be requested later by IRS?", "score": 2, "replies": []}]}, {"body": "So if the money is in a pretax 401k, does it need to go back into a traditional IRA or can it go into a Roth? And vice versa? I have money in a traditional 401k and a Roth.", "score": 1, "replies": [{"body": "I think more info is coming out about moving from a pretax retirement account to a post tax retirement account.  From what I understand the pretax 401k money needs to be back in an IRA but look for more information.  \n\nThe last section of this article deals with the Pretax/Post-tax issue.  \n\n[https://www.cnbc.com/2020/03/31/how-some-people-may-game-the-retirement-rules-in-the-coronavirus-law.html](https://www.cnbc.com/2020/03/31/how-some-people-may-game-the-retirement-rules-in-the-coronavirus-law.html)", "score": 1, "replies": [{"body": "Would it go into a rollover IRA? Or would someone contribute to a Roth/traditional ira? Does it count towards the $6000 limit?", "score": 1, "replies": []}]}]}, {"body": "Does it have to be 100K from MY account, or like my boss’ or even my CEOs account?", "score": 1, "replies": []}]}
{"title": "Dow futures rise more than 100 points after big oil production cut", "selftext": "[removed]", "id": "g05vn7", "created_utc": 1586729215.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 46, "comments": [{"body": "It's currently red....sooooo", "score": 36, "replies": [{"body": "That's - 100.\n\nNumbers, how do they work?\n\nEdit: - 250", "score": 9, "replies": [{"body": "-500", "score": 2, "replies": []}]}, {"body": "I'm looking at green on CNBC. Are they on a delay there?\n\nEdit Looks like a ten minute one.", "score": 3, "replies": [{"body": "https://www.investing.com/indices/indices-futures", "score": 2, "replies": [{"body": "Thanks for this.", "score": 1, "replies": []}]}, {"body": "Yes, CNBC is behind by like 10-15 min check investing.com", "score": 2, "replies": []}]}, {"body": "At some point the bad news actually has to cause a drop", "score": 2, "replies": [{"body": "Bout time. My asshole was raw from those green pythons last week.", "score": 2, "replies": []}, {"body": "Prepare to be disappointed...", "score": 1, "replies": []}]}]}, {"body": "This didn’t age well", "score": 26, "replies": []}, {"body": "rare that a post is wrong within 2 mins....", "score": 12, "replies": [{"body": "Most times I look at CNBC's stupid \"Breaking News\" banner and they claim \"Dow up 500\" or \"Dow down 500\" it's off by at least 100 points because there's so much damn volatility.\n\nBear gang tendies tomorrow!", "score": 2, "replies": []}]}, {"body": "u jinxed it", "score": 10, "replies": []}, {"body": "Don't come in here posting news from 2 minutes after futures open retard.\n\nAlso they are red now\n\nalso ban", "score": 7, "replies": []}, {"body": "Please shut the fuck up.", "score": 3, "replies": []}, {"body": "Wow, in the same post:\n\nThe futures align with my calls, WE'RE GOING TO THE MOON!\n\nand\n\nThe futures aren't aligned with my calls, THEY DON'T MEAN SHIT!", "score": 3, "replies": []}, {"body": "oh no... not again...", "score": 3, "replies": []}, {"body": "And now they are down 150", "score": 3, "replies": [{"body": "200 now lol", "score": 4, "replies": []}, {"body": "[Aaaand it's gone](https://youtu.be/-DT7bX-B1Mg?t=16)", "score": 4, "replies": []}, {"body": "Where do you get the real time futures? [CNBC.com](https://CNBC.com) pre-market is behind by like 10-15 min", "score": 3, "replies": [{"body": "https://m.investing.com/indices/indices-futures", "score": 5, "replies": []}, {"body": "[Investing.com](https://Investing.com)", "score": 3, "replies": []}, {"body": "Every trading platform except for RobinTurd lets you view realtime futures directly in the platform.", "score": 3, "replies": [{"body": "Due to my retardation I am limited to using Robinhood", "score": 1, "replies": []}]}]}]}, {"body": "Of course its red lol. I bought spy calls Thursday afternoon that's why.", "score": 3, "replies": []}, {"body": "Jesus fucking Christowitz. It's like 5 minutes after open. Not to mention that futures are now negative. Idiot.", "score": 6, "replies": [{"body": "Your PP is very small.", "score": 0, "replies": []}]}, {"body": "Lmfao", "score": 2, "replies": []}, {"body": "ITT: sad bears", "score": 2, "replies": []}, {"body": "Oh boy, this thread is so entertaining.", "score": 2, "replies": []}, {"body": "Call to ban OP", "score": 2, "replies": []}, {"body": "Jinxed it", "score": 1, "replies": []}, {"body": "Bruh", "score": 1, "replies": []}, {"body": "It’s red already. Tomorrow -10%!", "score": 1, "replies": []}, {"body": "Fake news", "score": 1, "replies": []}, {"body": "futures suck", "score": 1, "replies": []}, {"body": "Looks like it will limit down at this rate.", "score": 1, "replies": []}, {"body": "This is dumb", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "lmao", "score": 1, "replies": []}, {"body": "Lmfaaaaao\n\n'futurez green, get fucked bears'\n\n'so what futures red, they don't mean shit'\n\nYou're a true retard.", "score": 1, "replies": []}, {"body": "This aged well.", "score": 1, "replies": []}, {"body": "I'm color blind can't tell the different", "score": 1, "replies": []}, {"body": "You’re retarded", "score": 1, "replies": []}]}
