{"title": "NVDA", "selftext": "Nvidia Earnings And Fundamental Analysis\n\nIn the third quarter of fiscal 2022, Nvidia earnings jumped 61% while sales surged 50%. Gaming chip revenue soared 42%. Data-center chip sales jumped 55%. Nvidia purchased Mellanox last year. In addition, Nvidia guided revenue higher for the current Q4.\n\nThe chip giant easily beat Q3 earnings and sales views.\n\nNvidia CEO Jensen Huang expects the ongoing chip shortage to continue through 2022. Analysts expect EPS to jump 74% in all of 2022 as revenue increases 60%, according to FactSet. Both earnings and revenue are seen growing further in 2023, though at a slower pace.\n\nNvidia's EPS Rating is a superior 97 and its SMR Rating is an A, on a scale of A to a worst E. The EPS rating compares a company's earnings growth to other stocks. Its SMR Rating gauges sales growth, profit margins and return on equity.\n\nOut of 44 analysts covering NVDA stock, 35 rate it a buy, eight have a hold and one has a sell, according to FactSet.\n\nThe pandemic fueled demand for Nvidia chips in home computing, video games and data centers. Now chips are in such hot demand that it's led to a global shortage.\n\nThe chip shortage hit automakers especially hard. Nvidia makes chips for car infotainment and autonomous driving systems.\n\nAs cloud gaming grows around the world, Nvidia's new cloud gaming service could become a growth driver. Rival services include Google Stadia, Microsoft Xbox Network and Amazon Luna.\n\nNvidia designs dedicated chips for mining cryptocurrencies. Its cryptocurrency mining processors, or CMPs, launched last February.\n\nNvidia Stock Technical Analysis\n\nNvidia earns a strong IBD Composite Rating of 94. In other words, it has outperformed 94% of all other stocks in terms of combined technical and fundamental metrics. In fact, NVDA belongs to the IBD Leaderboard, a list of stocks with the most potential for big gains. It also belongs to the IBD 50, Big Cap 20 and Sector Leaders lists.\n\nInvestors generally should focus on stocks with Comp Ratings of 90 or even 95 and above.\n\nThe chip stock cleared a 230.53 buy point in October and rapidly ran to a high before consolidating. In 2022, NVDA stock broke below its 50-day and round-tripped the entire late 2021 run. Shares are now testing their 200-day lines.\n\nNvidia has a lot of repair work to do.\n\nThe relative strength line for NVDA stock is lagging after a strong rally in the past year, IBD MarketSmith charts show. In fact, the strength indicator has rallied nicely for much of the past three years. A rising RS line shows that a stock is outperforming the S&P 500 index. It is the blue line in the chart shown.\n\nThe Accumulation/Distribution Rating is an E, a sign of heavy selling by institutions over the past 13 weeks. Still, the chip stock boasts strong institutional backing: As of December, 4,910 funds owned NVDA shares. In fact, Nvidia shows eight quarters of rising fund ownership, the IBD Stock Checkup tool shows.\n\nNvidia stock owns an RS Rating of 95, meaning it has outperformed 95% of all stocks over the past year. The iShares PHLX Semiconductor ETF (SOXX) holds both Nvidia and AMD stock.\n\nBottom line: NVDA is a buy hold . PT$400.", "id": "sg62p5", "created_utc": 1643537161.0, "score": 14, "upvote_ratio": 0.85, "num_comments": 11, "comments": [{"body": "Will be challenging to maintain current multiples at higher interest rate environment.\nHope to make this correction through with no more challenges.  Will add more if we hit 150", "score": 1, "replies": [{"body": "There is no official date for rate hike , market pullback already baked into the recent 100 point drop for NVDA . I don’t envision much more pull back . Q4 ER will surge the price . Something to think about.", "score": 2, "replies": [{"body": "Hopefully \nWhen isER date?", "score": 1, "replies": [{"body": "Report Date\nFeb 15, 2022\nPeriod Ending\n2021 (Q4)\nConsensus EPS Forecast\n$1.22\nLast Year’s EPS\n$0.78\nAnalyst Consensus", "score": 2, "replies": [{"body": "Thank you, buddy 👍🏼🤞🏼", "score": 1, "replies": []}]}, {"body": "2/15/22Q4ER", "score": 1, "replies": []}]}]}, {"body": "The stock doesn’t need to maintain these multiples for long. Revenue and profits are climbing so fast. After February earnings call alone, $NVDA PE will drop by 10%, e.g from 66 to 60", "score": 2, "replies": []}]}, {"body": "The ARM merger was blocked. China exposure/risk. This is the reason it tanked. \n\nIt's a deal under 230 all day. But longer term hold is risky. $SOXL is 3x semi conductors.", "score": 1, "replies": [{"body": "Why is it a bad long hold ?", "score": 1, "replies": []}, {"body": "Did Pelosi sell?", "score": 1, "replies": []}]}]}
{"title": "Double Calendars - Best Hedges?", "selftext": "I have been doing Double Calendars for awhile on SPY, IWM, QQQ and AAPL. \n\nLooking for your best Hedge Ideas. Thank You.\n\nI am only looking for 8-10%. My only Hedge is >>>  I take the trade off after 1-2 days. Even for 2% profit.\n\nShort Leg 4-10 days out,  and the Long leg 7-10 days after that.\n\nNormally taking the expected move as the Strike prices, or .30 Delta if I am not confident of the sagging Death Valley in the Middle.\n\n$1000 at 10% in a couple days is pretty sweet. If you can get it.\n\nReally, Really hate Iron Condors. The potential for loss has bitten me a few times. Still rolling some Credit Spreads that have 100% Credit from months ago. Really ties up Capital.\n\nSo for me Double Calendars hit my trading tolerance, personality and Account size.", "id": "sga9b3", "created_utc": 1643552738.0, "score": 5, "upvote_ratio": 0.7, "num_comments": 14, "comments": [{"body": "So been thinking of using a Call Butterfly as Hedge. Thinking is that the IV drops as the Price goes up. IV \"Crush\" is the real killer of Calendars. If you want to get out quick. So having that extra help seems to work. In TOS Analyzer\n\nTry to get the cheapest Butterfly as possible. Might have to buy 2-3 Double Calendars for every 1 Hedge.\n\nAlso Going with a 2 Call to 1 Put  Calendar Ratio looks like it may help.\n\nThe cheaper I can get Butterflies as hedges I use them. Almost no cost is possible.\n\nIn the end this means going a little further out on the DTE and more Cash upfront.\n\nWhen the SPY/IWM/QQQ Price goes down, this brings up the IV and is what can get you out quick with profit.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Bad Idea. Funds have imploded doing this before.", "score": 1, "replies": [{"body": "How? You pay a Debit up front and know your costs when you enter the trade. Thats all you can lose\n\nIf you use Less than 5% of your account - that is all you can lose even if the SPY goes to zero or 1000.\n\nGuessing your talking about Selling PUTS (or Calls) Naked?", "score": 1, "replies": [{"body": "I was replying to Potatoe about shorting the VIX", "score": 3, "replies": [{"body": "OK.", "score": 1, "replies": []}]}]}]}, {"body": "The longer the Vic stays elevated the more likely this strategy is going to be possible I wouldn't buy or short the vix anything below 30 though and if you buy puts make sure they're 45 to 60 days out", "score": 1, "replies": []}]}, {"body": "I’ve tried that once before, made a small profit. However the calculator I was using said it had 20 percent chance of profit at my entry prices (they weren’t the best maybe that’s why).", "score": 1, "replies": []}, {"body": "What are you trying to hedge?", "score": 1, "replies": [{"body": "I guess IV Crush? but getting out in one or two days seems to help shield me from it a little.\n\nThese are not earnings plays, but can work well with AAPL.\n\nDouble Calendars seem to be underutilized and taught.\n\nJust wondering if anyone has had success with Hedging Double Calendars?\n\nTastyTrade had a video that taking profits at 10% or letting it go to expiration (Front Month/Short Legs) was a winning strategy.\n\nhttps://www.youtube.com/watch?v=crBZ3dNJJ0c&ab\\_channel=tastytrade", "score": 1, "replies": [{"body": "It's a realistic strategy. Most people see 10 % and want more and more and more.", "score": 2, "replies": [{"body": "Yea. Double Calendars fit my personality best. Try to get out as fast as possible. Usually 1-3 Days. Trying to avoid IV crush as soon as possible.\n\nKind of slow motion day trading with Limit Orders put on immediately. \n\nNothing wrong with 10%. Plus these are the most liquid Options on Wall Street, So closing of the Legs is very quick usually.\n\nWe usually have 10-20 positions on at a time. different DTE. Each under 5% of the total Account.\n\nThese are not part of our Long Term Investment Portfolio at all.\n\nPure Short Term Income plays. Keeps us engaged fully into the Market daily.", "score": 1, "replies": []}]}, {"body": "Calendar spread (buying far month and selling near month) is long volatility play.\n\nNot sure calendars benefits from IV crush", "score": 1, "replies": [{"body": "Thats What I am trying to protect from - IV Crush.  Just asking if anyone has Hedging ideas.\n\nThats why we try to get out with small profit (or losses) as soon as possible. Before any perceived or real volatility comes out of the Option chains.\n\nDouble Calendars are a kind of Arbitrage. Its kind of a race between time and volatility.  \n\nI like to trade them - and are trying to hone in on my skills to be the best Double Calendar craftsman I can be.  That sounds kind of lame and boring, but hey, it is what it is.", "score": 1, "replies": [{"body": "Did you find light at the end of the tunnel? This is the path am on now with wanting to be the best at trading double calendars but the variables and mechanics create lots of nuances.\n\nNow am going to be try opening double calendars with closer strikes and buying OTM strangle to hedge if price runs, the closer strikes should allow for more premium if done right before release before close should get the widest IV between short and long legs. You make progress or still at this?", "score": 1, "replies": []}]}]}]}]}]}
{"title": "IV difference between Brokers", "selftext": "My Etrade account (using Power Etrade) shows AAPL with an IV of 47.27, the TD ToS web site shows AAPL with an IV of 34.34.  The Fidelity site only seems to list IV at the option level (all of which show lower than ToS).\n\nBoth Etrade and TD indicate that they use the BS model and IV is based on 1 SD over a year period. Any guidance on what IV is the more relevant? Thanks in advance.", "id": "sgd5mn", "created_utc": 1643561186.0, "score": 5, "upvote_ratio": 0.67, "num_comments": 10, "comments": [{"body": "> Any guidance on what IV is the more relevant?\n\nEither one is fine. You have to understand that IV is an approximation no matter how you slice it, and you can get different answers depending on whether your broker optimizes for speed with less accuracy or slow calc with more accuracy.\n\nThe IV of the stock itself is just an average or aggregation of individual option contract IV, so it's not going to be as useful in any case compared to the IV on a specific contract. It's analogous to the S&P 500 index vs. TSLA. The index is useful to give you a sense of the overall direction of the market, but doesn't tell you a thing about how much money TSLA gained/lost over the last year.", "score": 7, "replies": [{"body": "Interesting response. I would have thought stock IV would reflect the volatility of the stock itself. I use that to compute the 1 and 2sd ranges from which I then choose an appropriate strike to sell. I would think it would be a straightforward computation reflecting the movement over the year. That's why I can't understand why there are variences. Thanks for responding.", "score": 2, "replies": [{"body": "Ahh, I think I got it....I must be looking for historical volatility as opposed to implied which would have potential for swings. Amazing how thinking can help.", "score": 2, "replies": [{"body": "Right. Historical volatility is also known as realized volatility. IV is the prediction, HV is what actually happened.\n\nBut you don't have to try so hard. The 16 delta strike approximates one standard deviation OTM and the 84 delta strike approximates one standard deviation ITM, so you can go by delta.\n\nhttps://www.youtube.com/watch?v=ca7oC70BnTg&list=PLhKnvfWKsu41G6LYhTv2kJmDYpgOSuNOi&index=9", "score": 3, "replies": []}]}]}, {"body": "> The IV of the stock itself is just an average or aggregation of individual option contract IV, so it's not going to be as useful in any case compared to the IV on a specific contract.\n\nI guess the reason why IV shows differently on different broker comes from the averaging method itself. For a single option contract, you just have to assume Black-Scholes model is true and reverse the equations to get the IV. This part should be the same for all brokers. Now when they average to get the so-called stock IV, they can weight it like they want.", "score": 1, "replies": [{"body": "But it's the stock IV in question. You can't run stock through BSM to solve for IV, unless you can model it as a 1.00 delta call with infinite expiration. I think the equations would blow up with those values, though.", "score": 1, "replies": []}]}]}, {"body": "FYI, I asked etrade about their IV Rank calcualtions because they were WAY off from what standard calculations show....they said they're calculation was \"propriety\"and wouldn't tell me anything else. IDK if i was speaking to someone who didn't know anything or if they truly are modifying standard calculations. Either way that was all the proof I needed to not trust etrades math.", "score": 4, "replies": []}, {"body": "Woah. IV or IV rank/percentile? \n\nA 13 point difference in IV percentile or IV rank might be just because your broker calculates the figures differently. I throw a party if I find an option that’s 13 IV too cheap/expensive. Its like seeing the S&P at 400 on one broker and 300 on the other.\n\nAre you sure you’re comparing apples to apples? Some brokers show IV 30, the implied volatility of a theoretical 30DTE option. Some brokers show IV of whatever is the nearest expiration monthly at the money options. Can you send some screenshots maybe and I’ll take a look?", "score": 2, "replies": []}, {"body": "AAPL IV is all over the shop because of earnings on the 27th. The confusion is because some brokers hold onto the IV of the Friday before market close. Others carry on calculating over the weekend.", "score": 2, "replies": []}, {"body": "They each use their own formulas so will almost always be different.  They may use the IV rank or IV percentile, which are both valid but will give slightly different results.  \n\nIV is a statical estimate so close is good enough and you’ll never get any numbers to line up unless by coincidence . . .", "score": 2, "replies": []}]}
{"title": "S&P 500 Fair Value ATLEAST 4100 by EOY 2022", "selftext": "Hi all,\n\nI would just like to validate this line of thought, because lot of bears are pointing to 20%-50% correction from current level of 4430, which I find it hard to rationalize.\n\n**Back of the envelop calculation:** In Feb 2020, S&P was at 3385. Now that we are almost out of Covid and employment and GDP is getting to pre-COVID levels, assuming COVID did not happen and applying a very **conservative** **nominal growth rate of 7%** for each year would get you approximately to these levels:\n\nFeb 2020: 3385\n\nFeb 2021: 3622\n\nFeb 2022: 3875\n\nDec 2022: 4100\n\nSo, with S&P at 4430 and Dec 2022 target of 4100, implies a base case correction of only \\~7.5 pct.\n\n**Points in support for the argument:**\n\n1. Fed would not raise rates so rapidly that it crashes the markets\n2. Raising rates means a healthy economy, and historically markets have not crashed when Fed raised rates\n3. The nominal growth rate of 7% is conservatives and does not account for higher inflation and/or the effects of money printing (i.e. as if the money was never printed)\n4. Maintaining full employment, inherently implies healthy stock and bond market balance\n5. Lot of USD denominated debt issued and traded, outside of US. Non-US global economies rely on UST interest rates\n6. Rapid high interest rate is bad for US Treasury (think about debt servicing costs, and US Debt/GDP) and Public and Private Sector Funding.\n\n**Points against the argument:**\n\n1. Extremely high level of Fed Balance Sheet $9 Trn (and also a rapid rise in last 2 years). Pressure to shrink the balance sheet to Pre-Covid level before the next crisis to preserve the dollar value\n2. Possibly some spill over effect of Russia/Ukraine crisis. (But I would think this would bode well for commodities)\n3. Can't think of anything else... Possibly my bias..\n\nSo, I feel another 20% down from 4430 will bring S&P down to \\~3550 and that just seems implausible.\n\n**What do you guys think?**", "id": "sglidk", "created_utc": 1643583640.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 12, "comments": [{"body": "My personal prediction is a lot of chop for 2022. It would not surprise me if the S&P500 ends the year only up 3-4%\n\nMy personal concerns at the moment - the quantitative easing is going to make bonds more attractive. With low bond rates and high inflation - money is being pushed into stocks and real estate. \n\nThe fed is going to turn down the stock market a bit. Does that mean we drop significantly?", "score": 4, "replies": []}, {"body": "To summarize: your prediction states the projected value of the S&P if Covid did not happen, which is 4100, is a potential bottom of the correction we are seeing in the market now.\n\nI disagree. Covid occurring has traumatized the globe and changed its behavior. Further, your before-Covid projected amount does not include all the printing. We printed a fuck ton of money and it cannot be ignored!\n\ne: SPY 500 EOY\n\ne2: positions= all cash, day trading SPY puts", "score": 12, "replies": [{"body": "500 EOY?!?!\n\nA man after my own heart. 🍻", "score": 7, "replies": []}, {"body": "All that newly minted money needs to go somewhere, right? Why not into the market? Most of that new money went to the rich, the rich like the market.", "score": 4, "replies": []}]}, {"body": "I disagree. In our case, I'm concerned about the impending student loan repayments resuming coupled with the massive inflation. If the economy tanks, the fed won't have much room to print a big bailout. Markets might be forced to take it in the chin next time.\n\nConsider that every country that's ever printed a substantial amount of money has experienced a period of hardship shortly thereafter. Based on what I've read, it usually takes about 2 years for the economy to tank. See Greece, Zimbabwe, Hungary, Yugoslavia, and Germany for examples.", "score": 2, "replies": [{"body": "I think COVID was enough of an outlier event that you can't look at what's happened in the last two years the same way you would look at other examples of printing large amounts of money. I'm not saying we won't have an issue because of it, but I also wouldn't be surprised if we got through it relatively \"normally.\"", "score": 3, "replies": [{"body": "It might be... It might. My gut just tells me that on the tail end of a pandemic, it seems counterintuitave that the stock market would hit record levels.\n\nDebt isn't a real problem until actual supply is scarce. As a planet, we've spent centuries \"stocking the pantry\" so luckily things haven't fallen apart yet. \n\nBut the potential issue that I see is... What it another global disaster happens within a short timeframe? It's kind of like living check to check, and then you hit a pothole and break your car - it's like being one pothole away from bankruptcy. I'm not making a doomsday prophecy or anything, but there would be a huge problem if some other major catalyst hit. I'm talking like... Airborne super ebola, a giant solar flare knocking out the grid, rabid pissed off polar bears with katanas. Those sorts of things. Or it could be something not so extreme. Like massive rent increases without massive pay increases. \n\nI got a 4% raise recently, which I'd usually be pretty happy about, but that doesn't really cover the change in cost of living. I think we should just be cautious is all I'm saying. Luckily, the shelves are stocked for now.", "score": 3, "replies": []}]}]}, {"body": "M3 money supply up 50% since 2020...", "score": 4, "replies": [{"body": "This is relevant why?", "score": 2, "replies": [{"body": "^ This", "score": 2, "replies": []}]}, {"body": ">level 1NoseNoseFoot\n\nThe 7% total return rate in-effect ignores the growth due to money-printing. \n\nSo then are we saying that the markets truly did not reach the peak attributable to money printing?", "score": 1, "replies": []}]}, {"body": "I think they are willing to wipe out all the gains from last year.", "score": 1, "replies": []}]}
{"title": "Chances Born of Decline: The Most Opportune Time for Portfolio Reallocation in Three Sectors", "selftext": "Real value investors focus on companies and take a long view.\n\nMany friends asked me whether I think the recent market decline carries systemic risks. Personally, I don't think things are that bad, and the slump is but a normal swing in the stock market. Three main reasons are responsible for the decline.\n\n1.With Spring Festival approaching, some investors withdrew short-term funds to either spend during or cash in before the holiday.\n\n2.Concerned the Fed would raise interest rates, part of foreign capital flowed out of the domestic market, which is also the reason for large net capital outflux.\n\n3.Recently, in response to sharp slides sustained by major funds, many investors chose to redeem their allotments. This prompted funds to sell part of their stock holdings to repay investors. This is why many funds have relaxed purchase restrictions and started buybacks.\n\n[(Contributor: 价值十一年 on westmoney)](https://www.westmoney.com/share/stocknewsdetail?lang=en&id=936683983645839360&color=2&wm=reddit3)\n\n**01**\n\n**Four kinds of people fearing a market slump**\n\nThe recent market decline has scared many investors, but four types of them are the most fearful given my observations.\n\n**First, pure profit-seekers who buy stocks base solely on the K-line trajectory; second, people thinking they have bought the wrong stocks and paid more than they should have; third, people borrowing more money to do leverage trading; fourth, people who are in urgent need of money.**\n\n**The first type of people will only trade by following daily movements of the K-line. They are not experts at investment, nor can they analyze companies. They make bets, only to experience emotional ups and downs as the stock market swings wildly.**\n\nThey may be fortunate enough to make some money in a bull market, but in a bear or volatile one, their losses will even double previous earnings. Their modus operandi is to chase high in an outburst of optimism whenever the market rallies; and sell low amid a bout of desperation and pessimism when the market plummets continuously.\n\nThe pure profit-seekers don't stop until their principal runs out. They have nothing to do with value investing, and I have never seen any gambler of this sort make money for a long time. They might ditch a falling stock like trash but when the bull market comes, they will spend several times the original amount to buy it back.\n\n**The second type of fearful investors believe they know value investing and are indeed capable of analyzing companies to choose the right target, but they are neither rational nor patient and do not follow common sense in trading. They either buy a lucrative stock but at a higher price or are frightened by the continuous slump and dare not invest any more. They are not achievers.**\n\nBeing too faint-hearted and impatient, they appear to be value investors when the market goes well and are sensible enough to swallow the pains from small swings in stock prices. But in the case of extreme events and continued slides, their willpower and rationality will evaporate, and their emotions will get the better of them. Then, they usually will be in a state of self-denial and even doubt the companies and stocks they invest in, wondering whether they make the wrong picks or buy them for the wrong prices. Both scenarios are possible.\n\nAt this time, however, people should ask themselves whether they really make a wrong bet or they are just too scared to trade? And as a result, they are poised to perceive all stocks to be over-priced and assume future losses are on the way? Most people belong to this group of investors when markets are going down.\n\n**The third type of investors are those engaging in high leverage trading, and they are not true value investors either. Any value investor who knows a bit about investment and sticks to its principles will not increase leverage, let alone high leverage.**\n\nA fundamental rule about value investing is that it advises against increasing leverage, since it will not raise the winning rate but only magnify gains or losses. Besides, you spend more for the extra financing. What's worse, there is a risk you might lose everything once the leverage is used.\n\nAdding leverage obviously violates the common sense of value investment, goes against the principles of value investment, and deviates from the risk-aversion concept of value investment.\n\n**The fourth group is those who don't need spare money to invest but are in urgent need of money. Those people have no choice but to buy high and sell low. Likewise, they don't have common sense about trading or respect principles of investment.**\n\nA typical value investor knows that no one can predict the short-term trend of stocks. There are no rules in short-term market fluctuations. Even if a stock reaches the undervalued range, its price will continue to fall and will not rise immediately. Those who wish to make quick money can only count on luck, which is obviously not in line with the concept of value investing.\n\nValue investors should understand that the stock market is not a place to make quick money. Warren Buffett said it would be foolish to expect stocks to rise next week, next month, or even next year! This is not difficult to understand.\n\nTherefore, real value investors focus on companies and take the long view, and no one will depend on luck as the only tool for investment.\n\n**Those who pour their savings for the next three to five years into the stock market are either fools or don't know the common sense.**\n\n**02**\n\n**Best allocation opportunity for three sectors**\n\nIn the face of the continuous market decline, if you are a skilled investor rather than belong to any of the four groups above, you will not be frightened by market decline, but expect it to slip further. Because for value investors, opportunities are born of decline. Currently, many high-quality companies have hit record lows again.\n\n**As long as the slump continues, many companies will see excellent opportunities for portfolio reallocation, such as the consumer, pharmaceutical and Internet sectors, because the valuations of some companies in these sectors are already very low. If the slide persists, great chances will emerge.**\n\nMany friends are worried that this year will be a repeat of what the market went through in 2018. But in fact, this year is vastly different from 2018 for both the economy and the external environment now are much better.\n\nIf we draw comparisons with previous markets, **I think this year things are a bit analogous to the market conditions in 2016, when stocks plunged in January and began to climb slowly in the subsequent few months.**\n\nThe difference is that the decline in January this year was far less precipitous than that of 2016. I remember that the Shanghai Composite Index in January of 2016 tumbled more than 22%, while the dip this year was less than 10%.\n\nTherefore, **don't panic. I think what we've experienced is just normal fluctuations. As for how the A-share market will unfold in the coming weeks, I am more optimistic. As long as we buy stocks of good companies, buy them at prices with large safety margins and invest with spare money, we don’t need to be afraid of market dives.**\n\nIn response, many funds have also started self-purchase plans. According to incomplete statistics, since the beginning of 2022, 22 funds such as Wells Fargo and China Universal Asset Management have announced such plans, with a sum of over CNY600 million involved.\n\nAmong them, Hua An Fund’s self-purchase is not less than CNY50 million, GF Fund CNY80 million, E Fund CNY100 million, and China Universal CNY200 million.\n\nFunds are repurchasing allotments from investors in quick succession, proving that many companies do have long-term investment value. **As value investors, we should not be afraid at this moment but feel excited since opportunities are approaching.**", "id": "sg46cp", "created_utc": 1643529337.0, "score": 5, "upvote_ratio": 0.67, "num_comments": 11, "comments": [{"body": "Great post bro. We have to be excited for what's coming next. The are macro trend that can't be ignore.\nAgain... Growth stocks have already been bit hard. If the market correction will continue... Big tech are next.\nOut there there are opportunities never seen before or for which 1 2 years ago you would have paid to have. \n\nPrudence and patient will payoff", "score": 1, "replies": []}, {"body": "I think it’s speculators deleveraging.  Also managers trying to show a gain for this year will benefit from this.  Sell and buy something new and the “profit number” is easier to hit.", "score": 1, "replies": []}]}
{"title": "Crystal balls on aapl", "selftext": "[removed]", "id": "sgi04u", "created_utc": 1643574287.0, "score": 3, "upvote_ratio": 0.62, "num_comments": 19, "comments": [{"body": "I’m guessing that there will be a little pullback and then in maybe 6 months it will rise again. Don’t forget it stayed around $120-130 for almost a year", "score": 19, "replies": [{"body": "It touched 145 going into a record quarter and then pulled back to 115. That was without the current macro fud environment.", "score": 4, "replies": [{"body": "Yep that was an interesting movement. I think the price was inflated from people buying in for the stock pick. Then it calmed down", "score": 1, "replies": []}]}]}, {"body": "AAPL will be fine. \n\nThey'll likely initiate another $75-100 billion share buyback, which will keep the stock bouyed even in a rocky market.", "score": 12, "replies": [{"body": "Historically they announce their buybacks the Monday following earnings.\n\nSounds like a nice start to the week to me :)\n\nThis is what I am also expecting", "score": 4, "replies": [{"body": "This week will be rocky... Tons of earnings. Most should be good... But we're just in a rocky environment right now.", "score": 3, "replies": [{"body": "Best case scenario.\n\nConcerning my own portfolio. Apple keeps playing the man with the world on his shoulders.\n\nI am antsy because I put 50 bucks into feb 11th 177.5 calls.\n\nWas literally a lotto ticket. 50 bucks, wasn’t expecting anything.\n\nThen earnings made the trade profitable and I haven’t slept since xD", "score": 2, "replies": []}]}]}]}, {"body": "IMO given where the 10y is right now the market is looking a little pricey, and from a sentiment perspective I don't think a 10% drop on the S&P500 after the monstrous returns of 2020-2021 is enough pain given the huge the shift that's now taking place in both the monetary and inflationary environment. We've had a really awful start to the year, like historically bad, so a brief relief rally should now be expected, especially in light of relatively strong earnings.\n\nI'm feeling quite negative about this week overall and will likely sell into any strength. The market needs to come down to a reasonable multiple before we should expect any real recovery. We're at borderline reasonable valuations now and that's just not good enough. It also makes a recovery hard because rallying from here makes no sense fundamentally. In 2018 we had to sell to levels where the market started to look fundamentally cheap and this is usually what you need to lure buyers back into the market with the conviction to hold.\n\nAs for opinions on V and AAPL, I was selling V on Friday. If it's up tomorrow I'll probably sell the rest. V is legit a great company and I've recommended it here many times as one of the best long-term buy-and-hold stocks out there, but right now it's trading at growth stock valuations despite only averaging 10% growth over the past 5 years. Given you can buy stocks like SHOP selling 26x sales and growing at 40-50% a year, I have no idea why someone would buy V trading at 21x sales with only a fraction of SHOPs growth. And I don't even think SHOP is that attractively valued...\n\nAs for AAPL, I think it's expensive as hell. To their credit their buybacks are awesome and I kinda get it why more risk adverse investors like them, but when you consider it's trading at a similar multiple to MSFT which unlike AAPL has serious growth and highly diversified revenue streams I don't really get why someone would want to own AAPL right now. Again, I don't even think MSFT is valued that attractively, but compared to AAPL it almost looks cheap.", "score": 2, "replies": [{"body": "You don’t get why someone would want to own Apple right now?   Seriously?", "score": 2, "replies": [{"body": "I mean I get the buy backs are nice, but they have so much exposure to the consumer that it's hard to think of a company that would do worse in an economic downturn. Combine that with the fact they're trading at a historically high valuation with the lowest growth of all the big tech names, then no, I don't really get why someone would want to own Apple in a risk-off environment. AAPL could easily fall 50%+ in a recession, and even if it fell 50% it would still only be trading at valuations from a few years ago. People are just buying Apple because over the last few years there has been this idea that AAPL acts as a defensive stock, but I've never really heard a good reason why this should be. Yes, they have a lot of cash, but companies like MSFT also have a decent amount of cash along with diversified revenues and a sticky B2B cloud business that has a way better chance of weathering an economic downturn. IMO people act almost superstitious when it comes to AAPL. Some people here literally refuse believe to AAPL might be overvalued or could underperform in years to come, but either it was undervalued for years or AAPL was one of the few stocks in recent years to justify its massive multiple expansion. Just listen to how people talk about AAPL, no one is even arguing it's cheap anymore, they're just arguing that it's AAPL, as if that's a reason to buy.\n\nI mean, if you want to tell me what I'm missing then go for it.", "score": 1, "replies": [{"body": "Well, I can think of hundreds of companies that would fair worse in an “economic downturn”.  I’m sure we can both agree that statement is a tad embellished. \nI don’t think a company that sold more items than realistically expected during the worst supply chain bottleneck ever, can be considered a bad investment.  Compared to some other businesses and forward p/e ratios they are fundamentally overvalued.  They are also an acquisition away or unveiling away from being significantly undervalued.  There are very few companies that have that kind of power….ok just one, Apple. \nI would like to go and on about them but I have heard for years like others that they are a consumer based and you can’t make a new phone every other year and be successful and blah blah blah.   Listen to Dan Ives some, he can tell it best", "score": 1, "replies": []}]}]}]}, {"body": "To be honest, and I will probably get downvoted, I don't buy their \"guidance\" for the easing of supply chain issues.\nJust last month, in the beginning of December, they cancelled production of 10mil iPhones because of supply chain issues. A friend of mine bought a Mac and waited for 2 months for it and ended up cancelling the order because they kept delaying the delivery.\n\nSomething stinks to me and doesn't make sense in their positive supply chain issues outlook.\n\nAnd no, my brokerage doesn't do options so even if I wanted to I wouldn't be able to bet on a drop.", "score": 2, "replies": []}, {"body": "Nobody knows what will happen next week. \n\nPros would say, if you like the stock, buy a little bit every month and don't worry about short-term fluctuations. \n\nOr if you're worried about overpaying, just set a limit order like AAPL $160 or V $210.", "score": 0, "replies": []}, {"body": "Cash is the best position right now…even Buffet know that \n\nhttps://www.bloomberg.com/news/articles/2021-11-06/buffett-s-cash-pile-tops-record-with-149-2-billion-on-hand", "score": -4, "replies": [{"body": "It’s odd to me with inflation near 7% to even consider cash as a best option. A bit of weird times for sure but so far that’s proven correct", "score": 6, "replies": []}, {"body": "November?", "score": 2, "replies": []}]}, {"body": "Sorry, your [submission](https://www.reddit.com/r/stocks/comments/sgi04u/crystal_balls_on_aapl/) in /r/stocks has been automatically removed due to Rule 3:  Low effort.\n\nIf you just want to post 1 liners or just want to know everyone's thoughts, then post a comment to our daily discussion thread which are generally stickied or [click here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+daily+discussion&restrict_sr=on&sort=new&t=all)\n\nIf you're wondering **why a stock moved** a certain way, check out [Reuters](https://www.reuters.com/), [Motley Fool](https://www.fool.com/), and **especially** [Finviz](https://finviz.com/quote.ashx?t=spy) **which aggregates the most news for almost every stock**.\n\nIf instead you're wondering what a term means, go to Investopedia.com and search for said term there.\n\nEither way come back here to repost with your findings, thanks!\n\nA list of the [rules can be found here](https://www.reddit.com/r/stocks/about/rules/), and if you're new to r/stocks please see the [wiki](https://www.reddit.com/r/stocks/wiki/index) and/or [read this post.](https://www.reddit.com/r/stocks/comments/4x1419/if_youre_new_here_read_this_post_first/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "V lagged the market for more than a year while maintaining similar return. I don't expect a lot of downside unless the market crashes. My target is at least $250 by the yearend barring major market level noises. Apple is always good to own.", "score": 1, "replies": []}]}
{"title": "CPI Base Effect Kicks In February 2022 | Growth Stock Short Squeeze", "selftext": "# Thesis\n\nInflation prints will be alot lower than 7% starting in February 2022 and kicking in March 2022 because of CPI base effect (see table below)\n\n&#x200B;\n\n||2020|2021|Delta (mOm)|\n|:-|:-|:-|:-|\n|Nov|260.927|||\n|Dec|261.56||0.633|\n|Jan||262.231|0.671|\n|Feb||263.161|0.93|\n|Mar||264.793|1.632|\n|April||266.832|2.039|\n|May||268.551|1.719|\n|June||270.981|2.43|\n|July||272.265|1.284|\n|Aug||273.012|0.747|\n|Sept||274.138|1.126|\n|Oct||276.274|2.136|\n\n&#x200B;\n\nsrc: \\[[https://fred.stlouisfed.org/series/CPIAUCSL](https://fred.stlouisfed.org/series/CPIAUCSL)\\]([https://fred.stlouisfed.org/series/CPIAUCSL](https://fred.stlouisfed.org/series/CPIAUCSL))\n\nFrom the table, December 2021 has a massive inflation print because of the low inflation in Dec 2020 (delta - 0.633) compared to Dec 2020 because of lockdown.  But as the US economy reopened, inflation and its velocity increased (see chart), so it'll be high hurdle to beat past 7% after March 2022.  In fact, inflation will be start to roll over quick because of base effect in March 2022.\n\nTherefore, if the correction is because of inflation fears, and inflation fears go way be March/April 2022, then we are setting up for a **\\*massive short squeeze**\\* for growth stocks.\n\n&#x200B;\n\n# Call to Action\n\n&#x200B;\n\nBuy calls expiring August 2022 to ride the disinflation narrative and the probability of a growth stock squeeze as CPI base effect kicks in.", "id": "sglf9j", "created_utc": 1643583407.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 12, "comments": [{"body": "\\> massive short squeeze\n\nThat word doesn't mean what you think it means.\n\nSeriously, why do you see kids now use the word squeeze to describe so many different unrelated concepts?", "score": 27, "replies": [{"body": ">Seriously, why do you see kids now use the word squeeze to describe so many different unrelated concepts?\n\nWell when all you've got is a hammer...", "score": 8, "replies": [{"body": ">then we are setting up for a *massive short squeeze* for growth stocks.\n\nWhich growth stocks are even being squeezed right now? Idk how much of the large market caps are effected by puts, and if op is only taking about smaller growth stocks that seem more like the type that could actually be squeezed in the first place.", "score": 3, "replies": []}]}]}, {"body": "How will there be a short squeeze? Is MSFT gonna suddenly gap up 25% overnight? \n\nLet’s keep it realistic.", "score": 6, "replies": [{"body": "I would at least hope that the OP is being reasonable...for me at least, the Nasdaq as a whole jumping 3%+ in one day is a massive move, and I'll pose a question here, termed differently from just saying \"there will be a massive short squeeze\".\n\nWouldn't you think that the Nasdaq jumping 3%+ on the day would include shorts and puts being covered?\n\nBecause that's been my thinking when I've seen that kind of move happen.\n\nI don't really feel like finding it, but based off something that I've seen, the absolute consensus trade right now is short QQQ, and depending on what we see data wise, that can easily end up getting run over.\n\nNo, it's not going to get ran over in a 10%+ day, it's going to get ran over in a 7-10% move that happens over a week+ or so if that were to happen.", "score": 0, "replies": [{"body": ">Wouldn't you think that the Nasdaq jumping 3%+ on the day would include shorts and puts being covered?\n\n\nif they aren't *forced* to cover, then it isn't a squeeze. Just people cloning a short position doesn't make it a short squeeze", "score": 1, "replies": []}]}]}, {"body": "Yes. 100%.  Been thinking the same thing myself but I don’t foresee the base effect taking place until more like may", "score": -1, "replies": []}, {"body": "SARK will squeeze, hard. \n\nim heavily invested in growth stocks. i will be watching this juicy, rip the face short squeeze with popcorns ready.", "score": -1, "replies": []}]}
{"title": "Bear Market Strategy", "selftext": "I have been seeing a lot of conversation on here about hedges, especially options collars. I really like the idea of a collar, except my thetagang brain got to thinking (lol dangerous), and I'm wondering - if I wouldn't mind DCAing down on a few of my high conviction stocks, instead of just purchasing a put, why not sell a PCS? If in the money, I can sell the long put for a profit prior to expiration and take the assignment as intended. Wouldn't this be a best-case scenario?\n\nAlso,  I can't be the first person to think of this - if this strategy has a name, I'd love to read up on it!\n\nEdit: punctuation.", "id": "sgipay", "created_utc": 1643576141.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 14, "comments": [{"body": "This is literally how I wheel\n\nPCS to get into a stock by selling the long to offset costbasis on assigned short put\n\nCollar to cap downside, giving up about a quarter or third of the short call premium to buy a put.\n\nI don't really know what its called, I just call it a Preservation Wheel or Conservative Wheel", "score": 5, "replies": []}, {"body": "Spreads theta decay very slowly", "score": 1, "replies": []}, {"body": "Unless you're keeping a lot of spare buying power, you'll be unable to sell your profitable long put after a steep stock price decline.\n\nIf you do keep enough spare buying power to convert a vertical into a naked put, you'll likely underperform other strategies.\n\nIf you're worried about losing by selling naked puts and you're not using mechanical stop losses, the solution is to not force the trade.  Just don't open a short put position until the stock and its IV teach a level that you feel comfortable selling at.\n\nImagine converting a vertical into a naked put in $BABA, $MARA, $AMC, $ROKU, $DKNG ... I could just go on and on.\n\nEach of these experienced moderate declines of 25% before they experienced severe declines of 50% from their peaks.  Most traders would have cashed out their long put in the first decline to become bag holding after the bigger decline.", "score": -1, "replies": [{"body": "Thanks for your concern. Buying power is not a problem - I'm nearly 70% cash and will find an opportunity to go to about 20% leverage when FUD eases. I'm not in memestocks. This is for my buy and hold portfolio where I sell CCs on my larger positions already, I just don't like the hedging with only a long put. Unless something fundamentally changes in these stocks, I will not sell, and I will not freak out when fundamentals shift and I have to sell.\n\nI've been selling naked puts for 4 years now. My post was more of an inquiry as to why traditional collars are actually the preferred strategy.", "score": 1, "replies": []}, {"body": ">Imagine converting a vertical into a naked put in $BABA, $MARA, $AMC, $ROKU, $DKNG ... I could just go on and on.\n\nThat's why you don't mess with that wsb bunk in the first place. Yeah you can go on and on until you get to indexes or something with actual value.", "score": 1, "replies": []}]}, {"body": "Stepping out of a spread.", "score": 1, "replies": [{"body": "So… you’re saying that this is a good alternative to a traditional collar?", "score": 1, "replies": [{"body": "They're different. A collar is used if you already have a position and want to protect it. You're selling part of your upside potential in exchange for protection from the downside.\n\nStepping out of a PCS is when you first initiate a PCS with the intention that, if it works out, good, you make the income, and if it doesn't, you don't mind owning the shares so you close the long position and let the short leg be put to you. Your intention ultimately is to own the underlying but you're using PCS on it to generate income until the opportunity presents itself to you to own it.", "score": 1, "replies": [{"body": "Yeah. To clarify, I want to mix the two strategies. Have you done this? Have you had success with it? I have existing positions that I’m willing to add to at a certain price in the future. Would act nearly as a rebalance of my portfolio.", "score": 1, "replies": []}]}]}]}, {"body": "I've used this to moderate success YTD. It's not a bad strategy in the environment we are in because I have no clue which direction we are going next. If you have the funds to take assignment you can avoid some of the losses on the way down if we continue dropping. You can also continue to roll the long put further down to continue and widen the spread.  I'm usually wrong about the reversal but I keep scalping on the way down by rolling the long put so eventually the spread is quite wide and behaves more like a CSP. I can't trade naked puts though so I either have to close and open a new position on the short put or just keep the long put in place.", "score": 1, "replies": []}, {"body": "I do this all the time- sell put spreads and leg out. I don’t take assignment though, just manage it as a naked option. I’m selling more calls than puts lately though.", "score": 1, "replies": []}, {"body": "I’ve been thinking about this - what if you wrote a deep OTM spy put spread 10 points wide (maybe you do 360/350 a year out). If the S&P implodes, you can cash your long for a nice gain and then potentially roll a cash secured put until the market recovers or take assignment on an SPY DCA strategy (on the theory that id love to buy SPY today at 360).", "score": 1, "replies": [{"body": "Yeah, I normally stick to shorter timeframes about I have been looking into selling puts at the year timeframe for the past two days. I don’t think I’m going to pull the trigger on something like that until the first rate hike meeting in March. I’m not confident this will happen, but if we get a .5% rate hike that would set the tone for the rest of the year that our expectations are wrong and IV will likely go through the roof.", "score": 3, "replies": []}]}]}
{"title": "What's the difference between Seasonally Adjusted CPI and Non Seasonally Adjusted? The numbers are wildly different.", "selftext": "", "id": "sfyapn", "created_utc": 1643509150.0, "score": 13, "upvote_ratio": 0.81, "num_comments": 10, "comments": [{"body": "#one is seasonally adjusted and the other is not", "score": 27, "replies": []}, {"body": "Seasonal adjustment is when a series is smoothed out to exclude things that are “ordinary” whereas non-seasonally adjustment data is the raw value. \n\nEconomists consider seasonally adjusted data generally superior because they show you what’s going on that’s outside of the norm. \n\nexample given: usually we get 5% more employment at this time of year, this time we got 7% more” The additional  two percent is the news worthy information", "score": 13, "replies": []}, {"body": "TLDR; the COVID era seasonally adjusted numbers attempt to eliminate the impacts of COVID as a “short term event”, which IMHO is monumentally stupid but whatever.\n\n“For analyzing short-term price trends in the economy, seasonally adjusted changes are usually preferred since they eliminate the effect of changes that normally occur at the same time and in about the same magnitude every year—such as price movements resulting from changing climatic conditions, production cycles, model changeovers, holidays, and sales. This allows data users to focus on changes that are not typical for the time of year.”\n\nhttps://www.bls.gov/cpi/seasonal-adjustment/using-seasonally-adjusted-data.htm\n\nhttps://www.bls.gov/cpi/seasonal-adjustment/home.htm", "score": 5, "replies": []}, {"body": "Depending on which direction they want to move the market, they would ask the media to talk about one number over the other.", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 2, "replies": []}, {"body": "One is made up nonsense, the other is made up nonsense with an extra helping of bullshit.", "score": 2, "replies": []}, {"body": "Isn’t this IN Dec 2021 versus SINCE December 2020?", "score": 0, "replies": [{"body": "This brain is extra smooth", "score": 2, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|11|**First Seen In WSB**|2 years ago\n**Total Comments**|280|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sfyapn)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sfyapn)", "score": 1, "replies": []}]}
