{"title": "$1 TSLA PUTS", "selftext": "Just curious...I noticed that there\n\nTSLA 6/17/2022 (629 DTE) Puts for 1.00.  Selling for 0.04.  There is actually substantial volume and OI way down here.\n\nIs this simply just a bet that TSLA is going to implode and go bankrupt?  It just seems kind of silly.  If TSLA does go bankrupt...there may not be any shares at all.  I suppose TSLA could tank and be worth $50/share in the next year...maybe then the puts would be worth more.\n\nJust seems kind of funny and odd to me.\n\nMaybe it's just people taking a bearish position...but it seems like a better way to do that would be to sell a bear put debit spread at a strike of 50 or 100.  IDK", "id": "j0jn0y", "created_utc": 1601176037.0, "score": 191, "upvote_ratio": 0.9, "num_comments": 71, "comments": [{"body": "Sometimes dealers will scoop these up as a hedge. If you’re running a relatively large book of Tesla options and need to hedge out some greek exposure, weird options like this might be a good fit. This case seems like a stretch and might literally be retail messing around... but impossible to say.", "score": 227, "replies": [{"body": "It's TSLAQ donations to market makers.", "score": 82, "replies": [{"body": "Hey Elon 👋", "score": 33, "replies": []}]}, {"body": "Highly unlikely. These options have almost no Greek or margin implications. The tiny options dealers scoop up would be more likely in the $40-100 strike range. Just think about it, if you’re about to go broke but $1 puts save you? No lol. What actually likely happened is a market maker moved their vol curve and accidentally bought them from another market maker.", "score": 49, "replies": [{"body": "Hence the part of my comment that said “this case seems like a stretch”. \n\nJust wanted to provide some context that sometimes a dealer will scoop up seemingly nonsensical options to pin some outstanding greek risk.\n\nBut I think you have a part misunderstood- these trades from dealers aren’t meant to save them from “going broke” as much as they are to meet a risk limit. Yeah, nobody thinks this is going to save an ENTIRE BOOK, but maybe I need to meet my vega limits overnight and this is one weird/cheap way to do it without taking on virtually ANY delta/gamma exposure. Is that what is happening here? Probably not... this is most likely (like I said in the initial post) meme trading.", "score": 16, "replies": [{"body": "First, I appreciate the back and forth. Fun to see someone else with knowledge of the business in here, there’s a few of us lurking around. \n\nNo I know what you mean lol, it’s my job to. But these puts will have almost no Vega to them. A Vega vs delta graph looks like a bell curve and they would be buying way way way way out on the wings.  The $1 put has .002 Vega. The $40 put has .11 Vega (also have very little delta/gamma), which is 55x as much and the price to Vega ratio is similar. As a market maker I’d MUCH rather own the $40 put because it’s a lot more likely I can get rid of it for a fairish price later. Many market makers only quote down to a certain delta (or they keep the tiniest options the same width as larger delta options) because the model can get a little wonky on tiny options and let’s face it you’re gonna have to take these off with another market maker not a customer.\n\nSo I agree this was likely dealer hedging, but I don’t agree this was the optimal way to do it. If for nothing else the Vega of these puts is probably not super correlated to whatever they’re trying to hedge and they basically tricked their risk department. My risk manager would be like okay you’re good and my boss would be like wtf did you just do.", "score": 7, "replies": [{"body": "Yes I understand and I’m totally agreeing with you. I guess I should’ve made it more clear in the original- I was more so saying: “sometimes you see unusual activity on really strange options because of MM risk management, BUT, this is most likely not the case here. \n\nI remember looking into my order flow database one time on MSFT and seeing MASSIVE buying (volume was roughly equal to open interest that day) around the ~ 170% / 190% (can’t remember exactly) call spreads with around 2 months to expiration... was confused until a MM explained the concept. Thought it might be useful to pass along here, but should’ve been more explicit in the whole “yeah but that’s probably not what happens with a $1 put” haha.", "score": 5, "replies": [{"body": "I appreciate the insight, have a wonderful Sunday!", "score": 4, "replies": [{"body": "You as well- The options reddit is lucky to have AceBuddy around.", "score": 4, "replies": [{"body": "Now kith.\n\nJ/k, thanks to both of you, interesting read!", "score": 5, "replies": []}]}]}]}]}]}]}, {"body": "That’s not a hedge though. Like, think if it this way. Everyone in the universe has tsla $0 puts. You have the right to sell Tesla at $0 and so so I. A $1 put is useless as a hedge because if you’re long Tesla shares, being able to sell them for $1 instead of $0 is a matter of 0.25% of your position.", "score": 15, "replies": [{"body": "It's not a hedge for being long shares, it's a hedge for greek exposure like OP said.", "score": 9, "replies": [{"body": "Yeah but you can’t hedge your greeks with options that have no greeks.", "score": 18, "replies": [{"body": "Not sure I'm understanding this statement. The price of a $1 option is basically going to be static over a wide range of typical underlying moves, but should volatility explode /and/ the stock tank hugely, you could easily expect those $1 options to rather rapidly have increasing greeks\n\nIt seems it would take 3 weeks of continuous limit-down moves for these options to start showing value, that seems massively unlikely, but also the kind of tail risk that caused 2008. Seems like a reasonably plausible hedge", "score": 6, "replies": [{"body": "[removed]", "score": 8, "replies": [{"body": "You’re just thinking in terms of hedging via the price of the underlying option. That’s not the point. \n\nI need to hedge, if i’m managing a large book of TSLA options, various risk parameters as defined by the greeks. I’m not worried about making $X when TSLA crashes, I’m worried that I’m too short notional vega or I’ve gone over my gamma limits. You’re thinking like a retail would hedge a static position in the underlying stock, not like a dealer is managing an entire book of options. \n\nNow, as I stated above and as you alluded to, this case is a stretch because on the initial trade you’re not picking up much long vega. If it really starts falling, sure you’re scooping up more and more, but again, it’s really a stretch here and as another post mentioned, a pin trade like this would likely be at a much higher strike. But the premise is you’ve pinned some level of greek exposure at a far out price and given a scenario that would be painful to the book (say a rapid decline in price), this option would come in to save the day on one or many of your various risk limits.", "score": 6, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "What is the limit Tesla (or any stock) can move down in a day?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The LULD just provides intraday trading halts, right?  Does it have any effect on open/close gaps?", "score": 1, "replies": []}]}]}]}]}, {"body": "Can you give me an example where that changes anything?", "score": 3, "replies": []}]}]}]}, {"body": "You can sell and collect 4 dollars in June 2022. It's better than a savings account at least for the same collateral.", "score": 64, "replies": [{"body": "You know, that's not a bad idea.\nA 2yr cd pays 1.15% at best\nIf you pay 65c/contract, this selling these puts would be equivalent to 1.95% APY.", "score": 10, "replies": [{"body": "stocks are just retarded \n. Where does the money come from, dave?", "score": 1, "replies": []}]}]}, {"body": "It's just retards playing with each other", "score": 110, "replies": [{"body": "LMAO", "score": 24, "replies": [{"body": "And OP a retard for thinking it's anything more then that.", "score": -12, "replies": [{"body": "That bong you got there...is it glued to your lips?", "score": 1, "replies": []}]}]}, {"body": "Retards. Indeed.", "score": 10, "replies": []}, {"body": "Honestly, probably.", "score": 1, "replies": []}]}, {"body": "SPY 380c .10/contract exp 10/26. Lots of funky stuff for Greek hedging.\n\nEdit: plus election", "score": 21, "replies": []}, {"body": "There was a similar \"oddly low\" tsla P post on a sub the other day- can't find it sorry, but the top comment was something of the way that large traders/funds usually have to hold a certain % for risk management legally & the consensus was that this was most likely the reason (for that post anyway). ...  Seems similar here ¯\\ _(ツ)_ /¯\n\ne Love the handle too! Supposed to see DSO this week but tickets were snagged up before I pulled trigger, hopefully a couple free up! ⚡❤️⚡", "score": 12, "replies": [{"body": "Right on!  Listening to 7/27/73 Bird Song as I peruse this thread on 1 dollar TESLA puts.", "score": 8, "replies": []}, {"body": "You dropped this \\ \n *** \n^^&#32;To&#32;prevent&#32;anymore&#32;lost&#32;limbs&#32;throughout&#32;Reddit,&#32;correctly&#32;escape&#32;the&#32;arms&#32;and&#32;shoulders&#32;by&#32;typing&#32;the&#32;shrug&#32;as&#32;`¯\\\\\\_(ツ)_/¯`&#32;or&#32;`¯\\\\\\_(ツ)\\_/¯`\n\n [^^Click&#32;here&#32;to&#32;see&#32;why&#32;this&#32;is&#32;necessary](https://np.reddit.com/r/OutOfTheLoop/comments/3fbrg3/is_there_a_reason_why_the_arm_is_always_missing/ctn5gbf/)", "score": -1, "replies": [{"body": "bad bot", "score": 1, "replies": [{"body": "Thank you, TurbidContention, for voting on LimbRetrieval-Bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)", "score": 0, "replies": []}]}]}]}, {"body": "[removed]", "score": 6, "replies": [{"body": "Bid/Ask was 0.04 / 0.05.  There was like > 100K OI there too.", "score": 9, "replies": []}]}, {"body": "You son of a bitch I'm in.", "score": 5, "replies": []}, {"body": "So theoretically I could sell 100 of these puts and collect $500 on June 17th 2022? Really seems fishy, like someone is fucking with me. I mean Tesla stock selling under $1 seems insanity.", "score": 5, "replies": [{"body": "But the bid is .04 and there are thousands of asks at .05. Likely you would sell the 100 contracts at .04 - commission/fees ( for me on TDA it is .67 per contract. So really you would net $333 and lock up $10,000 in funds for 20 months.\n\n Seems inefficient", "score": 2, "replies": []}]}, {"body": "If there’s no bid there’s no value.", "score": 3, "replies": [{"body": "There was...bid/ask was 0.04/0.05", "score": 2, "replies": []}]}, {"body": "MM balancing a book likely.  Looking at pure Greeks.  Everything has to be very flat to trade the spread.", "score": 7, "replies": []}, {"body": "What strike price? You didn't specify. Edit: Sorry, $1 lol. Nvm.", "score": 2, "replies": []}, {"body": "I'd say it's hard to imagine that people want to get thetacucked hard enough to buy anything like that, but people continue to prove that wrong, so I guess", "score": 2, "replies": []}, {"body": "Think about a 4% return for 15 months excluding fees and stuff lmao", "score": 2, "replies": []}, {"body": "Can you guys help me explain the phrase “puts for 1.00, selling for 0.04.” I’m a student trying to learn more about optione. I understand the concept of options, puts and calls, but I can’t understand the words use", "score": 2, "replies": [{"body": "Someone sells Tesla Jan 2022 $1.00 Put for $0.04 premium.", "score": 10, "replies": []}, {"body": "Someone is selling a put with a strike of 1.00 and expiration of January 2022 for a price of 0.04 x 100 = $4.00 (because each contract controls a 100 shares)", "score": 3, "replies": []}]}, {"body": "where you notice this?", "score": 2, "replies": [{"body": "I looked at the TSLA options chain on my Schwab acct.", "score": 3, "replies": []}]}, {"body": "No ones bought any so price hasn’t updated", "score": 1, "replies": []}, {"body": "I honestly think people buy/sell these options just for the meme", "score": 1, "replies": []}, {"body": "hedge", "score": 1, "replies": []}, {"body": "Wouldn’t be surprised if a market maker is pulling the SoftBank tactic. If they buy enough of them, the writer has to acquire short shares to cover some or all of the position.", "score": 1, "replies": [{"body": "Seems to be the case. If not SoftBank -  it's Saudi. \n\nEveryone did not do well on Battery Day. These are hedges against previously owned contracts that are likely out of the money.", "score": 1, "replies": []}]}, {"body": "Could be easy naked sells, you sell the DOTM garbage and make your money that way, it’s very easy to make money that way.\n\nJust there is a shock value that you might have to manage the positions if there is a big move, the brokerage will increase the requirements and if you fall under that you’ll have to buy back", "score": 1, "replies": []}, {"body": "On the other hand, $1 calls are going for a measly $40k", "score": 1, "replies": []}, {"body": "Well, tsla 5 year notes yield about 4.5% now, which is almost 4% more than treasures. Looks like if you sold a cash secured put with two years to maturity you'd need to put up $100 in collateral and you would collect premium $5 while you wait. The bond seems like a slightly better deal. So, I would say the put option is trading somewhat cheap. Maybe someone is selling those and buying the bonds, trying to make a 1% yield spread arbitrage.", "score": 1, "replies": []}, {"body": "When I first started selling CSPs, this was one of my first types of trades just to make sure I fully understood things before making larger trades. I figured if I didn't understanding things correctly then my downside was limited given the low strike. After a couple months I was able to sell for a measly profit ($6!) but had gained some experience/knowledge", "score": 1, "replies": []}, {"body": "There was also some puts all the way out at a 2400 strike for 4800 or something wild", "score": 0, "replies": []}, {"body": "Yes, that’s a play on Chapter 11. Probably a great investment, because Chapter 11 is in this company’s future. If shares get canceled, that’s .96 profit on each contract.", "score": -5, "replies": [{"body": "LOL re the chapter 11 comment.\n\nBut if shares get cancelled....the options are worthless as you can't get stock, no?  So you either lose or gain the premium.", "score": 2, "replies": [{"body": "The stock trades while in bankruptcy, and goes down before the filing.", "score": 1, "replies": []}, {"body": "Puts are contracts that allow me to sell at a certain price. Just exercise a couple days before the stock gets cancelled and receive the maximum payout. The contract is guaranteed by the OCC.", "score": 1, "replies": []}]}, {"body": "Gordon Johnson, is that you? Thanks for funding my retirement.", "score": 0, "replies": [{"body": "Don’t act like .04 is this shitload of money for an options contract. It’s investing in the possibility of a binary event occurring within a timeframe. Acting like Tesla is this company that is immune from market forces is interesting. They haven’t consistently been profitable, have had cash problems, and competition is popping up all around them. There are many reasons outside of Chapter 11 that would cause the options down there to increase in value. For example, people could just realize that the current valuation is batshit crazy.", "score": 0, "replies": [{"body": "They are the market force. They have $10B cash. They could easily not be building the world's 3 biggest factories and kick out dividends instead. That'd be stupid. Most of their 'competition' is still in the planning stages, and saddled with unmanageable debt. But you think they're going ch11. You should run your numbers again and look at the bigger picture.", "score": 1, "replies": []}]}]}]}, {"body": "Was this mystery ever solved? They’re still there.", "score": 1, "replies": []}, {"body": "Almost certainly related to margin. Rules have change dramatically during the meme craze of the roaring 2020's", "score": 1, "replies": []}]}
