{"title": "What is a fair value for AAPL & TSLA?", "selftext": "[deleted]", "id": "iymmnf", "created_utc": 1600908164.0, "score": 3, "upvote_ratio": 0.57, "num_comments": 69, "comments": [{"body": "How do you know they are both very overvalued?", "score": 19, "replies": [{"body": "I'll say this, if you'd started this year claiming Apple was 50% undervalued you'd have been laughed out of the room.", "score": 14, "replies": []}, {"body": "Its what analysts are saying from CNBC to seeking alpha!", "score": -24, "replies": [{"body": "Oh. The analysts.", "score": 24, "replies": [{"body": "[https://www.marketwatch.com/story/apple-stock-drops-after-downgrade-at-ubs-2020-09-23](https://www.marketwatch.com/story/apple-stock-drops-after-downgrade-at-ubs-2020-09-23)", "score": -12, "replies": []}]}, {"body": "Oh boy, another follower just blindly listening to analysts", "score": 10, "replies": []}, {"body": "Same analysts also giving Nikola Buy rating...", "score": 7, "replies": []}]}]}, {"body": "I have a hard time seeing Apple going under $100. I think psychologically if it gets to say 99.80 you’ll see a lot of buyers. The same reason $9.99 seems cheaper than $10.\n\nIf they see it below $100 it’ll get bought to get above $100.\n\nI think Apple is a buy and hold forever. Don’t think about it - get in and DCA over the course of a few weeks, months, etc.", "score": 15, "replies": [{"body": "I hear ya, but last week i was ready to buy AAPL but because i got cold feet, i held off and look at it this week, its still going down. So just trying to set a reasonable price for myself. I guess what you are suggesting is about 100$ for apple which is good to hear. Thanks.", "score": -10, "replies": []}]}, {"body": "Please don't compare overvalued stocks and use apple vs tesla. One is a little overvalued while the other has the next 10 years priced in.", "score": 35, "replies": [{"body": "Give this man a cookie! He knows what's up.", "score": 1, "replies": []}]}, {"body": "$TSLA im buying with every check i get", "score": 17, "replies": [{"body": "I buy one share of apple every check to stash away and not touch for a while", "score": 6, "replies": []}]}, {"body": "Apple is sitting at 32 PE that’s not outrageous. I think it’ll have a tough time dropping below 100 but who knows at this point", "score": 14, "replies": [{"body": "Iphone 12 is the biggest upgrade/release since 6.  Many have been holding out upgrading waiting for this to drop (myself included with my 3 year old X).  And with all of the work-from-home sales increases in other categories which will only increase this fall-winter AAPL is positioned to have terrific sales/forecasts in the next couple earnings.  \n\nI increased my position when it was still in the 120s to bring average to ~101.  And I've zero worries if short term somehow brings it below that.  As Buffet's said 'AAPL is basically one of the best companies you can find'.  (paraphrasing but that's the essence)", "score": 7, "replies": []}]}, {"body": "If you are investing 5+ years, buy every time it dips 10% or any chance you get. guaranteed it will look so cheap then. Especially Tesla with what they announced at Battery Day.\n\nIf you are a trader, well good luck", "score": 5, "replies": [{"body": "Why do you still believe in what Musk says about future timelines? FSD was suppose to be complete since 2016, he's been saying FSD coming eoy every year. Man's also said there will be a 25k Tesla in 3 years... In 2018, now it's 2020 and it's still 3 years away. He said there will be a 620mile range model s in 2 years... In 2015. He said the plaid model s was suppose to come this year, but now it's pushed to eoy next year. The roadster was suppose to be eoy this year with 100+ more miles than what the plaid model s will have eoy next year. Also remember the battery swap he showed off in like 2012? What happened to that? What about the solar city roof presentation? How many roofs actually have the solar shingles? There's so much more that he's lied about.", "score": 1, "replies": [{"body": "because he is the only one with any sort or timeline and Tesla innovation far outpaces other companies in the sector. There is no one else even close. He may be late, but he does deliver.", "score": -1, "replies": [{"body": "Please point to any innovations made with level 5 FSD that other companies haven't made. Waymo and others are way ahead of Tesla's adaptive cruise control.", "score": 1, "replies": [{"body": "Oh you are talking about the level 5 FSD of waymo that can only drive on pre mapped roads or the level 5 that are in no mass produced cars. Your talking about that FSD....Got me there\n\nIll believe them when they can mass produce those results. At least Tesla Autopilot is actively improving and in real cars. The amount of data they get from all those vehicles on the road is huge to achieving full autonomy", "score": 1, "replies": []}]}]}]}]}, {"body": "Lol you're never going to buy Apple at $90, slugger", "score": 19, "replies": [{"body": "It was $93 the day before they announced the stock split and nothing fundamentally has changed since then so it can definitely get back into the $90s.", "score": 6, "replies": []}, {"body": "The tech selloff just began...you dont think it can easily hit 90 by end of month?", "score": -15, "replies": [{"body": "It's not impossible but it's very unlikely.  That would mean the most valuable company on Earth went down 33% in 30 days without a tangible catalyst.", "score": 19, "replies": [{"body": "You really think a stock that's up +100% in the last year can't drop 33% unexpectedly?\n\nThey've already dropped 25% in the last 23 days. If they drop another 15% they'll hit $90, which was their July price and would *still* leave the stock at +65% gain from 1 year ago. They dropped 33% in March. In 2018 they dropped 45% from October to December, erasing that entire year's gains. I can guarantee you they will hit $90 sometime in the next 6 months, but I'm a gay bear.", "score": 14, "replies": []}, {"body": "Unlike the complete opposite, going up 100% without a tangible catalyst, which is indeed entirely possible.", "score": 2, "replies": []}, {"body": "I think you are living in a bubble mindset. This company makes luxury/expensive mass goods in china, at a time when there is a recession going on and a trade war with china. The only reason that the stock is not at 50 $ atm is because of the massive money printing and stock euphoria that came with the first wave of COVID.\n\nEdit: some possible catalysts - regular market crash that could occur with second corona wave, penal action from china in retaliaton to the wechat ban or election related insecurities", "score": 1, "replies": []}, {"body": "Happened to the biggest companies during the dot com bubble", "score": 1, "replies": [{"body": "It's literally happened to Apple multiple times in the last few years lol. In the 2018 correction it dipped 30%+ within a couple weeks.", "score": 3, "replies": []}]}]}, {"body": "Don't listen to him it was just at $90 two months ago", "score": 7, "replies": [{"body": "Probably because America began to face a pandemic. Since then tech has made many changes within their company, obviously", "score": -4, "replies": [{"body": "And exactly changes has \"tech\" made within their company?", "score": 5, "replies": []}, {"body": "Lmao you think they've fundamentally changed since July?", "score": 4, "replies": []}]}]}, {"body": "Hey man how's your plan of buying Apple at $90 going?", "score": 2, "replies": []}, {"body": "Did you get in yesterday?", "score": 1, "replies": []}, {"body": "Did you buy Apple yet or still waiting for $90?", "score": 1, "replies": []}]}]}, {"body": "I just asked my magic 8 ball and it said buy tesla at 250", "score": 4, "replies": []}, {"body": "$420 bruh", "score": 3, "replies": []}, {"body": "First off with out any context you shouldn’t say these stocks are very overvalued. There are many factors that one should look at when trying to place value in something, and everyone will have a different opinion. Here’s an example one person might look at a run down house and say no way I’m paying 300k for that piece of shit. Whereas another may say wow look at this investment opportunity similar sizes homes in this area are selling for 500k. Furthermore In my opinion the next iPhone isn’t entirely “priced in” despite recent articles from an analyst. The only numbers they can use to predict future sells are based off last year numbers which are not relevant because the new phone will be a superior upgrade vs the previous year models.", "score": 4, "replies": []}, {"body": "I wouldn't buy TSLA right now unless it drops below $310\n\n\nI would buy AAPL anytime I think, even at the current price. But as for how low I would guess it could go, I would say it might go as low as $100, but I think there is a certain psychological thing that anything lower is a deal that people would jump on, so I think that is it's bottom. Total and complete guess, but that's just me", "score": 3, "replies": []}, {"body": "Apple $93\n\nTesla  $319", "score": 4, "replies": [{"body": "Thanks, this is kinda what i was looking for....other peoples personal buy numbers.", "score": -1, "replies": [{"body": "Why? Who cares what people's personal buy numbers are. Most likely its all wrong.", "score": 6, "replies": []}, {"body": "Oh, my “buy” numbers are 103 for AAPL and 330 for TSLA.", "score": 2, "replies": []}]}]}, {"body": "If this is a real sell off and not just a buying the dip opportunity:\nApple under 80\nTesla under 200 \nIf this is just one of those 3 day sell offs:\nApple 90\nTesla 300\n*** I’m buying half my position at 90/300, then waiting, and if it hits the 80/200 mark, I’ll buy the rest of my position... if it goes lower than that, I’m buying on margin", "score": 2, "replies": [{"body": "Ur out of ur damn mind if u think appl is going 80", "score": 5, "replies": [{"body": "I said the same thing you are saying in 2018, then Apple went from 56 to 37 (price adjusted to post split prices), I said the same thing you are saying this year, then it went from 81 to 56... the pattern seems to be (on a true sell off) to drop to the previous high... now is this going to be the “real sell off”?” I don’t know... I actually thought the real sell off of all stocks wouldn’t happen until November, and oct is going to be a strong month... but who knows 🤷🏼‍♂️", "score": 3, "replies": [{"body": "I feel like trump gonna pump oct for elections", "score": 1, "replies": []}]}]}, {"body": "I think it is a 1-2week sell off just like after the split. \n I am really starting to understand crowd behavior and the panic of inexperienced investors.", "score": 2, "replies": []}]}, {"body": "Start small position and keep adding as it goes lower ..... as of now nobody knows where they are all going .... it will be smart to dollar cost average than chase at higher prices", "score": 1, "replies": []}, {"body": "It's entirely dependent on macro conditions that have nothing to do with the companies Start with whether we get a second stimulus or not.", "score": 1, "replies": []}, {"body": "Lol if you want to be an analyst slave then median price target of the top 36 is $125, average is $118. Your target of $90 is pretty low. \n\nI also saw you posted UBS, the downgraded AAPL to Neutral but UPGRADED target price from $106 to $115. \n\nEither way it’s pretty obvious that the new iPhone isn’t priced in after that event. Neither has the news from the event been priced in since so many people are concerned about the iPhone. I’d say AAPL fair value is $115.", "score": 1, "replies": []}, {"body": "I’ll give you advice I was given when I posted about investing in Apple. TIMING IN THE MARKET > TIMING THE MARKET! Sure, take an L and be in the red but if you believe in a stock, you’re fine! Apple is SUPER solid and a buy until I die. Buy all them dips. You’re fine. I love looking at Apple pattern, it goes from 104 - 110. Dips. Goes up. Dips again. \n\nSame thing goes with positioning in Tesla, buy it now, buy up dips. \n\nAverage down. \n\nBuy - Hold.\n Does not matter for long term investing & sure wont be a millionaire overnight, but you’ll know that your stock is in a “safe stock”.", "score": 1, "replies": []}, {"body": "there is no such thing as a FAIR VALUE\n\nthere is INTRINSIC VALUE, then there is HYPE\n\ncurrent price = intrinsic price + hype premium\n\nIf you are the type of person that think hype is worth dog shit, well don't buy tech stocks in like at least 2-3 years", "score": 1, "replies": [{"body": "HYPEBEAST", "score": 1, "replies": []}]}, {"body": "If we stop throwing fundamentals out the window on Tesla at some point, I can see worse than what I was telling somebody earlier, something like below $200, but who knows if that happens and that's not a company worth touching with any case to me at the moment. But if there's anything I get bearish and frustrated about, it's Tesla even though I'm only an observer.\n\nThe absolute worst case Apple scenario is probably $80 and if we see worse anytime soon (like the next 6 months), the Dow probably went under 20k and although I'm not going to rule it out entirely, I think it's unlikely. But I do wonder about how much more they'll innovate over the coming decade+.\n\nMore realistically, Apple might touch the 100 sma and that's closer to the mid 90s.\n\nWhile you can consider Apple a bit of a cult stock like Tesla, you're comparing slightly overvalued to hilariously.", "score": 1, "replies": []}, {"body": "I hate to say it but Elon Musk is absolutely the Ringling Brothers of our time.\n\nI'm going to write put options on Apple around the $90 strike price which means I feel that a very good price for Apple in the next 6 months is $90.", "score": 1, "replies": []}, {"body": "Apple and Tesla shouldn’t even appear in the same paragraph when talking about what’s over valued or not. The first paragraph just reads: TSLA TSLA TSLA TSLA TSLA", "score": 0, "replies": [{"body": "my bad", "score": 0, "replies": []}]}, {"body": "Apple is one of the best stocks to write put options so if you don't know anything about that do some research but you would need the equivalent of 100 shares to get involved which is $9,000 for the 90 strike price...   for anyone out there reading this just imagine getting paid to pick a cheap price on an excellent company.\n\nIf it goes below that price you are obligated to buy it which means you are buying it at a cheap price and if it doesn't you get paid by someone else for the right to do so.", "score": -1, "replies": [{"body": "Hum does it really work like that ?\n\n\n If you write a put option for 90 at the time the stock is 100. Then the price goes lower than (90- premium) you'll still buy at 100 but now you have a stock that might be worth 85.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yes that is correct so you will get paid to pick your price.   I only recommend doing it with good quality names at lower prices that you are willing to pay...   it's a more conservative approach but it's nice getting a little extra money to buy a stock at a lower price", "score": 1, "replies": []}]}]}]}, {"body": "One dollar", "score": 0, "replies": []}, {"body": "I’d say $85-90 for Apple and $120 for Tesla. If I’m just eyeballing.", "score": -4, "replies": [{"body": "Don’t eyeball", "score": 1, "replies": []}]}, {"body": "Book value which is way lower. Esp TSLA $12 bucks. AAPL: $4.5. This is for reference only.", "score": -1, "replies": []}, {"body": "I have a limit set for a 1k buy at $95 per share", "score": -1, "replies": []}, {"body": "[deleted]", "score": -13, "replies": [{"body": "Is this not a discussion about stocks on a subreddit called r/stocks", "score": 15, "replies": []}]}, {"body": "Tesla is very tricky, it’s possible it can get to $350 again but don’t hold your breath. As for Apple, it will go under $100. They have lost over $200 billion in market cap so far and this isn’t over.", "score": -4, "replies": []}]}
{"title": "First successful cash secured put", "selftext": "No big gains, nothing to write home about but I'm excited to report that my first ever CSP was a success. I recently discovered this group along with a couple of theta gang strategies. I decided that wheeling was something I wanted to do and it fits me perfectly. The first step was to do a cash secured put, which I did.\n\nHere's the trade:\n\n* STO $PYPL 165 Put Sept 25th 2020 @ 0.99\n* BTC $PYPL 165 Put Sept 25th 2020 @ 0.05\n\nhttps://i.imgur.com/GRYZzZp.png\n\nTechnical analysis:\n\nhttps://i.imgur.com/xbvT31x.png\n\nLetting theta works for you is definitely more rewarding than anything else.", "id": "iz3bzb", "created_utc": 1600973674.0, "score": 90, "upvote_ratio": 0.91, "num_comments": 75, "comments": [{"body": "Congrats! I'm starting to build up my portfolio to start wheeling next week.", "score": 10, "replies": [{"body": "Awesome. Best of luck my friend 🙏🙏", "score": 8, "replies": [{"body": "Thank you. You as well!! Here's to many more profitable years in our journey 😄", "score": 6, "replies": []}]}]}, {"body": "This is great bro. Don’t forget to start your YouTube channel soon!", "score": 11, "replies": [{"body": "Lol. I don't think im capable of that. Still very new to this theta gang world.", "score": 2, "replies": []}]}, {"body": "Gj bro, the beginning is the hardest part.", "score": 9, "replies": []}, {"body": "I wish I could sell CSPs.... damn Canadian RRSP accounts don’t allow for it... just covered calls for me :(", "score": 7, "replies": [{"body": "Move to the United States Texas and become a citizen", "score": 7, "replies": [{"body": "Ahh the good ‘ol United States of Texas 🙃", "score": 2, "replies": []}]}, {"body": "Use an unregistered account", "score": 1, "replies": []}, {"body": "Off-shore brokerage?", "score": 1, "replies": []}, {"body": "I could but I pay zero taxes in my RRSP account.   Plus you guys are a bit scary right now.... riots and plague and such.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Thanks. It's a custom script, you can get it here https://usethinkscript.com/threads/buy-the-dip-indicator-for-thinkorswim.3553/", "score": 8, "replies": []}]}, {"body": "Nice and congrats!\n\nEnjoy your new life as an option seller.   Live long and prosper.", "score": 4, "replies": []}, {"body": "how long did you hold this for?", "score": 6, "replies": [{"body": "4 days", "score": 7, "replies": []}]}, {"body": "I closed PTON for 8 bucks. It’s not worth it if the stock spikes by 10% tomorrow.", "score": 5, "replies": []}, {"body": "Awesome! Way to get time on your side!", "score": 6, "replies": []}, {"body": "GJ! TA is a waste of time for this imo. You'd be better served looking at an IV chart if you're gonna start premium collecting.", "score": 8, "replies": [{"body": "Where is the best place to find an IV chart?", "score": 3, "replies": [{"body": "https://marketchameleon.com/\n\nnot sure what others use, but I like this for current and historic IV charts", "score": 3, "replies": [{"body": "Thank you both!", "score": 1, "replies": []}]}, {"body": "If your broker doesn't have one, you can download ToS or use marketchameleon.com", "score": 2, "replies": [{"body": "**I found links in your comment that were not hyperlinked:**\n\n* [marketchameleon.com](https://marketchameleon.com)\n\n*I did the honors for you.*\n\n***\n\n^[delete](https://www.reddit.com/message/compose?to=%2Fu%2FLinkifyBot&subject=delete%20g6grjx2&message=Click%20the%20send%20button%20to%20delete%20the%20false%20positive.) ^| ^[information](https://np.reddit.com/u/LinkifyBot/comments/gkkf7p) ^| ^<3", "score": 2, "replies": []}]}]}, {"body": "I'm new to this. Any feedback or suggestion is always appreciated. What do you look for in term of IV? Do you also look at Probability of ITM %? or POP%?", "score": 1, "replies": [{"body": "Pretty simple. I choose a stock with an IVR of at least 40. Premium is higher and there's less risk of a volatility pop fucking you over. Since you're collecting a higher premium, your breakeven is also wider. Since we're doing 90% chance trades, that 10% will catch up to us eventually, and when it does you need to make sure you've collected enough premium to not get wiped out. For this reason, I also advocate selling strangles instead of just CSP's alone. You're not using that much more buying power and you're effectively doubling your credit. Though I see how there's a mental hurdle to overcome in order to start feeling comfortable with strangles. \n\nMy last bit of advice is to think about starting to sell much further out options to take in more premium.", "score": 7, "replies": [{"body": "I overcame the fear of naked calls on this pullback real quick. Selling strangles on high IV seems like a good way to go.", "score": 3, "replies": []}]}]}]}, {"body": "How did you determine a price that you're comfortable holding, if assigned?", "score": 3, "replies": [{"body": "Mostly TA, such as support and resistance levels. I also use the BTD indicator to identify when a stock is undervalued in terms of the selloff.", "score": 6, "replies": []}]}, {"body": "what does the sto and btc mean?", "score": 3, "replies": [{"body": "Sell to Open. Buy to Close.", "score": 5, "replies": []}]}, {"body": "Hello im new too how much cash did you have to cover this particular call with?", "score": 3, "replies": [{"body": "You take the strike price x 100 - premium received. So about 16,400.", "score": 3, "replies": [{"body": "Oop ye aint affording that hah", "score": 3, "replies": [{"body": "Could always do a poor mans covered call which isnt really the same but helps u farm theta on large stocks without owning the stock or doing vertical spreads", "score": 1, "replies": []}]}]}]}, {"body": "sweet. i sold a ba like a month out this morning for like $1300 weee", "score": 9, "replies": [{"body": "Why do you sell monthlies vs Weekly’s ? The premium will be almost the same +- some but what upside do you get?", "score": 5, "replies": [{"body": "less commission drag and less maintenance.", "score": 8, "replies": []}, {"body": "Less gamma exposure.", "score": 9, "replies": []}, {"body": "laziness lol", "score": 2, "replies": []}]}, {"body": "So then you must have sold one that was ATM to get that type of premium for one month out. Are you planning on getting assigned?", "score": 2, "replies": [{"body": "yes", "score": 1, "replies": []}]}]}, {"body": "Very nice, well done.", "score": 2, "replies": []}, {"body": "Congratz! Cheers for many more successes to come!", "score": 2, "replies": []}, {"body": "Sorry if I missed it, but when was the execution date? Was it a weekly or monthly?", "score": 2, "replies": [{"body": "No need to be. You didn't miss it, sorry I didn't include it in my post. Trade execution was on the 21st.", "score": 1, "replies": []}]}, {"body": "Great! Just discovered this today. What made you decide to open a position right on that dip? RSI told you it was oversold?", "score": 2, "replies": [{"body": "A few reasons: 1) Support/Resistance 2) I was comfortable holding $PYPL if assigned at the 165$ level 3) I don't use the RSI indicator. I use another one called [Buy the Dip](https://usethinkscript.com/threads/buy-the-dip-indicator-for-thinkorswim.3553/). The previous day (from when I opened my position), it suggested that PYPL may have bottomed.\n\nI hope that helps.", "score": 3, "replies": [{"body": "Thanks for the reply. How do you measure support/resistance? I dont know much about technical trading. Ill try to use the buy the dip oscilattor. Thanks", "score": 1, "replies": [{"body": "S/R levels are subjective. I usually look for areas where the price has touched multiple times in the past. I hope that helps.", "score": 2, "replies": [{"body": "Thank you. Maybe using MACD to see the lowest average helps estimate a point it shouldn't go below", "score": 1, "replies": []}]}]}, {"body": "that's hilarious, I thought you were joking. Congrats on the win :)", "score": 1, "replies": []}]}]}, {"body": "I know it might not seem much but why did you end up closing for 0.05 instead of letting it expire? Did you close the trade today? Seems like it’s low risk for that $5.", "score": 2, "replies": [{"body": "I wanted to let it expire worthless tomorrow, actually. But needed to free up some capital for another trade. :)", "score": 7, "replies": [{"body": "Do not let it expire for a measly couple bucks. CLOSE\n\n [https://www.reddit.com/r/RobinHood/comments/iq8gfh/2774651\\_because\\_of\\_tsla\\_debit\\_spread/](https://www.reddit.com/r/RobinHood/comments/iq8gfh/2774651_because_of_tsla_debit_spread/)", "score": 7, "replies": []}, {"body": "always closing is a better idea. you can still get assigned technically (highly unlikely) if someone decides to exercise (from what i’ve heard)", "score": 5, "replies": [{"body": "Exercising was totally fine with him since he’s wheeling so I guess that’s fine for him", "score": 1, "replies": [{"body": "And an otm assignment is free cash for him", "score": 1, "replies": []}]}]}, {"body": "That's pretty risky honestly, letting it expire. Even if you feel as though there's *no way* the underlying could dip fast enough for your CSP to become ITM, that could *always* happen. Like the other commenter wrote, it's best to take your profit and run. Those $5 seem like easy money, until your stock falls hard, and all of your profits for the month evaporate. While you did the right thing in closing it, you did it for only half of the right reasons. Freeing up capital us important, yes, but having consistent profits to begin with, that's more important.", "score": 3, "replies": [{"body": "He still would’ve gotten that $5 no matter what he just could’ve been assigned which is fine when doing the wheel\nYou need to be assigned while doing the wheel otherwise it’s just shorting calls or just shorting puts", "score": 1, "replies": [{"body": "You do not *need* to be assigned when wheeling. If you got assigned everytime, you'd probably lose money pretty quickly. Most guides say if one getting assigned more than 3-4 times a year, the wrong strikes are being chosen. The wheel works when we benefit from theta decay, time always moves forwards. So yeah, we basically are just shorting puts, and we hope we don't get assigned, but it's ok if we do because we have a plan. The goal isn't to get assigned, but it's ok if it happens.", "score": 2, "replies": []}]}]}]}, {"body": "There's no point trying to extract that last $5. You already made most of the possible profit, better to close and free up the capital to do other stuff, and also removes the risk in case the stock decides to move against you for any reason.", "score": 12, "replies": []}]}, {"body": "Doing 4 separate tqqq and some workhorses this week about 12% below current price. Kinda risky but.$$$$$", "score": 1, "replies": [{"body": "Care to elaborate?", "score": 1, "replies": [{"body": "he said \"some workhorses\" but I think he meant \"some contracts on $WKHS\"", "score": 2, "replies": []}, {"body": "Workhorse is a stock. It's a medium risk theta gang play. TQQQ is high iv etf.", "score": 2, "replies": []}]}]}, {"body": "Nice trade. Great post", "score": 1, "replies": []}, {"body": "This is the way sir!", "score": 1, "replies": []}, {"body": "Way to go, man!", "score": 1, "replies": []}, {"body": "are you going to repeat this play next week?", "score": 1, "replies": [{"body": "Most likely, if the market continues to pullback. I may even get in at a lower strike.", "score": 2, "replies": [{"body": "post the strike when you do. i’ve been thinking about it", "score": 2, "replies": [{"body": "Sure thing.", "score": 3, "replies": [{"body": "Nice!  Can’t wait until I have enough money for CSPs, CCs and the wheel.  Seem to be the best way to make decent money with not too much risk.", "score": 1, "replies": []}]}]}]}]}, {"body": "Awesome!", "score": 1, "replies": []}]}
{"title": "AAPL Oct 30th $90 PUTS $1.51 Potential +1000%", "selftext": "[deleted]", "id": "iyoerz", "created_utc": 1600914192.0, "score": 12, "upvote_ratio": 0.66, "num_comments": 73, "comments": [{"body": "Nice fucking try Tim Apple - I see what you did here, try to convince me to hold month long fuckin puts and then you announce iPhone 12 with the new auto BJ feature that every mf and their granma will want....\n\nEdit: phew... glad my retarded ass didn’t have any money to follow OP", "score": 54, "replies": [{"body": "Nah", "score": -21, "replies": []}]}, {"body": "Cant go tits up honestly. Just dumped my 39 kids college tuition into it.", "score": 21, "replies": [{"body": "RE-inversed", "score": 3, "replies": []}, {"body": "I think your 39 kids will be very proud of you", "score": -15, "replies": []}]}, {"body": "Just stop", "score": 24, "replies": [{"body": "Stop what? Stating the obvious?", "score": -14, "replies": []}]}, {"body": "Author knows that once WSB retards start buying puts, Apple is going straight back to the moon. Nice try. I’m buying calls", "score": 19, "replies": [{"body": "Good luck....", "score": -7, "replies": []}]}, {"body": "I like this hypothesis, but like you said, I think there needs to be more confirmation before it looks bearish.\n\nThe charts still have room for reversal it looks like, maybe a fake out, but it’s still too close for me to call yet.", "score": 6, "replies": [{"body": "If we break under $103 by Friday Apple is toast", "score": 0, "replies": [{"body": "If it hits that downward trend, this maybe worth the play.\n\nI’ll definitely be keeping an eye on this.", "score": 5, "replies": []}]}]}, {"body": "If this works bro... Fucking legend. I'm in.", "score": 10, "replies": []}, {"body": "Thanks, going to sell 90p now", "score": 4, "replies": []}, {"body": "Of course it’s going lower - so many smug Apple bag holders.  Dumb asses - serves them right.", "score": 5, "replies": []}, {"body": "Can't lose; if it doesn't print closer to the exp, I can just sell them to one of you retards", "score": 3, "replies": []}, {"body": "Fuck. I have 200 shares at $115. I have a couple covered calls making up the loss difference but I was planning to ride Apple for another week or two hoping for a rebound considering RSI is below the oversold threshold.\n\nNow you have me considering closing everything early and buying back once it finds a resistance at $90.", "score": 3, "replies": [{"body": "I’m just going off the charts bro. The charts tell me Apple has huge down side risk.... I think $70\nIs rock bottom though", "score": -2, "replies": [{"body": "$70 lmaoooo. I need your prescription list. Shit has to be dank", "score": 7, "replies": [{"body": "You’ll love it", "score": 3, "replies": []}]}, {"body": "Nah stimulus checks at the same time the new phone is announced. AAPL to the moon. Calls once they start talking about trump bucks.", "score": 9, "replies": [{"body": "Chart says Down", "score": 0, "replies": []}]}, {"body": "Yeah... I know what you mean. Apple is in a very precarious position right now. They're one bad political, economical, or societal news break away from a free fall. Maybe it's time to cut them loose...", "score": 2, "replies": [{"body": "You see what’s going on in Louisville", "score": 2, "replies": [{"body": "No... hold on let me check", "score": 2, "replies": []}, {"body": "Oh. I didn’t realize the protests escalated even more. I’m in LA and things seem fine here. Regardless, I’m going to close $150 shares tomorrow and begin averaging down at every resistance", "score": 2, "replies": []}]}, {"body": "Going down", "score": 2, "replies": []}]}]}]}, {"body": "I can’t post pictures but if you set your EMA line 1-3 periods to 10, 15, and 50 you’ll see the 10 and 15 cross. It continues the down trend and both are trending to break below the 50... The last cross the 10 and 15 had that broke below the 50, was back in March... Might be headed for darker waters for real.", "score": 3, "replies": [{"body": "You’ll have to look at the 1 year chart too.", "score": 3, "replies": []}, {"body": "Look at weekly", "score": 2, "replies": [{"body": "I did, but the crossing of the 10 and 15 is identical to what was shown in March", "score": 2, "replies": [{"body": "Hmm", "score": 2, "replies": [{"body": "What brokerage do you have?", "score": 2, "replies": [{"body": "Makes no difference. Chart says new lows coming", "score": 2, "replies": [{"body": "I agree with you.", "score": 5, "replies": []}]}]}]}]}]}, {"body": "You TA guys are full of shit, you know that right?", "score": 3, "replies": []}]}, {"body": "For 1000% that position Apple would have to be 80..", "score": 3, "replies": [{"body": "Ya $80 is very possible", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "March lows? Dude that was total capitulation. The world was about to end. I don’t foresee coming even closing to those levels. Low 80s for aapl maybe but you’ll need a real catalyst for another 20% down", "score": 3, "replies": []}, {"body": "I think we go lower", "score": 1, "replies": []}, {"body": "im just thinking about all the people unemployed or with reduced income stressing about their bank accts. for a good % of people, theyre not gunna be thinking about a new phone atm", "score": -2, "replies": [{"body": "You'd be surprised with how many americans are willing to overspend for a slightly bigger phone screen and camera upgrade while struggling to afford a 1 bdrm apartment with 4 roomates.", "score": 6, "replies": [{"body": "This. Very easy to overspend on a phone when it is baked into a phone contract that is paid monthly. Apple has the phone market on lockdown for the foreseeable future.", "score": 4, "replies": []}]}]}]}, {"body": "But this MACD looks like its converging upwards. Also, it hasn't really stayed under 50 ma in a while ?", "score": 2, "replies": [{"body": "We need a break under $103 for complete confirmation. I’m confident we will get it.", "score": 3, "replies": []}, {"body": "With that being said, ima buy puts.. I'll close out if it goes above 111", "score": 2, "replies": []}]}, {"body": "Fuck anyone on this sub that claims to have a potential ten bagger. Fucking ban.", "score": 2, "replies": [{"body": "Shut up. This post is my opinion. I’m not putting a gun to your head forcing you to buy anything.", "score": 3, "replies": []}]}, {"body": "Lost interest @not ass sucking", "score": 1, "replies": [{"body": "Be open minded", "score": 1, "replies": []}]}, {"body": "I was just going to buy 20 shares. I may wait now", "score": 1, "replies": [{"body": "I would wait....", "score": 2, "replies": []}]}, {"body": "I AM IN FOR THE FUCKING 10000000% RETURNS.", "score": 1, "replies": [{"body": "Hell ya baby", "score": 1, "replies": []}]}, {"body": "Might just give it a try. I have 2022 LEAPs (lol) but short term,  I could be gay", "score": 1, "replies": [{"body": "No homo", "score": 1, "replies": []}]}, {"body": "Realistically, short term puts, long term calls. Fucking ez", "score": 1, "replies": [{"body": "Buy calls when we’re under $80", "score": 1, "replies": [{"body": "You’re such a gay bear lol. $80 will never happen. $90 sure. But $80? Lmao, put some money on it then pussy", "score": 2, "replies": [{"body": "$70", "score": 7, "replies": []}]}]}]}, {"body": "Dumped me and my family’s life savings into it!", "score": 1, "replies": [{"body": "This trade is VOID/cutting loss if AAPL goes above $117 next week", "score": 1, "replies": [{"body": "Okay. I’ll buy the puts once monday opens. I’ll just put half of my savings in first for now.", "score": 1, "replies": [{"body": "Don’t be stupid. Go all in", "score": 1, "replies": []}]}]}]}, {"body": "Fuck you and stop spamming your apple and tesla puts posts", "score": 1, "replies": []}, {"body": "My analysis is still intact you retards", "score": 1, "replies": []}, {"body": "That means spy, what. 300? Maybe. Probably not.", "score": 1, "replies": [{"body": "SPY is going to $285-$290 IMHO", "score": 9, "replies": []}]}, {"body": "Inversed", "score": 1, "replies": []}, {"body": "I mean, I do agree with you in spirit, aapl is one of the rare ones where I'm super bearish, but 10/30 90p is pushing it imo, too many fanboys propping it up.", "score": 0, "replies": [{"body": "The chart doesn’t lie", "score": 3, "replies": [{"body": "Nop but people change their mind faster than the MACD", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "No way", "score": 2, "replies": []}]}]}
{"title": "Boeing DD", "selftext": "Let me share some DD on BA. \n\nCommercial flying is about to recover to 70% of pre covid levels. We’re currently at 70k commercial flights per day. We were at 110k before covid and 28k during the peak of the virus. We’re at 65% of pre covid levels and rising daily. Source: https://www.flightradar24.com/data/statistics\n\n\nBA is a solid company. Yeah it fucked up on the 737 max and has some management issues, but it’s a straight up cash cow. In 2019 it made 100B in revenue and had 10B in profit. Yes, I said profit. This isn’t some TSLA Elon pump shit, this company actually makes a shit ton of cash.\n\nIt’s a duopoly that isn’t going away. you could also buy airbus, but it’s traded OTC in the US so fuck that. BA and airbus are the only 2 companies that will be selling commercial planes. Not to mention it’s defense contracts and many freight companies such as UPS use Boeing aircraft.\n\nYou might be thinking just buy the airlines instead? Fuck no, they might go bust anytime. BA ain’t going bankrupt and it’s going to trend along side the entire sector. It’s like an index of all the airlines without the bankruptcy.\n\nIt’s fucking dirt cheap right now. I’m not just talking about the stock. IV is at 64%, meaning big moves aren’t priced into the options yet. Buying before the IV spike is how you make money on options. If you haven’t learned this during your time on this sub, you should close this tab now and uninstall Robinhood.\n\n\nBut... second wave.... That’s all bullshit. Even if cases spike again, it’s not gonna stop people from flying. Think about why cases spiked in the first place, because people don’t give a fuck. They aren’t gonna suddenly stop going to the beaches, visiting family, or eating out. People are gonna put on a mask and go their merry way. \n\n\nFinal DD, I took 5 round trip flights in the last month. Every flight I was on was packed. The last 2 flights I booked cost 5x the price of the first two. Demand is there and it’s going to go up. \n\nThis isn’t some pump and dump cause you retards with your $2000 portfolios aren’t gonna make a dent in this stock. But a good hold if you wanna be like GameStop guy and turn 100K into 1M with 2021 calls.\n\nTldr \n\n$170 Dec 2020 calls\n\n$180 May 2021 calls\n\n$200 May 2021 calls", "id": "iz64r3", "created_utc": 1600982509.0, "score": 38, "upvote_ratio": 0.81, "num_comments": 72, "comments": [{"body": "Your retarded numbers ... Do you even know where frame makers make most of their money? It's on wide body jets flying international routes. Check how much those are down. Nobody cares if your Green Bay to Charlotte flight is back to 100% if NYC to London is still operating at 10% pre covid capacity", "score": 26, "replies": [{"body": "Airbus has the advantage since they supply more narrow body jets now with the 737 issue, but the numbers in the source are actually based on international data.", "score": 6, "replies": [{"body": "There are a very small number of routes that make a disproportionately large amount of money for airlines. The rest are just fillers. The numbers you have there doesn't distinguish between a flight from Green Bay to Charlotte vs one from London to NYC, and the latter makes far more for the airlines, which ultimately feed back into BA.\n\nA better DD would be if someone uses drone data to check what activity in places like Victorville is like right now. That's a much better gauge than shitty flight numbers that don't tell you important things like load factors, yields, etc", "score": 1, "replies": []}]}, {"body": "*jetBlue enters chat*", "score": 2, "replies": []}]}, {"body": "Boeing DD? More like boring DD. \n\nI kid. Thanks for the tips.", "score": 32, "replies": [{"body": "Boring if you hate money", "score": 7, "replies": [{"body": "Sometimes I get the feeling money hates me. It never comes around anymore always avoiding me", "score": 6, "replies": []}, {"body": "Yes, I agree that there is currently a duopoly due to high barriers to entry. However, no barrier is high enough for almighty China. Their commercial plane manufacturer, COMAC, is gonna be big. You just wait. General Secretary Xi gonna pilot that baby to TENDIE TOWN!!!", "score": 0, "replies": []}]}, {"body": "Hope you all got in the last 2 day run from $146 back to $164\n\nTook some gains on the dec 2020 calls. Leave the rest", "score": 1, "replies": []}]}, {"body": "My Jan 21 175c says hello.", "score": 5, "replies": []}, {"body": "Sounds good.\n\nNot sure if I should wait for a bigger dip though.", "score": 6, "replies": [{"body": "Lol.", "score": 1, "replies": []}]}, {"body": "Love Boeing.  Great play long run.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "DFEN is 3x leveraged.", "score": 9, "replies": [{"body": "and thats what we like!", "score": 5, "replies": []}, {"body": "So you buy OTM short term calls on a 3x leveraged ETF, using 2X margin. This is how you make cash, bro!", "score": 3, "replies": []}]}, {"body": "Pray that people will be flying to see their grandma or WW3 happens.", "score": 7, "replies": []}, {"body": "BA is only 8% of the portfolio?", "score": 3, "replies": []}]}, {"body": "BA is my second largest position right now.\n\nI’ve been buying nonstop", "score": 5, "replies": []}, {"body": "When you're saying it's not gonna stop people flying - I don't know if you're thinking of the US, but out here in Europe they're literally banning people from flying to certain countries or even coming back.", "score": 8, "replies": [{"body": "My point was demand is going up and isn’t going away due to fear.\n\nBans are being lifted and countries are establishing certain safe routes between countries where the virus is contained.", "score": 1, "replies": []}]}, {"body": "This retard thinks we’re hitting pre-covid flight numbers soon.\n\nI can’t wait to see the loss porn.", "score": 10, "replies": [{"body": "Lol", "score": 1, "replies": []}, {"body": "We’re 65% of the way there. I said we’re hitting 70% soon, but BA is trading at 40% of its precovid price. (Closed at $146 today)", "score": 0, "replies": [{"body": "I disagree with the numbers, you won’t be seeing pre COVID level flights for another 2-3 years.", "score": 8, "replies": [{"body": "You think the numbers are fake or you disagree with my statement that we’re hitting 70% of precovid commercial flights soon?", "score": 1, "replies": [{"body": "70% seems too optimistic, the last time I checked it was close to 30%.", "score": 4, "replies": [{"body": "We’re already at 65%", "score": -1, "replies": [{"body": "Do you have stats on bookings/ passenger counts?", "score": 5, "replies": [{"body": "He is counting the number of flights like a retard instead of using TSA numbers.", "score": 1, "replies": []}, {"body": "Wait for airlines ER for those numbers", "score": 1, "replies": [{"body": "I think that’s what you should be looking at; 1 person on a flight would could as a data point in your current method. \n\nPassenger numbers were depressing the last time I checked.", "score": 7, "replies": [{"body": "Check TSA numbers.\n\nEdit I did it for you.. around 800k when same weekday match from last year is around 240-250k.. 25%", "score": 5, "replies": [{"body": "But each plane is less packed now...", "score": 3, "replies": []}, {"body": "800k today, 2.5 mil a year ago. So about 1/3.", "score": 2, "replies": []}, {"body": "There ya go. When I grow up, I’ll hire you.", "score": 1, "replies": []}]}, {"body": "Its even worse than this. If the plane is lightly loaded, it's actually a loss for the airline, which makes them less likely to buy more planes, maintain the planes they have, and accelerate retirement of planes (which means less $$$ for Boeing's maintenance plans).\n\nIn this case, the number of flights would actually be an indicator of significant loss.\n\nI don't deny air travel will bounce back, but it's aint gonna be as quick as Q4 2021.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "You said \"eating out\" heh heh heh heh heh heh heh", "score": 3, "replies": []}, {"body": "Boeing primarily supplies larger international flight planes (2 isles and up).. spirit (SPR) supplies boeing with smaller planes. As of right now the smaller planes are gonna be in higher demand due to restricted international flights.\n\nSo 2 things delaying BA stock:\n\n1) lack of international flights\n2) 737 max fiasco\n\nI agree with these guys that boeing is underpriced. \n\nLast thing, boeing made it on JPM “conviction buy” list which is the highest rating for a buy. Im sold on BA", "score": 3, "replies": [{"body": "It was Goldman’s conviction buy list, but good points.", "score": 2, "replies": [{"body": "Thanks for the correction. My logic (which is often wrong but sometimes right) is that $JETS may rise first followed by $BA. Boeing needs jets to be flying to get new jet orders\n\nSomething to the tune of 45% of fleets are grounded right now so the new jet orders are low.\n\nIf you believe in $BA then playing $JETS at some point makes sense", "score": 1, "replies": []}, {"body": "I feel like right before this second stimulus will be rock bottom for the airlines....", "score": 1, "replies": []}]}]}, {"body": "Dude no one is flying.  Who is going to buy all those brand new $250,000,000 planes just sitting at the Boeing plants?  Airlines owe nothing to Boeing at this point.  All those purchase contracts?  Throw them in the garbage- they are worthless now.  It’s called COVID 19.  Force Majure", "score": 5, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "I’m loaded on BA calls. The stimulus will get passed next week and include airline aid. Good for Boeing", "score": 2, "replies": []}, {"body": "What about Civil War Two happening in November?", "score": 2, "replies": []}, {"body": "Are US Americans still banned everywhere ?", "score": 2, "replies": []}, {"body": "Just for the record 64%IV isn't low. Relatively low? Sure I guess. But it's not low. Semantics but I just wanted to point this out.", "score": 2, "replies": []}, {"body": "I’m in boeing and spr now, 2021 calls looked too good 2023s tho 😘", "score": 2, "replies": []}, {"body": "DD = dumb data\n\n9/22/19 TSA throughput 2,188,000\n\n9/22/20 TSA throughout 608,000\n\nhttps://www.tsa.gov/coronavirus/passenger-throughput", "score": 3, "replies": [{"body": "Basically making his point that now is the time to buy. You don’t want to wait and buy when traffic is back to normal. You want to buy when things are bad so you can reap the rewards when they are good.", "score": 5, "replies": []}]}, {"body": "There aren't even DEC 2021 calls available you boner.", "score": 2, "replies": [{"body": "There are 12/21 @ 240 calls on **Borse Frankfurt**", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/PatternDayIdiot don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Where do you see Dec 2021 calls ?", "score": 1, "replies": [{"body": "Typo, 2020", "score": 1, "replies": [{"body": "Solid DD I am in.", "score": 8, "replies": []}]}]}, {"body": "Fun fact, companies like UPS and Fedex have mostly, second hand, used Boeings in service because they only use them a few hours a day.", "score": 1, "replies": []}, {"body": "With the way different areas are responding, on completely different timelines, the likelihood that mass air travel will return to normal anytime soon seems low.", "score": 1, "replies": []}, {"body": "A lot of those flights are empty, TSA numbers paint a more accurate picture, passenger count is like 25 to 30% compared to last year.", "score": 1, "replies": []}, {"body": "But, given this, wouldn't buying airlines make more sense than the plane manufacturer though?", "score": 1, "replies": []}, {"body": "Did u print the 170s?", "score": 1, "replies": []}, {"body": "✈️✈️✈️✈️✈️✈️✈️✈️🚀🚀🚀💯", "score": 1, "replies": []}, {"body": "I unfortunately cannot afford to play with boeing", "score": 1, "replies": []}, {"body": "Know what’s happening to all those airlines that are failing? They are dumping their aircraft or ending their leases. Not only will travel not recover for 12 months, there will be a pile of used planes.\n\nAlso - when Biden wins, the money train from military spending will be redirected to social services - the US cannot afford to do both.", "score": 0, "replies": [{"body": "When Biden wins? You mean like 2024?", "score": 1, "replies": [{"body": "Biden is so old he will be dead in 2024", "score": 3, "replies": []}]}]}, {"body": "Take a quick watch - https://www.youtube.com/watch?v=EESYomdoeCs&t=1s\n\nThis is why I would wayyyy rather bet on Airbus", "score": 0, "replies": []}, {"body": "Go with SABR leaps", "score": -2, "replies": [{"body": "SABR is fucking fuck, never buy them.", "score": 7, "replies": [{"body": "In what way, shape or form? Please explain", "score": 1, "replies": []}]}, {"body": "Yup", "score": 4, "replies": []}]}]}
