{"title": "PayPal vs Square: Which Fintech Stock Is A Better Buy?", "selftext": "The COVID-19 pandemic is accelerating digitalization and has led to a spike in online transactions and e-commerce sales. According to PayPal, the penetration of e-commerce as a percentage of retail sales in the first half of 2020 outpaced prior external forecast by 3 to 5 years. Both consumers and merchants are increasingly adopting digital payments as contactless transactions have become increasingly important amid the current crisis.\n\nThe rapid penetration of digital payments led to double-digital revenue growth in the second quarter for PayPal and Square. Using the TipRanks Stock Comparison tool, we will place these two fintech payment firms alongside each other to assess which stock offers a more compelling investment opportunity.\n\n**PayPal Holdings (PYPL)**\n\nPayPal, which was spun off from eBay in 2015, has emerged as the digital payment leader. In the second quarter, PayPal added 21.3 million net new active accounts, reflecting a 137% Y/Y rise and marking the strongest growth in the company’s history thanks to a surge in e-commerce and digital payments. As of the end of 2Q, PayPal had 346 million active accounts with over 26 million merchant accounts.\n\nThe company’s 2Q revenue surged 22.2% Y/Y to $5.26 billion. And adjusted EPS rose 49% to $1.07 as the adjusted operating margin expanded 504 basis points to 28.2%. Total Payment Volume or TPV, which indicates payments processed through the PayPal platform, grew about 29% to $222 billion. Venmo, Paypal’s mobile payments platform, witnessed a 52% growth in its TPV to $37 billion.\n\nFollowing the strong 2Q momentum, PayPal reinstated its 2020 guidance and in fact, raised it. The company expects revenue growth of 20% and adjusted EPS growth of about 25%. It anticipates adding 70 million net new active accounts this year.\n\nTo boost its top-line further and promote touchless payments, PayPal launched QR Code technology in 28 markets globally in May. CVS Pharmacy will be the first retail chain to offer its customers the option to use PayPal and Venmo QR codes at checkout in its US stores. The company will also launch Venmo credit card this year.\n\nPayPal has also expanded its Visa Direct partnership globally to accelerate real-time access to funds for small businesses, consumers and partners across its platform. This collaboration enables PayPal to extend global white label Visa Direct payout services through PayPal and its Braintree, Hyperwallet and iZettle platforms.\n\nOn Sept. 22, Mizuho Securities analyst Dan Dolev reiterated a Buy rating for PayPal with a price target of $285 as the Mizuho E-Commerce Tracker showed that unique views across key PayPal partner sites (like Etsy, Groupon and Wayfair) remained strong in July and August and also pointed to potential signs of life in the beleaguered travel category.\n\nThe Tracker also indicated that PayPal’s unique views continued to grow ahead of partner websites in the last two months, reflecting persistent share gains for the checkout button. Overall, the analyst expects strong July and August e-commerce trends coupled with share gains to bode well for the company’s second-half TPV. (See PYPL stock analysis on TipRanks)\n\nPayPal stock has rallied about 74% year-to-date and could rise further by 17% in the coming months as indicated by the average analyst price target of $219.77. The stock scores a Strong Buy consensus based on 28 Buys, 5 Holds and no Sell ratings.\n\n**Square (SQ)**\n\nPayment facilitator Square is growing rapidly as consumers and businesses are migrating online at a faster pace amid the pandemic. From February through August 2020, there was a 13.2 percentage point increase in the share of Square sellers accepting online payments and by August, over 40% of all Square sellers were accepting online payments. Also, by August, more than 7 in 10 Square sellers were accepting contactless payments.\n\nThe company’s Cash App ecosystem delivered $1.2 billion in revenue in the second quarter, reflecting a whopping 361% Y/Y growth. The Cash App had over 30 million monthly transacting active customers in June. Aside from the accelerated digital migration, Cash App also gained from the impact of Fed stimulus, unemployment checks and tax refunds.\n\nSecond-quarter revenue grew about 64% Y/Y to $1.92 billion. But excluding bitcoin revenue, net revenue of $1.05 billion was flat Y/Y. Meanwhile, 2Q adjusted EPS declined 14.3% to $0.18. The strong growth in Cash App revenue was offset by the 17% decline in the company’s core higher-margin Seller business to $723 million. Square’s gross payment volume or GPV fell 15% Y/Y to $22.8 billion.\n\nThe Seller segment was impacted by lower volumes as several businesses were forced to close amid the shelter-in-place orders triggered by the pandemic. However, the company stated that the Sellers business improved with each month in the quarter as restrictions eased and more sellers adapted to the contactless platform.\n\nMeanwhile, GPV from online channels grew over 50% and accounted for 25% of the Seller GPV reflecting the rapid adaption of online solutions by the sellers. (See SQ stock analysis on TipRanks)\n\nRecently, the company announced two new features called On-Demand Pay for employees and Instant Payments for employers. These new features will further integrate Square’s Seller and Cash App ecosystems to offer financial services and simplify payroll.\n\nLoop Capital analyst Kenneth Hill has just initiated coverage of Square with a Buy rating and a price target of $169. The analyst sees a great deal of upside ahead in the fintech company, driven by further investment in the business and monetization of the Cash App. Hill also believes that on the Seller side, the SMB network should \"hold in well and continue a sustained recovery.\"\n\nThe Street has a cautious Moderate Buy consensus for Square with 14 Buys, 12 Holds and 2 Sells. Square stock has risen a stellar 149% year-to-date, so the average analyst price target of $151.77 indicates a possible downside of 2.5% ahead.\n\n**Bottom line**\n\nBoth PayPal and Square have strong growth prospects in the digital payments world. If we look at the Street’s consensus and further upside potential, PayPal stock appears to be a better choice than Square currently.\n\nTo find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a newly launched tool that unites all of TipRanks’ equity insights.\n\n[https://finance.yahoo.com/news/paypal-vs-square-fintech-stock-102007024.html](https://finance.yahoo.com/news/paypal-vs-square-fintech-stock-102007024.html)", "id": "iza2r0", "created_utc": 1600996523.0, "score": 46, "upvote_ratio": 0.89, "num_comments": 78, "comments": [{"body": "Broadly speaking I think SQ has more upside only on the idea that SQ is able to take more risks for the sake of innovation. Jack Dorsey is an innovator and a sinplifier at heart - so I have high hopes that he solves a lot of unefficiencies that current financial companies can’t solve. Also, he is now starting to make bigger moves on a global scale - and there is a likelihood that emerging markets (ie Africa) will take a liking to SQ’s simple-to-use ecosystem which is also incredibly efficient. Appreciate the write up! I am currently learning more about them as I invest more into SQ and this was helpful", "score": 27, "replies": []}, {"body": "Square is my bet. They innovate like crazy and are in a lot of experimental fields, crypto included. They also have the Cash app, which so many kids are using.", "score": 9, "replies": []}, {"body": "$SQ", "score": 30, "replies": [{"body": "I’m wary of Square.  The big bank services are starting to push into the market (see FiServ Clover), could cause problems for longevity.", "score": 4, "replies": [{"body": "Yeah once big banks realize theres a profit to be made they jump on board. Square is currently in the process of applying / or already have been accepted by the the state of utah to register as a bank. This is what allowed their small loan program to roll out. Square is aiming to be a big bank to take down the big bank since that is the process they have to follow from my understanding. Also dorsey is/has been in contact with people in inda to further expand square. Along with their crypto program theyre rolling out on the open source front. Im thinking dorsey has something under his sleeve.", "score": 3, "replies": []}]}]}, {"body": "Why not both?\n\nMake a mini-ETF with what you were looking to allocate. I did the same by liquidating my IPAY holdings and turning that into a mini-ETF with holdings in Visa, Mastercard, Square, and PayPal.", "score": 5, "replies": [{"body": "Nice choices! ARKF + Square and Lightspeed are my choice. Very happy with them.", "score": 1, "replies": []}]}, {"body": "My money's mainly on ARKF here with a small position in SQ as well. Appreciate the comparison.", "score": 8, "replies": []}, {"body": "Have you even used fucking pay pal... It's awful especially from a business side. \n\nSquare allll the way to the bank... Or under your pillow the worldsgoingtoenddontgiveyourmoneytoabankgreedyfuckers", "score": 9, "replies": [{"body": "PayPal is company and not just a product. PayPal also own Venmo which is in the same space as SQ. I agree that SQ has more upside but I think there is space for both these companies in the long run.", "score": 3, "replies": [{"body": "PayPal also owns izettle - which again WAS the market leader until pay pal bought it and now it's stuck in the mud...\n\nWritings on wall.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Customer service and user interface is just dated. \n\nTakes forever to do anything when something goes wrong... I just feel there is a disconnect somewhere in their company that can't pivot and react to things... They stink off an out of date bank.", "score": 1, "replies": [{"body": "I have the same feeling about Paypal. They continue to benefit because they were one of the first players in the space, but I feel like their products are clunky and dated. Square is the inovator in the space and Id bet on them winning in the long run.", "score": 3, "replies": []}]}]}]}, {"body": "Ran a small business a few years ago and used Square for my fees. I think most small business do take this route as the convenience of only needing my phone to get the purchase on spot \n\nI think square has better ability to grow in other countries globally and PayPal is more likely at peak", "score": 5, "replies": []}, {"body": "Have you considered ARKF?", "score": 14, "replies": [{"body": "I just wish ARKF had some V or MA in it.", "score": 2, "replies": [{"body": "I think the reason why it doesnt is because ARK ETFs are all about innovation. So you won't ever find established companies like V or MA. Id say their philosophy is the opposite in which they're actively investing in companies that disrupt this way of paying.", "score": 3, "replies": [{"body": "They do hold Apple in ARKF and some other established companies in all their ETFs.", "score": 1, "replies": [{"body": "Do they? I don't see it on their list. And if so, apple pay would be considered a disruption for fintech in my opinion. Credit card companies would not.", "score": 2, "replies": [{"body": "Apple is number 8 of their top 10 in ARKF as of today. 3.6% weighting. \n\nTotally agree, I think Apple Pay is going to keep growing with greater adoption of digital wallets. It’s already integrated well across iOS.", "score": 2, "replies": [{"body": "Where are you looking? On their official site, it's not on their top 10. https://imgur.com/a/M1QOgGU\n\nSo thats why I assumed they didnt hold AAPL at all. I do see it now that I expand their full list though.", "score": 1, "replies": [{"body": "Webull has the top 10 holdings for all ETF’s in the asset allocation tab. Not sure how often they update it now that you mentioned that. \n\nAs for apple in ARKF, it’s in the mid range in terms of weighting so probably just been fluctuating in and out. Best fintech etf out right now imo", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Yea ARKF is all about 5 year growth potential. Visa is safe but might not have same growth. I love ARKF and Cathie Woods.", "score": 3, "replies": []}]}]}, {"body": "PayPal can eat my butt. They screwed me years ago as a business back when they believed customer was king. Then they screwed me as a customer last year since their new stance is to keep their business accounts happy in lieu of customers. Stupid ass company. But I'm clearly not biased.........,", "score": 3, "replies": []}, {"body": "For right now it is paypal, better valuation.", "score": 9, "replies": []}, {"body": "$sq", "score": 4, "replies": []}, {"body": "Bet on dorsey", "score": 5, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "He has a vision for the company and is a founder ceo", "score": 1, "replies": []}]}]}, {"body": "I actually buy and resell things on a video game using PayPal and I can say I absolutely hate the customer service of PayPal, and their service as a whole now. It’s gone down hill for me since I started using it in 2017. \n\nThat said I’m invested in square, would love to use cashapp but it’s not available in Canada sadly", "score": 3, "replies": []}, {"body": "Square has more upside. PayPal's is overbought imo. Both ok plays though.", "score": 6, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "P/E ratios are higher for companies with a higher growth rate", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "SQ has a market cap of ~70 billion. PayPal is at 300 billion. But what square is doing right now is far more ambitious so I can see them having a total market cap greater than PayPal’s one day.\n\nWith Square opening up physical banks in 2021 it is interesting to see how they’ll develop from there.", "score": 4, "replies": []}, {"body": "Based on street consensus per FactSet, PYPL has a long-term growth rate of 23% vs. Square's 44%.", "score": 6, "replies": []}, {"body": "We all know what PayPal is and what the potential is... square plans on taking over venmo and mobile payments, POS systems for small and potentially certain large businesses, as well as building a full brokerage platform within their cash app to compete with robinhood and the boomer banks\n\n&#x200B;\n\nworth throwin a couple bucks on em imo", "score": 4, "replies": [{"body": "Everything you listed are things PayPal plans on doing as well.", "score": 1, "replies": [{"body": "Yeah but PayPal has been around since 1998 and they still haven’t done it. I’d argue SQ has already passed them in that vision and soon its going to be another Blockbuster - Netflix type story", "score": 8, "replies": []}]}]}, {"body": "Forward P/E is only for one year out.  What if you looked at 10 year forward P/E?", "score": 1, "replies": [{"body": "🤦‍♂️", "score": 2, "replies": []}]}]}]}, {"body": "P/E is not a great metric and certainly not a great one to look at and say “this company has a higher/lower P/E ratio!”. Whenever I see a comment like that I wonder if you have really done any analysis. At least look at PEG or PEGY or something.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I don’t care about P/E ratios so I can’t answer that question.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "> I asked because you do seem to care about growth.\n\nThen you wouldn't be asking me about P/E ratios.\n\n> I take it you're not much of a math person\n\nNot sure what you're basing that assumption on, but ok. \n\n> If its earnings were to suddenly increase by 10X(1000%) tomorrow, it would still have a P/E of 33. You expect their earnings to increase by ten times in the near future? And even if it did you'd still have to wait 33 years to recoup.\n\nI'm a long-term investor, so I don't care about 33 years. Shares of high-growth potential companies are part of an overall strategy. Do Amazon and Tesla have you shaking in your boots too? \n\nAlso, as I would hope that you would know since you're a \"math person\", a *low* P/E ratio is not necessarily indicative of a healthy company or a \"good buy\". Sitting here talking about P/E ratios as if it's some metric to rule them all without taking into context how a company is run, how it s positioned for the future, why it has arrived at its current state, and how the market may change makes you look like a clown.\n\n[Wow look the P/E ratio is so low! You'll earn your money back so quickly!](https://finance.yahoo.com/quote/FTFT?p=FTFT&.tsrc=fin-srch)\n\n> Quit being a dope, it hurts the others that are easily influenced and don't know any better.\n\nBack at ya.", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "SQ", "score": 2, "replies": []}, {"body": "Square has the hype and is the \"new one\", PayPal is like the Fintech grandpa at this point.", "score": 2, "replies": []}, {"body": "Sq is way better, PayPal is shit and is a big company that has a long chain of command. SQ still has the startup mentality thus has more room to grow.", "score": 2, "replies": []}, {"body": "PayPal probably can’t grow its customer base that much more, at least here in Europe a majority of people use PayPal. However very few people use CashApp, so I would say the growth potential is in squares court however PayPal has the current market in Europe and a large amount of people using PayPal credit", "score": 1, "replies": []}, {"body": "Visa", "score": 1, "replies": []}, {"body": "Both are solid choices. \n\nPayPal for the market leader for digital payment\n\nSQ for its digital license and growth.\n\nPayPal target the larger market and retailer while  SQ targets the small businesses. Both actually complement each other extremely well.", "score": 1, "replies": []}, {"body": "Both", "score": 1, "replies": []}, {"body": "Who cares, buy both!", "score": 1, "replies": []}, {"body": "I prefer SQ, but have both in my portfolio, as well as dutch processing company Adyen.", "score": 1, "replies": []}, {"body": "Unsure of how they are able to do all the boosts but love the feature in the Cash app", "score": 1, "replies": []}, {"body": "Honestly, both are good. I own PayPal and I'm having my mom buy Square.", "score": 1, "replies": []}, {"body": "CSE:PAID😉 A hidden fintech gem of 2021", "score": 1, "replies": []}, {"body": "I still feel NKLA is a better buy. Huge discount now.", "score": -7, "replies": [{"body": "lol", "score": 4, "replies": [{"body": "Oh he was serious...", "score": 1, "replies": []}, {"body": "U lol at me son, I lol back at you back in a year mate.", "score": -2, "replies": []}]}, {"body": "!RemindMe 1 year \"What happened to NKLA?\"", "score": 2, "replies": []}]}, {"body": "PYPL. Not only are they a huge leader they also have brand awareness and its integrated into one of the largest digital marketplaces (EBAY!). \n\nSQ is the new kid on the block. Problem with SQ, competitors in the digital payment sector are coming and they are coming fast. Similar to how ZOOM technologies have shown there is a sizeable market. Competitors such as VISA, MS have much more sizeable market power will enter the market. I would like to SQ being purchased in 2021-2022 so that another financial/bank will enter the FINtech segment.", "score": -1, "replies": [{"body": "isnt ebay trying to move away from paypal? i used paypal for years on ebay but now i just pay for ebay purchases on my mastercard (dont sell much on ebay). its a lot easier now. i use paypal only for recieving payments from etsy type sites.", "score": 2, "replies": [{"body": "Well, think about what you just said. How do you receive payments? \n\nECommerce is here to stay and its growing far faster than retail growth. So if you are going to invest in a payment company wouldn't it be the smarter and more prudent thing to invest in a company that is integrally tied with ecommerce? \n\nAfter all do you ever see a Checkout by Square online? Or receive payment via Square online? Square is chasing a mature sector. Paypal is in the growing sector.", "score": 1, "replies": []}]}]}, {"body": "SQ for sure. \n\nPaypal has done a lot of people dirty and has its name tarred.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -9, "replies": [{"body": "Those can’t be the sole reasons you pick PYPL over SQ...", "score": 9, "replies": []}, {"body": "Only boomers don’t realize SQ’s advantage over paypal", "score": 7, "replies": []}, {"body": "Downvoted for saying the truth, never change r/stocks...lol", "score": 2, "replies": []}, {"body": "I haven’t thought about balance sheets since I fell off my pet dinosaur", "score": 1, "replies": []}, {"body": "PayPal is shit.", "score": 1, "replies": []}]}, {"body": "Sq 15% you will make in next 1 month", "score": -1, "replies": []}, {"body": "How will SQ fair when the financial markets crash in Jan?", "score": -2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "dont believe a random redditor please, they have no clue", "score": 5, "replies": []}]}]}, {"body": "Adyen is better. Listed in Amsterdam.", "score": -2, "replies": [{"body": "Interested but couldn't find in Robinhood but Etrade", "score": 1, "replies": [{"body": "Ahh is that why I never hear about European stocks?", "score": 1, "replies": []}]}]}]}
{"title": "Sandy is Thrilled about Tesla's Battery Day & Begins Battery Mock-up", "selftext": "", "id": "iznong", "created_utc": 1601054477.0, "score": 128, "upvote_ratio": 0.99, "num_comments": 70, "comments": [{"body": "I bet those OEMs who didn't take Sandy's advice are starting to regret it.", "score": 35, "replies": [{"body": "\"Those\"? You mean all of them?", "score": 19, "replies": [{"body": "All the American ones. Sandy could not do his job if no one buys his reports.", "score": 18, "replies": [{"body": "A company buying a report doesn't mean they'll actually make any changes because of it though.", "score": 9, "replies": [{"body": "True, i guess we will find out over the next couple years.", "score": 5, "replies": []}]}]}]}]}, {"body": "I can't help but think that Tesla is going to eventually succeed at manufacturing a single casting for the entire vehicle structure (front, battery base, rear, A-B-C pillar cabin). I feel like I remember seeing a patent diagram that illustrated a full vehicle emerging from the casting machine. At the time, I thought that was preposterous, but now, damn, I believe that's the end-game for the mega-casting program, especially if the battery base is going to be structural.", "score": 21, "replies": [{"body": "I bet that is Elons wet dream when it comes to car manufacturing.\n\nStuff goes in, cars come out. Can't explain that.", "score": 26, "replies": [{"body": "Can’t explain that!", "score": 15, "replies": []}, {"body": "Clean electric in, electrical vehicle out", "score": 2, "replies": []}]}, {"body": "I feel like you’d want to keep them separate\nThe middle battery part could be shared, but then you’d have different front/rear sections for sedan/suv/roadster etc", "score": 13, "replies": [{"body": "Plus they may be planning multiple backend per model, i.e. Sedan, hatchback...", "score": 2, "replies": [{"body": "Mix and match\nSUV front clip with Roadster rear clip Xd", "score": 1, "replies": []}]}]}, {"body": "Do the benefits outweigh the cost though? Having it as multiple allows you to mess with stuff easier.", "score": 9, "replies": [{"body": "Easier to make one tool change then to change multiple tools.", "score": 5, "replies": [{"body": "Eh, Tesla has said they make like 10 hardware changes per week, once you go to a cat then that piece is set in metal for a while, and changes will come more slowly in batches. Probably something to work towards in Texas or beyond, but with Shanghai and Berlin still being early versions I’d give those more flexible tooling for the time being.", "score": 1, "replies": [{"body": "It’s easy. Bank parts, that takes 1-4 weeks. You run the tool overtime and fill up a vacant warehouse with parts to supply the line.\n\nBreak down the tool and ship it, 1 week.\nTool change, 1-2 weeks.\nShip tool back to factory, bring it online, 1 week.\n\n$30k-$200k per tool change depending on the scope.\n$30k-$300k to bank and store the parts.\n\nYou can make 6 tool changes a year before breaking a sweat.", "score": 1, "replies": [{"body": "With a full body cast only 200k? And that assumes it’s only running at like 75% capacity for steady state production which may not be the case.\n\nI’m not saying it can’t be done, I’m saying it’s more expensive to do it with such a large tool and they will do this after they’ve got the basics of the body design down pretty well and wouldn’t make sense for a first production run of a Model 3.", "score": 1, "replies": [{"body": "Larger stamping tools can get up to $600k... I have never seen a million dollar tool, but I imagine these gigacasting tools will be up there. — that’s not the price of a tool change tho, which involves taking the tool out of the equipment, putting it on a bench, welding new hardened steel onto it, machining it away, they probably coating it.\n\nYes, finding capacity to bank is very very tough. Especially when your boss wants to overclock everything.", "score": 1, "replies": [{"body": "You have never seen a million dollar tool? These giant stamps are easily multi million dollar tools. Even the giant robot arms Tesla has can go close to a million or even above that.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "If the Cybertruck exoskeleton approach succeeds, they may switch over to that instead.  Origami-folded steel is likely even cheaper than a giant casting.", "score": 6, "replies": [{"body": "But also very limiting when it comes to shape. An angular truck/car works for some people but not all. There is no way they would fully switch over.", "score": 2, "replies": [{"body": "Very good point.  I suppose it may depend on just *how* much of a price difference we’re talking about.", "score": 1, "replies": []}]}]}, {"body": "Pop out those $25,000 teslas in one shot. It should be a smaller car anyway.. LOL", "score": 2, "replies": []}, {"body": "Just don't do this type of body panel work.\n\nhttps://en.wikipedia.org/wiki/Volkswagen_Karmann_Ghia\n\n\nToo difficult to replace parts that got into a fender bender.", "score": 2, "replies": []}, {"body": "Hot Wheels", "score": 1, "replies": []}, {"body": "You mean maybe something like the Cybertruck? I can't remember what Sandy said about how the Cybertruck will be produced.", "score": 1, "replies": []}, {"body": "This would make the battery completely non removable.", "score": 1, "replies": [{"body": "Doesn't need to be easily removable if it lasts longer than the life of the vehicle.", "score": 5, "replies": [{"body": "It still need to be a bit serviceability in case of malfunctioning or you will have to throw away the whole car.", "score": 2, "replies": []}, {"body": "We don't know that yet.", "score": -4, "replies": [{"body": "as Sandy stated it, that's the case", "score": 5, "replies": []}]}]}]}, {"body": "That would be stupid. If the car is I. 3 pieces you can replace the affected piece after an accident. If it's one giant piece, you'll have to throw away the entire frame if one part of it is destroyed. \n\nRemember there are no pieces to cut spot welds of anymore  and replace if it's one giant piece. \n\nI'm actually curious how the mega casting Model Y will insure.", "score": 0, "replies": [{"body": "Our grandchildren will be severely confused by the concept of a car accident because such events will no longer occur in robofleet. In the mean time if you are insured by Tesla they can recycle frame and battery at relatively low cost, much less than current body work.", "score": 3, "replies": [{"body": "Yea, sure. Keep believing that.\nTesla insurance will be we be anywhere near a significant amount of Tesla's. Especially globally. For many people Tesla insurance is not the cheapest/best option.", "score": 1, "replies": []}]}, {"body": "Its already like that. Airbags are The major cost driver, and then stuff like steering wheels and instrument panels...\n\nBesides, I don’t think a car put together in a skilled garage is the same as one that comes out of a factory. That’s why cars that have a salvaged title come with a steep discount.", "score": 1, "replies": [{"body": "Not every accident makes the car salvage. And sometimes the car comes out better from a body shop, than out of a Tesla factory. \n\nSource: was fleet manager for Tesla vehicles and had to get a bunch of them fixed after accidents. None of them were ever totaled to be considered salvage. Even with major damage, when whole sections had to be replaced. \n\nAlso, airbags may go off, but it's far from being the most expensive item.", "score": 2, "replies": []}]}]}]}, {"body": "This video's great. Thanks op.\n\n\"Elon always undersells what he's doing\"\n\nWell there's something you don't often hear...", "score": 35, "replies": [{"body": "He actually have changed his famous \"Elon times\" predictions since a couple of months towards underselling expecially for production time lines and manifacturing delivery. See Model Y ramp-up and change single piece casting.", "score": 15, "replies": [{"body": "FSD, Roadster and the Semi have been stuck in Elon time for a while now.. The Y was a bit of a surprise however.", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "It was actually there in the Battery day slide deck. Both the semi and Cybertruck are shown to need High nickel and are mass sensitive. IE the Road Runner cells.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "they specifically say the road runner cells with the lighter metal", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "I have 2 questions: \n\nThis is my first Tesla video, so I dont know anything about Sandy but he seems to be extremely knowledgable. I'm assuming since you guys seem to have a postive opinion he has a pretty good track record? My impression is he seems to know his stuff\n\nHe mentions pouring epoxy between the cells. As far as I can tell that would make the pack basically a solid brick. I did have a Prius for a few years, so I know a little more than the standard ICE owner- \n\nI'm assuming that turning the battery pack into essentially a single piece by pouring epoxying into it, means the packs should be damn near bullet proof figuratively speaking- because the one in a gazzillion chance you need to repair something youre fucked. \n\nI know with the Prius they were warranted for over 100k mikes and most made it wel well over that without issue so I assume these packs will be quite sturdy and trouble free.", "score": 10, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Is he that good? ie worth watching for a total of 6-10 hours?", "score": 3, "replies": [{"body": "Maybe not 10 hours, but Munro consulting is the shit when it comes to car tear downs. They provide reports to other car makers on exactly what goes into their competitors cars. Right down the chip design, metal chemistry, you name it they find out.", "score": 10, "replies": [{"body": "Wow. Impressive.", "score": 1, "replies": [{"body": "He does work for the millitary, arospace etc, not just vehicals.. \n\nAs far as Tesla I suggest watching him trash most of the Model 3 as poorly built but with amazing electric power train, only for him to be AMAZED at the improvments on the model Y body for the most part.", "score": 9, "replies": []}]}]}, {"body": "They’re in bite sized pieces, and if you aren’t gonna like it you’ll know pretty quick. If you like geeking out on engineering stuff you’ll like it", "score": 2, "replies": []}]}]}, {"body": "So Sandy Munro of Munro & Associates this guy and his team are engineering consultants . Briefly he helps company’s design or fix designs for problems they know their engineering and manufacturing plus more stuff . They worked on jumbo jets ,military rockets ,jets ,washing machines ,appliances ,cars ,small gadgets . \n\nHe caught the attention of the Tesla community during his time doing a model 3 tear down and appeared on big networks critiquing the model 3 ( YouTube model 3 Bloomberg) . Community weren’t happy. \n\nSo the battery pack has changed massively there is no need for the battery module. Cost time saving.\nnow most of if not all the fire retardant surrounding this area will be removed weight time cost saving. \nThe batteries becomes part of the structure of the car improving handling and stuff I don’t understand. \nThe battery will closer to the body so driving dynamics improved. Thermals of the battery has changed massively so will be cooled different with less stuff needed . Money saved probably.\n\nEdit if you want to check out Sandy Munro he started a YouTube channel “Munro Live” he’s torn down a ModelY and explains stuff.. very interesting guy to follow.", "score": 10, "replies": []}, {"body": "Even with the existing packs when there is a major problem in the pack the entire thing needs to be replaced so there is little to no change from that standpoint. There are two major changes with this. First they used to put the cells into modules then the modules went together into the pack, now they are going to put the cells directly into the pack. Second the pack used to basically bolt into a completed and very strong body, now the pack is becoming the central structure of the body. Cells to pack decreases complexity and part count and increases density of the battery pack. Structural pack decreases complexity and part count of the car body and due to the construction of the pack will be incredibly strong and stiff so there is no decrease in safety.\n\nOne additional note, the reason they used modules and packs that bolt in initially was to support fast and easy battery swaps. Over time they found that wasn't really a thing that people did so they can reduce the complexity and cost without a meaningful negative impact to the customer.", "score": 3, "replies": [{"body": "That first point is new info and answers my question. \n\nThe 2nd part I already knew from Battery Day. Thanks for the answer.", "score": 1, "replies": [{"body": "If you pay attention in the video Sandy shows how the existing pack has the batteries stuck together with cooling channels and some sort of foam around the cells. In the Model 3 and Y there are 4 modules per battery pack so in theory you could replace one of those 4 modules at a time if something were to happen, but in reality the work to replace a single module is equal to or more work than replacing the entire pack and both require significant disassembly of the car. In the Model S and X the pack was bolted from underneath so you could basically just remove a few bolts and the pack dropped out. Even then when there was an issue they just replaced the full pack.", "score": 3, "replies": [{"body": "Yeah, the current packs do look somewhat modular so in theory it does appear that you could replace the broken section... but from both Tesla and the customers point of view it's probably far easier and more economical to replace the entire pack and then if Tesla wants to recycle the materials, run some engineering to see if they can fix or learn something they can. Everybody wins.", "score": 1, "replies": []}]}]}]}, {"body": "Congrats on your first Tesla video! It won't be your last haha", "score": 2, "replies": []}]}, {"body": "He's saying with the bigger cells they can fit 130kWh into the space of a 75kWh battery which I find a bit puzzling given Elon said the bigger cells will increase range by 16%. Can anyone explain that?", "score": 6, "replies": [{"body": "The cell-vehicle-integration which includes removing the vertical cooling pieces [helps to position the cells more densely and increases range by 14%.](https://i.imgur.com/Hps6vPY.jpg) \n\nMaybe Tesla's new form factor is way better than they are letting on or maybe Sandy is also taking the anode and cathode improvements into consideration which increases energy density. \n\nBut by my calculation even with Tesla's stated entire 54% improvement that only gets the model 3 battery to 120kWh.", "score": 8, "replies": []}, {"body": "Yea. There will be less cells in order to save on weight and costs, also maybe have more space for... something.", "score": 3, "replies": [{"body": "Space for feet.", "score": 2, "replies": []}]}, {"body": "The 16% increase was just the extra % of range that the batteries would add on a kWh basis.\n\nUnless I'm mistaken, Tesla didn't really go into how changes to the construction of the battery packs would affect would many kWh the new way of doing it could have over the old way. Which I imagine would be changing for the upside with the the optimization they doing in that area", "score": 2, "replies": [{"body": "They had 1 slide which broke down on a very high level how they got their range increase, cost decrease and capex decrease.", "score": 1, "replies": []}]}]}, {"body": "Here's a quote from [Cleantechnica, april 2018](https://cleantechnica.com/2018/04/29/munro-tesla-model-3-teardown-report-provokes-tesla/)\n\n*\"More than a few industry observers have suggested that Tesla should have hired an experienced vehicle manufacturer to assemble its vehicles. Companies like Magna Steyr build high-quality vehicles for Volkswagen. Deutsche Post (aka DHL) is building its electric delivery vans together with Ford. Rather than reinventing the wheel, perhaps Tesla would have been better off partnering with a company that actually knows how to build automobiles.\"*\n\n/r/agedlikemilk", "score": 5, "replies": []}, {"body": "This was super insightful, Sandy is great", "score": 9, "replies": []}, {"body": "Heat rises, would it be more effective to cool the top of the battery pack than the bottom?  If not, please explain.  Loved the video.", "score": 2, "replies": []}, {"body": "Is the epoxy part true?  No more liquid cooling?", "score": 1, "replies": [{"body": "They still need to cool. It will just be over the cell caps most likely. The heat from cells and motors are used to heat cabin. They cannot just let the heat flow up. Unlikely there is zero heat despite increased electron efficiency", "score": 1, "replies": []}]}, {"body": "You guys are all saying that the battery can’t be removed but have you noticed that the battery is still it’s own individual part that gets bolted on, chances are you can still take the battery pack out, but as the whole thing", "score": 1, "replies": [{"body": "Not if they epoxy the whole thing though", "score": 1, "replies": []}]}, {"body": "Can someone make a gif?\nAt 6min 40 seconds he is talking about short sellers.\n\nIt's very funny, check it out! 😁", "score": 1, "replies": []}, {"body": "How can someone as accomplished and knowledgeable as Munro mix up power and energy? \"74 kilowatt-hours of power built into this product\" around 1:25.", "score": 1, "replies": [{"body": "Mis-speaking is allowable in my world", "score": 8, "replies": []}, {"body": "Everyone makes mistakes when speaking. Of course he knows the difference lol", "score": 2, "replies": []}]}]}
{"title": "Potential moves for next week. Calls only. Thoughts?", "selftext": "GME 10/23 $12C\n\nRCII  11/20 $35C\n\nDBX  10/23 $20C\n\nKSS  11/20 $22.5C\n\nMRVL 10/9  $40C\n\nUCTT  10/16 $22.5C\n\nLUV    10/30  $41C\n\nAAL   10/16   $13C\n\nFAST  10/16  $50C", "id": "izsegq", "created_utc": 1601069125.0, "score": 16, "upvote_ratio": 0.8, "num_comments": 79, "comments": [{"body": "PLUG $15C Oct 16 is all you need\n\nShort squeeze and improving fundamentals.\n\nEasy ten bagger", "score": 19, "replies": [{"body": "Hmm. Huge bag guy right here. Love bags.", "score": 10, "replies": [{"body": "Plug is the biggest bag there is. Sexy ass chart and cheap af calls", "score": 1, "replies": []}]}, {"body": "Man, congrats on this one, stock up 12.61% and I'm just reading all these comments hating on you from 2 days ago\n\nHope all those fuckers really did buy puts", "score": 2, "replies": [{"body": "Lol thanks bruh. Hoping for some more follow thru", "score": 2, "replies": []}]}, {"body": "$11.50 puts are .40 and will likely open at .35 and go to .25 how many option orders would you like me to buy at $.30? 2,000 options orders will likely create a 200,000 share resistance level, or might just make it bottom out if the sellers start shorting to cover their position. I’ll likely have to watch bid ask spreads to time it properly and cause volatility to skyrocket. Good luck with your positions.", "score": 1, "replies": [{"body": "Jesus lmao. Why are you so persistent about this? And what are you thinking it goes down to? \n\nI can’t see it going below ten a share. I guess that’s a good enough reward to get $11.5 puts but I’m trying get big $$ and get otm 2-3 week calls. Way better reward potential", "score": 1, "replies": [{"body": "I was thinking 9.50-9.80. That’s still 300-400% profit. I was going to wedge myself with calls around the 10.10 mark for expiration in mid november so it doesn’t fuck with my short term puts. Wtf do you consider big money? Doubling your money is pretty good and trying to hit a $10 gain on a .30 option is like finding gold at the bottom of a volcano. Did you find it? I think you’re more likely to die than excavate the gold. Better to hope for a $1-2 gain from a .50 option, and try to hit above 80% of the time. I don’t mind pulling out after a 50% gain and i don’t worry about it skyrocketing without me. I do feel slightly guilty whenever I advise my family to sell out early, but when I do that a drop tends to occur the day after.", "score": 1, "replies": []}]}]}, {"body": "Do you know what a 10 bagger is? That means you’re going to make 10000000000% over initial investment. Double baggers are good, and triple baggers make you a god.       \n\nAlso, thank you for showing me a stock I can short on Monday. Damn that’s gonna make it so I don’t have to play bingo against those grandmas.", "score": -12, "replies": [{"body": "Please short it Monday and tell me how much money you lose", "score": 3, "replies": [{"body": "Random question: how much do you want me to spend on puts? I’m confident enough in my charts to put $50,000 into puts for Next expiration in a sweep. I’m also confident that I will be able to sell or exercise all my options for profit by Friday at market open. I’ll buy up calls if it gets low enough for me to consider it a juicy moment.", "score": 1, "replies": []}, {"body": "The fundamental: it is a fucking energy/utility stock based on hydrogen fuel cells that are unprofitable until they can cut the cost by 50%.     \n\nThe technical: it went way below previous support levels and it hasn’t even brushed up against previous support levels(something I expect to happen on Monday) and based on other charts utilities will drop starting Tuesday. The fundamentals and technicals both point in the opposite direction. Short term, it might be a temporary buy after next week, but damn that hemorrhaging is going to turn into rectal bleeding if you aren’t active in your positions.", "score": 1, "replies": [{"body": "Who gives a shit if hydrogen fuel cells won’t be around in 5 years. It’s a speculation play and a damn good one. I’ve been in since $6 a share and won’t leave any time soon\n\nLook at\n\n1. Recent deals with Linde, universal hydrogen and Brookfield. \n\n2. short squeeze that happened during dot com bubble\n\n3. 51% institutional investors is higher than Tesla\n\n4. https://www.forbes.com/sites/greatspeculations/2020/09/24/signal-says-dont-sweat-the-plug-pullback/\n\nStocks don’t go straight up. Bullish chart. One or two days doesn’t change months of price action\n\nIt’s a way better risk reward to go long on a heavily shorted stock than try to short it\n\nAnd no shit you have to be active if you’re in it. You could say that about literally every other option play in this market\n\nIt’s gapping up to $14 on Monday", "score": 2, "replies": [{"body": "If it gaps to $14 on monday(40% gain), I’ll tattoo a pink unicorn right next to my dick, name it autisticjpow69 and post that shit on Reddit.      \n\nAs a reminder, during all the previous crashes, utilities was not what skyrocketed the most, and we are in an energy surplus due to the fact that nobody is working.        \n\nI’m not arguing that it is a decent buy after next week(for a 1-2 month period to go with the Dow rise), but I will say I expect utility companies’ shares to drop starting from mid day Monday or beginning of market Tuesday. I would have to look at charts on Friday to see if it is worth buying the following Monday.", "score": 5, "replies": [{"body": "!remindme 50 hours", "score": 1, "replies": [{"body": "There is a 47.0 minute delay fetching comments.\n\nI will be messaging you in 2 days on [**2020-09-28 20:07:03 UTC**](http://www.wolframalpha.com/input/?i=2020-09-28%2020:07:03%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/izsegq/potential_moves_for_next_week_calls_only_thoughts/g6pdob0/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fizsegq%2Fpotential_moves_for_next_week_calls_only_thoughts%2Fg6pdob0%2F%5D%0A%0ARemindMe%21%202020-09-28%2020%3A07%3A03%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20izsegq)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}, {"body": "The chart is not bullish at all, I dunno what this guys smoking.", "score": 1, "replies": [{"body": "https://www.forbes.com/sites/greatspeculations/2020/09/24/signal-says-dont-sweat-the-plug-pullback/\n\nStocks don’t go straight up. One or two days doesn’t change months long trend. If it’s not bullish, you need your eyes checked", "score": 1, "replies": [{"body": "The last day it closed below the 40MA was Jun03, it has now closed 2 days in a row below the 40MA. It didn't even test the 40MA today.", "score": 1, "replies": []}]}]}]}]}, {"body": "a 10 bagger is 1000% initial investment \nits 10x bag \nmaybe im retarded but where are you getting 1000000000% number from?", "score": 1, "replies": [{"body": "A bag is square. The number in front of it is the squaring number, so 10^10th power.", "score": 1, "replies": [{"body": "https://investinganswers.com/dictionary/1/10-bagger#:~:text=A%2010%20bagger%20is%20a,One%20Up%20on%20Wall%20Street.%22", "score": 1, "replies": []}]}]}]}]}, {"body": "You think GME will jump 20% in 1 month? Can you please give me whatever you’re smoking?        \n\nGTFO my nuts trying to steal MRVL, but $40 calls are too cheap. Better to go with $37-38 calls and not relying on volatility and timing to win. Why pay .40 for $40 calls when you can pay .60 for $38 calls? Being stingy doesn’t work in options trading.         \n\nUAL and LUV are more of a buy sometime next week. We are still in a bull trap and next week should be the end of it leading to a bull market(look for washout participants).       \n\nThose are the only stock on your list I have looked into and tried to project direction. You’d have to be really lucky to hit your mark on the stock I listed at the prices it ended at today if you’re letting them sit to expiration.", "score": 12, "replies": [{"body": "I mean GME is up 100% on the month what’s another 20%? Possible squeeze and/or buyout; good candidate. I’m in shares since high 6’s picked up a few jan $12c on the dip yest", "score": 11, "replies": [{"body": "Yeah, this! It jumped up 20% last Tuesday alone.", "score": 4, "replies": [{"body": "Ya'll have got be kidding.\n\n...please don't ever trade penny stocks.", "score": 1, "replies": [{"body": "You’ll regret not buying when this thing squeezes like all hell", "score": 6, "replies": []}]}]}]}, {"body": "GME can go up 20% in a day lol", "score": 5, "replies": []}, {"body": "What makes you believe next week will be the end of the bull trap?", "score": 3, "replies": [{"body": "Sorry, not sharing that but of personal analytics as it would show my investment strategy. 20-40 people would be okay, but 1,000+ people blowing up my strategy might make it less maneuverable on the days I want to make plays(increase volatility based on specific days with the knowledge it is being day traded and not held through expiration).     \n\nEdit: if you want me to continue sharing my thoughts, projections and buy points for different stock I’d recommend not down voting me for not sharing information I worked hard to obtain and you are unwilling to pay. You’re broke cause you didn’t put in the time and effort.", "score": -19, "replies": [{"body": "Yeah this guy doesn’t belong here. This is why you [ask questions like this.](https://www.reddit.com/r/NoStupidQuestions/comments/iw7e3f/where_can_i_find_a_sexy_polar_bear_outfit_for_men/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) Gay fucking bear.", "score": 12, "replies": [{"body": "ROFL you don’t get the outfit. It has more to do with the phrase “hind sight is 20/20” than it has to do with a gay bear. Again, it goes back to having incomplete sources of information, kind of like how you are plucking premature apples like a retard. I bet I can buy nothing but puts for the next month and still profit more than you in a bull market by timing my trades based on upcoming events that are already known.", "score": -1, "replies": [{"body": "I imagine your need for fancy line seeing bragging comes from the fact your eyes ARE lines. You’re a gay bear AND an r/options user.", "score": 2, "replies": [{"body": "r/options taught me a lot about working delta, gamma and theta to profitability even in a down turn. If you’re willing to overlook information due to the source of the information, that is the definition of ignorant. Do you have a twitch account? Would you like to actively trade against me for 1 day to see how you do vs me? I’m an active day and swing trader, and would welcome the challenge however minuscule it might be.", "score": 1, "replies": [{"body": "He said r/options, ban please\n\n>Would you like to actively trade against me\n\nPerhaps when you open your eyes, nvm you can’t cuz stonks only go UP. Imagine being this boring of a trader having to browse GayDit 1000 times per hour and making whatever these Strait-Egizes are and still being degen enough of browsing reddit. Go ahead, show me a picture of your lambo already 🥱.", "score": 0, "replies": [{"body": "ROFL the guy wants to try to use racism as a tactic as if it proves he is right. I’m sorry you feel like you are one of the entitled people of America, but my house is probably worth your entire family put together. If you can prove your family’s net equity is worth more than 800,000 I’ll donate $1,000 to a charity of your choice.", "score": 2, "replies": [{"body": "> the guy wants to use racism\n\nSir, this is wallstreetbets, and you’re being downvoted. You’re like the COD player who thinks a better gaming chair will make you better at the game. Again, show me your lambo. 😴 💤 Do you include your pet in your net equity(whatever that means) or did you already eat it?", "score": 1, "replies": [{"body": "Trying to say you’re not racist while using a 200yr old analogy to describe my Asian eyes would seem redundant. Stalking my profile for ammunition to use against me and resorting to thinking my race is a weakness shows just how much of a failure you are and how successful I’ve been in the past.             \n\nAlso, I would like to double down on the fact that your entire family combines is more poor than an individual 31yr old asian with immigrant parents. You lose.        \n\nROFL if I’m being down voted that just means I’m on the right track. Most of the people on this sub lose money. If those people who are consistently losing money downvote must investment plan, I think I’m on the path to success. There’s only 1 winner and 1 loser in a stock transaction", "score": 1, "replies": [{"body": "When did I say I wasn’t racist, I’m proud to be one! 🏳️‍🌈\n\nSir, this is r/wsb and you’re acting like a boomer 30 year old trader. Where’s you’re lambo 🥱 ? Who are you even talking to when you’re saying “This guy”? Schizophrenia much?\n\nIn your profile it reads you’re “trying to make a positive impact in everyone’s lives” yet you ate your dog? Hypocritical much? 🤨 You are literally [gay!](https://www.reddit.com/r/AskReddit/comments/f8kpvl/what_is_worse_than_getting_caught_masturbating_by/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) \n\nI would also like to double down on the fact you have not denied or admitted to eating dog. It’s okay, we’re all here for you.", "score": 1, "replies": [{"body": "ROFL I have an $800,000 house that is 70% paid off and I have nearly as much as my down payment in stock equity.       \n\nCan you please remind me how walking in or getting caught masturbating by family is gay? You seem to project a lot of things that show how dumb you are.        \n\nI didn’t make a remark to your dog response because it is obviously an attempt by someone who failed to graduate high school and wants to troll online to make themself feel better. I’m sorry you want to use racial stereotypes as a way to fight your fights, but as long as you’re on welfare the only fight you should be worried about is your fight for food stamps and alcohol.     \n\nLuckily, gay people aren’t an issue in this world, and instead the issue is people who want to project the us vs them mentality. Unfortunately, most Trump supporters like yourself don’t understand that he has done nothing to benefit you, while he has done everything to help the wealthy. Congrats on being a retard because you’re on a different level of special.", "score": 1, "replies": [{"body": "> “70% paid”\n\n😐.\n\nEDIT: What FBI agent are you asking that is giving you my inf? When did I say I like trump?!?! 😂", "score": 1, "replies": [{"body": "70% paid is pretty good considering I bought it mid January. If you talk to any creditors, that seems to be the sweet spot for increasing credit rating while having proof of existing lines of credit. I plan on buying another house if I can gain 15% over current value by December.  I’m not living in a trailer unlike you.", "score": 1, "replies": [{"body": "> ”70% paid”\n\n😕 You kind of fluked your entire statement right there. Of course I still knew from the moment you started bragging at literally r/wallstreetbets. Btw, are you going to give me that lambo pic I ordered you to take?", "score": 1, "replies": [{"body": "I don’t have a lambo, but I do have enough to buy one. When you post a picture of your family’s net worth or showing how much they are worth, I’ll start posting financial statements for your dumbass. I would still like to see that trailer you live in even if it’s a beat up pickup truck with access to McDonald’s wifi.", "score": 1, "replies": [{"body": "> “I don’t have a lambo”\n\nTalk about the luscious trader image you set up for yourself 😆 of course you’re line seeing bragging is literally basic trading knowledge but what do i know 🥱 If you don’t have a lambo, do you at least have a wife and kids?  Or are you going to say you have enough to buy one again? \n\nGod forbid when you said “31 year old asian” you actually meant it.", "score": 1, "replies": [{"body": "Lol if you value yourself based on if you have kids and a wife, you must not value yourself at all.       \n\nIf you want to act like everyone should have a lambo, where’s yours? You’re so poor you don’t even have a trailer to show off as your own.    \n\nThen again, what do I know? I’m only a college graduate that pays more taxes every year than you could dream about making. It must suck being trailer trash and using emojis to express your feelings because you feel emojis express your feelings better than any words you could come up with. Go ahead and keep tracking my post and comment history for fuel to your fire. You will notice that I have hit on every single projection I have made this far. Can you please show me when’s the last time you made an accurate prediction on Reddit?", "score": 1, "replies": [{"body": "I mean, do you have a wife and kids? 😐 I assume you had a dog, but uh, you ate it 😝.\n\nAlso I don’t think you’re right on the projections thing, because despite your [teachings](https://www.reddit.com/r/AskReddit/comments/ff58em/you_get_to_go_back_in_time_to_meet_your_grade_9/fjvufn5/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3), you still brag at LITERALLY r/wallstreetbets 🧐 I suppose you’re especially angry today too since you came back out of your tomb to brag in a 7 upvote post 🐋.", "score": 1, "replies": [{"body": "Oh I see where you’re going with this. You like preteens and would be interested in trying to rape any kids I might have. Gross bro. Go check yourself into an insane asylum.      \n\nYou’re trying to tell me that if you could go back and become a straight A student instead of a 2.7 gpa student, you wouldn’t do it? I realize my potential now that I’m older and have started trading stock, and wish I would’ve applied that to myself at a younger age. That post actually signifies about the time I came to the realization that I am able to do more than my peers but never took advantage of my ability. Thank you for showing me that post because it gave me the ability to reflect back on the lesser days before I figured out what my true potential really was. I really appreciate you man, thanks!", "score": 1, "replies": [{"body": "Now that’s what im talking about! Now that is, unless you keep bragging in a literal gambling subreddit, but common ground rocks!", "score": 1, "replies": [{"body": "It’s not gambling if you have an investment strategy. \n\nWho is the ceo/cfo?       \nWhy do you want to invest in this stock(don’t say hype)?         \nWhere is it geographically located?        \nWhat do they produce or what services do they provide, and how will that be effected in the near and long term future.     \nWhen do you plan on buying in and when do you plan on selling out?    \nAt what price do you plan on buying in at and what price do you plan on selling regardless of date and time?       \nHow do you plan on executing your order(pre/during/post market)?      \n\nThose are all questions I ask myself before I ever buy a stock or option. It will prevent you from making dumb mistakes and help you make the right ones.         \n\nFood for thought: if fridays have a tendency of going up and falling for the last hour week after week after week, why wouldn’t you sell your puts Thursday at close or Friday at market open? Those are the types of patterns I look for.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I like mrvl but no way I’m getting in short term calls on a stock that’s barely moved in months\n\nMaybe November or January expiration", "score": 1, "replies": [{"body": "End of October/beginning of November expiration. If you do time the play properly on Thursday/Friday you might be able to make money, but I feel more confident in a 5g rebound plus ongoing trade war barbs propelling MRVL to new heights especially with a lack of chips on the market set to handle 5g networks. I am not holding past mid november and will look to sell out around election time. Current events will change circumstances in the market, and i fully expect either vaccine data or proper stimulus news by oct 8 to stimulate the markets. I’ve been able to call out AstraZeneca, immu and jnj news/trials before they are ever released purely from speculation of looking at charts and matching it with “this has to happen for this to happen.” It happened last earnings season and I expect it to happen this season as well.", "score": 1, "replies": []}]}, {"body": "Gme went up 100% in a month", "score": 1, "replies": []}]}, {"body": "Gme is rising after hours and is now one of my biggest holdings. I agree with you.", "score": 6, "replies": []}, {"body": "There's a whole weekend of news coming up that will either tank the market or send it to the moon.  All I know for sure is that this stupid thing will react in a way that makes no sense at all.", "score": 5, "replies": []}, {"body": "I'd throw it all on GME. So many compounding factors thats gonna make it moon.\n\n* Short squeezed like VW in 2008\n* Michael Burry (the god that bet on the housing market crash) heavily invested\n* CEO of Chewy gonna Chewify it\n* Console cycle coming up which drives trade ins", "score": 5, "replies": []}, {"body": "Need to add some BA calls and you’re golden", "score": 3, "replies": []}, {"body": "$zi 40 11/20", "score": 2, "replies": []}, {"body": "Thx these have such cheap prices i can actually gamble in em XD", "score": 2, "replies": [{"body": "Same bro", "score": 1, "replies": [{"body": "Thx for ur post btw i added these to my watchlist", "score": 1, "replies": []}]}]}, {"body": "If you want to play airline JETS is a better bet by the time you play AAL the loan will already be priced in", "score": 2, "replies": [{"body": "This thread was this first I’ve ever heard of this ETF. Thanks.", "score": 1, "replies": [{"body": "Glad to be of help", "score": 2, "replies": []}]}, {"body": "Glad I already got in on AAL calls 14.5c 10/2 and 15c 1/15/21", "score": 1, "replies": []}]}, {"body": "Spy PUTS $320 10/5. I bought a bunch of them at the end of the day.", "score": 2, "replies": []}, {"body": "**I am a bot. Is this submission violating the [content guide](https://www.reddit.com/r/wallstreetbets/wiki/contentguide)? Vote below.**\n\n| **Remove It** | **Keep It** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=izsegq&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=izsegq&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=izsegq)\n___\n ^comment ^will ^disappear ^--- ^19 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 1, "replies": []}, {"body": "NIO $24 10/2", "score": 1, "replies": [{"body": "Needs to have a breakout from ascending triangle pattern it’s been in for a month (near $19.5ish). Then I’ll get balls deep in short term calls\n\n$22-24 strike with two weeks expiration will print", "score": 2, "replies": []}]}, {"body": "I have PLUG 12.5C 10/9\n\nAnd JETS 17.5C 10/2", "score": 1, "replies": [{"body": "This is an option pricing bot. The latest option price is:\n\nTicker|Strike|Bid|Ask|Last Price|% Change\n-|-|-|-|-|-\nPLUG|12.5| 0.39| 0.43| 0.42| -\nJETS|17.5| 0.15| 0.25| 0.21| -16.00%\n\n\nPLUG 12.5call 10/9/2020 was mentioned 0 times\n\nJETS 17.5call 10/2/2020 was mentioned 0 times\n[Click to see where](https://www.reddit.com/message/compose/?to=aRecycleAwayAccount&subject=g6kqya7&message=Show me)", "score": 1, "replies": []}]}, {"body": "You're missing:\n\nNOK 10/2 $5C (honestly every $5C weekly until EOY until acquisition)\n\nCSCO 11/20 $50C ($45C if you're a pussy)\n\nVZ 11/20 $65C\n\nQCOM 11/20 $135C\n\n\nAlso\n\nCarmaxx 10/2 $105C", "score": 1, "replies": [{"body": "NOK always intrigues me. Been hammered last month though. Jan $5C?", "score": 2, "replies": [{"body": "Yeah I have so many of those. If you're willing to bet largely because of acquisition and not just it being fundamentally undervalued, go for lower strikes. _Should_ they be bought out, i don't think it will be for more than $5 a share so every call with strikes higher will be worthless.\n\nOutside of acquisition target, nokia is tremendously undervalued and when the bring back their dividend (in a few quarters) their div yield at today's price is insane. Especially if they bring back their quarterly dividend. Tons of idiots on RH saw its share price and hopped on a month ago thinking it was some GNUS tier crap and not having any understanding of the company, nor 5G and why it slimmed down and halted the div. Smfh. A Nokia play needs complementary ones, which i purposefully omitted (for the most part). \n\nIt's really cheap enough to buy a few thousand shares on your non gambling account.", "score": 0, "replies": []}]}, {"body": "This is an option pricing bot. The latest option price is:\n\nTicker|Strike|Bid|Ask|Last Price|% Change\n-|-|-|-|-|-\nNOK|5.0| 0.0| 0.01| 0.01| -\nCSCO|50.0| 0.05| 0.08| 0.04| -42.86%\nQCOM|65.0| 48.65| 50.6| 46.1| -\nQCOM|135.0| 1.52| 1.87| 1.65| +10.00%\n\n\nNOK 5.0call 10/2/2020 was mentioned 0 times\n\nCSCO 50.0call 11/20/2020 was mentioned 0 times\n\nQCOM 65.0call 11/20/2020 was mentioned 0 times\n\nQCOM 135.0call 11/20/2020 was mentioned 0 times\n[Click to see where](https://www.reddit.com/message/compose/?to=aRecycleAwayAccount&subject=g6l2ikp&message=Show me)", "score": 2, "replies": []}]}, {"body": "I like the KSS play. They have been focusing on their online sales and would really benefit from a stim package. It traded down today, and then turned up into the close on the back of the $4 trillion stim rumour (approval this weekend) that was on twitter.", "score": 1, "replies": [{"body": "All I know is, the stores are PACKED in the Phoenix area.", "score": 3, "replies": [{"body": "Music to my ears", "score": 2, "replies": []}]}]}, {"body": "Say goodbye to your money", "score": -1, "replies": []}]}
