{"title": "[deleted by user]", "selftext": "[removed]", "id": "isa15s", "created_utc": 1600042419.0, "score": 237, "upvote_ratio": 0.95, "num_comments": 69, "comments": [{"body": "I wonder if MSFT investors will be happy instead.", "score": 95, "replies": [{"body": "That’s the real question...\n\nI’m one of the MSFT investors that went with the bullish sentiment on this", "score": 44, "replies": [{"body": "sell, get profit, buy dip", "score": 15, "replies": [{"body": "Exactly - though when this dip will be is harder to say.", "score": 2, "replies": [{"body": "“Stonks only go up”", "score": 2, "replies": []}, {"body": " \n\nAnother  shill and duplicate promotional account for unusualwhales. Mods, please  ban this person - registered on September 1st and just started posting  right away about unusualwhales. How many accounts is this person going  to create?\n\nHere are few screenshots of his/her other accounts:\n\n[https://www.reddit.com/r/smallstreetbets/comments/iskujg/orcl\\_insider\\_trading/](https://www.reddit.com/r/smallstreetbets/comments/iskujg/orcl_insider_trading/)\n\n[https://i.imgur.com/Ms9NXwC.png](https://i.imgur.com/Ms9NXwC.png)\n\n[https://i.imgur.com/Kc0nkf0.png](https://i.imgur.com/Kc0nkf0.png)\n\n[https://i.imgur.com/robEuWm.png](https://i.imgur.com/robEuWm.png)\n\n[https://i.imgur.com/ehMonNh.png](https://i.imgur.com/ehMonNh.png)\n\nThe  OP spams every single reddit with promotional links of his/her service.  I am pretty sure he/she will start downvoting this comment from all  his/her accounts. Just watch! OP also has about 2-3 banned accounts but  is not stopping creating new accounts. Reported all his/her accounts to  reddit administration today.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "that was very clever, name other services but keep the links of your service so that no one expects anything fishy. You are getting banned everywhere.", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "We'll see. I have my eyes on you now. And you should change your screenshot capturing service. It's too clear that it spoils the fun of investigating your accounts. \n\nAnyways, I have reported this to mods and reddit admins along with all the unusualwhale option accounts. Let's see if they spare you or not.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Yeah, I am one of these investors. I don't see this as Microsoft's game, and I see Tik Tok like a new Vine. THis and Instagram has already replicated it with Reelz. MSFT needs to stick to what they are good at and use that cash elsewhere without getting embroiled in geopolitical conflict that is just going to cost them business elsewhere.", "score": 6, "replies": [{"body": "Neither do I - I think MSFT will suffer in short, but long run, will remain steady. This was a gamble.", "score": 1, "replies": []}]}]}, {"body": "MSFT puts? I am glad they didn't acquire it. Long on MSFT, and TikTok doesn't fit into the portfolio. What would they do with it? Integrate it into Teams and LinkedIn? For the love all that is holy, please no!\n\nI actually hope nobody acquires it and we'll be rid of Tiktok eventually.", "score": 59, "replies": [{"body": "Just out of curiosity. Why do you dislike Tik Tok so much? It seems very profitable as a company. Or are you talking personally ?", "score": 12, "replies": [{"body": "I guess I am just getting old and hate the flood of TikToks every day, but it is not just that. This wasn't a real acquisition since key parts seem to be excluded. It's more like a hosting and oversight agreement. Which makes me suspicious.", "score": 17, "replies": [{"body": "Also, I think a lot of the hate with TikTok is the secrecy around it, and how much of the privacy will later be warranted on further accounts. They're all murky.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -7, "replies": [{"body": "TikToks not a great long term strategy. It’s been widely agreed upon that the app is basically spyware. Further, the app currently has very little oversight in terms of content and advertisement laws. When both advertisers and FTC wake up, TikTok is going to have a huge problem.", "score": 6, "replies": []}, {"body": "It's perfectly valid to take personal preference and morals into account when trading. You may not make as much as otherwise in some cases, but for many people that's worth keeping their values. Lot of people don't trade oil and gas for instance", "score": 2, "replies": []}]}]}, {"body": "When tiktok started as the \"new vine\", EVERYONE hated tik tok through one extension or another; being the vine clone, dumb for memes, etc. I'm surprised everyone forgot about that era.", "score": 3, "replies": []}]}]}, {"body": "As a Microsoft Investor, I'm happy with that outcome.", "score": 23, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "They would still need to work with Bytedance in the future as well as they saved themselves the political turmoil and a billion in cash", "score": 5, "replies": []}]}]}, {"body": "I would never sell my thot for a penny.", "score": 63, "replies": [{"body": "That's okay, half the thots on TikTok will just sell themselves for one.", "score": 20, "replies": [{"body": "Never used it 🤷🏼‍♀️", "score": 5, "replies": []}, {"body": "You mean the 12 year olds?", "score": 1, "replies": []}]}]}, {"body": "Oracle is one of the worst company out there (shitty software, top heavy, no innovation). They will run it to the ground in 1 year. \n\nhttps://www.thewrap.com/tiktok-parent-bytedance-wont-sell-underlying-algorithm-china-paper-says/", "score": 57, "replies": [{"body": "Did you not read the article? This is not a sale. This is a partnership, and it obviously follows that Oracle will be providing data hosting in order to catch a flagship customer as part of a drive to push their cloud services to the greater market, while Bytedance is seeking to keep their IP (which is partly enforced by China's recent security law).", "score": 39, "replies": [{"body": "that's what we're saying, oracle is shit at their one fucking product \n\nlook at the companies still using oracle, they're all literally shit tier companies that probably have the worst fucking turnaround times on service and are literally alive just because they are too big to fail or they have friends in the admin", "score": 16, "replies": [{"body": "Ik of a friend that is in data management and his company ditched oracle cause of price Jacking and terrible service. I can’t beehive tiktok really is teaming up with oracle", "score": 6, "replies": [{"body": "ya they wanna kill it\n\nshrimp dick don really wanted to see it die after getting cucked by a bunch of zoomers and kpop stans on tiktok", "score": 1, "replies": []}]}, {"body": "Hey now oracle is highly invested in chainlink, the currency of the future, at least that's what /biz/ says", "score": 2, "replies": []}, {"body": "I work in hospitality and tons of the systems used by rooms and f&b are oracle based. Everyone knows they suck but they’re all so interlinked and expensive to transition from that it just is what it is now.", "score": 1, "replies": [{"body": "why do I feel like that's oracle's business model lmao\n\n>shhh if we tell them they aren't good enough and that it'll be expensive to transition from us, they'll never leave!", "score": 1, "replies": []}]}, {"body": "While I agree they're shit, won't this compel them to be better?", "score": 1, "replies": []}]}, {"body": "It appears that Bytedance didn't accept Oracle's offer, either.\n\n> China has already signaled it would rather see the app banned than allow a forced sale by issuing new tech export controls that cover the recommendation algorithms that drive TikTok’s success. ByteDance said it would abide by the new regulations. Beijing is now showing it could block even this far more limited arrangement, with the overseas arm of China’s state-run CCTV broadcaster reporting after the news of a possible Oracle deal that ByteDance “will also not sell TikTok’s U.S. operations to Oracle.”\n\nhttps://qz.com/1902869/tiktok-rejects-microsoft-bid-but-oracle-may-not-win-either/\n\nIt's disgusting to see how US investors are all slobbering over the chance that a US company will snap up a company that is effectively being stolen from its creators/owners with the Trump Administration's false use of \"national security\" government imperatives. It appears that China will not allow the forced sale of the key AI tech that makes tiktok better than anything the US can currently produce, and that's a good thing. If China allowed that, then none of its tech intellectual property would be safe from other similar seizures on the pretexts of \"national security\" in the future.\n\nEdit: Americans should just lose access to tiktok and in general begin to fall behind while the rest of the world has better social media platforms, while living with the sad reality that its own social media platforms are far more invasive of privacy, political propaganda that manipulates them using algorithms and data gleaned from that invasion of privacy and economic exploitation that is far worse than anything any foreign government has done with its social media platforms. Our national security problems are in the leveraging of social media platforms to corrupt our elections with targeted psychological operations that use personal data mined from user accounts, misinformation and bots/troll farms/sockpuppet armies, and that is the actual active threat that the Trump administration has ignored since 2016.", "score": -13, "replies": [{"body": ">\tIt’s disgusting to see how US investors are all slobbering over the chance that a US company will snap up a company that is effectively being stolen from its creators/owners with the Trump Administration’s false use of “national security” government imperatives.\n\nInvestors care about money. Open your eyes lmao", "score": 3, "replies": []}, {"body": "really sad people can't make money and not call out bad things in the world, that's the whole reason america sucks in general. You're 100% right and the downvotes make me sad", "score": -1, "replies": []}]}]}]}, {"body": "They intend to sue the Trump Administrator. So this is no surprise.", "score": 8, "replies": []}, {"body": "Well there goes any hope of my portfolio not being red again this week.", "score": 19, "replies": []}, {"body": "Translation: The PLA is much more confident in their ability to hide covert remote access payloads from Oracle engineeers than Microsoft engineers", "score": 8, "replies": [{"body": "Aren't those engineers both in the same building in India? ;)", "score": 10, "replies": []}]}, {"body": "Thotiana won’t be happy with this outcome. My Dear Princess Thotiana, although you spite me, how could you be let down by the market’s furtiveness? Perhaps there is a compromise to be sought.", "score": 3, "replies": []}, {"body": "This deal could have gone either way for Microsoft although I feel its a little out of the place for MSFT. Their strength has always been providing products and services in professional domain e.g. office-365, teams etc. Social media domain is altogether a different ball game.", "score": 2, "replies": []}, {"body": "You have may have to login to a Unix server and run a shell script in Sudo mode to post something going forward...never know", "score": 2, "replies": [{"body": "And expand your tablespaces", "score": 1, "replies": []}]}, {"body": "Good. In 2 years Tiktok will be forgotten and MSFT would have been saved the embarassment. It would have been a terrible investment.", "score": 3, "replies": [{"body": "Actually no, it reached a billion users WAY faster than any other app. Tiktok will never be forgotten among young people.", "score": -5, "replies": [{"body": "Two years later...", "score": 3, "replies": []}]}]}, {"body": "Oracle confirmed . Just reached a deal . Of sorts atleast . A partnership really .", "score": 3, "replies": []}, {"body": "doesn’t mean another company would try to sneak in a deal", "score": 1, "replies": []}, {"body": "ORCL subject to 2 gov't approvals.", "score": 1, "replies": [{"body": "Oracles CEO is butt buddies with Trump if I’m not mistaken.  Pretty sure it will go through.", "score": 16, "replies": [{"body": "OK", "score": 1, "replies": []}]}]}, {"body": "It's going to shutdown. The Chinese gov't paid them to close US operations rather than sell.", "score": 1, "replies": []}, {"body": "Dumb question.. what does that prediction mean?  Buy or sell those options?  I'm assuming you're saying MSFT stock will go up (sell the puts) and ORCL stock will go down (sell the calls).. is that correct?", "score": 1, "replies": []}, {"body": "I'm more inclined to see this as good news. What I like about Microsoft is that it is extremely focused on business software and all the parts make sense together. \n\nWith TikTok, I would be afraid that it would be distracting + company will avoid possible political and regulatory issues.", "score": 1, "replies": []}, {"body": "I don’t know man, I feel like this is actually a positive for MS.", "score": 1, "replies": []}, {"body": "If MSFT managed to buy TikTok, can you believe what sort of intelligence power they would have? They already know what we write (office), what and how we use (windows), and with TikTok, they would have massive amount of power into learning about our 'social habits' + more enhanced facial recognition related data. Not China fan but i was not a fan of this either.", "score": 1, "replies": [{"body": "What if I told you it's possible to not use TikTok?", "score": 3, "replies": []}]}, {"body": "Aalso prob FB calls as reels get more attention  potentially fsly puts since they will switch to orcl now", "score": 1, "replies": [{"body": "I don't think Fastly will move that much", "score": 1, "replies": []}]}, {"body": "Another shill and duplicate promotional account for unusualwhales. Mods, please ban this person - registered on September 1st and just started posting right away about unusualwhales. How many accounts is this person going to create?\n\nHere are few screenshots of his/her other accounts:\n\n[https://www.reddit.com/r/smallstreetbets/comments/iskujg/orcl\\_insider\\_trading/](https://www.reddit.com/r/smallstreetbets/comments/iskujg/orcl_insider_trading/)\n\n[https://i.imgur.com/Ms9NXwC.png](https://i.imgur.com/Ms9NXwC.png)\n\n[https://i.imgur.com/Kc0nkf0.png](https://i.imgur.com/Kc0nkf0.png)\n\n[https://i.imgur.com/robEuWm.png](https://i.imgur.com/robEuWm.png)\n\n[https://i.imgur.com/ehMonNh.png](https://i.imgur.com/ehMonNh.png)\n\nThe OP spams every single reddit with promotional links of his/her service. I am pretty sure he/she will start downvoting this comment from all his/her accounts. Just watch! OP also has about 2-3 banned accounts but is not stopping creating new accounts. Reported all his/her accounts to reddit administration today.", "score": 1, "replies": []}, {"body": "Rejected because MSFT didn't offer enough money for TikTok aka all the user's personal data", "score": 0, "replies": []}, {"body": " https://twitter.com/ParkerMolloy/status/1305315788501458944?s=20", "score": 0, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Correct, it seems a little out of place with how they integrated it into instagram. It isn't as seamless as their snapchat knockoff", "score": 6, "replies": [{"body": "Ehhh. Cause igtv worked so well as a standalone before.\n\n\nOr how would ig stories work as a standalone instead of directly being in the app...?\n\nEither way fuck reels anyway", "score": 2, "replies": [{"body": "Way", "score": 1, "replies": []}]}, {"body": "They could still do that to be honest, they probably will measure traction and make the decision to isolate it or not.", "score": 0, "replies": []}]}, {"body": "They had a standalone app and it failed.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "https://techcrunch.com/2020/07/01/lasso-facebook-tiktok-shut-down/", "score": 0, "replies": []}]}]}]}]}
{"title": "How have you changed as an investor in 2020?", "selftext": "How have you evolved as an investor as a result of the confusion of 2020? Personally I've done through the following modes\n\n* Started investing in 1999, did everything wrong, like buying that great Janus fund that was up 39% last year? RIP me.\n* Had no-name \"advisors\" doing absolutely nothing for me for a few years\n* When I got enough money to get my own named advisor with Wells Fargo, things went \"well\" — I was able to take part in the recovery after the GFC, though of course I was paying him 1.4% to manage my stocks, and he was buying funds with 0.8-1.5% expense fees. When he talked me out of buying AMZN at $450, I fired him, figuring I can make my own mistakes and save the 1.4% fee.\n* So I moved everything over to Fidelity in 2015 and did well, mostly using iShares funds but owning some individual stocks I thought I understood. But while I know a Boglehead-style buy and hold strategy will work for me in the end, I was interested in learning about quantitative ways I could know when I should or should not be in the market, perhaps using tools like The Investor's Podcast has, a momentum tool that can provide basic buy or sell signals, which is really cool. \n\nI decided to try to properly try to learn to understand chart functions like RSI, MACD and understand for myself when I should be buying stocks and staying away. I joined [StockCharts.com](https://StockCharts.com) and watch the content they put out on Youtube, which is very helpful at understanding the ideas and reinforcing things nicely. This will hopefully keep me from saying \"Oh, AT&T fell 10%, I guess it's a buy\" when it clearly isn't, and that I shouldn't be holding those shares of DAL in February of 2020. \n\nHere's an example chart of SPY, since we can't embed images into posts here. I really love the things you can do with this platform. \n\n[https://imgur.com/a/S8JGaZa](https://imgur.com/a/S8JGaZa)\n\nYou can do things like organize your portfolio and sort by RSI so you can see trends and understand things you shouldn't be holding. And set up default charts to go to when things crash, so you don't feel \n\n[https://imgur.com/a/1IrBBZv](https://imgur.com/a/1IrBBZv)\n\nSo bottom line, I'm going to try to avoid allowing huge drawdowns on my \"buy and hold\" stocks going forward. Which sounds like common knowledge, but I was a Boglehead for so long, it takes a while to unlearn it all.\n\nTell us how your investing style has changed this year!", "id": "isgghn", "created_utc": 1600069125.0, "score": 40, "upvote_ratio": 0.9, "num_comments": 80, "comments": [{"body": "Flipping a coin to make investment decisions is no worse than basing them on technical and fundamental analyses.", "score": 26, "replies": [{"body": "I’d say yes, to a degree. But the various indictors give actual information that help you, say, buy at a smarter time than you otherwise would. Or give you a checklist to hit before pulling the trigger on some investment.", "score": 7, "replies": [{"body": "[Eh](https://www.stockinvestor.com/35446/beating-market-surprise-surprise-monkeys-win/)", "score": 4, "replies": [{"body": "Oh, I know that, I've been in the market for 20 years. I am just trying to come up with some ways to buy a B&H investor but who also uses some rules that I can make myself follow. \n\nWhat is your system? All index funds only?", "score": 2, "replies": []}]}]}, {"body": "I guess there's nothing wrong with both. After all, you don't actually have the full grasp of how things will turn out. Either flipping a coin or an education cannot fully give you the answer.", "score": 1, "replies": []}]}, {"body": "I started investing in March because of the crash. I’ve had around 10g sitting in the bank for a little while collecting dust, So i decided to go all risk and buy cruises, airlines, department stores and oil. My eyes came out of my head on 8 June but I held like a noob. Since then I’ve been doing more research and buying stable companies, my latest investment was RTX (raytheon) and MSFT (before Tik Tok talk). But yeah i’m tryinf to be partly responsible because it is my only money in savings but I love risk and am young (29) so I like a little bit of the gamble too.", "score": 11, "replies": [{"body": "Great timing! And at age 29, you have lots of time to make mistakes and learn from them. Remember that in the end, your time horizon and your savings rate (and ability to resist “lifestyle creep” as your career advances). And also, avoid divorce. So many of the smart rich guys on Bogleheads swear by that rule as it kind of messes up your investments.", "score": 6, "replies": []}]}, {"body": "Started investing in 2015 with about 35k. Invested in only metals. 90% in Gold, the rest in silver, palladium, platinum. Sold everything this year in the recent spike. \n\nTripled down & Headed into stocks from March-July. Made a diverse portfolio for a 20 year run. Up 25% as of today with big tech, target, Disney and indexes taking the lead as my A-team. \n\nMy Laggards are banks, airlines, basic materials & energy. It’s been a wild ride but a great learning experience!", "score": 8, "replies": [{"body": "Sounds good! What platform do you use? I’d love to be on M1 like Joseph Carlson on Youtube, but I’m probably too old to learn something that newfangled, and wills tick with Fidelity.", "score": 2, "replies": [{"body": "I use the Wells Fargo platform since I use them for my mortgage and IRA. It’s a great platform and free as well. But I think you need to have an account with them in order to use. Although no one on this subreddit likes WFC lol", "score": 1, "replies": [{"body": "Ah, they were the advisors who I got away from. I'm sure their system does all you need it to, but they're a dinosaur compared to all the others. I especially love the way M1 can be made into basically your own own index. You could create SPY ex-tobacco if you wanted to. Or whatever your beliefs were.", "score": 2, "replies": [{"body": "The worst I’ve ever seen was vanguard. WFC is the jetsons compared to prehistoric vanguard. My fiancé has vanguard and it’s fucking hell. Just buying a stock is complicated", "score": 2, "replies": [{"body": "Yes I ditched Vanguard quickly too. Couldn't figure out their weird paradigm of \"you don't buy our funds, you move them form this fund to that fund.\" That and the fact that they re HELLISHLY hostile to anyone living abroad, and will basically not let you keep accounts with them. So basically the U.S. expects me to pay taxes on my global income, which I do, but not get the benefit of a well-run brokerage firm.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I don't trust and NEVER gonna trust chinese stocks", "score": 34, "replies": [{"body": "I understand your misgivings. However, Asia is going to be THE emerging market of the 21st century.  Careful you don't miss out on some huge potential gains.", "score": 9, "replies": [{"body": "Asia is going to be the market. But not necessarily has to be the provider of those products or services.\n\nThere are potentially hundreds of companies that can make me money. But 100% chinese companies are government controlled and not worthy of trust about their financial statements", "score": 11, "replies": [{"body": "How is this any different than the Feds having stake in hedge funds that control the US stock prices? In China, the dog is wagging the tail. In the US, the tail is wagging the dog. These ETFs are tracking stocks currently; not the other way around.", "score": 6, "replies": [{"body": "I respect Linsanity to much to contradict you", "score": 5, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "I am not saying it because the nationality. But because his profile name", "score": 6, "replies": []}]}]}]}, {"body": "That is an undeniable fact though. Some government would fund companies in order for them to take a few more step ahead. Both is actually a good move (for some).", "score": 2, "replies": []}, {"body": "The global market is undergoing a form of economic Balkanization when it comes to regions. Asia already has its own dominant tech companies, protectionism against the major us tech companies will become even more common. What is happening in Asia will likely happen in other emerging markets.\n\nRegional emerging market tech etfs might be a big thing in the future. I am not the only one to say this a couple billionaires have mentioned this too.", "score": 2, "replies": []}, {"body": "Alibaba’s company and market is worth my money.", "score": 2, "replies": []}]}, {"body": "I would agree on that. But come to think of this, Don't you think that these type of stocks have its own specialty that's why some people are seeing these? Yet it also have some things that it can't do which non-Asians can. It is really a risky move.", "score": 1, "replies": []}]}, {"body": "While I agree with you I dont like that Chinese stocks are opaque. This thinking though will definitely have you lose out of potential gains if China stocks ever get with the times. I been doing this long enough I remember some people saying they will NEVER buy tech stocks its just a fad and their valuations are too high.", "score": 2, "replies": []}, {"body": "Hmm, probably for the best, though I wish I'd bought BABA back in the day.", "score": 1, "replies": []}]}, {"body": "Buy high sell low #lifesmotto", "score": 7, "replies": [{"body": "Sorry but I like to buy low dude. And then sell lower!", "score": 4, "replies": []}, {"body": "Yolo!", "score": 3, "replies": []}]}, {"body": "I spent a few weeks in the summer stressing over the companies I’d bought in. Had I done enough research? Fuck, earnings is coming up, is it gonna die or moon?\n\nThen one Monday morning I sold all positions and bought industrials and S&P. \n\nI have never been more calm.", "score": 7, "replies": [{"body": "Nice. Yes, do your best to figure out what kind of investor you are and get systems in place. Learn how to read moving average and understand RSI and MACD, if that’s what you want to do. Or be an income statement reading kind of guy (which I am not). And when in doubt, never sell.", "score": 2, "replies": []}]}, {"body": "I moved from great portfolio based on 4 ETFs to 50 % Amazon and 25 % random stocks which were on sale (already sold ones in green and kept only Wells Fargo and Shell which are both worth 30 % less). My goal is to hold 40 % Amazon 10 % BRK.B, 15 % MSCI World 15 MSCI EM and 10 % REIT based index fund and 10 % gold.", "score": 4, "replies": []}, {"body": "Trades i make while on the toilet usually are shitty ones.", "score": 3, "replies": []}, {"body": "I became one.... like 2 weeks ago😂\nOh how much you can learn what you did wrong in a week...", "score": 2, "replies": [{"body": "Best of luck!", "score": 1, "replies": [{"body": "Thank you!!", "score": 1, "replies": []}]}]}, {"body": "Im sorry why is buying 10% down not good and how does macd and RSI show you this? Im guessing you are using some indicators to say it will keep going down and 10% down is not the lowest it will be. I have read up on macd and rsi and DMi oscillators but not sure how to use it quite yet. If theres a news and RSI goes super low, the price will keep going low regardless of oversold... if we take news out of consideration whats telling you a stock will rebound at 10% low or not", "score": 2, "replies": [{"body": "Well mainly I’m thinking of understanding of trends and down trends. Before I would have just bought randomly based on my gut, without understanding whether some long downtrend had played it self out and was picking up. Another way I approach investing is, is the company executing competently or not. I tend to think AT&T is not, and looking at their poor roll out of HBO Max I think I’m correct. Which is why I don’t hold any T.", "score": 2, "replies": [{"body": "When you talk about competency is this insight you have built over the years? And these long trends that play out, can you give me an example? Correction in market? Elections? Covid related loss of revenue in industries like uber or something?", "score": 1, "replies": [{"body": "In the end, it's my judgement of whether the company is executing competently or not. A big red flag is doing buybacks when they should be strengthening their core business (GE) or making bad mergers or purchases so the president can prove he has a longer Johnson than the previous president (I'd say Direct TV fits that bill).", "score": 2, "replies": []}]}]}]}, {"body": "Started investing in march at the crash. Been “learning” about the market for the past 4-5 years. 6-7 months into investing i’ve learned more by actually participating in the market. Thats whats changed. I got in and got my feet wet. Current portfolio $13k $TSLA $FB $SQ $SPG", "score": 2, "replies": [{"body": "Those sound great. Remember that your overall savings rate is very important. If you can manage to save/invest 15% of your Salary every year, you will be a millionaire very easily.", "score": 2, "replies": [{"body": "Indeed, thinking about it gives me quite the head high lol", "score": 1, "replies": [{"body": "Yeah, basically investing is all about the dopamine rush you get when you do something right, versus the gut punch you receive when you were down $60,000 in one day, as I was the other day. I am old, and have been doing this a while. You need to manage your reaction to these two extremes, for the best outcome.", "score": 2, "replies": [{"body": "Thank you for the advice! It is indeed hard to control ones emotions in, especially when the markets flips and lands on its back haha", "score": 2, "replies": [{"body": "Try to come up with rules for yourself like, never sell when things are crashing. Or have a thesis that you can defend for buying or selling. Maybe bounce them off a friend who knows stocks (or some of us here). \n\nActualy I should get on the /r/stocks discord for that.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "hell yeah I got out of the UK funds and went USA and Asia funds with an emphasis on tech. I had sold all my stocks and went funds only in 2019. I rebalanced the portfolio in January 2020 right before the crash and looking back I was so glad I did that. I saw the power of buying the dip in March and also rebalancing again in April.\n\nDon't panic sell, know what you are invested in and where in the world you are invested is  now very important to me.\n\nThis has been my best ever investing year so far with a 30% return, when I was only looking for 10%. The funds only approach saves me a lot of time researching and allows me to sleep very comfortably at night.", "score": 2, "replies": [{"body": "Are you from the UK? I ask because you mentioned UK funds. It is so bloody hard to get away from home country by us, I’m in American living in Japan, but I invest mostly in American domiciled funds.", "score": 1, "replies": [{"body": "Yes I'm in the UK but the market in the UK has been poor for more than a decade. I pulled my money out in 2019 mainly due to Brexit and decided to go fully global jan 2020. If I was still 100% invested in the UK I'd be crying tears at night as the UK FTSE  is still down 20% since March. The UK has the worst performing stock market over the past decade and it's not going to get any better anytime soon, so stay well away funds wise. I can't speak for individual stocks as I no longer hold them. \n\nMy regional holdings are 10% UK, USA 55% & Asia 25% and I have no intention of changing that over the next 5 - 10 years. The USA & Asia is where the action is as I have a couple of tech funds as well. As Buffett said don't bet against the USA and I won't.", "score": 2, "replies": [{"body": "I live in Japan but wouldn’t trust myself to pick Japanese stocks. Happy to stick with iShares funds or individual companies I can get a sense of.", "score": 1, "replies": [{"body": "I stick with what I know and therefore I won’t invest in Japan. I have a Baillie Gifford Pacific fund which excludes it and has given me 40% so far this year.", "score": 2, "replies": [{"body": "Japan is basically Value Trap Central. I say that and I love the place.", "score": 2, "replies": [{"body": "Unfortunately the U.K. is heading the same way in fact it may already be there.", "score": 2, "replies": [{"body": "Can’t argue again what I don’t know. I do love the UK (am half British, my father hailing from Chipping Camden) and wish everyone the best.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "That's a lovely chart you got there.", "score": 1, "replies": [{"body": "It’s kind of over the top and things I add to the chart, but I like having the information in one place.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I always kick myself for not buying the “funding secured” dip. Even $10,000 just to participate in whatever was going to happen.", "score": 1, "replies": []}, {"body": "At least try to sell covered calls", "score": 1, "replies": [{"body": "Do you know of any easy guide to learn to do that? I don't want to get into options and stuff as it's not for me but I think I should learn about them before giving up.", "score": 1, "replies": [{"body": "[https://www.youtube.com/watch?v=1gXlr18gWSY](https://www.youtube.com/watch?v=1gXlr18gWSY)", "score": 1, "replies": [{"body": "Thanks will check it out!", "score": 1, "replies": []}]}]}]}]}, {"body": "1) I learned the importance of always having cash available because opportunity cost won’t give you a head up \n\n2) I’ve learned that stock price crash can be your best friends and not always an enemy \n\n3) I’ve learned that there is a thing called option trading which could have gotten me more money than just stocks", "score": 1, "replies": [{"body": "Nice. Yes, this year I happen to have cash on hand throughout the crisis, and it was a really good emotional buffer, and I was able to take some good opportunities. I actually have the ridiculously good luck with selling a business in March, which helped.", "score": 1, "replies": []}]}, {"body": "I actually started being an investor this year in January. Late to the party and it's not much but I'm happy about being up 17% of my portfolio so far.", "score": 1, "replies": [{"body": "Best of luck! Remember to learn as you go and be humble, and when you get some big win realize it's not your genius but mostly dumb luck. The best thing you can do is save and invest a lot, if you put away 10-15% of your income regularly you will basically have a million dollars for retirement (or more).", "score": 1, "replies": [{"body": "Thanks, best of luck to you too!", "score": 1, "replies": []}]}]}, {"body": "Started investing a lot more money when shit hit the fan in March knowing how this admin loves the stock market and wouldn’t let it fail. \n\nBest decision made this year", "score": 1, "replies": [{"body": "LOL, Trump as Admin? But yes, when things have already fallen there is more upside.", "score": 2, "replies": []}]}, {"body": "Yeah, this year has been wild...\n\nOverall:\n1. Switched from index funds to self stock picking (time will tell how this pans out)\n2. Dipped my toes into options and realized i need more research/better strategy so i can sleep at night.\n3. Switched my mind from 'look for flip opportunities' into 'invest in what you believe in'\n\nExplanation:\n\n1 - The corona crash made us experience a similar event to the past crashes but on steroids (record on crashing velocity, record on recovery velocity) which i felt was quite a learning experience. Also i was not worried at all when seeing my investments in the red, which made me realize that i could handle the risk psychologically (very important!). Also as someone that has become a lot more hands on, you can see in real time this tech shift unfold and with index funds you miss out on this growth opportunity until the market stabilizes.\n\n2 - Tried options and could not focus on anything at all anymore (couldn't stop watching my stocks app). It really made me realize that unless you have a plan you are going to lose, because options - unlike going long - is a mental game, even if you are right, if you cannot stomach the sudden price variations you lose (which is what happened to me, even tough if i held i could have made quite some money).\n\n3 - My bet for the covid crash was BA (2 big to fail, will recover nicely after the 737 is back online, etc...). We all know how that turned out so far 🤡. I invested for a quick flip and i don't even like the company. At first it rallied quite well, but eventually it lost a lot of steam. I have now sold it, and even tough i made a profit, i really missed out on other much better opportunities. It also made me super uneasy every time i read an article on how the recertification process was delayed / vaccine issues / more plane issues. This was a completely different experience with my Apple stock holding, which i believe in firmly and variations didn't worry me at all (i got in before the crash).\n\nAll in all i don't recommend people to follow my path (especially the dropping index funds part), but i hope someone can learn a bit from my experience.", "score": 1, "replies": [{"body": "Best of luck to you! I follow Joseph Carlson and he owns some of BA I think, and a lot of JPM for the same reasons. But financials just can’t seem to get any mojo going. I love the paradigm of trend following and getting in while the trend is up, then (unlike me before) actually getting out at set specific times (when the trend goes down, especially a stock crossing a 50 day MA for example. I think of those lines as the lines beside the road, and as you’re going around a corner you obviously don’t want to be crossing the line and going off the road. Just stay on the right side of the lines, forever...", "score": 2, "replies": []}]}, {"body": "Well I started with some money", "score": 1, "replies": [{"body": "Oops! I did okay in the end holding tight. I was in tech and just sat there, and came out okay. Still trying to extract my crappy DAL position. “Buy Delta, they said. It’ll be fun, they said.”", "score": 1, "replies": []}]}, {"body": "I learned I'm smarter than the market.", "score": 1, "replies": [{"body": "Really? That’s amazing! I’m smarter than the market to, but usually in very short and unpredictable time spans.", "score": 1, "replies": []}]}, {"body": "Just started investing\n\nPut 0.5 million $ which is all I own into AT&T\n\nAfter 5 years if the move pays off a better result than holding all that cash in savings I'm all good\n\nnot gonna be greedy\n\nmaybe 20 years later I will regret why the F didn't I put that into TSLA, maybe...", "score": 1, "replies": [{"body": "As in, $500,000? \n\nHere's the chart for T. [https://imgur.com/a/OOTxtJG](https://imgur.com/a/OOTxtJG)\n\nI know nothing, and nobody knows nothing, but I'd say T is not a rising trend but a falling one, which means it's harder to expect future profits. Everyone buys T for the dividend, which is high, but high for a reason. The actual money they pay per quarter stays the same or rises slowly (I think rises in their case), but the dividend yield being high is a result of the stock price being beaten down so much. \n\nI'd suggest a) diversifying into some other stocks and maybe considering something like HDV, which is a high-yield stock ETF with a broader base of stocks. And honestly, chasing high yield doesn't create the best outcomes IMO. There's a reason FB and GOOG and TSLA kick ass, and part of it is that they don't pay a yield but invest everything into themselves.", "score": 1, "replies": [{"body": "yeah thx for the advice\n\nI've done my research for about a month\n\nAT&T's dividend pay out ratio is like 50-60%, which means it is still far better in terms of security compared to other dividend kings/aristcrats like XOM or MO(who pays out like 70-90%). Yeah I know that this is a slowly dying bussiness but it is still an essential bussiness that has high demand in even Covid era. And most their properties are in infrastructure, and with a PER of less than 15 and PBR of close to 1, I still think this company has alot left in the tank.\n\nAnd in this age of FED basically throwing away free money, I just can't stand my savings to rot with the upcoming huge inflation.\n\nFor a month I've spent like at least 5 hours/day doing my studies and I still couldn't come up with a better plan. I don't trust growing stocks cuz I'm new to the game. As for value stocks I still can't find anything better than AT&T. Well who cares, I will just hold on it until the FED start raising interest rates which probably wont happen before 2024-5, if I end up with more money than putting all that into savings, I'm good. And the odds of that happening, to me I feel like is 99%+.", "score": 2, "replies": [{"body": "Best of luck!", "score": 1, "replies": []}]}]}]}]}
{"title": "TSLA", "selftext": "", "id": "issrm4", "created_utc": 1600113694.0, "score": 506, "upvote_ratio": 0.93, "num_comments": 77, "comments": [{"body": "Why does Tsla have such retard strength", "score": 96, "replies": [{"body": "TSLA fans are retards", "score": 31, "replies": [{"body": "Retards to the moon 🚀", "score": 11, "replies": []}]}, {"body": "Their only major competitor is under investigation for Frawd. Why shoudnlt Tesla be worth more than every other car company?", "score": 9, "replies": [{"body": "Because its P/E ratio is over 1,000", "score": 5, "replies": [{"body": "Sir, this is a casino. Please leave your fundamentals at the door.", "score": 9, "replies": []}, {"body": "The fuck is a PE ratio", "score": 1, "replies": [{"body": "You belong here", "score": 1, "replies": []}]}]}, {"body": "The iPhone of cars. Odds are Tesla remains only an NA thing in 30 years", "score": 2, "replies": [{"body": "I've been to norway and 3 out of 10 cars were teslas.", "score": 2, "replies": []}, {"body": "Yes we all know how unpopular iphones are in China. Must be why Tesla built their second factory there.", "score": 2, "replies": []}]}]}, {"body": "Tech bros love Elon, and they have the money to buy both TSLA and Teslas.", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 103, "replies": [{"body": "https://i.imgur.com/mRBmsBu.jpg", "score": 33, "replies": [{"body": "Weird. Mine, taken at the same time says Today's volume 80,498,762\n\nedit: [https://i.imgur.com/7OxUcFX.jpeg](https://i.imgur.com/7OxUcFX.jpeg)", "score": 2, "replies": []}, {"body": "I can't believe this has happened twice in my life time.", "score": 2, "replies": []}]}, {"body": "fakeout makeout, i’m eatingout", "score": 2, "replies": [{"body": "Perfect opportunity to say “I’m eating takeout” instead", "score": 2, "replies": [{"body": "i fuked up", "score": 1, "replies": []}]}]}, {"body": "Victory tendies in the micro. Tesla to the Moon!", "score": 2, "replies": []}]}, {"body": "Tesla to 500 before battery day or I'll face fuck a cactus.", "score": 54, "replies": [{"body": "Deepthroat it instead and you’re on", "score": 24, "replies": []}, {"body": "Ban until deliver", "score": 16, "replies": [{"body": "Deliver until ban", "score": 4, "replies": [{"body": "until ban, deliver", "score": 3, "replies": []}]}, {"body": "Deliver ban until", "score": 3, "replies": []}]}]}, {"body": "Damn it, i tried posting the exact same thing but you beat me by 2 mins and i guess my title was too long n got rejected 🤦‍♂️ good game", "score": 21, "replies": [{"body": "same lol", "score": 0, "replies": [{"body": "nobody cares rookies, either you first or you last", "score": 13, "replies": []}]}]}, {"body": "Nice.", "score": 18, "replies": [{"body": "Nice", "score": 7, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Nice", "score": 6, "replies": [{"body": ">Nice", "score": 5, "replies": [{"body": "nice", "score": 5, "replies": [{"body": "nice", "score": 5, "replies": [{"body": "Bikes", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Nice.", "score": -4, "replies": [{"body": "Noice.", "score": 1, "replies": []}]}]}, {"body": "Im so pissed I didnt buy the dip.", "score": 10, "replies": [{"body": "You still have time, i was so naive I bought early at the first dip at 448 USD. It’s only going up now and battery day is coming soon.", "score": 1, "replies": [{"body": "of course, just woulda made bank if I had bought in at $330. plan on buying the next dip. Wasn't aware battery day was coming soon. Good looks.", "score": 1, "replies": []}]}, {"body": "If you think it’s gonna go up it’s always dipping", "score": 1, "replies": []}]}, {"body": "I think Musk said he was taking TSLA private at 420 with funding secured.\nWatch out", "score": 5, "replies": [{"body": "????", "score": 1, "replies": []}]}, {"body": "Lol I was waiting for this moment", "score": 10, "replies": []}, {"body": "In Musk we Trust", "score": 8, "replies": []}, {"body": "TSLA closed at 420.69 today", "score": 5, "replies": []}, {"body": "I just sold a covered call for 420 9/18 this morning for $500 when Tesla was in the $374 range.\n\nI hope I don’t get crushed too hard", "score": 8, "replies": [{"body": "This aged well!", "score": 4, "replies": [{"body": "If it keeps it up at this rate it’s going to hurt.\n\nAnything exercised over $425 means I left money on the table, but on the last dip I was able to average down to $395 so it’s still $2,500 plus three weekly premiums (just started doing 1 per week)\n\nMy biggest fear is a rally this week which means I either have to buy back in at a higher price to keep selling weeklies or just hope the price comes down again.", "score": 2, "replies": [{"body": "You got any recommendations where I can learn about the terminology and other tips? Just getting my feet wet and want to be more familiar with the waters. \n\nCheers.", "score": 0, "replies": [{"body": "Mostly google.\nI’ve spent everyday on this retarded sub since I started trading in March.\nI watched YouTube videos and read articles.\n\nAfter I learned a few terms things actually got more confusing because I couldn’t tell when people are being sarcastic or serious in this sub.\n\nI took a month break in June after my account had peaked ATH then it all just went poof on June 8-10.", "score": 2, "replies": []}]}]}]}]}, {"body": "696 soon", "score": 7, "replies": []}, {"body": "TSLA - Also known as Elon's constant = 420.69", "score": 3, "replies": []}, {"body": "The prophecy has been fulfilled 😂", "score": 6, "replies": []}, {"body": "Nooice", "score": 2, "replies": []}, {"body": "What a FOMO Porn", "score": 2, "replies": []}, {"body": "Nice", "score": 2, "replies": []}, {"body": "Blaze it", "score": 2, "replies": []}, {"body": "Funding Secured!!", "score": 2, "replies": []}, {"body": "I can’t see anything, I’m blinded", "score": 1, "replies": []}, {"body": "funding secured", "score": 1, "replies": []}, {"body": "Position or Ban?", "score": 1, "replies": []}, {"body": "420.69c 9/18 fuckers", "score": 1, "replies": []}, {"body": "This shit is out of control. Robin Hood and his merry men at work...clueless clueless pricks.", "score": 1, "replies": []}, {"body": "Don’t yell at me.", "score": 1, "replies": []}, {"body": "420.69 \n\n😉 \n\nhttps://imgur.com/gallery/JZPq3S0\n\n2020.09.14_1305pst", "score": 1, "replies": [{"body": "Nice. The prophecy is fulfilled.", "score": 2, "replies": []}]}, {"body": "I got the $420.69 screenshot 🙌🏼😂", "score": 1, "replies": [{"body": "PROVE IT!!! \n\nWe need to see if the prophecy is true..", "score": 2, "replies": [{"body": "420.69 2020.09.14_1305pst https://imgur.com/gallery/JZPq3S0", "score": 3, "replies": [{"body": "Thanks bro\n I'm retarded and don't understand imgur apparently", "score": 1, "replies": []}]}]}]}, {"body": "Yeah I saw this too and was going to post a screenshot but you beat me to it! lol!", "score": 0, "replies": []}, {"body": "Battery day in 1 week - riding the hype train yolo. $420 c 9/25.", "score": 0, "replies": []}, {"body": "Didn’t even post your position please ban this faggot ASAP!", "score": -2, "replies": [{"body": "1 share of TSLA", "score": 3, "replies": [{"body": "Probably .0001% of a share", "score": 4, "replies": []}]}]}]}
{"title": "If apple hits 125 I’ll buy every apple at Dierbergs and Schnucks nearby", "selftext": "[deleted]", "id": "isu8ue", "created_utc": 1600117866.0, "score": 207, "upvote_ratio": 0.94, "num_comments": 71, "comments": [{"body": "If apple hits 140 end of month, I’ll donate $69 to 5 charities.", "score": 134, "replies": [{"body": "I’ll do it with you", "score": 48, "replies": [{"body": "Sounds good!", "score": 9, "replies": []}]}, {"body": "Do it for the koalas!", "score": 7, "replies": [{"body": "Koalas are fucking horrible animals. They have one of the smallest brain to body ratios of any mammal, additionally - their brains are smooth. A brain is folded to increase the surface area for neurons. If you present a koala with leaves plucked from a branch, laid on a flat surface, the koala will not recognise it as food. They are too thick to adapt their feeding behaviour to cope with change. In a room full of potential food, they can literally starve to death. This is not the token of an animal that is winning at life. Speaking of stupidity and food, one of the likely reasons for their primitive brains is the fact that additionally to being poisonous, eucalyptus leaves (the only thing they eat) have almost no nutritional value. They can't afford the extra energy to think, they sleep more than 80% of their fucking lives. When they are awake all they do is eat, shit and occasionally scream like fucking satan. Because eucalyptus leaves hold such little nutritional value, koalas have to ferment the leaves in their guts for days on end. Unlike their brains, they have the largest hind gut to body ratio of any mammal. Many herbivorous mammals have adaptations to cope with harsh plant life taking its toll on their teeth, rodents for instance have teeth that never stop growing, some animals only have teeth on their lower jaw, grinding plant matter on bony plates in the tops of their mouths, others have enlarged molars that distribute the wear and break down plant matter more efficiently... Koalas are no exception, when their teeth erode down to nothing, they resolve the situation by starving to death, because they're fucking terrible animals. Being mammals, koalas raise their joeys on milk (admittedly, one of the lowest milk yields to body ratio... There's a trend here). When the young joey needs to transition from rich, nourishing substances like milk, to eucalyptus (a plant that seems to be making it abundantly clear that it doesn't want to be eaten), it finds it does not have the necessary gut flora to digest the leaves. To remedy this, the young joey begins nuzzling its mother's anus until she leaks a little diarrhoea (actually fecal pap, slightly less digested), which he then proceeds to slurp on. This partially digested plant matter gives him just what he needs to start developing his digestive system. Of course, he may not even have needed to bother nuzzling his mother. She may have been suffering from incontinence. Why? Because koalas are riddled with chlamydia. In some areas the infection rate is 80% or higher. This statistic isn't helped by the fact that one of the few other activities koalas will spend their precious energy on is rape. Despite being seasonal breeders, males seem to either not know or care, and will simply overpower a female regardless of whether she is ovulating. If she fights back, he may drag them both out of the tree, which brings us full circle back to the brain: Koalas have a higher than average quantity of cerebrospinal fluid in their brains. This is to protect their brains from injury... should they fall from a tree. An animal so thick it has its own little built in special ed helmet. I fucking hate them.\n\nTldr; Koalas are stupid, leaky, STI riddled sex offenders. But, hey. They look cute. If you ignore the terrifying snake eyes and terrifying feet.", "score": 22, "replies": [{"body": "But they r cute :(", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "You could say the same thing about your favorite instagram model... now a days dumb shit that’s cute, we keep alive.", "score": 2, "replies": []}]}, {"body": "Is this true", "score": 1, "replies": []}]}]}, {"body": "You could donate $4.20 to 69 charities instead", "score": 6, "replies": [{"body": "Too much work.", "score": 2, "replies": []}]}, {"body": "$69 total, or to each?", "score": 3, "replies": [{"body": "69 to each. I’ll make sure it equals to 420 in the end.", "score": 4, "replies": [{"body": "69 * 5 = 420 can confirm this checks out", "score": 8, "replies": [{"body": "If you donate $6.10 to one charity, $6.09 to 46 charities each, and $6.08 to 22 charities each, that comes out to $420 total to 69 charities.", "score": 2, "replies": []}]}]}]}, {"body": "69th upvote routing for you mofos!!", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Donate it to Carol F’in Baskin, I hear she needs to buy a new meat grinder", "score": 2, "replies": []}]}, {"body": "mods do yo thang", "score": 1, "replies": []}, {"body": "Just saying, single larger donations tend to have much greater proportional impacts than several smaller ones.", "score": 1, "replies": [{"body": "Apparently for a dollar a day I can sponsor a child.. so 69 seems good to me", "score": 8, "replies": [{"body": "Oh for sure it’ll help! I’m not trying to detract from what you’re doing, that’s awesome. Just it’d most likely be more beneficial to give it all to one charity vs a bunch of small ones to multiple", "score": 1, "replies": [{"body": "Tell ya what. If apple hits $140 end of month, I’ll donate $69 x 4.20 to a charity of your choice and $69 to 4 other charities.", "score": 6, "replies": []}]}]}]}]}, {"body": "The fuck is Dierbergs and whatever", "score": 16, "replies": [{"body": "Grocery store for commies", "score": 7, "replies": [{"body": "What makes it for commies lmao", "score": 1, "replies": []}]}, {"body": "Grocery store!", "score": 1, "replies": []}]}, {"body": "You must be in my area, those are mostly St. Louis grocers.", "score": 33, "replies": [{"body": "Yup", "score": 17, "replies": []}, {"body": "STL in da house!", "score": 14, "replies": []}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "Havanese!", "score": 15, "replies": [{"body": "I also have a havanese, they’re truly the best dogs!", "score": 6, "replies": [{"body": "Agreed he agreed to help me convince Tim Apple to release 10 new iPhones because who can say no to that face", "score": 3, "replies": [{"body": "Forever pup", "score": 2, "replies": []}]}]}, {"body": "Damn. Post some pics", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "I’ll do it too bro", "score": 3, "replies": []}, {"body": "Fuck it, I'll match that number. Let's get the good old fashion love & care back into the game", "score": 2, "replies": []}]}, {"body": "If Apple hits $125 eow I stand by sucking everyone's dick in my last post", "score": 13, "replies": [{"body": "Scoutmaster kevin?", "score": 6, "replies": []}, {"body": "Not falling for this one again", "score": 3, "replies": []}]}, {"body": "You live in STL??? Lol what it do durrty", "score": 11, "replies": []}, {"body": "STL represent", "score": 9, "replies": []}, {"body": "At a dwhat and who?", "score": 7, "replies": [{"body": "Haha they’re grocery stores in the Midwest", "score": 5, "replies": [{"body": "almost entirely limited to stl and a couple off shot remote ones. hence the confusion.", "score": 1, "replies": []}]}]}, {"body": "What are you holding?", "score": 2, "replies": []}, {"body": "It will hit 125 tomorrow. Rip 9-18 120c", "score": 2, "replies": []}, {"body": "> Abstain from sex  \n\nIt’s cheating if you already do it", "score": 2, "replies": [{"body": "Oops", "score": 2, "replies": []}, {"body": "Or rather, don't do it", "score": 1, "replies": []}]}, {"body": "Mods", "score": 3, "replies": []}, {"body": "Position or ban", "score": 2, "replies": [{"body": "Oh sorry, I have 400 9/18 120c, 180 9/18 115c, 80 11/20 115c and like 50ish 2022 200 calls", "score": 10, "replies": [{"body": "Wow is that a YOLO for you? Wish I had that big of balls!", "score": 7, "replies": [{"body": "Haha it sort of is, like in my opinion Apple yolos aren’t as uh Yolo as like Tesla just because they usually don’t ever go to shit (it’s more like a slow bleed) but they do see a lot of upside sometimes", "score": 7, "replies": [{"body": "Umm tell that to anyone who had AAPL calls dated for the last 2 weeks.", "score": 5, "replies": [{"body": "Lmao that’s my point, it was a slow bleed down so any given day you’d only be down Idk 20% instead of the whole position", "score": 1, "replies": [{"body": "My 130 calls for October lost 50% value in 2 days, I dunno where your getting the \"slow bleed\" thing from. Hoping for a miracle today so I can get out without insane losses.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Friday and some more at ~114.2 today, I sold some November and October calls and moved the money over basically", "score": 1, "replies": []}]}, {"body": "The 120 weekly calls are at 130,000 volume really cheap @ 1.15", "score": 1, "replies": []}]}]}, {"body": "My 10/2 118.75 calls agree with you. I used to be a gay bear, but I'm trying to learn to be bi-curious. The only thing I'm worried about swinging both ways is when I only swing one way, I only had to worry about being wrong one way. Now I can be wrong both ways 😅", "score": 1, "replies": [{"body": "I have same position. I think they print", "score": 1, "replies": [{"body": "Best of luck to us both lol", "score": 1, "replies": []}]}]}, {"body": "If AAPL hits 150 EOW, i will eat a BANANA.", "score": 1, "replies": []}, {"body": "It fucking will.", "score": 1, "replies": []}, {"body": "and suck your wife's bf big d", "score": 1, "replies": [{"body": "At least then I’d be married :(", "score": 1, "replies": []}]}, {"body": "Need this thing to fucking pump tomorrow", "score": 1, "replies": []}, {"body": "Fuck you\n\nFuck AAPL\n\nNo one follows you on IG\n\nYou weren't getting laid anyway\n\nThe markets don't even jerk off to you let alone fuck you\n\nStop trying to pump CHWY", "score": 1, "replies": []}, {"body": "A fellow STL retard!", "score": 1, "replies": []}, {"body": "What a commitment.", "score": 1, "replies": []}, {"body": "This will happen ez", "score": 1, "replies": []}, {"body": "Abstain from sex, like this virgin retard had any to begin with", "score": 1, "replies": []}]}
