{"title": "AMD comeback? Time for a long term look.", "selftext": "Looks like Google announced a partnership with AMD for their deep learning gizmos. What do you all think? Is this the AMD comeback? How could this fair in the long term?", "id": "5da2cd", "created_utc": 1479313361.0, "score": 21, "upvote_ratio": 0.78, "num_comments": 28, "comments": [{"body": "AMD has given itself a unique position in the market. I think it’s time we stop comparing AMD to NVDA or INTC. This company has momentum.", "score": 4, "replies": []}, {"body": "And I sold yesterday...", "score": 2, "replies": [{"body": "I'm with you man... sold nearly 500 shares of NVDA on Monday :/\n\nIt was the right decision for me based off of my risk tolerance and the available information so I'm not upset about it... but damn...", "score": 2, "replies": [{"body": "No way? I almost sold too but I got tied up with work, was probably the greatest thing to happen at my job since I started. I hope the opportunity cost wasn't huge for you", "score": 1, "replies": [{"body": "Well, my position would be worth about $11,000 more today than it was when I sold (47k vs 36k)...\n\nI'm just looking to buy a house in the next few months, so I liquidated ~200k in my more risky positions before the election to set aside toward the down payment. \n\nNVDA had a $72 resistance for quite some time and if it wasn't for them unexpectedly crushing earnings, it could have much easier gone the other way like other tech stocks did. \n\nLike I said.. right decision based on the information and risk tolerance I had, but hindsight :)", "score": 2, "replies": [{"body": "Ya very true congrats on the house by the way, always a good time those down payments", "score": 2, "replies": []}]}]}]}, {"body": "Sold today and took my profits.. i think it goes back under 7  by end of the month and ill get back in", "score": 1, "replies": []}]}, {"body": "Where's a source for this?", "score": 2, "replies": [{"body": "https://finance.yahoo.com/news/amd-radeon-technology-available-google-200000546.html\n", "score": 3, "replies": []}]}, {"body": " I sold 1/2 at 7.65. I expect a very small buyback window tomorrow either PM or before 10:00. ", "score": 2, "replies": []}, {"body": "@ 12pm central on a 2 hour chart it looks like a doji candlestick is forming at a previous high from 10-28, stochastic RSI is also overbought so it looks like it has hit resistance and will reverse. A 4 hour chart also looks like it is finishing the C-D leg of a bearish bat cypher pattern which would also support a reversal. A daily chart shows wave 5 of an Elliot wave completing on 8-19 with the correction following, and it may be continuing up but that is not yet confirmed as the movement it still more sideways In my opinion and it may start to move down for that matter. The charts are inconclusive at this point but that's my two cents for the immediate condition.\n\nIf you were in before today I would take your profits and re-buy after it falls as long as it still looks favorable, and if you are not already in I would not buy until after it falls.", "score": 5, "replies": [{"body": "....and this nonsense was wrong.", "score": 6, "replies": [{"body": "you didn't even wait a day yet... ", "score": 1, "replies": []}]}, {"body": "/u/13_Regardless As a follow up, this has now established that it is most likely going to resume its uptrend after its consolidation period after 8/19. It has smashed through 3 previous points of resistance, but currently it is just too overbought to enter right now. Hourly is way overbought, daily still has a bit of room, not to mention this was a news triggered event. This leg of the upswing is most likely nearing its end. I would look for a 50% retracement as your entry point. ", "score": 1, "replies": [{"body": "Completely understand a lot of sites I had checked up on are looking at it dipping as well, which is what I'm banking for to buy in at a lower price", "score": 1, "replies": [{"body": "Could have entered yesterday and sold today to lock in a good chunk of money, but it really was not well established that it was entering another uptrend at that time. Hindsight is 20/20 as they say. You can be happy you didn't enter and lose though.", "score": 2, "replies": []}]}]}]}, {"body": "AMD from 2 to 7.5 this year.  I would say it's already come back.  I mean, it might still go higher, but it's a little late to predict a \"comeback\" I think.", "score": 1, "replies": [{"body": "That's a fair statement, what would your thoughts be regarding a long term investment with them?\n\n", "score": 1, "replies": [{"body": "I'm not sure, I haven't researched it enough to comment, sorry.", "score": 1, "replies": []}]}]}, {"body": "Wondering the same thing regards to long term...I'm not even sure I should exit and wait for dips before 8 anymore...might be worth just to leave it in :/.\n\nAnyone think this'll break 8 before earnings in January and go to double digits next year?", "score": 1, "replies": [{"body": "Thats my thought too\n\nI'm all for making a profit but if its supposed to dip then gain traction i'll just hold it ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "agreed, just wasn't sure how much. If it dips to 7.55-6 probably isn't even worth leaving and rebuying IF it goes above $10 in 2017 like I anticipate (hopefully lol).\n\nI'll definitely be rebuying in...i've made my money from $SINO and I'm too scared to go back into those shipping stocks and ready for some value investing XD", "score": 2, "replies": []}, {"body": "which will be a sweet time to go back in!!", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}, {"body": "Yeah might dip to $7.50 or so but I'm holding for the long term. Would love to seem solid double digits out out it next quarter. ", "score": 1, "replies": []}]}, {"body": "It's great that AMD moves up again. Now I know that it's worth to keep it long.", "score": 1, "replies": []}, {"body": "To the moon? ", "score": 1, "replies": [{"body": "I wouldn't call it a moon shot yet but its looking really good!\n\nEdit: They still think it might dip a smidgen ", "score": 1, "replies": []}]}, {"body": "Judging by how much its climbed today... im enjoying the ride", "score": 1, "replies": []}]}
{"title": "Still a good time to purchase NVDA stock?", "selftext": "I was wondering if it would still be a good time to purchase some of this stock? It increased nearly 40% over the past month and I'm not sure if it will continue to increase so drastically or if people will start selling and the price will drop drastically. Any input would be much appreciated, thanks r/stocks", "id": "5da4w6", "created_utc": 1479314102.0, "score": 27, "upvote_ratio": 0.77, "num_comments": 39, "comments": [{"body": "Disclaimer: this is my opinion and I've held nvidia on and off for months.\n\nI'd say if you're going long and going to hold for over a year then there is plenty of room for growth and nvidia seems be aggressively moving into the AI area that is growing extremely rapidly which is a great move IMO. \n\nShort term is a bit more difficult. Its expanded very quickly which can sometime lead to a contraction just because short sellers will see it as over expansion (which may be right). I have it but I am extremely careful with my stop losses and don't mean to hold too long as I feel like the probability of a contraction is high in the coming weeks.\n\nGood luck! Hope this helps!", "score": 16, "replies": [{"body": "I've been doing the same as you and have been equally as wary of a serious pullback in the next month or two. Just curious, what would you suggest as a stop loss? I currently have mine at $80.", "score": 2, "replies": [{"body": "Considering its trading at 90+ rn and I'm currently in it for a real short term gain I expected when the tech market bounced, I am setting mine at 88-89. But I want to sell quickly personally. The risk of a pullback in nvidia and tech in general has me looking into other industries like banking at the moment.", "score": 2, "replies": [{"body": "Interesting, I think I may raise my stop loss higher then. I think it's an excellent long-term investment, but I'm trying to raise a specific amount of money in a shorter time frame. Would hate all that yield to just disappear.", "score": 1, "replies": []}]}]}, {"body": "I'm in the same boat, as I've made 3.5x returns off of NVDA.  My predicament though is I bought in spring of this year and I would love to hit that long-term position(1year) mark for the tax break, 15% off to pay in taxes for my gains.  I would love to sell if it starts to move down and run with my gains but I don't want to pay the short-term position taxes on it.  Make sense?  Thoughts?\n", "score": 1, "replies": [{"body": "That's a tough decision. If I were you I'd probably run . The bid size for put options is crazy high, relative to that of call options. Also, NVDA's inventory and accounts receivable and revenue increased in dramatic fashion. The inventory increase can mean that NVDA is preparing for even more sales. What is very alarming is that while NVDA's revenue have increased $328 million since January, accounts receivables increased $139 million. That's rough. NVDA is probably extending credit to sell more, but even with this ginormous amount of a/r, inventory is still high. I'd sell.  But people are irrational and the company seems to be amazing in the long run. ", "score": 1, "replies": []}, {"body": "I wouldn't let taxes drive your decision.  You're going to pay tax no matter what.  Better to judge it on it's prospects.", "score": 0, "replies": [{"body": "Nah dude if he sells before a years up, it's taxed as if it were ordinary income. So if you're sitting at the 25%  tax bracket, then your gains will be taxed at 25%. But, if you keep your stock for longer than a year, then this is a capital gain and thus is taxed at 15%. A 10% difference is huge. ", "score": 1, "replies": [{"body": "Could also bump him into another tax bracket and punish additional income / short term stock sales", "score": 1, "replies": []}, {"body": "I'm just saying letting tax rate dictate your investment decision is generally a bad idea.  Unless your holding crap with a loss and you're giving up on it.", "score": 1, "replies": []}]}]}]}, {"body": "For thr long term play, you think nvidia is gonna go past the hundreds?", "score": 1, "replies": [{"body": "It's going to reach 800. Call me crazy but look at all tech using Nvidia Gpus.", "score": 1, "replies": [{"body": "That  is already incorporated into the price of the stock. Only new projects and/or unexpected good news can push the stock higher. Everybody knows NVDA is everywhere.", "score": 2, "replies": [{"body": "So you think 90-100 is the upper limit of nvda? (Longterm i mean like say 3-5 years)    \n\nIm just worried to buy and hold at a huge price that im not really gonna get anything out of it in the long run.", "score": 1, "replies": []}]}]}]}]}, {"body": "I think this describes NVDA right now:\n\nhttps://www.youtube.com/watch?v=ygE01sOhzz0\n\nThe momentum is stunning; up 25% in a day after a great quarter and one would think that a pullback (even if you're bullish) is healthy. Well, there were maybe a couple of days and that was it. Today, the moment it passed  the prior 52 wk high (which was reached on the 25%+ day), it then started ramping again. \n\nIt seems to be having some difficulty around $92, but who knows. The momentum in this is ridiculous and pullbacks have been brief. There will be a more material correction in this at some point, but I can't tell you when - it may be today, it may be two weeks from now - or from what price. The FOMO (fear of missing out) is ridiculous with this, which is absolutely concerning short-term. Long-term, certainly positive.\n\nEdited to add: tried to break through $92 3 or 4 times. Breaks $92 and goes to nearly $92.50 in couple minutes. FOMO accelerating.\n\n", "score": 7, "replies": []}, {"body": "No, it's not a good time to purchase.  This stock is in a place right now where you just watch it.", "score": 5, "replies": []}, {"body": "I'd like to throw in here that I can not find a hole in NVDA's business.  They are truly firing on all cylinders, a nearly perfect machine.  The real question here is, what are your timelines?  If we're talking years, then absolutely buy it and don't hold back.  If you're looking to make month-month gains, wait for a dip, it's coming.", "score": 3, "replies": []}, {"body": "Heres what I see. \n\nNVDA is making a graphics card for the new Nintendo Switch console. \n\nNVDA is hyping the Switch console as being revolutionary, which is causing Nintendo stock to also go up (nearly 6 dollars up on the japanese market(690 yen) and up 40 cents on USA markets)\n\nSo when the Switch is released it should sell well, which will boost NYDOY/TYO:7974 stocks, but will also benefit NVDA since they provide the graphics cards to these consoles. \n\nI see Nintendo and NVDA going up easily for the next months until the Switch is released (March)", "score": 4, "replies": [{"body": "I can't put any faith into a Nintendo console release now. The Wii U was a flop. Not sure the Switch will appeal to that many more people. It's not going to be the original Wii.", "score": 8, "replies": []}, {"body": "NVDA's partnerships with Tesla and Google and such dwarf any Nintendo play", "score": 5, "replies": []}, {"body": "The switch is going to flop. Nvidia's real power play is Tesla.", "score": 1, "replies": []}, {"body": "Nintendo deal has nothing to do with it. If you think it does, you have not checked your assumption with a precedent at all. It makes no sense. Reddit just loves their video games though.\n", "score": 1, "replies": []}]}, {"body": "If you can get in under 87 Id buy other then that you're buying at the top. But I think it's a very solid stock overall and I've made some serious gains on it. As of right now im all in on NVDA and plan to keep this train moving. ", "score": 2, "replies": []}, {"body": "Wow, thanks for all the replies guys, I was expecting this to get buried. So judging from the comments I might purchase a few shares and hold on to them for a little bit. Thanks!", "score": 2, "replies": []}, {"body": "Don't buy high, although if you're long then I suppose you can argue that this isn't high compared to where you think it will be.", "score": 1, "replies": []}, {"body": "I was thinking about this when it was sub 30 (because of that I want to punch myself for not believing myself)", "score": 1, "replies": []}, {"body": "We covered it at stockAday earlier this week. Reasonable debate too. Hope that helps\n\nhttps://www.reddit.com/r/investing/comments/5czbqu/stockaday_the_virtual_merits_of_nvidia_nvda/", "score": 1, "replies": []}, {"body": "Excellent increase, without a doubt. But I think it's not something where you should spend your money. Just my advice. ", "score": 1, "replies": []}, {"body": "IDK, but someone just sold 1.4m shares at the closing bell.", "score": 1, "replies": []}, {"body": "Buy next week - I do 5 year holds when I invest but if the stock shoots up too fast I sell and then reinvest at next big downturn ", "score": 1, "replies": []}, {"body": "I got mine at 88 today.", "score": 1, "replies": []}, {"body": "Everytime I think it won't go higher it skyrockets another 20%. Get in now.", "score": 1, "replies": []}, {"body": "I got mine for 63$ and sold 70% of them for 83$.\nNow I'm waiting for it to go down to at least 75$ and will buy some more to hold them for at least 3 years.", "score": 1, "replies": []}, {"body": "People are getting sucked in because of CNBC , look at the PE , even with earning raise, way too pricey. The stock really getting ahead.", "score": 1, "replies": []}, {"body": "$NVDA valued almost double than $TSLA .... or nvidia is extremely priced or tesla is extremely cheap...", "score": 1, "replies": []}, {"body": "Can't believe I passed this for AMD when NVDA was under $20. AMD made a similar move eventually. Anyway, P/S is still pretty high. Could go up a little bit more, but P/S is a good measure of potential volatility in case of guidance revisions.", "score": 1, "replies": []}, {"body": "Bought a january $100 call , here's to NVDA ! \n\nIm thinking a santa rally would get this one over $100 in december.", "score": 1, "replies": []}, {"body": "I am asking myself the same question right now.", "score": 1, "replies": []}]}
{"title": "Thoughts on OCUL? DD inside", "selftext": "Ocular Therapeutix develops a sustained release platform for the delivery of eye medication. They are also currently seeking FDA approval for their anti-itch/anti-inflammatory medication to be used in conjunction with the platform for post-surgical patient eye care.\n\nPatient compliance is horrendously bad for eye drops (for a number of reasons) and this would eliminate that problem completely. The space is conservatively estimated to be worth 2-3x OCUL's current market cap (150m). Many have it much higher than this.\n\nAdditionally, Regeneron, a pharmaceutical giant in the ophthalmology space, recently entered into a deal with Ocular Therapeutix for the use of their platform. Upon reaching certain milestones with the clinical testing of Regeneron's drug, Ocular Therapeutix may receive two payments of 150m (one for each milestone). This, in addition to the 10m up front payment, would total 310m in cash for Ocular Therapeutix as well as royalties on Regeneron's drug once it makes it to market.\n\nThe recent political climate has caused a shift in the economic sectors, with biotech being the largest benefactor. The Trump administration plans on reducing the stringency of the requirements to gain FDA approval, something this drug had already nearly achieved. There were manufacturing issues which were addressed and it is up for reapplication late this year.\n\nSorry if it's not meme'd up enough, copy-pasted from when I wrote it for a friend. I'd like to hear why this shit will crash and burn instead of 10x", "id": "5da6cf", "created_utc": 1479314513.0, "score": 11, "upvote_ratio": 0.84, "num_comments": 30, "comments": [{"body": "No need for memes if we can make a solid bet. I'll be looking into this one.", "score": 7, "replies": [{"body": "Hit me up if you have any questions/ideas about it. Always down to share/discuss", "score": 2, "replies": []}]}, {"body": "i got in when it was in the mid 6s. Still bag holding and hoping it reaches 10.", "score": 4, "replies": [{"body": "Yeah, that's about my price point as well. Was originally looking at it as a short term thing but now that Trump won it's seeming more appealing long term", "score": 5, "replies": [{"body": "correct. It dipped like a mofo when Hillary was leading but after Trump won, the stock has been on a straight upward path. \n\nTarget price is still 30... so not sure if selling out at 10 is a good idea. lol", "score": 1, "replies": [{"body": "The way I'm looking at it is if it continues growing around 5-10% per day and I still think it's undervalued I'll hold. If there's a random, enormous spike without news I'm getting the hell out lol. Today is looking like a spike but not exactly sure", "score": 1, "replies": [{"body": "Looks like the $10 is possible this afternoon or tomorrow if continues. ", "score": 1, "replies": [{"body": "Annd it pulled back. Still buying more though.. Don't know why. Because I like them $.50 gains or maybe because I'll hold past $10 and see where it goes in the 3-6 month bagholding term I'll see when it gets to $10. ", "score": 2, "replies": [{"body": "I think if you're comfortable letting it sit for a while it's a really safe bet\n\nedit: as for the pullback, take a look at IBB and XBI. OCUL usually trends with these so today was a really big win considering how much those are down. If those are  up tomorrow morning there could be another breakout day for OCUL", "score": 1, "replies": []}]}]}, {"body": "How are you feeling about OCUL now?", "score": 1, "replies": [{"body": "I wouldn't buy in at this point unless you wanted to hold it for 2-6 months minimum.\n\nIt's feeling the pain from the rest of the sector and general market volatility, but is still a solid long term play. Not sure if anyone will care about resubmission to the FDA in this environment for an EOY jump.", "score": 1, "replies": [{"body": "im in at $11.30 hence me asking. :)", "score": 1, "replies": [{"body": "Oh baby, sorry to hear it haha. You going to need the money anytime soon?", "score": 1, "replies": [{"body": "nah. Just thought it might hit $13.00 soon after i bought it. :/ Im holding for now though. Mostly because im down $1000", "score": 1, "replies": [{"body": "Yeah just hold strong and look elsewhere. It's a virtual guarantee that it'll be well above where you bought it in a few months.\n\nI remember when the Regeneron deal was announced and people bought in at $7.80 or so they were really regretting it because it fell to $6.30 within a few days. Just the nature of this stock lol", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "How do you feel about OCUL now?", "score": 1, "replies": [{"body": "still ok. I just bought some more @8.70", "score": 1, "replies": []}]}]}]}]}, {"body": "Just to expand on what Ocul is trying to manufacture and sell. It's a hydrogel, drug eluding plug that is inserted into the tear duct and releases the drug over a specific period of time. After which, it is absorbed into the body. It's an out patient procedure to get it implanted, and is meant to be a one and done thing. \n\nThey have 3 candidates right now. Dextenza for ocular pain and inflammation, dry eyes and allergic conjunctivitis. Ocular pain is what will be resubmitted, ocular inflammation will be a supplementary application after pain is (assumingly) approved.\n\nAllergic conjunctivitis is on hold pending another retention trial. First phase 3 for AC was positive, but the second was not. They looked at the data and saw a statistical significant difference over the whole trial, but not at the points they measured. \n\nNot sure what dry eyes is doing, they haven't updated recently, but it was phase 2 last I heard.\n\nThe second is for glaucoma. It has statistically significant reduction in ocular pressure during the phase 2 trial, versus a placebo plug. One phase 3 is underway now, and another will start soon. results expect Q1 '18.\n\nThe Regeneron deal is for delivering Eylea through the plug. Eyelea is already FDA approved for treatment, now the question is can it be delivered through the plug. This is pre-clinical, and a while off, but still lucrative. Regeneron will fund all development past pre-clinical, along with milestone payments and royalty payments if commercialized.\n\nThe balance sheet it my only concern. If they get a 2 month review time on the re-submission, you're looking at February being approval. They have cash to run through Q4 '17, but as far as I know, they have only brought on a chief commercial officer, and have not built a sales force at all. I'm a little concerned at how quickly they can built one and get sales going, even enough sales to just push the cash burn out enough. All of this is exacerbated with a June approval.\n\nI'm in for  2000 shares at 6.63 in my retirement, and 1600 shares at 6.70, but my unlucky ass sold 16 November 7.50 covered calls on Thursday last week. Gotta figure out how to unwind that without losing a ton of possible gains.\n\nAll in all, I think this still has a lot of room to run. ", "score": 4, "replies": [{"body": "Great point about the lack of sales--never considered if their estimates for having enough cash through Q4 '17 include the cost of starting up a sales division.\n\nI'm thinking if approval goes through the company won't be allowed to fail, though. Worst case they take a disadvantageous agreement with a company that already has an established sales force within the space (Regeneron, most likely). If this were StockTwits the lack of sales force would just imply that they're already getting bought out haha.\n\nSorry to hear about those calls...", "score": 1, "replies": []}]}, {"body": "Also, I should mention, the short coverage of float is around 25% and institutional ownership is sitting around 70% (after a few reduced positions around the election). Fuel for the moonshot?", "score": 2, "replies": []}, {"body": "This is crazy after looking into it almost P&D gains with no dump (DD). ", "score": 2, "replies": []}, {"body": "Last time it came up most people wrote it off as a shit stock iirc", "score": 1, "replies": [{"body": "I remember seeing a thread like that haha, the dude was guaranteeing 200% returns or something. Short of a buyout (which I don't think will happen for a long time) this just seems like a steady grower until FDA approval.", "score": 2, "replies": []}]}, {"body": "This is run-of-the-mill speculation not YOLO.  \nWhat's their balance sheet look like? Make sure they're not at risk of imploding.  ", "score": 1, "replies": [{"body": "They beat pretty handily the morning after Trump won (I forget the specifics) and have around 73m cash on hand. Supposedly enough to take them into the end of next year if you take the CEO at his word", "score": 1, "replies": [{"body": "> if you take the CEO at his word\n\nI might trust hookers more.", "score": 1, "replies": []}]}]}, {"body": "What does DD stand for. I know it's like an analysis but what's the actual acronym? \n\nLol sorry for derailing your question. ", "score": 1, "replies": [{"body": "Np, stands for due diligence", "score": 2, "replies": []}]}, {"body": "Good call on this - wish I had gotten in but it's probably too late now.", "score": 1, "replies": [{"body": "Yeah, the risk/reward definitely isn't as appetizing anymore. That being said, I still expect $13 or $14 per share after they announce resubmission.\n\nSeems like a safe bet to me in an objective sense, but in the off chance you hop in after a 100% increase in share price then it gets fucked somehow you won't feel too good lol", "score": 1, "replies": []}]}]}
