{"title": "Selling deep ITM puts using margin", "selftext": "I used margin to buy 4500 shares of nvidia at $150.\n\nCan I sell deep ITM $200 calls to collect the premium? \n\nI know I’ll get exercised right away, but I should be ok since my margin purchase for the stocks is less than the strike of the calls….right? What am I missing?\n\nEdit: selling deep itm calls not puts", "id": "ywcocz", "created_utc": 1668553865.0, "score": 0, "upvote_ratio": 0.48, "num_comments": 34, "comments": [{"body": "1. $200 calls for NVDA trading at 166 is not deep in the money.\n2. Even if the calls were deep in the money, they would not be immediately assigned.\n3. As long as you have shares, you can sell covered calls (1 per 100 shares) against them.", "score": 13, "replies": [{"body": "4. Use leaps instead of 100 shares because it needs less money and gives out same premium", "score": 3, "replies": []}]}, {"body": "My dude, why are you trading options??? You’re going to get yourself in big trouble", "score": 26, "replies": [{"body": "I actually made a lot off of options and GME. I’m trying to regain some ground for tax purposes.", "score": -17, "replies": [{"body": "Well you aren’t making much sense. It doesn’t matter if you made money on GME, if you don’t know the implications of what you’re doing, you can get in really big trouble.\n\nYou can’t sell deep ITM calls on NVDA at $200 because it is trading below that. What do you mean? Why wouldn’t you sell calls ATM and above your strike and get more premium? \n\nYour calls won’t get assigned right away. What do you mean by that?\n\nWhat do you mean by “my margin purchase for the stocks”? If you buy stock on margin at $150 and then lose $50 a share and sell at $100 you owe your brokerage $50 a share… they’ll come after you for every cent. The margin is just a reduced cost for holding…\n\nYou seem to be missing a whole lot", "score": 13, "replies": []}, {"body": "Deep itm calls 200? You mean OTM?", "score": 1, "replies": []}]}]}, {"body": "Keep learning. You are almost there, but most of what you said is incorrect or doesn't make sense, but it seems like you are getting close.\n\nYou should 100% not be using any margin based on your current experience. You are playing with gasoline in a room full of burning candles.", "score": 13, "replies": [{"body": "Well said. Options aren’t for the faint of heart. I still trade small contracts at a time just trying to make an extra $75 a week since I would consider myself newer.", "score": 1, "replies": [{"body": "Options aren't so bad without margin. Adding margin on top of that is the part I am just learning about now and it is scary.", "score": 1, "replies": []}]}]}, {"body": "You sell put, means you'll buy nvda at 200. You want to sell a covered call at 200.", "score": 12, "replies": [{"body": "This guy shouldn't sell shit lol", "score": 24, "replies": [{"body": "Except for all of their shiny objects to pay for their fuckups.", "score": 3, "replies": []}]}, {"body": "It’s looking like It will turn in a blood bath", "score": 1, "replies": []}]}, {"body": "$200 calls are OTM, not deep ITM. WTF!", "score": 3, "replies": []}, {"body": "\nYou want to buy more shares...at $200/share...to collect the premium?", "score": 2, "replies": [{"body": "Yes.. if he is selling puts at $200 he will get his $64+ whatever profit.", "score": 1, "replies": []}]}, {"body": "This makes no sense.  Even with your correction that you're referring to calls, you won't get assigned (not \"exercised\") right away, and 200 strike is OTM, not ITM.", "score": 3, "replies": []}, {"body": "Forgive my confusion ... But a $200 call on a stock trading at $150 is not ITM. \n\nDo you mean you want to sell 45 OTM calls?\n\nOr do you mean deep ITM calls, like with a strike price of $100? That would make sense in the context of your question ... Sell those, collect the immediate premium which would be substantial.\n\nBefore you do that, you should find out if your broker will let you, since the underlying was bought on margin \n\nThen think about your expectations for the underlying ... Bullish, bearish, neutral, what time frame.\n\nThe strategy you describe is not optimal unless you are very bearish near-term. But it definitely will generate cash.", "score": 2, "replies": [{"body": "Sorry for my stupidity. So if I sell deep itm calls, if they get assigned, wouldn’t I have a maintenance call since I bought the underlying for more using margin?", "score": -4, "replies": [{"body": "That's the question you ask your broker, but you would presumably have enough cash, as a result of the sale of the underlying plus the premium, to cover the margin call.\n\nFrankly you really should consider a different strategy, given the nature of the purchase; others have suggested slightly OTM, short-expiration covered calls, which is a comparatively conservative, but sound practice. In this case the IV is large enough that you can make some decent Theta, even on weeklies.\n\nEspecially if you are paying interest on the borrowed amount, you want to at least make that much back and then some.\n\nI understand the appeal of the large premium for deep ITM calls but on balance it's seldom the optimal strategy.", "score": 1, "replies": []}, {"body": "You still haven't explained whether you are really talking about selling ITM calls or OTM calls.  You keep saying ITM, but you are also talking about selling the 200 strike on a stock currently at 166, meaning OTM.  So which is it?", "score": 1, "replies": []}]}]}, {"body": "Sure you can do that, really the only thing you're doing is capping your upside in case of huge run.  Not sure why you think you'll get exercised right away, I sell ITM calls a lot and have never had any exercised early.", "score": 1, "replies": []}, {"body": "Why would it get exercised right away? If the price is $166 rn no one is exercising at a strike of $200 tf? But yes you’ll get the premium", "score": 1, "replies": []}, {"body": "I think you mean selling way out of the money calls at $200 strike?  Sure you can.\nAs with any covered call, your risk is giving up any additional gains if the stock rises above $200 on expiry.", "score": 1, "replies": []}, {"body": "Don’t sell tomorrow - it’s earnings announcement - see what happens - bottom can be top - top can be bottom", "score": 1, "replies": []}, {"body": "Sounds like you want to sell 45 covered calls against your position of 4500 shares of the equity you own.  Very common practice.  Though a 200 call is not gonna get you much downside protection.  If you are trying to take advantage of the slightly higher premium from the upcoming earnings.  Say selling 45 180 Calls for around $2.  Capture 9k of premium.  This would basically put you in the position of selling all your shares at $182 or if it drops.  It will take your cost to $148.  No free lunches in this game.  There is always a give and take.  You get the premium but your gains is limited to 182, on the flip side you may lower the cost of the per share by $2 if NVDA moves down…", "score": 1, "replies": []}, {"body": "As others have said, you should definitely educate a bit on the tools you have with derivatives.  They are a blessing and a curse to this game.  Great tools to flatten risk sometimes.  But shit goes wrong bad and fast sometimes.  I’ve blown up my account twice in 30 years.  Happens when you least expect it.  As the Oracle of Omaha once said.  “My partner Charlie says there is only three ways a smart person can go broke: liquor, ladies and leverage,” he said. “Now the truth is — the first two he just added because they started with L — it’s leverage.”", "score": 1, "replies": []}, {"body": "200$ is otm for calls.  Honestly not a bad play with earnings this week which will juice the premiums.  If you don’t mind owning the stock you could sell deep itm puts but you’ll most likely get assigned and I’m pretty sure nvidia will poop out this earnings report", "score": 1, "replies": []}, {"body": "*Instructions unclear someone named Margin is calling*", "score": 1, "replies": []}, {"body": "Also be very careful of the IV Crush.", "score": 1, "replies": []}, {"body": "Bro.. no man just no. If you bought at 150 and are okay with selling at 200 then run a cc but the only way they get exercised is if asset is 200.01 of more", "score": 1, "replies": []}, {"body": "How do I buy or sell leaps? I'm using ibkr and only see the option function from stock screen. Didn't see any leaps", "score": 1, "replies": [{"body": "There is no specific thing called LEAPS on the screen. Essentially, LEAPS are just very very long dated options. So if you scroll to the Jan 24 or Jan 25 or Jun 24 dates, they are LEAPS.", "score": 1, "replies": []}]}, {"body": "I’m kinda confused. Do you want to sell DITM puts? Or OTM CALLS? They both alot you to collect premium. Maybe you want to do paper trading first to get the basics so that you don’t crash and burn?", "score": 1, "replies": []}]}
{"title": "Price predictions for Nvidia?", "selftext": "Nvidia has taken a dump the last 6 or so months, as much of the whole market has. With that being said, can it ever get back to its peak or higher?\n\nI know the stock is facing difficulties but I’m wondering what your guys takes on it are. \n\nThanks", "id": "yvq7kp", "created_utc": 1668497993.0, "score": 6, "upvote_ratio": 0.62, "num_comments": 36, "comments": [{"body": "Bro, NVDA is up almost 60% in one fucking month after being ridiculously overvalued. Like what more do you want lol.", "score": 30, "replies": [{"body": "2000% from 7 years ago", "score": 9, "replies": []}, {"body": "240% is what happened...", "score": 3, "replies": [{"body": "Out of curiosity, did you find this post from my account or did you look it up from the search bar?", "score": 1, "replies": []}]}, {"body": "36% , fokin regard", "score": -5, "replies": [{"body": "They're up 45% in the last month.", "score": 5, "replies": [{"body": "Yeah def up at least less than 950% this month.", "score": 6, "replies": []}]}, {"body": "50% from mid Oct 110", "score": 2, "replies": []}]}]}, {"body": "\"It's taken a dump\" depends on your perspective.\n\nWe can all agree that tech stock prices were massively inflated at the November 21 peak. Nvidia broke $340 and I don't even remember how high their P/E ratio was. (*edit: their P/E in Oct 2021 was 79*) The crypto market was breaking ATH's like crazy and their GPU's were selling like crazy.\n\nBy October 22 it almost dropped to $100 due to revenue decreases and macroeconomic conditions but it still bounced back to $160 within a month. That's not a bad jump.\n\nMy opinion:\n\nNvidia is a great company. They will definitely grow in the coming years and I expect the price to go up long term and maybe even break it's previous ATH if the economy recovers (which it probably will at some point). However, I'm bearish short term as I can see their revenue growth declining sharply mainly due to less demand for their GPUs and ofc due to recession. \n\nMy position:\n\nI'm short on Nvidia for a few days. My opinion of course could be completely false and my stop losses trigger by Thursday and I'll probably reconsider my trading skills (which are average at best). \n\nIf someone has more to add or disagree, I would appreciate any input.", "score": 7, "replies": []}, {"body": "Sure, after recession", "score": 6, "replies": [{"body": "Not just that…the pc markets in bad shape…people ain’t buying too many pcs for the past year", "score": 3, "replies": []}]}, {"body": "Nvidia will probably come back to ATH eventually but it might take a while since a lot of the inflated price was related to crypto bullshit.  They are an actual company that makes money and useful things though.  Not like a lot of the tech stocks that tanked this year.", "score": 6, "replies": []}, {"body": "Long-term if they can pull off self driving car tech they'll do well. It's why I bought them in 2015. Still holding", "score": 2, "replies": []}, {"body": "Cramer said it's going to be a $10T company.  Caveat emptor.", "score": 2, "replies": [{"body": "Where? Source.", "score": 1, "replies": [{"body": "His mouth.  His dog is also named NVDA.", "score": 2, "replies": []}]}]}, {"body": "There's no way anyone in this thread can give you an answer. If they succeed, they can hit 10T, if they fail than they'll drop further.\n\n&#x200B;\n\nIf you value them as a dGPU commodity company than they're overvalued. If you think their AI will be successful than ya its the moon. But that's like knowing what company will solve cancer, its anyone's guess. With even phones having AI HW on there, I don't see AI going away and likely being ubiquitous in the future.", "score": 2, "replies": []}, {"body": "Down on earnings probably. Price target in 1 year is 400", "score": 2, "replies": [{"body": "Lmao this aged quite nicely", "score": 4, "replies": [{"body": "Just coming back here myself to see if anyone hit the nail on the head. This guy did.", "score": 3, "replies": []}]}, {"body": "Pretty spot on man", "score": 1, "replies": []}]}, {"body": "Price target: Under 100$", "score": 1, "replies": [{"body": "Big swing and a miss huh?", "score": 3, "replies": []}]}, {"body": "The new gpu’s aren’t liked by the customer base.  Prices are ridiculously high for the 4080 compared to AMD’s card.  Its literally 2x the price.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Ok awesome. Have fun digging.", "score": 10, "replies": []}]}, {"body": "Going to pre covid price.", "score": 0, "replies": []}, {"body": "Garbage and arrogant company that relies on crypto and fucks over their partners and customers. Not to mention their valuation is based on hopium and buzzwords like AI and machine learning. Earnings will be a huge miss, it's time for this awful company to crash and burn.\n\nAll they manage to do is be anti-competitive and piss everyone off. I won't be surprised to see $50-70 dollars.", "score": -5, "replies": [{"body": "Found the guy who bought at ATH", "score": 13, "replies": [{"body": "I wait until stocks hit ATH and have plenty of momentum before I buy.\n\nThat's why my bags are so heavy.", "score": 1, "replies": []}]}]}, {"body": "It'll either go up or down.", "score": 0, "replies": []}, {"body": "1 quadziliion in 5 years of course", "score": 0, "replies": []}, {"body": "Feel the current price range is overpriced with every good factor priced in. However, shares don't care about rationality so do what you like.", "score": 0, "replies": []}, {"body": "Pain trade is higher near-term, but I suspect it will be below $140 by end of year. This was a stock a lot of people sold because of cyclical fears but always had the intention to buy back into. The sharp move higher looks to me a lot like panic buying from those who don't want to miss the bottom.\n\nI think they'll rally on earnings which will force the last panic buyers to capitulate and buy back in. But unless earnings are really good it will probably trend lower once everyone who's panic buying stops. And I doubt they'll be good given the macro.", "score": 0, "replies": []}, {"body": "Too many unknowns.  They are very expensive in their next gen vcards, with their main competitor offering cheaper cards...kinda.  If AMDs cards end up above expectations or close to, they might be hurting.  If AMDs cards end up a disappointment, you may seen them go up again.\n\nAlso potential looming recession.", "score": 1, "replies": []}, {"body": "If they could just stop making bad decisions, that would be great.\n\nThey bet big on crypto and it crashed. Demand for GPUs goes down (duh, since crypto crashed) and they release the 4080 at 1500 dollars? Do they not want people to buy their cards?", "score": 1, "replies": []}]}
