{"title": "$TSLA Daily Investor Discussion - January 21, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q3 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/9r1iru/tesla_tsla_third_quarter_2018_results_and/).\n", "id": "ai8dr3", "created_utc": 1548061472.0, "score": 11, "upvote_ratio": 0.92, "num_comments": 85, "comments": [{"body": "FYI its MLK in case anyone was wondering why the market was closed. ", "score": 16, "replies": [{"body": "Since my stock app shows the change during the last trading day, now I am stuck staring at -13% all day :( :(", "score": 11, "replies": []}]}, {"body": "Operating Cash Flow:\n\n2018:\n* Q1: -398M$  \n* Q2: -130M$ \n* Q3: +1390M$ \n* Q4: TBD. Likely slightly higher than Q3\n\n2019:\n* over 4000M$ (wide range of possibilities but nowhere near Q1/Q2 2018)\n\nThe stock is going to roughly track unit sales and unit margins, not cash flow. Some people are just addicted to cash crunch stories from the good ol' days of Q1/Q2 and can't give it up.", "score": 5, "replies": [{"body": "Operating cash flow is fine, but profit is what everyone has there eye on. Tesla needs profit to put in the bank as they have a lot of projects to finance in the short and long term.", "score": 3, "replies": [{"body": "> Operating cash flow is fine, but profit is what everyone has there eye on. Tesla needs profit to put in the bank as they have a lot of projects to finance in the short and long term.\n\nThat's wrong: \"operating cash flow\" and \"free cash flow\" in particular are the true cash flows that put money 'in the bank'.\n\nGAAP income on the other hand includes non-cash expenses such as \"stock compensation\" or \"depreciation or amortization\". GAAP income matters in terms of optics and EPS multiples, so it influences investor sentiment - but in terms of generating cash and growing it's the cash flows that matter.\n\nLook at Amazon for example: they were in stealth mode for a decade exactly because they only posted minimal GAAP profits, but generated very healthy cash flows which allowed them to grow into a trillion dollar company.\n\nIn fact Tesla currently has about ~~twice~~ 33% higher rate of cash generation than Amazon's cash generation rate, which is amazing and I'm curious whether they maintained it in Q4.", "score": 2, "replies": [{"body": "> In fact Tesla currently has about twice the rate of Amazon's cash generation rate, which is amazing and I'm curious whether they maintained it in Q4.\n\nLast quarter Amazon had free cash flow from operations of over $8.5 billion, while Tesla was at $1.4 billion.  In case you are confused, $1.4 is actually less than $8.5.  However, it should also be noted that Tesla's result was in a quarter where they significantly cut back on capex, which won't be possible going forward.   ", "score": 3, "replies": [{"body": "Firstly, a correction: I said \"twice the cash generation rate of Amazon\", which is wrong, in reality Tesla's current cash generation rate is approximately 30% higher than Amazon's. (I edited my original comment, leaving the mistake in place, to preserve the context.)\n\n> Last quarter Amazon had free cash flow from operations of over $8.5 billion, while Tesla was at $1.4 billion. In case you are confused, $1.4 is actually less than $8.5.\n\nLOL, which part of \"cash generation **rate**\" was difficult to understand? I note you didn't quote on how much revenue Amazon and Tesla generated that cash, right?\n\nHere's a quick and fair comparison:\n\nQ3'18 results | Amazon ($AMZN) | Tesla ($TSLA) | BMW ($BMW)\n---|---|----|---\nRevenue |  $56.6b | $6.8b | $28.1b\nCash from operations | $8.58b | $1.39b | $1.88b\n**Cash generation ratio** | **15.2%** | **20.4%** | **6.7%**\n\nSo Tesla's cash generation rate was in fact about 34% higher in Q3 than Amazon's.\n\nWhich company has a higher cash generation rate?\n\nAmazon's revenues are higher: Amazon is a 0.8-1.0 trillion dollars company after its initial growth phase - Tesla is a future trillion dollar company *before* its biggest growth phase.\n\n> However, it should also be noted that Tesla's result was in a quarter where \nthey significantly cut back on capex, which won't be possible going forward. \n\nYou are clearly confused about these accounting metrics: there's no such thing as \"free cash flow from operations\" - there's only \"cash flow from operations\"  and \"free cash flow\".\n\nWe are (correctly) using the \"cash flow from operations\" of Amazon and Tesla here - which numbers do **not** include capex.\n\nI.e. you are confusing 'cash from operations' with 'free cash flow' (FCF).\n\nBTW., capex outflows in Q3 were only slightly lower than in Q2: $560m vs. $677m.\n\n(edit: Added a \"BMW\" column to the table.)", "score": 0, "replies": [{"body": "> LOL, which part of \"cash generation rate\" was difficult to understand? I note you didn't quote on how much revenue Amazon and Tesla generated that cash, right?\n\nThe part where you said \"rate\" instead of \"ratio\" which is apparently what you actually meant.  Rate refers to an absolute measure, whereas what you were referring to was the ratio.  \n\nPS: No shit an auto manufacturer has a higher cash generation ratio than a low-cost retailer.  ", "score": 4, "replies": [{"body": "> PS: No shit an auto manufacturer has a higher cash generation ratio than a low-cost retailer. \n\nAnother blatantly false statement, let's include BMW's last quarter in that table:\n\nQ3'18 results | Amazon ($AMZN) | Tesla ($TSLA) | BMW ($BMW)\n---|---|----|---\nRevenue |  $56.6b | $6.8b | $28.1b\nCash from operations | $8.58b | $1.39b | $1.88b\n**Cash generation ratio** | **15.2%** | **20.4%** | **6.7%**\n\nAny other disinformation you have available that I should take down?\n\n>  Rate refers to an absolute measure, \n\nThat's a bullshit argument, and you won't be able to cite a single source backing that up: if you check the definitions of 'interest rate', 'rate of return', 'key rate' and the other 'rates', they are almost all relative **percentages**.\n\nI used the ordinary ['rate' meaning from mathematics](https://en.wikipedia.org/wiki/Rate_\\(mathematics\\):)\n\n> \"**a rate is the ratio between two related quantities**\"\n\nWhich is relative.\n\nWhy is it that bears/shorts have so much trouble admitting mistakes? Shit happens, people won't think less of you if you show a bit of humanity and humility and admit mistakes every now and then.\n", "score": 1, "replies": [{"body": "> No shit an auto manufacturer has a higher cash generation ratio than a low-cost retailer.\n\nThe AWS segment screws up the calculation for Amazon.  The figure for WMT is under 6%, for COST it is 4%, for JCP it is 4%, etc.  For Ford it is 11.5%, for GM it is 11.5%, for Toyota it is 14%.  \n\n\"generation rate\" means the same thing as \"flow rate\" - you are talking about volume/a quantum over time.  Your post shows you are talking about the cash generation __ratio__.   Why is it that bulls/longs have so much trouble admitting mistakes? Shit happens, people won't think less of you if you show a bit of humanity and humility and admit mistakes every now and then.", "score": 2, "replies": [{"body": "> The AWS segment screws up the calculation for Amazon. The figure for WMT is under 6%, for COST it is 4%, for JCP it is 4%, etc. For Ford it is 11.5%, for GM it is 11.5%, for Toyota it is 14%. \n\nGM's Q3 cash generation is actually 10.2% AFAICS ($3.67b cash from operations vs. $35.79b of revenue) - but note that even that is a bit rosy, because these large car companies have established captive financing arms like \"GM Finance\", which generate part of the cash: $0.5b from GM Finance in Q3. Without that income cash generation goes down to 8.8%.\n\nOnce Tesla has GM's size and has an established captive financing arm as well, they'll generate extra cash from that as well.\n\nI.e. we should either add those few percentage points to Tesla's numbers, or subtract them from GM's, to make an apples to apples comparison.\n\n> Your post shows you are talking about the cash generation ratio.\n\nWhile I'm fine calling it both a rate and ratio and clarify when there's any ambiguity, *your* 'understanding' of the 'cash generation rate' was to derail the discussion by *intentionally* making a meaningless comparison, by comparing Amazon's absolute levels of cash flow from operations to Tesla's cash flow from operations, which is like the most disingenuous comparison ever made on this forum??\n\nShort/bear arguments have no shame...", "score": 1, "replies": [{"body": "For OEMs (or retailers for that matter), it is really not a good idea to look at a single quarter.  Tooling costs do not run on regular schedules so you will often have single quarters that are big outliers.  My numbers were for the last full year available.  ", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Thanks for the clarification. Im itching to see the Q4 results.", "score": 3, "replies": []}]}]}]}, {"body": "Hello fellows...\n\nSo, about the Q4/Q1 guidance:\n\nIs the November debt ($230 million) the cause? Lets suppose the Tesla actually was 'more' profitable on Q4 because delivery more cars and lowered (supposedly) the cost. If the profit was $520 million, minus the debit Q4 will be $290 million, less than Q3.\n\nAnd that's explain the Q1 problem, because needs to pay $920 million debt (or $460 in cash and $460 in stock if hit the target price).\n\nDoes that make sense to anyone? If this is the case, the market may be exaggerating.", "score": 6, "replies": [{"body": "I don't believe debt payments count towards profit; ~~they are marked under free cash flow~~, for the same reason being given that money wouldn't suddenly count as making a profit that year.\n\nYou get a dollar, and also a debt of a dollar. When you pay that dollar to pay it off, you lose the debt on the books. Technically, no net value was changed. Only interest payments count on profit.", "score": 12, "replies": [{"body": "Okay, thats make sense...", "score": 3, "replies": []}, {"body": "But if debt is paid for by stock, then it does show up on the bottom line", "score": 3, "replies": [{"body": "In this case, your net profit might only be affected due to dilution effects. Raising equity by selling stocks increases your cash holdings and equity without appearing in the p&l statement. Paying of your debt is just a decrease of assets (cash) and liabilities (debt) and does not affect the p&l statement. ", "score": 3, "replies": []}]}, {"body": "Repayment of debt does not affect the P&L statement. Therefore, net profits do not change. Technically, your assets and liabilities decrease, while your equity is not touched.  journal entry: credit cash, debit debt. ", "score": 3, "replies": []}, {"body": "> I don't believe debt payments count towards profit; they are marked under free cash flow, for the same reason being given that money wouldn't suddenly count as making a profit that year.\n\nAlmost: debt repayments do not have an impact on the income statement, **nor** on free cash flow.\n\n(That accounting treatment makes sense: otherwise companies could game GAAP profits and FCF by taking on debt.)\n\nDebt repayments obviously impact cash flow (less money in the bank) and improves the balance sheet (less leverage).\n\nNote that other costs from debt do impact the income statement and profits, most importantly interest paid: that's a ~$175m per quarter expense right now, so it's a good thing Tesla is paying back debt.\n", "score": 2, "replies": [{"body": "Ahh, thanks for the correction!", "score": 2, "replies": []}, {"body": "> so it's a good thing Tesla is paying back debt.\n\nUm, Tesla is increasing net debt right now.  How do you think they are financing the Chinese factory?  ", "score": 1, "replies": [{"body": "> Um, Tesla is increasing net debt right now. How do you think they are financing the Chinese factory? \n\nUhm, by **Tesla making money**: through $880m free cash flow in Q3 alone, financed by operating cash flow of $1.4b that supports both current levels of capex and future projects.\n\nChanges to Tesla's \"Cash and cash equivalents\" money in the bank from Q2 to Q3:\n\n     Q2: Cash and cash equivalents: $2,236,424\n     Q3: Cash and cash equivalents: $2,967,504\n\nThat's a big increase in cash, *despite* Tesla being at higher rates of production and a significant growth in 'accounts receivable', both of which tied up cash.\n\nAlso, Tesla is saying that they are doing the Shanghai Gigafactory expansion by using 'local debt' - which I understand as debt from Chinese (government owned) banks, secured against the Chinese holding company, which doesn't burden the balance sheet. Maybe they'll clarify this aspect in their Q4 report and conference call.\n", "score": 2, "replies": [{"body": "> Also, Tesla is saying that they are doing the Shanghai Gigafactory expansion by using 'local debt' - which I understand as debt from Chinese (government owned) banks, secured against the Chinese holding company, which doesn't burden the balance sheet. Maybe they'll clarify this aspect in their Q4 report and conference call.\n\nDude, debt is debt.  They are incurring more debt than they will be repaying in Q1.  Therefore there total debt will be increasing, not decreasing.  ", "score": 3, "replies": [{"body": "> Dude, debt is debt.\n\nYou are not only peddling [bullshit arguments that do not realize the differences between cash from operations and free cash flow](https://www.reddit.com/r/teslainvestorsclub/comments/ai8dr3/tsla_daily_investor_discussion_january_21_2019/eeokt84/), you apparently also don't understand what \"local debt\" means: if the debt is isolated from common stockholders then it will not leverage up Tesla's balance sheet and all the capital ratios improve.\n\nSo no, not all debt is equal: in this case the Chinese government assumes much of the risk, not Tesla. (The flip side is that Tesla probably cannot transfer that $2b loan outside of China and the banks probably have strict supervision of spending to make sure it's spent on the China Gigafactory alone.)\n\nDeal with it like an adult.\n\n> Therefore there total debt will be increasing, not decreasing. \n\n$TSLAQ logic in a nutshell...", "score": 0, "replies": [{"body": "So your argument is that everything the Chinese subsidiary does will not be consolidated in Tesla's consolidated financials?  Because obviously you can't include the income generated there and ignore the liabilities, since that would be textbook fraud....", "score": 2, "replies": [{"body": "> So your argument is that everything the Chinese subsidiary does will not be consolidated in Tesla's consolidated financials?\n\nNo, the point I'm making is that there's different types of liabilities, and those liabilities that do not extend to common stockholders (i.e. if Tesla is not making a downstream guarantee for the debts of the holding company) are obviously different from general corporate debt.\n\nShould not be a difficult concept to understand.\n\n> since that would be textbook fraud....\n\nYeah, the default $TSLAQ fallback argument: fraud!!", "score": 1, "replies": [{"body": "And the point I am making is that if they incur more debt, they will be more leveraged and have higher interest expenses.  It doesn't matter if that debt is non-recourse to the parent entity.  Shouldn't be a difficult concept to understand, but you seem to act like the banks in China are handing the company free money because it is \"local debt\".\n\n> Yeah, the default $TSLAQ fallback argument: fraud!!\n\nI am not saying the company is committing fraud, that is the only logical conclusion of __your__ apparent argument that the company is expected to realize profits from the Chinese operations but not show any liabilities.", "score": 1, "replies": [{"body": "> And the point I am making is that if they incur more debt, they will be more leveraged and have higher interest expenses.\n\nThat's true - but depends on how those interest payments are structured - and I really don't want to make any further speculative guesses about that, because we don't even know it for a fact whether the debt is non-recourse to Tesla.\n\nAll I'm saying is that your 100% certain statement that Tesla is incurring more debt in China is not a given, it depends on the specific construct and how generous the Chinese government's deal with Tesla is.\n\n> It doesn't matter if that debt is non-recourse to the parent entity.\n\nIt might or might not matter in terms of interest payments - it might or might not matter in terms of liability.\n\nWe'll see what accounting treatment GAAP requires, which can cut both ways: for example much of Panasonic's equipment in the Gigafactory is on Tesla's balance sheet, despite it being owned by Panasonic.", "score": 1, "replies": [{"body": "> That's true - but depends on how those interest payments are structured - and I really don't want to make any further speculative guesses about that, because we don't even know it for a fact whether the debt is non-recourse to Tesla.\n\nThat does not matter.  The company still has to make the payments.  Their interest expenses will still increase.  Even if they structure the payments as a PIK (which would be even more expensive), they'll still have to capitalize the payments.    \n\n> All I'm saying is that your 100% certain statement that Tesla is incurring more debt in China is not a given, it depends on the specific construct and how generous the Chinese government's deal with Tesla is.\n\nThis makes absolutely no sense.  We know the company is incurring debt to finance the factory, they have announced this.  It does not matter what the terms of the debt are, they are taking on the debt and their total debt is going up.  A company is not allowed to incur debt and then pretend it has not done so on its balance sheet.  What you are saying the company could do is commit fraud.  \n\n> It might or might not matter in terms of interest payments - it might or might not matter in terms of liability.\n\nNo, it does not matter at all in terms of interest payments.  Again, that is completely nonsensical.  If something is non-recourse it impacts recoveries in a default situation, nothing else.  It has absolutely no bearing on interest payments.  This is totally basic debt financing information that you have completely wrong.  I don't even know what you mean in terms of \"it might or not matter in terms of liability\" - it is debt, it is a liability by definition.\n\n\n", "score": 1, "replies": [{"body": "> We know the company is incurring debt to finance the factory, they have announced this. \n\nWell, what they've said is this:\n\n> \"For China, I think, our default plan will be to use essentially a loan from the local banks in China and **fund the Gigafactory in Shanghai with local debt**, essentially. And we certainly could raise money, but I think we don't need to and we – yeah, I think, it's better to – it is better discipline not to.\"\n\nAwfully unspecific.\n\n> I don't even know what you mean in terms of \"it might or not matter in terms of liability\" - it is debt, it is a liability by definition.\n\nIt has the obvious meaning in the context I wrote it: a holding company's liability might or might not be added to the parent company's liabilities, depending on how it's structured by the lending party.\n\nNote that I do not dispute that you *could* be right - that Chinese local debt will show up on Tesla's balance sheet even if it's non-recourse debt.", "score": 0, "replies": [{"body": "So now your position is that even though the company has said their default plan is to finance the construction with debt, and there have been numerous reports about Tesla engaging with banks in China, and your own posts have stated repeatedly that Tesla will use local debt to finance construction, that actually that might not be the case?  \n\n> It has the obvious meaning in the context I wrote it: a holding company's liability might or might not be added to the parent company's liabilities, depending on how it's structured by the lending party.\n\nEnron pulled the same trick re: hiding debt off their balance sheet.  That doesn't mean the debt doesn't exist.  Tesla will still have to pay interest on that debt, even if it is done via a subsidiary.  ", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "So is there more pain coming on Tuesday? Does it make sense to hold through the earnings date or get out", "score": 3, "replies": [{"body": "Unfortunately it will go up because I'm transferring funds to brokerage account. So probably yet again missed opportunity. ", "score": 15, "replies": [{"body": "Dammit Bartek, stop fooling around. Get your act together! ;)", "score": 2, "replies": []}]}]}, {"body": "I really wonder what the effect on the stockprice would've been had Tesla announced its layoffs on friday afternoon, after markets closed instead of early friday morning.  The weekend + nasdaq not being open today might have been able to reduce the impact on the stockprice.  I'm thinking it's gonna take a while for us to go back over 350.  I'm affraid Q4 earnings won't be enough to make that happen :/", "score": 4, "replies": [{"body": ">  I'm thinking it's gonna take a while for us to go back over 350. I'm affraid Q4 earnings won't be enough to make that happen :/\n\nWe now know the approximate profit figures, so price reaction will IMO depend on the cash flow figures: in Q3 Tesla generated a lot of cash (around $1.4b) - if they can keep that up in Q4 then this alone will self-finance their expansion, without Wall Street financing.\n\nThere's also a chance of Tesla posting less revenue than the $6.8b in Q3 - that would be a miss. The lowest Wall Street analyst estimate for Q4 revenues is $6.0b - if that verifies then that would not be good for the stock price. The consensus is around $7.0b currently.\n\nAlso, high enough cash equivalents at the end of the quarter will settle any worries about the $920m of cash repayment for the convertible notes on March 1.", "score": 4, "replies": [{"body": "There is already no reason to be worried about the repayment of the March convertible debt. I think that \"no problem repaying the convertible\" is already priced in. \n\n&#x200B;\n\nWhat might change the Wall Street narative is the forward guidance on Capex. If Giga 3 is to be totally finaced by local China banks, then Tesla can keep up its 3B annual capex for quite awhile. That would be quite bullish.\n\n&#x200B;", "score": 6, "replies": [{"body": "> If Giga 3 is to be totally finaced by local China banks, then Tesla can keep up its 3B annual capex for quite awhile. \n\nThis doesn't make sense.  If Giga 3 is financed by Chinese banks, Tesla is just taking on more debt to finance construction.  The construction costs still count as capex.  Financing with debt just means the company will be more highly leveraged than if they financed that construction with internally generated cash.", "score": 4, "replies": [{"body": "Tesla needs to achieve scale. The path to scale needs capital. The worry about Tesla's supposed demise is not that Tesla would not grow, but grow too slowly, hence got caught up in the end. \n\n&#x200B;\n\nWestern banks demand a large premium to loan to a highly leveraged company. If, on the other hand, China banks are willing to take over the risks and provide Tesla loans with little collateral (at a lower interest rate to boot), considering that Tesla's growth is at present capital bound (not cannibalization/talent/brand image/product maturity/demand... like other firms), this lifts Tesla's main growth constraint. It address the CRITICAL BOTTLENECK of Tesla's problem. Which part of it does not make sense?", "score": 5, "replies": [{"body": "> Which part of it does not make sense?\n\nThe part where Chinese banks take all of the risk with no expectation of a commiserate financial return at the same time as the Chinese government is undertaking a huge campaign to reduce risk in the financial sector?", "score": 0, "replies": []}]}, {"body": "You are working as if you have an agenda", "score": -1, "replies": [{"body": "Pointing out that capex remains capex even if financed with debt means I have an agenda?  Maybe it just bothers me when people in what is supposed to be an investing forum don't seem to understand basics of financial accounting?", "score": 5, "replies": [{"body": "Full time job.  ", "score": -3, "replies": []}]}, {"body": "He is just correcting you guys.\n\nWhat would his agenda even be? Convince diehard Tesla fans who put all their money into this company and depend on the well being on it of Teslas failure?", "score": 3, "replies": [{"body": "No.  Constantly comment on every Tesla board to create negative slants whether large or small whether people like you notice or not.  You often dont.  ", "score": -6, "replies": [{"body": "But he corrected him right? As this is an investor sub he actually made a valuable comment in correcting a wrong understanding of the matter - don't you agree?", "score": 1, "replies": [{"body": "He doesnt know a damn thing about gig3.  He cant correct stuff that isnt known.  ", "score": -4, "replies": []}]}]}]}]}]}, {"body": "> What might change the Wall Street narative is the forward guidance on Capex. If Giga 3 is to be totally finaced by local China banks, then Tesla can keep up its 3B annual capex for quite awhile. That would be quite bullish.\n\nI don't think the Wall Street narrative at this point is overly neutral - despite all predictions to the contrary Tesla stubbornly refuses to do equity financing or issue corporate bonds, which cuts the investment banks and analysts out of the loop. A majority of Wall Street analysts are still bearish about Tesla.\n\nYear-over-year revenue growth is important in terms of being a growth company, and profitability is important in terms of it having to be larger than zero, but there are a couple of items that are a drain on GAAP net income (which was $254m in Q3):\n\n- depreciation and amortization from past product cycles - ~$500m in Q3\n- investment into future product cycles, R&D - $350m in Q3\n- interest payments ~$175m in Q3\n- stock based compensation ~$200m in Q3\n\nI.e. the *real* income generation ability of Tesla is about $1.2b higher than the GAAP income figure. The rest are either growth oriented (D&A, R&D), non-cash (such as stock compensation) or temporary costs (such as interest on their leveraged loans which cost they'll grow out as they pay back debt).\n\nI.e. I'd watch out for these metrics in the Q4 earnings report: **EBITDA, operating cash flow and free cash flow**, because these define Tesla's future cash flows, these define how quickly Tesla can build Gigafactory 3 and ramp up Semi and Model Y production.\n\nForward capex guidance will probably be conservative (they don't want to over-commit again), and they'll be able to engage in discretionary capex based on their free cash flow.", "score": 1, "replies": [{"body": "> I'd watch out for these metrics in the Q4 earnings report: EBITDA, operating cash flow\n\nYou keep posting this, but it makes no sense.  Interest and taxes are real expenses that reduce cash on hand.  The company can't just decide not to pay its taxes or pay interest on its loans.  While depreciate and amortization don't immediately reduce cash, you can't dismiss those losses without taking into account future capex needs which will reduce cash.    ", "score": 6, "replies": []}, {"body": "Most of the costs you identified are very real costs that people would be silly to exclude in their analysis for multiple reasons:\n\n* D&A expense is not necessarily growth oriented expense, as even the big automakers that aren't growing fast, or at all, spend more on capex than they incur in D&A expense. You can argue that there are some industries where D&A isn't real or poorly matches cash outflows (movie studios depreciating IP comes to mind), but I've never heard that case ever made for a capital intensive, PP&E-heavy business like manufacturing cars. \n\n* R&D is a real cost. If Tesla doesn't spend on R&D the business will cease to exist 20 years from now because no one is going to want a Model S as it sits right now in 2039. Saying that you should subtract R&D to get to Tesla's \"*real* income generation ability\" is saying that Tesla could cut all R&D to zero and sell the same amount of cars in perpetuity, which simply isn't true. \n\n* Interest expense a real cost. Of all the things here, this isn't even remotely debatable. Borrowing money costs money. You can't give a company the benefit of the what it earns using borrowed money and then exclude the expense of borrowing money. That just does not make sense by any stretch of the imagination. By your logic, a bank that pays depositors 4% interest and makes loans at 3% interest is making money. \n\n* Stock based compensation is a real cost. I don't know how you can think that Tesla should go up 20,000% to [$60,000 per share](https://old.reddit.com/r/teslainvestorsclub/comments/ahfg0s/homologation_secured/eegmgum/) and simultaneously believe that paying for labor in stock is a good thing! If this stock is so undervalued, why are you saying the stock Tesla hands out to employees as compensation is worthless? Makes no sense.", "score": 8, "replies": [{"body": "Can't address the rest, but i think the point for the interest payments was that these will decrease over time as debts are paid off, and so it's worthwhile to look at their income without them for comparison for coming years. To get a sense of how profit will jump after they are gone.", "score": -2, "replies": [{"body": "> but i think the point for the interest payments was that these will decrease over time as debts are paid off,\n\nThe company is taking on a lot of additional debt to finance the construction of the factory in China.  Their debt load is increasing, even if they pay off the $920 million convertible note with cash on hand.  They have given no indication they will be paying off other indebtedness prior to maturity.", "score": 4, "replies": []}]}]}, {"body": "A high forward Capex goes both ways. It can also be interpreted as Tesla's confidence in its financials.\n\nNew facility (or conversion from old ones) is needed for Model Y. If the faster you spend money, the sooner you can get model Y out, you better spend as fast as you can. After all, time is money!", "score": 2, "replies": []}]}]}, {"body": "People are also going to look at cash flow going forward.  What is their expected capex in 2019 going to look like?  Sounds like a lot is going to be spent in China, plus the company needs to start gearing up for Model Y and Semi production, no?  That $920 million debt repayment is the least of their concerns with regard to cash flow.   ", "score": 9, "replies": [{"body": "> People are also going to look at cash flow going forward. \n\nAbsolutely - under Tesla's current \"no Wall Street financing\" model future growth is defined by past cash generated, i.e. EBITDA, cash from operations and free cash flow define future revenues.\n\n> What is their expected capex in 2019 going to look like? \n\nI'd expect them to be rather conservative in that regard, and use free cash flow in a discretionary manner. That way they can adjust their capex to the cash surplus, without having to tweak guidance.\n\nI.e. I wouldn't expect big updates to their 2019 capex guidance.\n\n> Sounds like a lot is going to be spent in China, plus the company needs to start gearing up for Model Y and Semi production, no? \n\nChina Gigafactory is to a large part financed from local debt: Chinese government banks giving loans to Tesla, secured against the Gigafactory or outright unsecured.\n\nTesla did purchase land, and I suspect a percentage of the China capex will be financed by Tesla as well - but certainly not the full ~$2.5b they were guiding for as the total cost for the Shanghai Gigafactory.\n\nMy current guess is that they'll need ~$800m of total capex for the China Gigafactory to reach the estimated $2.5b capex level - only part of which would be committed this year.", "score": -2, "replies": [{"body": "> Absolutely - under Tesla's current \"no Wall Street financing\" model future growth is defined by past cash generated, i.e. EBITDA,\n\nSorry, that makes no sense.  Cash spent on things like interest payments and taxes certainly isn't going to be used to fund future growth.  Quite the opposite.  Free cash flow is the right metric.  \n\n> China Gigafactory is to a large part financed from local debt: Chinese government banks giving loans to Tesla, secured against the Gigafactory or outright unsecured.\n\nSo?  It is still capex.  The fact that they will be financing that with new debt instead of cash flow just means the company will have more leverage (and have higher interest expenses).  Also, LOL at that debt being unsecured.  \n\nI'm afraid the rest of your post is nonsense as you seem to not understand that capex is not a function of the financing source.\n\nEdit: It seems like you are trying to say the company's cash position will not decrease too significantly because they will raise a bunch of money through financing activities to offset the increased capex spend.  That is fair enough, but the counter-argument is the company is already highly leveraged, and taking on a bunch of new debt won't help that situation.", "score": 8, "replies": [{"body": "> Sorry, that makes no sense. Cash spent on things like interest payments and taxes certainly isn't going to be used to fund future growth. Quite the opposite. Free cash flow is the right metric. \n\nMy point was that cash paid on interest payments is a **temporary phenomenon of Tesla's growth model** - it's something that they'll naturally grow out as both growth and their paying back debt will reduce the relative importance of the residual interest payments.\n\nI agree that cash flow is the right metric in terms of determining whether a company can continue forward on its current path - but EBITDA is useful in the sense of determining the relative value and cash generation rate of the business model itself.\n\nI.e. the inevitable costs and inefficiencies of Tesla's hyper-growth path is masking some of the inherent long term qualities of the business model.\n\n> So? It is still capex. The fact that they will be financing that with new debt instead of cash flow just means the company will have more leverage (and have higher interest expenses).\n\nIt very much matters what it is secured against: against the new building and equipment, or against existing shareholder assets. I believe the Shanghai Gigafactory will be the former - that's why it's called \"local debt\", and it might not increase Tesla's global debt that shareholders are exposed to.\n\n> Also, LOL at that debt being unsecured. \n\nAccording to unconfirmed reports Guangdong offered Tesla 3 billion dollars of unsecured bank loans to attract them - but Shanghai still won the bidding war.\n\nIt might be false but this is China we are talking about, when there's high level political buy-on for a project then things start happening ...\n\nAnyway, all of this is mostly speculation, and your bearish views will obviously conflict with my bullish views there. 😉\n", "score": -1, "replies": [{"body": "> My point was that cash paid on interest payments is a temporary phenomenon of Tesla's growth model - it's something that they'll naturally grow out as both growth and their paying back debt will reduce the relative importance of the residual interest payments.\n\nSorry, but those interest payments are not a temporary issue - they have increased over the entirety of the company's history and they will continue to rise as the company raises more debt to pay for capex.  \n\nEBITDA is useful if you are a debt investor and care about the company's ability to service its debt.  If you are looking at the company's ability to generate cash to finance capex, it is not really appropriate.   \n\n> It very much matters what it is secured against: against the new building and equipment, or against existing shareholder assets. I believe the Shanghai Gigafactory will be the former - that's why it's called \"local debt\", and it might not increase Tesla's global debt that shareholders are exposed to.\n\nAgain, you are confusing concepts here.  The cost of building the new factory is capex.  Yes, it makes a difference whether the financing sources are non-recourse to other assets of Tesla or not.  But that does not change the analysis of capex (and cash) needs.  \n\n> According to unconfirmed reports Guangdong offered Tesla 3 billion dollars of unsecured bank loans to attract them - but Shanghai still won the bidding war.\n\nYes, as I said, LOL at that debt being unsecured.  Imagine what the interest expense would be!  $3 billion at say 7.663% (current yield on Tesla's unsecured debt) would be an extra ~$230 million of interest payments per year! ", "score": 6, "replies": [{"body": "Chinese interest rates on large projects are set by politicians. I can't find the leaked docs anymore, but Tesla secured a *very* lucrative contract.\n\nMusk is basically using this factory to scale out production costs. I predict it will not be a major international capital sink or revenue source despite the projected 500,000+ cars/year production rate.", "score": 2, "replies": [{"body": "> Chinese interest rates on large projects are set by politicians. I can't find the leaked docs anymore, but Tesla secured a very lucrative contract.\n\nExactly.", "score": 2, "replies": []}]}, {"body": "/u/peacockypeacock wrote:\n\n> Yes, as I said, LOL at that debt being unsecured. Imagine what the interest expense would be! $3 billion at say 7.663% (current yield on Tesla's unsecured debt) would be an extra ~$230 million of interest payments per year! \n\nLOL, your comment didn't age well:\n\nhttps://old.reddit.com/r/teslainvestorsclub/comments/ayi6f9/form_8k_on_march_1_2019_a_subsidiary_of_tesla_inc/\n\n> \"Outstanding borrowings pursuant to the China Loan Agreement accrue interest at a rate equal to: (i) for RMB-denominated loans, 90% of the one-year rate published by the People’s Bank of China, and (ii) for U.S. dollar-denominated loans, the sum of one-year LIBOR plus 1.0%.\"\n\n90% of the 1-year central bank interest rate on RMB debt, one year LIBOR plus 1.0% on USD debt.\n\n3.9% on unsecured USD denominated debt, a fantastic deal.", "score": 1, "replies": [{"body": "You must have missed the fact that (i) this only covers 3.5 billion of the 14 billion they were talking about financing, (ii) this is short term paper only covering the initial year of construction, and (iii) the covenant package completely locks down factory which serves as a de facto security interest.  \n\n> 3.9% on unsecured USD denominated debt, a fantastic deal.\n\nFor one year construction paper backed by a factory?  Not really.  ", "score": 1, "replies": [{"body": "> You must have missed the fact that (i) this only covers 3.5 billion of the 14 billion they were talking about financing, \n\nThe $3.5b RMB is the $500m capex they need to get to 3,000/week capacity by the end of 2019, as guided.\n\nThey will obviously only commit to the amount they need.\n\n> this is short term paper only covering the initial year of construction,\n\nYou probably missed that the factory building is being constructed by the Shanghai Government **for free**.\n\nNo construction costs for Tesla, other than the $140m they already paid for the land.\n\nThe $500m is for the equipment: press lines, assembly lines, molding lines, paint shop, etc.", "score": 1, "replies": [{"body": "> You probably missed that the factory building is being constructed by the Shanghai Government for free.\n\nI guess I did miss that, since in the filing Tesla said the proceeds of the loan are to be used to finance construction.  Seems weird that they would make false statements in their SEC filings....", "score": 1, "replies": [{"body": "> I guess I did miss that, since in the filing Tesla said the proceeds of the loan are to be used to finance construction. Seems weird that they would make false statements in their SEC filings....\n\nThat's a rather lovely $TSLAQ argument again, you are assuming that the only explanation to a question you are unable to answer is ... FRAUD - classic projection? 😉\n\nAnyway, to address your straw-man argument, here's what the filing said:\n\n> \"**loans may be used only for expenditures related to the construction of and production at our Gigafactory Shanghai**\"\n\nThat's totally not in conflict with my claim that the Shanghai government is constructing the Gigafactory building and infrastructure for free. The building, infrastructure and roads are not the only thing that have to be constructed: the press lines, assembly lines and paint shop must be **constructed** as well after all.", "score": 1, "replies": [{"body": "Ok, so on the one hand we have an SEC filing saying they are using the proceeds to finance construction of the Gigafactory, and on the other hand we have your claim that the Chinese government is building it for free.  Care to back up that claim with anything?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "If any other company were to have announced layoffs, their stock price would have gone up. Wall Street just likes to punish Tesla because it is different and is going after many big industries (energy, transportation, etc) with entrenched incumbents willing to shell out billions to crush them. Problem is, Elon and Tesla are 10 years ahead of where they need to be. So just do what I do and keep buying more every time it dips below $290 - $300 and wait a decade. I'm sure I won't be disappointed. ", "score": 2, "replies": [{"body": "In a stable company not expected to grow much, layoffs while still maintaining current output are a good thing. Tesla is a growth company tough, expected to grow year after year, and layoffs aren't what a growth company does. You simply can't grow while having large layoffs.", "score": 11, "replies": [{"body": "And yet they did grow headcount by 30% last year.  Even including the 7% layoff, that's still a ton of headcount growth.  More importantly, they sold more cars in the last year than in the previous 10 combined.  That's HUGE growth.", "score": 4, "replies": [{"body": "Yes, they have grown a lot in the past year, but even so, layoffs are not good for a company that is expected to continue growing, especially when the reason for the layoffs is that they can't support that many employees. At best it's a sign of slowing growth, at worst it's a sign of a shrinking company, either way it's not good news for a growth company like Tesla.", "score": 3, "replies": []}]}]}, {"body": "The stock didn't drop because of the layoffs, it dropped because of the guidance for Q4 and Q1 profits given in the announcement.  ", "score": 19, "replies": [{"body": "You mean the guidance that matched prior guidance?", "score": 2, "replies": [{"body": "You got me, clearly it was not new information and the stock dropped 13% just because people were all like \"let's sell all our Tesla stock today just for shits and giggles!\".", "score": 6, "replies": [{"body": "Not exactly new for Tesla. Overreacting negatively to positive news is their bread and butter. \n\n\nThey guided profits in Q4 and about break even in Q1. Low end behold, profits Q4, about break even (maybe tiny profit) in Q1. \n\nThey also guided more deliveries and there was more deliveries. ", "score": 4, "replies": [{"body": "Maybe I missed the guidance saying about break even in Q1.  Would you mind pointing me to that?", "score": 3, "replies": [{"body": "It's in the transcript. \"I think we can be positive cash flow and Profitable for all quarter going forward, leaving aside quarters where we may need to do a significant repayment, for example Q1 next year\" \n\nThis is also probably the line that made people think debt repayments impact profits. ", "score": 6, "replies": [{"body": "Got it, and you understand that quote says they will be profitable in Q1, right?  So in the last Q&A he said they would be profitable in Q1, and now they are saying they will need luck to show a tiny profit in Q1.  That is reducing guidance, and thank you for proving my point for me.  He is saying they may not be cash flow positive in Q1 because of the debt repayment, but as you note the debt repayment only impacts cash flow and not profitability.\n\n  ", "score": 6, "replies": [{"body": "He says cash flow positive AND profitable with \nthe exception of...\n\nNot just cash flow positive with the exception of....\n\nNot even Profitable and cash flow positive with the exception of....\n\n\nWhile I agree the debt doesn't explain why he said they might not be profitable Q1, he said he might not be profitable Q1. ", "score": 6, "replies": [{"body": "He says cash flow positive AND profitable with the exception of [something that only impacts cash flow and doesn't impact profitability at all].\n\nSo either Musk doesn't understand that repaying debt doesn't impact profitability (extremely concerning that the CEO doesn't understand the most basic of finance principles) or he was only qualifying the statement about being cash flow positive in all quarters going forward.  Luckily, the very next sentence in his statement, which you conveniently left out, makes this super clear: \"But I think even in Q1, I think we can be approximately flat in cash flow by end of quarter.\"  So clearly he was just talking about cash flow with that qualification.\n\nWay to be super fucking misleading by pulling a quote out of context.  The fact that the quote still proved my point is pretty hilarious.  Feel free to keep trying to argue a silly point however.  ", "score": 1, "replies": [{"body": "It literally says Q1 may not be profitable. Thanks for proving my point. ", "score": 2, "replies": [{"body": "Ok dude, believe what you want.  But you are literally looking at a statement from the CEO saying one thing and pretending it says exactly the opposite.", "score": 1, "replies": [{"body": "It literally says profitable all quarter expect for ones like Q1. Sure it seems like he left out the reason (even though it's pretty clear why), but it says it right there in black in white. Q1 may not be profitable.\n\nYou can try to image whatever excuses you want, but it doesn't change the fact that he said it may not be profitable.\n\nThe letter was no surprise. They're still meeting their guidance. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Tesla is a growth company that's why it has such high P/E.\n\nIf Tesla is not making big changes and decisions all the time I would worry.\n\nNo Change = no growth.", "score": 1, "replies": []}]}, {"body": "For the record, I'm claiming to have understood about 50% of this:-\n\n[https://seekingalpha.com/article/4234460-tesla-inc-poor-analysis-vie-exposure-misleading-quick-comment-layoffs](https://seekingalpha.com/article/4234460-tesla-inc-poor-analysis-vie-exposure-misleading-quick-comment-layoffs)\n\n&#x200B;\n\nThere are the key points.\n\n&#x200B;\n\n>From a stock price perspective, the outcome for Tesla hinges on the Model 3 and seems binodal. Reductions in the cost of the Model 3 need to approximate the loss of the federal tax credit for the company to succeed during 2020.\n\n&#x200B;\n\n>**Since the value of the VIE assets has not be deemed impaired, the conclusion is that the VIE assets will generate at lease $5.1 billion of undiscounted cash flow during the remaining useful lives of the assets.**\n\n&#x200B;\n\nSo essentially the main game is cost reductions on Model 3 production. SolarCity leases are not a hindrance, in fact they make a minor positive contribution", "score": 1, "replies": []}]}
