{"title": "$TSLA Daily Investor Discussion - January 03, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q3 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/9r1iru/tesla_tsla_third_quarter_2018_results_and/).\n", "id": "ac3zay", "created_utc": 1546506268.0, "score": 11, "upvote_ratio": 1.0, "num_comments": 79, "comments": [{"body": "I think Tesla is going for volume production with their new (cheaper) pack design in Q1.\n\nThere are a few posts on the main sub that the range has increased slightly on two different versions (MR and LR) and both in EPA and WLTP numbers:\n\n[https://www.reddit.com/r/teslamotors/comments/ac2xm0/mid\\_range\\_model\\_3\\_now\\_showing\\_264\\_miles\\_as\\_epa/](https://www.reddit.com/r/teslamotors/comments/ac2xm0/mid_range_model_3_now_showing_264_miles_as_epa/)\n\n[https://www.reddit.com/r/teslamotors/comments/ac3suq/awd\\_model\\_3\\_now\\_has\\_560km\\_of\\_range\\_wltp/](https://www.reddit.com/r/teslamotors/comments/ac3suq/awd_model_3_now_has_560km_of_range_wltp/)\n\nWe know from the investor call that that was the plan:\n\n>*We came up with a new design that achieves the same outcome, that’s actually lighter, better, cheaper and we will be introducing that around the end of this year – probably reach volume production on that in Q1 or something. That will make the car lighter, better, and cheaper and* ***achieve a higher range.***\n\nNothing conclusive, it could just be a correction of the range without any hardware changes, but given the above I think it's likely.\n\nThis might be another reason why they didn't ramp much further in Q4 than they did. Focusing on getting that set up and ready as it results in lower cost per car.", "score": 15, "replies": [{"body": "Why in Q1? Surly the demand for the MR is greater than one quarter’s worth of sales.\n\nAlso they are about to start shipping to Europe.\n\nDemand shouldn’t be a problem, why put out a car with almost no margin at this point?", "score": 1, "replies": [{"body": "New pack design =/= Standard Range.\n\nThe new pack design is for all versions.", "score": 6, "replies": [{"body": "Ah I missed that, even on the conference call I thought they were only talking about the SR pack which would be a different design.", "score": 3, "replies": [{"body": "Nope, was a general change.\n\nI can understand the confusion though, since everyone seemed to think that this change is/was necessary to be able to build the $35k Model 3, which was never the case.", "score": 7, "replies": [{"body": "Really? I thought that they said it was needed for the SR? I'll keep that in mind. That's good news if true. ", "score": 4, "replies": [{"body": "Well, you can argue if it's needed or not for the SR. A cheaper pack helps, obviously. But this was never planned, specifically for the SR or a requirement for the SR. The design they started off with was what they had in mind for all pack versions.\n\nThe new pack design is an iteration, building on the experience/problems they had with this one.", "score": 2, "replies": []}, {"body": "See I thought that too. That’s when they were discussing why the MR was the correct thing to do and wouldn’t slow down production.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Sandy Munro is back.. live on Autoline!\n\n[https://www.youtube.com/watch?v=aVnRQRdePp4](https://www.youtube.com/watch?v=aVnRQRdePp4)\n\n&#x200B;\n\nUpdate: He reiterated 18% gross margin on $35k model 3.\n\nHe said \"Chinese GF is going to be wicked (in a good way).\"  And \"Chinese version of  model 3 is going to cost at least 20% less to produce.\"", "score": 8, "replies": [{"body": "He is really excited about TSLA.\n\n\nHe get's it.", "score": 3, "replies": []}, {"body": "It will be interesting to see how many people opt for autopilot when the $35k Model 3 becomes available. A $5k option on a $35k car is quite a stretch. Will they need to lower the price?\n\nThe other EVs such as the Hyundai Kona that come in around the $35k mark all come with adaptive cruise and very basic lane keep assist as standard. Not in the same league as Autopilot on local roads but on the freeway almost as good.", "score": 2, "replies": [{"body": "Hyundai is not in the same league as AP or GM's supercruise. Eventually - maybe in 10 years, these things will come standard. In the mean time, Tesla will encash their lead. \n\nAP made a big leap ahead with Navigate on Autopilot. Everyone who uses it, is teaching the system a whole to drive better. ", "score": 1, "replies": [{"body": "I'm sure that's true but for somebody in the market for a $35k car they can either get a Kona/Kia/etc. with adaptive cruise and lane keep assist or Model 3 with old fashioned fixed speed cruise control. Will people shopping in that price range want to spend an extra $5k just to get TACC?", "score": 2, "replies": [{"body": "As long as they can maintain or increase the differentiation. Once the competition closes in, they will gradually reduce the price to increase the take rate. \n\n I am betting on tesla to increase the lead because they have more people training the NN than any other system. More training data makes it easier to beta test new features and fix issues faster.  ", "score": 1, "replies": [{"body": "Tesla is now focused on training safety NNs to prevent many types of accidents then they will have more room to experiment with more advanced self driving modes.\n\nMy prediction is that they will make that safety NN standard feature of every Tesla and IMO they also will share that safety NN with other car companies to save people by reducing number of accidents.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "I'm hoping nflx rebounds on their results when the market notices they don't have business in China and that tsla is still sitting in this vicinity before their er, then I can finally buy some more here. There's a lot of questions that need answering about how 2019 is going to proceed but they are in a much better position than any time in the past when their stock was at 310.", "score": 6, "replies": [{"body": ">they are in a much better position than any time in the past when their stock was at 310\n\nExactly. There's a lot of drama, again, but things have improved drastically the last two quarters.\n\nI hope that nflx -> tsla works out for you.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I think Netflix is going to go down before it goes back up again, but that it is still a good long term buy.\n\nTo me at least I see them as still being in their growth stage.  So if I had to guess I think their amortization strategy probably underestimates the value of their property when they eventually do try to maximize revenue.\n\n", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Key thing to understand is that they only need to give you the minimum amount of content to keep you from canceling.  \n\nIf they did more than that that would actually be a bad sign from a stock holder's perspective.\n\nThe way Netflix seems like its using AI to handle creating and distributing content to me looks like they have a huge lead.", "score": 1, "replies": [{"body": "AI to create content? What do you mean by this", "score": 1, "replies": [{"body": "To pick the creators and the type of content.  It might be stretching that part to call it AI but it is very automated and data driven from what I understand.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "TSLA is a volitile stock in the short term.\n\nI held it from 250 to 370 back to now 300. If I know the future sure I can gain some profit doing swing trades, but I don't, and I hate losing money more than missing out.\n\nWe buy TSLA now with confidence that it will go up several fold in coming 3-5 years. That's better than any index/stock investment can yield with reasonable risk.", "score": 1, "replies": [{"body": "More on TSLA.\n\nTesla is not only the leader of EV, but also the leader of innovation with Elon at its helm.\n\nWe bet on ones who Innovate rather than ones who held on to the old profitable ways.", "score": 1, "replies": []}]}]}, {"body": "Today in Thailand, the government just approved the investment of 3,000 charging stations to cover all area in the country. Thailand is not rich by any mean, but EV is the obvious future and ICE will eventually fade away. I hope more investors will realize that soon.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Not sure that is going to have any impact on anything to be honest.  GM hasn't made any effort to really sell the Bolt at scale - they seem to be focused on using it for their autonomous ride-sharing operations instead.", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "According to this sub, the tax credit drop is bad for GM, okay or good for Tesla. \n\nTake the $3,750/U.S. car \"straight out of profit\" for Tesla last quarter and basically all the profit disappears.", "score": 3, "replies": []}, {"body": "So GM may lose ~$67.5 million in subsidized profits next year?  They make $10 billion a year, so I don't think that will really matter to them.  On the other hand, Tesla is planning to sell like 150k EVs this year in the US, so they'll lose out on ~$562.5 million of subsidized profits.  Given they lost $1 billion this year, that is going to hurt them quite a bit more I think. ", "score": 0, "replies": [{"body": "> Given they lost $1 billion this year, that is going to hurt them quite a bit more I think.\n\nDeliberate stupidity. You lose points for this crap.", "score": 0, "replies": [{"body": "Apologies for reading the company's financial statements I guess....", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[https://www.businessinsider.com/teslas-stock-may-drop-another-27-selloff-jpmorgan-2019-1](https://www.businessinsider.com/teslas-stock-may-drop-another-27-selloff-jpmorgan-2019-1)\n\nSounds like someone is again trying to move the stock with FUD pumping.\n\nYes sell off 27% TSLA because Q4 broke record of Q3, and they dare to say demand is gone! Model 3 is only selling cars in 26 states in U.S, plus a little bit in Canada...  I don't know how people can become so shortsighted they are not seeing past 3 months.\n\nSo now they are \"expecting\" a good quarter, and we get a good quarter. They are  disappointed because it wasn't a great quarter! I think spinning stories is a career of many in BI.", "score": 8, "replies": [{"body": "Just so I understand, if one analyst lowers their valuation of Tesla, they are spreading fud, but if they raise the valuation of Tesla by ~$100, they are doing what? Just their job?", "score": 7, "replies": [{"body": "Claiming TSLA will drop 27% that's FUD alright.\n\nThey didn't put a price target, they just flatout say it's going to drop another 27% (from $300 level)!\n\nJPMorgan or BI or whoever runs this story is part of the FUD.", "score": -2, "replies": [{"body": "> Claiming TSLA will drop 27% that's FUD alright.\n\nYou realize TSLA is down 20% since December 13th?  Why is predicting a 27% drop so absurd? ", "score": 7, "replies": [{"body": "20% is because of bear market, but  JPM said TSLA could fall another 27%, based on what?\n\nI'm not arguing whether TSLA will or will not go down 27%.\n\nI'm arguing for their prediction is baseless.", "score": -1, "replies": [{"body": "Did you even read the article?\n\n> \"The perceived need on Tesla's part to lower prices suggests to us potentially softer underlying demand,\" analyst Ryan Brinkman said in a note to clients Thursday, \"and carries negative implications for the ability to earn the firm's targeted strong 25% gross margin on the already lower priced Model 3, which has been a key source of our conservatism.\"\n\nThey think demand will be lower than anticipated and gross margins won't meet the company's 25% target, thus the stock may fall 27% further.  Note the stock has already fallen over 3%, so only 24% to go I guess.  ", "score": 5, "replies": []}]}]}]}]}]}, {"body": "Fun to watch a lot of people learn for the first time that stocks can go a direction other than straight up. ", "score": 7, "replies": [{"body": "Haha. I don't think anyone who has been invested in Tesla is under any illusion that stocks go straight up.", "score": 10, "replies": []}, {"body": "Have you been living under a rock the last ~6 months?", "score": 3, "replies": [{"body": "No. Just 3 months.", "score": 1, "replies": [{"body": "The attempt was bad but thanks for trying.", "score": 1, "replies": []}]}]}]}, {"body": "Gonna be an interesting day watching all the tech stocks get hit. Apple screwed us.\n\nhttps://money.cnn.com/data/premarket/", "score": 4, "replies": [{"body": "It occurred to me that before this they were hiding their bad news and doing stock buybacks.  Which is probably the worst combination of things you can do.\n", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I'm not sure that would be legal.", "score": 1, "replies": []}]}]}, {"body": "APPL is going for new lows!\n\nIf there is a tech stock that moves independently with APPL, TSLA is one of them. ", "score": 2, "replies": []}, {"body": "It isn't Apple, it is slowing growth globally.  Apple sales falling is a symptom, not the underlying cause.  ", "score": 2, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Their fix is to get new leadership!\n\nTim Cook is a businessman but he only look at the next year!\n\nAlmost Zero Innovation, as their newest invention is the magnetic clip for the ipad pen? WTF? That's it?\n\nWait, there is the new bendable iPad...", "score": 3, "replies": [{"body": "The new iPad Pro is an amazing machine but it seriously lacks in software. I use it as a touchscreen monitor for my Macs with Duet Display. When I go back to simply using my laptop it always takes me a while to realize their computer still can't support Apple pencil support...\n\nTheir devices no longer integrate gracefully.", "score": 1, "replies": []}]}, {"body": "> The latest batch of iPhones were heralded as being affordable pre-launch but this didn't come to fruition.\n\nSure, but the idea was revenue should still increase as the higher price would offset lower sales.  Plus the rest of the company should still be growing.  The fact that revenue is dropping is not good, and is a sign that people can't afford to spend more money generally.  It is not just a matter of Apple getting pricing wrong.  ", "score": 1, "replies": []}, {"body": "Idk, the iPhone X is a pretty massive improvement IMHO. Wireless charging that works well, beautiful OLED displays, I maybe be an outlier but I actually like FaceID., Plus the standard battery camera and chip improvements. That's a pretty worthwhile upgrade. Yeah the competition has similar specs, but if we're just talking about upgrading iPhones or staying then I'd say they checked the box pretty well. ", "score": 0, "replies": [{"body": "That was last year though.  This year's offerings didn't really offer much of a reason to upgrade to those who didn't move to the X already. ", "score": 2, "replies": [{"body": "Was it already a year ago? Time flies. ", "score": 2, "replies": []}]}]}]}, {"body": "Fair", "score": 1, "replies": []}]}]}, {"body": "Alright, I vow never to make long-term predictions based on technical analysis ever again. But the fundamentals are still phenomenal. I've never seen a so discounted stock in my life.\n\nWhat convinced me to buy TSLA was their brilliant CEO, exponential production growth, advanced vehicular autonomy, the lack of serious competition and the very obvious FUD suppressing the stock price. \n\nThey've gone from producing 3,100 cars in 2012 to 120,000 cars in 2017 to 350,000 cars in 2018. I'm expecting 450,000 cars in 2019, 700-800,000 in 2020, and a million cars per year by 2022. And that's not even including the rapid growth in their battery business. \n\nI'm not completely surprised at the stock movement though. The market didn't jump on the Q3 production numbers, it jumped on the Q3 earnings report.", "score": 5, "replies": [{"body": "> What convinced me to buy TSLA was their brilliant CEO, exponential production growth, advanced vehicular autonomy, the lack of serious competition and the very obvious FUD suppressing the stock price.\n\nAll of that is true, but on the other side of the scale is huge amount of debt, questions about sustained profitability, wether they are withholding enough for warranty reserves, and an outstanding investigation into 2018 guidance.\n\nEverything you said can be true, and a Moody’s downgrade could still rock the stock. A large recall could also put Tesla into financial distress.\n\nTesla is an interesting stock.", "score": 9, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Ten years from now, Tesla could be an enormous success and still be worth exactly what it is right now. ", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I’d also like to see historical examples of an automaker valued like Tesla. ", "score": 0, "replies": []}, {"body": "If you look at AMZN from 2/14/1999 to 2/1/2009, you’re looking at an almost 10-yr hold time with a cumulative loss of -25%. \n\nNow some may argue that I’m cherry picking statistics, but that doesn’t change the very real possibility that companies with speculative valuations who have not yet proven their long-term scalability can simultaneously: 1) be wildly successful and 2) still lose money for investors.\n\nAnd I think that it may still be premature to say that Tesla is the next Amazon.\n\nAt the end of the day, the long-term value (stock price) of a company must be directly related to its long-term profits.\n\nRight now TSLA’s stock price puts its value even higher than GMs. It’s certainly possible, though perhaps optimistic — and definitely not guaranteed — that Tesla in 2028 is making as much profit as GM 2018.\n\nBut even if that were to absolutely happen, what’s the end result? The shares purchased in 2018 were based on a 2028 valuation. So congrats to the Tesla for pulling it off! But investors dont make money spending $100B today for a company that will justify a valuation of — cross your fingers — $100B some time in 10 years.\n\nLove Tesla’s car. Would even speculate on Tesla stock for the right price. But for those who expect Tesla to go to $1000...you’re basically saying that Tesla will do 3x the profit that GM did last year... GM sold almost 3 million cars last year, so you’d be aiming for the equivalent of 9 million in car sales to justify those numbers.\n\nLast year Tesla sold 108,000.\n\nAre there potential ways for Tesla to make up the profit gap? Of course. What’s the likelihood that they do? 60%? 75%? 95%?  Maybe 122%?!\n\nThe answer is I don’t know. But you asked for historical examples of where companies can succeed but leave investors hanging. Well, it definitely happens. \n\n====\n\nTL;dr\n\nMy friend’s kid told me that the father of one of his classmates was gonna make a lot of money selling a building for over $20 million in a few years.\n\nI asked him why he thought the guy was going to make a lot of money, and his response was “Don’t you think that $20 million is a lot of money?”\n\nMy response was “Yes it is. Unless, of course, he bought it for $21 million”.", "score": 0, "replies": []}]}]}]}, {"body": "I am with you in that when you look at the bigger picture you can find something to doubt. I am a slightly paranoid investor and I have been back and forth with Tesla, I’ve sold and bought back in 2 times in the past year. The thing that finally sold me on being long Tesla is when I got the chance to drive one. The car itself is like nothing I’ve ever driven before, the whole driving experience changed for me when I got in that car. I purchased the Model X as soon as we got back to the lot and have never been happier dropping such a large sum of money. No buyers remorse whatsoever like I’ve had with previous car purchases. When you take into consideration where Tesla is at now and see other carmakers scrambling to catch up it’s almost laughable. I honestly believe that the world has no choice but to move 100% towards electric transportation, and Tesla is leading the way with no signs of slowing. ", "score": 5, "replies": []}, {"body": "At certain points both Amazon and Netflix have lost 90% of their value.\n\nTSLA hasn't actually been as volatile as some other tech stocks.", "score": 2, "replies": []}, {"body": "It's interesting company. IMO ICE companies will have hard time to invest in EV while selling less and less premium vehicles at much lower profit.\n\nVW will be saved by German government but they can't save them all. BMW and Daimler probably will be sold to Chinese investors like Volvo.", "score": 2, "replies": [{"body": "Do you really think Germany is going to allow BMW or Daimler to be sold off to China?\n\nThey even almost blocked Kukas China sale and thats a much smaller company.\n\n> It's interesting company. IMO ICE companies will have hard time to invest in EV while selling less and less premium vehicles at much lower profit.\n\nWhy do you think that? Why should they have a hard time investing in EVs?", "score": 2, "replies": []}]}, {"body": "I’d be shocked if Moody’s downgraded them. Didn’t they downgrade them last year off of model 3 production issues? Now that those are solved i would think an upgrade isn’t too far off...", "score": 1, "replies": [{"body": "I was thinking about this section.\n\n> Tesla's rating could be lowered further if there are shortfalls from its updated Model 3 production targets. The rating will also be pressured if the company is unable to raise sufficient new capital to cover its late-2018 and early-2019 convertible maturities, and to cover the operating cash consumption that will likely continue into 2019.\n\n\nBut that’s kinda cherry picking. You can read the whole thing here and decide for yourself. \n\nhttps://m.moodys.com/research/Moodys-downgrades-Teslas-corporate-family-rating-to-B3-senior-notes--PR_381481\n\nJust highlighting it as a risk.", "score": 5, "replies": []}]}]}, {"body": ">huge amount of debt, questions about sustained profitability, wether they are withholding enough for warranty reserves, and an outstanding investigation into 2018 guidance.  \n>  \n>Everything you said can be true, and a Moody’s downgrade could still roc\n\nwith regards to car production i feel the curve will slow down a bit, as they have ramped up (mostly) their 1st mass market ca. Once model Y gets produced and ramped up model 3 production will come down to the sustainable rate. I estimate 2019 at 360,000.", "score": 2, "replies": []}, {"body": "The company produced about 250,000 cars in 2018.  ", "score": 2, "replies": [{"body": "My bad. ", "score": 1, "replies": []}]}]}, {"body": "Looks like the Apple effect hasn't been too bad. We could close green at this rate.", "score": 2, "replies": [{"body": "I’ll be fairly surprised if we close green, but would be nice.", "score": 1, "replies": []}]}, {"body": "Well there you go, just an update of the EPA numbers. No change to the car itself:\n\n>Model 3 mid-range EPA rating is actually 264 miles, slightly higher than prior estimate of 260\n\n[https://twitter.com/elonmusk/status/1080954820926664704](https://twitter.com/elonmusk/status/1080954820926664704)", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I don't think any other car getting type approval has ever made the news. It's crazy that people were even talking about this.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "How many stocks have amateur YouTubers/Podcasters with zero financial or accounting background whatsoever trying to comb through financial results or conference calls and explain them to other amateurs who have no financial or accounting background whatsoever. \n\nGoes both ways, man. ", "score": 3, "replies": []}]}]}]}, {"body": "Do people believe that Trump and Xi are interested in a trade deal?\n\nMy guess is that both sides see a lot more value in a trade war.  They see their slowing economies and need someone to blame.  So by appearing reasonable they get to blame the other side for the economic fallout.\n\nIt seems more likely to me that as economic issues appear each side will retaliate against the other in order to look like a strong leader.", "score": 1, "replies": [{"body": "Trump wants a deal so he has something tangible to show voters.  Without getting a deal he just gets the shitty economy blamed on him for starting the trade war in the first place (even if the economy was actually going to tank regardless).\n\nXi probably doesn't care as much since he can screw Trump around for the next two years and deal with his replacement.  And he gets the benefit of blaming Trump for some of China's issues, even if again the trade war only exacerbated existing issues.", "score": 5, "replies": [{"body": "China has the huge problem of trying to keep 1.4 billion people who are just getting used to having money and stuff happy. The trade war is clearly affecting their economy in a big way so I honestly think they will blink first. I don't think they can wait until Trump has gone.\n\nThis is not a defense of the trade war by the way. It's still a stupid idea.", "score": 6, "replies": [{"body": "China's unsustainable debt situation is having a much bigger impact than the trade war.  The trade war hurts for sure, but at least it gives them someone external to blame.", "score": 2, "replies": []}, {"body": "Agreed but I also think Trump will take the slightest blink at this point.  He saves face, deal is actually better than it was and economy improves.", "score": 1, "replies": []}]}, {"body": "> Trump wants a deal so he has something tangible to show voters. \n\nI don't get this attitude.  If he tanks a deal he has an enemy to show voters.  That works if the economy gets better or worse.  If Trump does a deal and the economy continues to slow then he gets blamed.", "score": 3, "replies": []}, {"body": "> ~~for the next two years~~ \n\nfor the next six years. FTFY", "score": -6, "replies": [{"body": "I'd be surprised if he finishes his term, much less runs again.", "score": 5, "replies": []}]}]}]}]}
