{"title": "Trump says US will impose 10% tariffs on $300 billion of Chinese goods starting September 1", "selftext": "#[SOURCE](https://www.cnbc.com/2019/08/01/trump-says-us-will-impose-10percent-tariffs-on-300-billion-of-chinese-goods-starting-september-1.html)\n\n> President Donald Trump said Thursday the U.S. is putting an additional 10% tariff on the remaining $300 billion dollars worth of Chinese goods, effective September 1.\n\nWhelp, here we go again for umpteenth time! :P\n\nDow wiping clear all of its +300 pt gain from earlier in the session and then some on this headline.\n\nIs anyone really surprised? This seems to be a monthly thing now. A little surprising to see the market reacting as much as it is.", "id": "ckrs52", "created_utc": 1564681997.0, "score": 245, "upvote_ratio": 0.96, "num_comments": 181, "comments": [{"body": "So is this what caused the SPY to drop 1.5% from today's high?", "score": 99, "replies": [{"body": "Yes", "score": 36, "replies": [{"body": "Yesterday, 7/31, I bought SPY puts at the close.  This morning I was down dramatically in the trade, but noticed that the 3 big components of SPX namely XLF, IYT, and XLE were not performing well at all.  So I held on to the position thinking the market had to go down.  I ended up closing the trade at a double. But the biggest question that I had is, is someone manipulating the market?  How in the hell can the largest components of SPX go down yet the index go up?\n\nThat being said, retail stocks got hammered.  With the new China debacle, which stocks (retail or otherwise) should set up to be the best shorts?", "score": 16, "replies": [{"body": ">someone manipulating the market \n\n\nYeah, they are.", "score": 13, "replies": [{"body": "It's like with a lottery: It's not illegal if the government does it.", "score": 7, "replies": []}]}, {"body": "SPX doesn't equally represent each stock equally. It is a capitalization-weighted index. So... If a company has a bigger market cap[Number of shares x stock price] it has a bigger influence.  \n\nEven though Microsoft the most represented by weight; went up 1.31% today(August 1) . It could not bring the index up, because it was outweighed by bank stocks which sold off.\n\nFinal Answer: Can the stock market be manipulated? \nDefinitely! The Federal Reserve is responsible for creating the housing bubble and the popping of it when it messed around with interest rates.", "score": 4, "replies": [{"body": "I know it is cap weighted.  But in general, the behavior I mentioned is rather odd.  And I know about the Federal Reserve as well, but are they buying futures in the background? Would that even be legal?  It just seemed that someone must have been buying futures to keep the market up.  I'm not a conspiracy theorist in general, but today's action seemed absurd. I had been waiting for the market to turn and go back down, but got called away. When I got back, my original puts were very close to doubling so I never added to it. I have a couple other key indicators I look at and they were mostly screaming 'down'.  I was asking myself all morning, \"just who is buying this market?\"", "score": 2, "replies": []}, {"body": "The housing bubble was created by Clinton forcing financial institutions to provide loans to people who could not afford it, not the FED.", "score": -2, "replies": [{"body": "Bullshit.", "score": 6, "replies": [{"body": "Whatever", "score": -2, "replies": []}]}]}]}]}, {"body": ">\"Trade wars are good and easy to win.\" - Donald Trump", "score": 5, "replies": []}]}, {"body": "I think trump is trying to sink the markets. Maybe he is using it to profit himself.\n\nThere is no way right after a rate cut he tweets that just by chance.\n\nSince end 2017 the SP500 looked like a roller coaster, every time he tweets is to sink the market and create uncertainty.", "score": 2, "replies": [{"body": "Has anyone analyzed to see what swings on the markets his tweets have? Because it's completely anecdotal but my theory is that we have seen diminished swings over time, i.e. market puts less and less weight on what he says (this is also what eventually happened in the 80s when he tried to manipulate the market for personal gain)", "score": 2, "replies": []}]}, {"body": "SPY?", "score": 1, "replies": []}]}, {"body": "Looks like Trump is mad at Powell for not lowering the federal reserve interest rate enough so he started imposing tariffs on China.", "score": 54, "replies": [{"body": "This is probably the least biased reason. Possibly the most accurate.", "score": 32, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.5070  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/07694)", "score": 16, "replies": [{"body": "What? You mean it may not be because he is doing favours?", "score": 4, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.4853  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/86013)", "score": -10, "replies": [{"body": "i don’t think there’s been a sitting president in modern history who has cared less about doing his job than donald trump.", "score": 5, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.2421  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/92807)", "score": -13, "replies": [{"body": "Fueled by how many trillions in debt? No wonder the economy looks so good. I’m a Republican and don’t buy into Trump economics. We’re bankrupting future generations with massive debt.", "score": 10, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.1741  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/16509)", "score": -7, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.4646  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/21617)", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.9983  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/72636)", "score": 1, "replies": []}, {"body": ">Obama actually added the most debt in total\n\nBacktracking now I see", "score": -1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.7583  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/93504)", "score": 1, "replies": [{"body": "Oh I agree.\n\nIts how he said it though.\n\nIt was \"Repubs added all of it!!!!\"\n\nWhen asked for a source \"Obama actually added a lot...\"", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Which is also congress failure to deal with the debt as well as the presidents. I run a company with 0 debt and there are times it would be nice to grow faster by taking out a loan, but having a no debt policy keeps us growing at a manageable rate. I feel like the feds should be forced to have a balanced budget like the State of California is forced to do.", "score": 2, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.4130  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/98446)", "score": 0, "replies": [{"body": "I think there are pros and cons for sure. It does help me sleep easier at night knowing what's on our shelves is ours and not owned by the bank. Also our main competitor is a 16B company and they also have no debt.", "score": 1, "replies": []}]}]}]}]}, {"body": "if by “following through on immigration reform” you mean “splitting families apart and keeping kids in cages”, then yes. \n\nif by “followed through on tariffs” you mean “creating yet another tax for the american people to shoulder”, then yes. \n\nif by “followed through on NK” you mean “cozies up to a despotic dictator and treats enemies as allies and allies as enemies”, then yes. \n\ni’m not even gonna touch the china one, because that’s just patently untrue let’s face it. \n\ni actually agree somewhat with what he did with regards to NAFTA and trade agreements, but don’t pretend he did it with the best interests of the american people in mind. \n\nif by “followed through on leaving lop sides trade deals and the iran deal” you mean “stoking the flames for yet another endless conflict in the middle east”, then yes. \n\nif by “running the hottest economy in decades” you mean “took over a years-long upward trending and well-functioning economy and claimed it was his doing”, then yes. \n\nonly one spouting propaganda is you. and i’m not your bro.", "score": 3, "replies": [{"body": "Stop with the cages bullshit. THAT is propaganda. I voted for Obama 2x and can confidently state “kids in cages” were created under Obama. FFS.", "score": 2, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.9915  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/02980)", "score": 0, "replies": []}]}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.4835  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/90846)", "score": -3, "replies": [{"body": "what asylum laws has he improved exactly? and how in any way do they impact the lives of ordinary americans? and how is it a parent’s fault that their child is locked in a cage? and tariffs are [ABSOLUTELY ](https://www.google.com/amp/s/www.forbes.com/sites/teresaghilarducci/2019/06/06/tariffs-are-taxes-raising-costs-and-killing-jobs/amp/) a tax on importers. which we are. it’s like buying shit at the store. you pay a tax on the goods you want. just like america pays a tax on the goods IT wants. because bright boy is a “patriot”. who floats the bill for that tax? american citizens, typically the middle class. and clearly [the NK/SK relations are going swimmingly](https://www.google.com/amp/s/www.nytimes.com/2019/07/26/world/asia/north-korea-missile-moon-jae-in.amp.html).i’m not defending the actions of iran in the past but anything to keep us out of more war is ok in my book. dipshit’s administration has [been trying to get a conflict going for a while.](https://www.google.com/amp/s/amp.theatlantic.com/amp/article/592108/) . trump may have added manufacturing jobs but unfortunately [that’s over now](https://www.google.com/amp/s/www.cnbc.com/amp/2019/06/11/that-big-trump-bump-in-manufacturing-is-pretty-much-gone-now.html) economic growth has been trending upward for [over a decade](https://www.pbs.org/newshour/economy/making-sense/can-the-longest-economic-expansion-in-u-s-history-last), which is longer than fat donny has been running the ship last i checked.", "score": 1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.7199  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/30653)", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.9354  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/68161)", "score": -1, "replies": []}]}]}, {"body": "You are repeating everything the fake news media shoves down your throat. Do yourself a favor and think critically for a moment instead of living as a sheep for the rest of your life.", "score": 0, "replies": []}]}, {"body": "Downvote facts. The state of Reddit.", "score": -1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.1743  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/59748)", "score": 3, "replies": []}]}, {"body": "Sad state of affairs when the propaganda is perceived as fact and fact as propaganda.", "score": -1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.0486  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/58599)", "score": 2, "replies": [{"body": "our information sources and our measurements and standards of success are different. don't think we're going to agree even if i type out a well thought out reply.\n\nfor example, politifact says it's non-biased and independent. they won a pulitzer prize for fact-checking. do you believe what they say?", "score": 2, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.3112  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/57396)", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Woah, don't go against the grain! Seems to me that he is doing a great job. What the Fuck do i know though? I'm just a semi educated working class motherfucker who invests.", "score": 0, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.7904  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/85513)", "score": 2, "replies": []}, {"body": "I also think the President is doing great. Look no further than every MSM outlet looking for any chance to speak negatively about him (since 2016) to know he is on our side. The blatant attempt at censorship is overtly obvious to any impartial observer. It made me leave the Democratic Party. I don’t even recognize them anymore.", "score": 0, "replies": [{"body": "Bro, there is no censorship! It's just Donald trump trying to block the real news... Shut I can't even joke about sonthibg so stupid. How can people not see what goes on and what the MSM pushing on us. It is so absurd. What is wrong with people  :(.", "score": 2, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.1376  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/25803)", "score": 2, "replies": [{"body": "The red star infiltrated the USA. I'm just doing my thing , doing my best, n getting ready. No way Pres Trump doesn't win 2020. Not much to worry bout till 2024. That's gonna be some sort of shut to deal with.", "score": 1, "replies": [{"body": "Make sure you still go out and vote in 2020. They are counting on people staying home.", "score": -1, "replies": [{"body": "I will never miss and election. There is one voice that spews out of my air hole.... Some times it sound like a fart.", "score": 2, "replies": []}]}]}]}, {"body": "is fox news included in mainstream media? Or does that get a pass because they frequently confirm what you already believe?", "score": 0, "replies": [{"body": "I would say it's still MSM. But I don't have cable so I don't watch any news. Most my news comes from /r/sillycats.", "score": 2, "replies": []}]}]}, {"body": "is fox news MSM? Cause they seem kinda like his press arm to me", "score": 0, "replies": [{"body": "Absolutely part of the machine. But thank you for pointing out ONE media outlet that may actually lean right vs. left. We should all desire a NEWS outlet that is unbiased reporting only actual events, without spin or opinion. Essentially what the news outlets were 40 years ago.", "score": 1, "replies": [{"body": "NPR and PBS still seem to be that way", "score": 0, "replies": [{"body": "Perhaps PBS. NPR has gotten better as the Russian Collusion theory has dissolved away but for a while it was very anti-President based on zero hard facts. Also concerning that no major press outlets have covered the dismissal of the DNC lawsuit alleging Julian Assange assisted Russia with the publication of Hillary’s emails. The judge outright stated the DNC allegations were completely divorced from the facts. Zero press coverage. Strange, huh, after so much hoopla made over it since 2016.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "More than likely Trump already planned this regardless of the Fed rate decision. \n\nBy playing the tariff card, businesses are under pressure to move business out of China and make new investments elsewhere to avoid the tariffs.", "score": 12, "replies": [{"body": "I suspect this will be a theme over next two years and it can be predictable.", "score": 4, "replies": []}, {"body": "There was no way he did this if fed didn't lower rates", "score": 0, "replies": [{"body": "Quite the contrary, he would’ve been even more likely. He wants a few more rate cuts before suddenly making a deal and using the market pop as election fodder.", "score": 0, "replies": [{"body": "well we agree on that point. but i don't think the market would have held up this week if rates had not previously been lowered", "score": 1, "replies": []}]}]}]}]}, {"body": "what are the odds that trump bets against the market and anounces whatever will give him the most gains. How likely you think he tells is son in law ahead of time before he tweets something. Hes a thief.", "score": 97, "replies": [{"body": "I would say the odds are 99.99% he does this, if not with family then likely with his lawless friends", "score": 61, "replies": [{"body": "Yeah, I think Jared is getting his from completely other sources. But I'm nearly certain that at least a few in his circle know what his next tweet will be before it's sent, at least when it has to do with Tariffs.\n\nNo one in his admin cares what he tweets about investigations and border walls, but when he's tweeting stuff that could be immediately actionable, that's a whole other story.\n\nHow are Renaissance Technologies funds' doing?", "score": 14, "replies": []}, {"body": "Also Twitter employees may see his Tweets couple of seconds before anyone else, so there is time to press sell button", "score": -12, "replies": [{"body": "No, how readily does a tweet post after hitting submit. It’s instantaneous.", "score": 9, "replies": []}]}]}, {"body": "He’s actually full chub being able to make America and the world squirm as he types the word “China”. In short, you are his old-man porn.", "score": 3, "replies": [{"body": "This comment ended way too early.", "score": 3, "replies": []}]}, {"body": "I’m not sure he’s that smart. He believes tariffs are getting us somewhere. I think he believes he’s helping the economy so I don’t believe he’s betting against it.", "score": -1, "replies": []}, {"body": "Who cares if he does or doesn't?, it's called ways of making money, and yes I did lose a lot of money today.", "score": -48, "replies": [{"body": "correction\\* ways of making money illegally", "score": 29, "replies": [{"body": "That is not ilegal dude, not only that, did you know that the market is mostly controlled by investor sentiment? That means that the prices of everything drops because the market is not as attractive to investors, however that doesn't mean that there isn't ways to make more money on the dips.", "score": -36, "replies": [{"body": "Manipulating the market is very illegal if you have any investments. Look what happened with Elon Musk and the SEC.", "score": 31, "replies": [{"body": "But to be fair it is just a news article, for example you could also say that Powell tried to “take advantage” of the market by giving that speech yesterday.", "score": -26, "replies": [{"body": "The key part is he can’t have investments. I am certain that Powell is kept under the tightest scrutiny when it comes to what he can and cannot do with his money.", "score": 14, "replies": [{"body": "Trump can't have investments as president either, why do you think he put his children to manage it for him.", "score": -4, "replies": [{"body": "So that he could continue to profit while maintaining a veneer of transparency.", "score": 13, "replies": [{"body": "And if you were a millionaire knowing that it's completely legal to do so, would you do it?", "score": 0, "replies": [{"body": "If I was the president? No, I wouldn't use my office to profit at the expense of my fellow citizens. Not everyone is a piece of shit.", "score": 11, "replies": [{"body": "I didn't say profit of the expense of, I said transfer the management of your assets to your children", "score": -1, "replies": [{"body": "I would do that, but I would actually divest, unlike Trump, who continues to violate the emoulments clause and is profiting wildly from his position in the federal government.", "score": 8, "replies": [{"body": "So let me get this straight, you're saying that it's bad that Trump \"controls\" the stock market (which he can't invest in because he is the president) so that his children can reap the profits, so that's not illegal now is it. His children and him are multiple identities, not the same, so therefore it is not illegal because he is not the one investing.", "score": 0, "replies": [{"body": "When did I say that? Why not stick to arguments I actually made, champ.", "score": 6, "replies": [{"body": "And how do you know that's he's profiting from his position in the government, do you know it first hand, did he tell you? Or are you just repeating like a parrot what the fake news media is telling you?", "score": 0, "replies": [{"body": "Oh you're a cultist", "score": 6, "replies": [{"body": "There it is\n\nWhere do these folks come from anyway?  Such blind loyalty.", "score": 7, "replies": [{"body": "Trump is a poor man's idea of a rich man. They have scorn for folks like Buffet who walk softly and carry big sticks, but salivate when \"their guy\" uses insults and attacks like he's fucking 10 years old.", "score": 6, "replies": [{"body": "Hehe not really, try to amass 3 billion dollars then tell me how that works out for you.", "score": -1, "replies": [{"body": "I pay your SSDI check, chill", "score": 3, "replies": [{"body": "I pay yours as well, so what?", "score": 0, "replies": []}]}]}]}, {"body": "It's not blind loyalty dude, it's called having common sense, what this whole thread is about is totally and utterly ridiculous, if he or his friends or family made money, who cares! As I said in a previous comment, you could take Trump's tweet as a news article, the stock market goes down because of investor sentiment. Not because he's necessarily \"controlling it\".", "score": 0, "replies": [{"body": "So you don’t think him tweeting about tariffs causes it?  😂 that’s why the DOW shaved off all gains today and went negative in the span of an hour after his new tariff announcement \n\nTrump tweets “hey I’m putting more tariffs on new goods” Trading algorithms (which is what actually controls markets more than retail investor sentiment) immediately sell because GUESS WHAT?? Tariff announcements affect investor sentiment!! Wow!  \n\nThat wool is a bit tight around your head you may want to loosen it a bit buddy \n\n“If trump is committing crimes, who cares!!”\n\nGod if the wool was any tighter what’s left of your brain may pop out", "score": 1, "replies": [{"body": "First of all, let me start by saying that I never said that Trump’s tweet didn’t caused it (it is merely an announcement) and second of all, the point I’m trying to make is that you and everybody here are going totally crazy because he is “committing crimes”, now tell me Mr. Know it All, how exactly did he commit a crime, just by sending out a tweet? It’s not like he’s telling a lie about something just to make the markets fluctuate. Learn to read, you might wanna go back to preschool.", "score": 1, "replies": [{"body": "Lmao you’re prob a teenager anyway dude hit the books I’m not going to take any more of my time to try to teach someone who has a closed mind.  Literally just re read the thread you boob", "score": 1, "replies": [{"body": "I have to agree with you on this one, I shouldn’t be wasting my time on people like you, have a nice day!", "score": 0, "replies": []}]}]}]}, {"body": "And I love to hear you talk more about how much you understand the stock market when you called yourself a noob at it\n\nPro tip:  watch VXX and after it spikes high tomorrow buy a short term put close to the money.\n\nVolatility goes up whenever trump makes announcements like this \n\nI doubled some money on aapl puts too yesterday that I bought as soon as I read his tweet", "score": 1, "replies": [{"body": "I never said at the markets, I said at options... learn to read please.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Market manipulation is illegal, and personal gain is not a requirement to meet. It's illegal even if you have nothing to gain. And gaining through friends or relatives ain't gonna get by the SEC.", "score": 4, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "He came out with profit? Lol. Sec is a joke, so is govt policy messing with business. Privatize everything but branches used to uphold the law, allow quantity and quality to improve through competition not govt policy. Goddamn I'm still fired up from watching the buffoons on the dnc debate dodge the question of how do you pay for free stuff/who pays for free stuff. They would say anything but say this is a proposition to hike taxes for everyone, and only cause big government to win.", "score": -12, "replies": [{"body": "Not sure how you could argue against oversight of America’s financial services after 2008 but okay", "score": 1, "replies": [{"body": "Because the housing bubble was caused by govt intervention making banks give out loans to people who don't qualify", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "More market manipulation.  The next President better over fund the SEC and target every single person near Trump for insider trading", "score": 66, "replies": [{"body": "They haven't targeted Congress with all there insider bullshit....since forever.\n\nDon't act like it is only the Repubs that do shady shit", "score": 0, "replies": []}, {"body": "The next president will be trump. TRUMP 2020", "score": -8, "replies": [{"body": "Incumbents win a majority of the time so that is probably going to happen . \n\nI am not sure if I prefer another 4 years of his tweets as president or a 4 year head start on his post presidency twitter feed  which will be reckless but at least entertaining . \n\nHe is more sensitive/emotional than a girl who gets their first period , a woman who is pregnant ,  and a menopausal woman all combined . Not even a trump lover can argue that . \n\nThese tweets are definitely filtered and once he is out they will be even crazier .", "score": 2, "replies": []}]}]}, {"body": "Burn it all down you retarded orange ape.", "score": 52, "replies": [{"body": "Let’s start this recession NOW!!", "score": 15, "replies": [{"body": "I think Trump wants the economy doing well right before elections for political talking points, so I wouldn’t be surprised if he lifts some tariff percentages so the market does better when he needs it to.", "score": 7, "replies": [{"body": "He probably made up this tweet on purpose that way he forces the fed's hand to save the market and cut rates even harder on September. After he gets the rate cut he's been begging for then he'll say for the 100th time that China trade talks are going amazing and a deal is 99.9% made. SPY then hits 3500", "score": 2, "replies": []}, {"body": "Agreed. I think he is going to fluff and puff it up until the second term then deal with the budget and college loan issues.", "score": 0, "replies": []}]}]}]}, {"body": "Shorting season is upon us. Mango Maga is starting to push the Jenga tower over.", "score": 13, "replies": []}, {"body": "He went full retarded after the rate dip.", "score": 19, "replies": []}, {"body": "Would it be a viable and profitable strategy to just buy a bunch of puts several months out and watch Trump's Twitter account everyday?", "score": 5, "replies": []}, {"body": "But remember, the Chinese are paying the tariffs and filling our coffers with billions /s\n\nThis dipshit was born with a silver shovel crammed in his ass, his daddy bought his way into some of the nations best schools and he has spent his adult life hob nobbing  with the worlds smartest and elite folks and yet he still doesn’t have a 5th grade understanding of what a tariff is or does.", "score": 18, "replies": [{"body": "He never needed to, he failed his way through life and was rescued at every turn by wealth and privilege. If he was born into a poor family he'd be the manager at a used car dealership- tops.", "score": 5, "replies": []}, {"body": "Trump knows Americans pay.  Trump supporters however, don't know dog shit from apple butter.", "score": 2, "replies": []}, {"body": "Hmm, I thought that the government would be taking all the tariffs as revenue. Is it not?", "score": 0, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "You don't think industry will figure out how to make goods somewhere other than China to avoid tariffs?\n\nThat will:\n\n1. Hurt China\n2. Consumers won't be paying taxes (since there won't be any with other means of production outside China)\n\nSounds like over time China is theonly one that will suffer.", "score": -4, "replies": [{"body": "I heard an interview on the radio, this guy invented a better way to stow your bicycle on your ceiling. He wanted it to be made in America, but when he took his invention to likely American manufacturers, they said: \"Sure thing! How many 100,000 of these do you want us to make?\"\n\nWell he couldn't do that, so he called some places in China. \"Sure thing! We can start with 100 to see if you have a market.\"\n\nSo he had it made in China, and he's selling it for $140. Then the tariffs went up to 10% and he bumped the price to $149. Now they're 25% and he's seeing business slacking off.\n\nNow, you're probably going to get focused on this one guy, and come up with excuses and explanations for him and his one product. But back up and try to see the big picture. This kind of thing is disrupting business for millions of Americans, it's expensive, and regular Americans are footing the bill.\n\nSure, Apple and some others are moving business to Vietnam, but there's an expense to that. The relative expense gets bigger the smaller the company, like the inventor in the story.\n\nEventually industry will find ways around it, but meanwhile, China is not the only one that will suffer.", "score": 3, "replies": [{"body": ">Now, you're probably going to get focused on this one guy, and come up with excuses and explanations for him and his one product. But back up and try to see the big picture. This kind of thing is disrupting business for millions of Americans, it's expensive, and regular Americans are footing the bill.\n\nYou are the one ignoring the big picture. In the long run it is very beneficial to be off the US's China dependence.\n\nIn the short run yes consumers will for the bill. But like you say below are consumers paying more for Apple products? No. Is China hurt by them leaving? Yes.\n\n>Sure, Apple and some others are moving business to Vietnam, but there's an expense to that. The relative expense gets bigger the smaller the company, like the inventor in the story.\n\nGuess his bikehanger doesn't have much of a market if a $9 price change will kill him.\n\n>Eventually industry will find ways around it, but meanwhile, China is not the only one that will suffer.\n\nSo you understand the long ruin, big picture goal...you are just ignoring it?", "score": 0, "replies": [{"body": "While we are weaning of China goods, China is also weaning of US goods.", "score": 3, "replies": [{"body": "With the massive trade deficit, The US isn't the one with the most to lose.", "score": 0, "replies": [{"body": "We have the MOST to lose. The trade numbers in no way take into account the services. And having China turn elsewhere for software, support, r&d, finance etc will completely remove the US from being the technology super power it is.", "score": 1, "replies": [{"body": "China steals software", "score": 1, "replies": [{"body": "What does that have to do anything with anything? \n\nWe are in the 21st century, if they want to get access to a software to reverse engineer, there isn’t some magical wall stopping them from bringing it into China", "score": 1, "replies": [{"body": "It means fuck China and all those shitty products", "score": 1, "replies": [{"body": "Your home is probably made up mostly of things made there lol", "score": 1, "replies": [{"body": "Probly still does not make it quality things ;)", "score": 1, "replies": []}]}]}]}]}, {"body": ">We have the MOST to lose. The trade numbers in no way take into account the services. And having China turn elsewhere for software, support, r&d, finance etc will completely remove the US from being the technology super power it is.\n\nYeah good luck with that. US purchases goods and manufacturing from China. Both of which can easily be obtained elsewhere.\n\nChina has no other good sources for highly technical things like software, and R&D.", "score": 0, "replies": [{"body": "That is the point. \n\nThey don’t have good sources now,  just like we have no good sources for manufacturing now.\n\nBut if this pressure keeps up, they will have no choice but to find other options. They are a huge country with the largest population, with enough time and pressure they could easily become a software powerhouse.", "score": 0, "replies": [{"body": "Good for them?\n\nIt's not like they pay us for R&D or software anyway.\n\nI read at recent stat that 3 in 5 companies had their IP stolen by China in the last 10 years.\n\nHmmm yeah how dare we actually not be ok with China's currency manipulation, trade deficit, IP stealing etc.\n\nDefinitely should just keep letting it happen.", "score": 1, "replies": [{"body": "They don’t pay us, but they pay the US companies that are part of the economy.", "score": 0, "replies": [{"body": "If by pay you mean steal from.\n\nIt's like you are a 3rd grader", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "So predictable.", "score": 1, "replies": [{"body": "Your entire argument is basically\n\n>shots hurt so we shouldn't get vaccines\n\nWhile mine is\n\n> shots hurt yes, but in the long run we will be better off.\n\nBut yeah it's about right for you to take the shortsided, retarded view.", "score": 0, "replies": [{"body": "Your original claim was that nobody would get hurt but China. I see you're walking that back now.", "score": 2, "replies": [{"body": "Wtf. Your reading comprehension as is your \"big picture,\" is shit", "score": 0, "replies": [{"body": "Lol, gotcha.", "score": 0, "replies": [{"body": "Yes let's continue to have to rely on an enemy country that manipulates their currency, nationalizes companies, has and continues to commit human rights atrocities, steals intellectual property, endorses fucking North Korea, and has engaged in economic warfare against us for more than a decade...\n\nAll so your dudes fucking bike holder is $9 cheaper.\n\nYa your perspective is right on.", "score": 0, "replies": [{"body": "I don't even know what you're talking about anymore, but I did get you to walk back from your original claim. And I predicted the gist of all your arguments.", "score": 0, "replies": [{"body": "You didn't do shit.\n\nFigures you would make false claims if you can't understand why both parties think the trade war had to happen", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "You sound like you're terrible at thinking logically.", "score": 1, "replies": []}]}]}, {"body": "I saw a special on the other day on how Vietnam is ramping up production exponentially and companies are moving there, among other Asian countries. The transition may be a little uncomfortable but not indefinite.  China is going to permanently lose a lot of these businesses to other countries, end of the day we will find another country to produce inexpensively.  I think your statement is pretty rational.   You are just getting downvoted cuz this is reddit, and orange man bad.", "score": 2, "replies": [{"body": "Thank you.\n\nThat is exactly what I'm saying. In the long run supporting Vietnam is better than supporting China.\n\nThe only real long term downside is the soybean industry will likely die out. Although farmers shifting crops is also doable and happens anyway to prevent soil depletion.", "score": 1, "replies": []}]}, {"body": "\\>You don't think industry will figure out how to make goods somewhere other than China to avoid tariffs?\n\nGlobal supply chains are easy to rebuild. /s", "score": 1, "replies": [{"body": "It's not that hard since major companies have **already** been shifting production", "score": -1, "replies": [{"body": "How many major companies vs the total number of companies in the USA?", "score": 0, "replies": [{"body": "How many major companies have had issues shifting manufacturing?\n\nHow many of those will be prevented from losing their intellectual property to China in the future? Some/most of which are restricted from export to enemy countries?\n\nWhy are you insistent on staying reliant on an enemy power who literally is waging economic warfare against us?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lol vapefag", "score": 0, "replies": []}]}]}]}]}]}, {"body": "This opinion is popular but is incredibly naive", "score": 0, "replies": [{"body": "You have provided zero evidence or even theory that makes continuing a gigantic trade deficit with an enemy good. (An enemy that steals IP no less)\n\nNot that you could", "score": 1, "replies": [{"body": "I had a pretty long reply typed out, but then I re-read your comment and I'm not even sure you realize what a trade deficit is or how tariffs work", "score": 0, "replies": [{"body": "You are a fucking dumbass that doesn't understand incentivizing production in places other than China and the advantages that entails.\n\nEdit: You are the same fucking idiot that thinks UBI is a good idea.\n\nGo take a few econ classes.", "score": 1, "replies": [{"body": "ahh yes, straight to the ad hominem insults. used to take you guys 3 or 4 posts to get there but i see we only need 2 now. and you even did the thing where you bring in another topic entirely (UBI) to try to distract from the one at hand. classic bro.\nprotectionism hasn't worked well since the 1800s. incentivizing production in other places may be ok and good for us in the mid term, but if that happens successfully and you were china... What would you do if you were china?", "score": 0, "replies": [{"body": "You have had two posts saying nothing so yep.\n\nLet's see \ntrade wars = economics\nUbi = economics\n\nYeah not at all related", "score": 1, "replies": [{"body": "Let's say the US redirects overseas production away from China. If you were China, what would you do?", "score": 0, "replies": [{"body": "Lets see. If I were China I would\n\n1. Try and make manufacturing more appealing\n2. Come to an agreement with the US\n3. Subsidize any losses via an agreement with the US with new manufacturing from other countries.\n\nTarrifs will take care of #1. Since the US is one of the largest economies in the world #2 and #3 will happen. There is no avoiding it.\n\nNo matter how you slice that it is a win for the US and a lot better than sticking our heads in the sand.\n\nNot sure what retardedness you were going for. Probably you were playing to say\n\n> they will manufacture for other countries\n\nYep but none have the same consumer market, disposable money, or beneficial exchange rate.", "score": 1, "replies": [{"body": "Actually I was going for something like they would use the world's largest banking sector and fastest growing consumer base to continue to chug along, albeit with a dip in growth, while they take time to move their manufacturing to countries the US does have agreements with, continue to suck up those profits across borders, invest in tech development at home, automation, AI/ML, etc, and aim to outcompete the US for global hegemony and the agglomeration effects that global influence has in a short-term pseudo-21st-century cold war, with the intent to eventually become THE global superpower.\n\nAside from that though, what motivation does China have at present day to move towards the US for any reason whatsoever? I would wager none. \n\nEveryone and their grandmother by this point knows the Trump strategy of using trade wars and tariffs to push the markets to the edge, get the Fed to lower rates for further cheap money, then announce a trade deal prior to the 2020 election so he can get a maximum bump in the markets and the polls. If you and I know this, we can be guaranteed that China knows this. I'd argue the market has even already priced this in -- this is a big reason why they are expecting future rate cuts. \n\nSo if you're China at present, why would you negotiate at all until right before the election? You'll have Trump bent over a table and have maximum leverage because time will be on your side. Trump will have no leverage because he'll want to do a deal to win his campaign. In this scenario it's not even a win-win for both countries. It's a win for China and the US gets whatever it gets.\n*edit: We can be assured that Trump will declare victory, though", "score": 0, "replies": [{"body": ">Actually I was going for something like they would use the world's largest banking sector and fastest growing consumer base to continue to chug along, albeit with a dip in growth, while they take time to move their manufacturing to countries the US does have agreements with, continue to suck up those profits across borders, invest in tech development at home, automation, AI/ML, etc, and aim to outcompete the US for global hegemony and the agglomeration effects that global influence has in a short-term pseudo-21st-century cold war, with the intent to eventually become THE global superpower.\n\n**LOL** So China is going to leave China and manufacture in other countries somehow keeping competitive advantages while having to deal with actual environmental laws, local taxes, without as much cheap labor, and with more worker protections in place. Oh and they are going to do all that while besting established local companies.\n\nYou are so full of shit, and your paragraph was buzzword bullshit. There is not a single ounce of economic theory in there. \n\n\n>Aside from that though, what motivation does China have at present day to move towards the US for any reason whatsoever? I would wager none. \n\n1. The US is the world currency\n2. The largest consumer economy\n3. Large disposable income\n\n**Just as I said before. But you don't bother reading**\n\n>Everyone and their grandmother by this point knows the Trump strategy of using trade wars and tariffs to push the markets to the edge, get the Fed to lower rates for further cheap money, then announce a trade deal prior to the 2020 election so he can get a maximum bump in the markets and the polls. If you and I know this, we can be guaranteed that China knows this. I'd argue the market has even already priced this in -- this is a big reason why they are expecting future rate cuts. \n\nYou aren't wrong. But you also act like the trade war is wrong. It's not, and it is necessary.\n\n>So if you're China at present, why would you negotiate at all until right before the election?\n\nBecause as they wait they lose more and more money from manufacturing loss.\n\n>You'll have Trump bent over a table and have maximum leverage because time will be on your side. \n\nNope. Once manufacturing has left China what leverage is there? Our economy will have continued on.\n\n>Trump will have no leverage because he'll want to do a deal to win his campaign.\n\nNope, alternate manufacturing established means no drop in market. Why make a shitty deal when it isn't needed?\n\n >In this scenario it's not even a win-win for both countries. It's a win for China and the US gets whatever it gets.\n>*edit: We can be assured that Trump will declare victory, though\n\nOh look the real reason you don't like the trade war.", "score": 2, "replies": [{"body": "Here have an upvote. i think you might need it more than me", "score": 0, "replies": [{"body": "What kind of dumbass thinks China's manufacturing can go to other countries and operate like they are in China and push out established local companies?\n\nOh yeah. You.", "score": 2, "replies": [{"body": "i upvoted you again", "score": 0, "replies": [{"body": "Aren't you special. \n\nBut then we knew that from your lack of understanding econ 101", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Why not stick to the question I'm asking you champ?", "score": 2, "replies": []}, {"body": " Art of the deal, art of the motherbluckin deal!!!", "score": 2, "replies": []}, {"body": "No wonder Gold skyrocketed. Good time to invest in IAU?", "score": 2, "replies": []}, {"body": "Seems like a convenient time for ted cruz to preach about needing a tax break on capital gains", "score": 1, "replies": []}, {"body": "Will we keep seeing a dip in the market after the sanctions announcements or do you expect a rebound?", "score": 1, "replies": []}, {"body": "Honestly, week after week I'm expecting my wins to drop again. Because Trump decides his bipolarity hasn't had it's thirst quenched yet.", "score": 1, "replies": []}, {"body": "Apple shorts anyone?", "score": 1, "replies": []}, {"body": "Double down Donny", "score": 1, "replies": []}, {"body": "As the days go on, I start to think that he’s doing this purposely so when he is no longer president, he can blame the recession on the next guy..", "score": 1, "replies": []}, {"body": "I’m convinced he’s just pushing the Fed to the brink to get them to cut rates more aggressively, then he will end the deal and use the pop to get an election win.", "score": 1, "replies": [{"body": "this is without a doubt his plan. that and to get rich in the meantime", "score": 1, "replies": []}]}, {"body": "Smart move. Fuck China. They are moments away from being eradicated via nuclear warfare if they don't respect Uncle Sam.", "score": 0, "replies": [{"body": "Calm down Bolton.", "score": 3, "replies": [{"body": "Ok", "score": 1, "replies": []}]}]}]}
{"title": "Tariff man strikes again - Trump says U.S. to hit $300 billion worth of Chinese goods with 10% tariff", "selftext": "[https://finance.yahoo.com/news/trump-says-u-hit-300-173338887.html](https://finance.yahoo.com/news/trump-says-u-hit-300-173338887.html)\n\n&#x200B;\n\nMarket reacting badly immediately after the tweet.  S&P and DOW dropping \\~1.5%+", "id": "ckrnvn", "created_utc": 1564681467.0, "score": 588, "upvote_ratio": 0.96, "num_comments": 228, "comments": [{"body": "*laughs in poorly timed call purchases*", "score": 355, "replies": [{"body": "You and me both. Thought I was safe after the bounce after fed rates yesterday", "score": 50, "replies": [{"body": "My quick BA scalp worked wonderfully said no one ever.", "score": 12, "replies": [{"body": "it woulda worked if he'd just cut rates and effectively said nothing.  the problem was he opened his mouth", "score": -3, "replies": []}]}, {"body": "Bruh, I was SO damn sure too. Naturally, I bought several AMD calls like an hour before the tweet.", "score": 12, "replies": [{"body": "Not just a few, I purchased more AMD calls today than I ever had in the past (a big number for me). It's my luck. I'm not losing hope though. I'm good on to these for 3 weeks and see. It can come back up in that time for sure.", "score": 6, "replies": [{"body": "sorry. but you're just a gambler. there is simply no math, or valuation basis to your play here.  what possibly is your reasoning behind this play? momentum?  you might as well throw darts at a board.  just curious, will you vote Trump in next election?", "score": 6, "replies": [{"body": "You haven't done any DD on AMD before posting this reply have you...", "score": 4, "replies": [{"body": "me? i don't own them", "score": 1, "replies": []}, {"body": "Don't waste your time, look at his profile, this kid gets off on debating everything.", "score": 1, "replies": []}]}, {"body": "I will NEVER vote for trump. I had calls to begin with. After the tariff news, I doubled down as the stock suddenly got cheaper - and it was climbing back up. Everything was bouncing back. Yeah there's a level of gambling with options and if you say otherwise, you sir are a bold face liar, you MAGA hat wearing soggy sandwich.", "score": -2, "replies": [{"body": "options are mathematical. do you even know the 6 variables in their pricing?", "score": 1, "replies": [{"body": "> the 6 variables in their pricing\n\ni never buy options with more than 4 digits :/", "score": 1, "replies": []}]}]}]}, {"body": "Yea same, we’ll be fine!", "score": 1, "replies": []}]}]}]}, {"body": "Always set limit orders. Sadly, it's a lesson that I've had to learn too many times.", "score": 3, "replies": [{"body": "*Cries in PDT*", "score": 2, "replies": [{"body": "Get a cash account you degen", "score": 1, "replies": [{"body": "I'll bet they use Robinhood which still has PDT on cash accounts because it sucks", "score": 1, "replies": [{"body": "No it doesnt", "score": 1, "replies": [{"body": "Oh, I should have specified. It does if you have options trading enabled, not just stocks", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Since when did this sub turn to /wsb?", "score": -6, "replies": []}]}, {"body": "Oh. I was having a good day...", "score": 279, "replies": [{"body": "I was having a great day, and now I’m neck deep in the toilet lol\n\nEdit: 2.6% (of portfolio) downward swing and counting... fml\n\nEdit 2: final count– ~~1.32%~~ 1.63% down from open, ~~2.54%~~ 2.85% down from daily peak lmao", "score": 94, "replies": [{"body": "Deep breath and a scotch, my friend", "score": 30, "replies": [{"body": "I’m not mad, I’m just disappointed", "score": 14, "replies": [{"body": "_________", "score": 13, "replies": [{"body": "It ain’t my first rodeo tbf, just my least expected one", "score": 2, "replies": [{"body": "_______", "score": 1, "replies": []}, {"body": "Ah so you were just being dramatic", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I was up $1,650. I closed up $11", "score": 15, "replies": [{"body": "Up $1900 down $3k. Fuckin orange man.", "score": 2, "replies": []}, {"body": "Up 1600 now - 1500..... Let’s make a toast for the douchebags smh", "score": 1, "replies": []}]}, {"body": "I was just having a day, now it's another one of those days. Long TSLA", "score": 5, "replies": []}, {"body": "It was going so well :(", "score": 3, "replies": []}, {"body": "My portfolio went from up $60 to $4...", "score": 7, "replies": []}, {"body": "I was up 3%, I finished down .5%. 🤷‍♂️", "score": 2, "replies": []}, {"body": "I'm down about 3.5% over the past week due to his multitude of stupid decisions. Ugh.", "score": 1, "replies": []}]}, {"body": "cries in AMD", "score": 91, "replies": [{"body": "Why? Time to buy more AMD and hold for a year", "score": 40, "replies": [{"body": "Yesterday was a 10% drop. \n\nWas up +3.5% until trump announcement.\n\nThen down to - 4.1%.\n\nThose are huge movements.", "score": 25, "replies": [{"body": "Are you new to AMD ? There’s a reason it’s a literal god tier meme on WallStreetbets", "score": 28, "replies": [{"body": "/r/ayymd", "score": 10, "replies": []}]}]}]}, {"body": "Same...same. Guess we hold til next year and pray", "score": 5, "replies": []}, {"body": "Muh AMD calls 😭", "score": 2, "replies": []}, {"body": "I got in a 29.80\n\n&#x200B;\n\nI'm happy boy", "score": 2, "replies": [{"body": "Came here to brag about getting in at 22.12. 3 shares, but hey, it’s something.", "score": 4, "replies": []}, {"body": "im in at \\~$4, not very many but im still holding because reasons", "score": 2, "replies": []}, {"body": "Until it drops to 25", "score": -2, "replies": [{"body": "If it drops to 25 i'll buy more!", "score": 9, "replies": []}]}]}, {"body": "I regretted selling today until now", "score": 1, "replies": [{"body": "I sold today for a decent gain, thinking I'll hop back in Monday.", "score": 1, "replies": [{"body": "That’s my plan too. I only sold today because of a gut feeling it was gonna go down.", "score": 1, "replies": []}]}]}]}, {"body": "Here’s some tickers that don’t give a damn and are in the green:  MSFT, T, VZ.", "score": 59, "replies": [{"body": "T and VZ make sense since they don't depend on Chinese imports.  MSFT might be affected by Chinese retaliation but no one cares about Surface products when valuing MSFT anyway.", "score": 14, "replies": []}, {"body": "JNJ", "score": 3, "replies": [{"body": "SBUX, SQ (earnings after close.)", "score": 4, "replies": [{"body": "Sq doing its regularly scheduled battering after payment volume doesn't please", "score": 6, "replies": []}]}]}, {"body": "SPWR!! Solid earnings yesterday", "score": 3, "replies": []}, {"body": "V, MA", "score": 2, "replies": []}, {"body": "Don’t forget $MO", "score": 1, "replies": [{"body": "I love big MO, div plus I got in at 17", "score": 5, "replies": [{"body": "so im a bit new to playing in dividends.  it says it paid out .8 each quarter, does that mean for every share you have you get 80 cents?  and is that in cash or in more stock?", "score": 1, "replies": [{"body": "You get $.80 for each stock. It’s deposited to your stock account as cash. Some trade platforms, e.g. M1, can be set up so that all of your dividends are immediately reinvested into more shares of the stock. Others, e.g. RobinHood, will only be deposited as cash and you can manually purchase more shares if you so choose.", "score": 1, "replies": [{"body": "one more quick question, does that pay out count as capital gains as if i sold a stock?", "score": 1, "replies": [{"body": "Dividends count as part of annual income and are taxed at your normal rate, independent of the stocks you hold that generated the dividend.", "score": 1, "replies": [{"body": "so theoretically if i grabbed $50k of $MO and they maintained $.8 dividends i would make an extra $3200 a year?\n\njesus christ i need to stop being afraid of the stock market", "score": 2, "replies": [{"body": "If you can afford to sit on $50k and pay the tax difference, yes. Most people can’t afford to just leave $50k alone, and if you have that much money that you can just sit on, then $3k is probably not that much money to you anyways. This income is completely passively gained however, so it’s totally worth it if you can afford to invest. \n\nNote that there are risks involved though, so it’s not always upside. If the value of the stock drops by ~6%, roughly your annual dividend payout with regards to $MO, then you didn’t make any money, you essentially converted a portion of your $50k to taxable income. In the worst case scenario where $MO declares bankruptcy, you’ll lose all $50k. Making a few grand ‘for free’ sounds great until you lose 10x that amount...\n\nThat said, there are options that are considered safe. Microsoft, Disney, Coca-Cola, for example, are all considered blue-chip stocks that will likely grow over time and also pay out a dividend. So if you threw in $50k to Microsoft, a year from now that $50k might grow into $52k, and in the meanwhile you’ll earn another ~$1k in dividend. Safer companies tend to pay smaller dividends, but you get the comfort in knowing that Microsoft is unlikely to blow up anytime soon. \n\nRegardless, investing into stocks is usually considered a better option long-term than other vehicles such as treasury bonds, or god forbid, just leaving your money in the bank. This is because annual inflation will eat away at the value of your principal. Assuming the usual pace of about ~2.2% annual inflation, treasury bonds will keep your $50k roughly where it’s at over time in actual buying power. Money in the bank will slowly lose buying power via inflation. Historically, money in stocks will net you about ~7% gains annually, so if you can park money there you’ll come out with more buying power over time. \n\nThe key is to be patient and do your due diligence. Temporary losses are okay so long as the underlying companies are strong. People lose money most often because they panic sell whenever they see a dip. This is buying high and selling low, which is the opposite of what you’re supposed to do. Instead, research companies that you feel comfortable parking money with, such as the giants I mentioned above. You could also buy shares of an ETF, which are funds that derive their values from holding onto stocks of many companies. $VOO and $SPY are some good options. They are indexed to large companies across many industries, so they are generally safe and historically profitable long-term. And because they are not dependent on one particular company, they tend to be quite resistant to things like bankruptcies or bad news of any single player. Note however that because they are indexed to the economy as a whole, ETFs tend to drop in price during recessions. So if you invest while the market is high and it goes down next month, your principal will drop. But as long as the market recovers (which it always has, given enough time), you’ll eventually get back to your initial investment and then some.", "score": 2, "replies": [{"body": ">  People lose money most often because they panic sell whenever they see a dip.\n\ndude, thanks so much for writing this all out, im going to go over it a few times, but in the mean time the above quote hits a nerve with me.  back in i think like 06/07 before the crash i had some money i was playing with in the market, it was only like $3k or so, but the dread i felt when my stocks would go down and the fear, caused me to panic sell.  sure as shit, complete absolute failure.  i need to get over this before i start dropping cash back in, \n\nas far as what im sitting on yeah, its all in a 2% bank account for the last 8 months or so.....", "score": 1, "replies": [{"body": "Glad I could help :-)\n\nHonestly, 2% is a solid rate for a savings account. One thing I didn’t touch on is that cash does have some advantages. For one, the federal government insures your bank account up to a certain amount ($250k if I remembered right). You get zero insurance in a stock market. Another advantage is that cash is ultimately super liquid. You can withdraw from your bank account anytime. You can’t withdraw from the stock market as quickly. You have to sell, and then wait for the money to settle, and then wait for the money to transfer. Overall, it takes about 1-2 weeks to go from stock account to personal bank account. Many people can’t afford to wait that long in cases of emergency, so I wouldn’t recommend stock investing until the individual has a rainy day fund first. \n\nThe fear of loss is really strong, so I would take comfort in knowing that you are not alone. There are certainly times where you want to sell at a loss (you should incorporate some sort of annual evaluation period where you strategically exit from stocks that aren’t looking good for the foreseeable future). For the day-to-day though, you want to do as little fidgeting as possible, and #trusttheprocess. I personally have ~5% of my portfolio in penny stocks, so that I can satisfy that need for activity, and if it all blows up I’ll miss the money but not overly so. The rest I leave alone, parked in ‘safe’ places where long-term growth can be reasonably expected. Maybe this could work for you.", "score": 1, "replies": [{"body": ">I personally have ~5% of my portfolio in penny stocks, so that I can satisfy that need for activity\n\nThats a good idea.  when i was playing with $3k I was overtly active with it, and i enjoyed the rush and the fun of it, but it was also like half my savings.  im on a bit of a different level now", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "$OXY", "score": 1, "replies": []}, {"body": "One out three aint bad. Go VZ!", "score": 1, "replies": []}, {"body": "CLDR just off in its own world.", "score": 1, "replies": []}, {"body": "ATVI, surprisingly. Had its best day since November 2018 after trading flat since then.", "score": 1, "replies": []}, {"body": "MSFT might have something to do with the announcement of them snagging Ninja from twitch", "score": -1, "replies": []}]}, {"body": "I bet Trump bought a shit ton of SPY put before sending that tweet \n\nMan what would I give to have the power to swing the market up or down 2% with less than 280 characters", "score": 151, "replies": [{"body": ">SPY\n\nOr $VIX", "score": 45, "replies": [{"body": "Someone purchased 47K $VIX August 21st 20Cs for .50 around noon today.\n\nBy 3pm they were worth 1.50 each.\n\nEdit: $2.1M buy. Worth over $5M now.", "score": 52, "replies": [{"body": "So a profit of $4.7M... 😔", "score": 25, "replies": [{"body": "I dont see the sell side of the trade so I couldn't tell you if they made that profit or not. They were worth about 1.20 at close. Either way it was one hell of a play.", "score": 6, "replies": [{"body": "Whoever bought that and hasn't sold it yet is a moron. Unless they know more garbage tweets are coming tomorrow.", "score": 7, "replies": []}]}, {"body": "Thats exactly what he did in the 80s.\nHe is such a piece of shit that people forget all the criminal stuff he did in his life.\n\nhttps://theweek.com/speedreads/840126/trump-might-have-reportedly-illegally-manipulated-market-80s", "score": 19, "replies": [{"body": "\"*MIGHT* have *REPORTEDLY*\" manipulated market in the 80s - turns into \"That's exactly what he did in the 80s.\" \n\nGood times. We talk about this before...but we're just small fry in here trying to play in the oceans full of sharks. We with our measly hundreds are hoping to play fairly in a game where people have several orders of magnitude more capital. What manipulation looks like to us, is just a regular day in the office of buys and sells. \n\nThen WE try to play options to level the table a little bit...to act like we have millions with our small stack of dollars, and forget, they can do just the same and the table was never level to begin with.", "score": 18, "replies": []}, {"body": "K", "score": -1, "replies": []}]}]}]}, {"body": "Manipulation at it's finest", "score": 7, "replies": []}]}, {"body": "Guess it’s time to get in on some $300 SPY calls and ride the wave!", "score": 7, "replies": [{"body": "Pretty much. When’s the next China talk scheduled?", "score": 1, "replies": []}, {"body": "Too early", "score": 1, "replies": []}]}, {"body": "Is he allowed to play the market?", "score": 5, "replies": [{"body": "He’s allowed to do anything if no one stops him", "score": 68, "replies": []}, {"body": "His investments went into a blind trust when he became president. That blind trust is run by his kids. Surely they never talk about the market implications of his button mashing beforehand.../s", "score": 37, "replies": [{"body": "The only thing blind about that trust is the oversight on it by Congress and the American public.", "score": 12, "replies": []}, {"body": "I heard him and his kids were trading secrets on club penguin and that’s why it was shit down", "score": 6, "replies": []}]}, {"body": "The president and congress are more or less immune from insider trading. The only accountability is the extent that their constituents care.", "score": 4, "replies": []}]}, {"body": "member when 50 cent got in trouble for this.", "score": 4, "replies": []}, {"body": "Can a president be convicted of insider trading?  Would that even be insider trading?  Confusing", "score": 1, "replies": [{"body": "Congressman and the President insider trade was made illegal in 2013 by Obama(it was legal before).  However, if no one enforces the law, it doesn't matter.  The president does control the attorney general.", "score": 4, "replies": [{"body": "Didn't the Republicans reverse that as soon as they could?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "With how easily he can influence the market, Trump ain't longing anything. \n\nHe's just going to YOLO 100% all in on calls, tweet something good, make mad money, then YOLO all in on puts, tweet something bad, make mad money, rinse and repeat for the duration of his presidency.", "score": 4, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "He's obviously not going to use his own account", "score": 1, "replies": []}]}]}]}, {"body": "Excuse my ignorance, but why would that be beneficial? Didn’t SPY drop since making that tweet?", "score": 0, "replies": [{"body": "He said SPY puts, not calls", "score": 3, "replies": []}, {"body": "\\>Trump buys SPY puts\n\nTweets about more tariffs, GYNA bad etc etc.\n\nSPY goes down, Trump sell puts for huge gainz\n\nconversely\n\n&#x200B;\n\n\\>Trump buys SPY calls\n\nTweets about trade talk making progress etc\n\nSPY goes up, Trump sell calls for huge gainz\n\n&#x200B;\n\nRinse & Repeat", "score": 0, "replies": [{"body": "Ah I guess I need to look into what a “put” is - thanks for the info", "score": 1, "replies": [{"body": "No problem, just beware that calls and put options are essentially just gambling unless you can single handedly make the market go in the direction you want for a short duration like trump can", "score": 1, "replies": [{"body": "Or you have some sort of special insight into how a given company or the whole market will behave, either due to insider trading or some really good investigative work.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Y'all better get into the bandwagon in swing trading TQQQ! The whole tech sector crashes every time he slaps new tariffs on China!", "score": 34, "replies": [{"body": "Just bought this morning at $67 or so and thought I was making a quick buck...", "score": 8, "replies": [{"body": "I usually by in at $58-60ish. Average down once it gets in the 50s again!", "score": 3, "replies": [{"body": "I can't complain too much. I bought in at $38 earlier this year and sold at $58 then bought at $52 and sold at $64. My dumbass thought buying in at $67 was a good idea today though.. It's hard to sit on cash for a while.", "score": 1, "replies": []}]}]}, {"body": "QQQ-Q", "score": 1, "replies": []}]}, {"body": "My BABA 😂", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I’m planning on staying 10-15 years though. Probably won’t invest in China again for a while though.", "score": 1, "replies": []}]}]}, {"body": "Good time to buy?", "score": 6, "replies": [{"body": "Great time to buy, IMO. Pfizer just hit a 52-week low. I’m dumping funds into US-based ETF’s as much as possible right now.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 30, "replies": [{"body": "Not just him, but everyone around him too, it's a good time to be a crony capitalist.", "score": 3, "replies": []}, {"body": "Some aapl puts shot up like 300 percent.  Started off at like 6 bucks closed near 70", "score": 1, "replies": []}]}, {"body": "RIP", "score": 4, "replies": []}, {"body": "Someone wants another rate cut", "score": 5, "replies": []}, {"body": "[removed]", "score": 27, "replies": [{"body": "how? he doesn't have control of his investments", "score": -26, "replies": [{"body": "His sons do....", "score": 37, "replies": [{"body": "Exactly. Tell ivanka's third cousin that lives in timbuktu that he is going to tweet. Cousin buys put's / shorts the market. Reap in the cash.", "score": 15, "replies": []}]}]}]}, {"body": "i was wondering why all my [puts](https://i.imgur.com/UKZEx0K.png) hit their sell limits seemingly simultaneously. made over $1300 this morning. thank you trump!", "score": 23, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "The call is the option he purchased, the date is the exercise date. Look up investopedia and read up on options to understand what those terms mean.", "score": 4, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "I mean it literally can’t go tits up.", "score": 2, "replies": []}, {"body": "WSB checking in. Can't go tits up, ever.", "score": 2, "replies": []}]}]}, {"body": "i bought calls earlier in the day for $4.10 and set a sell limit for $4.90. sometime during the day the calls became worth a $4.90 premium and the sell order was executed. it's just daytrading. but i made $1350 today and will make a lot more tomorrow with my ETSY puts.\n\nthe dates are like \"use by\" dates, and the 150.00 is the exercise price", "score": 1, "replies": []}]}, {"body": "Are you hedging your account or are those plays?", "score": 1, "replies": [{"body": "day trades", "score": 2, "replies": [{"body": "Nice - Thats a lot of positions to track", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Long glw", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Nice I too plan to restablishing my position one day for that yung drip", "score": 1, "replies": []}]}]}]}, {"body": "Time for our businesses to start looking elsewhere for the production of goods. India, Taiwan, Japan, Singapore, Thailand. Maybe even certain Africa countries want in.", "score": 7, "replies": [{"body": "Our businesses actually care more about the market. Which is stupid, considering China not only declared very clearly how they will protect and create homegrown supply/demand, they've actually blatantly done it for 2 decades now.", "score": 2, "replies": [{"body": "That's what every industrialized nation has done.", "score": 0, "replies": []}]}]}, {"body": "A reminder to everyone, please focus on how this is going to affect a specific stock or the stock market in general.\n\nIf your comment is pushing political agendas, memes, insults, trolling, etc then your comment is going to get removed and/or get you banned.\n\nIf you *have* to discuss just the politics, then post this topic to r/PoliticalDiscussion without linking back to r/stocks, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Honestly at this point any time there are China talks you should just expect him and his administration to fuck it up.", "score": 19, "replies": [{"body": "> Honestly at this point ~~any time there are China talks~~ you should just expect him and his administration to fuck it up.\n\n\nFTFY", "score": 22, "replies": []}, {"body": "[deleted]", "score": -9, "replies": [{"body": "He bends over for Russia, Saudi Arabia, and North Korea.", "score": 11, "replies": []}, {"body": "Dude is a fucking joke", "score": 5, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "Seems like you're a joke too.", "score": 3, "replies": []}]}]}, {"body": "Are you joking or serious? I can't tell. On one hand, I don't see a sarcasm tag so I think you're serious. On the other hand, I think no one is that stupid, so I think you're kidding...then I remember we have a moron for a President and I swing back around to you being serious. I can't take this rollercoaster of emotion.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Oh my god you guys, he's actually insane.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tariff man allowed me to buy AMD below 30\n\n&#x200B;\n\nTariff man 2020", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "He's not hardballing China because of his campaign, he just everyone to have discounts on securities! Right?", "score": 0, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Especially with rate cuts. Market was hella green before 45 tweeted, so once tarriff noise is done it will continue rising", "score": 3, "replies": []}]}]}]}]}, {"body": "I’m staying in for ten years", "score": 2, "replies": []}, {"body": "That’s going to make those $1000 iPhones a bit more spendy!", "score": 2, "replies": [{"body": "Oh no how will we ever survive", "score": 1, "replies": []}]}, {"body": "Great. We need to get tough on china", "score": 7, "replies": [{"body": "By ~~imposing tariffs they will pay for!~~ punching ourselves in the balls repeatedly.", "score": 1, "replies": [{"body": "Sometimes you have to take the hard road. Yes it would be easier and cheaper to let China abuse the US forever but eventually a politician needs to stop it. One who’s not afraid of the backlash when it hurts in the short term. Is Trump that President? Who knows.", "score": 4, "replies": [{"body": "Is it that though? Or is it a blatant attempt to force more rate cuts, to try to boost economic hopes for 2020? \n\nCreate crisis -> provide solution -> claim 100% credit for fixing everything.  Seems to be his mantra so far.", "score": 0, "replies": [{"body": "I think that's completely unfair. While running for president he said exactly what he was going to do in regards to china. Hell, you can watch clips on YouTube of him saying the same exact thing 20 years go.", "score": 4, "replies": []}, {"body": "Wow thats such a dumb argument. You're forcing it. He's always been tough on China even before the election. Give the man some credit. No other candidate would have had the balls to go this route in fear of economic collapse and backlash", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Lets see them call those treasuries in.... =)", "score": 1, "replies": [{"body": "Yeah, they definitely won't. It'd probably hurt them more than the US.", "score": 2, "replies": []}]}, {"body": ">they hold enough treasuries to stagnate the American economy\n\nthis is fake news that has to stop\n\nthey own at most 5% of our debt", "score": 1, "replies": []}]}, {"body": "You know terriffs cost the domestic economy much more than it gains. Basically, you are putting a few hundred thousand into the pockets of the largest competitors in the industry you are propping up at the cost of raising prices on all goods in that industry for all citizens. This creates a deadweight loss to society.\n\nIt also encourages what is called rent seeking, where a large market player can make investment gains by lobbying to keep or expand terriffs instead of investing to improve the competitiveness of the business overall. Thus, exasterbating the problem mentioned in the first paragraph.", "score": -2, "replies": [{"body": "You’re a short term thinker.", "score": 3, "replies": [{"body": "Except that the problems I pointed out (especially due to rent seeking) can have ripple effects into future decades. We all benefit from competitive markets. Why prop up failing businesses in the short term at the expense of the entire domestic economy?", "score": 1, "replies": [{"body": "That’s nonsense. You’re omitting the effects of long term artificial trade imbalances and the cost of China’s rampant theft of intellectual property, a main reason for the tariffs.\n\nThese tariffs are short term pain for long term gain.", "score": 2, "replies": [{"body": "IP theft is inevitable when it comes to applying ancient patent law to modern technology. Patent reform is necessary if you really want to improve situations like this and patent trolling. After all, people are getting massive royalties for things like, \"screens with rounded edges\" and \"____ but on the Internet\". If the IP issue is severe enough, why not institute full sanctions?\n\nAs for artificial trade imbalances with China, this has been a problem since before the Opium Wars. Do you really think if the last century and a half of terriffs didn't fix the problem that Trump's will? \n\nNot to accuse you of being partisan, but did you support Obama's infamous tire terriffs? I bring them up because I didn't support them either. Terriffs are dumb.", "score": 0, "replies": [{"body": ">IP theft is inevitable \n\n[mei banfa?](https://www.youtube.com/watch?v=oxP2fAqamZQ)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Maga dropping like a rock", "score": 3, "replies": []}, {"body": "Trump and his usual bullying... *Ahem* I mean \"negotiation\" tactic: continue to stab yourself in the back thinking you're stabbing the other guy while proudly saying, \"Hey, I want to negotiate too but you're making me do this.\"\n\nWhat a buffoon. Americans end up paying this tariff. If Trump is so confident that ramping up tariffs applies pressure to the Chinese, why not just drop the hammer and get this over with: 100% tariffs on Chinese goods. Then we'll see who's really hurting more.", "score": -8, "replies": [{"body": "I mean I don't like tariffs but \"bullying\" China, lmfao wtf 😂. You do know what China has been doing internationally for the last 40 years right?", "score": 39, "replies": [{"body": "I think the point is that Trump doesn't know how to actually conduct foreign diplomacy and instead reacts by attempting to \"bully\".. which is what the tariffs are.", "score": 10, "replies": [{"body": "Yeah because everyone else’s foreign policy towards China before Trump had been so effective. This is what I find funny, as I believed the disaster scenarios about tariffs and the sanctimonious attitude we must adhere to... and then Trump proved that mindset wrong. That orange buffoon showed me that I believed the lies and hysteria. \n\nYou know this isn’t the first Trump has announced tariffs right? The market drops because of algorithms tied to twitter feeds, everyone acts like it’s the end of the world, and then the market recovers shortly thereafter.", "score": 12, "replies": [{"body": "can you further explain why its been effective? I'm not snapping back, I would just like to know", "score": 1, "replies": [{"body": "It works because China's whole game is currency manipulation. They buy the US dollar making it strong while simultaneously printing the Yuan to keep it undervalued. This way, they remain an export oriented state because of their weak currency while the US stays import oriented with our strong currency. \n\nThis is what most people aren't getting: putting tariffs in place isn't about making the US more money, it is about nullifying China's biggest tactic. If China's currency doesn't appear as weak, i.e. \"cheap\", to US consumers our market won't import from them.", "score": 3, "replies": []}, {"body": "Because it’s gotten China to the table. Everyone on both sides of the aisle admits they’ve been trade cheats and stolen IP. No one has been able to hold them accountable. It’s better than bending over and doing absolutely nothing. \n\nNow they might wait out Trump and get a patsy in there in 2025, or even 2020 because anyone with half a brain knows they are going to meddle in 2020 to get someone they own like Biden in there, but at least the current administration is doing something. I have faith in Lighthizer at the very least. Maybe I’m wrong, but I don’t think so.", "score": 8, "replies": [{"body": "Thanks!", "score": 5, "replies": []}, {"body": "Trump is literally walking on a thread. Your correct, though. The only way to bring China to the negotiating table is to leverage the United States's buying power. There will be consequences if China continues to drag this out. Even if China could install a new leader in 2020; the tariffs placed by the Trump adminstration will do significant damage to both economies within 2 years.\n\nWill this risk pay off? Will China bend? Will the tariffs tigger a recession?", "score": 3, "replies": [{"body": "Given that Chuck Schumer came out and supported Trump on this round of tariffs, I think China will have to bend.", "score": 2, "replies": []}]}, {"body": "> It’s better than bending over and doing absolutely nothing.\n\nThis is blatently incorrect. Terriffs cost the domestic economy much more than it gains.", "score": 1, "replies": [{"body": "Lolz.", "score": 2, "replies": []}]}]}]}]}, {"body": "So what's the acceptable procedure to you? Lying like China?", "score": 7, "replies": []}]}]}, {"body": "True.\nAnd after all this, Trump still thinks we're \"winning\". \nUnless a deal is reached, no side is winning.\nAmericans pay more for goods, Chinese lose business.\nAttempting to coerce China into a trade deal just won't work and China isn't showing any signs of giving in.", "score": 3, "replies": [{"body": "Tarrifs make Chinese products less competitive.  Gives opportunity to others to fill in the gaps.  Lessening our dependency on Chinese goods isn't a bad thing. We should be grateful to pull the Chinese dick out of our collective asshole.", "score": 6, "replies": []}, {"body": ">China isn't showing any signs of giving in.\n\nthey're already feeding pigs to other pigs and look how that turned out. wait till they're forced to start eating each other", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": ">Under Trump, the Chinese economy is getting bigger and growing faster\n\nHmmm \n\nhttps://www.statista.com/statistics/263616/gross-domestic-product-gdp-growth-rate-in-china/", "score": 3, "replies": []}, {"body": "You mean the country that manipulates its currency is doing better? If only they releases their books so that it could be independently verified...", "score": 2, "replies": []}, {"body": "no ty", "score": -2, "replies": []}]}]}]}]}, {"body": "Looking for some deals!!!!!!!", "score": 1, "replies": []}, {"body": "RIP LK", "score": 1, "replies": []}, {"body": "Will we keep seeing a dip in the market after the sanctions announcements or do you expect a rebound?", "score": 1, "replies": [{"body": "No rebound until Fed cuts rates further or Trump brings solid evidence of a trade agreement being worked.", "score": 1, "replies": []}]}, {"body": "I lost my first few hundred dollars I ever made on the stock market 😭 because of this shit.", "score": 1, "replies": []}, {"body": "I sold too early yesterday now im glad", "score": 1, "replies": []}, {"body": "Clearly expected.\n\n\" One also can not forget about the ongoing trade war between U.S. and China. Despite temporary looser rhetoric, President Trump said this week that he is able to impose further duties on imports from China, if necessary. \"\n\n [https://independenttrader.org/positive-moods-on-the-stock-market.html](https://independenttrader.org/positive-moods-on-the-stock-market.html)", "score": 1, "replies": []}, {"body": "The past 2.5 years have been record-breaking for the stock market. Y’all never satisfied.", "score": 1, "replies": [{"body": "Loose monetary policy", "score": 1, "replies": []}]}, {"body": "I was making almost $3k on a swing trade yesterday and thought sky was the limit. Then the tweet came... well... At least i had some premonition and sey a stop loss almost equal to my original buying price.\nI mean how are we supposed to trade when he can tweet anytime whatever he wants? Hard to predict that....", "score": 1, "replies": []}, {"body": "So glad I sold my AMD calls yesterday", "score": 1, "replies": []}, {"body": "Trump definitely wants the Fed to cut rates even further.", "score": 1, "replies": []}, {"body": "can anyone send me a tutorial to place options in robinhood ?  lol", "score": 1, "replies": []}, {"body": "Orange man has gone full retard. I am out of market till this settles.", "score": 0, "replies": [{"body": "Yeah, we should just allow other nations to economically rape us. Makes great sense.", "score": -3, "replies": [{"body": "*Laughs in 2 year stagnant market.* He killed the biggest economic boom in just 1 year, he really did run america like his businesses.", "score": 1, "replies": [{"body": "Let me know when you’ve taken your meds and returned to reality.", "score": 1, "replies": [{"body": "Do you own a movie theatre?  Because you seem to do a lot of projection.", "score": 1, "replies": []}]}]}]}]}, {"body": "i honestly think trump is the true market manipulator, in order to secure his next term presidency.", "score": 0, "replies": []}, {"body": "Edit: The person who posted this is a dumb ass", "score": 1, "replies": []}, {"body": "God damn it, Trump. What the hell makes you think putting tariffs on our single biggest trade partner is a good idea? Big surprise, the cost just ends up being shoved onto the end consumers (American citizens), harming the US economy. China barely even blinks.", "score": 1, "replies": []}, {"body": "when the markets are good is the only time it can be done", "score": 0, "replies": []}, {"body": "I was up a pretty good amount but now I’m losing everything because of these fucking tariffs. The markets were up last time I checked now the Dow  is -288 for the day.", "score": -1, "replies": []}, {"body": "Ya dumb fuck Trump. Stop this shit you're sending shit into a recession. See trucking spot rates for a good example", "score": -7, "replies": []}, {"body": "Once again not a single comment in here about stocks. My poor Baba was just recovering :(. I expect this to be another temporary swing and expect things to recover as usual like they always do.", "score": -7, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "People who care about short-term swings are fools not investors.", "score": -7, "replies": [{"body": "all this means is a buying opportunity. people want to be playmakers, not investors", "score": 1, "replies": []}]}]}]}, {"body": "(facepalm)", "score": -2, "replies": []}, {"body": "Who is voting TRUMP 2020 ?????", "score": -3, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - August 01, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "cklzv1", "created_utc": 1564651212.0, "score": 20, "upvote_ratio": 1.0, "num_comments": 201, "comments": [{"body": "Back in boring old Belgium... i noticed an interesting demand lever in action both in Portugal and on my way there and back: lots of Model 3s with foreign license plates heading to the south of Europe for vacation.  It’s quite reasonable to assume that many other drivers will notice this and quite a few of them will think “hmm, i guess range isn’t an issue at all with these cars”.  Add to that the fact that many of those people will have spent quite a lot on gas/diesel (especially in France, holy shit!) during their trip and i’ll bet it gets quite a few of them thinking...", "score": 13, "replies": [{"body": "2800km round trip, 182L of fuel when using 6.5l/100km, average price of 1.45 on the low end, well over €264 for the fuel costs alone ...\n\nA better route planner has the trip costing about €110 euros with 5 stops ...\n\nNow, when the first Dutchman tows a caravan to southern france with a Model 3, well then we know things are getting serious with EV's", "score": 5, "replies": [{"body": "I did about 6000 km's in total: 2K to get to Porto, then we gradually made our way south.  We rented 3 houses over a period of 14 days, each in a different region. We also did about 100km per day just to check out stuff within the region.  Then driving back from Faro was about 2500km. \n\nI have free supercharging, and for one of the houses we rented i left a 20 euro bill for the electricity i'd been using because it was an old cherry farm and I kind of felt guilty.  The other two houses where more luxurious so I just charged at the houses without leaving extra money (the pool filtering plus airco running nonstop would definitely use a lot more than the car, and that's all included in the price).  I have a Mobi.E card, which provides free access to slow chargers in Portugal (if there are any in the cities you visit... definitely differs from region to region).  So, the whole trip cost me 20 euro's in charging.  \n\nWith my old car (an Audi A5) i'd get around 800km per tank and one tank would typically cost me about 75 euros.  So for 6000km, that would mean i'd have to fill up 7.5 times at 75 euros a pop.  That would've cost me 562 euros.  And they say Tesla's are expensive! 🤷🏼‍♂️\n\nBut you can't just rely on Supercharging, so daily charging at your vacation house is required.  To give you an idea:\n\nhttps://i.imgur.com/ozlYk4X.jpg\nhttps://i.imgur.com/VC0GTg5.jpg\n\nEdit: i also found this on my car after having parked in a regular parking lot for a few hours:\nhttps://i.imgur.com/zDzVT8k.jpg", "score": 3, "replies": [{"body": "Love that heart...", "score": 2, "replies": [{"body": "Yeah me too, i actually felt a bit bad when i hosed it off today but the car was just too dirty 😅", "score": 2, "replies": []}]}]}]}, {"body": "Welcome back. Interesting theory. I am doing the same next month, given it is a new car and I have 7500 km free supercharging, it was a quick decision to do a roadtrip this year.", "score": 3, "replies": [{"body": "Enjoy it! If this is your first road trip, just follow the Tesla navigation charging stops.  After a while, you'll get a good feel on how accurate it is.\n\nIn my case (a 2017 Model S), the suggestions are way too pessimistic.  I can quite often easily skip a charger here or there, but I wouldn't recommend this unless you're very confident about what kind of consumption you'll get depending on the conditions of your next leg.  Play it safe for now, and 2 years from now you'll be making other decisions during your roadtrips with confidence ;)", "score": 3, "replies": []}]}, {"body": "Elon has said similar things since the Model S first came out. The best way to increase sales is to put a Tesla in the neighborhood. More Model 3’s driving around are the best possible advertisement the company has.", "score": 3, "replies": [{"body": "Tesla goes viral like a virtual meme, tho it is expensive hardware, it's quite impressive.", "score": 1, "replies": []}]}]}, {"body": "According to NASDAQ, Ark investment doubles their holding on TSLA.\n\n[ARK INVESTMENT MANAGEMENT LLC](https://www.nasdaq.com/quotes/institutional-portfolio/ark-investment-management-llc-909492) 06/30/2019 1,163,182 409,332 \n\nAn 54.30% increasing. These dudes are very aggressive on TSLA", "score": 22, "replies": [{"body": "Have to admit, they are putting the money where their mouth is", "score": 14, "replies": [{"body": "One of the few funds that can value innovation. They get so much flack from people who can't understand growth or how to value it. Ark is growing rapidly. They were founded in 2013 and already have $8B AUM.", "score": 2, "replies": []}]}, {"body": "Actually on their website they decreased from 6/30 to\n\n 792,438 as of 7/31\n\n&#x200B;\n\n [https://ark-funds.com/arkk](https://ark-funds.com/arkk)", "score": 2, "replies": [{"body": "Thanks for the update. I guess they sold a lot before earning call.", "score": 4, "replies": [{"body": "I've been tracking their trades and they haven't sold any Tesla for months. They have been buying a little here or there (190s and most recently 220s after Q2).", "score": 4, "replies": [{"body": "This dip is a really good entry point. However, the macro scares the shit out of me right now. I feel it might lead to a 2018 end of year sale again because of Trump.", "score": 1, "replies": [{"body": "“This dip”?  Its been above this level for 1 week of the past 3 mths.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Traveling abroad, went to bed when the market was super green, woke up to this red BS.  Wtf trump...  at least I used this opportunity to sell new puts at lower strikes...", "score": 10, "replies": []}, {"body": "[https://www.youtube.com/watch?v=qXRkjurXul8](https://www.youtube.com/watch?v=qXRkjurXul8) \n\nNewest Gigafactory 3 video, we can see the outside is already complete. This guy is doing a great job on monitoring Gigafactory shanghai's progress.", "score": 9, "replies": []}, {"body": "This is wonderful, I bought another 200 shares of Tesla this morning at approx. $241 each this morning and now this tariff thing has them at a much better price. Feels like I just got ripped off.", "score": 7, "replies": [{"body": "You bought 200 shares because you believe in the long term success of the company yes? Set your stop loss and close your eyes, 241 is not a bad entry point in the grand scheme of things.", "score": 9, "replies": [{"body": "I have no stop loss and never will on TSLA. I believe in the company and am holding long term but the fact that the stock plummeted only a few hours after I bought still hurts.", "score": 5, "replies": []}]}, {"body": "Sorry for your loss, but your in a lot better shape then a lot of the other baggies around here.", "score": 4, "replies": []}, {"body": "Thats why you break your trades into smaller amounts and buy as it falls. If you're certain about a stock and it's within your risk parameters, averaging down is a great strategy. If you buy all at once you're saying it will _never_ go below that price again. You can't time the bottom, but if you bottom fish with averaging down eventually you will hit the bottom.", "score": 5, "replies": [{"body": "You can’t predict the market.  If you could, you’d be a trillionaire.", "score": 1, "replies": []}]}, {"body": "I lost out on $50 buying some stock from a different company yesterday before the interest rate cut was announced. :( \n\nIt really sucks to end the day with your brand new shares down 2% in only a few hours.", "score": 1, "replies": []}]}, {"body": "[https://insideevs.com/news/362790/tesla-model-3-s-x-sales-july-2019/](https://insideevs.com/news/362790/tesla-model-3-s-x-sales-july-2019/)\n\nJuly estimate. Q3 is going to be E P I C!", "score": 12, "replies": [{"body": "3 is doing well for the first month of a quarter.", "score": 3, "replies": [{"body": "By this projection , they probably going to sell around 110000-115000 during Q3.\nEdit: 105000-110000", "score": 4, "replies": [{"body": "Hmm... idk I’ll have to think about that, that’s more a question about production capability\n\nThey don’t have near the surplus of inventory this quarter.\n\nThat’s an interesting question.", "score": 5, "replies": [{"body": "Agree with above. I think 100k-105k total vehicles more likely if production ramps. Otherwise, lucky to sell 95k again.", "score": 5, "replies": [{"body": "I'm still not sure where they get the increase of 15-20% from Fremont to hit 100k+. Would love any guidance from Elon and team about how production is trending", "score": 1, "replies": [{"body": "Q2 letter says they expect to hit 10k/wk S3X by EOY. And they were close to 7k/wk M3 at EOQ2.", "score": 3, "replies": [{"body": "I agree but 10k is only possible with GF3 and probably a December target.", "score": 1, "replies": []}]}, {"body": "Peak production capacity is currently about 115k (90+25) but they can't operate at peak for the whole quarter. They can probably churn out 95k-100k.", "score": 2, "replies": [{"body": "They produced 87k in Q2. 14.5k Model S/X and 72k Model 3. Highly unlikely they will even reach 100k production this q. It's more to do with pain shop limitations than production of the car itself. Unless they have expanded paint shop capacity it's unlikely that they can reach more than \\~93k production this quarter. Also, Elon has stated twice in the last 6 months that going forward deliveries will be lower than production.", "score": 1, "replies": [{"body": "We just had a record quarter in production in Q2. They didn't achieve production records in the first half of Q2, so the second half of Q2 was higher than the first half. 87k is the average for the whole quarter, but the run-rate in second half of Q2 is higher and continuing into Q3 allows them to generate more. For example, if they made over 35k cars in June, then there is a great chance they will make 95k-105k in Q3.", "score": 1, "replies": [{"body": "I think you're somewhat overoptimistic. Tesla's production has been stagnant at between 80k and 87k for the last 4 quarters. For them to increase to 100k+ would be a very large QoQ increase.\n\nWhat is leading you to believe they have produced 35k in July?", "score": 1, "replies": [{"body": ">*The production rate of Model 3 continued to improve gradually throughout the quarter, breaking a monthly record in May and then again in June. All manufacturing equipment in Fremont has demonstrated capability of a 7,000 Model 3 vehicles per week run rate, which we continue to work to  increase. We aim to produce 10,000 total vehicles of all models per week by the end of 2019.*  \n>  \n>*Q2'19 Letter*\n\nTheir guidance suggests that production is improving substantially. I think the above 10k capacity includes capacity out of GF3, but their comment still means they are able to produce 7k-8k total vehicles per week in Q3.\n\n>What is leading you to believe they have produced 35k in July?\n\nI'm not saying for certain, just as an example. It's plausible that they produced 35k in July.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Bigger question is whether production constraints lead to higher profit models selling.", "score": 1, "replies": [{"body": "From 10Q we should know the business model is never a problem. They are constantly improving margin in a excellent speed.", "score": 2, "replies": []}, {"body": "Well that’s what I would worry about, but not what the market probably cares about.\n\nI mean sales were up last quarter, and revenue was down compared to Q3 and Q4.\n\nI think not have a YoY decline in revenue is the importing thing this quarter. They need to sell 100,000+ cars to not have a YoY decline.", "score": 2, "replies": [{"body": "I'm not too concerned about the revenue even though it will definitely look bad. Tesla's story is transitioning into driving Model 3 unit volume. Model 3 PED is high, Model 3 margins increased in Q2, and once you account for one-time items we should see high growth in GP QoQ.", "score": 1, "replies": []}]}]}]}, {"body": "They need to get their production up then. Here’s to hoping", "score": 1, "replies": []}]}]}, {"body": "Starting strong considering:\n\n1. 1st month of quarter.\n2. After the insanity that was the Q2 June push.\n3. After yet another tax cliff.", "score": 4, "replies": [{"body": "Never a demand problem. It’s a production problem I think", "score": 1, "replies": []}]}, {"body": "\"The 13,450 is down a bit compared to the year-over-year figure from July 2018\" \n\nSo no its not going to be E P I C , if there are some concerns you gotta point it out. Stop living in a bubble.\n\nP.S - Before you'll start downvoting lemme tell you that I am a tesla long but i hate blind sensationalism like these posts, its not helping anyone.", "score": 5, "replies": [{"body": "Hold on a sec you're missing some context here:\n\n13450 vs 14250 so just \\~800 M3 difference... BUT let's not forget that 14250 number came in Q3 of last year where the M3 ramp had just gotten into full swing, eating into a large backlog of reservations. Not to mention with a full $7500 tax credit.\n\n>We should point out that if we're looking for a proper comparative set, then the first month of Q2 (April) is where we should put our focus. \n\nThe writer knows that comparing to April makes more sense. Let's not forget, april was Q2, aka the record delivery quarter. This beats the 1st month results even with a tax credit drop. Depending on how the production improvements are going, Q3 is very well on pace for another record.", "score": 3, "replies": []}, {"body": "I'll reply you in detail. In three country of Netherlands, Norway, Spain. The registration of Model 3 is 981, combination of Model X/S is 258. This is normal half of the sell of EU during the past data.  During Q3, there are already 3 ships that went to china. With conservative estimation, there wil be at least 1500 model 3 and 500 model X/S sold at china that july. Add them all together, the conservative estimation is around 16800 model 3 and 3200 Model X/S\n\nhttps://eu-evs.com/\n\nhttps://docs.google.com/spreadsheets/d/10Uh_GSkShwPPlrE5mOJcrkZ-T3NmLkLnTo6xqbdtaOI/htmlview\n\nFYI, I know what am i talking. Conisdering last time, i'm the few people in this sub hedge when it reach 260s.\nAnd again, I'm also the few person buying heavily around $178.", "score": 2, "replies": [{"body": "> I'll reply you in detail. In three country of Netherlands, Norway, Spain. The registration of Model 3 is 981, combination of Model X/S is 258.\n\nThe E-Tron is at 676 in those countries....\n\n> This is normal half of the sell of EU during the past data.\n\nActually it is pretty much in line with Q1 and Q2 this year.\n\n> Add them all together, the conservative estimation is around 16800 model 3 and 3200 Model X/S\n\nSo 20k total deliveries globally?  That is pretty good but will require another desperate scramble in September to get them around Q2's figures.", "score": 2, "replies": [{"body": "April is only around 16000-17000 globally.", "score": 2, "replies": [{"body": "Yeah, I think they should be able to match Q2.  The problem is they haven't unwound the \"wave\" which they claimed was increasing costs.", "score": 2, "replies": [{"body": "Man, I personally think you know everything before I speak it out...\n\nSince you have more data than I have.\n\nWish I can have access to the data from MS or GS", "score": 1, "replies": []}]}]}]}]}, {"body": "It is going to be EPIC!  the number from this year also comes with a large unknown number of international deliveries.", "score": 1, "replies": []}, {"body": "It is EPIC considering that many on the short side are betting that Q3 will be like Q1 rather than Q2. These numbers also ignore international Model 3 deliveries (which were zero in Q3/Q4 last year, excluding Canada). July is also \\~30% higher than April, the quarter in which Tesla reached record deliveries of \\~96k. \n\nI know you think the comment is blind sensationalism but Tesla reaching another record quarter of deliveries in Q3 would be material for the narrative and the stock. It would likely be closer to 200m GAAP loss (unless credits are high), with FCF of similar amounts to Q2 (+600m). This would really be the end of the BK thesis and the Tesla battle will have moved to valuation questions. This I'm fine with because it gives Tesla as much time as they need to execute, which in my opinion is all they need to win.", "score": 1, "replies": []}]}, {"body": "When I went out to lunch Tesla stock was up a half a percent or so, now it's down 0.8%, did this disappoint the stock market?!?\n\n13,000 Model 3 sales are great for the first month of a quarter, they even sold more S's and X's then 3 in April.", "score": 1, "replies": [{"body": "Small dips doesn’t matter I guess, I actually bought 100 extra share after this small dip.", "score": 1, "replies": []}]}]}, {"body": "Still pretty low volume for tsla today, at least that's a somewhat good sign", "score": 5, "replies": [{"body": "Check out the volume after the trump tweet, haha", "score": 1, "replies": [{"body": "still lower than the average lately, but yeah that definitely had an effect on volume", "score": 1, "replies": []}]}]}, {"body": "Well, the stock had a bad day as soon as my vacation was over, so i guess the theory held up.\n\nNext year, I'll try to take a longer one.  Yes /u/Kyankik ... _even_ longer ;)", "score": 7, "replies": [{"body": "You're leaving again tomorrow right? Need another boost...", "score": 4, "replies": [{"body": "Nah sorry, next vacation isn't until christmas", "score": 3, "replies": []}]}, {"body": "We will have to set up a crowdfunding to send you to Siberia.", "score": 2, "replies": []}, {"body": "Lol welcome back...", "score": 1, "replies": []}]}, {"body": "One good take away from today's dips is that the short interest reaches all-time high again.\n\nMy brokage again has no more shares to lend", "score": 10, "replies": [{"body": "Borrow fees are up slightly but still under 1%/year. Shorts are still making money just by being short TSLA (earning more interest on cash from short than they’re paying in fees to borrow shares).", "score": 9, "replies": [{"body": "I actually feel more confident about this low short fee. It indicates large brokerage firm are confident about TSLA won’t hurt too much. Consider other firm with similar short interest, the fee can be as high as 100%. Yeah, I’m talking about beyond meat.", "score": 3, "replies": [{"body": ">It indicates large brokerage firm are confident about TSLA won’t hurt too much. \n\n\nCan you elaborate on this, please? I can't parse the statement.", "score": 2, "replies": []}]}, {"body": "Good spin. I'll give you an upvote for that.", "score": -4, "replies": [{"body": "Not spin. Borrow fees are a better proxy for short interest than inventory at one broker, IMO. Fees tend to get arbed.", "score": 6, "replies": [{"body": "No, it’s not. I’m sure you’re wrong.", "score": -2, "replies": []}]}]}]}]}, {"body": "Buying the dip little at a time on long-term position, but being patient because macro is very shaky. I'm cash heavy", "score": 6, "replies": []}, {"body": "I hope the tsla bears stay this clueless until my next pay ;)", "score": 5, "replies": [{"body": "I wish my next CD was maturing today instead of October 1st so I could buy more at today's prices. :(", "score": 3, "replies": [{"body": "Plenty of time to buy before the run up to Q3 earnings.", "score": 1, "replies": []}]}, {"body": "I won't have free cash until January due to my business's cash flow ... \n\nI figure we have until three quarters into Model Y production to get the stock under 350, after that point, the whole situation will be the stock is so solid with cash flow that you can't stop it.", "score": 1, "replies": [{"body": "I remember reading the same thing about the 3.", "score": 3, "replies": [{"body": "3 quarters into the full ramp of the Model 3 was December, stock was near all time highs ...\n\nthen one bad quarter of \"demand\" and people freaked the f out. Well it was really a solid pile on of FUD ... but I suspect by Q2 of 2022 the numbers should be solid enough that big dips will be hard to happen.", "score": 1, "replies": []}]}]}]}, {"body": "Entry level Etron is coming: [https://www.drivingelectric.com/audi/e-tron/726/new-audi-e-tron-2019-specs-prices-and-sale-date](https://www.drivingelectric.com/audi/e-tron/726/new-audi-e-tron-2019-specs-prices-and-sale-date)\n\n71kwh battery - 120kw charging speeds - 186 mile range, but it's likely to be much less as the official range in Europe is 248 but 204 in the US on the EPA rating, so it's more likely to be 153 mile EPA range. Price to be determined ...\n\nMore Tesla killers coming!!! /s", "score": 15, "replies": [{"body": "Terrible range. Who are Audi kidding.", "score": 5, "replies": [{"body": "381 wHr/mile oof", "score": 2, "replies": [{"body": "I'm sure it's better than that, but it just has a large high and low buffer on the battery.", "score": 1, "replies": []}]}, {"body": "I read that as 'Who Audi kidding?'", "score": 1, "replies": []}]}, {"body": "> The e-tron 50 quattro will be slightly slower than the existing model over the 0-62mph sprint, completing it in seven seconds\n\nOh boy, watch out, 7s 0-60mph.  If you blink (100 times) you might miss it. Hahaha.", "score": 5, "replies": []}, {"body": "In Germany the price before taxes will be down to below 60k. Which means they are elegible for the 2k rebate Germany has. I guess that's one reason. \n\nSounds like demand problems to me. /s", "score": 2, "replies": []}, {"body": "Man it's crap lol 🤣", "score": 2, "replies": [{"body": "They almost registered as many e-Tron's in Norway, the Netherlands and Spain in July as Telsa registered Model X's in either of the first and second quarters lol 🤣.  Its almost like most people in Europe don't need a vehicle with 200 miles of range!", "score": 2, "replies": [{"body": "Well they're certainly not using them for their summer vacation trips, because of all the EV's i saw driving to or from the south of Europe, apart from one (very brave) Ioniq, it was all Teslas.  I didn't see a single e-tron, not even while passing the Ionity chargers (spotted a Taycan though!)", "score": 1, "replies": [{"body": "Ok, if you say so.  Tesla has sold less than 150k vehicles in its entire history in Europe, with a huge percentage being in Scandinavia and the UK, but I'm sure you are running into them all over the place in Southern Europe.  I'm sure you didn't see a single Leaf even though Nissan has sold 135k in Europe.  It of course would have been impossible for you to spot one of the 150k Zoes sold in Europe; I'm sure even though the company is French none of those wind up in the south.  Anyway, I totally believe you.", "score": 2, "replies": [{"body": "> I'm sure you didn't see a single Leaf even though Nissan has sold 135k in Europe.\n\nYou literally replied to another comment of mine where i said i see Nissan Leafs all the time and Renault Zoe's occasionally. It was only about 1 or 2 hours before this one. You should try to improve your attention span.\n\nWeird thing is: despite all of the Model 3's I spotted on my trip, not a single one was from the UK or any of the Scandinavian countries.  Most were from the Netherlands, Belgium, Germany and France.\n\n> Anyway, I totally believe you.\n\nLol, makes no difference to me whether you believe me or not.  I have nothing to gain from persuading you.", "score": 1, "replies": [{"body": "> You literally replied to another comment of mine where i said i see Nissan Leafs all the time and Renault Zoe's occasionally. It was only about 1 or 2 hours before this one. You should try to improve your attention span.\n\nI replied to this one before I saw your other post.  Amazing, right?\n\n> Weird thing is: despite all of the Model 3's I spotted on my trip, not a single one was from the UK or any of the Scandinavian countries. Most were from the Netherlands, Belgium, Germany and France.\n\nEven more amazing considering the sales numbers in those countries are such a small percentage of Tesla's European sales.  You truly experienced an incredible statistical anomaly!", "score": 2, "replies": [{"body": "> I replied to this one before I saw your other post. Amazing, right?\n\nReddit has this cool feature called ‘edit’ ;)\n\n> Even more amazing considering the sales numbers in those countries are such a small percentage of Tesla's European sales. You truly experienced an incredible statistical anomaly!\n\nNot an anomaly at all as it happens every year in Europe... People from the Benelux, Germany, France head down south with their car to enjoy their summer vacation.  Sure, a lot of people fly down there but a very large number of people just go by car.  It's so common that we even get warnings about so-called ‘black weekends’ (the upcoming weekend will be such one) in which you'll spend _hours_ in long traffic jams in France and Switzerland on the most common routes down to the southern parts.  \n\nIt's clear that you know jack shit about European people and habits, just keep in mind that you can't always explain everything with statistics.", "score": 1, "replies": [{"body": "I wasn't questioning that people go on vacation, I was questioning the fact that you saw soooo many Tesla's but so few other EVs despite the fact that Tesla's are such a tiny fraction of the EV fleet in Europe.", "score": 2, "replies": [{"body": "So the funny thing is: if you did know anything about statistics you'd also know that there's this very important concept of correlation, right?\n\nNow, go ahead and look at the map here: https://ionity.eu/\nNow, go ahead and look at this other map: https://www.tesla.com/en_EU/supercharger\n\nHmmm.... could there be any correlation between the number of Tesla's doing long distances and fast-charging infrastructure availability 😮🤔? There are very few spots in Southern Europe that are hard to reach for Teslas because the Supercharger network is so well spread out.  Ionity, not so much just yet.\n\nIn case you still don't get it: The reason you see much more Tesla's doing long distances in Europe is because it's incredibly easy to do so.  With E-Tron's and I-Pace's... Once you get below Paris you're stuck searching for 50 kW chargers to (slowly) top off, just to be able to make it to the next Ionity charger.\n\nI mean seriously, this can't be too hard for you to figure out on your own, is it?", "score": 2, "replies": [{"body": "> I mean seriously, this can't be too hard for you to figure out on your own, is it?\n\nPlease don't do things like this. It's completely unnecessary and adds nothing to the discussion.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "It's almost as if Tesla is competing at a 10% tariff disadvantage and you're comparing to a car that was just released with cars that were not just released. Come back in a year and see where the sales of the e-Tron are. At the moment it's backlog demand.", "score": 0, "replies": []}]}]}, {"body": "The only way someone would buy this is brand loyalty or ignorance of Tesla model 3. Stats are terrible.", "score": 3, "replies": [{"body": "They designed it to get under the grant threshold set in Germany ... it's so they can capitalize on the production line and sell more units. but it's a terrible value especially when the Model Y comes out.", "score": 2, "replies": []}, {"body": "Or maybe they want an SUV?", "score": 1, "replies": []}, {"body": "Cars are more than range and 0-60.", "score": 2, "replies": [{"body": "Your point is? \nTesla beats them everywhere.", "score": 0, "replies": [{"body": "Have you sat in an Audi bro?", "score": 2, "replies": [{"body": "Yeah, i got rid of my Audi A5 when I bought my Tesla. What's your point, bro?", "score": 2, "replies": [{"body": "That Audi does the interior better.", "score": 2, "replies": [{"body": "Very subjective... sound insulation: no doubt, Audi has that nailed. The better overall experience inside the car? That really depends from person to person.  Every time i step into someone else's car I basically sigh when I see all those buttons, the majority of which are never used and just use up space.", "score": 1, "replies": []}]}]}, {"body": "Audi’s are garbage. Worst UI ever. BMW has a chance", "score": 0, "replies": []}]}]}]}, {"body": "Counterpoint: This car will work just fine for Europeans, where Tesla service is a disaster.", "score": 1, "replies": [{"body": "I don't know who's buying these cars or what they're doing with it.  I spot Tesla's and Nissan Leafs all the time.  A Zoe here or there occasionally.  Some Ioniqus.  Today I saw a Kona.  \n\nBut i've only spotted one E-Tron in the wild in the past 4 months 🤷🏼‍♂️.  Whoever's buying them, is not doing a lot of driving (probably a wise choice ;))", "score": 1, "replies": [{"body": "Maybe because there have been over 425k Tesla's, Leafs and Zoes sold in Europe since they have been on sale since 2013, 2010 and 2012, respectively? The E-Tron has only been in production this year so has less than 10k sales (but about as many S/X sales as Tesla has combined this year).", "score": 2, "replies": []}]}]}]}]}, {"body": "Vix up nearly 10% but market slightly up to. Strange.\n\nEdit: Vix now down nearly 8%\n\nMarket has taken the news well.", "score": 5, "replies": []}, {"body": "Just bought some more. Seems to be stopping and reversing finally. \\*knocks on wood\\*", "score": 3, "replies": []}, {"body": "Market really just shit the bed there.", "score": 7, "replies": [{"body": "GS and MS won't publish their 13F file 8/15. I'm so desperate to see their holding at Q2.", "score": 3, "replies": [{"body": "GS and MS?", "score": 1, "replies": [{"body": "Goldman Sachs and Morgan Stanley.  I think this guy is convinced I work for an investment bank and have non-public data because I actually read the company's SEC filings.", "score": 1, "replies": []}]}]}]}, {"body": "Once v3 starts to prove itself for the market, you’re going to see housing developing begin to have it installed from the get go", "score": 6, "replies": [{"body": "It is possible that v3 is ready to go in time for the legislation change in California requiring all homes to be built with solar panels. (2020)\n\nThis could be a nice market for Tesla since classic solar panels are ugly compared to Tesla solar roof.\n\nAs always it'll come down to price though.", "score": 7, "replies": [{"body": "I agree, this does seem possible.", "score": 2, "replies": []}, {"body": "With the red hot housing market in Cali it will come down to more than price, aesthetics will play a part too", "score": 2, "replies": [{"body": "Ya, I sometimes forget how expensive homes are in Cali. A Tesla roof where I live, Pittsburgh, would be like 10% to 15% of the entire home. (At current prices)", "score": 1, "replies": []}]}, {"body": "Apparently California builds 80,000 new houses a year.  So their planned production would be able to serve a good portion of that.\n\nOn the high end I think there will be some number of people who buy them just to avoid the solar panel look.  That differentiation alone is a real advantage especially when you're required by law to have solar.", "score": 2, "replies": []}]}, {"body": "Do you mean to have v3 installed in each house?", "score": 1, "replies": [{"body": "Each? No. Many? Yes", "score": 1, "replies": [{"body": "Not sure it’s possible to have a 250kW pipe installed at a residential address using normal wiring, it would have to be industrial scale right? Also, what’s the need for such fast charging at home?", "score": 1, "replies": []}]}]}]}, {"body": "[Tesla Sued by Family of Florida Man Killed in Autopilot Crash](https://finance.yahoo.com/news/tesla-sued-family-florida-man-200338265.html) \" Jeremy Banner, 50, died when the Model 3 sedan he was driving failed to  brake or steer to avoid a semi trailer that ran a stop sign on a Florida  highway in March, according to the lawsuit, which also names the driver  of the semi as a defendant. Banner had engaged the Autopilot system  about 10 seconds before the collision \"\n\n\" Representatives for Tesla didn’t immediately respond to a request for  comment on the suit, which alleges that the company knew its product was  defective. \"\n\nHit piece much? Also how is it a defect on Teslas part when a car literly drives straight onto the highway infront of you, not that many human beings who would notice in time unless they're like me, ALWAYS nervous around cars moving to or standing still at a crossing \"will he drive forward and cause a crash?\\`better slow down a bit and be rdy on the brake\".", "score": 5, "replies": [{"body": "Probably a bit of a weird take, but any kind of lawsuits, successful or not is good for Tesla right now. \n\nA big part of getting FSD going is not only the technological challenge but also a legal one. Our legal system does not really know how to handle self driving cars. Can you sue tesla for auto pilot doing things? Can you sue tesla because the auto pilot allowing you to do something? If autopilot causes a crash but it was unavoidable for both a human and an autopilot? If smart summon accidentally bumps into another car is Tesla liable for the damage? \n\nWhatever the case is having things tried in court clears up the law. So even if Tesla is found liable for some types of damages, then at least we all know that's how it works. All these lawsuits are just laying the legal groundwork for FSD.\n\nAlso, even if many of the lawsuits are complete fluff, there's really not really any legal precedent here so I don't blame them for trying the issue in court. Judges are very competent and if the case has nothing to stand on it usually gets shut down quickly.", "score": 2, "replies": []}, {"body": "What would be helpful to me is a bit of an update on the other suits. I don’t remember reading whether the first suit was dismissed, began, ended, or what.", "score": 1, "replies": [{"body": "All of these lawsuits are just fluff. There is no autopilot related accident lawsuit that can hold water. You literally sign an agreement when you start using it, I don't understand how people still don't realize this. The only (unlikely) possible negative outcome is some governing body saying that agreement is no longer good enough GOING FORWARD.", "score": 6, "replies": [{"body": "You can't sign away your rights.", "score": 0, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Strict product liability", "score": 3, "replies": []}]}, {"body": "Yes you can.  It’s called a waiver.  You waive your rights to a jury trial, appeals, class actions, state laws, and much more when you sign arbitration agreements.", "score": 4, "replies": []}]}]}]}]}, {"body": "Do you guys see $TSLA going back to 260 levels in upcoming days/weeks or do we need some major positive news for that? \n\nWould love to hear your thoughts!", "score": 2, "replies": [{"body": "Haha ha! Absolutely! No way! \n\nThis stock’s short term movement is largely controlled by emotion and manipulation. If you’re looking for short term gains, trade for volatility.\n\nIf you believe in the company’s long term potential, go long and put in some reasonable stops, average down on the dips, and try not to think too much about it.", "score": 2, "replies": [{"body": "I am long, Mr Morality-itself. It's called being curious.\n\nAnd I can't average down because I am a student and broke. :D\n\nEdit: Sorry, just hate when you ask someone a question and they start to lecture you instead.", "score": 1, "replies": [{"body": "As long as you recognize your mistake and improve on it going forward, all is good.\n\nYou're right in calling him out but what example does it set if you do the same to him in return?", "score": 1, "replies": []}]}]}]}, {"body": "Oh damn boy.", "score": 2, "replies": []}, {"body": "When would the G3 be operational and pumping out M3 ? Are they any specific dates given out ?", "score": 2, "replies": [{"body": "First test vehicles end of Sept to early Oct. Continued testing through November and official production beginning in November. 1k M3 per week in Dec. Ramping to 3k per week in Q1 2020.", "score": 3, "replies": [{"body": "Remember though, Tesla timelines are rarely reliable. Who knows when it will actually happen.", "score": 1, "replies": [{"body": "Anyone thinking they will reach full production capacity in Q4 would be betting on an aggressive timeline. We can see that GF3 is \"ahead of schedule,\" which probably means they are on schedule in Tesla speak.", "score": 2, "replies": []}, {"body": "I do.", "score": 0, "replies": []}]}]}, {"body": "By november/december", "score": 2, "replies": []}, {"body": "3000/wk by end of Q4", "score": -2, "replies": [{"body": "Did they say they will be at full capacity by end of Q4?", "score": 1, "replies": [{"body": "No they said Q1. End of Q4 ramping to 1k per week.", "score": 4, "replies": []}]}]}]}, {"body": "> ...during the talks the U.S. will start, on September 1st, putting a small additional Tariff of 10% on the remaining 300 Billion Dollars of goods and products coming from China into our Country. This does not include the 250 Billion Dollars already Tariffed at 25%...\n\nhttps://twitter.com/realdonaldtrump/status/1156979446877962243?s=21\n\nhttps://media1.tenor.com/images/3e2f181b3b7a16c089d5e71041aced13/tenor.gif?itemid=13636437", "score": 4, "replies": [{"body": "So how long until the market turns this into hope of another 25 basis point cut...", "score": 3, "replies": []}, {"body": "And he blames the fed for the market haha", "score": 4, "replies": []}, {"body": "... So does this mean that Teslas are going to get more expensive again from tariffs?", "score": 2, "replies": [{"body": "http://images1.memedroid.com/images/UPLOADED3/5088a63999e25.jpeg\n\nGive it an hour. People will be back to buying weed stocks, crypto, and fake meat stocks.", "score": 6, "replies": []}]}, {"body": "idk why this matters, tesla will have a factory running within china in a few months", "score": 2, "replies": [{"body": "That does not insulate them from a trade war.", "score": 0, "replies": [{"body": "Their exposure is pretty low.", "score": 1, "replies": []}]}]}, {"body": "hmm ... whole market falling... what the fuck is in this guy's head...", "score": 4, "replies": [{"body": "A dead hamster.", "score": 2, "replies": []}, {"body": "🐂💩", "score": 2, "replies": []}]}]}, {"body": "JB sold 11,325 shares", "score": 1, "replies": [{"body": "He’s probably using that to fund his recycling business. I doubt he’s selling because of future outlook about Tesla.", "score": 6, "replies": [{"body": "People need to sell for lots of reasons, problem when all your wealth is often in a stock and not liquid.", "score": 6, "replies": [{"body": "Very true. You can't eat equity", "score": 1, "replies": []}]}]}, {"body": "JB has been consistently selling shares. It's a pretty wise thing to do because you don't want your whole life invested in one company. Lots of execs sell shares because they are already receiving a salary from that company and you don't want you equity positions in the same boat. Diversify. JB has done pretty well, hired on as one of the very first employees but now worth over $100m because of Tesla.", "score": 2, "replies": []}, {"body": "Just curious: In the other sub, I saw they say 60K shares? \n\nAlso I don't find this information in any insider sale -- because JB doesn't count as insider any more?", "score": 1, "replies": [{"body": "He filed a 144 form that gives him the right to exercise selling of up to 60k shares in the next 90 days or so.\n\nI was looking at a form 4, showing that he sold 11,325 shares so far, he may unload more over the next 3 months", "score": 2, "replies": [{"body": "Great info, thanks! So technically he didn't sell more than he has been doing so far -- since he has been unloading 15K shares per month for almost the past two years I think.", "score": 2, "replies": []}]}]}]}, {"body": "Hmm, really dropping, are people not happy with July delivery estimates?", "score": 2, "replies": [{"body": "Na it’s the trade war talk.", "score": 21, "replies": [{"body": "Yeah everything is dropping now heh. Funny that Tesla is equally affected... you would think that people knew about GF3....", "score": -5, "replies": [{"body": "GF3 doesn't make Tesla suddenly immune to all Trade war macro. It'll help ease the pain when it's up and running for sure though.", "score": 7, "replies": [{"body": "Not immune but it should make a decent difference in the \"true\" impact to Tesla from trade wars", "score": 0, "replies": [{"body": "Less like tariffs hurt Tesla’s sales in China. \n\nMore like tariffs hurt global economy, every industry feels pain, especially the cyclicals (like autos and especially luxury priced autos).", "score": 4, "replies": []}]}]}, {"body": "A global recession, the real fear of a China US tradewar, will decrease demand of luxury vehicles across the board.", "score": 4, "replies": []}]}]}, {"body": "I am surprised by the delivery estimate -- but stock movement is always unpredictable, it could be something else dragging it down -- which is why short-term trading is so hard than long-term :-)", "score": 1, "replies": [{"body": "Well I guess the most recent movement matches the macro but yeah", "score": 1, "replies": []}]}, {"body": "S/X numbers are down 12.9% YoY which isn't great, but the Model 3 sales are better than I was expecting.", "score": -1, "replies": [{"body": "\\-12.9% YoY is much better than expectations. That would imply 24k deliveries of S/X for Q3, which is a 36% increase from 17,650 of 2019Q2.", "score": 2, "replies": [{"body": "Yes, that would be true if international sales don't completely collapse like they did last quarter.  Remember, international sales of the S and X were down 45.8% in the first half compared to the first half of 2018 - that is where the losses are coming from.  Its weird, its almost like Tesla's sales have gone down in the jurisdictions where they are facing the most competition.", "score": 1, "replies": [{"body": "We will see. I don't expect the sales of competing EVs to last past the initial burst, much like the Chevy Bolt & other 'Tesla Killers'.", "score": -1, "replies": []}]}]}]}]}, {"body": "Whats the news on the selloff?", "score": 1, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Hope trump isn't given another 4 years.\nHe has been terrible for the auto market.\n\nNeed a president who prioritises climiate change.", "score": 3, "replies": []}, {"body": "These are pure speculated estimates by insideev though, right?", "score": 2, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "They are really accurate. I mean really.  They probably are the #1 estimating site.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Less than 5% error.", "score": 3, "replies": []}]}]}]}]}, {"body": "The good news is G3, not US sales :D Not sure why investors care, given Shanghai Giga is almost finished. On the contrary, this should be a good thing for Tesla!", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "It's not a violation if it was approved.\n\nFor all the people lawyering about this stuff on twitter, we don't actually have a way to know what he gets approved or not and therefore we don't know if the settlement's being violated.   It's just speculation unless the SEC gets involved again.", "score": 12, "replies": [{"body": "I agree entirely. The only reason that I would give any credence whatsoever to the idea that Musk didn't get clearance from legal for the tweet is that Tesla no-commented Bloomberg. There's no compelling reason not to just confirm that it was cleared, if it was, as far as I can reason, but Musk could just be shitposting by proxy for the kicks.", "score": 3, "replies": [{"body": "Companies \"no-commented\" a lot of things, even simple questions.\n\nThe problem sometimes is making it a pattern. Anything Musk post does he need to publicly say has been approved? The deal was with the SEC, not the media.", "score": 4, "replies": [{"body": ">Companies \"no-commented\" a lot of things, even simple questions.\n\nYes, but now this is a story and if Tesla had said \"yes, it was run by legal\" it wouldn't be. I'm open to hearing reasons for why not to confirm that are anything other than \"businesses just don't comment on things sometimes\".", "score": 1, "replies": [{"body": "If you do it once you set a precedent.", "score": 1, "replies": []}]}]}]}]}, {"body": "given's the SEC's speed when it comes to Tesla and Elon Musk, they would've already filed a lawsuit by now if indeed it was a violation. Either way, it will make them look ridiculous if they sue over a fucking solar roof production number. Last time they pulled this shit they got a lot of heat from the judge and a lot of people.", "score": 5, "replies": []}, {"body": "Buncha FUD. The media is desperate for another tweet \"scandal\".", "score": 2, "replies": [{"body": "*Some media", "score": 1, "replies": []}]}, {"body": " *¯\\_ (;,;)_/¯*", "score": 2, "replies": []}]}, {"body": "Anyone know of a spreadsheet with Tesla quarterly numbers already inputed?\n\nReally hoping to avoid building up the past 7 years since the Model S myself to do some forecasting :)", "score": 0, "replies": [{"body": "https://hypercharts.co/tsla", "score": 3, "replies": []}, {"body": "Could export from MorningStar.\n\nP.S. why do you need 7 years? That's a lot of irrelevant information", "score": 1, "replies": [{"body": "I really only care about 3 years, but if it's already there, 7 is fun to play with if you want to show how quickly the company ramped from it's Model S onward.", "score": 1, "replies": []}, {"body": "Anyone have premium? I can only get 5 quarters for the free one.", "score": 1, "replies": []}]}]}]}
