{"title": "Could Trump be purposefully dropping markets w/ his tweets?", "selftext": "I need some input on this thought. Could Trump purposefully be dropping tweets to bring the market down in order to prevent a blowoff top? The DOW made a hockey stick in Jan 18, and hasn't gone anywhere since - and perhaps it's not just Trump.", "id": "cufom5", "created_utc": 1566575314.0, "score": 69, "upvote_ratio": 0.84, "num_comments": 123, "comments": [{"body": "My theory is he is fighting with China until early 2020 so the market can respond positively into the election. Gotta beat it down now to get the pop then again.\n\nHe can also then say look at this great deal I just made with China which I guess with be woese than he could have got earlier on.", "score": 82, "replies": [{"body": "Maybe. Trump's strategy is to take a puppy, take it to the river and hold it under until it ALMOST drowns. Then he pulls it out and yells \"Look at me, I saved a puppy!\"", "score": 105, "replies": [{"body": "LOL.", "score": 4, "replies": []}, {"body": "replace puppy with Dragon lmao...", "score": 1, "replies": []}, {"body": "Will it work though? China has to realize they can take on short term pain, and not accept any deal until AFTER the election.", "score": 1, "replies": []}, {"body": "Narrator voice: But it's really a kitten \n\n(market is not the economy)", "score": 1, "replies": []}, {"body": "That’s too good.", "score": -1, "replies": []}, {"body": "[removed]", "score": -16, "replies": [{"body": "Yikes", "score": 7, "replies": []}, {"body": "Great. Hi Loser!", "score": -2, "replies": [{"body": "what? you don't want him saving the liberal puppies?  you monster.", "score": 1, "replies": []}]}]}]}, {"body": "Yeah i also think China might know this and plan on just blowing him off try to hurt us as much as possible and hope to talk to someone saner in the next election. If not possibly make a deal with him in 2021 but i think for them 1 more year cant hurt.", "score": 15, "replies": [{"body": "Right on Stuntz-X", "score": -1, "replies": []}]}, {"body": "I think you are right...but do you know why?  That is the worst strategy possible and I'd accept nothing less than the worst strategy possible from Trump.   He has put his election and the economy in the palm of Xi's hands.", "score": 1, "replies": []}, {"body": "China elected Xie now he's leader for life. All he needs to do is wait this out (either for one or five more years) before he gets to deal with a Democrat. My guess? China gets free trade from a Democrat, then Chinese businesses buy more American assets, and eventually we praise Xie.", "score": 1, "replies": []}, {"body": "I think this is the case too. He'll use the damage done by this war so that:\n\n1. The feds will be more compelled to lower the rate.\n\n2. his administration can build up a case for tax cuts to middle class and corporations (read it on the news about these tax cut considerations this wk)\n\nAnd after that, he thinks that he can reach a deal on the trade war and going into the election with momentum. \n\nWhether it works as planned is an entirely different issue. The counter here is China probably knows this and will endure it to push him out and get someone more China-friendly", "score": 1, "replies": [{"body": "Fed lowered rate last time but more for international fallout that's happening lately. US stocks are roaring on days with no trade war news.\n\n I think it's sad when they lower rates cause it robs pensioners of their pension increases.", "score": 2, "replies": []}]}]}, {"body": "Im starting to think so", "score": 21, "replies": []}, {"body": "Are you implying that our Supreme leader is less than the selfless, publicly dedicated friend of humanity he appears to be? I'm shocked!", "score": 24, "replies": []}, {"body": "Trump knows all the algorithms have been updated to take his tweets into account. The almost instant drop whenever he tweets negative is proof of his, followed by a recovery the next or few days later when he stops tweeting", "score": 6, "replies": []}, {"body": "When you look at Trump, do you see an econ genius playing 3D chess with the markets to save everyone's money from the disasters he already unleashed?\n\nOr do you see a senile, dumb, narcissistic buffoon acting on impulse, serving as a useful idiot to destabilize the world economy?\n\n... This will help determine how good of a judge of character you are", "score": 8, "replies": [{"body": "I see a guy holding hundreds of millions of dollars in variable rate real estate loans that spends 1/2 the day working for his old business and the other 1/2 abusing his position to lower rates and increase his personal profits.\n\n1/3 of his time as president has been spent visiting his properties.", "score": 1, "replies": [{"body": "\"Working\"? LOL\n\n\"hundreds of millions of dollars\"? HAHAHAHAH\n\nYou give his lies wayyyyyyy too much credit :)", "score": 0, "replies": [{"body": "We already know Deutsche bank loaned trump billions of dollars.\n\n[https://fortune.com/2019/03/19/deutsche-bank-donald-trump-loans/](https://fortune.com/2019/03/19/deutsche-bank-donald-trump-loans/)", "score": 1, "replies": [{"body": "Correct me if I'm wrong but when someone gets a loan, it's not really \\*their\\* money and they have to pay it all back somehow", "score": 0, "replies": []}]}]}]}]}, {"body": "What could go wrong?  He has the invincible Larry Kudlow to save us all", "score": 3, "replies": [{"body": "He owes me a penny", "score": 3, "replies": [{"body": "Schiff, is that you?", "score": 2, "replies": [{"body": "Hahaaaa\nAt least one person recognized this.", "score": 2, "replies": []}]}]}]}, {"body": "Starts trade war to shake up economy. Wants to get Feds to lower interest rates. Plans on family profiting in real estate dealings d/t lower rates. Fed reluctant to lower rates, so he has to increase the trade war rhetoric to get the Fed to do what he wants. This is the only explanation I can come up with for his obsession with lower rates rather than bragging about how well the economy is doing.", "score": 3, "replies": []}, {"body": "You think the man who bankrupted a casino, not once but four times, is that smart?  The same man who inherited millions of dollars from his daddy and was able to make his nest egg even smaller when factoring in inflation and market appreciation?", "score": 10, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": []}]}, {"body": "His father bailed out his failures for years. He's flushed more money down the toilet than most of us will ever see.", "score": 2, "replies": []}]}, {"body": "Not backing the man, but taking millions and making it into $4 billion is likely a lot smarter than 97% of the investors in this country. What’s your bank account look like?", "score": -5, "replies": [{"body": "$4 billion????  That's funny.  Let me guess, you also routinely get scammed by robocalls.  Amirite?", "score": 4, "replies": []}]}]}, {"body": "If the market could just ignore his Twitter, that'd be grrrrrrrreaat", "score": 2, "replies": []}, {"body": "market tycoons told him to. Trump is just another puppet.", "score": 2, "replies": []}, {"body": "He's not smart enough to do that...", "score": 8, "replies": [{"body": "He is not as stupid as he pretends to be.", "score": 5, "replies": []}, {"body": "Guarantee he's telling friends and shell companies when to buy. He's definitely aiming to tank the market via tweet crescendo 13 months prior to his possible retirement.  Needs at least 12 months before selling", "score": 0, "replies": []}]}, {"body": "Has anyone considered that CHINA might be purposefully dropping markets? I mean, if they put enough money into shorting the nasdaq and the like they could make a killing. Why announce these new tariffs when Trump delayed his tariffs for three months? His response was 100% predictable.", "score": 3, "replies": [{"body": "Nobody has considered this because it would easy to tell if it was happening. So, there is no reason to consider it.  If there was data to show that, then people would consider it.", "score": 2, "replies": []}]}, {"body": "You're giving that gasbag way too much credit.  He has never been a success at anything, he couldn't mastermind his way out of a bathroom.", "score": 6, "replies": [{"body": "Except for the fact he's the president, and all.", "score": 18, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Reddit: Trump never wanted to be president.\n\nAlso Reddit: Trump will do anything to stay in office, he won’t go willingly.\n\n/s... I know this site isn’t a literal hive-mind, in before those comments.", "score": -1, "replies": [{"body": "The Netflix documentary Get Me Roger Stone gives some interesting insight into that. It seems clear that it never really occurred to Trump that he would want to run for president until smarter people suggested it some years back, and it played on his ego brilliantly. Once Trump's ego has been built up some way, he's going to feed it until it can't be fed anymore. When you look at him in that framework, the whole thing makes a lot more sense. I think he wanted to be president once the prospect was dangled in front of him, but he realized during the election that it was a long shot and that developing an adoring fanbase was a great consolation prize. Now that he has it, the prospect of being an ex-president (whether it's in 2021 or 2025) is a little too much for his ego to bear.", "score": 2, "replies": []}]}]}, {"body": "Putin used mob tactics to get him. The man is a senile narcissist, I wouldn't hire him to wash my car.", "score": -1, "replies": []}]}, {"body": "Except, you know, real estate. I don't understand how, just because orange man bad, you can say he hasn't been successful at anything.", "score": -11, "replies": [{"body": "I think it comes from the inherited real estate fortune. He’s managed not to lose it all so not the best measure of “success”.  He did, however, manage to parle his gaudy, page 6 behavior into a brand that could be licensed out to other real estate companies. At best maybe a Proto-Instagram influencer", "score": 5, "replies": [{"body": "He inherited company with a value of ~200mil. He's worth 3bil+. These numbers dont add up to equal the delusion that the man is unsuccessful. On top of that, he managed to win the 2016 election. Just saying, dont let TDS ruin your ability to exercise critical thinking", "score": -6, "replies": [{"body": "*~400 million\n\nDon’t forget all the times he had to borrow money from the Trump estate to bail himself out. Or all the money his father gave him before he even turned 18. Or all the tax fraud.\n\n\nhttps://www.google.com/amp/s/www.bloomberg.com/amp/opinion/articles/2018-10-03/trump-even-inherited-his-father-s-self-made-myth", "score": 8, "replies": [{"body": "alleged tax fraud", "score": 1, "replies": []}, {"body": "Bloomberg opinion articles are always a good source..... /s", "score": -9, "replies": [{"body": "You could choose from the 100,000 other articles with the same info. I just picked the first one to save myself some time in proving a point that’s been proven over and over for the past three years. The article references the NY Times article which was the original break in this story. But I’m not here to teach you how to fact check credible sources.", "score": 5, "replies": [{"body": "https://www.investopedia.com/updates/donald-trump-net-worth/", "score": -1, "replies": [{"body": "What exactly are you trying to prove with that article? Because it sure didn’t say anything about Trump’s inheritance. It’s obvious he has access to lots of money, but where did the money come from/start? How much has he actually earned? How much has he made off avoiding taxes/using offshore accounts/money laundering through real estate? \n\nIs it obvious he has money? Yes. Has he earned his way to success? Probably not", "score": 2, "replies": [{"body": "You disputed his net worth. Also, it list sources of income, which you disputed. If he is a criminal, how has he gone this long without being charged with anything? Mueller found nothing. They checked every single aspect of his entire life and found nothing. Why are you so mad?", "score": -2, "replies": [{"body": "This is just gonna turn into the classic reddit “argue over schematics until I get the last comment” game, so let’s just stop this. I didn’t dispute his net worth, I simply said I don’t think he’s earned his fortune in the ways he claims he has.  Mueller wasn’t investigating anything to do with what we’re discussing, so that’s irrelevant. Also, don’t project your feelings onto me, it’s not productive for discussion in any way", "score": 2, "replies": [{"body": "\"*~$400mil\" \n\nThats you disputing the net worth.", "score": -1, "replies": []}]}]}]}]}]}]}]}, {"body": "Not to put too fine a point on it but, if you took $200M in 1982[1] and left it in an S&P500 ETF until 2018, without any contributions, at 6.633% interest rate adjusted for inflation [1] you would get $1.56B [2]. With dividends reinvested you get a 9.255% interest rate adjusted for inflation [1] you would get $3.39B [2].\n\n[1]https://dqydj.com/sp-500-return-calculator/\n[2]https://www.calculator.net/future-value-calculator.html?ctype=endamount&cyearsv=32&cstartingprinciplev=200000000&cinterestratev=9.255&ccontributeamountv=0&ciadditionat1=end&printit=0&x=53&y=21", "score": 2, "replies": [{"body": "So you're saying, he made more money than the \"easy way\" without doing it the \"easy way\"?", "score": 1, "replies": [{"body": "You asked why some people don’t see him as a successful person. Valuations of his net worth fluctuate, you said $3B+ and  $3.3-3.5B get thrown around a lot. Instead of passive investment he went out and actively invested heavily in real estate with several high profile follies and bankruptcies along the way. At the end of that 32 year run he ended up roughly at the same place as if he had down nothing at all. That could be a reason for not seeing him as a success.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "https://www.investopedia.com/updates/donald-trump-net-worth/", "score": -2, "replies": []}]}, {"body": "All his real estate business is in NY? I learned something new", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Honestly, if you had proof, would it change anything for you?", "score": 1, "replies": [{"body": "Yes, if is net worth is anything close to $3 B, I would change my opinion !", "score": 3, "replies": [{"body": "https://www.investopedia.com/updates/donald-trump-net-worth/", "score": 0, "replies": [{"body": "It's adorable that you think that counts as proof.", "score": 1, "replies": [{"body": "You have any proof to dispute Forbes?", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[Trump's net worth is ~$3.5bil](https://www.investopedia.com/updates/donald-trump-net-worth/) Can you provide evidence of Trump's concentration camps?", "score": 0, "replies": []}]}]}]}, {"body": "MAGA BABY", "score": -1, "replies": []}]}]}, {"body": "He's not completely lacking in ability. He's a great self promoter, but it's easy to self promote when you're the loudest and richest person in the room. Being born into wealth and using that status to gain visibility isn't exactly rocket science.\n\nHe's essentially l[ost money as an investor](https://fortune.com/2015/08/20/donald-trump-index-funds/). He's under-peformed the market for 30 years, and the numbers cited are being very generous with his net worth. Inheriting 200mil\\~ and putting it into real-estate (which was already a family business) is pretty much main-street level investing. There's nothing of note here.", "score": 2, "replies": [{"body": "You make it sound easy.. Why is there even a 1%?", "score": 0, "replies": [{"body": "Taking 200mil and buying/building apartments to hold for decades **is** easy. I know numerous people that have done this with far less money (and obviously less returns).\n\nBuy and hold with that kind of inherited money is simple. Do it with real estate, S&P500 and even gold and you're going to make money. Stop letting this bankrupt trust fund baby convince you that he's a shrewd business person.", "score": 2, "replies": [{"body": "Have you even looked into the man and what his sources of income are? https://www.investopedia.com/updates/donald-trump-net-worth/", "score": 1, "replies": [{"body": "Yes quite a bit actually. All the article you link does is enforce my point. Assets and revenue from real-estate holdings. I suggest you do your research and accept the facts. Fred Trump was [worth 100-300mil](https://www.politifact.com/florida/article/2016/mar/07/did-donald-trump-inherit-100-million/) at the time of his death. His father was [gifting him 1mil\\~ year](https://www.cbsnews.com/news/trumps-taxes-the-5-biggest-ways-fred-trump-made-donald-rich-new-york-times/) from the time of graduation college graduation. Fred also b[ailed out at least 16mil of interest debt](https://www.pressofatlanticcity.com/news/how-donald-trump-s-father-once-bailed-out-his-casino/article_934cb836-2c1d-11e6-8a13-173759856fe0.html) (not even the full principle) on Trumps Atlantic city casino. Fred [put up 35mil in collateral](https://www.washingtonpost.com/politics/2016/live-updates/general-election/real-time-fact-checking-and-analysis-of-the-first-presidential-debate/fact-check-how-much-help-did-trumps-father-give-his-son/?noredirect=on) for a construction load for Donald. Don was [a millionaire by age 8](https://www.businessinsider.com/trump-tax-fraud-fred-inheritance-millionaire-by-age-8-2018-10) due to a trust his father set up for him.\n\nI could spend an hour putting together sources, but my guess is you don't want to know facts and establish a baseline of reality. You want to support \"your\" guy and you will ignore any evidence to the contrary. You are part of the problem and society and history will continue to leave you behind as you desperately cling to relevance through the lies of a conman. Later yo <3", "score": 7, "replies": []}]}]}]}]}]}, {"body": "I mean love him or hate him, dude made billions in real estate. At a minimum he's successful at that.", "score": -12, "replies": [{"body": "I’ll have to see some actual proof of that. But seriously, the guy got his start investing his daddy’s money into Manhattan real estate in the early 70s. You’de be hard pressed to find a hotter real estate market in world history to invest in than Manhattan from the 70s till today. If he’s not worth billions (and I doubt he is) then he’s an absolutely terrible business man.", "score": 6, "replies": [{"body": "https://www.investopedia.com/updates/donald-trump-net-worth/", "score": 0, "replies": [{"body": "He’s known for vastly over inflating his assets and understating his debts. And none of those sources have seen his actual financials. I’ll believe he’s a billionaire when he actually releases his financials to the public.", "score": 3, "replies": []}]}]}, {"body": "His financial reports show 'millions' not billions.  It has also been reported that if he just took daddy's money and invested in the market he might be better off.", "score": 6, "replies": [{"body": "https://www.investopedia.com/updates/donald-trump-net-worth/", "score": 1, "replies": [{"body": "Yeah, seen it.  Seen others too, that show less.", "score": 2, "replies": [{"body": "I couldn't find those ones", "score": 1, "replies": []}]}]}]}, {"body": "No he didnt fucking LMAO\n\n&#x200B;\n\nHe lied his way to avoid taxes, lied his way to get loans, lied his way to get on billionaire lists. Dude IS NOT a billionaire. Hes a liar who can't even pronounce basic words and has gone bankrupt multiple times. How successful.", "score": 5, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Pardon my ignorance, but isn’t a recession defined as two consecutive quarters of negative growth? If so, then how can it be conclusive that we’ve been on a recession for a year?", "score": 6, "replies": []}]}, {"body": "Are you saying Trump uses technical analysis?", "score": 1, "replies": []}, {"body": "Yes he could be.  It would seem that theres suppose to be someone in charge who wouldn't do this.  But shit happened.", "score": 1, "replies": []}, {"body": "Yes, I have been thinking this. It would be like knowing the future. He can obviously control it. I dont think for a minute that someone isn't making millions and he will somehow benefit from it.", "score": 1, "replies": []}, {"body": "Pretty sure no human has the ability to drop the market with a statement of 280 characters. Investors are just skittish fools these days.", "score": 1, "replies": [{"body": "If the statement announces more taxes on imported goods, then yes it can drop the market.", "score": 2, "replies": []}]}, {"body": "No doubt he has people proxying for him until he's no longer in office. He can guarantee a low buy whenever he wants, safely play options with insider knowledge, and overall keep his hands clean. The television media is just \"lol look at the goofy orange man\" and doesnt dig into it. IMO, He's waiting for a big bounce to usher in a second round of \"tax cuts\" in order to cap the value of his own secret profits.", "score": 1, "replies": []}, {"body": "Yes, have you seen the mans love of gold, it’s no coincidence that gold is going to go through the roof. This is why he is creating so much volatility. He’s going to cash out all that gold he transferred his business dealings into.", "score": 1, "replies": []}, {"body": "Trump, like a lot of real estate developers, hold large amounts of variable rate debt. He doesn't care about the market, the cares about lowering rates for his personal business.", "score": 1, "replies": []}, {"body": "Absolutely, he is manipulating it.  He and his organizations are all under investigation for fraud. Does anyone think he would say yes to tax fraud, but say \"Oh my, securities fraud, now that's just immoral.\"  He's made it his business to defraud his real estate investors, students at his fake university, contractors he never paid, and charities via his foundation.  This is just another opportunity to line his pockets (or his buddies') at the expense of the public. Hell yeah he is doing it..", "score": 1, "replies": []}, {"body": "Awful lot of credit of brain power in this statement.", "score": 1, "replies": []}, {"body": "Look at all the heat Trump has been able to shed as president. The FBI special counsel said they couldn't touch him, do you think he fears the SEC? The man is a greased pig, and he knows it!", "score": 1, "replies": []}, {"body": "The man can not string two cognizant sentances together. He is doing what all two year olds do when they don't get their way.", "score": 1, "replies": [{"body": "Which is rule the most powerful country in the world? Man there are some incredible two year olds I haven’t heard about. And what did you accomplish this week?", "score": 1, "replies": [{"body": "If throwing poop tantrums is what you call ruling. Me I cared for the sick. You?", "score": 0, "replies": [{"body": "And I am sure that you made millions doing it.   Try again.", "score": 1, "replies": [{"body": "Focused on money how sad for you. Must be an empty pathetic life", "score": 0, "replies": []}]}]}]}]}, {"body": "I'm convinced he's buying FD spy puts before each tweet storm.", "score": 0, "replies": []}, {"body": "He obviously knows what’s going to happen.\n\nHe may or may not let others know when he’s going to do it. Damn, I wish I could get on that list though. Maybe I can seduce the daughter.", "score": -1, "replies": []}, {"body": "I absolutely agree. Presses are arguing Trump can't delay the recession until the next election, but I hardly agree. Trump knows more economy than politics (real estate and business fluctuate heavily on economy), and he achieved his goals in politics (building walls, stay tough with Democrats...), so I think it wouldn't hard for him to hold the economy.\n\nAnd yeah, I think his corporate/families are actually making money using his Tweets", "score": -6, "replies": [{"body": "Can you name one goal he achieved? Just one? There is no wall build, Hilary is doing fine, swamp is overflowing, Obamacare is fine, ISIS is worse than it was when he got into office.\n\n&#x200B;\n\nAnd when you said stay tough with democrats, what you meant to say is obstruct our government so everything goes to shit. \n\n&#x200B;\n\nSo much winning.", "score": 3, "replies": []}, {"body": "Oh he totally achieved his goals; drained the swamp, built the wall, Clinton in jail, repeal and replaced Obamacare... all with the senate too. \n\nYou having a few misfires upstairs?", "score": 6, "replies": []}]}, {"body": "Trump is fighting the long game against the long term dissolving of our country by globalist scum that seek to average our wealth across the globe and centralize control among a privileged class. Despite the stock market speed bumps Trump is the ally of ALL working class Americans.\n\n&#x200B;\n\n [https://theconservativetreehouse.com/2019/08/23/the-trade-battlefield-has-been-prepped-now-we-fight/](https://theconservativetreehouse.com/2019/08/23/the-trade-battlefield-has-been-prepped-now-we-fight/)", "score": -5, "replies": [{"body": "Long game with a short timeframe. You ever try that with success in any aspect of your life?", "score": 2, "replies": [{"body": "Yes. I am quite wealthy. If you think socialist handouts will result in anything but despair...", "score": 1, "replies": [{"body": "\\>Yes. I am quite wealthy. \n\nlol\n\nYeS I aM QUiTe WeALTHY", "score": 3, "replies": [{"body": "? I make good money.", "score": 1, "replies": []}]}, {"body": "I didn’t claim socialism worked nor does wealth have anything to do with it. The best example of that is that man you’re speaking of now. It makes sense you’d equate that though.", "score": 2, "replies": [{"body": "Anyone on the left will create a huge tyrannical censorious socialist government that will impoverish us all. End of story man. Big government is bad. Never vote democrat.", "score": 0, "replies": [{"body": "You are insanely delusional. Must be upset Alex Jones is gone from every major platform.", "score": 3, "replies": [{"body": "Uh, not delusional. Serious question, Do you think socialism and open borders and internet censorship and gun grabbing is good policy?", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}, {"body": "You already live in a country with many socialized services. Borders should be open WITH GUIDLINES, as with gun laws. Tighter, stricter gun laws. Does that sound so bad to you? That just taking away your rights? \n\nGet a clue", "score": 1, "replies": [{"body": "Yes it does sound bad. And yes it removes my rights. The larger our social programs get, the more wages and income inequality will stagnate and the less business activity will occur. Subsidizing poverty creates more poverty, just look at California. Wealth redistribution is not good policy. Mass illegal Immigration and to some extent legal immigration has kept wages low for decades and increased crime and social tension. Illegal Immigrants do have higher crime rates but I guarantee you will try to convince me that immigrants have lower crimes rates (false, if you include illegal immigrants). Gun Crime is highest in the regions of this country with the strictest gun laws like Chicago.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "\\>our wealth across the globe and centralize control \n\nSo, globalists (you mean jews right?) are 'averaging' our wealth across the globe....to 'centralize' control? \n\nDo you realize how stupid that sounds?  Stay in school kid, please..stay in school.", "score": 1, "replies": [{"body": "No, it doesn’t sound stupid. I am quite educated. You mock me but undermine your own self interest. The 1% has grown wealthy beyond your wildest imagination. Then they are using global arbitrage to manufacture products outside of the USA and sell it back to us. By raising tariffs you allow local producers to undercut foreign production. It’s that simple. Things made here are cheaper. It’s better for our wages and national economy. It is superior policy for US working class. Prices don’t even necessarily rise if it is made here.", "score": 0, "replies": [{"body": "\\>I am quite educated.\n\noh, you sound quite educated...and also quite wealthy, lol.", "score": 2, "replies": [{"body": "Are you done personally attacking me? My arguments are absolutely true that socialist/marxist technocrats and central planners in our government along with a very small group of executives are undermining the interests of the American people by allowing multinationals to offshore production and undercut wages. It results in the central few getting phenomenally wealthy and American/foreign wages generally compressing. This phenomenon of global wealth flattening with a small very wealthy central technocratic elite is not antisemitism, it was YOU who made that connection, and accusing me of being uneducated for observing this obvious emergence on our civilization is quite ironic.\n\nYou don't even realize it but by attacking Trump and his base you have positioned yourself as the defender of the decay of American prosperity and the third world-ification of American society. Centralized planning and wealth concentration with socialist handouts for the impoverished masses is the defining feature of socialism, and you are gleefully defending this terrible trend because muh orange man bad. Come on. He is fighting for your self interest by keeping the wealth on our shores and returning wage growth the American working class.", "score": 1, "replies": [{"body": "This is some delicious word salad.  Do you mind if I use this?", "score": 3, "replies": [{"body": "It is clear you have no interest in meaningfully engaging in policy discussion because you have a poor grasp of underlying economic and political trends, and instead repeatedly resort to petty attacks. Really, you aren't very good at this. Have a nice day.", "score": -1, "replies": []}]}]}]}]}]}]}]}
{"title": "$TSLA Daily Investor Discussion - August 23, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "cubefy", "created_utc": 1566551960.0, "score": 7, "upvote_ratio": 0.9, "num_comments": 271, "comments": [{"body": "Trade wars are good and easy to win", "score": 13, "replies": [{"body": "Sold all my TSLA stock and bought Fentanyl.", "score": 16, "replies": [{"body": "That will certainly help dull the pain", "score": 5, "replies": []}, {"body": "You know, you got me on that one. Probably has more potential for profit.", "score": 3, "replies": []}]}]}, {"body": "I’m convinced Trump is the Joker. He just wants to watch the world burn.", "score": 11, "replies": [{"body": "So who would be Batman?", "score": 5, "replies": [{"body": "Obviously Elon Musk.", "score": 2, "replies": [{"body": "🤦‍♂️ i’ve disappointed myself", "score": 4, "replies": []}]}]}]}, {"body": "Well Trump has officially hit a new level of stupid...", "score": 16, "replies": [{"body": "And i'm pretty sure he's gonna prove he hasn't reached his limit yet", "score": 9, "replies": []}, {"body": "I wonder what trump thinks of Elon building a factory in China... and that factory financed by the Chinese govt to boot...", "score": 4, "replies": [{"body": "Trump is fine with that since Tesla isn’t going to be sending cars from China to USA", "score": 7, "replies": []}, {"body": "There's nothing Trump can do about that", "score": 3, "replies": []}]}, {"body": "I keep on thinking I should buy gold/silver even after the run up", "score": 3, "replies": [{"body": "Cash is also a position.", "score": 3, "replies": [{"body": "Not when central banks are falling over themselves trying to make it worthless.", "score": 3, "replies": [{"body": "USD has been crushing against all other currencies right now.", "score": 1, "replies": [{"body": "Flight to safety, the fed is still cutting rates despite the unemployment rate being under 4% and inflation sitting at 1.8%.", "score": 1, "replies": [{"body": "The reason why the dollar is going up is a lack of dollar liquidity. Not because the Fed is lowering rates. The global macro conditions are a lot worse than people realize.", "score": 1, "replies": [{"body": "I was saying the dollar is strong *despite* the fed cutting rates (which should make it weaker all else being equal).", "score": 1, "replies": [{"body": "Yeah good point.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I actually think mixing in some BTC along with gold is the way to go.  People sort of have expectations about where metals should be priced, but they have no idea what a \"fair value\" for BTC is.  Both are hedges against inflation, but with BTC you can benefit from the volatility if there is an actual currency war.", "score": -1, "replies": [{"body": "I struggle with BTC because of all the technical and legal risks.  I could easily see Trump banning it as part of the trade war", "score": 1, "replies": [{"body": "Buy Monero, God ain't making any more.", "score": 1, "replies": []}]}]}]}]}, {"body": "I'll buy Tesla all the way down to zero. These are buying opportunities.", "score": 17, "replies": [{"body": "Yessssssss", "score": 1, "replies": []}, {"body": "But what if it goes to 0.... would that change your opinion of things?", "score": 1, "replies": [{"body": "Yeah I mean we can't buy if it goes to zero but we can def buy if it goes to not-zero amirite?", "score": 1, "replies": [{"body": "Of course, but if it goes to $200 to $1.00 would people actually be buying then? Same goes for $10,$20,50,100 at what point is it enough? This is more of a psychological question right now", "score": 1, "replies": [{"body": "nah. That makes zero sense. VW can't pay enough for batteries w 56 billion dollars in one year from Samsung. How exactly is it going to have a real market value of below 40B when you combine the fact that they have the only electric cars anyone actually wants to buy all of what they can make of?", "score": 0, "replies": [{"body": "What are you talking about? They can’t make any money at record deliveries? How does that bode well for the health of the future business at all? The company also has a mountain of debt, payables due to suppliers, and obligations to Panasonic. So ya it going down to 0 makes sense\n\nEdit: the valuation isn’t part of the psychological question,,, if Tesla goes to say $50 would people keep buying?", "score": 4, "replies": [{"body": "You're only looking at Tesla, while completely ignoring the whole market.  I'm getting questions about buying a Model 3 from university professors (co-workers of my wife), to software developers (co-workers of myself or people I used to work with and know I drive a Tesla) to even our cleaning lady today!  I understand that you're laser-focused on Tesla, but there's a bigger change and it's organically growing.  You won't see it in numbers until after it's happened.", "score": 1, "replies": [{"body": "Literally not the point of my original question at all. I can go into the unprofitable nature of the company and how the demand, which is a function of price, is weak, your anecdotal data means very little to me. I can point to the record deliveries and fact they lost $400 million dollars. How s/x is fairly weak and unlikely to improve in a meaningful sense. How Norway is full of SR* which will weigh down the ASP if Europe is similar. How they will struggle to be profitable until giga 3 is online and even at that point it will be a stretch. How model Y will just cannablize what is left of the 3 and X sales at that point just like the 3 cannablizes the s. But all of that is not what I was asking.", "score": 3, "replies": [{"body": "RemindMe! 6 months from now", "score": 2, "replies": [{"body": "I will be messaging you on [**2020-02-23 20:53:00 UTC**](http://www.wolframalpha.com/input/?i=2020-02-23%2020:53:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/teslainvestorsclub/comments/cubefy/tsla_daily_investor_discussion_august_23_2019/exv6m68/)\n\n[**3 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2Fcubefy%2Ftsla_daily_investor_discussion_august_23_2019%2Fexv6m68%2F%5D%0A%0ARemindMe%21%202020-02-23%2020%3A53%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20cubefy)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/c5l9ie/remindmebot_info_v20/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "Remindme! 6 months", "score": 1, "replies": [{"body": "Make it 7-8 months so Q3 and Q4 results are out!", "score": 1, "replies": []}]}, {"body": "RemindMe! 6 months", "score": 1, "replies": []}, {"body": "They can sell cars at loss for many years while still creating market value. \n\nGrow the EV market by 90% per year at a massive loss, ICE sales are declining 30% y/y in a lot of places so even if Tesla becomes more and more unprofitable they still have market value because they are literally running every other car maker out of the market. \n\nYou don't think there's enough investors and governments out there that would be willing to spend $1 trillion on solving climate change if Tesla could deliver a solution? Make 10 million electric cars a year with billions in losses, but if every other automaker is out of business then there would be enough government money from around the world that could be channeled into Tesla to keep them alive. \n\nAs was the case with SpaceX, when they succeeded in building a rocket that could get to orbit they were given NASA contracts for billions of dollars and now they are getting defense contracts that's pretty much secured SpaceX's future indefinitely. \n\nIf Tesla can deliver what they are promising then money or profitability won't be a concern, it will just come naturally. Staying alive, ramping up, and delivering on their promises that's all that matters for Tesla.", "score": 1, "replies": [{"body": "Yeah before we get into Tesla just to address spaceX. They are unprofitable. They will continue to be so because they undercut other competitors and operate at a loss. The missions they fly can easily be done by Lockheed Martin if the returns were greater than the cost of capital. SpaceX still loses money and constantly needs to raise capital, so no their future isn’t secured indefinitely. \n\nTesla has never ramped up and delivered profitability. They have never ramped up and delivered their promises on time, what makes you so sure they can on a go forward basis. Elon, while a great marketer and self promoter, is a terrible operator of businesses. That is why the bears would love to kee him at CEO, he will keep shooting the company in the foot and one day all the mistakes will add up and the equity price will reflect that. \n\nDo you think there is enough capital to grow their market at a loss for the next 5 years? Because their recent capital raise was effectively >8% when accounting for the convertible. Keep in mind rates were about 2% at the time, high yield bond equivalent cost of capital. \n\nNo I do not think governments would give Tesla a trillion dollars to “solve climate change” especially since man made climate change is actually an extremely small percentage of the actual changing of the global temps. Recent joined study between Swedish and Japanese scientists show that. I don’t want to talk climate change here because that is more political than Tesla is and quite frankly the science is pretty bullshit and unfounded. Would go into deeper if you want to but generally the science: correlation vs. causation and the actual recording of temperature are weak associations. So no I definitely do not believe governments would do that. \n\nCompanies exist to make money: Tesla does not do that and has not done that for 16 years. The operate at a loss and make your competitors weak has always been a theory that has never played out fully in an industry- ever.", "score": 4, "replies": []}, {"body": "\"solving climate change\"\n\n-> autos all around account for something like 20% of global emission. Tesla is far from proposing a world breaking solution to climate change you know? even if it indeed goes in the right direction, it is not a solution.", "score": 1, "replies": []}]}]}, {"body": "Sales matter way less than ASP in Tesla case. SCalability is still not a sure thing right now.", "score": 1, "replies": []}]}, {"body": "they're also going to directly make tens of billions from other competitors increasingly every year since competition can't produce EV cars worth buying. Did you ever consider the psychological effect of that? As I said, VW can't even buy 1 year of supply for 56 BILLION in EV batteries from Samsung, and yet they're supposed to somehow be competing in the near future and profitable. Sure thing", "score": 1, "replies": [{"body": "By are you even taking about VW?", "score": 1, "replies": [{"body": "because it's a real live example of who the competition is and what it costs for a supply of batteries.", "score": 1, "replies": [{"body": "We aren’t talking about batteries, are you confusing this conversation with a separate one", "score": 1, "replies": [{"body": "we're talking about the valuation of the stock. You're asking if we would still buy. Most people based on valuation would still buy because in a funk the company can always just rely on the gigafactory to generate new revenue sources. The only reason they aren't is because there's no financial necessity and it would strengthen competitors in a currently niche market to supersede them.", "score": 1, "replies": []}]}]}, {"body": "Is there a comprehensive version of this comment coming at a later date? :)", "score": 1, "replies": [{"body": "Sorry, meant why and autocorrected when I hit submit. VW was not the topic. It was at what dollar point to buyers stop “buying the dip” after consistent failure at profitability? Does it ever happen? Does it only happen if Elon leaves?", "score": 1, "replies": [{"body": "I don't know, depends from buyer to buyer\n\nIf it were to drop below 175, i'd probably stop buying. But that's just me.", "score": 1, "replies": [{"body": "Yes that’s a fair answer, and more of what I would be interested in", "score": 1, "replies": [{"body": "I'd still hold my existing shares though :)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "yes. If they keep making the greatest cars of all time which of all are all sold at profit. Unless you think that building factories is free of course.", "score": 1, "replies": [{"body": "For sure, that’s why they’ve made so much profit the past 5 years... good product does not make a good business (and that good product is debatable)", "score": 1, "replies": [{"body": "they continue to win awards. A car by competitors still doesn't exist for the 2013 Model S. If you want to look at the future look at the clear trend with who is increasing or decreasing revenues and sales, or getting awards. But good luck with your short thesis.", "score": 1, "replies": [{"body": "you clearly have no experience in finance or manufacturing so have a great day.", "score": 4, "replies": [{"body": "literally made 35% mostly trading TSLA swings last year and I work in finance. Have a great day honey.", "score": 2, "replies": [{"body": "Honey? Okay. Anyway you brought up VW for some unknown reason that made 0 sense, congrats on your gains but again you didn’t answer the psychological question I posed", "score": 1, "replies": [{"body": "Logic is simple:\n(1) Tesla is an Electric Vehicle company\n(2) they make and easily procure electric batteries at gigafactory in association with Panasonic\n(3) other EVs have tried and failed to procure batteries including VW which tried to pay Samsung 56 billion dollars\n(4) TSLA market cap is 38 billion today.\n(5) other companies are paying TSLA for EV tax credits in billions because they cannot either make enough cars, or they cannot sell them (and part of that involves batteries).\n(6) TSLA is way under valued and this is just illustrating a tiny example of why.\n\nThis is an investor sub btw, so obviously this is relevant to the valuation of the stock -- all value is relative.", "score": 2, "replies": [{"body": "Panasonic owns the equipment that makes those batteries, Tesla also has a take or pay contract that they have 15 billion of obligations for. The company that Tesla is using for their China battery procurement is in fact the same that VW is using for theirs. I don’t see your source on the 56 billion dollar deal, and I doubt VW couldn’t get a bigger deal with LG chem. That handles points 1-3\n\nPoint 4 Tesla has an enterprise value of $50 billion (maybe less since the stock is down 4% today) \n\n5) the actual money to Tesla is not anywhere close to billions, (you’re talking the fca right?)\n\nAgain my question which you have refused to address is what happens if the stock goes to $50 or $100? Do the current buyer base of the stock continue to buy the dip? If not what price do you think that that happens?\n\nIf the company loses another 400 million in the next 2 quarters I could easily see this happening. If there is any type of US recession this could easily happen as well. \n\nP. S the fact you use market cap instead of enterprise value when discussing this company shows that you probably don’t work in finance", "score": 2, "replies": [{"body": "1st point: They literally own the factory and lease some of the cells to Panasonic, and do manufacture their own. If the IPs, facility and literally engineers improving the process are Tesla engineers, does that make it oriented around Panasonic or vice versa?\nhttps://en.m.wikipedia.org/wiki/Gigafactory_1\n\n2nd point: https://www.bloomberg.com/news/articles/2019-05-27/vw-to-reshuffle-56-billion-battery-push-as-samsung-deal-at-risk\n\nThe point is that it costs them 56 billion for an unsatisfactory agreement. And it is about valuation, not propriety; you brought up the subject of when people would or wouldn't buy and that is directly oriented around this.\n\nThey also do produce their own electronic batteries, and have a system for doing that at scale which they had a partnership to develop.\n\n5) the money is literally billions already and it will be increasing. I am talking about both in Europe and with initiatives in the US in places like California. Where are you getting your news?\n\nThe reason I use market cap is it's a much easier to look at and understand for the laymen investor. Pointing out the larger figure does not dilute the point at all.", "score": 2, "replies": [{"body": "**Gigafactory 1**\n\nThe Tesla Gigafactory 1 is a lithium-ion battery and electric vehicle subassembly factory near Reno, Nevada. The facility is owned and operated by Tesla, Inc. to supply the battery packs for its electric vehicles and stationary storage systems. It is located at the Tahoe Reno Industrial Center (TRIC) in Storey County, and employs around 3,000 people as of August 2018.The factory started limited production of Powerwalls and Powerpacks in the first quarter of 2016 using battery cells produced elsewhere, and began mass production of cells in January 2017.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/teslainvestorsclub/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "score": 1, "replies": []}, {"body": "Jut want to first address fca. It’s “billions” over an indeterminate amount of time, and I believe Elon has admitted that it won’t come close to that this year or the next. That amount is in the future when the credits are needed, quite uncertain depending on how many of their own vehicles are sold. Furthermore US incentives are dropping substantially and Tesla is unlikely to be the beneficiary of much more - especially if the Buffalo plant is an absolutely state subsidy failure \n\nYou’re wrong on the engineers and manufacturing and equipment, that is all Panasonic. Tesla also owes $15bn to pana over x amount of years. \n\nMy question is when do you think buyers have will have had enough of the stock falls? If the stock goes down 50% from here do you think people will continue to buy the dip or wait? That is the heart of my question and not pertinent to the VW discussion. We can talk valuation separately my psychological question was regarding Tesla and the rabid fan base to always “buy the dip”\n\nWhen you have 12billion in debt and any partnership stake or takeover it is important to include that, especially for a company that generates little to no cash, has been an operational failure, and is no longer growing (sorry for the cheap shots at the end just couldn’t resist)", "score": 1, "replies": [{"body": "Re: debt, they literally raise more money than they sought to in less than 2 weeks to the tune of + 2 billion, and revenue is increasing. They've also had no issues paying off any of their bonds in cash on hand. This is a non-issue when you look at any growth stock. Companies such as Amazon or FB 10 years into their IPOs are laughable in comparison as they were bringing in net negative revenues almost the entire time with significantly more debt.", "score": 2, "replies": []}, {"body": "They owe 15 billion over several years and own the technology. And yes, it is Tesla's engineers working on the process itself and they have a the ability to produce their own cells. Aside from that, 15 billion is a drop in the bucket compared to 56 billion for one deal (re:why am I bringing it up? if other agreements were publicized, I would use those as a reference but this is what I get from following typical news outlets).\n\nI think most of Tesla's price movement is legitimately not regular  individual owners; around 30% of the shares are consistently floating, and another 25% ish are the largest individual shareholders whom are largely on Tesla's board or who have a vested interest in the company long term (Musk owns 20% followed by Larry Ellison and several others). It is hedge funds and financial institutions and this is exactly why the bottom isn't lower than it is for a mostly speculative company. \n\nBut even considering the dips, you have to look at: (1) which company is holding the largest opportunity right now, (2) where is the competition? I am still waiting for pragmatic alternatives. So far only Rivian and whether they can survive is a question that remains; we know Tesla has been here for 10 years now and revenue is growing yearly in double digits consistently -- this is in contrast to other major companies which while have not all had bad years. This is not considering that the infra is just not there for basic things like charging. (3) can other companies even produce EVs in significant quantity that anyone wants to buy? I cannot find a company with comparable global sales for electric cars and if they do not ramp up quickly then major auto companies will lose money to regulations.\n\nSo I'm not saying that people WON'T sell Tesla, but as a mainly tech/growth stock, it is not very likely that people would just sell to get to that point because there is a support level and it doesn't seem like a recession would affect it much. If it goes to 50 yeah probably people would sell. But how would it go to 50 if most of the money moving around in it now is options traders? The fact that it is so heavily shorted is exactly why there is so much volatility but also, as a corollary, why there is a floor to the stock price at the moment. There are some extremely lose hands, and some very guarded hands. Personally I would not be an idiot and keep it in below 150 ish as I like to have money, but I would also not immediately sell it off on signs of negative news as the company's revenue stream is going to continue to increase while others are given increasing penalties for failing to modernize.", "score": 1, "replies": [{"body": "Tesla owes 15 billion over several years is an awful lot for a company that can barely break even on a cash base in a single quarter. \n\nAudi, Porsche and Mercedes will decimate s/x sales. Audi and jag (which is pretty damning if jag is taking share) are already doing so in Europe. What happens when the big boys arrive. They don’t all have to be a Tesla killer but collectively they will. Tesla has been here for 16 years and has had 4 profitable quarters followed by massive unprofitability. Tesla is growing because they are effectively\nOperating at a loss and can not sustain their overhead.  Charging, like you mentioned, isn’t there because Tesla has failed to put the infrastructure there despite the billions of government subsidies and billions of capital that Investors have burnt. Tesla is completely unprepared for the infrastructure that they must provide to their customer. EVs are a very niche market and while you may think they get to a high % of total cars that may not happen, furthermore companies are banding together and doing things like electrify America, not going to Tesla to try and be a part of their infrastructure. While other companies can share in the infra buildout, Tesla is on its own. \n\nIt’s a tech (it’s not)/growth stock? what happens if the growth stops?\n\nI do appreciate your perspective on the last part though, I find that helpful/insightful even though I disagree with your analysis above it", "score": 1, "replies": [{"body": "why would you make a statement like Porsche/Audi will decimate s/x sales when this has not happened with any competitor for almost 7 years now and they have tried? \n\ndo you work for a hedge fund or something? lol that's completely conjecture and not relevant, and also showing cognitive dissonance towards reality at the moment.", "score": 2, "replies": [{"body": "also why compare to a 7 year old car at all? Model 3 has a consistent ASP of over 50k (which is better for profits considering half of that is software or not worth the cost e.g. Model X to manufacture), and Y is around the corner. Most people aren't going to pay more for a luxury car, and definitely not in volume. Besides, big boys haven't been able to manufacture EVs profitably, how would this be different or help in the long term? Market is pretty huge and none of them have sold an EV to a consistent comparable level yet outside of a niche debut month.", "score": 2, "replies": [{"body": "Why does it matter if it’s a 7 year car.... where is the refresh. That would cost hundreds of millions if not billions. Those models also contribute the most to gross margin but who cares right???\n\nThe bigger companies have units that actually make money to offset losses from EV development. Does Tesla have that? They lost 1.1 billion the last 2 quarters? They delivered record quantity vehicles and lost 400 million... that’s not good", "score": 1, "replies": [{"body": "did you forget to look at how much revenue they pulled in for that 400m loss or what it costs to scale a company there? lol", "score": 2, "replies": [{"body": "They’ve been scaling for 16 years and can’t figure it out. What’s your expectation for next quarter? What happened to profitable all quarters going forward? Revenue will be down both sequentially and y/y in the 3rd and 4th quarters of this year. What happens to your argument then?", "score": 1, "replies": [{"body": "they've been scaling up pretty well. When you design a factory you don't instantly start to reproduce it without working out the issues which exponentiate liability or  dilute your investment by bringing in 3rd parties. This is very similar to software development projects or any industrial manufacturing systems actually.", "score": 2, "replies": [{"body": "They’ve been a company for 16 years and have been unprofitable for all of them. This is t a software company, it is manufacturing of vehicles. This may be the crux of our entire argument: you think they are a tech and software compa y when in reality they are not. They are a high end niche auto manufacturer which is why they had reasonably high margins for a short period of time. Now competition is arriving and the market is saturated, and the brand is degrading because of bad service, and then margins come down. Which we say over 1H 2019. Manufacturing is very different than software development. I am SHOCKED that you would equate the two as similar businesses. You said you’re “in equity finance for the next year” go ask your boss about the difference between software and industrial manufacturing. At least then you may listen to someone you respect compared with trying to get the last word in with me all evening", "score": 1, "replies": [{"body": "Manufacturing is not terribly different from software development in the sense of scalability. If you engineer something bad and try to \"prototype\" your software into the final product, then you end up with shit software that is representative of 90% of software on the market today (where's the 10% dominate). If you get the common components correct and iterate and think those through well, things are more cohesive and less prone to exploding costs and problems which require band-aid solutions like outsourcing. The only thing and MVP is usually good for in the long term is iteration on design, but it is not a scalable way to do things in and of itself.\n\nLook at any top tech company vs every other one and tell me differently? If anything this applies MUCH MORE SO than in industrial engineering. You can black box your software but in production customers will continue to use it and you will be slowed down and still need to pay supporting costs. In industrial engineering if you decide to rush and eff it up you pay more to outsource AND to fix the problems, and it all comes at a higher price. I'm not sure how this is not common sense. This is  also why the traditional auto industry has historically had terrible margins on their cars.", "score": 2, "replies": [{"body": "Yes it is, it is wildly different, especially from a capital intensive point of view. I’m sorry we can’t have this argument anymore if you don’t understand that software and manufacturing are extremely different as a business and should be valued extremely differently. There is a phrase “you have to earn to use a multiple” something I think a lot of people here, myself included, forget. (You can’t just slap a multiple of sales (since Tesla has no earnings)) and day the similarities and call it the same pricing structure of the stock)", "score": 1, "replies": [{"body": "you have to also make sure in a capital intensive industry that you are not wasting money, when by nature there are razor thin margins. Outsourcing factories as a newcomer is just not a smart move as it would involve even lower net than they're pulling today since coordinating fixes is harder and there is also overhead and IP issues to consider. If this were a niche toy manufacturing or Yeezy manufacturing company, sure, your point stands. But not when every dollar spent in each factory counts. It's not a surprise why every American car company and even most in EV companies China including some backed by the CCP failed and the reason is because you cannot treat innovating an industry that is so competitive as if it was a simple sweatshop job; That only works with legacy companies, and as we can all see in our faces, they are not nimble and able to adapt to the market very well as a result.", "score": 2, "replies": [{"body": "Literally who wastes more money than Elon? Alien dreadnaugjt anyone??\n\nI’m really sorry you just don’t know what your talking about regarding manufacturing, especially as it compares to software. Software = low capital intensity, pricing advantages, generally a good business\n\nTesla and other manufacturing= thin margins, high capital intensity (think about the costs to fix a problem, of which Tesla has many), pricing disadvantages, high upkeep/warranty costs, factory depreciation and replacement. \n\nI don’t know why you are preaching about the negatives of a capital intensive industry when discussing Tesla, because Tesla is in such an industry and you seem bullish on the company, but you can make my argument for me if you want.", "score": 1, "replies": [{"body": "yes and they also have the best software and are much less prone to defects or extreme maintainance since they aren't approaching the problem as a gradual transition away from the current inferior hybrids. Have you ever noticed what the top 10 reasons of vehicle failure are in the US, or just paid attention to how much maintainance your own car needs and why? (Hint: it is 9/10 revolving around the combustible engines or supporting features).", "score": 2, "replies": [{"body": "This business is not in the slightest way similar to a software company. Full stop. Go ask your boss who you may respect the opinion of. We just keep going around in circles arguing. They do not have the best software, that is just your opinion. I would argue cruise and mobileye are way better. Prove me wrong. \n\nHave a great night bud", "score": 1, "replies": [{"body": "No need to prove, we'll just see if the company ends up with any excess inventory in the coming few quarters when the new Gigafactory ramps up, and if there's a short squeeze going into next year 🙃\n\n(And Night sir)", "score": 2, "replies": [{"body": "Not just excess inventory, they need to make a profit for the next 2 quarters.", "score": 1, "replies": [{"body": "that's a subjective valuation -- I think if they continue on growth mode, then there's no need to worry and others would likely agree. In terms of proving whether the software is decent, the car is selling all that are produced on word of mouth today. If the software was not good in comparison to others (and it is also rapidly improving that baseline with OTA updates), it would not sell. If there is no excess inventory, and they continue not resort to placing ads on top of that, then the product and thus one aspect of real company fundamentals is definitively satisfied.", "score": 2, "replies": [{"body": "How the fuck is that subjective? Anything sells if you make it cheap enough? I’d buy a damn car if it was $1. \n\nYou argument makes 0 sense in relation to saying if the software is good or not. No one buys the car just for the software.... what if revenues go down y/y or q/q? Would that be a better proxy??", "score": 1, "replies": [{"body": "lol they make over 20% margin on the actual physical M3 cars produced on average what is your point with this black and white narrative? I am saying that different people value the stock based on different things. It's a growth stock and based on subjectivity. You're looking at net cash but they literally just paid off a billion dollars in bonds and have other operational expenses which have nothing to do with car manufacturing. If you're here to support a short thesis, at least paint an accurate picture to be more persuasive.", "score": 2, "replies": [{"body": "the other operational expenses, sg&a and r&d have everything to do with car manufacturing. I mean cmon man they have decreasing margins that can’t cover their over head. They haven’t made a profit in 16 years. Y/y growth is about to go negative and so is potentially sequential growth. They literally have never developed a profitable car, how do you expect them to actually do that going forward. You cling to their software by saying that is the leading indicator of their sales? \n\nI mean I don’t. Have to be that Persuasive, I don’t need to convince you of anything, you’re not going to be convinced. I’m here having a discussion because it’s fun to argue about this company and stock. Whether you buy or sell will have 0 impact on my life and obviously the stock price. Every sub here could sell their shares on Monday and the stock would barely react. \n\nI’m not even looking at net cash. I’m forecasting free cash flow on a go forward basis and the picture is ugly for this company. They have massive liabilities, massive off Balance sheet obligations, and massive potential lawsuit liabilities, plus declining margins and sales. Every bull clings to the future because they can’t point to any point in the past that Elon has executed successfully on time or for a profit. Elon is the best bear ceo because he will continue to destroy capita at an almost unseen rate", "score": 1, "replies": [{"body": "there's a lot of cognitive dissonance going on here. They make 20%+ margin per extra car produced. The production rate is ramping up and they are the only company where people legitimately want to buy their electric cars en masse, and they aren't even advertising. There's in the real world no actual competition anywhere to be seen and Rivial isn't even competing for the same market segments within the near future.\n\nIt's not like they can't advertise and they wanted to either (is there a la?), and it's not that hard to understand that they can easily raise money as they always out raise their goal within a week, and they can flip the switch on and advertise like any other company on a whim if they were *actually* at risk of imploding.  \n\nYou might be on one spectrum of the Elon Haters club vs Elon worshippers club, but I'm gonna profit from this stock yet again this year or early next year and use it to continue to fund an accelerated retirement plan 😎✌️ (with a handful of other easy highly shorted swing stocks as well of course such as Roku). Literally already up double digits this year on 300 shares thanks to the easy predictable nature of TSLA and 35% last year, lol... but keep believing it's going to finally crash and place your short bet while other equally upright people bet on it going to 4k because of some magical full night rider level FSD software that will not exist for 5+ years. Either way I am making and will continue to profit when the stock hits low points like this and goes back to its range based on predictable growth, fanatics and people just in denial about legacy auto companies that cover up their problems modernizing with expensive marketing campaigns. It is absolutely great that TSLA is saturated with options traders (especially shirts) because the volatility makes it easy money with no contract fees and ironically very small risk of non recovery in worst case scenarios.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Because they haven’t been trying... they had to do a full development. Tesla couldn’t make money with s/x and now the highest gross margin vehicles will be facing the biggest competition...", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Because they run the company at a loss after accounting for all of their costs.", "score": 1, "replies": []}, {"body": "**looks at votes** nice, short shills are here. You guys always come around late to the party hoping for an implosion or whatever. Good luck missing your dip.", "score": 0, "replies": []}]}]}]}, {"body": "Well it was reported just a few days ago that Volkswagen's CEO said they were looking into acquire a stake in Tesla. \n\nAs long as there's anyone out there who is still willing to buy it won't be worth $0.", "score": -1, "replies": [{"body": "They literally denied that 39 minutes after that report...\n\nAlso: if they can’t pay their creditors the equity would go to 0... does that have a non-zero chance of happening? I think so", "score": 4, "replies": []}]}]}]}, {"body": "Looks like we’ll go below $220 today... \n\n\n^trying ^to ^get ^a ^streak ^going", "score": 11, "replies": [{"body": "Can you change your comment to “Looks like we’ll go below $250 today....”", "score": 3, "replies": [{"body": "patience is a virtue!", "score": 1, "replies": []}]}, {"body": "damn i am glad i found this subreddit, all you need with this stock is confidence and a painthreshhold, damn all these \"bad news\" or manufactured bad news aka \"FUD\" its really tough to see all this while the stock goes down. so its nice to see people here with same confidence", "score": 2, "replies": [{"body": "Glad you like it! One warning though: you have a brand new account and no karma (yet) which means all of your comments are going to be removed by Automoderator until one us manually approves it (like I just did).  I'm afraid this will last for a month... We should probably change a few of those Automoderator parameters though.  Anyway, I keep an eye out for comments that were removed automatically so at worst, your comments will appear with a delay for the first month.  Sorry about this, but we've had bad experiences with people creating new accounts and then trolling relentlessly.", "score": 1, "replies": []}]}, {"body": "Aaaaand it's gone (the streak)", "score": 1, "replies": [{"body": "yeah, thanks a lot /u/xijinping", "score": 2, "replies": [{"body": "LOL @ the tag", "score": 1, "replies": []}]}, {"body": "https://www.youtube.com/watch?v=4TlPo0yCSa4", "score": 1, "replies": [{"body": "Oh hell yeah, where has this been all my life", "score": 1, "replies": []}]}]}]}, {"body": "How embarresing for america to elect trump in.  The guy is a walking disaster.\n\nHopefully they will correct themselves in the next election. But i don't expect that to happen.", "score": 20, "replies": [{"body": "The chinese are certainly counting on it", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "No. I don't have endless funds to keep buying tesla on every negative day. \nI want trump to run the country efficiently so businesses can thrive and investors get a return on their money.\n\nIm just glad he hasn't caused a recession yet and bankrupted the company.", "score": 2, "replies": []}, {"body": "The “trump thing” caused China to place tariffs on autos, which damages Tesla specifically more than other companies in the market for more than one day.", "score": 1, "replies": []}]}, {"body": "DNC has a slam dunk set up for a win in 2020 but they’re going to blow it by putting up an ultra progressive candidate.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Counter view: Trump will have a hard time getting his base out if the opponent is someone like Biden.  They'll turn up just to oppose someone like Sanders.  The Democratic base will get out to vote just to fuck over Trump regardless of who they field.", "score": 3, "replies": [{"body": "I think trying to predict what everyone else is going to do is a losing game, evidenced by 2016. Just vote for who you think has the right policy set", "score": 1, "replies": []}]}, {"body": "The progressives are often the swing voters.  Moderates are harder to move because they tend to believe in moderation itself", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": -2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Both comments were removed, and IMO, you both took it too far", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No worries, let's just avoid this stuff in the future", "score": 1, "replies": []}]}]}]}]}]}, {"body": "https://www.theguardian.com/business/live/2019/aug/23/rbs-santander-ppi-jackson-hole-jerome-powell-federal-reserve-dollar-sterling-pound-brexit-business-live?page=with:block-5d5fdb968f08a0805bcc334b#block-5d5fdb968f08a0805bcc334b\n\n> We have confirmation of the trade action hinted at by the Global Times editor earlier: China will impose tariffs on American exports worth about $75bn.\n\n> China’s ministry of commerce said it will impose levies of 5% and 10% on more than 5,000 products originating in the US, with crude oil, small aircraft and cars among the items targeted, Reuters reported.\n\n> Some of the tariffs will take effect on 1 September, with the rest on 15 December.\n\nif only they'd slap tariffs on all cars _except_ EVs ...", "score": 5, "replies": [{"body": "China has plenty of domestic EV companies.", "score": 8, "replies": []}, {"body": "Looks like it is up to Powell to save the market!\n\nEdit: Why the downvotes?  Powell's speech pushed markets into the green before Trump had his temper tantrum.", "score": 1, "replies": [{"body": "Cheer up, have an upvote", "score": 1, "replies": []}]}, {"body": "more info here:\nhttps://www.cnbc.com/2019/08/23/china-to-retaliate-with-new-tariffs-on-another-75-billion-worth-of-us-goods.html", "score": 1, "replies": [{"body": "if they impose a 25% tariff on any American car, wouldn't this be a huge drop for TSLA (and other cars producer) ? why is it only -1% below at the moment?", "score": 1, "replies": [{"body": ">why is it only -1% below at the moment?\n\n\\-3.54% right now. Yeah :-(", "score": 3, "replies": []}, {"body": "compare nutty toy one sharp bike wrench yam six juggle\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 4, "replies": [{"body": "The high end model sales shipped from Fremont would still be hit. (High end 3s, S and X)", "score": 2, "replies": []}, {"body": "I see. So would that mean that it is not considered anymore a US car company?", "score": 1, "replies": [{"body": "the tariffs are added to _goods_ imported from the US.  So once Model 3's are produced in China, Tesla only has to pay tariffs on parts that it needs to import (from the US, no idea how many parts would fit under this) to produce the cars.  The final product would no longer be subject to the tariffs", "score": 5, "replies": [{"body": "The parts would be imported to Giga 3 which is in the FTZ expansion area. Shouldn’t be tariffs for parts shipped in to make a finished product produced in the area.", "score": 1, "replies": [{"body": "Ah good point, thx!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Wish I had extra money to invest :[", "score": 6, "replies": [{"body": "i mean i do have extra to invest currently i have about 30% of my total networth(which isn´t a crazy amount), i am about to be a student for the next 5 years, so right now i wont really need the money, and in 5 years i will hopefully earn a lot more than what i have right now, so i might invest up to 50 % in tesla if Q3-Q4 still prove that they have a lot of Cash, they already won the technology and branding, so yeah i think its just a waiting game until eventually model y comes out or full autonomy comes out, plus i am super excited for the roadster to go down the streets that will truly make people believe in electrics, i have learned that for most people to change their views on anything, they need Concrete evidence they can touch and watch with their own eyes.", "score": 2, "replies": [{"body": "If you're about to go to college, you're young enough to earn back the money in case you'd lose it all (i doubt that'll happen, but you have to keep it in mind anyways).", "score": 1, "replies": [{"body": "exactly my point, losing what now is worth 50 shares is anooying but i can earn it back If i was to lose them, but i can´t earn back the upside in the same amount of time, and i think the odds of it going is is far more likely than going bankrupt, but yeah sucks to lose money but atleast we are helping a company Save/change the world for the better", "score": 2, "replies": [{"body": "Man, I wish I had this mindset when I was your age... good luck!", "score": 2, "replies": []}]}]}]}]}, {"body": "Add another 50 shares\\~ Finger crossed!", "score": 4, "replies": [{"body": "Should hold on to those till next summer.", "score": 2, "replies": []}]}, {"body": "Like most, I continue to be baffled by Trump and the unpredictability of the economy during his administration. For Tesla, I've placed a series of small (single-share) limit orders at $5 increments from $210 down to pick up the odd deal should things spiral in the coming days. Otherwise, life goes on. I'm still new to all this and not sweating the day-to-day rollercoaster. The fundamentals are exceptional and I wish I were in my current (stable) financial situation years ago to get in before Model 3.", "score": 7, "replies": [{"body": "May I ask what fundamentals you are looking at to consider this company exceptional?", "score": 4, "replies": []}, {"body": "[deleted]", "score": -17, "replies": [{"body": "Why tf were you downvoted so hard? I agree", "score": 2, "replies": []}]}]}, {"body": "Make ~~America~~ Short-Selling Great Again", "score": 10, "replies": []}, {"body": "Well at least I can average down my price. Positive vibes on a Friday. Gonna be a nervewracking weekend.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Probably not the best place to ask this question", "score": 13, "replies": []}, {"body": "Note that this is not actual investment advice... you should only make trades you feel really comfortable with.\n\nIf you're really a bull, then yeah, this is a good time.  However, things might get a bit rocky for a while, especially since Trump is currently saying that he's going to handle the situation brilliantly this afternoon.  Maybe he's got something up his sleeve that'll push the markets back into the green and you might feel like you’ve missed out on a nice buying opportunity.\n\nOn the other hand, Trump's upcoming ‘brilliant’ manoeuvre might as well strengthen the current sell-off, enabling you to get more shares for the same money, or spend less money on the number of shares you have in mind.   \n\nRight now, even I would wait until I hear what Trump has got up his sleeve... if he announces when the market is open and it's positive, buy ASAP.  If the market doesn't react positively, wait until monday and re-evaluate.  If he announces after-hours, and aftermarket goes up, you're probably only looking at a $5 rise by monday morning... you will have missed out just a little bit, but if you're a bull, you got waaaay higher targets in mind anyway. \n\nBut once again: this is not actual investment advice... you should only make trades you feel really comfortable with.", "score": 9, "replies": [{"body": "I like to get comfortable with my trades before I execute them. I call it the Kim Jong Il method.", "score": 2, "replies": [{"body": "Oh crap, did I mess up the translation? English isn't my native language :)", "score": 1, "replies": [{"body": "No I'm just being an idiot.", "score": 1, "replies": [{"body": "We all are, at some level ;)", "score": 1, "replies": []}]}, {"body": "Your English is impressive for a non-native speaker.", "score": 1, "replies": []}]}]}]}, {"body": "$211 is strong support, next support is $180 and next is $150s. I would start a position here", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "The market is only 5% off all time highs, the yield curve is inverted, countries like Germany and the UK are probably already in a recession, China and the US are both facing massive debt issues and are deepening a trade way.  It might not be the best time to invest too much money in stocks at all.", "score": 16, "replies": [{"body": "What about stonks? Should I still invest in those?", "score": 4, "replies": [{"body": "YA", "score": 3, "replies": []}]}, {"body": "Fun fact: Germany's entire yield curve is negative, and also inverted. \n\nVery Bullish.", "score": 3, "replies": [{"body": "Fun fact: this is also why the German and overall European economy is a shithole.", "score": 5, "replies": [{"body": "Well to be clear, the yields are indicative not necessarily causative.", "score": 1, "replies": [{"body": "True, I'm doubtful it's an actual recession, just more trying to say that Germany is not a good reference point lol.", "score": 1, "replies": [{"body": "Well, the European economy is unfortunately closely tied to the German auto industry... Clearly, the German auto industry is facing some challenges and it's taking the rest of the European markets along for the ride.  Combine that with the upcoming no-deal brexit and things are probably not going go that well here for the next 2 years or so.", "score": 2, "replies": [{"body": "that makes sense 🤔", "score": 1, "replies": []}]}]}]}]}]}, {"body": "At least you didn't mention Turkey this time.", "score": 0, "replies": []}]}]}]}, {"body": "Anywhere under 250$ is good if you're buying for the long term. Under 200$ is a really great deal.\n\nUnder 250: Rare,\nUnder 200: Epic,\nUnder 150: Legendary", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Mythical", "score": 7, "replies": []}]}]}, {"body": "I think so! I wish I bought at 178, waited and bought lil more than 200", "score": 1, "replies": [{"body": "In the long run, that's still a great deal and you're gonna be bragging about it 10 years from now :)", "score": 4, "replies": []}]}, {"body": "Trump is signaling that he's going to lay down the pain on american businesses who have factories in china... Pretty unfortunate timing for Tesla since they are aiming to get GF3 online before EOY. I would wait to hear how either 1. what restrictions is Trump gonna put in place to deter american businesses from manufacturing in China, or 2. What Tesla plans to do with GF3, in the wake of all this madness.\n\nIf I were you, I would wait for some answers before buying.\n\nIn the worst case scenario, if they end up scrapping GF3, that will be a big setback. As Elon has been going on for a while how China would play a big part in getting to profitability.", "score": 1, "replies": [{"body": ">scrapping GF3\n\nGet real.", "score": 3, "replies": []}, {"body": "Trump tariffs forces the push for Giga 3 in China anyways.", "score": 1, "replies": []}, {"body": "Trump is stupid. \n\nHe will only hit companies that produce in China and export to america. Because the only thing he stumble over was tariffs that he is playing around like a litte child wold.", "score": 1, "replies": []}]}]}, {"body": "VW recalls 679K cars in US\n\nhttps://abcnews.go.com/Business/wireStory/vw-recalls-679k-cars-us-fix-potential-rollaway-65146453?cid=social_twitter_abcn\n\nNo wonder these clowns are interested in Tesla! ;)", "score": 9, "replies": [{"body": "VW voluntarily recalled these cars and no injury or death has been reported on this potential issue. If Tesla had a similar issue I doubt they would issue a recall\n\nAlso, VW said they aren't interested in buying Tesla shares, that story ended up being a load of FUD.\n\nSo the story you linked has literally nothing to do with Tesla or EVs.", "score": 4, "replies": [{"body": "Anything that has to do with Tesla's competitors is relevant to Tesla", "score": 5, "replies": [{"body": "It's not a zero sum game though", "score": 4, "replies": []}]}, {"body": ">If Tesla had a similar\n\nIf you read the article you would see that this is not an issue a Tesla can acquire (:", "score": 2, "replies": [{"body": "Tesla can't have that exact issue, sure, but like I said it could have a similar issues (as in of the same \"danger\" level) and they probably wouldn't issue a recall.\n\nThree have been more AP related injuries and deaths than injuries and deaths caused by this potential issue that is being fixed.", "score": 1, "replies": [{"body": ">and they probably wouldn't issue a recall.\n\nYeah, they probably wouldn't\n\nbecause they would just fix it with an OTA update 😉", "score": 1, "replies": [{"body": "Not everything can be fixed with a software update.", "score": 1, "replies": []}, {"body": "How are those yellowing screens going? OTA update out yet?", "score": 0, "replies": []}]}]}]}, {"body": "You’re not even trying bud. Tesla has issues a number of voluntary recalls, and absolutely demonstrates they’d do the same. This story is more of a “wow a legacy OeM didn’t wait for a death to make a recall”", "score": 0, "replies": [{"body": "When has Tesla issued a recall?", "score": 1, "replies": []}]}]}]}, {"body": "Might be a bit early to start thinking about Q3 financials, but some things to consider:\n\nIn Norway, the Netherlands and Spain so far in August 54% of Model 3s delivered have been SR+, up from 9.14% in June.  In June another 8.6% were LR RWD, that percentage is down to 1.76% in August.  \n\nIf we assume 20k Model 3 European deliveries and 82.5k total Model 3 deliveries, that shift in Europe to SR+ will result in a reduction in ASPs across all Model 3s of about $1,000.  Add to that the price cuts at the beginning of the quarter and an increase in SR+ sales in China, and the reduction could wind up being closer to $2,000 in total.\n\nS/X ASPs will likely increase in the quarter, but total sales will be stagnant with the removal of the standard range models.  Lets assume ASPs increase by $5k but sales drop to 16k.  As Model 3 sales will make up a bigger percentage of sales in Q3, revenue per delivery would drop by ~$1,150 overall.    \n\nNow, even if we assume the company is able to keeps COGS flat (despite producing 13.16% more vehicles and selling 3.19% more vehicles, but with smaller batteries on average) and regulatory credit sales match Q2, that reduction in revenue per delivery will mean automotive gross profit will not change at all from Q2.  That in turn means the company will need to come up with nearly $400 million in savings/additional profits in the rest of the business to break even in Q3.  A reduction in restructuring costs will be a big help, but I'm having trouble seeing any possible way for them to make up that gap.", "score": 9, "replies": [{"body": ">In June another 8.6% were LR RWD, that percentage is down to 1.76% in August.\n\nMakes sense. You can't order the LR RWD anymore. It's only available as inventory cars, if that's even the case anymore.", "score": 7, "replies": [{"body": "Yes, I was just pointing out that the shift to SR+ is being offset in part by the fact that LR AWD is no longer available.  In other words, the total RWD mix isn't increasing quite as much as the increase for just the SR+.  Looking at the flip side, AWD variants dropped to 44% of the total mix in August from 82.25% in June.", "score": 3, "replies": [{"body": "Yeah and that's definitely going to affect ASPs.", "score": 4, "replies": []}]}]}, {"body": "At this point I find it very difficult to find a realistic price/quantity mix that gets them to profitability.", "score": 6, "replies": []}, {"body": "At the moment I'm definitely thinking more about buying at a dip rather than short term profits.", "score": 3, "replies": []}, {"body": "I'm estimating a net loss in Q3 of between $500-600 million with total revenue around $6.1 billion.", "score": 2, "replies": [{"body": "How many S/X sales are you estimating?  I'm having a tough time guessing an ASP for those models as well since they only discontinued the standard range versions halfway through July, so those will make up some percentage of this quarter's sales.", "score": 1, "replies": [{"body": "At this point it's not even about the mix for me. I don't expect the overall mix to be better than Q2. Mix will be worse in Europe, but volume will be up. Total US volume probably down or maybe even. \n\nThey made $6.3B revenue last quarter, I think they'll be down to $6.1B either due to lower ASP or volume. \n\nAll honesty, I wouldn't be surprised if they repeated Q1 losses but with greater volume.", "score": 2, "replies": []}]}]}, {"body": " [https://cleantechnica.com/2019/08/21/teslas-european-demand-rumors-get-blown-out-of-the-water/](https://cleantechnica.com/2019/08/21/teslas-european-demand-rumors-get-blown-out-of-the-water/)   \n\n\nWe'll get a better idea when the other 5 of 6 ships arrive.", "score": 1, "replies": [{"body": "Yup, they may have just done a big batch of SR+ that happened to be on the first ship.", "score": 5, "replies": [{"body": "for future reference, the ships are tracked here:\nhttps://docs.google.com/spreadsheets/d/10Uh_GSkShwPPlrE5mOJcrkZ-T3NmLkLnTo6xqbdtaOI/edit#gid=0", "score": 3, "replies": []}]}, {"body": " [https://docs.google.com/spreadsheets/d/10Uh\\_GSkShwPPlrE5mOJcrkZ-T3NmLkLnTo6xqbdtaOI/htmlview](https://docs.google.com/spreadsheets/d/10Uh_GSkShwPPlrE5mOJcrkZ-T3NmLkLnTo6xqbdtaOI/htmlview) \n\nIt's 7 now.", "score": 2, "replies": []}]}]}, {"body": "Can trump fucking stop tweeting and just do shit behind closed doors? Holy shit! His intentions are well but fucking shut up about it!", "score": 3, "replies": [{"body": "[\"His intentions are well\" ](https://www.youtube.com/watch?v=_n5E7feJHw0)", "score": 6, "replies": [{"body": "Man you just don't get it, he's [the chosen one](https://m.youtube.com/watch?v=JgwalqjF5nw)\n\n\n/s (to be _very_ clear)", "score": 1, "replies": []}]}, {"body": "Politicians doing things behind closed doors is how you get corruption. More transparency is needed, not less.", "score": 3, "replies": [{"body": "I know this. But his outbursts on Twitter remind me of Elon. It’s just too much", "score": 2, "replies": []}]}, {"body": "He wants to capitalize on his short positions.", "score": 2, "replies": []}]}, {"body": "I have to say although Tesla has been fucked up recently by macro, The pattern just keep looking more and more like a cup and handle.\nWe will see how is the price been artificially driven down by shorts next Monday. Before that, I suggest us be more patient.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Its a theory used to try and time the market. Like a lot of other timing the market theories, it often doesn't work. [It would look like this](https://i.imgur.com/QyKGQ8q.gif)\n\nIf you want a more technical explanation, look here: https://www.investopedia.com/terms/c/cupandhandle.asp", "score": 5, "replies": []}, {"body": "https://medium.com/@ronaldviatori/technical-analysis-is-bullshit-b7ffce78425e", "score": 2, "replies": [{"body": "Technicals are not complete bullshit. They are trading indicators for stock-specific factors, where a few indicators have reliability >50%. Yeze is not applying technicals correctly as the volatile macro environment nulls their effectiveness.", "score": 1, "replies": []}]}, {"body": "https://www.investopedia.com/terms/c/cupandhandle.asp", "score": 0, "replies": []}]}, {"body": "While the chart pattern may look a certain way the technicals don't mean shit if the whole market sells off. The technicals apply to stock-specific factors in a stable macro environment. They don't hold any weight if the S&P plummets 10%.", "score": 1, "replies": []}]}, {"body": "https://marketrealist.com/2019/08/david-einhorn-elon-musk-should-resign/\n\nShould he? I don’t think it’d be better for Tesla.", "score": 1, "replies": [{"body": "Both bulls and bears agree that Elon Musk remaining CEO is good for their position.", "score": 14, "replies": [{"body": "I lold", "score": 2, "replies": [{"body": "Lot of truth in that statement though :)", "score": 1, "replies": [{"body": "I know that’s why it’s funnies", "score": 1, "replies": []}]}]}]}, {"body": "Calls to replace Elon Musk are an attempt to sabotage Tesla, pure and simple.  He's one of the best assets they have and the reason they've made it this far.", "score": 10, "replies": [{"body": "Say Elon was replaced (made chairman but not CEO). How much fundamental value would you ascribe to $TSLA as a business? In other words, do you have a clear sense of the Elon premium per share?\n\nedit: removed modifier", "score": 4, "replies": [{"body": "The visionary leader has to be the one steering the ship.  Elon should keep good council, delegate more responsibility to capable people in his organization, and stop making unforced errors but, nobody else can be trusted to be bold and stubborn enough to hear something is impossible and do it anyway.  I think a Tesla without Elon at the helm is a weaker, less ambitious company that will never reach it's full potential.", "score": 2, "replies": []}, {"body": "He is not legally allowed to be chairman for 3 years", "score": 1, "replies": [{"body": "oh yeah, i forgot. sec penalty right?\n\ni was actually hoping to get a sense of what the 'musk premium' is in dollar or percentage terms to other investors.", "score": 2, "replies": [{"body": "75% for bulls I bet, probably more", "score": 3, "replies": [{"body": "I'd appreciate it if you would speak for yourself. Anybody? Bueller?", "score": 1, "replies": [{"body": "For myself if musk left I expect the stock would go down 50% in a month", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "MarketRealist is propaganda. \n\nElon is why people invest in the company. Why do you think the bears are always trying to push that idea? Because they know that people who believe ine Tesla, actually believe in Elon. He's literally the only person on this Earth who I trust can do what he is doing.", "score": 7, "replies": []}, {"body": "Elon could spill some coffee and Einhorn would be outraged and demand he step down. It's Einhorn. Maybe the Waltons should resign for treating their workers and business partners like dirt.", "score": 4, "replies": []}, {"body": "It would be better for shorts, that is why they are for him resigning.", "score": 2, "replies": []}]}, {"body": "So amazon may have the same solar fires as Walmart? What happens to Tesla if they have to impair and write off the entire solar acquisition? Would that trigger anything in their credit agreements because their balance sheet would be significantly weaker? Any thoughts from a bull on what they should do with this business segment?\n\nSource for you fucks downvoting hahaha: https://t.co/ywU6sTuJc8?amp=1\n\nhttps://mobile.twitter.com/CGrantWSJ/status/1165029361034190849\n\nWhether you like Charlie or not the source is in that screenfrab", "score": 1, "replies": [{"body": "What are you talking about?  The fire in the literal Amazon forest?\n\nSauce please", "score": 1, "replies": []}, {"body": "They should throw solar in the garbage. Tesla doesn’t belong in that business. Dumbest acquisition ever", "score": -3, "replies": [{"body": " This comment won’t age well. Tesla needs to be at the forefront of clean energy.", "score": 14, "replies": []}, {"body": "I disagree.  [I did the math on solar leases back in the day](https://www.reddit.com/r/teslainvestorsclub/comments/cj8uit/tsla_daily_investor_discussion_july_29_2019/evclviz/), and they looked profitable from my armchair.  The biggest risk to SCTY’s model was carrying long-term debt.  This made SCTY vulnerable to increased interest rates on their loans.  The model does much better under TSLA, who has an auto business to balance things out and can borrow money at better rates.  They also got GF2 as part of the deal and their Silevo tech.  And they didn’t have to pay a dime for it - it was all stock.  I truly don’t understand what everyone around here has against it.  Yeah, it’s long-term debt.  So what?  It’s also long-term contracts with customers whose average credit score is over 700.  Very stable investment imo.", "score": 5, "replies": [{"body": "Yes, I am constantly amazed at criticism of the Solar City acquisition by people who have made zero attempt to value the existing leases... I've seen comments stating the value of the existing leases more than justified the acquisition price, more than that, it was a good deal for Tesla...\n\nThey also said the issue with Solar City was long term loans secured by short term debt, short traders can sense this situation, freeze a vulnerable company out of  capital markets,  create a \"bank run\" and bankrupt a company... that is essentially what was happening with Solar City and shorts were headed for a victory.. until Tesla stepped in.\n\nSee this link:-  [https://teslamotorsclub.com/tmc/threads/elon-musk-vs-short-sellers.118431/#post-2814570](https://teslamotorsclub.com/tmc/threads/elon-musk-vs-short-sellers.118431/#post-2814570)\n\n&#x200B;\n\n>When Chanos announced his short in August 2015, his thesis was that Solarcity was a subprime lender. That at any moment, Solarcity's customers could stop paying their bills. This was ignoring the fact that Solarcity customers had an average FICO score 750, compared to below 620 to be considered subprime.  \n>  \n>Not to mention unlike defaulting on a home mortgage, where when you are underwater enough it can make financial sense.(not to mention you still get to live there for months) Defaulting on payments to Solarcity would make no financial sense, because reverting back to your utility would cost more. That was the whole value proposition from Solarcity.\n\nPeople haven't stepped back and asked the following questions:-\n\n* What is the value of the leases?\n* Can those leases service the loans?\n* Is the business model profitable over the life of the lease, even considering interest payments?\n\nWhat Tesla has a done since taking over Solar City is:-\n\n* Refinance a lot of short term debt to long term debt to better sync with lease duration...\n* Reduce overheads, in particular the cost of acquiring new customers.\n* Move to use their own panels/roof out of GF2\n* Reduce prices as a demand driver ( not 100% successful so far)\n* Reintroduce leases in a limited way in states with high subsidies...\n\n&#x200B;\n\nIt  likely the subsidies pay for a fair chunk of the cost of the panels out of GF2,\n\nTesla is installing the panels with their own staff.\n\nThe new rental product is very different to Solar City leases...", "score": 6, "replies": [{"body": "100% agreed!", "score": 1, "replies": []}, {"body": "Holy shit that TMC thread. I’ve seen it but never read it fully. Eye opening, thank you", "score": 0, "replies": []}]}, {"body": "“Auto business to balance things out”? Tesla was unprofitable at the time of the acquisition in 2016 and is still unprofitable today. How does an unprofitable business buying a bankrupt company balance things out? If anything it accelerated the bleeding of cash since they had to make large solar city debt payments.", "score": 2, "replies": [{"body": "Tesla’s growing at a 100%CAGR.  Every penny is being invested in more buildings, new equipment, R&D for next-gen tech, etc.  I don’t think you can hold ‘unprofitability’ against them.  Their auto margins are at 20%, with much room to grow as autopilot becomes more and more capable.\n\nIn any case - my point was simply that Tesla is able to borrow money at better rates than SCTY was.", "score": 4, "replies": [{"body": ">Tesla’s growing at a 100%CAGR\n\nNot after this quarter.", "score": 6, "replies": [{"body": "Yeah I don’t expect them to keep that up indefinitely.  It’ll probably settle at around 50% avg", "score": 0, "replies": [{"body": "Not after this quarter.", "score": 4, "replies": [{"body": ">avg", "score": 1, "replies": [{"body": "I know what you said.", "score": 3, "replies": [{"body": "Haha okay!  :)", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Telsa can’t borrow at better rates because they are overlevered and the auto business a) is bad and b) is unprofitable. Furthermore there is a reason solar city almost went bankrupt \n\nYou’re also ignoring the price that Elon paid to bail his family out.", "score": 3, "replies": [{"body": "SCTY was no where near bankruptcy.  They had the income to happily pay any debts outstanding.", "score": 2, "replies": [{"body": "Ummm no they didn’t...Elon bailed his family out, that’s quite accepted even by bulls", "score": 4, "replies": [{"body": "Elon didn’t participate in the vote..   a fact often forgotten even by the bulls.  I was an investor in SCTY back in the day.  See my math above.  If TSLA hadn’t bought them out they’d still be alive and well today.  Their assets were higher than their debts.  See their quarterly reports.", "score": 4, "replies": [{"body": "Look at who was on the board of both companies. I don’t care if Elon didn’t vote, that was a bailout plain and simple. If Tesla didn’t buy them out they would be bankrupt \n\nAssets were higher than debts? Look at the bond yields!  That’s a better indication of solvency and bankruptcy than what solar city published in their last 10-q.", "score": 4, "replies": [{"body": "Correct me if I’m wrong - bond yields are a product of supply and demand, no?  (I could be wrong)", "score": 3, "replies": [{"body": "Bond yields are typically sharper (more accurate) than equities. They are a different investor base so while supply-demand does have an effect it is not similar to equities.", "score": 6, "replies": [{"body": "Okay, so it is supply and demand then..  I understand that investors (especially the more stable ones), are spooked by a model that is vulnerable to interest rate hikes.  If rates had hiked, SCTY would have been able to pay their debts but not grow very quickly.  I believe in the profitability of their leases, and so their balance sheets make sense to me when they show 5B of lease NPV.", "score": 1, "replies": [{"body": "Bond investors generally aren’t spooked, that’s the difference between equity markets and the bond markets. There is a reason that it was a last minute acquisition by Tesla, it was a bailout pure and simple", "score": 2, "replies": [{"body": "Healthy companies don’t need bailouts tho ;)", "score": 1, "replies": [{"body": "Whispers: it wasn’t a healthy company \n\nWe can agree to disagree on that one", "score": 1, "replies": [{"body": "Agreed", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "[removed]", "score": -2, "replies": [{"body": "Great retort!", "score": 4, "replies": [{"body": "Yeah!!  wait..", "score": 1, "replies": []}]}, {"body": "Stick to the rules", "score": 2, "replies": []}]}]}, {"body": "The amount of long term fud isn’t worth the small revenue and growth from Solar imo", "score": -1, "replies": []}]}, {"body": "I agree, they should have never bailed out Solar City. They paid $2.6 billion for a company with over $3 billion in liabilities. And now they have to spend more money cleaning up the poor installations solar city did. Tesla’s solar business after the acquisition has been in consistent decline, so it failed to generate any benefits to Tesla. \n\nBut they cant really do anything about it. They acquired the company, they have to honor Solar City’s commitments. They’ve been quietly scaling back the solar operations. But they can’t shut it down completely otherwise they’ll lose the lawsuit against them for the acquisition.", "score": 2, "replies": [{"body": "[And 5B in solar lease contracts.](https://www.sec.gov/Archives/edgar/data/1408356/000156459016023725/scty-10q_20160630.htm), nevermind the physical properties they owned, such as GF2.", "score": 1, "replies": [{"body": "5B in lease contracts - let’s assume that is 100 percent secured\n3B in debt - not sure about total cost of that debt is \nBought the business for 2.6B. \n\nLol.", "score": 1, "replies": [{"body": "5B in leases, plus 3B or so in property & cash.", "score": 1, "replies": [{"body": "Plus operating costs.", "score": 2, "replies": [{"body": "Sure", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What would happen to the stock if they impaired the business? If the stock went down 50% but they were totally clear from solar city would you accept that?", "score": 0, "replies": [{"body": "What would happen if Tesla went to $700 next week because Larry Ellison and Chinese billionaires secretly bought most of the float? Would you cover? Would you accept that? \n\nYou ask a lot of hypothetical and far-fetched questions to bulls, hoping to get a negative response. The questions that you ask aren’t meant for you to gain insight, but seems like an attempt to concern troll", "score": 2, "replies": [{"body": "While that would suck for me personally I find that a very low probability of happening. It would really make 0 sense for them to do that, why pay 3.5x for this business? Ellison doesn’t even have that capital to do that. \n\nI’m asking because I want to discern if people care about the stock price or care about the company. By your reaction and subsequent question it seems that if the stock went down 50% you would be quite pissed. But if they impair the solar business that may happen. So Elon bailing out his family may crush the stock... which was predicted by the bears when the acquisition happened. But everyone says the bears are always wrong so are they still wrong?", "score": 5, "replies": []}, {"body": "he's more likely just a short covering his position xD", "score": 1, "replies": [{"body": "I mean you could short the stock anytime in the last year and have made money... maybe you’re just a long who has lost money and is coming to an investors thread to make yourself feel better..,", "score": 2, "replies": [{"body": "I am an opportunist who BTFDs on a good deal who will begin to sell off at the next 320-360 range we enter in increments 🙃 not with either of these camps. With the upcoming gigafactory in China and increasing capacity at their existing plants, the stock is currently undervalued for the year.", "score": 1, "replies": [{"body": "And if we never enter that 320-369 range?\n\nWe can disagree on the “undervalued for the next year”", "score": 2, "replies": [{"body": "yep. I'm not entirely close minded -- if there is no short squeeze at all by end of Q1 2019 then we can agree it is a company worth shorting.", "score": 1, "replies": [{"body": "Do you mean 2020?", "score": 2, "replies": []}]}]}, {"body": "(also bought an extra 10 shares today which was great. Thanks 😘)", "score": 1, "replies": []}]}, {"body": "(also, I'm working for equity finance for the next year or so. Literally cannot short the stock any time or especially engage in short term trading 😛)", "score": 1, "replies": [{"body": "You have the right so short stock even if you work in equity research you know ? just not if you actually cover the stock ... You only need disclosure and permission from your compliance team...", "score": 1, "replies": [{"body": "it depends on what you're doing and what they will allow at the time (hence compliance team). In my case they give us a lot more crap for options trading and encourage us not to.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "$209 just broke AH. Obviously no institutional support. Risky macro. Next stop $180, humongous air pocket", "score": -2, "replies": [{"body": "Not sure amateur hour counts", "score": 7, "replies": []}, {"body": "word of the month: macro\n\nDefinition: bullshit", "score": 6, "replies": []}, {"body": "is that you tslacharts?", "score": -1, "replies": [{"body": "You got me scooby doo", "score": 3, "replies": []}]}]}]}
{"title": "US 1m/30y Yield Curve Inverts, for full inversion", "selftext": "If you thought the mess in the stock market was bad, check out how ugly the bond market looks.\n\n1m/30y: -0.039\n\n3m/10y: -0.438\n\n2y/10y: +0.005 (previously -0.003)\n\nWhat does this signal? Essentially the bond market believes that both the Fed is acting too slowly with rate cuts (keeping the short end yields up), while global trade and other issues are sparking a huge risk-off move (suppressing the long end yields down).\n\n[CNBC Treasury Yield Curve (source)](https://www.cnbc.com/us-treasurys/)\n\nEDIT: Updated with yields at close. Stay safe this weekend everyone.", "id": "cuiaxn", "created_utc": 1566586975.0, "score": 166, "upvote_ratio": 0.97, "num_comments": 97, "comments": [{"body": "I’m applying for mortgages. This is crazy", "score": 118, "replies": [{"body": "How to leverage into tendies?", "score": 40, "replies": [{"body": "[deleted]", "score": 46, "replies": [{"body": "Only 150%%%%????????\n\nWhere can get 300% borrowed?", "score": 15, "replies": [{"body": "Use that mortgage money to short stonks on margin....\nMega tendies", "score": 22, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Sleep deprivation +waiting for tendie in oven", "score": 5, "replies": []}]}, {"body": "You know how Netflix trades at 114 times future earnings and doesn't go tits up? You too can do the same! Multiply your salary by 114. In my case $70k x 114, so right now I'm looking at homes for $8 Million even though I make $70k. If Wall Street can do it, you can do it !", "score": 10, "replies": [{"body": "Serious. Where do I sign up. I eps like SHOP", "score": 3, "replies": []}]}, {"body": "Margin on interactive broker account.", "score": 1, "replies": []}, {"body": "I want 500%", "score": 1, "replies": []}]}, {"body": "What is 150% of zero?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I don’t know maths!", "score": 2, "replies": []}]}]}, {"body": "Hey, what’s phase two?", "score": 2, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "I see it too.", "score": 1, "replies": []}, {"body": "Yeah yeah yeah, but what’s phase two?", "score": 0, "replies": []}]}, {"body": "Epstein.", "score": 2, "replies": []}]}, {"body": "Chuckle Out Loud", "score": 1, "replies": []}]}, {"body": "Buy FMJEP and other GSE tickers", "score": 2, "replies": []}]}, {"body": "30 year mortgages are lower than the one year rates. Time to buy 500000 houses let’s go", "score": 24, "replies": [{"body": "u can get a tool shed with that much in california...", "score": 3, "replies": []}]}, {"body": "What's the best rate you've seen?", "score": 8, "replies": [{"body": "My gf is a mortgage loan officer, said this week she saw a 2.875 with $2.8k buydown", "score": 27, "replies": [{"body": "Were they buying a tool shed? Jesus", "score": 19, "replies": [{"body": "It was on a $265k new build in Ohio, not including closing costs and stuff. You get a decent amount of house for that price here.", "score": 17, "replies": [{"body": "Nice", "score": 2, "replies": []}]}]}]}, {"body": "They’re delayed a week or so. But I’ve seen like 3.375", "score": 7, "replies": [{"body": "I need it to 2.5 for another refinance to be worth it", "score": 2, "replies": [{"body": "This is for 30 year mortgages. I’ve seen sub 3 10-15 year", "score": 3, "replies": [{"body": "Yeah I literally refinanced 2 months ago to 3.6, I'd refinance again with an irrl if it went sub 2.5 for it to be worth it to me.", "score": 3, "replies": [{"body": "With tariff man, your wildest dreams might come true.", "score": 2, "replies": [{"body": "I can only hope and pray that the recession will come!", "score": 2, "replies": []}]}]}, {"body": "I got a 15 year at sub 2.5 last feb", "score": 2, "replies": [{"body": "How many points ?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What is your cash position like? Are you worried about potential recession and job loss? Wife and I are holding off for now until we have a lot more cash to get us through a rough spell. Also some of the houses we wanted to make offers on are coming back on the market likely because the appraisals arent supporting the purchase prices of a lot of homes.", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "How so?", "score": 1, "replies": [{"body": "Dick-sucking is recession proof", "score": 8, "replies": []}]}]}, {"body": "I have $70k. I intend to use 50-60K for cash on a $325k home. I have a job security for a gov contract that lasts until 2025. From what I understand the housing market is highly regional. The county I live in has very high population growth and will likely continue to be, so everything is getting sold quick.", "score": 4, "replies": [{"body": "Enjoy your tendie sub, u/Publicks.", "score": 1, "replies": [{"body": "Chicken tender subs are the best", "score": 1, "replies": []}]}]}]}, {"body": "You gonna get sliced by that falling knife son", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 80, "replies": [{"body": "Read your sentence and still confused... can you make this any simpler?", "score": 32, "replies": [{"body": "[deleted]", "score": 94, "replies": [{"body": "Oooh", "score": 20, "replies": []}, {"body": "Gonna need you to dumb it down a little.", "score": 10, "replies": [{"body": "$$$ = big oof", "score": 14, "replies": []}, {"body": "no tendies", "score": 11, "replies": []}]}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "??????", "score": 4, "replies": [{"body": "Every recession has been preceded by a yield curve inversion", "score": 1, "replies": [{"body": "[Here's a quick explanation of why.](https://media.giphy.com/media/TwaTb1wCLwJaM/giphy.gif)", "score": 6, "replies": []}]}]}]}, {"body": "translation = buy puts", "score": 3, "replies": []}]}, {"body": "This is the sort of TA I come here for.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 42, "replies": [{"body": "yes in 07. [https://www.gurufocus.com/yield\\_curve.php](https://www.gurufocus.com/yield_curve.php)\n\nscroll down to historic yield curve, press play and fast forward to 07", "score": 38, "replies": [{"body": "Happened in 88/89 as well. The market rallied 32% before dropping 20% in 1991. Historically the first time it happened was in 1978-1980, again in late 80-81. \n\nAn interesting tidbit is the market has always rallied 20-40% from the low at the first inversion and recession and market sell-off occurs when yield curves begin to normalize. Typically the market sells off 20% from it's high during the yield inversion. Sell off generally occur 18-24 months from the first inversion. Historically for an inversion to predicate a recession, there is a minimum of 30 days in which yields are inverted in a 12 month period. \n\nSo with that said if you're buying puts now, you're a tadbit too early. I would tell you any rally 2900 onwards is the bubble. You ideal entry is actually SPX 3600 based on analytics. \n\nThe reason the markets don't tank is that usually when inversion occurs money is cheaper to borrow, and if you're an investor cheap money = good. Until the value of the asset is driven to the point of immediate unsustainability. My case and point for SPX3600 is yields are low, interest is low, the treasury and US Gov is about to spend $1T more than it'll take-in in the immediate future. Banks are handing out portfolio loans like money is nothing right now as well.", "score": 38, "replies": [{"body": "What no one gets is that everything moves faster now. Statistics from the 80s are useless. \n\nAlmost all of these statistics were from times when active managers making manual decisions dominated market activity. If you wanted to buy a stock, you’d get the newspaper, find the price, ring your broker, ask him to buy it, he’d call some guy on the floor, and the next day you’d get a confirmation. People deciding to do things on the scale of months and quarters moved prices. \n\nNow the majority of volume is algorithms trading with each other. Things are decided in seconds and minutes. This has ramped up bigly even since 2008. Everything moves faster, including time from signal to trading.", "score": 27, "replies": [{"body": "You have to understand the principle behind a yield inversion. A yield inversion =/= recession. It's not a statistic. It's a reason why the market reacts the way it does down the road. When an inversion occurs money is cheap to borrow and that has an immediate impact on assets today and what it means when yields normalize. The basic principals of how our money system works don't just change because things are faster. \n\nIf you're asking me I don't think a yield inversion has any major effect to cause a 2008-like recession or collapse because interest is simply too low for inversion to matter.\n\nYou're not wrong that everything moves faster, there's a reason why the market reacted the way it did to inversions and why it's so quick to recover as we've all seen the last 3 weeks. Tank 3%, recover 3%, tank 3%, recover, etc.", "score": 17, "replies": [{"body": "While you're correct in the inversion not causing a 2008 crash, it will create an asset bubble the size of kansas.\n\nGoddamn the yields will make any attempt at deflation meaningless, and move asset plays further from the hands of the majority.", "score": 11, "replies": [{"body": "I'm not saying you're wrong, but that's happened ever since 2008. We've literally gone from a standard business cycle economy to a credit cycle economy.", "score": 14, "replies": [{"body": "This was a really good back and forth. Actually some really good points from both sides and I can feel myself becoming slightly less autistic from having read it.", "score": 11, "replies": []}, {"body": "Is it just me or does the transition from a standard business cycle to a credit cycle economy kind of make anyone else think that capitalism is... you know... broken? It feels like the whole power-law relationship has gotten overheated.", "score": 7, "replies": []}]}]}]}]}, {"body": "Ya but Trump and twitter wasn't factored in the previous recessions.", "score": 6, "replies": []}, {"body": "Puts with 06/20 expiry too early?", "score": 1, "replies": [{"body": "I like 22 expiry when they’re available", "score": 1, "replies": [{"body": "You know what the TL is for that exp?", "score": 1, "replies": [{"body": "Sometime Jan 20.", "score": 2, "replies": []}]}]}]}]}, {"body": "oooof", "score": 5, "replies": [{"body": "07 was still tame for the S&P500, the real hard core drop happened in Oct 08. So if you would go into all in puts or something you are a bit too early.", "score": 8, "replies": []}]}, {"body": "Yeah but nothing bad happen then...", "score": 1, "replies": []}]}]}, {"body": "Stop, I can only get so erect.", "score": 45, "replies": [{"body": "Yeah, but is it yield curved erect?", "score": 13, "replies": [{"body": "Depends on your hemisphere.", "score": 3, "replies": []}, {"body": "Inverted curve", "score": 1, "replies": []}]}, {"body": "Meh, I'm into darker stuff now", "score": 2, "replies": []}]}, {"body": "the bears this wk end are gonna be...\n\nunbearable\n\n😎😎😎", "score": 60, "replies": []}, {"body": "Brazil 1 yr bond yielding 5.3% 👀", "score": 18, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Why?", "score": 6, "replies": [{"body": "the reason it's paying so much is because there's a big risk it won't pay out that much", "score": 22, "replies": [{"body": "Oh, it will, it just might not be worth what you thought it would.", "score": 3, "replies": [{"body": "So even though you buy it at 5.3% the central bank just won’t pay out 5.3 and give you what they feel like?", "score": 2, "replies": []}]}]}, {"body": "Isn't their most useful thing on fire?", "score": 7, "replies": [{"body": "Excuse me sir. But the Macaws and the chimps get in the way of agriculture company profits. Unless you can work chimps at below minimum wage since they aren't human.", "score": 8, "replies": []}]}]}]}]}, {"body": "Oh fuck", "score": 11, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "HIDE YO WIFE HIDE YO KIDS HIDE YO 401K", "score": 34, "replies": []}, {"body": "TRADE WARS ARE GOOD AND EASY TO WIN", "score": 17, "replies": []}]}]}, {"body": "Honestly if trump didn’t scare the shit out of the markets with every tweet. This wouldn’t have happened", "score": 29, "replies": []}, {"body": "So calls it is", "score": 9, "replies": []}, {"body": "I can't wait to refinance my shit with negative rates!!!", "score": 10, "replies": [{"body": "Haha, take that Wells Fargo.  I’m down", "score": 2, "replies": []}]}, {"body": "Just need a big catalyst", "score": 9, "replies": [{"body": "Agreed, but I think between No Deal Brexit, and trade war escalation we will like 99% chance get that catalyst sometime between mid September and end of the Year.\n\nBut then I have been hugely wrong before.", "score": 25, "replies": [{"body": "It's definitely going to happen. \n\nBut then again it might not", "score": 13, "replies": []}, {"body": "The odds are good but not fuckin 99%", "score": 2, "replies": []}]}]}, {"body": "Has this ever happened before?", "score": 6, "replies": [{"body": "I'll check extended data (pre-2002) later but looks like it happened a couple times from mid 2006 to mid 2007.", "score": 17, "replies": [{"body": "Rightttttttttt before the 2008 meltdown", "score": 15, "replies": []}, {"body": "That's heartwarming!", "score": 5, "replies": []}]}]}, {"body": "Need to talk with the refinance guy … too juicy", "score": 2, "replies": []}, {"body": "You don’t know anything your just a stupid mod", "score": -2, "replies": []}]}
