{"title": "Paypals New Ceo could be original Founder Max Levchin", "selftext": "Paypals New CEO could be Max Levchin & could help the stock go parabolic, this is why.\n\n\\---Levchin is Co Founder of Paypal- the original Paypal Mafia, Founder and CEO of Affirm & Paypals Former CTO.\n\n\\---Paypals new CEO will have a mega opportunity to turn things around at record lows with a major incentive with options and major bonuses with over $5 billion in FCF. This money is going to share buybacks at record low prices this year.\n\n Paypals CEO Shulman said “We are in the very final stages of the process with several outstanding candidates, all of whom are highly qualified and excited to lead PayPal as we go into our next chapter of growth,” Schulman said on the call with analysts, reiterating that his next stop is as a director on the company’s board.\n\n\\---Levchins Affirm $AFRM has seen a major draw down because of the rate hikes currently valued at $4.5 B and if there are a couple more rate hikes they could face big problems and might look for an exit.---Paypal recently made a deal with KKR to sell up to €40B in BNPL loans for $1.8B to buyback shares that will likely close later this year. This distorted Paypals latest FCF in earnings this quarter.\n\n\\---Levchin, Thiel & Elon Musk launched paypal in 1998.\n\n\\---Thiel is still a general partner of The Founders Foundation where he is chairman.\n\n\\---Levchin said \"his friendship with Musk is built \"on a texting basis.\"  Could this be the \"Full Circle Elon Musk was talking about making Paypal a future partner with Musk's New X.com?\n\nRemember Paypal was in talks of buying Pinterest for $45B in 2021 at its peak to get into the social media side.\n\n\\---Musk's Plan is to make X the next Wechat and could really use Paypal to accomplish this.\n\nRemember the Paypal Mafia has it's hands in the largest companies in the world now.\n\nThis is what the market is waiting on and I believe that the new ceo even if its not Levchin is going to really run this back up to all time highs over the next 36 months.", "id": "15k3a0k", "created_utc": 1691362556.0, "score": 68, "upvote_ratio": 0.78, "num_comments": 67, "comments": [{"body": "Why all the hate for paypal? My clients pay me via PayPal with ach withdrawal and PayPals transaction fee is just .50 cent.", "score": 29, "replies": [{"body": "People underestimate how entrenched PayPal is into society imo.", "score": 25, "replies": [{"body": "Was reading that the mexican mafia foot soldiers used it to send money to the top. Very entrenched.", "score": 2, "replies": []}, {"body": "[deleted]", "score": -21, "replies": [{"body": "Yeah, the typical internet consumer who \"uses bitcoin whenever possible\" and \"generates debit account numbers to keep his details private\" seems like a good representation of the general consumer.", "score": 22, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Can't believe you wrote all this instead of just taking the L lmao", "score": 1, "replies": []}]}]}, {"body": "Well. I buy stuff online all the time and literally use PayPal 9/10 times.", "score": 3, "replies": []}, {"body": "PayPal will go the way of Skype.", "score": -4, "replies": [{"body": "Holy crap I forgot about Skype.", "score": 0, "replies": []}]}]}]}, {"body": "The reason I haven't invested is due to all the new competition (i.e. google pay, apple pay, amazon pay, zelle, etc.). I also don't like that the FCF hasn't grown that much since 2018 despite rising revenue. Makes me nervous that competition is having an impact on the bottom line.", "score": 6, "replies": [{"body": "PayPal is spending a lot on Capex and growing out the Credit & Braintree network. They could theoretically cut back on CapEx and see FCF soar, but they benefit in tax purposes from at least maintaining CapEx levels. \n\nAlso helps them keep their moat.", "score": 7, "replies": []}]}, {"body": "Means we found bottom and likely people talking it down to get in.", "score": 3, "replies": []}]}, {"body": "Whoever becomes ceo, better make the stock moon", "score": 54, "replies": [{"body": "The same move from LYFT couple of months ago.  Yet to see any progress...", "score": 3, "replies": [{"body": "Well LYFT was never viable anyways", "score": 5, "replies": [{"body": "It was, at least for me, buying at 9.00 ...", "score": 1, "replies": []}]}]}, {"body": "I am become ceo, bringer to the moon", "score": 4, "replies": []}, {"body": "Market probably does not care as all candidates are going to meet the standards. Bears will panic.", "score": 7, "replies": []}, {"body": "They won’t don’t worry. Paypal is horrible.", "score": -5, "replies": [{"body": "!remindme 24 months", "score": 13, "replies": [{"body": "I will be messaging you in 2 years on [**2025-08-07 04:13:44 UTC**](http://www.wolframalpha.com/input/?i=2025-08-07%2004:13:44%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/15k3a0k/paypals_new_ceo_could_be_original_founder_max/jv4bf63/?context=3)\n\n[**4 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F15k3a0k%2Fpaypals_new_ceo_could_be_original_founder_max%2Fjv4bf63%2F%5D%0A%0ARemindMe%21%202025-08-07%2004%3A13%3A44%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2015k3a0k)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": [{"body": ">!remindme 24 months\n\n!remindme 6 months", "score": 0, "replies": []}]}]}]}]}, {"body": "I feel better that Reddit is bearish on Pypl again. It was hyped up before earnings but everyone hates it again. I’ll continue to load shares if it goes below $60 again.", "score": 32, "replies": [{"body": "For real people here only comment when convenient and without actual positions in the market. Meta was getting so much hate and now is not even mentioned.", "score": 4, "replies": [{"body": "Ya Meta was trading at like 8% free cash flow  yield at one point. Always interesting to see when a stock trades down, people would rather just keep bashing it down rather than trying to see if there is some actual value. Hardly anyone has the guts to buy a stock when it has come down. For some reason, jumping on stocks that are already shooting higher seem to bring them more comfort...", "score": 2, "replies": []}]}]}, {"body": "every time i see option to pay with paypal, i pay with my 2% cash back credit card.", "score": 46, "replies": [{"body": "You can use your CC on PayPal and still gets your 2% ya know", "score": 40, "replies": [{"body": "i know. i have a couple of credit cards from back in the day registered with them.", "score": 2, "replies": []}, {"body": "This guy knows how to work the system.", "score": 1, "replies": []}]}, {"body": "Actually Paypal has their own 2% cash back credit card that gives you 3% cash back when you pay with paypal.", "score": 30, "replies": [{"body": "good for them.", "score": -30, "replies": []}]}]}, {"body": "Hands full with AFRM still bullish PYPL", "score": 6, "replies": [{"body": "Afrm is in a bad place .", "score": 1, "replies": []}]}, {"body": "don’t think he’s public company  ceo material", "score": 3, "replies": [{"body": "Well he is for afrm....", "score": 1, "replies": []}]}, {"body": "Unfortunately this is one of the signs a company will further go down ...", "score": 2, "replies": [{"body": "Lay of the juice lol. Bs.", "score": -1, "replies": []}]}, {"body": "My body is ready. Do it!", "score": 1, "replies": [{"body": "I expect it could be announced at any point after we see a big run again from buybacks at these low prices.", "score": -3, "replies": []}]}, {"body": "who cares.. Paypal sucks.", "score": -12, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "Better analysis than most PYPL bulls to be fair", "score": -2, "replies": []}]}]}, {"body": "Musk will return to save it after he saves X /s", "score": 0, "replies": []}, {"body": "If PayPal teams back up with Musk there’s no way I’m touching this. Dude is a cancer on society", "score": -18, "replies": [{"body": "See how that type of view hurt anyone looking to invest in meta last nov in the $80s turned out for them lol....", "score": -1, "replies": [{"body": "Why compare PYPL to META? During that drop to $80 they were still pulling in billions in PROFIT on an extremely consistent basis. PYPL is bleeding profit and they have no MOAT.\n\n\nPYPL literally does nothing special that competitors haven't replicated and expanded on at this point. \n\n\nSeriously, what sets PYPL apart from SQ, JPM, AAPL or any other payment processor out there? What can PYPL do that nobody else can??\n\nEdit: OP blocked me like a coward instead of addressing any of the points I brought up lmao", "score": -1, "replies": [{"body": "False and lies. Do you read? They bring in 5 billion in free cashflow meta is around $19 billion but 11.3 times larger market cap than pypl. \nPaypal has a major moat. Do you know about braintree? Have you searched google trends for paypal vs google pay and apple pay worldwide? Paypal is parabolic on the search front all time. \nYou clearly need to do more research if you don't know.", "score": 1, "replies": [{"body": "Lmao, my dude I don't base my investment decisions based on Google Trends. But maybe investors are all idiots and forgot to look at the Google Trends chart and that's why PYPL is at the same price as it was 6 years ago.\n\nTheir profit growth has been bleeding for years, what chart are you looking at lol? The last time they saw consistent YOY growth was during the pandemic and then they went through multiple quarters of negative growth afterwards.\n\nMemes aside, they have absolutely abysmal rates for all business sizes and are outclassed by the competition. I sell an ERP software with 8+ different payment providers for businesses (all just as easy to integrate), and Paypal is easily the worst out of the major players. How the fuck are they going to compete long term when they charge at minimum .7% higher fees to business owners than their competitors??\n\n&#x200B;\n\nSeriously, Paypal is a joke when it comes to actual businesses. I speak directly to the CEO's/CFO's when selling this software and I've never had a single one actually want to go forward with Paypal after I give them a brief rundown on all the rates for our payment providers. How do they have a MOAT if their competitors can offer better rates and faster bank transfer times to vendors?\n\n&#x200B;\n\nI'm down in the trenches when these CFO's & CEO's are considering what payment provider to go with and 90+% of them are going with a competitor because they offer them better rates. The few ones that implement with Paypal only do so because they have an existing account. There's never a moment in the evaluation process where I have to tell them *\"Oh you can't do that with 'Square/Authorize/Stripe/Adyen', you'll have to use Paypal for that\"*\n\n&#x200B;\n\nAnd that's why I'm shitting on PYPL, it' s just going to be very hard to continue with YOY growth if their competitors can offer the exact same product at a better rate for their customers. PYPL is genuinely a great company, and will thrive for years...but it most likely won't see the consistent increased YOY growth that it's investors need; considering their main business model is being replicated by multiple competitors and at a better rate for their target market.\n\n&#x200B;\n\nEdit: Great Job at blocking me instead of addressing any of the points I brought up. What a genius OP is", "score": 2, "replies": [{"body": "You have no clue what you are talking about.", "score": -1, "replies": []}]}]}]}, {"body": "When did Elon musk take over Meta?", "score": -2, "replies": [{"body": "Musk is wanting to grow bigger than wechat worldwide.", "score": -4, "replies": [{"body": "With X? Hahahaha. \nWant and doing are two different things. I won’t hold my breath", "score": 1, "replies": [{"body": "You do know what elon musk has said is the goal for x right? Payments like wechat. Pins was also different than pypl....", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It will be still downhill..", "score": -2, "replies": [{"body": "Your short account? Likely. Doubt the stock. See ya in 6 months.", "score": 0, "replies": [{"body": "I am so down with this shit that I don't care about it anymore.", "score": 1, "replies": [{"body": "Don’t worry many feel like you", "score": 2, "replies": []}, {"body": "Timing is everything.", "score": 2, "replies": []}]}]}]}, {"body": "Plz no Elmo involvement. It will be X-Pay then", "score": -1, "replies": []}, {"body": "> the new ceo even if its not Levchin is going to really run this back up to all time highs over the next 36 months\n\nPaint a picture, including financial aspects, of how this goes back to ATH.  Where would the revenues and earnings come from?", "score": 1, "replies": [{"body": "40b projected earnings by 2027. They bring on 5b fcf already. All about market sentiment and a new ceo is everything.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "No thats federal and today they gave the fed a middle finger launching dollar pegged stable coin on paypal. This is an international play where their highest margins are.", "score": 1, "replies": []}]}, {"body": "Oh wow", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Bs, fcf over everything . Locking up 10% of the company over the next 12 months along with a fraction of the 668 funds that sold it in jan last year coming back is all it needs.", "score": 1, "replies": []}]}]}
