{"title": "NVDA & SMCI : why big drop today?", "selftext": "NVDA was around $888 and SMCI around $1,120 today morning at about $9:40am. Both stocks and all semiconductor stocks are down bigly suddenly in last 25-30 minutes.\n\nSo, what happened?\n\nI heard on CNBC that ASML, the Dutch semiconductor maker missed the earnings because of order slowdown from Samsung and TSMC. The ASML stock crashed and went down $67 or about 7%. And, almost all semiconductor stocks including NVDA, SMCI, AMAT etc went down about 2-3% in sympathy.\n\nIMO, this is overreaction and has nothing to do with NVDA and SMCI. Being a risk taker, I just bought lot of ITM calls when NVDA was down at $862 and SMCI at $974. I think, both should recover provided no other bad news comes!\n\nWhat y’all think?\n\nJust my thoughts folks.. I’m just a usual Joe  like most of you guys, not a big time investor or financial advisor, so take it with lot of grains of salt🤣", "id": "1c6bi8h", "created_utc": 1713364575.0, "score": 20, "upvote_ratio": 0.64, "num_comments": 84, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 59 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "That’s indeed very weird. I was in the assumption that stocks only go up.", "score": 125, "replies": [{"body": "ASML reported a drop in sales. Others are likely to follow in the coming quarters. We'll see what TSM reports.", "score": 1, "replies": []}]}, {"body": "It’s gonna be red for this week and next hell, maybe even the next", "score": 24, "replies": [{"body": "Maybe the whole year", "score": 6, "replies": []}]}, {"body": "Peasants will be peasants.", "score": 45, "replies": [{"body": "Since when VM became a pussy talking about peasants and the not the rich", "score": -1, "replies": []}]}, {"body": "Didn't Powell say fk ur calls?", "score": 10, "replies": []}, {"body": "You will get crushed trying to buy the dip on individual names while the indices are trending down. This reads  like someone who just got into the market 3 weeks ago and you’re gonna have a bad time. That’s what I think 🤷🏻‍♂️", "score": 19, "replies": []}, {"body": ">And, almost all semiconductor stocks including NVDA, SMCI, AMAT etc went down about 2-3% in sympathy.\n\n  \nHoly hell dude, SMCI builds servers not semiconductors.  Are you MY financial advisor?", "score": 9, "replies": [{"body": "If you can’t even understand the relationship between NVDA and SMCI, I’m sure you don’t have enough invested in the market to have a financial advisor, especially in AI market🤣", "score": -4, "replies": [{"body": "How's that going for you today?", "score": 3, "replies": []}]}]}, {"body": "Sometimes stocks go up, sometimes they go down. You’ll never be smart enough or have the information to know why. Sorry buddy.", "score": 19, "replies": [{"body": "But why do they go down right after I buy in? 🤔", "score": 9, "replies": [{"body": "Yes.", "score": 12, "replies": []}]}]}, {"body": "Because the whales that bought in under $500 want/need to sell and the media has to come up with an excuse for their movements. When whales dive, they create a vortex pulling all the little fish with them.", "score": 18, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 2, "replies": []}, {"body": "How can we outplay the whales", "score": 1, "replies": [{"body": "Whales move markets, the only way to outplay would be to know what moves they're making ahead of time.", "score": 2, "replies": []}]}]}, {"body": "Ligmaballs said google", "score": 12, "replies": [{"body": "Ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": [{"body": "What’s ligma", "score": 0, "replies": [{"body": "ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Ligma balls", "score": 1, "replies": [{"body": "Ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}, {"body": "Because fuck u that’s why", "score": 12, "replies": []}, {"body": "Well spy/qqq/iwm are all tanking today it's just following the overall market", "score": 4, "replies": []}, {"body": "Overvalued stock, meet Mr. air pocket.", "score": 3, "replies": []}, {"body": "Warrrrr", "score": 6, "replies": []}, {"body": "Why does it matter? You don’t ask these questions when it goes up continuously.\n\nWhy does it *need* a reason to go down?", "score": 6, "replies": []}, {"body": "Indeed u fkd that, it was 1020 max. 100 pts is a lot homie", "score": 2, "replies": []}, {"body": "No clue, but I exited at 877 for some gains on the way down. Risk on?", "score": 2, "replies": [{"body": "Lol I bought at 877 because my dad convinced me to. 🤡", "score": 2, "replies": [{"body": "Hey thanks!", "score": 4, "replies": []}, {"body": "I bought back in AH at 842.76 :D", "score": 0, "replies": []}]}]}, {"body": "Why the drop ?!   You must be new to this", "score": 2, "replies": [{"body": "I think, you one-liners can’t read through a message and comprehend🤣", "score": 0, "replies": [{"body": "You seem to have difficulty comprehending the market…. BUDDY", "score": 3, "replies": [{"body": "Watch the market today.. I’ll tell you why later🤣", "score": 0, "replies": []}]}]}]}, {"body": "Bro if you don't think ASML is a bellweather for the semiconductor industry I don't know what to tell you", "score": 2, "replies": [{"body": "So, I used to work in semiconductor company. ASML makes very specific type of machines than others like AMAT. They even said in their conference call that the miss was mainly because of order delays from Samsung and TSMC. \n\nTSMC makes chips for Nvidia & several other companies using ASML, AMAT and other machines. If you remember, last month Jensen Huang specially went to TSMC in Taiwan to meet their CEO to help increase capacity and speed up delivery of Nvidia chips. That means there is no slowdown in NVDA demand. IMO, Nvidia will again blowout earnings and raise the expectations. Also, if you remember SMCI raised more than $1.6B recently by selling shares so they can buy more chips from Nvidia to build more servers.\n\nLet’s see how TSMC earnings come tonight. If they also miss earnings like ASML then tomorrow will be another bad day for all chip stocks, just like today.", "score": 2, "replies": []}]}, {"body": "When Nvidia dips, I just buy more!!! ![gif](emote|free_emotes_pack|money_face)", "score": 6, "replies": [{"body": "Let's see those positions or gtfo", "score": 13, "replies": []}, {"body": "show proof fatso", "score": 7, "replies": []}, {"body": "I would too, but I’m leveraged to the tits. 😫", "score": 3, "replies": []}]}, {"body": "Glad you added that last part to this post. I was starting to think you were a big time investor or a financial analyst.", "score": 3, "replies": []}, {"body": "Everyone is just fucking stupid. There should be a license to trade", "score": 4, "replies": [{"body": "There is, its called money. You can hear licenses getting revoked right now.", "score": 17, "replies": []}, {"body": "If everyone acted in their rational self interest and made informed decisions the global economy would be destroyed.", "score": 3, "replies": []}]}, {"body": "There are things like PE and DCF that sane investors used to look at. Look em up. You might get your answer versus asking bonafide regards and autists here.", "score": 2, "replies": [{"body": "only regards still look at pe and bud using pe for tech companies is useless this just shows how stupid you really are", "score": 3, "replies": [{"body": "There is this thing called forward PE and DCF….nevermind. Grade A bagholding regard spotted. Good luck.", "score": 4, "replies": []}]}]}, {"body": "Because the market said so. It's nice seeing someone also following both stocks.", "score": 1, "replies": []}, {"body": "Is something to do with another company that is in the same space that didn't meet expectations", "score": 1, "replies": []}, {"body": "Powell said no rate cuts probably. \n\n\nASML didn’t do great.", "score": 1, "replies": []}, {"body": "Bubble is popping", "score": 1, "replies": []}, {"body": "you think its just going up forever?", "score": 1, "replies": [{"body": "Did I say that it should ? \nI just said wanted to share my thoughts as to why such sudden drop of this magnitude in 30 minutes, that’s it.. I never said if stock should always go up or down etc..", "score": 0, "replies": []}]}, {"body": "At the same time 10yr spiked.  It was middle east", "score": 1, "replies": []}, {"body": "Have been playing calls for 6-7 week exclusively first put finally paid off", "score": 1, "replies": []}, {"body": "Bigger ass drop today.  How are your ITM calls?  I would’ve bought shares instead.", "score": 1, "replies": []}, {"body": "Yeah", "score": 1, "replies": []}, {"body": "SMCI failed to give guidance on upcoming earnings announcement?  Rumors of anticipated Reuter's article that SMCI may have violated export restrictions of Nvidia chips to China via servers?  This was all crappy information to create a downdraft by bearish speculators to take the two high flying stocks down.  Now that the dust has settled on 4/23/2024.  Both stocks are again on the climb up.", "score": 1, "replies": []}, {"body": "Buy the dip", "score": 1, "replies": []}, {"body": "If I told u why ur wrong the algos will fuck my puts over instead", "score": 1, "replies": []}, {"body": "I think it’s because of the rumor out there that Druck sold all his $NvDA. Guy is regarded IMO, so I am buying more. Sitting at around 2M of NVDA stocks right now and will keep adding", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": []}, {"body": "Shares. I hope you mean shares.", "score": 2, "replies": []}]}]}, {"body": "Because ASML missed earnings today. AI party might be over", "score": 1, "replies": []}, {"body": "THE BUBBLE HAS POPPED", "score": 1, "replies": []}, {"body": "!banbet amd +1000% 1w", "score": 0, "replies": [{"body": "**Ban Bet Created:** **/u/Ding-Dongon** bet **AMD** goes from **157.22** to **1729.46** before **24-Apr-2024 02:45 PM EDT**\n\nTheir record is 0 wins and 0 losses.\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|8882)", "score": 2, "replies": []}]}, {"body": "“Provided no other bad news comes” Sir, between ASML missing earnings and MKBHD trashing the Humane AI pin, there’s plenty of bad news to spook the market. \n\nAlso geopolitics and inflation", "score": -1, "replies": [{"body": "I don’t think anything else changed between 9:40am and 10:15am..  not that I’m aware of..", "score": 6, "replies": [{"body": "Look at spy and qqq bud, the entire market sold off. MMs are liquidating currently as were in a correction. Hope you bought calls dated into the summer at least. Semis will need to provide good forward guidance otherwise the sticky inflation will just be death by 1000 cuts over the short term", "score": 4, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}, {"body": "Should I just be riding the wave down with puts on basically any ticker?", "score": 2, "replies": []}, {"body": "Has higher rates been a problem for NVDA in the last year? I would argue that higher for longer is actually better for NVDA and tech. Lower rates will start a rotation out of tech. All in all rate cuts will benefit the market but money will head towards small/mid caps. If jobs and GDP are strong you can have higher rates. As soon as jobs weaken and GDP falls, the Fed will be forced to cut rates and if inflation is not coming down that will be a tough place for the economy. Better to get inflation down before cutting rates for the long term.", "score": 1, "replies": []}]}, {"body": "Several factors most of which are geopolitical. Those caused some technicals to hit sell points as well. Overall, we are likely to be sideways, but high volatility until the geo stuff settles out some. Next leg up/down isn't likely to occur until we get big tech earnings, but it will be dependent on the forward PE perception which is also affected by the  Dollar for companies with a large international footprint. Earnings calls will matter as much as the numbers in the current environment (Geo Risk High, Fed Uncertain, etc...).", "score": 1, "replies": []}]}, {"body": "The AI pin has absolutely nothing to do with NVDA, and inflation is hardly a problem for the people buying their super computers.\n\nNVDA is down because the market is down.", "score": 1, "replies": []}]}, {"body": "But the dip so I can make more money", "score": 0, "replies": []}, {"body": "Yea they will recover. Probably next month.", "score": 0, "replies": []}, {"body": "\"IMO, this is overreaction and has nothing to do with NVDA and SMCI.\"\n\nSorry to inform you that your opinion is obviously wrong", "score": -4, "replies": []}]}
