{"title": "(Reuters) the two biggest Disney shareholders, Vanguard w/ 8.2% & BlackRock w/ 6% voted for Iger making proxy contest unwinnable for Peltz.", "selftext": "***Source***: *https://www.reuters.com/business/media-telecom/norges-bank-investment-management-backs-disney-board-room-fight-with-hedge-funds-2024-04-02/*\n\nNEW YORK, April 2 (Reuters) - Walt Disney's (DIS.N), opens new tab largest investor, Vanguard Group, on Tuesday voted to elect the entertainment giant's incumbent directors, allowing the company to pull further ahead in a bitter boardroom fight with two hedge funds, sources told Reuters.\r  \nThe decision by Vanguard, which owned an 8.2% stake in the home of Mickey Mouse at the end of last year, comes just hours before the deadline for a shareholder vote that will guide the future of one of the world's largest entertainment companies. Vanguard was not immediately available for comment.\n\nEarlier on Tuesday Norges Bank Investment Management, said it had voted to re-elect 11 of the entertainment company's 12 directors.\r  \nThese key endorsements added to Disney's momentum before a Tuesday night deadline for shareholders to decide whether to back Chief Executive Bob Iger's slate of current directors or five alternative candidates proposed by hedge funds Trian Fund Management and Blackwells Capital.\n\nThe contest is the most closely watched boardroom clash in the United States this year, serving as a referendum on the future of the century-old Mouse House as it navigates the entertainment industry's shift to streaming.\r  \nNBIM, which manages the Norwegian Government Pension Fund and owned a 1.2% stake in Disney at the end of last year, said it had voted to re-elect nearly all company directors but withheld its vote for Mark Parker, chairman of Disney's board.\n\nIt did not vote for any candidates proposed by Trian or Blackwells.\r  \nDisney did not immediately respond to a request for comment on the vote tally.\r  \nWhile many of the outstanding votes have been cast, people familiar with the tallies said there were still some investors who had not voted but that there was still time before results are announced at the company's annual shareholder meeting on Wednesday, which will stream live at 1 p.m. EDT (1700 GMT).", "id": "1budscf", "created_utc": 1712101420.0, "score": 577, "upvote_ratio": 0.95, "num_comments": 79, "comments": [{"body": "Peltz serves himself and no one else. Disney has had issues but Peltz won't solve them.", "score": 319, "replies": [{"body": "No doubt. I was at dupont when he gave them a hard go. Things pretty much got worse due to his involvement. Thanks Nelson.", "score": 72, "replies": []}, {"body": "Peltz serves himself, Ike Perlmutter and his untalented kids.", "score": 46, "replies": [{"body": "David Beckham’s son’s wife checking in", "score": 21, "replies": [{"body": "he took his wife's last name too!", "score": 11, "replies": []}]}]}]}, {"body": "Great. Boo Peltz. He fundamentally does not understand the company.", "score": 175, "replies": [{"body": "He thinks woke is a problem. That all you really need to know about how much of a moron this dude is on trying to solve actual problems within Disney. Dude would want Disney to cut things that have already been cut far too much. He is even worse than the current board. These short term gain pieces of shit suck if you are a long term fan of anything.", "score": 112, "replies": [{"body": "Absolutely. They’re trading the health of the Disney brand for short term gain.", "score": 37, "replies": [{"body": "It just amazes me how short term gains have actually encouraged these morons to raise prices instead of expanding when actual demand for their product in parks and experiences are so high, which are the cash cow of the company. They take 5 years to build a ride because they have all sorts of construction inefficiencies, some of which are intentional.\n\nWhen you raise prices so much you are just going to give away marketshare to competitors. It might be not easy to see on paper as someone decides to take an alternate vacation. It might show up on paper as your main competitor building a whole new park because you are greedy fucks.\n\nSeriously universal  was going to put Nintendo world in one of the existing Orlando parks. Plans changed fast when they decided Disney was fucking up so much on expansion and cost they had the confidence to build an entire new park themselves.\n\nDisney stans tell me that disney will still be fine and will still make tons of money and of course they will, but if I am a long term investor I am going to be pretty pissed off about the cash cow of the company even allowing their main competitor to build a new park because they didn't want to expand.\n\nNot to mention the smaller park universal is building in Texas and Halloween area in Vegas. If not a minor profit these with push people towards the larger parks and more expansion.\n\nThis is a high margin industry for premium vacations at this point. Imagine if you told investors you would rather cede demand to another high margin competitor than build out a high margin product. These people are some of the dumbest fucking people when you look at it in simple terms. \n\nAs a long term investor you need real growth in actual product available at some point. I think now the rumored park expansion plans are because they know Disney plus is limited at least in the next few years on price raises to account for what they are spending even with cuts.", "score": 36, "replies": [{"body": "Having spent time talking with some senior imagineers about what goes into a ride in the park, 5 years is a fast turn around.  They are generally inviting new tech for new rides, they have ridiculous safety standards, and since each ride is a full experience and not just a line to a coaster, all of that experience had to be curated.  And then you run into interesting issues about build into and around existing  spaces.  The one that stuck out to me the most was on seven dwarfs mine train, the they had a lot of changes going back and forth in the track design becuase they had sidewalk width constraints. They would havr issue where they needs half a foot more space 1 direction to accommodate the drop and it wouldn't fit so they changed the peak or location of the start of the drop which ripples back through the whole design.  And finally you have a design that hits all your elements that fits exactly in your space, then you have to construct it with minimal interference to the attraction around it.  WDW is a collection of engineering marvels.", "score": 1, "replies": []}]}, {"body": "Health of the Disney brand? Have you seen Disney recently its sentiment is at all time lows. Under Iger it’s not healthy at all", "score": 14, "replies": [{"body": "Which is what I just said in agreement about the current board. But Peltz is not the answer.", "score": 16, "replies": []}]}]}, {"body": "Woke is not a problem, but its an issue that creates problems for Disney", "score": 1, "replies": [{"body": "You contradicted yourself.", "score": 6, "replies": [{"body": "No i didnt", "score": 1, "replies": []}]}, {"body": "Woke isn't a thing, it's a mental ghost created to cater to the incels and other fragile rightwing losers. It's a catch all phrase that can mean litterary *anything but a straight, white, racist American male*. Everything else from cars to colours can be \"woke\", it is  idiotic", "score": 0, "replies": []}]}, {"body": ">He thinks woke is a problem.\n\nSounds like he knows exactly what's the problem with entertainment industry.\n\nESG funds have abysmal return which should tells you everything.", "score": 1, "replies": [{"body": "Lmao. Disney is not an esg fund. There is a reason South park made fun of the mouse as a soulless piece of shit.", "score": 8, "replies": [{"body": "Do you even know what an ESG fund is lol. It's a private equity investment index fund which invest in project by evaluating ESG rating as a primary investment thesis. They fund everything from carbon capture company to entertainment company. Basically soulness company go woke to access these cheap investment and fucked up their short term revenue in the process. This happened across every industry so ESG fund has abysmal ROI.\n\nSo yes wokeness is the problem.", "score": -3, "replies": [{"body": "No, being soulless is the problem, like you just argued. Wokeness for capitalism sake is just a symptom.", "score": 3, "replies": [{"body": "Expecting publicly traded company to be anything but soulless is naive lol\n\nEven if they wanted to do the right thing they can be sued by other investors.", "score": 2, "replies": []}]}]}]}]}, {"body": "Woke IS a problem. It might not be THE problem. But it's still a problem. Making sure you give the upward middle finger to half the population in every movie and streaming show you create is not good business.", "score": -11, "replies": [{"body": "The fact you think a Disney movie that doesn’t have a straight white protagonist is somehow a middle finger to you IS exactly why those “woke” movies need to exist.", "score": -6, "replies": [{"body": "Because Disney was designed to promote cultural change? It seems to me its purpose is to entertain. And make money. And it damages both of those purposes when it puts out multiple movies without 'straight white protagonists'. The ridiculousness of putting out a string of marvel and disney movies and streaming shows with unattractive female protagonists when your audience is known to be 75% male is beyond my understanding.", "score": 2, "replies": []}]}]}, {"body": "Dude isn't actually that dumb. He's taking that stance publicly to sway shareholders to his side. It's a tactic....a pathetic one, but don't let what he says influence you into believing it's what he believes", "score": -5, "replies": []}]}, {"body": "Peltz is the eldest boy!", "score": 9, "replies": []}]}, {"body": "Dang I really wanted a crotchety 81 year old boomer with no entertainment or movie experience controlling the creative vision of Disney.\n\n“Restore the magic” my ass.", "score": 120, "replies": []}, {"body": "I think Iger is the better choice but it is concerning that ETF and mutual fund managers don't allow their customers some means of voting on the companies in their funds", "score": 53, "replies": [{"body": "For larger institutional mandates (which is the bulk of the money they manage), some asset managers do allow the investors to vote\n\nhttps://www.blackrock.com/corporate/about-us/investment-stewardship/blackrock-voting-choice\n\nhttps://investors.statestreet.com/investor-news-events/press-releases/news-details/2023/State-Street-Global-Advisors-to-Extend-Proxy-Voting-Choice-to-ETFs-and-Mutual-Funds/default.aspx", "score": 20, "replies": [{"body": "Looks like it’s only eligible on wrap funds right now. Very interesting though.", "score": 1, "replies": []}]}, {"body": "It is a huge problem in the corporate world as well as the political world.", "score": 2, "replies": []}, {"body": "The goal of an ETF is to invest without having to think about your investment. If someone wants to \"participate\" (let's be honest, retail investors do not participate in any of the decisions), then you can buy the stock. The whole point of an ETF is to pay someone else (management fee) to grow your investment.", "score": 1, "replies": []}]}, {"body": "As someone who genuinely enjoys what the company does, I’m all for someone to challenge the status quo to continue to help things improve. Just not a nematode like Peltz.", "score": 61, "replies": [{"body": "Absolutely. I love Disney. It deserves better than Peltz.", "score": 18, "replies": []}]}, {"body": "I thought they only handled investor funds. All the investors voted I guess", "score": 26, "replies": [{"body": "Thats one of the side effects of ETF investors. All the votes are used by the etf provider giving them incredible power.\n\nPeople need to invest directly to be able to vote", "score": 55, "replies": [{"body": "As a boring normie ETF investor, I trust Vanguard to generally make better and more informed decisions on votes than I ever would.", "score": 6, "replies": []}]}, {"body": "Work different with ETFs. That's why people say that the largest ETF providers like Vanguard and Blackrock run the world. Obviously they don't, but they wield enormous power.", "score": 26, "replies": [{"body": "The people that say black rock and vanguard own the world think that their AUM is actually their money.", "score": 4, "replies": [{"body": "I facepalm everytime someone thinks they have trillions of dollars. IIRC apple has more cash than blackrocks market cap lol.", "score": 4, "replies": []}]}, {"body": "How do they not, if they wield this enormous power?", "score": -2, "replies": [{"body": "You can wield enormous power and not own the world. Is that not obvious?", "score": 0, "replies": []}]}]}, {"body": "gotta protect the investment aka capital preservation", "score": 3, "replies": []}]}, {"body": ">Walt Disney's (DIS.N), opens new tab largest investor\n\nWhat does \"new tab largest investor\" mean?", "score": 5, "replies": [{"body": "Googling it leads back to this topic.  \n\nProbably bad ai wrote the article.", "score": 1, "replies": [{"body": "Lol what if it's voice to text. The writer asks Alexa or whatever to open a new tab, goes back to dictating the article, and then never proofreads it.", "score": 2, "replies": []}]}]}, {"body": "Good. Fuck peltz\n\nHaven’t a useful sentence from the man as to what he wants to do\n\nIt’s just negativity about the current board and some quasi political rant ab woke politics etc \n\nThis whole thing is just political bs", "score": 48, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "You’re on Reddit and you’re surprised they’re backing the man who gave you gay Buzz Lightyear?", "score": 5, "replies": []}, {"body": "I think most here will agree that change is needed. But Peltz will not bring that change.", "score": 1, "replies": []}]}, {"body": "Good on Vanguard.  Considering a ton of the shares they own are my dollars, I was going to pivot to Blackrock if they fucked this up and fell victim of the Peltz (and company, he’s being put up to this) massive troll job.\n\nStill want a word with CalPERS.  WTF?", "score": 3, "replies": []}, {"body": "Good. Peltz is useless", "score": 3, "replies": []}, {"body": "Igor should be the CEO and anyone that thinks otherwise is not a savory person.", "score": 2, "replies": []}, {"body": "It's disgusting that some people here defend the indefensible - that Blackrock and Vanguard should play activist investors WITH OTHER PEOPLE'S MONEY.\n\nThe right move for Blackrock and Vanguard was to abstain. Or ask their investors.", "score": 5, "replies": [{"body": "I’m pretty sure ETF people do ETFs so that we don’t have to play with our money?", "score": 3, "replies": []}, {"body": "As a Boglehead, this was my knee-jerk reaction as well. \n\nCan someone help me understand why abstaining is NOT the right move for Vanguard here? \n\nThe whole point of Boglehead investing is that we don't try to predict the performance of individual companies. Voting on a decision that impacts the future of a company essentially requires predicting that that decision is better for the company long term.", "score": 3, "replies": []}, {"body": "You invest with these company's funds because you believe that they're capable of managing your money. Even within a broad based index fund, someone is managing the portfolio. Why wouldn't you by extention believe they're capable of making the best decision for your portfolio? If you don't believe it, don't put your money in their ETFs/Mutual Funds etc.", "score": 5, "replies": [{"body": "But their mandate is LITERALLY to maximize your (shareholder) profits, not to play activist investor ... as in, I invested in sp500 ETF because I believe in general american economy - NOT that I believe in push for certain political/ethical direction in biggest 500 companies in US.\n\nIf Blackrock want to do that, okay sure, but they should fairly call their sp500 ETF \"progressive activism sp500 ETF\" or something else indicating the bias, so that buyer knows what he's buying with his money.", "score": -2, "replies": [{"body": "Sometimes, those two things are going to overlap. Sometimes, they won't. As you said, it's whatever makes sense for the portfolio. Clearly they felt that their pick for CEO was in the best interest of profits. You don't like their decisions? Don't invest. Ez.", "score": 2, "replies": [{"body": "That's what I did, been divesting from their ETF and more into stock picking. \n\nI'm just saying advertising it as a passive ETF is dishonest, if it's active one and not exactly oriented on profit. As you said, *sometimes* these will overlap - but last few years it consistently did not, and their investors paid the price.", "score": 2, "replies": [{"body": "I would disagree, personally. But to each their own.", "score": 1, "replies": []}]}]}]}]}, {"body": "This is one major reason for people wanting to do stock picking. When you are doing ETFS/mutual funds, you have no choice to what companies your money goes to. It will often go to companies that you are completely against on a philosophical level.", "score": 1, "replies": []}]}, {"body": "Wow. Can’t believe Blackrock didn’t vote for Peltz.", "score": 3, "replies": []}, {"body": "Since Peltz started fighting, Disney stock went from 80 to 120. I really think he has accomplished his number one goal. After the proxy fight, Peltz still owns stock and has a large microphone the yell into it whenever he wants.\n\nI hope for all the DIS stock lovers in the thread, the stock continues to rise.", "score": 1, "replies": []}, {"body": "Vanguard and Blackrock do not own those shares. They manage them. Big difference and it’s funny/embarrassing Reuters would get this wrong", "score": 1, "replies": []}, {"body": "According to these replies, Peltz just serves himself and will not solve Disney's issues", "score": -1, "replies": []}, {"body": "[removed]", "score": -22, "replies": [{"body": "I’m glad we’re finally at the point when most people realize that whoever says “go woke go broke” is not a serious person", "score": 10, "replies": [{"body": "[removed]", "score": -13, "replies": [{"body": "Honestly, whatever you’re against I’m hoping gets exponentially worse for you.", "score": 12, "replies": []}, {"body": "Ok grandpa, try watching some news that isn't Fox (or anything else owned by Murdoch. Aka Fox News wearing a Scooby Doo villain mask)", "score": 5, "replies": [{"body": "I listen to Joe Rogan and TimcastIRL", "score": -8, "replies": [{"body": "Not exactly, the greatest sources", "score": 3, "replies": []}]}]}, {"body": "Hahaha.   Naw, tiny cocked \"men\" like you thinking you should get a say in the big boy conversations is what is destroying our country.   You job is to drive the truck boy.  Number 1 job for uneducated males in this country for a reason.  We keep you on the road and out of the way of real people.", "score": -5, "replies": []}]}]}, {"body": "Ironic from a guy that uploads wiener pics on Reddit to try to find a girlfriend. Time to shut down the laptop grandpa", "score": 14, "replies": [{"body": "I thought this was just a joke, but it soon turned into a horror movie 🤢", "score": 2, "replies": []}, {"body": "I wasn't sure I believed you but sure enough, he's looking for feeeeeemale and I can't unhear the ferrengi voice.  \n\nI think all of his dingaling pics got deleted by the mods, must not have been gucci.", "score": 4, "replies": []}]}]}, {"body": "Train called me about my shares, very nice people. What they said made sense. I’m disappointed in Vanguard, especially having some VOO.", "score": -9, "replies": []}, {"body": "Wonder why n I’m voted against Mark Parker.", "score": -7, "replies": []}]}
{"title": "Apple Investors Seek Signs Worst Is Over After Quarterly Slump", "selftext": "With Apple Inc.’s stock coming off its poorest quarterly performance relative to the S&P 500 Index in over a decade, traders are looking for signs that the worst may be over.\n\nThe 12% drop since the start of the year paid off for short sellers, giving them an incentive to unwind their bets. Technical analysts say the stock is flirting with levels where dip-buyers are likely to swoop in. And the lagging run may make Apple look cheap compared with the other big tech companies.\n\nhttps://finance.yahoo.com/news/apple-flirts-support-levels-worst-100001839.html", "id": "1bu6bzt", "created_utc": 1712083012.0, "score": 143, "upvote_ratio": 0.89, "num_comments": 81, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 6 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "The worst is over, but we aren't getting to normal for a while", "score": 50, "replies": [{"body": "Define “a while”. Tho I agree that breakthrough catalyst seem a little meager right now, I’d argue that we’re entering a new iPhone supercycle in September as well as what’s anticipated to be a major launch for Apple Watch 10. Also, I have to believe that developers conference in June will bring some very positive news, or at least guidance to developers on what they can be doing for Apple Vision Pro, which, obviously, is just getting started. As a long-term apple investor, I’m taking all of this as just the natural rhythms of the company. This happens about every 10 years or so where the obituaries are written, and the company is left for dead, which is hilarious in hindsight. But I guess that’s where we are.", "score": 14, "replies": [{"body": "What evidence exists for a super cycle?  Recent product launches have underscored the lack of necessity to upgrade as they drip mostly meaningless upgrades, so people are running their existing devices longer and longer. Inflation also isn’t really under control and discretionary spending is at all time lows. Further, Apple has yet to prove the Vision Pro is gonna catch on.", "score": 12, "replies": [{"body": "iPhone supercycles started around iPhone 5, then 8, 10 and 12. Analysts have been talking about 16 being the next one. Discretionary income indeed is dropping and luxury shopping is off -- but tech purchases have historically been pretty immune to larger consumer spending cycles (for the most part). There's buzz about iOS 18 being a large update that might bring in more AI-infused functionality that of course will be optimized for new hardware. Agree on AVP at the minute but I think holding Apple to task for not proving its value AFTER 3 MONTHS on the market is a bit premature.", "score": 3, "replies": [{"body": "sorry i'm a newborn baby and don't understand things good but doesn't apple typically prove value on their products before they're introduced to market", "score": 4, "replies": [{"body": "Mostly, you’re right. But sometimes that old Jobs-ian hubris shows itself: The Cube. HomePod. CinemaPro display. Apple Watch Edition gold for $25k. The currently mind numbing iPad lineup. I’m sure I’m missing more.", "score": 1, "replies": []}]}]}]}, {"body": "I feel like I hear about super cycles before every phone release. What years would you consider, or would revenue show a super cycle?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "10 and 12 most recently. Massive sales. Before that, 8 and 5.", "score": 2, "replies": []}]}, {"body": "Lol ever since their revenue numbers flattened out, next quarter has been the one where 'consumers catch up and buy the phones they were delaying'. Getting kinda old", "score": 1, "replies": []}]}]}, {"body": "With wwdc potentially being the biggest upset ever if there’s not a significant keynote on AI, and a slump in IPhone sales with earnings coming up in May and at best, their walled garden under the microscope from the DOJ and up their asses. \n\nI dunno man, people need to stop looking at Apple as invincible just because it’s Apple.", "score": 9, "replies": [{"body": "Think of Appl more like it's David vs Goliath. They just want to make money but everyone wants to them to do more. The DOJ getting involved is case and point.", "score": 0, "replies": []}]}]}, {"body": "I felt like anything below $170 was a fair entry point.", "score": 98, "replies": [{"body": "Only 1 year ago it was at $125", "score": 42, "replies": [{"body": "Yep. Lots of room to drop.", "score": 18, "replies": [{"body": "sir, every stonk has a lot of room to drop", "score": 25, "replies": [{"body": "Sir, how many stonks literally make things that go up? This one is special.", "score": 3, "replies": []}, {"body": "NYCB", "score": 2, "replies": []}]}]}, {"body": "Yeah, but back then memes were more interesting.", "score": 2, "replies": []}]}, {"body": "*cries in 186*", "score": 5, "replies": [{"body": "Laughs in 22", "score": 5, "replies": [{"body": "Laughs at $2.57", "score": 2, "replies": []}]}, {"body": "Cries in 188", "score": 1, "replies": []}]}, {"body": "I mean a p/e of 26.3 or 3.8÷ return on investment is a bit of a hard sell in times when government treasuries bring 5÷. It assumes a lot of growth for a company that now owns laptops, phones, headphones and watches and is heavily dependent in production and also sales on china whose government really doesn't like the US anymore and vice versa. But they did a great job taking more market share from samsung. On the other hand phone prices got raised so much it's unlikely that easy way to increase revenue can go on. Especially since today you need to kinda grow at 3-4% just to stand still with inflation.\n\nBut let's see betting against apple never worked out well they just have humongous mindshare and resources.  Building your own chip infrastructure that beats amd and intel handily in many metrics is kinda insane. But it's also risky you can already see amd intel and now Qualcomm making up lost ground so these positive headwinds can reverse too if they falter. It is powerful to have so much vertical integration but also really risky.", "score": 8, "replies": [{"body": "Apple is just one of *those* stocks, you know? I don’t really have to think much about it, and I also have no bad sentiment toward owning it if a swing trade isn’t in the cards.", "score": 2, "replies": [{"body": "Investing in AAPL a few years ago Def was the play if you just wanted a safe and stable investment, but recently investing in SPY itself is much more preferable because AAPL, while still being stable, is not seeing any growth.", "score": 1, "replies": [{"body": "Even if it remains range bound and doesn’t overtake $200 anytime soon, that’s fine. I’m completely ok with it being range bound as I like to swing trade when opportunities appear. I think that sub $170 is an opportunity now for that type of trade. Obviously we can sit here and say the time to enter long was when it was ~$130, but that time has come and gone.", "score": 2, "replies": []}]}]}]}]}, {"body": "Finally got AAPL under $170 \n\nLife is good, didn’t get much because I don’t trust Timothy Applebottom", "score": 17, "replies": [{"body": ">Finally got AAPL under $170 \n\nThe market doesn't work that way. If little Joe the nobody has the clear \"opportunity\" to buy AAPL under $170, then it's no opportunity at all and the stock price is heading lower. Proper opportunities belong to sophisticated traders, or to the very lucky ones. In this case, everyone would be the lucky one if $170 was the bottom. When it seems that everyone has the chance to buy low, then it's no opportunity at all and you are just catching a falling knife.", "score": -7, "replies": [{"body": "Apple, falling knife? I believe you’re mistaken sir.", "score": 7, "replies": []}, {"body": "Cringiest shit I’ve ever read, you don’t know shit", "score": 9, "replies": [{"body": "Strong Robert California vibes.", "score": 2, "replies": []}, {"body": "Keep bUyInG uNdEr $170 you fucktard, before panic selling everything under 150", "score": 0, "replies": []}]}, {"body": "https://preview.redd.it/4pl9v3lhs6sc1.jpeg?width=1125&format=pjpg&auto=webp&s=3c003fd92b120d2d51276ece0af824d90c5dac48\n\nPosted 35 Days Ago\n\nPeaked around 8% since then and this was when the S&P 500 only gained 1.34%\n\n!remindme 120d\n\nI keep most of my picks secret but here’s one, let’s see who the nobody is", "score": 0, "replies": [{"body": "I will be messaging you in 3 months on [**2024-08-01 03:51:37 UTC**](http://www.wolframalpha.com/input/?i=2024-08-01%2003:51:37%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1bu6bzt/apple_investors_seek_signs_worst_is_over_after/kxszwij/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1bu6bzt%2Fapple_investors_seek_signs_worst_is_over_after%2Fkxszwij%2F%5D%0A%0ARemindMe%21%202024-08-01%2003%3A51%3A37%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201bu6bzt)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}, {"body": "Just buy stock and let it sit don’t overthink it. They print money", "score": 17, "replies": [{"body": "This guy Apples. I bought shares today btw. ", "score": 6, "replies": []}]}, {"body": "Buy buy buy", "score": 15, "replies": [{"body": "Nice try Tim.", "score": 11, "replies": []}]}, {"body": "I’ve bought calls", "score": 3, "replies": [{"body": "LEAPS for September 2025 at 155 strike", "score": 5, "replies": [{"body": "As well as stock", "score": 2, "replies": []}, {"body": "Why so deep itm?", "score": 1, "replies": [{"body": "Cuz her last name rhymes with Felosi.", "score": 3, "replies": []}, {"body": "Lower breakeven, higher chance of profit, less leverage than otm calls but more than just stock", "score": 2, "replies": []}, {"body": "Haha exactly; because I learned this from Nancy Pelosi", "score": 1, "replies": []}]}, {"body": "Thats gonna print hard", "score": 1, "replies": [{"body": "Hope so!", "score": 1, "replies": []}]}]}]}, {"body": "Yo, when's Apple gonna drop that flip phone?\n\nSamsung phones got some crazy useful AI now too.....\n\nWith all the bad press it may be too early to buy.\n\nI will load up the minute Apple releases official news on an IPhone flip (similar to the galaxy flips, not the folds).", "score": 12, "replies": [{"body": "I'm wondering the same!\n\nBeen waiting on a iphone flip for 3 years now since I saw the first concept.\n\nI heard samsung won't sell them the folding screen tech so Apple physically can't make them.\n\nI ended up switching to the flip 5 last year from my iPhone 13 and I can't go back till Apple releases a flip.....", "score": 7, "replies": [{"body": "I think Samsung will eventually sell them the soft screen tech from the Z Flip 1.\n\nVery similar to how they sell their other mobile screens to Apple. Samsung makes the best screens then makes Apple wait half a decade before they sell it to them. \n\nIt's been that way for 20 years now.", "score": 7, "replies": []}]}, {"body": "We’ve been getting consistent bad news about Apple for over a month now, it can’t break below 168 or so. Also it might be just personal opinion, but theres no way flip phones are going to come back into fashion in any relevant mainstream way. Spending time to develop one amidst the AI boom would probably only send Apple stock even lower.", "score": 6, "replies": [{"body": "Flip phones are the fastest growing sector of the smart phone market. Galaxy flip 5 sales quadrupled from the 4 to the 5.\n\nThe flip phones are not retro devices, the bending motion has a long list of useful applications.\n\nFlip phones and foldable glass is not going anywhere, it's here to stay. If Apple doesn't release a folding phone or useful AI, they're a dinosaur company and I don't want to hold longs on a company that has no innovation growth left.", "score": -7, "replies": [{"body": "Agree with the AI part, Apple is going to suffer quite a bit if they dont announce something soon. Still disagree with the flip phones, its a niche product a small group of people will probably really like and buy, but majority of the world is not adopting it.", "score": 6, "replies": [{"body": "You do realize it's not a flip phone in the classical sense?\n\nIt's a foldable touch screen. The folding element allows for a larger device while keeping more storable when not open. That very much will not be a niche. It follows along with the common trend of increasing screen size in phones. As long as it passes public perceptions of durability, it's going to stay.", "score": 5, "replies": []}, {"body": "If Apple made a flip phone, everyone would adopt it. That's what you're not realizing.", "score": 4, "replies": [{"body": "They absolutely would not unless they also discontinued their normal iphone line.", "score": 3, "replies": []}]}]}, {"body": "I'm dying for an iphone flip! \n\nIt's really frustrating they haven't released one yet because those cute samsung flip phones are calling my name. They're fucking adorable!", "score": 2, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Folding down to fit in small pockets? Hooking it to your pants while you jog?\n\nBuilt in stand for pictures and shots\n\nThe screen won't take damage if you drop it while closed?\n\nAngled flash lights for weird situations?\n\nAnswering text and calls without opening or touching the device?\n\nMuch much smaller profile? \n\nAll the same parts as the other flagship phones (except cameras) for $200 less?\n\nThe list goes on. You don't know anything about them... I'd stay away from Apple till you understand how much their competition has evolved in the last 5 years.", "score": 4, "replies": [{"body": "Those are the same ppl that buy a new iPhone every year without realizing nothing has changed. Personally I have a fold and not a flip but mainly because I need a bigger screen to multitask. And honestly I don't think I'm going back to normal phones again. This is definitely the new age of phones. Sure parts can be improved like the screen or hinges, but past gen 4 I think they're all at usable stages.", "score": 2, "replies": []}]}, {"body": "Nah, you think they're selling flip phones like the ones from 2004?\n\nToday's flips are nothing like that.\n\nUseless? Folding the phone protects the screen. If you can have everything the other phones have, why not fold too since it only adds functionality to hardware that already exists.\n\nI'd bet my entire portfolio that most phones will be able to fold in the next 20 years and it's only a matter of time before Apple releases their own.", "score": 2, "replies": []}]}]}]}]}, {"body": "I have 30 AAPL $155c 5/17", "score": 10, "replies": [{"body": "I have 2 calls of 155 for September , 2025", "score": 4, "replies": []}]}, {"body": "I think it was 2016 or 2018 when Apple had a China scare similar to now. That was a great buying opportunity.", "score": 3, "replies": []}, {"body": "Apple is so 2018.\n\nJensen is the new lord and saviour.", "score": 3, "replies": []}, {"body": "Im conflicted, but for the first time in like 10 years I’m probably going to switch to android. I don’t like innovation by hostage. “Use Apple native or it won’t work on Apple” 🍏 and innovation is stalling hard.", "score": 4, "replies": []}, {"body": "More downgrades from analysts to come. Each downgrade from last week dropped AAPL around 1%. 165 put looks tempting.", "score": 6, "replies": []}, {"body": "It's just not that growth monster it once was. Takes an dawn of internet, iPhone type moment to move that needle significantly.", "score": 2, "replies": []}, {"body": "Drop it more pls I need to load up", "score": 2, "replies": []}, {"body": "Apple doesn’t come out with anything new or groundbreaking anymore. Each new phone is pretty much the same. Unless there is some major innovation on the horizon, I don’t see Apple moving much in the near future.", "score": 4, "replies": [{"body": "They really don't need to. iPad is the dominant tablet world wide. These kids playing around on their iPads are not going to get older and request a Samsung Galaxy when it's time for them to buy a phone. They will choose iPhone, just like my kids. \n\niPhone dominates the US market. Remember the Windows phone? Yeah baby. Microsoft's phone market share looks an awful lot like Pixel market share. \n\nThe same goes for Apple watch. They own the market. \n\nApple Services revenue brought in from above. 20.77 billion. \n\nApple TV will pass HBO this year. \n\nMy take. Apple doesn't need anything groundbreaking. They merely need to not fuck up. They've already laid the foundation for decades worth of success in young well off customers.", "score": 0, "replies": [{"body": "I think a lot of people also forget that they’re fantastic at chip design (I’m very much not aware of whether or not they outsource the actual manufacturing of them) and computing power and AI chips are the big boom right now. Add in the fact that they’ve got so much bloody cash, and you have a recipe for a company that can pivot into the larger growth sectors.\n\nI’m not worried about Apple at all, from a stock perspective. It may not be the growth stock it used to be, but let’s not act like every stock can go up 50% year over year all the time lmao otherwise we’d all be rich", "score": 1, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "Yeah, keep searching. Just as I keep searching of how to fuckin’ get back to MY privacy settings every other update. I am still on iphone. Not for long anymore. This is getting out of hands. Fcuk you appl", "score": 3, "replies": []}, {"body": "Don't sleep on the fact that uncle Buffet has nearly 50% AAPL in his portfolio.", "score": 1, "replies": []}, {"body": "Oh shit yeah my bad I bought APPL, I'll sell real quick.", "score": 1, "replies": []}, {"body": "It presents a chance for buying.", "score": 1, "replies": []}, {"body": "Bigger drop coming when the new iPhone is same as old one and the overpriced helmet thing doesn’t sell", "score": -6, "replies": []}, {"body": "No AI, no EV, i'm not sure what they're playing at. poss buyout of TSLA to kickstart the engine?", "score": -3, "replies": [{"body": "Have you not seem the news of them buying AI companies or are you from 2022?", "score": 1, "replies": []}]}]}
