{"title": "META Calls 7/15 - sell or hold?", "selftext": "I opened up a small position with 7/15 calls for META, my price is at $0.92. It's currently sitting at $2.35 right now. \n\nI'm wondering, should I cash out? Or should I embrace the WSB side of me and let it ride?", "id": "vkjgy7", "created_utc": 1656176703.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 23, "comments": [{"body": "Cash out unless you’re willing to chronicle the porn if it fails.", "score": 12, "replies": []}, {"body": "It’s certainly not going to be 2.35 Monday. Time isn’t your friend. Hoping to gain any part of that back by letting it ride is a sure way to lose all gains.\n\nEdit: sell it. Take profits. Move on to next trade.", "score": 9, "replies": [{"body": "Why won't it be 2.35 on Mon? Is the bloodletting starting again on Mon?", "score": 3, "replies": [{"body": "You will lose some time values over the weekend.", "score": 6, "replies": [{"body": "Theta gang is off on the weekend, only applies to trading days", "score": -1, "replies": [{"body": "https://www.powercycletrading.com/do-options-lose-value-over-the-weekend/\n\nThat’s not true.  \n\nThe problem is, that theta weekend decay is generally priced in during Friday afternoon.  It’s a weird cycle that gives the illusion there is the same theta on the weekend.", "score": 7, "replies": [{"body": "This is the absolute truth most people are not aware of. Theta decay never rests", "score": 5, "replies": []}]}]}]}]}, {"body": "Weekend theta is priced in Friday before close", "score": 1, "replies": []}]}, {"body": "A win is a win. g. Better to take a lesser win incase it continues to rise rather than a bigger loss if it falls.", "score": 4, "replies": []}, {"body": "Sell. You got lucky!", "score": 3, "replies": []}, {"body": "If think you might be losing out sell enough to be break even or small profit and use house money for gamble with rest.", "score": 3, "replies": []}, {"body": "How many contracts? Can’t hurt to trim. Theta will hurt soon", "score": 3, "replies": []}, {"body": "I would turn into risk free spread . That's what I do. You can all ways take off if it runs up", "score": 2, "replies": []}, {"body": "If you have multiple contacts you can sell half or more. Then you are playing with house money at that point. Look at delta and theta. Everyday the option will go down by theta so you will need an increase in the stock price of at least the delta to offset it. So let's say theta is 0.3 and delta is 0.15 you would need a two dollar gap up in the morning just to not lose money by holding over night. In reality it is even more complicated than that because implied volatility also effect options prices (if IV goes down the option reduces in value) and as stock prices goes up volatility in general decreases (unless it is a meme stock then volatility increases when the stock price shoots up). \n\nIn summary options pricing and how they move is pretty complicated so sell at least as much to cover your cost and guarantee you don't lose money.", "score": 2, "replies": []}, {"body": "People tend to worry more about profits they might lose or even commissions than just taking gains and being  happy. \n\nI posted that I  made 2000 on 21 scalp trades in one day and responder said his commission too high for that and his same 66 cents per leg . Yes I paid a couple hundred in commission  but take that any day.", "score": 1, "replies": []}, {"body": "I'd cash out sometime this week. You might get a little more green but there is a good chance this rally is temporary", "score": 1, "replies": [{"body": "Yea I’m expecting red Tues thru rest of the week tbh. I’ll more than likely cash in Monday.", "score": 2, "replies": [{"body": "I would sell. No one has ever gone broke taking profits.", "score": 1, "replies": [{"body": "I closed my entire position at 2.28, I’m quite pleased. May open up another for August calls but I’ll see what happens the next week or so, maybe the market can figure out whether it’ll take a shit or not.", "score": 2, "replies": []}]}]}]}, {"body": "Sell half and let the rest ride for another week?", "score": 1, "replies": []}, {"body": "Jesus. Sell dimwit", "score": 1, "replies": []}, {"body": "Sell", "score": 1, "replies": []}, {"body": "What are you waiting for ? Learn how theta decay will soon destroy your premium in half and the next CPI report is out on July 13. Good luck holding it next week", "score": 1, "replies": []}]}
{"title": "Citron pumping Jumia again", "selftext": "Now they are claiming that they \nBelieve Amazon will acquire them.    Stock cheap now at 7 bucks.  Down from 60.\n\nHonestly I think value is in the platform and tech they have developed including Jumia pay.\nFedEx also recently partnered with them to have access to their logistics.\n\nI think this could be worth a little fun gamble.   I have 600 shares.  \nWill start selling calls OTM once stock comes back to 20’s.\n\nPopulation of Africa is supposed to double by 2050 and I think Jumia is currently leading\n\nEdit : report came out that Amazon is trying to venture into Africa and citron assumed they will just buy out Jumia since they have infrastructure developed already.  I guess that’s a fair assessment", "id": "vk5tp4", "created_utc": 1656127795.0, "score": 1, "upvote_ratio": 0.51, "num_comments": 22, "comments": [{"body": "It sounds like you are trying to pump your worthless shares you’ve probably been holding for a year", "score": 13, "replies": [{"body": ">haha. OP is a dumb shit.  Citron lost everything trying to short GME & AMC.  The only reason they are still around is because its a one man operation out of his basement.  Andrew Left from Citron research would be the last person on earth I take stock advice from  \n>  \n>Your better to invest in Coupang, the so called amazon of S. Korea.  Or just buy AMZN its cheap right now", "score": 3, "replies": [{"body": "Man,  everyone is edgy.  Maybe markets took out your spirits.  As I said its a fun little gamble that I’m willing to hold 10 years +.  When stock pops back,  ill get back to selling calls otm \n\nIn Morocco since I’m familiar with country,  they got complete monopoly of e-commerce\n\nAlso read my title - I did say that Citron is pumping the stock", "score": 0, "replies": [{"body": ">shitty company with no profit and corupt country auditting.  JMIA has negative EPS negative EBITDA , shit opex ratio.  I can list more but all the fundamental info is out there for you to learn and see   \n>  \n>this is not investing you are gambling on speculation.  these companies die in a bear market.  they will run out of cash.  even if anyone buys them, they will buy below current market cap.", "score": 1, "replies": [{"body": "Thanks for your input", "score": 1, "replies": [{"body": "It may sound harsh but you should have dumped this bag of shit a long time ago\n\nSometimes you just gotta take a loss and put what you have left into something better.", "score": 2, "replies": [{"body": "Man, you know.  Now I run search on finviz 200B+.\nIf it’s not in that list,  i ain’t touching it", "score": 1, "replies": []}]}]}]}]}, {"body": "Chill dude. Nobody cares what you think of op , it’s not like the dude follows citron, he’s just saying there may be some truth, and he’s right", "score": 0, "replies": [{"body": "Found the Jumia bag holder.", "score": 0, "replies": []}]}]}, {"body": "Lol do you think this post will move the stock. \nI want to remind you that only big financial institutions can move things.  We just ride along.  \n\nJust wanted to engage discussion and see what others think.  Africa population is exploding and China already invested heavily.  Report came out that Amazon is trying to penetrate.", "score": 1, "replies": []}, {"body": "While true OP may still have a point anyway", "score": 1, "replies": []}]}, {"body": "Momo is the biggest fintech in Africa not Jumia\n\nEcommerce, seems they lead, but still very small", "score": 3, "replies": []}, {"body": "The \"next Amazon\", running on a shitty WordPress site lol", "score": 2, "replies": [{"body": "Is it, really?  Lol", "score": 1, "replies": [{"body": "Idk if it still is but it was last year when I checked it out. \n\nHell you could even access the wp-admin page lol", "score": 1, "replies": []}]}]}, {"body": "Nice pump and dumb. Gtfo scammer", "score": 2, "replies": [{"body": "!RemindMe 6 months", "score": -3, "replies": [{"body": "I will be messaging you in 6 months on [**2022-12-25 11:54:29 UTC**](http://www.wolframalpha.com/input/?i=2022-12-25%2011:54:29%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/vk5tp4/citron_pumping_jumia_again/idof7fm/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fvk5tp4%2Fcitron_pumping_jumia_again%2Fidof7fm%2F%5D%0A%0ARemindMe%21%202022-12-25%2011%3A54%3A29%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20vk5tp4)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}]}, {"body": "I don't see anything exciting in their numbers or growth \n\nhttps://finviz.com/quote.ashx?t=JMIA", "score": 1, "replies": []}]}
{"title": "are inverse etfs worth it", "selftext": " \n\nCurrently there are discussion that oil commodities and real estate market will crash? As a result,\n\nis it worth going into inverse etfs for quick flips. In addition there are also fears and big chances of a recession so are inverse etfs of the sandp 500 a good move?", "id": "vklwa0", "created_utc": 1656183736.0, "score": 7, "upvote_ratio": 0.63, "num_comments": 25, "comments": [{"body": "For quick flips in a downturn, yes.\n\nFor long-term farming? No. They suffer from contango due to needing to roll over options continuously. Just look at the longest chart of them you can find. Exponential decay is not your friend.\n\nBut if you can see a bad day or week coming, they're the easiest way to get a piece of the short.", "score": 11, "replies": [{"body": "Quick flips in days, don't hold for weeks.", "score": 1, "replies": []}, {"body": "Like options they are riskier for quick losses as well as gains...people only see gains...it's a greed buas we all have. Stay away unless you're extremely cautious, extrememly aware of market action and ready to lose.", "score": 1, "replies": []}]}, {"body": "Armor them up.  Strict stop loss and limit sales in most cases.  I currently have an inverse currency trade on EUO with a stop loss but no limit.  Likewise, I have a limit and stop loss on UUP.\n\nI am considering doing similar inverse positions on all major indices as an insurance policy and short term bonds are nice right now for savings (3 month, 6 month, 1 year, 2 year.)\n\nI think in times of volatility having some inverse exposure isn't the worst idea.", "score": 5, "replies": []}, {"body": "I think they are much riskier . Sometimes higher returns but more risk involved", "score": 2, "replies": []}, {"body": "I wanted to buy the inverse Bitcoin ETF, but as with most thematic ETFs, they are often created after the underlying thesis/sector has experienced the majority of gains. I think there’s more pain coming, but missed on a 55% YTD drop.", "score": 2, "replies": [{"body": "Yeah, I want to see someone kinda invent a 'covered call' Bitcoin ETF for these times where it trade sideways. It would be like QYLD on steroids", "score": 1, "replies": []}]}, {"body": "I'd rather buy puts, explicit break even and better returns.", "score": 1, "replies": [{"body": "i cant enable options on robinhood for som reason maybe its cuz i only have 100 dollars?", "score": 1, "replies": []}]}, {"body": "S&P500 inverse ETFs we're worth it in the beginning of the year. Stock market is forward-looking so price it is today is an estimate of what's going to happen 6 months from now, some say inflation will be down to 5% by then but I don't know", "score": 0, "replies": [{"body": "but we will end up in a recession and the sandp500 will go down further", "score": 0, "replies": [{"body": "Maybe we end up in recession. Or maybe we don't end up in a recession. Or maybe we enter recession after the market has already bottomed. Or maybe we are already in the recession and the market is going back up. You need to be more accurate than the market is at weighing the probability of each of those outcomes (and explain why you think the market is mispricing those outcomes), or else you're just gambling.", "score": 5, "replies": []}]}]}, {"body": "Buy individual stocks right now, idk if ETFs have collapse/liquidation risk", "score": 0, "replies": []}, {"body": "UVXY for next week", "score": 1, "replies": []}, {"body": "Yes. For short term.  The shorts technically drop to zero so there is a reverse split when it falls too fast. Longer holding time can work aginst you. Even in this market 1/3 time my timing is not optimum. Had to sell it as loss before losing more.\n\nFor me,  it is just another put w/o paying premium smaller contracts.", "score": 1, "replies": []}, {"body": "Imo you're about 6 months too late. Maybe the s&p will drop another 20%, but there is also potential for a bull market", "score": 1, "replies": [{"body": "oof i got into the stock market like one month ago", "score": 1, "replies": [{"body": "There is more FUD now than there was 6 months ago, but I feel that the likelihood of FUD rising even more over the next 6 months is less certain. China's lockdown and the Ukraine invasion can change fast.", "score": 1, "replies": []}]}]}, {"body": "I just bought into SPXS, hoping to make some profit in the next 2 months. Then buy back into SPY and QQQ when the recession is officially announced", "score": 1, "replies": [{"body": "what buying etfs that short bitcoin? I feel like bitcoin willl keep on going down as some big crypto hedgefunds and firms are kinda on edge and if they cant pay off their loans it will just lead to massive selloffs leading to crypto prices dropping", "score": 1, "replies": []}]}, {"body": "No they aren’t, you can’t predict the downtrend, but you know it will eventually go up in the long term", "score": 1, "replies": []}, {"body": "I use them at times for sectors that are turning one way or the other. Particularly on the bear side. I typically plan to hold for 1-5 days but could be up to 1-2 months if I have a large cushion and strong conviction (NRGD would be an example for me right now).", "score": 1, "replies": []}]}
{"title": "Please do not buy META. I know for a damn FACT that their services are dying. Litteraly thousands leaving their services.", "selftext": "[removed]", "id": "vkmid9", "created_utc": 1656185524.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 27, "comments": [{"body": "Worst attempt ever to secretly push your short position lol\n\nTry harder.", "score": 32, "replies": [{"body": "Good comment but I believe op, too painfully obvious to not be taken seriously", "score": 2, "replies": []}, {"body": "Read the post. \n\nGot another one everyone! Another person that only reads the title! GOtcha!", "score": -15, "replies": [{"body": "Are people leaving Instagram lol?", "score": 2, "replies": [{"body": "Kinda seems that way….less content and there’s just so many billshit bots\n\nAlso, i downvoted OP but upvoted the thread…yes", "score": 1, "replies": []}]}]}]}, {"body": "Nice try bro but satire doesn't work here even if you explicitly point it out lol", "score": 13, "replies": []}, {"body": "I wouldn’t touch Facebook/Meta with a 10 foot pole. I’d feel bad for the pole.", "score": 4, "replies": []}, {"body": "Sounds like someone had a ton of puts on META.", "score": 8, "replies": [{"body": "Hey everyone, my posts refers to the kind of people Constant-Sweet-3718 is. \n\nRead fully next time", "score": -3, "replies": [{"body": "First thing first...\n\nThe entire market is crashing to include META. If you're excited because META had a few good days then you're a fool. Nothing has changed.\n\n- Russian & Ukraine conflict (war) is still a problem.\n- Rising tensions between China & Taiwan. What happens if they go to war? Who does the US support? Give you one clue... it's not China. And how much stuff is made in China? Almost everything. We did this to ourselves. Our greed made China more powerful.\n- Inflation rate is almost 9%. Impacts everything from gas, food, services, loans, etc.\n- Home prices are insanely high. Who can avoid to buy, let alone qualify for a home loan today. There's fewer people buying houses today vs 12 months ago.\n\nThe list goes on and on. So a few good days or week isn't gonna change or prevent a market crash/recession. \n\nI thought it was funny to hear how desperate you were, joking or not, trying to convince others to sell/buy. I ain't telling you or anyone to sell/buy. I am waiting for a sign of improvement throughout the general market and a few good days for META don't mean shit.", "score": -8, "replies": [{"body": "You completely missed the point.", "score": 3, "replies": []}]}]}]}, {"body": "Your sister is basically your DD, nice", "score": 2, "replies": []}, {"body": "Imagine not buying a company with 40b in FCF and with a P/E of 12 just because they're the baddies. Meanwhile, Lockheed Martin & Co trade on the market and no one seems to give a shit.", "score": 1, "replies": [{"body": "And the “whistleblow” who had her big leak was that she didn’t think their censorship was oppressive enough.", "score": 2, "replies": []}]}, {"body": "I think Meta has a potential big upside run once the dust is settled", "score": 1, "replies": []}, {"body": "I wish thie was true. I see stupid clowns be exploited by Meta and these social media apps all the time,  even my partner and loved ones. This is why I invest them, because it works. And even when you explain it they are hamsters on crack and can't get enough of it. Solid 11/10 investment, it's like pornography for women.", "score": 1, "replies": []}, {"body": "You need millions to leave to make an impact", "score": 1, "replies": []}, {"body": "Buy Meta. IG is growing and popular with everyone I know. Source: my life.", "score": 1, "replies": []}, {"body": "“My sister told me she never logs on to facebook”\n\nSolid DD", "score": 1, "replies": []}, {"body": "Totally agree... Would Not touch it!!!", "score": 1, "replies": []}, {"body": "I thought your post was stupid, then I read it , laughed , and felt bad as you got downvoted. \n\nPeople really do be saying that shit though, as if they know.", "score": 1, "replies": [{"body": "It is satire.", "score": 0, "replies": []}]}, {"body": "I wouldn't bet against the guy who was bitten by a zombie but doesn't want anyone to know it..", "score": 1, "replies": []}, {"body": "\"My stepsis and her 5 friends don't use facebook nowadays. META IS DYING AND THOUSANDS ARE LEAVING ITS ALL FUCKED!!!\"", "score": 1, "replies": []}]}
{"title": "Visualize how the Fed's forecasted tightening schedule has changed since September '21. A look at Dot Plots!", "selftext": "**What's happening with the Federal Funds Rate and its forecasts?**\n\nFuture interest rate hike announcements play a huge role in the market. [This visual](https://i.imgur.com/TDz4tDH.png) from Blackrock depicts on the left panel what the Fed has in past months estimated the future trend of interest rates to be.\n\nEach Fed meeting, the Fed members take a vote, and the median forecasted Federal Funds Rate (FFR) is plotted for the next few years. The so-called [dot plot](https://i.imgur.com/yc7sX2L.png) (Graph from Bloomberg) shows all the estimated forecasts by each member, but the Blackrock plot I linked takes the median trend and connects the median dots. We see the curves for several months up to June, with the actual FFR trend plotted in green (in the first plot). You can see can see that even though the actual FFR the last few months has not actually deviated very much from forecasts made back in September 2021, the trajectory is *much* steeper and scheduled to be a lot higher than what was anticipated.\n\nThis is why forward guidance and the *rate* of interest rate hikes matter. The December '21 curve and June '22 curve have dramatically different implications, and this has been a major (if not *the*) cause of this year's current bear market.\n\n[This is what financial conditions have done](https://i.imgur.com/HFC00NO.png) as a result. The Fed did this through forward guidance, not past interest rate hikes. Changes in that future curve immediately affect bond prices/yields in global government and corporate credit markets, and as a result, translate to dampened equity valuations.\n\nI took this data and graphs from [Blackrock's weekly market commentary](https://www.blackrock.com/corporate/insights/blackrock-investment-institute/publications/weekly-commentary). They publish weekly their tactical (short term) and strategic (long term) views on different asset classes (emerging market stocks, private credit markets, etc.). I don't find those so valuable, but I do like their summary on markets each week. Here is the [year-to-date](https://i.imgur.com/ciFkuXa.png) performance of a broad set of assets. They write in this figure's caption that \"the two ends of the bars show the lowest and highest returns at any point this\nyear-to-date, and the dots represent current year-to-date returns.\"\n\n**This is separate from Quantitative Tightening**\n\nThe Federal Funds Rate being hiked is *not* the same thing as quantitative tightening (QT). QT refers to the Federal Reserve letting their assets bought during QE expire (mortgage backed securities and longer term government bonds). \n\nThe Federal Funds rate is the rate at which banks lend to each other in 'overnight lending facilities' to make sure they have adequate liquidity. The Fed manipulates this by buying/selling short term government bonds. This impacts short term borrowing rates primarily.\n\nQE/QT, on the other hand, is about non-traditional assets being bought/sold, like asset-backed securities, or longer term government assets. Alongside the Fed raising rates, the Fed is letting these assets expire without buying more, meaning funds are being taken out of the market to pay the Fed for holding these assets. That is, imagine the Fed bought a bond from the Treasury, the bond expires, and the Treasury pays the Fed the principal, and *poof* that money now disappears. The result has impacts on longer term borrowing rates. \n\nSimilarly, Fannie Mae and Freddie Mac pay the Fed the principal on mortgage backed securities. These transactions are completely different from those open market operations for the FFR, which are between banks and the Fed to impact the overnight lending rates.\n\nI have describe 'passive' QT, where the Fed just lets assets expire. Another more aggressive QT is called 'active' QT, where the Fed directly sells those longer term assets to remove them from its balance sheets. Passive QT is just letting them naturally expire on their own schedule. Active QT is more hawkish since imagine if one of the biggest buyers of mortgage backed securities in the market decided to start selling them. This would reduce their value (increased supply floating around the market) and raise their yields (need to demand more to hold them).\n\nOther central banks may start doing the same. The Bank of England also has been buying corporate bonds, and those will expire too. The Bank of Japan, if they ever reverse their QE, would have to actually sell their equities, since they not only buy long term bonds and asset-backed securities, but literal stocks!\n\n**Resources for more Reading**:\n\n1. An FT article on QT: [link](https://www.ft.com/content/2496105a-d211-4abe-ab5d-46a91876428f)\n2. A more comprehensive explained from the St. Louis Fed: [Link](https://www.stlouisfed.org/open-vault/2019/july/what-is-quantitative-tightening)\n3. QT in the Bank of England explained: [link](https://think.ing.com/articles/our-guide-to-the-bank-of-englands-quantitative-tightening). Read this to get a 'bigger' picture of what QT is conceptually.", "id": "vkn6cc", "created_utc": 1656187474.0, "score": 82, "upvote_ratio": 0.94, "num_comments": 25, "comments": [{"body": "TL;DR of my post:\n\n1. Fed forecasting of the Federal Funds Rate has become much more aggressive the past 6 months, in response to inflation.\n2. Financial conditions are tightening as a result.\n3. The discussion on 'interest rates' and the Fed is usually about the Federal Funds Rate, and this is separate from 'quantitative tightening' or QT. I explain what QT is and why it is not the same thing as typical open market operations that change the Federal Funds Rate.", "score": 20, "replies": [{"body": "You should check the \"financial conditions\" index from Fed's website, they use it to assess how much their FW is working. Also Bloomberg's financial conditions index is also very helpful. Financial conditions got relaxed in May which caused the end of the month rally but they made a U turn after the inflation print.\n\nAlso I don't think they let MBS expire (maybe because they expire far in the future), but they were talking about selling them in the future.", "score": 1, "replies": [{"body": "Oh thanks for the MBS point, I didn't actually know the details on QT for those.", "score": 1, "replies": []}, {"body": "Can you, please, elaborate on mbs part further? Like can we find any info on when they expire (if any expire in near term)  or when they start to sell those? Thank you!", "score": 1, "replies": []}]}]}, {"body": "Separate from my main post, the Fed argues that in theory, QT will *not* be very impactful on the market. Here is Bullard on why that may be: [link](https://www.stlouisfed.org/on-the-economy/2019/march/bullard-when-quantitative-tightening-not-quantitative-tightening). Here is a [screenshot summarizing the main part of his views](https://i.imgur.com/g7Kmjtx.png).\n\nThe idea is that QE is effective when markets are in crisis and liquidity is an issue. When markets are functioning, \"temporarily expanding the level of reserves beyond the satiation point for banks (that is, beyond the point at which all the reserve demand has been met) would have no direct effect on the economy.\" They cite a 2010 paper by Vasco Cúrdia and Michael Woodford. The main effect is through a signaling phenomenon. This might be consistent with Japan, where they throw everything at their economy but struggle to get any inflation at all. Where has their stock bubble been the last decade? Conversely, he claims QT won't have as much of an impact in normal (non-crisis) times.\n\nBut the rest of the market isn't so certain nowadays. Let's see how theory meets today's markets! I haven't fully digested this argument.", "score": 8, "replies": [{"body": "QT is going to put a lot more debt on the market and I think investors are going to start considering this debt much more risky with the Fed not committing to buying it up.  So yields will rise drastically.  But they already have so I'm not sure if it's priced in yet or not.  My guess is probably not entirely so far.", "score": 1, "replies": []}]}, {"body": "Does it have anything to do to the news in 2020 on how the fed will pívot on how it will  measuring inflation ?\n\n\nhttps://www.cnbc.com/amp/2020/08/27/powell-announces-new-fed-approach-to-inflation-that-could-keep-rates-lower-for-longer.html", "score": 6, "replies": [{"body": "No, I don't think so. The Fed uses many targeting strategies in determine if its policy is tight or loose, and some economists want to use non-price targets like nominal GDP expectations (Scott Sumner, for one). \n\nBut today's hikes are being driven by ad hoc responses to 2022's huge inflation spike, driven by supply chain issues, past monetary easing, and a Russia-Ukraine war. The Fed adapts their reasoning to future events, and no targeting strategy should be viewed as permanent or set in stone. Especially since this was back in 2020 in a completely different environment. [This is one reason people are criticizing the Fed's credibility for its sudden shift to 75 basis points hikes despite declaring them off-the-table.]", "score": 3, "replies": []}, {"body": "Almost certainly that contributed to the Fed getting behind the curve and allowing the inflation we've already had. Which has increased the risk they will go too far now and cause a recession.", "score": 2, "replies": []}, {"body": "> pívot\n\noh you fancy huh", "score": 2, "replies": []}, {"body": "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.cnbc.com/2020/08/27/powell-announces-new-fed-approach-to-inflation-that-could-keep-rates-lower-for-longer.html](https://www.cnbc.com/2020/08/27/powell-announces-new-fed-approach-to-inflation-that-could-keep-rates-lower-for-longer.html)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)", "score": 1, "replies": []}, {"body": "This reasoning was why the Fed allowed inflation to explode to 8% for an entire year before even ending QE.  It is also why they pushed transitory so hard.  They are far behind the inflation curve and should have started raising rates and ended QE a full half year earlier than they did.  But the idea that this inflation was just going to be a brief spike that would come down and they should not act is what they clung to for so long.", "score": 1, "replies": [{"body": "But inflation was, in fact, coming down before putin started to prepare to war, look at oil prices they’ve declined from 86 bucks to mid 60s in october-december of last year. Then Russian chatter started flowing in, and markets have been pricing in possibility of russian invasion.", "score": 1, "replies": []}]}]}, {"body": "How is this bad ?  We are still gonna gamble In stocks, and now is the bottom", "score": 2, "replies": [{"body": "Higher bond yields make risky assets like stocks have lower stock prices, because investors demand a higher premium for holding them relative to relatively safe government bonds. If you can get 4% on a government bond, you are willing to pay less to earn 10% on a riskier stock that may not give you positive returns.", "score": 1, "replies": [{"body": "One can argued Over the long term it does look like the market is willing to take that risk? Looking at the s and p going way back", "score": 1, "replies": []}]}]}, {"body": "What bear market? We are already out the bear market, currently.", "score": 1, "replies": [{"body": "Good point, I didn't specify which market.  \n\n- S&P 500 is now down 18% YTD and about the same from ATH, a correction\n- NASDAQ 100 is down 25%, and about the same from ATH, a bear market\n- Dow is down 12% YTD and 14% from ATH, a correction\n- Russell is down 20% YTD and 30% from its last peak in November 2021, a bear market\n- VTI is down about the same as S&P 500, a correction\n- VT also about the same as VTI, a correction", "score": 5, "replies": []}, {"body": "We made a new low one week ago...", "score": 2, "replies": [{"body": "We are no longer at new lows. Plus, statistically, we are no longer in a bear market, in the S&P500, nor the DOW.", "score": 0, "replies": []}]}, {"body": "I think this is more of a re-pricing rather than a bear Market? As these interest rates and inflation eat margins? What if they throw in tax hikes? Than we are perhaps in for more downside?", "score": 2, "replies": []}]}, {"body": "QT = money shredder go brrr. That will be $160,000 in tuition fees please.", "score": 1, "replies": []}]}
{"title": "Here are 5 economic indicators that I focus on as an investor. What do you like to use?", "selftext": "**Quick context:**\n\n* There is so much data and so many indicators to gauge how the economy is doing\n* But, the data has so much noise and many caveats (*data isn't timely, flaws in how the data is collected & measured, not actionable to connect-the-dots on what I should be doing as an investor*)\n* I've had to deal with similar issues as a Finance Manager who needs to report to the C-Suite and investors on how we're doing with the business. We have so much data and the same problems with our data, but how do we use this data to make actionable & swift decisions? \n* Using a similar philosophy, I identified 5 economic indicators that help me quickly & sufficiently gauge how the economy is doing and help me connect-the-dots on what I should be doing as an investor. \n* This is what I found helpful, but love to see your comments on what economic indicators make you a better investor \n\n&#x200B;\n\n**1. Jobs Report**\n\n* **Why:** The North Star for me is that my companies should be delivering strong results if people are employed, making money, and spending their money on goods & services that my company provides. Low unemployment, strong job creation, and a tight labor market quickly signals to me my companies should continue to do well with a firm economy.\n* **What I look for**: I'm very focused on the unemployment rate (*3.6%*), number of jobs created (*+390K*), and the labor force participation rate (*62.3%*). The labor market is strong which is great for my companies , but my longer-term outlook for unemployment (*4.0% - 5.0%*), job creation (*+100K*), and LFPR (*\\~60%*) is softer to align with demographic trends.\n* **Where:**  [Employment Situation - 2022 M05 Results (bls.gov)](https://www.bls.gov/news.release/empsit.toc.htm) \n\n&#x200B;\n\n**2. Jobless Claims**\n\n* **Why:** I really like to get a weekly Thursday update on how many people are filing for unemployment so I can get timely & high-frequency update on how the labor market is doing. A strong labor market is very important so my companies can sustain demand and deliver strong results.\n* **What I look for**: The pre-COVID average is 218,000 claims so anything below or around this level means the labor market is strong and gives me an indicator that the monthly jobs report should be strong as well.\n* **Where:**  [News Release (dol.gov)](https://www.dol.gov/ui/data.pdf) or find the unemployment insurance weekly claims report here [News Releases | U.S. Department of Labor (dol.gov)](https://www.dol.gov/newsroom/releases)\n\n&#x200B;\n\n**3. Materials released from the Federal Reserve like FOMC Projections, FOMC Minutes, FOMC Announcement, and Fed Chair Press Conference**\n\n* **Why:** They're professional economists, have more resources, and connections than I do to understand how the economy is doing & where it's going. I learn a lot from their expertise and try to make sure I'm on the same page on my understanding of the economy so I know where monetary policy and interest rates are going.\n* **What I look for**: My favorite thing to look for is their FOMC projections since they share their forecasts for economic growth (*\\~2%*), unemployment rate (*\\~4%*), inflation (*\\~2% in the long-term*), and interest rates (*another 175 bps by the end of the year*). \n* **Where:**  [The Fed - Meeting calendars and information (federalreserve.gov)](https://www.federalreserve.gov/monetarypolicy/fomccalendars.htm) \n\n&#x200B;\n\n**4. Inflation**\n\n* **Why:** The Federal Reserve looks at inflation to determine if interest rates should go up or down. If inflation is too high, the Federal Reserve will increase interest rates, tighten monetary policy, and will negatively impact stock prices regardless of how well my companies perform.\n* **What I look for**: I look at PCE since the Federal Reserve wants that to average around 2.0% for stable inflation and I also look at CPI. CPI is available earlier than PCE and has recently been **\\~2pp** higher than PCE. I expect PCE to be **\\~6.6%** for May '22 since CPI for May '22 was **8.6%**. Not good compared to the Fed's target of \\~2.0% for inflation.\n* **Where:**  [CPI Home : U.S. Bureau of Labor Statistics (bls.gov)](https://www.bls.gov/cpi/) \n\n&#x200B;\n\n**5. GDP from the Atlanta Fed**\n\n* **Why:**  Strong business activity in a country translates to higher profits for my companies. It's an important metric as an investor for that reason, but low on my list because GDP released from the BEA isn't timely at all (*it's released quarterly*), I'm already making decisions as an investor way after this is released, and there are a lot of noisy components that affects the headline number that has no impact on my companies. That's why I like to see the real-time GDP forecast from the Atlanta Fed since their model is built similarly to how GDP is measured and the model really helps me understand how numerous data points that are released over time will impact GDP like home sales, manufacturing indexes, and other data points that are tough to make investment decisions on their own.\n* **What I look for**: In the past, this has generally been around **1.5% - 2.0%**. I expect that to stay in the same in the long-run given demographic & productivity trends.\n* **Where:**  [GDPNow - Federal Reserve Bank of Atlanta (atlantafed.org)](https://www.atlantafed.org/cqer/research/gdpnow?panel=4)", "id": "vkph5c", "created_utc": 1656194267.0, "score": 100, "upvote_ratio": 0.93, "num_comments": 30, "comments": [{"body": "interest rate is one. War is also very important.", "score": 13, "replies": []}, {"body": "Edit: sorry - my sub is r/stockpreacher You're welcome to join as long as you aren't a dick.\n\nAll of them.\n\nHonestly, they're so easy to track and have a huge impact.\n\nConsumer sentiment, housing starts, CPI, retail spending, job starts, non-farm payrolls, inventory levels, the various manufacturing and producing indexes.\n\nAnd the global data is incredibly useful in a massive global financial event like this one.\n\nTakes 3 minutes to read daily.\n\nThere's a pinned post in my subreddit for the best resource for these things (IMO).", "score": 17, "replies": [{"body": "Can you link me the subreddit?", "score": 6, "replies": [{"body": "r/stockpreacher", "score": 1, "replies": []}]}, {"body": "Need sauce", "score": 1, "replies": [{"body": "r/stockpreacher", "score": 2, "replies": []}]}]}, {"body": "Nice, but how do macroeconomic indicators provide actionable insights for someone managing a long term stock portfolio? Example: Unemployment is up 0.5% and economic growth estimates are revised down 0.2% - should I sell my Apple stock or my VOO ETF? And if I do, what do I do with my money? Macroeconomics has no answer for that.\n\nI would argue that these indicators provide little to zero value as indicators of whether I should buy, sell or hold for the long run. Even for short term trading, I doubt they are useful predictors.", "score": 7, "replies": [{"body": "The release dates can be helpful for short term trading in some instances. Since shot term trading involves trying to think in probabilities, they affect your confidence in whether to even bother trading and if so can also influence bet/position sizes.\n\nLike you say though, sometimes they can also be of little concern.", "score": 2, "replies": []}]}, {"body": "https://www.currentmarketvaluation.com/\n\nI like looking at this occassionally for a kind of big picture view of things. I wouldn't make decisions solely based on it, but it's pretty palatable for most people I think. I'm a buy and hold investor so the indicators they use are more relevant for me.", "score": 5, "replies": []}, {"body": "In my opinion, the two most important on a macroeconomic scale are:\n\n1. Federal Reserve Interest Rates\n\n2. Quantitative Tightening/Easing", "score": 6, "replies": []}, {"body": "I don’t worry about reports and focus on the equities price, volume, volatility and momentum and the rate of change of revenues, earnings and free cash flow and how it fits in the big macro framework of Growth, Inflation and Government Policy.", "score": 2, "replies": []}, {"body": "As a technical analyst, my economic indicator is the 50 day ma in  Powell's facial wrinkles before he gives a speech.The increase in wrinkles is inversely correlated to the stock market returns..", "score": 2, "replies": []}, {"body": "Realizing none of it matters.  \n\nIf you are an INVESTOR you take what the market gives.  No active management and stay fully invested all the time.  If you are a SPECULATOR then the question should be do ANY of these or other metrics matter in the short run.  Answer is no.  Serial correlation/ auto correlation of returns (returns in the future correlating with current returns) for stocks and bonds is ZERO. That means today's returns have zero relation to next day, next month, next quarter, or next years returns.   That is why Burton Malkiel titled his famous book as such \"Random walk\".  This should be evidence none of these metrics make difference when it comes to predicting future short term stock returns.  Folks have a hard time accepting (almost like a drug addict) that there is NO way to predict future stock returns in the short run.  Once you accept this simple often proven fact then it makes it easier to be an investor vs. speculator.", "score": -7, "replies": [{"body": "You don't think an investor should ever look at what the inflation rate, unemployment, GDP report is saying? I suppose that makes sense if your investment strategy is 100% Target Retirement Date Fund and you invest every month/year no matter what. But would Warren Buffet be a better investor if you deprived him of all economic data?", "score": 3, "replies": [{"body": "Would he?  What does he say on the topic?  I know he recommends most/ nearly all be in  sp500 and not time markets which would make knowing this info. moot.  In general, the only use of this type of data or its ilk is to time the market.  ALL the data we have supports market timing LOSES you money vs. a static asset allocation (please read the seminal articles BHB and BSB peer reviewed published articles).\n\nHonestly, I see a big gap in knowledge on these Reddit forums on investing/ stocks and what the data has already shown and published in financial literature.  These are not MY feelings on the topic, but what is accepted financial theory.  If folks don't want to believe it that is fine, but doesn't mean they don't exist nor been proven wrong yet to support the prevailing concept on Reddit, i.e. lets pick stocks that are going to be winners and/ or lets look at some metrics to decide if I should in in or out of the market.", "score": 1, "replies": [{"body": "Can you be more especific? BSB shows companies and similar with BHB", "score": 1, "replies": [{"body": "Beebower/ hood/ brinson and then their 10 year follow up study Beebower/ singer/ brinson showed several things. One is active management, i.e. security selection and market timing produced negative returns vs. if they held their portfolio in a passive asset allocation.  So in this convo. I am using it to reference ANY market timing has been shown to produce negative alpha.  Unless one actuall thinks some of the top ?100 or so pension fund managers in the country (the sample group from those studies) are too dumb to have thought of these indicators themselves along with 100's of others that they churn through computers 24/7 and build their algos.", "score": 1, "replies": [{"body": "I'm living proof that buying and selling doesn't work . A race to the bottom. My saving grace I hope is krypto.  Put most in those stocks to try to recoup.  Not a retirement portfolio.", "score": 1, "replies": []}]}]}]}]}, {"body": "Speculating implies gambling.  Investing is put your money in and forget it.  Technical trading is completely different and encompasses day traders who are chart driven to others who are more involved in options and even more data-driven longer term trades.\n\nSpeculating is like buying a penny stock and hoping for explosion.\n\nInvesting is basically VOO and chill.  \n\nTrading would be like inverse ETFs.", "score": 2, "replies": []}]}, {"body": "Just one indicator, QT/QE, my stop and GO - My red light green light.", "score": 1, "replies": []}, {"body": "Sounds like more bad news.... Guidance would come lower...", "score": 1, "replies": []}, {"body": "Estimated inflation (cause I don't believe the actual reported numbers), the fear in reddit subreddits and media, underwear sales, and how well strippers are doing.  Other than that, buying and holding, and when stuff is down and people are fearful, I double down and buy more.", "score": 1, "replies": []}]}
{"title": "So I Accidentally Might have created a hedge fund money burning machine", "selftext": "I got tired of VIX being manipulated, so I planned to create own intraday since interday was hopeless.\n\nFind me in the picture\nhttps://www.nasdaq.com/market-activity/funds-and-etfs/uvxy\n\n1. I loaded open orders for nickels calls on any stock that might hit a strike price within reach if insane upwards movement we'd been having continued. During the plunge attempt these started selling. \n\n2.I also was looking for cheaper options premiums on ETFs so I bought options on a bond play, a value ETF and the R2000. I had all of these lined up at market open . The etfs being setup to complete at high prices so I could ensure to get them with fast market mores and high premiums. I accidentally told the market interest rates changed(In fairness due to there not being a free market on bid/asks), and Value ETFs the R2k were \"hot\" and needed hedging.  I told this to an empty market full of algorithms .Market manipulations goes really poorly when you start to begin your dump and an etf that hasn't gotten a lot of action screams \"Stocks only go up\".\n\nYou try to figure out what the fuck just happened and you fuck yourself as the market sentiment gets too heavy to ignore and you are hit with that volatility wave denied at ViX making it's was through the market creating a super bull when they wanted a bear. One person being irrationally optimistic like we were told to be broke the market.\n\nI have others that are red but look at the massive waves of their own volume responding to nickel options plays.\n\nhttps://imgur.com/a/2Se8Ssg\n\nMeta Materials Announces $50 Million Registered Direct Offering\n  https://finance.yahoo.com/news/meta-materials-announces-50-million-172000340.html\n\nhttps://www.reddit.com/r/wallstreetbets/comments/vj5o3e/what_are_your_moves_tomorrow_june_24_2022/idh44mu?utm_medium=android_app&utm_source=share&context=3", "id": "vka2si", "created_utc": 1656143984.0, "score": 21, "upvote_ratio": 0.75, "num_comments": 30, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|11|**First Seen In WSB**|1 year ago\n**Total Comments**|400|**Previous DD**|\n**Account Age**|8 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vka2si)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vka2si)", "score": 1, "replies": []}, {"body": "I dont understand any of this.... \n\nBut 10/10 good job. I guess", "score": 38, "replies": [{"body": "Bought different shit than everyone else right after they cleared all support. My ETF play being a significant percentage of derived market movement punched up into market with the full weight of their own money\n\nEdit- AM JUN. Expecting continuing fuck fuck games , so throwing a curveball myself. Repost of recent comment \n\nWorks up until enough of them leave, leaving behind a bunch of people they exploited with the most powerful military on the planet.\n\n\nNote- There isn't a community on earth from which they haven't bled prosperity, hope, and in some cases the very assumption of security & survivability\n\n\nEdit 2- preorder ATM puts on anything red deep on high volume(check prev 5 min and have lined up at market open) Don't sell, do the same for 5m gainers ATM calls and maybe puts too\n\nThey collateralize themselves and shares they own to attack, make it painful to move. Buy calls and puts random ETFs at market open to provide unusual activity and hiccup their algorithmic manipulation. Banks are all connected and own parts of each other. Fucking one cousin's valuation ripples into billions of dollars of implications when that collateral is being used to finance the attack.\n\nVIVE LES PETITS INVESTISSEURS, MANGE LES RICHES\n\nLIMIT PRICES ON ALL CALLs, HOLD PUTs(except of finance).  $6,942,069 ask price is what I'm using on many of my calls, but you want it to pendulum if their algo fails so provide a ramp for momentum. Hold the line, up or down doesn't really matter. We want momentum, resistance, and springboard effect when it transfers to effectively price speed\n\nFinal Note- If you don't agree, inverse me. It'll provide resistance that'll transfer to accelerate price speed", "score": 6, "replies": [{"body": "So.... buy calls?", "score": 1, "replies": [{"body": "Yes avoid funds, they fail and everything will do what it is currently doing until they destroy all of their hedging capital fighting themselves\n\nBanks are probably good for puts", "score": 1, "replies": [{"body": "But, how do you know their positions? (short positions). Maybe they aint too big too fail, but I doubt they did not hedge or anticipate bad economy in next months. Honestly, I\\`d rather go for solid investment fund than to short (or put) on banks just becouse \"small inconvenience\" like inflation. Well, my acc is destroyed anyway, but solid quality CF stocks with good moat - LEAPS and your golden.", "score": 2, "replies": [{"body": "They have both, it doesn't matter", "score": 1, "replies": [{"body": "Meh dont care... I already have what millionares want", "score": 1, "replies": []}, {"body": "Yeah I'm just enjoying watching hedge fund money burn, don't really know what other side looks like", "score": 0, "replies": []}]}]}]}]}, {"body": "Not really sure what you are saying. Does it have anything to do with stock prices sharply dropping simultaneously as you buy far out of the money nickel options? I had some strange experiences with that a long time ago.", "score": 1, "replies": []}]}]}, {"body": "You belong here", "score": 16, "replies": []}, {"body": "Is OP rain man? Because this doesn’t make any sense to me", "score": 4, "replies": []}, {"body": "UVXY puts are the new money printer, simple enough.", "score": 3, "replies": []}, {"body": "Even if all of that is complete fiction, it's a beautiful work of literature in and of itself.  Instead of an economist, they should have sent a poet...\n\nI applaud you. 👏👏👏📈🚀🌙", "score": 5, "replies": [{"body": "It is better than when I tried earlier, I slept like crap the night before and this kinda broke my brain when it happened", "score": 1, "replies": []}]}, {"body": "What ?", "score": 2, "replies": []}, {"body": "BOOM![img](emote|t5_2th52|4276)", "score": 2, "replies": [{"body": "4288 UNITS! BOOM!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}, {"body": "\"So I might accidentally have no idea what I'm talking about, but I'm really into conspiracy theories\"", "score": 4, "replies": [{"body": "They walked the global GDP into a position with unlimited downside in their enthusiasm to wipe retail", "score": 0, "replies": [{"body": "\"I definitely don't know what I'm talking about and I might also have a persecution complex\"", "score": 6, "replies": []}]}]}, {"body": "Still alive, turns out it was just a VIX component of MACD manipulation (likely by Blackstone and Russia going back to around 1992)\n\nSucking wealth out through long term algorithmic price manipulation. Invasion of Ukraine oddly started it's current wobbling, it was likely leveraged buying shares preparing for a dump when market crash dried up liquidity and made manipulation more obvious with brute force due to smaller margins for deviance ( Collateralized themselves I assume)\n\n\nEdit- Rain main comment, kinda, with slightly better social skills", "score": 1, "replies": []}, {"body": "Someone forgot to take their meds", "score": 1, "replies": [{"body": "Shit, I guess you are right. Hallucinating the market on an infinite death roller coaster is a possible explanation(17 hours after I posted initially)\n\nhttps://finance.yahoo.com/quote/%5EGSPC/", "score": 1, "replies": [{"body": "Oh wow the S&P500, never seen that before", "score": 1, "replies": [{"body": "Got an example of everything ripping this long ? (Bonds, crypto, and commodities too?)", "score": 1, "replies": [{"body": "What for?", "score": 1, "replies": [{"body": "For you to keep pretending this is normal", "score": -1, "replies": [{"body": "What’s abnormal about it?", "score": 0, "replies": []}]}]}]}]}]}]}]}
{"title": "WORLD DOLLAR LIQUIDITY contracted by a record-low -21% this week.", "selftext": "A bad economy leads to good stock market performance.\n\nStocks rallied strongly over the week on signs of a slowdown in growth and inflation, lifting the S&P 500 out of the bear market territory. Aside from energy, all sectors in the index recorded strong gains. As a result of monetary tightening by the Fed, the US economy and inflation slowed and moderated. A half-point decline in U.S. home sales in May, a drop in the S&P Global index of manufacturing activity in June that was well below estimates (52.4 versus 56), and a decline in the University of Michigan's consumer sentiment in June that was the lowest measurable level in nearly forty years. Federal Reserve Chair Powell testified before Congress on Wednesday and Thursday that inflation expectations appeared to be anchored. Due to his comments and the weaker-than-expected economic readings, the yield on the benchmark 10-year Treasury note briefly dipped below 3.0%, a large decrease from last week's peak of almost 3.5%. European shares stopped falling for the third week in a row as signs of slowing economies raised doubts about whether central banks would increase interest rates aggressively. China's stock markets advanced in hopes that President Xi Jinping would release more stimulus measures to support the economy and minimize the effects of COVID-19.\n\nhttps://preview.redd.it/ajfamg6gjq791.jpg?width=1105&format=pjpg&auto=webp&s=3de8845a15111619a584d450f35488731d615e38", "id": "vkb8xg", "created_utc": 1656149029.0, "score": 25, "upvote_ratio": 0.9, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 months ago\n**Total Comments**|2|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vkb8xg)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vkb8xg)", "score": 1, "replies": []}, {"body": "So forward looking. Until we dump 5% again because the fed raises rates like they announced 15 months ago.", "score": 12, "replies": [{"body": "They’re desperate to get retail trapped in positions.  Retail isn’t taking the bait.  So they’re holding off the crash.", "score": 5, "replies": [{"body": "Who is they though", "score": 8, "replies": [{"body": "The cabal", "score": 18, "replies": [{"body": "Ahh yes they", "score": 7, "replies": []}]}, {"body": "DMM’s, market makers/the all seeing all stealing market creators. Bonafide market\nMaking 101. Fuck retail over at all costs, over and over. Extract money from them. The house of the casino within the casino within the casino. Synthetic CDO’s of CDO’s of CDO’s of -gets disappeared-", "score": 1, "replies": []}]}]}]}, {"body": "Could have something to do with Russia being banned from SWIFT. The US dollar liquidity will continue to go down as USA continues to remove countries from using USD...\n\nMaybe the USA will keep poking China and force them to create an alternative to SWIFT.", "score": 14, "replies": [{"body": "It already exists. BRIC is going to have a gaggle replacing SWIFT with their version. Did you hear JPOW? The us is behind third world countries on quick settlements.  That’s why he’s being pushed to rush out FedNow", "score": 5, "replies": []}]}, {"body": "I officially call bottom .", "score": 4, "replies": [{"body": "SPY isn’t at 0 yet and there aren’t “mostly peaceful” protests everywhere so it’s not the bottom.", "score": 8, "replies": [{"body": "Yes it is .", "score": 1, "replies": []}]}, {"body": "💀", "score": 4, "replies": []}, {"body": "RemindMe! 25 days", "score": 4, "replies": [{"body": "I will be messaging you in 25 days on [**2022-07-20 13:45:01 UTC**](http://www.wolframalpha.com/input/?i=2022-07-20%2013:45:01%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/vkb8xg/world_dollar_liquidity_contracted_by_a_recordlow/idoq918/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fvkb8xg%2Fworld_dollar_liquidity_contracted_by_a_recordlow%2Fidoq918%2F%5D%0A%0ARemindMe%21%202022-07-20%2013%3A45%3A01%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20vkb8xg)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "25 that's all?", "score": 1, "replies": []}, {"body": "Half way there . Told you that was bottom .", "score": 1, "replies": []}]}, {"body": "you'll be the bottom, don't worry.", "score": 2, "replies": []}]}, {"body": "WDL = Monetary Base + Foreign CB Holdings of Securities Held at the Fed\n\n[https://twitter.com/EPBResearch/status/1540396701978181632?cxt=HHwWgIC-qfOoy-AqAAAA](https://twitter.com/EPBResearch/status/1540396701978181632?cxt=HHwWgIC-qfOoy-AqAAAA)\n\nforeign central bank securities holdings at fed did not change much for the last 10 years at \\~$3.5tr (FRB H.4.1 Table 1A)\n\nso this index just seems reflect fed monetary tightening, not reduced use of us dollars by worldwide\n\n&#x200B;\n\nthat said, i do agree most countries are actively looking into non-usd alternatives to clearing and settlement\n\ntoo much risk of political reprisals otherwise", "score": 1, "replies": []}, {"body": "Nice feel good pump. Thanks", "score": 0, "replies": []}, {"body": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}
{"title": "Bull market? nah... 🌈🐻", "selftext": "", "id": "vkkivb", "created_utc": 1656179792.0, "score": 59, "upvote_ratio": 0.7, "num_comments": 24, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|44|**First Seen In WSB**|1 year ago\n**Total Comments**|204|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vkkivb)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vkkivb)", "score": 1, "replies": []}, {"body": "What the fuck is a horse market", "score": 20, "replies": [{"body": "I think this was supposed to be posted in r/formula1\n\nFerrari is losing to redbull, because of their own mistakes. Hence the ferrari logo fucking itself.", "score": 18, "replies": [{"body": "What the fuck is a Ferrari market", "score": 11, "replies": [{"body": "I can assure you, it’s not a good thing.", "score": 2, "replies": []}, {"body": "Amazing first quarter then implosion and a terrible finish to the year", "score": 2, "replies": []}, {"body": "Opposite of a Lambo market.", "score": 1, "replies": []}]}]}]}, {"body": "Are you saying the market is gay? Or the market is fucking itself or that Ferrari is going to beat RedBull in F1???", "score": 34, "replies": [{"body": "Ferrari going to fuck itself and lose to red bull.", "score": 20, "replies": [{"body": "I  had to do a double take thinking it was formuladank. It’s so fitting hahaha", "score": 8, "replies": []}]}]}, {"body": "What does a horse even mean in the context of wall street?\n\nI've heard of bulls, bears, pigs, and even kangaroos. But wtf is a horse", "score": 14, "replies": [{"body": "Its like a bull market but with smaller balls", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "A bull is a horse who lifts", "score": 2, "replies": []}]}, {"body": "I love a good horse market", "score": 5, "replies": []}, {"body": "This does not make sense outside of r/formula1", "score": 3, "replies": []}, {"body": "Hey I've seen this video before.", "score": 1, "replies": []}, {"body": "So go to the casino and bet on black. Got it!", "score": 1, "replies": []}, {"body": "Horse fuk horse\n\nWhores fuk horse\n\nHorse fuk whores\n\nRetards left retarded", "score": 0, "replies": []}, {"body": "Somehow this market is simultaneously fucking both bears and bulls.\n*****\n\n\n*[wut?](https://www.reddit.com/r/WutbotPosts/)* | *[source](https://reddit.com/r/wallstreetbets/comments/uy8wl6/the_stock_market_ticks_up_a_little_bit_bulls_be/ia38b74/)*", "score": 1, "replies": []}, {"body": "Where’s the bear?", "score": 1, "replies": []}, {"body": "What does the horse represent?", "score": 1, "replies": []}]}
{"title": "We're about to be half way in a recession by technical definition", "selftext": "", "id": "vklr9x", "created_utc": 1656183354.0, "score": 40, "upvote_ratio": 0.83, "num_comments": 23, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|52|**First Seen In WSB**|3 months ago\n**Total Comments**|64|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/vas0sp/why_i_simply_dont_ever_want_to_touch_netflix_stock/) [x](https://i.redd.it/r7gqtrjv79591.png) \n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vklr9x)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vklr9x)", "score": 1, "replies": []}, {"body": "Recession is two consecutive quarters with negative GDP. The first quarter, the GDP went negative. The second quarter ends June 30. The GDP report comes about 2 weeks after that. The 2nd quarter was filled with supply line problems and included thousands of canceled air flights, for just a couple things that went wrong.  \n  \nJust a reminder of 2008. After the second quarter of 2008, the Fed, Wall Street and Cramer were totally oblivious that the recession had started after the 1st quarter and stayed oblivious until the 3rd quarter when Wall Street almost collapsed the entire US economy.", "score": 11, "replies": [{"body": "Can’t wait for the second movie. First one was great. ![img](emote|t5_2th52|4887)", "score": 4, "replies": []}]}, {"body": "So every month we get GDP data. At the start of the quarter we get our first preliminary print which happens at the end of the month. The following month we get our secondary preliminary print. Finally the third month which is quarter end, we get the official print for the prior quarter GDP.\n\nSo we're gonna get that data on June 29th and we're forecasting -1.5%. This will be our first quarter of negative GDP. This marks us being half way in a recession because by the technical indication, a recession is two consecutive quarters of negative GDP. We will know if we're officially in a recession by the end of September when we get the Q2 GDP print. We will however get a clue at the end of July when we get the preliminary print.", "score": 7, "replies": [{"body": "That is not and never has been the “technical definition” of a recession. Two quarters of decline in real gdp has always been one indicator of many. It’s not a requirement for a recession, nor is it the only indicator of a recession. Hard to sell a recession right now unless theres a large uptick in unemployment or consumer default.\n\n08 was declared a recession long before two quarters of decline in real gdp.", "score": -7, "replies": [{"body": "So when is a good time to buy a brand new Toyota® Rav-4 because I am an idiot and I want a new car?", "score": 4, "replies": [{"body": "Listen to your handlers", "score": -8, "replies": []}, {"body": "Never", "score": 1, "replies": []}]}, {"body": "When is a good time to buy the beach condo because I am an idiot and want a beach condo", "score": 1, "replies": [{"body": "When it’s 1/2 or 1/3 of the normal price and can purchase it off the court house steps without a realtor 😂", "score": 1, "replies": []}, {"body": "Listen to your handlers", "score": -9, "replies": []}]}]}]}, {"body": "what does a green negative number mean?", "score": 3, "replies": [{"body": "Forecast vs actual", "score": 2, "replies": []}]}, {"body": "if June is negative, on paper it’s a recession. imagine the media are waiting to go Ham on the recession head lines then as no one wants to admit it yet. If the above figure for may is correct seems like a done deal even if the Atlanta Fed predicts 0.9% positive.", "score": 3, "replies": []}, {"body": "Q2 will be positive, wait until after the midterms where REP. Party takes control and Jpow can save his REP. ass", "score": 0, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Still low? It's the fucking lowest it has ever been. \n\nHow can some people not see this? Realized inflation to the average smuck is around 25%, if not higher.", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I plan to, I'm also used to losing money 💰 🤑", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Have you been shopping lately??", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Who are you shilling for today, Biden or Cramer?", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I don't give 2 fucks about your numbers or the governments. I can simply go to the store, look at the price of something and math myself to common sense.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Gotta shake out all the bulls on these bear market rallys. Its a process but it will happen", "score": 1, "replies": []}, {"body": "Recession risk = bullish, initially anyway.", "score": 1, "replies": []}]}
{"title": "Explain to me like I am a kid. Why is the total stock market cap to GDP ratio so high nowadays?", "selftext": "I see alot of people are pointing out that we are in a bear market, the money printer was turned off and there are alot of $SPY charts with lines on them. But looking at something more meaningful- why the fuck is the total market cap to gdp ratio so high? Did I miss something? Is it that stocks are worth more than the whole USA\\`s GDP nowadays or could it be something else?\n\n&#x200B;\n\nPOV: Try to tell me we are in a huge fucking bubble without telling me we are in a bubble.\n\nhttps://preview.redd.it/plas0m2rau791.jpg?width=1754&format=pjpg&auto=webp&s=cff3344e375d9df426441cbbd4a5aea17a4670ae", "id": "vkpier", "created_utc": 1656194369.0, "score": 17, "upvote_ratio": 0.77, "num_comments": 27, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|12|**First Seen In WSB**|2 years ago\n**Total Comments**|538|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vkpier)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vkpier)", "score": 1, "replies": []}, {"body": "Although the number is a little bit higher than it used to be, the number has organically increased as a higher portion of the USA's GDP has been tied to the top 1% of companies than ever before and as companies have steadily become more international (they capture bits of other countries' GDP).", "score": 11, "replies": [{"body": "Yes Americas GDP is supposed to \"organically\" increase as well which it did if you look at a chart of the GDP. So truthfully, its more obvious that they were pumping the stock market and not the American economy. Said another way, instead of directing the free money printing at growing our country and economy, they were growing the stock market instead by using quantitative easing and other weird cheap money policies.", "score": 7, "replies": [{"body": "You do realize that there are other countries not named America that help increase profits for those 5000 companies?", "score": 9, "replies": [{"body": "yes daddy", "score": 2, "replies": []}, {"body": "Shhh", "score": 4, "replies": []}]}, {"body": "Nice try gaybear", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "I like this story. Easy to understand while I try to get this crayon out of my nose 🖍️ 🐽", "score": 7, "replies": []}, {"body": "This feels like enlightenment , you explained it so well", "score": 1, "replies": []}, {"body": "Elizabeth?", "score": 1, "replies": []}]}, {"body": "🐒🤝💪🚀📈🌙💎👐😜🤑😎🥂💉❄️🍆🤪😄🤣😮😯😲😧🤢🤮💵🗑️💰🔥😡🤬😠😥😢🤔🧐⌨️📊📉📣✊🍆💦💦💦💦💦💦💦💦💦💦💦💦💦💦💦💦💦💦💦💦💦💦💦😣😩😫😖😵⚰️", "score": 13, "replies": []}, {"body": "Also I just want to point out that for the **fed**eral economists in this country to let this hit 200% is just wrong. Historically and fundamentally that is disconnected from reality (the economy). Now alot of people are losing money while trained like fish to believe the stock market will recover this year.", "score": 3, "replies": []}, {"body": "Low interest rate means cheap money", "score": 3, "replies": []}, {"body": "Because not all multinational profits are included in the U.S. GDP calculation, but their market caps are included in the U.S. total. For example, Apple’s market cap is enormous, yet the iPhone is an export from China to the U.S., which actually reduces net exports and therefore the U.S. GDP.", "score": 5, "replies": []}, {"body": "Wait for it.", "score": 0, "replies": []}, {"body": "FED is chickening to do hard QT \n\n[https://rudy.substack.com/p/just-remember-its-not-a-lie-if-you](https://rudy.substack.com/p/just-remember-its-not-a-lie-if-you)", "score": 1, "replies": []}, {"body": "What flavor is the frosty?", "score": 1, "replies": []}, {"body": "IMO this valuation was driven by an era of low rates continuing into perpetuity.  And to be honest why wouldn’t you think that since it’d been that way for 15 years.  Fed wants to raise rates?  Just taper tantrum those bitches and we’re back to normal.  Everyone in this economy is a shill at this point claiming prices always go up.  The only shoe left to drop is earnings.  P/Es adjusting from this bubble and into recession at the same time is going to be an epic crash.", "score": 1, "replies": []}, {"body": "GDP is the product for a single year, if you had a machine that produced $1 every year it would be worth way more than $1.  Same with the stock market being worth more than the GDP if the stock market if a sizable percentage of the economy is in publically traded stocks.", "score": 1, "replies": [{"body": "So since 2013 they invented a machine that made the stock market more valuable than a country\\`s GDP?", "score": 1, "replies": []}]}, {"body": "What other country creates monster global profit machines like google, Facebook, Apple and MSFT? None is the answer, except for maybe China and who the fuck trusts any financials from a company in China(or India or Israel for that matter)? I bet 50%+ of profits from these companies is outside the US, but I am too lazy to look it up. Does that answer your q?\n\nDoes this answer your question?", "score": 1, "replies": []}, {"body": "I’m starting to think that we’re in a completely fraudulent system", "score": 1, "replies": []}, {"body": "u know there is a lot of things in this world outside of the US of A, and that many companys are listed in the Us of A that do business outside of the US of A, so that the GDP of the US of A has no correlation with the Markets on Wallstreets?", "score": 1, "replies": []}, {"body": "Globalization.", "score": 1, "replies": []}]}
