{"title": "$TSLA Daily Investor Discussion - October 13, 2018", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q2 Earnings Official Thread](https://reddit.com/r/teslamotors/comments/93rhl3/tesla_tsla_second_quarter_2018_results_and/).\n", "id": "9nsgam", "created_utc": 1539421533.0, "score": 13, "upvote_ratio": 1.0, "num_comments": 53, "comments": [{"body": "Happy Saturday!", "score": 6, "replies": [{"body": "When do the markets open? /s", "score": 2, "replies": []}]}, {"body": "New business insider article out, sure some may scream FuD or some may just read the article with an open mind ", "score": 6, "replies": [{"body": "They are gonna have so much cash flow in the next 6 months, this is definitely not going to be a problem.", "score": 1, "replies": [{"body": "How long do you think Tesla’s cash conversion cycle is?\n\nCCC = DIO + DSO - DPO\n\nDIO = days inventory outstanding\n\nDSO = days sales outstanding\n\nDPO = days payable outstanding\n\nAny cash from Q3 will certainly be available, but how much of the cash will be available at EOY when they are required to have it on hand?\n\n(I’ve got no idea)", "score": 8, "replies": [{"body": "Well here's an interesting exercise:\n\nAssume they don't have to pay suppliers for 90 days.\nAssume they can produce and sell a car in 45 days.\nAn additional volume of 5000/week will improve their cash position by almost $2 billion. \n\nDefinitely an oversimplification, over-optimistic and ignoring other variables that will reduce this number. Nonetheless, I think it's safe to say they will have a lot of cash flow in Q3, and a bit more after that, even with 0 profit, and I'm pretty confident they will have profit in the next 6 months.\n\nThis is really not something I'm worried about.", "score": 6, "replies": [{"body": "No and fair point. That’s kind of what I’m getting at. \n\nI have no idea how long their CCC is.\n\nI’d love to see an article about this if anyone has it remember one.", "score": 5, "replies": [{"body": "Hey, if you buy now, you'll be up some $50+ a share, right?? :)", "score": 1, "replies": []}]}]}, {"body": "Anecdotal: I remember seeing something saying 90 days for avg days payable outstanding, if someone knows definitively that would be appreciated. ", "score": 1, "replies": [{"body": "That’s how long they pushed out AP, arguably they’d turn cash over quicker than that.\n\nBut how quick I’m not sure. ", "score": 1, "replies": []}]}, {"body": "They have about a 2B float right now.", "score": -1, "replies": [{"body": "LMFTFY\n\nThey have 2B as of end of Q2.\n\n(They could have more or less right now)", "score": 5, "replies": []}]}]}, {"body": "Please explain that because I honestly don't see it. \n\nModel S and X is going to face either declining margins through competition (will have to lower price to sell the same amount of cars) or Model S and X will sell less cars for the same margin, either way that won't be as much of a source for cash. \n\nModel 3 is the big question for Q4 and next year. The question is what margins will a Model 3 have? If you believe that Tesla has sold its high margin vehicles first, which I do, then they will face declining margins going forward. \n\nThe quality of the cars exhibited on tesla motors shows that Tesla will have increased warranty liabilities and costs associated with fixing these cars. \n\nWhat is their maintenance CAPEX, how much do they need to spend per year to maintain factory operations.\n\nWhat is the expansionary CAPEX? Model Y, Semi, etc. all are going to need new factory lines built ESPECIALLY since Musk has already raised capital promising these products. Can musk raise capital again for these products and will the market accept that as a reasonable request?\n\nSo at the end of Q2 Tesla had -2.5 in net working capital, including 3B in payables. Now maybe they will simply be increasing the payables to keep cash on hand, but they can't do that forever. \n\nSo what do you mean by \"so much cash flow\"\n\nIs there a specific number you are expecting from Tesla in the next 6 months? \n\nThe only cash I can see is from an equity raise. they should raise equity to pay off these notes but at what price? I think it would actually send the stock up a substantial amount so why aren't they doing that? If they pay off these loans by issuing debt what type of debt is that going to look like? What interest rates will they be able to get. The 2025 debt has a 8% YTM. Can they get 8%, i doubt it. Can they do another convertible bond? Maybe but then the stock will be shorted by the bond holders to limit the risk of the convert. \n\nNow tesla could have a great quarter and be massively profitable, but I don't think Musk would be so quiet on twitter. I think he would be rubbing it in einhorns face, like he did before the 2Q. I believe Musk knew the stock was going to rip if he seemed put together on the call, which he was, and therefore he was gloating. Now he's been pretty quiet and instead of gloating is blaming the SEC for the stock being down. ", "score": 12, "replies": [{"body": "There's no evidence there will be any real EV competition for Tesla in North America for **years**.  The competitors either aren't real competitors, like GM, or will have to take **years** to ramp up production.", "score": 9, "replies": [{"body": "European sales over the next 3-6 months should be a good indication of what the competition will do to tesla for the Model S,X\n\n", "score": 5, "replies": []}]}, {"body": "Here's a 60 page thread that answers all these questions with every scrap of available data. https://teslamotorsclub.com/tmc/threads/q2-q4-2018-financial-projections.116065/\n\nIf you actually care about the answers read it. Otherwise keep pretending there are unanswered questions about Q3.", "score": 7, "replies": [{"body": "That's horrible to read through. Man I hate old, linear forums. ", "score": 3, "replies": []}, {"body": "While that is a great resource it is not answers from the company hut rather just projections. Everyone can make projections I’m just giving a counter argument to “printing cash” statement ", "score": 3, "replies": [{"body": "Your counter arguments are just hand waving. Every single one of them is dissected with existing data and shown to be based on false or non-existent assumptions in that thread.\n\nPut together some numbers based on available data that refutes the excellent analysis in that thread and people might take your post with more than a grain of salt.", "score": 4, "replies": [{"body": "Just because it doesn’t work with your bullish world viewpoint doesn’t mean my questions aren’t valid ", "score": 4, "replies": [{"body": "It not about viewpoints it's about actual backing up your assertions with data...", "score": 2, "replies": [{"body": "My balance sheet questions come straight from the 2Q earring. The others are questions and estimates, much like others in that thread making estimates. Other questions/assertions and opinions are from reading and learning ", "score": 2, "replies": [{"body": "Estimates are based on available data. Your estimates are wild and hopeful assertions based on your biased views. Read the thread I linked carefully because the guy doing the modeling has been right 3 quarters in a row and is now calculating around a billion in positive free cash flow. I'd love to see how your \"estimates\" worked out in Q2.", "score": 2, "replies": [{"body": "I’m barely estimating anything, I’m asserting issues with the estimates and questioning any musk isn’t raising capital. ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "You are conflating cash flow with profits. \n\nYou can increase your cash position by increasing your liabilities the same amount, without any profit.\n\nFor example, Tesla has a deal with part suppliers that they don't need to pay them for 90 days after they have received the part. As the _rate_ of production and sales increase, their cash position goes up, because at any point in time, they have more sales that they haven't yet paid for. ", "score": 2, "replies": [{"body": "No i am not, I said \"Now maybe they will simply be increasing the payables to keep cash on hand, but they can't do that forever.\" \n\nWith deliveries leveling off or even declining you won't be able to outrun the AP like Tesla has been. \n\nYou don't understand what CAPEX is. \n\nAt this point tesla has exhausted the high ASP of Model 3s which you can see by the quick turnaround from ordering to delivery. Now if they are facing lower margins that will decrease sales. They need to sell a lot more cars in Q4 to make up for the lost margin, unless they start making a 35k model 3 I don't see that happening. \n\nThat is why the 35k model 3 reservation number is important, it speaks to the backlog of higher ASP cars and lower ASP cars\n", "score": 6, "replies": [{"body": "Sorry for accusing you of that, I misunderstood since you were talking so much about margins and profits. \n\nYou're right about increasing payables, and they can't do that forever, but if they can do it until they are seeing some healthy profits, it will do the trick.\n\nAlso right about CAPEX, as it directly hits their cash flow. However, they are have already scaled back CAPEX plans so we need to take that into account. I think they would scale it back even more if they need to. And I'm pretty sure GF3 will be funded by local debt, so no worries there.", "score": 2, "replies": [{"body": "I’ll believe GF3 when I see it. Much like the semi I think it is more of a marketing ploy than real\n\nEDIT: Also i thought this is a growth company? why are they cutting capex when they should be growing their fleet? When is the Y and Semi? Why are people being laid off from Solar City? Why are so many executives leaving? ", "score": 1, "replies": [{"body": "We may find out more about GF3 on Oct 17.\n\n>Also I thought this is a growth company?\n\nWhat, is +50% quarter over quarter revenue increase too low?\n\n>why are they cutting capex when they should be growing their fleet?\n\n+100% quarter over quarter delivery increase not enough growth for you?\n\n>When is the Y and Semi?\n\n2020 or something like that\n\n>Why are people being laid off from Solar City? \n\nThey changed their sales strategy from door-to-door to in store and online\n\n>Why are so many executives leaving?\n\nI don't know, probably cuz Tesla is going bankwupt /s", "score": 4, "replies": [{"body": ">+100% quarter over quarter delivery increase not enough growth for you?\n\nCutting Capex.... Growth companies don't do that\n\nwhen you only look at 2 quarters of pent up demand it is easy to get confused. The backlog has clearly been depleted for >35k model 3s. You can order and get a model 3 is 8 weeks or less, and I would bet a lot less. If there is not enough demand for this product I don't think Tesla will be able to survive. \n\n2020 for the Y and Semi is pretty aggressive especially with such a horrid balance sheet, where are they going to get the money for those projects", "score": 4, "replies": [{"body": "Except you know they can deliver model 3s to the rest of the world.... You have no basis for any of your claims it's actually funny to see you people latch on to ever and ever more absurd lines of reasoning. \n", "score": 1, "replies": [{"body": "Yes they can deliver more, but there is a difference between built up demand over a few years and consistent demand from week to week or month to month. \n\nI think people get caught up in the numbers of deliveries assuming that production must meet some theoretical infinite demand ", "score": 2, "replies": [{"body": "You can easily look up the current demand surveys for long range EVs. It is about 100x Tesla's current production. ", "score": 1, "replies": [{"body": "At what price point?", "score": 2, "replies": [{"body": "Probably at the same price distribution as the demand for ice vehicles....", "score": 1, "replies": [{"body": "So at prices that Tesla can't meet at a profit?", "score": 2, "replies": [{"body": "Depends on what percentage of cars sold are above Tesla's cost. The premier teardown engineering company in the world said the terminal cost of a model 3 was 28000$ Every day the market for EVs gets larger, because every day batteries get cheaper.", "score": 1, "replies": [{"body": ">The premier teardown engineering company in the world said the terminal cost of a model 3 was 28000$\n\nThat's not including anything not directly involved with making the model 3. No research, no distribution, no sales.", "score": 2, "replies": [{"body": "You have no data to back up your claim.\n\nIt also fails to impute the decrease in cost of battery packs. Which publicly available data shows has declined at 20% per year for the last 10 years.\n\nAccording to that metric, a Tesla model 3 already costs less than 28000$ to make since almost half the car is battery costs.\n\nBy 2020 the M3 will be more like 24k to make.", "score": 1, "replies": [{"body": ">You have no data to back up your claim.\n\nI need you to elaborate on what the heck you're saying here.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "What’s a fair weekly estimate for M3 production right now?", "score": 1, "replies": [{"body": "5000 based on the recent Electrek [article](https://electrek.co/2018/10/12/tesla-model-3-production-strong-quarter)", "score": 2, "replies": [{"body": "I remember Evercore said that an increase from 5-10k should be cheaper, much easier and I think they said a lot faster than from 0-5k. \n\nDo you know if they’re hoping to be doing 10k sometime q1 2019?\n\nAlso, what’s the eta until the standard range?\n\nThanks", "score": 6, "replies": [{"body": "I believe that they will wait till demands on M3P die down then AWD LR then RWD LR then and only then is when they should release the $35k which probably toward the end of Q1 2019.", "score": 3, "replies": [{"body": "It really depends on the margins. I guess you ordered those highest to lowest margin.  Do we actually have any reliable data right now about margins (outside of UBS’s tear down of a really old model 3)", "score": 4, "replies": [{"body": "I believe during 2Q ER it was ~15% profit on higher margin model 3 ", "score": 3, "replies": []}]}, {"body": "It’s also clear that their delivery pipeline can’t handle 10k per week right now.  I don’t know where the bottlenecks are, but if they needed all-hands-on-deck to deliver 7k cars at the end of last quarter, 10k is going to require a better plan.\n\nMaybe it just as “simple” as opening up deliveries to more of the world, so each delivery center has fewer cars to deliver to get to 10k or more.", "score": 2, "replies": [{"body": "Delivery hell can be a good problem to have, I also think that bottlenecks are much simpler to identify and improve compare to production.", "score": 1, "replies": [{"body": "I have to agree that the delivery problems are simpler than the production problems because Elon stated that, but what does that mean?  They will be able to handle 5k/wk, 7.5/wk, or just get a more predictable, smooth, streamlined process.\n\nI don’t understand how delivery problems will be a good thing if it limits growth.  Demand is great, not being able to scale isn’t.", "score": 1, "replies": [{"body": "S/X tend to be about 50% US and 50% global. If 10k\\week is the final goal for model 3 then 5k\\week in the US is the final goal.\n\nI don't think Tesla is going up much over 5k\\week in this quarter and then will hold that flat going forward as they send cars abroad. That's why delivery issues will get sorted out, and probably fairly rapidly.\n\nThe ramp globally will be slower than in the US which should help, but errors are magnified by the distance from Fremont. Fortunately the cars hitting Europe will have had 18 months of quality refinement. The kinds of errors should be well known.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "7400/11*7 is ~4700, not 5000.", "score": 5, "replies": [{"body": "Oh, slightly higher mix of S/X than I thought. I just assumed 2000/wk and derived it from that, sorry", "score": 1, "replies": []}]}]}, {"body": "[https://www.reddit.com/r/RealTesla/comments/9o3vto/model\\_3\\_production\\_rate/](https://www.reddit.com/r/RealTesla/comments/9o3vto/model_3_production_rate/)\n\nAll unverified rumors, but some poster on realtesla said some engineers had them going over 5k these days.\n\nIt's just a random reddit post, so it's as likely to be true as false. ", "score": 1, "replies": []}]}]}
