{"title": "r/Stocks Daily Discussion Friday - Oct 26, 2018", "selftext": "These daily discussions run from Monday to Friday and Friday's will stay up till Monday.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n * [Corporate News](https://www.streetinsider.com/Corporate+News)\n * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n * [Economic data](https://www.streetinsider.com/Economic+Data)\n * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/about/sticky) or see past portfolio discussions with [this link.](https://www.reddit.com/r/stocks/search?sort=new&q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&t=all&restrict_sr=on)\n\nSee past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  And use this link to see past stock [options discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+options%22&restrict_sr=on&sort=new&t=all)\n", "id": "9rjrr5", "created_utc": 1540552053.0, "score": 8, "upvote_ratio": 0.79, "num_comments": 50, "comments": [{"body": "that feeling when i think i bought a stock on great sale that dipped, and then it continues dipping even harder a week later", "score": 11, "replies": [{"body": "\\#MuToo", "score": 3, "replies": []}, {"body": "Don't catch a falling knife (I kind of did the same). ", "score": 3, "replies": [{"body": "i was influenced by the buy high sell low people", "score": 1, "replies": []}]}, {"body": "you didn't pick up tesla at 255? its literally the greatest american company in over a century", "score": 2, "replies": []}, {"body": "What stock was that", "score": 1, "replies": []}]}, {"body": "After years of watching from the sidelines I decided to invest big at the start of September. I’m sorry to everyone, but I’m out now so things should pick up. ", "score": 8, "replies": [{"body": "Ah, the old buy high sell low strategy. ", "score": 15, "replies": [{"body": "I spat my coffee out. Totally worth it.", "score": 2, "replies": []}]}, {"body": "Goddamn bloodbath again today", "score": 2, "replies": [{"body": "wait till you see next week!", "score": 1, "replies": [{"body": "You predicting the bear?", "score": 1, "replies": [{"body": "i predicted it when i cashed out my retirement on monday the 8th, then started shorting the market and citigroup, and then going all in on tesla this monday\n\nal waleed bin talal owns citigroup which ran the obama administration and he owns the top floors of the mandalay bay hotel where a unknown guy murdered a bunch of trump supporters. khashoggi's arms dealing billionaire uncle sold a yacht to trump who then sold it to al waleed back in the 80's, waleed and ergodan are behind the khashoggi murder to try to oust liberalizing prince MBS, who invested 2 billion into tesla\n\nI predict Trump and MBS and Musk will win, which may bring about the collapse of the oil based economy faster than people expect", "score": 0, "replies": [{"body": "Really? Astounding 6th sense...how much are you up?", "score": 2, "replies": [{"body": "about 5 years of property tax payments", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I recently finished the paperwork and handed off two of my brokerage accounts (one inherited brokerage and one inherited Roth) to a recommended financial advising company. \n\nIn the past two weeks I've lost close to 100k across my entire portfolio (about 7 different accounts). In this same time frame the two inherited accounts have been consolidated into about 7-10 different companies. The biggest investments are in Merck, Nuvectra, Apple, and Nvidia.\n\nIs the market shitting the bed as of late or am I just invested too tall. I just emailed my advisors, I'd just like some of your input as well", "score": 4, "replies": [{"body": "I'm down about $40k. I didn't think there was any way in hell that Amazon would miss any aspect of their EPS. Then they did. Then my calls shit the bed. I feel your pain. ", "score": 3, "replies": [{"body": "AMZN screwed you over too? I bought at 1900, safe to say I am not making profits anytime soon.", "score": 1, "replies": [{"body": "At least you're not time limited with call options. I thought it was easy money. FML. ", "score": 1, "replies": [{"body": "Shoot man, I cant even imagine what you are going through. Today has been the worst day of the month for me. I just dont know what to do anymore, do I sell at a loss and buy when it goes lower next week? Or do I hold on in hopes of it rebounding next week. Its gonna take a lot to get this off my head.", "score": 1, "replies": [{"body": "sell. harvest your tax losses, and roll your cash into a different position. this is what happens when you \"buy the dip\". ", "score": 1, "replies": []}]}, {"body": "you mean you didn't straddle your AMZN calls with puts? ", "score": 1, "replies": []}]}]}]}, {"body": "This month has been a historic bloodbath.  Don't feel too bad though.  It's probably hard for anybody to be making money in a market like this, longs or shorts.", "score": 2, "replies": []}, {"body": "you need to be 100% tesla if you want to live through the collapse of the oil-based economy ", "score": 1, "replies": [{"body": "I own quite a few shares of Tesla and put a stop loss in at $240 after the public debacle recently. Luckily it didn’t hit the mark and has recovered nicely since then. ", "score": 1, "replies": [{"body": "every evil old power structure on the planet is going to try to stop them from succeeding. Don't sell before they're valued at 125000BTC", "score": 2, "replies": [{"body": "In that case, screw waiting. I've went ahead an liquified my securities and am moving to El Paso with mah and we're living in the bunker til this whole thing blows over", "score": 1, "replies": []}]}]}]}]}, {"body": "I've been watching WDC fall for awhile. With today's drop, they are now at a ~3 forward P/E. \n\nI know that computer hardwares are cyclical industries, but I don't understand how they can fall **this** low given that it's unanimously though that the memory requirements of the world will only increase over the coming decades. \n\nI do not have a position in WDC as of now, but now I'm tempted to enter. What am I missing?", "score": 3, "replies": [{"body": "AMD and NVDA are dropping due to the crypto-mining boom dying down. I expect to see a lot of used cheap crypto mining hardware for sale. It’s possible AMD and NVDA are dragging the rest of the industry with them somewhat. ", "score": 1, "replies": []}]}, {"body": "Today has been great for me. I was looking at a $2700 loss yesterday for this trade I made beginning of this month and I sold today for a $200 loss instead. If sold now, I would have even made a profit but I'm just glad to be able to get out of this trade. I want to be in cash in this market. Day trading with this volatility is great.", "score": 3, "replies": []}, {"body": "What do you guys think of LIT? Lithium ETF including 5% tesla. Seems like lithium is only going to be more in demand in the future right?", "score": 3, "replies": []}, {"body": "Just bought 20 shares of $FB at $147. Wish me luck!", "score": 6, "replies": [{"body": "why would you want to invest in an unethical subversive thought controlling advertisement platform", "score": 3, "replies": [{"body": "Because it's full of thots and their CEO makes congress look like old and bewildered fools. ", "score": 0, "replies": [{"body": "Thots? With such a great word come great reponsibility in usage. Only people like the great Chief Keef should use words like thot.", "score": 0, "replies": []}]}]}, {"body": "Good luck. Oct 30th is a big day for you lol. if we all forget our emotions and trade it based on value. FB could be trading at 200 again. They have over 2 billion users. Instagram god knows how many users and I know Whatsapp has over 1 billion. lets see what happens, I say 160ish by oct 31st", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I agree to some extent where the market is going, but I'd recommend buying gold, silver and copper instead of cryptocurrencies.  ", "score": 1, "replies": [{"body": "have you actually looked at historic gold prices vs. inflation and its yields? terrible idea. ", "score": 1, "replies": [{"body": "Really? In a recession gold tends to do well. ", "score": 1, "replies": []}]}]}]}, {"body": "So I've just opened my HL account, pretty excited to get into the stock market.\n\nHave about £1000 to invest, and will set up a standing order of approx £150 a month from there onwards.\n\nWould you dollar cost average and set up a standing order or just go for it? \n\nFeels like this could be an iffy time to enter.\n\nI already have some high risk investments in crypto so I was thinking of getting into GSK for a nice stable yield. I work in the medical field too so there's that.\n\nAny advice would be greatly appreciated\n\nCheers :)", "score": 1, "replies": [{"body": "You are overpaying  go with degiro its much cheaper or wait for free trading company gone open site in 6 months time in UK .", "score": 1, "replies": [{"body": "DeGiro has no tax free ISA accounts though so it's swings and roundabouts ", "score": 1, "replies": [{"body": "For me its cheaper at degiro at the moment even included 15% dividend tax . I planing to buy more growth stock in future so should be ok. But in future i gone go to free tradeing account.", "score": 1, "replies": []}]}]}, {"body": "Open a Roth ira through m1 finance or something and invest the money into that, trading an index according to your risk level. Now is an excellent time to start, but you'll be holding for 30 years so it's not a big deal. \n\nIf you want quick gains you need to do a lot of research and even then it's risky. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "how many other companies in the usa know how to make nuclear power plants?", "score": 1, "replies": []}]}, {"body": "Someone please explain to me what is going on. I am trying to find an answer but I cant find anything and its slowly starting to eat away at me because I cant find the root of the problem. Why are people selling? It just doesnt make any sense to me, things were looking decent and I expected the earnings to increase the stocks but clearly I was wrong. What started this whole snowball effect and why does it keep continuing? Why did earnings do nothing at all to help the stocks?", "score": 1, "replies": [{"body": "Earnings doesn't mean much like they used too. The interest rate, Futures, and panic selling is in play right now. Should be better in a couple of weeks.", "score": 3, "replies": []}, {"body": "Are you of the belief that the markets will always go up? Or what is the deal here? Overvaluation leads to poor performance. ", "score": 1, "replies": [{"body": "Yes, stock markets should always go up and up.", "score": 1, "replies": []}]}, {"body": "Bull Market usually runs for 3-4 years.  This last one run for 10 years", "score": 1, "replies": []}]}]}
{"title": "Stocks dropping following disappointing earnings from Amazon and Alphabet", "selftext": " \n\n### US Stocks\n\n* Global stocks are dropping this morning following disappointing results from **Amazon.com (AMZN)** and **Alphabet (GOOG.L)** and negative earnings guidance from European large-cap stocks \n* US stocks index futures are declining and are pointing to a sharp  decline to the start of trading in US stocks with the Dow Jones minis  –0.81%, S&P500 minis –1.03% and Nasdaq 100 minis –2.01% \n* Global stocks have lost close to USD$6.7tn in market value since  September as escalating trade tensions and higher interest rates have  dampened investor sentiment\n* 3Q US GDP estimates will be released at 8:30am and will afftect outlook for future interest rate increases\n* The VIX is moving up this morning and is currently at 27.18 after closing at 24.22 yesterday\n* **HYG** November 16 & January 2019 OTM Puits, **VXX** November 16 OTM Puts, **SPY** October 26 & November 16 OTM Puts, and **GDX** November 16 OTM Calls are the most heavily traded options contracts in US pre-market trading\n* US 10-Year Treasury Bonds are higher with yields down -3.56 basis points to 3.0811%\n* The US Treasury 2s-10s Spread has widened 0.08 basis points to 0.27%\n* WTI Crude is currently up 0.84% to USD$67.33/bbl with the Brent-WTI spread down USD$-1.54 to USD$8.28/bbl\n* Gold is currently up 0.36% to USD$1236.59/oz\n* European stocks are dropping this morning following disappointing  earnings results from US large-cap tech stocks and negative FY guidance  from large-cap European stocks \n* European oil stocks are trading at their lowest level since April  2018 as global oil prices head for its third straight weekly decline  \n \n\n### Stocks Trending in the News\n\n* **Amazon (AMZN)** reports  C3Q EPS of USD$5.75 vs Street estimates of USD$3.11.  While earnings  blew out estimates, revenues came in weaker than expected at USD$56.5bn  vs. a forecast of USD$57.1bn.  Amazon is rated “Attractive” in our US  Large-Cap Global Top Stock Ideas and “Top Buy” in our US Consumer  Discretionary Global Top Stock Ideas.\n* **Autoliv (ALV)**  reports interim C3Q sales slightly below market expectations.  Autoliv  sees FY CY2018 operating margin at 10.5% vs. previous guidance of  11.0%.  Autoliv is not rated in our Global Top Stock Ideas.\n* **Cabot Oil (COG)**  reports C3Q earnings which came in light vs. Consensus on weaker than  expected revenues for the quarter.  Cabot Oil boosts its quarterly  dividend 17%.  Cabot Oil is rated “Neutral” in our US Large-Cap Global  Top Stock Ideas.\n* **China Life (SEHK:2628)**  was downgraded at CICC after reportings worse than expected C3Q  results.  CICC cut profit forecasts by 40% for CY2018 and CY2019  earnings and cut their price target for China Life to HKD$23.  China  Life  is rated “Neutral” in our China All-Cap Global Top Stock Ideas. \n* **Electrolux (OM: ELUX B)**  is tumbling this morning after reports C3Q results which miss Consensus  expectations as higher raw materials costs continue to pinch operating  profitability.  North American sales were further hit on market-share  losses to private label brands following bankruptcy of Sears  (SHLD).  Elextrolux is rated “Neutral” in our European Large-Cap Global  Top Stock Ideas. \n* **Fujitsu Ltd (TSE:6702)**  reports F2Q earnings which miss market estimates.  Earnings for the  quarter were negatively impaired by costs associated with restructuring  following the sales of its PC business to  Lenovo (SEHK:992).  Fujitsu management sees operating margin reach 10%  by FY2022.  Fujitsu is rated “Neutral” in our Japan Large-Cap Global Top  Stock Ideas.\n* **Google (GOOG.L)** reports  C3Q EPS of USD$13.06 vs. Consensus of USD$10.40.  While earnings blew  out estimates, Google’s revenues, ex TAC, came in slightly below  expectations at USD$27.2bn.  Google average cost-per-click for C3Q  dropped 28%.  Google is rated “Neutral” in our US Large-Cap Global Top  Stock Ideas and “Attractive” in our US Info Tech Global Top Stock Ideas.\n* **Intel Corp (INTC)** reports  C3Q EPS that beat Street estimates as a surprise jump in PC demand  boosted revenues for Intel chips.  Revenues from Intel’s PC-focused  business grew 16% Y/Y.  Intel is the second large semiconductor maker in  the world and its positive earnings should provide a boost to  semiconductor stocks and the SOXX ETF.  Intel is rated “Neutral” in our  US Large-Cap Global Top Stock Ideas and “Top Buy” in our US Info Tech  Global Top Stock Ideas.\n* **Microsoft (MSFT)** reports  F1Q results which top estimates, though capex came in 4.8% below  expectations.  Microsoft’s beat was driven by its cloud computing unit  as revenue from Azure cloud computing services jumped 76% Y/Y.   Microsoft is rated “Neutral” in our US Large-Cap Global Top Stock Ideas  and “Neutral” in our US Info Tech Global Top Stock Ideas. \n* **SEB SA (ENXTPA:SK)**  cut its FY CY2018 profit growth outlook on continued impact from  FX volatility and weak retail sales (on account of disruption  from eCommerce boom).  SEB sees FY CY2018 sales growth of \\~8%.  SEB is  rated “Attractive” in our European SMID-Cap Global Top Stock Ideas.\n* **Sunny Optical (SEHK:2382)**  was downgraded to “Hold” at Jefferies with a price target of HKD$65.   Sunny Optical is rated “Unattractive” in our China All-Cap Global Top  Stock Ideas. \n* **Valeo (ENXTPA:FR)** is  plunging in early morning trading following C3Q results which miss  market expectations.  A slowdown in the China market and new rules on  emissions testing hit Valeo results harder than management expected.   Valeo cuts its target FY CY2018 guidance to 6.2%-6.5%.  Valeo is rated  “Neutral” in our European Large-Cap Global Top Stock Ideas.\n* **Western Digital (WDC)** reports  FY1Q2018 EPS of $3.04, matching consensus EPS of $3.04. While top-line  revenue was on par with consensus estimates, Western Digital’s top-line  revenue fell short of expectations as management reported FY1Q2018  revenue of $5bn compared to consensus of $5.14bn. Highlighting the  earnings release was Western Digital’s surveillance hard drive sales and  embedded flash solution revenue, both of which grew more than 30% y/y.  Western Digital is rated “Attractive” in our US Information Technology  Global Top Stock Ideas and “Neutral” in our US Large-Cap Global Top  Stock Ideas. \n\n&#x200B;\n\n \n\n### European Stocks\n\n* **European stocks are dropping this morning** following  the disappointing earnings results from US large-cap tech stocks and  negative FY guidance from large-cap European stocks \n* European oil stocks are trading at their lowest level since April  2018 as global oil prices head for its third straight weekly decline\n* The Euro Stoxx 600 is currently down -1.53%, the FTSE 100 has  declined -1.64%, the DAX has fallen -2.05%, and the CAC 40 is lower by  -2.34%\n* Investor sentiment for European stocks is negative with the advance/decline ratio for the Euro Stoxx 600 currently at 0.11x\n* Travel & Leisure (-0.36%), Food & Beverage (-0.48%), and  Utilities (-0.84%) stocks are the top performers in the Euro Stoxx 600  today\n* Oil & Gas (-2.85%), Automobiles & Parts (-2.45%), and  Technology (-2.33%) stocks are the worst performers in the Euro Stoxx  600 today\n* 9 stocks in the Euro Stoxx 600 are at 4-week highs while 272 stocks are at 4-week lows\n* 4 stocks in the Euro Stoxx 600 are overbought while 146 stocks are oversold according to the 16-day RSI Measure\n* VSTOXX, the European stocks equivalent of the VIX, is moving up  this morning and is currently at 24.85 after closing at 20.76 yesterday\n\n### Asian Stocks\n\n* **Asian stocks dropped in overnight trading** following disappointing results from US Tech behemoths **Amazon.com (AMZN)** and **Alphabet (GOOG.L)** \n* YTD, Chinese stocks have lost closed to USD$3tn in market value and  are on pace for the worst annual performance since CY2008 as the  Chinese government’s focus on deleveraging combined with rising global  trade tensions to spook investor sentiment\n* The Nikkei 225 finished down --0.4%, the Hang Seng ended down  -1.11%, the Hang Seng China Enterprise declined -1.16%, and the CSI 300  was -0.65%\n* Investor sentiment for Japanese stocks finished negative with the advance/decline ratio for the Nikkei 225 closing at 0.79x\n* 0 stocks in the Nikkei 225 hit 4-week highs while 187 stocks reached 4-week lows\n* 0 stocks in the Nikkei 225 closed overbought while 70 stocks closed oversold according to the 16-day RSI Measure\n* Investor sentiment for Hong Kong stocks finished negative with the advance/decline ratio for the Hang Seng closing at 0.47x\n* 0 stocks in the Hang Seng hit 4-week highs while 24 stocks reached 4-week lows\n* 0 stocks in the Hang Seng closed overbought while 6 stocks closed oversold according to the 16-day RSI Measure\n* Japan 10-Year Government Bonds are higher with yields down -0.4 basis points to 0.113%\n* JGBs 2s-10s Spread has narrowed 0.8 basis points to 0.23%\n* JPY¥ is currently down -0.463% against the USD$ to 111.9", "id": "9rk7vs", "created_utc": 1540556346.0, "score": 94, "upvote_ratio": 0.93, "num_comments": 53, "comments": [{"body": "[deleted]", "score": 17, "replies": [{"body": "I bought right at market close Friday. I think there will be a green day Monday, then I'm liquidating all my stocks and going to play earnings.", "score": 2, "replies": []}, {"body": "I agree. Nobody can time this market but when i saw everything going so well and records broke (in EU) i sold my stocks and cashed out. Glad i did at least", "score": 4, "replies": []}, {"body": "Nah I think it's done.", "score": -4, "replies": []}]}, {"body": "Woahhh amazon earning 56.5 billion instead of 57.1? Say it aint soo!!! Stupid.", "score": 60, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Not that it really matters, but it's up 66% this year.  I say it doesn't matter, because 66% in a year is still insane.", "score": 4, "replies": []}]}, {"body": "Are you trying to imply that the current 4 digit price does not reflect 50b+ in revs?", "score": 5, "replies": [{"body": "No im implying that when you are talking about revenues in mid 10s of billions and u miss by 1% , who gives a damn.", "score": 30, "replies": [{"body": "When you have a P/E of 150 in a market in correction, you have to crush earnings and raise guidance. Everyone expects Amazon to beat expectations so they can't miss and see their stock rise.", "score": 5, "replies": []}, {"body": "Especially when your EPS jumped ", "score": 7, "replies": [{"body": "EPS can be whatever AMZN wants it to be. Revenue is much more difficult to apply accounting to", "score": 8, "replies": []}, {"body": "EPS means little to investors, especially in the tech sector. EPS is easy to manipulate on the accounting side which is definitely what Amazon did to cushion the revenue fall. Also, the major factor is the lowered future guidance for Q4 earnings. Amazon expects 10-20% growth while analysts expected 30%.", "score": 4, "replies": []}]}]}]}, {"body": "But that Q4 guidance...", "score": 1, "replies": []}, {"body": "yeah it means they can't keep building momentum, which means the growth is over.", "score": 1, "replies": []}]}, {"body": "my Caterpillar stock is fucked.  I am at major losses with that shit.", "score": 7, "replies": [{"body": "Only at a loss if you sell it. Unless something has changed with the company since you bought it no reason to sell.", "score": -2, "replies": [{"body": "yeah its a long term stock.", "score": 4, "replies": []}, {"body": "No, just no\n\nIf you are 10% down... You are 10% down, there is no guarantee it will recover \n\nI'm guessing you don't think people who held Enron stock lost anything right? Because they never sold...", "score": 9, "replies": [{"body": "Something big changed with Enron. The company was run by crooks. No evidence cat is like that. Unless you know something. Enron was a house of cards.  Not a fair comparison. I guess everyone in 2008 that held on is still down? ", "score": 1, "replies": []}, {"body": "Caterpillar will recover. Enron shouldn’t be even remotely brought up with CAT. I’ve lived in Peoria. It’s a great company, shut the fuck up.", "score": -1, "replies": []}, {"body": "that's idiotic and why people sell at first opportunity, yes stocks are F\\*\\*cked permanently if a business goes under but we're talking about Caterpillar not sears or JCPenney or any other business that's doing ill. unless you have reason to believe the company is going to declare bankruptcy then there's no reason to believe that it won't recover at some point with the length depending of the factors in the overall stock market or economy that brought the value down to begin with.", "score": 0, "replies": []}]}]}]}, {"body": "This is the bottom right? .. right..?", "score": 5, "replies": [{"body": "Nope. Under 20k in 2019. That Buffet stock market, GDP metric doesn't lie, plus massive govt debt coming, trade war, and less free money", "score": 4, "replies": [{"body": "I think under 20k is the real floor and don't know if it'll get there, but if Apple does bad next week I expect another big selloff. ", "score": 1, "replies": [{"body": "Under 22k and I'll start paying attention to certain stocks, but when it hits 20k (and equivalent on other markets) is when I'll start loading up on ETFs and buying the dip\n\nCrashes, and a big one is coming, always break through the floor, which is when, to use Buffet's term, others get fearful and you should get greedy\n\nToo much greed in recent years, which is why you get folk on here who only entered the market 2018, thinking it was easy money and would never go down. These folk are now bemoaning losses\n\n(I only started monitoring this sub a few weeks ago, looking for signs of the peak, or near peak, which I found in abundance)", "score": 1, "replies": []}]}]}]}, {"body": "I should’ve kept my money in my piggy bank. Went from being up overall 11% two months ago to down -1%. Fuck everything. ", "score": 17, "replies": [{"body": "only -1%? congrats ", "score": 21, "replies": []}, {"body": "You should've spent in on Kleenex instead to wipe all your tears", "score": 7, "replies": []}, {"body": "I’m just a newbie but I’ve been investing in robo-advisor ETFs for 3 years now and my earning are -$1200. Is this normal? Is this a good time to be investing more?", "score": 1, "replies": [{"body": "I don’t like robo investing. They prob still have you in emerging markets.  ", "score": 2, "replies": []}, {"body": "Yes, assuming you're a long term investor and not trying to time the market. If you're buying into good companies you're currently getting cheaper shares. You'll be happy when things climb down the road...though be patient.", "score": 2, "replies": []}]}]}, {"body": "The only thing making me back some of my losses today are the YOLO 370 calls I made after TSLAs rockstar earnings yesterday.", "score": 3, "replies": []}, {"body": "nice post", "score": 2, "replies": []}, {"body": "In this market climate, is gold typically a good pivot for investing? Or will it get dragged down like everything else? ", "score": 2, "replies": []}, {"body": "Welcome to reddit. Where real investors post their insights /s", "score": 2, "replies": []}, {"body": "Wait didn't just yesterday it get reported they beat earnings?", "score": 1, "replies": []}, {"body": "Dang better move my tech investments back to coal!", "score": 1, "replies": []}, {"body": "Why are euro stocks falling based off Amazon? That doesn't seem like any sort of causation or correlation, considering oil prices are at their all-time lows there.", "score": 0, "replies": [{"body": "europe has a lot of volatility going on with brexit right around the corner, italy going crazy too and some other shit", "score": 2, "replies": []}, {"body": "Maybe some people are looking at Deutsche Bank.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": []}, {"body": "totally false headline.  you don't know shit.  AMZN and GOOG earnings were not \"disappointing\" but vastly exceeded expectations.\nStop posting fake news.", "score": -6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> Both missed revenue estimates.\n\nYour headline was about allegedly disappointing \"earnings,\" not revenues.  You misled people.  Amazon's purported revenue \"miss\" was less than 1%, well within the normal margin for error.  It blasted through earnings expectations by more than 30%.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Right, so he isn't confused, because Amazon didn't drop because of missed earnings.", "score": 1, "replies": []}, {"body": "Earnings means net income, not gross revenue.\n\nBut if you want to talk about revenues, in Q3 2018, Amazon revenues increased by 29% over Q3 2017.  https://ir.aboutamazon.com/news-releases/news-release-details/amazoncom-announces-third-quarter-sales-29-566-billion    That's explosive growth.  Absolutely not \"disappointing.\"\n\n", "score": 1, "replies": []}]}]}]}]}, {"body": "[removed]", "score": -11, "replies": [{"body": "Out of curiosity, how far does your imitation of Trump go? Is it just speaking? Do you do the same gestures? Have the same hair? ", "score": 2, "replies": [{"body": "Lol", "score": 2, "replies": []}]}, {"body": "So APPLE is going to crash ", "score": 1, "replies": [{"body": "*everything", "score": 3, "replies": []}, {"body": "Some of Apple's products are excluded from the tariffs.\n\nhttps://www.reuters.com/article/us-apple-tariffs/us-duties-spare-apple-gadgets-but-hit-cloud-industry-idUSKCN1LX27W", "score": 1, "replies": [{"body": "Sales in China won't be good. It's becoming a Chinese Meme stock", "score": 1, "replies": []}]}]}]}]}
{"title": "Do you guys think that AMD will go byond 30 in the next few years, or will it just hover from 20-25", "selftext": "I bought a couple hundred dollars of shares as my first investment at 31. Was wondering if I will ever make anything on it.", "id": "9rlr1y", "created_utc": 1540567880.0, "score": 28, "upvote_ratio": 0.72, "num_comments": 47, "comments": [{"body": "My parents bought AMD at $40 in 2000 and are still bag holding to this very day", "score": 63, "replies": [{"body": "Wow, thanks for sharing that. That is dedication.", "score": 21, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "The thing is, Amazon at 2000 is probably better than AMD at 31...", "score": 3, "replies": []}, {"body": "To be fair, even at the loss, holding AMD for these past few years was a better decision then bailing and purchasing something else", "score": 1, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Dunno, if the company is progressing then I would rather die than sell at a loss.", "score": 2, "replies": []}, {"body": "Could be that they completely forgot about it.", "score": 1, "replies": []}]}]}]}]}, {"body": "I think we're going back down to $10-13. ", "score": 22, "replies": [{"body": "I will start crying if it does", "score": 6, "replies": [{"body": "well $3 is always a possibility. We're in Q4 >_<", "score": 5, "replies": []}]}]}, {"body": "As far as I could tell during their respective earnings report 7nm is supposedly going to increase margins for AMD, while 10nm is going to drop margins for Intel, meaning I'd assume Intel will continue with higher prices into 2019-2020.  \n\nI'd also assume AMD will make a much larger jump going from Global Foundries to TSMC, even if they didnt perform a node shrink.  Global Foundries 12nm is somehow over 30% larger than Intels 14nm and is worse in every measurable aspect.", "score": 13, "replies": [{"body": "It's because those foundries exaggerate how small their node process actually is.  Intel 10nm is the same size as TMSC 7nm.", "score": 5, "replies": []}, {"body": "12nm is marketing.  It’s just a boosted 14 architecture.", "score": 3, "replies": []}, {"body": "I see a good year in 2019 for AMD", "score": 2, "replies": []}]}, {"body": "Buy in the red, Sell in the green. AMD is falling like a brick, I've been waiting for an opportunity to get in. They have amazing products, long term stock for sure. You should be over at /r/wallstreetbets if you got in at 31 and its at 17 now. ", "score": 33, "replies": [{"body": "Why, are they gonna be blown away that I bought it so high (I don't really follow that sub so sorry for my ignorance)", "score": 5, "replies": [{"body": "You will become mod", "score": 46, "replies": [{"body": "Lol...Wtf. I guess I'll go ask over there", "score": 18, "replies": [{"body": "You won't become a mod, you'll just fit in with the rest of us who bought in the green and sold in the red :)", "score": 9, "replies": []}, {"body": "Famous last words", "score": 5, "replies": []}]}]}, {"body": "You shoulda won Oscar", "score": 2, "replies": []}]}, {"body": ">AMD is falling like a brick\n\nAll of tech is falling, but its more likely an adjustment to all the tech stocks being overvalued.", "score": 3, "replies": [{"body": "In a few months the market is going to do it all over again.", "score": 1, "replies": [{"body": "Maybe.  It took some time for this correction to happen.", "score": 2, "replies": [{"body": "Some kind of good news is going to spur the economy after the election, but the news will be empty.\n\nNo facts all feels. So even if we see that happen, I'm as wrong as everyone else who says otherwise. That's just the gut flora talking.", "score": 1, "replies": [{"body": "So I take it you don't follow the economy then?  As it recently reported it grew some more while the Dow went down again.  So no this going to be repeated in a few months outside of a recession.  ", "score": 1, "replies": [{"body": "Did you just disagree by agreeing with me?\n\nI said this pattern is going to repeat. Then you just said, \"this going to be repeated\". I may be reading you wrong.", "score": 1, "replies": [{"body": "I am saying it may repeat not that it will repeat.  The stock market is illogical.  We effectively had a dot com bubble going on for the past several years with it finally self correcting from the over valuation going on.  ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I'm at 35 shares @ $20.39 avg. but looking to get more.\n\nHow do you approach buying in the red in terms of where you should be aiming to lower your avg. cost?", "score": 1, "replies": [{"body": "Use trading view to watch your stocks. Research market analysis metrics with different indicators. Its not a sure thing and most will probably hate on it, but I prefer watching RSI. Relative Strength index to determine when to get in and get out.  It shows the correlation between being over bought and over sold. Buy in when rsi is under 30, sell when it goes over 60. If you do that through the swings you cant loose. ", "score": 1, "replies": []}]}]}, {"body": "I think they will break 30 next year.  They are just shit at giving accurate guidance.  And corporate customers are super conservative.  Now is not necessarily the best time to buy though.", "score": 2, "replies": [{"body": "Really? It’s pretty cheap....", "score": 1, "replies": [{"body": "Compared to what? It was less than $10 earlier this year and not long ago is was $2.", "score": 1, "replies": [{"body": "AMD was $2 a share?!?!?", "score": 1, "replies": [{"body": "Yeah, back in 2012/2013. I can't believe how fast it shot up over the past five years.", "score": 1, "replies": []}]}]}]}]}, {"body": "I bought AMD at 25, but I'm gonna hold until I can get out for free. :-) (hopefully some time by the end of next year)\n\nIt was ok for a while, but the drop is just too big. Should have paid better attention to the 30 year chart. This is not a winning stock. ", "score": 3, "replies": []}, {"body": "One problem with AMD is amount of debt. I think their debt to equity ratio is 1.33.\n\nRefinancing their debt could become a problem if interest rates are  going up.", "score": 3, "replies": []}, {"body": "Not for a long time I think. Got in at 10.50 and 9 and collected my initial investment at 26. Now holding the rest long term!", "score": 1, "replies": []}, {"body": "I expect AMD will get close to INTC in share price. Thinking $35-$40 by 2020. \n\nI forget which analyst said they were going to get to $25/share by january 2019, but i remeber the responses I got on reddit calling me and that analyst idiots. I wouldn't really listen to too much of what people say on here. If you have faith in the company, their mission statement, and their products, then invest. I'm AMD long, bought 100 shares at $10.80. ", "score": 1, "replies": []}, {"body": "I held AMD at around 14... twice, one going up, one going down.  I didn't expect it to take off but I'm glad to be off the cycle and just consistently having a bloodbath across the board.", "score": 1, "replies": []}, {"body": "Nobody knows the future nobody :) But at the moment i wouldn.t tuoch amd stocks as it is TOXIC . gpu sell gone go down next Q a lot if nothing gone change . But if cryptho mining profit gone sky rocket amd stock gone go high :) ", "score": -1, "replies": [{"body": ">i agree we are almost in bear market territory. I will wait for it to bottom out. Wont be surprised if it loses all the gains made this year. But if overall market turns around, the narrative could change.   \n>  \n>  \n>  \n>AMD's problem is they are only in traditional CPU/GPU markets. Intel at least has FPGA, IOT, 5G, AI(including ASIC coming up) and Autonomous driving through Mobile Eye. That limits their long range outlook.\n\n&#x200B;", "score": 1, "replies": [{"body": "Amd is in AI as well just all gpu companys was hit with much less people buying gpus, cpus we gone feel it in next Q less people gone buy new gpus , cpus than they can buy cheap used gpus , cpus.", "score": 1, "replies": []}]}]}, {"body": "Dumbass post dawg. Who the fuck knows!", "score": -13, "replies": [{"body": "He just said it was his first investment give him a break punk assssss", "score": 15, "replies": []}]}]}
{"title": "Thank You AMZN For The Tendies! All losses recovered today! Positions below.", "selftext": "", "id": "9rkr6r", "created_utc": 1540560761.0, "score": 260, "upvote_ratio": 0.97, "num_comments": 53, "comments": [{"body": "That card is super gay, but I live msft so all for it", "score": 66, "replies": [{"body": "think we all like MAAN love", "score": 22, "replies": [{"body": "♪ It's MAAN love... ♪", "score": 4, "replies": []}]}]}, {"body": "Fucking sell this now and make some green while we're all red.", "score": 43, "replies": [{"body": "http://imgur.com/PTbH0QA", "score": 35, "replies": [{"body": "Well done. Enjoy your new Ford Focus. ", "score": 46, "replies": [{"body": "Thanks brother.", "score": 26, "replies": [{"body": "or like 30% of a tesla. almost there!", "score": 16, "replies": []}]}]}]}]}, {"body": "Positions before the open: http://imgur.com/Wfp54Nb", "score": 45, "replies": [{"body": "You can sell uncovered options on RH?", "score": 18, "replies": [{"body": "No. ", "score": 19, "replies": [{"body": "Then how are you short a SPY call?  ", "score": 15, "replies": [{"body": "Because I also own a SPY LEAP. Poor mans covered call.", "score": 34, "replies": [{"body": "Oh ok, well the screenshot didn't show that, so was confused.  Thanks", "score": 13, "replies": [{"body": "I see that now. Didn’t think people would care. AMZN put = focal point", "score": 13, "replies": [{"body": "Indeed.  Nice play", "score": 6, "replies": [{"body": "Yeah pure luck.", "score": 9, "replies": []}]}]}]}, {"body": "What is that?", "score": 1, "replies": []}, {"body": "How does that work?", "score": 1, "replies": [{"body": "LEAP substitutes for 100 shares of stock for covered call. Basically a very long term diagonal spread.", "score": 3, "replies": [{"body": "Right but what if the contract you are short gets executed and your leaps are still otm ", "score": 1, "replies": [{"body": "For one, I’d recommend only buying ITM LEAPS. Two, the short call is usually way OTM (.20 delta) and chances of exercise are basically nonexistent. If it gets close to ATM near expiration, you can roll out and/or up to avoid exercise.\n\nIf it gets exercised, then the LEAP will also be exercised to cover the 100 shares. You’ll lose money unless the short call is above the break even point of the LEAP.", "score": 7, "replies": [{"body": "Ok. Thanks. I’m with you. Last question; what does this mean:\n\n>\tyou can roll out and/or up to avoid exercise.\n\n", "score": 2, "replies": [{"body": "Lookup “rolling options”. Basically, buy back the ATM call for a debit and then sell another one further out in expiration for a bigger credit.\n\nDo plenty of research before attempting!", "score": 3, "replies": []}]}, {"body": "Way off topic here, but I thought getting your short call exercised still made you money? Since the LEAP is still further ITM and you \"buy\" the stock for a cheaper price and immediately sell it for that higher price, keeping the difference?", "score": 1, "replies": [{"body": "If the short call is above the break even point of the LEAP, I suppose you’re right.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I've been wondering if RH app is smart enough to be able to do this. Sweet.", "score": 1, "replies": [{"body": "If you’re approved for level 3 options trading, you’re in!", "score": 4, "replies": []}]}, {"body": "Wait, I can write puts if I'm long a greater amount of calls? ", "score": 1, "replies": [{"body": "He’s talking about the short SPY call. Lookup Poor Mans covered call.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "You have balls to buy puts against Bezos", "score": 18, "replies": [{"body": "balls to play that volatility...\n\nhistorically, AMZN earnings have NOT been a safe bet. \n", "score": 6, "replies": []}]}, {"body": "Very nice way to start the weekend. Good shit.", "score": 16, "replies": []}, {"body": "Nikkkooo it’s your nephew ", "score": 11, "replies": [{"body": "Let's go bowling cousin", "score": 7, "replies": []}]}, {"body": "Way to add oil to the fire.\n\nF", "score": 5, "replies": []}, {"body": "I’m not that good at puts or calls but  it says you have 1 buy of an 1800 AMZN put. How were you up $4200?", "score": 5, "replies": [{"body": "his 1 put option equals the option to sell 100 shares at 1880. So if he purchased the stock now at 1630, and exercised it would be worth around (1880-1630)*100 => $25000, so depending on how much he paid for it...", "score": 9, "replies": [{"body": "What happens if you don’t have the 163000 to buy the 100 amazon shares?", "score": 1, "replies": [{"body": "not entirely sure but i think you can sell the contract to people who do have the money ", "score": 9, "replies": [{"body": "You are correct", "score": 2, "replies": []}]}, {"body": "Thats when you buy $ROPE and leaps", "score": 2, "replies": []}]}]}]}, {"body": "Didn't realize WSB allows green posts", "score": 8, "replies": []}, {"body": "that is so cool man. ", "score": 7, "replies": []}, {"body": "love me some MAAN", "score": 3, "replies": []}, {"body": "God CNBC makes me wanna puke ", "score": 2, "replies": []}, {"body": "Thank you Bezos, very cool!", "score": 2, "replies": []}, {"body": "Jesus fucking christ that shit is fucking retarded what the goddam fuck LOL", "score": 4, "replies": []}, {"body": "When do you buy the put? I had 1600 11/2, which I made $1,500 on (bought at $12 end of day yesterday and sold at $27 this morning). \n\nTrying to decide is buying ITM puts is a better risk/reward.", "score": 1, "replies": [{"body": "Buying ITM costs more but has less time decay and better chance of profit.", "score": 3, "replies": []}]}, {"body": "I must admit, AMZN was a huge part of saving my ass today as well not directly, but still.", "score": 1, "replies": [{"body": "Details needed...", "score": 0, "replies": []}]}, {"body": "Brilliant. Now what's your next play on earnings? ", "score": 1, "replies": []}]}
