{"title": "Is there any way to trade the vix, without using vix futures or options.", "selftext": "VIX tracks the volatility of the index, is there a way to trade the vix by trading a set of index options, rather than trading vix derivatives. \n\nThe reasons I ask this question is, if you can. You can trade volatility of individual stocks, commodities, etc.\n\nI personally want to trade India VIX, but there are no vix futures on the indian stock exchange. ", "id": "7fh97g", "created_utc": 1511637139.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 10, "comments": [{"body": "paging u/Fletch71011", "score": 5, "replies": [{"body": "If he wants to trade the VIX synthetically, it's as simple as buying ATM monthly S&P500 options (straddle would work). If he wants \"India VIX\", I'm assuming he can buy straddles on their index but I've never traded international indices before so I'm not entirely positive on how they measure their volatility.", "score": 5, "replies": [{"body": "Trading long (or short) ATM option straddles on the index (as index options), index futures, or index ETF would indeed be one straight forward way to capture volatility expansion or contraction. In this example, that would include short or long straddles around the Nifty 50 (NIFTY50) index or NSE FTSE 100 index (NSEFTSE), both having European-style options available on NSE.\n\nAs to the question of the OP, [\"India VIX\", or NVIX](https://nseindia.com/live_market/dynaContent/live_watch/vix_home_page.htm) is in fact an existing product, and [India VIX futures](https://www.nseindia.com/content/indices/India_VIX_Brochure.pdf) contracts trade on the NSE since 2014.", "score": 4, "replies": [{"body": "They do exist but the volume is abysmal, there is basically no liquidity. ", "score": 1, "replies": [{"body": "I would advise against illiquid products, personally. It's just pain ahead in most cases. \n\nAlso, Indian markets don't permit leverage which probably (pure speculation) dampens volatility versus other markets. [Though I'm not ignorant of the fact that someone can borrow with other collateral and still inject that leverage into a market.]", "score": 2, "replies": []}]}]}]}]}, {"body": "The various ETPs (VXX, UVXY, SVXY, etc.) are traded on stock exchanges.", "score": 3, "replies": []}, {"body": "The \"pure play\" for VIX is SPX options. All the vol products are second  or third or fourth derivatives from these.\n\nSo, if you have options on your broad market index in India, you play those. \n\nSame goes for Japan, for example. You've got Nikkei Vi futures, and even an ETF (2035.T) but there are no Nikkei Vi options, so you would play the Nikkei options.", "score": 1, "replies": []}, {"body": "You are looking for NVIX, they are VIX futures on NIFTY index. \nLook out for liquidity before you proceed.", "score": 1, "replies": []}, {"body": "Put the vix infront of a mirror to become xiv then inverse trade the xiv \nI do it all the time", "score": 1, "replies": []}, {"body": "The vix is just a cash settled index based on the avg premium of s&p options - there are volatility products for Indian markets I would imagine...", "score": 0, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "7ffekv", "created_utc": 1511619035.0, "score": 46, "upvote_ratio": 0.91, "num_comments": 17, "comments": [{"body": "Just hope they don't cut off the link to your broker.", "score": 15, "replies": []}, {"body": "Up. Ending net neutrality is bad for the consumer but good for the entrenched ISPs' bottom lines.", "score": 24, "replies": [{"body": "So grabbing some AT&T or Comcast would be a good idea.. even better if it’s repealed?", "score": 3, "replies": [{"body": "What if it doesn't get repealed though? I wouldn't buy it, it's an unknown at this point.", "score": 3, "replies": []}, {"body": "I'm not buying any, but it's definitely a possible play.", "score": 2, "replies": []}]}, {"body": "Is it already priced in though? This has been a forgone conclusion for months by this point.  The only question is when. ", "score": 1, "replies": [{"body": "Probably only partially and the future earnings will be stronger as well. Who knows if it's a play worth making, but I'm giving it a look see for a bit. ", "score": 1, "replies": []}, {"body": "I don't think it's a 100% \"sure thing\" yet. I'm sure it's partially priced in, but there's probably some upside left if it happens.", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[removed]", "score": 2, "replies": []}]}]}, {"body": "Unless everyone signs up for google fiber. They already have my data, may as well go fast.", "score": 4, "replies": []}, {"body": "I think they stand to gain big time.... they have been getting beat up badly and some help from the government would help them... unfortunately it will come at a cost from the consumer.. I'm for Net Neutrality but I feel the general public can't care any less about it... We're screwed ", "score": 1, "replies": []}, {"body": "I don’t think NN’s repeal will have an immediate affect. They have to stop the bleed from cord cutters to get out of their current slump. Funny thing is, for the first time I’m thinking about canceling home internet because I’m sick of my ISP. Online gaming is really the only thing I need a hardline for.", "score": 1, "replies": []}, {"body": "Well, your question has the parties spelled out, it is definitely the old guard of telecom hardware and broadcasting  rights manipulating policy against high-traffic service or content providers.  \n\nThe move doesn't regulate the newer tech companies, like AMZN, FB, GOOG, and NFLX, but we will have to see what plan changes each ISP rolls out, how that affects membership of subscription services they own/don't own, yada yada, and all the while there will be lobbying, if not actual legal appeals, from both sides.  We will have to hold our cards and see what an x% increase in the internet bill does to time spent on certain platforms.  If enough people spend less time on social media, advertising on those platforms may lose value.   Basically, there are huge piles of money trying to get behind each other here.  I am curious about the route that smaller, regional ISPs take, as well as how CSCO, ROKU, VSAT, gaming stocks, and especially PYPL will be affected.  ", "score": 1, "replies": [{"body": "Yeah I was curious if something like this could help revive the likes of Windstream or give Century Link a nice boost. ", "score": 1, "replies": []}]}, {"body": "They will be up for a day or two and then fall to lower than they were last week IMO", "score": 1, "replies": []}, {"body": "[deleted]", "score": -4, "replies": []}, {"body": "Google dropped their expansion into fiber after the title 2 change went into effect and numerous smaller privately owned ISPs have said they stopped expansion into other markets because of the implementation to Title 2.\n\nYou might see some start expanding out but I would not bet on it.  There is a good chance that we will switch back to title 2, which is not net neutrality, after President trump is gone so why would companies take the financial risk.", "score": -6, "replies": [{"body": "Google problems started before title 2, according to arstechnica.\n\nhttps://arstechnica.com/tech-policy/2017/06/30-small-isps-urge-ajit-pai-to-preserve-title-ii-and-net-neutrality-rules/", "score": 1, "replies": []}]}]}
{"title": "Getting out of BAC", "selftext": "After minimal movement in BAC the last few days, I sold all of my Jan and May 2018 calls. Who cares about fundamentals when you can go all in on meme stocks like SQ? In and out today for 6% small gains.  ", "id": "7fcihm", "created_utc": 1511579363.0, "score": 8, "upvote_ratio": 0.9, "num_comments": 15, "comments": [{"body": "Understandable. I still have some long term shares that I am sitting on. If it's good enough for Warren Buffet than it's good enough for me.", "score": 9, "replies": [{"body": "It took Buffet 10 years to become a millionaire and nearly 40 to become a billionaire. ", "score": 9, "replies": [{"body": "Too slow for me. I'll just keep trading memes on margin", "score": 12, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yeah. I'm going to have to become a billionaire at 60 so I can buy a time machine to go back and become a millionaire in my 20s.", "score": 4, "replies": []}]}]}]}, {"body": "Why the fuck would you not wait until at least next week. Looks like the tax bill actually has a chance now. ", "score": 2, "replies": [{"body": "Why would tax reform affect it? Banks are waiting for the interest rate increase.", "score": 0, "replies": [{"body": "Banks pay amongst the highest corporate taxes. ", "score": 3, "replies": []}]}]}, {"body": "I bought some bac today. It's been rock solid. I wonder what it will take to move this sucker", "score": 1, "replies": [{"body": "Today?", "score": 1, "replies": [{"body": "I posted this on Friday", "score": 1, "replies": []}]}]}, {"body": "I'll just sell calls until they get exercised.", "score": 1, "replies": []}, {"body": "should've held till the fed meeting in december. BAC and the warrants will either moon or crash depending on how the interest rate hikes go", "score": 1, "replies": []}, {"body": "Thanks bac 28 end of next week ", "score": 1, "replies": []}]}
{"title": "If the stock market starts to crash/bear run begins.", "selftext": "Would we all just throw our piles of pennies into UVXY? I can't see a plausible downside", "id": "7fg82k", "created_utc": 1511627497.0, "score": 12, "upvote_ratio": 0.67, "num_comments": 20, "comments": [{"body": "How do you expect it to play out?  You think you'll just wait until the market announces it's about to shit the bed, giving you time to load up on cheap UVXY?  Or do you have a threshold % UVXY goes up after which you will buy in hoping it goes up much more?  Or are you perfectly in tune with the pulse of the market, and you will buy when your pre-cog brain calculates the impending doom?", "score": 22, "replies": [{"body": "Bear markets can be ongoing things my dude. Buy after a few weeks and sell a few says into the change back to a bull", "score": 1, "replies": []}]}, {"body": "How do you know you're in a bear market you faggot? When SPX it's down 10% in a month, or 20% over 6 months? In 08' there were huge up days and up months right in the midst of what would end up being a 50% over the course of a year. Those huge green bounces in a bear market would kill UVXY. When oil had been going straight down hitting $26 per barrel in... 2015 I think it was and the market had dropped at least %10 from all time highs it sure looked like a bear market but no, as usual it was a buying opportunity. ", "score": 5, "replies": [{"body": "Enlightening :) thanks friendo\nNo more uvxy for me", "score": 3, "replies": []}]}, {"body": "Buy puts you turd.", "score": 11, "replies": [{"body": "Puts assume someone else is looking to buy your shit. In a crash, everyone is jumping ship. ", "score": 11, "replies": [{"body": "Selling long positions requires a buyer as does shorting (as does anything in a crash, chart wouldn’t move if no one was willing to buy).", "score": 1, "replies": [{"body": "I agree. But with regards to OP- why would someone be writing puts during a real crash ?  If you can find a put to buy then  sure, go ahead but wouldn't that be stupid to be writing them for any other reason than to collect premiums (which id think aren't worth the squeeze during a crash)? ", "score": 1, "replies": [{"body": "The same reason anyone is a buyer, they think it will turn around or not fall as much as the premium.  There’s always someone to catch a knife.", "score": 7, "replies": [{"body": "It’s usually me", "score": 10, "replies": []}]}]}, {"body": "That's the thing people forget, for every dumbass that sells when they shouldn't there's a genius that is buying their shit.", "score": 1, "replies": []}]}, {"body": "Look at the big brain in Brad, my only reason for not opting for puts is cause I'm a lowly robinhood user. Good point tho ", "score": 0, "replies": []}, {"body": "The fed will buy it. \n\nHedge fund/pensions?", "score": 0, "replies": []}]}, {"body": "Get the fuck outta WSB you wang. Your low functioning autism has no place here", "score": 2, "replies": []}]}, {"body": "Where would you get the piles of pennies? If/when the market does crash, your RH account is gonna shrink **FAST**.", "score": 2, "replies": []}, {"body": "Umm there's a huge possible downside actually, that bitch is gonna keep gong down and RS, and then it'll have a big move somewhere down the line, but you'll still be hella in the red", "score": 1, "replies": [{"body": "Uvxy makes money on the market going down.. ", "score": 1, "replies": []}]}, {"body": "No you idiot. ", "score": -2, "replies": [{"body": "Pls be nice", "score": 1, "replies": []}]}]}
