{"title": "Bullish BAC. Any reason to do both long call and vertical spread?", "selftext": "[deleted]", "id": "7f3mfs", "created_utc": 1511482247.0, "score": 13, "upvote_ratio": 0.85, "num_comments": 14, "comments": [{"body": "What are your hopes and dreams here? I’ll give you that the stock has moved up almost 20% in the last 6 months, but when that 20% is 4 bucks, I think you’ll be eating premium instead of profits on this one.\n\nIf it was me, I would not buy a bull call spread. Why not sell a bull put spread instead?", "score": 8, "replies": [{"body": "Uhh, won't the put spread and call spread have identical profit graphs", "score": 7, "replies": [{"body": "Maybe same payoff, but very different risk profile.", "score": 6, "replies": [{"body": "Can you elaborate?", "score": 5, "replies": [{"body": "Different max loss.\nDifferent probability of profit.\nBull Call spread makes money if stock goes up beyond breakeven.\nBull Put spread makes money primarily from decay while stock price stays below breakeven.", "score": 4, "replies": [{"body": "You're assuming you're different strikes and/or expirations when a bull put spread and bull call spread. Given the same expirations and strikes the positions are equivlent. ", "score": 1, "replies": []}]}]}]}, {"body": "Given the same strikes and expiration they are exactly the same due to put call parity. /u/foresttrader is implicitly assuming that you would enter the bull put spread with lower strikes than the call spread. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I personally love the bull put and bear call strategy. Stock can go up, sideways, or even down and you can still make money on the trade ", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Good deal. I was enthusiastic as fuck going into Dec for BAC but this big boy has all but stalled out and run out of steam the last 3 weeks along with most other banks. Sold my Dec long calls for a big loss and am thinking about entering a short strangle until Q4 earnings.", "score": 1, "replies": []}]}]}, {"body": "Definitely bull put spread, that way theta works in your favor and you can still make decent profits while having limited downside if something unexpected happens.", "score": 3, "replies": []}, {"body": "The risk is just soooo much less. You can do a bill put spread with an 85% POP, while buying that same call spread is only 15%. Yes, it’s less money, but more successful so you can do it more.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Ever been directionally correct and not make money? ", "score": 2, "replies": [{"body": "Yup, been right same day, naked put and 4% below breakeven(Became ITM after buying) and somehow still lost on P/L.... Expect the worst", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "heh..", "score": 2, "replies": []}]}]}]}]}
{"title": "The CPI report for October showed the first acceleration in inflation since January. With the labor market tightening, we may see more inflation in 2018. That would hurt tech stocks. What are your thoughts on tech and inflation?", "selftext": "[Why Inflation Will Increase In 2018 ](https://timemoney.com/why-inflation-will-increase-in-2018/) ", "id": "7f5bh3", "created_utc": 1511501549.0, "score": 19, "upvote_ratio": 0.91, "num_comments": 14, "comments": [{"body": "https://fred.stlouisfed.org/series/CPIAUCSL", "score": 2, "replies": [{"body": "https://fred.stlouisfed.org/graph/?g=fQM5", "score": 2, "replies": []}]}, {"body": "Inflation right now is being impacted by a few things besides interest rates and liquidity (which are relatively detached). Keep an eye on M1 and M2 money stock velocity, consumption/savings ratios (marginal propensity to consume), wage rates, and some others. People like to pretend prime rates and employment are the main driving force to inflation because they are factors we have control over, but you need to keep in mind the channels by which those factors increase inflation. \n\n[M1 velocity.](https://fred.stlouisfed.org/series/M1V)\n\n[M2 Velocity](https://fred.stlouisfed.org/series/M2V)\n\nIf money isn't moving, inflation wont rise. The M1 and M2 have been in continuous decline since 2007, and only just begun flattening this year. They have a long way to go, and this insane change in consumer behavior is going to haunt us a long time. \n\n[Wage Rates](https://www.bls.gov/oes/current/oes_nat.htm)\n\nThe jobs market needs to heat up further to push the wage increases we need. Income increases have happened at the top, wage increases have happened at the bottom, but overall wages have not seen much growth for a majority of Americans. No wage growth and cautious spending means low inflation, no matter how expensive money is to borrow. \n\nThis is my personal opinion, so take it with a grain of salt. ", "score": 2, "replies": [{"body": "Can you clarify a few of your opinions for me? I broke your post apart so I could ask more direct questions:\n\n> Inflation right now is being impacted by a few things besides interest rates and liquidity (which are relatively detached).... If money isn't moving, inflation wont rise.\n\nWouldn't lower interest rates (theoretically) cause money to start moving as people are more apt to borrow and spend? I would think interest rates would and velocity would be highly correlated if money supply remains constant (which it hasn't in recent years, I know). Also, isn't liquidity (in the economy as a whole, not any particular asset class) virtually synonymous with velocity?\n\n>Keep an eye on M1 and M2 money stock velocity, consumption/savings ratios (marginal propensity to consume), wage rates, and some others. People like to pretend prime rates and employment are the main driving force to inflation because they are factors we have control over, but you need to keep in mind the channels by which those factors increase inflation.\n> M1 velocity.\n> M2 Velocity\n>  The M1 and M2 have been in continuous decline since 2007, and only just begun flattening this year. They have a long way to go, and this insane change in consumer behavior is going to haunt us a long time.\n\nNo doubt velocity has gone down, but if you overlay the growth in [M1](https://fred.stlouisfed.org/graph/?g=fR56) and [M2](https://fred.stlouisfed.org/graph/?g=fR5b) (the supply of money), you can see it's been made artificially much worse than it would have been without Fed intervention over the last decade. Since velocity of [M1/M2] = GDP/supply of [M1/M2], dramatically increasing the stock was going to reduce velocity anyway. Therefore we do have *some* control of velocity, the Fed just ended up sacrificing velocity long term by preventing a further collapse in the short-term (nor arguing which one is better here, merely an observation).\n\n> Wage Rates\n> The jobs market needs to heat up further to push the wage increases we need. Income increases have happened at the top, wage increases have happened at the bottom, but overall wages have not seen much growth for a majority of Americans. No wage growth and cautious spending means low inflation, no matter how expensive money is to borrow.\n\nThis bit is really hard to argue on either side. If we look at velocity like you did above, it does look like spending is cautious. But if you look at some other metrics, like [loan debt](https://fred.stlouisfed.org/graph/?g=fR5x) (credit card, auto loans, mortgages, etc), spending has increased. Conversly, supporting your point: the *rate* at which spending has increased since the recession is [anemic compared to years past](https://fred.stlouisfed.org/graph/?g=fR5z).\n\n> This is my personal opinion, so take it with a grain of salt.\n\nSamesies.", "score": 1, "replies": [{"body": "We are in an environment now where the amount of lending (liquidity) is highly detached from interest rates. This was an issue throughout QE as concerns of a \"zero lower bound\" increased. We hit the lower bound, lending did not increase during the recovery, and the argument was that regardless of interest rates the prime lending rate would only go so low. Ancient history. What we saw was that banks past a certain point (well before the overnight rate was zero) simply did not lend more, regardless of changes on the demand side, and that trend really hasn't changed. \n\nSo banks are lending less, despite low interest rates. It is a lender's market, not a borrower's market, and the lenders don't want to lend. Similarly people's spending behavior has been incredibly cautious since 2007. People are tending to sit on less household debt, [which took a massive drop in 2009 and has not really begun increasing. They are just less leveraged.](https://www.nerdwallet.com/blog/average-credit-card-debt-household/)\n\nYou are correct. Lower interest rates would theoretically cause more inflation. That said it is not the interest rate itself that drives inflation, but the lending and borrowing behavior driven by interest rates. Those behaviors have simply not increased substantially, hence the detachment between fed funds rate changes and lending/borrowing. It is a change of behavior on both sides. Household debt is down, demand for business loans is up, but the banks seem to be unwilling to significantly increase loans. \n\nFor that reason I do not believe these incremental interest rate boosts will have much impact on inflation either way. The channel by which those things are correlated is broken due to behavioral changes on the low side of interest rates. \n\nI would also argue money supply in circulation has been fairly constant. Money was being printed by the Fed, sure, and they will start to re-absorb those funds, but that money never hit circulation. It may be listed in M1 and M2, but that does not mean it is impacting average wallets. Most of those excess reserves are held in government debt, or utilized in forex markets, but never hitting private individuals. This goes to your point about overlaying money supply and M1/M2 velocity. You are correct, a large amount of that is going to be bank money holed up and not moving, driving down the velocity without really reflecting human behavior. That said the velocity drop was dis-proportionally large compared to increased money stocks, and continued to drop after the QE3 taper ended. That is a full 15% drop in the M1 velocity after Q3 of 2014. \n\nThe loan debt link your provided was inaccurate as it included nonprofits. I honestly couldn't tell you why nonprofit debt levels have gone up so much. [That said household debt to GDP has been down or flat for almost a decade now.](https://fred.stlouisfed.org/series/HDTGPDUSQ163N), so I would dispute the claim loan debt has increased substantially for households. \n\nOn wage rates (this is where the opinion factory trying to explain this strange behavior starts churning), my opinion is that the reason household debt/gdp is low, and part of the reason inflation hasn't spike (besides bank lending behavior) is that without wage growth people have been incredibly cautious with their spending compared to the early 2000s. That consumerism spark is just not catching. Attitudes have changed, people are acting a bit more conservative, and corporate profits have been spiking while wages growth is sluggish. People who see future income are more willing to spend in the present, and people's spending tends to grow into higher wages and salaries. Even though the economy has been doing well that hasn't necessarily hit the employee, because year to year the same job is making only a bit more. Those rates of profit compared to wages are killing people's animal spirits. ", "score": 1, "replies": [{"body": "Awesome response, thank you. I have a few follow up comments.\n\nFirst, I agree with your notion that people are cautious about spending, but I would modify that a bit and say they're cautious *relative to pre-2008*, as opposed to 2000, as you mentioned towards the end of your reply. The reason I say this is because the rate of growth in debt for households is less than it has been [pre-2008](https://fred.stlouisfed.org/graph/?g=fR5A) (same chart as mentioned in my previous comment).\n\nAs for the household/non-profit chart you mentioned, I'm not sure why non-profits are coupled in with households, but it doesn't make a huge difference in this case. I modified the chart you linked to convert Debt/GDP to nominal debt instead of a ratio and compared with the household + non-profit debt chart I originally linked and you can see it's essentially the [same curve](https://fred.stlouisfed.org/graph/?g=fRhq). Regardless, when you normalize it with GDP, in my opinion, you're no longer seeing whether or not people are borrowing. For example, if for whatever reason, we have a massive manufacturing and exporting boom that increases GDP but people are simultaneously borrowing more, the debt/GDP ratio will look flat as both the numerator and denominator rise together. However, since the numerator is what is controlling inflation (which I think we agree on), you could have flat debt/GDP *with* inflation. Is there a hole in my thought process somewhere or does that seem like it makes sense?\n\nFinally, M1/M2 and velocity. So I agree that the Fed monetization didn't make it directly into circulation for the most part, which is why there is a huge financial asset bubble. However, I'm looking at [this](https://2.bp.blogspot.com/-Oj0EwCfRCfA/TXIjVVOMfXI/AAAAAAAAABc/DJ9htvRR8wI/s1600/Money%2BSupply%2Bmeasures.jpg) chart to see what is included in each measure of broad money, and M1, at least, is all liquid cash that I would consider your wallet. Gov't debt and FX would fall under money market through brokerage firms right? That being the case, it doesn't get accounted for until M2. \n\nThis next part is really iffy because I think I'm just making a narrative based on data, but it does make logical sense to me. When QE occurred, two things (mostly) were bought, MBS from the private sector, and government debt from the public sector. The MBS that the Fed bought wouldn't have changed M1 because they were swapping an asset that was already used as part of capital reserve requirements by banks for cold hard cash, so it wouldn't effect M1 or their lending capabilities. The government debt they bought *was* impacting M1 since the government had new money that it *was* going to spend. So if you subtract out the MBS from total Fed assets, you should be left with what is mostly gov't debt, which should move in tandem with M1. Does it [look like I'm just overfitting the data](https://fred.stlouisfed.org/graph/?g=fRhK) to match what I think makes sense? I imagine the shape of the curve is because of the way the money flows. The Fed bought debt in lump amounts over several increments, whereas government spending is consistent throughout which means M1 grows consistently as opposed to incrementally.", "score": 1, "replies": []}]}]}, {"body": "Wish we had access to M3 data. ¯\\_(ツ)_/¯ ", "score": 1, "replies": [{"body": "lol tru", "score": 1, "replies": []}]}]}, {"body": "Inflation has been creeping up slowly, but still in check,  Tech won't be affected by it.  So many advancements in everything from AI to chip structure to self driving cars that the sector should do very well - although there may ba a shake out of the weaker stocks either being gobbled up by larger tech or go by the wayside", "score": 1, "replies": []}, {"body": "Inflation is supposed to hurt tech stocks because: it means the value of the dollar goes down so consumers spend less $ on discretionary items (like technology).\n\nHowever, tax reform may offset that if passed through because their book will see a net increase in value.\n\nAlso, rates are rising simultaneously to offset the effects of inflation \n\nAlso, the tech space primarily moves on speculation rather than fundamentals so: as long as we keep seeing new Tesla’s, iPhones and Patents from amazon - inflation won’t matter.\n\nJust my 2 cents", "score": 1, "replies": []}, {"body": "Huh. There are 10 years worth of new US investors who aren’t used to inflation existing as a normal part of the economy. ", "score": 1, "replies": [{"body": "And who think that markets always go up. ", "score": 1, "replies": []}]}, {"body": "The October CPI number was fairly benign at just 2.0%\n\nEventually, however, the US economy is going to start overheating and inflation will rise.\n\nAs every Central Bank has done since 1980, they will then force short-term interest rates up in order to slow the economy and tame inflation again.\n\nThis has often resulted in a recession.  The Central Banks will accept a recession rather than facing a 3.5% inflation rate which then accelerates upwards on its own and is impossible to stop without causing an even bigger recession..  \n\nThe Yield Curve has been slowly flattening due to this and when short-term interest rates get as high as long-term interest rates, you know that a recession is about to start.\n\nYou should have moved your money into bonds well before it gets to this point.", "score": 1, "replies": [{"body": "These are all great points. Thanks.", "score": 1, "replies": []}]}]}
{"title": "Beginner Stock Advice", "selftext": "[deleted]", "id": "7f4ov7", "created_utc": 1511494229.0, "score": 10, "upvote_ratio": 0.83, "num_comments": 11, "comments": [{"body": "[deleted]", "score": 5, "replies": [{"body": "> As a beginner you'd be better off with an ETF and continuing to add more when you can, while you learn more about the markets.\n\nThis is the best advice. OP can get ETF info at r/personalfinance and continue learning using [this sub's wiki](https://www.reddit.com/r/stocks/wiki/index) and [book recs](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_posts_.26amp.3B_book_recommendations). Eventually move from ETFs to stocks if the desire is there.", "score": 1, "replies": []}]}, {"body": "First of all, what's your definition of long term?\n\nIf you are talking upwards of 10 years I would take a peak at Amazon, Visa, Adobe, PayPal, and some more stocks with solid dividends. \n\nFor 1-2 years, cloud services, semi conductor companies, possibly clean energy, AI companies, and some other innovative stocks like Micron, Intel, Nutanix(I personally like this one, could go either way), and Alibaba(made a big run already so maybe) just to name a few. For clean energy I like Sunrun, but that's simply my opinion. \n\nAs for my take on Intel, I like it a lot. It's chips are killer and squashes my admiration for the Ryzen line(exaggerating a bit). There is no doubt it will remain top dog for a long time and would be a great buy.\n\nOn the other hand, I don't completely like AMD, as hinted above. But, that's not to say it won't do good as it definitely has potential. \n\nIf I had to give my overall recommendations for some stocks, I would suggest PayPal, Amazon, Micron, Intel, Sunrun, Tesla(down the road, once even semi cash flow positive), GM, and Nividia(if it dips a bit). These are just from the top of my head, but I would overall look at companies in some sectors listed above. \n\nAlso, I strongly suggest investing in individual stocks as of now(as you planned). You have to take some risk if you want to grow your portfolio, but that's not to say bet blindly on penny stocks. ETFs and funds are not the best investment for you at your stage.\n\nBut of course, these are just my opinions and I am no way a credible source, just someone on the internet trying to help out a bit. Good luck, and if you want anymore of my opinions, give me a shout!\n\n\nEDIT: Added a segment.", "score": 5, "replies": []}, {"body": "Hey man, TD bank is a solid stock always, but for your amount of capital you might want to go towards a stock with more growth! This channel here offers some great stock buy ideas! In this video there is a really good value play! https://www.youtube.com/watch?v=i7EofoHfSKw", "score": 3, "replies": []}, {"body": "Shopify is a possibility to hold. They are investing in job im ottawa and have a good market share. The only downside is they currently arent making any profits, but have a good product that gives a continuous flow of cash(subscription based). \n\nWatch for dips to buy if you do this stock or any tech stock. \nAll tech stocks are unstable from 5-15% depnding. ", "score": 2, "replies": []}, {"body": "My advice is for long term investments really do your research because if you put in that work, you wont have to be worrying everyday whether it was a right decision. \n\nSecond, personally i like amd and what they are doing. Their potential is questionable but they are making their way up there slowly. Look into their line up and what their plans are. I havent really looked too much into intel as i am an amd kinda guy\n\n", "score": 1, "replies": []}, {"body": "In terms of AMD and Intel, I wouldn't put your money on AMD unless you really wanna go for the long run; they lack focus on important areas of research in chips and it will take them time to move in the right direction and catch up with their competition. Intel has a lot of potential and is always ahead of the game in terms of the technology they put their research into which will show for in their value. I would do more research into tech stocks though. There's a lot of companies that have huge potential.", "score": 1, "replies": []}, {"body": "Read a book about it first and get a least a basic understand of what you are doing.  Try: You Have More Than You Think by David & Tom Gardner.   I found my copy at a garage sale, got a yellow marker, read and underlined things, and it was invaluable.  ", "score": 1, "replies": []}, {"body": "Personally, I don't think you can do too much with $1000 dollars. The stock market is a rich mans game. That's just the truth of it- more capital equals more leverage. Probably $3000 or $5000 would be more appropriate. BUT! I'm not a pessimist, so if you're still learning and just want to get your feet wet, then to me, those stocks you mentioned should be good starts. \n\nHowever, if you really want to grow your portfolio by going long, then you need to find some growth stocks. Consider MU and SQ. Sure they've had a massive run so far this year, charts are starting to look a little scary and stretched. Despite this, they continue higher and there is a lot of bullish sentiment around them. If you're a risk taker then perhaps go for it. Just make sure you have a stop in place. ALWAYS NEED A STOP! Plus your investment amount is really small so your risk exposure is in all honesty, is very small.\n \nAnyway, follow the hot sectors, like tech and what someone else said below, semiconductors. Just be conscientious, semis are at the level of the dotcom bubble. Look at the SOX monthly chart for reference. I don't think there is a reversal any time soon, but if there is to be one, you better grab your money and go! You can't say I didn't warn ya lol \n\nAs a disclaimer: These are also just purely my opinions. This is not to be misconstrued as any advice or tips for your own investment. After all, I too am only just a random person on the internet. I will not be held liable for YOUR decisions and actions. Good luck to you ", "score": 1, "replies": [{"body": "question.\n\nlet's say i invested 10k in Square stock at 10 a share, and now its at 50, and i sell it, what are my tax liabilities if i cash out or take the money and reinvest somewhere else within my portfolio?.", "score": 1, "replies": [{"body": "If you bought at 10 dollars a share, which it was selling for a year ago, you definitely fall under the long term capital gains tax. Your profit is 40,000 dollars for a total return of 50,000 dollars because of the initial 10k invested. So on that alone, you should fall under the 25-35% tax bracket, plus your long term capital gains tax liability will adjust with it, and allow you to retain more of that income.\n\nHere's a link to help you do the math:\n\nhttps://www.investopedia.com/articles/personal-finance/101515/comparing-longterm-vs-shortterm-capital-gain-tax-rates.asp\n\nIf you took that investment- MAD PROPS! I'm looking for that 50 price target next week! It has the steam. I want it to run even higher!!! Has a lot of buyers just sitting on the sidelines just waiting for the next dip to hop in or add to their positions!\n\nEDIT: Had to adjust this twice. Drinking and numbers don'r mix too well lol What can I say, it's the holidays! Sorry for the inconvenience", "score": 1, "replies": [{"body": "Even if you cash out and invest elsewhere, it still doesn't matter. You're still gonna have to take a little off the top to pay those dreaded taxes :( lol", "score": 1, "replies": []}]}]}]}]}
{"title": "Yay or nay", "selftext": "50 shares of NVDA and ANOTHE 50 TSLA  ?", "id": "7fal6q", "created_utc": 1511559669.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 11, "comments": [{"body": "👎🏿 \n\nNVDA will most likely be ok though I like MU more.  TSLA is borderline fraudulent", "score": 9, "replies": [{"body": "fraudulent in what sense?", "score": -3, "replies": [{"body": "They lie/mislead/omit/delay critical information.  E.g. experts are coming out and saying their truck numbers are bullshit.", "score": 5, "replies": []}]}]}, {"body": "Yay ", "score": 3, "replies": [{"body": "Good, cause I just did. Would you hold on to them for long?", "score": -3, "replies": [{"body": "TSLA yes, it’s a very long term play \n\nNVDA not entirely sure about the next earnings but I think you will see a run up until the next ER being a market leader in AI, there will be a lot of anticipation for a good quarter ", "score": 0, "replies": [{"body": "VERY long term play. I'm going to play the swing on tesla. Bought at 299, going to try to sell at 330-350 and then sell before it crashes down to mid 200's. ", "score": 0, "replies": []}]}]}]}, {"body": "Nay TSLA", "score": 1, "replies": []}, {"body": "Clear inverse WSB. Go TSLA.", "score": 1, "replies": [{"body": "So you are saying I should do the opposite of the advice I get here?", "score": 1, "replies": []}]}]}
