{"title": "Tesla Cybertruck: Best-Selling Vehicle In U.S. With Price Tag Over $100,000", "selftext": "", "id": "1ez32y9", "created_utc": 1724384579.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 75, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 62 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/unjcq3/dd_short_edr_based_on_disney_results/) \n**Account Age** | 13 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "It’s insane that people are willing to pay for such a giant piece of shit.", "score": 66, "replies": [{"body": "Tesla is the Ikea of cars, except Ikea is not overpriced.", "score": 20, "replies": [{"body": "IKEA is actually well designed well thought out and build to last though.", "score": 14, "replies": [{"body": "I sense a lot of optimism in this comment.", "score": 16, "replies": []}, {"body": "Built to last…through the first year of college", "score": 14, "replies": [{"body": "I’m buying from Ikea in Europe maybe the stuff the sell in the US is shite, I don’t know.", "score": 2, "replies": [{"body": "Their are definitely different tiers of quality from ikea. The cheap dresser I got is falling apart, but the more expensive kitchen table I got is still in great condition after a few years.", "score": 3, "replies": []}]}]}, {"body": "Yes they've designed those meatballs in the food court masterfully, very well thought out and built to fill my stomach", "score": 5, "replies": []}, {"body": "Someone just got sold an entire room set. You pulled the wrong ticket bro lol", "score": 3, "replies": [{"body": "Ah no, weird comment. I have bought stuff from them before and it’s been good. But again I’m in Europe so it’s actually probably got solid regulations and safe build quality.", "score": 1, "replies": [{"body": "To follow up my comment ... I have some Ikea stuff that I like.  Shelves, storage, linens.  That stuff is fine, and pretty good quality for what you pay.  It's strong enough for its purpose, but it may not tolerate abuse.  So it's a level above the stuff you buy in flat packs at Walmart or Target.  But more expensive items like tables and sofas ... I don't trust as much.\n\nIn any case, I doubt that my descendants will be keeping much of this stuff.  Whereas the solid wood furniture I dumpster-dived and cleaned up will be good to go for generations to come.\n\nIn context - we're talking about a $100k truck here.  In the upper price range, the expectations for trucks and furniture are more stringent.", "score": 2, "replies": []}, {"body": "No dude its the same shit everywhere lol this is a cope", "score": 1, "replies": [{"body": "So your bought in both?", "score": 0, "replies": [{"body": "Yes", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Hummers did well for a while too. It’s not that insane lol", "score": 2, "replies": []}]}, {"body": "Best selling? That's straight non sense lmao.", "score": 14, "replies": [{"body": "It's obviously not. What $100k+ car got more sales?", "score": -11, "replies": [{"body": "A) The numbers are more than likely skewed, only the most expensive version is over 100k. I can believe they sold a high number, but not as high as they are saying. At least not all of them were 100k models. \nB) There are dozens of cars over 100k. But again, how do we define which ones to count? Do you include base model sales for those versions(that are ultimately under 100k) in that statistic or just the ones being sold for over 100k?  It seems like they're just using an average here for that number which obviously limits the number of cars to compare it against, because the average base model price for most cars isn't 61000. \nC) Tesla doesn't tell us their actual numbers, the closest you can is by looking to see how many cybertrucks were registered.\n\nD) Honestly I misread it initially, but I'm still claiming bullshit. Show me the sales for ONLY the models priced above 100k and I'll believe it.", "score": 5, "replies": [{"body": "> Show me the sales for ONLY the models priced above $100k and I’ll believe it.\n\nThe only cybertrucks Tesla has delivered thus far are models over $100k. Cheaper variants are coming in mid 2025.", "score": 4, "replies": [{"body": "Which were available for pre-order for a while for a cheaper price if I recall correctly. Not sure if they've caught up to all those with how much they claimed they got pre orders for.\nAlso one is available for 94k on their website (I'm guessing taxes will knock that up though)\nThis would only further prove my point that the data could easily be skewed if they (KGB I believe are the ones who said it) are basing it on average price, it significantly limit what other vehicles would fit in the 100k+ category due to base variants being cheaper. What other vehicles did they compare this too really, or is it basically in it's own class due to that pricing? \n \nIt's crazy, the technology built in is the future for automobiles and it's getting there but it just isn't there yet and with that pricing, these numbers are most likely a temporary fad. It's not sustainable at that price.", "score": 1, "replies": []}]}]}]}]}, {"body": "\nOh wow a just released car that required you to pay for reservations is now filling reservation and has suddenly become the best selling car among cars that cost over 100k. \n\nWho would’ve guessed it? Everyone. That’s who. \n\nCome back in 6 months when the used car market is flooded with these hideous toasters selling for half the price of a Prius", "score": 75, "replies": [{"body": "I mean the F-150 lightning was the exact same schtick with a $100 deposit and half a million reservations… the demand immediately dried up for them when they were released and it came time to actually pay. Like they literally cut down production lines, started offering cheaper models, and Tesla is still already outselling them just with their $100k model. \n\nGo back through these sub posts and everyone was saying the exact opposite of you. That the cybertruck reservations were a joke and no one was actually going to go through with it.", "score": 10, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}, {"body": "Drop like a rock next year.![gif](emote|free_emotes_pack|joy)", "score": 2, "replies": []}, {"body": "Wanna put an account bet on that?", "score": -24, "replies": [{"body": "I will. 1 month ban. Mods, sign me up. Used cybertruck for sale for 27,108 usd. Me vs u/gtbifmoney all we need is one for sale and purchased as proof. !remindme 6 months", "score": 23, "replies": [{"body": "Lol what the fuck?  Did you just agree to a bet and then change the parameters?  😂 You can’t say “when the used car market is **flooded** with these” and then get challenged on it, accept the bet, and then say “I only need 1 to be right” lol", "score": 2, "replies": []}, {"body": "Regardless, you can go ahead and accept the ban now.  Tesla will not allow anyone to sell for less than retail for 1 year past.  They said they’d sue, but took that language out, but rather they will just buy it back themselves instead.  It’s in the buyers contract.  So there’s zero scenario you win on this, because you didn’t do any research.", "score": 2, "replies": [{"body": ">they said they’d sue, but took that language out.\n\nSounds like they don’t change their mind.", "score": 2, "replies": []}]}, {"body": "I will be messaging you in 6 months on [**2025-02-23 05:03:13 UTC**](http://www.wolframalpha.com/input/?i=2025-02-23%2005:03:13%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1ez32y9/tesla_cybertruck_bestselling_vehicle_in_us_with/lji018q/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1ez32y9%2Ftesla_cybertruck_bestselling_vehicle_in_us_with%2Flji018q%2F%5D%0A%0ARemindMe%21%202025-02-23%2005%3A03%3A13%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201ez32y9)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "I’ll take that bet. You end up w 2 months. One car is not the market flooded. But I’ll indulge you. 27.1k, no wrecks, no salvage, no moronic influencers. 27.1k straight up", "score": -4, "replies": []}]}]}]}, {"body": "For a whole month just after launch, whoopee!", "score": 10, "replies": []}, {"body": "Get outta here with those refrigerators! Besides every Cybertruck sold was recalled so.....", "score": 14, "replies": []}, {"body": "Wankpanzer strikes again", "score": 6, "replies": [{"body": "I don't know what this means, but it sounds about right.", "score": 1, "replies": []}]}, {"body": "unfortunately there's a limited supply of rich idiots who will buy this \"truck\" and most have already placed their orders. If they could somehow tap into the poor idiot market they'd be set for exponential growth, but that won't happen while the cost is too high.", "score": 7, "replies": [{"body": "Honestly though, how much better do you feel when you compare yourself to these idiots?", "score": 1, "replies": [{"body": "pretty good, actually. thanks for asking.", "score": 1, "replies": [{"body": "How much pretty good?", "score": 1, "replies": []}]}]}]}, {"body": "The photo looks like the Mythbusters episode where they raged an F-150 equipped with fabricated square wheels.\n\n\nBest Selling Vehicle (anywhere) seems like someone is taking journalistic liberties", "score": 5, "replies": []}, {"body": "Just saw ODG get their cyberbeast after a 3yr waiting period. Silly stat.", "score": 3, "replies": []}, {"body": "Remember: most people buy vehicle *before* they actually drive their daily commutes.", "score": 4, "replies": []}, {"body": "Hummer EV blows this away.", "score": 4, "replies": [{"body": "I saw one doing the crab walk through a Home Depot parking lot. Hummer ev is a bad ass vehicle. Couldn’t believe how it was turning lol hard to believe it when your see it. Huge, and looks great", "score": 7, "replies": []}, {"body": "Hummer EV the pinnacle of efficiency. So efficient that you would need a truck license to drive it in Europe.", "score": 3, "replies": [{"body": "It actually functions runs and maneuvers like an awesome off road vehicle. Cybertruck just a falling apart piece of crap.", "score": 2, "replies": [{"body": "It better be since you can buy a Ferrari or 2 cybertrucks for the same price.", "score": 0, "replies": [{"body": "I can go get one right now brand new for $89000 USA. Tell me where you are buying a cyber truck or a Ferrari in that range.", "score": 0, "replies": [{"body": "They were 200k at release. If thats their current price you can safely buy puts on GM. Its free money. Still you can buy the shittiest Ferrari ever for that money, the Mondial. 😆", "score": 0, "replies": [{"body": "They had many that the dealers were putting 35K on top of purchase price when they first came out especially in high net worth areas. We shopped and test drive several. Awesome vehicle but more than we need in suburbia. Now range without dealer prep fee about 89 to 129K depending on model. SUV more tricked out than truck but truck is actually a truck. Still 7500 tax credit and no sales tax. Tesla no longer eligible for tax credit.", "score": 2, "replies": [{"body": "Im not American. Here in Europe we don't even have the Cybertruck, its so big im not sure it would sell here. I do own a tesla model S and im quite happy with it. \n\nAlso the hummer is supposed to have a 200kwh battery which is problematic to charge at home since its humongous. \n\nStill don't forget that the Cybertruck is bulletproof, might come in handy when the economy collapses or during WW3.", "score": 0, "replies": [{"body": "Teslas of any kind seem to have trouble with service and repair according to the many reviews I’ve seen. Cyber truck reviews show it falling apart in various ways with normal use. Would prefer GMC as much more reliable service network.  We had a Mach E mustang that was awesome. Fastest car I ever drove. Waiting another year or two for better infrastructure and range. Was also reading they are make a sodium ion battery that will blow lithium battery away.", "score": 1, "replies": [{"body": "I had only one issue with my Tesla and i set up an appointment online, went to the service center that identified the issue, got informed on how much it would cost i said yes, things got fixed fast and without any additional fees. \n\nAlso here in Europe Tesla comes to you if you set up an appointment if you need to install or fix something simple. \n\nIn terms of speed, acceleration and pure efficiency Tesla is not just better than the competition, it blows everyone away. \n\nThen in terms of pricing Teslas are cheaper than the competition and the car has basically everything already included, i don't have to pay extra for parking sensors, cameras, leather seats and multiple safety features. You pick color and rims, thats it. \n\nThe fact that i can raise or lower the suspension in my car didn't even feel real until i used it, thats usually reserved to exotic cars. \n\nThe biggest issue with the car are the brakes really, i feel like they could be way bigger, the car can break fine for normal driving but for a more spirited driving i simply wish the brakes were bigger. \n\nThats part of the reason i don't trust the hummer EV, i don't see how someone can safely use a 4 ton truck with supercar acceleration on regular roads.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I hate these, absolutely despise them.\n\nBut a person I know owns two and says they’re by far his favorite vehicles he’s owned and he’s owned some really cool cars/trucks. Idk, I’ve seen the finger prints and that alone makes me hate the cybertruck to the point where I’d consider a Honda ridgeline before I considered a CT.", "score": 6, "replies": [{"body": "There's definitely a certain niche of people that really like them.  I know someone who has one, and he thinks it's great.  I don't like it, but I don't want to rain on his parade.  I'll be a little bit mean about it online, though.  :)", "score": 3, "replies": []}, {"body": "Can’t leave fingerprints on a ridgeline. Do criminals know this?", "score": 2, "replies": [{"body": "Lmao you can but it doesn’t look like a refrigerator in the back room of a brothel all full of smudges from body oils and other uh contaminants that are on people’s hands. The first CT I saw in the wild was full of smudges and fingerprints that I could see from inside my truck and 2 lanes over.", "score": 1, "replies": []}]}]}, {"body": "I cant wait to see all the loss porn from TSLA short sellers", "score": 2, "replies": []}, {"body": "the people on /r/cyberstuck seething like crazy over this lol", "score": 1, "replies": []}, {"body": "I think I just came to a conclusion that most of the ugly on this vehicle has to do with the concave rear. If it was squared off like an Suv, it would look decent, and not like half a sandwich", "score": 2, "replies": [{"body": "Some people prefer strippers with bruises.       \n       \nMost of us disagree, but we don't kink shame.   \n     \nYou do you, mate.", "score": 0, "replies": []}]}, {"body": "People are genuinely stupid", "score": 1, "replies": []}, {"body": "Weighs more than a truck, costs more than a truck, and can’t be used as a truck.  They look neat though. Definitely a collectors item once they stop production.", "score": 1, "replies": []}, {"body": "Starting to see these now in normal towns …definitely a head turner. In real life they are massive and pretty cool if that is what floats your boat.Noticed the flat panel design is more common now in the newer Kia Hyundai models.", "score": 1, "replies": []}, {"body": "More like purchase with most buyer's remorse.", "score": 1, "replies": []}, {"body": "Thing literally looks like a dumpster. Then again, Crocs became popular also", "score": 1, "replies": []}, {"body": "If Chinese electric cars flood the market, then TSLA is going to 69.", "score": -1, "replies": []}, {"body": "[removed]", "score": -7, "replies": [{"body": "This car would be ugly even if I was blind", "score": 3, "replies": []}]}]}
{"title": "The next recession is about to be biblical ", "selftext": "No major increase in unemployment over the last 70 years has gone without a recession.\n\nGet your puts ready boys and girl. ", "id": "1ezk1st", "created_utc": 1724437685.0, "score": 0, "upvote_ratio": 0.41, "num_comments": 74, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 11 | **Previous Best DD** | \n**Account Age** | 5 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "There are no recessions in the Bible, for the record", "score": 115, "replies": [{"body": "I bet that Noah had calls on cruises and ships.", "score": 44, "replies": [{"body": "Why do we blame politicians for insider trading but not priests", "score": 8, "replies": []}, {"body": "Everyone laughed but he kept investing in his boat.", "score": 6, "replies": []}]}, {"body": "You don't remember the Book of Diamond? 4:20\n\n \"And we fucketh up the borrowing, and we fucketh up the lending. But then, the almighty Fed came. And he said unto me \n\n'Bless you, regarded institutional trader, for your sins are not your own, the the plebs will carry your burden.'\n\n\" And then the almighty fed raineth down piles of money. And the money fell upon us. And we bought expensive dinners and yachts. And the plebs prospered not. \n\n\"And it was good.\"", "score": 28, "replies": []}, {"body": "Reason why this number keeps going up is because more people join the workforce every generation. So lets say workforce in 1990 is 100 people and workforce in 2000 is 200 people. Laying off 10% will result 10 people in 1990 and 20 people in 2000.\n\nSo effectively looks bad when you scrunch the graph like you did. If you start narrowing the date window, it wont look as bad.", "score": 2, "replies": []}, {"body": "Idk apparently cain had puts on able 🫠", "score": 2, "replies": []}, {"body": "I doubt a plague of locusts helped any bottom lines", "score": -11, "replies": [{"body": "Unless...calls on FMC?", "score": 3, "replies": []}, {"body": "my grain future puts printed", "score": 1, "replies": []}, {"body": "printed money on my SMG calls", "score": 0, "replies": []}]}]}, {"body": "This chart does not show percentages though. My critical thinking tells me that as the US population grows, so will the “number” of people for unemployment. What is the percentage though?", "score": 54, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "2007 was made Infinitely worse by the housing crisis and default on loans, but it still would’ve happened to some capacity.", "score": -21, "replies": [{"body": "The fuck it would.", "score": 7, "replies": []}]}]}, {"body": "Yeah if youre comparing even 2008, the absolute number is lower than 2007-8 time so,,,,,", "score": 2, "replies": []}, {"body": "My exact thinking, number of people doesn't matter, what matters is a percentage", "score": 2, "replies": []}, {"body": "Doesn’t matter. Ppl find it better to live off govt ebt than to work.", "score": -1, "replies": [{"body": "Literally 12% of the population are on EBT. Please, turn off Newsmax or whatever and go clock in.", "score": 1, "replies": []}]}, {"body": "Then it would be a gradual uptick which there definitely has been but a million person jump in unemployment in the last year doesn’t follow a trend of a higher population.", "score": -13, "replies": [{"body": "Kid, I'm on your side, but use rates instead of absolute numbers.", "score": 6, "replies": [{"body": "https://preview.redd.it/r5ltuyp0pgkd1.png?width=1170&format=png&auto=webp&s=9228649d7544d23e1b8da8706a25839860531c4a\n\nI was switching between and ended up using total, but rates tell the same story", "score": -4, "replies": [{"body": "Not exactly. See how absolute numbers have reached a plateau, and rates have descended. Both peaking in the 70' or around. \n\nWhat could have modified that?\n\nStill, I believe you're right with the biblical thing.", "score": 2, "replies": [{"body": "When do you think it will hit then", "score": 1, "replies": [{"body": "I don't know.\n\nTaking a guess, I have some reasons:\n\nSeptember: first rate cut.\n\nOctober: bad earnings/guidance because of max profit but declining revenue\n\nNovember: before the election. If Kamala starts looking like a threat; corporations will layoff millions and rich dudes start cashing out of the market, crashing it. Then blame it on the Dems.\n\n*Disclaimer: I got sodomized shorting the market and longing the VIX during 2023. So I'm a fucking regard.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Doomers gonna doom.", "score": 40, "replies": [{"body": "OP didnt even get his doom right. So apparently anytime the unemployment rate goes up 1% in a 12 month period a recession always follows. \n\nWhat he doesn’t understand is that we have a money printer that goes burr and a stock market that doesn’t care about unemployment.", "score": 7, "replies": [{"body": "We’ve had the fed since the 1910s it didn’t exactly save us from the Great Depression or recession. It’s not about unemployment, it’s about what follows.", "score": -4, "replies": [{"body": "The fed today does a lot more than the fed 100 years ago. Today they aren't scared to take action to stop hard times, instead of watching and letting it go to shit", "score": 10, "replies": []}, {"body": "I think what others are trying to say is “money printer go brrrrr”. Using an if-then stance, we can reasonably deduce that if money printer, in fact, do go brrrr, then a recession or economic downturn is highly unlikely\n\n\n\n\n\nNFA", "score": 3, "replies": []}]}]}]}, {"body": "Buy puts on first born sons?", "score": 12, "replies": [{"body": "So let it be written, so let it be done.", "score": 2, "replies": []}]}, {"body": "Did you know that the entire stock market pauses if you don’t look at it?", "score": 8, "replies": []}, {"body": "https://preview.redd.it/sbum8ariogkd1.png?width=1320&format=png&auto=webp&s=f490ad8e075af73dc6f0e7d7ecd6ce984b14134c\n\nBetter chart, the rate over the last 75 years. The overall increase if .9% might seem trivial but it really isn't. Notice that recession usually set in while the overall unemployment rate was still far from it's eventual peak. The growth rate of unemployment (second derivative) is the more important factor to look at. Looks to me like we are right at the inflection point.\n\nCalls on plagues, puts on your portfolio.", "score": 15, "replies": [{"body": "Yes I just replied with that, it’s just concerning that not once in almost 70 years has a 1% increase not eventually resulted in continued unemployment and total recession in.", "score": -1, "replies": []}]}, {"body": "were a lot of people unemployed in bible times?", "score": 13, "replies": [{"body": "0% unemployment, 100% unpaid", "score": 7, "replies": [{"body": "Primarily in Egypt and Babylon", "score": 2, "replies": []}]}, {"body": "3000 years of beautiful tradition, from Moses to Sandy Koufax", "score": 1, "replies": []}]}, {"body": "No recession regard.  It’s been cancelled", "score": 13, "replies": []}, {"body": " let me know.", "score": 6, "replies": []}, {"body": "🌈🐻s constantly trying to wishcast a recession to justify the ol “why is everyone making money but meeeee reeeeeeee”", "score": 8, "replies": [{"body": "I don’t want a recession though, I just wanted to put a chart that I thought was interesting out there", "score": 0, "replies": []}]}, {"body": "OK bear ![img](emote|t5_2th52|4276)", "score": 2, "replies": [{"body": "Not even a bear, I would love the fairytale ending where we all make a bazillion dollars off a SPY calls but this ain’t looking good", "score": 0, "replies": []}]}, {"body": "Screenshot of unemployment rate graph with no context or speculation. Good DD m8.", "score": 2, "replies": []}, {"body": "This is the actual chart you should be looking at.\n\nhttps://preview.redd.it/sjytulr3ygkd1.jpeg?width=2340&format=pjpg&auto=webp&s=16e8dedeeaa37f9a035f60cac9e42776c9ed044b", "score": 2, "replies": []}, {"body": "bears are getting desperate", "score": 2, "replies": []}, {"body": "House sales are up tho", "score": 2, "replies": []}, {"body": "But the line is a lot lower than it has been in the past", "score": 1, "replies": []}, {"body": "https://preview.redd.it/2lsw7sc0ogkd1.jpeg?width=261&format=pjpg&auto=webp&s=09733591cc456d88b527bad65712484f3f0b8741", "score": 1, "replies": []}, {"body": "Calls on stonings", "score": 1, "replies": []}, {"body": "If rates get emergency cut huge then my TLT calls will PRINT", "score": 1, "replies": []}, {"body": "Also, the 10yr minus 2yr Treasury constant maturity rate is an interesting indicator for timing of possible recession. There seems to be a correlation between the percent moving from a negative position to rising into positive that prefaces market downturns. Look at all the vertical gray columns (recessions and market down turns) that follow a rise over the line into positive. Food for thought.\n\nhttps://fred.stlouisfed.org/series/T10Y2Y/", "score": 1, "replies": []}, {"body": "Bulls mad", "score": 1, "replies": []}, {"body": "What you’re seeing is the opioid epidemic, plus living conditions are more amenable to surviving in poverty. \n\nI don’t think this will have the same impact on companies it previously had, especially now that companies can hire more people remotely.", "score": 1, "replies": []}, {"body": "Why r u gay", "score": 1, "replies": []}, {"body": "Long story short, printers activated and LONG", "score": 1, "replies": []}, {"body": "I see it back down to 2.5 / 3% what’s the problem.", "score": 1, "replies": []}, {"body": "This spike is from 2020, which was due to covid, not underlaying economic issues. \n\nAnd, it did cause a recession, its just that it only lasted 3-month.", "score": 1, "replies": []}, {"body": "J Powell won't let a recession happen, it's impossible.", "score": 1, "replies": []}, {"body": "This is not at all population adjusted. I bet if you do that, you’ll actually see a downward trend.", "score": 1, "replies": [{"body": "https://preview.redd.it/4lyggnxawgkd1.png?width=1170&format=png&auto=webp&s=85f972107271d36bdafac64c3881013f24ff9f0f\n\nChart using percent unemployed", "score": 2, "replies": [{"body": "Yeah, so none of these top the 70s and 80s. I ignore COVID, as it was externally influenced and short in duration.", "score": 2, "replies": [{"body": "I understand that, but it’s the run up, the beginning. The chart wasn’t meant to showcase some 1% jump as Doomsday, it was meant to show that almost all of the recessions started with a 1% unemployment increase.", "score": 1, "replies": []}]}]}]}, {"body": "Nobody tell him unemployment has only increased 90 basis points from 3.4% in Jan 2023 to 4.3% now", "score": -2, "replies": [{"body": "Almost exactly the same as Jun 2007 to Dec 2007", "score": 2, "replies": []}, {"body": "BIBLICAL ", "score": 0, "replies": []}]}, {"body": "Puts on firstborn sons and the adultery industry!\n\n\nThe green food industries gonna make a killing with all those extra locusts that can be grinded down into locust flour during a famine tho!", "score": 0, "replies": []}, {"body": "Yeah, next time the government might shut down the economy for twice as long! ![img](emote|t5_2th52|4275)", "score": 0, "replies": []}, {"body": "In 15 years, the U.S. economy has been in a recession for just two months\n\nI can smell the salty brine in the air on missing out optimism gains!", "score": 0, "replies": [{"body": "Brother, I have money in the market, I’m not regarded, I just want to make sure to not get caught up in it", "score": 1, "replies": []}]}, {"body": "Based on this graph? Yeah. Sure.", "score": 0, "replies": []}]}
