{"title": "✅ Daily Chat Thread and Discussion ✅", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "1eq45wz", "created_utc": 1723435253.0, "score": 13, "upvote_ratio": 0.89, "num_comments": 79, "comments": [{"body": " nasdaq futures green", "score": 17, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "What? He's not predicting, he's telling you", "score": 4, "replies": []}]}]}, {"body": "110 todayyyy", "score": 14, "replies": [{"body": "I wish. The sellers have started selling. Imagine selling at a 3% profit smh", "score": 4, "replies": []}, {"body": "🤞 🙏 🙇‍♂️", "score": 1, "replies": []}]}, {"body": "These are my economic illiterate opinions/guesses fwiw.  NVDA is now moving independently of the NASDAQ.  This means to me money is coming in from the sidelines or being moved from the indexes to NVDA.  Hedge funds suffered losses in the Yen carry trade and and took profits from their biggest gainer - NVDA.  Now the Yen carry trade is unwound and the hedges are returning to oversold NVDA ahead of earnings.", "score": 10, "replies": []}, {"body": "Solid day of gains.  More interesting is the fact that multiple media outlets have changed their tune to being very positive.  Should be interesting leading into earnings.", "score": 10, "replies": [{"body": "Going through this volatility and market sentiment (without panic-selling) has been a great lesson. I started investing 1 year ago so I'm very new to market movements, so I've been observing this rollercoaster with great interest (and of course some stress).", "score": 1, "replies": []}, {"body": "tho that's what they do, negative when down, positive when up, or just to fuck with you, negative on up and positive on down. it changes literally every day.", "score": 1, "replies": [{"body": "That's right, the news follows the stock price", "score": 1, "replies": []}]}]}, {"body": "110, how we feeling?", "score": 7, "replies": [{"body": "Liking the premium from my $108 covered calls today, to close the wheel from my naked $108 puts that exercised on margin a couple weeks ago.", "score": 2, "replies": []}]}, {"body": "Lots of good news coming in Today! Hopefully CPI report comes in within expections", "score": 7, "replies": []}, {"body": "Good day, but far from being back. Still way below ATH", "score": 3, "replies": []}, {"body": "Congrats to all NVDA holders.  The stock price will never go under 100 again.", "score": 8, "replies": [{"body": "Never say never", "score": 8, "replies": [{"body": "NVDA feiber", "score": 1, "replies": []}]}, {"body": "Awe man and I was kinda hoping to get assigned some of the $100 strike puts I sold.", "score": 3, "replies": []}, {"body": "Never might be a bit too much, so I'll moderate that a little by saying Nvidia will not go below 100 before the end of capitalism.", "score": 2, "replies": []}, {"body": "Chill papi", "score": 1, "replies": []}, {"body": "I doubt it..", "score": 1, "replies": []}]}, {"body": "Oh my God please tell me this isn't another pump and dump. I really hope it keeps going up, I literally have PTSD at this point.🫣", "score": 9, "replies": []}, {"body": "$112 today", "score": 3, "replies": []}, {"body": "I see green", "score": 3, "replies": []}, {"body": "Steve Grasso of CNBC says he see NVDA going to 120 soon. He \"bought more at $101\".", "score": 3, "replies": []}, {"body": "If it closes at $108 I'll be happy. (upgraded from previous three days $105 wishes).", "score": 5, "replies": [{"body": "$109 - I'll take it!", "score": 2, "replies": []}]}, {"body": "Second!", "score": 5, "replies": [{"body": "first!", "score": 4, "replies": [{"body": "Zero!!", "score": 4, "replies": [{"body": "Okay 150+ after earning😎", "score": 5, "replies": [{"body": "350", "score": 3, "replies": []}, {"body": "I like it. I'd like it even more if I hadn't closed my Sept $120C when we crashed to around $100", "score": 2, "replies": []}]}]}]}]}, {"body": "Let’s see if this holds over 110 🤞", "score": 5, "replies": []}, {"body": "I just need it to end at 110 today I'm happy. A 2-3% a day until ER. Don't want it to go up too fast.", "score": 4, "replies": [{"body": "A 2% daily growth increases the stock price to $132 in 2 weeks (10 market days) starting from $109 and a 3% would push it to $146!", "score": 5, "replies": [{"body": "This guy compounds!", "score": 2, "replies": []}]}]}, {"body": "Father Allah please give me my money back, I'm sorry for all the naughty things I've done. Please!\n\n🙍🏿‍♂️🙏🏿🐯", "score": 9, "replies": [{"body": "Hahahah", "score": 2, "replies": []}]}, {"body": "Still following the top ten digital coin trends. Not even following news anymore. Clearly, miners are all betting on Nvidia, with billions more than news chasers. With the same love they have for the digital coins themselves.\n\n\nhttps://ibb.co/n842c6b", "score": 2, "replies": [{"body": "Splain?", "score": 2, "replies": []}, {"body": "nvda follow its cycle just like BTC", "score": 1, "replies": []}]}, {"body": "Resistance at $110?", "score": 2, "replies": []}, {"body": "Nature is healing friends", "score": 3, "replies": [{"body": "Not quite, this is just a bounce from the last 3 drops since july-11 on the daily chart", "score": 1, "replies": [{"body": "Hence the healing", "score": 3, "replies": []}]}]}, {"body": "Bought some 8/30 $120 calls, am i cooked boys?", "score": 2, "replies": [{"body": "You're fine, just wait for 28.", "score": 4, "replies": []}]}, {"body": "Predictions leading into earnings? We are close to 50 day moving avg", "score": 1, "replies": [{"body": "140 before earnings.", "score": 3, "replies": [{"body": "115 before earnings", "score": 1, "replies": []}]}]}, {"body": "Chart starting to look good", "score": 1, "replies": []}, {"body": "What's with the sudden dive?", "score": 1, "replies": [{"body": "My guess is [Three year inflation outlook hits record low in New York Fed Consumer Survey](https://www.cnbc.com/2024/08/12/three-year-inflation-outlook-hits-record-low-in-new-york-fed-consumer-survey.html) changes interest rate calculations....", "score": 2, "replies": [{"body": "if thats the case im just surprised prices are changing so much based on such miniscule news", "score": 2, "replies": []}, {"body": "So, people just selling on good news?", "score": 4, "replies": [{"body": "It's expected to stay exactly as predicted, anything deviating is considered bad news until the CPI on Wednesday", "score": 3, "replies": []}, {"body": "My thought, is that falling inflation means higher rates are working to tame inflation, so there's no need for an emergency rate cut like people were clamoring for last week. No emergency rate cut means a rate cut is \"put off\" until September Fed meeting, and the market isn't happy. They'll get over it quickly", "score": 2, "replies": [{"body": "Yeah, the interests rates aren't even that high, historically speaking. They were at this level for most of the 90's. Don't know why the market is so hyper fixated on them. There are so many other factors to consider.", "score": 2, "replies": [{"body": "It's already recovered most of that drop", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Afternoon plunge 🙄😑", "score": 0, "replies": []}, {"body": "About to see PPI CPI tank the market this week", "score": -4, "replies": [{"body": "Bers 🤣🤣🤣", "score": 3, "replies": []}]}, {"body": "$NVDA $91 put 8/16 Expiration", "score": -5, "replies": [{"body": "Thank you for your premium!!", "score": 3, "replies": []}, {"body": "That belongs on WSB, not here lol", "score": 1, "replies": []}, {"body": "Bruh I'm a hyper-bear on Nvidia and I don't even touch short expiration options. It's literally just gambling, you're competing with tons of other traders and even worse, algorithms who're also trading with the next 0-6 months in sight.\n\nNow if you have a solid thesis on why Nvidia should go down (and there certainly is one), why won't you buy 2+ year out puts?", "score": 1, "replies": []}]}]}
{"title": "1/17/25 220 strike NVDA", "selftext": "[deleted]", "id": "1eqo6jg", "created_utc": 1723493965.0, "score": 61, "upvote_ratio": 0.9, "num_comments": 72, "comments": [{"body": "There were literally only 3 trades for it today (volume). So it will swing wildly", "score": 44, "replies": [{"body": "Isn’t volume the amount of options traded in a day? I was seeing the bid/ask move between a .5 difference all day. Wouldn’t that be considered volume if people are bidding? I’m still trying to get the hang of options", "score": -13, "replies": [{"body": "Yes volume is when a bidder (buyer) and an asker (seller) meet in the middle and complete a trade. Since volume is so extremely low, you are seeing a large gap and no trades are happening between the highest buyer and the lowest seller.\n\nIn your image, the highest buyer only wants to pay .35, and the lowest seller only wants to sell it for .89 and so no trades are happening", "score": 22, "replies": [{"body": "Understood! Thank you for the insight. It was weird seeing that huge drop right after close, definitely a new one for me.", "score": 5, "replies": [{"body": "You know you can paper trade options on webull with an unfunded account.", "score": 1, "replies": [{"body": "That is good to know.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You won't be able to. The reason the bid ask spread is so wide is because there's nobody at the counter wanting to buy. You're like the only guy in the store looking to pay what they're asking. There are a few other people maybe interested in there, but you're the only one right now looking to buy seriously. Which should tell you something. You're soooo far out of the money you're literally like the only guy who's willing to trade these. The bid ask is most likely posted by the market maker. Not even real buyers. Of course, anything can happen. You could make money, but you're needlessly handicapping yourself by trading this strike. \n\nSource: Learned the hard way.", "score": 44, "replies": [{"body": "Let’s say NVDA moves positively to $130 in a months time. Will that move this option at all from your experience? Just curious.", "score": 5, "replies": [{"body": "You can go into RH, assign the option on your option list and simulate a return based on the moving price and time to expiration. The only thing it doesn’t take into account is IV", "score": 5, "replies": [{"body": "That’s cool. I’ll have to see if ToS has something like that.", "score": 2, "replies": [{"body": "They do, and you have the pleasure of not dealing with robinhood lol", "score": 9, "replies": [{"body": "This ^", "score": 2, "replies": []}]}, {"body": "They do. It’s called “Risk Profile” in the Analyze tab. You can set different price points, use current position and/or add simulated positions, go to any future date, and see the what the expected profitability would be on that date if the underlying were to reach any of those specified price point.\n\nIt’s simply a theoretical expected value. What you will be filled at entirely depends on the current quotes, as you’ve seen with the wide spread that far OTM contracts can have. It gets even worse with backdated contracts, like LEAPS. The bid ask spread can be outrageous.", "score": 1, "replies": []}]}]}, {"body": "Also time eats away at your option as well. In order to make substantial profit the share price needs to move up significantly between now and the end of August.", "score": 3, "replies": []}]}]}, {"body": "> Today at close the bid dropped to 0.35 cents with the ask closing at .89 cents\n\nClose to the closing time you will sometimes see options spreads widen significantly as market makers take their systems offline.", "score": 12, "replies": [{"body": "That makes sense.", "score": 2, "replies": []}, {"body": "You were correct. Opening bell the bid/ask spread closed up. I’m up 50%", "score": 1, "replies": []}]}, {"body": "I’ve very optimistic about NVDA but 220 in 5 months seems like a stretch but I hope you’re right it’ll be a nice chunk of change for me", "score": 9, "replies": [{"body": "By the way my response wasn’t meant to be sarcastic. I just don’t feel Nvidia will hit 220 by January. I don’t even think it’ll hit 150 by January. I was hoping for a surge in stock price before or shortly after earnings.", "score": 1, "replies": [{"body": "Hahah no worries and you sir are a braver man than me I’ve lost way too much to take risky bets like these", "score": 2, "replies": [{"body": "I took the winnings from 2 28.00 intel puts and put it on this, so this is just play money. I was just confused when I saw the bid/ask spread drop and my call option drop at close.", "score": 1, "replies": []}]}]}, {"body": "Did you not read my P.S lol. I don’t expect it to hit 220 by January I’m just playing it for the premium", "score": 0, "replies": [{"body": "your buying options with no fundamental value because you can’t afford the other ones. \n\nThis is a tremendously bad idea. \n\n“Playing it for premium” is literally just fancy talk for “trying to find somebody dumber than me.” And considering you bought an option that has nvidia at 5 trillion market cap, that’s gonna be pretty hard.", "score": 2, "replies": [{"body": "It’s literally called “gambling” for a reason.. and you’re right I couldn’t afford more expensive options. So what’s it going to be? Play with what your able to on the hope the premium rises with the stock price or don’t gamble at all?", "score": 1, "replies": [{"body": "You are better off getting solid returns with SPY 0dte for 65 cents.", "score": 2, "replies": []}, {"body": "I kind of hope you lose it all for gambling on a overvalued fraud company. You need to treat your money with more care than that and hopefully a big loss will teach to be humble.", "score": 2, "replies": [{"body": "Nvidia is up 114.00 and my calls are up 70% you were saying? I’m sorry I couldn’t hear you with your foot in your mouth.", "score": 2, "replies": []}, {"body": "Lmfao. Someone’s big mad.", "score": 1, "replies": []}]}, {"body": "Options are not gambling. But the way you are “playing them” they are. My options are investments where I lose small win I lose and win big when I win. I also prefer to be the guy who sold you that option. I would happily do that I would never buy that option.  I learned the hard way like you are going to. You need to watch a lot more training on you tube before you “play options” again.", "score": 1, "replies": [{"body": "Ok dad.. whatever you say", "score": 3, "replies": []}, {"body": "Gambling are spx options at the end of the day hoping the market moves 40 points - people play these because sometimes they get lucky nvda at 220 by January is like playing blackjack and asking for 10 cards to start you could have played a spread for a similar amount", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Don’t despair there are two earnings (Aug and Nov) between now and January expiry so anything can happen.", "score": 5, "replies": []}, {"body": "There’s sometimes a phenomenon at close where the bid/ask spreads open wide. Wait till morning regular hours, it’ll tighten up (hopefully). \n\nBut I’d advise you to research Delta and Gamma. Your choice of option is very unlikely to yield the rewards you’re looking for. “Playing it for premium” is not what this option strike is communicating. It’s communicating a moonshot, and likely pissing your money into the wind. \n\nYes, the option might be “cheap” relatively, but that’s an uneducated way to look at it. There’s a better sweet spot to be found if you’re looking for an option strike/date for your desired exposure.", "score": 3, "replies": [{"body": "If you have any suggestions in terms of a better strike/option I’m all ears", "score": 2, "replies": [{"body": "\nStart here, this guy is a former Marine and seems like a legitimately honest man. Also extremely realistic and strategic. Tons of good, free content. \n\nhttps://youtu.be/0kXY1hY—Ww?si=xyjKUFoJa8ag-C3s", "score": 2, "replies": [{"body": "Confirming that former Marines are uniquely qualified to give trading/investing advice 🙄", "score": 2, "replies": []}, {"body": "Says “this video is unavailable”", "score": 1, "replies": [{"body": "Try this, specifically “Buying call options smarter”\n\nhttps://youtube.com/playlist?list=PLAFDZ3YyC4rRLyc9JcEi6loWJa10j6kj-&si=Hw1lVWfa5ROe1AOv", "score": 4, "replies": []}]}]}]}]}, {"body": "My brain was breaking trying to understand how that 120c contract was SO cheap - then realized it’s actually just a 110% OOM contract. 😆 best of luck. I’m super heavy loaded on NVDA calls monthly until Feb", "score": 2, "replies": [{"body": "Yeah. I’m just playing till earnings hoping to make a small profit off the rise in premium IF the stock rises.", "score": 2, "replies": []}]}, {"body": "Your better off with 150 or 200 strike. Stick to big round numbers", "score": 2, "replies": [{"body": "Why though? Just curious on your thought process?", "score": 1, "replies": [{"body": "It’s just psychology. Behavior-wise people are attracted to the big round number like OP said.", "score": 2, "replies": [{"body": "Market moving trades are not initiated by humans. It doesn't matter what humans like. A machine determines entry/exit for large trades", "score": 1, "replies": []}]}]}]}, {"body": "🦧", "score": 2, "replies": []}, {"body": "I did sell 2 contracts while I was up 40% I wonder if the bid/ask is now so low if I should average down", "score": 1, "replies": []}, {"body": "Not too sure if I like that spread.", "score": 1, "replies": [{"body": "The spread was much thinner throughout the day. It was a .5 cent difference only reason I posted on here. Someone else said it’s possible it dropped so hard because market makers went offline for the trading day. I guess I’ll find out tomorrow. I saw this with the 5.00 strike for 1/2026 for RKLB. The option would drop significantly in value at the end of the day and then spike in value at the opening bell.", "score": 1, "replies": []}]}, {"body": "Do we really think NVDIA is going to basically double in stock value?", "score": 1, "replies": [{"body": "No", "score": 2, "replies": []}]}, {"body": "I'm not a fan of that delta.", "score": 1, "replies": [{"body": "Yeah me either it’s supposed to be .50 or greater correct?", "score": 3, "replies": []}]}, {"body": "I like nothing lower than 20-25. But that's just one of the things I look at when trading. It does fluctuate but I forget why.", "score": 1, "replies": []}, {"body": "Option strikes with low liquidity can sometimes see wild spreads especially close to market close.\n\nI’ve been through this before and was like ohhh I made a lot of money! Only to have it correct the next morning.\n\nAt the end of the day you chose a popular stock with a strike wayyy OTM and yet so not so far out that hitting it is still possible. Is it possible? Sure, but there are much better approaches if you think it will hit 150 by January. Cheap options are like clickbait and lottery tickets. \n\nSometimes (very rarely), you can find a pretty cheap contract and IV low, then it moves exactly the way you need it to and volatility jumps on those contracts and you score really good. \n\nI was eyeing PLTR puts at $30 8/16 exp today and was hoping the stock would go above $31 again and got my bid ready. It went to $0.45 and I wanted a little more then boom it was $0.50 (still cheap to me, considering its move the last week) and I let it pass. And it closed today over $1 with 4 trading days left. IV picked up a little bit too which makes the premiums higher. Another time!", "score": 1, "replies": []}, {"body": "Buy the furthest out date. 200 call", "score": 1, "replies": [{"body": "Why?", "score": 2, "replies": []}]}, {"body": "With such low volume, your money is cooked", "score": 1, "replies": [{"body": "We’ll see", "score": 1, "replies": []}, {"body": "Almost 6,000 open interest. I wouldn’t be worried about the volume.", "score": 1, "replies": []}]}, {"body": "Implied volatility", "score": 1, "replies": []}, {"body": "Learn what liquidity is", "score": 1, "replies": [{"body": "Interesting how I’m up 90% but ok..", "score": 1, "replies": []}]}, {"body": "Lesson in illiquid options here. Where the quote isn’t really the price, and even if you’re right about the stock move, all your gains and more vanish to execution.", "score": 1, "replies": []}, {"body": "Consider the last trade price. sometimes the lowest bid could be 0.01 and your ask 1.00. the higher the trade volume the less of a spread. \n\nSide note. study the greeks.", "score": 1, "replies": []}, {"body": "Today was refreshing. I held, took gains where I felt comfortable. Still holding on to a few calls. To the ones who took the time to explain and didn’t make me feel like a moron, thank you. To the pieces of shit who called me an idiot and hope I lost all my money.. well I’m up 90.26% so how bout them apples..", "score": 1, "replies": []}, {"body": "I exited at 116.95 with over 100% return thanks again all!", "score": 1, "replies": []}, {"body": "because there is still uncertainty whether the AI demand will keep scaling at the rapid pace it’s been going. The spread between ask and bid is also very wide suggesting the same. If NVDA blows through earnings it will pump and you have enough time left to benefit from waiting without losing much value if any.", "score": 1, "replies": [{"body": "So the more volume pumped into the option I.e purchasing the strike the thinner the spread for the bid/ask becomes?", "score": 1, "replies": []}, {"body": "Thank you for the insight!", "score": 1, "replies": []}]}, {"body": "I think I sold you some of these. Thanks for the free money 😂😂", "score": 1, "replies": [{"body": "Probably. 67.00 per contract, your welcome", "score": 1, "replies": []}]}]}
{"title": "Went all in Nvidia last week & was sick to my stomach 🤮🤢 TESLA IS THE BEST OPPORTUNITY RIGHT NOW ", "selftext": "[deleted]", "id": "1eqlukr", "created_utc": 1723488484.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 70, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 9 months ago\n**Total Comments** | 381 | **Previous Best DD** | \n**Account Age** | 9 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "meeting salt pause sand bake whistle judicious foolish hospital bewildered", "score": 30, "replies": [{"body": "I had the 50k in @ $107 with 450 shares. Nvidia can 2-3x to $6-$9 Trillion. By then Tesla is $3Trillion on the low thats a 5x", "score": -61, "replies": [{"body": "pen marry fragile seed lunchroom combative fear soup ring sleep", "score": 30, "replies": [{"body": "Whats the app", "score": -24, "replies": [{"body": "employ squeeze tidy full punch combative panicky vase distinct toy", "score": 15, "replies": []}, {"body": "Write your bet using this format:\n\n[exclamation mark \"banbet\" no spaces] [ticker] [price target] [timeframe, e.g. 30d]", "score": 2, "replies": []}]}]}, {"body": "Keep in mind spaceX and boring company isn’t a part of Tesla. \n\nThough I do understand what you mean.", "score": 5, "replies": []}]}]}, {"body": "how does somebody this stupid have 50k in the first place lmfao", "score": 30, "replies": [{"body": "Pops. Giving it back when Tesla is $800 or $1000", "score": -18, "replies": [{"body": "Damn Pops might be dead way before that (cause it will never happen).\n\nBut when Pops dies make sure to go all in with any inheritance to Intel. I hear that’s where dead money goes.", "score": 15, "replies": [{"body": "Imagine giving 50k to your son and this is what he's doing, running around online typing in caps about Tesla lol", "score": 12, "replies": []}]}, {"body": "Based on what metrics or data do you think tsla can go up? ", "score": 1, "replies": []}, {"body": "Congrats on being intel NANA round 2 lmao", "score": 1, "replies": []}, {"body": "bro tesla is not going anywhere but sideways dont waste your money", "score": 1, "replies": [{"body": "All in Tesla calls. $205", "score": -1, "replies": []}]}]}]}, {"body": "You’re gonna sell this position within one week why are you talking about tesla 5xing in your comments", "score": 24, "replies": [{"body": "Shills gonna shill", "score": 5, "replies": []}, {"body": "After feeling what i felt without Tesla shares. Im Diamond handing till im 27-28 in 2029-2030", "score": -12, "replies": [{"body": "Bro, you’re complaining right now with a small dip, there’s no way you’re diamond holding anything, stop lying.", "score": 19, "replies": [{"body": "Selling at $800 or $1000. Thats $200k or $250k 😂 im diamond handing", "score": -6, "replies": [{"body": "No, you're just going through a cycle of paper handing everything.", "score": 9, "replies": [{"body": "After feeling what i felt without Tesla. Im holding idc if its 4-5 years", "score": -2, "replies": []}]}]}]}, {"body": "!RemindMe 5 years", "score": 3, "replies": [{"body": "I will be messaging you in 5 years on [**2029-08-12 20:09:57 UTC**](http://www.wolframalpha.com/input/?i=2029-08-12%2020:09:57%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1eqlukr/went_all_in_nvidia_last_week_was_sick_to_my/lhst9ap/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1eqlukr%2Fwent_all_in_nvidia_last_week_was_sick_to_my%2Flhst9ap%2F%5D%0A%0ARemindMe%21%202029-08-12%2020%3A09%3A57%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201eqlukr)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "Op's strategy is based on buying and selling at a certain age. Based", "score": 4, "replies": [{"body": "Bet that strategy will make millionaires with Apple , Amazon , Google & Microsoft in 5-6 years", "score": -1, "replies": []}]}]}]}, {"body": "Sell it all and buy DJT instead. Will 5x your losses", "score": 11, "replies": [{"body": "Fuck a DJT.", "score": 2, "replies": [{"body": "I agree. My 24p would be very happy if it drops to $1 this week", "score": 2, "replies": []}]}]}, {"body": "So op lost money on nvda and is now a tesla “bull”. Yolo his inverse position 🚀", "score": 9, "replies": [{"body": "He's a herm.", "score": 1, "replies": []}, {"body": "Actually sold today on the pop made $150 but Tesla is better 😂", "score": -5, "replies": []}]}, {"body": "This post will end up like the INTC guy lol. Elon is about to do some dumb shits on X again", "score": 10, "replies": []}, {"body": "Discussion? You mean yolo?", "score": 5, "replies": [{"body": "I was sick to my stomach with my $ in Nvidia over Tesla. Haven’t felt like that since Nvidia was $490 in January& i had Tesla shares. Switched , got the run , now its Tesla time", "score": 1, "replies": [{"body": "Lol with your level of emotional instability you really should just park it in spy", "score": 4, "replies": [{"body": "Ima go to college for 4 years & it will take my mind off the Telsa shares. Ima make it to Goldman Morgan stanly or one of the big dogs", "score": -5, "replies": [{"body": "No buddy the Tesla shares will take your mind off college", "score": 6, "replies": []}]}]}]}]}, {"body": "I got myself one whole invidyah jus turday.", "score": 4, "replies": []}, {"body": "Guy with the reverse Midas touch.", "score": 4, "replies": []}, {"body": "got it puts on both", "score": 7, "replies": [{"body": "Dont go to far out 😂", "score": 0, "replies": []}]}, {"body": "that ain gown work, chief", "score": 4, "replies": [{"body": "See you at $3 trillion mate", "score": 1, "replies": [{"body": "Not without selling cars", "score": 1, "replies": []}]}]}, {"body": "People with money who don’t know how to trade will lose it all. Stop chasing", "score": 2, "replies": []}, {"body": "Yeap, going back down", "score": 2, "replies": []}, {"body": "to the moon boyos!!!!\n\n  \n![img](emote|t5_2th52|31224)", "score": 2, "replies": []}, {"body": "Shits gonna tank once Iran attacks Israel", "score": 2, "replies": [{"body": "Tank? You’re right! Time to invest in tanks!", "score": 3, "replies": [{"body": "We need Tesla to start manufacturing tanks for the general public", "score": 2, "replies": [{"body": "So they can get mobbed by raccoons and blow tires on dirt roads?", "score": 2, "replies": []}]}]}]}, {"body": "Jesus, charge your fucking phone", "score": 2, "replies": [{"body": "Yeah im charging it right now", "score": 1, "replies": []}]}, {"body": "Just putting it out there, I’ve made money on it each time it’s at this level I scoop up ROOT. I normally pick it up in the 40s and unload half in the 60s and unload the rest around 75. \n\nMy position is 500 shares at $44.30", "score": 1, "replies": []}, {"body": "If you're that confident then buy leaps. If you insist on shares then why not buy $TSLL?", "score": 1, "replies": []}, {"body": "You have no idea what you’re talking about just lurk my man you can learn a lot if you shut your mouth", "score": 1, "replies": [{"body": "Bet gang. Lets see who has more return to investors next 5 years. Dont count 2023/2024 it was obviously Nvidia 😂", "score": 0, "replies": []}]}, {"body": "Best opportunity to lose more money👍🏽", "score": 1, "replies": []}, {"body": "already pumping AH hell yea.", "score": 1, "replies": []}, {"body": "OP said nvda can 2-3x from here\n\nlikely the top is already in orrrrr….", "score": 1, "replies": []}, {"body": "Opportunity for what....?", "score": 1, "replies": [{"body": "For a 5x while Nvidia can only 2-3x to $6-$9 Trillion 😂😂😂😂", "score": -1, "replies": [{"body": ".....Tesla is a sub $200 stock. Jfc guy. They can both fuck right off. Peel it back ese", "score": 2, "replies": []}, {"body": "Yeah 2-3x my nuts sissy boy", "score": 2, "replies": [{"body": "5x a saggy chingator for later. 😂", "score": 2, "replies": []}]}]}]}, {"body": "Imagine thinking TSLA is à better Investment than NVDA 🤔", "score": 1, "replies": []}]}
