{"title": "Intel sells stake in UK chip designer Arm amid company-wide restructuring and cost cuts  ", "selftext": "Intel has sold its 1.18 million share stake in British chip firm Arm Holdings, according to a regulatory filing, as the California chip designer shores up its balance sheet amid intense competition. \n\nThe sale, disclosed on Tuesday, likely raised Intel nearly $147 million, based on Arm’s average stock price between April and June.\n\nIntel had cash and cash equivalents of $11.3 billion, and liabilities of about $32 billion at the end of June, according to its latest financials.\n\nThe divestment from Arm comes amid a tumultuous financial period for Intel, as it undergoes what CEO Pat Gelsinger has called “the most substantial restructuring of Intel since the memory microprocessor transition four decades ago.” \n\nAt the start of August, Intel announced a $10 billion cost-reduction plan that will see it cut around 15,000 employees, eliminate its fiscal fourth-quarter dividend and reduce capital expenditures.\n\nAt the same time, Intel had reported worse-than-expected quarterly results and issued a light guidance for the current period. The results were followed by the largest single day drop in Intel’s stock price in 50 years, down 26%.\n\nThe chip firm, which both designs its own chips as well as manufactures them, has been struggling to keep up with other semiconductor competitors amid intensifying competition due to the AI boom. \n\nAccording to Gelsinger, the company’s latest losses were compounded by its decision to more rapidly produce its Core Ultra PC chips which are build to handle AI workloads. \n\nCompetitors such as AMD and Qualcomm have also been racing to roll out more AI-focused chips, chasing the success of Nvidia. \n\nUnder Gelsinger, the company is also looking to grow its struggling chip foundry business, and wrestle back market share lost to Taiwan’s dominant TSMC and South Korea’s Samsung in recent years.\n\nIntel and Arm declined to comment on the sale when contacted by CNBC on Wednesday.\n\nIntel, which has lost nearly 60% of its stock value so far this year, was slightly up in after-hours trading, according to LSEG data.\n\nArm’s shares have been performing well since its IPO last September, up nearly 65% year to date. \n\nJapan’s SoftBank Group has a majority stake in Arm, and has been a beneficiary of the jump in the company’s shares.\n\nSource: https://www.cnbc.com/2024/08/14/intel-sells-stake-in-uk-chip-designer-arm-amid-company-wide-restructuring-and-cost-cuts-.html", "id": "1es69kc", "created_utc": 1723653318.0, "score": 234, "upvote_ratio": 0.97, "num_comments": 74, "comments": [{"body": "So would we be considering this move a cut to R&D or does this sound like raising capital to keep the house afloat by realizing gains?", "score": 123, "replies": [{"body": "Raising capital to finance PPE spendings. Cutting edge foundries are very expensive, especially if you pick your location based on politics.", "score": 66, "replies": [{"body": "but bro ohio is best place on the planet for manufacturing not because a bunch of politicans gave some free tax money /s", "score": 23, "replies": [{"body": "Low taxes, cheap land, adequate water sources, low seismic activity, and the 800 pound gorilla: undeniably domestic.\n\nReally though, my parents' generation really fucked this country offshoring everything they could while we slipped from leading manufacturing. Gotta start somewhere.", "score": 58, "replies": [{"body": "Yes, but you fail to realize that specialization tends to concentrate in certain areas. There is reason NY is financial strong house, Silicon valley is tech strong house, AZ and Texas to certain extent are semiconductor strongholds.\n\nSpecialized manufacturing isn't a switch you can flip on and off with tax incentives. And building a leading edge fab in Ohio is dumbest decision a CEO can make, granted  this is exactly what Intel would do", "score": 5, "replies": [{"body": "Texas’ grid and AZ’s water though… kinda mid- term problematic with no real solutions being worked on.", "score": 5, "replies": []}, {"body": "I thought Columbus was considered a growing midwest tech hub.", "score": 3, "replies": [{"body": "growing in manufacturing != specialized in a particular section of manufacturing. Specializing takes decades and usually it is a natural process. Using free tax payer money/printing money in hopes of flipping this equation is futile.", "score": 4, "replies": [{"body": "I have a hard time believing this. You’re telling me that in an economy of unemployment people won’t move for jobs? People won’t specialize? People won’t learn? \n\nYou’d be amazed at how few people it takes to set something up. Most jobs are a few database updates a week. Some PhD that’s been at intel for 20 years should know enough to get something 90% of the way there? Talk about a failure in disaster recovery. \n\nOmg, our plant crashed and we can’t do anything for decades, is always the internets answer when a hard problem arises.", "score": 4, "replies": [{"body": "But what makes you think that there is unemployment in semiconductor industry? Supply for talented semiconductor engineers was, is, and will continue to be low. Intel isn't firing any of these people, just a bunch of bloatware that they shouldn't have hired in first place (PMs, middle managers etc.).\n\nAnd if specialized jobs are few database updates away, big tech companies won't be paying 300k+ salary in Bay Area, the most expensive city in US. They would just move majority of their HQ elsewhere (not just on paper, like Tesla).", "score": 4, "replies": [{"body": "That’s right. People are dumb and can’t learn when there are already multi billion dollar product lines already in place. \n\nAnd those SW eng jobs you’re talking about… it’s not 2020 or earlier anymore. The bay was rich white people doing rich white people shit to give us products like Uber and AirBnb. \n\nProcess, operations, and the thousand other tasks required to complete a product isn’t designed by the product manager that takes over. Get over yourself with these impossible challenges. \n\nIt’s lame. Are nuclear power plants only built were nuclear engineers live?", "score": 3, "replies": [{"body": "You think leading edge fabs that cost 100B+ to make from scratch and are at least 1000x more complex than nuclear plants comparable? \n\nIf you are building 14nm or 7nm, that is one thing as that is already been in production for 5 years. But if you are building 3nm and you have never built 3nm before, you think it is smart decision to build on other side of country just coz Ohio govt gave a few billion bucks? That is gonna be a shit show. It already is.", "score": 0, "replies": [{"body": "I think it is what it is. I think there are probably less than 100 people who can plan this stuff correctly despite design staffing probably being in the thousands. The people that are designing the chips for the next generation are probably whittled down to a few dozen I imagine but there are plenty of physics and mathematics phd’s out there if we can peel them away from the quant trading firms where they make millions. \n\nIt’s intel so it’s going to fail. It’s in Ohio so there will be infrastructure failures. It’s also in Ohio so there will need to be a leveling up of the workforce. Something the buck eyes will gladly educate people on. \n\nCircling back to it being intel: they are too big to fail. It’s boomer management with boomer foresight so this will become much more expensive and us tax payers will pick up the slack. \n\nFrom a security standpoint, I’m cool with diversifying strategic assets. \n\nWe’re going to make chips. Yes. \n\nIt’s going to be hard. Yes. \n\nExpensive, also yes. \n\nNeeded: yes. \n\nImpossible: no, but there will be growing pains.", "score": 0, "replies": [{"body": "I don't mind any of that. I just feel if intel is taking free money from govt. it should be held accountable for unethical business decisions such as mass layoffs. O/w we are just throwing money like the Chinese govt. in hopes that it will solve everything.", "score": 1, "replies": [{"body": "Ha. The layoffs are just the start. There was the CHIPS act where the redirected funds to dividends too. \n\nIntel is too big to fail so we will continue to throw money into that furnace because reasons. \n\nIntel is a boomer company with boomer management. I wouldn’t be surprised if Intel and Boeing CEOs were neighbors or shared a driveway in Jackson Hole.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "WTF you talking about? US manufacturing output is at an all time high.\n\nhttps://en.wikipedia.org/wiki/Manufacturing_in_the_United_States#/media/File:Manufacturing_GDP_(nominal_and_real)_and_Manufacturing_Employment.png\n\nI think you may suffer from a [common misconception](https://www.nationalreview.com/2017/03/jobs-prosperity-capitalism-should-focus-latter/).", "score": 1, "replies": []}]}]}]}, {"body": "Raising capital, sure.  But I don’t think that it t equity interest has any relevance to R&D or any kind of JV.", "score": 9, "replies": []}, {"body": "Yes", "score": 20, "replies": []}, {"body": "Do people really think Intel is on the brink of going bankrupt?", "score": 7, "replies": [{"body": "Large ships can sink slowly", "score": 7, "replies": [{"body": "Large ships can hit rocks and stay afloat.", "score": 6, "replies": [{"body": "This large ship has already hit quite a few big rocks and is now desperately dumping tools and furniture to prevent itself from sinking.\n\nOh and there are a few more icebergs ahead of it. And the rudder is busted.", "score": 4, "replies": [{"body": "The band is already on the deck playing \"Nearer my God to thee\".", "score": 1, "replies": []}]}]}]}, {"body": "Nope but I think it's going to $8 before $30", "score": 1, "replies": [{"body": "Laughable. You think its gonna become a lower than 40bn dollar company with a 54bn annual revenue?", "score": 4, "replies": [{"body": "No. The revenue will also sink. They are loosing ground to AMD and ARM derivatives.", "score": 2, "replies": []}]}]}]}, {"body": "I mean they are underwater in debt by about 20 billion so they are probably going to use it to try and pay down the debt", "score": 9, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "By what logic this is R&D", "score": 1, "replies": []}]}, {"body": "Nana is not impressed", "score": 96, "replies": []}, {"body": "So all that $8b chips act money was used up already eh?", "score": 65, "replies": [{"body": "Yup, just in time to fire 15,000 people from their jobs after enjoying $8B of our tax payer dollars 👍 it’s like the U.S. government is paying them to fire our own workers.", "score": 52, "replies": [{"body": "Hey at least Pat got $180 mn of that", "score": 18, "replies": []}]}, {"body": "The Chip Act money and export controls prevent Intel from selling chips in China. Consider how much China's business is worth. \n\nOnce again, the government is playing with the free market, thinking it knows best. Biden's reason is to block China in the name of national security. The issue is that this will encourage China to build the industry in-house, and in 10 years, they could own a lot of the global market share.", "score": -1, "replies": [{"body": "There's no \"playing with the free market\" when the market has never been free. This isn't a free market, and thank god it isn't, because corps would just merge with eachother and acquire everything else. The idea of a free market is a fucking fairytale and I'm surprised you haven't learned this yet.", "score": 0, "replies": [{"body": "I’m surprised you don’t know what the free market is, considering you’re taking the words as a literal translation rather than actually knowing the definition.\n\nFrom google: In economics, a free market is an economic system in which the prices of goods and services are determined by supply and demand expressed by sellers and buyers. Such markets, as modeled, operate without the intervention of government or any other external authority.", "score": 1, "replies": [{"body": "Considering the Chips Act literally addresses the supply of chips, again, the free market is a fairytale.", "score": 3, "replies": [{"body": "You know that Intel can't sell most of its chips in China, right? The reason is US government export controls. A few billion dollars doesn't make up for that lost market worth over 100 billion.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Or maybe it isn't doing well because of high interest rates and the fact that it isn't doing business overseas, where workers are cheaper and regulations are relaxed.", "score": 1, "replies": []}]}]}]}, {"body": "Similar feeling when intel invested in ASML holdings to develop photolithography and then they discarded…. Mastermove again?", "score": 22, "replies": []}, {"body": "what a shit show of a company", "score": 54, "replies": []}, {"body": "I’d feel better about Intel if they weren’t coming across as needing to part out everything not bolted down to fund, a shaky to date, turnaround plan.", "score": 7, "replies": []}, {"body": "Like the time Toyota sold its massive stake in TSLA.", "score": 15, "replies": []}, {"body": "I’m considering investing my grandparents inheritance on this. lol. So fake.", "score": 4, "replies": []}, {"body": "honestly as a long time Intel hater i'm probably going to buy shares soon just because it's under $20", "score": 16, "replies": [{"body": "It always can go under $15", "score": 32, "replies": [{"body": "Yeah that's why I like to buy shares in increments.", "score": 19, "replies": [{"body": "Average down until you no longer look like a clown!", "score": 11, "replies": [{"body": "I appreciate people like Pablo for providing exit liquidity for the rest of us.", "score": 5, "replies": []}]}]}]}]}, {"body": "With as much hate as this company gets, and the assets they’ve accumulated over the past decades… this company might just end up being a super solid investment.", "score": 17, "replies": [{"body": "I'm buying. ", "score": 3, "replies": []}]}, {"body": "Money pit", "score": 6, "replies": []}, {"body": "I want Intel to succeed so badly but they make the wrong decision everytime. I'm going to enter a small, small position and hope to god that they turn things around in 20 years.", "score": 7, "replies": [{"body": "Honestly just wait a few months. These busted Intel chips are not helping their sales any, Q3 results will be worse.", "score": 3, "replies": []}]}, {"body": "Sold to you!", "score": 2, "replies": []}, {"body": "Selling off the profitable segment then issue restructuring to stick the loss to the low level unprotected commin investors. \n\nThat's basic investment banking 101", "score": 2, "replies": []}, {"body": "I fully expect Intel to post a loss the next quarter too.\n\nThey announced their dividend cut and layoffs this month, which means the net drag on their balance sheet will continue for another few months - cutting 15000-odd jobs is no small task and takes a while to play out.\n\nAdditionally, the recurring cost of building a new factory will continue to eat into their profits.", "score": 2, "replies": []}, {"body": "So glad I finally got out a few days ago. Fucking worst stock ever.", "score": 4, "replies": [{"body": "I was heavily considering buying some intel shares a month ago. So glad I didnt.", "score": 1, "replies": []}]}, {"body": "Pat gelsinger is terrible", "score": 5, "replies": [{"body": "What's wrong with this, in context?", "score": 18, "replies": [{"body": "Well its the simple blame the person in charge if the company is doing poorly. Instead of actually looking at the management decisions that have been made.\n\nYou know Russia invading Ukraine is Zelensky's fault.", "score": 12, "replies": []}]}, {"body": "He had so much hype few years back, such a disappointment.", "score": 4, "replies": []}]}, {"body": "GL getting any real talent hired at Intel now lmao.\n\nAll top engineers will be at AMD and Nvidia. I mean I think Nvidia gets so many applications that when I looked back in 2019-2020 they required a masters for the engineers with a PhD preferred lmao.\n\nIntel is like \"GED\" optional", "score": 3, "replies": [{"body": "Intel and AMD have been trading blows for years. At one time AMD was 2 bucks a share 10 years ago.", "score": 4, "replies": []}]}, {"body": "Sell Intel to AMD or Nvidia, at least they seem to know what they're doing and can probably make better use of the company", "score": 1, "replies": []}, {"body": "Worst way to use money ever, short intel", "score": -5, "replies": []}, {"body": "Buy high sell low", "score": -9, "replies": [{"body": "What do you mean?  Intel was an IPO investor.  The IPO price was $51 per share. They just sold for ~$120 a share less than a year later.", "score": 25, "replies": [{"body": "I come to realization that most people here don’t know what the hell they’re talking about.", "score": 15, "replies": [{"body": "Welcome to Reddit!", "score": 2, "replies": []}]}]}]}]}
