{"title": "INTC, or a way for Nanna to get her money back...", "selftext": "[deleted]", "id": "1ep7ska", "created_utc": 1723336500.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 69, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 weeks ago\n**Total Comments** | 2 | **Previous Best DD** | \n**Account Age** | 3 weeks | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "83bn market cap, do you think anybody will put that amount of money on the table?", "score": 53, "replies": [{"body": "If we get together enough grandmas...", "score": 72, "replies": [{"body": "Nah I've played Cookie Clicker, I don't trust hundreds of grandmas together...", "score": 16, "replies": []}, {"body": "My grandmother supports this statement. Calls on Intel first thing Monday", "score": 3, "replies": []}, {"body": "This deserves way more likes.", "score": 1, "replies": []}]}, {"body": "Germany just literally GIFTED them 10 billion tax money to build ONE factory there. Putting that in perspective, 83 billion for the whole company is a steal!", "score": 13, "replies": [{"body": "REGARDET", "score": 2, "replies": []}]}, {"body": "Daddy Warren![img](emote|t5_2th52|29637)", "score": 9, "replies": [{"body": "dude don't like chips", "score": 7, "replies": []}, {"body": "You mean the old dude who has a bunch of t bills and bonds? That guy? Unless INTC becomes a different asset class, it's probably not on the table.", "score": 4, "replies": [{"body": "Mans may YOLO once before meeting Jesus", "score": 10, "replies": [{"body": "Guaranteed afterlife friendship with nanna", "score": 5, "replies": [{"body": "he's had his eye on gramma for nearly half a century", "score": 2, "replies": []}]}, {"body": "That is a possibility. Not a good one, but there is a chance lol.", "score": 1, "replies": []}]}]}]}, {"body": "I can put down $30, take it or leave it", "score": 3, "replies": []}, {"body": "Microsoft bought blizzard for 70b recently. 83b is within their size appetite.", "score": 2, "replies": []}, {"body": "Nana might be able to shell out a bit more dough to save her favourite grandkid", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Ok I don’t think this would happen but Apple bought their modem unit a few years ago. They could decide to get directly into the chip business.", "score": 5, "replies": []}]}]}, {"body": "I didn't think Ford could drop further either.", "score": 22, "replies": [{"body": "Fords been lower in recent memory.", "score": 1, "replies": [{"body": "It's been way higher too. FML.", "score": 2, "replies": [{"body": "I’ve been seriously considering starting a position but I feel like the usual pattern they had of going up to 13 or 14 falling to 11 and repeating has stopped and it might just run flat at 10 or possibly fall to 9.5. The only catalyst they have besides their dogshit sales is the election and god knows what’s gonna happen atp.", "score": 1, "replies": [{"body": "I'm buying it for my stock portfolio. Probably going to keep doing it for the dividend. It's not much. $360 right now. But w/e safer bet than a lot of other things. It fits with some good advice to buy and hold well established companies with good dividends. I'm going to buy BTG calls this week if things pop a little. But if Ford is still cheap I may grab that instead.", "score": 1, "replies": []}, {"body": "I have 3 $10.50 calls for 23 August that could easily print if the fed makes any mention of lowering interest rates or someone buys a large stake.", "score": 1, "replies": []}]}]}]}, {"body": "Lightning was a bomb waiting to happen. If macro gets worse, it'll go even lower.", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/vwvmajg3nxhd1.jpeg?width=1179&format=pjpg&auto=webp&s=68b3f5d7e1689ce072e7496365b9a53c05dc702b", "score": 13, "replies": []}, {"body": "x86 is cross-licensed with AMD. So on top of regular antitrust scrutiny making it impossible, Intel or AMD would have to renegotiate the license with the other player in event of change in control. One contributing reason why AMD never got acquired when it was worth ~$2B.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Alphabet, the company that just lost their anti-trust case? \n\nMicrosoft, the company that is so careful to not step too far as to be open to another anti-trust?", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Questions are also statements?", "score": 0, "replies": []}]}, {"body": "Multi-trillion dollar corporations buying businesses with 75%+ market share just isn't gonna fly. Someday when the Intel markets have more diverse competition or Intel slides to a distant second, maybe.", "score": 1, "replies": []}, {"body": "Berkshire could do it", "score": 0, "replies": []}]}, {"body": "I was thinking nvidia or broadcom", "score": 0, "replies": []}]}]}, {"body": "No way government here or EU would be behind MSFT acquiring Intel", "score": 6, "replies": []}, {"body": "Maybe Elon Musk will buy it 🤣", "score": 8, "replies": []}, {"body": "Who could even buy them?", "score": 4, "replies": []}, {"body": "Feds won't let anyone buy them", "score": 3, "replies": []}, {"body": "Holy fuck this thread reads like a fan fic. Sub is just awful now", "score": 6, "replies": []}, {"body": "Once the US chip plants get up and running the market should shift in Intel’s favor.", "score": 3, "replies": [{"body": "It's looking more of an \"if\" they can set those plants up and survive in the next year or two. Intel right now is trading very close to tangible book value, which might become not close as debt increases, pushing tangible book value even lower than its marketcap again, setting up a value trap. Trading this close to it shows no one in the market wants them aside from nanna's grandson. Probably better off for now to looking for opportunities elsewhere in the semiconductor industry.", "score": 1, "replies": []}]}, {"body": "FTC has entered the chat", "score": 3, "replies": []}, {"body": "if my puts print on monday i will buy the entire company myself", "score": 3, "replies": []}, {"body": "No.\n\nOnce 2027 rolls around and Intel is still \"several years\" behind on its turnaround plan, the government will step in and forced its breakup and sale of various divisions to more competent semiconductor companies. No is gonna touch this now, even at $10 a share.", "score": 6, "replies": []}, {"body": "Be careful what you wish for.  What about someone offers $5.00 a-share deal? And Intel accepts it. \n\nGrandma won't be happy about that", "score": 2, "replies": []}, {"body": "Nana heir is BTW (behind the Wendy’s)\nPraying Nana can’t see the deeds he does now.  \nOr is on suicide watch… or got narcan’d\n\nAll the same for regarded bag holders. Different day, different moron", "score": 2, "replies": []}, {"body": "Just because turds are cheap to buy, doesn’t mean anyone will buy them", "score": 3, "replies": [{"body": "This \\^\\^. Once a while, there's INTC speculator trying to make $$$. Buy low and sell .... ? I saw people doing this when INTC was 60, 50, 40, 30, 20 saying there are really cheap. INTC got free $$$$ from the US gov and yet hard to produce. What people want is ARM based and 2nm, 3nm chipset these days. Intel have to get those wafer from TSMC because it takes time to get to those fabrication technology.\n\nNow what about Taiwan issues? Yes, it is an issue but that is why TSMC is expanding to AZ and EU to ensure no simple point of failure. And guess what? other chip guys are also getting Feds $$$ to setup shop in the US.\n\nIntel raptor lake has been crashing with no fix. AMD is current eating their lunch and will be gaining shares from Intel the next 2-3 years. Data Center, Desktop. I would buy AMD instead at this point since it is strong in AI inference space.\n\nFor that reason, I am out.", "score": 3, "replies": []}]}, {"body": "I wouldnt be surprise that berkshire got an eye on that shitshow.", "score": 1, "replies": []}, {"body": "lol it’s funny how Broadcom was going to buy qcom back in 2017, they should buy intel 😂", "score": 1, "replies": []}, {"body": "Intel long", "score": 1, "replies": []}, {"body": "INTC is headed for $12 maybe 10 before it gets back on track for the upside again", "score": 1, "replies": []}, {"body": "Regulators would never allow an INTC acquisition. It would enable vertical monopoly", "score": 1, "replies": []}, {"body": "No chip designer wants to take on additional risk of manufacturing a slightly worse product than what they can get as a service at TSMC.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I think they just stay around like boeing basically, both of them will probably turn around at some point but you will probably do alot worse than the S&P over the next 10 years holding them since these problems have basically made them non competitive.", "score": 1, "replies": []}]}]}, {"body": "lol this thing has far to fall", "score": 1, "replies": []}, {"body": "I feel like how people say the government wouldn’t let intel sell to a company like Microsoft or nvidia but on the same token want to believe that they wouldn’t get bailed out by that government", "score": 1, "replies": []}, {"body": "I bought a bunch of shares at $19.19", "score": 1, "replies": []}, {"body": "No one is going to buy them.\n\nPlus the government would never approve it.\n\nIntel will probably be the only one standing after all this AI garbage goes away", "score": 1, "replies": []}, {"body": "https://preview.redd.it/1eb83h4b0zhd1.jpeg?width=1789&format=pjpg&auto=webp&s=fc5c34c68d76f7768db5956e1abe2b5d9719b753\n\n\"Intel Has Lost Wall Street’s Patience as Headwinds Keep Mounting\" [https://www.bloomberg.com/news/articles/2024-08-07/intel-has-lost-wall-street-s-patience-as-headwinds-keep-mounting](https://www.bloomberg.com/news/articles/2024-08-07/intel-has-lost-wall-street-s-patience-as-headwinds-keep-mounting)", "score": 1, "replies": []}, {"body": "Intel can never be a takeover target due to antitrust regulations", "score": 1, "replies": []}, {"body": "Nationalize Intel, secure chip manufacturing for the future and build the government's technological capabilities and knowledge. Build out a public sector cloud offering as an alternative to Amazon; partner with public institutions like libraries and public schools to reach all communities. Do it right with proper public scrutiny, competitive compensation, but get things done in a non shady manner and prove the government is capable of innovation again. Regain the trust of everyday Americans. Like the space race but for AI.\n\nWon't happen, but a guy can dream.", "score": 1, "replies": [{"body": "Nationalize? What are you, a commie?", "score": 1, "replies": []}]}, {"body": "Intel is a broken company it’s not investable", "score": 1, "replies": []}, {"body": "Dead money", "score": 0, "replies": []}]}
