{"title": "Billionaire Paul Singer trying to explain missing out on NVDA", "selftext": "Elliott Management said in its letter that it stayed away from “bubble” stocks included in the Magnificient Seven group.\n\nBillionaire Paul Singer’s Elliott Management has reportedly said in a latest letter to investors that mega-cap AI tech stocks are in “bubble land” and Nvidia is “overhyped.” The fund said in its letter that it’s skeptical about the notion that technology companies will keep buying AI chips in high volumes in the future.\n\nElliott Management last year posted a gain of 4.7%. 🤔", "id": "1etbpuc", "created_utc": 1723769716.0, "score": 102, "upvote_ratio": 0.95, "num_comments": 97, "comments": [{"body": ">Elliott Management last year posted a gain of 4.7%.\n\nSo basically worse than S&P500's 21.9% return for 2023.", "score": 79, "replies": [{"body": "Worse than some savings accounts.", "score": 54, "replies": [{"body": "I could have left cash uninvested in my S&S ISA and it would have done better than that.", "score": 9, "replies": []}, {"body": "Exactry! =)", "score": 1, "replies": []}]}, {"body": "Basically?  You could do better than that with a fucking HYSA at Ally Bank.", "score": 8, "replies": [{"body": "My UFB HYSA certainly paid better...", "score": 3, "replies": []}]}, {"body": "It's been proven a long time ago,over and over and over again, that Hedge Funds are for rich suckers....\n\n\"Why 90% of Hedge Funds Underperform the S&P 500\" - [https://medium.datadriveninvestor.com/why-90-of-hedge-funds-underperform-the-s-p-500-e518eab2b9c7](https://medium.datadriveninvestor.com/why-90-of-hedge-funds-underperform-the-s-p-500-e518eab2b9c7)\n\n\"Hedge Funds: A Poor Choice for Most Long-Term Investors?\" -  [https://blogs.cfainstitute.org/investor/2024/06/26/hedge-funds-a-poor-choice-for-most-long-term-investors/](https://blogs.cfainstitute.org/investor/2024/06/26/hedge-funds-a-poor-choice-for-most-long-term-investors/)", "score": 4, "replies": [{"body": "Most people don’t understand that hedge funds are for hedging. You don’t put your entire portfolio into one, you put a small percentage in as a hedge against the stock market going down (hedge funds hold assets other than stocks). It lowers return but so overall volatility. ", "score": 4, "replies": [{"body": "That is where their name comes from, but if you look at the strategies of many they not doing what many would call Hedging. It's just a name nowadays....", "score": 4, "replies": []}, {"body": "That is not what that means lol", "score": 1, "replies": [{"body": "Here is what the world largest hedge fund has [to say](https://www.citadel.co.za/citation/hedging-as-an-investment-strategy/). They do not claim to be to able to beat the market, the whole purpose is diversification through assets other than just stocks.", "score": 2, "replies": []}]}, {"body": "This is what I'll be doing if it hits 182. It's all coming out save for...5-10K shares and I'm putting it into a VERY diversified portfolio with bonds. \n\n  \nThen again...I've said that when I hit other landmarks and I...am still in.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Well...you don't have to. But I'll take some profits at that point. At 182, it becomes 8 figures for me.\n\nThat's...more than I could have dreamed of. I also lived through the \\~320 to \\~120 drop, so as I said, maybe I keep 5-10K shares.\n\nI'll also keep the shares in my Nephew's account.\n\nI'd probably add 4-5K shares to AVGO. That's got a better chance to 4-5X in the next few years than NVDA. and I think that's the #2 AI play.\n\nBut again, if they hit 182 in Q4 for example and Blackwell is coming out...who knows. I've set a couple targets and held as we sailed past them.\n\n  \nIt could be that...they actually do start taking some of the cloud share, that they keep evolving and they find other sources of revenue...or maybe I listen to MSFT, META, ALPHABET(if it doesn't get broken up...glad I sold there), AMZN, and other customers...and if they're not slowing down capex...\n\nWell shit, it's a great problem to have! Praise be to Jensen!", "score": 2, "replies": [{"body": "At your port size, you are fine to keeping doing what has helped get to this point. 👏", "score": 2, "replies": [{"body": "So...stay friends with the guy who kept pushing NVDA for the last 8 years, keep listening, and stay lucky? I'm trying!\n\nThe best advice I've gotten... find smarter people than you, listen, and try and absorb what they say...but be careful if they're a friend, understand they are just giving you the information they have now, it's not a guarantee.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "....LOL...it didn't even cross my mind.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "They have a 1.5% management fee and 20% performance fee... So the 3.2% left means they had 3.68% performance... WTF? I don't know any well established index funds that had less. Ffs. Verizon pays more in dividends and you don't need to do anything for that. Ufff", "score": 5, "replies": [{"body": "Well if you look at more than 1 year Elliot’s performance has been great….thats why he manages $50 billion + dollars and you play with Wendy’s money", "score": 3, "replies": [{"body": "I moved to a shawarma place. Wendy's was getting crowded", "score": 8, "replies": []}]}]}, {"body": "Wonder if they subtracted their management fees from that? If they didn’t it was likely much less than 4.7 percent for their client gains.", "score": 1, "replies": [{"body": "Yeah usually the published number is net", "score": 1, "replies": []}]}, {"body": "When your fund posts lower than Prime Rate gains….", "score": 1, "replies": []}]}, {"body": "My Mom's savings account at Bank of America did better.", "score": 53, "replies": []}, {"body": "One of the biggest myths about the stock markets is the ancient \"wisdom\" that keeps getting spewed at everyone as if success in the market can usually be traced back to the same old habits and behaviors. My pet peeves are fundamentals, but technical analysis can be just as ridiculous. The same set of numbers keep getting discussed, and the same fortune teller hocus-pocus referred to with charts. \n\nNo, a high P/E does not necessarily equate to a bad investment, and no the chart patterns do not necessarily indicate future performance any more than your palm can enable someone at Coney Island to tell you your future. It never has been, nor will it ever be THAT simple. \n\nBUT, understanding the company and the market they compete in? AH HAH!!! That's why I only throw cash at the tech sector. It's my business. I understand it at the operations and R&D levels. I get it. It's just too bad most of the mouthy mavens don't.", "score": 20, "replies": [{"body": "I used to invest in tech only without paying attention to technical analysis. Sometimes even though you have a great company in what looks like favourable competitive conditions the price goes down. I’ve found TA can be really useful for identifying where the tops and bottoms are likely to be so you can time your buying and selling. It’s not perfect but it has had a significant impact for me.", "score": 5, "replies": [{"body": "Oh sure, as a tool to help identify short term trends, absolutely.", "score": 2, "replies": []}]}, {"body": "while its logical that companies which are fundamentally good should do good in the stock market, the sentiment of the smart money (not us) dictates the course of the charts.", "score": 2, "replies": []}, {"body": "Suppose a machine that prints money prints $100,000 a year.  \n\nHow much would you buy that machine for?", "score": 2, "replies": [{"body": "You're just asking bond rates in a roundabout way, that doesn't at all extend to the dynamics of an actual business.", "score": 2, "replies": [{"body": "This question  has nothing to do with bonds yet.  \n\nIts a simple question. How much are you willing to pay for a machine that prints money.  \n\nThis machine could be anything. It could be a business or it could be a B100 gpu. Don't make it more complicated than it is and dodge the question", "score": 1, "replies": [{"body": "I'm not dodging, I'm cutting to the end/chase. \"Yet\", as you said yourself.\n\nYou're not even addressing that the machine doesn't distribute earnings, they are retained and reinvested. So a machine that prints 100,000, but doesn't hand them to you but invests in more and better machines; you buy a fraction of the rights to the company that owns the machine.\n\nHow about you state your whole thought instead of trying to set up a hobbled path to a lackluster gotcha? Save us the time and energy and share your whole, magnificent idea.", "score": 2, "replies": [{"body": "If you cant even answer a simple question without going into all the  add ons you just typed, it means you dont know.\nI've been in NVDA since 2019, I'm here to teach you, but you prefer to stay ignorant. Good luck", "score": -2, "replies": [{"body": "Lmao. Just answer your own question if you're here to teach - which you obviously are not.\n\n\nI've been in longer so, GoOd LuCk? 🤣", "score": 2, "replies": []}]}]}]}]}, {"body": "Therein lies the difference between the aged and simplistic wisdom lingering the markets like a fart in an elevator, and tech stocks. \n\nMost people would think about the $100,000. That doesn't phase me a bit. \n\n- What kind of dollars are they? Because the dollar sign by itself doesn't necessarily represent US dollars. In fact it isn't legally tied to any currency. So if it's rupees, from my perspective it prints about $1200 a year. So I wouldn't even bother. \n\n- The status of said machine was never mentioned. Is it LEGALLY printing them? Are they bona-fide notes? Because I have a few laser printers that can print any denomination I send to it. But the problem is I can't spend it anywhere or else I'll be committing to a 30 year camping trip by way of the Secret Service. \n\n- How big is the machine? Would I have to build a structure to house it? Do I need a truck to transport it?\n\n- How about electricity? Is it gonna cost me $24,000 to run the printer over the course of a year?\n\n- What about serviceability and maintenance? How much does it typically cost to keep it running? How much are the parts? How much is the ink/toner? Does it need special paper? How much is it?  \n  \n- Are there any sort of permits for ownership or licenses required to operate it? How much are they? Around here a license to sell beer can cost mid to high 5 figures. \n\n- Are there any sort of required inspections like with scales and gas pumps?\n\n- Any available tax credits?\n\n- How much does it typically cost to insure?\n\n- Does said insurance cover failure?\n\n- Does it have a warranty? How long is it? What does it cover? Parts and labor? Just parts? Just labor? Are wear items excluded? What exactly is considered a wear item?\n\n  \n...and there's the difference between an investor and a chart-chaser.", "score": 1, "replies": [{"body": "If you cant even answer a simple question without going into all the nonsense add ons you just typed, it means you dont know.  \n\nI've been in NVDA since 2019, I'm here to teach you, but you prefer to stay ignorant. Good luck", "score": 1, "replies": [{"body": "Sounds great, but I gave you an answer. I don't invest anything substantial unless I understand what I'm putting my money into. You may approach things differently, but I go through the whole business with respect to......\n\n- Where did this come from?  \n- Are there any potential legal issues that may be a problem?  \n- What are the potential manufacturing issues? Are their options to address/resolve said issues, or is this a make or break situation?  \n- How are they going to sell it? What's the big value prop?  \n- What is their competition?  \n- What is their potential market share for the flagship product?  \n- What is their potential to overtake the market share of others with existing technology in the same space?  \n- Profit margin?  \n- Are they potentially causing any environmental issues?  \n- Is there potential so great that they one day could be accused of monopolization? If so, are their operations such that they can easily be broken up and still function as well?\n\nThat's just some of the basic stuff. Most I've answered, but for the time being a few can remain unanswered. As far as the stock, it doesn't take much to figure out the potential for the stock to triple from its current price over the next 3 years is definitely there. \n\nAs far as educating me, that was months ago. That legwork has already been done.  I'm in for about 900 shares across a few accounts. The same goes for AMD, with a little less AVGO.   \nSo that ship has sailed, but thank you anyway!", "score": 1, "replies": []}]}]}, {"body": "$222,222", "score": 1, "replies": [{"body": "So thats only 2.22 PE multiple.  \n\nNow you know your risk appetite is far lower than you think it is.  \n\nFor Nvidia to hold true to this number, you would have to think it be able to benefit your entire life.  \n\nRemember, this is your number. Not mine", "score": 1, "replies": []}]}]}]}, {"body": "🤣🤣🤣🤣......wait there will be more coming out saying thst thus \"bubble stock\" is too volatile. When it hits 1000 again they'll be saying the same thing 🤣🤣🤣why i manage my own money", "score": 5, "replies": []}, {"body": "He has some serious explaining to do to his investors who aren’t going to be happy with gains that were out for the taking but someone is not doing their job right.", "score": 8, "replies": [{"body": "4.7%…really? Why is he giving his opinion on investing in tech or ANYTHING!", "score": 6, "replies": []}]}, {"body": "I almost feel bad for him", "score": 13, "replies": [{"body": "He’s a billionaire, save your sentiment for someone deserving.", "score": 15, "replies": []}]}, {"body": "Could have put in a CD and still have better performance", "score": 7, "replies": []}, {"body": "Pessimism is expensive", "score": 7, "replies": []}, {"body": "Sounds like bro missed out and is crying about it.", "score": 3, "replies": []}, {"body": "You underperformed GIC’s dude.", "score": 5, "replies": []}, {"body": "You’d do better just letting your money sit in a brokerage account where the MM fund has a better rate", "score": 2, "replies": []}, {"body": "August 15 - ARM Holdings plc ARM shares are trading higher today following the news that Elliott Management, a well-known activist hedge fund, has added to its position in the company.", "score": 2, "replies": []}, {"body": "Sometimes you are too smart for your own good. Overthink, overanalyze, over-optimize, which gets you crap returns.", "score": 2, "replies": []}, {"body": "I’m not judging what this guy says either way - but you NEVER judge an investment fund based on only one year performance. \n\nAs Buffett says judge on five years minimum.", "score": 2, "replies": []}, {"body": "Is 4.7% even covering inflation?", "score": 2, "replies": [{"body": "Yes", "score": 1, "replies": []}]}, {"body": "This is the idiot who bought a large stake in Southwest without understanding anything about what differentiates the company.", "score": 2, "replies": []}, {"body": "Nice excuse for performing worse than a T Bill…", "score": 2, "replies": []}, {"body": "The story on this is that Elliot Management probably bought high and sold low on Nvidia and they have been trying very hard to shill down the price. Their low engagement posts have been everywhere for the past 2 weeks appearing in all the stock interests subs.", "score": 2, "replies": []}, {"body": "Well they missed out while we did much better than 4.7%. I mean the 3 month treasury is 5.2%.", "score": 2, "replies": [{"body": "He has hundreds of employees and billions of boomer dollars.  \nHis opinion is jaded from a bruised ego. \n\nHow many investors emailed him in the past year wondering “wtf dude…my grandkid made 186% last year buying this f$&king Nvidia stock”", "score": 1, "replies": []}]}, {"body": "My HYSA from AMEX did better", "score": 2, "replies": []}, {"body": "Is Idiot rhyming with Elliot?", "score": 2, "replies": []}, {"body": "It’s almost as if he belongs in WSB", "score": 1, "replies": []}, {"body": "Invest like a pus, get pus $", "score": 1, "replies": []}, {"body": "Hey Pauly....well played......to all his clients..YOU SHOULD FIND A NEW FINANCIAL ADVISOR...!!", "score": 1, "replies": []}, {"body": "Why would anyone risk their money with them for returns like that? Bonds and GICs pays that much.", "score": 1, "replies": []}, {"body": "How do these assholes become billionaires with investment acumen like that?  I've made almost 125% over the last year with a variety of tech stocks.  If/when the winds shift and other sectors stand to replace them at the top I'll move, but that's not going to happen for a while.", "score": 1, "replies": []}, {"body": "One oof size extra large please", "score": 1, "replies": []}, {"body": "We'll at a 3T market cap it is somewhat difficult to maintain in the long term. Their profit margins are huge, meaning customers will and make no mistake they will find alternative vendors in due course.", "score": 1, "replies": [{"body": "They will have to follow through with their ambitions outside of AI into software", "score": 1, "replies": []}]}, {"body": "Bubble = something I did not buy that went up\n\nOvervalued/hyped = something my colleague bought that went up", "score": 1, "replies": []}, {"body": "Money sitting in webull earns 5% apy waiting to make trades with...", "score": 1, "replies": []}, {"body": "Paul  or anyone else that thinks AI is a bubble doesn’t deserve to have investors", "score": 1, "replies": []}, {"body": "His right about this iteration. The market will adopt them, pause, but then the Symbian of AI will get replaced by Android and Apple of AI. And in this pause it's likely to continue climbing slowly. Maybe not explode exponentially.. that is until the next generation hits market.", "score": 1, "replies": []}, {"body": "Dude sounds salty af", "score": 1, "replies": []}, {"body": "Sounds like COPE", "score": 1, "replies": []}, {"body": "Is the 4.7% gain BEFORE deducting their management fee, lol? If so, then it might be more like a 3.5% gain and less than what clients would have earned in a HYSA?", "score": 1, "replies": [{"body": "I can see why he’s pissed. These plebs with trading accounts cleaning up lol", "score": 2, "replies": []}]}, {"body": "That's what say infact they want to scoop I'm discount. Hold tight!", "score": 1, "replies": []}, {"body": "Saw someone on CNBC a few days ago say the same thing, only evidence he had was pointing to the stock and claiming it was in a downtrend (which serious lol after this week). Seems like “bubble” is the only thing these guys have to say as an excuse why they chose to not participate at all in what will be considered a generational investing opportunity. I started investing in Nvidia heavily since last year because the people who were advocating the bull case brought facts and analysis to the conversation, and in general the real data I was consuming was all pointing to an incredible opportunity. While the bears where entirely scare tactics, gossip, or just general grumpiness. Feels like a real lesson in reading through what people are actually saying and ensuring you’re making investment decisions based on real data and not just someone’s opinion.", "score": 1, "replies": []}, {"body": "Heck, I did 22% last year on my own!!", "score": 1, "replies": []}, {"body": "Singer done sang his song…sounds a little flat!", "score": 1, "replies": []}, {"body": "I’d sell 450 of them.\n\nBuy 250 NVDA \n\nSave,\nPay off debt  and buy home", "score": 1, "replies": []}, {"body": "Sure a company that makes 50+ percent net earnings is in bubble territory", "score": 1, "replies": [{"body": "Yeah well nvidia is a $3-4 trillion company that only earns $40 billion in revenue. That means that 5x growth is already baked in", "score": 2, "replies": [{"body": "60B in revenue", "score": 1, "replies": []}]}]}]}
{"title": "What percent chance would you give of NVDA hitting $150 per share before mid-October?", "selftext": "", "id": "1etkng1", "created_utc": 1723801644.0, "score": 16, "upvote_ratio": 0.69, "num_comments": 80, "comments": [{"body": "Just check to see what Nancy Pelosi is doing with her stock.   Her moves are my new financial advisor", "score": 21, "replies": [{"body": "where do yall check that btw? twitter? some sub here? would really like to know where news about her trades get posted the fastest", "score": 4, "replies": [{"body": "Politician trade tracker on ig. Quiver quantative on twitter. I follow both, but ptt will always post new trades as soon as he can", "score": 10, "replies": [{"body": "aight thanks a lot!", "score": 4, "replies": []}]}]}, {"body": "She could have already sold and u wouldn't know", "score": 3, "replies": []}, {"body": "Yeah that isn’t good advice considering they need to report right away…I think it’s either 60-90 days AFTER they make a move. She could have sold everything and you wouldn’t find out for 2 months.", "score": 1, "replies": [{"body": "It wasa joke", "score": 1, "replies": [{"body": "Some people will think you are 100% serious and you already have people asking how they check the moves of congress…", "score": 1, "replies": [{"body": "Then those people should not be playing with stocks", "score": 1, "replies": []}]}]}]}]}, {"body": "Let's calculate:\n\nATM it's $122. It could be possible that it will reach $130 before earnings. The day after earnings, it will be 10% higher so $143. So it has 2 weeks left to climb $7.\n\nShould be possible", "score": 39, "replies": [{"body": "Was thinking similar.", "score": 3, "replies": [{"body": "The biggest unknown is that the market seems to be in a broad rally at the same time the run up to earnings date is occurring. Could be good, could also be bad as expectations after ER are so distorted that even a very, very good quarter with good higher guidance might be deemed \"not good enough\" then there is a fall again - which is likely another buying opportunity. Probably not the 90s we saw but certainly a chance at the mid 110 levels", "score": 3, "replies": [{"body": "We shall see. I’d be all for it if that happens.", "score": 2, "replies": []}]}]}, {"body": "why it will rise before earnings?", "score": 4, "replies": [{"body": "Because everybody expect good earnings so everyone wants to get the sweet 10-20% after earnings. But there is a very high chance that they also will take the profits out after that", "score": 4, "replies": [{"body": "If it rise too high, which means that it has already priced in good earnings. Then after earnings, it will drop?", "score": 4, "replies": [{"body": "Think this way, drops are temporary tho, u wanna sell at $140 then buy back in at $120 if you bought at $92-105?  U lose multiples of percentages as it continues to rise.\n\nTime in the market is better than timing the market.", "score": 4, "replies": [{"body": "That's right. I think Nvidia will hold his good position for the next 5-10 years like Microsoft and Apple did the last decade. I don't see any potential competitor for nvidia. China Taiwan conflict is the only dangerous determinant. But if this will escalate, we will have other problems then nvidia stock...\n\nIt should be a good invest for the next years.", "score": 1, "replies": []}]}, {"body": "Yes", "score": 0, "replies": []}]}]}]}, {"body": "100%… it’s climbed $20 in the last week!  and It was already at $140 in June before rotation, and taking profits. jmo!", "score": 7, "replies": [{"body": "It climbed $20 last week! So it may very well fall $10 next week. It's not going to go up $20 a week forever my friend.", "score": 2, "replies": []}, {"body": "👍🏻", "score": 2, "replies": [{"body": "99.99%", "score": 0, "replies": []}]}]}]}, {"body": "Shit it’s gonna be $160 by end of September. Better load up now boss.", "score": 17, "replies": [{"body": "Facts. Nvda doesn’t fail from sales. It fails from not producing fast enough 😭 we have back orders that haven’t been filled. If production time has gone down, price is shooting up", "score": 3, "replies": []}]}, {"body": "96.456436897531819016%", "score": 6, "replies": [{"body": "$152.63", "score": 1, "replies": [{"body": "How did you conclude that it'll be at 152.63?", "score": 1, "replies": []}]}]}, {"body": "Are your calls expiring and you’re nervous? Lol", "score": 7, "replies": []}, {"body": "will be at 200 by christmas easily.", "score": 4, "replies": []}, {"body": "With macro winds at its back, everything depends on outlook. Hitting numbers is not enough, we need to know that we're 3 years into a 10 year cycle not 8.", "score": 3, "replies": []}, {"body": "IMO less than the chance of it falling to $100.", "score": 3, "replies": []}, {"body": "I truly think it’ll be $160 after September", "score": 3, "replies": []}, {"body": "I'm thinking 140 by end of coming week and 150 day before earnings... called it two weeks ago that Friday it will touch 125 and it did yesterday... let's hope my other numbers come out correct. 165 before end of month and $175 before end of September.", "score": 3, "replies": []}, {"body": "Based on my calculations…. 32.3333% (repeating, of course).", "score": 5, "replies": [{"body": "Leeeeeroooyyyyy", "score": 1, "replies": [{"body": "Haha someone got the reference.", "score": 1, "replies": [{"body": "Unfortunately I am chronically online and have been since the early 2000s.", "score": 1, "replies": []}]}]}]}, {"body": "69%", "score": 2, "replies": [{"body": "Came here to say this", "score": 1, "replies": []}]}, {"body": "69%", "score": 2, "replies": []}, {"body": "50/50…it’ll be either higher or lower than $150 by then", "score": 2, "replies": []}, {"body": "100%", "score": 2, "replies": []}, {"body": "Looooal October?! They might hit it today....this is a Vegas Son", "score": 1, "replies": [{"body": "Break out the greeny leafy spendy money", "score": 1, "replies": []}]}, {"body": "Maybe EOY.", "score": 1, "replies": []}, {"body": "70", "score": 1, "replies": []}, {"body": "Fidelity option chain gives it 16% probability of profit… I give it 116% probability let it rip, Stonks only go up!", "score": 1, "replies": []}, {"body": "By earnings next week", "score": 1, "replies": []}, {"body": "Higher than -1%.", "score": 1, "replies": []}, {"body": "50-50-25", "score": 1, "replies": []}, {"body": "95%", "score": 1, "replies": []}, {"body": "I bought a few more shares!", "score": 1, "replies": []}, {"body": "I reckon highly likely", "score": 1, "replies": []}, {"body": "Going down after earnings", "score": 1, "replies": []}, {"body": "It’s volatile- it’s goes up and down all the time but in the long term the graph shows an incredible upward trend - so perhaps", "score": 1, "replies": []}, {"body": "37%", "score": 1, "replies": []}, {"body": "0% chance", "score": 1, "replies": []}, {"body": "I ran the simulation.  64.2879%", "score": 1, "replies": [{"body": "Never tell me the odds !", "score": 1, "replies": []}]}, {"body": "Just ask liberty mutual", "score": 1, "replies": []}, {"body": "Very little . Good news is baked in", "score": 1, "replies": []}, {"body": "69%", "score": 1, "replies": []}, {"body": "It could possibly hit the skids at around 80 before earnings", "score": 1, "replies": [{"body": "I'd love to hear what supports this theory", "score": 1, "replies": []}]}, {"body": "Remember it’s an election yr and historically w no incumbent markets struggle in October…", "score": 1, "replies": []}, {"body": "A vision", "score": 1, "replies": []}, {"body": "Definitely yes, it will hit $150 if not more", "score": 1, "replies": []}, {"body": "30% before 28th and 60% for December.", "score": 1, "replies": []}, {"body": "100", "score": 1, "replies": []}, {"body": "10%", "score": 1, "replies": []}, {"body": "Tell you what, if it does I am selling my entire position.", "score": 1, "replies": []}, {"body": "50/50", "score": 1, "replies": []}, {"body": "Three fiddy", "score": 1, "replies": []}, {"body": "Three fiddy", "score": 1, "replies": []}, {"body": "Haha 125% for some reason this stock KEEPS ROLLING!!! 150 Aug 29th one day after earnings! $25 more by October min … any one agree or you bears still pissed", "score": 1, "replies": []}, {"body": "November. Currently going down", "score": 0, "replies": []}]}
{"title": "NVDA play as earnings approach", "selftext": "What's your play?  I got this long call (that's in the green) and I'm thinking about rolling the dice and holding it through earnings.  Might sell a CC against it if nvda continues to go up prior to earnings.", "id": "1etmqam", "created_utc": 1723809117.0, "score": 44, "upvote_ratio": 0.97, "num_comments": 66, "comments": [{"body": "I bought calls expiring Aug 30 for pretty cheap when everyone thought we were heading towards recession. So far, the contracts have brought +$700. I assume it will go up a bit more next week. I will definitely sell them before earnings. Maybe on the 27th. I still have Zero idea how people hold on to their calls post-earnings and still make $$. Every time I have held past earnings, I've (IV) been crushed.", "score": 25, "replies": [{"body": "That's why I don't buy calls that expire right after earnings. I like to get ones that expire a few weeks after the following earnings. So in this case, Dec 20, 2024. Or I just buy LEAPS.", "score": 11, "replies": [{"body": "I think you are right on. i usually buy a couple of months out and keep between earnings as much as possible.", "score": 3, "replies": []}, {"body": "I hear ya but those with high Delta(time) are normally way more expensive that I like to spend. I try not to spend more than 5% of my account holdings on options.", "score": 1, "replies": [{"body": "Same bro, couple of months out works best for me, leaps are way too expensive and gains aren’t as enticing for the amount of money getting locked up. I’d rather buy stock at that point if i am going that long and not worry about any of the risk that comes with options. But thats just me, to each their own.", "score": 3, "replies": []}, {"body": "So, I am not an options expert and similar to you limit my options trading to under 5% (honestly probably closer to <1% across all holdings). \n\nWhen I was first starting with options I would also go for near-term exp dates. Over time I have changed to pretty much only buying 1+ month out, usually 2-8 months. \n\nYes, they’re more expensive, but been burned by theta too many times after being lured by low premiums. Set stop loss, keep an eye out, and buy fewer contracts. I also tend to exit options when I make 400-700%, I’m not holding out for a 12,000% gain. \n\nThis assumes your intention with options trading is not to become a YOLO overnight options millionaire but instead to just bolster your positions with some riskier but rewarding upside.\n\nEdit to add: again reiterating that I am *not* any type of expert here, if others have input on what I wrote above I’d love to hear it.", "score": 2, "replies": []}]}]}, {"body": "NVDA has a history of gapping upward and ending the day following earnings about 4.8%. \n\nHow many times have you held NVDA calls past earnings?", "score": 3, "replies": [{"body": "I should have clarified. I haven't held NVDA post earnings. Mostly other stocks. I think the last one I held hoping for some upward trend after earnings was AAPL.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Be very careful when you sell higher OTM calls after earning. NVDA has crushed ERs the last 3 times, and is expected to crush this incoming one as well. If it does, it will shoot up to 150 or 160 in a week. Your strategy will backfire.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "If thats the case and the chance for it to shoot up is higher than the chance for it to go down, why sell CCs?", "score": 1, "replies": []}]}]}, {"body": "Interesting. Any Youtube videos that you recommend that goes a bit into detail about this strategy? Sorry still a rookie here.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Awesome. Thanks dude. Appreciate the response.", "score": 1, "replies": []}]}]}, {"body": "steer sheet toothbrush smoggy deranged simplistic thumb hungry shame tender\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": [{"body": "Not if you buy ITM", "score": 1, "replies": []}]}]}, {"body": "For how much and when?", "score": 1, "replies": [{"body": "115 expiring 8/30. Currently $755 up (not much, but for me as a rookie, this is OK).", "score": 4, "replies": [{"body": "What date did u buy them I’m curious\n\nI don’t ever remember the ATM contract for 8/30 ever being this cheap", "score": 1, "replies": [{"body": "Well I am not sure if it was cheap, ha. But it was on 8/12 for an average cost of $540. Was going to put up a screenshot but this subreddit apparently doesn't allow images. Or I am a regard. Probably the latter all things considered man.", "score": 1, "replies": []}]}]}]}, {"body": "Same here hehe", "score": 1, "replies": []}, {"body": "Agree on buying calls for earnings play when iv is super high is asking for iv crush. I was lucky enough to buy 2 separate long dated calls Sept and Dec when the market tanked a couple weeks ago. Both of these calls I'm up 35K and 57K respectively at the moment.", "score": 1, "replies": [{"body": "What a fucking playa man. Congrats. You clearly saw the long haul. I am not sure what the fuck I was doing then. With the recent uproar about ASTS, that's kinda what I am thinking of doing. Looking for ASTS price to dip/correction before I buy a long haul calls.", "score": 1, "replies": []}]}, {"body": "It’s because usually they buy options with a lot of time on the contracts. Think 1-2 years of time.", "score": 1, "replies": [{"body": "Yeah with *hot* stocks this is likely a good strategy, but isn't this a super gamble? I feel like you need to have a pretty good faith in the stock to buy a 1 year calls. Maybe that is the right way of doing things. Just confused as a rookie.", "score": 1, "replies": [{"body": "No worries. Nothing wrong with asking genuine questions. You’re not obligated to see those contracts until the end of their expiration, you only buy that much time on your options if you have the conviction it’ll go up and have patience.\n\nIts far less risky than buying options with only a month or two (or six) months left, because if it goes down you’re forced to make a tough decision on losing a bunch of money, or lose more while you hope it rebounds, all while your contracts get eaten each day significantly.\n\nHaving a 1-2 year leap allows you to breathe in the situation where you’re in the hole. If it goes up a lot over time then you can take your money out when you see fit, and move onto the next.", "score": 1, "replies": []}]}]}]}, {"body": "I averaged down way out of the money calls during the flash crash recently. I am currently sitting on 30 $155 Aug 30th calls and I am like 100% sure it will not reach that strike price. I plan on selling 10 contracts on the 23rd, 15 on the 27th and sell last 5 on the 29th. I've had my stomach punched in with IV crush before and I'm trying to not do that again.", "score": 10, "replies": [{"body": "Are you up on this position", "score": 2, "replies": [{"body": "I am currently down ~~11%~~ 30% | The swings are real. At one point I was down 65% and just clenched my butthole and stuck to the plan.", "score": 6, "replies": []}]}, {"body": "what is the IV crush does ? and is it bad or good for your options ?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "PRicEd iN", "score": 3, "replies": []}, {"body": "Exactly this. Meta and other Mag 7 keeps increasing their cap ex on NVDA. It will blow every expectation this time too.", "score": 2, "replies": [{"body": "Blow like in blow or blow as in blow?", "score": 1, "replies": []}]}]}, {"body": "Buying OTM 23AUG calls. Those gamma’s are looking juicy and I reckon there’s enough hype from retail investors to cause a little pinch before earnings.", "score": 7, "replies": [{"body": "I also bought the 23aug 125 call...2 of them.  Up 130 on the first trade, down a little on round 2", "score": 2, "replies": []}]}, {"body": "I only have shares, not even a lot, 15.\n\nReactions to earnings this season have been so unpredictable. Good earnings and stock dropping, bad earnings and stock skyrocketing etc. So I've decided to sit this one out and instead probably enter some options contracts after earnings. Because if there's either a positive or negative reaction to NVDA earnings, in my opinion that reaction will not be just for 1 day or 2, but rather for couple weeks at the least.\n\nI will continue holding the shares through earnings but will set some stop loss orders.", "score": 10, "replies": []}, {"body": "In the same position, be careful with the CC though I had to close mine at a small loss because NVDA went up too fast", "score": 3, "replies": [{"body": "I was foolish to do cc during the dip. I’m in cc jail where I’m constantly rolling out and out", "score": 3, "replies": [{"body": "Same boat lol fml", "score": 2, "replies": []}]}, {"body": "Same", "score": 2, "replies": []}, {"body": "Don’t understand how a covered call can result in a loss if the stock spikes?\n\nIs it a synthetic CC you’re referring to?", "score": 1, "replies": []}]}, {"body": "Earnings plays are always tricky.  Covered calls can be a good strategy to lower your cost basis, but if NVDA blows out earnings your upside is limited.  Personally, I'd consider taking profits now and re-evaluating after the announcement.  Big moves in either direction are likely.", "score": 5, "replies": []}, {"body": "what do you expect the call's premium loss due to IV crush / vega drop to be the day after earnings? look at previous cycles for your delta, and look at vega before/after, and come up with an estimate. or exit the position before earnings....  \n\nor spread it as you suggest. just be aware and have a plan for exactly what you do if your sold call goes ITM and you get assigned on that (sell 100 NVDA / contract @sold call strike price) will your broker exercise the long call? it is NOT a CC if you don't actually have shares, but the long call should cover the short call. if you have doubts about how this will work, call your broker in advance. if you turn it into a call spread and NVDA keeps going up before earnings, just know that your loss on the short call to exit before earnings could be *substantial* - but obv would be offset by the higher value of the long ITM call.", "score": 2, "replies": [{"body": "How/where do I look up previous cycles for options?", "score": 1, "replies": [{"body": "You’d need some kind of market replay or historical data or back tester. Thinkorswim has ‘on demand’ for example you can go back and see / trade days from the past including options chains", "score": 1, "replies": []}]}, {"body": "From my understanding the cost of the long call plus that strike gives you a good idea of what strike to sell on the short call.  Also read you want a delta of at least .2-.25 difference on your calls.  I will sacrifice a little in the short call to give me added buffer/profit.", "score": 1, "replies": []}]}, {"body": "Calls this week expiring next week. Wait for the volatility spike, exit. Earnings call contracts are going to be ridiculous premiums", "score": 2, "replies": [{"body": "To clarify, your saying to sell calls this week and exit a day or two before earnings?", "score": 1, "replies": [{"body": "No I would buy calls this week expiring next and capture the spike. Then sell options week of earnings when the premium is juicy for the weekly’s", "score": 2, "replies": [{"body": "I personally think the price will run up to 130ish by next week. Earnings week may turn into a bloodbath given this is probably the most anticipated earnings report coming out this quarter", "score": 2, "replies": []}]}]}]}, {"body": "Havent looked yet.\n\nConsidering a calender to get a longer option cheaply, shorting earnings vol and buying something further out.", "score": 2, "replies": []}, {"body": "Up down, pick one. Don't listen to anyone on here, no one actually knows where it's going", "score": 2, "replies": []}, {"body": "Bought in on 111 on an average at the beginning of this and sold covered calls on my full position at 129 exp 30th of August. I have 4 dollars hedge from 122 with this setup and also a run of 7 dollars upwards until then. Which seems insanely probable right now lol.\n \nI also have some calendar spreads with 140 exp on the 30th of August vs Nov options.", "score": 2, "replies": []}, {"body": "I have 130 and 140 calls for earnings, with the intention of selling the 130’s prior to ER. Depending on price I might hold 140’s through earnings.", "score": 2, "replies": []}, {"body": "NVDA diagonal call spread for ER filled @ 1.82$ beginning of the week, righ now @ 3.58$\n\n- BTO 1x NVDA $125c 9/13 3.38$ debit\n- STO 1x NVDA $130c 8/30 1.56$ credit\n\n\nlooking to close short $130c before ER and hold long $125c", "score": 1, "replies": []}, {"body": "5 nov15 115c\n\n31 oct18 140c\n\nWas down 18k in that crash, now almost back. Plan is to sell right before earnings no matter how up or down i am. That was the original plan when i purchased 2 months ago", "score": 1, "replies": []}, {"body": "It's a funny spot because everyone expects Nvidia to kill it yet again at earnings but it still seems like a good bet :)\n\nIt will be very interesting to see how it goes. I made my play afte Nvidia crashed and made very nice multiplier. I looked at the calls after earning today and imo they are not as attractively priced anymore.", "score": 1, "replies": []}, {"body": "I was going to sell ccs agony stock , some days before earnings with 7dte and then some ccs after earnings.", "score": 1, "replies": []}, {"body": "Holding for earning calls is risky in general, but with a volatile stock like NVDA, the risk is amplified several times over. \n\nIf the earnings call is good, you’ll see a rise in the stock price for sure, but with all the swings in the NVDA price, I think you’re better off with weekly calls  and the week of the earnings call you can make your bet then. \n\nThis path mitigates a ton of risk.", "score": 1, "replies": []}, {"body": "We all know that Nvidia well report to the upside in terms of sales and revenue, but how much of that is already priced in.?", "score": 1, "replies": [{"body": "Almost all of it.  But it they miss, it gets crushed.  Seems like there is more downside due to great expectations.\n\nBut FOMO is real", "score": 2, "replies": []}]}, {"body": "A variety of OTM and ATM Put and Call spreads and butterflies.", "score": 1, "replies": []}, {"body": "I bought 2 calls for NVDX to get 2X exposure to NVDA. $16.50 and $19.50 strikes. They expire 9/20. I’m betting NVDA will do well in earnings. This is my first experience with leveraged instruments. Any thoughts?", "score": 1, "replies": []}, {"body": "I’m bullyish on the direction after earnings and planning on doing a put credit spread in stages. Firstly buy a protective put around 117 ~30DTE early next week and then closer to earnings sell the upper put to profit on the higher premiums (IV). Haven’t tried the strategy before but it makes sense in my head. Worst case I’m back to last week’s P&L", "score": 1, "replies": []}, {"body": "Genuine question. If I weee a hedge fund that owns a lot of Nvidia stocks, won’t I just buy a lot of puts and then try to trigger a price crash by dumping right before earnings to make the calls worthless?", "score": 1, "replies": []}, {"body": "I advised my dad to sell ITM puts last week as weekly’s. Closed out 100% gains", "score": 1, "replies": []}, {"body": "Double calendar spread 90,140 8/16-9/20", "score": 1, "replies": []}, {"body": "I usually invest long term and don't deal in options that much. I have been wanting to de-risk a little before the earnings, so I was thinking of buying some puts few points below current stock price for Aug 30, and then sell Jan 25 calls against my position to fund the put. The call strike will represent 30-40% upside from here. It's not unlikely for a stock like NVDA to hit that if things are positive, but my stock gains would be pretty significant and I can roll the call if needed. If things are negative, I might exercise the put depending on how bad it is . Sounds like a solid strategy on paper, but experienced option traders, can you comment? :)", "score": 0, "replies": []}]}
{"title": "Selling Covered Calls on NVDA", "selftext": "[deleted]", "id": "1eu3hpa", "created_utc": 1723851559.0, "score": 71, "upvote_ratio": 0.91, "num_comments": 93, "comments": [{"body": "Yeah that’s how covered calls work 🤷🏻‍♂️\nI like Nvidia in the long run but your strategy is sound. Some things to consider: have you held the shares longer than 1 year so as to not have to pay short term cap gains in the event of being assigned? Do you hold in a Roth? Buying an S&P500 fund with the proceeds of assignment @145 allows you to be exposed to Nvidia still, seeing as the stock makes up 5-7% of most of these funds. I say go for it! I would probably do the same if I owned 400 shares, depending on what the rest of my portfolio looked like.", "score": 21, "replies": []}, {"body": "if you're willing to sell at 145 then go for it, it's what covered calls are for", "score": 59, "replies": []}, {"body": "Don't forget that you can diversify within your covered calls: you don't need to write all 4 contracts at the same strike, the same expiration month, or even at the same time.\n\nYou might consider, for example, writing one for the end of August (around earnings) and one for September but hold off on writing the other two until earnings determines the right general range of strikes you would consider as a realistic exit point. Alternately, you could write the others now but for a higher price further out, reducing your regret if the stock rises while generating substantial premium now to go into your new strategy.", "score": 14, "replies": []}, {"body": "I use covered calls a lot. And would suggest always keeping some unlimited profit position. In this case, with 400 shares, sell 3 calls. Leave 25% for a bullish run up. \n\nIf you are bullish on NVDA.", "score": 11, "replies": [{"body": "Or you can sell 4 covered calls and with the premium, buy 100 more shares.", "score": 3, "replies": []}, {"body": "This. From experience.\n\nAnd as others have pointed out, consider closer dates to maximize theta. At some point there are few advantages to going out too far in time when selling.", "score": 3, "replies": []}]}, {"body": "Not the best idea . . .\n\nCCs profit from theta decay which ramps up around 60 days, so selling out longer is less efficient.\n\nAlso, you are likely going to have to wait until the call expires to either book the profit or see the shares called away. Waiting all that time may see the stock drop or spike up in price which can change the calculus of the trade.\n\nThink about selling 30-45 dte and then adjusting the strike when the trade expires. If it goes up to $145 or above the shares get called away, but if not you can open a new CC. If you do the math this should bring in more than $10K if the stock doesn’t spike up too soon.", "score": 37, "replies": [{"body": "Remember Nvidia reports earnings August 28.  $145 is well in reason", "score": 3, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "Yeah OP needs to know to sell options when IV is high (before earnings or during high market volatility) or when theta is going to decrease rapidly (options expiring soon).", "score": 5, "replies": []}, {"body": "Totally agree ! Every earning seasons would bring me quite a looot premium.", "score": 1, "replies": []}]}, {"body": "as others have mentioned, options premiums can be very high pre-earnings, so selling that $145 CC before earning is probably going to get you a good premium. I don't mind your original plan of a longer dated covered call. Jan '25 will get you $11/share which I would not describe as \"super-long\". 5 months, goes by quick... Cash that $~11x400 (~$4400)and let them be called away at $145 if it's there, if not, keep selling CCs. others are saying 30-45DTE which is the standard CC theta play, but it's only $3/share now for sept20th $145 calls. So maybe that $3/mth premiu/IV holds out and adds to more than $11 for 5 months, or maybe IV drops and you end up similar to $11 total over months with more work and more fees.... I'd take the $ in hand now, you can put that 4400 in your etfs now and start to earn dividends/cap gains etc faster than the every month CC plan....\n\n\nIt's basically a compromise between your plan of a 1yr+ CC and others 1-month CC plans...", "score": 3, "replies": [{"body": "Difference between selling 45dte and 5 month dte is the chance that your stock reaches stock price on 5 months is significantly higher than on 45dte. Therefore better accumulate 4x45dte and choose your strike price accordingly each time", "score": 3, "replies": []}, {"body": "This is a nice middle ground 👍 little bit of both", "score": 2, "replies": []}]}, {"body": "Just sell 45DTE $145 calls. Roll out once you hit 50% in profit to a new 45DTE.", "score": 5, "replies": []}]}, {"body": "The curve for theta decay everyone mentions is for at the money options (ATM). Curve for ITM and OTM options are more linear.", "score": 2, "replies": [{"body": "It still drops over time and ends at zero . . .", "score": 0, "replies": []}]}]}, {"body": "That’s what a lot of people do. Selling covered calls can make both parties a lot of money. It’s not a good long term strategy because eventually your contracts will get exercised, but you can probably make some really good money pretty quick. And if they do end up being exercised in say a year, or 6 months, depending on your average cost when originally purchasing, you’ll make good money there too. \n\n\n\nThis is what intelligent people do with their money, instead of buying calls, or yolo-ing like on wsb. I would look into spreads if I were you. If you want to make more money, and not have to lose any shares of nvda, consider spreads. Of course there is more risk, but if you’re confident in the company, it’s a good option. What’s great about spreads is that if nvda hits your strike, and the strike of the calls that you sold, you can exercise you calls, then use those to cover the owed shares. That way not only does selling calls offset the original premium you paid, but you will make profit buying from a lower strike, then selling at a higher. It’s a win win. And if you price your contracts properly, the value of nvda won’t be in the money for the calls you sold, and you might get to keep the shares of nvda from the calls you exercised, and the premiums from the calls you sold.", "score": 11, "replies": [{"body": "Does anyone ever do covered call credit spreads?", "score": 2, "replies": [{"body": "Ooh! I do...only on spy, mag 7 or tsla for liquidity.", "score": 1, "replies": []}, {"body": "A credit spread as in the difference in the yield between two assets? I’m confused by what you’re asking", "score": 1, "replies": []}, {"body": "Wondering the same. Like selling shorter dated calls against LEAPS calls, for premium? Is that a credit spread and PMCC? And debit spread when one pays more for a call than premium received at a higher strike? (Confused by terms.)", "score": 0, "replies": []}]}, {"body": "I eat crayons, can you go more in depth? Walk me through an example. Let's say I have a cost basis of 200 nvidia for 100", "score": -1, "replies": [{"body": "basically read this:\n\nhttps://www.reddit.com/r/options/comments/a36k4j/the_wheel_aka_triple_income_strategy_explained/", "score": 1, "replies": []}]}]}, {"body": "I always sell a CC to exit a position. No reason to leave money on the table. If you’re gonna sell anyways then might as well have someone pay you to do it lol", "score": 7, "replies": []}, {"body": "Don't sell long dated, sell deep OTM short dated with the hope that it will expire in one or two weeks worthless. Of course the premium will be much lower compared to selling long dated, but you can sell again after it expires and you will have much more flexibility to adjust the strike price every time you sell.", "score": 7, "replies": [{"body": "If they really want to exit the position, 45dte to the January contract probably makes the most sense and probably a mixture of all those across his 3 or 4 contracts.\n\nGreat problem to have, that's for sure.", "score": 1, "replies": []}]}, {"body": "There is nothing wrong with this kind of strategy in my opinion.\n\nIf $145 is a good sell price for you (it all depends on your cost base and profit targets anyway), you shouldn't be too worried about the classic question of \"But what if it goes to $200?\" Yes, it can. But so what? It can also go to $75 with that kind of \"what if\" logic.\n\nI do similar covered calls quite often on stocks I own. I simply look at my cost, decide on my target sell price and just write the call, collecting premiums. I usually write 3-6 month calls though, not super long dated. Obviously super long dated will get you more in premium so why not.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The question then is: What kind of market are we in?", "score": 1, "replies": []}]}]}, {"body": "Do it, don't let this bullshit market fool you Sept gonna be bearish AF per usual.", "score": 2, "replies": [{"body": "What I was thinking. Better thing might be to sell DITM calls, like .90 delta. That way you get most of the downward move in the option price until gamma catches up. If he wants to sell at 145 then the 110 calls a year from now will give him about 3500 per contract, for a total of $14k, plus 110 upon assignment will be right at 145, plus he has the money now rather waiting for it to hit 145, if it ever does, possibly never getting assigned, and only getting $8k.\n\nThis only benefits if it's expected to decline, though. His total is capped at 145 versus 165.95 (145 + 20.95 call @ 145). But if it never reaches 145 then that's irrelevant.\n\nEither way I think his premise is flawed. He wants his money now. Selling a call for a year out is contrary to that, because options rarely get assigned early unless there is a dividend involved.", "score": 4, "replies": [{"body": "Interesting points", "score": 1, "replies": []}]}]}, {"body": "Sell the call and use the money to buy ETFs. Keep the stock as long as you can. Use it as leverage to diversify. I am adding to NVDA I piled back in at $105 range and Trefis cash flow valuation is $89 so for a tech giant with MSFT as one of its main client the future is bright", "score": 2, "replies": []}, {"body": "Another approach: \n\nSell 19th Sep 2025 $60 CC\n\nYou will lock in 28K in premium immediately.\n\nThe break-even at expiry is 130 or so.\n\nIf there is a market crash, you don't get called away. (this is a very low probability - don't bank on it)", "score": 2, "replies": []}, {"body": "I do the same thing, bought NVDA last week on the dip for 101. Sold a covered call 115 30aug and collected 700 dollar premium. I know that by the end of the month the shares will be called away for a total of 11500 so that gives me a nice 1400 dollar profit and 700 dollars of premium\n\nI do this a lot and it generates a good income. Gives you limited upside profit in exchange for some downside protection", "score": 3, "replies": []}, {"body": "Would wait til after earnings or the day before earnings to sell that CC", "score": 1, "replies": []}, {"body": "CC at 145 is great if you want to sell at 145. But long time cc is not a good idea as that will prevent you from selling your shares if you need liquidity. CC may not get exercised until expiry in most cases and so you will just have the premium and the stocks will be tied up. \n\nIf you want to go the cc route go for cc with expiry from 1 week to max 60 days. Theta decay is highest for calls expiring less than 30 days which IMO is the best option for liquidity of stocks and consistent \"small\" income.", "score": 1, "replies": []}, {"body": "Depends on your time horizon and your expected return. \n\n  \nWhen I do covered call on some of my stocks, I think of the potential and volatility of that stock and then I think of % of return I will be happy with. \n\n  \nFor example, I am holding elf with cost basis of 120 dollars and 300 shares, it ran all the way to 200, and I told myself I will be quite happy if I can sell that at 250, giving the fact that it would be 100% return in a bit over a year. So I opened up 3 covered call at 250 expiring Jan 25th 6 months out, 1700 premium per contract, 5100 in total, then the next thing you know stock went all the way back down to 144.... I closed it with 300 dollars and now I am just waiting for 200 dollars again to do the same strategy.\n\nYou definitely get rewarded in times when you are dealing with a strong but volatile stock.\n\n  \nI use that as a hedging strategy when the stock is approaching closely to my profit target.", "score": 1, "replies": []}, {"body": "I didn't see anyone ask, \"Why do you want to sell at $145?\" If you are using some math to get to that number, please explain. If not, and it's just an arbitrary target and you are tired of trading (which you said twice), then we really need to be discussing your overall trading plan.\n\nSo many people treat options trading as individual, isolated trades. I see way too much gambling and way too little actual business planning. \n\nYou have a plan to sell very long dated LEAPs and collect $10k. What will your return be on that? Once you sell those options, you are locked in a covered call position for an unknown time. It may go to expiration, or it may not. It may end up being a profitable covered call, or it may not. No guaranteed outcome there. \n\nWhy wouldn't you sell the weekly options against your position and continue to roll those for cash flow - forever? Rent out your shares of the best company and collect that guaranteed time decay - as much as possible - every day for as long as NVDA is the AI chip leader. There is a business plan and it's exactly what I am doing. I own shares and have no intention of selling them. I am collecting time decay every single day. I think of it like a rental house. I bought it and now I'm renting it out weekly. It works.\n\nPeople then say, \"But don't you have to pay to roll up and out a week sometimes?\" Yes, I do but it's still collecting daily time decay. I always have the necessary cash to do that because I'm constantly selling calls and bringing in new cash. It's a long-term business cash flow plan. \n\nDo you want me to explain my exact position each week?", "score": 1, "replies": [{"body": "I do. What are you describing here?", "score": 2, "replies": []}]}, {"body": "this strategy sounds reasonable. once you receive your premium you can invest it as you wish.  but since this is a long dated option you may have to wait a while to be assigned if it goes ITM", "score": 1, "replies": []}, {"body": "I think it's a great strategy to earn some extra premiums why not! if your ultimate goal is to get rid of the shares, by all means go for it.  \nAlso it highly depends on personal financial goals - long term investing goals, tax brackets, etc.  \nSpeaking of tax, you might wanna consider the tax implication of this trade too.  \nThe option premium + capital appreciation could result in a huge amount of tax.", "score": 1, "replies": [{"body": "Doesn’t that mean he made a huge amount of money??", "score": 1, "replies": []}]}, {"body": "The November $145 calls will pocket you $7x400… so $2800. I’d do that. If you wait too long, you might miss ETF runups. Also, some tech ETFs are super heavy on NVIDIA now. Consider writing a way out of the money put to juice your return. :)", "score": 1, "replies": []}, {"body": "If your trading goals have changed I think what you want to do is very legitimate.", "score": 1, "replies": []}, {"body": "I sell covered calls quite a bit, and would just say that it’s a “kiss your sister trade”. You get taken out of a rising stock, trigger taxes on your position and the call, and then have to reinvest in a market that is most likely higher. \n\nI try to do it at a high enough strike and short enough expiry that I rarely get exercised.  But after weeks like this one I’m reminded of the shortcomings of this strategy.", "score": 1, "replies": [{"body": "I get your point but let's say I have 200 nvda avg at $105 and I'm willing to sell them at $135 why not sell a call 2-3 week out and pocket the premium? Probably won't get to $135 and I just keep the cash and if it does I'm more than happy to sell them. Taxes might be annoying but you'll make more money selling cc's I believe", "score": 1, "replies": [{"body": "a two week 135 call trades at .68.  if you sell you'll trigger a short-term capital gain on $30 which depending on your state could be around a $15 tax bill. If you are truly fine to sell and pay the taxes, which at times is definitely the right move, then it's okay but I try to sell CCs on stuff where the tax bill is smaller either because I have a high basis, a LT gain, or I see less upside long-term. \n\n  \nIf it gets exercised at $135, after tax you net around $121, versus current price of 119.  And you'll reinvest the proceeds in a market that is likely higher.  If your instinct to sell was right and it goes down immediately, you never got out.\n\n  \nAnyway, that's just my take.  I do sell CCs at times, typically trying to scalp on low delta and/or short dates around bigger moves and in less volatile stocks that have exhibited some resistance at local highs.", "score": 1, "replies": []}]}]}, {"body": "Hard to believe someone who uses words like “ur” has 400 shares of $NVDA.", "score": 1, "replies": [{"body": "That’s exactly why you don’t have 400 shares of nvda", "score": 1, "replies": [{"body": "Interesting assumption.", "score": 1, "replies": []}]}, {"body": "Why so hard to believe punctuation and spelling is only worth something to someone who actually cares", "score": 1, "replies": []}]}, {"body": "What if let’s say he’s currently negative and his cost basis is 160. What strategy would work best to sell covered calls to be positive? Would you still go deep OTM calls 30-45 DTE?", "score": 1, "replies": []}, {"body": "You can always roll the weekly short call to at $$ to pickup max premium.  Just make sure at ex dividend date you roll it past that date and OTM strike. Reduces risk of assignment", "score": 1, "replies": []}, {"body": " Bro you answered your own question. Pull the trigger and go get your ETFs. It’s that simple.", "score": 1, "replies": []}, {"body": "If it overshoots 145, you can always roll the calls up too. You don't have to live with the assignment. Or maybe sell 3 covered calls and let one run free for cash plus some upside.", "score": 1, "replies": []}, {"body": "I think you answered your own question homie", "score": 1, "replies": []}, {"body": "In 10 years NVDA has a solid chance of being over 500 to 1000. I’d hold some of it. There is some risk. The Taiwan issue worries me with chip stocks. ETF’s are safer in my opinion. Really depends on your other investments.", "score": 1, "replies": []}, {"body": "If you want to get \"rid\" of then , and are happy with strike price of 145- then yes go for it. Would do closer to 45 days as after 45-60 days premium increase isn't that great. further out you also be losing thousands on stock gains.", "score": 1, "replies": []}, {"body": "Yeah go ideas to sell cc if you want to get rid of it", "score": 1, "replies": []}, {"body": "They report earnings at the end of the month so just sell a call now thst closes after, get paid for the volatility, and keep your shares if it doesn't pop", "score": 1, "replies": []}, {"body": "Hey, 145 might just be a great target. 140.xx previous high, running up to that from the dip to 90 is probably where a lot of profit taking will happen. Go for it. \n\nI recommend 08/30 , roll it after earnings  if you aren’t close (say delta goes below 5). Right now 08/30 145c are 17 delta, but it’s because of earnings coming so IV much higher. You want that.", "score": 1, "replies": []}, {"body": "Why not just buy NVDY?", "score": 1, "replies": []}, {"body": "I Am up like 700% on nvidia. I sell covered calls now all the time but i do 30/40 days away. If they get assigned, i don’t care but so far I’ve made about 6k this year in calls without getting them assigned. To me it’s a good strategy as I don’t mind taking some profits if they sell, but i am not sure i’d go too long. You might regret it.", "score": 1, "replies": []}, {"body": "You could sell ITM calls where you would but the stock back. The intrinsic and extrinsic value might be $145. If not roll them. I would stay short dated doing this. If the stock drops before expiry you keep all the extrinsic plus part of the intrinsic and roll to collect more extrinsic. Extrinsic is time value if not familiar.", "score": 1, "replies": [{"body": "Beware tax issues and best time to do this might be closer to earnings but I haven’t looked at the current numbers.", "score": 2, "replies": []}]}, {"body": "Dude….nvm imma let everyone else handle this one.", "score": 1, "replies": []}, {"body": "Just sell cc and once shares are called away sell a put at a price you’re comfortable with buying back at rinse and repeat", "score": 1, "replies": [{"body": "What a great idea why doesn’t everyone do this???", "score": 1, "replies": [{"body": "Everyone can’t afford to and some don’t know how.  Some don’t want to because of the type of account and they rather not pay taxes or they want to keep shares and ride it out, it’s  a strategy of preference", "score": 1, "replies": []}]}]}, {"body": "It’s possible to sell 3 covered calls and keep 100 shares to ride the next few earnings calls.  That way premium is gained and an exit of the majority of the position happens at a desired price. Anything else the stock runs up is just gravy and then it’s possible to set a stop loss for whatever percentage is comfortable after it jumps past 145 for a few days. Just my two cents, not financial advice.", "score": 1, "replies": []}, {"body": "I've been fucked more by covered calls than any other options contract. It's a bearish position. If I'm selling a CC, I'm betting on the stock going down, and buying out of the contract to collect a profit without selling my shares. \n\nIn the case of NVDA, I would wait until the week of earnings and sell the contract when IV is 200+ percent. But also wave goodbye to your shares while you watch NVDA blast to 200 after earnings. Conversely, if you don't sell the covered calls, you miss out on the tasty premium while NVDA tanks to 80.", "score": 0, "replies": [{"body": "This is the way!!!", "score": 1, "replies": []}, {"body": "But if you were already planning on selling at $145, it \"locks\" you into your self imposed strategy and earns you the time premium.\n\nYou're still winning. \n\nI think long dated is probably a bad idea unless the liquidity means nothing, but likely if you're selling NVDA at this point, liquidity is a factor at play.\n\nI think anything from 45dte to the January contract probably makes most sense.", "score": 1, "replies": [{"body": "Are you just blindly gonna sell at 145 or look at technicals to determine the time to sell? I personally wouldn’t write a covered call unless I believe the price increase has tapped. All the greeks have to align before I buy or sell options. I like to make money.", "score": 1, "replies": [{"body": "Bro, he said he's selling at $145. He's not trying to make infinite money, he's trying to stop trading at a set price. Selling a covered call aligns with his goals and maximizes his profit with that goal in mind. To suggest anything else is silly.", "score": 1, "replies": []}]}]}, {"body": "It's not a bearish position if you pick a strike price and expiration date that doesn't come to fruition. \n\nIf some moron thinks Nvidia will go to $200 by the end of the August, more than happy to sell CC.", "score": 0, "replies": [{"body": "If you expect the stock to climb, it wouldn’t be wise to sell a covered call. I’d sell the call near the money after it hits 200 in that case, rather than locked into a bad contract.", "score": 1, "replies": []}]}]}, {"body": ">so my idea is why dont i sell a super long dated nvda call option and collect like 10k in premium and if the strike hits it will get assigned and ill make money on the stock and the premium and go buy my little etfs\n\nHow about a scenario when the stock is $85 a year from now and you'r $10k in premium doesn't mean much when your in the red? You'll wish you sold and bought ETFs. If you don't believe in the stock going up further, why hold a very high risk single stock that is known to move drastically?", "score": 0, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "If he writes a super far out covered call he can't keep selling until his current expires", "score": 1, "replies": []}]}]}, {"body": "I'll buy your 145 Strike Sep 20 Calls please.", "score": 0, "replies": []}, {"body": "1000 shares and a 2 Contract Oct Call", "score": 0, "replies": []}, {"body": "Sell a 135 this week.  If it goes higher than 135, roll to the earnings week 145 before being assigned. The premiums during earnings week should be very high.  Good luck.", "score": 0, "replies": [{"body": "Exactly why I bought otm calls Monday and watch the premiums go up even with sideways trading lol. Buy the calls ride the ramp up. Sell the calls, then sell covered calls at peak 13dte. Boom", "score": 0, "replies": []}]}, {"body": "Go ahead and make that money 💰. You will be happy if 145 is your number. 🤞good luck 🍀", "score": 0, "replies": []}, {"body": "Why not buying NVDY? Just asking...", "score": 0, "replies": []}, {"body": "I guess we need to figure out a couple of things first. You say you are anxious to sell your NVDA, but through the use of a long-term covered call at $145 strike.\n\nAre you willing to hold on to NVDA for the duration of that contract, or are you in a hurry to get rid of it? I ask this because you may be expecting to get assigned once it's in the money, but that's rarely the case. The only time I've seen an options contract assigned early is when there is a dividend involved and it's just before the exdiv date.\n\nEven though ITM contracts are mostly intrinsic value, they still have some extrinsic value up until expiration. This extrinsic value is immediately lost when someone exercises a contract early. That's why they are usually just sold to someone else until all the extrinsic value vanishes at expiration. When someone exercises early, it's because the dividend payout is greater than the loss of the extrinsic value.\n\nSo keeping that in mind, do you still want to sell long-term calls against your NVDA?", "score": 0, "replies": []}, {"body": "you already said you don't care if you miss out on some return, so you're not really acting rationally, but it's also not stupid at all if it's what you want.  the real question is what you gonna by with that premium?", "score": 0, "replies": []}, {"body": "I would just put in a sell order for $145 and make it GTC. Nvidia will get there pretty soon probably and you'll be out of it and will get more than you would on selling a future covered call.", "score": -1, "replies": [{"body": "How does he get more than selling CC if the sell order executes at $145? All he collects would be 400x145-fees.\n\nIf he writes a $145 CC, he not only sells them at $145 and collects the exact amount as above, but also collects in addition the premium for selling the CC.", "score": 2, "replies": [{"body": "It's like he doesn't want to deal with it. He's talking about selling it now, on a future call for $145. To get the $10,000 cash up front, but in order to get amount of premium, he'll have to sell it for Jan 2026. He would be better off just putting a sell order in and he'll probably have the money in 2 weeks and he can invest in his ETF's that he wants. The Jan 2026 $145 strike call might not assign for months or even a year. Meanwhile his cash is tied up where it's not making any additional premium during that time.", "score": 1, "replies": []}]}]}]}
