{"title": "My NVDA Pre-Earninng's Play Opened Today.", "selftext": "It's a wide double calendar, with a diagonal added to cover the dead zone in the middle. These are the strikes selected for the double calendar.\n\n&#x200B;\n\n[$91\\/$130 double calendar](https://preview.redd.it/ovjfs98msbid1.png?width=310&format=png&auto=webp&s=d3b03dd240908121f07f7c99bf054ef175d81c53)\n\nIt creates a dead zone in the middle, but my strikes are so wide placed at previous support/resistance the strikes should not be breached. Ideally, price close to $91 or $130 right before earning's would be best case scenario to close 8/28 before earning's release before IV crush. This double calendar is about $150-$160 to open. Market close priced spiked so the $268 loss isn't accurate it's less cost.\n\n&#x200B;\n\n[Dead Zone](https://preview.redd.it/6zwwhurnsbid1.png?width=318&format=png&auto=webp&s=9ca3c14d9d48181665a768acc513bc0aef6bd5a5)\n\nI tried covering the dead zone with a butterfly, calendar and diagonal. The butterfly wasn't wide enough although cheap. The calendar if IV rose and price stayed flat, I'd lose to Theta on long legs and Vega ramping up in short legs due to IV expansion I'd lose to as well. So PnL can't be trusted, probably a loss with calendar trying to close before earning's. The diagonal if ITM wouldn't be so exact in intrinsic value so wouldn't be as difficult to close for a small profit out of the 3.\n\n&#x200B;\n\n[Diagonal covering dead zone](https://preview.redd.it/w1a9xg7qsbid1.png?width=316&format=png&auto=webp&s=87833d30e74666fcd58f1dcec253f5f9cbe7c492)\n\nThis is the diagonal covering dead zone. If price runs to $125 before earning's, the double cals will be nicely in-profit and the diagonal will have gained so much intrinsic value, but the strike difference would still give me $100. Unlike using a calendar, IV expansion before earning's and so exact in intrinsic value due to same strikes would be impossible to close for profit. It's a small insurance to cover dead zone if price is flat, which is more effective than using a butterfly or single calendar while presenting more advantage if runs deep ITM.\n\n**CONCLUSION**: Was asked to show visuals of my trades/idea in-mind. I've taken this trade as of today. As long as price does not breach $91/$130, and even if it does to some degree will be able to close double calendars for nice profit. The expir. of long legs is 9/13 instead of 9/6 which makes the long legs more resilient to IV expansion and price running, as they now have slightly higher delta and Vega, and lower Theta assisting the Theta positive position. It's paying a little more to build a better, more resilient double calendar. *3 double cals to 1 diagonal was my ratio.*\n\n**EDIT 1**: This is a triple calendar basically. Playing pre-earning's to close before release. ", "id": "1equ4bv", "created_utc": 1723508885.0, "score": 22, "upvote_ratio": 0.89, "num_comments": 94, "comments": [{"body": "I guess I don’t understand why not just do double diagonals that can do what the calendars plus one diagonal can do?\n\nI tried to screenshot what I’m talking about but can’t figure out how to insert it into this comment.  It’s after hours so the vid/ask is all jacked up, but I would STO 120C and 96P for 8/30 and BTO 118C and 99P for 9/13.  Assuming you get decent fills (big assumption) your tent is covered in the middle without the 3rd diagonal and you’re at 86ish on the bottom and 134ish on the top.  \n\nAs I’ve mentioned before I think, as IV bleeds up and outpaces on the 8/30s you’re likely to be better off opening this in a week or more.  Just my two cents.  I’ve really enjoyed reading your thought process through all of these!", "score": 7, "replies": [{"body": "And if price runs to $125 before earning's? You'll build intrinsic value in the $118/$120, maximum gain there is $200 now, but you've spent more for the $96/$99 than if receiving more premium by selling the $96. So your downside now weighs more, while your upside is ITM with intrinsic value making it harder to profit. Your strikes are closer to ATM so this will also cost more to open as well than a double calendar.", "score": 1, "replies": [{"body": "I think this costs less than your 6 leg strat, but admittedly didn’t run the numbers that closely and AH you’re not getting accurate pricing.  Edit to address your first question, I wouldn’t open this until the week of earnings, maybe even that day, to ensure I am setting up legs to cover the spread based on the underlying strike at that time.  I also believe that by doing so I’m going to pay less than your 3 calendar strategy (that middle diagonal has to be basically a calendar based on the picture, strikes maybe 1 away?) then than you’re paying now.  I am making a directional play on a CDS leading into earnings that I’ll close before opening this position.  Either way, good luck!", "score": 1, "replies": [{"body": ">I wouldn’t open this until the week of earnings, maybe even that day, to ensure I am setting up legs to cover the spread based on the underlying strike at that time.\n\nThat's not a Theta positive position if holding through earning's. To simplify, this is a ratio'd triple calendar playing pre-earning's only.", "score": 2, "replies": [{"body": "I forgot you want to sell prior to earnings.  I think an iron condor is probably a better strategy, but maybe not.", "score": 2, "replies": [{"body": "I had considered an Iron Condor and OTM Strangle to hold through earning's, but not messing with IV crush. Just as a pre-earning's play could be good, IV expansion would help the calls/puts, no IV crush, selling for high premium and if IC breached the Strangle would be well in-profit.\n\nThis actually could be a better combination as a pre-earning's strategy, offsetting Strangle costs with IC, and preventing IC from losing if breached by gains of the Strangle going deep ITM on one side.\n\nMore food for thought, post earning's OTM Strangle or neutral structure after IV crush before market's fully reacted to earning's report seems solid, but pre-earning's idk what's my concrete go-to aside from double/triple calendars but IC/Strangle I need to test that may be the play pre-earning's", "score": 3, "replies": []}, {"body": "Why do you think iron condors are better?", "score": 2, "replies": [{"body": "I shouldn’t say better, but simpler and easier to manage, especially on Robinhood, yes.  Iron butterfly would probably be a better comparison.", "score": 2, "replies": [{"body": "What about for beginners that don’t use Robin Hood and what would recommend for post-earnings?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I guess am betting more the price will move towards my intended strikes but not breach them, which gives me a big directional move and offsets IV expansion because long legs profits are greater than cost of short legs IV expansion. If price stays flat the diagonal is so similar in strike it's almost like a calendar but better protection being deep ITM. \n\nThe kicker here is, will price stay flat and how big will IV expansion be? If price runs but not past my strikes, I'm doing well regardless of IV expansion which am estimating $95/$125 range near earning's.  If price stays flat and IV expands, will having burned nearly 3 weeks of my short legs with only 2 days left help Theta to overcome IV expansion idk just learning as I go", "score": 1, "replies": [{"body": "I really like that you’ve been thinking all of this through and trying to understand how to minimize risk, but you’re probably trying to overly protect against risk and your ultimate reward is likely very low.  I also want to mention again, this is not a strategy for Robinhood.  Your fills are not great, and it’s incredibly difficult to manage and/or leg out on their platform.  However, fees on a traditional broker are going to hurt you in this strategy.  Still, awesome thought process and continuing to build something I hope works out well for you.", "score": 1, "replies": [{"body": "Am starting to realize playing pre-earning's is a f'ing headache, with the IV expansion and then IV crush it's really a pain. What if my double calendars see IV increase so much in short legs, price stays flat, my PnL closing on Wednesday instead of Friday without having received the full premiums could be actually a costly loss which the center diagonals barley cover.\n\nI am coming to the conclusion based off of last week, the strategy which fits my risk/reward criteria would be an OTM Strangle bought immediately first thing at-open after earning's release, no IV crush so cheap costs, and lots of volatility as market still reacts to the report.\n\nWhat do you think? I appreciate you speaking with me btw, I appreciate all your insight. I need some tracking software to see where my winning trades have been to repeat that. Which all have been double calendars with strikes at implied move to leg out before/after earning's. Idk if I got lucky so many weeks in a row or there's something there, post earning's have down but pre-earning's is like deciphering a code my break cannot stop thinking about", "score": 1, "replies": [{"body": "I do think you’ve over engineered it a bit, but we’ve all done it, lol.  If you want to play the pre earnings like you’re suggesting and close prior to the print, go with an iron condor or iron butterfly and manage it, it’s doable and less stressful that what you’ve suggested.  I play post-earnings all the time, but it’s usually directional and one I’m confident that there’s been a market overreaction one way or the other.  CSP on a stock I want to own, CDS/PDS or diagonal on a run up/down, calendar is nice when I think it will take a few weeks/months to correct (nice play on V a few weeks ago this way).  Strangle/Straddle works too, but when I’m less confident in the market’s reaction to the report.\n\nHappy to talk it through, I learn something new all the time on these subs and it’s great seeing someone to work through a new strategy.  Oh yeah, edit to add, definitely journal your trades and back test.  I don’t anymore, but it was eye opening when I was starting out.", "score": 3, "replies": [{"body": "You're well ahead of me by what feels like years, you've now tested the strategies and found the correct environments. It's the equivalent to the toddler understanding the square, circle, triangle, and which holes are on the board, but not getting where they go and putting circle into square, etc.. Haven't deciphered which structures fit in what environments. I have 10 months learning options now, I'm dedicating all my free time to this.\n\nI really think my best bet will be taking the training wheels off and starting to trading directionally. Buying calls or puts immediately at open after earning's release to capture big, cheap directional movement. What do you suggest?", "score": 1, "replies": [{"body": "You’re clearly doing it the right way and putting in the time.  Honestly, even when I trade directionally I try and minimize risk (spread, CSP, calendar, etc.) and always have hedges on based on trading port structure (those uvxy shares more than doubled Monday, as did the spy put hedge, giving me a Green Day whenever everything else in my port was red).  So I guess what I’m saying is, you’re smart to try and minimize risk, jumping into pure directional trades without risk management will send you to WSBs loss porn page.  I like where your head is at, many ways to get to profitability, and home runs lead to blown ports.\n\nI make directional plays on tickers I am very familiar with, and understand the company fundamentals as well as industry sector.  Sometimes I’ll make those plays on skew data and technical analysis on less familiar tickers, but they tend to be short swings or even day trades.  If you want to take the training wheels off post-earnings, start with spreads or diagonals on companies you know inside and out.", "score": 1, "replies": [{"body": "GOLD this morning calls increased 400% just buying immediately market open, 0.08c to .35c minus losses getting filled with bid/ask which shouldn't be that bad just buying calls vs. trying to fill a 4-option order. Seeing a big EPS beat, raise in guidance, then buying calls after IV crush even if knowing little less about the ticker, buying let's say 11 days and only holding intra-day opening at market open like GOLD today which know nothing about, pay little to Theta and get big possible move still.\n\nSeems if you can quickly read fundamentals can get an idea on direction, but not always cause NFLX beat nicely but tanked cause was richly overvalued. MNDY traded flat, would've paid a day to Theta if opened a Strangle, calls or puts. I could've opened GOLD as a vertical or better diagonal like you put which just clicked in my head to buy little closer to ATM and take some risk off.\n\nI think my pre-earning's strategy can work like what is detailed because my strikes are so far apart, if price trades flat, even if there's IV expansion there's no way just 3 days left till expir. will the short legs still cost to close what they paid me nearly 3 weeks ago especially when so far from strikes. So pre-earning's double calendar + diagonal bought far enough out may actually work, and post-earning's opening diagonal in direction based off earning's report/guidance.", "score": 1, "replies": [{"body": "I didn’t mean to imply that your strategy couldn’t work, it very much can, but it’s maybe overly complicated and difficult to manage.  My thinking is that an iron butterfly or condor might just accomplish the same thing more easily opened, managed, and closed.", "score": 1, "replies": []}, {"body": "What are the benefits of opening diagonal post earnings vs a credit spread?", "score": 1, "replies": [{"body": "Diagonal is more profitable, long legs are staggered in dates between short legs so they decay slower so they'll hold more extrinsic value, creating a greater Theta positive position. Credit spread am not opening, it's a debt spread and it's cheaper than a diagonal but short leg and long leg decay at more equal rates making your profit more-so the difference between distance in strikes. Diagonal decays slower creating better profit from distance in time and receive the distance in-strikes. Diagonal is like a better calendar cause it protects against strike being ran through but slightly more expensive. Call debt spread is just a cheaper diagonal and improved vertical. It's like phase 1 and phase 2 of the same structure but each equally powerful in their own right. Top options trade stick with diagonals, debt spreads, and calendars mostly from what have seen.", "score": 1, "replies": []}]}]}]}]}, {"body": ">Oh yeah, edit to add, definitely journal your trades and back test.  I don’t anymore, but it was eye opening when I was starting out.\n\nIs there a software which can input CVS of my trades and see my performance like double calendars 67% win rate, seeing this information would help a ton, especially if it could differentiate between pre-earning's and post like the success of holding double calendar through earning's vs closing beforehand.", "score": 1, "replies": []}, {"body": "Do you mind elaborating on that more please? I remember OP was saying in a previous post that he uses strangle/straddles post earnings but I didn’t understand why if you can sometimes see which direction a stock is going", "score": 1, "replies": []}, {"body": "Noob question, you meant long iron condor, right?", "score": 1, "replies": [{"body": "Right, a long iron condor would expect a large outsized move.  Edit, sorry, answering quick at work at work, I thought your question was “you mean short iron condor”, which I was saying right, expecting it not to break the wings.  A long iron condor needs to get past one of the wings to profit, expecting an outsized move.  His original set up does not want to break either side of the tents in his calendar spread prior to earnings, so he would probably be better served with a SHORT iron condor.", "score": 1, "replies": [{"body": "Got it, thanks.", "score": 1, "replies": []}]}]}, {"body": "But with iron butterfly, the price has to stay withing a relatively narrow range, no?\n\nFor a hyped up stock like NVDA which can easily run up into earnings, I don't see how iron butterfly would be a good strategy.", "score": 1, "replies": [{"body": "True, as does the double/triple calendar spread, or at least until the short leg expires.  Which is why I don’t think any of these strategies are right for this, especially NVDA.  I was suggesting that an iron butterfly is a simpler neutral strategy than this 6 legged calendar spread, which OP has agreed and changed his mind on since.  I think a directional diagonal better serves this purpose, but there’s a lot of ways to skin a cat.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I'm pretty excited right now wanted your feedback,, I'm look at triple calendar using TSLA buying 10 dte and selling 3dte. I don't have to worry about IV expansion or earning's, I get to close in 3 days, and am really profitable between huge breakeven of $170-$230. \n\nWanted to run and tell you feel like you've helped me so much. Can't believe I can hedge risk using calendars, not worry about IV expansion so they're more effective, trade neutrally creating huge breakevens, and close quickly using a company like TSLA. \n\n(Check out the $170/$225 (8/16 - 8/23) double calendar, with $197.5 calendar for dead zone protection which isn't even costly. I can rinse and repeat this trade outside of earning's like holy cow big profits and huge breakevens without the stress of earning's!)", "score": 1, "replies": [{"body": "Yeah man, I actually think the double calendar is more useful outside of earnings/news events.  Now, you’ve got lots of news events and potential volatility coming up this week (CPI/PPI/Iran/Ukraine/etc) and Jackson hole and vix opex and monthly opex all occurring soon.  You’ve also picked one of the highest historical volatility stocks.  Your tent breakeven can change over time, it’s not static, so be careful there.  Has TSLA ever moved 10% in 3 days?  Yes, is it likely, with TSLA and the uncertainty of Elon saying/doing something to cause an outsized move, maybe.  It’s a good risk/reward trade in my opinion, but just some things to think about.", "score": 1, "replies": [{"body": "Dude I appreciate you a lot, am like a little toddler brother learning to play with toys and you're big bro well in the know guiding me which maybe one day I'll be able to help others to this degree. You understand the circle goes in the circle hole, I understand the circle and the board with the circle hold but still try putting square in circle hole. Need better understanding of what structures in what IV environments. \n\nI think it's a good risk/reward too but yeah def not on a week after reading the list of events you mentioned holy cow last Jackson Hole went wild lol, maybe if can open this trade on Thursday and close Friday close it'll be so short of time just overnight hold basically which may work unless craziness happens within those 24 hours.\n\nDouble calendars outside of earning's for short window on companies like NVDA seems exciting now. Was so focused only on earning's. My plan tomorrow morning is OTM Strangle 10dte on SE which has huge earning's implied move and set GTC order at 50%. May do same for HD if it has crazy earning's. So moving more towards after-earning's plays now kinda happy but it's nearly 5am and am cutting my sleep to 2 1/2 hours to set a trade this is not healthy.", "score": 1, "replies": [{"body": "Well, I am no expert, I do it for fun, there are much better traders on here and pros.  But thanks, happy to discuss and enjoy it.  \n\nUntil 8/30 and we get some clearer directional understanding, I’m day trading or very short swings, nothing to hold (outside of my LT buy and hold port).  I want some of this uncertainty to die down.  I’m also 70% cash in my trading port, sometimes taking no trade is the absolute best trade.\n\nAnd dude, get some sleep and make sure to touch grass, lol.  This can destroy your mental health and it’s easy to let it take over your life.  Enjoy the ride!", "score": 1, "replies": [{"body": "Would be nice to turn pro, that's the plan but need to find my footing which is why trying to cover so much ground so quickly but need a lot of distance covered it's crazy so much to only learn by experiencing it firsthand. \n\nI checked out NVDA next, this is nice, can set strikes almost 10% in distance, cover middle with ATM calendar and open on Thursday 1pm, it's cheap and low risk with decent return. Quick turnover just holding Thursday to Friday. So triple calendar close to Friday to hold and toss out for quick small trades covering a huge break even. I kinda like this for big Mag 7 which move little slower closer to expir. kinda excited!\n\nThinking stay up until open and sleep a bit or just skip today it's not enough money to be losing sleep over probably lol", "score": 2, "replies": []}, {"body": "Opened Strangle on SE, ONON, and TME. Closed TME for 30% gain within minutes. Bad fill on SE, first time buying market open was expecting to get blasted through with earning's but I overbid foolishly. \n\nI've been thinking about what you said, I want to start picking more directional but hedging against risk still instead of just buying long calls and puts. So I can buy cheap OTM calendars with more time, risking less and making more. For example, I think Crowdstrike will recover more, the $285 9/6 - 9/13 cost only $98 with max profit of $822. It gives 4 weeks to move 15% if were to reach max profit. Breakeven at 3.27%+ and 29.47%+ so within a month plenty of room to work with. \n\nIt's more time, it's directional bets, it's hedging since a call at $285 would otherwise cost me $585 which is much bigger risk/cost, more potential reward, no IV crush to worry about, and can be right less. For example, I think Amazon will recover back to $185, I can buy the $185 9/6 - 9/13 calendar for $40 and max profit is $242. It's a lot of time to work with for a cheap cost, taking bets with higher probability. I think Chipotle CEO change was oveerreaction, can set calendar at $55 where think will recover to. I wouldn't even set GTC orders and just manage the position to not sell out early for 50-100% gain but go for big moves like short legs closing collecting full premium and selling what remains hopefully for a lot.", "score": 1, "replies": [{"body": "Good deal, man.  So, couple of things.  I think the CRWD OTM calendar is a good play, I have one on right now 9/6-9/20 at the 270 strike that is up 10% or so.  But it will take a lot of time for the short sold leg to start to deteriorate compared to the long leg, especially if they’re only a week apart, just an fyi.  I prefer to pay a little more to get the benefit sooner and have a chance at an expired near OTM short leg with a chance for the long leg to continue the trend.  I also think the 285 might be a bit optimistic, I’m still always shooting for a price target where I think the stock can land by my long leg, and I think with news about CRWD lately, one legal filing or news event can blow it back up.  The Amazon play is strong I think.  Again, I would pay a little more up front to buy an extra couple of weeks, when I go a week between the legs it’s usually diagonally.\n\nTotally agree on CMG, I bought calls for $49 8/16 and $50 9/20 today when it hit $48, lucky timing on my part to catch the bottom, but I think it gets back to $55.  SBUX should come back down some, but I’m less confident in when and didn’t play it…yet.\n\nCalendars are nice because low risk/high reward with built in hedge sort of (assuming you don’t get assigned, which will eventually happen the longer you trade these, this I can attest to, know how that works and manage accordingly), but that is really just reducing your risk and your cost basis on a directional play, not actually a hedge.  A note about hedging, a lot of times I hedge my portfolio as a whole instead of individual plays.  Today around 2pm I bought 9/20 SQQQ $10C (hedge against my tech positions) and 9/20 TZA $17C (hedge against some small cap leaps I own).  Last week I bought SVIX calls when VIX spiked over 60 that I closed out today for a very nice gain (not really a hedge as much as understanding that volatility shouldn’t stay that high that long).  I bought a couple of UVXY shares today at close in case CPI throws a wrench or Jackson Hole/powell comes in hawkish next week).  I hope that all of these expire worthless because they are small compared to my thesis play, but they’re handy when it goes against you.  You don’t have to hedge each individual position to hedge the portfolio.", "score": 1, "replies": [{"body": "Thought about what you wrote all day, was burnt out and took a break from options, am excited now things are heating up. I just opened a ton of positions and wanted to come share! We're both sound fundamentally deciding different reasons on why to buy a company let's see what you think of these.\n\nDDOG $125 8/30-9/20  \nAMAT $225 8/23-9/6  \nAMZN $185 8/30-9/20  \nCRWD $275 8/30-9/13  \nELF $165 9/6-9/20  \nCMG $55 8/30-01/2026\n\nDDOG had excellent earning's and guidance, think over next month it recovers back to its $130 range. AMAT has earning's, implied move is 3%, think recovers back to $220 zone after good beat. AMZN think next month recovers back to $185. CRWD oversold imo. ELF had earning's beat and guidance raise and then double dump think recovers back to $160 range. CMG had leaps before which closed for 20% gain so reopening paying just 4% more than last time which want to go long.\n\nAm not going deep, just have diversification with reasons why mainly strong earning's and then a sell-off so just betting a recovery back to previous resistance before the beats in earning's. This is more lucrative than what I was doing, it's cheap, I can diversify and even if market sells off many of these have a month and growth story or catalyst cause of earning's still to back them I think. Am off to sleep ty dude for reading all this you're awesome ty <3\n\n(OTM Strangles at open immediately after earning's, you're right was a pain in the butt to fill! Lost on that itself which sucked but have GTC orders at 25% so need ONON and SE to run some more but def not worth it. I need to buy time, pick direction, offset the costs by selling, and diversify among trades with a reason why like CMG is the Costco of restaurants imo and want to hold long especially when they announce new CEO and shares pop in excitement.)", "score": 1, "replies": []}]}]}]}, {"body": "And it looks to me like HD is going to get beat down today and imho probably stays down for a while (unless the selloff goes crazy today, then it might be good for a quick bounce, but I haven’t set support/resistance or really studied HD and it’s GEX).  I’d wait until mortgage rates come down and keep an eye on the new construction data before taking HD for a bounce.", "score": 1, "replies": []}, {"body": "hello, i understand the double calendar you did on the NVDA above, but how did you play the third calendar move on your \"triple calendar\" strategy? i am a bit confuse on this, thanks!", "score": 1, "replies": [{"body": "$110/$111 calendar which is basically ATM, there's difference in intrinsic value if goes deep ITM since there's difference in-strikes so if prices runs to $135 still profit with the diagonal for small bit and close the double cals for nice profit.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "One day I will understand all of this but it is not this day. Best of luck on your trade!", "score": 6, "replies": [{"body": "Thank you! It's really complex stuff, it's the equivalent to having a baby brain (totally clueless), learning about different shapes like circle, square, rectangle (options structures), and learning where the circle goes in the circle shape on the board (which environment to play certain structures).\n\nI'm at the phase where I understand the objects, recognize the board, but have difficult putting the right shapes into the right hole (using the right options structures in their preferred environment like high or low IV). Gotta learn the structures, learn the environments, then learn what goes where. Takes about a year imo if really dedicated.", "score": 1, "replies": []}]}, {"body": "Good luck, but all this headache for a measly $400 on earning gamble.\n\nYou can play directional bets the next day for a better reward or even make futures trades after hours (after earnings).", "score": 9, "replies": [{"body": "I'll open OTM Strangle immediately after earning's, it's $400 per contract, idk why much of a headache you hold until before earning's and then sell. It's a Theta positive position and hold, with break even range of like $80-$140 which won't happen before earning's. Not a headache all, more like can sit back and relax.", "score": 1, "replies": [{"body": "What expiry for the OTM Strangle? Friday of earnings call week?", "score": 1, "replies": []}, {"body": "It's a lot more work then buying a call or a put based on momentum and makes less money. Maybe it's just slow for me but I doubt it. I mean I don't think it's as solid a play as you think but what do I know. I feel like you can do more with the capital.", "score": 1, "replies": []}]}]}, {"body": "OP, what are your diagonal strikes? I'm assuming the expiries are the same as those of the dbl cal.\n\nFrom the P/L chart, it seems your diagonal is only just a diagonal and is practically a calendar. So your whole trade of legs is essentially a triple cal. Or almost. However I noted that you're doing a 3:1 ratio of dbl cal to diagonal.", "score": 2, "replies": [{"body": "Yep, that's basically it. Pre-earning's triple calendar, with the middle calendar the slightest bit a diagonal to help offset going deep ITM and intrinsic value being identical making it hard to close, difference in strikes still can close for some profit.\n\nIt gives the biggest range covering more area than a butterfly and more effective than calendar if runs deep ITM. Covers IV expansion somewhat which am offsetting by buying the long legs 2 weeks after short legs, instead of 1 week (9/6 vs 9/13 instead) so more delta/vega, less Theta, can better keep up with price/IV running, and short legs a strike out assists with greeks as well but by marginal factor.", "score": 1, "replies": []}]}, {"body": "Dude this hurt my brain", "score": 1, "replies": [{"body": "It's hurt my brain for past year, up to 3-4am burning midnight oil using all my free time and sleep time to try and learn this. Something which allows me to take risk from home, can't get ahead in life without taking risk!", "score": 1, "replies": [{"body": "I’m tryna learn but there’s a lot too it. My investment strategy rn is long calls😂 with the occasional meme stock", "score": 1, "replies": []}]}]}, {"body": "Have you tried putting a 1 week apart calendar in the middle? It will get rid of Death Valley in the middle?  Try putting this trade in the middle of your double calendars.   Buy 1 Sept6 110 call and Sell 1 Aug30 110 call for a debit of 0.58.  It should fill the void in the middle and only costs 0.58.  Your breakeven are 85 and 140 but it will most likely be closer once the vols are squeezed out.", "score": 1, "replies": [{"body": "No that would be bad, buying one week out will have less delta, less vega and higher Theta, making a weaker Theta positive position, and being less resilient to IV expansion or price running.\n\nIf price runs putting the calendar ITM because the strikes are identical, it'll be very hard to close for profit with intrinsic value nearly the same. I basically have a more resilient calendar in the middle by buying the 2nd week out, which is the slightest bit a diagonal by buying next dollar/strike up, so if goes deep ITM still make money due to difference in intrinsic.\n\nI basically have a calendar in the middle just tweaked to better suit my needs.", "score": 1, "replies": [{"body": "Ok. The TOS software must be wrong.  Opening it at the money is delta neutral so it won’t have delta.  It is only protection if NVDA doesn’t move at all. If it moves in either direction, you are covered with your calendars on either side.  Anyways, the TOS software is showing a much better graph than the one you posted.  I am not saying to make your two other calendars 1 week apart. What I am saying is the middle should be 1 week apart just for protection if NVDA is right in the middle of your calendars after earnings. It makes sense because if NVDA is exactly at 110 at expiration, it would be worth around 3.00-3.50 with 1 week to go which would cover your 2.68 debit.", "score": 1, "replies": [{"body": ">Opening it at the money is delta neutral so it won’t have delta.\n\nIt's hard to take you seriously when state very obvious mistakes, I made the point buying the 2nd week out vs. buying the week out, which absolutely has a difference in Delta. You're paying more but getting more of the directional move aka delta, more Vega, and less Theta. Go compare buying the 9/6, 9/13 and 9/30. The greeks are very different. You'll understand what I mean.\n\nAlso, a calendar starts off delta neutral but does not remain delta neutral as the price moves.\n\nYou're seeing better PnL because you're paying less for the week out vs. me buying the 2nd week out so PnL will look more lucrative cause the 1 week out is cheaper. With experience, you'll understand it's not accounting for IV expansion, which will certainly happen as run-up to earning's, which is what you're not accounting for and what my strategy/calendars are accounting for. That's the fatal mistake you're making ignoring IV expansion, as that happens your PnL will look whack and my more resilient calendar preplanned for this event will be better suited with better greeks.", "score": 1, "replies": [{"body": "Yes it won’t stay delta neutral and will lose 0.58 of it goes to either side. I stated that in my response. The idea is to hedge if NVDA stays exactly at around 110.  It will be worth around 3.00-3.50 with 1 week to go which will cover your debit of 2.68. Before you comment, why don’t your type it in your software and post the image and compare the image next to your diagonal and see which is better ROI, and breakevens. What is the strikes on your diagonals in the middle so I can compare it myself?", "score": 1, "replies": [{"body": "And if the price stays flat which is the entire point of covering the dead zone loss, you'll pay to Theta to own the long legs, while the short legs increase in value as IV expansion happens. So when you go to close before earning's, your long legs are worth less and your short legs are worth more than the original premium you received.\n\nThis presents a big loss if price is flat. It makes crystal sense idk why you're not getting this. ATM calendar with IV expansion closing *before* earning's will be a huge loss. You pay to Theta for the long legs to do nothing, and short legs cost more to close than the credit you received as IV exploded. That's not covering the dead zone, that's double loss.", "score": 1, "replies": [{"body": "I have done back to back weeks on earnings where I get 2-4X so when you say the longer week doesn’t have IV expansion is non sense.  In fact, if the earnings is on a Thursday and the options expire on Friday, I think most people will buy the following expiration week to give them more time.  I have had my largest ROIs on back to back weeks so I don’t know where your getting the idea that the front week will experience IV and and the back week won’t,  if the position is positive Vega, it will profit with IV expansion.", "score": 1, "replies": [{"body": ">when you say the longer week doesn’t have IV expansion is non sense\n\nI never said that, stop making things up. I said, it's a more resilient calendar better suited with greeks. Where did I say the longer week doesn't have IV expansion that's BS.\n\nMan stop writing me without first comparing the greeks of 9/6, 9/13 and 9/30 this isn't rocket science. If you're trying to create a Theta positive position *buying the long legs with lower Theta is more lucrative if that's the case!!!!!*\n\nYou spend more but you're not losing that money, you're getting better greeks, you're so caught up on paying less for the following week out without understanding at all what I'm saying. I can clearly see  you have a ways to go, there's a point when you'll understand not being cheap with options is *safer*.", "score": 1, "replies": [{"body": ">while the short legs increase in value as IV expansion happens. So when you go to close before earning's, your long legs are worth less and your short legs are worth more than the original premium you received.\n\nAren't you implying here that the short will increase while the longs will decrease? So tell me why the longs will decrease and will be worth less.", "score": 1, "replies": [{"body": ">*Aren't you implying here that the short will increase while the longs will decrease? So tell me why the longs will decrease and will be worth less.*\n\nThey will be worth less because you've held them now for some time xxx days and price has remained flat? That time isn't free. You have to pay for the time you own your long legs. That's pretty easy to understand. You're buying the 9/6, reports on 8/28, that's 15 days away so 15 days of Theta burn and long legs doing nothing aka flat price action. Or 5 days if buy week-of.\n\nThen IV in short legs goes from 80% to 200% and suddenly getting $3.15 at start of the week is now costing $5.50 to close. So you lost money because of IV expansion, short legs cost more to close than original premium received, and long legs have decayed for 5 days doing nothing or flat...\n\nOutside of earning's, when IV expansion's non-existant, sure using a calendar like you've suggested would be better in that case.", "score": 1, "replies": [{"body": "If the longer dated long experiences 15 days of theta decay, then so will the shorter dated one you sold at an even faster rate.  \nIf the shorter dated experiences IV expansion, so will the longer date one and will increase more because it is more sensitive to volatility. \n\nHave you even traded enough of these or are you projecting what you think will happen? I mean have you done enough to say with confidence that if I buy to open a back to back week earnings calendar for debit 2.00 and that if I sell to close, 15 days later, the day before earnings and the stock goes nowhere, that you would sell for a loss.  In order for this to happen, it would have to be a theta negative trade and IV would have to decrease.  If IV increases, and if the trade is theta positive, which it is because a long calendar is theta and Vega positive, it would make money in this situation.", "score": 1, "replies": [{"body": ">*If the longer dated long experiences 15 days of theta decay, then so will the shorter dated one you sold at an even faster rate.*  \n>  \n>*If the shorter dated experiences IV expansion, so will the longer date one and will increase more because it is more sensitive to volatility.*\n\nI'd ask you the same, do you even have experience with this cause that's wrong. The short dated legs will gain *substantially* more IV than the long legs, it's not equal whatsoever. Calendars are not Vega plays. Trust me, you're not benefitting from that rise of IV that's a newbie take. The long legs gaining in IV will negligible because playing difference in-time, the higher Vega in long legs won't cover the IV run in the short legs, which is why I even bought the 2nd week out for long legs to have higher Vega to keep up. Man, what you wrote goes to show have little experience under the hood with calendars. *IV running will cause short legs to smoke whatever Vega gains the long legs gain.*\n\nThe short dated legs experiences such IV expansion, the 15 days of Theta decay at a *faster rate is irrelevant because IV increases such*, you received 5.00 for 15 days and go to close 3 days till expir and it costs still 5.00 to close, while you lose money on long legs to Theta, and the IV expansion or Vega run-up in long legs didn't cover shit like you're hoping.", "score": 1, "replies": [{"body": "Let me break it down for you guy. A shorter dated option costs 2.00. IV increases by 100%. Now it’s worth 4.00. Your long options is worth 5.00.  IV increases by 80%.  Now that option is worth 9.00.  Did you just not make money even though the longer dated option increased by 80% vs 100%. 80% is less than 100% but it still made money didn’t it?", "score": 1, "replies": [{"body": "LOL, I wish the long legs increased 80% in volatility while the short legs increased 100% in volatility. Def does not work like that. More like, seen plenty of trades (this is first time I buy the 2nd out week, I have 100% of the time bought the following week out always anyways so I know), where the long legs IV reaches 90% on day of earning's before release while short legs are at 220%. Long legs increased 40% and short legs increased 160% compared to normal environment. 40%/160% is huge difference. I speak from experience. This is something you'll only learn after dealing with it firsthand which PnL charts can't graph.", "score": 1, "replies": [{"body": "It’s at 220% because it’s 0.50 while the longs are worth 2.00. Lol.", "score": 1, "replies": [{"body": "That's if you're playing the same expiration, this is a difference in time spread or diagonal/horizontal.. You think an increase of long legs of 40% in IV and short legs 160%+ equates to long legs being more in-profit than short legs from the IV expansion man you're clueless", "score": 1, "replies": []}]}]}]}, {"body": "Anyways, you think you know but you don’t know what you don’t know.  Next time you tell me 1+1 =3 and I’m just gonna agree with you instead of wasting my time.  Yes you are correct that a Vega positive trade and a theta positive trade will lose money with the passage of time and with an increase in IV.\n\nLooks like you need to stay up later to study some more. Lol.", "score": 1, "replies": [{"body": "You need more action in the field, trade it. Let's see how you do buying an ATM calendar with 5 days till expir. which stays flat and IV expands, most likely make +10%/-10% range closing before earning's with 2dte, it won't do much imo. You're saying otherwise?", "score": 1, "replies": []}, {"body": ">*You need more action in the field, trade it. Let's see how you do buying an ATM calendar with 5 days till expir. which stays flat and IV expands, most likely make +10%/-10% range closing before earning's with 2dte, it won't do much imo. You're saying otherwise?*\n\n\"By you buying to close the short call right before earnings means you are paying a premium for the call because IV will be high. You are essentially buying high to close. You will gain some theta but it is hard to say how much because the increase in IV leading up to earnings could very well offset it and it could turn out to be a small profit or could also be breakeven or a loss.\", closing long legs but if IV expansion doesn't cover Theta decay then back to my point or what you wrote best", "score": 1, "replies": [{"body": "This trade was referring to your directional calendar. You said you were gonna do a 125 while NVDA is at 110.  Then if NVDA goes up to 125, you said you were gonna buy to close the shorts and leave your longs.  That’s a bad idea and that’s why I put that. In that situation, it’s better to close as a spread since that would be profitable.", "score": 1, "replies": [{"body": "Anyways I appreciate the opportunity to discuss view points more intensely. It's good practice in practice. Thanks for your knowledge, end of the day hope we all make money.", "score": 1, "replies": [{"body": "How’s that diagonal spread in the middle doing? It doesn’t look like it’s doing what it’s supposed to be doing. I hope it works out for you.", "score": 1, "replies": [{"body": "It's doing exactly what it should be doing. The difference in intrinsic value between the strikes makes it impossible to \"doesn't look like it's doing what it's supposed to be doing\", lol like what?\n\nIf strikes are blown past, the difference in intrinsic value is my profit. If played a calendar than yeah you could crawl back to try and dissuade me like as if things were going wrong. It's working out beautifully actually. Up 20% on the double calendars, 12% on the middle calendar, and 45% on the $140 calls.", "score": 1, "replies": [{"body": "Why is the position losing money? That diagonal spread in the middle is now worth less.", "score": 1, "replies": []}, {"body": "The difference in intrinsic value is 1 but you paid more than 1 for the spread.", "score": 1, "replies": [{"body": "[https://imgur.com/mSyxRkv](https://imgur.com/mSyxRkv)\n\nYou came back 5 days later to tell me this position is at a loss, it's not. Goes to show what you know. I'll close this for a profit thanks for the concern.", "score": 1, "replies": [{"body": "Lol. That’s why the back to back week 110 call calendar spread 8/30-9/6 is up 10% same as your middle 1 point diagonal while taking less risk. All your analysis about it losing money due to theta and vega is completely wrong.  That’s shows you don’t understand options like you think you do. And just because you have a 1 point diagonal spread that’s deep ITM  does not mean you don’t have risk to the upside.  If NVDA goes to 150 or higher, your 1 point 8/30-9/13 diagonal spread will lose money to the upside. Right now your (1 point diagonal) short 8/30 calls already have a higher delta than your long 9/13.  You forgot to factor in that the short will pick up faster deltas than the longs the deeper it goes in the money.", "score": 0, "replies": [{"body": "Didn't read that wall of text on this beautiful Sunday, you said the position was at a loss. It's not, stop backtracking trying to save face fool.", "score": 1, "replies": [{"body": "Ok bud", "score": 1, "replies": [{"body": "Should go outside talking about options on the weekend ouch...", "score": 1, "replies": [{"body": "Thank you", "score": 1, "replies": [{"body": "<3", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": " I can clearly see you have a ways to go, there's a point when you'll understand not being cheap with options is *safer*.\n\nYou will realize in a few years that what you know now is only 10% of everything that needs to be learned.", "score": 1, "replies": [{"body": "Uh what, I'm suggesting to you to spend more, you realize that... You're the one wanting to buy the following week out, as a calendar even like as if that's better to cover the dead zone. Don't preach the advice I gave when you're not following through with it to begin-with. I'm ahead of you in options based off what you've said you ignore greeks, fail to understand IV expansion, and focus too much on PnL chart & your past wins as if big returns hold some merit. I'm convinced you're trolling by this point lol.", "score": 1, "replies": [{"body": "You’ll realize years later it is all about ROI in options. So spending less to get more in the key.  If you buy something for 0.50 and sell it for 1.50 (1.00  profit 200% ROI) to me that is better than buying some for 1.00 and selling for 2.10 ($1.10 profit but 110% ROI.", "score": 1, "replies": []}]}]}]}, {"body": "Also, I don't just buying the 2nd week out, I compare the cost of the 1st, 2nd and 3rd week relative to the greeks they present. If I'm not getting clear advantage buying the 3rd week relative to its higher cost compared to the 2nd week, I'll go with the 2nd week. You're not using your greeks, you're not comparing greeks when shopping, and it shows. Use your greeks. It's not a set formula, I'm shopping for the best greeks relative to price. 2nd week presents far more lucrative play/greeks relative to cost than 3rd and 1st week in this trade.", "score": 1, "replies": []}]}]}]}]}, {"body": "Buying the 2nd week out has less Theta, more Vega and Delta vs. buying the following week after earning's. So my long legs gain better with the IV expansion, and gain better with price movement so they are not ran through so easily when short legs go crazy high in IV. Buying the following week out is cheaper but in reality it's a trap, the PnL doesn't account for IV expansion, which I'm prepared for because I have experience knowing what happens and how PnL's cannot be trusted when trading anything involving IV moving up or down quickly.\n\nI buy the 2nd week out instead of following week to better handle the IV expansion which you're not accounting for and just seeing the cheaper costs of buying the following week out. Clearly you're not actually comparing the greeks of the long legs. Use your greeks, compare what you're buying. 2nd week does better when IV expansion happens, and diagonal helps tiniest bit too as well with the greeks and instrinsic value. I recognize better what am doing now by teaching so this is good convo.", "score": 1, "replies": []}]}, {"body": "The middle back to back weeks calendar in the middle is not meant to make money when NVDA moves in either direction.  You have the 90 put and 130 calls for that.  It is meant to have a profit zone in the middle if, NVDA stays at 110.  If it moves to 130 or 90, you will lose the 0.58 but that is a cheap hedge to fill the void in the center and your other calendars on either side will most likely be profitable.  Your diagonal in the diagonal in the middle most likely will be losing if NVDA is around 95 or so since it is a positive delta diagonal.", "score": 1, "replies": [{"body": "Not getting it, the calendar in the middle absolutely won't profit or cover the costs of the double calendar's dead zone, which is the entire point. If the price stays flat and IV expanded., closing an ATM calendar with IV expansion, I'm going to lose money is what you're not getting. I'll  have to pay more to close the calendar before earning's cause IV expansion, and it's not covered my dead zone in reality.\n\nIf price stayed flat, I lose on double calendar and the calendar you're mentioning. Buying 8/30 - 9/13 ATM calendar is a terrible idea, it won't do anything for me. If price stays flat, I'll lose to Theta on long legs and IV expandion pumps short legs way past my original credit received, you realize that would be a costly loss to try to close then....", "score": 1, "replies": [{"body": "Why do you think the NVDA options with 1 week to go ATM won’t be worth 3.00. Look at Aug 16 which is 3 DTE  109 calls ATM.  It is trading for 3.05-3.15.  This expiration date is not inflated IV because it is before earnings. If a 3DTE ATM is worth 3.05-3.15, a 7 DTE would be >3.15 wouldn’t it?  That would cover your 2.68 debit on your double calendars wouldn’t it?  I have done a lot of back to back week calendars as well as multiple months out and selling shorter term to do diagonals so I know for a fact back to back weeks work. \nI even do back to back 1 DTE on SPY as well as 2-7DTEs on GLD or whatever ticker fits my criteria.", "score": 1, "replies": [{"body": ">It is trading for 3.05-3.15.  This expiration date is not inflated IV because it is before earnings. If a 3DTE ATM is worth 3.05-3.15, a 7 DTE would be >3.15 wouldn’t it?\n\nNow you're starting to get it, you sell the the 7DTE  and make $3.15, then it's the day of earning's and IV will expand to levels of 180%-230%, this not even 3dte but just 1dte ATM as example which now costs $5.50 to close, congratulations you just lost $235 thinking you could profit because Theta's on your side when in reality got smoked to IV, so you close for a loss before earning's release. That's where you're lacking experience, you're trusting your PnL too much without realizing how nasty IV expansion is or accounting for it. Your PnL is totally inaccurate without account for IV pumping to 200% before earning's.", "score": 1, "replies": [{"body": "You’ll be buying the short for 5.50 and selling the long for 7.50 so you’ll get a credit for 2.00 and you bought it for a debit of 0.50. That’s a winner in my book.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I think I was one of those who asked for the visuals but this makes my head hurt lol I don’t even know where to start to break this down. Any recs on good videos in particular on how to build trades pre-earnings?", "score": 1, "replies": [{"body": "Rebuild the trade, $91/$130, double calendar, then open another tab and make the diagonal $110/$111, want to take it up a notch look at the greeks between 9/6, 9/13 and 9/20 and compare the greeks. It'll make a lot more sense it's not that complex. Just really wide ranges to profit from, if IV expansion doesn't overpower me, if price is flat am 2 days till expir. with $20 to either strike which is pretty damn far, should get to close short legs for a gain and not a loss thanks to being Theta positive for 3 weeks, so far OTM strikes and so close till expir.", "score": 1, "replies": []}]}, {"body": "I'm a bit confused on why you're selling the 8/30s...those being the week of earnings will experience the biggest gain in IV. The 9/13's that you bought wont' go up in IV as much as the 8/30. So if it's a vega play, your short is going to go against you. I've done these but set up buy buying the 8/30 and selling the 8/23...a play on vega increase. And if delta goes your way plus (if you're OTM).", "score": 1, "replies": []}]}
{"title": "Options Questions Safe Haven weekly thread | Aug 12-18 2024", "selftext": "For the options questions you wanted to ask, but were afraid to.  \n**There are no stupid questions.**  &nbsp;  **Fire away.**  \nThis project succeeds via thoughtful sharing of knowledge.  \n**You, too, are invited to respond to these questions.**  \nThis is a weekly rotation with past threads linked below.\n\n----\n\n###**BEFORE POSTING,  PLEASE REVIEW THE BELOW LIST OF FREQUENT ANSWERS.**   [.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)    \n[..](https://www.reddit.com/r/optionsmods/wiki/)   \n\n---\n\n**Don't exercise your (long) options for stock!**   \n**Exercising throws away [extrinsic value](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value) that selling retrieves.**   \n**Simply sell your (long) options, to close the position, to harvest value, for a gain or loss.**  \n**Your break-even is the cost of your option when you are selling.**  \n**If exercising (a call), your breakeven is the strike price plus the debit cost to enter the position.**  \nFurther reading:   \n**[Monday School: Exercise and Expiration are not what you think they are.](https://www.reddit.com/r/options/comments/m5r8mi/monday_school_exercise_and_expiration_are_not/)**    \n\n**Also, generally, do not take an option to expiration, for similar reasons as above.**\n\n---\n\n**Key informational links**  \n•&nbsp;[Options FAQ / Wiki: Frequent Answers to Questions](https://www.reddit.com/r/options/wiki/faq)  \n•&nbsp;[Options Toolbox Links / Wiki](https://www.reddit.com/r/options/wiki/toolbox/links)  \n•&nbsp;[Options Glossary](https://www.optionseducation.org/referencelibrary/optionsglossary)   \n•&nbsp;[List of Recommended Options Books](https://www.reddit.com/r/options/comments/8qfs14/options_book_list_review_of_all_books_that_helped/)    \n•&nbsp;[Introduction to Options (The Options Playbook)](https://www.optionsplaybook.com/options-introduction/)  \n•&nbsp;[The complete r/options side-bar informational links (made visible for mobile app users.)](https://www.reddit.com/r/options/about/sidebar)  \n•&nbsp;[Characteristics and Risks of Standardized Options (Options Clearing Corporation)](\nhttps://www.theocc.com/about/publications/character-risks.jsp)  \n•&nbsp;[Binary options and Fraud (Securities Exchange Commission)](https://www.sec.gov/files/ia_binary.pdf)   \n[.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)\n\n ----\n\n**Getting started in options**   \n•&nbsp;[Calls and puts, long and short, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/basics)     \n•&nbsp;[Options Trading Introduction for Beginners (Investing Fuse)](https://investingfuse.com/options-trading-for-beginners/)    \n•&nbsp;[Options Basics (begals)](https://www.reddit.com/r/options/comments/gh9vpl/options_basics/)  \n•&nbsp;[Exercise & Assignment - A Guide (ScottishTrader)](https://www.reddit.com/r/options/wiki/faq/pages/exercise)  \n•&nbsp;[Why Options Are Rarely Exercised - Chris Butler - Project Option (18 minutes)](https://www.youtube.com/watch?v=PsZsqiBFnmo)  \n•&nbsp;[I just made (or lost) $___. Should I close the trade? (Redtexture)](https://www.reddit.com/r/options/comments/eunnko/noob_safe_haven_thread_jan_27_feb_02_2020/fg6jjjz/)    \n•&nbsp;[Disclose option position details, for a useful response](https://www.reddit.com/r/options/wiki/faq/pages/trade_details)  \n•&nbsp;[OptionAlpha Trading and Options Handbook](https://optionalpha.com/handbook)   \n•&nbsp;[Options Trading Concepts -- Mike & His White Board (TastyTrade)(about 120  10-minute episodes)](https://www.youtube.com/playlist?list=PLPVve34yolHY43YaBegHMzN9WjrTnQfFr)  \n•&nbsp;[Am I a Pattern Day Trader? Know the Day-Trading Margin Requirements (FINRA)](https://www.finra.org/investors/learn-to-invest/advanced-investing/day-trading-margin-requirements-know-rules)   \n•&nbsp;[How To Avoid Becoming a Pattern Day Trader  (Founders Guide)](https://foundersguide.com/pattern-day-trader/)    \n\n---\n\n**Introductory Trading Commentary**   \n&nbsp;&nbsp;&nbsp;•&nbsp;**[Monday School Introductory trade planning advice (PapaCharlie9)](https://www.reddit.com/r/options/wiki/faq/pages/mondayschool)**  \n&nbsp;&nbsp;**Strike Price**   \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Basics: How to Pick the Right Strike Price (Elvis Picardo - Investopedia)](https://www.investopedia.com/articles/active-trading/021014/options-basics-how-pick-right-strike-price.asp)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[High Probability Options Trading Defined (Kirk DuPlessis, Option Alpha)](https://www.youtube.com/watch?v=DcWHh2co80M)   \n&nbsp;&nbsp;**Breakeven**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Your break-even (at expiration) isn't as important as you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/m0m7at/monday_school_your_breakeven_isnt_as_important_as/)  \n&nbsp;&nbsp;**Expiration**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Expiration & Assignment (Option Alpha)](https://www.youtube.com/watch?v=OnUsu1y1W9w)    \n&nbsp;&nbsp;&nbsp;•&nbsp;[Expiration times and dates (Investopedia)](https://www.investopedia.com/terms/e/expiration-time.asp)  \n&nbsp;&nbsp;**Greeks**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Pricing & The Greeks (Option Alpha) (30 minutes)](https://www.youtube.com/watch?v=kCJcEOYuuII)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Greeks (captut)](https://www.reddit.com/r/options/comments/hl8i2n/option_greeks_101)  \n&nbsp;&nbsp;**Trading and Strategy**    \n&nbsp;&nbsp;&nbsp;•&nbsp;[Fishing for a price: price discovery and orders](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_minimizing_bid-ask_spreads_.28high-volume_options_are_best.29)     \n&nbsp;&nbsp;&nbsp;•&nbsp;[Common mistakes and useful advice for new options traders (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_common_mistakes_and_useful_advice_for__new_options_traders)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Common Intra-Day Stock Market Patterns - (Cory Mitchell - The Balance)](https://www.thebalance.com/common-intra-day-stock-market-patterns-1031456)    \n&nbsp;&nbsp;&nbsp;•&nbsp;[The three best options strategies for earnings reports (Option Alpha)](https://optionalpha.com/blog/the-three-best-option-strategies-for-earnings)   \n\n---\n\n**Managing Trades**  \n•&nbsp;[Managing long calls - a summary (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/managing_long_calls)  \n•&nbsp;[The diagonal call calendar spread, misnamed as the \"poor man's covered call\" (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/diagonal_calendars)  \n•&nbsp;[Selected Option Positions and Trade Management (Wiki)](https://www.reddit.com/r/options/wiki/faq/pages/positions)  \n\n**Why did my options lose value when the stock price moved  favorably?**  \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value)\n      \n**Trade planning, risk reduction, trade size, probability and luck**  \n•&nbsp;[Exit-first trade planning, and a risk-reduction checklist (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/trade_planning)  \n•&nbsp;[Monday School: A trade plan is more important than you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/mpk6yf/monday_school_a_trade_plan_is_more_important_than/)  \n•&nbsp;[Applying Expected Value Concepts to Option Investing (Option Alpha)](https://optionalpha.com/blog/how-to-calculate-expected-value)  \n•&nbsp;[Risk Management, or How to Not Lose Your House (boii0708) (March 6 2021)](https://www.reddit.com/r/options/comments/lyp1uc/risk_management_or_how_to_not_lose_your_house/)  \n•&nbsp;[Trade Checklists and Guides (Option Alpha)](https://optionalpha.com/members/guides-checklists)    \n•&nbsp;[Planning for trades to fail. (John Carter)  (at 90 seconds)](https://youtu.be/N5_OkdvPmUI?t=90)    \n•&nbsp;[Poker Wisdom for Option Traders: The Evils of Results-Oriented Thinking (PapaCharlie9)](https://www.reddit.com/r/options/comments/qfq82a/poker_wisdom_for_option_traders_the_evils_of/)   \n\n**Minimizing Bid-Ask Spreads (high-volume options are best)**   \n•&nbsp;[Price discovery for wide bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/price_discovery)  \n•&nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)  \n\n\n**Closing out a trade**  \n•&nbsp;[Most options positions are closed before expiration (Options Playbook)](https://www.optionsplaybook.com/options-introduction/closing-option-position/)       \n•&nbsp;[Risk to reward ratios change: a reason for early exit (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/risk_reward_and_exits)   \n •&nbsp;[Guide: When to Exit Various Positions](\nhttps://www.reddit.com/r/options/wiki/faq/pages/whentoexit)   \n•&nbsp;[Close positions before expiration: TSLA decline after market close (PapaCharlie9) (September 11, 2020)](https://www.reddit.com/r/options/comments/ipqkua/fridays_tsla_lesson_close_positions_before/)   \n•&nbsp;[5 Tips For Exiting Trades (OptionStalker)](\nhttps://www.reddit.com/r/options/comments/qtwsm5/5_tips_for_exiting_trades/)   \n•&nbsp;[Why stop loss option orders are a bad idea](https://www.reddit.com/r/options/wiki/faq/pages/stop_loss)   \n\n---\n\n**Options exchange operations and processes**     \n•&nbsp;[Options Adjustments for Mergers, Stock Splits and Special dividends; Options Expiration creation; Strike Price creation; Trading Halts and Market Closings; Options Listing requirements;  Collateral Rules; List of Options Exchanges; Market Makers](https://www.reddit.com/r/options/wiki/faq/pages/exchange_operations)   \n•&nbsp;[Options that trade until 4:15 PM (US Eastern) / 3:15 PM (US Central) -- (Tastyworks)](https://support.tastyworks.com/support/solutions/articles/43000435335-options-that-trade-until-3-15-pm-central-)  \n\n---\n\n**Brokers**   \n•&nbsp;[USA Options Brokers (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/brokers)    \n•&nbsp;[An incomplete list of international brokers trading USA (and European)  options](https://www.reddit.com/r/options/wiki/faq/pages/brokers/)  \n\n---\n\n**Miscellaneous: Volatility, Options Option Chains & Data, Economic Calendars, Futures Options**   \n•&nbsp;[Graph of the VIX: S&P 500 volatility index (StockCharts)](https://stockcharts.com/h-sc/ui?s=vix)  \n•&nbsp;[Graph of VX Futures Term Structure (Trading Volatility)](http://www.tradingvolatility.net/p/datasourceurldocs.html)  \n•&nbsp;[A selected list of option chain & option data websites](https://www.reddit.com/r/options/wiki/faq/pages/data_sources)  \n•&nbsp;[Options on Futures (CME Group)](https://www.cmegroup.com/education/files/options-on-futures-brochure.pdf)  \n•&nbsp;[Selected calendars of economic reports and events](https://www.reddit.com/r/options/wiki/faq/pages/calendars)  \n\n---\n\nPrevious weeks' Option Questions Safe Haven threads.\n  \n[Complete archive: 2018, 2019, 2020, 2021, 2022, 2023, 2024](https://www.reddit.com/r/options/wiki/faq/archive/safe_haven_2024)\n---\n\n---", "id": "1erf9y8", "created_utc": 1723573542.0, "score": 5, "upvote_ratio": 0.74, "num_comments": 245, "comments": [{"body": "I've got $600 and I wanna grow it\n\nI know about swinging shares and am considering it, but I'm curious whats the best options strategy to do it?\n\nI can't sell premium because I don't have the margin for it so nothing involving short selling\n\nMaybe an in the money debit spread?", "score": 2, "replies": [{"body": "There is no best option strategy.    \n\n\nFirst one must start with some knowledge and perspective on an underlying stock and company, and than have an option point of view relying on that perspective.\n\n\n\n\nDebit spreads can be useful for constructing relatively  cost trades with limited risk.\n\n\n\n  Please review the educational links at the top of this weekly thread.  \n\n\nThey were intended for new traders.  \n\n\n\n\n  Start with **Calls and puts, long and short, an introduction**.    \n\n\nIn general, it is very difficult  to trade with less than 2,000 dollars in your account.", "score": 1, "replies": []}]}, {"body": "I have a quick question that i hope y'all can assist with. I currently have 50 contracts on BABA strike 70 with an exp date of Aug 16 (3d) \n\nI Normally hawk on my options trading, so I've never had to figure this out since I would manually close my positions; however, I'll be in the Pacific time zone for work (Baba earnings are pre-market on Thursday) and can't figure out how to put a stop loss/stop gain. I'm currently OTM with a maximum loss of 633$, and I'm ok with that, but I'd like to be able to set up an order that allows me to take profit. (Anyalyist are saying stock could go to 60 but I'd be fine with taking profit at or around 67$ (give or take 12k profit))\n\nIf it helps, I use Charles / ToS and can place the order either way. So, is there a way to set a stop market order to sell my puts when the stock hits 67, or will I need to do it another way?\n\nAs a side note, I'm mostly a buy-and-hold-until-I-die investor and only play options on a select few stocks per year, so please forgive any ignorance on my part.", "score": 1, "replies": [{"body": ">I'd be fine with taking profit at or around 67$\n\nThis question comes up a lot.  How do you know this, given that you can't predict what your contracts will actually be worth if BABA goes down to 67 on Thursday?  An option's premium isn't in a one-to-one correspondence with the underlying's price.\n\nThe concept you are asking about exists; it's called a conditional order in Thinkorswim.  You create an order that will trigger to be submitted to the exchanges when a certain condition is reached: in this case, that BABA goes to or below 67.  The problem is, what kind of order do you want to be submitted?  A market order?  Then you have no idea what price you will actually get for your puts.  A limit order?  Then how do you choose a limit, given that you can't predict the options' premium, and if you guess, your order might never fill since the premium might never reach that limit even if BABA reaches 67?", "score": 2, "replies": [{"body": "That was my concern. I don't think with me being out of town, that I'll be able to watch the charts as I can on a normal M-F. Might just have to suck it up and set an early alarm and keep an eye on it.\n\nI got informed yesterday that I had to go on this trip, and it was like, bruh. Worse case I lose the full 600 oh well.", "score": 1, "replies": []}]}]}, {"body": "Is it reasonable to not want to trade even if the trend is going the way I want it to, but the price action isn't what I like? I feel it might be ok to trade stocks like that, but trading options with the underlying slowly grinding higher/lower seems much riskier. thx", "score": 1, "replies": [{"body": "> Is it reasonable to not want to trade even if the trend is going the way I want it to, but the price action isn't what I like?\n\nSure. The opposite is also reasonable, you like the price action, but the trend is wrong. Or at least, for each of the situational combinations, it is possible to come up with a rational justification to trade or not to trade.\n\nFrankly, the only thing I consider unreasonable is a decision that is purely irrational. Like you hesitate trading because your horoscope for that day said you will encounter financial disaster, or something like that.", "score": 2, "replies": []}]}, {"body": "I recently sold 22 $7 covered calls at $0.10 with and expiration date of 1/16/26. I've heard that the upcoming merger is likely to take place before the end of the year. Does anyone know how they handle OTM covered calls when a merger happens? Do they just expire and I would keep the premium? Or would it become a CSGP option?", "score": 1, "replies": [{"body": "You left out some key information, like the ticker symbol. When a merger, or any kind of corporate action, is planned, do the following google search:\n\ntheocc XXX option adjustment\n\nWhere XXX is the ticker symbol in question. That should provide a link to a PDF memo that describes exactly what will happen to your covered calls and when.", "score": 1, "replies": []}]}, {"body": "Is this a proper way to hedge a short sell? I have been working with it while paper trading and it seems like I have my calculations correct, but I could be missing a downside.\n\nLet's use $ASTS as an example (this is all paper trading). I shorted 1000 shares at a price of $22.32 and bought 10 8/16 $22C contracts as a hedge. The current P&L is +$360 ($1,360 gain on the shares and $1,000 loss on the options).\n\nAssuming the stock continues down, the maximum loss on the options is $2,400, so my gains will essentially only be capped by this (it looks like it trends as a 30% gain potential until I hit the maximum loss on the options). So if ASTS falls to $16 by Friday, I would likely be looking at a $3,600 gain ($6k from the shares and $2.4k loss on the contracts).\n\nIf it falls only to $20 by Friday, I would by looking at an $80 loss due to the options expiring worthless, so I would then be left \"naked\" shorting ASTS into the next weeks...seems like buying calls to hedge would negate any potential future gains.\n\nIf the stock goes to $26 on Friday, it seems like there is a few paths: 1) exercise the options to cover the short, buying 1000 shares at $22, losing $320; 2) sell the options for $4,000, buy the shares back $3,800 more than I received, but net $200; 3) sell the options, profiting $1,600 and then gamble that ASTS will fall substantially.\n\nI know the margin interest impacts the profits, so lets say is $8/day while shorting. More than 3 weeks shorting seems to take away any potential gains. The biggest loss seems to be the stock staying flat and the option price falling while the shares don't move and then it can close just below the strike price causing a $2,400 loss plus the margin rate. My practice for this has been to close after 30 days, so far it is 40% win rate with a net positive of $200 (most being small dollar paper trade bets to mimic my own personal risk sensibility, this ASTS example is me playing with larger risks).\n\nso worst case for the above is $2,400 loss with shares closing at $21.90 on Friday, I opened this trade on 8/8 at the end of the day, so the margin loss would be $64 for the 8 days, buying shares back would be $420 (so $2,884 total).\n\nFrom my paper trading, it seems like the 30-60DTE options pan out better, they cost more but it provides a longer runway for the short to work out (less theta decay on the option as well). The ASTS one is skewed with the IV for the upcoming earnings, but I want to see how this works out.", "score": 1, "replies": [{"body": "Others may reply, but why short shares and not just use options which will be more capital efficient? For options a spread can be used to hedge and make defined risk.", "score": 1, "replies": []}]}, {"body": "Probably a silly question, but i've been learning about selling call and put options for things like a covered call, etc. But I only physically know how to buy a call/put option.. like in my broker account with wealthsimple. You click buy, and you pick call/put. How does one actually SELL a option? Yes, i tried googling it, but it just tells you what they are. I'm guessing its an advanced feature on different trading platforms, or I'm just stupid.", "score": 1, "replies": [{"body": "They do not permit selling of options. See the FAQ near the bottom of this page that shows they only allow buying - [Options trading made simple | Wealthsimple](https://www.wealthsimple.com/en-ca/self-directed-investing/options)", "score": 1, "replies": []}]}, {"body": "Hello. I just needed some advice on a call option I have. I bought a NVDA $115 Call Aug 23 expiry at $110 OTM and it just hit ITM. Assuming the price of the stock is still going to go up, how much longer can I hold this to maximize my profit before I sell the option? The option has -0.21 Theta. I know time isn't on my side but the price of my contracts are going up. Thanks!", "score": 1, "replies": [{"body": "Just because it goes ITM doens't mean it's profitable. And, a call doesn't have to go ITM to be profitable.\n\nYou included a lot of useful details, but you left out the most important ones. How much did you pay for the call to open and what is it worth now?\n\nOnce all that is sorted out, read this:\n\n[Risk to reward ratios change: a reason for early exit (redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/risk_reward_and_exits)", "score": 1, "replies": [{"body": "Bought the contracts at $2.60 per. The current price is at $5.15 and up 96% (+4k). Call expires Aug 23. Should I hold on to it a little bit longer since the price is going up or take it close to expiry before selling?", "score": 1, "replies": [{"body": "That's great, congrats! What are you waiting for? Isn't a 96% profit enough for you? My conventional trading exit strategy for calls is a 10% gain, so you are more than 9x above the level that I would have already exited at.\n\nGreed is the downfall of most traders. Read the link I provided earlier, it will save you a lot of money.", "score": 1, "replies": [{"body": "Thanks! Honestly I was going for a 10%-20% gain as well usually but the last 2 days have been crazy for NVDA. I'm expecting for it to hit $120 maybe at the end of this week or sometime next week and it's why I'm holding it out longer. I am considering selling more than half of the contracts I have right now and let the rest ride till next week and see what happens. Also, reading the link you posted. Thanks for the information!!", "score": 1, "replies": [{"body": "There is a simple solution. Close the current trade, bank half the profit, use the other half of the profit to buy a cheaper call. That way, you are still in the running for additional upside, but with significantly reduced risk of loss should the trade go completely against you.\n\n\"Let your winners run,\" is perhaps the stupidest and most dangerous meme that traders have ever come up with. There's no reason to do so when you can instead take risk off the table but still stay in the game for more upside.", "score": 1, "replies": [{"body": "Thanks for the advice. Did just that. Sold it all and bought more but the contracts price was more expensive unfortunately but that's probably due to earnings I'm guessing.", "score": 1, "replies": [{"body": "Well, you were supposed to go more OTM in order to get cheaper calls, but too late now.", "score": 1, "replies": [{"body": "I bought $130 sep 13 call OTM", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Newbie\nHey looking to get into option trading. Im a realtor and made good money but being a people's person is draining. Looking to shift into option trading can you guys give me some tips. The best platform to trade on, systems used, any strategies used, YouTube videos,etc.\nVery appreciative of the help", "score": 1, "replies": [{"body": "I'd encourage you to take some training on the basics before putting any money at risk. Options are complex and leveraged so can lose a lot of money quickly and unexpectedly when you don't know what you are doing.\n\nTry this for the basics to get started - [Essential Options Trading Guide (investopedia.com)](https://www.investopedia.com/options-basics-tutorial-4583012)\n\nPaper trading to practice and learn how it all works can be very helpful to learn how options and the broker platform works. If you want to do this in a serious way, then look at a full featured broker and trading platform like Think or Swim (TOS). Here is a link to a free paper account - [thinkorswim Guest Pass | Charles Schwab](https://www.schwab.com/trading/thinkorswim/guestpass)\n\nStarting with a basic and simple options strategy will help ease you in. Complex is not always better with options, as many find out. Covered calls is where you buy 100 shares of a good stock you don't mind holding anyway and then sell calls for income, and possible sell the shares higher which can make profit in two ways - [The Basics of Covered Calls (investopedia.com)](https://www.investopedia.com/articles/optioninvestor/08/covered-call.asp)\n\nTake the next few months to learn the basics, get set with a broker, and sell CCs for a while which will give you a good foundation of how to make an income using options.\n\nAs a side note, options trading income can be much like being a realtor in that there will be months when trades bring in a good income, but then times when there is less income, so saving and managing income is part of being a trader.", "score": 2, "replies": []}]}, {"body": "had a SPY call expiring today at 542 strike. when markets closed at 4pm it fidelity/google showed that it was ~541.97. But after i checked again a few hours later it was saying SPY closed at 542.04. Is this a daily occurrence or did something happen?\n(don't care that the underlying gets called away)", "score": 1, "replies": [{"body": "With a move that small it looks like the index was tweaked shortly after close as all of the underlyings settled.  The S&P is base on 500 underlying stocks.  It’s reasonable to have a bit of a lag.  My guess is that the movement stopped in the first 15 min or so after close.", "score": 1, "replies": []}]}, {"body": "What strategies should I consider for a bullish underlying whose covered calls are no longer profitable to sell?\n\nHi folks. I’m a beginner, so bear with me if something doesn’t make sense. Happy to answer follow ups in the comments for additional context. \n\nI have an underlying that I am bullish on for the long term. I have 100 shares, and some LEAPS calls on it. I’m comfortable letting go of the shares at X price. I’m planning to roll out the LEAPS calls once the new expirations are added in September. \n\nI was selling covered calls on the shares until the premiums became lower than what I’d be comfortable with from a risk/reward/tied-money perspective. \n\nNow I’m just sitting on the shares wondering how else I can use them to generate returns.\n\nWhat other strategies should I consider? Other than just waiting for CC premiums to pick up again.", "score": 1, "replies": [{"body": "Other ways to remain bullish could be something like a bullish vertical spread assuming your accoun’t can do spreads.   You can define your various risk factors by your choice of contracts.  You would evaluate those risks by looking at the position Greeks of the spread.  If you don’t know what those are, I would suggest making that an area of study before putting on any type of spread.", "score": 1, "replies": [{"body": "Thanks for the input. I’ll study bullish vertical spreads first. \n\nHave an immediate question in case you can provide a shortcut. The call premiums for the strike price I’m willing to accept are 0.01 at the moment. I’m looking at the weeklies to take advantage of theta decay. Would the current worthless premiums make this strategy untenable?", "score": 1, "replies": [{"body": "The keys to picking strikes for CC are 1) premium worth the risk, and 2) a strike that you are ok with assignment.\n\nIt sounds like your issue is your timeframe.  If you are trying to sell within a week, yes, you‘ll get theta decay but there likely isn’t much extrinsic value to decay.  You may want to consider looking further out in time.  Yes, it will take longer but you may find a better risk/reward.  It’s not uncommon to go out as much as 30 or even 45 days on the shorts.  You don’t have to go out that far but from the prices you are saying it sounds like the stock isn’t particularly volatile so really short term premiums could be low.", "score": 1, "replies": [{"body": "Yes, the issue right now is timeframe, so I wanted to see if there was something I could do with weekly contracts while the cc premiums pick back up. Other than waiting, but it seems that that might be my best/simplest option for now.", "score": 1, "replies": [{"body": "That’s where looking at things like verticals might be better.  Low premium is low premium regardless of your strategy but at least with a vertical you can scale it up and you’re not limited to the number of shares you hold like a CC (1 contract per 100 shares).", "score": 1, "replies": [{"body": "👍 thanks!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Don’t participate in options, so any help is appreciated. I own around 10k shares in a company that won’t be profitable and see significant revenue for a year or so. The price fluctuates between 0.70 and 1.10 depending on news and other random factors. I want to employ a safeish options strategy to substantially increase the amount of my shares in this company while the price is low. What would my best option be? Thanks a ton.", "score": 1, "replies": [{"body": "Buying Calls would be a way to get levered exposure to additional shares. You do risk losing the cost of the Calls.", "score": 1, "replies": []}, {"body": "Do you work at this company? It's not clear if you do or not. If you do, first make sure your HR's Equity Compensation department allows you to speculate on company stock. Some companies, particularly large public companies, have policies against doing so.\n\nAssuming it's okay, I wouldn't bother with options. If the company is pre-IPO, there won't be any options you can trade. If it is a public company, it's unlikely that the stock has options. If it does have options, the options on likely going to be delisted, since the stock won't meet the minimum capitalization criteria for standard options.\n\nIf you'd share the ticker I could say more, but if for some reason you need to keep it a secret, my advice would be to just buy shares directly.  It's literally a penny stock, so there's really no reason to bother with options. Buy on margin if you want leverage that much.", "score": 1, "replies": []}]}, {"body": "Can someone explain why this spread isn't green?\n\nhttps://imgur.com/ne34Zzj\n\nI'm just doing it to learn how debit spreads work so Im not saying it should be max profit right now, but why is it losing money? Shouldn't it be atleast a little green?\n\nThe value of the long leg is 2.35, the value of the short leg is 2.10, so why is PNL -2.04?\n\nPrice of the underlying at the time of the screenshot was like 21.53 or something\n\nIs it the bid/ask spread?", "score": 1, "replies": [{"body": "If the value of the long is 2.35 and of the short is 2.10, the value of the spread as a whole is 0.25.  If you paid more than  that for it, it's at a loss.  You haven't told us how much you paid for it, but if P/L is -2.04, I'm guessing you paid 2.29?", "score": 1, "replies": [{"body": "Ah right I forgot about commissions and fees", "score": 1, "replies": [{"body": "Commissions and fees don't account for such a difference.  The spread has lost significant value since you bought it.  What did you pay for it, and when exactly did you buy it?", "score": 1, "replies": [{"body": "I've closed it now but if I recall correctly I bought it today morning and the cost basis was $28 USD", "score": 1, "replies": [{"body": "So a price of 0.28.  ASTS is down since this morning so pf course the value of a bull call spread would go down.", "score": 1, "replies": [{"body": "Value was above my spread when I took that photo though", "score": 1, "replies": [{"body": "It doesn't matter.  If it was even more above your spread when you opened it, then it came down but was still above your spread, it lost value.  A debit spread isn't automatically in profit just because both legs are ITM.  If that were true, there would be free money--you could open a spread with both legs already ITM and make instant profit.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Brand new to this. What’s a good ROI? I bought and sold an option today for +60%, I’ve seen some people hit for +400% or even higher around Reddit, but I’m sure that’s just a home run once in a while and not stable profit right?\n\nEdit: Definitely could have held on longer but I wanted a guaranteed profit", "score": 1, "replies": [{"body": "Being brand new, any non-negative ROI is a good start. But you'll likely start out negative, that's just part of the learning process.\n\nThe gain/loss of any one trade is irrelevant. I'd rather see the average after 1000 trades or more. Anyone can get lucky, so you need frequency to average out luck.\n\nGiven that, I think a very reasonable target to shoot for is 10% ROI a year, or after 1000 trades, whichever comes first. Once you have more experience, you can bump that up to 20% a year, which is would be doing better than the market average.", "score": 1, "replies": []}]}, {"body": "I made a post that got auto-deleted by the automod because they think the answer is in the FAQ (it's not), but does anyone know what happens to options chains if/when a company gets split up by the government? Specifically in regards to Google. It's probably not going to happen, but I'm curious what the risks or opportunities are involved if it does.", "score": 1, "replies": [{"body": "It's a good question, though it is in fact a FAQ. The link to the FAQ is even in the bullet list at the top of this page, though granted you have to drill down a few levels to get to the relevant section, which is:\n\nhttps://www.reddit.com/r/options/wiki/faq/pages/exchange_operations/#wiki_option_adjustments.3A_splits.2C_mergers.2C_special_dividends.2C_and_more\n\nTL;DR - if GOOG or GOOGL are forced to spin off divisions into new companies, the options on those tickers will be adjusted. Calls will usually deliver a combination of original shares, like GOOG, and some number of new shares of the new spinoff + cash. See the ARNC to HWM spinoff example in the link. Alternatively, the original company reorganizes completely, the GOOG ticker ceases to exist and only shares of the spin-offs and new org go forward.\n\nYou can look at the history of the MSFT and T (Ma Bell) anti-trust actions for comparables.", "score": 1, "replies": [{"body": "That FAQ only covers stock splits, or company mergers, I don't see anything about company splits. Spinoffs are mentioned, but no examples are actually given. A spinoff is also wildly different from a breakup where there might be 5-6 new tickers rather than just one where a division of the company is spun off on its own.\n\nIf you had a contract for 100 shares of Google, and let's say arbitrarily the stock split 1:1 into 6 different tickers (so that 100 shares becomes 600, 100 of each of the companies), would the new contract be for 600 shares (100 for each of the 6 companies) then? Or would you end up with 6 contracts for 100 shares of each company? If the shares aren't split 1:1 it could get confusing real fast.", "score": 1, "replies": [{"body": "There's no difference. A spinoff for divestment works the same way as a spinoff for other reasons. Just because there may be multiple spinoffs doesn't change the effect to options.\n\nAn example of a spinoff is given, though as I mentioned, you have to drill down into the links to find it. I even named the example, ARNC to HWM.\n\n> so that 100 shares becomes 600, 100 of each of the companies\n\nThat is not going to happen. That would mean that each new company had the same share price as the old company, which would make no sense. Instead of six, let's say five to make the math easier. Let's also say that each spinoff is exactly 20% of the previous company. That means that your one old call would be adjusted to deliver 20 shares of spinoff A, 20 shares of spinoff B, ... etc., thru 20 shares of spinoff E.\n\nThis is all academic, though. It's unlikely that there is going to be an AT&T like diversification. It might go more like Microsoft, where no spinoff happens at all but products have to be unbundled. Maybe AdSense is spun off from everything else, but that's the most I would expect. But who knows? We won't know until the judgment is made.", "score": 1, "replies": [{"body": "The link from the FAQ I was looking at was this:\nhttps://investorplace.com/2011/04/options-faq-splits-mergers-spinoffs-bankruptcies/\n\nI just realized now that there is another link below that giving the example you were discussing. Thanks for the info. It seems like the answer is that the option gets converted to an option that delivers the shares of all companies that are generated by the split, in whatever quantities are necessary.", "score": 1, "replies": [{"body": "That's right. When the judgment comes out, do the following google searches:\n\ntheocc GOOGL option adjustment\n\ntheocc GOOG option adjustment\n\nIf there is going to be any adjustment to options, they will show up as memos from the OCC before the effective date of the adjustment.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "If i am writing PUT. 30-45 days.  .20 delta, and in first few days , price of stocks begins to plummet to stike price or breakeven point, is it better to Roll and try to get bigger credit now, otherwise if it keeps going down. It will be much harder to ever get credit", "score": 1, "replies": [{"body": "First, forget about the breakeven price, it's irrelevant for sellers.\n\n\"Better\" will depend on what criteria you use to decide if something is better or not. For the criteria I use, it's almost always better to just cut your losses and dump out of the trade (buy to close for a loss). I don't believe in using rolling to rescue a losing trade. I'd rather recover as much capital as I can and redeploy that capital on a different trade with better prospects, like a different ticker. Why get married to a loser?", "score": 1, "replies": [{"body": "Thank you . What criteria would you use to exit if decline is in first few days? Some % of loss above premium received?  I want to be conservative and cut losses", "score": 1, "replies": [{"body": "My conventional exit strat for short leveraged puts is 100% of premium lost. So if I got $3 in credit to open, I'd bail out when the cost to buy to close is approaching $6. For profit, I typically exit when I get to keep 50% or more of the opening credit, so for a $3 open, exit for a gain when the buy back cost crosses $1.50.\n\nFWIW, this on 45 DTE 30 delta OTM opens. If you trade weeklies or very different deltas (20 is not much different from 30, but 15 or 40 would be), you might have different exits.", "score": 1, "replies": []}]}]}]}, {"body": "I forgot to close 2 losing options positions and the expiry is tomorrow - they're way OTM.\n\nI'm doing this in my Schwab cash account and I have no margin account at all.\n\nNow I've placed market orders to sell them at any price but they're not getting filled since open.\n\nCome tomorrow will Schwab make me exercise them if their sell orders are still not filled? And since I don't have enough cash, will they liquidate some of my positions to exercise the options?\n\nOr will they do a cash settlement, which will basically be worthless?", "score": 1, "replies": [{"body": "No, they won't be exercised if they're OTM.\n\nFar-OTM, near-expiration options often have no bid, which means you may not be able to sell.  If even a market order is not filing, this is probably the case.", "score": 1, "replies": [{"body": "Oh didn't know that! Thanks!", "score": 1, "replies": [{"body": "Calls and puts, long and short. An introduction.\n\n\nhttps://www.reddit.com/r/options/wiki/faq/pages/basics", "score": 1, "replies": [{"body": "Thanks for the link!", "score": 1, "replies": [{"body": "It is among the many useful educational links at the top of this weekly thread.", "score": 1, "replies": [{"body": "Got it, will look at them. Thanks!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Way OTM? This means they are already worthless and may not close even with a market order as no one wants to trade a worthless option.\n\nOptions are only exercised if they expire .01 or more ITM as this means they have value. \n\nYou're trying to create a problem you do not have . . .\n\nIf your options expire OTM then they go away and cease to exist. There will be no exercise or any kind of settlement.", "score": 1, "replies": [{"body": "Good to know, thanks!", "score": 1, "replies": [{"body": "Keep an eye on them to ensure they do not jump in value pr possibly go ITM, but otherwise nothing needs to be done.", "score": 1, "replies": [{"body": "Got it, thanks!", "score": 1, "replies": []}]}]}]}]}, {"body": "I’m sure this has been asked a ton but I couldn’t find anything. What is a decent amount of money needed to start selling-to-open options strategies? I’m familiar with options (no expert by any means) but have only sold covered calls or cash secured puts. Never messed with spreads, condors, diagonals, or anything like that. New to the thread and just curious on what you guys think", "score": 1, "replies": [{"body": "There’s no perfect amount and it likely depends on what you are trading.  Personally I wouldn’t want to start with less than $5K USD.  The reason is that very small accounts can limit your underlyings and I’ve seem too many folks on here trading crap because of account size.  Good risk management says that any one trade should not take up a significant amount of your account, especially early on.  So even a trade that puts up a few hundred dollars would start to chew up a lot of smaller accounts.  More is certainly better but that’s my opinion on a starting minimum.", "score": 2, "replies": [{"body": "Awesome thank you and u/ScottishTrader", "score": 2, "replies": []}]}, {"body": "Agree that $5K is the lowest amount, but a decent amount would be more like $20K or higher as this would allow more diversification and better risk management.\n\nA new trader may often make 10% to 15%, if they are even profitable the first year, so this would be $500 to $750 annually on a $5K account. Not going to change your life, but it may make a difference. $2000 to $3000 per year on a $20K account can help more.\n\nHigher returns may be possible but will take higher risks which can mean more and possibly larger losses.", "score": 2, "replies": []}]}, {"body": "Started with option trading this month. Purchased about 1K SBUX puts ending in Sep/Oct this morning. Am I doing this right?\n\n— SBUX $92 Put (1 buy/$375 total), 9/27 exp, -$105 return as of 2:31pm today\n\n\n— SBUX $90 Put (2 buys/$640 total), 10/18 exp, -$148 return as of 2:31pm today", "score": 1, "replies": [{"body": "Buying puts close to the current price is basically a typical gambling-type bet. You win (could be 0.00001% or 500%win, depends how correct your prediction of a dropping price is obviously) or you lose everything. If that is your intended risk/reward plan and you think SBUX will be sub-90 very soon, then you're doing something arguably \"right\"...  Notice the bid vs ask on the $92 9/27 option, I see $0.59 spread right now here: https://www.nasdaq.com/market-activity/stocks/sbux/option-chain\n\nThat is like 20%, so you might want consider picking options with higher volume and lower spreads next time. I guess it is a weekly expiry date that just got started, so maybe the spread will be much smaller as it's closer to expiry...", "score": 2, "replies": [{"body": "Thanks for the thorough response. Seems like I’m taking too much risk currently. My newby strategy was just to buy close to, but under the spike thinking it would likely go down in the near future.", "score": 1, "replies": []}]}, {"body": "Have you considered selling options to place the probabilities in your favor? If your directional analysis is that the stock would drop then selling a call credit spread would profit if the stock did drop, but also if it stayed about the same and even if it went up by some amount.\n\nBuying options requires the stock to move in the right direction by enough to offset the premium paid plus the theta decay and is much more difficult to win as long options can have a loss even if the stock moves as expected . . .", "score": 2, "replies": []}]}, {"body": "Can anyone explain what happend\n\nI bought Varta options a few months ago, but when I bought them the price was at a high of €12. When the news came that it was going through pre-insolvency proceedings, the price collapsed.  My options had been worthless for weeks.  Many people are currently gambling with this stock despite the current situation, which is why the volilality is very high. Today i suddenly had a gain of €1250 due to a falling price? Is this somehow a display error?  I have a 4x 9€ calls? Can someone please explain this? \nMy broker is Ikbr", "score": 1, "replies": [{"body": "[position](https://ibb.co/s969fzL)\n[position 2](https://ibb.co/5jz9Z8r)", "score": 2, "replies": []}, {"body": "I guess these are calls at a strike price of 9 Euros.\n\n\nStating  whether calls or puts, the expiration, the strike, and your cost to obtain the position.     Doing so in text aids your readers, and informs us that you understand these items.  \n\n\n     VARTA's web site indicates the company is undergoing capital and debt  restructuring that may extinguish all share value.      \n\n\n https://www.varta-ag.com/en/about-varta/news-press/details/varta-ag-announces-financial-reorganization-with-starug-proceedings      \n\n\n   The value of exiting your position immediately is the BID of willing buyers.    \n\n\nExamine the bid in the Options for likely value upon exit.     \n\n\n Platforms typically \"value\"  securities at the mid-bid ask , and the market is not located there, nor are willing buyers.     \n\n\n Your image below states that the option is VAR1 / VAR10.\n\n\n  I am unfamiliar with how European exchanges handle amending an option contracts and how similar that process is to USA Options modifications.   In the USA, a number following the option or share ticket  indicates  the deliverable for the option may have been amended, in your   case,  subsequent to the filing for restructuring. ", "score": 1, "replies": []}]}, {"body": "Interested in selling options but have a few questions about selling options. How often do you get assigned when selling an option if its naked sell? The idea of being forced to buy 100 shares of a stock freaks me out. Is there a surefire way to avoid being assigned? Also, what happens if I sell an option and the person I sold it to then closes their position? I still have much more to learn and dont plan on selling options for a while, but was curious about how this works", "score": 1, "replies": [{"body": "There is no such  method for short sellers.  They are not in control of assignment.\n\n\nThat said, if assigned, the following business day, you sell the shares received at the open of markets. \n\n\nIn general early assignment is uncommon,except surrounding  the ex dividend dates, and when holding low extrinsic value options.  The reason longs rarely exercise early, is, exercising a long option destroys extrinsic value that can be harvested by selling the option.", "score": 2, "replies": [{"body": "If I were to get assigned, am i typically getting assigned at a loss or at a profit.", "score": 1, "replies": [{"body": "If you sold a put on XXYYZZ shares at a strike price of 10, when the shares are at 15, for, say, 0.50... \n\n\n It most likely you would be assigned when the shares were below 10.\n\n\n Even so, not likely until expiration. \n\n\n If assigned shares, you woulday 10 times 100 for $1,000. Perhaps the shares were at $9.25 If you sold the shares the next morning at $9.25 you would receive proceeds of $925,  for a net loss on shares of $75. \n\n\n This loss is offset by the $0.50 premium on the option, with a gross of $50. \n\n\n Net loss before fees is 75 less 50 premium for a loss of 25.\n\n\n You can exit a short option before expiration by buying it, to close the position.", "score": 2, "replies": [{"body": "Okay that makes sense. Do option sellers typically buy back their position before expiration or is that bad strategy? Would you only do this to prevent further losses if the stock tanks? Seems that if the option is going to expire otm you would let it so that it expires worthless and you make the premium.", "score": 1, "replies": [{"body": "Probably 90 to 95% of all options are closed before expiration.  \n\nTypically short sellers close early to start a new trade, after earning 50 to 75% of the premium received.", "score": 1, "replies": [{"body": "Got it. Makes sense why getting assigned is so rare then. Thanks for the help!", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">The idea of being forced to buy 100 shares of a stock freaks me out.\n\nThis \\^ is the problem . . .  You should pick stocks you don't mind holding and the account can easily afford, then you won't be freaked out if you do get assigned, which should be rare. \n\nIf you can't pick stocks, you don't mind holding, or the account cannot support buying, then frankly you should not be selling options.\n\nNote that there is no 'surefire' way to avoid being assigned and by freaking out about it you are more likely to make emotional and bad decisions that are likely to cause losses . . .", "score": 2, "replies": []}]}, {"body": "I know this wouldn't work but I'm trying to figure why ?  \n\nSuppose underlying is 10k  \n\nCall @ 200 at Strike 11k\nPut @ 150 at Strike 9k  \n\nNow, depending on the movement sell CE/PE for profit and hold the loser in hope of it going up, and when it does sell it and hold the loser until you make money on total.", "score": 1, "replies": [{"body": "It doesn't work because you are betting against yourself and relying on market timing to bail you out. \n\nBetting against yourself with a strangle (that's the name of the structure in your example) is not a bad idea, *if you are trying to limit your exposure to directional risk*. But that's not what you are trying to do. You are trying to have your cake and eat it too, by trying to take only the benefit of directional risk, but none of the potential losses.\n\nAll it takes is one mistake in your guesswork at timing the market and you end up losing more than if you had just bought a single call in the first place.", "score": 1, "replies": [{"body": "Just to be clear after pocketing the profit I’ll be selling same option or near/ATM option (almost same time) and then wait for either one of the two options to be in the green.   \n\nI’m afraid if the underlying runs big in one direction the opposition option would be worth lot less making it difficult to recoup what’s lost.", "score": 1, "replies": [{"body": ">Now, depending on the movement sell CE/PE for profit and hold the loser in hope of it going up, and when it does sell it and hold the loser until you make money on total.\n\n>Just to be clear after pocketing the profit I’ll be selling same option or near/ATM option (almost same time) and then wait for either one of the two options to be in the green. \n\nThe terminology and language you are using unclear so I'm not sure what you're really trying to do.\n\nI don't know what CE and PE stand for, but I assume you're talking about the put and the call.\n\nIf one of them increases in value, and you sell it for a profit, you are then holding the other leg, which you are terming the loser. How can you \"sell it and hold the loser?\"  If you sell it you are no longer holding it.\n\nSimilarly, if by \"pocketing the profit\" you mean selling the leg that has increased in value, the only thing you have remaining to sell is the other leg. What do you mean \"selling same option or near/ATM option?\" Do you mean you mean after closing one of the two legs, which are longs, you are then going to open a short option?\n\n>I’m afraid if the underlying runs big in one direction the opposition option would be worth lot less making it difficult to recoup what’s lost.\n\nYes, this is the main difficulty with a long strangle.  In order to make a profit, the underlying must make a large enough move to offset any time decay or reduction in IV, *and* to offset the loss in the other leg.  This will generally only happen if IV increases.", "score": 1, "replies": []}]}]}]}, {"body": "I’m generally quite bullish but also not a stock picker so I’m 90% in ETFs. I’ve been researching LEAPS and the leverage seems interesting, but obviously there’s a risk of being OTM or expensive to roll the option. On the other hand I have sufficient collateral to just take out a Lombard loan with my bank against my stock portfolio at up to 75% LTV and I can keep renewing that Lombard for as long as I want against 5% interest. \n\nCan someone please share their thoughts on simply taking the loan vs LEAPS? I think I won’t take the Lombard leverage if I take LEAPs to not overlever myself. Any thinking very much appreciated. Thank you", "score": 1, "replies": [{"body": "If you are long term bullish, just buy the shares.  The only time I have ever bought LEAPS is to sell short term calla against them.  The reason there is that I wouldn’t care to own the stock but want to sell calls against it for a bit.  But for a long term bullish position, shares are the way to go:  there‘s no time limit, your delta is 1, and you can get dividends.  Why make it complicated? And add potential debt on top of it?  That sounds not only complicated but quite risky.\n\nJust my opinion.", "score": 1, "replies": [{"body": "Thanks. I’m basically looking for a bit more risk through the leverage. I have a very high income but not a massive asset base so it’s all a bit slow. I should be able to quite easily sustain downturns and cough up the cash to deleverage if need be. So really the question is how to best lever up rather than if to lever up for me if that makes sense?", "score": 1, "replies": [{"body": "You could potentially do all that but using leverage (debt) to get more leverage (options) is way too risky for my blood.  Leverage giveth and leverage taketh away just as quickly.  Buying shares also adds risk.  And with a very high income you can buy a bunch and grow in a much safer way.\n\nThis is just my view of things.  To me, stocks and options each have a place.  I like stock for the longer term view and options for the shorter term.  In the options world the liquidity is so much better nearer to the money and less than 90 days out.  LEAPS are neither of those.  So you get some leverage with LEAPS but, to me, not enough to justify the premiums.\n\n  \nTo put it another way.  If there was good money to be made in LEAPS the big funds would be all over them and, thus, the liquidity would be good.  Of course we know that isn’t the case.  So what do we know that the pros do not?  The risk/reward isn’t that good.  And the deeper you go the closer the price gets to just buying shares for a lower delta, (eventually) time decay and no dividends.   Not what I want in a long term strategy.", "score": 1, "replies": [{"body": "Thanks, appreciated. To be clear I’d buy stocks with the leverage (bank loan), not options - or am I misunderstanding what you’re saying?", "score": 1, "replies": [{"body": "I wouldn’t borrow money to invest. You say you have a very high income. That’s what I would use to invest. Live reasonably and invest your excess income. It’s not exciting but it’s how real wealth is built…over time. \n\nBy borrowing to invest you are putting your investments in the hole to start due to the cost of money which is substantial at the moment.  And if your investments don’t pan out you’re in worse shape. Leverage is great when you win…but it really sucks when you lose.  That being said if you forced me choose using borrowed money for stocks or options, I would choose shares.  But my real choice is to not use leverage for this kind of stuff. \n\nIt’s your life and your money.  This is just my opinion. Trying to make money fast means taking on a lot more risk. The trick is to find the balance between risk and reward.  The big question to ask is “what are the consequences if I’m 100% wrong?”  I’m a big believer in building wealth over decades. That’s how most people do it. That comes down to budgeting and discipline.  As one who has an income significantly above the median, this is what I do. It’s boring and that’s ok. I’ve lived through multiple market and economic crashes (since the early 90s) and have managed to grow wealth over time. ", "score": 1, "replies": []}]}]}]}]}, {"body": "First, do you really, really need leverage? Leverage is most effective when the risk is a small fraction of your lifetime wealth, so like when you are 20 years old and opening an IRA for the first time. Don't forget, leverage cuts both ways. A 2x levered traded on the S&P 500 could gain twice as fast as shares on SPY, but also lose money twice as fast.\n\nIf the leverage is jusitifed and the risk of levered loss is not a significant portion of your total portfolio (like no more than 5%, certainly not the full 50% of a margin loan), borrowing for leverage is always the worst option, IMO. True, interest rates ought to be falling, but you are still at the mercy of interest rate risk and margin calls. Whereas once you buy a call, your worst-case risk is defined, so there will be no surprises like margin calls.\n\nSo given those two choices, I would always go with the call. A deep ITM call at that, to minimize theta decay.", "score": 1, "replies": [{"body": "Need it is a big word, but I’d really like it. I have a relatively small asset base (c.$650k) I’m relatively young (not 20yo but somewhere around 30 yo) and decent and stable income (c.$500k pa of which half is bonus). I feel that I can take more risk than simply through my pay check every month. I’m in PE and quite familiar with leverage and its risks as a result. I’d only lever to about 30% of portfolio value maximum. \n\nIt’s a helpful comment, the only questions I have is how you think about having to roll the call and for how long you can do that practically without sustaining a serious loss. The reason being that I have a supportive bank (private) and hence very unlikely to ever margin call me (they told me they’d never do it basically), so that is much less risk than a regular broker it feels like.", "score": 1, "replies": [{"body": "> I’d only lever to about 30% of portfolio value maximum.\n\nSo roughly $200k. Try to imagine losing that $200k. Can you recover from such a loss, both psychologically and materially? If you are pretty sure you can, you're good to go.\n\nPersonally, I still wouldn't use borrowing for leverage.\n\n> It’s a helpful comment, the only questions I have is how you think about having to roll the call and for how long you can do that practically without sustaining a serious loss.\n\nI flip the script on that notion. I don't think about rolling like it's something I'm forced to do with expiration looming. Instead, I think about the lock-up term on a portion of my capital finally coming to an end so I can look around at the market and find the best possible investment of that capital. Kind of like a 2-year CD maturing.\n\nIf you don't like the risk in the equity market towards the end of your hold on the call, you can stick the money in a T-bill or MMF. Or maybe shares will be cheap and you expect a recovery, so you can buy shares. My thinking is that just because you had a call on SPY, or whatever, before doesn't mean you have to keep holding a call on SPY. I don't like getting married to any trade that has a time limit on it.\n\nCould you end up on the wrong side of a trend and lose money? Absolutely. Is that something I worry about? Not at all, since it's not something I can control anyway. Frankly, I'm more likely to worry about the other end of the trend, where I might be forced to realize a gain and pay taxes sooner than I would if I held shares instead. That's the main reason I never been able to find a justification for leverage that is worth more than the tax drag of being forced to realize gains. Tax loss harvesting, on the other hand, is a wash between shares and calls.", "score": 1, "replies": []}]}]}]}, {"body": "If I early exercise a call on a hard to borrow stock, can I then short that stock without needing a stock locate?", "score": 1, "replies": [{"body": "Maybe I’m missing something but if you exercise a call, you are buying the stock.  What would be the point of subsequently shorting it?  You short stocks you don’t own because if you own the stock, you‘d just sell it if you thought it was going down without any need to buy the shares back later. \n\nAlso, it’s rarely a good idea to early exercise a call.  Most of the time it’s not advantageous to you because of you are forgoing the extrinsic value you paid on the call.  This adds to the cost of your purchase and usually puts you in a worse position. There are exceptions but I had to state this.", "score": 2, "replies": [{"body": "That's a good point. I guess it would be selling the shares then. Do they get credited immediately to your account if you early exercise?", "score": 1, "replies": [{"body": "It can take a day or so to settle.  Your broker will know for sure, and they will likely (and rightfully) try to talk you out of early exercise.\n\nIf your goal is to sell immediately, why not just sell to close your calls?  They are likely up money if it is worth selling the stock at they price.  Much simpler, you get the money rather then dealing with the multi step dance of exercising, and then selling.  You aren’t onligsted to buy the shares.  \n\nKeep it simple.", "score": 2, "replies": [{"body": "I'm not planning on doing it, I was wondering how early exercising works with stock locates.", "score": 1, "replies": [{"body": "It works like a regular exercise except you have to call your broker and have them do it.  I would expect to see the shares no sooner than the next market day.  But your broker would know that for sure.  I would expect some settlement time.", "score": 1, "replies": []}]}]}]}]}, {"body": "You'd think, but no. For all you know, the shares that are delivered to you could get loaned out before you have a chance to do anything with them. In any case, you're not allowed to short shares that you own long, that's called shorting against the box.\n\nNot that you need to short shares anyway, since you could just buy puts instead.", "score": 2, "replies": []}]}, {"body": "I have a call option 68 strike sep 6 on tqqq bought at 1.20 and currently at 3.15. Just wanted to know what max profit would be? And if I should wait to sell when it goes in the money", "score": 1, "replies": [{"body": "There is no max profit on calls because, theoretically, there is no upper limit to how high a stock can go.  They being said you are up 2.6x what you paid.  That’s not a bad return.  When to get out is up to you.  Whether you are in or out of the money doesn’t really matter in my book. It’s possible to be ITM and down on the trade..as many earnings players can tell you.  ITM/OTM only really matters when it comes to expiration. If you have a good gain with which you are happy, close it and take the damn money.  Don’t worry how far from the money you are in this context.", "score": 2, "replies": [{"body": "I’m wondering if it’s worth holding. If the market continues to go up usually call options deep itm can 10x in value. So idk", "score": 1, "replies": [{"body": "That’s right,  no one knows.  My point is thar for your purpose whether you are in, at, or out of the money doesn’t matter.  Only the contract price matters. You can wait and see if it keeps going up.  Just remember theta is eating away at your extrinsic value.  So you need the up move to happen as soon as possible.  As you get closer to expiration theta decay grows.    \n\n\nI’m not saying sell, I’m not saying wait.  That is entirely up to you.  I’m just trying to help you understand the risks and what matters and what doesn’t. Focusing on being ITM when you have no intention of exercising the calls is pointless.  If your goal is to make money on the calls themselves only the call premium matters and there is more to the price than just being in the money.", "score": 2, "replies": [{"body": "Okay thanks, so I really just need an exit point, that’s profitable. I’ve been finding that purchasing calls 3 weeks out with a strike only 3-5 dollars away in a bull market is profitable. I guess I just need to work on an exit strategy. So like you said selling against theta", "score": 1, "replies": [{"body": "Yes.  Having a trade plan is really important. Every trade I put on has a plan with a profit target and a max loss.  If I reach the profit target, I take it.  I have a GTC closing order in at my profit target so it just happens if my price hits.  Could I have gotten more?  On some cases yes, in others, no.\n\nWhere to ser your target?  You’ll learn that as you trade a given trade.  There is no perfect amount that you can know ahead of time. This is why it’s also important to review your trades after they close and see if your plan still makes sense.  \n\nThis is a business.  All businesses need a plan.  That plan is regularly reviewed and tweaked as needed.", "score": 2, "replies": [{"body": "I like the approach and the seriousness to your strategy. Thank you for the advice I’m gonna try and set close prices for my trades as they go currently my call is at 4.00 so I’m thinking I’m already at a sell point. So I’ll just play the waiting game and if it starts to dip run at 4.00 if I can", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Can you explain what roll it up means?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Okay that’s very interesting. Thank you for explaining all that. Interestingly I never thought of it like that before. Collect the premium and adjust price or doe. I really like that thank you. I think I’m holding the wrong mentality, instead of thinking it’s one play let it be an evolving one, as long as it’s consistent with your thesis. Thank you", "score": 2, "replies": []}]}]}]}, {"body": "Take your gains and sell", "score": 0, "replies": []}, {"body": "So you're saying you have a 163% profit, and you're wondering if you should go for maximum greed, risk all of those gains, for a few pennies more? Just how much profit did you plan to make on this trade? For comparison, my routine take-profit on calls is 10%. \n\nPlease read this and put a leash on your greed: \n\n[Risk to reward ratios change: a reason for early exit (redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/risk_reward_and_exits)", "score": 0, "replies": []}]}, {"body": "Hello! So I bought some calls on Walmart this week on\nMonday at the $74 strike price when the stock price\nWas at $68. - paid $29 per contract and when - ran the\nsimulation on the options calculator, at the $73 strike\nprice the contract price was $35, and still shows that\nThis morning at open walmart was at $74, but dropped\nback into the $73 range. The actual price if I sold is\nnow around $18 per contract. I thought I took theta into\naccount and the volume is still very high for that strike\nprice, so my question is why is the actual value lower\nthan what the calculator predicted? I am still new to\noptions trading and trying to learn, so any advice and\nor explanations are greatly appreciated! Thank you very\nmuch!", "score": 1, "replies": [{"body": "Let me guess..WMT had earnings.  Before earnings the IV of your contracts were inflated because of the earnings risk.  When there is a higher probability of a move, the premium goes up.  Then the news came out, the stock reacted and the IV came out and likely returned to normal.  That IV crush muted your gains on the stock move.  Welcome to the options market.  You traded around a known event when prices were inflated due to higher risks.  Now has WMT flew past the expected move you would have done better.  My guess is that it didn’t.\n\nA calculator may have a difficult time predicting the vol crush.  No one really knows what it will be until it happens. Most calculators I’ve seen just have you enter in an IV change and then it recomputes the prices accordingly. But that’s the catch.  You don’t really know.  No one really does.  So all you can do is model what different IV changes might look like. \n\nI liken this market to trading in 3 dimensions while stock trading is 1 dimensional.  You got your first lesson in IV crush.  Hopefully it didn‘t cost you too much.  But the lesson is they buying calls (or puts) into earnings has a different risk profile than a normal day.  I’m not saying it can‘t work, but you need a greater than expected move in your direction to make money.  That means the odds are against you.", "score": 3, "replies": [{"body": "Thank you very much for the insight. I did not realize how fast the IV would fall. You are correct, WMT had earnings this morning and I was ready at market open to sell, but like a fool I didn't set a take profit point and within one minute the price dropped back down just enough and I saw my gains disappear.  I was so excited when I saw the share price nearly a dollar above my strike in pre market. \n\nAlas, another lesson learned, set a profit/loss amount because like you said, unless the price would have gone well above my strike, the unpredictability of the falling IV was going to get me being so close. It was about a $150 lesson so it could have been worse, thanks again for commenting", "score": 1, "replies": [{"body": "Yeah, pre market prices are not reliable. Never get too high or too low on them. ", "score": 2, "replies": []}, {"body": "Extrinsic Value,  an introduction.\n\n\nhttps://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value", "score": 2, "replies": []}]}]}]}, {"body": "Thoughts on November META calls?", "score": 1, "replies": [{"body": "We're more interested in YOUR thoughts on that play. Why META? Why calls? Why November? Which calls? What is the upside potential and downside risk? Then we can comment on your thoughts. Discussions work better that way on this sub.", "score": 2, "replies": []}, {"body": "Seems to be a safe play that should lock gains. Fundamentally sound company, tons of revenue. That's all fine but the only reason I am making this play is simple....\"You can't cuck the Zuck.\"", "score": 1, "replies": []}]}, {"body": "hi, random question if have time for it. Has anyone tried to small scalps qqq's like 30c move small? the bidding is 3x smaller than spy 0dte so  is there enough liquidity for more than 100 contract size scalps?", "score": 1, "replies": [{"body": "Check the volume of the intended options. \n\n\nIf above 20,000 or 30,000 a day, possibly suitably liquid.", "score": 2, "replies": [{"body": "Many Thanks", "score": 1, "replies": []}]}]}, {"body": "May I ask why did SMCI option up 10x? I saw other stock that was up 10%, the option didn't go up 10x", "score": 1, "replies": [{"body": "Need a strike price, expiration, premium on a date, premium on a second date, and shares prices on the same particular dates to start an options conversation.", "score": 1, "replies": []}]}, {"body": "If your options contract is in the green but you are below breakeven, are you still profiting?", "score": 1, "replies": [{"body": "For a bought \"long\" option it will make a profit if it can be sold to close (STC) for more than it was bought to open (BTO) for. Breakeven is not relevant except at expiration.\n\nBTO for $1.00 and STC for $1.25 = .25 gain, x 100 = $25 profit.", "score": 2, "replies": []}, {"body": "Your breakeven before expiration is the cost of the option.\n\n\nSell for more than your cost for a gain.", "score": 2, "replies": []}]}, {"body": "My questions are is it possible to early exercise and whether this would be in my best interest.  I hold a Dec 20, 2024 100 call that I paid $1,745 for.  This contract has generated profit of $1,322.50.  If I exercised now I would pay $10,000 for the 100 shares that would be worth $123,000.  Is my analysis correct?  Any guidance is very appreciated.", "score": 1, "replies": [{"body": "You can see that the top advisory of the main post above is not to exercise long options, as doing so forfeits remaining extrinsic value.\n\nIt seems based on your removed post that you intended to include a screenshot, which presumably would have told us the ticker, but you neglected to mention the ticker in text.  Is it NVDA?  If so, that call has more than 7 extrinsic value left.  It would be far better to sell it, and if you want to buy shares, buy them on the open market.\n\nIf the stock is at 123, 100 shares are worth $12,300, not $123,000.", "score": 2, "replies": [{"body": "Yes, NVDA and thank you for catching my extra zero.  It seems to me the intrinsic value being greater than the extrinsic makes early exercise more profitable, no?  I will read the advisory and if I still have questions return for assist.  Thank you, sir.  I'm learning.", "score": 1, "replies": [{"body": "No, because if you exercise, the only value you get is intrinsic value, while if you sell, you get intrinsic value plus extrinsic value.\n\nScenario 1: sell the option.  Even if we're very conservative and assume you can sell only at the bid, you get $3035.\n\nScenario 2: exercise.  You pay $10,000 cash, and receive shares worth $12,286.  You've essentially received $2286.\n\nWouldn't you rather receive $3035 than $2286?", "score": 4, "replies": [{"body": "Ahh, yes, I see!  I follow you now.\n\nGood luck to you, sir, and thank you again for helping me wrap my head around this.", "score": 1, "replies": []}]}]}]}, {"body": "Okay, I read the advisory and thank you for writing it.  My current profit on the contract is $1,322.  If I exercise now profit would be $2,300 **less the premium paid** of $1,745 or $555 profit.  Is that much of my analysis correct?  Further, what would be the basis if I early exercise?", "score": 1, "replies": []}]}, {"body": "I wrote a $7 cash-secured put for $0.35. When looking at my Position, it tells me the Market Value is $32. What is \"Market Value\"?", "score": 1, "replies": [{"body": "The current premium that put is trading at.", "score": 2, "replies": [{"body": "Aha. I learned the term “book value”, rather than market value. Thank you!", "score": 1, "replies": [{"body": "Not the same concepts. Book value is the liquidation value of a company or asset. If you were to put the company up for sale and sell off its parts, and then after paying any outstanding debts, what would you get for those parts? That's book value.\n\nShares of a company give you a share of that company's future value. Shares have a market value, as they are traded in a free market. Shares do not have a book value, but the company does have a book value and that book value can define a floor for the market value of shares.\n\nDerivatives like options have no book value. They only have market value.", "score": 2, "replies": [{"body": "Thank you for the details. The person originally explaining it to me used book value as a synonym for market value. Must be a macro/micro thing for him. Then again, he's Canadian. LOL", "score": 1, "replies": []}]}]}, {"body": "So that changes based on bids and asks, not directly with the stock price.", "score": 1, "replies": [{"body": "Yes, you should read up on how option pricing works if you haven't already. An option is a separately traded financial security that has its own price, the premium, that fluctuates based on market factors, just like a stock does. The price of the stock influences the price of the option, but it is not the only factor.", "score": 2, "replies": [{"body": "Excellent. The way my mind works these days, It takes three or four different explanations for things to sink in and stick. I'm so timid at this beginning stage, I need lots of hand-holding and reassurance. :D", "score": 1, "replies": []}]}]}]}]}, {"body": "So I know I shouldn’t have done it but I opened a debit spread for end of September on GE a few weeks ago. I’m in college and thought I fully understood. I bought $200 call buy $210 call sell. So far I’m up about 5k on RH but it won’t let me sell for the life of me. My break even is $200.10. \n\nI tried selling just what I’m in it for since I’m up and it says I can’t close as debit obviously. So if I try credit and limit price is -.25 to .40. Everything I low likely of being filled. Not sure what to do. Please help.", "score": 1, "replies": [{"body": "The correct terminology is \"long leg\" and \"short leg,\" not \"call buy\" and \"call sell.\"  But you can just tell us it's a 200/210 call debit spread. Saying it's a debit spread lets us know which one is long vs. short.  You should also give the exact expiration date.  You should also tell us the net debit for which you opened the spread, though we can deduce that if RH tells us your \"breakeven\" is 200.10, it was 0.10.  You should also say when exactly you opened it, so that we can know what GE's price was at the time.\n\nThe most a vertical spread can be worth is the distance between the strikes, which is 10 (or $1000) in this case, so it's impossible for your position to be up $5k, so I'm thinking you must still be misunderstanding some pretty fundamental concepts.\n\nIf you opened a 10-wide debit spread for 0.10, it must have been way, way OTM, and your chances of profiting would have been miniscule. So this was a bad trade to begin with.\n\nClosing this position would give you a credit.", "score": 1, "replies": [{"body": "Sorry I opened multiple contracts under that price that’s why I’m up that amount", "score": 1, "replies": []}]}, {"body": "Let's back up and do some simple analysis . . .\n\nGE is currently around $170 and you trade is that you expect it to rise by $30 or more over the next 35ish days. Is that still your prediction and expectation?\n\nLet's use Delta to give some probabilities. The 200 strike has a Delta of about .03 which translates into approximately a 3% probability the option will be ITM and profitable on 20SEP24. \n\nThis means the probabilities are about 97% this position will lose. Unless you know something or have a better prediction that the statistical analysis indicated.   \n\nThe 200 strike has open interest of around 977 contracts so should trade, but the 210 has only 118 so may not trade as easily. TOS is showing a mid-price of about a -.10 credit which should give a good chance to close.\n\nNot sure how RH is showing you being up $5K but this seems impossible . . . They do have an odd way of showing prices, especially for illiquid options which this one is. You may wish to contact their support to find out why it is showing such a large gain and learn how to read the prices. You do have plenty of time and as you see the probabilities of the trade being profitable are very small.", "score": 1, "replies": [{"body": "Is there anyway to get it to close the positions? I lowered the price down as low as possible", "score": 1, "replies": [{"body": "You need to tell us your exact position.  You've told us the ticker and strikes, but we still need to know the exact expiration date, number of contracts, and premium paid to open (expressed on a per-contract, per-share basis.  So for example, if you opened 5 spreads at 0.10 per spread, say 0.10, not $50.)", "score": 1, "replies": []}, {"body": "Since the trade has lost nearly all of its value there is little benefit to closing now. A better time to close would have been when there was a partial loss, so something to keep in mind.\n\nHaving a trading plan that sets profit and loss closing targets is something you will want to develop and follow. Not all trades will win, so be sure to close those that are losing to save some of the value and before they get this far gone.\n\nAlso, if you want to be a serious trader then get a full featured broker as RH has many flaws even if it seems simple to use.", "score": 1, "replies": []}]}, {"body": "Even to try and recoup some money", "score": 1, "replies": [{"body": "If you cannot close for even a few cents then there is no money to recoup, sorry . . .", "score": 1, "replies": []}]}]}]}, {"body": "Was watching a 3DTE contract for QQQ and the price action was doing just okay and the candlesticks were small to medium size. QQQ went up like $0.5, but the price of a contract was barelyyyy going up. The bid/ask is tight, IV isn't overwhelmed, and there was high volume and OI for the contract. What can be causing this lackluster price increase per contract?", "score": 1, "replies": [{"body": "You didn't say what delta or strike you were looking at, so I'd guess it was low delta. If delta was 10, an 0.50 move of the underlying would only move the bid by 0.05 nominally. And that's not even accounting for the maximally high theta at 3 DTE nor the profit margin market makers will build into the bid/ask.\n\nIf it was near the money, gamma could be at work also. A strike that used to be 60 delta an hour ago might only be 40 delta now, due to gamma.", "score": 2, "replies": []}]}, {"body": "Call vs Call Debit Srpead vs Wide Call Debit Spread Question\n\nHey Peeps,\n\nPlaying around with the options calculator but I'm kinda confused. Whats the advantages / disadvantages of the following? Also which one is the most optimal to deploy $5K for NVDA earnings and get back maximized returns?\n\n* 1. NVDA $123 Call Expire 8/30\n   * costs $800\n   * Max profit - infinite but unlikely\n* 2. NVDA Call Debit Spread $123 to $130 \n   * Costs $307.5\n   * Max profit $392.5 at expiration\n   * breakeven 126.08\n* 3. WIDER DEBIT SPREAD $123 to $140\n   * Cost $575\n   * Max profit $1125.50\n   * breakeven 128.75\n\nSpecial Option 4 $123 to $124\n\n* Cost $50\n* Max profit $50\n* breakeven $123.5\n\nWhich one is optimal, It seems the WIDER debit spreads kinda suck, the $7 wide ones are ideal?\n\nBUT the interesting one is the $123 to $124 spread which gives you 100% max gains as long as nvda is above $124?", "score": 1, "replies": [{"body": "First, you'd have to explain what criteria to use for determining optimal. I may feel that low risk/low reward is optimal, but you may feel that high risk/high reward is optimal, or high frequency is optimal, or maximum leverage is optimal, etc., etc. If we don't agree on the criteria, what I suggest might be the worst alternative for you.\n\nSecond, your list has very little information. Just max profits, costs and the trade structure. Where's the volatility forecast? Where's the evolution of the underlying over time, or in lieu of that, some kind of forecast for the underlying? What's the desired holding time?\n\nMax profits are rarely, and in some cases (like your long call) never, achieved. Max profits are only useful in establishing a ceiling for the range of outcomes. What's more interesting than max profit is *most probable profit*. Or perhaps a chart that plots profit/loss vs probability.\n\nSometimes the cost isn't sufficient to establish max loss, but in the cases you listed, cost and max loss are equivalent.\n\nFWIW, breakeven price is irrelevant, unless you plan to exercise at expiration, which you should almost never do. Explainer: https://www.reddit.com/r/options/wiki/faq/pages/mondayschool/yourbe", "score": 1, "replies": []}]}, {"body": "I’m a bit confused on how sell to close works and am sure it’s a simple explanation. When someone sells to close an option contract they bought who is buying it and where does it go?\n\nFor example, If someone purchased a call option off Robinhood and sells it does it then go back into the Robinhood option chain where they initially bought it or is there a different market all together for sell to close\noptions?\n\nWhat does someone stand to gain for buying a sell to close option?", "score": 1, "replies": [{"body": ">  When someone sells to close an option contract they bought who is buying it and where does it go?\n\nThe best and shortest answer is: it doesn't matter.\n\nThe longer answer is: *Who* is usually a market maker, but it could be another trader. Which it ends up being depends on who is in the market at the time the order is offered and what price they want. It's an auction, so all bidders bidding the same price are equal. \n\nWhere it goes depends on the other end of the trade. \n\nIf the other end of the trade is a **buy to open**, the contract gets a new owner. Effectively it's as if the seller hands the pink slip with \"ACME call $123 12/31\" on it to the buyer, signs it as sold, the buyer signs as new owner, and now the buyer owns that contract. That's not what actually happens, but close enough for an example.\n\nIf the other end of the trade is a **buy to close**, the contract is effectively torn up. It no longer exists.\n\n> For example, If someone purchased a call option off Robinhood and sells it does it then go back into the Robinhood option chain where they initially bought it or is there a different market all together for sell to close options?\n\nRobinhood just acts as your agent in the trade. They aren't even the auction house, that would be one of the fourteen(?) options exchanges in the US. They post quotes for you to make trade orders with, handle the routing of your trade order, and manage your account (although it's actually the clearing agency that holds the actual securities, not the broker), but they take no part in the actual auction or the buying or selling of contracts.\n\nYou want to dive deep into how the option market works under the hood, read this detailed explainer: https://frontmonth.substack.com/p/options-market-structure-101-b18\n\n> What does someone stand to gain for buying a sell to close option?\n\nEvery time you buy to open you could be paired with a sell to close. You don't have any clue if it was or wasn't, because it doesn't matter. So unless you want to worry that you might be buying someone's hand-me-downs, it's not important. There is no functional difference between buying a used contract and buying one that is brand new and never been traded before.", "score": 0, "replies": []}]}, {"body": "Been looking into options plays and the wheel strategy is something I feel comfortable with doing.\n\nAre there any other strategies that are just based around selling? I think there was a straddle? where you have a covered call and a CSP at the same price on the same stock to help lower your cost basis.\n\nThanks in advance, been enjoying my first 2 months with options and looking to slowly build up my account more.", "score": 1, "replies": [{"body": "Are there other selling strategies? Yes, dozens. Here's a list of the most common, but this is by no means complete (the ones with \"short\" in the name are selling strategies):\n\nhttps://www.optionsplaybook.com/option-strategies\n\n>  I think there was a straddle? where you have a covered call and a CSP at the same price on the same stock to help lower your cost basis.\n\nThat's not quite right. A straddle is a put and call at the same strike and expiration. A long straddle means you bought to open both of the contracts. A short straddle means you sold to open both of the contracts.\n\nA short straddle made with a covered call is called a covered short straddle. I suppose if the put is a CSP also, that's still a covered short straddle.\n\nA short straddle made with only a CSP doesn't have a particular name and is not a likely structure, since the short call would be leveraged, so it wouldn't make sense for the short put not to be leveraged.", "score": 1, "replies": []}]}, {"body": "I was looking at SERV options and the spread was ridiculous.  Granted this has been a very volatile stock, but my question is: in a situation like that how do you see what an actually reasonable price is?\n\nLike when I see on Webull the bid being $5/contract and the ask at $100, how do you wade your way through that?", "score": 1, "replies": [{"body": "> in a situation like that how do you see what an actually reasonable price is?\n\nYou can't. That's what a wide spread is telling you. Any price inside the spread might be reasonable.\n\nYou could make an estimate by using an option pricing model and a superior forecast for volatility, but that doesn't mean you could get a fill at that price. In fact, it's almost certain you won't, since MMs have to make money and they are using the same tools to arrive at a reasonable price and they aren't going to sell for a loss or break-even unless they get compensation on the side for doing so (which they sometimes do).\n\n> $5/contract and the ask at $100,\n\nI can't tell if those are per-share values or multiplied out. Please stick with per-share values when quoting a bid/ask spread, it's very confusing to use anything else.\n\nIf the spread is quoted as $0.05/$1.00, please write that.", "score": 1, "replies": []}]}, {"body": "Is there anywhere I can play around with graphs of greeks, or see greeks for different strikes presented visually? Gamma and even speed would be great.", "score": 1, "replies": [{"body": "The greeks for different strikes should be any option chain view. It would be tabular format with a column for each greek. Here is a [screenshot of the option chain view on Power Etrade](https://imgur.com/a/atAugki).\n\nIf you want generic graphs of greeks in an explainer about how each option strategy plots each greek (so not a specific ticker, but the template for the strategy): https://www.optiontradingtips.com/strategies/\n\nIf you want interactive graphs with sliders that show how greeks change over time or some other parameter, I can't find the link, but I believe I got it from /u/AKdemy and it's on quant.stackexchange.com", "score": 2, "replies": [{"body": "American style options aren't that different from European in terms of pricing and Greeks. For example, if there is no dividend, call options are even the same. For looking at charts, coding out European options is sufficient. \n\n\nPython and Julia are both versatile enough to do this with a few lines of code. E.g. \n\n- Theta: https://quant.stackexchange.com/a/74856/54838\nOr \nhttps://quant.stackexchange.com/a/73629/54838\n\n\n- How to use interact with option graphs https://quant.stackexchange.com/a/69780/54838\n\n\n- Interactive 3D charts of delta, gamma, Vega, theta and rho.\n\n- Volga https://quant.stackexchange.com/a/66052/54838\n\n- charm https://www.reddit.com/r/options/s/Pxw1o2HqXY\n\nYou will likely not find Speed in any retail platform. If you have access to Bloomberg, just use OVME (also works in listed mode) and select to display advanced Greeks in the GUI. Otherwise, I'd also just code it out. The formulas in https://en.wikipedia.org/wiki/en:Greeks_(finance)?variant=zh-tw are all correct, although you would need to scale it to match how most professional platforms display it (e.g. theta is a value per year, so you need to divide by 365, see https://quant.stackexchange.com/a/74749/54838). \n\nOverall, I am a big advocate of doing these exercises yourself. It's not particularly hard, and you learn a lot about the details.", "score": 3, "replies": [{"body": "Thank you for the detailed insights, its a lot of help! I'll try to run it in a py notebook.", "score": 2, "replies": []}, {"body": "Thanks! I'm not seeing the link that I was thinking about, which had animated gifs of how the plot varies with one of the inputs.", "score": 1, "replies": []}]}, {"body": "Appreciate the helpful links! Yeah, it's #3, interactive graphs I'm after.", "score": 1, "replies": []}]}]}, {"body": "Hi I have one question to see if I'm able to make use of options.\n\nIf I know that a stock is going to go up in the next 15 minutes, can I use that in options strategies?\n\nIf so, how? Do I buy an option call for X date of that stock, and sell the option 15 minutes later? Am I able to do that without issues?\n\nHowever, there are so many dates and with this strategy I'm wondering how far in the future I should playing an option. The option due this Friday if it's still early week, or the option due next week Friday to give it more room? There's so many dates to choose from.", "score": 1, "replies": [{"body": "If your cash is settled you can do whatever you want.\n\nWhat you are describing is the most insane strategy I've eve heard without an algo but if you have the cash yes.\n\nYou buy, the price goes up, you sell.\n\nPlease post some loss porn when you get there.", "score": 1, "replies": [{"body": "I'm talking about the stock price going up. Cause usually if the stock price goes up then the Call option price goes up too correct?\n\nI want to buy at low and sell at higher 15 minutes later. Essentially only holding an option for 5-10 or 15 minutes max. That is possible yes?\n\nAnd it wouldn't be out of thin air there are reasons I know the price will go up, I have a stock trading strategy. So why would it be crazy? I'm just wondering if I can use that in Options because in options I noticed price going up like 40% when its up 10% on stock. Seems like I can use the same strategy in options instead to make more money there. Right?", "score": 1, "replies": [{"body": "   From the links above \n\n**Why did my options lose value when the shares moved favorably?** \n\nOptions extrinsic value, an introduction.  \n\nhttps://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value\n\n... ... ... \n\nFor your idea, trade the nearest expiration, at about delta 55 ot 60.   \n\n The reason is the nearest expiration has highest volume and lowest bid ask spread.", "score": 1, "replies": []}]}]}]}, {"body": "If I continuously do a put credit spread, would that be a good idea. Like for example, for Nvidia, if I sell a put with strike at $120, and buy a put with a $110 strike, I’ll have a max profit of $113 and max loss of -688, as long as NVIDIA is greater than $118.88. If I just continuously monitored NVIDIA during open hours, and if the share price ever came close to $118.88, then couldn’t I just close it before I start losing money? And for ETF’s like SPY, that has expiration dates every day, couldn’t I do a bunch of put credit spreads everyday, and monitor it closely, and if it ever gets too low for my liking, I just close and start over the next day? There’s probably something fundamental I’m missing; but my main question is that can I just keep monitoring the prices and close before things start going negative to ensure I’m always profitable?", "score": 1, "replies": [{"body": "Just remember that stocks can move faster than you may react, and can move a lot overnight, so this is not as simple as it may sound. \n\nA trader with a good trading plan should have win and loss triggers to close when those are met.", "score": 1, "replies": []}]}, {"body": "So I want to buy VF Corp Jan 2026 calls. I need help deciding between choosing $30 (.95 premium) or $20 ($3 premium) strike price. Let’s say im confident the stock price will be at least $30 one month before expiry, which one would be better if I wanted to just sell the calls for profit and not exercise? (Because I doubt I’d have enough funds to do so)", "score": 1, "replies": [{"body": "The top advisory of this weekly thread, above all if the other educational links above,  is to nearly never exercise, as it destroys extrinsic value harvested by selling the option.  \n\nVF has been selling off brands this year and has above a 4 to one debt to equity ratio, negative cash flow and losses, and a cut dividend,  making it a precarious company.\n\nAre you willing to lose all funds in your option position? \n\n\nhttps://www.google.com/finance/quote/VFC:NYSE?hl=en&window=1Y\n\n\nIf VF shares  rise, it is far  more likely to reach the 20s than 30.  And the shares might fall again.", "score": 1, "replies": [{"body": "I see, thank you I get what you’re saying. Im fairly confident it will be very close to $30’s by Jan 2026. Imo it could see heavy buy pressure as institutions realize that the new management is the real deal. Im willing to lose the funds (intend to put no more than $5k though)", "score": 1, "replies": [{"body": "Buying at a strike of 20 allows gains for the rise beyond 20", "score": 1, "replies": [{"body": "Hmm alright. And also thanks, I just read the page you were referring to and it made me realize better how a call or put can be so multidimensional", "score": 1, "replies": []}]}]}]}]}, {"body": "Hello, please help!\n\nNVDL call at 73\n\nexpires September 9th 2024\n\npurchased for $6200\n\ncurrently worth $2600\n\nI know there is still a month left to wait plus earnings, honestly I don't think it will become positive, but is there a chance to make up some lost money at least? How high would NVDL have to go to reach even on this one anyways?\n\nthank you!", "score": 1, "replies": [{"body": "The general rule for any trade, whether it is showing a profit today or a loss today is, **are you confident that it will still provide enough rewards for the risks of continuing to hold?**\n\nIf the answer is yes, continue to hold. If it's FUCK YES!, double down and buy more cheap calls.\n\nIf the answer is no, cut your losses and dump the trade now. Then find a new trade with better prospects to use that remaining capital on.\n\nHope is not a plan. Losses are expected and commonplace when doing risky trading or speculation. If a single loss freaks you out, find something less risky to trade.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Maybe the 3000 block trade on day 9 was a glitch and it was actually 1500? Or a 3000 (all to close) and a 1500 to open, but the 1500 was omitted from the feed.\n\nWhen confronted with quotes that don't add up, my go-to guess is a glitch in the data feed.\n\nIs there a reason you are keeping the ticker a secret? Some pros on this sub could dig in deeper with their higher level access.", "score": 2, "replies": []}, {"body": "I would guess that on Day 1 the trade was opened between to parties, say A and B.  3000 contracts. Without more information, we can't tell what the trade was.  Spread?  Straight order?\n\nOn day 9 the party that opened the trade decided to close it.  Instead of A just doing it with B, it was also done with another party C.   If A's closing order was split evenly, A would close 3000 contracts, B would close 1500 contracts and C would open 1500 contracts.  There would still be 1500 contracts open, so OI would be 1500 and the volume would be 3000.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That is the only thing that would make sense.  If the OI is 3000 and there are 3000 contracts traded and the next day you see OI drops to 1500, that would mean 1500 contracts would be closed.  If there was no 3rd party, 3000 volume would take OI to zero.   Since the OI dropped, that means 1500 contracts would have closed by two parties.  There would have to be at least one other party in this trade.", "score": 1, "replies": []}]}]}]}, {"body": "Whats the better option strategy for the upcoming NVDA earnings assuming my outlook is bullish\n\nA calendar spread or a diagonal spread?\n\nWas thinking of something like buy a Sept06 128c and sell an Aug30 134c\n\nThis way my entry cost is reduced and if somehow NVDA misses the 134c mark I have one week of time value left on the long leg once the short expires. And if it does pass 134, I'll reach max profit for the spread (I'm fine with limited profit since my cot is reduced)", "score": 1, "replies": [{"body": "A calendar and diagonal are essentially the same strategy. The diagonal has different strikes with the calendar having the same.\n\nWhats better? I don’t know how to even determine what “better” means. \n\nProvided you are good with the risk and have done your analysis, which is looks like you did, then this is “better” for you.", "score": 1, "replies": []}]}, {"body": "I've heard people mention 0dte NVDA options. I only see weekly options, do these exist?", "score": 1, "replies": [{"body": "0 DTE doesn't mean you trade daily, it just means you open on expiration day, regardless of the sequencing of expirations. You could trade 0 DTE on quarterlies, monthlies, or weeklies. If a series only has Friday weeklies, meaning Friday expirations, you just wait until Friday to do your 0 DTE trades and sit out the rest of the week.", "score": 2, "replies": [{"body": "Ah okay. I was relating it to SPY options which actually has daily options. Makes sense\n\nThanks!", "score": 1, "replies": [{"body": "I figured. Lots of people think that SPY is representative of all of the options market, but nothing could be further from the truth. SPY is a rather unique outlier. Almost nothing compares to SPY on just about any metric.", "score": 1, "replies": []}]}]}]}, {"body": "Can someone please review my first option? Am I understanding what it means correctly?\n\n  \nPaying a premium to buy the option to buy UAL stock price on 10/18 for 46$ per share. \\*\\*Most I can lose in this trade is that premium I paid - in this case, $1500? \\*\\*\n\n  \nThat $1500 is calculated as $1.50 x 1000 (10 contracts @ 100 shares each). Is that right?\n\n  \n[https://imgur.com/a/PiTOACY](https://imgur.com/a/PiTOACY)", "score": 1, "replies": [{"body": "I can’t believe it when a brand new trader who admits they do not know anything tries to make a 10 contract trade!\n\nThere are 100 shares per contact so you are possibly on the hook for 1000 shares at $46, or $46,000. Are you ready and willing to buy the shares at this amount even if the share price?\n\nWhy not just trade ONE contract to put $150 at risk and learn what the heck you are doing?", "score": 1, "replies": [{"body": "I could buy them at that price, yes, or could sell the option prior to the exercise date, right?", "score": 1, "replies": [{"body": "Yes, of course. But why risk $1500 to explore and try to understand how options work, and possibly lose hundreds, when you can do the same thing for $150 and maybe lose at most $150?\n\nThe fact that you are asking this question shows you do not know how options work and so are likely to lose money.\n\nIn fact, why not paper trade to not risk any money while you learn?\n\nBTW, the answer when buying an option is the most that can be lost is the premium paid, unless the option expires ITM when it will be exercised and the shares bought at the strike price.\n\nIf the stock price moves between the time the exercise and the time the shares are in the account, typically Monday after a Friday expiration, then the trade can lose more.\n\nA quick example is if assigned 1000 shares at $46 and the stock drops to $45 by the time you can manage them on Monday then it would be a $1000 + $1500 for a $2500 loss. If the stock tanked $5 per share, then it could be $5000 + $1500 for a $6500 loss and so on.", "score": 1, "replies": [{"body": "Thank you for the detailed response.", "score": 1, "replies": [{"body": "You are welcome. Keep in mind that options are leveraged so can make or lose money quickly in ways that are not always evident.", "score": 1, "replies": [{"body": ":(", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Does anybody know if there is an options trading simulator out there that functions like a paper trading account with live market data but instead uses historical data? The only simulated trading platforms I have managed to find offer either: 1. paper account that use real time data. 2. Backtesting that uses input parameters and spits out results. \n\nThe paper trading option is great, but it has two key limitations from my perspective: you can only trade during market hours, and you are only able to trade that day's data. \n\nI've been searching for a simulator that functions like paper trading, but uses *historical data* that you can *pause and rewind*. I'd like it to look and feel like real-time trading, so I can get reps in with my current strategy.\n\nDoes a platform like this even exist?", "score": 1, "replies": [{"body": "The thinkBack feature on thinkorswim (TOS) will do this.\n\n[https://www.schwab.com/trading/thinkorswim](https://www.schwab.com/trading/thinkorswim)", "score": 1, "replies": []}]}, {"body": "Tomorrow Im opening an NVDA diagonal\n\nSept06 123c\n\nSell a Aug30 128c\n\nSomeone tell me why this is a bad idea", "score": 1, "replies": [{"body": "Why do you think it’s a good or bad idea? Let’s start there . . .", "score": 1, "replies": [{"body": "A couple reasons \n\n1. I’m bullish on nvda earnings\n\n2. This strategy reduces my cost basis\n\n3. If the august call gets exercised, I profit at my profit max. If it doesn’t get exercised I basically got the long leg at half price and would profit more", "score": 1, "replies": []}]}]}, {"body": "fade frighten worry badge melodic shocking sparkle ten flag ruthless\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": [{"body": "Theta ramps up closer to expiration. Know that while theta is higher the dollar amounts are lower.\n\nTheta may be lower on a 30 dte trade that can have a premium of $500, but a 2 day trade with higher theta might only have a premium of $20.", "score": 1, "replies": [{"body": "wild languid direful crawl offend shelter clumsy capable shame soup\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "icky disagreeable abounding screw depend hard-to-find bake snatch paint library\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": []}]}]}]}]}, {"body": "Hey - I’m somewhat new to investing and worried I made a mistake. I have bought and sold some options contracts on Robinhood, but only now realizing they were “naked” as I don’t own the underlying stock. I am learning more as I go, and definitely going to steer clear of options until I have a much better understanding of everything. I could not find this answer in the \n\nMy question: the person who bought the options contract from me can turn around and sell the contract, at which point they are responsible for the shares, correct? Is there any way for me to see which of my contracts I am currently bound to in Robinhood? Phrased another way, I’d really like to see a list of all of my options contracts I am still on the hook for to prepare for a potentially unfortunate reckoning in case they exercise them. \n\ntl;dr: I made a mistake trading options without understanding them perfectly. I can see in my account history all of my buys and sells, but I can’t seem to find a list of the contracts I have sold that I am bound to (have not been re-sold). Is there a way to see this list in Robinhood?", "score": 1, "replies": [{"body": "You bought long options and sold them to close your position.  When you do that, you are back to having no position, and you have no further rights or obligations. \n\nWhat you have heard about being able to be assigned when you \"sell\" options or are an \"option seller\" refers to selling options *short.*  That's when you start with zero options, and sell some to open a position. This is often notated in brokerage platforms as having a negative number of options.  This is not what you did, so you have nothing to worry about. \n\n\"Naked\" is a descriptor for short options not backed up by a shares position in the underlying.  It doesn't apply to long options.", "score": 1, "replies": [{"body": "Thank you so much for your reply. I believe this makes sense to me. I have never sold an options contract that I did not first buy. Thank you for pulling me out of an extremely scary moment haha. \n\nThat said and to make sure I understand: when I sold the options contract that I first bought, who is responsible to deliver the 100 shares of stock, if the person who bought it from me exercises it?", "score": 1, "replies": [{"body": "There isn't really a \"the\" option contract you bought.  It's not like there's an option with serial number 12345 that you bought, then when you sell it, the person you sell it to is now holding option #12345.  For one thing, when you sell to close, the counterparty could be buying to close a short position, so then where would that contract go?  It's more like, the OCC keeps track of how many longs and shorts of each contract each brokerage has, and each brokerage keeps track of how many longs and shorts of each contract each of their clients has.  When a long exercises, the OCC picks a brokerage at random to assign someone, then that brokerage picks someone, either at random or on a first-in-first-out basis, to assign.\n\nSo the answer is someone--could be anyone--who initially short sold one of those contracts (a call \\[you only ever said \"option\" or \"contract\" in your comments, but I assume you're talking about calls, you should specify because puts exist too\\] on that underlying with that strike and expiration.)", "score": 1, "replies": [{"body": "You are amazing, really appreciate the thoughtful response and helping me figure things out. I’ll do some more research and jump back in to the game when im ready!", "score": 1, "replies": []}]}]}]}]}, {"body": "Can someone pick apart this trade?\n\nI'm simulating a trade as a newb, but probability and greeks all show zero in active trader pro. I was using [optionsprofitcalculator.com](http://optionsprofitcalculator.com), but it has become flaky and changes the ticker when I hit go. I'm basing this trade mainly off the weekly chart with a weak practical knowledge. of options. I'm collecting some tickers and position ideas as non options guy. I went through the OIC course and have been reading a lot, and while all the knowledge is simmering in my head, I don't understand my platform feedback when I look at the stats for the trade. The profit and loss scale looks reasonable, but stats are all zero.\n\nIWC - $119\n\nBuy Oct 18 put @ $118\n\nSell Oct 18 put @ 105\n\nI wish [optionsprofitcalculator.com](http://optionsprofitcalculator.com) didn't flake on me, as that seemed to give me info I could chew on. Supprised that the actual trading platform seems odd.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They are empty there as well. Although that is a very nice calculator.\n\n  \nAlso and more importantly, is the following low interest and volume message the reason my active trader pro platform isn't showing anything? And if so, how do see options volume?\n\n[https://imgur.com/a/H4UXVNu](https://imgur.com/a/H4UXVNu)", "score": 1, "replies": []}]}]}, {"body": "Hi,\n\nI'm looking at calendar spreads and found something odd(?) in the P/L graph (or I'm just missing something)\n\nCan somebody explain to me why the P/L amounts to $641 when the price hits $180?\n\nIf I open a LEAP on AMZ at 120C with a debit of $5942 and I would sell the CC at 180C, according to my mafs the P/L would hit a max of 180-120-debit = $57.50 ? What am I missing?\n\n[https://optionstrat.com/build/diagonal-call-spread/AMZN/-.AMZN240927C245,.AMZN250620C120](https://optionstrat.com/build/diagonal-call-spread/AMZN/-.AMZN240927C245,.AMZN250620C120)", "score": 1, "replies": [{"body": "While a diagonal counts as a type of calendar spread, it's more accurate to describe a calender where the legs have unequal strikes as a diagonal.\n\nJust summarizing the other (correct) reply that's hidden behind a deleted comment: The P/L plot shows the expiration price of the front leg only. That's why it's just a straight line.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah you’re right, could you explain the phenomenon though? It’s easy to shuffle to 180 and see my written point", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Aaah thanks a lot, that makes quite a lot of sense! And what if the short call gets exercised? Is the P/L still the same?\n\nIt really does make sense then to buy 3 LEAPS for 1/3 of the underlying and sell 3 x CC’s instead of holding the actual underlying and sell a single CC, which then gives you x3 leverage (if you’re bullish long term offcourse)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah exactly, I assumed a broker will automatically exercise my long call to cover for the stocks, but I guess this isn’t true? So the only option remains is buying back the short and closing the position for a loss if I notice it’s getting close to ITM?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks! Selling the combined positions would then offer a profit if the strike is breached, just sell before exercise", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Been researching options for a while now, but want to gain a better understanding before I start trading them for real. A hypothetical I don't understand is if I decided I wanted to sell x shares of a stock if it hits a certain price, would it be strictly better to sell covered calls at that strike price? Assuming the time frames were comparable, I'm having trouble understanding the trade off there, would love some insight.", "score": 1, "replies": [{"body": "As an example, buy or be assigned 100 shares of a stock at $50, then sell a covered call at a strike of 52 and collect $1 in premium would set up the trade.\n\nThen, if the stock is at or above $52 when the CC expires the total profit would be $3 x 100, or $300. $200 would come from selling the shares at $52 which is $2 above the stock cost, then keeping the $100 from selling the option. \n\nIf the stock was not above $52 at expiration, then you still keep the shares and the $100 premium.\n\nThe tradeoffs are that you could wait to sell when the stock but lose out on the added premium. You also tradeoff the upside as the stock can rise to $53 but you would have to sell the shares for $52 (note that there is a tactic where the CC can be rolled which may capture more upside).\n\nIf you wait the stock may not rise and you would miss out on the $100 from selling the CC. In some situations, CCs can be sold over and over for premium income without the shares being called away, but you should always be ready to have the shares sold.\n\nMake sense?", "score": 1, "replies": []}]}, {"body": "In terms of pricing - When buying large amounts of LEAPS at one time in a bull market such as this, does it make sense to wait for a pullback?  That is, would it basically be the same price if the VIX is going wild? Or is it a more efficient use of capital?  \n\nLet's assume for the purposes of clarity that the correction is temporary and it will continue upward afterward.", "score": 1, "replies": [{"body": "> does it make sense to wait for a pullback?\n\nThat depends on your holding time. If you hold for decades, no. If you only plan to hold for a day, yes, probably. All the times in between are a sliding scale that favors not waiting the longer you plan to hold.\n\n> That is, would it basically be the same price if the VIX is going wild?\n\nThat depends on your delta. The higher the delta, the less \"VIX going wild\" will impact the cost of the calls.", "score": 1, "replies": []}]}, {"body": "For SPY, how do you find out when options are typically listed and their expiration dates? For instance, I can see NOW the options for January 17, 2025, which I’m assuming is a Friday. But when would the January 16, 15, etc options list? In other words, when are options created and how can I find out that info?", "score": 1, "replies": [{"body": "It's unfortunately rather complicated. Each series has its own rules.\n\nJanuary LEAPS are issued in September. So this September (2024), the 2027 January LEAPS should be listed, since the 2025 and 2026 are already listed.\n\nQuarterlies (Mar, Jun, Sep, Dec -- last day of those months) are usually issued a year in advance, so the SPY 2025 quarterlies through June are already listed. The Sep 2025 should be added in Sep 2024.\n\nMonthlies are the most complicated and follow the [monthly expiration cycle](https://www.optionseducation.org/referencelibrary/faq/leaps-and-expiration-cycles). TL;DR basically the front month, the following month, and then the cycle month following are listed at the start of the calendar year and then new listings (if any, depending on the cycle) are listed the day before the expiration day of the front month.\n\nFriday weeklies are generally listed 6 to 8 weeks before their expiration date. As of this writing, the SPY Sep 27 weekly was the latest to be listed and is a little over 5 weeks out from today. \n\nMonday thru Thursday weeklies are listed 2 weeks before their expiration date. Sep 3 (Tue) is the latest to be listed and it's 2 weeks plus 1 day out from today, because there's no Mon Sep 2 weekly due to the market holiday.", "score": 2, "replies": [{"body": "This is super helpful, thank you.", "score": 1, "replies": []}]}]}, {"body": "Hi guys! Looking for a little bit of advice. Recently got into trading options last week and trading as a whole. I’ve been doing massive amounts of research into it all . My first week trading was overall successful as I took a good profit however most of this was accumulated on the Monday and as the week went on I had more and more unsuccessful trades. Probably beginners luck lol. None the less I finished in a profit. My only concern is that I feel the more that I learn the less I actually make as many of my trades are hitting my stop loss. I’m unsure if options are something I should be trading especially as I’m trading oil and gold which seem quite volatile. Any advice and guidance is massively appreciated as I’m focused on learning as much as I can!", "score": 1, "replies": [{"body": "People usually don't use stop losses for options because they can swing wildly and you get quickly stopped out.\n\nWe often feel like profitable trades are the result of some knowledge or insight that we had, when in reality it was probably just luck.\n\nA good rule I use for myself is \"no one knows anything, especially me\".\n\nWith all these quick trades you will most likely lose, so just trade very small amounts while you learn how the market behaves.", "score": 3, "replies": [{"body": "Ahhh okay thank you very much! I feel I’m going to leave options for a little bit of time, what would you recommend I move to? Unsure if forex is for me at the time being.", "score": 1, "replies": [{"body": "I've never been successful short term trading anything so I'm not the person to ask. As far as I'm concerned that's all gambling and you should just buy and hold stocks long term :). But that's not the point of this sub I guess.\n\nMaybe if you wanna scratch your derivatives trading itch you could sell longer expiration index puts after the markets pull back. That's not too risky if your positions aren't huge.", "score": 2, "replies": [{"body": "Massively appreciate the response!", "score": 1, "replies": []}]}]}]}]}, {"body": "For thinkorswim desktop, how can I put a sell order where, once it hits double my cost, a trailing stop would trigger with lets say -10%, so if it goes up it can run as much as it can, but once it goes down it’ll lock in guaranteed profit within -10%. Thank you.", "score": 1, "replies": [{"body": "Are you asking how to manually create a trailing stop order, or how to set up a conditional that will automatically submit the trailing stop order once conditions are met (premium is 2x opening value)?\n\nIf the former, you just wait until the premium is at 2x by manual observation and then enter the order by hand, here's a vid: https://www.youtube.com/watch?v=Ybrq5e6l_jo", "score": 1, "replies": [{"body": "The second one based on conditional that will automatically submit the trailing stop order once conditions are met (premium is 2x opening value).\n\nThat video you sent I have seen and understand the basics. Just want to figure out this conditional", "score": 1, "replies": [{"body": "That's beyond my knowledge. You might have to try on the tos sub.", "score": 1, "replies": []}]}]}]}, {"body": "# Questions on covered calls based off of mine\n\nlink here: [https://drive.google.com/file/d/1E4yLF4M1YgA343rMIZHgktIZLkv5CVZm/view?usp=sharing](https://drive.google.com/file/d/1E4yLF4M1YgA343rMIZHgktIZLkv5CVZm/view?usp=sharing)\n\nmostly im wondering\n\n* based off of todays return and total return, have i made any money off of this?\n* since my limit price is 45 cents and bid is 25, does that mean no one has bought this contract?\n* if not, what happens if no one does? will i make anything?\n* have i already gotten paid the premium?\n\nit is inevitable someone will comment \"dont invest in anything you dont understand\" but we all start somewhere.", "score": 0, "replies": [{"body": "I don't use Robinhood and am not familiar with their interface, but here's what I glean from that:\n\n1. On 8/14, you sold short an 8/16 SERV 11.5 strike call for a credit of 0.45.\n2. You are setting up, but have not yet submitted, an order to buy to close that call for a limit price of 0.45.\n\nIf you were to submit that order, and it were to fill, you would have received $45, and paid $45.  You would have neither made nor lost any money.\n\nRH is telling you the \"current price\" of that call is 0.35, but that is because the bid/ask is 0.25/0.45.  0.35 is therefore a reasonable starting point for a price at which to buy the option, though you may have to go closer toward the ask.  You could almost certainly do better than 0.45, though.\n\nYou are wanting to buy one of these contracts.  Whether anyone else does is irrelevant.  Note that you have not actually submitted your order, though.\n\nWhen you sell an option short, the money does go into your account at the time.  But RH is unusual among brokerages in hiding that fact from you and not crediting you with the cash until you close the position.", "score": 2, "replies": []}]}, {"body": "update:\n\nim not doubting what u/arcite1 said but it looks like this option play has actually netted me $44.00.\n\nFWIW, after watching quite a few videos but not being able to find one specifically on selling covered calls on robinhood that goes over every single datapoint, i decided to give it a go anyways.\n\ni made sure to buy 100 shares and then i went to trade options and sell calls. i then picked a price not too far above the current price but one i didnt think it would reach that still offered a premium which was 45 cents.\n\n[https://drive.google.com/file/d/1gmuJP6IxEUnYIstuQ5vpDJm4ykCl4uRZ/view?usp=sharing](https://drive.google.com/file/d/1gmuJP6IxEUnYIstuQ5vpDJm4ykCl4uRZ/view?usp=sharing)", "score": 0, "replies": [{"body": "Not sure where you are getting $44. In that screenshot, you are setting up a limit order to buy at a limit of .10. Since you sold at .45, that would be a net profit of $35 if filled. Note that as of that screenshot, you have not actually submitted the order yet. You may not have to pay as much as .10. Given that the bid is 0, it would be better to start with a limit order of 0.50.", "score": 1, "replies": [{"body": "under \"your position\"\n\ntotal return: $44, date sold: 8/14.\n\nim not buying or selling anything else.", "score": 0, "replies": [{"body": "Since you received $45 when you sold, the estimated \"total return\" of $44 must be based on the assumption that you can buy to close for 0.01.", "score": 1, "replies": []}]}]}]}]}
{"title": "37k€ into TSLA", "selftext": "I don't have that much money, but I just bought 37k of TSLA last week (20k+17k) on the 7th  \nFor now I'm about 500-800€ down :D\n\nI don't play options because I don't understand them, also Trade Republic UI is weird af\n\n\n\nhttps://preview.redd.it/bkisr8sibeid1.png?width=1179&format=png&auto=webp&s=9860b6603a3c5cdd8745027edc325f5e084ffa16\n\n", "id": "1er30nr", "created_utc": 1723539451.0, "score": 26, "upvote_ratio": 0.68, "num_comments": 73, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "May musk have mercy on your stocks", "score": 45, "replies": []}, {"body": "Apparently you have too much of the monies🫶🏻", "score": 21, "replies": []}, {"body": "Tsla isnt going up without selling cars.\n\nAnd they arent selling cars.", "score": 44, "replies": [{"body": "Let's see Q3 numbers![img](emote|t5_2th52|52627)", "score": -34, "replies": [{"body": "All other car manufacturers are showing a big decline in sales.\n\nTsla showed a decline YoY.\n\nWe're in a recession, and you think they not only made back what they didnt sell last Q, but will surpass expectations.", "score": 8, "replies": [{"body": "I'm a pretty optimistic guy", "score": -20, "replies": [{"body": "And that’s a great trait, in life. In investing you have to be objective as much as possible or lose money.", "score": 13, "replies": [{"body": "![img](emote|t5_2th52|31224)", "score": -6, "replies": []}, {"body": "Nah this is bs. You have to be lucky as shit that is all.", "score": -4, "replies": []}]}]}]}]}]}, {"body": "I was in Tesla.  Now i am in QQQ.  Life is good.", "score": 8, "replies": []}, {"body": "Please keep us updated when you 10x your loss", "score": 18, "replies": [{"body": "That's the idea of making a reddit isn't it? 🫡", "score": 8, "replies": []}]}, {"body": "whistlin diesel would like a word", "score": 4, "replies": []}, {"body": "I'll go in when they hit 175", "score": 6, "replies": []}, {"body": "I'd argue, that Tesla is the weakest investment choice of the Mag7 based on fundamentals. PE is pretty high, revenue is declining and car producers is generally a cutthroat industry with low margins, usually trading at a PE of 4 to 7. They are valued as a full Tech company, but even then PE is the highest of the MAG7. They promise a lot with selfdriving cars, robotaxis and factory roboters, but its hard to predict if they can achieve the first success out of all companies in these sectors, how well they can monetize it and how quick competitors are able to takeaway market share IF and WHEN they can achieve these goals. At the moment the Tesla Cult is the driving factor of the stock price, fundamentally its highly overvalued.", "score": 7, "replies": [{"body": "Car makers currently struggle with many things. While the conservative sales are mostly attributed to \"buyers being under financial pressure\", personally I believe, a far more relevant reason is, that car buyers make competent decisions. Those, who are hell bent on fossile fuel cars will delay their next car buy as much as possible. Why? Because they know, those cars will disappear and they intend to drive their last one as long as possible. EV buyers on the other hand wait out their buy, because the technology is making massive strives and buying two years from now means, you will get a much more sophisticated product at a time, when significantly better infrastructure has been built.\n\nOverall this will blunt the market for cars in the west for the next 5 years (Assuming, there will be no possible measures by goverments to greatly incentivise buying EVs now.) That would change things). There should be a massive run however at the end of that phase.\n\nTesla adds a whole new problem to that general issue of car builders though. Elon Musk is massively and publicly and aggressively at odds with the views of his most important customer base. There may only be one company that has publicly declared to buy no more Tesla, but others will silently decide that turning up with Teslas at their customers will send the wrong signal. This means, buyers for car fleets which bought Tesla to project a liberal, open, visionary mindset will stop buying. And these people are a pretty big market. And it´s a market, that will not wait out the next half-decade.\n\nAs for the other things: Yes, Tesla is doing a lot of stuff. And some of that stuff basically finances the Elon-depression in car sales. But there is a problem. And it´s Elon. Because a lot of his projects look like a deeply homonal teenager with no impulse control is just trying to fulfill all of his dreams. And that´s fine for a billionaire to do. Some of what he does will massively improve the future and you need to be a little crazy to do that. But if you run those dreams as a business, it´s a red flag. And a CEO, who increasingly seems to regress into a teenagers level of self control is a massive liability.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "You are welcome <3", "score": 1, "replies": []}]}, {"body": "Calls on Rivian you say?! ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4267)", "score": 3, "replies": []}, {"body": "Hold long term, sell covered calls above your average price.", "score": 3, "replies": []}, {"body": "would have been smarter to buy an actual Tesla from that money.", "score": 2, "replies": [{"body": "might depreciate less than the stock 🤣", "score": 2, "replies": []}]}, {"body": "I am down 2.5k on AMD and 1k with ASML", "score": 2, "replies": [{"body": "Good luck brodi 🥹", "score": 1, "replies": []}, {"body": "I was thinking about putting some money on AMD after intel shit the bed last week but decided to skip it.", "score": 1, "replies": []}]}, {"body": "You know every great hero or villian has their time in the sun, then just like Icarus they get too close and burn. \n\nMusk's had his time, we are entering the era of his downfall.", "score": 2, "replies": []}, {"body": "I heard \"electric vehicles\" are the \"next big thing.\" \n\nHere in the US, families are struggling to buy groceries, buy gas, and pay rent . . . but we \\*love\\* those futuristic vehicles!", "score": 7, "replies": []}, {"body": "Ummm,…I’m sorry.", "score": 4, "replies": []}, {"body": "You're about 7 years too late on this one, better luck on the next trade. Also you'll find that your portfolio is now dependant on what weird shit Elmo tweets rather than the performance of Tesla itself ![img](emote|t5_2th52|4267)", "score": 1, "replies": [{"body": "Already made quite some money on TSLA on the past, i'm just giving back", "score": 2, "replies": []}]}, {"body": "I was wondering who buys TSLA and why. Could you explain why you think it’s a good idea to buy.", "score": 1, "replies": [{"body": "Waddap, tbh I might not have the answer you are looking for but for me is that I trust their innovation, not only in cars, ai, batteries... regarding elon love him or hate him but his tweets alone can move markets, idk i think there's pontential for growth even if it's not right now in the upcoming 1-2 years", "score": 1, "replies": [{"body": "> I trust their innovation, not only in cars, ai, batteries\n\nhttps://www.reuters.com/investigates/special-report/tesla-batteries-range/\n\nhttps://www.theverge.com/2024/4/26/24141361/tesla-autopilot-fsd-nhtsa-investigation-report-crash-death\n\nI think the tesla ship is gone, other automakers are catching and some countries are start dropping their subsidies when you buy electric cars:\n\n>Germany's electrical vehicle subsidy programme will end prematurely on Monday after paying out some 10 billion euros since 2016, the Economics Ministry said, the latest sign of belt-tightening following the adoption of a revised 2024 budget this week.\n\nTheir truck is not even available in Europe and never will be with this form. Just buy crypto if you want to go full casino mode. It is your money but in investment, I think you should be realistic with a pessimistic look.", "score": 1, "replies": [{"body": "I still think that they will make some groundbreaking move in the upcoming 1-2 years, even if it's just the 30-35k car they have been promising for 5 years, that'd be huge  \nAnyway, I'm prolly wrong but we'll see", "score": 1, "replies": [{"body": "> I still think that they will make some groundbreaking move in the upcoming 1-2 years\n\nBased on what you think this will happen? It is just \"wishful thinking\" at this point. \n\nBack in 2017 I was thinking Nvidia will be big because I was working in a company that was developing AI and I was aware how nvidia GPUs are better than AMD (we had servers only with nvidia cards because of the CUDA cores that nvidia use). We started having clients that wanted AI integrated into their software just for the sake of the buzzword and these clients were impressed when we had something like chat GPT (there was no chatgpt back then). They really thought we would just put some algorithm that does 1%  improvement at best. I based my purchase on my expectations about their products.", "score": 0, "replies": [{"body": "I base my expectations on faith + is a hype stock\n\nI just trust that what he said like 5 y ago will become true and i hope that to be huge, that's it", "score": 2, "replies": []}]}]}]}]}]}, {"body": "German buy American automobile ? I saw Porsche is going throw a rough ride but I’m not into car stocks", "score": 1, "replies": [{"body": "The german car market is big enough for everyone. And Tesla was the \"face\" of EV for some years. They have a factory up and running near Berlin as well. But looking forward MUsk will be a massive liability, because germans tend to have very strong political opinions and they tend to be very far away from Trump and what he peddles. For most carmakers, that would not make a difference, but Elon is to much of the face of the brand to not hurt it´s business by alienating it´s main customers. \n\nJust imagine Jen-Hsun Huang suddenly subscribing to the \"One China\" policy of Beijing and what that would do for his relations with TSMC.", "score": 1, "replies": [{"body": "Germans love cars. If they make good cars they don’t care. They love combust engines though not battery cars. \n\nNo one cares who Gates votes you still use Microsoft or who Zuckerberg eats dinner with. You’re in insta and Facebook. Same applies to Elon", "score": 1, "replies": [{"body": "Well, these two did not go into big constroversies about politics, did they? How did Musk fare with X so far? And trust me: Germans care very much about their car as a status symbol. And \"Trump ally supporter\" is not the status, most EV buyers in germany want to carry.", "score": 1, "replies": []}]}, {"body": "Porsche never had the rainbow ;). You see Germans lining up for that GT3RS which costs a few kidneys.", "score": 1, "replies": []}]}]}, {"body": "You better hope, that Elon is betting on the wrong horse then. Donald Trump basically said: \"I´ll destroy the market, Tesla exists in, but I´ll throw him a bone\" \n\n[https://www.politico.com/news/2024/08/12/trump-musk-electric-vehicles-00173682](https://www.politico.com/news/2024/08/12/trump-musk-electric-vehicles-00173682) \n\n>...Trump told a rally in Atlanta this month that he’s for “a very small slice” of cars being electric.\n\n>“I have to be, you know, because Elon endorsed me very strongly,” Trump said.\n\nHowever Trump is not known to remember people, he needed, when he does not need them anymore. Musk might very well end upo being the Giuliani of CEOs. Then again, maybe Trump appoints him as head of NASA to apologize after he sent Tesla to \"20 going on bankruptcy\"...", "score": 1, "replies": []}, {"body": "!remindme 10 weeks", "score": 1, "replies": [{"body": "I will be messaging you in 2 months on [**2024-10-22 16:25:05 UTC**](http://www.wolframalpha.com/input/?i=2024-10-22%2016:25:05%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1er30nr/37k_into_tsla/lhxk8li/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1er30nr%2F37k_into_tsla%2Flhxk8li%2F%5D%0A%0ARemindMe%21%202024-10-22%2016%3A25%3A05%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201er30nr)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": [{"body": "If you had bought SPY instead of TSLA the same day, you would be at about the same. Congrats on matching the market, which is better than can be said about most regards here. 🫵😎🍸", "score": 1, "replies": []}]}]}, {"body": "Bumppppp", "score": 1, "replies": []}, {"body": "Trade repbulic is not the platform to buy your stocks. Use a normal broker like ibkr", "score": 1, "replies": [{"body": "Thanks for the advice!  \nIt was the first platform that I saw had low interests \\~+4% interest(yearly), +1% on card expenses, which is not normal in Spain  \nWhat's the difference? Rates seemed high when i read about it back in the days", "score": 1, "replies": []}]}, {"body": "It looks like you just bought stocks, which is a okay play and not nearly as regarded as whatever everyone else is doing in this sub. So dont worry about it. Sure Tesla is a bit of a wild stock to buy with the scizophrenic man that runs it, but it can be profitable.", "score": 1, "replies": [{"body": "Ngl i don't understand how the calls/puts works, I just know that u can lose/earn a ton of money :')", "score": 1, "replies": [{"body": "Trust me, its not worth it. I have dealing with those for a couple of years or so, and I do make money here and there, and yet everytime I check Trade Republic its clear I am more profitable in ETFs and stocks", "score": 2, "replies": [{"body": "Good to hear, it doesn't even sound interesting to me tbh so idk if I even want to try it out, also, trade republic UI sucks IMO, so idk how that would work trying to trade those options", "score": 1, "replies": []}, {"body": "I don't understand them either but it seems to me i might as well just put my money on black", "score": 1, "replies": []}]}]}]}, {"body": "I hope you join the Intel guy in heaven.\n Fuck tesla.", "score": 1, "replies": [{"body": "thanks javier", "score": 2, "replies": []}]}, {"body": "Tesla is more then a carproducer. \n\nPeople forget that. \n\nThey will produce AI robots taxi every few seconds\n\none day. \n\nA taxi driver who can work 24/7 and needs no payment. \n\nThats a 100x bag.", "score": -6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "There is a fundamental difference between any of the businesses you mentioned other car manufacturers being involved in and what Tesla is developing. Incredible that I even have to point that out.", "score": -3, "replies": [{"body": "There's nothing incredible about what TSLA is doing, you're falling for a con.", "score": 4, "replies": [{"body": "Right, the most innovative car company ln this planet is a con.", "score": 1, "replies": []}, {"body": "Right, the most innovative car company ln this planet is a con.", "score": 1, "replies": []}, {"body": "Right, the most innovative car company on this planet is a con.", "score": 1, "replies": []}, {"body": "Right, the most innovative car company on this planet is a con.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Tesla very much is not a 100x bagger, that's an insane proposition to even consider or look for; it's gambling. However, a decent 5x in the next 3-5 years based on FSD alone is sandbagged.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "5x would be +400%.\n\n\nRelative valuations don't make sense for a company involved in as many disruptive technologies as Tesla.\n\n\nI do agree that Optimus and similar AGI bots are likely still a long way out, especially when considering the regulatory hurdles a human-like AGI on 2 legs would bring with it. Tgis is why I don't consider Optimus for my investment thesis.\n\n\nWaymo robotaxi operates in restricted areas of urban centers to ensure max reliability in execution. Tesla FSD won't be limited in such a way, since their cars are cheap enough in production to be retail-grade. If you've watched *any* of the recent FSD versions perform on US streets, you know that full fledged, vision-only FSD at this point is only a matter of time, after which Waymo and other Robotaxi businesses will not be competitive anymore because of the exorbitant manufacturing cost of their vehicles.\n\n\nAt last there's their venture into the energy storage business, which is going to see rapid growth acceleration in the near future due to the increased demand for energy availability in computation and storage in renewables. \n\n\nYes, I do believe that Tesla will be one of the biggest companies on Earth, because they're positioned in multiple high growth sectors and they've proven in the past to have vision as well as the competence to implement it.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">I don't. I literally talked about a company that has robots working right now in warehouses and the frontlines of a war. It's Tesla's Optimus that's miles behind\n\nRobots have existed for centuries. Robots, that can learn to do \\*any thing\\* a human can do, have not. I haven't denied that there are robots being produced today that can do a certain specific thing very well, but that's not the value proposition of Optimus.\n\n>Waymo uses sensor fusion of vision, radar and lidar mapped streets so that the autopilot system knows 100% what it's seeing. like I said, Tesla refused to adopt Lidar for this reason and then scrapped radar as well. This has already caused deaths\n\nI'm not sure what you're arguing against here. I think Elon's argument about humans also only possessing visual sensors to interpret road signage and events is quite convincing. Why would an AI not be able to perform similarly well or even better when supplied with the same data?\n\n>No, because the internal emails of Tesla in 2016 that were revealed in the recent court case showed that demos have been staged and faked at the behest of Elon before. It's not a conspiracy theory; Elon and Tesla just has no credibility in this regard.\n\nIf you're living in 2016, your sentiment towards FSD is not a surprise. Tesla has only recently scrapped most of their initial approach to FSD in favour of an end-to-end neural network solution, which is already orders of magnitude more performant than the prior statically programmatic approach both with regards to decision making and driving comfort. I highly encourage you to watch some of the latest videos of FSD 12.5.x in action and form your own opinion.\n\nI know people who use FSD privately; this is not staged.\n\n>Some of the car companies I mentioned prior also manufacture batteries. Tesla batteries merely change the packaging; not improve the technology.\n\nThat's of no concern in my opinion. Tesla is renowned for their manufacturing prowess. Besides, they will likely outcompete other producers when it comes to infrastructure contracting simply because they're an American company. The demand will far outmatch the currently available supply, so there's a piece of the pie available for everyone anyways.\n\n>Also, the idea of LI-ION buffer storage for renewables is really showcasing you lack a sense of scale of this technology. There's a reason why other companies have avoided this.\n\nI do not know what you're referring to here as I lack the necessary technical understanding; however, I'd expect a company which has successfully driven innovation in the past to not make mistakes a random dude on reddit would be able to lecture me about. I'm sure there are valid reasons for their choice of storage technology.\n\n>However, a p/e of 50 means even if all the tech came to fruition; the current price is overpriced. If the technology doesn't pan out or a competitor gets there first (which I have argued is the case) then it's worth considerably less than it is now.\n\nI haven't looked into the exact valuation fundamentals. However, I'm not seeing any other company make FSD-capable retail grade cars (a product which will be highly sought after) en masse, which leads me to believe that any valuation really is justified at this point, since they're effectively going to have a monopoly.\n\nFSD-capable vehicles are the first mass produced, consumer oriented AI-robotics merger product and they will capture the global market by storm.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">E.G: Motorcycles at night where narrow low down red tail lights can be confused as car tail lights far away.\n\nDo you have Radar and Lidar in your head? No? How do you determine whether it's far away or not? If you can't do it (which you can), then FSD doesn't need to either. The minimum working condition for FSD is to be as good as a human driver, which is accomplishable by vision only.\n\n>I reckon Tesla will be -70% by the next 3 years. And I'm gonna put my money on that.\n\nYou're not the first and you won't be the last. Thanks for playing.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Minute 6.18\n\n\"\\[...\\] so 8 cameras and an artificial intelligence is all you need for autonomous driving. In theory? In the future? I agree.\"\n\nThat future is now.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Musk is going the way of Mike Pillow. \n\nHe just sucked Trump's cock for 3 hours straight last night. Why the absolute fuck would you throw your money on that?", "score": -1, "replies": [{"body": "the sukk he did seems to have paid off", "score": 1, "replies": []}]}]}
