{"title": "Why all the secrets!? Why not share ideas...here's my latest", "selftext": "I see people on here asking questions related to strategies on what seems like, or are specific stocks, without mentioning the stock.  Why not mention the ticker?  If anything, some additional volume might help your case.  \n\nToday I tighten my put spread on nvda.  Originally had what I thought was a pretty moderate IC; 102/97.5 puts and 120/125 calls (both credits).  Rolled the calls down to 115 last week, rolled down again this week to 109.  End of day I'm 97/98 and 125/109.  I'm sitting here considering shutting down the 109s for 50% gain, but screw it, that's enough maintenance.  Hopefully I don't get burnt for the remaining .25.  \n\n", "id": "5nt4k2", "created_utc": 1484340035.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 14, "comments": [{"body": "I don't keep secrets.  I just don't share trades because I'm wrong almost as often as right.", "score": 14, "replies": [{"body": "This - I'm only wrong if I'm advising other people :D", "score": 2, "replies": []}]}, {"body": "Translation for newer folks:\n\n> Originally had what I thought was a pretty moderate IC;\n> \n> 102/97.5 puts and 120/125 calls (both credits). \n\nLong put/Short put/Short call/Long Call\n\n97.5/102/120/125\n\n> Rolled the calls down to 115 last week, \n\n97.5/102/**115**/125\n\n> rolled down again this week to 109. \n\n97.5/102/**109**/125\n\n> Today I tighten my put spread on nvda. End of day I'm 97/98 and 125/109. \n\n**97/98**/109/125\n\n> I'm sitting here considering shutting down the 109s for 50% gain, but screw it, that's enough maintenance. Hopefully I don't get burnt for the remaining .25.", "score": 6, "replies": [{"body": "I am new at this, why roll down only one of the calls and not both? Less risk?", "score": 1, "replies": [{"body": "He's already long the 125 where he's lost money.  But the 125 is a hedge to have a defined max loss.\n\nHe's taken the profits on the 120, 115 and looking to profit on the 109 with NVDA dropping.  \n\nMeanwhile, he lastly adjusted the put which I assume is b/c NVDA is going in that direction.  I didn't check the prices before posting this.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "This is interesting, do you target a specific delta? Do you manage early, take assignment and sell calls against it until called away? Target specific DTE?\n\nI'd be curious to hear more about your strategy ", "score": 1, "replies": []}]}, {"body": "I'll be honest. 1) I'm here to learn and assist. I'm not about to give out \"stock tips\" or \"options tips\" because I may be dead wrong. There are too many people out there who just want to be told what to buy and sell and probably even when. It's important (to me) that people make their own choices and live with their own consequences (good or bad).\n2) Paranoia. This is not rational (admittedly so), but I don't like the idea of someone deliberately taking a trade against me. Granted, if you view the market as a zero-sum game (it's not) then the answer would be that this is always going to happen. I have a healthy irrational (maybe rational) fear of market manipulation. Actually, given that LIBOR was manipulated so well for so long--it's all very able to be manipulated.\n\n3) I don't know that the actual ticker matters at all. That says very little about the overall risks taken or mitigated. I think what risks are accentuated and what risks are mitigated is the more important discussion. Are you long Delta? Short Delta? Long Theta? Short Theta? ....Gamma...Vega...Directional? Non-directional?", "score": 3, "replies": []}, {"body": "What's your expiry? I'm in NVDA too just much wider. I think I'm at 85/90/130/135. Have to double check though.", "score": 2, "replies": [{"body": "Regular Jan. If it all goes well I think I net close to $3. Kinda a lot of work. Did you open the calls before it tanked? My timing was early to the puts and late to calls. Can't complain about a profit. ", "score": 1, "replies": []}]}, {"body": "Why all the secrets?  If you and 10,000 other redditers are trying to sell the same thing, what do you think will happen to the price?\n", "score": 1, "replies": [{"body": "Ehh, I would honestly be shocked if this sub could move a market. Maybe in something that's not liquid, but most people in here don't really trade illiquid stuff.", "score": 5, "replies": [{"body": "> I would honestly be shocked if this sub could move a market.\n\nThis.", "score": 2, "replies": []}]}, {"body": "If you sell it, and then share that you sold it, it can only help you if a ton of other people start selling it too? Declining price and IV are what you want if you've already sold the premium.", "score": 2, "replies": []}, {"body": "Judging by the size of trades here, not sure it matters too much. And options are going to reflect the stock price more so than moderate additional selling volume. ", "score": 0, "replies": []}]}]}
{"title": "I bought into the AMD hype like an idiot, and have lost 15 dollars so far. Should I cut my losses and sell?", "selftext": "It's been a good learning experience. Always check that P/E ratio to see if a stock is overvalued like crazy. ", "id": "5ns15v", "created_utc": 1484329358.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 18, "comments": [{"body": "Seriously, if you can't take an unrealized loss of 15.00, you shouldn't be in the market at all.", "score": 46, "replies": [{"body": "also, if he bought like $200 worth he is getting rekt on transaction costs anyways.", "score": 7, "replies": [{"body": ".what is robin hood", "score": 6, "replies": []}, {"body": "Dude they are both joking.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "5k of AMD.  You've got some brass balls my friend.  I think they've got a turn around in them, but I would have bailed out long ago.  I don't understand what's going on in the very recent price of their stock, apparently some institutions have pulled out on them, but I hope (that doesn't help, I know) they can rally. ", "score": 1, "replies": [{"body": "Lol I have more than that invested and believe me well see above 12 dollars again. Make sure to look further into stocks before you invest, seems your dd on AMD is a little lacking", "score": 7, "replies": []}]}]}, {"body": "The stock market ^somethingsomething ^transferring ^wealth ^somethingsomething ^patient  \n\n-Warren Buffet", "score": 7, "replies": []}, {"body": "but high sell low + transaction fees, cant lose ", "score": 5, "replies": [{"body": "Love dat scottrade 14 dollar molestation charge. ", "score": 1, "replies": []}]}, {"body": "I would say AMD stock is headed towards better days. I've seen some test results of the new desktop lineup and it's their most promising offer in a long time.  I also believe INTEL has really screwed up with changing their development schedule of \"TICK TOCK\" which they introduce new architecture, then die shrink.  Now they want to do \"Tick, Tock, Tock\"  New Architecture, Improvements, Die Shrink.  Personally they're getting away from a tried and true method that has resulted in some of the best leaps in performance they've ever achieved.  Lastly, Tech stocks are the most volatile stocks you can own, and if you're lamenting a $15 loss, you seriously failed at selecting stocks.   You may want to look at Mutual Funds, or Indexes, and avoid Tech Stocks.  ", "score": 3, "replies": [{"body": ">if you're lamenting a $15 loss, you seriously failed at selecting stocks. You may want to look at Mutual Funds, or Indexes, and avoid Tech Stocks.\n\nOr burying your life savings in a coffee can in your back yard.", "score": 2, "replies": []}]}, {"body": "You just got a $15 education.", "score": 4, "replies": []}, {"body": "Check the P/E ratio on $NFLX and then tell me that's all you should be checking lol", "score": 1, "replies": []}, {"body": "You got 'em good, OP.", "score": 1, "replies": []}, {"body": "relax. why so cereal?\nits 15 bucks. give it a couple months lol.\nat the end of the day it is your choice but I would do more research and it might change your mind. ", "score": 1, "replies": []}, {"body": "Oh no $15. But seriously its selling on no news. It will bounce back by march", "score": 1, "replies": []}, {"body": "15 dollars doesnt matter but hold imo even though there might be a rocky time ahead.", "score": 1, "replies": []}, {"body": "Hold. The whole sector is growing.", "score": 0, "replies": []}]}
{"title": "All in. Short AMD", "selftext": "", "id": "5nn531", "created_utc": 1484266419.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 9, "comments": [{"body": "Using leverage and money you don't have to short a high momentum stock. Honestly, this is the single BEST strategy I have ever seen. Future millionaire guaranteed.", "score": 20, "replies": [{"body": "What do you suppose the dimensions on his yacht will be?", "score": 5, "replies": []}]}, {"body": "What loan website is this lol", "score": 9, "replies": []}, {"body": "You're going to regret this", "score": 9, "replies": [{"body": "If only he'd actually done it. It says accept terms & conditions. This is just proof he punched numbers into a loan app", "score": 11, "replies": []}]}, {"body": "Inverse this mouthbreather to hell", "score": 5, "replies": []}, {"body": "Did you get a cash advance?", "score": 2, "replies": []}, {"body": "Please don't do that.", "score": 2, "replies": []}, {"body": "Post  in one of the 39385 other posts about AMD.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}
{"title": "Bear market buys", "selftext": "[deleted]", "id": "5nnj4r", "created_utc": 1484270723.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 13, "comments": [{"body": "TVIX.  I'm stocked up on it.", "score": 5, "replies": [{"body": "So this will go up because the market will be volatile?", "score": 0, "replies": []}]}, {"body": "Spy puts ", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Depends on the expiry date. I have March 219 puts. I won't hold those all the way tho. Depends on your strategy man. I just think trump will fuck the market some more and earnings will be disappointing at the eom ", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Best way to learn is YouTube and throwing some cash down. Paper trades or simulators don't train your brain for the real thing ", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Rock and roll bro ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Thinking of doing the same here next week.", "score": 1, "replies": [{"body": "WE ARE ONE", "score": 1, "replies": []}]}, {"body": "My buddy has been making a daily killing on these since monday. Shoulda jumped in...", "score": 1, "replies": []}]}, {"body": "Gold etfs.", "score": 1, "replies": []}, {"body": "SDOW\nSPXS\nJayNUG\nNUGT", "score": 1, "replies": []}, {"body": "$tza?", "score": 1, "replies": []}, {"body": "DGAZ should be in this portfolio.", "score": 0, "replies": []}]}
{"title": "Spacex launch tomorrow, in on $TSLA?", "selftext": "", "id": "5nqj2e", "created_utc": 1484313269.0, "score": 13, "upvote_ratio": 0.81, "num_comments": 20, "comments": [{"body": "Historically, what causes a greater impact to the tesla price? A successful launch or a fiery explosion? Pick whichever event causes higher volatility and bet on that", "score": 8, "replies": [{"body": "Bet on all the launch :p", "score": 3, "replies": []}]}, {"body": "SpaceX has absolutely no impact on Tesla stock...", "score": 12, "replies": [{"body": "A SpaceX rocket blew up with a FB satellite and TSLA went down\n\nThe market makes no fucking sense", "score": 29, "replies": []}, {"body": "Consider Elon Musk is also the founder, I speculate it may have some impact.", "score": 12, "replies": [{"body": "If Elon proves he can make an autorocket to park itself in the middle of the ocean, I bet he can make an autocar park itself in the middle of a city. ", "score": 12, "replies": [{"body": "There is plenty of rocket in the sea", "score": 7, "replies": []}]}]}, {"body": "Neither do random cryptic tweets from Elon amirite?", "score": 5, "replies": []}, {"body": "Lol you clearly haven't been paying attention the last few years. ", "score": 2, "replies": []}]}, {"body": "Spacex=/=Tesla, but if Elons toy breaks then TSLA will take a small hit.", "score": 2, "replies": [{"body": "Elons toy is tesla, spacex is what he really cares about.", "score": 2, "replies": []}, {"body": "And if it work? Very rarely we can bet on private company but Musk right here is close to making history as we speak.", "score": 1, "replies": []}]}, {"body": "How does Marky-Mark Zuck de Duck feel bout this? ", "score": 1, "replies": [{"body": "It's all part of the plan to put all the duck on Mars. ", "score": 1, "replies": [{"body": "Quack bb.", "score": 1, "replies": []}]}]}, {"body": "Inb4 bad weather conditions and the rocket can't launch. ", "score": 1, "replies": []}, {"body": "You're looking for IRDM. That will reflect on the launch tomorrow", "score": 1, "replies": [{"body": "Why/", "score": 1, "replies": [{"body": "Space X isn't affiliated with Tesla. They're sperate programs directed by the same guy. But falcon 9 was carrying Iridium ($IRDM) satellites which would've benefited positively from a successful launch", "score": 1, "replies": [{"body": "$IRDM save a few hundred thousands and partnership with SpaceX, nothing innovated or change the world to come. ", "score": 1, "replies": []}]}]}]}]}
{"title": "J.P. Morgan Early Look at the Market – Fri 1-13-17", "selftext": "Full version: [DELETED PRIOR TO MARKET CLOSE]\n\n----\nJ.P. Morgan Early Look at the Market – Fri 1.13.17\n\nTrading Desk Commentary; For Institutional Investors Only\n\n**PLEASE DO NOT FORWARD THIS DOCUMENT**\n\n#Morning Levels\n•   US futures are up 3-4 points\n\n•   Asia: Japan Nikkei +0.80%, Japan TOPIX +0.62%, China -0.21%, Hong Kong +0.47%, KOSPI -\n0.50%, Taiwan -0.33%, Australia -0.79%\n\n•   EuroStoxx 50 +0.78%, FTSE +0.37%, DAX +0.60%, CAC +0.85%, Italy +1.18%, Spain +0.76%\n\n•   USD (DXY) down 0.14%, EUR up 0.32%, GBP up 0.49%, JPY up 0.03%, CNY Onshore down\n0.07%, CNH Offshore up 0.14%, AUD up 0.07%\n\n•   VIX down 0.87% to 11.44\n\n•   Gold up 0.14% to $1,197.11\n\n•   Silver down 0.09% to $16.81\n\n•   Copper down 0.75% to $265.15\n\n•   WTI Crude down 1.04% to $52.46\n\n•   Brent Crude down 1.21% to $55.33\n\n•   Natural Gas down 0.21% to $3.38\n\n•   Corn down 0.28% to $3.57/bu\n\n•   Wheat unch at $426.25\n\n•   Treasuries 2yr yields are down ~0.9bps at 1.165%, 10yr yields are down ~1.6bps at 2.347%\nand 30yr yields are down ~1.1bps at 2.949%\n\n•   Japan 10yr yields 0.039%, up ~0.9bps on the day\n\n•   France 10yr yields 0.776%, up ~0.5bps on the day\n\n•   Italy 10yr yields 1.898%, up ~0.8bps on the day\n\n\n•   Spain 10yr yields 1.405%, up ~0.7bps on the day\n\n•   Germany 10yr yields 0.309%, up ~0.2bps on the day\n\n\n#Trading Update\n\n•   Market update – once again, there isn’t much to talk about overnight. China’s trade\nnumbers were the big macro headline but those figures are hardly changing the broader\nmacro narrative (exports fell slightly short while imports were inline). Otherwise the wires\nwere largely void of major headlines. Asia was mixed, Eurozone stocks are rallying nicely\n(although are on track to end the week lower), and US futures are up a few points.\n\n•   Calendar - for Friday investors will be watching US Dec PPI/retail sales (8:30amET), US\nMichigan confidence for Jan (10amET), one Fed speaker (Harker), and earnings (BAC, BLK,\nFHN, FRC, JPM, PNC, and WFC pre-open).\n\n•   Eurozone stocks – the main Eurozone indices are seeing solid gains (up ~60-70bp). Most\nmajor sub-groups are trading higher but tech, fin services, banks, media, and healthcare are\noutperforming. Fiat Chrysler is rebounding as investors view its emissions scandal as less\nsevere than the one that hit VW although Renault is weak as Paris prosecutors open a probe\ninto its emissions. Technicolor is the weakest stock in the SXXP after cutting its outlook.\n \n\n•   FX – the DXY is in the red again so far Fri morning (the DXY is tracking for a ~1% dip this\nweek). The USD is weak vs. the GBP and EUR and is flattish against the JPY. Investors are\nlooking forward to the Brexit speech on Tues from PM May.\n\n•   Asia – the major Asian bourses were mixed: Japan (TPX +0.62%, NKY +0.8%), HK (Hang Seng\n+0.47%, HSCEI +0.66%), mainland China (SHCOMP -0.21%, Shenzhen -1.55%), Korea (KOSPI -\n0.5%), Australia (ASX 200 -0.79%), and India (flattish for the major indices). China’s trade\nnumbers were the big headline out of Asia (exports were a touch light while imports were\ninline). The Bank of Korea decision was largely consistent w/expectations. In India, INFY\nand TCS are both trading lower despite OK earnings from both. Taiwan didn’t trade very\nbadly despite the underwhelming TSMC guidance.\n\n•   Japan – it was an extremely quiet and relatively uneventful trading session. Focus has\nbegun to turn to earnings with Retail +2.3% bouncing from recent weakness following Fast\nRetailing +1.1% and Seven&i +8.6% earnings beat. Downside was led by Nintendo -5.8%,\ntrading close to 10% of total TPX turnover, as its 'Switch' presentation failed to impress -\nespecially with their $299.99 pricing (street was modeling more around $250~$275).\nOtherwise, dispersion across sectors was low and larger moves were driven more by microheadlines:\nTakata traded at limit high (+16.47%) after headlines saying the co and the US\nJustice Department may announce a settlement as soon as Fri over air bags, SMM -4.7% got\nhit after Nickel's weakness overnight, while Screen -4.0% traded lower on TSMC's weakerthan-\nexpected guidance for 1H '17.\n\n•   Hong Kong - sector wise Coal outperformed +3.75% together with Chinese OEMs +2.8%\nwhile Chinese Railways were down 0.4%. In the Chinese property sector, Vanke was well bid\n+5.7% after China Resources Holdings has agreed to sell 15.3% of total shs out to Shenzhen\nMetro Group at 37.2b yuan. In the Auto sector, Great Wall Motor spiked 2.7% after\nannouncing a positive profit alert; the rest of the sector traded higher. Despite a pullback of\nthe commodity complex, Steel +3% and Coal pushed higher driven mainly by further NDRCdriven\nexpectations of SOE reform/consolidation, China Shenhua +4.1% Angang Steel\n+2.5%. The bounce in oil prices triggered a rally in Energy names, Sinopec putting on a\n+3.57%, Petrochina +2.6%.\n\n\n•   South Korea – the KOSPI ended off 0.5%. Samsung Electronics slumped ~3.45% following\ntech weakness in the US on Thurs (note that Samsung did a lot worse than TSMC). Hynix\nfinished down ~0.59% (JPMorgan has a Hynix note this morning and recommends booking\nprofits instead of chasing the rally).\n\n•   Taiwan – the TAIEX ended off 0.33%. TSMC fell 1.63% after its downbeat guidance\n(although the local TSM did a lot better than the US ADR on Thurs which fell ~3%). The rest\nof tech didn’t trade too badly despite TSM (MediaTek -0.92%, Hon Hai -0.12%, etc). On the\nupside, outperformers included Advantech +1.5%, Quanta +0.79%, Pegatron +0.96%,\nInnolux +1.17%, and AUO +1.16%.\n\n•   US equity macro update - the multi-month rally has been underpinned by two main\ndevelopments: 1) improved nominal growth (which predated the election by a few months\nand is largely politically agnostic for the near-term) and 2) GOD EMPEROR Trump enthusiasm. One of these\nfactors remains in place (growth) while the other is increasingly dubious (the political\noptimism – see below). However, the market isn’t anticipating instant action out of\nWashington and in fact the ’17 numbers (~$127-128) don’t really require any political/policy\nchanges (the problem is more w/the 2018 numbers where the tentative ~$145 EPS forecast\nneeds some assistance from Washington). Therefore investors may give the benefit of the\ndoubt to GOD EMPEROR Trump and Congressional Republicans until at least the end of the summer. This\nfaith though is finite and will likely wind up being disappointed as investors appreciate the\ninsurmountable complexity and tradeoffs of tax reform and realize that no government,\nRepublican or Democrat, can provide much added impetus to a full-employment economy\nfacing the twin structural headwinds of tepid labor supply and productivity growth.\n \n\n#Top Headlines for Friday\n\n•   China Dec trade numbers; slight export miss and inline imports – exports came in -6.1% (vs.\nthe St -4% and JPM -3.3%) while imports rose 3.1% (vs. the St +3% and JPM +3.4%).\nTakeaways from JPMorgan’s Grace Ng - While December export growth, in over-year-ago\nUS$ terms, came in below expectations, in sequential terms, exports still rose 1.9%m/m sa,\nadding to the notable gain at 3.3% m/m sa in November. Besides, imports came in line with\nexpectations, up 2.1% m/m sa in December, following the surge at 7.8% m/m sa in\nNovember. Commodity imports came in rather mixed in December, although that followed\nthe notable broad-based gain in November. Looking ahead, the expected modest\nimprovement in global growth going into 2017, along with CNY’s trade-weighted adjustment\nover the past year, would likely be moderately supportive for China’s external trade,\nalthough uncertainty regarding potential US-China trade tensions poses notable risks.\nhttp://bit.ly/2imQ8xz\n\n•   China vs. US – a Chinese newspaper, the Global Times, said blocking Chinese access to its\nislands in the South China Sea, an idea endorsed by Rex Tillerson during his confirmation\nhearing, would require the US to “wage war”; \"Tillerson had better bone up on nuclear\npower strategies if he wants to force a big nuclear power to withdraw from its own\nterritories” – Reuters http://reut.rs/2jDzLgS\n\n•   China currency bears remain despite recent CNY strengthening – Reuters notes that the\nPBOC may have tempered near-term cautiousness and given pause to short-term traders\nbut sentiment around the yuan is still very gloomy. http://reut.rs/2iri3zz\n\n•   OPEC unlikely to deliver fully on cut pledge – Reuters notes that some cheating is inevitable\nand OPEC apparently would be happy if compliance stays within a 50-80% band; OPEC\nsources say compliance “is never 100%” and the cartel would be content so long as the\noverall rate is north of 50% – Reuters http://reut.rs/2j7gPs0\n\n•   Yellen spoke Thurs night although her remarks weren’t very incremental; Yellen said the\nUS economy doesn’t face any serious short-term obstacles. “Unemployment has now\nreached a low level, the labor market is generally strong and wage growth is beginning to\npick up,” Yellen said Thursday in a meeting with educators. “Inflation has moved up from a\nvery low level, and it’s a little bit under our 2 percent objective, but it’s pretty close.”\nBloomberg http://bloom.bg/2in61nE\n\n•   Fed unity – the WSJ notes how Fed officials, including hawks and doves, are expressing\nremarkable unanimity in their policy outlooks. A slew of Fed officials spoke over the last few\ndays and most think the FOMC will hike rates 2-4 times this year (most appear comfortable\nw/the current three hike outlook expressed by the median 2017 dot). WSJ\nhttp://on.wsj.com/2jeH3Lk\n\n•   Monetary vs. fiscal policy - the Fed continues to clearly warn Congress/GOD EMPEROR Trump that any\nmaterial fiscal stimulus would likely result in a faster withdrawal of accommodation (“Evans\nThurs morning became the latest in a series of Fed policymakers to quietly warn that this\nmay not be the best moment to launch a major fiscal plan or throw too much stimulus into\nthe economy” http://reut.rs/2j4IZUl).\n\n•   US fiscal outlook weakens – the US had a deficit of $580B/3.1% of GDP in C16, up from 2.6%\nin C15. The 2016 figure follows 6 years of shrinking deficits and the numbers are set to\nworsen in the years ahead. WSJ http://on.wsj.com/2jcMomt\n\n•   Tax reform/border taxes - Rep. Devin Nunes (R-Calif.) on Thursday defended the House\nGOP border tax proposal and called it \"a little offensive\" that some U.S. companies are\ncriticizing it. \"This is not controversial, and quite frankly, it's a little offensive that some of\nthe major American companies that are importers who do business worldwide are even\nraising concerns of this plan, because I don't see them going to Germany or Mexico or China\nto raise these concerns” – The Hill http://bit.ly/2jLoQ9a\n \n\n•   Border taxes - Larry Kudlow speaking on CNBC (at ~1:15pmET Thurs afternoon) is\nvehemently against the idea of border taxes and worries that this issue could doom the\nentire tax reform effort given how controversial it is. Kudlow at one point was being\nconsidered for an economic job in the GOD EMPEROR Trump team (it isn’t clear where that consideration\nstands now). GOD EMPEROR Trump hasn’t explicitly addressed the Ryan border tax blueprint.\n\n•   Paul Ryan conducted a town hall on CNN Thurs night although there weren’t many\nmaterially incremental headlines out of the event. Ryan reiterated a desire to pass ACA\nreplace legislation at the same as the repeal bills are approved. Ryan said Republicans are\nmoving \"as quickly as they can\" to repeal and replace the Affordable Care Act, but said he\ndoesn't yet have a date, and it will take \"a little bit of time\" to do so (CNN\nhttp://cnn.it/2in0HR5).\n\n•   Healthcare - the NYT details how GOD EMPEROR Trump’s healthcare promises will be difficult to achieve\n(http://nyti.ms/2jLkQFK) while the WSJ discusses the bipartisan healthcare problem: “the\nsick are expensive and someone has to pay” (http://on.wsj.com/2j7eIUU). The head of the\nconservative House Freedom Caucus predicted Thursday that the GOP's ObamaCare\nreplacement plan is “likely to fail” in the Senate (The Hill http://bit.ly/2jqElzM).\n\n•   GOD EMPEROR Trump’s team calls on Republicans to make childcare more affordable – GOD EMPEROR Trump aids are\ninstructing Congressional Republicans to incorporate measures into upcoming tax reform\nlegislation to make childcare more affordable. Proposals would allow parents to deduct\ncertain child care costs. Politico http://politi.co/2irsanV\n\n•   Don’t Let the Dollar Inhibit Growth. A soaring currency could slow exports, fueling populist\nanger. Time for another Plaza Accord? WSJ editorial. http://on.wsj.com/2iOJGjY\n\n•   Int’l company-specific news update from Fri morning. The Infosys (out Thurs night US/preopen\nIndia) and Tata Consultancy (out after the India close Thurs) earnings were decent but\nboth stocks are getting hit in India trading Fri morning. In Europe Fiat Chrysler is\nrebounding as investors view its emissions scandal as less severe than the one that hit VW\nalthough Renault is weak as Paris prosecutors open a probe into its emissions. Technicolor\nis the weakest stock in the SXXP after cutting its outlook.\n\n•   US company-specific news update from Thurs night. It was another pretty uneventful\nevening. DOV provided F17 guidance – the top line was fine but the EPS guide was a bit\nbelow the St. Pandora (P) published an upside preannouncement for CQ4 (the co also\nannounced restructuring actions). Finally, RYI said that it anticipates seasonally lower\nrevenue for the fourth quarter of 2016 compared to the third quarter of 2016 due to fewer\nshipping days.\n\n#Calendar of events to watch for the week of Mon Jan 16\n\n•   Bottom Line – the big focus during the week of 1/16 will be on earnings, US eco data (US CPI\nfor Dec Wed morning 1/18), the ECB decision (Thurs 1/19 – this should be a non-event),\nChina eco data (Dec IP/retail sales and Q4 GDP all out Thurs night/Fri morning), and two\nYellen speeches (she will take part in a discussion Wed 1/18 at 3pmET and speaks at\nStanford Thurs 1/19 at 8pmET). Also GOD EMPEROR Trump’s inauguration is Friday. Keep in mind Mon\n1/16 is a holiday in the US (MLK Day).\n\n•   Mon 1/16 – US markets are closed for MLK Day. BHP is scheduled to give its Q4 production\nupdate Mon night.\n\n•   Tues 1/17 – this day should be pretty quiet w/no major eco numbers and only a few\nearnings (CMA, MS, and UNH pre-open and ADTN and CSX after the close). In addition, two\nFed officials will be speaking (Dudley, Williams), Chinese President Xi gives a keynote at the\nDavos conf., and UK PM May is expected to give a “major” speech on Brexit.\n\n•   Wed 1/18 – the big focus on Wed will be the US CPI for Dec at 8:30amET w/investors\nwatching inflation numbers closely. Also Yellen will participate in a discussion (3pmET) and\n \na bunch of earnings are due (AMTD, ASML, Burberry, C, FAST, GS, NTRS, SCHW, and USB\npre-open and NFLX, PLXS, PTC, and SLM after the close).\n\n•   Thurs 1/19 – the ECB decision (7:45amET statement, 8:30amET press conf.) should be a\nnon-event. The other events include Yellen’s speech at Stanford (8pmET) and earnings\n(BBT, BK, CHKP, KEY, PPG, UNP, and WBS pre-open and AXP, IBM, and SWKS after the\nclose).\n\n•   Fri 1/20 – this day will be dominated by China’s eco data (Dec IP/retail sales and Q4 GDP\nout Thurs night/Fri morning), earnings (CFG, COL, GE, KSU, RF, SLB, STI, and SYF pre-open),\nand two Fed speakers (Harker and Williams). GOD EMPEROR Trump’s inauguration (he becomes president\nat 12pmET) shouldn’t be all that important (although many are fearful of investors booking\nprofits on the “GOD EMPEROR Trump Trade” following this event).\n\n#Catalysts for 2017 – big events to watch for 2017 (preliminary list – additional events likely to be\nadded)\n\n•   US bank earnings season kicks off Fri 1/13 (BAC, BLK, FHN, FRC, JPM, PNC, and WFC all\nreport Fri morning).\n\n•   Earnings - week of Mon 1/16 is the first big one of the CQ4 earnings season.\n\n•   World Economic Forum 1/17-20 in Davos.\n\n•   ECB – first ECB decision of the year will occur on Jan 19.\n\n•   China eco data - Dec IP/retail sales/FAI and Q4 GDP – Fri morning 1/20.\n\n•   ***GOD EMPEROR Trump inauguration Fri 1/20.***\n\n•   Oil – OPEC and non-OPEC committee Jan 21-22 Vienna meeting (this will be the first\nmeeting to evaluate whether all the parties are adhering to the recent production\nagreement).\n\n•   Italy – Italian Constitutional Court to hold hearing on legitimacy of Italian electoral law on\nJan 24.\n\n•   Japan – there is speculation Abe could call elections in the Jan timeframe.\n\n•   US banks – the Fed will prob. publish the ’17 CCAR/stress test criteria around the end of Jan\n(the criteria was released Jan 28, 2016 for the last testing cycle).\n\n•   US GDP – the Q4 GDP number will be published Fri 1/27.\n\n•   China New Year holiday. Mainland markets closed Fri 1/27-Thurs 2/2.\n\n•   Fed – first Fed decision of the year will occur on Feb 1.\n\n•   Netherlands will have national elections Mar 15.\n\n•   Fed meeting – first press conf./dot plot decision of the year is Mar 15.\n\n\n•   G20 Fin Min/central bank governors meeting Mar 17-18 in Germany.\n\n•   China’s National People’s Congress (NPC) and Chinese People’s Political Consultative\nConference (CPPCC) usually take place in mid-Mar; the gov’t will formally publish its 2017\neconomic objectives at this event.\n\n•   US debt ceiling - the debt limit has been suspended since late ’15 but is due to be reinstated\non Mar 16, 2017.\n\n•   EU Leaders Summit Mar 25 – this could be the forum at which the UK formally triggers\nArticle 50.\n\n•   WFC’s “living will” – WFC will resubmit its living will in the Mar timeframe. Normally this\nwouldn’t be a major event but if WFC’s living will is deemed inadequate again the Fed could\nraise the company’s capital requirements.\n\n•   France first-round presidential election Apr 23 (run-off is May 7).\n\n•   US Treasury publishes semi-annual currency report around Apr timeframe (investors will\nwatch China’s designation closely and if it gets labeled a currency manipulator).\n\n•   US gov’t funding – current spending legislation will keep the gov’t funding until Apr 28\n\n•   NATO – Montenegro is expected to become a NATO member in the spring of 2017.\n \n•   G7 Leaders Summit May 26-27 in Italy.\n\n•   Italy – new elections are likely in the June timeframe.\n\n•   Russia – European sanctions against Russia are due to expire in June. Given the likely\noutcome of the French election, they will prob. not be extended\n(http://on.wsj.com/2iHEYUB).\n\n•   China/MSCI - MSCI will announce the result of the China A shares inclusion proposal as part\nof the 2017 Market Classification Review in June 2017.\n\n•   G20 Leaders Summit Jul 7-8 2017 in Germany.\n\n•   German elections – the next German elections will be held between Aug and Oct 2017.\n\n•   Chinese politics – China’s 19th National Congress will take place in the fall of 2017 and will\nset the country’s political path for the next five years.\n\n#Full catalyst list\n\n\n•   Fri Jan 13 – China imports/exports for Dec (Thurs night/Fri morning)\n\n•   Fri Jan 13 – US PPI for Dec. 8:30amET.\n•   Fri Jan 13 – US retail sales for Dec. 8:30amET.\n\n•   Fri Jan 13 – Michigan Confidence numbers for Jan. 10amET.\n\n•   Fri Jan 13 – Fed speakers: Harker\n\n\n•   Fri Jan 13 – earnings before the open: BAC, BLK, FHN, FRC, INFY, JPM, PNC, WFC\n•   Fri Jan 13 - JPMorgan Healthcare Conf. Jan 9-13. San Francisco.\n\n\n***************************************\n•   Mon Jan 16 – earnings out Mon night: Rio Tinto\n\n•   Mon Jan 16 – ECB’s Praet speaks\n\n\n•   Mon Jan 16 – BOE’s Carney speaks\n\n•   Mon Jan 16 – US markets closed for Martin Luther King, Jr. Day\n\n***************************************\n\n•   Tues Jan 17 – Fed speakers: Dudley, Williams\n\n•   Tues Jan 17 – European trading updates: Alstom, Casino, Provident Financial, Renault\n\n•   Tues Jan 17 – WTR earnings guidance conf. call.\n\n•   Tues Jan 17 – earnings before the open: CMA, EDU, INFO, MS, SNV, UNH\n\n•   Tues Jan 17 – earnings after the close: ADTN, CSX\n\n***************************************\n\n•   Wed Jan 18 – US CPI for Dec. 8:30amET.\n\n•   Wed Jan 18 – US IP for Dec. 9:15amET.\n\n•   Wed Jan 18 – Bank of Canada rate decision\n\n•   Wed Jan 18 – Fed speakers: Kashkari, Yellen\n\n•   Wed Jan 18 – analyst meetings: ASNA\n\n•   Wed Jan 18 – European trading updates: Burberry, Experian\n\n•   Wed Jan 18 – earnings before the open: AMTD, ASML, C, FAST, GS, NTRS, SCHW, USB\n\n•   Wed Jan 18 – earnings after the close: CLC, NFLX, PLXS, PTC, SLM\n\n***************************************\n\n•   Thurs Jan 19 – ECB decision. 7:45amET statement, 8:30amET press conf.\n\n•   Thurs Jan 19 – US housing starts and building permits for Dec. 8:30amET.\n\n•   Thurs Jan 19 – Fed speakers: Yellen\n\n•   Thurs Jan 19 – analyst meetings: PAY\n\n•   Thurs Jan 19 – European trading updates: Ahold, British Land, Carrefour, Remy Cointreau\n\n•   Thurs Jan 19 – earnings before the open: BBT, BK, CBSH, CHKP, JBHT, KCG, KEY, MTG, PPG,\n\nUNP, WBS\n\n•   Thurs Jan 19 – earnings after the close: ASB, AXP, IBM, PBCT, SWKS\n\n***************************************\n\n•   Fri Jan 20 – China Dec IP/retail sales/FAI and Q4 GDP (Thurs night/Fri morning)\n\n•   Fri Jan 20 – ECB survey of professional forecasters. 4amET.\n\n•   ***Fri Jan 20 –  GOD EMPEROR Trump’s inauguration***\n\n•   Fri Jan 20 – Fed speakers: Harker, Williams\n\n•   Fri Jan 20 – earnings before the open: CFG, COL, GE, KSU, RF, SLB, STI, SYF\n\n***************************************\n\n•   Mon Jan 23 – earnings before the open: BOH, HAL, MCD\n\n\n•   Mon Jan 23 – earnings after the close: ATI, BRO, SIMO, ZION\n\n***************************************\n•   Tues Jan 24 – US flash manufacturing PMI for Jan. 9:45amET.\n\n•   Tues Jan 24 – US existing home sales for Dec. 10amET.\n\n\n•   Tues Jan 24 – European trading updates: BHP, Dixons Carphone\n\n•   Tues Jan 24 – earnings before the open: AKS, BABA, DD, DHI, FITB, GLW, JNJ, JNS, KMB, LMT,\nMMM, Philips, PLD, PII, SAP, TRV, VZ\n\n•   Tues Jan 24 – earnings after the close: AA, CA, CNI, COF, CREE, DFS, ISRG, LG Display, NAVI,\n\nSamsung Electronics, STLD, STX, SYK, TSS, TXN\n\n***************************************\n\n •   Wed Jan 25 – BP 2017 energy outlook\n•   Wed Jan 25 – analyst meetings: KMI\n\n\n•   Wed Jan 25 – European trading updates: Antofagasta, Fresnillo, Tod’s, WH Smith\n\n•   Wed Jan 25 – earnings before the open: ABT, APH, BA, CVLT, EAT, FCX, GWW, HBAN, ITW,\n\nLOGI, PG, PGR, Novartis, NYCB, PGR, Santander, SC, STT, TXT, UTX, VLY\n\n•   Wed Jan 25 – earnings after the close: BXS, CCI, CLB, DRE, EBAY, FFIV, KNX, LRCX, MCK,\n\nNOW, QCOM, T, TCBI, UNPQ, VAR, VRTX, WDC, XLNX\n\n***************************************\n\n•   Thurs Jan 26 – China Dec industrial profits (Wed night/Thurs morning)\n•   Thurs Jan 26 – US wholesale inventories for Dec. 8:30amET.\n\n•   Thurs Jan 26 – US advanced goods trade balance for Dec. 8:30amET.\n\n•   Thurs Jan 26 – US flash services PMI for Jan. 9:45amET.\n\n•   Thurs Jan 26 – US new home sales for Dec. 10amET.\n\n•   Thurs Jan 26 – European trading updates: Anglo American, Diageo, JCDecaux, LVMH, Sage\n\nGroup\n\n•   Thurs Jan 26 – earnings before the open: ADS, BHI, BIIB, BMS, BMY, BX, CAT, CELG, CMCSA,\n\nDGX, DOW, F, LEA, LUV, MJN, OSK, PHM, PX, RCI, RTN, SHW, Sky, STM, SWK, TROW, Unilever\n\n•   Thurs Jan 26 – earnings after the close: AJG, BCR, FLEX, GOOG, INTC, JNPR, KLAC, MSFT,\n\nMXIM, PFPT, SBUX, VMW\n\n***************************************\n\n•   Fri Jan 27 – China New Year holiday. Mainland markets closed Fri 1/27-Thurs 2/2.\n\n•   Fri Jan 27 – US Q4 GDP. 8:30amET.\n\n•   Fri Jan 27 – US durable goods for Dec. 8:30amET.\n\n•   Fri Jan 27 – US Michigan Confidence for Jan. 10amET.\n\n•   Fri Jan 27 – earnings before the open: APD, BT, CL, CVX, HON, UBS\n\n***************************************\n\n•   Mon Jan 30 – US personal income/spending for Dec. 8:30amET.\n\n•   Mon Jan 30 – US PCE for Dec. 8:30amET.\n\n•   Mon Jan 30 – US pending home sales for Dec. 10amET.\n\n•   Mon Jan 30 – earnings before the open: BAH, EPD\n\n•   Mon Jan 30 – earnings after the close: CR, GGG, IDTI, IEX, LEG, PFG, RGA\n\n***************************************\n\n•   Tues Jan 31 – BOJ policy decision (Mon night/Tues morning)\n\n•   Tues Jan 31 – US employment cost index (ECI) for Q4. 8:30amET.\n\n•   Tues Jan 31 – US CoreLogic home prices for Nov. 9amET.\n\n•   Tues Jan 31 – Chicago PMI for Jan. 9:45amET.\n\n•   Tues Jan 31 – US consumer confidence for Jan. 10amET.\n\n•   Tues Jan 31 – earnings before the open: ABC, ALLY, COH, HOG, LLY, MA, NDAQ, NUE, PFE,\n\nSMG, SPG, TMO, UA, UPS, VLO, WDR, XOM, XRX, ZBH\n\n•   Tues Jan 31 – earnings after the close: AAPL, APC, BDN, CB, CHRW, EQR, MANH, PLT, X\n\n***************************************\n\n•   Wed Feb 1 – China NBS manufacturing/non-manufacturing PMIs (Tues night/Wed morning)\n\n•   Wed Feb 1 – US ADP employment report for Jan. 8:15amET.\n\n•   Wed Feb 1 – Markit manufacturing PMI for Jan. 9:45amET.\n\n•   Wed Feb 1 – US manufacturing ISM for Jan. 10amET.\n\n•   Wed Feb 1 – US construction spending for Dec. 10amET.\n\n•   Wed Feb 1 – US auto sales for Jan.\n\n•   Wed Feb 1 – FOMC decision. 2pmET.\n\n•   Wed Feb 1 – earnings before the open: ADP, ANTM, MO, MTH, Roche, Siemens\n \n•   Wed Feb 1 – earnings after the close: ALL, CBL, CDNS, CRUS, DOX, LNC, LSTR, MAA, MET,\nTSCO\n\n\n***************************************\n\n•   Thurs Feb 2 – ECB economic bulletin. 4amET.\n\n•   Thurs Feb 2 – BOE policy decision. 7amET.\n\n•   Thurs Feb 2 – US non-farm productivity and unit labor costs for Q4. 8:30amET.\n\n•   Thurs Feb 2 – European trading updates: Aberdeen Asset Mgmt., CME, Daimler, Deutsche\nBank, EL, IP, MMC, MRK, Nokia, PH, R, Vodafone, WFT, XYL\n\n•   Thurs Feb 2 – earnings after the close: AIV, CCK, CMG, DATA, FEYE, GGP, GPRO, HIG, KIM, VR\n\n***************************************\n\n•   Fri Feb 3 – China mainland markets re-open after being shut for the New Year holiday\n\n•   Fri Feb 3 – China Caixin manufacturing PMI (Thurs night/Fri morning)\n\n•   Fri Feb 3 – US jobs report for Jan. 8:30amET.\n\n•   Fri Feb 3 – US Markit services PMI for Jan. 9:45amET.\n\n•   Fri Feb 3 – US non-manufacturing ISM for Jan. 10amET.\n\n•   Fri Feb 3 – US factory orders for Dec. 10amET.\n\n•   Fri Feb 3 – US durable goods for Dec. 10amET.\n\n•   Fri Feb 3 – earnings before the open: APO, ATHN, CLX, HSY, PSX, WY\n\n***************************************\n\n•   Mon Feb 6 – earnings before the open: AINV, CBOE, HAS\n\n•   Mon Feb 6 – earnings after the close: MAC\n\n***************************************\n\n\n•   Tues Feb 7 – China Caixin services PMI (Mon night/Tues morning).\n\n•   Tues Feb 7 – US trade balance for Dec. 8:30amET.\n\n•   Tues Feb 7 – US JOLTs report for Dec. 10amET.\n\n•   Tues Feb 7 – US consumer credit for Dec. 3pmET.\n\n***************************************\n\n•   Wed Feb 8 – ECB’s Draghi speaks in Dutch parliament\n\n\n•   Wed Feb 8 – earnings after the close: PRU\n\n***************************************\n\n•   Thurs Feb 9 – US wholesale inventories/trade sales for Dec. 10amET.\n\n***************************************\n\n•   Fri Feb 10 – US import price index for Jan. 8:30amET.\n\n•   Fri Feb 10 – US Michigan Confidence for Feb. 10amET.\n\n***************************************\n\n•   Tues Feb 14 – US PPI for Jan. 8:30amET.\n\n***************************************\n•   Wed Feb 15 – US Empire Manufacturing for Feb. 8:30amET.\n\n•   Wed Feb 15 – US CPI for Jan. 8:30amET.\n\n•   Wed Feb 15 – US retail sales for Jan. 8:30amET.\n\n•   Wed Feb 15 – US industrial production for Jan. 9:15amET.\n\n•   Wed Feb 15 – US NAHB housing market index for Feb. 10amET.\n\n***************************************\n\n•   Thurs Feb 16 – ECB meeting minutes\n\n•   Thurs Feb 16 – US housing starts/building permits for Jan. 8:30amET.\n\n\n•   Thurs Feb 16 – US Philadelphia Fed for Feb. 8:30amET.\n\n***************************************\n\n•   Tues Feb 21 – US flash manufacturing PMI for Feb. 9:45amET.\n\n***************************************\n\n•   Wed Feb 22 – US existing home sales for Jan. 10amET.\n \n•   Wed Feb 22 – FOMC minutes from 2/1 meeting. 2pmET.\n\n***************************************\n\n•   Thurs Feb 23 – US home price purchase index for Q4. 9amET.\n\n•   Thurs Feb 23 – US flash services PMI for Feb. 9:45amET.\n\n***************************************\n\n•   Fri Feb 24 – US new home sales for Jan. 10amET.\n\n•   Fri Feb 24 – US Michigan sentiment for Feb. 10amET.\n\n\n\n", "id": "5nr44f", "created_utc": 1484320289.0, "score": 63, "upvote_ratio": 0.91, "num_comments": 11, "comments": [{"body": "Temporary sticky for visibility, will put back bug boy in a few hours. ", "score": 1, "replies": [{"body": "can't believe bug boy didn't make the full catalyst list", "score": 1, "replies": []}]}, {"body": "These fuckers better be right about gold, put my college savings into JNUG :')", "score": 5, "replies": [{"body": "Other than them stating that gold was up, which was simply a fact at the time, I didn't see them say anything about gold. I read through 2x, but maybe I'm an idiot. Can you point out where they talked about gold in detail? Thanks!", "score": 2, "replies": [{"body": "Wed. is Dec. CPI report. Inflation or deflation will move gold. ", "score": 2, "replies": []}, {"body": "Do you see why now? :') ", "score": 1, "replies": []}]}]}, {"body": "Therefore investors may give the benefit of the doubt to GOD EMPEROR Trump and Congressional Republicans until at least the end of the summer. This faith though is finite and will likely wind up being disappointed as investors appreciate the insurmountable complexity and tradeoffs of tax reform and realize that no government, Republican or Democrat, can provide much added impetus to a full-employment economy facing the twin structural headwinds of tepid labor supply and productivity growth.\n\nA few more months of making money baby!", "score": 2, "replies": []}, {"body": "\"the Fed continues to clearly warn Congress/GOD EMPEROR Trump\"\n\nDo you have a chrome extension or is this how J.P. refers to him?", "score": 2, "replies": [{"body": "That's we all refer to him ", "score": 4, "replies": []}, {"body": "Control f replace clumsy_mitten_hands with another_fucking_idiot ", "score": 0, "replies": [{"body": "Great detective work cuck", "score": 3, "replies": []}]}]}]}
{"title": "Why you don't bank on OTM weeklies...", "selftext": "Read many books before getting into options. They always said don't be tempted to buy cheap OTM weeklies as they'll expire worthless. I followed this advice, making modest gains on options. \n\nThen I stumbled on this sub. People posted the sick gains from OTM weeklies, especially around earnings. I did the math on my previous earnings plays, I could have made WAAAAY more money. \n\nSo this time I did just that with $BAC and $JPM. Currently have strikes at $24 and $24.5 that expire today and $90 for JPM. Let's just say now I see why you don't buy so far out. $BAC is up, but low chance it'll be up enough to ever hit my strike price. I've essentially lost money on two winning stocks. This is when you all  tell me \"congrats faggot\". ", "id": "5nr6ev", "created_utc": 1484320969.0, "score": 9, "upvote_ratio": 0.77, "num_comments": 14, "comments": [{"body": "There is definitely a confirmation bias with weekly successes here.  Nobody posts about the time they lost $15/contract on some dumb weekly gamble, but everybody posts when they hit a 10-bagger.", "score": 12, "replies": [{"body": "stop making sense", "score": 5, "replies": []}, {"body": "without a doubt, and the logical part of me knew this, but the 22 year old who wants to make it doesn't. Thanks for reiterating. ", "score": 2, "replies": []}]}, {"body": "Congrats faggot. I made 130% on the WFC calls I bought yesterday.", "score": 8, "replies": []}, {"body": "Faggots delight", "score": 7, "replies": []}, {"body": "It's called gambling. ", "score": 6, "replies": []}, {"body": "Atm masterrace", "score": 5, "replies": []}, {"body": "Banks rarely move up or down 5% on ER. A tech company sure, but BAC or JPM are HUGE stocks with very predictable results. ", "score": 4, "replies": [{"body": "Learned this the hard way. Weeklies only on tech from now on. ", "score": 2, "replies": [{"body": "If you ever feel bad, just remember one time I bought 3k worth of VXX calls in 2010, and the market went straight up that week and I lost it all!", "score": 1, "replies": [{"body": "I've heard the VXX and VIX losses story more times than I can remember. Sorry to hear of the 3k down. I guess we just brush it off, learn from our mistakes, and keep YOLOing. ", "score": 2, "replies": []}, {"body": "Calls? Bro that's not how you play vix ETFs ", "score": 2, "replies": []}]}]}]}, {"body": "currently watching my jan 20 XLF 24 calls...it keeps getting to 23.70~ and I would have made a few bucks if I sold...but I didn't buy them to make a few bucks. gonna see how the day goes, and might hold into next week.", "score": 1, "replies": []}, {"body": "congrats faggot next time put it on black", "score": 1, "replies": []}]}
{"title": "held $TSLA $FB overnight for 250% each...happy trading people", "selftext": "", "id": "5nrais", "created_utc": 1484322198.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 11, "comments": [{"body": "Post again with actual dollars invested, gained and the exit.  ", "score": 16, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Lol cost basis is right there. Why does my actual investment matter if percentages are up? No one ever gives me props on here they just bash me lol", "score": -7, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Just gonna keep posting winners for u", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "lol. you want some of these numbers? glad to help m8 pm me", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "fuckin a if i had that kinda bread I'd make a couple trades and retire lmao", "score": 1, "replies": []}]}]}]}]}]}, {"body": "ban /u/sinkaputt ", "score": 3, "replies": [{"body": "Your vote has been added to the count.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}]}]}, {"body": "Good percentages m8. I keep tugging on my balls for not pulling the TSLA trigger", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Success in almost any field depends more on energy and drive than it does on intelligence. This explains why we have so many stupid leaders. - Albert Einstein\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
{"title": "What's the best way to go long volatility?", "selftext": "VIX is right down at multi-year lows and IV is also low. I want to go long volatility, expecting it to rise to some degree in the next 1-2 months, what are people's thoughts on the best trade to make for this?\n\nIf I buy VIX calls, then I'm only getting exposure to the future of the expiry month and if I buy VXX calls I'll get destroyed on time decay. \n\nLink below shows 3 year VIX and 1 year IV.\n\n\nhttp://imgur.com/a/3cBPT", "id": "5nrksy", "created_utc": 1484325016.0, "score": 2, "upvote_ratio": 0.63, "num_comments": 11, "comments": [{"body": "Buy SPY PUTS if you have a small account and go long /VX if you have a bigger account. Do not buy VXX, do no go long gold by proxy, do not buy VIX calls. VIX is calculated by SPY PUT buying. Gold is not very well correlated to market drops anymore. Trade either SPY or /VX.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Only autistics think retardation is funny.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "I know, that's my point on the VIX calls - you're not getting exposure to the spot VIX which is what a lot of people think you get.", "score": 2, "replies": [{"body": "Buy king dated straddle on SPY. \n \nEdit:: Long dated ", "score": 1, "replies": [{"body": "What's king dated?", "score": 2, "replies": []}]}]}]}, {"body": "Just a thought - short SVXY or XIV. They're only 1x ETF and since VIX is essentially at a floor it can only rise by a certain amount per day. (The approximate rate of contango in the VIX futures right now). If the spike takes a month or two to develop, yes you could still be down 20-30% in that amount of time. But if it doesn't, just hold until you can cover on your drop. The advantage is that because they are short funds, it takes them longer to gain back what they lost. (For example, XIV and SVXY would need a 33% drop in VIX futures to recover from a 25% rise). Further, I've always found that these funds tend to underperform on a rebound in their price. Whether it's because of the funds' costs being short or management fees or whatever else, there is always a drag on their performance.  This is in contrast to the double leveraged long funds like TVIX and UVXY which drop much faster after a spike and always end up lower, so they are a much more dangerous buy and hold during a VIX event.\n\nIt's on my radar right now, but the risk of holding is just not good enough for me yet.", "score": 2, "replies": []}, {"body": "Long Eurodollar futures.  ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Agree. Gold thrives off of insecurity in the market. \n\nWhat's going to be more catastrophic to the public than Trump finally as president and AT LEAST, a month after that. \n\nTrump and his tweets = volatility. \nTrump finally having power on the hot seat = chaos.\n\n+Gold. Everyone in the world will be buying not just the people here in US.\n\nI already bought my bullions. -_-", "score": 3, "replies": [{"body": "Lel. Explain the Trump rally if markets think there will be uncertainty. It's the opposite. Markets are highly optimistic.", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "If you want to go long and hard, all in on TVIX. ", "score": 1, "replies": [{"body": "Same problem as VXX, it's designed to decrease in value so I'm fucked if VIX doesn't pop in time.", "score": 5, "replies": []}]}]}
{"title": "AMD calls?", "selftext": "[deleted]", "id": "5ns26g", "created_utc": 1484329624.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 7, "comments": [{"body": "Post  in one of the 39385 other posts about AMD.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}, {"body": "I was in for the Jan 20th calls assuming earnings were the 17th. Then I got fucked.", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I bought 15 contracts @ .22\n\nThen yesterday in the morning I got called out on another thread and bought another 10 @ .08 \n\nThen they came out and said earnings are on the 31st.\n\nThen this morning  I sold for .02\n\nTrue WSB fashion. ", "score": 1, "replies": []}]}]}, {"body": "Why not go long?\n\nAMD @20 CALL JAN 2019  at $1.55 looks good to me.", "score": 3, "replies": []}, {"body": "No gamble no future", "score": 1, "replies": []}, {"body": "Amd estimated 10% down quarter whether thats priced in or not, it seems like it could be a gamble really betting on the intel deal being true", "score": -1, "replies": []}]}
{"title": "Your yacht is about to be made from aluminum foam.", "selftext": "TL;DR innovative materials manufacturing company that's been fighting to stay afloat is about to collab with huge manufacturing conglomerate.\n\nDD: I'm a mid-level engineer at a tier 1 supplier to large automotive OEMs. One faggot on our management team introduced me to something called Aluminum Foam. This shit is fucking cool. I've heard of metal foams but never really got a chance to hold and play with it. \n\nERG Duocel is the name \nhttp://www.ergaerospace.com/index.html\n\nI got my purchaser to inquire about buying some of this foam, but he said its expensive AF and we are too busy for other R&D. I took it into my own hands because I want to take some home and design something with it, and ended up finding this small Canadian company called Cymat Technologies (http://www.cymat.com/) and got some foam off them. Neat shit. Turns our they're public. Turns out they must have had a dumpster fire because they dropped like a rock since their IPO 15 years ago. In true WSB fashion, not only am I taking a position in this already once de-listed company, but I they're recent Q2 report shows they may turn it around. And they're up 100% since I last checked in August '16.  (https://ca.finance.yahoo.com/quote/CYM.V?p=CYM.V)\n\nWhy is this shit tier company going up? \n\n1) They just signed a huge opportunity according to the Q2 report with spanish aluminum panel maker Alucoil (http://alucoil.com/northamerica/), They make the aluminum panels in buildings, trains, and yes, yachts\n\n2) They've hit a slew of recent military and architectural contracts for their main product line. They will stay around until alucoil deal goes through.\n\n3) They just posted their lowest 6month operating losses since 1997. \n\nhttps://ca.finance.yahoo.com/news/cymat-reports-q2-results-210500394.html\n\nIts a small yolo with bullshit DD, but Im betting there's something brewing for these guys. \n\nMy PT is $.90-$1.00 in 6 months or ban me.\n", "id": "5nse4m", "created_utc": 1484332815.0, "score": 8, "upvote_ratio": 0.69, "num_comments": 16, "comments": [{"body": "How many heroins are you injecting right now?", "score": 8, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Success in almost any field depends more on energy and drive than it does on intelligence. This explains why we have so many stupid leaders. - Albert Einstein\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "Sounds to me he watched a recent LinusTechTip video that mentioned Aluminum Foam and now he's created a DD about it. ", "score": 6, "replies": [{"body": "Stopped watching that sellout, but I will look for the video you are referencing", "score": 3, "replies": []}]}, {"body": "Get the fuck out of here with this penny stock bullshit 6.15M MC", "score": 7, "replies": [{"body": "market cap schmarket schmap", "score": 3, "replies": [{"body": "You got a good point there actually", "score": 3, "replies": []}]}]}, {"body": "To be honest, this stock looks like it will heat up. I just went through their fillings and everything seems okay. Summary of company:\n-They have the sole rights to this product\n-They are in a lot of debt (but they just double rev.)\n-They are getting a lot of nuclear power attention\n\nThe most important thing here is that last point. Ontario Power Generation (OPG) is overhauling ALL their nuclear reactors over the next 10 years. If this company lands a contract with them, which seems likely with the foreign nuclear deals they have earned, they will surely be doubling or tripling both profits and share prices.\n\nAll aboard ", "score": 2, "replies": [{"body": "Not only on the industrial side, but I found they've done some huge architectural projects -  They have an architectural division that lists the following accomplishments: \n\nhttp://www.alusion.com/alusionhome\n\nPrada museum  - ~70,000 sq ft\n9/11 Memorial  ~ 60,000 sq ft\nSome convention center in Mallorca\n\nIt seems these projects which they've successfully completed are growing in size and frequency as architects and contractors get their heads around aluminum foam for\n\n \"a e s t h e t i c\". So someone like Alucoil comes along and buys or licensces their technology for their panels, gets them into more construction environments, could be millions just for using their patented foam making process.\n\nThis shitter stock has been gaining momentum and their books are looking like they're on the turnaround. \n\nYou mentioned ontario nuclear, is it poised to move up in power gen share?", "score": 3, "replies": []}]}, {"body": "I researched this this summer. Is the future. Am aerospace student. [These technologies] Will get us to mars . I don't know any companies but those who do please throw some. I've followed the development of these technologies for four years.\nEdit: I'm not *that* cocky", "score": 2, "replies": []}, {"body": "#I don't want to be rude but..[You have the charisma of a damp rag](https://youtu.be/bypLwI5AQvY) and the appearance of a low-grade bank clerk. And the question that I want to ask, that we're all going to ask, is ***\"Who are you?\"*** I'd never heard of you. Nobody on /r/WSB had ever heard of you. I would like to ask you, u/TheRise9, who upvoted for you, and what mechanism? Oh, I know democracy isn't popular with you lots, and what mechanism the people of /r/WSB have to remove you? Is this /r/WSB democracy?\n\nWell, I sense, though that you are competent and capable and dangerous, and I have no doubt in your intention, to be the quiet assassin of /r/WSB democracy, and of the /r/WSB subreddit-nation-states. You appear to have a loathing for the very concept of the existence of us subreddit-nation-states - perhaps that's because you come from /r/investing, which is pretty much a non-subreddit.   \n\ntl;dr sftu  no body cares and fuck u/dsbtc\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}, {"body": ">Closed-cell metal foam was first reported in 1926\n\n>innovative materials manufacturing company\n\nNot even funny. I could understand this ad if it was some nanotubes or graphene company.", "score": 1, "replies": [{"body": "Fukkin snitch\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "All those promises of what graphene and nanodicks can do, and we hear the same shit about mass manufacturing issues.\n\nIt takes years, even decades of R&D for a new material to be refined into a volume manufacturing environment. And they've been able to hit large order volumes for their target applications. Nuclear, military, architectural, and they keep mentioning automotive discussions.  I would not be surprised if our OEMs decide to core out and fill components with aluminum foam. \n\n\"In the automotive sector, the Company continues to participate in discussions, with an increasing number of participants, concerning the development of SmartMetalTM applications on several fronts including NVH applications, vehicle crash mitigation systems and light-weighting applications.\"\n\nfrom their fiscal '17 q2 filing.", "score": 2, "replies": []}]}]}
