{"title": "[deleted by user]", "selftext": "[removed]", "id": "lmafh1", "created_utc": 1613612118.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 20, "comments": [{"body": "They are June 21, bro. Why you buy heavy forward if you aren’t holding? Bruh, buck tf up. Hold. It’s Apple.", "score": 51, "replies": []}, {"body": "This kids got the illest case of 🧻 hands I’ve ever seen", "score": 20, "replies": [{"body": "This is what I like to call vaporhands", "score": 4, "replies": []}]}, {"body": "June 21 is so far out. Plenty of time to rebound. No need to sell for a loss this early unless you are really bearish on Apple for some reason.", "score": 14, "replies": []}, {"body": "No stay strong", "score": 7, "replies": []}, {"body": "sell some CC against it.  Not sure why it's trading the way it is, but will bounce back.  Could be money has been taken out to fund more speculative trading.", "score": 7, "replies": [{"body": "Rates hitting higher, less Covid cases, positive vaccines 💉 news 🗞 recovery game in motion.,, but I think Apple 🍏 will bounce too, when 🤔 i don’t know...", "score": 3, "replies": [{"body": "Don’t forget the fed has to remove seven trillion from the balance sheet.", "score": 2, "replies": []}]}]}, {"body": "Just hold them. No one knows, but there's a very good chance you'll end up making money on them if you hold them.", "score": 7, "replies": []}, {"body": "You're not losing money due to theta decay.  It was all delta, as AAPL fell from $3-4 per share depending on time of day you bought it 2 days ago, as delta on the AAPL 6/21 135C is 0.48.\n\nIf you're shaken after a  few % drop in the AAPL stock price, then either you don't have the risk capital for this trade, or your conviction behind a long delta play is very low.\n\nOnly you can figure out your loss-limit and risk appetite, but this call option will be about 7 times as volatile as AAPL, if expressed as percentage of the premium.", "score": 6, "replies": []}, {"body": "You can roll down to the $130s for $2.25.  You gain $5 in position.  If you think your $135s are good then the $5 you earn for paying $2.25 should be a sure thing.\n\nIf you don’t agree why are you still holding the $135s.\n\nSorry Guys.", "score": 4, "replies": []}, {"body": "You're not down on theta.. you're down on delta and increased AAPL IV. \n\nYou bought June calls because you wanted time on your side and to avoid theta decay for awhile. \n\nDo yourself a favor.. set a limit GTC order for whatever your profit target is.. then don't look at your position for 2 months.\n\nYou're welcome.", "score": 5, "replies": []}, {"body": "You have 4.5 months. Wait it out", "score": 8, "replies": []}, {"body": "Regardless of what you decide, never sell calls (even sell-to-close) on a red day if you can help it - especially on Apple which is more than likely going to move back up. \n\nIf you sell at a loss now (or even worse, after another down day), will your loss be due to an incorrect premise or in lack of fortitude to stick with your premise? (This is a question that strikes to my heart, because I’ve lost funds from not sticking with the correct initial premise). \n\nOnce it moves back up, ask yourself, “am I ok with this volatility and this type of trading”?   \n\nI hope my questions help. If not, here’s my blunt advice: don’t sell.", "score": 3, "replies": []}, {"body": "Lol. Apples been taking a shit since earnings. It’s literally rock bottom. No where to go but up now. Hold that shit, by June you’ll be looking at some solid gains.", "score": 2, "replies": []}, {"body": "You spend 1k each? Ouch", "score": 2, "replies": []}, {"body": "Apple is going more down toward the 125-128 area, average down then.", "score": 1, "replies": []}, {"body": "Love it. I’m in the same 🚣‍♀️ it’s Apple. They are the corporate representation of a printer. \n\nApple just did 100billion with a 44billion profit. \n\nIndia and China middle classes are breaking out. Theres nothing the middle class loves more than  Apple. \n\nEdit: removed flair, forgot which sub I was in", "score": 0, "replies": []}, {"body": "AAPL just reached 40 years old.  Please hold your Calls position, u will be fine.  I bought the share today.  I am holding it too.", "score": 1, "replies": []}, {"body": "It's Apple dude. Their stock isn't going to crash, and I think it's going to start to bounce back by Monday and possibly even a bit tomorrow. I'm considering a weekly call for 2/26", "score": 1, "replies": []}]}
{"title": "Journey to $1 Million - February 17th, 2021", "selftext": "I was hoping and anticipating a pullback this week in order to get into some cheaper positions. Sure enough today was the day. At one point my portfolio pulled back 5%, but fortunately it finished at -2.5% and that was mostly due to a tech and semiconductor correction. \n\n* SPY: +0.02%\n* QQQ: -0.58%\n* DIA: +0.32%\n\n**Notable Recent Picks Today:**\n\n* **ACIC: +17%**\n* **STPK: +5.9%**\n* **CCIV: +8.4%**\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\nMy Account:\n\nhttps://preview.redd.it/ijbp5m3cc5i61.png?width=688&format=png&auto=webp&s=6c8c598fc30dd0f122eb73e46de6e20392714f66\n\n Positions filled: \n\nhttps://preview.redd.it/6recid0dc5i61.png?width=1018&format=png&auto=webp&s=b56f7809057633522e81aabe11813712f87ae570\n\n Positions Canceled: \n\nhttps://preview.redd.it/8r4peeydc5i61.png?width=1018&format=png&auto=webp&s=a702de9fa0ffe664f54474d423d8427d1b1f2a68\n\n Current Open and Closed Options since Feb 16th: \n\nhttps://preview.redd.it/b9oyklyec5i61.png?width=744&format=png&auto=webp&s=892305a560b8f191e9c2bc81103b22318dcc090e\n\nI rolled my cut my $AAPL April 16th and trimmed the $SBE for a loss today. Apple is really dragging behind lately, but I believe it is still decently undervalued. I'll be keeping my long term Apple call for now. Since the markets were down, I took my chances and picked up a few ARK invest positions as well as a $NET and $REGI. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Adding to Watchlist:** \n\n**$DDOG:** Datadog Inc is an American monitoring service for cloud-scale applications, providing monitoring of servers, databases, tools, and services, through a SaaS-based data analytics platform. It is no secret that there will be an increased demand for these services and as a whole this industry is and has been growing over the past years. $DDOG provides an interesting opportunity for extra exposure to the SaaS sector. Current the technical analysis shows a clear support trend with a bullish slope. I would be interested in some mid to long term calls being bought around the support. This is a long term play. \n\n* Target Price: $135\n* Entry: <$100\n* Risk: 3\n* Timeframe: 6-12 months\n\nhttps://preview.redd.it/7qs39c7ic5i61.png?width=1018&format=png&auto=webp&s=5fa9fd36739d7bdfd8fec6f92ab60a7118422280\n\n \n\n**$EH:** Ehang Holdings is another autonomous aerial vehicle technology company, in many ways to yesterdays Archer pick. This is a Chinese company based in Guangzhou that sold had a hit piece yesterday which caused the shares to drop from $129 to $46. Today the shares rallied back to around $72. I see this as an excellent time to start dollar cost averaging into a position. \n\n* Target Price: 140\n* Entry: <$72\n* Risk: 4\n* Timeframe: 2-4 months\n\nhttps://preview.redd.it/osekyg8jc5i61.png?width=1017&format=png&auto=webp&s=aa4fbdcc52eda8bce761bb99a0f2fc02e6b47688\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ \n\n**Notable Mentions:**\n\n**$REGI:** A renewable energy play that has dropped into our buy zone. Today I sold a $95 strike cash secured put for March 19th. Keep a watch out for this one as it should be a nice long term hold. Please review the write up we did on $REGI.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ \n\nNote: Risk (1 out of 5) is my opinion of how risky the stock and these plays are; 1 being the lowest and 5 is the highest. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n\nDisclaimer: The comments opinions and analysis expressed herein are for informational and educational purpose only and should not be considered as individual advice or recommendations.", "id": "lmbe6w", "created_utc": 1613615106.0, "score": 93, "upvote_ratio": 0.91, "num_comments": 30, "comments": [{"body": "Was doing some DD on ACIC and here it is up 17%", "score": 10, "replies": []}, {"body": "Thanks for putting EH on the map. Gonna do some DD on them", "score": 10, "replies": [{"body": "> Gonna do some DD on them\n\nGreat! This is the point of my posts - to inspire people to due their own homework on these stocks!!", "score": 13, "replies": []}, {"body": "EH is a scam company. Reminds me of Luckin and also reminds me why it’s hard to buy Chinese stocks because of the lack of oversight.", "score": 5, "replies": [{"body": "How is it a scam company? They already have several partnerships outside of China and the short report wasn't from the most reputable source to say the least. Seriously curious about why you think its a scam in case I am missing something", "score": 2, "replies": []}, {"body": "I'm in this space and know a bit about the UAS tech...EH has about a 4/5 risk profile in my professional opinion.\n\nLoads of hype, no delivery... (for the last 3 years)\n\nVolocopter is crushing them, and has taken \\*every\\* single contract out from under EH that I'm aware of.\n\nThe first widely published example, which indicated the real-world delivery for me was this:[http://sustainableskies.org/volocopter-dubai-sign-autonomous-air-taxi-agreement/](http://sustainableskies.org/volocopter-dubai-sign-autonomous-air-taxi-agreement/)\n\nThink: 'Luckin Air' (my perspective anyway)\n\nTo pile on, safety is the first priority of any e-taxi technology.EH has blades at eye level to the rider... this all but ensures catastrophic endings from low-altitude accidents.\n\nIf you're purely speculating based on sentiment, go for it. From the technical side, this is no DJI of air taxis, b/c it's not a tech leader in any way, and has \\*never\\* demonstrated superior real-world performance over competing technologies (that I'm aware of)", "score": 2, "replies": []}]}]}, {"body": "Are you still waiting on the 25 price point for pltr?", "score": 2, "replies": [{"body": "No need to wait anymore lol", "score": 3, "replies": [{"body": "OP is a genius haha", "score": 1, "replies": [{"body": "Nah probably just the mods, they're the ones who cleared it", "score": 2, "replies": []}, {"body": "I also bought a put when I read this post and looked into it.  25p. Looks like it paid off.", "score": 1, "replies": []}]}]}, {"body": "Yes but I'll start DCA now.", "score": 2, "replies": []}]}, {"body": "You got my attention turned onto ACIC yesterday, which I picked up. So to return the favor, give SNPR a look. You can check my posts for a quick rundown of the SEC filing.", "score": 2, "replies": []}, {"body": "Never found an entry for NNDM?", "score": 1, "replies": [{"body": "Still watching it closely. I want to see if it holds my weak support or not.", "score": 6, "replies": []}, {"body": "NNSM pump n dump", "score": 1, "replies": [{"body": "You must be looking at a different chart", "score": 1, "replies": []}]}]}, {"body": "Snore", "score": 0, "replies": []}, {"body": "Watch CCAC aug 10 calls", "score": 1, "replies": []}, {"body": "What platform are you viewing all this on?", "score": 1, "replies": [{"body": "webull", "score": 2, "replies": []}, {"body": "Webull", "score": 1, "replies": []}]}, {"body": "Thanks for the posts. Have enjoyed following them", "score": 1, "replies": []}, {"body": "Link to the write up for REGI?", "score": 1, "replies": [{"body": "https://www.reddit.com/r/options/comments/l54hbv/journey_to_1_million_january_25th_2021/", "score": 0, "replies": [{"body": ">REGI\n\nHmm, its removed by the mods.  Odd", "score": 2, "replies": [{"body": "A lot of mods use to delete my write ups and ban me from subreddits, but not as of late.", "score": 3, "replies": []}, {"body": "Yeah I can’t view it. REGI is one of my best performers. I’m trying to decide the next step.", "score": 1, "replies": []}]}]}]}, {"body": "do you still plan on adding more ARKG 12/17 positions? I’m in a 90c that’s hurting but it seems like converting that to a calendar spread when the market bounces back next week could work in my favor", "score": 1, "replies": [{"body": "I’ll most likely dollar cost average if it dips more.", "score": 1, "replies": []}]}]}
{"title": "RIOT call option - HELP", "selftext": "I am so new to options I’m talking about 1 month in. I got lucky I like riot and thought that with the recent Tesla adding bitcoin I would add calls on riot and Mara about 6 weeks out really not knowing anything except the real basic fundamentals of what a call and put is and the Greeks that’s really it (still don’t get it that much lol). \n\nI’m up around 600% on both calls and got a trailing stop loss so I’ve locked in those gains essentially and I was wanting to kinda ride it on the way down too cos that’s what interested me about options that you could make money on both ways and leverage without needing margin (the thought of margin scares me)\n\nMy question comes in here: I see lots of people talking about IV crush and seen people who buy puts and even though the price went down IV dropped and so they still lost money on their puts. This confuses tf outta me cos if your option is ITM then won’t it go up anyway? \n\nWhat would be a good way to ride it down because this move obviously isn’t sustainable.", "id": "lmeidh", "created_utc": 1613625272.0, "score": 3, "upvote_ratio": 0.8, "num_comments": 22, "comments": [{"body": "Your buying of a call is you basically betting that a price will hit that. As it approached and passed that point, the value of your bet increased, IV. If riot crashes and you find yourself holding that call still, your bet looks less and less attractive and your IV starts to tank. Your value begins to tank. Sometimes you gotta just call it and take your gains. You'll kick yourself if it keeps going but it will be much less painful than it crashing and you losing all that value", "score": 7, "replies": [{"body": "I thought IV was just volatility so it went up because it’s been jumping like 15% each day. Am I getting the definition wrong? But yea you right but doesn’t a stop loss stop that ? So if it crashes and hits I’ll just get that minimum of the stop loss it’s like 10% trailing", "score": 2, "replies": [{"body": "Implied volatility is just a measure of how much movement a stock is experiencing relative to it's \"normal\" volume and behavior. Higher it is the more volatile, the more it moves the better chance your bet has to fall in the money, the more valuable your call is, the more you make. \n\nFor stop loss, just be careful it's not gonna perfectly save you. It triggers a sell order, but doesnt guarantee a price and placement of your order. Your iv comes crashing down, your value crashes down while you're waiting to maybe sell maybe not \nhttps://www.marketwatch.com/story/do-stop-loss-orders-actually-stop-losses-2015-11-06", "score": 3, "replies": [{"body": "Thank you so much man you explained it really easy to understand and that article kinda got me like oh damn this whole time I been in this false sense of comfort about it haha legend", "score": 1, "replies": []}]}]}]}, {"body": "Generally if a stock price falls, IV goes up. But since RIOT and MARA already have very high IV, it makes it tricky. \n\nThe reason why some people lose money when they buy puts is because the IV falls faster then the stock price. This means that the extrinsic value(IV,Time left till expiration,etc.) decreases more then the intrinsic value(difference between strike price and stock price) increased reducing the price of the option causing you to lose money. This happens a lot during earnings because a lot of times the IV falls way more than the stock moves. \n\nIf you think the stock will go down, I would do some research on Call Credit Spreads. This is a bearish strategy that you can actually profit from IV crush. I will be making a YouTube video about this soon if you wanted to check out my channel but there are tons of good videos about it already on YouTube.", "score": 5, "replies": [{"body": "This helped heaps I’m still a bit fuzzy but the overall message has helped me understand what people keep going on about. What’s your YouTube channel I’d be keen to check it out", "score": 2, "replies": [{"body": "BezzleTV\n\nIt takes a minute to figure all this out don’t worry. When you get into the world of options, a lot gets thrown at you at once. Just keep trying to learn and it’ll come to you!", "score": 3, "replies": [{"body": "Thanks so much bruvva so happy to have found a place where people so helpful fr I’ll check out your channel tonight 🙏🏽", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "You are a bot with that attitude.", "score": 4, "replies": []}, {"body": "Bruh I’m fr not a bot just straight up retarded and confused lmfaoooo I’m Australian so I legit don’t get to see the live market data for most the day till I wake up 30 mins before it closes", "score": 3, "replies": [{"body": "Honestly if you believe iv crush is coming for you, but are still somewhat long term bullish on the stock. A prudent strategy might be to exercise the option to claim the underlying, and then sell covered calls and use theta + iv to your advantage", "score": 1, "replies": [{"body": "There is one problem with that. You assume I am not broke  hahaha I don’t have enough to exercise on the calls. But that is really good advice I just started looking at yt vids about covered calls I’m just slowly discovering more as I do it more. \n\nTbh for this trade though I wouldn’t do it probably just because I don’t understand it all yet", "score": 3, "replies": []}]}]}]}, {"body": "the premiums are so expensive, good luck.", "score": 1, "replies": [{"body": "That’s what I’m trying to figure out like you say premium is expensive but won’t it just get more expensive *when* (assuming it does) fall?", "score": 1, "replies": [{"body": "The Premium is a product of the value of the stock and its potential value over time. If the price falls your premium will fall with it. Volatility adds to your option but it will also rip it away. Look up Vega for options. For every % move of volatility up or down your option premium will move with it in that direction. Couple that with delta and gamma it could drop fast..just as you saw it shoot up fast. \n\nOver pumped stock starts to fall, buying and selling increases, IV increases and the downward trend amplifies.", "score": 0, "replies": [{"body": "But if you have a put option and the price falls I’ve been seeing people post that they are still somehow losing money even when the stock falls. \n\nSo there would still be volatility but in a downwards way sorry if I sound dumb af I just legit don’t get how people are losing money on put options when the underlying goes down", "score": 1, "replies": [{"body": "Go watch options Greek video on YouTube. Td Ameritrade has a good one. Also go to r/thetagang and look up intrinsic and extrinsic value. \n\nStock price can move in your favor but if you bought at the wrong time with an inflated volatility, you can get crushed when it drops (iv crush). Mornings are always super volatile. RIOT should have huge IV right now too. Go chart Implied volatility on your brokers charting if you can.\n\nYou’ll be in a panic this morning with RIOT. But do yourself a huge favor. Pick a stock (not riot, PENN is a good one) and take note of 4 call options. 1 in the money and 1 out of the money with a close expiration and 2 more with the same prices (1 itm and 1otm) but with an expiration 6 months out. Take note of their premium price and the implied volatility (if you use RH I believe you have to click the premium and then details to see the IV.) Take note of the stock price, premium and IV before market open, again within the first 30 minutes of market open, at noon and then 30 minutes before market close. It seems tedious but trust me and do it. Check it again, last 15m on Friday.\n\nAlso..iV/ Vega can work in your favor. It’s risky and dumb so don’t do it but I’d be lying if I said I won’t occasionally buy quick morning dips and ride the return up and profit off the IV/Vega on the positive before it levels out.", "score": 3, "replies": [{"body": "Didn’t see your comment until just now but thanks ! That’s really helpful I use interactive brokers pro but because I live in Australia I can’t check the options prices during the day (cos market open is 1.30am and closes around 8am) so I only get to see the last 30mins of options prices. I’ll definitely check out all the videos by TD a few people have recommended them so far so think it’s a good place to start :)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Sell some otm credit spreads higher than 50/50 shot takes advantage of high iv defined risk at order entry check it out yo.", "score": 1, "replies": [{"body": "Hahaha nah but thanks I will check it out but tbh I wouldn’t do it on this trade cos I’d have to understand it all completely", "score": 2, "replies": [{"body": "Fair enough man look up tastytrade it's free financial info on options should help you learn all about different strategies.", "score": 2, "replies": []}]}, {"body": "Yes yes I understand some of those words", "score": 1, "replies": []}]}]}
{"title": "Getting on the AMD wheel (hopefully)", "selftext": "The wheel is one of my favorite strategies, and it looks like I may be getting on the AMD wheel soon. I have CSPs at 92.5 expiring on the 26th (AMD is at 88.64 at the moment). There's barely any premium in rolling, so I'm just gonna sit back and take assignment. (I've already collected about 7.50 from the puts.) Then I'm planning to sell 45-day covered calls at 95 for maybe 3.30... Getting paid to wait is a lot better than trying to roll worthless ITM puts.\n\nAnd that's it. Roll the puts until it's not profitable, then accept the shares. Then sell calls, and roll them until it's not profitable, and dump the shares. Repeat. As long as you have faith in the company, you can't lose.\n\nBonus: If you want the option of keeping your shares, then sell covered spreads instead (OTM call spreads). The short leg will still call them away, but the long one will call them back a little later. And if it doesn't go ITM, you may still be able to sell it for a profit since it's closer to the money than when you bought it.", "id": "lmyus2", "created_utc": 1613686433.0, "score": 18, "upvote_ratio": 0.84, "num_comments": 23, "comments": [{"body": "The 2/29 92.5 strike put is $4.49. \n\nThe 3/29 92.5 strike put is $7.19. \n\nThe difference is $2.70. That’s not “barely any”. \n\nYou’ve made $7.50 in premium so far. This would take you to $10.20. 2.70/7.50 is a 36% increase in premium. \n\nIf you want to make your csp more worthful (as opposed to worthless) roll out and down to 3/26 88 strike and add $0.04 in your pocket for a total of $7.54 in total premium bringing your breakeven down to $80.46.", "score": 8, "replies": [{"body": "You’re right, I went to a shorter-dated strike when looking at the roll. That’s why the premium was low.\n\nBut it’s quite common for a tested position to not be rollable for profit, and then taking assignment is a decent alternative.", "score": 1, "replies": [{"body": "No doubt (unable to continue to roll). Been there.", "score": 1, "replies": []}]}]}, {"body": "Love it! Wheel is by far my favorite strategy!", "score": 5, "replies": []}, {"body": "Someone please correct me here if im wrong. I’ve looked into the strategy but haven’t tried yet. My hesitation about the Wheel is that it ties up a lot of money in cash, no? So you’re holding 10K in cash for your CSP and collecting 1 premium every 30-45 days. Couldn’t you be making more with that 10K with other buys during that time than holding the cash for your CSP? \n\nThanks in advance for any explanation", "score": 4, "replies": [{"body": "I guess it depends on what you want. If you're consistently hitting 25% to 30% year-on-year with wheeling. Why risk more?", "score": 5, "replies": [{"body": "Because 20% is not anywhere near 2,500%", "score": -2, "replies": [{"body": "Why get a job when you can buy lottery tickets everyday", "score": 11, "replies": [{"body": "I need the job to buy lottery tickets", "score": 1, "replies": [{"body": "You fool! With those lottery ticket winnings you can buy more lottery tickets!", "score": 3, "replies": []}]}]}, {"body": "20% 18 times is over 2500% roi and way more likely than a moonball 2500% gain.", "score": 2, "replies": [{"body": "Okay, and 2500% 18 times over is 45,000%, whats your point?", "score": 0, "replies": [{"body": "Probability. It's a lot more likely you wheel 18 times successfully then you hit 18 2500% trades", "score": 2, "replies": [{"body": "Spoken like an actual autist", "score": 1, "replies": [{"body": "Hey if you are able to make 2500% gains consistently, you do you. I'm obviously not as smart or cool or talented or whatever you ascribe your success to. I know I can smash gains consistently without much hassle or stress the other way.", "score": 2, "replies": [{"body": "Lol my bad bro i thought this was wsb ive just been joking around", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "I will throw a neat caveat. I am fully invested and so when I do a CSP it uses my margin. No interest to pay or capital outlay needed. \n\nI understand assignment risk and only do CSPs on stonks I like anyhow. Also understand margin risk. Just some shit I like to do.", "score": 3, "replies": []}, {"body": "Put premium should be at least 5% of the share price before you sell. Nothing wrong with tying up some money for 5% in a month. Maybe you get assigned, but you like the stock anyway so you wheel with some CCs.", "score": 2, "replies": []}, {"body": "The alternative would be a bull put spread which results in a credit similar to the wheel but carries a higher risk. With the wheel, the worst that can happen is assignment which isn’t bad if the underlying is a stock you’re willing to own. The max loss for the spread would be the width of the strikes minus the premium", "score": 2, "replies": []}, {"body": "That's a good point. Getting assigned will indeed consume quite a lot of cash, so it's important to stagger your CSPs so they don't all expire at the same time. Also, don't overcommit to the point where you don't have capital to buy if the whole market tanks.\n\nIn terms of returns, it's true that buy-and-hold can give you greater returns sometimes, but it's hard to pick the right stocks at the right time, and you have more downside risk. The premium collected from the CSPs offsets that risk somewhat. The puts are usually sold ATM, or really close to ATM, which should give you maybe 2.5-3.5% return on capital per trade (2-3 weeks). That's usually better than buy-and-hold, although this last year has seen many stocks multibag... Until I buy them, and then they stop going up! \n\nRegarding the 45-day duration, TT has an interesting video about the different rate of decay for ATM and OTM options: [https://www.tastytrade.com/shows/market-measures/episodes/atm-vs-otm-decay-curves-12-16-2020](https://www.tastytrade.com/shows/market-measures/episodes/atm-vs-otm-decay-curves-12-16-2020). In summary, ATM options decay faster from 21 days down, while OTMs decay faster from 45-21 days. This means it's more profitable to sell shorter-term puts, for the wheel strategy.", "score": 1, "replies": []}]}, {"body": "Thank you for the crash course on the wheel!! Remind me to post my loss porn", "score": 1, "replies": [{"body": "You can’t lose - stocks only go up!", "score": 1, "replies": []}]}]}
{"title": "Suggestions for interesting stock picks for 12yo son?", "selftext": "Hi all - thanks in advance for the advice! \n\nMy son has earned some money over the years and wants to invest. I opened a UTMA account for him, and we are reviewing different companies to invest in. We have some companies that we've decided would be fun to own. For example, because he likes Minecraft, we are planning on investing in MSFT... he likes Fortnite more, but no direct way to invest in Epic Games at the moment. But more than just \"fun\" companies, I want him to learn to invest in ETFs (to invest on the market), Growth vs Value, and so on. \n\nSo - his portfolio should be fairly diverse with companies that 12yo boys find interesting, but also a good opportunity to learn about the market and the companies that create and develop his favorite hobbies... and if you're wondering what hobbies are his favorite, he likes to eat, play videogames, and play sports. \n\nWith all that said - what say you? Between the education or stock picks, any recommendations?\n\nThanks again!", "id": "lmwqef", "created_utc": 1613681089.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 23, "comments": [{"body": "Disney should be on there.", "score": 6, "replies": [{"body": "Great suggestion! With Marvel and ESPN, that's a pretty well-rounded one in itself", "score": 3, "replies": [{"body": "It’s also a great lesson for choosing (or not) to reinvest dividends.", "score": 3, "replies": []}, {"body": "If any of you have iPhones, I’m sure apple would be another no brainer", "score": 1, "replies": []}]}]}, {"body": "$ATVI is a good standalone videogame stock and $MSFT would be a good broad technology stock for long term growth. I like $ELY for a sport stock with the recent purchase of Top Golf. There are some decent stocks related to the food industry like $ECL and $YUM. In terms of education, it may not be popular because of the amount of misinformation that can occur but I like YouTube, there are a bunch of channels and videos about stock market investing for beginners and all of the ins and outs, you'd just have to monitor what is watched and learned. I'm sure there are also good books, I'm just not much of a reader unless it's researching a company I want to invest in lol.", "score": 3, "replies": []}, {"body": "I got in to NVIDIA a year ago since I am big into PC building, quite expensive now but it keeps on growing as a company with eSports and mining. Biggest advice I can give you in accordance to ETFs, is ARKK. Anything Cathie Woods touches, is sure to gain traction and value. If there's a lesson for your 12 year old to learn from, millionaires aren't made overnight, invest for the long term in companies you believe in and you'll see a return.", "score": 3, "replies": []}, {"body": "SPCE because what 12 year old doesn’t like space! \n\nThere might be better ones but the aerospace field might be a good one.", "score": 3, "replies": []}, {"body": "MSFT is a solid first choice.  When my son started getting involved, he chose MSFT and QQQ.  He initially wanted NTDOY (an ADR), but changed his mind after learning more about companies.\n\nTCEHY owns Riot Games (League of Legends), Supercell (Clash of Clans) and 40% of Epic Games, but also an ADR like NTDOY.  Some folks also only trade US stocks.  To each their own.\n\nFor food, there's SBUX and MCD.  When he's older and into social media, there's FB (for IG) and SNAP.", "score": 3, "replies": []}, {"body": "Corsair, Nike, Activision, EA, and Apple are pretty good picks for beginners imo", "score": 2, "replies": []}, {"body": "Roblox is supposed to IPO next month", "score": 2, "replies": [{"body": "\"I don't know how you all see it, but when it comes to the children, Roblox is for the children,\" Musk continued. \"We teach the children. Tesla is good, but Roblox is the best.”", "score": 3, "replies": [{"body": "I really hope I have money in time to get in on that if Musk is preemptively pumping it", "score": 1, "replies": []}]}]}, {"body": "Any of the ARK funds run by Ms. Cathie", "score": 2, "replies": []}, {"body": "GME xD", "score": 1, "replies": [{"body": "Agreed but probably wait for the dust to settle first", "score": 1, "replies": []}]}, {"body": "Mattel and Hasbro", "score": 1, "replies": []}, {"body": "Fds", "score": 1, "replies": [{"body": "Thanks for response- Why FDS though? What would be the hook for a 12 year old to invest?\n\nThanks again!", "score": 1, "replies": [{"body": "I'm being a little sarcastic. What I mean is buying really cheap options that expire that week. Good way to teach about why it's a bad idea.", "score": 1, "replies": []}]}]}, {"body": "$HERO for video games", "score": 1, "replies": []}, {"body": "Netease", "score": 1, "replies": []}, {"body": "If you're interested in video-game ETFs, take a look at ESPO. I picked up 67 shares in July at $54.55/share, and it's up 45.4% since then.", "score": 1, "replies": []}, {"body": "The best investments are the simplest ones", "score": 1, "replies": []}]}
{"title": "You merely adopted the fear of the bear market . I was born in it, molded by it. I didn't see the gains until I was already a man.", "selftext": "[removed]", "id": "lm8oe3", "created_utc": 1613606867.0, "score": 656, "upvote_ratio": 0.98, "num_comments": 26, "comments": [{"body": "Haha this says a lot, I’m new to investing and I was scared seeing so much red today, but I keep following you guys here and today, I bought a lot of dips!", "score": 30, "replies": [{"body": "I've experienced the 2008 crash, 2018 flash crash, 2020 crash, and all the small corrections in between. I barely felt the red today... S&P down just 0.03% and NASDAQ down only 0.58%. That's just a normal red day.\n\nThat being said, now is as good as time as any to reevaluate your portfolio. Are you taking on too much risk? Too little risk? Do you have too many speculative stocks? Etc.\n\nThe past year had been insane in the stock market. If you threw money into every reddit-hyped stock you've probably made 100-500% gain. I myself put 10% into super speculative stocks in 2020, and I've never made money this easily before. This isn't normal and is unlikely to continue in the long run.\n\nI'm not going to predict the future. Just know that things will keep going up until they don't. At that point I hope all the new investors have a plan. Sometimes \"buying the dip\" means catching a falling knife that never recovers... Believe I know because I've done that before.\n\nAlso, stop checking your stocks everyday. 🙂", "score": 16, "replies": []}, {"body": "Apologies but this comment made me check- what was red today for you? Seems like a middling day.", "score": 5, "replies": []}, {"body": "Mvis was my big dip buy today", "score": 5, "replies": []}]}, {"body": "Also remember to check the downward volume. All my stuff that was up last week and down this week was down on low volume, so no fear. I was down 1% today overall but it was an awesome day for me because my stuff that had been down a lot last week recovered on good news and high upward volume.\n\nAnd check VIX. If VIX doesn't shoot way up, then nothing bad is happening. If VIX is shooting up, check the news!", "score": 5, "replies": [{"body": "Every time I see the VIX rise I see a influx of ads about the market crashing before it’s kinda easy to read it goes from $12-15 then goes to $20 then drops immediately if goes over $25-30 worry", "score": 3, "replies": [{"body": "Yeah, I keep alerts at $20 and $30", "score": 1, "replies": []}]}, {"body": "Did you dump all your positions end of January?", "score": -1, "replies": [{"body": "Why do you ask that? There is no reason in what I said to think that, and I can't see an obvious misunderstanding that would arise from what I said that would be answered by that.", "score": 1, "replies": []}]}]}, {"body": "This works until the market starts dipping for years, not days\n\nThen \"buying the dip\" becomes buying at the top", "score": 6, "replies": [{"body": "Totally. Buying the dip and catching a falling knife only looks different in hindsight.\n\nNot much you can do though, just keep buying and hope for the best", "score": 2, "replies": []}, {"body": "Spoken like a true  🏳️‍🌈 🐻.", "score": 5, "replies": []}, {"body": "Exactly this. People's interpretations of a 'dip' are what the price of a stock was two weeks ago.\n\nWait until we see a 10%+ correction. That'll weed out a lot of new investors.", "score": 1, "replies": []}]}, {"body": "How is there fire if they’re underwater?", "score": 3, "replies": []}, {"body": "fucking blakcberry fucked me in the asstoday goddamn", "score": 3, "replies": []}, {"body": "Everyone who came in during April are the best investors of all time. 100% return, never a red day.\n\nNow that the market is returning to more normal (still bull though) those gains aren’t so hot anymore.\n\nI’ve been through 1994, 2000, 2008 and 2020 crashes, yet I am permabull.\n\nBuy the fucking dip.", "score": 3, "replies": []}, {"body": "NOVA, SPCE, NIO, GEVO", "score": 2, "replies": []}, {"body": "Added to quite a few of my positions. Dips are not bad", "score": 1, "replies": []}, {"body": "Nice.", "score": 1, "replies": []}, {"body": "Golden", "score": 1, "replies": []}, {"body": "Buy with more chips on the yummy dips!", "score": 1, "replies": []}, {"body": "This is so relatable. I used be scared in my initial old days of investment. Glad that i somehow learnt to deal with reds and dips. :)", "score": 1, "replies": []}, {"body": "It’s all about having the money to be able to buy dips lol gme amc Nokia scandal fucked my portfolio up 💵🔥💵🔥💵🔥💵🔥", "score": 1, "replies": []}, {"body": "I live for these days. Ended the day in the green after putting more money in at the bottom.", "score": 1, "replies": []}, {"body": "You truely are awesome", "score": 1, "replies": []}, {"body": "Go Roaring Kitty.  We got yr bck", "score": 1, "replies": []}]}
{"title": "Piedmont Lithium Deep Dive (NASDAQ: PLL ASX: PLL): Tesla, Sayona, Metso Outotec and an American Lithium Supply Chain", "selftext": "Disclosure: I have an open long position in PLL and plan to keep for several years. The following IS NOT FINANCIAL ADVICE and is for information purposes – My Position Disclosed.\n\nI've spent the past 8 months researching this US based lithium company after seeing it on the [EV Stock channel on YouTube](https://youtu.be/Dvc0kiUvIfw). I don't see many deep dives or content in general on PLL like I do for the other prospective lithium companies like Lithium Americas (NYSE:LAC) and so I wanted to share my research and why I'm bullish on the stock and why others who believe that electric vehicle demand will go vertical this decade should consider investing in Piedmont Lithium (NASDAQ: PLL, ASX: PLL).\n\nThis is not to say the other companies are not worthwhile investments, only that PLL to me seems to be a great stock where its current market cap makes it a better deal than most and one that still has plenty of upside from today’s $55 share price (February 2021). Fintwit likes to compare resource sizes between prospective lithium companies and extrapolate from there that one asset will dominate and is the only one worth investing in and they deem it irrational to invest in anything other than their favorite stock. Even though this post is only about PLL, the truth is we’ll probably need all of the lithium juniors to be successful in order to transition the world’s vehicle fleet off fossil fuels. To me, PLL’s recent history, future prospects, and its current market cap make PLL simply *a better deal* than others at this point in time and is worth considering as an investment.\n\nI started buying PLL around $6 ($65M market cap) in Summer 2020 and it went \\~7x by October 2020 having gained project validation through a supply deal with Tesla. There's also more to the Tesla relationship as well since Tesla is building a lithium hydroxide plant in Texas and there are some synergies that PLL should benefit from (to skip forward to this part, see section #3 Tesla’s New Take on Lithium Hydroxide).\n\nThis post is lengthy so here's a “Table of Contents” and I’ve also broken and bolded the section headings as you scroll down:\n\n1. Brief Company Overview\n2. Bullish Investment Thesis\n3. Tesla’s New Take on Lithium Hydroxide with Metso Outotec and PLL\n4. Sayona-Piedmont Deal Explained\n5. Upcoming Near Term Expected News That Can Drive PLL Higher\n\n&#x200B;\n\n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n\n**1. Brief Company Overview**\n\nPiedmont Lithium is a prospective North American lithium mining and chemical plant company with planned operations in North Carolina, 30 miles west of Charlotte. PLL hopes to sell into the North American EV battery supply chain to companies like LG Chem, SK Innovation, BASF, and Umicore in addition to Tesla.\n\nPLL plans to start mining pegmatites on their own land in 2022, crushing, sorting, and concentrating it into SC6 (spodumene concentrate 6% Li2O) and will then start chemical operations in 2023, converting SC6 into lithium hydroxide. Piedmont will also be buying SC6 from Sayona Mining, another prospective lithium company in Quebec, Canada, as feedstock into Piedmont's hydroxide chemical plant. This is to keep up the “tons per year” throughput capacity of the chemical plant. Lastly, PLL has a deal with Tesla for its North Carolinian SC6 to feed Tesla's own lithium hydroxide plant near Giga Austin.\n\nThere are mainly two types of lithium chemicals sold to battery and cathode makers: lithium carbonate and lithium hydroxide. Growth for hydroxide is expected to outpace carbonate because hydroxide is used in higher energy dense and therefore higher nickel content batteries like [Tesla’s 4680 cells that will go into the Cybertruck and Tesla Semi](https://youtu.be/l6T9xIeZTds?t=4199). Hydroxide can withstand higher temperatures compared to carbonate when sintering with the nickel + \"other metals\" precursors. Hydroxide is also tougher to deal with compared to carbonate and hydroxide has a shorter shelf life, but hydroxide is expected to continue to sell at a premium compared to carbonate. Carbonate’s main feedstock is brine and hydroxide’s main feedstock is spodumene due to cost of conversion although you can make either carbonate or hydroxide from either brine or spodumene if the price is right.\n\nToday, PLL is currently domiciled in the Australian Stock Exchange with a [conversion that you can buy in the US called ADRs](https://www.google.com/finance/quote/PLL:NASDAQ) (American Depository Receipts) where each ADR = 100 Ordinary Shares. All of my math below in section #2 was using the ADR share count. It’s the same ticker in either Australian or US stock exchanges (PLL). One benefit so far was you get a lot more trading hours since Australia is +14hrs (6PM ET ASX trading open).\n\nHowever, this is changing. Since the project is American, the management is mostly American, and they’ll sell into the North American market, [PLL is currently in the process of re-domiciling](https://d1io3yog0oux5.cloudfront.net/_9ad2aee07b47d44421d3191a6b666a51/piedmontlithium/db/336/2642/pdf/2154035.pdf) to the US which should be completed in March/April 2021 timeframe. After the re-domicile, each ADR shareholder will get 1 new ordinary share so it basically won’t have a material effect. They’ll also do a secondary listing in Australia and basically for every 100 former outstanding shares, Australians will get 1 new CDI, CHESS depositary interest, but again it basically won’t have a material effect. The basis for doing this is to shore up the American thematic for investors and possibly for loans, qualify for indexes like the Russell 2000, and make it easier should a company want to invest into or buy PLL.\n\nFinally, regarding the actually numbers, Piedmont Lithium plans to:\n\n* Produce in North Carolina 160,000 tons SC6 per year for 25 years with their own mine and concentrate plant\n* Buy 60,000 tons or more of SC6 per year from Sayona Mining (Quebec) for the life of their mine (with options to increase as Sayona’s resources increase)\n* Produce 22,700 tons of lithium hydroxide per year for 25 Years, converting the SC6 from North Carolina and Sayona Quebec.\n* Sell to Tesla \\~53,000 tons of SC6 per year for 5 years with an option for an additional 5 years\n* Sell to battery/cathode companies the 22,700 tons of lithium hydroxide per year to make bank\n\n&#x200B;\n\n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n\n**2. Bullish Investment Thesis**\n\n**Key Takeaways:**\n\n* **PLL undervalued at today's $760M MC vs. existing lithium companies using EV/EBITDA**\n* [**Tesla validates**](https://d1io3yog0oux5.cloudfront.net/_9ad2aee07b47d44421d3191a6b666a51/piedmontlithium/db/336/2620/pdf/2118399.pdf) **and de-risks**\n* **PLL plans to produce more lithium hydroxide and** [**be a bigger business**](https://www.spglobal.com/platts/en/market-insights/latest-news/metals/020221-expect-lithium-supply-crunch-by-2025-as-ev-market-booms-piedmont-ceo)\n* **Positive US Government and investor sentiments for** [**American based EV supply chain**](https://www.realclearenergy.org/articles/2021/02/08/build_the_electric_vehicle_supply_chain_from_the_mine_up_659558.html)\n\nPiedmont’s current market cap is $760M as of February 2021. [There are about 6 major lithium producing companies today](https://twitter.com/LithiumIonBull/status/1356038874972233730/photo/1) supplying to the EV battery space and their market caps range from $20-$25B (Albemarle and Ganfeng), $11-$15B (Tianqi and SQM) and $1B-$3B (Orocobre and Livent).\n\nA standard valuation metric when analyzing mining companies is using [EV/EBITDA multiples](https://www.investopedia.com/ask/answers/072715/what-considered-healthy-evebitda.asp), EV being Enterprise Value in this context, not Electric Vehicles. EV is nothing more than Market Cap plus Debt or Loans minus Cash in Bank. You basically use a bunch of assumptions, solve for Market Cap and then use this figure to divide by estimated shares outstanding to get a target share price. You need to discount the future EBITDA expectation back into today’s dollars which is sort of like reverse compounding interest.\n\nSo back to PLL, using the below assumptions, I see **PLL conservatively as a $1.33B market cap** company or **with an aggressive multiple, it could be a $2.25B market cap** company (versus the $760M market cap it is today). Since you can’t make market cap out of thin air, I assumed a 40% share dilution along with taking on debt to fund the project. Why 40% dilution? From today’s market cap, that would equal about half of their funding needs of about $600M total where the other half would be financed with low interest debt. This all equates to a target **$69 diluted share price for the $1.33B MC or $116 diluted share price for $2.25B MC**. Again, **PLL trades today around $55 per share**.\n\n\\*\\*\n\nMath details follow, skip ahead if not interested.\n\n2028 EV/EBITDA Multiple = 12.5\n\n2028 Est. EBITDA (see note below) = $210M\n\nDiscount rate = 8%\n\nDebt = $300M (50% of $600M project cost)\n\nCash = $100M (working capital estimate)\n\n2021 Shares Outstanding = 13.85M shares\n\n2028 Share Dilution = 40%\n\nEV = Market Cap + Debt – Cash,\n\nSolving for MC = EV – Debt + Cash\n\nEV/EBITDA = 12.5 and solving for EV = EBITDA \\* 12.5\n\nBringing into today’s dollars using 8%:\n\n2021 EV = EV / (1.08)\\^7 = (EBITDA\\*12.5) / (1.08)\\^7 = $1.532B\n\n2021 MC = 2021 EV – Debt + Cash = $1.532B - $300M + $100M = $1.3 B\n\nWith an additional 40% share dilution: 13.85M \\* 1.4 = 19.4M\n\n$1.33B / 19.4 M = $69 per share\n\n&#x200B;\n\n\\*EBITDA Note: I did my own future cashflow for life of mine (25 years) and used these assumptions for EBITDA: $12,700 per ton hydroxide battery grade, $9,000 per ton hydroxide non-battery grade, $600 per ton SC6, AISC $6,000 per ton hydroxide, $300 per ton SC6 mining, 8:1 conversion ratio of SC6 to LiOH, 30/60/90% 3 year ramp up to 80% end-to-end battery-grade nameplate hydroxide production. Note the $12.7K is arguably super conservative for hydroxide prices for the middle of this decade and beyond.\n\nDone with the detailed math.\n\n\\*\\*\n\nIf instead you do a **20x multiple for EV/EBITDA**, same assumptions above, the **potential market cap is $2.25B which is $116 per diluted share!**\n\nIs a 12.5x or 20x a reasonable EV/EBITDA multiple? Today the lithium producing companies mentioned are trading 17x - 34x 2022 EBITDA projections.\n\nAll of this is to say if PLL executes and produces, the market already values lithium companies with these kinds of multiples.\n\nSo now the question is can PLL execute?\n\nHere is where the Tesla deal comes in. Tesla [settled on spodumene-to-lithium hydroxide](https://youtu.be/l6T9xIeZTds?t=4482) for their own path forward for near term lithium needs because of its scalability and sustainability. Most everyone remembers the “table salt + clay = instant lithium\" talk from Battery Day but the presentation slides and the PLL deal in the aftermath made it clear their near term development and capital expenditures will be for spodumene-to-hydroxide. And for this project, they presumably reviewed many existing and upcoming spodumene miners and concluded that PLL in North Carolina was their best partner.\n\nAfter the Tesla offtake announcement, PLL was able to raise $57 million in a 2% share dilution offering (market cap alone was $65 million when I started reading up on the company in Summer 2020) and this kickstarted the work needed to bring the project on the cusp of completing definitive feasibility studies, final investment decision, and construction start.\n\nPLL still needs to raise the actual $600M in project financing to complete the mine, ore concentrator, and lithium hydroxide chemical plant, which is A LOT of capex. Sources of funding could vary such as Dept of Energy loans and companies inside or outside the battery industry, but it looks like there is no better time than now to be investing in the battery metals space. The sales pitch is pretty compelling where the impetus for doing this PLL project is to sell into a lithium hydroxide market that is expected to grow from 80,000 tons per year in 2020 to 2 million tons by 2030 or even earlier. If PLL builds their 22,700 tons per year chemical plant and gets qualified to sell to cathode/battery makers, PLL will sell out of inventory.\n\nBut wait there’s more! All of the above numbers are using PLL’s currently announced plans. PLL has said they[ plan to be a bigger business](https://www.spglobal.com/platts/en/market-insights/latest-news/metals/020221-expect-lithium-supply-crunch-by-2025-as-ev-market-booms-piedmont-ceo) and they’re starting to make moves to show this, like through their [recent investment and spodumene concentrate offtake deal](https://d1io3yog0oux5.cloudfront.net/_9ad2aee07b47d44421d3191a6b666a51/piedmontlithium/db/336/2643/pdf/2163907.pdf) of their own with Quebec junior mining company Sayona Mining.\n\nWith Sayona, Piedmont signed not only an offtake for 60,000 tons of SC6 per year for *life of mine* (or 50% of Sayona output should Sayona produce more), they also took a \\~20% equity stake in the parent company and partnered with their lithium project, now owning 25% at the asset level of Sayona Quebec subsidiary. So \\~20% in Sayona shares and 25% business ownership for the Quebec mine, all for a total of $12M USD where they also get a board seat and at least project consensus rights.\n\nFinally, with all of the above there is also the backdrop of Biden’s Build Back Better and the monumental transition from ICE to EVs this decade. Tesla showed the way and now every automaker has plans to offer EVs of their own and now countries are announcing their [phase-out dates of ICE vehicle sales](https://en.wikipedia.org/wiki/Phase-out_of_fossil_fuel_vehicles) some as soon as 2027.\n\nIn the transition to a battery energy economy, you can imagine the US Government would not want to shift an oil dependency controlled by OPEC to a battery raw materials dependency controlled by China. Therefore, North American friendly and, even better, US based mining companies should benefit from this sentiment.\n\nNot only are the emissions from vehicles under scrutiny but also the supply chain as well. Today, [80% of lithium hydroxide comes from China](https://www.spglobal.com/platts/en/market-insights/latest-news/metals/033020-us-far-too-reliant-on-chinese-lithium-american-battery-ceo). China imports most of its spodumene SC6 feedstock from Australia, converts it to hydroxide hundreds of miles inland, which is then shipped back out to Japan, Korea, and the rest of the cathode/battery world which then makes it into an EV. This equates to a ton of CO2 emissions and [Tesla highlighted this \"kg x km\" metric](https://youtu.be/l6T9xIeZTds?t=4482) as a figure of merit when they were considering their raw material sourcing strategy.\n\nPLL is a North American project that will supply the North American supply chain but could also supply the European battery supply chain as well (North Carolina is a lot closer to the battery factories in Europe than China is). Again, should PLL produce, it seems they will easily sell out of inventory.\n\nSo from the bull side, investing in PLL, a US domestic lithium producer, could be like investing in Standard Oil when the Model T came out in the 1900s.\n\n&#x200B;\n\n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n\n**3. Tesla’s New Take on Lithium Hydroxide with Metso Outotec and Piedmont Lithium**\n\n**Key Takeaways:**\n\n* **Tesla has not publicly disclosed what companies they’re working with or flowsheet details they’re considering for their spodumene-to-lithium hydroxide chemical plant in Texas**\n* **There are public comments where Metso Outotec (a Finnish chemical equipment company) and Tesla are mentioned to be working together**\n* **Big market potential for companies involved if Outotec flowsheet becomes the industry standard with “sulfate free” and sulfuric acid free process. Today, sulfuric acid roast is the primary flowsheet by industry leaders Albemarle, Ganfeng, and Tianqi**\n* **Outotec process is in line with Tesla’s more environmentally friendly approach with the potentially huge benefit that it can also yield +20% better recoveries from spodumene than sulfuric acid roasting (**[**see Critical Elements study**](https://www.cecorp.ca/en/critical-elements-successfully-produces-battery-grade-lithium-hydroxide-in-pilot-plant-testing/)**)**\n* **Dave Buckley, VP Process Engineer for Piedmont Lithium talks about the “pressure leaching” process, which is the Outotec process, prior to Tesla Battery Day in July 2020 on Joe Lowry’s The Global Lithium podcast calling it an elegant solution but non-commercial scale today. Seems right up Tesla’s alley and primed to disrupt the existing hydroxide industry.**\n\nTesla could be aiming to disrupt another industry, this time setting their sights on the lithium chemicals supply chain. They don’t simply repeat what’s always been done but going back to first principles to find scalable and elegant solutions. The same seems to apply to their lithium hydroxide plans in Texas.\n\nAt Battery Day, [Tesla highlighted a “sulfate free” lithium hydroxide processing plant](https://youtu.be/l6T9xIeZTds?t=4482), co-located with a cathode facility, to supply Giga Austin and the new 4680 cells. They signed a spodumene feedstock deal with Piedmont Lithium to supply the plant with SC6, [highlighting their sustainably mined/sourced ore](https://youtu.be/l6T9xIeZTds?t=4449) principles.\n\nThrough some online investigating, Tesla seems to be forging ahead with Metso Outotec’s novel pressure leaching lithium hydroxide process:\n\n* Ana Cabral-Gardner from Sigma Lithium during [5@5 Mines and Money YouTube interview from Sept 29 2020](https://youtu.be/QWryxVESZTY?t=3379):\n\n“We’re very excited about the pioneering that Tesla and Piedmont (Lithium) are doing because it pushes the industry forward. Typical Tesla it’s the Silicon Valley speed forcing an industry like mining and chemicals, which are typically slow, to kind of move on that speed…so the Outotec route that the Finnish had been trying and playing with for a while, Tesla was like ‘OK I’ll just do it, I’m going to follow that route and I’m just going to do it’…They are actually doing this industry a tremendous tremendous tremendous favor by just charging ahead as always”\n\n* Evercore February 9 2021 PLL Research Note [Posted on Twitter](https://twitter.com/LithiumIonBull/status/1359177010220834817):\n\n“We dug a little deeper on the process being considered (Outotec) which looks to offer a number of cost, efficiency, and sustainability benefits vs traditional LiOH conversion technologies”\n\n[Outotec](https://www.outotec.com/) is a Finnish company that specializes in chemical processing equipment for gold, zinc, nickel, and now battery chemicals like lithium hydroxide and carbonate.\n\nToday, most of the lithium hydroxide produced by Albemarle, Tianqi, Ganfeng uses a sulfuric acid roasting flowsheet. [Outotec’s process](https://www.outotec.com/globalassets/newsletters/hydromet/issue-1-2019/alta2019---tiihonen-lp059.pdf) is environmentally sustainable, sulfate and acid free and [over 20% more efficient compared to sulfuric acid roasting](https://www.cecorp.ca/en/critical-elements-successfully-produces-battery-grade-lithium-hydroxide-in-pilot-plant-testing/) in converting spodumene to hydroxide, meaning more hydroxide for the same spodumene concentrate (“80% Outotec vs 65% market benchmark” where 23% = 15%/65%).\n\nOutotec’s hydroxide test work has appeared in the feasibility studies of other spodumene junior mining companies Keliber ([DFS](https://www.keliber.fi/site/assets/files/1889/executive_summary_of_the_updated_definitive_feasibility_study_id_17398.pdf) and [Press Release](https://im-mining.com/2020/02/18/outotec-test-work-stacks-keliber-lithium-project/)) and [Critical Elements](https://www.cecorp.ca/en/critical-elements-successfully-produces-battery-grade-lithium-hydroxide-in-pilot-plant-testing/). The Outotec process may have been on Tesla’s radar from these feasibility studies published between 2018-2019.\n\nOutotec’s process is also highly respected by Dave Buckley, a star lithium processing engineer with a resume that includes working for FMC (now Livent), Rockwood Lithium (now Albemarle), Critical Elements, and, since Jan 2018, VP Process Engineer at none other than Piedmont Lithium!\n\nIn July, [Dave was interviewed by Joe Lowry](https://anchor.fm/globallithium/episodes/Episode-72-Dave-Buckley-egsev9/a-a2nlroh) on The Global Lithium Podcast, arguably the most popular lithium discussion on the Internet (Outotec Pressure Leaching discussion starts at 34:55 mark).\n\nDave called the pressure leaching process “elegant” and “much less environmentally impactful”:\n\n&#x200B;\n\n* “The process that I’ve seen that I think is an extremely elegant process is the pressure leaching process that years and years ago in the 50’s and 60’s they did up in Canada where they took the roasted spodumene, mixed it with soda ash, put it in autoclaves, you get lithium carbonate and basically sand, what they call analcime or sodium aluminosilicate. (This) comes out and then you bicarbonate that and then filter the solids off, heat the solution up again and you get a really pure lithium carbonate. People have also discovered you can do that and instead of taking it to the bicarbonate process you take that slurry coming out, mix it with lime, then do the filtration, you get rid of the vast majority of your impurities, and then you take it to the lithium hydroxide finished product…people have done that and *in a single step of crystallization* they get battery grade lithium hydroxide. It’s extremely elegant, extremely clean and can be very much less environmentally impactful process.”\n\nJoe then cuts him off and doesn’t want to talk about non-commercial scale stuff at the time. Dave Buckley doesn’t say Outotec by name but references [Keliber](https://www.keliber.fi/site/assets/files/1889/executive_summary_of_the_updated_definitive_feasibility_study_id_17398.pdf) and [Critical Elements](https://www.cecorp.ca/en/critical-elements-successfully-produces-battery-grade-lithium-hydroxide-in-pilot-plant-testing/)’ feasibility studies.\n\nOutotec seems to be the only company that is offering a complete LiOH pressure leaching commercial plant (rotary kilns, autoclaves, mixing vats/reactors), and the first one to be installed at scale will probably be for Tesla in Texas. Critical Elements and Keliber are planning to use the Outotec process but they’re still awaiting permits and full funding. PLL publicly said they plan to use conventional sulfuric acid approach back in 2020 before the Tesla offtake deal ([based on their 2020 Prefeasibility Study](https://d1io3yog0oux5.cloudfront.net/_729b9b64c6d99b2ef45579839f383203/piedmontlithium/db/336/2595/pdf/2067658.pdf)) but judging by Evercore analysts who met with PLL management a few weeks ago, PLL is at least considering a switch to the Outotec process through their relationship with Tesla and their joint Outotec test work.\n\nThe lithium hydroxide industry is still small (again \\~80,000 tonnes per year in 2020) compared to 2030 projections (1.5m-2m tonnes per year) and so existing technology (i.e. sulfuric acid roast) may not be what companies build going into the decade. Others could follow in Tesla’s footsteps and eventually Outotec’s process could be THE industry standard going forward, dominating the market in many areas: spodumene hard rock as preferred LiOH feedstock, pressure leaching flowsheet, Outotec autoclaves and kilns for conversion equipment. There’s potential for a big engineering shift and investing opportunity in companies involved in the Outotec process if Tesla (along with possibly PLL) is able to successfully disrupt the incumbents with this new lithium hydroxide flowsheet.\n\n&#x200B;\n\n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n\n**4. Sayona-Piedmont Deal Explained**\n\n[PLL invested $12M for a joint partnership with Sayona in Quebec Canada](https://d1io3yog0oux5.cloudfront.net/_9ad2aee07b47d44421d3191a6b666a51/piedmontlithium/db/336/2643/pdf/2163907.pdf) in January 2021. PLL now owns 19.9% in equity at the parent company level and 25% as a business partner at the asset level in Sayona Quebec, the subsidiary. Sayona plans to produce SC6 like PLL. Sayona could have 3 separate mining locations/projects all in the same general vicinity in Quebec.\n\nThe first is Authier (French “o-thee-A”) their flagship mine: 14 year life, plans to produce 114,000 tonnes SC6 per year. For comparison, PLL is 25 year life, 160,000 tonnes per year SC6.\n\nAuthier is smaller than PLL’s announced ore body today in North Carolina but SYA can at least resupply PLL back what they’re selling to Tesla so PLL can at least keep their currently announced lithium hydroxide (LiOH) plant size of 22,700 tonnes per year instead of having to potentially downsize due to the Tesla deal that ships 1/3 of PLL SC6 to Austin, Texas.\n\nThis is the announced PLL offtake deal base case 60,000 tonnes per year *for the life of the Authier mine* in the announcement which is about 50% of Authier expected output.\n\nWhat gets interesting is the two additional Sayona mining projects: a bid for currently in bankrupt NAL (North American Lithium) and the not so explored Tansim Project.\n\nSayona is currently a bidder for NAL (North American Lithium). NAL mine is literally adjacent to Authier (60km/36 mi West) also in Quebec but NAL went bankrupt in 2019. NAL was producing SC6 which means they have a running mine plus a 180,000 tonne per year nameplate capacity spodumene concentrator already working but it turned out their mined ore was not as good as hoped and therefore needed a lot more sifting/filtering to get to a decent concentration which ultimately means higher costs. They were also shipping this exclusively to China which is expensive from Quebec. But mostly due to plummeting SC6 prices the past few years this basically crushed them into bankruptcy. Just poor timing since we’re at the beginning of what looks to be a raging bull market for lithium and EV battery metals in general.\n\nShould Sayona win the bid, they want to mix their good ore from Authier with NAL’s not-as-good-as-hoped-for ore and together the plant should run with lower operating expenses. If Sayona wins the bid, they’ll get NAL mine, ore body, and essentially a brand new 180,000 tonne per year concentrator plant already built.\n\nAll NAL bids were due January 15 2021, which is probably why the $12 million investment from PLL was timely (the week of) to hopefully ensure Sayona wins. This was supposed to close last July 2020 but Covid delayed the sale. An announcement is expected any day now as of February 15.\n\nThe third Sayona mining project nearby Authier and NAL where Sayona has land rights and are exploring an area called Tansim and this alone could be the size of the current PLL in North Carolina at 25 million tonnes. Range estimate for Tansim is 5 to 25Mt at 1.2% – 1.3% Li2O. This is in exploration phase.\n\nIf Tansim mine pans out, Sayona will probably need to expand or build another concentrator to increase throughput of SC6.\n\nSayona could go from 180,000 tonnes per year (from NAL) to +300,000 tonnes per year.\n\nAnd therefore, if all 3 mines pan out, PLL could have first dibs to get 50% of all Sayona output: Authier + NAL + Tansim.\n\nThis is a great deal for PLL and they’re starting to lay the foundation to show how they could be a lot bigger, as [PLL’s CEO Keith Phillips said in a recent interview with S&P Global](https://www.spglobal.com/platts/en/market-insights/latest-news/metals/020221-expect-lithium-supply-crunch-by-2025-as-ev-market-booms-piedmont-ceo).\n\n&#x200B;\n\n**\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\***\n\n**5. Upcoming Near Term Expected News That Can Drive PLL Stock Higher**\n\nLastly, I’ll conclude with some near term (next 6 months) expected news that should drive the stock.\n\n* Lithium Hydroxide Offtake Deal with major battery/cathode company like LG Chem or Tesla. Recently, Yahua in China signed a 5 year hydroxide offtake deal with Tesla. Their stock rocketed 60% in 5 days (Shanghai exchange caps most companies at +10% per day).\n* Launch Chemical Plant Definitive Feasibility Study and announcing a change to the Outotec Process like Tesla.\n* Mine and Concentrate Plant DFS Complete. This is their Critical Design Review equivalent for other engineers out there. They can take this and use it to make a real business case to get funding (next bullet).\n* Clarity around funding $500M+ in total capex for the integrated project: the mine and concentrator (in 2022) and chemical plant (by 2023). Could be combination of low interest loan (Dept of Energy and Biden Administration may be in play) and a big company who would want to become a business partner and own the assets. Could also issue shares but doubt PLL management will issue $600M in shares since they have stressed their focus is shareholder value.\n* Converting/increasing resource base from indicated/estimated in North Carolina after new drilling started last August 2020. Could announce an increase in throughput of SC6 production underpinning the “building a bigger business” theme like the Sayona offtake deal.\n* Mine and Concentrate Plant Construction Start in North Carolina\n\nThat's it for this post. I’ll try to check in and answer comments/questions periodically as well. Thanks for reading.", "id": "lmbhv7", "created_utc": 1613615440.0, "score": 47, "upvote_ratio": 0.95, "num_comments": 22, "comments": [{"body": "PLL to the moon!🚀", "score": 5, "replies": []}, {"body": "Nice post Chan man!", "score": 4, "replies": []}, {"body": "Agreed!\n\nUndervalued....", "score": 3, "replies": []}, {"body": "ULTHF", "score": 2, "replies": []}, {"body": "Very detailed analysis, thanks for sharing. Excited about PLL!!", "score": 2, "replies": [{"body": "Happy to share. More people need to know about this company. Trying to do my small part.", "score": 1, "replies": []}]}, {"body": "Thanks for the detailed report. Well researched. I'm invested in both PLL and SYA and will hold", "score": 2, "replies": [{"body": "Glad you liked it. It helped me to get all of my thoughts down in this lengthy post so appreciate you taking the time reading until the end.", "score": 2, "replies": []}]}, {"body": "Nice post. Appreciate all the work you out into it. Actually I also hold the Metso Outotec stock since last summer. I discovered it because I researched battery recycling. Ironically also because of an EV channel episode. The one with the CTO from American Manganese (Also nice stock). I discovered Outotec and bought some shares. I didn't know they would merge with Metso and and shortly after they had an investor day and presented their new strategy. Soince then the stock has steadily grown - Reaching their all time high soon.\n\nIn terms of lithium I also like Lake Resources, Vulcan Energy & Ironridge Resources. Cheers", "score": 2, "replies": []}, {"body": "Very detailed!", "score": 2, "replies": []}, {"body": "Running a 30-day RSI on exponential prices makes it seem like there hasn't been a compelling entry in weeks. Although the tiny volume might be doing funky things to the indicator.", "score": 2, "replies": [{"body": "I guess yesterday was a good entry. Tough to time.", "score": 1, "replies": []}]}, {"body": "Beautiful. I got in at about $28 in December. I'm all in on tesla and PLL.", "score": 2, "replies": [{"body": "Nice I was a TSLA holder for the past 3-4 years. They really showed the way for other auto OEMs and obviously have setup a huge supply chain market for lithium, nickel, etc. I put a little of my TSLA into PLL last summer and then when PLL dipped in November I converted the remaining TSLA and never looked back.", "score": 1, "replies": []}]}, {"body": "Quick question regarding the merchant plant as I don’t see a mention of it in your post. Will this be operated separately? I see both, as per the PFS, have an expected CAPEX of $377 million (although the Merchant Project has a 25% contingency and the Integrated Project has a 20% contingency). Additionally, both are expected to have the same output and project life. These similarities lead me to believe that these projects are somewhat one in the same. However, the discussion of purchasing spodumene to process at the Merchant Project and analysis of it as a separate entity leads me to believe they are not one in the same. Are they separate entities? Is the Merchant Plant just the processing facility for the mine? Thanks for the clarification. I believe they are separate, but the similarity of some of these figures is causing some hesitation.", "score": 2, "replies": [{"body": "Good question. The merchant plant is now basically Phase 2 for PLL's chemical operations. It will be a separate lithium hydroxide chemical plant, the first being from the Integrated Project. After the Tesla deal in Sept, PLL obviously has to build the mine and concentrator (output SC6) and the chemical plant (output hydroxide) and this is the integrated approach.\n\nThe two projects like you pointed out were one and the same prior to Battery Day as in PLL needed to make a choice because they were capex cash constrained. Now they can and probably will do both after the Tesla deal and subsequent moonshot for the stock.\n\nThe capex for the lithium hydroxide chemical plant in the Merchant vs Integrated is equal because at that time they were one and the same, it was just a question of if they wanted to spend the \\~$180M for the mine and concentrator.\n\nSo long term, PLL will own the NC mine and concentrator, at least one NC lithium hydroxide plant and possibly one or more additional lithium hydroxide plants (i.e. merchant plants closer in NC or maybe closer to the coast for ease of shipping or could even be in Quebec near Sayona).", "score": 1, "replies": [{"body": "So does the $180 million get added on to the $377 CAPEX of the merchant plant under the PFS? Also, where did you find the $180 million figure? Thanks for the help, I appreciate the clarification.", "score": 1, "replies": [{"body": "Source is Investor Presentations from Sept 2020 and before: [https://ir.piedmontlithium.com/presentations](https://ir.piedmontlithium.com/presentations)\n\n2021 CAPEX Needs = $545M for Integrated Project (Mine + Concentrator + Chemical Plant)\n\nFuture additional 22.7ktpy Hydroxide Chemical Plants = $377 EACH (i.e. Merchant Plants)\n\n\\~$180M for mine + concentrator was overestimate, it's really $168M = $545M - $377M.", "score": 1, "replies": [{"body": "Thank you, I really appreciate the help. I’ve got much more clarity on the company’s operations now.", "score": 2, "replies": []}]}]}]}]}, {"body": "Man, I read your detailed summary a few hours too late.  I just started investing and found PLL a few weeks ago. I've made  a few hundred but when trading on the stock was on hold yesterday I thought they were just trying to limit small investors similar to GME and when the price dipped below my previously set limit I was all in.. now with the dilution I'm down a few bills.... Any projections when the stock will stabilize and bounce back? \n\nBTW Thanks for taking the time for breaking this company down and helping explain things for us Noobs.\n\nCheers!\n\nOh.. and how do I know what the actual #of shares a company has floating around or the actual Market Cap? Robinhood says the market Cap is 958.83M and on Piedmonts website it says 768M", "score": 1, "replies": [{"body": "Sorry so late I don’t check Reddit often. I’m guessing you invested right before they raised $150M+ money at offering price of around $70 per share. They’re a junior company and will put this money to good use towards their projects. \n\nLatest market cap will always be your broker like Robinhood or just google the ticker. Website is mainly good for links to presentation and press releases.\n\nIn terms of upcoming news, the scoping study that just came out actually should drive the stock. It shows the project in North Carolina (now called Carolina Lithium) should be very profitable. Piedmont is now in private project funding phase, announcing they hired Evercore and JP Morgan. They’ll now go around to see who wants to invest in Piedmont and own a % in exchange for $100Ms to build it. \n\nThis company has been hovering around $1B but if you stick with it, we should be rewarded at least by the end of the year and well into the future. They’re well positioned as the only US spodumene and lithium hydroxide project. And with pathways to expand with Sayona, this is a good investment.", "score": 1, "replies": []}]}]}
{"title": "BULLISH on $JNJ", "selftext": "Long time; first time\n\nTLDR; I like the stock. I like 1 shot. I like easy logistics. I like tested against variants. I like high protection against ‘prevented deaths and hospitalizations’. I like potential up-swing with vaccine approval. Don’t like lower overall effective % vs competitors. Don’t like rumored production limitations.\n\n\n\n\n\nFirst off, I hope everyone out there is staying safe during these crazy times. I’ve been learning a lot from being a lurker on here these past few months of quarantine/semi-quarantine life.\n\nNow, let’s get to the point. I’m BULLISH on Johnson & Johnson ($JNJ). A bluechip, long-standing American-based company founded in 1886, no.37 on F500, huge portfolio, nice dividends - shit ain’t goin’ anywhere. \n\nIn my opinion, JNJ’s upcoming vaccine will be a big step in the battle against COVID worldwide. I believe it has a lot of upside versus its competitors. JNJ has a large pool of resources and plenty of support from the Biden administration.\n\nJNJ’s vaccine is currently awaiting emergency authorization approval (hopefully by the end of the month), but everything seems to be looking good and vaccines are already being produced with partner $EBS. JNJ’s vaccine has a lot of advantages in the production/logistics dept., which is currently a problem for other vaccines. Things things I like:\n\n-Vaccine takes only 60-70 days to produce (Pfizer is 110 days)\n\n-JNJ vaccine can stay in STANDARD FRIDGE temperatures for 3 MONTHS (compared to sub-zero vaccines)\n\n-JNJ says 100m vaccines by this summer, probably making millions/billions more in foreseeable future (rumored production limitations)\n\n-SINGLE DOSE, easy logistics\n\n-More effective versus variants\n\n-65% effective overall but 85% EFFECTIVE PREVENT SEVERE CASES\n\n-Worldwide demand\n\n-JNJ taking same technology for vaccines/trials fighting against Ebola/HIV/Zika/more\n\n$JNJ and a lot of the healthcare industry are currently trending upward. I’m hoping it runs up short-term with vaccine approval later this month. Long-term BULL attitude as well, taking COVID vaccine tech and fighting other diseases. Safe investment, good dividends, potential short-to-mid term upside. \n\nThere is also a lot of MSM support with strong projections:\n\nhttps://money.cnn.com/quote/forecast/forecast.html?symb=JNJ#:~:text=The%2016%20analysts%20offering%2012,the%20last%20price%20of%20166.79.\n\nhttps://www.fool.com/quote/nyse/johnson-johnson/jnj/\n\n\nThis is purely speculation. I am an idiot. I just want us all to be safe, happy and make tendies. \n\nCurrently poor-ish and in for 10 @ 163. Hopefully buying more. \n\n\n\n\nOther sources:\n\nhttps://www.cbsnews.com/news/covid-vaccine-johnson-and-johnson-factory/\n\nhttps://www.nytimes.com/interactive/2020/health/johnson-johnson-covid-19-vaccine.html\n\nhttps://news.northeastern.edu/2021/02/11/heres-how-the-johnson-johnson-vaccine-compares-to-others/", "id": "lmao59", "created_utc": 1613612863.0, "score": 29, "upvote_ratio": 0.87, "num_comments": 25, "comments": [{"body": "I don’t buy the Bull on j&j.  Covid vaccine has been on there radar for weeks it’s in the stock.  Also with so many competitors and being late ...the market share is a pimple on the j&j ass.  It’s a long term dividend stock  not going to grow as much as moderna because the vaccine created their value... j&j already has value.", "score": 14, "replies": [{"body": "I think it gets approval bump, and slow'n'steady gain as it becomes popular/easy to distribute worldwide (plus future vaccines)", "score": 3, "replies": [{"body": "The approval bump is likely to be small. Regulatory bodies across major juridictions are signalling it's just a matter of time. In fact, the slow approval process can only drag the stock down. Throw in the fact that the vaccine is a small part of J&Js portfolio  and I don't share your optimism. Moderna, BioNTech and Novavax were the winning vaccine stocks and it's late to jump in now. With that said, J&J is probably a reasonably safe place to park some money. You won't lose it any time soon.", "score": 2, "replies": [{"body": "Sentiment and headlines go a long way. I'm thinking it gets a small bump with positive news and can continue to build off that longer term", "score": 2, "replies": []}]}, {"body": "Covid Baby Boom + vaccines will help send JNJ to the moon. I’ve wanted this asset for a long time but haven’t bought.", "score": 4, "replies": []}]}]}, {"body": "JNJ is much more than the vaccine. But the vaccine is a good one and should be embraced by those who don't understand or trust mRNA vaccines yet. I jumped in a small position a couple of months ago to overweight my exposure to them (also own large amounts of XLV and THQ). So far it has outperformed the S&P since I've been holding and I think there is good chance that continues this year, while at the same time also holding lower overall risk than the index. While not sexy, identifying lower risk companies that can match or even beat the index is also a part of my investing strategy.", "score": 8, "replies": [{"body": "Agreed!\n\nI also think they will get a sentiment boost with a successful vaccine, even if it's not a huge profit maker for them", "score": 3, "replies": []}]}, {"body": "Long loooong term value stock. Not sexy short term. Long term hold.", "score": 5, "replies": []}, {"body": "Isn’t JNJ producing their Covid-19 vaccine on a non-profit basis?", "score": 3, "replies": [{"body": "Basically, yes. The vaccine profit would be a rounding error. All stock change for jnj would have been hype around vaccine efficacy which was good but not great. I do not see any reputation bumps being significant enough.", "score": 3, "replies": []}, {"body": "Hoping more on sentiment / speculation short-term, building off that longer-term", "score": 1, "replies": []}]}, {"body": "Successful vaccine won’t cause much movement in stock price.  They make a lot of items from surgical implants to baby powder.  The vaccine profits shouldn’t be too high as that would be somewhat irresponsible during a pandemic.", "score": 2, "replies": [{"body": "Thinking more speculation / sentiment than bottom line $", "score": 1, "replies": []}]}, {"body": "I will keep buying more regardless of the COVID vaccine.  $JNJ is the bluest of blue chips, and if I had kids, it would be the first purchase I would make for their portfolio(s). Other than the recent bad press on their talc power products, it has to be the most wholesome company in the world. We're all sitting on the fence, but I believe that there was no coverup and that the testing (internal and external) was legitimate. I'm sure you can argue that, and I can't back it up with a list of bullet points.  So you win.\n\n$JNJ isn't going anywhere, and I will surely be purchasing one or two products from their extensive and diversified portfolio every month going forward for the rest of my life.  Their dividend will keep increasing like clockwork, for the rest of my life...letting me afford that Listerine...for the rest of my life. I will get rich while avoiding halitosis. \n\nI have a timeline for JNJ that exceeds my own. I will die before I sell these shares. COVID is too short term and a tiny portion of their portfolio for me to get too excited about it.  If COVID isn't wiped out and different strains are circulating rampantly...well I guess $JNJ may be more relevant in the COVID response than I realize.  I think the world will have too much to worry about at that point to figure out if it's a significant revenue source or not.", "score": 2, "replies": []}, {"body": "Buying because I still use their baby powder.", "score": 2, "replies": []}, {"body": "i would put my money into alt or gte before jnj they're just weird, feels?", "score": 0, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I'm hoping closer to $200 by end-of-year", "score": 0, "replies": [{"body": "well I hope so for you that would be awesome. highest its ever closed is $170 but with these crazy covid times who knows. just be aware that having the most awesome one shot covid vaccine in the universe does not equate to a soaring stock price.", "score": 4, "replies": []}, {"body": "Don't hold your breath on this. They're a solid company, but not focused on growth.", "score": 2, "replies": []}]}]}, {"body": "What is the benefit in owning JNJ over VOO?  I'm just wondering cause I just started some healthcare positions and was thinking of JNJ.", "score": 1, "replies": [{"body": "Hard to compare directly since one is an individual stock and the other is an ETF. JNJ is 'riskier' but it's all relative.", "score": 1, "replies": []}]}, {"body": "What's everyone's thoughts on a split? J&J has done most their splits before bw the $100-$150 price range, will there be a possible split in the near future?", "score": 1, "replies": []}]}
{"title": "KTOS: A Next Gen Tech and Defense Play", "selftext": "[deleted]", "id": "lmb8jc", "created_utc": 1613614607.0, "score": 46, "upvote_ratio": 0.96, "num_comments": 22, "comments": [{"body": "beautiful dd", "score": 11, "replies": [{"body": "Thanks, I appreciate the good words!", "score": 2, "replies": []}]}, {"body": "Even if it was a defense only play Kratos would still be in a fantastic position. \n\nHaven’t thought about this company in a while, I’m in tomorrow.", "score": 5, "replies": [{"body": "They actually make almost 3x more revenue from their cybersecurity, satellite, and consulting/training than their actual military drones. Definitely a growing market though, and one without a ton of competition in their niche space.", "score": 5, "replies": [{"body": "Oh no doubt, I was just saying if it were a defense play only it would still be a no brainer. To the moon as they say.", "score": 2, "replies": []}]}]}, {"body": "I discovered these people at 16 bucks and didn’t pull the trigger. Still annoyed about it. Came to the same conclusions. Drone warfare is the future.", "score": 5, "replies": [{"body": "I passed at $24, just came back to them this past weekend. Kicking myself, but still think  there's a ton of opportunity for growth.", "score": 3, "replies": [{"body": "I’m just waiting for an entry below thirty.", "score": 2, "replies": []}]}]}, {"body": "Excellent DD. I’m excited about this stock! \ndefinitely room to grow... Cathie Wood likes it to! So confirmation bias 101... absolutely see this fitting into ARKX. \n\nDisclosure - 300 @ 23.50", "score": 5, "replies": []}, {"body": "Got in at 22 for a few shares. Need to increase my position some more.", "score": 2, "replies": []}, {"body": "Awesome DD! I got a C 27.50 exp 3/19 and waiting to exercise it. I am sold bc it's in a Ark etf and they have been buying a lot of it lately.", "score": 2, "replies": []}, {"body": "Boy!", "score": 2, "replies": []}, {"body": "Yeesh I just roll my eyes when stocks are recommended at all-time highs.", "score": 0, "replies": []}, {"body": "In general its a good company for future defense", "score": 1, "replies": []}, {"body": "They’ve been around for a long time, what’s taken them through so many highs and lows?", "score": 1, "replies": [{"body": "They've definitely rebranded themselves over the past few years. I think we're just now starting to enter the time where both technology and demand makes autonomous possible, and that's really where Kratos operates. Whether it's military drones or domestic vehicles, it's really only recently become a thing, and not even a widespread one at that. \n\nWhile most people think they're a military company, the majority of their work is with satellite communications. Between the government's new interest in space, the Internet of Things, and the private sector's growing use of space (see Starlink, Azure, etc), I think they're in a unique position to capitalize on that growth in a way they weren't able to, say, ten years ago when they were just another cybersecurity company. \n\nThat, a flurry of new contracts that will have them busy for the next two years at least, and a growing bottom line makes them a company I think is just starting to see its potential, despite being around for awhile. It would seem that a lot of the institutional investors agree, but we'll see. Definitely more on the speculative and growth side.", "score": 1, "replies": []}]}, {"body": "I have a decent amount in KTOS and today was absolutely brutal. Still holding, but hoping cathie buys some after hours to provide a much needed bump", "score": 1, "replies": [{"body": "Downgraded by Baird to hold today, with a price target of $29. I think that's about accurate, $29-30ish is a fair price. I'm looking more at the future growth potential as those contracts keep rolling in. This is a multi year hold for me if all goes well. Definitely going to get a pop when ARKX goes live though.", "score": 2, "replies": [{"body": "Yea I think you’re right about it’s long term growth. I still obsess over the current price but would be better served forgetting about it", "score": 2, "replies": []}]}]}]}
{"title": "When's a good time to sell AMD", "selftext": "I'm thinking about selling AMD not because the market dipped today and I'm panicking but I need cash on the sidelines and it's the company I've done the least research therefore I don't understand the business as much as I would like to. Any recommendations on when to sell because I'm scared I sell after it goes up like 5% then surges to like 120 cus that's my luck.", "id": "lmc1wx", "created_utc": 1613617207.0, "score": 4, "upvote_ratio": 0.61, "num_comments": 26, "comments": [{"body": "Sell a chip company at the beginning of a chip shortage?", "score": 36, "replies": [{"body": "Lmao my thoughts exactly, and not just any business, one that is now making a run as the best in class.", "score": 24, "replies": [{"body": "Best in class is TSM. They made the latest chip for the iPhone 12s!", "score": 2, "replies": [{"body": "I am not talking about semiconductors, I just made graphics cards and processors. TSM, MU, and AMAT are my semiconductor plays and I think they will all do strong with the shortage happening currently.", "score": 2, "replies": []}]}]}]}, {"body": "I’d hold on to AMD (which is what I’m doing) I fucked up and sold my shares 3 years ago cuz I needed extra cash... recently decided to start investing again and was so mad to see its price now. Needless to say I bought back in... but if you really need cash now, I guess you gotta do what you gotta do", "score": 14, "replies": [{"body": "I don't need cash now I would just like to have it so when theres a dip I can add to my positions I already like, should I just reduce my position instead.", "score": -8, "replies": [{"body": "No. Buy more.\n\nAMD has the ability to become the market leader in consumer CPUs and potentially enterprise server CPUs.\n\nThey’re also competing fiercely in the GPU market and could potentially be a market leader there as well. If they play their cards right. (pun intended)\n\nAMD looks good for the long haul.", "score": 9, "replies": [{"body": "What’s your take on the new Apple cpu? Think it’ll hold up when the pro series comes out?", "score": 0, "replies": [{"body": "Well.. the new processors in their new computers are based off the same processors they put in their iPads and iPhones. \n\nThey’re extremely temperature efficient compared to Intel’s and AMD’s processors.\n\nNvidia just bought ARM which owns the architecture that Apple’s mobile processors are based on.\n\nLooking at Apple’s past decision making when it comes to unveiling new hardware and their current progress in processor development, I’d speculate that their processors will be very competitive in the laptop processor space in the next couple of years. \n\nTheir current processors are great. If they can get rid of Intel on their Pro models then it’s not looking good for intel if AMD knocks them off their PC throne as well.\n\nNot financial advice. I just like tech.", "score": 3, "replies": [{"body": "Yeah my thoughts exactly. If apple manages to redefine the way we use software, then this will be a real ground changer. Really love competition at a CPU level because the consumer is the one who really wins in the end.\n\nEdit: BTW don’t be surprised if we get better pro software performance on ARM based CPU’s. That’s apples next move.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I am in finance and have built my own computers since I was in 8th grade. Nvidia use to have the best graphics cards and AMD was shitty. Intel used to own the processor game too and AMD was no bueno but ever since AMD has gotten their new CEO they have been on a tear with some of the best in class products. Their processors are now better than intel in my own opinion and the value for money for the graphics card are very good too. I would say AMD is a hold with the need for super computer parts being at an all time high.", "score": 14, "replies": []}, {"body": "Oy. You should not be investing if this is what sets you into a panic.\n\nI’ll tell you this. Not every stock I’ve invested in has done well, but I regret nearly every stock I sold. Even Blackberry, which I sold six or seven years ago at around $6.55 a share would have been nice to own this year when it crested near $30. \n\nDon’t sell unless you need the money desperately, and definitely avoid selling short term gains, as the taxes will eat away at any profits.", "score": 6, "replies": []}, {"body": "At what price did you open a position in AMD?", "score": 5, "replies": [{"body": "about 88 but not recently a while ago", "score": 1, "replies": [{"body": "Idk, unless you have something else that you’re just itching to buy I don’t think it’s the worst idea to hold them and learn more. They’re in a market share war rn and if they keep taking more (which they likely will), they’ll only stay on the path they’re on.", "score": 3, "replies": []}]}]}, {"body": "It basically trades sideways now, so...whenever lol.", "score": 3, "replies": []}, {"body": "Well, as I’m about to buy AMD, I’d say hold. For years.", "score": 3, "replies": []}, {"body": "Chip shortage so if you really need immediate cash, may as sell it since AMD is probably gonna be low till chip isn't short anymore", "score": 2, "replies": []}, {"body": "Need more info. What is your cost basis? How many shares? How long have you held? General advice is to average out of a position depending on its size (ie. sell some shares everyday for a week or two)", "score": 0, "replies": [{"body": "My cost basis is around 88 I've held for a few months and I only have 6 shares but that's cause I'm a new investor and young. I'm thinking about reducing my position but with six shares I don't even know if it's worth it.", "score": 0, "replies": [{"body": "Thats ok. If you are really worried about AMD going up after you exit, then I would sell 1 share everyday for the next 6 trading days. This way you will pocket the average price of the the stock over the next week or so", "score": 3, "replies": []}]}]}, {"body": "Yesterday was the best day. The next best day is today\n\nDon't become a bagholder\n\nAlways cut your losses early", "score": 0, "replies": [{"body": "Da fuk?", "score": 3, "replies": []}]}, {"body": "Dude honestly, with this new ARM cpu from apple being integrated to the pros series, AMD and Intel are a hard pass. x86 will still rule for a while but it’s not future proof. \n\nMight want to start planning on investing on maybe semiconductor companies instead.", "score": -2, "replies": []}, {"body": "Sell now, it’s gonna be ranged bound for a while. You can buy back in at these levels later. This stock should already be @$120 after last earnings announcement. It’s failed to break above $100 a couple of times now.", "score": 1, "replies": [{"body": "I got out 5 months ago above 90....if this guy sells, I'm definitely back on board", "score": 2, "replies": []}]}]}
{"title": "Tesla stock, educate me", "selftext": "Hi everyone,\n\nI know TSLA is making ground breaking research and products... and I do believe 100% they will be a huge company in the future... However, the current stock price is crazy right, P/E of over 1000. Im not saying I don't love the company, but does anyone else think this is getting a bit crazy? Do you think there will be a huge TSLA correction, or is TSLA stock almost a commodity like Gold at this point and will continue to rise?", "id": "lmkjph", "created_utc": 1613647200.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 27, "comments": [{"body": "[deleted]", "score": 15, "replies": [{"body": " - it'll drop so fast", "score": 5, "replies": []}, {"body": "Well it’s true that the stock would tank for a while but the company would still be incredibly competent and its potential value just as high. So something happening to Elon is an argument not really worth discussing. Apple made it through losing Steve Jobs and Tesla would survive losing its CEO as well.", "score": 2, "replies": [{"body": "Let’s not confuse company created 45y ago with a one founded 18y ago. Steve left Apple when it was already giant steady ship. Tesla atm. is very much on uncharted waters with lots of hype and not so much fundamentals. So yeah I agree that there is high chance of downfall once it’s captain and visionary leave it.", "score": 3, "replies": [{"body": "The stock would fall because of peoples belief in Elon, but not because the company inherently lost a ton of value. Elon owns an 18% stake in the company so a lot of the decisions that keeps the company growing isn’t his. Sure the company would lose its biggest visionary, but with a company like Tesla all of its employees and more importantly its owners are already well versed in that vision and would work just as hard to keep it going.", "score": 2, "replies": [{"body": "No Elon no hype => no hype + lack of fundamentals = bankruptcy. Employees and owners can have a greatest plan but without funding it’s worth nothing 🤷🏼‍♂️", "score": -2, "replies": [{"body": "That’s simply not true. Elon’s hype is in his success in delivering great products, but the products wouldn’t stop existing if something happened to him. Do you really believe that in a company with hundreds if not thousands of engineers, he just sits down and invents the cars  himself?", "score": 1, "replies": [{"body": "Which great products? 500k cars, 150k called for a recall. Either way it’s such a small volume that can’t guarantee existence of this company. It’s really young company inside new market, everything is possible.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "If you rely on P/E as a guide you'd never have invested in Amazon or Netflix either think about it 👏🏻", "score": 4, "replies": [{"body": "I think Netflix is a good example but Amazon had a clearer path to profitability and larger revenue/growth. Much different than Tesla", "score": 1, "replies": [{"body": "Nah if you YouTube mainstream media commentary on Amazon you had plenty of doubters saying they could sell every book in the world and still not justify their valuation, it's exactly the same as Tesla. Visionary leader, massive total addressable market and a great team to execute.", "score": 5, "replies": []}]}]}, {"body": "Think a correction is due, currently selling off half my stocks in Tesla and unsure about the other half. A lot of debt and struggling to make profit; recessions looming which is bound to hit a lot of companies and the fact that it’s no longer the only player in the EV market - it’s bound to have an effect!", "score": 5, "replies": [{"body": "Yup this is the key imo, they no longer dominate the market. Almost all major car manufacturers have announced plans to have a large electric vehicle selection or be fully electric in the next 5-10 years. With many already having electric and hybrid models, they were insulated a bit more a year ago from large market drops but they’ll be feeling it next time it happens. \n\nWith Apple (and I’m sure the other large tech companies) wanting to develop their own self driving software and Tesla treating its mid level employees like mega shit, I wouldn’t touch it at these prices.And like others here have said, if anything happens to Elon or people realize they can’t make money selling cars lol then a large correction will happen.", "score": 6, "replies": []}]}, {"body": "P/E over 1000 is common in many of the huge companies when they started out. The company will be a multi trillion company in the future so no problem to buy and hold.", "score": 2, "replies": []}, {"body": "If they cant make money selling 500k cars (their profit comes from selling ev credits) I have no confidence they will ever make money...  this valuation is insanely high even down 75 percent...  the only thing they got going is everytime they want to borrow money or sell shares, tons raise their hands.\n(In 2020, Tsla raised over 20 billion from stock and new debt) these are facts. Numbers do not have opinions \nTsla was gme amc in early 2020", "score": 1, "replies": [{"body": "I haven't checked the math, but the other day someone suggested that Tesla may have made more profit in that one Bitcoin move than in their entire history of selling cars.", "score": 2, "replies": [{"body": "In their history and thats easy\nBecause in their history over 10 years all they have done is burn cash borrow cash, print new shares and lose money....those are the facts", "score": 0, "replies": [{"body": "I've got a friend who has around 90% of his portfolio in Tesla, and it kind of stresses me out a little on his behalf. He got in early enough that he should survive anything short of a truly catastrophic collapse, but still.", "score": 1, "replies": [{"body": "Sell half, take profits and get something else...thats honest and real advice", "score": 2, "replies": [{"body": "If I were in his place, that's what I'd do in a heartbeat.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You may want to consider factors such as short-term or long-term.\n\nEverything that goes up must come down at some point. Stock market is not a linear line up. Corrections are healthy and it's part of the game", "score": 1, "replies": []}, {"body": "If you 100% believe that they will be a huge company in the future, then why are you worried about a possible correction? In the end a drop in stock price wouldn't matter if you think they will be huge eventually. Invest in the long term.", "score": 1, "replies": [{"body": "I think this is a problem with many investors...  Buffets quote of its better to buy a bad company at a good price, than a good company at a bad price. so I think Tesla  will go up in value, however, the stock price is just too high. I think lots of EV companies are right now.", "score": 1, "replies": []}]}, {"body": "I've owned them since 2013 and haven't sold a single share.\n\nI like the stock", "score": 1, "replies": []}, {"body": "You are correct. Crazy overvalued. Car companies are not great profit business models. Making cars is expensive.  Tesla is growing but if that growth drops before they can truly get profitable then it drops like a stone.  Toyota PE is like 12.", "score": 1, "replies": []}]}
{"title": "AMC ENTERTAINMENT SOARS 14% ON REPORT AMAZON COULD BUY COMPANY", "selftext": "https://www.forbes.fr/business/amazon-sur-le-point-dacquerir-amc-la-plus-grande-chaine-de-salles-de-cinema-au-monde/amp/?__twitter_impression=true\n\nAMC (AMC) is rumored to have had conversations with Amazon (AMZN) about a potential acquisition, Forbes' Enrique Dans reports. According to the report, AMC's financial health has long been in question, and several analysts have argued the bankruptcy was just a matter of time, potentially putting Amazon \"in the position of a white knight coming to its aid.\"", "id": "lmntnr", "created_utc": 1613658067.0, "score": 10, "upvote_ratio": 0.54, "num_comments": 24, "comments": [{"body": "This is from last year.  Forbes writer must have huge bags they need to unload.", "score": 39, "replies": [{"body": "How is this even legal lol, it’s blatant pump and dump from the writers", "score": 8, "replies": []}]}, {"body": "This is old news from May last year!\n[source](https://www.google.co.uk/amp/s/www.forbes.com/sites/enriquedans/2020/05/22/amazon-goes-to-themovies/amp/)", "score": 43, "replies": [{"body": "OP for the win! with an updated Forbes article over your outdated Forbes article.", "score": 10, "replies": [{"body": "Lol. Big win with a well timed, rehashed, nearly year old article. 😂", "score": 4, "replies": []}]}, {"body": "Non-AMP Link: [source](https://www.forbes.com/sites/enriquedans/2020/05/22/amazon-goes-to-themovies/)\n\nI'm a bot. [Why?](https://np.reddit.com/user/NoGoogleAMPBot/comments/lbz2sg/faq/) | [Code](https://github.com/laurinneff/no-google-amp-bot) | [Report issues](https://github.com/laurinneff/no-google-amp-bot/issues)", "score": 5, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I did, yes.", "score": 1, "replies": []}]}, {"body": "You seem to be correct. Forbes France seem have rehashed the report.", "score": -5, "replies": [{"body": "It even says “At this point, this is only speculation.”  👍🏻", "score": 4, "replies": [{"body": "Oh of course, But goes for every takeover rumour to be fair. Rehashed or not.", "score": 2, "replies": [{"body": "Absolutely true.", "score": 2, "replies": []}]}]}]}]}, {"body": "Aaaaand it's down 10% from today's high already. \n\nRIP to anyone who thought they were climbing back on the hype train and bought over $6", "score": 5, "replies": []}, {"body": "I had 10 $6 calls deep in the hole. Aaaand wasnt online to sell when they were high green. Fuck my life", "score": 3, "replies": []}, {"body": "This shit reminds me of sears. Constant rumors we would get bought out by Amazon and it just never happened.", "score": 3, "replies": []}, {"body": "Yeah, year old rumour and it seems unlikely because streaming services are stealing market share away from movie theatres, so I’m not sure where the investment value is.", "score": 4, "replies": []}, {"body": "I’m not french", "score": 2, "replies": []}, {"body": "Didn't this happen before and it was the wrong AMC?", "score": 2, "replies": []}, {"body": "Can’t keep their dates straight with all that wine they’re suckin’ down", "score": 2, "replies": []}, {"body": "Hey SEC, this guy right here!", "score": 1, "replies": []}, {"body": "old news I believe", "score": 1, "replies": []}, {"body": "AMC CEO ain't giving up nothin", "score": 1, "replies": []}, {"body": "Rofl and back down again.", "score": 1, "replies": []}]}
{"title": "I have created an algorithm that tracks discussions across trading subreddits to try and identify buzzing stocks. Here's my results.", "selftext": "I created an algorithm that scans popular trading subreddits and logs when stocks are mentioned. It also analyses the posts and comments that the stocks are mentioned in and calculates the sentiment and context the stock is mentioned in.\n\nThe algorithm tries to track the overall hype and prevalence of the stock across the different subreddits, rather than simply calculating the amount of times the stock is mentioned.\n\n**How do I currently use this?**  \nNormally, I would browse different subreddits to try and learn about new stocks that are trending or being discussed. I would use those stocks as the basis of my due-diligence research over the next few days.\n\nWhat I found was that this was not only time-consuming, but by the time I had done my research, the stock had already shot up in price based on the news or events that were being discussed on Reddit, or simply from the fact that now everyone is aware of this upcoming stock.\n\nThe algorithm serves as an early detection system, allowing me to pick up stocks such as SRNE or PLTR before their big price shifts.\n\n**What is it not?**\n\nThis is an early detection tool, you should not base your investment decisions solely on the results of this algorithm.\n\n**Please do your own DD before investing.**\n\n**Results**\n\nThe results represent the most discussed stocks across the various sub-reddits over the last week, their price movement over the last 2-weeks *(first value in percentages)* and their overall bullishness sentiment score (second value, in bold, ranging from 0 (*negative*) to 100(*positive*)).\n\n[https://ibb.co/vk0hLL0](https://ibb.co/vk0hLL0)\n\nof the top 3 discussed stocks in there, **Aphria Inc (APHA)** **+45%** is the most interesting for me.\n\nThis was actually a stock my algorithm has identified for a number of days now, peaking a few days later, however given the continued chatter, and the long-term outlook for this stock, I think there is still a big upside for this stock.\n\nAphria Inc is a Canada-based international recreation and medicinal based cannabis distribution company. The Company’s Canadian cannabis operations are comprised of its Aphria One greenhouse facility (Aphria One), facilities held through its wholly owned British Columbia-based subsidiary, Broken Coast Cannabis Ltd. (Broken Coast) and its Leamington-based subsidiary, 1974568 Ontario Limited (Aphria Diamond).\n\nAPHA also manufacture and distribute bottled, canned and draft craft beers. The Company currently has established operations in Canada, Germany, Italy, Malta, Colombia and Argentina.\n\nWith a market cap of $5.9bn, it’s currently one of the largest cannabis companies globally, and will only grow even further once its merger with **Tilray (TLRY)** *(this is another stock my algorithm picked up on)* is complete.\n\nTo keep things brief, I will skip over discussing the merger in this post, focussing on the company financials and growth landscape instead *(I can cover this in detail if this is something people are after)*.\n\n**Revenue**\n\nAPHA has had consistent revenue growth, going from $237m in 2019 to $543m in FY 2020, an increase of **125%**. By comparison, its closest rival Canopy Growth Corporation had a revenue increase of **%76**.\n\nWhile revenue growth this year will be slightly subdued this year due to COVID supply issues and temporary closure of retail shops, pent-up demand (fuelled not only by a desire to make up for lost time, but also as a way for people to cope with the built-up anxiety of lockdown) and further mainstreaming of recreational cannabis products will only support growth long-term.\n\nIn November, Aphria purchased Sweetwater Brewing, one of the largest independent craft brewers in the US. This, along with the fact that TLRY has a contract with InBev, one of the largest beverage producers in the world, and the growing demand for more flexible ways to consume cannabis, opens up a completely new revenue stream. It’s price since that merger is up **311%**.\n\n**Politics**\n\nIn the US, Democrats now control all of Congress, Senate and the White House. Their more progressive stance on recreational drugs compared to the previous administration means decriminalisation at a federal level is a lot more likely. This is highlighted by Chuck Schumer’s announcement that a draft of the bill be introduced at some point H1 2021.\n\nFull US decriminalisation not only unlocks a massive market, but also places focus on European countries to follow suit with full de-restriction and regulation (this is already happening in some countries, with France currently undergoing a public consultation).\n\nWhen this happens, Aphria’s European operations and scale means they can go to market at scale quicker than most rivals.\n\n**Possible downsides**\n\nCannabis stocks are volatile stocks at the best of times, given the hype that has emerged on WallStreetBets surrounding this sector in the last few days, expect price to be volatile, with some more potential downside as the hype cools down.\n\nFurthermore, some analysts are skeptical of the true size of the recreational cannabis market, suggesting growth has plateaued, pointing to sub-par market performance compared to projections historically. Personally, I believe this is all short term, as the market becomes more embedded and accepted, we will see more ‘casual’ users entering the market.\n\n**Summary**\n\nUnderneath all the volatility, APHA has some solid fundamentals that stand out compared to peers in the sector, that’s without taking into account the TLRY merger, which personally I believe will be a game changer.\n\nIn terms of investment play, this is a long-term hold, so if you are interested prepare to purchase and hold for 2–3 years. There is lots of volatility surrounding the stock, especially currently, I would suggest a small portfolio allocation, entering either before the merger, or before US decriminalisation if you miss that boat.\n\n# What’s next?\n\nIf people find this content useful, I plan on sharing this on a regular cadence, along with providing some of my commentary and DD on these stocks, so you can garner a better idea of what the stocks are about.\n\nPlease share this with friends who may find this type of content useful. The more this is received the more time I can dedicate towards stock education for the masses.", "id": "lmobc0", "created_utc": 1613659525.0, "score": 112, "upvote_ratio": 0.9, "num_comments": 19, "comments": [{"body": "It would probably be wise to use this algo and buy the ones that aren’t talked about a lot on here.", "score": 28, "replies": [{"body": "That's a bold strategy, Cotton!\n\nIt is actually an interesting data point to consider. On one hand the hype can help drive up the price, but I'd also be willing to sell as soon as the price dips for any stock popular on Reddit.\n\nI notice that the stocks I actually like do better and are more consistent when volume is low. Momentum traders screw it all up.", "score": 3, "replies": [{"body": "I was just going by ‘anything reddit says its usually a good idea to do the exact opposite’", "score": 0, "replies": [{"body": "I think it depends on the sub, and consistent support when a stock isn't popular is good. I feel like this sub has some well informed investors that give good insight.\n\nBut when it reaches the masses and things get hyped because someone else hyped them, then it gets cloudy. I can't tell whether the big investors are taking an anti-reddit strategy or whether reddit just fuels risky plays.", "score": 1, "replies": [{"body": ">But when it reaches the masses and things get hyped because someone else hyped them, then it gets cloudy.\n\n\n\nHaha, that's funny. You think reddit is in any way some underground platform? It has more visitors daily then Facebook! WSB alone has as more subs then most Scandinavian countries have *population* and anything mentioned here is posted to WSB and countless other subreddits (just look at this very post being cross-posted).\n\n\n\nAdd to this YouTuber, Tiktokers and other \"influencers\" just reading whatever they see rising on /r/new regarding investing. Reading here mean its old news, reading it here means hedge funds have had ample time to prepare and to push their narrative via bots/bought accounts (silver anyone? BB hype? Nokia? AMC? Purple?)", "score": 1, "replies": [{"body": "My point was that when it crosses over from DD by individual investors (proving their case with data) to \"the masses on Reddit,\" then some people are hyping stocks based on the hype and not the fundamentals.\n\nWhen there's popular support on here for an unpopular (overall) stock, I interpret this to mean the stock is quality and has loyal fans. However, when there's popular support for a popular stock, it's hard to tell whether it is quality or just hype.", "score": 1, "replies": []}]}]}]}]}, {"body": "You're probably right now that the cat is out of the bag and all the hedge funds are doing to the same thing.  Back before gamestop blew up though, this probably would have been a pretty good momentum investing tool.", "score": 2, "replies": []}]}, {"body": "I plan on making an algorithm that will sell any holding that gets mentioned on here or WSB", "score": 15, "replies": []}, {"body": "[removed]", "score": 6, "replies": [{"body": "Also interested  😄", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "That already exists", "score": 1, "replies": []}]}, {"body": "Would be interesting to see, please do.", "score": 2, "replies": []}, {"body": "Put it up on Github", "score": 2, "replies": []}, {"body": "Good job! Thank you!", "score": 1, "replies": []}, {"body": "This content on something bot blown out of proportion would be interesting.", "score": 1, "replies": []}]}
{"title": "Nvidia Announces New Chips Designed for Mining Ethereum", "selftext": "Ethereum is a Crypto Currency that I've been keeping my eye on for a while but it's still surprising to see Nvidia is focused solely on it.\n\nI'm curious to hear how you all feel about this news. Would it be worth investing more money into ETH instead of Bitcoin?\n\nAre there any other Cryptos you guys recommend?", "id": "lmyd5s", "created_utc": 1613685187.0, "score": 50, "upvote_ratio": 0.89, "num_comments": 28, "comments": [{"body": "If only there was a limit on ETH, it would have been perfect.", "score": 24, "replies": [{"body": "I thought ETH was capped at 18 million a year? Please correct me if I'm wrong.", "score": 9, "replies": [{"body": "It can be increased.", "score": 9, "replies": []}]}]}, {"body": "Its strange given the fact that the ETH devs are planning to end ETH mining in the next 1-2 years", "score": 16, "replies": [{"body": "What happens in 1-2 years then?", "score": 2, "replies": [{"body": "They are changing the way transactions are verified. Currently they use proof of work (mining) and are going to be going to proof of stake (which is where people that already own ETH \"stake\" it to prove transactions and earn interest on it) instead.", "score": 6, "replies": []}]}, {"body": "Vaporware", "score": 0, "replies": []}]}, {"body": "I’d say yes we’re on the verge of 2k once we hit that I have a feeling it’s going to skyrocket", "score": 9, "replies": [{"body": "Do you know much about Ethereum tokens, such as Maker?\n\nI'm not sure what makes them different but they seem to be doing well. Any advice here?", "score": 3, "replies": []}]}, {"body": "Etherum has to fix expensive fees, or the gen 3.0 alts gonna take his throne (it is already losing popularity -- think of creating a game on ETH chain and have to pay 100Eur plus for a transaction -- unfeasible). This should be solved with Eth 2.0, we will see when it will be deployed... I still have ETH, but my best pick is Cardano (ADA), then I also have some Link, Dot, Bitcoin and Tezos...", "score": 8, "replies": [{"body": "ADA and NANO is da way", "score": 8, "replies": []}, {"body": "Interested perspective. What is it about Cardano that makes it your favorite?", "score": 2, "replies": [{"body": "In theory, it's the perfect crypto -- and it was developed with purpose of evolution, but things take way longer to get done, cause the team wants to get it done right. I like the vision of Cardano, and they literally thought of every fckin detail... check the details of just naming the varius part of blockchain here [https://www.youtube.com/watch?v=G2Tv1\\_tNYWo](https://www.youtube.com/watch?v=G2Tv1_tNYWo). If you have time, you can check Charles Hoskinson, and listen to some of his vision.\n\nFrom the bussines view: ETH volume 17.75 B, ADA 14.8 B. Then check the fees paid to miners. ETH 29 000 000$, ADA 4000$. You can see why ETH miners dont want to see Eth 2.0 deployed, since they are cashing really well here.\n\n&#x200B;\n\nEdit: other alts solve the fees problem aswell, I am biased on ADA cause I love the project ofc :)", "score": 3, "replies": []}, {"body": "Cardano was dev'd from the perspective of \"take your time and build it right the first time.\"\n\nEthereum was dev'd from the perspective of \"release it now, fix it later\"\n\nIn that light Ether was able to capture the market position quickly, but as prices rise it is showing its faults quickly. Of you notice every time Ether has a big bump, Cardano will follow a few weeks later as more and more Ether devs can no longer afford the has fees and need to move to a more price efficient platform.", "score": 1, "replies": []}]}]}, {"body": "Anyone see Bitfarms BITF today? Newer bit mining company gaining fast and news of adding another 4,500 miners by months end Came out today. Maybe a good time to get in while its lower. I made some good gains off it today and i think it will only go up from here.", "score": 4, "replies": [{"body": "Can you elaborate on this? Which currencies are they mining?", "score": 3, "replies": [{"body": "I know HIVE mines ETH and I believe BTC.  I got in last Monday, and I'm already up 100%.  Just leaving penny stock territory.", "score": 2, "replies": [{"body": "HIVE is a good one, as if ARBKF (Argo, based in London). Have had my eye on Bitfarms as well; it surged nicely today but is down big in the afterhours.", "score": 2, "replies": [{"body": "After there upgrade is complete lets see where it goes.", "score": 1, "replies": []}]}, {"body": "Bitfarms BITF is behaving similar to HIVE but i believe BITF can mine faster and they are in process of adding 4500+ more computing.", "score": 0, "replies": []}]}, {"body": "[https://bitfarms.com/app/uploads/2021/05/2021-05-07\\_\\_Nasdaq-Approval-FINAL.pdf](https://bitfarms.com/app/uploads/2021/05/2021-05-07__Nasdaq-Approval-FINAL.pdf)", "score": 1, "replies": []}]}, {"body": "[May 7th 2021 news](https://bitfarms.com/app/uploads/2021/05/2021-05-07__Nasdaq-Approval-FINAL.pdf)", "score": 1, "replies": []}, {"body": "Damn you called this.", "score": 1, "replies": []}]}, {"body": "Good for both right?", "score": 0, "replies": []}]}
{"title": "Is WAYMO beating Tesla at the driverless car race?", "selftext": "", "id": "lmeqn6", "created_utc": 1613626080.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 22, "comments": [{"body": "Nope", "score": 21, "replies": [{"body": "I got banned from /r/selfdrivingcars for laughing at someone who said that Tesla isn't even competing with Waymo because they and Mobile Eye are so far ahead.", "score": 10, "replies": [{"body": "Hah, not surprising.  Waymo has no chance imo, Tesla or not.  If you can't make it happen in a decade with unlimited resources, you can't make it happen period.", "score": 12, "replies": [{"body": "WAYMO seems to be talking a big game like they are not even in the same league as Tesla. It is hard for me to figure out who is bluffing", "score": 4, "replies": [{"body": "WAYMO may not even think they’re bluffing..  But they’re deceiving themselves if they think HD maps and LIDAR can get them to a *scalable* level 4 solution.", "score": 3, "replies": [{"body": "and 5kw of server racks in the trunk that cost $$$", "score": 2, "replies": []}]}]}]}]}]}, {"body": "If waymo is ahead then they need to lift their gag order on the very select few people that get to use their system in beta in Phoenix. \nTheir cars repeatedly get stuck just feet from their destinations and need to have tech support or a driver come out and reset the vehicles. All the while they can’t get out of the vehicle. \nTheir solution to level 4 will NEVER be able to scale up in our dynamic world.", "score": 7, "replies": [{"body": "How often does this happen approximately? I think WAYMO releases the info about how much they are required to intervene, but that could just be in California where they are required to do so. That is scary they are stuck in the vehicle.", "score": 3, "replies": [{"body": "I’m not sure on the frequency. There is probably a safer way to get out if need be in emergency. I’m sure safety is the reason they don’t want you to get out until the ride is complete. If there are issues on the ride the car will cash tech support who can troubleshoot or passengers can request support. If they can’t figure out the issue they will deploy a live tech to response in person who patrol the area waymo services. \nI’d love to see some comparison routes in Phoenix between waymo and FSD. \n\nIf you want to see some live results that isn’t cut off by the embargo look at this guys YouTube. \n\nhttps://youtube.com/c/JJRicksStudios\n\n\nFYI after it rains waymo requires safety drivers behind the wheel unroll deemed safe. No wonder they are testing in Phoenix and now Cali.", "score": 1, "replies": []}]}, {"body": "That is technically still ahead of Tesla if you count what it actually does in the rolled out service, since they at least let it get that far.", "score": 1, "replies": [{"body": "As a testing ride service yes. So far Tesla instinct in the service business yet with driving. Once they are happy with fsd for consumers then they’ll go for the service of robotaxis. \nAt this point trying to compare the two is like apples and oranges.", "score": 1, "replies": []}]}]}, {"body": "Waymo is ahead in a subsection of Phoenix, that's it.", "score": 4, "replies": []}, {"body": "Waymo currently operates publicly available driverless cars in Phoenix, level 4 autonomy, the only company in the world that does it. So, yeah they deserve some credit and could be seen as in the lead. Tesla is aiming for a much more scalable and robust form of autonomy though that is not geofenced, so they really are kinda just doing two different things.", "score": 14, "replies": [{"body": "Waymo also modifies routing to avoid unprotected left turns whenever possible, because their vehicles struggle with that maneuver. \n\nWaymo and Tesla are two companies trying to create the same technology but going about it in different ways. There's nothing wrong with that. We'll know who is \"ahead\" when one of them has a commercially-viable publicly-released product to evaluate.", "score": 3, "replies": []}, {"body": "Correct me if I'm wrong, but WAYMO has also tested their cars throughout the entire US? But Tesla has real-world data from their actual users of the cars. I think WAYMO claims they have the most real-world and virtual miles that is fully autonomous, but Tesla presumably has much more data overall. Can Tesla use this data from its users to propel them over WAYMO?", "score": 1, "replies": [{"body": "Different coding and sensors. It would be the same as me giving you a book in ancient Hebrew and you have no translator.", "score": 0, "replies": []}, {"body": "In theory yes Tesla has way more miles of data in a larger fleet that they can utilize to train their autonomous system faster than waymo", "score": 1, "replies": []}]}, {"body": "I think they both have their uses and the more companies doing this and legitimizing it, the better it is for everyone. I just see Waymo as more of a shuttle that can go specific places and a Tesla can go anywhere. The Tesla is also a Tesla which I’d rather drive in than a Waymo van.", "score": 1, "replies": []}]}, {"body": "Imagine saying that you are far ahead, when Tesla has approximately 1000 times more data than you....lol", "score": 4, "replies": []}, {"body": "Even if you assume Waymo to be ahead right now, that does not mean the race is over as they can not quickly scale up operations the way Tesla can.\n\nWaymo cars cost almost 200k USD and production capacity for millions of Waymo robotaxis does not exists.\n\nWhen Tesla gets to robotaxi level quality software they can quickly deploy the software to a big number of existing vehicles and has a millions-scale production capacity for new vehicles.", "score": 3, "replies": []}, {"body": "Without watching the video and with NO intention whatsoever to watch it: NO.", "score": 1, "replies": []}, {"body": "Betteridge’s Law of Headlines", "score": 1, "replies": []}]}
{"title": "Tesla reduces Model 3 and Model Y prices, now starts under $37,000", "selftext": "", "id": "lmhpnb", "created_utc": 1613636327.0, "score": 82, "upvote_ratio": 0.96, "num_comments": 22, "comments": [{"body": "This is the usual misleading Electrek title by /u/fredtesla, which falsely suggests that Tesla only dropped prices.\n\nThe real news is that Tesla has adjusted US pricing:\n\n**Model 3** | new price | old price | Δ\n--|--|--|--\nModel 3 SR      | $36,990 | $37,990 | -$1,000\nModel 3 LR-AWD  | $46,990 | $46,990 | .\nModel 3 P       | $55,990 | $54,990 | +$1,000\n\n\n**Model Y** | new price | old price | Δ\n--|--|--|--\nModel Y SR      | $39,990 | $41,990 | -$2,000\nModel Y LR-AWD  | $49,990 | $49,990 | .\nModel Y P       | $60,990 | $59,990 | +$1,000\n\nFrom survey stats and from certain country statistics that breaks out by model (such as the UK) Tesla is probably selling more LR-AWD + Performance units than SR units - so the net effect on ASP is about a $500-$700 price drop - more than countered by recent margin improvements.\n\n(There were a lot of one-time margin headwinds in Q4 that are expected to go away in Q1.)", "score": 29, "replies": [{"body": "No mention by them of Model S and X pricing going up.\n\nIn addition, the pricing on the SR has been moving towards the price they originally projected. I think with this most recent price change they are about there.\n\nFinally, in terms of marketing for those who can come up with the money there will be tremendous desire to buy the LR models as they offer sufficient range to make longer drives a bit more relaxing.", "score": 2, "replies": []}, {"body": "What are you calling the Q4 margins headwinds?", "score": 1, "replies": [{"body": "not OP but guessing capital outlays for Berlin/Austin/Shanghai", "score": 2, "replies": [{"body": "Also, their battery facility.", "score": 2, "replies": [{"body": "Kato Rd.? Would that go under R&D?", "score": 1, "replies": [{"body": "Doubt it. Elon said they ordered the equipment for commercial production if I remember correctly.", "score": 1, "replies": []}]}]}]}, {"body": "We don’t know exactly but Zach mentioned it in the earnings call. He said that margins were down in Q4 but only because of some unknown one time expense, otherwise margins would have improved from the previous quarter.", "score": 2, "replies": []}]}]}, {"body": "Can't wait for all the FUD blathering on about demand concerns...", "score": 10, "replies": [{"body": "I've already heard people say it's a response to the new Bolt coming out ... ROFL. \"Competition\"", "score": 5, "replies": []}, {"body": "U got it! Price down is demand, price up is margin concerns", "score": 5, "replies": []}, {"body": "busted growth story", "score": 2, "replies": []}]}, {"body": "Inching towards to 35k again. Yet another FUD talking point will be gone.", "score": 5, "replies": [{"body": "There's always \"lowering prices means no demand\".", "score": 5, "replies": []}]}, {"body": "Canada next please!", "score": 4, "replies": [{"body": "Yes please.\n\nAnd they also need to adjust for currency conversions. CAD has been much stronger in the past 6 months.", "score": 3, "replies": [{"body": "Actually ya that's a VERY good point.\n\nAdjusted for current rates; the Model 3 SR+ should be $46,774 CAD\nBut instead it's still showing as $52,990!\n\nWtf Tesla, let's get an update here already", "score": 1, "replies": []}]}, {"body": "Didn't effect Canada?", "score": 1, "replies": [{"body": "Not according to our website no :(", "score": 2, "replies": []}]}]}, {"body": "are these prices still plus the $1200 \"delivery fee\"?", "score": 2, "replies": [{"body": "Just double checked my order and the Destination Fee is now $1,215.00.", "score": 3, "replies": []}]}, {"body": "you can now get a tesla for less than a bitcoin.\n\ncan we now start referring to the price of things in terms of fractions of a tesla?", "score": 1, "replies": []}]}
{"title": "Tesla Bear Gordon Johnson: EV Price Cuts Point To Softening Demand", "selftext": "", "id": "lmvu0u", "created_utc": 1613678684.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 21, "comments": [{"body": "Every time Gordon speaks is when you buy.", "score": 23, "replies": [{"body": "I think he is paid by a hedge fund to give some bearish outlook right after they buy weekly calls.", "score": 9, "replies": [{"body": "Because of the huge impact Gojo still has.\n\nHonestly I’m surprised they even still use him.", "score": 6, "replies": [{"body": "I was being sarcastic. Why would you pay someone to say something bearish after you buy a call, unless the stock goes opposite whatever he says.", "score": 3, "replies": [{"body": "So hard to read online!\n\nI read it as ‘he says this, then right after they buy calls’\n\nGlad we’re on the same page. Still boggles me someone likely pays him.", "score": 2, "replies": []}]}]}, {"body": "Does he manage more money than Mark B.S.?", "score": 1, "replies": []}]}]}, {"body": "TSLAQ : lower price   = no demand, higher price = no demand and TSLA have to make up for lost revenue.", "score": 8, "replies": []}, {"body": "I only have 61.5 shares of Tesla right now, I’m fine with these people trying to keep the price low so I can slowly add more since I didn’t get in until July 1st of last year.", "score": 3, "replies": []}, {"body": "Just to be clear the SR dropped $1K whereas the performance versions had price increases. Further the whole Model S and X line saw significant price increases.\n\nGuess softening demand is the answer.\n\nBtw... \n\nM3 delivery times (to NY) are 3-6 weeks\n\nMY SR & LR are 2-6 weeks and Perf is 3-6 weeks\n\nMX is May-June delivery\n\nMS LR is 5-11 weeks and Plaid is 3-8 weeks (Plaid+ not produced yet)\n\nFor a company facing this softening of demand and who can't sell their cars they are sure slow at being able to make and deliver these things.", "score": 5, "replies": [{"body": "I mean, it's literally the definition of \"cherry picking\" data. Tesla lowers the price of some Model 3 versions, and he lists every decrease in every different country (some of which hadn't been adjusted in awhile and were getting out of whack with the USD price). At the same time Tesla raises the price of some Model 3 versions ... and he completely ignores it.\n\nThere's no chance that anyone who's competent is listening to this guy, regardless of their thoughts on Tesla. He's being interviewed to intentionally mislead idiots and get views/clicks.\n\nHe's ranked 7,172 out of 7,322 Analysts on TipRanks. There's only 150 analysts that have been worse then him (and I'm sure none of them are ever on CNBC). His average return per rating is -10%. It's actually somewhat difficult to find an analyst that has a worse track record than him. You could make a decent return just doing the opposite of everything he's said. He'll say things like \"Tesla is a busted growth story\" while also predicting that Tesla will sell more cars in the next quarter. \n\nHe's got zero credibility, and anyone from any site that gives him a platform is just chasing clicks and doesn't care about anything else.", "score": 6, "replies": [{"body": "I know. I remember when he had a $19 (I think it was that) price target on Tesla (post-split). I see he upped it to $67, so a modest 3.5X increase in his price target.", "score": 1, "replies": []}]}, {"body": "They always say end of quarter for the 3 and Y. Theyre in stock in various places in the country.", "score": 1, "replies": []}]}, {"body": "Mods, Can we just ban Gordon Johnson stuff? He never makes any valid criticism of tsla", "score": 2, "replies": [{"body": "I'm ok with GoJo. At least for the entertainment value. Otoh, it's always good to know the bear thesis and decide for yourself its merits", "score": 4, "replies": [{"body": "fair", "score": 3, "replies": []}]}]}, {"body": "One day he might be right about something & no one will listen", "score": 2, "replies": []}, {"body": "Moron.", "score": 3, "replies": []}, {"body": "Gordon Johnson, I love you! we lost all of our other bears that were keeping the price down. get this guy on CNBC!", "score": 2, "replies": []}, {"body": "If Gordon Johnson says it then it’s true going to sell TSLA for NKLA\n\n/s", "score": 1, "replies": []}, {"body": "I'm sure he thinks it was a huge mistake for them to buy Bitcoin as well, what a moron.", "score": 1, "replies": []}, {"body": ">\tTesla has now reduced the prices of its cars 13 times in 2021 alone\n\nThis is worded to read as if Tesla has had to initiate 13 *rounds* of price cuts in the last 1.5 months. \n\nThen he proceeds to list individual cuts to 3 vehicles in 2 markets and counts those as 4 separate price cuts. SMDH", "score": 1, "replies": []}]}
{"title": "Currently not full theta gang. Almost my entire account is just $TSLA shares. Im considering selling all my shares (made $14k off them) and doing the wheel. Is this a good idea or am I tripping?", "selftext": "", "id": "lmbdoz", "created_utc": 1613615062.0, "score": 9, "upvote_ratio": 0.69, "num_comments": 28, "comments": [{"body": "I am a broke college student as well", "score": 12, "replies": [{"body": "You are tripping balls. The taxes even just on a 30% gain won't be worth it.", "score": -23, "replies": [{"body": "Gains a gain idk what your smoking", "score": 19, "replies": []}, {"body": "this makes zero sense. He would only pay portion of his gains as taxes so he would still make a net gain overall", "score": 7, "replies": []}, {"body": "Nephew please", "score": 3, "replies": []}]}]}, {"body": "The smart advice (I think) is don't invest your entire portfolio into wheeling. But I am also a broke college student so honestly if I was in your position, I would do some put credit spreads and poor man covered calls cause wheeling requires a lot of money and thus will take up a large portion of your portfolio quickly.", "score": 12, "replies": [{"body": "Yeah, I’m asking cause I lost 6k in the past couple weeks on put credit spreads lol", "score": 3, "replies": [{"body": "Interesting, how have you done your put credit spreads before? I've done some put credit spreads and although I haven't been doing it for long, I've never lost on them. I've lost on call credit spreads though so I stopped.", "score": 3, "replies": [{"body": "I was selling weekly put credit spreads on tsla for about a month and a half. It worked till it didn’t", "score": 3, "replies": [{"body": "hm yeah, if I were you I'd change the setup, although I don't know how far your legs were. Usually the general setup is to go 30-45 DTE, sell the put at 0.30 delta, collect 33% of the strike width in credit, manage position at 21 DTE or close for profit. High IV environment is ideal according to tasty trade, but honestly some people just do put credit spreads on $SPY cause it's such conservative ETF (you won't be able to collect 33% premium, it'll probably be around 20% but that's fine, probability of winning is better). If you are going to choose high IV stocks, look to enter after a red day for better entry. That's how I've been doing them", "score": 6, "replies": []}]}]}]}]}, {"body": "Never ever put all your money in one single stock except EFTs no matter whether you wheel or not.", "score": 13, "replies": [{"body": "What I learned is never follow any \"rules\" and you should take decision based on your financial situation and risk appetite", "score": 3, "replies": [{"body": "YOLO is not a sustainable strategy", "score": 2, "replies": []}]}]}, {"body": "Since I'm short TSLA, it's in my best interest to recommend you to sell your shares. ;)", "score": 2, "replies": []}, {"body": "Word of wisdom from a seasoned trader;\n\nScale out of your position, for instance sell 20 % at $800, 20 %  at $ 820, 20 %  at $ 850, keep 40 % for a more discretionary exit or set a stop loss order at $ 740 and a take profit at $ 875 for that remaining 40 %.\n\nRemember S&P and Nasdaq are close to big milestones, 4 000 and 14 000, which are likely to be reached soon, after that we may be in for a 10-15 % market correction. S&P at 4 000 and I will exot most of my positions regardless of which ticker it is and wait to buy back lower.", "score": 3, "replies": []}, {"body": "You should have been dollar cost averaging for the past 5 months.", "score": 0, "replies": [{"body": "My cost average is $250", "score": 4, "replies": [{"body": "What does that have to do with anything? U should always take a little profit out here and there as the stock goes up. And  if it goes down u can buy a little. I was going to try and show u a screen shot but this damn app won’t let me. Anyways I got I. At $42. LOL. Been taking profits out all year. It’s way over priced and will go down. Always be safe and do what I just said and u will be good", "score": -6, "replies": [{"body": "I thought you were talking about buying. But Yeah I might sell", "score": 3, "replies": []}]}]}]}, {"body": "[removed]", "score": -16, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}]}]}, {"body": "With any directional trade like the one you are proposing it's impossible to predict if what you are suggesting is a good ideal.", "score": 1, "replies": []}, {"body": "I would probably sell off some shares and start wheeling a few stocks. It's never a good idea to hold your entire portfolio in one stock. Imo sell some and start the wheel on a stock you want to own", "score": 1, "replies": []}, {"body": "I think you would be wise not to put all of your eggs in one basket in general. That's the investing equivalent of playing roulette and going \"put it all on black\" and hoping for the best. \n\nMy suggestion: Time a liquidation of some shares when you feel comfortable doing so, and diversify accordingly.\n\nWheeling your entire principal balance in one stock holding, in general, isn't wise. The tax consequences on capital gains from wheeling TSLA all year could be pretty heavy as well.\n\nI suggest doing a healthy mix and focusing long-term. \n\nThis isn't the best example, but a 40/60 is pretty reasonable. 40% to trade theta strategies, and 60% in either cash hanging out while you wait for opportunities or invested into long-term holdings of your choice. Then kind of finagle that % around as IV expands or contracts.", "score": 1, "replies": []}, {"body": "Why not start by selling covered calls on your TSLA stocks, and have them called away over time? And whenever a call gets assigned, wheel the free'd up cash into something else.", "score": 1, "replies": [{"body": "I don’t have 100 shares", "score": 2, "replies": [{"body": "Ah sorry, I didn't calculate correctly. 😕", "score": 1, "replies": []}]}]}]}
{"title": "T+2, and why Citadel is winning tomorrow", "selftext": "Looking through the prepared testimonies for tomorrow, you will notice that (for good reason), there is a paucity of discussion regarding the mechanisms behind the price action of GME, and (from Vlad’s testimony), a great deal of discussion regarding the mechanism of factors that contributed to trade halting.\n\nOne factor that keeps being brought up, both by RH and Citadel, is the logistics and capital requirements of delayed settlement.\n\nhttps://docs.house.gov/meetings/BA/BA00/20210218/111207/HHRG-117-BA00-Wstate-GriffinK-20210218.pdf\n\nEnter T+2. \n\nAs an uncertified crayon-eating degenerate, the concept of delayed settlement is something that I was vaguely aware of, but didn’t really care about, because as long as the tendies are on my dashboard, who cares what the Wendy’s kitchen looks like. And for the majority of the lowlifes here, it likely has minimal impact in the way you trade (unless your margin YOLO goes horribly, horribly wrong). But for the big boys, it’s a bit different.\n\nFor the children who are hopping in for the first time, imagine a scenario where a bunch of apes are trained to gamble in a casino with chips. Each game is played, chips are moved around second by second, but the apes don’t materially walk out with changes in cash money until you trade the chips for money. The casino is taking care and tracking these things for you, and you don’t think about it too hard because you walk away with what you’re supposed to. But the pit boss is always watching what’s going on, and moving the cash in the back to make sure things run smoothly. Historically, this delay (measured in days) helped the boomers and ancient folk settle the paperwork involved in trades, and has continually gotten shorter over time.\n\nT+2 is actually an acceleration of the settlement process. In 2017, the SEC finalized their move from T+3 to T+2 as standard for most market transactions. Yes, there’s variability, and some are already on a T+1 schedule, but for the most part that’s where we stand.\n\nSo why does it matter? Why does Citadel, and their hand up Vlad’s puppet ass, focus in on that as the intervention that the likely paid off investigatory committee should focus on? While I don’t have the internal data to support it, in theory, and even as stated previously by the SEC’s own press release, having acceleration of the process to keep up with technological advances has a number of benefits.\n\n https://www.sec.gov/news/press-release/2017-68-0\n\nAgain, why does this matter? To you and me, I doubt you notice it much. To the big boys, it means a lot. At that macro level, liquidity gives you volume, and volume gives you profits. By reducing the barriers to settling trades, they can minimize risk to margin, improving liquidity, and thereby allowing them to perform more trades per unit time.\n\nIn the grand scheme, if this goes as planned, Citadel and other MM’s will likely come out ahead in this case. The few billion they had to pay is likely a reasonable price for having a push to T+1, where they can theoretically continue to accelerate their capital growth on the scale of tens of billions of dollars over the coming years. Melvin’s got their panties in knots, and rightfully so, for getting completely fucked, but Citadel may yet come out on top from all this.\n\nTl;dr I think Citadel will try to convince the panel to make moves towards a T+1 standard. It’ll speed up their transaction process, and print them more and more money. It’ll sidestep any actual regulation to help retail, but also avoids looking overtly like they’re bullying us\n\nPositions: I dunno, stonks only go up\n\nEDIT 1 (11:45 PST): And here it is from Loudermilk. It’s a clear set-up: blame the market freeze on the collateral/margin regulation, Vlad agrees, then Kenneth lines it up to say how T+1 helps “everybody” (but some everybodies more than others).\n\nEDIT 2 (13:20 PST): Pretty consistent trend amongst the Republican representatives to blame settlement regulations to cause the trading halt. I honestly wasn’t expecting this much “spontaneous” grandstanding from the questioners, but I suppose they’ve been preparing for this for some time now.", "id": "lmic3q", "created_utc": 1613638623.0, "score": 56, "upvote_ratio": 0.77, "num_comments": 20, "comments": [{"body": "Instant settlement like digital currency would be nice.", "score": 38, "replies": [{"body": "...nab?", "score": 1, "replies": []}]}, {"body": "A good post. It'll be really interesting to see how the discussion unfolds when all the parties involved are basically looking after their own interests. I'm really curious how RH will play meeting the needs of their business vs the needs/anger of their clients in the context of the plumbing issues with Citadel.", "score": 11, "replies": []}, {"body": "Sir, this is a GameStop dispensary.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 22, "replies": []}, {"body": "can go both ways... its noise & is immaterial to the core issue.... how does anyone allow for shorting a name that is well over the number of shares issued? math is a better friend... a smart congress person would ask how did you overcome your SI so damn fast.... ?  assume every retail holder sold their gme... still not enough to cover....", "score": 6, "replies": [{"body": "It’s the core issue for us, as retail investors, but from the MM perspective their goal here is not only to get away with it, but to come out of this with a win, which would be progress towards, as Ken put it, an eventual T+0/real time settlement", "score": 1, "replies": []}]}, {"body": "You nailed it when you referenced liquidity.  It would be good for everyone in the market.", "score": 4, "replies": []}, {"body": "Damn you fucking called this shit.  I'd like to add DTCC's website.  They're the real winner.\n\n&#x200B;\n\n[https://www.dtcc.com/](https://www.dtcc.com/)", "score": 3, "replies": []}, {"body": "Citadel most likely always comes out on top. You gotta hand it to Ken and his current ceo tho.\n\nMelvin/vlad will have his panties tied up and Ken will probably come out with dollars in his pocket.", "score": 2, "replies": []}, {"body": "It took over 20 years to move from T+3 to T+2. They can push for a reduction to T+1 all they want, but it won't happen anytime soon..", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "You mentioned something that looks like crypto. We get it, crypto is neat, but it's not our thing. [(Rule 4)](https://old.reddit.com/r/wallstreetbets/about/rules)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}, {"body": "NOOOOO I hope they all get boned", "score": 1, "replies": []}, {"body": "This is just Vlad trying to deflect blame:  'It's not that I run a shitty fucking company - instead let me point the finger at a totally normal and established feature of the market that's the REAL problem here.'", "score": 1, "replies": []}, {"body": "Sir, this is a GameStop dispensary.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
{"title": "IS CANOO ($GOEV) THE NEXT TAXI/TESLA/UBER? MY DIAMOND HANDS TYPE YES 💣", "selftext": "[deleted]", "id": "lmk25p", "created_utc": 1613645404.0, "score": 15, "upvote_ratio": 0.61, "num_comments": 28, "comments": [{"body": "Short float now part of fundamental analysis brought to you by...", "score": 7, "replies": [{"body": ">Short float now part of fundamental analysis brought to you by...\n\nI have never invested in companies with such a large short exposure. But since it seems to be a topic here I only highlighted it!", "score": 1, "replies": []}, {"body": "[Me](https://v.redd.it/pfo3a26ur6i61)", "score": 1, "replies": []}]}, {"body": "No. Thanks for coming to my Ted talk.", "score": 19, "replies": [{"body": "I prefer kayaks", "score": 2, "replies": []}, {"body": "But he drew a triangle on the chart, what else do you need?", "score": 2, "replies": []}]}, {"body": "I've been ducking in and out of GOEV in one of my accounts, in the other I'm just holding 100 shares long. If it blows up, it blows up. One thing I'm positive of, is that it wont blow up until later this year without signing a big contract.", "score": 5, "replies": [{"body": "EV is the casino.", "score": 2, "replies": []}]}, {"body": "Canoo is a dumb name so I vote no.", "score": 14, "replies": []}, {"body": "I got in on Canoo with 3/19c a week or two ago. They’re definitely poised for growth.", "score": 3, "replies": [{"body": "I got in that too and the very next day Apple said they ain't talking and then it took a colossal shit", "score": 2, "replies": [{"body": "Yeah. There was a brief MSM buzz about EV and I went with Canoo. 🤷‍♂️. I figured a 3/19c would give time for more positive news from the Biden camp. We’ll see...", "score": 1, "replies": []}]}]}, {"body": "Absolutely love these guys and wish them well. I love the EV monthly subscription model. These will be great for business as well. Bullish although I have no shares right now.", "score": 3, "replies": []}, {"body": "No I’ve been loosing money on it for weeks.", "score": 3, "replies": []}, {"body": "Bagholder?", "score": 5, "replies": []}, {"body": "Also supplying the platforms for KIA EVs.  Definitely some good upside for this one.  \n\n1000 @ 16.50, 10x 21 Aug 17.5", "score": 2, "replies": []}, {"body": "Not that much heat around CANOO in my opinion. Rumors that Tesla might dip into the rising sharing world though.", "score": 2, "replies": []}, {"body": "Trash play and you insult Italians in the process.  Ban.", "score": 2, "replies": [{"body": "I'm italian and I know exactly how we speak English. \n\nQuindi tranquillo che non ho insultato nessuno, anzi sono un profondo patriota italiano :)", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I don’t think this is entirely accurate. They still have the subscription model for the Lifestyle vehicle. They’ve never abandoned that. They are offering the MPDV for sale, as what many investors are wanting. This may have been the plan all along as they broke out the subscription revenue from the B2B vehicle revenue in their Investor Presentation from last year.", "score": 1, "replies": []}]}, {"body": "It’s much more than that 🚀🚀🚀", "score": 1, "replies": []}, {"body": "Yes I“m very sure I“m in with 5000 € 🚀(WKN: A2QJX1)", "score": 0, "replies": []}, {"body": "Positions screenshot or ban", "score": -1, "replies": []}, {"body": "I have only gotten red dildoes the last time I bought into a GOEV DD, still holding tho 😐", "score": 1, "replies": []}]}
{"title": "(2/18) Thursday's Pre-Market Stock Movers & News", "selftext": "#Good morning traders and investors of the r/wallstreetbets sub! Welcome to Thursday! Here are your pre-market stock movers & news on this Thursday, February 18, 2021-\n\n*****\n\n# [5 things to know before the stock market opens Thursday](https://www.cnbc.com/2021/02/18/5-things-to-know-before-the-stock-market-opens-feb-18-2021.html)\n\n*****\n\n> # 1. Dow set to drop as Walmart declines on disappointing earnings\n\n> * U.S. stock futures fell Thursday, after Dow stock Walmart dropped 4.5% in the premarket on disappointing earnings. The Dow Jones Industrial Average on Wednesday erased a 180-point loss and ended 90 points higher for another record close. The S&P 500 and Nasdaq closed slightly lower for the second straight session. The S&P 500 pared losses after minutes from the Fed’s last meeting signaled easy monetary policy for longer with the economy nowhere close to pre-coronavirus levels.\n\n> * The Labor Department is set to release its weekly jobless claims report at 8:30 a.m. ET, one hour before the opening bell. Economists expect 773,000 new filings for unemployment benefits for last week. That would be down 20,000 from 793,000 initial claims the prior week, which saw little relief from declining Covid cases.\n\n*****\n\n> # 2. Walmart missed on earnings, beat on revenue; CEO to boost wages\n\n> * Trying to turn pandemic gains into sustained momentum and higher profitability, Walmart on Thursday before-the-bell reported fourth-quarter adjusted earnings of $1.39 per share, which fell short of estimates. Revenue grew by 7.3% to a better-than-expected $152.1 billion. The big-box retailer’s e-commerce sales in the U.S. grew by 69% and its same-store sales in the U.S. grew by 8.6%. Walmart CEO Doug McMillon said the company will boost the wage of U.S. workers, raising the average for hourly employees to above $15 per hour.\n\n*****\n\n> # 3. What to expect from GameStop hearing with Robinhood, Citadel, Reddit CEOs\n\n> * The heads of Robinhood, Reddit, Citadel and Melvin Capital, will be in Washington for Thursday’s highly anticipated GameStop hearing, which is scheduled to begin at noon ET in the House Financial Services Committee. According to prepared remarks, Reddit CEO Steve Huffman will testify that no significant activity on WallStreetBets last month was driven by bots or foreign agents. Keith Gill, the Reddit and YouTube trading star known as “Roaring Kitty,” will defend his social media posts that helped spark a mania in GameStop shares.\n\n*****\n\n> # 4. How Texas power grid failed and what could stop it from happening again\n\n> * More than 500,000 households in Texas are still without power Thursday morning, according to poweroutage.us, following Sunday night’s historic cold and snow that caused the state’s worst blackouts in decades. Millions of people were in the dark at the height of the crisis, which was caused by a confluence of factors. Officials are already calling for investigations. Experts said there are a number of steps that Texas can take to combat future problems, including weatherizing equipment and increasing the amount of excess supply needed to meet peak power demand.\n\n*****\n\n> # 5. U.S. life expectancy drops a year in pandemic, most since WWII\n\n> * Life expectancy in the U.S. dropped a staggering one year during the first half of 2020 as the pandemic caused the first wave of coronavirus deaths. Minorities suffered the biggest impact, with Black Americans losing nearly three years and Hispanics, nearly two years, according to preliminary estimates Thursday from the CDC. “You have to go back to World War II, the 1940s, to find a decline like this,” said Robert Anderson, who oversees the numbers for the CDC. It’s already known that 2020 was the deadliest year in U.S. history, with deaths topping 3 million for the first time.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/FrLUO2J.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&P SECTORS CHART!](https://i.imgur.com/8MNKhv6.png)**)\n\n*****\n\n#TODAY'S S&P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #1!](https://i.postimg.cc/T3cRcfQL/econcal1.png)**)\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #2!](https://i.postimg.cc/15wRfpqK/econcal2.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/wWv2RIG.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/968QLzv.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/03Kxnx1.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.postimg.cc/TP8PttvF/eram0111.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #1!](https://i.imgur.com/eg2VEbG.png)**)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #2!](https://i.imgur.com/DfgMUm2.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #1!](https://i.imgur.com/AlgBlru.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #2!](https://i.imgur.com/ozc7nge.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.postimg.cc/sfSCc3gj/upgradesdowngrades1.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.postimg.cc/VvjyLWVr/upgradesdowngrades2.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/FKuhY48.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.imgur.com/OLqGg4c.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.imgur.com/sQzqUDu.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #3!](https://i.imgur.com/sWm5TFN.png)**)\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/02/18/stocks-making-the-biggest-moves-premarket-walmart-hormel-foods-marriott-others.html)**)\n\n*****\n\n> **Walmart (WMT)** – Walmart reported adjusted quarterly earnings of $1.39 per share, which includes a 7-cent impact from UK tax repayment. The consensus estimate had been $1.50. Revenue did beat forecasts, and US comparable sales excluding fuel were up 8.6% compared to the 5.8% FactSet estimate. The retailer’s shares are down 5% premarket.\n\n> #**STOCK SYMBOL:** WMT\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WMT&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WMT)**)\n\n*****\n\n> **Hormel Foods (HRL)** – The food producer’s stock is up 2.2% premarket after earnings matched estimates at 41 cents per share and revenue beat Wall Street forecasts. Hormel also said it is increasingly optimistic about full-year sales and earnings growth.\n\n> #**STOCK SYMBOL:** HRL\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HRL&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HRL)**)\n\n*****\n\n> **Marriott (MAR)** – Marriott bucked recent trends by hotel chains by beating Street estimates, earning an adjusted 12 cents per share for its latest quarter compared to an 11 cent consensus estimate. Revenue did miss forecasts as the company continues to be impacted by the pandemic.\n\n> #**STOCK SYMBOL:** MAR\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MAR&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MAR)**)\n\n*****\n\n> **Waste Management (WM)** – Waste Management shares are up 1% premarket after the waste-hauling company beat estimates by 4 cents with an adjusted quarterly profit of $1.13 per share, with revenue beating estimates as well. Waste Management is also raising its dividend by 12 cents on an annual basis to $2.30 per share.\n\n> #**STOCK SYMBOL:** WM\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WM&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WM)**)\n\n*****\n\n> **Tilray (TLRY)** – Tilray lost an adjusted 2 cents per share for its latest quarter, smaller than the 15 cent loss expected by Wall Street analysts, while the cannabis producer’s revenue was above estimates. The results come ahead of Tilray’s planned merger with rival Aphria (APHA), which it expects to close in the second quarter. The stock is up 4% in premarket action.\n\n> #**STOCK SYMBOL:** TLRY\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TLRY&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TLRY)**)\n\n*****\n\n> **SunPower (SPWR)** – SunPower doubled consensus estimates with adjusted quarterly earnings of 14 cents per share, although the solar company’s revenue fell short of forecasts. SunPower also issued weaker than expected current quarter guidance, and its shares are down 7.1% in premarket trading.\n\n> #**STOCK SYMBOL:** SPWR\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SPWR&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SPWR)**)\n\n*****\n\n> **Twilio (TWLO)** - Twilio is up 9.5% premarket after it reported an adjusted profit of 4 cents per share for its latest quarter, surprising analysts who had expected the cloud computing platform provider to report an 8 cents per share loss. Revenue also came in well above Street forecasts, with results helped by recent acquisitions and election-related business as well as what Twilio calls “broad-based diversified strength”.\n\n> #**STOCK SYMBOL:** TWLO\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TWLO&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TWLO)**)\n\n*****\n\n> **Baidu (BIDU)** – Baidu saw quarterly revenue come in above analyst projections, with the search engine’s ad sales bouncing back and the company’s cloud services seeing increased demand. Baidu shares are down 1.2% this morning.\n\n> #**STOCK SYMBOL:** BIDU\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BIDU&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BIDU)**)\n\n*****\n\n> **Sleep Number (SNBR)** – Sleep Number shares are surging 12.7% premarket after it reported quarterly earnings of $2.19 per share, beating the consensus estimate of $1.45, with the mattress retailer’s revenue also exceeding estimates. Sleep Number also issued upbeat full-year guidance.\n\n> #**STOCK SYMBOL:** SNBR\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SNBR&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SNBR)**)\n\n*****\n\n> **Tesla (TSLA)** – Tesla cut prices for the cheaper versions of its Model 3 and Model Y vehicles, although it raised prices for upper-end variants. Shares are down 2% premarket.\n\n> #**STOCK SYMBOL:** TSLA\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n> **Nutrien (NTR)** – Nutrien reported better-than-expected earnings for its latest quarter, as the Canadian fertilizer maker saw increased demand amid rising crop prices and plans by farmers to plant more acres this year. The stock is up 3.8% premarket.\n\n> #**STOCK SYMBOL:** NTR\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NTR&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NTR)**)\n\n*****\n\n> **Fastly (FSLY)** – Fastly shares are under pressure, down 6.2% premarket, after the cloud-platform provider reported better-than-expected earnings and revenue for its latest quarter but issued a lower than expected forecast.\n\n> #**STOCK SYMBOL:** FSLY\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FSLY&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FSLY)**)\n\n*****\n\n> **Tanger Factory Outlets (SKT)** – The shopping center operator is up 3.1% after reporting a breakeven quarter, compared to forecasts of a 2 cents per share loss, while revenue beat estimates as well. Tanger saw an increase in foot traffic during the quarter, although lower occupancy rates continue to weigh on revenue.\n\n> #**STOCK SYMBOL:** SKT\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SKT&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SKT)**)\n\n*****\n\n> **Bloomin’ Brands (BLMN)** – The restaurant operator’s shares are down 4.1% premarket after revenue fell below Street forecasts for its latest quarter. The company did report a breakeven quarter on an adjusted basis, compared to forecasts of a 2 cents per share loss.\n\n> #**STOCK SYMBOL:** BLMN\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BLMN&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BLMN)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/wallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Thursday, February 18th, 2021! :)**", "id": "lmmnu7", "created_utc": 1613654518.0, "score": 77, "upvote_ratio": 0.93, "num_comments": 30, "comments": [{"body": "Tesla making me bleed", "score": 15, "replies": [{"body": "I'm in the same boat with u I'm losing alot with tesla. Whats going on with this stock really?", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 41, "replies": [{"body": "I'm in Gamestop and think it's a good stock. But I can understand that people stay away from it. There is a possibility that they covered all the shorts on the way up and the new shorts are at profit. There is plenty of good stocks on the market at the moment with less risk and good rebate. Let the downvotes come, but I do like the stock.", "score": 20, "replies": [{"body": "[deleted]", "score": 9, "replies": []}]}]}, {"body": "PLTR is down 5% in pre-market.", "score": 10, "replies": [{"body": "Time to buy?", "score": 6, "replies": [{"body": "No, buy when the stock surges up 30%", "score": 26, "replies": [{"body": "This is the way.", "score": 4, "replies": [{"body": "Sell the dip and buy back at the peak, only way to do it", "score": 6, "replies": [{"body": "This guy maths", "score": 3, "replies": []}]}]}]}]}]}, {"body": "So I buy GameStop or amc shares to hedge against the market falling? Is this a simulation?", "score": 5, "replies": []}, {"body": "$idex dip", "score": 3, "replies": []}, {"body": "If Walmart dropped...Shopify and The Indian scammers at W must be back in the red.", "score": 3, "replies": []}, {"body": "AMC up 14%.", "score": 3, "replies": []}, {"body": "Anyone else get their loss porn sent to them from Robinhood today in the form of a 1099?", "score": 2, "replies": []}, {"body": "Riot?", "score": 2, "replies": []}, {"body": "Sir, this is a GameStop dispensary.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}, {"body": "What about sndl", "score": 2, "replies": []}, {"body": "Thanks you so much for this update and info. It really helps.\nI woke up to something on my stock quote page that's odd to this noob. It was a bid of $.0001 - 100, and 199,999.99 - 100 ask...Anyone willing to help me make sense of this?", "score": 1, "replies": [{"body": "Just means it’s a very illiquid asset. Buy and sell orders could be anywhere.", "score": 2, "replies": [{"body": "Thank you for the response. \nI see. I've just never seen such extremes in the order book.\nThrew me off lol", "score": 2, "replies": []}]}]}, {"body": "Bidu", "score": 0, "replies": []}]}
{"title": "Amazon acquiring AMC. Diamond hands!!! Can anyone confirm?", "selftext": "[deleted]", "id": "lmp698", "created_utc": 1613661912.0, "score": 0, "upvote_ratio": 0.41, "num_comments": 22, "comments": [{"body": "article is a year-old", "score": 10, "replies": [{"body": "On that article is says 2021 so according to the article it isn’t old", "score": 3, "replies": [{"body": "It's French translation of an American article from May 2020", "score": 1, "replies": [{"body": "https://www.bloomberg.com/news/articles/2021-02-18/amc-shares-spike-again-this-time-on-months-old-deal-speculation", "score": 1, "replies": []}]}]}, {"body": "Damn didn’t even see the year thanks", "score": 1, "replies": []}]}, {"body": "Old news", "score": 4, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "Very old... And fake", "score": 4, "replies": [{"body": "That’s unfortunate", "score": 2, "replies": []}]}, {"body": "Year old article, idiots sharing it not realizing how dated it is, idiots buying AMC today on the \"news\" making the price jump.\n\nhttps://mobile.twitter.com/awallenstein/status/1362412220827787268?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet\n\nMaybe retail does need protected from itself..\n\nNah, I prefer Darwinism here.", "score": 1, "replies": [{"body": "Yeah might delete then", "score": 1, "replies": []}]}, {"body": "OP trying to get the bump.", "score": 1, "replies": []}, {"body": "Smart. I figured Amazon or Netflix would start doing this.", "score": -2, "replies": [{"body": "It's old news\n\nhttps://www.bloomberg.com/news/articles/2021-02-18/amc-shares-spike-again-this-time-on-months-old-deal-speculation", "score": 1, "replies": []}]}]}
{"title": "Amazon to acquire AMC (source: Forbes.fr)", "selftext": "[removed]", "id": "lmq4us", "created_utc": 1613664404.0, "score": 3, "upvote_ratio": 0.54, "num_comments": 22, "comments": [{"body": "As a bag holder, this could be nice.", "score": 14, "replies": [{"body": "Only if it were true. Do some Googlin'", "score": 3, "replies": []}, {"body": "Will be interesting to see if the GameStop hearing in an hour acts as a catalyst", "score": 0, "replies": []}]}, {"body": "You are a true retard. This rumor is a year old. No idea why Forbes is re-running this story now except for clickbait", "score": 18, "replies": [{"body": "It was finally translated into French", "score": 3, "replies": []}, {"body": "You know they might run this again and try to treat it like GME.", "score": 4, "replies": []}]}, {"body": "People believe this? Lmao when did it rise 30 percent", "score": 2, "replies": []}, {"body": "Bloomberg claims it's old news...  last year's news/rumor...\n\nhttps://www.bloomberg.com/news/articles/2021-02-18/amc-shares-spike-again-this-time-on-months-old-deal-speculation", "score": 2, "replies": []}, {"body": "BAN the article itself if you read it says, this is just speculation. Like, there is nothing saying amazon has current interest. I even have stocks in AMC - but this is retarded.", "score": 2, "replies": []}, {"body": "What does this mean for its stock holders", "score": 2, "replies": [{"body": "absolutely nothing", "score": 5, "replies": [{"body": "I don’t even trade but I own shares of AMC off of pure hype. I figured it probably meant nothing lol.", "score": 2, "replies": []}]}, {"body": "🚀", "score": 4, "replies": []}]}, {"body": "I swear I remember a similar article around 6 months back and it turned out to be about AMCX not AMC lol.\n\nEdit: Just checked and it's was Amazon back then too haha. Wouldn't put it past these news outlets to make the same retarded mistake twice\n\nhttps://www.fool.com/investing/2020/05/12/why-amc-networks-stock-soared-today.aspx", "score": 2, "replies": []}, {"body": "Someone over at [Forbes.fr](https://Forbes.fr) are holding some bags here.\n\n&#x200B;\n\n[https://www.fool.com/investing/2021/02/18/no-amazon-isnt-buying-amc-enter](https://www.fool.com/investing/2021/02/18/no-amazon-isnt-buying-amc-entertainment/)[tainment/](https://www.fool.com/investing/2021/02/18/no-amazon-isnt-buying-amc-entertainment/)\n\n&#x200B;\n\nedit:\n\n>An article appeared in *Forbes France* today discussing speculation the e-commerce giant was kicking the tires on the beaten-down theater owner. Yet readers had to get to the bottom of the article to find out it was a translation of an article that appeared in the U.S.   \n>  \n>While the article noted the report was \"pure speculation,\" what it didn't say was the original article was published **last May.**", "score": 1, "replies": []}, {"body": "**FUCKING PLEASE DON’T BE BULLSHIT**", "score": 0, "replies": [{"body": "Nah this isn’t true", "score": 3, "replies": []}]}, {"body": "Nice!!", "score": 0, "replies": []}, {"body": "What are the chances of this actually happening?", "score": 0, "replies": []}, {"body": "Should have sold this morning when it spiked on this fake news lol.", "score": -2, "replies": []}]}
{"title": "DD: $AAWW is a deep value play", "selftext": "Listen up tards, this is not the usual WSB yolo but nevertheless, a significantly undervalued company that presents a great opportunity. Obligatory I'm not a financial advisor and am retarded.\n\nHere is my bull thesis for this $AAWW (Atlas Air Worldwide Holdings):\n\n1. **P/E ratio of 4.3:** This company is currently trading at a market cap of $1.56B, they posted a $3.2B revenue in 2020 with a $360M profit. That's right, it's trading at a market cap of 0.5x annual revenue, a PE ratio of 4.33 and a Price/EBIT ratio of 2. \n2. **24% YOY growth, cargo partner for Amazon:** $AAWW [is a contractor for Amazon](https://www.cnbc.com/2021/02/18/amazon-cargo-contractor-atlas-air-expects-more-growth-in-early-2021.html) and has seen its revenue grow by 24% in 2020. With the boom in e-commerce, the air cargo business has not suffered like the passenger air travel business and I expect it will continue to grow. It is rare for companies that are growing at this incredible rate to have such a low PE multiple.\n3. **Decline in passenger air travel means airplanes available at a discount**\n\nPosition: 300 shares of $AAWW, may add more", "id": "lmw1xe", "created_utc": 1613679275.0, "score": 35, "upvote_ratio": 0.77, "num_comments": 27, "comments": [{"body": "Sir, are you a cat?", "score": 35, "replies": [{"body": "I am not a cat. I just like the stock.", "score": 25, "replies": []}]}, {"body": "In 2018, they had an EPS of 10 and they peaked at $73. They currently have an eps of \\~5 so they are trading at a premium to me. I can't comment much further on eps, but given the trends, it's possible this trading level of market cap vs revenue is normal for this industry. If this were a tech company, I would agree that this is heavily undervalued.\n\nAlso, we're currently at or just past the peak of online shopping during the pandemic. This trend will continue, but I don't see revenue increasing much further than this. I think it'll stay flat or drop from here.", "score": 8, "replies": [{"body": "Eat your words!", "score": 1, "replies": []}]}, {"body": "This is actually a very intriguing find. I can't believe that PE ratio.", "score": 3, "replies": []}, {"body": "Lol well fuck I think I should have bought some 0dtes at least for this...up ~6% today! Good job finding this one", "score": 3, "replies": []}, {"body": "I like your username bro, \n\n## WHAT A STRANGE, LONG TRIP IT'S BEEN", "score": 2, "replies": [{"body": "Thanks bro, I like yours too", "score": 1, "replies": []}]}, {"body": "Do you have any idea why it's so undervalued?", "score": 3, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "As far as I can tell, one of the reasons is that they did not have a profitable 2019. Also looks like [they've had issues with the pilots trying to unionize](https://theloadstar.com/atlas-air-moving-the-goalposts-after-five-years-of-talks-with-pilots-union/). \n\nThat said, the company's balance sheet looks healthy and its not overly leveraged. Also, it looks like [when Amazon partnered with Atlas, they also got warrants that allowed it to take upto 30% stake in Atlas Air](https://www.wsj.com/articles/amazon-partners-with-atlas-air-worldwide-for-cargo-services-1462455676). I'm not sure what percent of the company they actually acquired but they seem to still be using it for Prime Air. If Amazon continues to invest money in this company to build up Amazon Air that competes with UPS or Fedex, or buys it outright, that could be a catalyst for a big stock price increase.", "score": 3, "replies": [{"body": "I work at for an airport and with passenger flight going down the unionization of pilots is pretty much over.", "score": 3, "replies": []}]}, {"body": "Thanks elon!", "score": 2, "replies": []}]}]}, {"body": "Check the news. Amazon is buying its own planes 😭", "score": 1, "replies": [{"body": "They hire atlas to fly them", "score": 4, "replies": [{"body": "Atlas has serious labor disputes with their unions...", "score": 1, "replies": [{"body": "True, but everybody is sending their resumes in because job security at atlas is strong right now while passenger airlines are not the strongest with job security.", "score": 1, "replies": []}]}]}]}, {"body": "Interesting", "score": 1, "replies": []}, {"body": "[deleted]", "score": -11, "replies": [{"body": "Doesn’t mean there is only one stock with deep value", "score": 3, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "My DD is clearly more than “I like the stock”. I’m laying out reasons why I think it’s a good buy. Poke holes in it if you like, but don’t ask to automod my post into oblivion just because I used the phrase “deep value” for a stock that’s actually trading at a reasonable price based on its financials", "score": 3, "replies": [{"body": "Fair enough. \n\nThe reason it’s trading at such a “deep value” is because Amazon has made it clear they are creating their own air fleet. \n\nSo your first point is valid, second is iffy. Third is great for its competitors. Or, you know, the worlds largest e-commerce site, who can buy cheap planes instead of paying contractor rates", "score": 1, "replies": []}]}]}]}]}, {"body": "It has some kangaroo pattern. I need to review this in depth.", "score": 1, "replies": []}, {"body": "been saying this \n\nbut my posts always get the can. mods must be able to smell me", "score": 1, "replies": []}, {"body": "Solid value opportunity here! GLTAL", "score": 1, "replies": []}]}
{"title": "DD on DG - DOLLAR GENERAL Earnings Play 3/12", "selftext": "Alright retards, let's talk about your favorite one stop shop for when you yolo your inheritances and students loans on meme stonks at the top. I'd like to preface this by saying that I am an analyst, but a really shitty one, and not in finance.\n\n**I bring to you: DOLLAR GENERAL**\n\nAside from the fact that it has exceeded earnings the last 4 quarters, there is a run up trend for at least the past three (Q3, Q2, Q1 2020) right before earnings with a dump immediately after. This falls in line with most earnings plays right now as well (see Disney clowns, Palantards, AMDeeznuts, bla bla). I don't have any astrology charts, I ate the crayons.\n\nThe company's financials seem solid and this seems like a recession-proof play that will either provide good tendies or food stamps (no Dollar General snackers here).\n\n**Beer Case:**\n\nCompetition - Walmart, Costco... okay, cool. From what I know, I feel like Walmart and Dollar General are a different kind of shopping and Walmart is usually more inconvenient to get to than DG, usually on the outskirts of cities and in the suburbs (could be wrong). Costco is definitely a threat but requires memberships. Welcome to accept argument on this.\n\nBoomer stock - Yes, I am aware. However, so is AT&T and tendies were made on that.\n\nMarket having gone full retard - I would say buyer beware but you retards are at a kindergarten reading level.\n\n**Conclusion:**\n\nSomeone else wrote a DD on this before, but their positions are likely bust and I'm not sure why they didn't buy in for AFTER earnings.\n\n**TLDR:**\n\nMay hit, IDK.\n\n**Positions:**\n\n10 $210C 3/12\n\n**FOR THOSE WHO NEED IT DRAWN OUT - PLAY THE RUN UP, SELL DAY BEFORE EARNINGS...**", "id": "lmxf09", "created_utc": 1613682793.0, "score": 24, "upvote_ratio": 0.77, "num_comments": 29, "comments": [{"body": "Consider this DD: \n\nThere’s a Dollar General about 1/2 mile from my house. My 6 year olds favorite thing to do after school is walk to the Dollar General, buy a little bag of candy and a coke, sit on a bench with me and eat the candy, then we walk home. \n\nSentimental indicators are flashing a strong buy signal.", "score": 22, "replies": [{"body": "Analysis checks out.....but why isn't their stock $1.00 !?!?!?  \n\n\nDollar store my ass", "score": 65, "replies": [{"body": "Can't believe no one upvoted the comment. Had me laughing 🤣", "score": 7, "replies": []}]}, {"body": "Walmart ain’t got nothin on DG 👍🏼\n\nThey are a shitty company from an employment perspective, but I’ll be damned if I don’t shop there more than WM. They don’t even stock seeded preserves anymore but DG has em all day long for a dollar. Best preserves I’ve ever had by far.", "score": 4, "replies": []}, {"body": "Your child will. Have diabetes before she gets her first period... luckily her father will be able to afford treatment if he plays this one right.", "score": 4, "replies": []}]}, {"body": "Economic down turn means people turn to cheaper retail. Costco and sams club have pricey membership costs and are further from city centers so I most certainly agree. Fuckit I’m in, earnings is coming I’ll ride the wave up and dump right before earnings.", "score": 9, "replies": [{"body": "If you're hedging against an economic downturn, buy some EZCorp and FirstCash inc. Together they own about 60% of all the pawn shops in the US", "score": 3, "replies": [{"body": "Corporate pawnshops have so much fraud problems. Pawnshops are best independently run for sure. But there's cash America...", "score": 2, "replies": []}]}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**DG**|**$210**|**BUY CALL**|**2021-03-12**|**$1.82**|**$202.83**|**1181**|**142**\n\n[Realtime ROI](https://www.pickmojo.com/pick/cklbdbcjz40tb0757pb78vw3y) | [Track Record](https://www.pickmojo.com/user/RICH_PINNA/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 5, "replies": []}, {"body": "i like the stonk", "score": 5, "replies": []}, {"body": "With dividend yields!!!! I’m hoping you all overlook this one because I’m sure they’ll cancel dividends once 🙌🏾💎🙌🏾💎🙌🏾 !remindme 2 months", "score": 4, "replies": []}, {"body": "My only issue with dollar stores is inflation. If inflation continually creeps up faster and faster, how much profit are they going to eat before they have to become the $2 store", "score": 3, "replies": [{"body": "dg is not a literal dollar store", "score": 10, "replies": [{"body": "It’s also a 3 week play, not he he can read.", "score": 3, "replies": [{"body": "i bought a couple weeks ago on the old DD and I sold a call bc it made 50%. got nothing to throw at it again rn lol", "score": 2, "replies": []}]}, {"body": "Ah I did not realize that. Then 🚀🚀🚀", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Do your taxes.", "score": 2, "replies": []}]}, {"body": "Who the fuck made tendies on AT&T?", "score": 2, "replies": [{"body": "👋", "score": 1, "replies": []}]}, {"body": "DG reporting earnings 3/18 correct?", "score": 2, "replies": [{"body": "Yes", "score": 2, "replies": []}]}, {"body": "Was Walmart ER today not a massive red flag for this one?\n\nI’ve admittedly not done any research on this, but to say that Walmart is the “harder to get to” between it and DG seems rather odd.", "score": 1, "replies": [{"body": "Jesus, I literally said it sells off on earnings. The play is the run up.\n\nI live in NY and there are a dozen plus DG’s, not one Walmart.", "score": 11, "replies": [{"body": "DD is the rural version of Suburbia's Walmart", "score": 3, "replies": []}, {"body": "Right, and my point is WMT having a huge underperformance could now change that typical trend as the two have incredibly similar purposes/businesses. \n\nIn terms of ease of access, maybe I’m just missing the point. What’s unique as of right now (or Q4) about DG compared to WMT? They serve different populations, but that in and of itself isn’t a new variable to the equation\n\nEdit: Essentially, should we not entertain the possibility that the variables impacting WMT could have also impacted DG, in turn dulling pre-ER exuberance?", "score": 1, "replies": [{"body": "I see.\n\nIn that case, valid point but it could be that this holiday season was a bust for luxuries like electronics, etc.\n\nGood point though. Like I said, could go tits up.", "score": 2, "replies": []}]}]}]}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "As a former DG wagecuck, I can confirm that corporate is heavily involved with every store, no matter how remote or far away, they min-max EVERYTHING. Shit place to work, but they dont fuck around", "score": 1, "replies": []}]}
