{"title": "The REAL F-150 vs Tesla Tug -Of-War | What Elon Should've Done", "selftext": "", "id": "e9g889", "created_utc": 1576111947.0, "score": 139, "upvote_ratio": 0.97, "num_comments": 58, "comments": [{"body": "The tweet was just retweeted by Elon, so this video will be all over the place. Let's see what Ford has to say, lol", "score": 31, "replies": [{"body": "Looks like he deleted the retweet...", "score": 3, "replies": [{"body": "maybe he doesn´t wanna bankrupt Ford just yet.", "score": 4, "replies": []}, {"body": "I still see it.", "score": 2, "replies": []}]}, {"body": "Doesn't it only have to do with weight and tire traction? Hasn't this already been debunked as meaningful?", "score": 2, "replies": [{"body": "Yeah those are the main factors. The Ford apologists will find any way to poke holes in the tests.\n\nI think Tesla has it in the bag, but I really want to see this test done by people who know exactly what they're doing and will explain in detail about the tires, 4 wheel drive, etc. Since it was done by apparent \"Tesla Fanboys\" and I am no truck expert, I'm only like 98% sure this is totally legitimate.", "score": 2, "replies": [{"body": "but, not being a Ford apologist (whatever that even means lol), isn't the point that this isn't really a good determination of anything at all? Electric cars will win these types of tests because the batteries are so heavy, right?", "score": 1, "replies": [{"body": "Yes electric wins because it has more torque, both instantly and overall. And that truck weighs more than the Model Y by a few hundred pounds assuming both are empty. Add on that the rope is angled in a way to advantage the Ford, it just doesn’t look good for gas cars.\n\nIs it silly? Maybe a little, but it doesn’t invalidate the test completely. A lot of guys with trucks can’t wrap their heads around the fact that their big and loud trucks are less powerful than electric cars, let alone electric trucks.", "score": 1, "replies": [{"body": "It's a Model X not a Model Y, and the Model X weighs more because of the batteries. It doesn't mean the trucks are less powerful, that's what you're not understanding. It doesn't necessarily mean the trucks have less torque either. It simply means the Model X is heavier. Have you not been reading the news about this? NDT got into a twitter argument with Elon over this. The only real way to test this would be to make both vehicles weigh the same amount and pull at the same height.", "score": 3, "replies": [{"body": "Yep, X not Y. But the X weight is listed at 5,185-5,531 lbs and the Raptor is 5,525 to 5,697 lbs. NGT did bring up the weight when he was talking about it but he was commenting on Cybertruck vs F150.\n\nThat test was flawed because the Cybertruck weighs more (nobody is actually sure if this) and that truck was in 2 wheel drive. This video is showing the X pull a 4 wheel drive.\n\nWe might not be on the same page, but we’re getting there ha", "score": 2, "replies": [{"body": " [https://www.youtube.com/watch?v=DhM7we2Bzao](https://www.youtube.com/watch?v=DhM7we2Bzao) \n\n&#x200B;\n\nThere are other factors as well. An F150 can weigh as low as 4069 lbs as well. Tire grip matters a ton as well.", "score": 1, "replies": [{"body": "I’m not able to watch with sound at work. Is that a Performance Model X?", "score": 1, "replies": [{"body": "I believe so", "score": 1, "replies": [{"body": "It's a 2016 P90DL, while the one's being produced now are P100D\n\n [https://www.youtube.com/watch?v=IS0xD4DWyj4&t=129s](https://www.youtube.com/watch?v=IS0xD4DWyj4&t=129s)  \\- P90DL vs P100DL begins at 1:15 to see how they compare racing.", "score": 1, "replies": [{"body": "My point wasn’t about winning or losing it was about weight", "score": 1, "replies": [{"body": "It's a Raptor and weighs over 5,500 lbs. and is heavier than the Model X.", "score": 1, "replies": [{"body": "Hm okay. I guess I’ll need to do more homework. I’m not saying you’re wrong, I’m just saying it seems like there was a lot of backlash for the original assumption", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Yeah, but that's not a raptor. That's a normal short bed super crew, which is more like 4600lb or so depending on options.", "score": 0, "replies": [{"body": "No it't not. 100% a Raptor.", "score": 0, "replies": []}, {"body": " [https://www.youtube.com/watch?v=RkfQdey9t9A](https://www.youtube.com/watch?v=RkfQdey9t9A) \n\nSkip to 4:02", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Skip to [4:27](https://www.youtube.com/watch?v=VPNoXa-Lb_k&t=267)", "score": 17, "replies": [{"body": "Turn off at 4:54, unless you want to watch acting that's worse than porn.", "score": 8, "replies": [{"body": "Hahaha", "score": 2, "replies": [{"body": "“Somebody ordered a pizza?”", "score": 1, "replies": []}]}]}, {"body": "Thanks. Now imagine if the Tesla was made out of giant steel sheets", "score": 6, "replies": [{"body": "What's your point? I thought people were saying weight AND uphill are advantages\n\nAlso, imagine if the batteries were 25% denser or the pack was 50% larger", "score": 10, "replies": [{"body": "My point is that the cyber truck will be even more capable than this model x because it’ll be heavier", "score": 18, "replies": [{"body": "Oh, nice, same. Cheers", "score": 6, "replies": []}]}]}]}]}, {"body": "Me: Why would you destroy a 100k SU... oh...", "score": 13, "replies": []}, {"body": "Note that the line between the two cars is not horizontal. That is significant, because the backside of the X is being pulled up and the backside of the Ford is being pulled down. That is an advantage for the Ford. But possibly the X is heavier than the Ford? That would partially compensate for this.", "score": 9, "replies": [{"body": "Model X: 5,185 to 5,531 lbs (per google)\n\n2019 Ford Raptor: 5,525 to 5,697 lbs (also per google)", "score": 12, "replies": [{"body": "Okay. And still the X won, while being disadvantaged in two ways. Impressive.", "score": 6, "replies": [{"body": "I wonder if it has to do not with better torque (which doesn't matter so much vs a heavier vehicle) but better torque management, ie, all wheel drive etc which allows the model X to put more force on the pavement even while skidding some of the time...", "score": 2, "replies": []}]}, {"body": "Is that a raptor though? It looks like a normal F150 short bed super crew, which would make it more like 4500-4800lb (depending on engine and options).", "score": 1, "replies": [{"body": "I had the same thought. They kept referring to it as a Raptor but they may be more social media savvy than car savvy. Not sure. Did Ford redesign? If not, its definitely not a Raptor.", "score": 1, "replies": [{"body": "100% a raptor.", "score": 1, "replies": [{"body": "It's not though. The more I look at it, the more sure I am. It has the wrong fenders, the wrong wheels, the wrong tires, and it doesn't even sound quite right to me (but that could be the microphone or an aftermarket exhaust). I'm going to stand by my guess that that's a normal short bed super crew, and I'm almost positive that it isn't a raptor.", "score": 1, "replies": [{"body": "https://youtu.be/yTawVXyKiGM", "score": 1, "replies": [{"body": "Yeah, but that's still lifted, still has the different wheels and tires, and that's the old V8, not the ecoboost. I'm almost positive that the truck in this video isn't a raptor.", "score": 1, "replies": [{"body": "That's a V6. https://www.instagram.com/p/BtOiZ9cgoEC/", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "why is this getting downvoted? from a physics perpective this is absolutely true. The contact force is what wins tug of wars as it determines the coefficient of friction.\n\nThat angled line increases the contact force of the ford and decreases the contact force of the tesla.", "score": 2, "replies": [{"body": "Would it not also reduce the force on the Ford's front wheels, since by pushing down on the back you are somewhat lifting up the front?", "score": 1, "replies": [{"body": "Barely, that’s torque/moments. The lift of the front wheels will be negligible because the distance of the rope downforce from the pivot is relatively small", "score": 1, "replies": []}]}]}]}, {"body": "That’s a big truck compared to that x lol, and since the raptor has the small bed option the Cybertruck will be even bigger.", "score": 3, "replies": []}, {"body": "Pretty sure the Tesla motor produces much more torque. Having a p100 dual motor probably helps", "score": 3, "replies": []}, {"body": "Really bro", "score": 7, "replies": [{"body": "Hey bro. Spreadsheets bro. Hey bro. Bro bro bro bro bro bro bro.", "score": 2, "replies": []}]}, {"body": "Just to show there is a lot more factors at play here than you might think. Weight, tires, and traction control settings can have a big effect. The fact that Tesla is electric doesn't really factor much in to this equation.\n\nhttps://www.youtube.com/watch?v=DhM7we2Bzao", "score": 1, "replies": []}, {"body": "beautiful now go up 10%", "score": 1, "replies": []}, {"body": "The acting afterward is like they're making a p0rn0", "score": 1, "replies": []}, {"body": "Jack Rickard's December 4 video (part 2 of a long discussion about the Cybertruck) includes an interesting 7-minute discussion of the F-150 tug of war, about [an hour and 35 minutes](https://www.youtube.com/watch?v=Dum1s4gfSD4#t=1h35m18s) into the video. (The other person in the video is a \"truck guy\" who showed up at Jack's EV workshop, and Jack invited him to be in the video.)\n\nJack points out that EVs have some inherent advantages over ICE vehicles in a tug of war, notably the much better torque of an electric motor compared to an internal combustion engine at and near stall, and the much faster response of an electric motor at the start of the pull (he describes an electric conversion he did in which the response time for the EV was 10ms, compared to 450ms for the ICE), which means that if the two drivers hit the accelerator at exactly the same time, then by the time the F-150 gets power to the wheels, it's already being pulled backward by the Cybertruck (and thus the F-150's tires are moved from static friction against the road to the much lower dynamic coefficient of friction, which makes it tend to keep skidding). Jack claims that Neil deGrasse Tyson's physics model does not include these factors, making it too simplistic to model the tug of war.\n\nJack mentions the 2 wheel drive vs 4 wheel drive issue in the original demo, and discusses various scenarios of loading the beds of the vehicles, but notes that it's also worthwhile to compare the performance of two vehicles of comparable cost, as delivered from the factory with no further modification, to see which wins the tug of war. If one vehicle happens to weigh more than the other, then that's what the customer paid for.\n\nAlso discussed here is the anti-slip characteristic of Teslas - if I understand it correctly, the default setting is that the driver can shove the accelerator to the floor, and the vehicle will pull as hard as it can without skidding, without the driver having to pay attention to it.\n\nBoth Jack and his guest note that ICE pickups are very good for some uses, but that tug of war against an EV isn't one of them (thus perhaps explaining Ford's dismissal of participation in a rematch).", "score": 1, "replies": []}, {"body": "I think one of the things that helps Tesla here is the instant speed it can produce. While Tesla is at 60mph almost instantaneously Fords at 30mph. Can someone tell me if this has any substance?", "score": -1, "replies": [{"body": "Yes that’s a big benefit of electric. When you hit the pedal, you move instantly. As opposed to waiting for a set of fiery explosions to happen under the hood before you can start moving.\nIt does look like the Ford caught up there, then still got beat. I’ve been saying I want to see a Ford tow a Tesla, get some speed, then hit the gas on the Tesla. I still think a Tesla would win.", "score": 3, "replies": []}, {"body": "Nah, it's pretty much just all weight and traction. A semi truck is slow as fuck, but it'd haul that X backwards without even noticing that it was there.", "score": 2, "replies": []}, {"body": "If it has any effect, it's probably a lot less than many other factors in play.\nhttps://www.youtube.com/watch?v=DhM7we2Bzao", "score": 1, "replies": []}, {"body": "Instant speed could be detrimental ! If the Ford had enough traction, then accelerating sharply would have a much higher risk of making the wheels spin. Spinning wheels are wheels without traction, and it's then much easier for the Ford to pull.\n\nThe tug of war is just a question of 'which car has most traction' and doesn't reflect on any of the car's capabilities.\n\nFill the truck's bed with rubble and the result can be different : more weight on the wheels means better traction.\n\nPut super sticky tires on both cars, lock differentials, have a prepped surface and there are still many factors going on and could go either way.\n\nIMO : If we are in 'ideal' conditions and traction is perfect for both vehicles, I'd bet on the model X because it will be able to put power to the wheels more efficiently than the Ford on it's transmission from a full stop. Once the Ford engages a gear, I would bet on the Ford because it is more designed to pull weight than any Tesla so far.", "score": 1, "replies": []}]}]}
