{"title": "Cathie Wood says she’s as bullish on Tesla as she’s ever been, sees stock up fivefold in 5 years", "selftext": "Ark Invest’s Cathie Wood said her conviction in Tesla remains strong as ever as she kept buying the dip in the electric vehicle company.\n\n“Just from electric vehicles there could be... it is almost a fivefold increase in this stock during the next five years,” Wood said during an investor webinar on Thursday. “And if you believe autonomous at all, it’s closer to 13 times during the next five years. So we are as bullish about Tesla as we have ever been.”\n\nWood previously predicted that the shift to electric vehicles will be drastic, resulting in 60 million EVs sold in five years. The innovation investor has been a longtime Tesla bull, seeing shares hitting a split-adjusted level above $1,500 by 2026. Shares of Tesla are up about 3% this year, ending Thursday’s session at $127.17.\n\nElon Musk’s company has experienced a slew of bad news as of late. Tesla’s December sales of China-made cars fell to the lowest level in five months amid the country’s Covid outbreak. Musk’s rocky $44 billion Twitter takeover might have also contributed to the decline as he sold tens of billions of dollars of his Tesla shares last year to help finance the buyout.\n\n“Tesla moved down in the fourth quarter, had a dramatic rerating as the capitulation in the growth strategies was highlighted,” Wood said. “The disappointments in China were well telegraphed.”\n\nTesla dropped 53% in the fourth quarter, bringing its 2022 losses to 65%.\n\nThe widely followed fund manager has been buying the beaten down carmaker for a few months during the sell-off. Wood revealed Thursday that she took some profits in Exact Sciences and put much of those profits into Tesla.\n\nTesla has made big price cuts on its vehicles, first in China and then, on Jan. 13, in the U.S. and Europe. Wood said the aggressive price reductions will help the company stay competitive.\n\n“Tesla is going to be very aggressive in pricing,” Wood said. “Tesla can afford to do this. It’s got the lowest cost structure and is innovating we believe the most aggressively. The other auto manufacturers are going to compete. They’ll have to follow these price declines, but it will hurt them from a margin at a profitability point of view quite significantly.”\n\nSource: [https://www.cnbc.com/2023/01/19/cathie-wood-says-shes-as-bullish-on-tesla-as-shes-ever-been-sees-stock-up-fivefold-in-5-years.html](https://www.cnbc.com/2023/01/19/cathie-wood-says-shes-as-bullish-on-tesla-as-shes-ever-been-sees-stock-up-fivefold-in-5-years.html)\n\nCathie Wood says she’s as bullish on Tesla (TSLA) as she’s ever been, sees stock up fivefold in 5 years. TSLA slumped 65% in 2022, it's worst-ever annual performance. What is your current bias on TSLA?", "id": "10h2z4i", "created_utc": 1674236143.0, "score": 11, "upvote_ratio": 0.6, "num_comments": 40, "comments": [{"body": "$TSLA failed to hit my previous price target but I spent last night doing some more analysis. I am proud to say I am very bullish. My revised price target is $5,000. I calculated this by taking the current share price and multiplying by 40.", "score": 37, "replies": [{"body": "This is the way.", "score": 3, "replies": []}, {"body": "Women have a tendency to believe in mystical things that nobody can explain.", "score": -1, "replies": [{"body": "Like the clitoris", "score": 5, "replies": []}]}]}, {"body": "I thought her target was 30 folds? What’s up Cathy? You being a bit bearish now?", "score": 23, "replies": [{"body": "That was before the 2 stock splits /s", "score": 1, "replies": []}]}, {"body": "Gonna be a long time before this broken clock is right again.", "score": 18, "replies": []}, {"body": "Those fees she's pulling in from investors keeping things nice and cozy eh?", "score": 10, "replies": [{"body": "Seriously. That’s the dream. Screw actually being good at trading and engineering an actual product around that good trading concept. All you have to do is slap together a shitty ETF and use marketing buzzwords like “technology disruptor” and sit back and collect fees from all the retail holding this garbage security.", "score": 4, "replies": [{"body": "The fees are percentage based. So as the ETF does worse, they make less money. They are incentivized to do well rather than do stupid things.", "score": 0, "replies": []}]}]}, {"body": "This woman is no longer relevant in the investing community. She's or an ignorant or a scammer", "score": 11, "replies": [{"body": "I remember when we worshipped her. Licked her boots! \n\nThat’s back when people were willing to wear masks lol", "score": 0, "replies": [{"body": "Oh you're one of those. Good, makes me bullish on Tesla.", "score": -4, "replies": [{"body": "One of those on what points ? I’m just saying it was during that time period asshat", "score": 1, "replies": [{"body": "What is your stance on masks and vaccines?", "score": -5, "replies": [{"body": "I am vaccinated and don’t give a fuck what you do, mask or not or dont vaccinate, I could care less what happens to you", "score": 5, "replies": []}]}]}]}]}]}, {"body": "The delusion is strong with this one", "score": 8, "replies": []}, {"body": "Five years from now, we’ll only be five years away", "score": 3, "replies": []}, {"body": "ARKK down over 6 months, 1 year, and 5 years - what a crappy manager!", "score": 3, "replies": []}, {"body": "5 fold? 13 fold? Sounds good to me!", "score": 2, "replies": []}, {"body": "I'm bullish with other people's money.", "score": 2, "replies": []}, {"body": "Why do people listen to this last again?", "score": 5, "replies": []}, {"body": "Tesla’s market share is rapidly decreasing and more people have now realised that the cars only look nice but have poor build quality", "score": 2, "replies": [{"body": "They don’t really even look that nice, it’s like if a company selling vacuum cleaners decided they’d design a car", "score": 1, "replies": [{"body": "And haven’t bothered to update the look in years. They were cool when they first came out but damn at least change the bumpers and give it a facelift", "score": 3, "replies": [{"body": "Their resources are spread far too thin to be able to achieve this atm.  They can’t even produce vehicles that people preordered in a timely manner.  I don’t think a cosmetic makeover is anywhere on the to-do list despite all of the designs being a decade old now.", "score": 2, "replies": []}]}, {"body": "exactly this….they are probably one of the more hideous looking ev models out there, polestar, nio hell even lucid vehicles are better looking", "score": 1, "replies": []}, {"body": "Your thinking about Dyson", "score": 1, "replies": []}]}]}, {"body": "Moron", "score": 0, "replies": []}, {"body": "Beneath the veneer of a studious, wise, veteran financial advisor is nothing more than shill for garbage stocks she pumped, while she secretly dumped on naive investors who fell for her b.s.\n\nClever girl.", "score": 0, "replies": []}, {"body": "Unless Tesla kicks Musk to the curb, that stock will likely be trading below $1 by the end of the year.", "score": -2, "replies": [{"body": "I’ll bet and escrow any amount you are wrong…", "score": 1, "replies": []}]}, {"body": "It's always 5 years with her. Doesn't matter when you ask her!", "score": 1, "replies": []}, {"body": "Why is this even news anymore lol", "score": 1, "replies": [{"body": "It's not real news. It's tabloid news.", "score": 1, "replies": [{"body": "True indeed", "score": 1, "replies": []}]}]}, {"body": "This is definitely becoming a “boy who cried wolf” scenario with Cathy and it will only hurt her ability to get clients in the future", "score": 1, "replies": []}, {"body": "Tesla’s problem is the old money automakers have EVs now.  They’re already using their political power to push out Tesla and now that Elon made in known he’s not a deranged liberal, he’s losing his cult following.", "score": 1, "replies": []}, {"body": "I’m not short tech innovation. I’m just short Cathie Wood.", "score": 1, "replies": []}, {"body": "Look at the PE of any car company and tell my why I should be bullish on Tesla. With many of the major manufacturers jumping into electric, this market will only become more competitive. I don’t see anyway an already overvalued Tesla increases 5 fold in 5 years.", "score": 1, "replies": []}]}
{"title": "The bull trend continues… the road to 410…. 1-20-23 SPY/ ES Futures and Tesla Weekly Market Recap and Analysis", "selftext": "  \n\nhttps://preview.redd.it/eq2996c7aada1.png?width=975&format=png&auto=webp&s=b11e7d3b72b875176a16727be7323b29991097e2\n\nAs I mentioned yesterday in my TA and video is that I would NOT ever bet against a trend that the daily on SPY and VIX is both showing. The VIX was showing a temporary top with that rejection off the trend line and the SPY was showing a temporary bottom with that doji candle… was the perfect bullish reversal to play. \n\n&#x200B;\n\nhttps://preview.redd.it/c4qbe4r7aada1.png?width=764&format=png&auto=webp&s=597644312b5f60346aea1fc594603776181e7a3c\n\nI also mentioned in my pre market update that I based on the structure of the volatility levels that if we were to breakout over 390.4 today that we very well could see a push to 394.3 today or Monday. Bulls finally got their momentum back and they did just that. \n\n&#x200B;\n\nhttps://preview.redd.it/d6ramkc8aada1.png?width=725&format=png&auto=webp&s=219091278597c17ba66cb7787e553d3382f524a4\n\nWhen we take a look at the last 8 FOMCs… the week before FOMC has resulted in on average a move of +/- 3.99% total… that means we could be looking at a target of 380 or 409 by the EOW next week… That perfectly aligns with what I am seeing on the weekly chart and my 375.6 to 408.8 consolidation channel I have mentioned numerous times on SPY (3770 to 4095 on futes). \n\n&#x200B;\n\nhttps://preview.redd.it/2zj47ov8aada1.png?width=975&format=png&auto=webp&s=6ea64fb3a18b02b2d8c7d6c8d1ec88bb515d6f44\n\nOne thing to factor in next week is that we have the start of earnings for some notable companies… realistically the only market movers I see are MSFT on Tuesday and Tesla on Wednesday. However, MSFT is stout and has held up so well this bear market I don’t think they miss. If tesla misses well that’s expected after its terrible year and all the misses on sales this year and price drops… I would be surprised to see a tesla miss effect the market negatively at all. However, if Tesla surprises to the upside that will be very well received from the markets. \n\n&#x200B;\n\nhttps://preview.redd.it/xmrhbqg9aada1.png?width=975&format=png&auto=webp&s=f657889800a3a08334e6b554643c03c436cdb99b\n\nTaking a look at SPY daily chart here you can see we are establishing a tight little pivot area of 395.9 to 396.5 much like we did down at 381.7 to 382.6. We are also notable back in the November consolidation channel of 393.6 to 401.6. \n\nThe bulls were able to complete the handle of the cup and handle and find support at the 390.1 channel/ pivot point. This was a very bullish close to end the week. We should look for continuation into next week with this current trend. \n\nHowever much like I pointed out when we look back at the November consolidation channel we have to be very careful of the daily 200ema as there is numerous times we have seen SPY hard reject the daily 200ema. Bulls on Monday are going to wanna clean take that 200ema and close over it. If bears can reject at the daily 200ema the trend would lead us to believe in a retrace to 390.1 to 392 again. \n\n&#x200B;\n\nhttps://preview.redd.it/oisr93y9aada1.png?width=975&format=png&auto=webp&s=c34cebd3ab90ce7ee0c2bfaeeca4a8e90d772cc7\n\nTaking a look at the weekly here… I mentioned I don’t like to show the weekly chart intraweek as we can miss the actual trend. For most of the week due to the sell off we actually had a very convincing double top and a bearish engulfing candle on the weekly here… Which with a close below 390.1 that would absolutely result in further downside next week. However, bulls as I suspected came back full force today, bounced off not only the key pivot point of 390.1 they also retook the weekly 8/20ema (which just bullishly crossed). With an inside weekly candle we should expect a continuation pattern which would be upward. Pretty much for the last weeks now we have had these huge wicks to the downside. Which means price is being pushed down but is not able to close down. The trend since mid December has clearly been a slow bullish move upward. \n\nI have highlighted by the black lines here a possible inverse head and shoulders that is forming. Any one who knows me knows that I absolutely hate trading this pattern. It is a very hard pattern to see out and even harder to correctly analyze. But IF this is truly an I H&S forming then we should be looking at a breakout to 409-410 (which goes with the 4% +/- pre-FOMC meeting) before we see a drop down to 360s. \n\nNow if we ended up with a 4% green week to touch 409 area, we very well could end up with a 25bps on the 1st. Which is priced in, however, if JPOW was to say that we are for sure going to see 25bps again that would be pretty bearish. The market is very convinced that we are going to see a pause here after this meeting…. Some are even convinced that we are going to pause this meeting. \n\nThat COULD start the cycle down. But honestly I don’t think based on price action that alone will be enough… we would need to see some huge misses on earnings by companies like Apple, Google, and Amazon in order to really see the downside push happen. \n\nFor me I am looking for at least a breakout to 410 next week (if not the week after). From there we have reached the top of my consolidation channel. There is a chance we break out to 428 area, however, I would more likely than not expect a retrace back to 390.1. \n\nFor me this is simple… over 390.1 (and confirming it as support like today) I am bullish and will look for 410 to 428. Once we reject there I will look for a retrace back to 390.1. \n\nNext week we are going to test 401.9 if this momentum keeps up. That is the weekly bear channel resistance line. If we were to break through that level that would effectively be telling me that we are bullish and that the bear market really is over. However, in the chance this was the top and we hold under that level the case of this really being a short peak grows more. \n\nKey weekly support- 390.1 -> 383.1 -> 375.6\n\nKey weekly resistance- 398.7 -> 408.8 -> 417.7\n\n&#x200B;\n\nhttps://preview.redd.it/k8dq0foaaada1.png?width=975&format=png&auto=webp&s=67001b57e0d0e4f5c76f0a3ff4e86d8a2280b9a8\n\nA really beautiful and bullish close here for futures. We came down yesterday and ended up with a 3920 support bounce. Not only that but bulls were able to recover and close back over the daily 8, 20 and 100ema. The next step is bulls to test resistance at 4000. \n\nFutures is also back within that 3945 to 4035 channel from Novembers here too. \n\n&#x200B;\n\nhttps://preview.redd.it/ot4c4l7baada1.png?width=975&format=png&auto=webp&s=a8589a587fca49714a5eae2a64e99649abb4b49f\n\nWeekly wise seeing that same inverse head and shoulders (its not perfect either like SPY because the “head” isn’t low enough really). If that pattern was to play out we would touch 4030 before we see a retracement to 3600. But again I do not forsee that playing out without some very big bear catalysts. \n\nHowever I have highlighted on here 7 weeks post collar and 11 weeks post collar… why are these significant? Well generally speaking the trend is that post collar the market picks a direction and for at least the first 7 weeks holds that same trend. IF that case is holding true here that means until the 2nd week in February the markets have more upside to run. As you can see that would very well on this current trajectory put us in that 4095 to 4280 area. \n\nKey resistance for the bear market weekly trend line next week comes in at 4105 which is just over our channel consolidation resistance of 4095. \n\nKey weekly supports- 3970 -> 3920 -> 3860\n\nKey weekly resistance- 4095 -> 4280\n\n&#x200B;\n\nhttps://preview.redd.it/qskylopbaada1.png?width=975&format=png&auto=webp&s=5784e7bf912520136357b67385fb4e8489edf0a9\n\nI was very bearish on tesla for a while here intraweek and I fully expected us to break down to 120s… however, what we ended up with was a very bullish breakout on Tesla. Currently tesla daily is working its way on a rising wedge here. After a huge breakout to 136 with a rejection, we came back down and not only found support holding the daily 8ema, we also close back over the daily 20ema. \n\nWith 9 daily closes in a row over the daily 8ema this is the most closes Tesla has had over its daily 8ema since the middle of September when this sell off started. Interestingly enough we actually had exactly 9 closes over the daily 8ema before the huge sell off started. \n\nNow something to note here on Tesla is that the daily 8ema is presumably about to crossover the daily 20ema here as early as Monday depending on where tesla goes. I remain bullish on Tesla until this red rising wedge breaks down. \n\n&#x200B;\n\nhttps://preview.redd.it/pvyezr6caada1.png?width=316&format=png&auto=webp&s=d301f6d4c8c4246c7ec795b82d23348e4ac30039\n\nInterestingly enough Tesla has opened +/- 3.56% on average over the last 5 opening after the weekend. \n\n&#x200B;\n\nhttps://preview.redd.it/u9bzcuncaada1.png?width=975&format=png&auto=webp&s=a639a1b626bcad5f44da5ca42800f3945deb73f9\n\nLast week I mentioned on Tesla that I was bullish due to the v bottom but I was bearish because we had rejected at 123 so many times. This week the bulls finally broke through both falling wedges. The most important falling wedge that was broke was the red one which dates back to the middle of September when this sell off started. With this resistance broken that presumably is very bullish for Tesla. \n\nI would have liked to seem a slightly different structure on this weekly candle, however, bulls were able to rally enough EOD to make this weekly candle into a bullish continuation candle. \n\nWe should look at a retest of the weekly 8ema for the first time since October next week. \n\nIf bulls can close over the weekly 8ema we should and could look for a bigger breakout here on Tesla, however, if bears are able to reject us at the weekly 8ema then I would not be surprised to see us drop back to the low 100s. \n\nTesla reports earnings Wednesday night. I would not be surprised to see a miss and honestly the market probably expects one too because of the fact that the delivery and sales numbers have been missing constantly. However, IF tesla some how surprises to the upside or gives great guidance we could very well see a massive breakout start here on Tesla… especially if the markets stay bullish like it is now. \n\nIf we get a huge miss on earnings and we close the week out below 123 next Friday I would not be surprised to see us potentially break into the 90s finally. \n\nWeekly support- 122.6 -> 112.9 -> 94.4\n\nWeekly resistance- 133.3 -> 149.9\n\n&#x200B;\n\nhttps://preview.redd.it/bymsypwdaada1.png?width=523&format=png&auto=webp&s=a0176d2155503b3e114c229647a82eabdf22951d\n\nThe VIX traded below 19.6 for most of the day today however was able to recover and close back over that 19.6 level EOD. We are still maintaining this falling wedge on the VIX here which keeps me bullish as long as we see the VIX below that blue resistance line. With a closure back under the daily 8ema and a rejection at the daily 20ema today, we should really look for a bigger retrace on the VIX. \n\nWE could see the VIX push for a new 52 week low next week. The falling wedge could still play out with seeing a spike come the week of FOMC. \n\n**Weekly log and trading recap-**\n\nThis was probably the best week of trading mentally and results wise I have put in in many months. \n\n&#x200B;\n\nhttps://preview.redd.it/00zt8pceaada1.png?width=563&format=png&auto=webp&s=3bb203c6979fe225897317b06c0d85d6a1fd1745\n\nThis was the first week I haven’t done a swing trade in probably 4-5 months. This also is the first week in well over 9 months that I have not done a single scalp. I only played slightly longer dte level to level plays this week. \n\nHonestly this market this whole week felt like we were trading back in 2021 and early 2022. This was some of the best, smoothest and most tradeable price action I have seen in probably a year honestly. I would not mind one bit if this is how the markets behaved for the foreseeable futures as the results speak for themselves. \n\nNow I said that I did not do any swing trades, however, something to note is I DID play some 14-30dte plays and I DID swing those. But those really are longer time frame level to level plays. Those are what I would consider a swing which is usually a 1-3dte high risk high reward play \n\nMy max drawdown on any “swing” this week was 35% and that was on the 30dte tesla puts when we touched 136. \n\nNot taking any scalps this week was purposeful and honestly I really loved the change. Playing only level to level trades has been amazing. I love scalps and they are so fun and the high risk to reward is great. However, lately the risk to reward has not been there for the scalps anymore for me at least. \n\nThe extra theta decay, massive IV swings and overall terrible premium pay outs has made trading scalps for me no longer worth it. \n\nIn regards to swing I really do still enjoy those but I am pulling back slightly on those as the market still at open has been slightly irrational as we have seen with massive red openings that turn green or massive greens that turn red. Swings are some of the highest risk to reward trades we do. They have to be played tactfully.", "id": "10hcqxm", "created_utc": 1674257767.0, "score": 117, "upvote_ratio": 0.93, "num_comments": 43, "comments": [{"body": "I agree with you. Don’t think 0dte plays are worth the risk these days, especially on SPY.", "score": 24, "replies": []}, {"body": "One of the rare actually good and reliable DD/technical analysis here", "score": 13, "replies": []}, {"body": "You are SOOO helpful always! Of course you can’t predict everything correctly but I usually make good money based on your analysis daily. Thanks a lot!", "score": 11, "replies": []}, {"body": "Big disconnect between Feds projected funds rate vs market projected funds rate. About 70 bp. Who is wrong- Feds or Market?", "score": 9, "replies": [{"body": "Market", "score": 2, "replies": [{"body": "What makes you say that? Market has been front running and leading the fed since early 2022.", "score": 4, "replies": [{"body": "Since 1950", "score": 1, "replies": []}]}]}, {"body": "What do you mean? Fed wants 5%+ rate near term. Market is guessing 3.5% core cpe and a pivot in H2. Speakers have said if 3.5% does happen then a cut is possible as early as this year. Market is trying a front run but they seem to agree, at a big risk on the market side if they’re wrong", "score": -3, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Waller on Friday", "score": 0, "replies": []}]}, {"body": "Every fed speaker has said they will keep rates higher so inflation doesn’t come back. Not a single mention of cuts this year. So, market getting way too ahead.", "score": 3, "replies": [{"body": "Waller on Friday. Market went sideways, he started his speech at 1pm and the vol picked up, then the Q/A he was all doves and we ramped. Not paying attention?", "score": 0, "replies": [{"body": "Saw the segment, only mentioned favoring 25bp vs 50bp, no mention of pauses or cuts. Market rallied because pace of hikes slowing, doesn’t mean terminal rate is going to be lower.", "score": 1, "replies": []}]}]}]}]}, {"body": "I am again on the wrong side of a TSLA trade.", "score": 7, "replies": []}, {"body": "NoobQ - what time frame are you looking at for the actual trend? I’m new to trading and gaining a pretty decent understanding of the analysis of charts, but not sure what I’m looking at to find potential future movements.", "score": 3, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "When you mention level to level what exactly are you referring to. Bounces of ema’s?", "score": 2, "replies": []}]}]}, {"body": "Great content as usual. Hope we are bullish next week I have the following active trades:\n\n 4 MSFT 245 calls exp 2/17 \n12 CROX 130 calls exp 2/17\n35 HSY 230 calls exp 3/16", "score": 3, "replies": []}, {"body": "What do you mean when you say “slightly longer dte” level to level trades? If you aren’t swinging then your entering and exiting these the same day right?", "score": 3, "replies": [{"body": "I really enjoy reading this daily by the way. Keep up the good work!", "score": 3, "replies": []}]}, {"body": "I started adding 90dte April expiry 3900P when we were around 3950. I'll probably reposition and try scaling again if this rally continues. The intraweek volatility has been something else with sentiment swinging wildly and with conviction. No idea what to expect next. I'm done with shorter dte unless it's to short puts to turn my long puts into calendar debit spreads.", "score": 3, "replies": []}, {"body": "Can't wait to the fed meeting it's going to print ![img](emote|t5_2th52|18632)![img](emote|t5_2th52|18632)![img](emote|t5_2th52|18632)", "score": 4, "replies": []}, {"body": "Cem Karsan says that we are at the Covid March 2020 lows of bearish positioning. Therefore, we rally hard all the way til Feb OPEX. After that, good chance of massive red.\n\nhttps://www.youtube.com/watch?v=KADIYqACuMo", "score": 2, "replies": []}, {"body": "Amazing analysis !", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "all this work when you can simply buy calls whenever a fed other than Jpow talks", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 0, "replies": []}]}, {"body": "Tldr pls.", "score": 1, "replies": []}, {"body": "TLDR: Could go up, could go down", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|18630)", "score": -2, "replies": []}, {"body": "410 ain’t happenin, padna", "score": -4, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "It happen pretty sure", "score": 2, "replies": []}]}]}, {"body": "Everyone make sure to inverse this guy. He was calling for SPY 350 not that long ago.", "score": -20, "replies": [{"body": "Not that long ago the market was different. You have to change your thesis almost weekly and sometimes daily with the amount of shit algorithms and news affecting the market.", "score": 6, "replies": []}, {"body": "If you follow him properly you can easily make money", "score": 4, "replies": []}]}, {"body": "me pumped too 12:14 pm onwards .. after a long memory 2 yrs on opex green day \n\n[https://stocktwits.com/711Coffee/message/507583719](https://stocktwits.com/711Coffee/message/507583719)", "score": 1, "replies": []}, {"body": "Is anyone pricing in the expected downward revision in 2023 earnings guidance coming out of over the next 3 weeks. I know everyone is expecting the Q4 data to be down but I feel like most are discounting how bad the guidance is going to be across the board. All of the recent layoffs in the previous two weeks as companies finalized guidance is a pretty good indication that they are going to drastically reduce their forward looking guidance which I would guess is going to impact share value much more than historical data.\n\nIf forward looking EPS estimates drop even 5%. I would expect a downward revision of the index to be a huge drop say /ES - 3800…assuming rates hold.\n\nOne other item of note for PPI/CPI. Most suppliers update pricing agreements in January on an annual basis. This threw the PPI number way up in 2022. I fully expect the same increase in January which would see if the FEB PPI number.", "score": 1, "replies": []}, {"body": "Fuck it might aswell load up 410 on Monday OpEx was huge pivot", "score": 1, "replies": []}]}
