{"title": "Why is Intel stocks rising?", "selftext": "I am new to stock trading therefore I think I don’t have enough basics. So, Intel’s stock price is low compared to other tech companies like NVDA, microsoft, etc. why is it so?\n\nFurthermore it is rising for some period of time. So, I am wondering why is it rising right now and does it show any sustainability. Since it has hit highest of around 69 dollars in 5yrs. Is there any reasoning that it might go above and beyond that value considering comparatively low stock prices?\n\nIt seems like basic knowledge but I dont know whom to ask. I just \nwant to know how to assess these kind of questions.", "id": "18rcndb", "created_utc": 1703610189.0, "score": 24, "upvote_ratio": 0.64, "num_comments": 67, "comments": [{"body": "Because i sold earlier. 🥂", "score": 156, "replies": [{"body": "Lol bro 🤣", "score": 16, "replies": []}, {"body": "Thx for your offering to saint patty G", "score": 6, "replies": []}, {"body": "Bro took one for the team !", "score": 4, "replies": []}]}, {"body": "What most people don't realize is that Intel is a semiconductor foundry (competing with TSMC etc) as well as a CPU IP company (competing with AMD etc). If the new CEO comes through by delivering on his promises, there's a lot of potential upside for the company to place itself as an independent foundry. With the CHIPS act and focus on homegrown tech within the western world, Intel has the potential to be so much more. But as with everything in business, execution is key. As the other comments have eluded, they have done a okay job so far.", "score": 57, "replies": [{"body": "This vertical integration will be a meaningful advantage", "score": 13, "replies": [{"body": "In 2030 maybe.", "score": 4, "replies": [{"body": "Exactly, by the time it’s proven advantageous they will have a long lead", "score": 1, "replies": []}]}, {"body": "it had been a disadvantage in past. turns out companies that focused on tough job on designing the chips without bothering about the tougher job of manufacturing did much better in last decade.", "score": 1, "replies": [{"body": "\\> it had been a disadvantage in past\n\nIt had been both an advantage and a disadvantage  for the past 40 years or so. This cycle keeps repeating. Intel has been in very similar situation at least 3 times already. It was a disadvantage \\~2000 then \\~10 years later it was a massive advantage to an extent that Intel pretty much monopolized the market and nobody could compete with it for another 10 years.", "score": 2, "replies": []}]}]}, {"body": ">Intel $INTC is up 78% this year with earnings down 71% Q/Q and sales down 40%\n   \nhttps://twitter.com/malone_wealth/status/1738026807432298848?s=42&t=i2nWwXGzvFOf-Khjbe2X0Q", "score": 4, "replies": []}]}, {"body": "Because when it was at $26 everyone on Reddit said it was done.\n\nMoroons", "score": 13, "replies": []}, {"body": "Because after China’s threat to invade Taiwan and thus take over Taiwan Semiconductor Intel has become the most important company for national security point of view in the world for NATO countries.", "score": 33, "replies": [{"body": "That's not exactly breaking news.", "score": 4, "replies": [{"body": "It is to all the people who don’t know why number go up.", "score": 1, "replies": []}]}, {"body": ">Because after China’s threat to invade Taiwan \n\nSo like like back in the 1950s? China has been threatening to invade Taiwan for forever.", "score": 0, "replies": []}]}, {"body": "Because Israel gave them 3bil $ to make a plant there", "score": 66, "replies": [{"body": "The plant is already there, one of several. The money is to expand it drastically.", "score": 22, "replies": []}, {"body": "And US gave Israel $3 billion to sweeten the deal.", "score": 46, "replies": []}, {"body": "You mean Isreal gave them 3bil  american tax payer $ to make a plant there", "score": 7, "replies": []}, {"body": "people on this sub literally cant even fucking google. but they will spend way more time going to reddit, and typing up a fucking essay on why theyre so goddamn clueless\n\n[https://www.google.com/search?&q=intc](https://www.google.com/search?&q=intc)", "score": 15, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Take their money.  Hehehe", "score": 1, "replies": []}]}, {"body": "Bro idiots double down on their stupidity instead of gaining knowledge, it’s quite common.", "score": 1, "replies": []}]}, {"body": "Thats the answer on the day. They went from having to potentially come out of pocket to being paid that money", "score": 2, "replies": []}, {"body": "So American tax payers gave them 3bil?", "score": 2, "replies": []}]}, {"body": "When looking at stock prices, look at the market cap not the stock price.  Intel is going up because there has been positive news.", "score": 11, "replies": []}, {"body": "Chip slump is bottoming, IFS 2.0 (Intel's turnaround plan) has generally been on track (at least for the last year), governments are giving them billions to build fabs.", "score": 6, "replies": []}, {"body": "before the bull run, intel's deep down there in $2X for long times cuz their chip is outdated compare to competitors with ai chip exposure and intel plants with huge investment got delayed  cuz it could cause a lot of debt but things getting reverse as intel working on nvidia in some way off for ai and pay good dividend which mean intel is still in the game. just one step behind nvidia and amd. \n\nand value see the opportunities  that intel can get some market share back,  if they can sort things out this bet will double in value ,and others thing are nvidia's overvalued by a mile. and they have to sustain the exposure and market share as well.\n\nin best case, intel could hit 100 next 2 years, in reasonable case, i think around 70+ is achievable next year", "score": 10, "replies": []}, {"body": "I sold at $31. You’re welcome for the gains", "score": 4, "replies": []}, {"body": "All stocks rise for one, and one reason, there are more buyers than sellers. That is all anyone needs to determine to pick a winner. It is the irrefutable law of supply and demand.", "score": 3, "replies": []}, {"body": "Price does not determine how successful a company is.  For example, Stock A has a price of 10 dollars with 100k shares outstanding.  Stock B has a price of 100 dollars, but only 10,000 shares outstanding.  Both have the same market cap of 1M.  \n\nAs to why it's rising, the short answer is there was more demand for the stock than there was supply of shares being sold.  The blunt answer is that the WHY doesn't matter.  When people want to know \"why\" it's often because they're trying to apply the same 'WHY' to another stock before it happens so they can profit from it.  This is a losing endeavor.  The stock market is a game of probabilities, not predictions.  \n\nMy advice: study technical analysis, learn about probabilities, and find a strategy that fits your personality.  These will make you much more successful than figuring out why.", "score": 5, "replies": [{"body": "This guy gets it!", "score": 2, "replies": []}, {"body": "Wouldn’t it be helpful for your fundamental assessment to know what makes a company’s stock more in demand? \n \nI understand that you would then apply that same rule to other companies but if those are tech companies in the same sector wouldn’t that be helpful?", "score": 1, "replies": [{"body": "Depends on your timeframe.  If you're a daytrader or short-term swing trader, fundamentals aren't needed.  Any shitty company can move 10-20%.  But if you're a longterm investor or longterm swing trader, then you definitely need fundamentals on the table.  It also depends heavily on your strategy; value investors rely on fundamentals more than trend traders.  I can't speak for other strategies, but I would never buy a stock purely based on fundamental analysis.  Price action is always number one.", "score": 1, "replies": []}]}, {"body": ">Price does not determine how successful a company is.  For example, Stock A has a price of 10 dollars with 100k shares outstanding.  Stock B has a price of 100 dollars, but only 10,000 shares outstanding.\n\nAre you trolling?\n\nNobody is talking about specific prices when comparing the \"prices\" of different stocks. They mean P/E, P/S etc ratios.", "score": 1, "replies": [{"body": "Are you trolling?  OP didn't mention P/E, P/S, or ratios.  His quote was \" Intel’s stock price is low compared to other tech companies like NVDA, microsoft, etc.\" so, yes, he was talking about specific prices.", "score": 1, "replies": [{"body": "Then the post is just spam and should deleted.", "score": 1, "replies": [{"body": "Na he's just a beginner.   I've had plenty of beginners ask me that same question.  Recently just a few weeks ago my friend asked me \"why is Chipotle 2k but apple only 180, Apple should be worth more\".   They just don't know.", "score": 1, "replies": []}]}]}]}]}, {"body": "Intel & AMD is by far the biggest competitor to Nvidia in the AI Chip Race", "score": 2, "replies": [{"body": "Ok", "score": 1, "replies": []}]}, {"body": "Because when china told the USA to get the fuck out of Taiwan so they could take it back over the USA passed the chips bill and papa Pat got back in corporate. That’s where the deals started flowing across the globe to make new factories. NVDIA stated they could possibly source from intel since they face shortages. Intel pays decent dividends, they make great cpus and are a front runner in fueling the AI race. I literally can’t think of one reason to sell at its current momentum.", "score": 2, "replies": []}, {"body": "because Intel, the tech giant, has been granted a substantial $3.2 billion subsidy by the Israeli government. This financial support is earmarked for the construction of a cutting-edge $25 billion chip plant in southern Israel. The primary goal of this funding is to bolster the establishment of this state-of-the-art facility, playing a pivotal role in enhancing Israel's semiconductor industry and fostering technological growth in the region.", "score": 2, "replies": []}, {"body": "I bought at 28.xx and still hodl.", "score": 2, "replies": []}, {"body": "Tech stocks are having a good year... Intel is a tech stock.", "score": 1, "replies": [{"body": "It must be having a good year, I wish I was a tech stock", "score": 6, "replies": [{"body": "Fho sho", "score": 1, "replies": []}]}]}, {"body": "The price went up so people bought with the hope that the price would keep going up. The price kept going up so even more people hopped on the bandwagon hoping the price would keep going up. This cycle continues until more people sell than are buying and the price will start to fall. \n\nThere are a load of other factors but that’s the gist.", "score": 1, "replies": []}, {"body": "Instead of typing that on Reddit, you could’ve typed in google and the article will pop up", "score": 1, "replies": [{"body": "Ah yes a shitty article that doesn’t get to the point until the last paragraph", "score": 5, "replies": []}]}, {"body": "Hype of AI, I feel dumb selling early but there’s no fundamental change to intel’s erosion of market share to AMD and nvidia, and consumer electronic are on a decline now, especially PC. Their fab can be another selling point for stock price but honestly I can’t imagine how it would be truly successful with sky high production cost in the states compared to Asia", "score": -6, "replies": []}, {"body": "Its just fugazi", "score": -4, "replies": []}, {"body": "On hope and hipe", "score": -1, "replies": [{"body": "hipe? hipe hop? hipe hop anonymous?", "score": 6, "replies": []}]}, {"body": "The entire semiconductor sector has been rising. INTC has underperformed AMD and NVDA year to date. \n\nDo with that what you will", "score": 1, "replies": []}, {"body": "Because I thought about buying it 6 months ago but didn't", "score": 1, "replies": []}, {"body": "Because computer", "score": 1, "replies": []}, {"body": "They are doing good bussiness", "score": 1, "replies": []}, {"body": "https://finance.yahoo.com/m/26acb66a-046a-3ba7-aee5-5123c03c276c/intel-stock-rises-on-plans.html", "score": 1, "replies": []}, {"body": "Idk, but I sold last week.  After a ton of losses, I’m taking the gains and running, lol", "score": 1, "replies": []}, {"body": "Change in sentiment that was followed after positive news (new fabs,  AI chips, new desktop/laptop chips that are way better than previous generation,  new graphics cards announced, some lauoffs)", "score": 1, "replies": []}, {"body": "I bought calls Friday before the holiday weekend. INTEL is PRINTING me money right now.", "score": 1, "replies": [{"body": "Bravo", "score": 1, "replies": []}]}, {"body": "CHIPS act?", "score": 1, "replies": []}, {"body": "Because it’s the de facto government chip company and the best suited to be a foundry. If us “on shores” chips then intel will be the winner", "score": 1, "replies": []}]}
