{"title": "I used AI, behavioural economics and alternative data to create a stock market indicator", "selftext": "For the past couple of months Ive been working on a bellwether indicator for the stock market. I used insights from behavioral economics, an alternative dataset and AI to turn this in to practice. Below I worked out the thought process behind the indicator which I wanted to share and bounce ideas off.\n\n&#x200B;\n\n The thought proces behind the indicator is divided in to the three components already mentioned, a behavioural psychology part, an alternative big data part and the AI part. Or just scroll down to see the final result compared to the S&P 500.\n\n**The psychology part**\n\nThe fact that you are more cautious when you just witnessed an accident is called availability bias in the school of behavioural finance. It describes the notion that people judge the probability of something happening more likely when an example more easily comes to mind. So for example you probably overestimate the probability of a shark attack when you have just read about in the news. You could argue that the same goes for economic principles. People are more likely to believe inflation is coming when the news is full of it. Or that a recession is coming when everyone is tweeting about it. Or that a stock is going up when its all over Reddit. Point is that news can drive the market, rather than just report or follow on it. In this respect also the recent work of Nobel Prize winner Robert Shiller is relevant. His book Narrative Economics describes how stories can propel economic events. But how can one assess what people are reading, or what news they are exposed to? This is where alternative data and AI play their part.\n\n**The alternative data part**\n\nTraditional finance data is usually nice to work with, it is clean, nicely structured and most data is readily available. Unfortunately that is also it’s drawback, since everyone is looking at it, it is hard to gain an edge. Alternative data however usually is instructed and messy, but it is unique. One of the largest alternative data sources is the internet. Terabytes of data are generated every minute and with this indicator we want to take advantage of that.\n\nTherefore I created a dataset with financial news articles from well know websites, financial tweets and other sources of financial news combined to one large dataset with unstructured alternative data. With this data we can see to what news investors are exposed to. And here is the cool thing, if we think about our behavioural flaws discussed in the first part, we can make a prediction as to where investors’ availability bias is headed to. Put differently, is we know if investors are reading more negative or positive news, we can try to predict if their investment decisions will be positive (i.e. long) or if they will be negative (i.e. short). Unfortunately going through all this data and seeing for every news article, tweet etc whether it’s positive or negative is quite undoable. But here is the good news, we can let a computer do that and that is where the AI part comes in.\n\n**The AI part**\n\nAI is getting smarter and smarter almost daily it seems. And more importantly, big AI libraries are available to everyone with a computer running Python. Google (TensorFlow) and Facebook (PyTorch) are so kind to make their AI libraries open source, which puts some really powerful tools at the tips of your fingers. In this case we will let AI do two tasks:\n\n\\- Read headlines (ML zero shot sentiment classification)\n\n\\- Predict returns over a certain horizon\n\nFor this paper we will only discuss the first task, the next one is for another post.\n\nTo summarize the first two steps, first we discussed how people are influenced by what they read, second we showed that with alternative data we obtain what they read. The next (and hardest) part is actually reading and classifying. Since we have about 1000 daily news articles we have to let a computer to this, which we do by means of AI/Machine learning. We can use a model that is trained to classify a string of text as either optimistic (scoring it with a max of +1) to pessimistic (scoring it with a minimum of -1). How we do this is quite technical and will be explained in a different post, but the end result is a dataset of more than a million articles classified from +1 (optimistic) to -1 (pessimistic). Now the final step, checking whether the theory we proposed in the first part holds any truth when checking the data.\n\n**Tying it all together**\n\nSo to recap, academic research shows how news can influence investor sentiment, we have alternative (big) data that contains all this news, and we have a computer that can interpret that news faster than any human can. You can check out how this graphically looks on: \n\n[https://www.alternative-analytics.eu/indicators/](https://www.alternative-analytics.eu/indicators/)\n\n&#x200B;\n\nThe dashed line shows the S&P500, the other one our sentiment indicator. The vertical axis shows sentiment (negative to positive) and the horizontal axis is time. You can clearly see how sentiment was already decreasing before the market collapsed under COVID fear. Interestingly you also sentiment improving before the market recovered. So at the least we can see from that this plot that there is a relation between our indicator and S&P stock prices. This shows how new technology and improvement in AI is giving us a new way for looking at the market.", "id": "kd0zlu", "created_utc": 1607963737.0, "score": 624, "upvote_ratio": 0.97, "num_comments": 90, "comments": [{"body": "\"People are more likely to believe inflation is coming when the news is full of it. Or that a recession is coming when everyone is tweeting about it. Or that a stock is going up when its all over Reddit. \"\n\nYou may want to do a deeper dive on the \"who\" behind the tweets and posts. Just because people are talking about something doesn't mean that they are intending for the stock to go that way - e.g. hyping up a stock when a big player is looking to cash out and conversely, trashing a stock when a big player is trying to get in cheap. You saw a lot of the former with a lot of the escalated messaging around the reddit meme stocks. I can't say that this was nefarious agenda pushing or just the equivalent of the barber giving stock advice, but the same holds true anyways. Social media gives everyone a voice with the false pretense of everyone's voice requiring the same value.\n\nTo your datasets:\n\n\\- Structured finance data is your gold standard.\n\n\\- Alternative datasets are fine, but might impose a LOT of noise due to variability. Then again, not sure what kind of datasets you're working with here.\n\n\\- People tweeting and redditing. This is a project in itself. You're doing classification, semantic analysis and content filtering and general analysis on account \"truthiness\"\n\nFinally... correlation is one thing. You're looking for causal. The way the HFT traders do this is intercept where the money is going and just assume that big money = big money already did the hard research part and they know something. They basically let everyone else do the hard work and open up shop next door (cough..cough..BurgerKing)\n\n&#x200B;\n\n**Finally...**Nice work on putting the data together into a visual representation. Analysis and reporting is nice, but where are the insights. What do we take away from looking at the graph? Where are the aha/trade-able moments on your graph.", "score": 88, "replies": [{"body": "Thanks for the elaborate review, picking out some of your remarks;\n\n- dataset is a personal database which has a very robust structure, and I fully agree that this is invaluable. Due to the structure it’s relative straightforward to run new analyses\n\n- sentiment analysis indeed is a work on itself. I’ve gone over it here pretty quick but there is quite some work behind it\n\n- in the future I’ll elaborate some more with some textual updates.\n\nAgain thanks for taking the time to give your opinion on this", "score": 28, "replies": [{"body": "Best of luck!!", "score": 4, "replies": []}, {"body": "Would you mind sharing how you organized the database?", "score": 3, "replies": []}]}]}, {"body": "So it looks like there has been a recent sizable drop in sentiment. So we could expect that there may be a drop in the SP500 soon?", "score": 38, "replies": [{"body": "No that drop is the current day. Since its probably only the news in the (european) morning its still small and it gets updated throughout the day. So current day sentiment is pretty volatile and is only final untill the next day.", "score": 29, "replies": [{"body": "Thank god, the graph almost gave me a heart attack when I seen the current sentiment dip  \n\n\nsidenote: this is amazing work!", "score": 9, "replies": []}]}, {"body": "Any reason why you're including the current day since it's not accurate (and because it draws wrong conclusions?) Or better yet, any way to get a more accurate real-time approximation?", "score": 2, "replies": []}]}, {"body": "have you traded using this information?\nif yes how well did that work?", "score": 17, "replies": [{"body": "Yes personally I have, most importantly pre-covid crash. That worked out pretty well.", "score": 5, "replies": [{"body": "Really?\nYou should have mentioned that in the original post!!", "score": 3, "replies": [{"body": "I dont want to give the impression that this is some magical indicator that is going to predict every crash. Rather I would like to see if people believe in the hypothesis and then this could be a helpful indicator, that is just a piece of the puzzle.", "score": 16, "replies": []}]}]}, {"body": "Asking the important questions.", "score": 4, "replies": []}]}, {"body": "I feel like in Business school they always touted the 'Efficient Market Hypothesis' so much where stock prices are mostly rational and news is priced in automically.  I believed that in the few years after graduating in 2012.  Though the last year I've done a complete 180.  It's obvious that so much of a stock's price is based on perception, future expectations, and sometimes delusion.  When Tesla's market cap is more than Ford, GM, Toyota, Honda, Volkswagen *combined,* there is something seriously wrong.  Tesla sells 500,000 vehicles per year.  Those 5 previously mentioned companies sell more than *36 million* vehicles per year.  \n\n\nI think being able to quantify that investor sentiment like mentioned in the research will definitely help investors make sense of what seems to be a nonsensical market.", "score": 18, "replies": [{"body": "I’m not a Tesla bull, but hearing people talk about it like the point of buying a stock is for the snapshot of how it’s performing today instead of in the future makes me think it might not be over valued", "score": 2, "replies": [{"body": "Aren’t all companies by virtue of looking out for their shareholders “meant” to do great things in the future?", "score": 1, "replies": []}]}, {"body": "If you like to read more academic work related to this I can recommend Andrew Lo's Adaptive Market Hypothesis. It takes what works from EMH but, more importantly, theorizes really well on why it is flawed.", "score": 2, "replies": []}]}, {"body": "Following", "score": 16, "replies": []}, {"body": "looking at the graph there seems to be some interesting sentiment indications to sp500:\n\n1. sentiment for march crash predicted sp500 crash\n2. sentiment lift also predicted sp500 recovery\n3. sentiment sustained through sept 1 crash\n4. no one expected nov 1 spike until it happened\n\nat the beginning of the year sentiment was a good predictor but now it's a lagging reactionary indicator", "score": 11, "replies": [{"body": "That just means the market is about to go into ADHD kangaroo phase.", "score": 12, "replies": []}]}, {"body": "I just ask Siri what I should buy into every morning.", "score": 6, "replies": [{"body": "Alexa always tells me she can’t help with stonks", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 4, "replies": [{"body": "The calculation of sentiment has been pretty steady over the past year. I’ve played around with scaling a bit but that doesn’t change much comparing levels over time. But I agree that a longer time horizon would be better, only at this point I don’t have that data.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Ah I see. I think there is some misunderstanding on the term sentiment. In this case sentiment is the daily average of scoring headlines, tweets by determining if they are positive or negative (in more detail explained in the write up). There is no fitting of daily data here (so no lookback bias or confirmation bias).\nSo it is not sentiment as sometimes used by indicators that proxy this buy looking at buying/selling/volume data (so not sentiment as used in technical analysis mostly). It is raw sentiment in the original sense, so seeing if there are more negative headlines than positive headlines (put simply, the algo is a bit more sophisticated). \nLong story short, there is no fitting the data from hindsight perspective.", "score": 1, "replies": []}]}]}]}, {"body": "So have you used any data pre jul 2019?", "score": 5, "replies": []}, {"body": "i love numbers, stats, and charts.  impressive work.", "score": 5, "replies": [{"body": "Thanks!", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "The whole premise of this “indicator” is flawed anyway. Hate to break it to OP but retail traders reading Bloomberg.com and Motley Fool articles don’t drive the market. At all. So the predictive ability of this is nil.", "score": 13, "replies": [{"body": "Those retail traders make up a statistically insignificant portion of the market. I'd be surprised if it's even 1% by daily volume.", "score": 5, "replies": [{"body": "This is not entirely true. Its about the **marginal** buyer and seller, so a small part of the volume can drive a relative larger part of the price", "score": 4, "replies": []}, {"body": "That’s a big piece of what I’m saying. Institutional trading volume aka the only volume that matters is not being swayed or guided or affected or whatever by “articles,” they have their own in house or bespoke institutional research. I do believe sentiment analysis is real but again, the quant firms running sentiment analysis are going to be doing so using models 10,000x better than something someone coded up in their bedroom, making this a cool project but absolutely worthless in all practical sense.", "score": 2, "replies": [{"body": "I work in asset management and you would be suprised how little it used. Quant firms are more active in a space with a much smaller time horizon. With sentiment analysis there isnt anything you can arbitrage. For larger asset managers there isnt enough historical data, so they also wont put a bulk of the assets in to a strategy with only a few years of historical backtesting (rightly so). Most of the (non-hft) quant work is (still) on factor models.", "score": 3, "replies": []}]}]}]}, {"body": "I wont claim that is this holy grail or anything. That said also in academic literature that is many related work that supports the hypothesis, Robert Shillers Narrative Economics and Andrew Lo's Adaptive Market Hypothesis both hypothesize how human flaws make the Efficient Market Hypothesis not always hold.\n\nWorking in asset management industry and having an academic background I know that there is not enough data here to claim that this will always work. But you can also not claim here that it doesnt work. In my opinion the data for now shows that there is some relevant info to be obtained from this dataset.", "score": 2, "replies": [{"body": "Great job man, I started working on something similar myself.  Word of advice as far as reddit goes, when someone is clearly wholly negative and replies to your post like this, just leave it alone all you end up doing is harboring downvotes. Speaking from experience.", "score": 1, "replies": []}]}]}, {"body": "This is really interesting. I actually wanted to look into trying to do something like this not long ago, but I couldn't figure out where/how to source the data. Would you be willing to provide a general description of what to look for if one wants to screen massive amounts of news like this?\n\nAlso definitely seems interesting, but what about more specific applications? Since as you look more narrowly than the whole market, the amount of data obviously starts to decrease, which is a huge problem for machine learning. Have you experimented with more focus in any way?", "score": 4, "replies": [{"body": "I’ve been working a couple of years on the dataset now, so it does cost some time. Basically I have set up a server which collects over 1000 news articles every day. \n\nYou are right with respect to machine learning. I also have some ai trained on the indicator for predicting a distribution of returns, that seem to give good results but over the more data I use for training the less I have for validating. So in the future this should get better as well as getting more validation data. \n\nOn server there are also some more stock specific dashboards in case you are interested", "score": 13, "replies": [{"body": "Do you pay for the news too? Since many are just paywalls. And how much does it cost you to scrape so much data?", "score": 2, "replies": [{"body": "If you know how to code then you it mainly costs time and effort;) Python and bs4 are very useful for this in case you are interested", "score": 3, "replies": [{"body": "Alright. Do you use any paid proxy service to avoid getting blacklisted?", "score": 1, "replies": []}]}]}, {"body": "Have you attempted cross validation (K-Fold or others) and possibly minority class oversampling to address data thinness or class imbalances? I'm curious what it would do for accuracy and recall in your ML model", "score": 1, "replies": [{"body": "I guess you are referring to the prediction dashboard, not the sentiment indicator? I indeed used over sampling to account for imbalance. I haven used any k fold because the sequence is important (i use a lstm model). it is trained to minimize loss rather than maximize accuracy on the validation.\n\nI can provide some more background on that model in a different post/paper in case you are interested.", "score": 2, "replies": []}]}]}]}, {"body": "Very interesting, thanks!", "score": 2, "replies": []}, {"body": "Book marking to read after work", "score": 2, "replies": []}, {"body": "Would you be able to expand upon the TSLA facet? I.e. how many articles are pulled per day on specifically Tesla, do you have a correlation graph for this as well, etc...", "score": 2, "replies": []}, {"body": "This is fascinating; I've learned so much reading and looking up different things referenced in your post (like TensorFlow). \n\nI have a weird background in programming, as I've self-taught myself various things over the last several years. I've learned how to automate several labor-intensive work tasks, build data-based models that others at my company now utilize, etc. \n\nBut I always have a hard thing jumping into anything too technical because there's still an information gap. Every time I try different online coding classes, I get bored because the information is too basic. Essentially, I understand the fundamentals of programming in popular languages (python, js, CSS), but I have a hard time with \"speaking\" like a programmer. Reading StackExchange or GitHub sometimes feels like I'm reading a foreign language, haha. \n\nDo you have any suggestions on where to perhaps formalize my skills as someone not starting from scratch?", "score": 2, "replies": [{"body": "If you already know some Python I would advice to choose some larger project you want to build yourself and just start coding. Its (partly) is also just about putting in the hours, and doing it on your own project makes it much easier.", "score": 1, "replies": []}]}, {"body": "This is like the fear/greed index. But can the AI predict potential future sentiments?", "score": 2, "replies": [{"body": "That is a question most of us would have. But it has a very intuitive answer. AI can only predict something that a human could in the first place. The only advantage AI can offer is processing huge amount of data which a human can't. If you can devise a model which could predict what kind of tweets would people tweet given a situation, then yeah sure AI can predict potential future sentiments.", "score": 1, "replies": []}]}, {"body": "It looks similar to the *Economic Policy Uncertainty Index*. Check this out: https://www.policyuncertainty.com/", "score": 2, "replies": [{"body": "Yes I have seen this before. But it is only available on a monthly granularity right?", "score": 1, "replies": []}]}, {"body": "To critics: Nothing wrong with reinventing the wheel. Every time I have think I have some epiphany about investing I realize I’m 90% just recreating a paradigm that already exists. But that sort of validates your understanding and helps you to make decisions wisely if you are arriving at convention through first principles. And that 10% difference in how you see things may improve your execution in ways that compound over time. For example if you improve your edge by 10%, you can generally safely risk 10% more of your capital on it and reduce your diversification, etc", "score": 2, "replies": []}, {"body": "Lmao", "score": 2, "replies": []}, {"body": "What you described is sentiment analysis and it is used a lot in algo trading", "score": 2, "replies": []}, {"body": "So if im correct its expecting a drop?\n\nHow much AI/ML do i need to know, if i want build something like this? I know how to code in python..\nAnd is your code opensource?", "score": 1, "replies": []}, {"body": "You really missed an opportunity for a rick roll with that link", "score": 0, "replies": []}, {"body": "And I created an AI to collect all the fairy dust which will act as an indicator of when Captain Hook will be around.", "score": -7, "replies": [{"body": "Cool, care to make a chart of it?", "score": 7, "replies": []}]}, {"body": "seriously Fck you. You are a pumper. Dont we know all this, unless you are an idot.\n\nIt is better to pay several four digits to bloomberg for their resources.\n\nHe is fishing with a hook now.\n\nGet the fck out.\n\nplz, ban him, so no victims in the future.", "score": -13, "replies": []}, {"body": "Very cool!", "score": 1, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}, {"body": "This is really interesting. In grad school, we have spent a lot of time studying behavioral effects on the market and understanding how it affects both economics as well as general investing. Looking forward to diving into this!", "score": 1, "replies": []}, {"body": "Interesting.  What do we do with this?", "score": 1, "replies": [{"body": "Thanks. For me personally at the least see everyday which direction sentiment is going", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "In my opinion every ML model should have an intuition behind it on why it might work, so the first one is also important in my view", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I’ll keep it in mind when I write something on the machine learning part", "score": 1, "replies": []}]}]}]}, {"body": "It would be great to bring the indicator into TOS. How difficult is that? i am checking it out tonight", "score": 1, "replies": []}, {"body": "Thanks, I love this type of work!", "score": 1, "replies": []}, {"body": "I have a few questions regarding this approach. Is there a list of News/Stocks API which you use to dump data? \n\nI have been working on researching( this came to my mind recently) data correlation  between stock prices and news/trends. Looking for an advice from where i could dump data. Right now i am on Google Trends and Yahoo Finance API.", "score": 1, "replies": []}, {"body": "ok ok the summary is DEC18 150C in what stonk?", "score": 1, "replies": []}, {"body": "Who do I pay to get daily signals woooooo", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Who cares about a Nobel prize, the ultimate goal is gold on Reddit;)", "score": 1, "replies": []}]}, {"body": "When did you start running this model? The graph seems predictive for the March crash but by May, it stops being predictive.", "score": 1, "replies": [{"body": "I think about three or four years ago. However the indicator is stationary while the SP500 is obviously not. So if you pick a large time horizon the message somewhat dilutes. In the plot on the server there is are range slider you can play around with a bit. That said I think the indicator is not going to signal every weekly 3% increase or decrease  accurately, but for getting a hunch if there is sipping panic in to the market it can help I believe", "score": 2, "replies": []}]}, {"body": "Too many words, can I get a summary in 10 words or less?", "score": 1, "replies": []}, {"body": "RemindMe! 3 days", "score": 1, "replies": [{"body": "I will be messaging you in 3 days on [**2020-12-18 09:58:15 UTC**](http://www.wolframalpha.com/input/?i=2020-12-18%2009:58:15%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/StockMarket/comments/kd0zlu/i_used_ai_behavioural_economics_and_alternative/gfwpqfd/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Fkd0zlu%2Fi_used_ai_behavioural_economics_and_alternative%2Fgfwpqfd%2F%5D%0A%0ARemindMe%21%202020-12-18%2009%3A58%3A15%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20kd0zlu)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "What is ur job?.... This sounds really cool", "score": 1, "replies": []}, {"body": "For how long are you working on this?", "score": 1, "replies": [{"body": "Too long;) but I’ve been working on the data and playing around with the model off and on for about 3 years", "score": 1, "replies": []}]}, {"body": "This looks great, could be a powerful tool for trading (not investing, obviously). The same logic could be applied to individual stocks instead of the market as a whole. Most necessary improvements would be in the AI part that not only would have to determine the sentiment, but also to determine specific stocks.", "score": 1, "replies": []}, {"body": "I literally want to to sth like this for a uni project. We basically take alternative data and try to see how it can be used for stock prediction. Will definitely read up on your post once I have time", "score": 1, "replies": []}, {"body": "Thank you for your mind catching post.  The psychological part is particularly interesting.  I think it is a big bag of a mixture of True, False, and Propaganda, regardless of whose channel, mouth, or whatever media out of which it emanates.  Catching the theme is critical.\n\nI would find it particularly interesting to see on [https://www.alternative-analytics.eu/indicators/](https://www.alternative-analytics.eu/indicators/) the ability to have a drop down menu to graph on the fly, the industry and sector of companies listed on the exchange.  It could be a group of companies summing up to a given sector and/or industry.\n\nDoing this against the SP500, Dow30 and Nasdaq100 would be massively meaningful.", "score": 1, "replies": []}, {"body": "Super interesting point here. It's undeniable that sentiment and tone are crucial factors. \n\nEver heard of Helios Life Enterprises? They are turning tonal nuances of executives's voices into actionable insights. They use audio from earnings calls among others. Can see a bunch of similarities in what you did here and what they are doing except they do it with audio. Nonetheless falls into that alt. data bucket.\n\nText can always be changed and made to seem more positive but a person's tone can't hide the emotion. The science doesn't lie on that one.\n\nI just invested in them on Republic.com...cool stuff if you're interested in a different approach: https://republic.com/helios", "score": 1, "replies": []}]}
{"title": "$TSLA Weekly Detailed Discussion - December 14, 2020", "selftext": "\nThis thread is to discuss news, opinions, analysis on anything that is relevant to $TSLA and/or Tesla as a business in the longer term, including important news about Tesla competitors. Do not use these threads to talk about daily stock price movements, short-term trading strategies or results, use the Daily thread(s) for that.  Be sure to link relevant sources to further the discussions of any idea or news-item raised. \n\nPlease send feedback to the moderators, as this may or may not become a consistent thread.", "id": "kctona", "created_utc": 1607933885.0, "score": 27, "upvote_ratio": 0.9, "num_comments": 83, "comments": [{"body": "[removed]", "score": 12, "replies": [{"body": "[removed]", "score": 3, "replies": []}]}, {"body": "2020 is the first year I've had any significant amount on margin.  Just wanted to share with others in my position that you can deduct your margin interest paid on your taxes. \n\nhttps://money.usnews.com/investing/investing-101/articles/3-tax-deductible-investment-expenses-you-should-take", "score": 12, "replies": [{"body": "Also depending on amount of margin and your broker, margin rates are negotiable", "score": 9, "replies": [{"body": "Yes! Very much so.  Put this off way too long", "score": 2, "replies": []}]}, {"body": "Thank you!!", "score": 3, "replies": []}, {"body": "thanks!", "score": 3, "replies": []}, {"body": "Look at the guy who will lose his house over Tesla.", "score": -8, "replies": [{"body": "Jokes on you!  I don't own a house!", "score": 7, "replies": [{"body": "That is good 😜", "score": -3, "replies": []}]}, {"body": "says the guy that can't make a correct prediction to save their life.", "score": 2, "replies": []}, {"body": "Jokes on you. I bought a house because of Tesla.", "score": 1, "replies": []}]}]}, {"body": "Are we still bullish on solar roof? It seems that we have waited an awful long time for this to seriously enter large scale production… You hear about successful installs here and there, I think I worry that this may be a boondoggle. Solar cell efficiency is rising and I wonder if the solar roof has the capacity to take new technology and incorporate it? I think I am just a bit underwhelmed by progress on it over the past three years.", "score": 9, "replies": [{"body": "I have a roof on order. All the permits, etc were cleared in early November, but the installation is probably not until April, a full year after I started the process.\n\nThe big hold up seems to be training installation teams.", "score": 6, "replies": [{"body": "Thank you for being an early adopter, when i get a house in 10years it will be easier thanks to you guys!", "score": 3, "replies": []}]}, {"body": "The problem with PV (especially for residential systems) is that a very large part of the cost comes from labour. So if Tesla wants to offer an affordable product they need a very good process for installation and administration, not just a good product. I think it's a lot harder to hire competent installers than it is to hire competent engineers, because the latter get a lot more money and get to work on more exciting stuff.", "score": 3, "replies": [{"body": "The number of component installers you need also scales linearly with the number of systems you sell, whereas the number of engineers you need does not. Thus a small group of very good engineers can support very high volume, whereas with high volume you will inevitably have to start hiring installers that aren't the best in their field just to get the job done.", "score": 2, "replies": [{"body": "Exactly", "score": 1, "replies": []}]}]}, {"body": "We aren't really focused on this still. 1-2 years.", "score": 3, "replies": [{"body": "Why is that?", "score": 5, "replies": [{"body": "Allocating company resources on Model Y ramping and new Factory's are more profitable in the short and medium term. my thought is they won't truly focus on solar roof until cybertruck and semi are in full production as those products are in much more demand and will make a bigger impact mission wise over the next 2-3 years.", "score": 6, "replies": []}, {"body": "We don't have the people/resources yet - but it's getting better. Eventually we will do both full speed, and more", "score": 5, "replies": [{"body": "But we has to ppl to buy damn solar city and run it into the ground?  This is the biggest fuck up this company has made.  $2B worth of tsla stock for this shit, which would now be worth $2B for a solar company that still is struggling to provide a return", "score": 1, "replies": []}]}]}]}, {"body": "Solar roof is a boondoggle already. Despite years of promises Tesla has only recently become competitive here and doesn't yet have a clear major advantage over the other companies present in the space. It's a tougher nut to crack, and their resources are obviously focused on more important issues. I think and hope they'll get there eventually because they have the right core concepts, but I see no sign that they will actually solve the implementation hurdles and dominate this space in the short term.", "score": 3, "replies": []}, {"body": "Solar city has been a dog shit purchase.  I want my percentage of the shares used to buy solar city back, adjusted for present valuations.  That purchase cost us $20B with the way tesla stock has gone up while solar has added negative value.", "score": 0, "replies": []}]}, {"body": "This feels to me like Zoox is hoping to be bought for its vehicle and that their autonomy effort has stalled.\n\nhttps://www.youtube.com/watch?v=3r7PEl0tMSk&feature=emb_title", "score": 7, "replies": [{"body": "Did Amazon buy them?", "score": 4, "replies": [{"body": "Yes Amazon already bought them", "score": 4, "replies": [{"body": "Well then I don’t know what they hope to accomplish.", "score": 3, "replies": [{"body": "Swinging dicks with Tesla.", "score": 4, "replies": [{"body": "Best of luck.", "score": 4, "replies": [{"body": "Yep, Tesla won't play.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[removed]", "score": 8, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 2, "replies": []}]}]}]}, {"body": "[removed]", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}]}, {"body": "hey everyone, \n\nI have the vast majority of my position in Tesla but I like to stow away a bit into some etf’s in the rest of the space as well — TAN, PBW.\n\nI’ve been looking to find one that centres on batteries and energy storage specifically. I’ve come across “BATT” and it has a lot of familiar names if you’ve followed Tesla, but it hasn’t performed (relatively) as well as some other etfs.\n\nWhat do you guys think of this ETF?", "score": 3, "replies": [{"body": "Their top holding, $bhp.ax , seems to primarily focus on oil and gas. If they start to focus more on their nickel production I’d buy this. They also have xping which seems destined to suck. I’d also like more info if anyone has some good links? Thoughts?", "score": 3, "replies": []}]}, {"body": "Hello Tesla enthusiasts, Mr. Musk has made some comments that Tesla cars will become more valuable over time. Are these remarks reflected in any of Teslas financial statements?", "score": 3, "replies": [{"body": "It is not represented in their financials yet. Only when fsd goes to to the public fleet, and people start returning their leases, will we see a material change to the balance sheet.", "score": 6, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}, {"body": "A car can get more valuable in a future only by FSD being way more expensive", "score": 2, "replies": []}, {"body": "...what", "score": 1, "replies": []}, {"body": "Dont believe this.  It “could” happen.  Currently it is not likely enough to be something any sane person should factor into valuations", "score": 1, "replies": [{"body": "I'm insane lol", "score": 2, "replies": []}]}]}, {"body": "Quick question guys  \n\n\nHow many Teslas total will be on the road by the end of this year?  \n\n\nMy numbers from 2019 are arround \\~350.000  \nDoes someone have a good source on this?", "score": 6, "replies": [{"body": "1 millionth car reported by Elon in March this year. https://twitter.com/elonmusk/status/1237204618850992129?s=20", "score": 11, "replies": []}, {"body": "+1 million I would think", "score": 4, "replies": [{"body": "Well no, if it was 350k on the road Dec 31 2019, and they deliver 500k this year, then it will be 850,000 on the road EOY (minus a few to crashes/fires/whatever). \n\nThe real question is whether the Dec 2019 number is correct. If so it is trivial to add the P&D numbers when they come out in Q1 (clearly going to be near 500k, maybe a little higher/lower)", "score": -5, "replies": [{"body": "Where do you get these numbers from? Tesla delivered 367,500 in 2019 alone. Teslas were also delivered in earlier years, for example 245,240 in 2018. These are NOT cumulative numbers.", "score": 9, "replies": [{"body": "I only took the number from OP. Several others have posted showing that it was way off. Didn't mean to imply that I believed that calculation, was just trying to say the important thing is how many were on the road to start 2020, after that it's trivial to calculate.", "score": 1, "replies": [{"body": "they built their millionth vehicle in March this year so let's say +800k were on the road EOY '19", "score": 2, "replies": []}]}]}]}]}, {"body": "Would love a source for your numbers, since it'd mean that over 60% of Teslas made before EOY 2019 are no longer \"on the road\" lmao", "score": 4, "replies": [{"body": "Some aren't. And many first buyers had 1 or 2 cars or switched to another model.I'm trying to get to the miles collected not the numbers sold.", "score": -2, "replies": [{"body": "Again, what's the source? And do you think the cars just get scrapped when a Tesla owner switches to another model?", "score": 8, "replies": []}, {"body": "Your initial question isn't for total miles driven. We can napkin math that, but unless we hack every Tesla account that info is only available to Tesla.\n\nAverage miles driven annually = 13,500. [source](https://www.caranddriver.com/research/a32880477/average-mileage-per-year/#:~:text=The%20U.S.%20Department%20of%20Transportation's,over%201000%20miles%20every%20month.).\n\nUsed the source from my first reply, starting from 2016, multiplied the average number of miles driven with the number of cars per quarter and years broken down by quarter (q2 2016 would be 4.75) thru end of this year. Quick napkin math, obv this year far less driving. \n\nTotal FSD capable miles driven:\n\n29,895,935,625\n\n\nEdit: please note this does not count cars sold during Q4 2020. Also, this would assume every car sold in a quarter drove for the full quarter. ~~Also adjusted because I applied 13.5k miles driven per quarter not year - updated by multiplying by 13,500/4 (3375/quarter).~~ it's difficult to spreadsheet on my phone 😢\n\n[quick and dirty spreadsheet](https://docs.google.com/spreadsheets/d/1RhuQrMRql4NpVrHrEwdSE0xaKU4OV0U2NEbtnGPYOcQ/edit?usp=drivesdk)", "score": 2, "replies": []}]}]}, {"body": "Total, FSD capable, has already exceeded 1,000,000.\n\nhttps://cleantechnica.com/2020/03/10/tesla-passes-1-million-ev-milestone-and-model-3-becomes-all-time-best-seller/\n\n- Bullish, I didn't realize it was a model Y.\n\n- Anything 2016 and newer is FSD capable I believe. Source for [1.1 million](https://www.statista.com/statistics/715421/tesla-quarterly-vehicle-production/). Could be around June they were FSD capable? But by EOY it will be closer to 1.3 million, potentially FSD capable. I believe Elon gave guidance there would be 1 million by EOY 2020. Go Elon! \n\n- In March they hit 1 million cars. So they made roughly 93,000 cars leading up to 2016. Could be wrong on this, just napkin math using the above sources.", "score": 8, "replies": []}, {"body": "I think they will be more popular than you think. I just saw a Tesla charger and showroom only a 10 minute drive away from where I live and I'm in Toronto, Canada.\n\n[https://www.tesla.com/en\\_CA/findus/location/supercharger/vaughansupercharger](https://www.tesla.com/en_CA/findus/location/supercharger/vaughansupercharger)", "score": 2, "replies": []}]}, {"body": "I’m not sure if this more for the daily thread, but since it happens fairly often I’m asking here.\n\nWhat’s the deal with the 10:40 dip? It happens so often that I’m surprised when it doesn’t.", "score": 5, "replies": [{"body": "Could be hedgies trying to trigger folks stop losses. General scare tactics. A whale trimming their position. Stuff like that.", "score": 2, "replies": []}, {"body": "The pre-lunch gully! Anytime I’ve bought TSLA shares or options it’s been 10:30am-1pm range.", "score": 2, "replies": []}, {"body": "I am convinced it will be a roller-coaster ride (up or down). You know that much about $TSLA by now. Chances of it being a upward swing are much better than otherwise, unless FUD or black swan...", "score": 1, "replies": []}]}, {"body": "I've stumbled upon ABML, a battery recycler. Anyone else watching them?", "score": 2, "replies": [{"body": "Pink sheets. I tried to buy novonix on vanguard and they wanted to charge me an extra $50. Wtf? Just bought more Tesla instead.\n\nI think these kind of stocks are tough. It’s just so hard to find info or be confident about a decision. I’m putting a little into $LIT hopping they pick up and of these companies that “make it”", "score": 3, "replies": []}]}, {"body": "So what was the end volume number today?  Wonder what the likely percentage is of shares that were induced in the index vs still need to be bought", "score": 1, "replies": []}, {"body": "“Today's TSLA closing cross was a massive market failure: especially the shameful artificial dip to below $630 to pick shares from retail investors with stop orders, just minutes before the close - and then sold to indexers for $695 ...\n\nThat's market manipulation & theft.”\n\nhttps://twitter.com/truth_tesla/status/1340056463067234307", "score": 1, "replies": []}, {"body": "What was the exact weighting Tesla is meant to be? Seen a few media posts stating 1.5 to 1.6% and [S&P Global press release ](http://press.spglobal.com/2020-12-11-Tesla-Set-to-Join-S-P-500-100-Apartment-Income-REIT-to-Join-S-P-MidCap-400?asPDF=1) doesn’t have weighting.\n\nGoing to look at some of the large ETFs over the weekend and see what they have. Any more to this list?\n- SPY\n- VOO\n- IVV\n- SPLG", "score": 1, "replies": []}]}
{"title": "AMZN about to have HUGE breakout, your welcome boys.", "selftext": "Been watching this guy for weeks, and this week is the week we break out.  Expecting some pre-emptive numbers/production for the most insane quarter of Amazon's career.  The stars couldn't be more aligned for this beauty.  I've got $25K on the line for $3,300 calls end of week.  \n\n\n&#x200B;\n\nhttps://preview.redd.it/edaj02cgr5561.png?width=916&format=png&auto=webp&s=688abcbe6154afadee71e128e272de124a9238bf", "id": "kcy1m3", "created_utc": 1607954140.0, "score": 84, "upvote_ratio": 0.81, "num_comments": 85, "comments": [{"body": "[deleted]", "score": 186, "replies": [{"body": "Half the sub can barely afford AMZN weeklies, let alone a responsible play on it.", "score": 23, "replies": [{"body": "Can just do spreads", "score": 3, "replies": []}]}, {"body": "Meta", "score": 14, "replies": []}]}, {"body": "25k on a weekly == you're fucking retarded", "score": 121, "replies": [{"body": "Someone's gonna do it and I'm excited for the future porn.", "score": 46, "replies": [{"body": "Lol you've already doubled your money this morning.", "score": 9, "replies": [{"body": "Hence the wording. Porn, can go either direction. Up or down. Sideways porn is just weird.", "score": 7, "replies": [{"body": "I was poking /u/ohmy420", "score": 2, "replies": [{"body": "Still Would have profited with monthlies with less chance of getting your anus torn", "score": 2, "replies": []}]}]}]}]}, {"body": "never. buy. fucking. weekies*. damn dude. \n\ni wouldnt bet against amazon but i also wouldnt bet on them making a 4% move in a week based on a triangle pattern. get out now and buy them at least 3 months out... you fucking retard.\n\n(*unless you have inside information)", "score": 18, "replies": [{"body": "Lines and triangles on stock charts are as good at predicting the future as Tarot cards or Ouija boards. If they happen to line up, then it was as just luck.", "score": 3, "replies": []}, {"body": "Amazon made loot this quarter I bought groceries and they came in two hours that's insane", "score": 3, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "you play apex legends dont fucking talk to me", "score": 4, "replies": []}]}, {"body": "He ended up being right! lol", "score": 1, "replies": [{"body": "He's not ITM yet. The option is just back to where it was yesterday before the dip. Best time to sell was still Monday at $11+. There's still time...", "score": 1, "replies": [{"body": "He should def be green by now though. Am I wrong?", "score": 1, "replies": [{"body": "The option was like $9.50 yesterday before the dip and dropped down to 5-something. I'ts back to 9+ but it was $11.70 on Monday.", "score": 1, "replies": []}, {"body": "Not sure how much he bought them for or when so it's hard to tell.", "score": 1, "replies": [{"body": "Ahh yeah I was wondering this too. I didn’t check the option chain but figured they were up higher than when he bought which I assumed was the 14th. Hes got a four percent move since he bought tho. That’s why I assumed he was up on them.", "score": 1, "replies": [{"body": "If he bought the 11th or premarket on the 14th or timed it perfectly at open yeah, 4+% and he's in the green. If he bought midday on the 14th he probably caught that option at ~$10/11 in which case he's breaking even and really pushing it if he's still holding. Those green candles do look good but it hasn't quite broken out and we're close to close and it could still correct and chop sideways over the next two days.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Or fuckin rich in a week", "score": 8, "replies": [{"body": "but most likely fucking retarded", "score": 12, "replies": [{"body": "Looks like his retarded play is paying off already tho haha", "score": 4, "replies": [{"body": "depends on how long he holds. plenty of time for theta to kick in", "score": 2, "replies": [{"body": "Yeah idk about him but if I had a 25k investment go up 80% I’d sell that shit right away haha", "score": 7, "replies": [{"body": "yeah like fucking now", "score": 3, "replies": []}, {"body": "40% now...", "score": 2, "replies": [{"body": "Exactly.. good thing he bought weeklies so he has a while before he needs to sell 😁", "score": 5, "replies": [{"body": "theta bro... he'll be in the red tomorrow", "score": 2, "replies": [{"body": "Dude it was sarcasm but who knows what tomorrow will be lol it could still go up there’s been plenty of times it jumps 5% in a week", "score": 2, "replies": [{"body": "fair enough. i really really doubt it will jump to 3300 by friday though but you're right i could be wrong.", "score": 1, "replies": [{"body": "I agree it’s unlikely. But for this guys sake I hope it does that would be some nice gains before Christmas", "score": 1, "replies": [{"body": "im hoping he doesn't jump in front of a train after losing his life savings and ruin his family's christmas.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "13% now", "score": 2, "replies": [{"body": "Yes but again he should’ve sold at 60-80% if he has any brains at all", "score": 2, "replies": [{"body": "30-50% is as good as he'll get this week and that offer ends at market close.", "score": 2, "replies": [{"body": "They did just announce a fully automated electric taxi.. I could see it mooning", "score": 1, "replies": [{"body": "Amazon is essentially a blue chip at this point. It's already on the moon. That's like saying McDonalds could moon cuz it came out with a new whopper. Big whoop.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Can’t post a pic of your positions but can post a few lines.  Might as well butter me up and call me lube.  Count me in.", "score": 31, "replies": []}, {"body": "I'm long Amazon with shares, so I hope you're right. Shits been stalling out for a few months.", "score": 25, "replies": [{"body": "15 here. My largest position by far. Feel like a boomer for it though.", "score": 6, "replies": [{"body": "I'm just at a measly 4. Imo it's one of the best single companies to buy and hold. Godking bezos won't fail us.", "score": 5, "replies": []}]}]}, {"body": "Looks like what my kindergartener draws.", "score": 37, "replies": [{"body": "Are you sure OP is not your kid?", "score": 17, "replies": []}]}, {"body": "Only 25k ?? Rookie", "score": 10, "replies": []}, {"body": "Just because your wife's boyfriend wouldn't let you put this on the fridge doesnt mean we want to see it", "score": 7, "replies": []}, {"body": "Not enough 🚀🚀 emotes \nI won’t believe it", "score": 7, "replies": []}, {"body": "“You’re”", "score": 6, "replies": []}, {"body": "*you're\n\nThank you kindly.", "score": 6, "replies": []}, {"body": "3.3k EoW? Jesus this might be the most retarded shit I’ve ever seen however I hope you make fucking bank.", "score": 6, "replies": []}, {"body": "I don’t trust any retard that can’t handle your/you’re", "score": 5, "replies": []}, {"body": "LEGEND", "score": 5, "replies": []}, {"body": "Someone got rich here?", "score": 5, "replies": []}, {"body": "\"This means something.\"\n\nhttps://www.youtube.com/watch?v=EnJk39QSujA", "score": 3, "replies": []}, {"body": "My welcome?", "score": 3, "replies": []}, {"body": "This one has appeared to be setting up for some time now. But it keeps chopping sideways. It can continue to chop. Good luck man", "score": 3, "replies": []}, {"body": "One sec, let me flip these burgers.  Amazon is getting sued in Europe for being a monopoly.  There will be no 'break out.'  The stock hasn't moved in weeks above $3,200.", "score": 3, "replies": []}, {"body": "I've been watching this triangle for a while now and it's getting there but from my estimates it won't take off until 1/1-1/13.", "score": 3, "replies": []}, {"body": "Got another month to earnings bub.  3 month this baby", "score": 3, "replies": []}, {"body": "About time, shit hasn't moved for 6 months.", "score": 3, "replies": []}, {"body": "“Your” gay.", "score": 3, "replies": []}, {"body": "SELF-DRIVING, EV, UBER\n\nWhat the fuck else needs saying?", "score": 2, "replies": []}, {"body": "NO YOUR WELCOME", "score": 2, "replies": []}, {"body": "!RemindMe 5 days \"amzn yolo''", "score": 2, "replies": [{"body": "I will be messaging you in 5 days on [**2020-12-19 20:24:04 UTC**](http://www.wolframalpha.com/input/?i=2020-12-19%2020:24:04%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/kcy1m3/amzn_about_to_have_huge_breakout_your_welcome_boys/gfuiet4/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fkcy1m3%2Famzn_about_to_have_huge_breakout_your_welcome_boys%2Fgfuiet4%2F%5D%0A%0ARemindMe%21%202020-12-19%2020%3A24%3A04%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20kcy1m3)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}, {"body": "Oops on this dude.", "score": 1, "replies": []}]}, {"body": "This is exceptionally retarded.", "score": 2, "replies": []}, {"body": "Every week someone says “amazon primed for launch”", "score": 2, "replies": []}, {"body": "Please tell me your still holding? Amazon at 3.25k today", "score": 2, "replies": []}, {"body": "[**THIS IS THE WAY**](https://i.imgur.com/IFdK1Qn.png)", "score": 3, "replies": []}, {"body": "3300 end of week. Holy shit you are insane WSB4LYFE", "score": 3, "replies": []}, {"body": "**If this is [spam](https://www.reddit.com/r/wallstreetbets/wiki/contentguide) you can vote to remove it and earn setting your own flair.**\n\n| **Remove It (0)** | **Keep It (1)** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=kcy1m3&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=kcy1m3&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=kcy1m3)\n___\n ^comment ^will ^disappear ^--- ^7 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 1, "replies": []}, {"body": "What’s a cheaper stock that follows AMAZON", "score": 1, "replies": [{"body": "$EBAY", "score": 4, "replies": []}, {"body": "Shopify has bigger upside I think going forward I own both.", "score": 5, "replies": []}]}, {"body": "You still in it OP?", "score": 1, "replies": []}, {"body": "RemindMe! 3 days", "score": 1, "replies": []}, {"body": "Proof or ban", "score": 1, "replies": []}, {"body": "godspeed, I sold some 3250p in a credit spread same expiration.", "score": 1, "replies": []}, {"body": "Godspeed sir", "score": 1, "replies": []}, {"body": "I’m still praying for you to the tendie gods, Amazon needs $150. I hope it works out", "score": 1, "replies": []}, {"body": "Yo check out TGInvesting on YouTube he dropped 100k on amazon last week", "score": 1, "replies": []}, {"body": "Did this play work out on that pop for you?", "score": 1, "replies": []}]}
{"title": "Aphria (APHA) Going Up.", "selftext": "First, look at this bullish pattern.\n\nhttps://preview.redd.it/7tww974027561.png?width=903&format=png&auto=webp&s=70b24b1676eeeeaa8453ad831cf735813035d676\n\nAphria's 3 month stock chart is forming said above pattern and it already did form a smaller one last month then proceeded to rally 25%.\n\nhttps://preview.redd.it/m5zuwb9g37561.png?width=1559&format=png&auto=webp&s=962c90b0119dc1abad78c6021bddb2bace59ec8c\n\nThen take a look at Tesla's chart before its recent rally.\n\nhttps://preview.redd.it/7r3zrdd847561.png?width=1523&format=png&auto=webp&s=13aacec364f3fbbf1be4f611c3403566412b4845\n\nBut how do we know this wont be a bearish pennant pattern that reverses down?\n\nFor anyone who is retarded, market cap is how much the investors value the company. This means that if the price doubles, the amount the investors value the company doubles.\n\n...\n\nAphria's Market Cap: 2.3 Billion\n\nAssets: 2.5 Billion\n\nLiabilities: 660 Million\n\nRevenue: 560 Million\n\nRevenue Growth YoY: 134%\n\nCash on Hand: 500 Million\n\nShort Term Debt (1 year): 170 Million\n\nLong Term Debt (1 year+): 490 Million\n\n...\n\nThis is a growth sector, the cannabis sector is expected to grow larger every year and Aphria has been taking market share from its competitors.\n\nAphria just acquired US weed-themed beer brewery and distribution company, Sweetwater, their gateway into the United States and their revenue will show up on future earnings.  And while other LPs are stuck with plain packaging, Aphria will be advertising their brands to the target audience plastering Riff and Solei on Sweetwater beer cans, totally legally. 4d chess.\n\nWe're sitting at the bottom bois, we're going up.\n\nTLDR; Buy APHA. It's forming a large bullish pattern and it's extremely undervalued.\n\n...\n\nPositions:\n\n20k Stock\n\n15 Jan 21 12.5C\n\n21 Jan 22 12.5C\n\n21 Jan 22 20C", "id": "kd39sb", "created_utc": 1607970551.0, "score": 72, "upvote_ratio": 0.86, "num_comments": 85, "comments": [{"body": "I'm going to hop in, you sold me", "score": 22, "replies": [{"body": "oh shit how much", "score": 6, "replies": [{"body": "I was already thinking about doing leaps on APHA anyway.  But this is good stuff.  Probably around 5k worth.  I think next year will be good for the weed sector anyway.  And APHA is solid", "score": 9, "replies": [{"body": "hens UwU", "score": 0, "replies": []}]}]}, {"body": "haha ya welcome", "score": 1, "replies": [{"body": "You son of a bitch. I’m in", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 17, "replies": [{"body": "Do you really think people around here wait for confirmation? If they did, we wouldn't have glorious loss porn.", "score": 13, "replies": []}]}, {"body": "That's a hell of a position.  I'm already in with everything I got for Jan of 22 calls.", "score": 11, "replies": []}, {"body": "My Jan calls have been hurting and want you to be right.", "score": 12, "replies": [{"body": "15 Jan 21 C gang", "score": 8, "replies": [{"body": "This is brutal lol.", "score": 2, "replies": []}]}, {"body": "How are they feeling now? ;)", "score": 1, "replies": [{"body": "Well they were in Jan and expired worthless so still not good I'd say. Should have grabbed shares instead.", "score": 1, "replies": []}]}]}, {"body": "Beautiful", "score": 6, "replies": []}, {"body": "Nice, I got some 8.5 12/31 calls, might bulk up on some longer term ones", "score": 6, "replies": [{"body": "I got those too, and I'm fucking praying to all the deities. Theta been making me anxious though. If these don't print, I'm not touching weed stocks again (a thing I've said every year for three years)", "score": 5, "replies": []}]}, {"body": "Saving the info on this. Good luck and thanks for the DD!", "score": 5, "replies": []}, {"body": "+17% after hours right now\n\nA merger was the catalyst. \n\nI'm thinking about committing to a DD. \n\nCurrent positions\n\n01/15 7.5c\n\n04/21 9c\n\n+Shares", "score": 3, "replies": []}, {"body": "I hope so, I have $35k in stock and $5k in 1/22 $10 call options", "score": 3, "replies": [{"body": "You better be out canvasing for Democrats in Georgia if you want those calls to print.", "score": 2, "replies": []}, {"body": "I wish. I have a ton of apha stock but my account is still waiting on approval for options. I applied for that shit 2 weeks ago. Oh well. Sitting on 3850 shares.", "score": 2, "replies": []}]}, {"body": "Looking good right meow", "score": 3, "replies": []}, {"body": "[https://www.bnnbloomberg.ca/aphria-tilray-said-to-be-in-advanced-talks-to-combine-in-blockbuster-pot-deal-1.1536917](https://www.bnnbloomberg.ca/aphria-tilray-said-to-be-in-advanced-talks-to-combine-in-blockbuster-pot-deal-1.1536917)", "score": 3, "replies": [{"body": "Finally it makes a good move ✌🏻😬", "score": 2, "replies": [{"body": "APHA has been making some decent moves recently.\n\nSweetwater acquisition and hopefully this merger.\n\nIf Dems win the senate then this baby is the MOON  **🚀🚀🚀🚀**", "score": 2, "replies": [{"body": "I take that back", "score": 1, "replies": [{"body": "You know how Weed stocks go, Great News = Stocks go down", "score": 1, "replies": []}]}]}]}]}, {"body": "This is the Aphria prayer room", "score": 3, "replies": []}, {"body": "This bitch is tanking since I bought 🤦🏻‍♂️ even after merger news .. how ???", "score": 3, "replies": []}, {"body": "Think we'll hit 9 by Friday?", "score": 2, "replies": [{"body": "No lol that'd be almost record growth from this company in that time span. I personally don't think it'll even hit OP's numbers. This companies financials have looked amazing for the entire year, yet their stock price barely moves ever, and when it does go up, it corrects a week later and goes back to what it was. Of course thats just my observation. This stock has burned me too many times with their great financials and goals. The market just doesn't care right now lol", "score": 5, "replies": [{"body": "Market has never cared about APHA. Great company, shit stock.\n\nUS banking legislation should allow them to make some bigger partnerships. That's when I think we'll see some real action.", "score": 3, "replies": [{"body": "100% agree. I have no intention of picking this one up anytime in the near future", "score": 1, "replies": [{"body": "Don't get me wrong, it's a solid hold when you look at the balance sheet. Deals will be made and the market will react.\n\nHolding 2k shares at 5 bucks. Took some money off the able at 8.50.", "score": 2, "replies": [{"body": "Oh absolutely, I just personally think there's other stocks that will dwarf this one in the terms of percent return in the short term. Aphria is a years long hold", "score": 1, "replies": []}]}]}]}, {"body": "My experience is the same as yours, if I can get close to break-even on my 12/31 8.5c, I'm dipping out. I've played just about every weed stock there is at this point and not a single one of them has made me think \"oh boy, that was a good investment.\"", "score": 2, "replies": [{"body": "I feel ya, I had a few thousand in it a while back and I think in total I made maybe $3 or so, it was just barely past breakeven. Complete waste of time", "score": 2, "replies": [{"body": "I don't understand how people win at weed stocks and at this point, I'd rather just have my weed stock's worth of weed.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "And is now back to correcting lol this stock is the struggle unless you're day trading it", "score": 1, "replies": []}]}]}, {"body": "Try today, hit $9 after hours.", "score": 2, "replies": []}]}, {"body": "i have $7c for 4/16 hope you right", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "And today’s your cake day", "score": 2, "replies": []}]}]}, {"body": "Been in it for a minute, should be 10+ EOY but yet here we are", "score": 2, "replies": [{"body": "I'm still hoping it'll hit $9 EOY, all my calls are based on that happening and I'm starting to get worried.", "score": 3, "replies": [{"body": "I’ve been selling calls every time this stock goes above 8.50, team theta gang", "score": 3, "replies": [{"body": "NO!!!!! That's my strike price!", "score": 2, "replies": []}]}]}]}, {"body": "Fuck off im done with weed stocks quit trying to suck me back in", "score": 2, "replies": []}, {"body": "Pray the Dems win in Georgia on 1/5 or your 1/15/21 calls are probably fucked", "score": 2, "replies": [{"body": "Not gonna lie, Dems seem to have a decent shot at winning.", "score": 2, "replies": [{"body": "Today’s merger announcement didn’t hurt either", "score": 2, "replies": []}]}]}, {"body": "Yeah I ain’t happy bout this one yet :/", "score": 2, "replies": []}, {"body": "Is it best to hold or sell call options", "score": 0, "replies": []}, {"body": "Magic lines are not DD.", "score": 1, "replies": [{"body": "what is DD", "score": 1, "replies": [{"body": "Doo Doo", "score": 3, "replies": []}, {"body": "Due Diligence", "score": -1, "replies": []}, {"body": "Dick Dive", "score": 1, "replies": []}]}]}, {"body": "$9.5 8/1 already down 50% 🥺", "score": 1, "replies": [{"body": "If that prints, you should go play the lottery.", "score": 1, "replies": []}]}, {"body": "Why did you ignore the first two failed patterns?", "score": 1, "replies": [{"body": "Which failed patterns leMMe sEE", "score": 1, "replies": []}]}, {"body": "Im a simple man; I see lines and charts and I'm in.", "score": 1, "replies": [{"body": "how much", "score": 1, "replies": []}]}, {"body": "Youre gay.", "score": 1, "replies": [{"body": "No you.", "score": 1, "replies": []}]}, {"body": "Holding 2k shares at 5 bucks. Sold some of my 2019 shares on the way up.\n\nAfter being in this stock for three years, I'm fully expecting it to drop 30% on any hint of market weakness lol", "score": 1, "replies": []}, {"body": "Idk op, been holding apha , it hasn’t moved at all.\n\nIt’s quite disappointing", "score": 1, "replies": [{"body": "Oooo", "score": 1, "replies": []}]}, {"body": "I’ve been watching this too but the RSI seems to be doing a death cross", "score": 1, "replies": []}, {"body": "Already in 2k shares\n\n15 Jan 21 10c/15c", "score": 1, "replies": [{"body": "Printing right now 🤑", "score": 1, "replies": [{"body": "Yes sir", "score": 1, "replies": []}]}]}, {"body": "r/wsb unironically using technical analysis now ...", "score": 1, "replies": []}, {"body": "And I thought my Jul 16 10c’s were retarded", "score": 1, "replies": []}, {"body": "I lost money last time I tried to play APHA; IM IN THIS BITCH MOONIN", "score": 1, "replies": []}, {"body": "Imao this is the free stock robinhood gave me when I first joined. First ever stock. Might hop back in just to pay my respects, Leaps and shares tho", "score": 1, "replies": []}, {"body": "Fuck, I was really close to buying APHA a couple days ago after a transfer to my account finally went through but was unsure. If I had read this today it might have swayed me; and now it's up like 7% AH. God dammit", "score": 1, "replies": []}, {"body": "Awesome, Technicals sometimes show you future \n\nThanks!", "score": 1, "replies": []}, {"body": "long term you can find the cup and handle that's formed", "score": 1, "replies": []}]}
{"title": "Nvidia's director of AI research meltdown on Twitter.", "selftext": "[removed]", "id": "kd812p", "created_utc": 1607984409.0, "score": 38, "upvote_ratio": 0.79, "num_comments": 79, "comments": [{"body": "Damn I thought we were retards", "score": 67, "replies": [{"body": "We are don't lose faith", "score": 19, "replies": [{"body": "LMAO why", "score": 5, "replies": []}]}, {"body": "this right here. at least we know we are retarded, imagine a director of AI at a megacorp...", "score": 2, "replies": []}]}, {"body": "I don't understand what compels someone who's got a golden ticket in life to act like this. Bitch you're in the 0.0001% of most privileged people who have ever existed and yet you're so fucking angry that people hold different views to you or are trolls. These people, even being extremely generous and assuming they're malicious, have no effect on her and her privileges.", "score": 33, "replies": [{"body": "Did you just assume some gender pronouns? triggered.", "score": 5, "replies": [{"body": "my pronouns are bitch/cunt", "score": 2, "replies": [{"body": "like bitch / cunt or one of your pronouns is \"bitch/cunt\" like one word?", "score": 2, "replies": [{"body": "yes", "score": 1, "replies": []}]}]}]}, {"body": "0.000000001% of people that existed on Earth ever. We live in golden times regardless of problems that we face today", "score": 0, "replies": []}]}, {"body": "What is going on thro her head lol such a Karen", "score": 15, "replies": []}, {"body": "Probably wont have any effect on Nvidia. If anything they might have to let her go for breach of contract (unprofessionalism). \n\nHowever if they do, cancel culture will lash out against nvidia and proclaim no one buy their products. Which I feel more right than left are gamers, but I could be wrong.", "score": 20, "replies": [{"body": "If that happens I might be able to get that 3080 graphics card.", "score": 2, "replies": [{"body": "I'll settle for a 3060 at this point. Decently priced of course. Death to bots and miners.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "as many things in the PC world. I wish there was a greyhat group that would go around and after digging through accounts, show a monetary value of the individual's or mob's purchasing power of a specific service or product. Oh calling for a boycott? Well the 5 thousands individuals calling for it have collectively spent 200 dollars on our product this year... Yea, fuck off.", "score": 1, "replies": []}]}]}, {"body": "This kind of retarded behavior is happening in bay area a lot. I have my twitter under a random name because my colleague was \"disappointed\" in me that I liked one of Mango's tweet. And she started treating me differently afterwards.", "score": 12, "replies": [{"body": "yeah same, i've been dark on most social media for years but started a real name twitter account in january to keep up with corona shit\n\nlasted like 3 months before deleting and going pseud because i got tired of menopausal wine moms calling me a racist for saying kamala harris is a shitty person", "score": 2, "replies": []}, {"body": "Delete social media bro\n\nI'm looking for a new job so I can get the fuck out of the Bay myself. Sucks what has happened to tech the last 10-15 years.", "score": 2, "replies": []}]}, {"body": "Actually she's given away a list of people that lots of headhunters in the industry would give a hand and a fist away for. Considering the pretext and circumstance, it also turns out that she's a fanatic herself and is willing to turn down people because of their beliefs and|or political views (whatever their views and beliefs are, I don't fucking hire a friend or just someone who shares my political point of view, I hire a fucking professional to do his job and to make me money). Since it's NVIDIA, a huge name in the industry, it's highly likely that there were so many talented prospects in that list. With that approach it's no wonder NVIDIA lost the competition to AMD years ago. And many more would be scared away. RIP NVIDIA.", "score": 16, "replies": [{"body": "LOL - that's what I thought. That's a recruiter's dream list. They should send this unhinged moron a bottle of champagne", "score": 3, "replies": [{"body": "Makes one wonder how many other similar 'decisions' she's made throughout her 'career'?", "score": 3, "replies": []}]}]}, {"body": "How she got even time for the Bullshit? Looks like Nvidia is not pushing hard enough in that sector.", "score": 18, "replies": []}, {"body": "Haha what a joke of a human being. These types of people have certainly been making themselves very known these last 4 years. Blaming others for their own faults is a great strategy.", "score": 9, "replies": []}, {"body": "I sold a ton of calls on NVDA today. Not because of this tweet but because a Goldman Sachs Semiconductor upgrade is just about the biggest sell signal possible.", "score": 5, "replies": []}, {"body": "And she looks exactly like I would expect her to.", "score": 20, "replies": []}, {"body": "Would bang", "score": 13, "replies": [{"body": "For sure!", "score": 2, "replies": []}, {"body": "Me too", "score": 2, "replies": []}]}, {"body": "Uncle Ted was right.\n\n>> Some leftists may seem to oppose technology, but they will oppose it only so long as they are outsiders and the technological system is controlled by non-leftists. If leftism ever becomes dominant in society, so that the technological system becomes a tool in the hands of leftists, they will enthusiastically use it and promote its growth. In doing this they will be repeating a pattern that leftism has shown again and again in the past. When the Bolsheviks in Russia were outsiders, they vigorously opposed censorship and the secret police, they advocated self-determination for ethnic minorities, and so forth; but as soon as they came into power themselves, they imposed a tighter censorship and created a more ruthless secret police than any that had existed under the tsars, and they oppressed ethnic minorities at least as much as the tsars had done. In the United States, a couple of decades ago when leftists were a minority in our universities, leftist professors were vigorous proponents of academic freedom, but today, in those of our universities where leftists have become dominant, they have shown themselves ready to take away from everyone else’s academic freedom. (This is “political correctness.”) The same will happen with leftists and technology: They will use it to oppress everyone else if they ever get it under their own control.", "score": 6, "replies": []}, {"body": "Ah, the tolerant left.", "score": 17, "replies": []}, {"body": "I wonder how many of us can make it on her shitlist?", "score": 5, "replies": []}, {"body": "Sad to see retards like this infiltrating society.", "score": 6, "replies": []}, {"body": "Lol it’s actually illegal to blacklist other companies based on political beliefs hahaha\n\nBut market inverses us so calls on NVIDIA", "score": 7, "replies": [{"body": "No it isn’t.", "score": 2, "replies": [{"body": "I believe CA (where NVIDIA is headquartered) has laws to protect political discrimination for employees... maybe not companies, but what she’s doing is against the law in her progressive state lol...", "score": 3, "replies": [{"body": "They are students, not her employees. California Labor Code 1101 and 1102, the provisions most applicable here, deal with employees. These people don’t work for her. \n\nNot illegal.", "score": 3, "replies": [{"body": "Ohhh I guess you’re right since they don’t work for her... but I’m guessing her university (probably publicly funded) has rules against discrimination based on political affiliation... grants are especially important to PhD candidates, and withholding a grant that a certain student of hers has earned would be in violation of multiple federal and local laws. But withholding a grant would be stupid and probably get her fired anyways lol", "score": 1, "replies": [{"body": "Who said they’re *her* students? They look to be affiliated with a large number of different schools. They’re people on her blocked list, not a class roll, likely from trolling or posting content she found objectionable (which is pretty subjective). And there’s zero indication she’s blocking grants or anything. I’m really not sure how you’re jumping to all these conclusions other than you clearly want this situation to be something it isn’t... which sounds like a lot of Republicans right now 🤷🏼‍♂️", "score": 0, "replies": [{"body": "Loooooollllll you think I give a fuck about politics. Talk about jumping to conclusions. I think anyone who thinks Joe or Trump is gonna change their shitty life in any way is smoking some strong shit.\n\nI just think she’s a hypocritical cunt just like most extremists", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Can anyone show a screenshot? It’s been removed quickly by some bs", "score": 2, "replies": []}, {"body": "That's a helluva list she made up, there.  The ghost of Stalin is more than unimpressed, though.", "score": 5, "replies": []}, {"body": ">I guess the point of this is, does anyone see this as potentially having any fallout on their stock prices?\n\nNah", "score": 2, "replies": []}, {"body": "She only says some of them are, some are bots etc. How is publishing your blocked list a meltdown?\n\nThis will have zero impact on the stock price.", "score": 1, "replies": [{"body": "cope", "score": -1, "replies": []}]}, {"body": "in an incredibly competitive and objective market like chip manufacturer, being an ideologue seems so absurd. \n\nIf you don't hire right wing people, you'll make worse chips.", "score": 0, "replies": [{"body": "Yes.", "score": 1, "replies": []}]}, {"body": "Calls because she's going to get fired. People should be hired based on their expertise and professionalism, not their political beliefs.", "score": 1, "replies": [{"body": "Cope \n\nThis is not longer the way hiring (especially in tech, and especially in the bay) or college admissions work", "score": 1, "replies": []}]}, {"body": "The trend is: go woke go broke. So she will get fired for this.", "score": 1, "replies": [{"body": "get woke go broke", "score": 2, "replies": []}, {"body": "Unlikely, tech is filled with these morons now", "score": 1, "replies": []}]}, {"body": "When did this sub get overrun by right wing shills?", "score": 0, "replies": [{"body": "Right? It's quite sad. They bitch about leftist PC politics nonstop. Who on the left gives a shit about PC politics after the last 4 years of Trump? There's a laundry list of actual bi-partisan shit we should be angry about but The Right is still treating this shit like it's a football game.", "score": -2, "replies": [{"body": "Because probably either don't want to make money, don't know how, or both.\nYou're really surprised a community like r/wallstreetbets attracts capitalists?", "score": 1, "replies": []}]}]}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 0, "replies": []}, {"body": "[removed]", "score": -10, "replies": [{"body": "[removed]", "score": -11, "replies": [{"body": "you should probably head back to 4chan", "score": 5, "replies": [{"body": "Already there brosef", "score": -1, "replies": []}]}, {"body": "Hey dumbass, ever heard of Sundar Pichai and Satya Nadella? Also CEOs of Adobe, AMD, NVIDIA, Uber, and many other tech giants are immigrants.\n\nBut you knew that already. The real reason you resent immigrants is because you know you can’t compete", "score": 4, "replies": [{"body": "He's a nobody fortunate enough to be born in the Bay Area and is angry that he has to see immigrants who started off with less than him pass him by career wise. Those of us in tech know the type.", "score": 2, "replies": []}]}]}]}, {"body": "Honestly shaming domestic terrorists like trump supporters is probably the only way we make it out of this century alive. I’m a fan.", "score": -16, "replies": [{"body": "Imagine thinking you aren't just galvanizing the nationalists \n\nlmao", "score": 4, "replies": [{"body": "They get galvanized by the dumbest shit. Imagine thinking normal people should give a single fuck about what gets retarded racists all hot and bothered.", "score": 1, "replies": [{"body": "Most of them just dislike communism, immigration, and censorship. Not unreasonable. Most aren't even racist (calling literally everything racist, or sexist, or ableist, etc. makes those words lose meaning btw). \n\nThe radical left are the ones hot and bothered about EVERYTHING including plenty of issues that only exist inside their minds", "score": 1, "replies": [{"body": "Good thing we’re not a communist country or anywhere close to it. Please show me anywhere where the people control the means of production? I’ll sit and wait. \n\nCensorship? Where? People like you have managed to convince half the population that science is a made up liberal hoax. Your free speech is alive and very well. \n\nAnd yeah, asking to throw out the votes of predominately black people is racist. Decreasing voting locations in predominately black areas is racist. I’m sure it’s all just a big misunderstanding though, right? Lmao get fucked loser. I hope you lose all your cash.", "score": 0, "replies": [{"body": "1. Who said we are a communist country? the radical left largely embraces communism or at least extreme socialism and aims to implement it. \n\n2. Big tech and the media gaslit the entire country leading up to the elections. Censoring shit about Hunter Biden's corruption (including evidence that his father was involved - not just dick picks). They even censored the president's tweets lmao. \n\n3. Who said anything about blacks or voting? Most blacks in America are citizens who were born here; no problem there. People have a problem with corporations importing labor. They will play on people's altruistic sentiments to make mass immigration seem like the \"right\" thing to do be in reality it is only done for the benefit of businesses. It drives down wages and increases housing costs. Do you think H1B Visas are a good thing? A good loophole for getting around even existing immigration law? How about Disney bringing in 400+ Indians via an Indian consulting agency for a fraction of what they paid their existing IT staff. Forcing the American IT staff to train them for a month; then firing all of the Americans. Is that progress? \n\nTo you i'm sure it is", "score": 3, "replies": [{"body": "1. you said we're communists. the left has controlled the presidency and the house and senate multiple times and not once have we become socialist or communist. so you're wrong.\n\n2. they put fake news warnings on fake news. they didn't delete anything. the rest of normal society doesn't have to entertain your alternate reality of facts. we're all tired of it.\n\n3. incredible, you just disregard that your party limits black people from voting lol. not surprising, it's so disgusting that it's probably just best to pretend it doesn't even exist. \n\nAnd H1B's don't get around immigration law, it IS immigration law. You don't see the benefit to bringing over the worlds best and brightest in the field of STEM?! Why should we settle for hiring morons like you when there's actual competent individuals out there that will bring back a better ROI?\n\nLooks like you're the one that's lookin for a handout, comrade.\n\nAnd there's no way a moron like you has any 6 figure portfolio, lol. stop fronting.", "score": 1, "replies": [{"body": "As though the twitter left has ever owned the presidency, house, or senate. The best you have done is AOC. The left you are referring to is the establishment neoliberals and they hate you too. \n\nI have worked in tech since 2008. If you think Indian immigration has been a net plus for the bay you are insane. Sure it is great for Facebook and Google; it is not great for graduates from Stanford or Berkeley. Your income would be at least 2-3x as much (with half the housing cost) if all that labor wasn't imported. Plus most places i've been hire a bunch of entry level Indians from TATA to write some shit code then a senior dev just rewrites most of it. At least before frameworks did all the work anyways. \n\nI hope you aren't white. Literally every radical left white male is a sexless, low-t, simping loser. \n\nPull up in Mountain View if you want to talk more shit in the parking lot", "score": 2, "replies": [{"body": "Yeah dude, I’m gonna drive to fucking Mountain View to meet some fake rich tough guy from Reddit who’s so eager to prove he’s a somebody lol. You’re a troll who’s out of touch with society and reality. And again, you’ve avoided talking about the fact that you and your party disenfranchise black voters and black communities from voting. Still waiting on a response there buddy.", "score": 0, "replies": [{"body": "Bru I hate Trump and the GOP. GOP is Dem lite. \n\nI'm a libertarian/nationalist, i support policies that protect domestic citizens of all races. \n\nI don't know much about any black voter disenfranchising. \n\nI think voting should be done in person only on election day, and that ID should be required (for election integrity). That doesn't intrinsically disenfranchise anyone.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "You can shame us but you can't touch us. We don't care what you think. Stay obsessed.", "score": 1, "replies": [{"body": "Everyone knows you don’t care what others think, it’s quite obvious lol.", "score": 0, "replies": [{"body": "You got a demon, little man", "score": -1, "replies": []}]}]}]}]}
