{"title": "Walmart Setup", "selftext": "[deleted]", "id": "ml8wrq", "created_utc": 1617706339.0, "score": 215, "upvote_ratio": 0.83, "num_comments": 74, "comments": [{"body": "All you want to do with WMT is get in at the right price and hold it.\n\nYou just have to wait for some news where it drops below 130,140", "score": 34, "replies": [{"body": "Buying calls when it drops to 130 is free money.", "score": 32, "replies": [{"body": "My Jan 22 $130 calls agree.", "score": 5, "replies": [{"body": "How long do you plan on holding that? Genuinely curious because I sold my July call for 50% profit when wmt hit 140. Definitely got legs till 150 (and you have enough time to get there) but are you holding past that? Do you have a pt?", "score": 2, "replies": [{"body": "Around 145 I'm going to sell 2/3 of them to cover my cost and a decent profit. Going another few at 150-153. Going to ride a few till Christmas shopping numbers come in. If I had 1 I would sell at 30-50% gain.", "score": 3, "replies": [{"body": "Yup sold my one at 50% can’t get too greedy when ur broke lol. Thanks for the reply always interesting to hear others thoughts", "score": 1, "replies": [{"body": "Smart play! I think of gains this way: an index will go 10% more or less in a good year. If you did nothing for rest of the year, you're at 50% for the year. \n\nGood luck!", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "What fucking idiot would short Walmart", "score": 101, "replies": [{"body": "Something tells me you’re new here", "score": 156, "replies": []}, {"body": "[deleted]", "score": 25, "replies": [{"body": "whats the opposite of shorting?", "score": 6, "replies": [{"body": "pantsing", "score": 32, "replies": [{"body": "The fact that I got the joke makes me an ape! You sir are a genius ape! Well played!!!", "score": 4, "replies": []}]}, {"body": "gnitrohs", "score": 6, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "I do have a longing for tendies", "score": 1, "replies": []}]}, {"body": "snorting", "score": 3, "replies": []}, {"body": "Lengthening I think", "score": 3, "replies": []}, {"body": "Hanging", "score": 1, "replies": []}]}]}, {"body": "Let’s do it for the lolz", "score": 2, "replies": []}, {"body": "A short float of 58 MM is about 1.5% of total float.  Dude is looking for a short squeeze on Walmart with less than 2% of 2.5 billion shares?  This shit is do stupid my head hurts.", "score": -17, "replies": [{"body": "He didn't say dick about a short squeeze. Should we have him rewrite it in crayons so you cam follow along?", "score": 49, "replies": [{"body": "Read the edits at the bottom of the post. The original thesis was that he found this pattern while looking for short squeezes.", "score": 5, "replies": []}, {"body": "Do you want to edit your comment like he edited his post?", "score": -7, "replies": [{"body": "Nah  I'm good", "score": 6, "replies": [{"body": "Down voting after being shown to be wrong?  I think you have trouble with reality.\n\nThis place has become such a circle-jerk of idiocy, it's really sad honestly.  \n\nI made a correct point, he edited his post, you didn't read it, you were shown I was right and you were wrong, and you're too butthurt to admit it?  A simple thanks for saving you money on a stupid play would suffice.", "score": -6, "replies": [{"body": "I had no intention of jumping on this play. I didnt downvote you. Chill. His post as I see it mentions nothing about a short squeeze in his play. So what if he was looking into a short squeeze at a time? It's irrelevant to his post.", "score": 2, "replies": [{"body": "It's relevant because it was the original premise of the post.  He wrote it not me.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Especially with a 400 BILLION DOLLAR market cap.", "score": 2, "replies": []}]}]}, {"body": "I like this, im gonna play it on the break and run off 140, its an easy play because of that fat gap fill at 147, nice call out, I was watching this yesterday for a day trade", "score": 12, "replies": []}, {"body": "[deleted]", "score": 23, "replies": [{"body": "You need a gf to rub you the right way.", "score": 29, "replies": [{"body": "A hand job is a man's job\n\n\\-Baberaham Lincoln", "score": 10, "replies": []}, {"body": "Def not true.", "score": 4, "replies": []}]}]}, {"body": "I expect a follow up so we can see an end result. Don’t leave your audience hanging :)", "score": 12, "replies": []}, {"body": "Fuck I hate Walmart, haven't shopped there in years.", "score": 22, "replies": [{"body": "It's often the only store left in \"fly-over country. If Wal-Mart were to close people would go cannibal.", "score": 13, "replies": [{"body": "This is absolutely true. They've crushed any smaller local competition with their groceries. I live in one of these areas. If you want fresh produce it's your only option.", "score": 5, "replies": []}, {"body": "I'd be ok with that", "score": -4, "replies": []}]}, {"body": "in terms of quality, heres how it compares:\n\nclothing: about the same as Target, but cheaper. not as stylish though.\n\ngroceries: about the same as mid-level grocery (cub, kroger, safeway, etc). usually cheaper staples, but meat is hit or miss.\n\ntoiletpaper/cleaning supplies/etc: cheapest you can find except costco. quality is brand names, so its fine.\n\nbaby disposables (diapers, etc): cheapest name brands around.\n\nbaby non-disposables (strollers and such): china crap. do not buy\n\nhigh end luxury: do not shop at walmart.\n\noverall walmart is great.\n\nedit: also, walmart is the only place you can get Cheetos Mac&Cheese, so its a clear winner.", "score": 5, "replies": [{"body": "The last time I went into a Walmart I walked past a group of younger ladies who then started shrieking that I had called them the N-word, which I 1,000,000% did not do lol. And that’s the last time I will be going into Walmart.", "score": 1, "replies": []}]}, {"body": "Too many EBT holders, and pipe burners", "score": 6, "replies": [{"body": "Hi", "score": 5, "replies": []}]}, {"body": "At least near us we have Meijer right next to most walmarts. It's a bit more expensive, but nicer. Also the workers don't make more but they are union so ??", "score": 1, "replies": []}]}, {"body": "So... Did you buy in at $140, OP?", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "is this a weekly?", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I think I'll grab some MAY$145CALLS tommorow morning😁Nice technical DD⤴️👍", "score": 1, "replies": []}]}]}, {"body": "I was already in with a cost basis of $143-ish. Tempted to average down but it's not much averaging at the current price. The time to average down would have been when it dropped to $130.", "score": 1, "replies": []}]}]}, {"body": "Thanks for the tldr. Our fellow helmet wearing tarda here can’t read more than 2 sentences", "score": 3, "replies": []}, {"body": "Bought calls on the dip, good eye", "score": 2, "replies": []}, {"body": "I like the layout and info here. Gonna follow in hopes of more!.", "score": 2, "replies": []}, {"body": "I will def buy some Walmart after I sell my GME for 1million a share.", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "All I’ve noticed is coordinated misinformation. Some of us are unplugging ourselves from the Matrix. Some of us are asleep while Wall Street uses us as ATMs. And then there are the Agents who have a vested interest in the status-quo. Tell your boss I have his wife in my hot-tub.", "score": 3, "replies": []}]}]}, {"body": "Wal-Mart is a no brainer right now, you might be retarded if you don't already own this stonk yet pass on it right now.", "score": 3, "replies": [{"body": "Entered at 131. Holding long. Large position - 8% of my account.", "score": 8, "replies": []}, {"body": "meh. i've held it for like 3 or more months. it's kind of been a bitch as far as opportunity cost goes. I could pushed more money into many other better plays.", "score": 4, "replies": []}]}, {"body": "I prefer Target 🎯", "score": 2, "replies": []}, {"body": "New to this, how do you notice stuff like this?", "score": 1, "replies": []}, {"body": "I’m all in with 140C monthlies! LFG ganggg", "score": 1, "replies": []}, {"body": "You're looking at Walmart for a short squeeze from the 1.5% short float of the 2.5 billion shares?  Did I read that right?  Do you think Walmart is going to gap up?  This is so dumb.  Please go examine AAPL for the possible short squeeze.", "score": -3, "replies": []}, {"body": "Do you see that E in February?\n\nThat was their earnings date.\n\nThey missed estimated earnings.\n\nThis is why they tanked.\n\nTheir stocks will absolutely recover over the next quarter, but there's not much of a \"play\" to be had here, just holding stocks in an old whale of a company.", "score": 0, "replies": []}, {"body": "Down .40-.60 from yesterday’s extended highs, almost $1 from reg hours highs. Idk, might be heading back to support one more time. Unfortunately, I don’t remember the source but I did hear that Walmart is lagging compared to other retailers at the moment. Thanks for the chart though, I’ll be watching since it does looks like a formidable pattern.", "score": 1, "replies": []}, {"body": "Im buying 137.5", "score": 1, "replies": []}, {"body": "If I buy WMT, can I get free stuff since I will be part owner?", "score": 1, "replies": []}, {"body": "In for some $146c 4/16", "score": 1, "replies": []}, {"body": "Good DD.  The second they posted the Amazon fight plan I bought.  Down 13% still but great long term hold.", "score": 1, "replies": []}, {"body": "I YOLO'd on walmart last week. If I only picked an expiriy 1 week later I'd be doing well.\n\nAnyways, 90% of the stocks seem to be almost recovered from last months dip. A week from jumping on", "score": 1, "replies": []}, {"body": "I was waiting for 141 for that break out.", "score": 1, "replies": []}]}
