{"title": "Amazon shares could 'easily' hit $1,900 this year, Goldman Sachs says", "selftext": "\nHere are the main points (highlights):\n\n* The investment bank, already has a $1,825 price target on Amazon. But the $1,900 is beyond what Goldman has previously said.\n\n* Analyst Heath Terry said he thinks Amazon's stock is undervalued and estimates are too low for the company's cloud and retail business.\n\nvia CNBC (CNBC.com)\nLink (Source): https://www.cnbc.com/2018/03/20/amazon-shares-could-easily-hit-1900-in-2018-goldman-sachs.html\n\nNote: Amazon will so likely become a $1T company this year after Apple. ", "id": "85ui0c", "created_utc": 1521566374.0, "score": 211, "upvote_ratio": 0.94, "num_comments": 84, "comments": [{"body": "Actually agree on this, Twitch is blowing up right now too. Twitch ad and subscription revenue will be interesting next earnings.", "score": 66, "replies": [{"body": "Twitch might be one of the craziest ideas I have heard of in recent years. Other people watching others play video games and giving them donations for it (donations to play a video game?) that the streaming company takes a chunk of. What the hell bizarro world is this?", "score": 52, "replies": [{"body": "And yet we don't question Reddit Gold.", "score": 60, "replies": [{"body": "shh", "score": 16, "replies": []}]}, {"body": "What kind of weirdo are you that the idea of watching charming people play video games live, with the ability to interact and communicate with them on their stream, or actually join them in their games, possibly forming personal relationships, is not immensely appealing as a form of entertainment versus other entertainment media forms like tv shows, youtube videos, movies, which are comparatively static and completely non-interactive or personal?", "score": 16, "replies": [{"body": "I... I don't even know how to respond to this other than I am very glad to be an AMZN shareholder. This shit is only increasing the ever sedentary lives that people chose to live. ", "score": 13, "replies": [{"body": "Watching people play ball is a multi billion dollar industry. ", "score": 9, "replies": []}]}]}, {"body": "It’s the uber consumeristic world we live in.  People starving to death, but let’s market this shit to a bunch of idiots and they’ll piss money away!\n\nA sucker and his money are soon departed. Been that way since the beginning of time...", "score": 4, "replies": []}, {"body": "What percentage of the donations does twitch take? ", "score": 2, "replies": [{"body": "Donations 0%, subscriptions 30-50% depending on steamer size", "score": 2, "replies": []}]}, {"body": "It's not really different from watching people play sports...", "score": 1, "replies": []}]}, {"body": "Twitch is less than 5% of Amazon's revenue.", "score": 26, "replies": [{"body": "Really? That's actually still quite impressive.", "score": 31, "replies": []}, {"body": "That's fine, they're still growing and adding to the bottom line. That's why I said it'll be interesting, maybe they'll be 7-10% by this time next year.", "score": 14, "replies": [{"body": "I don't know if Twitch could even be profitable. YouTube is a decade old and isn't capable of making profits.", "score": -4, "replies": [{"body": "Pretty sure YouTube makes google lots of ad money, so I don't know what you're talking about ", "score": 17, "replies": [{"body": "Revenue ≠ profit ", "score": 14, "replies": [{"body": "Profit from ad revenue = revenue.\n\nUnless you mean to say revenue from an ad service isn’t profit, to which I say, “Bologna!”", "score": 0, "replies": []}]}]}]}]}, {"body": "I think this is the entire point of why Goldman thinks Amazon is undervalued. They have a number of business lines that have yet to contribute significantly to the revenue and profits of Amazon, but would be a company unto themselves if independent. Twitch, broadcast, AWS, etc all represent massive upside, yet only contribute less than 20% of revenues based on the last filing.  Think about AWS. 15 or 18 bn run rate, only 12% roughly of revenue from what I recall. How many companies have multiple of those kicking around to grow the top line? ", "score": 3, "replies": []}, {"body": "More precisely, Twitch is less than 1% of revenue ", "score": 7, "replies": []}, {"body": "That’s quite impressive, all things considering. I remember a couple years back, twitch was extremely Blahhhh. YouTube was the big thing, but now twitch is slowly taking away YouTube’s video game scene. ", "score": 3, "replies": []}, {"body": "Just wait until your local movie theatre starts to offer Twitch livestreams for viewing.\n", "score": 1, "replies": [{"body": "Lmaooo.\nYou're actually retarded.\n\nLet's group up 200 people to watch one stream. Effectively dropping the viewer count by 199 and Ads viewed by the same ratio.\n\nTwitch can't/won't license it's platform to movie theaters. It's on the fucking internet for free. ", "score": 1, "replies": []}]}]}]}, {"body": "Holding shares and can’t wait.  ", "score": 23, "replies": []}, {"body": "Cloud computing is still in an early phase, relatively speaking. And AMZN is king of cloud computing.\nThis dog still got a lot of bark left in him, P/E be damned.\n\nInternet:Cloud stocks don’t give a shit about P/E, it’s all about growth. Keep looking at amazon as an Eretailer while the valuation goes zooming up...", "score": 18, "replies": [{"body": "Do you think they’d split the stock soon? If it were split 1/10 I’d imagine far more people would invest.", "score": 6, "replies": [{"body": "> If it were split 1/10 I’d imagine far more people would invest.\n\nDo most companies really want the type of shareholders that would want to buy a stock purely based off its price? These are the same types that will panic sell a stock when it goes down. \n\nThis is why Buffett never wanted to create a smaller class stock of Berkshire. He created BRK.B because someone else was going to create a unit trust so people could invest without having 5 figures for a single share (BRK.A price at the time)\n\nAFAIK Bezos has not said one way or another if AMZN will ever split. ", "score": 4, "replies": [{"body": "I’m just saying ~1500 per share is a bit steep for some investors. 300 per share would be a better entry point. I know I would buy 2-3 shares a month at that price point, but at the current price it’s hard to pull the trigger once a year.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "you're correct, but I don't... so.....", "score": 1, "replies": []}]}]}]}]}, {"body": "Isn't Microsoft's Azure on par with Amazon's cloud?", "score": 1, "replies": [{"body": "on par in terms of functionality, yes.\nBut not on par in terms of market share.  not by a long shot.", "score": 1, "replies": []}]}]}, {"body": "I love seeing shiz like this. Not because I'm holding Amazon.. but because it could be completely wrong", "score": 5, "replies": []}, {"body": "This reminds me of when oil was at $150 and GS predicted $200 a barrel...", "score": 10, "replies": [{"body": "I vividly remember this prediction. I was bagholding a substantial portion of my portfolio in oil stocks because I trusted Goldman to know what they were talking about. This was when I was first starting out self-directing my 401k. I learned a valuable lesson.", "score": 4, "replies": []}]}, {"body": "Goldman is an entire company full of cucks", "score": 38, "replies": []}, {"body": "I think that its very possible. This stock has incredible momentum.", "score": 7, "replies": []}, {"body": "Good. Go Amazon go. ", "score": 3, "replies": []}, {"body": "Bubble bubble bubble bubble bubble ", "score": 5, "replies": []}, {"body": "Should I buy into amazon now? Or see if it goes down a bit?", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "nice call it did... did u buy some shares or calls?\n", "score": 1, "replies": []}]}, {"body": "Dollar cost averaging is your friend and way more reliable than trying to time the market for us mere mortals. Amazon is a stock you accumulate and hold for a long while. It's definitely not going to plummet in value any time this decade.", "score": 4, "replies": [{"body": "Lou Mannheim nods approvingly.", "score": 1, "replies": []}]}, {"body": "I have a suggestion. Go back to /investing and don't buy amazon. :)", "score": 1, "replies": []}, {"body": "It just rebounded from a drop.  I think it will probably drop again as it retests 1600.  Maybe watch and wait for that?", "score": 1, "replies": []}, {"body": "Buy.", "score": 1, "replies": [{"body": "You think $1530 limit is fair or it won’t go that low even with the impending rate hike?", "score": 1, "replies": [{"body": "If you think it may go to $1900 as GS says it will \"easily\" hit, do you wanna squeeze out an extra 50 bucks while running the risk it may not dip to your entry point? \n\nI own Amazon for the long haul. I add to my position whenever I get extra money. I don't wait and try and time it. \"Time in the market, not market timing\"", "score": 1, "replies": [{"body": "That’s fair. Changed to buy at market open!", "score": 1, "replies": [{"body": "Welcome to manhood ", "score": 1, "replies": [{"body": "Omg I just grew a pair. Now I’ve got tits and balls!", "score": 1, "replies": [{"body": "*Th... the perfect creature...*", "score": 1, "replies": []}]}]}, {"body": "I was trying to time it perfectly as well, and then Amazon went up $64 from yesterdays lows in a single day.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Which company would you rather invest in? \n\nCompany A: \nMarket Cap: $773B\nRevenue: $177B\nNet Income: $2.23B\n\nCompany B:\nMarket Cap: $225B\nRevenue: $500B\nNet Income: $9.3B\n\nRemember that analysts are always behind the curve. They modify their price targets based on the stocks recent price movements. Company A is Amazon. Company B is Wal-Mart. ", "score": 8, "replies": [{"body": "What does this mean?", "score": 3, "replies": [{"body": "It means that either Amazon is overvalued or Walmart is undervalued or both. ", "score": 3, "replies": [{"body": "...assuming they are similar or comparable companies, which is the fallacy here.", "score": 17, "replies": [{"body": "Right?  Walmart is a shithole.", "score": 2, "replies": []}, {"body": "Wrong. They are similar companies. Both generate most of their revenues from retail sales. Where they differ is that Amazon's profit margins are paper thin and about 2/3rds that of Walmart's. \n\nAdditionally, if not for AWS, which is Amazon's primary generator of profits due to high margins, Amazon would be operating at a loss currently. Given that Cloud storage is becoming very commoditized, prices will decline across the board, eating further into their paper thin margins. \n\nDon't get me wrong, I love Amazon and am a Prime member, but I would not invest a single dollar of my money in them at their current valuation. I'm also steering clear of Walmart, but used them as an example to show just how overvalued AMZN is. \n\n", "score": -3, "replies": [{"body": "Don't fool yourself into thinking AWS is going to be less valuable as cloud computing becomes more of a commodity. They offer a lot of premium services which will continue to generate high margins even while their basic infrastructure margin goes lower. Those premium services are a major point of difference and are starting to see big adoption which is why other big cloud vendors are starting to offer similar portfolios. ", "score": 7, "replies": []}, {"body": "AWS is a lot more than cloud storage...", "score": 2, "replies": []}, {"body": "WMT and AMZN are not similar companies.  Rather, they are different companies that compete in one industry segment, which is retail e-commerce.\nWMT does not compete in Cloud Computing, e-commerce search, E-sports, just to name a few.", "score": 1, "replies": [{"body": "The majority of revenues for both AMZN and WMT come from retail sales. They are very similar companies. ", "score": 1, "replies": [{"body": "WMT is a bricks and mortar retailer.  The majority of revenues for WMT come from bricks and mortar stores.\n\nAMZN is an [online services company](http://www.businessinsider.com/amazon-is-no-longer-a-retail-company-2017-10).  The majority of revenues for AMZN come from a broad offering of online services.\n\nThey are very clearly not similar companies. ", "score": 1, "replies": [{"body": "Tesla sells cars online. Volvo does so in stores. They are in the same industry. Your argument is invalid. WMT and AMZN both derive the majority of their revenues from selling goods. Furthermore, AMZN owns Whole Foods now, which is brick and mortar and has Amazon stores opening up. Come up with a more convincing argument. ", "score": 1, "replies": [{"body": "I buy AMZN and bank coin when it goes up year after year after year.\nThere is no profit for me to win a debate with you.\n\nYou also appear to have made up your mind already and dug in your heels to refute any further response i make so we will just have to agree to disagree.\n", "score": 1, "replies": [{"body": "I agree to disagree. ", "score": 1, "replies": []}]}, {"body": "valid points may i ask do you own any or have created a future earnings model with a discount rate, i believe WMT is undervalued and AMZN is ripe for the picking but still unprofitable but with massive potential but what i dnt like is anyone and everyone parking money in their stock and thinking theyre warren the 2nd.. if i was brave id buy puts but i do think they're here to stay but they will drop because america likes taking ppls money, i see a sanction or sum in my crystla ball (which has worked more times than not lol) and remeber trump isnt buddies with bezos, quite the opposite actually so i see a tumultuos times ahead but bezos got more money than god now so that buys allegience", "score": 1, "replies": [{"body": "I don't use any models to predict future stock prices because there are so many variables that you are unable to factor into such valuation models. \n\nIf FCFF, DCF, DDM or the like were able to predict any any semblance of certainty, most analysts wouldn't have jobs because anyone would be able to determine the future share price of a given company. The reason models don't work is that they are unable to factor in rapid changes that occur in any and all industries. \n\nFor example, let's say you constructed a FCFF model on AT&T and it gave you a future price of $40. Out of nowhere, Google, Tesla, or Amazon, etc. come out and announce that they're launching their own satellite communications network that enables its customers to use a phone anywhere on earth at a flat rate. It blows up the old telco revenue model and essentially renders your financial model useless. \n\nIt takes a lot of research (reading/energy/hard work) to determine a good potential investment before the rest of the market sees it. Remember that once everyone knows about it, the easy money is gone. \n\nHope this helps you. Godspeed. ", "score": 1, "replies": [{"body": "nice point. thx u too!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "AWS will make up 40% of the entire cloud by 2020.", "score": 2, "replies": []}, {"body": "Awesome. AMZN just has no stops.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "> Can't imagine people who bought earlier\n\nThe stocks I picked up in 2012 have been very good to me, but I'd be lying if I said that luck didn't play a big part in it. I picked nVidia over AMD, but had it been a few years earlier I might've gone the other way.", "score": 1, "replies": []}]}, {"body": "I'll start buying Amazon stock once they are right about Bitcoin dropping to 5k.", "score": 3, "replies": [{"body": "Almost there", "score": 3, "replies": []}, {"body": "I will buy Bitcoin if it drops to 5K.", "score": 1, "replies": [{"body": "Everyone is..", "score": 1, "replies": []}]}]}, {"body": "Apple has a PE ratio of 15.  Amazon's is through the roof.  Cucks..", "score": 2, "replies": [{"body": "The P/E has been through the roof since the stock price was under 700... since it doubled I think there's more to picking stocks than looking at a P/E ratio. \n\nDo some research into the two companies that doesn't entail just looking at a PE. Apple has one product that generates the majority of their income - iPhone. And software services surrounding iPhones like music and AppStore.\n\nAmazon has more diversified revenue streams. Retail aka Amazon.com (which they are absolutely dominating and e-commerce is expected to grow a ton in the coming years), AWS (cloud compute which is a growth field, P/E doesn't matter), twitch, machine learning, drones, Whole Foods, Amazon go, Amazon fresh, IMDb, Alexa and voice assistant products, the data they collect from various places including Alexa, etc etc etc. I think something like 30% of the internet runs on Amazon servers or something like that.\n\nTldr. - Amazon is a huge huge tech company so by just looking at PE you might be missing out on big investment opportunities. Do your research cucks", "score": 11, "replies": []}]}, {"body": " Hate reading those IB analysts reports.  Usually or always, stock price will react exactly the opposite!", "score": 1, "replies": [{"body": "do the opposite of analyst reports", "score": 1, "replies": []}]}, {"body": "Well , if the giant blood sucking squid said that it's time to go short Amazon. This is what they and other slimebags on wall st. do when they have a large position to unload. The shepples see the headline and move in to buy. Hence the name bagholders. ", "score": 1, "replies": [{"body": "agree, buy puts if brave, company will survive and strive but the sheeps parking money thinking theyre brk a , 200000 to teh sky lol ", "score": 1, "replies": []}]}, {"body": "AMZN needs 2065 to reach $1 Trillion market cap.\nNot sure if we'll see that by end of year, but I definitely believe there is high probability of reaching that milestone within the next 2-3 years.\n\nIn addition to Twitch + AWS, other potential drivers of revenue growth include Amazon search.  Amazon is currently selling targeted search ad placements to Amazon sellers.  There is no competition here, so that is just massive.  \n\nWith GOOGL's recent announcement of its Shopping Assistant functionality built into Google Assistant, I think it is inevitable that AMZN will open up its Amazon.com search platform to any 3rd party advertisers, not just Amazon sellers.  But note that AMZN doesn't need to beat Google in shopping/ e-commerce search.  Instead, it can still be 2nd or 3rd in search and still be able to grow revenues, and take its piece of the pie.", "score": 1, "replies": []}, {"body": "We can use this thread as a way of tracking if we will be right. ", "score": 1, "replies": []}]}
{"title": "I want someone to explain to me why inflation is a good thing.", "selftext": "Why should I work my whole life and put money away for my retirement. To only have 2 percent inflation a year rip through 40 percent of my money without me spending any of it in 20 years? It scares the shit out of me.... People can live until 100. What are you going to do at those inflation numbers? Don't you think inflation at 2 percent is way too fucking high? ", "id": "85ppsz", "created_utc": 1521516637.0, "score": 18, "upvote_ratio": 0.71, "num_comments": 81, "comments": [{"body": "That’s why you invest. And that’s why we have preferred tax rates for dividends and capital gains. To negate some of those effects. ", "score": 30, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I don't think you want to be 100% bonds when you retire, unless you are retiring very close to your anticipated death. More like 50% or 70% bonds.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It depends a lot on the age of retirement. I usually look at early retirement (before age 50) and in that event you need a higher stock % to make it. You're correct that 50% is probably too aggressive for most retirees at age 67 or what-have-you.", "score": 2, "replies": [{"body": "If you’re able to retire before 50 you won’t need to worry about your retirement fund lmao, you made it. ", "score": 1, "replies": [{"body": "[r/fire](https://www.reddit.com/r/financialindependence/) - it's not as crazy as it sounds.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "If the inflation rate was .5 percent or maybe even .25 percent. It would make alot more sense. Even when investing... You can't save yourself from the stock market crash. What the fuck do you do then? 2 percent is fucking way too high of an inflation rate. Seriously.... It is.", "score": -7, "replies": [{"body": "Save yourself from the crash? Just short it my guy", "score": 10, "replies": [{"body": "Starting...wait for it...NOW!", "score": 2, "replies": []}]}, {"body": "2% is alot? I thought 13.5% was alot in the 80’s.   Stop crying and invest in index funds, or atleast bonds", "score": 8, "replies": []}, {"body": "Compared to what man? Relax, human kind has like 200 years of a modern economy, we are doing the best we can.", "score": 11, "replies": []}, {"body": "You buy the crash, your waiting 40 years right? If becoming rich was easy, everyone would be rich. Going to work and being responsible is better than most other investments. Some people live their whole lives depending of 12 chickens for food and slinging eggs.\n\nA weak dollar does help exports too, it’s not all bad", "score": 3, "replies": []}, {"body": "Stop selling low", "score": 1, "replies": []}]}]}, {"body": "How the fuck else we gonna pay off the debt?", "score": 46, "replies": [{"body": "Damn. This is the only thing that makes sense about all of it. But we our fucking our own families over and making them poor because our government wants to overspend.... Fuck", "score": 19, "replies": [{"body": "youll be making more money as well with inflation too...\n\nwell maybe not you, but everyone else will", "score": 8, "replies": [{"body": "But you won't inflation doesn't keep up with wage growth no matter how Republican you are.  It is really just a tax.", "score": 3, "replies": []}, {"body": "Wait... I thought wage increases were supposed to cause inflation... you know, in industrial production environments that enjoy economy of scale.", "score": 2, "replies": [{"body": "its one goddamn circlejerk\n", "score": 3, "replies": []}, {"body": "Wage increases are a consequence of inflation, which cause more inflation, but the root cause of it is the good old printing money", "score": 1, "replies": [{"body": "No... the way the fairy tale has always been explained to me revolves around labor shortages causing the increased wages (supply and demand).\n\nMysterious inflation that appears out of nowhere is not the proper thing on which to base economic theory", "score": 1, "replies": [{"body": "That is one of the views, but if you look at it historically, increased wages come after the inflation. Inflation doesn't come out of nowhere, it comes out of the money supply growing faster than the underlying economy", "score": 1, "replies": []}]}]}]}]}, {"body": "There's many things that need to be said\n\n1) Individuals and firms are also encouraged to spend since the real cost of debt is lower and it stimulates economic activity with which you grow and decrease debt\n\n2) Since interest rates at which you can invest generally go up with inflation, you aren't seeing purchasing power eroded. If you look at the real rate of return on government securities that's surprisingly stable. You can even buy tips if you're really worried but I wouldn't recommend\n\n3) The rate of inflation doesn't matter, it's its change that matters. Nobody would like 5% a year but the economy would stabilize around it if there aren't shocks. Since inflation depends on expectations for the future, policies are extremely important and FED/ECB seem to stand ready\n\n4) The target inflation is less than 2%, that's not a lot and it doesn't erode savings, especially if you consider point 2\n\n5) Inflation 0 would be preferred, but that puts you at risk of deflation and then you're fucked for good, so you target something that is a bit positive so it can go down but still be positive", "score": 3, "replies": []}, {"body": "well true, but because USD is such a global currency in many ways, used by other countries and millions of non americans, inflation effectively lets our government tax non americans. yes it affects americans too, but if we just did a normal tax to pay back debt it would fall squarely on americans. inflation may still be mostly americans, but not totally. devilishly ingenious idea in a way.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "The 2 percent isn’t some intrinsic value that’s good. It’s really just high enough above 0 without being too high. Deflation is the real fear, and keeping a target of 2 percent gives some leeway around looser monetary policy to avoid deflation ", "score": 22, "replies": [{"body": "Basically, the Fed wants some nominal level of inflation they can measure so that they can get monetary policy wrong.", "score": 13, "replies": [{"body": "That and humans can't understand deflation. You stop spending money, if money is expected to appreciate in value. ", "score": 6, "replies": [{"body": "The real problem with deflation is that you need to reduce wages. That will infuriate people even if they are still getting paid a larger real wage, because we hate when numbers go down.\n\nPeople would rather make $50,000 with $50,000 of buying power in today's dollars than make $45,000 with $60,000 of buying power in today's dollars if last year's salary was $48,000.", "score": 1, "replies": []}, {"body": "As a shared delusion, the concept of money is subject to a certain amount entropy.  Economists don't like to talk about the \"inherent vices\" (an insurance term) associated with the concept of money.", "score": 1, "replies": [{"body": "What you say interests me and I would like to subscribe to your newsletter.", "score": 1, "replies": []}]}]}]}, {"body": "Bitcoin main selling point is the fact that it is a deflationary currency. So why don't we want out currency to be that? ", "score": 5, "replies": [{"body": "In a deflationary currency, you can buy more tomorrow/next week/next year than you can today, without doing anything.\n\nDid you buy anything today? Imagine if you had waited til tomorrow and you could have bought 2x as much.... But then tomorrow gets here and you could buy 4x as much.....rinse and repear\n\nSoon no one is buying anything and businesses close. As businesses close, demand drops and you can buy even more, so you and everyone holds onto your pot of gold. \n\nAll deflationary periods have been horrible. It's obviously more complicated than that. But the guy above said it best. 2% isn't some magic number, it just gives us room so we don't get deflation. ", "score": 14, "replies": [{"body": "> Soon no one is buying anything and businesses close.\n\nImagine how many tendies I can buy if I don't eat for a year!\n\nWhat if we scaled the inflation target to population growth? (Or is that where they get 2%?)", "score": 2, "replies": [{"body": "I don't rememberer where they get the 2% figure from my classes :/\n\nWe hardly ever hit their target rate anyways tho. Like they've been aiming at 2% for 10 years and been at like 1%", "score": 1, "replies": []}]}]}, {"body": "bro you might wanna just check out macro econ 101. i mean that sincerely these are pretty basic questions and you might enjoy getting them fleshed out rather than digging through shitposts here to find your answers", "score": 2, "replies": []}, {"body": "Check out what happened in the 30's.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "https://www.investopedia.com/terms/d/deflationary-spiral.asp", "score": 3, "replies": []}]}]}, {"body": "Inflation is good because it keeps you working. They don't want you to get a pile of money and then sit at home eating fruit loops and gummy bears all day. They need people to stay in the work force so that when they get that new Lear jet the paint on it is flawless cause you've been painting jets for 40years in order to save enough to retire.", "score": 22, "replies": [{"body": "Who is \"they\" and how do I become one of them?", "score": 10, "replies": [{"body": "Hard work.\n\nHA! Just kidding. Now get back to work.", "score": 12, "replies": []}, {"body": "All you have to do is get rich.", "score": 1, "replies": []}]}, {"body": "Inflation exists, at the end of the day, because money is a collective delusion.", "score": 7, "replies": []}, {"body": "And spending better hurry up and spend that money before it is worthless.", "score": 1, "replies": []}, {"body": "But you can actually retire really early if you invest in all equities and maintain a frugal lifestyle. This is the premise of r/financialindependence.\n\nStocks are the only long term hedge against inflation since they are real assets and cash flows with positive total real return, compared to something like gold which will lose to inflation after taxes since the real return is ~0%.", "score": 1, "replies": []}, {"body": "Honestly they want us to work our whole lives only to end it with a death pill.... Fuck anyone that thinks this is okay. The death pill is the millennials retirement plan they made for us. I'm not kidding.", "score": -4, "replies": [{"body": "welcome to society. if you dont like it, feel free to work every single day out in the jungle.", "score": 7, "replies": [{"body": "I would rather live in the middle of nowhere and forage for food tbh than live in a society. But you can't even do that without paying taxes. ", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "wow very cool edgy reply bucko, i bet mommy's proud\n\nid be fine, biggest concern would probably be boredom. u mad about it?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "oh nice save big guy. you were just being sarcastic and light hearted the whole time,,, now i get it. ", "score": 1, "replies": []}]}]}]}]}, {"body": "So I should allow myself to be robbed by the banks over time by inflation and if I don't like it I can spend alot of money to live in a jungle that is legally allowed for me to live in. Yeah.... That's not the answer.", "score": -1, "replies": [{"body": "as for the banks robbing you- federal bills have to be payed somehow. you never owned your money anyway, thats how capitalism works.\n\nand why do you add so many details to the jungle part? if you really hate government nothing stops you from running into the appalachian mountains and living off the land.", "score": 7, "replies": [{"body": "Because most land is government protected or privately owned. Which means I can't just run into a piece of wilderness and start chopping down trees and making farm plot without getting in trouble by the government or by the law system.", "score": 2, "replies": [{"body": "overthrow the government if its that big of a problem.", "score": 2, "replies": [{"body": "Over throwing the government is an expensive proposition.\n\nJust how, exactly, so you plan on paying for that?\n\nNew Boss; same as Old Boss.", "score": 3, "replies": [{"body": "well, obviously its the cheaper route to rally the like-minded people who cant stand working 30 hours a week /s", "score": 1, "replies": [{"body": "I see.... you've never actually worked on a farm of any type.", "score": 2, "replies": [{"body": "---> /s <---", "score": 2, "replies": []}]}]}]}]}, {"body": "Move to Siberia.\n\nI'm serious, move there. It's a fucking wilderness and you can easily live there your entire life without anyone knowing or caring. There's a documentary about a Russian family that lived in the Siberian wilderness since the 1930s without any outside contact. They didn't even know that WWII happened.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Heh heh... That's not inflation. < pulls out [1970s](https://inflationdata.com/articles/inflation-cpi-consumer-price-index-1970-1979/) and [early 1980s](https://inflationdata.com/articles/inflation-cpi-consumer-price-index-1980-1989/) /> That's inflation.", "score": 9, "replies": [{"body": "I have a Zimbabwean 100 trillion dollar bill. That's inflation. People had to be paid 3x a Day!", "score": 3, "replies": []}, {"body": "I count inflation by the amount of fake money the banks make to make the inflation that rate. I don't count worker wages increases as inflation. That's fucking bullshit.", "score": -7, "replies": [{"body": "Eh? Your reply doesn't seem to go with my comment. Maybe that's why people downvoted it?", "score": 3, "replies": []}]}]}, {"body": "Check your math, 20 years of 2% inflation would only eat 33.239202824490577% of your tendies.\n\nAlso your retirement money should be in a tax-deferred account like a Roth or Traditional IRA or 401K. From there you invest it in SOXL and TQQQ and end up with 10x your money in 5 years, guaranteed. C'mon man this is basic stuff.", "score": 5, "replies": [{"body": "Genuinely interested in your math. 1.02^20 is something like 48%, what am I missing here?", "score": 5, "replies": [{"body": "You might wanna calculate 0.98^^20", "score": 9, "replies": []}, {"body": "So you think after 40 years inflation would convert your money into negative dollars?", "score": 3, "replies": []}]}]}, {"body": "Inflation keeps money from becoming stagnant thusband encourageing investment.  2% loss a year is good because it gets you to move it but isn't so high that the currency becomes unstable and undesirable ", "score": 3, "replies": []}, {"body": "can we ban this commie ? He has been posting shit everywhere . ", "score": 9, "replies": [{"body": "Yes please, for the love of God. At least brand this fag with some LSC flair so people know what he's actually about.", "score": 5, "replies": []}]}, {"body": "It's a terrible thing for the individual, good for the economy. If inflation didn't exist people wouldn't spend as much. Spending = wages and productivity.", "score": 2, "replies": []}, {"body": "Deflation is really really bad\n\nAnd low and stable inflation is correlated with lower volatility in real GDP. ", "score": 1, "replies": []}, {"body": "The other point that was missed is a cheaper currency helps exports hurts imports so it allows us to sell our goods in other markets while preventing other countries from selling hear.", "score": 1, "replies": []}, {"body": "How else can we get that sweet sweet 1.6% rate with an Ally online savings account?", "score": 1, "replies": []}, {"body": "cost of living inflation is about 6% per year, not 2%.  Panic!", "score": 1, "replies": []}]}
