{"title": "AMZN: Amazon Down $58 (3.88%) In Premarket On News That Trump \"Hates It\"", "selftext": "", "id": "87ru8x", "created_utc": 1522243243.0, "score": 194, "upvote_ratio": 0.96, "num_comments": 84, "comments": [{"body": "[deleted]", "score": 73, "replies": [{"body": "facts", "score": 17, "replies": []}]}, {"body": "Fake news, AMZN rigged the election, Bezos has already beaten Earth The Game and is now just dicking around in sandbox mode building rocket engines n shit.", "score": 114, "replies": [{"body": "I think you're thinking of Elon Musk...", "score": 15, "replies": [{"body": "Bezos is worth more than five Elon Musks and also has a space company?", "score": 47, "replies": [{"body": "He do?", "score": 10, "replies": [{"body": "Blue Origin is the name. A good deal of time behind SpaceX, but they're more focused on building an engine for ULA right now than they are their flagship rocket.\n\nBO really lacks good PR, and they do kind of douchey things behind the scenes like aggressive patenting and aggressive \"don't use our shit in your artwork online\" actions that SpaceX seems to just not care about, but that doesn't take away from the fact that they're making excellent work on the engineering side.", "score": 31, "replies": [{"body": "Does ULA = United Lesbian Alliance?", "score": 9, "replies": [{"body": "Close, it's Uniting Lesbians Alliance.\n\nBezos wants to use Blue Origin       rockets to shoot lesbians over to your house to hook up. \n\nBezos is going to buy mtch and air b&b to round out the plan and you will get amzn gift card for letting the girls use your house.", "score": 18, "replies": [{"body": "Username checks out", "score": 3, "replies": []}, {"body": "they better make a porn version of twitch\n\nthey could call it jerk", "score": 2, "replies": [{"body": "Wth is twitch? Is it like Tinder?", "score": 1, "replies": [{"body": "think foursquare but for goats", "score": 2, "replies": [{"body": "Lmfao", "score": 2, "replies": []}]}]}]}, {"body": "*United Lesbians Allegiance", "score": 1, "replies": []}]}]}, {"body": "Blue Origin has different goals as well. Surely they are behind spacex in that they arent actively sending up payloads, but they also never intended to compete with the current rockets spacex has in use.\n\nMusk needs the spectacle, he needs to generate interest in the idea and he needed to get spacex generating revenue asap. Blue Origin has a fuck load of money backing it in bezos already, so they are more focused on long term goals.", "score": 6, "replies": [{"body": "I'm definitely excited to see what they do with New Glenn, I think Mars is Musk's spectacle but the Moon and the return of lunar landings would be far more beneficial to kick-starting the real science of space exploration.", "score": 1, "replies": []}]}]}, {"body": "You don't hear much about Bezos' space company because he doesn't need to hype it for money because he has all the money.", "score": 12, "replies": []}]}, {"body": "Probably around 7 or 8 musks by now tsla is fucking tanking", "score": 1, "replies": []}]}, {"body": "Bezos owns Blue Origin", "score": 2, "replies": [{"body": "From the sounds of it, Jeff may be able to buy spacex from Elon in the summer.", "score": 6, "replies": [{"body": "elon would never sell...", "score": 2, "replies": []}]}]}, {"body": "Nah Amazon makes money.", "score": 1, "replies": []}, {"body": "Elon is the kid who claims he beat it but he's absolute dogshit when he plays at your house and won't let you see his save file.", "score": 1, "replies": []}]}]}, {"body": "From 1555 to 1390 in 2 days. Orange man please stahp.", "score": 62, "replies": [{"body": "Fucking kill me", "score": 17, "replies": []}, {"body": "But he said,\"Great news! #MAGA\", posted an image of the stock market.\n\nhttps://twitter.com/realDonaldTrump/status/978368319542702080", "score": 10, "replies": []}, {"body": "We need a business man they said, a cabinet full of business people and billionaires will help this economy they said. ", "score": 7, "replies": []}]}, {"body": "fake billionaire jealous of a real self-made bazillionaire", "score": 190, "replies": [{"body": "bazillionaire sounds made up", "score": 29, "replies": [{"body": "bezillionaire*", "score": 87, "replies": [{"body": "I like it...", "score": 11, "replies": [{"body": "bazinganaire*", "score": -23, "replies": [{"body": "Leave", "score": 39, "replies": [{"body": "http://www.thepicta.com/media/1362050976454040444_4046129691", "score": -12, "replies": [{"body": "Why the downvotes: https://steamuserimages-a.akamaihd.net/ugc/269471549690180612/560B3B74D2FDA03A913B12C772612AC57CB4A388/", "score": -12, "replies": [{"body": "Because you're too much of a faggot for this place which is damn near impossible but you've goddamn done it. ", "score": 14, "replies": [{"body": "I know what you are but what am I. Bazinga!", "score": -1, "replies": [{"body": "You suck at this", "score": 3, "replies": [{"body": "raise boys and girls the same way", "score": -1, "replies": [{"body": "no", "score": 2, "replies": [{"body": "Your mom sucks at this. If you know what I mean ( ͡° ͜ʖ ͡°)", "score": -3, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Brazilionaire.", "score": 3, "replies": [{"body": "Gorillionaire.", "score": 1, "replies": []}]}]}]}, {"body": "Trump wants to destroy FANG stocks. SHORT EVERYTHING!", "score": 12, "replies": []}, {"body": "Is this shit legal?", "score": 29, "replies": [{"body": "Not liking something?", "score": 17, "replies": [{"body": "No, Reddit sperging on Trump", "score": 5, "replies": []}]}, {"body": "[SEC submit a tip,](https://www.sec.gov/tcr) says:\n\n>If you have a tip or complaint involving the conduct listed below, or any other potential securities law violation, click the button below\n\n- Manipulation of a security's price or volume \n- False or misleading statements about a company \n\n", "score": 3, "replies": [{"body": "This is awesome. But I think you have to be the one selling the security for rule 10b-5 to kick in. ", "score": 2, "replies": []}]}, {"body": "No", "score": 20, "replies": [{"body": "I feel like bezos could be suing the fuck out of him for attacking wapost and now AMZN ", "score": 22, "replies": [{"body": "He's probably laughing his way to the bank to buy back stock", "score": 18, "replies": [{"body": "Ding ding ding. Wouldn't even be surprised if Trump's friends like Icahn asked him to help them get in sub 1500.", "score": 6, "replies": []}]}]}, {"body": "Good thing Trump is above the law. ", "score": 6, "replies": []}]}]}, {"body": "He just hates that some nerd who started selling books can run a real  business and turn actual profit on his own merit.", "score": 33, "replies": [{"body": "Can you imagine if trump started as a quant like jeff basically was", "score": 8, "replies": [{"body": "wouldn't have gone into bankruptcy six times if i had to guess", "score": 16, "replies": []}, {"body": "He might of been able to use his dads money to do more than marginally beat inflation. Oh and piss off every contractor and lender in NY", "score": 3, "replies": []}]}]}, {"body": "Bezos made no friends on Washington by not moving to Detroit for the second HQ. While it makes sense business wise in the short term, long term he would have been untouchable. By moving to Detroit he would have solved a problem both Democrats and Republicans have been stumbling over for decades and would make Amazon practically impurvious to US antitrust regulation because no politician would want to openly gut Detroit in breaking up Amazon.\n\nTbh, even if it isn’t Trump, the way Bezos co ducts business is in an overly aggressive manner that may come back to haunt him. The blitz of a buyout of Whole Foods and the way he prices out competing data centers leaves a bad taste in many. Walmart, target, Kroger etc have way more powerful friends and if they truly start getting hit in say volume retail, these companies will go right to the top where Amazon doesn’t hold much ground.\n\nRemember, the antitrust suit against Microsoft didn’t make any sense either at the end of the day. ", "score": 24, "replies": [{"body": "I agree, combined with amazons ambitions to enter the prescription mail order business it’s only a matter of time.", "score": 4, "replies": [{"body": "As a $RAD bagholder, he should buy $RAD.", "score": 1, "replies": [{"body": "RAD is done.  They sold the stores to WAG and Albertsons is getting the rest ", "score": 2, "replies": [{"body": "You shut your face", "score": 1, "replies": [{"body": "I mean it’s the truth", "score": 2, "replies": [{"body": "I know, but you shut your face right now!!", "score": 2, "replies": []}]}]}]}]}, {"body": "Are you crazy. How many pharmacy service companies exist out there? How does entering an already crowded market amount to monopolizing that market? They aren't allowed to compete? I think you may not understand antitrust. ", "score": 1, "replies": []}]}, {"body": "Detroit doesn't rank well on any of the things Amazon says they want. It would arguably be breach of fiduciary duty to pick an inferior site for political favor.\n\nMicrosoft antitrust was totally different. They were actively prohibiting competitors from placing web browser software into windows while simultaneously prepackaging every copy of windows with an uninstallable copy of internet explorer. What does Amazon do anywhere close to that?", "score": 3, "replies": [{"body": "it's not a breach of fiduciary duty if picking an inferior site for political favor creates financial benefits above and beyond the negatives an inferior site.\n\npolitical favor is very valuable.\n\n", "score": 1, "replies": [{"body": "That's a big if ", "score": 1, "replies": [{"body": "any good analyst can make the numbers work", "score": 1, "replies": [{"body": "Hey man more power to you. Personally, I wouldn't invest in your company, but via con Dios nonetheless. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">Trump also pays close attention to the Amazon founder's ownership of The Washington Post, which the president views as Bezos’ political weapon.\n\nArticle should have just said this.  Trump hates WaPo and wants to slap down Bezos.  ", "score": 8, "replies": []}, {"body": "I know Trump has been reported to be against Amazon in the past, but why is this article the one making buzz? The other news sites are just reporting using this article. Could this be market manipulation? How reputable is this website, writer, and his anonymous sources?", "score": 3, "replies": []}, {"body": "Lost $30k since word of this got out for the last few days. Fuck Trump he's such a baby he just hates the Washington Post.", "score": 5, "replies": []}, {"body": "where’s that guy who made the joke about shorting Amazon ", "score": 2, "replies": [{"body": "He went all in on $ROPE", "score": 1, "replies": []}]}, {"body": "I guess Turmp moves the market now, oh well\n\nLong REITs and Russian oil I guess", "score": 2, "replies": []}, {"body": "BUY THE DIP BOYS", "score": 1, "replies": []}, {"body": "I hate to say that I told $AMZN investors that it’s a terrible stock. Great company though", "score": 1, "replies": [{"body": "up vote cuz of all your down votes cuz if you bought amzn since breaking $1k you deserve to lose money. ", "score": 3, "replies": [{"body": "Word, too much froth. Doesn’t help that Blackrock, Fidelity, and Vanguard helped pump the price with their index funds. But speculators gonna speculate. ", "score": 2, "replies": []}]}]}, {"body": "Lock him up", "score": 1, "replies": []}, {"body": "Anonymous sources lmao who cares.", "score": 1, "replies": []}]}
{"title": "AMD below $10 again", "selftext": "Who's dumb enough to buy more and keep getting abused?\n\n*Edit: Coming up on its 52 week low. Physically cannot go any lower than that right guys?? plz?", "id": "87rxrp", "created_utc": 1522244116.0, "score": 89, "upvote_ratio": 0.96, "num_comments": 118, "comments": [{"body": "Advanced money destroyer", "score": 156, "replies": [{"body": "Literally the worst meme stock ever.  ", "score": 41, "replies": [{"body": "or the best?  \n\nSorta depends on how you look at meme stocks.  ", "score": 21, "replies": [{"body": "Ya fair enough.  But at this point maybe it’s not the best or the worst - it’s more like an annoying ex who won’t leave me alone....still hanging around in my portfolio even tho I’ve moved onto way fresher meme stocks.  ", "score": 8, "replies": []}, {"body": "AMD at a discount. Sorry if you guys got ruined, but I love deals", "score": 2, "replies": []}]}, {"body": "What about RAD?", "score": 7, "replies": [{"body": "Up 12% today.", "score": 1, "replies": []}]}]}]}, {"body": "You are asking the wrong people. A bunch of these guys bought calls for AMD yesterday. ", "score": 49, "replies": [{"body": "Can confirm. Just bought calls", "score": 29, "replies": [{"body": "I mean it's only the most cyclical stock on fucking planet Earth.", "score": 14, "replies": []}, {"body": "Bought *MORE* calls expiring next week...have been bagholding calls since they dropped to 70%, then 80% and then 90% loss...", "score": 5, "replies": [{"body": "that means I should buy puts.", "score": 1, "replies": [{"body": "Probably...but what if I buy puts too?", "score": 2, "replies": []}]}]}, {"body": "Please tell me is expire this Friday ", "score": 3, "replies": [{"body": "No, been there done that. $10 5/18 this time.", "score": 3, "replies": [{"body": "I may join you depends on how it perform tmr", "score": 1, "replies": []}, {"body": "I may join you depends on how it perform tmr", "score": 1, "replies": []}]}]}, {"body": "####mee too got $11 calls that expire tomorrow", "score": 1, "replies": []}]}, {"body": "I bought my first call and it was amd $11 for 4/6. Was that a bad decision? I saw that it usually bounced between 10 and 13, but now its at 9", "score": 10, "replies": [{"body": "Cant tell if youre trolling but 4/6 doesn't look good as of now lmao", "score": 18, "replies": [{"body": "Had a feeling i fucked up. Options are pretty confusing no matter how much i try to learn about them. But, yeah i didnt realize how close 4/6 actually was. Is there a maximum loss amount for this? I bought 1 call so i figured i wouldnt lose too much.", "score": 6, "replies": [{"body": "You can lose 100% if it doesn't reach strike price by expiration. 1 call isn't even that much of a loss, but AMD might close green today so if you can break even or even make a small gain I would recommend selling asap. But then you're on r/wallstreetbets and you shouldn't take advice from faggots like me.\n\nedit: boy was i wrong about closing green", "score": 22, "replies": [{"body": "100% being what it took for me to buy it right? If so, thats fine.\n\nNo, i totally appreciate it man. I should know better than to ask advice in this sub, but im glad i did", "score": 4, "replies": [{"body": "calls and puts have a defined max loss at the amount you paid for the contract, which is why they don't require margin (first level of options trading)\n\nit's the rest of the shit that can fuck you in the ass\n\nas a rule the closer you get to the end of your contract the less the contract is worth, so if you're buying things less than a month out then you're betting on quick price movements\n\n4/6 gives you some time to recover but you should definitely look to sell either as soon as it hits green or before it loses more than half the price you paid, most FD traders should have a preconceived profit or loss amount that they're willing to risk", "score": 4, "replies": [{"body": "Okay, so around $20 is max loss? I only ask because i see people lose thousands. Is that just because the stock is more expensive or more contracts? If so, thats a relief.\n\nOkay it was at -8 yesterday, then it said -2 today. Does that mean im at -2 or -10 (for each day)?", "score": 2, "replies": [{"body": "Depends on your broker but you should have a daily gain/loss and a total gain/loss. Look at your column headers.\n\nYour max loss is whatever you paid for the option contract, if you're out of the money (OTM) on the expiration date and you can't sell the contract to someone else before it expires, then you lose whatever you paid for the contract.", "score": 2, "replies": [{"body": "Okay so i just want to ask if im profiting at all with this put atm. It says 17.30 to break even so i assume im not.\n\nhttp://imgur.com/ncIv1QD", "score": 1, "replies": [{"body": "You need to consider a couple of things about options; the majority of us (you included) are buying and selling the *option* to do something with 100 shares of the underlying stock.\n\n A put option as you have here is saying \"I'm going to make you buy these shares at this strike price\", typically the seller of these thinks the stock will stay above that price and the money you paid for that contract (your $5.20 x 100 shares aka premium) will go to them and nothing else happens. \n\nSo there are two ways you can make money. You can hold the contract until expiration date at which point you can execute it and get paid actual price minus strike price (plus a couple dollars your broker charges as exercise fee). This is fairly uncommon but in your case may be smart since this is likely to continue to drop. \n\nThe other way to make money is to resell the contract. In your image, you have the price paid (5.20) and the current ask (9.05), which means someone is willing to buy your contract for $9.05x100 shares at a profit to you of that minus what you paid (net +$3.85x100). You can sell your contract now and secure that amount of profit. \n\nReselling a contract takes into account the underlying stock cost, the time left until the option expires, and the volatility of the underlying stock. It costs more to buy a contract in the direction that the stock is already moving because people believe it will keep moving that direction. \n\nThis is really basic options stuff. Things like LFIN are extremely rare and you are very lucky to be making money on it. Go read some stuff on options before putting more money in, it won't be this easy. \n\nEdit: Break even price on a put contract is calculated as strike (the number in your contract) minus premium (what you paid for the contract). $22.50 - $5.20 = $17.30. So right now you are essentially at $0 if the option expires today. If the stock goes up, you lose money. If it goes down, you gain everything * $100. \n", "score": 2, "replies": [{"body": "Youre the man. Im understanding it a bit more now. Ive been doing research and watching videos, its just a topic that i knew literally nothing about weeks ago, so its hard for me to wrap my mind around some aspects of it. I figured maybe just jumping into it (with a low amd call) would be a good way to learn.\n\nI will keep learning and youve helped me understand a lot. Thank you.", "score": 2, "replies": [{"body": "No problem. The biggest mistake (besides picking the wrong side of a trade) that inexperienced options traders make is with breakeven prices and options premiums. The closer you get to expiration the lower the premium will be, which works against you while you hold a contract and for you if you wait to purchase it. That's the time value of money (theta) that you see referenced. Even holding overnight can highly reduce the value of your option on the open market which is one of the many reasons why you see a lot of action in the hour or two before market close. ", "score": 1, "replies": [{"body": "So, do you think itd be wiser not to wait to exercise it since premium will go down?", "score": 1, "replies": [{"body": "That is a question that options traders will always struggle with. If you think the stock continues to bleed out then you're better off holding but you're at guaranteed profit right now. You will need it to drop at least 3-4 more dollars to break even on your potential profit right now, which honestly seems pretty likely. \n\nIf you can tolerate some risk, I would say to just ride it into the ground and make all of that profit but that's just me, nobody ever went broke taking profit on a trade and certainly you'd be able to do that right now. That's the fundamental reason someone is willing to pay you $9 for your current option, that they believe it's going to keep dropping.\n\nMax value (at zero) is $1730 total. They're offering you $380. So yea definitely your call. ", "score": 1, "replies": [{"body": "Okay i guess ill make that decision on monday.\n\nWhats the risk to buying another put? What would keep this company even if everyone knows by now its a scam?", "score": 1, "replies": [{"body": "Depending on your level of options trading you can roll your existing put into a new one but yea it's pretty obvious this is a shit show and I doubt you'll see these kinds of returns again. ", "score": 2, "replies": [{"body": "Hey man, so if i cant find anyone to sell the contract on the last day, what happens?", "score": 1, "replies": [{"body": "You exercise it, buying the shares at market price and selling them to the person that wrote the contract at the strike price. That's how a put contract makes profit if you're not just buying and selling the contract itself. It's contractually guaranteed by the options clearinghouse. \n\n", "score": 2, "replies": [{"body": "Okay, so if im understanding this: Exercising would only be a good option if the difference between expiry price and strike price was greater than what the bid price is. I have no idea how to figure that math. ", "score": 1, "replies": [{"body": "You can't do the math on expiry because it's not that date yet. Right now you can only see what it's worth today. \n\nThe bid price takes into account the amount of time between now and expiry and the likelihood of the price moving one direction or another before that date. \n\nBecause people think it will continue to go down between now and your expiry, the bid should be more that the difference between the current price and the strike price. \n\nExample - 4/20 put $20 strike; current price $15\n\nYour option would be worth the $5 difference plus whatever time value until expiration, you would expect to see a bid of $5+ dollars (depending on how volatile the stock is). And remember, this is a contract for 100 shares, so it's that number x$100", "score": 2, "replies": [{"body": "Okay, so right now the price is 10.14 and the strike price is 22.5. So exercising the option would be 12.36. The market value is 14.05.\n\nSo i would be hoping that the price drops to make up for the time decay if i were to plan to exercise it?\n\nCan you exercise an option before expiry? Im not seeing that on robinhood.", "score": 1, "replies": [{"body": "No you can't exercise before the end of the contract (with American options trading). \n\nThe market thinks it will keep dropping so they're willing to pay more than the current value for your option. ", "score": 2, "replies": [{"body": "Hey man can you explain this?\n\nhttp://i.imgur.com/OLruaTf.jpg\n\nThats pretty sketchy looking, and it has me wondering if i should bail", "score": 2, "replies": [{"body": "There's plenty of explanations for why it would jump, biggest one being that there's not many shares available and so even a small amount of buying can drive the price up fast. There's still a lot of room to go down so it's up to you, no shame in securing profits. \n\nI'm going to hold to $5 or less. ", "score": 1, "replies": [{"body": "Okay, that makes sense. Ill join you to 5", "score": 2, "replies": [{"body": "The CEO is supposedly going on CNBC today so I'm thinking that's good news for us, he's an absolute joke.", "score": 1, "replies": [{"body": "Hes my hero", "score": 2, "replies": [{"body": "Before you ask, no idea why people are still buying. It's got such low volume it's probably being manipulated by either short squeeze or some other small factor. \n\nMy puts have a late May expiry so I'm going to ride it down, but don't feel bad about closing your position sooner than that to ensure profit. ", "score": 1, "replies": [{"body": "My initial purchase is 5/18 my other two are 4/20. I think ill ride it out as well.", "score": 1, "replies": []}, {"body": "Are we completely fucked? Did i just lose 2k? \n\nTrading has been halted. T12", "score": 1, "replies": [{"body": "I'll be honest something is definitely wrong, but this is absolutely being manipulated. I'm going to sit on it. The bid/ask on our put options has barely moved. ", "score": 1, "replies": [{"body": "My bid/ask is at 0", "score": 1, "replies": [{"body": "That's because NASDAQ halted them LOL\n\n https://imgur.com/N8JGSSm\n\nGood news for us. Look up what happened with DryDocks. ", "score": 1, "replies": [{"body": "I wasnt there for drydocks. Howd it play out?", "score": 1, "replies": []}]}, {"body": "Our favorite CEO is about to be cooked\n\n https://imgur.com/62z11jf", "score": 1, "replies": []}]}, {"body": "Hey i was wondering if i was to purchase a call when the shares are at $2 and the strike was $3 and it expired at $4 and i chose to exercise:\n\nWouldnt it have just been better to buy 100 shares at $2? What benefit does purchasing an option and exercising it have at this point?", "score": 1, "replies": [{"body": "Leverage, you have less capital tied up. If you plan to hold the stock anyway then it does make more sense to buy outright, or if you think it may rise significantly past your strike price. ", "score": 1, "replies": [{"body": "How is it less capital if youd have to pay for the 100 shares at a higher price?\n\nIdk i just dont get why exercising is a good idea.\n\nHow did you do this week?", "score": 1, "replies": [{"body": "That's if you get to exercise. If you want the shares then you're probably better buying but you also have the benefit of losing less if something goes wrong and it actually tanks. \n\nBadly. I'm sitting on the side for a while and cooling off. ", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Hey man i thought id let you know something interesting that could be a good play tomorrow. I bought a call for mtch and it reported good earnings. Combine that with market overreaction from the fb news and it sounded worth the risk. There is another stock IAC that match is a big part of. And it is also down like mtch is so im thinking it should behave similarly. \n\nWhat do you think?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Lol yeah dude I think the reason for the red is because of all the blood from my ass hole.", "score": 1, "replies": []}]}, {"body": "Yeah options can be confusing. So can calendars, apparently?", "score": 4, "replies": []}]}]}, {"body": "Same here dude. I have $10 for 4/6 and for 4/13. Looks like I'm getting fucked", "score": 2, "replies": []}]}, {"body": "Not buying calls here is basically losing money", "score": 4, "replies": [{"body": "This is what I keep telling myself anyway", "score": 1, "replies": []}]}, {"body": "I was one of those people", "score": 1, "replies": []}, {"body": "Hi, I’m one of them 10.5 AMA", "score": 1, "replies": []}, {"body": "Yup, ya got me.", "score": 1, "replies": []}]}, {"body": "Holy fuck I got in at $9.81", "score": 39, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "Nice, that's a penny off the recent low", "score": 16, "replies": []}]}, {"body": "You didn't sell did you ", "score": 5, "replies": []}, {"body": "I Should have done that with 10,000 shares. I missed it though.", "score": 1, "replies": []}, {"body": " sell calls. \n\n", "score": 0, "replies": []}]}, {"body": "Sold at 12 last time i bought at 10.  So, yeah.  I might sign up for more abuse like that.", "score": 25, "replies": []}, {"body": "3k deep I keep buying lol ", "score": 21, "replies": [{"body": "So brave.", "score": 6, "replies": []}, {"body": "you selling any covered calls on them?", "score": 1, "replies": []}]}, {"body": "Someone here said to put in a 10.50 short straddle so I put in a 10.50 long straddle instead. I'm up 62% thanks to you fags", "score": 17, "replies": []}, {"body": ">Who's dumb enough to buy more and keep getting abused?  \n  \nMoar calls, lets go", "score": 16, "replies": []}, {"body": "waiting for it to drop more then pulling out once it reaches 12-13 again. ez tendies", "score": 13, "replies": []}, {"body": "All in! Back to 12!", "score": 8, "replies": [{"body": " > 12!\n\n12! = 479,001,600\n\n", "score": 5, "replies": [{"body": "Don't know what that nonsense is but I like big numbers! AMD to da moon! ", "score": 21, "replies": [{"body": "STRONG fundamentals", "score": 7, "replies": []}]}]}]}, {"body": "Time to buy boys\n\nBuy below 11 sell above 13. \n\nez pz ", "score": 6, "replies": []}, {"body": "Fuck AMD...I'm getting out after the next pump and dump scheme from the analysts", "score": 5, "replies": []}, {"body": "Volume is way up today everyone is spreading BS about AMD... ready player one is released tomorrow going to smash. Their new chips are going to be the tits. AMD to 12 this year no doubt ", "score": 8, "replies": [{"body": "This year? Shit man the way and swings it could be back to 12 next month", "score": 5, "replies": [{"body": "I can only pray the market Gods will it!", "score": 1, "replies": []}]}, {"body": "> ready player one is released tomorrow\n\nlol like anyone's using AMD in their VR rigs.\n\nI've got straddles though so I'll take whatever I can get.", "score": 4, "replies": [{"body": "They will be 46 million in 2 years. AMD will have the only chips that will bring the price point down enough for this to even be remotely feasible. I still have no idea how they haven’t been acquired ", "score": 6, "replies": []}]}, {"body": "12 then back to 10 then back to 12 again. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Basically me right now. ", "score": 1, "replies": []}]}, {"body": "Keep buying op\n\nDont stop\n\n", "score": 5, "replies": []}, {"body": "put some money down on the 11 and 12 may 18 calls. lezgo bois", "score": 3, "replies": []}, {"body": "Bought 100 shares, wish i had more money atm to buy this meme stock.", "score": 3, "replies": []}, {"body": "Im long 200 shares, and have puts written at 11, 10.5, and 9.5 that expire over the next 2 months. LETS DO THIS!", "score": 2, "replies": []}, {"body": "Bought on Friday, sold May covered calls at $11. It's already lost as much premium as I received...so just has to stay sideways until the middle May otherwise I'll sell $10's the next time.", "score": 2, "replies": []}, {"body": "Unless $AMD can figure out how to make their SoC relevant again to what AWS and Google are doing with system design, this will probably keep trading relatively sideways.", "score": 2, "replies": []}, {"body": "They're going to CRUSH earnings. Even the Squeekyhana fucks say so. If market's feeling good, this is right back at the moon in a month.", "score": 1, "replies": [{"body": "AMDs moon is like $12-$13.", "score": 8, "replies": [{"body": "That's a 30% return with where it is now...", "score": 8, "replies": [{"body": "Are you defining moon as 30% gains. Cuz that is some autistic faggit ass fagatron shit right there man.", "score": 4, "replies": [{"body": "You’re right. That was pretty pathetic. But compared to my losses this week, 30% feels like the moon. ", "score": 2, "replies": []}]}, {"body": "$10-$13 was AMDs normal range the past year or so. Seems to be digging a hole atm. I'm thinking of selling $9 puts. My average was like $12, but I've sold a few calls that never got got exercised, that lowered it a bit.", "score": 1, "replies": []}]}]}, {"body": "Dream on nerd", "score": 1, "replies": []}]}, {"body": "Looks like a triple bottom possible around 9.70-9.80. The best technical sign  you can get. Long AMD confirmed ", "score": 1, "replies": []}, {"body": "pls bb no more\n\nI do not consent", "score": 1, "replies": []}, {"body": "Bought $11 call 5/4. With the money I used when I sold my $10 put in the money. \n\nFuck AMD. ", "score": 1, "replies": []}, {"body": "I got all in at $5.35, sold at $12.99 a couple months ago", "score": -10, "replies": [{"body": "Screenshots for proof.", "score": 6, "replies": [{"body": "it's not that crazy of a statement lol", "score": 1, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "true, although I still have a lifetime to make huge losses", "score": 2, "replies": []}]}]}]}]}]}
{"title": "AMA request: someone who traded during 2008 financial crisis/ 2000 tech bubble collapse.", "selftext": "1. How much did you lose?\n2. What made you decide not to off yourself?\n3. Amzn is down almost 10% in two days, should I kill myself?\n4. Did you buy the dip or sell like a fag?", "id": "87s17y", "created_utc": 1522244979.0, "score": 123, "upvote_ratio": 0.96, "num_comments": 83, "comments": [{"body": "I traded during all three of the 2018 great recessions. Am down $200.", "score": 277, "replies": [{"body": "Fuck man I'm so sorry to hear that. Is your marriage still intacted? Did you kids disown you? Just remember if you're feeling suicidal to just fucking do it.", "score": 65, "replies": []}, {"body": "Down $334 today \n\n\nDamn orange trump", "score": 30, "replies": []}]}, {"body": "Here we go. Trading or investing since I was 9 and I am now 40. \n\nIn 2000 I was up almost a million. I was buying everything and was spread out between 20-30 stock. Unfortunately about 80% of them were tech ( I still smack myself ). I went from 15K to about a million and then I lost 750K of it. Some of my main losses were in CSCO, ORCL, BRCM, TXN, and QCOM. I also was in multiple IPO's like JNPR, RHAT, and ICG. Even RHAT IPO I gained almost 150K in 10 trading days. After getting crushed I used 150K of that in 2002 as a down payment for 2 houses in Denver, CO.   \n\nIn 2008 I had 14 long investments and the most notable ones were FCX , CF, LMT, DE, GOOG, MA, and V. I did have three shorts at the time that I held as a hedge almost all the way to the bottom in BAC, FNM, and C. My longs positions lost 415K and my shorts had profit of 380K so I ended up only losing 35K. At the bottom I bought SBUX at 11, UNH at 28 and V at 55 pre-split that I actually still hold, but not all the shares that I originally bought. Lot of times I look for value instead of in and out. \n\nyesterday I shorted NFLX and looking at taking long positions in  CELG and CVS. My current roster right now is long NVDA, BAC, V, LMT, UNH, SBUX with shorts in AMD and now NFLX. The rest I am sitting on cash. \n\nThis is just my general rule. When you see the market go down 10% then it usually has 3-5 weeks to take out the previous high. If the high is not taken out it usually signals the end of the bull run. We should be at the start of the bear market or at least a sideways market and this should last on average 9-18 months. ", "score": 174, "replies": [{"body": "by far the best investment you made so far is those 2 houses in denver. hope you still have those. ", "score": 83, "replies": [{"body": "He bought UNH at fucking $28 and is still long.  Wonder how many shares?", "score": 29, "replies": [{"body": "and rental properties in denver are basically a license to print money, especially if he bought in 2002. that's cold hard cash in your pocket every month. ", "score": 41, "replies": [{"body": "for real. the value of denver property has skyrocketed. My buddy's property practically doubled in the last 5 years", "score": 7, "replies": []}]}, {"body": "1 share. ", "score": 2, "replies": []}, {"body": "I bought 400. Right now I have 135", "score": 1, "replies": []}]}, {"body": "I sold one last year for 415K when I bought it at 180K in Littleton CO. Still holding the other properties, but bad tenants are causing me pain. ", "score": 1, "replies": []}]}, {"body": "Dad ? I didn't know you used Reddit !", "score": 37, "replies": [{"body": "If my kid was on this forum, I'd be extremely disappointed.", "score": 21, "replies": [{"body": "That's what your dad said. ", "score": 2, "replies": []}]}]}, {"body": "best plays during bear/sideways markets?", "score": 17, "replies": [{"body": "Iron condor for sideways. Put spreadbacks for bear. ", "score": 15, "replies": [{"body": "on what type products industry specific etfs or individual stocks?\n\nAny recommended reading/educational material?", "score": 4, "replies": [{"body": "ETFs are always good. It always depends on the scenario, current world market conditions, volatility at the time, etc. Tons of research into the correct investment should be required, but this isn't the right sub for that.\n\nBest book: Option Volatility and Pricing by Sheldon Natenberg. Suuper boring book, but it tells you how to make high percentage winning trades based on certain indicators. It's complex, so if you don't understand options in principle before you start, read an intro to options book first. You use complex trade strategies to give yourself the biggest possibility of winning possible. Iron condors and spreadbacks included. ", "score": 11, "replies": [{"body": "> Option Volatility and Pricing by Sheldon Natenber\n\nThanks! I think I understand the basics of options. Been too shy to play around with them though. I will get both.", "score": 2, "replies": []}]}]}]}, {"body": "Defensive stocks that produce staples such as food, toothpaste, beer, utilities can be a good play in bears, and are definitely great plays in recessions/depressions", "score": 3, "replies": [{"body": "WMT", "score": 1, "replies": []}, {"body": "Exactly. I have been keeping a eye on GIS after getting killed, but that Blue Buffalo purchase for 8 billion was bad. Keeping a eye on the rest of the group\n\nK\nKMB\nCL\nCPB\nCLX", "score": 1, "replies": []}]}, {"body": "Random place to ask, but some siggested a book once, and I can't remember the name, but it was something like \"how to make money in a bear market\" any idea?", "score": 2, "replies": [{"body": "I would assume just short everything. However the experienced guy said put backspreads.", "score": 2, "replies": [{"body": "I was asking for the literal name of the book. I can't find it online", "score": 3, "replies": []}]}, {"body": "Also a great book to read is the contrarian investor. I try to read 4-5 books a year", "score": 1, "replies": []}]}]}, {"body": "why do you hang around wsb", "score": 13, "replies": [{"body": "I laugh on a lot of the comments. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Probably cause it was a bloated stock and had a crazy run up. ", "score": 19, "replies": [{"body": "Dis one.", "score": 4, "replies": []}]}, {"body": "The barrier to entry is not very much for example, Hulu, Disney ect are all growing in that space. Another is that PE of 250. Soon the quarterly subscriber growth will slow and that is all it has going for it. On the other side NFLX can be a monster so whenever shorting make sure to keep a stop loss. I shorted at 305 and my stop went in at 334 which is it's 52 week high", "score": 1, "replies": []}]}, {"body": "Buffett Jr.? Damn you started young.\n\nImpressive you were able to sniff out BAC, FNM, and C. Was it that obvious back then? ", "score": 4, "replies": [{"body": "Actually it started of the congressional hearings of Fannie and Fredie in 07. I actually started shorting KB homes, Pulte and others in 06-07 and got smoked\n\nIn addition I have a 7 year old who had his first investment at 4. He gave up his Christmas/B-day money to throw in on NVDA. Anytime he throws in his money I double his initial investment.   ", "score": 1, "replies": []}]}, {"body": "Nice analysis. So are you thinking this will rebound in the short term but then fall even further? Seems like the trend.", "score": 2, "replies": [{"body": "Even after the recent dips we’re nowhere near fair value p/e", "score": 4, "replies": []}, {"body": "I think the top was the end of January. It's good to move into a lot of cash and keep some. Try to balance out the longs a little with a short here or there. Below the poster said the average PE right now is 28. I think we need to get back to the 18 level, but things always over shoot. ", "score": 1, "replies": []}]}, {"body": "Whats something you know now because of the 2000/2008 events that you wish you knew then.", "score": 2, "replies": [{"body": "To always invest in good companies. Here are some of my rules that I need to follow\n\n1 never fall in love with a whore or stock. They will break your heart\n2 Always invest in a company with a good moat ie GOOG, V, MA, MON, ect ect \n3 Don't over pay for your value. If GOOG is what you want then the fair value is 850 right now. Just wait it will come to you at some point. \n4 Never FOMO. If a stock is ramping up and you missed going long then don't chase. give it time and see if it comes back a little before pulling the trigger. \n5 If your going for dividend stock make sure the PE is closer to 15 / profit margin above 10% and quarterly growth above 10% with a yield of at least 3%. Also check those debt levels or you will be falling into something like F. \n6 In growth stocks you want to see yoy growth of at least 25%. PE can be as high as 25 if the Moat is trandsending\n7 Always know what your investing in. If you don't have time for the knowledge in what the company does or their profits ect then stick to ETF\nHonestly I can keep going all day", "score": 2, "replies": []}]}, {"body": "> my shorts had profit of 380K\n\nhow do you hold shorts for this long without a buy in or ridiculous fees? ", "score": 2, "replies": [{"body": "To hold NFLX short for 1-3 months will not be much on fees. Obviously if you are short a dividend player then you have to pay out those divvy's. I look at it like security blanket and a lot of times it is easier to short or find a bad company than it is a good company. ", "score": 1, "replies": []}]}]}, {"body": "Bought the dip three time then froze all assets \n\n", "score": 14, "replies": []}, {"body": "Old guy here, started in the 90’s.\n\n1. Tech bubble almost broke me, 20k trading account to 5k. I had some stocks that evaporated like webvan. My 401k and employee stock went from 100k to $35.09 (worked for a telecom that went bust). They really sent me a check for $35. \n2008 I lost 40% of investments but had cash sitting and made some good real estate moves. Investments came back. Just sucked. I did get some great options in. Just took time to recover.\n\n2. I did not off myself because I landed a killer job in dot com bubble. 2008 I started a company so I was busy, no time to kill myself. \n\n3. AMZN, kill yourself I am holding a shit ton of it and I want to die. Suicide buddies?? \n\n4. I am holding today. Any more asspoundings I am going to cash and puts. All long term hold will be liquidated. **(EDIT NEXT DAY LOOKS LIKE WE REBOUNDING AFTER WHITEHOUSE SAYS THEY ARE NOT GOING AFTER AMZN)**\n\n5. Fuck Trump, #notmystockmarketcrasher\n\n\nMobile fucked format. ", "score": 22, "replies": [{"body": "Helperdroid and its creator love you, here's some people that can help:\n\r\n\r https://pastebin.com/iAhaF92s\n\r\n\r [source](https://github.com/TheTRUEHoohah/u-thehelperDroid) | [contact](https://www.reddit.com/message/compose/?to=cancerous_176)", "score": 7, "replies": []}, {"body": "Because you are holding, I am going to put everything in Ally. Thank you.", "score": 5, "replies": []}]}, {"body": "I made money.\n\nLeveraged bear etfs are your friend.  Back then it was financial etfs, this time  around it will be tech bear etfs more likely.   It's ironic FNGU launched right at the potential peak of this bull market, no?\n\nThis time around it won't be as bad as 2008 where everything gets destroyed.  The key is to always be skeptical of rallies and don't short until you see them start to fade.", "score": 40, "replies": [{"body": "Oil stocks and consumer staples are doing OK. This is way more about rotation out of over valued giant tech and into bonds. Those giant tech just make up too damn much of the indexes.", "score": 23, "replies": [{"body": "You are probably right.   Guy I follow who has been nailing this selloff last few weeks predicted the market will be a buy next week some time.  So I am sitting on my hands for now.", "score": 11, "replies": [{"body": "It turns out you can't value companies with PEs in the 100s or give Telsa a market cap bigger than GM when all it can do is burn cash.  \nIt doesn't explain MU though :(", "score": 22, "replies": [{"body": "> It turns out you can't value companies with PEs in the 100s\n\nYou absolutely can, plenty of software companies don't even have positive earnings yet but do have plenty of FCF", "score": 11, "replies": [{"body": "Software has really low overhead. Work from home, no heavy equipment, no shelf life expirations, limited regulations to deal with. Compare it to something like manufacturing airplanes, drilling for oil, or running a grocery store. It's a lot easier to run a tight ship, assuming your products can actually generate revenue.", "score": 4, "replies": [{"body": "> Software has really low overhead.\n\nThis is certainly true if you're thinking about it from a traditional fixed vs variable cost perspective. However S&M and R&D expenses are going to be quite high for high growth software businesses. That, combined with subscription revenue recognition practices, means a ton of software companies operate at negative operating margins (even on a Non-GAAP basis, on a GAAP basis it's even lower due to high stock based compensation expenses), but generate positive free cash flow because they collect cash for subscriptions upfront.", "score": 4, "replies": [{"body": "I mean it does have expenses (Visual Studio can cost a lot for licensing). But they also have lots of advantages from having non-physical products. Apple for example, can sell music and apps essentially tax free to the American consumer market. They can run the servers in the U.S. but they claim the 1s and 0s are in Ireland. Politicians who don't understand tech are none the wiser. It's a lot harder to keep track of when things are crossing country borders in cyber space.", "score": 2, "replies": []}]}]}]}]}, {"body": "Who is this guy you follow?", "score": 3, "replies": [{"body": "It's a service I pay for.  Here is a sample of what was in the email I received this morning:\n\n\"Bottom line.  TREND bearish  - tough to make much of early bounce from Europes open.. and this is being given back as we speak.. Over 2627 would allow for at least a bit more upside while under 2613 should lead to a retest of 2596-2600- UNDER is 3/23 lows 2586, then 2561-8\n\n \n\nGDP higher than expected.. 2.9% vs 2.7% while Deficit comes in -75.4b, the worst in over 10 years since Summer of 2008.  Inventory data nearly double what was expected 1.1% vs .5\n\nS&P futures have bounced from pre-Europe open lows when prices retested lows from late yesterday, while NASDAQ Futures still negative.  Movement OVER 2627 would lead to a larger bounce today despite the negative trend, with movement up to the 50% area of this range near 2637 possible.  However, until 2627 is exceeded, the trend remains negative and a greater chance of at least a retest of lows, with 2596 being a key level to watch given yesterday’s lows and if broken, would lead down to 2561-7 into Friday and early next week before any low.  Based strictly on Demark.   S&P did in fact complete BUY SETUPS.. but are not perfected..as 7th bar is the lowest.. while in QQQ this is in fact did successfully make a 9 count.    Outside of equities.. bonds very flat today, nearly unchanged..  Both WTI and GOLD down.. while Dollar attempting to bounce yet again\n\n \n\n \n\n \n\nS&P-  minor stabilization near yesterday’s lows..  but tough to have a lot of conviction to buy here just yet.  And trends remain sharply negative and momentum not oversold\n\nUNDER 2627 keeps trend bearish. With key areas at 2596-2600..  Over 2627 could allow for minor bounce.. but still a good likelihood of lower prices into 4/3-6 before any real low at hand which should be a buying oppty\"", "score": 6, "replies": [{"body": "Website please and thanks", "score": 2, "replies": []}]}, {"body": "These guys are a good twitter handle to follow.  They caught the 2PM selling trend first and have been correctly cautious on this market.\n\nhttps://twitter.com/bespokeinvest", "score": 4, "replies": []}, {"body": "Check this out.  CNBC wrote an article about these guys today.  Is there a mole here or something?  \n\nhttps://www.cnbc.com/2018/03/28/buy-the-dip-looks-dead-as-final-hour-of-trading-now-typically-sees-selling.html", "score": 3, "replies": [{"body": "The article's author may lurk this subrddt.  Thanks for that twitter handle, btw.  ", "score": 2, "replies": []}]}]}]}]}, {"body": "I'm so fucked", "score": 7, "replies": []}, {"body": "so.... switch everything from FNGU to FNGD?", "score": 6, "replies": [{"body": "I've been asking myself this for the last month. ", "score": 3, "replies": []}]}, {"body": ">Leveraged bear etfs are your friend. Back then it was financial etfs, this time around it will be tech bear etfs more likely. It's ironic FNGU launched right at the potential peak of this bull market, no?\n\nLooking for a long term hold when I close margin. What do you suggest? \n\nIs something like TECS viable? ", "score": 3, "replies": [{"body": "Yes or QID if you want 2x.   I am not saying we are in bear market yet btw so I would be careful about getting too aggressive here.  Good to wait and see since it's end of quarter tomorrow and maybe this volatility is related to that?  If the market turns its going to fly higher at this point.  ", "score": 2, "replies": [{"body": "Gotcha, so basically I should wait to see if the stocks bounce up and start speculating. Right now it's very affordable and I'd been investing only about 2k anyways. ", "score": 2, "replies": [{"body": "I wouldn't buy a leveraged etf for a long term hold, I missed that part of your post.  They are trading vehicles.  If the market stays in a volatile range for an extended time period they will actually lose value.", "score": 4, "replies": [{"body": "That's helpful, thanks. \n\nSo what's your position typically on these etfs? Apologies for all the questions, appreciate you answering.", "score": 2, "replies": [{"body": "I trade 2x leveraged etfs myself because there is slightly less risk.  If you want to YOLO then you should go for 3x.   They are great at a point like now when the market is going to probably make a huge move one way or another.  We are either going to have a big rally or another big leg down within a few days tops IMO.", "score": 4, "replies": [{"body": "How are you trading these ETF's? Using options?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Can we have someone who traded during the 2018 Bitconnect collapse?", "score": 19, "replies": [{"body": "Wasa wasa wasa", "score": 2, "replies": []}]}, {"body": "I traded during 2008 one, fortunately I was long all stocks and wasnt experimenting with options yet. At my peak, I think I was down 40%. I just held\n\nIt's boring yes, but they all came back\n\nWish I bought the dip with the little powder I had\n\nFun fact: even though ge is down a ton since I bought it, I'm still technically up bc of the sweet dividend", "score": 6, "replies": [{"body": "With how down they are, You've either of been holding for a long time or you own a fuck ton of shares.", "score": 3, "replies": [{"body": "Yah I’m down ~30% on GE and at this rate if the stock stayed where it is. I will make all my money back through the dividend long after I’m dead. ", "score": 3, "replies": []}, {"body": "Been holding for a long time", "score": 1, "replies": []}]}]}, {"body": "Friend of mine had a lot on margin, no leverage just Common Stocks but had Washington Mutual bank position, it was considered a big bank, like a dependable regional bank, I guess it flipped and he got margin called at the bottom because of it and got wiped out.  ", "score": 3, "replies": []}, {"body": "Traded SKF back in the day easy come easy go.", "score": 3, "replies": []}, {"body": "1) student loans that I still have interest ticking on.  2)since it seemed like the end of the world I thought I didn't have to do anything in that regard. 3.) No don't you want to see the end of the world? I mean maybe bezos shows up here for trading advise after he loses all of his money.  4. Bag held into bankruptcy (Leahman) I did get a post card about a class action years later nothing ever came of it.  I want to add everyone knew the market was cheap after the crash no one had money.  Dry powder was a phrase tossed around at that time.", "score": 5, "replies": []}, {"body": "I traded through the 2015 pullback, does that count?", "score": 2, "replies": []}, {"body": "A friend of mine was a day trader back then and lost everything. I once heard a guy ask him, \"You know anything about stocks?\" to which my friend responded, \"Enough to want to hang myself with an extension cord in my utility closet. Why?\"", "score": 2, "replies": []}, {"body": "I needed money for a down payment for a house in 2008. Was just in mutual funds at that time, but I think they were down something like 30% when I cashed them out?  That would've been $5-10k.  But that was a long time ago...who can remember", "score": 1, "replies": []}, {"body": "Buy low. ezmode.", "score": -1, "replies": []}]}
