{"title": "Microsoft to buy Nokia", "selftext": "[removed]", "id": "j8ij7j", "created_utc": 1602327403.0, "score": 94, "upvote_ratio": 0.65, "num_comments": 55, "comments": [{"body": "OP and title is clearly wrong. You've linked to a blog where it states Microsoft MAY buy Nokia (again) and it cites to another article where it states some \"Major U.S. tech company\" will buy Nokia in 2021. We've went from \"Nokia might be bought out by a U.S. company next year\" which has always been an undying rumor to \"Nokia to be purchased by Microsoft\" which is clearly false.\n\nThis OP is just a speculation to a speculation to a speculation to a rumor that has always followed Nokia.", "score": 115, "replies": [{"body": "Yeah what sub is this, WSB? Lol", "score": 5, "replies": []}, {"body": "Either way, my Nokia calls will probably print", "score": 1, "replies": []}]}, {"body": "They are buying a business outside of their core competence. This kind of acquisition is typically hard to pull off successfully. Most often, it tends to become a write off for the buyer.", "score": 53, "replies": [{"body": "Before 5g, i agree, very different  competences . The thing is, with 5g and future systems, telecom and software are merging, so to say. As I mentioned above,  AI is gonna be very important (traditional telecom network management and operations may not work if we shift to THZ frequencies, which some research is showing to be the way to go for increasing the speed and reducing latency of future networks). Add to that upcoming use cases like autonomous cars, AR/VR, industrial Internet of things, etc...\n\nEven 5g is super heavily based on cloud and network virtualization, network resources as a service, network slicing, etc, all areas where software companies can jump into easily.", "score": 15, "replies": [{"body": "I appreciate your perspective but don’t quite agree. I too am very familiar with some of these fields you mention and I don’t see as much synergy as you think there is. Moreover, there are issues to do with Microsoft knowing what do with Nokia once they buy it. Finally, telecom manufacturers always have had software expertise - the problem is getting telecom operators to pay for it. The operators want to lower the price and they have their own abilities for doing network management. Anything that Microsoft adds may not be an easy sell to the operators.", "score": 9, "replies": [{"body": "I think that opinion was under the previous ceo balmer. The current ceo saw the vision and steered microsoft to profitability.", "score": 1, "replies": [{"body": "Which opinion? The business case for buying Nokia was actually clearer under Ballmer than it is now. They only failed under Ballmer because they were late to the market and then Google squeezed them using its hold on services.\n\nNow, there is no clear cut benefit that Microsoft derives from buying Nokia’s switching business.", "score": 1, "replies": [{"body": "Microsoft mobile os was early like late 90's. Bad management killed it. Well idk but I hope nokia rises again.", "score": 1, "replies": [{"body": "It wasn’t bad management but bad technological choices - they were trying to sell their desktop UI on underpowered devices.\n\nWhen I say they were late, I meant late to the modern phone OS competition.", "score": 1, "replies": [{"body": "I agree. The desktop experience was not how people use their mobile today. Maybe the tiles may make a come back with their surface duo but it's sorta boated imo.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Could MSFT for example build the 5G core with their Azure cloud system? This would boost the Azure platform and show its competitivness compared to aws.", "score": 2, "replies": [{"body": "Is that not already in the works with computing at the edge to some degree?", "score": 1, "replies": []}]}]}, {"body": "outside of Microsoft's core competence???????? I cant down vote this enough", "score": -9, "replies": [{"body": "Your downvote doesn’t change a thing.\n\nWhat telecom products does Microsoft produce? Whatever the fantasies of Microsoft’s return to the handset market, it will not happen for the same reason their first foray with Nokia handsets failed  - Google has control of the software and services in the Android world and Asian manufacturers are extremely competitive in the hardware business.\n\nAs for the switching business they would now buy, they have no experience with it and buying a poorly managed company would not help them any.", "score": 13, "replies": []}, {"body": "Your presuming Microsoft is competent in providing low margin telecom infra, in which they have no inhouse operations. The people spreading this buyout rumor as some stock pump are totally incoherent of what modern day Nokia is, an unprofitable swamp of mismanagement enduring on a legacy licensing fee lifeline. They have no IP just the remnants of Alcatel-Lucents telecom infra business+ licensing fees from dying patents. If Microsoft buys them the stock will drop in a second.", "score": 7, "replies": [{"body": "True, i havent heard of nokia sense like cellular south was a thing.", "score": 1, "replies": []}]}]}]}, {"body": "Downvoted for clickbait", "score": 9, "replies": []}, {"body": "If microsoft would actually buy them, what would happen to my nokia stocks?", "score": 25, "replies": [{"body": "Definitely positive. Often they will be overpaid.", "score": 23, "replies": []}, {"body": "The deal says that /u/opencryptotools and /u/Gaddyyy have to forfeit their shares before any compensation arrangement is reached.\n\nUnfortunately that means you'll have to wait and see what happens to Nokia stonk from the sidelines.\n\nYou'll get em next time, kiddo", "score": 5, "replies": []}, {"body": "It's pretty much always higher, because if anyone were to suddenly buy a 50+% stake the stock would go up, so to acquire a company you almost always have to make a deal higher than the current market value.", "score": 1, "replies": []}, {"body": "I’d like to know that too", "score": 1, "replies": [{"body": "Pls see response above", "score": -1, "replies": []}]}, {"body": "Let's hope they go up a decent amount (:", "score": 1, "replies": []}]}, {"body": "I am drunk and misread that as Nikola, my puts skipped a beat!", "score": 13, "replies": [{"body": "Thought the same at first glance.", "score": 5, "replies": []}]}, {"body": "So how do you think this will fair on Monday?", "score": 6, "replies": [{"body": "The original post regarding this rumour is actually a few days old. This post added nothing to that rumour.", "score": 7, "replies": [{"body": "There it is! Someone mentioned it.", "score": 5, "replies": []}]}, {"body": "Its just OP talking shit, not an official announcement lol", "score": 2, "replies": []}, {"body": "I think Nokia msy pop a bit, but dont think it will impact MSFT,at least not in the short term.\n\nI own both Nokia and msft. 1300 nokia stocks (-15%) and 50 Msft (-2%). Was thinking of at least doubling my msft ....", "score": 2, "replies": [{"body": "if you are down -2% on msft and you are thinking it will double, you are very optimistic person.  not that it can't happen but it's a long way to go.  I have held it since 2000, yes, I am up something like 600% but it wasn't until a few years ago that it took off.  I been holding nok for too long as well, up 50% and I kept having hope.  If msft does by it, I hope they keep it a separate company with it's own name rather than give me 10 or so microsoft shares.", "score": 4, "replies": [{"body": "I meant doubling my position", "score": 1, "replies": [{"body": "Ok, sorry about, my morning coffee didn't kick in. Most things about the market I have been wrong but I am waiting until the election to see how things play out. We are in a second wave and if another shut down happens, the market may drop again. I live in Ontario, in areas around Toronto, they are rolling back to phase 2 restrictions and the cases here are not as bad as usa, we are too cautious here. If Biden wins, it's more chance of another shutdown and free money for everyone. Trump will keep it all open to not kill business and no free money. The election will be very important, please vote!", "score": 1, "replies": []}]}]}, {"body": "Do you realize that 1) the article you posted is from Monday, and 2) it doesn't jive with your title", "score": 1, "replies": []}]}]}, {"body": "Mods should do their job and ban incorrect titles. It's an investing subreddit, title accuracy is super important.\n\nAlso MSFt won't buy a 5G core network. Why the hell would they? It makes no sense. They can apply AI tech on top of 5G infrastructure without having to buy one. It's like asking an AI company to perform an AWS/Azure play.", "score": 2, "replies": []}, {"body": "I stand corrected, the title was misleading. How can I change it? It seems I can only update the content, not the title...", "score": 2, "replies": []}, {"body": "Pump and dump methinks", "score": 2, "replies": [{"body": "Something toasty for sure. Nokia has earnings coming up and this is the 2nd article I've seen like this.", "score": 1, "replies": [{"body": "MSFT will not buy nokia.  They left the phone space, and they are refocused on gaming.  If anything they'd buy out an AR company that will leverage 5G for gaming.\n\nHuawei dominates 5G.  Even with bans, Nokia an Ericsson are far behind on the tech.", "score": 1, "replies": [{"body": "You kidding? Nokia and Eric have more commercial contracts worldwide than Huawei does. \n\n\nADD this with the news that the pentagon is building their own 5G Network, it makes sense that Mircosoft is going to want in, using nokia as an example to get on the game.", "score": 1, "replies": [{"body": "this is a losing bet.   MSFT already spent billions buying that game company.  They are investing heavily in gaming growth not 5G.\n\nyou can buy and hold, but there's more money to be made in trading the renewable bubble and frontrunning the commodities supercycle.", "score": 1, "replies": [{"body": "There's also money in the short selling of the rumor too.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Stop. I can only get so erect.\n\nI've been long on NOK forever.", "score": 2, "replies": []}, {"body": "What does this mean for my leaps?!", "score": 1, "replies": [{"body": "Man that's the only reason I clicked on this.", "score": 3, "replies": []}]}, {"body": "Check out Gapwaves. Their antennas will be the global standard.", "score": 1, "replies": []}, {"body": "Anyone else read that as Nikola at first? 😅", "score": 1, "replies": []}, {"body": "That would be huge", "score": 1, "replies": []}, {"body": "I own a ton of Nokia stock, thought it was undervalued with 5G on the horizon and the Huawei discussions. But I don't believe that MSFT would buy them (again) or that it would be a good fit.", "score": 1, "replies": []}, {"body": "I hate Nokia for their h.264 lawsuits. Nothing else to comment on, the article is just a clickbate of an old rumour", "score": 1, "replies": []}, {"body": "I think they are going after the Nokia Not for the handset bussiness but for the Telecom 5G  ISP side of the business", "score": 1, "replies": []}, {"body": "Doesn't hmd own nokia?", "score": -1, "replies": [{"body": "HMD is a new company that took over the rest of the Nokia phone business and has exclusive brand licensing. But Nokia is a much larger company than HMD and has long done much more than phones.", "score": 1, "replies": []}]}]}
{"title": "How I covered early all my yearly loesses in $STOR by selling put contracts", "selftext": "3rd post, starting to get a hang of this community, if you want to skip story time the tips are just below the screenshot.\n\nI had been accumulating $STOR in 2019 and hit around a $35 average price. I thought to myself \"I found my leading stock\" then COVID came around and I saw how my investment got cut by 60%, boy did I feel stupid for a few days - starting listening to every piece of info that came out of the CEO Christoper Volk, seems like he wasn't worried, and the whole company started doubling down on inside trades, there are only buys for the last 12 months. I took a note from the management book and doubled down myself, and while doubling down was the easiest play to go for I wanted to see how I can scale my upside through the expected recovery and therefore I sold put contracts as far out as possible on the hopes that I could recoup my losses faster. \n\nHappy to say it worked...\n\n[There were many more gains earlier in the year, here is what's left open](https://preview.redd.it/0t7cmohkcas51.jpg?width=1000&format=pjpg&auto=webp&s=0a36e29f06c3143fa22e354e589b79eb588b44cf)\n\nThe tips section\n\n\\*\\*\\* before any tip this is a play I would only do on a stock I had already a very high conviction that I wanted to hold on to for the next 10 years \\*\\*\\*\n\n1. If you think the world is going to end, then this trade isn't for you, I heard people like Kevin Oleary say that REITs are dead and that you should stay away from them, I understand that this might not be the safest space to be in right now but do your research and you might find some interesting REITs that actually were well-diversified enough to withstand difficult times.\n2. Don't be afraid to sell ITM, many of the options I initially sold where ITM (not deep ITM), you get an excellent bang to your back in terms of using your buying power.\n3. Don't be afraid to get assigned, if I already found I stock I think is totally undervalued, being assigned is just as good as getting that contract to expire worthless.\n\nI sold 01/2023 contracts for $30, $35, $40 as I believe $STOR is going to be back around $40 (it's previous high) in the next 24 months. If for some reason it gets stuck in the low 30's I will still be above break-even on those trades so I like my odds.\n\nGood luck to you all :)", "id": "j8mla6", "created_utc": 1602344417.0, "score": 61, "upvote_ratio": 0.92, "num_comments": 54, "comments": [{"body": "In a similar situation right now with HYLN. Started playing it at $50 but have my basis down to $38 now. Obviously it sucks to have happen and it’s a huge loss on paper from the stock, but I’ll just keep selling covered strangles and chip away at that basis over time", "score": 12, "replies": []}, {"body": "Used to work here, good company", "score": 11, "replies": [{"body": "Why did you leave?", "score": 4, "replies": [{"body": "Had a random job offer for a much higher level position come from an old manager who moved back into town.\n\nThey hire smart people though. Some of the most intelligent accountants I have met. Also, the deal structures are done in a hugely lucrative way with increasing payments every year typically.", "score": 2, "replies": []}]}, {"body": "can you go into more detail about why you left or the company in from the inside in general?", "score": 3, "replies": [{"body": "Honestly, there were so many smart people it felt like I was in a much more competitor place than I needed to be to move up. \n\nEveryone was pretty nice. Lots of small little parties with cocktails", "score": 3, "replies": [{"body": "Thanks for sharing", "score": 1, "replies": []}]}]}]}, {"body": "No matter what people think of your strategy, thank you for spending the time to make a quality post. Congrats!", "score": 10, "replies": []}, {"body": "Nice! I'm thinking of doing this in a small size with $DPZ (Domino's Pizza): it got beaten down despite a GOOD earnings report because the costs of purchasing cheese etc became high and I expect them to power through that in the next quarter.", "score": 10, "replies": [{"body": "Do you own shares to $DPZ?", "score": 2, "replies": []}, {"body": "Interesting play, keep us posted", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "My pleasure", "score": 1, "replies": []}]}, {"body": "Thanks, $STOR looks interesting.  Do you have any more information on their real estate portfolio?  They give a lot of stats in their IR and 10Ks which I don't think are super helpful.  Looking for more of a breakdown by e.g. top tenants, rural/urban exposure, etc.", "score": 6, "replies": [{"body": "All assumptions: I do not have something special but they said on at least one call that they would be aggresive on jumping at COVID-19 related opportunities and I trust that they had a whole lineup of scouted businesses that agreed to give STOR a good price and STOR even with discounts on rent would probably make a solid yield and decent price appreciation.", "score": 1, "replies": []}]}, {"body": "I’m glad to see someone else out there believes STOR will go up. It’s warren buffet approved, and it’s in a golden cross. Just don’t let the idiots at r/wallstreetbets in on it lmao. They ruin everything they touch.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Over what period are those numbers though? Isn’t the bear case on REITs that we’re looking at an extremely weak CRE environment for another 12 months?\n\nAnd admittedly I only just glanced at STOR’s profile, I have not dug into their holdings in any depth, but I see restaurants, health clubs, movie theaters, etc that all have a lot of COVID exposure.\n\nIs this just a vaccine/stimulus play?", "score": 1, "replies": [{"body": "https://drive.google.com/file/d/1I4NffqZbg35vBs4SxJqCPDgXplrVGp7u/view?usp=drivesdk\n\nTLDR: While many business are struggling, they still are continuing to pay the rent. Additionally most of store tenants are in industries that cannot be shifted online ie car dealerships, furniture stores, etc", "score": 6, "replies": [{"body": "VRM & CVNA beg to differ.\n\nBut yeah. The premise is solid. People are still going to go out and physically touch and buy stuff. You just have to be careful and research the underlying.\n\nI have been making good money on SPG. Their corporate leadership is active in this bad environment so I see them coming out of this in a good position to take advantage of the changing world.\n\nSTOR is on my watch list but haven't gotten involved yet.", "score": 2, "replies": []}, {"body": "Thanks, I’ll take a look", "score": 1, "replies": []}]}, {"body": "Buffet backed up the truck for this one. It’s got his blessing", "score": 3, "replies": []}, {"body": "I don't really care about the vaccine, STOR's investment thesis is to find very profitable businesses with healthy margins that own the building and unlock their capital stuck in that building.", "score": 3, "replies": []}]}, {"body": "Think they will hit $31-32 after earnings?", "score": 1, "replies": [{"body": "I'm guessing it's going to continue channeling up and that earnings are not going to cause any significant change.", "score": 2, "replies": []}]}]}, {"body": "What was your ROI for these? The capital requirement would be high as well did you out preform just buying the dip? STOR is up 30% in last 3 months.", "score": 4, "replies": [{"body": "I could have bought more stock but on margin, instead of going red on cash I didn't have I sold those puts, anyway you would look at it I would be using almost the same amount of buying power. \n\nI hate hitting the minus area and using margin, even with great interest rates (always negotiate) it is better sometimes to just learn to work with what you have. If I have to eventually get assigned way down the line and then have the margin kick-in so be it, at least you earn almost a year of not paying debt interest.", "score": 2, "replies": [{"body": "Oh so Are you selling them naked?", "score": 1, "replies": [{"body": "Some cash secured, some naked.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "These are put contracts, I did not reach 11K shares, yet...", "score": 1, "replies": [{"body": "Doesn’t matter, the selling that many puts at one time is equivalent to that many shares whether CC or just short puts. I’m guessing you used a crap ton of margin to do that. You got very fortunate but it’s a terrible way to recoup losses. Doesn’t matter how much research you do, risk is risk and if you’ve traded long enough you know anything can happen when it comes to the markets.\n\nGot lucky this time, be very grateful", "score": 1, "replies": [{"body": "I used a crap ton of buying power (which is margin power in a sense), didn't use margin debt.", "score": 1, "replies": [{"body": "Of course you’re selling for a credit so you won’t incur margin debt shorting puts, but you could’ve been wiped out easily unless you have enough cash to take assignment on all those puts at once. And even if you did, that’s hundreds of thousands of dollars worth of one stock in a sector that is distressed. I just hope no one reads this post and thinks this is a good way to recoup losses. \n\nGlad you survived this, hopefully you realize how much notional risk you actually took on.", "score": 1, "replies": []}]}]}]}]}, {"body": "All that can for CSP, you could've played other tickers to reduce your exposure instead of putting all your eggs in one basket.", "score": 3, "replies": []}, {"body": "Very nice !  Is there sufficient volume that far out ?  \n\nI’m not familiar with the app you’re using. What is the red number under the option info (like -3, -25 etc)", "score": 3, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Nice, I sold only two O contracts and WPC - didn't know them as well as STOR so couldn't go big. What is special about O, how did they get such a multiple?", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I had penciled in FRT as the REIT I was going to get in. Though I don't recall why I liked it better than O", "score": 1, "replies": []}]}]}]}, {"body": "This is how you risk more to make less", "score": 5, "replies": [{"body": "Please explain how to risk less and make more.  Don't use them fancy words you learned during your finance MBA studies.", "score": 4, "replies": [{"body": "You dedicate more capital to a losing position by being more and more long. Basically, you end up having a higher percentage of your portfolio concentrated in this one name.\n\nSometimes, doubling down makes sense. When it's a great company or fund and the market takes a dive, sometimes it's great and on sale. But sometimes, things go down and instead of cutting your losses you end up stuck in the name for potentially years waiting for a turnaround.\n\nIn this case, the market rebounded quickly, more quickly than it typically does. So this strategy worked. But it doesn't always. And even if the overall market is rebounding, your individual stock might not. For example - if you've been doing this for the past three years with $GE, you're not very happy.", "score": 0, "replies": [{"body": "It's all psychological, I don't mind being focused on one name if it's a good name, I spent 40 hours researching the company before going all-in like this, there was a lot of reading, audio, and video homework involved.", "score": 4, "replies": []}, {"body": "I get that you think op made a bad bet, you already said that.  In your mind, how do you risk less and make more?", "score": 1, "replies": [{"body": "I didn't say I thought it was a bad bet.\n\nI'm just saying adding risk to a losing position soesn't necessarily mean you will make more money.\n\nThere is an aphorism I don't necessarily agree with but that's commonly heard in some investing circles - \"losers average losers.\"", "score": 1, "replies": []}]}]}]}, {"body": "I don't mind putting 50% of my portfolio in one name if it's a good name, you can diversify all you want, all it does is help you \"not lose much\" - this specific stock bounced 100% from its 52-week low because of solid fundamentals.", "score": 3, "replies": [{"body": "How about diversity in time frames for you then?\n\nMy point was more regarding the asymmetric nature of options.  Obviously you believe in this name, but your bet is structured for the price to not decline over the next 3-6 months. You have all of the downside risk but participate in only a tiny fraction of the upside. Why is this better than owning the shares and dividends?", "score": 3, "replies": [{"body": "Didn't want to owe margin debt, yet wanted that high delta.", "score": 1, "replies": []}]}]}]}, {"body": "Good story and shows what being patient can do!\n\nBut, what if they went BK?  I know, not likely to occur, but stranger things have happened.  Look up a company called Enron . . .\n\nYou should find 15 to 20 stocks like this and spread out your risk . . .", "score": 2, "replies": [{"body": "If you do good research on the management team you should be able to sleep well at night. The management of $STOR was vetted by Buffet and Howard Marks.", "score": 3, "replies": []}]}, {"body": "Wait you sold $30 $35 $40 puts for 01/2023\n\nIm confused with why they wouldnt be assigned early? \n\nThanks for you contribution and any other info!", "score": 3, "replies": [{"body": "i’m assuming he still makes a profit if those shares get called away at which point he just buys more", "score": 4, "replies": [{"body": "With puts the shares would assigned, not called away... is he talking about calls that far out? \n\nIm confused lol thanks tho!", "score": 1, "replies": [{"body": "Didn't buy calls, sold puts far out. The $40 was giving out $16.50 of premium, which is a $23.50 break-even point, I don't see STOR hitting under $23 again unless there is a 2nd, 3rd, and 4th nationwide wave of COVID-19.", "score": 4, "replies": [{"body": "Ah, I was completely forgetting about a very large premium. \n\nHow long do you intend to hold those open if things stay generally in your favor?", "score": 2, "replies": [{"body": "Can't be greedy, if you can collect 50-60% of original premium - close.", "score": 1, "replies": [{"body": "I like it, thanks for the insight!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Imagine there is a second, third, fourth wave of COVID-19, that can cause the put contracts to get assigned earlier (assuming these wave will affect STOR in a negative way in the short-medium term).", "score": 3, "replies": []}]}]}
{"title": "y'all called me retarded for buying amd puts, up 30k in one day babyy!", "selftext": "su bae i love you!\n\n9 oct 86.5 puts\n\nlike i said in my previous post,( which mods removed)  i had wet dreams with su bae and green dildo, and i decided to short my dreams cause  you know its my fucking dreams none of my shitty dreams come true ever, put 20k on trade, paid off bigg timee, all hail WSB\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/1j2k0a0wq7s51.jpg?width=142&format=pjpg&auto=webp&s=e04e4eb752b30b2a2ff9e15a635cf5f9a50f0314", "id": "j8fsgl", "created_utc": 1602312073.0, "score": 346, "upvote_ratio": 0.93, "num_comments": 57, "comments": [{"body": "Make sure to not cash out before you lose it all", "score": 363, "replies": [{"body": "will do brother! 🙏", "score": 100, "replies": [{"body": "He said “lose it all, don’t cash out”", "score": 38, "replies": [{"body": "u/ilovemycake knew what he said but still agrees", "score": 26, "replies": []}, {"body": "cheers geoff", "score": 3, "replies": []}, {"body": "*lose* it all you illiterate fuck.", "score": 3, "replies": [{"body": "thanks retard", "score": 2, "replies": []}]}]}]}, {"body": "And be sure to mail Sue Bae a green dildo", "score": 7, "replies": []}]}, {"body": "Why was your previous post removed? If you said something shitty, I understand, but if it was removed because people didn't like your position, then I'm thinking that here we are all fucking sheep trying to confirm our biases.", "score": 62, "replies": [{"body": "[deleted]", "score": 89, "replies": [{"body": "My CMCL post was deleted. Went from $12 to $27 in 4 weeks.", "score": 12, "replies": []}]}, {"body": "i donno man, they didn't give me any reason at all\n\nthis literally was what i wrote\n\n`20k on AMD puts!` \n\n`last night had a wet dream with su bae and green dildo, and i thought to myself, fuck none of my dreams come true,`\n\n`i'm shorting my dreams and hopes and life, lets fucking see yo`", "score": 28, "replies": []}]}, {"body": "Bet you dont roll that profit into more puts...pussy", "score": 106, "replies": [{"body": "He Ain't got the balls", "score": 1, "replies": [{"body": "watch me", "score": 1, "replies": []}]}]}, {"body": "This is going to make me short AAPL this week, always inverse wsb!", "score": 18, "replies": [{"body": "Close Aapl calls Monday AM, after gap up", "score": 9, "replies": [{"body": "Phone is delayed 4 more months, gap down if anything", "score": 2, "replies": [{"body": "Seriously. *cries into my broken iphone*", "score": 5, "replies": []}, {"body": "Said who?", "score": 2, "replies": []}]}, {"body": "This is my plan, finally close these 120 calls that ive had to hold too long", "score": 1, "replies": []}]}, {"body": "AAPL is a different game man. AMD only tanked cause of news of merger with Xilinx came out around the same time. I won't yolo AAPL, my 2 cents.", "score": 2, "replies": [{"body": "AMD was going <84 no matter what. The event was finished and the selling off commenced.", "score": 2, "replies": []}]}, {"body": "Ehhh, maybe not close yet, new phone gets probs released Tuesday. After that you can close but then they have earnings. Take care", "score": 1, "replies": []}]}, {"body": "Double down", "score": 12, "replies": []}, {"body": "you’re still 🌈 tho. And fuck you", "score": 15, "replies": []}, {"body": "Push penny stock for BBC gains. No balls", "score": 5, "replies": []}, {"body": "Congrats and fuck you", "score": 3, "replies": []}, {"body": "That image looks like it's from the 90's.", "score": 4, "replies": []}, {"body": "Good play. I did my Fibonacci thing and this could go as low as $60 by October end", "score": 4, "replies": [{"body": "oh no way! my horoscope said the same shit!", "score": 6, "replies": []}]}, {"body": ">not even full screenshot          \n            \nshopped~", "score": 5, "replies": []}, {"body": "Investing your dreams always best play", "score": 2, "replies": []}, {"body": "So amd calls now?", "score": 3, "replies": [{"body": "yes", "score": 2, "replies": []}, {"body": "Yes, buy 10/30 calls or later (ideally spreads cuz fuck theta gang). They report earnings on 10/27 and announce  their new GPUs on 10/28.", "score": 1, "replies": []}]}, {"body": "I’m in uk how which platform for options please?", "score": 1, "replies": [{"body": "Tastyworks is the one bro", "score": 2, "replies": []}]}, {"body": "Why is amd down like that I don’t get it", "score": 1, "replies": [{"body": "Rumors that they'll be doing a $30b acquisition. Companies that are buying others always take a slight hit based on the cash outflows, or stock dilution in a non-cash deal.", "score": 2, "replies": []}]}, {"body": "Use margin now", "score": 1, "replies": []}, {"body": "Its timing a falling knife. Is AMD worth 100BN today? No. Will they be within the next 10 years? Yes.", "score": 1, "replies": []}, {"body": "You need to have a dream about yolo’ing it all into 7 figures. So that means you’ll take profits because you know your dreams won’t come true.", "score": 1, "replies": []}, {"body": "Not Robinhood, can't read. JK, nice gains and fuck you!", "score": 1, "replies": []}, {"body": "Completely forgetting about E3 and buying AMD puts the year the new consoles will be announced. I was almost back to where I started and now I’m down 70%.\n*****\n\n\n*[wut?](https://www.reddit.com/r/WutbotPosts/)* | *[source](https://reddit.com/r/wallstreetbets/comments/byl13c/what_was_your_stupidest_play_ever/eqjo2cv/)*", "score": 1, "replies": []}, {"body": "Yolo it hold till Monday", "score": 1, "replies": []}, {"body": "Bro this is #FOMO not a YOLO", "score": 1, "replies": []}, {"body": "ha! gaaaaaaaaaayyyy", "score": 1, "replies": []}, {"body": "can i buy puts on this guy, he’ll probably iron hand this and his puts will expire worthless. This is the way. cash out broskie.", "score": 1, "replies": []}, {"body": "Bro you got so lucky that the rumor was they were gonna spend billions on an acquisition which is why they went down\n\nYou literally struck lightning lol cash out and gtfo", "score": 1, "replies": []}, {"body": "Now try trading outside of a paper account.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -73, "replies": [{"body": "All those above-average posts and this fuck munch of a comment? Ban.", "score": 28, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Yikes.", "score": 5, "replies": []}]}]}, {"body": "Whats up with the political shit new fren", "score": 5, "replies": []}, {"body": "Fuck your BLM", "score": 5, "replies": []}]}]}
{"title": "AMD DD Response Post | Gay Bears DOA Next Week | Don't Even Bother Showing Up", "selftext": "[deleted]", "id": "j8hfsk", "created_utc": 1602321183.0, "score": 88, "upvote_ratio": 0.8, "num_comments": 51, "comments": [{"body": "A lot of words check, a lot of pictures check... well ya got me I’m all in!", "score": 64, "replies": [{"body": "Tip the bitch then. 🦴", "score": 11, "replies": []}, {"body": "I didn't even read any of it but it made me bullish and wet. Thank you sir.", "score": 1, "replies": []}]}, {"body": "If you want some more confidence (bias) in your amd calls come join /r/amd_stock", "score": 19, "replies": [{"body": "Done.", "score": 8, "replies": []}]}, {"body": "Bought the dip yesterday. Happy now? 🤣🤣🤣", "score": 30, "replies": [{"body": "Yes. Let’s make money.", "score": 17, "replies": []}]}, {"body": "I am bagholding and want it to moon but this post makes me worry its going to tank now", "score": 37, "replies": [{"body": "Then cut your loses.", "score": 12, "replies": []}]}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 7, "replies": []}, {"body": "Did you forget to take your lithium?", "score": 5, "replies": [{"body": "Nope.", "score": 1, "replies": []}]}, {"body": "Lets all take a moment to appreciate that your predicted stock movement for NVIDIA has an arrow going backwards. There really is something special about the kids doing TA.", "score": 5, "replies": [{"body": "Trying to illustrate that it missed it's major pivot point. i.e - it's going to keep on going down.", "score": 0, "replies": []}]}, {"body": "Those look more like head and shoulders to me than cup and handle. Huge run up over a few weeks to test the previous gap ups and now the inevitable price drops. Good luck.", "score": 6, "replies": [{"body": "I'm bearish for november because the market is probably going to crash on Nov. 27", "score": 3, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Isn't that what this sub is all about?", "score": 5, "replies": []}]}, {"body": "wait for SPY to hit ATH and keep a watch for a crash.", "score": 3, "replies": []}, {"body": "Yeah I am thinking the same thing but I do not have the vision to determine the date. Why Nov 27th?", "score": 0, "replies": [{"body": "That my next endeavor after I’m completely through amd TA. I will post once I write it.", "score": 1, "replies": [{"body": "Thanks, looking forward to it.", "score": 1, "replies": []}]}]}]}]}, {"body": "Bought the dips almost at the bottom yesterday, can confirm it will crash even more next week.", "score": 6, "replies": []}, {"body": "Will consider reentering if it retests 78.99\nGood luck autist", "score": 3, "replies": []}, {"body": "Big volume on words. Pictures making me feel bullish. Does this mean my 88c 10/16 might break even!", "score": 3, "replies": []}, {"body": "My guy, I like this post cuz it confirms my bullish bias! Word of advice though (and this is something that got told to me by a former GS trader) technicals will kill you in the long term if you let them. \n\nThey have value, but are very subjective and vulnerable to biases. Combo them with fundamentals and remember that markets move on cold hard data,  or your scribbles. \n\nBag holding EOM 85C and some dated EOY. BOL let’s get this monkey bread.", "score": 3, "replies": []}, {"body": "brb grabbing wallet because of all the words and pictures, I literally didn’t ready shit but you son of a bitch, I’m in!\n\nReeeeeee", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[https://www.nasdaq.com/market-activity/stocks/amd/earnings#:\\~:text=Earnings%20announcement\\*%20for%20AMD%3A%20Nov%2003%2C%202020&text=The%20upcoming%20earnings%20date%20is,announces%20the%20actual%20earnings%20date](https://www.nasdaq.com/market-activity/stocks/amd/earnings#:~:text=Earnings%20announcement*%20for%20AMD%3A%20Nov%2003%2C%202020&text=The%20upcoming%20earnings%20date%20is,announces%20the%20actual%20earnings%20date).", "score": 0, "replies": []}]}, {"body": "Two words, falling window. Wait for confirmation.", "score": 2, "replies": [{"body": "please clarify what you mean by falling window?", "score": 3, "replies": []}]}, {"body": "bruh", "score": 2, "replies": []}, {"body": "i saw elon at the top, youve convinced me \n\nWERE GONNA MISS THE MOON AND HEAD STRAIGHT TO MARS", "score": 2, "replies": []}, {"body": "Hey fucker, you changed your Tradingview view from the pretty blue background to that fugly black. Change it back!", "score": 2, "replies": [{"body": "Sorry. Dark mode is easy on the eyes after watching AMD the last 2 trading days.", "score": 7, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/jjd1226 don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I sure hope so, already holding 10/30 90C", "score": 1, "replies": [{"body": "Same", "score": 1, "replies": []}]}, {"body": "Going all in with whatever is left in my account.", "score": 1, "replies": [{"body": "Please don’t do that. Wait for confirmation and hedge.", "score": 2, "replies": []}]}, {"body": "Damn dude just chill.Your life doesn't depend on AMD. Try to jerk off to Gabbie Carter videos.Always relaxes me.", "score": 1, "replies": [{"body": "LMAO", "score": 1, "replies": []}]}, {"body": "Since the buying of Xilinx is currently rumors and no agreement has yet been made do you think we’ll see another drop if a deal becomes finalized or is it already priced in with Friday’s drop?", "score": 1, "replies": []}, {"body": "If my 90c print I'll tip you nicely", "score": 1, "replies": []}, {"body": "Man you must haveve spent some time writing this all up so i feel bad no reading anything past AMD.\n\nDont worry though, I sold a bunch of AMD credit put spreads for oct 30th near the lows yesterday. 80/70 strikes, Hope it stays up so i can watch the buyer of my puts slowly get drilled every single day.", "score": 1, "replies": []}, {"body": "> **LET ME MAKE IT SIMPLE FOR YOU TARDS.** \n\nThen proceeds to write a 5 page essay...", "score": 1, "replies": []}, {"body": "I am down 30% on my November calls, imma ride this bitch out like I always do.", "score": 1, "replies": []}, {"body": "How do you feel about 10/30 90-95c and selling em about 10/25", "score": 1, "replies": []}, {"body": "I have Yolo’d exceptionally hard.", "score": 1, "replies": []}, {"body": "Too much swearing and use of \"gay\" you have some serious issues mate.\n\nGrow up and maybe people will actually read something you post. Sigh!", "score": -6, "replies": [{"body": "Bad choice of judgment. I was trying to be funny. I don't normally talk like that. I got angry at past comments from my other TA on AMD. I'm writing the paper this week and will post a PDF link to group if I'm not banned. Please delete post.", "score": 8, "replies": []}]}, {"body": "Positions?", "score": 0, "replies": []}, {"body": "So if you were looking at making a play wednesday (dumping my position on TSM before Thursday morning earnings) how far out would your strike be? 11/20?", "score": -1, "replies": []}]}
