{"title": "Elon Musk’s brother Kimbal dumps $17 million worth of Tesla shares on the market", "selftext": "", "id": "12dvhk7", "created_utc": 1680810120.0, "score": 229, "upvote_ratio": 0.91, "num_comments": 73, "comments": [{"body": "I like companies where insiders buy", "score": 103, "replies": [{"body": "There really only seems to be one company w insiders buying 🧑‍🚀", "score": 18, "replies": [{"body": "I like that company and the stock.", "score": 11, "replies": []}, {"body": "That would be SCHW", "score": 0, "replies": []}, {"body": "But this stock is having a hard time going up right now.", "score": 1, "replies": []}]}, {"body": "I like that stock", "score": 6, "replies": [{"body": "SCHW may rise in the short term. But probably not by much", "score": 0, "replies": [{"body": "I don't mean that stock.", "score": 0, "replies": [{"body": "I thought you meant stocks", "score": 1, "replies": [{"body": "Na, I mean GME", "score": 1, "replies": []}]}]}]}]}, {"body": "Carvana has insiders buying since 30$ the last time I checked. Hope that helps you out.", "score": 1, "replies": [{"body": "If carvana isn't bankrupt by 2025 I'll be amazed. I never understood that one.", "score": 1, "replies": []}]}]}, {"body": "Big deal, a drop in the bucket for a megacap.", "score": 81, "replies": [{"body": "It's not the size of the sell here that matters, it's the fact he might have more info on the company than your average outsider and decided to sell.", "score": 63, "replies": [{"body": "He had to report it 4 months ago", "score": 27, "replies": [{"body": "Still relevant as he likely has much better idea of how good is the business than your average shareholder.\n\nNot saying this necessarily means anything but insiders selling is not insignificant info.", "score": 12, "replies": [{"body": "The mofo prob did it to fund his new restaurant in texas", "score": 6, "replies": [{"body": "Still, you wouldn’t  sell if you though it would go up", "score": 3, "replies": [{"body": "He sold ~7% of his stake. I’m sure he’s confident his other $110 million in shares will go up. (not to mention he was just awarded the shares he sold as stock compensation)", "score": 3, "replies": []}]}]}, {"body": "Or he needed money for something. People are people.", "score": 4, "replies": [{"body": "Yes. Probably needs money to do what he has to do", "score": 1, "replies": []}]}, {"body": "It's only relevant knowing the proportion of their holdings they have sold. If that were half of his Tesla shares, very significant. But if it were say less than 5%? Not as much. Especially if he has other ventures that he's actively funding.", "score": 2, "replies": []}]}, {"body": "Wait he dumped before the ralley a month ago? Hmmmmm….", "score": 1, "replies": []}]}, {"body": "Tsla was not greatly affected when Cathie Wood sold a part of it.", "score": 1, "replies": []}]}, {"body": "I agree with you. It didn't make much of a difference when Wood sold.", "score": 1, "replies": []}]}, {"body": "Elon Musk has a brother named Kimbal?  This made me laugh harder than anything I've seen on Reddit in months.", "score": 39, "replies": [{"body": "He’s the inverse of Kimbo Slice", "score": 11, "replies": []}, {"body": "It would be better if it was Kerbal", "score": 8, "replies": []}, {"body": "Better than his nephew, “X AE A-XII”", "score": 3, "replies": []}, {"body": "Known by the name Cowboy Musk", "score": 5, "replies": []}, {"body": "Google kimbal musk. You will be surprised.", "score": 2, "replies": []}, {"body": "You must be so fat and pasty if you laughed at that", "score": -30, "replies": [{"body": "Like Elon?   No bro.  I’m not.   But thanks for another laugh.", "score": 14, "replies": []}, {"body": "Huh?", "score": 2, "replies": []}, {"body": "Elon?", "score": 0, "replies": []}]}, {"body": "Looks like him too. Always wearing a cowboy hat.", "score": 1, "replies": []}]}, {"body": "I would also buy my brother's successful company", "score": 5, "replies": [{"body": "What is your brother's company?", "score": 2, "replies": [{"body": "Onlyfans", "score": 1, "replies": [{"body": "ok i see", "score": 1, "replies": []}]}]}]}, {"body": "Big deal", "score": 12, "replies": []}, {"body": "First off…. Be very wary about basing your investment decisions on stories in Yahoo! Finance.   Other sources to steer clear of include Seeking Alpha and Business Insider (among several).\n\nKMusk has no control over the current timing of these sales.   He was granted options and, back in December he put a 10b5-1 plan in place to exercise and monetize those options over time.\n\nIf you don’t know what 10b5 is, Google it.  The rule was just expanded (requiring more information from sellers and increasing the conditions that must be met in order to qualify) by the SEC Chairman, Gary Gensler in December 2022.\n\nHad this not been a 10b5-1 sale he would not have been allowed to sell the exercised shares so close to earnings. \n\nNot only does the timing mean nothing, it’s existence would have been disclosed in Tesla’s last quarterly report, so this shouldn’t be news at all to anyone who is particularly worried about this sort of thing.\n\nYahoo! Click bait\n\n\nI have never owned or shorted any shares if Tesla.  I own PSNY and Lucid convertible bonds.", "score": 11, "replies": [{"body": "So sad how many people have absolutely no clue, thanx for posting truth! 🙏", "score": 2, "replies": []}, {"body": "Thank you for posting with actual information here.", "score": 0, "replies": []}, {"body": "Be wary of factual news? What are you the financial version of alex jones? Take your conspiracies back to wsb", "score": -1, "replies": [{"body": "we are thinking the same", "score": 1, "replies": []}]}]}, {"body": "This is literally short sellers knowing who they are waging war against, any negative news on any stock Elon is related to is going to get publicized. It’s not Elon selling shares.", "score": 9, "replies": [{"body": "The market has already reacted by the time the real announcement is made", "score": 1, "replies": []}]}, {"body": "Jimble Kimble", "score": 2, "replies": []}, {"body": "So the news Monday is going to be all about insider trading?", "score": 4, "replies": [{"body": "no", "score": 1, "replies": []}]}, {"body": "This guy's not trying as hard as Elon to look human.", "score": 4, "replies": [{"body": "No one can say for sure, all we see is their surface", "score": 1, "replies": []}]}, {"body": "Writing is on the wall for Tesla, they won’t sell as many cars as they said this year and the profit margin per vehicle is going down. They will still sell more vehicles but they said they’ll sell 50% more and they won’t this year. They also were making 10k+/car, I won’t be surprised if that gets cut in half", "score": 1, "replies": []}, {"body": "Now I see why Chat is so bad. It relies on Reddit as it key source of info.", "score": 0, "replies": []}, {"body": "MFer’s name is KIMBAL MUSK\n\nWow.", "score": 0, "replies": []}, {"body": "But how did he get 17 mil in Tesla to just dump?", "score": -5, "replies": [{"body": "Pretty sure he is on the board", "score": 3, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "It’s impressive how it’s been so engrained that Tesla was founded by Musk. He was an early capital venture investor, neither of the two founders are Musk.\n\nMartin Eberhard and Marc Tarpenning founded Tesla.", "score": 12, "replies": [{"body": "Doesn’t matter . Someone who drags the company through shitty times and brings it where it is, in my book he is the founder. I don’t want to be “technically “ correct for the sake of arguments.\n\nEdit : it’s a pity to see downvotes , just shows how out of touch people are from reality. The same one who will mock at a person for having an “idea” saying ideas are dime a dozen. \n\nAnyway. Their poverty is none of my concern.", "score": -9, "replies": []}]}]}, {"body": "Stock options", "score": 2, "replies": []}]}, {"body": "RemindMe! 13 days", "score": 1, "replies": [{"body": "I will be messaging you in 13 days on [**2023-04-19 20:09:06 UTC**](http://www.wolframalpha.com/input/?i=2023-04-19%2020:09:06%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/12dvhk7/elon_musks_brother_kimbal_dumps_17_million_worth/jf89vtt/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2F12dvhk7%2Felon_musks_brother_kimbal_dumps_17_million_worth%2Fjf89vtt%2F%5D%0A%0ARemindMe%21%202023-04-19%2020%3A09%3A06%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2012dvhk7)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 3, "replies": []}]}, {"body": "I’m sure his brother asked Elon to change the twitter logo sos he could dump some more doge on the suckers", "score": 1, "replies": []}, {"body": "Gigiddy", "score": 1, "replies": []}, {"body": "Gotta pay for his shitty restaurant losses somehow.", "score": 1, "replies": [{"body": "It might come anytime", "score": 1, "replies": []}]}, {"body": "Holds 1.6 million shares. WTF? I'm gonna go have some Avacado toast. Gotta live it up ya know", "score": 1, "replies": [{"body": "It's normal for investors like them", "score": 2, "replies": []}]}, {"body": "Lego", "score": 1, "replies": []}, {"body": "Sounds like he needed a little spending money.", "score": 1, "replies": []}]}
{"title": "Tesla Mast Plan part 3", "selftext": "", "id": "12d2um3", "created_utc": 1680739787.0, "score": 212, "upvote_ratio": 0.96, "num_comments": 75, "comments": [{"body": "This is Tesla reminding us to ignore the short term stock price action. Their ambitions are HUGE HUGE HUGE. Even if they only achieve 10% of their stated Master Plan 3 goals they will be the largest company in the world.\n\nNeedless to say, I'm not selling any shares.", "score": 67, "replies": [{"body": ">Tesla reminding us to ignore the short term stock price action\n\nThis is why I hate the term \"ath\". You'd have to zoom in  big time on the stock chart to even see where the ath price from 5 years ago was. And the same will be true for today's \"ath\" 5 years from now. \n\nMillennials like to bemoan about how they missed out on being able to buy housing at dirt cheap price back in the 1970s and 80s. Except they come of age just in time to invest in this one asset that is literally the greatest wealth creation event in human history, one that also puts humanity on the path to a truly sustainable economy, on earth and other planets alike!", "score": 31, "replies": [{"body": "I mean, I’d rather not have to choose between living a shit appartment and the ability to invest. \n\nMy future self will probably thank me, but for now all around me are older people living in houses paying a mortgage that’s sometimes lower than my rent… whilst my income is significantly higher. As in: they couldn’t afford their house now\n\nBut at some point I’ll probably get to choose between selling my shares and buying a nice house, or to continue living in my appartment.", "score": 6, "replies": [{"body": "You can thank inflation for that.", "score": 1, "replies": [{"body": "My point is, millennials aren’t moaning about missing out on wealth creation\n\nPlenty of opportunities to create wealth. It just sucks we have to wait till it’s built up to finally have built up enough to live in a decent place. That didn’t use to be the case to this extreme extend", "score": 2, "replies": [{"body": "I’m a millennial and I own multiple homes around one of the more expensive housing markets in the nation.  I can’t think of a friend I grew up with who doesn’t own a home, although I’m sure there are some.\n\nPoint being, it is very, very possible to own a home as a millennial.  You just need to be smart about how you spend money and maybe make some sacrifices in certain areas.", "score": -6, "replies": [{"body": ">  I can’t think of a friend I grew up with who doesn’t own a home, although I’m sure there are some.\n\nSounds like you live in a huge bubble then where you come from money.", "score": 2, "replies": [{"body": "Not remotely.  Grew up on food stamps and had friends that were poorer than me.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "People like easy ways to make money that are obvious, low effort, zero risk, and extremely quick.\n\nWhen people want all these conditions to be true to invest, the only thing that fulfills all on the surface is a scam. Otherwise, they use their fear/greed/laziness to justify spending all their money on useless stuff like overpriced coffee, cars they can't afford, trips to Europe, etc. since they put a huge discount on future cash flow. The YOLO people want to spend every single penny today and be basically destitute or barely surviving at age 55.\n\nBut it's not just a millennial thing. I see with with every generation. Millennials are just the poster children for everything wrong with society since \"Gen Z\" or \"Zoomers\" is not catchy enough. Basically 90% of the population is short sighted and greedy. And those are the people complain that there needs to be more socialism or that companies should give them more perks or days off or more pay for less work.\n\nPeople who don't value hard work, thrift, smart planning, and merit do not believe in companies that exhibit those values either (surprise, surprise!). That's basically what this comes down to.", "score": 4, "replies": [{"body": ">People who don't value hard work, thrift, smart planning, and merit do not believe in companies that exhibit those values either\n\n\n\nThat goes a long way to explain redditors hate boner for Tesla", "score": 5, "replies": [{"body": "People who don't believe in merit or agency being factors hate others doing well due to those reasons because it invalidates their whole world view about why they are poor or unsuccessful.", "score": 4, "replies": []}]}]}]}, {"body": "Sigh, gotta buy more now.", "score": 7, "replies": []}, {"body": "Plus the even bigger potential of Tesla bots.", "score": 1, "replies": []}]}, {"body": "Old engineer and even older environmentalist here.\n\nThis is a real masterplan, a strategic vision accounting for what is needed for the planet. This is also a political manifest, one that the green movement tried in the '70 and '80 and was outmaneuvered by the \"combined forces\" of society ( I am trying to be nice).\n\nThis plans drives to the hearth everything, any political agenda, from economic development to social healing, national interests and global policies.\n\npeople will attack this viciously from both sides. the left rhetoric will focus on \"more compelling \"social needs\" than a multimillionaire dream, just like the impacts of the current state of human use of natural resources does not impact mostly the poor.  The right will pick up the fight against directed centralized economy, fear of state intervention and regulation.\n\nTruth is that both are paid by the same people, same interest in the next quarter company report, or the sustainability of the family business.\n\nnothing wrong with that, I learn to accept that people have the right to their own view of the world, as much as they are different from mine.\n\nBut I am all for it, I wish I could help more than vote with my wallet and my choices.", "score": 101, "replies": [{"body": ">a multimillionaire dream\n\nYou are really selling Elon short here. If Tesla even accomplishes 10% of what the master plans set out here, that'd make  Tesla the greatest energy conglomerate humanity has ever seen, and by implication,  making Elon a multi trillionaire. \n\n\nThis is why Tesla did not hesitate to open up its charging stations to EVs made by other companies. In the grand scheme of things, Every pure EV sold on earth is a win for Tesla in its over arching mission to transition the planet away from fossil fuel. Not to mention by giving some breathing space to other companies it starves off potential anti monopoly enforcement actions.", "score": 31, "replies": [{"body": "And we know that Elon is great at turning the impossible to late.", "score": 20, "replies": []}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "I understand your position wrt Elon as a person. I have been teaching and mentoring for many years, so much to realize that brilliance come in many shapes and forms and there are plenty of historical accounts of genial people being pretty questionable human being. \n\nBack to the master plan, I would like to point out that it also, although indirectly, addresses a big concern that has been ruining previous attempts: the workforce impacts.\n\nBy quantifying the benefits and savings wrt current industry support from government, it implicitly provides a buffer in the form of budget to support workforce during the transition, redirecting the savings to directly helping the workforce and their families.\n\nThis is key for me because these are my friends and neighbors and I see their livelihood becoming endangered by this big shift. \n\nI wish politicians would rush towards it and show leadership into guiding and assuring that the nobody gets really hammered in the process. I am a dreamer. An old one", "score": 6, "replies": []}, {"body": "You need a sense of scale.  What Elon is doing for all of humanity outweighs his flaws as a single human by > 1B to 1.", "score": 2, "replies": []}]}]}, {"body": "Godspeed Tesla. I hope this plan is successful.", "score": 62, "replies": [{"body": "We all better hope it's successful. For us, for our children, for our planet, and for our wallets. And I don't mean wallets as Tesla investors, I mean wallets in terms of society as a whole, so that we don't piss away trillions on fossil fuels, mitigation/adaptation, half measures, and brain-dead \"options\" that will never be economic.", "score": 39, "replies": [{"body": "So many problems go away when you move away from fossil fuels. The highest form of technology from the Age of Fire.\n\nGeopolitically alone.\n\nIn a perfect world the cost of energy is near 0.", "score": 20, "replies": []}, {"body": "When did people have to start apologizing for wanting to make money for themselves?  Making money is usually a noble goal.  It means you supported something that people want.  I get that at the limit of relevance, people who make money are complete dickheads…but that doesn’t mean the entire concept of money or “capitalism” (whatever that means) should be brought down.  Usually transactions that involve money result in a net positive outcome.   people get fed.  People get something that makes them happy.\n\nYet we have this part of our condition that makes us feel bad about this.  Because not all of us get the same amount of stuff.  Seems like such a negative instinct.", "score": 1, "replies": [{"body": "To be clear, the plan will also be great for us as investors, and I'm happy and totally unapologetic about that. I'm just trying to point out that the plan will be overwhelmingly economically beneficial for billions of people, not just those of us who are shareholders.", "score": 4, "replies": []}]}]}]}, {"body": "My masterplan is to buy more shares and keep them really really safe", "score": 17, "replies": []}, {"body": "This is an extremely important milestone for Tesla and the world. For our sake and all of our families we better root for this plan to succeed. \n\nYes us Tesla investors want Tesla to succeed and the stock to go up but Tesla is a global company and they will have worldwide positive effects on our society and the planet at large in the long term.", "score": 45, "replies": []}, {"body": "THIS is why I initially invested in Tesla.\n\nNot for growth (I was too young to really understand the growth potential of stock, just a young guy heading into an engineering degree who saw the first OG roadster and thought that MUST be the future tech we all need for the planet to survive).\n\nSo glad, despite all the craziness with musk of late, saving the planet remains focus no1 for the company", "score": 12, "replies": []}, {"body": "An absolute smash answer to those who say 'we cant'", "score": 22, "replies": []}, {"body": "Did Tesla just reveal plans and battery size for not only a compact car, but a van AND bus!?", "score": 17, "replies": [{"body": "No. I mean you could read it as that, and they've talked about being present in every category but its just more of a vehicle class bin. The kwh and battery type etc for the known cars isnt quite accurate.", "score": 12, "replies": []}, {"body": "Makes sense. In the investor day slides there were some draped vehicles resembling these. I still don’t really get why the hype isn’t on, because any day now these will be unveiled. It was also mentioned that they expect the market cap of the small car to be 2 times that of model 3 and S combined.\nSource: https://www.youtube.com/live/Hl1zEzVUV7w?feature=share&t=1494", "score": 1, "replies": []}]}, {"body": "This is the first master plan that didn't specify what Tesla's plans were specifically imo. Unless they are hinting that they are going into every market they mention in this plan?\n\nI take it as a good thing, just an observation.", "score": 11, "replies": [{"body": "I think a lot of the early Tesla minds went and started some of these projects already with more to come.\n\nMaybe not 100% Tesla but they will all/most have roots there.", "score": 3, "replies": []}, {"body": "It outlines everything that needs to be done, and as always, Tesla will do everything everyone else does not.", "score": 1, "replies": []}]}, {"body": "I like that they come at this from a utility angle and not just, like so many others, arguing a naive \"we need to replace x PWh per year with the same amount of PWh from renewables\". Efficiency in electric systems over fossil fuel run ones makes a big difference in the final numbers.", "score": 4, "replies": []}, {"body": "Is it notable that Musk isn't listed in the contributors/advisors section?\n\nAnyway, this seems like Investor Day but in document form with greater detail. Who is the target audience? Policymakers? It's more a high-level plan for the world than anything actionable by Tesla, which is in stark contrast to prior master plans. I guess the key takeaway is \"global electrification is possible and sooner than we think\", but i'm not sure who it's convincing?\n\nAnd yes, it's impressive to anyone long. It reiterates that Tesla is playing a totally different game vs competitors: 5D chess vs checkers if you will.", "score": 5, "replies": [{"body": "> Who is the target audience?\n\nUs. Naysayers. The General Public.\n\nThis is intended to be an open document of evidence that shows the clean energy transition is not just possible, but better for everyone in almost every way. It's a call to action to the world to stop obstructing and get down to work making it happen.\n\nPoliticians and policymakers will come around to reflect the will of the people. Musk understands that that's what really needs to change. It's been the main lever driving every major shift in our society in the last century - civil rights, environmental values, gay marriage, etc.", "score": 6, "replies": []}]}, {"body": "Only skimmed through it but do I see it correctly that there is no mention of trains? Especially for cargo this should be an obvious solution. Maybe this is a US perspective but putting things on rails should have a huge impact.", "score": 2, "replies": [{"body": "I was wondering about that too.  I would have thought they'd talk about electrifying existing diesel lines. But then again, according to the IEA trains are the least emissions intensive mode of transportation, so it may just be that it's the least impact for the buck.  [https://www.iea.org/reports/rail](https://www.iea.org/reports/rail)", "score": 6, "replies": []}, {"body": "Yeah, rail is \\~7x more energy efficient than tractor trucks. \n\n[https://moveparallel.com/](https://moveparallel.com/) is a company I am keeping an eye on", "score": 3, "replies": []}]}, {"body": "One of the drawbacks of the whole plan is the transmission line problem, can that be partially solved with boring company tunnels? seems like it would require less permitting and they already said they could be used for utilities", "score": 2, "replies": [{"body": "Probably not. The Boring company is trying to get sub $4 million per mile (which is still an >90% improvement on current costs). But Aerial HV transmission is less than $2 million per mile today. That's why it's almost never underground. The Master Plan outlines how there is actually less all-new transmission needed than most people expect; a lot of the work is reconductoring existing lines (including a lot of distribution!). \n\nBut still, accelerating permits for the transmission projects that are needed is something Western Governments really need to work on. We can't have every one of these projects mired in years of delays.", "score": 3, "replies": [{"body": "My understanding is that the permitting issue is the main issue not the cost, no one wants transmission lines in their back yard but most would nor care if it was more than 30 feet below your property", "score": 1, "replies": [{"body": "Both are issues. I don't know if getting UG down to 2x cost (from 10x today) would be good enough to make it worthwhile to ease permitting. \n\nAnd I have seen NIMBYs make some crazy arguments. Where I live a Utility offered to build a free school if they could put an underground substation below the sports field (like under 10+ feet of earth and reinforced concrete). The uproar from people worried their kids would get cancer killed it almost instantly.  People don't understand how electromagnetism works.", "score": 1, "replies": []}]}]}, {"body": "Can you elaborate? I thought it just required updating equipments, which utilities companies are being dragged kicking and crying into?", "score": 2, "replies": [{"body": "My understanding is that brand new transmission line infrastructure would need to be built to support all the new solar, wind, and battery tech. The current grid is more centralized because of fossil fuel plants than a solar wind and battery make up would be.", "score": 1, "replies": []}]}, {"body": "No--the cost is just beyond prohibitive and at the voltages you would require would be extremely unsafe and you couldn't use the tunnel for any other purpose--they create massive magnetic fields. It would even be challenging to ventilate the tunnel properly because of the induced voltage could wreak havoc on control systems.\n\nUltra high voltage transmission lines are the main reason I think this plan is just incomplete. The cost is high, they are unsightly and disrupt farmland/ecosystems/etc., and we'd need an absolutely enormous number of them to properly support the northern latitudes.\n\nThey will be a key part and I think we can do a lot better with maybe 2 Million VDC versus the 500 kv AC commonly used, but I think ultimately 15-20% of a local base load is needed for when there's little wind and sun for days, even if you overbuild solar/wind by a massive margin.\n\nWe already have the technology for this and it's called nuclear energy.", "score": 0, "replies": []}]}, {"body": "“Both continental and intercontinental ocean shipping can be electrified by optimizing design speed and routes to enable smaller batteries with more frequent charge stops on long routes.”\n\nI don’t think it’s feasible to power intercontinental shipping with batteries. The batteries would need to be massive - larger than the boat.\n\nHydrogen may work but right now there are now feasible ways of going about it. You would loose around 90% of energy going from solar cells -> hydrogen -> ammonia -> propulsion, which is an extreme waste of energy.\n\nThey only write one sentence about one of the biggest problems and it’s not written by someone who knows about this stuff. How are we supposed to take this plan seriously?", "score": 2, "replies": [{"body": "I think this will be one of the last items they address if I remember correctly from investor day.\n\nBig boats and big planes are the hardest?!?", "score": 7, "replies": [{"body": ">Big boats\n\nYou are gonna need a bigger battery!", "score": 3, "replies": []}]}, {"body": ">I don’t think it’s feasible to power intercontinental shipping with batteries. The batteries would need to be massive - larger than the boat.\n\nThink of recharging stations where oil platforms are now.", "score": 1, "replies": [{"body": "Charging a ship would require absolutely massive currents, larger than most land based power stations could handle. And it would still take hours. How do you think they'd get that out at sea? Intercontinental, and probably even lower distance shipping will only work with synthetic fuels or hydrogen.", "score": 2, "replies": [{"body": "> larger than most land based power stations could handle.\n\nAgree with your overall point. But our land based grids actually can handle these loads, especially with some upgrades. Norway is already running some short-range battery powered ferries for example.", "score": 1, "replies": [{"body": "A short range ferry will need approximately 1/20 to 1/50th the amount of power.", "score": 1, "replies": [{"body": "True, but also short range RoRo ferries have to charge in the time it takes to load/unload to maximize cycle time. A ocean going ship has more idle time at port, both in the loading/unloading and while just waiting for a berth. So it could charge at a similar power (rate) even if it takes much more total energy.", "score": 1, "replies": []}]}]}]}, {"body": "Sorry, this is not gonna be the solution. There aren't oil platforms way out in the middle of the pacific and atlantic, and they're not optimized to be recharging stops. Even if you were, how do you get the power at the platform? SMRs? And then every ship has to stop to recharge at these, while sitting idle and useless and adding time to the voyage. Big nope.\n\nThere will be some combination of batteries, shorter routes & slower speeds, direct wind propulsion, on-ship generation (solar), and synth e-fuels and hydrogen to go the distance. Ships will only recharge from shore power when they're at port either loading/unloading or waiting for a berth.", "score": 1, "replies": []}]}, {"body": "10% of abundant solar energy is still a lot of energy.\n\nI think hydrogen makes more sense for cargo vessels than batteries at this time, but fewer cargo ships is even better.", "score": 1, "replies": []}]}, {"body": "Absolutely outrageous that they didn't take into account investments in the electricity grid", "score": 1, "replies": [{"body": "They did? The power grid model says that they assumed increased inter-regional transmission capacities. But really only up to 3% of combined regional peak load from 1% today. So the impact isn't massive...", "score": 1, "replies": [{"body": "The problem is not with inter-regional transmission, but with getting enough cables to supply every home with enough power for their heat pumps and car chargers. Every grid operator in Europe is struggling with connecting renewables and new demand. And the US has a shit ton of blackouts. Fixing all of that requires a lot of money and a lot of copper/aluminium", "score": 1, "replies": [{"body": "> The problem is not with inter-regional transmission, but with getting enough cables to supply every home with enough power for their heat pumps and car chargers.\n\nMore capacity for EV chargers is a totally wrong-headed approach - this load is better handled by time-of-use pricing and smart chargers. Heat pumps are a little more challenging and will require distribution investments for sure, but even there - ToU and smart thermostats can make a huge dent in the investment needed, especially if paired with rooftop solar. \n\nInter-regional transmission can actually help a tonne - both with wind power interrmittency and the duck curve.", "score": 0, "replies": []}]}]}]}, {"body": "This is really interesting but the solar and wind figures I don't think adequately account for emergency scenarios.\n\nWe need to have to have society functioning if we get 2 or 3 cloudy days in a row for the more northern latitudes. There's not even close to enough battery storage to account for that in this, and the sheer scale of grid ties required to bring more consistent solar power north is not realistic.\n\nWe're going to need alternative battery technologies like molten salt which can store for 100 hour intervals to complement Li-Ion's 6, as well as reliable base load technologies that work when the clouds are out and the wind isn't blowing like Nuclear.\n\nI also don't think electrified global cargo containers are realistic in the mid-term. The cost and weight would be absurd. Hydrogen makes some sense there.", "score": -2, "replies": [{"body": "Existing long distance transmission lines can \"trickle charge\" entire regions of the country that are cloudy. Solar is dirt cheap, you simply over build solar capacity for a literal rainy day.", "score": 11, "replies": [{"body": "Extra long transmission lines are extremely expensive and environmentally disruptive and require insanely complex permitting and agreements. Also moving across counties becomes a national security risk.\n\nAnd for the capacity for the electrified future of EVs, heat pumps, and heavy industry, the sheer number of them is insane. I don't think most people want the landscape completely dotted with gargantuan transmission lines and substations.\n\nI get that we need them, they're important, but a 20% base load of nuclear eliminates a lot of them. It's probably nearly as cost effective compared to the cost of transmission and distribution and overbuilding at the level of like 10x solar/wind you need to account for the 0.001% scenario.\n\nPlus 5000 km of transmission lines is 5000 km of risk. When you need the power most, you don't want the line to be cut 4000 km away in a foreign country.", "score": -5, "replies": [{"body": "Thinking like this is what stands in the way of progress. There are already massive transmission lines that connect regions. Sure, more may have to be build. So what? If that's what it takes, then that's what we should do.\n\nAlso, nuclear in no way eliminates transmission lines? How did you come to this conclusion?", "score": 9, "replies": [{"body": "Those transmission lines are only a tiny portion of what's required. They can't even handle a significant portion of the current demand let alone when electricity demand is 4x higher, maybe 5x higher for more northern areas that need a tonne of electric heat.\n\nEverywhere that you see a transmission line for an interconnect, imagine seeing 30 of them, but taller. Every substation you see, imagine 30 of them 4x the size.\n\nAnd they's have to be built from areas that are 100% guaranteed to have sun like southern states all the way through Central and northern states, all the way through southern Canada to northern Canada to Alaska.\n\nThe sheer magnitude of environmental distruction and absolute travesty on the landscape is not worth saving building a few dozen nuclear plants to handle the base load with local renewables picking up the slack. \n\nIt's probably not even economical after you'd have to pay for 8000 km lines, the substations, eminent domain claims, the environmental review, the legal baffles with First Nations groups, the reduction in productivity from all the agricultural land they'd have to go through, recurring maintenance through forested regions.\n\nA local nuclear plant in Northern Alberta eliminates 7000 km of a massive transmission line from Nevada. It can instead be a smaller, local ~300 km connection to serve base load for the region.\n\nIt doesn't make sense to triple the amount of interconnections we'll need to go from 80% solar/wind power to 100%. We can just build a few nuclear reactors where hydro isn't available.", "score": -2, "replies": [{"body": "You seem be operating on a number of false premises. For starters, the notion of having to run transmission lines from Nevada to Norther Alberta is a red herring - no serious plan is calling for this. BTW, I know someone who has been running his entire farm in Northern BC on 100% solar since 2004.  It can be done. This is what this whole plan is about. Now that this plan is out and supported by real research, those who keep saying it can't be done should start to come up with some actual proof. Not just random declarations of pessimism.", "score": 3, "replies": [{"body": "Sure, you can run a farm with a lot of space on solar panels.\n\nYou cannot run heavy industry and electric heat pumps on solar power without far more batteries than we can conceive of building.\n\nBC will be fine despite extremely dense cloudy seasons because there is ample hydro capacity.\n\nBut Alberta has only a small hydro capacity and will have days in winter with solar and wind being < 10% max output, not to mention solar is constrained to only generate power for 8 hours of the day.\n\nHere's a report from December 2022:[https://www.aeso.ca/download/listedfiles/Wind\\_Solar\\_Forecast\\_actual\\_December-2022.pdf](https://www.aeso.ca/download/listedfiles/Wind_Solar_Forecast_actual_December-2022.pdf)\n\nThere were several days on this chart where wind and solar production, despite occupying 18% of installed capacity, were basically zero for 24-48 hour periods. This was just a regular December, but one can imagine a 1-in-10 year scenario where this period was 2x as long, and a 1-in-100 year scenario where this period was 3x as long.\n\nSure, you can bring in a 5% base load from hydro from BC, and maybe a 5% 'base load' from Nevada (although they will need grid storage for night), and you could overbuild your solar by 10x (at 10x the cost), but even so you will need \\~2 days worth of batteries at absolute minimum for other 90% of load.\n\nAnd because we're going to electric heat, it will be life safety critical that the power stays on, so in reality we will probably want to account for a larger \\~20% of the load stored for a week at a time.\n\nEven at future grid-scale costs like $50/kWh, for Alberta, lets say demand will be 45 GW average in the future fully electrified heavy industry, all heat pumps, and EVs.\n\nThat'll be 1920 GWh of energy storage needed, @ $50/kWh is $96 B every 20 years. That's $960 USD per person per year, just for *grid storage*.\n\nMy electricity bill is $30 USD/month, of which 2/3 is transmission/distribution. So about $240 USD / year in transmission costs (the province only puts in about \\~$700 M to energy, so taxes don't account for this) Storing the energy for the electrified future, in the best case scenario would alone (even if the power were free) increase my bill by **10x**.\n\nSo yes, it *can* be done. Or, we could build 10 GW of nuclear for far, far cheaper, and it'd be probably be even lower carbon after you account for construction and recycling of the solar panels and batteries.", "score": 1, "replies": []}]}]}]}, {"body": "Virtually all new lines are underground.", "score": 1, "replies": [{"body": "No, basically no high voltage transition likes are buried long distances.\n\nBurying is not remotely trivial and has massive safety concerns, plus it's way more expensive than aerial.", "score": 1, "replies": [{"body": "Idk about all that. I have a close friend that's been with PG&E for over 20 years in California and he's been saying that they simply aren't doing above ground wires anywhere anymore unless it's absolutely nessisary. Above ground is a fire hazard and requires more maintenance over time so even though it's more expensive in the short term the fact that it's more of a liability outweighs that.", "score": 1, "replies": [{"body": "I think you are talking about medium voltage (< 115 kV) lines. Those are almost always buried yes.\n\nHigh voltage (> 115 kV) lines are sometimes buried where required in cities, at great expense. \n\nUltra high voltage (> 500 kV) I'm not sure is even realistically possible to bury, and the cost would be astronomical.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Energy storage locally is even more wasteful than grid storage, which is not economical.\n\nIt works for the top 5%, maybe 10% of incomes, sure. But most people, and the government, dont have space with which to put Powerwalls, or the  $30k every 15 years to have them.\n\nWe need a solution 10x cheaper. That'll be grid storage scale batteries like Megapack or future iron-air and reducing the need for batteries with base load like nuclear.", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "That cost isn't sustainable at scale. You're being subsidized by the power you produce, which as more and more users are added, will drop closer to zero during the summer when you can produce it most.\n\nAs well, utility operators will be able to easily outcompete you as solar gets cheaper and cheaper at utility scale. Residential solar can't get much cheaper, grid ties can't get much cheaper, only the battery storage can get cheaper which utilities will be able to get cheaper than you are scale.\n\nI think in the future your power will only be worth anything in the winter at night as utilities will have ample reserves of solar energy. \n\nUltimately the full cost of the batteries will have to be paid, which at $50/kWh I worked out to be about $960 USD per person per year for a generous 20 year lifespan. \n\nThat's the utility scale cost, the local storage cost will probably be closer to $2000 USD per person per year.\n\nMy electricity bill total in Alberta is maybe $480 USDy/year and that includes a growing Carbon Tax on the LNG power. I don't think users will be keen on paying 4x more.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}]}]}]}, {"body": "NBD. Solving the energy transition for Earth, with detailed math, etc", "score": 1, "replies": []}, {"body": "Proofreading is good", "score": 1, "replies": []}]}
{"title": "BlackRock tapped by FDIC to manage Silicon Valley Bank and Signature Bank securities portfolio sale", "selftext": "FDIC chose BlackRock to handle securities portfolios worth $27 billion and $87 billion from recently failed banks Silicon Valley Bank and Signature Valley Bank.\n\nSimilar to how in 2008 the US government chose BlackRock to handle toxic assets from Bear Stearns and AIG, and in 2020 when the US government chose them to handle the corporate bond-buying programs to keep companies afloat during the pandemic.\n\n&#x200B;\n\n[https://www.reuters.com/business/finance/fdic-retains-blackrock-unit-signature-bank-svb-securities-portfolio-sale-2023-04-05/](https://www.reuters.com/business/finance/fdic-retains-blackrock-unit-signature-bank-svb-securities-portfolio-sale-2023-04-05/)\n\nhttps://preview.redd.it/sgbh66oecbsa1.png?width=780&format=png&auto=webp&s=3770e844123a0c8d11851d869f037e0757da7e6c", "id": "12dumqa", "created_utc": 1680808432.0, "score": 325, "upvote_ratio": 0.96, "num_comments": 75, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 120, "replies": [{"body": "Revenge for the France HQ lmao", "score": 28, "replies": []}, {"body": "I think this is the comment of the day I’ve seen on Reddit.  Thank you.  Seriously.  I’ve been shit posting all day long, reading others comments, and this one wins.", "score": 8, "replies": []}, {"body": "Does France exist?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 145, "replies": [{"body": "Trump made Dodd Frank not matter for regional banks.", "score": 62, "replies": [{"body": "You all have such a hard-on for mr trumpy. Do we need to teach you the Mr bill song from 3rd grade?", "score": -62, "replies": [{"body": "I literally don’t care about politics.  Trump could be my neighbor and I wouldn’t care.  I live in Florida.  With that being said he loosened Dodd Frank rules for regional sized banks.  Also my dick is only slightly hard like a 3 inch leaning tower of Pisa", "score": 53, "replies": [{"body": "I'll help. The president doesn't pass bills in America. It takes bipartisan support aka Dems", "score": -55, "replies": [{"body": "My guess is your dick is hard now", "score": 34, "replies": [{"body": "Got ‘em", "score": 11, "replies": [{"body": "Savage.", "score": 10, "replies": [{"body": "Pwned.", "score": 5, "replies": []}]}]}]}, {"body": "[deleted]", "score": 22, "replies": [{"body": "His point is he is actually the one that gets a hard on for Trump", "score": 21, "replies": []}]}, {"body": "Buck stops at your boner huh?", "score": 6, "replies": [{"body": "I take no responsibility for my boners", "score": 1, "replies": []}]}, {"body": "Yes. It's why historically parties take credit for things that didn't happen for their majority. \n\nFor example, Democrats impeached Clinton while Republicans impeached Trump. \n\nIt's also very well known that the majority of gun legislation is Democrats but for whatever reason Republicans only care about supporting things like marriage equality. That's why dems in FL just signed a bill allowing no permit carrying, for example, and the Republicans are begging people to just say Gay\n\nIts not very common, but it checks out. This is the foundation of all things bird law.", "score": 1, "replies": [{"body": "I met an expert in bird law a while back. Gave me a great recipe for rum ham.", "score": 1, "replies": [{"body": "Oh man. Take it in with some fight milk, and baby, you got yourself a stew.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "You know whats crazy... Barney Frank was sitting on the board of signature bank. Yeah, that Frank from Dodd-Frank, who co-authrred the bill.", "score": 3, "replies": []}]}, {"body": "While simultaneously having their offices raided by protestors in France. Crazy world ![img](emote|t5_2th52|4640)", "score": 75, "replies": [{"body": "Maybe something the US should have done long ago, probably to late now tho since its become way to intwined with the goverment.", "score": 35, "replies": [{"body": "Did BlackRock do anything wrong? No they did not. They just manage assets, a lot of it for big name clients like hedge funds", "score": -26, "replies": [{"body": "....they own the world, and you’re asking if they ever did anything wrong?\n\nLmao.", "score": 28, "replies": [{"body": "Everybody wants to rule the world tears for fears", "score": -20, "replies": [{"body": "R u gay?", "score": 2, "replies": [{"body": "🏳️‍🌈", "score": -1, "replies": []}]}, {"body": "The worst fucking band ever and the worst fucking song ever...way to show man🤣", "score": 5, "replies": []}]}]}, {"body": "nobody gets that powerful without stepping on necks.", "score": 17, "replies": []}, {"body": "Exactly that’s what we do at BlackRock (I just do coffee runs). We are not responsible for the mess FED left us with.", "score": 1, "replies": []}]}]}]}, {"body": "I never understand why the fdic can’t just do this themselves", "score": 38, "replies": [{"body": "\"We CaN'T hAvE the .gov do sensible things so instead let the private bas\\*\\*\\*\\*\\*s do senseless things . That's the FrEe EnTerpRiSe way cause otherwise it's uh...uh... SOcIaLiSm... That's right \" \\~ Every loser \"*MarketMaker*\" (especially ex-Goldman ones)\n\nP.S : The Fed created plenty of LLCs to do these Public to Private transfers WHICH WERE AND ARE ILLEGAL as the FED is nor ever was authorized to do so. 2008 'crisis' was handled too pathetically ...", "score": 38, "replies": [{"body": "We wouldn't know what free enterprise would get because this *isn't free enterprise*.\n\nIn a free market, SVB deposits wouldn't have been insured after their failure. In a free market, SVB wouldn't exist because for its finances to get to this point relied on the Fed, which wouldn't exist in a free market. Established 1913.\n\nThis is less my support for free enterprise and more to the fact that this is corruption and a clear demonstration of intentionally interfering with the market for corrupt purposes. Even if we had a free market, it would probably be corrupt for other reasons, *but this isn't a free market.*\n\nThey didn't interfere while SVB was making risky loans, they only interfered *after*. If you're going to interfere than at least fucking do it right.\n\nIf anything this is what a *free market* looks like after its bought out the government, but at that point its no longer a free market.", "score": 23, "replies": [{"body": "Look at the crypto space to get a glimpse of what free market looks like.", "score": 5, "replies": [{"body": "Cryptos are pegged to the dollar. I don't think that's how they're designed to be used.", "score": 5, "replies": [{"body": "Ding Ding Ding. We have a winner ! There are so few people that realize this obviously glaring problem as morons that advocate for them are only seeking arbitrage ( def: the price difference of the two) on them via USD/crypto pairings rather than actually purely transacting with the cryptocurrency/(ies) themselves. \n\nLove your answer to the previous statement too . So succinctly put. Thank you . I'd love to see you pitch in like this ever so often not only here but on any subreddit <3", "score": 0, "replies": [{"body": "Thank you for the compliments! I didn’t know the definition of arbitrage, will remember it for future reference. \n\nThe ego has created some very big problems that don’t really exist. That’s an extremely loaded statement and without the proper context it’s essentially meaningless, but I leave it there. \n\nIt I can convince even a single person to see as I see, how many seeds have I planted? How much fruit will grow as a result?", "score": 2, "replies": []}]}]}]}, {"body": "Free markets trend towards unfree markets over time when left to their own devices, just on account of the winners in such a market ending up with more capital, which makes it much easier for them to keep dominating market share while stifling the competition. Throw money in politics into the mix and you're bound to end up with regulatory capture and monopoly/oligopoly owned politicians soon enough. So long as lawmakers want money, laws can be bought with money, and the right to ignore laws with impunity can also be bought with money. Law writing and strategic law breaking just ends up being a business expense.  \n\nThe will to enforce fairness on the markets, and to inhibit the unfair political and economic reach of its biggest participants, must come from outside the logic of capitalism. After all, if corporations can simply rig the game in their favor so they can take stupid risks with other people's money and then pass on any losses to taxpayers, *why wouldn't they do that*? Why would executives ever refuse the opportunity to play a game of heads I win, tails you lose, I end up with the golden parachute either way?", "score": 1, "replies": []}]}, {"body": "Because they just want to waste your tax dollars then take more of it to neglect the problem they say they want to fix", "score": 2, "replies": []}]}, {"body": "We need a public option for banking and brokerages.  Every time a bank fails, the federal bank takes over (or at the very least bids with other private banks for ownership).", "score": 6, "replies": [{"body": "Imagine if we could deposit our money with the fed", "score": 0, "replies": []}]}, {"body": "Maybe they are busy.", "score": 0, "replies": [{"body": "We can hire more bankers that work for us instead of the shareholders", "score": 0, "replies": []}]}]}, {"body": "This comes as no surprise. The Biden administration is a revolving door for former Blackrock employees who keep the gears of corruption greased.", "score": 12, "replies": []}, {"body": "Is Blackrock the designated bagholder for the FDIC?", "score": 22, "replies": []}, {"body": "We should do what the French just did.", "score": 6, "replies": []}, {"body": "Ooof.. I wouldn't tap that.", "score": 7, "replies": []}, {"body": "How else are they going to get rid of toxic liabilities?  Who else is gonna tie them up into securities to sell to the French pension system.  /s", "score": 9, "replies": []}, {"body": "So this means buy the stock? \n\nClarification needed for Medium/well retardation. Explain to me like I'm a puppy that got kicked by horse.", "score": 3, "replies": [{"body": "Blackrock has always been an ok buy for the regarded-- it is a blue chip stock.  \n\n\nBut daddy govt is just asking blackrock to help them sell securities to other regards. That's all.", "score": 7, "replies": []}]}, {"body": "They have a super advanced AI called Alladin that basicly rules the financial world at this point. There is no escaping Blackrock.", "score": 6, "replies": [{"body": "Yeah, Aladdin is managing like $25 trillion dollars right now", "score": 3, "replies": []}]}, {"body": ">That's pretty impressive. I'm not surprised that BlackRock is chosen to handle such large portfolios - they're one of the biggest and most well-respected financial firms in the world.", "score": 10, "replies": [{"body": "I’m not sure about that last part. Larry Fink seems to be an egghead.", "score": 13, "replies": []}]}, {"body": "Maybe I'm ignorant of something but I feel like I have a fairly good understanding of how the financial system works so I dunno.\n\nWhy does any of this actually matter. \n\nSVB collapses and they \"lose\" every non insured deposit.\n\nNow they are gonna get bought out or merge with some entity (assumption) \n\nWhich is my limited understanding of the current situation.\n\nIf that's accurate I'm not sure what's so shocking about any of this or why it even matters.\n\nA) Literally 100% of banks CANNOT cover all of the value of their account holders. They probably can only cover up to (and this is being very generous) 5% of whatever is on their books. \n\nB) Do these banks not have spreadsheets or databases with account holders info and balance? If they don't well then that's a whole other debate but if they do then when they merge or get bought out why does there new owners then not take  ownership of  the debts of the bank(debt being the collective cash value of it's account holders)\n\nIt's not like the money just upped and disappeared. It literally didn't exist in the first place. So long as very few people try to move money out of the banking system at any one time there should be none of these issues.", "score": 2, "replies": []}, {"body": "If blackrock is primarily real estate, why are they so liquid? Rents?", "score": 2, "replies": [{"body": "You're thinking of Blackstone. \n\nBlackrock is more like Vanguard.", "score": 7, "replies": [{"body": "I thought blackrock was the company that was buying up all of those private dwellings", "score": 0, "replies": [{"body": "That’s Blackstone.", "score": 4, "replies": []}]}]}, {"body": "They just have that much control on the USD.  And that much of it.  They have become the de facto Federal Reserve/US Mint.\n\nI’d argue they have more power to control the US treasury rates than the US does.", "score": 5, "replies": [{"body": "They better pay attention then. Chinas yuan is about to replace the dollar", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well into the works", "score": 0, "replies": []}]}]}]}]}, {"body": "Literally the one stereotype I know about the French is that they like hanging around not doing much… and these BlackRock MF’s want to risk imploding their retirement?  BlackRock is mortal, there are no gods…except JPow ![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "Tale as old as time", "score": 0, "replies": []}, {"body": "![img](emote|t5_2th52|4260) rinse and repeat", "score": 0, "replies": []}, {"body": "Billions spent by billionaires to politicians to get what they want which is to get your stuff while keeping their stuff. :-)", "score": 1, "replies": []}, {"body": "Well...\nHow convenient", "score": 1, "replies": []}, {"body": "Wasn't it the same with leeman and greece lol?", "score": 1, "replies": []}, {"body": "They got tapped on the shoulder to offload the shit that First Citizens didn't want to touch.\n\n&#x200B;\n\nSecuritization tranches (CLOs) could be baskets of, for instance, auto loans, future rent obligations, BNPLs, CREs, etc.  Wall Street found a way to make debt instruments out of basically anything with predictable cash flow coming out of the Great Recession.\n\n&#x200B;\n\nGreedy pigs ate this shit up too during the COVID peak when treasuries were yielding sub-1%.", "score": 1, "replies": []}, {"body": "seriously\n\nblackrock has more money than most nations on earth, more assets and more guns\n\nthey take what they want, not much you can do about it.\n\nif they are involved you can count on it being shady", "score": 1, "replies": []}, {"body": "Hmm really curious to see where this goes….", "score": 1, "replies": []}]}
