{"title": "Selling Covered Calls", "selftext": "So a little background, I (41m) make a decent salary for where I live, but I can get pretty busy at work, not to mention I would be away from my computer/cell phone due to meetings, so it would be impossible for me to trade/look at stocks at particular times during the day. After years of frustration, I have finally try selling cover calls. \n\n* I aim for volatile large cap stocks so the I can gain more premium with each option sold. \n* For the month of March, I focused on TSLA.  \n* I don't sell naked calls.\n* I only sell weekly calls.\n* I roll it on Friday, normally 15 minutes before the market closes.\n* I bought 100 of TSLA on 3/9 and let it be called out (sold) on 3/31/2023.\n\nHere are the results:\n\n* 03/09 \\~ 03/31: bought 100 shares at $184.5, strike out at $207.5, profit +$2300 \n* On 3/09, sold 3/17 call, strike price $180: Sold for $920,  buy back for $60, profit +$860\n* On 3/17, sold 3/24 call, strike price $180: Sold for $580, buy back for $813. lost -$233\n* On 3/24, sold 3/31 call, strike price $180: Sold for $1142, buy back for $2075, lost -$933  \n* Total profit: $1994\n\nNow, if I didn't sell those covered calls (instead of just holding the stock), I would have made $2300 instead (of $1994). However, the very next week the stock price of TSLA went from around $207.5 to $185. So, if I would have just rolled that last week (3/31) I would have retained all my profit (sold maybe for around $2090, buy back around $500), versus holding the stock and have all the profit gone in a week. That is the attractive part about selling calls, is that you always collect a premium each week regardless the price of the stock.\n\nSo I do a few questions, maybe the community can help. Where can I learn more about selling calls? The articles I found online only covers the very basic concepts of it, and I would like to have a more in-depth perspective of this, for example; how to select the strike price, expiration date, when to roll, stock selects, etc. Thanks.", "id": "12odxc8", "created_utc": 1681659618.0, "score": 112, "upvote_ratio": 0.91, "num_comments": 74, "comments": [{"body": "r/thetagang is all about selling puts and covered calls", "score": 76, "replies": [{"body": "Thanks I just went there.", "score": 13, "replies": [{"body": "There’s as many strategies as there are people. \n\nMy main strategy is to hold 100% SPY and sell covered calls 7-14 days out and let them expire. I have two accounts. One is to eek out an extra 1% per quarter so I can beat the market consistently over the long haul and the other is more aggressive with the aim of beating the market by 10% or more per year. \n\nSo far I have succeeded for the past 3 years. It’s nice seeing the entire market red while I’m flat. \n\nI only sell calls when the market moves so I rely on regression to the mean. \n\nI have had shares called away but I immensely sell aggressive puts at or above my prior call strike. It’s like the wheel strategy but with a very aggressive bias toward long term holding. The calls I sell are 3% outside the money while the puts I sell are at or just outside the money. With SPY the odds are in my favor for a mean reversion after a large upward swing. \n\nFor something like Tesla that is not necessarily the case. It’s impossible to predict where that stock will go. \n\nWith SPY I can calculate a fair value based on earnings. And there’s so many stocks inside SPY it tends to be less volatile.", "score": 31, "replies": [{"body": "This is the way! SPY QQQ, covered calls and CSPs, it's all I need! Great post.", "score": 7, "replies": [{"body": "how many shares of spy do you have!?", "score": 1, "replies": []}]}, {"body": "Yeah I always thought covered call strategies for income were best on lower volatility stocks ie opposite of TSLA", "score": 4, "replies": []}, {"body": "What do you consider market moves? I usually make a move after back to back green or red days depending on the direction. \n\nDo you always let them expire or pocket gains if you get lucky real quick?\n\nI’ve started wheeling in my Roth with AAPL, and started selling puts on some stocks I’m looking to get back in to- MSFT, TSLA, GOOG. \n\nThanks!", "score": 1, "replies": [{"body": "I usually let them expire unless they’re 85-95% and there’s several days left before expiration. If it’s just a few bucks I’ll buy them back to take the risk to zero. \n\nSeems to happen around a fed meeting. I’ll sell a call with a good premium that expires 7 days out but the next day or two most of the premium has already dried up.\n\nAaple and Msft have really good premiums. I have gained from Msft recently but I backed off because that PE made me not like it long term. I’d rather buy at 18 PE or less.", "score": 4, "replies": [{"body": "How do you decide what strike price to sell it at?", "score": 1, "replies": [{"body": "I use TSI Total Strength Indicator and price. \n\nFor price I look at the average price and I add an appropriate appreciation \n\nLast quarter the range was\n\n417+377=794\n\n794/2=397\n\nThat was the average for last quarter so with an optimistic forecast of 12% annual appreciation the average for this quarter is 397×1.03=408.91\n\nSince I don’t want my shares called away I’ll sell 2-3% above the current price assuming we are near a reasonable price. \n\nI didn’t sell any calls when the market was in the recent lows. I didn’t want to get my face ripped off. \n\nNow feels like a good time to sell at around 422 strike. \n\nAs long as I catch a few bucks here and there it tends to add up over time. And that goes into buying more shares of SPY. It’s nice adding shares of SPY to an account I’m not adding new money to.", "score": 1, "replies": []}]}]}]}, {"body": "HOLD up..... so if I wanna be like you, I gotta buy 100 shares of SPY!?!?  That's like 47k!", "score": 1, "replies": [{"body": "Yeah. Work a job with a 401k for several years then quit and roll it over to a traditional IRA", "score": 1, "replies": [{"body": "I had no idea you can do that. \n\nWhen you said you hold 100% SPY, you're only investment is SPY!?\n\nHypothetically, let's say 100 shares of spy is like half of your networth and you are 30 years old.   Would you do what you are doing now and sell covered calls 7-14 days out?", "score": 1, "replies": [{"body": "Yes. I am 41 and have 123 shares of SPY in my IRA and around 150 shares of SPY in my wife’s IRA. I also have a work 401k with 160k which is 90% VOO (same thing) and 10% fidelity US bonds. I should probably be 100% there too. \n\nI did the math and so long as you keep a job and keep adding every pay check holding 100% SPY or VOO is the logical choice. Both in terms of returns and how easy it is. \n\nSelling covered calls is just a bonus. \n\nMy goal is to beat the market every year even if it’s just by 1%. Most people fail to beat the market. Most professional investors fail to beat the market. So the smartest thing to do is to simply buy the market. At a minimum I’ll match the market. Easy. \n\nAnd if it crashes by 50% so long as I keep adding it doesn’t matter at all. \n\nThis strategy should be used by everyone except retired people. Once you get a few years from retirement money should be moved to bonds.\n\nEdit: I will add there’s a bit of risk to selling covered calls and that’s having your shares called away. It’s usually not a big deal if you sell calls that’s 2-3% above the current price. You can always sell a put right after and the price usually mean reverts. \n\nI don’t always sell calls. Only when the market goes up sharply like it has recently. I sold one last Thursday that expires this Friday. The market went up and I may roll the call forward. I’ll usually roll forward once before letting them get called away. I sell a put almost right at the money with the hopes of getting assigned due to a drop in price.\n\nI’ve beaten the market for the last 3 years doing this. I just try to get $30-$60 here and there without being greedy. Eventually that money adds up and I can buy a whole new share of SPY.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You did well. $1994/$18450(paid price)=10.8% rtn. This is a lot more than avg cc sellers earned with other stocks.\n\nIf I sell an index like SPY for same week or fraction a week, I often lose more than gained simply I can not anticipate future.  Stocks I sell cc my cost basis price has to be  below the trading range.  If I sell your TSLA at 160 and get reassigned I  lose more than the intend use the premium for a source of income.   Not sure about you, I often forget to check cc such as having stocks exercised.  If trade in a taxable account one has to pay capital gain tax.", "score": 20, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I agree, I feel like I got really lucky and my expectation is not that high.", "score": 6, "replies": [{"body": "I shoot for like 1-3% weekly, or call it 5% monthly", "score": 5, "replies": [{"body": "thats minimum 79%/year... thats nice", "score": 2, "replies": [{"body": "Ya that’s def way too high, I don’t nearly generate that much. \n\nProbably more like 1-3% monthly. \n\nThing is, I also don’t sustain that either bc I won’t sell just regardless of what’s going on. So, on annual it’s not that much.\n\nFor the positions I’m selling on, it’s more like $400-600 per month, which against my portfolio on an annual basis is not even close to 76%", "score": 1, "replies": []}]}]}]}, {"body": "Making money in the market is already much better than investing in general", "score": 1, "replies": []}]}, {"body": "You missed the part with the math where OP did worse selling calls against his position instead of just holding the stock", "score": 3, "replies": []}]}, {"body": "There's different strategies but I wouldn't have realised that loss and just let myself get exercised. \n\nSure you can compare the price you get called at to the share price at the time and consider that delta loss but it's not actual loss so long as the strikes you sell at are above your cost basis. \n\nYou're doing half of wheeling. As you aren't selling naked/poor man's why not do the full thing?\n\nIf you get called and you still like the stock to play with but you aren't happy with the current price just sell a cash secured put instead to where you are happy with an appropriate delta. \n\nPlenty of examples and tutorials on wheeling out there.", "score": 15, "replies": [{"body": "I would have rolled it but I got too busy at work and missed the window.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "The 1% - 1.5% return, is that annually?", "score": 2, "replies": [{"body": "[deleted]", "score": 8, "replies": []}]}]}, {"body": "Theta gang bruh\n\nAnd you’re selling weeklies in tesla so you gotta expect regular wild ass moves that are either gonna print nicely or get your stock pulled away and you feeling bitter.\n\nAlso you’re rolling mechanically it seems.\n\nPerhaps for further out: 30-60 days, for example, or be more judicious when you sell, or how quickly you buy them back.\n\nOr switch your underlying", "score": 8, "replies": [{"body": "When you say “pulled” do you mean exercised, or being forced to buy out of the option to keep the 100 shares?", "score": 2, "replies": [{"body": "I mean exercised.\n\nI was saying that if you’re selling calls on tesla, especially weekly, there’s a substantial likelihood it’s going to blow past your call from time to time.\n\nSame in reverse if you’re selling puts, finding yourself exercised on a position you’re now down 10% in", "score": 1, "replies": []}]}]}, {"body": "If allowed in your account sell cash secured puts fir a strike below the call strike and if hit you buy at that strike - this will put hold on funds aqualling the put strike so you would need in this case 18000 for share buy and sell covered call + 18000 for additional on hold (tied up) for assignment if hit. The call wouldn't be excersized if put strike is hit so it is possible that you would end up with 200 shares unless you buy the put back for a loss - this is a full wheel turning strategy - also there is nothing wrong with allowing your calls to be pulled away and with tsla uts easy to sell above your input cost instead of base cost this makes a profit most times", "score": 5, "replies": [{"body": "Thanks I will look into that.", "score": 1, "replies": []}]}, {"body": "Nvda tesla sq apple are my favorite names for the wheel", "score": 4, "replies": []}, {"body": "You should definitely note your delta of your strike to help really encapsulate your setup when describing things imo.", "score": 3, "replies": []}, {"body": "Why roll them when you can let them expire and sell new ones on Monday?", "score": 3, "replies": [{"body": "Price on Monday will usually be lower when selling and when itm if you don't roll over you're selling at that price. I only rollover when the stock will get called out but I trade less volatile stock and my one volatile leveraged ETF is not to hard to manage since I only sell calls when the price is high and unless it explodes up out of nowhere it ends otm. I also do monthly ones not weeklys so don't care too much about rolling over. With weeklys that extra day is a solid amount of premium gone", "score": 2, "replies": []}]}, {"body": "Personally, if your not looking to hold your stocks long term.  You said your focusing on high volatility stocks. So it sounds like your trading them and not investing them.  I would not do this strategy. The risk is the stock you pick tanks.  Personally if I were selling calls, I would still pick stocks that pay a dividend and sell 1 month out. Sell the call and then hold even if it goes past your strike and your option gets exercised. You still make a profit on your shares plus keep all the premium.  And if the stock drops, you keep your premium and if you hold longer term as you wait for the stock to rise, you get dividends. \n\nExample. A stock is $100. Pays 2% dividends.  You sell a 105C for 1.00. If it goes to 110, you still make $5 a share plus keep the $100 from your 1.00 credit. And if the stock falls to $90 you keep your 100 for your 1.00 and you get 2% dividend if it stays low for long enough.  And just keep doing that. Yes, if the stock keeps falling the 105 strike will be less, say 0.80. But after a few months you could then lower your strike to the 100 where you originally bought in. If it hits, then your still in profit because you would have collected a few months of expired credit and maybe some dividend funds also.  Just pick a company your comfortable holding long term if needed.", "score": 3, "replies": []}, {"body": "I sell calls on tesla.  Its nice.  the biggest criticism is \" BUT YOU ARE LIMITING YOUR UPSIDE\" \n\n&#x200B;\n\nwell yes...yes I am but my profit skew is so large I can sleep well.  If tesla hits 150 I make money if it hits 220 I make money..... I will rinse/repeat that all day.  \n\n&#x200B;\n\nthen if it drops below 100 just yolo your stack and ride it back to 125-150    \n\n\nRemembers Singles add up, you just need to get on base to get grand slams", "score": 2, "replies": []}, {"body": "Strongly recommend [pi-fi](https://youtube.com/@Pi-Fi). He’s young and brash but he offers a lot of great info on his streams and as someone who also works full time I find it much easier to listen to him at the office (when I can) than to try and follow the market on my own. \n\nBest of luck!", "score": 2, "replies": []}, {"body": "You lost me at Tesla JFC 🤦🏻‍♂️\n\nThe entire point is to sell calls on  NON volatile blue chip companies so you only have to look/manage it maybe once per week\n\nTesla is a $20 stock currently priced north of $180 that can move 3-5% in a single day because of their unhinged CEO.  Stick to stocks that don’t move around too much with low IV, can make 8-10% per year in premium (aim for 1% per month at most) and if it’s a solid dividend stock toss in another 3-6% \n\nI’ve built a 9-figure business around it🤷‍♂️", "score": 1, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "I think he meant NAV or AUM in his fund. So probs raised $100M or so?", "score": 2, "replies": []}]}, {"body": "Tsla is a $20 stock? Lmao", "score": 3, "replies": []}, {"body": "You lost me when you said TSLA deserves a 4 P/E on the 5.45 expected next year! JFC. I do this for a living as well, TSLA is under a 5% weighting in my strategy, it's all ok, balance is key!", "score": 2, "replies": []}]}, {"body": "https://optiongenius.com/ has some good programs for sale. He really likes helping people. He also offers a trade along with him program where you pay a monthly fee and set up your account to mirror his. Maybe try his passive trading formula. That’s where I learned how to sell options.", "score": 0, "replies": []}, {"body": "regarding trading. \n\nyou can use limit sell/buy orders instead of market sell/buy orders. this way you don’t need to watch the market all day.", "score": 1, "replies": []}, {"body": "It sounds like the volatility is too much for you based on your before-last paragraph. You should be going into those trades already anticipating these events. Stay away from weeklies too, they'll kick your ass if you're unwilling to part with your shares (45-60 days is what I like).", "score": 1, "replies": [{"body": "How often do you roll those 45 to 60 days options? Do you wait until it expires or do you roll them weekly?", "score": 1, "replies": [{"body": "Depends on the price action. I like to keep my shares so when I hit a 50%+ profit I close the option. Sometimes this means I need to wait until closer to the end of the strike date. I also only sell CCs on a portion of my position, and add to it if things go against me. It helps me a lot with covering any loses.", "score": 3, "replies": []}, {"body": "The standard is once you hit 50% profit or more because someone did the math, and the extra 50% further gain doesn't justify the risk or time premium normally.\n\nSelling puts/calls could be like picking up pennies in front of a steam roller.  A lot of ppl in r/theta were burned because they would sell CSP on shit companies (SIVB).  Do the research and when you have to sell/buy you don't end up freaking out.  Better to trade on only a few companies that you know well.\n\nYou also get dinged on short term capital gains tax so take that into account.", "score": 1, "replies": []}]}]}, {"body": "Tesla lol it’s a bipolar stock", "score": 1, "replies": [{"body": "Looks like you might have made a lot of money on Tsla stock too", "score": 1, "replies": [{"body": "Been too scared to play it….I remember watching a YouTuber in 2019 saying to go all in on Tesla, I wish I would have listened…have had plenty of opportunities to pull the trigger but I’m scared of TSLA price action", "score": 3, "replies": [{"body": "that sucks you miss out on a lot of gains", "score": 1, "replies": []}]}]}]}, {"body": "I’ve used this strategy a lot, but it has been less profitable than simple long or short positions. I suspect it’s because the upside is much smaller than the downside, and I tend to not exit it early.", "score": 1, "replies": []}, {"body": "Options are expensive af, idk how anyone can consistently make money", "score": 1, "replies": [{"body": "by selling them", "score": 6, "replies": []}, {"body": "It’s basically betting. \nSomeone says: hey I bet you the stock will hit x at date y, \nI say:no it won’t. \nThem:wanna bet? \nMe: sure, that will be $230 ($2.3 *100) \nThem: deal, \n\nIf the stock goes to x+(let’s say $20) at or before date y, they get 100*20 profit, I will lose out on the potential gains. Key word potential. I will keep the $230 no matter what. It’s a way to make your stocks do extra work for you.", "score": 2, "replies": [{"body": "That's what I mean, even if you get the direction right it also has to also move big. The math is so bad, which I guess is why the WSB people have lost all their money.", "score": 1, "replies": []}]}]}, {"body": "Aren’t your losses wash sales?  So keep that in mind.", "score": 1, "replies": []}, {"body": "I mean it's a very basic strategy and I only do it in companies I believe in long-term and I only choose strikes I'd be ok at selling and I avg down during the low periods. Long enough time line your premiums from calls should start to close in on your base costs and that is where you can start to really get bold cause it is really all gravy at that point the stock could go to 0 and you still already covered your initial costs", "score": 1, "replies": []}, {"body": "Alan Ellman has written some books for covered call strategy.", "score": 1, "replies": []}, {"body": "Selling calls can cap your gains if Tesla decides to do a wild run. That stock is notoriously for doing huge swings in a matter of days. Imagine getting exercised for a 5-10% gain while the stock does a 50% upward swing. Or the reverse - imagine it tanks back down to $103 and now you're selling CCs after eating an almost 50% loss.", "score": 1, "replies": []}, {"body": "Remind me! 1week", "score": 1, "replies": [{"body": "I will be messaging you in 7 days on [**2023-04-23 22:40:19 UTC**](http://www.wolframalpha.com/input/?i=2023-04-23%2022:40:19%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/12odxc8/selling_covered_calls/jgjfxj1/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F12odxc8%2Fselling_covered_calls%2Fjgjfxj1%2F%5D%0A%0ARemindMe%21%202023-04-23%2022%3A40%3A19%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2012odxc8)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "!Remind me 1week", "score": 1, "replies": []}, {"body": "Check out $TSLL\n\nIt’s 1.5x leveraged TSLA and it also has options, the premium percentage isn’t bad", "score": 1, "replies": []}, {"body": "Heres an issue I had which I hope doesnt happen to you. I was selling calls of stocks that barely moved like Verizon and ATT and even PLTR was good. but now I am down like 40% of all of those positions so I cant really sell calls on them. Here is my dream scenario with PLTR\n\nI load up tons and tons of shares at 10 average. Over next 3 years the stock rockets to 70. I am now selling 75 calls and even if it runs and gets called away I am making all that profit. Again, hopefully I have a few thousand shares and plan to stack them. lets say 5k shares. I sell 1k at 75 and 1k at 78 and 1k at 80/82... Even if it hit the 75 I am only selling 20% of my bag and lets face it at some point we have to take some profits..", "score": 1, "replies": []}, {"body": "If you are a glutton for premium you can switch over to futures options. Very different ballgame but the benefit is the free leverage. Premiums are much better but you have to keep in mind everything that goes with futures contracts.", "score": 1, "replies": []}, {"body": "Selling blk covered calls. Made a mistake and sold it days before they reported the quarter. Hopefully it expires instead of being exercised.", "score": 1, "replies": []}, {"body": "Is their a good book on the mathematics of option trading?", "score": 1, "replies": []}, {"body": "So, I can't vouch for him, but I know that, for a price (around $150), Tyrone Jackson has a class that you can take on how to sell covered calls, just google \"Tyrone Jackson covered calls\" as they're kind of his thing. \n\nAgain, I can't straight up vouch for him as I haven't purchased his product (I'm way too concerned about losing money), but I have listened to many episodes of his podcast and he seems fairly legit.", "score": 1, "replies": []}]}
