{"title": "Warren Buffett says the unusually quick sale of Berkshire Hathaway's TSMC stake was driven by geopolitical tensions", "selftext": "", "id": "12jj7go", "created_utc": 1681299221.0, "score": 178, "upvote_ratio": 0.94, "num_comments": 74, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|11 months ago\n**Total Comments**|108|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Yes, I also get my market news from movies.yahoo.com", "score": 138, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 17, "replies": []}, {"body": "Bullishhh", "score": 3, "replies": []}, {"body": "Not the DD we want, but the DD we deserve.", "score": 1, "replies": []}]}, {"body": "Buffet bought the “China invades Taiwan” meme…\n\nNot a good sign for the whale.", "score": 45, "replies": [{"body": "I might have details hazy but didn't the US started building the semi conduct factory inside the US? \n\nThe capital outflow from Asian investors from US/Canada was happening for the past 9 months so Buffet is not the only one who is buying into that meme. \n\nChina wouldn't want Taiwan without TSMC. The US wouldn't care about Taiwan as much once local TSMC factory is operational", "score": 7, "replies": [{"body": ">China wouldn't want Taiwan without TSMC\n\nThis is so wrong.\n\nTaiwan is of massive strategic importance to China, Just look at the map and do some reading around the South China sea conflict. If Malaysia shuts down the Strait of Malacca then the bulk of their oil has to come via the Pacific Ocean past Taiwan which is a real problem if they don't control it.\n\nImagine China and Russia having forward operating air and naval bases in Hawaii to understand this. They are not about to risk WWIII just for a semi fab plant. They want and need the Taiwan land to mitigate a major strategic threat not to mention how this strengthens their case for controlling yet more area of the South  China Sea.", "score": 25, "replies": [{"body": "> Taiwan is of massive strategic importance to China,\n\ntaiwan is of massive strategic importance to the world.", "score": 7, "replies": [{"body": ">taiwan is of massive strategic importance to the world.\n\ntaiwan is of massive strategic importance to the Milky galaxy.", "score": 3, "replies": []}]}, {"body": "This guy didn’t sleep in geography / history class", "score": 5, "replies": []}]}, {"body": ">China wouldn't want Taiwan without TSMC.\n\nChina has wanted Taiwan for hundreds of years before TSMC existed and will continue to want Taiwan long after TSMC ceases to exist.", "score": 20, "replies": [{"body": "What are you on about? The Chinese revolution was in 1949…", "score": 10, "replies": [{"body": "Sorry I forgot China didn't exist before 1949.", "score": 2, "replies": [{"body": "Taiwan belonged to China before the war… its post war then the separation happened.", "score": 2, "replies": [{"body": "Not consistently, the exact same situation played out during the Ming-Qing war before Qing China reunified Taiwan by force. Then again it was lost to Japan and recovered once more, this upcoming reunification will be the third time.", "score": 3, "replies": [{"body": "You missed the Dutch.", "score": 3, "replies": [{"body": "Not comparable, the Dutch came before the Chinese.", "score": 1, "replies": [{"body": "Errrrrrr……. Chinese people were already settled there just not in huge numbers.\n\nPretty sure there were way more Chinese than Dutch when they first landed in Formosa.", "score": 1, "replies": [{"body": "Yes, Chinese people settled in lots of places around South Asia by then, but that was population movement rather than national sovereignty.\n\nAll colonies had more indigenous people than Europeans when they first landed, that didn't get in the way of them exerting sovereignty.\n\nMing didn't take over Taiwan from the Dutch until they were on their last legs losing to Qing, similar to how ROC took over Taiwan just a few years before losing to CCP.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "China was ok with Taiwan being neutral for a while. Taiwan was also in favor of maintaining status quo, they have done it very well for a long time.", "score": 1, "replies": [{"body": "No they’re bad at it, wrote themselves into a corner militarily and diplomatically. \nShould’ve had nukes (they tried, gave up coz Uncle Sam stopped them twice, should’ve said fuck it), fixed conscription years ago and built more on anti-China sentiment, they did a bad job during the Cold War.", "score": 3, "replies": [{"body": "A true US power move would be giving Taiwan nukes tbh.", "score": 3, "replies": [{"body": "Nuke Taiwan then nobody can have it", "score": 1, "replies": []}]}]}]}]}, {"body": "Buffet is completely connected to the DC insider world so he's probably been explicitly told \"Taiwan is going to fold if/when China invades and China will have the capacity to do so in 5-10 years\"\n\nUS is pulling out of Taiwan *mainly* because Taiwan itself doesn't look like they will resist a military invasion.", "score": 11, "replies": [{"body": "Recent military analysis released by high quality US sources showed a massive Chinese defeat, unless Taiwan stands alone.\n\nUS loses two carrier groups, China loses entire fleet and more, and that’s assuming no quality differences \n\nIf Taiwan stands alone then maybe not", "score": 2, "replies": [{"body": "For now, yes. \n\nThe problem the US faces is that some of the steps that are necessary to prepare for possible defeat of Taiwan (in 10+ years), eg CHIPS act, are going to telegraph exactly that we are preparing for the possible necessity of abandoning Taiwan.", "score": 1, "replies": [{"body": "Or maybe the US is just suring up domestic supply of something that's basically critical infrastructure at this point because strategy is multifaceted and you don't risk your entire access to something based on a situation that can go in different directions, and you're just a big weeble wobble idiot on the internet, huh? Think of that?", "score": 1, "replies": [{"body": "yeah I thought about it, and I stand by my assesemt", "score": 2, "replies": [{"body": "I stand by your ass too brother", "score": 1, "replies": []}, {"body": "Ok carry on", "score": 1, "replies": []}]}]}]}]}, {"body": "Where are you getting info that the US is pulling out of Taiwan? Nothing I've seen suggests such a thing. Actually, the opposite", "score": 6, "replies": [{"body": "the US is (to my eye) *preparing* to bail on Taiwan. As well as preparing to defend it. If there is ever a military conflict over Taiwan (I think this is less likely than not), how much of a fight the US puts up depends on how much of a fight Taiwan is willing to put up. \n\nUntil recently, it has been tacitly assumed that Taiwan would vigorously resist. \n\nWhat I'm trying to say is that the US is preparing for contingencies that it has not historically prepared for.", "score": 8, "replies": [{"body": "By building new military bases adjacent to it in the Phillipines??", "score": 2, "replies": []}]}, {"body": "Where are your sources? Can you not read the room when people say everything is fine while packing their bags and clearing out their vaults?", "score": 4, "replies": [{"body": "I'm in the military and talk to people? Just because some investors leave doesn't mean the US has abandoned Taiwan lmao", "score": 8, "replies": [{"body": "just because grunts in the next bunk beds agree with you doesn't mean you have a single clue of what the US position really is or isn't.", "score": 1, "replies": [{"body": "So in the military there are these things called briefings where you can get important information", "score": 6, "replies": [{"body": "I remember numerous briefing where the commander (often very senior) turned out to be proven very wrong in just a few months. Take everything you hear in those briefings with a grain of salt, the people giving them are still several layers removed from the ones creating policy", "score": 6, "replies": []}, {"body": "Your country would never lie to you. They won't abandon you or the people you're protecting like in Afghanistan. Everything is fine because you know as much as the Gerneral, Colonal, sergeant etc. Everyone commanding you has your best interest at heart and everything is priced in. Thanks for keeping us all 'informed'. I'll pass this Intel along to China right away. Thank you for your service.", "score": 1, "replies": []}, {"body": "and you learned about briefings from call of duty, congratulations.", "score": 1, "replies": []}]}]}, {"body": ">military\n\nwell we know approximately how regarded you are but to clarify, chair force or marines?", "score": 0, "replies": []}, {"body": "Sir, can you tell us more information about the military and their movements? I need to know more so I can report you to the proper authorities. \n\nhttps://www.washingtonpost.com/national-security/2023/04/12/discord-leaked-documents/", "score": 1, "replies": []}]}]}]}, {"body": "And US is building better fabs than Taiwan right now. Once they are up and running US Military strategy will be to stop anyone else from getting any tech that's ahead of INTEL. Which makes INTC the safest and therefore most boring investment in the world right now. They are going to 1 trillion mc in the next 5 years, unless someone conquers America (not gonna happen).\n\nBuffett got into TSMC because the industry is going to keep expanding over the decade, but got out quick because TSMC itself is about to get wrecked. This leaves INTEL as the worlds dominant chip manufacturer sometime around 2024. They already have priority service agreements with ASML. How much more evidence do people need?", "score": 1, "replies": [{"body": "> And US is building better fabs than Taiwan right now\n\nfalse.", "score": 2, "replies": []}]}, {"body": "Taiwan is way more likely to buckle the way Hong Kong did(\"One country, two systems\") than the way Ukraine has. Slowly and subtly taking over is way more effective than an all out military invasion. Especially when you consider that China is going to want to keep Taiwan's manufacturing capacity, not take over a completely demolished island", "score": 1, "replies": []}]}]}, {"body": "He’s old", "score": 0, "replies": []}, {"body": "what, u think buffets going crazy?", "score": 1, "replies": []}]}, {"body": "So options trades are considered 'geopolitical' now?", "score": 11, "replies": []}, {"body": "[deleted]", "score": 32, "replies": [{"body": "Nvda would be a better short bc they get a lot of there chips made at tsm", "score": 7, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "China is unlikely to do anything as drastic as an actual invasion this year.  In 5 years possibly, 10 years likely, but not now.  Their Navy isn’t ready for that kind of conflict.  It would be an amphibious landing about 1.25-1.5 times the size of D Day and expecting the US Navy as well as Taiwans military to just let it happen.  \n\nWe might see China try to blockade or exert pressure through the market but highly unlikely an actual invasion is in the cards within the next year.  I am also betting that China will wait for TSMCs Arizona fab to be fully online before invading as well so that the US is less likely to intervene.  If they invade before that happens the US really doesn’t have much of a choice but to get involved or become irrelevant on the world stage.", "score": 16, "replies": [{"body": "The moment Chinese soldiers land in Taiwan those chip factories will go blammo.", "score": 9, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "!remindme 2 years\n\ni see the opposite. with us opening the bases back up in the phillipeans, a renewed interest in partnerships in the pacific I see the US as acting to counter chinas military moves for the first time in 20 years (since they started to try to grow their local power).  The australia nuclear sub deal, Japan rearming...no i see things going opposite of what you said. Also biden has repeatedly done the oppsite of what you claim\n\n>WASHINGTON, Sept 18 (Reuters) - U.S. President Joe Biden said U.S forces would defend Taiwan in the event of a Chinese invasion, his most explicit statement on the issue, drawing an angry response from China that said it sent the wrong signal to those seeking an independent Taiwan.Sep 19, 2022\n\n\nthat said, if there is a war, or if china takes taiwan unopposed by the US, i have a feeling we will see huge disruptions in the IC market for obvious fucking reasons", "score": 9, "replies": [{"body": "Bullish for Intel though", "score": 2, "replies": []}, {"body": "US Expat, former military, former defense contractor, living in Philippines checking in.  The DOD signed an agreement to open 5 new bases here which was a surprise given that Clark and Subic were both suspected by local populations to be re-opening yet the DOD opting for alternative locations to start building up from (almost) nothing.", "score": 1, "replies": []}]}, {"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}, {"body": "I guess possible but Taiwan is a strong democracy and reunification with China has been less and less popular every year for awhile now. Also they have the world market by the balls due to their advanced chip fabs.  \n\nAdditionally, the US has being the doing the exact opposite of what you claim recently.  That is what the visit by Pelosi was about as well as the recent meetings Taiwan had with senior members of the legislature last month.  The current administration is engaging more heavily with Taiwan as a signal to China of increased support.  Biden has also been far tougher on Russia than either Trump or Obama.  \n\nWe will likely have to agree to disagree but I think your personal politics are blinding you to what is actually happening.  I did make a large bet on TSMC last year when they hit mid 60s and am still holding (20k in shares and 5k in 2024Jan 80c LEAPS) so I am a bit biased as well.", "score": 4, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Did you get your mobilization order yet Vlad?\n\nUkraine is beating Russia with NATOs leftovers lol.  Russia thought it had the second strongest army in the world turns out they had the second strongest army in Ukraine.", "score": 8, "replies": []}]}, {"body": "Korea and Japan as well.  Not to mention the carrier groups that have been doing “exercises” near Taiwan all this year.", "score": 1, "replies": []}]}, {"body": "Dipshit", "score": 1, "replies": []}]}]}]}, {"body": "US vs China\n\nNo nukes \n\nAnything is fair game \n\nUS would annihilate China in sleep", "score": 1, "replies": []}]}]}]}]}, {"body": "Biggest pump and dump scheme", "score": 10, "replies": []}, {"body": "According to google buffet bought in Q3 2022, selling now would net him a hefty profit.  I'm guessing that has more to do with his reasoning. He made some fast cash somewhere he doesn't usually invest and now he wants to deploy it somewhere he's more comfortable.", "score": 8, "replies": [{"body": "He sold on the end of year rally if I remember correctly.  So mid to high 70s.  Still a good profit but from buy to sell he was only in the stock for like 5 months I think.", "score": 5, "replies": [{"body": ">from buy to sell he was only in the stock for like 5 months I think\n\nThat's almost....daytrading for Buffett.  He's actually turning into one of us!", "score": 12, "replies": [{"body": "Regardation in progress", "score": 4, "replies": []}]}]}]}, {"body": "so are we memory holing that he bought, then they made a huge announcement about building in pheonix or some shit, and then he sold right after the news?", "score": 7, "replies": []}, {"body": "He panicked.\n\nWhat a n00b.", "score": 3, "replies": []}, {"body": "If he's scared then I am greedy", "score": 3, "replies": []}, {"body": "but he's still hugely in aapl (and defending that), which is dependant upon tsm.  \n\nso...", "score": 2, "replies": [{"body": " I don't think it is actually about \"geopolitical tensions\". \"Geopolitical tensions\" were already there and he would have considered \"geopolitical tensions\" when he first bought TSM.", "score": 1, "replies": []}]}, {"body": "Taiwan is a part of China not a independent country, even America has agreed since Nixon went to China. Most of the world including America recognises the one China policy as a precondition for trade", "score": -2, "replies": []}, {"body": " I don't think it is actually about \"geopolitical tensions\". \"Geopolitical tensions\" were already there and he would have considered \"geopolitical tensions\" when he first bought TSM.", "score": 1, "replies": []}]}
