{"title": "What would you do during a market crash?", "selftext": "Okay, lets say we are entering the next huge market crash similar to 2008. What would you do and why?", "id": "3zns6m", "created_utc": 1452049201.0, "score": 21, "upvote_ratio": 0.96, "num_comments": 19, "comments": [{"body": "Inverse ETFs until the market started up again. Then back to my usual trading. ", "score": 7, "replies": [{"body": "SH is the inverse for the S&P. EFZ is an inverse for Europe (broadly speaking). ", "score": 2, "replies": []}, {"body": "You can hedge in an up and down market like now - For some of these smaller crash days - Buy into UVXY some with non hedge money on the upswing and watch it like a hawk - often selling the same day.                  \n                   \nThe full power hedge of the last two years was UVXY and the medium hedge was TMF but this year TMF/TMV are  in less known territory. \n15%  is full power 10 UVXY 5 TMF. \n7.5% is medium with 50 / 50 split. \n\nIf you KNEW it was a crash then UVXY / LABD would spike quickly for sure. It's inverse ETFs for sure like williane said ", "score": 2, "replies": []}, {"body": "Thanks.", "score": 1, "replies": []}]}, {"body": "Since no one is giving a serious answer, i think if you suspect a market crash(if you know it's a market crash and you have stock invested, it's already too late), then hold your cash until everything's overblown out of proportion. \n\nThat is once the media has it covered 24/7. Now BUY BUY BUY. Obviously you don't want to catch a falling knife but if you buy well below the precrash price, it's almost certain (for good healthy stocks anyway) that you'll make a profit. Also If you're worried about an imminent crash study previous crashes and ask yourself what would you have done, then ask yourself what would you have done each day given you did not know the outcome of the next day.\n\nAlso invest in inverse ETF's till the crash is over.", "score": 5, "replies": [{"body": "care to explain what an inverse ETF is?", "score": 2, "replies": [{"body": "Short answer, a ETF that does opposite of its counterpart. $SH is S&P 500 inverse ETF. See here :\nhttps://www.tradingview.com/x/Rj0kEa1E/\n\nThe red line is $SPY (sp500 index). The candlesticks are $SH. ", "score": 3, "replies": []}]}, {"body": "Thanks", "score": 1, "replies": []}]}, {"body": "Stick head in sand, check back in 3 years.", "score": 3, "replies": []}, {"body": "Wait until it looks like it's trading sideways, and then buy in with about 1/3 of my cash for every 3% it drops. \n\nI'd stick with mostly safe bets (SPY JNJ BRK) and try to remember:\n\n\"Pigs get fat. Hogs get slaughtered.\"  - as in: \n\nIt is hard to con an honest man. If you think you're going to take extreme advantage of some group of people, then you're probably going to get taken yourself. Don't short the DOW thinking you're going to win big. Don't buy Greek currency because you think it's going to bounce back huge when some country decides to forgive its debt. \n\nJust look for your opportunity to provide shelter in the storm. Buy SPY when everyone else is panicking, with the mindset that you're doing a service. Sell when everyone is celebrating, knowing that these morons will need you to have your cash in hand later. ", "score": 3, "replies": []}, {"body": "Start buying everything. Then head over to /r/wallstreetbets and post pictures of my soon to be fleet of yachts. ", "score": 5, "replies": [{"body": "YOLO", "score": 11, "replies": []}]}, {"body": "Buy on the way down of course. ", "score": 1, "replies": []}, {"body": "Prevention is better than seeking a cure for this. Before the market crashes you must carefully examine your portfolio to be sure that only reasonably priced investments with good quality are in your portfolio. Quality investments tend to weather a storm much better than shaky companies. (By quality I mean big moat, low debt, stable and growing income, revenue). Also examine the overall market to see if the 10 year historical average P.E. ratio is too high and then trim your risk by selling the overpriced stocks. Having a lot of bonds before crash means that you may be able to sell them if they are high credit quality bonds at a reasonable price and then use the proceeds to buy stocks at the bottom during a crash.", "score": 1, "replies": []}, {"body": "I am have been planning for the last few months. Moved half into inverse ETFs and am holding onto my utility, energy, dividend and bond ETFs and funds that I've been incremently buying into for years. My utility fund is down a lot this year but it pays a decent monthly dividend so I'm just accruing additional shares. Slow and steady.", "score": 1, "replies": []}, {"body": "I'd cash out and once shit hit the fan I'd start buying giants with huge cash reserves like APPL or XOM. ", "score": 1, "replies": []}, {"body": "I will continue to do what i have done. close my low risk high cash positions and move into high risk low cash positions.  \n\nI will also cry to my therapist that i lost more money in a day than most people earn in a lifetime :( ", "score": 1, "replies": []}, {"body": "Wait", "score": 0, "replies": []}, {"body": "Rejoice and buy in", "score": 0, "replies": []}]}
{"title": "Another rough day ahead", "selftext": "Stick to the sidelines or buy some vix related instruments.", "id": "3zpb82", "created_utc": 1452077270.0, "score": 15, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "[deleted]", "score": 4, "replies": [{"body": "How is it killing demand? Thanks ", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": []}]}]}, {"body": "Can someone explain to me why the fall of oil drags down the entire market?  Wouldn't lower energy prices imply more discretionary income for consumers and companies alike to spend?  Other than the oil companies themselves who is complaining that gas prices are low?  I am missing the connection between cheap energy and a triple digit drop in the DOW.  ", "score": 3, "replies": [{"body": "You'd have to seek out the Oracle of Omaha to fully explain... But the simple reasons are because it signifies growing fear of where global economies are headed, means an increase in layoffs/unemployment for a large sector, decreased production/spending within that sector, and so on. \n\nIn the end it is a net positive for the economy as a whole, with the oil industry being pretty much the main loser... BUT the effects within the energy sector are also quicker to see on paper than they are through the economy.\n\nAnd as for today, it was a combination of things to start the day down, oil was just a part of the reason (for once). And obviously closing down likely around -300 makes for a bad day, but if the payroll #s released today weren't good we'd probably be at -400. Think positive haha.", "score": 3, "replies": []}, {"body": "Not every single stock dropped, just a lot of them.\n\nMaybe you're onto something; when oil prices are lower, what types of companies will save money on gas? Also, what types of companies are less desirable. \n\nLastly, price of oil is just one of those things people use as a gauge. If we all had a \"perfect\" gauge we'd be loaded. ", "score": 2, "replies": []}]}, {"body": "China markets rallied today,  what's the reason for the pre market fall", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I thought University of Cleveland showed in a study that there was no correlation between the price of oil and the stock market, yet everyone seems to quote oil prices as the reason for decline in these subreddits. ", "score": 3, "replies": [{"body": "What is there basic reasoning behind that? Tons of businesses operating costs are heavily influenced by the cost of oil. ", "score": 5, "replies": []}]}]}, {"body": "https://twitter.com/stlouisfed/status/684120971750563841", "score": 1, "replies": []}, {"body": "That's probably superficial as the Chinese government always shores up the market after large drops. We saw it back after the drop in June.", "score": 1, "replies": [{"body": "I was watching china's market last night and saw Taiwan heavily down, Hong Kong heavily down, but China was green across the board.  That does not happen without heavy state intervention.  China did NOT recover last night, it was artificially propped up.", "score": 2, "replies": []}]}, {"body": "That's probably superficial as the Chinese government always shores up the market after large drops. We saw it back after the drop in June.", "score": 1, "replies": []}]}, {"body": "I missed buying some weekly GOOG calls at the open... woulda been a quick 100%, as the stock rose rapidly from the opening low... Oh well.  The 740 strike was as low as 3.50 and went up to around 8.50.", "score": 1, "replies": []}]}
{"title": "What companies/stocks are decoupled from China and have the best potential to weather the storm of China's slow crash?", "selftext": "With the downturn of the Chinese economy slowly rearing its head I was looking into what stocks don't have a lot of business/assets tied up in the Chinese economy. I think investing in these companies could be stable in the future. Does anyone have any good picks or recommendations? A lot of my research only pointed me to companies not to buy since a good amount of their revenue came from China. Thoughts?", "id": "3zrvg7", "created_utc": 1452114955.0, "score": 14, "upvote_ratio": 0.94, "num_comments": 17, "comments": [{"body": "Off the top of my head:\n\nFacebook, Amazon, Google - Not much China exposure\n\nApple - I think the benefits of a weak yuan help their manufacturing costs more than it hurts their sales. Warning, this is a purely qualitative analysis.\n\nMost of the affects are probably priced in already, though.", "score": 4, "replies": [{"body": "I manage procurement for a tech company and I've driven down costs recently due to the RMB devaluing. ", "score": 2, "replies": [{"body": "Do you think companies that manufacture a lot in China, but don't sell there (as a large part of their revenue), will benefit?", "score": 1, "replies": [{"body": "My company's revenue into China is sub 10%. Just one example is I've received 1% reduction in Q3 last year with a specific supplier on all purchases from them, benefiting 0.1% of overall COGs. Doing this with multiple suppliers can add up to a measurable contribution to the bottom line. \n\nHowever, it is not straight forward on how the RMB devaluation benefits China based manufacturers. Many manufacturers are Taiwan based corporations with factories in China. Depending on how good their relationship is with customs and the government influences how their supply chain needs to operate. Also, which portion of the materials are purchased in USD (imported into CN) vs. domestically in RMB is a factor. Some can go as high as 60-70% imported which the RMB FX change has no benefits to them on. \n\nIt can always go the other way because you may end up with agreements with suppliers on FX change triggers and your cost basis may go up if the rates go the other way. ", "score": 2, "replies": []}]}]}, {"body": "Yeah I think a lot of the big tech stocks are relatively safe. Apple is the riskiest but for more reasons than just China. I feel like Facebook is such a juggernaut and the most reasonably priced out of those three. Should probably just buy into it but I want to see if it'll dip below 100 again.", "score": 1, "replies": [{"body": "Could you elaborate on the other reasons?", "score": 1, "replies": [{"body": "IPhone 6S sales seem to be lower than expected based upon less product being moved to stores and commissioned to be built. Phone case manufacturers are also reporting lower numbers of cases being sold than for previous IPhone releases. This is also coupled with growing negative sentiment toward the stock from wall street as some people/companies begin to find their contintual growth hard to keep up as recently proven from their first break in trendline ever in December. Not all of this is related to China.", "score": 1, "replies": []}]}]}, {"body": "I would agree with all of those minus AAPL. Apple is heavily banking on China and to a lesser degree India for growth. If those dont come through, Apple stock would continue to bleed as growth prospects diminish. People are holding Apple because of CHINA GROWTH and the possibility if them finding the next \"big thing.\" China is the main reason to even own Apple right now.\n\n Apple's market cap has fallen nearly 100 Billion dollars month to date alone on China fears.", "score": 1, "replies": [{"body": "I agree that is where people expect the growth. It will come, just not as fast as was hoped. The value is still incredible though. The dividend should keep growing and buyback a should continue. The p/e ratio is still well below average.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I haven't thought about how the price of manufactured goods will decrease. I wonder if it is enough of a decrease to balance out potential loss of sales in China. If the company sells there of course.", "score": 1, "replies": []}]}, {"body": "Altria went up today...", "score": 3, "replies": [{"body": "What is Altria? Why are they a good pick?", "score": 1, "replies": [{"body": "Ever heard of... Marlboro cigarettes?", "score": 3, "replies": []}]}]}, {"body": "Healthcare names, although they may run into continued issues with the election and political games. ", "score": 1, "replies": []}, {"body": "Telecoms are usually the best for weathering a storm. Check out T and VZ, for example.", "score": 1, "replies": [{"body": "Why are they the best for weathering storms? ", "score": 1, "replies": [{"body": "You tell me.. if the markets are performing poorly and you, as a consumer, are strapped for cash, would you push off buying a car or going out to eat, or would you cancel your cable or phone?", "score": 1, "replies": []}]}]}]}
{"title": "Sold KMI, now accumulating NFLX", "selftext": "Last week I posted all in on KMI, made out with a couple hundred bucks. Now, time to play with NFLX until after earnings.\n\nWho's ALL IN on Netflix?\n\n", "id": "3znkkq", "created_utc": 1452046164.0, "score": 4, "upvote_ratio": 0.7, "num_comments": 20, "comments": [{"body": "NFLX will allow you binge watch your losses with out commercial interruption.", "score": 11, "replies": [{"body": "Meh, i'll have enough money to pay people to watch me.", "score": 1, "replies": [{"body": "I was wrong... at least for today... good lord what a move...  I still think this thing is going to crash hard but if you were long going into today congrats.", "score": 1, "replies": [{"body": "Made 5 grand just fyi\n\nEdit:\n& yes I closed my position. \nedit: \nI closed it at 15. now it's at 16. now gonna count my losses, but i could have made more money. oh well.", "score": 1, "replies": []}]}]}]}, {"body": "> all in\n\n&nbsp;\n\n>made out with a couple hundred bucks\n\n&nbsp;\n\nand *of course* there's no DD or reason for buying up NFLX in the post.  \n... looks like a solid buy. convinced me.", "score": 4, "replies": [{"body": "I like the \"accumulating\" part of the post. Like the guy is loading thousands upon thousands of shares. ", "score": 4, "replies": [{"body": "y u hatin dawg?\n\nim just trying to sound wall street", "score": 1, "replies": [{"body": "That's what I do when I get jealous. ", "score": 1, "replies": [{"body": "hey man..\n\nit's okay. next time i spend money, i'll think about you.", "score": 1, "replies": [{"body": "That's all that matters. ", "score": 1, "replies": [{"body": "<3", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": ">made out with a couple hundred bucks\n\nOP is [this](http://www.sixminutes.ca/wp-content/uploads/2014/02/Business-Baby-Original.jpg) you?", "score": 3, "replies": [{"body": "Except i don't eat by myself. My mommy still feeds me.", "score": 1, "replies": []}]}, {"body": "Double down on KMI", "score": 1, "replies": []}, {"body": "no dd, buy the dip. solid strategy, bound to make money! don't forget me when you're on your space yacht", "score": 1, "replies": []}, {"body": "You Pussy. Amazon prime video is going to destroy netflix.\n\nI own KMI and i doubled down. Don't be a pussy. Sell netflix and buy KMI back.", "score": 1, "replies": [{"body": "Sike, I wont be buying KMI again until it's back down in the 14's.\n\nAnd it looks like it almost is.", "score": 1, "replies": [{"body": "KMI warrants, trader's dream right there", "score": 1, "replies": [{"body": "KMI is reaching 13 this week and then i'll buy again and sell around 14.5.\n\n", "score": 1, "replies": [{"body": "But the warrants for an easy double", "score": 1, "replies": []}]}]}]}]}]}
{"title": "#thoughtsandprayers - RIP NFLX puts", "selftext": "[deleted]", "id": "3zqyx1", "created_utc": 1452103396.0, "score": 11, "upvote_ratio": 0.87, "num_comments": 9, "comments": [{"body": "NFLX has that look again. Watch it go another 5% tomorrow, and the day after, and the day after... ", "score": 10, "replies": []}, {"body": "NFLX added 130 new countries. jesus, I can finally watch netflix without VPN in Korea", "score": 7, "replies": []}, {"body": "Glad I yoloed out on the call side yesterday...0____0", "score": 3, "replies": []}, {"body": "https://twitter.com/netflix/status/684793693551771648", "score": 3, "replies": [{"body": "[**@netflix**](https://twitter.com/netflix/)\r\n\r\n> [2016-01-06 17:48 UTC](https://twitter.com/netflix/status/684793693551771648)\r\n\r\n> … Netflix is now global. \\#NetflixEverywhere\r\n\r\n----\r\n\r\n^This ^message ^was ^created ^by ^a ^bot\r\n\r\n[^[Contact ^creator]](http://np.reddit.com/message/compose/?to=jasie3k&amp;subject=TweetsInCommentsBot)[^[Source ^code]](https://github.com/janpetryk/reddit-bot)\r\n", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Interesting move. I like the idea! Good luck on that.", "score": 2, "replies": []}, {"body": "After the spike? I really like the move. ", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Looks like a solid chance to sell some OTM weekly calls too. \n\nI agree we saw the spike, and now back to the broader market induced slide.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I don't know I think people are getting out of their positions in cyclical equities and dumping it into Amazon/Neflix  because of their performance last year. Not sure if the pressure will cease and let it fall, reach an equilibrium and go sideways, or build and just have it decline slower (like the countercylicals).  ", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Were the doomsdayers right?", "selftext": "During the last 6 years of this bull market, there has been a dedicated group of people that constantly said that once the Fed raises interest rates from their historic lows that the market would soon crumble.\n\nWell, it hasn't even been two weeks since Yellen announced a quarter % rate hike, and the S&P is already down 3%. Anyone have any thoughts on this?\n\n", "id": "3zrhr4", "created_utc": 1452110093.0, "score": 3, "upvote_ratio": 0.6, "num_comments": 12, "comments": [{"body": "market crumbling isn't really the same as being down 3%... so for now, no, the doomsayers were exceptionally wrong for 6 years and continue to be wrong now. if this is \"doomsday\" then it's pretty weak sauce.", "score": 14, "replies": [{"body": "So what your saying is I need more leverage", "score": 1, "replies": [{"body": "What he's really saying is that he doesn't know", "score": 2, "replies": [{"body": "yeah, i can't see the future, only the past.\n\nfunny how many people pretend to see both.", "score": 3, "replies": [{"body": "i could see my future if it was a little more bright", "score": 1, "replies": []}]}]}]}, {"body": "There is deterioration in the macro environment, though. The doomsayers have been wrong for six years, but at some point, they may end up being right. ", "score": 0, "replies": []}]}, {"body": "I'd be surprised if they had any money left from shorting the market the last 6 years. Or do they not put their money where their mouth is?", "score": 4, "replies": []}, {"body": "I'm a doomsayer but I dont think credit rates a big deal. Im going for a crash mid summer.  Couple people did a reminder on me so I hope I dont disappoint. Either way, gonna be a fun year. ", "score": 2, "replies": []}, {"body": "The rate hiking cycle is partly to blame because it has strengthened the dollar compared to EUR and JPY and killed the global competitiveness of the US economy. This is because of divergent monetary policy between the Fed and ECB/BOJ. There is nothing wrong with a rate hike per se - there is just a problem hiking rates when other major economies are moving rates in the opposite direction. The big fall in the oil price (and underlying China fear) is the other major factor driving down the S&P at the moment.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I don't really know anything about how you trade but on fundamentals I think a lot of this has already been priced in. You have probably already missed the \"meat in the middle\" for long USD short EUR/JPY trades. If you think the Fed will hike faster than what the market thinks (I don't with oil plummeting) or the EUR/BOJ will print more money there is some scope for you to trade. ", "score": 2, "replies": [{"body": "I think Fed will hike way slower than it says. The Economist has actually been predicting the Fed may have to reverse course and lower rates like our Japanese and some of our European friends have had to do before. With oil only dropping further, and El Nino neutering gas's contribution to price inflation, falling commodity prices, etc., we are in serious risk of deflation. \n\nThe original drop in oil price is supposed to be wrinkling out of the figures right around now (since it dropped last year, and inflation is measured on a yearly basis, we are nearing the point where the deflationary effects of the initial drop is supposed to disappear from the statistics). Part of the reason they raised rates was to stop folks from panicking when the next inflation figures were supposed to pop. My crystal balls tell me that those figures are going to disappoint enough to stop the Fed from raising rates more than once more this year, but not enough to reverse course. ", "score": 3, "replies": []}]}]}]}, {"body": "Every bubble quivers before it pops. ", "score": 1, "replies": []}]}
