{"title": "Tesla First $10T Company Ever", "selftext": "", "id": "19cieh9", "created_utc": 1705883120.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 72, "comments": [{"body": "My problem with Elon is not if he deserves another compensation package. Of course the man deserves it. Only envious people think the opposite.\n\nMy problem is,  Elon coming in public, discussing this topic and going beyond, threatening Tesla and all it's shareholders. What he did is not only childish but very very unprofessional. He should keep this discussion within the domain of the board.\n\nI'm a long term Tesla investor, but i'm losing my patience with Elon. The man is going nuts.", "score": 24, "replies": [{"body": "I am  shorting tesla , but I do my research ,and according to me after understanding him enough ,Elon musk is a **blowhard** ,if you read his biography ,you will understand , it either gives him free coverage or hate, you can read .\n\nHe is  a same person , the only thing is he has become vocal about it.\n\n&#x200B;\n\nElon is going to get  another compensation package ,mark my words , as soon as he won the court case.\n\nHe didn't threaten shareholders, his intentions were look Tesla is getting bigger and bigger , by going to unknown domain , I can't sleep peacefully ,coz I fear ,I will be ousted if some evil person came , so I need some security ,so that I can't be ousted by minority of board members, by going  through his past experiences , I would do the same .\n\n>but I'm losing my patience with Elon. The man is going nuts.\n\nnah you are hearing too much lies from media, and it's started to bother you ,don't worry just relax,\n\nand he is not going nuts.\n\nAnd Elon musk is the best person for any board, he is a literal slave , he is giving his 100% for free , that guy doesn't go to vacation, doesn't have outside life, is a big calculative risk taker, and most loyal to tesla  , board would rather force him to work till his death , like an slave , tesla is not going to get another person like that, **board is sucking his life.**\n\nif tomorrow board fires him ,he is going to keep his shares, but will not work like slave for them ,instead he will be a slave to another company , and their no positive from it , board biggest asset is Elon .", "score": 3, "replies": [{"body": "100 nice to see a true post", "score": 1, "replies": []}]}, {"body": "Yeah, that's one way to think about it.\n\nThe other is that this is the best, startegic way to put pressure on the board. That said, he seems to have a good relationship with the board so i'm not sure if he was actually trying to pressure them.\n\nIt's also possible that he and the board have more or less already agreed to another compensation package and Elon's Tweet is meant to sow the seeds in the general public/retail investors in order to garner more support for it. Like it's probably better for him to explain why he deserves another $35B before it goes to a shareholder vote than after, or am i wrong?\n\nAnyway who knows. When i read that Tweet my initial thoughts were \"well why wasn't he concerned about this 25% ownership stake when he sold $20b+ to buy Twitter?\".\n\nBut i also don't think he was actually threatening to leave Tesla. Tesla is like his child, he's said this multiple times. I think he's probably more confident now than ever in FSD/Optimus/Tesla's AI dominance which is why he's trying to get more ownership. Perhaps he wasn't as confident when he bought Twitter.\n\nBesides, even if Elon left Tesla i personally believe the progress on these things would continue. As so many $TSLAQ have pointed out over the years, the bulk of the work being done at Tesla is not by Elon himself. While he is at the top of the pyramid, the work and progress there is being accomplished by the thousands upon thousands of engineers, many of whom are absolutely brilliant.", "score": 1, "replies": [{"body": "Oh man, you are making too many twists to justify Elon's behaviour . I don't care the reasons to why he made those tweets.  I don't even care the fact that he replied to another tweeter. Whatever the reasons, what is not acceptable is bringing this to the public. There is nothing, literally nothing that justifies bringing this to the public discussion, unless you want to bring the stock down and create more FUD. As i said very unprofessional. In another company the CEO would be fired immediately. \n\nTo be honest i'm not ready to give a pass to everything Elon does. Maybe this is because i'm not a fan boy. I recognize his accomplishments but a free pass i don't give to anyone.", "score": 4, "replies": [{"body": "I'm not trying to justify his behavior. I'm simply thinking of explanations and trying to be realistic.\n\nThe people that are trying to turn his comment into a threat about him leaving are, in my opinion, being irrational and panicky.\n\nAlso, it's clear from what you just typed that you think he did this to bring the stock down/create more FUD. So, while you claim to not care about the reasons why he did it - you've clearly already made up your mind as to the reason he did it.\n\nI'm sorry if the reasons i came up with don't agree with your reasons, but neither you nor i have any real way to know which of us is right, or if we're both wrong.\n\nSo remember that. While you may think you know why he did what he did, you are actually just guessing and have no real idea why.\n\nAnd you may not like that he did what he did. But he did it. It's done. You can criticize him for it but that criticism won't undo it.", "score": 1, "replies": []}]}]}, {"body": "GOING nuts?", "score": 1, "replies": []}, {"body": "Are you new here?  Elon has always sent out tweets that on hindsight are not ideal (Funding secured comes to mind).  You have to take this side of him if you want the other side which is once in a life time visionary that can execute well.  Like everyone he must get pissed off at all the negativity and shoots out a tweet in frustration.", "score": 1, "replies": []}, {"body": "Domain of the board..... they're rats \nElon did right coming public with this issue. This is all I have to say about that.", "score": 1, "replies": []}]}, {"body": "K.\n\nThis is very hand wavy analysis. I've learned from Elon that just because you start making a product (for example fsd) doesn't mean you'll execute to perfection, let alone on a reasonable time scale.\n\nOptimus will probably be even harder. So.... Assign your probabilities, do a dcf, and model accordingly", "score": 9, "replies": [{"body": ">This is very hand wavy analysis.\n\nActually i've found Camillo's thought experiment to be one of the most detailed hypothetical analytical walkthroughs of the Optimus bot that i've heard yet, from anyone - and i consume alot of Tesla content (like alot).\n\nElon's comments are actually hand wavy. When Elon says stuff like \"what does an economy even look like when you have infinite labor\", that's kind of very hand wavy and vague.\n\nBut the details Camillo provides shows to me that he's actually put alot of time into thinking about what the endgame could look like in a world where humanoid bots are actually able to do useful work.\n\nNot handwavy at all.\n\nYou can dispute the timeline, or the cost, prices, and other numbers all you wish. But the that fact he has numbers which you can dispute at all... is alot more substantive than most Optimus analysis i've seen to date. And more importantly his analysis seems to be grounded in actual, real knowledge and data from his private investments and conversations with experts. Not just internet research.", "score": 12, "replies": [{"body": "> humanoid robots are actually able to do useful work\n\n> not handwavy at all\n\nYour first statement is a huge handwavy comment.  If you take that as a given, then you can make any numbers work\n\nIt is like when he said \"FSD coast to coast by 2017!\" Then you can model any robotaxis or other such nonsense in a non handwavy way.  lol. \n\nIt is", "score": 3, "replies": [{"body": "Alright well at this point in the conversation i must admit i don't understand what you definition of \"handwavy\" is.\n\nIn my opinion, analysis based on hypotheticals is not \"handwavy\" - that's just about all investors ever do. Every single DCF is just that, analysis based on hypotheticals. Are DCFs \"handwavy\"?\n\nIf you think the model presented is unrealistic, that's fine.\n\nBut if you want to criticize his model, could you actually point to the specific parts in his model you disagree with and explain why?\n\nOtherwise i think your criticism which amounts to nothing more than \"it's handwavy\", is itself (imo) a very handwavy and vague form of criticsm.", "score": 2, "replies": [{"body": "> analysis based on hypotheticals is not handwavy\n\nFor an investor sub it sure can be if the hypothetical is ignoring reality. \n\n> are DCFs handwavy \n\nThey certainly can be...eg. Let's assume that the 4680 batteries get 10x the performance at 1/5th the cost of- now look at my model!  I did in excel and so the equations are accurate!  \n\nThere were a lot of models 4 years ago that showed how Cybertruck would dominate truck sales or semis  would dominate trucking or robotaxis would generate revenue for the owners or the solar roof would dominate solar sales.  The math work, but they just handwaved away the viability of the product.  \n\nNow we have more handwavy about AI and Optimus.", "score": 1, "replies": [{"body": "And so what exactly is the reality?\n\nAgain, you're the one being handwavy here.\n\nYou're not actually criticiszing anything specific about Chris Camillo's investment thesis. You're just saying 'well it might not happen'.\n\nDuh.\n\nBut the point of his analysis is to look at the potential in the event that it does happen.\n\nAnd if it does happen, if Tesla's bot project actually comes to fruition what would that be worth?\n\nAnd then, furthermore if his conservative estimates are at least directionally accurate... is this priced into the stock?\n\nHis entire thesis is a hypothetical and he's saying look if they do this, this is what it could be worth.\n\nIt seems like what you're saying is, \"well until they actually create a useful robot it's not worth considering what it could be worth\". Is that what you're saying? Because if it is, i think your wrong.\n\nIt doesn't cost you anything to do this analysis, and by the time Tesla actually does make a useful robot (if/when),  the investment opportunity will be too late.\n\nNow obviously his decision to invest in Tesla is predicated on his personal belief that it will happen.\n\nYou don't have to believe that, obviously. And he's not telling you to believe it. He's telling you what he believes personally and why.\n\nWhat is it you actually take issue with?", "score": 1, "replies": [{"body": "> You're just saying 'well it might not happen'.\n\nNo, I am saying no way in hell is that going to happen.\n\nThis is supposed to be an investment sub, not a fantasy sub and just because you can make an excel spreadsheet work, does not mean it is a reasonable analysis.\n\n> He's telling you what he believes personally and why.\n\nHe personally believes that based solely on the spreadsheet, not as someone who knows anything about robotics, GAI or apparently, reality.", "score": 1, "replies": [{"body": ">No, I am saying no way in hell is that going to happen.\n\nAnd why do you believe there is no way in hell it will happen?\n\n>He personally believes that based solely on the spreadsheet, not as someone who knows anything about robotics, GAI or apparently, reality.\n\nSo you didn't actually listen to the full interview did you?\n\nHe says, if i recall correctly, that he owns shares in a private robotics company. He has personal access to said company's CEO. Has had discussions with this person. Has seen real humanoid type bots deployed as pilot programs on industrial sites. And i think he mentiones being an owner/founder of a startup that has developed a humanoid type bot in the past (although it's not clearly if this is related to the private company he owns).\n\nSo are you saying he's lying about all of this, about his private investment, his contacts within the robotics industry, etc?\n\nAnd if you are, what evidence do you have he's lying? Or why do you believe he's lying? What are your credentials? Why are you, an anonymous redditor, more credible than him, a long-time investor with decades of experience who turned a $20k portfolio into over $60m?\n\nI'm listening.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I think Optimus can have some market successes even if it may not reach the lofty goals that Elon has in mind for many many years.  It does not need to be my home assistant that can handle a broad spectrum of tasks like go fetch my mail, do the dishes, water the plants, vacuum the family room, and make me a cup of coffee.  If it can be trained to handle a narrow set of warehouse like tasks but do it well, there is a lot of market cap opportunity for them.", "score": 2, "replies": [{"body": "Precisely.", "score": 2, "replies": []}]}, {"body": "It's funny because in the video Chris Camillo talks about how even alot of Tesla bulls today are themselves skeptical of the Optimus thesis. And i think you're proving that point.\n\nTo be fair, when i saw the Twitter video of Optimus folding laundry my initial reaction was unimpressed. I thought it was slow and sloppy, a 10yr old could fold a shirt more neatly and quicker than that.\n\nBut while watching this video and listening to Camillo, the thought occured to me - what will this laundry folding demo look like in 12 months? And that actually got me excited. I think in 12 months Optimus will be able to fold laundry much more neatly and quickly, and more importantly, autonomously.\n\nBut i also don't think folding laundry will be the initial use case. Folding laundry is more of a good demonstrator, in this particular case, of the hardware's physical capabilities, of it's agility, dexterity, and range of motion. Initial use cases will likely be industrial in nature, dangerous, boring, repetitive stuff. Tasks that in all likelihood will be easier to perfect than folding laundry.\n\nOf course FSD's track record isn't great. But the thing about Optimus is it shouldn't be under as much regulatory scrutiny as FSD, so i think it has a good chance of developing much more quickly. See, one of the big problems with FSD is that even if you acheieve Level 4/5 today, the big hurdle is government approval. The reason is because cars are sharing the road with you. Other humans are sharing the road with you. So safety is critical, not for the driver in the autonomous vehicle, but for everyone else not in an autonomous vehicle.\n\nBut in a factory setting things are wildly different. If you can remove all humans from a work environment and replace them with autonomous bots, there's not nearly as much risk. If a robot makes a mistake a robot is destoryed, no human lives are risked or lost. Because of that the barriers to entry are much lower. So i would take that into consideration as well. And i'm not actually sure Optimus will be harder than FSD. I think it might actually be easier.\n\nAnyway, i found the full interview very interesting.", "score": 3, "replies": [{"body": "1) FSD was meant to do 'coast to coast' autonomously in 2018. The poor performance with FSD has absolutely nothing to do with regulators. Also see Waymo and others rolling out actual 'full self driving'. \n\n\n2) In a factory doing mass production specialist machinery is preferable over a humanoid robot. The extra costs associated with making a specialist robot are amortized over all the products you make. A humanoid robot may be useful in low volume / batch production, or more likely outside of the factory environment.  \n\n\n\n\n3) A humanoid robot platform is really valuable once it can perform tasks universally with little to no task specific training. If you have to spend months or years training it to do something, you may as well just put a specialist robot arm or other existing system. But a robot that can be anywhere a human can and can quickly learn any task is really where it has value. But that is much more difficult to do than FSD. Think of the degrees of freedom of all the joints in a robot compared to a car. Think of the complexities of the world compared to just roads.  Then consider all of this has to happen on a minute power budget. \n\n\n\n\nHumanoid robots do hold great promise, and Tesla is in a good position on this in many ways. I am hopeful that Tesla will be part of the set of companies that really start to bring humanoid robots to fruition. But this is a multi decade long quest, with lots of uncertainty and competition. I'm sure Tesla will start using Optimus in some factories, or partner with a company or two in the next few years. But Optimis won't be profitable for a very long time.", "score": 4, "replies": [{"body": "Personally, i'm not that bothered by FSD. I understand it hasn't exactly lived up to Elon's hype but i still find what it can do to be very impressive.\n\nI also find the progress in FSD to be undeniable.\n\nI also think that if you wanted to run the experiment today, FSD could probably handle 90%+ of a coast to coast drive. Of course that's different than 100% without driver monitoring, but i think it's still very impressive and just a matter of time until it can do coast to coast completely unsupervised. How much more time, i don't think anyone knows to be certain. But if i had to guess it's in the vicinity of 5-10 years.", "score": 3, "replies": [{"body": "Sure, given a long enough timeline and some investment all things are possible. Doesn't mean the execution is going well and currently Musk is lacking execution on a lot of his promises.", "score": 1, "replies": []}]}, {"body": "FSD will happen, there hardly going to get 90% there and say \"Screw it guys it's too hard\" the last 10% will be the hardest but with each new version it gets closer, it's inevitable and who ever is first takes all the profits, no other company is close they will all have to license it from Tesla making them billions if pure profit.", "score": 1, "replies": [{"body": "Yes actual FSD will happen at some point, sure I'm not sure who said it wouldn't?\n\n\n\n\nWhoever gets first place takes all the profits until the rest of the market catches up. That won't be very long regardless of who gets there first. Given the state of the market today it seems unlikely it will be Tesla, but you never know! \n\n\n\n\nAs far as I know pretty much all the major automakers are already partnered with the likes of Cruise, mobileye, argo, luminar, Nvidia etc to meet their needs. Those partnerships will no doubt change, but it's very unlikely we will see monopoly where one company is suddenly leaps and bounds ahead of the rest and can control it for a sustained period. Then there will be a race to take market share, and open-source approaches like comma that can do the same thing. That will drive down prices significantly, allowing the technology to scale to the general public. Like all broadly impactful technologies it will become commoditized.At that time it will of course still be profitable but a lot less so per-unit than we may think today.", "score": 1, "replies": [{"body": "What other company has as many real world miles as Tesla? Or do you think this can be accomplished using simulated miles?", "score": 1, "replies": [{"body": "Data quality > data quantity in any ML task.\n\n\nThe amount of data Tesla has is of course a good thing, but quality is famously poor. This is illustrated by the fact that Tesla also relies upon simulated miles, the problem space is too large for anyone to record enough miles.\n\n\nModel architecture is the most important variable in getting to level 5 in my opinion. ", "score": 1, "replies": [{"body": "You are contradicting yourself within a single comment, one minute quality is better than quantity then the problem space is too large for anyone to record enough miles. Tesla will be first to FSD level 5 and they are probably about a decade ahead of the nearest competitor.", "score": 1, "replies": [{"body": "That isn't a contradiction...\n\n\n\n\nQuality > quantity, no one can collect enough data to not use simulations.\n\n\n\n\nI'm not sure how you come to that conclusion, from all the evidence I've seen they are behind in some ways and ahead in others. No one is a decade ahead, unless you're comparing to new startups or something.  But I appreciate that I work with ML and could be too engrossed in the technicalities or something! I hope you are right, the faster we get level 5 the better no matter who gets there first. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Literally that was just someone controlling the robot mostly off camera and the robot was doing the same movements as the human. As admitted by Tesla. A college robotics team could build this in a semester. They will never sell a home robot that does every day tasks. Ever.", "score": 1, "replies": []}]}, {"body": "Difference is, driving is a shitton of skills amalgamated into one, in a high-stakes, high-speed situation where any wrong move can kill someone. \n\nBot will fill roles in factories where the skill-set needed is far lower, and safety is negligible because a killed bot doesn't cause a lawsuit.", "score": 2, "replies": [{"body": "Exactly, i don't think most people have really thought about these things on such a granular level.\n\nBeing skeptical is good but when you actually think about it, this is completely different than FSD.", "score": 3, "replies": []}]}, {"body": "Seems based on the last Adcock interview Bot is happening sooner rather than later.", "score": -1, "replies": [{"body": "Where have I heard that before? Something something robo taxis? Fsd is happening next year?\n\nAnd I'm a tesla bull lol. I just think healthy skepticism is a thing too.", "score": 4, "replies": [{"body": "> I just think healthy skepticism is a thing too\n\nI agree.\n\nBut i thought this interview was notable because the person in question has a very good track record of making predictions and finding opportunities before mainstreet.\n\nHe's not just a Tesla fan that got lucky because he bought the stock in 2010, he's been doing this for 30 yrs with consistent results.", "score": 3, "replies": []}]}]}]}, {"body": "None of this matters if Elon wants to take Ai and bot Away from tesla.", "score": 11, "replies": [{"body": "When Elon talks about possibly not being comfortable helping Tesla develop AI, he isn't saying he is going to shut down Tesla's AI/bot programs. He is saying he might stop being Tesla's CEO and Tesla would have to develop those products without him.", "score": 8, "replies": [{"body": "That might actually be better", "score": 0, "replies": []}]}, {"body": "If apple can make $300 million in 30 mins selling VR headsets. These numbers are easily attainable by tesla for a humanoid robot that can sweep floors and fold clothes. You think they can’t? It uses the processing of a model y.", "score": 1, "replies": [{"body": "We already have vacuums to sweep floors lol", "score": 4, "replies": [{"body": "We already have monitors you can press into your face too 😂. Stupid eh?", "score": -3, "replies": []}]}]}, {"body": "Which is why he's asking for more ownership, right? Think about it...", "score": -8, "replies": [{"body": "He shouldn’t put the board in this position", "score": 19, "replies": [{"body": "This earnings call may be dramatic if Elon decides to use it to make his case (and his threats).", "score": 7, "replies": []}, {"body": "Why not? What position should he put the board in? Do you think it's unreasonable for him to want another compensation package?", "score": -9, "replies": [{"body": "He owns something like ~12% of Tesla, if he truly believes he can make it a $10T company he would personally be worth $1.2T. That is plenty of reward and motivation to keep him working.\n\n\n\n\nInstead he wants shareholders to essentially gift him ~$100B because of his decision to sell shares to buy Twitter. Not only that but he is threatening to take potential value elsewhere (to xAI).The board would surely be opening Tesla up to the mother of all lawsuits from other shareholders if they accepted, at the detriment of Tesla. Most CEOs would be fired on the spot for saying something so ludicrous.", "score": 13, "replies": [{"body": "This is not accurate.\n\nHere is a more accurate analysis:\n\n[https://twitter.com/SawyerMerritt/status/1747292901904630203](https://twitter.com/SawyerMerritt/status/1747292901904630203)\n\nEssentially he owns 12-13% outright in shares, and an additional 10-11% in yet-to-be-excercised stock options. Excercising those options will however incur taxes, which would likely bring his net ownership to something just under 20%.\n\nSo what he's really asking for is something on the order of an additional 5% of the company which, at today's valuation, is more like $35B.\n\nNow, in fairness $35B is alot of money. Probably more than any other individual Fortune 500 company CEO has ever been awarded in the form of compensation.\n\nHowever, if a new compensation package were crafted similar to the old one, where portions of his compensation were awarded for various milestones which were directly tied to the performance of the stock - i don't see what the issue is.\n\nWould you really have a problem awarding Elon Musk another 5% of Tesla, if the requirement for that 5% award was that Tesla's Market Cap first reached/exceeds $5 trillion?\n\nI wouldn't.", "score": 6, "replies": [{"body": "He has a rather good track record of hitting his performance objectives.  This sounds like a win/win to me.", "score": 1, "replies": []}]}]}, {"body": "I’m pretty sure he’s more harm than good right now.  He’s not earning what he’s making.", "score": 0, "replies": []}, {"body": "He cost tesla hundreds of billions with dumb tweets and antics and could be fired.", "score": 1, "replies": []}]}, {"body": "The board was likely going to capitulate to his demands anyway, that's probably why he felt comfortable sharing them publicly. Of course now there's increased visibility and criticism so they may actually back off a bit and give a better deal to shareholders. Which would be kind of funny: Elon shooting from his hip again will have some negative affects for him financially.", "score": 1, "replies": []}]}]}]}, {"body": "I haven't watched alot of videos from this Youtuber except for a couple recently.\n\nThis video features an interview with Chris Camillo, an investor who is (apparently) \"famous\" for turning a $20,000 investment porfolio into more than $60,000,000 over a roughly 16 year period (iirc).\n\nI've watched about 20 minutes so far, and big takeaways are:\n\nChris Camillo's investment thesis is centered around the Optimus Humanoid Bot.\n\nTesla's development of the Bot is happening faster than he had anticipated.\n\nHe currently has about 5% of his portfolio invested in $TSLA, but has not yet put on his Humanoid Bot investment.\n\nCamillo expects to make his Humanoid Bot investment in $TSLA over the next 12 months.\n\nHe plans to put about 20-25% of his total portfolio into $TSLA when he finally does make his investment.\n\nHe's sees $TSLA as in the lead, far ahead of anyone else.\n\nHe anticipates start of production/sale of bots for industrial/commercial applications to begin in 2027.\n\nLots of other interesting little bits of information from the interview so far.", "score": 6, "replies": []}, {"body": "$10T would be roughly $3,150 per share.\n\nIt would also make them roughly larger than Apple, Microsoft, Google, and Saudi Aramco **combined**. That’s a tall order for any forecast to make.", "score": 4, "replies": [{"body": "In 2003, Apple had an approximate market cap value of $8 billion. In 2013, that figure had grown to $500 billion, it's now $3T, Apple could be worth $8T, Microsoft $6T by then etc etc. It's not going to happen this year or next but the trajectory is in that direction long term if they execute as they have been doing.", "score": 2, "replies": []}, {"body": ">It would also make them roughly larger than Apple, Microsoft, Google, and Saudi Aramco   \n>  \n>combined\n\nToday.\n\nBut what about their combined market cap 5-10 years from now?\n\nAlot of people think only in present terms, not realizing that the long term compounding effects of inflation are one of the driving reasons for stock market returns.\n\nEven if Apple sales volumes were flat for the next 10 years, if the price of their I-Phones (and all other products) appreciated by the 2% annual compound inflation avg, you're looking at 22% revenue growth over that period of time - just from inflation.", "score": 1, "replies": [{"body": "Their combined market cap in 10 years might be lower homeboy", "score": 1, "replies": []}]}, {"body": "he should've just said $100T it makes no difference when both are pure ludicrous", "score": 1, "replies": []}]}, {"body": "Chris Camilo looks high on NFTs", "score": 3, "replies": []}, {"body": "It took about 3 years from announcement to delivery of a pick up truck for a company already shipping millions of sedans and SUV's.\n\n\nAnyone holding out for AI cyborgs to come any time soon is delusional.", "score": 0, "replies": []}, {"body": "sort worthless beneficial smell materialistic ten shy six ruthless combative\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -2, "replies": [{"body": "You should watch the video. There are tens of millions of unfilled job vacancies in the US alone. It’ll be years before humanoid bots need to displace anyone.\n\nThe benefit to society is immense, so there’ll be little pushback. Businesses will want them because it increases productivity and the bottom line. Government’s will want them because it helps grow the economy and increases tax revenue as there’ll likely be a bot tax.\n\nYou always get a few idiots opposing new technology but you can’t fix stupid.", "score": 1, "replies": [{"body": "Exactly. The last bit about Elon's constant tweeting re:birth rates actually makes so much sense even if it seems like a conspiracy theory.\n\nMany western countries are and have been experiencing declining birth rates, birth rates are below replacement in some developed countries, and this is a problem.\n\nIn the USA there are still nearly twice as many jobs being offered as there are unemployed persons looking for jobs, meanwhile the unemployment rate is at a multi-decade low.\n\nThe current president is welcoming illegal immigrants into the country with open arms, does anyone really think this is a coincidence?\n\nUnion membership has been declining for decades.\n\nThere's simple not enough workers in many sectors of the economy.\n\nBots are a pretty good solution.", "score": 1, "replies": [{"body": "sugar jellyfish subsequent marry shrill squash scale advise consider innate\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": []}]}, {"body": "combative seemly salt jellyfish squeamish exultant cough unused swim subsequent\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": [{"body": "Your reasoning is incredibly flawed. Do you not understand that productivity gains is the way that economies grow? And is what has raised the majority of people in the world out of extreme poverty? Are you a Luddite? Do you want technology to stop advancing?\n\nAs for not displacing jobs, the point is that there are millions of unfilled vacancies in the US alone. It’s not a case of better pay, there literally aren’t any people to fill the positions. Eventually robots will displace most jobs, but we’ll have UBI by then.", "score": 0, "replies": [{"body": "treatment gaping enjoy shocking many worm reply sip outgoing slimy\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 0, "replies": []}]}]}]}]}, {"body": "I think investors (myself included) have a tendency of pulling catalysts from waay into the future closer, due to impatience. It's quite frustrating to watch as a long term investor. Seems so frustrating to get all excited for pies in the sky or get dragged down by the slightest bullish development. \n\nUseful humanoid-like robots being used on a massive scale is more or less a certainty. It's a question of who gets there, when they get there and how fast they can scale.  Throwing out trillions here and trillions there like Tesla is going to provide the whole world with robots is delusional. \n\nSeems to me Camillo thinks this will be some singularity moment for Tesla and it's share price. There will be a long development process, testing internally, production-line development, scaling and the issues that comes with, as well as several competitors. \n\nAny meaningful progress on Optimus will also be baked into the share price, setting the stock up for potential hard falls if they go off track.", "score": 1, "replies": [{"body": "I find this interview interesting mostly because Chris Camillo is saying these things, as opposed to for example Warren Redlich or some other long-time Tesla bull.\n\nChris Camillo has a good track record and a long history of finding opportunity. So i think that's notable. And he's right in the interview. Alot of replies in this thread are Tesla bulls that are themselves apparently skeptical about the Optimus bot.", "score": 2, "replies": []}]}, {"body": "this guys an idiot. none of the stuff hes saying even elon can confirm will happen they are just trying to make it happen. its not like they have the blue prints and secret recipe for AI robots, fsd and robo taxi hidden away somewhere amd are just sitting on their hands because they are too busy. Its all speculation. They are trying create it from the garbage that currently exists. Only credit is they are trying. failed deadlines on fsd to lure customers in then they scrapped the entire script recently and went with video learning. The same code they were using before was the same time elon was saying Fsd would be ready soon for robo taxi and robots, now they scrapped all that code. They are literally winging it. Plus the level of AI needed to undeniably pull this kind of tech off is super human level we are talking about self driving and autonomous robots!!!", "score": 1, "replies": [{"body": "but what if they do?", "score": 1, "replies": []}]}, {"body": "How could a company grow so much and expect to maintain the PE ratio of 80? High PE ratio like that is only possible because you have a high expected growth. Once you're a company with $129B in revenues, your growth is capped.", "score": 1, "replies": [{"body": "Did you listen to the interview? His estimate was only based on 1.5m robots generating annual recurring revenue.\n\nYou can debate if his monetization model is correct or not, or what the ideal commercial application is and so forth but 1.5m units is not alot considering the premise is that they make a bot that can actually do useful work.\n\nI mean just tell me what you think the demand is if Tesla makes an actually useful product?\n\nHow many bots do you think they could sell? Because i think it's alot more than 1.5m/year...\n\nIf Robots can do human labor, how many bots do you think could be deployed globally? And how many years do you think they will work before needing to be replaced?\n\nOver the longterm, the replacement rate will put a floor on sales at a fraction of the fleet.\n\nAnd then there's monetization.\n\nSurely Tesla doesn't just sell you the bots and that's it.\n\nThere will be specialized software.\n\nIf you want a bot to replace hospice caregivers, that bot doesn't need to know hot to operate a metal furnace for example.\n\nAnd will the software be a one time purchase or monthly/yearly subscription? I'm leaning on a form of subscription.\n\nSurely if Adobe Photoshop can charge customers $250/year in subscription fees then Tesla could ask for at least that much (per month) for a machine that saves a business $20k-$40k/year in wages.\n\nI really agree with Camillo here when he says he's being conservative.\n\nOf course all of this hinges on the product being viable.\n\nBUT IF Tesla makes a viable product... it's like Robotaxi x100 in terms of potential.", "score": 1, "replies": []}]}]}
{"title": "Tesla Full Self-Driving Beta 12.1.2 Driving through the Rain at Night in San Francisco", "selftext": "", "id": "19cnvle", "created_utc": 1705899864.0, "score": 64, "upvote_ratio": 0.83, "num_comments": 70, "comments": [{"body": "Very impressive.\n\nThe autowipers seem to be still shit tho'  :-D", "score": 17, "replies": [{"body": "I'm an engineer. If I worked at Tesla and drove my Model Y, I would reach out to the team and poke fun of them every single day.  I can't believe how shitty the auto wipers are.  It massively detracts from the experience of the car, and it's just embarrassing that a company that has achieved so much can't figure this small thing out.", "score": 1, "replies": [{"body": "Think of all the R&D money Tesla will have to spend to do what a simple rain sensor could do.  Absolutely defeats the point of this cost savings in production.  Just another example of Elon doubling down on a problem just because he came up with the solution.", "score": 1, "replies": []}]}]}, {"body": "Does anyone know if he taps the accelerator at stop signs. If not, then this is BEAUTIFUL!!!!", "score": 6, "replies": [{"body": "He says he didn’t but there was a comment from another person supposedly with v12 that said they did press the accelerator a couple times on one of their drives ", "score": 9, "replies": [{"body": "Its Omar, he also has a can bus injector to stop nags.\n\nI'm amazed he has a model S - I thought he was raising funds for a cybertruck too...", "score": 1, "replies": []}]}]}, {"body": "I’m shocked by how good this is. I’m starting to think that Tesla’s bet on this new approach was the right move.", "score": 31, "replies": [{"body": "At this point its good enough that videos like these don't really show improvement, you would have to look at statistics. If you have a disengagement every 100 miles, then there is a good chance you won't see any in a 20min drive but it isn't fully self-driving due to having disengagements every now and then.", "score": 17, "replies": [{"body": "this is the website to see the real statistics on FSD improvements: [https://www.teslafsdtracker.com/](https://www.teslafsdtracker.com/)", "score": 2, "replies": []}]}, {"body": "Only problem is you can't trust WholeMars videos, because he openly acknowledged that he cherry picks the best drives to post. I try to keep my excitement in check until I see drives from other sources.", "score": 39, "replies": [{"body": "Chuck Cook is the one I watch the most.  Seems balanced and enthusiastic about it.", "score": 21, "replies": []}, {"body": "I’m sure he does but every move in this video is significantly smoother than v11 and this new system just started. It’s been a while since I’ve felt bullish but I’m sleeping well tonight.", "score": 18, "replies": []}, {"body": "Yeah if you trusted these videos FSD was perfect and production ready 2 years ago. It is hard to see any real improvement when it has had supposedly perfect drives last 2 years and arguments for improvement are always \"it feels smoother\". I like most the videos that show what it can do now that it could not do before because in that case progress is easy to measure and see.", "score": 2, "replies": []}]}]}, {"body": "I'll believe it when I see it work in Ohio. Every new release, it works flawlessly for Omar, then my car has trouble stopping for stop signs or turning right 😂", "score": 6, "replies": [{"body": "Right?! Why is it we cannot get Omar's version! ", "score": 1, "replies": []}]}, {"body": "Question: if you pick a random road from a decent sized city in Europe will tesla FSD still perform as good as in the video?", "score": 4, "replies": [{"body": "It should, but as a practical matter it probably wouldn’t.\n\nThat is one key to Tesla’s approach - right or wrong - is to not be dependent on any type of map data, HD LIDAR pre-scanning of an area, etc.  But visually roads look different - for example, left-drive countries.  Given that this net is all video trained, I don’t think it would do so well in England.", "score": 3, "replies": []}, {"body": "I think driving in (western) Europe is easier because of better road design, but the system isn't trained on European roads, so it probably won't work", "score": 2, "replies": []}, {"body": "It should. Im from Europe, and our roads are not as advanced as the us roads. We dont have that many Lanes, Signs ect.\n\nProblem is, the EU won't allow this software. EU are making ai laws, yet we dont have a single company developing ai. China and US are ass whooping us.", "score": 1, "replies": []}]}, {"body": "I wouldn’t trust mars catalog to be honest about anything related to Tesla.", "score": 4, "replies": []}, {"body": "But but but Mercedes is lvl3, Tesla is so far behind, they will never solve autonomy!", "score": 21, "replies": [{"body": "![img](emote|t5_n9evv|3981)➡️![img](emote|t5_n9evv|3863)", "score": 4, "replies": []}, {"body": "It is accurate to say that after who knows how many \"rearchitectures\", how many \"massive improvements\", at least one \"FSD investor day\" including a \"Robotaxi 2020 claim\"... that I have still never once been able to read in my moving car for 10 minutes as it drove me anywhere and do not expect this latest \"lots and lots of words that mean 'my car still can't drive me safely around while I read'\" will change that.\n\nCall me when my appreciating asset is appreciating.", "score": 7, "replies": [{"body": "If there's something better, let me know and I'll buy it.", "score": 5, "replies": [{"body": "\"Nothing is better\" does not matter when \"nothing is good enough.\" \n\nIf you have RSI issues in your hands and arms: buy FSD. You have to pay attention to more things (all the things you previously paid attention to, plus what the car is doing ... literally N+1... I own FSD, it is more mentally stressful if you are doing it right) but you don't have to hold the wheel that often and its great if you have RSI issues.\n\nBut if you want to read on the expressway, or your commute to work. Your money cannot buy that yet. Well ... I suppose the Mercedes L3 system on locked up expressways can let you read outside the US... but it's really restricted in that it's under 40mph and is also is lame.\n\nIf FSD is some \"I love that I don't have to touch the controls and my car moves and I wanna be responsible for intervening when my 5000lbs robot tries to kill someone\" thing to you then buy it! \n\nBut it's not currently useful unless you have physical issues holding the wheel or working the pedals.\n\n(Insert all the crazy claims over the years here as gut check on future claims. Fool me once. I own this useless thing)", "score": 2, "replies": [{"body": "FSD does more than 80 percent of my driving with minimal intervention and I'm happy with that.", "score": 0, "replies": [{"body": "Sure. Your car does more than 80 percent of your physical driving. If it's doing more than 80 percent of your mental driving then you are likely not adhering to the FSD terms of service. I wish you the best. Try not to let any pedestrians be killed.", "score": 3, "replies": []}]}, {"body": "I could read for 10 minutes if I wanted to in my 2017 X, so if that's your silly metric for success, then Tesla passed it long ago.", "score": 0, "replies": [{"body": "You are against the terms of service as you do that. And I encourage you to do not do so. The car will kill you. I want you to live.", "score": 3, "replies": []}]}]}]}]}, {"body": "Did Mercedes also publish cherry-picked video to pump up stock price", "score": 0, "replies": [{"body": "Tesla didn't publish this video, and Omar has no ability to move the stock price.", "score": 3, "replies": []}, {"body": "Mercedes went far ahead of this. They cherry-picked roads and circumstances, so that you could cherry-pick video parts while driving cherry-picked roads under cherry-picked circumstances. Yeah, they definitely far ahead in that regard.\n\nAs for pumping, I have no idea what are you talking about", "score": 2, "replies": []}]}, {"body": "I know you are being sarcastic but you are actually right.", "score": -9, "replies": [{"body": "you sure about that one bro?", "score": 8, "replies": [{"body": "Actually I am not, I own Tesla and also\nA few LiDAR stocks so I posted that above based on Very limited understanding. Though the consensus on many non-investor subs believe LiDAR to be the way. Idk for sure obviously.", "score": -1, "replies": [{"body": "yeah nobody knows “for sure” at this point. but given that this particular footage seems to be on par with where cruise and waymo are at, it looks like they’re both decent. i’ve also seen both technologies make some incredibly boneheaded and dangerous mistakes lol.\n\na waymo i was in made an unprotected left hand turn that almost killed me if the driver coming through the light hadn’t locked up their brakes. i’d have to try end-to-end neural net FSD to say for sure though.", "score": 3, "replies": [{"body": "U are right, this is good footage but it’s not the case for 99% of users. I have a model 3 and I actually use fsd regularly. I can tell you I cannot actually trust it other than highway. It does work good here and there but definitely no where near what I’d consider safe enough to rely on it", "score": 0, "replies": [{"body": "do you clips of the 99 other drives you used for this statistic?", "score": 3, "replies": [{"body": "It’s a made up stat given I said 99 lol. I’m just saying it based of 15 plus Tesla owners I know including myself. And Several videos I have seeen on Tesla screwing up basic maneuvers", "score": 0, "replies": [{"body": "have you used end-to-end neural net FSD? given that it isn’t fully out yet and that’s what i am discussing", "score": 2, "replies": [{"body": "Well no I have not. Everything these new versions come out the videos come out and it always looks so great. Few weeks in you really get to know the minor improvements are good but doesn’t make a big enough difference. Kind of like putting 3000 dollar wheels on a Honda civic. Sure the tires look good but really the main package is the issue and I’m trying to understand if cameras will ever get to the level that’s been stated.", "score": 1, "replies": [{"body": "yep, we’ll have to see. given that this isn’t a serious of minor improvements, it’s essentially a ground up rewrite of FSD, i’d wager it’s going to behave significantly differently. especially based on this video", "score": 2, "replies": [{"body": "Indeed. Let’s see.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "This is the question I ask when people have the opinion that you need LiDAR to drive, my point always is:\n\nPoint 1: there are humans who have driven their entire lives, hundreds of thousands of miles and never been in an accident.\n\nPoint 2: humans use 4 input sources to drive, none of which are LiDAR\n\nPoint 3: Teslas have 8 cameras providing 360 degree view of the road with no loss of latency (they don't have to swivel their head to look around), immediate reaction times, and no loss of attention (no falling asleep, no spilling coffee while driving, no being drunk) \n\nPoint 4: it's fair to assume that at the least, Tesla can reachthe level of the best human drivers.", "score": 0, "replies": [{"body": "My response used to be that the human visual cortex has way more computational power than anything that will be in the car.\n\nBut now, between their undeniable progress and the similar advances in robotics and AI in general, Tesla has me convinced.", "score": 1, "replies": [{"body": "This is fair, for now. Although eyes as input are known to be very very unreliable, from blind spot in the cornea to degrees of view, to the brain having to do most of the work in filing in what the eye can't capture correctly, and finally quality and degeneration of the eyes as an input device.", "score": 1, "replies": []}, {"body": "Are you saying that lidar somehow increases vehicles computational power?\n\nIf anything, lidar usage requires MORE computational power compared to visual-only, because you have to put effort into resolving conflicting information coming from different types of sensors (visual vs radar vs lidar).\n\nThe limiting factor isn't the amount of information coming from sensors, but the software being not adequate enough. There is enough information in the visual spectrum to judge the situations correctly.", "score": 1, "replies": [{"body": "As I mentioned above, I'm convinced now that I was wrong because Tesla's FSD clearly works amazingly well, and so do various humanoid robots that also rely on visual data.\n\nMy assumption had been that having sensors feeding points of distance data directly from the sensors would be a big help compared to inferring the distance to each point from multiple video feeds.\n\nI actually took an online course on self-driving cars taught by Sebastian Thrun, a cofounder of Waymo. A big point from that course was that you always have conflicting data anyway; he taught the code for putting all that data together to infer the most probable world.\n\n\"Software being not adequate enough\" seems to me like a variation on my previous statement that the car wouldn't be as smart as the visual cortex.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The Mercedes \"Level 3\" only works on highways, at less than 40mph, with another car ahead that yours can follow. It's nice when you're stuck in traffic jams on highways but that's it.\n\nTesla could probably do that too, if they cared, which they don't because it wouldn't give them useful data to advance towards Level 5.", "score": 2, "replies": [{"body": "That’s because that’s what they’ve received regulatory approval for, not necessarily because of system limitations. \n\nAlso bear in mind that they have a more risk averse approach, whereas Tesla is *very* risk accepting.", "score": 1, "replies": [{"body": "That's being awfully generous to Mercedes. What they've shown to the public is *way* easier than what Tesla has done so far in FSD.", "score": 2, "replies": []}]}]}]}]}, {"body": "[https://twitter.com/WholeMarsBlog/status/1749296264506991095](https://twitter.com/WholeMarsBlog/status/1749296264506991095)\n\n&#x200B;\n> Tesla Full Self-Driving Beta 12.1.2 Driving through the Rain at Night in San Francisco", "score": 6, "replies": [{"body": "[https://www.youtube.com/watch?v=RmuFF9urNZM](https://www.youtube.com/watch?v=RmuFF9urNZM)\n\n>Raw 1x: Tesla Full Self-Driving Beta 12.1.2 First Drive: Chestnut Street\n\n[https://www.youtube.com/watch?v=1zaWuGweWvM](https://www.youtube.com/watch?v=1zaWuGweWvM)\n\n>Tesla Full Self-Driving Beta 12.1.2 First Drive: Chestnut Street (timelapse)", "score": 2, "replies": [{"body": "[https://twitter.com/WholeMarsBlog/status/1749299441411199193](https://twitter.com/WholeMarsBlog/status/1749299441411199193)\n\n&#x200B;\n> FSD Beta 12 pulls over after reaching destination", "score": 2, "replies": []}]}]}, {"body": "I really really really want a FSD 12.x that is not California as a benchmark. Like NYC or Miami or Chicago or something. The Cali bias is terrible.", "score": 7, "replies": [{"body": "Do we have confirmation we can quote somewhere that this is how they're training?  I've seen it commented a few times, but don't know if I've seen it attributed to anyone directly in Telsa or their AI team but I just may have missed it.\n\nIt's an interesting problem to ponder.  They wanted a universal model that you could deploy anywhere in the world, and hand coded along those lines.  After finding out that they just can't hand code it enough, they're falling back on NN training - but now your inputs sway the model a bunch.  For example, if you shipped one of these v12 FSD cars over to England where it's reverse drive ... what would it do?\n\nI'd still be pretty excited if they could curate a clip library for each major country and set of typical weather conditions over time, even though that might take extra work now.  So if they can make it work first in Cali in nice clear weather, then in multiple states in clear weather, then in some set of states in rain or snow or whatever ... I'd be cool with that.\n\nHeck, just make FSD that works day or night anywhere in the US and is almost reliable enough for me to sit in the back seat ... and if we have to hold off on rain/snow training that's fine by me.\n\nWhat's really interesting about this approach though is how they fix problem spots.  They can notice when dozens of telsas all disengage right at the same spot according to GPS, and then they can just go and find video clips of a bunch of teslas on manual drive that go through that same area with no issues and feed them into the model and it should just fix things automatically.  So that's actually way cool.\n\nBut first, yeah, they have to solve the fact that now the visual training models may exhibit some geographical bias.", "score": 3, "replies": [{"body": "If 90% of your test content* is centered into a geographic region, then it's just a much larger geofence similar to LiDAR. That's a bit reductive, but generally true.\n\nUltimately though, I'm sick of seeing Omar's videos as being considered a benchmark for FSD, because he runs pretty much the same route each time in his test, and is exclusive to San Fran area. There's an overwhelming bias to the data being provided, and it doesn't provide a diverse success graph for the fsd version.\n\nThe entire world isn't San Francisco. There are many cities in the US whose urban densities are just as complex as SF, and where driving around them is just as difficult as SF. But we pretty much never see FSD demos on this sub from NYC or Miami or D.C.\n\nSo the quality of the content degrades and the trust in the updates degrade with it. Also, Omar on X has a tendency to argue in bad faith or gaslight on the occasion. That poisons the reliability as well. Imo.\n\n---\n\nTo be clear, my criticism isn't of Tesla's actions for training. It's of this sub treating Omar's content as being as being a measure of reliability. It's really the only FSD videos that I find on this sub, and that's an informational bias that's hard to ignore.", "score": 0, "replies": []}]}, {"body": "We do have the best of everything, including data to model lol", "score": -2, "replies": [{"body": "That's called having a bias.", "score": 5, "replies": []}]}]}, {"body": "Amazing", "score": 4, "replies": []}, {"body": "How good does it perform when there is snow on the road? Thinking about after plowing the roads for example, with lots of Snow here and there?", "score": 4, "replies": [{"body": "Didn’t Tesla or Elon or someone say they started training on clear sky daylight clips initially?", "score": 2, "replies": []}, {"body": "Well, Tesla said it is overfit for California and they need more training data for other parts of the country, so I expect it will be rough until they get that data.\n\nI'm surprised they released it to Omar first instead of branching out to other states like they indicated they needed. Perhaps they're waiting to deal with the known issues Omar had alluded to.", "score": 1, "replies": [{"body": "It's interesting to ponder how they will continue to expand the training clip library over time.  Like, you start with Cali clear days -- what do you do next?  Cali at night?  Cali in the rain?  Or do you go to Ohio and Florida and Wyoming during the day next?\n\nHonestly, I'd take a car that could nearly 100% FSD in day or night in no-rain/no-snow conditions and be pretty happy with it.", "score": 1, "replies": []}]}]}, {"body": "The problem with sped up videos is that it hides a lot of the flaws and awkwardness. I’d much rather they just release real time footage.", "score": 2, "replies": [{"body": "Just watched the real time video OP posted a link to. Looks good! Now the only problem is that it was posted by whole mars blog so idk how much to trust it b", "score": 5, "replies": []}, {"body": "He has all the realtime videos on his channel as well.", "score": 1, "replies": []}]}, {"body": "2:40, 3:50", "score": 1, "replies": []}, {"body": "[https://www.youtube.com/watch?v=N9bJLDAAQxc](https://www.youtube.com/watch?v=N9bJLDAAQxc)\n\n30 min drive with commentary", "score": 1, "replies": []}]}
