{"title": "All in on UPS", "selftext": "Going full portfolio Puts on UPS today. I work in the same industry for another carrier competitor and I must say our financials are equally fucked. I think they will go the way of fed ex tomorrow morning.", "id": "1ae68un", "created_utc": 1706562450.0, "score": 56, "upvote_ratio": 0.92, "num_comments": 62, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|8 months ago\n**Total Comments**|199|**Previous Best DD**|\n**Account Age**|8 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Is that the only DD? Another competitor’s financials being bad or was there also poor guidance/something else?\n\nI’m hoping you say you did no DD and are going on vibes because I will get behind that over any crayon colorbook", "score": 22, "replies": [{"body": "It’s vibes to be quite honest, but the thought is there. Basically…\n1. Less volume. We know this. Less volume is less revenue. Part of this is amazons cut back of using UPS as a carrier. Part is less retail growth which means less online shopping. \n2. Employee raise. The union already costs the corporation so much quarterly, and their day to day operating costs are already super tight and strained. A union agreement to raise wages took effect and this will raise costs higher. \n3. Cancelled the building Of a proposed distribution centre. This means They had it in their budget but had to cancel it, that means there was room for it, and there isn’t anymore. No more budget room means something somewhere else, costs were higher than originally expected.", "score": 17, "replies": [{"body": "God damn it, I’m in baby. Earnings AH or PM?", "score": 4, "replies": [{"body": "Earnings report is released 6 am eastern time. And their conference call is 8:30 ET", "score": 3, "replies": [{"body": "So I missed the train eh. All good, will root for you from the sidelines", "score": 4, "replies": [{"body": "Possibly, you also possibly missed the train wreck we will see lol", "score": 7, "replies": [{"body": "Newbie here - quick Q. Could you not submit puts after hours that are filled upon open in the AM? Why has this person missed the gravy train", "score": 1, "replies": [{"body": "Option trading doesn't open until market does at 9:30.\n\nYou can que an option buy at any time, but the pre-market trading is likely to push the \"last price\" of the option you want to buy out of a desirable strike point.\n\nIt's why buying options over the weekend is a major gamble.", "score": 2, "replies": [{"body": "Thank you for this!", "score": 1, "replies": []}]}]}, {"body": "!remindme 7hrs", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "If you mess up everyone elses puts you have some serious explaining to do", "score": 7, "replies": [{"body": "I apologize in advance", "score": 2, "replies": [{"body": "God speed", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Sorry we ended up calling you out for stealing content and labeling it as your own.\n\nNo hard feelings about those downvotes we piled on. They’re just given out by us to help you see how we feel about content theft.\n\nIn the future, consider doing what you did, except specifically stating something like “I just found this on a different sub- take a look at this crazy loss! Do you think he’ll ever recover?”\n\nOr simply just reposting their content, except just saying “do you think he’ll ever recover?” \n\nJust so long as you make it clear to us that it isn’t your content.\n\nTrying to make it seem like it is your specific content is what irks us the wrong way. So if you’re able to avoid that, you shouldn’t have any issues.\n\nAll the best 👍", "score": 0, "replies": []}]}, {"body": "Saw some dude post he bought 70 shares of UPS todsy", "score": 3, "replies": []}, {"body": "https://preview.redd.it/kxwa6i1x4lfc1.jpeg?width=828&format=pjpg&auto=webp&s=dc3e3a3084e41483e447908beb41d562b6858044\n\nWe eating well tonight", "score": 3, "replies": [{"body": "Oh damn man, that’s a good one, yours was riskier but probably gonna make a lot more than me", "score": 1, "replies": [{"body": "Selling on open?", "score": 1, "replies": [{"body": "I did yea. A little more than doubled my money made about 6500 USD profit. Unfortunately if I waited until now I would have made like 13k :( but oh well lol I’ll take that as a solid win", "score": 1, "replies": [{"body": "Nope F the 13k, 6500 is a W don’t think about anything else", "score": 2, "replies": [{"body": "I fully agree", "score": 2, "replies": []}]}, {"body": "Same, live and learn", "score": 1, "replies": []}]}]}]}]}, {"body": "Gg well played", "score": 3, "replies": []}, {"body": "Yikers! Let me know when you are ready to take my Wendy's order.", "score": 5, "replies": [{"body": "Are they taking orders by the dumpster now? That’s my personal space", "score": 2, "replies": []}]}, {"body": "The same issue over here with European competitors of ups", "score": 2, "replies": []}, {"body": "Show the profit", "score": 2, "replies": []}, {"body": "Why the 157.50 strike?", "score": 1, "replies": [{"body": "Because I want to limit the effect of IV crush, in exchange for less potential gain. I see most UPS puts on the option chain are around the 150 mark. If the move down is less than the implied move from the options, those 150 puts will get fucked but mine will still have concrete value. Of course at the expense of less return because I paid a higher premium. I did the same thing with SOFI this morning actually, I bought very close OTM calls and the volatility decrease had almost no affect on my options compared to other peoples, but I made less.", "score": 6, "replies": [{"body": "And what happens if say it drops way down past* your strike to say $135, how does that effect your play?", "score": 2, "replies": [{"body": "The real value of my contract still increases with every dollar. Once it’s in the money, each contract has a hard concrete value, because you can exercise it. It’ll be worth more money than everyone else’s with their 150puts, however, they will have paid less for theirs. So if it hits 135, I’m really just doing as well as the 150 guys but I had to put in more money upfront and risk more", "score": 6, "replies": [{"body": "Thanks for the insight. I ask cause I want to play AMD tomorrow, I expect the earnings to be good, all speculation based on SMCI today, NVDA’s last run and all the AI hype. I don’t really know what im doing but want to buy some calls. Maybe 5k worth. Today I bought 3 185c for 2/9 but want to buy some more tomorrow maybe", "score": 2, "replies": [{"body": "185 is a good strike to go with. Generally yea as long as you get to your strike then you are good. You may not make as huge of a return as someone who say, bought 190 or 195 calls. But you also have a greater chance of making money at all. I believe the implied move of AMD is about 10% for earnings, So that puts you in the money. If amd moves less than 10% up, anyone who is out of the money is fucked on IV crush, but you should be ok.", "score": 3, "replies": [{"body": "can you please explain what IV crush is? I tried asking here but got laughed at.", "score": 3, "replies": [{"body": "Basicly, some confirmed news or trend kill off any implied volatility. The main reason options are worth money is cuz of Implied volatility u don't know where it will go, if something happens and send the stock straight up or down in a certain path. The losing sides IV would get crash to oblivion cuz it's clear the news is in favour of which side and those contract basicly become trash hence IV crush ur IV gets shredded.", "score": 3, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}]}]}, {"body": "diversify the calls if your going to gamble on the earnings being good. nothing wrong with 2/9 but if your play is to gamble on an upswing and have a date inmind you should play shorter term call with a lower strike price. also keep in mind they lose and gain value with volatility. maybe another 2k worth of calls at a lower strike price if your gambling already man. could pay off x10", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Is this wealth simple??", "score": 1, "replies": [{"body": "Yes lol. To be quite honest I like Wealthsimple a lot along with their customer service. If you like options contracts obviously you’d want one with far more control and features. But for just mobile banking in general and general investing I love it. Options are possible of course and doable, but not the most ideal.", "score": 5, "replies": [{"body": "I switched from WS to IBKR for USD. The fees add up quickly on WS.", "score": 1, "replies": [{"body": "That’s valid tbh. I have premium Wealthsimple so I can keep USD without converting it Every trade. But yea the conversion fees add up very fast", "score": 2, "replies": []}]}]}]}, {"body": "Exp date?  Not displayed in photo", "score": 1, "replies": [{"body": "2/9", "score": 1, "replies": []}]}, {"body": "this will actually print tho. im in. I'm not inversing", "score": 1, "replies": []}, {"body": "I did similar with 20 contracts at $155, god speed regard", "score": 1, "replies": [{"body": "Hey u/PoopholeLicker , looks like we may have made the right decision 👊", "score": 2, "replies": [{"body": "Hell yea man", "score": 2, "replies": []}]}]}, {"body": "!RemindMe 1 day", "score": 1, "replies": [{"body": "I will be messaging you in 1 day on [**2024-01-31 03:27:24 UTC**](http://www.wolframalpha.com/input/?i=2024-01-31%2003:27:24%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1ae68un/all_in_on_ups/kk7iyxu/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1ae68un%2Fall_in_on_ups%2Fkk7iyxu%2F%5D%0A%0ARemindMe%21%202024-01-31%2003%3A27%3A24%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201ae68un)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "expiry date? strike price?", "score": 1, "replies": []}, {"body": "odfl is much better", "score": 1, "replies": []}, {"body": "What’s that $CASH ticker?", "score": 1, "replies": [{"body": "It’s a high yield ETF. Horizon cash interest. Pays about 5.5% annualized in monthly dividends. It works by basically just putting the funds in the high interest bank savings accounts", "score": 1, "replies": []}]}, {"body": "well done, poopholelicker. well done.", "score": 1, "replies": []}, {"body": "Nice Job bro, i work for them and after this years christmas i knew earnings are fucked. But i wish i yolo'd like you did", "score": 1, "replies": []}, {"body": "In an FHSA too! You’re crazy bro", "score": 1, "replies": [{"body": "That was probably dumb but it worked. Now it’s tax free gains and it doesn’t count to my contribution room.", "score": 1, "replies": []}]}]}
