{"title": "Netflix vs Disney?", "selftext": "[deleted]", "id": "844tg1", "created_utc": 1520953411.0, "score": 13, "upvote_ratio": 0.86, "num_comments": 55, "comments": [{"body": "Honestly, I think Disney has end game advantage. They have ESPN, they could easily incorporate live sports into their service which would blow Netflix out of the water.\n\nThey also have a plethora of franchises they can exploit for shows; Pixar, Marvel, Lucas Films, 20th century Fox.. \n\nEveryone is big on Netflix now because their stock keeps rising. Well get your gains while you can because I just don’t see how they will beat Disney. ", "score": 24, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Here’s the deal:\n\nAmazon has been technically overvalued for the past 4 years yet it keeps rising.\n\nIf you think they beat Disney, go for it. If you don’t, DIS is your play ", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Disney's streaming service is planned to be released until late 2019, so it won't be relevant financially until 2020. Better early than never, but it can be well over a year before we see movements in the stock price.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Disney is making a big bet that the TV/movie entertainment industry, which has been stagnant, will be able to compete against the streaming giant Netflix. This reminds me a lot of Amazon and Walmart. You might not lose money, but if you aren't making money, there's an opportunity cost there.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Best of luck to you friend! I'll definitely be tracking these stocks for a while.", "score": 2, "replies": []}, {"body": "That ties up quite a bit of your capital in what is essentially a hedge. Options may be a better use", "score": 1, "replies": []}]}, {"body": "But will Disney have funds left to invest after bug Fox?\n\nThe only thing they bought was old content.  Netflix is investing in new content now.  They are also installed on every smart tv made in the last 5 years.\n\n There probably us room for both as long as the price stays within reason.\n", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "This. Additionally, Disney owns a large portion of Hulu, so they already have some experience in content streaming.", "score": 2, "replies": []}, {"body": "There's room for two tho.", "score": 1, "replies": [{"body": "Agree.  (Or even more)\n\nIf Disney combines the Disney, Pixar, Marvel and Lucasfilm content into a single streaming service and then also includes some original programming as well, their service will be a must for anyone with children as well as many adults, especially if they can keep the price down.  It only gets better if they also acquire the Fox assets as planned.  ", "score": 3, "replies": [{"body": "I think the lynchpin is sports. If Disney does it right and can become the go to service for streaming sports in North America, it would be huge and a definite game changer. But there are so many impediments to securing those rights that's it mindboggling to predict. Imagine the superbowl being broadcast on Disney's sports streaming service. ", "score": 1, "replies": [{"body": "That app would cost over 40 a month, easily", "score": 1, "replies": []}]}]}, {"body": "Not if Disney stops licensing shows for Netflix ", "score": 2, "replies": [{"body": "I don't understand this. Where do people get the idea that people only subscribe to Netflix for Disney content? Is this coming from data or just \"feelings\"?", "score": 2, "replies": [{"body": "I think by the time Disney starts rolling with its streaming content, Netflix would be really far ahead in terms of original content and usability. Not only are they expanding, but also getting better at what they do. \n\nWe're not even sure if the solution Disney is going to provide will be as usere friendly and stable as Netflix. Anyone disagree? ", "score": 2, "replies": []}, {"body": "It's called critical thinking.  The point is that Netflix just lost half its content. Where and how is Netflix going to replace that content? Or is everyone just going to watch Netflix for oitnb reruns?\n\n", "score": 1, "replies": [{"body": "Disney is not half of Netflix content get serious. Netflix will replace that content by producing their own - which they are doing now. ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "It's a classic Growth vs. Value", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "That kind of applies for all stocks, lol. It was also less attractive years ago. I mean remember when they used to mail you DVDs? Their streaming platform had nothing worth watching.", "score": 7, "replies": []}]}]}, {"body": "I would go for Netflix, and use the money you'd put in Disney for another growing tech stock.", "score": 3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Then buy Disney, it's your money", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "disney has a lot room to grow, i believe it will earn a lots of money up coming years. disney would be great for long term, but if it will be the best stock option with highest returns then maybe netflix is a better bet, however netflix is tripple the prize of disney. if possible i would take both, but seriously would hold disney for a few years. ", "score": 1, "replies": []}]}]}, {"body": "A lot of people in this sub invest almost solely in growth tech stocks. \n\nI personally like DIS and this it is a great long term buy right now. And there is nothing wrong with diversifying and investing in both DIS and NFLX. ", "score": 1, "replies": []}]}]}, {"body": "Disney has all the properties and assets but I think Netflix management is more innovative.\n\nIt really boils down to do you want slow steady growth that pays a dividend and probably wont be going anywhere any time soon\n\nor\n\nFast growth, very volatile, is expanding very quickly but burning through a lot of cash in the process, none of which is a dividend. Netflix is definitely a more risky move but the upside is massive as well.\n\nAlso note that during a correction or recession, Netflix will be hit harder than Disney.", "score": 3, "replies": [{"body": "Serious question, is Netflix really innovative? I mean if they were innovative, wouldn't they have branched out into other areas of business? I see the main limitation of Netflix being that they've cornered themselves to being really good at one business, streaming content, but I honestly think if they were innovative, they should have branched out to live streaming (e.g., Amazon owning Twitch) or some type of integration (e.g., acquiring Snapchat) so that when their core business is threatened, they aren't SOL.", "score": -1, "replies": [{"body": "I mean, the explosion in price and growth should speak for itself but if you really don't think they've innovated in the last 20 years let me just remind you that...\n\nNetflix started off as a small DVD mailing company that has turned into a multibillion media company that is worth more than all the other media companies with the exception of Disney, That is a huge feat that occurred in only 2 decades\n\nThey foresaw brick and mortar stores going away before blockbuster and Hollywood video did.\n\nThey saw DVD's going away in favor of streaming before a lot of retail stores that still sold DVDs did. I actually remember the huge backlash at the news of this at the time, but they held their ground. Weird to think now just how upset people were that Netflix would choose to focus on streaming.\n\nThey saw licensing deals continue to get more expensive and exclusive so they began creating their own content before even the studios even started to pull their content from Netflix\n\nThey forego the traditional movie theatre release and released Netflix produced movies on day one on their streaming platform.\n\nDon't underestimate Reed Hastings and his management team, they are constantly tinkering with their business model to come up with something to stay competitive. Who knows maybe they will get into live streaming one day, The story isn't over yet.", "score": 2, "replies": [{"body": "Stock performance doesn't imply innovation. I mean would you consider Priceline particularly innovative? What about Alaska Airline? I don't follow stocks like CBS, but its return since March 2009 is also in line with Netflix. I believe what you're referring to is company management. My point is that Netflix isn't particularly innovative, it's good at growing its subscribers, its core business is solid , and company management has been on top of capturing growing trends. There's nothing particularly innovative about streaming content, thousands of other sites do the same thing.", "score": 1, "replies": [{"body": "\"Skip intro\"", "score": 2, "replies": [{"body": "I have to say that seemingly small feature is genius.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "DIS has potential but nothing will happen until they announce something big, will continue to move relatively flat like it has the past few years.\n\nNFLX on the other is anyone's guess, for now it looks like it'll continue to go up but who knows when/if that will stop. If shit goes south this type of stock will get slaughtered while DIS will be relatively safe.", "score": 2, "replies": []}, {"body": "Investing in both is the smartest thing you can do. \n\nIt's Netflix AND Disney.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I think that is a wise choice. GL", "score": 2, "replies": []}]}]}, {"body": "Im not invested in either, but if I had to choose I'd choose Disney. Over the long-term we have no idea where NFLX will be, but with Disney you have a pretty good idea. It's also more safe and stable. But in the end you should do your own DD and come up with the decisions on your own.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Fair play, Good luck!", "score": 1, "replies": []}]}]}, {"body": "Don’t confuse Disney with a tech company that can make their own hardware to stream content faster, is growing exponentially, and uses AI to figure out what new shows to create.", "score": 2, "replies": []}, {"body": "Let’s compare current PE!!\n\nDisney = 14.82\nNetflix = 257\n\nThat’s right 257!", "score": 2, "replies": []}, {"body": "Disney Streaming and ESPN streaming could end up making things difficult for Netflix, but Why not both?", "score": 2, "replies": [{"body": "My personal take on this is to not buy 2 stocks that are in direct competition with each other .. although I’m not sure I would consider dis and Netflix in direct competition since Disney is more then streaming. I think a better example for my argument would be investing in pandora and Spotify .. tbh I haven’t done a ton of research on Disney but I would suspect their streaming service is a significantly smaller % than Netflix .. so I suppose only time will tell how that number will change but I don’t see them competing with Netflix on growth ", "score": 3, "replies": [{"body": "Right now Disney doesn't have a streaming service, they do own 30% of Hulu and if they get Fox it'll double, that said their streaming service is supposed to be coming but probably not for another year or so. they did recently announce ESPN streaming but it's not competing with Netflix since it provides something different. \n\nMost of Disneys revenue are from their parks and their networks, this gives them plenty of money to burn if they decide to become aggressive against Netflix, who is stuck with a singular revenue stream, right now. Disney also has a massive library, which will only get bigger if they acquire fox.", "score": 2, "replies": [{"body": "I’m going to be inclined to agree here .. In my opinion a better way to look at this is Netflix vs dis amzn prime video and cable streaming (msnbc com central etc etc).. but I def think Netflix has evolved and made correct decisions.\nFor example I would say their original competition was block buster, rip blockbuster.\nThan they evolved to primarily streaming by separating dvd from streaming  (despite everyone getting pissed if memory serves.. I personally cut cable years ago and never looked back.\nAnd now I feel they are competing with media producers as well by producing an immense amount of original content.\nI may be underestimating the amount of content dis owns (and I’m aware it’s massive) but I’ll agree dis and Netflix are not in direct competition. At this stage isn’t he game I feel it’s more everyone who offers a streaming service is vying for a piece of Netflix rev but it’s still Netflix pie.\n\nSemi related I think Hulu’s interface and navigation is atrocious and insulting.\n\nI think the main problem Netflix will face is everyone pulling content before they can establish their own massive media collection although they certainly seem to be addressing this.\nAnd this is all from personal memory and my opinion . I have done zero research to back up any of this ", "score": 1, "replies": [{"body": "Other than a few TV series, what original content does NFLX really own that anyone cares about?  House of Cards (which is done), Orange is the New Black, Stranger Things, etc. are not enough.  I think they need to invest in some blockbuster movies and hope they hit on some.  If I was Netflix, I would buy a movie studio (or 2).", "score": 1, "replies": [{"body": "Ur argument would have been a lot more viable 6 months ago .. check again ", "score": 1, "replies": [{"body": "Why don’t you save me the time?  Their movies are not much better than direct to video. ", "score": 1, "replies": [{"body": "The literally have way more content than I would care to list. If you go to netflix, and brows only original content you will see tons of tv shows, comedies, cartoons, movies, documentaries. I'm sure if we graph number of shows vs time, we would see something slightly exponential. \n\nThen again, quantity is not quality. I can see many people who would rather have entire disney library over anything netflix would ever make. ESPN is another big factor. But from now till then, it is a bet on how Netflix is going to adapt and not comparing it as it is NOW.  ", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "At their current price points I wouldn't bet against most people getting both and them kinda co-existing.", "score": 1, "replies": [{"body": "Current price point cannot last. Imo Netflix gets squeezed out by Amazon Prime and Disney. Amazon offers the overall Prime benefits that Netflix can't, Disney offers the sports that Netflix can't. I picture people having Prime and Disney. People with disposable income may throw something on top of P&D, like PS Vue or Youtube TV in there for that simplicity of not having to pick something.\n\nShort term I wouldn't be surprised if Netflix is profitable for shareholders, but long term I personally doubt it. If they throw a wrench into things by buying some movie theaters or AMC perhaps they pull it off, but if nothing changes then I doubt it.", "score": 1, "replies": []}]}]}]}, {"body": "It would take years of engineering effort and tons of user data to replicate the personalized streaming service built by Netflix. We have seen other streaming services tried catching up with Netflix but they failed. \nhttps://medium.com/@NetflixTechBlog ", "score": 1, "replies": [{"body": "Does someone like Disney really need personalized user data?  Existing licenses are delaying its streaming service from launch.  It is giving them time to do the development work.", "score": 1, "replies": [{"body": "> It is giving them time to do the development work.\n\nThat and Disney certainly has plenty of cash to throw at the problem. Not to mention they have majority ownership in BAM tech which has been working on and has streaming products out for several years now with MLB.tv and more recently NHL.tv.", "score": 1, "replies": []}]}]}, {"body": "Netflix owns a great platform and has SOME good original content (with a lot of junk also).  Disney has the best content (strengthened by Fox) and needs a better platform with the cord cutting that will only continue over time.  The ideal company would be a merger between the two.  However, that will not happen.  So, I am betting on which of the two will be most likely to combine the best of both worlds.  I believe it will be easier for Disney to build a great platform than for Netflix to obtain an equivalent level of content.  So, I own Disney.  I do not see it as a zero sum game because many, if not most, folks will subscribe for multiple streaming services as long as the price is around $10/mo.  Thus, both can be winners over the long run.", "score": 1, "replies": []}, {"body": "While I agree that the Disney streaming division may, in the long term might surpass Netflix in content,  butt in the short term,  there are minor hurdles that it will need to overcome.  Some of which are the various agreements that Disney has with a variety of media distribution companies.   These include contracts with PPV, pay tv (HBO, showtime) and syndication for many of its shows that may last a decade.\n\nWhile these may be short term problems, unless Disney wants to break these contracts,  the obligations won't be easy to break. \n", "score": 1, "replies": []}, {"body": "I don't think this Netflix growth is sustainable.Overvalued IMHO. For that reason, I would go with disney plus they have many sources of revenue. ", "score": 1, "replies": []}, {"body": "Went big on Disney this week for there’s same reason. They have their tentacles in all facets of entertainment and are well managed with a lot of cash flow. ", "score": 1, "replies": []}, {"body": "Is ESPN still a big hole in DIS's pocket or have they stabilized?", "score": 1, "replies": []}, {"body": "I've never been right on Netflix so I'm sure I'm wrong now, but at some point Netflix's growth will begin slowing, and when it does the stock price will go down because it's always been driven by subscriber growth over everything else. They don't have the money to spend tons on original content long term, and we don't know what the effects will be when Disney pulls all their content from Netflix. I don't think that Netflix will necessarily lose subscribers to Disney - I think they will be compliments to each other, but some may opt to get Disney over Netflix to have access to all their content (also interesting to see if they pull Fox content from Netflix as well). ", "score": 1, "replies": []}]}
