{"title": "What was the 2008 financial crisis like?", "selftext": "Those who were invested during the financial crash of 2008/2009, what was it like in your opinion? I ask because I wasn't invested (still in school) during that time and didn't really know much about it when it was happening. Also, who would you blame for it being so bad?", "id": "bw2a3b", "created_utc": 1559509546.0, "score": 97, "upvote_ratio": 0.84, "num_comments": 182, "comments": [{"body": "A real estate company who was all cash went and bought properties in my area at super low prices.  Now they own almost every major housing development in what used to be a very rural area\n\nPersonally, I had just moved out at 18 and almost immediately lost my job.  Ended up doing landscaping and sandwich artistry while in comm. college.  \n\nStill alive.", "score": 186, "replies": [{"body": "That’s for your service at the Subway", "score": 111, "replies": []}, {"body": "I kinda have to admire that company for seeing what was going on and seeing there would be an inevitable crash.\n\nPersonally, I'd been watching things heat up and knew it was going to suck. Luckily the company I worked for at the time was known for trying not to have layoffs but just cut everyone back in hours.\n\nMy investments cratered but I knew not to sell. If anything in one investment I really wish I'd sold it in 06, 07 and held on to the cash because it lost over half its value. If I'd sold in time I'd have had about 30k that I could use to buy the investment back when it dropped from 34/share to 12/share.\n\nMan, that would have been sweet. Edit: I just remembered this--once I learned that I wouldn't be laid off but would lose hours, I increased my 401k contribution 2 more percent because I knew this was a great opportunity and stocks would be on sale.", "score": 9, "replies": []}, {"body": ">sandwich artistry\n\nMade my morning.", "score": 7, "replies": []}, {"body": "If they were all cash, they were a cash investment company. /s", "score": 7, "replies": []}]}, {"body": "I'm on the older end of millennial.  I can't complain, I was pretty lucky, having a degree that was fairly in-demand.  I had been working for less than a year when our pay and vacation time was cut.  Some people were let go.  The guys in their 30's and 40's would go pale when checking their 401k balances.  My recently widowed mother was under extreme stress watching the investments my dad left her drop.  I wanted to find a better job but couldn't as no one was hiring.  My mom wanted to downsize houses but didn't want to sell at current prices.  So all in all, it was rough, but not the end of the world.  \n\n\nLife returned back to normal fairly quickly.  After about a year our vacation was restored, another year and we started getting raises again.  The cheap shares we picked up in our 401ks turned out to be a huge boon.  Home prices rebounded, and my mom was able to sell her house, by a smaller one and pocket the substantial difference.  Places started hiring again and I moved to a different and more lucrative industry.\n\n\nLike a lot of things, it was different for everyone.  I don't mean to make light of it as I know there were people permanently hurt by it.  I know or know of some people who's family had pensions with the auto companies and they got screwed over hard.", "score": 73, "replies": [{"body": "What degree and field?", "score": 12, "replies": []}, {"body": "Roughly lines up with my experience, but i bought a house at the bottom of the market as I hated moving and my job seemed to stabilize", "score": 3, "replies": []}]}, {"body": "Took me until 2016 to recover because I panicked and sold everything for a 40% loss.  Spent three years reading before I invested again.  I'd be a lot richer if I just ignored the whole thing and never watched CNBC.", "score": 64, "replies": [{"body": "Ouch. You're not alone, though. There was a guy who demanded that his brokerage market-sell everything he owned during a one-day drop. He about wiped himself out, then tried to sue the brokerage for doing what he told them to do.", "score": 24, "replies": [{"body": ">then tried to sue the brokerage for doing what he told them to do.\n\nI hate people like this.", "score": 15, "replies": []}, {"body": "do you have link to the story per chance? tried to google for it but couldn't find it", "score": 3, "replies": [{"body": "Sorry-I remember reading it in my local paper, I too tried to find it but couldn't. I vividly remember reading it because once I saw \"market sold\" I was cringing.", "score": 2, "replies": []}]}]}, {"body": "Rule number 1. Never sell the dip! If you can afford, try to purchase more.", "score": 4, "replies": []}, {"body": "I began reading the Intelligent Investor before I started investing. I believe if I hadn't I would have picked every time Tarrif Mam opens his facial butt flaps.", "score": 6, "replies": [{"body": "So OP posted about the financial crisis in 2008, and somehow you decided it would be relevant to trash the POTUS?  \n\nIt’s incredibly hard to have a serious conversation on Reddit when somehow everything becomes political. There are countless subs that trash Trump...this isn’t one of them.", "score": -6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "He’s the President Of The United States....what type of comment is this?", "score": -6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "The market is up 9% YTD and 22% since he took office. Crazy you people are so blinded by hatred that you result to insults and overreaction.", "score": -2, "replies": []}]}]}]}]}]}]}, {"body": "It sucked. There's a south park episode about it.", "score": 25, "replies": [{"body": "Aaaannnnnndddd it's gone.", "score": 10, "replies": []}, {"body": "Poof", "score": 2, "replies": []}]}, {"body": "The thing about dollar cost averaging, is that all these models assume you keep investing during downturns. In 2008, people were raiding their investments to pay their bills - which is exactly the opposite. They were foreclosing on their houses. Lots of people basically had to start all over again.\n\nYou don't want to be selling during the downturn. You need an emergency fund.", "score": 52, "replies": [{"body": "Anyone that cant even survive 6 to 12 months without having to cash out has to seriously rethink his investment approach. And money management in general. The money put back for this should also be a different pile than the one you keep in the portfolio for buying opportunities.", "score": 12, "replies": [{"body": "Sadly, most Americans fit this description.", "score": 16, "replies": [{"body": "True. Here in Germany things were pretty chill in 08. Portfolios took a huge dump yes, but people werent losing their homes, panicking or anything. Has probably a lot to do with the germans dislike of taking on any kind of debt and a much more conservative money management.", "score": 12, "replies": [{"body": "Do Germans take loans for housing and transportation? If they don't take loans for housing how is the German housing market not flooded with foreign buyers?", "score": 2, "replies": [{"body": "Its not like they dont take out _any_ loans at all, they are just much more conservative and also dont mortgage their houses several times over. Most houses are also actually inherited. Cars are usually bought used. Very few people actually buy new cars here, which is why our premium car markers (BMW, Mercedes and Audi) are very dependent on US, Emirates and Asia. Most germans also don't have a credit card, since the whole \"buy now, be in debt and pay it off at the end of the month\" thing already gives them the Heebie Jeebies. Having my own company and traveling a decent amount, I still often get something \"oh you have a credit card huh?\" in Germany.\n\nAnd the german property market actually is flooded, which is a big problem in its bigger cities like Berlin. The aversion with debt isnt the main reason for that though, but more like the way the state is governed. You'll start paying the highest income tax (42%) on around 50k€ or more income. Add to that the highest energy prices in Europe (also because of an included tax), medical insurance and pension cost (both are mandatory) + unemployment & nursing insurance and a 19% VAT and there are very little ways to finance a house or be willing to go into deep debt.\n\nThis situation makes it fairly easy for wealthy companies and investors, who are taxed much less in their own country and therfore have more money to their disposal, to scoop up property. This is mostly the case in big cities tho. Foreigners care little about the areas outside of cities.", "score": 3, "replies": []}]}]}, {"body": "Most American's can't afford to have that 12 months of living expenses in cash. Much less investments on top of it.", "score": 1, "replies": []}, {"body": "But, I can't be seen in a two year old car! Images, people, images! /s", "score": 1, "replies": [{"body": "who really cares how old is your car. it is main reason is gettiin you from point A to point B. Thats why i drive 10 year old car :)", "score": 0, "replies": [{"body": "Hence the '/s' at the end.", "score": 5, "replies": [{"body": "i dont get it", "score": 0, "replies": []}]}]}]}]}]}, {"body": "I think your final sentence should be tattooed on people alongside *Don't Sell in a Downturn!*", "score": 2, "replies": []}, {"body": "DUDE THE WHOLE POINT OF DCA IS TO INVEST NO MATTER WHAT ESPECIALLY TO ATTAIN MORE SHARES FOR CHEAP. WTF!", "score": 1, "replies": [{"body": "A LOT of people had no job, and couldn't find one for years.", "score": 1, "replies": [{"body": "That’s very true but thats not what his post was about. We can agree on that.", "score": 1, "replies": []}]}]}]}, {"body": "I just bought my first house and my first truck. Every bank was loaning money to virtually everybody. That is now my indication of the economy. When money gets too easy, hold on tight.", "score": 14, "replies": [{"body": "Thing is it's harder to tell now. Banks are still loaning like crazy but only to crazy rich folks. Most of those people live in a bubble so it's really hard to tell whats going on on main street. On the other had auto loans are easier to get now but thats not a mortgage", "score": 6, "replies": [{"body": "Don't forget the most important part of this one; banks are deleveraged over the past ten years which means they are in place to do the saving. \n\nThey learnt their lesson, I doubt the general pop did.", "score": 5, "replies": []}]}]}, {"body": "Older millennial here. I was a couple years out of college when it hit. I remember meeting my cousin from Europe in a large metro area cafe circa 2007. He was asking me about the USA and I said something like “I don’t know how people are paying for this stuff. My friends are dropping $100s at the bar every weekend”. Turns out that they weren’t paying for it. Their credit was. \n\nThe recession was fairly easy for skilled labor. Most kept their jobs. Salaries were tight and changing jobs wasn’t an option. Raises and bonuses didn’t happen. I lost $40k in stocks over a lunch break. \n\nCareers with more competition were whacked pretty hard. People undercut each other for open spots until they were working for nearly free. \n\nThen there was the unskilled who were obliterated. We had many local churches turn their parking lots into tent cities. Families lived there for years. The last one probably closed around 2012. \n\nDon’t believe the BTD bullshit. People were scared for their lives. They were looking at homelessness. VPs we’re working at Macy’s. I remember the turn around point fairly well. The MadMen show was the GoT of then. And in one episode they said something like “Don’t bet against America”. You could argue chicken or egg as to if this was the catalyst or if the recovery spurred the script, but people became optimistic around that time. Investments started picking up. People started spending money frivolously again. It was a slow process. It didn’t turn around over night.", "score": 32, "replies": [{"body": " “I don’t know how people are paying for this stuff. My friends are dropping $100s at the bar every weekend”. Turns out that they weren’t paying for it. Their credit was.\n\nVery similar to current situation.", "score": 33, "replies": [{"body": "I believe so. I’m about 75% cash right now.", "score": 3, "replies": []}, {"body": "This has always been the case. People have always binged in credit.", "score": 2, "replies": [{"body": "Not nearly as much when interest rates were much higher.", "score": 1, "replies": []}]}]}, {"body": "Why did you sell at a loss instead of waiting it out?", "score": 6, "replies": [{"body": "It was a paper loss. \n\nI was lucky though. Many sold everything to avoid homelessness.", "score": 10, "replies": []}]}, {"body": "> I lost $40k in stocks over a lunch break.\n\n\n\n/r/wallstreetbets would like to have a word with you.", "score": 13, "replies": [{"body": "That was in index funds. That’s how bad the crash was........", "score": 27, "replies": [{"body": "Index funds.. with 10x margin? Jeez I can’t imagine losing 40k over a lunch break.", "score": 1, "replies": [{"body": "Nope. Normal Fidelity index funds. September 2008 iirc.", "score": 7, "replies": []}]}]}]}]}, {"body": "I was 18 years old and in high school.\n\nMy brother at the time was 23 and just graduated college. He applied to jobs for 6-8 hours non-stop and the only jobs willing to hire him were big oil. He decided to go back to school to get his masters degree as a way to “wait out” the recession. \n\nI was lucky to be in high school, but I was working at Wendy’s with no problems. \n\nBoth my parents had high powered jobs and didn’t get laid off, so my parents bought 40 acres of cheap land, a beach house and a third house in AZ.....", "score": 22, "replies": []}, {"body": "[Sad loss of account value noises]", "score": 47, "replies": [{"body": "*Womp womp!*", "score": 2, "replies": []}]}, {"body": "Watch “The 2000s” on Netflix. \n\nThere’s an episode that covers the crisis and puts it all into layman’s terms. \n\nIt discusses how the rumbles began and then what caused the breaking point. It goes into a summarized, but Very insightful overview of the experience that working-class America had to go through.", "score": 11, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "That's why if you are near retirement you should be in much safer investments.", "score": 11, "replies": [{"body": "Came here to reiterate this. This is where those target retirement funds come in. Slowly and surely building you while creating a more safe nest egg.\nNothing is 100% bullet proof, but this will be the route I take for a large portion of my 401k.", "score": 3, "replies": []}]}, {"body": "Recover?? We were thinking the country was collapsing.", "score": 7, "replies": []}]}, {"body": "Watch the movie The Big Short", "score": 34, "replies": [{"body": "Great movie but it doesn't show anything about what average people went through, which I think is what the thread was asking.", "score": 54, "replies": [{"body": "Exactly", "score": 25, "replies": []}]}, {"body": "I have. The movie pretty much explained why the crash occurred but I want to know what it was like in the aftermath of the crash for the everyday person/investor/retiree. I did really the movie though and thought it was well done.", "score": 27, "replies": [{"body": "I was not invested - I was in college. But people are seriously entertaining the possibility that we were going to have a repeat of the Great Depression. Like, soup lines and 30 percent unemployment. It was pretty crazy in the beginning.", "score": 14, "replies": []}, {"body": "I was working as a personal trainer at the time in NYC. It was a very rough time. Most everyone in almost every industry was affected. \nAll of my clients were affected. Either them personally or their spouse. Many of my clients lost their jobs. Many lost more then that. I had grown folks who were strong minded cry in the middle of a session. Most of my clients were very well off, and they truly had to change their lives, and the way they lived. Even if it was temporary. Because I had worked with a lot of them for years I lowered my rates, and also trained some for free just because I didn’t want them to lose the benefits that movement can do during stressful times for mental health. \nMany if not all of my clients eventually landed on their feet. Most corporations started cutting wages, and letting people go. The people who didn’t lose their job, were extremely overworked, and under paid. The fear of losing their job was very real. \n\nI didn’t invest at the time, or really follow  the stock market. \n\nIronically in my home state of Florida my childhood friends had started working for those mortgage companies. They were making money hand over fist, and they were encouraged to spend it. It was very boiler room, and they didn’t know, or care what they were doing. They were getting paid. That all ended.", "score": 3, "replies": []}, {"body": "Dumb long-term investors sold, smart investors bought (and have made a killing now), smart retirees who properly managed their portfolio based retirement timeline shouldn’t have had their retirement plans massively affected, dumb investors close to retirement obviously had to delay it for the market to recover. The effect on people varied industry to industry. The auto industry was hit very hard, as were financial services. A lot of people were laid off. Lots of job fairs, constant coverage of unemployment, people underemployed. About it really.", "score": 13, "replies": [{"body": "> Dumb long-term investors sold, smart investors bought (and have made a killing now), smart retirees who properly managed their portfolio based retirement timeline shouldn’t have had their retirement plans massively affected, dumb investors close to retirement obviously had to delay it for the market to recover.\n\n“Everybody has a plan until they get punched in the face.”", "score": 11, "replies": []}]}]}, {"body": "Watch the movie Boom Bust Boom.", "score": 3, "replies": []}]}, {"body": "I was working at a bank during that time.\n\nWachovia had merged with my bank and sent us to a training about a new mortgage loan they were going to pitch.\n\nPick-A-Payment loan.\n\nYou got 4 options on how to pay your mortgage. If I remember this correctly...\n\n1st was the minimal payment that didn't even include the interest.\n\n2nd was the regular interest only payment.\n\n3rd was your regular payment\n\n4th was additional principal payment.\n\nTheir logic was for you to sell this loan and for the customer to only pay the minimal payment. All that money that you saved only making the minimal payment you were supposed to put it into investments and make a lot of money.\n\nThis meant you were also supposed to have your investments with Wachovia.\n\nThis was such a bad idea that I never pitched that loan and everyone that came to my station to make a minimal payment, I would circle the correct payment which would usually be double of what they were paying.\n\nPeople were getting approved for 800k homes just based on that minimal payment qualification.\n\nIn the end they would lose their home because all that deferred interest rolled over and now their new payment would be like $3000.\n\nThe market crashed and I lost my job. I could not find another so I went back to school.  I depleted my savings towards rent and food since unemployment was taking so long due to the backlog of filers.\n\nIf  it wasn't for the Obama Administration extending unemployment so much, we would have been evicted from our apartment.\n\nMy wife had her 401k drop pretty badly. She wanted to cash it out, but I didn't let her. I am glad I made that decision because her 401k is now worth about 100k. (She started late)\n\nI made the hard choice of cashing out my 401k because I was not sure if they were going to continue to extend the unemployment. My 401k was smaller than what my wife had, so it made sense to me that I would cash mine out.", "score": 10, "replies": [{"body": "OMG. I remember this! I was in university at the time and taking an economics class. ECONOMICS. Every week, we had to post a topic on an online \"forum\" (this was all new at the time) and our classmates had to comment on it. I posted this topic and all the reasons it was completely horrible. Crickets. And worse, blank stares when i discussed it in class. At the time I thought dear god we are doomed if kids in freaking economics class can't understand this. Some of them even PRAISED the idea, and tried to justify the merits of it. About a year later the crisis hit.", "score": 3, "replies": []}]}, {"body": "I was sitting on my couch trying not to puke because it seemed like I was losing years and years of income in the market.\n\nThen I refinanced my house, bought an apartment building and 4 SFRs and it turned out to be the greatest investments.", "score": 5, "replies": []}, {"body": "when market is down “what was the 2008 crisis like?” “what stock goes up during crisis?”\n\nWhen the market is up “what is the best weed stock to buy?”", "score": 12, "replies": []}, {"body": "I graduated with a bachelors in mechanical engineering in 2008. I saw how hard it was to get a job so I waited it out the recession by getting a masters. After that, finding a job was easy.", "score": 4, "replies": [{"body": "I was only a sophomore when you graduated. By the time I had my ME degree, the markets had bounced back substantially. Finding a job was easy; I consider myself lucky.", "score": 2, "replies": []}]}, {"body": "I graduated university in 2006 and worked as a controller for a small automotive manufacturer. My husband was self-employed. Like many DINK Americans, we played hard and did it all on credit. We could make the payments every month so why not? Dumbest. Idea. Ever. When the crisis hit, our mortgage interest went from 4.75% to 11%. This was an additional \\~$400/month. Even though we were making payments on all of our credit cards, every card issuer slashed our credit limit to the existing balance or zero. This killed our credit score and made it impossible to refinance anything. The minimum payments doubled. I was working in tier 2 automotive at the time. Lost my job. Impossible to find another one since just about every middle manager in automotive lost their job too. Half the people in our community lost their home/job and moved out of state. It was incredibly dismal. We managed to keep the house, but there were times we didn't have electricity or gas for a few days at a time. Camper was repo'd. Lease was up on my car and didn't have the cash/credit to get a new one. It was a good 5 or 6 years before we got our feet under us again. We managed to pay off all our debt and were just finally starting to have a bit of extra every month. Then I found out my husband was cheating on me and i left. \n\nSo many lessons learned. Now, I have more than one income stream and always will. I have 6 months of expenses in the bank. I have extra food in the freezer, extra toothpaste etc in the closet. I'm stashing cash waiting for the next downturn so I can take advantage and invest. I am working to pay off all my debts (only $6,000 on car and student loan left) and NEVER carry credit card debt. I will never forget how vulnerable and terrified I felt EVERY. SINGLE. DAY. Constantly choosing where the money will go that day. Gas or groceries? Electric or creditor? And the calls. Every day a debt collector would call. Eventually we just stopped answering the phone because we literally had nothing. No options. We were in survival mode. For years. YEARS.\n\nListen up kids. Pay off your debts. All of them. As fast as you can. Don't buy a single brunch or beer with the bros until every penny you earn is yours to keep. If anything ever happens, and it will, you will be glad to not have to worry about being a slave to your debts. You can simply shrug your shoulders and carry on.", "score": 4, "replies": []}, {"body": "All the sudden WaMu was Chase and nobody wanted to hire you.  I was pretty close to being homeless. The neighborhood I had worked in turned in to a ghost town and business shuttered up within a few months.  \n\n\nI had one friend who's dad (out of state) wanted to put up some cash to grab some cheap real estate, so he had us visit houses for him. I remember walking through empty neighborhoods with a lot of stray cats. It was creepy. \n\n\nI blame the banks. They're responsible for being experts in risk.", "score": 5, "replies": [{"body": "> The neighborhood I had worked in turned in to a ghost town and business shuttered up within a few months.\n\nThat’s a great point that wasn’t mention much in these comments. The retail stores were hammered. Main streets were rows of empty stores. This even happened in big cities.", "score": 3, "replies": []}]}, {"body": "You can blame the federal reserve for artificially setting interest rates and printing money when we go into the next crash worse than 08 over the next 6 months - 2 years. And it’ll only get worse with time as the federal reserve is forced to raise rates during a depression or suffer a currency collapse. We can’t keep rates low for another 10 years, buy gold", "score": 14, "replies": [{"body": "I’m thankful that they can raise rates. The ability to lower them during recessions is worth it.", "score": 7, "replies": [{"body": "The federal reserve shouldn’t artificially be setting the rates, that’s the free markets job. What you’re saying did happen in the past and yes it’s true it helps. But you don’t understand why you’re wrong this time around. To get out of a recession the fed typically needs about 4-5 basis points (%). We’re currently at 2.5% and we already kept rates at 0 for nearly 10 years. What this causes is an abnormal amount of malinvestment in the economy. Too much money flows where it is not needed because it’s cheap money, it’s practically Monopoly money now since they did QE 3 times and are going onto the 4th in the future; they were unable to bring their balance sheet back down to 800 billion and were stuck around 4 trillion. The only reason the bottom didn’t fall out of the dollar is because everybody believed this quantitative easing shit. When the stock market falls over the next 3 months you might even see them cut rates straight to 0 to try and save it until the 2020 election. The fed will be forced to raise rates during this upcoming depression and it will make it that much worse, aka stagflation.", "score": 0, "replies": []}]}, {"body": "Worse than 08 is a bit of hyperbole, that was *bad.", "score": 2, "replies": []}, {"body": "No clue why this was down voted. It’s 100 correct.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "What’s your degree and job field?", "score": 8, "replies": []}, {"body": "What degree and what job pays $225k a year????", "score": 6, "replies": []}, {"body": "what position do you have to have gone from 52k/yr to 225k/yr in 6 years?", "score": 2, "replies": []}, {"body": "You must not have kids saving 50/60% and maxing the 401k.", "score": 2, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "If they make over 200k? Good luck.", "score": 7, "replies": []}]}]}, {"body": "I’m in the service and looking to go back to school. What kind of degree and jobs did/do you have if you don’t mind sharing?", "score": 1, "replies": []}, {"body": "> I think I went from having $80k to about $50k at the lowest\n\nYou had saved $80k in 2 years? Seems unlikely.", "score": -1, "replies": []}]}, {"body": "I was 13 and was a part of the Arizona collapse. In one year my parents divorced and we lost our home to foreclosure, we had to just walk away from it. Everything I knew was gone. I was able to take 2 boxes of belongings with me as my family moved into a small 2 bedroom apartment. We were on the verge of homelessness my whole high school career. My dad lost everything because he was in Sales and may have even been a loan officer at the time.\n\nNothing has been the same since. Don’t fuck with what’s coming. Protect your families and liquidate while you can at the peak.", "score": 6, "replies": []}, {"body": "The same corruption that caused 2008 crash is still around but in a new form. Now it's stock buy backs, government purchasing equities, cheap credit, car loan defaults, student loan defaults, and bonds worth nothing, and the US's number one export being \"the dollar\".", "score": 15, "replies": [{"body": "Corporate bonds will be the next trigger, in my opinion.", "score": 8, "replies": []}]}, {"body": "Living in Bulgaria at the time, so pretty great.", "score": 3, "replies": []}, {"body": "I was pretty fortunate as I wasn’t invested in much aside from a 401k and didn’t own a house.  I also had some money in savings and was able to actually buy a house when the market cratered since the values in my area dropped by 40%.   The only thing I didn’t account for was job stability.  I got laid off 6 months later but was able to land another job almost immediately so aside from being annoying it was never scary.", "score": 3, "replies": []}, {"body": "My job pooped out due to budget cuts but my SO's job was secure with no effect from the financial crisis. 401k dropped by half. I sold some crappy losers and bought solid companies that I hoped would recover. 401k was back up in a few years and then continued to increase. House dropped a bit in value but then went back up in a few years.\n\nIt was sad to hear about other people so affected; losing their jobs, houses, cars. But my daily life was not affected except for the stress that everyone was feeling about the future. I did not cash out of the stock market. I stayed 100% invested. I also didn't look for another job since I thought someone else needed it more that I. It was scary. There was enough blame to go around.", "score": 3, "replies": []}, {"body": "Started working professionally in markets in 2007.\n\nI remember the first time I sensed something was wrong, in 2007, when I randomly noticed on my Bloomberg terminal that LIBOR was +100bps over fed funds, and thinking... ‘wait, that means banks are afraid to lend each other money... for the next three months?’  I put that concern aside, and went back to focusing on my day job as an analyst.  A mistake.\n\nI remember when Bear got taken out for $2 by JPM.  A weekend.  I was on a long drive home following a roadtrip, my friend passed out next to me.  I spent the entire driving listening to the Asian market opening on CNBC (via XM).  Couldn’t really understand what was happening, but I knew it was important.  I remember laughing because I had recommended to a friend that he dump a position in Bear at $35 a few days prior... better lucky than good.\n\nI remember when Lehman filed and Merrill got wedges into BAML.  I skipped work to watch CNBC.  Just felt like I was living history that day.  I remember going to a conference the next day, and seeing people crying into their laptop screens.\n\nI remember the slew of acronyms that came next... ABCP, SIVs.  Then came the rescues... TALF, TARP.  Everyday, you had to read the paper and learn something new.  Something you didn’t know existed, or that didn’t previously exist, but was now really REALLY important.  \n\nI remember the day the house voted against the first stimulus package.  We all were watching as the votes came in.  Soon, it became apparent the vote would fail.  I think the market was down 700.\n\nI remember the day the VIX hit 100.  I was playing golf that day.  Someone asked me to guess where it was, I said 80.\n\nI remember the bottom tick of the market.  I was at a conference, watching CNBC in my hotel room before meetings started, and Geithner was on trying to calm markets by announcing the results of the ‘stress test’.  Only, it was clear he had NO IDEA what was on bank balance sheets, and the market was dropping with each word he said.  \n\nI remember the day the market turned.  It was when QE1 was announced.  I was on a factory tour.  The 10yr was down, like, five points.  Something ridiculous.  I did the math in my head, and figured that should increase stock values by 15% ceteris paribus.   \n\n\nPoint being... it was crazy.  Like living in a tornado.  I was lucky at the time... in the game, but not senior enough to have any real dominion over decisions.  What I learned: keep your wits about you, try to stay unemotional, remember risk controls, and you’ll be fine.", "score": 3, "replies": [{"body": "If you don't mind me asking, what did you do back then and what do you do now? Just curious...", "score": 2, "replies": [{"body": "Then: rookie equity analyst\n\nNow: ‘experienced’ equity analyst, rookie portfolio manager", "score": 2, "replies": [{"body": "Crazy story, thanks for sharing.", "score": 1, "replies": []}]}]}]}, {"body": "Minor setback for a major comeback.. buy the crash don't listen to the chicken lils", "score": 4, "replies": [{"body": "I was a highschooler at that time. Didn't know a thing about it. I have a question. What did you do when you bought the crash but a few days later/weeks later the same stock fell again?", "score": 2, "replies": [{"body": "If you have the capital, keep buying. Average down.", "score": 2, "replies": [{"body": "This", "score": 1, "replies": []}]}]}]}, {"body": "I live in Western New York. We were not affected like most of the country, not that we weren't affected at all though. I know the real estate market here was very stable. I was 18 at the time and invested 5 grand into the market at ATLs. Made about 300%. But I wasn't some genius. Anyone who basically invested in a blue chip stock in early 2009 doubled their money at the least.", "score": 2, "replies": []}, {"body": "So is there anything I should do to prepare for the inevitable recession? I know no one truly knows when it is  coming or how long it will last. I max my IRA every month, put in 5% to a 401k (no match) and put whatever is left at the end of the month into individual stocks (usually around 200-500 bucks). I have an existing portfolio of around 10k", "score": 2, "replies": [{"body": "Pay off all of your debts. All of them. Use a credit card if you want, but always pay off every month. Keep an emergency fund. And remember when it rains it pours, so keep more than you think you need. Keep cash in a safe in your home and cash in a high interest savings account. Keep yourself valuable in the workplace, but add a 2nd or 3rd income stream. Keep learning new skills, you never know when you might lose your job. Network. Relationship currency is essential.", "score": 1, "replies": []}]}, {"body": "Net worth dropped by half, but I bought all the stock I could afford in March 2009 and recovered in a year. Seemed obvious to me it was major panic time, and thankfully I was young enough to have decades to recover. And that I'd read Intelligent Investor, it's a good primer for the psychology of crashes.", "score": 2, "replies": [{"body": "What made you decide that March 2009 was the time to buy and not before or after?", "score": 2, "replies": [{"body": "As someone smart said, buy when blood is running in the streets. It was mayhem at the time. And I remember thinking that the market was valued the same as a decade prior which seemed nuts to me.  It was like having the opportunity to take a time machine back and invest, so I took it. It paid off very nicely.", "score": 1, "replies": []}]}]}, {"body": "I pretty much just rode it out with my 401k and other investments.   Hindsight being 20/20 it wish I had sold before the big drop then gotten back in.  I took a roughly 30% drop on paper before the turn around.   But I also kept maxing out my 401k contributions.   Net result made serious bank in the next few years on the recovery.", "score": 2, "replies": []}, {"body": "There’s a good video about it. I’ll post it below. \n\nhttps://youtu.be/eD9ry2Lgglw", "score": 2, "replies": []}, {"body": "I didn't react and didn't sell any stock. I knew it would recover. I wasn't making much money then after college, but I increased my 401k percentages to buy as much as possible during that time. I am old (for reddit) so I actually came out of college during the 2000s tech bust and didn't have any money to invest then and I regretted it, so I used it as a learning experience. To me, the tech bust in the 2000s was really more impactful for me and it was harder to find a job since I had recently graduated from undergrad. I lived in a metro area in the 2008/2009 bust and it continued to grow, so it didn't feel as impactful to me, personally.", "score": 2, "replies": []}, {"body": "I graduated from college in 2008.  Got 3 job offers. It was not a big deal at all.", "score": 5, "replies": [{"body": "What field are/were you in?", "score": 6, "replies": [{"body": "Manufacturing engineering", "score": 1, "replies": []}]}]}, {"body": "I was 8 years old at the time and I know if hired my parents finances. Thank God we didn't go broke or anything, but I believe we went through non-pleasing times. We're better know, thank God.", "score": 1, "replies": []}, {"body": "People freaked out more than they needed to.", "score": 1, "replies": []}, {"body": "I was indirectly affected by it because of my age and lack of wealth but I remember how things were affected around me.\n\nI was 23-24 and working for an office supply store trying to figure out what to do with my life. Before the stock started to slide, my company's stock traded north of $40, maybe $50. This was around the time Microsoft released Vista and old people were swarming stores to buy high-end laptops and flat TVs. My company even did a stock match program for 401k plans and offered to pay some college for employees. I quit for a few months in 2008 to try to do something else but ended up back there around Christmas.\n\nBy March 2009, the company's stock was well below $1 and all of us were confused as to whether we needed to look for jobs or buy stock in it. The company quit the stock match and college programs. It even started producing anti-union content that was required viewing. \n\nI was promoted to manager and given a decent raise so I wasn't as concerned with my future or anything else regarding income or expenses that actual adults with children and health issues might've been.\n\nI remember, though, that around then the shale boom began and the oil and gas industry shot off like a rocket. It seemed to really take hold in my state and gave a short-sighted false sense of economic security. I'm sure real estate prices were low enough that big companies could buy plots and extract value with ample labor. \n\nI also remember I was very naive and assumed that a lot of jobless people had it coming. That they were somehow independently responsible for their plight. That was a very immature, narrow view of the world I don't have anymore.", "score": 1, "replies": []}, {"body": "I got married and graduated college in 2005 and got a job with the Air Force.  I bought my first house at the peak of the market in 2007.  I regret not waiting, as a year later the government was giving away free money to first time buyers, and I could have picked up a similar house for a bit less after the crash.  \n\nAt least the house was a modest starter home for only 120k.  I ended up selling it 8 years later, with some nice renovations (new flooring, painting, roof, etc..) for 122k.  Not exactly a win when it comes to ROI.  \n\nWhile I didn't forsee the crash when I bought my house, I was able to take advantage of it as I had saved a nice chunk of change from working my ass off.   \n\nI nervously invested $12,500 in some select stocks in Feb 2009 trying to catch the falling knife. This was my first time ever buying stocks.  The  first month I bled a lot (on paper at least), dropping down to around a $6-7k balance at the lowest.  I didn't sell then though, and it paid off.  I liquidated my holdings 8 years later for around $60k.  \n\nWhen it came to my 401k, I didn't have a lot in 2008, so I just left it invested in stocks and didn't sell.  I also started maxing out my contributions around that time, and I'm pretty happy with my current 401k balance. \n\nOverall I wasn't severely impacted, but I was somewhat insulated due to working for the Air Force in a mainly Air Force town.  I knew my job wasn't going to be in jeopardy and that allowed me to more safely risk that extra money I had saved in the market.  If I would have had a less stable job, I would have never invested that cash.", "score": 1, "replies": []}, {"body": "A year after graduating college with a crappy degree the bottom fell out of the economy. I managed to survive doing tutoring, substitute teaching, and working at a yoga-studio, and eventually got a job at a law firm that was prospering from all the fired employees in the economy. At the time I wanted to go to law school, but the economy was still horrible, and all the young attorney's I talked with were over $200k in debt and having a terrible time finding work, and the work that was being offered, was paying anywhere form 25k-50k (in Los Angeles - which means you couldn't really survive on that with that much debt). So I decided against that route for obvious reasons, but I got stuck in a position I'm over qualified for, and I am still feeling the effects of those lost years when I could of been building a career in a more prosperous time. Whatevs. Money isn't all that important to me, so I still consider myself successful (no debt, good chunk of money in my savings and 401k, and I got married - no home yet though - LA insanely expensive).", "score": 1, "replies": []}, {"body": "Wow, big questions.  It was: seeing everything that you had worked for, your whole life, evaporate and sentence you to the remainder of your life in drudgery.  It was gaining the hindsight that you were a damned fool to remain in this country while your (more astute) former classmates became ex-pats, thus escaping the numerous financial drains that families are subjected to, here.  It was realigning your goals to try to ensure that your descendents only give their life's labors to a country and society that actually gives back, all with the sinking feeling that the misplaced patriotism that you taught them will prevent it.   The blame:  in my view- Greenspan, the banks, Republicans (and I am an ex-R), and the wealthy who are of the Ayn Rand ilk.  Corporations who place profits above being good co citizens also share greatly in it. After the fact: I will never be OK with Obama letting the banks off the hook.  We'll never correct these forces, now.  You sound young. Get out of here.  Out!  It will only get worse, here.  GO!    PS. I don't care to explain any of this, so no questions, please. If you are curious, good. Use that to look up how life elsewhere is different (and often far better).  Read. Learn. Go.", "score": -12, "replies": [{"body": "It was a global recession, bruh. Germany and a few others were the only lucky ones to avoid it. Some parts of the EU still haven’t recovered. WTF are you babbling about?", "score": 3, "replies": []}, {"body": "I was an expat. Expats aren’t immune from the economy. Why do you think they were? U.S. is the largest economy and stock market in the world. 🙄🙄🙄 Dubai, for example, utterly crashed and luxury cars were left abandoned everywhere. It was really scary. It was far worse in some places than in the U.S. (edit: since OP doesn’t get it, if you’re in debt in the UAE, you go to jail. People lost jobs but were in debt, hence they abandoned their cars as they fled the country. Yes, it was scary since you were about to go to jail if you couldn’t find a job or didn’t leave everything behind and leave.)\n\nIt sounds like you don’t actually understand the financial crisis, much less economics and finance.", "score": 18, "replies": [{"body": "[deleted]", "score": -24, "replies": [{"body": "I’ve lived in five continents and over a dozen countries in my life so far. If you think it’s bad in the U.S., you have no idea how bad it is in other places when it comes to “financial drains” (which wasn’t even OP’s question , by the way). Just so you know, American interns at large companies in fields like consulting make more by the hour than an entry-level consultant makes pretty much everywhere else in the world, even in high CoL places like London. \n\nMost else you mentioned completely depends on your employer or you. You don’t like your job? Not treating you well? Quit having a pity party and actually get out there job hunting and investing in yourself. The hiring environment in the US is fantastic right now. \n\nHaha, and you, my friend, can shove your self-righteous ignorance right where it belongs, too, as you drudge along to your dead end job without the motivation or ambition to invest in yourself or pursue new avenues. I’d be slugging along at $45k a year, too, and have utter spite for my country if I didn’t take the risks and sacrifices that I did. The community of petulant losers who blame their situation, usually minimum wage with no skills and/or a useless low-tier education, on the U.S. instead of largely their own lack of drive, foresight, direction, and/or ambition is here: r/IWantOut Please, take your contempt there and bang along with all the others who want to freeload off another country’s welfare whilst offering zero skills or knowledge in return.", "score": 12, "replies": [{"body": "I’m making about 45, after school...", "score": 2, "replies": [{"body": "That's not unusual for a starting salary. It's not good if that's your salary forever. It's a fine salary to live on as a single person if you budget.", "score": 3, "replies": []}]}, {"body": "You know nothing about me, and how much I have worked, the education attained and sacrifices made. Along the way, did I get to have 6 wks of vacay per year to actually live? No.  Spend time with newborns in the family? No.  Goes on and on. The link to OPs question is this: you can save for what should be a good retirement, only to realize that you were stupid not to spend it on fun. Because. You. Live. Here.  \nU/txcotton are a low life bottom feeder, horses ass.", "score": -16, "replies": [{"body": "If you had a good job, you wouldn’t have to do any of that. Poor life decision making and financial management, sorry. Have you considered budgeting and self-control? It’s quite lacking in American society. Also, don’t become a social worker expecting the wage of an investment banker. Sorry to say this is a universal truth in any country, you know, since I’ve lived in a dozen and seen it firsthand. \n\n>The link to OPs question is this: you can save for what should be a good retirement, only to realize that you were stupid not to spend it on fun. Because. You. Live. Here.\n\nGenius! Yes, don't save for retirement!\n\nI hate to inform you of this and shatter your delusion, but expenses and (much higher) taxes exist outside the United States, too. I’ve paid far more in fees and taxes in foreign countries than I ever did in the U.S. \n\nDespite the irony of you calling me a “bottom feeder” when you want to immigrate to another country to freeload off their welfare because you can’t seem to support yourself despite all this education and sacrifice, at least I can retire tomorrow if I wanted and don't resort to blaming others for problems that I created.", "score": 11, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Sources?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "First article already disproves what you said.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Read better. Do some math.  It shows that 37% get nothing whatsoever.  Those who get anything get an average of 10 days.  Ten!  In an entire year!  You want to accept that over a guaranteed 6 weeks of paid vacation?  Why shouldn't families get two weeks together, a few times a year?  We should all just live only to work ourselves to an earlier grave?  Why even do that?  Further, the article says that: \n\n“The United States is the only advanced economy in the world that does not guarantee its workers paid vacation days and paid holidays,” says John Schmitt, Vice President of the Economic Policy Institute, in a report for the Center for Economic and Policy Research. “Relying on businesses to voluntarily provide paid leave just hasn’t worked. It’s a national embarrassment that 28 million Americans don’t get any paid vacation or paid holidays.”\n\nSo... To you these people don't exist, or don't matter?  That's really terrible.  Tell you what, we will leave things as they are, except that you and the others who have shown yourselves to be illiterate psychopaths are the ones to go into these jobs that you think are just fine for others.  It's fine for them, so it's fine for you, right?", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No, you stubbornly refuse to acknowledge that a great percentage get NO time off, at all, ever.  Man you really hate your fellow citizens to the extreme.  If you are OK, then to hell with them, eh?", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "All of these are either only partially true or completely false.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "There are numerous exemptions for overtime pay, thanks to Bush.  There is more, but I must stop. Pain crisis happening. No ER for me, don't want medical bankruptcy. What you need to do is look for the evidence that you are wrong, it's readily avail.  I have to go vomit more from pain.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Ha!  I have insurance and get checkups you damned fool!  Doesn't matter. Been down this route before, they have plenty of loopholes to get out of paying for whatever they want, and all the lawyers in the country won't make a damn bit of difference.  See that's the difference between single-payer healthcare- and what we have here. Health premiums are merely a tax under a different name here, but paid privately, and with no guarantee of services behind it, and so it only gets you in the door. Says right in the paperwork that it doesn't guarantee payment. Why do you think so many people go bankrupt over medical bills!?!   You think crises can happen on a schedule!?!  You are such a fool that even trying to discuss basic concepts with you is a waste of time.  It is people like you that are the reason people like me give up on trying to help win the same, basic life-saving human right benefits that already exist elsewhere.  When you need help and cannot get it, remember - YOU chose this for yourself and everyone else. You could have joined the fight, but while fellow citizens fell down around you, you didn't give a shit.  You'll get what you give, your time will come. Remember, unlike the others, you deserve it. Every last bit.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You sound nice.  Clearly many people do experience it. One million medical bankruptcies a year.  Yet, you don't think that there's a problem. Okay, dumbass or insurance agency shill doesn't matter. Hope there is a hell for you, as you deserve it.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "By the way, genius: if you’re in debt in the UAE, you go to jail. Bankruptcy doesn’t exist. Yes, it was a bit scary. You haven’t seen the “real word” or how bad it can get.", "score": 1, "replies": []}, {"body": "Oh, Russian propaganda bullshit. Ok.", "score": 0, "replies": [{"body": "Ha!  Even in Russia, new parents get months of family leave.  No, it's not propaganda, but what you should do is to look up this information for yourself, and ask yourself why Americans should live only to work and work and work, just trying and hoping to some day retire, only to have their hard work earning swept away under a financial crisis.  Yet the banks did not pay damages for what they wrought.", "score": 1, "replies": [{"body": "Guy that knows specifics about Russian family leave says it’s not Russian propaganda. 👍👌✌️", "score": 1, "replies": [{"body": "It's online!  Mexico, Canada, Sweden, throw a dart at a map and they all have it. Everyone but us (and a couple tiny obscure islands never heard of).  But you go ahead, triggered little one, stick your head up your behind, and when you have children you can shuttle them off to daycare when only days old and in the midst of measles outbreaks, lest you lose your job (and here, then healthcare, too, because this country is so great, right? So free to leave a job).  That's cool, though, because if your children die I do not care. Only the children of decent people matter to me.  Not ignorant bastards like you.", "score": 0, "replies": [{"body": "If you don’t like the US so much, then move. We don’t care.\n\nI looked at your comment history and the anti-USA rhetoric is thick.", "score": 3, "replies": [{"body": "Only those who hate the US do not want it to improve. Living here should not mean what it does for citizens.  How do you like that 3 year shorter life expectancy?", "score": 0, "replies": [{"body": "Lol. Beat it, dude.", "score": 2, "replies": [{"body": "Coaches who want the team to win push it to get better. Teachers who care do the same for students. True Patriots want better for this country. You are no patriot.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Every relative I have around the globe, and friends who became ex-pats, earn a good living. Yet, they also can live life, travel, spend time with family and friends, get help when sick, etc.  So, here in the US, what that financial crisis meant is that all the work was for nothing.  The education to earn more was for nothing. The gains went away. The student loans did not.", "score": 0, "replies": [{"body": "Wow, it's almost as if expats get hired into good jobs because it's a big expense for companies to 'import' workers. All that stuff you mentioned comes along with good jobs in the U.S., too. However, your underlying motivations come out: student loans. Apparently you took out a ton of debt for something that won't pay off through higher income and you're apparently not budgeting. Yet, it's America's fault.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "go look at a chart history. \n\nbanks and republicans are to blame.", "score": -17, "replies": [{"body": "The crisis was the culmination of decades-worth of negligent regulatory due diligence, which had Democratic and Republican administrations.", "score": 13, "replies": [{"body": "As a far left democrat, you are correct. The Clinton administration had a lot to do with the housing crisis. They made mortgages available to people with little assets. I don’t remember all the details, but it was not an R specific thing. \n\nThat said, Greenspan ran the ship right into the iceberg. He knew what was happening and didn’t lift a finger.", "score": 4, "replies": []}, {"body": "it was 90% due to republicans.", "score": -2, "replies": [{"body": "Oh ok, that sounds like a reliable figure that you certainly didn’t just make up for an incredibly complicated crisis.", "score": 9, "replies": [{"body": "Keep defending republicans. Go do your research.", "score": -8, "replies": [{"body": "Ok, I’ll go “do my research,” which I’m sure for you entailed watching two or three 90-minute movies or documentaries, even though I never once defended Republicans and simply pointed out the naivety of your comment, which was an infantile attempt to explain an incredibly complex issue through arbitrary party lines.", "score": 8, "replies": [{"body": "Blaming both democrats and republicans is defending republican.", "score": -1, "replies": [{"body": "Jesus Christ. You’re top of the bell curve.", "score": 14, "replies": [{"body": "That's who republicans hide behind. yes.", "score": 4, "replies": [{"body": "Literally sounds like you just hate republicans lol", "score": 4, "replies": [{"body": "I do. But that doesn't change the fact that they are the cause of 90% of problems.", "score": 1, "replies": [{"body": "name the problems. Democrats arnt squeaky clean either, both parties are retarded", "score": 5, "replies": [{"body": "Deregulation of all industries is the biggest problem.", "score": 1, "replies": [{"body": "whats the other 89%", "score": 2, "replies": [{"body": "Appeasing white trash and religious people.", "score": 0, "replies": [{"body": "but the democrats loved slavery and kept the black man from voting. sounds pretty vile to me", "score": 3, "replies": [{"body": "are the /r/the_dipshit brigading /r/stocks? thanks for failing american history. you're blocked.", "score": 0, "replies": [{"body": "LOL", "score": 3, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Set up by republican house. Thanks for playing. idiot.", "score": -8, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Okay, you’re also a retard and also blocked. If Clinton was a republican, Fox News wouldn’t put out the hit job. You’re part of the problem. One only hopes you’re not american.", "score": -6, "replies": [{"body": "You need help bro and should take a step away from the internet and enjoy life", "score": 10, "replies": [{"body": "I enjoy life quite fine. I wish people would stop defending republicans. Republicans deserve to be exterminated.", "score": -1, "replies": [{"body": "Yikes, that’s a lot of hate for a party that was responsible for things like freeing the slaves. Idk why politics cause people to have so much hate. At the end of the day most political view points tend to line up sooo.", "score": 0, "replies": [{"body": "you're blocked for being a moron.", "score": 2, "replies": []}]}]}]}, {"body": "Imagine if politicians cared for nothing but short term gain and pretended to be on either side for idiots like you. \n \nI’m sure you don’t want to ruin the Clinton’s good name since they’re rapists and pedophiles.", "score": 2, "replies": []}, {"body": "Block me too please, make Reddit great again", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Republican, Democrat....Two heads of the same snake.", "score": 9, "replies": [{"body": "True that.", "score": 2, "replies": []}, {"body": "you're kind of an idiot.", "score": -1, "replies": [{"body": "Your", "score": 1, "replies": []}]}]}]}, {"body": "Here’s another doc to watch. It’s made by hbo\n\nhttps://youtu.be/wyz79sd_SDA", "score": 0, "replies": []}, {"body": "I got my first job, had $0, got a loan bigger than one years salary, invested it all, market crashed 30% within a week of my deposit. I internally cringed, worked hard, lived with my parents and invested 75% of my income, stock market bottomed and started coming back up, whole stock market was bargains.", "score": -1, "replies": []}, {"body": "Maybe you could look at the „What was the 2008 financial crisis like“-thread from yesterday, or from the day before yesterday, or the day before that day", "score": -16, "replies": [{"body": "I don't remember seeing those....", "score": 4, "replies": []}, {"body": "This keeps coming up for some reason", "score": 0, "replies": []}]}]}
{"title": "u/rhibkr’s investment club puts in a market order for 700 shares of TSLA at $243. Then wonders why orders fill at different prices.", "selftext": "[deleted]", "id": "bw2j08", "created_utc": 1559510899.0, "score": 1821, "upvote_ratio": 0.96, "num_comments": 305, "comments": [{"body": "How do I short this club", "score": 1508, "replies": [{"body": "Short TSLA and buy TSLA calls.", "score": 386, "replies": [{"body": "Good man, never short without a collar.", "score": 95, "replies": [{"body": "Does a dog collar work?", "score": 34, "replies": [{"body": "Yes daddy", "score": 80, "replies": []}, {"body": "Only a shock collar.", "score": 9, "replies": [{"body": "I'm a bad dog. Not a good boi.", "score": 7, "replies": []}]}]}]}, {"body": "That might actually work", "score": 20, "replies": []}, {"body": "Or just buy puts", "score": 5, "replies": []}]}, {"body": "Lol at first I read “puts” and thought they must’ve made a killing.   \n\n... Then I re-read the title.", "score": 12, "replies": []}, {"body": "Ask them if you can offer free investing advice and you're a sup3rPr0 and just inverse the stupidity you feed them", "score": 3, "replies": []}]}, {"body": "> small beginner college investment group\n\nHas $170,000 to toss around jfc", "score": 690, "replies": [{"body": "Peak Bull Market", "score": 359, "replies": [{"body": "Dead on. Too much loose capital (FED) being thrown around with no market forces to reign it in.\n\nIn this case, I blame college grants, never heard of a 200k grant for trading, but I wouldn't be surprised from a dumb IVY SCHOOL.", "score": 193, "replies": [{"body": "I know of a small private university where the students manage $2.5M so that's not even that crazy", "score": 90, "replies": [{"body": "Name the university. Most students in the US aren't trusted with 2K let alone 2,000 K", "score": 43, "replies": [{"body": "[deleted]", "score": 92, "replies": [{"body": "How much of that is entrusted to student-run funds?", "score": -3, "replies": [{"body": "[deleted]", "score": 53, "replies": [{"body": "So you are telling me it is more than DUMB IVIES literally throwing their money away to undergrads? We are in big trouble.\n\nEDIT: Corruption is the only reason they are not using mock trades", "score": -32, "replies": [{"body": "[deleted]", "score": 27, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 22, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "dude, why are you so negative? University of Texas's endowment is at $26.54 billion.", "score": 12, "replies": [{"body": "uh, because you can do the exact same thing with mock trades?", "score": -5, "replies": [{"body": "yeah but those students will never feel real depression and suck cocks for FD.", "score": 9, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Same, I get fired up, sometimes just fire blame in a shotgun pattern.", "score": 1, "replies": []}]}]}, {"body": "So, if they get accepted to a \"fake\" investment/hedge fund that should make their resume better? LOLOLOL\n\nThat is why higher education is becoming unusable. They play pretend for 5 years and then you ask them to do real stuff and they fail HARD.", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Fordham trusts their students with like 1.6 mil I think", "score": 20, "replies": []}, {"body": "My Universities student-managed fund started at $200k when it was partitioned from the rest of the college's funding. Not sure about the immediate value of it.", "score": 9, "replies": []}, {"body": "My alma mater is a medium sized in-state public school in the Midwest with a $2.5M investment fund managed by students. And the school isn't even prestigious or difficult to get into. I mean... I graduated from there and look at me... on WSB losing my retirement.", "score": 6, "replies": []}, {"body": "Uni I went to had a student run fund as well, 1.8m when I was there.", "score": 4, "replies": []}, {"body": "I’ve heard from friends that Drexel has some students managing in the millions.", "score": 3, "replies": [{"body": "At UNCG we had 1.5 MM. It started as a grant back in the 80’s of a few thousand. There we’re still pretty strict provisions in place to prevent us from yoloing it on FDs.", "score": 4, "replies": []}]}, {"body": "Florida state university", "score": 1, "replies": []}, {"body": "Emory has a real estate fund with several hundred grand entirely managed by students. Actually think it may be over 1m now. There is also an alternative investment fund co-managed by students with ~15m.", "score": 1, "replies": []}, {"body": "University of dayton seniors have a student run fund worth 30 mil.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "*Bro, How do we invest in Juul?*", "score": 7, "replies": []}]}]}, {"body": "When I was in school 7 years ago we had an investment club that was funded by an investment bank. They funded a couple of schools with $250k each to manage. At the end of 18ish weeks, the school with the highest returns got it ~~matched by the bank or something and~~ added to a scholarship fund. I don't remember the specifics but here are some links about it. \n\nhttps://harbert.auburn.edu/students/current/clubs-organizations/auburn-student-investment-fund.php\n\nhttps://www.linkedin.com/company/a-s-i-f/about/\n\nEdit: Here's a link with better info http://wireeagle.auburn.edu/news/4989", "score": 12, "replies": []}, {"body": "I thought the user in question is in Texas, no Ivy schools there.", "score": 17, "replies": [{"body": "Doesn't negate your point, but Texas school systems have a bigger endowment than many Ivys.", "score": 7, "replies": [{"body": "True enough", "score": 4, "replies": []}, {"body": "UT Austin has a small investment club. Like 7 people bee graduating class... soooo...", "score": 1, "replies": []}]}, {"body": "Rice should count academically?", "score": -1, "replies": [{"body": "No one in the Ivy is counting Rice among them. But it has a reputation of being a better school than allowing for this stupidity.", "score": 4, "replies": []}]}]}, {"body": "our taxes are paying for this?...", "score": -5, "replies": [{"body": "Do you know what a grant is?", "score": 37, "replies": [{"body": "Oh I know what a grant is in this situation.  \n\n\nRich people's monopoly money gifted from the government in the form of fancy over billed projects that no one ever hears from. And that is taxpayer money. Bring the fucking syndicates on this one.", "score": -2, "replies": []}]}, {"body": "No?", "score": 5, "replies": []}, {"body": "Good question! Answer: No.", "score": 1, "replies": []}, {"body": "(Guy who went to public school)", "score": 1, "replies": [{"body": "((private school elitist))", "score": 2, "replies": []}]}]}]}]}, {"body": "I took out a reverse mortgage because the rate was great, now I throw the cash at Weeklies, is this good for beating the market?", "score": 58, "replies": [{"body": "let me put it this way, you are going to beat payday loan guy for sure", "score": 50, "replies": [{"body": "Oh god. Someone did that?", "score": 16, "replies": [{"body": "yes: [https://www.reddit.com/r/wallstreetbets/comments/bv1nbm/making\\_delicious\\_deep\\_fried\\_tendies\\_with\\_payday/](https://www.reddit.com/r/wallstreetbets/comments/bv1nbm/making_delicious_deep_fried_tendies_with_payday/)", "score": 32, "replies": [{"body": ">580% interest rate\n\n&#x200B;\n\nyikes", "score": 34, "replies": [{"body": "That's annual, if he pays it back after a month he's charged £500.\n\nI thought that was gonna sound rational. Yikes indeed.", "score": 11, "replies": [{"body": "Yeah, but that's like 20 bucks American money", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I mean if we pooled our credit cards together we could have an investment club just like that.", "score": 14, "replies": []}, {"body": "Could be a trust fund babies starter investment", "score": 4, "replies": []}, {"body": "student loans\n\nthey are 'covered calls' WHAT CAN GO WRONG? \n\nI know a guy who bought his first house and used his student loan for his downpayment, i know another one who started a business with his student loan and another one who toured all over the world with his student loan\n\ni don't know anybody who opened a trading account with a student loan but many do", "score": 4, "replies": []}, {"body": "I mean my schools club had a mil, but it also had fucking committees", "score": 2, "replies": []}, {"body": "Much less than that, they're probably using margin.", "score": 1, "replies": []}]}, {"body": "How do I sign up for his investment letter?", "score": 198, "replies": [{"body": "*Newsletter Publication #233*\n\nDear Mom,\n\nWellstrade stole my tendies.  Please send moar.\n\nLove,\n\nAustin Investment Club", "score": 186, "replies": [{"body": "PS Get the basement ready, it happened again", "score": 49, "replies": [{"body": "PPS double-down on black", "score": 8, "replies": []}]}, {"body": "*Autist Investment Club", "score": 20, "replies": []}]}]}, {"body": "[deleted]", "score": 524, "replies": [{"body": "This professor supposedly gave 7 college kids over $170,000 to play with and offered so little guidance and oversight that one of them is posting a question to reddit about why their separate on-open market orders filled at a bunch of different prices.", "score": 536, "replies": [{"body": "Real money? This can't be real", "score": 251, "replies": [{"body": "It's either not real, not real money, or real money laundering.", "score": 292, "replies": [{"body": "Or real /r/wsb users in action", "score": 152, "replies": [{"body": "I think it is even drunker wsb than usual", "score": 33, "replies": [{"body": "Maybe they’re stoned?", "score": 8, "replies": [{"body": "Stoned on crack rocks. Like Ike and Tina!", "score": 3, "replies": []}]}]}, {"body": "No way. We are way better than the r/options guys.", "score": 1, "replies": []}]}, {"body": "SEC OPEN UP", "score": 2, "replies": []}]}, {"body": "This is absurd. There are literally dozens of fucking websites that let you pretend play with real stocks and options, and real stock prices, in real time, but with pretend money.\n\nWhy the fuck couldn't they just do that.", "score": 122, "replies": [{"body": "Any recommendations on one to start with, play money?", "score": 41, "replies": [{"body": "Marketwatch. But paper trading is a waste of time, just go long on SPY with your retirement funds", "score": 125, "replies": [{"body": "Long calls? Or hold stocks long term", "score": 5, "replies": [{"body": "nah man long short term weekly options", "score": 59, "replies": [{"body": "I’m just as confused now", "score": 29, "replies": [{"body": "Welcome to WSB!    (If you want to be conservative just buy the index and hold, no options for your retirement funds)", "score": 20, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Then be liberal with your money and donate it to lazy people via puts.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Then abort kids early?", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Then abort kids late?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Dude. Too far!", "score": 1, "replies": [{"body": "Yes I want those far away", "score": 1, "replies": [{"body": "Look around you.  Wsb May be one of the most libertarian places you could be. It’s like thunderdome for autist shut-in gamblers that don’t want other people messing with their lives.", "score": 1, "replies": [{"body": "Nah, they give away their money like candy\n\nPhilanthropy even due to autism is pretty liberal", "score": 1, "replies": [{"body": "Haha.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Sqqq is popping and this guy is saying yolo Spyyyyyyyy!!!!!!!  \n\nDid that resolve that for you?", "score": 4, "replies": []}, {"body": "I'm 80% sure he was just saying a string of investment words for humor purposes.\n\nIf you invest in full market index funds you're likely to do better than anything you read about here. SPY is one such fund, but you can get better ERs by going with Vanguard, and less risk with full market, domestic and international, and adding some bonds.", "score": 1, "replies": [{"body": "Thanks for reaching out to me bro  ! Wsb is like a cesspool of bad jokes hard to know what’s what", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Paper trading is only good if you have zero experience and want to see the mechanics of how the market moves.\n\nThe hardest part of trading is your own psychology, and paper trading doesn't give you the same greed/fear you get from having skin in the game.", "score": 52, "replies": [{"body": "I do have zero experience. The second part I definitely understand from gambling.", "score": 13, "replies": []}, {"body": "But then again you can argue if someone gave you 150k you might not care if you lose it...", "score": 7, "replies": [{"body": "Pretty sure in that hypo I'd drop the investment class and invest the 150k in my bank account.", "score": 15, "replies": [{"body": "What a waste, you could order 150k cheese burgers with that.", "score": 1, "replies": [{"body": "Make sure it's not a market order", "score": 1, "replies": []}]}]}]}]}, {"body": "Robinhood", "score": 20, "replies": []}]}]}, {"body": "I graduated with a finance degree and our university had the same thing. Our club was up to like over 1 mil by the time I graduated. I think the original amount was like 100k donated a long time ago by an alumni. Our club was pretty big. Like 20 people and we break into groups and research what we want to invest in and we take turn convincing the club to go with our choice.", "score": 10, "replies": [{"body": "Did you get to keep the money?", "score": 1, "replies": [{"body": "The club/school does. I guess I never really asked what would eventually happen to it. We wouldnt get in trouble if we lost all of it so I doubt we can keep it just because we made a profit.", "score": 1, "replies": []}]}]}, {"body": "Sorry it's real, most finance departments do this 'charity' work for free, for local pensions and charity's and such. My smallish college in East Tennessee has an investment 'club' with about the same numbers.", "score": 17, "replies": [{"body": "Hold on.. where is the money coming from and where does the money go, provided the investment doesn’t go to zero? \n\nIt almost sounds like you’re saying the student investment clubs are managing the pension/charity’s money “for free” as a form of community service. There’s no way I have this right, that would be the most idiotic thing I’ve ever heard.", "score": 22, "replies": [{"body": "We had a PhD in finance overseeing our decisions lol. He wouldn't exactly let us go all in TSLA puts. There was plenty of restrictions. However, yes most college finance departments do help run local pensions and charity's funds free of charge. I'm going to guess you have a degree in gender studies and wouldn't know that.\n\nEdit: Holy shit how do you have so many posts in r/politics,  your a fucking bot. Honestly get a life.", "score": -10, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "I mean since we are taking money out of savings accounts and putting them in markets our numbers look great!", "score": 6, "replies": []}, {"body": "Maybe WSB could offer this service too?", "score": 1, "replies": []}, {"body": "Everyone knows what they’re getting and it’s never much money to begin with, get a grip.", "score": -5, "replies": []}]}]}]}, {"body": "> college\n\nAin't what is used to be.", "score": 17, "replies": []}, {"body": "In my (rather small, ~15k enrolled) public college I am in an investment class. We have $800k to play with and it’s relatively small fund compared to other colleges especially those who have had these for a while. We also aren’t allowed to do any options trading though and our professor has to approve all trades after a class discussion", "score": 5, "replies": [{"body": "Yeah, it's that last part that makes the difference here.", "score": 3, "replies": []}]}, {"body": "The only way I could see it real is that it was donations from alumni to the investment club and it was seriously mismanaged. Our uni has a entrepreneurship program that sets you up on starting a business and gives you some resources.", "score": 2, "replies": []}]}, {"body": "$170k and they lost $40k now lol. That professor is retarded", "score": 60, "replies": []}, {"body": "Wait so this is real?", "score": 51, "replies": [{"body": "I'm really hoping it's a good troll and that there's not an \"investment club\" this stupid.", "score": 58, "replies": [{"body": "I'm hoping there IS an investment club this stupid.", "score": 53, "replies": [{"body": "I second the motion", "score": 4, "replies": []}, {"body": "You're in one you autist. Don't pretend not to know us you dipshit.", "score": 4, "replies": [{"body": "WSB isn't stupid, it's just full of degenerate gamblers.", "score": 1, "replies": []}]}]}, {"body": "Dudes definitely a troll. He’s good tho", "score": 23, "replies": []}, {"body": "I'm stupid and even I know not to do this with my tiny budget. Can't believe they used real money", "score": 0, "replies": []}]}, {"body": "No this and op were done for karma.", "score": 0, "replies": []}]}, {"body": "what school is this lmao", "score": 43, "replies": [{"body": "University of Phoenix", "score": 93, "replies": [{"body": "the fighting phoenix's!!!", "score": 12, "replies": [{"body": "\\*Phoenixi", "score": 3, "replies": []}]}, {"body": "more like University of Benis ayyy lmao", "score": 3, "replies": [{"body": "ヽ༼ ຈل͜ຈ༽ ﾉ Raise ur dongers!\n\n^^Dongers ^^Raised: ^^45324\n\n^^Check ^^Out ^^/r/AyyLmao2DongerBot ^^For ^^More ^^Info", "score": 1, "replies": []}]}, {"body": "It is considered the Harvard of online universities...", "score": 1, "replies": []}]}, {"body": "Trump University", "score": 31, "replies": [{"body": "Trump U sounds like an insult\n\n> Yeah, well.. Trump U too!!", "score": 10, "replies": []}, {"body": "Trump U would have done it all on margin.", "score": 8, "replies": []}, {"body": "Such a great bargain folks", "score": -2, "replies": []}]}]}, {"body": "It gets better. I commented on that original post. \n\nThey put in an AMC market order in the middle of TSLA marketing and pricing their recent overnight secondary offering. You *never* do that unless you’re specifically making a cap structure trade. There’s like 25 dumb things all wrapped up into one remarkably bad trade.", "score": 40, "replies": [{"body": "This is just poor internal controls tbh. I used to run a college funds. We had 5 million in AUM and it was entirely student run. Except for when we made trades. Any time I traded I had to have our director with me (who used to manage a hedge fund) to ensure orders were placed properly. \n\nWhat they really need is a defined set of procedures and articles of governance to ensure dumb shit like this doesn’t happen,", "score": 30, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I’m assuming these are funds you’re referring to in which case neither.\n\nSmall private school, actually first in nation to start up a fund with real money. We started in like tbe 60’s and got up to 5m just due to capital accumulation (minus 5% a year taken out by school)", "score": 10, "replies": [{"body": "5% of growth, or 5% of the fund?", "score": 3, "replies": [{"body": "5% of the fund. So for instance, the last year before I left we did like 18% in equities and 5% in bonds. And we are weighted about 80% equity. So based on that we would’ve made 720k in stocks and 50k in bonds giving a portfolio value of 5.77m and then our school would take out (5.77 x 0.05) which is around 300k", "score": 2, "replies": []}]}, {"body": "What kind of gains are you guys seeing that 5% yearly is sustainable?", "score": 2, "replies": [{"body": "I did the numbers awhile ago and if I remember correctly we average around 13% per year in equities and 5% in bonds. Our stock portfolio is aggressive high growth and bonds are mostly “junk” \n\nWe take a lot of risk but the markets been good to growth lately. But yeah we’ve won like 14 national competitions in the past 20 years so it’s kind of crazy how consistently well we’ve done (knock on wood)", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Pls explain why this is bad.", "score": 15, "replies": []}]}, {"body": "FOOLS\n\nYou'll find nothing here but death!", "score": 106, "replies": []}, {"body": "It's because they didn't synchronize the clocks on their dedicated trading rigs.", "score": 209, "replies": [{"body": "They obviously should have used an air gapped machine...", "score": 54, "replies": [{"body": "Air you talking about a computer running off of vacuum tubes like the 1960s?", "score": 5, "replies": [{"body": "I mean...  Technically yes??", "score": 1, "replies": []}]}]}, {"body": "a 15 year old hacked in and changed all their trades to fill at different prices, ggwp", "score": 17, "replies": []}, {"body": "It was too late the club left Bluetooth on", "score": 14, "replies": []}]}, {"body": "I'm scared that this sub is making me feel like \"well at least I'm not *that* much of an idiot\" when I'm still obviously clueless.", "score": 198, "replies": [{"body": "Maybe this sub is educational, in an extremely nontraditional way. We just wait for people to fuck up, laugh at their fuck up, explain why they fucked up and learn from those fuck ups. It can't go tits up.", "score": 141, "replies": [{"body": "Yeah, I learned not to make box spreads because they actually can go tits up.", "score": 28, "replies": [{"body": "I'll never forget this lesson because of that bomb ass gif.", "score": 3, "replies": [{"body": "Which gif? I think I missed this.", "score": 1, "replies": [{"body": "GIF: https://www.reddit.com/r/wallstreetbets/comments/ahy7dy/the_legend_of_1r0nyman/\n\nExplanation: https://www.reddit.com/r/OutOfTheLoop/comments/ah32l2/whats_up_with_1ronyman/", "score": 3, "replies": []}]}]}]}, {"body": "This is literally what I'm doing. Playing with a fake money account and learning how I'm stupid from this sub.\n\nI'm still very stupid.", "score": 38, "replies": [{"body": "Don’t say that buddy, just move to Europe", "score": 13, "replies": []}]}, {"body": "Do you learn more from your successes or from your mistakes?\n\n* Taps temple", "score": 2, "replies": []}, {"body": "And do the same fuck up ourselves because \"lmao, im too smart for that\"", "score": 1, "replies": []}, {"body": "If you see enough it's not terrible. Knowing what not to do is basically the key to navigating anything.", "score": 1, "replies": []}, {"body": "Boxspreads are free m...", "score": 1, "replies": []}, {"body": "I always try to learn from other people's mistakes. That doesn't prevent me from making my own, unfortunately.", "score": 1, "replies": []}]}, {"body": "i dont invest but i do like reading the posts here for the schadenfreude of it.", "score": 11, "replies": []}, {"body": "I accidentally got put 1000 shares of WWE at 82.5\n\nIt’s at 72 and change.\n\nMy butt", "score": 2, "replies": []}]}, {"body": ">user reports:\n\n\n>1: It's targeted harassment at me\n\n\nLol.", "score": 1, "replies": [{"body": "The idiot got my reddit account temp suspended because I sent him a one sentence message telling him he’s an idiot. So sensitive lmao", "score": 2, "replies": [{"body": "I hate this world.", "score": 1, "replies": []}]}]}, {"body": "I refuse to believe people are really this fucking stupid", "score": 74, "replies": [{"body": "On the contrary I pray that they are.", "score": 35, "replies": []}, {"body": "I downloaded all the data and TSLA and it traded well above 250 in the after hours may 2nd and well below it in the premarket may 3rd, also the 15 minute high after the open was only 249. I highly doubt this story true, unless somehow the broker saw the order was so stupid and just executed it an hour after the open, knowing there would be more liquidity. But even that I don't believe. I think he is just a troll.", "score": 20, "replies": [{"body": "He's deleting his post & comments.\n\nA troll would've rejoiced.", "score": 10, "replies": []}, {"body": "why also pool ur money together and make 7 accounts or do 7 different orders?", "score": 12, "replies": []}]}]}, {"body": "Another stroke of genius from the comments sections:\n\n>I'm super long on Tesla so idc. Just making the point, market orders are fine for bagholders", "score": 38, "replies": [{"body": "I didn't know bagholding was a profession", "score": 2, "replies": [{"body": "It is. It falls into the same category as professional loser or retard.", "score": 3, "replies": []}]}]}, {"body": "THIS:\n\n&#x200B;\n\nOn a side note, TSLA is now at $185.", "score": 99, "replies": [{"body": "Hello would like to join your gang good sir", "score": 32, "replies": [{"body": "Me too!", "score": 6, "replies": []}, {"body": "Just need to buy puts!", "score": 1, "replies": [{"body": "I would prefer a synthetic short", "score": 3, "replies": []}]}]}, {"body": "THIS:\n\n>THIS:\n\n>​\n\n>On a side note, TSLA is now at $185.", "score": 1, "replies": []}, {"body": "TSLA too the moon $___$", "score": 1, "replies": []}]}, {"body": "LMAO this guy posts on /r/financialindependence asking about retiring early.", "score": 63, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "Ummmmm....  [u/rhibkr](https://www.reddit.com/u/rhibkr/) if you wanna check that out for yourself.\n\nThis is why those subreddits are going to shit - because every fucking loser thinks they can save their way to financial independence without any effort to figuring out how they can create value / increase their earnings.", "score": 12, "replies": [{"body": "Yeah, like MLM people. They’re so brainwashed into not wanting to work 9-5, they’d rather work all the time, and annoy all of their friends in the process.", "score": 16, "replies": [{"body": "*puts “entrepreneur” in Instagram bio* “I don’t get how people can work 9-5 jobs, they’re soul sucking” meanwhile they go broke getting conned by pyramid schemes", "score": 6, "replies": [{"body": "by a much crappier and evil-er organisation.\n\nI feel sad for them. Hope you find a way out all MLM-ers.", "score": 1, "replies": []}]}, {"body": "ALL IN ON JEFF SKINNER. Stanley Cup tendy’s will be imminent. Calls on $SKINZ. Short Scandella", "score": 2, "replies": [{"body": "Jeff Skinner is the nhl equivalent of this sub. Supremely risky for the amount of money he’s rumored to be seeking.", "score": 3, "replies": []}]}]}]}]}, {"body": "Also posted on povertyfinance about not owning a dryer so", "score": 17, "replies": []}, {"body": "Tagging so I can see his history u/rhibkr\n\nEdit: The fuck? This guy’s also been trying to pursue illegitimate channels for baby adoption. Someone needs to keep their eye on this guy", "score": 26, "replies": [{"body": "You weren't kidding, a cursory glance makes it look like he's researching privacy options so he can do human trafficking to fund his retirement now.", "score": 17, "replies": []}, {"body": "And that monster has been trying to shrink t-shirts without a dryer! The Gall!", "score": 6, "replies": []}]}, {"body": "Any link? He must be a troll", "score": 3, "replies": []}]}, {"body": "Not trying to flex or anything, but I personally lost my school’s pension fund $5,000 on US Silica through one of these clubs", "score": 51, "replies": [{"body": "Go on", "score": 2, "replies": []}, {"body": "*pillaged my school's pension fund\n\nftfy", "score": 0, "replies": []}]}, {"body": "😂 where can I invest?", "score": 43, "replies": [{"body": "They have a terminal in every house. You just lift up the lid, insert your money, and then pull the little lever near the top.", "score": 30, "replies": []}]}, {"body": "ELI5", "score": 18, "replies": [{"body": "ELI5 market order? These guys opted to purchase Tesla at the best price available starting at $243. Doesn't matter what price or what direction it goes. Stocks don't just have infinite quantities available at $243. When all the boys bought them at the same time at that price (+ other people probably) supply and demand at the time they purchased drove the price higher. These guys should have probably put that money into tuition instead of stocks", "score": 34, "replies": [{"body": "Ahhh makes sense. Thank you", "score": 8, "replies": []}, {"body": "Would there actually be a difference if they bought the shares in one lump sum? Also, what determines the price their orders are filled at? Is there someone determining who gets which shares at x price or is it filled randomly ( or in order of fulfillment)?", "score": 4, "replies": [{"body": "If they did it in one lump order it wouldn't matter because they were doing it at \"market order\". Brokerage coulda made a slight difference because some fill better than others. But if they just all made their purchase at \"limit order\" for $243 They wouldn't have purchased anything at or above $243. Idk how the exchanges fill to the rulebook but certain brokerages fill better than others.", "score": 5, "replies": []}, {"body": "No (unless they placed an AON or FOK order in which case the order likely would have been either cancelled immediately or remained open and unfilled). They basically cleared out one side of the order book: https://en.m.wikipedia.org/wiki/Order_book_(trading)", "score": 1, "replies": []}]}, {"body": "people like that guy probably wants the government to clear all student debt too", "score": 6, "replies": []}]}]}, {"body": "This guy is forming to be a living meme", "score": 18, "replies": []}, {"body": "kek <---- this one\n\nkek\n\nkek\n\nkek", "score": 42, "replies": []}, {"body": "Bad investment club. Learn the difference between market orders and limit orders.", "score": 20, "replies": []}, {"body": "They belong here with us, trading options without knowing how a basic market order works.", "score": 9, "replies": []}, {"body": "Lel", "score": 22, "replies": [{"body": "Laugh even louder", "score": 3, "replies": []}]}, {"body": "I don’t get why you are shitting on this guy.  It is the policy at my firm to route all GTC or DAY mkt orders entered before 930ET to the primary exchange to participate in the opening cross. If this club all placed the orders on May 2 and were executed on the 3rd they just have entered a GTC order.  I work for one of the main wholesale making companies and I am pretty sure that most other firms guarantee the primary opening price. So yes they should expect the same price for all trades.", "score": 15, "replies": [{"body": "90% of the people here think \"the opening cross\" is what you do before each prayer to the options gods.", "score": 16, "replies": []}, {"body": "Yeah I'm also wondering why they wouldn't all get the same fill in the opening auction, even if they were separate market orders", "score": 11, "replies": []}, {"body": "I would have thought it'd execute at opening too. Sounds like they were trading after-market and pre-market without realising it.", "score": 5, "replies": []}, {"body": "What if volume is lopsided? Also I thought orders specifically have to be sent as \"On Open\" to be eligible for the opening cross?", "score": 1, "replies": [{"body": "> What if volume is lopsided?\n\nThat's what the opening cross is for, to pick the single price that maximizes total execution volume based on all LOO/MOO orders.", "score": 1, "replies": []}]}]}, {"body": "Holy fuck people need to learn what they’re doing before they gamble", "score": 13, "replies": []}, {"body": "How do I transfer to this university?", "score": 6, "replies": []}, {"body": "[Archive link](https://www.removeddit.com/r/options/comments/bqwp9b/do_we_have_any_recourse/) (mirror)", "score": 6, "replies": [{"body": "Thanks, my hero", "score": 1, "replies": []}]}, {"body": "Someone post a screenshot, post is deleted.\n\nOtherwise top kek.", "score": 3, "replies": []}, {"body": "FyreFestivalBottledWaterGuy.jpeg", "score": 4, "replies": []}, {"body": "I know there are a few retards reading this post that are trying to figure out why their market order filled at different prices too 😂", "score": 7, "replies": [{"body": "i was only wondering because the whole part about covered calls threw me off as i thought that had something to do with it. Also, i. d.o.n.t actually trade but if i did it’d be like a percent of their trades so in my mind if i traded it wouldn’t affect the price at all. lol.", "score": 1, "replies": []}]}, {"body": "So schools are giving kids yolo money?\n\nStep 1. Go back to school. \nStep 2. Join investment club. \nStep 3. ???\nStep 4. Tendies", "score": 3, "replies": []}, {"body": "Can I short this club?", "score": 3, "replies": []}, {"body": "/u/rhibkr holy fuck you're retarded", "score": 3, "replies": []}, {"body": "This is too retarded to be real. I cannot fucking believe this happened in this universe.", "score": 3, "replies": []}, {"body": "\"Before we could sell covered calls, we had to buy stock.\" \n\nThis is the kind of deep level info I look for in an \"investment club\"", "score": 3, "replies": []}, {"body": "Realistically, how low can Tesla go? I’m thinking it might rebound after 160?", "score": 3, "replies": [{"body": "It can only go up from here. Im sure of it. I put everything I have in it. Bought 1 share.", "score": 30, "replies": [{"body": "Wow, risking everything and buying on margin.", "score": 17, "replies": []}]}, {"body": "Zero.\n\nIt can go to zero.", "score": 24, "replies": [{"body": ">It ~~can~~ **will** go to zero. \n\nFTFY", "score": 5, "replies": [{"body": "Shit's in space. They will get bought for the brand eventually.", "score": 1, "replies": [{"body": "nobody is buying those warranty and supplier take-or-pay obligations. they can buy the brand after bankruptcy.", "score": 3, "replies": []}]}]}]}, {"body": "Literally zero. Tits up.", "score": 9, "replies": []}, {"body": "Some day they might be worth as much as DeLorean Motor Company!", "score": 4, "replies": []}, {"body": "Really depends on Trump. Right now Tesla is being hit by both sides of \"auto market in general decline (most auto stocks are down in general)\" and \"american niche auto maker sees declining demand\".\n\nSo if mexican tariffs and chinese tariffs stay + Tesla demand continues to drop? quite a bit lower. The company isn't fully solvent on a cash flow basis yet. Needs the demand to stay up to do so.\n\nGF3 comes online + demand in Q2 and Q3 stays solid? Could go anywhere.", "score": 2, "replies": []}, {"body": "Lol just watch", "score": 2, "replies": []}]}, {"body": "> Check my post history. You're right, in the short term i'm down a lot. I've bought probably...8 separate times? At 310, 280, 275, 255, 240, 225, 190, 185, I think. Something along those lines. Come back to this post after q2 and dab on me if the stock plummets to 15 bucks like the shorts think it will\n\nThis is why everyone shorts Tesla absolute retards are long", "score": 5, "replies": []}, {"body": "its a joke, right?\n\ntheyre trolling\n\n\nright?\n\nRIGHT?", "score": 2, "replies": []}, {"body": "Post was deleted. Can someone give me a TLDR on the whole situation?", "score": 2, "replies": [{"body": "Just posted a screenshot. Too autistic to explain", "score": 10, "replies": [{"body": "Holy shit. That’s beyond WSB on the autism spectrum.", "score": 6, "replies": []}, {"body": "Has to be paper trading.", "score": 3, "replies": []}]}]}, {"body": "Lmfao this guy is unbelievable 😂", "score": 2, "replies": []}, {"body": "How do I join thsj club? I could finally be president.", "score": 2, "replies": [{"body": "The fuck would you want to be in charge of a bunch of retards recreationally?  You're supposed to make money doing that.", "score": 1, "replies": [{"body": "I would scam them duh. They dumb.", "score": 1, "replies": []}]}]}, {"body": "So many of the autists hemorrhaging money on this sub are from Austin: u/truelibertyordeath, u/memecaptial, this dumbfuck, myself... Jesus Christ.", "score": 2, "replies": [{"body": "Hey man. I short Tesla when it was at 380 last year on the 420$ private tweet. \n\nI lost my shirt later on because of fucked up position sizing that resulted in margin calls. My thesis on the trades were right tho.\n\nEdit: that said, I wouldn’t buy y’all at 243 given the current political and financial state.", "score": 5, "replies": [{"body": "Hope I didn’t come off as insulting. Really just meant to flame this dumbass and not the rest of y’all.\n\nI genuinely feel bad for you, my dude. That loss you experienced was absolutely horrific, and I’m honestly glad you’re still here. If I were in your shoes, I would’ve bought a loud stick to blow my brains out, without hesitation.\n\nSame with u/lilkanna - y’all crazy motherfuckers keep me going.", "score": 1, "replies": [{"body": "No loud sticks for sale in my country.", "score": 1, "replies": [{"body": "Helium, nitrogen, rope, benzodiazepines + alcohol, nembutal, etc. would all work too. Risk of brain damage and non-lethality is marginally higher though.", "score": 1, "replies": []}, {"body": "condolences for your GF", "score": 1, "replies": []}]}]}]}, {"body": "From Austin myself.\n\nThe town is essentially nothing but young, autistic morons with too much money on their hands.", "score": 3, "replies": [{"body": "Agree with the young part but not the money part. Property values are sky high, and most young people are priced out of the market.", "score": 1, "replies": []}]}, {"body": "I dunno, I'm doing ok", "score": 1, "replies": [{"body": "Glad to hear that. Life-wise, trading-wise, or both? Ever make back the money you lost in October?", "score": 1, "replies": [{"body": "Yeah, December was good to me", "score": 1, "replies": [{"body": "Glad to hear. How was 2019 for you so far?", "score": 1, "replies": []}]}]}]}]}, {"body": "No wonder college is so fucking expensive. The retards losses have to be covered.", "score": 2, "replies": []}, {"body": "This is what limit orders are for, right? Do I know at least one correct thing?", "score": 2, "replies": []}, {"body": "This dudes so obviously a troll it's not even funny anymore", "score": 2, "replies": []}, {"body": "honestly everyone who has replied so far is unfortunately ignorant about how the market actually works. have really none of you heard of the opening cross? literally every market order entered more than 5 minutes before the open (including post close previous day) should trade at the same price. \nthere is no such thing as a market order in the post or pre session, so an order such as this should automatically be submitted to the open by any legit broker\n\nthere are stocks and order sizes for which i’d be careful, but 700 tsla should be very safe", "score": 2, "replies": [{"body": "So did their shitty broker route to the order to some dark pool to get raped by HFTs?", "score": 1, "replies": [{"body": "honestly the broker probably entered them as market orders instead of market-on-open to save a couple pennies on exchange fees. i do think it’s prudent to ensure that your broker does submit orders like this to the open before relying on it, and that was clearly a mistake in this case. but most of the people commenting here are even more confused than the professor", "score": 1, "replies": []}]}]}, {"body": "Pretty sure I knew the difference between limit and market before I ever placed my first trade.. LOL", "score": 2, "replies": []}, {"body": "And I thought I was dumb for holding on to 135 Tesla shares jfc...", "score": 1, "replies": [{"body": "You are", "score": 20, "replies": []}, {"body": "You still are", "score": 21, "replies": []}]}, {"body": "Lmfao", "score": 1, "replies": []}, {"body": "That’s a pretty expensive way to learn that lesson", "score": 1, "replies": []}, {"body": "Honestly, this sub never ceases to amaze me.", "score": 1, "replies": []}, {"body": "ohhh god damn it the folly of man.", "score": 1, "replies": []}, {"body": "Graduating class of new mods for this sub", "score": 1, "replies": []}, {"body": "arbitrage", "score": 1, "replies": []}, {"body": "Holy shit", "score": 1, "replies": []}, {"body": "Wells Fargo brokerage? And they call us Autist’s.", "score": 1, "replies": []}, {"body": "There’s autism then there’s mental retardation.", "score": 1, "replies": []}, {"body": "If they are from Austin it is definitely UT money. Not a shot in hell it's St. Edwards or ACC...they are too poor.", "score": 1, "replies": []}, {"body": "James Madison University has a prestigious investment club managing over $200k of the school's endowment.", "score": 1, "replies": []}, {"body": "FYI:\n\nHarvard University — $36 Billion.\n\nYale University — $27.1 Billion. \n\nThe University of Texas System — $26.5 Billion. \n\nStanford University — $24.7 Billion. \n\nPrinceton University — $23.8 Billion. \n\nMassachusetts Institute of Technology — $14.96 Billion.\n\n\n\nUT got $26.5 billion to spend on cocaine and hookers.", "score": 1, "replies": []}, {"body": "He went and deleted the original post, also asked reddit on how to nuke his history and delete stuff lol", "score": 1, "replies": []}, {"body": "Short chromosomes.", "score": 1, "replies": []}, {"body": "#fakeNews", "score": 1, "replies": []}, {"body": "can someone please explain to me what went wrong? yes I'm retarded", "score": 1, "replies": [{"body": "limit order != market order\n\nto add.. these students should’ve read up on spreading out limit buys throughout the day to get as close to the VWAP as possible. if they’re serious about “managing funds” anyway.", "score": 1, "replies": []}]}, {"body": "That's one hell of a club... $170,000+ transaction by a bunch of kids who clearly don't understand the basics of trading?", "score": 1, "replies": []}, {"body": "What a fucking Alex", "score": 1, "replies": []}, {"body": "Are they performing ritual suicide later for fun as well?", "score": 1, "replies": []}, {"body": "I'm surprised it took this long for someone here to find the post.", "score": 1, "replies": []}, {"body": "Stock goes up, stock goes down, you can't explain that.", "score": 1, "replies": []}, {"body": "What happened to the WSB that would mod this guy?", "score": 1, "replies": []}, {"body": "Hook'em!! lmao", "score": 1, "replies": []}, {"body": "I don't know why the sub is making such a big deal about market orders AH. First of all, AH trades have to be limits to execute so this doesn't matter. What matters is the lot size, order in which the trades were received and queued, and the brokerage being used.\n\nIf the execution sucks then the orders are going to fill at different prices and might not be immediate, if the execution is good, then most of these kids should have gotten market open price.\n\nThe thing is 700 shares are almost guaranteed not to hit at the same price and depending on the spread it can be huge.\n\nI'd imagine their broker is routing their trades on their automated platform vs to a trade desk, so I'm not sure what this idiot is asking. I hope to god this isn't a professor of finance and if he did \"run a mutual fund\" I'm curious as to his role. There's no way he was a trader or in cap markets or he would get this basic shit.\n\nAlso side note, but at these prices, I'm long Tesla stock and hedging with a long dated Put. IMO next earnings this will either shoot back up to 300 or sink below 100. Either way I make a profit, and I'm only fucked if it doesn't move, but unlike a straddle I'm not shit out of luck with some calls that expire. I'm no professional trader but if I'm gonna Yolo it's gonna be a dumb enough one to potentially earn something", "score": 0, "replies": []}, {"body": "You can file a complaint with the firm for failing best execution. You can also, file a complaint with FINRA and the Texas State Securities Board.", "score": 0, "replies": []}]}
