{"title": "For those in College that want a sure fire investment strategy", "selftext": "After your second year, get an internship that offers retirement benefits to its interns. I have been with Boeing for three years. \n\nBoeing has a great system and you can send whatever percentage you want of your pre tax income into retirement which they will then match 100% up to a certain percentage of your check. Put the MAX amount into your retirement (Voluntary Investment Plan) and you are getting 100% ROI. Then later you can roll everything into a ROTH IRA and BOOM.\n\nStart investing in retirement early, I shouldn't have to explain compound interest.\n\nHow does this relate to WSB?\n\nThe money you don't put in retirement can be pissed away on WSB just like mine, and guess what, IT DOESNT MATTER because you always have the retirement safety net. (Side note they paid me 27 an hour as an intern and I had health benefits as well)", "id": "4stoh0", "created_utc": 1468508377.0, "score": 88, "upvote_ratio": 0.77, "num_comments": 109, "comments": [{"body": "[deleted]", "score": 208, "replies": [{"body": "more pressing question is what fucking internship offers retirement benefits??? a lot of internships don't even offer a paycheck. ", "score": 21, "replies": [{"body": "For real I had to bust my ass at an internship for $8/h. Guess it's field dependent.", "score": 2, "replies": []}]}, {"body": "If I'm 65 I want to die", "score": 6, "replies": []}, {"body": "There's no need for money on the motherfucking moon.", "score": 3, "replies": []}, {"body": "LOL", "score": 1, "replies": []}, {"body": "La Flama Blanca has spoke da truth. ", "score": 1, "replies": []}, {"body": "That's not the point, it acts as a safety net so you can yolo way harder with less ass clenching. Think about all the times you have been crying before betting on some FSC inverse bullshit. Now you can send the money with no fear and stop being such a pussy when a stock drops 2%. \n\n", "score": -36, "replies": [{"body": "\\* spit *", "score": 11, "replies": [{"body": "Can I get a pinch of that Coppenhagen?", "score": 3, "replies": []}]}, {"body": "Is it really a yolo with a safety net?", "score": 16, "replies": [{"body": "Yes and no", "score": -11, "replies": [{"body": "Actually, the answer is no", "score": 8, "replies": [{"body": "Just no.", "score": 4, "replies": []}]}]}]}, {"body": "No. What you do is make Boeing switch to Charles Schwab. Then move your precious 401k into their Personal Care Retirement Account (PCRA) so you can trade options with that sweet sweet pre-tax money. ", "score": 4, "replies": [{"body": "I like it", "score": -1, "replies": []}]}, {"body": "You're literal fag. ", "score": 2, "replies": []}, {"body": ">safety net\n\n\nwhat are you, some kind of faggot?", "score": 1, "replies": []}]}, {"body": "Side note plz look up Roth IRA", "score": -30, "replies": [{"body": "You might be too smart for this sub", "score": 30, "replies": []}]}]}, {"body": "Hey we are telling you to GFY because while youre giving good sound safe advice, it doesnt fit with our autistic train of thought. maxing out your internship 401k isnt gonna get you a fucking cruise ship yacht", "score": 36, "replies": [{"body": "GFY because I never implied that maxing out the 401k is getting you a yacht.\n\nYour bets will. \n\n>SAFETY NET", "score": 1, "replies": [{"body": "Im just saying you posted an idea about \"the benefits of being a vegan\" at a butcher shop run by Autistic Lions. ", "score": 57, "replies": [{"body": "That might possibly be the most beautiful thing I've ever read. ", "score": 3, "replies": []}, {"body": "More like \"The benefits of eating veggies too\" but I see what youre saying ahhaha", "score": -1, "replies": [{"body": "Safety net does not equal YOLO faggot GFY", "score": 0, "replies": []}]}]}, {"body": "more like safety anchor", "score": 1, "replies": []}]}]}, {"body": "GFY, go to /r/investing you cuck.", "score": 85, "replies": [{"body": "you also missed the point mr generic white name", "score": -15, "replies": [{"body": "The gambler going for that sweet 40 year term. Cuck.", "score": 1, "replies": []}]}]}, {"body": "ITT: OP didn't realise what neighborhood he tried peddling his product in", "score": 18, "replies": [{"body": "Not wrong there", "score": 1, "replies": []}, {"body": "just a dude who enjoys reading this sub occasionally passing by. the fuck does gfy mean?", "score": 1, "replies": [{"body": "Go fuck yourself", "score": 5, "replies": [{"body": "Oooh, nice. ", "score": 1, "replies": [{"body": "Go fuck yourself", "score": 5, "replies": [{"body": "Oooooh, nicer. ", "score": 3, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 54, "replies": [{"body": "Hey guys did you know if you get 100% ROI now you can then roll the funds into a ROTH IRA then when you need to pull funds out at ANY AGE to buy a mansion you can? Youre welcome for pro DD and gfy\n\n", "score": -2, "replies": [{"body": "I'm getting sick and tired of people talking about ROTHs. Do you realize you don't qualify for a ROTH if you make more than just $117k per year? Nobody I know makes less than that, not even when they were daytrading in college, this is poverty level bull.\n\nLITERALLY NOBODY HERE SHOULD QUALIFY FOR ROTH IRA.", "score": 28, "replies": [{"body": "you can always set up a traditional IRA and roll it over into a ROTH", "score": 4, "replies": [{"body": "yessir", "score": 3, "replies": []}]}, {"body": "Looks like you have not seen the WSB survey.\n\nMost of this sub is fucking poor.", "score": 2, "replies": [{"body": "WHOOOSH", "score": 4, "replies": []}, {"body": "link?\n", "score": 1, "replies": []}]}, {"body": "Ah yes because everyone on WSB makes more than 117k per year. Especially the COLLEGE STUDENT THAT I SPECIFIED IN THE POST title.\n\nNice try gfy", "score": 2, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Oh are you a college student that makes more than 117k per year? \n\nSounds like the retard is the guy who is spending money on college and is already making 6 digits", "score": 2, "replies": []}]}, {"body": "Just to become an accredited investor for higher options levels and reg 144 DPPs and PRIV RE you need to be doing over 200k (300k if married) or a million in LIQUID ASSETS not your shitty studio apartment in SF.\n\nStick to trading dog shit stocks with grandma.", "score": 6, "replies": [{"body": "This post was directed at people who trade dog shit stocks with grandma.\n\nBut please keep showing me how long your pee stream is and missing the point. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Haha the backdoor is for faggots, this sub is about YOLOing GAINZ bitch.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "I also will give your mother a Missionary 101 lesson. Professor Gambl3r is here to serve", "score": 1, "replies": []}]}, {"body": "Not true. If you are contributing to a Roth, the company match portion must go to a traditional (read: pre-tax retirement account). If you pull the company matched portion before IRS retirement age, you are taxed on those funds. It's More like 75% ROI, depending on your tax bracket. GFY & your shit DD.", "score": 2, "replies": [{"body": "Youre right, and it may be a little less than 75% ROI in the end. Boohoo 50% ROI is still out performing most robinhood accounts on here", "score": 1, "replies": []}]}, {"body": "Have fun with that 10% early withdrawal penalty", "score": 0, "replies": []}]}]}, {"body": "My portfolio consists of 80% mid and small caps. How am I supposed to use a roth when I'm droppin 7 figs a year? GFY", "score": 15, "replies": [{"body": "Then this aint for you.\n\nwoah", "score": 0, "replies": [{"body": "This is all great advice, just not suited for this sub. So gfy", "score": 7, "replies": [{"body": "way ahead of you", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "couldn't agree more", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Well time to short Boeing some more", "score": 14, "replies": [{"body": "I would too. be wary of big iran orders", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "seems like it lol", "score": -2, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "Maybe you didn't get paid because your double major in feminist studies and faggot delights doesn't have any money in it.\n \nI have never come across an engineering intern that doesn't get paid", "score": 13, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Not if he's an engineering student, he doesn't.", "score": 6, "replies": [{"body": "Engineering _intern_", "score": 1, "replies": []}, {"body": "Yes I do ask your mum", "score": -4, "replies": []}]}, {"body": "https://m.youtube.com/watch?v=_uMEE7eaaUA", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "da fuck stats are you reading? you cuck... \n\n2014: http://www.deptofnumbers.com/income/us/\n\nhttp://money.cnn.com/2015/09/16/news/economy/census-poverty-income/\n\nHe was or is making the Median wage, he's a rounding error above the median. ", "score": 4, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "median household income != median individual income\n\nIt's roughly double the average.\n\nFrom /u/matthewgod51's link: http://www.deptofnumbers.com/income/us/#percap", "score": 3, "replies": []}]}]}, {"body": "it's a decent chunk of change for an intern though. ", "score": 5, "replies": []}, {"body": "Youre right, its not a lot of money at all, hence why this technique works", "score": 1, "replies": []}]}]}]}, {"body": "Your advice contradicts your username but I like it.", "score": 9, "replies": [{"body": "Im still making big bets. But with a cleaner conscience ;)\n\nAlso Im addicted to sports betting as well, my bovada.lv account has lost me close to $3200 last year, but doesn't matter because \n\n>Safety net", "score": -2, "replies": [{"body": "\"I have a gambling addiction but its ok! Ill just use my retirement fund to cover my losses\" ????", "score": 14, "replies": []}]}]}, {"body": "How was Boeing? I heard they had a pretty overworked company culture with lot of turnover. Everyone wants the Boeing name on the resume so there's always new talent they can pull from\n", "score": 5, "replies": [{"body": "Turnover was horrendous. But that's good for a young chap like me. I worked in Defense on Minuteman II and Minuteman III. So I got to see some cool stuff and didn't have all the stresses of some other engineers. Also I had three hs interns working under me so that was nice.\n\nIm slowly phasing out to work with one of Boeings commercial airline suppliers", "score": 2, "replies": []}]}, {"body": "If I could find a internship that pays me 27 an hour. But fuck it if you find any paying internship at all. Companies like to have slave labor ops I meant unpain internships. ", "score": 3, "replies": [{"body": "Whats your major?", "score": 1, "replies": [{"body": "Women's studies lol no it's economics.  ", "score": 3, "replies": [{"body": "Deloitte offered me a paid contingent offer but I had to finish my economics minor.\n\nThere is definitely a lot of paid internship opportunities you can get with an econ degree. Especially if its a BS. Just gotta think outside the box and try to look at more general business internships", "score": -1, "replies": []}]}]}]}, {"body": "you missed the bus: some of us got a pension years ago doing the same shit", "score": 3, "replies": [{"body": "So what youre saying is youre not \n>in College\n\nWhat I really did was miss the industrial revolution. Shucks guess this post is invalid. L2read", "score": 1, "replies": []}]}, {"body": "YOU EXPECT PEOPLE TO LIVE TO 65", "score": 3, "replies": []}, {"body": "Depends on the company but if you get an interview ship with one that does match contributions, you have to spend a certain amount of time contributing to your plan for them to start matching your contributions. \n\nSource: me, I'm interning with UHG ", "score": 3, "replies": []}, {"body": "> get an internship\n\n>boeing\n\n>$27/ hour+ health benefits\n\ntfw you majored in physiology and can only get employed as a slave\n\ntfw you scored big with a $15/hour fellowship while your friends are actually jobless\n\ntfw only 10% of post-docs get academic positions\n\ntfw only 10% of those hired professors get funding and keep their jobs\n\ntfw industry managers tell you that you will be overqualified after you flake out of academia\n\n \n\n ", "score": 3, "replies": [{"body": "...too real man...too real", "score": 1, "replies": []}, {"body": ":(", "score": 1, "replies": []}]}, {"body": "will you help me with my 401k too?", "score": 2, "replies": [{"body": "Im not familiar with 401k's", "score": 0, "replies": []}]}, {"body": "I get paid 12.5/hour here at Ingram Micro and they gave me a fidelity 401k. It's matched up to 5% I think but I'm putting in 8%", "score": 2, "replies": [{"body": "I only ask because I have friends who have misunderstood haha", "score": 1, "replies": []}, {"body": "5% of income? or 5% of what you put in", "score": 0, "replies": [{"body": "matched up to 5% of income", "score": 0, "replies": [{"body": "That's awesome, So this may be something you consider. 12.5 an hour is tough to live off of though so you will have to be less aggressive on contributions. 8% seems nice.\n\nBoeing matches up to 7% of income if im correct", "score": 0, "replies": [{"body": "I don't live off of it. I'm an intern. I live with my parents while at home and they cover rent and some food/gas at school. Whatever I make is pretty much spending money because school is paid for without loans. I'm extremely lucky and extremely grateful my parents can afford that. ", "score": 6, "replies": [{"body": "I apologize I should've clarified.\n\nBy live of off I actually meant \"bet of off\". My parents also used to help cover rent", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Your in the wrong sub, go post this bullshit in /r/personalfinance ", "score": 1, "replies": []}, {"body": "Even with 100% matching your internship, 10% of 10k a year is only 1k.\n\nDoing well in college and getting a good job is the best for gains.", "score": 1, "replies": []}, {"body": "What's with all the uppity young high school and college faggots posting here lately, thinking they know it all?\n\nAt least this one happens to be good advice, but jesus christ, dial back the arrogance a bit, at least until you have something to be arrogant about.", "score": 1, "replies": []}, {"body": "What is vesting", "score": 1, "replies": []}, {"body": "id suck a dudes Peter for a $27/HR Jerb and I'm not even gay ", "score": 1, "replies": []}, {"body": "How does this help me get my yacht?", "score": 1, "replies": []}, {"body": "Your solid advice is not welcome here.  ", "score": 1, "replies": []}, {"body": "Let me clarify some things for all you faggots with a scenario.\n\n1.) You put 5000 in the retirement plan and it is matched 100% so now you have 10,000 in it. Forget about it.\n\n2) You have $10,000 dollars in your Robinhood account and are jerking off to MSTX hoping it goes to a billion. Now we go two ways.\n\n2a) MSTX to zero. You suck. But at least you have the 10,000 in your retirement that you can roll into a Roth IRA. Side note, a benefit of a ROTH is that you can pull out up to 10,000 tax free for a FIRST HOME PURCHASE. So you don't have to cry about your MSTX loss, you can still buy a house.\n\n2b) MSTX goes to a billion percent. Congrats your rich. You still made a bet and you still made money. Now the retirement account doesn't matter because its a drop in a bucket compared to the sweet gainz you made, forget about it. Take the money later. \n\nGetting the initial ROI of 100% hardly hinders your ability to become rich off faggot delights. But it does provide a safety net for when you short YUM and lose all your money.\n\nP.S This works if your one of the Robinhood users with limited income trying to get rich off a bet. It does not apply to anyone with good money trying to turn it in to super good money.", "score": -2, "replies": [{"body": "get out of here with your sound logic.\n\nthe memes of wsb won't allow it. why drop 5k into that retirement and get free $$$ when you can buy more MSTX and make double the $$$$$$$ (extra $ to visualize the gainz)?", "score": 6, "replies": []}, {"body": "Thank you for posting this, did not know about the ability to pull out 10,000 tax free for a first home purchase.  \n\nMaybe investing in a Roth is a good idea.... \n\n**BECAUSE I CAN USE IT FOR MY HOUSE YACHT**", "score": 5, "replies": []}, {"body": "Since you're 100% serious, what kind of internships would provide this option for a computer engineering major, and, where do you look to find internships that offer this 100% match in a Roth IRA? ", "score": 0, "replies": [{"body": "not a 100% match to a roth. it would have to be rolled from a traditional.\n\nAnd the computer engineering intern market is literally insane right now, in a good way. They are paying out big for people still learning. Theres a ton of companies that offer retirement benefits to interns. Just gotta look in the right places", "score": 2, "replies": [{"body": "\"The right places\" \nDo you mean craigslist? Indeed.com? Lol. I'm not desperate but that sounds cool. But not having cash on hand from a real job blows. ", "score": 1, "replies": [{"body": "lol Pm me if you want some good suggestions", "score": 2, "replies": []}, {"body": "Are you located in a city with a strong software industry? That'll make a big difference. \n\nGetting facetime with recruiters or employees is the best way to get referred to jobs. And getting referred is much more time efficient than applying online. \n\nWays to get facetime: \n* university career fairs \n* conferences and conventions\n* Meetup.com groups and the like (better in the coastal cities)\n* hackathons and the like\n* volunteer groups\n* online \"facetime\"... forums, open source projects, etc", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Want some free easy money over the week-end? Short NFLX!", "selftext": "[deleted]", "id": "4suj3u", "created_utc": 1468518015.0, "score": 157, "upvote_ratio": 0.91, "num_comments": 164, "comments": [{"body": "How the actual fuck do you not know anyone in Canada who has Netflix\n\nFuck this I'm buying NFLX calls", "score": 144, "replies": [{"body": "[removed]", "score": 139, "replies": [{"body": "[deleted]", "score": 103, "replies": [{"body": "lmao rekt", "score": 12, "replies": []}]}, {"body": "I'd hang out with you for the sole reason of looking amazing and ridiculously astute in comparison", "score": 28, "replies": []}, {"body": "I'd hang out with you. Just let me know what you want to do, and we will do the opposite and have a blast.", "score": 18, "replies": []}, {"body": "If you live in Toronto, we could hang out for a beer or something.\nI really need a few friends who actually trade. ", "score": 16, "replies": [{"body": "\"trade\" ", "score": 6, "replies": []}]}, {"body": "Self-deprecating humor is the best humor.", "score": 8, "replies": []}, {"body": "I'm not your buddy, guy. ", "score": 15, "replies": [{"body": "I'm not your guy, friend.", "score": 3, "replies": [{"body": "He's not your guy, buddy.", "score": -2, "replies": [{"body": "Not your guy either, pal.", "score": -5, "replies": []}]}]}]}, {"body": "Yeah I don't think retardation clinics have netflix subscriptions...", "score": 2, "replies": []}, {"body": "No, and that's why I hate your fucking bullshit advice. I'm off...to short Canada.", "score": 1, "replies": []}, {"body": "who are you", "score": 1, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "BEWARE anyone that wants to inverse this NFLX options are extremely expensive because the one thing he has right is they generally do move big on earnings.  If you've never trade NFLX options at earnings before recommend spreads", "score": 58, "replies": [{"body": "[removed]", "score": 35, "replies": [{"body": "Jesus christ no one do that either", "score": 122, "replies": [{"body": "Time to ride $NFLX to the moon!", "score": 20, "replies": [{"body": "or for /u/fscomeau, deeper into the ground.", "score": 1, "replies": []}]}]}, {"body": "Your 5th bullet point says this is a low risk play. 5 minutes later you change your mind. Jesus christ, this is just fucking annoying now.", "score": 25, "replies": [{"body": "[removed]", "score": 17, "replies": [{"body": "Any stock that crosses your mind automatically inherits disastrous risk", "score": 56, "replies": [{"body": "Volatility goes over 100% as soon as he mentions a stock.", "score": 10, "replies": []}]}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "A better way to play this might be calendar spreads. You can get the $100 strike spreads very cheap http://imgur.com/w7dkayU that is my play thought.", "score": 4, "replies": [{"body": "can you explain what a calendar spread is", "score": 3, "replies": [{"body": "Yeah, it is when you sell the call for say next week but buy the call at the same strike for a later date, say a month from now. The result is you pay the premium difference which in this case  is just over a dollar. That dollar basically bought you a month of call time. Google it for a better explanation but I'm going to bed. ", "score": 3, "replies": []}]}, {"body": "What app is that?\n", "score": 2, "replies": [{"body": "Options house mobile app. I don't like it but it gets the job done", "score": 2, "replies": []}]}]}, {"body": "Spreads offer less risk but you if want to inverse and go full YOLO you should just get calls right?", "score": 2, "replies": [{"body": "Yeah but I wouldn't buy until afternoon of earnings, NFLX moves wildly going into earnings so there's no reason to believe you won't buy something today that will be completely off by then, could drop significantly before earnings and your call won't matter even with great earnings (obviously could be a winner even before earnings) but I never play netflix until like 3:45", "score": 4, "replies": [{"body": "So basically you're saying the best play would be to strangle NFLX the afternoon of earnings? Interesting, how expensive would the options be though?", "score": 3, "replies": []}]}]}, {"body": "I mean worst case scenario you could actually buy the stock", "score": 2, "replies": [{"body": "Gross", "score": 5, "replies": []}]}, {"body": "With these premiums I can't even fathom what might be a reasonable trade. Straddles and strangles look like they'd need a 9-10 point jump to be slightly profitable. Any recommendations?", "score": 1, "replies": [{"body": "Iron condors on NFLX, always, wide and conservative just take the easy money don't try to yolo", "score": 1, "replies": []}]}]}, {"body": "buying NFLX", "score": 123, "replies": [{"body": "Ay my nigga", "score": 8, "replies": [{"body": "Investing based on what some idiot redditor said is incredibly stupid. \n\nI don't know why this sub would be so naive as to believe that just because some random dude got a few coin flips right we should follow everything he says without doing our own due diligence. I love the spirit of the YOLO, but this isn't what makes WSB so much fun. It's just gambling. WSB should be about _educated_ gambling.\n\nWSB these days actually kind of makes me sad. It used to be great picks, interesting due diligence, and the occasional YOLO, but only when someone really had a great reason to believe in something. I can't believe we're still listening to u/CommodityTycoon.\n\nOh wait, this is FSC? Brb buying calls", "score": 53, "replies": [{"body": "You had me worried for a minute.", "score": 19, "replies": [{"body": "\"YOU DARE DOUBT THE SACRIFICIAL LAMB!?\"", "score": 8, "replies": []}]}, {"body": "My man", "score": 10, "replies": []}]}]}]}, {"body": "One of these days fscomeau will show all of you", "score": 36, "replies": [{"body": "[Someday...](http://imagesmtv-a.akamaihd.net/uri/mgid:file:http:shared:mtv.com/news/wp-content/uploads/2015/01/ridiculous-steve-buscemi-1422362978.gif)", "score": 12, "replies": [{"body": "Shit everyone act normal it's the FBI ", "score": 2, "replies": []}]}, {"body": "I inverse this guy all the time and even I'm rooting for him to get a win.", "score": 12, "replies": [{"body": "I'm inverse him on _this trade_ and I still kind of want him to get a win", "score": 10, "replies": []}, {"body": "This movie scene comes to mind\n\nhttps://www.youtube.com/watch?v=8PLSyFzk-6g&app=desktop", "score": 1, "replies": []}]}, {"body": "\"I may have lost $450,000, but I just made $5k. So SUCK it!\"", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "He's always convinced he's right and he's always wrong. Always", "score": 5, "replies": []}]}]}, {"body": "[deleted]", "score": 33, "replies": [{"body": "But shouldn't that be priced into the stock/earnings already? I mean it's not like that's particularly new info...\n\nI swear FSC just finds two random points that have nothing to do with timing a stock (or ETF) and shorts based on that. ", "score": 5, "replies": [{"body": "Yeah you're right about that. $.02 projected EPS seems really low to me but this is my first earnings season so I'm trusting the advice of articles I've been reading. A lot are bullish on Netflix.", "score": 2, "replies": []}]}]}, {"body": "Call me crazy, but I'm gonna break the inverse FSC circus and ride NFLX into the ground with him...\n\nIf I'm not back after earnings... wait longer.", "score": 24, "replies": [{"body": "> ying puts is a low-risk way to benefit from this drop.\n> \n> Subc\n\ndont do it man, i thought the same a week ago, i shorted spx at 2130.\nrip my money.\ni fucking quit equites today, but i'm tempted to go long on this shitty stock:D", "score": 3, "replies": []}]}, {"body": "/u/fscomeau Where does all of your money come from....? It's like it literally grows on a tree in your backyard for you and then it just fizzles up when you throw it in the market. ", "score": 19, "replies": [{"body": "[removed]", "score": 42, "replies": [{"body": "Work? What's that?", "score": 12, "replies": [{"body": "He makes MLP sex dolls.", "score": 16, "replies": [{"body": "[removed]", "score": 44, "replies": [{"body": "*WSB", "score": 7, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Seems like a very profitable market. How do I buy calls for it?\n", "score": 1, "replies": []}]}]}, {"body": "Are you as good at your job as you are the stock market?", "score": 10, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "no one toys around with earned money like this.  trust me when i tell you he has wealthy parents and an infinite supply.  Must be nice to have your parents clean up after you every time you peanut butter shit the shag carpet. \n\nThe more money than brains combo is just too common. ", "score": -2, "replies": [{"body": "It's a paper money account with infinite supplies.", "score": 5, "replies": [{"body": "ya that crossed my mind too.  Hey if people have time to spend on Pokemon Go all day collecting nothing, why wouldn't a guy spend all day trolling strangers?\n\ni wouldnt be shocked", "score": 3, "replies": []}]}]}]}]}, {"body": "Fuck it, my first attempt at inverse fscomeau.", "score": 18, "replies": [{"body": "[removed]", "score": 34, "replies": [{"body": "When are you closing your shorts on AAPL and NFLX?", "score": 5, "replies": [{"body": "FScomeau is actually long NFLX according to his patreon, he's inversing himself here on WSB", "score": 16, "replies": [{"body": "Wait shit so which inverse do I use? I was going to long Netflix over the weekend.", "score": 9, "replies": [{"body": "buy 100 shares and short 100 shares", "score": 19, "replies": [{"body": "You can't lose!!", "score": 4, "replies": []}]}, {"body": "Yea I don't know, it's impossible to tell which one was his original idea and what his inverse was. The safe bet is it's actually going down, based on how overvalued they already are. But who knows I wouldn't fuck with NFLX right now.", "score": 6, "replies": [{"body": "Yeah but their projected EPS is $.02, which seems very low to me. Many analysts have them making more. I might just have to sit this one out and rely on Apple.", "score": 1, "replies": [{"body": "Given that the news that came out yesterday was that HBO (94 nominations) and Netflix (54 nominations) have an impressive amount of nominations, and that can only mean good things for streaming, namely Netflix. Hulu and YouTube got 2 and 3 nominations, respectively. I'd estimate with this, they beat their 0.02 EPS and get up to 0.03-0.04 EPS. But who knows.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "you are aware that NFLX and AAPL both have a all time H of about 130 \n\nNFLX and AAPL oddly often have the same stock price, both are 98 right now", "score": 2, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "> Buying puts limits your risk.\n\n2 days ago:\n\n> I get the time decay", "score": 13, "replies": []}, {"body": "Buying Netflix before the weekend", "score": 12, "replies": []}, {"body": "Thanks FSC buying calls. 20 @ 4.9. Aug 19 100 strike. Come on baby!!!", "score": 11, "replies": [{"body": "Easy money", "score": 3, "replies": []}, {"body": "Sold today at 5.45 hope that was good enough for sweet GAINZ ", "score": 1, "replies": []}]}, {"body": ">Netflix has plateaued. Look at a 10 year graph: it is the next AAPL. Great company, but the stock has plateaued.\n\nWhat in the actual sweet-jesus-fuck are you talking about? Randomly comparing AAPL and NFLX because...why? \n\nHere, let me educate you on tech a little bit: AAPL is a consumer electronics company that became huge (exponentially) by introducing a killer product running on a killer platform (itunes,ios,iphone), but plateaued because the platform itself was dependent on a cyclical-product that was eventually saturated by competition. Google/Android is the real winner in the smartphone wars, *edit: * as they positioned themselves where they don't even have competition. \n\n\nNFLX is an expanding media platform with no closed-source-hardware that will shoot itself in the foot. Until someone else starts churning out OC at the rate NFLX does, it's got nowhere to go *edit*: but up (even if this quarter is a dud, NFLX is far from done).", "score": 11, "replies": [{"body": "NFLX's next competitor, in terms of content, is HBO which said they want to be on par with NFLX in bringing new OC, estimating to be spending about $2B in the process. This is good news for Netflix. ", "score": 2, "replies": []}, {"body": "There's a reason people say \"Netflix and chill\". Netflix has become so large that it's a cultural thing. I might just have to go long on Netflix tomorrow and hold for a while.", "score": 1, "replies": []}]}, {"body": "Just bought NFLX\n", "score": 15, "replies": []}, {"body": "[deleted]", "score": 17, "replies": [{"body": "I read this and didn't find this funny until I read the username", "score": 6, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Because you dropped out of high school.", "score": 5, "replies": [{"body": " ¯\\_(ツ)_/¯", "score": 1, "replies": [{"body": "you dropped this too: \\\\", "score": 7, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Same </3", "score": 0, "replies": []}]}, {"body": "Long time NFLX Trader; but what stops me from having a strong up or down feeling is NFLX monthly raise for older customers from $8 to $10.\n\nMy guess would be some customers left from the (imo reasonable) price increase; but not that many left.\n\nsecond unknown is how well NFLX is doing international; that was a bit soft last qtr.\n\n*** Newbies to trading NFLX -\n\n its one of those stocks that can move 10-15% EASILY after earnings. Lovely if you are right, pain if you are wrong.\n\nOptions are always very expensive; so ok for credit spreads if you  get the direction correct; but if you are just doing long calls or long puts you'll need a very large NFLX move to bank $\n\nNFLX does not halt on earnings;so one can always just trade the common once the #s come out\n\nGun to head guess for NFLX earnings is UP ", "score": 8, "replies": []}, {"body": "B-but I can't short with my Robinhood account!", "score": 12, "replies": [{"body": "this an obvious sign to inverse fsc\n", "score": 6, "replies": []}]}, {"body": "For someone who is wrong all the time, he does make sense...", "score": 5, "replies": []}, {"body": "Covered call ftw", "score": 3, "replies": []}, {"body": "a 10% drop in price would still give them a high P/E\n\n", "score": 3, "replies": [{"body": "A Trader simply does not even care or note P/E\n\n/r/investors is over that way\n\nExample: AMZN bears have been crying about AMZN insane P/E for a decade, just made another new all time H this week at 750s", "score": 6, "replies": []}]}, {"body": "im no longer an inverse fscomeau virgin. ", "score": 5, "replies": []}, {"body": "I'm Canadian.. Everyone I know has Netflix...\n\nAre you from Queerbec? Fuckin faggette", "score": 3, "replies": []}, {"body": "I love that you're **still** giving trading advice. Never stop, FS. Never stop. ", "score": 3, "replies": []}, {"body": ">NFLX is a joke internationally. I'm in Canada and I don't know anyone who has it.\n\nYou must be in the boonies. I'm in a Canadian city and know plenty of people who have it.", "score": 3, "replies": [{"body": "Can confirm", "score": 2, "replies": []}]}, {"body": "Alright, NFLX calls it is.", "score": 3, "replies": []}, {"body": "Even if subscribers stayed steady, a lot of people who were grandfathered in at the old $7.99 price were transitioned to the $9.99 price recently.", "score": 3, "replies": []}, {"body": "Time to buy a yacht!\n\nRemindMe! 5 days", "score": 3, "replies": []}, {"body": ">Subcriber count has plateaued, mostly because everyone who wants NFLX has it by now. Really, once everyone in the US is subscribed to US, how can they grow?\nNFLX is a joke internationally. I'm in Canada and I don't know anyone who has it.\n\n\nI think you just answered your own question. The NFLX Put train ended a few weeks ago (some great 50 and 100% gains). ", "score": 3, "replies": []}, {"body": "I'm in Canada and everyone I know uses Netflix. Anyhow, thanks for the tip, calls it is (gonna do my own DD no matter what though, and sugest y'all do the same, you don't want another YUM on youhands).", "score": 3, "replies": []}, {"body": "Please don't be fscomeau please don't be fscomeau... Fuck! I have puts you shit!", "score": 3, "replies": []}, {"body": "http://imgur.com/3y0bRsB\n\nMy tea leaves say that the NFLX overall trend is negative. There seems to be some hesitation to break out of the upper resistance line, in part caused by the BREXIT at first, but now seems to be consolidating prior to earnings. \n\nhttp://imgur.com/kVvxRr9\n\nShort-term (2 hr candles) shows a bit of an uptick, but the whole market has been up, so no surprise there. It does seem to want to break out over the upper resistance.\n\n\nMy tea leaves mean nothing.\n\n(I am going to go long. Straddles are pricey right now.)\n\n", "score": 3, "replies": []}, {"body": "I read this seriously until I looked who posted and chuckled a bit", "score": 3, "replies": []}, {"body": "As a Canadian I have Netflix. Everyone I work with has Netflix. My entire extended family has Netflix. I know more people that have it than don't. ", "score": 3, "replies": []}, {"body": "I hate that I feel this way, but I think he might be on to something here... \n\nhttp://i.imgur.com/c9ZftOL.png\n\nI mean... it does fall very sharply after every earnings report like fucking clockwork... and look at the volume during those times! I still don't even understand why though, because every one of those earnings reports exceeded estimates... which you would think would make people excited. ", "score": 3, "replies": []}, {"body": "Fack it, im buying.", "score": 2, "replies": []}, {"body": "I don't get why they're forecasting $0.02 EPS when the previous 4 quarters have been closer to $0.06/share.  Maybe I'll find out.  \n\nNFLX is ridiculously overpriced and has a ton of speculation built in, but I don't care.  I'm not marrying the fucking stock.  \n\nFD:  Am long in NFLX since ~$93.  ", "score": 2, "replies": []}, {"body": "> I'm in Canada and I don't know anyone who has it.\n\nLOL, seriously? Everyone I know, except my totally broke friends who use someone else's account, has it.", "score": 2, "replies": [{"body": "No kidding! That comment pretty much destroyed the validity of his entire post.", "score": 1, "replies": []}]}, {"body": "Don't forget they raised the subscription rates for grandfathered accounts by 20% just recently. That will throw a wrench into everything. ", "score": 2, "replies": []}, {"body": "I want to thank you for the AAPL recommendation.", "score": 2, "replies": [{"body": "AAPL doing its usual uptick into earnings, and heading toward the obvious 100 level", "score": 1, "replies": []}]}, {"body": "Iron condor take me to the moon", "score": 2, "replies": [{"body": "Strike prices and exp. dates?", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "Your post has been automatically removed because of pedophilia. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "What would be the advantage of buying calls over taking a long position?", "score": 2, "replies": [{"body": "Larger return percentage with less risked capital.\n\nDownside is that they can expire worthless and you lose everything you risked.", "score": 1, "replies": []}]}, {"body": "If it drops I'll buy the dip", "score": 2, "replies": []}, {"body": "Netflix is $42 billion while the Asian world pirates every movie before it even comes out...You have to be utterly insane to invest in Netflix.", "score": 2, "replies": []}, {"body": "Imma help you out man, just cancelled my membership", "score": 2, "replies": []}, {"body": "I thought you didn't have any money left you lying inverse twat", "score": 1, "replies": [{"body": "I don't think he is investing his own money, just giving out advice. So chill.", "score": 2, "replies": [{"body": "he posted a picture of 100 puts with 19 august expiration are you fucking blind or what ", "score": 7, "replies": [{"body": "Not so much blind, just dumb.", "score": 11, "replies": []}, {"body": "Guys, we've just seen this morning that web-based output/screenshots can be doctored, so take it with a grain of salt", "score": 2, "replies": []}]}]}]}, {"body": "Only margins matter until we hit a crash/significant correction, and no reason to think that that will be next week. P/E etc is basically irrelevant for this company until then... In the mean time, we saw a lot of good stuff this quarter, contrary to expectations.\nInverse FSC holds, buy NFLX", "score": 1, "replies": []}, {"body": "> Their earnings suck. They earn something like $0.02 per share\n\nTrue, but that doesn't mean they won't beat expectations. In fact over the last two years they've been more or less consistently beating consensus.", "score": 1, "replies": []}, {"body": "I got the memo. Buying calls right now.", "score": 1, "replies": []}, {"body": "Just sold a put, thanks mate", "score": 1, "replies": []}, {"body": "Buying! Thanks!  RemindMe! 5 days", "score": 1, "replies": [{"body": "I will be messaging you on [**2016-07-19 19:07:43 UTC**](http://www.wolframalpha.com/input/?i=2016-07-19 19:07:43 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/wallstreetbets/comments/4suj3u/want_some_free_easy_money_over_the_weekend_short/d5cbsxy)\n\n[**7 OTHERS CLICKED THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/wallstreetbets/comments/4suj3u/want_some_free_easy_money_over_the_weekend_short/d5cbsxy]%0A%0ARemindMe!  5 days) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! d5cbtcs)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "PLS NO", "score": 1, "replies": []}, {"body": "I have calls leading up to earnings, that I'm selling tomorrow. And buying puts tomorrow due to NFLX's price always building up towards earnings and then crashing after (even when they beat the estimates). And by the way Netflix usually has a 0.06 EPS not 0.02 😂", "score": 1, "replies": [{"body": "> NFLX's price always building up towards earnings and then crashing after \n\nI've been trading NFLX for over a decade, wtf are you talking about?\n\nNFLX has moved (up or down) 10-15% a great many times; and then (when the news was great) kept dip buying and leaking higher.\n\nBut there was that glorious earnings when they simply crushed eps; and massive gap up; and then tanked the entire next day an insane % amount (as Carl Icahn was selling to close most of his massive position that entire day).\n\nEdit: checked my old trade notes; Dec 17 2014 Opened at 315; crushed earnings to upside,\nnext day Dec 18 2014 GapUp open at 350; Icahn sold all day taking NFLX down from 350 to 330; and was dip bought and small up the next day.", "score": 2, "replies": [{"body": "By always I should've meant, the recent earnings. NFLX has beaten earnings but has dropped the day of and the next few days after that. Sorry for the confusion.", "score": 1, "replies": [{"body": "with NFLX there's lots more to consider that just EPS and Revs, there is subscriber count, number of new subs, and lately: how is the International business doing. ", "score": 1, "replies": []}]}]}]}, {"body": "So i should go all in on nflx options?", "score": 1, "replies": [{"body": "No.", "score": 1, "replies": []}]}, {"body": "I think he has good points. Additional if you look at Cash from Financing Activities for the past four years, 2012 is 6M, 2013 is 480M, 2014 is 540M, 2015 is a whopping 1640M. For their operating cash flow, 2012 is 22M, 2013 is 98M, 2014 is 17M, 2015 is a whopping negative 744M. So they can continuing borrowing money and not making money. Unless they are doing something with that 1.6B they borrowed and turn this around, they might be in trouble. ", "score": 1, "replies": []}, {"body": "I'm starting to wonder if you even know how to go long", "score": 1, "replies": []}, {"body": "[Imgur](http://i.imgur.com/dzOeNaT.png)\n\nTo the moon alice....", "score": 1, "replies": []}, {"body": "I actually agree with OP but I am only shorting it with paper money.  Good luck OP and all.", "score": 1, "replies": []}, {"body": "> * Like Disney, NFLX will be hit by the \"curse of entertainment,\" meaning it is slower over the beginning of the summer (remember that this quarter's earnings are april-may-june, where nothing happens.\n\nEarnings expectations are set by year/year comparisons so if summers are slow then that's accounted for since Q2 of last year is used as a comparison. So, this bullet point sucks.", "score": 1, "replies": []}, {"body": "Every you said that is true is already priced into the stock. Everything that you said that is bullshit doesn't matter.", "score": 1, "replies": []}, {"body": "Was about to sell some commons for a bit off profit but I guess there is no need now, thanks I send you a postcard from the moon.", "score": 1, "replies": []}, {"body": "So I guess NFLX is going up....to record highs.", "score": 1, "replies": []}, {"body": "In before NFLX beats subscriber expectations and skyrockets.\n\nu/fscomeau stop betting right before earnings and you'll avoid being wrong in the 5% to 20% range.  If you trade the day after (or morning of for morning reports) you can ride the trend.\n\nAlso stocks usually go up or down for a good 3 months after these reports come out, so there's no need in guessing before the report.  Just wait for the report to come out, then trade, and I'm not talking about afterhours, I'm talking about the next day and the 3 months afterwards.\n\nhttp://www.streetinsider.com/ec_calendar.php", "score": 1, "replies": []}, {"body": "Lol everyone I know has Netflix in Canada. Older people too.", "score": 1, "replies": []}, {"body": "Relvant https://youtu.be/HTM05cVOEDY  ", "score": 1, "replies": []}, {"body": "Much of the earnings move is priced into the cost of the options.  You'd be best spreading the trade.  Consider 93x87.5.  Net debit of ~$1.43 puts your break even \"just\" 6.5% from mkt price.  \n\nBarron's is calling for a $50 price target.  Today's mkt price is supported by 30% yoy top line growth...FOR 10 YEARS.  Yeah, that's not reality.  ", "score": 1, "replies": []}, {"body": "I took a shot on your advice, bought 15 put contracts, netted a 130% gain. Just sending a word of thanks.", "score": 1, "replies": []}, {"body": "awww yeah, bought NFLX when I first started trading, looking forward to selling it after this spike.", "score": 1, "replies": []}]}
