{"title": "My next Ultra-$Yolo: Shorting AAPL (EARNINGS PLAY)", "selftext": "[deleted]", "id": "4sbu35", "created_utc": 1468254990.0, "score": 151, "upvote_ratio": 0.91, "num_comments": 204, "comments": [{"body": "When you're holding a stock that fscomeau just shorted;\n\nhttps://gfycat.com/LividInsistentChimpanzee", "score": 154, "replies": [{"body": "> This means smaller position and risk.\n\n##**SELLS 100 FUCKING ITM CALLS WITH $950K IN EXPOSURE**", "score": 34, "replies": [{"body": "Yeah starting to think he's a troll.", "score": 19, "replies": [{"body": "Um, I think we knew that back when his mom posted that he had died.", "score": 11, "replies": [{"body": "I think I missed that. ", "score": 2, "replies": [{"body": "Well, here's sort of what it looked like:\n\nhttps://www.reddit.com/r/fscomeau/comments/4qhjw1/help_my_son_in_the_hospital_dying/\n\nBut this isn't the post I was referring to.  He made the original one over a year ago.\n\nAlso here is some Bieber fan fiction by fsc:  http://justinbieberfanfiction.com/viewstory.php?textsize=0&sid=53851", "score": 2, "replies": []}]}]}]}, {"body": "expiration is also past ex-div date, he's gotta be trolling", "score": 5, "replies": [{"body": "He probably didn't know / didn't check , newbie type mistake.", "score": 3, "replies": []}, {"body": "explain please?\n\nwould there be a drop after ex div date?", "score": 2, "replies": [{"body": "being short ITM calls on ex div carries a lot more risk of early exercise. i know this because it's happened to me twice now\n\nedit: forgot to mention that you get doubled fucked because you end up short and obligated to pay the dividend", "score": 2, "replies": [{"body": "I for got or didn't know the dividend part. Thanks.\n\nI'll read up on early exercise.", "score": 1, "replies": []}, {"body": "but you get the offsetting px decrease of your 1 delta short now...so thats a wash, no? Still the early exercise can def fuck you, if you don't have the requisite capital.", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 15, "replies": [{"body": "That's music to my ears :-D", "score": 10, "replies": [{"body": "guys, if you downvote then it[the opposite] won't come true", "score": 3, "replies": []}]}, {"body": ">apple will never go back above $100.\n\nHoly shit you're actually a fucking awesome trader who is probably trolling wsb.\n", "score": 3, "replies": [{"body": "I don't know how he does it every single time. Either he's cursed or he's insanely well plugged in to major companies and industries on Wall Street.", "score": 1, "replies": []}, {"body": "We've known for quite some time. That's why the sub was private for sec investigation", "score": 1, "replies": []}]}, {"body": "THANK YOU!!\nStill holding my long position on apple, I needed this lol", "score": 2, "replies": []}, {"body": "7.20.16 11:49:13EST      AAPL $100.01", "score": 1, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Oh thank heavens. Holding long on AAPL. I knew that was a good choice.", "score": 1, "replies": []}]}]}, {"body": "So true, I am now expecting a blowout at their earnings report.", "score": 6, "replies": []}, {"body": "dead", "score": 5, "replies": []}, {"body": "Fucking same boat, I was starting to get really worried. I about panicked when I saw the title, then I looked at the username. I couldn't be happier.", "score": 1, "replies": []}]}, {"body": "\"Do not go gentle into that good night\"", "score": 35, "replies": [{"body": "fscomeau is the matt damon of investing", "score": 4, "replies": []}]}, {"body": "Wtffffffffff I'm so conflicted... Stick to my overall ideology or go inverse fs comeAu... Maybe I'll just fkn quit the markets and go all in on hookers", "score": 48, "replies": [{"body": "So we're $20 and 2\".", "score": 8, "replies": []}, {"body": "[removed]", "score": 6, "replies": [{"body": "Why the fuck would jay-z's opinion be of any interest to AAPL?", "score": 1, "replies": [{"body": "Content management. He is the most successful producer ever. Maybe iTunes can be saved.", "score": 1, "replies": []}, {"body": "Like it or not, he's an icon in the music industry and considered to possibly be the best rapper in history or at least top 2-3. He has millions of fans and his stuff sells. Isn't the bottom line more important than your personal music tastes or feelings about a person? If not, you're in the wrong business.", "score": 1, "replies": []}]}, {"body": "http://i.imgur.com/rxFI7wF.jpg     \nYour post has been automatically removed because of pedophilia. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "I'd be willing to bet your strategy has been right less frequently than the inverse FSC. It's statistics. Don't be a pussy and buy some Apple.", "score": 2, "replies": [{"body": "puts before apple earnings? go look at their stock price the day after earnings for the last two years.", "score": 1, "replies": []}]}, {"body": "That's the only thing to do.", "score": 1, "replies": []}, {"body": "Legit tho aapl is way under valued right now, even if it takes a hit at earnings it's a great long term investment. Also, short the fuck out of tsla.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "[removed]", "score": 26, "replies": [{"body": "lol you also get ass raped when you pick the direction wrong and IV rapes you and puts a debt-baby in your vagina", "score": 24, "replies": []}, {"body": "> I get the time decay. Someone explained it to me last night.\n\nYou're trading level 5 options and you needed someone to explain time decay to you? Now this is brilliant.", "score": 20, "replies": [{"body": "lelz\n\nRIP FSHOMO", "score": 2, "replies": []}]}, {"body": "Troll answer, hahah love ya fsc", "score": 10, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "> What happens when the person you sold the calls to isn't a complete retard, exercises the options right away\n\nThen fsc would pocket about 15k.... that'd be awesome for him.\n\n", "score": 7, "replies": []}]}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "it's not a bad play at all...judging from previous ER, Apple doesn't move much...so he can collect on his IV crush and theta.", "score": 1, "replies": []}]}, {"body": "Buying Apple", "score": 48, "replies": [{"body": "Already bought in earlier today before this post. Free money, boys!", "score": 16, "replies": []}, {"body": "Don't get caught up in the hot hand fallacy, he could be right one of these days.", "score": 7, "replies": [{"body": "[Have you seen the scorecard?](https://m.reddit.com/r/wallstreetbets/comments/4re24g/fscomeau_scorecard/)\n\nI used to think what you are thinking but holy shit, he is the inverse prophet", "score": 5, "replies": [{"body": "Thanks for the link", "score": 1, "replies": []}]}, {"body": "cold hand fallacy?", "score": 3, "replies": []}, {"body": "Thanks for the PSY 101 review ", "score": 1, "replies": []}]}]}, {"body": "Apple calls -- got it boss thanks. \n\n>Apple seems like a sure short right now\n\nJust like VRX and SPY right? \n\nYour DD sounds dangerously logical this time, so this means 100% yolo will be necessary. ", "score": 48, "replies": []}, {"body": "sold ITM call ? You can potentially be gang-raped by the Senegal soccer team. You realize that right? [gigantic dildoes](http://english.ahram.org.eg/Media/News/2013/1/30/2013-634951522264051897-405.jpg)", "score": 13, "replies": [{"body": "He has no idea selling ITM uncovered calls is a completely ridiculous strategy for his plan in American style options, he is learning as he goes along.\n\nThe options he sold can be exercised before the earnings date he is targeting and he would be forced into delivery.", "score": 11, "replies": [{"body": "Well the calls still have time value that the holder would lose if they exercised early, right? I agree though, higher chance getting exercised than OTM calls... questionable trade by based fsc as always.", "score": 6, "replies": []}, {"body": ">thinking any of this is real", "score": 1, "replies": []}]}, {"body": "Wants smaller position and risk, sells naked calls because someone told him about theta last night", "score": 5, "replies": []}, {"body": "If I were in his shoes I'd at least choose to sell OTM calls if I'm not going European. ITM calls = way higher chance of being exercised. This guy is begging for the D. ", "score": 3, "replies": [{"body": "Definitely. However, OTM are much more violent if they get close to/become ATM/ITM. ITM = rape with lube. ATM/ITM = rape with no lube.", "score": 2, "replies": [{"body": "I call this the Faggot's Dilemma.  \n\n* 1) Higher chance of rape, but with lube \n* 2) Lower chance of rape, but without lube\n\nPersonally, I tend to lean towards the second.", "score": 22, "replies": [{"body": "i fucking love this subreddit. I'm learning so much here.", "score": 9, "replies": []}, {"body": "lmao", "score": 3, "replies": []}]}]}]}]}, {"body": "did this idiot really write a naked call?\n\ni was going to pick up more AAPL if it went back down to 91, i guess since this post got made that's not happening anytime soon, dammnit", "score": 11, "replies": [{"body": "not just a naked call.\n\nhe wrote 100.", "score": 8, "replies": [{"body": "LOL, poor schmuck, you need to feel bad for him at some point.\n\nspeaking of fsc and the inverse fsc thereof, so far I have been watching and waiting and debating going in, but then factoring in the law of averages and the law of probability, even if its a 50/50 shot of going up or down there just HAS to be some point when the law of averages errs in your favor.\n\ni know when i choose to finally go inverse fsc that will happen, so when is the right time to do it", "score": 1, "replies": []}]}]}, {"body": "WAIT! The only thing FSC has been right on is apple. He called AAPL at 130. My rule is inverse FSC besides AAPL. ", "score": 10, "replies": [{"body": "you're going to be crucified just like him. ", "score": 4, "replies": [{"body": "Hey, FSJesus is my lord and savoir!", "score": 2, "replies": []}]}]}, {"body": "Can somebody create an app to notify us anytime FSC shitposts? That's something I can get my RH money behind. ", "score": 23, "replies": [{"body": "Come on now, they aren't shitposts, they should be called goldposts, because they bring us gold. ", "score": 32, "replies": []}, {"body": "No need to make an app.  Use IFTTT and create a recipe.\n\n* Trigger - New post from reddit search \"author:fscomeau subreddit:wallstreetbets\"\n* Action - whatever you want, SMS, app alert, email, etc.", "score": 15, "replies": [{"body": "> author:fscomeau subreddit:wallstreetbets\n\nhttps://ifttt.com/recipes/440117-fscomeau-alert\n\nyou're welcome cumguzzlers", "score": 2, "replies": []}]}, {"body": "I have a portion of my portfolio allocated purely to non-researched YOLOs taking inverse fscomeau for his word", "score": 7, "replies": []}, {"body": "https://www.reddit.com/user/fscomeau/.rss", "score": 8, "replies": []}, {"body": "I added him as a friend. But he really is my mentor.", "score": 7, "replies": []}, {"body": "https://www.reddit.com/user/fscomeau/.rss", "score": 5, "replies": []}, {"body": "> my RH money\n\nSo 35 bucks?", "score": 2, "replies": []}]}, {"body": "Oh boy ... thank you fsc", "score": 8, "replies": [{"body": "[removed]", "score": 10, "replies": [{"body": "Apple went down after last quarters earnings.\n\nThey always crash after earnings.  \n\nStocks went down the two trading days after Brexit.\n\nStocks will always go down.\n\nWhat can possibly go wrong?", "score": 17, "replies": [{"body": "That's it guys I'm bearish, sell everything and buy gold.", "score": 9, "replies": [{"body": "Plate your cocc in NUGT", "score": 2, "replies": []}]}]}, {"body": "I would tend to agree with your bearish view of Apple short term. But it's a big blue chip in a market that's been screaming upwards..... You gunna get fucked boy.", "score": 7, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "4 out of the last 6 Apple earnings reports you bought calls while I bought puts. Nice to see you've left the dark side", "score": 2, "replies": []}, {"body": "Always is a word you should never use in relation to the stock market ", "score": 4, "replies": [{"body": "[removed]", "score": 10, "replies": [{"body": "Oh like we'll never see the S&P above 2100 ever again, right?", "score": 11, "replies": [{"body": "He's supposed to be banned until it dips under 1900, but thank god he's not.", "score": 7, "replies": [{"body": "yeah, i mean.. we need to make money, and he's our best resource. he's like the retarded magic 8-ball that tells fortunes... backwards. ", "score": 3, "replies": []}]}]}, {"body": "I love you dude, keep making this sub wonderful <3", "score": 3, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "your honest opinion is worthless", "score": 1, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Apple underperforming the market almost every day the past few months had me lose my hope and I was about to sell. Not anymore though, the patience paid off! Thank you FSC.", "score": 7, "replies": [{"body": "he hath delivered the gainz upon us. #GainzInTheMail", "score": 2, "replies": []}]}, {"body": "You sold naked in the money calls on AAPL.\n\nThat's incredible.", "score": 10, "replies": []}, {"body": "Dammit my vrx is toast now. ", "score": 6, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "This, on the day that S&P500 hits an all time high", "score": 7, "replies": []}, {"body": "Fuck, I agree with this position and even recently switched to Android, but the inverse fscomeau is too strong.", "score": 7, "replies": []}, {"body": "I'm scared. I agree with fsc ", "score": 7, "replies": []}, {"body": "Apple buys twitter incoming.", "score": 13, "replies": [{"body": "that would actually tank apple", "score": 14, "replies": [{"body": "Integrate it with the iStore and it could be a good idea somehow maybe. Advertising synergy with the music/movies right there", "score": 1, "replies": []}]}]}, {"body": "Thank god. Thank god. Thank god. Feeling good about my AAPL holdings.", "score": 7, "replies": [{"body": "Same. Back to 110+!", "score": 2, "replies": []}]}, {"body": "While I trade AAPL very often, and in general agree that AAPL iPhone7 appears to be boring; and that the possible 'wow' stuff is being saved for the iPhone's 10th anniversary device in Fall 2017\n\nso while I do not disagree that AAPL might very likely drift lower;\n\nyou indicate you are seeking \"less risk\" and you sell 100 Naked Calls when the IV is very, very low.\n\nUnless you are an experienced option trader, you really cannot fathom the INSANE risk selling naked options can be. Yes, they can work fine; but experience WHEN to do them is key. \n\nIn short, the king of YOLO is now short 10,000 shares of AAPL with a breakeven of 98.89) AAPL is now at 97 and change. so every $1 move over 98.89 is $10,000. Plus his account has used Margin of $234k to open this position.\n\nMax Gain (100 x 100 x 3.89 = 38,900$)\n\nMax real-world Risk if left open and AAPL un-expectantly crushes earnings on Jul26 and runs over the obvious century mark at 100 to say 110.\n\nAt 110.89 Loss would be $120,000\n\nAt 120.89 Loss would be $220,000\n\nI was not expecting an AAPL rally post earnings; but now there's the inverse /u/fscomeau effect to consider. \n\n\nYou only got about $1.50 (approx) in Premium for 5 weeks of Time.\n\nTo lose reading who don't know what I'm talking about:\n\nA good options rule of thumb is : during times of high stress (Brexit a few weeks ago when the SPX fell over a 100 pts in 3 days) : Fear is high, VIX and IV are high = great time to SELL Options (if you feel the fear will abate).\n\nLikewise, a time like now, the VIX and IV have downticked very hard, there's no fear, thus, VIX and IV are very low and in general, a very poor time to SELL options (vs simply buying long calls or long puts).\n\nLastly, Naked Calls or Naked Puts are VERY VERY Dangerous, for there is no hedge if you are wrong; plus Naked Options require massive Margin (Capital, aka $) whereas another advantage of Option Spreads is to greatly reduce margin.\n\nAAPL may very well gone down into and after their JUL 26 earnings; but this position and the $234k of Margin it required are not the wisest way; but rather the fscomeau way.\n\noh King of YOLO fscomeau : i urge you strongly to before earnings to Long 100 JUL29 otm calls to hedge yourself (and vastly reduce your $234k Margin)", "score": 5, "replies": []}, {"body": "Ok this is actually a legit analysis of a company but I just can't help by get the feeling that AAPL is going to fuck fscomeau... I don't think Apple is going to crash from this point seeing how the stock has already start to stabilize and the insane amount of cash it still has to push in for new ideas. ", "score": 5, "replies": [{"body": "Yeah he's making some good points, but inverse FSC reigns supreme. Learn to stop worrying and trust in the theorem. If FSC said the sun was gonna come up tomorrow I'd start prepping for the end of the world.", "score": 15, "replies": [{"body": "SHORT THE SUN. IT IS THE ONLY WAY.", "score": 3, "replies": []}]}]}, {"body": "$AAPL bagholders rejoice! It's about damn time.", "score": 7, "replies": []}, {"body": "Goddamnit, I just closed my AAPL position ", "score": 3, "replies": []}, {"body": "so you say you're shorting AAPL, but why do you have an aug 19 CALL position on AAPL? Is it only until the earnings?", "score": 2, "replies": [{"body": "He sold an uncovered ITM CALL, yes it boggles your mind because the amount of risk he is taking.\n\nLook up options level 6. Most brokers won't allow this unless you are accredited, which now leads me to believe it's fake.", "score": 13, "replies": [{"body": "yeah, im still trying to come in terms with the risks! ", "score": 3, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Jesus Christ. He needs to get that patreon up and running ASAP", "score": 5, "replies": []}]}]}, {"body": "I mean he's a troll right, so either he is filthy rich or this is a paper account.\n\n", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 6, "replies": [{"body": "unsuspecting ~~buyer~~ rapist.\n\nftfy", "score": 7, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "he's selling the calls. Hence \"Position -100\"", "score": 4, "replies": [{"body": "ah, didnt notice the minus!", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 4, "replies": [{"body": "nothing matters. nobody knows what's going to happen. all that means anything is that FSC is wrong. blessed are we for the gainz that we are about to receive through his bounty, FSC, our lord. amen. ", "score": 3, "replies": []}]}, {"body": "Technicals show that AAPL is finding support at the $92 level. Looks like in the short term AAPL may go back up to $100. People are buying the dips with this stock, and I don't see how it's going to \"crash\" as you say it will. This is an institutional stock- aka owned by long term investors. People don't sell their shares just because AAPL has a bad two quarters.\n\n21 day EMA just crossed over the 50 day EMA. (Bullish signal)\n\nPrice just went above the basis line on the Bollinger Band. (Bullish signal)\n\nRSI just crossed over 50. (Bullish signal)\n\nMACD just crossed over the signal line. (Bullish signal)\n\nAccumulation/Distribution indicator is going up. (Bullish signal)\n\nHOLY FUCK DUDE! SO MANY BULLISH SIGNALS AND YOU STILL WANT TO SHORT IT AT THIS PRICE??? Maybe you could have shorted it at $130 or $120 or $110, but now the stock has gathered so much support. The likelihood of breaking $90 is VERY LOW and any price below $90 should be considered a great buying opportunity. \n\nGo fuck yourself, you moron.\n", "score": 4, "replies": [{"body": "Note: I am not promising the same will be true this qtr; however, a great many times the Tape has rallied very strongly into Earnings; \n\nEarnings occurred and the Tape \"Sold the News\"\n\nBank earnings on friday will be interesting.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "You obviously have no idea what you are doing. Good luck selling those calls. ", "score": 2, "replies": []}, {"body": "How's your short SPY going? Are you dead yet?", "score": 1, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Loading the fucking boat", "score": 3, "replies": []}, {"body": "And now apple will announce its entrance into the Indian market.", "score": 3, "replies": []}, {"body": "You're selling premium on a stock that has had volatility spikes as high as 130% but is currently lumbering along at a measly 25%. \n\nThis isn't a bet I would make. ", "score": 3, "replies": [{"body": "I said as much elsewhere here; horrid time to SELL Options, great time for long calls and long puts.", "score": 2, "replies": []}]}, {"body": "Fuck this guy.  The analysis isn't necessarily off, but god damn the amount of risk is excessive.  Fscomeau has got some balls of tungsten.\n\nPersonally, I am a strong believer of inverse fscomeau.  Since the universe conspires to fuck this guy over, I think we will see nothing short of Steve Jobs come back to life tomorrow thus driving Apple stock to the moon.", "score": 3, "replies": [{"body": "no Mr Jobs isn't coming back\n\nHowever\n\nyou know that tweet Elon Musk sent out about \"AMAZING\" is coming...\n\nwell SpaceX found Diamonds on the asteroid belt ; they are Mining them secretly for years, Mr Musk is taking those gains, and buying AAPL for $150/share and merging it with TSLA and SCTY and using top-secret AI they've been working on.\n\nThat's the super-secret Mr. Musk meant by \"amazing is coming soon\"\n\n", "score": 2, "replies": [{"body": "Neat", "score": 1, "replies": []}]}]}, {"body": "I was thinking about closing my appl position today right before earnings. After reading FSC's post Im gonna do it for sure. Thanks!", "score": 2, "replies": []}, {"body": "I'm long Apple so.. thanks buddy.", "score": 2, "replies": []}, {"body": "fuck I balls deep in APPL short.", "score": 2, "replies": []}, {"body": "Doubling down on my AAPL calls", "score": 2, "replies": []}, {"body": "i love how this dude \"massively\" exaggerates massively on how a specific ticker or index will massively crash", "score": 2, "replies": []}, {"body": "So how do you feel about oil?", "score": 2, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": "YES!!!!!!", "score": 2, "replies": [{"body": "jesus christ. I've always followed inv-FSC, but rarely bet on it because I like to focus on the energy sector and there isn't much FSC commentary there, but +3% overnight. FSC is truly a god.", "score": 1, "replies": [{"body": "10% if you went 3x :D, dumping UWTI I got yesterday.\n\nEDIT: and... of course it goes higher after I sold @ $27.17, now at $27.52 and climbing", "score": 1, "replies": []}]}]}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "OP: Short 100 AAPL AUG19 95call with AAPL common at approx 97.25 indicates \n\n**Margin for this position to be $233,500**\n\nLast you spoke you indicated your account was \"all-in\" already\n\nyou indicated you covered your short on VRX but that wouldn't have given you enough money for the Margin required on this new AAPL Credit Call Spread.\n\n", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Math dude: why park $234k Margin into a multi-week hold with a MAX return of $38k\n\nWith the tape moving so strongly, and with the IV this insanely low, this is YOLO time with Long Calls and Long puts on various stocks.\n\nGS JUL15 being my choice for this Friday's JPM and C earnings.\n\nJPM and C JUL15 options logically have higher IV as they have earnings on friday. I don't wanna go Long Premium; BUT I can trade JUL15 weeklys on GS for cheap (lower IV) and JPM and C earnings sure as hell will move GS.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.6329 \n > [What is this?](https://pastebin.com/64GuVi2F/41101)", "score": 3, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "BTW- everyone long on VRX get out now, they should plummet now that FSC closed his short position", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Damn I called it ;)", "score": 1, "replies": []}]}]}, {"body": "Do you side with Logic or Inverse Fscomeau? Choose wisely, wallstreetbetter.", "score": 3, "replies": [{"body": "Inverse FSC every time. Trust me, Apple is going way up while he's shorting them.", "score": 3, "replies": []}]}, {"body": "Fuck. This time he is making sense. Better avoid this one", "score": 2, "replies": []}, {"body": "Thank you fsc!!", "score": 1, "replies": []}, {"body": "Would you please do some UK politics betting? I'd like to know how brexit turns out... ", "score": 1, "replies": []}, {"body": "95 calls? Joke's on you, I bought at 94.", "score": 1, "replies": []}, {"body": "Hell yeah holding my AAPL GIMME THE MONIES", "score": 1, "replies": []}, {"body": "Boom. Glad I've held onto my shares.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Well I wasn't planning on buying AAPL shares, but I guess I could sell some other stuff and go long AAPL just for the ER bump", "score": 1, "replies": []}, {"body": "Time to sell my gold and buy $AAPL. ", "score": 1, "replies": []}, {"body": "Just going to go ahead and hold my calls then. First exposure to the inverse FSC, dont fuck me, fuck him plz.", "score": 1, "replies": []}, {"body": "Do you think the market will be red or green tomorrow? I need to know if I should go all in. Serious question.", "score": 1, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "So S and P going to rocket again I guess.", "score": 2, "replies": []}, {"body": "amazing", "score": 1, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Don't ignore iPhone SE sales, that might boost their earnings", "score": 1, "replies": []}, {"body": "AAPL CALLZ DING DING DING", "score": 1, "replies": []}, {"body": "Thank god I have AAPL calls right now.", "score": 1, "replies": []}, {"body": "I think... I think we've been reverse Comeau'd.  Shorting AAPL to be sure.", "score": 1, "replies": []}, {"body": "FSC speaks. Now go in peace brothers and sisters and earn those inverse gainz.", "score": 1, "replies": []}, {"body": "I sold my vrx position since fsc closed his short. Will go long on aapl before earnings and post proof. ", "score": 1, "replies": []}, {"body": "Anybody care to share their specific plan of action for buying Apple calls? I haven't bought any options, but I might take a shot at this one. YOLO. What strike price etc are you buying? Thanks fags", "score": 1, "replies": []}, {"body": "The man has been a pro trader for 15 years relax.", "score": 1, "replies": []}, {"body": "I agree with your DD but why the fuck naked calls? I would rather spread from 95-92, 20k can get me a good couple hundred put options...", "score": 1, "replies": []}, {"body": "Bullet #4", "score": 1, "replies": []}, {"body": "wth is time decay", "score": 1, "replies": []}, {"body": "I bet you're going to hold these positions until you are correct. Holy fuck dude, legit never seen you mention \"stop loss\"\n", "score": 1, "replies": []}, {"body": "You closed VRX short at a $10000 loss....", "score": 1, "replies": []}, {"body": "andddd I was just about to unload my appl shares...hmmm.", "score": 1, "replies": []}, {"body": "[Chromecast vs Apple TV](https://www.google.com/trends/explore#q=chromecast%2C%20apple%20tv&cmpt=q&tz=Etc%2FGMT-2)\n\nVery slightly favours Chromecast. Nothing to save Apple's earnings there.", "score": 1, "replies": []}, {"body": "You should take your $1k and move on ", "score": 1, "replies": []}, {"body": "Selling naked ITM options is absolutely the most retarded thing I have **ever** heard. Congratulations FSC.", "score": 1, "replies": []}, {"body": "I actually agree with /u/fscomeau . I don't know how I feel about that ", "score": 1, "replies": []}, {"body": "Updates with screenshots daily please!", "score": 1, "replies": []}, {"body": "Of all the hare brained fscomeau plays I've seen, this one might actually make some sense.  On the other side of the coin, aapl is hovering at lows and this guy burns money faster than a bank fire", "score": 1, "replies": []}, {"body": "I don't know how AAPL is going to break earnings records and jump straight to 120 a share, but fsc has spoken", "score": 1, "replies": []}, {"body": "You, sir, are an idiot.", "score": 1, "replies": []}, {"body": "Mods sticky please ", "score": 1, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "I agree. Aapl shit stock, short of the century. Gonna report my PnL after earnings.", "score": 1, "replies": []}, {"body": "Would you please go away like you always say you will?", "score": 1, "replies": []}, {"body": "How does the $1B in cash that they've been hoarding factor into your analysis?\n\nedit: $100B ", "score": 0, "replies": [{"body": "You mean $100B, right?\n\nPretty sure they've been holding it in Europe/Ireland, likely some of it in GBP.", "score": 6, "replies": [{"body": "What's the conversion ration on good boy points to dollarydoos?", "score": 9, "replies": []}, {"body": "I'm thinking too small. Yup that cool $100B. Can't find any recent (summer 2016) articles about it.", "score": 1, "replies": []}, {"body": "It's $230+ bn", "score": 1, "replies": []}]}, {"body": "Don't forget all the debt that is backed by that cash...", "score": 1, "replies": []}]}, {"body": "thats actually not stupid...", "score": -2, "replies": [{"body": "Did you miss the part about writing uncovered calls?", "score": 3, "replies": []}]}]}
