{"title": "[VVUS/ARNA/OREX] July 17 obesity thread", "selftext": "WEooooo, tomorrow has almost arrived!\n\nList your hopes, plays, and predictions for tomorrow!\n\nI'll go first... I am making a hopeful play for a Qnexa CRL with a huge ARNA pop, but I strongly suspect an approval with minor movement from ARNA. VVUS may peak mid-30s but settle in low-30s tomorrow if approved, otherwise, it could drop to 6 in the short-term. [**edit** after this bear raid, I don't think VVUS will be in the 30s for longer than 10 seconds if approved]\n\nEDIT: I should have mentioned that if it hadn't been announced in PM, the chances of a sell-off or bear raid are astronomically high. But obviously you don't know if it's going to be announced at 9:40 or something, so it's a hard sell to make if you were willing to sit through PDUFA at yesterday's EOD price. I hope not too many of you got ripped off. Unfortunately, your upside may have been hit hard, while the downside from where you were yesterday still remains. I bought at 24.30s and sold at 26.50s, back in ARNA now :D\n\n**DO NOT USE STOPS!**", "id": "wnunt", "created_utc": 1342470600.0, "score": 11, "upvote_ratio": 0.84, "num_comments": 49, "comments": [{"body": "Too many newsflashes!!! http://i.qkme.me/3q4lff.jpg", "score": 7, "replies": []}, {"body": "I'm fucking dying here... FUCKING RELEASE THE NEWS!", "score": 6, "replies": [{"body": "I predict a lengthy response, restricting use for pregnant women, they won't release until the halt closes trading for the day, and people get a chance to fully understand the FDA response. ", "score": 1, "replies": []}]}, {"body": "Qnexa CRL sounds about right, ARNA is a safe bet since it will likely maintain value no matter what, but will move higher from a lot of factors. If Qnexa is denied of approval, I feel OREX may drop since it will add the assumption of a lowered approval chance. If Qnexa gets CRL probably will see OREX move up or maintain value. \n\nMy position, long ARNA. Longest stock I've held, so I'm in from months earlier.\n", "score": 3, "replies": [{"body": "I held and I am so boned tomorrow for going long. Stupid Vivus.", "score": 1, "replies": []}]}, {"body": "VVUS approved.\nhttp://www.fda.gov/NewsEvents/Newsroom/PressAnnouncements/ucm312468.htm", "score": 3, "replies": []}, {"body": "Why does anything think Qnexa gets the CRL? They had a really positive review, 20-2, what changed? ", "score": 2, "replies": [{"body": "TBH, I honestly think ARNA is in a win-win situation. Institutions will want to load up more in ARNA, so any dip tomorrow **will** be short-lived. Institutions load up as much as they can when volume is high, which it will be on dates such as tomorrow, so that their buying doesn't drive up the stock as quickly. ARNA has been approved, and institutional ownership for such a blockbuster drug is still pitiful. Institutions want in and they will wipe out stops tomorrow if they feel like they can. Do not use stops tomorrow. If VVUS is rejected, or if you hold through the dip tomorrow (and double-down even), you will be green in a very short period.\n\nI feel like this bet has me breaking even within a week, or giving me a 50% return by tomorrow's close. Who wouldn't take such odds?\n\nIf you haven't gotten in, I'd be ready to capitalize on the dip in ARNA if you are reluctant to hold (assuming it happens).\n\nAs for your question, I simply think that there is a real possibility that VVUS is approved with a very restrictive guideline+REMs... That **should** be considered a rejection at the current market capital. The FDA does not want a repeat of fenphen, and they have other obesity options in OREX and Lorphen... A CRL, in my mind (and apparently not the institutions), is a possibility... No matter how remote, I still think long ARNA is a winner.", "score": 4, "replies": [{"body": "Even in the face of the never-ending climb of Orex, ARNA is still your Huckleberry? ", "score": 1, "replies": [{"body": ":D", "score": 2, "replies": [{"body": "C0mputar, I have a great deal of respect and admiration for you. I think very highly of you, but I just don't see it. I hope I'm wrong, and I'll be mostly sitting on the side-lines here, so best of luck. God speed. ", "score": 1, "replies": []}]}]}]}]}, {"body": "VVUS dropped like a rock to start, got in around the mid-June price.  Hope all goes well with the announcement.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Bear raid? Profit taking?", "score": 1, "replies": [{"body": "Bear raid, definitely bear raid. Not even a question. ", "score": 1, "replies": []}]}]}, {"body": "Not a bad bet by any means, and in my earlier days I would consider holding through PDUFA if it doesn't go above the 25s, but if you got in the 24s or lower, consider a proxy play. In any case, I do think approval odds are very good, just understand that at this level, there is a >50% downside.", "score": 1, "replies": []}]}, {"body": "ARNA and VVUS bear raids everywhere~!", "score": 2, "replies": []}, {"body": "Approved. ", "score": 2, "replies": []}, {"body": "I'm sitting on this into opening tomorrow. Gonna be crazehhh!", "score": 2, "replies": [{"body": "Are you sitting on VVUS?\n\nbtw what's your take on arna? it got hit pretty hard after the vvus news broke. im worried that it'll get hit harder once the market opens tomorrow.", "score": 1, "replies": [{"body": "http://www.reddit.com/r/wallstreetbets/comments/wqibw/vvus_approved/", "score": 1, "replies": []}]}]}, {"body": "I picked up some shares of ARNA before the market closed today. I'm hoping that VVUS gets a CRL or even rejected. I might even pick up some more shares of ARNA if there's a dip.\n\nARNA's here to stay, and the big boys only have 30% of it (compared to 70% in VVUS). Ignore nutjobs like jim kramer, stay the course and then count your green :)", "score": 1, "replies": [{"body": "Lorcaserin is demonstrably inferior to topirimate. Why is ARNA gonna do so well compared to VVUS? If you don't want the side-effects from QNEXA, take a lower dose, by the time the efficacy rates get as low as ARNA, VVUS product side-effects could virtually vanish. I just don't see why ARNA will have market shares if VVUS gets approved. ", "score": 1, "replies": [{"body": "VVUS approval was priced into VVUS prior to bear raid as much as it was priced into ARNA. There's a small chance it gets rejected, should I risk huge downside for minimal returns, or chance huge returns for little downside?", "score": 2, "replies": [{"body": "Proper response. Thank you, sir. ", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Rock on. GL!", "score": 2, "replies": []}, {"body": "Holding what? ARNA or VVUS?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "20-2 provisional approval. Why would they get rejected? ", "score": 1, "replies": []}]}]}]}, {"body": "I bought the stock today, and out of the money puts just for some protection if they don't get approved. Sorry edited because I forgot the stock. VVUS.", "score": 1, "replies": [{"body": "BEST OF LUCK. NO SLEEP FOR ME TONIGHT!", "score": 2, "replies": []}]}, {"body": "So, most likely some c*cksucking institutional investory sold a couple hundred VVUS shares @ $20 to drive the price way down this morning (so they could snap up all the cheap shares), which caused my stops to trigger, and now the stock price is back around $26, and no news yet.  I was initially in @ $22 on 2 different accounts, which essentially broke even with the stops and where they sold.\n\nDo you guys think its even worth getting back in @ $26, or just drop it and take it as a lesson learned?", "score": 1, "replies": [{"body": "Take it as lesson learned. Never use stops, and biotech stocks always get hit by bear raids or selloffs in the first 30 minutes of the day if it hasn't undergone them in previous days prior to pdufa. I can't remember it not happening, it's like the Law of Thermodynamics in that regard.", "score": 3, "replies": [{"body": "I was trying to look at ARNA as an example to see if we might have another drop prior...  Do you think a new stop is a bad idea, or will I end up the same fate as souporcereal right before the news hits?", "score": 2, "replies": [{"body": "Stops are always bad.", "score": 3, "replies": [{"body": "Edit replied to wrong person.", "score": 2, "replies": []}]}]}, {"body": "Thanks!  Do you (or anyone else) have any thoughts on getting back in, and putting a really low stop, maybe <$20, just in case it does get rejected and the stock bombs?  I'm kind of iffy/burnt on the whole thing now.", "score": 1, "replies": [{"body": "Bear raids, bear raids/sell offs, rejection, and/or approval(and pre-approval price is too high) cause stocks to plummet too fast. Your stops generally only fill when it hits bottom. Do not use stops around catalyst dates.\n\nIn my opinion, VVUS will be in the 30s for maybe 10 seconds if it's approved. It will go <10 easily if rejected. That's all I can help you with, and those are just my opinions (I could be way off, maybe VVUS goes 40, but that would be very uncharacteristic).", "score": 4, "replies": []}, {"body": "There will be a halt before the results are known, and you will have time to figure out where to get out in either case. Never put a stop. ", "score": 1, "replies": [{"body": "Can you elaborate on this more?  Do you mean they will cease trading of the stock for a period of time?  How long is this timeframe?  I apologize for the newbness, I'm traditionally a lower-risk long-term investor so I don't have to worry about these things, but am trying to get my feet wet in short-term riskier traders.", "score": 1, "replies": [{"body": "For Arena's approval, they paused trading for like a half hour or 15 min or so. I think.  So if you see it flatline today you know the announcement is coming, keep an eye out for news and make up your mind on what to do I guess.", "score": 1, "replies": []}, {"body": "The moment the FDA sends the news to VVUS (or any biotech company waiting for PDUFA news), the stock gets halted. It's a SEC requirement. Depending on the company, a press release will come out after the halt, and will take arbitrary amounts of time before the halt gets lifted. A typical approval sees a PR almost immediately. If you wait for more than a minute, that usually implies a CRL (rejection). You will have to wait for a PR. The halt can last till past Aftermarket hours, as seen in MAPP. CHTP had at least a 6 hour halt, IIRC.\n\nJoin us on IRC (see sidebar).", "score": 1, "replies": []}]}]}]}]}, {"body": "Well, I got in at 25.50, but I'm not sure my opinion matters, I'm new here.  That sucks about the stops.", "score": 2, "replies": []}]}, {"body": "anyone think VVUS is a take over target? Their other drug, a ED drug was approved last month, if their obesity pill gets approved too as well, I can easily see this being snapped up. Thoughts?", "score": 1, "replies": [{"body": "Possible, I ain't a BO speculator.", "score": 2, "replies": []}]}, {"body": "pretty good swing trade on the raid this morning.  from 21 to 29 in a matter of an hour.  gl to those holding through pdufa.  i'm arna long cuz it was safer, but the side effects of VVUS is scary which is why i stayed away", "score": 1, "replies": []}, {"body": "ARNA had a bear raid earlier as well", "score": 1, "replies": []}, {"body": "So...where do we go from here.  No announcement?  I'm kind of tempted to get back in in the morning if it remains unannounced.  Does no announcement likely mean rejection?\n\nAnd yea, I learned the hard lesson about stops today.  Good news is that I didn't really lose anything on them...I just wiped out a minimum of $6/share profit that I could have cashed in on :(", "score": 1, "replies": [{"body": "Late announcement makes me think rejection more likely, but it's not every day a news outlet like USToday makes a clusterfuck out of everything.", "score": 1, "replies": []}]}, {"body": "I jumped back in arna at 11.18 today, quite a drop AH. Decision time. ", "score": 1, "replies": []}, {"body": "Approved: http://finance.yahoo.com/news/fda-approves-highly-anticipated-weight-231848797.html\n\nFkn Bear Raids.", "score": 1, "replies": []}]}
