{"title": "Bank of America CEO says latest spending and savings data show that the U.S. consumer is healthy。Are you healthy?", "selftext": " \n\n* **Bank of America’s customers continue to spend freely, using their credit cards and other payment methods for 10% more transaction volume in September and the first half of October than a year earlier, CEO Brian Moynihan said.**\n* **Customers’ account balances remain higher than before the coronavirus pandemic struck in early 2020, Moynihan said, indicating that they were in a good position to continue spending.**\n* **Finally, consumer credit remains pristine, with late-payment metrics still well below pre-2020 averages, indicating that so far, customers have had little difficulty keeping up with their debt.**\n\n \n\nConsumers are financially resilient, despite high inflation and concerns the U.S. is nearing a recession, according to [Bank of America](https://www.cnbc.com/quotes/BAC/) CEO [Brian Moynihan](https://www.cnbc.com/brian-moynihan/).\n\n\"Analysts might wonder whether the talk of inflation, recession and other factors could \\[result\\] in a slower spending growth,\" Moynihan said Monday during a conference call to discuss [third-quarter results](https://www.cnbc.com/2022/10/17/bank-of-america-bac-q3-2022-earnings.html) that topped analysts' expectations. \"We just don't see \\[that\\] here at Bank of America.\"\n\nThe bank's customers continue to spend freely, using their credit cards and other payment methods for 10% more transaction volumes in September and the first half of October than a year earlier, Moynihan said. While price inflation accounts for some of that, the number of transactions also rose 6%, he said.\n\nCustomers’ account balances remain higher than before [the coronavirus pandemic](https://www.cnbc.com/coronavirus/) struck in early 2020, Moynihan said, indicating they were in a good position to continue spending. That is especially true for those who had the smallest balances, which were about five times higher than before the pandemic, according to a Bank of America [chart](https://d1io3yog0oux5.cloudfront.net/_b81b10e3b00ca2879952e619db1e9a62/bankofamerica/db/806/9760/presentation/The+Presentation+Materials+3Q22.pdf).\n\nFinally, consumer credit remains pristine, with late-payment metrics still well below pre-2020 averages, Moynihan said, indicating that so far, customers had little difficulty keeping up with their debt.\n\n“We’re just now seeing \\[a\\] gradual move off these lows in early stage delinquencies; late-stage delinquencies are still 40% below pre-pandemic,” Moynihan said.", "id": "y6uubr", "created_utc": 1666061830.0, "score": 88, "upvote_ratio": 0.85, "num_comments": 97, "comments": [{"body": "Sell everything.", "score": 74, "replies": [{"body": "Sounds similar to Credit Suisse & now it's American Swiss time", "score": 19, "replies": []}, {"body": "This was my first thought but seeing your comment made me laugh out loud. \n\nI put the ‘reassuring’ comments made during the 2008 financial crisis on a timeline and everything was fine until people were carrying out their stuff out in boxes after losing their jobs.", "score": 5, "replies": []}, {"body": "Are you sure they're not lying?", "score": 10, "replies": []}]}, {"body": "Inflation is destroying my savings.", "score": 52, "replies": [{"body": "Well it's the lesser of three evils right now. Housing market, stocks, or cash.", "score": 14, "replies": []}, {"body": "I’ve never had so much credit card debt in my 33 years of existence", "score": 16, "replies": [{"body": "Hi, are you me?", "score": 7, "replies": []}, {"body": "Not quite sure on your situation. But have you ever worked with a money coach to have your budget looked at?", "score": 1, "replies": [{"body": "I’m usually good prior to this last year I’ve never paid a dime in interest on any of my cards I always paid them off so my “rewards” were -$1,100. (I know this isn’t the way to build credit I just hate paying more if I have the funds in my account to pay off my cards.) it’s literally the cost of everything going up for me. I have a rental property that I refuse to raise rent but fixing/replacing things got sooooo much more expensive.", "score": 1, "replies": [{"body": "Oh, well I mean, most people don’t have one property let alone 2", "score": 2, "replies": [{"body": "I live in it", "score": 1, "replies": []}]}]}]}]}, {"body": "Everything is getting destroyed.", "score": 3, "replies": [{"body": "Maybe it's all an illusion. Don't worry.", "score": 1, "replies": []}]}]}, {"body": "Carmer advised last Friday on CNBC , sell everything this week. But market was extremely green today.", "score": 26, "replies": [{"body": "Sell when you’re green, not red.", "score": 34, "replies": [{"body": "Nah that can’t be right", "score": 14, "replies": []}, {"body": "You must be new here. We buy from the top and sell at the bottom.", "score": 5, "replies": [{"body": "Stick to the end, resolutely not to sell", "score": 1, "replies": []}]}]}, {"body": "By the time it hits the mainstream news, it's already over.", "score": 2, "replies": [{"body": "No, maybe it's a new beginning", "score": 1, "replies": []}]}, {"body": "Inverse Cramer portfolio for the win. Continues to outperform any other fund", "score": 1, "replies": []}]}, {"body": "I have money. My vehicles are both 11 years old and the miles are piling up. My cell phones are old. My clothes are old. My cable disconnected. I try to keep my subscriptions to a minimum. I don't go to the doctor for my sleep apnea, insomnia, or psoriasis unless I absolutely have to. I intermittent fast most days.. I found that skipping meals and drinking the free coffee in the office rather than having a soda or energy drink offsets the increased food costs. Overall.. I might have money in my accounts but I don't feel healthy. I'm just worn out and feeling more and more hopeless as the years go on.", "score": 18, "replies": [{"body": "Suggest eating foods with calcium , magnesium, & potassium - each of these helps me sleep unaided. Missing 1 of the 3 ruins the sleep benefit.  Also I practice many of your behaviors to minimize spending. Wishing you optimism.", "score": 2, "replies": []}, {"body": "Hey man, you're obviously over-anxious. Time to shift your focus and go do something that makes no sense to watch anymore. You'll come to thank me!", "score": 1, "replies": []}]}, {"body": "What we are dealing with is a consumerist culture that is unable to slow down its demand regardless of resources available.\n\nCredit, marketing, and overly bullish markets (to a lesser extent) have led to people either being too wealthy to feel our economy slow, or too young to remember how to properly save and become frugal when necessary. \n\nAmericans simply don't know how to hold on to their money even when they don't have it, meaning we will soon have another credit/loan crash once the overdue notices start piling up.", "score": 34, "replies": [{"body": "Good point. I don’t get how spending has not fallen is a good thing - in fact it’s the very thing the feds are trying to reduce.   Also if kind of a weird metric without actual numbers , say u buy x% less but have to pay more by the previous equivalent then on paper u there is no drop in spending", "score": 7, "replies": [{"body": "I advise you to look into the relationship of supply and demand to understand both the problem and potential solution.\n\nIn theory the fed can dampen demand, but increasing supply would have a similar affect as well (and one we simply might need to focus on more with the current spending culture)", "score": 1, "replies": []}]}, {"body": "Credit cards are nothing better than a bank ran payday loan. Eventually they won't raise the credit limit and the minimum payment rises to more than you make because of rising interest rates..  they lure you into the trap when they offer ever growing credit limit you start using the credit to extend the money you're short every month because of inflation. Then they close the trap by caping the credit limit and then raise interest rates on that credit.", "score": 3, "replies": [{"body": "I mean I use credit cards for everything. All purchases throughout the month then pay them off at end of the month. Mine have been higher the last 5 months because of inflation though. Saving less.", "score": 5, "replies": []}]}, {"body": "I'm guessing you've never been poor. Most people in poverty use credit cards to pay for things they need, you know like food or rent or gas to get to a job. They're not out there buying big screen tvs and fancy things.", "score": 2, "replies": [{"body": "I've never been anything less than dirt poor. I see how other people depend on credit and loans but I find it to be participating in one's own victimization. Specifically seeing my dad use credit with responsibility and how it was supposed to be used, and my mom being the opposite and letting it prop up a lifestyle she couldn't afford.\n\nI don't mean to victim blame here, our system is predatory. I just mean to provide you context into who I am and refute the claim thar I have any wealth beyond having parents who did better than a lot of other people in my class (I'm poor but my parents both had college degrees and steady work).\n\nI don't look down on people in the situation you describe, I just don't think it's a smart idea.", "score": 2, "replies": []}]}]}, {"body": "It feels that the market is overly optimistic based on BOA report on the current health of the consumer. We know that the economy is strong and hot right now, that's what the FED is trying to tame. Shouldn't we be more worried with the health of the consumer in the next 6 to 12 months when the full effect of interest rate hikes will be felt? We aren't seeing unemployment numbers going up yet. We aren't done with hiking yet either and we still don't know what the terminal rate will be. I've read somewhere else that bear markets don't tend to fully bottom until rate hikes stop.", "score": 9, "replies": [{"body": "On average there are positive returns during the final 3 rate hikes. Which there is talk about 3 more rate hikes and holding. Of course that all depends on the data.", "score": 1, "replies": [{"body": "The market is a child, no one knows when he will cry", "score": 1, "replies": []}]}, {"body": "At my company they've been laying off for over a year but their approach has been deliberate so \"only\" a handful of employees are laid off at a time", "score": 1, "replies": []}]}, {"body": "What they aren't telling you is that credit card spending is going toward necessities not wants but needs. Any middle to working class person knows how little money is stretching and has that gut feeling it's only going to get worse. \n\nWait till student loan payments turn back on. \n\nOr people can no longer afford monthly payments on their car or feel like they will default on their cars .\n\nI feel pessimistic. \n\nThe only difference I feel is that alot of people pay more attention to stocks after gamestop fiasco. And I feel like a lot of people are participating in DCA stocks as they drop.", "score": 8, "replies": [{"body": "At least in my circles.. everyone who I know who got into stocks because of gme and crypto have tapped out at this point so yeah they pay attention but have no skin in the game outside of IRAs and/or 401ks", "score": 1, "replies": []}]}, {"body": "Number of transactions increasing. Tell me that isn’t people buying only as much of something as they absolutely have to buy and therefore more frequently. Can’t fill up the tank - put half a tank in. Put some more in three days later. Can’t afford a full grocery cart - bologna today, bread next week.", "score": 23, "replies": [{"body": "Correct. They are putting a positive spin on the fact that consumers are using credit on necessities. I've been there before. Its only so much survival mode routes you can take until you hit the dead end road where you can no longer manipulate your credit lines and cash until you have to start choosing what to stop paying temporarily.\n\nLuckily I'm not in that position anymore. But I've been there", "score": 11, "replies": [{"body": "Me too. Which is why I call bullshit on this. I don't know if they actually believe this or if they are in denial. At any rate, they need some input from people who haven't been rich or middle class all their lives to examine spending patterns.", "score": 3, "replies": []}, {"body": "Using a credit card for payday loans never end well.", "score": 2, "replies": []}]}]}, {"body": "Credit card usage up 10% seems very healthy. And of course avg account balance is steady. We aren’t burning the money. Sure my account maybe down but my landlords up so avgs out still. But 3 months until student loans start back up. And money is actually going to be pulled out of the economy.", "score": 16, "replies": []}, {"body": "Remember when that one CEO said that American consumers have adjusted to the higher prices for goods ..\n\n\nWhat a joke lol. They actually think we believe the B's they spew", "score": 6, "replies": []}, {"body": "I’m not healthy but that’s because I have a crippling options addiction, nothing to do with the economy.", "score": 9, "replies": []}, {"body": "So a large bank CEO said consumers are fine? Look, I’m bald, and won’t listen to a barber tell me I need a haircut. Pretty sure a large bank CEO isn’t the most accurate place to get a picture of the needs of the average consumer.", "score": 4, "replies": []}, {"body": "Been healthier lol", "score": 5, "replies": []}, {"body": "High inflation shows that I spend more than I did before", "score": 6, "replies": []}, {"body": "I got 17 dollars in my bank account. I’m ok I guess", "score": 4, "replies": [{"body": "Good or bad is relative, depending on who you compare with. lol", "score": 1, "replies": []}, {"body": "That use to buy you a pizza.", "score": -4, "replies": []}]}, {"body": "When I want honest thoughts on how American consumers are doing, I ask a CEO.\n\n~literally no one", "score": 6, "replies": []}, {"body": "I smoke 200 packs of cigarettes a day and about 400 more when the stock market causes my anxiety to run. Is that what they mean when they ask if I’m healthy?", "score": 6, "replies": [{"body": "Make sure it's Marlboro to pump my Altria bags", "score": 8, "replies": []}]}, {"body": "What’s the move", "score": 3, "replies": []}, {"body": "if you just keep saying everything and everyone is fine enough. it starts to feel like it’s perfectly alright to be poor and homeless.", "score": 3, "replies": []}, {"body": "Gentle reminder that everyone’s watching everything you’re doing", "score": 3, "replies": []}, {"body": "Yeah I'm ok", "score": 4, "replies": []}, {"body": "Bank of America???\n\nThe greatest news story of all time.  \n\nhttps://abcnews.go.com/Business/bank-america-florida-foreclosed-angry-homeowner-bofa/story?id=13775638", "score": 2, "replies": []}, {"body": "I have no choice but to leave my money in the bank going .001% interest with 20% inflation because the stock market is actually worse now.", "score": 2, "replies": []}, {"body": "At $450k a year as a lowly psychologist who does disability exams for veterans, economic downturns often bring out the masses. #goodforme. I'm so blessed to be able to, and choose to, work my ass off 7 days a week. My portfolio's hurtin', but the money coming in will DCA me down. Retirement is 20 years away, and if it is for you, too, this is buying time. \n\nProbably a fundamental flaw in my own style, but I never sell. I could have, and should have, months ago. But whatever I've got, I keep. Then focus on the DCA. I'm not an expert, I'm just a 38 year old who read all those Kiyosaki books when I was in high school, with 20 years of fantasy basketball as my foundation for stock experience. And, an avid reader in markets and theories. The best thing I could have done regarding my own trading, was to realize that psychologically, nearly every single stockmarket website out there from CNBC to Forbes to WSJ, beyond, is designed to use timing, dose, and tact, to produce mass waves while the 'experts' behind them do the opposite. These sites exist to further have you lose your money. \n\nStep 1. Do what Cramer doesn't\n\nStep 2. What's Pelosi up to? \n\nStep 3. If it takes you less than 5 minutes to read a stock article, it's not advice -- it's an advertisement, and you're the fish. \n\nStep 4. Listen to Warren Buffet on everything but Bitcoin", "score": 4, "replies": [{"body": "Nah, Listen to Warren Buffett on bitcoin. It's basically a pyramid scam one ban from being worthless.", "score": -5, "replies": [{"body": "Is that why BlackRock is buying cryptocurrency in partnership with Coinbase? Because BlackRock engages in pyramid schemes?\n\nhttps://www.bloomberg.com/news/articles/2022-08-04/blackrock-teams-up-with-coinbase-in-crypto-market-expansion", "score": 11, "replies": [{"body": "BlackRock engages in everything that can make money. \n\nThe point is that bitcoin don't have underlying value. US can someday ban it and its mostly worthless.", "score": 1, "replies": []}]}]}, {"body": "[Jim Cramer says bank stocks could be the new market leaders PUBLISHED MON, OCT 17](https://www.cnbc.com/amp/2022/10/17/jim-cramer-says-bank-stocks-could-be-the-new-market-leaders.html)", "score": -2, "replies": []}]}, {"body": "I listened to him speaking on Bloomberg about this and the whole time I’m thinking that he’s full of shit. There’s no way consumers are in good financial positions when their buying power is way down, their debt is increasing, and their cost of debt is skyrocketing.", "score": 3, "replies": []}, {"body": "Chinese owned Bank CCP 🇨🇳", "score": 0, "replies": []}, {"body": "With a consumer this strong still, does that give more runway for the fed to engineer a softer landing? \n\nPerhaps it adds to the stickiness of inflation?", "score": 0, "replies": []}, {"body": "Yep fine. Tell BOA to focus on their earnings please 😉", "score": 0, "replies": []}, {"body": "Idk do I need another taxxine?", "score": 0, "replies": []}, {"body": "Pshhhh", "score": 1, "replies": []}, {"body": "Yes. Honest comment", "score": 1, "replies": []}, {"body": "I'm healthy besides the syphilis and herpes I got from a hooker last week.", "score": 1, "replies": [{"body": "Couldn’t pass on the two for one, huh?", "score": 1, "replies": [{"body": "We traded i gave her my Chlamydia", "score": 2, "replies": []}]}]}, {"body": "My transaction volume is up but I’m not buying more.  If anything I’ve scaled back.  Inflation is killing my savings.", "score": 1, "replies": []}, {"body": "No, not healthy.. Covid... 🙄", "score": 1, "replies": []}, {"body": "I’m ducking dying over here", "score": 1, "replies": []}, {"body": "CEO: \"Trust me bro\"", "score": 1, "replies": []}, {"body": "Smart retail investors are just holding onto bags at this point, waiting to buy back in.", "score": 1, "replies": []}, {"body": "Sell everything", "score": 1, "replies": []}, {"body": "Financial industry is so disconnected from reality right now that they’re just reassuring themselves, they’ll be the ones that take the biggest hit from all this debt.", "score": 1, "replies": []}, {"body": "I’m a millennial born without generational wealth so nah I’ve never been healthy", "score": 1, "replies": []}, {"body": "Everybody is spending cause they are using credit and relying on credit debt to fuel it.", "score": 1, "replies": []}, {"body": "So many more people are living paycheck to paycheck now.", "score": 1, "replies": []}, {"body": "very healthy besides stocks killing me", "score": 1, "replies": []}, {"body": "No. Price of some basic commodities have tripled i price.", "score": 1, "replies": []}, {"body": "Yes I am very healthy.", "score": 1, "replies": []}, {"body": "This means that prices will remain inflated.", "score": 1, "replies": []}, {"body": "I wouldn’t say healthy. I would say “has more or less given up the idea of saving” so we’re buying the things people wait until retirement to do.", "score": 1, "replies": []}, {"body": "Guy makes millions per year, of course he thinks everyone is healthy, even though I consume the minimum to be alive", "score": 1, "replies": []}, {"body": "People use credit cards so for the banks it looks healthy but when it’s time to repay the debt it isn’t so great for the consumer. All sectors of life got very expensive, you go get stupid groceries, don’t really buy anything and  $100 is gone", "score": 1, "replies": []}, {"body": "No!", "score": 1, "replies": []}, {"body": "Hell no!", "score": 1, "replies": []}, {"body": "People with kids or pets or both are screwed.  Everything’s so expensive 😞", "score": 1, "replies": []}, {"body": "Doing absolutely fucking amazing. Tons of money to be made in this economy. Just takes communication and hard work.", "score": 1, "replies": []}]}
{"title": "The real reason behind the rally despite being in a recession", "selftext": "", "id": "y6s439", "created_utc": 1666054335.0, "score": 719, "upvote_ratio": 0.97, "num_comments": 93, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|4 days ago\n**Total Comments**|59|**Previous DD**|\n**Account Age**|4 days|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=y6s439)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=y6s439)", "score": 1, "replies": []}, {"body": "The Fed has figured out that they can pay down government debt and inflation by punishing futures and options gamblers!  \n\n\nTo all the put buyers from last week, thank you for your service in padding the crash", "score": 91, "replies": [{"body": "Hey realistically that’s one way to stop inflation! I mean who’s going to be out purchasing if they gamble all their money away", "score": 39, "replies": [{"body": "Kyle from Southpark will save us.", "score": 14, "replies": []}]}, {"body": "Guess who's loading the puts...(see friends of photo above]", "score": 4, "replies": []}, {"body": "hurry dog reach fly domineering tart spoon unused rustic support", "score": 6, "replies": [{"body": "Looks end of 2008 there was some window dressing and the real drop happened Jan-March. We don't have to make the same move, but it would make sense. But likely a retest of the lows before a bear market rally, maybe on good job data?", "score": 5, "replies": []}, {"body": "Thetagang says hi!", "score": 4, "replies": [{"body": "Brrrr, that was cold", "score": 1, "replies": []}]}, {"body": ">My put will print eventually.\n\nSaid every guy who lost money on puts ever.", "score": 12, "replies": [{"body": "Yup I say that all the time", "score": 3, "replies": []}]}, {"body": "Well, when you say 'eventually', you mean before December, which isn't that likely. But keep hoping!", "score": 2, "replies": []}, {"body": "November puts checking in. There is going to be  much thanks given and a merry Christmas!", "score": 1, "replies": []}]}, {"body": "It's not the Fed.  It's the Universities' Endowment managers.  They collaborate with each other to manipulate the market as the Endowments collectively have trillions in stocks.  These managers are highest salary paid employees in the US. 🤫", "score": 2, "replies": []}]}, {"body": "What a scam", "score": 85, "replies": [{"body": "This guy gets it!", "score": 32, "replies": []}, {"body": "[deleted]", "score": 19, "replies": [{"body": "Something something you are here VW chart.", "score": 23, "replies": [{"body": "![img](emote|t5_2th52|4887)", "score": 8, "replies": []}]}]}]}, {"body": "I can’t believe I have to explain a meme !? These aren’t facts people it’s a fucking meme! I have put options myself because it’s the logical play here since we’re in a recession. The joke is the coincidence that we have historically high retail investors betting against the market and all of a sudden the market rally’s. Will it continue to rally I don’t fucking know just like none of you “experts” think you know.", "score": 48, "replies": [{"body": "It will rally till everyone has bought calls.", "score": 48, "replies": [{"body": "I will buy calls today to take one for the team", "score": 14, "replies": [{"body": "RSI is pretty over bought at open. Be careful. Could dip a bit then recover.", "score": 3, "replies": []}, {"body": "I've got a bunch for 1-23 and a few 1-24\nCalls only go up right", "score": 1, "replies": []}]}, {"body": "Yes sir !", "score": 5, "replies": []}, {"body": "Shhhh, im selling those calls", "score": 4, "replies": []}]}, {"body": "It will be hilarious if we somehow rally to $400 by the end of the month by “good earnings” and fed pivot rumors from the media once again", "score": 17, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 5, "replies": []}, {"body": "Relax, they aren’t trying to pay the calls either.", "score": 5, "replies": []}]}, {"body": "we're not exactly in a recession yet", "score": -6, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "and? GDP alone is NOT an indication of recession. It needs to be combined with other indicators such unemployment, consumption, manufacturing, etc. Most of these are definitely diverging which makes most economists avoid saying we're in a recession. It is more accurate to say we're getting closer and closer to one than saying we're facing recession atm. \n\nAlso, over the decades, recessions have been getting shorter and shorter. By the time we can accurely identify one we're most likely out of it already.", "score": 1, "replies": []}]}]}]}, {"body": "![img](emote|t5_2th52|4260)", "score": 10, "replies": []}, {"body": "Can you believe they raise rates .75 like they fucking said they would!! This came out of nowhere!!! Sell fucking everything now sell sell sell!", "score": 41, "replies": [{"body": "The joke flew right over your head huh. Classic WSB", "score": 7, "replies": [{"body": "Do you get it? Explain please?  I want some full in-depth market analyst explanation type shit. Your wife will be fine as I fuck her while you write it up for me.", "score": -4, "replies": [{"body": "Bro there’s pictures and words just like the picture books you like so much or is that to complicated for you still ? Either you’re a giant Regard or you bought put options and you’re mad either way my response is ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": -3, "replies": [{"body": "No one will answer me this question yet today. The color “kiwi” is it brown or green?", "score": 5, "replies": [{"body": "Meme = haha.  Meme doesn’t = “depth market analyst explanation” Meme meant to be haha joke funny. Simple right ? WSB requires tags which my post has “Meme” 🤯 You = sad put buyer. Me = haha at you ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271) Is that good enough for you or are you just reflecting on your personal issues ? Hey man if someone is fucking your wife you should handle that privately not reflect your issues on Reddit", "score": 3, "replies": [{"body": "Or is it yellow?", "score": 0, "replies": [{"body": "My favorite crayon flavor is brown", "score": 2, "replies": [{"body": "Naw dog, you always go pink.", "score": -4, "replies": []}]}, {"body": "Green if you’re poor yellow if you’re rich.", "score": 1, "replies": []}]}]}, {"body": "Khaki", "score": 1, "replies": []}]}]}, {"body": "Dad, calm down. He’s not your real son, please come home.", "score": 1, "replies": []}]}]}, {"body": "Agreed. But is it priced in or people forget it?![img](emote|t5_2th52|4886)", "score": 5, "replies": [{"body": "Thought the last one priced in but they freaked out and Dow dropped 800 points.", "score": 6, "replies": [{"body": "Its priced in by smart money. Dumb money is dumb. I heard a guy in the parking lot talking to his wife. He was saying he hopes the FED doesnt raise rates anymore or it might cause a recession. Its like dude, Its not a question of IF its a question of whether is MORE than whats been promised. How could anyone be so clueless? \n\nLike thats the type of guy who is suprised to hear about a rate increase on the morning news, and since he views himself as economically clued up, he immediately goes over to the computer and cashes out his 401k. Because after all, his genius economic insight that any more rate increases will cause recession makes him smart and he thinks hes getting ahead of the game. When in reality, hes dumb money and totally reactionary. The market priced in the hike last week, but him and everyone like him causes SPY to flash crash 5%. The next two days it runs 3%. The dumb fucker sees markets ripping and goes back to the pc to put his money back in. He sold for a 5% loss and bought back in 5% higher. He lost 5% of his money and then bought back 5% less shares per dollar.", "score": 33, "replies": [{"body": "This is the way", "score": 11, "replies": [{"body": "Are you dumb ? You’re supposed to buy high and sell low !", "score": 3, "replies": [{"body": "Good to see veterans here", "score": 2, "replies": []}]}, {"body": "![img](emote|t5_2th52|4267) an the updoot", "score": 1, "replies": []}]}]}]}, {"body": "Schrodinger's market. If there is bad news then stonk go up cause it was priced in. If go down because retail hasn't bought puts.", "score": 1, "replies": []}]}, {"body": "What's the phrase? Buy the rumour, sell the news?", "score": 2, "replies": [{"body": "Happy Cake Day!", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "You’re right and the market should be bearish and it will be next week when everyone loses their put options", "score": 16, "replies": []}, {"body": "It's not. It a fake pump with short covering.", "score": 14, "replies": [{"body": "No it’s a meme ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "You sound like the regards when they were upset the market was booming even when covid cases were going up.  IT DOESN'T MATTER.", "score": 1, "replies": []}]}, {"body": "This rally does nothing but solidifying my belief  that as long as the market is green and businesses are hiring they are going to keep raising rates.", "score": 3, "replies": [{"body": "And then some.", "score": 1, "replies": []}]}, {"body": "😂money printer about to be turned on this week", "score": 7, "replies": [{"body": "And they’ll be turned right off as soon as retail investors buy call options ![img](emote|t5_2th52|4270)", "score": 9, "replies": [{"body": "That’s exactly how it goes haha retail always gets in last.", "score": 8, "replies": []}]}]}, {"body": "I think the theory that everybody selling puts last week at open caused the algos to start buying and caused the rally.  It makes sense.", "score": 2, "replies": []}, {"body": "Exactly.  \n\nThe entire economy is a ponzi scheme\n\nBuy crypto", "score": 2, "replies": []}, {"body": "Why would you buy put in peak fear?! ![img](emote|t5_2th52|4887)", "score": 2, "replies": []}, {"body": "I love this guy.  Kept rates low when homes were getting 50 offers.   Im screaming at my friends on the phone in summer of 2021,  Can anyone fukkkkin call the fed..lol", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}]}]}, {"body": "It’s not job feds job to lower stock prices dumb ass\n\nNow, go to yoga", "score": -1, "replies": [{"body": "Read and understand the meme first before you comment dumbass crayon muncher ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 0, "replies": [{"body": "Okay your not a dumbass, I’m just messing\n\n… here’s an honest thought: the media advertised the put contracts by pushing fear. Maybe it wasn’t the purchase of the contracts that may cause a rally. Rather, powers at be saw it coming and advertised a bad deal", "score": 1, "replies": [{"body": "Bro it’s a meme based on todays events. Absolutely everything that’s going on is pointing towards a bear market but it didn’t today which is why it’s funny. But the Fed does absolutely control stock prices. Just like the media and even WSB do as well. Maybe not directly but like you said the purchase of contracts might have caused this rally. I agree that’s a very likely possibility because we saw it happen Thursday.", "score": 0, "replies": []}]}, {"body": "Purchasing puts does place upward pressure on price and many things influence this complicated system.  This convos getting to deep for wsb and I haven’t had coffee yet… Good luck bro 🙏", "score": 1, "replies": []}]}]}, {"body": "PPT geared up for fking retail and cashing out judt at the top due to 'morale conflict'.", "score": 1, "replies": []}, {"body": "Retail buying puts, time to crush them into oblivion!", "score": 1, "replies": []}, {"body": "This won’t last long.", "score": 1, "replies": []}, {"body": "This isnt a goddamn meme. This is exactly what is happening.", "score": 1, "replies": []}, {"body": "Squozed", "score": 1, "replies": []}, {"body": "You know what's crazy about this whole thing? The elite running the programming to steal from everybody actually knows where retails money comes from so they can take it and do opposite. How easy it is to funnel money with a program. \n\nSad times", "score": 1, "replies": []}, {"body": "Please someone review the 08 charts", "score": 1, "replies": []}, {"body": "How about reason for the depression and the inevitable pull back that’s coming for housing", "score": 1, "replies": [{"body": "https://youtu.be/RfjT26dpuG0", "score": 1, "replies": [{"body": "[https://www.facebook.com/100031151227280/posts/pfbid02NDcce9ZS8MfuTCrWdoozcSYPv23p2ioQpWstkXqNU7cYgTH6G2emp5CUkJYnBMyXl/?mibextid=de0Fye](https://www.facebook.com/100031151227280/posts/pfbid02NDcce9ZS8MfuTCrWdoozcSYPv23p2ioQpWstkXqNU7cYgTH6G2emp5CUkJYnBMyXl/?mibextid=de0Fye)", "score": 1, "replies": []}]}]}, {"body": "Jokes on him I bought calls on inverse etfs\n….\n\n\nI’m fucked", "score": 1, "replies": []}, {"body": "It's so easy how to tell a top and bottom.\n\nWhen tons of retail are euphoric, buying calls,  posting like they are all on drugs, we've hit the top.\n\nWhen tons of retail are doom and gloom, buying puts, crowding the short trade, posting like they are withdrawing from drugs and they're sober or just stopped posting in general, we've hit the bottom.", "score": 1, "replies": []}, {"body": "My puts just keep rollin rollin rollin 😂😂", "score": 1, "replies": []}, {"body": "Y’all know people who actually looking at charts seeing a possible bottom are buying…. Who wants to sell for such a horrible loss… literally makes 100% perfect sense for buying to start outweigh selling", "score": 1, "replies": [{"body": "In the short term, ya. But I’ll let you in on a little secret: nobody here knows shit and if anyone does, they can come over and fuck my wife while I give them a back massage! 🫃🏼", "score": 2, "replies": [{"body": "I know ur mom", "score": 1, "replies": []}]}]}, {"body": "What if instead of us squeezing the SHFs the government squeezes everyone 🤯 The reverse  uno card might get pulled…", "score": 1, "replies": []}, {"body": "Lol I’ve been buying more stocks now than I’ve ever bought in the past. \n\nWe officially are not the same dumb animals these asshats are used to corralling with the same old tired scare tactics any longer.", "score": 1, "replies": [{"body": "Ah yes an investor which is a smart move but this is WSB home of the 0DTE", "score": 1, "replies": []}]}, {"body": "Daddy is gonna do it again. Watch they’ll raise rates like 10 precent tomorrow just because JPOW was feeling it", "score": 1, "replies": []}]}
