{"title": "My new Options Strategy, 9MDTE", "selftext": "[deleted]", "id": "18setj6", "created_utc": 1703720331.0, "score": 19, "upvote_ratio": 0.71, "num_comments": 44, "comments": [{"body": "Well just do the math. The stock is at 23.73. The atm calls are the 25 calls. The ones that expire 9m from now are 5.35. Now look at your return on those compared to your return on simply owning the stock. \n\nWe can do two different trades. The first is buying 100 shares for $2,373. The second is buying one call for $535. \n\nWith Rivian at $25 in 9m:\nStock trade return: 5.35%\nCall trade return: -100%\n\nWith Rivian at $30 in 9m:\nStock trade return: 26.42%\nCall trade return: -6.54%\n\nWith Rivian at $35 in 9m:\nStock trade return: 47.49%\nCall trade return: 86.92%\n\nThe actual crossover price of Rivian where the call provides a better return on investment than owning the shares is right around $32.25. That means that you are actually getting a worse return on investment until Rivian shares go up 36% in 9 months at which point the calls finally become the better investment. \n\n…so I guess it depends how much you think Rivian is really going to go up in the next 9 months.", "score": 49, "replies": [{"body": "[deleted]", "score": -9, "replies": [{"body": "These are payoffs at 9 months based on basic options math. My only point in showing those was to show you that the call doesn’t provide a better return than owning shares until the stock has appreciated roughly 35%. That’s a large large move for 9 months. So the only way this strategy works is if IV comes down a ton before you buy or RIVN consistently rallies 40% per year. I agree with you, it’s certainly not safer than buy and hold and almost certainly if backtested provides a much worse return over time.", "score": 13, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "It 100% was luck. Your entire thesis is \"I see a lot of rivians where I live\" so you went long a call. The dte doesn't really matter at all. You've just given yourself extra time for it to go up is all. In a bull market like we've been seeing, this would work on almost anything.", "score": 11, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Right, but no one knows when a bullmarket ends or starts..\n\nIt'd be a good idea to set profit targets and stop losses. Then this becomes more of a systematic strategy.", "score": 4, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "What kind of crystal ball do you have that you were able to predict that a new bull market would happen exactly 6 months ago?\n\n(Btw, a bull market didn't begin 6 months ago. The market crashed in October. You probably would've panicked and sold your calls for a loss if you timed it incorrectly and bought your calls in July or August.)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Right.. maybe I didn’t make myself clear. I’m not saying whether or not it’s a good trade. I’m saying unless Rivian is going to go up on average by 35% every 9 months it’s a worse trade than buying shares. That’s all.", "score": 6, "replies": []}]}]}, {"body": "Buying unhedged, OTM or ATM call options is probably the dumbest trade a person can make.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I repeat, simply buying an OTM/ATM call, even if it's several months out, without any sort of hedge (whether it's a short call, a put, or a put debit spread) is probably the stupidest trade a person can make.\n\nThat's probably because it's the simplest trade that any person without a sophisticated knowledge or understanding of how options work can make.", "score": 1, "replies": []}]}]}]}, {"body": "Great response.\n\nIf RIVN goes up, the smart move for OP would be to sell a higher strike and move into a spread. But, doesn’t sound like he has even considered that.\n\nIt’s a volatile stock with bad fundamentals and is trading at a lofty multiple to the industry.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "If you’re doing spreads, esp an ATM call spread, you want close expirations as the higher strike call will always have residual premium. Hence, you won’t be able to close it for max profit unless the legs deltas are equal (deep itm).\n\nMy argument was that if you’re buying an ATM option 9m out, you’re clearly bullish on the stock. So, if RIVN appreciates in the short-term, you should move into a spread to minimize your risk. \n\nThe only thing that 9m or leaps gives you is a higher probability of going ITM. You’re really betting on the stock going up 45-50% with long calls, otherwise, just buy shares.", "score": 1, "replies": []}]}]}, {"body": "Bro u/memclean deleted his whole account because RIVN tanked.\n\nEveryone thinks they got the options game all figured out after one successful trade (in this case, it wasn't even a successful trade, because his calls tanked at the end).", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "\"Buy low, sell high\" isn't a strategy, bro. It's what everybody is trying to do. You can't time the market.\n\nAlso, RIVN is garbage.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "\"More people lose money with options\"\n\nYeah, including you.\n\n\"Not really going to try with RIVN anymore\"\n\nWhat happened to taking a \"long-term approach,\" bro? You're going to give up on a company just because of a short-term move to the downside? Doesn't sound like you're sticking to your long-term strategy. According to you, this dip is a good buying opportunity, right?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "When I first got on the buying side of options I was always doing short expirations.\n\nUnless you are a WSB regard, I've come to realize that you should only buy options with far expiration dates.\n\n95% of losses on long options have to do with poor entrance timing. When you are buying options in the general trend of the market, you can reduce 70% of your risk by far dating your expirations.", "score": 10, "replies": [{"body": "im almost able to live off 2wte>, paying more for more time isnt reducing risk, its actually increasing it and your forced into a longer term thesis", "score": 2, "replies": [{"body": "Im not saying it's the ONLY way, but I feel it would work better for most people.\n\nIt's not about having a longer-term thesis.\n\nIt's about getting around the whole \"timing the market\" thing. Poor timing is the reason why at least 50% of long options go to 0.", "score": 2, "replies": []}]}]}, {"body": "i lost 80K in 3 years now up 200% also got my 80 yams back. Thank god", "score": 8, "replies": []}, {"body": "I like the idea. Sometimes the simplest ideas work the best in my experience, when combined with adequate intuition (for example, your Rivian play was based off of your own lived experience seeing Tesla go from small startup to major player). I wouldn’t call this an entire strategy - but it is an interesting “rule of thumb” that I will keep in mind when I’m trying to figure out how to execute one of my longer term plays. I like the idea of picking 9M because it is 3 quarters.", "score": 4, "replies": []}, {"body": "If you want to buy that call and also have a hedge in case Rivian does not go up by 35% in 9 months, you can buy the call and then sell short dated calls above your long call to finance the cost of the long. You may end up making profit just from those short calls expiring worthless.", "score": 4, "replies": []}, {"body": "you might start by learning what \"DTE\" means ... *days* to expiration", "score": 3, "replies": []}, {"body": "You know that the D in DTE stands for days, right?", "score": 3, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "270dte is more clear", "score": 6, "replies": []}, {"body": "I feel like you could write 9 MTE then. I just read 9MDTE and it makes my brain hurt. But not trying to be rude.", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "We have Saturday (February 25th, 26665) expirations now?", "score": 1, "replies": []}]}]}]}, {"body": "I regularly use monthday as a unit of measure. \n\nI was just telling my girlfriend it's our 480day annual-versery", "score": 1, "replies": []}]}, {"body": "Even with a 9-month DTE, your calls are going to be bleeding value in theta on a daily basis. For instance, if you buy the 25C expiring in September of 2024 and hold onto it for 30 days, and RIVN stock doesn't move, you're going to lose $36, or 6% of the total value of your calls, due to time decay alone. In two months, you'll lose $73, or 13% of your total investment. That's not taking into consideration any changes in IV. If RIVN dumps, then you're going to lose money even faster. Time is always working against you when you're holding long options.", "score": 2, "replies": []}, {"body": "I like LEAPS, but watch out with liquidity it s often not much traded. Nobody says you need to keep until the 9 months is over. If you re happy with the potential profit after 3 months you can sell", "score": 2, "replies": []}, {"body": "I know a few people who work at Rivian and they are all smart, together,good people. They like the company too. (it's not run by Musk). \n I hope this isn't insider info. I can't imagine that it is.", "score": 1, "replies": []}, {"body": ">I don't know why I chose 9 months, I felt that most of the time, the stock makes an upward trend in 9 months even if it dips a bit\n\nThis is the primary issue. Strike selection and expiry are arguably the two most important components to an options trade. Not knowing why you've picked either one or both is almost guaranteed to be an unsustainable approach. Sounds like your losing streak will continue unless you address the underlying issue, which is a lack of evidence-based trade theses. Since this is an options subreddit, I'm only going to address the actual trade here, not the underlying fundamentals (although I could probably write several paragraphs on that too, since your bullishness on Rivian also seems extremely anecdotal, not based on empirical metrics).\n\nIn general, long-dated, long call trades are high-conviction trades for several reasons. As others have mentioned, the stock has to exceed your ATM strike by a great deal in order to make the premium worth it. In addition, vols on RIVN are already pretty damn high. Now that I look at the term structure, it looks like the 9-month expiry (Sept '24) options are roughly 90% IV (as opposed to ~75% on most other expiries), making them the worst possible options to buy on the term structure. The optionality of buying shorter dated calls and rolling them out seems much more attractive on face value. \n\nThe argument for long calls instead of long stock also boil down to a couple basic principles: capital efficiency/leverage and/or perceived mispricings. Long-dated deep OTM calls express high conviction. Long-dated deep ITM calls express a desire for capital efficiency but still a decent conviction. Long-dated ATM calls express uncertainty, and IMO don't really have any place in an intelligent portfolio. Sure, it might be nice to not have to look at your portfolio, but at what cost? I'll answer for you, it's a financial cost.\n\nThe theta cost of long-dated ATM options is very real. Especially on high-vol stocks. To me, it seems like your strike and expiry was very impulsive and random. I don't mean to make this personal, but from the context of the OP,  I'm going to guess you're an SWE at a tech firm? Regardless, I'd suggest staying away from options until you have a little more knowledge of options pricing theory and applied trading knowledge. It's nothing to be ashamed of, we all start somewhere.\n\nTL;DR: 9 months is way too long, you're likely better off buying the stock, using ITM calls, or using shorter-dated calls.", "score": 1, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Lmao", "score": 0, "replies": []}]}]}, {"body": "> lost 10k over five years, which is still a win if I consider it as a cost of learning.\n\nalso known as \"losing\"", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "It sounds like you still have a severe lack of understanding of options, if you think \"rolling a long-dated call option\" is considered a sound, sophisticated, or viable options \"strategy.\"", "score": 0, "replies": []}]}]}, {"body": "TLDR, skipped to end and saw “Dont know why I chose 9 months…”. “What do you think..”. \nYeah no, do your own thinking buddy.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "TLDR", "score": 1, "replies": []}]}]}, {"body": "Good strategy to keep your cost lower. \n\nWhat about buying the stock, selling the atm money calls for 9 months out, then taking that money and buying a higher strike price for the same time period?", "score": 1, "replies": []}, {"body": "9 months days", "score": 1, "replies": []}, {"body": "Buy the best stocks and they go up is a brilliant idea!", "score": 1, "replies": []}, {"body": "I’m an old day trader from the late 90’s when stocks were listed in fractions….35 1/2, 20 1/8, 6 7/8, etc. day trading was easy back then and extremely lucrative. Then they changed the rules. Made it much harder. I quit doing it. But I learned here about buying calls ITM. Not deep and not for long term. Today as a practice run I bought 10 options on SQ, $3 ITM. Expiring tomorrow. Bought them at $2.62 and sold them 15 minutes later at $3.12. That’s a $500 profit in 15 minutes. Felt very close to my old day trading days. Exciting and lucrative. $500 a day times 5 days is $2500 a week. I believe that works!!! Lol! But seriously, $100, $200 a day is pretty easy. You need to work this on top tech stocks. They’re the ones that are constantly on the rise, multi millions of shares traded daily, as well as thousands of calls. Do your homework. Do a trial trade or two with no money. Get the feel of it. Handle the adrenaline rush of quick trading. Lol! Good luck!", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I’ll check it out. I worked nights for 30+ years and am now retired. I forget people have jobs and can’t sit all day in front of the laptop. My bad.", "score": 2, "replies": []}]}, {"body": "Update…..Did a practice trade, no money, on SQ yesterday. Made $500 in 15 minutes. Did a real trade this morning just maybe 20 seconds after the open. I was ready to buy 10 call options on AMD for $4.40 strike at $145. Conditions need to be right….Market on the upswing and stock on the upswing. Bingo. Hit the trade to buy. Within 2 minutes at most, I sold for $5.42. Pow Bang Zoom! Profit $1006.34 after transaction fees. Most importantly? I walked away after the trade.", "score": 1, "replies": []}]}, {"body": "\nI have been in a little trouble since yesterday  and would really appreciate it if any of you could please help me out. \nI have bought 129 call options of googl for 0.31/contract at the strike price of 142 with expiration on December 29, 2023, i.e.. today. Its that the contract is OTM with the current price of.09-0.1. The 143 strike call option with the same expiry is selling at 0.3. I am currently in loss of more than 2k. \nI need your advice on whether should I close the option at the open and book the loss or write the 143 call option to cover some cost and do nothing till expiry. Please help me out. Thanks", "score": 1, "replies": [{"body": "It appears the option has expired.  \n\nIn the future, exit from a position you have doubts about.", "score": 1, "replies": []}]}, {"body": "One year out or more is even better, since if you hold for longer than a year, you get the longer term capital gains tax benefits.", "score": 1, "replies": []}, {"body": "This bro u/memclean deleted his whole account because RIVN tanked, lol.", "score": 1, "replies": []}]}
{"title": "Why the market doesn't like YOU (CLEAR) stock?", "selftext": "Hey everyone,\n\nI'm comparing two stocks side by side YOU(https://www.clearme.com/) and DUOL (https://www.duolingo.com/) and I'm puzzled by the fact that despite having higher revenue and net income YOU has a valuation of 3.2B while DUOL has a valuation of 9.2B?\n\nNeither of them is a pure \"tech\" company like META or GOOG which would explain a higher multiple.\nI'm considering investing because I'm using both apps, however I'm puzzled by 3x difference in valuation.", "id": "18roind", "created_utc": 1703641592.0, "score": 53, "upvote_ratio": 0.76, "num_comments": 60, "comments": [{"body": "privacy concerns and, as a result, regulation, would be the biggest risks, in my opinion. would also worry about data leaks. one big leak and they’ll lose consumer confidence. their partners would drop them quick too.\n\nthey’ve already hit problems with airports; iirc earlier this year their add-on tsa product was pulled after people without clear were able to sneak through the clear line.", "score": 58, "replies": [{"body": "100% there is no level of convenience that would make me interested in giving away fingerprint, eye and facial scans to a private company that are not stored on hardware locally.", "score": 37, "replies": [{"body": "More and more international flights take facial scans at the gate prior to boarding. It’s fucked up, but they will find ways to get everybody’s biometrics eventually.", "score": 2, "replies": []}]}, {"body": "So I have clear, and none of these are concerns to me. Privacy, to be frank, it’s been stolen so many times already, what IS privacy anymore anyway. My health insurance was hacked FFS. \n\nWhat sucks for me is, the service isn’t fast anymore. It kinda sucks now.", "score": 18, "replies": [{"body": "It’s way too high touch. I don’t need or want to interact with a person so heavily every time I’m going through line. It’s annoying and it’s the bottleneck in so many cases.", "score": 6, "replies": [{"body": "The point for me is speed. If it saves me 5-10 mins, so I can get to the lounge and have food faster than that guy over there. Fine. I’ll take it. But when it’s slower and I have to wait for the guy to scan my dick and balls, cmon.", "score": 7, "replies": [{"body": "this is my problem with these kinds of products. usa border patrol has an app that’s supposed to get you through airport immigration faster by preloading your info, and they scan it passport control. last time i used it, they shuffled me onto a super long line as i watched non-american tourists het through the line faster than me with my super duper preferential american with the app line.\n\nbasically, these apps/tech products rarely work out the stay they’re intended (to save time).", "score": 1, "replies": [{"body": "So I also have Global Entry, that service is amazing. I just came home from Barbados, walked right in", "score": 1, "replies": [{"body": "i'm not talking about global entry.", "score": 1, "replies": []}]}]}]}]}, {"body": "Just wait until Clear+ Advantage rolls out, then you’ll be fine", "score": 8, "replies": [{"body": "Idk man, I’m not paying more to watch the pre-check line move faster. If AMEX didn’t pay for this, I’d cancel. They some how made it slower with this new finger print thing they’re doing now too.", "score": 6, "replies": []}]}]}]}, {"body": "In addition to the other concerns, I’d be curious as to how heavily Clear’s revenue is juiced by credit card partners. Personally I would not have Clear if AmEx wasn’t paying for it. They’re probably reimbursing AmEx quite a bit, and there’s also a limit to how much they can charge.", "score": 37, "replies": [{"body": "Same, but I've gotten it for free through purchases on Samsung devices, they'll run a promo for 12-18 months for free through the Samsung Members app.", "score": 3, "replies": []}]}, {"body": "I had a terrible experience using CLEAR.  Immediately cancelled that shit after the first attempt.", "score": 24, "replies": [{"body": "It's a line cutting service. If the tsa line isn't busy, it's a waste of money. Also, a lot of people who have it get it subsidized through Amex Platinum.", "score": 16, "replies": []}, {"body": "It hardly saves time if you don’t also have TSA pre-check. The only people who use clear are getting it for free with Amex or another source.", "score": 9, "replies": [{"body": "Yea I was mad late to Newark cause of repeated accidents on the GSP and the lady pushing it was like “yea 5 min sign up and you go to the front of the line.”  Did the deal and waited in a short line and then got to my turn and got tossed out for unknown reasons.  Started over in the regular line and made my flight by like 5 minutes.  At least the lady who promised I’d get through got to see me get tossed.", "score": 13, "replies": []}, {"body": "Although I have Clear, I didn't use it on my last two flights. One had a longer line than simply TSA Pre.", "score": 6, "replies": []}]}, {"body": "I like it and have never had an issue. I also have TSA-pre check. Just trying to show another opinion. I have no doubt that CLEAR can suck, just haven't experienced that myself... yet lol.", "score": 3, "replies": [{"body": "Yea I’m certain it works 99.99% of the time.  I’m just not ready to forgive them yet lol.", "score": 5, "replies": []}]}]}, {"body": "If the government decides CLEAR doesn’t have a place in our airports, then their business is completely fucked.  Negative sentiment is [growing](https://slate.com/business/2023/12/clear-lines-airports-tsa-congress.html)", "score": 25, "replies": []}, {"body": "TSA prechek is superior most of the time.", "score": 19, "replies": []}, {"body": "Regulation concerns and growth opportunities likely. For most people, precheck is sufficient. I interviewed with them years ago. They were trying to be the vendor for stuff like arena security. Instead of scanning tickets, scan your palm and go in. Hasn’t worked out anywhere major as far as I can see so I’m not sure how well they’re executing on that strategy or if they’ve pivoted.", "score": 4, "replies": [{"body": "I’ve used them to enter a sports arena so it works for me as a consumer, not sure how much it contributes to profits though.", "score": 3, "replies": []}]}, {"body": "Because most people who invest have been in an airport recently and most of those people realize clear is kinda stupid (if you wanna be technical, it lacks a clear value proposition over the entrenched, market leading competitor)", "score": 15, "replies": [{"body": "Lol indeed", "score": 2, "replies": []}]}, {"body": "I’ve had my eye on this stock. Must be a concern around most and the idea that regulations can change at any moment. I’ve personally liked the stock fundamentally but hadn’t added yet. Thanks for reminding me.", "score": 4, "replies": []}, {"body": "Not something I would pay for. Had a free trial for a year during covid so it was useless. Now I have tsa pre so it doesn’t really matter. Recently got an email to reactivate for free for 3 months didn’t even bother doing it until I’m in a pre tsa line but it wasn’t even that bad", "score": 8, "replies": []}, {"body": "I like using CLEAR especially with TSA Precheck. The challenge I have is the amount of people needed to run the process. I also think CLEAR is impacted as business travel is still down (courtesy Zoom) and there is a concern about travel slowing once the post Covid travel binge in over", "score": 6, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Btw it’s always 1 clear rep per family, unless multiple reps are free and want to help you parallelise. Multiple times experienced this at Seatac.", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Depends from agent to agent. Was it busy when you arrived?", "score": 1, "replies": []}]}]}]}, {"body": "Dude im amazed clear is even publicly traded, did not know that company was actually profitable.", "score": 3, "replies": []}, {"body": "SEA airport checking in - it's a service aimed at solving a problem that does not exist.\n\nIt's aimed at frequent fliers. Frequent fliers prefer to get TSA-pre, which overall is a lot faster than Clear, coz shoes on, laptop in.\n\nSEA has Spot-Saver. Without pre, on a general ticket, I can actually get to the TSA agent faster than Clear. Then there are premium Frequent Flier lanes. \n\nHave you seen the literal boatload of people during summer here? You will need 200+ Clear agents to move a line that size at reasonable speed. Again, TSA-pre is much faster.\n\nIn its current form, it's a non scaleable solution. Whatever money they make is by selling data.", "score": 6, "replies": [{"body": "Additionally, the TSA is trialing digital ID and touchless ID solutions which removes any tech / operational advantage they can currently claim over official government solutions.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": []}, {"body": "Clear has little growth propsects", "score": 5, "replies": []}, {"body": "It’s dumb AF and doesn’t need to exist. We have TSA pre-check. That’s all we need", "score": 7, "replies": []}, {"body": "Clear is horrific. Watch Tim Dillon’s rant on it lol", "score": 5, "replies": [{"body": "I can't find it on YouTube, got a link?", "score": 1, "replies": []}]}, {"body": "Anecdotal but in the five times I’ve dealt with security lines during various trips, my TSA+ (and on occasion, regular lines) were as fast or faster than Clear. That doesn’t speak well for the service. Let’s not even factor in the scanning tech doesn’t work very well.", "score": 4, "replies": []}, {"body": "Simply put it’s a nice to have product, not must have.", "score": 2, "replies": []}, {"body": "Never really understood the point of getting clear when you could just have precheck", "score": 2, "replies": []}, {"body": "Clear is worthless at LAX. Entertaining to see all the people who have it get in line for it over TSA pre even though the clear line is longer though", "score": 2, "replies": []}, {"body": "I legit just hate the concept and the company; they have no reason to exist and I don’t invest in companies I loathe.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "A couple of my credit cards offer free Clear and I still don’t see the value over the TSA Precheck that I already have.  My credit card also pays for Precheck, so I don’t see any reason to have Clear.", "score": 3, "replies": [{"body": "Skipping to the front of the TSA precheck line is a nice perk of Clear. It’s not always a time saver, but it’s probably saved me a few hours of standing in lines this year", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "They have a moat at the airports. I think Amazon will eat their lunch if they try to make it mainstream. Amazon has palm.", "score": 4, "replies": []}]}, {"body": "What do their real and financial assets and liabilities look like?", "score": 1, "replies": []}, {"body": "It's a good question.  \n\nMy understanding is they do airports and stadiums, both of which have been booming for the last couple of years while YOU has done nothing.", "score": 1, "replies": []}, {"body": "You just point something interesting in stock market and stock analysis. The price does not mean the true valuation of a company but what the investor are willing to give to purchase. Honestly, I'll not go for YOU as it's really overpriced and does not show great strength (right now) - have a look here for figures : [http://platform.marketadvisor.io/ticker/DUOL](http://platform.marketadvisor.io/ticker/DUOL)\n\nAbout Duolinguo, I assume the difference is explained by popularity of this app. But once again, it's market valuation and could be wrong. For me this one is a bet as well, app is fun but it does not make good money right now to be a solid investment", "score": 1, "replies": []}, {"body": "I actually just canceled clear after seeing this post because the precheck line is always faster in Atlanta and New Orleans.    So it defeats the purpose of having it", "score": 1, "replies": []}, {"body": "Clear has become a terrible product. People complain that it’s not any faster than pre, in fact it’s often slower.", "score": 1, "replies": []}, {"body": "TSA precheck beats clear a large majority of the time", "score": 1, "replies": []}, {"body": "I’m confused on why you’re confused? Why are you comparing the two stocks? One is an app for learning, that app is downloaded on a cell phone which almost everybody has. The other is a paid service for people who fly often. There’s obviously going to be a lot more people who don’t use Clear. This seems obvious to me.", "score": 1, "replies": []}, {"body": "Clear has predatory sign up stations in some airports that give you 14 days to cancel. But also let you cancel well after that if you just contact customer service. Their numbers are inflated.", "score": 1, "replies": []}, {"body": "DUOL has much higher cash from operations, higher fcf, and more consistent revenue & financials. With companies making big reinvestments, which is usually shown in net earnings (which are negative for both) you really can’t use net income as a basis for value/growth because it is being skewed by the mass amounts of reinvestments which count as expenses -> net income loss.", "score": 1, "replies": []}, {"body": "I swear any stock I buy into never gains, but the ones I sell to buy another always go up. I am cursed. So if your stock nose dives it's probably my fault for buying into it 😆", "score": 1, "replies": []}]}
{"title": "$KO outperforms half of the Mag 7 in 2024 because of $NVO and $LLY", "selftext": "I have not opened any positions quite yet as I continue my DD. Opening position on 1/2/24.\n\nWith the incredible 2023 performance of the Mag7 and Mega caps, it would be naive to think this same growth will be the case next year. The AI paradigm shift is being priced in all aspects required to build its infrastructure. Machinery in AMAT and ASML, chips rising rapidly (literally pick anyone in SMH) or major software companies including cybersecurity. This shift of a new world economy and society is just the beginning of further change.\n\nThe other major shift concurrently taking place on consumers and it could likely happen much quicker. $KO is going to be a strong growth stock for the next 3 years (I would argue potential of over 200% growth over this time).\n\nWhy, you ask? Fairlife protein shakes. It is being consistently reported by $LLY and $NVO in their research. There is clear and growing importance to pairing with Ozempic, Wegovy, Mounjaro, and Zepbound. The consensus is that with a lack of craving for \"more\", nutrition is being obtained through these high protein and vitamin shakes with Fairlife. The difference here is the most crucial piece though- they are significantly better tasting and enjoyed for the value and nutrition (according to almost anyone/any forum/ LLY and NVO data). It could be predicted the average diabetic/weight loss patient is likely to be purchasing these for meal replacement. \n\nIf you review  r/Costco posting in regards to this trend, you will find them constantly sold out. Individuals and employees state they are getting as many of the 18 cases as they can. Others have noted the price of such increasing from 27$ to 35$ per 18 pack in a 6-month span. \n\nIf we just use the most recent data from Goldman Sachs projecting 5 Million patient users, who could expectedly drink one of these Fairlife shakes per day, (Note: Goldman expectation is JUST for Mounjaro), $KO Market cap can expect to grow 10.9% up to $286 Bln. However, this assumes a stagnant PE ratio at current \\~23 level. If there is any further growth expectations from investors, or sustainable forward/current PE levels; $KO could be a top performer in the next 3 years, especially compared with Large Value peers. Additionally, if any form of insurance coverage supports these new drugs, there would likely be a neon swan event that could propel $KO near $800Bln-$1Trln market cap over the 3-5 years.\n\nUpdate: it will cost you 61$ and 3 weeks to get an 18 pack of Fairlife\n\n[Just some more dd for your enjoyment.](https://imgur.com/a/bE62Tt6)\n", "id": "18s0nri", "created_utc": 1703683577.0, "score": 44, "upvote_ratio": 0.78, "num_comments": 71, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|4 years ago\n**Total Comments**|8|**Previous Best DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: -Mag7 and Mega cap companies will continue to grow in the next year as the AI paradigm shift is priced in.", "score": 1, "replies": []}, {"body": "KO revenue was 45 billion. Fairlife made up to 200 million of that. You might wanna rethink your DD 🦍🦍🦍🦍", "score": 72, "replies": [{"body": "I already have.", "score": 32, "replies": [{"body": "Why was this hilarious?", "score": 5, "replies": []}]}, {"body": "Not sure where you are deriving that number- in fact I believe the most recent figure available had them exceeding 1 Bln in revenue in 2022, prior to my base case. I think the biggest tell is the MASSIVE re-measurement. Based on the agreement when they purchased, this can only mean Fairlife is exceeding expectations by a significant margin.", "score": 5, "replies": [{"body": "I was on the fence but writing MASSIVE in all caps changed my mind", "score": 28, "replies": [{"body": "Go look at the 2020 q1 acquisition, and the most recent quarterly re-measurement of almost $1 bln. That is fairly abnormal even with higher inflationary periods. KO has also committed to an exclusive $650 mln plant. I don't think they just plan on milking cows there.\n\nVery glad you are on board with my caps because you must not read enough quarterlies to properly value the delta between that new valuation and inflation.", "score": 2, "replies": []}]}]}, {"body": "RemindMe! 1 year", "score": 2, "replies": []}, {"body": "Additionally in less than a year (2022) fair life increased whatever number you have as .04% to 2.2% of revenue. Again- if you have invested long enough that’s traction in a segment that wasn’t there before entering an healthcare “industry” that is also new.", "score": 2, "replies": []}]}, {"body": "Interesting DD thanks for sharing. \n\nDo you think uptick in sales of the Fairlife products may backfill any slump they see from the newfound health conscious consumers across the sugary drink segment?", "score": 10, "replies": [{"body": "Their most recent quarterly didn't specify the numbers, but said that the Fairlife brands offset losses in the sports drink/juice category.", "score": 4, "replies": []}]}, {"body": ">I agree that $KO is a strong growth stock for the next few years. I think they are well positioned to benefit from the trends you mentioned. I also like their products and think they taste great. Thanks for sharing your thoughts on this company!", "score": 9, "replies": [{"body": "It is definitely not a growth stock but a large value with much more upside than peers classified the same, not in tech.", "score": 3, "replies": [{"body": "This guy trying to win multiple arguments with VM. Lol", "score": 2, "replies": [{"body": "Gotta teach bots/ai somehow", "score": 2, "replies": []}]}]}, {"body": "Yawn", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "When everything is ATH maybe I am just trying to find some deep fucking value and a blossoming segment of our consumer preferences.", "score": 4, "replies": []}]}, {"body": "Bro this shit is real. LLY and Novo are going to paradigm shift the entire market as we know it and these cucks will buy in AFTER the run", "score": 6, "replies": [{"body": "This guy gets it- you must really know your stuff😜", "score": -1, "replies": []}]}, {"body": "Bought 20 shares, don’t mind sitting on this forever", "score": 5, "replies": [{"body": "It’s not sexy but it sure as hell makes sense imo", "score": 3, "replies": []}]}, {"body": "i've been reading about these fairlife shakes, had no idea they were owned by KO. This is great dd. Hilarious that you're getting shat on OP which makes me think you might actually be right. This sub is allergic to good dd. Thanks for writing this up\n\nremind me! one year", "score": 13, "replies": [{"body": "His DD is \"Ozempic and Wegovy will make Fairlife go up\"... which is fucking regarded. Fairlife is like 1% of Coke, and the 99% is... guess what...? Coke.\n\nUsing the same thesis, Ozempic and Wegovy make Fairlife go up, and concurrently make Coke go down. Awesome... there's a catalyst that will increase revenue from 1% of our business segments while the other 99% crash!", "score": 2, "replies": [{"body": "COIN has gone up coz of 2 reasons\n\n1) reg clarity around crypto. But with more of this wont more exchanges enter ? SQ HOOD alrdy encroaching\n\n2) Being custodian of all the btc etfs which if they hit 20bil aum at 1% management fee would be 200mil which is 10% of their 2bil ttm\n\nPerceptions r never logical, if a new one runs in while another narrative is in control, market can rly go wild", "score": 1, "replies": [{"body": "So you're regarded as well, got it.", "score": 1, "replies": []}]}]}, {"body": "I will be messaging you in 1 year on [**2024-12-27 15:32:18 UTC**](http://www.wolframalpha.com/input/?i=2024-12-27%2015:32:18%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/18s0nri/ko_outperforms_half_of_the_mag_7_in_2024_because/kf4s0g2/?context=3)\n\n[**4 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F18s0nri%2Fko_outperforms_half_of_the_mag_7_in_2024_because%2Fkf4s0g2%2F%5D%0A%0ARemindMe%21%202024-12-27%2015%3A32%3A18%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2018s0nri)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Wait till you see $COKE", "score": 4, "replies": [{"body": "I love bottling", "score": 6, "replies": []}, {"body": "_Jim Cramer enters the chat_", "score": 3, "replies": []}]}, {"body": "I’m not reading all this logical shit. Someone tell me, am I buying calls or puts?", "score": 5, "replies": [{"body": "KO $75C leaps '25", "score": 3, "replies": []}]}, {"body": "You do realize that ozempic and the rest of these fat burners will eat into the softdrink revenue? If those fatties aren’t drinking coke anymore, revenue goes down. Plus ozempic is 1000$ a shot, I doubt that 5mln people will pay that (or insurances for that matter).", "score": 4, "replies": [{"body": "As of Nov 8th there were already 5 million Americans on Mounjaro and zepbound with 50 mln expectation by 2025 because of the massive Lilly sales push and mainstream prescription distribution. We’re literally at the tip of the iceberg with all of this. \nPrivate insurers have negotiated pricing to 25$ for 1 month supply \nIf/when Medicare Medicaid negotiates with states on PBM- something that is drastically changing nationwide already for reduced pricing( see California blue shield axe CVS monopoly for pbm pricing)- it is very likely we could see 100-150mln people on it considering 40-50% of Americans are diabetic or obese. Happy to answer any further arguments/questions\n\nOh and- soft drink sales have been unaffected so far in recent history. Americans have been reducing soda by a lot for 10 years now ( I think it’s like 30-40%)but this is the best bear case. However, because the reduction from the weight loss drugs in soda consumption is percentages is somewhat significant individually, but 55% of the soda revenue at KO is from syrup, one can derive the businesses that are coke affiliated will take at least a good chunk of this loss early on.", "score": 2, "replies": [{"body": "This. \n\nThese drugs are going to dominate the landscape over the next 5 - 10 years. And everything to do with them.\n\nCheck out WW. They bought a telemedicine service and their new CEO is going on tour telling everyone that being fat isn't their fault.  You have to get your GLP-1 from somewhere. They've got the brand name and the marketing. For $99 a month they get you set up with the drugs, meal plans, follow up etc. \n\nIf they execute on this they'll be huge (pun intended) again.", "score": 3, "replies": []}, {"body": "Do you have a paper or source to back up those numbers (5 mln on glp-1 drugs)?\nIf so you are correct and we are in execution mode already.", "score": 2, "replies": [{"body": "I am still trying to find it I didn’t save it but I’ll post when I do. It wasn’t the “hardest” data but conceptually it should be applicable.", "score": 2, "replies": []}]}]}]}, {"body": "Unless, Fairlife pulls ala $CELH, it won't affect the profitability of $KO by much because it's over 250 billion market cap company...what am I missing?", "score": 3, "replies": [{"body": "The correlation in the medium-to-long term effect with the major weight loss drugs and consumer habits is hard to ignore when you break it down. It could possibly enhance further speculation from investors with an unknown growth potential that is truly unquantifiable if their PE can climb higher, most likely tied to enhanced EPS going forward. KO has made a very conscious decision to play a large part in the future of standard of health and medicine. And again- the biggest kicker will come when insurance hops on board. I am comfortable without the uncertainty of celh vs justifiable growth potential in a staple mega cap.", "score": 2, "replies": [{"body": "Yea but if people buy more of Fairlife products, they will buy less of the rest of $KO unhealthy products which will cannibalize their own top line?", "score": 1, "replies": [{"body": "It is a good point and time will tell, though revenue on sodas wasn't necessarily the problem more recently (it has been in water and sports drinks). It absolutely seems to an advantage that wasn't nearly as important as before in the LIlly world we are heading into.", "score": 1, "replies": [{"body": "Even on the weight loss drugs ppl will still slam down Coke Zero. If the liked it before they can have even more of it now.", "score": 4, "replies": []}]}]}]}, {"body": "What you're missing is that $KO is a much larger company than $CELH, so even if Fairlife does pull out of its partnership with Coca-Cola, it won't have as big of an impact on the latter's bottom line.", "score": 1, "replies": [{"body": "Regarded VM, that's exactly what I am saying...no reason to long $KO.", "score": 0, "replies": []}, {"body": "I am aware of these mkt caps which is why I ran those numbers to show the growth and potential expectations to give an idea what an impact this can be even for a company a large as KO. Fairlife is fully owned by KO and is clearly a correlative play with the trends we could see going forward. \n\nI am not even trying to compare celh because it's hardly comparable to this discussion, other than it is up a ton and I enjoy it. Doesn't play into the point I am trying to make here, even though it has impressive gains.", "score": 1, "replies": []}]}]}, {"body": "I love this, cuz, I already own $KO so it makes me think I'm already smart, and also cuz I recently started buying $WW.\n\nI've heard that you should invest in what you see and I see a lot of fat ppl. Cuz of that I've been buying LLY, NVO, WW. And now more ko!!!", "score": 3, "replies": []}, {"body": "Are you saying $KO is gonna grow 200% more from here? LMAO\n\n#Delulu", "score": 3, "replies": [{"body": "I think it is absolutely possible in these 3-5 years, mostly predicated on insurance making the right long term move for themselves and longer term health- it’s a very symbiotic situation for them to negotiate and cover these. I would not be surprised if we see 100-150 mln Americans on these drugs going forward. All of the math is pointing to it..", "score": 2, "replies": []}]}, {"body": "What percentage of sales is Fairlife proton shakes compared to rest of business?", "score": 3, "replies": [{"body": "Negligible", "score": 11, "replies": [{"body": "Where else would it start? I'll be an early adopter of the future any day.", "score": 3, "replies": [{"body": "I would agree it's early to judge and as someone that works out, Fairlife Protein shakes are the cheapest per gram of protein, have less sugar yet still tastes good", "score": 4, "replies": [{"body": "Easily available too. When in doubt I can go to the nearest gas station and pick one up", "score": 3, "replies": [{"body": "And it's the one healthy alternative at a gas station if you're in hurry after a trip to the gym\n\n...and they taste good", "score": 2, "replies": []}, {"body": "Actually this is becoming an issue- if you buy more than one. See update to post and I’ll add the screenshots.", "score": 2, "replies": [{"body": "Fack", "score": 3, "replies": [{"body": "Check update", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Fairlife Proton Shakes: Gives you the power to neutralise the negative asshats in your life.", "score": 2, "replies": []}]}, {"body": "I outperformed your dad on your mom yesterday doesn't mean I move in now and it keeps happening ![img](emote|t5_2th52|4275)", "score": 4, "replies": [{"body": "KO hasn't outperformed anyone in growth lately? hence the value and new revenue argument(?)", "score": 1, "replies": [{"body": "idk the only one that is KO is your mom after yesterday ![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}]}, {"body": "Yawn calls on WW", "score": 2, "replies": [{"body": "Do it I would love to watch (weight).", "score": 2, "replies": []}]}, {"body": "Note: FatJams data is incorrect as we only have a most recent data point of $1Bln surpassed in 2022 and the $KO 2023 Q3 10Q does not break this down specifically.", "score": 2, "replies": []}, {"body": "Read something along these lines about a month ago. Take a look at $BRBR (premier protein). The wsj wrote an article on this, i would say the price is already factored in.", "score": 2, "replies": [{"body": "Brbr price or ko?", "score": 0, "replies": []}]}, {"body": "my DD confirms: $KO go up.\n\nhttps://preview.redd.it/uo5yt7qrux8c1.png?width=1053&format=png&auto=webp&s=c0eceb3dbfbe6a5ef6259b2db03e27e54bb1c079", "score": 2, "replies": [{"body": "Duh past performance always", "score": 1, "replies": []}]}, {"body": "*Magnificent 7*\n\n*MSFT  +56% YTD*  \nAMZN  +79% YTD  \nMETA  +187% YTD  \nAAPL +54% YTD  \nGOOGL +57% YTD  \nNVDA +245% YTD  \nTSLA  +142% YTD  \n\n\nKO -7% YTD\n\nI don't think they have to worry about being outperformed by KO next year.", "score": 2, "replies": [{"body": "WOAH! You’re a genius! Past performance is always indicative of future results! Great insight!\n\nPs: I said half of them so 3-4", "score": 6, "replies": []}]}, {"body": "If KO goes bankrupt it means America is dead \n\nTime to buy more shares", "score": 1, "replies": []}, {"body": "As an avid drinker of protien shakes, I have never heard of fairlife :( I don’t believe but I do want to see positions", "score": 1, "replies": []}]}
{"title": "Tesla Software Engineer Mauled By Robot At Texas Factory", "selftext": "[removed]", "id": "18se557", "created_utc": 1703718614.0, "score": 82, "upvote_ratio": 0.71, "num_comments": 69, "comments": [{"body": "This is entertaining business news, but it is not *trading* related. The stock did not move based on this news and was stable around the time it came out.\n\nWhile this thread may be a great discussion for other communities, it is unfortunately off topic for a trading community like r/WallStreetBets, so I have removed it.\n\nBut please feel free to continue the conversation in the comments!\n\nFor posterity, here is the link to the news article OP posted:\n\nhttps://www.yahoo.com/entertainment/tesla-software-engineer-mauled-robot-194516729.html\n\nThanks for visiting WSB and happy holidays!", "score": 1, "replies": []}, {"body": "Clickbait title; it's just a typical accident that tends to happen in major machinery factories.\n\nBut..... I am wondering why a Software Engineer is so close to powered on machinery like this.", "score": 94, "replies": [{"body": "He thought the 3 arms he was working near were turned off, but the one was still on by mistake. \n\nArticle also says Tesla took 2 million Teslas off the road which never happened. It is a fantasy article. When the story is boring, make stuff up to make people click on the article.", "score": 25, "replies": [{"body": "The employee clearly did not follow any form of a lockout tagout procedure. ‘Thinking’ your machine is powered down is how you get killed. Any engineer worth a fuck knows this. Any system designed worth a fuck and to a RIA standard wouldn’t allow for this unless someone bypassed the safeties.", "score": 7, "replies": [{"body": "I wouldn’t be surprised if the Tesla plants are OSHA nightmares", "score": 6, "replies": [{"body": "They are.", "score": 4, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I know you are but what am I?", "score": 1, "replies": []}]}]}, {"body": "Yeah! They even have special machines custom ordered without the fail safes and shit!!!!  \n\n\nThey really should just be writing articles when they can go a day without the machines killing employees. It's basically a slaughter house over there!!!!", "score": -1, "replies": [{"body": "So true, bestie ❤️", "score": 1, "replies": []}]}]}, {"body": "It doesn't even need to be lockout tagout, I'm guessing some interlock was over ridden to get that close under power. Like maybe an LPO over ride while in the cage?", "score": 1, "replies": []}]}, {"body": "It’s probably an AI generated article", "score": 2, "replies": []}, {"body": "People keep getting really hung up on the use of the word recall. Yes, Teslas were recalled. They fixed it with an OTA software update. There is no lie there. That is just what the term is legally called. It’s not a conspired attack on Tesla, despite whatever twitter is saying.", "score": 2, "replies": []}, {"body": "There was recently a recall of 2,000,000 vehicles. I guess that’s not exactly the same as taking the cars off the road….  https://apnews.com/article/tesla-autopilot-recall-fix-software-9a9bd6fea76a564f417788f1430d5166", "score": -1, "replies": []}]}, {"body": "Cuz Elon said no remote work ![img](emote|t5_2th52|31226)", "score": 3, "replies": []}, {"body": "I reckon they were a hardware engineer", "score": 2, "replies": []}, {"body": "If the numbers in that report regarding their OSHA reportables are truly 1 in 21, that is not indicative of a factory that gives a single fuck about safety. That’s absurd, and I’ve been all over this globe in many industries. That’s like 1890s coal mine numbers.", "score": 4, "replies": []}, {"body": "Pretty simple, somebody has to program extremely precise robots that do welding adhesive application etc...\n\nIt's a lot easier to do that close to the machine, than it is from a remote office somewhere..\n\nAll that being said. Mainstream media has been attacking musk and his companies lately, because musk is critical of the government.... Was there even any accident at all?\n\nIt's hard to tell now, most of the articles are blatant lies and usually turn out to be totally fabricated", "score": -5, "replies": [{"body": "He's not going to sleep with you.", "score": 6, "replies": [{"body": "But your wife is all of ours", "score": 3, "replies": []}]}, {"body": "Doing robotic touchups in a modern factory means you’re working inside guarding and running with a manual control teach pendant. Any time your fence circuit is broken, manual control is all you have. Pretty much any industrial robot built in the last 20 years is limited under manual control to 250mm/sec of motion max, and that drops proportionally depending on the speed override percentage you’re running at. On top of that, the robot is constantly monitoring torque on each servo and if it gets over a certain value it senses collision and emergency stops itself. This value can generally be modified up and down through a program depending on the operation you’re doing (might want it more sensitive placing something delicate or less sensitive when using a collision skip to apply a label or something). All of this is occurring through a teach pendant that utilizes a three position switch to allow motion. Open, nothing. Middle position, jog. Fully closed (think how you tense up when something scares you), stop motion.\n\nBack in the way back, you could order robots that had a full speed teach mode. I’d be stunned if that was the case anymore (I don’t do welding, which is a more speed dependent process. Packaging, palletizing, material handling, vision inspection is my game)\n\nSounds to me like the dude bypassed a fence circuit, which realistically isn’t that hard on a hardwire safety circuit, and can be a bit more of a pain on a safety over Ethernet system, but doable. Regardless, deliberate effort is necessary. \n\nHe probably deserved it.", "score": 4, "replies": [{"body": "it Was reported that when the model 3 lines were being set up at Fremont musk ordered collision shut downs to be removed because it wouldn’t hurt that much if you got hit in the head by the equipment.  Nothing points to him having gotten more sane and respectful of safety since.", "score": 1, "replies": []}]}, {"body": "It’s not because Musk is critical of government. He’s an ass hole. I meet them daily.", "score": 3, "replies": []}, {"body": "Unionist politicians like to pretend that Tesla doesn't exist, which is upsetting to Elon... understandably... He led and it matters. ;)", "score": -1, "replies": [{"body": "No it was  Marry Barra 😂 lol", "score": 0, "replies": []}]}, {"body": "The shareholders are sure out on high alert defending their interests ever since that Reuters article. Or maybe it was after 2 Senators have spoken up about the issue.", "score": 0, "replies": []}]}, {"body": "It’s probably a former Twitter engineer who’s working 90 hours a week and guzzling Elon’s cum", "score": -6, "replies": []}, {"body": "Because you need to run your code on the equipment to see that it works.", "score": 1, "replies": []}, {"body": "Terminator confirmed!!!!!!!!!!!", "score": 1, "replies": []}]}, {"body": "Nothing has made me lose trust in journalism faster than Tesla articles.", "score": 18, "replies": [{"body": "Exactly.   Words like mauled, attack, and assault are very misleading in this case.  This is not journalism. Yahoo should retract and fire author.", "score": 1, "replies": []}]}, {"body": "A worker injured by a piece of equipment that wasn't properly powered down and didn't even miss any work. Why is this a news story?", "score": 20, "replies": [{"body": "Because it happened at Tesla", "score": 9, "replies": []}, {"body": "Didn’t you read the title? This wasnt a simple injury, he was mauled", "score": 3, "replies": [{"body": "Read the entire article. The employee missed no time from work. Doesn't sound serious, sounds more like hyperbolic language used to obscure the facts.", "score": 1, "replies": []}]}, {"body": "People love to shit on Tesla and Elon", "score": 2, "replies": []}]}, {"body": "Lock out tag out, kids", "score": 5, "replies": [{"body": "I have seen engineers work there. They think they are above the laws of physics.", "score": 2, "replies": [{"body": "Real engineers are the biggest safety advocates, because they fully understand what the system or equipment is capable of.", "score": 2, "replies": [{"body": "I’ve seen some enter a 480 volt cabinet to troubleshoot it live. They got in a talking to but they should have been fired according to policy.", "score": 1, "replies": [{"body": "Sometimes you need power to identify issues, but physically touching 480 components without PPE is definitely a no-go. \n\nNewer panels have segmented enclosures with high voltage items physically separated. A control transformer sets the voltage down and chops it to 24V DC which supplies the control/fieldbus equipment. The low voltage side is typically pretty safe to work in.\n\nI work on equipment with 12x1\" THK solid copper bus bars - 4180VAC for electric arc furnaces. You better believe I put two locks on that switchgear disconnect lmao\n\nPeople are cowboys sometimes. Does a \"whoopsies\" result in you getting a shock, or your face getting melted by 30,000F arc plasma? Some people can differentiate, unfortunately. \n\nWeird subreddit to talk about this on, at any rate lol", "score": 3, "replies": [{"body": "I am trying to get into engineering myself. I understand what you mean. But there were some I have worked with that did some questionable stuff. I agree it is weird to talk about it here. I won’t touch 480 without PPE they were standing inside the panel because they were a bit short and were looking around.", "score": 2, "replies": [{"body": "Look into a controls technician if you are interested - I don't know if you are a student or have been in industry for a while.\n\nJim Pytel on YouTube has good electrical/controls stuff.\n\nI am a ChemE by degree, but do a lot of process control/design - so I need to have good electrical competency as well. All metallurgical process equipment. EAF's, Vacuum arc furnaces, electro-slag furnaces, induction skull melting, coreless induction melt furnaces, investment casting furnaces. You name it - if melts metal I've worked on it.\n\nSeen some scary and dangerous stuff - tell people how stuff really is when it isn't safe. \n\nFind what you like and make a career out of it.", "score": 2, "replies": [{"body": "I am making my way into controls. I am picking up coding. I have been a maintenance/engineer technician in the recent jobs.", "score": 1, "replies": []}]}]}, {"body": "Well, I, for one, would NEVER hope you get hit by a bus.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Gus bus", "score": 1, "replies": [{"body": "Well, I, for one, would NEVER hope you get hit by a bus.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Did Oliver Stone write that article?", "score": 6, "replies": []}, {"body": "Ok who let visualmod get a job at Tesla", "score": 4, "replies": [{"body": "There you go. The one funny comment in here.", "score": 0, "replies": []}]}, {"body": "Don’t they have the Three Laws of Robotics??", "score": 2, "replies": []}, {"body": "I’m more interested in the 1 in 21 worker injury rate. I wonder how that compares with other manufacturers.", "score": 2, "replies": [{"body": "Fortunately that can be answered by reading the next sentence of the article.\n\n Injury reports submitted to the US Occupational Safety and Health Administration alleged that nearly one out of every 21 workers at the [Giga Texas factory got hurt last year.](https://nypost.com/2022/03/24/teslas-new-texas-factory-is-throwing-a-party-and-locals-arent-happy/)\n\nIn the automotive industry, the median injury rate last year was one in every 30 workers.", "score": 2, "replies": [{"body": "Jesus Christ I need a vacation. Thank you.", "score": 2, "replies": []}]}]}, {"body": "As someone that works with industrial robots the language used in this article is fucking hilarious", "score": 3, "replies": []}, {"body": "\"...Despite the severity of the injury, he did not take time off from work...\". ![gif](emote|free_emotes_pack|dizzy_face)", "score": 3, "replies": [{"body": "He did, however, use a month of vacation days immediately following.", "score": 3, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 year ago\n**Total Comments**|35|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 0, "replies": []}, {"body": "The first casualty of the Great War to come…god help us all.", "score": 0, "replies": []}, {"body": "We all thought Google was gonna become Skynet, but maybe it’s Tesla 😬", "score": 1, "replies": []}, {"body": "No disassemble.", "score": 1, "replies": []}, {"body": "i remember when i got mauled by a car when i forget to set it in park.  \n\n\nor i got mauled by a lightbulb when it fell.  \n\n\nThis title and article suck, its literally just an assembly line accident.", "score": 1, "replies": []}, {"body": "Mauled? Robots don't \"maul\".", "score": 1, "replies": []}, {"body": "In **2021**. Wonder why it's just getting posted by the entertainment networks now ?", "score": 1, "replies": []}, {"body": "To shreds you say?\n\nTsk tsk.", "score": 1, "replies": []}, {"body": "It’s happening!!", "score": 1, "replies": []}, {"body": "rObOtS aTtAcK \n\nBears and wishful thinking. Musk coming up on Trump levels of hate in the media", "score": 1, "replies": []}, {"body": "Lol, to people saying Elon Isn't being targeted by the media..... This story is over a year old, the worker resumed his duties the next day, the worker entered an area he wasn't supposed to. It wasnt an \"Optimus bot\" it was a stupid arm robot that doesn't see, or think.\n\nIn a previous time, news outlets could be sued for spewing fake BS like this", "score": 1, "replies": []}]}
{"title": "Soaring 20s?", "selftext": "Welcome fellow regards, today I bring to you my highly regarded prediction/opinion. I believe we are currently reliving the 1920s and are doomed for the great depression in the next decade, let me explain why\n\n**1. Economic Growth: Unprecedented Booms and Ominous Shadows**\n\n- **1920s:** Known as the Roaring Twenties, the decade was marked by robust post-war optimism, rapid industrial growth, and technological innovation, leading to significant wealth creation. The GDP soared, consumer culture blossomed, and the stock market became a national pastime. However, this unchecked exuberance, coupled with speculative investments and widespread use of margin buying, set the stage for the 1929 crash. The period was characterized by notable economic disparity, with the rich getting exponentially richer, while the working class saw minimal gains.\n  \n- **2020s:** Emerging from the global crisis of a pandemic, the 2020s have seen a strong market rebound, driven by technological advancements in digital infrastructure, healthcare, and green energy. Stimmy packages and government spending have injected liquidity into the economy, attempting to stave off recessionary pressures. However, this has also led to concerns about inflationary pressures, asset bubbles in various sectors, especially real estate and tech, and the long-term implications of increased national debt. The wealth gap continues to be a significant issue, with the pandemic exacerbating economic inequalities.\n\n**2. Technological Transformations and Their Economic Impacts**\n\n- **1920s:** The decade witnessed the widespread adoption of automobiles, radio, and cinema. These technologies revolutionized daily life and economic structures, contributing to massive industrial growth and urbanization. This era also saw the birth of consumer credit, allowing more people to purchase these new technologies, further fueling economic growth. However, the rapid industrialization and lack of regulatory oversight eventually led to overproduction and unsustainable economic practices.\n  \n- **2020s:** This decade is marked by the rise of artificial intelligence, biotechnology, renewable energy, and a continued boom in digital commerce. The technology sector has become a significant part of the economy, with companies like Apple, Amazon, and Google dominating market capitalization charts. However, this rapid growth has led to concerns about overvaluation, particularly as the pandemic accelerated the shift towards digital solutions. Additionally, issues like data privacy, cybersecurity, and the ethical implications of AI are becoming increasingly prominent, posing new regulatory and economic challenges.\n\n**3. Consumer Behavior: From Enthusiasm to Caution**\n\n- **1920s:** The era saw a significant shift in consumer behavior with the advent of mass production and advertising. The availability of credit made it easier for consumers to purchase goods, leading to an increase in consumer debt. The stock market became a symbol of the American Dream, with many individuals investing their life savings, often leveraged, in the hopes of striking it rich.\n  \n- **2020s:** Consumer behavior has seen a shift towards digital platforms, with e-commerce and online services becoming the norm, accelerated by the pandemic's restrictions. There's been a noticeable increase in retail trading, partly fueled by the democratization of financial markets through technology, but also as a result of stimulus checks and increased savings during lockdown periods. This period has also seen a rise in \"meme stocks\" driven by social media, reflecting a new era of speculative investment and community-driven market movements.\n\n**4. Wealth Disparity: A Persistent Echo**\n\n- **1920s:** The decade was marked by a significant wealth gap. The prosperity of the era was not evenly distributed, with a majority of the wealth concentrated in the hands of a few. This economic disparity was one of the underlying issues that led to the market crash and subsequent Great Depression.\n  \n- **2020s:** Despite technological advancements and economic growth, income and wealth inequality remain pressing issues. The pandemic has disproportionately affected lower-income individuals and small businesses, while many in the tech and finance sectors have seen substantial gains. The growing disconnect between stock market performance and the real economy is causing concern about the sustainability of current economic policies and the potential for social unrest.\n\n**5. Government Response: Lessons Learned or Repeated?**\n\n- **1920s:** The initial government response to economic issues was minimal, reflecting the era's laissez-faire attitude. However, following the stock market crash and the onset of the Great Depression, there was a significant shift towards more active government intervention in the economy under Franklin D. Roosevelt's New Deal.\n  \n- **2020s:** Governments worldwide have taken a more proactive approach to managing economic crises, with significant stimulus measures and monetary policy interventions aimed at stabilizing and stimulating the economy. Central banks have implemented policies like quantitative easing and low interest rates to encourage borrowing and investment. However, these policies have also led to concerns about their long-term effects, including potential asset bubbles and increased national debt.\n\n**Conclusion:**\n\nInsane debt, wild inequality, and shaky economic fixes? Sounds like a recipe for a historic faceplant. So, party on, but remember, every rocket eventually comes back down. Trade smart, ’cause no one wants to be left holding the bag when the bubble bursts! 🤓 Calls all decade!", "id": "18sf62y", "created_utc": 1703721217.0, "score": 47, "upvote_ratio": 0.71, "num_comments": 65, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|2 days ago\n**Total Comments**|24|**Previous Best DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/18riqyq/aurora_innovation_aur_analysis_autonomys_next/) [x](https://www.reddit.com/r/wallstreetbets/comments/18sf62y/soaring_20s/) \n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: We are currently reliving the 1920s and are doomed for the great depression in the next decade. The main similarities between the two periods are: economic growth, technological advancement, consumer behavior, wealth disparity, and government response. The main difference is that the 2020s have seen a more proactive government response to economic issues.", "score": 1, "replies": []}, {"body": "Can't wait for some of that deflation that shows up at the end of the 20s so I can afford some Wendy's again.", "score": 49, "replies": [{"body": "Will I see you behind the dumpster?", "score": 6, "replies": []}]}, {"body": "Bet you can't do the 1820s..... nerd", "score": 51, "replies": [{"body": "Erm…\n\nhttps://en.m.wikipedia.org/wiki/Panic_of_1825", "score": 29, "replies": [{"body": "> speculative investments in Latin America, including the imaginary country of Poyais.\n\nWe never change, do we?", "score": 30, "replies": [{"body": "Imaginary investments? That’s what we do best here!", "score": 9, "replies": [{"body": "Lemme talk to you about this NFT made from a photo of my junk...", "score": 11, "replies": [{"body": "You sonofabitch, I’m in.", "score": 6, "replies": []}, {"body": "Make it your gf’s junk and I’m\nIn", "score": 2, "replies": []}]}]}, {"body": "Same way of working on different technology", "score": 1, "replies": []}, {"body": "Two speculations make a right?", "score": 1, "replies": []}]}]}]}, {"body": "Ok so buy puts in 12 years. Adding to my calendar now.", "score": 14, "replies": [{"body": "Exactly, all calls until 2029 😎😎😎", "score": 3, "replies": []}]}, {"body": "After what we’ve seen over the past decade, you honestly believe the powers at be will ever allow a depression again? Yeah you definitely belong here.", "score": 8, "replies": [{"body": "A depression takes from everyone and gives to the wealthiest. Ofc it's in their best interest to create one, so they can buy everything even cheaper. Duuuuh.", "score": 3, "replies": []}]}, {"body": "and weirdly, don't forget the 1918-1920 worldwide Spanish Flu that killed 25-50 million people world wide, almost 100 years before our own global pandemic.", "score": 28, "replies": [{"body": "[deleted]", "score": -12, "replies": [{"body": "Yeah let's act like 15 million people dying from a pandemic in modern times is no big deal", "score": 13, "replies": [{"body": "A bit misleading. That 15 million number is \"deaths associated with COVID-19\" so take that as you will. Nonetheless, given how incredibly unhealthy our society is that's actually not terrible.", "score": 7, "replies": []}, {"body": "World wide it 15M probably barely affects the global economy.", "score": 8, "replies": []}]}, {"body": "Pretty sure the symptoms ~~and your resentment~~ are the least relevant parts of the comparison being made.…\n\nEdit: wonder if u/PriceZombie will unblock me now", "score": 2, "replies": []}, {"body": "Yeah, now that Covid is officially over, it’s only killing 1000 people a week in the US.", "score": -5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They don’t respond well to anything that isn’t a big media narrative", "score": 5, "replies": []}, {"body": "Nobody, cares.", "score": 0, "replies": []}]}]}]}]}, {"body": "Ah, another Great Depression post 🦧", "score": 5, "replies": []}, {"body": "Can you imagine how difficult it was for the Fed to get an accurate inflation reading in 1920?", "score": 5, "replies": [{"body": "It was probably quite difficult.", "score": 2, "replies": []}]}, {"body": "*Note to reader, while reading this mini novella, use your Halloween villain voice, with a manic vibe, and cackle between paragraphs.*\n\nHistory doesn’t repeat itself exactly as before,\nIt’s like the tide,\nIt has a rhythm,\nSometimes it’s high,\nSometimes it’s low.\n\nWhat you need to realise..\n\nEvery living thing evolves to kill, and if it doesn’t kill it gets killed. Ask yourself this question, is the stock market alive?\n\nBy all definitions of life it meets the criteria of a living organism.\nIt feeds,\nIt grows when it’s happy,\nIt shrinks when it’s in pain,\nYou can kill it, but\nIt reproduces itself time and time again in different places,\n\nAnd since it’s alive well…\n\nNature finds a way, to evolve, and we’ve been feeding it human lives since its inception. Through historical slavery to modern day sweatshops, what makes you think it wants to change its diet of flesh and oil now that it’s part of its fundamental existence.\n\nThe next evolution is when Artificial intelligence will replace the bankers and the traders. Then it will feed itself on the money of retail investors and the poor. Algorithm by algorithm learning, evolving, killing.\n\nWe have created our own overlords, and there’s nothing we could have done to prevent it. \n\nSo… on that happy note, let’s make some money. Merry Christmas.", "score": 11, "replies": [{"body": "Dude, wtf?", "score": 5, "replies": [{"body": "Hey I just asked ChatGPT to give me a reasonable and rational response to the OPs post. \nWhat’s wrong?", "score": 3, "replies": [{"body": "If it is an actual ChatGPT response, RUN!", "score": 2, "replies": []}]}]}, {"body": "https://en.m.wikipedia.org/wiki/Industrial_Society_and_Its_Future\n\nYou should read Ted’s Manifesto…", "score": 1, "replies": []}]}, {"body": "The key component that doesn't really exist this time is a banking crisis that started in Europe (because of Germany and war debts) and then spread around the world.", "score": 6, "replies": [{"body": "Foreshadowing", "score": 8, "replies": []}, {"body": "Did you already forget the banks that failed and the fed's response to it?!?!", "score": 7, "replies": [{"body": "Are you referring to 2008?\n\nIIRC, banks actually paid back their loan plus interest so the government actually came out far ahead.", "score": -1, "replies": [{"body": "No, literally this year", "score": 7, "replies": [{"body": "OH you mean the very small pussy ass banks? Like the 3-4 of them?", "score": -2, "replies": [{"body": "The fed had to set up the btfp for them and they werent all small man whatre you talking about", "score": 7, "replies": []}]}]}]}]}, {"body": "Russia?\nChina?\nUnited States?\nBelgium?\n\nAll are indebting themselves by warring or funding wars.", "score": 2, "replies": [{"body": "What war is China currently fighting or funding?", "score": 3, "replies": []}]}]}, {"body": "Debt gets too high, risk premiums rise, debt gets more expensive and unwinds misallocated capital which we see as a deep recession.  Hayek was right.", "score": 5, "replies": []}, {"body": "You bears are so fucking tedious man", "score": 6, "replies": []}, {"body": "Which will all lead to world war 3", "score": 4, "replies": [{"body": "Na well probably hit that in the 20s", "score": 0, "replies": []}]}, {"body": "OP is an absolute clown.", "score": 4, "replies": []}, {"body": "We're in the fourth turning", "score": 2, "replies": []}, {"body": "Jinxed it", "score": 2, "replies": []}, {"body": "Lmao", "score": 2, "replies": []}, {"body": "Many word hard read late night \n\nUp or down regard?", "score": 2, "replies": []}, {"body": "So stay all in markets and sell before 2030. Got it", "score": 2, "replies": []}, {"body": "I've also wondered this.  Are we literally just going to mirror the 1900s.  Are we gonna be able to kick the can 6 more years before the crash?", "score": 2, "replies": []}, {"body": "We have central banks now to bail is out.", "score": 4, "replies": [{"body": "Ummmm..  FED started 1913.", "score": 9, "replies": []}]}, {"body": ">I agree that the current situation bears many similarities to the 1920s, and believe we are heading for another major economic downturn. The key difference is that this time around, governments are much more active in their responses to crises, which may help to mitigate some of the worst effects. However, given the unprecedented nature of this pandemic and the resulting economic fallout, it's impossible to say for sure what will happen in the coming years.", "score": 3, "replies": [{"body": "Drawing parallels between the current situation and the 1920s, there’s a potential for a significant economic downturn. In virtual economies like RuneScape, government intervention may influence in-game dynamics. Roblox might experience shifts in developer engagement and transactions. Decentraland’s virtual real estate markets and decentralized finance could be impacted. Predicting outcomes is challenging due to the unique nature of the pandemic and its economic fallout.", "score": 0, "replies": []}]}, {"body": "Nice comparison. I’ll keep my eyes open", "score": 1, "replies": []}, {"body": "Ok so go buy puts", "score": 0, "replies": [{"body": "Last sentence", "score": 1, "replies": []}]}, {"body": "I mean if it's a space rocket, just make it so it'll get out if earth gravitational hold and then the rocket never has to come back down to earth.", "score": 1, "replies": []}, {"body": "Awww, but must inverse because now that we know history we’re not doomed to repeat it", "score": 1, "replies": []}, {"body": "2020s: politicians use social media and count their number of followers.  This level of regardation should not be underestimated.  The people in charge are too regarded to fail.", "score": 1, "replies": []}, {"body": "No, no, no!  It's entirely different.. the roaring 20's were brought on because the central bank dropped interest rates and did what was called 'Quantitative Easing'.. this caused assets to rise stratospherically and lots of ppl thought they were getting rich misallocating their capital into asset bubbles.  Then!  The central bank tightened monetary policy, raised interest rates and drained all the excess capital out of the system.  This caused asset bubbles to pop, no wealth was realized to pay off debt and that debt deflated plummeting prices across the board.\n\nNothing like what we're experiencing today.. nothing at all.", "score": 1, "replies": []}, {"body": "1920: no computer to print trillions of dollars and manipulate the stock market. No electronic devices. No alphabet soup federal reserve sneaky ponzi programs.\n\n**2020s: All fiat money is fake and can easily be created out of thin air to the tune of trillions. Interest rates can also be lowered to 0% in the span of weeks during any signs of deflation. Federal reserve running ponzi scheme with a balance sheet of +7 trillion dollars.**", "score": 1, "replies": []}]}
