{"title": "Forbes’ picks for 2021, and which ones we should pick", "selftext": "Forbes released their stock picks for 2021 and wanted to see which ones y’all may be heavily considering. I put a dollar sign next to the ones I’m personally interested in and may look into buying.\n\nIll link the article so you can read it for yourself, but thought it would be beneficial to share and discuss on a reddit post. This subreddit has made me a lot of money in 2020, so here’s my attempt at giving back for 2021.\n\n*Entertainment*\n\nPLAY - Dave and Busters  \n$ LYV - Live Nation Entertainment  \nSIX - Six Flags\n\n*Restaurants*\n\n$ QSR - Restaurant Brands International  \nSHAK - Shake Shack  \n$ SBUX - Starbucks  \nUSFD - US Foods\n\n*Furniture*\n\nAAN - Aaron’s Furniture  \nBIG - Big Lots  \nCROX - Croc’s  \n$ LOW - Lowe’s\n\n*Energy*\n\nFANG - Diamondback Energy  \nPXD - Pioneer Natural Resources  \n$ PLUG - Plug Power (Have PLUG in ICLR index)  \nWMB - Williams Companies\n\n*Healthcare*\n\nHRC - Hill Rom  \nBDX - Becton, Dickson & Co.  \nBAX - Baxter International\n\n*Tech*\n\nBABA - Alibaba Group  \nDELL - Dell  \nSHOP - Shopify  \nSONO - Sonos\n\n*Industrial*\n\nFDX - FedEx  \nUPS - UPS  \nAAL - American Airlines  \n$ DAL - Delta (owned)  \n$ LUV - Southwest\n\n[Forbes article, written on Dec 15, 2020](https://www.forbes.com/advisor/investing/best-stocks-2021/)", "id": "kf12bb", "created_utc": 1608223841.0, "score": 82, "upvote_ratio": 0.95, "num_comments": 73, "comments": [{"body": "Here are my picks:\n\nSquare, Cloudflare, Microsoft, AMD, NVDIA, Sea limited, Fastly, Nio, Palantir, ICLN, Draftkings, Disney and Alibaba.", "score": 87, "replies": [{"body": "Square’s earnings are going to beat in a ridiculous way next quarter with their DoorDash shares flying up and with Bitcoin ripping.\n\nReally like SE and BABA too and I’d throw in some PINS and CRWD for good measure.", "score": 25, "replies": []}, {"body": "My portfolio basically the same: \n\nThe Trade Desk\n\nFastly\n\nPalantir\n\nDraftKings\n\nNIO\n\nMicrosoft\n\nSquare\n\nThe only one I don't have money in is Square but only because I decided to double down on Palantir.", "score": 9, "replies": []}, {"body": "Got in on Square, Microsoft and Disney earlier this year. New to investing. Had been wanting to purchase those for a while and finally just decided to hop in. Glad I did.", "score": 8, "replies": []}, {"body": "sq will cut into half, giving away free money to get users t use cash app is not gonna be sustainable.", "score": 2, "replies": [{"body": "I tend to agree, but it worked for PayPal", "score": 4, "replies": []}]}, {"body": "Is now a good time to buy Palantir?", "score": 1, "replies": []}]}, {"body": "Dell as a tech pick??? I wonder what they’ve got cooking in the kitchen.  Stock hasn’t done much in a couple years from what I’ve seen.  I got my eyes on dynatrace for tech and I might grab another share of amazon.  There’s still a huge push to aws and their sales are continually growing", "score": 19, "replies": [{"body": "people in home office need equipment", "score": 14, "replies": [{"body": "Ya I like dell and all I just feel like there’s more potential elsewhere", "score": 7, "replies": [{"body": "I'd agree with that - Dell has a HUGE commercial/business presence.  Can't remember the last time I got something other than a Dell laptop in my white collar life (it's been at least 5 years if I remember right - maybe even longer).  \n\nBut like you said, there's just better potential and better buying opportunities elsewhere.  Dell would have to do something pretty huge to get me interested.", "score": 2, "replies": []}]}, {"body": "People at home need beds. LONG WALMART", "score": 3, "replies": []}, {"body": "To say it another way:  Companies that are considering a permanent WFH force need to outfit those workers with equipment.  Large organizations are more apt to purchase from Dell because they need bulk orders filled.", "score": 1, "replies": []}]}, {"body": "I’ve read a few articles talking about Dell moving into the cloud space might be interesting to see them slowly pivot from commercial computers.", "score": 2, "replies": []}, {"body": "Dell is good as a very safe stock. Doesnt hurt to have couple shares in it or whatever", "score": 1, "replies": []}, {"body": "This list looks like it’s based on earnings / company fundamentals and then more predominantly checking if the stock is over-priced according to those fundamentals. Of course apple does better than Dell, but it seems like the apple stock is priced like it does 500X better than Dell when it only does 50X better (not exact numbers, just example) \n\nIt seems like that’s why there’s no popular stocks on this list, because they’re all extremely overpriced right now", "score": 1, "replies": []}]}, {"body": "I'm a travel nurse, worked at multiple hospitals throughout the state. Hospitals run on BDX supplies, hundreds of thousands of their products are used in hospitals every day because a lot of their item are single use throw away. As a nurse, I know that a BDX product is quite reliable and helping the patients stay stafe. Can definitely recommend BDX being a consumer of it in a hospital", "score": 9, "replies": [{"body": "Maybe a good company but it has shit financials", "score": 2, "replies": []}, {"body": "This was my opinion with MMM but even though N95 was essential to the pandemic their stock is doing worse than it was years ago", "score": 2, "replies": [{"body": "Ok I feel the same about 3M, I was thinking about getting a position at 150, but didn't pull the trigger", "score": 1, "replies": [{"body": "I genuinely don’t understand how MMM and Pfizer aren’t profiting like amazon during all this", "score": 2, "replies": []}]}]}]}, {"body": "My picks:  \nSP 500 Companies: Baba (undervalued), NVIDIA (one of the leading tech stocks), DIS (Dis+ + Opening Parks), TSLA (It's Tesla...)  \nMid-Cap: AMD (S-tier management and product top to bottom), DKNG or PENN (Sport betting will explode into the american scene), WYNN (One of the  best casino stocks), PLTR/SNOW (shuold have very good growth  ahead), NIO (one of..if not the leading EV in China)  \nSmall-Mid Cap: CRSR (Esports and  makes extremely durable, efficient products)", "score": 9, "replies": []}, {"body": "Atari\n\nMassive global comeback like never seen before...", "score": 13, "replies": []}, {"body": "I've been looking at LYV since right after the crash but decided against it at the time. Can anyone explain to me why the price is at pre covid numbers?", "score": 4, "replies": [{"body": "Yeah, it seems like this is an example of something that SHOULD be a 2021 post-covid play but that is trading as if it were already post-covid--so there is no real play there.", "score": 5, "replies": [{"body": "Agreed don’t know why anyone is watching this", "score": 3, "replies": []}]}, {"body": "I got LYV right after the crash and didn't expect these kind of numbers until live performances were actually a thing again. I plan to hold for a long time but seeing them this high already had me confused.", "score": 3, "replies": []}]}, {"body": "ARK LEAPS. easy", "score": 9, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "7/21", "score": 1, "replies": []}]}, {"body": "Why?", "score": 0, "replies": []}]}, {"body": "I sold plug @ 27. fml", "score": 3, "replies": [{"body": "I bought at 3.50, and sold at 13 expecting a massive pullback...that never came so I bought back in at 19🙃", "score": 7, "replies": [{"body": "Yup. Sold TSLA at $560 expecting a correction, gave up and bought back in at $605. Money I'll never get back but look at it on the bright side instead.", "score": 5, "replies": []}, {"body": "We’ve all been there.", "score": 3, "replies": []}, {"body": "I probably would have sold it except I forgot I had it...", "score": 2, "replies": []}]}, {"body": "Buy it back 😂", "score": 1, "replies": []}, {"body": "It’ll probably dip again just keep an eye on it.", "score": 1, "replies": []}, {"body": "I sold right before the 11% bump 2 days ago or yesterday, selling for a loss. Fantastic", "score": 1, "replies": []}]}, {"body": "Remindme! in 1 year", "score": 3, "replies": [{"body": "I will be messaging you in 1 year on [**2021-12-17 18:09:04 UTC**](http://www.wolframalpha.com/input/?i=2021-12-17%2018:09:04%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/kf12bb/forbes_picks_for_2021_and_which_ones_we_should/gg5wiwp/?context=3)\n\n[**10 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fkf12bb%2Fforbes_picks_for_2021_and_which_ones_we_should%2Fgg5wiwp%2F%5D%0A%0ARemindMe%21%202021-12-17%2018%3A09%3A04%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20kf12bb)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "1 year reminded and….Too bad Chinese stocks got rekt.  Can’t trust any of these stock picks these days…….", "score": 1, "replies": [{"body": "60% of the YTD is red. Goodluck 2022, I am getting a real job and it was wild and good. Cya around everyone.", "score": 1, "replies": []}]}]}, {"body": "Bad NYT [story](https://www.nytimes.com/2020/12/16/technology/alibaba-china-facial-recognition-uighurs.html) on Alibaba today. Facial recognition technology should be banned.", "score": 5, "replies": [{"body": "Yeah, it can be hard to bring one’s self to invest morally, but when I read that I decided that I’m gonna have to think pretty hard about buying more baba.", "score": 7, "replies": []}, {"body": "Stuff like this is why facial recognition technology is so scary. The worst part about it is that the larger your database of faces the less accurate it gets and the more it has false positives.", "score": 2, "replies": []}]}, {"body": "From their picks, I'd go with the following in each category\n\n*Entertainment*  \nPLAY - just has more room to run than LYV, but I think more people are itching for concerts than suburban heat & serve arcades  \n\n\n*Restaurants*  \nSHAK - Shake Shack - expanding like hell right now, they're popping up all over the west coast,  \n$ SBUX - Starbucks - because SBUX  \n\n\n*Furniture*  \n$ LOW - Lowe’s - the home improvement trend won't end. people who permanently choose to WFH + all these new home buyers due to low rates = sustained home improvement projects and construction\n\n*Energy*  \n$ PLUG - Plug Power - Batteries/renewables are here  \n\n\n*Healthcare*\n\n*no pick here*\n\n*Tech*\n\nBABA - Alibaba Group - Biden is not going to accelerate the war with China, give China stocks more room to run  \n\n\n*Industrial*  \n$ DAL - Delta - will take longer, but the return on biz travel which is 2x margins of leisure will lift DAL  \n$ LUV - Southwest - out the gate LUV is a good pick, when leisure comes back, it will hit here first", "score": 2, "replies": [{"body": "For healthcare i think XLV is good, segment tracking ETF", "score": 1, "replies": []}]}, {"body": "Anyone gotten into SIX or thinking about it? I'm thinking this would be a good buy if you assume there are no major setbacks in 2021 with the vaccine rollout. Not thinking of betting the farm on it, but more of a gamble with a small amount of funds.", "score": 2, "replies": []}, {"body": "Palantir, Mp materials, rocket companies, nio", "score": 2, "replies": []}, {"body": "Can’t believe I sold Play a couple months ago because of a couple articles saying they might go bankrupt smfh", "score": 2, "replies": []}, {"body": "I would buy Tesla stocks, because the stock price target is [$4000!](https://youtu.be/WJGCaBXzbbs)", "score": 2, "replies": []}, {"body": "China hacking forbes and promoting BABA lol", "score": 4, "replies": []}, {"body": "Keep buying Tsla.", "score": 3, "replies": [{"body": "It can't sustain.  The S&P inclusion will cause a massive drop and the hype will fizzle.", "score": 3, "replies": [{"body": "Hype of S&P will ... the hype of the company, it’s tech and  it’s products will not and that why you should invest in the stock in the first place .", "score": 5, "replies": [{"body": "Yes but at some point, something can't sustain it's stock price growth.  It hasn't really grown this year.  2019's revenue was only 15% above 2018's and 2020 is on the same pace.  The only thing that has grown is profit.  The stock has grown 1000% in the same timeframe.\n\nI love the company and the CEO but reality is reality.  At some point you stop being a growth company and start being a value company.   \n\nIs Tesla worth more than Visa and Walmart combined? Is it 3 times more valuable than Netflix or Toyota?", "score": 1, "replies": []}]}, {"body": "I think it’s still a good long term buy, but I think a pullback will hit soon.", "score": 5, "replies": []}]}]}, {"body": "Garbage. Who goes in on furniture and Lowe's when you could go in on lumber and cover the whole field?\n\nPLUG? You have to be joking. All hydrogen cells are filled using nat gas, it's just painted green, do a real green play.\n\nIndustrial a bunch of shipping companies? Which are going to go down when people can go to stores again? At least buy tractors to sideways play that commodity soy boom from la nina and the green infractructure construction. Better yet, copper, silver, rare earth.\n\nPlease Forbes. This is what I would project 5 months ago.", "score": 4, "replies": []}, {"body": "My favs are SBUX, SIX, PLUG and BABA", "score": 2, "replies": [{"body": "SBUX has been killing it this year! \n\nUp 47% in my portfolio since April.", "score": 2, "replies": [{"body": "Which is crazy since all the ones near me have been closed all year 😓", "score": 2, "replies": []}]}]}, {"body": "Baba sucks when I break even eventually selling this shit", "score": 2, "replies": [{"body": "Worst performing ecomm stock this year.", "score": 2, "replies": []}]}, {"body": "Just started investing this year after the crash, I basically saw it as a sale and figured it was a good time to get in. Got PLAY, LYV and SIX just after the crash. They've all done well for me, but I will say I'm very surprised with how quickly LYV has gotten back up to pte-covid numbers. Didn't expect them to get back to here until things opened back up.", "score": 1, "replies": []}, {"body": "Why do they think the furniture biz will soar, just because it isn't easily moved to e-commerce? Not a sector I would be investing in. PXD is likely  undervalued, but I'm moving toward renewable energy, which Pioneer is not, as far as I know.   Still interesting.", "score": 1, "replies": [{"body": "Everyone and their dogs are moving. I'm in Bassett and Flexsteel, been doing great. Bassett just issued a special dividend and their last report said they haven't seen business like this in over a decade. Uhaul is also being very good to me. Their EPS was just insane last quarter.", "score": 3, "replies": []}]}, {"body": "What’s everyone thinking with PLL’s redomiciliation? I’m hoping that’s approved by Australia.. and hoping that by June they’ve completed their land study in NC and start pumping Li for TSLA", "score": 1, "replies": []}, {"body": "i don't get why they'd pick Sonos.  i have sonos in my house and love it but it's so vulnerable.  all they do is multi-room wireless audio and now you have Google and Apple doing the same thing.  I believe Sonos is suing google over it.", "score": 1, "replies": []}]}
{"title": "what do you think of PLTR - Palantir. It's a bubble or not?", "selftext": "Since the IPO of Palantir I have been following this company and I see several different opinions about it, saying that there is a bubble or it is like a \"casino\", others say that it is one of the best IPO's in history having highlighted the founder Peter Thiel who already got involved with Paypal and Facebook and for that I would like to know the opinion of each one of you.", "id": "kf6wvm", "created_utc": 1608241133.0, "score": 32, "upvote_ratio": 0.76, "num_comments": 71, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Meme phenomenon accelerated inevitable growth. It may continue to take off in the short term, it might not. My time horizon is 3+ years, potentially closer to 5-10. I got in at a good cost basis, so I’m not worried either way, just holding. Ultimately think it will be a massively influential software platform across Gov and private sector. \n\nWill look to build a larger stake on red days, if it trades sideways doe a while or if there’s a lock up dip.", "score": 59, "replies": [{"body": "TBH, at this stage of the game, the stock price is inconsequential to the operations of the business.  That's bad for shareholders and speculators.\n\nHowever, that's very good for business.\n\nPalantir could dump shares whenever they want to generate cash to fund new projects, hire more people, but they don't have to since they took a cool half bill from Sompo over the summer.\n\n[https://www.bloomberg.com/news/articles/2020-06-19/palantir-raises-500-million-from-japan-s-sompo-ahead-of-listing](https://www.bloomberg.com/news/articles/2020-06-19/palantir-raises-500-million-from-japan-s-sompo-ahead-of-listing)\n\nThey were making $739 mill in 2019, 2020 is projected to hit $1.07 Billion for 2020.  And a lot of this year's operating loss is from the cost of going public.  It's possible that when earnings come out in 2022 they'll be operating from a profit.\n\nI think the best call right now is $60-$80 LEAPs just after 2021 earnings show upin 2022Q2.  \n\nIf:\n\n1. the world doesn't run out of money trying to float society during COVID or \n2. a vaccine resistant sars-cov-2 strain doesn't happen\n\nyou'll make a dickton of money in 15 months.\n\nBut ofc if you're a godhand day trader, you could profit off Palantir's swings which are pretty frequent.", "score": 9, "replies": [{"body": "I’ve generally stayed away from options, but I’ll give it a go. \n\nLooking at a 50c Jan 22.. only option I see that’s close.. this what your talking about?", "score": 2, "replies": []}]}]}, {"body": "If you understand what they are doing with foundry and gotham... you already know this is NOT a bubble", "score": 73, "replies": [{"body": "could you give a brief summary?", "score": 2, "replies": [{"body": "bruh, open a new tab, type in \"what is palantir gotham\", I was going to post some asshole shit but seeing as you are from Brazil and your country basically lead the fight against pubes, you get a pass. \n\nHere: [https://crozdesk.com/analytics-intelligence/big-data-software/palantir-gotham](https://crozdesk.com/analytics-intelligence/big-data-software/palantir-gotham)", "score": 27, "replies": [{"body": "Theyre the spearhead of the anti-pubes movement. Hespect", "score": 3, "replies": []}, {"body": "Such a chad thing to say.. but.. your right.. thank god for the wax.. mad respect to both you.", "score": 2, "replies": []}]}, {"body": "[Here’s a video summarizing it well](https://youtube.com/watch?v=_Ppehs_TStg&feature=share)", "score": 4, "replies": []}]}]}, {"body": "[https://duevigilance.substack.com/p/the-true-cost-of-going-public](https://duevigilance.substack.com/p/the-true-cost-of-going-public)\n\nThis is what it cost in cash to Airbnb + SnowFlake vs Palantir + Asana to go public.\n\nThe actual cost to the companies.  The visualized comparison is pretty insightful.  \n\nIt's important to keep in mind how much their valuation was vs how much they're trading/market cap to now and how they got there.  \n\nFor Airbnb, the pre-ipo valuation of $47B was set when they took on additional money mid year.  A year prior they were looking at a $35B valuation, now it's over $100B.  Pre-IPO Valuations are usually done based on how much money an outside investor is willing to stake the company at, not an actual indication of what the company is really worth.\n\nAirbnb will probably do pretty well long term, same with Snow, and same w/ PLTR.  I think ultimately it goes w/ whether or not a company is properly valued or not.  I think Palantir made that quite obvious that they're undervalued due to public perception and the fact that they're operating at a loss (that's quickly evaporating).  \n\nThey demonstrated a bit of smart maneuvering by:\n\n* Leaving Silicon Valley first\n* Raising money before they actually need it and when the terms are best\n* Choosing a DPO to save money and not mess up their employees' chances for liquidity\n* Actually entering a recession, not once, but TWICE, with stacks and stacks of eddies (sorry, cyberpunk 2077)\n\nThe PLTR Upside is like a freight train.  It's just gotta pickup steam before it moves.  \n\nYou should check out their Demo Day on on Jan 26th.  The employee lock up ends the week after.  \n\nIf everyone believes in Palantir's worth, the, the stock will shoot up or maintain flat despite employees getting the rest of their shares unlocked the following week.\n\nIf everyone doesn't believe in what Palantir is doing, the shares will drop like a super dense deuce that makes you feel like you're shitting out your soul.", "score": 18, "replies": [{"body": "congratulations for the comment!!", "score": 1, "replies": []}]}, {"body": "I would trade my first born for a lot of PLTR at $25.", "score": 42, "replies": [{"body": "It dropped to $25.15 yesterday. Surely your child is worth more than $0.15/per share?", "score": 27, "replies": [{"body": "You haven't met his child...", "score": 23, "replies": [{"body": "He hasn’t met his own child too", "score": 2, "replies": []}]}]}, {"body": "Sell puts bro", "score": 2, "replies": []}, {"body": "i got about 1800. sooo..are we talking about hypothetical first born or...?", "score": 0, "replies": []}, {"body": "Gunna get your wish today. They just got another hit piece on them im afraid", "score": 1, "replies": []}]}, {"body": "No, it's a promising 5+ year hold.  They have a pretty wide moat and good margins. I've bought 400 shares over five or six rounds with an average of $27ish, not worried in the slightest.", "score": 14, "replies": [{"body": "Same, I have 850 shares and have every intention to hold for a couple years. There's way too many day and swing traders that infect this sub that are looking to sell after a few weeks, it's nonsense.", "score": 4, "replies": []}]}, {"body": "Buckle up space cowboy!", "score": 10, "replies": []}, {"body": "DPO not IPO", "score": 8, "replies": [{"body": "ok ok", "score": 1, "replies": []}, {"body": "\\^Preach. There's a huge difference.", "score": 0, "replies": [{"body": "But Palantir is a little bit of a weird DPO, isn't it, because I believe that they have a lock-up period.", "score": 0, "replies": []}]}]}, {"body": "Looks like only people whoa re bullish have posted. So am i lol. Dont fight the trend", "score": 6, "replies": []}, {"body": "For people that flip stocks i see why betting on palantir might sound like a bad idea. Its very volatile and unpredictable, also its up 200% since its IPO less than 3 months ago. So pretty risky for a short term bet. Palantir is doing a lot of good things though so in the long term it shouldnt matter too much.\n\nIm buying on every significant dip and holding untill my retirement.", "score": 5, "replies": []}, {"body": "Stock : exists\n\nReddit : Is this a bubble?", "score": 5, "replies": [{"body": "I loled", "score": 2, "replies": []}]}, {"body": "It's a fun trade. I bought some shares at $17 and plan to hold them. If the company doesn't pan out, it's 2% of my portfolio and won't kill me, but if they grow into what is expected, I'll have struck gold.", "score": 2, "replies": []}, {"body": "[removed]", "score": 8, "replies": [{"body": "You should not be buying calls on this stock lol. It’s so volatile just buy shares.", "score": 15, "replies": [{"body": "or buy stock and sell covered calls. ;)", "score": 5, "replies": [{"body": "One of my favorite ways to make money in a sideways or slightly down market.", "score": 0, "replies": []}, {"body": "This! Lol follow the big firms that’s what they have been doing with this stock for like 3 weeks. MS shorted while having 3 million shares lol. They get to collect the premium from all these gamblers and they get to keep their shares.", "score": 0, "replies": []}, {"body": "at what strike price?", "score": -1, "replies": [{"body": "This week I could tell the price action would be sideways, I sold the 28c 12/18 for about .70 cents. Just need the close tomorrow to be under 28.70 for it to be a +money trade. Next week i think it will break to the upside a little.", "score": 0, "replies": [{"body": "It could easily hit 28 tomorrow and your calls could very well be exercised. Should have done covered calls for 30 strike.", "score": -1, "replies": [{"body": "$30 is what I chose", "score": 0, "replies": []}, {"body": "It could also easily not hit 28. Like I said, my profit indifference is at 28.70. If I can close at .10 or .12 I will. Then sell next week's 33s or something. Short week, market closed on Friday.", "score": 0, "replies": []}, {"body": "Told ya. Dumbass.\n\nShould have done 28c.", "score": 1, "replies": [{"body": "Should have invested in bitcoin or tesla.", "score": 1, "replies": [{"body": "i do.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Volatility is perfect for all options because of limited downside risk. Just look at the Black Scholes Formula and one specific input variable", "score": 0, "replies": []}]}]}, {"body": "It is a long term hold for me. Anyone who says it is casino, they don't really understand what PLTR does. I got TSLA 10 years ago, and experts shorted it, said it was overvalued, blah blah blah, but here it is at another record high. I have a ways to go before retirement so dips and corrections along the way don't matter to me.", "score": 2, "replies": []}, {"body": "I bought 1,500 on direct listing day, actually lost lost 10% value then took off. \n\nI’m in for 10 years.", "score": 2, "replies": []}, {"body": "It's a good company with lots of growth prospects.", "score": 1, "replies": []}, {"body": "Tilray was a bubble and thiel was on.. PalanThor might be or might not be. Time will tell", "score": 0, "replies": []}, {"body": "Lol absolutely not. it's a solid company. Look at good tech companies after they IPO. NET, FSLY, DDOG. Not saying they're similar industry but as long they grow and don't experience turnover, they will grow their stock price.", "score": 0, "replies": []}, {"body": "Nope.", "score": 0, "replies": []}, {"body": "Wow, again....", "score": -1, "replies": []}, {"body": "Not a bubble but probably won’t fly anytime soon", "score": -1, "replies": []}, {"body": "Buy more", "score": 0, "replies": []}, {"body": "1.8 gazillion shares are coming to the market in February after the lock up period.\n\nFor a company trading at 60 times it’s revenue and not making a profit. \n\nBubble? Naaaah, buy calls and yolo.\n\nMore serious? I want in, but right now the risk/reward is shit. I will wait to February. I have faith in the company, but not the stock at this moment.", "score": 0, "replies": []}, {"body": "of course its a bubble, that stock % in such short time.", "score": -5, "replies": []}, {"body": "Meme play", "score": -3, "replies": []}, {"body": "You came to r/stocks for an answer but the only users here are from WSB lol. It ran up 200% in a couple months based on not much real revenue growth. It’s not that hard to figure out if it’s in a bubble", "score": -6, "replies": [{"body": "I can see from your profile that you are a big WSB fan tho", "score": 2, "replies": [{"body": "No you", "score": -1, "replies": [{"body": "Ima fan of many subreddits", "score": 1, "replies": []}]}]}, {"body": "Bro, Tesla is in a bubble. PLTR might be slightly overvalued, maybe, but it’s not a bubble", "score": -1, "replies": [{"body": "Bro, the definition of a bubble is when it’s overvalued", "score": -4, "replies": [{"body": "So 1 cent above accepted valuation metrics = a bubble? Then 50% of stocks are likely in a bubble at any given time", "score": -1, "replies": []}]}]}]}, {"body": "Soon I suspect.", "score": -1, "replies": []}, {"body": "I think it might be the microsoft of the 2020s. It's software will be adopted by alot of the fortune 500 and govt agencies.", "score": 1, "replies": []}, {"body": "There are couple of companies that are just a trading spot for day traders. Imo PLTR is one of them, PLTR is lacking the news to drive it above 30.", "score": 1, "replies": []}, {"body": "No bubble. Palantir stock price target is [$100!](https://youtu.be/06GQ_ZibTnM)", "score": 1, "replies": []}]}
{"title": "Apple new hidden iOS 14.3 will likely destroy FB, ZNGA", "selftext": "iOS 14.3 included a bunch of shit, but the most important feature isn't even included in [https://www.macrumors.com/guide/ios-14-3-features/](https://www.macrumors.com/guide/ios-14-3-features/).\n\nEnter app privacy labels: [https://www.macrumors.com/2020/12/14/app-store-privacy-labels-ios-14-3/](https://www.macrumors.com/2020/12/14/app-store-privacy-labels-ios-14-3/).\n\nThese things are insane for absolutely fucking anything that sells a shit ton of data. For example look at robinhood: [https://apps.apple.com/us/app/robinhood-investing-for-all/id938003185](https://apps.apple.com/us/app/robinhood-investing-for-all/id938003185). They collect a shit ton of financial information, but that is expected. However, look at something like Instagram: [https://apps.apple.com/us/app/instagram/id389801252](https://apps.apple.com/us/app/instagram/id389801252). They absolutely collect everything. I'm surprised people aren't already significantly complaining about it. Once this reaches mainstream, people will start complaining on Twitter about Facebook and Facebook will either have to suffer a loss of customers, or they will change their policies to collect less information.\n\nThere are probably smaller market cap companies that will be affected much more by this, such as ZNGA, which sells location data to advertisers and depends entirely on mobile games. ZNGA puts are also extraordinarily cheap right now, they are priced for about the last week where ZNGA rose significantly. There are likely a plethora of stocks that may be affected by this news.\n\nAs well as this, AAPL and FB are having a bit of a fight, AAPL will likely win and the recent stock price comparison of the two reflects this. \n\ntl;dr: Apple's new update revealed that Facebook attempts to collect your credit score, other data. FB and other mobile app companies that sell data bearish, AAPL bullish.\n\nPos: Only long AAPL shares so far, will probably get my first ever put of 9p 1/15 on ZNGA at open tomorrow.", "id": "keqq8q", "created_utc": 1608180958.0, "score": 115, "upvote_ratio": 0.94, "num_comments": 70, "comments": [{"body": "Wait, so what strike & expiry PLTR should I buy?", "score": 147, "replies": [{"body": "$60c $12/18 if you want to belong", "score": 37, "replies": [{"body": "Be long?", "score": 17, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Belo Ng", "score": 3, "replies": [{"body": "He means BE FUCKED", "score": 3, "replies": [{"body": "Long. Ok.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "**PALANTIR 1/8 28C**", "score": 6, "replies": [{"body": "this is the way", "score": 3, "replies": []}]}, {"body": "PLTR gang the most consistent", "score": 2, "replies": []}]}, {"body": "Anything that causes Zuck to have a bad day is all right with me.", "score": 76, "replies": [{"body": "Robots have bad days?", "score": 4, "replies": []}, {"body": "Can’t cuck the zuck. He’s the man. 🤖", "score": -1, "replies": [{"body": "*lizard", "score": 19, "replies": [{"body": "I thought he is just a proxy shell for a decentralized AI that hides in the internet?\n\nHi Zuck, I know you can read this!", "score": 2, "replies": []}]}]}]}, {"body": "I am also long on Apple. The privacy changes are brilliant. They will cause massive headaches for FB and other apps that rely on ads as their primary source of revenue ([https://www.theverge.com/2020/12/16/22178068/facebook-apple-newspaper-ads-ios-privacy-changes](https://www.theverge.com/2020/12/16/22178068/facebook-apple-newspaper-ads-ios-privacy-changes)). This will force some developers to a different business model, e.g. in-app purchases, where Apple gets a big chunk of the revenue. \n\nApple doesn't like the advertisement-based revenue model, not only because they are committed to privacy, but also because they don't get any chunk of that money.", "score": 53, "replies": []}, {"body": "[deleted]", "score": 15, "replies": [{"body": "I clicked the links but it doesn’t show me? How can I see?", "score": 2, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Thx needed to update phone 📱", "score": 3, "replies": []}, {"body": "would you mind providing us with a screenshot, please?", "score": 3, "replies": []}, {"body": "Nobody is going to scroll down and look for that. This changes nothing.  Unless they require the apps to let users opt out of tracking specific things", "score": 1, "replies": [{"body": "Ios14 when this rolls out defaults to opt out and prompts on app open to accept.", "score": 1, "replies": []}]}]}]}]}, {"body": "$FB is just upset their collusion with $GOOG is getting called out.", "score": 9, "replies": []}, {"body": "fb/ig/whatsapp is a behemoth but this privacy thing is pretty much their achillies heel.", "score": 6, "replies": []}, {"body": "People just don’t give a shit about their data", "score": 36, "replies": [{"body": "When people have the option of opting out of tracking, who the fuck wouldn't opt out?", "score": 13, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "They didn’t have choice did they? I just wanted to creep on my ex.. not have my location tracked so zuckerface can sell me more ads.", "score": 10, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Except now they will have the option to opt out and still have the ability to use Facebook. You are crazy to think people won't opt out when they have the ability to do so and keep using facebook.", "score": 6, "replies": [{"body": "No there is no option to opt out, it is just a list of shut that they are tracking with the app", "score": 0, "replies": [{"body": "No there is an opt out option. \n\nTim Cook just tweeted this lol\n\nhttps://twitter.com/tim\\_cook/status/1339720611313065984?s=20", "score": 2, "replies": []}]}]}]}, {"body": "And this doesn’t change any of that. If you want to use the app you have to agree to all of that tracking, it is not letting you opt out of any of it", "score": 1, "replies": [{"body": "Actually it does but Facebook doesn’t want you to do that.", "score": 2, "replies": []}]}]}]}]}, {"body": "They really don’t. They pretend to as an emotional weapon against big tek", "score": 10, "replies": []}, {"body": "^Young^", "score": 1, "replies": []}]}, {"body": "This will negatively impact Facebook and other ad platforms that use cookie based tracking.\n\nAt the bottom of the mktg funnel, this update will make retargeting of Apple users hard or impossible.\n\nExpect to see more marketing funnels start by asking you for your email or phone.\n\nIf marketers can't retarget you with ads, they can still remarket with emails and texts.", "score": 4, "replies": []}, {"body": "I feel like this is going to take years to play out. Good dd overall and it looks like a downtrend triple top, but I’m not willing to bet against a cup and handle. Probably going to buy calls and puts with a June expiration.", "score": 6, "replies": []}, {"body": "So I should double down on ZNGA calls?", "score": 7, "replies": [{"body": "remember being dumb makes more money than actual logic", "score": 11, "replies": [{"body": "“Oops, I’m a millionaire.”\n\n“I’ve tried really hard to become broke.”\n\nYou might be on to something.", "score": 2, "replies": []}]}]}, {"body": "apple has seen the future, they are preparing for it.", "score": 3, "replies": []}, {"body": "Why 1/15 for your put? I agree with you 100% but think it will take a bit longer to be reflected in the stock price. March maybe? Sometime after ER", "score": 3, "replies": [{"body": "I think ZNGA is wayyyy too overvalued but I might roll out my puts if it doesn't crash soon.", "score": 1, "replies": [{"body": "Needs an article outlining your theory to tip the scale. Otherwise I think this is a long play.", "score": 1, "replies": []}]}]}, {"body": "I've been VERY bullish on facebook until I saw the ios 14 notifications in one of my ad accounts this morning. The easy fb/ig advertising party is over. Fb is fucked.", "score": 3, "replies": []}, {"body": "Looks like iOS 14.3 came out 12/14.  ZNGA CEO dumps almost 1/3 of his shares the next day? Coincidence?\n\nhttps://finance.yahoo.com/news/zynga-inc-znga-ceo-frank-001503126.html", "score": 3, "replies": []}, {"body": "Stonks don't give a fuck about privacy", "score": 12, "replies": [{"body": "Stonks don't give a fuck about privacy but [the EU does.](https://www.eubusiness.com/topics/internet/digital-services-act)\n\nStonks give a fuck about the EU", "score": 2, "replies": []}]}, {"body": "So help me god if these ZNGA puts don’t print", "score": 4, "replies": [{"body": "Share strike, expiration date, and quantity so I can see if I make someone rich or make them poor.", "score": 2, "replies": [{"body": "Whatever the fuck you bought bro", "score": 3, "replies": []}]}]}, {"body": "Does 9p 1/15 mean you’re buying the $9 put that expires on 9/15?\n\n*Don’t hate me I’m just getting into options yesterday*", "score": 2, "replies": []}, {"body": "ZNGA's ads make only 12-15% of total Revenue. Why would ZNGA drop so much for us to buy puts?", "score": 2, "replies": []}, {"body": "Facebook stopped its program where it would pay people monthly to collect all their data. That seemed genius to me. Everyone has their price.", "score": 3, "replies": []}, {"body": "I hope you realize people need/want to use apps no matter what information is \"collected\"  about them..\n\n\nThe only way Facebook/apps are going to be hurt is when there are alternatives to not use facebook/instagram/znga anymore..\n\nfor example, \n\n- There is Google, Duck Duck Go, and Yahoo search..  \n\nSupposedly Duck duck go is the better private search, but Google has more listings etc..\n\n- Same with Web Browsers, so you have Safari, Firefox, Edge, Opera and Chrome..\n\nWell, Chrome is the better built broswer but if you need to go to a browser called \"vivaldi\" to get that chrome based foundation without the google garbage of data collection and doing things in the background using up your computer resources/and internet etc..", "score": 4, "replies": [{"body": "Valid points but I think it’s all in how it’s presented.  Anyone given an option for location data tracking in my mind would allow it if the app is something relative to geography (Like Uber or DoorDash).  \nThis guy has a point here.  If I’m some bored person looking to kill time with mobile games, why would I toggle “allow location tracking” when downloading the app?", "score": 1, "replies": []}]}, {"body": "Nah. Only Americans care about this. Emerging markets give zero attention to it.", "score": 1, "replies": [{"body": "Americans drive the price of amd revenue of aapl", "score": 3, "replies": []}]}, {"body": "What strike and date for MT did you say?", "score": 1, "replies": []}, {"body": "  Sounds like a dumb question but would Apple be strong enough to weather the possibility that app creators will migrate to focus on android only", "score": -3, "replies": [{"body": "They'd miss out on the massive (and wealthier) userbase on iOS.", "score": 10, "replies": [{"body": "Just cause I have green chat bubbles doesn’t mean I belong in the bread line", "score": 2, "replies": []}]}, {"body": "Fortnite didn't really cause Apple any damage but caused Epic games a massive headache, Apple has more power than pretty much all of the app creators.", "score": 3, "replies": [{"body": "Apples playing the long game. They know privacy will be at the forefront in 5-10yrs so they are positioning themselves now as the gold standard for device security. Tbh, all this security changes in the last year is what drove me to go apple everything.", "score": 4, "replies": [{"body": "As someone who has gone through the long process for getting approved for even just a beta test of an app, I know it's a pretty difficult process to get through and there's a ton of testing to make sure that your app meets their standards. While I do agree with some of the stuff that developers say about the monopoly of the market, it dramatically increases security for all the consumers.", "score": 2, "replies": []}]}]}, {"body": "Even though Android has a lot more users, Apple users beats android in terms of spending money in apps and buying stuff and also I believe Apple users have more active than Android users. Google who owns Androids made more money from Apple than Android for long time.", "score": 1, "replies": []}]}, {"body": "Disclaimer: we own ZNGA puts?", "score": 1, "replies": []}, {"body": "ZNGA is litrally a $10 stock....", "score": 1, "replies": []}, {"body": "Facebook recently had issues in Ireland I believe it was where courts ruled against facebook sending user data to various locations - I'm sure there's more than just that but it's all I could recall and it might not be 💯. But basically facebook threatened to cut services due to this. If ya ask me, fine, cut services, you don't need my data like you claim you do.", "score": 1, "replies": []}, {"body": "People who use Facebook don't give a flying shit going sideways about their info", "score": 1, "replies": []}, {"body": "Great now I’ll get retarded Aflac ads alongside tampon commercials in my feed because Google has no idea what gender I am.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "keyw5u", "created_utc": 1608217009.0, "score": 15, "upvote_ratio": 1.0, "num_comments": 73, "comments": [{"body": "Idk, they are having a logistics nightmare with the vaccines. FDX will definitely have a great earnings today but I don’t know if it will be enough. I gotten burned in too many earnings to play with FDX today", "score": 11, "replies": [{"body": "Still suffering from UPS last earnings so can’t decide if I want to get beat down again or take my toys and go home.", "score": 4, "replies": []}]}, {"body": "UPS dips after the holidays like clockwork. Good luck with those calls", "score": 8, "replies": [{"body": "Dammit. What are you. A historian.  I will take your luck.", "score": 5, "replies": [{"body": "No, don't. Do your own research. I was looking at this last year and my puts are getting FUKKKED because I bought too early. Look into your crystal ball and do what you think is best", "score": 4, "replies": [{"body": "Research. Ha. I’ve been holding these 3 months and well.... They both have stalled. Just taking the temperature of the room on this.", "score": 1, "replies": []}]}]}]}, {"body": "RIP my calls", "score": 7, "replies": [{"body": "Seriously.", "score": 3, "replies": [{"body": "SAME only had 1 but it was one big ass premium lol.  \n$300C 01/15", "score": 4, "replies": [{"body": "1 or 100 this sucks.", "score": 4, "replies": []}]}]}]}, {"body": "I'm on board with a FDX 300c.  Was hoping for a little activity today. 🙏", "score": 6, "replies": [{"body": "My man. Prayers indeed.", "score": 2, "replies": [{"body": "Did we get fucked by the ER today?  U Going to 💎 🖐 thus bitch?", "score": 1, "replies": [{"body": "It would appear so. Just listened to the call and everything seems awesome. Not sure what the mkt hates. I’ll have to see what it looks like tomorrow. Not likely to hold more than a day or two with the theta burn tho.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Agreed. They even said they are raising prices and expect to expand margins in the next two quarters. Like WTF more you you ask for. Be an analyst and figure it out yourself. \n\nAnd if I ever have to listen to 18 analysts ask for more CoLoR again I’m going to hunt them down and punch em in the teeth. \n\nI do think it’s oversold but not sure if I can catch the rebound or not. My 300c’s for 1/15 are a little tight.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well shit. I’ll give it a few more days maybe. See if the stimulus pumps shit for us regardless. Sub 30 day shit is such a roll of the dice. Especially over the holidays and new year.", "score": 1, "replies": []}]}]}]}, {"body": "K thanks for commiserating with me.  Might wait till Monday cause I'm thinking it hit some resistance for now.", "score": 1, "replies": [{"body": "I’ve already killed a bottle of wine. Drink up. Agree it’s got support here around 280. Just going to get killed if we hold much longer I’m afraid.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "ouch, down \\~3.5% AH. Hoping for 'it's on sale' pop in the morning.", "score": 5, "replies": [{"body": "So dumb. Not you. Banks.", "score": 4, "replies": []}]}, {"body": "Also in for 12/24 $300C but Theta is a bitch. Need a Christmas miracle on this.", "score": 4, "replies": [{"body": "Agreed. The decay is strong on these. It’s not out of the question to hit $300 seeing as it broke through last week. However it promptly fell back to $285 as well.", "score": 1, "replies": []}]}, {"body": "Cant believe a drop with such good earnings... buying more calls", "score": 4, "replies": [{"body": "Seriously. Wtf. They beat rev and profit. And then on the call said they were going to keep prices high and increase margins the next two quarters. What more could people want.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I listened to the call. They literally said they are raising prices and increasing margins the next two quarters. Ridiculous. I don’t get it. Earnings may be lower- sure- but fatter margins and more control over costs.", "score": 1, "replies": []}]}, {"body": "Analysts constantly screw up what’s going on with FDX/UPS, which is good for us.  These same morons dumped both companies last month when the vaccine was announced, foolishly lumping them in with all of the other post-COVID tech stocks.  It was a fantastic opportunity for buying stock and calls, and I made a nice return within days.  \n\nFDX and UPS are still in the middle of “Peak”, and have only gotten started with a massive amount of operations for the COVID vaccine all over the world.  Rather than be bummed, this is a great opportunity to buy some positions on sale.  The sale won’t last long, just like last month.\n\nThe FD guys are probably screwed though, but that’s ALWAYS a major gamble (who the hell holds options through earnings anyway?!).", "score": 1, "replies": [{"body": "Agreed. They sell of and then resumed last time. However their numbers were stellar and will be raising prices and growing margins the next 2 quarters. Everybody who is greedy holds through earnings. That’s who.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Indeed. It’s had a big run. Thinking about walking. But wanted to get the opinion of all the other tards.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I hate em. Like 4 trucks depending on what service to use. Not small biz friendly. Seems like they survive to serve large companies with fat margins. I think they are taking the online biz that normally sells in malls.", "score": 2, "replies": []}, {"body": "FDX makes a lot of their money off their off site accounts i.e. Apple, Microsoft, Under Armour, Direct Tv etc. every time i get extra hours and go to these places, they are loaded with work, i havent even included the bulk accounts like Amazon who gets truck loads of goods everyday. Deliveries to people or businesses dont even make them that much money, go inside any FedEx Express and you will see a ton of packages that are left cause they either couldn’t be delivered or they is simply no room in the shuttles anymore. Im expecting for earnings to be completely blown out cause of the holidays", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "No shit", "score": 2, "replies": []}, {"body": "Downer on my night.", "score": 1, "replies": []}, {"body": "Well they beat everything, just how i said, why it went down i have no clue", "score": 1, "replies": [{"body": "Agreed. Makes no sense.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "FDX 350 or bust", "score": 3, "replies": [{"body": "God. If only that was a thing. They finally broke $300 and got some nice upgrades.", "score": 1, "replies": [{"body": "FDX ain’t going anywhere and everything is delivered by them and a few other delivery companies. 12/24 350s for yolo giggles", "score": 3, "replies": [{"body": "I feel the same. It’s a duopoly. I think FDX being franchise model can grow quicker than UPS to accommodate demand.", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 3, "replies": [{"body": "Agreed. -85% currently so how much worse can it get.", "score": 2, "replies": []}]}, {"body": "RIP", "score": 3, "replies": [{"body": "Super fucking lame indeed.", "score": 3, "replies": []}]}, {"body": "I have: (all expiring tomorrow)\n5x long 305c\n5x long 300c\n2x long 290c\n10x short 310c\n\nMy plan is to sell the 300s and 305s today and buy 8 350s or something. Breakeven on the short calls is 315, which there’s no way of happening right? Is this retarded?", "score": 2, "replies": [{"body": "Bumping the $350s out a few months then?\n\nHard to say. I am a confirmed retard after buying AAWW. I am but a simple sheep.", "score": 5, "replies": [{"body": "Nah expiring tomorrow basically turning the two debit spreads (300s &305s) into a credit spread since RH doesn’t let you just sell naked calls. The 350s are pretty cheap so I’d still get a hefty chunk of premium from the 310s", "score": 2, "replies": [{"body": "I see. Well it makes sense. Here’s to success brother.", "score": 1, "replies": []}]}]}]}, {"body": "I worked in business development for UPS for the last 8 years and now am doing a similar role with FedEx.  I would feel good about your positions on FDX.  You are going to be taken to the woodshed on your UPS position.  While volume is always high in Q4 their costs skyrocket.  This year it has been even worse.  The vaccine volume will be excellent for both companies but won’t really make an impact until earnings Q1.  I don’t hold any positions but my recommendation would be look for calls in June.", "score": 2, "replies": [{"body": "Interesting. Thank you for your insight. UPS killed me last earnings- down 85% already. Will likely sell out soon with my remaining value. Are you recommending for FDX in June?", "score": 1, "replies": [{"body": "Just seeing what I see in the industry right now June seems to be the safest bet.  Holiday return season finishes up in January, it will be the biggest yet.  Costs will drop in February or so as temp workers and loaned equipment is cut.  The vaccine is going out Express, which brings the greatest yield, and we are just getting this started.  There also is a massive backlog of ocean containers hitting the US right now.  I think we are just getting started with these two companies right now.", "score": 2, "replies": [{"body": "Hmm. Maybe I roll these today then. I just have 1/15’s cuz that’s what I picked 3 months ago. I agree that they will both be undergoing massive changes going forward. The volume isn’t going to go away. Now that the boomers have started buying online.", "score": 1, "replies": []}]}]}]}, {"body": "The Fedex and UPS trucks that do pick ups for my warehouse have been packed to the brim since November. Their volumes are extraordinary. I think I’m going to open a bullish broken butterfly before close.", "score": 2, "replies": [{"body": "Same here with then UPS guys for me. He doesn’t even bother to back up anymore- just kinda pulls up against the door and we roll the carts out to them. All about speed. Been that way for 3 months. Which is why I’ve been in this trade so long.", "score": 2, "replies": []}]}, {"body": "Im surprised how the FDX volume is barely picking up, i work at FDX and we receive CEO memos. What they had projected to do in 5 years they did in 5 months cause of covid, they are absolutely going to crush earnings. Peak this season is ending until Jan 19, past years has always ended right after Christmas, to anyone thinking they arent making it good for earnings, you are dead wrong, they have me slaving at that warehouse and its a no brainer that they have beaten expectations\n\nFDX $292.5c 12/18", "score": 2, "replies": [{"body": "You mean volume in terms of share price? \n\nThat’s the inside line I need to hear. In that case I’ll hold the line. I’ve been worried but it’s been consolidating around 280ish and hopefully ready to spring higher.", "score": 1, "replies": [{"body": "Yes in terms of share price, i think a lot of people are sleeping on FDX", "score": 2, "replies": [{"body": "Nice to see I’m not the only one. They had the slump in price for a few years but if you take that out it’s pretty flat. Which tells me they got room to boom! I think it’s the big run up that puts everybody off.", "score": 1, "replies": []}]}]}, {"body": "This is an option pricing bot. The latest option price is:\n\nPosition|Bid|Ask|Last Price|IV|% Change\n:--:|:--:|:--:|:--:|:--:|:--:\nFDX   292.5|9.6|9.75|9.68|120.623%|20.16%\n\n\nFDX 292.5C 2020-12-18 was mentioned 0 times\n\n[Click to see where](https://www.reddit.com/message/compose/?to=aRecycleAwayAccount&subject=gg69v6g&message=Show me)\n\n^(These quotes are based on real time prices. This bot comments Mon-Fri between the hours of 6am-7pmET. Any feedback or suggestions are welcome!)", "score": 1, "replies": []}]}, {"body": "CHOO CHOO\n\nPosition Stats: FDX 250C 01-15-2021\n\nRecent best performance: 18,693.33%\n\nAll time performance: 14,113.33%\n\n[Price history chart](https://tendiechart.com/pricehistory.cfm?symbol=FDX&date=1610668800&s=250&t=C)", "score": 2, "replies": [{"body": "Ya. I had 10 of the 250’s and foolishly was happy with 300% gains. Left with 2 of them and trying to convince myself to let em ride.", "score": 1, "replies": []}]}, {"body": "Was thinking about rolling my Jan calls all morning but didn't. Godspeed, everyone.", "score": 2, "replies": [{"body": "Well shit. Doesn’t seem like the mkt likes it.", "score": 3, "replies": [{"body": "Not looking good, but that's the way she goes boys", "score": 2, "replies": [{"body": "So. Lame. Beat on rev and earning. What more could people want.", "score": 3, "replies": []}]}]}, {"body": "Me too. For the last month really. Fuck it. See what they got to say on the call.", "score": 2, "replies": []}]}, {"body": "Get on some June 2021 calls. This has got to correct by then.", "score": 2, "replies": [{"body": "What strike. \n\nShit trades up and down. Likely ideal for a swing trader. I’m just pissed. Like. WTF. They didn’t give a forecast so banks sell it off. Like. Isn’t that the analysts job. To figure that shit out and trade on it. Nobody is giving forecasts during Covid. How is that a surprise. \n\nDammit.", "score": 1, "replies": [{"body": "I got in some 300c, I’m pretty sure it’ll only take a few good days to get there. But, you know the risk.", "score": 1, "replies": [{"body": "Well. I thought 300 was free money 90 days ago but here I am. But if I wasn’t for the fact that I’m in a fit of rage today....and had sold yesterday....that’s exactly what I would have done today.", "score": 2, "replies": [{"body": "Yes, I had some losses from the UPS earnings from last quarter. I feel ya.", "score": 1, "replies": [{"body": "Still bag holding that shit also. Bout to yolo on some dumb tech or ev or steel crap. \n\nI just feel like they arnt factoring in all the old people who have been forced to order online that have always held off due to lack of tech savvy. Once they are hooked they will start buying on their phones just like everybody else. This shit (mentality) is here to stay.", "score": 1, "replies": [{"body": "Yea, I’ve put a good amount into Steel, not entirely convinced that it’s not a pump and dump, but I’m taking chances. Some of the analyst upgrades seems to be legit, but the shit has already had a good run so far, hopefully not too late to get in.\n\nAnd you are right about old people, some old farts I know are clearly hooked now. Ordering all sorts of random shot off of Amazon.", "score": 1, "replies": [{"body": "Less of a pump than the other shit on here. Hard to fuck with global commodities unless your JP Morgan. But I’m sitting on the sidelines- thinking about playing theta gang for a while and lick my wounds—-rebuild the stash. Can’t make moves without a bankroll. \n\nRight. It’s like we have fast forwarded 10 years. Adoption of online ordering is through the roof. Doesn’t need to be everything. Just a few percent a year of purchases by people they previously made at the mall but now online and it’s a huge boom for transports.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**FDX**|**$250**|**BUY CALL**|**2021-01-15**|**$41.84**|**$288.225**|**5136**|**2**\n|**FDX**|**$300**|**BUY CALL**|**2021-01-15**|**$10.43**|**$288.225**|**7020**|**329**\n|**UPS**|**$200**|**BUY CALL**|**2021-01-15**|**$0.51**|**$171.48**|**13189**|**13**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckisz00lsg5680774dy3k9ng9) | [Track Record](https://www.pickmojo.com/user/bojangleschikin/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}]}
