{"title": "Thanks TSLA and others for my road from 30k to risk-free 175k!!", "selftext": "", "id": "khtsny", "created_utc": 1608596033.0, "score": 34, "upvote_ratio": 0.87, "num_comments": 72, "comments": [{"body": "Congrats man! \n\n&#x200B;\n\n&#x200B;\n\n^(you better buy a fucking Tesla with that cash)", "score": 15, "replies": [{"body": "Haha naw gonna use it to short Tesla soon.  I am not a typical wsb’er, I lean short more often than long", "score": 8, "replies": [{"body": "Gay", "score": 15, "replies": []}, {"body": "Why don’t you just send me your money. You are going to loose it quicker then you made it son. Pick any trade besides shorting tsla.", "score": 5, "replies": [{"body": "Down she goes.  Better get on that life raft before the T sinks", "score": 1, "replies": []}, {"body": "Thanks for your concern, I’ll try to not lose too much.", "score": 1, "replies": []}]}, {"body": "Are you looking at leap puts or riding the inclusion hype down. Give a fellow retard some guidance pls.", "score": 3, "replies": [{"body": "I am waiting until I get some signals and confirmations.  I don’t do much long term\nOption positions", "score": 3, "replies": []}]}, {"body": "Even i want to make similar debt but was waiting for a upmove wave from funds due to s&p inclusion.\n\nWhat's your take on that?", "score": 3, "replies": [{"body": "My general take is that I am bad at predicting the future so, I’ll wait until I see some signal that the trend has changed", "score": 2, "replies": []}]}]}]}, {"body": "Nice play", "score": 3, "replies": []}, {"body": "Jesus, ballsyyyy", "score": 3, "replies": []}, {"body": "How does this work, you want it to stay between 600 and 650?", "score": 3, "replies": [{"body": "Actually closest to 650 is best. But I already sold it.  Paid 10.4 on Friday, played the IV crash and sold today for 20.", "score": 3, "replies": [{"body": "So it's +1 600c. -1 650c. +1 700c. And you want to do this when iv is high?", "score": 4, "replies": [{"body": "A butterfly works on basically 2 call spreads, one being debit one being credit.\n\nSo in his case:\n\nOne 600c buys to score dolla bills\nTWO 650c sells to score theta bills\nOne 700c to cover his ass in case everything goes to shit and tesla skyrockets to a million. \n\nIt's amazingly cheap to get into but rewarding if done right.", "score": 6, "replies": [{"body": "That's so fucking cool. Mind blown.", "score": 3, "replies": []}, {"body": "Ok what do you think about a Jan 15 FEYE 20/25/27 butterfly call?", "score": 3, "replies": [{"body": "The rules to butterflies is you use a time span and target you think it will hit but not exceed. I'd have to look at feye and see what their DD, ta, and other shit tells me and quite frankly I'll be wrong.\n\nGenerally, you want short term butterflies and you never want the price to exceed the middle 2 sell positions. In your example, if the strike price on January 15th ends at exactly 25.00 flat, you win the most money possible. That's called \"pinning the butterfly.\"\n\nIf it goes above, you may be in trouble.\n\nIf it goes below, we'll it depends how low but generally you'll be OK as long as it's above the lower strike call.", "score": 4, "replies": [{"body": "But you want to be theta possitive usually? And iv percentile low or high? Or is it an IV nuetral play. I picked fire eye because there's upward momentum but really high iv", "score": 2, "replies": [{"body": "Iv doesn’t really matter since your buying and selling. Butterfly’s are tough because the theta has to decay ALOT for the sold options. It can be sitting on the sold strikes exactly 1 day to expiration and still have over 30% of its time value caked in", "score": 4, "replies": [{"body": "Good info! Thanks for the help", "score": 2, "replies": []}, {"body": "Do you ever enter or exit this type of position in stages? Like maybe closing the short ends while they're profitable and later the long ends on a day when they recover? Or starting with debit spread and then adding the credit spread when the share price range is more defined?", "score": 1, "replies": [{"body": "This won’t work because you need to allocate a SHITLOAD of capital to close the short options while keeping the long ones open. Legging in with spreads will work it just requires you being a sniper", "score": 1, "replies": [{"body": "Not if the share price dips after you enter the position. \n\nAnd if your long a naked call thats printing from an iv spike, or you feel like it's close to the top or about to go flat for a while, why not sell a cheaper call against it? Like diagonal debit spread aka fig leaf, but also simultaneously open the credit at the same strike, a diagonal fig leaf butterfly spread if you will, with your most valuable leg at a further experation.\n\nEdit: no your right entering the position doesn't give you any cash, what was I thinking, sorry", "score": 1, "replies": [{"body": "Someone is trying to give you valuable information and the first thing you wanna do is try and prove them wrong. Let what you just did sink in", "score": 2, "replies": [{"body": "My humble apologies. Thank you for helping me.", "score": 1, "replies": [{"body": "All good my dude", "score": 1, "replies": [{"body": "Master, please help me understand. \n\nSo I've been using this strategy and i love it. \nI use option profit calculator to help me wrap my smooth brain around the concept, but some times I show greater returns the than calculator predicted, is this my que to exit the spread?", "score": 1, "replies": [{"body": "I’m assuming this is probably due to the underlyings IV changing , you can actually update that on that site if you drop the manual entry tab down. \n\nHard to say when the right time to take profit is, tight butterflys don’t decay much until the very end , so you might not easily get filled. I would be more inclined to take profits early on a wide iron condor decaying at a steady rate than a butterfly which will lose most of the value in the final week", "score": 1, "replies": [{"body": "Yeah its from the IV drop. It seems each of greeks will fluctuate between positive and negative values depending on the share price movement, its quite fascinating. I've even used this strategy to speculate a steadily increasing share price with success. \n\nI'll play around with manual entry on opc.com\nDo you know of a better way to calculate potential profits?\nI already use the analyze tab in TOS.\n\nAlso, are you saying that butterflies loose value because of the likely hood of share price moving out of the target range? or are you saying that they profit from the decay mostly during their final week but have low volume and liquidity?", "score": 1, "replies": [{"body": "The analyze tool is your best bet. Yes that’s basically the reason , a tight butterfly will easily leave the sweet spot on expiration day and go from a 150% gains to 0% by the time it expires. Has happened to me plenty. Stay away from illiquid underlyings, you will have a hard time even getting fills to close the butterfly at all", "score": 2, "replies": [{"body": "Oh great and mighty one! I beseech you once more. Let's say i have crystal ball and I just know I can pin a butterfly... How do you achieve that maximum potential displayed the day after expiration by most analysis tools. Do you have to sell the long itm leg on Friday and let your short middle leg die slowly over the weekend? That would require collateral? Could you sell one debit spread out of the butterfly and let the credit spread die?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "In my defense the company I had in my mind during my response has a very low share price and my strategy would have been feasible. But no you're right, I should never question anything a stranger on the internet tells me.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "So do you enter this position in stages or just all at once.", "score": 3, "replies": []}, {"body": "I have opened several butterflies in Tesla but they are so hot or miss when it comes to opening and closing.  Are you legging into them or selling them on a single order?", "score": 2, "replies": [{"body": "I open and close generally at the same\nTime.  It could be multiple orders.", "score": 2, "replies": []}]}]}]}, {"body": "Currently hoping a condor on Spx expiring Christmas Eve.  So long as we stay above 3670 and below 3730, I will hold this position.  If we breach either, I will exit and take whatever profit/loss that exist at that time current position[current Spx position](https://imgur.com/a/vdv1uh5)", "score": 3, "replies": []}, {"body": "How aggressively above midpoint are you bidding to get filled on flies with IBKR? Not getting fills is the main reason I don't really trade flies. Figure maybe it's something to do with the way they are order routing, or maybe slippage is just the pay to play.\n\nNice trade btw. I was trying to fade the vol on a 70 90 110 on QS Dec 31s. Take a look at it tell me what you think.\n\nBtw, we've had a similar journey. I started trading a little more seriously and turned 30k into 160k, started the account run on November 19th. Congrats to you.", "score": 3, "replies": [{"body": "I don’t want to mess with QS as I have no idea how much longer it’ll melt up for.  One could have made similar case 20 30 50 points ago and you’d be screwed.\n\nI’m actually a long time serious trader just taking a break and screwing around posting.  I average over 500k contracts a year for many years, been trading since 1999, been through many rallies and crashes.\n\nJust trying out IB but had been doing most of my trading with TD as I have a negotiated rate of 15 cents a contract w them with my volume.", "score": 4, "replies": [{"body": "Good point \n\nYou made a career mostly trading surface dynamics? I've dabbled as a youngster for 10 years or so. Trying to make the move to become a professional and taking the education and learning more seriously.\n\nBeen spending a lot of time going down the fly / rr rabbit hole lately. Is it a liveable rabbit hole?", "score": 2, "replies": [{"body": "I’m always adapting to the environment.  For this week, I’m expecting contracted range so using flies.  But come next year, I expect increasing IV and potential acceleration down, and in this situation I would not be using flies", "score": 2, "replies": []}]}]}]}, {"body": "When did you open your position?", "score": 2, "replies": [{"body": "Friday at around 12:30 pst", "score": 6, "replies": [{"body": "Wow. Nice work", "score": 2, "replies": [{"body": "Don’t usually post here.  Posting screenshots here is a pain.", "score": 5, "replies": []}]}]}]}, {"body": "Seems so obvious in hindsight.  Do you ever use this strategy around earnings?", "score": 2, "replies": [{"body": "Earnings can be tough.  I don’t like playing earnings", "score": 2, "replies": [{"body": "When do you like to use it?", "score": 2, "replies": [{"body": "I turned 130k into 900k in March in this fashion.", "score": 6, "replies": [{"body": "Niiiiice", "score": 2, "replies": [{"body": "But I’m an old school trader, been trading since 1999, so definitely am not a typical WsBer", "score": 3, "replies": [{"body": "I like this.  I chased otm options for 3 months before one finally hit big. Lottery ticket.   Then been losing again looking for something new.", "score": 2, "replies": [{"body": "Yea I try to stay away from gambles and short term moves with some cushion, and exit very aggressively as needed. [March run](https://imgur.com/a/hHuaQsr)", "score": 2, "replies": [{"body": "That’s awesome, those were butterflies?", "score": 1, "replies": [{"body": "The tsla trade was a butterfly yes", "score": 1, "replies": [{"body": "What was spy?\n\nEdit: spx", "score": 1, "replies": [{"body": "Spx was a condor", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I still view it as, do I have a reasonable idea of future prices.\n\nFor example, I’m holding a condor on spx, with the inner legs at 3680 and 3720, expiring 12/24,\nAt a cost basis of 20, 40 wide wings", "score": 3, "replies": [{"body": "Teach me your ways", "score": 3, "replies": [{"body": "As it relates to specific trades, it’s a little tough as I am constantly entering and exiting trades.  I manage my trading by constantly taking out profits and then going a bit yolo with profits.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Just because you don't understand the risks and got lucky, doesn't mean it's risk free.\n\nCongrats.", "score": 2, "replies": [{"body": "When I say risk free, it means I’ve withdrawn my original risk capital out, playing with house money.  I trade hundreds of thousands of contracts a year, so I wouldn’t assume too much since you don’t know who I am.", "score": 7, "replies": [{"body": "Are you Cassandra?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Nice", "score": 4, "replies": [{"body": "Niiice", "score": 2, "replies": [{"body": "Noice", "score": 3, "replies": [{"body": "Nurses", "score": 3, "replies": [{"body": "Do it better", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Time to withdraw some of the gains.[money out](https://imgur.com/a/x54MrFa)", "score": 1, "replies": []}, {"body": "Congrats fuck you", "score": 1, "replies": []}]}
