{"title": "Alibaba following CCP crackdown; time to pull out?", "selftext": "So I've been reading about the CCP essentially trust-busting Alibaba and wondered what the futur rod Alibaba stock would look like.\nAs it gets partitioned into various entities- CCP tells Alibaba to stick to being an online payments platform like PayPal- what will happen with its other entities?\nWill they each get listed individually, will they get a new group to manage them? \nWhat about Alibabas share price?\n\nWhat does everyone think ?\n\nEdit: consensus seems to be\n1) This uncertainty is the cost of doing business in China\n2) China will not let Alibaba collapse\n3) people will buy after it drops specified amounts", "id": "kl4461", "created_utc": 1609077620.0, "score": 21, "upvote_ratio": 0.74, "num_comments": 71, "comments": [{"body": "Yes panic sell low and buy back higher with fomo.", "score": 65, "replies": [{"body": "I can already see an article \"Ma and Xi reach an agreement\" and price > 300", "score": 15, "replies": [{"body": "or \"Ma has been assassinated\" price > 100", "score": 10, "replies": [{"body": "Price rises to 4k surpassing amazon because ma has forfeited his right to fuck up baba further", "score": 6, "replies": []}, {"body": "Ma is no longer leading the company.", "score": 3, "replies": [{"body": "Well he led the share price down pretty good.", "score": 1, "replies": []}]}, {"body": "Greater than 100?", "score": 2, "replies": []}]}]}, {"body": "This aged like milk   :)", "score": 0, "replies": [{"body": "??? 212>227 ok.", "score": 1, "replies": []}]}]}, {"body": "No, I will be buying even more on Monday", "score": 18, "replies": []}, {"body": "Cathie is still holding BABA. I don’t have big enough balls to buy just yet but If you’re already holding IMO just wait and see what happens. Scared money don’t make money.", "score": 27, "replies": [{"body": "Im looking to add BABA soon. I wonder how much of this panic is from people falling for the China Bad meme.\n\nIf investors like Ray Dalio and Cathy Wood hold BABA, I'd trust that much more than reddit posts.", "score": 12, "replies": [{"body": "pretty much every emerging market ETF has BABA as a top holding.", "score": 8, "replies": []}, {"body": "Where can you find out if Dalio or Wood hold BABA or if they bought or sold?", "score": 2, "replies": [{"body": "[https://ark-funds.com/trade-notifications](https://ark-funds.com/trade-notifications) \\- Cathie Wood", "score": 4, "replies": [{"body": "Thank you.", "score": 2, "replies": []}]}]}]}]}, {"body": "This is an ego contest between Jack Ma and the CCP.  He ignored orders and took ant public.  Now the party will remind him that he is not above them and he will pay large fines and come back under the fold, or he’ll end up having a fatal car accident.  Either way baba will be fine.", "score": 13, "replies": []}, {"body": "Buying opportunity. Ccp has no interest in breaking up the company or seriously hindering their biggest economic success story. This is about saving face, small fines, some oversight and safeguards for cpnsumers.", "score": 52, "replies": [{"body": "What he said.", "score": 8, "replies": []}, {"body": "Why wouldn't they? They could, for example, split Ant Financial from Alibaba and reduce it a payment fintech, and split Alibaba's cloud business from it's shops. In a way, rather than having some Google-like megacorp which necessarily has some political power due to sheer size, they would end up with SQ+NET+SE, and every of these new smaller corps being a huge sucess story by themselves. However, the resulting corps would be more manageable for the CCP.\n\nI see that as a realistic possibility, just like the CCP and Ma coming to an agreement next week. Who knows what goes on in the inner circles of this autocracy?", "score": 3, "replies": [{"body": "A google like mega Corp that’s controlled by the CCP. It’s like the CIA’s wet dream.", "score": 1, "replies": []}]}, {"body": ">small fines\n\nLarge kick-backs to the right people...", "score": 2, "replies": []}, {"body": "[deleted]", "score": -14, "replies": [{"body": "they surely like power and $$ destroying BABA cannot replace the Amazon of Asia in a day. Maybe they get fucked by a Japanese or Singaporean rival and lost billions and power. Amazon is power. BABA is power.", "score": 6, "replies": []}, {"body": "Worst take of the day goes to...", "score": 8, "replies": []}]}]}, {"body": "Jack Ma is a good man, he doesn't rape women unlike the dude from JD.com. It will go up again as long as he keeps his mouth shut.", "score": 7, "replies": []}, {"body": "BABA is on my short list atm \n\nim looking for another 10-20% drop and then i will buy and hold it.\n\nNo way china is fucking up their biggest success and if they do: win some, lose some and go on with your life :)", "score": 14, "replies": [{"body": "You think that drop will come? And if it doesnt, is a 40% discount not enough? Just asking. \n\nTo me it seems one of the most popular stocks among analysts and a great company thats too big to fail is now on firesale, for a very limited time, because somehow everyone is scared of an implausible worst case scenario. I understand the 'lets wait how this plays out' sentiment of some people but thats not how you make money.\n\nSome of the language about Ant from regulators is somewhat concerning especially the 'stick to payments' stuff but I feel like they wont completely obliterate the lending business just refine it. Even then Alibaba is a lot bigger than (parts of) ant. Ccp is afraid Ant will replace banks, kinda like the panic there was when FB decided to take a stab at money. FB did fine though.\n\nEven though China is not a democracy I always laugh when Xi or the party is portrayed as some irrational dictator.", "score": 9, "replies": [{"body": "I agree that the ccp is not insane and isn't looking to kill their tech sector.\n\nProblem is timing the bottom. There may be  more updates coming regarding baba/ccp that may be considered bad news, causing the stock to go down another 5 or 10%. \n\nAlso, recovery of the stock may take months if the ccp issue is not clearly resolved. Baba also hasn't recovered yet from the Ant IPO fiasco in October because the situation around Ant remains unclear.\n\nI think prospects are looking ok if you're looking at holding > 1 yr, but it may be a bumpy ride.", "score": 3, "replies": [{"body": "You're right. I loaded up thinking this might go back to 240 within a week, 280 in a few months, but if it doesnt, Im perfectly comfortable with holding for a year plus to get a 30 percent profit.", "score": 4, "replies": []}, {"body": "political squealing childlike fall yam reach absurd homeless practice beneficial\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 3, "replies": []}]}]}]}, {"body": "Alibaba will go down further before turning around. I am looking to increase my position around $200.", "score": 4, "replies": [{"body": "Lets hope so.  We might get a dead cat bounce tomorrow though", "score": 2, "replies": [{"body": "Perhaps not. They are up right now in the HK markets on news of the increased share buyback.", "score": 2, "replies": [{"body": "Down 8% and still falling...\n\n[https://www.google.com/finance/quote/9988:HKG?sa=X&ved=2ahUKEwj\\_6NqNvO\\_tAhXE6Z4KHX1wCkUQ3ecFMAB6BAgCEBk](https://www.google.com/finance/quote/9988:HKG?sa=X&ved=2ahUKEwj_6NqNvO_tAhXE6Z4KHX1wCkUQ3ecFMAB6BAgCEBk)", "score": 4, "replies": [{"body": "Yep, not good. It was up a touch last night. Feel on the new news that the CCP has ordered ANT to go back to payment processing only.", "score": 1, "replies": []}]}]}]}]}, {"body": "Look at the dips in the Tencent and Facebook price graphs in 2018. High chance this will turn out the same.", "score": 9, "replies": [{"body": "What’s the correlation here? Did CCP investigate them too?", "score": 0, "replies": [{"body": "tencent yes and fb was under testimony don't you remember?", "score": 5, "replies": [{"body": "No I don’t remember the FB under testimony by the CCP. Must have missed that news story.", "score": 0, "replies": []}]}]}]}, {"body": "Already bought the dip and will buy more if it goes to 200.", "score": 4, "replies": []}, {"body": "The main issue the regulars have with Ant is they have moved from being PayPal to Wells Fargo. Ant now offer banking services such as loans, but they don't abide by banking rules such as minimum reserve requirements. Hence, \"Regulators ordered Ant Group to establish a financial holding company and hold sufficient capital.\" \n\nThis may affect Baba's stock price short term. But from a governance perspective, it's the right call. You can't just let an entity lend money that they don't have without grounding them with rules and regulations. Otherwise, it may trigger a financial crisis down the line. I'm actually quite surprised it has taken this long. I don't think this would fly in the US either. Look how fast the Congress shut Facebook down with its Libra coin idea. You don't mess with central banks, period.", "score": 4, "replies": [{"body": "Especially considering that the PRC has a lot of experience with financial market instabilities and there still exist many local banks who are a mess and would be put into administration in most western countries. China has to force-merge some small local banks with their huge govt-owned banks all the time.\n\nWhile local governments are a corrupt mess, the central govt is well-aware that the PRC does not have an financial market with the same stability as US,CA,EU", "score": 2, "replies": []}]}, {"body": "Averaging down. I thought I was getting a deal buying in under 300. Long term hold for me but probably isnt even a bad short term play", "score": 3, "replies": []}, {"body": "I’m loading up. BABA will be €600 by 2025.", "score": 3, "replies": []}, {"body": "Looks like the government is willing to cripple Ant Financial's scope of operations: [Bloomberg source](https://www.bloomberg.com/news/articles/2020-12-27/ant-turning-from-windfall-to-nightmare-for-its-global-investors?srnd=premium-asia)\n\nAt this point I view an agreement next week just as likely as the government starting to split up Alibaba and Ant Financial. The question is if the foundation of all these problems is someone powerful having a grudge with Ma which can be solved by Ma personally caving to demands, or someone powerful viewing Ma's and Alibaba's economic clout as a fundamental danger. How can we know at this point with such an intransparent government?\n\nI decided to realize some losses to transfer stocks where I am more convinced that they will go up short-term. I wouldn't blame anyone who at this point decides to exit Alibaba totally.", "score": 4, "replies": []}, {"body": "I bought in March and added Thursday.", "score": 2, "replies": []}, {"body": "I know it is unlikely, but IF Ali Baba were to be forced to split, would us holding BABA just get our shares split in the other companies to spin off of BABA?", "score": 2, "replies": []}, {"body": "Though i sense more pain on the horizon, i made the Buffet play and bought into the fear 15 shares 215$", "score": 2, "replies": []}, {"body": "What surprised me the most is not that the regulators cracked down, but the fact they even needed to. I was under the impression Alibaba was deeply connected with the Chinese state, which is why I invested in the first.....how can you lose when you have the state backing???? I wanted to invest in China. Alibaba was a representative of that. Believe it or not, China is just getting started.", "score": 2, "replies": []}, {"body": "Buying more on each drop .  This is a bargain basement deal that cant be resisted .  I hope it goes to 190s if so Im backing up the truck", "score": 2, "replies": []}, {"body": "Do it. Buy high sell low is the key to success.", "score": 2, "replies": []}, {"body": "This is the danger of investing in Chinese companies, in my opinion, and BABA is clearly in the crosshairs. I would wait to see how this plays out.", "score": 3, "replies": []}, {"body": "I bought when down 30%. Wait and see.", "score": 2, "replies": []}, {"body": "Antitrust is coming in the US as well. \n\nChina is just pulling the bandage off early.", "score": 2, "replies": []}, {"body": "It is a long term hold for me and will probably buy more.", "score": 2, "replies": []}, {"body": "To be honest, as half Chinese I would see this happen long ago, this is why I invested in Tencent.\nJack Ma is a problem he is a threat for CCP because he is famous, loved, followed and too close to western ideas. Now this is what you get in a totalitarianism country, you get shut down.. \nHopefully the stock will grow back I m’en it’s still one or the top 2 biggest Chinese company ...", "score": 1, "replies": []}, {"body": "Y'all think China won't actually anti trust, cripple BABA, seize the means, and nationalize it? China has been here for 5000+ years. They can play the long game. They can play until Jack dies of old age. But they won't because they also need to make him bend the knee", "score": 0, "replies": [{"body": "What does China having 5000 years of history have to do with anything?  Lol.\n\nYou may want to look at how many dynasty came and gone.", "score": 1, "replies": []}, {"body": "People seem to have forgotten that governments all over the world are willing to seize companies or influence business decisions whenever they feel the need to. National flag carriers are quite often taken over by governments even before the airline is declaring bankruptcy. The financial crisis turned out in the nationalization of GM, banks in the US and Europe...in Germany, the government bought majority-ownership of suppliers to military and pharma industry a few times when they found out that companies with deep relations to the PRC govt want to take them over. Such things happen even in capitalist democracies, why wouldn't the CCP take even harsher action if it feels the need to do so.", "score": 1, "replies": []}]}, {"body": "BABA probably has good value, but I avoid stocks from volatile nations like China and Russia and it's important to remember that BABA actually doesn't have equity in Alibaba", "score": 0, "replies": [{"body": "The non equity thing means nothing. JP Morgan knows this. C Woods knows this. It's not some huge conspiracy or secret, every single chinese stock works this way, and MMs and HFs love BABA. Those people know this stuff inside out much better than reddit.", "score": 4, "replies": [{"body": "Yahoo knows this also and got screwed. Everyone  knows this. The risk is in ccp targeting the company which it looks like they are doing. Now ofcourse to what extent who know.", "score": 2, "replies": []}, {"body": "I'm a more conservative investor, so I tend to stay away from companies with any foreign risk.\n\nImo if you wanna look at Wall Street's involvement with BABA, there's a major institutional sell off; if I were to invest in BABA, I would buy a slim amount right now and wait for a base to form.\n\n>chinese stock works this way\n\nWhich is why Chinese stocks tend to look undervalued on foreign markets, there's too much risk from the CCP and not enough safeguard like the SEC provides in the US.", "score": 1, "replies": []}]}, {"body": "Hold up, what is BABA then?", "score": 1, "replies": [{"body": "It's a variable interest entity (VIE); since no foreign entity is allowed ownership of Chinese strategic assets, how BABA works is that it owns a shell company in the Cayman Islands that is under contract to earn profit off of Alibaba's Chinese assets rather than owning them or any equity.\n\nSo it's risky, especially if the CCP chooses to break up Alibaba (which I doubt will happen), because BABA has zero equity in Alibaba.", "score": 4, "replies": []}]}]}, {"body": "too late for apologies. maybe another 10 % more to go.", "score": 0, "replies": []}, {"body": "Why are so many weird accounts asking this question is my question?", "score": -1, "replies": []}, {"body": "https://amp.scmp.com/tech/policy/article/3115399/alibaba-antitrust-probe-ceo-affirms-commitment-regulated-development", "score": 1, "replies": []}, {"body": "$ laundering. People prefer to put their savings into Baba, Wechat pay.  In China homeless carry a qrs card asking for donation, at the end of day collect their income minus commission and deposit in their own account.\n\nThe fear is these private sectors using higher interest to possibly impact state banks and if there is a default they are not insured like state banks.", "score": 1, "replies": []}, {"body": "https://www.google.com/amp/s/news.cgtn.com/news/2020-12-27/Antitrust-probe-into-Alibaba-Group-concludes-WyP5l7H4nC/share_amp.html 'crackdown'", "score": 1, "replies": []}, {"body": "Just in --  Alibaba Group increases share repurchase programme to $10 billion\t\n\nREUTERS 7:18 PM", "score": 1, "replies": []}]}
{"title": "What stocks should i invest right now?", "selftext": "Hello guys !\n\nAfter some research , watching some videos , reading some books and articles about stocks and about financial education i've decided to starting entering in this world of investing.\n\nMeanwhile, i don't have any experience on really buying stocks and what stocks could be profitable in 2,3 or even 5 years later.\n\nI'm starting with 200€ and putting every month 200€ euros to investing. With that amount of cash in what companies/industries should i invest? NIO? TESLA? Tattoed Chef?\n\nAnd what strategie do you guys think i've should follow ? Put the ammount on 3 or 4 stocks , waiting like 5 years and then sell it to build a new portfolio?\n\nI'm here to hear all of your advices cause i'm new on this!\n\nCheers!", "id": "kldibo", "created_utc": 1609109820.0, "score": 24, "upvote_ratio": 0.68, "num_comments": 69, "comments": [{"body": "Welcome to the shitshow! buckle up", "score": 72, "replies": []}, {"body": "Best three pieces of advice I can give: 1. diversify your portfolio. 2. Don't panic sell. 3. always do your own dd\n\nSome specific stock recs:\n\nFor the safer ones - go for blue-chip stocks - these are established companies that have long histories of growth like AAPL, MSFT, FB... \n\nLook for stocks in disruptive industries with potential for mass growth - right now I would say EV falls into that category (like NIO - but would steer clear of NKLA) as well as Telehealth companies (like AMWL - Google invested 100 million into them - still trading below $30 -  potential for huge long term gains)  \n\nInvest in whole industries through ETFs - i like the ARKs and JETS - i think it will rise once things open up more. \n\nOn that note - look for established companies that are suffering from the pandemic but you have hope will rise to their pre-pandemic stock price once things open - i like UAL and some of the cruise lines", "score": 42, "replies": [{"body": "JETS wasn’t doing great before the pandemic when all airlines were at peak operation. 5 year chart on that ETF should tell you that it’s not really going to move much higher that previous ATH.  I really don’t see it surpassing its ATH once everything does open back up. There are better ETFs out there or even individual Airline stocks might offer a better roi .", "score": 5, "replies": [{"body": "You're right, not the best one to go in on now. I got it at $12 and am up 73% so i like it, it's at 22 now and usually trades in the 30s so not horrible growth potential -  but other ETFs or airlines will probably be better for OP", "score": 2, "replies": [{"body": "Good for you I looked at it but want sure why it never crossed that mid $30 range", "score": 1, "replies": []}]}]}, {"body": "and stick to your plan.\n\n&#x200B;\n\ni bought zeal network when they used to be tipp24, they lost a lot of money when an EU lawsuit followed (they are an online casino seated in gibraltar to avoid casino/tax laws) their course crashed. i bought a bit more. lots of discussions on forums about them being low. Zeal network said : no dividends, no money, need to save money for our lawsuit we will win. I always said its just about having balls of steel and waiting it out. Last year after around 6 years i lost patience and sold 80% of my stock to book some losses vs my winnings. a couple months later zeal network annouced that the lawsuit is finally settled and they can now print money for all their shareholds - big dividend increase and course increase by 150% followed. with the ramining 20% of the stock im up 110% from the course if bought it for. Thats just sometimes how it goes....", "score": 1, "replies": []}, {"body": "Especially don’t panic sell", "score": 1, "replies": []}]}, {"body": "The opposite of what this sub suggests.", "score": 17, "replies": [{"body": "Nice user name!", "score": 2, "replies": [{"body": "Haha thanks! Been a while since I listen to him. Think I bumped his jams for a year straight when I first discovered him.", "score": 2, "replies": [{"body": "I have caught his show a few times at Red Rocks. Great stuff!", "score": 1, "replies": []}]}]}]}, {"body": "Square SeaLimited Shopify", "score": 5, "replies": []}, {"body": "PLTR", "score": 5, "replies": []}, {"body": "Literally anything ark.", "score": 32, "replies": [{"body": "You Noah or what!?", "score": 5, "replies": []}]}, {"body": "CRSR", "score": 14, "replies": []}, {"body": "Don’t fall into the WSB (fall into the meme) trap. You can pick underdogs, but don’t YOLO something unless you are aware of the risk. This is a new phenomenon proliferated by an expanding network of traders.", "score": 5, "replies": [{"body": "indeed, my dad has always said you can maybe spend 15-20% on YOLO. I have been following this philosophy but you need some capital to start making money with YOLO. I.e. I yoloed tesla stock and it turned out well for me. I also yoloed cannabis stocks which didnt. but overall made good money with yolo stocks - just need to have some other capital to hide behind and not loose it all.", "score": 5, "replies": []}]}, {"body": "ICLN", "score": 6, "replies": []}, {"body": "$PLTR if you’re looking for a 40% gain in 30-45 days", "score": 42, "replies": [{"body": "As a PLTR bag holder, I hope you're right but am cautiously optimistic", "score": 27, "replies": [{"body": "I believe there will be a nice run up leading up to Demo Day in January and Q4 Earnings in February. Then the lock up period shortly after might not be good.", "score": 8, "replies": [{"body": "Yeah I'll definitely be fully getting out of PLTR and rebuying after lock up", "score": 5, "replies": [{"body": "When and what exactly (or approximately) is this lockup? Sorry, I've retard.", "score": 8, "replies": [{"body": "3 days after their next earnings release", "score": 3, "replies": [{"body": "So sell 2 days after earnings, got it !", "score": 6, "replies": []}]}]}]}, {"body": "Everyone on reddit is claiming they will try to get out before the lockup, and this leads me to believe it could actually go up instead.", "score": 2, "replies": [{"body": "I can definitely see that", "score": 1, "replies": []}]}]}, {"body": "What does ‘bag holding’ mean in stocks", "score": 3, "replies": [{"body": "It means you bought a position in a given stock hoping to sell at a profit on the sooner side (as opposed to long term investments), but after you bought it the price falls and stays lower. Basically you are stuck waiting indefinetly which is called bag holding in the short term trading community.", "score": 20, "replies": [{"body": "I don't think it only applies to short-term backfires.  I think of it as any stock you're significantly down on.", "score": 5, "replies": []}, {"body": "Understood thanks!", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "They probably bought at the ATH around 30 something.", "score": 3, "replies": []}]}]}, {"body": "RemindMe! 38 days \n\n(that’s the middle of 30 and 45)", "score": 1, "replies": [{"body": "Good! That’s $38.85 per share. \nI will teach you botboy", "score": 1, "replies": []}, {"body": "I will be messaging you in 1 month on [**2021-02-04 05:41:23 UTC**](http://www.wolframalpha.com/input/?i=2021-02-04%2005:41:23%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/kldibo/what_stocks_should_i_invest_right_now/gh9iols/?context=3)\n\n[**6 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fkldibo%2Fwhat_stocks_should_i_invest_right_now%2Fgh9iols%2F%5D%0A%0ARemindMe%21%202021-02-04%2005%3A41%3A23%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20kldibo)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Yesssir, as Reddit forseees. Trading my DELTA -> PLTR!", "score": 1, "replies": []}]}, {"body": "Im new too, so take my advice with a sandbag sized grain of salt. \n\nGenerally, i have good luck with index funds. The ones im holding now are TAN, VTI, ARKK, and FTEC. Honorable mention is PBD. The best performing one ive held is TAN.\n\nThey say diversification is key for safe investing, and i agree. In cases where you dont have large amounts to have invested (5k and up) though, i wouldn't diversify too much so you can grow your portfolio's worth overall. \"Invest in your better performing stocks and let em run\", is what a more successful investor told me.\n\nI personally diversified too much and was in the red for a month because of it (1.5k initially, went down, I'm BARELY in the green now). Let me know if you want me to elaborate my story a bit more. \n\nAlso, historically speaking, index funds are generally the safest and least volatile investments. Keep this in the back of your mind. Single stocks may have better performance (looking at you, NIO and PLTR) in a given year but are generally riskier. Also fuck citron. Motherfucker shorted NIO and i panic sold. \n\nGood luck friend, i hope this helps", "score": 5, "replies": []}, {"body": "Some say international growth.", "score": 3, "replies": []}, {"body": "Depends whether you’re looking long term, or just for a short term trade. If long consider some of the names that were depressed by Covid and still haven’t bounced back all the way. BP one example.", "score": 3, "replies": []}, {"body": "IPOC", "score": 3, "replies": []}, {"body": "BABA", "score": 7, "replies": [{"body": "Currently to risky. Once all fraud-ish shit is cleared, then I'd look into it again", "score": 4, "replies": [{"body": "And once that happens it will be trading at ATHs again and you would have missed the opportunity.", "score": 13, "replies": []}, {"body": "It'll be too late by then. Gotta get in now.", "score": 6, "replies": []}, {"body": "You'll miss the move, Ace", "score": 1, "replies": []}]}]}, {"body": "Index funds and blue chips", "score": 4, "replies": []}, {"body": "What are your investment goals? How much time to do you want to spend researching stocks and strategies? What's your risk tolerance?\n\nThere isn't a right or wrong investment. If you want extremely high risk (a decent chance of losing the majority of your investment) then go ahead and invest in EV stocks like NIO and TSLA. There is potential upside to both, but you should probably have a thesis for why TSLA is worth more than $640b.", "score": 2, "replies": []}, {"body": "I would recommend start collecting some investments to act as \"cornerstones\" for your portfolio. These should be index fund etfs that are well diversified. Some that come to mind are VOO/SPY that tracks the S&P 500, VGK for European markets or EWG for Germany. Once you have some accumulated keep adding to them whilst trying your hand at stock picking. Do try to limit it relative to your entire portfolio.\n\nSome extra conservative investors would recommend not stock pick at all and just keep to etfs, but that is sometimes unrealistic. Etfs give you returns that markets average, which is great and beats most retail and professional investors in the long run. But should you want to get above average returns you would still have to gamble a bit. Just know that stock picking has larger risks alongside its potential larger rewards, and to always do your due diligence before entering into a position.\n\nLastly to answer the time period of investing, the simple answer is to hold good investments forever. So keep revisting the companies you have invest in periodically to see if they are still doing well. Another consideration would be where you are located and the tax laws of that country, which you should definitely look into (capital gains tax, tax free accounts etc.)\n\nIf you've got the time I'd suggest adding John C. Bogles \"Little book of common sense investing\" into your reading list. He has some pretty convincing figures and math on the advantages of index funds.", "score": 2, "replies": []}, {"body": "Npa. Thank me later", "score": 2, "replies": []}, {"body": "Microsoft, gme, ark and siemens", "score": 2, "replies": []}, {"body": "If you’ve read the books you should be able to come up with a conclusion for what you want to invest in instead of asking what meme stocks to go into!", "score": 3, "replies": []}, {"body": "Tesla", "score": 1, "replies": []}, {"body": "GME", "score": 0, "replies": []}, {"body": "Definitely Tattoed Chef. Watch their recent analyst day presentation.  They are slated for big growth next year and will be starting heavy marketing in January. Also, some of their new products coming out were just leaked, and they'll be on front cover of next Sam's Club mailer.", "score": 1, "replies": []}, {"body": "200 is not enough imho because you have to pay the bank/broker for trades. imho for your barndoor stock 2000-3000 is the minimum i would spend. also gives you a bit of leverage to see decent results. if you dont make that much money (NB: it has been shown again that if you want to save for age 50+ total earnings dont matter that much, what matters is that you start earlier to benefit from compound interest/dividends and course increases) I would wait until you have at least 1000 euros.", "score": -2, "replies": [{"body": "They can start at a zero fees investment apps. I think when you wait to accumulate 1000€ it can be more daunting to invest it all in individual stocks/ETFs, especially as a beginner.", "score": 1, "replies": []}]}, {"body": "Don't forget to but at least a tint bit of ya portfolio into rare metals ect... I'd recommend Platinum right now as it's crazy undervalued because of gold and steal right now.", "score": 1, "replies": []}, {"body": "All of them", "score": 1, "replies": []}, {"body": "Research some green energy or grab an ETF.", "score": 1, "replies": []}, {"body": "NKLA. Going for a run.  SBH safe. M safe. WFC safe. Viasat safe.\nQS real risk is real reward.", "score": 1, "replies": [{"body": "Guess no one saw this", "score": 1, "replies": []}]}, {"body": "Try SPY or DIA, they give a good idea of what the market is baseline like and pay a neat monthly dividend. It's conservative strategy, but a good first step into investing.", "score": 1, "replies": []}, {"body": "TAN - It has been hot as of late so I'd dip my toe in then dollar cost average if it's starts consolidating. Green energy is, for lack of a better phrase, just getting started. \n\nCHWY - It has also run up since last quarter but is down 10% today on profit taking and outward rotation. Apply the same strategy as mentioned above. They have been inching towards profitability while increasing revenue (even before the pandemic) and their cash on hand. They're expected to turn a profit late 2021 and IMO this is a beautiful long term hold. Well run company and great customer service. Amazon is a competitor, but for some reason they have not cut into enough of Chewy's growth.", "score": 1, "replies": []}]}
{"title": "Elon Musk 'I'm Ready To Compete Against The Apple Car'", "selftext": "", "id": "kkuire", "created_utc": 1609032962.0, "score": 337, "upvote_ratio": 0.96, "num_comments": 78, "comments": [{"body": "Why’s he sat so close", "score": 135, "replies": [{"body": "That is pretty weird for a professional interview, their knees are almost touching", "score": 45, "replies": [{"body": "It's about the sexual tension.", "score": 7, "replies": []}]}, {"body": "She’s calling him daddy musk in her head the entire time", "score": 75, "replies": [{"body": "Im like 98% sure shes a lesbian, but she would totally turncoat for Papa Elon", "score": 26, "replies": []}]}, {"body": "Elon asserting dominance", "score": 36, "replies": [{"body": "Kara Swisher knows what she is doing....", "score": 10, "replies": []}]}, {"body": "[The video Musk studied to hone his interview skills](https://youtu.be/_i5zXLZHGI4?t=8)", "score": 13, "replies": []}, {"body": "That's like the first thing I noticed and I was like Kara Swisher seems totally okay with it.", "score": 2, "replies": []}, {"body": "I’d fuck her she’s ugly but women in that age range always give the best blowjobs. I had once a 68 year old Hungarian lady man she sucked so good but was ugly as fuck. She was like a vacuum machine. \n\nIf I was Elon I’d fuck all of the women at work after interviews chance they already did. All of the world leaders have all the access to so much women. \n\nEvery president even in our country fucks around and the one before as well. I think that’s the only motivation to even get jobs like that.\n\nYou be sourrounded by horny women even if you ugly status is everything.\n\nYou either a criminal or a leader of a country or corporation. The rest of us have it harder", "score": -14, "replies": []}, {"body": "Yeah seriously wtf", "score": 1, "replies": []}]}, {"body": "If anything this is bullish on apple, he even admits they will make a good car, and will be a competitor.", "score": 54, "replies": [{"body": "Can’t wait for the EV multiplier on AAPL. That shit is going to be 10 trillion market cap any day now", "score": 50, "replies": [{"body": "I’d say 3-5 trillion in Next 3 years is realistic prob 5", "score": 15, "replies": [{"body": ">I’d say 3-5 trillion in Next 1-2 years is realistic prob 3", "score": 1, "replies": []}]}]}, {"body": "Video was from 2 years ago though. Probably priced in by now.", "score": 5, "replies": []}, {"body": "https://www.reddit.com/r/wallstreetbets/comments/kidiv0/aapl_ev_is_good_for_tesla/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nIt’s a good thing for Tesla", "score": 6, "replies": [{"body": "Yes taking market share from a company is always great. One thing it’s 100% good for is 🍏", "score": 15, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "No, that’s not the case. McDonald’s had a bigger  market share before competition came.it’s mathematically impossible for market share to increase with more competition, same can be said with every company in the world. Competition is good for the progress of technology, bad for business. That’s why companies buy the competition, Facebook for example, Microsoft, google, apple, even Tesla. Unfortunately Tesla or any other company in the world can’t afford apple.", "score": 4, "replies": [{"body": "By 2030 ice cars will be androids. Market share will explode as they implement a new cash for clunkers program.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Again good for consumers not good for Tesla.", "score": 0, "replies": [{"body": "It's not clear if it's good or bad because it will cause the entire addressable market to expand. In an industry where leverage is enormous this may improve profitability.\n\nYou can't just take a concept about established mature markets and apply it to everything. Actually, i guess you can but it would be wrong and lead to incorrect conclusions. But I sense you're pretty much dedicated to a POV here so you can have the last word.", "score": 1, "replies": [{"body": "Well using data from literally every business in the world would show that competition isn’t good for business, you can’t argue it. Good for  consumers bad for business.", "score": 0, "replies": []}]}]}]}, {"body": "obviously wrong.  Don't quit your day job if you want to be a microeconomist....\n\nThe market for fast food is the universe of people who want to eat.  By having more than 2 fast food near each other, it increases the total market penetration, as the other post is discussing.", "score": -4, "replies": [{"body": "Yes it increases market penetration, not market cap of the company. Market cap and market penetration are two different things, you said market cap.\n\nIf you really believe competition is good for business I don’t know what to tell you, but it doesn’t surprise me.\n\nHave you ever heard of monopoly’s?, how competition lowers prices? Reduces profit? If you really think McDonald’s is better with Wendy’s that’s just idiotic. \n\nIf Tesla could it would like to be the only car company, if apple could it would like to be the only phone company, Facebook would love to be the only social media platform. Apple getting into ev is not good for Tesla but great for consumers.", "score": 6, "replies": [{"body": "Monopoly's what?", "score": 1, "replies": [{"body": "The game", "score": 0, "replies": []}]}, {"body": "<facepalm>\n\nReally, son, step away from the keyboard.  Your ignorance is showing.\n\nI am always amazed at the complete lack of intelligence and critical thinking in today's kids.  A result of the dumbing down of our curriculum.  Participation awards for all.", "score": -10, "replies": [{"body": "Wow what an amazing rebuttal that was, that definitely changed my opinion.", "score": 6, "replies": []}, {"body": "The other dude is absolutely right.", "score": 1, "replies": [{"body": "I can’t even, haha.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Fast food chains are next to each other, cause the first one found out that this exact place is the best place to reach most people in the area. Despite the 1st one's presence, the 2nd best place is exactly next to it though, so all competitors sit closely by.", "score": 1, "replies": []}]}]}]}, {"body": "~~Arguably~~ Elon Musk is the most capable industry man in history. \n\nThe video was from a few years ago. Since then Tesla has solved all the issues, while Apple didn't make much progress. \n\nBasically Tesla won, and continue to be run by the most capable team. Why people think other companies can suddenly snap their fingers and start winning?\n\nTesla likely will grow from 0.6T to 6T in the next 10 years. Apple 2.2T to 2.5T.\n\nRecently Apple's Titan head retired. Many people view that as bullish. That's strange. If the project is going well, why would the head quit?", "score": 5, "replies": [{"body": "Apple went from never being in the phone industry, to completely dominating and changing that industry and our lives for ever. In a snap of a finger.\n\nLook at phones in 2006. And look at phones after. Apple has more money than any company in the world, is already hiring people from Tesla, and will be a fearful competitor, and musk knows this. \n\nThey’re going full steam ahead in the electric car industry and Tesla shareholders should\nBe frightened. If you’re not, you’re to emotionally invested in your company.", "score": 2, "replies": [{"body": "Apple never had a strong competitor in the phone market. That makes a huge difference. If there were a decent competitor, it would have been totally different. Even today if HUAWAY is allowed to compete freely with Apple, Apple's market cap would drop 70%.\n\nEV market is different in many ways. First, this is an AI competition. It's a thousand times harder than phones. Tesla solved it. Apple I don't know, I don't think they solved it, otherwise the head of the project would be promoted instead of retiring. Second, I wouldn't assume Apple or any other company can beat Tesla's production. Elon thinks nobody else can.\n\nTesla has everything in place. People assume Apple did well with phone will do well against Tesla, I think that's a mistake. We each have our own views, we will see this unfold in the next 10 years.\n\nAs of frightened and emotionally invested - No and No.\n\nAt some point Tesla will produce phones and computers. That should be a real concern for Apple.", "score": -1, "replies": [{"body": "Apple never made a phone pre 2006, the competition had 30 years of R&d  billions of dollars, blackberry was literally one of the biggest tech companies in the world and apple turned them into a penny stock, and made them get out of the phone market. That’s literally the most insane statement I’ve ever heard in my life.\n\nApple wasn’t even in the phone business, so to say it had no competition is completely stupid. \nThe fact is apple made a better product and destroyed the competition. So yes it had competition it just destroyed it. \n\nI can build an ev in my garage, in fact I built a a electric quad for my son. Building a phone? Not so easy. \n\nAs an engineer saying Ev’s are harder to make is another ridiculous statement. We had electric cars 20 years ago, making a phone is way harder, they teach you in highschool how to hook a motor up and propel a device. Now try to make a iPhone? \n\nApples coming and it’s coming hard, apple is Tesla’s Achilles heel.\n\nTesla barely made 200\nMillion, apple made 60\nBillion . It has enough cash to take every single one of Tesla’s workers and put them on payroll for 600 years. The biggest company in the world is coming for Tesla goodluck.", "score": 6, "replies": []}, {"body": "Blackberry, Motorola and Nokia ran the cell phone game in the early 2000s. Then Apple came along and all that’s really left was Samsung. I’d say they had competition and plenty of big players in an established market that they crushed.", "score": 1, "replies": []}]}]}]}, {"body": "They could make a good car, and be a competitor. They could also make a car equivalent of Lisa or Newton.", "score": 1, "replies": []}]}, {"body": "Can Colonel Sanders stop interrupting Papa Elon for fucks sake.", "score": 17, "replies": []}, {"body": "Her shoe is too near my dude’s testes", "score": 17, "replies": [{"body": "She needs that big-dick energy", "score": 4, "replies": [{"body": "There’s no big Dick-osmosis, strictly insertion.", "score": 2, "replies": []}]}]}, {"body": "Elon knows the real threat.  Forget ford, gm, toyota, bmw, vw, etc.  Apple is the real competitor.", "score": 14, "replies": []}, {"body": "[deleted]", "score": 58, "replies": [{"body": "69 420 💴", "score": 5, "replies": []}]}, {"body": "All he has to do is include the charging cord.", "score": 9, "replies": []}, {"body": "Wait they were talking about the Apple car a year ago?", "score": 6, "replies": [{"body": "Steve Jobs had always wanted to make cars. Apple will announce the Apple car next year as a 10th anniversary tribute 🧠", "score": 8, "replies": []}, {"body": "2*", "score": 2, "replies": []}]}, {"body": "This video is from 2018?", "score": 5, "replies": []}, {"body": "She is ready to give head!", "score": 18, "replies": [{"body": "Butt", "score": 2, "replies": []}]}, {"body": "He said \"they should have started on it sooner\". He meant Tim Apple is a fucking drooler for turning down my buy out offer.", "score": 3, "replies": []}, {"body": "Scenes when elons factories start building apple cars", "score": 3, "replies": []}, {"body": "He needs speech training come on musk", "score": 10, "replies": [{"body": "He is autistic", "score": 34, "replies": [{"body": "Wow so am I, now this is a company I can get behind, Tesla calls with stimmy check ASAP.", "score": 16, "replies": []}]}]}, {"body": "He said Apple will have production in 2020. Puts on Apple? Was this priced in?\n\nPuts on Elon for thinking Apple would have production in 2020?\n\nOr calls on Elon for not having to deal with Apple cars in 2020?\n\nOr calls on both because cars = good?", "score": 2, "replies": []}, {"body": "How old is this video? Elon says Apple couldn’t start production til 2020. I guess they still have a few more days this year.", "score": 2, "replies": []}, {"body": "\"Only believe 1% of what you read about batteries\" -Elon\n\n\"When was I reading about batteries?\" -Me", "score": 2, "replies": []}, {"body": "apple rely on foxxcon to build their overpriced phone. bow the fuck they gonna compete with tesla in building cars? gtfo here timmy", "score": 2, "replies": []}, {"body": "Now where is the KFCar", "score": 2, "replies": [{"body": "Glovebox replaced with a chicken warmer.", "score": 1, "replies": []}]}, {"body": "Apple will compete with Tesla in the EV space but one only has to look at how their corporations are structured to determine a plausible outcome.  Apple and their internal marketing teams whom essentially run the company will make a mess of this eventually.  Engineers and product developers get pushed aside all the time in Apple for marketing space. If Apple follows their current corporate strategies this will fail, what you are witnessing is a corporate evolution happening within Apple and if it grows larger then their marketing holds we will see Apple migrate back to its roots of technological advancement.", "score": 2, "replies": []}, {"body": "old news is old", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You can still give him your wife", "score": 2, "replies": []}]}, {"body": "Apple will fuck his shit up if he doesn’t have patents", "score": 1, "replies": []}, {"body": "They will both be very successful.", "score": 0, "replies": []}, {"body": "Unfortunately many stupid mfs will buy anything from Apple", "score": 0, "replies": []}, {"body": "did i hear \"compound interest\"? To the moon! \n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 1, "replies": []}, {"body": "Wheels sold separately", "score": 1, "replies": []}, {"body": "damn apple got his attention tho fr .....his tone changed completely", "score": 1, "replies": []}, {"body": "apple car chargers gotta be replaced every year or so just like my iphone", "score": 1, "replies": []}, {"body": ".", "score": 1, "replies": []}, {"body": "What Apple car?", "score": 1, "replies": []}, {"body": "4780 baby", "score": 1, "replies": []}, {"body": "These interviewers suck hahahah picked the oldest most out of touch people to interview him", "score": 1, "replies": []}, {"body": "Thats why AAPL 🚀 today LOL", "score": 1, "replies": []}]}
{"title": "Apple has an open road...literally", "selftext": "[deleted]", "id": "klcl1y", "created_utc": 1609106751.0, "score": 66, "upvote_ratio": 0.85, "num_comments": 72, "comments": [{"body": ">All the companies we’ve seen so far are bull shit penny stock garage cars.\n\n\nLol Tesla, Toyota, Porsche, Nissan, Fisker, BMW, Ford, Chevy, Kia, VW would all disagree.\n\nI don't disagree with you, apple will probably enter and succeed in this market in 5-10 years, but they'll be far from innovators when they do.", "score": 63, "replies": [{"body": "People will still eat it up like they bloody well invented EV’s, it’s like watching people go nuts for iPhone tech that was on other devices years prior.", "score": 28, "replies": [{"body": "That's the problem. SUVs are hot right now and will be when Apple releases their car. Phones are cheap. Cars are not.", "score": 8, "replies": [{"body": "Apple made a $50k computer and people still bought it.  Their cars are going to be cheaper", "score": 7, "replies": [{"body": "I don't know, Apple has intentionally marketed themselves as a luxury, high end product manufacturer. I doubt they'd shoot for a budget car out of the gate. I don't expect their first car for under $80k", "score": 11, "replies": [{"body": "It’ll never be a budget car for sure since otherwise it’ll affect their Apple Tax", "score": 4, "replies": [{"body": "Nobody bitches about Rolex tax or Ferrari tax", "score": 1, "replies": []}]}]}]}]}]}, {"body": "its winner takes all, tesla is already the winner. they have an advantage in ai/deeplearning, hardware advantages, energy storage, design, real world road information being relayed from cars on road to their ai, automation. Tesla will eat up uber, lyft, truck driving, consumer cars, etc. \n\n&#x200B;\n\nNio and Tesla look to be the winners.", "score": 6, "replies": [{"body": "Winner takes all? A Tesla won’t ever be as cool as a Porsche and certainly there will be luxury consumers", "score": 8, "replies": [{"body": "You bugging on that one.....All it takes is for that one person/celeb or one generation who thinks different to market and promote it as cool and boom.\n\n&#x200B;\n\nPeople said the same thing about Iphones...then they took over everything by basically promoting it as the next cool thing to have. Even though other phones were just better overall .", "score": 3, "replies": [{"body": "Aren’t iPhones an example for brand loyalty? iPhones made the first “sexy” touch screen phones. Since then, many have tried to upend them but they remain the most desired.", "score": 4, "replies": [{"body": "They might be the most desired. But they're not the most sold. Anyone who thinks there is a winner takes all market in smartphones and certainly in the car industry is retarded.\n\nCar market was never a winner takes all market. never ever ever ever has, and never ever ever will be either.", "score": 2, "replies": [{"body": "Well duh. In our examples, iPhones and porches are luxury items so, by definition, they will not have a majority market share. \n\nThe topic was about brand loyalty. Both smartphones and cars have it. Therefore, in conclusion, I am agreeing that the car market is not “winner take all”. One of the reasons is due to brand loyalty, making people sticky in their car preferences.", "score": 1, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}]}, {"body": "> People said the same thing about iPhones\n\nAnd you know what? The smartphone market isn't winner takes all. Go look at he market share of iphones and you'll see that it is certainly not winner takes all. And if it were, iPhone isn't the winner.", "score": 1, "replies": [{"body": "**I stand corrected.", "score": 1, "replies": []}]}]}, {"body": "tesla hasnt mooned this year because they make luxury cars. They mooned because they are going to take over all automated cars, taxis and trucking, they essentially monopolized the production of automated cars in the sense that they own some of the most valuable intellectual property and patents required to realize this wave of automation. They also have a huge headstart in data collection which is equally as valuable.", "score": 2, "replies": [{"body": "wtf Nonsense are you talking?? Like 80%+ of teslas patents are public and the rest is managed by a german patent law firm which is notorious for insider trading (read intc/tsmc/amd scandal) so they have exactly 0 \"hidden\" IP. All their competitors have been having access to all their technology for years.", "score": 6, "replies": []}]}]}, {"body": "It's not winner take all in the car market.\n\nHow stupid do you have to be to believe this.\n\nGo to a car park and count the number of cars that are not best in class and see how that 'winner takes all' works out for you.", "score": 1, "replies": [{"body": "go look at p/e ratio of tesla vs. the rest of the car industry and then look at the stock price, see how that works out for you. Smart money like ARK is not overvaluing tesla as a car company they are appropriately valuing it as a company thats going to take over automated driving. talk to me like you talk to god dum fuck", "score": 1, "replies": [{"body": "Oh you mean it's valued just like how we valued .com stocks in 1999 and 2000? Ahhh now I get it.", "score": 1, "replies": [{"body": "i have no idea what argument you are trying to make at this point it is incoherent, take this L", "score": 1, "replies": [{"body": "Yeah, because you're an idiot.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "NLKA?", "score": 1, "replies": []}]}, {"body": "The last rumour said that Apple is working on \" AR glasses/ VR headset\" for release during 2021-2022.\n\nI'll believe it when i see it....", "score": 12, "replies": [{"body": "The techs not there yet. Wait unti 2025 or so for the glasses", "score": 1, "replies": [{"body": "Microsoft is currently selling AR headsets what do you mean the tech isn't there yet?", "score": 2, "replies": [{"body": "Apple wouldn’t release that clunky shit.", "score": 2, "replies": []}]}]}]}, {"body": "The truly autistic part is you may ultimately be right, but when they invent something totally different than you expect.", "score": 5, "replies": []}, {"body": "The car is still pretty unknown ... will they make it .. is it outsourced .. will it just be a battery of some sorts \n\nMargins on cars aren’t really much ... regardless it’s all very exciting to watch play out and I intend to buy some more shares", "score": 8, "replies": [{"body": "This. Apple doesn't manufacture anything. Is Foxconn going to build the car?", "score": 7, "replies": [{"body": "That's the big question, which slaves does Tim Apple want to have build his car? Does he want it to be Chinese slaves? Maybe stick with Indian slaves even though they recently rioted? Or how about some good ole-fashioned african slaves? Or what about try something different this time and go for south american slaves?", "score": 1, "replies": []}]}]}, {"body": "A huge apple leaker said today that the car is not going to be released for a minimum of 5-7 years.   Who knows what the market will look like then. I’m assuming apple shelves it in 3 years and just sells SW to another auto manufacturer.", "score": 7, "replies": [{"body": "Going to buy and hold apple till they release it and sell the bubble", "score": 2, "replies": [{"body": "I have been playing apple most of the year. While the volume from the Icar news was nice. The main gains are still coming from strong growth. It is getting ready to retest the 137 resistance", "score": 3, "replies": [{"body": "Don’t get me wrong, I love apple as a stock. The M1 chip is going to change the game but the apple car shouldn’t play into stock price just yet.", "score": 1, "replies": [{"body": "I agree. And I don’t think it is. I think most of it is being pushed by the performance", "score": 1, "replies": []}]}]}]}, {"body": ">been playing apple most of the year. While the volume from the Icar news was nice. The main gains are still coming from strong growth. It is getting ready to retest the \n\nsource?", "score": 1, "replies": []}]}, {"body": "To hit another double it would have to add the current market caps of google, facebook and walmart to it's own. Do you really believe that's likely to happen anytime soon? Future growth is very much already priced in.", "score": 3, "replies": []}, {"body": "If Steve Jobs still ran Apple, they would have a car right now, not entering the market by the time its saturated.", "score": 2, "replies": [{"body": "Not true, Steve Jobs is known for waiting till the right time and disrupt the market. The EV car will not be a \"car\". They will start from 0 wich will shock the world. The 4 tires and steering wheel will be history.", "score": 1, "replies": []}]}, {"body": "I own both, TSLA and AAPL. \n\nMaking cars will complete different ball game for Apple. They need to partner or buy a company like Ford/GM to avoid the headache of manufacturing cars, so that they can focus on Batteries and software. GM already have their battery tech (Hummer EV). \n\nAlso, Apple is rumored to release the car around 2024. That is almost 3-3.5 years from now. That is a lot of time for Tesla to fight off any serious competition. Their $25k car would be amazing as well. Tesla weak points are the interior and the cybertruck.\n\nOn the other hand Apple, have their unique way of doing things. So let's see how it goes.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Don't get me wrong. I like interior. But when it comes model S/X, other luxury brand competitors offer a lot of options. \n\nCybertruck, as of now I don't like the look of it. It may grow on me 🤷‍♂️", "score": 1, "replies": []}]}, {"body": "Apple has the opportunity to undercut EVERYONE in EV in price, because majority of their profits will continue to come from large margins of phones and computers. They can put as much money into this and not worry about larger margins. Tesla has to, because that’s all they do.", "score": 5, "replies": [{"body": "That's a fair point. \n\nBut undercutting the price is not the usual Apple style.", "score": 13, "replies": [{"body": "Neither are cars", "score": 2, "replies": []}]}, {"body": "Apple destroying the car industry by funding it from other sources of revenue is a good way to get yourself a lawsuit for anti-competitive practices.", "score": 0, "replies": []}]}]}, {"body": "Its gonna be to little to late. Don't assume that just because they have deep pockets just simply buiöd a car that is competetive. They would outsource everything like they do with their other products so they can't be competetive. It took Tesla like 15 jears to get here. They cant catch up simply because they have money.", "score": 2, "replies": [{"body": "I strongly disagree. Tesla almost failed bc of cash problems.", "score": -1, "replies": [{"body": "Your point suggests money isn't the deciding factor here. \n\nMight as well dominate space, if that's all it was.", "score": 2, "replies": []}]}]}, {"body": "2.5 trillion dolllar companies don't moon man. It's fine to buy into it as a long term, safe hold but the future of apple is undeniably a boomer dividend stock in my mind. Don't expect it to double in value within the next 10 years. Can you really expect it to be worth 5  trillion dollars anytime soon?", "score": 3, "replies": [{"body": "Apple actually doubled in value this year", "score": 18, "replies": [{"body": "Yeah sure, but companies can't double in value every single year and as the largest company in terms of market cap in the world with an already gigantic global market penetration its infeasible to me to believe it's going to grow larger at a rapid pace. Amazon still isn't available all over the world; it can continue growing rapidly for decades to come. I imagine the only continent where it's hard to find an iphone is antartica, and i don't imagine penguins have much need for taking pointless photos of their asses or pictures of their freshly caught fish.", "score": -3, "replies": [{"body": "Getting an iPhone in China is apparently super difficult. And they’re ~double the price", "score": 4, "replies": []}, {"body": "Apple is much more likely to double in 2021 than anything cheaper.\n\nIf they announce they are putting $100bilion into making EVs I bet they fucking will.", "score": 1, "replies": []}]}]}, {"body": "Are you’re serious ? You don’t think apple will double within the next 10 years. Apple is almost at 80% this year and in 2019 apple also did 80%", "score": 8, "replies": [{"body": "That's exactly why future returns are likely to be such shit. Everything got pulled forward into this year.", "score": 2, "replies": []}]}, {"body": "Not at all. One thing we’ve learned though is that markets aren’t value driven anymore lmao.", "score": 6, "replies": [{"body": "Yes they are. Idiots just try to pretend it isn't.", "score": 0, "replies": []}]}, {"body": "Dat new battery technology", "score": 1, "replies": []}]}, {"body": "It’s not a matter of if Apple can execute, it’s if they’re willing to. The Innovator’s Dilemma doesn’t come from rejecting innovation, but underinvesting in what will appear to be a marginal increase in revenue. Is Tim Cook actually willing to spend the tens of billions it could take to built and sustain an automobile/self-driving program, or will it waste years in purgatory like Google’s Waymo? Working on a car and a AR/VR set simultaneously could risk drawing down their cash reserves. That’s not something that bothers me personally, but boomers like buffet would lose patience if Apple had to cut back their buyback program.\n\nBased on Google’s two year quest to buy a watchmaker, Apple probably can’t just acquire their way into the space. Most of the car program will have to come from the ground up.", "score": 1, "replies": []}, {"body": "I’m a you. I Have Apple calls", "score": 1, "replies": []}, {"body": "Apple probably has inside knowledge and connections.\n\nThey are betting oil price is going up.  EVs will take over the market at $8/gal nobody is buying SUVs and trucks.  This will also hit current auto makers hard.  Will force plebs to rebuy vehicles making the top even more money.", "score": 1, "replies": []}, {"body": "what they lack is a plan", "score": 1, "replies": [{"body": "How would we possibly know that", "score": 1, "replies": [{"body": "Show me the Apple Musk", "score": 1, "replies": [{"body": "Tim apple bro", "score": 2, "replies": []}]}]}]}, {"body": "Its all about the arm processors their developing like the M1, apple is about to have the fastest most stable and affordable mid-tier computers available. Cheaper better computers for boomers, millennials, gen z msft still got gaming though", "score": 1, "replies": []}, {"body": "Literal trillions? Are you retarded?\n\nThey have a market cap of $2 trillion. They don't HAVE trillions.\n\nAlso, you know who has an advantage over Tesla? \n\nVolkswagen.. Because they have the factories, the money and the sales. \n\nYes. They're selling cars. Fully electric vehicles even. And they're taking market share from Tesla.", "score": 1, "replies": []}]}
