{"title": "[deleted by user]", "selftext": "[removed]", "id": "12k201r", "created_utc": 1681338710.0, "score": 21, "upvote_ratio": 0.77, "num_comments": 42, "comments": [{"body": "ARM, Apple, Google, TSMC and Samsung to name a few. The x86 market has shrunk significantly relative to the total market for chips, largely due to phones/tablets. Because Intel hasn't been in those markets, they haven't benefited as greatly from economies of scale in their fab operations, and consequently fell behind.\n\nEven in the enterprise server market AWS and others now offer ARM as an option, so there's no clear reason to think the trend away from x86 won't continue and, outside that market, they don't have any moat or real competitive advantage.", "score": 18, "replies": [{"body": "NVDA", "score": 2, "replies": [{"body": "Intel isn't really a player in gpus and nvda isn't really a player in cpus (though they're coming out with an \"All in one\" chip at some point apparently)", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "NVDA don't make datacenter cpus, just gpus. ARC gpu's aren't much of a competitor imo but we'll see", "score": -1, "replies": []}]}]}]}, {"body": "I’ve always resisted buying AMD (to my mistake) because I always believed the main threat to Intel is ARM based processors instead of AMD. Apple has shown that ARM based processors are flat out superior to x86 processors for laptops and many companies have migrated to ARM for server software where performance per watt has always ruled.", "score": 2, "replies": [{"body": "Sometimes being right about the trend but wrong and about the time horizon is as bad as being flat wrong.\n\nPersonally, I liked AMD for a number of years because their prices for equivalent performance were compelling. If you assume that companies will make the easy changes first, moving from one x86 processor to another more cost efficient one is low hanging fruit. That cost differential and the huge disparity in market share hace been competed out to some extent so I don't see as big of an opportunity there as I used to. I think it'll take a decade or so but ARM for servers is coming - starting with easier stuff like Java apps (and other VM based languages).", "score": 2, "replies": [{"body": "> Sometimes being right about the trend but wrong and about the time horizon is as bad as being flat wrong.\n\nThe story of my investing career :)\n\n> I think it'll take a decade or so but ARM for servers is coming - starting with easier stuff like Java apps (and other VM based languages).\n\nI kind of agree with you. I thought it would happen earlier but the whole Broadcom/Qualcomm and Nvidia/ARM thing seriously derailed investment in ARM for servers amongst the big players. I definitely still want to avoid investing in x86, though. I don't know when it will happen, I am just pretty confident it will. Might as well put my money to work elsewhere.", "score": 1, "replies": []}]}]}]}, {"body": "I think its a little bit of both slowdown and market share loss.\n\nAMD is taking market share from Intel for data center CPUs.  But the PC market is experiencing a slowdown.", "score": 7, "replies": []}, {"body": "ARM (SoftBank) / TSMC, producing Apple M series processors (30M units/yr)\n\nNvidia / TSMC\n\nNvidia / Samsung", "score": 6, "replies": []}, {"body": "All will have market share.  I personally brought AMD @ $2.50/share because I just believe the industry would not want them to fail.   I sold a bunch over the years and still hold 1000 shares of AMD.   I have been watching INTC to see if it hits $20/share range.  If it does, I will be buying.\n\nFor me. NVDA is currently over-priced and is a \"trendy\" stock - good for trading but not investing - the trends have been gaming, crypto and now AI - the cycle goes on.  It peaks than drops - the key is timing which many do not execute effectively.", "score": 15, "replies": [{"body": "Do you think INTC will drop to the $20/share range and buy?", "score": 2, "replies": [{"body": "Possible, INTC strengths were always manufacturing and first pass quality, but they lost their way after Andy Grove.  It is now catch-up in a market that is downturning and changing technical requirement coupled with trying to build new capacity - I see some tough quarters; thus, I will be watching.", "score": 3, "replies": [{"body": "What you said is very correct. I very much agree. But personally, the probability of falling to $20 is very small from my technical analysis. Because that would be an all-time low. 28 and 25.4 and 23.97 these are all strong support positions. Of course, Intel is also in a downward trend at present, and it is a good choice to short it now", "score": 2, "replies": [{"body": "Yep, but for me, if you do not hit your numbers, the charting technicals are meaningless.", "score": 1, "replies": [{"body": "Indeed. let us wait and see. It shouldn't fall much in the short term", "score": 2, "replies": []}]}]}]}]}]}, {"body": "There is an overall industry slowdown, although there are multiple markers involved and they are pretty different. The server market, consumer market, and mobile markets are pretty different. AMD is eating Intel's lunch and will continue to do so for the foreseeable future in the server market. That market is slowing down but it's not a major slowdown. In the consumer market Intel is competitive but with lower margins than AMD, this market is slamming into a wall. Intel is not in the mobile market. \n\nIn terms of the consumer market slowing down you can see that with DRAM manufacturers cutting production. Samsung just recently announced cuts and Micron has been cutting back for months now. Apple, HP, and Lenovo have also been hit pretty hard. \n\nServer market is key for AMD and Intel. AMD has the better product at a lower price point right now. AMD and Intel have aggressive roadmaps and AMD has a much better track record, but I wouldn't discount Intel at this point. They are much bigger and have significantly more resources than AMD at this point. \n\nIntel is also gearing up to compete with TSMC, not AMD in the future. Their fab build out plan is aimed at gaining business from Amazon, Google, Microsoft, and Apple. That's something important to consider. Realistically Intel is losing to TSMC, that's where Amazon, Google, and Apple are going. That's the big opportunity for Intel, working with the tech Megacaps.", "score": 4, "replies": []}, {"body": "Maybe Nvidia but it can’t be that much. Intel is not really big in the GPU market which is where Nvidia is mainly involved. They’re both involved in AI so that can be another.", "score": 2, "replies": [{"body": "Intel makes the CPUs (central processing units) that are the brains of computers, while Nvidia makes GPUs (graphics processing units), which are used in graphics-intensive applications like video games and artificial intelligence. Intel is also a leader in the development of the x86 architecture, which underpins most modern computers, while Nvidia has focused on developing its own proprietary GPUs.", "score": 0, "replies": []}]}, {"body": "INTC was worried more about paying their dividend than putting $$$ into R&D. I don’t think it’ll be long before they return to king now that they made the dividend cut. AMD is a perfectly run company too but INTC is probably the better long term play. Especially at the current pricing level of both stonks.", "score": 3, "replies": [{"body": "Good luck, \n\nThe biggest mistake Intel (and its investors) think is that Intel will lead just by being ***'Delivering fastest Processors again'***. Well now the times are for selling a full HW + SW suite.\n\nCompanies are looking for vertical solutions from 1 company. They don't want to buy processor from Intel, Card from somewhere and manage and pay more on top. \n\nAMD and NVDA are focussing in that area - ***Vertical Solutions***\n\n***AMD*** - CPU + DPU + FPGA + Software Suites (weak ones)    \n***NVDIA*** - DGX1000 + AI Software Suites (strong ones) + Other Cards    \n***Intel*** - Trying to make the fastest CPU\n\nEven if they make the fastest CPU, Unlike this 90s mentality only HW is not gonna take them to the top again. \n\nThey'll have to think beyond CPUs now (for which I have not seen any strategy). Other would have a better vertical product pipeline by 2025.", "score": 5, "replies": [{"body": "Well, after they too the hit for the dividend cut, I put my money on INTC. I guess we will see.", "score": 1, "replies": []}]}]}, {"body": "Everyday Intel is selling some division or the other. Intel sold its main HQ campus as well in San Jose (nearby to my house). The place from where they dominated the world. We have been hiring lot of Intel folk.\n\nIntel needs a new leadership.", "score": 2, "replies": [{"body": "**Why are you talking in bold**", "score": 3, "replies": [{"body": "Changed it for you, But it doesn't change the fact.", "score": 3, "replies": []}]}, {"body": "Who's we?", "score": 1, "replies": [{"body": "Lets say one of the big ones in the Bay Area.", "score": 1, "replies": []}]}]}, {"body": "Well really only other is nvidia since intel does graphics now", "score": 1, "replies": [{"body": "QCOM is working on ARM CPUs for servers. NXPI is eating a good chunk of MobileEyes lunch. TSM is fabbing CPUs for e.g. AAPL. ARM holding has all kinds of designs targeting INTC businesses.\n\nThe list is pretty long..", "score": 4, "replies": [{"body": "You are right. Many companies are taking a piece of this big pie", "score": 3, "replies": []}]}, {"body": "Yes. I also think that besides AMD, only NVDA can pose a threat to Intel.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I think this is also very normal. As a great manufacturer, TSMC produces products for these companies as an agent. I think it is a normal thing. Enterprises also need strong cooperation. If you give it to ordinary factories, they may not be able to do it with such production technology", "score": 0, "replies": []}]}, {"body": "And if you count arm", "score": 1, "replies": [{"body": "To be honest I am not optimistic about ARM. I don't think it's anything to worry about.", "score": 1, "replies": [{"body": "Apple’s processor kicks intels ass from benchmarks so at least apple has something going on with arm", "score": 1, "replies": [{"body": "that's a really good performance", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Potentially in the future? Qualcomm. But that's assuming we start seeing Windows PCs using ARM in much larger numbers.", "score": 0, "replies": []}, {"body": "There own greed", "score": 0, "replies": []}, {"body": "In addition to AMD there is only Nvida", "score": 1, "replies": []}, {"body": "NVIDIA has a new super chip CPU coming out called Grace to eat into Intel's market share in that sector too.", "score": 1, "replies": []}, {"body": "Intel was the only game in town until the CEOs fell asleep. Same happened to IBM. Micron is the other", "score": 1, "replies": []}]}
{"title": "Potential shut down strike at UPS. Would stop all transportation via UPS", "selftext": "", "id": "12jyobv", "created_utc": 1681332590.0, "score": 229, "upvote_ratio": 0.94, "num_comments": 49, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|2 years ago\n**Total Comments**|12|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": ">The Teamsters began supplemental negotiations with UPS in January. Out of 40 supplements to the national contract nationwide, 30 remain unresolved after repeated delays by UPS.\n\nOnly three months? Those are rookie numbers! \n\nMy hospital dragged our contract negotiation out for 10 months, which only ended because of Covid.", "score": 62, "replies": [{"body": "Mine took 2 freaking years. Of course any pay raise was NOT retroactive.\nThe compant got away with screwing us 2 years straight.\n\nThanks UAW!!", "score": 16, "replies": []}]}, {"body": "Full time UPS driver here - I’ve been buying OTM puts on the stock for the past month and I’m going to keep buying them until the end of July when the contract expires just as a form of “strike insurance” in case we walk off the job.\nFull time drivers do pretty well at UPS but our hub personnel definitely deserve much better pay. There’s also a 2nd tier of full time drivers who are paid significantly less than the top tier. \nRPCD’s are the top - 22.4’s are the bottom and a lot of them do much more work than the top tier because they’re not protected by the Union against excessive overtime. \n\nInterestingly enough I saw a spike in the value of my put contracts yesterday close to the closing bell (around 2:40 pm).\n\nThey’re currently worth about $22 to $25 each but yesterday they went as high as $255 ea before dropping back down to $130 and then to $31 I think. \n\nThis play is way out of left field right now but if a strike happens, Ms. Carol’s precious stock price is nose diving into oblivion. \n\nPos. 15 $90P Oct 23 exp.", "score": 36, "replies": [{"body": "SEC? Yeah, he's right over here.", "score": 24, "replies": []}, {"body": "Sorry, a strike at UPS has already been priced in.", "score": 21, "replies": [{"body": "What isn’t?", "score": 6, "replies": [{"body": "your puts", "score": 6, "replies": [{"body": "Oh but they are - remember the day FedEx died after hours last year?\n\nPepperidge Farm remembers…", "score": 10, "replies": []}]}]}]}, {"body": "idk betting on a strike is risky, the company's gross profit has increased year after year", "score": 6, "replies": [{"body": "Profit sounds pretty savory to me, what's gross about it?", "score": 1, "replies": []}]}, {"body": ">\tFull time UPS driver here - I’ve been buying OTM puts on the stock for the past month and I’m going to keep buying them until the end of July when the contract expires\n\nHey buddy, this sounds suspiciously close to insider trading depending on when you made the trades and what was public. You should know you are not rich and the SEC might check out your public confession and actually do something.", "score": 7, "replies": [{"body": "The information I have is the exact same information that any person of the general public has access to. \nI’m not an officer or executive of the Company nor am I a Union agent. I do not have any foreknowledge or insider info about a possible strike. \n\nForbes or WSJ ran an article a few months back saying “UPS drivers who make $95K a year are threatening to strike” - that’s when I added the contracts to my watchlist and waited for the price to come down some before I bought in. \n\nI spoke to a Union official before making this trade and I am perfectly within my legal rights under the current free market.\n\nThis sounds nothing like insider trading. \n\nBesides, the SEC is pretty tied up right now demonizing crypto and counting their bribes.\n\nhttps://www.forbes.com/sites/qai/2022/09/12/ups-union-strike-heres-what-investors-need-to-know-about-the-stock/amp/", "score": 12, "replies": [{"body": "I still wouldn’t talk about. Lawyers cost money even if innocent.", "score": 2, "replies": []}]}, {"body": "In his defense anyone who cared to look knew when the contract expiration was. I worked at UPS during the strike in the late 90s.\n\nMaybe the play is also fedex calls here?", "score": 5, "replies": [{"body": "Yeah, but it could be argued he has an insider look on how well those negotiations are going we don’t have. It’s not something he should be trading on before public announcements by the union or UPS.", "score": -2, "replies": [{"body": "Drivers are not privy to any negotiation info while it is ongoing - all we can do is vote yes or no when the ballots hit our mailboxes. \nNegotiations are secret and kept strictly confidential until it’s time to vote. \n\nI know you’d really really really like to be right about this but unfortunately you just aren’t. I actually spoke to a senior Union official this morning about this play and what he told me was the point you are making is invalid because it’s the same as being a UPS employee taking a long position on the stock except I’m on the short side. \n\nA Walmart cashier believes in her company so she buys $50 worth of stock out of every paycheck. \n\nA disgruntled employee hates his job because his company is short staffed and he’s doing the work of 3 people by himself so takes a short position because he knows that companies that are desperate aren’t able to sustain profitability long term. \n\nWith your logic, no employees would ever be able to open a position on their company’s stock simply because they work there so now they’re “insiders” - c’mon man, you know better than that. \n\nThen again, maybe you don’t.", "score": 2, "replies": []}, {"body": "You right tho.", "score": 0, "replies": []}]}]}]}]}, {"body": "Sounds Bullish", "score": 10, "replies": [{"body": "Extremely Bullish.", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4641)", "score": 20, "replies": []}, {"body": "Do whatever the fuck u want… after I get my Lions jersey.", "score": 7, "replies": []}, {"body": "Do it.", "score": 7, "replies": [{"body": "UPS, Federal government strikes. State employees walk out. Private sector strike due to union.\n\nSPX: This smells bullish to me.", "score": 6, "replies": []}]}, {"body": "FedEx and Amazon have figured out how to reduce labor costs by using 1000s of contractors which each have 20 - 100 employees.  On the one hand, the UPS union can rightfully argue that inflation has driven up their cost of living.  On the other hand, for UPS to remain competitive in a recession they need to control their labor costs which are already higher than competitors.  If I were FedEx, I'd use this opportunity to scale up further & steal market share from UPS.", "score": 7, "replies": [{"body": "FedEx using all these subcontractors is why they are second fiddle. Cost of shipping is roughly the same with each while quality of service of UPS is much better and they maintain a larger footprint.\n\nUPS has 2x the profit margin of FedEx despite drawing nearly the same yearly revenue because they have 70% of the employee count.\n\nFedEx's logistics network is already ridiculously inefficient and scaling up would only exacerbate that.\n\nAnecdotally speaking, I live in a small city and any time a FedEx package gets shipped to me, it's a toss up as to which of the three separate subcontracting FedExs are the one that ultimately does final delivery. Each of them have to drive from roughly an hour away to deliver to me, when the sensible solution would have been to pipe through the major city you have to pass through to even get to their cities, which is what UPS does.", "score": 10, "replies": []}]}, {"body": "They won’t go on strike UPS will loose to much. I worked for them 18 years ago when they went on strike in Canada working at the largest hub in Toronto for them and it was a 3 day strike they lost so many costumers because of it because business need to ship and once they change shipping companies they don’t just change back because a strike is over.", "score": 8, "replies": [{"body": "Bro they didn’t even show up for the first round of negotiations with our Union - shit could hit the fan.", "score": 17, "replies": [{"body": "It’s just politics of them bluffing to the union. Just playing hard ball", "score": 5, "replies": [{"body": "Yeah because bluffing and playing hardball has NEVER gone wrong and pushed people into decisions like strikes.", "score": 5, "replies": []}]}]}, {"body": "You’d think they’d be more incentivized on addressing the unions wants then", "score": 6, "replies": []}, {"body": "Teamsters don't care how much UPS loses.  It's up to Carol to please the Union to keep things running, so she can please shareholders.", "score": 3, "replies": []}]}, {"body": "Amazon, where's my stups", "score": 3, "replies": []}, {"body": "100 billion in profit", "score": 4, "replies": [{"body": "Stock price skyrockets", "score": 2, "replies": []}]}, {"body": "Hopefully usps strikes too why is everyone doing so MUCH wrk for the 1.% to be rich? Let’s fucking end them and get our shit back.", "score": 4, "replies": [{"body": "They need to revert a law in the 80s regarding pensions to save the USPS. There's so many problems caused by DeJoy too that I'm not sure ever got reverted.", "score": 2, "replies": [{"body": ">\tThey need to revert a law in the 80s regarding pensions to save the USPS\n\n1.\tThe USPS is still fucked if they did for many other reasons. \n2.\tThe fiduciary of the fund says the fund is still woefully underfunded even with the mandate active or removed\n3.\tThe law was signed in 2006\n4.\tThey are not even making the payments anyway\n\nThe USPS needs more flexibility to compete and needs to stop kissing bulk mailer ass that just gets tossed into the trash and devalues the postal service.  A lot of the problems is they have to charge one universal charge for 1st class mail too that doesn’t take distance into account. Which basically died when email came and was their driving income. \n\nChina is also costing it a ton of money with shipping exploit (developing countries can mail for less than cost to compete to the USA or contact family members) that was meant for one thing but is now being abused for e-commerce delivery. That policy has been removed but the law takes years before it can sunset. \n\nThere is a bunch of other things too. Like there is no accountability on what they are spending their money on. \n\n>\tIn fact, USPS told OpenTheBooks that releasing would compromise the integrity of its procurement and the privacy of its vendors.\n\nSo, it also needs to pick a lane. It’s either a company or a government agency with tax dollar funding it so that info must be public.", "score": 3, "replies": []}]}, {"body": "![img](emote|t5_2th52|4640)![img](emote|t5_2th52|27189)", "score": 1, "replies": []}]}, {"body": "Can they atleast wait until my Fitbit comes in the mail?", "score": 2, "replies": []}, {"body": "Shoot, is this why my package that’s supposed to be here (So-Cal) by tomorrow evening is stuck in Tennessee ?", "score": 1, "replies": []}, {"body": "Good. I hope they all get fired. Shit company.", "score": 0, "replies": []}, {"body": "STFUPS…\n=", "score": -4, "replies": []}, {"body": "Honestly if you're not playing for the long term (10+ years), the only move you should make right now is treasuries and CDs. Just lock in a guaranteed return and sit on your hands for a bit. Nows not the time to be unsure and just throw shit at the wall.", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "Hmm, so that’s why I got an email about signing up for a more premium service…..", "score": 1, "replies": []}, {"body": "Potential means you haven't done shit yet", "score": 1, "replies": []}, {"body": "Sounds bullish", "score": 1, "replies": []}]}
