{"title": "NVDA - February Option", "selftext": "This is my first ever option trade and wanted to get opinions on the move and see if more experienced people here can help me with a good exit strategy.\n\nI purchased the following call option:\nStrike Price: $270, Expiration: February 25th, Number of Contracts: 10, Price per Contact: $22\n\nI’m thinking NVDA will blow their Q4, 2021 numbers out the roof on February 23rd and hopefully it spikes up dramatically.\n\nNow for the exit strategy, I’m just not sure on selling the contracts or exercising my option.\n\nAny feedback would be helpful.", "id": "s2al5z", "created_utc": 1642005597.0, "score": 15, "upvote_ratio": 0.73, "num_comments": 52, "comments": [{"body": "Buy 100 shares of nvda (27k). Sell a call at 300 strike against your shares. Best case you keep premium and shares. Worst case, you get your shares taken at 300 for a 3k profit and keep the premium.", "score": 18, "replies": []}, {"body": "Are you telling you just bought $22k of call options with zero hedging and no exit plan? Is this a small part of your portfolio? I hope so because you are playing it like a YOLO.", "score": 27, "replies": [{"body": "Yes, $22K is a small portion. I can exercise the option if it goes up dramatically.", "score": 4, "replies": [{"body": "Oh man", "score": 20, "replies": []}, {"body": "What about when it goes down dramatically? Or when you watch it bleed 70% over 3 weeks, then you have to scramble to decide what to do? I would argue that having an exit plan when the trade doesn't go your way is more important than knowing when and how to take profits, especially when you're just getting started. \n\nOptions can be fun and sexy because of the dramatic swings. But those swings go both ways and you need to be ready for it. Hopefully this is under 5% of your entire portfolio. It won't take many trades like this to wipe out 100k from your account. \n\nAlso, if you are correct and make out well on the trade, do not assume every trade after will go so well. Time and probability take no prisoners, and unhedged directional plays like this are nothing more than a gamble.", "score": 7, "replies": [{"body": "Seriously. He's gonna let it get theta'd til earnings and hope earnings sees a big move. lol i wanna come back to this in a month", "score": 9, "replies": [{"body": "Where have I seen that one before?", "score": 0, "replies": []}]}]}, {"body": "Option bags get heavy quick", "score": 2, "replies": []}, {"body": "And why would you exercise? Your option will lose all of its extrinsic value", "score": 2, "replies": []}, {"body": "You still in this trade?", "score": 1, "replies": [{"body": "I am….trying to actually figure out what is the best exit strategy.  I’m thinking of exercising my option tomorrow to cash out on Friday.", "score": 1, "replies": [{"body": "You will need to be ITM to exercise \n\nIf it’s not ITM, you are just buying it for 270 while it’s trading at 262", "score": 1, "replies": [{"body": "I should be in the money tomorrow and Thursday morning. However, with this market I’m anticipating a sell off after earnings comes in so I’m still a little confused on how to play this to take profits.", "score": 1, "replies": [{"body": "They will be -90% if NVDA isn’t at 270 tomorrow morning", "score": 1, "replies": []}, {"body": "So how was your first IV crush?", "score": 1, "replies": [{"body": "Brutal!!!!", "score": 1, "replies": [{"body": "If you have a large account be an option seller instead of option buyer", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Sell to close when it hits your profit target you should have established before opening the trade . . .\n\nExercising is rare as you lose some of the time value.\n\nEdit: You should also have a loss target to close if the trade starts losing so you don't have a full loss.", "score": 12, "replies": []}, {"body": "$22,000 on your first option trade\n\nNot bad for a first trade but earnings can kill your options due to implied volatility \n\nYou would need NVDA to be trading over 292 to break even\n\nSince you have 10 contracts, I would sell some at 30%, 60%, 100%, and keep only 1 or 2 as runners for earnings. \n\nThis is if the stock moves in your direction. The market can chop thru March until the Fed raises rates. If you hold all 10 contracts thru earnings, well that’s just WSB. Could be glorified gains or terrible losses", "score": 17, "replies": [{"body": "His display name suggests WSB influence 😀", "score": 11, "replies": [{"body": "Terrible losses it was", "score": 1, "replies": []}]}]}, {"body": "Holy shit, a 22k first option trade? Go introduce yourself to wsb", "score": 9, "replies": []}, {"body": "Here is a suggestion, instead of buying Calls, sell Puts?", "score": 7, "replies": [{"body": "Can you please elaborate?", "score": 3, "replies": [{"body": "If your so bullish on NVDA over $300, you can sell ITM $290 calls, which if goes correctly expire. If your trying to play safe, sell $260 Put, which you can just buy the stock for cheap. Either way, you earn premium on either run; and if it does dip around $260 which you still make money with the premium earned. Do this for Longer month like Sept / Aug which net about $30-50 per contract premium if you believe in the company.\n\nExample: Sept 16 $265 Put - $32.5. If it goes above $265 in sept 16, you keep the premium. IF it dip to $230-265, you still make money due to premium cost, and buy share at that lower price.", "score": 9, "replies": [{"body": "This is definitely a much better idea", "score": 4, "replies": [{"body": "Selling puts can cause some missed opportunity and can cause some lost cash depending on how things play out;\n\nMissed opportunity; Sell the September 2022 265p for 32.5 (lock up $26500 for a 12.2%  return) but the stock runs up 100% during that time and you could have made 100% instead of 12.2%. \n\nLost cash; sell the same put but the stock price tanks 50% from current level, down to 140, you have to buy for 265 with a 32.5 buffer from your put premium,  265-140= 125, 125-32.5= 92.5 loss per share which is 92.5/265 = 35% straight loss of cash. (Slightly better than the 50% stock price crash because of the put premium but still a big loss)\n\nYour risk tolerance, market outlook, and options strategy should dictate what you do.", "score": 3, "replies": [{"body": "He said he may exercise, so either he spends money to buy shares at the correct price, or gets paid to buy for cheaper then the current price, now obviously this isn’t quite how it works, but in general when trying to get into a position selling puts will work better then buying calls", "score": 2, "replies": [{"body": "Exercising or not is basically irrelevant because the cash value of the position is what matters. Whether a person exercises or not will not instantly make or lose them any money. \"Gets paid to buy for cheaper then current price\" is true but does not mean that he makes a profit if the underlying is even more cheap then the strike minus premium. I was just saying that there are no guarantees in any scenario and that each scenario requires a different risk tolerance, different market outlook, and different overall strategy.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Top three rookie mistakes\n\nTrading too big. Check\n\nTrading without a plan. Check.\n\nTrading illiquid options. Push\n\nUnless you have a seven figure account, way too big. Many suggest a 3 percent to 5 percent of the account limit for any one position.\n\nYou need a plan for up down unchanged. Way too many rookies focus 90 percent of their plan on a big move in their direction.\n\n The reality is this might be the 10 percent. You need to have a solid plan for unchanged and down before getting in.\n\nThere is a chance we are all being trolled, looking for extreme reactions. Yawn.\n\nIf not a troll, I suggest taking $20k and playing only with that for a year, doing one contract trades. Keep a journal, take that year to learn.", "score": 11, "replies": [{"body": "Who says he’s trading too big? OP said this is a small risk for his portfolio. And who says NVDA options are illiquid the week of earnings??", "score": 2, "replies": []}]}, {"body": "When playing earnings announcements, you have to be aware of the IV Crush that will often tank the option prices right after the announcement, even if it is favor of what you expected.  In this case you also very little time value left (only two days) after the announcement.  So essentially your options will be worth only a very slight bit more than than their intrinsic value if you hold until earnings.\n\nSo my play here would be to ride the lead up to week of the earnings announcement and then sell at least half or more to cover your initial 22k and maybe take some profit and then you decide to hold or exercise the remaining ones at expiration.  Of course this all assumes your correct on the stock prices' movement.", "score": 5, "replies": []}, {"body": "Don’t hold until expiration. Unless the underlying shares consistently go up a little every day, its premium will decay. NVDA is a very liquid option. I trade it regularly. You should have no difficulty exiting out of your position at any time. As others have said, scale out. Sell 3 contracts on NVDA’s next $5 up move (happens almost every day at some point ). Do it on the market’s next green day and secure some profit for yourself. Then do it again on the market’s next 1% green day and you’ll have 60% of your risk off the table with some sizable profit to go along with it. After that, it’s up to you. Sell 2 or 3 more on the next market green day after that and hold 1 or 2 and sell what you have left BEFORE the last close PRIOR to earnings. That’s what I would do personally.", "score": 3, "replies": []}, {"body": "If the options prices go up (meaning that they aren't yet priced in regarding the earning) due to the earning approaching, you could sell some of the options to lower your break-even before January 25th. While I am no expert I wouldn't recommend selling Options with less than 30 days to expiration due to the theta decay acting faster and bigger 30 days prior to expiration.", "score": 2, "replies": []}, {"body": "You'll be fine. Hold until NVDA hits $350 and think about selling. If this run up is similar to the last one, we should get there. You should already be up 10% if you purchased at $22. IV shouldn't kill you because you are in the money. IV should go up if NVDA spikes so your calls would be worth more.  If you can risk this money, I would hold for the next (4?) few weeks. But also continue to learn more about options. The worst thing is that if this plays out well, you will continue to take even more risks until you loose way more. So don't do that. Good Luck!", "score": 2, "replies": []}, {"body": "I do believe Theta will be knocking on your door long before you need to worry about taking profits.", "score": 2, "replies": []}, {"body": "If you are playing earnings, it's not about whether or not it will go up or down after earnings. Its a out how much price movement is built into the spread. If you think the price is valued inaccurately, underestimating volatility, then be on the buy side. If you think it is overestimating I'd be on the sell side. \n\nAlso, consider on earnings reports, doing a ratio backspread to cover the downside more. Then if you lose its mostly because the stock didn't moves in price, not that it went the wrong direction.", "score": 2, "replies": []}, {"body": "If you’re playing earnings then just buy the day of. No point in holding onto these for weeks.", "score": 2, "replies": []}, {"body": "Hello sir, idk why you’re in the options sub. You should be in WSB’s. Or if you want to make money go to Thetagang, they’ll teach you to sell puts. Buying options is a losers game even in a bull market.", "score": 0, "replies": []}, {"body": "your gonna catch shade for this here, shoulda posted in r/wallstreetbets you woulda been revered as a god", "score": 0, "replies": []}, {"body": "10 contracts (if you decide to exercise all of them) would cost you 270,000", "score": 1, "replies": [{"body": "Yep, I’m aware. I want to maximize my profits!", "score": 0, "replies": [{"body": "Usually selling the option is more profitable bc there is a premium attached to it\n\nIf you are bullish on NVDA, just buy shares of NVDA now", "score": 3, "replies": [{"body": "That’s what the Charles Schwab representative told me on the phone. He also said that in most cases the option is never exercised.", "score": 1, "replies": [{"body": "If NVDA stock runs up in the days/weeks before earnings, that's a good time to sell most of your position. By holding to expiry you risk 2 things:\n\n1. NVDA reports good earnings and traders who bought the rumor, sell the news. 2. It reports earnings lower than expectations, in which case it will sell off hard.\n\nYou'd have little chance to recover since there are only two days between earnings and expiry. Also: You own nearly 10% of the open interest in that option as of this day. You risk trying to sell to the other 140-odd players in that option at a wide bid-ask spread, and perhaps a stock moving wildly after earnings. Don't forget that there is a published expectation of earnings and a whisper number which is usually higher. Stocks often get punished for failing to earn the whisper number.", "score": 2, "replies": []}, {"body": "When you try to maximize profits with stocks/options, you can get burned easily.  I guess you’ll do what you want to do with your money and I hope you make a lot of money.  However, if you’re counting on that money for something, I would heed to good advices others provided here.  If you don’t mind blowing it, visiting a local casino can be an alternative choice.", "score": 1, "replies": []}]}]}]}]}, {"body": "Fyi, amazing earnings recently have caused stocks to tank...idk why", "score": 1, "replies": []}, {"body": "There’s a trend of people trading HUGE positions on their first ever options trade. Are there just a lot of TSLA or other millionaires looking for the next high? I’ve seen a few other people trading 10 lots with no experience. For anyone with a smaller account: please paper trade first then trade small. Big trades like this will wipe you out quickly if you don’t have a massive account.", "score": 1, "replies": []}, {"body": "Serious question for all our sanity. Is this live trading or paper trading account?", "score": 1, "replies": [{"body": "It's live", "score": 2, "replies": [{"body": "Haha you're a beast. I'm rooting for you. I'm also holding shares so if you win I am winning also", "score": 2, "replies": []}]}]}, {"body": "Here we are, 10 days later. As someone up top recomended, if Bullish, as I was on Nvidia, sell puts. I wanted to own more shares, but was not willing to pay more than $235. Sold a $235 put on 1/10, when Nvidia was $275, colleced signficant premium, never ever thinking I would get assigned. was assigned 100 shares this morning $235, which I am fairly happy to own. I'll probably sell some Monday as it became my largest position now, but that's ok.", "score": 1, "replies": []}]}
