{"title": "Tesla introduces in-app monthly subscription for non-Tesla owners to charge at the lowest price", "selftext": "", "id": "sh5ybr", "created_utc": 1643648192.0, "score": 287, "upvote_ratio": 0.98, "num_comments": 56, "comments": [{"body": "130 NOK is about $15, for reference.", "score": 81, "replies": [{"body": "Netflix rates - Brrrrrrr", "score": 48, "replies": []}, {"body": "130 NOK is also a lot less than one regular pizza in Norway [Reference](https://www.dominos.no/en/butikker/grorud/meny/pizza)  \nSo essentially it is extremely cheap.", "score": 9, "replies": []}]}, {"body": "Price difference is 4,6NOK per kWh without vs 2,6NOK per kWh with at the moment in Oslo https://i.imgur.com/Hi1WOhX.jpg", "score": 33, "replies": [{"body": "Basically owning a tesla gets you access to a $15 subscription for free.", "score": 15, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "That is around average for fast chargers. Slow chargers can be cheaper. But there has been a bit of a uproar for many charging networks implementing monthly subscriptions to access lower rates which has caused people the charge more at home. There are also some places where you can charge for free while paying for parking. So I'm not really expecting people to rush to superchargers in mass because there so many options already.", "score": 16, "replies": []}, {"body": "Here in the netherlands by fastned they charge you €0.69/kwh and €0.45/kwh if you have an €11.99 monthly subscription if i remember correctly. Ionity is expensive aswell.  Tesla is by far the cheapest one out there so it makes sense if you charge allot by fast chargers to get tesla's subscription.\n\nEdit: \ntesla asks €0.64/kwh and with subscription(€12.99)€0.27/kwh\n\nIonity €0.79/kwh and with subscription(€17.99)€0.35/kwh\n\nFastned €0.69/kwh and with subscription(€11.99)€0.45/kwh", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Normally when my girl charge her leaf in my neighbourhood she does it at an public 7kw charger and cost around €0.22/kwh. Those chargers are everywhere and enabled by vattenfall and other power suppliers.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "We have paper tax on gains here 😅", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "America i suppose? 👀 That’s rough mate.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Ooh.  Wall Street analysts really like recurring service revenues.", "score": 60, "replies": [{"body": "Too bad they hate innovation and big brains", "score": 43, "replies": [{"body": "Tesla would already be at $2-3k IMO allowing for some execution risk if that weren't the case.", "score": 3, "replies": []}]}]}, {"body": "I just realized this is like a loyalty program like Amazon Prime or Costco memberships. Once you’re in the ecosystem, a non Tesla user will prefer to always use Tesla chargers. Lock-In. Nice.", "score": 48, "replies": [{"body": "And plant the seed for a future Tesla car customer.", "score": 26, "replies": [{"body": "Yeah other EVs are just ads for Tesla", "score": 18, "replies": [{"body": "Charging next to a tesla that charges twice as fast as your car will probably happen a lot.", "score": 17, "replies": [{"body": "Most of the newer cars like ID.4 or IONIQ 5 charge the same or faster than Y and 3. Older ones for sure though", "score": 0, "replies": [{"body": "Not true. ID 4 max charging eate is 125 KW. Tesla 250 kw.", "score": 7, "replies": [{"body": "Ah yes you’re right. Didn’t realize and I have one ordered. LOL", "score": 2, "replies": [{"body": "May I ask why you picked the id4 over a Tesla?  Just curious (and this is not meant to be critical).", "score": 1, "replies": [{"body": "I have a model Y. I want the tax credit off the id.4 then will sell the Y or the VW as we only use 1 car", "score": 2, "replies": []}]}]}, {"body": "Wouldn't the id4 be comparable to a SR model in terms of range and pricing?", "score": 1, "replies": []}, {"body": "Now compare both charging curves", "score": 1, "replies": []}]}]}]}, {"body": "Insane how that works lol. Person sees EV ad. Person does comparisons. Person buy Tesla. Win.", "score": 10, "replies": []}]}]}]}, {"body": "More free cash flow", "score": 23, "replies": [{"body": "Yep. Any smart EV driver will want to have this membership. It won't amount to much at first, but over time this is potentially worth tens of millions (or more) per quarter.", "score": 17, "replies": []}]}, {"body": "Brrrrrrrr", "score": 13, "replies": []}, {"body": "Prepare for the future of monthly re-occuring revenue for Tesla.  While there are some items out there already, this will greatly expand it and fund a lot of charging stations.", "score": 5, "replies": []}, {"body": "That has been live for several months in The Netherlands.", "score": 6, "replies": []}, {"body": "I know some people said this isnt news and it’s already live in Netherlands ...\n\nI had no clue 😂😂\nGreat news for me!! 🚀", "score": 5, "replies": []}, {"body": "Great start", "score": 2, "replies": []}, {"body": "A recognized, reliable, globally underutilized charging network, a subscription service, a price per kWh that still gives a profit, here comes the cash machine.\n\nNow up to Tesla to keep expanding the network and avoid pissing off many customers who contributed in building this network.", "score": 2, "replies": []}, {"body": "I'm still of the opinion you shouldn't need this app - you should be able to scan your credit card at superchargers. Since getting a Tesla, I have complained a lot about the charging situation here in the UK. There's so many offline chargers, and using the working ones is usually a painful venture into the App Store and potentially fighting with a shoddy mobile network connection. Pretty much every charger app on my phone was downloaded and signed up to at the chargers themselves, and I'm guessing this is the same for most people. I have a folder dedicated for them, and I don't want any. I remember once I spent 20 minutes fighting with a polar app which sent me into a loop with resetting my account password at signup. I gave up and drove away. No chance in hell your average Joe is going to put up with that at all.\n\nAnything more difficult than paying at a gas pump is inexcusable.\n\nI was honestly somewhat boastful about how much better the supercharger market was. You sidestep every speed bump all the third party chargers suffer from.  Every step, minus plugging in and plugging out, is automated away. It was kind of separate from everything else. But if they want to enter the fray of becoming a third-party charger to other cars they're going to get the same criticism.\n\nIt'll be interesting to see what they do here given government regs are going to force chargers to have credit card readers.", "score": 3, "replies": [{"body": "From a consumer standpoint if I didn't already use the app I agree.\n\nFrom a business standpoint, it adds a bunch of complexity, from hardware and onsite terminal service overhead, additional point of failure, different fee structure and fraud process.", "score": 1, "replies": []}]}, {"body": "Not news. It was annonced when we had the news for the first non tesla supercharger in Netherlands", "score": 4, "replies": []}, {"body": "this not news is it?", "score": 4, "replies": [{"body": "It’s not", "score": 4, "replies": [{"body": "The subscription isn't new?", "score": 2, "replies": [{"body": "Nope. We had this news with Netherlands :\n\nhttps://www.reddit.com/r/teslainvestorsclub/comments/qkebgi/nontesla_supercharger_pilot/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 3, "replies": [{"body": "Ahh - well it seems the pilot is over - i'll take it!", "score": 3, "replies": [{"body": "This is an expansion of the pilot, as very few people are using it in the Netherlands.", "score": 1, "replies": []}]}]}]}]}, {"body": "it is new + additional recurring revenue - monetizing the Supercharger network to non-teslas\n\nas a reference, Netflix is about 15$/month", "score": 4, "replies": []}]}, {"body": "We need more superchargers and they need to be open to all EVs.", "score": 1, "replies": []}, {"body": "Brilliant", "score": 0, "replies": []}, {"body": "Curious how the app works for payment. What is the charging process like? Once you have an account set up, do you need to open the app every time you charge?", "score": 1, "replies": [{"body": "Yes - you open the app to select the stall.  [Good overview here.](https://youtu.be/KfGqtyxirkA)", "score": 2, "replies": [{"body": "Thanks 👍", "score": 1, "replies": []}]}]}, {"body": "How do these rate options compare to what Tesla owners get? Do Tesla owners get the reduced membership rate without paying membership? Which I guess increases value of Tesla cars.", "score": 1, "replies": [{"body": "Tesla owners get the lowest rate without paying the subscription", "score": 3, "replies": []}]}, {"body": "Pay in Nokia stock?", "score": 1, "replies": [{"body": "Norwegian Kroner 😉", "score": 1, "replies": []}]}, {"body": "Wen USA", "score": 1, "replies": []}, {"body": "Pros:\nMonetizes superchargers.\nIncreases revenue.\nIncreases direct awareness to Tesla’s competitive supercharger network. \nAdvances company mission \n…\n\nCons:\nCapacity… \nFrustration (e.g. EVs with Front LHD Charging ports. They’ll park nose forward, and use the left charging stall effectively blocking two chargers.)\n…", "score": 1, "replies": []}, {"body": "I want this but in North America", "score": 1, "replies": []}, {"body": "Anyone know how this affects Norwegian charging company Zaptec?", "score": 1, "replies": []}]}
{"title": "Not what i meant when i said i wanted tesla to split", "selftext": "", "id": "sgmwra", "created_utc": 1643587621.0, "score": 33, "upvote_ratio": 0.82, "num_comments": 51, "comments": [{"body": "Amazing. And not a single dead body anywhere. Bullish", "score": 22, "replies": []}, {"body": "For Sale: Used Tesla; half off!", "score": 21, "replies": [{"body": "Wait a g'dang minute here 1/2 off and your selling 1/2 the car?! I'm being taken 🤣🤣🤣🤣🤣🤣🤣", "score": 1, "replies": []}]}, {"body": "Dang that must have been one serious impact.", "score": 13, "replies": [{"body": "We found Sherlock Holmes", "score": 30, "replies": [{"body": "Captain obvious", "score": 4, "replies": [{"body": "The Hardy Boys", "score": 5, "replies": [{"body": "Come on gang, let’s search for clues.", "score": 3, "replies": []}]}]}]}, {"body": "nah", "score": 0, "replies": [{"body": "Inspector gadget", "score": 1, "replies": []}]}]}, {"body": "I keep saying with all these kids who think theyre NASCAR drivers but can't even control their car under ideal weather conditions, we need to remake the movie Fast and Furious with a comedy spinoff called the Furiously Retarded", "score": 7, "replies": [{"body": "Man I love seeing anyone rev it in snow with all seasons on", "score": 3, "replies": [{"body": "Did it today.  Felt powerful", "score": 1, "replies": [{"body": "As long as you can handle the slippage no one is judging", "score": 2, "replies": []}]}]}]}, {"body": "Sad when a Ford holds up better. Same will happen with the stocks in 2-3 months", "score": 12, "replies": []}, {"body": "In its current condition it's still more valuable than my vehicle.", "score": 2, "replies": []}, {"body": "Mustang 1 Tesla 0 I’m buying ford", "score": 2, "replies": []}, {"body": "Geeze that Tesla is a pos if anyone was in back they would be dead", "score": 6, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Musk fanboy spotted", "score": 8, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "This is actually true. The media loves writing stores about whenever something happens involving a Tesla but ignores the scores of incidents involving ICE vehicles. And I’m not a Tesla stockholder. Guess it’s just what gets clicks", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Was musk not invited or did he just not show up? If he wasn’t invited that makes no sense since for most of the world if you asked them “who makes electric vehicles?” the first answer would be “Tesla”", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That explains it. Thx", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah I failed to consider that Biden would want to have a UAW circlejerk", "score": 1, "replies": []}]}, {"body": "GM has exponentially more vehicles on the road then Tesla. All current car manufacturers have had issues through the years with vehicles. Tesla is a shit company, putting out shit vehicles. It will catch up with them. It always does.", "score": 1, "replies": [{"body": "Tell us how you really feel. \n\nActually, don’t. I have no affiliation with nor allegiance to tesla nor any other manufacturer so I don’t really care.", "score": 1, "replies": [{"body": "Dude look at a new Tesla. Quality control is basically nonexistent. Their customer service sucks.", "score": 1, "replies": [{"body": "I don’t want to look at a new Tesla. I drive shitty old cars.\n\nIt makes me sad thinking about the money people are shelling out for any new car let alone a new Tesla", "score": 1, "replies": []}]}]}, {"body": "I’m not a musk fanboy but in regards to employee pay I think they pay the same if not more than UAW workers…. That’s the weird thing about unions. Outside of construction and trade work, most union pay is shit.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Where’s the winkler motor reference", "score": 1, "replies": [{"body": "Wankel?", "score": 1, "replies": [{"body": "Yup.   Call me a wanker for the misspell", "score": 2, "replies": [{"body": "I thought maybe the fonz invented an engine", "score": 2, "replies": [{"body": "Lmao", "score": 1, "replies": []}]}]}]}, {"body": "Wankel rotary reference?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Not saying you can’t trade Tesla and make lots of money but anyone thinking a car company that makes some of the biggest POS on the road today is good investment is absolutely insane", "score": 1, "replies": []}, {"body": "Username checks out", "score": 1, "replies": []}, {"body": "The front fell off.", "score": 0, "replies": []}, {"body": "And that kids, is why they don’t use recycled steel and the entire frame of a vehicle is to be free of welds.. surprised this passes FMVSS.. I guess those lobbying $$ go further these days", "score": -2, "replies": []}, {"body": "I can’t believe people buy this junk", "score": -4, "replies": []}, {"body": "Puts on Tesla, message received...\n\nBuild quality poor\n\nI hope the company doesn't die though, I love tesla, I like money more though Elon", "score": 0, "replies": []}, {"body": "Hmm... looks like the Mustang won. What in the hell happened though??", "score": 0, "replies": []}, {"body": "So many people filming the tragedy of others.", "score": 0, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|1 month ago\n**Total Comments**|8|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sgmwra)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sgmwra)", "score": 1, "replies": []}, {"body": "Why am I not shocked this happened in Florida", "score": 1, "replies": []}, {"body": "The front fell off.", "score": 1, "replies": []}, {"body": "Well then, next time be more specific 🤣🤣🤣🤣🤣🤣🤣", "score": 1, "replies": []}, {"body": "Where's the dashcam footage??", "score": 1, "replies": []}]}
