{"title": "$AMZN : Bot 312.50 calls @ 1.36 <-someone posted this one twitter. what does that mean?", "selftext": "I bought AMZN at $308.50 last week and I'd like to sell it at its peak today for a profit. I saw this on twitter and I'd like to know what it means.", "id": "24jgxx", "created_utc": 1399038117.0, "score": 3, "upvote_ratio": 0.66, "num_comments": 19, "comments": [{"body": "An option is essentially a legal contract between you and another trader on the market. The person selling the option is also called the \"writer\" since they are creating the contract from thin air when they sell the option. It’s as if they are taking a blank piece of paper and writing the contract from scratch.\n\nA call option gives one of you the right to buy a stock at an agreed-upon price (the \"strike price\", or \"strike\"), and compels the other to sell it at that price. The person getting the right pays for this privilege. The person taking up the obligation receives this payment. This payment is the option’s \"premium\", or \"price\". That’s the $1.36.\n\nYour tweeter signed a contract where they gained the right to buy Amazon at $312.50 by some future date and paid $1.36 for this privilege. What’s missing here is that future date, known as the \"expiry date\", which is the date until which the contract is valid.\n\nClearly this person is expecting that before or on that date, Amazon’s shares will be worth more than $312.50. If the shares are worth $332.50 (for example), they can \"exercise\" the option and buy shares at $312.50, which is their right, and sell it on the open market at $332.50 for an immediate $20.00 profit.\n\nThe person that sold the option is hoping the price will remain lower than $312.50 until the expiry date, so they can keep the premium. Or they themselves bought the stock a long time ago below $312.50, and wouldn’t mind selling it at $312.50, with the premium as a nice bonus. If they already own the shares then they’ve sold a \"covered\" option. If they don’t and they’re keeping their fingers crossed that the price will stay below $312.50, then it’s a \"naked\" option.\n\nThese contracts are usually for 100 shares each. So in the example here, the call buyer would actually pay $136.00 and make $2,000.00 if the price hit $332.50.\n\nThe risk of the naked option is that if the options get \"called\" (i.e., the buyer decides to actually exercise their right to buy at $312.50) and the writer doesn’t actually own any Amazon shares, they then have to buy it from the open market, at the market price, and sell it at $312.50. So in our example, they would take a $2,000.00 loss. This is why they are paid a premium: to take this risk willingly.\n\nSource: I trade options.\n\nPS. Since you bought at $308.50, you could write options for $312.50. The May 30 options are priced at $25.00.\n\nAmazon is one of the half-dozen or so tickers that have \"mini-options\" available: contracts for 10 instead of 100 shares.\n\nYou would receive $250 in premiums for every 10 shares. If it gets exercised you’d be selling for a profit of $40. If not, you keep your premium anyway.\n\nPPS. All of that was without commissions. But in real life, you will need to account for the commissions. Tread (and trade) carefully!", "score": 6, "replies": [{"body": "Mpuah! A big sloppy kiss on your face. Thank you for that explanation. I feel like it get so much more clearly now. One question. What does the \"Bot\" part of that tweet mean? I think that's what really perplexed me the most this morning. ", "score": 2, "replies": [{"body": "Thank you! :\")\n\nI think it means they’re cooler than people who spell it \"bought\".", "score": 3, "replies": [{"body": "ah! ok it all comes into focus! with the the HFT trading talk of the last couple years i thought that was some how related.", "score": 1, "replies": []}]}]}]}, {"body": "It means that some one bought the right to purchase amazon at 312.50 for a $1.36.  Contracts are in 100 share lots.  It means they believe the stock will go up above this price.  The value also depends on what month the contract was written.  The closer the expiration date the lower the value.  ", "score": 2, "replies": [{"body": "Woah. there is so much in that to digest.. ok so let me see if i understand. For one dollar and 36 cents someone bought the right to purchase  100 shares of amazon at $312.50. So this is an insurance policy in case the stock were to shoot up way past $312.50? Is that correct? That seems rather cheap for a guaranteed sale of $31250.00. ", "score": 1, "replies": [{"body": "Contracts are in 100 share lots the 1.36 is price per share, so 1 contract cost 136 bucks.  Options can be used a number of different ways and 90%+ go unexercised at expiration.  If you thought short term that the stock was going to move up in price, you'd buy the option and when it did you'd sell the option.  It allows you to control a much bigger stake than buying the shares alone.", "score": 3, "replies": [{"body": "Oh ok that makes far more sense that the fee is pershare. ok. I think i can visualize the economics of a trade like that. thanks for the insight. it is greatly appreciated.", "score": 1, "replies": []}]}, {"body": "It's options trading. There's a whole different universe of things to learn when you're dealing with options but yeah that's something equivalent to saying \"buying Amazon Long at limit $x.xx\" in the stock world. \n\nOptions is an interesting to learn. I'd recommend reading some books or Investopedia on it. ", "score": 2, "replies": [{"body": "Thanks. Ill check it out.", "score": 1, "replies": []}]}, {"body": "Well, if the price falls below 312.50, you just lost 136 dollars per call that you bought though.  Poof..!!\nThat is the nature of options.\n", "score": 2, "replies": [{"body": "Where did the price $1.36 come from? Can it be any more or any less?", "score": 2, "replies": [{"body": "The price depends on volatility, strike price, strike date and probably a bunch of other factors. I only have a basic understanding so don't take my word for it. Also don't play with options until you understand how they work. \n\nAs someone who miss judged his beginners luck to having knowledge of options, I have lost a bunch of money. Just be careful. ", "score": 2, "replies": []}]}, {"body": "that's kind of terrifying when you put it that way.", "score": 1, "replies": []}]}]}]}, {"body": "Amazon will fall to 200", "score": -3, "replies": [{"body": "when?", "score": 1, "replies": [{"body": "Right now! Better sell! \n\nSeriously dude you dont know enough to be managing your own money. If you wanna invest buy some S&P index funds and do some homework. With what you know you might as well just go play roulette. ", "score": -9, "replies": [{"body": "I agree completely and this seems to be a very popular sentiment in this subreddit. there's lots of \"go home you don't know what you're doing\". how about a little guidance, friendo? what sort of education can i undertake today. is there a site you like?", "score": 2, "replies": [{"body": "I don't mean go home. What I mean is at your level, buying shares of any stock is really just going with your gut and it's a good way to lose money. A lot of brokers have some great educational material for beginning investors. You should start there. ", "score": 0, "replies": []}]}]}]}]}]}
