{"title": "$TSLA Daily Investor Discussion - March 02, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q419 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/alewpn/tesla_q4_2018_financial_results_and_qa_webcast/).\n", "id": "awfxbp", "created_utc": 1551517473.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 74, "comments": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You can take a look at [https://thenonconsensus.com/tsla](https://thenonconsensus.com/tsla) which has a financial model there. Note that the estimates are consensus values - these are where street expectations are. You can see expectations for both deliveries as well as sales for 1Q. You can also input your own estimates on deliveries, asps, etc. to get to your own revenue estimate. \n\nIn terms of what management said, they said that M3 production would increase sequentially (from 4Q production of 61k vehicles) but deliveries would be about 10k lower. Note that Elon recently said that they were experiencing some issues delivering vehicles to Europe and China and therefore you could potentially believe that it may be greater than 10K now. ", "score": 2, "replies": []}, {"body": "Would be curious to hear people's predictions on this as well. ", "score": 1, "replies": []}, {"body": "20k international, shipped is my guess. Any cars shipped now won’t make it to Europe till Q2 it’s taking 25ish days on average for each boat.\n\n\nSo far 16,000 are shipped according to insideevs. Assuming March is strong, like it normally is. Q1 might be around 34,000 in North America.\n\nThat puts my guess a little right around 50,000, down from about 90,000 in Q4 and 83,500 vehicles in Q3.\n", "score": 1, "replies": []}]}, {"body": "About 48 hours after announcement, has your view of this announcement changed in any way? ", "score": 4, "replies": [{"body": "It was a shockingly aggressive move and it was not anywhere near on my radar to occur here in Q1. I'm not a fan of cutting the stores, and I'm not a fan of jumping all the way to 35k$ which I expect to be unprofitable.\n\nMy guess is that the wait times expand on the SR models and those get their prices raised or maybe even the base model removed within a few months.\n\nThe 37k$ model is nearly 30k$ in California after tax incentives, which is an ABSURDLY good deal. If they can't outpace production with this offer I will be very concerned.", "score": 9, "replies": [{"body": "It definitely offered the bears a lifeline.  I think its hard to combine an announcement of \"We are going to do great\" and \"You are about to be laid off\".", "score": 3, "replies": [{"body": "I think the whole \"SEC holding Elon in contempt\" gave bears more of a lifeline", "score": 1, "replies": []}, {"body": "Yes. The grand culmination of the multiyear plan, the final leg in the model 3 program that compares in history to the model T. And that gets thrown into a mad dash announcement paired with indicators of financial distress. \"If you are scared of volatility, do not buy this stock.\"", "score": 1, "replies": []}]}, {"body": ">It was a shockingly aggressive move and it was not anywhere near on my radar to occur here in Q1.\n\nHere are my thoughts on the broader context:- [https://www.reddit.com/r/teslamotors/comments/awn9rf/we\\_are\\_all\\_tesla\\_customersfans\\_please\\_stop/ehnv7sw](https://www.reddit.com/r/teslamotors/comments/awn9rf/we_are_all_tesla_customersfans_please_stop/ehnv7sw)\n\nSo you can view it as transition from a Model S/X centred sales model, to a Model 3 centred sales model.\n\n(I think some aspects of Model S/X sale will linger on in key locations).\n\n&#x200B;\n\nSo why do it now? I think essentially take the hit and get it over with, as life is better on the other side.\n\nI also think there was a danger that production might outstrip demand, they want to have a level of demand that allows them to safely maximise production.\n\nNo profits Q1 are down to restructuring costs and lower margins, on Model S/X in particular.\n\nThe fact that they are hoping to be profitable Q2 on wards means they think restructuring costs are a one off and that margins will steadily improve from that point on wards.\n\nI am also slightly surprised that they are so aggressive, but the end of Q2, we will be able to judge this strategy.", "score": 2, "replies": [{"body": "> I also think there was a danger that production might outstrip demand,\n\nYes I agree. My expectation here is that Elon wants to force demand to exceed maximum production, and then they can lower demand through higher prices. I would be surprised if they put a lot of effort into expanding production since that expenditure is risky and mostly allows building more of the least profitable units.\n\nSadly I am very skeptical that even \\*he\\* believes his 350k-500k model 3 number which I think he delivered in error and is covering up to make it look on purpose, and I am disturbed by this thought.", "score": 1, "replies": [{"body": "Looking at the historical picture Q3 earnings expecting to be profitable each quarter still ramping production.\n\nQ4 earnings some concerns about Q1 profitability, likely production ended the quarter on track.\n\nUS inventory to carry sales say  first 6 weeks of Q1.\n\nSince then they seem focused on cost cutting to allow cheaper Models and lift demand.\n\nI think having made the 350k-500k estimate Elon is now working hard to make it happen and they don't seem overly concerned with production. On example of this was reducing Model S/X shifts and battery changes. They were happy to lower production, demand was the concern.\n\n", "score": 1, "replies": []}]}]}, {"body": "It appears to be a final Hail Mary pass to collect more deposit money and stay afloat for a few more weeks. Something drastic likely happened for Tesla to be making moves this fast with such little thought. ", "score": 1, "replies": [{"body": "There was some planning because they can't sell an alternate interior without doing the work for that but I suspect sales in North America is weak enough that they had to move hard.\n\nAlso, I think there was an internal war between a slower plan to get to 35k (pushed by other executives) and the all-at-once one that they just launched (which Elon favors), and it is possible that his SEC/Tweet confrontation triggered him to force his plan.", "score": 1, "replies": []}]}]}, {"body": "Nope. ", "score": 3, "replies": []}, {"body": "I am feeling more and more positive about the announcement and expect the stock to rise as the deeper implications set in as in no one will be able to compete.   It’s exactly the kind of decision companies that think too short term can’t make.", "score": 5, "replies": [{"body": "I don’t see any signs of stock shooting up. What’s the reason that you think the stock will go up?", "score": 2, "replies": [{"body": "I didn't say it would shoot up.  I do expect it to rise as they take market share and increase volume.", "score": 5, "replies": [{"body": "Take market share from who? They are like the only EV manufacturer around...", "score": 1, "replies": []}, {"body": "Everything is priced in. GM and Ford have the largest market share in the US. Japanese aren’t too far behind either. \n\nIf recent price cuts tell anything, it’s that the demand is slowing down in the US. So how are they capturing market share? It still doesn’t justify the valuation increase. ", "score": 1, "replies": [{"body": "I am well aware you are hoping that the price cuts are about demand and not market share.  I happen to disagree.", "score": 4, "replies": [{"body": "I’m not hoping. I’m saying all things are pointing to that reason. Why do you think they slashed prices? If demand was strong then there was no reason to slash prices - not this significant. Why would a company that desperately needs cash would do this. ", "score": 0, "replies": [{"body": "Because they want to compete with VW and Toyota?\n\nIn luxury segment they already won. They now need to cross the chasm to become truly mass market manufacturer.\n\nAnd it's absolutely not surprising its written in company goals. ", "score": 4, "replies": [{"body": "I wouldn’t call it winning if it’s only for few quarters with almost half million in backlog. I don’t see Toyota or VW laying people off or closing down dealerships. They’re spending more money and coming out with even more models, ICE and Electric. So yeah. \n\nAlso, there’s more posts from tesla employees (allegedly) in the big tesla sub. Feel free to check them out. ", "score": 1, "replies": []}, {"body": "How about they finish off Audi, BMW, and Mercedes first? I mean, if they truly won the luxury segment, why don't they just soak up another million in annual sales for the luxury brands and use all that profit to grow the low-end too?\n\nThe reality is that the initially demand seems to have worn off and they no longer have a constantly 400K order book...", "score": 0, "replies": []}]}]}]}, {"body": "Demand isn’t slowing down, that was made pretty clear in the last earning call.", "score": 2, "replies": [{"body": "Have source for it? Genuinely asking as I didn’t get a chance to listen to it live. ", "score": 3, "replies": [{"body": "Dude, where the heck are your sources?", "score": 2, "replies": []}, {"body": "Here is one of the articles mentioning it.\nhttp://fortune.com/2016/10/20/tesla-uber-style-ride-service/", "score": 1, "replies": [{"body": "The articles from 2016...I was referring to the last call regarding production guidance and stores closing. ", "score": 1, "replies": []}]}, {"body": "I really don’t remember, I think it’s a webcast interview last quarter, around November. It was on YouTube.\n\nEdit: actually I thought it was the Recode interview but I can’t find where it’s mentioned. Maybe it’s not there.", "score": 1, "replies": []}]}, {"body": "Elon made it clear he has no idea what the demand is. Tesla sales dropped massively this year. This move appears to be a hail mary pass to hopefully stimulate demand, collect deposit money and keep the lights on for a few more weeks. ", "score": -1, "replies": [{"body": "That's probably why they are building a massive new factory in China... Cause there is no demand.", "score": 2, "replies": [{"body": "I mean...Tesla has a gigafactory in buffalo which basically isnt used. Having to cut prices 4 times in 2 months, only selling ~7000 vehicles in Jan and Feb in the US, making drastic changes to their business model mid quarter and a CEO admitting he doesn't know what the demand is for his vehicles aren't exactly signs that the company is doing well. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "When you bought your car, did you trade in your old car with Tesla?\n\nIf so, how is that gonna work without a store front?\n", "score": -1, "replies": [{"body": "I did not but deliveries are taken at service centers not store fronts.", "score": 4, "replies": [{"body": "That was going to be my follow up. That that staff will still have to remain, and a lot of these jobs will still exits.\n\nI just don’t see how they are gonna eliminate that much staff. To get prices down", "score": 1, "replies": [{"body": "The stores are for test drives and letting folks sit in the cars and answer questions.  It's a risk closing these, but I think it's a smart call.  I think they will get more sales from the lower prices than they would from these store fronts.  Also, this ties into an advantage they have over traditional OEMs.  Traditional OEM's can not do this to save money.", "score": 5, "replies": [{"body": "Streets are showroom now, everyone posts their new tesla in instagram/facebook, shows it to friends, offers to try etc", "score": 3, "replies": [{"body": "Tesla has now sold over 369,273 vehicles in the US. That means that 1 in 1000 people own a Tesla. [Only 20% of the population 65 million people have an income of $60k or more](https://wallethacks.com/average-median-income-in-america/) a year. So in the upper middle class population roughly 0.5% own a Tesla. That means that if you are middle/upper class and know 200 people you probably know somebody who owns a Tesla. The Median number of facebook friends is 200 so most people have that many friends.", "score": 1, "replies": [{"body": "if you noticed, Tesla is focusing considerable efforts on entering into 'under 40k' market and this opens it to wider categories of people who want one. I.e young graduates can save (or borrow from grandma) some downpayment and get model 3 for same financing (\\~350/mo/96 months)  as if they were buying Honda Accord or something. \n\n&#x200B;", "score": 2, "replies": [{"body": "I have noticed, but I am saying that Tesla has reached enough of the population that the benefits of network effects may outweigh those of physical store locations.", "score": 3, "replies": []}]}]}]}]}, {"body": "Its just a lot cheaper to use software to monitor people rather than having a boss occasionally walk behind their spot at a physical location", "score": 2, "replies": []}, {"body": "Honestly you're speculating on something you clearly and self admittedly don't have any experience with or understanding of.  Tesla showroom people are not the same as delivery center folks.  \n\nYou never once have to interface with a Tesla showroom person to buy a Tesla, let alone to do a trade in.  \n\nI'm only saying this because I've seen you be accused of spreading FUD and I didn't always agree (so I've defended), but this is most definitely a case of speculating out your ass.", "score": 1, "replies": []}]}]}]}, {"body": "I feel the same, we got the sell the news shorts + pessimists attack last Friday, now it’s going to be about reality and the reality is: Tesla is here to stay and is building more and more cars at an exponential pace.", "score": 0, "replies": []}]}]}, {"body": "35k! HW3 included. \n\n500k x ~$1-2k = .5-1 billion of lost revenue to NVIDIA for Drive PX 2 system. \n\nThat's insane to put so powerful computer to each car sold for 35k!\n\nElon must be confident in AutoPilot progress and I can't just imagine future OTA self driving features rolled out in \"trial\" mode with 1 click buy from car.\n\nAnd that possible quotes from surprised owners - \"I bought cheap EV and after 2 years it started to self drive!\" ", "score": 2, "replies": [{"body": "The main reason to include that powerful computer in 35k car might be Active Safety.\n\nIt should be turned on by default and used in all cars to actively avoid accidents - caused by driver or other drivers. \n\nIt would be very useful to use that data from all cars to improve neural nets in whole fleet. Active Safety is most important thing in self driving mode and Safety might be one word synonym for Tesla brand.", "score": 2, "replies": []}, {"body": "Dude, stop. FSD won’t come to fruition. People have been waiting for 3 years. Was promised for 2016, still does nothing.", "score": 3, "replies": [{"body": "The whole industry was over optimistic with pace of progress. At start the pace was fast but it slowed down.\n\nIt's normal for software product especially using new tech like AI/ML.\n\nBut it will come - nobody knows when but it's definitely possible.\n\nTesla is in good position because their fleet already has hardware for the job - cameras and sensors which collect data all the time.\n\nBTW pace slowed down because of scepticism from people who like that thousands of people get killed on roads every month but none could be killed by self driving tech.", "score": 2, "replies": []}]}, {"body": "Now how does they math look for all the cars they have to upgrade for free? Every car since October 2016 has been sold with the promise that it is FSD capable. If not you’d receive a free upgrade.", "score": 1, "replies": [{"body": "FSD capable means you have to pay for FSD option which wasn't the most popular one.\n\nYou can buy it later but that will cover computer upgrade. ", "score": 7, "replies": [{"body": "True, but the order rate for FSD is still pretty high in shear numbers even tho it’s low in percentages. Since V2 has been out for so long.\n\nIf you will indulge the skeptic in me, maybe that’s why they changed what is included in autopilot.\n\nEnhanced autopilot no longer includes Summon, Autopark, and navigate on Autopilot \n\nhttps://m.imgur.com/a/FwtMnOh \n\nThey may have to upgrade the systems for people with enhanced autopilot as well. Hard to say. ", "score": 2, "replies": [{"body": "The new boards probably cost Tesla about 100$ each to make.... ", "score": 0, "replies": [{"body": "There must be 2x board installed for fail over.\n\n100 USD is way to low - cheapest mobile phone cost that. Not powerful state of the art neural accelerator. ", "score": 4, "replies": [{"body": "Ha. A chip costs very little to make when you have it custom built. The markup on advanced chips is insane. That's why Tesla hired the most accomplished chip designer alive today to design their ASIC chip. It's way cheaper and 10x faster than what they currently use", "score": -2, "replies": [{"body": "One:your not taking about recouping R&D costs.\n\nTwo: yes the actual ICs are relatively cheap,  but the entire board will have a lot more cost. The chips aren’t socketed. The whole control board will have to be replaced.\n\n2018/03/28/tesla-autopilot-2-5-computer-model-3-s-x-first-look/amp/", "score": 2, "replies": [{"body": "Tesla already spent the R&D money. That expense has no impact on the future cost if installations of HW3. That should be very obvious.\n\nThe entire board cost could easily be around 100$ especially because the most expensive components are built in house.", "score": 2, "replies": [{"body": "https://smallbusiness.chron.com/capital-recovery-66134.html\n", "score": 1, "replies": [{"body": "Lol. You haven't taken financial accounting lately I guess. The full accounting of HW 3 value includes R&D expenses. The subset of HW3 deployment costs to legacy vehicles does not include R&D expense. That was incorporated into the pricing model for SELLING the FSD package in the first place. ", "score": 1, "replies": [{"body": "You just said it doesn’t matter if they have to recoup costs, it’s already spent.", "score": 1, "replies": [{"body": "It definitely matters in the overall accounting but it doesn't matter to the calculation of upgrade costs, which is a segment of the overall accounting of the FSD feature. ", "score": 1, "replies": []}]}]}]}]}, {"body": "In fact it wouldn't surprise me if they could sell the old hardware for.more than the cost of the new. Imagine a beowulf cluster of those!", "score": 1, "replies": []}]}]}]}, {"body": "Ok not sure I believe that cost, but even still shop labor and logistics to install will be significant.\n\nThe majority of the cost will be in the repair work.", "score": 2, "replies": [{"body": "Slot in replacement", "score": 1, "replies": [{"body": "So how much does it cost to schedule, and send out a tech in a mobile repair car? What is that 2 hours of labor? The cost of fielding a fleet and wear and tear on the mobile support vehicles. Plus the expense of the board, and the liability of messing up the car. The costs add up fairly quick. It’s a lot more than a $100 board.", "score": 1, "replies": [{"body": "The costs depend on many variables. Personally I would schedule them during battery coolant replacement and build custom tools and jigs to get it done in that time frame. I'm sure there are even cheaper solutions that spending more than 10 seconds thinking about the problem could reveal.", "score": 2, "replies": [{"body": "So you’re answer is to wait for a user to put on up to 50,000 miles before servicing the car for something they already paid for? That could take a user a year to hit, even if he already had miles on the car.\n\nhttps://www.tesla.com/support/car-maintenance", "score": 1, "replies": [{"body": "Yep. The features enabled by the new chip probably won't surpass the existing hardware for a while. But like I say I only thought about it for about 10 seconds. Of course it only took me about half a second to dismiss the idea that they would send dedicated service techs to each customer at home.... Lol.", "score": 1, "replies": [{"body": "They will be forced to service those vehicles, or people will sue them. They took money for a product, and haven’t delivered the product yet.\n\nTesla’s ability to service vehicles is already constrained. And in some places mobile service is the only option.", "score": 1, "replies": [{"body": "If there is no difference in car performance between the hardware versions until 2021 or so then they have no basis to sue. HW3 is not equal to FSD", "score": 1, "replies": [{"body": "And only a small part of Tesla owners opted to go for FSD i believe (most people were probably fine with AP already). ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "> NTSB opens investigation into fatal Tesla crash in Florida\n\nhttps://www.reuters.com/article/tesla-crash/ntsb-opens-investigation-into-fatal-tesla-crash-in-florida-idUSL1N20P02H", "score": -1, "replies": [{"body": "Really glad there was just this crash of a Tesla and not like 1000s of crashes with ICE cars.", "score": 1, "replies": []}]}, {"body": "So the stock got smoked yesterday. What happens next? We really want this to stabilize and no more tweets please !! \n\n&#x200B;", "score": 0, "replies": [{"body": "We got to keep this in persecutive this is a volatile stock. \n\nA 7% move is not the stock getting smoked. Stocks go up, stocks go down. Tesla has a propensity to move more than other is a pretty large range.\n\nAnything within the $280-$340 range is pretty normal for this stock. \n\nAs for Monday, idk tune in and find out.", "score": 7, "replies": []}]}]}
