{"title": "[Boeing] Ethiopian Airlines flight to Nairobi crashes, deaths reported", "selftext": "", "id": "azdszw", "created_utc": 1552207016.0, "score": 60, "upvote_ratio": 0.85, "num_comments": 66, "comments": [{"body": "I will be interested in the reason for the crash. Ethiopian is a well managed and well respected airline. They have a strong maintenance organization and their own MRO- meaning they do heavy checks and servicing for other carriers, including European carriers.\n\nLion Air is obviously a dog shit airline.", "score": 49, "replies": [{"body": "The failure is literally the same as back then. The plane took nosedive because it thought it's in 8000ft instead of 1000ft and it had the same problems after take off. Blame is on automatic stabilizers that constantly tried to correct the altitude.", "score": 22, "replies": [{"body": "Could you elaborate on what those automatic stabilizers did wrong when trying to correct the altitude?", "score": 3, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Damn, that's a horrible way to design a system without letting the pilots know on what to do.", "score": 2, "replies": []}, {"body": "Thanks for the explanation, Boeing should really be held accountable here", "score": 1, "replies": []}]}]}, {"body": "Right, I thought it was a pilot training issue before with Pilots not knowing how to turn this off.", "score": 4, "replies": [{"body": "Yeah I’m pretty sure blame went to pilot misunderstanding and maintenance negligence but now I think BA needs  better explanation   ", "score": 14, "replies": []}, {"body": "Boeing came out for the first one and blamed the pilots, this won't go nearly as easy now ", "score": 7, "replies": []}]}]}, {"body": "Foreigners love to blame their shitty airlines having crashes as a CIA plot. it's kind of cute.", "score": -10, "replies": []}]}, {"body": "It's looking like this accident is very similar to the Lionair crash from a few months back", "score": 22, "replies": [{"body": "Yeah, it is. The cause of the crash is literally the same.\n\nhttps://twitter.com/flightradar24/status/1104676048317362177", "score": 18, "replies": [{"body": "It's almost like it's a terrible fucking idea to allow the autopilot to fight the pilot", "score": 2, "replies": []}, {"body": "No, its not. The Altitudes are quite different and the speed is very different, you are also pulling random garbage out of your ass as nobody knows exactly what went wrong.", "score": -17, "replies": [{"body": "You must be holding Boeing calls huh? I'm sorry for your loss.", "score": 16, "replies": [{"body": "Thankfully I got in with a lot of shares at $55 per ;)", "score": 0, "replies": []}]}]}, {"body": "I ain't reading that tech shit. What was the cause and how do I get money from these lost lives?", "score": -2, "replies": [{"body": "short ba", "score": 1, "replies": []}]}]}, {"body": "Yeah, there seems to a serious issue with the design of the plane.", "score": 1, "replies": []}]}, {"body": "This is the second aviation disaster involving Boeing in less than one month, and second in the last 5 months involving their brand new 737 Max 8 planes they began to roll out in 2018. The details involving today's accident are currently being investigated as the crash just happened.  \n  \nUpdate 1: \"Ethiopian Airlines flight #ET302 dropped from radar 6 minutes after departure from Addis Ababa\n\nThe jet is a brand new Boeing 737 MAX 8 - delivered to the airline just four months ago.\"  \n  \n  Update 2: 149 passengers and 8 crew on board. No report of death toll.\n  \n  Update 3: All passengers and crew from 33 different countries are dead. ", "score": 34, "replies": [{"body": "There's something very wrong with the 737 Max.\n\nAt this point, I believe Boeing has departed from a core engineering ethos that once made them a great aircraft manufacturer. ", "score": 12, "replies": [{"body": "Even worse, they knew something is amiss back then yet tried to hush down the whole situation instead of issuing repairs to all ~100 planes of new 737 Max 8 model around the globe (yeah, it would be very costy but now it cost the lives of 157 people). \n\nIf I was passanger on board of 737 Max 8 I would certainly be very afraid of my life right now.\n\n", "score": 20, "replies": [{"body": "There were at least two or three significant issues that came out of Lion Air.\n\nThe single most significant issues is that the loss of a single sub-system (a single air speed sensor called a pitot tube) was a core/key factor that started the chain of events that cost everyone aboard that flight their lives.  This kind of thing is unexcusable in an aircraft carrying hundreds of people.  I would expect at least three separate pitot static systems each being independently measured and located on different parts of the airframe.\n\nThe next most important factor was the disengagement of the automatic flight control system.  Used to be that pilots only had to provide a certain amount of counter pressure and the system would give control back to them.  This was in-loop (pilots didn't have to remove their hands from the controls) and seamless.  Boeing apparently built the new automatic fight control system that was stronger than both the pilots combined.  Even worse, the automatic flight control system could only be turned off by mucking around with the flight control computer (disengagement was probably buried under layers and layers of menu options).  When an aircraft's nose is pushed down like that, gravity goes away for a while.  All the things that were easily done with gravity in place now become extremely difficult to do.  Human factors fail all the way around.  This is jaw dropping coming from Boeing.\n\nFinally, there's the issue of sensor fusion and cross check.  The avionics systems used in these aircraft have multiple ways of gathering the same or similar information.  The automatic flight control system that was determined to point the nose of the aircraft directly at the ground used exactly one of these pieces of information.  This is perhaps the biggest smoking gun that Boeing has completely lost the plot.\n\nThe crazy thing about all this garbage is that it's probably software fixable (well, maybe not the part about having multiple redundant airspeed sensors).... someone at Boeing software needs to come forward and redesign their flight control system for safety and human factors issues.", "score": 20, "replies": [{"body": "What the hell is automatic flight control anyway? We're taking away the autonomy of pilots at take off? That itself is insane. ", "score": 0, "replies": [{"body": "yeah so... if you fly a lot, you may have encountered pilots running through their checklists, on which one of the things to do is test the automatic annunciation system.  Things like \"Pull Up\" or \"Too Low\" or \"Too Slow\".\n\nThese are designed to identify hazardous situations/flight regimes.  Proximity to terrain, high decent rates, low airspeed, etc.   Typically there are control inputs that are automatically provided.  Flying a large modern multi-engine jet passenger aircraft, the pilots can get pretty divorced from what's going on with the aircraft.  Hydraulics sort of \"numb\" everything.  They become very dependent on instrumentation and procedures.  In a modern jet aircraft, high sink rate and low airspeed might be the only indication that the wing is in a stalled condition.  Doing things with the cockpit controls is one of the easiest ways to get the pilot's attention.  That's why you have things like stick shakers and automatic control input with warning alerts.  These are standard human factors devices that help pilots fly these aircraft safely.  This stuff gets turned on as per the check lists before takeoff.  There's nothing wrong with any of it and, when combined with what has become standard cockpit automation, these things make your flight no more eventful than a train ride.\n\nThat's why it's so shocking that Boeing has gotten this so wrong.  What's going on in these 737 Max cockpits prior to crash is a massive step backwards and should have never gotten into production.  The idea that Boeing would build a automated flight control system (autopilot if you like) that can overpower both pilots in a zero G condition is just insane.  Normally, I would expect this kind of crap out of Airbus, which has its own history of disastrous pilot interfaces in the cockpit of their aircraft. ", "score": 14, "replies": [{"body": "boeing did an oopsie", "score": 2, "replies": []}]}]}]}]}, {"body": "lol these plane models sound like what apple would name a new phone", "score": 6, "replies": [{"body": "The line is already set up... it's been running for decades with incremental improvements.  Engines are getting more powerful.  The FAA has well established two engine over water operational requirements.  Let's see how long we can make this metal tube. ", "score": 8, "replies": []}]}, {"body": "$balaq", "score": 1, "replies": []}]}, {"body": "Rest in peace..", "score": 3, "replies": []}, {"body": "Meanwhile BA new 52w high", "score": 2, "replies": []}]}, {"body": "https://imgur.com/a/tgxict9\n\nAlright, here's a link to Boeing's daily charts after the Lion Air crash.  I'm too lazy to hunt down the intraday chart.  It dropped $30 the next day, began recovery the day after.  Fully recovered in 4 days.  This time may be different since it's the 2nd crash of the same airframe, and one of their newest models, but I do think there will be a drop tomorrow and at least partial recovery by Friday.", "score": 14, "replies": [{"body": "There's going to be a huge drop for sure. For the first one it dropped 7% in one day although it did recover. This is the second one in their brand new fleet to crash with (an expected) huge loss of life, crashing in the same exact circumstances. Confidence in this airplane is shattered for consumers, and I'll bet the fleet will be grounded unless this one was crashed by a drunk pilot or something. I think it's going to go down 10% at minimum this time, possibly further depending on how airlines react to this crash and if it results in 737 max order cancellations. ", "score": 9, "replies": [{"body": "Will it be too late to buy puts on BA at open since pre-market trading will have already moved the price? Should we just buy calls for the inevitable pop back up?", "score": 1, "replies": [{"body": "The price is going to be moving really fast I think but I don't think it'll be too late.. I personally would hold off on calls. Last time this happened Boeing got the benefit of the doubt because it was a budget Indonesian airline company that crashed. Ethiopian is respected in the industry - no maintenance issues with this plane previously reported. This is going to not end well for Boeing unless this turns out to be one massive fucking coincidence. The 737 Max 8 is a huge part of the company and its about to be shunned by the world ", "score": 7, "replies": [{"body": "Nice, thanks for the informative DD! Gonna take a position and see how it plays out.", "score": 1, "replies": []}]}]}]}, {"body": "[BA basically controls the Dow](https://www.youtube.com/watch?v=dLt37SxNPt8) and heavily influences several other major indexes as well.\n\nAlgos are going to treat any drop in BA as a \"buying opportunity\".  Nope, there is going to need to be a massive legal settlement/outcome before BA corrects. ", "score": 5, "replies": [{"body": "Not gonna lie, I didn't watch the 21 minute YT video.  But I'm not saying there will be a \"correction\" but rather a \"reaction\".  Then a recovery some time after.  This is what literally happened in October, and this is nearly the same but happening for a second time.  ", "score": 4, "replies": [{"body": "The [core thesis is 13 minutes into the thing](https://www.youtube.com/watch?v=dLt37SxNPt8#t=12m55s).\n\nI hate the presentation, but the numbers are nothing less than astounding.", "score": 1, "replies": [{"body": "OK watched some of it this time, and that's actually pretty interesting.  However, I'm more interested in Monday plays for BA specifically.  Trying to put $500 on this in some form.  Either buying puts at open, and buying calls or selling bull put spreads after initial reaction.  So in that short-term context, I'm unsure of what effect the facts in this video will have.  Quicker recovery?", "score": 1, "replies": [{"body": "I'm going to guess that call/put options aren't priced appropriately given the tendency for algos to \"buy the dip\" or \"ride the trend\".", "score": 3, "replies": []}]}]}]}]}]}, {"body": "🙏 RIP 🤲 \n\nNow it is time to take this 🤡 stock to the woodshed. This will be a vicious dip because no one cared about the Amazon Prime disaster - apparently not even Bezos. ", "score": 6, "replies": []}, {"body": "As a long-term Boeing shareholder:\n\nFuuuuuuuuucccccccckkkkkkkkkk", "score": 3, "replies": []}, {"body": "Wife and I just checked to make sure the 737-800 she’s taking next week isn’t the same plane as the 737 Max 8. (It isn’t)\n\nThat’s where we are at. Thousands of business travelers this morning checking the equipment types on their American and Southwest bookings. \n\nHer comment after all this, “short the fuck out of Boeing.”\n\n", "score": 14, "replies": [{"body": "I'm travelling around right now and was actually in the air when this one crashed. I already blacklisted the MAX after the first crash and have paid more for a flight using another plane once already. Who the fuck is gonna wanna get on one of these things now. Airlines are going to be pissed about this because a lot of people are going to avoid doing business with them if they're flying the MAX. ", "score": 11, "replies": [{"body": "Agree. The prospects of the autopilot system crashing the fucking plane with the pilots unprepared or unable to recover it is terrifying. ", "score": 3, "replies": []}, {"body": "Couldn’t agree more with ya! Southwest tweeted that they stand behind the fleet and will continue to use them. That doesn’t sit well with me. I know that sadly they’re choosing money over safety (unsurprisingly so), but this is the end of my run with southwest until this gets solved. ", "score": 1, "replies": [{"body": "Oh well if it doesn't sit well with you, that's what matters. You're the head of the FAA right?", "score": 1, "replies": [{"body": "He literally just said he’s personally not going to fly Southwest, was that hard to understand?", "score": 2, "replies": []}, {"body": "You’re an asshole ", "score": 1, "replies": []}]}, {"body": "For all the jokes we make about China's safety track record, even they have asked all their airlines to ground these planes. I'd be pretty disappointed if American airlines didn't do the same until Boeing has definitively solved this issue.", "score": 1, "replies": []}]}]}, {"body": "traveling this week, also just confirmed 737-800 != max 8. potentially travelling every couple of months and there's no way in hell I'll fly on a Max 8.", "score": 2, "replies": [{"body": "Use Delta. Im long $DAL and they dont use the 737 max 8, so its a win win situation. You wont die and I will make some money. ", "score": 2, "replies": []}, {"body": "Looks like Delta and JetBlue do not use that aircraft so if you can swing one of those airlines! ", "score": 1, "replies": []}]}, {"body": "LUV is exclusively 737 carrier. Could be a good short too", "score": 2, "replies": []}]}, {"body": "How big is the chance that boeing is going to get all their 737's canceled? Also does anyone what % of their backlog are 737's?", "score": 5, "replies": [{"body": "There's a zero percent chance of that happening. The 737 is the most-produced commercial plane of all time.", "score": 3, "replies": [{"body": "I should have said 737 8MAX", "score": 3, "replies": []}]}]}, {"body": "Chinese assymetric warfare in action.", "score": 2, "replies": []}, {"body": "there were alot of high level enviromental UN personal im willing to bet someone had it sabotaged cause its in the caprialists best interest to get rid of these folks they probably had alot of data on the horrors of alot of their pollution and shit.", "score": 1, "replies": []}, {"body": "in b4 no dip\n\nduopolys ftw 🌛🤣", "score": 1, "replies": [{"body": "There is 100% ***certainly*** going to be a dip in BA's stock price. They won't escape from this crash as easily as the last one. I mean the first one dipped the price, and that was just a budget airline so it could have just been a fluke. This time it crashed for the *same exact reason* but with a highly respected and well managed airline. Makes it very hard to see this as just a coincidence. The stock will probably drop by more than 10%.", "score": 2, "replies": []}]}, {"body": "Short $BA", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Driving is so safe I do daytrades while driving. ", "score": 8, "replies": []}]}, {"body": "Buy ze dip", "score": -4, "replies": []}, {"body": "Buy da dip! ", "score": -4, "replies": []}]}
