{"title": "TESLA opinions?", "selftext": "Does anyone still believe in Tesla after the model y came out and people were disappointed? Buy hold or sell?", "id": "b20lx0", "created_utc": 1552790498.0, "score": 76, "upvote_ratio": 0.84, "num_comments": 71, "comments": [{"body": "Personally, im about to buy back in next week. I expect the Y to sell like hotcakes, despite the underwhelming reveal. and soon the China factory will be up, increasing output. I see this did as a good deal. I'm looking to get in around 270-275 depending on Monday open.", "score": 75, "replies": [{"body": "Have you seen how far the work for the battery factory is? If I haven‘t been fooled they have done basically nothing of the work", "score": 4, "replies": [{"body": "That question makes no sense wtf are you trying to ask? Distance to travel, time to completion?", "score": 0, "replies": [{"body": "How much of the progress is done, sorry not native", "score": 3, "replies": [{"body": "Reportedly it’s not far off, a month or two most I think", "score": 1, "replies": []}]}]}]}, {"body": "I've been thinking 260 but should I reconsider?  Is this just a feeling or supported by data?", "score": 6, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Sure, in theory.  To me, that's getting too cute trying to time it.  ", "score": 17, "replies": []}, {"body": "Start laddering in until $250", "score": 1, "replies": []}]}, {"body": "For 4% difference might as well grab it at it's current price especially if it's for the long term.", "score": 6, "replies": [{"body": "I dont trust it long.", "score": 3, "replies": [{"body": "If you don't trust it long then why invest in the first place?", "score": 13, "replies": [{"body": "He's seen Tesla's chart and thinks it will continue to act this way. To be fair it probably would, but I personally wouldn't want to dump money for a swing if I wouldn't mind staying invested long term. You can use a stop loss but it feels like those always get fished out. ", "score": 5, "replies": [{"body": "That's why i asked. It looks like he's in for a gamble", "score": 3, "replies": [{"body": "You are correct, it is a gamble for me. ", "score": 1, "replies": []}]}, {"body": "You are correct, and I appreciate the insight.  I'm a novice but have made some good moves and started practicing and monitoring markets in 2007.", "score": 1, "replies": []}]}, {"body": "Buy low, sell high. Ima novice investor but this stock seems to follow somewhat of a cycle. ", "score": 1, "replies": []}]}]}]}, {"body": "If be happy to see such a good deal! More savings. I'll just look at the charts again Monday and see what it looks like.", "score": -1, "replies": []}]}]}, {"body": "The practicality and ability for TSLA to deliver on the Model Y is probably the greatest buy signal in recent time. The 3 is an excellent car. Production has been mastered. This translates to a much easier manufacturing for the Y with likely slightly higher margins. \n\nForgot to add, I’m holding. TSLA is my largest aggressive holding. If I had more money to throw in, I would say add. ", "score": 30, "replies": [{"body": "I think many will be surprised at how quick model Y production ramps (despite knowing it shares 75% of parts with Model 3).", "score": 9, "replies": [{"body": "As an engineer, having already built something very similar really makes things go so much faster and smoother.  They are going to make a lot of money", "score": 12, "replies": []}]}]}, {"body": "Yep, the Y model is great, it all comes to if they can deliver the cake.", "score": 15, "replies": []}, {"body": "What i’ve seen is that investors in TSLA are very underwhelmed, but TSLA customers are excited. I think the Y will fly off the shelf.", "score": 4, "replies": []}, {"body": "Underwhelming reveals are kindof the norm for the auto industry, so I’m hoping this means the hype cycle is over for Tesla and they can get started being a normal, boring (eh? Eh???) car company. ", "score": 6, "replies": [{"body": "Elon just tweet a photo of pickup .... all news source goes wild! Yea, don’t think so. Hype is still strong. (Regardless if you see it as good or bad)", "score": 2, "replies": []}]}, {"body": "While the reveal for the Y was underwhelming, current/potential investors should be over the moon with the direction they took.\n\nYes, a cool new redesigned vehicle with incredible  innovative tech would have been great to see. However, this vehicle is exactly what needed to be made to show the company is a serious automaker.\n\nEssentially, proven platform with minimal adjustments needed to manufacture. \n\nNot only should demand be high, the company should be able to pump these things out rapidly.\n\nI’m a fan of this company for sure. So maybe this post is biased. But overall, the move makes sense.\n\nAt the end of the day, the Y is supposed to be a lineup enhancer and easy money maker. And it’s exactly what played out.", "score": 2, "replies": []}, {"body": "I think the model Y will pick up in the North American market. Elon is not ahead of the momentum that is crossovers/SUVs in the United States. \n\nMany manufacturers are dropping their sedan models ( which Tesla primary consists of/ profits off)\n\nTo make it simple. Americans are buying suv so here is a SUV \n\nHold / Buy", "score": 4, "replies": []}, {"body": "Way under valued atm. $TSLA is on sale. Load up.", "score": 4, "replies": [{"body": "It’s tough to say TSLA is undervalued unless you mean your gut is telling you it’s gonna go up... just because.", "score": 6, "replies": []}, {"body": "Interesting argument ", "score": 3, "replies": []}, {"body": "The market cap is insane compared to Ford  and GM. They're overvalued if anything. That's not to say it can't go back up though. ", "score": 2, "replies": [{"body": "At first glance this seems fair.\n\nBut look closer.\n\nI'll take the company whose revenue growth and production growth are exponential (on products which themselves sit on top of markets whose size is growing exponentially).", "score": 1, "replies": []}]}]}, {"body": "Jumped out at $345, not going back in.\n\nI rode that elevator too many times. The car is good, but the problem is Musk.", "score": 4, "replies": [{"body": "Musk is both the problem and the solution, if he leaves it nosedives. If he stays, more fuckery. Take your pick ", "score": 3, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "This is a good argument and all, yes, the quality isnt the greatest, but at this point the company needs to focus at getting as many cars as possible on the road. Each time a car hits the road, Tesla has a small lab running around generating data - from around the world. Data will propel AI, and AI is the big thing for the car industry - and Tesla will have a huge advantage against its potential competitors. This is where I see a huge bull case to be made.", "score": 9, "replies": [{"body": "You bring up an excellent point about them being ahead of the curve with AI self driving tech. I think people underestimate how valuable that is.  I was able to borrow a model S for a weekend (my dad's) with the current self driving features and even that was a phenomenal taste of what is to come. \nI turned on autopilot and totally disengaged myself playing on my phone. It warned me to put a hand on the wheel, I ignored, it warned again, and then started slowing down and pulling over. Of course I took the wheel and got up to speed again but then autopilot wouldn't work! It was punishing me and I thought that was hilarious and fantastic at the same time. I tool an exit, put in park, and then got going again and it worked as long as I kept one hand resting on the wheel. \nI know cruising on the highway seems like the easiest part of driving but I was surprised by how awesome it was to have the car change lanes on it's own, cruise perfectly down the lane, and even take the exit with no effort or stress on my part. Can't wait for full self driving!", "score": 4, "replies": [{"body": "Yea, and when Musk says/jokes (im not sure which with him) that Teslas will be safe enough to sleep in by the end of 2019 he really has substantial evidence to back it up. Look at the guy who fell asleep behind the wheel and got filmed having autopilot on in his Tesla. This is something the bulls really have backing them up.", "score": 2, "replies": []}]}]}, {"body": "Mercedes is archaic compared to the S and X.  Get real", "score": 0, "replies": []}]}, {"body": "The main reason it’s $275 not $1 is Musk too. ", "score": 1, "replies": []}]}, {"body": "The company is running on debt. I would stay away. ", "score": 2, "replies": [{"body": "The USA as a whole is running on debt. Should we just stay away ?", "score": 13, "replies": [{"body": "The entire world runs on debt", "score": 9, "replies": [{"body": "Speak for yourself peasant.", "score": 5, "replies": [{"body": "Debt is a commodity. Whether or not we’re financially in debt, we’re contributing to debt by even using reddit. ", "score": 2, "replies": []}]}]}, {"body": "Yea but invest in a company that has the cash to back it up or that produces enough revenue to cover its operating cost.  Tesla has not made a profit in years.    ", "score": 1, "replies": []}]}]}, {"body": "Sell, they're overvalued af. ", "score": 1, "replies": [{"body": "Like thr last  3 years and shit hasnt changed?! No thx 4 ure advice", "score": 6, "replies": []}, {"body": "Still have so many issues that people fail to see. There’s entire YouTube channels devoted to how shitty they are. ", "score": -7, "replies": [{"body": "Lol", "score": 3, "replies": [{"body": "Lol. From a guy who knows people who had theirs totaled from accidents any other car would have been fixable. They have serious manufacturing issues. Why anyone fails to see this is beyond me. I love what they stand for, but are not sustainable until they catch up in both customer service and parts availability. ", "score": -9, "replies": [{"body": "I’m just laughing at the fact that you cited the existence of YouTube channels on the subject as support for your argument. ", "score": 13, "replies": [{"body": "I mean yeah it’s a garbage ass excuse but they wouldn’t exist if it wasn’t an issue. I really hope they get their shit together. I just don’t see them being sustainable for now. Take your upvote, because I get it lol. ", "score": -1, "replies": [{"body": "What major company doesnt have youtube channels about how they are shit?", "score": 1, "replies": []}, {"body": "do you mean the earth could be flat and vaccines cause autims? there are hundreds of facebook sites about this... hm...", "score": 0, "replies": []}]}, {"body": "No problem when it‘s raining and you get wet in the car right? This support for Tesla is pathetic", "score": -1, "replies": [{"body": "Where do you see Tesla support in what I said?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "It's going to drop more.", "score": 1, "replies": []}, {"body": "It's a cult stock, like Namaste, but I'm a fan of what they do.  ", "score": 1, "replies": []}, {"body": "my average is about 295 dollars per share and i feel like the only thing i can do right now is to wait. ", "score": 1, "replies": []}, {"body": "I'm down like 8% on TSLA right now but I'm pretty sure it'll go back up within 6 months. ", "score": 1, "replies": []}, {"body": "When Tesla was growing and released new innovations periodically like the Autopilot feature, Powerwall and Model 3, people were optimistic and the stock used to trade at \\~$200 between 2014-2016. But now, \n\n1. Reviews of Model Y are not coming in that strong.\n   1. Model Y just a variant of Model 3 - [https://www.slashgear.com/tesla-model-y-5-things-electric-crossover-price-release-market-reaction-17569942/](https://www.slashgear.com/tesla-model-y-5-things-electric-crossover-price-release-market-reaction-17569942/)\n   2. Model Y has very minimal space in its third row, too congested for an SUV - [https://www.youtube.com/watch?time\\_continue=445&v=TL06MxVDH4M](https://www.youtube.com/watch?time_continue=445&v=TL06MxVDH4M) \n   3. More expensive to book, currently $2500 compared to previous $1000 for model 3.\n2. Past issues\n   1. Consistent delays in delivery of Model 3 -[https://electrek.co/2018/09/05/tesla-model-3-delivery-growing-pains-delivery-delays/](https://electrek.co/2018/09/05/tesla-model-3-delivery-growing-pains-delivery-delays/)\n   2. Paint finish issues, system malfunctions, and poor customer service with Model 3 - [https://www.cheatsheet.com/money-career/the-biggest-problems-tesla-model-3-owners-have-reported.html/](https://www.cheatsheet.com/money-career/the-biggest-problems-tesla-model-3-owners-have-reported.html/)\n\nAfter the string of disappointments, I would say it is likely to fall back to same level. \n\n [https://grufity.com/historical-data-chart-graph/TSLA.INV@Anna48391/TSLA-Are-the-glorious-days-of-Tesla-a-thing-of-the-past](https://grufity.com/historical-data-chart-graph/TSLA.INV@Anna48391/TSLA-Are-the-glorious-days-of-Tesla-a-thing-of-the-past) ", "score": 1, "replies": []}, {"body": "I don't invest in meme stocks. A great company with a great vision, but no thanks", "score": 0, "replies": []}, {"body": "They need cash.  Until you hear of a capital raise, I would stay away.  This is new territory, not the $300 stock price game.  ", "score": 0, "replies": []}, {"body": "I think elon is playing everything safe since the SEC imposed fines. He seems tame and not playing his usual stock pumping games. But i do think this quarter will miss pretty badly and eventually the stock will see 350-380 level again. But i like NIO at $6/share a bit more.", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "That was the opinion of say 2010, and it’s even more wrong today. Battery tech is improving exponentially (say 10%/year), meaning range will keep getting longer. Batteries will keep getting cheaper. Charge times will keep getting faster.\n\nEvery car manufacturer is now betting their future on electric cars. They used to think exactly what you did.\n\nAlso, as climate change accelerates, there will be even more pressure to switch in addition to the superior technology. And some places like China (governmentally) and Norway are already ahead of that curve. \n\nI think the transition will be even faster than we imagine. Especially if we come up with some other kind of clean energy source. ", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Compounding is exponential, yes. That means battery capacity doubles roughly every 7 years.", "score": 1, "replies": []}]}]}]}, {"body": "SpaceX and Tesla will go places as long as Elon is there.  As soon as the big government SEC cucks take him out they are over.    \n\n&#x200B;\n\nThe private market can only make things good for a small time before big brother takes it as a threat.  Trump 2020", "score": -8, "replies": [{"body": "I cannot figure out why you are being down voted. surely it wasn't the Trump 2020 bullshit", "score": -1, "replies": []}]}, {"body": "At the Geneva Motor Show this year, a lot of electric cars. Competition becomes very worrying.\n\nhttps://www.gims.swiss", "score": -1, "replies": [{"body": "Exactly. Tesla doesn't do anything special. If/when electric cars develop major demand then the big boys will step in and eat Teslas lunch ", "score": 2, "replies": [{"body": "They make their own chips and have 100x more driving data than anyone else. The 3/Y interior looks like no other cars. Other companies including Porsche are admitting they are taking their cues from Tesla. They are the only car company that also has an energy company inside of it. They are more vertically integrated. They are building their own battery factories. Their brand is loved by many and hated by many.\n\nTesla is at risk of competition for sure, are definitely behind in at least one area (supply chain and manufacturing), but is disingenuous to say they are just another car company. ", "score": 3, "replies": []}, {"body": "This is where you are wrong.  Do a little homework.  Tesla does many things drastically differently than everyone else in the industry and the big boys are so stuck in their ways and at least 10 years behind in the R&D to catch up.  Whens the last time the big boys pushed an OTA update that increased performance and range of one of their vehicles?  NEVER....that's when.  How about the fact Tesla has 3 control units in the model 3 while a base model Civic has 20+?  Ever see a dashboard as compact as the model 3.....nope, because of the design they use for the HVAC system is revolutionary in the industry.  The big boys are trying to turn their traditional ICE cars in to EV's........Tesla is trying to make the best EV's from scratch and are not confined to old traditions or standards.  I work for one of the top 5 auto manufacturers.....I see whats in the pipeline 5 - 10 years down the road......nobody has anything on Tesla if they can get their production ramped up....... that's why I bought one......and then a shit ton of stock.", "score": 1, "replies": []}]}]}]}
