{"title": "$TSLA Daily Investor Discussion - March 13, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q419 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/alewpn/tesla_q4_2018_financial_results_and_qa_webcast/).\n", "id": "b0jsym", "created_utc": 1552467874.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 67, "comments": [{"body": "[removed]", "score": 17, "replies": [{"body": "Please make a formal post about this so it doesn’t get buried in the comments.", "score": 6, "replies": []}, {"body": "Virtually everyone in that thread had no idea what Jonas meant by exit EBITDA, and then complained using a 10x multiple isn't fair because of Tesla's current growth rate.  Was a bit funny and sad given this is supposed to be an investment forum.", "score": 9, "replies": []}, {"body": "Repost this as its own thread. It's that good.", "score": 1, "replies": []}, {"body": ">The second thing is that a lot of people here seem to think that investors are negative on Tesla. The opposite is true. There is no large company I am aware of with a more positive result implied in valuation. Investors are incredibly positive on Tesla as a business and that is why it has a huge valuation relative to its business prospects today.\n\nInvestors who are not Adam Jonas you mean. Since if the average investor made their decisions based on his analysis the stock would be trading at $200.\n\nAlso 1.7 million cars in 2030 is a very bearish case.", "score": -2, "replies": [{"body": "He is talking about investors generally, as reflected in the current stock price.  ", "score": 7, "replies": []}]}, {"body": "One thing to keep in mind with that though is that analysts have largely underestimated the companies they are most positive about in the last 10 years when it comes to tech companies.\n\nFor an analyst there is no reward in being exactly right.  There is only a reward for being more right.  \n\nWhich is why people shorting FANG have done so poorly despite people being so optimistic about FANG.  If you have the highest expectations there is no reason to go higher even if you are wrong.", "score": -2, "replies": []}]}, {"body": "For the curious: volume is really low today.  \n  \nHolding their breath on SEC news and/or the Y unveil perhaps?", "score": 3, "replies": [{"body": "people understand that Y reveal is a very positive event and should cause some upward motion\n\n&#x200B;\n\non other hand, manipulators won't miss a chance to check SLs of enthusiastic bullish traders: seems likely (to me) there will be a massive FUD+SEC+else attack orchestrated on 15th right after event.\n\n&#x200B;\n\nhence the low volume, folks don't mind to rally but wait for two major things to happen: new SEC case resolved and Trump-China trade war to end", "score": -3, "replies": [{"body": ">people understand that Y reveal is a very positive event and should cause some upward motion\n\nThe two best words in the English language: priced in.", "score": 3, "replies": [{"body": "nah, I bet you anything, anything - words \"no worries it's *priced in*\" ruined more lives than \"no worries it's *not loade*d\"", "score": 2, "replies": []}]}, {"body": "> people understand that Y reveal is a very positive event and should cause some upward motion\n\nLike how the $35k news was also a very positive thing that caused some upward motion? I don't think people know what to expect really, could go either way depending on the details.", "score": 2, "replies": [{"body": "> Like how the $35k news was also a very positive thing that caused some upward motion?\n\nExactly. For every positive sounding news, there is a negative way to spin it. In the case of the Model Y unveiling, people will start asking if the wait will take away sales from the 3 as people wait.", "score": 1, "replies": []}, {"body": "35k was good news for the consumer, but not for the investors. Just like raising prices was the other way around.", "score": 1, "replies": []}]}]}]}, {"body": "**Just Three Companies at Top of Navigant’s Autonomous-Vehicle Ranking**\n\nhttps://www.wardsauto.com/technology/just-three-companies-top-navigant-s-autonomous-vehicle-ranking", "score": 3, "replies": [{"body": "I've said it before, it's the most ludicrous ranking system ever.\n\n>. Navigant awards points to each company based on 10 factors: vision; go-to-market strategy; partners; production strategy; technology; sales, marketing and distribution; product capability; product quality and reliability; product portfolio; and staying power.\n\nProduct capability is the only thing that matters in the FSD race.", "score": 5, "replies": []}, {"body": "I think this needs a bit more background. On its own that article made no sense.\n\nApple is neck and neck with Tesla on the graph.", "score": 2, "replies": [{"body": "The more background is that if you don’t cooperate with firms like navigant when they come snooping around for information, you get rated poorly in these studies since they don’t have the info to score you properly. I bet that happened here.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Mapping isn't that hard or intensive. Google Maps has been doing it for years. The harder part would be ensuring the car could react to a change in the map such as a fallen tree or something. If they can reach full FSD on their localized maps I wouldn't be surprised to see most of the US mapped within a year or so. ", "score": 1, "replies": []}]}]}, {"body": "**Goldman: Tesla's earnings and deliveries likely to disappoint this quarter so sell the stock**\n\nhttps://www.cnbc.com/2019/03/13/goldman-teslas-earnings-and-deliveries-likely-to-disappoint-this-quarter-so-sell-the-stock.html", "score": 2, "replies": [{"body": "Goldman has a pretty crappy track record with Tesla ratings, I don't know why anyone listens to them anymore...", "score": 3, "replies": []}, {"body": "For the lazy: the sell recommendation is based on a 12-month price target of $210.  \n  \nIt seems the primary driver for that target is low demand of (high-trim) 3, S, and X.", "score": 1, "replies": []}]}, {"body": "**Tesla model 3 interest explodes in March**\n\n>https://imgur.com/a/iZnlQkU", "score": 7, "replies": []}, {"body": "GS reiterates sell rating and $210 price target.", "score": 4, "replies": [{"body": "They cut their EPS guidance for 2019 from 2.46 to 1.88.\n\nSo they are still expecting a profit this year.", "score": 6, "replies": [{"body": "I love the spread in EPS guidance for the year from different analysts.  Some are as low as -$4.00 and some are as high as $5.50.  For a company like GM the low and high estimates are like $6 to $7.", "score": 8, "replies": [{"body": "I mean this stock is completely disconnected from reality.", "score": 6, "replies": [{"body": "That's a meaningless statement. Of course it is connected to reality. ", "score": 4, "replies": []}, {"body": "Sure, but the fact that analysts seem to completely have their heads up their ass doesn't help with the stock's valuation or volatility.  If two \"professionals\" can look at the company, and one walks away thinking they'll earn a profit of $700 million this year and the other thinks they'll lose $700 million, that doesn't reflect well on the analysts.  ", "score": 2, "replies": [{"body": "If one comes away saying Tesla will make 2$ a share, and GM will make $6 a share. Yet they value Tesla more than GM something is wrong.\n\nEven at 2021 MS had them at 3.86", "score": 1, "replies": [{"body": "Yes, there is clearly an issue if they plug everything into a DCF model and then give the one with the lower NPV a higher valuation, but my point is they are just throwing darts at the model inputs to begin with.", "score": 2, "replies": []}, {"body": "You spend a lot of time on reddit when you really need to spend more time thinking about how valuation works and what p/e means and so on.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Obligatory [The planet will be fine. The PEOPLE are fucked.](https://www.youtube.com/watch?v=7W33HRc1A6c)", "score": 3, "replies": [{"body": "Haha, awesome, thanks! I needed this in my life.", "score": 1, "replies": []}]}]}, {"body": "u/ElonsMonkey I want an update on your netflix bet, now that's it's at 360", "score": 2, "replies": [{"body": "I forgot what the bet was", "score": 2, "replies": [{"body": "I remember you said you had a big nflx position when it was in the 270-280 levels. You said you had too much and was going to sell when it was going back to higher levels. Just curious what happened with that ", "score": 1, "replies": [{"body": "Oh yeah that worked out fantastically. I was buying Jan 2020 300 calls all the way down to the bottom (prices bought ranged from 25-45 and sold from 45-80), and I've now sold all of those off. I was making heavy bets too. 360-400 is my 'fair range' for NFLX so I'm back at my core position where I don't expect much more than 15-20% per year. Anyway, good thing too since TSLA is such a turd. Fortunately I haven't been trapped into buying TSLA at high prices since I've generally agreed with the market that the outlook has dimmed.", "score": 5, "replies": [{"body": "Well I'm glad to hear that. I did end up opening a small netflix position a little below 300 even though I was a little sceptic. And about tsla lol, even though I'm still a bull I haven't even bought any tsla since 2016,stock performance has been a bit disappointing that's for sure", "score": 2, "replies": []}]}]}]}]}, {"body": "1 more day...", "score": 2, "replies": [{"body": "Why?", "score": 2, "replies": [{"body": "Y", "score": 7, "replies": []}]}]}, {"body": "Some thoughts on Model Y:\n\n1. If it is a really good car and well received, it could exacerbate demand issues for the Model 3 as would-be Model 3 buyers decide to wait a little longer for the Y instead of the 3. BUT! Maybe it will generate some large deposits and give Tesla some much-needed cash. Question is if cash deposits are more valuable than current Model 3 sales? I generally think the answer to that is \"no,\" but that's JMO.\n\n2. If it is a nonevent (half-baked presentation, few details, no timelines, ridiculous pricing, etc.), the market won't look at it favorably. Fewer deposits, too. Stock will likely drop.\n\nHard to see how this works out and gives Tesla a short-term pop in the stock as many expect. What do you think?", "score": 2, "replies": [{"body": "1. I think Model 3 having \"demand issues\" is completely unproven, with more evidence pointing towards the opposite (we'll all know soon enough). I could see some people waiting, but it's just a different segment, it's not a better car, some people are sedan buyers, some are crossover buyers. Model X didn't effect Model S demand as far as I remember.\n\n2. I agree, but I don't think any of those things are likely. I think all Elon presentations are a little awkward, and I'm sure this will be similar. Who knows on details, Model 3 was pretty low on details, but the stock did well if I recall because of the insane reservation numbers. They'll obivously have some sort of timeline. I think deliveries by the end of 2020 is what is expected, I think it's pretty possible that they'll be much sooner than that, and if they're as soon as Q4 that might give us a nice bump (possible with a GA4 type assembly line or taking over GA4 entirely since they're 75% similar). Elon has basically already announced pricing, 10% more than Model 3.\n\nI also think Elon loved surprising people with the Roadster at the Semi unveil, so I would be surprised if he doesn't have another trick up his sleeve.", "score": 5, "replies": []}, {"body": "Regarding number 1:\n\nI agree with you on number 1.  **Anecdotal:** I'm waiting to order until Thursday night. I've been planning to purchase a 3 for months. I was going to pull the trigger, but I need to see the Y before I do it. I have no idea what could swing me away from a sports sedan to a CUV, but for some reason I find myself having to wait. *I have no idea how many other might possibly be as weird as I am.*\n\n&#x200B;\n\nRegarding number 2:\n\nI don't see this happening. One thing that Tesla gets right is theatrics and presentation. That's part of the silicon valley DNA when it comes to big product announcements. Even the Boring company presentations were reasonably high production.. and that's just digging tunnels.\n\nTo be fair, that doesn't mean that they vehicle will be perfect or stunning. The vehicle might be ugly AF (unlikely, but absolutely possible). That could sink the launch (which might then be very good for model3 sales, but overall bad for tsla).", "score": 3, "replies": []}, {"body": "It doesn't really matter if Tesla sells 400k or 500k cars this year. Their cash balance is solid and funding for gigafactory 3 is secured. \n\nThe important part is whether Tesla will be selling 1 million or 10 million cars in 5+ years time. Model Y is a chance to update in either direction.", "score": 2, "replies": []}]}, {"body": "I think they are really close to reaching profitability this Q.\n\n>Deposits for Y/truck\n\n>Discounts on cars to push sales\n\n>Discounts on car upgrades\n\n>Laying off staff \n\n>Rumor about already reaching profitability in q1", "score": 1, "replies": [{"body": "I too hope they are profitable this quarter. In an effort to help me better manage my own expectations, would you please help me to better understand a few of your points?\n\n&#x200B;\n\n>Deposits for Y/truck\n\nCan they realize these as profits? I thought that reservations aren't included in the financial statement until they vehicle is delivered. Perhaps I misunderstood this accounting practice?\n\n&#x200B;\n\n>Laying off staff\n\nI see this helping in Q2, but for Q1 don't they still have to pay severance packages? Perhaps I don't fully understand the financial arrangements with all of the layoffs. Could you help me out by pointing me to a source?\n\n&#x200B;\n\n>Rumor\n\nWhile this makes me hopeful, I don't know how this helps us establish a factual basis. Could you help me out by citing a source and its credibility?\n\n&#x200B;\n\nThank you!\n\n&#x200B;", "score": 7, "replies": [{"body": "Deposits are held as liabilities on the books.\n\nhttp://ir.tesla.com/node/19496/html#Consolidated_Balance_Sheets\n\nPage 72", "score": 7, "replies": [{"body": "You so fast. Thank you for the citation.", "score": 3, "replies": []}]}]}, {"body": "Deposits don't affect profitability. Discounts hurt margins leading to lower likelihood of profitability. \n\nNot sure about your \"rumor\". Profitability isn't something you reach in the middle of the quarter like a delivery estimate. They could currently be profitable but then burn 100m and have profit turn negative by the end of the quarter.", "score": 10, "replies": []}, {"body": "They were profitable in Q3 and Q4.  Why would those things make you more bullish?", "score": 1, "replies": []}, {"body": "I don't think profitability will really move the stock again.  Its all about growth and FSD.", "score": -8, "replies": [{"body": "https://youtu.be/ztVMib1T4T4", "score": 4, "replies": [{"body": "Don't get me wrong I think a guidance for at least small profits is important.  But I expect the company to focus on growth.", "score": 0, "replies": [{"body": "Ok, that’s fair and a different thing.", "score": 3, "replies": []}]}]}]}]}, {"body": "*In this Special Episode of Hidden Forces, Demetri Kofinas speaks with Ed McCabe and Montana Skeptic*\n\nhttps://www.hiddenforces.io/podcast/tesla-sec-elon-musk-contempt-ed-mccabe?utm_source=Twitter&utm_medium=Social&utm_campaign=SE_Ed_McCabe", "score": 1, "replies": [{"body": "Good podcast if you guys are looking more a more bearish line of discussion. Both Ed and Montana are interesting people to listen to.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Id say there's already not much being published here", "score": 7, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Did you forget to sign into your alt account?", "score": 5, "replies": [{"body": "No, I read what I wrote and thought it was funny. I should really stop trying to be funny.", "score": 0, "replies": []}]}]}]}, {"body": "Proof that realtesla wants tesla to die\n\n>\thttps://imgur.com/a/OEMAXK7", "score": -9, "replies": [{"body": "This is childish.", "score": 13, "replies": [{"body": "Better here than as a post, but I'd say leave it and let people discuss it.  \n  \nIt's not acutely relevant, but it is a fair discussion point.", "score": 1, "replies": [{"body": "I mean, you guys do what ya want. I’ve said my piece.", "score": 5, "replies": []}]}]}, {"body": "sometimes. but mostly I want it's valuation to look more comparable to its peers.", "score": 3, "replies": []}, {"body": "At least it isn't a lawless group that actually crosses the border to organizing more substantial real world harms. That's always possible with mobs of fundamentally unhappy people.", "score": 0, "replies": []}]}]}
{"title": "RIP $BA? United States now joining rest of world in grounding Boeing planes", "selftext": "", "id": "b0pjlo", "created_utc": 1552502350.0, "score": 154, "upvote_ratio": 0.96, "num_comments": 60, "comments": [{"body": "that's 74 planes in this country. I'm having a hard time imagining how much outrage it will cause on both public and airlines side but F", "score": 51, "replies": [{"body": "Also, Paris Airshow in 3mo.... BA will have alot of positive publicity for the next few months to counter this. Barring any major order cancellations, count on 777x publicity as well as other stories to keep a positive vibe + expect some 5D chess level spin doctoring.... fun fact 737max fuselage fits in the diameter of the 777x engine cowling ", "score": 17, "replies": [{"body": "Smh. This is going to drag out like a United Airlines passenger ", "score": 9, "replies": []}]}]}, {"body": "Trump loaded up on FD 3/15 350 puts and needed some tendies for the wall", "score": 142, "replies": [{"body": "Legit question, theoretically would that count as insider trading?", "score": 32, "replies": [{"body": "Sitting presidents can’t be indicted. Haven’t you realized this by now", "score": 80, "replies": [{"body": "His legal team is currently advising him to never stand up again", "score": 74, "replies": [{"body": "Shouldn't be hard with so much thicc on trump's rear.", "score": 11, "replies": [{"body": "Might Inflame those bone spurs. Definitely shouldn’t stand. Except maybe to play golf. ", "score": 5, "replies": []}, {"body": "Like a couple dozen McChickens", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 24, "replies": [{"body": "“I have the worst fucking attorneys”\n\nNow that I think about it, Michael Cohen does kind of seem like a real life Barry Zuckercorn. ", "score": 10, "replies": []}, {"body": "Just started watching this show. It's pretty good.", "score": 2, "replies": []}]}, {"body": "Congress is exempt from insider trading laws. Not sure about the President.", "score": 11, "replies": [{"body": "So Romney loaded up on FD puts earlier then", "score": 2, "replies": []}]}, {"body": "It would, probably just result in a fine and a non-indictment.  DOJ won't indict a sitting President but SEC is civil so they'd probably proceed regardless.", "score": 1, "replies": []}, {"body": "I mean he’s heavily invested in oil companies and lifted restrictions on them", "score": 1, "replies": []}, {"body": "Yes.  It's explicitly made illegal in the STOCK Act of 2012.  It can be brought as a civil case by the SEC for a maximum fine of three times the profits, or as a criminal case by a federal prosecutor with a maximum jail sentence of 20 years.", "score": 1, "replies": []}]}, {"body": "Who among us can honestly say that we wouldn’t do shit like that routinely if we were president?", "score": 3, "replies": [{"body": "I might be too busy going to Fort Bragg and playing with all the cool shit Delta has.   ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 61, "replies": [{"body": "Are you expecting me to read now?", "score": 62, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "lol I know .. I thought the title was obvious, didn't think anyone would think it meant *all* Boeing planes.", "score": 8, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Interesting. Got any inside info for me?", "score": 5, "replies": [{"body": "Hi, I’m Boeing. Buy the dip. ", "score": 17, "replies": [{"body": "Thank you bby", "score": 5, "replies": []}]}, {"body": "Yes Mister SEC, this guy\\^.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Will airlines with these planes be able to pursue Boeing for lost revenue?", "score": 9, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "Why the nickname scarebus?", "score": 3, "replies": [{"body": "Ever ridden on an A320?\n\nhttp://www.askthepilot.com/questionanswers/the-barking-dog-airbus-noises/ ", "score": 7, "replies": [{"body": "Lol that was actually scary the first time i encountered it. Didn't help i was flying spirit like a poor. ", "score": 7, "replies": [{"body": "Get these motherfucking ghost dogs off my motherfucking plane", "score": 7, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "They will as long as the FAA tells them to ground them. If it’s a voluntary thing then they may have an issue. ", "score": 1, "replies": []}]}]}, {"body": "[https://news.ycombinator.com/item?id=19373707](https://news.ycombinator.com/item?id=19373707)\n\n&#x200B;\n\nnumerous reports of this same issue", "score": 6, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Lion is cancelling an order for 22 bil, but that was two days ago, anymore orders for planes being cancelled might affect the stock but that would likely only be EthiopiaAir.", "score": 1, "replies": []}]}, {"body": "Find the dumbest trader out there and sell your options now. Fasten your seatbelts and brace yourselves ", "score": 5, "replies": [{"body": "Buy now and when it blows over sell! Literally can’t go tits up!", "score": 5, "replies": []}]}, {"body": "apparently not. This is really weird, the news gets worse and the stock is going higher after the dip. ", "score": 3, "replies": []}, {"body": "Boeing will be fine eventually.  RIP only short term and still not a very hard RIP.", "score": 4, "replies": []}, {"body": "f", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": ">fix some planes \n\nAnd it's most likely a software issue, literally just need a USB drive and you're good XD", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "whats the upside case for BA though at this point short term? Might as well short and see how this plays out as its only down 10% and many potential catalysts to bring it lower", "score": 4, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Class action lawsuit, cancellation of orders, public perception, faa fines, delay of order delivery pushing backlog even further...who knows what the downside could actually be but seems to me more downside than upside short term ", "score": -2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Third time now, I’m talking short term. Of course it’s fine long term but is there an opportunity to make a quick 10-20%? There might be. Is the short term probability of it dropping higher than it rising? It likely is imo", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I’m just straight short I don’t want to try and predict timing with options on this", "score": 1, "replies": []}]}]}, {"body": "I 100% choose my flight based on the aircraft. \n\nI choose boeing 100% of the time though and that isn't changing. ", "score": 1, "replies": []}]}, {"body": "Lol no. Do you have any idea how many boeings have gone down before this? I'm pretty sure the hull losses on 747's is in the hundreds.\n\n&#x200B;\n\nEdit: 747 Hull loss count is 61", "score": 1, "replies": [{"body": "and what happened to the stock during the 70s during the hull losses? also please tell me what the upside case is", "score": 0, "replies": [{"body": "Bro the upside case? Idfk maybe the fact that they’ve had plenty other crashes in the past and Lo and behold the fucking stock a week ago was trading at 400+. ", "score": 0, "replies": [{"body": "Ya that’s before its newest plane that has a backlog of 5000+ orders started crashing itself lmao. Didn’t know what something traded at last week prior to big news means that’s where it will trade at again. Thanks for the lesson", "score": 1, "replies": []}, {"body": "https://www.cnn.com/2019/03/22/business/boeing-737-max-garuda-cancel/index.html\n\nGG", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "They have to pay the cost of grounding the planes to the airlines. It does affect their bottom line. ", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They did it like two years ago with 787's already. They do it more as a courtesy to their customers.", "score": 2, "replies": []}]}]}, {"body": "Doesn't matter if it affects Boeing's bottom line or not. Negative press makes stocks go down. When FB had the whole the Senate hearing thing it didn't affect their bottom line but the stock took a hit", "score": 1, "replies": []}]}, {"body": "Fuck, it dropped but bounced right back to where it started the day. I need the damn thing to nosedive even further.", "score": 1, "replies": []}, {"body": "Anyone who doesn’t see this tragedy as a blessing for a free money is an idiot. Do you really think finds give a fuck about dead people? No. Why do you think this hasn’t completely tanked? I’ll be selling puts every week for the next month. If I get assigned then great. Get shares even cheaper. ", "score": 1, "replies": []}, {"body": "737 MAX 8/9/10 make up a big chunk of that Boeing backlog and right now they are building close to 60 a year - that’s a lot of working capital tied up in production. If the investigation reveals a serious design flaw that pushes out the production on those jets that might hurt a bit.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The 737MAX9 is $130 million, at an 20% gross margin (per the Boeing 10k) that’s $104 million a plane or $6.2 billion in annual working capital, or roughly 80% of all of Boeing’s cash on hand at the end of Q4.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "If I sell a plane for $138 million at a 20% gross margin what did it cost me to build the plane? ", "score": 1, "replies": []}]}]}]}]}, {"body": "Defense budget has military buying 15 new F-15s. ", "score": 1, "replies": []}]}
