{"title": "Rivian - why I am doubtful", "selftext": "*Rivian Automotive*\n\nMarket Cap: 76.4B\nEmployees: 11,000+\nCars Delivered: 920\nDaniel Foelber said “Raising an eyebrow or two at Rivian's lofty valuation isn't unwarranted given the company is even more unproven than other up-and-coming EV companies like Lucid Group and Nio. However, one of the reasons why it's best to steer clear of Rivian is that the management team hasn't proven itself on the public stage.”\n\nThe company's unproven manufacturing, ability to deliver and service its vehicles, and the unknown cost of its charging network are the single most important reasons why Rivian stock is worth avoiding. Rivian, like Tesla, intends to build its own fast-charging network because it believes it is a necessary service for its remote clients. It remains to be seen how that additional cost will affect the company's profitability. Investors may recall that not long ago, Tesla had a fantastic product but was drowning in a sea of production issues. It's one thing to build a great car. It is a completely different skill to mass produce and deliver it. Given the list of uncertainties and Rivian's exorbitant valuation, there simply isn't a compelling reason to buy the stock today.\n\nRivian reported a net loss of $426 million in 2019, which increased to $1 billion the following year. The company is expected to invest heavily in product development and expand its manufacturing capabilities, both of which will necessitate significant capital expenditures. Rivian will need to raise capital several times in the future to fund its expansion plans, which will result in shareholder dilution, making it a high-risk bet given the company's sky-high valuations.\n\n\n*Amazon deal is not binding*\n\nRivian is backed my Amazon, one of the largest company in the world with over 20% stake in the company. However, Amazon chose to buy from Stellantis, which is trying to tap into market mania for EVs. This would allow the company to catch up with Rivian.\nAmazon's purchase of Rivian's vehicles represented the largest purchase of light-duty EVs in history, as part of the tech giant's stated goal of eliminating its carbon footprint by 2040.\n\nHowever, Amazon, which owns a stake in Rivian, is not required to complete the purchase. When the EV maker filed for its initial public offering (IPO) last August, it stated in regulatory filings that the agreement with the retailer \"does not contain a minimum order quantity or minimum purchase requirements,\" and that purchase orders \"are subject to modification or cancellation upon notice.\"\n\n*C level management left in the midst of production ramp up*\n\nRivian Automotive Inc.'s COO stepped down last month, just as the EV maker was ramping up production for the first time. Rod Copes left the company after holding the position since March 2020. The company said in a statement that Copes “began a phased retirement from Rivian several months ago, affording the team continuity as we moved toward production ramp.” His duties have been distributed across the leadership team, the company said", "id": "s300se", "created_utc": 1642082255.0, "score": 59, "upvote_ratio": 0.88, "num_comments": 63, "comments": [{"body": "Opened a short position today. Wish I went with my gut and opened it a couple weeks when it was at \\~$115. Oh well. This bad boy should fall nicely after it breaks below IPO. Even at $40 this thing looks overvalued.", "score": 19, "replies": [{"body": "$40 by May would make my puts print lol", "score": 4, "replies": [{"body": "I'm sure. I don't have access to call/put contracts but I can use 5x leveraged CFDs. $70 would already be a 100% gain on my position. First time ever opening a short position and I'm feeling confident about it. GL", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I don't think TSLA will fall below IPO, but I'll sell you some puts :D", "score": 2, "replies": []}]}, {"body": "How much did you make?", "score": 1, "replies": [{"body": "Ended up shorting it three different times. 84->70, 70->56, 56->50. Cashed out and used the gains to double down each time. Made £2800. Fortunately I sold once it hit big resistance at $50 right before it started to reverse. Will probably open a new short position on this again within the next couple weeks in anticipation or ER and interest rate hikes. This should go into the 30s imo.", "score": 2, "replies": [{"body": "Well played man 😎\n\nI once made a crazy amount shorting btc: I didn’t close the position thinking I’d wake up a millionaire-turns out the price went back to where it was the day before and I made nothing loool", "score": 1, "replies": []}]}]}]}, {"body": "It's not necessarily about building a quality product with healthy margins. It's more about production, scaling, and network. How many years did it take TSLA to get to where they are? 10+ years and they are still not at 1,000,000 cars.", "score": 17, "replies": [{"body": "imo the big problem for Rivian isn't that they need to ramp up their production overtime, it's that unlike Tesla they don't have the time go about it slow and steady.\n\nThe traditional automakers largely ignored Tesla well over a decade, and saw EV's as nothing more then a toy that would never work on a mass scale. They gave Tesla all the time in the world to build up their production and bring their costs down to make their EV's more competitive. \n\nRivian won't have that luxury of time, because they've already squandered it by taking 12 years to bring a vehicle to market. The traditional automakers are all upping their investments into EV's significantly these days because they don't want to give another EV company the opportunity to become a big player in the automaker space.", "score": 12, "replies": []}, {"body": ">How many years did it take TSLA to get to where they are? 10+ years and they are still not at 1,000,000 cars.\n\nThe 1st million is always the hardest. You'll see 1mm TTM at the end of 2022Q1. And 2mm TTM somewhere around 2023Q1.\n\nAnyways, back to Rivian. Companies CAN do it. And Tesla DID do it. But it doesn't mean that even for Tesla the road is over. And it certainly doesn't mean that the road was easy. I think Tesla, with their profits and margins and growth, etc etc is actually worth it. Rivian, Lucid, Nikola (HA) and the rest are worth what Tesla was worth, maybe 5-6 years ago.", "score": 3, "replies": [{"body": "What? tesla was worth $50 billion or less 5-6 years ago. Tesla only went on a rampage in the latter half of 2019. All the other ev makers benefited out of Tesla stock rally. In perspective, Lucid sold 80% of company to suadi investors for $1 billion in Aug 2018 and similarly Rivian sold back then at $5-10 billion valuations", "score": 4, "replies": []}]}, {"body": "tsla also has energy, losing money? yes.  positive growth out look? also yes", "score": 0, "replies": []}]}, {"body": "Amazon deal may not be binding but doesn't Amazon own 15%-20 of RIVN? \n\nWhy wouldn't they support their investment provided the trucks are solid?", "score": 7, "replies": [{"body": "Yes, but to be fair Amazon isn't just in it for the profits. Part of it is to show ESG investors that they're taking climate change seriously and shifting towards zero emission vehicles. If a company is hated too much by the public their stock will suffer a \"sin stock\" tax in their valuation. Not to mention it's given them a lot of positive headlines in the news.", "score": 3, "replies": [{"body": "Amazon creates massive amounts of waste. Between their shipping packaging and the fact that they throw out a sizable portion of their returns, they better find a way to look good to the investors.", "score": 2, "replies": []}]}, {"body": "Amazon need EV semi to deliver their goodies from one place to another and looks like Tesla just beat the game with their initial semi delivery and the promise for the Mega Charge network to support those semi across North America", "score": 0, "replies": []}, {"body": "Might just be a revenge trade against Elon. Regardless, I have a feeling Amazon may have reduced their stake but we have to see it once they file it in 2 months time", "score": -13, "replies": [{"body": "That bs.  I don’t like Rivian valuation but it’s not because of Amazon.  Amazon is second sourcing because they need way more than what Rivian can produce.  Lots of companies source from different suppliers.", "score": 9, "replies": [{"body": "If I was in charge of buying vehicles at Amazon, I wouldn't buy all my vehicles from one company. Especially a bunch of startup companies.\n\nYou diversify so that a flaw, defect or recall doesn't impact your entire fleet. This is why you might see a police department that replaces a portion of their vehicles with a different model each year. They might buy Ford one year, GM the next, and Dodge the next year. They might buy two different models from the same company, maybe a sedan and an SUV. While usage is a factor in what they buy, having different models means a recall means they can keep a minimum number of cars on the roads.", "score": 1, "replies": []}]}]}]}, {"body": "I hate the stock, love the company, and have both the R1T and R1S on order.\n\nThat said, this company will have a lot of growing pains. Their valuation is ridiculous but I think they will do just fine as a company. \n\nOn a more personal note, the whole narrative for the “next Tesla” needs to stop. It’s so annoying to see everything labeled like that. Rivian’s vehicles in no ways compete with anything Tesla offers.", "score": 11, "replies": [{"body": "\"Next Tesla\" is what made NKLA, LCID, Nio and now RIVN way overvalued due to many Fomo Sapiens.\n\nThere is no next Google, next Amazon and next Apple. The next 1 trillion company is not going to be another EV maker. \n\nAs a very long a TSLA bull and Model 3 owner, I am very impressed with R1T. The build quality is great. The tech is almost on par with Tesla and ahead of everyone else. Rivian has a great product. \n\nStill, that doesn't justify its current price. So I will wait when all the FUD and shortsellers drive the stock down to a much lower level before buying in the company.", "score": 11, "replies": []}, {"body": "> Rivian’s vehicles in no ways compete with anything Tesla offers.\n\n\\*Cybertruck has entered the chat\n\nR1S is unique though. Until Ford starts with a BEV Explorer/Expedition or GM with a BEV Acadia/Tahoe. And we'll see what other products Tesla comes up with before the end of the decade. They are going to be in every market segment eventually.", "score": 1, "replies": [{"body": "Let’s be honest here. Cybertruck is not an actual product. It does not compete. It will compete once it exists, but currently it does not", "score": 1, "replies": [{"body": "If Cybertruck is not a product than neither is Ford Lightning or Silverado EV. If we use your definitions then we should only compare Rivian R1T (excluding R1S) and the Hummer EV.", "score": 5, "replies": [{"body": "Except that the F-150 Lightning is in production. Saw one rolling around at Rogue River…", "score": 1, "replies": [{"body": "If they've opened the production lines than good for them.\n\nI'll amend and say zero deliveries but I expect that to change within 2 months.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tesla's type of growth is rarely seen in the stock market. I feel like I got really lucky to buy in 2019 after shopping for an EV and the lack of competition. Driving a Model 3 at the time made my Prius feel so archaic. Even today as I shop for another car, the main thing I'm looking for is technology and no one is offering anything like the Model 3. I have serious doubts that the legacy auto makers will be able to make anything compelling any time soon. I think companies like Rivian and start up EVs have a much better chance at being successful in the space. That is what's driving up the price for these EV companies but it's still way too expensive and no one is going to be the next Tesla.", "score": 1, "replies": []}]}, {"body": "I don't think Amazon buying from Stellantis is entirely correct. In Canada at least (or maybe just my area) they drive Ford transits.", "score": 8, "replies": [{"body": "These are future purchases. Currently Amazon doesn’t have many EVs in their fleet.", "score": 7, "replies": []}, {"body": "At this point they are buying whatever they can find. There isn't a lot of options with the limited supply coming out of the factories.", "score": 1, "replies": []}]}, {"body": "They have 11 thousand employees and 0 revenue?! Jesus tapdancing christ", "score": 8, "replies": [{"body": "I read that first as \"lapdancing\" and thought you were being disrespectful for a moment...", "score": -1, "replies": []}]}, {"body": "Rivian has a long way to drop.  It had a net cash position of 2B with a cash burn rate of 2B a year and no meaningful revenue.  Their new plant is going to cost 5B.  I see a dilution coming soon this year.", "score": 3, "replies": [{"body": "They raised $13b from the ipo to a total balance of $18b where r u getting ur $2b from", "score": 1, "replies": [{"body": "It looks like yahoo finance didn’t update their balance sheet.", "score": 1, "replies": []}]}]}, {"body": "Company with no real revenue valued currently at 76 billion, and u are doubtful? What would cause the doubt looool", "score": 3, "replies": []}, {"body": "The company has shown it can produce vehicles and is ramping up. They literally made their first vehicle on a brand new production line in late september '21. then proceeded to make around 1000 vehicles in 3 months. What were people expecting? That they would just magically start producing 1000 vehicles per day? Ramp ups are not linear or predictable. This is how publicly traded companies work. They raise capital and don't turn a profit for many years. hard to read an article when the author doesn't seem to know Business 101.\n\nDon't get me wrong, there are very significant challenges for Rivian, but lets just state them clearly and not obfuscate. The R1T and R1S are very good vehicles, but the company will not survive on those two models alone. They have to produce a high volume affordable vehicle, to justify their high valuation. Making 10,000, or even 50,000 70k luxury SUVs will not be adequate. And this explains the share price action. As soon as they show definitive plans for a smaller cheaper vehicle and prove they are going to build it by creating factory space (technically already confirmed), they'll be off to the races. But I think they will actually have to have the product in working form for public verification until this occurs. I don't think it will be a bad play to hold Rivian stock at that time.", "score": 6, "replies": [{"body": "Probably they are losing money on every vehicle sold. Tesla only started making money on selling cars this year. In order for Rivian to be profitable it will have to sell 1 million vehicles which I think will be a tall order. Rivian vehicles looks like a quality product and when Tesla can’t make selling way inferior products I doubt Rivian will. There will be a onslaught from gm and F too who are the masters of supply chain and equipped  to scale to lower the costs of manufacturing", "score": 2, "replies": [{"body": "yep. they must compete on price with the legacy manufacturers. that will be when things get messy.", "score": 2, "replies": []}]}]}, {"body": "The “unproven manufacturing ability to deliver and the unknown cost of charging networks” were the same argument against TSLA a while back. I was bearish on RIVN but after watching both Doug DeMuro and Carwow’s reviews on the truck, my mind was changed. That being said, the share price is still too high IMO, but I would happy to build positions in RIVN for the future", "score": 2, "replies": []}, {"body": "Everyone wants the next TSLA instead of just buying TSLA", "score": 3, "replies": [{"body": "Exactly.  It’s the same when everyone was searching for the next Amazon or Netflix.", "score": 2, "replies": [{"body": "Yep. The odds of finding the next one are slim. People would make so mush more just investing in these companies and ignoring the outside noise and then coming back years later to have a lot more money then they started with", "score": 1, "replies": []}]}, {"body": "Elon triggers leftists.  Reddit is full of leftists who spend their days outrage clicking.  Therefore, Reddit does not like TSLA.\n\nThat’s the 2022 reddit-TSLA dynamic.  Don’t read too much into it.", "score": -16, "replies": [{"body": "“Reddit doesnt like Tesla”? What are you smoking lmao?", "score": 2, "replies": []}, {"body": "And the fact that they were just plain wrong on the stock. There was a post awhile ago I saw with someone asking people’s highest conviction stocks. I said TSLA and post got removed for “meme stock”🤣", "score": 0, "replies": []}]}]}, {"body": "Who cares why you are doubtful?", "score": 1, "replies": []}, {"body": "Rivian - nope.\nReason: The headlights look dumb.", "score": -1, "replies": []}, {"body": "They are worth more than BMW (who actually now has an awesome i4 and iX and also produces lovely i3 and iX3). I get that the Tesla multiples are applied, but this is total bonkers valuation.", "score": 1, "replies": []}, {"body": "With Tesla debut the semi which proven to be extreme viable if Tesla keep their promise about cross country mega charge network. it will be not long until Jeff Bezos swallowed his pride and put in order for those semi. \n\nRivian on the other hand, they are easy prey for big short like Burry simply because they don’t have an Elon clone or there will be serveral years of losing money before they starting seeing green or someone just bought them out.", "score": 1, "replies": []}, {"body": "I get it that everyone is excited for electric vehicles, and that they are tied to Amazon — but… Making cars isn’t easy. Tesla was the first new car company not to go broke in how long?\n\nAnd their tie in with Amazon — do people not think that if Amazon can get fleet cars cheaper somewhere else eventually they will?  Isn’t that their fiduciary responsibility?\n\nThe electric car wars are going to be tough.  My bet is on Ford.", "score": 1, "replies": []}, {"body": "Shorting it", "score": 1, "replies": []}]}
