{"title": "Tesla is the most undervalued tech/teracap stock measured by price to earnings growth ratio", "selftext": "Hey /r/stocks, \n\nI am here to point out that at the moment, Tesla is the most undervalued tech/teracap (stocks that are or were once worth $1 trillion) stock measured by price to earnings growth. All the data will be here in this post.\n\nBut first, I want to address some folks here who think Tesla is overvalued because the P/E is 189 (which is down from 1,100 at the end of last year due to blistering fast earnings growth and will be under 100 if Tesla doesn't grow earnings from it's Q4 pace) while American automakers like Ford and GM have P/E around 12 and 7 respectively. Be prepared for some data. \n\nTesla is not like Ford or GM and shall not be valued as such. The only similarity is that a majority of revenue comes from cars. However, Tesla is growing revenue much more like a tech company than a car company like for or GM. Tesla also has much higher margins than Ford and GM, and virtually no debt. They are also already 100% EVs while Ford and GM have to transition their sales to EVs. Here's the data :\n\n&#x200B;\n\n**Tesla Revenue growth versus tech and cars**\n\n&#x200B;\n\n|Company|Years to grow from $10B to $50B|Years to grow from $10B to $100B|\n|:-|:-|:-|\n|Facebook|4.25 years (2014-2018)|6 years (2014-2020)|\n|**Tesla**|**4.5 years (2017-2021)**|**Estimated \\~5.75 years (2017-2023)**|\n|Apple|5 years (2005-2010)|6.25 years (2005-2011)|\n|Amazon|5.25 years (2006-2012)|8.75 years (2006-2015)|\n|Google |6.75 years (2006-2013)|10.75 years (2006-2017)|\n|Microsoft|10.5 years (1996-2007)|21 years (1996-2017)|\n|General Motors|17 years (1960-1977)|28 years (1960-1988)|\n|Ford|21 years (1964-1985)|24 years (1964-1988)|\n\nClearly, Tesla is not like Ford and GM if it is growing 4-5x faster than GM and Ford in their heydays. Tesla is growing faster than even its tech company rivals. \n\n&#x200B;\n\n**Tesla net margin versus GM/Ford**\n\n&#x200B;\n\n|Company|Q4/Q3 Net Margin|Notes|\n|:-|:-|:-|\n|**Tesla**|**15%**|**Added back one time expense of CEO payroll taxes $340M**|\n|General Motors|8.9%||\n|Ford|5%||\n\nTesla is 2-3x more profitable than GM/F, and still expanding margins at a rapid pace. What's more, Tesla posted $2.32B in profits in Q4 2021 ($2.67B if you exclude the 1 time $340M payroll tax for Elon Musk's compensation package), while Ford and GM are expected to post \\~$1.8B profit each for Q4 2021. Tesla has already surpassed Ford and GM's global profits (not margins, actual $) despite selling a fraction of the cars and still growing rapidly and expanding margins.\n\n&#x200B;\n\n**Tesla Debt & Cash versus GM/Ford**\n\n&#x200B;\n\n|Company|Debt (short and long term)|Cash|Notes|\n|:-|:-|:-|:-|\n|**Tesla**|**$1.4 B**|**$18.967 B**|**Excluded finance/leasing debt, included marketable securities & bitcoin**|\n|General Motors|$16.848 B|$ 23.940 B|**Excluded finance/leasing debt, included marketable securities**|\n|Ford|$24.007 B|$46.426 B|**Excluded finance/leasing debt, included marketable securities**|\n\nTesla has almost no debt burden compared to the heavy burden at GM/Ford.\n\n&#x200B;\n\nGiven this data, it is clear that Tesla's peers are not car companies, the peers are tech/teracap companies. Why is this a fair comparison despite the fact that most of Tesla's revenues come from cars, not tech? Some might say Tesla's cars contain a ton of tech and Tesla sells software for the cars and makes large amounts of money from it. I would say just look at the numbers. What industry a company is in does not actually matter for valuation, all that matters is growth, profits, and sometimes debt. \n\n&#x200B;\n\n**And now what you've been waiting for...**\n\nMost people here know that Tesla's price to earnings ratio (stock price divided by earnings/profit per share) is 189 and \\~100 (note this is based on GAAP financials) if you take the current earnings annual run rate in Q4 and think that this is astronomical. Well, Tesla's multiple is that high because you will always pay a higher price to earnings multiple for a companies that are growing fast. We can adjust companies forward (next year) price to earnings multiples by how fast they are anticipated to grow their earnings, and I have done exactly that in the table below for Tesla and other tech/teracap stocks:\n\n&#x200B;\n\n|Company|Stock price\t\t\t\t|2021 Analyst consensus EPS (Non-GAAP)|2022 Analyst consensus EPS (Non-GAAP)|2022 growth|Forward Price to Earnings|Price to earnings growth 2022|\n|:-|:-|:-|:-|:-|:-|:-|\n|Facebook|$311|$13.94|$14.24|2.15%|21.82|**10.14**|\n|Google|$2,697|$108.64|$114.13|5.05%|23.63|**4.68**|\n|Apple|$173|$6.04|$6.51|7.78%|26.64|**3.42**|\n|Amazon|$2,892|$41.10|$49.41|20.22%|60.35|**2.98**|\n|Microsoft|$309|$9.37|$10.77|14.94%|28.68|**1.92**|\n|**Tesla**|**$935**|**$6.78**|**$10.78**|**59.00%**|**86.71**|**1.47**|\n\nAs shown clearly in the table, Tesla has the lowest price to earnings growth ratio of all the tech/teracap stocks at 1.47. It is true that Peter Lynch, who invented the price to earnings growth ratio, suggested that a price to earnings growth ratio of 1 represents a fairly valued company. However, Peter Lynch suggested that in 1989 when the average 10 year govt bond yield over 20 years was >8% compared to <2% today, so a fair price to earnings growth ratio is likely much higher than 1 today (based on a rule of thumb that 1% change in interest rates is worth about 10% change in tech valuations, a fair price to earnings growth ratio today might be \\~1.6). Moreover, this table is being very conservative for Tesla, as it is taking the average wall street analyst consensus earnings estimate, which is way too low. I believe that Tesla's earnings per share is likely to exceed $13 per share, which would put the forward price to earnings growth ratio at 0.78, which is definitely undervalued given that pace of earnings growth.\n\nNote that I did not discuss FSD or robots, just Tesla’s current products and financial trajectory.", "id": "shanme", "created_utc": 1643659457.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 60, "comments": [{"body": "If it’s undervalued then what do you think the fair value is right now?", "score": 18, "replies": [{"body": "$1,400-$1,500 per share today by my modeling, and close to $1,600 per share within the next 12 months.", "score": -18, "replies": [{"body": "lol why are you putting a price target on Tsla using your model when your model is a comparables type method of seeing relative value against a benchmark to see if it's undervalued, or overvalued against that benchmark? P/E isn't an intrinsic valuation model like DCF? And figuring out a relative peer index for which industry a company is in IS absolutely important, whereas you just handwave it away. Sure, a lot of what Tesla does is so new that it's hard to categorize, some is tech, some is tech adjacent, but nevertheless you need to lump it in with it's industry peers. You say it doesn't matter what industry, but I counter with this. Do you think all those regulatory credits they have that generate profits for them would  be applicable to them if they were a tech company vs a car company? And how much does that skew their earnings? \n\nHow did you achieve $1400-1500 via your modelling?", "score": 6, "replies": [{"body": "DCF underestimates companies that will grow earnings rapidly because at some point you must assume a terminal low single digit growth rate, which is too low for companies like Google, Apple, Amazon, Microsoft, and Tesla.\n\nMy $1400-$1500 is based on 70x 2025 earnings discounted to the present. This is based on Amazon’s growth trajectory and P/E ratio. For all intents and purposes, Tesla looks very similar to Amazon 5 years ago except with even better growth prospects (Amazon’s GAAP EPS 5 years ago was $4.90, exactly what Tesla’s was for 2021. Amazon was at $810/share then and managed to grow profits to $6.32/share the following year and stock price mooned to $1,500. Tesla will grow faster than that", "score": 7, "replies": [{"body": "I see what you’re saying however Tesla stock doesn’t trade on fundamentals. It has been a more of an investor hype stock in the past. A lot will matter on the degree of innovation, which is hard to predict, as other car companies are quickly catching up on the EV technology.", "score": 2, "replies": [{"body": "The purpose of this post is to show that based on fundamentals, Tesla is in fact undervalued", "score": 1, "replies": []}]}, {"body": "70x 2025 earnings? You can absolutely not rely on such inflated multiples for so many years. Be careful with this line of thinking.", "score": 1, "replies": [{"body": "See Amazon’s price to earnings decline. Tesla is following a similar trajectory so far to where Amazon was 5-6 years ago. When I did the exercise, Amazon was trading at 70x earnings. I’m assuming that there is still a lot of growth potential for Tesla past 2025", "score": 1, "replies": [{"body": "Yeah when they were running along with the greatest bull market in history. If you're relying on this to stay intact until 2025 only to justify the current $1t valuation your safety cushion is very limited. I'm not dunking on your analysis, if your assumptions all pencil out it has a good chance of turning into reality. However, with all the fantastic and undervalued deals in the current market, why rely on all of this astronomic growth AND a hugely inflated multiple? If either one of these conditions are not satisfied the stock price will absolutely collapse.", "score": 1, "replies": []}]}]}]}, {"body": "Industry comparisons are only relevant if growth rates are similar. They are not even in the same stratosphere. \n\nTheir regulatory credits are less than 2% of revenue and falling quickly.", "score": 5, "replies": []}]}]}]}, {"body": "One factor that I think gets overlooked when estimating the number of X million cars Tesla can sell at some future year is the actual cost of ownership for a Tesla. Model 3 costs about as much to drive all-in per mile a Toyota Corolla, yet everyone perceives it to be like a BMW 3 series. That is why Hertz wanted to buy 100k of them. Virtually no maintenance, electricity cheaper than gas, cameras everywhere to lower insurance, etc.", "score": 7, "replies": [{"body": "Is there any brand that has stronger perceived value at this scale? Apple?", "score": 3, "replies": [{"body": "Yea Apple for sure. The new M1 Macs in particular come to mind, vertically integrated product differentiation, like Tesla", "score": 1, "replies": []}]}]}, {"body": "Can I have what you’re smoking?", "score": 20, "replies": [{"body": "Don’t be lazy. Refute the data. Provide your own interpretation", "score": 2, "replies": [{"body": "If I were smoking that shit I'd be lazy too", "score": 8, "replies": []}]}]}, {"body": "This seems like a strange metric to use to compare Tesla to any of the others. Of course it’s showing much larger growth than all the others. Now if that same growth pattern continues for a decade it will be interesting but for a company with small earnings to grow them faster than a company with huge earnings js not very impressive", "score": 5, "replies": [{"body": "Valuation doesn’t care how hard it is to grow earnings, only how fast they actually grow.\n\nAlso, Tesla is making the same profit per share as Amazon was 5 years ago, not small by any means", "score": 6, "replies": [{"body": "That doesn’t make sense to me. Why would valuation not take into account how hard it is to grow earnings? If you’re looking at Tesla’s previous earnings growth and saying how dynamic it has been, surely you just account for increased difficulty in growing at that pace as the numbers get bigger", "score": 2, "replies": [{"body": "I mean its already factored in when you’re considering estimates of future growth.\n\nAlso Tesla’s profit in 2021 was $5.52 billion, and I expect it to exceed $12 billion in 2022. Neither are small by any means", "score": 5, "replies": [{"body": "Maybe I am not understanding. Your post is about price to earnings growth and how Tesla has the lowest ration (presumably because they have had the most earnings growth). But then why compare price to earnings growth for Tesla (which has an easy time growing earnings) to Apple or Microsoft which have a much harder time growing earnings", "score": 1, "replies": [{"body": "Tesla has 1-2% of the auto market.  It's not like they are approaching saturation (outside of maybe Norway).  So why wouldn't it be easy?  They have Austin and Berlin literally about to turn on production.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "nice charts, but the vast majority of stocks that consistently trade over a P/E of 50 go on to underperform the market. see The Future for Investors (2005) by prof. Jeremy Siegel. this is regardless of revenues, innovation, sector, etc. high P/E stocks are simply a bad bet over the long-haul. \n\nFord has the best-selling vehicle in America for decades (the F-150) and has far more gross revenue than Tesla. About $120 billion per year vs. $40 billion. all the tech stuff is more than priced in to Tesla; in no universe is Tesla undervalued.", "score": 3, "replies": [{"body": "Amazon has had a >50 P/E for a long time and has outperformed the market. \n\nTesla already makes more profit than Ford is estimated by analysts to make in Q4 2021, and obviously Tesla growth is just getting started", "score": 2, "replies": []}]}, {"body": "Good article.\nThanks for making the effort.", "score": 3, "replies": []}, {"body": "i was going to buy today but just jumped 10%", "score": 2, "replies": []}, {"body": "If you want to realistically think about how growth figures in, you need to think about a ceiling/plateau, rather than recent growth. All growth is telling you is the rate at which it is reaching a realistic ceiling/plateau, not how high that plateau is. The ceiling/plateau is the amount of growth you should reasonably price in, discounted for the possibility that it falls short. Currently Tesla has gotten production ramped up enough to take a decent bite out of the low hanging fruit, but that doesn't tell us anything about how effectively it moves beyond this.\n\nPersonally, Tesla looks on track to have a position in the market like BMW--selling 2-3 million higher end cars per year. So, I'd look at BMW's market cap (and probably beef it up somewhat based on BMW looking pretty undervalued) and use that as a rough guide to project what Tesla might look like should it effectively double or triple production. Shockingly, we get a teensy bit lower valuation than it's current one.", "score": 2, "replies": [{"body": "Tesla already has a 50% higher net margin than BMW at 1/3 the scale. Moreover, their ambitions are to grow to 20 million vehicles by 2030, why do you think they will plateau at only 2-3 million?", "score": 4, "replies": [{"body": ">why do you think they will plateau at only 2-3 million\n\nBecause there are a limited number of 50 year old men making over 150K a year living in California. This is their core demographic, along with other countries that are aggressively subsidizing EVs (either directly or in the form of greater taxation on ICEs). Tesla is a luxury brand.\n\n20 million vehicles by 2030 is just a joke. Like I said about \"realistic plateau\" NOBODY sells 20 million vehicles a year. So, to believe that Tesla will be the first requires a bigger leap of faith than most other religions.\n\nIt is also a misconception to say things like Tesla ALREADY has a higher net margin than company X (whether BMW or whoever). Currently it is a low supply luxury car, so they both have to have a higher margin and they can demand a higher margin (along with the fact of being subsidized). Lower margins are a sign of a mature company.", "score": 4, "replies": [{"body": "> 20 million vehicles by 2030 is just a joke. Like I said about \"realistic plateau\" NOBODY sells 20 million vehicles a year. So, to believe that Tesla will be the first requires a bigger leap of faith than most other religions.\n\nPeople will demand ~50 million EVs by 2030. Currently, Tesla’s 20 million goal is higher than every other car manufacturer combined. Where will the EVs come from if you think Tesla can only do 2-3 million.\n\n>It is also a misconception to say things like Tesla ALREADY has a higher net margin than company X (whether BMW or whoever). Currently it is a low supply luxury car, so they both have to have a higher margin and they can demand a higher margin (along with the fact of being subsidized). Lower margins are a sign of a mature company.\n\nYes because as companies like Apple matured, their net profit margins went down, right? Hint: they didn’t", "score": 1, "replies": [{"body": ">People will demand \\~50 million EVs by 2030\n\nHmmm. Did you travel in your DeLorean to the year 2030 and find (not to your amazement) that global EV \"demand\" grew by 8 fold over 9 years? That is just a made up number  as is giving Tesla a 40% market share even though outside of California they do not have that type of market share NOW.", "score": 1, "replies": [{"body": "There’s no such thing as the EV market. There’s just the car market. The global car market will be 100% EV by 2040, and likely >50% by 2030. So it’s all about who will build EV capacity the fastest because the demand is there. So far that has been Tesla, and Tesla also has the highest ambitions of all automakers combined for 2030.\n\n[Also I didn’t pull the number out of my ass, auto execs believe that 50% of car sales will be electric by 2030](https://www.cnbc.com/2021/11/30/auto-executives-say-more-than-half-of-us-car-sales-will-be-evs-by-2030-kpmg-survey-shows.html). Yet they don’t have plans to satisfy that demand because they cannot transition fast enough.", "score": 1, "replies": [{"body": "Estimates in that totally non-scientific survey were between 20% and 90%. These numbers may not have been pulled out your ass, but they were pulled out of the asses of anonymous auto executives and then baked for your consumption by CNBC. Bon Appetit!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Well, what do you think is the total addressable market? Tesla is a luxury brand, and I chose that number because that is on the high end of any luxury brand.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": ">even legacy auto manufacturers are projecting   \n>  \n>\\~40M in US EV sales  \n>  \n> by 2030\n\nWhy include a link when the link doesn't go to anything that supports the number you have written out.\n\nThere are 15 million vehicles sold in the U.S. every year. So are you projecting that almost 300 percent of those vehicles will be EVs by 2030? Like one out of every eight man, woman and child will be buying an EV in America in 2030?", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Because their plateau/ceiling is based on the size of the market they can reasonably target. EVs are really good in certain places, and as of present virtually unusable in many other locations (due to infrastructure, weather, range, etc). EVs are best in places that are really concerned about moving emissions--like SoCal or Chinese cities where smog is a massive concern--but are a lot less effective in reducing total emissions. Over the life of the vehicle an EV reduces total emissions by about 50% IF none of the electricity to power it comes from fossil fuels. So, if you are really concerned about global warming EVs are a really inefficient way to address it. Every single car in the U.S. could be an EV and powered by green electricity and vehicle related emission would still be higher than Japan (where per capita driving is a lot less and cars are more fuel efficient). \n\nApart from EVs being overhyped as a solution, Tesla bulls/fans ignore the fact that it is a luxury car. I can literally get free electricity and I still would never make up the extra money I would have spent on a Tesla as opposed to the ICE I  bought instead in 2020 (besides the fact that weather, charging network and range would make the Tesla prohibitive). In China you can get an EV for $4500, so the people who will spend 50K+ on a Tesla are limited, and along with European companies variations on those Chinese cars are being sold in Europe. So, in figuring where the cap is you have to think what the luxury car market is like. The two biggest sellers of luxury cars are BMW and Mercedes, both of which fall short of 3 million cars per year, so that seems like a reasonable starting point for thinking about a ceiling.", "score": 1, "replies": [{"body": "So you’re just bearish on EVs being the future. Shoulda come out and said that in the beginning and it would make you 2-3 million car plateau make more sense.", "score": 1, "replies": [{"body": "Actually I am making the super bullish prediction that Tesla has a reasonable chance to be one of the biggest manufacturer of luxury vehicles--perhaps even THE biggest. It would actually be a great accomplishment if Tesla became on par with BMW and Mercedes as luxury car leaders--by selling 2-3 million cars, which is wear luxury brands top out. But if you say anything other than Tesla will rule the planet--twice as many cars as Toyota!--the members of a certain cult will label you a \"bear\".", "score": 1, "replies": [{"body": "Bulls assume that EVs will eventually take over the car market. If this is the case then Tesla will make more than 2-3 million cars per year given that Toyota, Honda, GM, etc. are guiding for very low EVs by 2030. It’s just math. The supply has to come from somewhere.\n\nNow it’s clear that you think that EV cars are gonna always just be a sub segment of the car market reserved for the upper class. And if that happens to be the case then you may very well be right that Tesla plateaus at 2-3 million cars.\n\nBut this isn’t really an argument about Tesla. It’s about EV adoption. Which you are bearish on.", "score": 1, "replies": [{"body": "I'm saying it doesn't matter if EVs take over the car market. If electric just replaces  ICEs as the default engine, Tesla is still a luxury car maker. If anything maybe it presents downside for Tesla because part of the Tesla bling is that EVs are cool (at least among the cool kids) and portrayed as environmentally friendly. If everyone is cool no one is cool.", "score": 1, "replies": [{"body": "Look at the other main EVs out (or coming out) in the USA now. The Mach e, Etron, niro, f-150 lightning, rivian, lucid air, etc. You realize those all have prices north of $40k right? Many north of $50k. But somehow those aren’t luxury but Tesla is?", "score": 1, "replies": [{"body": ">You realize those all have prices north of $40k right?\n\nThis is part of the argument for why EVs are overhyped. So long as you are paying a premium to get an EV they are a luxury item. My employer has free charging stations, for instance, and I toyed with the idea of considering a Tesla when I replaced my car in early 2020. But apart from the fact that the range and the weather and the service wouldn't work for me, even with my electricity 100% free I would never make up the extra cost of buying an EV. \n\nOn the other hand, the Wuling Hongguang Mini EV is about $4500; Small price tag, big in China and versions of it are starting to take off in Europe.", "score": 1, "replies": [{"body": "So what’s your stance? Do you think EVs will dominate in the future or do you think they will remain a niche part of the overall car market?\n\nBtw the wuling is a totally different class of car. It will have its uses but will not be the form factor adopted by most. It’s more likely to be a safer alternative to a scooter/motorcycle than a car", "score": 1, "replies": [{"body": "\"Dominate\" is a strong word. There are areas of the U.S. and the world where EVs have a clear benefit (their biggest strength is moving smog somewhere else, away from urban areas) and also areas where the infrastructure needed to support EVs is so enormous that it is hard to imagine why anyone would think it was ever a good idea. Look at a map of the U.S. and the world and figure out a plan for how EVs are going to replace ICEs on most of the world's surface.\n\nObviously the Wuling is a totally different sort of vehicle. But in some ways designing an EV sedan is kind of like designing the Maginot Line. It might be super well designed (contrary to popular belief the Maginot didn't fall, except to the extent that France fell around it) but you have to wonder if the sedan is just anachronistic mode of transport that people are bending over backwards to put a different engine in even though it will do very little if anything to affect climate change. If I could get a Wuling here for $4500 I would strongly consider it as a second car for any local driving when the weather wasn't super cold; If I could drive it to a decent train system maybe I wouldn't need an ICE at all.", "score": 1, "replies": [{"body": "So what % of the global market do you think will be EVs in 2030?\n\nThe reason I’m asking is because I want to compare your answer to what the industry expects. It’s possible that you’re much more bearish on EVs than you think you are.", "score": 1, "replies": [{"body": "But I have told you that I am not \"bearish\" on EVs. I'm telling you that this is the wrong question and actually absolutely irrelevant. Also, what the industry \"expects\" and what they say can be two totally different things. Ford has gotten a huge return for their investors by saying that they \"expect\" EVs to be huuuuuuuge (and actually selling several of them!) because people are (incorrectly) hyped about EVs.", "score": 1, "replies": [{"body": "Ah ok. I thought some of your other comments implied that you were not bearish on EVs. My bad. \n\nMy point is that if you are bearish on EVs then of course Tesla will be a bad investment. But that’s not gonna convince any bulls because we believe EVs are the future. Tesla bull case relies on it. \n\nSo it’s really an apples to oranges conversation. Now if you’re to say EVs are the future and that Tesla wouldn’t be a major player… now that would be a point worth debating.", "score": 1, "replies": [{"body": "Right. I think Tesla probably sells 2-3 million cars a year whether EVs have 5% or 70% of the global market. Obviously a lot could change (for better or worse) but that looks like a sensible trajectory.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Ok, so im assuming you bought tesla at 1.2k before it fell, right? Are you still buying, because if you aren't you are trying to manipulate the market into having other people buy that shit cuz you are bag holding? Tesla imo is overvalued and has been for a long time, and this is coming from someone who had it when it split at 1.5k. I understand if you like tesla, but post like these are suspicious.", "score": -1, "replies": [{"body": "I bought at $300 right before it split.\n\nI would but more, but I don’t have the money too.", "score": 3, "replies": []}, {"body": "Nah my average buying price was $634/share after I made 40x my money with TSLA options in 2020 and early 2021. I recently nearly doubled my position at $1,050 and now my average buy price is $819.", "score": 2, "replies": [{"body": "Good for you. Make sure to buy at the highs then because in all honesty, I don't believe you. Regardless, these types of post are still suspicious.", "score": 0, "replies": [{"body": "Posting due diligence is suspicious? Lol. Refute it if it’s wrong, don’t post a comment if you’re too lazy", "score": 3, "replies": []}, {"body": "I mean, literally the only thing he posts about is Tesla...nothing suspicious here at all...", "score": 0, "replies": []}]}]}]}, {"body": "i think the problem is there is a limit on the amount of car one can sold, because the amount of cars sold world wide in a year is finite.  And no one knows how fast the transition to electric car is.  We could be in year 2030 and only half of car is electric.  So Tesla's growth could slow down once it reach around 5 million car a year.", "score": 1, "replies": []}, {"body": "u/32no You have put this very nicely. Thanks for spending so much time in putting this up....Great job. I hope at least now, the tesla bears won't just go about saying the stock is overvalued, highly valued blah, blah blah. I also wonder why none of the other analysts who are bullish on the stock could state the reasons like you did...", "score": 1, "replies": []}, {"body": "I've been neutral to negative on Tesla for a long time. TBH when Elon started the Boring Co I thought he was nuts. But I've been watching Dave Lee's YT channel recently and found [this interview with Gary Black](https://www.youtube.com/watch?v=lNvap7GCd44&t=333s) very interesting.  He explains how institutional investors and fund managers are valuing Tesla and why the stock dived after earnings. Worth a watch.", "score": 1, "replies": []}, {"body": "It's very sad that there are no upvotes for your effort. Don't worry pal, you'll make tons of cash on your investment", "score": 1, "replies": []}]}
{"title": "What would you buy for ~$60 right now?", "selftext": "Currently the majority of my shares are in BABA (unfortunately, only stock Im currently negative on), AAPL, DAL, AMD, MGM, PSEC, MSFT, and PENN. \n\nI’ve got about $60 in available funds right now on my app and seems like a good time to buy something. Obviously no one knows what’s going to happen but what are some stocks <$60 that you guys have been liking/have a good feeling about?\n\nPlanning on holding majority of my shares for 10+ years so not really trying to find the next big meme stock, just something reliable long-term. Thanks in advance!", "id": "shb1sl", "created_utc": 1643660411.0, "score": 0, "upvote_ratio": 0.28, "num_comments": 70, "comments": [{"body": "[deleted]", "score": 61, "replies": [{"body": "I had the exact same thought! Kudos to you and *bon appetit*.", "score": 3, "replies": []}, {"body": "It’s lunchtime where I’m at but thanks for the wonderful stock advice", "score": -16, "replies": []}]}, {"body": "If I had $60...I would bet on the superbowl and then invest $120 in the market.", "score": 11, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yep a single book will pay his enormous turion of an engineering degree.", "score": 5, "replies": []}]}, {"body": "Lol ironically been having terrible luck with sports gambling lately so taking a quick hiatus", "score": -1, "replies": [{"body": "I actually would do this if i were a first time user for the platform. There are 30:1 odds promos, just do promo with $10 for 6 different sports betting sites. I know.a group of people that together made several thousand each and just left it after promos expired.", "score": 2, "replies": []}]}]}, {"body": "stocks for ants?", "score": 10, "replies": []}, {"body": "If you only have 60$ then I’d just make sure you’re good on food and bills.", "score": 17, "replies": [{"body": "That’s why I said “in my app”, I do have more than $60 in cash to my name thanks though", "score": -2, "replies": [{"body": "Then add more. 60$ won’t change much", "score": 10, "replies": [{"body": "Not saying I’m gonna get rich on $60 literally just asking what stocks people like for that price or lower.\n\nBut again thanks for trying(?) to help", "score": -6, "replies": [{"body": "Are you looking for growth or dividend stocks?  Knowing could be helpful for the advice you seek.", "score": 2, "replies": [{"body": ">dividend stocks\n\nIf he is lucky he could have made enough for a happy meal when he turn 80.", "score": 2, "replies": []}]}, {"body": "Apple. To E z", "score": 0, "replies": []}]}]}]}]}, {"body": "INTC", "score": 4, "replies": []}, {"body": "Assuming 7% gains for 10 years, your $60 will be worth $118. Deposit more funds.\n\nEdit: When you’re down to crumbs just walk away. This is a classic trap for gambling.\n\nI like to play craps. My normal spread starts at about $30 on the table (and hopefully presses up from there). If/when I’m down to $10 I have a choice. Either A) walk away, B) put in more money, or C) create a sub optimal spread with what I have.\n\nHalf-assing it on purpose is doomed to fail. You know it’s not the bet you want to take but you play it out and roll the dice anyway.\n\nBuy partials of what you actually want if anything. Or save it until you can actually afford what you want. Putting your final dollar on boxcars is basically just burning your final dollar.", "score": 5, "replies": [{"body": "I have about $4k in stocks and about $6k in a safer mutual fund, just literally had $60 extra on my app and figured I’d see if anyone was feeling particularly optimistic about anything. \n\nAppreciate your attempt at helping though!", "score": -1, "replies": [{"body": "If you don't care about that $60, just go high risk on microcaps.", "score": 1, "replies": []}]}]}, {"body": "Tech stocks showing some power to the people recently", "score": 4, "replies": [{"body": "Love tech", "score": 0, "replies": []}]}, {"body": "Any blue chip really, it’s $60 what do you have to lose…other than $60 lol", "score": 3, "replies": [{"body": "Lol valid", "score": 0, "replies": []}]}, {"body": "lithium stocks. LIACF, LAC, LTHM, SLI.", "score": 3, "replies": [{"body": "I’ll check them out thanks!!", "score": 2, "replies": [{"body": "Make sure you also Google “lithium commodity price”. Compare the 1-year chart for lithium prices to the 1-year chart for lithium sellers. \n\nIf the cost of oil went up 10x in a year, it wouldn’t make much sense if oil companies’ stocks were only up 30-60 percent.", "score": 2, "replies": []}]}]}, {"body": "It doesn’t matter if you’re investing $60 or $6000, what’s important is you continue to invest for the long term (assuming you have your day-day financial situation in order).\n\nAlso, consider a broker that supports fractional shares.", "score": 5, "replies": []}, {"body": "Stopped reading when u started crying about being negative on only one holding.   \nAs for your ?,  I’d buy a really nice hammer to smash into my forehead every time some one on this sub asks what stock they should buy if they $x to invest", "score": 4, "replies": [{"body": "Lol\n\nStopped reading this comment when you started crying about people on a stock sub asking about stock preferences", "score": -1, "replies": []}]}, {"body": "Disney", "score": 2, "replies": []}, {"body": "Get a broker that allows fractional share purchases?", "score": 3, "replies": []}, {"body": "1/2 a baba", "score": 2, "replies": [{"body": "I can’t get the nerve to buy baba. I got out with a small profit at 240 what seems like ages ago", "score": 1, "replies": []}]}, {"body": "$RBLX", "score": 2, "replies": [{"body": "I’ll check it out!", "score": 1, "replies": [{"body": "It's gotten crushed but Pelosi has a huge $100 leap or late in the year expiration.", "score": 0, "replies": []}]}]}, {"body": "NIO without a doubt, it 60 bucks so risk is minimum, and you can easily double that money this year", "score": 1, "replies": [{"body": "I’ll look into it!", "score": 1, "replies": [{"body": "Not a financial advice.\n\nBut certainly a gambling advice. \n\nLike saying poker is better than roulette, with poker having much bigger chance of winning. \n\nAnd yeah, CEO bought shitloads of NIO stocks with dip, which is really good sign.", "score": 1, "replies": []}]}]}, {"body": "A bucket of Popeyes spicy chicken for the whole fam.", "score": 1, "replies": []}, {"body": "Tqqq", "score": 0, "replies": []}, {"body": "A soccer ball", "score": 0, "replies": []}, {"body": "LMND. I’m very bullish on lemonade in the long term.", "score": -2, "replies": []}, {"body": "CIDM", "score": 1, "replies": []}, {"body": "Several shares of the REIT ETF RIET. I think real estate is the safest investment.", "score": 1, "replies": [{"body": "Who cares about safety when someone has $60 lmao", "score": 3, "replies": []}, {"body": "I’ll look into those thanks for the suggestions!", "score": 1, "replies": []}]}, {"body": "Fractional UPRO", "score": 1, "replies": []}, {"body": "$athx", "score": 1, "replies": [{"body": "LMAO", "score": 1, "replies": [{"body": "How much were your stocks up today?", "score": 1, "replies": []}]}]}, {"body": "A few shares of BIRD. It’s been more or less stable after the IPO craze drop happened, even in the midst of what has been happening. Huge upside potential in the long run, little risk short term at $60 worth.", "score": 1, "replies": []}, {"body": "I will go to the nudie bar, have a beer and a dance for $60.", "score": 1, "replies": []}, {"body": "Sofi", "score": 1, "replies": []}, {"body": "SARK", "score": 1, "replies": []}, {"body": "Would honestly buy some Palantir.", "score": 1, "replies": []}, {"body": "SFT", "score": 1, "replies": []}, {"body": "Dkng Draftkings or CFVI.", "score": 1, "replies": []}, {"body": "I would drop PSEC. While the divvy payout is very good, you really need to pay attention to the declining NAV. Look at XFLT, ORCC or CGBD. Their investment assets are more lucrative. \n\nAlso, use the following for research: SeekingAlpha and CEFData. Both are dot com.", "score": 1, "replies": []}]}
