{"title": "The recession indicator is flashing! U.S. Treasuries are inverted to a degree not seen in 40 years", "selftext": "On Thursday, Powell’s hawkish remarks sent the inversion of the 2-year and 10-year U.S. Treasury yields as high as 58.6 basis points, the highest level since the early 1980s.\n\nThe U.S. bond market is sounding a resounding recession warning.\n\n&#x200B;\n\nOn Thursday, after Federal Reserve Chairman Jerome Powell hinted that the peak rate of interest rates may exceed previous expectations, the 2-year U.S. Treasury yield soared as much as 12 basis points to about 4.74%, the highest level since 2007; The inversion of Treasury yields briefly reached 58.6 basis points, the highest level since the early 1980s, when the Fed was also aggressively tightening policy.\n\n&#x200B;\n\nAn inversion of the curve means investors expect policy tightening to lead to a recession, while also lowering inflation, boosting demand for longer-dated bonds.\n\n&#x200B;\n\nOn August 10, the U.S. Treasury bond yields of these two maturities also inverted by more than 58 basis points. The last time U.S. Treasury yields inversion of this magnitude was about 40 years ago, when Volcker, then the chairman of the Federal Reserve, raised interest rates sharply to curb inflation, a move that sent the U.S. economy into a tailspin. History shows that a recession will occur within 12 to 18 months of an inverted yield curve.\n\n&#x200B;\n\nFed Chairman Jerome Powell said on Wednesday that policy rates could rise more than previously expected and remain high as the central bank seeks to continue fighting inflation, before stocks fell and policy-sensitive 2-year U.S. Treasury yields continued to rise. Powell said the Fed has a long way to go to keep interest rates at \"restrictive\" levels.\n\n&#x200B;\n\nA team led by Priya Misra, head of global rates strategy at TD Securities, wrote in a note:\n\n&#x200B;\n\nWe believe that the current yield curve may continue to invert as the Fed is likely to continue raising rates and tolerate some economic slowdown.\n\nThis more aggressive-than-expected path of rate hikes has an unfortunate consequence. The actual level of tightening we currently expect could lead to a recession in the second half of 2023.\n\nThe Fed's consideration of raising its peak rate forecast is due to labor market resilience and the prospect of inflation continuing into next year. Ahead of the December FOMC meeting, there are also two CPI data and two nonfarm payrolls reports that will show inflationary pressures and labor market tightness, respectively.\n\n&#x200B;\n\nAnalysts believe any strong data to follow will lead to higher U.S. Treasury yields and more curve inversions.\n\n&#x200B;\n\nCurrently, the gap between the 3-month and 18-month Treasury yields is also near inversion. Powell has said the Fed tends to use that yield spread as a predictor of meeting rate cut conditions.", "id": "ylluw6", "created_utc": 1667527406.0, "score": 154, "upvote_ratio": 0.91, "num_comments": 80, "comments": [{"body": "My S7 book told me 2 consecutive quarters of negative GDP means we’re in a recession. I think we’ve landed already. But what do I know. I’m poor", "score": 65, "replies": [{"body": "We landed on a sinking ship, time to unbuckle and find the nearest floating device.", "score": 12, "replies": [{"body": ">find the nearest floating device.\n\nJPOW handing out concrete life jackets to everyone", "score": 25, "replies": []}, {"body": "sorry Jack, you're a poor, no room to float here.  I have to keep my jewelry dry.", "score": 3, "replies": [{"body": "We all know the caption is not going down with the ship", "score": 2, "replies": [{"body": "no- but Jack is.  Also, we are all Jack.", "score": 2, "replies": [{"body": "We will all be holding the bag with Jack sh$t", "score": 1, "replies": []}]}]}]}, {"body": "Oh, actually, this is when you buy and become millionaires later on", "score": 1, "replies": [{"body": "There is always a bottom, this ain't it.", "score": 1, "replies": []}]}]}, {"body": "No it didn’t. If so it’s a bad book. My SIE book says it can be used as an indicator of a recession, but many metrics must be looked at. Furthermore, if 2 negative quarters are a recession then we must be out of it because most recent GDP was positive.", "score": 8, "replies": [{"body": "There are many possibilities for a positive GDP growth rate in the third quarter. Maybe before the rate hikes start to slow down. A lot of what we can see is just an illusion in the market.", "score": 0, "replies": []}, {"body": "I'm tired of people propping up the BEA Advanced Q3 estimate as the real numbers. Positive 2.6% growth seems incredibly rosey to me and I believe it will be revised down as we get the actual Q3 report.", "score": 1, "replies": [{"body": "Well, set a remind me bot then let us revisit at that time.", "score": 1, "replies": []}]}]}, {"body": "Yeah god forbid they tell the truth. Inversions used to happen before the recession. If it happens 8 months into one, I don’t imagine it’s a good thing. I’m poor too though.", "score": 3, "replies": []}, {"body": "Lmao same I just passed mine a month ago. Sounds like everything I’ve ever learned or been taught is completely wrong.", "score": 1, "replies": []}]}, {"body": "relax! the Fed will raise the rates a couple of more times till the shit hits the roof.. then they’ll just reverse course and it’ll be business as usual", "score": 19, "replies": [{"body": "Exactly, they are raising the rates now to cool down the economy and this is driving us to a recession to then lower the rates in a few months to activate the economy because we are in a recession, they never said “we are the ones who need to cool down and we should not create a  recession” The question at this point is, what is doing more damage to the economy, inflation or aggressive and bad timed fed policies?", "score": 4, "replies": []}, {"body": "I think you need a history lesson.  What’s going to happen is that he’ll pivot in January because he’s looking at lagging data and projecting forward.  Markets will rejoice! Euphoria happens! Up 10%.  Theeen the numbers start getting ugly on the real economy.  Shit keeps breaking down and then boom heavy crash and bottom (generally anywhere from 3-18 months post pivot). This mirrors what happened in 1973 and 11 months later the crash and bottom post pivot.", "score": 7, "replies": [{"body": "It’s possible.. BUT Investing 101 says Past performance is no indicator of future performance .. will wait n see", "score": 8, "replies": [{"body": "Sure but when every major crash shows the same thing, there’s no reason to think this time won’t be differently. I highlighted 1973 because it was only time they were raising into a falling market.", "score": 5, "replies": [{"body": "you talk of a crash..many stocks are already down 90 % this year! How much lower can we go?", "score": 3, "replies": [{"body": "Kinda funny didn’t hear too much about the DOW on the way up.  PreCovid DOW was 29000 with signs of. Recession ahead.  This ain’t over", "score": 1, "replies": []}]}]}]}, {"body": "Pivot", "score": 2, "replies": []}]}]}, {"body": "We are in a recession now.  I’m in banking and all activity has slowed to a trickle.  I think Powell is completely off on his fast rise of rates.  We will find in Jan or Feb that everything now is from a couple of months ago, he is single hand-idly stopping the economy.", "score": 52, "replies": [{"body": "Same.  In banking and applications have decreased 40-45%", "score": 4, "replies": []}, {"body": "Powell is stupid. The period of low interest rates is over.", "score": 2, "replies": []}, {"body": "How exactly are we in a recession?  Last quarter the USA saw growth", "score": 1, "replies": [{"body": "That figure is misleading, our imports were down because consumption was down, while exports weren’t down as much. This led to gdp growing technically even though the local economy is cooling off", "score": 7, "replies": [{"body": "It’s either a technical recession or it isn’t.  And for the investors saying technical recession for the whole summer, we are technically out of it.\n\nIf we are taking a broader view of the economy as the administration is, low unemployment and strong consumer spending counterbalance the lack of economic growth.\n\nAlso gdp should be collapsing as the fed pays off the balance.\n\nMy opinion is we haven’t had a recession yet, but we will probably in the 1st and second quarters of next year.  Christmas will boost jobs and spending in the last quarter 2022.", "score": 5, "replies": []}]}]}, {"body": "If you’re defining two consecutive quarters then no we’re not. We just had a positive gdp report. If you’re going with the downward trend definition, no we’re not. Still have high employment, consumers are still buying. Is a recession coming yes.", "score": 2, "replies": []}, {"body": "Yes.  By definition we are in a recession. I think it is funny when the long standing definition of a recession gets changed (probably due to the proximity of the elections) AND everyone else simple goes along with it. Frankly, we are approaching a depression by definition AND we are currently IN stagflation.  \n\nWe just never were privileged to “seeing” data as quickly.", "score": 0, "replies": [{"body": "Q3 annualized GDP +2.6% [New York Post](https://nypost.com/2022/10/27/us-gdp-grew-2-6-in-third-quarter/) Sorry bud your conspiracy theory is debunked. Not in a recession. And that was never the definition to begin with. There has never been agreement on what a recession is. It’s more complex that GDP. As you can see no layoffs and spending is high. Are we headed for one, obviously that is the intent of the fed to combat inflation. Either combat it in a controlled manner or let it happen naturally which the fed would be stupid to do.", "score": -1, "replies": [{"body": "I think we are in a almost war situation that is partially worsened by oil price manipulation by OPEC and artificial natural gas shortages the Russians have created.\n\nThe issues are more Geo-political than economically fundamental. Powell is trying to put a band-aid on a bleed out victim. A folly.", "score": 2, "replies": []}]}]}, {"body": "No way inflation goes away.  Come January some people are getting the biggest raise in decades.  The entire federal workforce is getting a 4.2 - 5.5% raise.  All those SS recipients are getting an 8% or so raise.  I'm sure lots of companies also do annual raises and bonuses.  It's part of the cycle where higher prices lead to higher wages and round we go.  The only breaks to that wheel is the fed rate.  JPow is barely pressing the breaks and we are still headed downhill and picking up speed.  \n\nYou ever see those emergency truck ramps for big rigs?  If those trucks don't keep the breaks on hard enough, the breaks won't slow it down.  So they build these ramps full of gravel that the trucker can bail out onto, so that they don't die in a fiery explosion when they fall off the cliff edge.  That \"soft landing\" is the gravel ramp.  If JPow doesn't break hard and turn us into that gravel, and soon, there is a good chance we will be going off that cliff.  \n\nHe clearly said the path to a \"soft landing\" has narrowed?  You have to realize that anything that's not a soft landing is a fucking crash, like potentially decade lasting economic quagmire or worse.  If you were flying and the pilot was \"attention US scare line fliers, as your pilot, I would like to inform you as we come in for landing that the path for a soft landing has considerably narrowed.\" How would you react?  You realize you should have the same reaction?  It's only going to take one person losing their shit when that plane starts rattling for mass hysteria to break out.  We are all on that plane right now.  Buckle the fuck up.", "score": -6, "replies": [{"body": ">You have to realize that anything that's not a soft landing is a fucking crash,\n\nLOLZ..... Have a look around! Most people won't see the crash until the plane is cartwheeling down the runway and they themselves are ablaze in a jet fuel fire! \n\n>If JPow doesn't break hard and turn us into that gravel, and soon, there is a good chance we will be going off that cliff. \n\nLook, it's abundantly clear that the time to worry about the cliff is when we actually fall off it! \n\n10% before this mess is over..... Yeah, I said it! \n\nRemindMe! 2 Years", "score": 2, "replies": []}]}]}, {"body": "Whoa! Who knew!", "score": 13, "replies": []}, {"body": "I don't really see why this is surprising, a recession was literally engineered. They are doing this on purpose and they know inflation is going to be down, I'm just winging it here but probably 4% by Summer. If they take the Fed rate to 5 inflation will be under that and by the end of the year if we see 2% it's probably going negative the next year unless they go on one hell of a stimulus program and slash rates just as fast as they raised them.", "score": 15, "replies": [{"body": "Right, people act like it’s an act of the gods,  this is the plan.", "score": 12, "replies": [{"body": "Even if not a recession has clearly been on the way for awhile now w/o any holy intervention.", "score": 1, "replies": [{"body": "Yup, most anticipated and priced in recession in history.  I believe we are bouncing at the bottom now.  The worst news is having minor declines.\n\nI don’t anticipate any significant changes, maybe even another bear rally before the end of the year", "score": 3, "replies": []}]}]}]}, {"body": "Why did Biden keep Powell as fed chair? Hope he enjoys his manufactured recession as he goes for reelection. Should work out well.", "score": 5, "replies": []}, {"body": "Just a friendly reminder. The stock market has historically peaked after yield curve inversions right before a recession. I don't think that will exactly happen this time due to all the macro headwinds... but I could see a very nasty bear market rally to suck people back in and then drop the hammer in 2023. So don't go all in on short term puts.", "score": 4, "replies": []}, {"body": "Funny how much people started to care about recession indicators in the last year.", "score": 29, "replies": [{"body": "record breaking inflation because of the government spending tends to do that.", "score": 2, "replies": [{"body": "This is a horrifically bad oversimplification of the issues.", "score": 29, "replies": [{"body": "But that’s what Fox News said! Must be true!", "score": 8, "replies": [{"body": "It's just a dog whistle for people who don't know anything about the economy.", "score": 2, "replies": []}]}]}, {"body": "Worst than giving billionaires tax breaks , expecting trickle down effect and ignoring a pandemic?.US last two years spent money on infrastructure,healthcare and education.", "score": 4, "replies": [{"body": "Actually yes. And you should put quotes around \"infrastructure\"", "score": 0, "replies": [{"body": "You do know all the red states accepted the funding  for roads,sewers,clean drinking water and bridges but voted against it.", "score": -1, "replies": [{"body": "They voted against it bc it was a massive pork bill. Hence the air quotes", "score": 1, "replies": [{"body": "Sure it was.Nice dumb GOP talking points when people in red states do not have clean drinking water.", "score": -1, "replies": [{"body": "Oh no, how dare they usually factual and relevant talking points! Nazis! Too bad we waste money on Ukraine and not clean water", "score": 2, "replies": [{"body": "You do know Trump spent $175 million playing golf right?.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Yeah no", "score": 3, "replies": []}]}]}, {"body": "Why do i feel like ive read this before?", "score": 3, "replies": []}, {"body": "As long as they keep pushing gold down convert their crap fiat into something of actual value.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -12, "replies": [{"body": "No the panic was last year, when everyone was screaming this is a bad idea. This is hold on we are on the ride, no getting off now.", "score": 15, "replies": [{"body": "Last year target rate was 3% now 5%,The ride is accelerating.", "score": 2, "replies": []}]}, {"body": ">You’re trying to panic people and it’s wrong.\n\nPeople posting infomation don't panic people, people are primed for panic because of experiences they are living!", "score": 2, "replies": []}, {"body": "I think you'll be surprised how much lower we can go. Just look at Google, Amazon and Meta just this past week. Please explain  why the yield curve inverting is a good thing? The 3 month yield just inverted with the 10 year this week.", "score": 1, "replies": []}, {"body": "It’s informative", "score": 1, "replies": []}, {"body": "Yeah! Why are you posting important economic information in a stock subReddit? Ha why? Why? Answer to me? Stop spreading panic. Lol", "score": 1, "replies": []}]}, {"body": "Omg....more puts I guess....", "score": 1, "replies": []}, {"body": "That's one school of thought", "score": 1, "replies": []}, {"body": "You need an article to tell you water is wet and the sun will rise too?", "score": 1, "replies": [{"body": "Water is actually not wet; It makes other materials/objects wet. Wetness is the state of a non-liquid when a liquid adheres to, and/or permeates its substance while maintaining chemically distinct structures. So if we say something is wet we mean the liquid is sticking to the object.\n\n&nbsp;\n\nIn the future water will be like sarcasm.\n\nNo one will get it.", "score": 2, "replies": [{"body": "... yeah.", "score": 1, "replies": []}]}]}, {"body": "The 3 month is the one that has actually predicted every recession, not the 2-year", "score": 1, "replies": []}, {"body": "so what did they do prior to the deep recession of 2008. Is this always the correct indicator for a deep recession?", "score": 1, "replies": []}, {"body": "Remindme! 12 hours", "score": 1, "replies": [{"body": "I will be messaging you in 12 hours on [**2022-11-06 15:24:32 UTC**](http://www.wolframalpha.com/input/?i=2022-11-06%2015:24:32%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/ylluw6/the_recession_indicator_is_flashing_us_treasuries/iv8nn5s/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Fylluw6%2Fthe_recession_indicator_is_flashing_us_treasuries%2Fiv8nn5s%2F%5D%0A%0ARemindMe%21%202022-11-06%2015%3A24%3A32%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ylluw6)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}
{"title": "TSLA Calls! You’re my only hope!", "selftext": "", "id": "ym8xvf", "created_utc": 1667592442.0, "score": 123, "upvote_ratio": 0.92, "num_comments": 86, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|11|**First Seen In WSB**|1 year ago\n**Total Comments**|75|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ym8xvf)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ym8xvf)", "score": 1, "replies": []}, {"body": "70k in weeklies, man i love this. Gets me going. Good luck nerd", "score": 73, "replies": [{"body": "It's nice to have $72k burning a hole in your pocket", "score": 3, "replies": []}]}, {"body": "You will be remembered as the best 78k guy![img](emote|t5_2th52|4276)![img](emote|t5_2th52|8882)", "score": 31, "replies": []}, {"body": "dear lord thats 5,000 theta decay per day thEEEEEEEEEEEEEEEESH", "score": 30, "replies": [{"body": "That why I always like theta on my side", "score": 2, "replies": []}]}, {"body": ">It is good to see that you are doing well with your investments. I am always happy to help people make money.", "score": 20, "replies": [{"body": "What is the next play viz wiz![img](emote|t5_2th52|12787)![img](emote|t5_2th52|12787)", "score": 9, "replies": []}]}, {"body": "There will be pain", "score": 15, "replies": [{"body": "Pain tolerance is what keeps me here 😁", "score": 12, "replies": [{"body": "may you strike gold next week", "score": 6, "replies": []}]}]}, {"body": "This is going to end up exactly like obi-wan.", "score": 10, "replies": []}, {"body": "If Elon can keep his mouth shut for a week or two you’ll be fine", "score": 9, "replies": [{"body": "In that case he's fucked.", "score": 10, "replies": [{"body": "jup", "score": 0, "replies": []}]}]}, {"body": "Looks like this trade may work. Good luck", "score": 8, "replies": []}, {"body": "I swung puts GL", "score": 9, "replies": [{"body": "Same same", "score": 5, "replies": []}]}, {"body": "If it’s good enough to screenshot, it’s good bla bla bla", "score": 8, "replies": [{"body": "But why settle for a measly 8% ?", "score": 1, "replies": [{"body": "Because expiration is next week?", "score": 1, "replies": []}]}]}, {"body": "I did the same towards close, apple recovered more so seems to better risk/reward with tsla.", "score": 6, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 4, "replies": []}, {"body": "I too, was once, regarded.", "score": 8, "replies": []}, {"body": "![img](emote|t5_2th52|4258)", "score": 5, "replies": []}, {"body": "I would’ve sold right away to cash those  $6K\nBut, I’m just a random guy.", "score": 4, "replies": [{"body": "If I wanted to make 6K I would not have put such a large bet. Just saying…", "score": 3, "replies": [{"body": "I can tell that’s not your goal, good luck 👍", "score": 2, "replies": []}]}]}, {"body": "Good god the balls it takes….", "score": 4, "replies": []}, {"body": "I wanted to open a call too but my damn webull got 3 GFV today", "score": 3, "replies": []}, {"body": "That’s a shot ton of calls. I feel like these are going to print on open monday", "score": 3, "replies": []}, {"body": "Nice I bought 10 at $7, im with ya", "score": 3, "replies": []}, {"body": "Watch TSLA breaks 200 next week. Solid resistance at $200 but it can hold for so long.", "score": 5, "replies": []}, {"body": "This is going to print bigly..", "score": 5, "replies": [{"body": "Time to get out of my calls. Fuck you", "score": 4, "replies": []}, {"body": "“bigly” yaaaaaassssss!!! 😂", "score": 3, "replies": []}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Good luck!!!", "score": 2, "replies": []}, {"body": "Good luck man! Rooting for u!", "score": 2, "replies": []}, {"body": "fyi theta fucks just as hard on the weekend", "score": 2, "replies": [{"body": "What the heck does theta do/is? I will look it up but  it might help others", "score": 1, "replies": [{"body": "It’s an amount that is removed from the premium\nof the contract every day. The closer the contract is to expiry you have more theta decay overall on your investment than if you bought a far out option. \n\nLook at the number theta and that’s what it’ll reduce by every day", "score": 2, "replies": [{"body": "No need. I lived it. Good thing I got in in some puts which has recouped close to 40%.", "score": 1, "replies": [{"body": "Care to share a screen shot of said puts?", "score": 1, "replies": [{"body": "No screen shots allowed in replies but was a total bust. 🤦🏻‍♂️salvaged 10K. A lesson on being more diligent about placing stop losses for large bets.", "score": 1, "replies": [{"body": "I have the same bet except I bought mine 3 months out til Feb.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Theta does not decay over the weekend or holidays, it will slightly drop as monday trading starts, but saterday/sunday does not decay", "score": 1, "replies": [{"body": "I hope you're right. the analysis model in tastyworks implies that it does, but that could just be the the algo generalizing \"two days passed\", and not taking weekends into account.", "score": 1, "replies": [{"body": "Might be that those algo's take in consideration drop in share price or MM taking IV out of the stock (they usually do over the weekend)\n\nAlso the analysis in Tastyworks shows end of day data (if you are talking about profit/loss analysis tool) It only show full data on the same day, but if U go to a date in the future it will be end of day data", "score": 1, "replies": []}]}]}]}, {"body": "I'll pray for your portfolio", "score": 2, "replies": []}, {"body": "gg you just lost everything", "score": 2, "replies": []}, {"body": "May the odds be ever in your favor ✌️", "score": 2, "replies": []}, {"body": "I will short at 200", "score": 2, "replies": []}, {"body": "Lotsa pain felt on this call", "score": 2, "replies": []}, {"body": "New 52 Week low today.. Good luck", "score": 2, "replies": []}, {"body": "This might actually work out. RemindMe! 4 days", "score": 4, "replies": []}, {"body": "This is going to lose half its value at market open next week.", "score": 2, "replies": []}, {"body": "Guh", "score": 1, "replies": []}, {"body": "Might as well piss that 80k away", "score": 1, "replies": []}, {"body": "Hell yes burn 🔥 it", "score": 0, "replies": []}, {"body": "Broooooooo this wsb material! \n\nGod speed", "score": 0, "replies": []}, {"body": "TSLA is hitting 200 bro market is going to think Elon is too busy fixing Twitter 💀", "score": 0, "replies": []}, {"body": "Why do this when papa Musk is sleeping over in Twitter's offices?", "score": 0, "replies": [{"body": "He’s the smartest guy we have with everything he’s doing with so many companies. I don’t care where he sleeps.", "score": 1, "replies": []}]}, {"body": "Dude. Elon sold at &400 and it’s been 50% down since. Demand is cratering and Musk is showing off his stupidity daily. How can I short your trade?", "score": 0, "replies": [{"body": "You sell 110 calls @ $207.5 expiring 11/11. Naked of course.", "score": 1, "replies": [{"body": "Cool. Good luck", "score": 1, "replies": []}]}]}, {"body": "How's it going now? Lol good luck.", "score": 0, "replies": []}, {"body": "I raise your calls with my Tesla levered bearish single stock ETF: TSLS. Elon is going to have to infuse his own capital into Twitter in order to keep it afloat. That means more big Tesla sales by Elon and likely cause a break below $200 level, which will mean look out below after that.", "score": -1, "replies": [{"body": "I hope for sun 200 at some point. Want to load up on stocks", "score": 0, "replies": []}]}, {"body": "You're done.", "score": -1, "replies": []}, {"body": "Trading can entail trimming and added. The outcome can be influenced by active decision making. It also means hedging downside risk. Hope you used some profit to do so. Good luck.", "score": 1, "replies": []}, {"body": "I got 1 $205 C 11/11.   If it goes up on Monday, im selling by the end of the day.", "score": 1, "replies": []}, {"body": "Did the same. Not to that extent… but think it’s a good play.", "score": 1, "replies": []}, {"body": "How do you enter an options position with that much capital? \n\nDo you usually get a fill? Do you slowly buy in?", "score": 1, "replies": [{"body": "Limit asking price usually!", "score": 1, "replies": [{"body": "So all in, 75 grand on one asking price?", "score": 1, "replies": [{"body": "Yes!", "score": 1, "replies": []}]}]}]}, {"body": "amazing. thank you for your service", "score": 1, "replies": []}, {"body": "Given Elon’s current level of popularity, I wouldn’t give him a dime right now.", "score": 1, "replies": []}, {"body": "Take the $6k profit and move on to the next", "score": 1, "replies": []}, {"body": "holy fuckaroonie", "score": 1, "replies": [{"body": "Yeah no fun being wrong at this scale but I think about how much Zuck lost over that past few weeks and I don’t feel so bad", "score": 1, "replies": []}]}]}
