{"title": "RyZen Problems, and why I'm still long AMD", "selftext": "Why RyZen was and is overhyped:\n\nThe only huge market for high-end CPU's is gaming, and even the 1800X is far from beating a much cheaper 7700K. It's obviously awesome for workstations, but well, that's not gonna make money. \n\nWhy the optimizing stuff is kinda bullshit:\n\nAyyMD wasn't able to tell driver devs that they come out w/ a new CPU for FIVE YEARS?!? They develop a CPU for FIVE BLOODY YEARS and aren't able to tell anyone in advance: \"Yeah guys, we got this hot new CPU, take these samples and maybe optimize your code a lil?\"\n\nAlso, it looks like Intel also has a some room left for optimizing, mainly in server CPUs.\n\nWhy it's still gonna sell ok:\n\nIt's actual competition. I personally am an AMD-fan, but bought an Intel CPU because AMD was just so shitty. They aren't anymore. A lot of fans will just buy RyZen because they no longer want to buy Intel and/or want/need the multicore power.\n\nWhy that is good:\n\nWho seriously expected them to overtake Intel from nothing? They have a fraction of their research budget, mainly because they didn't make any money for years. And I'm pretty sure Intel also kept a closer look at them for the time than we did, and probably knew what to expect in terms of performance and adjusted their chips accordingly.\n\nIf they start selling stuff again, they get money they can spend on developing improved chips and so on, and maybe catch up w/ Intel sooner or later.\n\nWhy I'm long AMD: \n\nCurrent Market cap is between 12-13B$. Intel has ~170B$, Nvidia ~60B$. \n\nSo they compete w/ companies of an combined worth of about 230B$. Even if they grab just a small share of the GPU and CPU market, they should be worth a lot more. And Vega is coming soon (I expect similar stuff as w/ RyZen: high enough performance to be considered competition, but not crushing NVidias high-end cards)\n\nDisclaimer: I currently do not own any AMD/INTC or NVDA stock, but intend to buy AMD if I can get a nice entry. \n\nDisclaimer2: I've no idea of DDs.", "id": "5xp9ij", "created_utc": 1488749989.0, "score": 35, "upvote_ratio": 0.69, "num_comments": 60, "comments": [{"body": "[deleted]", "score": 54, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Yeah, the IPC being slightly less than Intel's is completely fine given the perf/watt. I really thought that the power draw usage numbers were going to be the ones that were incorrect leaks, but I'm extremely happy that they are real. I'm getting back into AMD over the next few weeks and still am very optimistic long term.", "score": 5, "replies": []}]}, {"body": "Also he is underestimating the huge workstation market", "score": 2, "replies": []}, {"body": "Yeah, like the several hundred thousand PCs that are currently sitting on each desk of each office in the Fortune 50 companies are a tiny fraction compared to the high end gamers out there....\n\nI guess if you've never worked in a company that has tens of thousands of office workers, and only hung out with your gamer buddies, you might think only gamers are buying CPUs and that's why people make and lose money in the stock market; dumb shitty DD vs. Smart fully scoped DD. ", "score": 2, "replies": []}, {"body": "I think you'd be surprised at how many people can't afford high end pcs but might be able to with an AMD cpu when they couldn't before. My gaming pc was 3 years old when I sold it. If I was remaking a 4K one now I would go AMD on the cpu for sure. ", "score": 1, "replies": []}]}, {"body": "Not sure where you are pulling this info. Gaming is clearly not the big money maker in high end chips. Workstations and servers are. Only nerdy gamers think that gaming is where money is made. Fortune 500s need servers and workstations, not CoD machinez.", "score": 26, "replies": [{"body": "You'd be surprised at how big the gaming market as become over the decade.", "score": 4, "replies": [{"body": "> not the big money maker in high end chips\n\nGaming is big, but there's not a huge turnover in CPUs. People buy a machine and keep it for a few years then upgrade, like a console. Gaming makes billions, but mostly for *games.*", "score": 4, "replies": []}]}, {"body": "I don't play video games, period. \n\nLook at NVDA revenue: over 60% of it is from gaming. The PC market is dying while gaming is the only part of that market expanding. Moreover, the gaming market has high margins. \n\nI'm actually a little shocked that WSB is upvoting this crap. Whether you like it or not, the gaming market is still the most relevant market. I'm almost a little curious:  did you just make stuff up in your head then post it? Then everyone here has become so ignorant that they upvote it? Where are you getting this shit from?\n\nFeel like I'm taking crazy pills.", "score": 5, "replies": [{"body": "I was really starting to think that I had read the earnings statements wrong at nvda's last release.  People have been repeating that gaming means nothing so frequently on here that I was questioning my memory.  \n\nI'm a console guy, but when I started looking to build a pc for work the first place I look for info is from gaming reviews.  I'm not sure about other people, but when I'm reading reviews on products I intend to buy, the gamers are very convincing hype men.  They almost have me talked into a 1080 even though I won't ever have a practical use for it.  I just want it.  ", "score": 2, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "    Bulldozer 2.0\n\n*Really dude?*\n\nThe ignorance in this subreddit baffles me sometimes.", "score": 8, "replies": [{"body": "Obviously the architecture is incredibly different. But the hype and the following dud are the exact same. Mark my words.", "score": -2, "replies": [{"body": "we will, and when you are wrong ill sell off some of my shares to cover your autism meds.", "score": 1, "replies": [{"body": "$stock AMD\n\n", "score": 1, "replies": []}]}]}]}]}]}, {"body": "gaming4lyfeamiritehehexd", "score": 1, "replies": []}]}, {"body": "As a PC gamer i feel that a lot of people will buy ryzen for the simple fact it's not Intel. There's a lot of hate in the PC gaming community for Intel, as a company. They feel taken advantage of by Intel. Now they can have their cake and eat it too. I'm holding my AMD stock through the q1 earning report. I think it'll go better than this sub expects", "score": 11, "replies": []}, {"body": "short AMD\n\nstop above $14", "score": 15, "replies": []}, {"body": "Dude, these were never PC gaming chips. PC gaming is also not the primary market for AMD/Intel. Why the fuck is everyone judging this chip on it's gaming performance? Wait to see their lower core higher clocked chips for that *lesser* market.\n\nWhy anyone should be long AMD: They put out a very good product at a very competitive price and will be rolling out more models over the course of the year and you think they're going to make more money from them than wall-street is expecting.\n\nI'm not long AMD but I'm considering purchasing to at least hold until earnings. If it tanks again Monday I will get in for sure.", "score": 7, "replies": []}, {"body": "I disagree high end cpu is not just for gaming. And with the multi core it's able to multitask better. A lot of gamers use streams while playing. Ryzen offers that for a little drop in fps. Honestly the small drop in fps is not much that it can be noticed largely ", "score": 12, "replies": [{"body": "Ofc it's not just for gaming, but everywhere else there is no market. The average PC user has CPUs in the $50-200 price range or, more likely, a notebook.\n\nOnly in the gaming sector, a lot of high-end CPUs are sold. Servers have dedicated server-CPUs and every other market is just too small to really make money of.", "score": 3, "replies": [{"body": "That's just based on people budget imo. I personally don't game super hard and I still buy high end CPUs just because the computer is faster. A lot of other people do this also. They might not buy the top of the line i7s but they still do purchase i7s", "score": 5, "replies": [{"body": "Then you're retarded rofl. You'd be way better off investung in more RAM  or an SSD than buying an i7 over an I5 if you're not a high-end user.", "score": 2, "replies": [{"body": "Dumbass guess you can't read go back to school first before commenting dipshit.\n\nAlso I'm not a broke pos like you. Buying something that costs 5% of my monthly salary doesn't mean shit", "score": -1, "replies": []}]}]}, {"body": "Ok, so servers aren't going to be built with Ryzen, but they will be built with Naples coming in Q2 which is a 32 core version of Ryzen. \n\nHowever you want to call it, it means $$$ for AMD who currently has almost none of the server market.", "score": 4, "replies": []}, {"body": "Middleclass Busniess which use Photoshop/Autocad/Blender whatever are far mor important than gaming. And they all want something like the 1800x", "score": 2, "replies": []}, {"body": "That is jsut good for the r3 r5 and the apus", "score": 1, "replies": []}]}]}, {"body": "> AyyMD wasn't able to tell driver devs that they come out w/ a new CPU for FIVE YEARS?!? They develop a CPU for FIVE BLOODY YEARS and aren't able to tell anyone in advance: \"Yeah guys, we got this hot new CPU, take these samples and maybe optimize your code a lil?\"\n\nlmao; you don't really have any compiler background do you? None of the major silicon companies release updates/patches for libraries prior to release. They're so scared of their \"IP\" getting stolen that some don't even file patents for some of the novel techniques that they end up using.", "score": 11, "replies": []}, {"body": "https://www.reddit.com/r/wallstreetbets/comments/5xbav0/why_im_still_long_amd/\n\nRyzen is going to take market share from Intel, no doubt. I outline why in this thread.", "score": 4, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Haha, reddit is savage.", "score": 1, "replies": []}]}]}, {"body": "I have 3 development machines at work and a whole rack of servers.  my main dev machine has 2 6 core xeons and costs 3x my gaming rig at home.\n\n", "score": 3, "replies": [{"body": "would you consider going with ryzen on your dev/servers?", "score": 1, "replies": [{"body": "I would consider it if buying new, especially if it were a home work station.  The problem they will face is getting in with OEMs because there's no way my employer will buy anything other than premade with warranty and support.\n\nSame story goes for the servers.  We try to use what our customers use, so when super micro starts making rackmounts with 2 or 4 AMD processors in them, we would pick them up.  I could see them making inroads with people who value RAW computing power over tried and true stability of Xeon platform.\n\nThat being said, AMD can't really do any WORSE than their present market share.  While gaming is good, it's the professionals they should be after for the high margin items.", "score": 3, "replies": []}]}]}, {"body": "I'd sell puts if you're looking for a good entry.  Premiums are yuge right now", "score": 2, "replies": []}, {"body": "I'm with you on your first disclaimer. Stock price seems to be settling after the $15->$13 fall due to overhype. Imma follow it a bit more to see if it goes down any further.\nWith vega coming out later this year along with the R5 and R3 Ryzen chips, $AMD has sunny days ahead.\n\nThe only thing left is hoping that AMD will be able to sign solid deals with third parties, which is an area where they have always been somewhat lacking compared to Intel and Nvidia.", "score": 2, "replies": []}, {"body": "Imma stick to my buying at support selling at resistance.", "score": 2, "replies": []}, {"body": "There's a lot of buzz that the 2017 MacBook Pro is going to go Ryzen. AMD getting back into the OEM market could be big.", "score": 2, "replies": [{"body": "With the lower power usage for equivalent office-task work, I am now a believer in that. My other reason for doubting would be that Apple is obsessed with their premium image, but they already put AMD's less than stellar GPUs in their laptops so why not CPU also.", "score": 2, "replies": [{"body": "Thunderbolt", "score": 3, "replies": [{"body": "Someones done their homework", "score": 1, "replies": []}]}]}, {"body": "This is totally false. Apple is heavily invested with intel and thunderbolt to switch over to AMD at the moment.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "It is reddit. I did loose some money on AMD as well from not taking profits early, but I'm still logical about this whole thing.", "score": 1, "replies": []}, {"body": "But they did. Its now type c ports.\n", "score": 1, "replies": []}]}, {"body": "source", "score": 1, "replies": [{"body": "You don't need a source to realize that their entire expandable ecosystem is based on Thunderbolt technology. All the new macbook/pros have only \"thunderbolt 3\" through USB C ports. Their Mac pros have 6 thunderbolt 2 ports. As much as I love AMD, they currently don't offer enough in terms of expandability on the mac side of things.", "score": 2, "replies": []}]}, {"body": "They moved away from thunderbolt now though. All type C.", "score": 1, "replies": [{"body": "How hard is it to visit the apple webpage? Thunderbolt is going through the USB type C port. Thunderbolt is NOT a port, it's a proprietary technology by intel for fast data throughput.", "score": 2, "replies": []}]}]}]}, {"body": "\"The only huge market for high-end CPU's is gaming\"  \n\nStopped reading. True Autistic post. ", "score": 2, "replies": []}, {"body": ">Disclaimer2: I've no idea of DDs.\n\nThis is like the best DD this site has ever seen.", "score": 2, "replies": []}, {"body": "So they compete w/ companies of an combined worth of about 230B$. Even if they grab just a small share of the GPU and CPU market, they should be worth a lot more. And Vega is coming soon (I expect similar stuff as w/ RyZen: high enough performance to be considered competition, but not crushing NVidias high-end cards)\n\nKind of missing some points here like the fact that Intel owns foundries. And AMD spun those off a long time ago. ", "score": 1, "replies": []}, {"body": "Gotta be careful. Amd got massively hyped. I think we all know that. It's in retreat mode now and we're going down. With earnings maybe it goes back up but damn well better hope Neha reviews are good or you 20 strikers on leaps are done. ", "score": 1, "replies": []}, {"body": "Intel and AMD are competing in a concentrated market with intense competition. Since these are both high fixed-cost businesses, the winner is the firm that can produce for the lowest actual cost per dollar of revenue. As both of their inputs are the same (some silicon, some specialized semiconductors), and the chip output is commodities, the winner by definition is the one that can spread their immense R&D and production costs over the largest number of processors. \n\nIn other words, they are competing tooth and nail for market share. All intel has to do is cut prices to keep their advantage. \n\nThe only way Ryzen is a game changer is if their cost to produce is actually smaller than Intel's on an allocated fixed-cost basis with economies of scale waiting to expand that advantage. \n\nIf there's no new advantage, intel will just cut prices to force them out, there has to be an advantage. ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "They made Ryzen (a great chip) on their current awful budget, certainly they can manage R&D costs moving forward. \n\nBesides, the next few years are just going to be tweaks on Ryzen, they won't have to spend on a full ground up architecture like they just did.", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Look at Intel's roadmap. It's only minor tweaks for the near future. \n\nYou know it takes ~5 years to design a totally new CPU, right? Intel can't just shit one out next year.\n\nIntel has no significant answer to Ryzen/Naples/Zen+ for 3 years. And they definitely don't have an answer to the upcoming Ryzen APUs since Intel integrated graphics are trash.", "score": 10, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -2, "replies": []}]}, {"body": "This statement is just plain false, Intel do not have a trick up their sleeve.", "score": 5, "replies": []}, {"body": "Intel has hit a roadblock in R n D recently they are in a vulnerable spot, karma for fucking over amd years ago", "score": 5, "replies": []}, {"body": "https://www.youtube.com/watch?v=e2vPp0fQUkM\n\nChanging development roadmap mid-lifecycle due to unexpected competition is not so easy.", "score": 3, "replies": []}]}]}]}, {"body": "THE LARGE MARKET FOR HIGH END CPU IS SERVER, AND INTEL'S GOT IT.", "score": 1, "replies": [{"body": "We'll see how it pans out, if they release ECC compatible Ryzen chips then we could see a slow shift towards AMD due to cost/performance and energy efficiency differences between ryzen and xeon. \n\nA good reason to be long, a terrible reason to look for quick money. ", "score": 1, "replies": []}]}]}
