{"title": "I have AAPL 4/16 $127.5 call Hold or Sell", "selftext": "[deleted]", "id": "lqamsc", "created_utc": 1614059143.0, "score": 1, "upvote_ratio": 1.0, "num_comments": 17, "comments": [{"body": "Hold... it’s recovering nicely from today’s dip... I have a bunch of 125 and 127 3/19 calls", "score": 2, "replies": [{"body": "Ahh, I c u change your mind and moved in 3/19th calls...nice move!", "score": 1, "replies": [{"body": "Yeah! Sold my puts this morning for a nice profit... and bought some longer term calls. So far so good", "score": 2, "replies": []}]}]}, {"body": "Hodl", "score": 2, "replies": [{"body": "I'm holding for tendiesss", "score": 1, "replies": []}]}, {"body": "Bounce back??", "score": 1, "replies": []}, {"body": "I'm holding!!  Why March instead April?", "score": 1, "replies": []}, {"body": "Yes. Hodler.", "score": 1, "replies": [{"body": "I'm a holder lol", "score": 1, "replies": []}]}, {"body": "Update?", "score": 1, "replies": [{"body": "Down a couple more hundred but still holding. I'll wait till mid March or April for a run up. Thoughts?", "score": 2, "replies": [{"body": "We are coming for u. NO man left behind", "score": 2, "replies": []}]}]}, {"body": "What did u end up doing here?", "score": 1, "replies": [{"body": "I'm holding. I feel like a run up by earnings is likely", "score": 2, "replies": [{"body": "Bought the same call as you. For 2.90ish", "score": 2, "replies": [{"body": "You got a way better entry point good deal!!", "score": 2, "replies": []}]}, {"body": "Agreed", "score": 1, "replies": []}]}]}]}
{"title": "Call me AMD crazy!!!!!", "selftext": "The market is distracted. It is confused and overly focused on 10yr yield. \n\nBull case for AMD: \n\nThey had their best qrt ever. \n\nThere is an obvious chip shortage across all chip industries. \n\nThey have great leadership. \n\nThey are at their lowest P/E ratio in 5 years. I mean seriuously AMD has been trading at a P/E is the 60s and with the recent market sell off their P/E is going to be below 40 by the end of the week.\n\nBear case for AMD:\n\nThe market does not like the stock. That simple. \n\nI mean the market is so focused on the re-opening and the 10yr yield that they are forgetting that AMD is crushing it.\n\nI mean shit look at Amazon. Best qrt ever like AMD, amazing leadership, and their P/E is at a 5y low. I dont know where you guys live but where I live they opened up a distribution center June of 2020 and they just announced another distribution center that they will break ground on this year. Over the last 3 earnings reports that were absolutely gangbusters, Amazon has gone nowhere. I mean seriously. They have gone nowhere and their last 3 quarters were record breaking. \n\nIf this keeps up I am going to jump in so deep on AMD 100c that I am going to have to marry Mrs. Su\n\nAm I crazy?", "id": "lq613b", "created_utc": 1614044782.0, "score": 14, "upvote_ratio": 0.76, "num_comments": 16, "comments": [{"body": "[deleted]", "score": 13, "replies": [{"body": "\\>I strongly believe in AMD.  I don't believe in the rationality of the market.\n\nThis right here. I did a DD analysis of AMD a few months back and I can tell you logically why it's a healthier company than NVDIA yet NVDIA is traded much higher than AMD and yet  the market has decided otherwise.", "score": 2, "replies": []}]}, {"body": "I would counter by saying that the market isn’t distracted, and you should be more focused on how yields are performing. \n\nHowever I’m with you on a bullish case for semiconductors. But...and just hear me out, AMD has struggled to get above their top resistance point which is like $96/$97 a share. I dunno if I would buy a $100 strike bc of that. \n\nAlso, while this take is going to be widely unpopular one here, I’m more bullish on intel right now than AMD. Especially with yields doing what they are. It’s P/E ratio is only like 13 and has huge upside potential.\n\nThis is not financial advice.", "score": 6, "replies": [{"body": "Definitely have good points. But their earnings growth is not translating into the stock price. At some point it will. \n\nI mean unless fundamentals don't matter? AMDs earnings are going in the right direction aggressively. \n\nWith the Chip shortage I would assume that means earning will continue to move up and to the right.", "score": 2, "replies": [{"body": "I agree...their earnings statements have been awesome. But I think their share price has been elevated a little too drastically in the past couple quarters. Which is why you aren’t seeing that much growth from positive earnings.", "score": 2, "replies": []}]}, {"body": "I’m with you in this one. \n\nBy rule i’m only allowed to hold 2 underlyings per sub sector. Since i already have QCOM, i picked INTC to be the other based off your premise.", "score": 1, "replies": []}]}, {"body": "tell that to my $93c that's down 3 grand...", "score": 6, "replies": [{"body": "i have 93c expiring friday. it's over lmao", "score": 0, "replies": [{"body": "Rip my man. I have til next month but not at all confident lol. Damn you AMD!", "score": 1, "replies": []}]}]}, {"body": "How far out on DTE?\n\nI'm with you and your thinking, and even have some shorter term options that have lost money recently, but still have some time and am going to keep holding.", "score": 2, "replies": [{"body": "Bought some expiring in July and December haha... If they get hit another 5-10% imma pick some more July up. \nAt some point it will snap back.", "score": 1, "replies": []}]}, {"body": "AMD stock price has massive future positive growth expectations baked into it. Ie: apple, Amazon \n\n- I’ve been burned by option plays with AMD....and apple.", "score": 2, "replies": [{"body": "Must be why SPG and ALK is working so well for me right now.", "score": 1, "replies": []}]}, {"body": "AMD is just taking a breather.  XLNX acquisition will be huge for them with adding to earnings right away plus additional data center business.  I’m hoping to add shares around $80", "score": 1, "replies": []}, {"body": "The current hype is about US semiconductors that actually manufacture in the US. AMD, because of its reliance on foundries will always be held hostage by same. If Intel had its shit together today at 7nm, AMD would be back in the teens, and I (ex-Intel guy) would be retired, because the stock would be worth more than shit $60.", "score": 1, "replies": [{"body": "I mean AMD is only 100 billion. Intel is still over double the size of AMD. \n\nI get comparing them to each other since they compete in the same industry. But I mean Intel is still a 250 billion dollar company. They still have a leg up on pure resources and name brand. \n\nWith the size of the Chip industry I think you still have room for each to keep growing. One day they may have to take each other out but can't we agree the market has.some growing room still?", "score": 3, "replies": []}]}, {"body": "I think tech overall has been declining in interest after their amazing run-up last year. Essentially, the entire sector is mostly out of steam with the exception of a few. Sadly I don't think AMD is one of those exceptions, future growth might already be priced in. I very much like the stock in every single aspect, but not as a trader. If I had the money I would load up on leaps and shares. Selling covered calls seem to be really promising right now.", "score": 1, "replies": []}]}
{"title": "Market Crash", "selftext": "Hey dudes I’ve been investing for only about a year now.  I was able to to escape on a lot of my positions before the pullback in March, but today’s already hitting me pretty hard.  This is the first time the markets flipped on me.  I know it’s best not to panic sell and wait it out, but what about adding to my position? Is now the best time to buy calls while the premiums are lower? Or is waiting it out the better option?", "id": "lqk066", "created_utc": 1614091513.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 12, "comments": [{"body": "Just chill, watch the show. Usually you want to have capital ready just for this moment to build existing positions.", "score": 3, "replies": [{"body": "Good advise. It is just a rotation and you don’t have to respond today.", "score": 1, "replies": []}]}, {"body": "PUTS PUTS PUTS PUTS", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "And that’s another thousand added to your net worth!", "score": 1, "replies": []}]}, {"body": "Abso-fucking-lutely", "score": 1, "replies": []}]}, {"body": "Wait until the fed chair finishes his congressional testimony this morning. That should provide the market with some direction. Right now, it’s a crap shoot.", "score": 6, "replies": []}, {"body": "This is a tiny blip.    Smart options investors control their max loss.  Let's you are fully invested in stocks with a totalc\\\\ cum beta of 1.  The market pulls back 30%, your value drops 30$.  If you go long in options with long calls, for example, and the market pulls back 30$, you lose 100%.  How long is it going to take you to save the amount you have lost?\n\nEvery educated option trader has hedged his position to avoid losing everything.  If you do only long calls and do not want to risk more than 30%, you should not have more than 30% of your portfolio value in the calls.\n\nI went into yesterday with mostly credit trades that make money even in pullbacks or run ups of up to 20% occur, and 49% of my positions were bearish.", "score": 2, "replies": [{"body": "Sorry this may be a stupid question. I had just purchased a 3 year leap for ARKK At strike 135 on 2/11 for $5100. \n\nIs this pull back going to hurt me deeply? I am under the impression that it is not likely for this fund to stay down for 3 years. \n\nConsole me?", "score": 1, "replies": []}]}, {"body": "Do not buy options. If you want to lower your cost basis then buy into stocks you already own.", "score": 2, "replies": [{"body": "Have to disagree.  Timing a high volume ETFs with sensible puts and calls can make decent money if one is not greedy.  If you set your \"bet\" smartly it can net you daily income.", "score": 0, "replies": []}]}, {"body": "I’d wait and try and not catch a falling knife. But with that being said you can’t predict the market. If you feel comfortable purchasing now that’s all on you. I prefer to see a pattern before purchasing", "score": 1, "replies": []}, {"body": "I added TQQQ yesterday but it is even lower. I will add more if I see prices get lowered more. Looking at DOG, VIX also. \n\nToday is a good day to catch up with anything but trading stocks.", "score": 1, "replies": []}]}
{"title": "Tesla Calls", "selftext": "[removed]", "id": "lqmgzr", "created_utc": 1614097822.0, "score": 0, "upvote_ratio": 0.25, "num_comments": 12, "comments": [{"body": "**Removed for RULE: Don't ask people to think for you: provide a stock analysis, strategy & option position to discuss.**\n\nPosts asking for a trade, amounting to \"TICKER\", or posts stating the individual has a trade position, and wondering what everybody else thinks are a drain on the community. \n\nPropose an analysis of an underlying, a strategy, and trade position with full details, for discussion and critique, so we can have a conversation.", "score": 1, "replies": []}, {"body": "Let me look into my crystal ball really quick...", "score": 7, "replies": [{"body": "Where's that remote viewing psychic who posted yesterday?", "score": 1, "replies": []}]}, {"body": "You should ask Burry. I hear he is a fan.", "score": 3, "replies": []}, {"body": "The bottom is when it starts going back up", "score": 2, "replies": []}, {"body": "It’s possible but no one can predict for certain", "score": 1, "replies": [{"body": "already back hovering around $700. need to get that practice account going to play with these a bit more", "score": 1, "replies": [{"body": "Play with what, you're just guessing. Any human can do that.", "score": 1, "replies": [{"body": "play with, practice, get more familiar with - you pick the term", "score": 1, "replies": [{"body": "Yeah, no harm in practicing a bit. Just be prepared to lose the money you put in, especially with options.", "score": 1, "replies": []}]}]}]}]}, {"body": "Elons working on a particle beam accelerated Tesla to reach Uranus. load up on calls", "score": 1, "replies": []}, {"body": "Go for it!", "score": 1, "replies": []}]}
{"title": "Please Help Me Understand Margin Requirement On Call Closing Order", "selftext": "I think this might be my first post, so please bear with me.  I'm trying to learn the craft of Options trading.  I'm currently doing ALL my trading on TD's ThinkorSwim platform with paper money, and I saw something today that I couldn't understand.  I hope you fine folks can help.\n\nUnderlying:  NVDA   Date:  Today, February 23, 2021\n\nIn two orders, I bought 20 ITM 550 Calls at a price of 18.50 per contract during the morning downslide of the stock.  My strategy is a gap play whereby I buy CALLs on the opening downgap, expecting the stock price to rise to close the gap by Contract Expiration (even better if it's the same day).  At that point, I sell the CALL Options to exit the Position(s).\n\nEDIT:  Based on the first reply below, I did buy 10 NVDA shares during the downturn about midday, an Equity Position, not an Option Position.\n\nTotal cost for the two (2) Filled Orders was $37,000, or $18,500 each.  I used the green \"POS\" (funny to type that) flags on the Trade tab to initiate a Closing Order on the 20 Open 550 Contracts.  In the Order Entry section, I selected the following:SINGLE,  SELL,  -20,  TO CLOSE,  NVDA,  26-FEB 21, (WEEKLY),  550,  CALL,  29.10,  LIMIT,  DAY,  BEST\n\nOther OPEN positions include (NVDA):\n\nEXP                               STRIKE  TYPE     QTY    PRICE       MARK                MARK VALUE  \n26 FEB 21 (WEEKLY)  580       CALL     +10     18.30        12.55                $12,550\n\n26 FEB 21 (WEEKLY)  590       CALL     +10     20.95         9.30                 $9,300\n\nWhat is confusing me is my Account Statement section called Profits and Losses now shows \"Margin Req\" of $2826.95 where there was none before selling the 20 550 Call Options.  Do you know why that triggered a Margin requirement if I was closing a Long Call Position?\n\nA screenshot of my account statement is attached.   THANK YOU!!!!!!\n\nhttps://preview.redd.it/p6vxuo7ymaj61.jpg?width=1600&format=pjpg&auto=webp&s=f5473b3ad09018b51bda877f35094c183acf42e2", "id": "lqtd23", "created_utc": 1614115162.0, "score": 3, "upvote_ratio": 0.67, "num_comments": 15, "comments": [{"body": "Looks like you hold 10 NVDA shares. Margin requirements on these shares are 50%.\n\nShares are currently valued at 10\\*$567.63 = $5,676.3, which means margin requirements = 0.50 \\* $5676.3 = **$2,838.15.**", "score": 3, "replies": [{"body": "Thank you, and that makes sense, but I was closing two Open CALLs that I had purchased earlier in the day, thinking that the closing order to Sell the Options would essentially cancel the Open Call Options positions.  What am I missing?", "score": 1, "replies": [{"body": "This has nothing to do with the call you bought and later sold. This margin is required to hold the 10 shares you own. This margin is required as long as you held the shares. \n\nYou’re right in thinking that selling the $550 calls closes your original position initiated by buying the $550 calls.", "score": 2, "replies": [{"body": "Thank you again.  No kidding?!  I've got to have 50% of the value of the PURCHASED shares in a margin account just to hold the shares, the ones I just purchased???  That is something I was NOT aware of...   Wow!\n\nWhose requirement is that, SEC, NVIDA, TDAmeritrade, or something else, or is the Margin requirement exist because I'm trading Options with the same Underlying stock?", "score": 1, "replies": [{"body": ">No kidding?!  I've got to have 50% of the value of the PURCHASED shares in a margin account just to hold the shares, the ones I just purchased???\n\nWell, this is as opposed to 100% in a cash account. This is how you get your 2X leverage in a RegT margin account. I'm not sure how this is a bad thing.\n\nNote that this is unrelated to your margin loan. I.e. you're not paying interest on this \"margin requirements\". You only pay interest if you borrow money, i.e. you have a negative cash balance.\n\n&#x200B;\n\n>Whose requirement is that, SEC, NVIDA, TDAmeritrade, or something else?\n\nAccording to  Investopedia: \n\n>The current initial margin requirement set by the Federal Reserve Board’s Regulation T is 50%.   \n>  \n>  \n>  \n>Source: [https://www.investopedia.com/terms/i/initialmargin.asp](https://www.investopedia.com/terms/i/initialmargin.asp)\n\nBrokers can require more than the 50%, depending on their in-house risk team.\n\n&#x200B;\n\nYou can learn more about initial and maintenance margin requirements here: [https://www.investopedia.com/terms/i/initialmargin.asp](https://www.investopedia.com/terms/i/initialmargin.asp)", "score": 1, "replies": []}]}, {"body": "I also, since this is a Paper Trading account, can't figure out how to adjust the Cash Account to add money to the Margin Account, or does TDA do that automatically?\n\nIn other words, do I need to move enough money from the Cash Account to a Margin Account, an account that I can't seem to find on My Account page?  \n\n\nEDIT:  Maybe I figured this out.  The Paper Trading account states it's a Margin account, and I thought there was something like an $80,000 cash account balance.  I ASSUMED, when buying the NVDA Equities that I was purchasing with cash (paper trading), but am I understanding that I bought them on Margin???", "score": 1, "replies": [{"body": "In paper trading, you either have a cash or a margin account (I believe by default it's a margin account and I don't even know if you can downgrade it to a cash account). I'm not sure what you're asking.", "score": 1, "replies": [{"body": "Yep, you nailed it.  It's a Margin Account, and says so right at the top of the page.  That's a big \"aha\" moment!  :-)  \n\n\nSo, never having had a brokerage account before, how do I buy Equities with Cash via a Margin account, or is that not possible?  Must I have separate accounts with the same brokerage?", "score": 1, "replies": [{"body": "You're misunderstanding how margin works.\n\nLet's just assume you trade shares of 50% marginable stocks. Whenever you buy shares, you use your own cash first. And if you hold shares that are worth more than your account size, then you're using the brokerage money (borrowed margin). This is indicated by having a negative cash balance. You can have up to twice your account size in 50% marginable shares.\n\n&#x200B;\n\nThis calculation gets a LOT more complicated when you consider options. Almost all long options are margined at 100%. Short options are also margined at 100%, unless you're approved for selling naked. In such case, margin requirements are dynamic and varies between 10-20% of the notional value.", "score": 1, "replies": [{"body": "I'm reasonably confident with my understanding of marginable securities; I think my MISunderstanding stems from not understanding the account limitations or possibilities with Cash versus Margin Accounts.    \n\n\nIn short, I thought I could purchase an Equity position in NVDA with my Margin account for Cash.", "score": 1, "replies": [{"body": ">In short, I thought I could purchase an Equity position in NVDA with my Margin account for Cash.\n\nYes. In a margin account, you buy Equities with your own cash first. Once you run out of cash, you start borrowing your broker's cash and pay interest.\n\nYour equity needs to be more than the maintenance margin requirements to avoid a margin call.", "score": 2, "replies": []}]}]}]}, {"body": "Sorry, I know I'm typing replies too fast, but I think there is a quick and easy answer in here.    \n\n\nMust I have separate accounts (Margin and Cash) to purchase Equities for Cash, or is it possible to buy Equities for Cash in a Margin account?", "score": 1, "replies": [{"body": "You're misunderstanding how margin works. Check my reply above, read the links I linked before.\n\nAnd search for margin equity vs maintenance margin requirements.", "score": 1, "replies": [{"body": "I'll do that and revisit this thread later.  Thank you so much for your insight and help!", "score": 1, "replies": [{"body": " \n\n>You're misunderstanding how margin works. Check my reply above, read the links I linked before.  \n>  \n>And search for margin equity vs maintenance margin requirements.\n\nI've read both of those links and watched the video.  I understand the mechanics of what is required for buying an Equity with a Margin account, but I thought the account had PLENTY of cash (paper cash) to purchase roughly $5700 worth of NVDA stock without borrowing it from the broker.  Clearly, I was wrong.   \n\n\nThe requirement to buy Equities with my own cash *first* makes total sense, and that is what I thought I was doing when I clicked \"Send\" on the Order tab for the 10 shares.  At this point, I am not sure how to change my Cash level in the Paper Trading side of the platform to avoid buying on Margin or how or what to do with the Margin requirement that shows up in my Account page now (should I liquidate the shares?).\n\nShort of a separate Cash Account to purchase Equities on the Paper Trading platform, I'm kinda stuck OR won't be buying any more Equities... \n\nFor what it's worth, I am learning ThinkorSwim little by little and only have about 2-3 weeks with it so far.  The Account Tabs, in addition to everything else on the platform, are a HUGE learning curve to say the least, but that's why I'm trading Paper Money and not real money :-)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}
{"title": "Bear Manifestation 2021 or 2022, maybe 2023?", "selftext": " \n\nAs I'm sure most of you know, talks of inflation and increased rates are circulating the news and subreddits. Also, Jerome Powell (our boy JPOW big boy money printer) talked to the Senate today.   \n\n\nHere are the most common indicators for Stock Market Crashes. \n\n**Rampant Speculation of Stocks**\n\nThis is seen everywhere, in our current market: SPAC’s being the main culprit. But also things like AMC and GME, Crypto currencies. \n\n**Rampant Speculation effect on the economy:** Prices go up! And this causes a Bubble. \n\n(yea its dumbed down)\n\n**Slowing Growth Rates of Economy:** \n\nInflation: Do I really need to explain how there is stupid amounts of inflation happening\n\nGDP: The GDP still hasn’t reached its previous level of COVID-19\n\nUnemployment: Total Unemployment is 6.3%, Women 6%, black or African American 9%, bottom 25% of wealth is 25% unemployed.\n\n**Peak Valuations:** P/E ratios are through the roof on every single stock compared to historic terms.\n\n**Lower Interest Rates:**\n\nInterest rates are pretty much 0% right now. \n\n**Potential Catalysts of an Entire Crash of the Market:**  \nIts staring us in the face: **Rise of Interest rates**\n\nWhy would this cause the crash. Well go do your DD if you don’t understand why. Or go look look at the SPY max, and when the interest rates go up and Compare them.   \n\n\n**Effect JPOW had today:** \n\nJPOW, stood by his guns and said that the interest rates will not increase for the near future. Even with the future rises of inflation, due to the base standard and the increase in demand from the opening up post covid.  \nHe also said something interesting and insightful of when we will see Interest rates rise. When Unemployment goes down. Some background information is that before COVID the Fed was constantly talking about how minorities and lower wealth people were adding to the recovery of the Economic state of the US.   \nI personally don’t think JPOW is going to hike interest rates until the unemployment.\n\n&#x200B;\n\n**My Strategy:** \n\nI think there is going to be a major pull back 10% or so in the economy when people see heightened inflation rates this April or May. I have SPY puts expiring JUNE.\n\nGoing to monitor Unemployment rates and Interest rates closely. When the lower quartile of wealth unemployment decreases to near average or Total unemployment rates, I will probably enter bear mode, and buy PUTs on the majority of the market. Probably heavy puts on the DIA and XLK.   \nDIA because they have the cheapest ones, and XLK because I think tech will plummet for sell offs since their valuations are the highest.\n\n**Positions:** \n\nXLK Puts expiring June 18th\n\nSPY Puts expiring June 18th\n\nModerate amount DIA Puts expiring Jan 2022 \n\n\\^\n\nWill times 4 what I have in there.   \n\n\nWhen Unemployment settles back towards the average. I will be buying PUTS' one to two years out, on our tech etf's and DIA.", "id": "lqtfq5", "created_utc": 1614115366.0, "score": 6, "upvote_ratio": 0.75, "num_comments": 13, "comments": [{"body": "I think we see a turbo-charged market this summer which will need to be cooled down a little later.\n\nI like June/July calls and October (or Jan 2022) puts.  We have one more round of craziness in this market yet.  Just a gut feeling combined with the unwillingness of a new government in America wanting to see things fall on their watch.", "score": 7, "replies": []}, {"body": "Personally I don't think betting against this market is a good idea. As another poster pointed out, a new president is not going to let the market crumble in his first year - expect ongoing stimulus and more QE. I'm expecting a strong spring/summer as people are *finally* able to return to some degree of normalcy with vaccinations becoming more available. I'm guessing consumer spending will be strong and exuberance will continue for a while longer. \n \nThe market may seem \"expensive\", but it's all relative. Bears have correctly called 12 of the last 5 corrections, as the saying goes, so valuation alone is not enough for me to bet against a rising market, I think this one has some legs left barring some major negative catalyst.", "score": 4, "replies": [{"body": "You cannot fight the fed and QE. Just look back to last Spring when everything was going to hell. Research the headlines of the 4th week of March when the bottom was put in. One thing happened. Stimulus was announced and the market took off from that point. Covid was barely killing people then and the market shrugged it all off. It is always about the liquidity. If you got in the way you were run over. This stupidity will go on a while longer. The \"irrational exuberance\" can take 3 years to blow off though everyone expects it any day. Just take advantage and remember it because it only comes around every decade or two. Now if that 1.9 trillion gets killed the market will be down 3%, down 5%, down 6% for days until they buck up and pass something to stop the bleeding and crying. They say stay in and don't miss the good days. The bad days are what kills the return. The market crawls up the stairs and then jumps down.", "score": 3, "replies": []}, {"body": "But inflation... there’s only so much the government can do at this point. It’s only going to get worse. If inflation rates rise above 3-4% then JPOW going to have to do something. Honestly IMO, If I was the president worrying about my public image. I’d take a shit on the economy now. And pull it out of the depths.", "score": 1, "replies": [{"body": "That’s not the way the world works though my man. Powell is signaling that he doesn’t believe inflation is a threat and will continue using active monetary policy. The president is not going to shit all over the economy regardless of what is best long term. There are no moral victories in the market, and standing in front of this market is a losing game for the foreseeable future IMO. \n\n \n\nhttps://www.google.com/amp/s/www.cnbc.com/amp/2021/02/23/powell-says-inflation-is-still-soft-and-the-fed-is-committed-to-current-policy-stance.html", "score": 4, "replies": []}, {"body": "And that’s why you won’t be elected president. Your monetary policies just won’t be popular enough. It’s either the dollar or the working class. JPOW and Biden  says the working class and fuck the dollar", "score": 1, "replies": []}]}]}, {"body": "What's your opinion on buying ARKG and SPEX puts to hedge SPACs and tech and EV stocks? They are so volatile and sink each time market moves into negative territory.", "score": 2, "replies": [{"body": "Well depends on your conviction of the stock and your own DD. \n\nBut, to hedge against tech sector crash just go buy a couple of XLK puts. Or Just puts on ARK.\n\nI mean Puts are literally created to hedge against.", "score": 1, "replies": []}]}, {"body": "I just made a good return today from buying calls on uvxy and sqqq. Saw a lot of red and instinctively smelled volatility. These have been much cheaper then buying buying put options on the indexes. Haven't been dating that long what do you guys think of this strategy as a hedge moving forward?", "score": 2, "replies": []}, {"body": "I love how everyone likes to say oh the market priced it in, all the time and still post nonsense like this. Do you think, if a random person on the internet knows all this than the market hasn't priced this in yet. Crashes don't happen because of things everyone can see coming. If a crash happens it will be for a reason that no one can see coming.", "score": 2, "replies": []}, {"body": "Just don't let that cathie wood pwn you.  Mark my words, social responsible investing, and this woman facade running the BS disruptor investing are going down.  I already sold most of my SQ shares which I bought in originally at $11 WAY before disruptor bitch started talking her book.\n\nAll we need is a little margin call to do what WSB couldn't do and get hedgies at the cathie wood hedge fund rat motel to force liquidate and hopefully trigger a cascade.  I will be on the bid for the next regime portfolio.", "score": -4, "replies": [{"body": "Good luck.", "score": 1, "replies": []}]}, {"body": "For your XLK, SPY and DIA puts - what strikes are they at? How do u think about strikes in the context of such market hedges?", "score": 1, "replies": []}]}
{"title": "From weekly to longer/monthly trading", "selftext": "I have been selling covered calls and spreads but generally only for the week of expiration or maybe if it's a Friday the next weeks because of of the volatility. I feel it's harder to predict longer out for the short spreads, and I'm already having kind of flip flopping between good and bad weeks depending on the surprise.  \n\nMainly I try for stocks that have larger IV like AMZN or NFLX So I can go further with the strike and still have a reasonable, to me, risk/reward. but after opening contracts every week, I was wondering if it might be beneficial to doing longer term, say 2 weeks or month instead, but wasn't sure what I should consider as well.  I would appreciate any tips on consideration for what to look for and even underlyings.", "id": "lqu2p1", "created_utc": 1614117055.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 12, "comments": [{"body": "It's important to realize that expiration date does not equal holding time. I routinely open 45 DTE positions and close from 5 to 10 days later. You can still keep the short holding time, but you don't have to take on all the expiration week risks.", "score": 3, "replies": [{"body": "Is that basically you're using the longer time value to give you a cushion in case the trade goes against you, ie to either hold for longer or roll into something different?", "score": 1, "replies": [{"body": "It depends on debit vs credit.\n\nFor credit, it’s to get a larger premium.\n\nFor debit, it’s to have more time for the call to recover if it goes wrong.", "score": 1, "replies": []}]}, {"body": "Yup. DTE is the *maximum* holding time.", "score": 1, "replies": []}]}, {"body": "My rule of thumb is 30 to 60 out for vertical spreads.", "score": 2, "replies": [{"body": "Weekly trades can offer you more reward with more risk. It is ultimately up to your style. I agree with u/Bachata_boy because 30-60 gives you more \"options\".", "score": 2, "replies": [{"body": "I'm pretty risk averse so that's why I go that far out.", "score": 2, "replies": [{"body": "Makes sense but that amount of time is also strategic because Theta is on your side compared to 5 days from exp. I mostly do 30 to provide myself with some monthly income.", "score": 1, "replies": [{"body": "So the way i thought about it was if i sold a strike at say $500, and the underlying went from say 450 to 490, if it was expiring at the end of the week, theta would push the value to zero because of expiration.\n\nVs if it's bought say 30 days out, IV would push past what theta could reduce by. Or would that be the options you're looking for to take the loss and roll up or out. Or are my assumptions just off?", "score": 2, "replies": [{"body": "That's an aggressive but fair approach. Definitely not saying there is an issue but it is not for everyone. It is true that if you sold a call Theta would decrease the value in the example you gave. From my perspective, if I am selling a $500 strike, than I am happy of being assigned and selling the underlying for $500/share. However, let's take it the opposite route, I sell a $500c with 30 days to exp. If the share price falls from 450 to 350, i could possibly close my position for a 90% profit and never risk getting assigned. if a month later the stock surpasses $500, then i can sell past the $500 and net the difference. I like that I have more directions.\n\nYour strategy is one I have used. I found that the IV headache became too much of a burden and Theta was almost negated because sometimes IV drives the price in crazy directions. From my experience, it is a preference to have more time to capture a specific profit then risk going to exp.\n\nHow are you fairing in the bear market?", "score": 1, "replies": [{"body": "Ahh I c; that makes sense, currently i'm basically going as far from the strike as I can? what's bear atm? or do you mean the last week, it's been ok ie other than long holdings going down it's the same play. \n\nBut what you said makes sense; how do you chose your underlying/strikes then?", "score": 1, "replies": [{"body": "Depends on my approach:\n\n1. Speculation (betting)\n2. Growth (DD)\n3. Value (Intrinsic Value)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
{"title": "Falling knife or I’m overthinking my DD? AMZN Leap", "selftext": "I bought a Amazon leap for January 2022 (3500 strike)\n\nMy belief in aws and now the thought of its own currency (blockchain) has put me into the belief of not sellling the call til about November. \n\nI was up about 7k and sticking with my plan am now down about 7. It’s tough to look at, but believing in my dd I’m not totally worried about it.\n\nDo people’s exit strategies change when up a significant amount or again hindsight is 2020 and the bezos thing was not foreseen and should I have took my profits there even with the plan to hold? \n\nIt’s Amazon and I’m not truly worried , but just want some insight on big hedges of a company you believe in when it comes to leaps.", "id": "lqukfc", "created_utc": 1614118363.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "Amazon chops around for weeks and months and suddenly with no big news the market realizes that it‘s still probably the strongest company and that it crushes every analyst‘s expectation and so suddenly has those multiple +3-5% days. \nProblem right now is that the market assigns the “tech“ label to amazon but at the same time it’s considered almost value because it’s not tech of the newest kind (like FSLY, DDOG, DOCU, SQ etc). So basically when tech sells off this sells off and when the Nasdaq and memes run this is stagnant because it’s also considered a value/boomer stock. That explains why it’s more than 10% off of its highs and actually negative since mid July.\nAs soon as this stock has it‘s face ripper breaking out of its chopping range the calls will explode. But timing this bad boy is deadly so as long as your initial thesis is intact I would keep holding.", "score": 8, "replies": []}, {"body": "I'd say leaps themselves are hedges because the long time horizon smoothes out these ups and downs. You didn't choose a 3 month call for a reason, that's inherently a hedge.\n\nI've seen my leaps go from 70% up to -40% back to 100+% up (not AMZN).\n\nYou can still be careful like not putting all the money at once (something I learnt this week) even if it's all leaps.\n\nBtw, Amazon management change is much more optical than people assume. Bezos probably wanted someone to go to these congressional testimonies. (Congress feels insulted when CEOs send their deputies). He's not going away.\n\nIn any case, AMZN isn't nearly as volatile as some of the high growth names. So I wouldn't be worried too much.", "score": 5, "replies": [{"body": "> I'd say leaps themselves are hedges because the long time horizon smoothes out these ups and downs.\n\nI agree LEAPs are hedged, but not for that reason.\n\nA LEAP call is effectively the same as long stock with a protective put at the same strike. You can really just think of the LEAP as buying stock with insurance against losses below your strike.", "score": 2, "replies": [{"body": "Could you please elaborate on LEAPs hedge and protective put? I’ve viewed ITM LEAPs as closer to synthetic leverage, am I wrong?", "score": 2, "replies": [{"body": "You're right that ITM LEAPs are almost synthetic longs. The main differences between a LEAP and long stock of course is that:\n\n* the LEAP will slowly decay\n* the LEAP delta will be slightly less than 1 (whereas stock delta is 1)\n* if you hold to expiration, you won't lose any intrinsic value below the strike on the LEAP (whereas you would keep losing money with long stock until it hits 0)\n\nYou'll notice that the LEAP call is very similar to buying long stock with a protective put:\n\n* the put decays\n* the put delta (some small negative number) added to the stock delta of 1 offers an effective delta slightly less than 1.\n* the put provides insurance against the stock going below the strike\n\nIf you do the math and put/call parity holds, you'll find that the LEAP call is actually identical (in profit/loss) to stock + protective put at the same strike and expiration.\n\nFrom a practical point, there are in fact two differences between these kinds of positions:\n\n* The LEAP requires less capital, which means you can get more leverage if you want it. E.g: long stock + put might cost 3x more, but you can only lose 1/3rd of your investment with the protective put, whereas you can lose everything on the ITM LEAP call.\n* Taxes on options are always short-term capital gains, whereas the long stock can be taxed as long-term gains (typically a much lower rate) if you hold longer than a year.", "score": 1, "replies": [{"body": "Thanks, super helpful. Follow up, won’t you lose you premium on the leap if the stock drops below the strike, so the premium can go to zero as well? Doesn’t the intrinsic value become extrinsic risk below the strike? \n\nI guess in more plain English, you’re saying you don’t lose intrinsic value, but you still lose your premium, eg loss of capital is not the same as intrinsic loss. This is a result of the stock going below strike, and a closer expiration makes delta  less than one and other Greeks more of a factor?\n\nFor clarity when I said ITM, I did not mean DEEP ITM. I was thinking a few handles ITM or NTM.", "score": 1, "replies": [{"body": "The \"call = stock + put\" equality (also called put-call parity for options at the same strike and expiration) holds true even if the call is OTM.\n\nIn that case, the call and the put will still have the same amout of extrinsic value*. For example:\n\nSay some stock is trading today at $100, and I buy a LEAP call with strike 80 for $25.00 ($20 intrinsic, $5 extrinsic value)\n\nThis would have equivalent P/L to buying 100 shares and an 80 put for $5.00 (ignore any inefficiencies with the bid-ask spread).\n\nIf the stock goes down to $80, the call will lose intrinsic value and gain extrinsic value; say it is now worth $10 ($0 intrinsic, $10 extrinsic). Because both the call and put are both ATM with the same time to exp, the put should also be worth $10 (all extrinsic).\n\nBoth positions are down $1500 (the shares lost $2000, but put gained $500).\n\nIf now the underlying drops below $80, the call would continue to lose its extrinsic value from $10. But note that *the put would also lose the same amount of extrinsic value* and exchange it for intrinsic value. Unfortunately for the put holder, all his intrinsic value gains on the put are now exactly canceled out by his losses on the shares below $80.\n\n*Note there are a couple things that can mess with put-call parity:\n\n* Dividends: this future loss of value from the stock should be built into option prices. Go to any high yield stock and compare prices of puts and calls with equal moneyness. The puts will always be more expensive.\n* Borrowing costs: stocks that are hard to borrow can have very high borrowing fees. This means hedging a sold put (which can be done by shorting a stock) is considerably more expensive for a market maker than hedging a sold call (done by buying stock).", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I'm in the same boat with Aug 3300 strike I bought recently. But I've been buying Amzn calls for a long time and I'd be shocked to have one NOT fall right after I bought it. My timing just sucks, I guess. But I always seem to come out ahead in the end so I'm just holding on for the ride. It is a shorter time frame than my usual but AMZN recently paid off my house for me so I'll give the benefit of the doubt.", "score": 3, "replies": []}, {"body": "This is why I love scaling into my positions. Once I like a long term play (often deep ITM leaps) I’ll sometimes take up to 6 months to build my position. Some of that is scaling in when there’s an opportunity and fundamentals haven’t changed, sometimes it’s taking on more risk if my initial position is so deep ITM it isn’t providing the leverage I want.\n\nIf you have the capital and liked the position I’d potentially suggest scaling in. If you only had enough money to build your position in a single trade — that’s the risk you take. Often a fast lump sum is best, but at times DCA overperforms. That’s randomness. \n\nI had this same thing with leaps in FXI, was able to reach my full position size in late Dec during delisting fears. To be fair I was never down at that point, but it looked highly risky at the time but I didn’t even consider closing. If market crashes I still believe in my decision. Nothing you can do about rando market-wide fluxes. It was only a “wrong” decision if your DD is proven decisively incorrect.\n\nThat’s right, if nasdaq drops 50% this year and Amazon goes with it, you won’t necessarily be wrong on the company. We are probably in a bubble, but there’s no telling when/if it pops. Good DD can’t save you from that. I say you’re good if nothing has materially changed.", "score": 2, "replies": []}, {"body": "Options are active investments. I personally have a plan for those scenarios. Sometimes it is best to take profits but it ultimately comes down to your style. can't tell you you're wrong. Depends on your strat. I am financially illiterate though so please ignore me.", "score": 1, "replies": []}, {"body": "Felt the same way about tesla, it's been a rough couple weeks for it and I admittedly have had the thought of cutting my losses and going with another larger priced investment. But I believe in what the company is doing, theyve made leaps and bounds in the auto industry and I personally believe theyll make a comeback on yet another unique idea. I'm convinced to stick with it unless the company itself throws in the towel.", "score": 1, "replies": []}, {"body": "Remember 70-75% of the movement in any ticker is the market and the sector - in aggressively moving ticker the pecentage is higher.  In a pull back there will be a ton of profit takers selling positions in the best companies and .................................Buying a call requires the ticker to move in your direction, selling cash covered puts reduces income, but the ticker does not have to move in your favor to be profitable.", "score": 1, "replies": []}, {"body": "It seems the market will stop pricing in pandemic stocks such as amazon soon. But your leap is long enough that you might make it through", "score": 1, "replies": []}]}
{"title": "Fundamental philosophies for 'reading' the Stock Market (surfing analogies appreciated)?", "selftext": "I'm the cliche who got in very late on GME/AMC but I'm the odd duck who is actually kind of fine with that - losing a few hundred dollars (actually cashing out my GME stocks as they were crashing in this case) was the spark motivated me to *finally* learn about the stock market. \n\nOver the past month I've been reading a ton and have been introduced to the greeks and the wheel BUT realized that I've still got a lot more learning to do before I could confidently start messing around with calls or puts. It's taking all of my restraint from jumping into that stuff 2 feet first because it all seems like a very exciting way to make/lose money. \n\nIf I'm brutally honest I still need to understand the fundamentals and over the 4 week's I've watched my stocks go up and down and down the only thing that's obvious is the seeming anarchy of the market and trends. Certain advice like 'buy on the hype sell on the news' has become illustrated by watching the market. My friend has taken to using surfing analogies when talking about the stock market and to paraphrase him: I am hoping to learn how to 'read the water'. Reading the water in surfing essentially means how to find a wave (stock, in this case) and be able to catch it. Reading the water is a process that takes almost as long to master as surfing itself but it comes down to understanding and *feeling* a few crucial factors: noticing a bump on the horizon moving towards you, getting a sense of where it will break, what the current is doing, timing how far/fast to paddle and other variables like if it's too crowded or are you likely to wipe-out onto a rock. I feel like there are analogies to all of these factors in the stock market and they culminate to every person's individual ability to read the marker in the way surfers read the water. \n\nMost recently I've been trying to identify 'the dip' and when to buy - basically where I need to start paddling in order to catch the wave and the timing of it all. As a beginner any advice is really appreciated - also your own personal strategies if you feel like sharing them. \n\nMy positions as of this morning: AAPL, SQ, DM, AGTC, NSRGY, RVP, MJ, KT, SNDL and of course AMC because I want to go to the movies. I have taken a hell of a beating but realized I jumped in at the most overvalued time in history. Today seemed like a dip so I went doubled some of my positions - hope I did not jump the gun.", "id": "lqr40j", "created_utc": 1614109393.0, "score": 24, "upvote_ratio": 1.0, "num_comments": 15, "comments": [{"body": "Read these books homie:\n\nThe Intelligent Investor - Benjamin Graham\n\nThe Little Book of Common Sense Investing - John C. Bogle\n\nThinking Fast and Slow - Daniel Kahneman\n\nThe Black Swan - Nassim Nicholas Taleb\n\nSuperforecasting - Philip Tetlock\n\nWhat I Learned Losing a Million Dollars - Jim Paul\n\nMisbehaving - Richard H. Thaler\n\nA Random Walk Down Wall Street - Burton G. Malkiel", "score": 14, "replies": [{"body": "How you gonna leave out William O’Neil and CAN SLIM", "score": 1, "replies": [{"body": "never heard of him", "score": 3, "replies": [{"body": "Would you recommend reading in order listed or which first?", "score": 1, "replies": [{"body": "yes order listed is perfect - start with intelligent investor then the little book of common sense investing and so on", "score": 1, "replies": []}]}]}]}]}, {"body": "Youtube is your friend, and investopedia. Just keep watching video and lurking on reddit, when you see a term google it. Just keep reading and watching. A basic thing to know is how to read candlestick charts, and figure out like support/resistance lines and stuff. Also start learning basic terms like rsi, p/e, stuff like that. And just keep watching stocks. You'll start seeing how certain things like earning reports or press releases affect stocks.", "score": 8, "replies": []}, {"body": "[https://www.investopedia.com/trading/support-and-resistance-basics/](https://www.investopedia.com/trading/support-and-resistance-basics/)", "score": 6, "replies": [{"body": "Thank you for the link. I spent my afternoon reading all about that and the candlebar graphs then honestly had to take a nap from thinking too hard lol.", "score": 3, "replies": [{"body": "It gets easier to follow after you do it a few times after a while it becomes second nature to pick out. You'll get the hang of it.", "score": 2, "replies": []}]}]}, {"body": "Check username 🤙\n\nAlso FOMO'd into stocks for the first time with GME, and wiped out badly for much more than a few hundred, but my portfolio is up 4 whole dollars today so the market can kiss my ass 🚀", "score": 5, "replies": [{"body": "It was an odd feeling to keep adding money to my account to keep buying stocks that kept losing money but being *fairly sure* I'm doing it right (at least I feel better about some of my stocks) this time.", "score": 1, "replies": []}]}, {"body": "But me to man! Bought the dip have about 15% on standby for next potential “crash”", "score": 2, "replies": []}, {"body": "You gotta catch the wave before it breaks.", "score": 2, "replies": []}, {"body": "[NO ONE FORKING KNOWS!!](https://youtu.be/wM6exo00T5I)", "score": 0, "replies": []}, {"body": "I have a long position today that dipped. Read the day chart today. Used the RSI and MACD together to time my buy. Bought very close to the exact bottom for the day and the difference it makes on ur account balance at the end of the day is pretty reinforcing. Complete rookie. Just happy I feel like I did something right haha", "score": 1, "replies": []}]}
{"title": "$JBLU / $AAL / $TRVG / $ABNB - Summer Blowout Analysis", "selftext": "[deleted]", "id": "lqv5o4", "created_utc": 1614120021.0, "score": 24, "upvote_ratio": 0.95, "num_comments": 14, "comments": [{"body": "Following", "score": 3, "replies": []}, {"body": "I have 10,000 shares of TRVG\n\nfeels good man", "score": 3, "replies": [{"body": "Solid position, 500 @ 2.71 myself, trivago has the best hotel deals IMO", "score": 2, "replies": []}, {"body": "TRVG I’m in... been buying it for years & during the dips. Lezzzz go!!!", "score": 1, "replies": []}]}, {"body": "Definitely think airlines will be a good play, or at least, enough people will get hyped about them to make buying options a good idea\n\nJust curious; what are you thoughts on the k-shaped recovery affecting airlines and travel? I would assume that perhaps not as many people will be able to afford vacations compared w/ pre-covid times. \n\nAt least for airlines, I think the summer timeline might be a bit soon; I think the biggest gains will come around the holidays this year or early next year after most people are vaccinated.", "score": 2, "replies": [{"body": "Good point! I don't agree that it will be a K shaped recovery that negatively affects the travel industry. I've been following white closely on the way travel has been managed these past few months and I feel quite strongly that it's bound for a complete recovery. It may not feel the same as before when traveling but the stock price will reflect a new normal that contends against it's old business values from pre-COVID.", "score": 1, "replies": []}]}, {"body": "I had 10 3/19 15$ calls on jblu before their earnings. Sold after earnings for a 100$ total gain. Looked at it now and I would of been up 3100 if I held. Big ooof.", "score": 2, "replies": [{"body": "You take your profits when you can. No use in moping over haves/have nots. 😊", "score": 5, "replies": []}]}, {"body": "I'm with you on this one, travel is my #1 play right now. Pent up demand will explode in a couple months. Expecting to see big things in Q3 earnings around the industry. Can't bring myself to love AAL, TRVG is interesting though.", "score": 2, "replies": []}, {"body": "Why do you not have positions? 🙄", "score": 2, "replies": [{"body": "I do now haha", "score": 1, "replies": [{"body": "This is the way", "score": 1, "replies": [{"body": "##This Is The Way Leaderboard  \n\n**1.** `u/OverDoneCactus` **234** times.\n\n**2.** `u/UglyWaffle27` **224** times.\n\n**3.** `u/anticensor_bot` **207** times.\n\n..\n\n**1098.** `u/Blink_Bull` **3** times.\n\n---\n\n^(^beep ^boop ^I ^am ^a ^bot ^and ^this ^action ^was ^performed ^automatically.)", "score": 2, "replies": []}]}]}]}, {"body": "TRVG $TRVG gets me excited", "score": 2, "replies": []}]}
{"title": "AMD - is it too late to join the party?", "selftext": "So I haven't held a position in AMD for a while. I benefited greatly trading 2019/2020, and decided to put it down for a while. With all the recent concerns about chip shortages, I've become interested again, and don't see it as something that can be solved immediately. As I have for years now, I see AMD in a great position. Solid leadership, solid performance, solid returns. The more I look at it, the more I think it's not truly overvalued, and they have a lot of potential to grow.\n\nAny opinions?\n\nI'd like to also take a quick second and thank everyone for their input. This peer review system is the greatest advantage we have in our trades/investments. It allows us to be criticized when we make mistakes, and encouraged when on the right track. It's truly amazing, and you're all truly amazing! Thanks for the help!\n\n&#x200B;\n\nhttps://preview.redd.it/zt6kw7znp4j61.jpg?width=1600&format=pjpg&auto=webp&s=4e292130f3e7d593d43018e420a17d88d719734b", "id": "lq5jc2", "created_utc": 1614043263.0, "score": 5, "upvote_ratio": 0.7, "num_comments": 18, "comments": [{"body": "I've been interested in AMD also. Can't quite decide what it will do though. Seems like with shortages, 3rd parties collect the premium though when selling to buyers.", "score": 4, "replies": [{"body": "Thank you. I'll look more into this.", "score": 2, "replies": []}, {"body": "So the conclusion I'm drawing is that you are correct, regarding the premium. However as manufacturing catches up to demand, there should be a positive impact on revenue.", "score": 1, "replies": []}]}, {"body": "It's a better value than Nvidia based on P/S and revenue growth", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Correct me if I'm mistaken, but isn't SOX an ETF?", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I agree with you that this is a bullish case. I admit I don't point out as many of the negatives, however I do try to indicate clearly that it's not guaranteed green candles ahead.", "score": 1, "replies": []}]}]}]}, {"body": "Check the recent short selling...\n\nI stumbled across a comment that AMD had a bunch of shorts for $90 this past Friday, where, it was up at the beginning of the week.\n\nMarket around this should be reviewed in addition to the AMD DD presented.\n\nHold no positions, went a different direction.", "score": 3, "replies": [{"body": "I'm actually working a few sheets on the greater picture as well. I just really wanted feedback on what I'm thinking about AMD at the moment. I did not look into short interest, and really appreciate this.\n\nMay I ask, what is the direction you went?", "score": 1, "replies": [{"body": "I did not buy AMD.\n. \nTSM has many positives, eg, building a factory in AZ.  Did not buy.\n\nReviewed  MU & Intel, too. Did not buy.\n\nWent w/ SMH ETF vs a specific manufacturer. Worked better w/ my risk and my lack of time.\nYMMV", "score": 1, "replies": [{"body": "Very nice. I looked into a bunch of the ETFs in the sector, and I'm actually considering going this route as well. I do however like the numbers on Proshares USD much better, except the NVDA position with that is a little much for my liking... need to think it through a bit.", "score": 1, "replies": [{"body": "I just read some DD today on AMD on Reddit. Unsure which sub, but discussed its trading within a band. Interesting.\n\nI’m not against single stocks, but, I don’t always have access to the internet and can miss DAYS on the market. Not a fan of stop-loss due to the ladder attacks, so, I sometimes need a “set it and forget” mode.", "score": 2, "replies": []}]}]}]}]}, {"body": "The big key with AMD is the Xilinx acquisition.  I think slide 8 and 18  of the [investor presentation](https://www.amd.com/system/files/documents/strategic-acquisition-xilinx-investor-presentation.pdf) are the keys for ADM to be long-term hold in anyone portfolio, especially in %GP increase to AMD bottomline.", "score": 3, "replies": [{"body": "Thanks for this, very helpful.", "score": 1, "replies": []}]}, {"body": "Amd is one of the largest buyers of gold along with intel and samsung. Golds needed to make processors. With no end in sight to the printing of usa dollars ( inflation) amd could be very negatively affected if gold prices surge like gold has historically done with inflation. However the industry is putting processors in just about any product they can think of these days and they have just gotten started.", "score": 2, "replies": [{"body": "I did give thought to this. However I can't see the rising price of gold affecting production, as the demand/profit is high. I wonder, is the \"investment grade\" gold the same as the gold used in circuit boards?", "score": 1, "replies": [{"body": "I doubt it's the same gold but a gold price rise will effect their sales and profits. I'm staying away for now though.", "score": 2, "replies": []}]}]}, {"body": "It isn't a party, it is a longterm play. I bought it for diversification, myself. But it is meme-proof.\n\nThat said, the price is nice right now. I'd buy more if it was a trade, but I'm not going to buy it just for 10% in a month or whatever it will do.\n\nGreat investment, but only moderate trade, in my opinion.", "score": 2, "replies": [{"body": "That's what I was thinking as well. With the downturn, I'd like to take a position and see it through for a while.", "score": 1, "replies": []}]}]}
{"title": "Defense stocks help", "selftext": "What are opinions on defense stocks like Raytheon Lockehead Martin and Boeing? Im a young investor looking to invest long term. I’ve been really looking at Raytheon especially the dividend but I’ve never invested in a defense stock before. I’m trying to diversify my portfolio but i have no ideas where to begin to look in the industry. All news I see is stuff  on the news is how about  a plane blew up or an engine failed and next you see the stock drop significantly. I may be misinformed that’s just what I’ve heard. Are defense companies worth investing in the long run. Do companies like these normally grow well and perform well?", "id": "lq8i5j", "created_utc": 1614052456.0, "score": 6, "upvote_ratio": 0.76, "num_comments": 15, "comments": [{"body": "buy real companies, buy low sell high. have a plan. dont buy on margin & do research", "score": 4, "replies": []}, {"body": "Consider DFEN ETF also if you want to invest in a basket of those stocks", "score": 3, "replies": [{"body": "DFEN is leveraged. Generally not recommended for long term.", "score": 1, "replies": [{"body": "Fair enough", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 4, "replies": [{"body": "You called it but instead of summer it was by end of week lol", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Nawh you smart for not watching tv lol I only saw it on twitter. He bombed Syria", "score": 2, "replies": []}]}]}]}, {"body": "I like LMT, LDOS, and KTOS. LMT for rock solid financials and contracts that will never go away. LDOS for everything tech from cyber security to boring old IT. And KTOS for a riskier growth option. Stay away from BA unless you have very long term goals. RTX to me was always a watered down LMT, but it has its own appeal.", "score": 2, "replies": []}, {"body": "Could look into MRS", "score": 2, "replies": []}, {"body": "I've been adding to my long term holdings, LMT, RTX, GD, NOC, LHX, and BA... In another account I'm also buying ROKT which has all of those along with lots of others. They've been depressed lately, but IMO they should do well in the event of another war, and /or as space exploration takes off.", "score": 2, "replies": []}, {"body": "Maybe throw GE into that mix. Their Aviation side of the house seems to be performing well.", "score": 2, "replies": []}, {"body": "LMT. Teledyne recently bought FLIR as well. Grumman, BAE systems, Leidos, L3Harris", "score": 1, "replies": []}, {"body": "My boomer advice to my youngest is put some in a total market index fund and some in a small cap growth fund. The most successful companies when I was a kid are either gone or dog barf now. Let the market pick the winners over a really long horizon. Even defense technology will radically alter over that time frame.", "score": 1, "replies": []}]}
{"title": "Here is the reason why I sold all my Tesla share. It is a very bad decision and Bitcoin Keep dropping and you know how much Tesla will lose in this quarter? 100 million or half a billion?", "selftext": "", "id": "lqe0zu", "created_utc": 1614071254.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 14, "comments": [{"body": "Elon Musk is just another tech mogul, one of many on a long list. Granted he is a flamboyant risktaker. But why the obsession with what he says. I don't find his thought bubbles particularly noteworthy. I think bill gates has done more for more people than he has done. The only time I've enjoyed watching him in that debate with Jack Ma, where he wiped the floor with the man.", "score": 5, "replies": []}, {"body": "i think you selling your shares based on Elon Musk chatting shit here and there wasnt very wise. Good luck", "score": 7, "replies": [{"body": "If CEO buying shit and making the wrong decision. Why should I support him? As CEO buying shit meaning he is not a good decision maker. I wish you all the best on your tesla stock.\n\nB.S. Tesla will drop massively tonight. you will see it.Good luck", "score": -11, "replies": [{"body": "the CEO has 3 other companies that are doing the most on the side, all the people buy tesla that want to support him. Tesla stock will go up and your statement there just goes to show that you know nothing about the market specially Tesla since it always goes up and down depending on what Elon says. his words alone make BTC drop and rise and you think you are smart lol retard", "score": 7, "replies": [{"body": "Whether Tesla will go up or go down. We don't need to argue and you will see. If fund don't support Elon, Elon is nothing. Especially when fund sold $1.5 billion value of bitcoin to Elon, we know that he is cheating by those fund.", "score": -9, "replies": []}]}]}]}, {"body": "Lol tesla will lose nothing on paper. Bitcoin was genius as a tax haven. So now tesla can write off how ever much Bitcoin falls in taxes. And can recoup how ever much when it bounces back. They will report earning when Bitcoin rebounds and blow everything out the water. But also can save a ton in taxes. \nWhy was it a bad idea again?", "score": 3, "replies": [{"body": "Come on save a ton in taxes? No way, I think you don't understand the account standards and I don't argue with you in here. Good luck for you then.", "score": 3, "replies": [{"body": "The get to right off as much as the coin drops based on current value at the time. So potentially for them up to 1.5 billion", "score": 1, "replies": []}]}, {"body": "Americans have to declare Bitcoin gains as capital gains and get taxed on it, there is no shelter", "score": 1, "replies": [{"body": "Just like stocks you don’t get taxed till until you sell. But while holding it they get to right off whatever the coin deprecates.\n\nhttps://www.google.com/amp/s/www.newswise.com/articles/how-tesla-s-bitcoin-play-fits-into-cryptocurrency-taxation", "score": 1, "replies": [{"body": "Non-AMP Link: [https://www.newswise.com/articles/how-tesla-s-bitcoin-play-fits-into-cryptocurrency-taxation](https://www.newswise.com/articles/how-tesla-s-bitcoin-play-fits-into-cryptocurrency-taxation)\n\nI'm a bot. [Why?](https://np.reddit.com/user/NoGoogleAMPBot/comments/lbz2sg/faq/) | [Code](https://github.com/laurinneff/no-google-amp-bot) | [Report issues](https://github.com/laurinneff/no-google-amp-bot/issues)", "score": 1, "replies": []}]}]}]}, {"body": "His average buy in is lower than $40k per coin.  He is still in profits by much more than $15B", "score": 1, "replies": [{"body": "If the price goes below then 40 then would be another story", "score": 1, "replies": []}]}]}
{"title": "Tesla is the cause of this", "selftext": "Ultimately, there were so many people, firms, ETF's in Tesla that it was bound to cause a panic if it dropped. And the catalyst to said drop was not B-T-C, and more likely firms pulling out from their dried out gains and reinvesting into more promising investments. Tesla hit its top for now, until they start making more money, and everyone knows it. Even I have been reducing my stake in Tesla the last month or so. It was/is a social stock well before Reddit made it to the news.\n\nThat said, the money pulled out has to go somewhere. The treasury yield is not the cause, it's still way below your average market meaning people want their money in the market. I would expect many of these Tesla competitors to get a boost in the next few days as people begin to convert their newly found cash from the Tesla selloff into something that can grow.", "id": "lqozyw", "created_utc": 1614104108.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 11, "comments": [{"body": "That man needs to stay off Twitter.", "score": 9, "replies": [{"body": "Ugh yes, he shot himself in the foot and took my money in the process.", "score": 7, "replies": [{"body": "He's finding himself near Trump territory. \n\nI am happy that i got shit on discount, but I'm upset that I'm watching this.", "score": 3, "replies": [{"body": "Was holding since late May and holding tight but I knew it was only a matter of time.  It stopped making any sense at all around September.  Guy could tweet anything and his stock would go up 3%.", "score": 2, "replies": [{"body": "Well I wish you a bountiful Wednesday and a full portfolio recovery.", "score": 2, "replies": [{"body": "Same to you!", "score": 0, "replies": []}]}]}]}]}]}, {"body": "TSLA set for intraday bounce tomorrow", "score": 3, "replies": []}, {"body": "Tesla has had a bunch of 10% plus corrections on the way up. It's just getting hurt by the decision to: not sell the baseline Y, The price drop (3 and Y models), the Lucid IPO via SPAC, and today's huge drop in bitcoin. Tesla's bad news usually piles on all at the same time. I would give it a couple of days to find footing before a sideways stability pattern before the next move higher. However, this stock is so erratic between long sideways moves. So hard to trade options on it.", "score": 2, "replies": [{"body": "Good time for some 2-week calls on everything else though lol.", "score": 1, "replies": []}]}, {"body": "His Twitter probably didn't have as much to do with price as those Ugly reports on the Dependability of their cars...and knocking production of a certain car lowering prices etc. Shit hits them al at once it seems plus tons have been Red this week.", "score": 2, "replies": []}, {"body": "Dogecoin!!!", "score": 0, "replies": []}]}
{"title": "If AAPL is really a buy, then why are big players trimming?", "selftext": "", "id": "lqq3eo", "created_utc": 1614106837.0, "score": 9, "upvote_ratio": 0.77, "num_comments": 18, "comments": [{"body": "They must be selling to buy gme to cover their shorts stocks only go up", "score": 8, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "What did you expect someone to say they are mostly just taking some profit and rebalancing their portfolios after the last split and the rise it brought their funds were unbalanced.", "score": 1, "replies": []}, {"body": "What app are you using to get this info", "score": 1, "replies": []}]}]}, {"body": "It’s called portfolio management.", "score": 8, "replies": []}, {"body": "Apple is one of the best run companies out there but its seen its valuation increase significantly primarily through multiple expansion, not earnings growth. Now it’s trading at a fairly high PE. I think it’s not unreasonable for people to be taking profits and looking for better opportunities.", "score": 4, "replies": []}, {"body": "I think they are just cashing in the profit they made until now on AAPL to reinvest somewhere  to earn even more. Also, some probably noted that Buffett is leaving so they decided to do it too just because he's Warren Buffet.", "score": 11, "replies": [{"body": "He trimmed his position but didn’t exit AAPL outright.", "score": 3, "replies": [{"body": "Which, in my opinion, is pretty bullish. Warren will sell all of it as soon as he loses any faith. He also must have somewhere else to deploy the capital that looks better, because he’s already sitting on PLENTY of cash and negative yielding treasuries", "score": 1, "replies": [{"body": "Exactly!  I didn't expect anyone here to understand modern portfolio theory.\n\nThe fact is that AAPL went up so much last year that it surpassed the percentage of his entire portfolio Warren wants to devoted to one company.  So he sold some shares to get back to ideal allocation and identify other potential companies he can buy with the proceed.\n\nWhen I started buying AAPL, it was 10% of a portfolio by valuation.  (This was right after Steve Jobs died and it was $500 a share.  It has split and one share then is now 28 shares.)  Today it's 45% of that portfolio and I wish I took cues from Warren and sell some and diversify.\n\nP.S.  Please don't assume that you know what Warren is doing as a retail investor.", "score": 2, "replies": []}]}]}, {"body": "That’s what I did bought in at $60 per share and sold at $130", "score": 0, "replies": []}]}, {"body": "What is this site? I was looking for somewhere to look for inside trader activity", "score": 3, "replies": []}, {"body": "Don't forget about the split over the summer, everyone who held before now has way more shares and has seen decent growth since then.", "score": 2, "replies": []}, {"body": "\"If AAPL is really a buy\"\n\nWait, wait, slow down, why would that be the default opinion to be questioned?\n\nEverything I've been reading has been saying there is a bubble in tech growth stocks. Is that supposed to mean \"buy?\"", "score": 2, "replies": []}, {"body": "10yr yield is increasing allowing for investment in treasuries again, simply seems like a slight risk off play to me, trimming some profits from securities and most likely adding to bond positions now that they’re giving a more adequate return.", "score": 1, "replies": []}, {"body": "Depends who you ask. Apes will tell you they're covering for the short lmao", "score": 1, "replies": []}, {"body": "Just a guess here...but it is a rebalance after a strong run.", "score": 1, "replies": []}, {"body": "Funds will often do what is referred to as \"Portfolio Management\".\n\nImagine a fund has 10 stocks in it, each allocated as 10% of the entire portfolio (AAPL being one).\n\nAfter some time, what happens if AAPL stock price increases by 10% and all the other stocks decrease by 10%?\n\nThe net effect is that AAPL would now constitute a much higher percentage of your portfolio than you are comfortable with, thus you sell the \"excess\" AAPL.\n\nIf you truly did not think AAPL was a buy at all, you would likely sell your entire position.", "score": 1, "replies": []}]}
{"title": "Here is a Market Recap for today Tuesday, February 23, 2021", "selftext": "**PsychoMarket Recap - Tuesday, February 23, 2021**\n\nThe market was extremely volatile today. After opening deep in the red, the S&P 500 (SPY) and Dow Jones (DIA) was able to reverse to close marginally positive. The sell-off in technology stocks continued, with the Nasdaq (QQQ) once again underperforming. The recent pressure on the market comes after a spike in the 10-year Treasury yield that has market participants concerned that inflation will begin to rise. \n\nFederal Reserve Chair Jerome Powell delivered his semiannual monetary policy testimony, offering another update on his view for the path forward for monetary policy during and after the pandemic. In his remarks, Powell reaffirmed that the Federal Reserve was looking to maintain its current accommodative policy posturing for the time being, keeping benchmark rates near zero and asset purchases at the current pace of $120 billion per month. He said, \"The economy is a long way from our employment and inflation goals, and it is likely to take some time for substantial further progress to be achieved. We will continue to clearly communicate our assessment of progress toward our goals well in advance of any change in the pace of purchases.\" \n\nIn Washington, The U.S. House of Representatives Budget Committee voted to advance President Joe Biden's $1.9 trillion virus relief proposal on Monday, bringing it a step closer to passage ahead of a mid-March cliff, after which federal unemployment benefits are set to expire. \n\nIn the last week or two, market participants have been eyeing a sharp spike in Treasury yields, raising concerns of a surge in borrowing costs and inflationary pressures in the post-pandemic economy. The benchmark 10-year yield hovered around 1.36% for its highest level in a year, after wallowing below 1% for most of 2020. That said, the Treasury yield remains at historically low levels. While we expect the spike in the yield to put pressure on the market, our long-term bull thesis remains intact.\n\n**Highlights**\n\n* The U.S. Postal Service said Tuesday it would award a multi-billion-dollar, 10-year contract to Oshkosh Defense to manufacture a new generation of postal delivery vehicles. Shares of Workhorse (WKHS), another company that was vying for that contract, plummeted more than 40% after the deal was announced.\n* Shares of Snapchat (SNAP) reached all-time highs after the company provided an optimistic outlook on ad revenue and customer growth.\n* Apple (AAPL) is planning to increase dividend according to Chief Executive Tim Cook, CNBC reported on Tuesday, citing the shareholder meeting.\n* Facebook said late Monday it will restore news content to its platform in Australia. The company had suspended news sharing last week amid a dispute over a proposed Australian law requiring tech platforms to pay publishers.\n* French antitrust investigators have accused Alphabet Inc's Google of failing to comply with the state competition authority's orders on how to conduct negotiations with news publishers over copyright, two sources who read the investigators' report said.\n* After reaching an all-time high of more than $58,000, the value of Bitcoin (BTC) has plummeted in the few days\n* **Please note many of the current stock prices were written in the morning and probably changed due to intraday movement.**\n* Baidu (BIDU) target raised by KeyCorp from $290 to $390 at Overweight. Stock currently around $322\n* MongoDB (MDB) target raised by Citigroup from $465 to $500 at Buy. Stock currently around $380\n* Palo Alto Networks (PANW) with a host of target raises. Consensus price target of $450 at Buy. Stock currently around $377\n* SEA (SE) target raised by Cowen from $225 to $350 at Outperform. Stock currently around $250\n* Spotify (SPOT) target raised by Rosenblatt Securities from $390 to $425 at Buy. \n\n“The only thing we have to fear is fear itself.” - Franklin D. Roosevelt", "id": "lqtg3v", "created_utc": 1614115393.0, "score": 40, "upvote_ratio": 0.93, "num_comments": 15, "comments": [{"body": "Thank you for posting.  SQ posted earnings AH and taking a big hit coupled with BTC weakness.  I know this is a Psycho fav :)  I missed dip this morning", "score": 4, "replies": [{"body": "Yea SQ definitely a company we really like. Oh well, hindsight is 20/20, you'll catch the next one!", "score": 1, "replies": [{"body": "Haha yes I'm learning this as well, what goes up will come down and what comes down goes back up. Also sideways for additional fun!", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Great TLDR, thanks!", "score": 2, "replies": []}]}, {"body": "Much appreciated, Sir", "score": 1, "replies": [{"body": "Of course, thanks for reading!", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}, {"body": "Thanks for the heads up!", "score": 1, "replies": []}, {"body": "Thanks", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}, {"body": "Excellent analysis", "score": 1, "replies": [{"body": "Apprecaite that!", "score": 1, "replies": []}]}]}
{"title": "Don't forget how bad things can really get", "selftext": "&#x200B;\n\n[Today's red may look harsh. Not every day will be a winner. Don't forget what a real correction, fraud, or realized market value of a security can look like. This is AIG, which looked like a golden company for years. Then 2008 happened.](https://preview.redd.it/0vqxcyp3raj61.png?width=860&format=png&auto=webp&s=b6985d38441c9d48cd8bfbb54b3200658c6ab353)\n\nIt is important to have confidence in the companies you invest in because of their fundamentals, not because of market psychology. That way, in a downturn, you can hold fast knowing that they will come back. Not everything comes back. Especially fraud.\n\nThe S&P 500 is your best shot at consistent annual returns if you do not know how to value a company. Please, be safe with your money. You probably worked hard to earn it. If you wouldn't walk into a casino and bet it all on red, why would you bet it all on a company whose EPS and future outlook are in the red.", "id": "lqtyhu", "created_utc": 1614116741.0, "score": 22, "upvote_ratio": 0.81, "num_comments": 11, "comments": [{"body": "The company I actually did dd on and checked fundamentals on has been going up since I bought it, which is Sonos. You can use the market psychology to find prospects, but at the end of the day you gotta do the dd and make your own decision.\n\n\nEdit: also very well said", "score": 11, "replies": [{"body": "What is dd?", "score": 0, "replies": [{"body": "Due diligence", "score": 2, "replies": []}]}]}, {"body": "People will never even try to understand your point, because they won't  like it. People will learn it the hardway by living through it like always. \n\nBear markets won't happen when majority of the individuals are prepared for it. \n\nps: expecting a bear market and preparing for a bear market are really different things.", "score": 3, "replies": [{"body": "True, but it isn't actually required to lose money to learn it.\n\nIn 2001 I thought Ballard Power was the future of automobiles and renewable energy. (They weren't)\n\nBut I do know somebody who bought it in \\`99, and held when it went down. And finally got out ahead this year!\n\nOTOH, it is hard not to expect that the stimulus payments will cause another peak. But I guess that depends how leveraged these apes really are! Personally, I prefer bear markets, I can never figure out growth stocks. Sideways trading is easier. Buy low, sell high. Bull market is all like, buy high, sell higher, buy higher, sell higher, but higher, get eaten by a bear.", "score": 2, "replies": []}]}, {"body": "I remember 2008, the talking heads on the TV were saying \"sell, sell, sell\" and I was shouting \"BUY BUY BUY\" and my friends were all like, \"You think you know more than the experts?\" And I was like, \"THESE MORONS ARE NOT THE EXPERTS!\"\n\nBut look, reddit doesn't even remember March.", "score": 3, "replies": []}, {"body": "Nicely said", "score": 2, "replies": []}, {"body": "The problem lies with people who would put it on red. ALWAYS put it on black!!!", "score": 0, "replies": [{"body": "I was once called an idiot for trying to keep my business in the black.\n\nI laughed so hard, he called me manic.\n\nA couple years later, he didn't have his old business, but he had a new one... janitorial services sub-contractor!", "score": 2, "replies": [{"body": "But today, you can't even say you want to keep your business in the black or you're racist.", "score": 0, "replies": [{"body": "🤭", "score": 1, "replies": []}]}]}]}]}
{"title": "I'd like to diversify during this red month we are going through. What are soem safe choices?", "selftext": "I'm getting hammered on some stocks. I have a large chunk in Scottish mortgage (been trying to average down by buying the dip... But it keeps dipping lolol). Took a small loss on TSLA (see you soon tho)\n\nHolding bags on some yolo penny plays.\n\nAnyway, I have about 10k i want to put it but in different sectors. I've noticed my BP/shell stocks are up whereas green and tech are down. Are there other areas / market leaders that you would perhaps recommend? I heard Disney is also doing well", "id": "lq4z3m", "created_utc": 1614041605.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 16, "comments": [{"body": "When I diversified my portfolio got hurt the worst. Lmao", "score": 9, "replies": []}, {"body": "Keep the cash in a savings account for now or a CD", "score": 6, "replies": [{"body": "We are likely going to move into one of the biggest bull runs, why? If the Dems currently holding all three branches start spending, who knows how high some of this stuff will go.", "score": 2, "replies": [{"body": "I was listening to the Meb Faber show and he said long term things are looking like 2-3% yields over the next ten years after this bull run, but in general everyone is saying inflation will go up after all this stimulus and stocks are way overvalued already. I’m also not an economist, so idk what to think, I just want something safe🤷🏻‍♂️", "score": 0, "replies": []}]}]}, {"body": "Cannabis stocks. It just for legalized in NJ. Look for Acreage Holdings. Former Speaker of the House John Boener is a board member....better believe he still has plenty of friends left in government. That's only 1 out of many available", "score": 5, "replies": []}, {"body": "Hold the cash", "score": 3, "replies": []}, {"body": "As someone diversified with 40 companies/etfs, itll only help so much", "score": 1, "replies": [{"body": "How do you keep track of all of them?", "score": 2, "replies": [{"body": "I dont. 75% of them theyre buy and hold.\n\n5-10 of them i see as short term buy and sell.\n\nI like to diversify my etfs and dividends of my portfolio.", "score": 3, "replies": []}]}]}, {"body": "SPX is up 162 in February, Nasdag up 463, RUT is up 178\n\nWhat \"red month\" are you talking about?", "score": 0, "replies": []}, {"body": "MOS.\n\nMosaic Company is a US based phosphate mining company. Been doing well since November 2020 when conflict erupted in the Western Sahara, a major non US source of phosphate, the supply was restricted and Mosaic have been doing well ever since.", "score": 1, "replies": []}, {"body": "Buy the dip!  Apple?  Going up.  ENPH?  Going up!  Several stocks took a hit today, had $ to buy dips in my portfolio that I know are solid.  Buy the dip if you believe in a stock.  I’m a long term investor, has paid off, if you have faith buy the dip.", "score": 1, "replies": []}, {"body": "You could grab some dividend paying value stocks. They are doing well though this.", "score": 1, "replies": []}, {"body": "Copper ETFs. Most commodities are going up, but copper prices are going more up because of massively increasing demand with EV and all that plus the supply is pretty low. Big margins for copper companies. $FCX", "score": 1, "replies": []}]}
{"title": "There could be a feedback loop between crypto market and the stock market", "selftext": "[deleted]", "id": "lqabal", "created_utc": 1614058130.0, "score": 88, "upvote_ratio": 0.93, "num_comments": 18, "comments": [{"body": "I saw some headline this morning about the TSLA-ARK-BTC connections, and it seemed to imply we may have a situation like what you describe.  I didn't have time to read it, but I think there is some validity to the idea.", "score": 13, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Nah bruh, the institutions that bought in at low prices are taking profits. As for the retail, you don't just get up and walk out of a cult.", "score": 3, "replies": []}]}]}, {"body": "It’s a good take to be honest. Well done", "score": 20, "replies": []}, {"body": "it didn't do the same when crypto dropped a month ago. Tesla didn't have btc back then though.", "score": 2, "replies": [{"body": "That is OP's point. Now that TSLA is materially bought into btc the two are linked and we may observe this trend in the future", "score": 2, "replies": [{"body": "we didn't see tesla move up with bitcoin, yet it went down with bitcoin. I'd say it's moreso that crypto follows stock market dumps, which was the case in March 2020 too. The upward movement of crypto is independent of the upward movement of stocks imo.", "score": 2, "replies": []}]}]}]}
{"title": "Green energy continues down in Europe today, including a 10% drop in Tesla's German stocks", "selftext": "[deleted]", "id": "lqh5v8", "created_utc": 1614082867.0, "score": 21, "upvote_ratio": 0.92, "num_comments": 11, "comments": [{"body": "As long as bond yields continue to increase - these speculative stocks will continue to go down. Hopefully there isn’t an increase in interest rates so these stocks continue to tank.", "score": 14, "replies": [{"body": "I'm glad tesla's falling but my sunrun, enph canadian solar are as well and it hurts", "score": 5, "replies": []}]}, {"body": "Tesla $250", "score": 12, "replies": [{"body": "Short it then...", "score": 2, "replies": [{"body": "I am, since last week", "score": 6, "replies": []}]}]}, {"body": "With all the good news and optimism Nel Asa should bounce back faster than the rest. Fingers crossed.", "score": 3, "replies": []}, {"body": "Lovely", "score": 2, "replies": []}, {"body": "Green energy is a guarantee hold. Don’t sell if you believe in the output and necessity over the next decade. \n\nAs long as democrats control the Senate and White House, I won’t reevaluate my positions. When they lose it I probably will take some gains but will hold due to the fact that we will see separation between winners and losers in this industry. \n\nDisc: I don’t want to discuss politics. Half of the US government denied climate change for 30 years and Texas is literally frozen.", "score": 1, "replies": []}]}
{"title": "(2/23) Tuesday's Pre-Market Stock Movers & News", "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to Tuesday! Here are your pre-market stock movers & news on this Tuesday, February 23, 2021-\n\n*****\n\n# [5 things to know before the stock market opens Tuesday](https://www.cnbc.com/2021/02/23/5-things-to-know-before-the-stock-market-opens-feb-23-2021.html)\n\n*****\n\n> # 1. Nasdaq set to sink again as Big Tech slide continues\n\n> * U.S. stock futures were mostly lower Tuesday, pointing to a 1.4% decline in the Nasdaq, one day after the index sank nearly 2.5% in its worst single-day drop in almost a month. Tech stocks continued to slide in Tuesday’s premarket, with Apple down another 2% after closing lower by nearly 3% Monday.\n\n> * Dow stock Home Depot dropped 2% in premarket trading on worries that Covid pandemic sales gains won’t last. A stock drop of that magnitude would put a major dent in modest year-to-date gains.\n\n> * The S&P 500 on Monday fell almost 0.8%, in a fifth straight decline, its worst losing streak in nearly a year. The Dow Jones Industrial Averaged bucked Monday’s downdraft, closing slightly higher. It’s doing so again Tuesday morning. All three stock benchmarks remained stronger for the month.\n\n*****\n\n> # 2. Bond yields have been rising ahead of Powell’s testimony this week\n\n> * As part of mandated semiannual economic testimony, Federal Reserve Chairman Jerome Powell goes to Capitol Hill twice this week, appearing Tuesday before the Senate Finance Committee and Wednesday before the House Financial Services Committee. Rising bond yields and accompanying inflation fears are adding a higher level of interest around Powell’s remarks. The 10-year Treasury yield, which moves inversely to price, was slightly lower Tuesday morning,. But it’s been rising lately and trading around 1.36%. It was as high as 1.39% on Monday, the highest level in about a year.\n\n*****\n\n> # 3. B/itcoin sinks below $50,000; Tesla shares drop again\n\n> * B/itcoin plunged 12% Tuesday morning, sinking below $50,000. The world’s largest digital currency, still up 60% this year, hit an all-time high over $58,000 on Sunday. Price swings of more than 10% are not a rarity in c/rypto markets. B/itcoin once climbed to almost $20,000 in 2017 before shedding 80% the following year. Treasury Secretary Janet Yellen on Monday warned about those wild swings.\n\n> * Shares of Tesla, which earlier this month revealed an investment in b/itcoin, fell another 6% in Tuesday’s premarket. The stock sank more than 8.5% on Monday, in its biggest drop since late September 2020. To be sure, other tech stocks also suffered heavy losses Monday. Ahead of trading Tuesday, shares of Elon Musk’s electric auto maker was up just 1.25% this year. However, over the past 12 months, Tesla was up nearly 300%.\n\n*****\n\n> # 4. Home Depot, Macy’s report better than expected quarterly results\n\n> * Home Depot’s fourth-quarter earnings and revenue surged past expectations Tuesday, as consumers continued to invest in their homes due to the pandemic and strength of the real estate market. However, shares dropped on comments from Home Depot’s CFO, questioning how long the pandemic would last and how that may influence consumer spending.\n\n> * Shares of Macy’s rose more than 3.5% in the premarket after the retailer Tuesday morning reported its first quarterly profit in a year. Revenue in the fourth quarter also beat estimates as the company’s efforts to cut inventories during the holiday quarter and rely less on deep discounting paid off. Ahead of Tuesday’s trading, Macy’s shares were up 35% this year, though they struggled over the past 12 months.\n\n*****\n\n> # 5. Electric automaker led by ex-Tesla engineer to go public\n\n> * Electric vehicle maker Lucid Motors plans to go public at an $11.75 billion combined equity valuation through a reverse merger with a blank-check company. The deal between California-based Lucid and C/hurchill C/apital Corp IV is the largest in a series of such tie-ups involving EV companies and special purpose acquisition companies, better known as S/PACs. Shares of C/CIV fell more than 30% in the premarket. But speculation about the deal pushed the S/PAC stock up 470% this year alone. Lucid is led by ex-Tesla engineering executive and automotive veteran Peter Rawlinson.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/nh32H4C.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&P SECTORS CHART!](https://i.imgur.com/wWFBkUD.png)**)\n\n*****\n\n#TODAY'S S&P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/GqC0Wpr.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/TIhMYEf.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/rKXZEUq.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/uT5kxuP.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/X3QHyB3.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/Xj9NIWe.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #1!](https://i.imgur.com/ceMrg4D.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #2!](https://i.imgur.com/JwEoQ16.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/roUylhe.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/ttppoOf.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/LwYb3Ms.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/gs9zcaT.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/aBr8P6f.png)**)\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/02/23/stocks-making-the-biggest-moves-premarket-home-depot-palo-alto-networks-shopify-amc.html)**)\n\n*****\n\n> **Home Depot (HD)** – The home improvement retailer beat quarterly estimates by 3 cents with earnings of $2.65 per share. Revenue came in above estimates as well. Comparable store sales jumped 24.5% during the fourth quarter, more than the 19.2% consensus estimate of analysts polled by FactSet. Home Depot is not providing 2021 guidance, however, due to pandemic-related uncertaint. Shares fell 2.7% premarket.\n\n> #**STOCK SYMBOL:** HD\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HD&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HD)**)\n\n*****\n\n> **Macy’s (M)** – The retailer reported an adjusted quarterly profit of 80 cents per share, well above the 12 cent consensus estimate, with revenue also coming in above Wall Street forecasts. Comparable store sales fell 17.1% on an owned + licensed basis, smaller than the 21.3% drop anticipated by analysts surveyed by Refinitiv. Macy’s stock rose 2.2% in premarket action.\n\n> #**STOCK SYMBOL:** M\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=M&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/M)**)\n\n*****\n\n> **Tesla (TSLA)** — Tesla shares fell more than 5% in premarket trading on Tuesday, after suffering their biggest single-day loss in months on Monday. Wedbush analyst Dan Ives warns Tesla’s share price is now directly linked to the price of b/itcoin after the electric vehicle maker’s investment in the c/ryptocurrency.\n\n> #**STOCK SYMBOL:** TSLA\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n> **Palo Alto Networks (PANW)** – Palo Alto Networks reported adjusted quarterly earnings of $1.55 per share, 12 cents above estimates, with the cybersecurity company’s revenue also beating forecasts. Palo Alto issued a mostly weaker-than-expected current quarter earnings outlook, but did note the opportunities provided by the massive SolarWinds hack. Shares were down 3.7% premarket.\n\n> #**STOCK SYMBOL:** PANW\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PANW&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PANW)**)\n\n*****\n\n> **InterContinental Hotels Group (IHG)** – IHG reported a $153 million operating loss for 2020, hurt by the Covid-19 pandemic and resulting lockdowns. However, the company said its Holiday Inn Express brand outperformed in key markets and that global travel is beginning to recover. Shares rose 1.2% premarket.\n\n> #**STOCK SYMBOL:** IHG\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=IHG&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/IHG)**)\n\n*****\n\n> **Johnson & Johnson (JNJ)** – J&J is setting aside $3.9 billion in connection with talc-related litigation, according to an SEC filing. In November, the company said it would set aside $2.1 billion for talc cases, as it faces thousands of lawsuits claiming its talc products caused cancer.\n\n> #**STOCK SYMBOL:** JNJ\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=JNJ&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/JNJ)**)\n\n*****\n\n> **Occidental Petroleum (OXY)** – Occidental lost an adjusted 78 cents per share for its latest quarter, wider than the 59-cent loss that analysts were anticipating. Revenue missed forecasts as well. The miss came despite a rebound in oil and gas prices. Shares fell 2.2% premarket.\n\n> #**STOCK SYMBOL:** OXY\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=OXY&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/OXY)**)\n\n*****\n\n> **Shopify (SHOP)** – Shopify priced a 1.18 million share offering at $1,315 per share, with the e-commerce platform provider expecting to raise about $1.55 billion from the sale. Shopify plans to use the proceeds to strengthen its balance sheet. Shares fell 5.5% in premarket action.\n\n> #**STOCK SYMBOL:** SHOP\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SHOP&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SHOP)**)\n\n*****\n\n> **Carnival (CCL)** – The cruise line operator’s shares fell 3.4% premarket after it priced an offering of about 40.45 million common shares at $25.10 per share, with the cruise line operator seeking to raise about $1 billion to be used for general corporate purposes. The cruise industry has been shut down during the pandemic.\n\n> #**STOCK SYMBOL:** CCL\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CCL&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CCL)**)\n\n*****\n\n> **The RealReal (REAL)** – The RealReal lost an adjusted 49 cents per share for its latest quarter and posted revenue that also fell short of analyst forecasts. The secondhand luxury goods seller’s said 2020 was a challenging year, with the pandemic “temporarily disrupting” its path to profitability. The stock dropped 10.8% premarket.\n\n> #**STOCK SYMBOL:** REAL\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=REAL&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/REAL)**)\n\n*****\n\n> **ZoomInfo (ZI)** – ZoomInfo rose 8.1% premarket after it beat estimates by 2 cents with adjusted quarterly earnings of 12 cents per share. The marketing database provider’s revenue beat forecasts as well.  ZoomInfo also provided an upbeat outlook for the current quarter and full year.\n\n> #**STOCK SYMBOL:** ZI\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ZI&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ZI)**)\n\n*****\n\n> **AMC Entertainment (AMC)** – The movie theater operator’s shares jumped 3.4% premarket following news that New York City movie theaters will reopen with limited capacity on March 5.\n\n> #**STOCK SYMBOL:** AMC\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AMC&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AMC)**)\n\n*****\n\n> **Wells Fargo (WFC)** – The bank announced a deal to sell its Wells Fargo Asset Management unit to private equity firms GTCR and Reverence Capital for $2.1 billion. Wells Fargo will retain a 9.9% stake in the business.\n\n> #**STOCK SYMBOL:** WFC\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WFC&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WFC)**)\n\n*****\n\n> **Dollar General (DG)** – Dollar General is taking steps to find a potential successor to CEO Todd Vasos, according to people familiar with the matter who spoke to Reuters. The sources say Vasos had not communicated any intention to leave the discount retailer when his contract expires in June, calling the process “good governance.”\n\n> #**STOCK SYMBOL:** DG\n\n> * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DG&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n> ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DG)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, February 23rd, 2021! :)**", "id": "lqj2x1", "created_utc": 1614088923.0, "score": 18, "upvote_ratio": 0.83, "num_comments": 14, "comments": [{"body": "I really got in on tech at the worst possible time. Fuck my life", "score": 29, "replies": [{"body": "Don’t worry man I’m right here with you I bought Apple at 140 :(", "score": 12, "replies": []}, {"body": "Buy low, never sell", "score": 7, "replies": [{"body": "Buy high, never sell 🤭", "score": 6, "replies": []}]}, {"body": "I started a week or so before the September 2020 sell off / correction.\n\nHang tight, it’ll get better!", "score": 6, "replies": []}, {"body": "So much red. Tech is killing me this week", "score": 4, "replies": []}, {"body": "Hey don't worry about it. Tech is generally a long play. Just think of this as a Blue Light Special for your positions", "score": 3, "replies": []}, {"body": "same ha, literally just re-allocated 30% of my 401k last week into tech", "score": 1, "replies": []}]}, {"body": "Ayy the company I work for is being mentioned", "score": 3, "replies": []}, {"body": "Doing the lords work, thank you so much\n\nYou got a email list or anything?\n\nAlso did you watch what Powell said? Curious about it but wasn’t up in time to watch", "score": 2, "replies": []}, {"body": "I'll gladly take some HD if it continues to dip a bit more.", "score": 1, "replies": []}, {"body": "Your name checks out. Your market has arrived.", "score": 1, "replies": []}, {"body": "May I ask where is the graph from? Is this from a site?", "score": 1, "replies": []}]}
{"title": "Does anybody just trade on events?", "selftext": "Meaning you read the headlines and try to see if anything is an over or under reaction.\n\nEx: Capitalizing on the BABA crash after the anti-trust investigation and rumors of Chinese stocks getting delisted back in December. It was an absolutely ridiculous overreaction imo (did anybody really think China would regulate a monopoly? and did anybody think we'd actually delist them?). It rebounded 25% in a month. Buying shares or medium-term calls during that whole fiasco would've netted a nice return", "id": "lqnnxc", "created_utc": 1614100763.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "Absolutely, look for a catalyst, buy in before everyone else does and sell before everyone else does. It’s called Swing Trading for the most part", "score": 9, "replies": []}, {"body": "Buy the hype, sell the news. Tale as old as time...", "score": 4, "replies": []}, {"body": "I took entire courses on behavioral finance in uni. Reactionary trading is definitely something to factor in, especially if you're a day trader", "score": 3, "replies": []}, {"body": "The problem is odds are pros and bots are going to do it better than you. Its better to invest for the long term imo.", "score": 3, "replies": []}, {"body": "Sometimes it works, and sometimes it doesn't.  Two recent experiences I had. \n\nBloomberg published a report saying the Chinese had compromised motherboards made by Supermicro, which are used in data centers of Amazon, Google, Apple, etc.  ZOMG!  The Chinese are spying on us at the hardware level.  Supermicro's stock was crushed.  50% drop.  From a technical point of view I thought this was bullshit.  I thought this would be a quick trade.  Supermicro quickly denied the report.  The big tech companies denied it.  U.S. intelligence community denied it.  People used as sources in Bloomberg's article denied it.  Bloomberg refused to man up and admit it was fake news.  I had to wait for two quarters of good earnings before the stock mostly recovered to get out with with an 80% return.\n\nSecond case did not work out.  After the second Boeing 737 Max crashed I jumped in as soon as I heard and saw the drop in the stock.  My thinking was the crashes were due to pilot error, and in a way they were.  The stock went down below the point where I bought then came back up to my purchase price,.  I got out.  I had a few reasons.  I had pulled the trigger too quickly; it really was a snap decision.  The stock had already risen considerably over the previous year or so; I was not that confident it would recover.  As a few more details emerged in the back of my mind was the cockroach theory; there is never just one cockroach.  I am glad I got out because it turned out there are a lot of cockroaches crawling around Boeing.\n\nAnyway, making snap decisions can make you a lot of money.  It can also get you burned.", "score": 2, "replies": []}, {"body": "SPACs are a gold mine of events.  Check out r/SPACs.", "score": 2, "replies": []}, {"body": ">did anybody think we'd actually delist them?\n\nI think it could happen. companies are constantly de-listed for a variety of reasons. \n\nhttps://listingcenter.nasdaq.com/NonCompliantCompanyList.aspx", "score": 1, "replies": [{"body": "Yeah companies most people have never heard of though. Not something like BABA", "score": 1, "replies": []}]}, {"body": "I’ve been wanting to do this. What would you suggest for news sources? Is there a source that reports mainly on corporations/ economic events?", "score": 1, "replies": []}, {"body": "yes although I do like to avoid headlines to start these plays - Id recommend to go top down with what knowledge you have and make a educated assessment of which part of the economy is currently not given its full recognition and buy into it - of course these plays arent always possible - they may come once in a year or once in a decade - but they do arrive", "score": 1, "replies": []}, {"body": "I do, and explore possibility of others.\n\nStarted looking at Boeing after they grounded the max, looking at them again after they had a couple engines come apart.\n\nBought into CCL at 12.35 in March of last year.  Then cruise lines had a couple ships  with dead bodies on them that nobody would let come into port.  Price plummeted, I bought more at 8.15, and added RCL..\n\nBought into VGAC on the news of the merger, too early...\n\nAlways looking.", "score": 1, "replies": []}]}
{"title": "Taking a closer look at ASE Tech $ASX (5 min read) - Is the stock undervalued? Let's find out!", "selftext": "## Intro\n\nThis is my short and condensed KISS (keep it stupid simple) review of ASE Technology Holding Co., Ltd ($ASX). The basics covers some of the fundamentals, with the figures benchmarked against ASE Technology’s largest indirect competitor - TSMC (Taiwan Semiconductor Manufacturing Company, Limited) - as indicated by ‘vs.’. Keep in mind that ASE is not a manufacturer of semiconductors. They specialize in assembly and testing, which happens in the final stages of production. TSMC specializes in the early stages of semiconductor production as a manufacturer. They are however both key players in the same industry. Why am I using TSMC as a benchmark instead of comparing against industry averages? Because you don’t benchmark against ‘average’, you benchmark against the top performers in the same industry. The points made inside the bearish and bullish arguments are my interpretations of the company and stock. The summary is my attempt of bringing everything together. I invite you to totally destroy my DD with your best arguments so we can further debug the analysis on this stock. Let’s go!\n\n## Basics\n\n**Company:**  \nASE Technology Holding Co., Ltd.\n\n**HQ:**  \nKaohsiung, Taiwan \\[1\\]\n\n**Industry:**  \nSemiconductor assembly, testing & packaging \\[1\\]\n\n**Company Description:**  \nProvider of independent semiconductor assembling and test manufacturing services. \\[1\\]\n\n**Exchange:**  \nNYSE\n\n**Ticker:**  \nASX vs. TSM\n\n**Price:**   \n$8.31 vs. $136.66 \\[2\\]\\[3\\] \n\n**Market Cap:**  \n17.3B vs. 604.9B \\[2\\]\\[3\\] \n\n**Avg Trading Volume:**  \n2M vs. 11.7M \\[2\\]\\[3\\] \n\n**Short % of Shares Outstanding:**  \n0.14% vs. 0.27% \\[4\\]\\[5\\]\n\n**Institutional Shares:**  \n0.03% vs. 89.29% \\[6\\]\\[7\\]\n\n**3 Month Price Returns:**  \n60.74% vs. 41.46% \\[8\\]\\[9\\]\n\n**PE Ratio:**  \n26.81 vs. 61.28 \\[2\\]\\[3\\] \n\n**P/B Ratio:**  \n2.26 vs. 10.69 \\[10\\]\\[11\\] \n\n**3 Year Net Income Growth:**  \n43.06% vs. 5.23% \\[12\\]\\[13\\]\n\n**Debt to Equity Ratio:**  \n1.26 vs. 0.00 \\[14\\]\\[15\\]\n\n**Industry Average Debt to Equity Ratio:**  \n0.03 \\[16\\]\n\n## Bearish Arguments\n\n* Europe wants to develop its own chip industry. Taiwan can expect competition if Europe pushes through \\[17\\].\n* ASE’s debt to equity ratio is much higher than the industry average and that of their competitor TSMC \\[14\\]\\[15\\]\\[16\\].\n* Both TSMC and ASE serve high-profile customer Apple. However, TSMC holds bigger contracts as they have a larger footprint in Apple’s supply chain \\[23\\].\n* There has been a 65.78% growth in shorts within a single month as reported in Jan 29 this year \\[18\\].\n* Not a lot of big money signals. Low institutional ownership of stock \\[6\\].\n* 4 yr growth in total liabilities grew 114% vs. 4 yr growth in total assets that grew 60.4% \\[12\\].\n\n## Bullish Arguments\n\n* ASE Technology has tailored its applications to increase their stake in growth markets such as smart cities, smart homes, smart cars/bikes, and smart factories (Industry 4.0) \\[24\\].\n* In late 2020, they established the first 5G mmWave smart factory \\[25\\].\n* Their plan for the future, as announced in the annual shareholders meeting late 2020, points towards an expansion into providing tailored solutions in markets such as medicine and transport, where AI, IoT, and AIoT will play a more significant role \\[21\\].\n* Their sustainability practices and principles have resulted in several awards, such as the double A listing for Global Climate and Water Stewardship \\[22\\].\n* ASE has experienced significant growth in revenue and net income. They’re now up by 43% compared to 3 years ago \\[12\\].\n* Very low PE and P/B (price to book value) ratio in comparison to industry leader TSMC \\[2\\]\\[3\\]\\[10\\]\\[11\\].\n* ASE also beats TSMC on short % of shares outstanding, 3 month price returns, and earnings growth - in significant ways \\[4\\]\\[5\\]\\[8\\]\\[9\\]\\[12\\]\\[13\\].\n* ASE provides semiconductor assembly and testing services for over 90 percent of electronics companies in the world \\[26\\].\n* In 2020, the Taiwanese economy has outpaced China for the first time in 30 years \\[19\\].\n* Analyst average recommendation rating is 1.5 (between Buy and Strong Buy) \\[20\\].\n\n## Summary\n\nASE Technology has a significant stake in the semiconductor manufacturing industry and although they face serious competition, they’ve adapted quite well and are moving towards a leadership role in industry innovation. It’s a growth company, in a growth market, in a growth country. Do they need insanely huge contracts from the likes of Apple? No, and their current growth confirms it as they provide their services to over 90% of electronics companies in the world. In fact, some argue that it’s dangerous to be heavily dependent on a single customer. That being said, their debt to equity ratio is high. Much higher than the industry average. Is this by definition a bad thing? Not necessarily. It might have even scared off some institutional investors, which is fine by me because it means less volatility. But perhaps it's less of a good sign for those who need big money signals.\n\nASE decided to take on quite some debt. It’s risky for sure but not at a point where there’s red flags. It's not unusual in the manufacturing/assembly industry but it definitely is an aggressive approach. It could be a calculated risk where the current projected revenue for this year will more than cover their debt if reached \\[20\\]. They will need to make optimal use of their cash flow, which has been steadily growing. Will they reach the projections? I’m of the opinion that they will based on their current growth patterns as well as the tech industry’s move towards more integrated solutions, which ASE is betting on. \n\nWhen the car industry experienced a massive chip shortage and companies like ASE were running at full capacity, it became clear to me that this shortage would function as a catalyst that will further prepare and propel Taiwanese semiconductor production to handle higher demand in the future. European leaders like Merkel and Macron are pushing for Europe to develop its own chip industry. But how likely is it that major consumers of chips will go through the trial and errors in Europe, at a high cost, rather than to deal with their trusted suppliers who are innovating as we speak? Perhaps I’m underestimating (or overestimating) matters but when I weigh the bullish and bearish arguments against each other, I can see no valid reason why ASE’s stock is currently so undervalued. I personally like the company's ethics, milestones, growth, and plans for the future. \n\n## Sources\n\n\\[1\\] [https://en.wikipedia.org/wiki/ASE\\_Group](https://en.wikipedia.org/wiki/ASE_Group)  \n\\[2\\] [https://finance.yahoo.com/quote/ASX?p=ASX](https://finance.yahoo.com/quote/ASX?p=ASX)  \n\\[3\\] [https://finance.yahoo.com/quote/TSM?p=TSM](https://finance.yahoo.com/quote/TSM?p=TSM)  \n\\[4\\] [https://finance.yahoo.com/quote/ASX/key-statistics?p=ASX](https://finance.yahoo.com/quote/ASX/key-statistics?p=ASX)  \n\\[5\\] [https://finance.yahoo.com/quote/TSM/key-statistics?p=TSM](https://finance.yahoo.com/quote/TSM/key-statistics?p=TSM)  \n\\[6\\] [https://fintel.io/so/us/asx](https://fintel.io/so/us/asx)  \n\\[7\\] [https://fintel.io/so/us/tsm](https://fintel.io/so/us/tsm)  \n\\[8\\] [https://ycharts.com/companies/ASX/three\\_month\\_return](https://ycharts.com/companies/ASX/three_month_return)  \n\\[9\\] [https://ycharts.com/companies/TSM/three\\_month\\_return](https://ycharts.com/companies/TSM/three_month_return)  \n\\[10\\] [https://ycharts.com/companies/ASX/price\\_to\\_book\\_value](https://ycharts.com/companies/ASX/price_to_book_value)  \n\\[11\\] [https://ycharts.com/companies/TSM/price\\_to\\_book\\_value](https://ycharts.com/companies/TSM/price_to_book_value)  \n\\[12\\] [https://finance.yahoo.com/quote/ASX/financials?p=ASX](https://finance.yahoo.com/quote/ASX/financials?p=ASX)  \n\\[13\\] [https://finance.yahoo.com/quote/TSM/financials?p=TSM](https://finance.yahoo.com/quote/TSM/financials?p=TSM)  \n\\[14\\] [https://ycharts.com/companies/ASX/debt\\_equity\\_ratio](https://ycharts.com/companies/ASX/debt_equity_ratio)  \n\\[15\\] [https://ycharts.com/companies/TSM/debt\\_equity\\_ratio](https://ycharts.com/companies/TSM/debt_equity_ratio)  \n\\[16\\] [https://csimarket.com/Industry/industry\\_Financial\\_Strength\\_Ratios.php?ind=1010](https://csimarket.com/Industry/industry_Financial_Strength_Ratios.php?ind=1010)  \n\\[17\\] [https://finance.yahoo.com/news/world-dangerously-dependent-taiwan-semiconductors-210620534.html](https://finance.yahoo.com/news/world-dangerously-dependent-taiwan-semiconductors-210620534.html)  \n\\[18\\] [https://www.marketbeat.com/stocks/NYSE/ASX/short-interest/](https://www.marketbeat.com/stocks/NYSE/ASX/short-interest/)  \n\\[19\\] [https://www.cnbc.com/2021/02/01/taiwan-economy-outgrows-china-first-time-in-decades-as-chips-demand-rises.htm](https://www.cnbc.com/2021/02/01/taiwan-economy-outgrows-china-first-time-in-decades-as-chips-demand-rises.html)[l](https://www.cnbc.com/2021/02/01/taiwan-economy-outgrows-china-first-time-in-decades-as-chips-demand-rises.html)  \n\\[20\\] [https://finance.yahoo.com/quote/ASX/analysis?p=ASX](https://finance.yahoo.com/quote/ASX/analysis?p=ASX)  \n\\[21\\] [https://ir.aseglobal.com/attachment/20200709174511891333675\\_en.pdf](https://ir.aseglobal.com/attachment/20200709174511891333675_en.pdf)  \n\\[22\\] [https://www.aseglobal.com/en/press\\_room\\_detail/2020\\_cdp\\_double\\_a](https://www.aseglobal.com/en/press_room_detail/2020_cdp_double_a)  \n\\[23\\] [https://www.gizmochina.com/2021/02/08/apple-tsmc-5nm-chips-2021/](https://www.gizmochina.com/2021/02/08/apple-tsmc-5nm-chips-2021/)  \n\\[24\\] [https://ase.aseglobal.com/en/solution/smart\\_city](https://ase.aseglobal.com/en/solution/smart_city)  \n\\[25\\] [https://ase.aseglobal.com/en/solution/smart\\_factory\\_5g](https://ase.aseglobal.com/en/solution/smart_factory_5g)  \n\\[26\\] [https://www.aseglobal.com/uploads/e501a7dc-5fab-49ab-9685-1aac1ae5c596/2018CSR-EN-compressed\\_(Security%20D).pdf](https://www.aseglobal.com/uploads/e501a7dc-5fab-49ab-9685-1aac1ae5c596/2018CSR-EN-compressed_(Security%20D).pdf)\n\n## Disclosure\n\nI do not yet own shares of this stock (waiting on a price correction) and I am not a financial advisor. Please buy and sell securities at your own risk and at your own discretion.", "id": "lqo9nw", "created_utc": 1614102275.0, "score": 434, "upvote_ratio": 1.0, "num_comments": 15, "comments": [{"body": "Great DD OP,\n\nWouldn't ASE be more compareable to AMKR?\n\nNonetheless, going to load up 👍", "score": 5, "replies": [{"body": ">AMKR\n\nThank you mate, I'm glad you like it. ASE and AMKR are definitely comparable. Both provide testing (QC) and where ASE focuses more on an assembly and application design, AMKR has their focus more on packaging and logistics. I felt that with TSMC being a Taiwanese company and the world's largest manufacturer of semiconductors and design, they're more 'linked' to ASE as they are both very close to each other in the supply chain of their shared customers. But ultimately both TSMC and AMKR are good benchmarks. Assembly is also where it's at imo. I see no reason why ASE can't reach TSMC's market cap in the foreseeable future, especially when you consider their current growth.", "score": 3, "replies": [{"body": "Op,\n\nI recently saw a decent DD on HIMAX (HIMX) - Taiwanese semiconductor that operates in the same field. What's your thoughts on it?", "score": 2, "replies": []}]}]}, {"body": "How is ASE comparing to KLIC?\nKLIC has half of the market cap mean more room to grow plus given Biden administration would likely to increase production of semiconductor in US for national security reason.\nI don't see how it is based on Taiwan is an advantage, I would argue that Chinese Gov is testing water with Hong Kong, in long term they would want to take back Taiwan. So any increasing in extension in short term would  a lot of risks and uncertainty.", "score": 3, "replies": [{"body": "I hear ya but I personally don't see why the potential of China taking back Taiwan is a disadvantage, economically speaking. Whether people like it or not, China is on track to becoming the world's largest economy. If they take back Taiwan, they're going to make damn sure that Taiwan's major manufacturers will take advantage of China's infrastructure, which in some ways is already happening. It'll further boost China's economy. I'm not saying I want Taiwan to lose their autonomy. In fact, I don't agree with many of China's politics, although I'm no fan of US politics either considering the last 2 decades. Politicians in Europe and US are vocal about wanting to further develop their own chip industry but the reality of the matter is that the largest buyers of chips cannot survive without Asia unless major incentives such as huge tax breaks and grants are provided to them, which is highly unlikely. Any risks or uncertainty to which you refer to is outweighed by the financial prospects.", "score": 1, "replies": []}]}, {"body": "How about UMC? What are your thoughts on that??", "score": 3, "replies": [{"body": "I haven't dug deep enough yet in UMC but I know they've had a bit of controversial stuff going on where they admitted to stealing trade secrets. It's a bit of a deal breaker for me.", "score": 1, "replies": []}]}, {"body": "Hey man, good DD.  I know I'm a bit late to the party but I was looking into ASE recently and came across your post.\n\nIt looks like ASE has some really good ratios, including a price:sales of about 1.  The big things that concern me are their quick ratio (less than 1), they arent building any equity like a lot of other major players, and their profit margin is 5.8% (compared to around 25% for other companies in the sector).\n\nAny idea why their margin is so much lower than other companies?  They project really solid sales growth but at 5% margin the value of the company could seriously lag behind other semiconductor companies.", "score": 2, "replies": [{"body": "They're in a growth market and positioning themselves as leaders. They're heavily invested (and leading) when it comes to highly innovative applications of fabless semiconductors for some really large clients. It takes money to make money when you're ahead of the curve. The quick ratio doesn't say anything about future prospects and is only useful to know if they're currently in some kind of problem, like being over leveraged - which they're not. Same goes for their profit margins. Keep in mind, Amazon wasn't profitable for a very long time and investors saw a huge ROI. It's typical of market leaders. That being said, I do think they need to divest in less profitable markets and operate on more lean principles. It would also be ideal if they find a better balance between debt and equity. Based on what I've seen, I believe they're on path to achieve both objectives. But the riskier the endeavor the more exposed you are to imbalances. We'll just have to wait and see what happens.", "score": 1, "replies": []}]}, {"body": "Been holding asx 800 shares at 8$ for over a year now 🤞", "score": 1, "replies": []}]}
{"title": "Not surprised by this recovery.", "selftext": "The bottom line is that even in a market crash/correction there are still winners to be had. Ive been loading up on apple nvidia nike and nio, to strengthen my core portfolio. Lets get these gains together. And remember if you are about to sell out of panic, take a deep breath and think. I made the mistake of closing out a position that ended up recovering when I could have taken only the cash i needed out and maintained a postion.\n\nCheers!", "id": "lqqols", "created_utc": 1614108297.0, "score": 18, "upvote_ratio": 0.87, "num_comments": 17, "comments": [{"body": "Wait, you guys are recovering?", "score": 37, "replies": [{"body": "From mental trauma", "score": 19, "replies": []}, {"body": "Yea. I was down 2500 at the worst of it this morning.\n\nEdit: now im down 400 for today. Diamond hands and concrete shoes. Just remember diamond hands is just until you profit.", "score": 11, "replies": [{"body": "Ah, must be nice. Ive got a minor recovery but most of that is because I bought a bunch of stuff at their lowest dip. Not near recovered yet though.", "score": 7, "replies": []}, {"body": "Lol at being down less than 5 figures", "score": -25, "replies": [{"body": "That's a seriously uncool take my dude. Drawdowns will always be relative to your whole portfolio. If someone's portfolio isn't even in  the 6-figs, how should they be down 5-figures?\nMy portfolio was down by high 5 figures today, but it was much more unnerving with even low 4 figure drops when I had a smaller portfolio.", "score": 12, "replies": []}, {"body": "Less than 5 figures is actually a lot of $ to most people. Not everyone is balling like crazy. Keep your ego out of it you weirdo.", "score": 6, "replies": []}, {"body": "Username isn’t checking out right now.", "score": 4, "replies": []}, {"body": "Hey everyone look at this guy! He loses BIG!", "score": 5, "replies": []}, {"body": "Actually that -2500 for the day put me at an all time loss of over 10k. Thanks for making me realize that 😂🤣", "score": 3, "replies": [{"body": "Dude these last 2 weeks have been beyond shit, lost 20% of my portfolio ever since Feb 8😂", "score": 1, "replies": [{"body": "Only if you sold. Otherwise this is opportunity. Go pan handle!", "score": 1, "replies": []}]}]}]}]}, {"body": "no", "score": 2, "replies": []}]}, {"body": "This drop is only effecting tech and clean energy other sectors of market are fine but an overall market drop look at Voo and Dia", "score": 3, "replies": []}, {"body": "Best time to get into apple.", "score": 2, "replies": []}, {"body": "Yep, during these types of down days, its hard to think clearly. But I followed Warren Buffet's advice, be fearful when others are greedy and greedy when others are fearful. Strong mindset, lets do this!", "score": 1, "replies": []}]}
{"title": "Here is a Market Recap for today Tuesday, February 23, 2021. What a crazy day!", "selftext": "**PsychoMarket Recap - Tuesday, February 23, 2021**\n\nThe market was extremely volatile today. After opening deep in the red, the S&P 500 (SPY) and Dow Jones (DIA) was able to reverse to close marginally positive. The sell-off in technology stocks continued, with the Nasdaq (QQQ) once again underperforming. The recent pressure on the market comes after a spike in the 10-year Treasury yield that has market participants concerned that inflation will begin to rise. \n\nFederal Reserve Chair Jerome Powell delivered his semiannual monetary policy testimony, offering another update on his view for the path forward for monetary policy during and after the pandemic. In his remarks, Powell reaffirmed that the Federal Reserve was looking to maintain its current accommodative policy posturing for the time being, keeping benchmark rates near zero and asset purchases at the current pace of $120 billion per month. He said, \"The economy is a long way from our employment and inflation goals, and it is likely to take some time for substantial further progress to be achieved. We will continue to clearly communicate our assessment of progress toward our goals well in advance of any change in the pace of purchases.\" \n\nIn Washington, The U.S. House of Representatives Budget Committee voted to advance President Joe Biden's $1.9 trillion virus relief proposal on Monday, bringing it a step closer to passage ahead of a mid-March cliff, after which federal unemployment benefits are set to expire. \n\nIn the last week or two, market participants have been eyeing a sharp spike in Treasury yields, raising concerns of a surge in borrowing costs and inflationary pressures in the post-pandemic economy. The benchmark 10-year yield hovered around 1.36% for its highest level in a year, after wallowing below 1% for most of 2020. That said, the Treasury yield remains at historically low levels. While we expect the spike in the yield to put pressure on the market, our long-term bull thesis remains intact.\n\n**Highlights**\n\n* The U.S. Postal Service said Tuesday it would award a multi-billion-dollar, 10-year contract to Oshkosh Defense to manufacture a new generation of postal delivery vehicles. Shares of Workhorse (WKHS), another company that was vying for that contract, plummeted more than 40% after the deal was announced.\n* Shares of Snapchat (SNAP) reached all-time highs after the company provided an optimistic outlook on ad revenue and customer growth.\n* Apple (AAPL) is planning to increase dividend according to Chief Executive Tim Cook, CNBC reported on Tuesday, citing the shareholder meeting.\n* Facebook said late Monday it will restore news content to its platform in Australia. The company had suspended news sharing last week amid a dispute over a proposed Australian law requiring tech platforms to pay publishers.\n* French antitrust investigators have accused Alphabet Inc's Google of failing to comply with the state competition authority's orders on how to conduct negotiations with news publishers over copyright, two sources who read the investigators' report said.\n* After reaching an all-time high of more than $58,000, the value of Bitcoin (BTC) has plummeted in the few days\n* **Please note many of the current stock prices were written in the morning and probably changed due to intraday movement.**\n* Baidu (BIDU) target raised by KeyCorp from $290 to $390 at Overweight. Stock currently around $322\n* MongoDB (MDB) target raised by Citigroup from $465 to $500 at Buy. Stock currently around $380\n* Palo Alto Networks (PANW) with a host of target raises. Consensus price target of $450 at Buy. Stock currently around $377\n* SEA (SE) target raised by Cowen from $225 to $350 at Outperform. Stock currently around $250\n* Spotify (SPOT) target raised by Rosenblatt Securities from $390 to $425 at Buy. \n\n“The only thing we have to fear is fear itself.” - Franklin D. Roosevelt", "id": "lqtfm2", "created_utc": 1614115357.0, "score": 62, "upvote_ratio": 0.96, "num_comments": 14, "comments": [{"body": "Ops, it seems that tech is the only victim at the end of the day", "score": 19, "replies": [{"body": "I can personally attest that this is not entirely true, although I have a keen eye for \"winners\".", "score": -6, "replies": []}]}, {"body": "I’m in Asia so most of the US market activity takes place when I’m fast asleep. Really appreciate this overview.", "score": 19, "replies": [{"body": "Glad to be of service!", "score": 2, "replies": []}]}, {"body": "I had a feeling the market would rally after the massive initial sell off this morning but things got pretty scary for about 10 minutes. Several of my positions briefly broke support. I'm glad I didn't have stop losses set. In retrospect, I wish I had taken better advantage of the dip.", "score": 8, "replies": [{"body": "Yeah, things got really dicey there yesterday morning. Also glad it was able to rebound", "score": 1, "replies": []}]}, {"body": "F for workhorse", "score": 9, "replies": [{"body": "What's the market for glue like at the moment?", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": -28, "replies": [{"body": "People are downvoting you because you’re an idiot.", "score": 11, "replies": []}, {"body": "Imagine calling Biden a leftist though...", "score": 6, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "I will not be the one to defend Biden, and I could care less about him. But calling him or democrats leftist is plainly ignorance, or just manipulation of the truth, depends on the interlocutor.", "score": 1, "replies": []}]}]}, {"body": "Lol. Google: oshkosh ev fleet usps", "score": 1, "replies": []}]}]}
{"title": "Long Term Oil Price Forecasts", "selftext": "Any one know a good resource for long term oil price forecasts? Trying to do a DD on Canadian Oil companies that could see a turnaround in a higher price environment.\n\nIve seen EIA and Deloitte available for free, although Deloitte seems to flatline their forecast after year 3 beyond inflation.\n\nAny other free or cheap sources?", "id": "lqtn9w", "created_utc": 1614115922.0, "score": 8, "upvote_ratio": 0.73, "num_comments": 11, "comments": [{"body": "You could try CAPP (Canadian association of petroleum producers). There are some good economists in Calgary that do some good research on oil producers in Canada (Trevor Tombe and Andrew Leach).", "score": 5, "replies": [{"body": "thanks ill see if they publish anything!", "score": 1, "replies": []}]}, {"body": "Suncore energy was calling your name back in August/September", "score": 3, "replies": [{"body": "Had a bit of suncor, flipped for gme back at 36 lol. that one worked out.\n\nNow i want to make a more sizeable bet on a dividend paying stock with good upside. Canadian oil producers could check both boxes if this price environment holds. They should be making bank with their slashed costs. SU, CNRL and MEG are all interesting. Cenovus too, with their now fully integrated position.\n\nDont know enough about upstream to make my own forecasts though.", "score": 2, "replies": [{"body": "RDS.B is my go to. They're down to $39 from $65 and still paying dividends, but I'm confident they'll bounce up again.", "score": 1, "replies": []}]}]}, {"body": "Based on EIA and IEA, the average case is around 70 $/bbl average in $2020 for the period 2020-2050. Going from 60 to 70 from 2020-2025, then trailing a little above from 2025-2040 (70-80) and then falling back to 60 by 2050. Add your preferred inflation expectation.\n\nFor a \"green\" scenario, knock off 15$, for a \"black smoke everywhere\" scenario add 20 across the board.", "score": 0, "replies": []}, {"body": "June Warren nickels report is sort of the go to I think. Not sure the cost.", "score": 1, "replies": []}, {"body": "I did forecasting that used oil and the EIA was usually off.", "score": 1, "replies": []}, {"body": "The largest Canadian refiners are medium sized in the us I'd look more into Canadian oil exports I know us buys a lot of that sour crude you guys have if you're wanting to focus on Canadian otherwise id look into potentially down oil companies in us i.e. pbf oxy mpc vlo cvx apa etc..pbf is on a run up about 100% in 2 months", "score": 1, "replies": []}, {"body": "Follow Eric Nuttal, he's sharp as hell and always on BNN. He convinced me to buy MEG at $2 and I'm glad I did.", "score": 1, "replies": []}, {"body": "Check out McKinsey. Read a paper of them about oil price development until 2035. Can't find it atm just type it into google.", "score": 1, "replies": []}]}
{"title": "Tesla Model 3 is the #2 best selling car in Switzerland in 2020 (Including ICE cars)", "selftext": "", "id": "lqk4ic", "created_utc": 1614091856.0, "score": 74, "upvote_ratio": 0.96, "num_comments": 11, "comments": [{"body": "Clearly a busted growth story, and Swiss consumers, makers and buyers of world class products, would never buy Tesla cars ... wait a minute. 🤔", "score": 20, "replies": [{"body": "This is more like the real discussion of EVs as compared to all new registrations that is needed.  \n\nHow many Bolts sold vs Zoe is of no use, when the entire addressable market is a hundreds of times larger.", "score": 4, "replies": []}, {"body": "Are the Fiat 500 and Renault Zoe world class products? They're also on the list.", "score": 0, "replies": []}]}, {"body": "It clearly didn’t take the #1 spot, it think it is safe to say there is NO DEMAND.", "score": 13, "replies": [{"body": "Haha exactly", "score": 5, "replies": []}]}, {"body": "Now bring us that Y !", "score": 6, "replies": []}, {"body": "just saw a V3 supercharging station in Affoltern am Albis (Fressbalken) - that is G-reat!!", "score": 2, "replies": []}, {"body": "Wait until Berlin", "score": 2, "replies": []}, {"body": "Right behind the Ford F-150", "score": 1, "replies": []}, {"body": "Wait but what about Volkswagen being number 1 seller of ev’s in Europe ?", "score": 1, "replies": []}]}
{"title": "BTC, TSLA and Gold \"technical analysis\"", "selftext": "", "id": "lqmoow", "created_utc": 1614098344.0, "score": 43, "upvote_ratio": 0.85, "num_comments": 15, "comments": [{"body": "Ahh, \"technical\" analysis—the astrology of the financial industry.\n\nOf course, if it actually worked, the people doing it would be rich beyond measure and would not be employed by someone else, trying to get people to buy into their psuedo-science.", "score": 25, "replies": [{"body": "Funny thing is, if enough people believe in it and act accordingly, it can actually work.", "score": 3, "replies": [{"body": "Same with stock pumping or trashing, done by those who hold or short, respectively.", "score": 1, "replies": []}]}, {"body": "r/wallstreetbets with a necktie", "score": 4, "replies": []}]}, {"body": "You're missing Gordon Johnson", "score": 4, "replies": [{"body": "When I follow Peter Schiff's and Gordon Johnson's Twitter they seem to be manic, angry, insane.", "score": 3, "replies": [{"body": "Nothing quite like watching a Trainwreck.", "score": 1, "replies": []}]}, {"body": "He’s too low to appear on the graph. The Y axis isn’t tall enough to include a percentage that negative.", "score": 2, "replies": []}]}, {"body": "What does this mean in terms of the future?", "score": 2, "replies": [{"body": "Tesla and Bitcoin went up by 1000% already, so it's time for gold obviously.", "score": 8, "replies": [{"body": "Found the gold bug guys.\n\nSelling gold to Tesla investors is like trying to sell Tesla vehicle owners a ICE vehicle.\n\nWe look for what will replace old ways of thinking. Not go back to it.", "score": 1, "replies": [{"body": "Buying Gold instead of bitcoin is not a comparable assesment to buying an ICE vehicle rather than an electric car.", "score": 0, "replies": []}]}, {"body": "EV's have gone up bigly, so now it's obviously time for ICE cars. They're the future man.", "score": 1, "replies": []}]}, {"body": "About as much as [tasseomancy](https://adeptinitiates.com/wp-content/uploads/2017/08/9a3e93b54763a52d78ade1a2b1de7df7-psychic-readings-divination.jpg).", "score": 1, "replies": []}]}, {"body": "So Peter Schiff made no money during the biggest bull market in decades? Lol", "score": 1, "replies": []}]}
{"title": "A question of the timing of when a PUT that I WROTE gets acted upon.", "selftext": "Currently, AMC = $6.55, and I want to sell PUT options for $0.56 with SP=$6.00 and expiration is March 5th. \n\nWhen I sell a PUT, I have to have $600 in my account, and I make $56 right then and there, based on current prices. \n\n* However, suppose that tomorrow, the price of AMC slowly and gradually goes down from $6.55 to $5.55 over the course of the day. This means that at 9:30 AM, it's at $6.55, and it's about $6.42 at 10:30 AM, and around $6.30 at 11:30 AM, etc. It hits $6/share at around 2:30 PM.  **Would I have to take the shares at the instant that the stocks cross $6.00/share?** If this is the case, would I be able to sell them back on the market instantly? \n\n* If I sold the PUT for $56 for the entire contract, and it happened to get exercised the following day, **isn't this a good thing, provided that I could sell these shares quickly**? That way, I could repeat the process, especially if these trades execute quickly, and I don't see what would slow down the trades from being executed quickly (i.e. less than 30 minutes or so).", "id": "lqabnh", "created_utc": 1614058166.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 13, "comments": [{"body": "Not to be rude OP,  but if you don't fully understand the basics of how assignment works, you should not be trading options yet.\n\nYou only get assigned before expiration if the buyer chooses to early exercise. This rarely ever happens.\n\nOtherwise, If at expiration the option is ITM by even 0.01 ¢ you will be assigned the shares unless the buyer calls their broker and provides  \"contradictory instructions\" as per the OCC rules on assignment. \n\nhttps://www.investopedia.com/terms/e/earlyexercise.asp", "score": 10, "replies": [{"body": "To be fair, he isn’t selling naked puts. Worst that can go wrong is he buys the shares at the strike he chose. 🤷🏼‍♂️", "score": 3, "replies": [{"body": "Again, not trying to discourage the OP. But since we don't know all of the details about OP, the account type, suitability, or risk tolerance, it's better to fully disclose the information. \n\nFor us with experience not much can go wrong, for OP if he is new, much could or at least appear that way if it does go wrong.\n\nBtw there is no such thing as a naked put, it's either cash secured or collateral backed with margin.", "score": 2, "replies": []}]}]}, {"body": "You wouldn’t be assigned the shares until the after hours on the expiration date. You usually won’t see the shares in your account until the following day (depending on the broker).\n \nAs for your second question, when you get the shares, you could sell them off as soon as you get the chance. You could also just sell a covered call if you think the share price will recover. That way you can collect more money while you wait to sell your shares.\n \nIf you have further questions, feel free to pm me", "score": 2, "replies": []}, {"body": "Options only auto execute if they expire in the money, not the moment they go in the money. The contract owner can elect to execute prior to execution, but this is not common.", "score": 2, "replies": []}, {"body": "Your contract will most likely not be exercised in the scenario. Your put contract will just be worth something like $1.50 so you’d have to pay extra to buy it back to close it out.\n\nIt most likely will expire on March 5th and you’ll either have made money (by the contract expiring worthless) or bought shares at a higher price than it’s at currently.", "score": 1, "replies": []}, {"body": "Mine have always excised over the weekend and yes you can sell them Monday morning or sell a covered call. You do expose yourself to pin risk but it’s worth the risk IMO", "score": 1, "replies": []}, {"body": "Options are exercised either 1) by choice of the options owner early (almost never happens) or 2) at expiry. In 99.99% of cases the person who owns your put will not exercise until March 5th end of day, so you will either need to buy back the put to close your position or hope it does not get too deep ITM to mess you up.", "score": 1, "replies": [{"body": "I believe that someone told me on one of these subreddits that about 61% of options don't get exercised on the expiration date. They get exercised PRIOR to the expiration date.", "score": 1, "replies": [{"body": "61% seems like a completely random number. I never saw that being used before. Common convention is unless its a dividend stock options are almost never exercised early.\n\nI have only had 2 options get exercised early out of the few hundred I have sold so far, one was GME on a runaway 2 days early and the other was NIO way back in 2020. Other than that, I have sold + rolled ITM for weeks and never had them exercised early. It is of course a risk, but I would consider it a fairly uncommon scenario because someone who owns the option is choosing to lose EV to get the stock. Unless the option has no IV, you are losing money by exercising early.", "score": 1, "replies": [{"body": "[This is where I found it.](https://www.optionsplaybook.com/options-introduction/closing-option-position/) /u/redtexture from /r/options referred me to this.", "score": 1, "replies": [{"body": "Based on that chart, only 11.6% of options are exercised and there is no data there to show WHEN that exercise happens. 69.4% are bought/sold as a way to close positions (ie. I sold a CC, bought back a CC, etc). That chart is the default kind of data you should expect to see on average, but the 11.6% exercise value would be comprised of 99% exercised at expiry and 1% early.\n\nMost options are traded as speculative instruments anyways so exercising them early is losing money by giving up IV and now having to commit a large amount of capital to own shares.", "score": 1, "replies": []}]}]}]}]}, {"body": "Sorry, but it seems like to you don’t grasp basics option concepts. \n\nI recommend you watch more videos on youtube (tastytrade, optionalpha) or read more about basic concepts (strike, premium, assignment, etc..) and beginner strategies before you start trading options.\n\nGood luck", "score": 1, "replies": []}]}
{"title": "ITM Tesla", "selftext": "New trader here and getting screwed by my $TSLA 700/695p credit spread expiring this Friday. Will I only get assigned at expiration or can the bloodbath happen before Friday? Rolling down and out still costs big time....", "id": "lqk1st", "created_utc": 1614091643.0, "score": 3, "upvote_ratio": 0.8, "num_comments": 14, "comments": [{"body": "Should offset be glad it was a spread", "score": 4, "replies": [{"body": "Might've not said that right. I'm not offset at all, it's way in the red...", "score": 1, "replies": [{"body": "No i know was talking to the buy side put option saving you", "score": 4, "replies": []}, {"body": "You'll likely hit max loss. Credit spreads are defined risk. Unfortunately TSLA looks to be imploding. I think it'll recover somewhat but 700 by Friday might be a coin flip.", "score": 3, "replies": [{"body": "This will be an expensive lesson for me..So even deep ITM I probably won't get assigned before close on Friday?", "score": 2, "replies": [{"body": "Very unlikely but the chance is not zero.", "score": 2, "replies": []}]}]}, {"body": "Well no, he means your long leg is offsetting your max loss. Depending on your credit received you'd be looking at like a $4k loss if things level out at the moment and you had done a CSP or naked put \n\nThat's the beauty of a defined risk trade like a spread, you can only lose $500 here if there aren't some weird things going on at expiration (and if you somehow let it go to expiration)", "score": 2, "replies": []}, {"body": "You are offset. If that position looses, you will loose loose nothing more than your initial collateral.", "score": 1, "replies": []}]}]}, {"body": "The burnt hand teaches best...", "score": 4, "replies": []}, {"body": "Looks like your question was already answered, but I didn't see anyone mention the one situation you really want to be careful of.  If TSLA is around $700 on Friday, you'll have some work to do.  You do not want to hit the EOD having done nothing and TSLA sitting at 698.  \n\nAll kinds of after hours shenanigans can take place, and you could end up losing more than your max loss if everything goes wrong. \n\nAlso, depending on your broker, you may have the position closed for you because they're trying to protect you from big price swings in the last hours before expiration.  You generally don't want them to do this, as they're not operating your best interests (they're making sure the broker isn't going to get screwed).\n\nIn short, I'd say make sure you've at least closed the short leg of the spread by noon on Friday.  If that seems too early, just call your broker and find out what time they want you to close out, or even tell them you have it under control and don't want them to take any action.", "score": 3, "replies": [{"body": "Got it, thanks for advice. I watched that video of that very thing happening on TSLA. 30k snafu..", "score": 3, "replies": [{"body": "Awesome, glad you were already on top of it!", "score": 2, "replies": []}]}, {"body": "I learned recently that Robinhood will close your positions pretty early in the day they are expiring as well, not necessarily at the end of the day.", "score": 1, "replies": []}]}, {"body": "sell👏wider👏spreads\n\nimagine having 3 100.00 wide spreads instead of 60 5.00 wide spreads. you could've still manage your way out of it and save 30k. unless a miracle happens and market sharply rebound for the rest of the week, be mentally prepared to kiss your money goodbye", "score": 1, "replies": []}]}
{"title": "I will start my first wheel next week with tastyworks. I have a few rookie questions below", "selftext": "I just got my International tastyworks margin Account approved and transferred ~$5k via  CurrencyFair. I expect the cash to be in my account next week. \n\nMy next move will be to sell my first put on either Snap, Nio or Palantir, which I don’t mind owning, since I think they will rise in long term. Also I would be able to cover if I get assigned if I sell at 50$ a share, Right? That’s why I can’t sell a put on Roku or Tesla or ark etfs which I like as well, because they would blow up my account if I get assigned. \n\n As I understood, I have a 50% margin on trades.  So If i sold a $370 put on Roku 19/03, my estimated buying power would be reduced by roughly 4800$, but if I got assigned I would have to buy the shares for a total of 37.000$ right? So it would blow up my account. So I should only sell puts at a 50$ strike right? \n\nDo you have some tips for starting my first wheel? I heard I should sell my first put at a delta of roughly 30, so that it is more or less safe that I won’t get assigned on my first trade. What should I look out for next week, so that I can trade a fairly „safe“ first wheel and get a feeling for this type of trading?", "id": "lqoglo", "created_utc": 1614102775.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "Probably not a good idea to have your whole account dedicated to just 1 position. Just my opinion tho.", "score": 5, "replies": [{"body": "I have two different accounts at German brokerages where I hold my shares currently. I just took 5k out to start a wheel and see how it is going. It is not my entire savings but I thought it would be a big enough amount to start a wheel and try it out.", "score": 2, "replies": []}]}, {"body": "I'm a newb, but in my experience, a 0.3 delta on PLTR can easily get you assigned. You can also easily blow through the strike and lose a ton of money. \n\nCase in point: Feb 8, PLTR was at \\~$38. Assuming a Feb 19 put option, .3 delta put could have been something like $32 for like $2 premium. If held to maturity, you'd be holding the bag on a pretty big loss as PLTR fell to $27. And then if you wheeled, by doing a .3 delta call, you're looking at what? Maybe $30 strike? You're capping your upside if it reverts and fully exposed on the downside as it falls on a pretty volatile stock. I'd suggest for meme stocks a .3 delta isn't enough for wheeling. Just me, but I'd go 0.2. Sure, less $$$, but you're also limiting the chance of big swings blowing up your account. \n\nDon't ask me how I know all of the above...and I definitely did not open up any of the above stated positions and experience great pain... /s", "score": 2, "replies": [{"body": "Thanks for your insight, especially the 0.2 delta for meme stocks, even though I would not be afraid to be assigned to PLTR stocks in the long term. Can you recommend any less risky stocks rn that I could sell at a max 50 strike?", "score": 1, "replies": [{"body": "RKT is a decent company for selling covered strangles on or even replacing the put with a put credit spread. It’s also trading at about $20 per share so you have quite a good opportunity to start buying into other things too.", "score": 1, "replies": []}]}]}, {"body": "I know wheels and selling premium sounds sophisticated, but unless you're doing the Wheel as a side-show on a $500,000+ portfolio you're probably better off with unmargined cryptocurrencies, particularly in light of recent falls. Remember that the market conditions that favoured the Wheel may now be breaking down.", "score": -4, "replies": [{"body": "So, a drop in the market is a change in market conditions, whereas the drop in crypto is an opportunity to buy?\n\nI see both as an opportunity, and selling csp now, ATM or ITM will net you a nice premium on the right underlying.", "score": 2, "replies": []}]}, {"body": "Ignoring margin you are correct the strike minus the premium will have to be $50 or less.  So you could do 1 or 2 PLTR puts for example but TSLA and ROKU are out.  Heck it is almost out for me and I have 75k but would not want to do all that on 1 put.  \n\n&#x200B;\n\nIf you are new to this I would not use any of the brokers money as that could send your account to 0 on a big loss.  I try to avoid that usually.\n\n&#x200B;\n\nI like PLTR too.  I just added 3 2/26 $25 puts today to the 4 I sold Friday for 7 total which is about a quarter of my 75k wheel portfolio.", "score": 1, "replies": [{"body": "Thanks for your insights. Could you maybe explain a little bit how the margin works? Does it already come into play when I sell the csp? As I see it only a fraction of my cash is locked up as a security for assignment. Or does the margin come into play when I get assigned and do not have sufficient funds in my account right away? And then a margin call after a while?", "score": 2, "replies": [{"body": "The margin is what you need to buy shares if you get assigned \n\nHow it shows in account probably is different for each platform \n\nIn TD and tasty it will show cash and cash I can use for options and the latter will reflect margin\n\nIn webull it is always hard for me to know how much is in margin and what I can trade with\n\nBut once you sell the csp that cash is locked and you can’t use it until you either buy back the put or it expires", "score": 1, "replies": []}, {"body": "The buying power requirement for a CSP on tastytrade is explained [here](https://support.tastyworks.com/support/solutions/articles/43000435177-naked-short-put?_sp=f88f557b-dc3c-454f-a771-f963aee0ed30.1614134388369). Lots of your other questions are probably answered in this big list [here](https://support.tastyworks.com/support/solutions/43000224174?_sp=f88f557b-dc3c-454f-a771-f963aee0ed30.1614134726537). The options position will reduce your \"options buying power\".\n\nSay you get assigned one contract. Your would have a long 100 position on the underlying stock. If the value of that position is more than your \"stock buying power\" (which is 2x your options buy power), then you get a email & text saying you have to either close your position or deposit enough additional cash so that your stock buying power can cover your position.\n\nYou can contact their support and they can also answer your specific questions in lots of detail.", "score": 1, "replies": []}]}]}]}
{"title": "Sell AAPL CCs now or wait it out?", "selftext": "Assigned AAPL last week at $133, now holding 100 shares. Looking at some 3/5 calls now. Think it would be best to sell say a $134 call now or wait it out a bit to see if Apple gets some positive price movement before then and collect higher premium?", "id": "lqparr", "created_utc": 1614104882.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "If it were me I would start selling and maybe do shorter term. If the point of choosing AAPL was to make premium then make premium. If you wanted to eventually get assigned to them hold long term then maybe go further DTE on a much higher strike. I’d ask myself why I picked AAPL in the first place then stick to my original plan.", "score": 5, "replies": []}, {"body": "I'd wait it out and sell calls if AAPL reaches a certain price, like $127 (arbitrary).\n\nMaybe hope for a rebound and sell $130c when AAPL reaches $130.", "score": 2, "replies": []}, {"body": "Sell itm cc", "score": -2, "replies": [{"body": "Why? That would be far below my cost basis of 132.28", "score": 3, "replies": [{"body": "I do it in a Roth/tfsa so I do it differently to wheel. Just sell otm at Breakeven", "score": 0, "replies": [{"body": "Ah gotcha. I’m just wondering if it would be better to wait it out a few days at least to see if the underlying moves higher and increases premiums before I sell a CC", "score": 1, "replies": [{"body": "Just wait never sell cc when red", "score": 2, "replies": []}, {"body": "In this case since it is down so many days in a row you are going to get a bounce I would wait on the bounce.  That is what I am doing in APHA.  Bought back my wife's ccs in that today will wait til tomorrow to sell more.", "score": 2, "replies": []}]}]}]}]}, {"body": "I sold calls this whole time. Worked well cause it honestly stayed pretty flat.", "score": 1, "replies": [{"body": "Where did you sell in relation to your cost basis?", "score": 1, "replies": []}]}, {"body": "Depends on what you want from the stock.  You got assigned so your cost basis is strike - premium. Assuming you got at least $1 premium, your break even is $132, why not sell a CC at 131, you will at least break even. You could sell March 26 calls at 128 strike and it would get you back to even.   Do you want to hold Apple long term, if so, go further out strike above 135 for your calls.", "score": 1, "replies": []}, {"body": "if you sell now do weekly.  I think it will bounce back tomorrow and be better next week.", "score": 1, "replies": []}, {"body": "Sell the 140c you can get 130$ but I think wait till it move up to 130 then sell 2 of the 150c", "score": 1, "replies": []}]}
{"title": "AMD loss porn", "selftext": "[deleted]", "id": "lq8dd8", "created_utc": 1614052033.0, "score": 11, "upvote_ratio": 0.83, "num_comments": 13, "comments": [{"body": "Lol those positions are fine", "score": 12, "replies": []}, {"body": "Not a loss till expiry", "score": 6, "replies": []}, {"body": "Double down. I'm sure it cant go any lower.", "score": 4, "replies": [{"body": "I’m planning on it tomorrow", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 3, "replies": [{"body": "Nah these are actually smart plays.", "score": 1, "replies": []}]}, {"body": "I always find it kind of amusing that the trading apps call it \"gain\" even when people lose their life savings", "score": 3, "replies": []}, {"body": "AMD is so gay but those positions should all be ITM at expo", "score": 3, "replies": []}, {"body": "Turn off your water heater and take cold showers from now on. \n\nI hope you learned your lesson. \n\nSorry for the red day. After red comes green.", "score": 2, "replies": []}, {"body": "AMD killing me, but I’m not scared.", "score": 2, "replies": []}, {"body": "Careful with margin", "score": 2, "replies": []}, {"body": "It’s amc I think you mean", "score": 0, "replies": []}, {"body": "Oh no he lost 12% on 2022 calls. These position are still open, this is stupid \"loss\" porn to be posting.", "score": 1, "replies": []}]}
{"title": "The GUH Daily Recap of February 23, 2021", "selftext": "# Quick News\n\n- Biden administration officials said that for two weeks starting on Wednesday, the Small Business Administration will only accept applications for forgivable Paycheck Protection Program loans from firms with fewer than 20 employees to ensure that they are not crowded out by larger firms. \n- The UK antitrust tribunal ruled on Monday that Epic Games, the creator of popular game Fortnite, will not be allowed to pursue its case against Apple Inc in the United Kingdom over its App Store payment system and control over app downloads. In August, Epic Games tried to avoid Apple's 30% fee on the App Store by lauching its own in-app payment system. In respond to that, Apple banned Fortnite from its store.\n- Investors drove U.S. Treasury yields down from milestone highs on Monday as they looked ahead to remarks U.S. Federal Reserve chairman Jerome Powell is set to give on Tuesday in Washington. Powell is scheduled to speak Tuesday before the Senate Banking Committee, and investors will be watching to see if he offers any changes to the central bank's dovish outlook of recent months as it looks to shepherd the economy through the COVID-19 pandemic.\n- Millennium Management's Israel Englander earned $3.8 billion last year, landing him the biggest payday of any hedge fund manager in 2020, showed data from Institutional Investor. The top 10 hedge fund managers globally earned $20.1 billion in 2020, a 50.2% rise from $13.4 billion in 2019.\n- Spotify said on Monday it would launch in 85 new markets in the next few days which will make the music streaming service available to more than a billion people around the world.\n- Investors expect fast economic growth and a lot of inflation. Bond yields increased. Now investors prefer bonds and commodities as the stock market seems too risky in comparison.\n- Deutsche Bank analyst Michael Linenberg said it was time to buy into airline stocks as COVID-19 cases, hospitalizations and vaccination rates are all trending in the right direction. (American Airlines (AAL) went up +9.42%, Delta Airlines (DAL) increased by 4.53%).\n\n# Quick Earnings\n\n- **Royal Caribbean Cruises Ltd (RCL)'s revenue at 34,14M** (prevision : 35,62M). Stock closed at $86.23 (+9.33%) (*Sorry for the people that received my newsletter, it was not 34.14B but 34.14M*)\n- **Marathon Oil (MRO)'s revenue at 830,0M** vs 849,54M\tforecasted. Stock closed at $10.20 (+7.94%)\n- **Home Depot (HD)'s revenue at 32,26B** vs 30,54B forecasted. Pre-market currently at $269 (-2.50%)\n\n*As you may know, I was bullish on Home Depot (short term and long term) and thought they would beat earnings, I'm for sure disappointed but I still see the long term value in it.*\n\n# Quick Things I'm looking for today\n\n- Powell's speech\n\n# Quick Thoughts\n\n**Companies that sell luxury goods that hold their value are hot right now**\n\nPeople are scared of inflation and of the stock market. This is old news at this point. So they're looking for other investments, even if it doesn't go up in value, it just needs to beat inflation. Anything that can make them get rid of their dollars.\n\nThey're not too happy with gold for some reason (I explain this in the next section). They're trying their hands with beatc01n but that can be a bit risky and too new for some people (old people mostly). So how about alternative investments?\n\nWatches, wine, pens, whiskeys, sneakers, even pokémon cards. Anything, for the love of god take my god damn money!\n\nOh and when I say people, I'm mostly talking about rich people or anybody with enough disposable income to worry about this stuff.\n\nIt happens a lot in the US and in Europe but a place where it might happen much more than usual is China.\n\nYou see China has this terrible habit of devaluying their own currency. This helps with exports and with reducing unemployment. But lately, they couldn't keep up with the US (USA Number One!!!) with the trillions poured into the economy. So, right now, China's Yuan is pretty valuable in comparison with the dollar. \n\nBut this will not stay that way, or at least the Chinese government will do everyting in their power to not let that happen. It needs a good economy, low unemployment and overall satisfaction of their population or else their power are in danger. And the devaluation of their currency is one of the sure (very easy) ways of doing so.\n\nSo if I was Chinese (I'm not, I'm a martian hiding behind a rock because I've seen an alien coming out of its spaceship, but if I was Chinese), I would buy a lot of watches or anything americans do.\n\nI say \"If I was Chinese\", but again, it's really \"if I had a lot of disposable income and want to diversify my assets to hedge against inflation and currency risks\" and Chinese people are just a more extreme case of this.\n\nSo yeah anyway, nice story to say that companies that sell luxury goods *that hold their value* are hot right now because :\n\n- People want to put their money somewhere (really anywhere!)\n- Chinese people want to buy US luxury goods to hedge against the devaluation of their currency\n- Rich people want to buy stuff that hold their value without the risk of the stock market\n- A lot of rich people *made* money during the pandemic and don't know where to put it\n- A lot of people are bored and shopping for anything cool (luxury goods being one of those things)\n\n\n**Might want to short gold**\n\nGold has been for decades the best hedge against inflation and stock market risks. That's because it's decorrelated from any currency (dollar, euro, yen or the swedish krona if that's what you're into), because there's a fixed supply of it (by gold mining companies) and because a lot of it is stored safely (in Central Banks reserves).\n\nThe price of gold is not too volatile either so it's the perfect hedge to diversify a bit. \n\nAny metal are viewed as an hedge but gold became the standard for it. That's because a lot of currencies were using the gold standard. Not only that drove Central Banks to store a lot of gold and keep it even after they switched to the monetary system we know now (Money printer brrr and all that) but that \"safety\" feeling that gold had back then stayed in the minds of a lot of people. What kept that feeling alive even further was that it's a tangible asset that had a real world use, not just a piece of paper that holds value just because some big entity said so.\n\nSo all that to say : Gold is a good hedge against the market and inflation. Except, right now... investors don't want to touch it that much even when the risks are as high as ever! So why? Well... Let's explore those reasons a bit...\n\n*Before that, I want to give a few disclaimers. First, not financial advice ;) but also, this is mostly speculations. While we can have a good idea as to why the market behaves the way it does, gold is mostly driven by the sentiment of a lot of very different investors with very different perspective, strategies and personal risk tolerance. The stock market and other commodities are like that too but fundamentals play a much bigger role for them. Gold on the other hand is mostly a speculative asset. So that's for the warnings. Now let's see what those reasons are.*\n\nFirst, gold went up a lot at the beginning of 2020. From $1,500 in March to $2,000 in August. That's a nice 33% increase in an insane bull market. People were eager to put their money in any asset (mostly the stock market but gold was nice too). But in August, gold became overvalued and signs started to appear that this bullish sentiment was not sustainable.\n\nAdd to that the fact that the Armageddon that investors feared in March didn't actually happen. Investors wisely switched from gold to stonks and other assets.\n\nBut stonks are not the only asset that was down a lot during March. Oil too! There was a mix of geopolitics and people staying at home so didn't need gas. Anyway, when all that fear calmed down, investors bought a lot of oil at those very cheap prices. And oil became the commodity of choice for hedging purposes.\n\nAnother asset was chosen : beatc01n (you know what I mean). While it didn't have as much impact on gold as oil and stonks, it still probably hurt it a little.\n\nSo you might say \"*that's a nice writup buddy, you're explaining the past here, but you said we should short gold now, so what gives?!*\" Well, first, thanks, I put a lot of effort into those posts and it's nice that it's appreciated! But also, all of those reasons still apply today and there's more.\n\nThe rising bond yields make T-Bund much more attractive than gold. Much lower risk with a pretty nice ROI. And if institutions want bigger yields, they are probably ok with buying high yield bonds since the FED and governement seem to do everything they can to keep businesses afloat.\n\nAlso, a lot of institutions invest in beatc01n making it a more attractive and legitimate investment. That drives the price higher, therefore making it more attractive and so on...\n\nSo, if there's no catalyst that shifts this bearish sentiment, this slow downtrend is set to continue.\n\nThe biggest catalyst that I can see for gold is that America (and the rest of the world, there's not just america) reopens but if it does, then that means the economy will be much better and investors will buy stonks even more instead of gold.\n\nAnother (small) catalyst is that beatc01n becomes very risky again. Institutions will sell and write off those losses (Elon Musk already said he would do that with his Tesla investment). They will probably buy gold again as a result.\n\nSo, in my opinion, the bear thesis boils down to : stocks, oil, beatc01n and bonds and other assets being attractive while gold is being forgotten a bit and that might not change for a while while the bull thesis is that a catalyst might change that sentiment.\n\nOk Bye!", "id": "lqis83", "created_utc": 1614088044.0, "score": 86, "upvote_ratio": 0.93, "num_comments": 14, "comments": [{"body": "so what your saying is buy the pltr dip and a little gme", "score": 41, "replies": [{"body": "Don’t forget amc, so many apes holding that it’s a legitimate store of value during this downturn", "score": 9, "replies": []}]}, {"body": "Sir, this is a GameStop dispensary.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 18, "replies": []}, {"body": "Moneyprinter go brrrr?![gif](emote|free_emotes_pack|trollface)", "score": 10, "replies": []}, {"body": "💎💎🙌🏻🙌🏻🚀🚀\n\nThere, fixed it for you", "score": 7, "replies": []}, {"body": "Instructions unclear, bought more Palantir", "score": 8, "replies": []}, {"body": "Good read thanks 👍", "score": 3, "replies": []}, {"body": "How about the Marine crayon eater version", "score": 2, "replies": []}, {"body": "fuck it, gonna load up BP leaps to hedge. BP 1/21 25C", "score": 1, "replies": []}, {"body": "Source on Elon dumping the coin?", "score": 1, "replies": [{"body": "He didn't dump, he dumped on", "score": 1, "replies": []}]}, {"body": "well, tell that to my -100% gold spreads", "score": 1, "replies": []}, {"body": "THE GENTLEMAN'S TIME HAS EXPIRED", "score": 1, "replies": []}]}
{"title": "NVAX - Diamond case 💎💎💎", "selftext": "Hi fellow retards, as the market is going down opportunities arise. One of them is NVAX, Novavax has the best in class vaccine (tested in trials UK & SA also with the new variants). They have 2B manufacturing capacity (1B alone and 2B with partnerships), Nanoflu vaccine (seasonal flow) already successful in trials and will submit to FDA for approval, RSV and COVID/Nanoflu combo also in the pipeline. The market cap is ridiculous (only 16B) and with the upcoming EUA/new deals my view is that they will play in 600$-1000$ range. Moderna/Pfizer gained around 36B market cap from EUA only and the same should be expected for Novavax.\n\nShort interest is around 12%. \n\nKnow what you own and the potential behind it ;) Proud Diamond holder since 83.30$\n\nThis is not a financial advice as I am not a pro but a guy like you! I can say that I just like the stock.", "id": "lqkr9i", "created_utc": 1614093483.0, "score": 3, "upvote_ratio": 0.54, "num_comments": 8, "comments": [{"body": "I’ve seen DD’s written by babies better than yours. Also, NVAX is already up 100% since January", "score": 10, "replies": [{"body": "Will love to see a DD from you next time then, btw it doesn’t matter if a stock is up 100% especially if there is more potential to grow. The arguments are there as I mentioned..... Thank you and good luck", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The market cap gap between them is big and I believe that it will be corrected with the EUA hence the opportunity. Novavax has better vaccine, bigger capacity and Nanoflu as I mentioned where Moderna has lower efficacy, lower capacity and only one vaccine approved.", "score": 1, "replies": []}]}]}, {"body": "Uamy is going to the moon🚀🚀🚀", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Luckily nvax has a site being built in Canada and UK and spain and blah blah blah", "score": 2, "replies": []}]}, {"body": "1.1 billion dose order not to mention a page long list of hundreds of millions here n there and dozens of millions there for novavax. 16 billion market cap for a company thats basically guaranteed to sell all production capacity ofn2 billion this year and next is ridiculous.  Holding strong. Boris johnson litteraly said authorization is coming for it soon. Not if. When. Price gonna kaboom.  Not to mention 13% shorts cuz so many short dummys think the world only needs a few companies vaccines to meet demands so they short this stock everytime theres covid positive news and positive news for pfe. Oh and their rsv vaccine would likely be the highest revenue vaccine ever if they reach the finish line with it. So even when I cash out the surge in price from approvals soaring in, ill still be holding some shares long long term.", "score": 2, "replies": []}, {"body": "Bought Nvax at $4. But only 10 of them :/", "score": 2, "replies": []}, {"body": "Bought at $4. Sold at $18 and $32 🤡", "score": 1, "replies": []}]}
{"title": "Early morning TSLA Tendies:)", "selftext": "", "id": "lql86k", "created_utc": 1614094712.0, "score": 72, "upvote_ratio": 0.89, "num_comments": 18, "comments": [{"body": "What app is this ?", "score": 10, "replies": [{"body": "Think of swim (TOS) TD Ameritrade", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No", "score": 1, "replies": []}]}]}]}, {"body": "True autist here so I didn’t know how to add text to my post.  Bought  day before yesterday for around 2k.\n\nEdit: wrong day that I bought\nEdit 2: for the extra slow autists.. I sold directly after this screenshot.....", "score": 7, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Thank you for your sacrifice:)", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "??? I sold when I took the screen shot......", "score": 8, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "There’s what I wanted to hear:) May rockets rain down on your plays!🚀🚀🚀", "score": 6, "replies": []}]}]}]}, {"body": "I bet it fully tanks 4900 put option contracts", "score": 2, "replies": []}, {"body": "This madlad bet against daddy musk! Grab your pitchforks", "score": 2, "replies": []}, {"body": "didn't age well", "score": 1, "replies": []}, {"body": "Buy Tesla", "score": -1, "replies": []}, {"body": "Noice", "score": 1, "replies": []}, {"body": "Nice trade. What's your alerts at?", "score": 1, "replies": []}, {"body": "I like how someone can else bought Calls around the same time you sold  and made 100k...\n\nBulls make money bears make money congratulations OP that gain is beautiful", "score": 1, "replies": [{"body": "Thanks! And yeah, I really wanted to turn right around and buy calls right after I sold but didn’t pull the trigger", "score": 2, "replies": []}]}, {"body": "Had 750P Mar5 bought at 10.15 betting the gap fill on the hourly on the Jan 6 gap", "score": 1, "replies": []}]}
{"title": "Array Technologies, Inc. (NASD: ARRY): A Solar Pureplay", "selftext": "#Company Description\n[Array Technologies](https://ibb.co/C6nyVHY) went public in October 2020, raising more than $1 billion at a valuation of $2.8 billion (1). The company manufactures tracking systems for utility-scale solar energy projects (2). Array Technologies has completed more than 900 of these projects in the past 30 years (3).\n\nArray mainly operates in the United States, generating 87% of their 2019 revenue in the country. More than 30% of U.S. utility-scale solar generation uses an Array product. Its second largest market is Australia at 8% of revenue (4). The company has installed its systems in 30 countries total (3). Its headquarters are in Albuquerque, New Mexico (4).\n\n#Products\nArray’s primary product is the [DuraTrack HZ v3 tracking system](https://ibb.co/vLccZPt). The DuraTrack platform works with the company’s SmarTrack software to automatically adjust solar modules in response to unique site terrain and weather conditions. SmarTrack is machine learning based, allowing significant adaptability (4). Note that Array’s combined DuraTrack-SmarTrack systems is currently its only product offering.\n\nThere are three main factors that influence demand for solar tracking systems:\n\n**1. Levelized cost of energy (LCOE)**\n\nCompanies have no incentive to purchase tracking systems when the cost of the tracking system outweighs the value of the additional energy generation. This means tracking systems are only viable in areas with high electricity costs. Expanding the areas of viability requires decreasing the cost of the tracking system.\n\nArray Technologies accomplishes this in a few ways:\n\n* Less than 1 motor is in use per MW (5)\n* A single tracker block maneuvers 32 rows with 100+ modules (5)\n* Uses few moving parts and the design is quite simple (5)\n* SmarTrack requires no additional sensors or hardware (6)\n\nThe above design choices allow Array to provide trackers that generate the highest amount of energy possible without major tracking costs. It is important to note that the most effective solar tracker on an energy basis is often not the most effective on a cost basis. Array seems to effectively balance between efficiency and product cost. In fact, the DuraTrack system is independently verified to achieve 6.7% lower LCOE than competitors (4).\n\n**2. Operation and Maintenance (O&M)**\n\nIt is important that solar modules utilizing tracking systems have high uptimes so the cost of the tracking system is further recouped. Additionally, repair costs for tracking systems can make their purchase unappealing.\n\nArray’s DuraTrack boasts a 99.996% uptime thanks to its few moving parts (7). The DuraTrack system requires no scheduled maintenance (5). Array provides several case studies proving the product’s durability, including its operation in the high-corrosion environment of Jordan (8).\n\nDuraTrack’s durable design also includes a fully mechanical wind-load mitigation system. It is the only solar tracker to use such an automatic system without using sensors or electricity (4).\n\n**3. Installation Labor and Costs**\n\nArray Technologies lowered installation cost through 3 single-bolt module clamp designs. Notably, the company claims its RapidClamp design requires just 11 seconds per installation. Fast installation times greatly reduce the total cost of installing the DuraTrack system (7).\n\n#Leadership and Ownership\nRon Corio ([pictured](https://ibb.co/c2Sf7Fg)) is the founder of Array Technologies and currently serves on the board, after being CEO from 1989 to 2018 (4). Corio is considered a pioneer of solar tracking as he is among the first to develop such a system (20). Corio holds 10% of the company's shares and is the second largest shareholder (10).\n\nMr. James M. Fusaro is the CEO of Array Technologies, serving in the role since Corio’s mid-2018 retirement (4). Previously, Mr. Fusaro served as President of Advanced Materials at Honeywell International Inc. (NYSE: HON). In this role, Fusaro oversaw the $3 billion Honeywell Performance Materials & Technology business. He has also held executive roles at Avnet (NASD: AVT) and Amkor Technologies (NASD: AMKR). These positions all contribute to Fusaro’s lengthy experience in electronics, semiconductors, and manufacturing. He also has over a decade experience as an engineer (9).\n\nFusaro purchased 182,772 shares of ARRY in October 2020 at $22 per share for a total cost of $4,020,984 (11). In total, Fusaro owns around 1% of the company (10).\n\nInstitutions hold 78% of Array Technologies; the largest holder is Fidelity Investments at 15% of shares. Other holders include AllianceBernstein, Blackrock, the Bank of New York Mellon, and Neuberger Berman Group at over 1% each (12). Array’s stock fell in December 2020 after Oaktree Capital Management sold a significant portion of its position in the company. The selling of these shares is understandable as Oaktree owned a significant percentage of Array through its subsidiary, ATI Intermediate Holdings (13).\n\n#Outlook and Strategy\nThe outlook for the solar industry is very promising. Solar is the fastest growing form of electricity generation in the United States. Analysts project the solar industry to grow earnings 32% annually over the next five years (17).\n\nEstimations indicate U.S. installations of ground-mounted solar generation capacity will reach a compound annual growth rate (CAGR) of 16%. Array sees several tailwinds for the industry: regulation of fossil fuels, decreasing solar energy costs, growing support for clean energy initiatives, and accelerating deployment of utility-scale batteries (4).\n\nSpecific to Array’s market, U.S. installations of trackers for 1+ megawatt systems are growing at a CAGR of 35%. Array’s products are now present on more than 1 in 4 solar modules installed in the U.S. to date (5). Over 50% of utility-scale solar projects use tracking systems in the United States (14). Array Technologies is positioning itself to achieve more of this market share.\n\nArray Technologies is executing a three part growth strategy:\n\n* **Gain market share in the company’s core U.S. business:** Array’s order book increased by 31% year-over-year from Q3 2019 to Q3 2020 (15).\n\n* **Expand internationally:** In the last nine months of 2020 the company increased its international footprint by over 50% (15).\n\n* **Perform bolt-on acquisitions:** As of their Q3 2020 earnings call, Array is currently pursuing several acquisition targets (15).\n\nArray’s existing revenues have protection through the company’s patents on its DuraTrack system and components. The company’s linked-row, rotating gear drive system also has patent protection until 2030. The patent protects their single-axis tracking system that uses just one electric motor to drive the rotation of multiple rows of solar modules using articulated driveline joints. The patent also protects DuraTrack’s wind-mitigation stowing system. The company believes its patents force competitors to use less efficient designs, maintaining Array’s competitive advantage (4).\n\n#Competitors\nNEXTracker Inc. is Array’s main competitor and also the largest solar tracking company in the world. NEXTracker is a subsidiary of Flex Ltd. (NASD: FLEX) after its acquisition in 2014. Flex’s stock rose significantly after Array’s IPO, indicating NEXTracker being further priced into Flex’s valuation.\n\nFlex does not report individual financial data for NEXTracker in its filings. This makes it difficult to perform a fundamental comparison between the two. However, analyzing the difference in their products provides valuable insight.\n\nNEXTracker’s solar trackers use one motor per row of solar panels, compared with DuraTrack’s one motor for several rows. NEXTracker’s use of more motors leads to increased cost and is one reason for Array’s superior LCOE, although NEXTracker’s systems are more advanced technically. NEXTracker is unable to switch to a single-motor system because of Array’s patents. IArray Technologies is currently in litigation concerning an ex-employee who allegedly shared trade secrets with NEXTracker in violation of a non-compete agreement (4).\n\nCompetitively, Array’s only real moat is its patents which expire in 2030. The company does have certain product advantages over NEXTracker because of DuraTrack’s lower cost, simplicity, LCOE, and wind mitigation system. Array’s patents on these systems will eventually expire. It is also possible that competitors mirror these features without infringing on Array’s patents (4). Investors should be aware of Array’s low/non-existent moat.\n\n#Financials\nArray Technologies is working to decrease product costs while drastically increasing revenues and profits. The company is already profitable with positive free cash flow. The table below illustrates Array’s revenues, earnings, and cash flows (18).\n\nCategory|TTM|2019|2018\n:--|:--|:--|:--\nTotal Revenue|975,116|647,899|290,783\nGross Profit|248,141|150,761|11,555\nOperating Income|171,402|83,409|-61,206\nNet Income|121,046|39,745|-60,764\nNormalized EBITA|196,502|110,692|-33,203\nOperating Cash Flow|141,016|386,073|-11,727\nFree Cash Flow|139,488|384,376|-18,157\n\nArray Technologies’ 2019 revenue was $647,899,000, growing 123% over 2018. Array has grown revenues 51% in the trailing 12 months. Margins have increased since 2017, with the exception of a 3% increase due to COVID-19 supply chain disruptions (15). Currently, gross margins are at just over 25% (18).\n\nArray holds $27.14 million in cash and carries very little debt. The company is not at risk of insolvency with a current ratio of 1.8 and Debt/Equity of 0.03. Array is using its low-debt status to pursue bolt-on acquisitions and has the cash pile to do so (19).\n\nARRY trades at ratios of 51.33 P/E, 5.40 P/S, and 2.09 PEG (18). These valuation metrics are inline or slightly higher than the industry averages of 59.32 P/E, 4.53 P/S, and 1.85 PEG (17). Fundamentally, the valuation appears high but Array’s extreme growth in revenue and earnings makes it seem more reasonable. The company’s valuation is inline with other companies in the solar industry and growing faster.\n\nThe mean price target for ARRY is $51.05 which translates to a ~30% upside. The lowest price target is $37 from Morgan Stanley (NYSE: MS) and Credit Suisse (NYSE: CS). The highest price target is $60 from Piper Sandler (NYSE: PIPR) (21). \n\n#Risks\nThere are many risks to consider before investing in Array Technologies. These risks include but are not limited to:\n\n* Array Technologies is reliant on the success of a single product\n\n* Array does not have a significant (if any) moat\n\n* Array has a high valuation due to its growth, which may stop or slow\n\n* ARRY is an extremely volatile stock\n\n* The company releases its fourth quarter and full-year 2020 earnings report on March 9th, 2021\n\n* Major shareholders selling could cause the stock to fall\n\n* Low reviews on Glassdoor; employee morale may be low following management changes (22)\n\n* Competitors, like NEXTracker, could take market share from Array\n\n#Disclaimer\nI do not provide investment advice of any kind and I am not a qualified licensed investment advisor. I am an amateur investor. All information found here, including any ideas, opinions, views, predictions, forecasts, commentaries, suggestions, or stock picks, expressed or implied herein, are for informational, entertainment or educational purposes only and should not be construed as personal investment advice. While the information provided is believed to be accurate, it may include errors or inaccuracies.\n\nAt the time of writing, I own shares in Array Technologies (NASD: ARRY) with an average cost basis of $36.27 per share. The stock is trading at roughly $37.61 as of this report’s release on February 2nd, 2021.\n\n#Sources\n(1) [Albuquerque Business First - Array Technologies IPO raises over $1 billion](https://www.bizjournals.com/albuquerque/news/2020/10/15/array-technologies-closes-ipo.html)\n\n(2) [Array Technologies - About Us](https://arraytechinc.com/about-us/)\n\n(3) [Array Technologies - Home](https://arraytechinc.com/)\n\n(4) [SEC - Array Technologies S-1](https://www.sec.gov/Archives/edgar/data/1820721/000119312520251336/d82970ds1.htm)\n\n(5) [Array Technologies - Research Analyst Presentation](https://ir.arraytechinc.com/static-files/28356019-d44b-492e-8a4a-240368c56500)\n\n(6) [Array Technologies - SmarTrack](https://arraytechinc.com/smartrack/)\n\n(7) [Array Technologies - DuraTrack](https://arraytechinc.com/duratrack/)\n\n(8) [Array Technologies - Dead Sea Case Study](https://arraytechinc.com/dead-sea-case-study/)\n\n(9) Linked In - Jim Fusaro\n\n(10) [Yahoo Finance - Is Array Technologies, Inc. Popular Amongst Insiders?](https://finance.yahoo.com/news/array-technologies-inc-nasdaq-arry-053929306.html)\n\n(11) [SEC - Array Technologies FORM 4](https://www.sec.gov/Archives/edgar/data/1390022/000089924320028613/xslF345X03/doc4.xml)\n\n(12) [Yahoo Finance - Array Technologies Holders](https://finance.yahoo.com/quote/ARRY/holders?p=ARRY)\n\n(13) [Investor Place - Should Oaktree Capital Sell the Rest of Its Array Technologies Stock?](https://investorplace.com/2020/10/oaktree-capital-should-it-sell-rest-of-array-technologies-stock/)\n\n(14) [EIA - More than half of utility-scale solar photovoltaic systems track the sun through the day](https://www.eia.gov/todayinenergy/detail.php?id=30912)\n\n(15) [Motley Fool - Array Technologies, Inc (ARRY) Q3 2020 Earnings Call Transcript](https://www.fool.com/earnings/call-transcripts/2020/11/06/array-technologies-inc-arry-q3-2020-earnings-call/)\n\n(16) [Barrons - Flex Stock Soars on Speculation It Could Sell or Spin Solar-Tracking Unit](https://www.barrons.com/articles/flex-stock-soars-on-speculation-sell-or-spin-solar-tracking-unit-51602878168)\n\n(17) [Finviz - Technology Industries](https://finviz.com/groups.ashx?g=industry&sg=technology&v=120&o=name)\n\n(18) [Yahoo Finance - ARRY Financials](https://finance.yahoo.com/quote/ARRY/financials?p=ARRY)\n\n(19) [SEC - Array Technologies 10-Q](https://www.sec.gov/ix?doc=/Archives/edgar/data/1820721/000182072120000007/arry-20200930.htm)\n\n(20) [Solar Powered World - Innovators and Influencers: Ron Corio, a pioneer of solar tracker reliability](https://www.solarpowerworldonline.com/2017/08/innovators-influencers-ron-corio/)\n\n(21) [Finviz - ARRY Array Technologies, Inc. Stock Quote](https://finviz.com/quote.ashx?t=arry)\n\n(22) [Glassdoor - Array Technologies Reviews](https://www.glassdoor.com/Reviews/Array-Technologies-Reviews-E849140.htm?filter.iso3Language=eng)", "id": "lqmfa9", "created_utc": 1614097704.0, "score": 41, "upvote_ratio": 0.87, "num_comments": 13, "comments": [{"body": "That's some decent DD", "score": 15, "replies": []}, {"body": "I've used ATI HZ v3 on multiple projects. Solid product and the company is very busy right now. I also hold $ROCK for exposure to other racking vendors. Thanks for the detailed DD.", "score": 6, "replies": []}, {"body": "Is there a lockup period? Are we past it? asking for a friend. \n\nGood DD though.", "score": 4, "replies": []}, {"body": "Good job. I didn’t read it but I’ll add it to the top of my watchlist", "score": 2, "replies": []}, {"body": "Good stuff!", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Well, they are indeed back at 30 now with the new (non-dilutive) offering so I entered the game. Let’s hope for another good run.", "score": 1, "replies": []}]}, {"body": "Bought in during the latest offering (under $30 average). Did some research yesterday and I like this company. Reminds me of some succesful firms like KONE: simple tech and high profits from maintenance. Good tech doesn’t have to be complex, particularly if expanding to the rest of the world (environmental variance -> more problems with complex tech).\n\nHere’s hoping for a good green run ahead, but I might actually stick to this in the long term.", "score": 1, "replies": []}, {"body": "Late to the party here, do you think this is still a good buy?", "score": 1, "replies": []}]}
{"title": "Tesla Yolo on dip", "selftext": "", "id": "lqmk2u", "created_utc": 1614098029.0, "score": 36, "upvote_ratio": 0.85, "num_comments": 18, "comments": [{"body": "Buy the real dip at 330-500", "score": 8, "replies": [{"body": "Maybe, no gamble no future", "score": 5, "replies": []}, {"body": "surely it won’t go that low?", "score": 3, "replies": []}]}, {"body": "My retadd experience tells me YOLO=$$$$$$$$$$$$$$$$$", "score": 4, "replies": []}, {"body": "What a beautiful broker you have. Love that green", "score": 5, "replies": []}, {"body": "I think it’ll go down more before going back up", "score": 13, "replies": [{"body": "It's been going down since 900, I'm just riding the feds money printer at this point.", "score": 3, "replies": []}]}, {"body": "Oh didn't see the 22 at first. I thought you were stupid for a second. You're just crazy after all.", "score": 3, "replies": []}, {"body": "Oh BOI here we go", "score": 3, "replies": []}, {"body": "Nice", "score": 5, "replies": []}, {"body": "If tesla hits 1k by next year 100 bands in bank lets gooo!!", "score": 7, "replies": []}, {"body": "Dont think elon let it go More down no no ![gif](emote|free_emotes_pack|scream)", "score": 2, "replies": []}, {"body": "Same here. Let's hope for the best. ![img](emote|wsb_emojis|bull)", "score": 2, "replies": []}, {"body": "Waiting for the next dip to flush more money down into tesla", "score": 1, "replies": []}, {"body": "Heh...noice", "score": 1, "replies": []}, {"body": "RIP", "score": 0, "replies": []}, {"body": "You have a text", "score": -1, "replies": []}, {"body": "Yolo on the dip.? Bruh it's still dipping", "score": -1, "replies": []}]}
{"title": "A Curious Volume of Forgotten Lore (Raven Industries DD)", "selftext": "Alright autists--pull up a chair, grab a tub of cheese balls, change the password on your wife's IRA so she doesn't find out you dropped $20k on TLRY FEB 26 $100C that literally couldn't go tits up, and get ready for papa MRE to tell you a story.\n\nEveryone back? Great. I know you Asperberger laden assholes can't read too good, so I'll do my best to give you TL;DRs in emoji form. Skim if you wish--I would.\n\n&#x200B;\n\n**Numbers Overview & Leadership**  \n**TL;DR** \\- 🔢👌\n\nNASDAQ: **RAVN**\n\n|Market Cap|$1.5B|\n|:-|:-|\n|Shares Outstanding / Float|35.9M/35.4M|\n|% Held by Institutions|80.07%|\n|EPS\\*|0.61|\n|P/E\\*|69.78|\n|Price/Book|4.63|\n\n\\*I know numbers make some of you dizzy, and I wish I didn't feel like I needed to include this, but for you fellow tards that keep investing in companies that don't have products yet, EPS is Earnings per Share and P/E is Price to Earnings. These things mean the company is actually making money.\n\nLooking back, the company got pretty fucked by COVID. Their EPS dropped from over $1.00 in 2019 to the $0.61 listed above in 2020, but their earnings have largely recovered as of Q4 2020 ($0.28 in 2019 vs $0.24 in 2020).\n\nAlso of note, they \"indefinitely suspended\" (read axed) their dividends in 2020 to more aggressively invest in their growth areas.\n\nOverall, there's nothing exceptional about those numbers. My key take-aways were that, unlike some other companies in the sectors Raven is in, the price isn't insanely inflated. The fact that over 80% is held by institutions (Blackrock, Vanguard, and Thrivent are the top 3 holders, all of whom added last quarter) is also reassuring.\n\nAs for the leadership, no one really stands out as an all star or an asshole. The CEO/President is a home grown dude who started at the company as an intern back around the time of Christ. Everyone is about what you'd expect--a dude with a masters from MIT, a buncha dudes with MBAs, etc.\n\n**Bottom Line--this isn't some artificial hyped up bullshit.**\n\n&#x200B;\n\n**History**  \n**TL;DR - 🥣🏭+👴💭+⌛➡🎈🏭**\n\nLet's go back in time. To the time of dinosaurs. 65 whole years ago--when the contiguous 48 was the only 48. Some chucklefuck busts into his boss's office at the cereal factory they work at.\n\nChad: \"GOD DAMNIT. IM DONE WITH THIS SHIT HARRY. MAYBE THIS BETTY CROCKER MAKING, ROCKY AND BULLWINKLE SPONSORING BULLSHIT IS NOT FOR ME. MAYBE I WANT TO FLY.\"  \nHarry: \"Sounds good, Mr. Chad, sir\"  \nU.S. Navy: \"AND MY AXE\"\n\nAnd boom. A Raven baby.\n\n\"*MRE, I don't understand* 😖😢\"  \nFuck I gotta spell everything out huh?\n\nBack in 1956, a bunch of duders working at General Mills (yeah, of cheerios fame) High Altitude Research Division, broke off to form Raven Industries after their big brained leader, Ed \"Chad\" Yost got a $47,000 grant from the US Navy after he built and flew a tethered hot air balloon.\n\nYou remember all those old \"ITS A UFO\"/\"Nah bitch it's a weather balloon\" stories? Turns out a bunch of those were made by our boy ~~Ed~~ Chad--both from his time at the cereal station and from Raven itself.\n\n\"MRE THAT SOUND LIKE AN OLD COMPANY 😭. I DONT LIKE BOOMER SHIT 😓😥\"  \nYo shut the fuck up. If Pfizer (founded in 1849) is still around and providing ~~little blue~~ fat green gains, you bet your undescended testies that a company like Raven can do the same. But I hear you. That was then, this is now. What's Raven done for me lately?\n\n**Raven Aerostar**  \n**TL;DR - 🎈🕵️‍♀️🏋️‍♀**\n\nDecades later, Raven still gets some of those fat military contracts. [Last month](https://www.prnewswire.com/news-releases/raven-aerostar-and-persistent-systems-network-constellation-of-stratospheric-balloons-in-comms-demo-301217001.html), they demoed a platform where they use a constellation of stratospheric balloons to create an on demand, low cost, reusable, wireless networking system above battlefields or other points of interest.\n\nThese aren't your kids party balloons. And Dorothy, these aren't the wizard's balloons either. They have a bunch of different types created for different things. Some of these things go to the edge of space--Remember that dude who drank too many redbulls and jumped out off a balloon? That was Raven. You remember Google/Alphabets Loom project where they were going to float hot spots around the earth using balloons? Yeap. Raven.\n\nIn 2015 NASA needed to test their Supersonic Decelerator. To do that, they had to drop it from the edge of space. Guess how they did it. You bet your ass it was a big fucking balloon made by Raven. Raven got a special award for that, btw. But that wasn't the end of the relationship. In 2020 alone, NASA threw \\~$3Mil at Raven for all sorts of weird studies--cosmic rays, the magnetosphere, atmospheric sciences, seismic events on Venus--they used balloons and raven for ALL that shit.\n\n\"MRE. I don't give a fuck about balloons.\"\n\nWell, you should. Along with that shit above, Raven's balloons have a bunch of capabilities that have yet to be fully realized simply because we don't have the technological capability to use it. Lets say, for example, that we wanted a worldwide network of autonomous delivery drones. What if there was a platform that could float around providing both a charging base and a warehouse simultaneously? Amazon has already thought of doing this with blimps/airships (I don't want to mislead you, there have been no public discussions between amazon and Raven that I've found, but I am sure that Raven would be a leading candidate to build them). What if you want to carry 8000lbs of fuel up to 110,000ft and let your futuristic spacecraft or drone or whatever refuel when it gets there? What if you want to go and survey an alien planet? Balloons can do all that shit. They can lift a shit ton of stuff for cheap, they're semi-autonomous and can control where they're hovering, and they stay up for MONTHS at a time. I get it, though, fuck balloons I guess.\n\nRaven Aerostar also makes:\n\n* Military Radars and early detection systems\n* Payload recovery parachutes (think rocket parts falling back down, high altitude payload drops, etc)\n* Stratospheric airships\n* Aerostats (which the army keeps buying)\n* Various \"Dry suits\" and other PPE\n\n\"Wait. Dry suits? Why?\"\n\n**Raven Engineered Films**  \n**TL;DR - 👩‍🔬👨‍🔬🧪➡👩‍🌾👩‍🚀🥗🎈🏠**\n\nYou thought \"Raven Industries\" was just Aerospace and Defense? Fucking. Wrong. Raven is a conglomerate. For you smoothbrained fucks, that means it's a business slaver. Its a business that makes money by owning businesses that actually do work. These include Raven Aerostar (Aerostar International, Inc. and Aerostar Technical Solutions), but also other shit.\n\nWhen Raven started doing crazy shit with balloons, there literally weren't companies making the materials that they needed. So what did they do? Started making it themselves.\n\nAlong with the various materials for the balloons, Raven learned to make all sorts of materials. Ultra-thin, ultra-light films? Check? Thicc ass fiber reinforced shit? Check. Everything in between? double check. Seriously. You want some shit to wrap around your plants so you're not wasting water? How about shit to put over one field while another one is being fumigated? What if you wanted to build a temporary structure to keep something warm while a more permanent structure was being built? What if you had a shit ton of nasty ass shit that you didn't want leaking into mama earth (land fills, fracking water, etc)? What if you had a fuck ton of cotton that you had farmed but if it got wet, shipping bills would be \\~5x more expensive? What if you needed to ship some veggies across the country? You ever see those half built houses getting carried down the road with big ass pieces of plastic on them so you can't see in the living room? What if you want to build your own living room but you got argon seeping up out of the ground? Yeah... All of this is Raven. And I'm just scratching the surface. I was going to try to cover everything, but fuck I still need my fingers to buy FDs. [Go look for yourself](https://ravenefd.com/products). Then check out [geomembranes](https://en.wikipedia.org/wiki/Geomembrane#Applications). And again. that's just one of their products.\n\nAnd they have all sorts of ways to do this. They do blown film (heh), cast film, sheeting, laminating, coating, and basically anything you could think to do with large pieces of single materials.\n\nSo they're fucking with space, military, farmers, builders, energy, and more. They got flying shit, beeping shit, floating shit, anti-seeping shit. Honestly it's kind of hard to stay on track writing all this. Speaking of staying on track, though...\n\n**Raven Applied Technology**  \n**TL;DR - 🚜+💻+🛰=🥗🍅🍊🥔🥙💲💲**\n\nYeah. I get it. This is long as fuck. I'ma keep this part short. Raven one of the leaders in autonomous farming tech and precision agriculture. Want to make the best possible use of some specific land and get that bitch farming itself? Raven is the company to call. They make and use field computers and GPS to measure with sub-meter accuracy and then provide the data crunching to plan it all out. They even have a software suite designed to enhance efficiency on the office side of farming businesses.\n\nAlso of note--they acquired an autonomous agriculture startup \"SmartAg\" as well as majority ownership in another autonomous tractor startup \"Dot Technology Corp\" at the end of 2019  (they acquired the rest of DOT in 2020) and have been folding their stuff into Raven's pre-existing systems ever since--the first revenues from this acquisition are probably just now coming to fruition, with much more potential.\n\n**Review and Future**  \n**TL;DR** **-** **💹 $50-65 End of March, $70-90 EoY**\n\nSo if you're keeping up Raven is an established company that came from (at the time) futuristic ideas and has recently made moves showing it's still looking toward the future. At the base of this growth, it already has:\n\n* Long standing relationships and active contracts with both the US DoD and NASA\n* A ton of products with space and futuristic applications\n* Ownership of production for proprietary materials used in aerospace, construction, farming, and just about everything else\n* Autonomous agriculture solutions and precision agriculture planning software\n\nFuck this sounds like something Mama Cathie would like.\n\nBecause it is. ARKQ currently owns 3.33% of RAVN, and that number has been increasing. Cathie has been using the past few red days to buy some shit on sale, but she's also been **buying RAVN at 52 week highs.** She's bought RAVN 4 out of the last 5 trading days (excluding today, or maybe not--I don't have that info at time of writing).\n\nI'm not gonna spout some bullshit about guaranteeing it'll be in ARKX. Anyone saying something is a lock is just lying to you. Mama Cathie does as Mama Cathie wants and we'll all fucking like it. That said, I would be extremely surprised if it's not a consideration for her.\n\nSo where do we go from here? Just like the balloons, we go up. Obviously. Nasdaq has been doing its best to keep this bird's wings clipped the past few days, but RAVN has been growing regardless (at least prior to today--may have finally gotten it to come down temporarily, but I'm not ruling out a late rally). Regardless, I'm looking at hitting a new ATH around $50 (\\~$1.7B valuation)before the end of March (sooner if NDX can quit being a bitch). If it's added to ARKX, I think $60-$65 ($\\~2.3B valuation) could be realistic in that same time frame. Because of their re-found focus on growth (again, shown by their cutting dividends to reinvest) and recent strategic acquisitions, I'm targeting $70 (\\~$2.5B valuation) without ARKX or $90 with (\\~$3.2B valuation) EOY.\n\n&#x200B;\n\n**Upcoming Events**  \nMarch 23rd - Earnings Release  \nMarch 29th - First Possible date for ARKX launch (assumedly the holdings will be announced by this date)\n\n&#x200B;\n\n**POSITIONS**  \n16 April 21 $45C  \n20 Aug 21 $50C\n\n&#x200B;\n\n**Note:** Yes I know that this a new account. I have my reasons and you can go fuck yourself. If you think this is bot spam, well... your glass licking ass probably belongs here, so I guess I can't blame you.  \nAlso, I started writing this before the market opened and just now got back to it. I didn't update any of the numbers and made very few changes. Also, I didn't spell or grammar check it. Again, fuck you.\n\n**e**:Formatting cause my brain is smooth af", "id": "lqpn27", "created_utc": 1614105728.0, "score": 28, "upvote_ratio": 0.81, "num_comments": 18, "comments": [{"body": "I'd buy but I lost all my money today :)", "score": 12, "replies": []}, {"body": "Dumping all my meme stocks for RAVN because cool name and internet guy told me some cool shit about it.\n\n*edit: not really, but it's on my radar now, and looking at it in the future.*", "score": 13, "replies": [{"body": "It's on your [radar](https://ravenaerostar.com/products/radar-systems/hipointer-100), huh?", "score": 3, "replies": [{"body": "Iseewatudidthere.", "score": 1, "replies": []}]}]}, {"body": "Yes\nI’m with you . I pulled 95k out of  IRA or borrowed it . So here we go. Got to buy some fuel for the 🚀🚀🚀🚀🚀🚀🚀🚀🚀⭐️⭐️⭐️⭐️⭐️⭐️", "score": 5, "replies": []}, {"body": "lol I owned 500 RAVN shares, just sold half of it yesterday since I felt it was getting a little overvalued and wanted to take some profits XD so happy I did. I’ll probably get back in now though", "score": 5, "replies": [{"body": "Ha good shit. Wish I had done the same with my calls and rebought them today. Lost half of their profits this morning. Good til April/Aug tho so fuck it I guess..", "score": 2, "replies": []}]}, {"body": "I dig. This is what I'm looking for. I'm here for the memes too, but I like these DD's that have been popping up.", "score": 3, "replies": []}, {"body": "hmm... well, i do like ravens...", "score": 2, "replies": []}, {"body": "Once upon a midnight dreary, while I pondered, weak and weary, Over many a quaint and curious volume of forgotten GME stonks—\n\nWhile I nodded, nearly napping, suddenly there came a tapping, as of someone gently rapping, rapping at my chamber door. “’Tis some visitor,” I muttered, “tapping at my chamber door— Only this and nothing more.”\n\n&#x200B;\n\nAh, distinctly I remember it was in the bleak February; And each separate red day wrought its ghost upon the floor. Eagerly I wished the morrow;—vainly I had sought to borrow\n\nFrom my broker cease no dollar—sorrow for the lost GME— For the rare and radiant maiden whom the angels name GME— Nameless here for evermore.\n\nQuoth the Melvin: \"Never more\"", "score": 2, "replies": [{"body": "You literally just “quoth the raven”’d this thread, about a stock with RAVN as its ticker...while removing the word “raven”\n\nI dunno if that’s madness or brilliance.\n\nWell done autist", "score": 1, "replies": [{"body": "Quoth the retard: \"I'm a raven\"", "score": 2, "replies": []}]}]}, {"body": "Thanks for the DD... I've got it on my watch list now.  Looks like it's hit near 37.00 twice this week and lower than that 2 weeks ago.  Took a huge hit this morning (37), but recovered nicely.", "score": 1, "replies": [{"body": "Yeah it fell pretty hard the last time the major indexes dropped at the end of January. That's why I was feeling especially bullish on it after it stayed green during these past few red Nasdaq days. When everyone was talking about their bleeding yesterday and RAVN was sitting pretty atop my portfolio, I was inspired to write the DD. Got got today though, finally, but like you said, nice recovery. Hope to continue the momentum tomorrow if the rest of the market recovers.", "score": 1, "replies": []}]}, {"body": "\\*unravels banana\\*\n\nMe buy. Me not regret.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Let me start from the beginning, when I was a boy in Bulgaria...\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Good insider buying on RAVN the last couple of months ([link](http://www.openinsider.com/search?q=ravn)).", "score": 1, "replies": []}, {"body": "Lets go first majestic!!", "score": 1, "replies": []}]}
{"title": "$AMD - Stealing from Market Makers - AMD Swing Trade Thesis", "selftext": "[deleted]", "id": "lqs4ta", "created_utc": 1614111983.0, "score": 40, "upvote_ratio": 0.92, "num_comments": 19, "comments": [{"body": "I bought amd today @ 80... so yeah I agree with this guy. But I can’t read.", "score": 9, "replies": [{"body": "And that's why we got the TLDR for ya! 🚀", "score": 4, "replies": []}]}, {"body": "I've been watching these channels for months with AMD. Today it's been a test of that support level you mentioned but it bounced right off it like a fuckin' trampoline. Very extensive DD.", "score": 7, "replies": [{"body": "I was very pleasantly surprised with the bounce. There was insane volume on it. Cheers man!", "score": 1, "replies": []}]}, {"body": "💎👐💎🚀🌙", "score": 2, "replies": []}, {"body": "$TSM makes the chips for $AMD and $NVDA and is a great stock to go with it In my opinion. I am mo one and know nothing. I personally bought both a long time ago.", "score": 2, "replies": [{"body": "TSM is for sure a great stock. Recently they just announced more manufacturing facilities being built too so the outlook on it looks amazing.", "score": 4, "replies": [{"body": "Long both AMD and TSM.  Can't go tits up...", "score": 2, "replies": []}]}]}, {"body": "I’ve seen your previous DD, I’m all-in\n\nThank you for your service", "score": 2, "replies": [{"body": "Enjoy the money 😎", "score": 2, "replies": []}]}, {"body": "Very nice DD. In for 3/19 85/95 call spreads.", "score": 2, "replies": [{"body": "Appreciate it man, thanks!", "score": 1, "replies": []}]}, {"body": "Hold on... lemme go THETAGANG for you guys so we can break $AMD out of this coma.", "score": 1, "replies": []}, {"body": "Pretty sure this should be charts or horoscope not DD", "score": -6, "replies": []}, {"body": "Had AMD in my watch list and have also been looking to get into options. Just did my first call ! Thanks homie!", "score": 1, "replies": [{"body": "Not a problem man! best of luck in your trading journey.", "score": 2, "replies": []}]}, {"body": "I've got $92.5Cs for 3/19 down 70% in value. I'm holding until the bitter end. I believe in Mama Su.", "score": 1, "replies": []}, {"body": "I feel like NVDA earnings might impact AMD and move it out of the channels or at least make the movement inside the channel not as predictable. We all know about the chip shortage and NVDA earnings are coming up. This next part is speculation, but if NVDA forecasts slower growth for the next few months until the chip shortage is resolved, it can lead to a selloff in the semi-conductor industry.", "score": 1, "replies": []}]}
{"title": "$PENN peaked on Super Bowl Sunday, March Madness is bigger", "selftext": "Penn peaked at $133 on 2/5 because of the super bowl and then dumped immediately the next day.  March Madness is the biggest sports gambling event of the year and its actually happening this year (3/18-4/5) with a bubble in Indiana.  \n\nThey just got contracted in the state of NY and proposals are in for Texas.  There’s nothing telling me why this won’t be all time high by Friday 4/2.  Final game is Monday 4/5 so don’t get caught with the bags as this stock dumped hard the day after the super bowl.  \n\nIt recovered very well today juxtaposed to the rest of the market and the daily chart reinforces all of this.", "id": "lqungf", "created_utc": 1614118595.0, "score": 56, "upvote_ratio": 0.87, "num_comments": 15, "comments": [{"body": "Bought in when it was $30 last year, holding 64 shares wish I bought way more\n\nEdit: credit to my wife for telling me to buy the day penn bought part of barstool, she bought way more than me", "score": 18, "replies": [{"body": "Possible big money play:\n\nCall option yolo for $125 strike 4/16 exp, \n\nsell at market close 4/2 🤷‍♂️", "score": 11, "replies": []}, {"body": "Credit to this guys girlfriend’s boyfriend for likely wearing a “One Bite Pizza” t-shirt while he’s fucking this guys wife, hence why she’s so enthusiastic about this stock.", "score": 6, "replies": []}]}, {"body": "Friday will be a big day!", "score": 6, "replies": []}, {"body": "$DKNG in the same boat at almost half the price.", "score": 18, "replies": [{"body": "Half the $$ price, but DKNG has a 30% larger market cap.", "score": 12, "replies": []}, {"body": "True, but I just got dicked on the Riot and Mara situation cause Mara just straight up didn’t perform as well and I chose to go the cheaper route.", "score": 5, "replies": []}, {"body": "Price isn’t relevant when comparing companies,you need to use market cap, come on man", "score": 2, "replies": []}, {"body": "DKNG ER Friday, my calls are in shambles.", "score": 1, "replies": []}]}, {"body": "Agree, but $DKNG has way more upside here.", "score": 3, "replies": []}, {"body": "$PENN has made Dank Gains for my actual retirement account that it's too expensive to really buy more of it. \n\nI am tempted to go for that $125 4/16 call with my Gambling Account, but good god those are expensive.", "score": 1, "replies": []}, {"body": "Isn't the market closed on 4/2?", "score": 1, "replies": []}, {"body": "Rumors amiss of barstool opening their online sportsbook in Illinois this week.  Nice timing for those 125 calls.  Right before March madness is to start...gonna be big.  \n\n1000 @115", "score": 1, "replies": [{"body": "Update: averaged down to 109 x1300\n\nTime to start selling covered calls for couple g’s a week.", "score": 1, "replies": []}]}]}
