{"title": "Betting on Oil, Gas, and Economic Growth", "selftext": "So, this is my first DD post.  Hopefully I do it right, and I'm sure if I don't, ya'll let me know in the comments.\n\nBasically, I'm placing a big bet on Oil going up, and on US Gasoline prices going up.  The two are related, but not the same.\n\nFirst, the Oil bet.  Oil prices generally go up when economic activity goes up, it's used for cars, boats, planes, power generation, and a bunch of other stuff like making plastic.  Oil is also a very price inelastic commodity, either you need it or you don't, and it takes a big swing in the price to make you change your mind.  This means excesses and shortages can have outsize influence on the price - for example, the price of oil going negative last year for a little bit.\n\nThe pandemic is ending because vaccines are going out to people like crazy, and once people get them, everybody wants to go out and do everything they haven't been able to do for a year and change now.  Yeah, there are new variants, and yeah, Europe and India just got hit with new lockdowns, but those aren't going to last, and the vaccine factories are running full tilt.  Even before vaccines when we had the Spanish Flu in 1918, the thing burned itself out after a year.  Also, we're getting into the summer months, which means more sunlight and heat, and people being outside, all of which are bad for COVID.  Anybody remember how case counts drastically dropped last summer?  Now combine that same drop plus all the people who've had it or are vaccinated.\n\nThis summer the developed world is going to see a spike of economic growth like it hasn't seen since the end of WWII.  2nd and 3rd quarter growth projections are as high as 8% in some forecasts, know what we're going to need to power that kind of growth?  Oil.  For ships to move all those goods from China and Vietnam and Taiwan to America.  For ships to move empty containers back to China.  For airplanes to handle massive increases in air freight because we already have a huge backlog in shipping.  For airplanes to move tourists to resorts and islands and to see family again.  For trucks to move all those goods from ports to stores.  For delivery vans to move all those goods from warehouses to homes.  For cars to take families out to eat or to go on vacation.  For cars for all the people who discover their boss is a dick and wants them back in the office.  For cars for all the workers who need to go back to work at restaurants and stores again.  For peak demand power plants to provide electricity for air conditioning all those buildings that are full of people during the summer. Cruise ships full of old people, you get the idea.\n\nMost analyst estimates on air travel use are based off of patterns from the air travel recovery from 9/11.  I think that's stupidly wrong because people kept getting re-scared about flying every couple months when some dumbass Saudi would get caught with shoe or underwear bombs.  The post COVID decision tree is simpler: Vaccinated?  No - stay the fuck home.  Yes - get ur ass to a beach and party.  Jet fuel usage is also going to skyrocket much faster than expected because of increased air freight due to all the supply line fuckery that's been happening, eventually, they give up on the boats and just fly that shit for 20x the price.\n\nNow for some numbers.  In March 2021, the world used 96 million barrels of oil a day.  The US EIA projects 2021 demand at 97.6 million barrels a day at an average price of $65/barrel.   That prediction is frankly asinine.  The USA alone will use more than 1.6 million barrels a day more in June than it did in March.  (for reference, last August, the EIA predicted 2021 usage of 91.1 million barrels a day, they're great at tracking production levels, predicting usage, not so much their thing)  In 2019 the world used 99.7 million barrels a day.  We're probably going noticeably over 100 mbd this summer due to pent up demand.  So, if we have a big demand surge, that means a big price surge, yeah?  It does!  But wait, there's more!\n\nYou really can't talk about oil production without talking about politics, and politics actually favor supply having trouble ramping up fast enough to meet demand.  While google says there are about 9 mbd of excess supply, there really aren't.  First, 2 mbd of that is Iranian oil waiting to be freed up by sanctions.  Pretending that oil isn't already in circulation is a polite fiction.  The Chinese and Indians buy it up by the boatload.  Another 2 mbd of oil has already been added to global supplies by the latest OPEC+ meeting reducing their quotas (1 mbd of that coming in June is from Saudi Arabia and is probably MBS's penance for murdering Kashoggi, Sleepy Joe is old enough to remember the 70's oil shock and doesn't want another one fucking up his recovery)\n\nNow, of the remaining 5 mbd, 2 mbd of that is US production that's unlikely to come back online because of changes to US regulatory stances since Biden took office.  This means that unlike in 2014 to 2019 where the USA was the swing supplier, we don't have millions of barrels of capacity to turn on at a moments notice.  That leaves 3 mbd, which added to the 2mbd OPEC+ has put in, plus the 96 mbd we're producing right now, means that we top out at 101 mbd of production, which basically means zero margin for error this summer, which means higher prices.\n\nNow we get into the politics.  African and Venezuelan production is dropping because of decades of mismanagement and graft, and they have a lot of trouble attracting outside expertise because of nationalizations and kidnappings in the past.  In the middle east, you've got the ongoing proxy war between KSA and Iran.  Remember a couple months ago when the Houthis hit a Saudi oil facility with drones and cruise missiles?  The Houthis are some hard as fuck nomadic desert tribesmen, but they don't have drones and cruise missiles, - the Iranians do.  At any point MBS doing something really stupid to trigger a bigger fight with the Iranians is always a strong possibility - remember this is the guy who thought up the whole \"dress a guy in Kashoggis clothes and have him walk around Turkey in front of cameras\" plot, (and thought there was no way they'd get caught because Erdogan, who hates the Saudis, would never bug their embassy, right?), smart and strategic aren't exactly his bread and butter.  Right now the Saudi's just hit India with a big rate hike on oil, and the Indians responded by buying more from Iran.  That's something to keep an eye on.\n\nAnd finally, we get to Russia.  Uncle Joe recently gave an interview where he said he told Putin to his face that he had no soul, and Putin punked out and agreed with him.  Vlad's a guy who's so obsessed with his tough guy image he fights in staged cage matches while in his 60s among numerous, numerous other stunts including deep sea diving and tigers.  The initial response was to pull the Russian ambassador from DC.  Back in the cold war that level of reaction would be a prelude to tanks massing in the Fulda Gap and everyone going to DEFCON 5, today it doesn't even rate a mention on CNN.  Vlad's going to be looking HARD for a way to fuck over Biden this summer, escalations in the middle east and Afghanistan, or fucking us on energy prices are his best options.\n\n2nd, we have the case for US gasoline.  This is similar to the case for oil, but with some added twists.  When oil goes up, so does gas, because it's made from the stuff.  Simple, right?  But there's more.  Remember that big storm in Texas that froze all the wind turbines and made puts on power companies print?  Yeah, so it also damaged the hell out of a large number of the remaining refineries in the US, and they're just finally getting fixed.  That's why US crude stocks are rising, because the refineries can't work to turn it into gas.  We've avoided a big hit to gas prices so far by bringing in all the excess gasoline from Europe (their big remaining stocks are all diesel, which even they don't really want after the VW mess), and currently we're taking all the refined oil out of Asia.  Once that excess is dried up, if the refineries take another hit, we are, in a word, fuxed.  If said refineries DO get back to working on their backlog before the world's excess supply is run through, well, guess what, we're going into post pandemic hype season, which coincides with the biggest driving season... and there are no excess supplies of refined gas available to meet demand spikes.  Know what that means?  Higher prices for drivers and tendies for us.\n\nSo, those are the bull cases, now it's time for the bad news bear cases.\n\n1. **More Pandemic.**  The Chinese fuck up and another COVID escapes from one of their labs again.  RIP worldwide recovery, RIP SPY, hello permanent lockdowns 4 life.  The hedge here is DRIP calls, VIX calls, SPXS/SPXU calls and SPY puts.\n2. **Rainbow Triumph.**  Somehow everyone manages supply vs. demand perfectly, there's no geopolitical drama and oil trades sideways at $60-65/barrel for the rest of the year.  The refineries along the gulf coast and in Texas never have any problems for the rest of the year, lots of excess driving doesn't happen and gasoline trades sideways. No real way to hedge this, you just kinda get fucked on the trade.  This scenario is incredibly unlikely, but I figure it's worth mentioning because, just like \\[exceedingly improbably event\\], it IS theoretically possible.\n3. **Too much Jed Clampett.**  Oil supply drastically overshoots demand and energy prices crater.  The hedge is DRIP calls.\n4. **Margin Call the Movie.**  There are a bunch more Bill Hwang and Archegos capitals out there and they blow up the world economy with a bet on gourd futures that contagion spreads to everything, leading to mass layoffs and killing the economy.  The hedge is DRIP calls, VIX calls, SPXS/SPXU calls, and SPY puts.\n5. **Triumph of the Apes.** I can't believe I have to list this as a serious global economic risk, but if the Apes are right, and the GME MOASS happens, a lot of hedge funds are going to go belly up, leading to the same scenario as #4.  The hedge is DRIP calls, VIX calls, and SPY puts.\n6. **Lockdown Slowdown.**  The slight upticks in new variant Corona we're seeing in India, Europe, and Japan significantly slow reopening and push the big demand surge back a couple months.  The hedge is buying calls farther out.\n7. **One Eyed Genius.**  Michael Burry is right about Weimar Republic inflation hitting this summer.  The hedge is do nothing, you're already long on commodities, which is an inflation hedge.  Go take a couple wheelbarrows of your cash and buy a loaf of bread.\n8. **2008 2.0.**  This one's kind of a wildcard nuclear bomb for the US, but it's a possibility.  At some point, currently June, the Eviction/Foreclosure moratorium will end, a LOT of properties will go on the market at once at fire sale prices, because banks and mortgage companies don't want to own houses, they want to own debt, - potentially crashing the US housing market, which is frankly super inflated/bubbly right now.  The date of the program ending probably just ends up getting kicked down the road, but if you're long on literally anything this is something to keep an eye on.  Same hedges as most of the above, go long on stuff that inverses the market.\n\nSome other random stuff I've come across while researching this:  Goldman has an $80/barrel price target for Q3.  They recently raised it from $75/barrel.  They're a bunch of lying fucks, so I actually view this as either bullish in that they're setting up their clients to get into this late, or bearish in that they're a bunch of lying fucks.\n\nJP Morgan says oil trades sideways all summer at $65-70, because of extra COVID and Iranian production coming online.  I really can't take the concept of \"extra\" Iranian oil that's being stopped by sanctions seriously.\n\nOxford also just announced they see oil trading sideways all summer, but with spikes from $54 to $75.  This is definitely possible, and why I plan to take profits aggressively until I've at least broken even on the trade.\n\nOption interest on OTM calls for a lot of the tickers I've looked at is crazy high.  Like, even higher than you'd expect if someone was just hedging a position.  There's a fair amount of sentiment and money behind the idea that oil is going up in the summer and fall.\n\nMost of the analyst types view the real pickup in oil as happening later in the year, in Q3 and Q4. I'm going with July because everything about this pandemic economic cycle has been accelerated, and I'm more looking for a temporary demand spike to cash in on than a long term investment opportunity.\n\nDon't rely on charts for past price information on anything w/regard to oil.  Every ETF that tracks oil had a reverse split last spring when oil went negative.  Also, they don't track the price directly, they track percent changes, and it's not always perfect, so if it trades sideways they can drop, and if it runs they can outgain it or underperform it, depending.\n\nUPDATE: I wrote this over a week and a half, and since I started it, the Houthi's have hit another Saudi facility, Russia massed troops on Ukraine's border, China is starting a fight with the Philippines, Israel hit Iran's nuclear facility (sabotage, not aircraft) and JNJ Vaccine got suspended in the US.  Gonna be a wild summer.  Everyone is pent up and pissed off from lockdowns.  Take advantage of spikes and dips.\n\nOk so here's some tickers for you to throw money at:\n\nFor Oil we've got **BNO** \\- which tracks Brent Crude, **DBO** \\- which tracks WTI, **USO** \\- which tracks WTI and some gasoline and heating oils and other fuels in the US, and **GUSH** \\- which is a leveraged fund that tracks oil and gas.\n\nFor Gasoline we've got **UGA** \\- which tracks US gasoline prices.\n\nUGA is the biggest profit making ticker here.  It hasn't ever had any kind of split, reverse or otherwise, so you can use charts on it, and the last time gas was over $3, it was running in the $50-$60 range.  Right now it's at $31, and July and Oct $40+ calls are pennies.  Open interest on these is in the thousands.  If gas goes over $4/gallon, look out above.  Currently the spot price for gas is just under $2.  (note, the price of gas we're talking about here is NOT what you're paying at the corner station)\n\nTo help everyone out with price targets, here are my (guesstimated, I made these projections myself, don't trust them, they're what I used to decide where to put money, and I'm down overall on the year)\n\nBrent Price        BNO Price         WTI Price      DBO Price        USO Price\n\n65                        16.50                  65                  11.60                 44.50\n\n70                        17.60                  70                  12.60                 48.10\n\n75                        18.90                  75                  13.55                 51.40\n\n80                        20.15                  80                  14.25                 54.70\n\n90                        22.75                  90                  16.15                 61.45\n\n100                     25.20                  100                 18.00                 68.50\n\nAgain, these aren't perfect, they're rough guidelines/guesstimates, emphasis on the guess, I made them using the calculator on my phone.  It's not science.\n\nMy positions, their cost basis, and what I'll make at various price points (I've been building some of these for awhile, so my costs may not reflect current market prices):\n\n**Bull positions:**\n\n*BNO* Calls                                *DBO* Calls                        *USO* Calls\n\n10x  7/16 17c (1.05)               10x  7/16 11c (0.65)       5x  7/16 43c (2.07)\n\n10x  7/16 18c  (0.45)                                                        5x  7/16 45c (1.35)\n\n\n\n*GUSH* Calls                             *UGA* Calls\n\n4x   9/17 130c (2.3)                5x   7/16 35c (1.18)\n\n20x    7/16 40c (0.44)\n\n**Bear Positions:**\n\n*DRIP* Calls                             *UVXY* Calls                          *SPXS* Calls\n\n1x 9/17 20c (1.30)                2x 6/18 7c (0.70)                3x 7/16 40c (1.20)\n\nI'll be adding to these positions until the end of April when I close out most of my remaining positions or until Oil goes over $65, whichever comes first.  Probably adding some DBO 12c's, and some 10/15 UGA 40c's.  Might switch it up.  I'll post updates at the start of every month.\n\nWhen it comes to exit strategy, I'll be paperhanding the fuck out of stuff as prices rise until I'm even on what I've put in here.  Especially on the more OTM calls.  After that I'm looking for temporary spikes between $80 and $100 to unload.\n\nTL;DR:  Motherfuckers want to get the fuck outta the house and go spend like drunken sailors, that means more monkeys burn black gogo juice, price go up, cost more bananas\n\nThis is a semi-risky play, you'll notice I spent 10% of my total on positions I expect to never pay out as insurance. Do your own research, make your own decisions, may the tendie gods bless you all with chocky milk and pizza.", "id": "mqe5mt", "created_utc": 1618356168.0, "score": 163, "upvote_ratio": 0.89, "num_comments": 98, "comments": [{"body": "Hmm you forgot the best index XLE", "score": 22, "replies": [{"body": "^This. I’m long on XLE calls for energy recovery.", "score": 12, "replies": [{"body": "I don’t see any clear path to oil prices dramatically going up. All business travel will remain down possibly forever. Cruise ships not sailing any time soon. There are much more exciting investments than oil.", "score": -4, "replies": [{"body": "What percentage of Oil and Gas do you think cruises and jet planes account for?", "score": 1, "replies": []}]}, {"body": "I have xlc and xly. What does going long mean. In liking the xle etf. I have uso.", "score": 1, "replies": []}]}]}, {"body": "Not to mention more people going to restaurants means more French Fries oil.", "score": 42, "replies": [{"body": "I only drink crayon smoothies", "score": 6, "replies": []}, {"body": "I think I get takeout as much if not more than I used to go out to eat. Idk if there will be that big of an increase.", "score": 2, "replies": []}, {"body": "m hmm crude french fries", "score": 1, "replies": []}]}, {"body": "Yo Op ur crazy writer. I salute ur hairy ass for this DD\nKeep it up bro.\nGood luck to you.", "score": 18, "replies": [{"body": "Samesies", "score": 3, "replies": []}]}, {"body": "I don’t know what I’m more impressed with, your DD or myself for reading all of it. Thanks OP! \n\nI have lots of SU calls. I think I will hedge with DRIP now.", "score": 10, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "I always hear holding leveraged funds is not the way.   I’m interested in GUSH tho.  Care to help a newbie out?", "score": 1, "replies": [{"body": "Leveraged fund have disproportionate downside risk because % multiplier.\n\nUnderlying $100 loses $1, now $99\nThe 3x leveraged loses 3%, or 100 -> 97\n\nNow underlying back up $1. Underlying back at 100\n1/99 = 1.01%\nLeveraged goes up 3.03%, or 97 -> 99.93\n\nDespite the underlying stock being at the same place, the leveraged has lost money.\n\n\nThat said, leveraged can make sense if you are confident about catching the up and not the down. But if we could do that reliably, we'd all be trillionaires.", "score": 4, "replies": []}, {"body": "Stay away from it!!! Bad deal", "score": 3, "replies": []}]}]}, {"body": "XOM Jan 2022 60c", "score": 8, "replies": [{"body": "I’m holding XOM 60c for July.   Down over 50 %.  Trying to decide if I should average down or just let it do it’s thing", "score": 3, "replies": []}, {"body": "Cost?", "score": 1, "replies": []}]}, {"body": "Thank you! FYI my 88 year old father is obsessed with gas prices for some reason. When I came to visit him today and drove him to get a bacon cheeseburger he made note that prices within 5 miles of his house  in NW Louisiana have actually fallen to $2.37 which is about 15 cents down in the last couple of weeks. I thought that it would be near $3 around here by now but...nope! 🤷🏼‍♂️\nGreat research and DD. Thanks for the update on the global situation!  Good luck!", "score": 7, "replies": []}, {"body": "Odds my $67 5/21 gush calls will print?", "score": 5, "replies": [{"body": "They 100% will or 100% won’t.", "score": 10, "replies": [{"body": "Whoa, Nostradamus! Save some predictions for the rest of us", "score": 4, "replies": []}]}]}, {"body": "XOM?", "score": 6, "replies": [{"body": "CVX is in better shape", "score": 1, "replies": [{"body": "Price for cvx is high already XOM has more room to run", "score": 5, "replies": [{"body": "Cpe", "score": 1, "replies": []}, {"body": "That's amazing news! I have uso but also lots of XOM. Was gonna wait until dividend payout next week to decide what to do.", "score": 1, "replies": []}]}]}]}, {"body": "Your late to the party. Pool already had it's big adjustment and now will coil for the next year or so. If they adjust supply and if we go to war then yes oil goes uppie. But on the hence that this year will be a big boom for oil due to pinned up demand... Oil already did that.", "score": 4, "replies": []}, {"body": "Best bet on economic recovery is to hit what hasnt anywhere near recovered yet.....\n\nTldr:\n\nI’m 13,422 shares balls deep in RYCEY, once them planes get rockin this summer, or by the next summer at the latest, ill be buying a house.... in cash. 💰", "score": 5, "replies": []}, {"body": "Great post, OP. The sub could use about 50 more of these threads rather than GME go brrrr stuff. \n\nI'm really worried about the whole global economy going pop, but you aren't going to get me to bet against gas increasing in the near term. I think I'll put a couple hundred into this and paper hand the shit out of it by fall.", "score": 6, "replies": [{"body": "I think they injected too much money for the bubble to pop. Idk tho", "score": 1, "replies": []}]}, {"body": "This is intelligent and very well written. 🚀", "score": 4, "replies": []}, {"body": "I think European oil recovery has even more upside, I am playing it through LEAPS on BP and RDSB which are relatively inexpensive.", "score": 4, "replies": [{"body": "This\n\nBP leaps literally whenever", "score": 4, "replies": [{"body": "BP looks like the spy not knowing if it wants to be 411.1 or 411.3 for the last month", "score": 3, "replies": []}, {"body": "Huh?", "score": 1, "replies": []}]}, {"body": "100 25$c 7/16\n2000 35$c 7/16 \nFuck it. BP BABY", "score": 1, "replies": []}, {"body": "I'm all in on RDSB. It's basically still half price right now because of COVID, if you want some medium term profits, but their EV charging plans also give them a nice long term upside.", "score": 1, "replies": []}]}, {"body": "Big thing to consider is OPEC, they’ll ramp production the second prices start going up which keeps prices low. Also energy has already seen a sizable uptick to fairish levels (at least on production). Onshore natural gas with a cost advantage may still be plausible and distribution still could have room. I just wouldn’t bet on overall oil prices rising regardless of economic and pandemic recovery due to oversupply not ending anytime soon. Also China stockpiled a fuck ton pre pandemic and they’re the largest buyer in the world thus demand will be effected near term with EV adoption hindering long term. Good luck tho I could be very wrong", "score": 5, "replies": []}, {"body": "Finally some fucking well-written thorough DD again - back to the roots for WSB, fuck boring GME.", "score": 9, "replies": []}, {"body": "Very thought out DD.  Good luck my friend!!!", "score": 3, "replies": []}, {"body": "If you’re bullish on oil (I am) look at UCO along with USO.", "score": 3, "replies": []}, {"body": "If you are big on oil, the best index is NRGU", "score": 2, "replies": []}, {"body": "Mention of elasticity - this man took Econ 101 I’m in", "score": 2, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**USO**|**$17**|**BUY CALL**|**2021-07-16**|**$24.5**|**$41.4**|**0**|**0**\n|**USO**|**$43**|**BUY CALL**|**2021-07-16**|**$2.02**|**$41.4**|**902**|**7**\n|**USO**|**$18**|**BUY CALL**|**2021-07-16**|**$23.48**|**$41.4**|**0**|**0**\n|**USO**|**$45**|**BUY CALL**|**2021-07-16**|**$1.29**|**$41.4**|**7906**|**57**\n|**UGA**|**$35**|**BUY CALL**|**2021-07-16**|**$1.1**|**$31.77**|**666**|**9**\n|**UGA**|**$40**|**BUY CALL**|**2021-07-16**|**$0.3**|**$31.77**|**1349**|**23**\n|**SPXS**|**$20**|**BUY CALL**|**2021-09-17**|**$0.08**|**$27.65**|**557**|**0**\n|**SPXS**|**$7**|**BUY CALL**|**2021-06-18**|**$0.03**|**$27.65**|**2376**|**0**\n|**SPXS**|**$40**|**BUY CALL**|**2021-07-16**|**$1.02**|**$27.65**|**71**|**8**\n\n[Realtime ROI](https://www.pickmojo.com/pick/cknh2s6fv7ctl0722qji6be71) | [Track Record](https://www.pickmojo.com/user/catbulliesdog/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 2, "replies": [{"body": "UGA near 3 year high that’s wild", "score": 1, "replies": []}]}, {"body": "XOM leaps checking in", "score": 2, "replies": []}, {"body": "This confirms my bias and my portfolio\n\n&#x200B;\n\nEDIT: Also energy sector hit the 50-day moving average, which also confirms my portfolio", "score": 2, "replies": []}, {"body": "Don’t love your positions or oil... but my dislike for EV’s and green energy is even more.", "score": 3, "replies": [{"body": "You dislike green energy stocks or just green energy in general?", "score": 2, "replies": []}, {"body": "Same here. But the tables might turn again in favour of EVs", "score": 1, "replies": [{"body": "Amtrak Joe will not be kind to oil barons", "score": 2, "replies": [{"body": "Finally someone who sees it.\n\nI expect a post covid boom, but like a wet blanket new regulations, new taxes, inflation, and subsidies to green energy will shut the growth engine off.  Just have to listen to the promises and proposals to see this train wreck on the horizon.", "score": 1, "replies": [{"body": "Yeah I see it and I fuckin love it\n\nCoal plants and no regulations are a good way to keep people employed and sick. Solar farms run themselves and walkable cities reduce gas demand, if that slows your precious growth engine fine", "score": 2, "replies": [{"body": "Not against green, but it will require a healthy economy to fund its R&D and construction.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Zoom out all the way to like 1990 and you’ll see the bubble. Don’t know when but it will crash harder than 08 be ready", "score": 2, "replies": []}, {"body": "I didn’t know what to do so I bought BRK-B leaps 6 months ago. Let me know if Buffet gets it past $300 by March 2022, I got some spare change riding on it.", "score": 1, "replies": []}, {"body": "Abiotic Oil Theory is the reason why I'm bullish on oil!\n\nhttps://phys.org/news/2019-04-rewriting-textbook-fossil-fuels-technologies.html", "score": 1, "replies": []}, {"body": "Too many fucking words! Brain hurt! Ape Smash!", "score": -4, "replies": []}, {"body": "You really like writing. Retarded ape writer", "score": -2, "replies": []}, {"body": "Too many words. No icons. Buying more GME.", "score": -7, "replies": []}, {"body": "Great DD. A lot to think about and watch in the coming months. \nDefinitely going to be looking for long call positions. Thanks for the info/opinion.", "score": 1, "replies": []}, {"body": "You have any opinion on TELL?", "score": 1, "replies": []}, {"body": "I know what I must do, but I am not sure if I have the attention span to do it", "score": 1, "replies": []}, {"body": "I bought a fuckton of GUSH leaps back when it was in the low $20s.  Feels super weird to be holding leaps on a leveraged etf but it has been my biggest money maker this year. I'm also holding 100 shares that I bought at $31 and have been selling CCs against them... \n\nI don't think it will get back to it's pre-pandemic price anytime over the next couple years but when you zoom out to look at it's chart over the last 10 years you can see the insanely massive upside potential this one has.  \n\nAnother leveraged oil/energy etf I was playing for a bit was ERX.  That one moves slower than gush but it did me right until a couple months ago.... \n\nIndividual companies that I like to trade are RDS.B (shell) and PSX (phillips 66).  I tried with some of the other big oil names (BP and exxon mobil) but those didn't work out so well.\n\nOil isn't going anywhere for awhile, even with this push towards green energy, and I'm betting that it will be back to pre-pandemic prices by or before summer 2023...", "score": 1, "replies": []}, {"body": "This is an incredible write up. The amount of research and macro trends that you alluded to is impressive. Thank you for taking the time.", "score": 1, "replies": []}, {"body": "DEFCON 5 the threat was low or at peace.  You probably meant 1 or 2\n\nthanks for the write up", "score": 1, "replies": []}, {"body": "How do you guys feel about VVV? I've got a few Jul 21 calls. Looking to buy more since it seems pretty undervalued and there was a big change in open interest recently.", "score": 1, "replies": []}, {"body": "Great DD!", "score": 1, "replies": []}, {"body": "How about APA?", "score": 1, "replies": []}, {"body": "TLDR; I give this a 1 full Shepard Smith watch.   \n[https://www.youtube.com/watch?v=XB3FMTFNgcg](https://www.youtube.com/watch?v=XB3FMTFNgcg)", "score": 1, "replies": []}, {"body": "Issue I have with oil is Iran dumping their barrel with price lower 4$-5$ than brent, with conflict in the middle east other countries will try to sell as much to cover their military spending. Though in a Refinitv report they said iranian oil did eat more from brazilian and angola market share and didn't impact the brent or WTI. \n\nSo I hope you're right as I am also betting on an oil uptick with my small position $OXY shares 500@25.22 with 5x leverage", "score": 1, "replies": []}, {"body": "Checking in with BP leaps and shares, been adding to my position the last couple weeks.", "score": 1, "replies": []}, {"body": "If the pandemic is ending, there there are much better stocks to buy than Oil Sector", "score": 1, "replies": []}, {"body": "I might be wrong but Most of those companies got further indebted due to the pandemic, or worse, had to sell assets. I think they haven't gone to previous levels because the base is just smaller, despite oil in the 60's. And according to most experts oil is projected to stay at around 60 for a while.", "score": 1, "replies": []}, {"body": "I have USO ETF and shares of Exon XOM. Any advice would be appreciated!", "score": 1, "replies": [{"body": "Sell at a profit when you're happy with your gains.", "score": 2, "replies": []}]}, {"body": "not sure what I just read but I know I believe it", "score": 1, "replies": [{"body": "Thanks.  I've actually liquidated all my positions at about 2-3x profit now and am all in on GME.  Pretty sure everything is going to shit here in the next month or so, but after that could be a good time to buy in, oil should work as an inflation hedge at the minimum.\n\nGood luck!", "score": 1, "replies": []}]}]}
