{"title": "Best fintech stocks to invest in?", "selftext": "I have recently started researching fintechs and wanted to get some advice on where to look. Many people on here have said PayPal, Square, and Paysafe. Does anyone know if these will bring good returns in the long term?", "id": "mvwape", "created_utc": 1619061910.0, "score": 25, "upvote_ratio": 0.78, "num_comments": 100, "comments": [{"body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22Rate+My+Portfolio%22+-+r%2FStocks+Quarterly+Thread&restrict_sr=on&include_over_18=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Probably Ethereum..", "score": 13, "replies": []}, {"body": "Sq", "score": 30, "replies": []}, {"body": "It may be seen as overpriced right now, but I believe Sea Limited will be huge in the future.", "score": 18, "replies": [{"body": "What’s your definition of huge?", "score": 3, "replies": [{"body": "I'm not going to throw around numbers as if I know all about their fundamentals, because honestly I don't, but the company has 3 different sectors: fintech, ecommerce and gaming. I believe they'll do well in the future based on that. They'll expanding in all three segments and the Southeast Asian region they're based out of is an emerging market for both online payment and cashless platforms.", "score": 7, "replies": [{"body": "You son of a bitch, I’m in!", "score": 7, "replies": []}]}]}, {"body": "I saw similar comments about it a year ago on this sub and got in because I felt the same but a year later and it's already where I thought it would be in 4-5 years so personally, I don't know if it's the best investment anymore for someone getting in the first time", "score": 1, "replies": [{"body": "I see what you mean. I plan on holding for many years, so I wouldn't mind buying right now, but I could definitely see it dipping again. If OP waits a bit before buying, I would agree with his decision. 2020 made a lot of stocks overpriced. I DCA when it goes below what I bought it at.", "score": 1, "replies": []}]}, {"body": "Oof.", "score": 1, "replies": [{"body": "Yeah, luckily I sold most before the big drop. I’ve stopped giving advice and started doing more research since.", "score": 1, "replies": []}]}]}, {"body": "another vote for IPOE ---> SoFi", "score": 38, "replies": []}, {"body": "SOFi via the symbol IPOE.\n\nEverything else is overpriced.", "score": 24, "replies": [{"body": "I will definitely check it out. Do you really think it has more potential than paysafe which is a similar price?", "score": 3, "replies": [{"body": "I never heard of Paysafe until your post today. I’ve been a customer of PayPal for more than a decade and have used Square many times during the same period. \n\nAs due diligence, I looked up paysafe on the App Store. It is rated 3/5 stars, and only has 28 reviews to go by. \n\nComparatively, SOFI (IPOE) has 74K reviews and 5 stars. I’ve also been a happy User for more than a year now. \n\nMy advice for you prior to buying any stock, is to check out the product itself to see if you would vouch for the product yourself.", "score": 12, "replies": [{"body": "Paysafe is not yet well known in the US. Even though it works with 75% of US iGaming operators, it is more of a back-end payment processor on that front.  Trustpilot  in Europe (where more commonly used) rates Paysafe as  “Excellent”  (4.7/5 stars) with over 24,000 reviews, and Skrill as  “great” (4.2/5  stars) with over 17,000 reviews, while PayPal is rated  \"poor\" (1.2/5  stars) with over 17,000 reviews.", "score": 14, "replies": []}, {"body": "When is the vote for the merger or if that has already happened when is the merger date?", "score": 2, "replies": [{"body": "Soon, so time to re-up on Calls. \n\nThe merger date has not yet been disclosed. As a User of the app, they sent us an email on 3/22/2021:\n\nWe are following up on the letter below that we sent you on March 3, 2021, describing the anticipated public offering regarding Social Finance Inc. As a reminder, if you take no action and continue to use our services, you will be deemed to have consented to the ownership change and assignment, and your accounts will remain with us following the closing of the Transaction, which we hope to be on or about April 9, 2021. \n\nSincerely, \nJohn Gardner, \nGM, SoFi Invest\n\n\nEDIT: \nHere is the top part of the first email they sent:\n\nYou are getting this letter because of the anticipated public offering of Social Finance, Inc. When this happens a change of control of SoFi Wealth LLC, with whom you are a customer, will occur but your experience will not change. The account management, management fees, service, and oversight will all remain unchanged. If you do not consent to this behind the scenes change related to our public offering, you can let us know within 30 days. \n\nSummary: \nThis communication concerns the anticipated public offering regarding Social Finance, Inc. (the “Company”). The Company is a leading next-generation financial services platform, and has entered into a definitive agreement with Social Capital Hedosophia Holdings Corp. V (“SCH”) (NYSE: IPOE), a publicly traded special purpose acquisition company, to bring the major consumer-focused financial technology business to the public markets (the “Transaction”). A link to the Press Release is: \nhttps://www.sofi.com/press/sofi-plans-to-go-public. In connection with the anticipated offering, a registration statement has been filed with the Securities and Exchange Commission (“SEC”) and is currently under SEC review. There are no assurances when or if the SEC will make the registration effective. We hope, however, that the Transaction will close on or about April 9, 2021. \n\nThe Transaction will result in a change of control of SoFi Wealth LLC and an “assignment,” as that term is used in the Investment Advisers Act of 1940 and in your investment advisory agreement (your “Customer Agreement” or “SoFi Wealth Advisory Agreement, or “Financial Planning Agreement” or “Digital Advice Agreement” as applicable, and, together, “Agreement”) with us. In accordance with your Agreement, we are requesting your consent to this assignment in order to allow us to continue providing services to you following consummation of the Transaction.", "score": 2, "replies": [{"body": "Is it a concern that 4/9 came and went without any news since?", "score": 2, "replies": [{"body": "It’s dropped a significant amount the past few weeks.", "score": 2, "replies": [{"body": "SPACs have been slaughtered as a whole. I still think this is one of the better ones. They actually earn revenue unlike some SPAC companies. TBD if they will be profitable. I think they will.", "score": 1, "replies": []}]}, {"body": "SPAC scrutiny by the SEC is one possible reason for the delay. They also just bought a small bank which might also have some impact. Deal should close in Q2.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "That is correct. They released the updated date.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Heck yea! I just bought some IPOE warrants for the first time via IPOE-WT. I’m also hoping the stock itself goes back to 16 so I can re-up.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Here's some DD on the bear case for Paysafe:\n\n[https://www.reddit.com/r/SPACs/comments/mw9loa/reviewing\\_the\\_bear\\_case\\_on\\_paysafe\\_psfe/](https://www.reddit.com/r/SPACs/comments/mw9loa/reviewing_the_bear_case_on_paysafe_psfe/)", "score": 2, "replies": []}]}]}, {"body": "Cant believe that’s the actual ticker symbol.", "score": 1, "replies": [{"body": "Pretty sure that’s the spac it’s merging with i would assume a new ticker once the merge happens", "score": 4, "replies": []}, {"body": "IPOE is the SPAC that is taking SoFi public. After the merger is finished, the ticker will change to SOFI.", "score": 3, "replies": [{"body": "If you buy IPOE now do you get your shares converted to the new ticker?", "score": 2, "replies": [{"body": "Yes, it will automatically change to SOFI after the merger is completed.", "score": 3, "replies": []}]}]}]}]}, {"body": "$PSFE is the best deal you’ll get right now.", "score": 4, "replies": [{"body": "Agreed. 12 months and this will be far more well known. Good time to get in imo while the SPAC association keeps the price down.", "score": 2, "replies": []}, {"body": "-70% YTD. Ouch.", "score": 2, "replies": [{"body": ">PSFE\n\nAnd a further -62% YTD fall for 2022!\n\n&#x200B;\n\nI was researching fintech on reddit, that's why I'm here now.", "score": 1, "replies": []}]}]}, {"body": "SQ is my top position now, I find their software that being cash app better to use than PYPL although I also own PYPL lol. SQ is also dominating with their hardware helping out small businesses. As far as their valuation goes, they peaked before 2020 in 2018 at a PS ratio of 14 and a stock price of 99$, now in April 2021 they have a PS ratio of 12 and a stock price of 244$. Short term it could possibly come down to a PS ratio of 9 which is what it traded at in 2019, which would be a stock price of around 180 I think, but I don’t see much downside long term, only possible downside is competition but I’ve tried out other platforms and I just think cash app is a lot better, it’s the easiest to use and it’s everything in one.", "score": 8, "replies": [{"body": "Same here, I also think it's a good sign they're focussing on crypto adoption. Even if it never really blows up it at least shows the company is forward-thinking", "score": 2, "replies": [{"body": "You can buy crypto on both cash app and PayPal so I think both are forward thinking but you can also buy stocks on cash app", "score": 1, "replies": []}]}]}, {"body": "ARKF. Cathie’s ETF that tracks all fintech. I dont like the fees though:) I prefer payment processors and old school banks trying to reinvent themselves. V, GS, JPM", "score": 7, "replies": [{"body": "Check out out the IYG etf. It has a good mix of banks and fintech.", "score": 2, "replies": []}, {"body": "Right? I think that's a safer/saner bet.", "score": 1, "replies": [{"body": "Yes. Valued properly and huge upside if they can capitalize on their brand and attract talent to get into new areas.", "score": 2, "replies": []}]}, {"body": "JPM CEO has already said they may deploy their cash to aquire fintech assets", "score": 1, "replies": [{"body": "they should have never let coinbase, square, paypal happen. a bit too late, but i hope they succeed!", "score": 1, "replies": []}]}]}, {"body": "tigr bro", "score": 4, "replies": []}, {"body": "Fintech is speculative/growth AF. They're literally trying to reimagine banking! The returns have been amazing over the past few years. Who's to say they'll win? Square has a P/E of 554 right now. Paypal is 74. Paysafe is, I don't know it... Do you due diligence. For example, I'm long $UBS because I don't really like expensive stocks and prefer boring banking...  Good luck!", "score": 11, "replies": [{"body": "P/E highly irrelevant when growing 20-30-40% per year.\n\nEarnings growth or even PEG are better value indicators, but I think you know that.\n\nAt these growth rates plus accelerated conversion to decentralised finance PayPal is a trillion dollar business long before 2030, think about that.\n\nUSA is so far down on digital payments it isn’t even funny and most of Europe is even worse! \n\nAs an opposing example Sweden is expected to be cashless in 2023. If PayPal would follow that development and we apply that globally... we’re not talking one trillion.", "score": 7, "replies": [{"body": "Cant wait for Klarna to IPO", "score": 1, "replies": []}]}]}, {"body": "I really love iPoe also.", "score": 11, "replies": []}, {"body": "On this note, anyone got Fintech ETFs they like?", "score": 3, "replies": [{"body": "IPAY is the best according to my personal research.", "score": 2, "replies": []}, {"body": "ill be the one to simp for Cathie. ARKF.", "score": 3, "replies": []}, {"body": "FINX", "score": 1, "replies": []}]}, {"body": "PayPal and Square are good companies, but have very high P/E ratios. Especially SQ.\n\nI'm partial to established companies at reasonable valuations and a bit of a broken record, so have you considered Discover Financial ($DFS)?\n\nThey cover payment processing, online banking and loans, they have a partnership for BNPL, and they're working on a crypto strategy currently. They're also much more profitable than SQ and have similar financials to PYPL in a typical year, but with a market cap about 1/4th the size of the former and 1/10th the size of the latter.", "score": 3, "replies": [{"body": "What is their crypto strategy?", "score": 1, "replies": [{"body": "Unfortunately they haven't announced one yet, they've just said they're working on it. Discover is an exceptionally well-run company though and tends to have pretty good tech so I have confidence they'll come up with something good.", "score": 1, "replies": []}]}]}, {"body": "Buy FTOC, it's merging with Payoneer soon. It's currently at NAV, so you're almost guaranteed that the SP won't drop below 10 and so you have nothing to lose. It will likely rise closer to the merger and might get to \\~$17 if we're lucky", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It's unknown, but statistically it should happen in June/July", "score": 1, "replies": []}]}]}, {"body": "UP FINTECH has a lot of potential...", "score": 3, "replies": []}, {"body": "The tried and true, the microsoft of Fintech, the OG, standing at 6 feet 195 pounds of pure transactional muscle. Paypal.", "score": 3, "replies": [{"body": "If I had to pick one PayPal would be it. \nAs a consumer I’m both familiar and comfortable with it. \nAlso, as a consumer I have no reason to switch and I don’t believe I ever will. \nI’ve tried a couple other ones because they’re what my friends have but they were both dumb. \nVenmo wants to be a social media platform or something, no, I’m good. \nRegular ass PP does everything I want it to do.", "score": 1, "replies": [{"body": "PayPal owns venmo.", "score": 2, "replies": [{"body": "Venmo still sucks", "score": 2, "replies": [{"body": "Agreed lol", "score": 2, "replies": []}]}]}]}]}, {"body": "Check out $MOGO\n\nSmall cap, Canadian fintech co. Was briefly mentioned in ARK’s 2021 Big Ideas in regards to Digital Wallets. \n\nParallel to CashApp.", "score": 5, "replies": [{"body": "It's actually one of my favorites...pretty unknown. The price just got pushed down a large amount early this week. It was the price I found it a a few months back. It's a long term hold for me.", "score": 2, "replies": [{"body": "Under 8 is a fantastic deal and gets snapped up instantly. And premiums on their options aren't bad either.", "score": 2, "replies": []}, {"body": "Agreed!\n\nI took these past couple weeks during the beat down to really increase my position as much as I could. Tripled my holdings now and plan to add more once one of my plays free up some money and if the price is still sub $9-10.", "score": 2, "replies": [{"body": "Yeah anything in the single digits is a buy for me. At this point it's 2.5% on my total portfolio so I'm at my limit really. Only bought a bit on this last dip. I should have probably went in more.  But this is really one of my first small cap finds that's I've done with my own DD and I don't want to move in too heavy. I also like that they own some Bitcoin like SQ....I see it as a less risky play into Bitcoin.", "score": 1, "replies": []}]}]}]}, {"body": "Paysafe is by far my favorite, especially if you're looking to hold for at least year. Everything else is over-valued imo, while Paysafe is extremely undervalued right now because it's been labeled as a SPAC.  First audited earnings are coming out May 11th which will be a positive catalyst.  You can read fairly comprehensive DD here:\n\n[https://www.reddit.com/r/investing/comments/mquayi/updated\\_paysafe\\_dd\\_medium\\_to\\_long\\_term\\_hold/](https://www.reddit.com/r/investing/comments/mquayi/updated_paysafe_dd_medium_to_long_term_hold/)", "score": 6, "replies": []}, {"body": "SoFI", "score": 5, "replies": []}, {"body": "STNE. Brazilian square and 90 PE. Brazil has very low fintech penetration, very large TAM", "score": 2, "replies": []}, {"body": "Bit of a niche one but LendingTree $TREE is quite cheap at the moment. I've owned some around the $220 mark, they're gonna do quite well post pandemic.", "score": 2, "replies": []}, {"body": "MOGO, IPOE, FTOC (this is one is Payoneer, right?)", "score": 2, "replies": []}, {"body": "I love square. I owned SQ itself, multiple ark funds that include SQ, and BLOK which includes SQ. Everyone loves SQ. They have also acquired Tidal, a music streaming service, which is going to add all new subscribers, revenue. PayPal is also ever expanding, but I think SQ is where the most profits will be seen.", "score": 2, "replies": []}, {"body": "Square, Paypal, and Zillow are the highest allocated fintech positions in my portfolio. Lesser allocated/riskier positions I hold are Lemonade, Upstart, Draftkings, and Silvergate (SI).", "score": 2, "replies": []}, {"body": "I own all three.\n\nPSFE is under the radar at the moment but it won't stay that way for long.  Now that they're public investors and analysis will catch on to the growth story pretty soon.\n\nThe other two are just no-brainers as the two big dogs.", "score": 2, "replies": []}, {"body": "Fisv", "score": 2, "replies": []}, {"body": "I’ve been watching UPST as one I’m interested in that I think has good potential. Supplies machine learning lending software to smaller banks to improve their loans. Very volatile right now but a lot of potential. I haven’t pulled the trigger but am a pretty conservative investor.\n\nEdit: Smart people in this space whose decisions I trust also advocate for SoFi. I just won’t touch SPACs right now so my bias working against me. Also don’t trust Chamath haha. But SoFi keeps coming up as a quality one to look at.", "score": 3, "replies": [{"body": "I love Upstart (UPST). One of my biggest holdings. Cuban, Benioff and Schmidt are early investors:\n\nhttps://venturebeat.com/2019/04/08/upstart-raises-50-million-and-partners-with-banks-to-expand-its-ai-lending-business/", "score": 2, "replies": []}]}, {"body": "Checkout affirm holding AFRM", "score": 2, "replies": []}, {"body": "People really sleep on COIN. They have two apps on the store. Coinbase Wallet is the most widely used multi-chain crypto wallet. The other is the Coinbase app itself which has the biggest Western install base after Square. More importantly, the Coinbase app lets you send money to anyone. It's a bank account that acts like a wallet. Coinbase is a fintech with a huge user base and their move into banking services shouldn't come as a surprise to anyone.", "score": -2, "replies": [{"body": "I am with ya! Love COIN long term!", "score": 2, "replies": []}, {"body": "A lot of their revenue is built on fees from transactions so what happens when every other company in that space waives transaction fees? Who in their right mind would use Coinbase then? HARD Pass", "score": 1, "replies": [{"body": "Did you know Nasdaq charges transaction fees? At some level, someone is always paying.\n\nThe question isn't what happens when they lose 100% of their transaction fees, it's what happens when they lose 80%. It's not going to 0, and if the crypto market expands, 5x volume isn't a big obstacle.", "score": 1, "replies": []}]}]}, {"body": "Adyen. Growing like crazy and profitable.", "score": 1, "replies": []}, {"body": "AAPL because Apple Pay for me", "score": 1, "replies": []}, {"body": "Fintech could be a huge disrupter.  I invest in most of them:  Square, PayPal and SoFi (IPOE).", "score": 1, "replies": []}, {"body": "I own SQ IPOE MOGO and the two biggest crypto currencies.", "score": 1, "replies": []}, {"body": "SoFi, Coinbase", "score": 1, "replies": []}, {"body": "Based on current valuations, and upside potential, I was buying SoFi (IPOE) the last few days when it was down like many are suggesting. The stock isn’t cheap by any means, but if they pull off the vision they could see some exponential growth in the coming years. They may fail, but look to have the most SQ like upside. Also, if/when Chime IPOs at/near rumored valuations then SoFi will look cheap with their bank charter coming.\n\nA few I’m not buying right now, but are intriguing/haven’t seen mentioned would be Etoro (FTCV) & Grab (AGC). Both are similarly SPAC deals, and non US focused, so you’d have to be ok with that. In particular if Grab can pull off their Fintech/Superapp expansion they could absolutely own their market (SE Asia) as an Uber+Dash+Banking+Insurance conglomerate.", "score": 1, "replies": []}, {"body": "Upstart (UPST)\n\nCoinbase (COIN)\n\nFair Isaac (FICO)", "score": 1, "replies": []}, {"body": "I think PayPal is a solid choice. A lot of people overlook Paypal's additional products and partnerships and often talk about it primarily in terms of the PayPal app. In addition to Venmo, they also own Xoom, one of the best ways to send money cross border and hugely popular in central and south america. They own Braintree, which is a competitor to Stripe and powers the payments behind many direct to consumer brands and in-app payments for apps like Uber and Airbnb, among many others. Everytime you use one of those apps, paypal gets a percentage of the payment.\n\nI'm also keen on their partnership with Mercado Libre, a major marketplace in south america that has seen tremendous growth in the past two years. \nPayPal also benefits from a very sophisticated and mature risk modeling service, which is used by all of their products and partnerships in their payment network, and will only continue to improve. I could see it becoming a standalone service they offer in non-financial contexts ( for example identity verification or fraud detection).", "score": 1, "replies": []}, {"body": "SoFi (IPOE) now that the merger is approved it’s far less risky, on target to be profitable this year, has an amazing growth rate and is reasonably priced based on P/S, growth rate and near term profitability.", "score": 1, "replies": []}]}
{"title": "Selling covered calls to pay rent", "selftext": "I need some advice. I have to move soon. House prices are high so when I sell I'll have 60 to 80k of equity that will be in my pocket. I can't buy another house right now due to personal reasons. I need to rent because I may need to move again. Here is the plan\n\nI buy 100 apple stocks and sell weekly covered calls and hopefully get 150 to 200 per week. Hope I don't get assigned but if it's getting close I can do the wheel thing? I need to learn more about that.\n\nI would take the 150 or 200 out of my account per week. I assume I would need to pay taxes on this so I would set aside 25% the rest I can use to pay help pay rent. I need income because child support is more than what my mortgage was on a 240k house. WTF right. \n\nTell me why my plan sucks and how I could improve. Thanks!!!", "id": "mway16", "created_utc": 1619115139.0, "score": 23, "upvote_ratio": 0.74, "num_comments": 94, "comments": [{"body": "[deleted]", "score": 53, "replies": [{"body": "> You're paying short term gains taxes on all these too.\n\nIsn't this going to be the case with most theta strategies when you're just collecting premium (especially on the put side, not sure about the call side)?", "score": 17, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "So this is something I need to understand. I have to pay short term gains plus at the end umof the year I pay regular taxes on this like it's normal income? \n\nI fucking hate the government.", "score": -16, "replies": [{"body": "The way you wrote that makes it sound like you are being taxed twice. This is not the case. You are taxed on your capital gains from selling premium at the short term rates, which is the same as your normal income tax rate.\n\nedit: note that you may need to make quarterly estimated payments on your capital gains, since your brokerage isn't withholding money to send to the IRS like your employer would from your pay check. Not doing so may put you at risk of owing interest/fees when you file your taxes.", "score": 9, "replies": [{"body": "Thanks. I'm going to have a quick meeting with my accountant and also maybe talk to my banker so I can get a better understanding on things.", "score": 1, "replies": [{"body": "I don’t know that a banker can help you with this unless you’re also looking to take out a loan.  The bottom line for taxes is that it will be taxed like your ordinary income that you would pay from a regular job. But talking to an accountant is not a bad idea.", "score": 9, "replies": [{"body": "lol let him go waste the banks time.", "score": 5, "replies": []}]}]}]}, {"body": "Short term gains taxes are just like income taxes. You don't have to pay them and then pay income taxes on them as well. You just take your income plus any gains from investments that took you less then a year and add them together, figure out what tax bracket you are in, and then you pay an income tax rate on them.", "score": 3, "replies": []}, {"body": "Selling covered calls is not a get rich quick scheme. A few people might make a 30-40% ROI / year, but a vast majority either lose money or barely beat the market.\n\nIf I were in your position, I would not be comfortable yoloing everything on a single ticker until you understand the risks and how how capital gain taxes work.", "score": 3, "replies": []}]}]}]}]}, {"body": "If you have a bad day, you'll be broke and homeless.", "score": 86, "replies": [{"body": "Yeah.\n\nTo the original author: what happens if Apple breaches your strike price - a fairly regular occurrence with a covered call - and you can't buy it back because you lack the capital to do so at its higher strike price?\n\nIf your answer is: \"I'll roll\" - then recognize the fact that you won't be collecting premium for weeks or months at a time, and may in fact have to *pay* to roll after a while.\n\nCovered calls and cash secured puts are in no way a substitute for a regular income to pay the bills.\n\nIf you're that desperate for rent money from stocks, go buy a high dividend stock or high dividend fund like QYLD, they're about as safe as you can get with cash income from stocks - and that's still \"not very.\"", "score": 5, "replies": [{"body": "what's stopping me from just letting shares get called away?", "score": 3, "replies": []}, {"body": "I would be able to buy it back though cause Apple would cost less than 14k and I'd have 70k to work with. But yes I'm learning why this is a bad idea", "score": -1, "replies": []}]}]}, {"body": "Spread it out among several solid stocks, maybe in different sectors.  Even Cook could be hit by the proverbial bus and AAPL tank for weeks or months in which case you would not be able to sell CCs.", "score": 10, "replies": [{"body": "I could still sell covered calls as it goes down. Just wouldn't get much", "score": -9, "replies": [{"body": "Agreed, but it can get to a point where the credit is so low that it may not make sense.\n\nYou may be tempted to sell at a lower strike price than you paid for the stock and if the stock suddenly jumps up you may have to close the call option for a loss or get the stock called away for less than you paid for it.\n\nWhile a CC is one of the easiest and lower risk options plays you need to know that it can still lose money.", "score": 6, "replies": [{"body": "I would argue selling CSPs well OTM (trying not to get assigned) is the safer option if the underlying security is financially sound. Worst case scenario you now own the stock and sell calls against it. Where as the situation you referenced requires the up front capital for the stock limiting his ability to leverage more of his capital for the CSPs for more premium. Essentially CSPs, then if assigned CCs (take smaller premiums, or if profitable intentionally setting it up for Execution+Premium or limit sell if he wants to move to another security). Then the cycle repeats.", "score": 4, "replies": []}, {"body": "Whats wrong with selling cc closer to the stock price, even if below his cost per share? toward end of the contract he could roll to a safer strike and out a week to still have good premium, but not get called away?  I ask bc I am recently in that position too, and I noticed I had cc's at my cps, and the stock price is much lower, i sold the cps cc's and sold closer to the  stock price, and will just up the price and out a week if it gets close.", "score": 1, "replies": [{"body": "Do you know that when you sell a CC the option buyer determines when to exercise?  While rare, you may not have a chance to roll or close as you can never be sure when this might happen.  Also, closing the call will add to the loss and net stock cost to dig the net stock cost hole deeper.\n\nIf you trade this way you are taking a risk of a loss.  I like to be sure there is no loss and sleep well at night, so I sell the call above the net stock cost.", "score": 2, "replies": [{"body": "Thank you.", "score": 2, "replies": []}]}]}]}, {"body": "At the end of the day valuations matter. If apple suffers a correction because of macro forces or slower than hoped earnings growth then your plan to pay rent will also suffer a “correction”. But if apple stays well priced then it can work out nicely. Doing more than one stock can help you diversify. My advice is have enough capital to have a surplus, for example if you need 800 per month see how much money you would need to generate 1k so you can hopefully build your savings to increase income and hedge risk. \n\nPersonally I have reservations about mega caps going much higher because sentiment as of April is extremely bullish because of projected earnings however apple is a company that can remain well priced with continually strong earnings. There are perceivable risks IMO with political forces and anti-trust suits disrupting the tech marketplace but these could take years to develop if they ever do.\n\nYou can also look into some neutral strategies around meme stocks to take on premium without having to hold the toxic underlying (cough gme cough).", "score": 1, "replies": []}]}]}, {"body": "You could use PMCC rather than buy the CC stocks outright and get more out of your capital. Still huge risks though since the markets been red quite frequently and you could get knocked OTM...", "score": 8, "replies": [{"body": "Idk what PMCC is. I've been meaning to do research on this. Can you give me a eli5 explanation?", "score": -3, "replies": [{"body": "Buy a long call (ITM) to simulate ownership of the underlying equity, sell a short call to collect premium. Keep selling short calls until the long call nears expiration. Close or exercise the long call then repeat (if exercised then it transitions to a CC instead of PMCC). Make sure your perform DD on the underlying equity limit the risk of it tanking. With luck the long call will net some extra profit if the stock moves upward...\n\nLots of people recommend the long (bought call) be ITM with a delta of .7 and the short (sold call) should have a delta of .3.\n\nOr just find decent underlying equities you don't mind owning and sell CSPs then run CCs if you get assigned... \n\nAvoid YOLO stocks unless you like cardboard boxes if this is your only source of income. Don't trade emotionally. Treat it like the ex you only call when absolutely necessary (risk/reward).", "score": 6, "replies": [{"body": "Treat it like your ex. Best advice ever.", "score": 3, "replies": []}, {"body": "If you do go the PMCC route look for your long leg to expire more then a year out. If you can successfully hold it for over a year while writing calls against it you will be better off tax wise because, even though you're paying short term gains on the premiums you've collected, when the time comes to close the trade on that long leg you can be taxed as long term gains on any profits from it.", "score": 3, "replies": []}, {"body": "I'm still learning but does this mean that you don't need to exercise the long call in order to sell covered calls against it?", "score": 0, "replies": [{"body": "If your short call gets exercised you can exercise and sell the long leg to cover it. Or roll the short leg over before it gets exercise at a loss in hopes to recoup your loss over future sold calls. Ideally it would make sense to exercise your long leg and sell because your premium from the short and IV of the long should equate to a profit if you set it up right.\n\nE.g. underlying 100 strike + 5 bought call = 105 Break even set short call that allows you to break even or profit I the trade doesn't go your way. If you sold a call at 105 the premium will drive the break even a little lower. Set it further out of the money to have reduced risk but less premium. \n\nWarning: This is an oversimplification of a concept not a recommendation to pick exactly these numbers to screen by. Also learn to use a screener.", "score": 1, "replies": []}]}]}]}, {"body": "Unless margin, then you get 2x the stock, 2x the premium, 2x the loss.", "score": 1, "replies": []}]}, {"body": "The only “reliable” way to get CC premium is if you do it on an index in my opinion. Better yet, a covered call fund like QYLD which sells ATM monthly calls against a nasdaq portfolio. The returns are roughly 1% a month which is less than what you probably need, but it’s the way I would go if your relying on the market for\nSteady income.", "score": 4, "replies": [{"body": "Wow I could sell covered call on a index fund that sells covered calls. Covered calls squared. All of this eye opening and I need to learn more", "score": 2, "replies": [{"body": "Well the premiums on QYLD are very low given that it’s a covered call etf and is low volatility in nature. And the overall volume/liquidity is low. It’s more of a income investors etf. But with that being said, if you do desire, you can definitely sell CC on QYLD. It trades between 18-25 almost perpetually so that can help you in this process", "score": 9, "replies": []}, {"body": "SPY I think is an index that allows options", "score": 1, "replies": []}]}]}, {"body": "QYLD pays monthly dividends and is currently yielding 10+%", "score": 8, "replies": [{"body": "Shit is it really doj g 10% a month in dividends?", "score": 2, "replies": [{"body": "It’s around 11% per year, paid monthly. You’ll get roughly 1% per month.", "score": 8, "replies": [{"body": "Or if you really wanna go crazy, go for SLVO. They're a monthly dividend payer that yields 30ish percent. Payout varies pretty widely each month, it's an ETN and the payout is based on their performance on silver covered calls. Plunk down a quarter of your capital and reap $500ish per month. This is almost as crazy as using AAPL covered calls.", "score": 1, "replies": [{"body": "Etn?", "score": 2, "replies": [{"body": "Exchange traded note, riskier than an ETF", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Get custody of your kids. 🤷🏻‍♂️", "score": 4, "replies": []}, {"body": "I just don’t think it will work for the long term. If you buy the stock - that is a risk. I know it’s tough to imagine, but AAPL could go down, and when it does - you lose money. Money that you need. All I’m saying is: you are risking your money. I personally think it’s a good risk - but it is still a risk.\nThen you sell a cc on that. You cap your upside for what seems like a quick and easy gain - but people forget two things:\n1) if AAPL drops, yeah - you get the cc premium, but you STILL lose money unless you are perfectly hedged. Most aren’t.\n2) this is the important bit. The premium you will get for your cc is more or less roughly equal to what you would earn for just holding the stock. That is kind of the nature of the game. People won’t buy a cc if they think it’s too expensive for the potential gain, so there is not a lot of “point” in doing this. \nIf you think I’m obviously wrong, remember that I am talking about very long term averages, and many many many trades. Of course you can make money doing this, but you have to pick your days, your strikes and your risk. You still have to know something the market doesn’t in order to consistently win over buy and hold.\n\nIf you just go in every Monday and sell the .2 delta call on aapl, over a long time and many trades, you’ll only be capping your aapl stock.\n\nIn nearly every time period, you will lose out on a lot of gains in the stock, and the premium will be pretty meh compared.\n\nDoes that make sense?", "score": 3, "replies": [{"body": "This makes sense. There is no free money out there. I don't actually need the 200 per week to pay rent. I can make ends meet without this. I just dont want to be poor because of the extra 1100 child support. \n\nFor me the idea is that I have 70k of capital and for the short term I could take a risk and potentially earn money each week. If the stock also goes up during this time I make money. If it goes above my strike price I just dip into the 70k more to buy it back and sell more calls. Essentially giving me short term cash taken out of my bank. Someday when I buy a house I might have less capital but I'd probably dip into the 70k if I just let it sit anyways. \n\nI'm going to take advice from this comment section and look into stocks that have good dividends. Also I could pick multiple stocks to sell cc's stocks being in different sectors might give me a better chance to have consistent cash flow.\n\nThanks for your comments everyone!", "score": 1, "replies": [{"body": "I may be too late to add much, but you sounded so much like me when I first started out wheeling with AAPL that I just had to throw my .02 in. \n\nWheeling is great and I think AAPL is a pretty good stock to run a wheel on. But there are a couple of things to keep in mind. \n\nFirst off, it can be hard to visualize the losses until they happen to you. So here's what happened to me wheeling AAPL. \n\nI bought 100 shares at the end of January and sold my first covered call when the stock was $140. Like you, I thought this was a really solid proposition. My goal was to make about 1% a week selling covered calls about 3 strikes OTM. \n\nVery shortly thereafter, the share price dropped by about $20. So I was then facing the choice of whether to sell a covered call down in the $120s to keep collecting premium, which could result in the shares getting called away at a pretty steep loss. Selling a weekly call at my original $140 strike price would have netted something less than 10 cents. It was a tricky place to be for a while. \n\nIf I'd been counting on collecting premium at 1% of the 14,000 I initially invested to pay rent, I'd have been in trouble. But since you say you have other means of paying rent, it may be worth looking into. You can pay your rent on the good weeks or just offset it a bit on the bad ones. \n\nAlso, if you buy AAPL today and sell a weekly CC for next week, you'd have no trouble writing a premium that would generate $150-200. That's because premiums are nice and juicy next week due to earnings being released on 4/27. Aapl could make a big move up or down when that happens, and you need to think carefully about that. I usually sit things out during earnings as I don't feel comfortable predicting whether it will go up or down and know only that a sharp move could be coming. \n\nNow that I have a few months of wheeling under my belt, I understand it much better than I did before. I do think it's a great strategy. And I think AAPL is a very good stock. If you're going to put your entire portfolio into wheeling, I'd recommend spreading it around to also include a couple of other solid stocks that aren't driven by moves in the NASDAQ. But always remember that any stock can fall hard unexpectedly. A big market drop, sector slump or sudden bad news event can send even the best stock plummeting. \n\nHaving lived through the market crash of 07-08 and watching 50% of my portfolio value vanish extremely rapidly and take 5 years to crawl its way back, I tend to plan things based on a 50% drop scenario. So, if I needed $200 a week to pay a certain bill, I wouldn't be comfortable relying on that until I had a portfolio that I felt like could reliably generate at least twice that every week.", "score": 8, "replies": [{"body": "Great comment! Thanks for the info about earnings and why the premiums are high right now. I need to be more aware of that going forward. I'd be sad if I lost 2k in a day or two. But I also had 10k in crypto recently so I've dealt with that before. I just pulled all my crypto out and I'm waiting for the crash.", "score": 2, "replies": []}]}, {"body": "There is a blog called dividend growth investor that has years and years of dividend stock analysis and strategy. I’d recommend that for a primer on how to find good dividend companies that will meet your needs. Good luck!", "score": 1, "replies": []}]}, {"body": "When you say perfectly hedged what does this mean? Buying puts to hedge against price drops? Can you give an example of what you would do with apple?", "score": 1, "replies": [{"body": "That’s exactly right. Long stock has a delta of one. So if you buy puts that equal to -1 (add deltas) you have perfect hedge. Stock goes down, you lose nothing. \nOf course, with every change in the stock, your hedge changes, so you have to rebalance.\n\nThis is what hedge fund guys DO all day, overly simplified.\n\nLook. Options are not some magical different kind of trading. They are basically insurance packages on stocks. This is one way to see them. You can buy insurance, you can sell insurance. If you know when the hurricane is going to hit, you win either way. But no one does. In the long run.", "score": 5, "replies": [{"body": "Yeah man! You have good inside and explain this really well!", "score": 2, "replies": []}]}]}]}, {"body": "The fact that you said \"buy 100 Apple stocks\" leads me towards telling you that you don't know what you're doing and to just forget this idea altogether.", "score": 6, "replies": [{"body": "I thought that wording seemed completely wrong but couldn't think of how it should be worded. I have some mental health problems that make word recall difficult. I'm not dumb at all and have an average or above intelligence based on tests and comments from my doctors.", "score": 2, "replies": [{"body": "I think he is referring to the fact that you should start by selling a put.  I think just start slow, research and try paper trading (fake money) until you are comfortable.", "score": 2, "replies": [{"body": "And also not playing Apple... look at the chart and tell me its a good stock to play for this strategy", "score": 1, "replies": []}]}]}, {"body": "I’m with you, over/under on how many weeks until he is broke?", "score": 1, "replies": []}]}, {"body": "You should just put all your rent money into a separate account right after you sell the house, then pay rent from that account until you’re done renting. \n\nThen the rest of the money (like 40-50k) you can put in your brokerage and play with stocks", "score": 2, "replies": []}, {"body": "Your strategy could work for a while.  I have been doing the same with 900 shares of AAPL and selling CCs and using my margin to sell CSPs. It has been working ok for about 6 months, but I wouldn’t call it regular additional income, because when you roll it on the wheel, you are going to go weeks without collecting premium, only for you to potentially have to roll it again. AAPL isn’t that volatile, so I see your reasoning with this strategy... but I would not bank on using this premium collection as reliable income to pay the rent. Think of it as simply going long AAPL and using premium collected for steak money on good months... then back to $5 rotisserie chicken from Costco when you have to roll because the CC or CSP you sold is deep itm.", "score": 2, "replies": []}, {"body": "Relying on the market as a means to survive is a horrible idea especially if you're starting to get involved with it with zero experience.", "score": 3, "replies": [{"body": "I shouldn't have titled my post to say pay rent. I can live without this. I'm just toying with the idea. I've bought and sold plenty of calls in my life. I am new but I'm learning fast.", "score": 1, "replies": [{"body": "In that case, watch this video: https://www.youtube.com/watch?v=siFsIleNTzk\n\nIt's a decent starting place for getting your feet wet.", "score": 1, "replies": []}]}, {"body": "Yes and no", "score": 1, "replies": []}]}, {"body": "Solid plan IMO. Just do the wheel thing", "score": 2, "replies": []}, {"body": "long safe sink books ten shelter punch point door rain ` this message was mass deleted/edited with redact.dev `", "score": 1, "replies": [{"body": "This is interesting. I didn't know about the time period of the calls on these. Thanks I'll consider it.", "score": 2, "replies": []}]}, {"body": "so when is finding a job comes into equation? or is your monthly cash flow already including having a job but you're still in negative cash flow? it sounds like w/o the hefty bill of child support, you could manage for a while. with it as a fixed expense though, you really can't risk your money in the stock market. just a 10% downturn and your plan is in ruins", "score": 1, "replies": [{"body": "Lol someone thats going to profit 80k on a house sale alone should be enough to tell you hes not depending on this for his only income...of course he has a job, and probably a good one\n\n\nEdit: wtf, my bad, i dont know why i couldnt see his reply...i was right tho lol", "score": 2, "replies": []}, {"body": "Dude I'm a electrical engineer. I have cash coming in but when you subtract 1100 for child support and 700 to 1000 for 2 bedroom apartment. Then subtract lawyer fees, doctor bills, utilities, internet, phone bills, groceries, (I grill steaks for bitches cause it gets me laid)  when you subtract it all I can probably live but I'm not putting money aside for a different car some day. I'm not putting money aside for my child's education. I liked it when I was gaining equity and putting some money in the bank.\n\nI know these are my problems and there is no sure way to make money. I'm just going over options and I'll find something that matches my risk tolerance.", "score": -4, "replies": [{"body": "your original post made it sounds like your rent money is depending on selling options, and that's why I asked. as long as you have a stable fallback, thetagang away!! if I were you though I'll still do it safe and CC indices only. at the very least you don't get blow up by ER. \n\nalso make sure you set aside some steak money for rubber. you can probably tell kids are expensive haha :P", "score": 2, "replies": [{"body": "Yeah man. She told me she was birth control :( never again.", "score": 1, "replies": []}]}]}]}, {"body": "You don’t want to sell weeklies, sell 45 days out there are numerous studies proving the inefficiency of weekly covered calls or short puts", "score": 1, "replies": [{"body": "I believe you. I was just thinking that that last week of a call it looses value the quickest? Or is that not true? I'm probably not going to do this plan after all the comments and learning but I'm going still considering everything.", "score": 1, "replies": [{"body": "It does lose value quickest, but long term the strategy just doesn’t do as well as selling the 45 dte, partly due to gamma, ideally you will sell a call 45 days out, set a profit trigger for 50% and then reopen a new one. The wheel strat isn’t that great of a strategy tbh, it can be used within your portfolio, but it shouldn’t be your focus, thetagang entails a diversified portfolio of theta positive positions, while keeping a relatively beta weighted delta, so that you make money on up and down days, this is what has been proven to work well historically long term", "score": 1, "replies": []}]}]}, {"body": "AAPL has pretty low premium. High premium = high risk", "score": 1, "replies": [{"body": "Is the low premium because the volatility is low? What items effect premium prices? Is it stock price. Volatility and time? Are there others?", "score": 1, "replies": []}]}, {"body": "This is terrible advice, but can you squeeze by at a homeless shelter until the next great reddit pump DD gets posted, then YOLO yourself onto financial freedom?", "score": 1, "replies": []}, {"body": "The good thing about selling option is that it's intuitive in terms of cashflow but it may not be the best way to meet your financial goal.\n\nIt seems like you don't have a cashflow problem, which means you're not forced to generate cash to make up the difference.\n\nYou should at least look into if it's better to put $60k into index fund. After a year, index fund immediately benefits from lowered tax. When you pay rent, it's going to feel like flushing money down the toilet but total asset is what matters, not monthly cashflow.\n\nEven if your portfolio generates the exact same amount as rent, your portfolio still goes down in value because of inflation. You do feel better this way though because it'll feel like free money.\n\nPerhaps, to start out, you could park most money in index fund and take out a small portion to sell options. At least that's how I started it.\n\nedit: typo", "score": 1, "replies": []}, {"body": "Oh dear god!", "score": 1, "replies": []}, {"body": "Plain and simple....Don’t!", "score": 1, "replies": []}, {"body": "Why buy and sell calls vs CSPs? Also diversification is key. Don’t forget that appl was ~121 a few weeks ago", "score": 1, "replies": [{"body": "Is there benefits and drawback to selling both CC and csps? Is that even a thing? You might be right though. Sell CSPs until it gets executed at a price infind fair and then sell CCs on that stock.", "score": 1, "replies": [{"body": "Selling ATM CSP should yield you a higher premium than an OOTM call. Also would mean you only own the stock at or below a set price. It makes sense to get the shares and sell OTM CC if you believe the stock it going to be rising more than the premium of the CSP", "score": 1, "replies": []}]}]}, {"body": "1) Find how many shares you would buy with your 60-80k assuming $80k thats about 600 shares.   \n2) Buy 6 ITM LEAPS  \n3) Sell calls against those LEAPS and use the remaining money you were going to buy shares with to pay your rent.  \n\n\nBy doing this you expose yourself to upward trends if you are bullish but also benefit from being able to sell the calls. The downside to this is if something blows through your sold call you are forced to roll or else assume the loss of extrinsic value on the LEAP so you would want to sell further OTM on the calls. If you are hell bent on moving the entire cash position into the market i would suggest creating some sort of straddle to protect from big directional swings. Seems like a bad idea to have a weekly goal though. Weeklies are inherently hard to adjust positions on and when dealing with theta strats you want to be selling advantageous deltas. I feel like you may run into situations where you are selling high deltas to collect premium to meet your weekly requirements.   \n\n\nTLDR: if you gonna do it buy LEAPS not shares and utilize the leverage a LEAP provides while also saving on your initial investment.", "score": 1, "replies": [{"body": "How far in the money??", "score": 1, "replies": [{"body": "It depends on what kind of delta you are looking for. If i was going to personally do this trade (which i am not but if you told me i had to make a long, income play, on AAPL) I would go with the $80 or $85 6/16/2023 LEAPS. Lets go with the $85 which costs about $5500 right now. Lets use $70k as the buying power since that's the average of what you expect to have. I would grab 6 of these for $33,000.   \nI would then sell around 10-15 delta 40ish days out calls. Right now im looking at the 05/28 $150 calls. I would be collecting about $80 per contract on these so I would sell 6 of them for $480.  \nNow this is where you really decide how risk averse you are. You can keep it here and just hope that AAPL doesn't have a big upswing in the next month or you can put a collar on the shorted call, relinquish some of the collected premium, but also limit your loss on any upward movement past $150 before exp. Personally I would collar this trade because its a tech stock in a batshit crazy market at the moment and I think I would want to ride these out a bit past the 21 DTE mark that people usually recommend to roll. I would look at the 5/28 $160 calls for $29 per. This would reduce your max gain on the sold side to $51 per contract but limit the exposure if it rockets up and avoid you needing to sell the LEAPS and lose extrinsic value.   \n\n\nLike i said I probably wouldn't personally do this strategy just because it feels very \"eggs all in one basket\" but if you are hell bent on doing it on AAPL this is how I would structure it to try to get that $200 a month out of it. This exact strategy would bring in $306 pre tax if taken all the way to expiration and would expose you to $6000 short term loss but your LEAPS would increase as well. Out of laziness and inability to get onto platforms where i am at the moment the rough value increase on the LEAPS if AAPL were to shoot up to $160 should be about $1200 per contract and this is just about at the 2 SD. I would also consider doing something with put spreads to limit downside risk as well. This is how i would structure the core of the strategy though if i had to do it with apple.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Fuck you dude I'm approved", "score": 1, "replies": []}, {"body": "I would hope they get approved..... i have a sub 10k account i just opened to manage for a friend and i was approved for level 3 instantly.", "score": 1, "replies": []}]}]}, {"body": "So you’re basing your entire housing plan on selling premiums from a stock... great idea surely nothing can go wrong here", "score": 1, "replies": []}, {"body": "Do credit spreads", "score": 1, "replies": [{"body": "I've doing these a lot lately.", "score": 1, "replies": []}]}, {"body": "I would sell puts 20% Prob. ITM 45-60 DTE and buy them back at 21 DTE. Rinse and repeat. Not advise, just what I would do.", "score": 1, "replies": []}, {"body": "you will be surprised how fast those shares will get called away \n\nnot a good strategy long term", "score": 1, "replies": []}, {"body": "Go read up about $QYLD, sounds more like what you need", "score": 1, "replies": []}, {"body": "Please do not do this. If apple drops, you're so screwed in the long term where your weekly premiums won't mean shit", "score": 1, "replies": []}, {"body": "oh wow. Ok\nThere are a lot of dumb answers here.\nBut yes. You can buy the underlying and sell the OTM call 30 delta around 30 days, by 21 days or if it hits 50 delta, roll it up and out, ALWAYS for a credit.\nNEXT", "score": 1, "replies": [{"body": "[NEXT JOKE ORIGIN](https://www.reddit.com/r/ChoosingBeggars/comments/7kr5as/i_need_a_free_100mile_bus_trip_for_20_people_and/)", "score": 0, "replies": []}]}]}
