{"title": "NIKOLA is the 2020-2021 THERANOS - Elizabeth Smart = Trevor Milton", "selftext": "Note I don’t own any options or stock in the company. I’ve left out details that would identify the friend.  \n\n\nI have a good engineering friend who I went to uni with, who got hired got hired on to the company not to long ago. NDA’s and all.. Increasingly his job was more research and development then he thought it would ever be. Lots of closed doors inside the company for many people except for a few key figures. \n\nIn the past 2–4 months things got increasingly more suspicious there and he started asking questions.. just wondering how far along this truck capabilities were. No mid level engineers have ever seen any of this hydrogen trucks processes in person and management only ever spoke about it. \n\nVast majority of employees are research and development. Company culture is only focus on the scope of ur assignment for the day/ week / month. Any question that charters or walks the line of \n\nCan we see the internals of a truck, demos, \n\nPublic is saying this xyz \n\nIs automatically classified as confidential company status which only 1-2 people in the main office allegedly have clearance for.  \n\nThey have coaching sessions on how to respond to family members or friends about certain aspects of the company outside of hype questions.  \n\nThe only thing my friends ever seen is completed frames of the next dune buggy NZT I believe he said .. Painted frame,. windows with wheels on the bottom. Wouldn’t  start though as they had a shipping delay on the battery for this first model that was ready for employees to see. Had a stupid meeting for apparently and made everyone clap like it was a morning Walmart cheer every time a senior manager spoke. \n\nApparently no ones ever met anyone who’s been on the original dev team.  My friend has suggested that they are using deposits and stock sale cash to come up with a car. Even if they one day did come up with a car don’t expect to ever see anything on the timelines provided. Friend also suggested this isn’t a repeat of Elon just being late by a few months or a year all the time with estimates, seems like a con so great that Madoff seem kind of ethical in comparison. Perhaps we haven’t been duped in a while.  \n\nWell needless to say a couple employees have been let go for new hires — hires 🎣 that won’t ask questions. A small pack of employees who had asked questions to senior management or who were to smart for the good of whatever is happening behind the scenes were let go. \n\nConsider this a PSA, Elizabeth Holmes fooled many “smart ppl” for a while till the whole thing fell apart. \n\nWe have a better chance of seeing the billons of dollars of gold in ft Knox before we see what under the hood at Nikola.\n\nShare repost link it to ur friends. Don’t get aboard the next Bernie Madoff, Theranos, Enron train 🚂 \n\n\nEdit: Elizabeth Holmes not smart", "id": "hce1ju", "created_utc": 1592619885.0, "score": 313, "upvote_ratio": 0.92, "num_comments": 175, "comments": [{"body": "It’s Elizabeth Holmes idiot.\n\nElizabeth Smart was the girl who was kidnapped by some pedo in Utah and made national news.", "score": 227, "replies": [{"body": "what if he really meant elizabeth smart and milton is going to get kidnapped since he has a 2000 acre ranch in utah ?", "score": 57, "replies": [{"body": "About to get kidnapped by an idiot who went all in on NKLA", "score": 15, "replies": [{"body": "Nah, he’s just being held captive by his own company.", "score": 2, "replies": []}]}]}, {"body": "Lol. Not the pedo part, cuz that sucks. \n\nThe Holmes part cuz that was funny.", "score": 19, "replies": []}, {"body": ">idiot\n\nHe's one of us.", "score": 8, "replies": []}, {"body": "The \"Elizabeth smart\" on the title couldn't be edited lol", "score": 7, "replies": []}, {"body": "And she was portrayed by Elizabeth Shue in the movie “Beth”", "score": 5, "replies": []}, {"body": "Fuck I'm ded lol he fucked up before even writing his post", "score": 4, "replies": [{"body": "DD birthed from a brain fart would be a stillbirth anywhere else except here.", "score": 3, "replies": []}]}, {"body": "Yeah? Investors are kidnapped by some dude in Utah named Trevor Milton. Same thing.", "score": 1, "replies": []}, {"body": "I could not, for the life of me why he was calling Elizabeth Holmes \"not smart\" in an edit until I read your comment. Still chuckling..", "score": 1, "replies": []}]}, {"body": "So how far out do I buy the puts", "score": 87, "replies": [{"body": "Well not 6/19 (I got fked)", "score": 72, "replies": [{"body": "I made over 5k selling these this week. Pleasure doing business... :P\n\n^(I don't doubt at all that the whole thing is a scam, of course. Doesn't mean you can't invest in it though. Just gotta make sure you get out before the ball drops.)", "score": 29, "replies": [{"body": "Invest?? You meant gambling lol", "score": 23, "replies": [{"body": "Of course he means gambling, that's what this fucking sub is for.", "score": 6, "replies": []}, {"body": "It's only gambling if I lose. If I won, it's investing!", "score": 3, "replies": []}, {"body": "no he means invest", "score": 1, "replies": [{"body": "> no he mans invest\n\nWhat does He-Man have to do with anything? \"By the power of Greyskull!\"", "score": 0, "replies": []}]}]}]}]}, {"body": "Hard to make money with their premiums so high", "score": 5, "replies": []}, {"body": "Yea can we get some clarity for puts?", "score": 4, "replies": []}, {"body": "They so over priced.", "score": 3, "replies": []}, {"body": "I picked up 7/17 a few weeks ago, looks like that's not far enough out though", "score": 2, "replies": []}, {"body": "I’m buying September ones", "score": 2, "replies": [{"body": "What strike? Those premiums seem so high that it would be hard to get paid on those.", "score": 3, "replies": []}]}, {"body": "If this is true, it would need to be an extreme long term LEAP, like 2 years. Shitty companies like that which have good marketing and following can lead on that everything is fine for much longer than should be possible.", "score": 1, "replies": []}, {"body": "Warrant day 7/3", "score": 1, "replies": []}]}, {"body": "Dude I watched a \"behind the scenes\" type video at Nikola, and they all seemed so dumb. Trevor Milton sounds like he should be a Wendy's manager and all of their \"engineers\" were like rednecks. Yeah I don't buy it.", "score": 105, "replies": [{"body": "I'm getting out my popcorn to see RH retards go guh when they realized NKLA isn't the next TSLA", "score": 31, "replies": [{"body": "I rode the hype train and sold that craps stock for a profit, just like izea.", "score": 14, "replies": []}]}, {"body": "Link\n\nI believe you though", "score": 7, "replies": []}, {"body": "u got a link? lmao", "score": 10, "replies": []}, {"body": "Well if you throw enough cash at anything something will pop out. Just how shit it is and whether they're a one trick pony is my real question.", "score": 1, "replies": []}]}, {"body": "Company market cap is $23 billion and they haven’t shown anything else than 3D renders. Amazing scam.", "score": 28, "replies": []}, {"body": "Warrants become convertible next week. Total float will massively increase. It's gonna tank hard next week. Good info in this thread \n\nhttps://www.reddit.com/r/thetagang/comments/hatbyv/couldnt_resist_the_nkla_premium_today/\n\nMy prediction is that it's gonna ride way down Monday, then a bunch of uneducated money is gonna pump it back up fomo style. I'm saying low of 30 by Monday, then fomo rebound plus short squeeze to 80 by Wednesday, then settle back down to 60\n\nIt's too late for puts, they were super expensive. But I'm buying either shares or calls on the dip next week and gonna ride them back up. I don't believe in nkla, but I believe in memes", "score": 60, "replies": [{"body": "This was why I didn't get in on this trade yet either.  300% IV for puts, yowsers.  I don't think it's gonna drop monday either i think it'll rise a bit more or stay relatively flat in 60-70 channel.  However I 100% agree it'll tank, recover a lil then once the dust settles find an actual valuation (if any).  I have seen meme's rise and fall and a LOT of money be lost amd made very quickly.  Timing will be interesting here though.  Defiantley watching it.", "score": 25, "replies": [{"body": "The IV is kinda crazy. People are willing to pay 4500$ to hold until the end of the year. I understand it's a shit company but still that's 75% of the value.", "score": 12, "replies": [{"body": "That's nothing. The borrowing rate to short on Friday was 885% a year", "score": 6, "replies": []}, {"body": "Yea i almost bought into it when i first heard about them a few months ago but missed on the original gains.  so i passed it up for now until the stock makes a move", "score": 3, "replies": [{"body": "I just think it's worth a gamble to take a couple out. Your max gain is 4500, max loss 1500. If it goes up at all the IV will get assassinated like Caesar at the Theater and you can probably buyback all the puts at 25-50% discount, flex out.", "score": 5, "replies": [{"body": "You are probably correct.  Sometimes you gotta pay to play.", "score": 7, "replies": [{"body": "Nah people should pay you to play, sell them puts dont buy that 4500$ shit lol.", "score": 8, "replies": [{"body": "I like it!", "score": 2, "replies": [{"body": "And those 4.5K options are already worth 3.5 today. Literal 900$ profit in half a day lmao.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What contract are you talking about here?", "score": 1, "replies": []}]}, {"body": "It is very expensive to short as well. The more I watch the interview of TM the more I hate Nikola.", "score": 14, "replies": [{"body": "Yea same.  The name Nikola seems like 100% marketing vs a product/brand to build from.", "score": 11, "replies": []}]}]}, {"body": "Reading that thread total float doesn't increase until July.\n\nWarrant agreement: https://www.sec.gov/Archives/edgar/data/1731289/000110465918034840/a18-13902_1ex4d1.htm\n\nSection 3.2: Exercise period begins 30 days after merger closes (July 2)\n\n\nAdditional article says the latest they can sell is Mid July.\n\nhttps://www.google.com/amp/s/seekingalpha.com/amp/article/4353958-nikola-impending-free-trading-shares-will-cause-imminent-crash-to-less-20\n\nGlad I found out been making money selling puts on this and will close out some positions this week.", "score": 3, "replies": [{"body": "Reddit Inc. has banned Seeking Alpha articles because their payout model strongly encourages spam. \n\nTo get around this, please repost your comment/thread with the link removed. \n\nYou may wish to copy and paste the full article if it adds necessary context to your post. If so, please include the link with a space in the domain (e.g. \"seek ingalpha.com/...\")\n\nWe apologize for any inconvenience this may have caused.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Reading that thread total float doesn't increase until July.\n\nWarrant agreement: https://www.sec.gov/Archives/edgar/data/1731289/000110465918034840/a18-13902_1ex4d1.htm\n\nSection 3.2: Exercise period begins 30 days after merger closes (July 2)", "score": 2, "replies": []}, {"body": "That’s why the motherfucker puts the badger out to offload some shit without tanking the stock", "score": 1, "replies": []}]}, {"body": "Bruh hit me up with that sauce. I work in the industry. Got direct lines with journalists. Or just go through the SEC whistle blower system, but you won't make any friends that way, and SEC fines won't compare to how much fucking money shorts can make when timed perfectly.", "score": 17, "replies": []}, {"body": "I don't know bro, that truck rendering looked sick af", "score": 50, "replies": [{"body": "And do we really think BUD would order 800 of them without atleast doing some DD?", "score": 13, "replies": [{"body": "How much money did they even put down to \"order\" these trucks, what publicity did they gain for it, what incentives did they receive, if any, from the government for going green, and so on. \n\nIn the end if they never receive the trucks, it's not like they're out millions or billions, it's a blip if they even did put something down.", "score": 24, "replies": [{"body": "See above reply. BUD been plugging it for 2 years as part of their zero emissions goal in attempts to bring back business by pledging to be a future green company\n\n Edit: No terms of a contract has been publicly released as far as I know", "score": 13, "replies": [{"body": "Yeah but that's kind of my point, they literally had to do nothing and have no downside to saying they're doing this.", "score": 16, "replies": [{"body": "Downside would be they dont meet their goals if they have been wasting years on a scam and heads would roll. Many people dont like Nikola but you got to give BUD some credit theyve been around forever and are a legit international company worth 100 bil", "score": 9, "replies": [{"body": "I know Budweiser is a great company (minus the last decade or so), but yeah I guess I just don't think it would really have any negative effect on them at all. You could very well be right though.", "score": 7, "replies": [{"body": "You're right that BUD has nothing to lose.  If NKLA trucks end up being a scam, that's not BUD's fault.  They'll just say they were excited for the technology and will find another way to achieve their goal.  All the blame on NKLA for being a scam.\n\nIt actually gives them the perfect cop out for achieving their goal.  They place all the responsibility for achieving the goal on a start-up without a working prototype.  If the start-up fails, they still get all the brownie points for their heart being in the right place.", "score": 17, "replies": []}]}]}]}]}, {"body": "There is no fee to get on the waiting list for one of their trucks. That’s why they have 14,000 semi pre-orders while Tesla only has 2,000 or so", "score": 3, "replies": [{"body": "Ya they even had in their reporting that they're working on converting the pre-orders into paid deposits.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "if they didnt have confidence in it they wouldn't of allowed all the press. Quote by a bud vp after first delivery in nikola truck: “No single company can build a more sustainable future alone but this zero-emission delivery has shown what is possible when we bring together the various strengths and assets within our supplier network to work towards a shared objective of a better world.”.... pretty strong language and has confirmed the \"order\" for almost 2 years", "score": -4, "replies": []}]}, {"body": "Bud stonks down", "score": 3, "replies": []}]}]}, {"body": "SHLL\n\nAll aboard!!!!!!!", "score": 37, "replies": []}, {"body": "It's clearly such fucking bullshit but now isn't the time to be shorting it. Not quite yet", "score": 21, "replies": []}, {"body": "Like someone bought this at 93 a share...", "score": 21, "replies": []}, {"body": "\n\n\n(Updated - June 17, 2020 3:33 PM EDT)\n\nNikola's (NASDAQ: NKLA) Founder Trevor Milton exaggerated the capability the company's truck, according to Bloomberg, citing people familiar with the truck's capability. The people told Bloomberg News recently that it was inoperable and missing key components to power itself.\n\nhttps://research.ark-invest.com/nikola-plans-to-enter-the-market-at-an-uncompetitive-price-point-and-more?utm_campaign=Sunday%20Newsletter&utm_content=131968033\n\n\"Nikola Motor Corporation made headlines this past week as its stock debuted via reverse merger and hit a $30 billion market cap, even though it has not produced one truck.\"\n\nThis is obviously a scam company bought who knows if it will implode in July Or August or longer. I hope everyone that shilled this scam *cough Jim Cramer* is laughed out of town", "score": 14, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "GSX price has since doubled since the fraud allegations.", "score": 4, "replies": []}, {"body": "The price dropped from 69 to 62 as soon as that article dropped so it clearly had an effect.  And that article was referencing an event from 4 years ago with something that vehicle manufacturers commonly do in those types of events.\n\nNKLA may be a giant scam, but so was that article.", "score": 4, "replies": []}, {"body": "Is almost as if we've been down the fake news vs EV manufacturer road before", "score": 2, "replies": []}, {"body": "Probably because it's about an event from 3.5 years ago, even though I feel like people keep presenting it as if it's about a recent truck event. They might be fake anyway, I just mean it seems like this news keeps getting misrepresented as if it's about their June 2020 event (which I don't think has even happened yet).\n\n****\nEdit: changed a bit.", "score": 2, "replies": []}]}]}, {"body": "I'm making money hand over fist selling atm puts in the $62-65 range couple more weeks of hype please.", "score": 7, "replies": [{"body": "Come Monday you may get blasted I am sorry buddy", "score": 3, "replies": []}, {"body": "I was selling the 50 strike for 2 weeks, but closed out yesterday. I'm not trying to get stuck with shares of this trash.", "score": 1, "replies": []}]}, {"body": "Theranos was a private company. It's much easier to swindle investors that way. It would be foolishly bold to go public if the company was a complete scam. I'm highly skeptical of the company and its ability to deliver on its promises, but all of the tech that they use is commercially available so it's quite possible that they have a working prototype.\n\nThe real questions in my mind are 1) is the prototype close to production-ready (they haven't shown off the actual tech), 2) can it scale (the trucks are supposedly made by hand), 3) can they successfully install all of the hydrogen fueling stations on schedule, and 4) can they bring hydrogen fuel cost down to the $2/kg price target that they claim. All while not doing any of it in-house.\n\nIn the Nikola's Analyst Day YouTube video @ 13:20ish, the CEO calls Dale Prows 'one of \\[their\\] hydrogen experts'. Here's his LinkedIn profile:\n\n[https://www.linkedin.com/in/dale-prows-b21646b](https://www.linkedin.com/in/dale-prows-b21646b)\n\nWhat's interesting to me is this is a business development and management guy. Bachelor's in finance and \"performed post graduate work\" (assume he didn't graduate) at the University of Pittsburgh. This is their hydrogen expert? Not a scientist. Not an engineer. The dude was literally working at a golf course before Nikola Motor. Hmm.\n\nWho is the lead engineer at Nikola? Why isn't s/he showing off the goods? Raises serious concerns for me.\n\nMy belief is they will never deliver a hydrogen fuel truck at scale and will end up being an electric truck/car/jet ski/dune buggy/etc manufacturer. Maybe they're hoping no one will care when they pivot away from hydrogen? There are so many issues with hydrogen fuel cell vehicles. It's hard to see them succeeding.", "score": 14, "replies": [{"body": "But not before it pumps!", "score": 2, "replies": []}]}, {"body": "Yuuuup", "score": 5, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Pro tip... do a put debit spread so you dont pay retail... your cappin your gains i guess but from $65 to $25 is a big big drop...", "score": 1, "replies": []}, {"body": "Synthetic short. Buy puts & sell calls.", "score": 1, "replies": [{"body": "Doesn't work too well when call premium is basically nothing in comparison to put premiums. Cost of borrowing is insane", "score": 1, "replies": [{"body": "Yeah I didn't look at the actual premiums until a couple other commenters mentioned that.", "score": 1, "replies": []}]}]}]}, {"body": "LOL Elizabeth Holmes at least went to Stanford and has somewhat of a background in Biology. She also hired incredibly smart ppl and executives who all believed in Theranos' mission... at least at the beginning. Pretty sure everyone that is involved with NIKOLA is WELL aware that it's a fucking scam.", "score": 19, "replies": [{"body": "Trevor Milton dripped our of high school though.", "score": 5, "replies": []}, {"body": "Did you even read Bad Blood? Lizzy was full of shit narcist and anyone who believed her wasn't that smart.", "score": 2, "replies": []}, {"body": "> She also hired incredibly smart ppl and executives who all believed in Theranos' mission...\n\nexecutives... the real heroes of the company....\n\nlmao she hired everyone but the people to make a working product.  As far as engineers went,  they were NDA'd up the ass where different departments couldn't even discuss the falsified results. If you weren't compliant with the shitbox of a product, you were out the door", "score": 1, "replies": []}]}, {"body": "Yeah, that's why Jan 2022 50p are $35 right now. Everybody knows.", "score": 11, "replies": [{"body": "That's not really why. Monday the 10 dollar warrants become convertible. Lots of people are going to be trying to get that 500% gain and there's gonna be huge pressure for selling. the total number of outstanding shares is gonna go up from like 15 to 90 million shares", "score": 13, "replies": [{"body": "Do you have a source on Monday being that date?  I can't find it in the SEC filing.", "score": 1, "replies": [{"body": "I might be a week off. Someone else in here posted that it's next Monday. All I know for sure is that lots of new shares will be available soon, and everyone who gets them has em at a cost much lower than the current price. I'm personally hoping to buy 50ish calls a month out if it drops to 30", "score": 1, "replies": []}]}]}]}, {"body": "This all sounds bullish AF", "score": 12, "replies": [{"body": "Yup... definitely bullish.", "score": 2, "replies": []}]}, {"body": "I can believe this. Could it be a fake-it-bc-we're-almost-there or just bat shit crazy like Theranos?", "score": 4, "replies": [{"body": "Definitely batshit crazy. In interviews he has contradicted himself so many times about their production techniques, battery capabilities, and hydrogen cell capabilities.", "score": 1, "replies": []}]}, {"body": "!remindme 1 month", "score": 4, "replies": [{"body": "I will be messaging you in 1 month on [**2020-07-20 05:27:25 UTC**](http://www.wolframalpha.com/input/?i=2020-07-20%2005:27:25%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/hce1ju/nikola_is_the_20202021_theranos_elizabeth_smart/fvexigd/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fhce1ju%2Fnikola_is_the_20202021_theranos_elizabeth_smart%2Ffvexigd%2F%5D%0A%0ARemindMe%21%202020-07-20%2005%3A27%3A25%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20hce1ju)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "For the love of all that is holy , if you have shares get out before this is $0", "score": 6, "replies": [{"body": "I still have shares I bought at $20. Gonna sell them as soon as the price reaches 70", "score": 0, "replies": [{"body": "Why didn't you sell when it hit 90 then lol", "score": 5, "replies": [{"body": "I did have a sell limit order for $90 but it only reached 88. The next day it was already down below 70 so I’ve since then been stuck with a continuous limit order at 70 lol", "score": 1, "replies": [{"body": "Sell sooner you fool it’s going to plummet as soon as selling pressure increases next week", "score": 1, "replies": []}]}]}]}]}, {"body": "Buying momentum from people hoping to ride TSLA 2.0 + short squeeze = 🚀🚀\n\nI don't give a shit if they sell dreams as long as the share price moons and I can get out before it cucks me.", "score": 6, "replies": []}, {"body": "I was thinking the same thing after I read about Trevor's crappy prior businesses and how shady he was in them.  Even the company name is a ripoff of Tesla.   Elon probably thinks the guy is a major douche.  Hopefully he gets Shkreli'd.", "score": 6, "replies": []}, {"body": "Y’all act like engineers in a company not knowing shit about the products is a new ducking thing. You could be working on a part of a product and have no idea how close to being done it is. This shot happens all the ducking time in the defense industry. \n\nI hate seeing this type of conversation because it is purely speculative. Just because some dumb “scientist” duped a bunch of people a coupe years ago doesn’t mean this is the same. \n\nI work in the defense industry and I can tell you for a FACT that a certain defense contractor has sold MILLIONS of dollars worth of a product that doesn’t even exist. They did a “capabilities demo” and the product in question was literally a bigger box that fit two of an existing smaller box and saying BOOM, look at this fucking thing! It’s amazing we combined it into a single device. \n\nAll I’m saying is wait until production starts or we see a working model or something before you make any decisions. \n\nAnd right now with all of the shade being thrown at Nikola, I pray to fucking Harambe that they meet the minimum requirements to have a truck or semi just to be able to look back at all this talk and laugh. \n\nI already doubled my money on initial listing on NASDAQ, cash gang until I see signs of failure or success.", "score": 5, "replies": [{"body": "Harambe hears your prayers", "score": 2, "replies": []}, {"body": "Companies with no revenue shouldn't be worth $24B no matter how optimistic you may be that they have a product", "score": 1, "replies": [{"body": "Should probably specify no HISTORY of revenue, because there are a hell of a lot of companies right now worth more than $24B with currently no or little revenue.", "score": 1, "replies": [{"body": "Which other $24B companies have no revenue?", "score": 1, "replies": [{"body": "Carnival, Disney, etc.", "score": 1, "replies": []}]}]}]}, {"body": "Bro you raise an interesting point but that whole company is a goddamn sham. They are playing in a dead-end industry with no relevant industry expertise. It doesn't even matter if they have a product already, and they don't, it's never going to work. It's a zero", "score": 1, "replies": []}, {"body": "Nikola is basically a biotech.  They will not make a truck for production.  They will collect capital and issue new offerings, and promise the world.  Classic pump and dump biotech with an electronic exterior.", "score": 1, "replies": []}]}, {"body": "You are correct.\n\nI like calendar puts if we don’t melt down Monday. Sell July 2nd puts prior to warrants at like $50, buy the puts the week after at the same strike. Price much lower just have to watch for assignment risk and get out if it’s bad, but you’ll still be up in that case. \n\nTheory is more float and no warrant hype means sell off and lack of forward catalyst. Unsure if those will be cash or cashless exercise. The idea is stronger if cash. \n\nBut Monday could be a bloodbath because the float more than doubles then and those investors will be up 6x at these prices.", "score": 3, "replies": [{"body": "Where'd you find that Monday is the day those investor's shares unlock?  I can't find it in the filing.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Reddit Inc. has banned Seeking Alpha articles because their payout model strongly encourages spam. \n\nTo get around this, please repost your comment/thread with the link removed. \n\nYou may wish to copy and paste the full article if it adds necessary context to your post. If so, please include the link with a space in the domain (e.g. \"seek ingalpha.com/...\")\n\nWe apologize for any inconvenience this may have caused.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "NKLA 25 8/21... soon as those pipe shares get released into the market yikes... i think there is only a 17% of shares in circulation atm... the rest will slowly be injected in and who wouldnt sell of i bought at $10... ill take x6 my money fast", "score": 3, "replies": [{"body": "When do the pipe shares get released?", "score": 1, "replies": []}, {"body": "PIPE investors aren't some ramen eating retards who won't be able to pay rent without a 600% yolo play", "score": 0, "replies": [{"body": "!Remindme 1 month", "score": 1, "replies": [{"body": "I think you mean 1 week", "score": 1, "replies": []}]}]}]}, {"body": "It's funny you posted this about this company because moderna is the real next theranos.  look it up.", "score": 5, "replies": [{"body": "Tell me more", "score": 2, "replies": []}]}, {"body": "You don't really need insider information about Nikola to see that it's a fraud, you just need to do the numbers for efficiency for converting electricity to hydrogen and back again. While it might have been a viable idea 10 years ago when battery density was low, today it's a no brainer bad idea when competing with BEVs. \n\nPeople are going to loose their money and this is one of the fundamental things that make markets work: separating fools from their money, while making rational thinkers rich.", "score": 4, "replies": []}, {"body": "NKLA made me 100% in one day, and I sold it all like a boss.  Got GTC order in for $32 a share, since that's closer to its real value.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Not according to real investors.", "score": 1, "replies": []}]}]}, {"body": "Got a January 2022 $50c for about $2800. Will sell weekly $80c's until the price blows through $80 (if ever).. then I'll cash everything out for $3000+", "score": 2, "replies": []}, {"body": "> I have a good engineering friend who I went to uni with, who got hired got hired on to the company not to long ago. NDA’s and all.. Increasingly his job was more research and development then he thought it would ever be. Lots of closed doors inside the company for many people except for a few key figures.\n\nJesus christ learn to fucking spell you autist.\n\nOf course it's a scam. $24 BILLION market cap with no revenue? Pump and dump. The only smart play is to short the fuck out of it.\n\nhttps://www.caranddriver.com/news/a32906468/nikola-one-semi-bloomberg-negative-story/", "score": 4, "replies": [{"body": "At the borrow/IV rates shorting it is practically even more risky than owning it right now.", "score": 2, "replies": []}]}, {"body": "The company is an obvious scam but that doesnt mean it cant go up more", "score": 2, "replies": []}, {"body": "Goddamn it the IV and consequently premiums are toxic and high. I’m staying out for some IV crush then go on maybe", "score": 1, "replies": []}, {"body": "!remindme 1 month", "score": 1, "replies": []}, {"body": "What about thanos?? Cutting the market in half with one snap??? 🌈🐻", "score": 1, "replies": []}, {"body": "Someone is about to get gaped by retarded put plays", "score": 1, "replies": []}, {"body": "Ouch.", "score": 1, "replies": []}, {"body": "so a buy signal", "score": 1, "replies": []}, {"body": "This reminds me of a certain industry and a certain particular company who constantly talked about \"Germany\" .\n\nEvery time I heard him mention that production is happening far far away in \"Germany\" the alarms went off in my head and all I could think of was that particular company I cannot mention here right before The CEO left. I distinctly remember that was all the hub bub with that company about how they had a certain amount of plots in Germany and that construction was underway and that production would start soon. Sure I'm comparing a trucking company with a weed company but for some reason I see similarities here .", "score": 1, "replies": []}, {"body": "I’ve been wanting to short, the problem is the IV is so high that the premium on all puts is fucking nuts", "score": 1, "replies": [{"body": "Only 250% IV man...not too bad\n\n\n/s", "score": 1, "replies": []}]}, {"body": "!remindme 30 days", "score": 1, "replies": []}, {"body": "Tech isn’t the issue - hydrogen trucks exist and will continue getting better, perhaps never as good as diesel though. But, the business case is horrendous, especially for trucking companies which only invest in equipment that saves money within the ownership timeframe (<5 years for the larger companies). And it will have far less value in the secondary market - individual truckers rely on public fueling infrastructure which is all diesel. Huge upfront incremental cost and rapid depreciation = no go.\n\nThat said, beware of the government jumping in with pro-H2 programs, incentives, and credits - that could drive this stock just like Tesla’s. Neither are profitable, and likely won’t be profitable for a very long time (if ever) without selling regulatory credits. \n\nGoing long on Nikola = betting the government will step in and make taxpayers subsidize the sales. China (worlds biggest auto market) is already heading toward hydrogen; perhaps the US will too.", "score": 1, "replies": []}, {"body": "good job op", "score": 1, "replies": []}, {"body": "ELI5 the truck driving pls:\n\n\nhttps://www.youtube.com/watch?v=LbNopvpSbzU&feature=youtu.be&t=952", "score": 1, "replies": [{"body": "Bought a complete fuel cell, drive train, CU and software from Bosch. Bosch bolted on a frame in 10 days. \n\nhttps://www.bosch.com/stories/fuel-cell-truck-nikola-two/", "score": 5, "replies": []}, {"body": "Not fast. Could be a Prius style like only battery when slow. Doesn't mean much till it moves 20 tons.", "score": 4, "replies": []}, {"body": "They reskinned a Volvo bro, seriously who the FUCK believes this is an actual company?", "score": 6, "replies": []}]}, {"body": "Haha that's all your engineer friend had to say? Management was secretive and ppl were let go for asking questions? Maybe they were dumb questions.. lol C'mon bro don't hold out...", "score": 1, "replies": [{"body": "Will update with more details tmrw posted this before a flight", "score": 1, "replies": [{"body": "\"he got told to research and develop but didn't see the truck! Super shady!\" Fuck out of here.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah it’s .com bust material. Too much dumb money in the market rn. ZM has a mkt cap of 70B lmao", "score": 2, "replies": []}]}, {"body": "I have calls that have tanked 90% expiring next month. I just pray on June 29 they reveal something to appease people. I don't care if it's a diseal f-250 with cardboard attached Trump MAGA signs and testicles hanging off the back. Just fucking reveal something that is tangible.", "score": 0, "replies": [{"body": "How do you have calls that are down 90%? Are you really one of those fomo morons that bought calls at $90", "score": 9, "replies": [{"body": "Semi fomo morons that bought at 75-80 during that drop and spike last tuesday after they ran to almost 100. I would do again if I could", "score": 3, "replies": [{"body": "Wow what’s wrong with you? Do u work at a grocery store for 12$ hr?", "score": 3, "replies": []}, {"body": "Holy fuck you’re stupid", "score": 4, "replies": [{"body": "My mom's girlfriend says I'm a genius you fuck twat", "score": 2, "replies": []}]}]}]}, {"body": "You are a fucking retard bro, not only did you FOMO, you fomo-ed into a scam. Fomoing into TSLA actually makes sense under the right circumstances.", "score": 5, "replies": []}, {"body": "I am pretty sure they are not revealing anything. I thought I read the 29th is when they open pre orders and announce nikola world 2020 where they will live reveal.", "score": 2, "replies": [{"body": "That's the word on the street. But I'm hoping they give us a little titty peak. Like a real photo or teaser trailer.  Then do a full live reveal.  Like what every other automotive manufacturer does. Small titty peak that's not a render. Then a month later a full blown car spinning on the stage.", "score": 1, "replies": []}]}, {"body": "You know Ford and Tesla are going to tease their own shit... maybe Rivian too. Poor Nikola.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "The Ford relationship is awkward, lol", "score": 1, "replies": []}]}]}]}, {"body": "The vehicles are certainly producible. There are hydrogen cars on the road today. \n\nThese posts are the exact same critiques Tesla endured until it became the highest valued car company in the world. EVERYTHING has never been done before...before it's done. \n\nTrevor Milton is a clown- an absolute clown; but here's the deal. He is no longer the CEO. He stepped down as CEO to \"Executive Chairman.\"\n\nThe new President is Mark Russell; [https://www.bloomberg.com/profile/person/1654100](https://www.bloomberg.com/profile/person/1654100) who has experience and knowledge in this space. \n\n$NKLA is for real. It has lofty expectations- but Elon made lofty promises at the start, too. They will likely under deliver as they face problems all new companies face. Keep in mind they were founded years ago, they have boots on the ground. \n\nI am long, and will be for quite some time. We will surpass $100 (soon) before we fill the gap at $35. \n\nBuy $NKLA and enjoy the massive short squeeze that's coming! You really think investors don't see the massive shorts on Nikola and understand they can manipulate it into a massive squeeze? Shorts=ROCKET FUEL. It's time for lift off next week. BUY BUY BUY.", "score": -5, "replies": [{"body": "LOL pump and dumper piece of shit, gtfo. You either have to be braindead or just like to light money on fire. Comparing this to TSLA is a fucking disgrace, comparing NKLA even to Theranos is a fucking insult to Theranos, because at least Elizabeth Holmes had more than 4 employees and made actual blood testing machines for $1 billion of investor's money", "score": 15, "replies": []}, {"body": "Here we have a bagholder. Please never compare TSLA to NKLA and I hope you lose all your money. Imagine investing in a company with a logo that looks like it was created by a 5 year old with crayola. He can't even hire a designer for a billion dollar scam.", "score": 7, "replies": []}, {"body": "Except Tesla has Elon, Nikola does not", "score": 7, "replies": [{"body": "You mean Trevor Milton doesn’t give you king autist vibes?", "score": 2, "replies": []}]}, {"body": "Enjoy losing all your money on this stock", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "I can re-skin a 1995 Toyota into a zero emission, organically produced, cruelty free car, you wanna get in on the ground floor or the Beyond Meat of cars? Don't be retarded", "score": 9, "replies": []}, {"body": "https://www.streetinsider.com/dr/news.php?id=17018300\n\n\n(Updated - June 17, 2020 3:33 PM EDT)\n\nNikola's (NASDAQ: NKLA) Founder Trevor Milton exaggerated the capability the company's truck, according to Bloomberg, citing people familiar with the truck's capability. The people told Bloomberg News recently that it was inoperable and missing key components to power itself.", "score": 1, "replies": []}]}]}
{"title": "I watch the press conference so you don't have to: Why Florida will not be shutting down", "selftext": "There is an imbecile in another post on WSB who's struggles to put his diaper on in the morning who's attempting to give shit investment advice about how Florida will need to shut down. In an effort to justify his mom's hard fought public school education that he got he attempted to use big nickel words and graphs to show Arizona and Florida are in a doomsday pact with their residents and they're all going to need to lockdown again, or everyone is going to die. As the title suggests I watched the press conference yesterday by Gov Destanis so you don't have to, and am here to give the corrected information about what's going on in the nations best run state. \n\nFirst, one thing to understand about Florida is due to the constant hurricane issues and the large old people population they have had the most detailed data and fastest reporting data in the nation. The governor does not get up on stage with a crap PowerPoint every day and have no actual color to add to everything, instead they have very granular data which cuts through the polical nonsense.  All data referenced in this post will be in the imgur link at the end. \n\nSecond all their elder care facilities are still on high alert and locked down. These have not reported and travel into and out of them are still very limited and carefully monitored.  All PPD is directed towards the elder care facilities, with hospitals getting the over run. \n\nOkay now onto the data. Yesterday Gov Destatis had a 1 hour+ press conference were he said where the state was at and where it was heading too. I doubt anyone from this sub watched it as it started about 10 minutes after apple decided to tank the market by announcing they were closing 8 stores. \n \nIn this press conference he first discussed why the number of infected was increasing. (Chart 1) he showed that all the new cases are from people who are under the age of 40. Which for 99.6% of all people will not result in death but at worse will be a bad flu. Further he went on to state that nation wide the only 2 people have died under the age of 30 who didn't have huge co-morbidities before they got Covid. Basically if you are healthy today and catch it you will be fine. \n\nHe breaks the new infection numbers down even further in chart 4 if you wanted to look at age split.\n\nHe backs his claim about younger people not being at risk with Chart 2 showing how the death rate is doing a nose dive. If they were actually at risk of death and were dying we would see it.  Additionally, he said they aren't going into hospitals either, as there are more available beds now in June than there were at any point between now and March 1st.\n\nSo this is a crap investment group so I should post on what this means for the market. Here's the brass tax, young people getting infected is a really good thing. The world has seen at least 6 major Covid related massive illnesses that they've attempted to develop a vaccine for. Do you want to know how many were successful? ZERO. There will not be a vaccine for covid-19 either as it mutates too fast. There is only one way out of this, herd immunity. The faster young heathy people get infected and become immune the faster we can attempt to go back to normal.  Any doctor on TV telling you anything else is lying to you. Also remember, our grandparents lived through a great depression 3 pandemics and 2 world wars and kept on trucking. We can make it through this.\n\nLong story short, invest in America buy quality long positions and enjoy the ride. Also fuck idiots telling you the world is going to end. \n\nFlorida data: Florida data https://imgur.com/a/JfoZM1o", "id": "hclbrj", "created_utc": 1592655214.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 119, "comments": [{"body": "[deleted]", "score": 44, "replies": [{"body": "Yes but GRanUlAr dAta", "score": 14, "replies": []}, {"body": "I love it.\n\nYOU GUYZ! Only 2 people under 30 with no co-morbidities have died!\n\nEvErYthInG iS fiNe!\n\nLook up what percentage of people have a co-morbidity. Look up what those death rates are.\n\nYoung people will spread the disease to old people... literally exponentially.", "score": 12, "replies": []}, {"body": "r/worldnews: I DoNt TruSt ChiNa’s nuMbers", "score": 2, "replies": []}]}, {"body": "“All new cases are from people under the age of 40”.\n\nYou...you actually believe that every single new case we are seeing in Florida right now is from someone younger than 40?", "score": 15, "replies": []}, {"body": "Herd immunity and vaccines are essentially the same thing. Sad news but if it mutates too fast for a vaccine then this is the same for your herd immunity. I suggest eating out of a garbage can though to test the theory. Gotta catch em all to be truly immune.", "score": 14, "replies": [{"body": "Dude, how did you figure out my plan?", "score": 1, "replies": []}]}, {"body": "Hahahahaha Desantis cuts through the politics?  Hahahahahahahaha thanks I needed a good laugh this morning.", "score": 58, "replies": [{"body": "If you don't believe me I'll bet you deaths will be flat/continue downward in Florida 4 weeks from now. Loser gets banned.", "score": -50, "replies": [{"body": "Big year for pneumonia deaths in Florida though. It’s easy to hide data when you’re as corrupt as de santis", "score": 19, "replies": []}, {"body": "And you create another account? Boohoo. I bet 1k you are wrong, how about that?", "score": 15, "replies": []}, {"body": "I am not a fortune teller so I have no idea what deaths will be anywhere at any given time, so no thanks.  All I was commenting on was you thinking Desantis cuts through the politics.  He doesn't, he's as much of a conniving politician as any other, democrat and republican alike.", "score": 24, "replies": []}, {"body": "Aren't you supposed to say you're gonna eat some article of clothing if you're wrong when making these claims?", "score": 8, "replies": [{"body": "He is all ready slinging shit. Just needs to put hand to mouth.", "score": 10, "replies": []}]}, {"body": "RemindMe! 4 weeks", "score": 2, "replies": []}, {"body": "How bad do you want DeSantis’ dick in your mouth?", "score": 2, "replies": []}, {"body": "Oof", "score": 1, "replies": []}, {"body": "Don’t blame the communists. They are just confused because they’re here trying to make money while simultaneously saying nobody deserves it.", "score": -18, "replies": []}]}]}, {"body": "[deleted]", "score": 47, "replies": [{"body": "https://www.npr.org/2020/06/14/876584284/fired-florida-data-scientist-launches-a-coronavirus-dashboard-of-her-own \n\nHere's a link", "score": 20, "replies": [{"body": "Read the actual story she was manipulating the data to show more positive cases, even according to her own account.  Her employer told her to stop.  That one person testing positive should not be counted multiple times due to multiple tests.  She refused so she was fired.  Pretty clear.", "score": -5, "replies": []}]}]}, {"body": "Bruh are you really trying to argue the point that Florida data is the best? \nJust leave this here for you. https://www.npr.org/2020/05/19/858977838/florida-fires-a-scientist-for-her-refusal-to-manipulate-states-coronavirus-data\n\nAlso you bash someone else for their education yet you have grammatical errors and spelling mistakes in your post. \n\nTldr never go full retard.", "score": 46, "replies": [{"body": "She was manipulating data to show people who tested positive on more than one test to be counted multiple times.  She was told to stop and refused.", "score": 1, "replies": [{"body": "Source? Never saw that.", "score": 1, "replies": [{"body": "https://www.npr.org/2020/06/14/876584284/fired-florida-data-scientist-launches-a-coronavirus-dashboard-of-her-own\n\n>She says that on the state's dashboard, any person who tests positive will be counted as a positive test only once, no matter how many times they test positive.\n\nShe disagreed with the methods which were laid out above her paygrade.  If you work with numbers often you understand that things can be measured a number of ways and if she refuses to measure what and how her employer wants and uses her own criteria as she did in this case, you will be fired.  It's not as big of a deal as people make it out to be.  It's a difference of opinion of how to record the data.  \n\nThis is just NPR making a mountain out of a molehill.  Disagreements over how to count certain data happens in every business but your boss is the one who decides what parameters are being used and you follow that or leave.  She refused so she was fired.", "score": 2, "replies": []}]}]}, {"body": "Hahahaha NPR?!?!\n\nHAHAHAHAHAHAHAHAHAHAHA", "score": -29, "replies": [{"body": "Lol what", "score": 8, "replies": [{"body": "Lib propaganda as opposed to the real news source: Alex Jones podcasts", "score": 8, "replies": []}]}]}]}, {"body": "The issue isn’t public sector closing, but the private sector. Look at Apple which has shut down stores.\n\nThe market is also living a lie. We’re basing the severity of a months long shut down on Q1 results which reflected a two and a half weeks of the crisis. Missed payments were at an all time high in May, furloughs continue, businesses are closing, etc. regardless, as many have stated, although we are back to a relative baseline, stocks on aggregate are much more expensive than in January.\n\nWe won’t completely shut down again, but this isn’t the false alarm you’re making it out to be.", "score": 9, "replies": []}, {"body": "The 2 nationwide deaths for under 30 is a lie unless they were both in north Texas:\n\nhttps://www.fox4news.com/news/lancaster-17-year-old-with-no-underlying-health-conditions-dies-from-covid-19\n\n\nhttps://www.fox4news.com/news/man-in-his-20s-with-no-underlying-conditions-among-2-new-covid-19-deaths-reported-in-dallas-county", "score": 17, "replies": []}, {"body": "They fired their lead data scientist for not cooking the numbers you fucking mouth breathing idiot", "score": 8, "replies": []}, {"body": "1.  Florida has 2000 cv deaths but 5000 pneumonia deaths this year when a normal year is under 1000 pneumonia deaths.  So the data is a lie, theres no debate here.  \n\n2. we don’t know that after you get better you’re “better”.  This is a major assumption here.  Many young people have had continuing sympotoms for months and are not getting better, including one of my family members.  \n\n3. How did herd immunity work out for the native americans?  Is there even a time in history we can point to where herd immunity was successful without being caused by a vaccine?  A single instance where this “plan” has worked?\n\n4. Plenty of other countries have solved this with lockdowns and masks.  There is no need for anyone else to die if we all agree on the plan.  \n\n5. If I were Putin and cv came along, I would try to influence social media to get americans to go spread it, thereby waging the easiest war on the west ever waged.  OP’s argument is traiterous.", "score": 8, "replies": [{"body": "Damn, I never thought about #5, it would make a lot of sense. Also it would explain a lot of the austroturfing people noticed in the whole liberation/antilockdown protests", "score": 1, "replies": [{"body": "Not to take anything away from the current protest movements but old people should be up in arms over these policies.  It’s shocking to me the turn this country has taken.  For a subreddit that worships fear and greed I think it’s never been more obvious we are witnessing greed on a level never seen before in this country or possibly even in history.  The audacity to sacrifice a segment of the population and the stock market’s reaction to it is possibly the greatest display of greed ever witnessed.", "score": 1, "replies": [{"body": "yea, I would like to agree, but it seems like a good portion of the older population is down with this. I agree it's driven by greed, but also a mix of the \"I don't care if it happens to anyone else, it won't happen to me\" fallacy", "score": 1, "replies": [{"body": "This fallacy only exists in rural areas.  Everyone in urban areas knows someone who has been hospitalized and most have at least an acquaintance or a relative of a friend who has died.  I fail to believe that rural area money is what is driving the market.", "score": 1, "replies": [{"body": "it's true that everyone knows someone with covid in the Northeast, probably not true (yet) for well to do areas in Texas, Florida, etc, aka less liberal, but still economically powerful areas. I don't really have anything to go on other than assumptions and anecdotal evidence.", "score": 1, "replies": [{"body": "It probably has to do with what your circle is, too.  If your circle is all young people with no kids that might be very different than if you have kids that go to school and now your circle is both wider and has a wider range of ages in it.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Herd immunity is the biggest bs that people try to convince themselves of", "score": 1, "replies": []}]}, {"body": "This kid calling other kids retards while using the wrong idiom. It’s Brass Tacks you dumb cunt not Brass Tax. Also... all your information is from a fat retard who read his infant son “The Art of the Deal” in his campaign commercial.", "score": 28, "replies": [{"body": "You're right you should keep shorting the market the world is definitely ending and we're definitely all going to lock down forever while antifa riots in the streets. Don't even attempt to listen to anyone who says otherwise.", "score": -19, "replies": [{"body": "Oh god this pussy thinks antifa is a threat. \n\nAntifa doesnt really exist outside of the northwest. And they’re just a bunch of fucking dorks. The fact you’re scared of this non existent threat posed by a bunch of losers shows what a fucking snowflake you are", "score": 15, "replies": []}, {"body": "Lol you posted in wsb a year ago saying time to short tech companies looooool", "score": 9, "replies": [{"body": "God if you exist, I really hope OP shorted tech with every single cent he had", "score": 1, "replies": []}]}]}]}, {"body": "I asked him to post a screenshot of his positions - I refuse to believe even the most autistic of bears is trying to trade off of valuation 101 course materials :)\n\nAlso - maybe time to go buy those DIS calls tomorrow.", "score": 16, "replies": [{"body": "Tomorrow is Sunday you retard", "score": 8, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Maybe I have a secret special brokerage that lets me buy calls on a Sunday. Maybe they even let me queue in limit orders.", "score": -1, "replies": [{"body": "Don't be a fairy, you fucked up, nbd", "score": 1, "replies": []}]}]}]}, {"body": "Yea. No way desantis lies to curry favor with his butt buddy donald trump. Republican politicians never lie. Its a fact. Smh", "score": 4, "replies": []}, {"body": "> invest in America buy quality long positions \n\nYou started off making so much sense and then you ended with this?", "score": 15, "replies": [{"body": "*AMERICA FUCK YEA*", "score": 9, "replies": [{"body": " *Comin' again to save the mother fuckin' day yeah!*", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "German Pilot. Dr. Hanz Wurmhat", "score": 2, "replies": []}]}]}, {"body": "In real talk... the USD is fucked long term.", "score": 3, "replies": [{"body": "I disagree.  Our strategic ink reserve will outlast any crisis.", "score": 9, "replies": [{"body": "My friend states “we are backed by guns and nukes, the usd isn’t going anywhere”", "score": 1, "replies": []}, {"body": "hahahahaha", "score": 1, "replies": []}]}]}]}, {"body": "The other guy had more words so I'm gonna go with what he said", "score": 3, "replies": []}, {"body": "Lol, nah - DeSantis is going to be brought to his knees on these decisions. This will likely go down as one of the most monumental screw ups in FL history. He has a weak command of the dynamics at hand and is fooling himself and others. \n\nTo suggest that \"its all good\" that a bunch of young people are getting sick instead of seniors is bullshit. Why? Who do you think runs the ALFs and nursing homes? Younger working people. How are ALFs and nursing homes run? Skeleton crews with relatively meager pay. I've already personally seen cases of people (tampa area) going in to work sick because they \"needed the pay\" or because \"work insisted they come in\" because they are understaffed, only to be later confirmed as having Covid-19.\n\nAs for the ALFs in particular, they are only as safe as their most reckless resident. There are plenty of old timers who believe covid is all made up and are still going out without any precautions. I've had the pleasure of meeting them. What happens when they go back to their ALF of 100-200 people? Masses in these facilities will get sick. Old timers might not get sick first, but there is no escape for them over the coming months.\n\nAs more of the workforce gets sick, the knock on effects will be the elderly get sick. The other thing noone is talking about is the idea that people with respiratory issues, young and old, often  move to FL because cold winters exacerbate respiratory issues like COPD.", "score": 11, "replies": [{"body": "!remindme 60 days\n\nI know I'll get down-voted, but to those who insist I am wrong, I encourage you to click this reminder link and see how this all plays out.", "score": 5, "replies": [{"body": "I will be messaging you in 2 months on [**2020-08-19 13:17:04 UTC**](http://www.wolframalpha.com/input/?i=2020-08-19%2013:17:04%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/hclbrj/i_watch_the_press_conference_so_you_dont_have_to/fvfrlz5/?context=3)\n\n[**4 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fhclbrj%2Fi_watch_the_press_conference_so_you_dont_have_to%2Ffvfrlz5%2F%5D%0A%0ARemindMe%21%202020-08-19%2013%3A17%3A04%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20hclbrj)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "They obviously will say everything is fine. It’s a red state everything is political.", "score": 19, "replies": [{"body": "It won’t be red after a bunch of elderly MAGA supporters mysteriously all die of pneumonia.", "score": 1, "replies": []}, {"body": "Did you even attempt to look at the data I posted at the end? Or just drive by posting?", "score": 0, "replies": [{"body": "You already know he didn't look because he is saying that nonsense. \n\nIt's projection. People will say the governors of red states are being political and basically lying because it's 100% what their side is doing.", "score": -13, "replies": [{"body": "While ignoring the ones in blue states that encourage riots and looting. You are correct", "score": -9, "replies": [{"body": "Governors in blue states are encouraging rioting and looting? Good God your head must be filled with cement", "score": 16, "replies": [{"body": "It’s true. Don’t even act like it isn’t.", "score": -9, "replies": []}, {"body": "Yea clown take a look at “chaz”... the mayor and gov literally said its a “block party” and when asked on national Cancer News Network interview about when she sees this “occupation” ending? Her response?.... “we might just have the summer of love!”.... youre an ass hat if you dont see it...and MY heads filled with cement😂😂🤦🏻‍♂️", "score": -10, "replies": [{"body": "You think the statement \"summer of love\" by the mayor is the same as the govenor encouraging rioting and looting?\n\nCement confirmed.", "score": 8, "replies": [{"body": "When they refuse to see that theres looting, rioting, raping going on inside said “chaz”, yes, they are morons and funny enough its only in blue states... go figure... check out the home listing in the area in the past 2-3 weeks and tell me if local residents feel the same as you. Your stupidity is incredible...", "score": -2, "replies": [{"body": "I'm still not seeing where you are getting governors are encouraging rioting and looting.", "score": 4, "replies": [{"body": "By not stopping this and ignoring the crimes, anddd saying oh no its gonna be a summer of love... yes they are encouraging the criminal behavior... im not sure what youre not understanding about this... simple law and order, businesses cant make a living but criminals can take over 6 blocks... just dumb", "score": 0, "replies": [{"body": "If you think that’s encouraging violent behavior just wait till you see what POTUS been putting out", "score": 3, "replies": []}, {"body": "I am embarrassed to share a subreddit with you", "score": 0, "replies": [{"body": "Im sure youre quite the embarrassment all on your own without my help...", "score": 0, "replies": []}]}]}]}, {"body": "Have you been to the CHAZ? No, of course not, you're in some backwater shithole and get your \"news\" from Fox News and facebook memes. Get the fuck off reddit, grandma.", "score": 1, "replies": [{"body": "Yea...as you unbox your “replica infinity gauntlet”... grow the fuck up dude... and no i would never want to go to a shithole like seattle... i have plenty of shittyness in my blue area...", "score": 0, "replies": [{"body": "Lmao imagine being that guy, though.\n\nUnboxing a toy and actually feeling like enough people care to see it, enough people to quell his insecurity, so he posts about it.\n\nAnd then that exact same person telling you to get the fuck off reddit, grandma. \n\nThese people are clowns, man. Lmaoooo", "score": 2, "replies": [{"body": "They are all clowns man, its hilarious... i just enjoy pointing out the hypocrisy, glad to see logical thinkers out there lol", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Sort of reasonable points (except for the 99.6% claim. That's not true under 40, but might be for under 30.) Hospitalizations and deaths are lagging indicators. In two weeks we'll see if your theory holds.", "score": 8, "replies": [{"body": "> two weeks", "score": 1, "replies": []}, {"body": "Florida has been open for what? 8 weeks now? Hospital visits and deaths are still down during the time frame. Ya there's more people getting it now but cases were already trending up before. The media just needs to pivot to a new story now that race riots aren't happening as much anymore", "score": -19, "replies": [{"body": "There are still protests everyday.", "score": 4, "replies": []}]}]}, {"body": "So hertz calls got it", "score": 6, "replies": [{"body": "Don't forget about JCP either", "score": 0, "replies": [{"body": "Also Wirecard", "score": 3, "replies": [{"body": "They'll find that 2 billion dollars eventually. They just need to figure out which Singapore hooker stole it.", "score": -1, "replies": []}]}]}]}, {"body": "Isn't Florida refusing to count non-residents in their COVID infection count?\n\nDidn't they just fire someone four days ago because they were trying to show real infection data?\n\nDid that same individual compile all that data into a web site?\n\n[Isn't this the web site?](https://experience.arcgis.com/experience/7572b118dc3c48d885d1c643c195314e/)\n\nI am interested to know how \"The Villages\" are fairing. I'm hoping poorly.", "score": 2, "replies": []}, {"body": "Oh look another one who would rather trust a politicians word over scientific evidence. Plenty of those to go around.", "score": 2, "replies": []}, {"body": "OP might be a massive retard with tiny pp, but doesn’t mean you should short this market", "score": 2, "replies": []}, {"body": "The guy that's a serial liar and die hard Trump supporter?", "score": 2, "replies": []}, {"body": "Can confirm but can’t say why.", "score": 2, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Thanks for making me read the transcript", "score": 1, "replies": []}, {"body": "One word: RECOUNT", "score": 1, "replies": []}, {"body": "Lot of bears here holding big money puts lol 😂", "score": 1, "replies": []}, {"body": "What the fuck do hurricanes have to do with covid data??", "score": 1, "replies": []}, {"body": "Thing is, the world might end, but stonks won’t.", "score": 1, "replies": []}, {"body": "Lot of people seem to agree with you /s lmao", "score": 1, "replies": []}, {"body": "Is this satire?", "score": 1, "replies": []}, {"body": "Idk if not shut down, corporates will close and everyone will get sick.\n\nImagine the liability Disney would have to assume if they reopen. What they gonna do? Be like trump and say sign this waiver?\n\nA hurricane prob going to hit florida next month too", "score": 1, "replies": []}, {"body": "Bih this souf flawda we ain scared of no Rona PWUSSY BOI", "score": 1, "replies": []}, {"body": "Reeet", "score": 1, "replies": []}, {"body": "My appl puts are going to print so fucking hard", "score": 1, "replies": []}, {"body": "Sweden tried to stay open and protect the elderly and vulnerable - they failed. And FL will probably fail. Not to mention FL is not a healthy state in terms of comorbidities.\n\nNot to mention FL doesn't even need to lock down.\n\nDIS is not going to be opening 7/11 when we get to 10k cases a day, even if those cases trend younger.", "score": 1, "replies": []}, {"body": "i am amazed at the average person's memory.  we were told for weeks prior to this that as testing ramped up, there would be more positive cases and a spike in confirmed covid-19 deaths.  now, testing has ramped up, and there is a spike in positive cases and confirmed covid-19 deaths.  yet, it's time to shut everything down again and something-something-florida bad new york good because definitely-not-a-political-agenda-here.  \n\n\npositions; long everything.\n\n\n\nedit; i see the downvote brigade has come swooping in.  good work boys, you've done papa soros proud.", "score": -4, "replies": [{"body": "Pretty much ya. It's insane and I feel like either everyone else didn't deserve to graduate 5th grade or I'm taking crazy pills. It's like most people can't remember anything that happened more than 48 hours ago.", "score": 0, "replies": [{"body": "I think you are taking crazy pills bud, hospitalizations are rising and it's looking really bad in Miami Dade right now.\nEdit: also I would recommend taking our governors advice with a grain... or a bucket of salt.", "score": 15, "replies": [{"body": "Jackson Hospital in Miami increased over 50% in 3 days. They are are opening more covid floors now.", "score": 12, "replies": [{"body": "We have 25% of our hospital beds free.  About 17k beds and 1,400 ICU beds.  We currently have 500 floridamen hospitalized with covid.  Of people hospitalized with ~~coconut~~ corona, about 20% will need an ICU bed. We're way under capacity.", "score": 1, "replies": [{"body": "Are you at Jackson?", "score": 1, "replies": [{"body": "No.  But 500 people currently hospitalized with corona vs 17k free beds isn't cause for alarm.  Hospitalizations are right steady, deaths are roughly steady, we have tons of excess capacity.", "score": 3, "replies": []}, {"body": "[Miami-Dade Data 2020-06-19](https://www.miamidade.gov/information/library/2020-06-19-new-normal-dashboard.pdf) \n\n649 patients with covid currently admitted in Miami-Dade, up from 546 on 6/12. 120 of those are in the ICU, 64 on ventilators.   \nStill have 456 ICU beds available (and another 518 that can be converted for surge capacity) and 2646 acute care beds available.  \n\n\nIt's concerning that the number of cases is going up along with the percent positive & number of hospitalizations, and while the cases are younger and less likely to need hospitalization, in a couple weeks we'll see how many of them were hospitalized & how many older adults they spread it to. \n\n[A few more graphs](https://www.nbcmiami.com/news/local/hospitals-seeing-influx-of-younger-covid-19-patients/2250862/)", "score": 3, "replies": []}]}]}]}, {"body": "The mayor of miami was also at the press conference he said they have few if any high risk patients getting infected in the last two weeks. You can watch it yourself here: https://twitter.com/GovRonDeSantis/status/1274016294652633088?s=20", "score": 0, "replies": [{"body": "Even if that was true (which it isn't), having a massive spike in cases is going to hit high risk people. Acting like it's magically going to skip the elderly is incredibly irresponsible.", "score": 5, "replies": []}]}]}, {"body": "Sorry what? Cant remember what you said in the post", "score": 2, "replies": []}]}]}, {"body": "**I am a bot. Is this submission violating the [content guide](https://www.reddit.com/r/wallstreetbets/wiki/contentguide)? Vote below.**\n\n| **Remove It** | **Keep It** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=hclbrj&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=hclbrj&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=hclbrj)\n___\n ^comment ^will ^disappear ^--- ^1 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 0, "replies": []}, {"body": "🌈🐻s been on here all week with that weak ass bullshit too", "score": -4, "replies": []}, {"body": "Listen.... most of the retards on reddit are 20 something year olds with extremely low critical thinking ability and an extremely high dependency on being told what to do.\n\nBasically you aren’t going to convince anyone on here that you can’t stay stay home and that the magical\nMoney fairy won’t come and provide for them as they try to hide from something humans have been dealing with for their entire existence.", "score": -2, "replies": []}]}
{"title": "Warren Buffett will be the last man standing", "selftext": "Sometimes it's better to have someone, who has no experience, to see something you're missing as an expert.\n\nI think this recent rally is really interesting. It's the first sort of crisis I'm experiencing. What's even more interesting is the behaviour of Warren Buffett.\nI'll be honest, he's an inspirational personality for me and I'm sure he won't exit this party without some big gains. He will be one of the winners.\nI've analyzed him and the recent situation somehow, this is my report:\n\nA lot of people participate in this actual bull market and many also lost a lot in the past few days.\n\nThe actual situation looks like a \"fake part in the system\". People get blind, because it feels to real.\nThe FED attract all the small fish. This small fish \"invest\" into a market, which is now like a seperate ecosystem.\nGuess what\nThe true part will be starting soon.\nThey won't be able to participate in the real part later due to missing liquidity. Once all the tiny fish are dead, the real players will join the battle.\nIt's like there is a war and everyone rushes in, while the master watches everyone from a safe distance. There is a lot of smoke and noise. He's patient.\nOnce the fast movements and smoke settled down, he will join the war. It's going to spectacular. Why? Well, his power will be at about 137 billion $ and the part of the large mass will be there with some funny few bucks.\n\nWhat is your opinion? Did Warren Buffett lost his chance already or will he join at the right time?\nI'm really curious to read your thoughts.\n\nDo your own research!", "id": "hcm2cz", "created_utc": 1592658678.0, "score": 67, "upvote_ratio": 0.86, "num_comments": 101, "comments": [{"body": "Last time I check he was the oracle of Omaha not the day trader of Omaha . \n\nHe will once again humble us all in the long term.", "score": 157, "replies": [{"body": "Well said!", "score": 26, "replies": []}, {"body": "When hes dead?", "score": 5, "replies": [{"body": "His last letter from the chairman said as much. BRK has plans that extend beyond his death.", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 47, "replies": [{"body": "Buffet and Berk are in the acquisition game. That tea party has barely begun. Don’t be surprised if they acquire names like Colgate-Palmolive ($CL) or General Electric ($GE) bigly in a few years.", "score": 32, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "I’ve never known him to be much of a short. He is waiting for a decline he knows is still in the cards and has a big board of companies he wants to move on when they are at a massive discount. He might have pulled out of airlines but in the end might own $AAL after bankruptcy.", "score": 13, "replies": []}, {"body": ">I've day dreamed of Warren buffet just shorting the entire market into the dirt to fuck all other boomers and give the younger generation the best gift of a lifetime.\n\nHaving American become a nation of inter-generational houses where grandpa and grandma just sit around the house doing nothing?", "score": 1, "replies": []}]}, {"body": "And than sell them at the bottom", "score": 1, "replies": [{"body": "Old joke. Wasn’t that funny even when it was funny.", "score": 1, "replies": [{"body": "Not a joke it’s fact and it wasn’t once, people need to lay-off Buffetts dick like he’s still some sort of savant genius when all he managed to do for 10 years was horde cash and who’s best performer for years was AAPL like that took any insight.", "score": 1, "replies": [{"body": "I can see why for the last 10 years of unprecedented QE, an investing heavyweight worth hundreds of billions might be taking a defensive position. Being too early is the same as being wrong unless you’re still standing when you’re right. Let’s see how this ends in a few more years and then we can be all judgey k.", "score": 1, "replies": []}]}]}]}]}, {"body": "When people sit on large stacks of cash, they influence the economy, per economic theory. As you know, spending is essentially the gauge of economic condition. \n\nHe's been sitting on so much cash for so long it's actually possible that him and a few other cash gang billionaires are actually hurting the economy. But why would he care, the selfish old bastard. \n\nBut yes, he'll own the US government by the time he finally croaks at this rate.", "score": 6, "replies": [{"body": ">  it's actually possible that him and a few other cash gang billionaires are actually hurting the economy.\n\nWhat are you talking about?\n\nHe puts that cash in Treasuries.  You know... the instruments that fund the government.", "score": 20, "replies": [{"body": "Fun fact since you don't seem to know much econ, encouragement of borrowing and investing in businesses and public consumption is not done through the selling of securities. Putting most of your money in government securities for 7 years like he's done constricts the money supply, with all else equal. \n\nNow all else hasn't been as equal, sure, but investment in businesses drives the consumption and expenditure that increases GDP. The governments spending is included in GDP, so sure make the government funding argument, but it's not as large of an impact as compared to thousands of potential businesses that could be driving GDP growth, tax revenue growth, and economic growth without the need for government spending. \n\nHence my statement.", "score": 1, "replies": []}]}, {"body": "That’s true but he’s not actually in cash. It’s sitting in short term treasuries and other money market funds gaining small amount of interest but readily liquid", "score": 4, "replies": []}]}]}, {"body": "When you have that much money, it's a different game requiring a different strategy. If we sense some kind of impending drop, we can easily liquify our 100, 1k, 10k, even 100k shares in whatever at the push of a button, the larger the stake in a company, the harder it is to just get out. If I had his net worth, I'd have pulled my shit and sat on the sidelines also (well I'd have gambled a little because I'm more than half his age and an autist), too much volatility and uncertainty still looming. So while his strategy isnt what's best for me, it was 100% the best call for him. I think it was wise to protect the cash instead of gambling it away.", "score": 59, "replies": [{"body": "You're right!", "score": 8, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Dont ever underestimate my autism, son.", "score": 4, "replies": [{"body": "If I had 100b I'd give it to you just to watch", "score": 2, "replies": []}]}]}, {"body": "Plus a lot of it isn't even his money. Harder to justify risk when it's not your own tendies on the line.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I dont know how his mind works, hes much more intelligent than I am. I'd imagine at this point, hes got nothing to prove. Also, he founded the Giving Pledge with Bill and Melinda so most of his wealth is going to be distributed to philanthropy. I'd also imagine, it's just a matter of principle for him now; after all, he's long since \"made his,\" so he'd be gambling with (like someone else said) investor's money/charity money. Risk doesn't outweigh reward at this point for him. Just my best guess.", "score": 2, "replies": []}]}]}, {"body": "he's pulled out of airlines to make sure market is fearful, he has influence.\n\nhe's waiting for fed stimulus to run out, he will make his moves in october or novemeber, likely they are going to buy out  a very large well known company, perhaps retail giant.", "score": 30, "replies": [{"body": "He is also going to get an airline all to himself.", "score": 18, "replies": [{"body": "After years of pumping NetJets in his annual letter.", "score": 3, "replies": [{"body": "Or air transat. They have a deal to be acquired by air canada, but that might fall through because of corona", "score": 1, "replies": []}]}]}, {"body": "Cough *Boeing* cough\n\nHe seems like the type that would realize he doesnt want to be in the mining business, he would rather be selling picks and shovels", "score": 8, "replies": [{"body": "He owns BNSF", "score": 1, "replies": []}]}]}, {"body": "This guy has along history of buying the bottom and making massive plays at the right time. I’m in no position to question his moves. I’m positive he’ll make a ton money off this whole thing in the end.", "score": 21, "replies": []}, {"body": "If you think that he never does emotional stupid shit just remember that he bought Berkshire itself because some dude tried to screw him by 12.5 cents per share.", "score": 39, "replies": [{"body": "I remember that", "score": 9, "replies": [{"body": "Hey guys, lets not pretend that back then, before electricity, 12.5 cents was a lot of money. Even for Warren Buffet when you are holding onto 1mil shares(exaggerating for affect)", "score": 10, "replies": [{"body": "That's a good point", "score": 3, "replies": []}, {"body": "If that's supposed to be irony: 12.5 cents in this case made exactly 1% difference", "score": 1, "replies": []}, {"body": "Warren's first \"big\" venture was running a pinball machine route.\n\nI'm pretty sure those required electricity.", "score": 1, "replies": [{"body": "No way, just rubber bands and springs", "score": 2, "replies": []}, {"body": "I thought it was the coca-colas he sold for like a nickel profit\n\nEdit: just read it again, you said big venture, but the humble roots is still my favorite", "score": 1, "replies": []}]}]}]}, {"body": "that was around the time his father died too... super emotional time for him.\n\nThe crazy thing is that he basically puchased a dying shit company and still managed shine that turd into something spectacular.  Took him the better part of his life to do it, but he's kinda' a \"come back kid\" story.", "score": 9, "replies": []}]}, {"body": " In [ancient Rome](https://en.wikipedia.org/wiki/Ancient_Rome), the **auriga** was a [slave](https://en.wikipedia.org/wiki/Slavery) with [gladiator](https://en.wikipedia.org/wiki/Gladiator) status, whose duty it was to drive a [*biga*](https://en.wikipedia.org/wiki/Chariot), the light vehicle powered by two horses, to transport some important Romans, mainly [*duces*](https://en.wikipedia.org/wiki/Dux) (military commanders). An auriga was a sort of \"[chauffeur](https://en.wikipedia.org/wiki/Chauffeur)\" for important men and was carefully selected from among trustworthy slaves only. \n\nIt has been supposed also that this name was given to the slave who held a [laurel crown](https://en.wikipedia.org/wiki/Laurel_crown), during [Roman Triumphs](https://en.wikipedia.org/wiki/Roman_Triumph), over the head of the *dux*, standing at his back but continuously whispering in his ears \"*Memento Mori*\"  (\"remember you are mortal\") to prevent the celebrated commander from  losing his sense of proportion in the excesses of the celebrations. \n\n&#x200B;\n\nRemember that Warren Buffet is mortal and everyone makes mistakes. From the greatest medicine doctor, to the greatest general, greatest engineer. People make mistakes, don't try to sugar coat Buffet's actions like it is a \"loss\" now because we do not have the vision that he has and it was all a plot to win billions down the line. In fact Berkshire has delivered less than SP500 over the last 10 years, they missed the tech growth (he admitted it). Dont make Gods out of ppl. It is not because you hit 99 times that you will hit the 100th.", "score": 15, "replies": [{"body": "*JPow has entered the chat*", "score": 4, "replies": []}, {"body": "You're totally right. \"Memento Mori\" is something truly powerful.\n\nWarren Buffett is remarkably good, but still a normal human who does \"mistakes\" like everyone else. I guess that's one important thing for all humans. We do mistakes and we learn and improve our life because of those.\nNot our weak point, the reinforcing one.", "score": 1, "replies": []}]}, {"body": "Everyone focuses on WB, but Howard Marks, Stanley Druckenmiller & Jeff Gundlach did nlt believe in recently rally. They are all legendary investors.", "score": 7, "replies": [{"body": "Marks is a bit of a different thing. He's salty because they stopped the freefall before the bond market got \"distressed\".", "score": 3, "replies": []}, {"body": "Thanks for these names sir!", "score": 1, "replies": []}]}, {"body": "this post is so gay i dont even know where to start", "score": 6, "replies": []}, {"body": "Berkshire calls December 220 strike", "score": 9, "replies": []}, {"body": "Ask him to put 100B on Tsla 2000c", "score": 3, "replies": []}, {"body": "At this point it's Warren Buffett vs. The Fed.\n\nIf he reaches for gold, you'll know which way things are headed.", "score": 3, "replies": [{"body": "He won’t buy gold, it makes not profit. He only buys biz that make money. He sells naked leap puts at the price he wants the stock instead of a limit buy order and puts that money in is account.\n\nDude makes more money selling insurance(puts) then State Farm.", "score": 4, "replies": [{"body": "He's purchased gold in the past and made a tidy profit from it too.\n\nHe talks gold down because of why he was forced to sell, but don't doubt for one moment he wouldn't go back into physical gold if it looked like the DYX was going to crash below 50.", "score": 1, "replies": []}]}]}, {"body": "Not gonna read this r/investing propaganda", "score": 3, "replies": []}, {"body": "TLDR Mr. House confirmed", "score": 2, "replies": []}, {"body": "What are you, kid, some kinda retard?", "score": 2, "replies": []}, {"body": "This isnt his first rodeo, hes got something many of us lack.  Patience.  When the opportunity presents itself to buy in, he will.", "score": 2, "replies": []}, {"body": "The real problem with bubbles and crashes is that they can go on for a lot longer than you think they can. We're in a bubble I believe, but I have more of my investments long than in cash (I do have puts on AAL and CCL as a hedge though.)\n\nWish I could scroll to the right on these charts. I can, but there is never anything there.", "score": 2, "replies": []}, {"body": "Great write up on his investment style:\n\n [http://thinkingforward.site/how-to-invest-like-warren-buffett/](http://thinkingforward.site/how-to-invest-like-warren-buffett/)", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "How do I apply for that job?", "score": 5, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Man you were doing so well and then you had to post this......", "score": 2, "replies": [{"body": "Sorry this was my only emotional part since the stock market crash in march this year.\nMy apologies sir!", "score": 0, "replies": []}]}]}]}, {"body": "Warren hasn’t been a trader since the 80s. Biggest profits are from preferred stock deals and convertible notes. Berkshire will win in the long term.", "score": 4, "replies": []}, {"body": "Who’s warren buffet?", "score": 2, "replies": [{"body": "Some old man, who started investing into the stock market at the age of 11, reading the whole library in his hometown and now the 4th richest man in the world according to forbes\n\nEdit: Tell me if you want to know more details about the legendary investor of this century", "score": 11, "replies": []}]}, {"body": "Sadly warren will be dead soon", "score": 1, "replies": [{"body": "You're right, but I still wish him a long life. I'd be proud to shake his hands one day for all the lessons he teached all of us.\nWe all will be dead one day and this should determine our daily actions.\nKeep doing good things and be remembered as an extraordinary personality. Follow your visions and dreams!", "score": 1, "replies": []}]}, {"body": "he will buy the dip when he gets the OK from the bogdanoffs", "score": 1, "replies": []}, {"body": "its literally been 3 months since the market tanked. the real winners are revealed when the market reverses in several years (buffet will be one of them)", "score": 1, "replies": []}, {"body": "Nah there's a new captain now", "score": 1, "replies": []}, {"body": "Sounds like you outlined an anime episode.", "score": 1, "replies": [{"body": "This made me laugh", "score": 1, "replies": []}]}, {"body": "Warren has always been a value investor who has preached to be greedy when others are fearful, and to buy the dip. He's also been complaining about to overvaluation for 20 years. He didn't buy in March, which tells me he still thought things were overvalued. Or he's still looking at valuations like it's 1989. I think he's just been complacent.", "score": 1, "replies": []}, {"body": "Yeah the guy who underperformed the s&p for the last 11 years and missed the March bottom is going to suddenly make a comeback. Buffet may have been the greatest of his time but that time is long gone and his stock reflects it", "score": 1, "replies": []}, {"body": "He’s going to die within five years or less. He’s old as dirt. Puts on Buffet.", "score": -1, "replies": [{"body": "Which actually makes his discipline even more remarkable... Dude has 5ish years left and is still sticking to the long game.", "score": 19, "replies": []}]}, {"body": "What's with all this billionaire worship? I mean, on the one hand you have Bill Gates over there making vaccines... and on the other you have Buffet sitting on the same amount of money that was sent out in stimulus checks.", "score": 1, "replies": []}, {"body": "I think he missed it", "score": -1, "replies": [{"body": "Not if the Democrats win the election. I’m in no way trying to start a political debate so don’t go down that road, but there’s a decent chance they might, and the market will crater imo. I think he’s waiting to see tbh. If Trump wins again, I think your going to want to be in stocks after that. I’ve recently consolidated out of speculative holdings and am sitting on my longs and about 15% cash and building.", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Democrats from what I understand like to roll back policies set in place by Republicans, mainly when it come to cooperate tax breaks and big business etc. I would think this would mess with their profitability and margins but I could be wrong.", "score": 1, "replies": []}]}]}]}, {"body": "He’s way past his prime and owns no tech companies.", "score": -3, "replies": [{"body": "Isn't he one of the largest shareholders in Apple?", "score": 6, "replies": [{"body": "He is, but it is widely believed that the decision to invest in Apple was Todd Combs', not Buffett's.", "score": 1, "replies": []}, {"body": "Buffet basically invested huge in the FAANGs of his day. That’s it. He has lackluster returns because he has not kept up with the fastest growing companies. All these buffet fans are retards", "score": -9, "replies": []}]}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "New paradigm? Nah. We're in an artificially propped up marked thanks to money printers and people getting stimulus cheques.\n\nIt may be that in doing so the Fed have mitigated some of the worst of the coming crash, but a crash is still coming.  Stonks can only avoid economic reality for so long.", "score": 7, "replies": []}, {"body": "He’s avoiding airlines because the reasons that once made them attractive investments:  buybacks, are no longer accepted.  Travel will also never be the same, especially corporate travel.  His time horizon is forever and has nothing to do with “missing a bull run.”  If in 5-10 years airlines stay flat-ish and the market outpaces them, he will finally be acknowledged for being right.\n\nHe also has no need to make a move, he’s waiting out the irrationalities in the current market and will play hungry hungry hippos later this year or early next.\n\nAlso, people forget he owns 10% of Apple or some ridiculous percent, he’s up an insane amount there yet people keep claiming he’s missing out on tech.", "score": 6, "replies": [{"body": "To say travel will never be the same is at a minimum hyperbole.  Will it be messed up for a few years? Yep! But this isn’t the first global pandemic in history and we have bounced back each time.  A few years from now travel will be back where it was barring continual pandemics between now and then.", "score": -1, "replies": [{"body": "A large portion of commercial air is due to business travel.  Most business are hacking travel spend due to teleconferencing and a broader general acceptance.  So it won’t ever be the same.  People will travel, yes, but not the same", "score": 1, "replies": [{"body": "I get it.  I’m one of the guys you’re referencing in terms of business travelers.  I’m a minimum of 100 nights/yr in a Marriott and the flight count depends on which airline (I only fly Southwest and Delta).  That being said, teleconferencing has been a great bandaid but be very clear, they’re looking forward to us getting back on the road.  As a matter of fact, companies of all sizes in my industry have lifted their restrictions on travel and the only 2 reasons people haven’t hopped back on planes is because it’s tough to get in-person meetings right now due to restrictions varying by state and a personal choice to not put themselves at risk.  I personally fall into the latter category and don’t see myself getting back on the road until 2021 at this point but it absolutely will happen.", "score": 1, "replies": [{"body": "Agree, for roles like yours, guessing you may be in Sales or consulting, it’ll get back, but otherwise “discretionary” travel will be eliminated at most places", "score": 1, "replies": [{"body": "You’re right, I’m in sales but what’s your definition of “discretionary”?  Conferences are already throwing out their speaker lineups and such for 2021 etc.  that’s the only thing I can think of as possibly being discretionary.  Not being a dick just trying to figure out where exactly we’re disagreeing.  Hell, we might not be.", "score": 1, "replies": [{"body": "I don’t think we are disagreeing.  I do think conference attendance will be lower and occasionally non sales employees would travel for org meetings, internal working sessions, planning, etc.  in an area I used to work we had anybody who was wfh or didn’t work at Corp hq we’d fly in for a week a month", "score": 1, "replies": [{"body": "Ok, your example from the company you worked at is definitely discretionary travel hahaha.", "score": 1, "replies": [{"body": "Definitely.  I do also think some software sales for smaller companies will also try to shift towards fewer on site meetings, due purely to funding drying up and cutting expenses.  This is very specific but I think when money was infinite and coming from PE firms places traveled like nuts.  Recent layoffs at places like Toast are an example of how spending patterns may become more conservative", "score": 1, "replies": [{"body": "Fair enough.  I don’t know if other companies work the math this way but the place I work at has a percentage of profit your business unit has generated that is a not to exceed number (for the most part, some exceptions do exist).  We’ve talked about it internally and our math isn’t going to change because that model and way of approving travel is sustainable.  Profits are fine and should end fine this year, 2021 will be dicey, but 2022 is already looking to be right on track.  That’s why I said earlier it’ll be screwed up for a couple of years but will bounce back.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I still can't believe he actually thought airlines would just start going under, how did no-one in his office tell him to chill out, big daddy gov will work it out. If I was one of his share holders I'd be pissed. Could have still got out of airlines, but at a better price.", "score": -3, "replies": [{"body": "He said there was too much uncertainty in the short term, and he was and is still correct.  He doesn't give a shit about retail investors playing the price swings he's looking at the industry big picture.\n\nAirlines have often gone bankrupt in good times, much less when they have almost no passengers and still have to pay all their fixed costs. Any retail investor making fun of Buffett for this move is an idiot who doesn't understand the situation at all, most likely someone young enough to have never seen a major airline go bankrupt.", "score": 1, "replies": [{"body": "Key phrase, Big Daddy Gov. Not that young my friend. Just smart enough to know this administration would never let that happen on their watch. That's the entire point of being an analyst or investor. Anticipating and making assumptions based on current government fiscal and monetary policy, combined with investor sentiment and economic trends.\n\nAre you really saying you're so naive that you don't think Trumps administration would rather drop as much money as possibly to keep these companies going? That's the big picture. The big picture is the influence that government assumes based on who is watching the situation and what their desires are. Failure to recognize that cost him millions of dollars. \n\nFailure to recognize that cost a lot of people money. Hence they sold low. There is a lot of uncertainty in the future for them, sure. You know where there wasn't uncertainty? That this administration would fight through fire to keep them alive in an ELECTION YEAR.", "score": 1, "replies": []}]}]}]}]}
{"title": "LOL fucking pump and dumped Trevor Milton of NKLA", "selftext": "In his lunch with NKLA fans Trevor Milton (ceo) kept mentioning the badger truck will be unveiled June 29th. Read atleast 100 autists here buying nkla 100 calls on month out in anticipation. Y'day he announced it will be shown at nkla world in December only reservations open on June 29th.\n\nI kept wondering why he kept sharing these dumb ass Microsoft paint looking type pictures of the truck if he had a real one build already.", "id": "hcmzhb", "created_utc": 1592662628.0, "score": 491, "upvote_ratio": 0.95, "num_comments": 422, "comments": [{"body": "I have no stake in NKLA one way or the other but it's going to be really epic to watch this company implode", "score": 676, "replies": [{"body": "Want to buy puts but the failure is already priced in, no meat on the bone", "score": 234, "replies": [{"body": "I bought a cheapo 7/17 $7.5 put the other day, just in case NKLA craters lmfao.", "score": 79, "replies": [{"body": "So your break even price is..like 0.5¢? Those put premiums are so fucking expensive", "score": 123, "replies": [{"body": "Break even for it is at $7.35, I picked it up at $0.15.  Although I'm not planning on it going to $7.5 tho too.  PIPE investors are in @ $10/share, so when those go live if NKLA craters to $20 then I should still be able to get a decent premium.", "score": 50, "replies": [{"body": "[deleted]", "score": 50, "replies": [{"body": "That's not how it works. It doesn't have to actually go below 10 for his contracts to be worth more than what he bought them at. If it's at 20$ with high volatility someone will DEFINITELY buy 7.50 puts for protection.", "score": 29, "replies": [{"body": "[deleted]", "score": -19, "replies": [{"body": "“There’s no chance” are probably the most expensive words ever spoken.", "score": 28, "replies": [{"body": "\"literally can't go tits up\"", "score": 6, "replies": [{"body": "This is the kind of dd I look for here", "score": 0, "replies": []}]}]}]}]}, {"body": "Well somebody bought it at $66 share price so obviously there is some market for it", "score": 28, "replies": [{"body": "Fake news! Sign this waiver ...the dems like to sue....the virus is for lazy peps get out and be American!", "score": -11, "replies": []}]}, {"body": "Honestly it's hard to tell.  I mean, the only reason I bought it was for a YOLO premium flip/insurance play (even though I don't own NKLA, nor ever would lol).  Plus it was a meager $15, so imma just ride it out till the end.", "score": 10, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Yeah but then your healthcare is like 1billion dollars", "score": 14, "replies": [{"body": "false", "score": -2, "replies": []}]}, {"body": "Interactive brokers my dude. The only cost effective broker for options here. commissions are between 1-3 bucks per contract", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Its 10 bucks a month, not per contract and your commissions get deducted from that 10. So aslong as you spend more than 10 in commissions theres no monthly fee. Im canadian btw", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yes, exactly, though IBs commissions can get a little wonky sometimes as they dont include the smaller fees they pay to the markets in the advertised price but generally stays within the 1-2$ range.", "score": 2, "replies": []}]}]}]}]}, {"body": "U pay 11.25 per contract?? Damn that's shitty but at least your government wants you to be alive and healthy while mine wants me sick and dead", "score": 1, "replies": [{"body": "10 each trade plus 1.25 each contract in that trade. So 11.25 to trade one contract, 12.50 to trade two", "score": 1, "replies": []}]}]}, {"body": "well what's the open interest and volume for those options, then you'd at least have an idea how many other degenerates are looking at those", "score": 2, "replies": [{"body": "Oh yea I use both OI/Volume a lot when I look for plays.   It was the same as just about all other 2-standard deviation strikes in regards to OI/Volume.   Minus the $10 and $20 strikes, which had about 3k OI (the other strikes had about 1.5k OI).  Honestly I'm only looking to make maybe $100 on this trade, because that's 4 more $25 plays that could bring in bank.", "score": 1, "replies": [{"body": "Then why not choose a more conservative strike\n\nEdit: I should add that I'm learning all of this right now and trading options only with play money while I'm pretty tied up in equity", "score": 1, "replies": [{"body": "Simply because I didn't wanna spend a shit ton, but also wanted to have a little exposure to this Jenga tower of a stock lmfao.  \n\nIn hindsight I probably should've gone with the $10's, but regardless if NKLA tanks far enough in a short time-span (think BA/SPCE), all puts on the option chain *should* theoretically increase in value.  \n\nI just don't have a concrete profit target in mind, so Imma just sell if/when NKLA crashes.", "score": 1, "replies": []}]}]}]}]}, {"body": "Don't underestimate people that may have sold those contracts with shares as collateral who are willing to pay to close the contract so they can dump the shares. Worth it if it is actually plummeting.", "score": 3, "replies": []}, {"body": "Depends really, i there still 2-3 weeks out and NKLA craters to $20, there’s someone buying it. But one week left and NKLA craters to only $40, I expect that to be worthless", "score": 1, "replies": []}]}, {"body": "These far OTMs will print when NKLA dumps and vol shoots up even more. Good luck.", "score": 6, "replies": [{"body": "My mans! You understand the logic <3  And thanks, I'll need it lmfao", "score": 7, "replies": []}]}]}, {"body": "What do you usually use to quickly tell if a premium is overpriced? Do you look at the breakeven price and do some math or do you use a greek?", "score": 2, "replies": [{"body": "For NKLA specifically, take the current price of the common stock minus the exercise price of the warrants (11.50) minus the current price of the warrants in the OTC market. That's the fair at-the-money put premium for the end of the warrant exercise period, Aug 3. Warrant arbing doesn't guarantee you a free lunch.\n\nIn general, black-scholes solution for a European call gives a ballpark but it assumes a perfectly efficient market, known constant interest rates, and exercise only on expiry:\n\nC=S(t)*N(d1)-Ke^-rt*N(d2)\n\nWhere: \n\nC is the fair premium \n\nK is the strike\n\nr is risk free rate\n\nt is time\n\nS(t) is price of the underlying at t\n\nN(d1) is a normal distribution: ln(S(t)/K) + (r + (variance/2))\\*t divided by volatility given by (std. dev\\*sqrt(t))\n\nN(d2), time decay is d1 minus volatility term \n\nYou can also use the greeks to estimate linearly:\n\nC(t+1) = C(t) + delta\\*epsilon - theta\n\nC(t+2) = C(t) + delta\\*epsilon+ delta\\*epsilon\\*(1+gamma) - 2\\*theta\n\n\nWhere C(t) is the premium, delta/gamma/theta are the given greeks from your market data, epsilon is the change in underlying price\n\nSorry reddit formatting sucks, I can render it out in latex when I'm not feeling lazy", "score": 2, "replies": []}, {"body": "Tbh I personally don't use Greeks at all, but to each their own. I believe in them being tools, I just don't implement them in my strategy ya feel?  As for premium, my main go-to is IV and looking at individual price action on an option using TOS's quick charting feature.", "score": 0, "replies": []}]}, {"body": "Bet on a CFD for a put with a relatively tight spread.", "score": 2, "replies": [{"body": "That's a great idea if you are not in the US", "score": 2, "replies": [{"body": "Oh I totally forgot that's banned for you guys!", "score": 1, "replies": []}]}]}, {"body": "ladies and gentlemen, boys and girls, step right up to watch this man buy puts with a breakeven price of just one ha'penny!", "score": 1, "replies": []}]}, {"body": "That’s quite aggressive. I don’t have a horse in this race but I’m hard pressed to think that it’ll crash that far in a month. \n\nBut I’m an idiot and you’ll probably be right because I said this. \n\nGood luck my dude!", "score": 4, "replies": []}, {"body": "Wow that’s.. that’s desperate 😂", "score": 2, "replies": []}, {"body": "Well hopefully it isn't halted to \"investigate\".", "score": 2, "replies": []}]}, {"body": "I'm selling deep OTM puts. Relying on Robinhood bag holders to keep this shit afloat a few more days. Playing with fire, I know.", "score": 8, "replies": [{"body": "I was so close to selling close OTM 1DTE puts last week and this week.\n\n5% OTM puts with 1 DTE were going for like $2.50\n\nHowever that shit could so easily gap down 15% overnight", "score": 2, "replies": []}, {"body": "How’d today go?", "score": 1, "replies": []}]}, {"body": "I don’t think so.  All the robinhood people were under the assumption they weren’t going to dilute the market with shares but would you look at that.  The amount of shares sky rocketed today and there will be a sell off Monday.  People want liquidity.  Hedges want money not to hold some stock that’s going to take to 2027 to make money.  They will buy it when it starts blowing up if that’s the case.  Big money is going to get out.  That’s why the warrants were like 11.50.", "score": 5, "replies": [{"body": "Today is 45 days since the merger. PIPE investors are now able to trade their shares.", "score": 3, "replies": [{"body": "The merger was on June 2nd though.", "score": 1, "replies": [{"body": "Sorry, 45 days after the consummation of the proposed transactions.", "score": 2, "replies": []}, {"body": "No sir this is incorrect.  It’s based off the merger on the document.  Not when the company was trading.", "score": 1, "replies": []}]}]}, {"body": "Lol, you really think the RH traders who pumped up NKLA are worried about share dilution?", "score": 2, "replies": [{"body": "The one holding bags will lol", "score": 1, "replies": []}]}, {"body": "how can you tell the amount of shares skyrocketed?", "score": 1, "replies": []}]}, {"body": "It’s not even worth it. Premiums are sky high", "score": 2, "replies": []}, {"body": "If you believe it's gunna tank then you can sell ITM call credit spreads.", "score": 1, "replies": [{"body": "You would get early assigned on any ITM calls, theyre basically free right now and the market is weird", "score": 8, "replies": [{"body": "this.. I tried doing this, and every night a few of them were getting assigned.  friday got assigned like 100 of them.  Started with about 300, probably down to like 30 now.", "score": 2, "replies": [{"body": "So you were momentarily short $600k of NkLA stock? I hope your broker is better than mine because with the current hard to borrow interest rate of 800% on mine the one day of holding that position before I could close would cost $13k, not to mention the huge temporary short exposure.", "score": 1, "replies": [{"body": "yes, but I had bought calls against them.  I had sold 5 dollar spreads for around a 4 dollar average.  Maybe ended up losing about 20k when I started to just exercise the calls I had.   I did make like 75k selling naked calls after that first week when they went up around 90 dollars a share though.", "score": 1, "replies": [{"body": "Did you somehow exersice your calls on the same day as your short calls were? Otherwise wouldn't you have a temporary short position?", "score": 1, "replies": [{"body": "Yes I exercised after I saw it put me into a temporary short position.  With IBKR, when I exercised it immediately removed the calls and the short position", "score": 1, "replies": []}]}]}]}]}, {"body": "damn, I knew that premium was too good to be true", "score": 1, "replies": [{"body": "Puts though go nuts", "score": 2, "replies": [{"body": "I sold puts the last two weeks and grabbed some ridiculous premium. Not trying to risk it from here on out though. I'll just sit the rest of this one out.", "score": 0, "replies": []}]}]}]}]}, {"body": "January 2022 5c are 1.60 a piece. I am probably picking up a couple of those on monday.", "score": 1, "replies": [{"body": "That may not be a bad flyer actually.  If current price holds it’d be 30x.\n\nEdit:  where are you seeing this price?  I see those selling for 50+", "score": 1, "replies": [{"body": "LOL I meant 2022 5p, I am an idiot.", "score": 2, "replies": []}]}]}]}, {"body": "I don't really know shit about NKLA but it sounds like it is the WeWork version of electric vehicles. Am I correct in this assumption?", "score": 17, "replies": [{"body": "More like we don't work.", "score": 34, "replies": []}, {"body": "WeWork may have shitty finances, but at least they provide a an actual service for customers and bring in revenue. NKLA has literally jack shit and a bunch of bullshit claims. In aerospace these types of companies are very common and are called vaporware, but this is the first time I've seen anything this blatant in the automotive world.", "score": 31, "replies": [{"body": "Yeah I was looking at examples the last few weeks and couldn't find a mechanical example linear to vaporware. Apparently vaporware isn't a common enough thing in the physical space to warrant its own term.\n\nAnother thing I was looking at was people claiming, well if Anheuser-Busch was willing to give them money, clearly they must be a valid company! Aside from the obvious argument from authority fallacy, I look back on Magic Leap getting money from Google and how that worked out, lol. Snake oil salesmen only get better as technology advances.", "score": 6, "replies": [{"body": "Anyone and their mom can put in a pre-order and put zero money down though. It's not like they require a deposit.", "score": 1, "replies": []}]}]}, {"body": "Yes. They have no working vehicles.\n\n&#x200B;\n\n[https://research.ark-invest.com/nikola-plans-to-enter-the-market-at-an-uncompetitive-price-point-and-more?utm\\_campaign=Sunday%20Newsletter&utm\\_content=131968033](https://research.ark-invest.com/nikola-plans-to-enter-the-market-at-an-uncompetitive-price-point-and-more?utm_campaign=Sunday%20Newsletter&utm_content=131968033)\n\n>ARK will be surprised if Nikola ever delivers a single fuel cell truck.", "score": 21, "replies": [{"body": "Ark also is a large investor in TSLA... and has really stuck their neck out with lofty price targets. \n\nAgreed the juice is plenty in NKLA... and no real proof of concept yet, a very active CEO, and well who hasn’t pre-ordered their semi-fleet yet (30, ten of each model)... cost nothing and if the trucks are not built out then no harm... except the $30 billion lost on the company. Visionary long term employees make millions(maybe a billionaire or two) and the house/casino wins again. Should be fun to watch, buy short dated calls, sell deep otm puts, short stock buy the warrants, there are a lot of valid strategies, and of course buy-writes if you’re a believer.", "score": 13, "replies": [{"body": "Trevor Milton isn't even CEO anymore. He's just the chairman but for some reason this is still misquoted and is not made a bigger deal. I mean seems weird that he stepped down now to let his president become CEO instead right?", "score": 6, "replies": []}]}, {"body": "Oh shit they got ark against them", "score": 4, "replies": [{"body": "These the guys that called Tesla at $15,000? Asking for a friend", "score": 4, "replies": [{"body": "Yeah it was something like tesla 4000 for a long time but now we're at 1000 doesn't seem that ridiculous.  You can sign up for their emails thats shows what they buy every day.  ARK was buying the FUCK out of Tesla for a long time, they bought every dip.  They also bought the shit out of SQ during the feb dip", "score": 6, "replies": []}, {"body": "In five years at an extreme bull case", "score": 3, "replies": [{"body": "Extreme, like Tesla invents time travel.", "score": 2, "replies": []}]}]}]}]}, {"body": "They’re more like Theranos.", "score": 7, "replies": []}]}, {"body": "Can't wait", "score": 17, "replies": []}, {"body": "The PIPE shares are officially public today and can and will be sold to the public. Everyone with stocks in this company is about to see their shit become worthless on Monday. Short the shit out of it.", "score": 11, "replies": [{"body": "Lock up period.", "score": 2, "replies": [{"body": "It’s over.....", "score": 2, "replies": [{"body": "Prove it. Did you read the 8-K or any SEC filings?", "score": 1, "replies": [{"body": "I read all of them... the ones that had to do with Cowen and M&M etc.  If you watched the market.  Their shares were registered Saturday.  They also have a clause that says they have events that can make their shares sellable.  It’s a very vague clause.", "score": 1, "replies": [{"body": "Well, I guess we’ll see what happens tomorrow.", "score": 1, "replies": [{"body": "Yeah that’s the problem with these charismatic ceos.  There are a ton of red flags though.  Remember the pipe investors were here before the current investors.  He’s looking out for them.", "score": 1, "replies": [{"body": "Of course. I got the sense in skimming their 8-K and other filings that it was vague as well. The only thing I saw was the 180 day lock out and in some cases 30 and I believe 60 or 90 days. \n \nI don’t think there is a big crash until late July even if some shares can be sold in the near term.", "score": 1, "replies": [{"body": "I think the give away is that the warrants are at a such a low price.  Remember the triggering events are not laid out.  They have 3 days from acting to report it.  So you never know.  They also will do an offering around the same time.", "score": 1, "replies": [{"body": "Yeah, it’s a gamble on timing. Full disclosure: I have 500 shares that are up over 100% that I plan to sell probably tomorrow and flip to selling 5 7/10 puts. If I get assigned I’ll just hold the shares, but I’m expecting to bank the premium and then maybe sell more puts with a lower strike if it starts to tank after 7/10.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I demand loss porn from the truly delusional among us that baghold this vaporware pump & dump. \n\nAnd if I'm wrong and this Skype 2.0's and moons, grats I literally do not understand this company.", "score": 7, "replies": []}, {"body": "So fuckin epic dude, like when a company really just dissolves into nothing, gosh there's just nothing like that feeling", "score": 22, "replies": [{"body": "Even better when their CEO is an ugly blonde with no degree that likes to sound manly when she speaks. Theranos gave me a high that I still haven’t come down from.", "score": 44, "replies": [{"body": "You forgot the part where she wore turtlenecks and cosplayed Steve Jobs 24/7.", "score": 53, "replies": [{"body": "Holy shit, i can totally see Milton starts tweeting “thinking of taking NKLA private at $420, funding secured from RH traders”", "score": 22, "replies": []}]}, {"body": "That bitch was weird af. Intentionally made her voice lower while looking at the cameras like she was sucking souls", "score": 14, "replies": [{"body": "Her current picture on Wikipedia made me terrified, it's like she's going to eat me", "score": 3, "replies": []}]}, {"body": "Idk I thought she was hot", "score": 3, "replies": [{"body": "So did kissinger apparently", "score": 4, "replies": []}, {"body": "She is very hot", "score": -3, "replies": [{"body": "Yeah, if you're a 99 year old vampire / former USG cabinet member.", "score": 2, "replies": []}]}]}]}, {"body": "Remember Faraday Future? If you don't, no worries.", "score": 4, "replies": []}]}, {"body": "I sold a put spread $5 wide for $400. I'm only risking $100 to hope these assholes keep it pumped a few more weeks.", "score": 1, "replies": []}, {"body": "just like gsx, tsla, nio, lk, its a goner!!", "score": 1, "replies": []}, {"body": "It’s going to be like theranos and rocket to an insane valuation for around 3-5 years. It will all come crashing down though.", "score": 1, "replies": []}, {"body": "I would buy calls and let them expire if it meant I got to see the idiot robinhood social media tears caused by the deletion of NKLA.", "score": 1, "replies": []}, {"body": "[this video kinda breaks down why NKLA has multiple red flags. ](https://youtu.be/evIeT1a9r3c) And why you shouldn’t buy into it. If anything sell what you have.\n\nFull disclosure: I don’t have any stake in NKLA and this YouTuber is kinda annoying but he does break it down.", "score": 1, "replies": []}, {"body": "It's got 4 employees lol .. it's less capable than a fucking saloon", "score": 1, "replies": []}, {"body": "https://youtu.be/9iYvNJ8brYw", "score": 1, "replies": []}]}, {"body": "NKLA puts are crazy overpriced. Calls have super wide bid-ask spread. Buy puts you lose, sell call spreads and you hardly get any credit. \nWhat a piece of hot garbage.", "score": 143, "replies": [{"body": "a sign of pump and dump", "score": 81, "replies": []}, {"body": "The only way to play it is near-term collapse with like 7/17 $15P at $.55. Even then its a pure gamble.\n\nPretty much no safe plays to be made here", "score": 24, "replies": [{"body": "I have a January 2022 $50c bought at $28.00.. I plan on selling weekly $80c's for life", "score": 7, "replies": [{"body": "I don't understand your trade here. You are long both delta and theta on a net basis, and are basically hoping that NKLA trades in a band between $50 - $80 for the next 20+ wks for you to make a profit.\n\nLooking at the weekly $80c - you are selling them for \\~$1.50, which means your trade isn't profitable for 19 weeks (or \\~4 months), and that assumes price of NKLA doesn't trade above $80 or below $50 in that time, which is pretty nuts for the IV of the stock", "score": 6, "replies": [{"body": "First note.. in two weeks I've made something ridiculous like $600-$700 selling calls.. there will be times of IV pump.\n\n19 weeks isn't so bad. I have.. what? 70ish\n\nIf it trades over $80, then I can close everything for at least $3000 profit (80-50 strike diff, plus some time premium on my long). Honestly, I might want to sell $90c or $100c\n\nIf it trades below $50 for a while, yea I could be stuck selling some cheap weeklies, but that's alright for a while. Still think this stock could pump any number of times in the near future. I could also sell $70c for a while potentially cutting into profit if it skyrockets, but maybe I've already made enough to breakeven anyway", "score": 3, "replies": []}, {"body": "You obviously improvise if the stock goes up and bump it up to 95 if the stonk it’s 80.", "score": 1, "replies": [{"body": "I think this is contingent on the stock going up. The original reply is talking about how do you build a trading strategy around this if you think it's going to collapse", "score": 0, "replies": []}]}]}, {"body": "So basically a calendar spread. Let me look at a put calendar spread and see if it’s worth it.", "score": 0, "replies": []}]}, {"body": "Why not short the stock?", "score": 0, "replies": [{"body": "because of 300% borrowing fees. NKLA crashing is so obvious everyone wants to short it.", "score": 2, "replies": []}]}]}, {"body": "Made some good money just swing trading puts. Sold em when they were down and bought them back later for half price. The iv is too high to resist selling that shit", "score": 3, "replies": [{"body": "Selling weekly naked puts bas been a decent strategy for me. \n\nNot sure if I'll continue moving forward though. I think I made enough. Too risky for my taste now.", "score": 4, "replies": [{"body": "Oh I'll always do Cash covered otherwise too much risk", "score": 1, "replies": [{"body": "Sorry, I meant cash-covered. I just don't want to get stuck bagholding NKLA shares at 50 lol", "score": 3, "replies": [{"body": "I’ve been doing the same. Just wheel it if you get stuck. The IV is so high, such tendies. \n\nI bought a 01/2022 20C for $10. It’s currently 46.40. I told myself I’d hold it through to the end and sell CSPs against it... but really tempted to cash in now and just keep selling the puts", "score": 2, "replies": []}, {"body": "I mean as long as they don't drop too hard and keep being volatile the premiums reduce that cost average a lot if you can do it for a couple weeks. But who knows if it'll drop a lot or not", "score": 1, "replies": []}]}]}]}, {"body": "Right but you have to be spot on with timing.", "score": 2, "replies": [{"body": "Yea definitely a higher risk strategy with something like nkla. Hell the 6 26 64put is like a grand, that's a shit ton of iv with a 54 break even, it's gotten even more expensive it seems. The risk is just that it settled and plateaus lower", "score": 1, "replies": []}]}]}, {"body": "I have been selling P 30s at $6 since the pump. They're now down to $4 something. The price would need to fall to where it was before the pump to be a losing trade.", "score": 3, "replies": []}, {"body": "sell NAKED calls.. if you can.", "score": 10, "replies": [{"body": "I would but I know with my luck I would 10/10 get screwed over.", "score": 22, "replies": []}, {"body": "Risky in this market where bankrupt companies moon 150%.", "score": 11, "replies": []}, {"body": "Don't. Call premiums on NKLA are garbage. Absolutely not worth the risk of another pump.", "score": 19, "replies": []}, {"body": "ABSOLUTE NOT. Age old adage comes into play here - market can stay irrational much longer than you can stay solvent. \n\nThis is literally the example of how you can be right in the long-term, but jumping out in front of a speculative bus kills you before you ever see your gains", "score": 5, "replies": []}, {"body": "Anyone reading this literally do not do this.", "score": 6, "replies": []}, {"body": "Nope. Nope nope, you will get assigned no matter what.", "score": 1, "replies": [{"body": "You have to be ITM to get assigned. I assume he meant sell OTM calls.", "score": 2, "replies": [{"body": "But even then when you get a pump you're fucked, which is very much a possibility in this market.", "score": 2, "replies": []}]}]}]}, {"body": "Short sell. Or synthetic short.", "score": 1, "replies": [{"body": "Borrowing fees are 400% to 600% and put premiums have been priced accordingly. Naked shorts and synthetics only work on a very short time range here.", "score": 5, "replies": []}, {"body": "> Or synthetic short. \n\nHave you actually seen how calls and puts are priced?", "score": 2, "replies": [{"body": "Nevermind, I didn't look at the options on that particular stock. Didn't realize it was that skewed.", "score": 2, "replies": [{"body": "No worries. Puts are 4-5 times more expensive than calls due to the cost of borrowing.", "score": 2, "replies": []}]}]}]}, {"body": "Never done it, but maybe a synthetic put?", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Nope. There is 400% fee for shorting the stock.", "score": 4, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "400% of the value of the stock you borrow per annum. So if you short sell $60, you owe $240 per year.\n\nIt's also nearly impossible to borrow. Effectively, brokers don't have enough actual long-term holders of the stock to be able to lend it to you to short it. Which isn't surprising given everyone is day trading it.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yea - that's why pricing is so irrational here. There is no true price discovery because no one can actually take the other side of this trade to make money, no matter how overvalued we think the Company is", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Oh, we are fucked. When you see articles in Bloomberg and CNBC talking about how retail investors outsmarted institutional investors, hedge funds and Warren Buffett - you know we are at some top-market event looking over a precipice", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Shorting a stock is not just the opposite of going long on the stock.", "score": 3, "replies": []}]}]}, {"body": "If Dyson couldn’t make an SUV at an affordable price, and Tesla has been doing this for more than a decade and is just now getting to the competitive price point, Nikola shareholders are fucked.", "score": 137, "replies": [{"body": "But bro, they have hydrogen.", "score": 100, "replies": [{"body": "It's got electrolytes.", "score": 21, "replies": [{"body": "It's what cars crave.", "score": 16, "replies": [{"body": "It'll quench ya, it's the quenchiest", "score": 1, "replies": []}]}]}, {"body": "Yes, hydrogen.  The least dense substance in the universe.  Good luck getting enough of that into a car to have any serious range.", "score": 59, "replies": [{"body": "*second least dense substance in the universe, don’t take that away from the NKLA investors", "score": 95, "replies": [{"body": "Haha", "score": 9, "replies": []}, {"body": "ROFL", "score": 1, "replies": []}]}, {"body": "Ther is a thing that is called physical state and density doesn't equate energy density\n\nLike always big brain traders on wsb", "score": 22, "replies": [{"body": "energy density too low imo unless you're going cryo", "score": 7, "replies": [{"body": "Yes and that is one of the technological boundaries", "score": 4, "replies": []}]}, {"body": "Who will produce the hydrogen and store it?", "score": 1, "replies": [{"body": "The same/new company that produce/store oil/gas\n\nI'm not saying hydrogen will be definitely the future but for now it seems like a important component in the future energy grid", "score": 2, "replies": []}]}, {"body": "> big brain traders on wsb\n\nAll these big brain traders on WSB and RH are driving up NKLA, just like Hertz's stock went up drastically after they filed for bankruptcy.\n\nSo many big brains.", "score": 1, "replies": []}]}, {"body": "Can you save me some time and give me the cliff notes on why it worked in a bomb? Chemistry is not my shit.", "score": 11, "replies": [{"body": "In an H-bomb the fuel is in a metallic state, LiH, which is way, way, way more dense. The neutrons from the initial explosion (H-bombs use a regular nuke as a fuse, basically) turn it into tritium and deuterium (forms of hydrogen) which then fuse into helium and release a ton of energy.", "score": 59, "replies": [{"body": "Upvoting cause you used alot of big words", "score": 43, "replies": []}]}, {"body": "Nuclear bomb to wipe cities works different than fuel for a car engine but both use Hydrogen \n\nIt is like drinking a cup of water to stay hydrated Vs drowning someone in a lake than freezing their body than blowing them up with TNT. Both situations we are using water but with slightly different methods", "score": 12, "replies": []}, {"body": "I highly doubt that an SUV is going be powered by nuclear fusion.", "score": 25, "replies": [{"body": "SO YOURE SAYING THERES A CHANCE? Car accidents might get ugly tho", "score": 19, "replies": [{"body": "IDK man the cars in Fallout are pretty dope", "score": 7, "replies": [{"body": "Additionally, you can make a car in Fallout explode, which is useful for killing super mutants. Maybe all the NKLA investors are just huge Fallout fans.", "score": 1, "replies": []}]}]}, {"body": "Yeah those [kinds of things](https://consequenceofsound.net/wp-content/uploads/2015/10/73-back-to-the-future-mr-fusion.jpg?quality=80) are only available for DeLoreans.", "score": 1, "replies": []}]}, {"body": "Hydrogen bomb is a 2-stage bomb that uses nuclear fusion as the second stage. Hydrogen cars do not use nuclear fusion. There is a lot more energy stored in the nuclear force than in the electrical force of a hydrogen atom. Like orders of magnitude more energy. But it takes a lot to unlock that energy.", "score": 9, "replies": []}, {"body": "Hydrogen bombs use the energy released in nuclear fusion which can't until now be used to produce usable energy \n\nThe idea used in cars is either combustion of the hydrogen like a normal car or reverse electrolysis to produce electricity like a EV", "score": 7, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "The H-Bombs we build are not true H-bombs. They use a regular atomic bomb to achieve critical temperature needed for fusion. Using Hydrogen to make energy outside of a sun or nebula is extremely hard.", "score": 1, "replies": [{"body": "Yes- it takes extremely high heat.", "score": 1, "replies": []}]}]}, {"body": "Honda's fuel cell car got a range of 360 miles lol. This shit already exists, just nobody made a huge ass truck with it.", "score": 4, "replies": [{"body": "Yes- BUT - no one is building hydrogen refueling stations anywhere because if you want to store more than a few cars’ worth, you have to liquify it.  That happens around -423 degrees F.  That takes a lot of energy to do and to maintain.  I love the peripherals of hydrogen fuel cells, but it’s just not a feasible technology for small vehicles.", "score": 1, "replies": [{"body": "There are in Cali. Kinda like the start of electrics. People might like it more because Hydrogen takes up 3-5 mins to fill up vs 30 mins for ''fastcharge'' cars.", "score": 3, "replies": []}, {"body": "I want to be nowhere near a hydrogen car during an accident.  I don’t care how strong the tanks are, it will explode if it leaks.", "score": 1, "replies": []}]}]}, {"body": "back in the days at Texas A and M uni.- masters program..  we had several internships focusing on metal hydrates, CNG etc. all of them focused on trying to condense h2 or CH4 into smaller less pressurized cylinders/containers.\n\ngasoline/ aka gas/ aka petrol is the best dense fuel source easily transportable for the last 150 years!. PERIOD.", "score": 7, "replies": []}, {"body": "Yeah, should've just used lead.", "score": 2, "replies": []}, {"body": "You have no clue what you're talking about do you?", "score": 4, "replies": []}, {"body": "I mean there are hydrogen cars on the road.\n\nThe thing is hydrogen vehicles tend to cost a bit more. I don't think they got that memo", "score": 1, "replies": []}, {"body": "Just get a big tank and pump that baby up to 20,000 psi. What could go wrong?", "score": 1, "replies": []}, {"body": "Bro it's already being done . You think this is the first hydrogen vehicle?", "score": 1, "replies": [{"body": "Rockets dont count", "score": 1, "replies": [{"body": "Hydrogen fuel cells have been used in cars before, but making the fuel cells is difficult and expensive, and generating hydrogen requires electricity (so why not just use the electricity directly?).", "score": 3, "replies": [{"body": "Because of energy storage", "score": 3, "replies": [{"body": "See above- energy storage is a lot easier and cheaper than H2 storage.", "score": 1, "replies": [{"body": "Depends how long and how much you want to store and not everywhere is enough sunshine year round to make battery technology in the foreseeable future possible", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Even more reason why their company is going to go down in flames like the Hindenburg. \n\nToo soon?", "score": 11, "replies": []}, {"body": "I too, remember when that was \"the future\" 2004. The tailpipe only exhausts water!", "score": 4, "replies": []}, {"body": "Lmao", "score": 3, "replies": []}, {"body": "And without using fuel cells.  It’s a brand new technology that’ll blow up real good.", "score": 1, "replies": []}, {"body": "The craziest thing about their whole hydrogen marketing is that they aren’t even projected to start producing anything Hydrogen based until late 2022.\n\nLike this company is literally nothing right now. It’s like that Lil Uzi line “y’all workin so hard. I don’t do nothing. I don’t do shit” lol.\n\nThey’re not even selling their electric trucks til 2021! They actually don’t do ANYTHING. Their entire valuation is because of Tesla", "score": 1, "replies": []}]}, {"body": "Their approach is much more to rebrand existing products with this Tesla-like tech hype. Their partners will do all the R&D (Bosch) or production work (Iveco) because with 230 employees they can‘t even design a steering wheel. Nevertheless they‘ll fail", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 138, "replies": [{"body": "People who missed the Tesla wave and copevinced themselves history would repeat itself", "score": 121, "replies": [{"body": "\\> copevinced  \n\n\noh thats good", "score": 29, "replies": []}]}, {"body": "The same people who bought Hertz", "score": 15, "replies": []}, {"body": "Fake it till you make it", "score": 14, "replies": []}, {"body": "He’s a good salesman. He’s hyping people up. But he seems shady", "score": 13, "replies": []}, {"body": "this is the best description ever", "score": 20, "replies": []}, {"body": "Actually I’m pretty sure tik-tik is the reason for the pump. I’ve seen multiple “market geniuses” giving their DD on tik tok telling people to buy nkla and get hundreds of thousands of likes and comments. \n\nTl/dr don’t trust tik tok investors", "score": 9, "replies": [{"body": "Here’s some examples lol \n[autist 1](https://vm.tiktok.com/JJgJ5Gt/) \n[autist 2](https://vm.tiktok.com/JJgFaxb/) \n[autist 3](https://vm.tiktok.com/JJgJPn7/) \n\nThere’s a lot more with more views, just couldn’t find them", "score": 4, "replies": [{"body": "Tik Tok pump and dumps lmao, this really is the top", "score": 9, "replies": []}, {"body": "Those are more detailed than your average WSB post", "score": 4, "replies": []}]}]}, {"body": "SPAC pump. worked out for those who held. I'm sure most have bailed already.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I hope when they write a book about this, it’s as full of intrigue and interest as Bad Blood was with respect to Theranos", "score": 4, "replies": []}]}, {"body": "Illuminati confirmed", "score": 1, "replies": []}, {"body": "I’m missing the link between NKLA and the lds church?", "score": 1, "replies": []}, {"body": "u/anonymous4772 was the first poster I saw.", "score": 1, "replies": []}, {"body": "Sitting pretty with 1600% gains.  How’s things going for you? I’m guessing you’ve lost 30-45% on your puts this week?", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 48, "replies": [{"body": "Idk how Trevor Milton does it \n\nI couldn’t do that shit", "score": 6, "replies": []}]}, {"body": "This is like the FYRE festival starting a company and making it public.", "score": 19, "replies": [{"body": "Perfect analogy", "score": 1, "replies": []}]}, {"body": "One big question about Nikola that no one talks about is -\n\nIs there an actual market for hydrogen trucks?!\n\nUnlike with personal cars, where people buy electric and hydrogen for other externalities (saving the environment, virtue signaling, green tax-incentives, etc.), companies that buy class 8 trucks do it to haul freight and generate a profit. Therefore, the math equation for customers isn't simply about is this truck by Nikola cool, but 1) will it be less expensive to operate on a per-mile basis after factoring in initial purchase cost, 2) will it be less expensive to maintain (and will there be enough mechanics capable of working on a hydrogen truck), and 3) is there enough infrastructure to be able to support refueling on highways between long-haul destinations? The answer to all 3 of these questions seem doubtful.\n\nWe are literally at all-time lows for new truck orders because 1) carriers (big class 8 trucking companies) are being squeezed for profitability in the low freight environment so there is no appetite for new capex, and 2) one of the biggest drivers of new truck sales is increased fuel efficiency (which doesn't matter when fuel prices are so low). \n\nTherefore, not only is there a big question as to whether Nikola can deliver a truck in 2022, there is also the big question of will anyone actually buy them.", "score": 17, "replies": [{"body": "InBev has shown at least some interest in electric trucks, they’ve placed an order with Nikola for next year.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "You say short NKLA, I say calls on MSFT, makers of MS Paint. The success of this pump using MS Paint is going to drive MSFT shares into overdrive. This trade is already crowded, the path is clear for Microsoft.", "score": 13, "replies": [{"body": "So MSFT 200C?", "score": 1, "replies": [{"body": "It’s a bigger deal maybe $250 into early June. Transformative. It’s like office suite all over again.", "score": 2, "replies": []}]}]}, {"body": "I wanna short that thing so hard, but the retard buyers let this shit moon. \n\nI can’t win against soo much retardation.", "score": 25, "replies": [{"body": "Put spreads and buy back the lower side after any retard rally and hang onto yours.", "score": 7, "replies": []}]}, {"body": "sell naked calls while you can, free money", "score": 41, "replies": [{"body": "Can't go tits up! ...well the company will, BUT NOT YOU!", "score": 13, "replies": [{"body": "My sources say no", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "Agreed - I’ve been tempted to sell naked calls but the risk is huge. This thing is trading on a fantasy so it could go parabolic \n\nThe fact that the founder has been making the rounds on every show that will have him (Bloomberg, CNBC, CNN, etc) just shows how desperately they are trying to maintain hype to pump the stock. In the CNN interview the dude even wore a shirt with the stock ticker symbol on it. What serious, self-respecting entrepreneur would do that?", "score": 9, "replies": [{"body": "I wish you guys would make up your mind, \"it's going to zero!\" Sell naked calls \"no it's going to pump!\" Just stfu", "score": -6, "replies": [{"body": "You realize there is a difference between short term and long term movements right?", "score": 6, "replies": [{"body": "Yes but given the warrents, I sold short term naked calls and intend to close long dated naked calls when it crashes", "score": 1, "replies": []}]}]}]}]}, {"body": "Better be long term, short term they are pumping the shit out of this", "score": 1, "replies": []}]}, {"body": "I think it says a lot even the renders they've put together are garbage and amateur looking", "score": 30, "replies": []}, {"body": "There's literally no way to profit from NKLA right now.\n\n1. You go long, but it's ready to implode.\n2. You go short, but borrow fee is something hilarious like 700%.\n3. Put premium, same deal like shorts, super expensive.\n\nBut we can watch and laugh I guess.\n\nWhat about CFD's?", "score": 10, "replies": [{"body": "Sell covered calls?", "score": 1, "replies": [{"body": "You lose when this thing implodes", "score": 3, "replies": [{"body": "You're right and I don't know whether it's worth doing 0 DTE plays", "score": 1, "replies": [{"body": "It’s impossible to come up with a trading strategy (other than day trade / gamble on it). Cost to borrow and premiums on puts are too high to trade the downside, and all rational valuation metrics makes holding this for upside gains seem crazy. I think we may just have to all sit back and watch the fireworks from a front row seat. It can be the Theranos of retail traders - you can tell your kids about it one day", "score": 2, "replies": []}]}]}, {"body": "You’d have to own the share, which You couldn’t pay me enough to do.", "score": 2, "replies": [{"body": "Spreads it is then", "score": 3, "replies": []}]}]}, {"body": "Overnight rate for CFD'S is expensive as well, no free lunch unfortunately . Only thing to profit might be writing covered puts way OTM on maybe a weekly time frame. Even that is a little dangerous but is the best option I can see", "score": 1, "replies": [{"body": "Sell call credit spreads.", "score": 1, "replies": [{"body": "if you do this make sure they're OTM otherwise they will get assigned.  OTM call spreads will not net you very much either.", "score": 1, "replies": []}]}]}, {"body": "In the short AND intermediate term there is no play here. Market knows that they will not have a product for a while since the company has already said that much. In the meantime they can keep themselves in the news by coming up with imaginary products.", "score": 1, "replies": [{"body": "The dissonance between the huge number of people shorting this stock, and its price still being skyhigh is astounding, isn't it.\n\nI watched a video yesterday, that went basically like this: \"the pandemic will go away, unemployment will go away, and we're not in a bubble, because in a bubble no one knows we're in a bubble, while I constantly hear we're in a bubble lately!\"\n\nActually this polarization is quite typical in a bubble.", "score": 2, "replies": []}]}, {"body": "Sell bull put spreads (way otm)", "score": 1, "replies": []}]}, {"body": "I really like the company but they need at least 20-40billion in funding build out their hydrogen network, factories and finish R&D. They literally have nothing, 2 prototypes that are not even functional. No revenue until 2024.", "score": 18, "replies": [{"body": "Hilarious that they were worth more than F and are still pretty close.", "score": 9, "replies": []}, {"body": "That seems overly optimistic to believe they'll have revenue in 2024.", "score": 1, "replies": []}]}, {"body": "Worse scams have continued pumping for way longer. Going short NKLA with an options play with current premiums is the epitome of retardation\n\nin what universe does this end up favorably for you https://prnt.sc/t3e8aj", "score": 9, "replies": []}, {"body": "As soon as this stupid ass company started hitting the obscenely high numbers, I bought long puts. \n\nThe hydrogen cell tech they’re pumping is the “hybrid solution” that American car companies were pumping as an alternative to the Toyota Fucking Prius in the year 2005 or whenever it came out.\n\nIt is DOA. It can never compete in efficiency. It’s getting left further and further behind by Tesla (and basically any other EV car)’s battery chemistry.\n\nHere’s an article from [2017](https://www.google.com/amp/s/www.technologyreview.com/2017/04/07/152694/the-fuel-cell-isnt-dead-yet/amp/) saying it’s “dead but there’s still hope!!!”", "score": 7, "replies": []}, {"body": "Ultimate Vaporware company.  Keep buying stock of the CGI Truck company and give Trev enough time to runaway with the money.", "score": 8, "replies": []}, {"body": "Nikola Tesla.\n\nNKLA just a con riding the coat tales of TSLA.", "score": 13, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Not quite fair to [Pets.com](https://Pets.com). They at least were generating revenue and had a business model (albeit one that wasn't profitable at a unit economic level...)", "score": 3, "replies": []}]}, {"body": "This post is 100% puts on NKLA. I am more bullish now. Thanks for the confirmation.", "score": 13, "replies": [{"body": "I hope you're day-trading it; if the company is inherently worthless, it's eventually going to 0 regardless of what the put/call ratio is.", "score": 2, "replies": []}]}, {"body": "I cant wait for the day I wake up to check my broker and see NKLA -60% because of fraud", "score": 8, "replies": []}, {"body": "Is it just me, or did Milton start this company as a joke? I don't even think they're attempting to produce anything, it seems like he figured he'd start a parody of Tesla for kicks. They're called Tesla, we're called Nikola. They make electric-powered cars, we make hydrogen-powered trucks. And somehow he convinced enough speculators (i.e. those who think they can sell it at a higher price before it goes bust) to make him a billionaire. The guy has no technical background in anything, and yes, there are entrepreneurs without technical backgrounds, but how did he even get good engineers to work for him?", "score": 7, "replies": [{"body": "What?  This dude got rich from institutional investors like Fidelity who poured tens of millions into the company long before retail investors came into the fold.\n\nThe guy bought a 20 million dollar ranch like 2 months before the IPO.", "score": 2, "replies": [{"body": "I didn't specify retail investors. The establishment fell for Theranos too. But this seems even more far-fetched than Theranos.", "score": 3, "replies": []}, {"body": "I read it was 84 million ranch... he knew your primary residence can't be seized if you declare bankruptcy", "score": 3, "replies": [{"body": "Like pulling 70-80 million out of a company with no reveni isn't another huge red flag.  Insiders must be laughing themselves silly if they avoid prosecution", "score": 1, "replies": []}]}]}]}, {"body": "This company is sketch. It is nothing but a paper company with no financial history at all. Another red flag, the merged with a special purpose acquisition firm and just changed the ticker. Wouldn't doubt if it's just a sham.", "score": 13, "replies": [{"body": "To be fair that's how most spacs work", "score": 14, "replies": [{"body": "Yeah back entrance to IPO without all of the disclosures. We can all agree it's beyond overbought.", "score": 5, "replies": [{"body": "Exactly. Back doored into being public. No IPO roadshow - no institutional investors asking hard questions about viability of technology / product, getting comfortable and signing up to subscribe to the IPO. Just a shareholder vote by the SPAC...", "score": 4, "replies": []}]}]}]}, {"body": "garbage company with a drawing of a truck", "score": 7, "replies": []}, {"body": "Company made by a bunch of con artists, that shit is gonna fell badly.", "score": 5, "replies": []}, {"body": "SHLL is a much much better play", "score": 8, "replies": [{"body": "hell yea", "score": 2, "replies": []}, {"body": "How?", "score": 1, "replies": []}]}, {"body": "I learned my lesson with BYND. Don’t fight the trend or the short squeeze", "score": 7, "replies": [{"body": "BYND makes delicious food though and you can physically go to a store or a restaurant and order their products. \n\nNKLA is not the same.", "score": 7, "replies": [{"body": "But you can’t beat the amount of retardation in the market", "score": 5, "replies": []}]}]}, {"body": "NKLA doesn’t have any manufacturing facilities and only way they’ll put vehicles out in the market is to make a deal with a leading car manufacturer.  GM must likely won’t do it because their in a battery race war with Tesla over the one million mile battery. Ford might do it since they are the fastest car manufacturer because of the assembly lines. Not only that but NKLA recently called out the all electric F-150, so this the only way ford can make them pay for their words and cause their stock to rise again. Chrysler I don’t think so, too many sub divisions. Or NKLA is just going to tank because nobody will make their cars for them lmao", "score": 6, "replies": [{"body": "Some rumors floating around that it will be Fiat.", "score": 2, "replies": [{"body": "Oh dear god. A fiat with a pressurized tank of hydrogen? What could go wrong?", "score": 7, "replies": [{"body": "The Pinto of Gen Z", "score": 2, "replies": [{"body": "Shopping cart bump it in the parking lot - mushroom cloud.", "score": 3, "replies": []}]}]}]}]}, {"body": "He also claims he has billions in peroorders, but you can go to the website right now and preorder 10 Nikola $200k semis for free, no questions asked.", "score": 3, "replies": []}, {"body": "I actually think this is going to be one of the new cult stocks,i expect it to rocket out of the stratosphere.", "score": 3, "replies": []}, {"body": "I rode NKLA up to $58 (from $35).  I then wrote $25-$35 strike put options collecting $6k+   Then I found out about the PIPE shares and it scared the shit out of me, but the ask price was so much higher than the bid.  I then go lucky last week when the ask got lower than what I paid and bought back all my options for $5k.\n\nBroker also made me put up the full price of the stock at strike price in order to write those options.", "score": 3, "replies": []}, {"body": "I knew this piece of shit company was a scam when I opened robin hood and it said they only have 4 employees.", "score": 2, "replies": [{"body": "Username not checking out", "score": 1, "replies": []}, {"body": "4 employees was the spac (vtiq) \n\nrobinhood just sucks\n\ndo actual research guy", "score": 1, "replies": []}]}, {"body": "Lol. Literally the most overpriced stock.\nElon musk is mocking them constantly.", "score": 7, "replies": []}, {"body": "Welp....about 10% of my portfolio is fucked.", "score": 2, "replies": [{"body": "F, hope you learned", "score": 6, "replies": [{"body": "Not even a little bit.", "score": 11, "replies": []}]}]}, {"body": "profited early from vtiq > nkla   \nnew full well it was a scam entire time. zero actual cash flow or reliable well priced products to sell", "score": 2, "replies": []}, {"body": " [https://finance.yahoo.com/news/workhorse-nikola-investment-undervalued-hedge-195845321.html](https://finance.yahoo.com/news/workhorse-nikola-investment-undervalued-hedge-195845321.html)", "score": 2, "replies": []}, {"body": "Maybe he prefers the social leadership and cheerleading Pom shaking vice actually running a company...\n\nYeah surely that’s it?", "score": 2, "replies": []}, {"body": "This company is the automotive version of wework 😂😂", "score": 2, "replies": [{"body": "It's closer to Theranos. Say you want about WeWork, they still had a product that \"worked\" and generated revenue, just that their business was unprofitable.\n\nTheranos and Nikola raised billions with 0 product which are pipe dreams", "score": 1, "replies": [{"body": "True that's more of a comparison. Was more so comparing the hype. Can't wait for Nikola to utterly fall flat on its face", "score": 1, "replies": []}]}]}, {"body": "Weird.... I always knew the 29th was pre-order day. Maybe stop listening to every YT retard you come across.", "score": 2, "replies": [{"body": "Just so ur aware I have no position but I've seen a bunch of people who had 100 calls for Juuly because of June 29", "score": 1, "replies": []}]}, {"body": "Won’t implode ...we simply don’t have enough public companies for how many dollars are in the markets.  So anyone with an idea and an audited shit co. It’s gonna rain $$$", "score": 4, "replies": [{"body": "Yeah, the government has made it rain in every way. Asset bubble++", "score": 2, "replies": [{"body": "Just all in every ipo", "score": 1, "replies": []}]}, {"body": "Too big to fail now lol", "score": 2, "replies": []}]}, {"body": "Been following this company since November.  At no point has he ever said the truck would be unveiled on June 29th.  It’s always been said that it would be ready to drive and test at Nikola world which now has a date.  June 29th is when reservations for the badger open up, as well as more details.  The trucks specs have been published for a while.  \n\nY’all are a funny bunch that’s for sure.  Go ahead and buy outs if you don’t believe in the company. I’m holding them for a long term and see great potential in the trucks as well as semi’s.  I mean... Anheuser-Busch Busch has had 800 semi’s reserved since November.  I’m pretty sure a multi billion dollar company knows a bit more about this company than you autistic fucks who keep buying over priced outs than crying because theta is fucking you.", "score": 10, "replies": [{"body": "Haha they reserved trucks for literally $0. Why wouldn’t they reserve one, they have nothing to lose and if it works, great. Hell you should go reserve a few $300,000 semi trucks yourself, it’s easy as pie", "score": 22, "replies": [{"body": "Yep I reserved 10 trucks myself", "score": 3, "replies": []}, {"body": "That's actually a great plan, if everyone on wsb reserves a truck, this shit will moon even more.", "score": 2, "replies": []}, {"body": "You really think a company like Anheuser-Busch would reserve trucks with a company and then back out of the deal over nothing? Jesus Christ you must be new to the market.  Investors have reacted over way less details.", "score": -10, "replies": [{"body": "Yes, when Nikola fails to find one of the pork barrel partnerships they need to keep this whole sham together, I fully expect AB will buy trucks that actually function from a different source", "score": 14, "replies": [{"body": "Lol and what are you basing that on? Again, should I listen to autistic retards like you, or the institutional investors like BlackRock who invested in this company? Hmmmm... to listen to people who always lose like you, or BlackRock that manages 200 billion in assets.  Tough decisions!", "score": -6, "replies": [{"body": "Listen man, don’t take this personally, I’m talking about a company, not you. NKLA doesn’t have a functioning prototype, that news just came out a couple days ago. The semi they showed was inoperable for “safety reasons”. In multiple interviews Trevor Milton has stated that NKLA is not planning on building, selling or maintaining any actual products. Everything will be farmed out to third parties. What value does a company have if they don’t have a functioning product, and have no plans to actually make a product?", "score": 7, "replies": [{"body": "And honestly, it doesn’t matter how much false narrative is spread.  That’s the kind of stuff you have to deal with when you invest in one of the lost shorted companies in the market. I’ve already made 1800% return on my investment so nkla could literally drop back to 30$ a share and I would still be profitable.  I took out half my profit and reinvested it and letting half ride. I’m gravy either way.  I’ve done my reseach and I enjoy companies with potential short squeeze opportunities with big catalysts coming.", "score": 2, "replies": [{"body": "Ah so you already sold a large portion of your holdings, good work. Glad we could come to an agreement", "score": 7, "replies": []}]}, {"body": "They are breaking ground in az for a factory.  The person who said the semi’s were inoperable is now being sued for false information. And the market always invests in the future, not in the now.  There are thousands of companies with p/e well over 300", "score": 1, "replies": []}]}]}]}, {"body": "How do you manage to put on socks with a shit brain like this?", "score": 3, "replies": [{"body": "It’s funny how you think you’re right but I’m the one whose made 30k off them.  Have you ever heard of a thing called a stop loss? See, little boy, if things do happen to go south for nkla, my stop loss will trigger and I’ll only lose a few percent after being up almost 1600% on them.  So what have you done lately except lose on your puts? Poor little kid I feel bad for you.  Send me your venmo I’ll shoot you over a couple dollars so you can eat tonight!", "score": 1, "replies": [{"body": "Awwww how cute, never heard of gap downs eh? No position in NKLA, just watching this dumpster fire from afar for entertainment", "score": 0, "replies": [{"body": "Yea I’m sure they will gap down a week before they start taking and reporting paid reservations for their truck; the same news that pumped them 100% before.  But yea, I’m sure this time around it will totally gap down because other investors are as dumb as you.  Good luck, wish I was as smart as you!", "score": 1, "replies": [{"body": "Lol paid reservations hahaha, $8.4bn of reservations that any retard with an email address can do on their website? okay buddy! I sincerely hope you sell everything and dump it into NKLA! Please prove me wrong, I would probably cry myself to sleep if I saw your sick gainz. So cuck me like the retard that I am and go all in.", "score": 1, "replies": [{"body": "Oh so you don’t read news before investing in a company I see.  The badger reservations are paid reservations, with deposits starting at 500$.  You must be awesome at investing when you invest without even knowing basic info like that. 🤪", "score": 0, "replies": [{"body": "$500 for a fucking truck LOL okay. Invest your life savings into a shitty rendering", "score": 0, "replies": [{"body": "... Jesus you’re the dumbest person on this board. Almost every reservation starts at 100-500$ deposit, mostly refundable.  Every. Single. One.  Cybertruck for example, started at $100 refundable deposit.  I’m in awe of how someone lacks so much basic knowledge as you.", "score": 0, "replies": [{"body": "Cybertrucks exist dude, TSLA is a real company with engineers. I used to work with a lot of them that actually worked in TSLA eng department. Imagine defending a pump and dump scheme after being called out thinking you are some big dicked investor who sees “true” potential no one else sees. They have 500% short interest man. Gl", "score": 1, "replies": [{"body": "They must have missed the “and dump” memo then.  As they have been sitting at 110% above their price from ipo over almost two weeks now.  Also, Tesla had nearly 900% short interest for months and months while it ran up from 200$-700$.  I’m surprised you missed that seeing you worked with them.  Keep trying this is funny.", "score": 1, "replies": [{"body": "Seriously though, not trying to fuck around anymore. No insults, no bs. Do you think this is a good company to invest in or just a ticket to make a few bucks off while they pump this?", "score": 2, "replies": [{"body": "It will do exactly what every ipo does; next week after the reso’s it will pump up to 90-100$(which was what it initially pumped to), then go down again as investors take profit.  It will probably settle around 65-80$ and sit there until November when new actual information comes out at the event.  In a few years, when an actual product is on the market, I can see it anywhere from 150-400$.  \n\nI will probably sell right after the run up next week, see where the price settles then buy some leaps on it and forget about it for a few months.", "score": 1, "replies": [{"body": "I actually mostly agree with you about the hype train and ppl pumping this stock before the sell off, and nothing wrong with making money off shitty companies.\n\nHowever, if i have this correct, you think a company founded by a one semester no named college dropout with no background or track record of ever being successful at anything is capable of building FOUR different hydrogen semi trucks? You do realize Elon Musk was involved with PayPal, Zip2, SpaceX before he took over Tesla... at the time Tesla was facing bankruptcy. It took them four years to build the first Tesla Roadster by using existing drivetrain from a Lotus. Tesla also employs some of the most driven and retardedly smart engineers and scientists from world renowned universities. The credentials of every single NKLA employee is laughable, they can't even design and build a fucking chair if they wanted to. \n\nFinally, what makes hydrogen a good fuel? It's more expensive per mile and there are no existing infrastructure at all for hydrogen powered cars. You can argue that NKLA is outsourcing all the manufacturing to other companies, but do any of those companies have a track record of building cars let alone hydrogen powered cars? Many giant car companies tried to compete with TSLA and lost, do you know why? Because the existing tools for manufacturing and assembling EVs did not exist before TESLA built everything they have pretty much from scratch, I know this because I used to work with an engineer that worked at Tesla Fremont specifically on software that controlled the assembling lines. He said that after years of tweaking, Tesla's success rate of building a car from start to finish without any problems at the finish line is 9%, compared to 96% at a Toyota plant. This was back in 2017, so I'd assume Tesla improved this number, but just to show you how difficult it is to build cars from scratch.\n\nThis company has Theranos written all over it, there are PIPE shares that are being released today, 52 million shares that initial investors bought in at $10, the outstanding shares right now is like 24million btw, guess which share you own? \n\nIdk where the fuck the SEC is at the moment, all the shills that say start ups all start with nothing and build from there, shows they know nothing about the start up world or technology. NKLA's prototypes have no proof that it's actually hydrogen powered, Bloomberg article came out saying that there are no components in their trucks that show the technology they claim they have. Also a start up ceases to be a \"start up\" once they are publicly listed, they merged with VTIQ, so they avoid the stringent auditing that an IPO usually requires, its a fucking loop hole and its sketchy as fuck. \n\n&#x200B;\n\nLook I have no puts or shorts, because they are too expensive, even if they halved their value tomorrow, the puts won't even print because everyone already know this company is a scam. I do have a problem with pump and dumps because I fell for one when I first started trading, lost about $1500 from my first paycheck, I hate BS and this company is ALL BS and zero substance. You are in charge of your own capital, so do what you will with I said, I care less and less with every word I write, but I don't want to see ppl piling in their hard earned cash to make some fucking sketchy no ethic suit richer.", "score": 2, "replies": [{"body": "The track record thing isn’t true at all.  He founded and sold dhybrid systems and was upillar.com ceo prior to that.  His net worth was actually over a billion dollars from these two careers alone far before he founded Nikola.  It may not be the success story of PayPal, zip2, etc. but I do like people who came from nothing and built a billion dollar empire.  I haven’t looked much into those two prior companies but their websites still exist so they are still up and running.  It takes a lot of talent to build three separate companies and(completely ignoring his net worth add from Nikola) making billions in the process.  Everything else you said might have merit to it, that yet to be determined.  \n\nBut I’m a huge fan of finding a disruptive company.  There is thousands of humdrum stocks out there that you can invest in.  But I want to get into an Apple, zoom, Shopify, Tesla type company at first.  Even if I lose 50% of my capital invested In them, I’m up big.  But why not give it a chance? What if he’s the real deal? I mean, Nikola has been around for a couple years and everyone had only good things to say about it until it became a 20 billion dollar company.", "score": 0, "replies": [{"body": "Listen dude, not trying to break your balls, seriously, I do start ups and make software for a living, upillar.com looks like someone made it in one day 15 years ago. The dude claims to be a billionaire, anyone can do that, you don’t need proof to put that on your Wikipedia page. There’s nothing public about the acquisition of dHybrid systems, so your guess is as good as mine as to how much it was sold for, but no fucking way it was for anything close to 7 figures. So idk how any of that makes him a billionaire with a capital B. I have a C Corp registered in Delaware, I am listed as the founder and CEO, doesn’t mean shit lol.\n\nThis company is nothing like Tesla, Zoom, Shopify, my whole fucking life is about start ups, I quit my 200k a year job to do it. Distruptive companies don’t go public from zero product, look at Uber, Airbnb. Shopify for instance started as a surf board website, they got so much demand from other ppl asking them to license their website software to them, they ditched the whole selling surf board idea to pursue building websites full time. It took them like 7 years to IPO, they were seeing triple digit YoY growth before that. I’m telling you with 100% fucking confidence, NKLA is a scam, they will get delisted in a year, they will not make a single fucking car.", "score": 3, "replies": []}, {"body": "Also nobody ever came out and said Elon is a scam artist, they doubted his ability to scale Tesla production sure, but he has proven time and time again that he can fucking do it. What he accomplished with SpaceX alone is one for the history books. Trevor fucking Milton is a SCAM artist, and I'm not the only one or the first one to say it. Look at how many threads in r/wsb, r/investing that is calling out this scam. Look up \"NKLA scam\" on Youtube, Google, many mediums, many ppl with actual evidence saying this company is going down and most likely a pump and dump scheme.", "score": 1, "replies": []}, {"body": "Read the sources of his Wikipedia page, all his \"track record\" came from Linkedin bro, I can edit my Linkedin to say I own Boeing. Only other reference comes from Forbes, in case you didn't know, you can pay Forbes to write an article on you, look up how they vet if you are actually a billionaire... they don't.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "How’s those shorts looking faggot", "score": 1, "replies": [{"body": "Lol you clearly can’t read, did you graduate HS? Never had shorts retard, I would not short a pump and dump. This company is a fraud, I have no dogs in this game, just wanted to help you out, but clearly you have a small pp and have something to prove buying into a pump and dump.", "score": 1, "replies": [{"body": "Thanks for the help, just up another 50% today!", "score": 1, "replies": [{"body": "Dude I’ll never be mad at for fellow retards here making money. If you’d said you knew this is a pump and dump scheme and you wanna get in on the pump it was fine. But you shit brain telling you they are a real competitor to TSLA? I can’t tolerate stupidity, especially when a retard thinks he’s a big dicked investor while holding a Wendy’s drive thru job", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Lmao the same way Walgreens knew about Theranos right? Don’t be so sure that billion dollar companies always have their shit together and are immune to H Y P E", "score": 25, "replies": [{"body": "This, tbh. People grossly underestimate how incompetent conglomerates are.", "score": 13, "replies": [{"body": "Everything really is a house of cards that hasn't collapsed. I've seen shit where it's like the veil is pulled and you realize holy shit no one has a clue.", "score": 3, "replies": []}]}, {"body": "How’s those shorts lookin? Hahahahaha", "score": 1, "replies": []}, {"body": "I’m chilling on my 1500% returns.  I enjoy investing in companies with a short squeeze possibility with a major catalyst two weeks away.  You do you, invest in what you believe.  But you’re insane if you think nkla will drop in price come June 29th.  You would have to be autistic as fuck to short a company that is about to take paid reservations for a brand new truck.", "score": 1, "replies": [{"body": "You said 1800% returns in a different post, which is it? Also the IPO was at ~$10 and NKLA is now at ~$65. This is the hard part so stay with me, if your investment  doubles you got 100% returns. Triples you get 200%. Yours apparently has gone up roughly 6x so far for... wait for it... 500% returns. No need to triple your return rate just to look cool to a bunch of retards gambling their student loans.", "score": 2, "replies": [{"body": "I bought calls for June 19th 30$ in early may. Calls can go up more than stock prices you know.", "score": 2, "replies": [{"body": "Ah well, 1500%, 1800%, what’s a little 300% error here and there", "score": 1, "replies": [{"body": "oh c'mon, I'm not saying I believe Yoinke specifically about his claim, but 1500% vs 1800% (comparing insane, massive % to higher, insane massive %) is a plausible mistake and is not the same as a 300% error when talking about 0% vs 300%. So this is a bad argument by itself.", "score": 3, "replies": [{"body": "If my memory serves me right they were at 1800% then started dipping and my stop losses triggered at around 1500%. \n\nSeriously, these people probably haven’t hit a 4 bagger before.  Once your above 1200% things move fast af.  There is like 15 minutes difference between a 1500% and 1900% gain sometimes.", "score": 1, "replies": []}]}, {"body": "Lol honestly I forgot what it was when I sold.  Looked it up, it was 1500% ish", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I posted this separately, but will summarize below since I think it gets at the crux of your bullishnesss:\n\nIs there an actual market for hydrogen trucks?!\n\nUnlike with personal cars, where people buy electric and hydrogen for other externalities (saving the environment, virtue signaling, green tax-incentives, etc.), companies that buy class 8 trucks do it to haul freight and generate a profit. Therefore, the math equation for customers isn't simply about is this truck by Nikola cool, but 1) will it be less expensive to operate on a per-mile basis after factoring in initial purchase cost, 2) will it be less expensive to maintain (and will there be enough mechanics capable of working on a hydrogen truck), and 3) is there enough infrastructure to be able to support refueling on highways between long-haul destinations? The answer to all 3 of these questions seem doubtful.\n\nTherefore, not only is there a big question as to whether Nikola can deliver a truck in 2022, there is also the big question of will anyone actually buy them. As for the pre-orders from AB-Inbev, it's not surprising. With no deposit down, why not put yourself at the front of the line to see if Nikola can deliver what they promised. If they can deliver a truck that operates more cost-efficiently on a per-mile basis than diesel today (or electric competitors), great you are first in line. If they can't deliver what is promised - then you cancel your order. AB-Inbev is taking on no risk. But you as a long-term investor, are taking on the risk of product development, production and delivery.\n\nAgain, I'm not saying you can't make money short-term buying near-dated calls and seeing massive run-ups, but a long-term bullish case here just seems absurd.", "score": 1, "replies": []}, {"body": "Thank you for keeping my short puts safe.", "score": -1, "replies": [{"body": "How are they doing btw? I’m guessing you’ve lost 20-40% on them this week due to theta? How’s that working out for you?", "score": 2, "replies": []}, {"body": "HOWS THISE SHORTS LOOKING, bitch?", "score": 1, "replies": []}]}]}, {"body": "Any PCG news?", "score": 1, "replies": []}, {"body": "been selling weekly puts on these guys. easy $$", "score": 1, "replies": []}, {"body": "Ford needs to release a hybrid or electric Ranger. Call it the F-Zero Ranger.", "score": 1, "replies": []}, {"body": "I think the drop that options have factored in right now is way too much. \n\nI am selling put spreads even though I am bearish on NKLA short term because the risk reward is just to advantageous.", "score": 1, "replies": []}, {"body": "Shits gonna Moon buy calls boys!!!", "score": 1, "replies": []}, {"body": "The tale of the dale.", "score": 1, "replies": []}, {"body": "I caught on to this pump and dump the week before it blew up, 2 days, 100% profits, I took it and left.", "score": 1, "replies": []}, {"body": "I dont know if they'll actually have a working/selliible product but December but the red flags coming from NLKA are considerable.", "score": 1, "replies": []}, {"body": "Inverse WSB and buy calls. \nI don't know if that's actually more retarded.", "score": 1, "replies": []}, {"body": "You tards ever hear of debit spreads on puts??", "score": 1, "replies": []}, {"body": "Certainly has that Theranos feel to it. He's getting into a market with fierce competition. I'm sure like his other companies he will just pump and dump to his competitors.", "score": 1, "replies": []}, {"body": "What if we all go in on N-I-O? And make it the next nkla", "score": 1, "replies": []}, {"body": "Nkla is overhyped cuz they don't have musk", "score": 1, "replies": []}, {"body": "Imaginary vehicles that run on garbage.", "score": 1, "replies": []}, {"body": "With all the share diluting... Has to go down, I guess. Warrant might be interesting but I don't know how that shit exercises to normal shares.", "score": 1, "replies": []}, {"body": "Well, I guess we’ll see what happens tomorrow.", "score": 1, "replies": []}, {"body": "People who purchased nkla shares should be a different breed", "score": 1, "replies": []}, {"body": "LMFAO GET FUCKED YESSSS CALLED THIS SHIT NONSTOP", "score": 1, "replies": [{"body": "Lmao, how’s those shorts looking, faggot", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Lol the $65 puts are $35 with a 242 IV. Looks like everyone already knows unfortunately.", "score": 10, "replies": [{"body": "Exactly. No room for $ on this.", "score": 1, "replies": []}]}]}, {"body": "This poor guy is just too autistic", "score": 1, "replies": []}, {"body": "NKLA was invented for autists.", "score": 1, "replies": []}, {"body": "Man this whole discussion is just a bunch of circle jerk watching a company goes to shit.  Im glad yall talking shit.  ib4 NKLA goes to 40 and bounce to moon.\n\nThese clowns here buying shorts and buying calls and buying puts and selling puts and blah blah blah.  Im over here buyin warrants so i can convert to shares to sell.  Yall over here truely austistic AF", "score": 1, "replies": []}, {"body": "How are they going to produce hydrogen? Probably by splitting water molecules? If so, wont it cause massive water shortage and environmental issues at various locations?", "score": 1, "replies": [{"body": "It's a scam. They need energy to split water into Hydrogen and Oxygen. Then the Hydrogen is used to produce energy in the trucks. They use more energy to obtain the hydrogen. I don't see how this is sustainable", "score": 2, "replies": [{"body": "Yeah if there’s water involved that’s a nasty process. I’m surprised with the other dude replied to my comment that a cup of water produces a large volume of hydrogen. This got a couple of upvotes and I’m flabbergasted.", "score": 2, "replies": []}]}, {"body": "a dixie cup of water can generate about a hundred liters of hydrogen, so I doubt water shortages would ever be an issue.", "score": 2, "replies": [{"body": "But energy of a gas is better measured by mass but not as volume. Having said this, [9kg of water](https://cleanenergypartnership.de/en/faq/hydrogen-production-and-storage/) is required to produce 1kg of hydrogen. Good thing is hydrogen has 3 times energy density (per kg terms) than that of diesel or gasoline.\n\nBut you still need shit loads of water to split!", "score": 1, "replies": [{"body": "9k of water is about 2 gallons. \n\nFor context, the Rhine river is a decent sized river, ranking 92nd in flow rate. It flows at a rate of 750,000 gallons per second.", "score": 1, "replies": [{"body": "Dude what are you? A high school kid? No one would advise 9x use of water to produce x amount of Hydrogen. That would cause a massive environmental impact. I’m not against NKLA but I’m concerned about the environmental impact of the concept.", "score": 1, "replies": [{"body": "Do you have any idea how much water is the world? If I dammed off the Etowah rive in bumfuck Appalachia for a day I would have enough water to produce fuel for the entire nation for a year.\n\nAnd then when you burn it, it becomes water again and returns to the water cycle.\n\nSplitting water isn't some new discovery, it's been talked about for fucking decades. The environmental impact comes solely from the fact that coal has been the major source of the energy used to split water.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Tesla actually makes vehicles, had $25B in revenue last year, has multiple revenue streams, and has been profitable 5 of the last 7 quarters.\n\nNKLA isn’t even planning on making their own products and has $0 in revenue. \n\nComparing Trevor Milton to Elon is dumb as shit", "score": 6, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "TSLA was actually building and selling functional roadsters. NKLA has some cute drawings.\n\nEdit: More importantly NKLA has no plans to build, sell or service anything. What would you say they do?\n\nEdit2: I’ll also add that at the time the original roadster was the fastest and longest range production EV ever built. They showed signs of being a game changer. NKLA not so much", "score": 3, "replies": []}, {"body": "The difference is that Tesla was ACTUALLY making and selling vehicles. NKLA only has 3D renderings", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "As a public company? NKLA IPOed with no functioning product", "score": 3, "replies": [{"body": "Public or not, I’m speaking in general. You obviously don’t remember when Elon musk was considered a joke and Tesla was all but written off", "score": 1, "replies": [{"body": "Irrational market sentiment is how a lot of money can be made or lost. TSLA below $200 a year ago was a hell of an opportunity, people buying calls/investing when NKLA is at a $24B market cap with no product will be a hell of a way to lose money. Are you gonna be on the wrong side both times?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Man thank God I found this. I thought I was the only retard that was extremely bearish on NKLA. I would buy some puts if the premiums weren't so damn high.", "score": 0, "replies": []}, {"body": "Why do you say it’s a pump? Tesla takes reservations before production. Why is this any different? In my opinion the badger looks way more refined than the Tesla truck.", "score": -8, "replies": [{"body": "One of them is a real truck, made by a company that makes real vehicles.", "score": 20, "replies": [{"body": "Wasn’t Tesla a startup at some point, why is this one and any new player to the field a pump? How is the  Cyber  a real truck when there has been zero produced?", "score": -13, "replies": [{"body": "It's actually been driven. It has a drive train and everything. I saw a person break its windows on stage. Nikola has renderings of vehicles that don't actually exist, and public investors are being shilled a product that could very likely never see delivery.\n\nAnd long before tesla went public, they had already made deliveries of vehicles. Comparing them is fucking stupid.", "score": 25, "replies": [{"body": "Brilliant point that everyone is missing. +1", "score": 8, "replies": [{"body": "It's not brilliant.\n\n But it gives me perspective as to why I need such a stupidly high net worth to invest in privately held companies here in the US.", "score": 5, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "White trash single parent household here. I signed away my freedom to free myself from poverty. I'll be a nuclear propulsion plant operator pulling in 50k-60k a year for the next 7 years. \n\nI know I'll get there, but right now SpaceX is monopolizing space and not having exposure to that for the next 8ish years sucks.", "score": 4, "replies": []}]}, {"body": "You also have to have a solid bullshit meter. So many private companies will either scam the shit out of investors or their financials are fucked in the ass so hard that their financial reports have prolapsed assholes. But since they are private, you can't audit them like public companies.", "score": 4, "replies": [{"body": "Bro I just want to put money into SpaceX", "score": 4, "replies": [{"body": "Fuckin a, man.", "score": 1, "replies": []}]}, {"body": "Tell that to the Waltons and Mattis after they got assraped by Theranos.", "score": 1, "replies": []}]}]}]}, {"body": "And Tesla is now occupying the Tesla-shaped hole in the market. What hole is nkla going to fill? They are going to unseat tsla? Better than ford?", "score": 1, "replies": []}]}, {"body": "Tesla had private capital only when they produced the roadster in 2008. They proved that they could design and build a real vehicle that worked and people wanted. It IPO'd in 2010.\n\nIt also had a market cap of less than $2b at IPO and didn't reach Nikolas current market cap until 2014 when it was selling 10s of thousands of model S and had made another profit. \n\nIf Nikola was worth 2b now no one would give a shit. That's normal levels of retarded for a hope and dream story. Nikola still has zero revenue.", "score": 1, "replies": [{"body": "[30,000 trucks/year in 2027 they say](https://www.cnbc.com/2020/06/09/meet-nikola-the-speculative-electric-vehicle-stock-that-traders-believe-is-as-valuable-as-ford.html)", "score": 1, "replies": []}]}, {"body": "Tesla had an actual vehicle they produced before going public and needed money to expand. NKLA has drawings, no functional power trains, and will third party literally everything. What exactly would you say they do?", "score": 1, "replies": []}, {"body": "What was Tesla’s share price at $0 revenue? People don’t understand that the reason venture capital investments look so amazing in retrospect is that 95% are losers. That’s why they generally haven’t been marketed to retail investors—too much opportunity for fraud and pie-in-the sky valuations when investors’ idea of due diligence is a WSB post.\n\nIt might be a real company some day. But the venture capital investors who actually have seen the books and understand the risks valued the company at 1/6 it’s current market cap just 3 months ago. That’s because they understand there is a real chance this company never ships a product to anyone, and a huge chance it never achieves profitability. Retail investors seem to have not priced in any chance of failure, assuming they know this will be the next Tesla when there is a better chance that it’s the next Faraday or Dyson EV.", "score": -1, "replies": []}]}]}, {"body": "one of them is real tho", "score": 2, "replies": [{"body": "What, you don't drive imaginary cars?", "score": 5, "replies": [{"body": "yeah. my imaginary millions(profits) from NKLA riding in a vaporware truck.-\n\ni think nkla should get into cgi animation business.- they made fantastic imaginary vehicle videos!.", "score": 3, "replies": []}]}]}]}, {"body": "I feel like theres just a bunch of salty people here because they missed out on a 10 bagger", "score": -6, "replies": []}, {"body": "I'm shorting it simply because the company is called Nikola... China the land of stolen ideas and slave labor. Long live papa musk and johns", "score": -1, "replies": []}, {"body": "Wheeling nkla is the way", "score": -2, "replies": [{"body": "Reverse wheel to build a long term short position", "score": 2, "replies": [{"body": "I actually agree? I see selling weekly 55 puts?", "score": 1, "replies": [{"body": "Nah sell calls first to be net short if the call is itm", "score": 1, "replies": []}]}]}]}, {"body": "Look at all the negativity in here. Only a few positive comments. I'm even more confident in my NKLA warrants. If you want to make money and don't think NKLA will tank, there is more than a 50% premium. That is the way to make $$$.", "score": -3, "replies": [{"body": "So tell me, on July 6th will you exercise them?", "score": 2, "replies": [{"body": "Depends on the price. I expect the stonk to go down that day as all the warrants hit the market.  If the warrants aren't too far off a day or two before, I will probably sell the warrants to lock in significant tendies. If there's still a ridiculous gap, I will just exercise and sell when it climbs back up.", "score": 1, "replies": [{"body": "Yeah exactly, everyone and their mom will be selling on that day. I'm thinking about getting out of my shares asap if monday will also be bad.", "score": 2, "replies": []}]}]}]}]}
{"title": "The markets can stay irrational longer than any of you cucks can stay solvent", "selftext": "While most of this sub reddit is filled with autists who moan JPow fuck me daddy while ejaculating, there is another section of autists who sit at the corner crying the market is rigged. \n\nThis post is for the latter. Don't buy puts. I repeat DON'T BUY PUTS. \n\nMost of you retards learnt their lesson when you got fucked post March, but fuck, some of you gay bears just won't quit. You'll post elaborate DDs on why we should short SPY and go long on VIX blaming fucking TQQQ and the other leveraged funds. \n\nSave your money to buy rent for your wife's boyfriend. A friend of mine used to yell SPY puts for life till one month back. He lives with his grandma in Florida now. \n\nSave yourself and save your money.", "id": "hcorij", "created_utc": 1592669199.0, "score": 413, "upvote_ratio": 0.9, "num_comments": 128, "comments": [{"body": "[deleted]", "score": 368, "replies": [{"body": "This is the way", "score": 126, "replies": [{"body": "Yes, me too, can also take out a heloc at low interest rate, also applied for SBL for my ghost companies, 500k 30 yr at 1%", "score": 35, "replies": [{"body": "Get it gurl", "score": 14, "replies": [{"body": "If this don’t work and I don’t have 20mil by end of the year, I’m going to declare bankruptcy\n\n... if everyone (1.3 mil Autist of this thread) follows suit, well see if the FED can remain liquid and solvent longer than us", "score": 44, "replies": [{"body": "Hahahahaha... You really think the personal bankruptcy of over a million retards will affect the federal reserve or the economy, you spend all your money on options, you're not even part of the  economy in the buying goods and services, 🤣", "score": 19, "replies": [{"body": "It sounds like the puts you sold r gonna get assigned, good luck.", "score": 16, "replies": [{"body": "What? How do you know I sold puts?", "score": 4, "replies": [{"body": "You think the market is your friend. You've merely adapted the market. I was born in it, molded by it. I didn't see green until I was a man and by then it was too late. \n\nTalk to me, how do you feel over the weekend, knowing that the market panic sold eod yesterday AH? \n\nApple announce store closures, Disney’s reopening plan hasn’t been approved, only additional bad news can come out with states ordering stay at home again?", "score": 18, "replies": [{"body": "Bane? \n\nPs. Rolling down and out, a technique WAY too advanced for wallstreetbets, 🤣 I never take a loss selling options buddy, I'm patient as the rain on a mountain I will turn to sand", "score": 3, "replies": [{"body": "There's nothing advanced about it. People here don't do it because of the low upside and how capital intensive it is to do. You're in WSB, nobody here wants to tie up 20k on collateral so they can make 250 a month.", "score": 2, "replies": [{"body": "Cool, enjoy your continued losses bro,\n\nI'm really only here for the memes, and to watch the losses, they're hilarious!!! 🤣", "score": -1, "replies": [{"body": "Here for the memes too. I don't lose money. I don't yolo. I day trade ITM options. I'm not directionally biased. Just trade off price action. I also don't think selling covered calls and then rolling them as the price moves makes one a rocket scientist.", "score": 3, "replies": [{"body": "Sorry about all that, jsu kidding man, it's been a LONG weekend, and not a good one.\n\nGood luck trading brother!!", "score": 0, "replies": []}]}]}]}]}, {"body": "Look at Viacom alone, I sold 2 puts when the stock was trading near 28, closed it out yesterday, I gained $22, someone who would have bought/sold the common stock when I did would have lost $800, happy trading pal...you'll grow your wings someday 🤣💵💵💵💵💵", "score": -3, "replies": []}]}]}]}]}]}]}]}]}, {"body": "dont forget student loans!", "score": 7, "replies": []}, {"body": "Go get it Tiger!", "score": 1, "replies": []}, {"body": "Up to your personal risk tolerance?", "score": 1, "replies": []}]}, {"body": "Puts are strange creatures. Calls are easy. When the market is rising, volatility decreases, the price of options decrease, the market keeps rising, the cycle repeats. Any cuck can make money with calls.\n\nBut puts... The moment the market starts tanking, the price of puts skyrockets with volatility. And when the market tanks, it's a compounding effect. It's not a steady rise, it's a fall off of a cliff. All of the suckers who didn't already have puts are too late, and the ones bought them while they were cheap are rich.\n\nAre we here to make money? No you fucking fugazi cucked paint licker. We're here to fly to mars in a yacht powered by blow and the sucking force of a thousand hookers. Take your advice to /r/investing with the other cucks where it belongs.\n\nBan.", "score": 95, "replies": [{"body": "This is the way. Need that 25x in one trading session", "score": 21, "replies": [{"body": "25x profit would be fucking awesome. That's like $2500. I could finally buy that full size sex doll I always wanted.", "score": 12, "replies": []}, {"body": "I hit 560% in one day before", "score": 1, "replies": []}]}, {"body": "permabull but i like your logic top to bottom. \n\ngood luck bro", "score": 5, "replies": []}, {"body": "VXX calls?", "score": 3, "replies": [{"body": "Well to be honest that's like me saying \"To get there you need to drive down the highway\" and you replying \"Well you could also drive there in reverse did you think about that?\"", "score": 1, "replies": [{"body": "Sounds like my style", "score": 1, "replies": []}]}]}, {"body": "Presdential.", "score": 2, "replies": []}, {"body": "“Stonks only go up” might be a meme but every joke is based in some truth", "score": -1, "replies": []}, {"body": "You're forgetting theta", "score": -4, "replies": []}]}, {"body": "Life savings on puts it is. And im not even joking", "score": 104, "replies": [{"body": "Picture or ban", "score": 28, "replies": []}, {"body": "I'm bearish too but... Life savings? *shudders* At least get proper shorts, at least those don't expire", "score": 39, "replies": [{"body": "It's only 17 dollars.", "score": 98, "replies": []}, {"body": "They also don't stop raping you when the market goes up.\n\nUnlimited losses ftw?", "score": 16, "replies": [{"body": "Yes, losses limited to...\n\nall your money.", "score": 7, "replies": [{"body": "yeah i wiped 1 acc already, coming back with a vengeance though 🏳‍🌈🐻", "score": 1, "replies": []}]}]}]}, {"body": "Proof", "score": 4, "replies": []}, {"body": "Me to man, love that AH drop got 36k in spy puts.  Pls open blood red on Monday please god", "score": 2, "replies": []}]}, {"body": "Call me a cuck one more again. But look me in the eyes this time and slap me. I haven't had a chubby like this in days", "score": 48, "replies": []}, {"body": "People can keep repeating this quote longer than companies can stay solvent", "score": 47, "replies": [{"body": "Fuck, someone should give you an award", "score": 5, "replies": []}]}, {"body": "damn dude a bull warning people not to buy puts cause money printer go brrr holy shet who is this guy?!??!? i mean other than a huge faggot.", "score": 52, "replies": [{"body": "Your wife’s boyfriend, faggot", "score": -43, "replies": [{"body": "My wife’s boyfriend would fuck you up", "score": 52, "replies": [{"body": "My wife’s boyfriend could beat the shit out of both of your wives boyfriends.", "score": 1, "replies": []}]}]}]}, {"body": "I can stay solvent longer than the market can stay irrational by simply taking my cash out of the market.\n\nThink about *that*, Mr. Market.\n\n...and if you threaten me with inflation, I'll just buy gold.", "score": 28, "replies": [{"body": "Or u can start a business and never claim any profit", "score": 8, "replies": [{"body": "And what does this do", "score": 2, "replies": [{"body": "Allows you to eventually become AMZN.", "score": 10, "replies": [{"body": "Error, became bankrupt", "score": 1, "replies": []}]}]}]}]}, {"body": "This won’t age well", "score": 13, "replies": [{"body": "I never said don’t buy puts altogether. I’m saying be careful in expiry with these time bombs. You never know when they’re gonna explode", "score": -6, "replies": [{"body": "[deleted]", "score": 24, "replies": [{"body": "Buy puts.", "score": 9, "replies": [{"body": "dont buy puts but buy puts", "score": 1, "replies": []}]}]}]}]}, {"body": "I cashed out just a week before the lows in March and just got back in last week with puts.\n\nWhat you descrived is why you go long with cash you can afford lose. Its basic EV. You dont need to know *when* the crash occurs only the *likelihood* it will occur over a certain time range and place your bets accordingly. Worst case is you miss on some gains and still have lots of ammo. Best case is you get multiple returns on principle and can sleep like a fucking baby not needing to worry about Rona lockdown 2.0, a CLO apocalypse nor JPows printer getting broken.\n\nKeep your powder dry, your risks manageable and tap-dancing shoes ready.\n\nWere going to eat some fucking veal.\n\n🌈🐻", "score": 10, "replies": [{"body": "Too many words, what puts do I do to make money. Speak slowly please.", "score": 5, "replies": []}]}, {"body": "Lame fail at shitpost", "score": 36, "replies": [{"body": "Coming from someone who has never posted anything on reddit ever", "score": -43, "replies": [{"body": "Ooo you got me so good! Lmao", "score": 21, "replies": []}]}]}, {"body": "Time to buy puts when everyone thinks buying puts is a bad idea. Thanks.", "score": 6, "replies": []}, {"body": "We know. That's why it's  called gam-bl-ing", "score": 6, "replies": []}, {"body": "If you buy puts... Just make it a spread", "score": 5, "replies": []}, {"body": "Let's see how long your rational works. Buy puts on the way down and calls on the way up, being nimble is more important than rationale", "score": 13, "replies": [{"body": "Won't work anymore. Too much random interferences such as vaccine news and the Fed that literally triggered a whole month rally. Buying calls on dips feels much safer tbh.", "score": 13, "replies": [{"body": "Being a bear right now is like staring at a haystack and being offered $100 to find a piece of hay or the same to find the needle. They choose the needle every time and get pissed.", "score": 12, "replies": [{"body": "/r/meirl", "score": 1, "replies": []}]}, {"body": "This", "score": 3, "replies": []}]}]}, {"body": "Jokes on you, the American system has extended me credit 3x my annual income and I intend to see this thing through. Break-even by 2021 LET’S FUCKING GOOOOO", "score": 4, "replies": [{"body": "3 x $0 is still $0, autist.", "score": 1, "replies": [{"body": "Then why are Chase and American Express leaving me voicemails daily", "score": 2, "replies": []}]}]}, {"body": "You’re obviously the gay one here.\n\n🐻🍭.", "score": 3, "replies": []}, {"body": "having the fed buy corporate bonds, what could go wrong?\n\non the other hand it would possibly be helpful for the economy and market as a whole, and banks are kind of old fashioned institutions compared to large corporations", "score": 3, "replies": []}, {"body": "I just made 300% on vix calls, brah. I think as a bear this market is stupid, and driven by jpow. There are still quality companies out there like AMD. So I am going to sell cash covered puts. Repeat until I get assigned, wait for stock to rise 2.5%. Then sell covered call. Repeat until assigned and go back to selling cash puts and start process over. Over time you can't go wrong if jpow is in charge.\n\nI would like to be able to predict these little vix hiccups though. Maybe make.some big bets once in awhile. But yeah buying puts or selling calls is dumb.", "score": 3, "replies": []}, {"body": "Challenge accepted fuck face!", "score": 3, "replies": []}, {"body": "This is dumb... Literally a day ago you'd of profited from buying puts", "score": 10, "replies": [{"body": "Just 5 days out of last 3 months. Wow, great analysis", "score": -10, "replies": [{"body": "If you're dumb enough to hold them for the 3 months then yeah, don't buy puts. I don't feel like looking at my trade history but I'm like 99.9% sure I made money on puts more than 5 times this month", "score": 9, "replies": []}]}]}, {"body": "This is groundbreaking - I've never heard it before.  You are a genius!", "score": 2, "replies": []}, {"body": "You are not my supervisor!", "score": 2, "replies": []}, {"body": "This is literally the best time in history to play the market. Don't be mad you lost.", "score": 2, "replies": []}, {"body": "I was buying puts and lost money so I started selling puts and now I'm making money.", "score": 2, "replies": []}, {"body": "Florida is nice", "score": 2, "replies": []}, {"body": "Irrespective. $SPY touches 300 before touching 310. There’s a time to get bullish. And it’s when we have momentary corrections like the one we’re in.", "score": 2, "replies": []}, {"body": "Market will drop soon and a retest of the lows will follow. Never in history a central bank was able to modify indefinitely a bear market dynamic.", "score": 2, "replies": []}, {"body": "So what you're saying is \"Just don't do anything\"? Sounds like Cash Gang to me.", "score": 2, "replies": []}, {"body": "Tis going to be a Red Oktober, gentlepeople. In the almighty words of Cap’n Bart Mancuso, “The hard part about playing chicken is knowing when to flinch.” Trump gets less than 35% of the vote because of it.", "score": 2, "replies": []}, {"body": "IF this market crashes, I don't see the Fed allowing it to happen until after election day. They will break every sane rule and practice to have a \"strong\" market going in to the elections.\n\nOf course, the fall after that will be harder than it would have been otherwise.", "score": 3, "replies": []}, {"body": "They like to trade counter trend and doesn’t understand what a pull back is. So using TA they jump in AFTER the market drop.", "score": 2, "replies": []}, {"body": "My puts have done pretty decent last two weeks lol", "score": 2, "replies": []}, {"body": "I too am tired of reading about bears complaining how everyone is out to get them and not the fact that they are fucking retarded", "score": 2, "replies": [{"body": "you shouldn't speak the truth too loudly around these parts of reddit", "score": 2, "replies": []}, {"body": "imagine getting a 40% drop in March and wanting more", "score": 1, "replies": []}]}, {"body": "You mean May 15 SPY 180p wasn't a good idea?  But look at how smart the DD sounded!", "score": 1, "replies": []}, {"body": "Buy TLT puts, got it", "score": 1, "replies": []}, {"body": "The only way to make a 19 bagger is when there are no bidders for your puts and then we have a small drop in the market and someone starts bidding. Look at these Seaworld gains! +1900%\n\n[https://imgur.com/a/qBnezGc](https://imgur.com/a/qBnezGc)", "score": 1, "replies": [{"body": "lol and somehow u still managed to be down overall", "score": 1, "replies": [{"body": "Yeah lmao. I'm married to these options :p grabbed them on SeaWorld opening weekend and it had a retail rally. Mind you, these things are cheap as fuck. If SeaWorld drops another 1$ then I'm up overall. I'm basically betting on the park shutting down before 7/17. They got a park in SoCal and Florida. Both Hotspot.\n\nBefore yesterday there was no bid on these things so bid ask was 0 and 0.05", "score": 1, "replies": []}]}]}, {"body": "You just confirmed I need to sell all my rational positions and yolo 7/17 spy 260p", "score": 1, "replies": []}, {"body": "Facts", "score": 1, "replies": []}, {"body": "stonks go up 📈stonks go down 📉jpow with the  💥powwow 💰🖨", "score": 1, "replies": []}, {"body": "Puts on that grandma", "score": 1, "replies": []}, {"body": "Kangaroo gang wins, bulls, bear, and pigs gets slaughtered. 🦘 🦘 🦘 🦘🦘 🦘 🦘 🦘 🦘 🦘 🦘 🦘🦘 🦘 🦘 🦘", "score": 1, "replies": []}, {"body": "But i doubled my account last week with puts 😅", "score": 1, "replies": []}, {"body": "It’s always on the bulls side. Massive put selling happened months ago, and they will keep these prices up until all of those are milked", "score": 1, "replies": []}, {"body": "For investing I rather just wait. for trading i'm just going to buy calls till it doesn't work.", "score": 1, "replies": []}, {"body": "Challenge accepted!", "score": 1, "replies": []}, {"body": "I only see facts.", "score": 1, "replies": []}, {"body": "Posted 100 times already. \n\nBan.", "score": 1, "replies": []}, {"body": "The TQQQ puts gang definitely has microcephaly, but IDK man VIX calls are insane money if you time it right", "score": 1, "replies": []}, {"body": "This post is sattire coz he holds calls", "score": 1, "replies": []}, {"body": "Doesn’t mean it will retard", "score": 1, "replies": []}, {"body": "Because markets are always irrational.", "score": 1, "replies": []}, {"body": "It does look like we're going to drop to 300 and bounce off the resistance though...  So if you do buy puts, you had better sell that shit and grow some bull horns because it won't go below 300 without some really wild news.", "score": 1, "replies": []}, {"body": "The market is never irrational though...", "score": 1, "replies": []}, {"body": "Based on the fact that i got SPY put for june 26 i can agree, PUTS are never the way.   \n\"So why did you buy SPY put?\"\n\nWell cause i'm a god danm retard ♿", "score": 1, "replies": []}, {"body": "The top is in..", "score": 1, "replies": []}, {"body": "Wrong!", "score": 1, "replies": []}, {"body": "Who buys options anyway? I'm trying to make money, not give the house advantage to investment bankers.", "score": 1, "replies": []}, {"body": "Ima just inverse you", "score": 1, "replies": []}, {"body": "Jokes on them and you because we arent", "score": 1, "replies": []}, {"body": "Yeah yeah whatever. You wsb pp are just a bunch a gamblers. YOU ARE NOT CHRISTIANS! REPENT FOR GAMBLING IS SIN! SIN! SIN!", "score": 1, "replies": [{"body": "Only a sin if you win.", "score": 0, "replies": []}]}, {"body": "Quiet!! I make my money selling puts it these autists, now shut up!! 🤣", "score": 0, "replies": []}, {"body": "My drunk impulse purchase of Williams-Sonoma puts are printing. Fuck anyone that shops there. MGM puts printing too. I'm just a bear-curious bull tho", "score": 0, "replies": [{"body": "You’re betting against a company that’s just beat expected EPS by 982%?", "score": -1, "replies": [{"body": "I am, my dad is William Sonoma", "score": 2, "replies": []}]}]}, {"body": "SPY Puts. Not even once.", "score": -1, "replies": []}, {"body": "I made a couple racks on Friday w some SPY 7/22 302Ps so you can shut ur little Jew mouth", "score": -1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "hcp4k1", "created_utc": 1592670475.0, "score": 199, "upvote_ratio": 0.93, "num_comments": 187, "comments": [{"body": "TANKER GANG\n\nListen up everyone, don't forget that oil crashing will also cause tankers to plummet. And don't forget that oil rebounding will also cause tankers to plummet. Also be wary of stable oil prices. They could cause tankers to drop.", "score": 240, "replies": [{"body": "Also if COVID is suddenly cured tomorrow, tankers will probably dump as well.", "score": 51, "replies": [{"body": "There is no vaccine for covid and there wont be ever", "score": -6, "replies": [{"body": "r/woosh", "score": 9, "replies": []}, {"body": "Yeah but if my calls fail I'll get more of that sweet covid relief. I literally can't lose.", "score": 3, "replies": []}, {"body": "News of a fake vaccine pump is just as deadly", "score": 1, "replies": []}]}]}, {"body": "Don’t talk about Tankers. Doing so makes the price drop", "score": 25, "replies": []}, {"body": "Lol. I just collected my literal 40% dividend and flexed.", "score": 18, "replies": [{"body": "which tanker?", "score": 4, "replies": [{"body": "FRO got in at 7.50, sold at 8.20 + 0.70 dividend.", "score": 12, "replies": [{"body": ".7/7.5*100=40\n\nIs this some base 60 math..?", "score": 4, "replies": [{"body": "Annualized. Its 10% div rate quarterly", "score": 7, "replies": []}]}]}]}]}, {"body": "This is the life of tanker gang.  We love punishment at this point.", "score": 5, "replies": []}, {"body": "So tanker puts it is", "score": 3, "replies": []}, {"body": "Triple leveraged long long tankers etf. Got it.", "score": 3, "replies": []}, {"body": "I am now STEEL GANG. \n\nMost of the tanker companies have a market cap less than the scrap value of STEEL in their tankers.\n\nRationally the tankers cant go tits up but the market can stay irrational longer than you can stay solvent.", "score": 2, "replies": [{"body": "Is this still something people believe?", "score": 0, "replies": []}]}, {"body": "So, Tanker puts?", "score": 1, "replies": []}, {"body": "Tankers be tanking", "score": 1, "replies": []}, {"body": "I don't see how oil plummeting can cause tankers to drop? If anything, it is the opposite. \n\nIf oil plummets it would be due to LOW demand and HIGH production just like what happened when COVID-19 first hit, oil flooded the market causing oil prices to go negative because it cost lots of money to store oil in tankers. This what lead tanker at the time to moon, there was no use for all that extra oil when everyone was on a lock down.\n\nTankers play would only workout if supply drops and there isn't an excessive amount being produced. Not sure this is the case now since OPEC+ members are all on the same page and ready to take necessary actions to lower production once again.", "score": 1, "replies": [{"body": "woosh", "score": 2, "replies": []}, {"body": "There is an oversupply of crude so Saudi has stopped pumping. Crude oil tankers are going to have a bad  Q3 and Q4. However the refineries have to keep running at certain levels or shut down completely. In either case their is over supply of diesel in the US  and over supply of Gasoline in Europe. Product tankers are still needed to move the oversupply from surplus to deficit areas. STNG is a pure product tanker play. I like it better than the crude tankers. They are also the most leveraged of all the tankers and infinte QE and negative interest rates help them more than other companies. At present they have a low dividend just 40 cents a year due to it making more sense to pay off loans when cashflow is normal. However with 0 interest rates and their best quarter ever in Q2 for cashflow ,they just may do either a buyback or a bonus dividend. Buy the August calls. Sell the July calls as they report after the July monthly.\n\nYou can also hold their shares and sell covered calls to try and collect the dividend.\n\nAdded bonus the shares go down 4% in the morning and go back up in the afternoon like clockwork so you can day trade the stock while you are waiting for ex dividend date.\n\nSecond added bonus Saudi is bringing online a huge refinery in Q3 so they will be exporting more product and less crude.", "score": 1, "replies": []}]}]}, {"body": "This assumes there will be a lockdown 2.0 in southern states getting fucked by covid. And if there is a lockdown I have a feeling it will be less strict than round 1, and more along the lines of \"you must wear a mask\". Basically I don't believe demand will crater again in the same way it did in mid March. Interesting DD either way.", "score": 37, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Florida is already having ICU shortages.", "score": 29, "replies": [{"body": "Not quite, I think they still have 10%+ capacity in even orange and miami-dade county and 20% capacity statewide. Given case rises and old people I doubt it lasts, but still very few if any hospitals have zero icu beds left", "score": 2, "replies": []}, {"body": "[deleted]", "score": -9, "replies": [{"body": "“Florida ICU bed shortage at several hospitals amid coronavirus surge” \n\nYeah, I’m gunna stick with my stance there. Only 25% of ICU beds left across the state, after only 3 weeks of a rise, before these new cases start actually progressing to needing those beds is terrifying. The majority of new cases aren’t even sick enough to need those beds yet.\n\nEdit: and that’s all during the very beginning of an exponential spike", "score": 16, "replies": []}]}]}, {"body": "Dog where tf you living? Florida is fucked rn", "score": 6, "replies": []}, {"body": "Wait two weeks and then \"we are doing fine\" quickly turns into \"oh fuck oh fuck oh fuck nonono\"", "score": 3, "replies": []}]}]}, {"body": "As soon as you said Fibonacci, I knew I was sticking to spy puts", "score": 109, "replies": [{"body": "And yet crude consolidated at each of the Fib levels on the way back up. If enough algos and traders believe in it, it becomes a self-fulfilling prophecy.", "score": 18, "replies": [{"body": "No if enough algos trade on it, the patterns are eliminated before they ever develop fully as they attempt to capitalize on the pattern formation before other traders. \n\nThis is why TA is for literal morons. The existence of TA basically precludes the existence of TA.", "score": 34, "replies": [{"body": "Agree, Technical Analysis is pure BS, if it works, there’ll be lots of millionaires out there from trading, but no, they’re trying to sell $999 courses instead of actually doing it, cuz it’s pure BS", "score": 5, "replies": []}, {"body": "**PREACH!!! have an award.**", "score": 4, "replies": [{"body": "I see no award you ***SCOUNDREL***", "score": 2, "replies": []}]}, {"body": "except big boy algos can make trades at speeds that blow our retail dicks out of the water, they can totally run their trades to as close as humanly possible to fib lines without running the risk of losing out on a trade.\n\nRetail investors should be the ones who should gtfo of a position before a fib line bounce.", "score": -1, "replies": [{"body": "You’re still not getting it.", "score": 3, "replies": [{"body": "What am I missing?  The post you replied to seems to back the original TA criticism, no?", "score": 1, "replies": [{"body": "No, the last reply suggests it's algos vs retail, suggesting a better ta investor can get closer to the \"algo level\" and make $$$ beating other people.\n\nThe original argument was algos compete with each other so if they traded on ta patterns - those patterns would never develop.", "score": 3, "replies": [{"body": "Ah ok.  Thanks for clarifying!", "score": 1, "replies": []}]}]}]}]}, {"body": "Thats the point and what he just said. He's not using ta because he believes itll actually hold at a fib level hes using it cause enough people are going to trade the same idea.\n\nWhy are you talking like you're going to start a movement to get people to stop using ta?", "score": 0, "replies": []}]}, {"body": "I'm inversing the Butthole. You said oil, exactly, and fibonacci in the same sentence. You son of a bitch, I'm in.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Resistance and support are the ONLY leading indicators that exist.  Not using them cuz “TA is gay durrr” is throwing away money", "score": 1, "replies": []}]}]}, {"body": "A few more points to bolster your thesis:\n\nChina has been [buying crude like crazy](https://twitter.com/vmohith25/status/1273460545597829120), stockpiling the fuck out of cheap oil. They're boosting the price right now. Once that demand curve flattens price will follow.\n\n[Distillate and crude builds](https://www.eia.gov/petroleum/weekly/crude.php) are still climbing without an end in sight, and are nearing max capacity. (edit: 540mbs right now compared to 640mbs total storage.) Strongly doubt everyone adheres to OPEC+ cuts as nicely as they should as well.\n\nFurther, as [global cases](https://www.worldometers.info/coronavirus/) begin to spike, we shall see more shutdowns and mitigation globally. Huge emphasis on globally; the world's response to the outbreak will impact crude more than the US response (or lack of). Global oil demand will turn down real soon.\n\nTechnically, I'd also like to point out the bearish divergence on the RSI and potential confirmed crossover on MACD.\n\n&#x200B;\n\nGreat post!", "score": 40, "replies": [{"body": "Awesome feedback! Much appreciated on the technical input as well, didn't expect that in this sub ;-)", "score": 11, "replies": [{"body": "Haha my pleasure!! This is the kind of diamond in the rough I love seeing in this sub. These are the kind of conversations I wish happened more often.\n\n[SCO](https://imgur.com/a/v8ct5is) itself is starting to look tasty as well; currently falling into a \"zone\" of choppy support with the lowest RSI reading since early January on the 1D. Started a tiny bit of my entry at 18, target DCA buys are \\~14.50 and \\~12.50 if we get there. Doubt we get to 12.50, but I could see crude\\* closing that gap first before a true drop. Best of luck!\n\n&#x200B;\n\n\\*sorry had to repost, apparently even W-T-I is on the mods list now", "score": 6, "replies": [{"body": "Tell me about it, I had to repost because I originally had state acronyms, W-T-I, and a few other false positives.\n\nIt sounds like you are comfortable DCAing in instead of setting a stop loss and trying to buy in at another entry point. Is there any reason you went this route?", "score": 4, "replies": []}, {"body": "Doesn ‘t SCO only hold september to december future contracts? It doesn’t feel like it will profit from falling oil on short term?", "score": 2, "replies": []}]}]}, {"body": "Demand will fall in some spots, but I think Europe is getting unfucked as is a lot of asia now, meaning they will have more demand", "score": 4, "replies": [{"body": "Correct. Most of the world is getting back to normal and demand will increase. Only the US has reached a plateau in cases instead of a curve like Europe. Hard to tell how crude prices will react", "score": 3, "replies": [{"body": "That’s actually not correct - the USA’s cases are starting to go up again not plateau, and many other countries mostly in Latin America and other parts of Asia/Russia are going up rather quickly as opposed to a plateau or curve. The USA is the biggest refiner but I doubt refineries would ever close, though the USA is likely the biggest user.", "score": 5, "replies": []}]}]}]}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 26, "replies": []}, {"body": "Agreed that it looks like spot oil prices have peaked and will likely drop soon. Disagree on using SCO calls for this play, for a few reasons\n\n1) SCO does not actually track spot oil prices. If you look at their prospectus and holdings, they have 2/3 exposure to Sept futures and 1/3 exposure to Dec futures. While futures prices will be correlated with the current spot prices, it won't exactly track it\n\n2) Why not puts on UCO instead, since you won't need to worry about fees?", "score": 9, "replies": [{"body": "Excellent points, and exactly why I posted looking for feedback. I am not very experienced with options and generally prefer to swing or day trade 3x leveraged ETFs or high volatility equities. \n\nIs there a particular put you would suggest? Do you usually pick shallow strike prices?", "score": 3, "replies": [{"body": "3x leveraged ETFs is prob fine as long as you hold them very short term (i.e. < 2 weeks) to avoid rolling fees. If you can, the best possible play is here to short /CL futures for July or buy puts on CL since those are the most volatile. If you can't do that because you're not using a real broker then puts on UCO would probably be a slightly better play, depending on your thesis.\n\nI was planning on looking more into oil stocks ([https://www.eia.gov/petroleum/supply/weekly/wcrudeoilstorage\\_notice.php](https://www.eia.gov/petroleum/supply/weekly/wcrudeoilstorage_notice.php)) to see when we might see another storage squeeze, but if you think it'll be soon then look 1 month NTM puts probably will work - I wouldn't expect oil to go near 0 again since it looks like producers are avoiding to store any oil on Cushing last time I checked. Tanker calls might work too if you really think storage squeeze will be a thing", "score": 3, "replies": []}]}, {"body": "> 2) Why not puts on UCO instead, since you won't need to worry about fees?\n\nBecause puts on leveraged ETFs are always far more expensive than just buying calls on inverse leveraged. Yes you benefit from decay but it isn't worth it, and it's why you're paying far more. \n\nBetter off targeting minimum premium so you have less to get eaten as the underlying moves in your favor.", "score": 1, "replies": []}]}, {"body": "Interesting post but there is jack shit for OI/Volume on every call option for SCO. You will get fucked by slippage playing this", "score": 25, "replies": [{"body": "Agree there. I am going long on SCO to play it.", "score": 12, "replies": []}, {"body": "Do you think volume could increase as these contracts become more viable? Sorry if it’s a dumb question, I’m a noooooooooob", "score": 3, "replies": [{"body": "Not a dumb question at all. And indeed, if you truly believe in a play and are confident the contract will end up ITM, then volume/oi doesn't really matter. A deep ITM contract will have most of its value as intristic value, and it will sell easily enough. But if the trade doesn't go your way, it's sure gonna matter then.", "score": 2, "replies": []}]}, {"body": "Premium is fuck all and is going to get eaten anyway if it moves significantly unless you're a moron buying far OTM calls on a leveraged ETF. It's a leverage play on the underlying at the cost of the premium. \n\nNot something you're daytrading, if you're doing it you're looking for a big hit on oil amplified by 2x inverse.", "score": 1, "replies": []}]}, {"body": "Great read. Simple yet enlightening. Onto further research. Hope you post more DDs!  🐐", "score": 17, "replies": [{"body": "Newbie here: what does DD stand for?", "score": -2, "replies": [{"body": "Donkey Dicks.", "score": 11, "replies": []}, {"body": "double dick", "score": 14, "replies": []}, {"body": "big ass titties", "score": 1, "replies": []}, {"body": "Due diligence", "score": -9, "replies": []}, {"body": "Downvoted for a good cause. I don’t want this newbie becoming like any of you gay lords", "score": 0, "replies": []}, {"body": "Due diligence. Basically your research on a stock", "score": -9, "replies": []}, {"body": "Due diligence", "score": -12, "replies": []}]}]}, {"body": ">Fed is not interested in propping up the price of oil (gasp!).\n\nStop giving Jerome ideas retard!", "score": 17, "replies": [{"body": "I know, right!", "score": 6, "replies": [{"body": "In b4 J.Pow comes and say they are building massive storage facility for oil to support it's prices.", "score": 1, "replies": []}]}]}, {"body": "O&G is still not factoring in the summer driving season, EIA inventory draws, and mass bankruptcy among the smaller US shale operators. Wouldn't be short this market.", "score": 12, "replies": [{"body": "The EIA link I posted literally shows the inventory draws they are anticipating.", "score": 1, "replies": [{"body": "Yes. And I am saying the EIA is underestimating the quantum of draws.", "score": 2, "replies": [{"body": "How is that possible? Their forecast has global demand in Q3 of this year within 5% of 2019 Q3 demand (see chart I added above). That is not going to happen, even without another round of lockdowns.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "OPEC is searching for the price where they can make max$ but the shale plays can’t play - my guess is $40-45 is that number - I have UCO 28c deciding when to get out.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Then I just saw this - https://www.businessinsider.com/traffic-increased-to-pre-pandemic-levels-inrix-report-2020-6\n\nDemand might be higher than thought", "score": 3, "replies": [{"body": "This combined with the fact that governments across the world may let corona ride, instead of forcing a lockdown, is making me think short oil might be more risky than spy puts", "score": 2, "replies": []}, {"body": "Great point. For those who didn’t click, headline is:\n\n> US vehicle traffic has rebounded to about 90% of pre-coronavirus levels\n\nThis makes sense considering people don’t want to be on public transportation. Look at the huge jump in car sales in China.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "I entered the thread to say a short play was risky and closed today at a 55% loss. Pretty happy to have cut it at that considering this pretty much was worst case scenario. Obviously risky plays means small position.\n\nI read some interesting DD about oil today from an official analyst at a bank in my country that was quite convincing. Conclusion was he thinks when sideways starts we'll probably range around mid-high 40s meaning we'll see both mid 50s and low 40s. I'm certainly not doubling down or betting against oil right now and i wont a couple $ higher either.", "score": 1, "replies": []}]}]}]}]}, {"body": "WTF just happened?!?!", "score": 10, "replies": []}, {"body": "I too have been looking into shorting oil, on the announcement of a second shutdown is my condition though.", "score": 3, "replies": []}, {"body": "So thats why all the stocks on my watch list are red except USO.... lol nice post", "score": 3, "replies": []}, {"body": "Not trolling by saying this but the “cases rising” news is all priced in. We had far less virus information in late Feb/early March and back then it was thought the death rate was some outrageously high figure. The market found its bottom and it’s not going back until bubble pop once Fed intervention slows and reality sets in, which at this point is probably 2022. Go long, buy calls, be part of history friends.", "score": 9, "replies": [{"body": "> Not trolling by saying this but the “cases rising” news is all priced in.\n\nThis rally is predicated exclusively on the notion that Q3 and Q4 are back in full swing.\n\nNot looking good for that at the moment.", "score": 20, "replies": [{"body": "Yeah I can’t say I see yet that its looking like another round of shutdowns and downhill. I hear the news but what I see in the real world around me and hear from government is that we’re not re-locking down. I’m flexible though and can change on this but I don’t see it yet.", "score": 3, "replies": [{"body": "Exponential growth is a bitch. This can go from a moderate concern one week to apocalypse the next week. The fact their case counts look this shitty now, weeks after these cases started to incubate, and the fact they _still_ aren't shutting down will fuck them exponentially harder. It doesn't take a brain surgeon to see where this is headed.", "score": 11, "replies": [{"body": "> Exponential growth is a bitch.\n\nThis is what so many people don't get about pandemics. You see increasing numbers, and think \"it's not that bad yet\", and next week it's a little worse, and people say \"still not that bad so far\", and the week after it's like \"well, that's not great\", and the week after that it's \"oh god we're fucked\".", "score": 2, "replies": []}]}]}, {"body": "100% agree. The only fucking reason this is spreading like wildfire in 20 states is that they believe the virus is a hoax. These same morons think the economy is doing great and I believe make up a big portion of the retail that overbought this market. They are in the process of getting a very painful reality check. They are dumb enough for the process to take weeks. Absolute morons.", "score": 4, "replies": []}, {"body": "No lol. It's predicated on the fact that it will eventually recover.   \n\n\nThat's the issue when you guys compare this shit to the MBS crisis or the [Dot.com](https://Dot.com) bubble. Both of these had literally 0 scenario where it would become profitable to ''continue''.   \n\n\nSure we might take a sizeable hit from it ''taking longer than expected'' but it won't be near the doomsday bullshit peddled because most of these companies are viable even a rough year or 2.", "score": 1, "replies": [{"body": "Have you heard of The Everything Bubble?", "score": 5, "replies": []}, {"body": "The problem in 2010 was unemployment. That was what caused all of the loans to go bad.", "score": 1, "replies": [{"body": "Unemployment was a symptom, actually. Too many people being way over-levered in speculative housing prices was one of the problems, at least.", "score": 1, "replies": []}]}]}]}]}, {"body": "This is retarded. Nobody cares about Covid since JPow got the printers rolling. The economy no longer influences any part of the market. It's all about Daddy JPow's printing schedule. When the market drops, it's only because JPow had to stop printing to put in a fresh ink cartridge or reload the paper tray. Stonks only go up.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Until the ETF gets USO'd and you lose your options", "score": 3, "replies": []}]}, {"body": "Yeah I've been watching this for a while, even in the current environment I think oil futures are over-priced, even the further out ones that are SCO underlying.\n\nPrice movement has been ***weird*** after oilgeddon - we had an appropriate contango curve and then all of a sudden the front months shot up in price by $10-20 almost completely flattening the curve.\n\nAt the time nothing had significantly changed, which either meant that front months were overpriced (they were), or further out futures were underpriced, because there was no way that oil a month or two ago was going to have the same spot price as oil at the end of the year if the positivity that was driving front month prices up was correct - end of year would have far less glut and far more consumption.\n\nI guessed front month was just being overly exuberent and would retrace, but I was wrong - instead the far out months started gaining while front month gained less or not at all - creating contango again and correcting the curve. Only now that the curve had corrected, *wti futures across the entire spectrum* were overpriced by $10-15, not just front month.  \n\nSince then it looks like the curve has flattened again with front months rising further and everything is hovering near $40.  If we get a resurgence in glut or significant drop in consumption I'd expect Sept-Dec to drop $10-15 to more appropriate pricing, but front month is going to have to drop another $5-10 more on top of that to get a more appropriate contango curve.\n\nUnfortunately because of oilgeddon there aren't a lot of good ways to expose yourself to front month oil without directly trading futures. Most of the etfs are either holding later months, or those that do hold front month also hold an equal spread across the entire rest of the year.", "score": 2, "replies": []}, {"body": "Bruh this is tanker gang 2.0. \n\nThe very last of my dumbass tanker gang plays JUST fucking expired off my open p&l. \n\nNo fucking way I’m looking at another worthless option that god damn long.", "score": 2, "replies": [{"body": "SCO went up over 5-fold during oilgeddon. What did the tanker plays do again?", "score": 1, "replies": [{"body": "I’m just talking about from my personal experience. I’d rather have cash than be exposed to oil because it acts like a fickle bitch.", "score": 1, "replies": []}]}]}, {"body": "Excellent DD !  Hope to see more from you.", "score": 2, "replies": []}, {"body": "Lol someone please tell me something I don't understand. The market has a bull bias, its had a bull bias since indexes were invented. Past 3+ months, we've only had a few drops compared to many many many face ripping days. Why does anyone who understand basic probability still chooses to short the market? I'm not talking about swing traders or momentum traders that buy puts and hold for like a couple of days, or use them as hedges. I'm talking about the retards that kept buying puts since March, buy puts -> expires worthless -> buy more puts -> expires worthless, and yet they continue to buy more puts and hold them for like months at a time lol", "score": 2, "replies": [{"body": "If you believe the market is a random walk with a positive bias, then you would be correct. If you assume the market is primarily driven by deterministic variables with a degree of predictability than it could make sense to short if you feel a stock or the market as a whole is significantly above where you expect it to be priced both now and on the future.", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/HypnoticStrix don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Why not DRIP?", "score": 1, "replies": [{"body": "I don’t know much about it. How does the ETF work?", "score": 1, "replies": []}, {"body": "I looked it up. DRIP inverses the performance of Oil & Gas equities. This is dangerous because you will be fighting the Fed per the explanation above.", "score": 1, "replies": []}]}, {"body": "UCO puts? Youre right about feds unable to intervene in oil. Not even opec can control it.", "score": 1, "replies": []}, {"body": "Already way ahead of you buddy. Been holding SCO since April. Negative oil tank gang gang.", "score": 1, "replies": []}, {"body": "Would XOP puts work as well? What strike/expiry do you think would be best?", "score": 1, "replies": [{"body": "XOP is another ETF blend of Oil & Gas companies in exploration and production. Many of these could be influenced by the Fed so I wouldn't be as confident betting against them as I do shorting the commodity itself, as explained above. Hope this helps!", "score": 2, "replies": [{"body": "Work restricts me to either XOP or USO. Maybe USO puts then? Strike/expiry? Unfortunately, I can’t trade SCO.", "score": 1, "replies": [{"body": "***Don't fucking touch USO***, those idiots change the prospectus on their ETF so much it's basically just rolling the dice that it'll move the way you want. They've changed it like 20 times since oil imploded a couple months ago, at one point they said they may have to hold more treasuries because they were on the verge of being cut off completely by their broker.  \n\nPack of morons running an oil etf that doesn't track oil in a reliable way because they keep rebalancing the holdings.", "score": 4, "replies": []}, {"body": "Them UCO puts have like no volume", "score": 1, "replies": []}]}]}]}, {"body": "is you talking about Oil stocks or Oil as a commodity. Short Oil but not stocks.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "My post says UCO (not SCO) puts. And I’m not your buddy, pal!", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "No prob!", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I was thinking about that risk as well and will add it to the list above. My thoughts are so many of the OPEC+ countries rely on production to balance their budgets and are already upset at the current level of cuts. Also, so many of their meetings have failed to come to an agreement that simply announcing they will hold one won’t bring crude prices back immediately. Thank you for your input!", "score": 2, "replies": []}]}, {"body": "Interesting observation/analysis.\n\nI encourage to keep posting more of your ideas. keep up the good work.\n\nI think OIL can go up a bit more in the short term before what you describes in your DD catches on. I'll be watching SCO and hope to build a position with an intention to not hold more than a week or two. SCO like many other 2x or 3x leveraged instruments are not meant for long term hold so timing is very important. Calls on SCO are a no go due to liquidity.\n\n&#x200B;\n\nThanks again.", "score": 1, "replies": []}, {"body": "I'm guessing there is going to be some red out of fear for covid, but then people are going to realize we aren't locking down again and covid is over hyped and we're in for some big bullishness which is when I'm going to make my money!", "score": 1, "replies": []}, {"body": "The fed is about full on there balance sheet. Would be very foolish of them to print more. What will happen is a weakend dollar,  or a complete collapse of it. Plus you going to be look at deflation cases.", "score": 1, "replies": []}, {"body": "I don't dabble in autistic petro stocks. But I agree, if you want do bet on a downturn, do not buy SPY puts. We are over this phase. The sell off in March was indiscriminate panic selling. Now the market participants know that big tech companies i.e. the S&P 500 do not give a rats ass about Corona. Another big SPY sell off is just not going to happen. Short something else.", "score": 1, "replies": [{"body": "What if banks start failing? That's new panic.", "score": 1, "replies": []}]}, {"body": "I agree with the premise, but not the choice of oil.\n\nOil is a global commodity.  U.S. only based failure to control COVID-spread, arguably is a local issue, even if it's a big locale.\n\nI'm just saying there are more direct failures related to an outbreak of COVID.  Certain retailers  of shoes and clothing, come to mind.  They'd be devastated by a second shutdown.", "score": 1, "replies": []}, {"body": "https://www.worldometers.info/coronavirus/country/us/\n\nDeaths are absolute. Why bother looking at anything else with so much variability?\n\nTLDR: Typical wsb dd. listen to it if you hate money", "score": 1, "replies": []}, {"body": "Lost yea at macaroni sequences. \nI'll check out sco", "score": 1, "replies": []}, {"body": "Bear erotica. Cases are up, deaths are flat. There's no shutdown coming.", "score": 1, "replies": []}, {"body": "I'm buying puts but I have 3600 puts on Robinhood already so I decided to buy UCO puts too thx op", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/HypnoticStrix don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/HypnoticStrix don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/HypnoticStrix don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "LAC and ALB are the Exxon of this generation \n\nAny of you autist used this site:\n\n[finbox](https://finbox.com/?r=elfsvun). \n\nSave me a lot of headache from bad moves", "score": 1, "replies": []}, {"body": "Priced in", "score": 1, "replies": [{"body": "Agreed. I am not shorting near historic low oil prices.", "score": 3, "replies": [{"body": "Sir, this is a casino.", "score": 2, "replies": []}]}]}, {"body": "I hear anyone use Fibonacci. I block them. \n\nBut first let me offer you a great deal on these essential oils I have that will protect you from covid.", "score": 0, "replies": []}, {"body": "Cases don't mean shit\n\nCovid is like HPV everyone is going to get it. \n\nQuit with this stupid spam", "score": -16, "replies": [{"body": "Covid is the number 1 cause of death in this country, yet “cases don’t mean shit” ? \n\nThat would be like someone last year saying “the number of people getting heart disease doesn’t mean shit”.\n\n“Quit talking about heart disease people, it doesn’t really exist”.  - you last year", "score": 13, "replies": [{"body": "i'm confused, cardiovascular disease kills 600k/year in the US.  We are at 120k CVOID deaths, even if you annualize and multiply by 3, you are still around half the amount of deaths.", "score": 4, "replies": [{"body": "I think they are talking about current daily. So if heard disease is killing roughly 1400/day now, then Covid is killing more than that today. Not over the course of the pandemic though, just right now.", "score": 1, "replies": [{"body": "Even if that’s the case, right now coronavirus is killing 700 people a day (based on the 7 day moving average).  At its peak it was worse though", "score": 1, "replies": []}]}]}, {"body": "Bro people don’t care abt heart disease. Your own example proves it, no markets have moved over the millions dead from heart disease", "score": 1, "replies": [{"body": "Prolly because you can take steps to prevent heart disease, still you may get unlucky, but it's been a constant thing for thousands of years. This is a new source of death affecting literally anyone. Your argument is flawed. That being said do I think the markets are actually gonna give a fuck about the economy again? Probably. Will it be any time soon? Probably not.", "score": 4, "replies": [{"body": "“Literally anyone” lmao chicken little.  If you’re under 30 the death rate is less than 0.1% 🤡", "score": -3, "replies": [{"body": "Noone gives a fuck about the dying part. My buddy got it and was a cross country runner in high school and still ran at least 40 minutes a day. Now his lung function is two thirds worse than it was. He can no longer run anywhere near as far or long. There's more to it than just that too, people losing kidney function, liver function, scaring on the heart and more. Stop putting the blinders on and recognize this shit can and will affect people you know and love. Or just be a douche and not care about anyone else like you're gonna wind up doing anyway.", "score": 6, "replies": [{"body": "I already had covid 3 weeks ago, my whole frac crew got it. No one had any symptoms and we’re back working. This thing is a joke. Your anecdotal example just goes to show you rely on emotion more than actual stats", "score": -1, "replies": []}]}]}]}, {"body": "There’s always 1 clown who completely misses the point", "score": 2, "replies": []}, {"body": ">no markets have moved over the millions dead from heart disease\n\nMaybe because there's always been heart disease, it's priced in?\n\nIf tomorrow they said there was a cure for heart disease, I would think the market would love it. More people living for longer and healthier is a net gain for the world economy.", "score": 1, "replies": []}]}]}, {"body": "Only hospitalizations matter", "score": 3, "replies": [{"body": "Hospitalizations don't matter either\n\n Hospitals are so staving for income they're admitting anybody and keeping them for long periods of time deaths are the only thing that matter", "score": -7, "replies": [{"body": "State lockdowns coming", "score": 0, "replies": [{"body": "Yeah probably in all the pussy states\n\n\nGood  riddance \n\nRemember in 2 weeks when Florida's was going to explode!!!!! Oh wait. 2 more weeks before we have to wait 2 weeks\n\nCovid Fetishists are the dumbest of the dumb\n\n When are we going to start Banning all these Corona conspiracy theorists like they did the gay frog man?\n\n How many more times do they have to be wrong about waiting 2 weeks before we rip off their tin foil hats and ban them?", "score": -5, "replies": [{"body": "Florida is exploding retard but whatever you go ahead do you. No one cares about your bitch moves.", "score": 1, "replies": [{"body": "You're the one who thinks that positive testing somehow means things are exploding.\n\n Positive tests mean absolutely Jack shit\n\n Look in the mirror and say it again nice and slow\n\nGuess what, when you test more you get more positive tests.\n\n How about you put your money where your mouth is?\n\n I'll bet you $100 that the IFR outside of state run elder care facilities never goes higher than 0.3%\n\nI'll also bet a $100 that Floridas death rate for Corona per 100000 people never gets higher than New York New Jersey Massachusetts......\n\n We can use Nate silver's statistics to settle all bets\n\n If I'm wrong I'll also apologize for calling you  a pussy.....", "score": 1, "replies": [{"body": "Statistics are constantly being skewed its been a big criticism of this pandemic. I'll make it easier. Florida locks down and issues stay at home order by 07/31, $100 bet. What do you say? Get a mod involved to escrow or agree to perma ban if one of us doesnt pay and I'm in.", "score": 1, "replies": []}]}]}, {"body": "Imagine thinking people are actually reading ur shit. Go spew ur shit on a corner u loser fuck", "score": 1, "replies": [{"body": "People read my shit all the time because I make them money. \n\n I still get about one thank you huya message A day\n\nEveryone else but this faggot buy AGRX\n\nAlso TME is looking juicy\n\nKeep hiding in your apartment.   I love the reduced traffic", "score": -2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I already got and beat covid as well as my whole family\n\n\nThe best thing you could have done for your uncle was to also get and beat covid\n\nIf we had quarantined the old and immunocompromised in March and everyone who was young and healthy got and beat covid this thing would already be doneski.  We could have beat the whole thing in less than 6 weeks\n\nYou want to help?  Contract covid and beat it. That's the best thing you can do. \n\nThe worst thing you can do is FUDDING about it on the internet. \n\n But this was never about public health\n\nRIP GEORGE FLOYD thanks for showing us all the hypocrites", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I know of nobody who said covid doesn't exist \n\n The only thing I've been advocating is a little rationality\n\nOutside of state run elder care facilities the IFR is 0.25%\n\n People just need to look at it for what it is.\n\n For example more people died in Italy in 2017 during the peak 13 week flu season then died of covid in 2020\n\n You guys can look it up yourself but it's true. These covid doomers are insane", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Ya I’m not getting any fucking HPV", "score": 3, "replies": [{"body": "You already have it probably. \n\nEven virgins like yourself get it", "score": 3, "replies": []}]}, {"body": "Saying COVID is like HPV is spam u fucking moron", "score": 4, "replies": [{"body": "Highly contagious and to the vast majority of the population completely harmless just like HPV\n\nCritical thinking..... try it sometime\n\n All you covid pussies are really annoying\n\nThe average age of death is 82\n\n The vast majority of covid death are already statistically dead anyways because the average life expectancy in the United States is 79\n\nStay in your apartment pussy and quit spamming this shit", "score": -4, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "They are both highly contagious and most people are asymptomatic faggot.....\n\nCovid kills people on average who are already statistically dead  FAGGOT \n\naverage life expectancy 79 years average covid death 82 years\n\n  P. S. Every 82 year old who dies is good for the economy", "score": -4, "replies": [{"body": "You are a horrible person and sociopath. I can't believe your blatant disregard for life and your narcissistic, self-centered being will never find happiness. Caring and compassion are forever words lost to you. May you live to be 100, lonely, and beat in a retirement home.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "It would be nice if people applied their knowledge of probability mathematics and history to the current situation.\n\nFor one every pandemic ever in the history of man has been the beginning of a bull run.\n\n The black plague was the biggest bull run in world history with the greatest increase of the workings man's life ever.\n\n The Spanish flu was the  beginning of the greatest bull run in American history.\n\n Dead octogenarians are good for the economy.  The only people not seeing the obvious have a financial or political interest in perpetuating fud\n\n Facts and history say otherwise", "score": 1, "replies": []}, {"body": "I bet you ride around in your car with a mask on like a good little slave", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "id like to hear more about this \"we all start fuckin each other\" plan", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "It's a giant scam. \n\nYou know it,  I know it. \n\n The only people who don't know it are either in on the scam or profiting from it", "score": 1, "replies": [{"body": "What are you talking about COVID is not a scam. People are terrified of catching this disease because there is no cure or preventative measure that will help. People are not scared of HIV because they know how it is spread, COVID is an unknown variable that’s what freaks people out. The economic impact of this virus is global as well hence how it can hinder and alter the stock/trading market", "score": 2, "replies": [{"body": "The scam is the over reaction to it This comment kind of proves my point \n\nhttps://ibb.co/DRN3Z8P  This is the original suggestions to the British government for how they should react to covid\n\n If you remember originally this was supposed to be 2 to 3 weeks to flatten the curve now it's turned into one giant social engineering project that has nothing to do with public health or flattening the curve\n\n You Doomer's are a bunch of conspiracy theorists", "score": 2, "replies": [{"body": "That chart says nothing so according to what the government got there is very little or no impact to containment whether you social distance, stay in your house, etc. this is basically saying nothing to any government on how to treat the situation and like I said whoever provided this didn’t create the virus they don’t know if this will help", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Only like 40 % of the population will end up getting it before it starts buring out", "score": 0, "replies": [{"body": "It's already burning out\n\nThat's why they've lowered their standards to just reporting on positive tests\n\nPretty soon they will be reporting on dips before the inevitable rise.......\n\nAverage age of death is 82\n\nThe best thing to ever happen to the economy is covid", "score": 5, "replies": [{"body": "I guess it was good for a correction, but idk about you but few people have yet to catch it where im at but since i live in the south in Oklahoma with a bunch of obese people, not me im 6'3 and 150lbs, i bet it it will hit us hard.", "score": 2, "replies": [{"body": "Dirty little radical science secret Meth use actually helps one beat covid......\n\n Similarly to how alcohol abuse allows you to keep your hair. Notice how hirsute old whinos are.\n\n If you crank up your body's internal temperature it has an easier time beating the Corona virus.\n\n I'll bet a $100 that all things being equal meth abusers beat Corona faster", "score": 2, "replies": []}]}]}]}]}]}
{"title": "You ready for this shit? (part 2)", "selftext": "tldr- 1st test next week gonna b 3025 which also lines up right around the 200/150 MAs, break thru that & we see 2922, break thru that we get my target 2800\n\nPart 1: [https://www.reddit.com/r/wallstreetbets/comments/h7ajj5/you\\_ready\\_for\\_this\\_shit/](https://www.reddit.com/r/wallstreetbets/comments/h7ajj5/you_ready_for_this_shit/)\n\n9 days ago on that beautiful bloody red thurs i warned u retards not to buy calls when friday trading session opened up. I said we would go to 3090 b4 a violent reversal & that is what happened. also said we would kiss 3080 on monday but I'm sure many of u didnt listen & lost more $ but dont u worry cuz my retarded ass has decided to let u kno what the fuck is up again\n\nFirst and foremost. Not financial advice so if you go all in on this shit and lose your fucking money. dont blame me. we'll lose money together <3\n\nthere is 1 chart & 1 chart only u need to look at & it reveals everything- here it is zoomed out\n\n[\\/es daily](https://preview.redd.it/9qly1nj3t3651.png?width=1580&format=png&auto=webp&s=caf2ff71a8784d2874c73654078378e3870dd1a6)\n\n[zoomed in](https://preview.redd.it/3du6ux67t3651.png?width=1579&format=png&auto=webp&s=7d266f50feb7364d9ee5f419c7ad26b9d36e9e3c)\n\ndont u worry- here to explain what this shows us. if u look back, /es has respected that trendline datin back to fuckin 2017 - whether it acted as support or resistance it always is respected. so lets fuckin look at friday session - what happend?\n\nwell in my part 1 post i said look for bull trap goin into close and that is exactly wtf happend. i dont find it to b a coincidence that we got a massiv fuckin rejection at the intersection of all 3 trendlines. that was a fuckin flush afterhours, well coordinated bulltrap goin into what will b a bloody week.\n\nwhat else happened yesterday? /ES lost the 5 EMA which has acted as support last few sessions. we have masive negative divergence buildin in rsi, slo stoch curling, all settin up for a bloody week.\n\nso in my 1st post called 4 target of 2800-2850 in next few weeks, knew last week would b borin as fuck but was great opportunity to load up with vix crush so im well positioned for a flush this week.\n\ni think we kiss 2800 this week then as i stated b4, market gonna make a decision and many of u are gonna b on the wrong side and get absolutely fucked.\n\n[GEX again massive plummet](https://preview.redd.it/pr6oqkahr3651.png?width=1914&format=png&auto=webp&s=86f6538f02310e391ae831744fa996c07ad10578)\n\nDIX is high as fuck while GEX plummet lower fri - what does this tell us? same fuckin thing as last week so im literally gonna copy pasta what i wrote last post re: GEX/DIX -\n\n*GEX and DIX is far above most of you retards to understand so i'll say this - Remember GEX is hedging OBLIGATIONS and acts as a brake on the DIX price. Why would MM’s have drastically lower hedging obligations while DIX is still high?* ***Because the only volume left on the Dark Pools is retail by proxy of Market makers. Don't buy fucking calls***\n\n[spx daily](https://preview.redd.it/oe2wxq0xs3651.png?width=1584&format=png&auto=webp&s=d656b379fdd335160d1556ad6896f89cef6315e5)\n\n1st test next week gonna b 3025 which also lines up right around the 200/150 MAs, break thru that & we see 2922, break thru that we get my target 2800 - then market gonna pick do we drop down to 2600ish or see big reversal back above 3000? i think it would set up reversal play higher (yea im not a fuckin permabear believe it or not, i do go long u fucks) but that remains 2 b seen\n\npositions since u retards gonna spam it in the comments -\n\njuly monthly exp - SPX 2800/2850 puts, vix 50/55/60/80 calls, xlf puts (banks r fuked)\n\naug monthly exp - vix 50/80/100 calls\n\n&#x200B;\n\n**Monday - 1:33est**Out of my /ES longs from last night, hit 3100 target, loaded up short here. leaving a little room on this one, stop set at 3115\n\n**9:25pm est**\n\noh fake fukin trade deal is no longer happening, would u imagine that. we'll see where we end up in the am but i wouldnt b shocked if the pj traders just buy the fukin dip lmao. Mayb though this was the long awaited catalyst we bears needed :-D\n\n**Wednesday**\n\nFlood gates look like they are close to opening.... a little upside if bulls reclaim 3070 but that isn't lookin good for them..... imo we break 3025 ish and we will hit my target 2800-2850 very very very soon. tomorrow and friday could get ugly with quarter end rebalancing and massive selling.\n\n**Thursday - 12:29am est - yes a late night update**\n\nSo today was interesting - we got to our level 3025 in RTH and it bounced heavy.. it actually broke this pre market but ECB pumped and our plan was halted at the hand of the fed. Then  they saved it and pumped stimulus and then pumped bank stress test which turned out to be not so great (buy rumor sell news) - so here's a detailed update from what im seein on my end cuz yea today's tape fuckin sucked to be real with you. all this is referencing /ES chart as info:\n\n1. I am still very bearish on this market. This seemed like a fake pump that really didnt even break any key levels that i had, the biggest bein 3077 ish level.\n2. this was a fed induced pump today make no mistake of that. when bank stress test was released, it revealed that we are fucked if second wave comes (which we are seeing) and the bank losses could be 08 level or worse. Hence, bank stonks tanked after close. Pump the pigs up all day on rumors then sell the news, classsssssic. Banking index showing a MASSIVE head and shoulders pattern so not very bullish there\n3. This fake BS rally didnt take out any levels that bulls need to reclaim. 3077 is massive 1st level bulls need to take out to make this rally convincing. OK lets say they take this out in futures tonite which looks like it could be plausible, bulls have to break a few levels to make this convincing 4 me. 5EMA is sittin at 3084, 8MA sittin at 3100, 20MA sittin at 3108. Bulls have defended the 200 MA HARD. You can see it bounced off of the 200 MA this morning and even re-tested it which led to the bounce and fed induced pump. So for me, I remain bearish, I remain short until these levels are broken.\n\n[\\/es daily](https://preview.redd.it/2tqoayey97751.png?width=1584&format=png&auto=webp&s=8447005e147e7bf93175111c4516df5273f44986)\n\nAs u can see - this shit is gettin tight. Tomorrow and next week will reveal a lot.... I wouldn't b surprised if tomorrow is flat and next week we flush to hit my target to set up a long opp. MACD still bearish, we still have a huge negative divergence.\n\n[QQQ daily](https://preview.redd.it/1py7dlnu97751.png?width=1585&format=png&auto=webp&s=b03934a24fed8ad7dba98a1edcbd6330b77854e7)\n\nHere's a look at Nasdaq. Why would u ever go long here? These trendlines date back 10+ years. u can see we get a nice rejection off the trendline and guess what.... for the most part, this has always touched the trendline or got close.. this time will be no different - RISK down to $180 on QQQ, with this fed induced market, maybe down to $200 ish on the drop before a bounce but make no mistake, tech is long due for correction.\n\n[spx daily](https://preview.redd.it/rsgi1nkn97751.png?width=1585&format=png&auto=webp&s=1b0c80ef83eab96e270955c44bd9bddb42fb00c8)\n\nbounce right off my levels for now.....\n\nSo I guess in summary, remain bearish until we hit those key levels i listed above, everything in my soul screams today was yet another fake fed induced rally and until we break all those key levels, i remain bearish.", "id": "hcqnvr", "created_utc": 1592675816.0, "score": 115, "upvote_ratio": 0.86, "num_comments": 147, "comments": [{"body": "pretty sure you just wanted to type dicks over and over and wound up with dix", "score": 104, "replies": [{"body": "I luv dix", "score": 36, "replies": [{"body": "Wait...doesn’t everyone on WSB?", "score": 16, "replies": []}]}]}, {"body": "You did all that DD only to reveal you’re a volatility slut who sucks dick for VXX call money huh? Nice \n\nEither way I hope you’re right", "score": 67, "replies": [{"body": "I’m a big vol slut 👌🏼😳😜", "score": 34, "replies": [{"body": "So real talk how much did those VXX calls run you? I had some $45 which expired 6/19 - want to pickup more Monday", "score": 7, "replies": [{"body": "I’ve been in em for awhile and picked up the 50’s-60’s all between .50-.70 a piece.. the 80’s and 100’s all under .30 😏", "score": 6, "replies": [{"body": "So you expect Apple, Amazon, Google, Microsoft, facebook to all sell off 10%+? Or for the other 495 to lose even more in the next month?", "score": 1, "replies": [{"body": "I expect a tech crash yea", "score": 6, "replies": [{"body": "Then why don't you just buy $QQQ puts instead of $SPY?", "score": 5, "replies": [{"body": "cause I trade SPX lol. Using Apple as my tech play.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Well OP is projecting a 10% crash in SPX and that would indicate either the most weighted industries (tech) would lose at least that much, OR the less weighted industries would lose more, or a combination of that. When he asked OP to clarify if he was anticipating tech companies specifically to crash he said that he did. He was asking OP his reasoning on buying SPY puts versus QQQ (tech industry) puts.", "score": 2, "replies": []}]}]}, {"body": "Why?  Tech seems the most poised for this.  ETFs which haven’t recovered as much tend to dip more on bad news- like IWM.  Look at % down for QQQ IWM SPY for 6/11.", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Interesting, thanks for the first hand intel!\nAny tech stock in particular you have your eye on?", "score": 1, "replies": []}]}]}]}, {"body": "Check out the Nasdaq daily chart. A ten percent drop looks completely reasonable", "score": 2, "replies": []}]}]}]}]}, {"body": "“Money me.  Me a needing money now.”", "score": 5, "replies": [{"body": "So do.", "score": 2, "replies": []}]}]}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 28, "replies": []}, {"body": "Maybe you’re right, but then again maybe you aren’t", "score": 23, "replies": [{"body": "Flip a coin or join the kang gang", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "$12K", "score": 1, "replies": []}]}]}]}, {"body": "Meh, we didn't come anywhere close to last Friday's sell off. I think we found a new bottom at the 3000 level. Jpow wants to watch your puts burn. I have 294puts dated July, and I think they gonna expire worthless.", "score": 38, "replies": [{"body": "They are. Pretty formulaic at this point. 300 test... JPow pump... rinse and repeat.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Insurance for my calls incase op is right", "score": 8, "replies": []}]}, {"body": "those wont expire worthless. you will be bathing in sweet sweet tendies with me as long as u still have them", "score": 1, "replies": []}, {"body": "The top is... as they say... in.", "score": -1, "replies": []}]}, {"body": "Any risk of positive news? This was the case back in May when we were poised to see a drop... the JPow reassured the market it had its back, half ass progress on vaccines and reopenings negated that. We dont know what Donny Pump or the fed are going to say or do, I want you to be right but the uncertainty factor is in this climate really high.", "score": 24, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "I think thats the biggest issue with all this, no matter how right this post could be this administration is willing to do anything and everything to prevent it. We havent heard much about a vaccine/treatment in a while and I guarantee if we see a sharp downturn next week, which I think is likely, all of a sudden there will be a rush of good news and  hopium will prop the numbers back up. Realistically the only thing that will tank the market again will be some catastrophic event or covid deaths running away so much that even Republican governors start agreeing to shut down.", "score": 8, "replies": [{"body": "I tend to think like this too. Although it'll be interesting to see what Nike posts for earnings come Thursday while their near ATH.", "score": 3, "replies": []}, {"body": "Which is not unlikely to happen at this point. Cases keep climbing in Texas, Florida, Arizona, Georgia... won’t be long until we’ll see the death toll and hospital load increase as well", "score": 0, "replies": []}]}]}, {"body": "Exactly. How many times do we need to see the same bear DD over and over again? Don’t fight JPOW the god", "score": 3, "replies": []}, {"body": "selling my puts Monday morning may will rebuy after the market gains price back.", "score": 1, "replies": []}]}, {"body": "Man anyone can draw a broomstick on a chart", "score": 9, "replies": [{"body": "🧹🧙‍♀️🧙‍♀️🧙‍♀️🧙‍♀️🧹", "score": 3, "replies": []}]}, {"body": "I make money because I know that every Thursday is red, so I just buy puts every Wednesday. It’s insane how flawless my strategy is.", "score": 13, "replies": [{"body": "Did you really take your username from a Jaden Smith song?", "score": 5, "replies": [{"body": "Yeah I like that song. What’s wrong with it?", "score": 6, "replies": [{"body": "True autist located", "score": 1, "replies": []}]}]}, {"body": "How long has this been working?", "score": 3, "replies": [{"body": "It’s been working for a couple weeks.", "score": 1, "replies": [{"body": "but not today amirite", "score": 1, "replies": [{"body": "I mean sure, minimal Green Day, puts still could’ve worked @ open for SPY though. \n\nI didn’t trade this week aside from Gold calls so that’s probably why it didn’t work ;)", "score": 1, "replies": [{"body": "today was good day to play down to 3025 at open and set up bounce long. I played them at open but did not time exit as well as could have, was really hopin 3025 would break but its strong for now :-D it will crack soon. bulls are weak. today showed weakness for bulls. Gold / SLV are long plays right now. Cheers :-)", "score": 2, "replies": [{"body": "so whats your take for next week then?", "score": 1, "replies": [{"body": "We’re going down this week.", "score": 1, "replies": [{"body": "to your target right away? or it will take a few chops to get there?", "score": 1, "replies": [{"body": "I think we get there pretty quick- lot of selling/end of quarter rebalancing this week.", "score": 1, "replies": [{"body": "may I ask for your long term and short term play?", "score": 1, "replies": [{"body": "My plays above haven’t changed. Puts on SPX, AAPL, long VIX.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Now we just need another retard to write 10 paragraphs about why buying the dip is a good idea and stonks will keep going up and they will cancel each other out. JPOW won't let this market drop - Monday will be a great opportunity to buy calls and make tendies. All the bear autists are running around with their pin dix out after a 1% drop lol...", "score": 6, "replies": [{"body": "bruh you think someone can out-retard me?! im triggered", "score": 1, "replies": []}]}, {"body": "Variation separate, is that you?", "score": 10, "replies": [{"body": "Talks exactly like dlkdev too", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "hey thanks man. i will keep analyzing these stooooopid charts until daddy jpow fucks every level i have mapped out <3", "score": 1, "replies": []}]}, {"body": "I'll give it 50/50", "score": 5, "replies": [{"body": "illll take it", "score": 1, "replies": []}]}, {"body": "Conveniently leaves out the fact that last time DIX made ATH, we had a face ripping rally lol", "score": 11, "replies": [{"body": "bruh the DIX cant be trusted rite now. dont pay too much attn to it. DIX dropped today and idgaf. \n\ndix aint what it seems right now, its bein heavily influenced by retail", "score": 1, "replies": []}]}, {"body": "Same here bro, looking for a first test to 2950 next week and if bulls can't hold that level then 2800 ( If bull still can't hold this level, god knows where SPY will be in a month).\n\nMy Position:\n\nTVIX Shares\n\nVXX 50 July Calls\n\nSPY 290/300 Puts\n\nGood luck&godspeed.", "score": 3, "replies": []}, {"body": "Damn if only i could read", "score": 3, "replies": []}, {"body": "This guy fucks", "score": 6, "replies": [{"body": "bro u fuck.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Nah I said with 2 weeks on og post which would put it to this week 🤞🏼👌🏼🤛🏼", "score": 1, "replies": []}]}, {"body": "Graphs: exist\n\nMe: Uh fuck math get tendies stonks only go up, calls for days", "score": 3, "replies": []}, {"body": "Sing that sweet fucking sound you songbird.", "score": 3, "replies": []}, {"body": "GEX also signifies a trend acceleration- what concerns me about your thesis is how high DIX is.  That’s a bullish indicator.  \nMonday and Tuesday also get fed injections- Tuesday getting two.  \nCould the future path be the upper line and not the downward one?\n(I’m a ❤️🐻, that DIX though...)", "score": 3, "replies": []}, {"body": "Reclaimed 307, looks like your theses is gonna be put on hold for another week or two as we retrace back to 313 and banks ‘pass’ their stress test tmrw.", "score": 3, "replies": [{"body": "yea today was rough. this morning was looking v good but fed intervention always spoils the plan.... still confident in my thesis, may just get pushed out a week. today did reveal to me that when we do hit my target 2850ish, load up long. short below that is out of the question for me.", "score": 2, "replies": []}, {"body": "just posted a nice long update of what im seein above.", "score": 1, "replies": []}]}, {"body": "I bet against banks. The fed slapped me for it", "score": 2, "replies": [{"body": "hopefully u still bettin against them. 2nd wave = 08 level bank losses according to stress test", "score": 1, "replies": []}]}, {"body": "I am almost certain that someone on this sub could draw random lines on a price chart, claim it was showed something about the market, and no one would have any clue it was totally made up.", "score": 2, "replies": [{"body": "You think a sub with at least a core base of stock trading hobbyists, not a single one would understand a chart? Line funny brain hurt ow!", "score": 1, "replies": []}, {"body": "bro ill draw random lines on ur moms tits and i wouldnt have any clue i made them up but id still snort that shit rite off ur moms tottys", "score": 1, "replies": []}]}, {"body": "What is the point of these DDs? Every single one I’ve read in the past few weeks have been wrong", "score": 2, "replies": [{"body": "Shut up losaaaaa", "score": 1, "replies": []}]}, {"body": "when u said your stop set at 3115 does that mean u closed all your short positions because u feel we are going back to 3,200’s?", "score": 2, "replies": [{"body": "I believe he meant that he set his stop at 3115 as an upper ceiling for his short position. Which it certainly hit. Bears will be bears.", "score": 1, "replies": [{"body": "correct. when u trade futures, u have to set stops or u will get obliterated if ur wrong.", "score": 1, "replies": [{"body": "Yup", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "Yeaaaaa we lookin good rite now - needs to break below 200 MA", "score": 3, "replies": []}]}, {"body": "Oh wow another fucking tool with a grand total of 3 comments before last week. Fitting username; I bet you’ll only keep posting on this account if your shitty tea leaves astrology predictions turn out to be right.\n\nWhat were your old accounts and what awful predictions did you post before you used this one?\n\nVariation separate 2.0, another bear who thinks he is smarter than the market despite underperforming it.", "score": 6, "replies": [{"body": "lollllll im not a bear you cunt. i'm short term bearish til my target of 2850 then that sets up long play. ill post on my acc wrong or right. charts dont lie ya waste of sperm. dont compare me to that piece of shit Variation", "score": 1, "replies": [{"body": "At least variation got one right at the beginning; you couldn’t even manage that\n\nThat’s okay tho, just make new accounts til you do, you worthless disgusting piece of garbage; next time spam elsewhere you fucking asshole", "score": 1, "replies": []}]}]}, {"body": "Great stuff brother, Make WSB great again!", "score": 5, "replies": []}, {"body": "from your lips to gods ears", "score": 3, "replies": []}, {"body": "I’m not taking advice from someone that doesn’t put in the effort to write “you” or “be”. It feels like I’m being given investing  tips from a 13 year old.", "score": 4, "replies": [{"body": "are u for real?", "score": 4, "replies": [{"body": "R U 4 RLZ?\n\nFixed it for you.", "score": 8, "replies": [{"body": "nah too excessive", "score": 2, "replies": []}]}]}, {"body": "if u don't want advice from children, u may be in the wrong sub....", "score": 2, "replies": []}, {"body": "cuz u r", "score": 1, "replies": []}]}, {"body": "Im buying calls, this is gonna age like fucking milk, no matter how many fucking mental gymnastics u tards do to post ur homo thesis it will never happen", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/GoingToDisappear don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Why not august spy puts? Also what's your xlf strikes?", "score": 1, "replies": []}, {"body": "i wouldnt be surprised if we open higher monday and tuesday and close lower for the week on friday. \n\nYour hunch is as good as mine but I dont think we a true leg down until mid July", "score": 1, "replies": []}, {"body": "\"Because the only volume left on the Dark Pools is retail by proxy of Market makers. Don't buy fucking calls\" This is wrong. Retail doesn't have the money to be influencing DIX: https://twitter.com/SqueezeMetrics/status/1273098510188138505", "score": 1, "replies": [{"body": "it was always my understanding that as of late, DIX was being moved based on robinhood activity (ie citadel/hf order routing of market orders)", "score": 1, "replies": [{"body": "Retail order flow is a small fraction within the dark pools' overall order flow", "score": 1, "replies": []}, {"body": "futures move like a baby, I think we'll have another flat week", "score": 1, "replies": [{"body": "i played the dip at open https://imgur.com/a/m2N8z47", "score": 1, "replies": [{"body": "vix is fading hard tho", "score": 1, "replies": []}, {"body": "when do you expect to close these", "score": 1, "replies": [{"body": "moved stop up to 3055 but I think they can get up to around 3100, if so I’m hammering it short", "score": 1, "replies": [{"body": "So if it goes up to 3100 ur doubling down?", "score": 1, "replies": [{"body": "just talkin tonight’s futures session, I’ll close out my long ES and go short. Already in my options plays for cash session", "score": 1, "replies": [{"body": "you think it will reverse after touching 310 on the same day?", "score": 1, "replies": [{"body": "I got out of my longs and loaded up short here again.", "score": 1, "replies": [{"body": "how much conviction do you have on this trade? vix is getting slaughtered", "score": 1, "replies": [{"body": "feeling pretty good right now ;)", "score": 1, "replies": [{"body": "you gonna close by open or it could drop more?", "score": 1, "replies": [{"body": "i'll have to see what we open at tomorrow but probably not selling - hopin this was the catalyst needed to get sizeable reversal to hit my targets", "score": 1, "replies": [{"body": "that dip didnt last so well, futures is too crazy", "score": 1, "replies": []}, {"body": "Too good to be true, Trump tweeted out the trade deal is still on 😒", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "whats your thoughts on puts on SPY versus QQQ? i think tech has much further to fall to hit certain moving averages. but in order for spy to fall significantly, then qqq would also need to fall. sort of debatable which would be more profitable of a trade?\n\ni just dont see qqq falling to its moving averages, as that would be insane, but also probably destroy spy beyond repair. but i do see qqq falling a good amount, just not to the levels of retracement from the crash as spy is at now.", "score": 1, "replies": [{"body": "tech should crash but not gettin my hopes up - seems to be a \"safe haven\" right now for investors - i think it'll have a correction, just don't know how deep it goes b4 people btfd. \n\ni feel safer playing SPX / have a better grip on the charts for it. I'm short apple as of fri mornin so i guess that's my tech play - charts screamed sell on friday so we'll see", "score": 1, "replies": [{"body": "I think qqq should eventually crack and when it does,  should provide better gains than most other indicies. Potentially at least. It has to drop for spy to fall. But spy is made of other sectors already quite beaten down still. Not really confident we see tech do a decent sell of until Sept through Nov possibly.", "score": 1, "replies": []}]}]}, {"body": "M-shaped recovery", "score": 1, "replies": []}, {"body": "Sep ❤️", "score": 1, "replies": []}, {"body": "If you are so good at predicting the market, can we see some of your sick gains?", "score": 1, "replies": []}, {"body": "Dang you bear love to lose money. Stop fighting Jpow", "score": 1, "replies": [{"body": "No I love makin $ fightin him", "score": 2, "replies": []}]}, {"body": "These lines gave me seizures", "score": 1, "replies": []}, {"body": "Is anyone else finding it tough to take this guy seriously considering the way he types?", "score": 1, "replies": []}, {"body": "Sooo dump all my stonks Monday at open? Watch the red pour over the bodies of bulls and buy back mid week?  Or in a few years?", "score": 1, "replies": []}, {"body": "Excuse me Gex is a gecko", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/GoingToDisappear don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Either way I see the dollar gaining value, we could see a drop in equities or see both gain in value as foreign investors demand US equities and Dollars. I want to open a long position on UUP this week, maybe November 27$ calls", "score": 1, "replies": [{"body": "How the fuck is the dollar gaining value when the printers are redlining 24/7?", "score": 3, "replies": [{"body": "There’s a lot of demand for the dollar. A lot of debt is in it. A lot", "score": 4, "replies": [{"body": "A lot of supply too (like practically infinite). Macro Econ 101.", "score": 1, "replies": [{"body": "Velocity of the dollar is a lot lower than you would think. The US would definitely like you to believe that we are currently looking at a bad inflationary state of the economy but they are really trying to combat deflation. \n\nI don’t want to act like I know everything tho. Shits not good all around. Potential stagflation later on down the road", "score": 2, "replies": []}]}]}]}]}, {"body": "I am ritard\n\npls gib ticker, price and xact date on RH\n\nCnt fnd SPX and VIX on RH", "score": 1, "replies": [{"body": "omg", "score": 4, "replies": [{"body": "This guy is peak retard", "score": 3, "replies": []}]}, {"body": "Get an iphone with autocorrect poor", "score": 2, "replies": [{"body": "2 dum, cnt\n\ntrn 2 gt tendis 2 gt ifon 4 otocrect", "score": 1, "replies": []}]}]}, {"body": "I will sell credit call spreads this week on SPY and /ES so let's see If your boring bear guess is correct.\n\nI'll start selling the $325 calls for 7 day expiration and see if I can keep the algos rushing up /ES to try to take my money in 7 days or less.\n\nThen we will see about your 292 or 285 SPY idea crap..\n\n\nI'll just sell more credit call spreads of we have any more down.\n\nTheta gang always wins.\n\nAnd p.s. - I'll be selling calls tomorrow Sunday at 6pm because futures open sunday!", "score": 1, "replies": [{"body": "Schevy theta gang fucks like you keep me up at night", "score": 3, "replies": []}, {"body": "Asking for a friend, I’m theta gang all the way, but have you tried financing buying puts with your credit plays. Sell the 325 and buy 292 for credit", "score": 1, "replies": []}, {"body": "Congrats should net about 8$", "score": 1, "replies": [{"body": "Wrong, look at what the 325 calls are going for 7 days from now..", "score": 2, "replies": []}]}]}]}
