{"title": "New to AI stocks? Need some advice…", "selftext": "Just bought my first 20 shares of NVDA today. I plan on buying more every week or so, but what other AI companies should I look at besides AMD, Meta, Google, etc, or should I be buying those too?…thank you for any advice🙏🏻", "id": "1dlk3ll", "created_utc": 1719019526.0, "score": 17, "upvote_ratio": 0.88, "num_comments": 30, "comments": [{"body": "avgo", "score": 19, "replies": []}, {"body": "Nothing, just yolo NVDA", "score": 14, "replies": [{"body": "This is the way. /s", "score": 4, "replies": []}]}, {"body": "Maybe TSM, VRT? MSFT has to be part of it too.", "score": 8, "replies": []}, {"body": "Msft vrt dell amzn", "score": 7, "replies": []}, {"body": "Look at the SOXX ETF. It has all the players and performs well.", "score": 6, "replies": [{"body": "XLK especially with the rebalance.", "score": 5, "replies": []}]}, {"body": "You brought,  it's gonna dump", "score": 5, "replies": [{"body": "Happens every time lol.", "score": 1, "replies": []}]}, {"body": "Some AI stocks on my \"watchlist\": PANW, TSM, AVGO, PLTR, AMAT, and SMH.", "score": 3, "replies": []}, {"body": "MSFT", "score": 3, "replies": []}, {"body": "Amazon", "score": 3, "replies": []}, {"body": "QQQT", "score": 3, "replies": []}, {"body": "NVDA ofc, Micron, TSM, Qualcomm, Microsoft, AVGO, AMAT, ADI, SK Hynix (South Korean market, not available in US) and long long on ASML are ideas to look into.", "score": 2, "replies": []}, {"body": "DELL, HPE, MU", "score": 2, "replies": []}, {"body": "Soundhound", "score": 3, "replies": []}, {"body": "Don't invest in just one sector, especially when sentiment appears to be cooling somewhat. I'd buy an S&P 500 tracker fund, or perhaps something like Vanguard VHVG ETF, so you have exposure to global markets as opposed to being too concentrated in one sector, which likely won't end well long term. 85% of my portfolio is VHVG. Low fee of 0.14% and covers a lot of ground.", "score": 3, "replies": []}, {"body": "AMD is shit", "score": 2, "replies": [{"body": "It’s just that they’re spending time and resources on the B2C too much to flourish in B2B", "score": 1, "replies": []}]}, {"body": "My largest position currently is in NVDA. I also have some TSMC, NVDU and SOXL. I’m heavy in semiconductors right now. I know you shouldn’t have all your eggs in one basket but I think this sector will outperform for lot longer. \n\nI’ve had SMH on my watchlist for a while as well.\n\nYou can go with SOXX if the leveraged SOXL isn’t in your risk profile. Don’t get into LETFs if you don’t understand them and aren’t ready to add on down days to DCA.", "score": 1, "replies": []}, {"body": "Ai is just a small part of the economy. Don’t all in a sector for the hype.", "score": 1, "replies": []}, {"body": "Uh oh \"New to AI stocks.\" I'm hoping this isn't FOMO.", "score": 1, "replies": []}]}
{"title": "Only half of tesla's training hardware to be Nvidia?", "selftext": "", "id": "1dll97e", "created_utc": 1719023229.0, "score": 9, "upvote_ratio": 0.75, "num_comments": 24, "comments": [{"body": "He’s cooking up some new AI chips on his latest Ketamine bender. I’m thinking 90% Jensen, 10% ketamine lol", "score": 21, "replies": [{"body": "And 0% willing to fight Zuck “anytime, anywhere”", "score": 5, "replies": [{"body": "Zuck will probably have a chip out before Elons Dojo chip comes out ", "score": 2, "replies": [{"body": "Dojo chip lol", "score": 0, "replies": []}]}]}, {"body": "That's about right.   Anything else sucks hind tit at training.", "score": 1, "replies": []}]}, {"body": "Don’t believe everything the pathological  liar tells you.  I’m still waiting to see the roadster 2. ", "score": 11, "replies": [{"body": "And the hyperloop, and self driving Teslas, and HLS Starship, and cargo in starship and dear moon Starship mission that… ***OH WAIT, THAT’S been canned.***\n\nYeah, I believe Musk as much as I believe that eventually Musk will use rockets as regular transport around the globe.", "score": 7, "replies": [{"body": "Took a self-driving Tesla drive from the Texas factory to my hotel without any issues. I think you might need to do a bit more research instead of repeating the bs of haters.", "score": 5, "replies": []}, {"body": "You guys do realize the hyperloop is worse than you think, it was all lies and he even admitted it was a lie on Xitter. He wanted to stop California from building proper railway transportation system so he bullshitted a car train system which would never work as good as a train.", "score": 2, "replies": [{"body": "Of course I know that. That was the first time I thought: ***HUH… maybe Elon ain’t that hyped up.***", "score": -1, "replies": []}]}, {"body": "Musk says shit so he can raise money or pump a stock price. If I got paid my year's salary up front based on shit I promised rather than performance, I wouldn't be very motivated to follow through either.", "score": 2, "replies": []}, {"body": "its funny how you only list things that are still far out in the future,m, but ignore the things that he has achieved, which people said were impossible 5-10 years ago...\n\nself landing rockets, starship, tesla most valuable automaker, starlink etc...", "score": 0, "replies": [{"body": "Starship is not getting us to the moon buddy.\n\n#End of story\n\nHasn’t even delivered a payload to orbit ***let alone people or cargo.***", "score": 0, "replies": [{"body": "uhm thats like saying that apple hasnt even shipped iphone 19. \nLike what the f do you expect? They still iterating on starship. Landed the booster in the ocean. Its not like they are stuck for 3+ years. \nYou were probably one of the guys that said that starship wont even fly and will be in 10years that starship has only been on the moon and mars but its useless.", "score": -1, "replies": [{"body": "Have they demonstrated refueling on Orbit, have they demonstrated how they’ll restart the engines, how they’ll fucking ***catch*** the booster and relaunch it in less than a day, **the list goes on and on!!!**\n\nThey don’t even have a payload amount; but I sure as ***FUCK*** guarantee you it’s gonna be less than the Saturn V. \n\n[Just gonna leave this video here on Artemis.](https://youtu.be/nxG0WAwwrGk?si=EqiXGoDvUhgD-klJ) \n\n[Oh and this one as well.](https://youtu.be/m23tGqmmiA8?si=BFbkihejRFNsiTb0)\n\nThese guys pretty much nail why Musk’s BFR/Starship is idiotic and also… **Elon probably on par with Enron**", "score": -1, "replies": [{"body": "the thing is you just hate and dont care about any achievements, once they do for example catch the booster, you still will scream hey buddy no refueling in orbit, scam artist, enron", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Who knows what \"Tesla AI hardware\" is?  Perhaps it is CPU's and data center equipment.  Maybe Musk plans on making his own chips in the future.  From Situational Awareness, 53% of AI data center are NVDA.  So this tracks regardless.", "score": 1, "replies": [{"body": "Here's an article about tesla's training hardware\n\nhttps://www.tomshardware.com/tech-industry/teslas-dojo-system-on-wafer-is-in-production-a-serious-processor-for-serious-ai-workloads", "score": 3, "replies": [{"body": "18K amps in and generates 15KW heat.I wonder how that stacks up against B200s.\n\n  \nEdit:  Meant to say 18K amps in instead of 18KW", "score": 1, "replies": [{"body": "Holy shit there must be a black hole inside or something if there's a 3kW difference between the electricity on and the heat out ", "score": 2, "replies": [{"body": "I had a typo in my comment.  I corrected it.  That's still a lot of heat coming off that thing.  Cooling that thing is going to be expensive!  Can you say TCO?", "score": 1, "replies": []}]}]}, {"body": "Regurgitated Tesla BS.  Translation:  We're still a playa too!  \nNot one word on software.", "score": 1, "replies": []}]}, {"body": "It’s inference hardware. The chip they use in the car. Tesla design those chips. It’s probably used to test the models and do calibration.", "score": 1, "replies": []}]}, {"body": "The rest of the training hardware is in his pants.", "score": 1, "replies": []}]}
{"title": "Nvidia predictions 2030.", "selftext": "These are predictions only. Based off Nvida after her share split and using previous history. I'd be happy even if it hits $1000 by 2030. Everything else is gravy. Buy the dips and stop stressing. Little story. I bought in at $600 a share. I had 36 shares before the split. I stressed after buying because it went down for 2 weeks... If you're new to the market just buy when you can and stop looking every hour. Once your stocks starts making money your stress will disappear. Only way to lose money on Nvidia atm is to buy high and sell low. Buy and hold. I started investing in February and have almost doubled my original investment. AI is the future of tech and Nvida is the foundation that it is built on. ", "id": "1dlobs3", "created_utc": 1719033889.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 35, "comments": [{"body": "I too hope that the market cap reaches $100tn, and becomes 33 times the other largest public companies in the world by 2030, but I classify this as wishful thinking.", "score": 41, "replies": [{"body": "At $6tn what are your thoughts on what the price will hit?", "score": 1, "replies": []}]}, {"body": "I mean sure.... fuck it, why not?  your allowed to dream.", "score": 15, "replies": []}, {"body": "These type of auto generated price prediction sites are completely useless and pointless. Clickbait for advertising.", "score": 13, "replies": []}, {"body": "This is like Cathie Wood predicting Tesla to $5,000", "score": 10, "replies": [{"body": "No this is way worse, like 100x times worse, this is like saying tesla is going to 500k a share 😂", "score": 2, "replies": []}]}, {"body": "Lmaoo this is definitely wishful thinking. I do see it getting to $3-$400 by 2027 though", "score": 10, "replies": [{"body": "End of 2026.", "score": 5, "replies": []}]}, {"body": "When Intel stock price hit 72$ on 25 august 2000, investors were thinking same. it is unbeatable as everybody on planet needs a computer and only Intel makes best CPUs. After 24 years, Intel made so much more revenues yet never saw 72$ per stock still trading less than half. Upcoming years all major chips companies will hit market with new GPUs. While one company sells extremely expensive GPU with astronomical profit margin others will not sit and watch.", "score": 4, "replies": [{"body": "This is the right answer. NVDA is safe for a few years and still looks to be gaining on the sliver of market share they don't already have. But someone will eventually rise to legit competition. I'd hold NVDA for another few years maybe, then switch to a fund that spreads more evenly across all semiconductors. Semiconductors in general are the way to go for the next few decades, IMO, but yes NVDA will not be able to sustain their current growth and market share forever.", "score": 2, "replies": []}]}, {"body": "Any data scientists here that could come up with some accurate numbers?", "score": 4, "replies": []}, {"body": "Question is how many times would it split by 2030 based on these returns.  At least three?", "score": 3, "replies": []}, {"body": "Lol", "score": 3, "replies": []}, {"body": "Stop posting crypto and gme hype in here. That’s how I know the top is in", "score": 4, "replies": []}, {"body": "Soon you be first millionaire in my family.", "score": 2, "replies": []}, {"body": "Damn, is it too late to join the party. It was 140 on Wednesday. Purchased some shares. Probably should’ve waited for a drop.", "score": 2, "replies": []}, {"body": "Jesus NVDA has turned into the regard train.", "score": 2, "replies": []}, {"body": "This changes every minute as the stock price is changing lol", "score": 1, "replies": []}, {"body": "I'm optimistic too but this kind of prediction is like people who's in HOLO", "score": 1, "replies": []}, {"body": "미친놈은 어딜가나 있구나.", "score": 1, "replies": []}, {"body": "The moon is going to land on earth!", "score": 1, "replies": []}]}
{"title": "Put 4K into nvda like a little less than a year ago and made it to 11k, and after stock split I got 62 ish shares, should I just keep them for the long run, and will i ultimately profit ? ", "selftext": "", "id": "1dllehl", "created_utc": 1719023704.0, "score": 33, "upvote_ratio": 0.86, "num_comments": 34, "comments": [{"body": "Answer is entirely dependent on your needs. Will it grow? Everyone here and history says yes\n\nBut money and profits are just tools to help you secure and enjoy your life. So if you want/need something now and you are fine walking away from future profits then there is no shame in taking your profits.\n\nThere is also the issue that I have been struggling with lately- diversification. I want to diversify away from but that's to am early bet on NVDA, everywhere else I try put my money can never cath up. Using your profits to diversify might not be a bad idea either", "score": 19, "replies": [{"body": "Great answer", "score": 2, "replies": []}, {"body": "Thanks!", "score": 1, "replies": []}, {"body": "History does not strictly agree. See Cisco", "score": 1, "replies": []}]}, {"body": "usually, when i am not sure, i say half. Pull half, you'll be half right or half wrong.", "score": 13, "replies": []}, {"body": "I’d sell some, half, or all your Nvidia and buy index funds. $11k is an excellent starting position in index funds. \n\nCould Nvidia stock go higher? Yes. Could it go significantly lower? Also yes. Ask yourself if you’re comfortable losing 1/3-1/2 of that $11k.\n\nAny investment, besides a guaranteed return like high yield savings/bonds/treasuries, has inherent risk. Buying into the market as a whole is a safer strategy than picking individual company winners and losers. \n\nGood luck 👍🏻", "score": 5, "replies": []}, {"body": "Youre already up 11k but also will you profit??", "score": 5, "replies": []}, {"body": "You could just pull the original $4k, then it’s just profits in and you’re solid.", "score": 4, "replies": [{"body": "This is the way. Sell $4k worth of stock and diversify your portfolio.", "score": 4, "replies": []}]}, {"body": "I’m in the same boat, but will continue holding and buying. If you don’t need the money, then let it ride, or you can also take out your initial investment, and play with house money.", "score": 3, "replies": [{"body": "Exactly this, I have it in a mutual fund rn and I’m planning on making it a long term putting money in every month as a second savings account type deal", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "First investments were like a year ago almost", "score": 1, "replies": []}]}, {"body": "Sell them before the crash. Buy back when it’s under 90 per share.", "score": 3, "replies": []}, {"body": "Long play and keep investing! Congrats!!", "score": 5, "replies": [{"body": "Agree. Long.", "score": 5, "replies": []}]}, {"body": "Depends on if you need it or if it is a significant part of your portfilio. When in doubt wait for a year for capital gains taxes and diversify into etfs or mutual funds (swppx, voo, schg, schx, vt etc.)", "score": 2, "replies": []}, {"body": "Yes and yes. Next question please", "score": 2, "replies": []}, {"body": "Pull your original investment out. Reinvest that safely. Play NVDA with the rest.", "score": 2, "replies": []}, {"body": "Does a bear shit in the woods? Of course!", "score": 2, "replies": []}, {"body": "Buy 7 more shares and close the app.", "score": 2, "replies": []}, {"body": "You could give a share to each of your friends to get them started on investing", "score": 1, "replies": []}, {"body": "Buy more get to 100 shares. Then run the wheel strategy for an extra 1200 a month.", "score": 1, "replies": [{"body": "Is it easy to get a 10% monthly return on running the wheel strategy on NVDA? Your thoughts?", "score": 1, "replies": []}]}, {"body": "You do you", "score": 1, "replies": []}, {"body": "No one has ever gone broke taking profits", "score": 1, "replies": []}, {"body": "If you need the money sell it. If not, hold it. This is a buy and hold stock and will most likely moon again in a few years (unless there’s a war lol). If you want to diversify, I would add VOO and QQQM while holding Nvidia.", "score": 1, "replies": []}, {"body": "Put half in voo or if you want bigger gains soxq", "score": 1, "replies": []}, {"body": "You could take out your original $4k investment, or more, to buy your next idea and play with the house money. \n\nNo one ever went broke taking profits.", "score": 1, "replies": []}, {"body": "Take your original investment if $4k out and buy ARM. DCA into ARM and NVDA. Your going to thank me in 5 years! Cheers!", "score": 1, "replies": []}, {"body": "I did this with canopy and aurora stocks. Once they legalized in Canada and I noticed they started going down, I took out my intial investment, let the houses money ride.  This was done probably 1 week after legalization.  \n\nAfter another month I noticed they were just tumbling down, I pulled out\n\nTesla was a different story tho, I had a strong feeling, like I do with nvidia now that they would skyrocket.   I kept buying the dips, not much but adding to the position. \n\nBoth have worked wonders for me\n\nI tried the same with ark funds, fucking Cathie woods. Hahaha", "score": 1, "replies": []}, {"body": "Same with me sillyboy642.  I’m riding it out.  There is nothing I need at this moment in time to sell.  I’ve known about NVIDIA for because of gaming and then crypto, but I never bought in like I am now.  NVIDIA has been a winner for years - why shouldn’t it be now and into the future.", "score": 1, "replies": []}, {"body": "If you played the lottery and won would you reinvest all your winnings to buy more lottery tickets or would you thank your lucky stars and walk away?", "score": 0, "replies": [{"body": "The stock market is not a lottery. It is a marketplace where anyone can share in the prosperity of real companies delivering real value to the economy. The current price of any given stock is driven by real investors predicting continued prosperity of that particular company. Publicly traded companies have to report their earnings on a regular basis so investors can review and adjust their predictions accordingly. If you consider the stock market a lottery you’re going to have a bad time.", "score": 2, "replies": []}]}, {"body": "This entire post reeks of a lack of understanding about the split.", "score": 0, "replies": []}]}
{"title": "NVDA June 28 $125 call chart", "selftext": "Is NVDA headed up again? Wonder where these options are headed.", "id": "1dluyb6", "created_utc": 1719060602.0, "score": 22, "upvote_ratio": 0.88, "num_comments": 38, "comments": [{"body": "I have the same call. 😡 Where do you look at these call charts?", "score": 5, "replies": [{"body": "I believe this is Morgan Stanley E*Trade", "score": 2, "replies": [{"body": "Thank you. I actually found it on thinkorswim which I need to use more often.", "score": 2, "replies": [{"body": "Wait there is call charts on ToS? Where? on mobile?", "score": 2, "replies": [{"body": "If you have an active option click on it and at the bottom click on show details. Chart comes up.", "score": 5, "replies": []}]}]}]}, {"body": "There are many sites that offer charts on options, with or without an active position. Tastytrade has a good one too. \n\nHow many of these contracts do you own? They move fast as evidenced on the chart. Hope to buy more come Monday morning", "score": 2, "replies": [{"body": "Got it thank you. I figured there were many places. I was trying to find a chart on a call that closed already. Is there somewhere good to find historical charts on closed options?", "score": 2, "replies": [{"body": "Sorry no. I only have been able to find historical charts on active options but not on closed/expired ones. If I run into one I’ll hit you back", "score": 1, "replies": []}]}]}]}, {"body": "Looks suspiciously like my portfolio pattern this week", "score": 3, "replies": [{"body": "Yikes. Is there hope for a rebound?", "score": 1, "replies": [{"body": "Weeklys got crushed after jensen sold was a cascade effect and then\nBehold the buyers step in\nIs it a critical support level?\nIs it the shareholder meeting this week?\nIs this just normal nothing burgers!?!?", "score": 3, "replies": []}]}]}, {"body": "Can you explain a bit? or do you know a place I can educate myself about calls? I am just starting to look at this and I am a little too uneducated to understand. \n\nI mean, is there a calls for dummies book/website?\n\nThanks", "score": 2, "replies": [{"body": "There are a lot of resources out there for you to learn the basics of options trading and strategy. From video tutorials to books and internet reference sites", "score": 1, "replies": [{"body": "any one you would recommend? I have seen a few but some are kind of wacky sounding.", "score": 2, "replies": [{"body": "Try www.investopedia.com as a reference to look up terms which u may not understand", "score": 1, "replies": []}, {"body": "Adam Khoo on Youtube", "score": 1, "replies": [{"body": "TY!", "score": 2, "replies": []}]}]}, {"body": "How to understand the graph? I can see a spike but what it signifies? Can you also tell the X and Y axis of the chart?", "score": 2, "replies": [{"body": "Date vs price of these specific options", "score": 2, "replies": [{"body": "It shows mainly three things IMO: the Volatility, how fast they move in a short time span and huge profit/loss Potential", "score": 1, "replies": []}]}]}]}, {"body": "Options for Dummies is pretty good", "score": 0, "replies": []}]}, {"body": "Which app is this?", "score": 2, "replies": [{"body": "Morgan Stanley E*Trade", "score": 1, "replies": [{"body": "Thx!", "score": 2, "replies": [{"body": "Imagine selling a covered call at $15 one day to cover at less than $5 the next. Or buying an option at $4 and selling $10-15 dollars \n\nBut the inverse can happen also…", "score": 1, "replies": []}]}]}]}, {"body": "I don’t trade options, what are we looking at here? What’s the projected price target of these calls - $125? Or do they costs $125?", "score": 2, "replies": [{"body": "This the five day price chart for June 28th expiration $125 strike price call options on NVDA", "score": 1, "replies": []}]}, {"body": "Wouldn’t count on it. \nShort volume increased 10% today.", "score": 1, "replies": [{"body": "Using that specific metric and your logic, Isn’t that just more reason to buy or average down your cost basis? 🤔buy low, sell high & try to stay ahead of the crowd/herd? You put more capital at risk but wouldn’t a profitable exit strategy be easier with a way Lower or closer goalpost ? 🏈being a bit contrarian here but trying to grasp what people are thinking and doing about the more frequent changes in direction and increased …", "score": 1, "replies": [{"body": "No, not if short volume is increasing on a stock that is in an uptrend. If it was decreasing then yes", "score": 1, "replies": [{"body": "But then what happens during a short squeeze?", "score": 1, "replies": [{"body": "You have to have a high short interest to have a short squeeze. Not just an increase in interest.", "score": 1, "replies": [{"body": "Not necessarily all the time", "score": 1, "replies": [{"body": "What I am saying is that the short interest in NVDA is not squeeze levels. \nThink of the pain trade.. who stands to lose the most…", "score": 1, "replies": [{"body": "I agree 😊though I also believe a sustained rally would cause most shorts to cover or add to their positions.", "score": 1, "replies": [{"body": "Well we have seen the peak in this stock for a while my friend", "score": 1, "replies": [{"body": "Peaks and dips will continue, whether this is the penultimate top idk. You may be right for the near term though. Long term?  we shall see. Have a wonderful weekend my friend", "score": 1, "replies": []}]}]}]}]}, {"body": "Too many factors IMO", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "What should i do ?", "selftext": "context is i'm 19 turning 20 in november and live with my girlfriends parents, i've been trading for a year now and i had 12 shares of nvidia pre split. During the dip i purchased around 27 more shares and just want some advice on what i should do, I do not need this money anytime soon and am willing to play the long game with nvidia, is that the best thing? or should i secure some profits OR purchase more shares while we are still close to the post split price ", "id": "1dm7tx9", "created_utc": 1719096750.0, "score": 19, "upvote_ratio": 0.88, "num_comments": 28, "comments": [{"body": "IMO you are ahead of the game. I wouldn’t consider selling any of those positions, especially if you don’t need the money. Continue to add when you can. Your future self will thank you.", "score": 20, "replies": [{"body": "Dude if you sell you are making a major mistaake", "score": 10, "replies": []}]}, {"body": "Hold and laugh about it on the beach somewhere in 10 years.", "score": 19, "replies": [{"body": "Not really sure how much laughing he could be doing when Nvidia has already increased in value so rapidly that it briefly became the most valuable stock in the world. At the absolute most it could double in value in 10 years. But that’s hardly a gain.", "score": 1, "replies": []}]}, {"body": "Really comes down to your comfort level. I will say this, my portfolio is very similar to yours and I’m holding 100%. My top 2 holdings are NVDA and AMZN and my other 2 are NEE and VOO. I will add more NVDA shares if it continues to dip as well. I live at home, don’t need the money and I believe in what NVDA is doing so I am staying put! You don’t have to listen to me, just sharing my view as someone who is in a similar position it seems like.", "score": 5, "replies": [{"body": "You had me at voo", "score": 2, "replies": []}, {"body": "Good for you believing in VOO", "score": 1, "replies": []}]}, {"body": "Nvidia's AI accelerators have between 70% and 95% of the market share for artificial intelligence chips.", "score": 3, "replies": []}, {"body": "Hold and collect that sweet sweet nvda divi", "score": 2, "replies": []}, {"body": "Hold tight.", "score": 1, "replies": []}, {"body": "Do what u want buddy", "score": 1, "replies": []}, {"body": "Forget about them!!! Keep working learn electrical, plumbing or something else where you can work for yourself and make your own schedule. Those shares will be your buying a house cash money.", "score": 1, "replies": []}, {"body": "Sell some and get your money back, then play with the profit 😆😆... I see it dipping down to 108..!", "score": 1, "replies": [{"body": "Haha mate keep dreaming 💭", "score": 1, "replies": [{"body": "I take that back $100 a share...!!!!", "score": 1, "replies": []}]}]}, {"body": "I got a $30 average haven’t even thought of selling just averaging up", "score": 1, "replies": []}, {"body": "Hold it and sell weekly OTM covered calls", "score": 1, "replies": []}, {"body": "Sell", "score": 1, "replies": []}, {"body": "In it to win it", "score": 1, "replies": []}, {"body": "Sell covered calls and collect premium. Go for a low delta so you shares are less likely to get called away. If they do no problem you make money. But back only 53 shares to get you to a hundred so you can still do cc’s then diversify yourself a bit and by maybe an etf or something.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Well done. I only just discovered cc’s and wheel strategy this year, I sold off a bunch of stocks where I only held 20 or 20 shares to consolidate some holdings where I could get to a\n100 shares and write cc’s. I do it now for AAPL GOOG MU AMZN TSLA and now post split can do NVDA. It really is free money, you just have to be comfortable with the idea that the shares get called away. Don’t get married to your cost basis. If they get called, it’s all profit, sell a put and start over. It’s the best money hack I’ve learned.", "score": 2, "replies": []}]}]}, {"body": "Sell covered calls", "score": 0, "replies": [{"body": "Stupid question here. Am new to investing also. What are covered calls?", "score": 3, "replies": [{"body": "No stupid questions! Its an agreement to sell your 100 shares at X Date for X Price! If you sell calls the person buying pays you a premium. For example If you think the stock wont go above $140 in three weeks you sell a $140 strike 7/12 and make $220 if that option expires worthless.", "score": 3, "replies": [{"body": "Can’t be that easy", "score": 0, "replies": [{"body": "Its pretty easy but you cap your gains if the stock flies past it", "score": 1, "replies": []}]}]}]}]}, {"body": "Sell and then short it.", "score": 0, "replies": []}]}
{"title": "To all that made bank off NVDA poots🍻", "selftext": "", "id": "1dlkr00", "created_utc": 1719021635.0, "score": 51, "upvote_ratio": 0.8, "num_comments": 30, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 36 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "What do you call that again?", "score": 6, "replies": [{"body": "A bingo card.", "score": 14, "replies": []}, {"body": "Heat map.", "score": 9, "replies": []}]}, {"body": "I shortes Nvidia last Friday...was -40% on Wednesday>\n. Now I am +50%. Will probably sell late Monday. and buy calls.", "score": 5, "replies": [{"body": "Good plan. This seems like a quick pitstop before it makes another bull run", "score": 2, "replies": []}, {"body": "Is now a good time to buy into NVDA? I'm new to investing, but wanting to learn. Have a few thousand I'd like to put into something", "score": 1, "replies": [{"body": "I will buy Nvidia calls if the stock hits 120. I have a friend who became multimilionaire this year, 300k->4M, and he said he'll wait until 110.\n\nIf I were, you, I would buy the stock itself, no calls, no outs. They are very risky. Stay away from them. Imo you should buy the stock in the next max 5 weeks, when you feel it has dropped enough. In August 22th ish there will be earninggs and the stock will go up, then will go down for 1 month or so (but still above end of august) and then at the end of november again eith the last earnings this year it will go up.\n\nI expect 200 by the end of the year. Next year I won't buy nvidia calls anymore.", "score": 2, "replies": [{"body": "Spoken truly like someone whose friend got rich off this and is always late to the party. Imagine being the expert and not the multimillionaire.", "score": 1, "replies": [{"body": "which part of my post stops me being a millionaire? (btw my friend also bought calls on the way down at 118 and I bought at 116). We are both in the green as of right now.\n\nPS: My NW is ~500k EUR.", "score": 1, "replies": []}]}]}]}]}, {"body": "Imagine all those put profits not closed our getting fucked premarket on Monday morning!", "score": 4, "replies": []}, {"body": "What is a resonable market cap for NVDA?", "score": 2, "replies": [{"body": "69420 Quadrillion", "score": 7, "replies": []}, {"body": "∞", "score": 2, "replies": []}]}, {"body": "So the rest of the big tech companies are winning the nvidia losses? Market value doesnt die it goes to other companies", "score": 1, "replies": [{"body": "Except when you sell too many subpar mortgages", "score": 6, "replies": [{"body": "nice input - thx 👍", "score": -3, "replies": []}]}]}, {"body": "avgo last hour of day....", "score": 1, "replies": []}, {"body": "From which platform this image is taken", "score": 1, "replies": [{"body": "Finviz", "score": 0, "replies": []}]}, {"body": "im the worst investor in the world - i remember three decisions ive made that prove it 1) not believing Facebook could make it on the mobile platform, 2) thinking that very first round of Netflix price increases would destroy them, and 3) concluding the NVDA CEO was a complete liar when he first asserted their revenue and margins would grow in a huge way.\n\nim the prototype regard.", "score": 1, "replies": [{"body": "This just sounds like you don’t understand the sector. Do you have a deep understanding of tech/business?\n\nRealized I’m asking this on WSB but already typed it so w/e.", "score": 1, "replies": [{"body": "guess not.  had i just made these moves my solid 8 digit long portfolio would have been 9 digits by now.", "score": 1, "replies": []}]}]}, {"body": "Im not saying we’re getting scraped or conspiracy but uhh. Noticing all red is everything posted here kinda weird.", "score": 1, "replies": []}, {"body": "Been shorting NVDA and got the timing right.", "score": 1, "replies": []}]}
{"title": "VIX based FXAIX investment strategy, what am I doing wrong?", "selftext": "So I just excel'd a very basic hypothetical investment strategy based on these rules:\n\n- VIX < 20 : buy ~~FXAIX~~ VOO\n- 20 < VIX < 30 : sell ~~FXAIX~~ VOO\n- 30 < VIX < 50 : buy ~~FXAIX~~ VOO and ride it whatever direction until VIX < 20\n- 50 < VIX : sell ~~FXAIX~~ VOO and wait until VIX < 50, then buy and ride down until VIX < 20\n\nIf these rules were followed since November 1, 2019 the performance would look like this: https://imgur.com/5XXjJie\n\nIt doesnt avoid every downturn but it avoids enough to vastly outperform the market.\n\nI'm obviously an idiot and there are no free money glitches. What did I do wrong?\n\n---\n\nI had to wait til my wife woke up since she's better at excel than me.\n\nWe ran the calculations all the way back to 2004 (largest dataset I could download easily) changed the VIX thresholds from 20,30,50 to 20,30,46. These new thresholds seem to create the best results after toying with the numbers up and down. I even added \"action\" to the graph in green to show where the strategy makes it's best gains over SPY. Lemme know your thoughts. \n\nI can't figure out how to upload the sheet but here is another screencap: https://imgur.com/f5Anrls\n\n---\n\nEdit 2: 1993-2024: https://imgur.com/dQclBJ7\n\nExpanding to 1993-2024 the optimal thresholds change to 20,33,46. These thresholds are definitely worse if used for 2004-2024. No loss just not as much gain.\n\nIt seems different eras have slightly different optimal numbers. I wonder if a set of thresholds could be generated for every year to see trends.", "id": "1dlpnsx", "created_utc": 1719039178.0, "score": 28, "upvote_ratio": 0.89, "num_comments": 31, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 weeks ago\n**Total Comments** | 8 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "The first thing you are doing wrong is posting this here.  This is more like the place you would want if you are trying to figure out how to maximize your income from giving blow jobs behind the Wendys dumpster.\n\nThe second thing you are doing wrong is only using 5 years of data.  The third thing you are doing wrong is testing only the returns from starting at a single entry point.  You want to figure out specifically where your divergence is coming from.  You are also doing a bunch more things wrong that I don't know about, because like I said before, sir, this is a Wendys.", "score": 8, "replies": [{"body": "I had to wait til my wife woke up since she's better at excel than me.\n\nWe ran the calculations all the way back to 2004 (largest dataset I could download easily) changed the VIX thresholds from 20,30,50 to 20,30,46. These new thresholds seem to create the best results after toying with the numbers up and down. I even added \"action\" to the graph in green to show where the strategy makes it's best gains over SPY. Lemme know your thoughts. \n\nI can't figure out how to upload the sheet but here is another screencap: https://imgur.com/f5Anrls", "score": 2, "replies": [{"body": "This looks interesting.  One thing you will need to account for is that these trades in and out are taxable.  So you should adjust for that vs a buy and hold strategy (also note short term vs long term gins).  Another thing to do is to run this same strategy on the data but for a start date of each year from 2004 to today.  That will let you know if you are taking any Ls in there.  It's hard to see where the actual divergences are happening with this chart.  Also when you say \"sell VOO\" do you mean take a short position, or just unload what you have and go to cash?", "score": 4, "replies": [{"body": "Yeah I was only thinking of doing this in an IRA to avoid the taxes.\n\nBy sell VOO I mean unload to cash. I'm not familiar with shorting yet\n\nI will try to see if there are any off years with this strat. Thanks for that recommendation.", "score": 1, "replies": [{"body": "Also, are you using daily closing prices only?  Because if you are this analysis may have problems.  e.g. if the vix spikes past 20 and you are going to sell the next day, you need to make sure to use the opening price the next day and not just the closing price the day the vix hit 20.  This is especially problematic because when VIX is high is when you tend to get large gaps up or down overnight.", "score": 1, "replies": [{"body": "This sheet uses VIX closing price from previous day and SPY open price next day.  Basically the practical way of applying this strat is to check what VIX closed at daily and put a buy/sell order in for the morning's open.", "score": 1, "replies": []}, {"body": "1993-2024: https://imgur.com/dQclBJ7\n\nExpanding to 1993-2024 the optimal thresholds change to 20,33,46. These thresholds are definitely worse if used for 2004-2024. No loss just not as much gain.\n\nIt seems different eras have slightly different optimal numbers. I wonder if a set of thresholds could be generated for every year to see trends.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Why do you buy when VIX is low (< 20) and then higher (30 < VIX < 50)? Low VIX means going (mostly) up; shouldn't you wait for higher VIX to get a discount?\n\nAnd why sell when VIX > 50 — doesn't it mean high volatility, so likely something unpredictable happened (like a war), so SP500 is falling? Shouldn't you buy at the bottom instead of selling at it?\n\nBtw. VIX has hit 50 only two times in the last 20 years: in 2008 and 2020 (so during crashes). I wouldn't sell at those points. And the 50 seems like an arbitrary threshold (unless it was supposed to be some kind of black swan protection, but then why sell at it?); it's hard enough to get it to 30 without some major macro event happening.\n\nDidn't you mistake SVIX for VIX?", "score": 3, "replies": [{"body": "The 20, 30, 50 thresholds are pretty arbitrary based on eyeballing a graph of VIX vs SPY. They can probably be optimized with some basic calculus tho. \n\nBut yeah you pretty much understand what I'm going for. Avoid choppy waters but try to take advantage of moderate discounts. Not getting too greedy. I initially did it without the black swan protection and the strategy performs only slightly worse.\n\nEdit: now that I think of it some more it might actually make more sense to base the purchase and sale on the slope of the VIX curve rather than just the closing value from the day before.", "score": 2, "replies": [{"body": "What if you include like last 50 years instead of just the 5? It could be that the particular period you chose isn't statistically relevant and future results will differ\n\nBtw. did you somehow automatically get the VIX/VOO values into the spreadsheet or did you have to type them all individually by hand?\n\nAnd can you answer why do you sell when VIX is so high (meaning: possibly low SP500 and going lower)? I'd think you should hold then, and buy more when VIX is going lower (meaning: an SP500 bottom may be forming)\n\nIt would be nice if you also shared the spreadsheet (especially the formula you use to plot the graph)", "score": 2, "replies": [{"body": "I downloaded the data off Yahoo but did the math manually. 2am excel lol.\n\nLike you said I sell when the VIX is super high as black swan event protection. At least for COVID it works at somewhat timing the bottom. Maybe a slope calculation is better at truly timing the bottom but like you said this doesn't happen often enough to be reliable. I'd have to try it for 2008 and see if it works the same. \n\nOnce I figure out how to properly script this I'll make sure to share it.\n\nEdit: it seems to work even better for 2008!", "score": 3, "replies": [{"body": "It seems like the general divergence stems from the big drop at the beginning (COVID in 2020).\n\nApart from the drops both charts seem to be more or less the same (just offset by a factor)\n\nWhat would be your position sizes (i.e. going all in all the time, or buying/selling just a percentage of your total balance — maybe again depending on the value of VIX?)?\n\nI think figuring out your position size could make your strategy's return chart diverge even more (assuming you'd find the correct values for position size; otherwise it could converge, so the returns would be worse), and it wouldn't resemble the original chart (SPY/VOO etc.) as much anymore\n\nYour strategy seems to be very good at timing the bottom (which is very important). Due to the fact that the charts are so similar (offset by a factor if you look at certain parts; especially between drops), returns from your chart seem to be very similar to buying at the bottom and selling at the top (which you could also more or less do, since you can time the bottom pretty well), but again it depends on the size or your positions.\n\nIn conclusion — it seems to be pretty much the original chart *if it wasn't for bigger drops/crashes* (in that case you could buy at the bottom and sell at the top). So it appears to have very similar returns if you can time the bottom during a crash; without a crash, the charts seem to almost coincide (or maybe it's not the case? We'd need to see a straight bull run chart as well to verify that)\n\nBut you may be on to something, so definitely work on it. I'd be interested in seeing your results and the spreadsheet", "score": 1, "replies": [{"body": "COVID was a nice bump but I actually think this strat makes most of its gains during the interest rate hike of 2021-2022 (especially October 2021, April 2022, September 2022). There was a lot of volatility that seemed like unnecessary fear at that time.\n\nPosition size would be like 20k in a Roth. This strat would triple my money vs just double it leaving it in the index all the time. \n\nI'll dial it in and send it to you once I figure it out.", "score": 1, "replies": []}, {"body": "I had to wait til my wife woke up since she's better at excel than me.\n\nWe ran the calculations all the way back to 2004 (largest dataset I could download easily) changed the VIX thresholds from 20,30,50 to 20,30,46. These new thresholds seem to create the best results after toying with the numbers up and down. I even added \"action\" to the graph in green to show where the strategy makes it's best gains over SPY. Lemme know your thoughts. \n\nI can't figure out how to upload the sheet but here is another screencap: https://imgur.com/f5Anrls", "score": 1, "replies": [{"body": "It looks good. You should definitely try to backtest it. I tried to do it using TradingVjew's pine editor (it's free and advanced yet relatively simple to use) but the ChatGPT generated script appears to be totally wrong (i.e. it can be run — so the syntax is correct — but the results are incorrect)\n\nAs for uploading the spreadsheet you could upload it to e.g. Dropbox or Google drive first and the send the link.\n\nI'll DM you the pine script. Maybe you'll fix it somehow\n\nEdit: can't DM you, maybe you block messaging", "score": 1, "replies": [{"body": "1993-2024: https://imgur.com/dQclBJ7\n\nExpanding to 1993-2024 the optimal thresholds change to 20,33,46. These thresholds are definitely worse if used for 2004-2024. No loss just not as much gain.\n\nIt seems different eras have slightly different optimal numbers. I wonder if a set of thresholds could be generated for every year to see trends.", "score": 2, "replies": []}, {"body": "I just enabled messaging", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Go long on VIX", "score": 2, "replies": []}, {"body": "Gone well for me so far. Used this strategy to time the dip and avoid most of the losses.", "score": 2, "replies": [{"body": "I missed the window by a little but got myself a nice little $8ish discount per share in all my positions", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Reddit (the company, not r/WallStreetBets, the subreddit) has banned Seeking Alpha articles everywhere on Reddit.\n\nTo get around this, please repost your comment/thread with the link removed, and the relevant parts of the article copy and pasted. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "It may look good at backtesting with static data, but it is not the same for dynamic data as current data has moving targets.", "score": 1, "replies": [{"body": "I don't understand. I get that nothing is guaranteed but say this works for a 30 year period (not sure yet)... what's different about today's market?", "score": 1, "replies": [{"body": "The above logic you gave, it is easy to work with few thousands, but think if you have a Million, whether such formula work out and will we be able to see the fluctuations? \n\nVIX is mainly on hedging and volatility, we can not differentiate easily what is causing the VIX spike.\n\nWhen VIX is below  16, holding or DCAing VOO is fine, beyond which there is no guarantee.\n\nAbove all back testing dealing with static data (price won't change), but daily market data is dynamic and VIX itself volatile.", "score": 2, "replies": [{"body": "Yeah so the above graph is just tracking one share in VOO. Whether you have ten or a thousand the performance is the same; triple your money rather than doubling it just leaving it in there. \n\nWhat this math says to me is that VIX between 20-30 means SPY is probably correcting. Above 30 means the bottom is probably in already. Just look at how it handles October 2021, April 2022, and September 2022. \n\nPractically this strat would just be an overnight decision; what was ~~VOO~~ VIX at close? Ok put in a trade to buy all in or sell all out at open tomorrow. No intra day trading. \n\nI'm going to try to make a script that runs this since 1995 and see if it still works.", "score": 3, "replies": []}, {"body": ">with few thousands, but think if you have a Million, whether such formula work out and will we be able to see the fluctuations? \n\nWhy wouldn't it scale? \n\n>VIX is mainly on hedging and volatility, we can not differentiate easily what is causing the VIX spike.\n\n>When VIX is below 16, holding or DCAing VOO is fine, beyond which there is no guarantee.\n\nWhat do these opinions have to do with OPs statistical backtest? \n\n>Above all back testing dealing with static data (price won't change), but daily market data is dynamic and VIX itself volatile.\n\nNo idea what this means. The backtest is not based on rules that would give look-ahead bias if that's what you mean. What do you mean by static data? Ofc the price changes in backtests", "score": 2, "replies": []}, {"body": "I had to wait til my wife woke up since she's better at excel than me.\n\nWe ran the calculations all the way back to 2004 (largest dataset I could download easily) changed the VIX thresholds from 20,30,50 to 20,30,46. These new thresholds seem to create the best results after toying with the numbers up and down. I even added \"action\" to the graph in green to show where the strategy makes it's best gains over SPY. Lemme know your thoughts. You too u/GPTRex I'd appreciate your input.\n\nI can't figure out how to upload the sheet but here is another screencap: https://imgur.com/f5Anrls\n\n---\n\nEdit: 1993-2024: https://imgur.com/dQclBJ7\n\nExpanding to 1993-2024 the optimal thresholds change to 20,33,46. These thresholds are definitely worse if used for 2004-2024. No loss just not as much gain.\n\nIt seems different eras have slightly different optimal numbers. I wonder if a set of thresholds could be generated for every year to see trends.", "score": 1, "replies": []}]}]}]}]}
{"title": "Apple has a bite taken out of it", "selftext": "[removed]", "id": "1dlvzhp", "created_utc": 1719063808.0, "score": 0, "upvote_ratio": 0.34, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 13 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "It means quad witching + ETF rebalancing. Trying to draw long (or even short!) term conclusions about an isolated 10 minutes market move is next level regarded. \n\nNothing happened end of Friday. The company story is the same with or without those 10 minutes.", "score": 14, "replies": [{"body": "What happened is my $210C that I sold didn’t get assigned![img](emote|t5_2th52|4271)", "score": 5, "replies": []}, {"body": "And that’s true, I wouldn’t make a decision off a 10 minute move. I had put positions throughout the week because of how the bigger picture looked as the week went on. What’s significant about this trend is that it’s now edging towards a support around $206 - if rebalancing and AI delay can have a negative impact it would happen next week. If not then maybe retrace back up for the week.\n\nJust to add I’m not bullish or bearish at this point.", "score": -1, "replies": [{"body": "Technical anal y sis doesn't work. If it does, coincidence. If it doesn't, some sort of \"fake out\" that can't be explained.", "score": 1, "replies": []}]}, {"body": "Even if it’s due to rebalancing, can’t it be worrisome that the AI news came out hours before it?", "score": -1, "replies": []}]}, {"body": "Fund rebalancing.. and SPX roll week. \nNothing wrong. \n\nhttps://trendspider.com/blog/the-xlk-rebalance-what-it-means-for-apple-and-nvidia/", "score": 15, "replies": []}, {"body": "Do you know why it was heavily traded on Friday?  240 million shares traded > 68 million shares average volume.", "score": 3, "replies": [{"body": "Apparently, rebalancing.", "score": 1, "replies": []}]}, {"body": "What happened is a gift to any buy and hold long term owners of the stock. I bought more.", "score": 3, "replies": [{"body": "I thought about that too. The weekly selling volume went crazy so I'm more concerned with how next week goes to determine which way it'll trade over the next few weeks/couple of months.", "score": 1, "replies": []}]}, {"body": "Betting against one of the largest companies in the world is quite the gamble; keep cooking OP, I want to see what happens to your account(s).", "score": 3, "replies": [{"body": "He said he already made money and not entering next week...🤦", "score": 5, "replies": []}, {"body": "If you read my entire post, you’ll notice that I’m staying away from Apple next week, unless there’s a clear and obvious play in either direction. Like I said I go off charts, which I feel makes me more unbiased when I enter a position. But yeah my accounts looking good after this week, thanks.", "score": 2, "replies": []}]}, {"body": "Interesting take.  Europe and China being out definitely puts a damper on things. I'm curious to see how Wall St. reacts - will it be a 'sell the news' type of event after the hype of AI? Might be an opportunity to buy the dip if it happens... although personally I'd look at semiconductor stocks instead of MSFT or DELL.  More leveraged to the AI boom.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "PUT YOUR HANDS UP hou_mon!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Personally I’m buying as many HIMS and GRND  FDs as financially possible", "score": 1, "replies": [{"body": "Any reason you like dating app stocks?", "score": -2, "replies": []}]}]}
{"title": "All companies focused on chip manufacturing (mostly ones in taiwan or associated with NVDIA ) will go up", "selftext": "Hi, my name is Deathors and i went a bit deeper into this and i was  trying to figure out if this entire so called by general population \"AI Boom\" and compare it to dotcom bubble where they compare nvdia to cisco and my hot take to this is that this thing is far from over and it is not going to be bubble, but other way around. I mean it terrifies me how this technology just in general will affect daily lifes of everyone. Just imagine that with we will be going into taxi which will have driver who is robot and is capable of full conversation with you (scaries is we can already do this type of thing) and now imagine what will this result in what like just few years? \n\nImagine that your taxes will be managed by robots who will send police reinforcements to your location to arerrest you if you dont pay your taxes. This is not just some sort of internet boom, call me crazy but i think if you dont invest in any company which got any sort of deal with NVDIA for manufacturing of chips, which are nessesery to run this technology (oversimplified as fuck btw)\n\nSo if you ask me what i think about NVDIA, my  hot take is that it will go up to 10 trilion by end of next year and i also want some of your opinions about this as well, since i want to know what you as casual retail traders/investors think about it. \n\nThank you for your attention, Deathors", "id": "1dlyoem", "created_utc": 1719071415.0, "score": 0, "upvote_ratio": 0.34, "num_comments": 28, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 38 minutes ago\n**Total Comments** | 2 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Here's the thing with the AI boom. All of our thoughts are inspired by pop culture, where they depict a society that is run by AI and technology. Some can argue that we're already at that point, while most of us definitely see the potential in the future. However, just how far are we from the kind of advances that we're expecting? If you do longer term trading then yeah, the highs and lows this year aren't too much of a concern. However for short term trading, buying the hype is not a strategy.\n\nTo say that this bubble will last into next year does not feel realistic.", "score": 6, "replies": [{"body": "I have 180 calls for nvidia lasting till August. Is that too early? I’m wondering if I should also just hold shares too for the rest of my life as well. Only 19 so I still have a long way to go lol.", "score": 1, "replies": [{"body": "Definitely hold shares", "score": 1, "replies": []}, {"body": "Way better holding shares. Especially with options until August it's most likely not getting to 180 by then.", "score": 1, "replies": []}]}, {"body": "I mean, for those who are doing short term trading like putting puts and calls on end of next week on nvdia it will be funny as hell. Also my opinion is obiously based on pop culture since i am trying to understand what those boomer investors think about this", "score": -1, "replies": []}]}, {"body": "People are always convinced we're on the brink of some huge, world-changing breakthrough thanks to the latest tech. It’s like we think we’re about to live in a sci-fi movie. This idea comes from seeing things like computers getting faster. But guess what? In reality, changes happen as slowly as watching paint dry because society and people take forever to adapt.\n\nHere's the funny part: the only thing that’s actually changing fast is people’s excitement over the newest gadget or idea. Every time someone figures something out, they think, \"Eureka! This will change everything!\" They rush to tell their friends, post on social media, and give TED talks, all fired up and proclaiming, \"We’re living in the future!\" Yet, the world keeps spinning, pretty much the same as always.\n\nIsn't it hilarious? At any given moment, there's someone who just found the next big thing and is sure they're on the verge of a revolution. Meanwhile, outside their bubble of excitement, everything remains pretty much unchanged. It’s like clockwork: human understanding thinks it’s sprinting into the future, while reality just yawns and keeps its slow, steady pace.", "score": 2, "replies": [{"body": "or as Roy Amara said: \"We tend to overestimate the effect of a technology in the short run and underestimate the effect in the long run.\"", "score": 2, "replies": []}]}, {"body": "Deathors, I like your enthusiasm, but 10 trillion valuation for Nvidia next year? That's a spicy meatball. \n\nThere's no doubt AI is huge and Nvidia is leading the charge. But remember, valuations eventually have to be justified by earnings, even with revolutionary tech.  \n\nDon't get me wrong,  I'm bullish long term. Just make sure you're not overexposed and remember to diversify that portfolio.", "score": 1, "replies": []}, {"body": "It will be Death -1 hrs. Better take care of your savings account. Godspeed.", "score": 1, "replies": [{"body": "Yea thanks mate, appriciates your attitude", "score": 1, "replies": []}]}, {"body": ">So if you ask me what i think about NVDIA, my hot take is that it will go up to 10 trilion by end of next year\n\ncan't tell if sarcastic\n\n\n>Imagine that your taxes will be managed by robots who will send police reinforcements to your location to arerrest you if you dont pay your taxes. \n\noh, nm.  lolz", "score": 1, "replies": [{"body": "10 is a round number so it only makes sense", "score": 1, "replies": []}, {"body": "Yes i know it sounds autistic but that is what i expect and go for it. Like god sayes, you can be ballin", "score": -1, "replies": [{"body": "it doesn't sound autistic, it sounds regarded.", "score": 1, "replies": [{"body": "Yea it does actually", "score": 0, "replies": []}]}]}]}, {"body": "Yeah this internet bubble was funny. Never heard of this internet thing afterwards. It was logical that this bubble bursted. However AI will have a true case. No chance that this will burst.", "score": 1, "replies": [{"body": "That is spirit", "score": 1, "replies": []}]}, {"body": "N ce sch zo p st", "score": 1, "replies": []}, {"body": "I don't know how much NVDA will go up but I believe it will go up even more because demand for their chips is nowhere near satisfied.  Whether it's a bubble or not, they are still going to sell a ton more chips.  I think competitors will enter the space before the demand subsides.  \n\nAs far as if AI is a bubble or not.  I like to think of AI in phases because AI will certainly not fade away and die out. But as a business software developer working at a large company in financial information systems, I get a ton of questions about how we can use AI for this or that.  And the answer, a lot of times, is that we really don't need to or wouldn't want to.  Maybe AI could analyze our transactions and find opportunities for reduced costs or something.  I don't know, nothing like that has yet been proposed.  But it would immediately get huge pushback because of security concerns and a bunch of other stuff both real and imagined.  And most of what we do is so simple and repetitive that we really don't need AI to do it.  \n\nI don't think much from this current phase of AI will make it's way into the boring business world except maybe chatbots and search engines and other stuff that employees don't use all that much.", "score": 1, "replies": []}, {"body": "Ok. Lots here to parse. But I am with you that this is a turning point, not a bubble. And Nvidia and Mag7 have an impossible lead and already hold the data.", "score": 1, "replies": []}, {"body": "rad name Deathors", "score": 1, "replies": [{"body": "Hehe just trying to do smth different as how everyone tries too", "score": 1, "replies": []}, {"body": "This is the only takeaway from this post", "score": 1, "replies": [{"body": "shit you right", "score": 1, "replies": []}]}]}]}
{"title": "AMZN call return📈", "selftext": "", "id": "1dm16fs", "created_utc": 1719078308.0, "score": 103, "upvote_ratio": 0.86, "num_comments": 29, "comments": [{"body": "You loving AMZN to rally soon? I keep seeing unusual option activity on it.", "score": 20, "replies": []}, {"body": "What am I looking at?", "score": 5, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 187 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "What am I looking at here? Ur calls are printing while the market is closed? Strike price is 195.. what am I missing?", "score": 7, "replies": []}, {"body": "This is when grubhub was included in the amzn plus ?", "score": 2, "replies": []}, {"body": "Amazon is good", "score": 1, "replies": []}, {"body": "Other than prices, what made you buy the calls?", "score": 1, "replies": []}, {"body": "Also, is that a self directed Roth IRA?", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1dm7r2o", "created_utc": 1719096513.0, "score": 19, "upvote_ratio": 1.0, "num_comments": 26, "comments": [{"body": "[deleted]", "score": 86, "replies": [{"body": "Damn, are you ok?", "score": 5, "replies": []}, {"body": "The way this could change a mfs life,bro belongs here 💀💀💀", "score": 8, "replies": []}]}, {"body": "https://preview.redd.it/3ewdvdrqc78d1.jpeg?width=1290&format=pjpg&auto=webp&s=7e7dedb3f33839aa78f7a017a4c10cc8a1e04643", "score": 18, "replies": []}, {"body": "You never fucken quit when you’re at the bottom.", "score": 15, "replies": []}, {"body": "Proud of you son.  \nNow bless that money and bounce back bish.", "score": 12, "replies": []}, {"body": "When I see porn( losses) like this my grief goes away immediately.", "score": 7, "replies": []}, {"body": "Jesus, WSB never ceases to amaze.", "score": 6, "replies": [{"body": "*never cease to amzn", "score": 5, "replies": []}]}, {"body": "its crazy seeing life changing money go down the toilet all the time in here", "score": 7, "replies": []}, {"body": "Right now step back and let me control the account. B'CUZ you have blown it and I mean the account FULL BLOWN..", "score": 6, "replies": []}, {"body": "This is not trading, yes you need to quit gamble your moneys.", "score": 5, "replies": [{"body": "Turn chart upside down for inverse gain porn; this is the way", "score": 2, "replies": []}, {"body": "\"not saying gambling is bad; but don't fool urself of (u r) investing\"", "score": 1, "replies": []}]}, {"body": "numerous quack fear sparkle homeless distinct degree flag absurd tub", "score": 5, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 15 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 3, "replies": []}, {"body": "damn so how did you lose it?", "score": 3, "replies": [{"body": "Give me an o give me a p give me a t...", "score": 9, "replies": []}]}, {"body": "That's a pretty smooth line down, kinda impressive honestly.", "score": 5, "replies": []}, {"body": "Hahaha made my day. Fuck you loool!!!", "score": 1, "replies": []}]}
