{"title": "Tesla (TSLA) drops to near value stock level, says analyst", "selftext": "", "id": "yz5dhu", "created_utc": 1668839079.0, "score": 60, "upvote_ratio": 0.79, "num_comments": 97, "comments": [{"body": "Nothing to see- analysts trying to pump the stock price", "score": 15, "replies": []}, {"body": "> 23x PE on our FY25\n\nThat's near value?\n\nWhat am I missing?", "score": 63, "replies": [{"body": "Maybe my calculations is off, but when I modeled Tesla, I ended up with around 40%-50% annualized growth by 2027 to get to 25 P/E considering dilution/buybacks to end up at a valuation around 2.3T, which means basically Tesla hold 20%+ of WW EV market share from 2% today. \n\nIf ifs and buts were candy and nuts,", "score": 10, "replies": [{"body": "i modeled it using analysts data and i got 180$ price", "score": 4, "replies": [{"body": "They have to almost double their current EPS in the next 3 years assuming they beat on estimate next Q. I doubt massive buybacks, so we are talking as is, assuming they can keep their margins, which I doubt, have to grow their NI by 85% in 3 years aka go from 11B to 21B. It is hard sell. If the shares drop to $150, sure, we can entertain the analysts data", "score": 5, "replies": [{"body": "yes, thats what analysts expect, a 126% growth in eps in the next 3 years.\n\nproblem is they expect revenue going down a lot but expect earnings still high? how?\n\nif demand goes down or recession happens earnings will go down.", "score": 4, "replies": [{"body": "Even without a recession, I am not sure how many people around the globe can afford a $55K car right now especially with higher rates?\nMargins will go down, part of it to the strong-ish dollar, and other part to inflation. \n\nEven if everything goes perfectly and don’t end up in a hard recession, doubling your net income requires exceptional execution from the management, which has a CEO who is busy running 3 other companies and trolling people on twitter right now.", "score": 6, "replies": [{"body": "many, cause the high percentiles in income still have lots of savings from the pandemic, excess savings.\n\nthey will only cut when high unemply starts", "score": 2, "replies": []}, {"body": "A $55k car but how much does it save you in gas? Oil changes? What’s the true cost?", "score": -1, "replies": [{"body": "Anyone who is struggling to pay for gas and oil changes isn’t going to be able to buy a 55k car.  And anyone who can afford a 55k car isn’t in a financial position where they need to give a shit about the cost of gas or an oil change.", "score": 5, "replies": [{"body": "wrong. I see more electric cars in high priced houses than in a value-homes. Ergo, rich people buy ev's to save on gas and look eco friendly.  \n\nMost of my well paid friends wants eco ev cars for the weekdays and a pickup for weekends.", "score": 1, "replies": [{"body": "I like how you said “wrong” and then proceeded to confirm what I said was true.", "score": 5, "replies": []}]}, {"body": "Not what I meant to imply. Just pointing out that it’s a little more affordable to buy a $55k EV than it is to buy a $55k ICE", "score": 1, "replies": []}]}, {"body": "For a starter, Tesla is a luxury car. If you think the real middle class can afford it, then you are a fool.\n\nAccording to a study from the U.S. Department of Energy's National Renewable Energy Laboratory and the Idaho National Laboratory, electric car owners can save as much as $14,500 on fuel costs by owning an electric car for 15 years. That's almost $1000 in savings for every year of driving.\n\nTo answer your question,\n\nCheapest Tesla should run you around $50K, so that is around $1,000 assuming no down payment. So, $920/month payment.  So lets say a normal human being spend 10% of annual income or less on a car payment, that will lead is us to a gross salary of $110,000, which is of course, what every person makes these days.", "score": 2, "replies": []}]}]}]}, {"body": "150 would still be like 450 billion valuation though.", "score": 2, "replies": []}]}]}, {"body": "Over the years of being dumbfounded by Tesla, I've learned that not a single share of Tesla was bought using math. Wait until people find out that a working electric semi truck  would violate laws of physics.", "score": 8, "replies": [{"body": "Someone better call Volvo and tell'em", "score": 6, "replies": [{"body": "The problem is that these semis are meant to replace final destination vans. Sure, if you want to tow 80,000 pounds 10 miles then the 4x6 would be perfect. The way we have logistics set up now, semis travel 500 miles per day. You cannot put enough energy into these batteries to tow 30-80k more than right down the road. You need the energy density of gas/diesel. \n\nThe description for these trucks are misleading by design. It's why you don't see them on the road. They say \"range is 250 miles and has a max GCW of 30k\" but they won't tell you how far it can tow 30k.", "score": 3, "replies": [{"body": "What physics class did you attend?", "score": 0, "replies": [{"body": "physics", "score": 3, "replies": []}]}]}]}]}, {"body": "Hope you've got buybacks modeled at zero.", "score": 1, "replies": []}, {"body": "how do you model stocks", "score": 1, "replies": []}]}, {"body": "Growth rate", "score": 6, "replies": []}, {"body": "Nothing. What they're missing is used Tesla prices crashing 13% in three months, demand shrinking down to supply, ever increasing competition, and interest rates still rising and making these cars too expensive (especially outside the US). In Canada the Y starts at 85k, financing is at 6.74%. With 50%+ income tax in he higher brackets, expensive housing and everything else. Forget about it.", "score": 2, "replies": []}, {"body": "Isn’t that the same PE that apple has?", "score": -9, "replies": [{"body": "LOL", "score": 5, "replies": [{"body": "What’s so funny? Look up apple’s forward PE", "score": 2, "replies": [{"body": "I think people might consider Tesla and Apple on different ends of the value spectrum, particularly if Mr. Musk is distracted. Consider further that he’s pulling resources from Tesla to work the Twitter problem.  Thinking of it in terms of investing in Tim Apple or Elon Loose-Cannon might capture the funny.", "score": 2, "replies": []}]}]}, {"body": "Why are you downvoted?", "score": 1, "replies": [{"body": "Cuz FY25 and FY22 are very different. If you’re going to value the company as in 3 years from now. You should discount that value back to the present. Think of it as a hybrid approach between DCF and multiples", "score": 5, "replies": [{"body": "Apples forward PE is the same as TSLA forward PE. Look it up", "score": 0, "replies": []}]}, {"body": "No idea, a lot of people didn’t even bother looking at AAPL forward pe before downvoting lol", "score": 0, "replies": []}]}]}, {"body": "23X PE in FY25 is the same as aapl, look it up", "score": -1, "replies": [{"body": "I did. AAPL is at a 25 PE *today*.", "score": 7, "replies": []}, {"body": ">23X PE in FY25 is the same as aapl, look it up\n\nAre you seriously comparing the two?\n\nAapl is 24 PE NOW, as opposed to 23x PE in FY25, and after these past three years are you seriously saying theres no risk premium for three years?\n\nNot to mention an established relatively mature and safe investment into Iphones and macs vs Electric cars?\n\nTelsa is hardly a value stock, it's still very much a growth stock and priced as such unless you think a 55 PE after a 55% drop in stock price\n\n>appears to trade at a lower price relative to its fundamentals, such as dividends, earnings, or sales", "score": 2, "replies": []}]}, {"body": "That it's not done growing.", "score": 1, "replies": []}]}, {"body": "so many stocks are so fucking low, literally 5+ year lows. do your research if nows not a good time to buy then who knows when. cant time the bottom but you can have a good guess.", "score": 13, "replies": [{"body": "What ya lookin at? I got a Scott’s miracle grow cuz why not", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Depends how much you believe in the company.", "score": 14, "replies": [{"body": "It depends in how much you believe in twitter.", "score": 5, "replies": []}]}, {"body": "I sold and bought puts. I think looking at other tech companies and Elons behavior and the lawsuits, in the short term it is going down", "score": 3, "replies": []}, {"body": "Tesla about to have a fire sell and you can average down to $50 lol", "score": 8, "replies": [{"body": "I'll buy at 50", "score": 2, "replies": []}]}, {"body": "If you think fsd is around the corner, buy buy buy.\n\nElse, who cares.", "score": 2, "replies": [{"body": "Well that’s just it. The Tesla was commanding the attention and prices by the promise of full self driving. There are other electrics. And a ton being introduced.  But after nearly a decade of promises it’s clear FSD is vaporware.  You may be trading in your car before FSD is finally developed for real, even though you paid for it and got nothing but a novelty you had to watch like a new teen driver you are training.", "score": 3, "replies": []}]}, {"body": "sell and never buy again", "score": 4, "replies": [{"body": "Oh man. Tesla is the Coca Cola of electric cars. I don’t know that it Is we l worth what it trades for, but I’m looking for a good chance to buy Tesla at an amazing price.\n\nI think it will be soon", "score": 3, "replies": [{"body": "you will love tesla at $60", "score": 0, "replies": [{"body": "Let's see if Buffet does. Then we'll know it's at deep value.", "score": 1, "replies": []}]}]}]}, {"body": "Has your thesis of ‘green transition’, electric vehicles, or the company in general changed? If not, DCA and chill.\n\nPersonally mine has changed for all three so buy orders set much lower.", "score": 0, "replies": []}]}, {"body": "Although 2021 & 2022 have been strong years for Tesla from an operating  performance perspectiv, a value investor would usually like to see consistent above average return on equity over a longer period of time.", "score": 9, "replies": [{"body": "And a much lower valuation.", "score": 2, "replies": []}]}, {"body": "“Near value” is like “transitory” and “recession” being redefined every week.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Unfortunately your absolutely right -ex Tesla employee", "score": 4, "replies": []}, {"body": "In the end, Tesla is really just selling batteries. Doesn’t matter if that battery is in a car, a semi, a bot, or home storage. Batteries are the limiting factor.", "score": -4, "replies": [{"body": "Tesla battery technology is falling behind what coming out Korea,Germany and Japan.\n\nhttps://www.cnet.com/roadshow/news/the-new-batteries-that-will-make-you-an-electric-car-believer/", "score": 7, "replies": [{"body": "A lot of things are “coming”. Especially in the battery technology world. I’ll believe it when I see it in production and in consumer’s hands. Seems like the main competitor technology is releasing their first set of batteries with Mercedes in 2025", "score": 1, "replies": [{"body": "Read the article 2024 should be available.Solid state batteries with higher density,less weight and less chance of it exploding is probably be the norm in 2025.Tesla is not even close to putting those packs into their Teslas.When the 1000km barrier is broken EV will be accepted by the masses when prices comes down and more  charging stations are added.", "score": 2, "replies": [{"body": "This part?\n\n>\tBuzzy EV newcomer Vinfast recently committed to invest in solid-state battery-maker ProLogium for batteries that could be in the Vietnamese manufacturer's electric cars by 2024.\n\nThe article linked says all that needs to be said:\n\n>\tSolid-state batteries are sort of like the fountain of youth or a genie in a lamp. They are supposed to be the next generation of batteries, enabling super long range, super fast charging, and superior safety at relatively low cost. The problem being: commercially competitive solid-state batteries are always just around the next mountain. Nonetheless, when news of new hop comes out, it’s hard to ignore it. The new hope this time is that VinFast/Vingroup has invested tens of millions of dollars into next-gen solid-state battery manufacturer ProLogium.\n\nLet’s see, some random Vietnamese company, with zero solid state batteries shipped,  magically figured out solid state batteries with tens of millions in research while the rest of the world with billions spent on research haven’t. Meanwhile the company has only delivered 100 EVs, with weaker motors and less range than model 3 but more expensive. \n\nThis is your Tesla killer? Have you even thought about this, how crazy it is that some random startup with no money solved the decade long solid state battery problem, or do you just hate Elon and therefore blindly follow whatever bullshit some no name competitor says?", "score": 0, "replies": [{"body": "He’s probably a quantum scape bag holder", "score": 1, "replies": []}]}]}]}]}, {"body": "Would you say this is good with the potential battery market?", "score": 2, "replies": []}, {"body": "Doesn't Panasonic make a lot of their batteries?  I don't know much about that industry but I thought there were other players like Panasonic that also make batteries.", "score": 1, "replies": [{"body": "Panasonic is one of their suppliers. Tesla also makes some in-house. Then they jam it into whichever product has the highest demand at the highest margins and deliver it to customer.", "score": 3, "replies": []}]}, {"body": "Well that sucks for Tesla considering they are outsourcing their manufacturing to Panasonic \n\nhttps://electrek.co/2022/07/13/tesla-battery-supplier-panasonic-teases-impressive-increases-capacity/", "score": 1, "replies": [{"body": "They’ve always used Panasonic. That’s why the Panasonic partnership has been so great. so much so that’s why giganevada was made. 2/3 of it is Panasonic", "score": 1, "replies": []}]}, {"body": "If it’s about batteries why has Panasonic been so anemic when they make the best batteries?", "score": 1, "replies": [{"body": "Because Panasonic investors are not meme investors.", "score": 2, "replies": []}, {"body": "Panasonic is building a new factory in Kansas to supply Tesla. Giga Nevada is also growing (joint venture w/ Panasonic). With the rate of improvement, it doesn’t make sense for them to put all their eggs in one basket. They’re also working with CATL and BYD. Tesla is locking up as much battery supply as they can.", "score": 1, "replies": []}]}]}]}, {"body": "When this dumpster fire falls to PE of 12 I will probably buy it again. The hype around it has died. Competitors are starting to mass produce cars that are much better in just about every way. This thing will continue to go down hard. Can it go up a little first sure. But this and other insanely valued companies will burn as the bear market continues", "score": 2, "replies": []}, {"body": "Lol, Tesla and value stock?", "score": 2, "replies": []}, {"body": "Tesla has peaked. The major auto makers will continue to be the major auto makers as we transition from IC to EV.", "score": 7, "replies": [{"body": "major? only KIA is doing great+BYD\n\nFord is in the ok group", "score": 2, "replies": []}, {"body": "The other manufacturers don’t have fan bois and fan grlz", "score": 2, "replies": [{"body": "But they do have Congress", "score": 2, "replies": []}, {"body": "Yes they do lol", "score": 1, "replies": [{"body": "Please show me the subreddit subscriber count to each one you’re suggesting.", "score": 0, "replies": []}]}]}, {"body": "The legacy OEM’s are swimming in debt and selling EV’s at a loss. They’re scrambling to retool their factories for EV’s and bring down costs. The problem is Tesla has a significant lead, fat margins and is moving faster than legacy OEM’s to further bring down costs. I’m not saying all will fail but it will be very very difficult and may take another round of government bailouts which still may not be enough. If they can find a profitable niche, they may be able to survive. BYD is the only other company making money with EV’s. Get ready for the Chinese invasion.", "score": 1, "replies": [{"body": "Sounds like wishful thinking from a Tesla investor.", "score": 1, "replies": [{"body": "You clearly don’t understand technology S curves. EV’s are not going to be a slow linear adoption.", "score": 1, "replies": []}]}]}]}, {"body": "They still have 50% more to drop before they come down to the clouds and have a line of sight on reality in the real world.", "score": 2, "replies": []}, {"body": "What near level? Can’t keep up with these new terms…", "score": 2, "replies": []}, {"body": "This is what people on the Value Investing page were saying about META at $180/share.", "score": 2, "replies": []}, {"body": "fair price is $40", "score": -5, "replies": [{"body": "My butt dyno thought $50, so if it does drop to $40, ill consider buying before Toyota buys Tesla.", "score": 1, "replies": []}]}, {"body": "#🍉", "score": 1, "replies": []}, {"body": "Analysts are dumb", "score": 1, "replies": []}, {"body": "That’s how you know it’s going down. Way more down.", "score": 1, "replies": []}, {"body": "TSLA a value play? Just more signs that the price is headed further down.", "score": 1, "replies": []}, {"body": "I’ve been asking my self the same question. Sell and buy $aapl instead?", "score": 1, "replies": [{"body": "Honestly getting tired of Musk being a show man.", "score": 1, "replies": []}]}, {"body": "“Please buy and hold bags for me”", "score": 1, "replies": []}, {"body": "Seems like the boss spent his weekend trying to figure out the full stack program for Twitter from the remaining sycophants or visa refugees that just run code others wrote. What an amazing crisis manager! What a valuable investment of time for dying company. Elon buried his reputation this week and TSLA needs to jettison him if they hope to reach these unrealistic valuations.", "score": 1, "replies": []}, {"body": "All depends who the analyst is..if it's Cramer..better wait!", "score": 1, "replies": []}, {"body": "If everything else was expensive while TSLA is at current price then I would have found TSLA to be cheap. but everything else is also cheap right now. When everything is cheap, one has to be cheaper to look like it's cheap.", "score": 1, "replies": []}, {"body": "If it doesn't hit 200 by next Friday. I will close all of my accounts :)", "score": 1, "replies": []}, {"body": "Musk has made it impossible to separate him from the company and yet he has done nothing in 2022 but make people question his moves, his priorites, his thinking, and his ability to lead.  Investors have noticed and have stopped giving the company the benifit of thier unending optimism.", "score": 1, "replies": []}, {"body": "I’ll give you $30 a share", "score": 1, "replies": []}]}
