{"title": "Do y'all think it's a good time to buy tsla?", "selftext": "The company isn't going anywhere, and I'm one of the people who believe it wasn't overvalued. It fell cuz of issues not directly related to tsla so now is probably a nice time to buy.\n\n\nI am not from USA but I bought a lot of usd (and increased my usd short position parallely) just to pick up tsla from the bin!", "id": "ymne9n", "created_utc": 1667634011.0, "score": 9, "upvote_ratio": 0.59, "num_comments": 97, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 day ago\n**Total Comments**|5|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ymne9n)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ymne9n)", "score": 1, "replies": []}, {"body": "WSBs hates Musk and anything related to him. I’m long as fuck on TSLA.", "score": 13, "replies": [{"body": "I'm long AF on TSLA too... I find all the WSB hate funny but to each their own.", "score": 5, "replies": []}]}, {"body": "My opinion is: flawless balance sheet, but high p/e ratio. \n\nFuture earnings are not covering the actual p/e ratio.\n\nIn particular a lot of chinise EV automaker will squeeze competition on price on an already squeezed sector.\n\nCould the price still go up? Yes. But is not fueled by foundamentals. \n\nBye", "score": 12, "replies": []}, {"body": "It depends on what your time horizon is. If you need the money in 2 years, then I wouldn't invest. But if you can hold out then sure. TSLA and a lot of other tech has been pulled down, and likely will fill the gap over time. A lot of people like toa say the company is over valued, but they conveniently don't mention their margins, cash position, and debt-- which are in better shape than basically all the other auto makers.\n\nI remember in college people said Tesla was overvalued. It was 2013 and people were freaking out then. People don't grow tired of shitting on the company, and they love seeing it go down. But in the end it continues up.", "score": 8, "replies": []}, {"body": "Before for you buy, realize that we have seen peak Elon. He will never have the force of character he once had.  And now, he will be splitting time with Twitter.  Alot of tslas value is from the whole cult of Elon thing. Tesla won't go away, but it still has a very high valuation.  If it was me, I would wait.", "score": 6, "replies": []}, {"body": "If WSB has taught you anything, you need to inverse what the general consensus is\n....so yes, buy Tesla. Hand over fist.\n\nThe people saying it should have a P2E like F are idiots. Tesla has no debt and makes more net profit than any car company in the world (just passed Toyota and growing at 40-50% yoy)... including the highest margins ~30%.\n\nAnd that's just the car business. They had record energy sales last quarter and are working on automation...if they can achieve half of their goals, they'll will be the most valuable company in the world.\n\nI'm adding and adding.  I need about 1000 more shares to get to my goal before I even start diversifying.  I still have my 401k for boomer plays but this is a generational company", "score": 10, "replies": []}, {"body": "Probably best to ask this on a Tesla sub to get the validation you want", "score": 4, "replies": [{"body": "Not asking for validation bro, I just have almost 50% of my cash not invested so I was thinking of diversifying and trying my luck on tsla. What I've usually seen is the market overreacts, the stock falls more than it is supposed to and rebounds.\n\n\nNow people could explain why tsla isn't overvalued and all those arguments hold true today also except maybe Chinese ev scene (they've cloned fighter jets, what's tsla here XD).\n\n\nI just wanted to take an opinion on this before I go ahead. I still haven't bought much tho, went in small today.", "score": 1, "replies": []}]}, {"body": "I'd wait til the Twitter drama stops. TSLA performance is always based on Elon's bipolar, right now he's being super performative and wacky, so it'll tank until he puts his serious face on again.", "score": 3, "replies": []}, {"body": "It’s intrinsically linked to twitter now - I’m shorting that shit", "score": 16, "replies": []}, {"body": "Avoid at all cost. TSLA is a meme stock  trading at 10-20x it's intrinsic value. \n\nThe Chinese will totally dominate (non-US) EV sales in a few years. They already produce 150+ different EVs ranging from $4.5K runabouts to $3M hypercars. Hundreds of new models are in the pipeline. Most of them are much cheaper than Western equivalents.", "score": 16, "replies": [{"body": "Ok, guy… OP didn’t ask for your opinion. He said he likes the stonk and he would appreciate you validating him…", "score": 10, "replies": []}, {"body": "This is extremely doubtful. China will dominate the Chinese market. It’s seriously moronic to think they will dominate EV sales outside of that.", "score": 2, "replies": []}]}, {"body": "No, its going to 150", "score": 5, "replies": [{"body": "Seems like a good price to add", "score": 2, "replies": []}]}, {"body": "![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4887)", "score": 5, "replies": []}, {"body": "I would consider the timing to buy tech stocks and Tesla has an extremely high P/E ratio. You also have to take account of other car manufacturers getting into the EV market. Ford has some promising new EV models along with GM. There’s going to be new competitors within the EV market and honestly TSLA as a brand has gotten a little stale in my opinion. Their vehicles have looked the same for a long time and next year their competitors will enter the market in full force. It’s also a product only available to so many people. Tesla isn’t inflation proof either. The job data just came out and even tho payroll was up so was unemployment. I don’t really know how this works but I’m guessing low skilled workers will be the first to be effected. The job market is good which could mean hot inflation. The price of goods and services will likely to continue to increase and the fed will have to take further action. The markets and economy as a whole lag behind rate hikes but I think equity investors are worried about profitability of companies in an economy that’s struggling. I’m still buying equities, but have converted over half of my portfolio into cash. Historically it’s been a very good time for investors to enter markets at the sign of the first rate decrease by the fed. But honestly I feel inflation is going to be quite hot for a while. We’re not quite there yet. Don’t invest in Tesla rn.", "score": 7, "replies": []}, {"body": ">You're an idiot if you think Tesla isn't overvalued. The company is a complete mess and it's only going to get worse. Anyone who buys Tesla at this point is a fool and will lose their money.", "score": 14, "replies": []}, {"body": "The stock is literally on the edge of a 25% gap down on the chart as we probably are on the verge of heading into another market down leg. Buy TSLA at this place if you like losing money.\n\nAnd even if by some miracle the market rallies and drags it up from the ledge, winning this trade here would be pure luck... and that by itself makes it a bad trade idea.", "score": 5, "replies": []}, {"body": "No I rather buy a burrito company with the same PE Ratio ![img](emote|t5_2th52|4267)", "score": 2, "replies": []}, {"body": "I think it's a great time to short or buy tslq. With interest rates rising 60k+ vehicle sales will decline and they're reaching a point of market saturation.", "score": 2, "replies": []}, {"body": "Cars produced / equity value...\n\nIt's not overvalued? It wasn't? \n\nHuh?", "score": 2, "replies": [{"body": "The way I see it, tsla has sorta built a brand. It's no apple but it is up there! And there really isn't anyone doing what he does. Which self driving vehicle works that well? Starlink + camp mode, the superchargers, and they are extremely good cars for the price even ignoring the super chargers.\n\n\n+ you don't know what these tech companies do/can with data, and tsla has a lot of it.\n\n\nTheir numbers and ratios might be fucked up but when you are the biggest baddest bully in town, people give you their lunch money without you asking XD.", "score": 0, "replies": []}]}, {"body": "Buy tesla at 300 when it’s toppy,  not now when it’s down 45% on the year", "score": 5, "replies": [{"body": "Buy high, sell low. Best idea ever.", "score": 8, "replies": []}, {"body": "Username ✅", "score": 4, "replies": []}, {"body": "I did make that mistake and bought 2 shares at $300 after the split still holding ironically it’s doing better than my Amazon and Google shares", "score": 2, "replies": [{"body": "117 shares here dollar cost average 299$ \n\nBagholder", "score": 3, "replies": []}]}]}, {"body": "Not overvalued? Tf.  Good luck going forward. It was a trillion cap making next to nothing. Good times.  It's almost like we are the dot com bubble level of dumb.", "score": 4, "replies": []}, {"body": "I don't like the risk/reward on Tesla. It's gone up so much since 2020. There are way better value buys right now during this bear market. Like Bitcoin", "score": 4, "replies": [{"body": "Dude said Bitcoin 🥺", "score": 7, "replies": []}]}, {"body": "It’s the only car company with cars sitting on the lot besides Dodge in my city, so probably not.", "score": 4, "replies": [{"body": "All the dealers have cars on the lot here. Either sales are slowing, production is increasing or both but the car market is shifting like housing.", "score": 1, "replies": [{"body": "Wow that’s lucky, we get screwed here in Canada I guess, loads of cars here have a few months to a year wait. If you need a car today your options are buy used for an inflated price, a Tesla, or a Ram. So most people are opting to wait for a car they actually want or buy a used car at a premium.", "score": 3, "replies": []}, {"body": "They’re still selling here in MS. Vehicles come in and sell out. Always something in stock but always rotating.\n\nThey’re still selling for 8k and up ABOVE sticker price", "score": 2, "replies": []}]}]}, {"body": "TSLA is on the verge of becoming the biggest company in the world and has the potential to treble the stock price in a year. Easy money if you ask me. Pile in now...you won't regret it.", "score": 2, "replies": [{"body": "Margins are great but you are 100% wrong.", "score": 3, "replies": []}]}, {"body": "I'd give it a few months we got a dip coming.", "score": 2, "replies": []}, {"body": "Lots of people who don’t understand Tesla giving you bad advice. Over the very long term for any stock, what matters is sales and profit growth. Tesla has that in spades. Last quarter, Tesla’s net profit was greater than Ford, GM, as well as Toyota. Model Y is already the number one selling vehicle world wide.", "score": 1, "replies": [{"body": "Exactly. And the trajectories are very telling. Tesla up 50% YoY, most others down 25-30%\n\nAnd that's just the car business!!", "score": 2, "replies": [{"body": "Errrr… they are a car business?", "score": -1, "replies": [{"body": "Lol, okay. They have solar, energy storage, power grid software/virtual power plant, and farther down the road, automation/FSD/robotaxi.\n\nJust like Google is a search engine and Amazon sells books 🤣🤣🤣", "score": 2, "replies": [{"body": "Oh I thought we were talking about their existing business. (Toyota does more than cars too by the way).\n\nThe other stuff are add ons but not core or a large part of revenue. \n\nMay as well start including Optimus in your valuation.", "score": -1, "replies": [{"body": "They had record energy storage deployment and revenue last quarter as well. Markets are forward looking, that's how this all works.  That's why forecast are more important than current revenues. Tesla is killing it at both and growing 50% YoY... they are still exponential and Toyota (and most automakers) are sliding down", "score": 2, "replies": [{"body": "Record for them lol. Really not worth what you think it is.", "score": 0, "replies": [{"body": "I think the world has learned how foolish it is to depend on other countries for energy. Energy independence, including solar, will get a huge lift from this Russia Ukraine conflict", "score": 1, "replies": [{"body": "Where is most of tesla’s production?", "score": 0, "replies": [{"body": "It seems like you have made up your mind and there's no way I'm convincing you of anything.  Plus I really don't care what you think, the writing is on the wall.  No need to waste time on this discussion. One of us is right and will reap the rewards, the other one is you 🤣", "score": 1, "replies": [{"body": "Lol typical blinkered Muskovite.\nThat 50% growth number will likely end this year, and then, well, just look at Amazon and FB when they don’t hit expectations.", "score": 0, "replies": [{"body": "Sure, and now you hate Musk bc you've been told to.  It's amazing how gullible sheeple are but keep listening to your masters, they haven't steered you wrong yet 🙄", "score": 0, "replies": [{"body": "Sorry I am laughing far too hard at this. And reminded that I really shouldn’t argue with idiots, as all they do is take an argument to their level and beat you with experience.", "score": 0, "replies": [{"body": "I'll give you a better one so you can also lose your next internet argument... but with more style \n\n\"Never enter a battle of wits with an unarmed opponent.\"", "score": 0, "replies": [{"body": "Exactly this.\n\nShow me some facts.", "score": 0, "replies": [{"body": "What facts are you looking for? Revenue and net profits (over 3B last quarter) growing at over 100% YoY.  Production and delivery records on pace for 40-50% growth.  No debt, 21B in the bank.  Ramping up 2 new Gigas.  New US EV tax credit starting in 2023 that will again send demand thru the roof for the foreseeable future.  And that's just the car business. Solar, energy storage, virtual power grid, auto bidder, insurance,  automation/full self driving/robotaxis. This really is a generational company and I have no plans to sell for 10 years at least. If it gets cheaper, I'll buy more. Need about 1000 more shares to hit my goal and then I'll start to diversify.\n\nLike I said, I'm really not interested in convincing you of anything.  You're really not important to me or to where the world is headed.  Why would I spend my time showing you anything? The facts are readily available, if you care to actually look.  But I'm pretty sure you've already decided where you stand.  It's comical how people are told what to feel and just jump right in, use your own brain my man. Eesh", "score": 1, "replies": [{"body": "Ok so tell me how many more years of 50% growth do you need to justify the valuation? You need more gigas ready to go online now to monetise the current excess demand but that’s not going to happen. \n\nMargins are going to compress, and the China market is going to be taken by the competition. FSD, robotaxis, cybertruck etc etc - umm yeh…\n\nCEO is an absolute snake oil salesman and is destroying brand value (yes, it matters) - Tesla is not the only green show in town.\n\nThat yoy growth will not last this year, and that is unfortunately what a lot of Tesla investors have plugged into their models. The growth story ends soon, and your man at the helm has made up a robotics market that will deliver your next 10x. ALL THE WHILE SELLING HIS SHARES under some guise or another.\n\nTesla without Elon, focus on cars and delivery maybe a buy at 120/130, but if I were still a shareholder I would be very nervous seeing his management style given the Twitter debacle.", "score": 0, "replies": [{"body": "Tesla will grow at 40-50% for at least the next 3 years (their own projections unless you think they are lying and want to phone the SEC).  Competition is coming but the pie is also getting bigger.  Tesla has industry leading margins and can lower prices to smash the competition whenever they need to... they are out in front and wearing a jet pack. They innovate much faster than these ICE dinosaurs who are trying to compete.  The lead is getting bigger, not smaller 🤣\n\nAnd that's just the car business. You are also seeing their other products hitting the S curve, just like their vehicles are currently experiencing.  I don't know that they will all be homeruns but they are all exciting in their own rights. \n\nSnake oil salesman...lol. like when people said electric vehicles would never work, reusable rockets were impossible? You mean, that guy?  Add to that innovations in manufacturing/scaling and I'm a believer when he says he will accomplish something. Hard things take time but I haven't been let down yet (albeit with ambitious timelines)", "score": 1, "replies": [{"body": "Tell me about that robotaxi thing that went live, when was it, last year? \n\nI don’t believe those projections and I do believe he is lying - like FSD, the Semi, the roadster….. forget how many things.\n\nI never said electric cars won’t work, knew it just needed critical mass and infrastructure and that’s where we are now - a world where those margins won’t be around for much longer - and the ICE car market isn’t going to go away in the next 10 years either. \n\nSpaceex is a private company, and if you think Tesla is going to get some freebies out of it you have another thing coming. As much as I dislike him he certainly knows how to extract value for himself.\n\n.", "score": 0, "replies": [{"body": "Anyway, just so you know, there are people who look at Tesla and see a short, and they aren’t stupid. \n\nSo as fun as this was good luck and hope you don’t have your life savings in one stock - because smart people don’t do that.", "score": 0, "replies": [{"body": "I'm rich, no need to worry about me. I have a lot of money and I make a lot of money...Tesla could go to zero and I'll still be solid.  It is my largest holding though and the company I care the most about so that would still hurt... but I just don't see it happening.\n\nSemi deliveries start 12-01-22... you won't have to wait long to be proven wrong on one of your points.  Robotaxis realistically a decade away IMHO.\n\nAnyways, Tesla shorts have lost billions betting against Tesla and are partly responsible for the ~6x we had in 2021. Load them up boys! I'll keep accumulating and waiting for them to force cover again. Fuel for the rocket 🚀", "score": 1, "replies": [{"body": "Apologies that was a typo - cybertruck not Semi (so many promises to choose from) \n\nWell done being rich your 1000 shares will probably come quite soon if you keep accumulating. Oh, and I’m not shorting this - took my profit earlier this year was looking for an entry point changed my mind on this. \n\nGood luck", "score": 2, "replies": [{"body": "Thanks, g'luck to you too", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "The model y is not the number 1 selling car worldwide.\n\nThere were more corollas sold than teslas produced.", "score": 2, "replies": [{"body": "I thought I read some where that it already was the number selling, but I couldn't find a link just now, but I did find severals links that says the Model Y is on tract (within the next 12 months) to be the number selling car world wide. Here's a link. [https://electrek.co/2022/08/05/tesla-model-y-on-track-worlds-best-selling-car/](https://electrek.co/2022/08/05/tesla-model-y-on-track-worlds-best-selling-car/)\n\nYou can find other sources if you did a google search.", "score": 0, "replies": [{"body": "You didn’t. I did my research - all of 3 seconds to know that you are wrong.\n\nAnd I’m on track to be richer than Elon Mush.", "score": 0, "replies": []}]}]}]}, {"body": "Tsla is overvalued. Wait until they hit a PE similar to TM or F. Having said that, there’s a lot of hype so maybe there should be a premium built into it. Buy tiny amounts and cost average as it goes lower?", "score": 1, "replies": []}, {"body": "Tesla valuation will be around 4 trillion, and price wise since the split it will at least double in the next 6 months with potential to triple and quadrille as internet FOMO takes hold.", "score": 1, "replies": []}, {"body": "Can’t go wrong with Tesla. The future is bright", "score": 0, "replies": []}, {"body": "Even Elon said don't buy this.", "score": 0, "replies": []}, {"body": "Look into the next Tesla my dude 👉NIO.", "score": -2, "replies": []}, {"body": "I’m all in on Tesla and I’m all in on musk. Tesla to the moon 🚀", "score": 0, "replies": []}, {"body": "The shine is starting to come off EV's. Stories are starting to make the media about how impractical, environmentally damaging (worse than ICE vehicles), poor charging and high electrical use on a grid that isn't ready for a lot of EV's.\nLots of other companies are get into the market and competition is starting to soar. Not a long term play unless very radical new battery technology is developed that doesn't rely on rare earth minerals.", "score": -3, "replies": [{"body": "Your first argument against EVs is literally just lying.", "score": 3, "replies": [{"body": "I don't expect you to believe me. Look it up for yourself and come out from under the leftist rock you've been stuck under! That is if you are willing to open your mind to the realities rather than the propaganda story lines.", "score": 0, "replies": [{"body": "Again, you're literally spouting propaganda.", "score": 3, "replies": [{"body": "You didn't look it up, did you? You just want to attack yet your mind closed. Get out of your mom's basement, change your diaper, and stop eating Ben & Jerry's and get a job. Fully enter the real world!", "score": -1, "replies": [{"body": "You don't know how arguing works, do you? When a person makes a claim, especially one that is highly partisan and demonstrably false, it is that person's responsibility to provide evidence to back up their claim.", "score": 2, "replies": []}]}]}]}, {"body": "I think he is referring to the materials that make ‘em. They are more efficient for sure (co2 to power wise) but if everyone switched today the grid would not be ready.", "score": 0, "replies": [{"body": "There aren't enough EVs for that to happen, so it's a moot point.", "score": 2, "replies": []}, {"body": "People quite literally never look at environment. How many pissed off people did we find on Twitter when paper straws were introduced?\n\n\nInstead gas prices were something elon used soo much to sell his cars. Now it is even more compelling.\n\n\nBut mainly, I'm not going behind his car sales. There is soo much more to tsla than that.", "score": 2, "replies": []}]}]}]}, {"body": "There is a post regarding that. If you scroll down you’ll see some chart predictions.", "score": 1, "replies": []}, {"body": "At 69", "score": 1, "replies": []}, {"body": "How long we talking? A day a week a year ? 3 years?", "score": 1, "replies": []}, {"body": "Stay away until it gets a CEO who isn't a public relations nightmare.", "score": 1, "replies": []}, {"body": "I would either buy every single week or buy a ton and sell covered calls.", "score": 1, "replies": []}, {"body": "People are gonna see what Elon does with Twitter and decide whether they want to invest in Tesla based off his performance. Right now it’s not looking so good, he took a major L by buying Twitter at an overpriced value.", "score": 1, "replies": []}, {"body": "Nah elons tanking his stock currently wait a little give it a week and it’ll be 180$", "score": 1, "replies": []}, {"body": "Considering the CEO \\*IS\\* the brand and he's obliterating said brand in real time for all to see by making potentially the dumbest business move in history? \n\nYeah, good luck with that one.", "score": 1, "replies": []}, {"body": "I am still holding and I m down on tsla. I m selling no ![img](emote|t5_2th52|4641) it can still go up in 2to 3 years if u want quick bucks then no !", "score": 1, "replies": []}, {"body": "I did but I’m in for the long haul", "score": 1, "replies": []}, {"body": "Yes at pre covid price of $55", "score": 1, "replies": []}, {"body": ">The company isn't going anywhere\n\nI'm sure there are a lot of investors that felt the same way about Enron, and more recently, Theranos.", "score": 1, "replies": []}, {"body": "It’s a turd.", "score": 1, "replies": []}, {"body": "Wait for the pivot! Lol don't fight the fed👀", "score": 1, "replies": []}, {"body": "Over the long run, once production is pumping and expenses go down, this thing is gonna go crazy", "score": 1, "replies": []}, {"body": "Yeah. I would. I did. I will some more.", "score": 1, "replies": []}]}
{"title": "How I’m Getting Rich Trading In This Bear Market", "selftext": "[removed]", "id": "ymxsop", "created_utc": 1667663502.0, "score": 99, "upvote_ratio": 0.72, "num_comments": 99, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|7 months ago\n**Total Comments**|9|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ymxsop)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ymxsop)\n    \n>TL;DR: I find weekly reversals using Runstrat.com, pick nearest OTM and buy 45 days out.", "score": 1, "replies": [{"body": "Doesnt this post break rule 6? \"No advertisement\" look at his recent posts", "score": 2, "replies": []}]}, {"body": "I will now inverse this strategy", "score": 77, "replies": [{"body": "And I will inverse the inverse which means I will keep doing what I have been doing already….", "score": 8, "replies": [{"body": "I’m with you pal, let’s keep doing what’s been working until it doesn’t and post a big loss porn. What do ya say?", "score": 0, "replies": [{"body": "Tis the only way", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 0, "replies": []}, {"body": "Genius", "score": 0, "replies": []}]}, {"body": "This is an ad... blah blah blah... here's my website! Give me money.", "score": 40, "replies": [{"body": "Literally just an ad spammer, check those recent posts lol", "score": 4, "replies": []}]}, {"body": "Going to save this then never come back to it", "score": 30, "replies": []}, {"body": "Send me $1000 and I’ll put this to the test and return your $1000 after I’ve doubled it.", "score": 34, "replies": [{"body": "PM Paypal address", "score": 3, "replies": [{"body": "Wow. Serious?", "score": 1, "replies": []}, {"body": "Too regarded to figure out PMs.", "score": 1, "replies": []}]}]}, {"body": "This should be titled “how I bought puts on anything in a bear market and any idiot can do the same”. \n\nNo shit.", "score": 22, "replies": [{"body": "Check track record", "score": 0, "replies": []}]}, {"body": "I'm gonna read this when I'm sober and rested", "score": 18, "replies": [{"body": "So basically never ?", "score": 11, "replies": [{"body": "Dont throw factual statements as if they were insults!", "score": 7, "replies": [{"body": "I thought this was the Batman chart thread for a moment", "score": 1, "replies": []}]}, {"body": "He just like me fr", "score": 2, "replies": []}]}, {"body": "It’s gone now. You’re too late", "score": 1, "replies": []}]}, {"body": "I think I’ll just donate the money to a food bank instead", "score": 6, "replies": [{"body": "Or we could have lunch at Golden Corral\\*. \n\n&#x200B;\n\n\\*Assuming they are still in business. *Reagan was in office the last time I visited one.*", "score": 2, "replies": []}]}, {"body": "Do we allow ads on this sub now? Strange", "score": 6, "replies": []}, {"body": "Hey guys, if you think this sounds like a good idea I got a bridge to sell ya.", "score": 5, "replies": []}, {"body": "So are all these set ups on the 1-hour chart?", "score": 3, "replies": [{"body": "I was curious about what time chart he is using also I’ll check the link but it seems 1hour for confirmation so is he using the 15min or 1min chart usually then using the 1hr for confirmation?", "score": 1, "replies": [{"body": "Find setup on the weekly. Confirm entry in the 1 hour", "score": 0, "replies": []}]}, {"body": "Setup on the weekly. I confirm in the 1 hour for entry", "score": 0, "replies": []}]}, {"body": "This is literally the opposite of \"people think they're investing geniuses but it's just a bull market\"\n\nbut shorting in a bear market", "score": 3, "replies": [{"body": "You obviously don’t know what you’re talking about. See track record on the website.", "score": -5, "replies": []}]}, {"body": ">Using Runstrat.com as a scanner  \n  \nI think you mean spammer", "score": 2, "replies": [{"body": "Yeah a free scanner I’m such a spammer", "score": -1, "replies": []}]}, {"body": "Go away", "score": 2, "replies": []}, {"body": "now is bull market congrats", "score": 2, "replies": []}, {"body": "Downvoted 😝", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "What u mean it’s very easy", "score": 0, "replies": []}]}, {"body": "This is a fucking Ad lmao why is this still here, look at his recent posts", "score": 2, "replies": []}, {"body": "I always save posts like this and say that I’m going really going to study it, backtest it, and then try it out once I’m fully confident and it’s been vetted…\n\nThen I jerk off and I’m like “fuck this Elon is going to do\nsomething cool soon”", "score": 2, "replies": [{"body": "“Elon is going to do something ~~cool~~ soon”", "score": 0, "replies": []}]}, {"body": "Sounds good but I don't have day trade status so it's pretty much worthless to a lowly regard as myself", "score": 1, "replies": [{"body": "Im doing swings. No need for day trade status", "score": 1, "replies": []}, {"body": "Cash account broski", "score": 0, "replies": []}]}, {"body": "market too volatile atm from macro factors.  i imagine this is most effective in relatively low volatility environments?", "score": 1, "replies": [{"body": "Works in volatile markets too. But yeah, it’s better when it’s less volatile", "score": 0, "replies": []}]}, {"body": "Thanks for this. My goal this weekend was to put effort into the strat...and here we are!", "score": 1, "replies": [{"body": "I love it", "score": 1, "replies": []}]}, {"body": "Can someone explain this in crayons", "score": 1, "replies": [{"body": "Stock go up and down", "score": 1, "replies": []}]}, {"body": "Sir, this is a Wendy's.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah but confirm entry on the 1 hour chart", "score": 1, "replies": []}]}, {"body": "red green bar - subscription business .", "score": 0, "replies": []}, {"body": "So he shorted everything in a bear market? Genius.", "score": 0, "replies": [{"body": "See track record", "score": 1, "replies": []}]}, {"body": ">I think your strategy is interesting and I would like to learn more about it. Can you please provide more details?", "score": -12, "replies": [{"body": "All details are in the post", "score": 7, "replies": [{"body": "Can i just send you 1k and you send me 10k?", "score": 5, "replies": [{"body": "PM Paypal address", "score": 1, "replies": []}]}]}]}, {"body": "Wtf", "score": 1, "replies": []}, {"body": "Cool.", "score": 1, "replies": []}, {"body": "Owning a repo company.", "score": 1, "replies": []}]}
{"title": "Update recession back on", "selftext": "", "id": "yn3hiu", "created_utc": 1667676076.0, "score": 703, "upvote_ratio": 0.97, "num_comments": 96, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|197|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=yn3hiu)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=yn3hiu)", "score": 1, "replies": []}, {"body": "That's only at Circle K locations, hence the special can design.  They did this like a year ago.  Still 99 cents everywhere else.", "score": 139, "replies": [{"body": "Praise the heavens", "score": 59, "replies": []}, {"body": "Just bought some at Maverick. Midwestern gas station was this price.", "score": 8, "replies": [{"body": "Same at the Maverick in Sacramento, CA earlier this week.", "score": 2, "replies": [{"body": "We have a maverick in Sacramento?", "score": 2, "replies": [{"body": "West sac technically. Right after the causeway where the 50/80 split is.", "score": 2, "replies": [{"body": "Well looks like I learn something new everyday. \n\nI've lived here like 20yrs lol", "score": 3, "replies": [{"body": "It’s only been open since like September.", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "I miss WinCo so much. It was the only place I shopped in college.", "score": 1, "replies": []}]}]}]}, {"body": "Sounds like my child support ratio", "score": 2, "replies": []}]}]}]}]}, {"body": "Holidays and other affiliates as well.", "score": 1, "replies": []}]}, {"body": "Arizona tea trading like a penny stock.", "score": 27, "replies": [{"body": "Arizona Tea futures anyone?", "score": 1, "replies": []}]}, {"body": "Congress passed a law saying anyone caught selling these over .99 gets hanged", "score": 27, "replies": [{"body": "Ide vote for that to pass 😂", "score": 2, "replies": []}]}, {"body": "But the price is on the can though", "score": 16, "replies": [{"body": "I noticed a few months ago that it’s gone. Truly a sign of the end times", "score": 26, "replies": []}, {"body": "Came here looking for this comment lmao", "score": 5, "replies": [{"body": "I came here to come lmao", "score": 3, "replies": []}]}, {"body": "Just bought some today. No .99 on the can.", "score": 3, "replies": []}, {"body": "It is (apparently not) on the can tho", "score": 1, "replies": []}]}, {"body": "My local Dollar Trees are now Dollar Twenty-five Trees.", "score": 9, "replies": []}, {"body": ">1.29 is a fair price for an Arnold Palmer watermelon tea, but I would not pay more than that.", "score": 20, "replies": [{"body": "That's what we all said when it was 99¢", "score": 14, "replies": [{"body": "Inflations a bitch", "score": 2, "replies": []}, {"body": "Inflation is 30% ? 😳", "score": 1, "replies": [{"body": "Not far off", "score": 5, "replies": []}, {"body": "The United States printed more than 30% of all dollars ever printed between 2020 and now. So I'd say it adds up.", "score": 3, "replies": []}]}, {"body": "And they came for the 99 cent cans and nobody listened for I was not 99 cents. Now the only one left is 1.29. Who will listen when they come again?", "score": 1, "replies": []}]}]}, {"body": "You could get a monthly amount of cans for, like 8 bucks....blue check flavor???  Best indicator tbh !!!", "score": 3, "replies": []}, {"body": "Walmart fridge aka the recession scoreboard", "score": 3, "replies": []}, {"body": "WTF? I just read they were keeping it at 99 cents.", "score": 6, "replies": [{"body": "Hopefully just store mark up 🙏", "score": 5, "replies": [{"body": "It is. They been doing higher prices in some gas chain for a while now", "score": 6, "replies": []}, {"body": "There was a very detailed theard about this the other day. I know, cuz I was a contributer to that thread. \n\nI'd suggest reading it and finding out more about the Amazon tea company than you ever knew before. \n\nI'll give you a hint. They are paying both sides of the field and print both 99 cent cans and unmarked cans. More and more stores are opting to get the unmarked cans and are now charging between 1.29 and 1.49.", "score": 7, "replies": []}, {"body": "Like they're not gouging us enuff already on gas ⛽", "score": 2, "replies": [{"body": "Most money stations make are inside, the fuel isn’t their main product to sell.", "score": 0, "replies": []}]}]}, {"body": "I think they said that they would have to raise it to 1.25 or w.e b.c of price increases", "score": 2, "replies": [{"body": "r/IHadAStroke", "score": 1, "replies": []}]}, {"body": "it is still 99 cents, this is just a circle k, the 1 store that sells arizona for more than 99 cents. Could be Canada too, Arizonas are 1.29 there as well.", "score": 2, "replies": []}]}, {"body": "How they gonna do us like that", "score": 2, "replies": []}, {"body": "why you trick like that YO! Dis ahole is ahole!", "score": 2, "replies": []}, {"body": "Nice hat!", "score": 2, "replies": [{"body": "Thank you, go Celtics 🍀lol", "score": 2, "replies": []}]}, {"body": "Easy math. 29% inflation. God I’m good at this!", "score": 2, "replies": [{"body": "Woah stop showing off Wrinkle brain 🧠 😂", "score": 2, "replies": []}]}, {"body": "I for one see it as a sign to invest in China.  As you can see, the green tea is more popular than the other flavors.", "score": 2, "replies": [{"body": "Calls on china I like it thank you.", "score": 1, "replies": []}]}, {"body": "Damn, and to think for the last 2 weeks I've been looking for the sale on these. I love the raspberry ones!", "score": 2, "replies": [{"body": "Raspberry is fire, mango also goes great with spicy chips 👌🏼", "score": 2, "replies": [{"body": "These are facts! I saw a jug of watermelon today at the store and was quite tempted😥🤫😮‍💨", "score": 1, "replies": []}]}]}, {"body": "7/11 and smoke shops still based", "score": 2, "replies": []}, {"body": "You can also report the location and Arizona Tea will fine them. They don't have the ability to raise the price", "score": 2, "replies": []}, {"body": "Pretty sure this is only at Circle K.", "score": 1, "replies": []}, {"body": "£3 a can here in the uk", "score": 1, "replies": [{"body": "Eww", "score": 3, "replies": []}]}, {"body": "looks like the [Tea Standard](https://usdtea.io/) is a good investment lmao", "score": 1, "replies": []}, {"body": "They were marked up by the companies that sell them. The founder of them vowed to keep them at .99 as long as he possibly can", "score": 1, "replies": []}, {"body": "Ohhh mannn we’re screwed!!!", "score": 1, "replies": []}, {"body": "$2 ONLY Santitas have gone from $2.29 to $2.49\nAmerica is now officially a failed state, calls on $CORN.", "score": 1, "replies": []}, {"body": "I love how we tell if it’s a recession by strippers and/or arizonas", "score": 1, "replies": []}, {"body": "$1.29 = blasphemy = its over guys", "score": 1, "replies": []}, {"body": "Just waiting for an Arizona Long Island Iced Tea", "score": 1, "replies": []}, {"body": "Honestly I’m not even gonna be mad about that one. These were .99 when I was a kid, if they go up .30 in 25 years that’s fine by me. Everything else has doubled, tripled, and worse.", "score": 1, "replies": []}, {"body": "Inflation 30% confirmed.", "score": 1, "replies": []}, {"body": "sugar is expensive", "score": 1, "replies": []}, {"body": "We had the same issue with convenience stores.  Every year or two we raised the case price by 50 cents (2 cents per bottle) so they raised retail price by a dime.  So of course our sales drop off a bit (which is painful) and they still make the same.  We finally said fuck it and went up $2.50 and they all freaked out about how it was outrageous and greedy we were- and we pointed out they've done that to their customers over 2 cents for years.   \n20oz pop retailed for $1.59 at $28.50 ($1.19+40 cents).  Has risen to $2.29 at $32 ($1.33+96 cents).  But yes, pop companies are the greedy ones.", "score": 1, "replies": []}, {"body": "Bought a dozen Arizona Ice Teas from Safeway yesterday for 69 cents a can.", "score": 1, "replies": [{"body": "Nice boi", "score": 1, "replies": []}]}, {"body": "I'm fucking tired of these major corporations having their foot on the back of the common man's neck! How the fuck Isa man supposed to support his family with these outrageous prices!?", "score": 1, "replies": [{"body": "We buy a 1,000 pack of off brand tea bags and just use each one 10-15 times. My kids say it’s better and the wife says she can’t tell a difference!", "score": 2, "replies": [{"body": "What's her boyfriend think?", "score": 1, "replies": []}]}]}, {"body": "Strange things are afoot", "score": 1, "replies": []}, {"body": "HOW DARE YOU", "score": 1, "replies": []}, {"body": "Ughhh...missed the dip", "score": 1, "replies": []}, {"body": "We in Australia buying those junk at AU$4.99.", "score": 1, "replies": []}, {"body": "Yeah but you can just get two for 3.50", "score": 1, "replies": []}, {"body": "#UNACCEPTABLE", "score": 1, "replies": []}, {"body": "who's selling at $1.19 hit me up", "score": 1, "replies": []}, {"body": "It was a Halloween “sale” now they mark up to recoup the losses it’s a wash", "score": 1, "replies": []}, {"body": "The circle k cans have always been different.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "It ain’t much but it’s honest work 🤷🏻‍♂️😂", "score": 1, "replies": []}]}, {"body": "Did you know that you can report any Arizona tea retailer for selling their sodas for more than a dollar? Arizona will pull their product from the gas stations shelves that try to overcharge for their product. Arizona specifically spends zero dollars on advertising and marketing solely for the purpose of being able to offer one dollar tea’s across the USA.", "score": 1, "replies": []}, {"body": "Strange. I wonder if this is why 7/11 took them off their shelf.", "score": 1, "replies": []}, {"body": "Lmao", "score": 1, "replies": []}, {"body": "Nope still .99 cents. They cost me .63 cents. 8 still make .26 on each can. Tons of room left", "score": 1, "replies": []}, {"body": "Where is this I can get Faygo for $0.79 a bottle and Arizona $1.07 after tax", "score": 1, "replies": [{"body": "Roseville circle k next to the water park", "score": 1, "replies": []}]}, {"body": "MaNiPuLaTiOn", "score": 1, "replies": []}, {"body": "Fuckers", "score": 1, "replies": []}, {"body": "This has been happening for months tho", "score": 1, "replies": [{"body": "Yee off and on that’s why I said it’s back on lol", "score": 1, "replies": []}]}, {"body": "People are so clueless. When winter is over loss porn will have been replaced with suicide posts…", "score": 1, "replies": []}]}
