{"title": "Best Options Hedge for Black Swan Event", "selftext": "Hey Smart Guys so I am selling CSP's and flip flopping selling CC's and back and forth aka WHEELin and dealin. This mkt is conducive to it and things going well. Big question: What are some far OTM puts tied to the overall market that have the price sensitivity that god forbid we crash (or Elon's jet crashes) that one can buy to protect the times I am holding underlying stock on my plays. Puts on TQQQ too simple and won't provide the movement and Greeks I want. I want something that RAGED in March 2020 when all hell broke loose. Ty in advance for your ideas.", "id": "xh2c27", "created_utc": 1663461246.0, "score": 46, "upvote_ratio": 0.83, "num_comments": 57, "comments": [{"body": "Deep OOTM puts on SPX or calls on VIX", "score": 43, "replies": [{"body": "I have a few VIX calls for Jan 2023 for shits and giggles 🤭", "score": 13, "replies": [{"body": "VIX calls are definitely the black swan hedge derivative of choice imo. When they hit they tend to hit reallllllllll big.", "score": 5, "replies": []}, {"body": "Do you like the levered vix calls like UVXY?", "score": 2, "replies": [{"body": "No. Volatility isn’t going to be the win. It’s DP\nFavorite and won’t ever launch again.", "score": 2, "replies": [{"body": "DP Favorite?", "score": 1, "replies": []}]}]}]}, {"body": "I’ve just been straddling spx these days. One leg always makes profit and then the other always recoups some of all of it’s losses. Sometimes, like Tuesday, I just closed out in pre market for 100% profit and jacked off for the rest of the day.", "score": 14, "replies": [{"body": "Damn i salute your endurance", "score": 3, "replies": []}, {"body": "Care to provide the details for how you do this... the trading part that is. I've backtested this and it shows great results. Do you manage profit or loss? Thanks!", "score": 1, "replies": [{"body": "So I buy more theta for what I think the trend will be. If the market just moves my way, often that side of the trade becomes profitable enough to be worth the losses on the other side. Right now I think we may run up a bit before fomc so I may buy a call for the 23rd and a put for the 30th. With hopes of riding the call up, closing it when I am happy with the profit or think the move is nearing an end ( or get stopped out) and hope to make more on the way down. There is an argument right now that the trend is always down. Until we leave the bear market. So I am wrestling with what I’ll open for next week. The reality is that with all the volatility as of late there are often a few opportunities on each end to close for decent profit. \n You can do the opposite and sell a put and a call in low volatility environments, as well. \nHope this helps.", "score": 5, "replies": []}]}]}, {"body": "This guy black swan hedges", "score": 17, "replies": []}, {"body": "Hasn't worked this downturn. Vix still sub 30 even on a -4% day", "score": 3, "replies": []}, {"body": "What exactly does deep out of the money mean?\n\nI’m just learning the techniques to trading but I’m really good on the macro Econ side.  I would say that the HYG & TLT families are set for big moves down.  So are SPY & QQQ.  Last year I took out 6 month puts (singles) on HYG, TLT but they expired in March before the major moves down🤦‍♂️\n\nI, and some Pros that actually caught the move expect another major move down within the next year.  Can someone please help me make it happen this time🙏.  How can I do this better next time?", "score": -2, "replies": []}]}, {"body": "google tail risk options. have fun, entire billion dollar funds are set up to do this strat —it is one of the hardest achievements to do successfully. Gl", "score": 22, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "What do you mean by “volatility in itself is not what it seems and it’s highly manipulated”?", "score": 1, "replies": [{"body": "It means the casino is rigged.", "score": 7, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I have a remedial question \n\nI watch UVXY a lot for some reason.\n\nBefore CPI number this wed, was Daydreaming at my day job about YOLOing and buying 500k worth of UVXY calls Friday expiration.  10strikes at .12 cents on Monday….after CPI wed- Friday they were anywhere from .55-1.15 \n\nBut 500k would’ve been like 30k contracts….when DATV is around ~8k\n\nMy Question is: would the liquidity have been there to effectively trade that strategy?  If you placed that order through your retail broker, would they have been required to offer that size at open and bid at close….and at how much of a discount?  \n\nThx to anyone who could answer", "score": 3, "replies": [{"body": "Options in quantities that big, of the same or similar contracts, tend to be a bit more illiquid and harder to trade like that but it’s doable if you can play it right.", "score": 1, "replies": []}]}]}, {"body": "Yeah.  Looking for an explanation of exactly how he thinks vol gets manipulated.", "score": 0, "replies": [{"body": "dark pools..?", "score": 3, "replies": [{"body": "Questionable practice but what’s that have to do with volatility?", "score": 3, "replies": [{"body": "if orders arent hitting the open market that will change the volume we see.", "score": 1, "replies": []}]}]}, {"body": "central bank currency swaps", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I’ve read both those links lol (been a topic of interest for me for a while). DMs open for anecdotes ;)", "score": 1, "replies": []}, {"body": "I appreciate the links!  Open to anecdotes via DM as well.", "score": 1, "replies": []}]}, {"body": "It means things get volatile when they want them to. Idk if you've noticed that most desktop trading apps have 100 stock as the default quantity for sale/purchase, and they tend to also have ways to skip confirmations \n\nWhy? So that some hedgefund bro can sit infront of a desk and mash the buy or sell button as many times (or for as long) as his boss told him to. Aka, until the price moves the way they wanted it to (or they notice a bigger fish doing the same)", "score": 1, "replies": []}]}, {"body": "I agree the VIX family is manipulated but it’s not impossible to profit off Tail Risk Strategies.  I’m not as advanced as you all in the actual trading but from what I understand all it really means is they are generally Long on the market but they also take out an “insurance policy” on the market in case it crashes.  Spitznagel SEEMS to be doing this by taking really cheap long dated puts on vulnerable sectors.", "score": 1, "replies": []}, {"body": "expand on vix being manipulated, I’ve heard some theories", "score": 1, "replies": []}]}]}, {"body": "Sell 1 short put and buy 2 or 3 long put 30/60 days out this is a good hedge with limited loss if event doesn’t occur.", "score": 6, "replies": []}, {"body": "Cash position to buy the bottom. Alternatively, really wide OTM butterfly put spreads rolling each month.", "score": 6, "replies": []}, {"body": "just buy long dated tqqq puts.  check out instal activity.  lots of puts 10/21 on tqqq we’re bought", "score": 3, "replies": [{"body": "In your opinion, What qualifies as long dated?", "score": 1, "replies": [{"body": "check out r/burrylogy   there are permabears there", "score": 2, "replies": [{"body": "I’ve been there for a while, I have the ideas of what to do but none of the knowledge of the best strategies.  I’ve only bought Puts (singles) on the ETFs I’m watching TLT and HYG families.  \nI’m not sure I’d know how to close them when they get to the moon.", "score": 1, "replies": []}]}, {"body": "Generally it's 9 months+ DTE", "score": 1, "replies": []}]}]}, {"body": "GME calls. Balls deep", "score": 3, "replies": []}, {"body": "\"What are some far **OTM puts tied to the overall market** that have the price sensitivity that god forbid we crash (or Elon's jet crashes) that one can buy **to protect the times I am holding underlying stock on my plays**.\"\n\nFirst, you are OK holding your individual picks but you are bearish or skittish on the overall market. You are a stock picker, like Buffett, because you think your picks are better than the market. OK, fine.\n\n1. Calculate the beta of each stock, and your weighted portfolio beta to whatever index you think is appropriate. SPY, QQQ, IWM.\n2. Calculate your total portfolio deltas\n3. Use beta and delta to hedge, underhedge or overhedge your portfolio\n4. You seem to be interested in \"I want something that RAGED in March 2020 when all hell broke loose\" which is not a hedge per se, but you are looking to make significant gains on this instrument that you are initially buying as a hedge.\n\nIf you decide to achieve your objective in #4, and you have a short bias, then can simply start and keep buying puts on SPY/QQQ/IWM. Nothing will \"rage\" more than long puts. Pick your DTE based on your market timing expectations. \n\nIf you want to really hedge your portfolio, then take steps 1-3.\n\nGood luck.", "score": 5, "replies": [{"body": "Wow thanks!", "score": 1, "replies": []}]}, {"body": "I'd go 3x bear leveraged calls. SQQQ SPXU, long dated.", "score": 5, "replies": [{"body": "Decay on top of decay and lack of liquidity. Spy spx will be somewhat liquid in the event of liquidity crisis", "score": 17, "replies": [{"body": "Valid points, but IMO liquidity won't matter in a black swan. If you price it below MM they'll buy it back for arbitrage alone. Volatility decay is a real issue though for these 3x leveraged funds.", "score": 2, "replies": [{"body": "Yea I’d have more faith in the spx /es desk though lol mr sqqq and spxu is liable to clock out that day", "score": 3, "replies": []}]}]}, {"body": "that’s not true.  i’ve been making $ on sqqq since Nov last year", "score": 1, "replies": [{"body": "maybe so, but maybe go back and look at doing NDX or XND in equal margin and i'm betting you would have made more for unit of risk there.", "score": 1, "replies": []}]}]}, {"body": "Delta hedging by buying leap puts 150 days out. Under $40 stock.  Buying 2 Leap puts 20 percent otm will hedge your short put.  As your short put lose the long puts gain. If it keeps falling the long puts will profit more than the short loses.  There is upside risk if the stock rallies you ll lose on the puts you bought.  I guess you can buy a cheap call to protect the long puts. You’ll have drag compared to selling naked puts but your downside is protected.  If you sell puts on equities and buy index puts it doesn’t always work.  Your stock can drop without the indexes dropping.", "score": 2, "replies": []}, {"body": "Cash to buy more at the bottom lol", "score": 2, "replies": []}, {"body": "The volatility is manufactured... By the MMs who facilitate the trades and sell the options.\n\nI know a gambler who loves betting on the NBA.  If you're near someone like that and listen to them describe some games, you'll see that it's rigged and you're not placing a bet on a basketball game, but rather on whether or not you can pick the outcome that the Big Money has already bet on.\n\nSo it is worth Wall Street.  Do your DD, but understand that you're not in a free and open market.", "score": 7, "replies": [{"body": "Do your DD but make sure it includes the Techniques of Neutralisation with particular attention to 'appeal to higher loyalties'.", "score": 2, "replies": []}, {"body": "MMs are in a competitive market, they don’t set prices in unison or at whatever value they want. The option values are determined mathematically, so everyone’s value is around the same depending on their pricing model. EVERYONE will increase premiums when realized volatility is higher, and it has nothing to do with any type of conspiracy or “unfair” market. It’s common sense; if realized volatility has been high lately, then the assumption is that volatility will remain high at least in the near future, so implied vol is higher. If you disagree with where people are marking options then you have a huge opportunity to short volatility (risks are obvious)", "score": 4, "replies": []}]}, {"body": "Puts on spxl?", "score": 0, "replies": []}, {"body": "r/burryology", "score": 1, "replies": []}, {"body": "Hut8, NAVB, BLUE, SIX, PI, U 🤙\n\nEdit: & SARK 😇", "score": 1, "replies": []}, {"body": "when is it too late to roll an option?", "score": 1, "replies": []}, {"body": "My favorite play in down trending markets is shorting stocks and selling puts. Much like the covered call, just in the opposite direction. \n\nIt’s certainly not the home run type of trade, but it’s a great way to sell the rips and buy back the dips on the way down. Small ball play", "score": 1, "replies": []}, {"body": "Short SPY or QQQ", "score": 1, "replies": []}, {"body": "SPY could go to 300-320 worst case right now", "score": 1, "replies": []}, {"body": "Spread out IWM puts, SQQQ and UVXY calls. The Russell 2k will be harder hit than the S and P during a crash, same w Q", "score": 1, "replies": []}]}
{"title": "Wall Street is torn on whether the stock market is about to crash or soar 20% ahead of next week's Fed meeting. Here's where 6 experts stand. Where do you think?", "selftext": "# The Bears\n\n**1. Ray Dalio: Expect a 20% sell-off in the stock market if rates keep rising.**\n\n\"With inflation well above what people and central banks want and the unemployment rate low, it's obvious that inflation is the targeted problem, so it's obvious that the central banks should tighten monetary policy. Everything will flow from that,\" Dalio said on Wednesday.\n\n\"I estimate that a rise in rates from where they are to about 4.5% will produce about a 20% negative impact on equity prices,\" Dalio said.\n\n**2. Scott Minerd (Guggenheim CIO): A 20% decline in the S&P 500 could happen by mid-October.**\n\n\"It's really stark to see the price-to-earnings ratio where it is... given where seasonals are, and how far out of line we are historically with where the p/e is, we should see a really sharp adjustment in prices very fast,\" Minerd said last week.\n\n\"It appears people are ignoring the macro backdrop, monetary policy backdrop, which would basically indicate that the bear market is intact. We may very well already be in a recession... with YoY core PCE now at 4.6% and S&P 500 trading at \\~19x, we should see stocks fall another 20% by mid-October,\" Minerd said.\n\n**3. Jeff Gundlach (DoubleLine Capital founder): The credit market suggests both the economy and stock market are in trouble.** \n\n\"The action of the credit market is consistent with economic weakness and stock market trouble. I think you have to start becoming more bearish,\" Gundlach said on Tuesday, adding that he agrees with Scott Minerd's call that stocks can fall 20% soon.\n\n\"You always want to own stocks, but I'm a little on the lighter side...buy long-term Treasurys, because the deflation risk — in spite of the fact that the narrative today is exactly the opposite — the deflation risk is much higher today that it's been for the past two years,\" Gundlach said. Gundlach believes the Fed should hike interest rates by just 25 basis points next week.\n\n# The Bulls\n\n**1. Tom Lee (Fundstrat founder): Inflation has already peaked and that means you should buy stocks.**\n\n\"Even for those in the 'inflationista' camp or even the 'we are in a long-term bear' camp, the fact is, if headline CPI has peaked, the June 2022 equity lows should be durable,\" Lee said on Friday.\n\nAugust's higher-than-expected CPI report \"does not mean stocks have to break below the June lows,\" Lee said, as he reiterated his view that S&P 500 will rally more than 20% to new highs by year-end.\n\n**2. Jeremy Siegel (UPenn Wharton professor): Inflation is falling and whoever wanted to get out of stocks already has.**\n\n\"It seems like everyone that wants to be out of the market is out, and everyone that wants to be tactical is short. Therefore the surprises are going to be to the upside... when everyone has sold, only the buyers are left, and the shorts are exposed,\" Siegel said on Monday.\n\nSiegel said if the Fed says rates will be higher for longer, \"That would be a policy mistake. I think they're going to look at the economy, and I hope they understand what the statistics are and what on the ground inflation is.\" \n\n**3. Marko Kolanovic (JP Morgan Chief Global Strategist): The stock market will rally as inflation resolves itself.** \n\n\"Given the lag it takes for rate hikes to work through the system, and with just one month before very important US elections, we believe it would be a mistake for the Fed to increase risk of a hawkish policy error and endanger market stability,\" Kolanovic said on Monday.\n\n\"Our expectation that the global economy will stay out of recession, increasing fiscal stimulus, and still very low investor positioning and sentiment should thus continue to provide tailwinds for risky assets, despite the more hawkish central bank rhetoric recently,\" Kolanovic said.", "id": "xhcyfh", "created_utc": 1663496193.0, "score": 44, "upvote_ratio": 0.79, "num_comments": 51, "comments": [{"body": "It’s almost like CEOs and analyst go on TV and pump their positions.", "score": 25, "replies": [{"body": "Precisely. These guys don't risk their reps and pass comment on the state of the economy for their good health. They are self interested, like the rest of us, and throw their weight behind the bear/bull tailwinds", "score": 9, "replies": []}]}, {"body": "People speculating a Fed, s 100 bps increase next week... Not so bullish short term imho", "score": 17, "replies": [{"body": "Hownis this not bullish? This is the best case scenario if it’s raised by 100bps", "score": 5, "replies": [{"body": "Just curious, why do you think that is a good thing?", "score": 4, "replies": [{"body": "It’s showing the Fed is actually serious about dealing with inflation and is going with a just rip the band aid off approach.", "score": 9, "replies": [{"body": "I understand that, but this is generally considered bearish. I am curious why you think it is bullish.", "score": 7, "replies": [{"body": "Because the worst case scenario is that rates continue to rise slowly but not enough to curb inflation. Although a huge rate hike in the face of falling inflation may be just as bad. The reality it seems, from professional analysts to the fed to me and you, is that no one has a damn clue.", "score": 5, "replies": [{"body": "Only thing I know for sure is that I don't have a clue :D\n\nHowever, I would expect a 1 pt increase to drive stocks lower not higher", "score": 3, "replies": []}]}]}, {"body": "Well the market hates uncertainty so if they raise by a 100 bps in the short term I believe it would be bearish", "score": 5, "replies": []}, {"body": "In general, higher rates suck money out of the stock market, sometimes for years and sometimes a decade. If rates get high enough that a substantial amount of money leave stocks and lock up in bonds for the medium to long term, that's money that won't come back again for quite some time. \n\nAs a complete exaggeration, if rates were 10% and you could make 10% relatively safely, tons of money would flee the stock market and lock up for years. A huge amount of that money might even buy much longer duration bonds, especially if they felt rates were at a top. Owning long term 10% bonds when rates can't any higher is a gold mine. So much money would flee stocks. And if rates did start coming down from such a high, more money would flee to lock up at 9% or 8% before shit heads back down to 4 or 3%. \n\nNow obviously we aren't at 10% rates and likely won't be at all. But the point is the same. The same calculus hits as rates rise to 4% or 5%. At each new level, more money decides this new higher level is sufficient for me to generate the income I need over the next x years. And when that money flees, it flees for a whole... Not a month or two, but years. It means the buying pressure won't come back so quick.", "score": 2, "replies": []}]}]}, {"body": "Lol", "score": 1, "replies": []}]}, {"body": "People aren’t speculating a 100bps hike.  82% comes in at a .75bps , so if we see 100 it will undoubtedly make the market bleed further. However if it is .75 I highly doubt the market will rally either ..", "score": 3, "replies": []}]}, {"body": "Tom Lee? The same guy who last year said Bitcoin was going to go to $100K by year end?", "score": 7, "replies": [{"body": "Tom “ Big Dong” Lee, damn right brother.", "score": 7, "replies": []}]}, {"body": "I think we need 27 more experts.", "score": 6, "replies": []}, {"body": "One of these guys says stuff not like the others.  Perhaps what Taleb says about academic “professors” and investing  is true? http://www.rovel.bg/rhouse/Intellectual_yet_idiot.htm\n\n>\tIt seems like everyone that wants to be out of the market is out, \n\nAssuming the statement above means something: How can one judge that “everyone that wants to be out of the market is out “? For every share sold there is a share purchased. Can one know whether the number people owning these shares has increased / decreased? What about indirect ownership via ETFs and funds?\n\n>\tIt seems like everyone that wants to be out of the market is out, \n\nYet does this mean anything at all? Might it be a tautology? For example how is this different from saying “Everyone that wants to be in the market is in”, or “Everyone who wants to ignore the market is ignoring it” ? Do these statement carry any meaning? Assuming investors are able to act freely and are not being held hostage why would they not be all of these things all at the same time?", "score": 7, "replies": [{"body": "I disagree strongly with the \"everyone who wants to me out is out\" quote because changing conditions change who wants to be in or out. As rates go up, more big money may decide to lock up in bonds for a guaranteed 5%. And again at 5.5%. at each higher level, new decisions are made. \n\nMaybe everyone who wants to be out at the current rate is out. But if rates look set to go much higher, more people will want to be out and will want to lock in a long term interest rate on their money", "score": 2, "replies": []}, {"body": "Cz12- respectfully, marketGOATS post was a summary of six Bear / Bull opinions.  Rather than pose more questions, the OP asked where do WE think the market is heading.  Asking more questions is a pointless exercise. Serious investors already understand there are NO answers, only  possible outcomes, and are trying to reduce investment risk by listening to other opinions. I suggest you reread the post and answer the question with YOUR opinion. Good luck!", "score": 3, "replies": [{"body": "he never read the post 🤷🏼‍♂️", "score": 2, "replies": [{"body": "New reditor- I agree. The OP asked a very direct question and posted strong financial industry opinions and asked for others to comment.  Constantly asking questions without under the topic is a rookie error. As Judge Judy often says, “God gave you two ears and one mouth for a reason!\"", "score": 1, "replies": [{"body": ">\tasking questions without under the topic is a rookie error\n\nSee reply here: https://reddit.com/r/StockMarket/comments/xhcyfh/_/iozrqvx/?context=1", "score": 1, "replies": []}]}, {"body": "See reply here: https://reddit.com/r/StockMarket/comments/xhcyfh/_/iozrqvx/?context=1", "score": 1, "replies": []}]}, {"body": ">\tAsking more questions is a pointless exercise. \n\nIs it? When someone shares their opinion or information with you which is better: blindly accept it? question it? Goal of my questions was note that one of the expert opinions presented was different from the others. I myself may not have better or more accurate opinion but do know enough even from a distance that one of the “experts” is not like the others.\n\n>\tOP asked where do WE think the market is heading.  \n\nDo you expect to get market enlightenment from random reddit accounts?  Do you expect better guesses about market direction than people like Ray Dalio and the other experts? Perhaps you are instead likely to get more “noise” that confuses the picture? Perhaps the smart thing to do is to instead sniff test what the experts think try to reject anything appears to be nonsense thus somewhat clarifying the picture by removing “noise”?\n\n>\t I suggest you reread the post and answer the question with YOUR opinion. Good luck!\n\nWhen someone asks you a question which is better: just try to answer it? perhaps better to think about the context and assumptions in their question and try to address those? For me to answer with my view about direction of the market would mean that I assume that my opinion of market direction adds value in some way - I do not assume this. Moreover for me to answer the question about market direction would indicate that I accept the implicit assumption that market direction opinions of random reddit accounts are somehow valuable - I do accept this assumption either. Thus the best I could do was give the opinions of “experts” that were shared a sniff test.  One of them was found lacking and I shared my thoughts why I found it lacking.\n\nTo just answer questions you are asked is often sign of someone narrow minded. Perhaps a sign of membership what Taleb terms the \"Intellectual-Yet-Idiot\" class whose “main skills is capacity to pass exams written by people like them“.", "score": 2, "replies": [{"body": "Cz12- respectfully, you missed the point entirely and are clearly not in the same realm as others. Your deep philosophical questions don’t seem to match the OP’s simple topic.  You are vastly overthinking a relatively simple question and concept. However, thank you for providing an alternative ‘question everything, answer nothing’ viewpoint for 2 graduate level finance classes to discuss.  They are already responding and the comments are honestly not flattering.  The consensus seems to be you are a disgruntled student or educator, or a failed investor with a lot of time on your hands.  Your posts certainly made them laugh and triggered immediate disbelief so thanks again! Good luck.", "score": 1, "replies": [{"body": "\n>\tThe consensus seems to be you are a disgruntled student or educator, or a failed investor with a lot of time on your hands.  \n\n>\tThey are already responding and the comments are honestly not flattering. \n\nDoes your opinion of yourself depend on what others think of you? If not then why do you think I would care about this?  Also are you attacking my character, motive, or some other attributes about me rather than addressing the substance of what I said? Who tends to behave like this?  If you believe what I said is lacking do not act like a child and instead be specific and supply your reasoning. You sound intelligent so I know you can do this.\n\nWould a failed investor have time on their hands? Perhaps those that fail at investing lack time because instead of earning from investments they are forced to sell their time relying on hourly wages?  As for Reddit “consensus”: is it known for its accuracy? I expect you will be “surprised” how consensus from Reddit will help you with your “investing”.  \n\nBest luck! (I suspect you will need it).\n\n\n----\n\nEdit: Based on the message above RRSignalguy applied Reddit’s user block feature to censor replies from me.  You can read about this block feature here: https://www.reddit.com/r/TrueUnpopularOpinion/comments/vtfx88/reddits_newish_block_feature_is_censorship/\n\n“Tactical censorship as a debate tactic is pretty low”\n\n“One of the scummiest things about this feature is that people have started using it mid-argument to make it look like the other person has no counter-argument.”\n\n----\n\nHere is my reply to their message below\n\n>\tCz12- you are locked in a circle of constant questions and your own fake and delusional philosophy.  Get some professional help.  No need to respond as many people advised they blocked you. I just did too.\n\nYou can make wild eyed vague accusations of a “fake and delusional philosophy\". You can pick out something specific and question it.  What would a normal person do? Which did you do?\n\nLook up \"Socratic method\". I ask questions to get you and others who read our dialogue to think. I try to make the questions easy yet if you can not answer them you need not answer them.\n\nHad a peek at your post history and see you like to drop in random: \"many people advised\" / \"my paid investing club\" / \"my graduate class\" references as if you are spokesperson for some crowd. Should we respect you because you claim some crowd of supporters is with you? Do crowds have a reputation for being wise?  Does dropping in these references to a crowd of supporters make you feel important? Is your ego fragile or in jeopardy? Why do you do it then?", "score": 1, "replies": [{"body": "Cz12- you are locked in a circle of constant questions and your own fake and delusional philosophy.  Get some professional help.  No need to respond as many people advised they blocked you. I just did too.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "MarketGOATS-  I sent you a Gold Award for your well written and very relevant post summarizing six market expert opinions.\n\nI am a long time high dividend investor and member of several paid dividend investor groups. We had all been preparing for the market dip by holding cash but are buying the dips.  I think the bottom is coming in early 4Q, then spotty recovery as Covid subsides and the mid-term US election foolishness passes. When the Russian aggression ends, that will also add to the market recovery. \n\nI choose among the 25 or so stocks in my portfolio and add shares.  Steady as she goes, long term view, patience, and I never try to time the market dips and peaks. There will either be further market erosion or it’s near the bottom. Either way, stay on the horse, continue layering in at the various dips, and ride this out. History repeats itself and the storm clouds will eventually disperse. Thanks again for your balanced post and discussion.", "score": 8, "replies": [{"body": "You think China's bubble will finally pop?", "score": 1, "replies": [{"body": "Ogre- I think the current Russian madness will end when someone finally removes the head crazy and the next generation takes over. The Chinese will one day rise up and take their country back from dictatorship.  The US mess will also change when the young finally take the reins. In each case, there will be change, however, it might not be positive change. Absolute power corrupts absolutely. The markets react to political change.", "score": 0, "replies": []}]}]}, {"body": "Nobody knows. God knows!", "score": 3, "replies": []}, {"body": "Apply this headline to any week/day", "score": 2, "replies": []}, {"body": "Or it can go sideways and choppy for a while until we have a clear road ahead. Anyone calling for another 20% drop or 20% rise in the short term is just guessing.", "score": 2, "replies": [{"body": "Ya I was gonna say it could do both or just go sideways haha", "score": 2, "replies": []}, {"body": "The calls for 20% drops are likely based on math models about how much money would flee stocks to lock in long term rates at various new rate levels or where stocks would need to be for their PE ratios to match the inverse of yield at a comparable risk level.", "score": 2, "replies": []}]}, {"body": "They aren't looking for a revival of the worst day on Wall Street, they want to *beat it*.\n\n#HistoryInTheMaking", "score": 2, "replies": []}, {"body": "My personal opinion is you can’t predict longterm events you can only play the short term. This is exactly why they created options to hedge long and short positions. We are oversold on the short term so a relief rally after the FED makes sense along with the fact the majority of traders are Bearish. That being says the best way to hedge in these kind of events is a Collar on your longterm positions. Market goes up I make money Market goes down I make money. This makes all the “ talking heads “ irrelevant", "score": 2, "replies": []}, {"body": "we going down baby.  strap it on.", "score": 2, "replies": []}, {"body": "Much more decline than 20% IMHO.  Much!", "score": 2, "replies": []}, {"body": "I’ll just follow pelosi’s trades better.", "score": 2, "replies": []}, {"body": "There's no way in hell the Fed isn't raising next week. Raising = downsies. Soft landing narrative is dead", "score": 2, "replies": []}, {"body": "I don’t see spx500 finishing above 4k by the end of the year. There are more hikes coming, energy crisis in Europe, war which is causing supply chain strains, Chinese housing market collapsing, and cpi higher than expected. I mean, it should go down, right? Right? I’ve got no idea actually, but i’m buying sqqq in the short term.", "score": 1, "replies": []}, {"body": "I’m in the Michael Hartnett camp: bottom in October, pivot late Q1.", "score": 0, "replies": []}, {"body": "Siegel makes the most sense to me. I doubt it's going to play out exactly like that but his argument seems the most sound looking at both sides and outside of personal interests", "score": 1, "replies": []}, {"body": "Oh it's gunna crash hard. But that just means money made on puts and growth opportunities so I'm ok with it.\n\nPassive investors and those about to retire must be sweating though.", "score": 1, "replies": [{"body": "I bet quite a few near-to-retirement folks are hanging on for dear life. I wonder if that could help mitigate the low unemployment that the Fed is sadistically wants to “resolve”.", "score": 1, "replies": [{"body": "No they're going to react out of emotion and the fed is going to assume a logical consumer.\n\nIf anything hanger-ons will get in the way.\n\nTry to convince them to pull out before it's too late if you can", "score": 1, "replies": []}]}]}, {"body": "HKD 🚀🚀", "score": 1, "replies": []}, {"body": "What’s moving the market? Right now it’s inflation. We’ve been down trending since Powell spoke. Inflation reported higher than expected YoY and was 3x higher than expected MoM, we’re now going to price in a 1% interest rate hike which is highly likely at this point, provided the Feds still want to front load inflation, which they do. This means that we’re going to have a recession, people will lose jobs, people will lose houses, it’s an unfortunate consequence. The more insane thing is that it’s going to be on a global level due to every country having done the same thing, print money to avoid a Depression, which still isn’t out of the question, provided the Feds want that 2% goal…..  BigBoyBets_bbb on TikTok, i make calls on the market, made $5k last week, had a 45% profit day on my account in a single day. Only been doing this for 14 weeks, have put huhdreds of hours into studying and also learning some economics and what influences the market. I made my predictions days before the moves, could be worth checking out :) Good luck traders, this is your “once in a lifetime” moment.\n\nFU Sleepy Joe, we’re in a Recession, it’s just a matter of time before you guys can’t lie about it anymore", "score": 1, "replies": []}, {"body": "buy bitcoin or not yet, i have no idea, huh?", "score": 1, "replies": []}]}
{"title": "How Europe Burns Wood to Remain Carbon Neutral! Wait... What?", "selftext": "&#x200B;\n\nhttps://preview.redd.it/2il0j6oiclo91.jpg?width=1280&format=pjpg&auto=webp&s=998e027f2f5eb1f79a774634d18a730a46a5e1bb\n\n&#x200B;\n\n**Note - this a Twitter thread that I have compiled here as one long note. The original tweet is** [**here**](https://twitter.com/DoombergT/status/1571063488860286977?s=20&t=YbYCMu0OZIloBGe9G4v1aw) .\n\nIn the second half of the 16th century, Britain plunged into an energy crisis. At the time, the primary source of energy driving the British economy was heat derived from the burning of wood, and Britain was literally running out of trees. As the supply of wood dried up, its price began to soar and inflation set in, compounding the problem and spreading it to all corners of the economy. With imports from continental Europe insufficient to close the growing supply gap, the resulting crisis was dire. \n\nAnd then they discovered coal. Well, they didn’t exactly “discover” coal – it had been known for centuries that coal could be a useful fuel – but they did learn that coal could replace wood in many important applications. They also recognized that they had a lot of it. **With a higher energy density than wood, coal is a superior fuel that enabled meaningful improvements in the British economy. Trees could be preserved for construction purposes, homes could be more efficiently heated, and companies could leapfrog their competitors**.\n\nIt is now well understood that the wide adoption of primary fuels with high energy density enables a better standard of living. Transitioning to higher density fuels is something that usually occurs spontaneously in an economy unless politicians interfere. It took little encouragement from the British government for its economy to realize the benefits of coal over wood – the inherent advantages of the material and the phenomenon of creative destruction were sufficient.\n\nIn another example, the history of propulsion technology at sea is marked by a completely sensible journey up the energy density ladder. **Wind power gave way to coal, which was displaced by diesel, which ultimately gave way to nuclear technology in military vessels. Given this, it might surprise our followers to learn that the European Union and Britain are incentivizing a return to the primitive concept of burning wood for energy on a massive scale**.\n\nNot only are they going back to the future, but they also claim doing so is carbon neutral (spoiler alert: it isn’t, not even close). **Nearly 40% of Europe’s so-called renewable energy is currently obtained by combusting wood, much of it coming from forests in the US**. In a farce so perverted and obscene that it can only be the work of bloated and arrogant bureaucracies, **a carbon accounting loophole is causing huge amounts of CO2 to be pumped into the atmosphere today that will take decades to abate using natural means**.\n\nAll across the US Southeast, massive industrial feller bunchers are cutting down and stacking mature trees with ruthless efficiency. **The resulting logs are loaded onto trailers and hauled by diesel-powered trucks to wood pellet factories. Once there, the logs are milled, dried, and pressed through specialty extruders at high pressure, all of which require significant primary energy and raise local pollution issues. The resulting pellets are transported to coastal ports where they are loaded onto cargo ships. The diesel-powered cargo ships make their way across the ocean, emitting CO2 along each of their several thousands of miles traveled. Once in Europe, the pellets are burned, emitting more CO2 per unit of heat generated than any other fuel source currently used at scale**.\n\nWe are meant to believe THIS process is somehow carbon neutral. **The loophole that enables this orgy of deforestation boils down to how and where emissions are counted. In the current framework, burning wood is zero-carbon at the point of combustion. From the perspective of Britain and the EU, the wood pellets they burn were immaculately conceived – the manner in which the pellets arrived at their power plants is not relevant to their carbon emission calculations**.\n\nBy burning “carbon neutral” wood pellets and decreasing their use of coal, **European environmentalists get to brag to the rest of us about what wonderful stewards of this shared planet they are, all while being among its worst offenders. Further, the fact that mature trees sequester huge amounts of CO2 compared to newly planted saplings is ignored**, making the premature death of that generation irrelevant to the political calculations of environmental impact.\n\nThe time value of carbon emissions does not matter to the European environmental elite, despite their repeated hand wringing about how urgent the carbon crisis is, what little time we have to reduce emissions, and the devastating consequences of not acting immediately. **Studies show that the burning of mature US trees absolutely overwhelms the carbon impact of all electric vehicles ever sold in the UK**. All the economic sacrifices made in the name of minimizing our impact on the climate are turned into a mockery by this one insanity.\n\nTo the credit of some 800 scientists from virtually all disciplines, serious efforts to reverse course have been made. In 2018, a letter was penned that accurately pointed out the environmental bankruptcy of the current biomass accounting policy. They were ignored. Back in the US, publicly traded companies like Enviva are rushing to meet Europe’s virtually insatiable demand for “carbon neutral” wood. There’s lots of happy talk about responsible forest management, good corporate citizenship, low-impact supply chains, and so on. **Enviva recently announced it is expanding into Germany. On its last earnings call, the company’s CEO proudly announced the signing of the first in a series of agreements with a German utility operator.**\n\n**Germany – a country proactively shutting down nuclear power plants despite suffering a massive energy crisis – is back to burning wood for power on an enormous scale. For the planet, of course. You could not make it up if you tried. A single pellet of uranium fuel no bigger than your fingertip provides as much energy as a ton of coal (and certainly even more wood)**. How many trees will be clearcut before this boondoggle of absurdity is stopped?", "id": "xhcr86", "created_utc": 1663495472.0, "score": 44, "upvote_ratio": 0.77, "num_comments": 55, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|32|**First Seen In WSB**|1 year ago\n**Total Comments**|48|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xhcr86)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xhcr86)", "score": 1, "replies": []}, {"body": "CO2 is plant food!", "score": 12, "replies": [{"body": "Shutup, everyone knows gatorade has what plants crave.", "score": 7, "replies": []}]}, {"body": "Can confirm Europe's climate measure are working, I can't afford to heat my home or take a shower anymore. But because of my suffering our leaders can keep flying private jets and live in their mansions, so it's worth it....", "score": 10, "replies": []}, {"body": "Calling burning biomass green is BS.\n\nEurope is regarded", "score": 12, "replies": [{"body": "Greener than oil.", "score": 0, "replies": []}]}, {"body": "It's really not that complex. Trees are cut down to produce wood. We like wood to be in standard shapes and sizes for construction. Wood pellets are made from the rounded outer edges of tree unusable for square planks, as well as sawdust and other scraps. \n\nThese scraps would have been produced by the logging industry regardless of whether they're used for pellets. If you just dump the scraps in a pile somewhere, they'll eventually decay and release the same amount of carbon vs burning.", "score": 12, "replies": [{"body": "The use pulp trees by the thousands including sweet gum, magnolia, and tallow trees. All of which are no good for structural lumber. It’s not just cut offs, they wipe out big stands of forest. There is a pellet production facility north of where I live. We see it all the time", "score": 4, "replies": []}, {"body": "But the point is that’s not the only source.\n\nThere are trees specifically cut to be used as energy source", "score": 3, "replies": [{"body": "Yes and no! Look at a tree. \nDifferent species are in different shapes. I mean there are trees with lots of branches. There are trees what do not grow straight (you need straight for sawmills). So In Europe in wet areas, water oversaturated soils Alder is growing, you can not grow pine or spruce there. So yes you grow those species what grow better in specific soil. \nFrom Alder you can cut first 3m to sawmill and you are stuck with 90% ot the tree mass what is not suitable for furniture or building. What do you do?\n\nThe only answer is...you make energy from it. As long we do not have a alternative for that 90% mass,  we make energy from it. No one is burning wood what suits to paper or building. Ok, lets try this, 160€ is one m3 of sawmill wood (nice, straight), 120€ is paperwood (not straight but whole inside the log), 80€ is firewood/energy wood(not suitable for mills or packaging). What you do? Let the 80€ in the forest to decade (emit carbon)? No, you make the best to humanity, you make energy of it and you save from fossils.\n\nThe lobby of fossilists and they payed \"nature lovers\" is hard to underestimate!\n\nPS:Alder does not suit for paperwood because its fiber structure and other chemical fiscal characteristics do not alow it.", "score": 11, "replies": []}, {"body": "The cartoon lumberjack on my bag of wood pellets (in America) says [they don't do that](https://i.postimg.cc/WzZKTPj1/IMG-20220918-104539.jpg).", "score": 2, "replies": [{"body": "Okay\n\nAgree with you that all of them are sourced this way.\n\nBut then who delivers them to you? Santa Claus? Because only he can have zero carbon emissions whilst making deliveries.\n\n\n\nAnd if you go on to make the point that all kinds of fuels requires some delivery that emits carbon, then understand the point that was trying to be made, about energy efficiency.\n\nIf that same fuel that was used for delivery of coal or gas or nuclear fuel, as compared to wood, the output you get from coal or gas or nuclear is way more as compared to wood", "score": 2, "replies": []}]}]}, {"body": "“Eventually” is doing a lot of work in that last sentence, chief", "score": 0, "replies": []}]}, {"body": "> Nearly 40% of Europe’s so-called renewable energy is currently obtained by combusting wood, much of it coming from forests in the US. \n\nThis is not remotely true, biomass barely makes up 4% let alone 40% of Europe's renewable energy\n\nhttps://ourworldindata.org/grapher/modern-renewable-energy-consumption?country=~Europe\n\n\nY'all believe anything on twitter written in essay format  😂  😂  😂", "score": 20, "replies": [{"body": "Y’all believe anything you see on the internet.\n\n&#x200B;\n\n[https://energy.ec.europa.eu/topics/renewable-energy/bioenergy/biomass\\_en](https://energy.ec.europa.eu/topics/renewable-energy/bioenergy/biomass_en)\n\n&#x200B;\n\n”Biomass for energy (bioenergy) continues to be the main source of renewable energy in the EU, with a share of almost 60%.”\n\nsource: the European Commission", "score": 10, "replies": []}]}, {"body": "Ya, fired up my wood burning stove last night for the first time since May.  No shortage of trees in my neck of the woods.", "score": 7, "replies": []}, {"body": "This carbon stuff is just bullshit they cameup with to tell you what you cant do or have. Basically to lower your living standard and deprive you of basic luxuries such as heat.    The ones pumping this bs don't even believe it thats why they roll in private jets and suvs n yatchs.     They say they will buy some token to offset it but with what? Money?  The money they print for themselves?  They can basically excuse themselves from the rules they propose with the money they print for themselves and their buddies.  Its a club and you n i aint in it.", "score": 14, "replies": []}, {"body": "Maybe I will repeat a few points mentioned already by a few regards. \nThe pellets are made for household use. Maybe for some small commercial or industrial. The ships are moving anyway with empty containers going back to the European ports. In the south east the pine is cut mostly after 15 years. I own a patch of 14 acres is almost time to cut them because after a while they stop growing as a canopy and only a few can survive for the long run. Yes cutting them to the ground and let them  become organic matter is better but the new planted one will use more CO2 for their growth.", "score": 2, "replies": [{"body": "The logic is amazing. That’s how World trade works.\n\n\nAnd that’s the point the World tries to make with Europe and the US.\n\n\nIf Europe and the US want to use fuels that are cost effective to them, and it makes sense to them because - \n\n1. It’s their naturally occurring fuel source\n2. It makes sense to trade with a willing partner that can offer something better in return\n\n\nThen why are they preaching to the World against using fuel sources that are cost effective to them OR naturally occurring to them and they want to trade that with a willing partner for something of higher economic value?", "score": 1, "replies": [{"body": "We are so low in to the food chain that we can only talk about it. Are we going to stop it probably not. On individual level I’m doing everything possible. I’m a beekeeper that patch of land is my home Appiary. There is much more evil done by practices that seem harmless and we do them every day. More R&D needed to move to a new energy source. Trade can not be stoped and is been around since be became regarded APEs. Greed iS a different story. John Nash economical theory is hard to apply.", "score": 0, "replies": [{"body": "It’s awesome that you are doing your best at an individual level.\n\n\nBut the whole post was pointing out the unfair attitude of the EU", "score": 3, "replies": []}]}]}]}, {"body": "Doomberg sucks, falls for literally every fake news story and blindly repeats it and is generally pretty uninformed on the topics he addresses.", "score": 2, "replies": []}, {"body": "Yes we are carbon neutral !\nWe grow trees/forests and burn some mass of them but... \nPlease understand,  60-70% of a trees goes to building industry (houses and wood products bind carbon for long long time), 10-20% goes to paper(packaging, 📰, medicine packages). And 10-20% goes to energy (heat and electricity), those ca 20% energy include branches and tree bark.\nImportant: if we cut, we plant new trees, new forests, because its a process-cycle of 70 to 90 years. As it always was in Europe, and will be. In those ca 80 years Life is happening in forests. Clearcut is not the end, its a beginning of an lifecircle. Some animals, plants and mushrooms crow or live only in clearcuts or 5y, or 10years andso on...X old forests. All in manageable forests.\nImportant: forest are devided to \"manageable forest\" (there we grow trees to cover the need of humanity's wood products and energy needs. And then there are large scale forests where you do not manage forest, those forest are for \"sustaining the life\",. recreation purposes and more.\n\nLike agriculture, you grow to feed humanity, manageable forest are for shelter and warmth.. Difference is that in agriculture EVERY SINGLE YEAR, they plant, and cut those plants, kill large scales of birds and poison little animals to provide you the food...but forestry makes the clearcut only ONCE IN 80 YEARS.\nDo not ask how much life was killed if you eat something, really, you will really flipp if you crasp this!\nSo, please do not criticize before you know the details. \nBut yes form the articles or clickbait brainless scandals sell.\n\nSo yes, forestry is carbon neutral because we crow it and bind it to products. And plant new forest, thats called forest management. \n\nDo not believe those little 👇syndrom girls who yell that Europe is a clearcut and burning Wood is bad.", "score": 6, "replies": [{"body": "My friend\n\nYou are only talking about Europe but the thread talks about importing from the US and then terming it Carbon Neutral because it only considers the combustion and not the whole process. It explicitly points this out.\n\n\nSecondly, it also explicitly explains the difference between mature trees and new planted trees and how they differ in sequestration\n\n\nAnd honestly, if your whole premise is based on the fact that it is carbon neutral because you plant new trees, then you need to rethink what you are talking about.\n\nBecause the idea is to use energy sources that are more efficient and not go back in time. You plant trees today which will grow to the size you require them after say 3 years and in that 3 years you run out of all your trees? Then what do you do? You would import. \n\nAnd if the whole World has the same attitude then what happens?\n\n\nJustifying something wrong by making it appear the end result is right, doesn’t make it right at all", "score": 3, "replies": [{"body": "3years..\nWhat? Unreal, you can not cut clearcut trees what are 3 y old!! No one who grows forest does not cut it down in 3 years, this is not sustainable! 70 years, 80 years depends of a tree species.\nYou are lost I think, forest management is sustainable and carbon neutral.\n\nThose forests that I planted, thous will be clearcuted by my son. And those forests what I cut where planted by my father and grandfather. Thing is I think you can not just crasp the forests cycle. Its not agriculture where you see with your eyes every year how crops is planted and cut. Forestry Its a 70y cycle. \nDo not make a mistake, forestry is an old knowledge! \nYou just can not cut down all when you decide, you must have 10y old forests, 20, 30,.40... And you must have them all times. So again forests are sustainable and carbon neutral, manageable forests!", "score": 1, "replies": [{"body": "You are brainwashed or trolling lmao", "score": 3, "replies": [{"body": "Brainwashingmashine 😆.\nI am just third generation forest manager. With 60 000 hektars of forest land. And learnt it and live in it.\nNo trolling, maybe little education what feels as brainwash when you do not know and it goes against what you just read but really do not know.", "score": 2, "replies": []}]}, {"body": "To begin with, I gave an example, I didn’t actually mean it grows in 3 years.\n\nAnd you literally doubled down on the point I am trying to make.\n\nNow understand what I am trying to say.\n\nYou cut down trees that are 70 year old TODAY. And you plant new trees that can be cut ONLY AFTER 70 YEARS, right?\n\n\nSo from today till the next 70 years, do you think you would have enough wood for the consumption of the whole of Europe? Or would you guys have to import?\n\nAnd if you have to import, it clearly means you don’t have enough for your own consumption.\n\nNow think if the World starts behaving like you, what happens to the whole ecosystem?", "score": 0, "replies": [{"body": "Radiate pine is ready to harvest after about 27 years in a temperate climate.", "score": 3, "replies": []}, {"body": "I do understand!\nYes we have for Europe enough. We are growing it for the last 200 years knowingly. Today we have forests what are 68,69 years old, so next year,ower next year we cut there...and so one (but you must replant...the circle of manageable forests). \nSome autistic girls try every hard to bann cutting of forest what we where growing for wood products, but we do have enough!\nThat said, We are not only importing you know, we export far more wood products! \nSo yes Europe is fine, we can handle it.\n\nMeanwhile in that 70y we do not have all forest in same age, its not like that in one day we will clearcut all at once. As I mentioned, forestry is an old art.\nAnd manageable forests are managed sustainably!\n\nBut we will continue to import to! if I have wooden houses to sell and you firewood... We will trade. If we make from our firewood products that replace plastics, then we export it and buy in firewood....if needed.\n\nThis energy emergency will last some years, we can handle this. Europe is deeply investing in sun and wind and some parts of Europe in nuclear, we can handle. In some years the pressure to energy wood will lower.\nAs it lowers to oil and gas right now,.so oil sellers are not particularly happy with forest management, so do not believe what is written, think to.\nThe \"mining industry\" pollutionists, do  not want sustainable things, and so articles are born.", "score": 1, "replies": [{"body": "Okay cool 👍🏾\n\n\nThe logic is amazing. That’s how World trade works.\n\nAnd that’s the point the World tries to make with Europe and the US.\n\nIf Europe and the US want to use fuels that are cost effective to them, and it makes sense to them because -\n\n1. It’s their naturally occurring fuel source\n2. It makes sense to trade with a willing partner that can offer something better in return\n\nThen why are they preaching to the World against using fuel sources that are cost effective to them OR naturally occurring to them and they want to trade that with a willing partner for something of higher economic value?", "score": -1, "replies": []}]}]}]}, {"body": "Never argue with a regard, they will drag you down to their level and beat you with experience.", "score": 1, "replies": []}]}, {"body": "Replanting trees doesn’t make it carbon neutral.  The idea of carbon neutrality is that no more co2 enters the atmosphere than if you were not to do it.", "score": 1, "replies": []}]}, {"body": "Please find below a host of links that confirms this - \n\n\nhttps://www.vox.com/platform/amp/science-and-health/2019/3/4/18216045/renewable-energy-wood-pellets-biomass\n\nhttps://www.nationalgeographic.com/environment/article/europe-burns-controversial-renewable-energy-trees-from-us\n\nhttps://unece.org/forestry/press/wood-confirmed-primary-source-renewable-energy-europe\n\nhttps://www.nytimes.com/2022/05/17/climate/eu-burning-wood-electricity.amp.html\n\nhttps://www.euractiv.com/section/biomass/opinion/why-forest-biomass-must-not-be-counted-as-renewable-energy/\n\nhttps://sciencemediahub.eu/2022/03/09/is-burning-wood-really-a-form-of-renewable-energy/\n\nhttps://www.businessinsider.com/europes-renewable-energy-wood-heating-atmosphere-faster-than-coal-2015-10?amp\n\nhttps://stacker.com/stories/35419/how-us-trees-are-powering-europes-renewable-energy-goals\n\nhttps://www.ieabioenergy.com/wp-content/uploads/2013/10/ExCo58-P8-Biomass-Potential-in-Europe.pdf\n\nhttps://amp.theguardian.com/environment/2022/sep/14/eu-limits-subsidies-for-burning-trees-under-renewable-energy-directive\n\nhttps://news.mongabay.com/2021/08/burning-forests-to-make-energy-eu-and-world-wrestle-with-biomass-science/amp/\n\nhttps://www.birdlife.org/news/2021/07/14/press-release-fit-for-55-renewable-energy-directive-forests-bioenergy-biofuels-14july2021/", "score": 1, "replies": []}, {"body": "The EU emits about 7 tons of CO2 per person. I think they should concentrate more on how to reduce and use more efficient energy sources rather than justifying how because trees are planted back it’s carbon neutral\n\nIt’s crazy how the wrong battles are being fought", "score": 1, "replies": [{"body": "How much does USA emitt per person?\nCount in your military to!", "score": 1, "replies": [{"body": "I am not from the US and neither live there.\n\nI pointed the fact about the EU because as mentioned in the body of the post, EU stands against nations but does quite the opposite when it comes to being carbon neutral", "score": 1, "replies": [{"body": "Russian?", "score": 0, "replies": []}]}]}, {"body": "The issue was solved decades ago. Nuclear.\n\nThen Russians bought a few hippies in Germany to get it banned, and here we are, at the mercy of Russia, wearing three jumpers. \n\nTruly Molotov Ribbentrop is the most constant military alliance in the world.", "score": 1, "replies": []}]}, {"body": "You sir are 100% on the money on this one - hitting the nail firm - deadcenter.\n\nThis woke enviromental dumbfondness - and adoration of uneducated children - refusing to go to school as a positive climate thing.\n\nHas infected the whole of europe.\n\nThe energy costs are soaring Well ahead of the coming winter - and everyone are collectively blaming Putin.\n\nWhich is a partial truth - But the energy prices started to go up Well before the Ukraine war.\n\nThis woke movement has shut down nuclear power - increased dependency on fossil fuels - and somehow are still refusing to acknowledge a very evident energy crisis.\n\nIts bollocks.\n\nEurope Will face Rolling power outages this winter - just like north korea.\n\nAnd the main reason is that There is not enough swing mass in the eletrical grids - because We shut down nuclear.\n\nIt doesnt matter How much wind or solar you throw on the electric production - you need stable energy production to transport that electricity where it is needed.", "score": 1, "replies": []}, {"body": "We do not need Russian oil. (more energy efficient but horribly polluting source). Russian oil drills are located in permafrost. Lets see how it goes when Europe uses Wood for 2 years and Russias oil drills and infrastructure freezes. I hope You all know what happens when oil is not moving in the tube in permafrost or Russian winter cold. It turns into goo and you need to replace all, I mean ALL infrastructure.", "score": -1, "replies": [{"body": "The only problem is that Russia has no shortage of non-regarded buyers for their oil and gas.", "score": 1, "replies": []}, {"body": "PZ is that you?", "score": 1, "replies": []}]}, {"body": "Why did i went to see the comments on the twitter thread, i know i'll see some high grade autism but i still go see it anyway, maybe i'm hopeing for some decent replys but i get disappointed everytime. ![img](emote|t5_2th52|4640)![img](emote|t5_2th52|4260)", "score": 1, "replies": []}, {"body": "https://en.m.wikipedia.org/wiki/Renewable_Heat_Incentive_scandal", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Reddit has a paid team called **Anti-Evil Operations**  (part of the \"Trust\" & \"Safety\" team) which goes around permanently banning accounts for saying bad words. We made automod block them so you don't lose your account for saying a word and getting reported. It's not our rule, it's the entire website now, we're just trying to look out for our people. Sorry.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "More efficient like what?  Fossils?", "score": 1, "replies": []}, {"body": "This is talking about combusting biomass. By combusting youre only getting the heat energy. This isnt talking about gasification. Gasification can be a closed system. Gasification can produce synthesis gas to power a turbine or for use as a chemical feedstock to produce the things made from natural gas. Some of the most recent gasifiers have solved the wet feedstock issue and thus bypassed the need to pelletize the wood.  As far as the deforestation: California has continued to have massive wildfires resulting in massive burnscars with lots of dead standing timber. Before that we had 120 million dead trees much of it from bark beetle.That timber is still decomposing into greenhouse gasses. If its gonna go into the atmosphere why not make energy in a closed system? Thats not deforestation, letting it get to where the catastrophic fires occur seems more like the deforestation.", "score": 1, "replies": []}, {"body": "I have this special wand I waved: burning wood is carbon neutral. The earth won’t know the difference.💩😡🤦🏻", "score": 1, "replies": []}, {"body": "TLDR buy enviva", "score": 1, "replies": []}, {"body": "Ok.. so… puts on what then?", "score": 1, "replies": []}, {"body": "All I’m saying is I can’t wait until I can get a Mr. Fusion installed on my car. No gas, no plugging in, boom!", "score": 1, "replies": []}]}
