{"title": "How often are your trades ITM?", "selftext": "I’ve had 4 positions the past couple of weeks credit spreads for AAPL, MSFT, SHOP, SPY and multiple times they were all close or ITM, had to convert 3/4 to iron condors. In your experience is this normal behavior? Seems like a heart attack every day lol.", "id": "d2cpe8", "created_utc": 1568142925.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 10, "comments": [{"body": "This questions assumes positions are out of the money when initiated, and there are many strategies that start in the money, or do not rely on being in the money for a gain.  \n\nCalendar spreads, and long butterflies are examples.  \nAlso vertical spreads can start in the money.", "score": 2, "replies": [{"body": "Mostly talking about OTM credit spreads. And wondering if it’s common for it to be ITM at times before the contract expires", "score": 1, "replies": []}]}, {"body": "Except about 3 days when I was rebalancing, I’ve been ITM on at least one credit spread of the many i have on every trading day this year. Extrinsic value still decays when you are ITM - it’s when all the value is gone that the position becomes no good.\n\nPlus this year has been pretty 2 sided, ignoring the jump in Jan-Mar. Patience is rewarded", "score": 2, "replies": [{"body": "Nice :) thanks for the feedback! I agree but I’m always afraid to get assigned early :P", "score": 1, "replies": []}]}, {"body": "How far OTM are you on your short side? Roughly how many DTE is it when you open your position, and how many DTE is it when you decide to cut your losses and add the other side for the iron condor?  \n  \n  \nIn my experience, I've been generally successful selling around .20-.30 delta for the short side. This corresponds to a 20-30% chance of the option being ITM at expiry.", "score": 2, "replies": [{"body": "Sup drunken_trader! \n\nIt depends on the stock but on average maybe 10-15% OTM. Usually the same .2-.3 delta. DTE is 2 weeks - 5 weeks out. Will usually cut losses the day before or the day of expiry if I think the trade is completely lost. I usually add the iron condor if i feel it’s starting to trend against me because of some new info - e.g. news or market conditions. I’ll start with an iron condor if I feel the stock is trending sideways just to make more on premiums. \n\nAnything you can see be improved upon?", "score": 1, "replies": [{"body": "When I say \"cut your losses\", what I mean is when do you turn your spread into an Iron Condor. Because at that point, you're \"giving up\" and locking in your loss. If your short sides are always finishing ITM, you may be just getting really unlucky. But if your spread is trading in the negative a few days after opening it, that is usually normal. As time decay starts to kick in you see things even out more in your favor. If this is what's going on, you may be starting your IC too early. Also, make sure you're looking at the IV rank/percentile when you're doing these trades- starting at a higher IV and having it drop can help greatly in making gains.", "score": 1, "replies": []}]}]}, {"body": "Most of those positions are fairly correlated, so they tend to move in the same direction at the same time.\n\nTry to place trades in different sectors, with low correlation, e.g. a position in finance, a position in tech, some real estate, utilities, bonds, gold...\n\nAlso space them out in time, so they don’t all expire in the same cycle.", "score": 2, "replies": [{"body": "thanks for the tip alpe77!", "score": 1, "replies": [{"body": "Happy to help. Good luck!", "score": 1, "replies": []}]}]}]}
{"title": "Big profit on gold stock in the next year?", "selftext": "Hey guys, \n\nI've been looking at GOLD, NEM and GDX(J)'s max historical charts--with the looming recession what are your thoughts on a near term buy and sell once (if and when) I can 2-3x my investment?\n\nGood idea, bad idea? If and when the recession comes, these stocks should 2x over a year or two.", "id": "d2b8z7", "created_utc": 1568137379.0, "score": 7, "upvote_ratio": 0.77, "num_comments": 15, "comments": [{"body": "If we’re talking about diversifying with precious metals, Perhaps. Go tangible ingots.", "score": 2, "replies": [{"body": "What do you think about IAU?", "score": 3, "replies": [{"body": "If you want to just go long gold without buying futures yourself, IAU is probably your best option. Honestly it is what I use to diversify into gold.", "score": 3, "replies": [{"body": "My gold holdings are IAU and Kinross. Pretty happy with them right now, if I expand my position just stick with IAU?", "score": 3, "replies": [{"body": "Effectively with Kinross you are taking on firm specific risk from that holding (and gaining firm specific return as well). \n\nThe question is do you want this addition risk/return or do you want only a position in the underlying asset of gold? If it is the former, continue with Kinross, but for the latter I always recommend IAU. IAU always has plenty of liquidity and a pretty low annual expense rate, making it the cheapest way to get direct access to gold via ETF.", "score": 3, "replies": [{"body": "ok awesome. thanks for the response!", "score": 2, "replies": []}]}]}]}]}, {"body": "I'm not talking about diversification, this is simply a short term profit outlook. Companies like GOLD and NEM are only becoming more efficient in their production methods (ex. production cost of gold/oz), and as efficiency increases, obviously so do profits. \n\nProduction costs/oz will stay fixed while profit/oz increases as the price of gold rises. If the market crashes in the next few quarters, you'd still think gold will keep going up and to the right (even if it takes a temporary hit post crash). I'm looking at it like a 12-24 month investment.", "score": 3, "replies": []}, {"body": "Personally. My gold holding are 1/10th and ounce of tangible solid ingot hoping to get to 2/10th an ounce soon. held value well made more on my silver holdings though.", "score": 1, "replies": []}]}, {"body": "Here is a great website that details the return of investment on gold and silver during recessions https://goldsilver.com/blog/if-stock-market-crashes-what-happens-to-gold-and-silver/\n\nYou will not get anywhere close to getting x2-3 on your investment without taking on a stupid amount of leverage. Also take note that gold rising during a recession is by no means a sure thing in a recession just more likely than not. You could be right about a recession and still lose money on a gold position.", "score": 2, "replies": [{"body": "> You will not get anywhere close to getting x2-3 on your investment without taking on a stupid amount of leverage.\n\nWhat about UGLD/USLV?", "score": 2, "replies": [{"body": "UGLD and USLV rebalance daily meaning that they bleed money due to volatility. As an example, let's say gold rises 3.33% on Day 1 and then loses 3.33% the next day and on Day 0 gold and UGLD are both worth $100. \n\nGold: 100 Day 0 -> 103.33 Day 1 -> 99.89 Day 2\n\nUGLD: 100 Day 0 -> 110 Day 1 -> 99 Day 2 \n\nAs you can see this causes a bleed effect due to this volatility that can cost dollars of difference. Also this happens whether the first day was the positive or negative day:\n\nUGLD: 100 Day 0 -> 90 Day 1 -> 99 Day 2\n\nSo if you are right about the exact timing of a recession, and the recession impacts gold this time around positively, and gold gets a really high return, then maybe you could get x2 your money. But to get that incredibly high reward you have to take on a lot of risk and be willing to lose money every few days the recession isn't happening. I'm not saying never use UGLD and USLV, just know they are high risk asset you shouldn't hold longer than week or month.", "score": 2, "replies": [{"body": "I’d consider UGLD and USLV a stupid amount of leverage even if you got to 2-3x from it.", "score": 2, "replies": []}]}]}]}, {"body": "I like gold royalty streamers like $FNV and $WPM, seems like a safer bet with a modest dividend.", "score": 1, "replies": []}, {"body": "Buy KL", "score": 1, "replies": []}, {"body": "If you need an expert's idea on gold stock investment. I recommend that you join in Resource Insider. Resource Insider is a subscription service offered by Jamie keech who offers his subscribers information and dealflow about mining investment including gold. \n Jamie Keech is a canadian mining engineer, natural resource financier, and co-founder of Capitalist Exploits(Exellent grade rating on Trustpilot.com). He travels the world looking for the best early stage opportunities in mining projects, and shares opportunities he invests in with subscribers.\n Jamie expects that stocks will catch up gold price in the next 12 to 18 months.\nIf you want to know the detail about Resource Insider, here is the link.\nhttps://resource-insider.com?orid=25643&opid=41", "score": 1, "replies": []}]}
{"title": "\"incoming recession\" and stock price", "selftext": "Everyone seems to believe that a global recession is coming pretty soon. If investors believe that it is true, it would be logical to sell every stock they have and then buy them back during the recession. But that would lead  to a massive drop in stock price before the \"predicted recession\" right?\nAnd this is not really the case. So why? The majority of investors don't believe in an incoming recession? Why did it make so much noises?", "id": "d26rn3", "created_utc": 1568118079.0, "score": 5, "upvote_ratio": 0.63, "num_comments": 15, "comments": [{"body": "Here's my $0.02. If you are a trader then you already know what you should do. If you are investing for retirement and truly believe that a recession is coming, then don't buy/sell and start setting money aside to buy stocks when the pain comes for a discount. I'm doing the latter.", "score": 6, "replies": [{"body": "I'm the latter latter. I think a recession is coming but I've put $4000 in the Index stuff anyway, because I'm 19 and can afford to do it in the long run. Though, if I wait, I could on paper make a lot more if I don't spend my savings.", "score": 3, "replies": [{"body": "There's nothing wrong with this option either imo. If a recession does come it won't matter 20 years from now with all of the potential gains, not to even mention 40 years.", "score": 2, "replies": [{"body": "$1 is worth $15 in 40 years after an average growth of 7%\n\nSo I guess my $4,000 is worth $60,000 in future money.", "score": 2, "replies": [{"body": "Nominally. Adjusted for inflation, real return would be about $7. Also, a portfolio with a proper glidepath having annualized returns of 7% over that time horizon seems a tad high given most capital market assumptions now. So your math is pretty off.", "score": 2, "replies": []}, {"body": "Potentially... Could be $266.6.", "score": 1, "replies": [{"body": "What do you mean?", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm a passive investor. So I plan on keeping the same allocation % between assets (stocks bonds cash and gold) and ignore news.\nThe market doesn't believe in an upcoming recession and I'd like to know why. And also why should a recession occurs. The yield curve? Correlation doesn't means causal.", "score": 1, "replies": [{"body": "I'm honestly not sure what you are getting at exactly. If you are a passive investor padding for retirement then I would say don't worry about the recession \"fears\" and buy stuff. As far as \"if\" a recession is going to happen then the answer is always yes because that is the cycle in the market, take a basic economy 101 class as it's one of the first things taught. The million dollar question is \"when\" in which the market uses historical data to help predict, but its still just that a best guess as no one can see the future. \n\nThat being said though it seems at least to me that the next recession if it hits in the next two years or so it might not be a catalyst from the USA market but instead global markets such as China recession or brexit. This assumes that there isn't a bubble in the domestic market that hurts it as well. \n\nI do this kind of thing for fun on the side of my normal work as it interests me, so don't take anything I say as actual market or investing advice. Its just observations as I interpret them.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "What do you mean? The \"incoming recession\" news was brought by short seller?", "score": 1, "replies": [{"body": "There has been \"incoming recession\" news for the past 3-4 years.", "score": 2, "replies": []}]}]}, {"body": "Because the primary indicator, yield curve, keeps signalling that a recession is coming (by going inverted), but tariff fears might be artificially hurting the yield curve.  Either way, the market sell off lags by 12 to 18 months after the yield curve going inverted.\n\nBesides that, investors aren't going to get out the market because before the recession hits, the market enters euphoria then massive volatility then the sell off.", "score": 2, "replies": []}, {"body": "Pple sold, companies bought back. Just stay long and enjoy the ride like everyone else 🤪", "score": 2, "replies": []}, {"body": "If you don't think it will drop more than the cap gains tax burden, then it makes sense to hold.", "score": 1, "replies": []}]}
{"title": "Market rotation", "selftext": "Market yesterday: SPY flat. V and MA were bleeding. There was a market rotation away from historically good companies. The reason is not clear, but many people here pointed out that it may have to to with the Fed meeting next week.\n\nSo I made this plot, which compares % changes of a few symbols against their performance in the aftermath of the last rate cut (computed by the percent change between July 25 and the closing of July 31).\n\nSome observations:\n\n\n- stocks that didn't lose a lot after the last rate cut benefit from the new rotation (except for ZM and WORK, which have been dropping before today)\n\n- PYPL, V, and MA have fallen significantly, but to the \"correct\" level. This suggests that their prices will stabilize.\n\n\n-CSCO and MSFT may still drop further. FB, INTC, IBM are not safe. NVDA, AMD, and AMZN are unclear since they tend to play in their own league.\n\n\nThe interpretation for this is simple: as the meeting approach, the market is unsure about the outcome, so people try to get as far as possible from the companies that suffered last July. PYPL, V, and MA were easy targets. Now that the drops of those are priced in, it's time to shutdown MSFT and IBM.", "id": "d22w7l", "created_utc": 1568091257.0, "score": 13, "upvote_ratio": 0.84, "num_comments": 17, "comments": [{"body": "https://www.bloomberg.com/news/articles/2019-09-09/u-s-consumer-borrowing-surges-on-jump-in-credit-card-balances\n\nThis might explain the drop on fintech", "score": 7, "replies": [{"body": "Fuck my obliterated puts and precious metal calls though 😤\n\nI’m BearJesus I die for they sins", "score": 5, "replies": [{"body": "Right here with you bredda. \n\nDon’t even know why I’m still holding anymore. The drill was so fast I just sat like a deer in headlights instead of dumping. Hoping for Q4 to ease the pain.\n\nAnd Tim Apple to impress me today.", "score": 1, "replies": []}]}]}, {"body": "This is not a good post. There was a rotation out of growth. That’s it. Some companies were spared because they were deemed to be uniquely worth.", "score": 8, "replies": [{"body": "“This is not a good post”\n\n...  says someone whose most recent post is of an ejaculating tattoo.", "score": 11, "replies": [{"body": "Not just an ejaculating tattoo too but a fucking naruto character with his big dick in his hand making eye contact while ejaculating.\n\nMan i wish i didn't open his profile fuck", "score": 13, "replies": [{"body": "Wow that tattoo is pure autism", "score": 2, "replies": []}]}, {"body": "Lmfao I thought u were joking", "score": 5, "replies": []}, {"body": "Sir, that was an excellent post. The upvotes prove me right.", "score": 2, "replies": []}, {"body": "so ur scared of his opinion and go look up his post history to validate his intelligence?\n\nu are special kind of retard", "score": 1, "replies": []}]}, {"body": "degenerates like you belong on a cross", "score": 0, "replies": [{"body": "Uwu crucify me daddy", "score": 3, "replies": []}]}]}, {"body": "all this means is if SPY falls, there will be just another amazing opportunity to sell put spreads on it expiring this friday!", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "Link to the plot: [https://ibb.co/nz1JNZG](https://ibb.co/nz1JNZG)\n\nNo idea how to put it here.", "score": 3, "replies": []}, {"body": "Humans are incredibly good at constructing narrative to fit what they see.\n\nI wouldn't count on that for tomorrow's bets though", "score": 1, "replies": []}, {"body": "So should I dump my life savings into $V calls or what?", "score": 1, "replies": []}]}
{"title": "Slack’s missteps have now made the stock a ‘buy’ at the right price", "selftext": "There is a healthy debate on Slack, and both sides have valid arguments. On the one hand, you have a company with slowing growth, and on the other, you have a product with strong industry key metrics and a highly engaged user ba\n\n[https://www.marketwatch.com/story/slacks-missteps-have-now-made-the-stock-a-buy-at-the-right-price-2019-09-03](https://www.marketwatch.com/story/slacks-missteps-have-now-made-the-stock-a-buy-at-the-right-price-2019-09-03)", "id": "d27o6b", "created_utc": 1568122775.0, "score": 9, "upvote_ratio": 0.8, "num_comments": 13, "comments": [{"body": "The problem with slack is MS did Teams, its a cheap knock-off, but its bundled with the rest of the office suite so companies would rather just leverage what they've already paid for.", "score": 20, "replies": [{"body": "I'm waiting for google to buy out slack and have them roll out their version of google teams+doc integration \n\nkeepo", "score": 12, "replies": [{"body": "...And then decide to shutter the service out of the blue and leave everyone scrambling.", "score": 9, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "slack also already has api for google docs integration too so honestly I think this makes sense.\n\nBut Slack+Google may not come in the form of a Google offer buy out, rather it may come in the form of Slack selling themselves to Google because Google would rather do it in house unless they can get slack for cheaper", "score": 1, "replies": []}]}]}, {"body": "That's the problem with Teams, it's a knockoff. When the company decides that it doesn't do what they need it to, they buy Slack and it becomes shelfware (e.g. my employer)", "score": 1, "replies": []}]}, {"body": "On the third hand: it's fucking instant messaging and they lose money hand over fist so buy buy buy in this retarded world where it seems like you gain value by losing money faster than the competition", "score": 17, "replies": [{"body": "It’s hard to do at scale. The data storage alone is wild. I think they’re blitzscaling.", "score": 1, "replies": []}]}, {"body": "Calls yesterday", "score": 2, "replies": [{"body": "Same", "score": 2, "replies": []}]}, {"body": "Slack is an obvious acquisition from LinkedIn/Microsoft or google or maybe even sales force. Otherwise almost all new startups use slack.", "score": 2, "replies": []}, {"body": "Someone smarter than me please explain this to me, \"Slack’s product — an instant-messaging and collaboration system — has massive potential with a 143% net customer retention rate, yet the financials undermine the company’s growth trajectory.\"  How do you have 143% retention rate???  I thought 100% is the highest?", "score": 2, "replies": [{"body": "Obviously they are accounting for the children who will be born to parents who only allow slack in their household.", "score": 2, "replies": []}, {"body": "Usually it means your existing customers are spending more. Thus above 100% retention rates.", "score": 2, "replies": []}]}]}
{"title": "$AXP: Buy The Payments Dip", "selftext": "This great company is selling off due to fears about over valuation of Visa and other high flying payments stocks. American Express is a much cheaper business at just 14 Forward PE and has a diversified business. The firm being a financial will also reap major rewards from yield curve steepening as China trade talks pump the markets and recession risk fades. A rate cut by the Fed will also boost consumer spending/optimism.\n\nThe company is guiding for around 8% revenue growth and large stock buybacks.\n\nThe options I purchased today are the September 20th $116 Calls for $2.23. These options will take you through next weeks Fed meeting where they are expected to cut rates by .25-50 bp. A more high risk play I'm looking at buying are the September 27th $119 strikes trading around $1.22.", "id": "d2al60", "created_utc": 1568134854.0, "score": 10, "upvote_ratio": 0.75, "num_comments": 11, "comments": [{"body": "Visa and MasterCard are just the processors, so when users default, they don't care. Amex is the lender for a lot of cards as well as a processor. If there is a recession Amex will get hit hard with default write-offs. It should be lower than the others right now.", "score": 11, "replies": [{"body": "I’m not saying they should have a 30 PE like Visa. The lending business is also a cash machine when consumer spending is strong like it is now. AMEX also has had low write offs due to targeting upper class consumers. In the crisis their charge offs were only about 10%. Which is bad but I don’t expect a 2008 style crisis anytime soon.", "score": 3, "replies": []}]}, {"body": "Okay stranger. Bought Dem risky calls. Let's see what they yield.", "score": 3, "replies": []}, {"body": "Waiting till it touches 115 then I’ll buy", "score": 1, "replies": []}, {"body": "Loaded up on calls a bit ago. Balls deep", "score": 1, "replies": []}, {"body": "Why drop so much on no news ?", "score": 1, "replies": [{"body": "Valuation scare sold off the payments ETFs.", "score": 2, "replies": []}]}, {"body": "Ok puts it is then", "score": 1, "replies": [{"body": "That would require you having capital.", "score": -3, "replies": [{"body": "You’re about my new favourite dude motherfucker", "score": 1, "replies": []}]}]}, {"body": "selling put spreads since the stock will either go slightly down, sideways, flat, or slightly up..\n\nTherefore selling put spreads that will expire worthless next week for win/win and not having to care about decay on buying calls..", "score": 1, "replies": []}]}
{"title": "Baker Hughes To Purchase $250M Of Class B Common Stock From GE And Affiliates", "selftext": "September 10, 2019 04:13 PM ET (BZ Newswire) -- News\nIn addition,\n\n BHGE announced that it has agreed to repurchase (the \"share repurchase\") from one or more of GE and its affiliates, in a privately negotiated transaction, $250,000,000 of shares of BHGE Class B common stock, par value $0.0001 per share (the \"Class B common stock\"), together with an equal number of associated membership interests of Baker Hughes, a GE company, LLC (the \"LLC units\") at a price equal to the price per share at which the underwriters will purchase shares of Class A common stock from the selling stockholders in the offering. The Company intends to fund the share repurchase with cash on hand and other available sources of liquidity. Although the share repurchase will be conditioned upon, among other things, the closing of the offering and will be completed immediately following the offering, the closing of the offering will not be conditioned upon the closing of the share repurchase. The offering and share repurchase have been unanimously approved by the Company's board of directors, and the share repurchase has also been unanimously approved by the Conflicts Committee of the Company's board of directors comprised of independent directors who are not affiliated with the selling stockholders.\n\n\nCopyright © 2019 Benzinga (BZ Newswire, http://www.benzinga.com/licensing). Benzinga does not provide investmentadvice. All rights reserved. Write to editorial@benzinga.com with any questions about this content. Subscribe to Benzinga Pro (http://pro.benzinga.com).\n© 2019 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "id": "d2dt3p", "created_utc": 1568147004.0, "score": 17, "upvote_ratio": 0.91, "num_comments": 20, "comments": [{"body": "I have 10 dollar calls paid .02 a contract.", "score": 9, "replies": [{"body": "Same gl buddy", "score": 1, "replies": [{"body": "Up 50%", "score": 1, "replies": [{"body": "Same", "score": 1, "replies": []}]}]}]}, {"body": "Holy balls /u/Charles_Himself_", "score": 5, "replies": [{"body": "This looks like a suspicious move, doesn’t it?", "score": 5, "replies": [{"body": "What...propping up your valuation by way of a debt service through a child corp? Nooo.\n\nBut I did buy a 10c before that (to complement my 9ps)", "score": 9, "replies": [{"body": "Hahaha god damn I rushed Into puts too fast, but NOK looking really good dude", "score": 5, "replies": [{"body": "I been dabbling and waiting. At some point, some hedge is gonna get real tired of propping this dinosaur up. I like frog's plan above, though.\n\nQuick, scrub that chatter on the good play. Dem algos scraping.", "score": 5, "replies": [{"body": "im buying up more 2021 $5 puts each week\n\nhow the fuck do people expect GE to make money when they are literally actively shopping all of their revenue streams", "score": 1, "replies": []}]}]}]}, {"body": "No,  not even exciting!  I mean if they could do his 151 more times they could cover their “Long Term Care”  obligations until 2022!\n\nEdit: Had a 0 where I should of had a 2", "score": 3, "replies": []}]}]}, {"body": "Oh so they need to shake out the puts hahah.\n\nSO this means I'll set alerts for $1-2 higher on GE and sell some call spreads after they hit the higher alerts.", "score": 5, "replies": [{"body": "Going to follow you into this after FOMC", "score": 2, "replies": [{"body": "yeah for sure, whatever GE does at this point doesnt even matter, if it squeezes up, I'll sell call spreads expiring the soonest, if it plops down and drops more, I'll sell shortest expiration put spreads if there is high IV etc..", "score": 1, "replies": [{"body": "Yup, just don't want to mess with it on this news + a rate cut. Might even grab stock to just cover the calls. This shit is so oddly propped up. Though, I suppose I can run a repeat calendar sale.", "score": 2, "replies": []}]}]}]}, {"body": "Doesn't that mean bad news for GE?", "score": 4, "replies": [{"body": "I honestly don't know. But Markopolis specifically called out shenanigans with this offshoot as being a driving factor in their fraudulent reporting.", "score": 4, "replies": []}, {"body": "yes, they will have to report the additional 7billion loss, on top of the 2billion they took last year from this same play, on their books this year\n\nnot to mention they just sold off 3/4 of the revenue that was reported on their 10k last year", "score": 2, "replies": []}]}, {"body": "When this bubble pops what can we expect to go down with it?", "score": 1, "replies": [{"body": "i dont think too much, their LTC counter-parties will be fucked though \n\nand anyone that lent them money hahha", "score": 1, "replies": []}]}]}
{"title": "AIMT Peanut \"Update\"", "selftext": "If yall followed my last post you'd know that you'd be up 60% since Monday.\n\nToday's your last chance to either crash or moon on AIMT before the briefing documents come out.  (This friday is the actual meeting though)\n\nDD\n\nEfficacy: It works. Touching a peanut, won't kill you anymore for most kids.  4-17  You can even eat a little bit like a bite of peanut butter sandwich.\n\nSafety shmafety:  You got more systemic allergic reactions, sure, but you at least know where it's coming from and you got your epi\n\nThis drug is to protect kids from unintentional ingestion of peanuts.   Yea, that kid that died because he was on the same slide as a kid munching on trail mix?  No more.  First kiss cause you death cause she kissed another boy eating peanuts?  Enough.\n\nKnow how many kids are deathly allergic to peanuts?  Like a million in the USA.  You charge 10k per year for this you got 10bil in rev.  30% will likely come off cause it causes side effects.  You got DBVT's peanut patch competitor on the horizon.  Another 50% of that.  Take off another 50% just because and you still got 1.75b.\n\nCurrent market cap is 1.37b.\n\nBruh, you do the math.  Nothing on the market currently for peanut allergy and AIMT got egg allergy in the pipe.\n\nI'mma lay my pipe how you think it is.  Due to IV it may make more sense to not buy Options at this point as the 25 strikes are now already $2.00.  Lookin at a positive advisory committee post price of 28.  30s might be a bit too optimistic but it has hit this before.\n\nGood luck autists\n\nOh yea, the briefing docs could reveal something shitty.  Just FYI  can't predict this shit.", "id": "d2flp8", "created_utc": 1568153836.0, "score": 18, "upvote_ratio": 1.0, "num_comments": 16, "comments": [{"body": "Fucking thorough man!  Outstanding.", "score": 2, "replies": []}, {"body": "So the briefing documents come out Thursday or EOD Wednesday?", "score": 2, "replies": [{"body": "Likely Wednesday morning", "score": 1, "replies": [{"body": "Thanks for letting me know, guess it's too late now. Good DD.", "score": 1, "replies": []}]}, {"body": "The documents are already out.  Head over to stocktwits.com/aimt", "score": 1, "replies": [{"body": "Thanks for letting me know, guess I missed the bus.", "score": 1, "replies": [{"body": "I did too.\n\nEdit: there will be another bus.", "score": 1, "replies": [{"body": "When will the other bus be? I need to get to the stop.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "trading flat, what's the upcoming catalyst?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "What about calls Thursday eod?", "score": 2, "replies": [{"body": "Depends on briefing docs.  Either way, I’d load up on calls even if the briefing documents suck", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I think you should close before they vote on Friday.   Why take a chance?   You probably already doubled the money given the price action.", "score": 1, "replies": [{"body": "Yea, I don’t want to get caught in a volatility drop either.  What are you gonna do?", "score": 1, "replies": [{"body": "Just flipped some shares for a nice lunch, I have been burned by biotech many times before for taking on so much risk.", "score": 1, "replies": [{"body": "Agreed, I’m outta here", "score": 1, "replies": []}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "d2fpdl", "created_utc": 1568154229.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 15, "comments": [{"body": "can you make this post into a video where you purchase [this item](https://www.amazon.com/Jenga-A2120EU4-Classic-Game/dp/B00ABA0ZOA), set it up on a table and use [one of these](https://www.amazon.com/Sharpie-30001-Permanent-Markers-Point/dp/B00006IFHD) to illustrate the debt you're talking about", "score": 9, "replies": []}, {"body": "You realize that they haven't sold $20,000,000,000,000 worth of negative interest rate bonds, right? That would be implying that half of the US GDP goes into 1 month worth of fed bond purchases.", "score": 7, "replies": [{"body": "OK so I probably wasn't very clear. I'm not saying referring to Wall Street as the actual Wall Street. I'm referring to investment banks in general. Hedge funds, portfolio managers and so on", "score": -1, "replies": [{"body": "They aren't overly leveraged into the bond market though..", "score": 7, "replies": [{"body": "l o l", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "They surely misgambled with MBSs then", "score": -1, "replies": []}]}, {"body": "Raise negative yields to -100% and debt to should clear up quickly", "score": 2, "replies": []}, {"body": "Negative yielding bonds are literally the greater fool theory", "score": 2, "replies": []}, {"body": "Your logic fails on so many levels it's not even fun.  You really think you're into something here. Wrong. Non-negatice European interest rates might lower the USD rate. Your conspiracy ends there.", "score": 1, "replies": []}, {"body": "Only Goldman knew, that's why they bought CDSs for AIG. AIG, Morgan, Lehman, Bear all had no clue", "score": 1, "replies": [{"body": "jp literally wasnt affected by the cds and mbs debacle at all", "score": 1, "replies": [{"body": "I think he’s talking about Morgan Stanley", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Jay Powell has nothing to do with this, US bonds are not trading at negative yields", "score": 2, "replies": []}]}]}
