{"title": "Saudi Arabia fucked themselves", "selftext": "[deleted]", "id": "4h70s1", "created_utc": 1462063467.0, "score": 51, "upvote_ratio": 0.89, "num_comments": 48, "comments": [{"body": "I'm bullish oil, but I want to go over the retracement that happened in ~Aug-Sept 2015 and what I feel are two big factors that lead to that fall that aren't happening this time around:\n\n1. Iran sanction talks began to gain real traction and appeared like they were going to be lifted, very bearish news for the oil price\n\n2. China PMI index was looking very bearish, indicating reduction in demand, stock market in China was also crashing at the time. One of the biggest consumers of petrol looked like their economy was in the gutter.\n\nhttp://static4.businessinsider.com/image/5723acfb52bcd01a008bff2b-1200-900/oil-rigs-4-29-16-cotd.png\n\nWe can see the small bump @ around the same time, when oil made its climb back from 40 up to 60. \n\nIran has now been priced in, China has now been priced in, what's the cause for the rise in oil prices from $23 up to $45? Well, rig count is a big one, the fact that US production has reduced by nearly 10% since its ATH in 2015, and generally positive news coming out from emerging markets with their PMI/consumption data.\n\nAs the OPEC players like SA claim that they're going to raise production levels, I think a lot of it is bluffing. Most of the OPEC players besides Iran are already at max capacity. They would need to construct new rigs and it's not something that can happen overnight, it takes time, investment in capital and in a market where oil prices are so low, it's also counter intuitive to increase capex spending to pump more so you can drive your bottom line down even further and increases your risk and exposure for no reason, so I would say it's just a game of chicken to hold prices down further hoping more players get pushed out.\n\nNow, keeping pumps going made sense, the idea was that shale companies would get priced out and many have, and many HAVE... A lot of BKs and layoffs.\n\nhttp://money.cnn.com/2016/02/11/investing/oil-prices-bankruptcies-spike/\n\nGenerally, news tends to be a lagging indicator but during the crash, the news heatmap for oil was relatively positive and bullish, around end of 2015, lukewarm/neutral, and Q1 was toxic negativity and now the negativity has cooled down a little and we're back to lukewarm. \n\nThe numbers don't lie and oil markets are VERY slow to react, as one comment pointed out, say demand continues to pick up and supply isn't able to keep up, it's going to be insane how fast the price rockets up just like how insanely the price tanked. You can't suddenly pump more oil overnight, you need to build rigs, hire crews, scale out and most companies will not take that risk after what happened in 2015 so they're going to wait until oil is at least in the 50-70s, secure hedges THEN move to increase capex to bring wells online which even then will take at least another few months to even get online, this number varies a lot depending on many factors, and can even take as long as a year in some cases, and I feel that will be the case due to how shorthanded they are from layoffs (this is a very risky assumption/projection I'm making though).\n\nhttps://www.eia.gov/forecasts/steo/report/global_oil.cfm\n(Examine the first chart on the page if you're lazy, but the whole article itself is worth reading)\n\nLooks like the supply demand lines will finally meet @ around end of 2016/beginning of 2017.\n\nAnyway, there are a lot of other points, but I won't bore you with all of the data I've found that has convinced me oil is going to be on an uptrend, but I'm just going to point out that the fact that the Doha meeting did not cause oil prices to fall, everyone was so convinced prices would tank, was pretty much the moment I became fully convinced that we're going to enter a bull market in the coming months. \n\nI might be wrong though, I could be wrong, I've been slowly buying energy stocks (oil, coal, gas, solar) since May of last year so I took some heavy hits (However I could not have possibly predicted the Iran and China events, but that's part of the risk you take going into such a volatile asset), but I also got great aggressive buys when it was at its Q1 2016 $20 lows, so I've made all of my money back and more and I'm  positive in that sector. There will definitely be volatility, I wouldn't be surprised if oil fell back to 35, maybe even 30, but I really doubt we will see 30 again but don't bother gloating if it does because that wouldn't surprise me either at this point, nothing can surprise me after last year. \n\nI have hedges until Sept 16, so I plan to begin selling the hedges if oil falls to the mid 30s. When oil was in the 40s last year, everyone thought that was a bargain, I think the 20s was the despair phase, everyone was so negative, people on this sub and even news talked about 10 dollars per barrel which is absolutely insane on so many different levels fundamentally.\n\nAll I'm saying is, make sure you hedge whatever side you're on. I'm not going to try to convince you oil is going up, but do the smart thing and hedge. There are very compelling arguments for both sides, aside from some major global conflict arising, I can see the price swinging windly either way, but long term circa 2017-2018, I don't think oil is going to be 50-60 like people project, I would hope for something closer to 70-80 and only rising higher due to production being outpaced by demand, so if you're looking for what I consider a RELATIVELY safe investment with high upside, I would target big players like XOM, BP, BHP, RDS, HAL, KMI, CNX and hold till 2018. They may suffer volatility as well, but nothing on the same level as the small-mid caps that the rest of us are invested in which I'm hoping will be at least a 2 bagger because this is WSB SO YO-FUCKIN-LO!!! \n\nDisclaimer: People on /r/investing call me cancer", "score": 17, "replies": [{"body": "Great post. First time investor here, decided to take $1000 and buy COP and SLB in January (still holding the SLB, moved the COP to CNX and SWN last week). I got some shit over there at /r/investing for asking advice about when I should sell, people might as well have just typed \"YOU DONT UNDERSTAND MARKETS\" into the keyboard. I'm not hoping to go gangbusters, just would have seriously regretted not investing in oil while it's low.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Are you still taking the monster shit ?", "score": 6, "replies": [{"body": "A ten hour dooky", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm kinda curious as to why Saudi Arabia needed to seek out a $10 Billion dollar loan back in March from the International Bank. Was it because they truly needed the money to pay debts that they were losing in revenue from cheaper oil, or was it because the cost of bringing oil on and offline again is more expensive than the $10 Billion loans interest rate along with avoiding civil unrest and negative media attention? Or, was this somehow just another verbal attempt to cause fear upon US producers and manipulate oil price even further on some level? I mean, in a Global commodity market, is $10 Billion even worth blinking over? Maybe not.", "score": 8, "replies": [{"body": "From the podcasts I've listened to: it costs Saudi Arabia from $7-$15 / barrel depending on the source. But they have a universal basic income and the gov't pays for everything. So they need a ton of volume and margin to keep their citizenry happy and fund terrorism and whatever. So they're still insanely profitable but not insanely insanely profitable.  \n\nMy guess, we're seeing a fake rally / short squeeze right now. Inventories are at all time highs and prices are pretty much around the 10yr average. \n\nDisclosure: I'm short UCO and uwti and it hasn't been fun recently", "score": 12, "replies": [{"body": "> So they need a ton of volume and margin to keep their citizenry happy and fund terrorism and whatever.\n\nlol aint that the truth", "score": 5, "replies": []}, {"body": "Profitable yes. Solvent no. I think their national budget is specifically based on ~$78 oil. Below that without producing the 100% more oil they're spending more than they're making minus what the Saudi family is still siphoning off to their private accounts", "score": 4, "replies": []}, {"body": "And fund terrorism or whatever. Fucking killed me mate LOL", "score": 4, "replies": []}, {"body": "What podcasts?", "score": 3, "replies": [{"body": "I think it was from a planet money podcast on the IPO of Saudi Aramco \n\nhttp://www.npr.org/sections/money/2016/02/03/465476188/episode-681-the-oil-kingdom", "score": 1, "replies": []}]}, {"body": "I don't understand why people are shorting oil right now.  You are taking a huge risk with very little upside.  The most likely scenario is that the price of oil eventually shoots up as production drops (which is happening right now).  \n\nThe upside is what?  How low can oil possibly go?  The bottom is $25/bbl but we probably won't see that again anytime soon, if in our lifetimes.  At $25/bbl countries go bankrupt and social unrest spreads.  The Saudis bluffed and they fucked themselves over.  These are not smart people.  If it weren't for oil, they would be living in huts like neanderthals.", "score": 3, "replies": [{"body": "> COP \n\n\nI am shorting oil now because I think it will get back in the $35 range and then go up again in the summer/fall.  But you are right.  I am taking an unnecessary risk.  If oil gets into the $30's again I will buy oil and go long.  I made good money in March on CHK and CRC as oil went up and will do it again if/when oil dips. yolo\n", "score": 1, "replies": []}, {"body": "You might be right, I don't know where it's going, but in 1999 oil was $10 a barrel. I just think with the supply glut, record high production and oil shale tech were more likely to go to low $30s than high $60s. \n\nCurrently i am short UCO and UWTI, but my thesis is that with high storage costs I'm hoping to make money off the contagio, leverage decay and fee of these contracts as oil goes sideways. These ETFs decay about 3-5% a month.  If you go long oil and are thinking it's going through the roof, invest in oil and oil service companies  or some type of productive asset, but these commodity funds aren't a good long term play\n\n\" In constant money, the price of oil rose by almost 900% between 1970 and 2013. This can be compared with a 68% increase for a metals and minerals price index, comprising a commodity group that, like oil, is exhaustible.\"\n\nhttp://blogs.scientificamerican.com/guest-blog/the-age-of-cheap-oil-and-natural-gas-is-just-beginning/", "score": 1, "replies": []}]}]}]}, {"body": "Conspiracy theory: Obama doesnt want Dems to lose. Any stock market crash, weakening of the economy means a higher chance of Trump getting elected because it happens on Dem watch. Saudi Leadership probably was made aware that an oil-linked crash now meant a major realignment of US alliances in the region. They may have cut a temporary deal. Whether the deal prevents further plunges in price after the election is an open question.", "score": 9, "replies": [{"body": "whoa there\n\nin this crazy theory of yours. did you think about bush being better friends with the saudis?\n\nwhy isnt jeb in office yet?", "score": 4, "replies": [{"body": "Cause USA gets to do whatever the fuck it wants not the other way around.", "score": 4, "replies": []}]}]}, {"body": "Maybe they wanted a bigger drop and knew they needed help to do that. Who's to say what the house of Saud wants?\n\nMaybe they want to massively cut their welfare programs, and enlarge their military to counter Iran. Maybe they want to force their populace into diversifying their economy before it's too late.\n\nThere's lots of possible non-fuck-up reasons that they chose to play it this way.", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You're the moron here. This argument is full of jumps in logic that make no sense. \n\nIf they give up control of 5% of the company, that doesn't mean they lose control of the company. On top of that, that for fucking sure doesn't mean they lose oil supremacy. The company will still be producing from the biggest reserves at the lowest cost. That doesn't somehow change if they sell 5% of the company. Ownership doesn't change dominance, and extreme minority ownership has virtually no effect on dominance. To suggest it would is absolutely fucking retarded.\n\nAramco won't go bankrupt unless oil is selling at under $10 a barrel for a significant amount of time. On top of that, the Saudi government isn't even hurting as much as people think. They've curbed social benefits to the point where they're not losing money at crazy rates anymore. They need higher oil prices but they don't need them for 5 years or more. \n\nSaudi Arabia also has a pretty well funded military. If the social benefits go to shit, they just become increasingly militaristic. \n\nYour analysis is dogshit and face value bullshit. This reads like someone in finance trying to perform a bypass - you have no goddamn idea what you're talking about.", "score": 13, "replies": [{"body": "No you're the fucking moron here. The Saudis have said they want to diversify their investments away from oil. What do you think that kind of statement does to the value of their IPO you dumb shit? That's what he was getting at. \n\nAlso, here's a headline that just broke:\n\nhttp://www.middleeasteye.net/news/sacked-workers-saudi-arabia-set-fire-buses-over-unpaid-salaries-372554115#sthash.rbYmHehK.xiqq\n\nOne of the largest contractors in Saudi just laid of 50,000 workers who they haven't even been able to pay for the last few months. Yeah the situation in Saudi looks really fucking good right now. ", "score": 3, "replies": [{"body": "The government diversifying doesn't affect the viability of the company. While the company is linked with the government, the government is not the company and the company is not the government. How the fuck does the government diversifying away from oil make the company any less profitable? If you have any critical thinking skills it does the opposite.\n\nGovernment diversifies away from oil. Means they're not as reliant on oil to fund their entire economy. Means that they no longer have to constantly think short term with their investment. As someone investing in the stock market, you should know that investing in a diversified portfolio makes the total portfolio more valuable and doesn't reduce the value of the stock diversified away from. \n\nPlease explain how the **government** moving away from total dependence on oil affects the oil company, which will continue to operate and be 95% owned by the government.\n\nOk? A private company in Saudi Arabia didn't pay its workers because it's contracts were suspended by the government after the company fucked up and had that crane collapse in Mecca. And then those foreign workers in SA rioted. That doesn't suggest shit about SA, it suggests shit about the bin laden construction group. Holy shit you are dense.", "score": 3, "replies": [{"body": "Let me make it really fucking simple for you. The government has said they want to lower energy subsidies and introduce an energy levy. Do you think these statements will INCREASE the value of the Aramco IPO or DECREASE it you dense fuck? Seeing as Aramco is GOVERNMENT OWNED, do you think that was a GOOD thing for the government to say or a BAD thing for them to say? \n\nIt would be like me trying to sell you my house while also telling you that I'm the mayor and I'm gonna raise your property tax next year. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": -9, "replies": [{"body": "Oh you're gonna bitch about me being a douche? Go fuck yourself you fuckin pussy. \n\nYou made a stupid fucking argument. I countered it. You have no idea what you're talking about. If you don't have anything legitimate or any sort of interesting knowledge then I don't give a flying fuck about your response.", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">the fact that you think aramaco won't go bankrupt unless oil sells for under $10 tells me you're a moron\n\nYou're fucking stupid. Aramco gives money to the government, not the other way around. Government goes bankrupt before Aramco does. Ever notice that even though Venezuela is literally on the verge of collapse, PdVSA still operates? In a reduced capacity because the government kicked out all the halfway competent workers, but it will continue to exist longer than the government. Government relies on oil, oil does not rely on government.\n\n>They need $80 per barrel to support their budget/economy.\n\nThat was true at the beginning of the collapse. They've cut back subsidies and benefits to the point where they're sustainable at a significantly lower price. There was a Bloomberg article about this like within the last week - keep the fuck up. Using info from Jan 2015 is a little late.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Aramco or the government? Aramco isn't. The government is. Never said that the government wasn't losing money. Just said they weren't losing it at the rate you think they are and that aramco isn't really affected in terms of IPO by that fact. If you somehow thought I was saying that SA was maintaining their oil fund or growing it then you're not only ignorant of the climate in SA but also need to work on that 3rd grade reading comprehension. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": ">  (which will probably go bankrupt in 2 years if oil doesn't recover)\n\nHahaha  \n\nYeah the oil production with the lowest production costs has a *great* chance of going bankrupt before everyone else.", "score": 5, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "I'm not sure how else you expect this sentence to be interpreted:\n\n>their oil company ... will probably go bankrupt in 2 years if oil doesn't recover\n\nSaudi Aramco will not go bankrupt until it runs out of oil to pump, which won't be any time soon.  Their cost of production is one of the lowest in the industry.  ", "score": 2, "replies": []}]}]}, {"body": "Absolutely.  We tend to have a bias where we think rich countries/people are smart, but the only reason the Saudi's are rich is oil.  If you want to look at a smart country, look at China.  Those fuckers know exactly what they're doing and they're winning the game.\n\nThe Saudis could dominate the world if they wanted to, but they're too fucking stupid.  They are going to go down in flames.", "score": 1, "replies": []}]}]}, {"body": "Go for it, but you're missing a huge part of the argument for why oil is going up. Hint: it doesn't have a goddamn thing to do with shale producers. Producers also don't really drill significant amounts of new wells at $50. They produce from drilled but uncompleted wells because the cost of actually drilling new wells is borderline profitable at those levels.\n\nI welcome y'all to invest in DWTI and short oil. It'll make my long bets look that much better.", "score": 3, "replies": [{"body": "You. You are my sunshine. It doesn't even matter really. There's a lot of chatter that a good portion of the ducs aren't really feasible to get at and they sure aren't cheap. What's more, flattening of the curve is bullish not bearish. It means the market is demanding the barrels now rather than later. There have already been quite a few layoffs, and some bankruptcies, not as many as I expected to be honest, but they're there. What's more, once the market realizes it's undersupplied it's going to take YEARS to hire crews and get them trained. Lastly, were now have an industry full of producers that are cautious to lay on the capex because of the recent sucker rally.\n\nWe may retrace some soon, and I hope we do because ima be loading up till my hands bleed.\n\nFull disclosure: I'm fully talking my book.", "score": 5, "replies": [{"body": "Yep. Contango is normal for oil. Has been a part of oil's history for a long time and for exactly the reason you said: to encourage production now.\n\nYep. I expected more bankruptcies too, but I've seen quite a few layoffs. I don't think the shale matters all that much - the more important part is the huge capex reduction, which definitely has taken place with majors and state oil companies. And definitely has taken place with mid sized companies like anadarko or Apache. I'm less worried about the training of new crews and thinking ramping up bigger projects and having a couple year gap is gonna kill production levels for awhile *from the bigger players*. Smaller players with small time cheap as fuck plays aren't going to be the ones who have fallen significantly behind. Companies that put in long term projects are.\n\nI'm very fucking bullish on oil. Once we saw the capex reductions last year (something like 400 billion of delayed or cancelled projects), I knew that it's only a matter of time before it comes back to a decent level. India also showed increasing demand and looks like they're going to come in and replace any demand lag from China, so there's that too. Long term oil plays is where it's at.", "score": 1, "replies": [{"body": "So what plays you using bullish on long term oil?", "score": 2, "replies": [{"body": "Personally, holding several riskier oil companies and some mid range ones. CHK, EPE are the riskier ones that I'm holding, but those have some risk if oil doesn't recover quickly enough. DVN and APC are my more sure bets, and I've got RDS.A because it's a particularly beaten down major that has good potential for a long term slow recovery along with a solid dividend.\n\nThat's just my play on it. Shorter term there are some plays to be made with options but not really subject to the same analysis.", "score": 1, "replies": []}]}, {"body": "> Smaller players with small time cheap as fuck plays aren't going to be the ones who have fallen significantly behind. Companies that put in long term projects are.\n\nYeah but those guys are subject to the rehiring thing too. Some minimajors are running single digit number of rigs! It's a big machine and it takes time to spin up. It's going to be particularly exaggerated since crude is so much more labor intensive now.\n\n\n>I'm very fucking bullish on oil. Once we saw the capex reductions last year (something like 400 billion of delayed or cancelled projects), I knew that it's only a matter of time before it comes back to a decent level. India also showed increasing demand and looks like they're going to come in and replace any demand lag from China, so there's that too. Long term oil plays is where it's at.\n\n\nWe're of the same mind. May the market come to its senses before we run out of credit but not so quickly that the price different revert through the mean instead of to it.\n\nCheerio!\n", "score": 2, "replies": []}]}]}, {"body": "Honestly, it also doesn't have anything to do with breakeven prices for any producers.\n\nThe market is set by the costs of the lowest price producer only in a supply-driven market, but it seems clear to me that a broad-based commodities rally means there's been a fundamental shift for oil to a demand-driven market.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I'm not sure you understand what long means. I'm in it for the medium term, not a 1 week turnaround on profit.", "score": 1, "replies": []}]}]}, {"body": "You are a moron. Its not going back down to historical lows.\n\nHeres the fundamentals of oil.\n\nSociety needs it, and needs alot.\n\nIts not going back down you dumb cunt.\n\nHope this helps.", "score": 4, "replies": []}, {"body": "What's the average breakeven point for US producers? In different articles, I am seeing between 25 and 60 bucks. ", "score": 1, "replies": [{"body": "Defends on the source. Style of extraction etc. Deepwater drilling is profitable at a different price than shaleoil and oil from the gulf is different than oil from the north sea in terms of cost of refining", "score": 1, "replies": []}, {"body": "That's because every operation is different, even if they're using the same method.  The US has a very broad spectrum of costs across all the different methods.", "score": 1, "replies": []}]}, {"body": "Waiting to hear the debate between you and /u/dOZZYb", "score": 1, "replies": []}, {"body": "Oil has been volatile lately on both sides but obviously more to the bull side since the market is starting to think US oil companies are finally getting the dick shoved up their ass because of producing with a loss. There are both sides to the argument but I am leaning towards the bear since demand seems be faltering on the North America and European developed countries. Reading a report on Bloomberg it seems US consumer spending barely nudged and people are actually starting to save their money and as for Europe the crowd seems to be doing the same as well. Also there was a US consumer confidence report as well on Bloomberg and man if we have Americans who make under 15k a year believing the economy is hot well those making over 100k doing the opposite I'd put my money on the ones who make more.I know China would buy this stuff as well but holy shit they can't make everything for the world now since they know they are starting to be over capacitated and I love how their communist ass thinks that helping these zombie companies live is going to be the long term solution. I think going forward we will see supply drop as that should be a given but demand has always been a key as without you have no price appreciation and I get the feeling that people overlook this side of the equation. ", "score": 1, "replies": []}, {"body": "Another guy with a crystal ball.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ":)", "score": 1, "replies": []}]}]}, {"body": "Oil gonna hover at 50-55 all summer. ", "score": 1, "replies": []}, {"body": "Oil futures hitting $50 is not enough reason to hedge \"all in\", a year ahead. ", "score": 1, "replies": []}, {"body": "Saudi Arabia can bankrupt as many US drillers as they want. \n\nAs soon as oil increases in price, there will be investors lined up around the block to fund new ventures.\n\nThe whole idea of knocking out US production and then enjoying a competition free world is ludicrous.", "score": 1, "replies": []}, {"body": "Maybe they were on the verge of bankrupting themselves. ", "score": -1, "replies": []}]}
