{"title": "Walmart Beats $WMT", "selftext": "", "id": "4k1zen", "created_utc": 1463656961.0, "score": 45, "upvote_ratio": 0.96, "num_comments": 24, "comments": [{"body": "The market tried to bundle WMT in with retail and unfairly punished the stock over the last week. It's  CONSUMER STAPLES  with a sprinkle of clothing , middle class wage growth is stagnate and people do not want to spend $600 on a tshirt at Nordstroms. WMT up ho's down , this stock is breaking $70 and headed for the moon.   One position\n http://i.imgur.com/7AMTcKP.png", "score": 8, "replies": [{"body": "Dear god clear your notifications you filthy savage.", "score": 5, "replies": []}, {"body": "Why the fuk do u have so many things running in background", "score": 1, "replies": []}]}, {"body": "WMT is saving my ass right now. I pray this holds until open. My AAP calls and AEO puts are worthless, and I was looking for the nearest bridge.\n\nWMT positions:\n\n5 5/20 65 calls\n\n10 5/20 68.50 calls\n\n5 5/20 60 puts", "score": 11, "replies": [{"body": "Long all or did you write some?", "score": 2, "replies": [{"body": "Long all. I pretty much never write them unless I'm going iron condor. I've been mostly avoiding IC this quarter because it seems to me that earnings reactions have been more extreme than usual. I don't have any actual evidence to back that up though.", "score": 3, "replies": [{"body": "Gains are all the evidence you need ", "score": 5, "replies": []}, {"body": "Nearly all fortune 50p Q1s have went up or down 300-500bp, pretty ridiculous.", "score": 2, "replies": []}]}]}]}, {"body": "ROST is another discount retailer with earnings after the bell.  Discount retail is in.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "totally, dude", "score": 3, "replies": []}]}, {"body": "$WMT EPS beat of $0.98 to estimates of $0.88.  Revenue beat of $115,904 compared to estimates of $112,670.  Second quarter guidance raised from $0.98 to range of $0.95 to $1.08.", "score": 2, "replies": []}, {"body": "Hope to listen in on their earnings but have they started their 2 day shipping? Considering their demographic, i can't imagine it working too well.\n\nIn a shitty economy people shop walmart and target. ", "score": 1, "replies": []}, {"body": "Called that shit, but no position.", "score": 0, "replies": [{"body": "*guessed correctly but was really clueless so i initiated no positions", "score": 14, "replies": [{"body": "Called it and guessed correctly mean the same thing you inbred. ", "score": -8, "replies": [{"body": "yea but calling it correctly doesnt matter if you just guess on everything.\n\neven a broken retart is right once per earnings season", "score": 7, "replies": [{"body": "Sorry I have more ideas than I have capital, fucking faggot.  My moneys tied up and SPY puts that seemed much less risky than an earnings gamble, but I'm sure you're just upset because you we're short WMT, so I'll drop it.  Sorry about your 100% loss nerd.", "score": -5, "replies": [{"body": "Na hes right. Unless you put your money where your mouth is, no one gives a shit.", "score": 6, "replies": [{"body": "Go fuck yourself too, fag.  ", "score": -2, "replies": [{"body": "Intelligent retort. Can I have some more?", "score": 3, "replies": [{"body": "Look at his post history. He thinks jul 16 contracts means they expire on the 16th of July. He seriously knows nothing.", "score": 3, "replies": [{"body": ">July 16th my nig. I don't think they actually expire on the 16th however, thats just the date written.\n\nLOL", "score": 2, "replies": []}]}]}]}]}, {"body": "> less risky\n\nYou're on /r/wsb you idiot, we don't give a shit about your \"safe bets\". Stop being a fucking pansy.", "score": 1, "replies": []}, {"body": "lol. yea thats it. i put all my money on wall mart puts and now im mad at you. \n\ngot me.", "score": 1, "replies": []}]}]}]}]}]}]}
