{"title": "AMD", "selftext": "Up two percent in early morning trading, I'm up about 10%, thoughts on getting out? or staying in. ", "id": "4lv18y", "created_utc": 1464698846.0, "score": 36, "upvote_ratio": 0.86, "num_comments": 28, "comments": [{"body": "I'm up 31.84%. Staying in.", "score": 6, "replies": [{"body": "Up 148%.  In.", "score": 6, "replies": [{"body": "damn homie those are some nice gainz you got ", "score": 5, "replies": [{"body": "He lifts ", "score": 1, "replies": []}]}]}]}, {"body": "I was up 20% on a couple of hundred shares for a small profit, but I decided to buy another 3500 shares today. Everything seems to be going in the right direction for them, so why not.", "score": 5, "replies": []}, {"body": "Let me explain a few things that you might not know about AMD and why you should stay in or get out (depending on your risk tolerance). To preface, I bought stock at 1.89, 2.50, and 3.16 and here's why:\n\n- Zen architecture. This is their final, last ditch effort to remain competitive. They have lagged behind NVIDIA for a while now and they hope Zen can become their new staple child. So they have invested everything into Zen. It will come out EOY. This will make or break AMD in the long-run. Their chief engineer left shortly after finishing Zen (could it be that you felt he had finished his legacy or that he wasn't happy with Zen? who knows).\n\n- AMD, for the first time ever, has caught up to Intel hardware-wise in their servers. This puts them back in the competition for a major market pool.\n\n- Intel can't afford for AMD to go under due to anti-monopoly rules in Europe. They have actually started subtly supporting their competitor AMD abroad to keep them from going under.\n\nBasically, by EOY, my call is either $8 per share or $1.50. With a very high chance of $8 and a small chance of $1.50.\n\nEDIT: Overall, I'm up 88% and I would also invest in NVIDIA for their Pascale architecture coming out :P.", "score": 15, "replies": [{"body": "If you're referring to Jim Keller and you read up on his past with AMD you will see that it's no shocker that he leaves after every stint with AMD. His deal is that he likes to go work on new stuff after he did what he was hired to do. He's not cheap to keep around which is why AMD and others let him move around like he does.\n\nHe's currently at Tesla supposedly working on some kind of hardware that has to do with self driving cars.\n\nAlso I think you have your AMD code names mixed up: Polaris and then Vega are set to compete with Nvidia's offerings. Zen is a CPU and set to compete with Intel's offerings. The meeting later today (depending on where you are) is supposedly showing off Polaris and a new report say that a Zen demo is possible as well.", "score": 10, "replies": [{"body": "You are correct. I did mix that up. ", "score": 6, "replies": []}]}, {"body": "I'd like to see evidence of this supposed Intel support for AMD. I don't think Intel has any reason to do this, arguably they're not a monopoly anymore.", "score": 0, "replies": []}]}, {"body": "[There is a lot of hype today around their live stream tonight where they will be announcing a new line of GPUs.](https://twitter.com/AMD/status/735902495952777216). I bought on Friday at 4.50. ", "score": 3, "replies": []}, {"body": "Up 84.02% Staying in for a while", "score": 3, "replies": []}, {"body": "i'm fairly confident in tonight's announcement. If it meets or exceeds expectations the stock could skyrocket. Along with new announcements at E3, AMD could have another big spike.\n", "score": 2, "replies": []}, {"body": "https://twitter.com/amd/status/736557779050106880", "score": 2, "replies": []}, {"body": "Up at around 101%. Staying strong. ", "score": 2, "replies": []}, {"body": "Watching the Computex 2016 presentation, I am expecting a nice boost tomorrow.", "score": 2, "replies": []}, {"body": " if you're not a pc gamer, you have no clue how crazy it is for a $200 gpu to compete with a $400 gpu from nvidia", "score": 2, "replies": [{"body": "Im a pc gamer and realize how crazy this is. Should I buy AMD stock now or am I too late? If they do sell a bunch of RX 480s will their stock price rise?", "score": 1, "replies": []}]}, {"body": "It is starting to hit some major resistance points such as reaching 4.50 and the fact that it is also close to its previous resistance point of 4.57 that it reached 2 years ago and hasn't been able to break.  But, the stock is trending upward for it's yearly trend.  I believe that it will go up but it may actually go sideways for a week or two.  The RSI, MACD and resistances all say that this vast growth will stop. (in the short term)", "score": 5, "replies": [{"body": "To the person who downvoted me. I am still learning, as we all are, and thought that I would put my 2 cents worth in. If you feel I am wrong in my evaluation of AMD, please tell me why you think so. I believed my answer to be 10 times more useful than someone telling you how many gains they have made and said \"I'm staying.\"  But hey, I actually tried to give an answer.  Maybe I am in the wrong board.", "score": 12, "replies": [{"body": "Technicals are nonsense first of all, especially a stock like AMD where its return is going to be binary (zen is actually good or not)", "score": 2, "replies": [{"body": "Agreed. I wouldn't say that technicals are nonsense.  But, I would not depend on them with such a polarizing announcement coming up.", "score": 1, "replies": []}]}]}, {"body": "I have 500 shares at 4.26, so I'm happy with walking away but I also see this meeting tonight being big. Who knows, I think I should hold though ", "score": 1, "replies": []}]}, {"body": "The announcement on the ASBIS distributor might be good.", "score": 1, "replies": []}, {"body": "Bought some this morning. There was a recent report by I forget who that AMD has the potential to move up very soon.", "score": 1, "replies": []}, {"body": "I've been investing in AMD off and on during this month. Up about 7% right now. I'm staying in until they release the new graphics cards. I'm not really knowledgeable in the investing or economy field but I'd say that investing in both AMD and nVIDIA is a good idea right now since they've just released/will release new GPUs.", "score": 1, "replies": []}, {"body": "Is right now a good or bad time to be buying amd stock? I came over here from /r/hardware and /r/pcmasterrace because of how crazy of an announcement I thought vr gaming for $200 was.", "score": 1, "replies": []}, {"body": "I'm glad I got out when I did. \n\nAMD is gonna start its slide soon. ", "score": 0, "replies": []}, {"body": "Do you guys realise your gains are on simple interest terms?\n\nThat the Market average of 9 is compounded and not simple.", "score": -1, "replies": []}]}
{"title": "Thoughts on the poop industry and other..", "selftext": "Newbie here! I am 23 y.o. and decided to put an *x* amount aside in order to invest in prospect of future gains, let's say in order to retire an hour earlier (a *decade* wouldn't be that bad either) and enjoy the life. I've done some research here and there, but my exposure is still minimal and thus would appreciate any input on a couple of thoughts.\n\n1. Wastewater treatment/Fertilizer production. I recently stumbled upon [this video](https://www.youtube.com/watch?v=QV9x79_WYbk). \n **TL;DW:** The industry basically gets paid to \"clean up\" and is eventually left with ready-to-sell fertilizer as an end-product. Considering that the human population is rising and is prospected to reach even higher levels in the coming decades, doesn't that mean that there's only one way to go for these stocks? And then, what are the implications for places such as India and China?\n2. Crude oil. It is speculated that the last barrel will be pumped by mid-2030. Due to lack of reference (I remember reading this in some worldcounter statistics website) and for argument's sake, let's consider this to be true. Along with the 10-year low (〜30$) of early 2016 and the current 〜49$, won't prices skyrocket hereafter as the last reserves are being depleted? *And thus*, wouldn't now be the better time to direct capital towards that direction (the best being early 2016 and its 〜30 low)?\n3. This is going to be somewhat broader and more advice-oriented. I'm quite energized by my current line of work and thus have no plans of shifting into a full-time trader tracking market changes, news and such on a day-to-day basis (without however, meaning a need to be completely oblivious). I am merely interested in investing that extra income in what the future holds, in terms of aerospace, (bio)agriculture, biofuel and renewable energies, virtual/augmented realty and gaming, medicine (devices/instruments/biomed/nanomed/drugs), robotics, nanotech and alternative forms of currency (digital/crypto).\nMy budget isn't that insane. I have an initial 5k eu, while I'm considering to funnel another 250-500 per month into the \"project\" if all goes well. Since I'm looking to chip-in and wait while spending minimum time supervising the whole process, how do you suggest I proceed? Focus the € on an index, individual companies, or a little bit of both? In either case, which ones do you find promising and why? Furthermore, order stock or LEAP options?..Or perhaps, something along the lines of Betterment and the sorts?\n\n\nMuch appreciation for your time, and apologies for any text mess-ups, broken definitions, and other misfires :)", "id": "4lvkwb", "created_utc": 1464706327.0, "score": 5, "upvote_ratio": 0.67, "num_comments": 20, "comments": [{"body": "Shitpost", "score": 15, "replies": [{"body": "Literally ", "score": 1, "replies": []}]}, {"body": "I think you're meant to go all in on AMD and short TSLA.\n\nOf course by this I mean spend all of your money on options to do the previous.\n\nShorting TSLA means you won't have to work for much longer also.", "score": 7, "replies": []}, {"body": "You spelled paid wrong. GFY", "score": 6, "replies": []}, {"body": "1) Sounds great. Beware of getting smacked down by the EPA or whatever similar and having the industry effectively erased. \n\n2) the premise behind \"last barrel by ex date\" is not that we run out. Sure that may happen, but will take a fuckton longer than 20 years. Its more the idea that tech will make crude irrelevant. But I don't buy that happening in 20 years either. So... no run up due to scarcity. You can buy all the typewriters you want homes. \n\n3) dunno. GFY", "score": 5, "replies": []}, {"body": "x-post /r/showerfinance", "score": 4, "replies": []}, {"body": "I actually work in wastewater and had very similar thoughts, I'm just not sure what companies to look at. I know a lot of the industry giants, but I don't know where to begin. ", "score": 3, "replies": []}, {"body": "I mean I invest in shit anyway, might as well just go full faggot and invest 100% in literal shit. That is an appropriate end to my own divine tragedy. ", "score": 3, "replies": []}, {"body": "Buy 10Y Bunds", "score": 3, "replies": []}, {"body": "Oil prices are bounded by real, practically limits. On the low end, oil is bounded by the short-run shut-down production stopping price, on the high end, it is bounded by the next cheapest alternative, which has been falling for decades. Real Oil prices have likely seen their zenith already, no sense in investing there for any long haul. Your idea about investing in literal shit was less shit than this. GFY", "score": 3, "replies": []}, {"body": "/r/investing  \n/r/stocks  \n  \n", "score": 2, "replies": [{"body": "/r/investinshit", "score": 1, "replies": []}]}, {"body": "Welcome to investing, where we help you gain .50 a year and retire early. GFY", "score": 1, "replies": []}, {"body": "I actually have a connection to one of these types of companies. They are very interesting indeed and I like their financials.  I'm not invested in any though.", "score": 1, "replies": []}, {"body": "Can you hit the enter key please. That block of text is hurting my eyez", "score": 1, "replies": []}]}
{"title": "Someone on here said there were no more gains to be had from NVDA so..", "selftext": "", "id": "4lw3cc", "created_utc": 1464712281.0, "score": 90, "upvote_ratio": 0.95, "num_comments": 26, "comments": [{"body": "Down 90% on my put spreads ayyy ", "score": 11, "replies": [{"body": "[deleted]  \n\n  > This comment has been overwritten by [this open source script](https://greasyfork.org/en/scripts/10380-reddit-overwrite) to protect this user&apos;s privacy.  The purpose of this script is to help protect users from doxing, stalking, and harassment. It also helps prevent mods from profiling and censoring.  \n\n  > If you would like to protect yourself, add the Chrome extension [TamperMonkey](https://chrome.google.com/webstore/detail/tampermonkey/dhdgffkkebhmkfjojejmpbldmpobfkfo), or the Firefox extension [GreaseMonkey](https://addons.mozilla.org/en-us/firefox/addon/greasemonkey/) and click Install This Script on [the script](https://greasyfork.org/en/scripts/10380-reddit-overwrite) page.  Then to delete your comments, simply click on your username on Reddit, go to the comments tab, scroll down as far as possible (hint: use [RES](http://www.redditenhancementsuite.com/)), and hit the new OVERWRITE button at the top.", "score": 4, "replies": [{"body": "Top goldman sachs level analysis. My spreads are way too red to avg down. I'll just re-enter again", "score": 5, "replies": []}]}]}, {"body": "OTM calls at 52wk high, now thats what I call a fucking YOLO, the faggotest of delights", "score": 8, "replies": [{"body": "July calls tho, wasn't going all in with a blindfold on ", "score": 5, "replies": []}]}, {"body": "Idk why I even bother day trading, $NVDA boostin my portfolio while I sit on my ass all day, shoulda just went all in $NVDA. ", "score": 9, "replies": [{"body": "Idk man. Day trading is how I got the 40k to put into NVDA. Imo day trading enables me to make safer plays like this ", "score": 5, "replies": [{"body": "I'm being slightly sarcastic. I make way more day trading since I keep the great majority of my cash open for DT's, only a small chunk of my cash is in $NVDA. Still, when there's no trades to be made some days, and my portfolio is still up a nice chunk cause $NVDA is rising almost 5% a day, it feels good.", "score": 4, "replies": []}, {"body": "Not sure how you qualify this as safe. Got anything to hedge your position? Risking $38k to make $11k is poor R:R. I know they are July monthlies but a gap down could wipe out your position.", "score": 3, "replies": [{"body": "As someone who typically day trades AMZN weeklies with $5k this was pretty safe in comparison ", "score": 3, "replies": [{"body": "Sounds like your definition of safe is arbitrary. ", "score": 7, "replies": []}]}]}]}]}, {"body": "Where am I when ppl are making all these call outs ", "score": 3, "replies": []}, {"body": "This is almost certainly referencing me, read my post again\n\nIf you see I say there's potential for another 5-10% upside so that is not in opposition to what happened here", "score": 4, "replies": [{"body": "I have no idea who you are or what post you made\n\nIt was a bunch of comment on a \"Your moves tomorrow\" thread", "score": 3, "replies": []}]}, {"body": "Sweet mother", "score": 2, "replies": []}, {"body": "I wish I had your money", "score": 2, "replies": [{"body": "Post consistent gains first, yolo later ", "score": 17, "replies": []}]}, {"body": "Niiiiiiiiiiiiiiice", "score": 1, "replies": []}, {"body": "Finally sold my commons today. There was a big put buyer last week", "score": 1, "replies": []}, {"body": "So the AMD conference is going on now.  [What do you think of this?](https://i.imgur.com/qHjv2aN.png)\n\nLooks like Nvidia will still have the single fastest GPU and I assume they have some room to lower prices down a bit.  If you take away AMD's budget performance factor they're left with nothing, those that want MAX performance will always be getting two 1080s.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Oh this was the closing order. Was not holding into the AMD event today ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "I think it displays funny. Based on the math it looks like only 300 contracts. I think it is displaying the shares it represents. ", "score": 6, "replies": []}, {"body": "Why are the commissions so high? Like $1 a contract wtf\n\nI think I might need someone to explain the fees to me, because to me it looks like if you buy contracts with a strike price of $10 you're going to need a 10% increase to break even (assuming buying puts)", "score": -2, "replies": []}]}]}
{"title": "Epic YOLO on...Bogleheads?!", "selftext": "I came across this thread on Bogleheads.com the other day and had to share it here for people that haven't seen it. If you have seen it already, GFY, no one cares.  You all know Bogleheads.com as a place where those boring old Vanguard people congregate (like an even more r/investing version of r/investing) so you wouldn't expect their forums to have anything remotely resemble a YOLO on them.  But, WOW, there is a YOLO on here that makes 99.9% of what's on this sub seem tame. \n\n[Link to the thread](https://www.bogleheads.org/forum/viewtopic.php?t=5934)\n\nBasically, some guy that is an econ grad student with a slightly negative net worth follows the Mortgage Your Retirement (MYR) plan (leveraging your retirement by borrowing heavily to invest in a diversified stock portfolio).  This guy does *literally* everything wrong.  First, he starts investing in September of 2007.  Second, he goes heavy in financials and real estate.  Third, he starts with entirely too much leverage, especially relative to equity prices at the time. Fourth, he moves from limited downside intstruments (e.g. LEAPS) to unlimited downside instruments (e.g. futures) at a terrible time.     \n\nAs you can imagine, given his financial situation, timing, and investments, this goes south really fast.  He starts getting margin calls and forced liquidations almost immediately.  He continues to, over the course of the next two years, post collateral and pump capital into his accounts to fund this shitshow.  He maxes out credit cards, takes cash advances, takes on personal loans, borrows from family, etc as the market continues to drop.  It is like a train wreck you just can't look away from, but with the added twist of dramatic irony, since we have the benefit of knowing what ended up happening with the market, like a movie where a character doesn't know the monster is right around the corner but you do.  For example, there are threads around fall of 2008 where he and others in the thread are saying \"ok, as long as the market holds at 1200, it'll be fine!  Surely this is the bottom!\", and of course we know the market shed another ~500 points/40% more from that point, making it that much more entertaining.  \n\nHe actually remains remarkably calm throughout the whole thing, and it's impressive how much he comments and keeps up with it while going through the ordeal.  At one point I believe he had a net worth down around a negative quarter million.  Shockingly, he has since rebounded (as of late 2011) and managed to remain solvent.  He posted somewhat recently, so he is still alive and apparently with a positive net worth coming up on high six figures. The guy has brass balls and an iron stomach, even if he got off on the wrong foot due to a fantastic amount of hubris and a staggering lack of foresight.  Get a cup of coffee and a snack, because this thread is *long* but it is worth the read.  \n\n**TL;DR: Guy on Bogleheads heavily leverages himself into financials and RE stocks just before the 08 crash, goes 250k in the red, and somehow manages to stay solvent until market turns around and breaks even sometime in 2011. He is the true patron saint of WSB and we are all plebs compared to him.**\n", "id": "4lwrrh", "created_utc": 1464719987.0, "score": 57, "upvote_ratio": 0.94, "num_comments": 26, "comments": [{"body": "[deleted]", "score": 23, "replies": [{"body": "No, that's a level of autism that even we couldn't handle. ", "score": 14, "replies": [{"body": "I find your lack of faith disturbing.", "score": 5, "replies": []}]}, {"body": "We need his dad to bail us out, like he bailed market timer out.\n\nThe dude ended up making like $500k a year and retired in his early 30's with about a million bucks net worth.", "score": 2, "replies": []}]}, {"body": "Oh wow I had heard of this but I thought the end was that he first used loans to fund margin accounts, and then got completely fucked and ended up paying back the loans.\n\nThe nuts on that guy.\n\nSo he basically just held on and kept fuelling the margin?\n\nFucking gangsta", "score": 6, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Wait did he borrow before or after trading? The way you said it makes it sound like he got leveraged to the nuts using traditional leverage, and then borrowed so that he didn't have to liquidate everything, or am I reading it wrong?", "score": 4, "replies": [{"body": "He borrowed to trade.  He was following this paper this one professor wrote once about averaging out the risk you take over your entire life, rather than just at the end when you have the most money to lose.  The idea is great, and it'll probably work for most people, unless you're that guy.\n\nI was reading it and watching it unfold back then too, and it was amazing.\n\nAlso, he has a really well paying job (doctor or something), so it's not unexpected that he'd be able to pay off the loans he took over the past 8 years.\n\n*Whoops, didn't read the entire OP;  Apparently the OP explained it entirely.  I just saw the words Bogleheads, and YOLO, and knew which post he was talking about.", "score": 5, "replies": [{"body": "Christ I'm pretty tempted to do it tbh", "score": 6, "replies": [{"body": "The paper said that a low leverage amount, something like 1.2:1 is probably safe to do, and young people should do it, and then lower your leverage amount as you get older.  \n\nThe problem with LEAPS as posted in the OP is that you don't really know if your 1 year LEAP will be in the money enough to offset the costs, at the end of the term.  There are times, even during the last recession where 1 year wasn't enough for a recovery, if you went in at the wrong time.  \n\nFor example, if you got an ATM leap option in March 2001, you were in the red until somewhere around November 2003.\n\nIt boils down to requiring that you are very good at picking bottoms, which I believe is relatively difficult for most people.", "score": 5, "replies": [{"body": "It sounds like he suggested buying deep in the money leaps. It's essentially leverage, because you have the ability to buy the underlying asset at a later date once you have the money to purchase it. I'm not too sure of what type if interest rates are baked into the price of leaps though.\n\nI do understand his argument, and it is something I am definitely going to look into. I am in my early 20s, so using using $50k of leverage now is nothing, when my retirement goal is upwards of $3m. I can buy 2 year leaps on 50k worth of SPY, and exercise in 2 years once I've contributed 50k into my portfolio.", "score": 2, "replies": [{"body": "I understand the concept, but my concern with the strategy is that it's still quite risky because your deep in the money calls could have become and stayed an out of the money call at the end of the 2 years, as seen in the March 2001 example.\n\nIt's just like any leverage strategy, where in hindsight it looks brilliant, but the outcome is much less clear going forward.", "score": 1, "replies": [{"body": ">because your deep in the money calls could have become and stayed an out of the money call at the end of the 2 years, as seen in the March 2001 example.\n\n..but the most you can lose is what you put up.  You don't go in the red by a quarter million buying LEAPS, unless you buy them on margin. \n\n>It boils down to requiring that you are very good at picking bottoms, which I believe is relatively difficult for most people.\n\nEh, I think it's more about avoiding tops rather than picking bottoms. Had the guy invested literally another time than the time he did AND not leveraged so much AND not picked such specific (and terrible) investments, he would've been fine.  ", "score": 2, "replies": [{"body": "Unless I'm too old now, and forgetting something, he did indeed buy those LEAPS on borrowed money (edit to remove the word margin).  I don't know how old you are, but about 9 years ago (around the time he started), you could get credit card cash advances which were 0% for life, with 0% balance transfer fee, and you could get huge amounts even with minimal income.\n\n*edit:  I reread some of his posts, and this post describes his holdings somewhat: https://www.bogleheads.org/forum/viewtopic.php?p=73371#p73371\n", "score": 1, "replies": [{"body": "Yeah, he did that, too.  He literally borrowed every possible way imaginable.  But where he really got into trouble was buying stock and futures on margin, where he was subject to margin calls and forced liquidations.  The LEAPS were never themselves the issue. ", "score": 1, "replies": []}]}]}, {"body": "I understand your concern, but that's why the only people that should be using this highly leveraged strategy are those with a high risk tolerance. If I lose a large percentage of my retirement savings when I'm 25, I'll have more than enough time to make that back before I retire. ", "score": 1, "replies": [{"body": "For posting on a yolo board, I guess I'm still rather conservative.  For me, this strategy would fall under the \"toss at with money you don't mind losing\" basket.  I will admit however that if we experience another > 30% downward movement, I will probably throw a small portion of my account at this strategy.", "score": 1, "replies": [{"body": "I don't do all that much passive investing, so I would have a hard time putting a lot of my marbles into an index fund for the next 2 years. I'll probably end up in asset management at some point, so throwing money at a vanguard fund would be pretty painful.", "score": 1, "replies": [{"body": "I've learned my lesson thinking that I'm smarter than the average investor.  During the '08/'09 debacle, my account went down ~90% because I didn't know what risk management and diversification were.  It eventually recovered, but now I only play with money I can lose and not kill myself.\n\nFITB - bought around $17 thinking that since it dropped from ~$40, it couldn't fall much further.  It eventually bottomed at $1.", "score": 1, "replies": [{"body": "Wow, ~90% is brutal. My main priority has always been capital preservation. I guess leveraging with leaps wouldn't necessarily play along with that strategy though.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": ">He borrowed to trade. He was following this paper this one professor wrote once about averaging out the risk you take over your entire life, rather than just at the end when you have the most money to lose. The idea is great, and it'll probably work for most people, unless you're that guy.\n\nWell, yes, but he over-leveraged and with the wrong kind of leverage.  The paper called for 2:1 leverage, not 4:1 or 5:1.  Had he stayed with LEAPS (even purchased with borrowed personal money) he would've come out far ahead from his actual scenario, even if they expired worthless for a few cycles (assuming quarterly or semi-annual roll).  Instead, was using margin to buy long stock and futures, which meant he continually subjected himself to margin calls.  With LEAPS bought with cash, your max loss is the money you put up, even though it's still a leveraged position.  He subjected himself to losses far in excess of his position.  Not all leverage is created equal. ", "score": 1, "replies": []}]}, {"body": ">Wait did he borrow before or after trading?\n\nYes. \n\nHe borrowed before, during, and after, both external loans and credit cards and brokerage margin.  He started out leveraged both with his personal borrowing and also with his brokerage margin.  As his position moved against him, he borrowed more on the personal side to meet his brokerage margin requirements.  He talks in the thread about how his leverage factor depends on whether you include his personal debt in the equation.  He started out with a nominal leverage of 2x, but it was really closer to 4 or 5x if you included the non-brokerage debt. ", "score": 1, "replies": [{"body": "I'm not even mad, I'm impressed as fuck.\n\nWonder how the portfolio looks today.", "score": 1, "replies": [{"body": "Supposedly he is closing in on a million, but it sounds like he does other sorts of investing and not so much in the market.  It's a pretty unbelievable story (assuming its true).", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Holy shit ", "score": 2, "replies": []}, {"body": ">  He is the true patron saint of WSB and we are all plebs compared to him.\n\nHallowed be thy Boglehead YOLO Maverick!", "score": 2, "replies": []}, {"body": "I love reading content that is almost a decade old and pretending it is useful and fresh.\n\nI'm glad OP shares my affinity for stale shit.\n\n", "score": 4, "replies": [{"body": "http://i.imgur.com/vrwgKSG.png", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}]}
