{"title": "New trader in 338/333 SPY strangle exp 12/18", "selftext": "Hi r/options\n\nSince starting I've made some good buys and some bad ones. My first trade was TSLA 1000 call at 7 with TSLA at like 650, sold same day for 95, and then cried when the same option traded at 4200 the next day. Currently down 5$ or so on the year. Do you think this will get me back in the black? Thanks for the feedback.\n\n*edit* must clarify my expiration is a typo I missed.\nIt expires next friday 2/18. Also my break evens are at 133 and 139.80 on a 183 premium.", "id": "f3kbto", "created_utc": 1581642429.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 10, "comments": [{"body": "I feel you on the TSLA calls. I got in way too late since I was in other trades. \n\nSo a strangle (long) is useful if you think the price will drastically move up or down. The upside is unlimited and the downside is the amount of premium you paid for the put and call option minus commissions if any.\n\nSPY being an index isn’t the most volatile stock but since you almost a year DTE, this has a good chance of being in your favor. You’d have to calculate your two break-even points.\n\nIf SPY on 12/18 is between the two strikes, you’ll lose the max amount.\n\nAlso, if SPY moves favorably in one direction, it might be useful to look into rolling your PUT up a strike to protect your profits. YMMV, this could be expensive itself.\n\nOverall, I’m a novice myself and if I had the $3k to drop on a single position, I would hope this is a relatively safe bet.\n\nMy spidey senses tell me to watch out though since there be dragons near/after the election.\n\nGood luck!", "score": 2, "replies": [{"body": "Thanks for the feedback, I must apologize for not being correct on the rules of r/options\n\nI have the expiration wrong in my post to start- its 2/18- so next friday not a year out- and that position was entered at 183$.", "score": 1, "replies": [{"body": "Ah, I see. So do you have a strong belief SPY is going to drastically change in the next week? Keep in mind Monday is closed.\n\nMe personally, I don’t think you gave the trade enough time to widen, and have a good chance of expiring within the strikes. I’ll definitely follow along as I’ve always wanted to try a straddle.", "score": 1, "replies": [{"body": "My logic was pressure ahead of long weekend, and more pressure after long weekend, I need either another percent or so of either growth or correction on an all time high etf- plus I reasoned that the news out of China will be interpreted either up or down. It's my first strangle also.", "score": 1, "replies": []}]}]}]}, {"body": "From my experience the SPY is one of the hardest equities to make a profit from. It just never does or acts right. The options take too long to price and when they do the move in the other direction has already occurred.  It's on my \"do not fly list.\"   I would give you what works for me, but it may not work for you.  Use small delta's in your spreads when your  trying to find what works, and then gradual build out.  Aim small miss small.  Go for the bunts right now.", "score": 3, "replies": [{"body": "Thanks for the advice- I'll look to get out up and reroll", "score": 1, "replies": []}, {"body": "First time i read this about the SPY.... i have been making with the SPY 100 200 300 even 400% gain with this, check again your strategy", "score": 1, "replies": []}]}, {"body": "What did you pay for premiums/what are your break even points? I bet you will be fine.", "score": 1, "replies": [{"body": "My expiration is wrong- its 2/18, so next friday. I entered at 183 with break evens at like 139.80 and 133", "score": 1, "replies": [{"body": "Well 2/18 is Tuesday and the market is closed Monday that's 3 days of theta working against you.  I would see what happens tomorrow and consider closing if you can break even or maybe a loss.", "score": 1, "replies": []}]}]}]}
{"title": "OTM vs. ITM calls (NVDA IV Crush)", "selftext": "I have a question i can't seem to find answers for. I don't have enough experience to compare. I would like to understand the effect of IV Crush on calls during earnings. I understand that High OTM calls will be practically worthless after IV crush. What about ITM calls? \n\n-Before earnings, NVDA was roughly $270 per share.\n\n-After earnings, it's $288. \n\n-I own $270 strike 3/20 calls for NVDA, which is ATM. \n\n-Earnings happens, and my call is now far ITM (roughly $18)\n\nHow much does IV crush affect me? Do i lose money?", "id": "f3onk3", "created_utc": 1581664459.0, "score": 3, "upvote_ratio": 0.81, "num_comments": 15, "comments": [{"body": "Vega has its strongest effect ATM, so deeper ITM options suffer vega crushes but they are not as significant: think of a bell curve centered around ATM options. Your calls will suffer a IV crush but the price movement will offset it and you'll be most likely positive ceteris paribus.", "score": 5, "replies": []}, {"body": "As long as your call is ATM, the intrinsic value is there and IV crush cannot depreciate the intrinsic value which in your case is $18 per contact, so expect 18+ of profit when market opens. Congrats", "score": 2, "replies": []}, {"body": "in one more hour, you can tell us...", "score": 2, "replies": []}, {"body": "IV: People expect an underlying stock to jump.\n\nIV Crush: After the news, what you paid for the IV has now vanished. Stock no longer has surprises.\n\nATM Calls: If the stock jumped more than or relatively close to the price you paid for your contract, you win money. If no, you lose money. If you paid less than $18 for your ATM calls, you are about to collect some profit (and if NVDA keeps up with $288)", "score": 2, "replies": [{"body": "So for my case I lost money because earnings is what was moving the price right? even after all the good news?\n\nROKU- Entry @ 132\n\n$195 3/6", "score": 2, "replies": []}]}, {"body": "Great job!!! Happy for you! Consider getting a couple PUT positions if and when $NVDA sells off. Keep a lookout end of day for a mini sell off. And Puts are good price too.", "score": 2, "replies": [{"body": "Thanks for the heads up!", "score": 1, "replies": []}]}, {"body": "You will be gaining money in this case. The goal is to be ITM when it comes to buying options, but depends your entry point as well. You can sell the contract for profit tomorrow even before 3/20 expiration. IV crush will not do much damage for your option as much as it will for the weekly options.", "score": 1, "replies": [{"body": "Thank you for the response. I'm relieved to hear this. Do think i sold sell at opening or hold? Not too sure how this one is going to react...", "score": 1, "replies": [{"body": "It is gonna be volatile for sure since IV is high. The stock needs to stay above current level at $284 and go higher for your option to make even more money, if it drops closer to $270 at your strike price, your gains from the Pump will be taken back and then the IV crush will start to take a toll on your Call option the longer you hold.", "score": 2, "replies": []}, {"body": "You are in a decent position at $270 strike, it may break $300, we never know. If you have more than one contract, you can sell partial for profit and let the other contracts keep going.", "score": 2, "replies": []}, {"body": "Did you sell or holding? How do you like your profits?", "score": 2, "replies": [{"body": "I sold. It was roughly +900 for each call", "score": 1, "replies": []}]}, {"body": "I would Sell and then switch to PUTS.", "score": 0, "replies": []}]}]}]}
{"title": "1 contract AMD 7.70 2/14 40.5, current price is over $50. Am I missing something or is this literal free money?", "selftext": "[deleted]", "id": "f3xr9z", "created_utc": 1581710254.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 18, "comments": [{"body": "ya you're missing something allright", "score": 9, "replies": [{"body": "What am I missing. I’m seriously trying to ask this because I don’t understand why this person would sell their contract for this price?\n\nThe only thing I can think is that they bought a single contract at a lower premium, and then set a sale price at some point and didn’t check it. Does this make sense", "score": 3, "replies": [{"body": "the bid and the ask....\n\n&#x200B;\n\nthe 7.70 trade happened 2/06 9:52:18 market was 7.70 x 7.80 underlying was 48.16", "score": 3, "replies": [{"body": "Thank you for the response, seriously. I’m sorry if the title seemed stupid or condescending. I am really just trying to learn about all different types of securities. With options I keep thinking I understand things like the Greeks, and strategies, and then stupid stuff like this trips me out", "score": 3, "replies": []}]}]}]}, {"body": "If you can buy at that price it will be.  \n\nNotice the volume of 1.", "score": 3, "replies": [{"body": "I had the capital to cover the contract price ~$707, as well as the capital to cover the excessive 4050.00.\n\nI don’t understand why people are not giving me any real reason why this would not have been immediately profitable considering the volume of AMD and the premium/strike of this contract", "score": 0, "replies": [{"body": "There have been a couple people who have answered at this point, but what you’re missing here is that you’re looking at the “last” price and assuming that you would be able to get filled at the same price. With stocks, that works. With options, it doesn’t work that way.\n\nYou would never have been able to get filled at that price, and I’m 100% confident in that fact. Look at the bid price and the ask price instead.", "score": 3, "replies": [{"body": "Thank you for the response. Would you mind letting me know why “with stocks, that works”. Is it because of the volume or something else?", "score": 1, "replies": [{"body": "Just volume. There’s no liquidity at that price and no one’s written a contract for it since.", "score": 1, "replies": []}]}]}]}]}, {"body": "It has a current bid/ask of $14.35/$14.50", "score": 2, "replies": []}, {"body": "Very little open interest/volume, might be hard to get rid of when the time comes. Risky play.", "score": 2, "replies": []}, {"body": "Look in top where it says LAST PURCHASE that was the last price someone bought it at could be it was 2 years ago", "score": 1, "replies": []}, {"body": "I less you have a supercomputer plugged into the CBOE, you won’t need to be messing with options that expire in 10 minutes.", "score": 1, "replies": [{"body": "I found this option at 2PM. I checked 50 minutes later on yahoo finance, and my brokerage and found the same quote for the single contract.", "score": 1, "replies": []}]}, {"body": " 2020-01-13 12:09AM EST [40.50](https://finance.yahoo.com/quote/AMD/options?strike=40.5&straddle=false) 7.70 14.55 14.65 \n\nLast trade at that price was January 13th, when AMD was trading at $48-49.\n\nCurrent bid/ask is $14.55 - $14.65.", "score": 1, "replies": []}, {"body": "What is this beautiful trading app", "score": 1, "replies": [{"body": "It’s just yahoo finance. I just use it for quotes. There is an option to link your brokerage account to make trades within the app but I have not used this functionality so can’t say how it works\n\nI really like the market data tho because it shows news, and stocks, options, etc. It also has a “earnings this week” list on the home page which is cool", "score": 2, "replies": [{"body": "If you’re using it for quotes, set it to show the bid and ask if possible.  That is always what you should look at first as you’ll be able to trade it somewhere between those prices.  If not possible, don’t use it for option quotes.", "score": 1, "replies": []}]}]}]}
{"title": "Too late to buy Apple stock?", "selftext": "I bought some Apple stock today. While I do think it's overvalued, I don't see why it's value would stop growing any time soon, especially given our strong economy right now. Good to buy and hold for a few months at least?", "id": "f408lc", "created_utc": 1581720373.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 14, "comments": [{"body": "Not too late at all, it’s a buy and hold forever stock", "score": 22, "replies": []}, {"body": "Nope. I bought some last week. Apple is a great stock, good volatility and good dividend. It is insulated from other tech stocks and a solid part of any portfolio", "score": 5, "replies": []}, {"body": "Definitely.... A picture is worth a thousand words\n\n[https://www.grufity.com/historical-data-chart-graph/AAPL.FV/AAPL-Overpriced-or-Underpriced](https://www.grufity.com/historical-data-chart-graph/AAPL.FV/AAPL-Overpriced-or-Underpriced)", "score": 1, "replies": []}, {"body": "Why would u think it’s overvalued?", "score": 1, "replies": [{"body": "I think most things in the market are overvalued right now. Apple’s P/E ratio has gone up significantly from 16 to 25 in the past year but I think that metric exceeds their true performance", "score": 2, "replies": [{"body": "Well a higher P/E is a result of cheap money and low interest rates but it's also pricing in some future innovation from Apple that brand loyalists will buy because that's what Apple does.", "score": 1, "replies": []}, {"body": "I remember buying AAPL back in 2009 when the P/E was 7. Everyone said it was absurdly under-priced. Everyone was right. It's now my biggest holding and I'm up like 600% overall on it.\n\nI'd buy more now, but I'm already overweight. I haven't added to my position, other than dividend re-investments, since about 2016.", "score": 1, "replies": []}]}]}, {"body": "I had this question, too\n\nThen I came across this article: https://www.fastcompany.com/90461424/a-new-low-cost-iphone-is-coming-in-march-and-its-a-smart-move-for-apple\n\nIn short: it has room to run still", "score": 1, "replies": []}, {"body": "Wait till $225.... next earnings will be shitty and people will be dumping . If you can’t wait , start half a position now", "score": -4, "replies": []}, {"body": "If you look at apples price chart compared to it 12month average eps you will see the stock price following the eps chart fairly closely, and it has been sitting at a stable PE of 10-20. You can expect it return to that base.\n\nI’m not saying it’s a bad buy, I’m simply saying that you will likely see the stock underperform in the years to come, as the price return to a level that better reflects apples earnings potential.", "score": -1, "replies": []}, {"body": "TBH think Apple is the next Nokia. Too comfortable being a leader at the moment and slow at innovation.", "score": -14, "replies": [{"body": "Big fucking facepalm, u cant be serious rn", "score": 2, "replies": [{"body": "They’re pretty much riding on iPhone alone at this point. Not too good if something better comes along, just like iPhone displaced Nokia phones.", "score": -3, "replies": [{"body": "Um. Their biggest boomlet is now the Airpods", "score": 4, "replies": []}]}]}]}]}
{"title": "Is the stock market changing?", "selftext": "Well we all know what is happening with TESLA. A hype train, where it’ll go nobody knows! \n\nBut this brings me to my question, are we in a time now where the way people invest has changed? With how easy it is to invest these days, apps, fractional shares, zero fees, etc, are we moving into an age where stocks with the most hype around them are likely to move in one way or the other?\n\nI kind of see what I’m seeing with Tesla like what happened with Twitter influencing politics. We’re in a new age and social media and hype trains are influencing the stock market more so than ever before.", "id": "f3l33z", "created_utc": 1581645965.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 17, "comments": [{"body": "Hype and stock investing is not new. Stock prices have always had an emotional component.", "score": 12, "replies": [{"body": "Am I the only one who thinks stock prices are driven purely by the emotional component?", "score": 6, "replies": [{"body": "Not purely. But partially, yes.", "score": 5, "replies": []}, {"body": "It’s definitely not logic. Shit leaves me baffled at times", "score": 3, "replies": []}, {"body": "Some more than others?", "score": 1, "replies": []}, {"body": "It's about the demand.. A stock won't climb for no reasons...", "score": 1, "replies": [{"body": "Yes it will, systematic risk.", "score": 1, "replies": [{"body": "Do your MBA in finance before saying anything that you don't understand. Volatility is a direct cause created after an event. Stocks will lose value over depreciation. However, it won't climb, as I said, with magic. You need demand for this. Thanks", "score": 1, "replies": []}]}]}]}]}, {"body": "I appreciate your points about how technology has created faster feedback loops but one should contextualize the current situation. \n\nWe are nowhere near the mania of the dot com bubble.  You had all sorts of companies with nothing other than a website address - believed to be super important asset back then - and ambition, trading at pie in the sky valuations. At one point companies that were burning cash at a faster rate, were more highly valued as this was believed to be a good metric to ascertain who would dominate market share. The bubble burst and the feeding frenzy of hype went away. \n\nLikewise, if we ever see an end to the pools of cheap liquidity sloshing around the capital markets and an economic downturn, perhaps some of the market behaviors we see now might also dissipate. New technology always facilitates manias in novel ways but human mass psychology remains the same.", "score": 7, "replies": [{"body": "Appreciate some perspective. Hard to really gauge how different times were during significant moments in the American economy, specially if you weren’t of age during those moments", "score": 1, "replies": []}]}, {"body": "After a few hype trains people will get bored of it, dont worry. Those chasing hype end up broke", "score": 3, "replies": [{"body": "There’s a new sucker born every minute. Do not misjudge the stupidity of new traders", "score": 3, "replies": [{"body": "Yeah but the volume dies out, just look at Warren buffet; dude's just waiting till the idiots are done with the market", "score": 3, "replies": [{"body": "The ease of trading is bringing so many new people to the market. Even lesser volume in rapid succession (like after PR) is enough to manipulate a stock, that will bring veterans that will play the stock strategically and make their own money by betting puts etc...\n\nIt does seem like a new paradigm", "score": 1, "replies": []}]}]}]}, {"body": "The market is always changing. What hasn't changed is human nature. The emotions of fear and greed, the tendency towards recency bias tend to be ever present.", "score": 3, "replies": []}, {"body": "its been a hype train since the 1920's", "score": 1, "replies": []}, {"body": "Uhm, it changed forever like 3 times this century", "score": 1, "replies": []}]}
{"title": "Tesla Stock Potential", "selftext": "I bought a Tesla stock for around $220. I'm young so I am willing to hold it for a long time. \nBut realistically speaking what is the potential of this stock? When should I sell?\n\nI read some people believe it could reach 7K", "id": "f3mjrs", "created_utc": 1581652906.0, "score": 2, "upvote_ratio": 0.57, "num_comments": 21, "comments": [{"body": "Have you taken any profit yet. I’ve been holding since it was 107 keep telling myself to sell a percentage but have yet to do so", "score": 3, "replies": [{"body": "They hold one share so unless they are selling a fraction of a share then no.", "score": 3, "replies": [{"body": "Oh shit missed that part of the story. If I had one I think I would just hold it unless life required I needed to sell", "score": 1, "replies": []}]}]}, {"body": "I think Teslas run has just begun.  The price has been pushed this far based on amazing ideas, great products, a solid q4 earnings report, speculation, and of course hype.  If you believe Tesla will execute on its promises then this is only the beginning and the stock and company will continue to grow.  If you think it's all a load of bullocks and the company will not be successful then you should sell.", "score": 7, "replies": [{"body": "That shouldn't be the only thing you look at. Tesla is a very promising company, but you have to look at the valuations as well and that has a lot of investors doubting if Tesla right now is worth it or not.", "score": 0, "replies": [{"body": "Well that's what I am saying.  The current valuation does not justify the stock price.  The reason it's so high is because of the future value people believe it will have.  I have not been in stocks long but something I have learned is that numbers can only take you so far.  If you get too caught up in that you will lack the imagination to forsee what is possible.  And obviously the opposite can happen.  If you get too caught up in your own delusions you night ignore the reality of a balance sheet.  I think their needs to be a balance between reasoning and imagination when deciding for yourself the true value of a company.", "score": 0, "replies": []}]}]}, {"body": "These price targets are as good as nothing.  Many other organizations still maintain price targets under 400 dollars.  Stock prices are driven by humans not reality.  In reality Teslas stock should not be where it is.  Ford and GM have sold tens of millions of more vehicles then then they have.  People are valuing the company for where they believe it is going.  You need to ask yourself where you think the company is going and I think you will be able to answer this question for yourself.", "score": 4, "replies": []}, {"body": "potential should be like 10 trillion market cap in 5 years, underground bullet trains, anti gravitational mars spaceships, tesla 10g electric charging", "score": 3, "replies": []}, {"body": "I’m young as well and have full confidence in Tesla long term. With that being said, I sold all my Tesla stock yesterday (125% profit). I just don’t see it growing significantly in the next 18 months and believe there is currently more room to the downside than the upside based on the current price. \n\n\nFrankly nearly everything in the market is overpriced right now so if you plan on holding 5+ years just keep it. I parked about 40% of my earnings in CSIQ and CRON and took out the rest", "score": 1, "replies": []}, {"body": "I’m young and expect this go the way of the delorean.  16 years in a row of losses.  Take out the subsidies and it disappears,", "score": 1, "replies": []}, {"body": "Tesla is the only stock id ever buy because its delivering real value.", "score": -2, "replies": [{"body": "\"Real Value\" is not a line on a income statement or balance sheet.\n\nPlease define \"real value\".\n\nEdit: in fact, if you ever visited either of those documents for TSLA you'd probably stay away from the stock", "score": 7, "replies": [{"body": "Real value as in their company creates products that have a real value that will last long term. Most stocks don't offer real value on the same level as a Tesla.", "score": -7, "replies": [{"body": "So far a Tesla has not proven to be immune to depreciation.\n\nYou realize when you buy a stock you are buying the company, the books, not the product. You're implying their cars will either appreciate or can take over markets for vehicle classes they have yet to build assembly lines for... And again, their books are shit. There are many competitors, yes - they are not EV - but they are still competing for the same customers, that have far better books and tremendously more market share.\n\nThis \"real value\" thing seems pretty abstract.\n\nIt's OK to say it's a gamble on the future. It's a good gamble, but it's a gamble that is increasing in risk as Musk keeps up his antics.", "score": 5, "replies": [{"body": "> You realize when you buy a stock you are buying the company, the books, not the product.  \n  \nAnd the value of the company and its books is dependent on the product....  \n  \n> You're implying their cars will either appreciate or can take over markets for vehicle classes they have yet to build assembly lines for...  \n  \nI never implied that their cars appreciate lol.... They're already the leader in electric car space though.  \n  \nHere's the statistics that are telling me Tesla is delivering real value that isn't going to slow down anytime soon. Keep in mind, they're still in the building stages of the company and they've already had huge success. -  \n  \n[Largest fleet of Tesla police patrol vehicles start hitting the roads](https://electrek.co/2019/04/27/tesla-police-patrol-largest-fleet/)   \n  \n[Tesla's polarizing Cybertruck was preordered 200,000 times within 3 days](https://www.usatoday.com/story/money/cars/2019/11/24/teslas-cybertruck-preorders-reached-nearly-150-000-48-hours/4290463002/)  \n  \n(I can't find the official numbers but the Model Y will be coming out soon and theres going to be thousands of preorders for that)  \n  \nhttps://carsurance.net/blog/tesla-statistics/  \n  \n> 75% of all electric vehicles sold in the US in 2019’s first quarter were Teslas.  \n  \n> Tesla saw revenue of $21.461 billion in 2018. That’s an 82.51% increase from 2017. \n  \n>  The Tesla Model 3 is the most sold model of electric vehicle in the US.  \n  \n> Tesla’s Model 3 was the most sold electric vehicle worldwide in 2018 (including the US).  \n  \n> Tesla guarantees that the Model 3’s battery will retain 70% of its capacity after the first 120,000 miles.  \n  \n> Only wiper blades and tires need regular replacement on a Tesla.  \n  \n> Tesla’s Autopilot registers fewer accidents than human drivers.  \n  \n>  Tesla’s Model 3 is one of the safest vehicles around.  \n  \nhttps://www.statista.com/statistics/502208/tesla-quarterly-vehicle-deliveries/  \n  \n>  Annual deliveries rose by almost 50 percent between 2018 and 2019. Year-to-date deliveries increased to between 367,000 and 368,000 units in 2019, and Tesla delivered around 112,000 vehicles during the fourth quarter of 2019 alone. The quarterly figure represents a new record following the electric carmaker's previous quarter which set the record at 97,000 deliveries worldwide.  \n  \nhttps://cleantechnica.com/2018/10/04/25913-growth-in-tesla-sales-in-6-years/  \n  \n> 25,913% Growth In Tesla Sales In 6 Years  \n  \nhttps://www.tesla.com/sites/default/files/blog_attachments/gigafactory.pdf  \n  \n> Planned 2020 Gigafactory Production Exceeds 2013 global production  \n  \n[Tesla sold more cars in 2019 than in the previous two years combined](https://www.theverge.com/2020/1/3/21047233/tesla-2019-deliveries-q4-record-model-3-sales)  \n  \n[Within Weeks, Tesla Model 3 Will Be World's Top-Selling EV Of All Time](https://insideevs.com/news/391128/tesla-model-3-cumulative-sales-best/)  \n  \nShow me another car company that is experiencing this type of growth and expansion... I'll wait.", "score": 2, "replies": [{"body": "Other auto companies do not need to expand, build factories, etc. They are mature. Tesla is in a growth phase. You aren't comparing apples to apples. General Motors sold 7.7 MILLION VEHICLES in 2019; tell me how Tesla is \"eating their lunch\"?\n\nAnd you're cybertruck numbers are horse shit. Those are $100 reservations. Not preorders. Preorders happen when a product has passed development and is ready to hit the assembly line.\n\nYour a typical fanboy latching onto the \"real value\" tagline with no understanding of the industry, or Teslas financials. Your real value argument is right up there with musk saying \"buying a Solar City roof is like printing money\".", "score": 0, "replies": [{"body": "And where are they're stock prices?  \n  \nYou call me a fan boy when I shared 10+ sources showing its value lmfaooo. It looks like youre just cynical towards Tesla for some reason and not arguing in good faith", "score": 1, "replies": [{"body": "You showed articles outlining GROWTH. Growth does not mean value.  Stock price does not mean value either. Explain REAL VALUE. Stock prices can easily misrepresent the success of a company. See the GoPro chart for a great example.\n\nYour argument regarding stock price is a great lead into the argument that Tesla stock is overvalued. The only thing close to measuring \"real value\" would be EPS. Stock price is nothing without considering shares outstanding, EPS is not.\n\nAnyways you were waiting to hear about \"real value\" competition. Here it is...\n\nhttps://cleantechnica.com/2020/02/15/11-electric-vehicle-share-in-france/amp/?__twitter_impression=true", "score": 1, "replies": []}]}]}]}, {"body": "Someone’s bitter", "score": -4, "replies": [{"body": "He's not thought to be honest.\n\nPeople read this sub looking for advice and discussion and Tesla aren't making a profit yet. Saying it's gotten real value is simply wrong as currently they can't even break even over a single year.", "score": 3, "replies": []}]}]}]}]}]}]}
{"title": "APPL, MSFT, INTL, CSCO, FTEC...am I too heavy on tech?", "selftext": "I've bought those stocks in recent years. Doubt I'll ever sell MSFT or APPL, but wondering about the other two...Would you consolidate some of those holdings (maybe INTL and CSCO) into FTEC?", "id": "f3rnza", "created_utc": 1581684224.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 18, "comments": [{"body": "Short answer, yes\n\nLong answer, yes but...", "score": 10, "replies": []}, {"body": "The concept of \"tech stocks\" is something of an outdated notion, because so much of the economy is knee deep in tech. Microsoft (software; cloud) is hugely different from Apple (more high end consumer electronics and services) and both are totally different than Intel and Cisco (more tech materials). You want to be diversified so that everything doesn't move in the wrong direction at once, but I don't know if there is any reason to think that Microsoft and Apple will move in the wrong direction at once, or that they two others will at the same time as Microsoft and Apple (though Intel and Cisco are probably more likely to move together).", "score": 3, "replies": []}, {"body": "No. Speaking for APPL & MSFT.  \n\n\nTech is a broad spectrum with many different areas for development. Tech as an industry is the go to for future growth is my assumption.   \n\n\nI hold MSFT, AAPL, V, MA, AMD, NVDA", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "what?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "yeah but why would you sell Apple, they’re growing their services", "score": -4, "replies": []}]}]}, {"body": "Why would you sell APPL?? They are growing their services....", "score": 0, "replies": []}]}, {"body": "I sold MSFT in my brokerage and diversified to other stocks. I have MSFT in my index funds and it’s doing well.", "score": 1, "replies": [{"body": "Why cut your winners?", "score": 5, "replies": [{"body": "Not sure,", "score": 6, "replies": []}]}]}, {"body": "I suggest you get vgt.", "score": 1, "replies": []}, {"body": "I sold all my CSCO. I expect some kind of upwards return no matter how inconsistent and it just wasn’t doing anything", "score": 1, "replies": [{"body": "I'm buying more at the moment. They give a nice div to keep it up.", "score": 2, "replies": []}, {"body": "Same. Held for a year and I had much better gains elsewhere so sold it all", "score": 1, "replies": []}]}, {"body": "Think long term, do you think Microsoft and Cisco will continue to grow their revenues, profits and provides divideds in the next 5 years? If the answer is yes then continue to invests and costs average up or down.", "score": 1, "replies": []}, {"body": "Needs more Adobe.", "score": 1, "replies": []}, {"body": "Are those stocks the only ones you own?", "score": 1, "replies": [{"body": "Nope, own some others. UNH, TSLA, a few others including more etfs", "score": 2, "replies": []}]}, {"body": "Ask why you have them?\n\nBecause you believe it’s the new hot thing, or because you believe in something about those companies going forward", "score": 1, "replies": []}]}
{"title": "Fuck i want to buy TSLA bc i love the company but the stock seems to high", "selftext": "I dont want to buy it and then get fuked when it adjusts, but also maybe it wont and ill miss the train, wich i already missed but since i started investing money little time ago and didn't know stocks I can forgive.\n\nAnyway what do you think?", "id": "f3sq28", "created_utc": 1581689564.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 13, "comments": [{"body": "Then when it's 1500 you're gonna it's too high and then 2000 and so on...", "score": 4, "replies": []}, {"body": "Btw this is more of a long perspective but they are definitely leading as far as I can see in autonomy. And if you factor that in to your analysis then even at these levels I believe it's still a bargain.  This is more of a long perspective anything can happen short term.", "score": 4, "replies": [{"body": "Yes but my fear is buying, then it dips, then it grows but I'm still down for alot of time bc of buying in the wrong moment.", "score": 1, "replies": []}]}, {"body": "Even Tesla is selling shares at this price", "score": 7, "replies": []}, {"body": "Don't buy in all at once.  Buy some now (if you really need to) and save more and wait for a drop.", "score": 3, "replies": []}, {"body": "I would suggesting asking your parents since you don't have your own money with which to make a decision anyway.", "score": 3, "replies": []}, {"body": "If q1 is profitable I expect a surge because people are going to start getting excited about Tesla joining the s and p 500.  I think q1 is usually the worst quarter for auto industry and the corona virus set them back, but if they come out on top I expect it will go to 900 plus.", "score": 3, "replies": []}, {"body": "Look at the value, not the share price.", "score": 2, "replies": []}, {"body": "I've bought at a dip and sold TSLA twice over 30 days.  \n\nThere's gonna be a dip for sure. TSLA is a rollercoaster of volatility.  It dips and goes up, rinse repeat. \n\n \nI may not invest again it's too emotional, always fear it will burst, waking up early to check premarket. So far each dip just brings the stock up higher.", "score": 2, "replies": []}, {"body": "Same. Still waiting for my turn to come for fractional trading on my RH account.", "score": 1, "replies": []}, {"body": "Since when do you love the company?", "score": 1, "replies": []}, {"body": "It is too high.  Trust your instincts.", "score": 1, "replies": [{"body": "Don't doubt your vibe", "score": 1, "replies": []}]}]}
{"title": "Gaming PC for trading", "selftext": "Any thoughts on the following gaming pc specs to be used for trading? Listed for $1699.\n\nMSI Gaming Desktop Trident X Plus 9SD-462US Intel Core i7 9th Gen 9700KF (3.60 GHz) 16 GB DDR4 2 TB HDD 512 GB SSD NVIDIA GeForce RTX 2070 SUPER Windows 10 Pro 64-bit", "id": "f3x73y", "created_utc": 1581708026.0, "score": 0, "upvote_ratio": 0.18, "num_comments": 19, "comments": [{"body": "You can trade on potato pc man...", "score": 11, "replies": [{"body": "hell, just use an app on your phone. They make damn sure those things are up to snuff, at the very least", "score": 1, "replies": []}, {"body": "I totally googled it...😂 worth the laugh!", "score": -9, "replies": []}]}, {"body": "That processor is definitely gonna bottleneck your trade execution speed. Maybe overclock and do watercooling?", "score": 7, "replies": []}, {"body": "What makes you think you need this much fire power for trading?", "score": 4, "replies": [{"body": "Going off a recommended build, considered entry level. I run multiple charts on TOS, news w/ live videos and other research tools.  What would you recommend? Thanks!", "score": -1, "replies": [{"body": "I mean you could build it with those specs if you really like them for like 300$ off FYI.", "score": 2, "replies": []}]}]}, {"body": "I can’t tell if this is sarcasm", "score": 3, "replies": []}, {"body": "Not the most helpful comment but... lol", "score": 2, "replies": []}, {"body": "I could literally do that on my iphone lol", "score": 2, "replies": []}, {"body": "🤣", "score": 2, "replies": []}, {"body": "I custom built mine and saved a ton of cash. I don't like buying brand name gaming systems.", "score": 1, "replies": [{"body": "I would love to but not even sure where to start. You have a build sheet to share? Thanks", "score": 1, "replies": [{"body": "I bought i9 9900k, ASUS Maximus xi HERO mobo, 32 gig of ram, 2 Samsung 970 1tb m.2 ssd, 1200w PSU, nvidia GTX 1660ti, thermal take liquid cooling RGB, thermal take view 71 case RGB, 8tb backup HDD and 3 x 32\" curved MSI gaming monitors and a 43\" Dell P series trading monitor. All parts in it was 6800.00 CAD. And a wall mount for the 43\". I run the 43 above the 3x32\". Also bought a razor RGB keyboard and a Razor Naga mouse.", "score": 1, "replies": [{"body": "I should mention I bought them at memory express and I bought the 3 year complete replacement warranty on every part.", "score": 1, "replies": []}]}, {"body": "Use  [https://pcpartpicker.com/](https://pcpartpicker.com/)", "score": 0, "replies": []}]}]}, {"body": "Just go to Walmart and get a laptop or something.\n\nHonestly I would get 10th gen i7 or you could go i9 if you want to blow your money. 32 GB ram and turn off disk cashed. Then get an m.2 sad. You could get a 100$ gpu and be fine", "score": 1, "replies": []}]}
{"title": "Warren Buffett's Berkshire adds Kroger stock, scales back on Wells Fargo, Goldman and BofA", "selftext": "https://finance.yahoo.com/news/warren-buffett-q4-stock-moves-212218281.html\n\nWarren Buffett’s Berkshire Hathaway (BRK-A, BRK-B) snapped up a new position in grocery-store chain Kroger, the firm announced on Friday, while scaling back on key bank stocks.\n\nWhat’s more, Berkshire disclosed some modest-sized positions in the SPDR S&P 500 ETF (SPY) and the Vanguard S&P 500 ETF (VOO).", "id": "f3zfd7", "created_utc": 1581717022.0, "score": 28, "upvote_ratio": 0.84, "num_comments": 13, "comments": [{"body": "Kroger investment screams of Warren’s doing. Don’t know what Kroger’s moat is tbh, but they do have a cheap Price to FCF so I guess technically it’s undervalued", "score": 9, "replies": []}, {"body": "backing out of banks in case we go to negative interest rates?", "score": 12, "replies": [{"body": "He's barely \"backing out\", and on some of those banks he has to sell to stay under the 10% limit, because as they buy back stock, his percent ownership increases, so he has to constantly sell off bit by bit to stay under the threshold.", "score": 13, "replies": []}, {"body": "Moving more into noncyclicals is a good thing to do these days", "score": 3, "replies": [{"body": "they've increased their cash holding as well", "score": 1, "replies": []}]}]}, {"body": "Dude lost money on ketchup", "score": 5, "replies": [{"body": "A lottttt of money.  Mustard too", "score": 3, "replies": []}, {"body": "not on ketchup but mac and cheese.", "score": 2, "replies": []}, {"body": "Buffet holds stocks for a loooong time.", "score": 1, "replies": []}]}, {"body": "Anyone know what he added to OXY?", "score": 3, "replies": [{"body": "Doubled it", "score": 1, "replies": []}]}, {"body": "There is this massive corporate bofa building near me like 10 stories. it feels so dead. Could be vacant but i see cars go in and out\n\nI had BofA but I like chase better", "score": 1, "replies": [{"body": "You're basing an investment decision on an anecdotal obsevation regarding one specific office location?", "score": 2, "replies": []}]}]}
{"title": "With the introduction of Model Y Performance, Tesla now has 4 of the 5 most efficient EVs in America", "selftext": "", "id": "f3lw16", "created_utc": 1581649744.0, "score": 89, "upvote_ratio": 0.95, "num_comments": 18, "comments": [{"body": "Well... 3 of those 4 EVs are just different trims for the Model 3.  Granted, the different trims have different size batteries and vehicle weights.\n\nWhat would have been more useful and interesting would be to see the numbers in that table normalized for vehicle weight or battery size.", "score": 13, "replies": [{"body": "It's available here: https://twitter.com/matty_mogul/status/1225507756079230979", "score": 9, "replies": [{"body": "Nice!\nAnd all the Tesla models are at the top 😎", "score": 2, "replies": []}]}, {"body": "The dataset is now updated with weight-adjusted efficiency too\n\nhttps://www.kevinrooke.com/electric-vehicle-stats/us-ev-efficiency", "score": 3, "replies": [{"body": "Nice 😎\nNow you can see Tesla's lead", "score": 1, "replies": [{"body": "Change my mind:\n\nWe don’t measure ICE efficiency per weight. Why are electric cars different? I think this bias is because teslas are heavier and we want to see them on top. Adding the weight bias or “normalization” just tilts the whole thing in teslas favor. \n\nIf we want to be unbiased we should look at the data as is, not introduce our own bias, and recognize that teslas (despite being the best EVs out there) have some flaws like being heavy that need to be remedied. \n\nI much rather see tesla top the chart with their next gen batteries instead of adding a weight bias here and feel good for now.", "score": 1, "replies": [{"body": "Can't change your mind for you friend. That being said, consider this. Batteries are very heavy. If we don't normalize for weight, I can build you a very efficient EV by putting a tiny and lightweight 10kWh battery in it and using off the shelf electronics. I'll only get 80km of range maybe, but my kW/km rating will be great without doing any serious engineering, and I can sell the car super cheap to city dwellers. Meanwhile, serious EV producers like Tesla will put a much larger, and therefore heavier, battery in their cars in order to get 400+ km of range. As a consequence, using the unnormalized metric, the efficiency of the Tesla will come out looking similar to the cheapo car.\n\nIn conclusion, using an unnormalized metric would favour cars with small batteries, when what we really wanted was to know who has the most efficient powertrain/drivetrain.", "score": 3, "replies": [{"body": "Ok. I see your point. Very valid. \n\nMaybe a better way would be to normalize for range (aka usability)?\n\nThat way we remove the bias towards low range models that benefit from being lightweight.\n\nMiles per kilowatt hour multiplied by range. (With weighting to not skew the chart like crazy perhaps)", "score": 2, "replies": []}]}]}]}]}, {"body": "That will be better for tesla. The bolt makes huge concessions for efficiency", "score": 1, "replies": []}]}, {"body": "Looks like Hyundai is also pretty impressive with their battery efficiency then! Thought Tesla was further ahead with the efficiency then the competition.", "score": 5, "replies": [{"body": "That’s because they have a smaller battery and are therefore lighter which raises efficiency. \n\nSo more efficient by less weight instead of advanced battery (pack).", "score": 13, "replies": []}, {"body": "Ioniq is efficient because it has a tiny battery and therefore teeny tiny range, PLUS it has very anemic performance.\n\nTesla’s feat is as impressive as a BMW 340i having equivalent efficiency to a Prius!", "score": 4, "replies": []}]}, {"body": "Can someone explain the discrepancy here (and its for all vehicles).\n\nkWh / Range is a far lower Wh/mile than any of the posted efficiency numbers.\n\nFor example Model Y is a 75 kWh (75000 Wh) pack with 315 miles range.   \n That works out to an efficiency of 238 Wh/mile. But the most efficient number listed is 261 Wh/mile in city driving.  Whats going on here?", "score": 1, "replies": [{"body": "Usable battery is sometimes lower than the total battery capacity that automakers advertise. All Wh/mile numbers come from the EPA, so that's the important metric to follow (standardized across all automakers).", "score": 1, "replies": [{"body": "But that makes the calculations further apart.\n\nSay there is only 70 kWh usable in the Model Y pack.\n\nThat works out to 70,000/315 = 222 Wh/mile - even further from the listed Wh/mile.", "score": 1, "replies": [{"body": "I'd take the total kWh numbers with a grain of salt. It may actually be that 75kWh is usable, and the pack is actually 80kWh. We don't know for sure, especially with Tesla. Since the Model 3 came out, they've become a lot quieter about the true capacity of their batteries.\n\nI've got more faith in the EPA numbers. They run all vehicles through the same testing procedure.", "score": 1, "replies": []}]}]}]}, {"body": "Tesla starts from $40k and most of the competition is just below between $31k - $38k, so no wonder Model 3 is killing it.  \n\nIn Europe the shipping and other fees make it less viable, so it's not #1 in every country.", "score": 1, "replies": [{"body": "There's much to argue with in that little statement, though nice username.  Much of the competition is more expensive.  For those that cost less, Model 3 has much longer range, and if you look at $/mile of range Tesla is king (by a mile), so it's not as easy as \"oh they're more expensive, of course they're more efficient.\" That's before toys like autopilot and Superchargers too, not to mention positioning in the luxury car segment and superior performance, so that extra cost isn't some flippant excuse for extra efficiency, that's just not how it works.\n\nYes, Tesla is more expensive in other countries, but that's primarily due to VAT and taxes that apply to all cars, and the rest is common to all imported cars.  Tesla is killing it in Europe already and China is taking off fast, and with factories opening on every continent the last piece of added cost over the competition (shipping, logistics and delay) will soon be a thing of the past.  Tesla is already selling furiously in Europe even without a local factory.", "score": 2, "replies": []}]}]}
{"title": "WMT Put Spread Earnings", "selftext": "So, after being a bull on WSB forever. I decided to actually **try** and do something smart.\n\nI opened up my first Put Spread on WMT for next week. I kept it small so if I fuck it up, I don't go entirely broke. Am I doing this right?\n\nI expect WMT to go up a little bit after earnings so I bought a 2/21 117p and sold a 2/21 118p. \n\nDid I do this right? Or should I claw myself back to WSB. Should I go to expire or close earlier?", "id": "f3tehw", "created_utc": 1581692710.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 12, "comments": [{"body": "[deleted]", "score": 4, "replies": []}, {"body": "i think it's a reasonable play considering how flat it's been since last ER - it's still basically 50/50 since you're betting on ER except you benefit from not being IV crushed.  Assuming WMT beats and there is little selling i'd probably wait until closer to expiry to close.  If it beats and there is a lot of back and forth then i might close to not risk it.", "score": 3, "replies": []}, {"body": "further out than a few weeks is better end of march expiry is your friend because if it moves against you there is still hope / time to make it back", "score": 2, "replies": [{"body": "He could always roll it out and down though", "score": 1, "replies": [{"body": "I’ll see how it goes next week before earnings and close for a further out position", "score": 1, "replies": []}, {"body": "Tastyworks says you should usually ‘take the lumps’ when defined risk trades go against you. Or at least that’s what their research says.", "score": 1, "replies": [{"body": "Totally disagree", "score": 0, "replies": []}]}, {"body": "Not always. If your weekly short put goes in the money, it’s extrinsic value collapses for the most part. What that means is that you won’t be able to roll the spread out without a debit. If it was a monthly, then it’s still possible since there’s still some extrinsic value left.", "score": 1, "replies": [{"body": "True. Can always sell another to counter the debit.", "score": 1, "replies": []}]}]}]}, {"body": "Yes, now just continue doing the same every time and you're on your way to profits", "score": 2, "replies": []}, {"body": "I sold a week prior prior earnings and exited Friday morning.   Im hoping to jump back in after ER", "score": 1, "replies": [{"body": "I’ll see how it goes Tuesday. I may close them and get further out positions.\n\nI’m going to start some other types of spreads as well since I’ve been losing money too long in the bull gang on wsb.", "score": 2, "replies": [{"body": "Ya welcome to da club.  Buying options is a losing low probability Game.  I think Walmart Er is before the bell", "score": 1, "replies": []}]}]}]}
{"title": "First time advice", "selftext": "I decided to try Put Credit Spreads on $MSFT with the dip from FTC and Jedi ruling. Timed the drop today around 11:40 when it hit 183.05, missed slightly on timing and sold the spread when price was 183.20. Sold the 2/21 182.50p and bought 2/21 180p. Delta gap is ~20.5.\n\nCredit - .75/75 per spread. \n\nDid I do it right?\n\nEdit: I'm pretty sure this one is pretty risky but I was holding msft calls all this week and think I got a good feel for where the lower resistance is. I also plan on cashing out once it hits ~25% of max profit unless I'm sure it's going on a big run up.", "id": "f3xsrf", "created_utc": 1581710418.0, "score": 5, "upvote_ratio": 1.0, "num_comments": 8, "comments": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Yeah there was a nice bump in premium by going out another week or two, but I wanted my first one to expire within a week so I could get a feel for how it all works.\n\nIf it's looking good next week i will roll them out longer. Wanted to do iron condor for max profit but I don't know if I trust that will stay under 200 for the next month.", "score": 3, "replies": [{"body": "I agree, in this market stocks can go bananas to the upside in no time.", "score": 1, "replies": [{"body": "And in particular with this one being the wsb stock of the month, I didn't want to risk it.", "score": 3, "replies": [{"body": "I understand, Their pressure on it probably goosed the premium a bit. I sold them a bunch of $195 calls for this week on MSFT after Monday.", "score": 2, "replies": [{"body": "I had a bull debit spread 187.5/1.95 expiring next week. Should have sold when it opened at 190 tuesday but held through the dip and then sold as soon as it got back over 185. Still made a couple hundred bucks but probably should have held those.", "score": 2, "replies": []}, {"body": "Bet those 195 paid out nice, especially after it dipped below 183", "score": 2, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/comments/f1ww8t/what_are_your_moves_tomorrow_february_11/fhbxjzs/?context=3\n\nYeah they all laughed at me.", "score": 2, "replies": [{"body": "😂😂😂", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
{"title": "People about MSFT the last few day’s: Please STFU", "selftext": "[removed]", "id": "f3jp7w", "created_utc": 1581639626.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 13, "comments": [{"body": "I learn by experience , asshole", "score": 4, "replies": [{"body": "If you guys actually learned it would be okay. But it’s the same fucking posts over and over. Same clowns buying the top and chasing a stock and then whining when their garbage play doesn’t play out.", "score": -1, "replies": []}]}, {"body": "Hard Ban. Too much 💩  posting on this sub.", "score": 3, "replies": [{"body": "You’re likely one of the people I’m referencing haha. Uneducated", "score": -1, "replies": [{"body": "Why did MSFT drop? Do you know when it’s going up?", "score": 1, "replies": []}]}]}, {"body": "Ok Boomer", "score": 1, "replies": []}, {"body": "Good things come to those who lick da nutella.", "score": 1, "replies": []}, {"body": "Wow. This dickhead boomer spewing facts with his crystal ball.🔮", "score": 1, "replies": []}, {"body": "Msft 200 calls are still good tendies as long as their 3/20 and further", "score": 1, "replies": []}, {"body": "Yeah cool. Did you want fries with your sandwich?", "score": 1, "replies": [{"body": "Yeup.", "score": 1, "replies": []}]}]}
{"title": "Bloomberg: Rite Aid’s Odds of Finding Suitor May Improve With Sprint Ruling", "selftext": "This article was published earlier this evening.\n\n [https://www.bloomberg.com/news/articles/2020-02-13/rite-aid-s-odds-of-finding-suitor-may-improve-with-sprint-ruling](https://www.bloomberg.com/news/articles/2020-02-13/rite-aid-s-odds-of-finding-suitor-may-improve-with-sprint-ruling) \n\nToday was a good day for Rite Aid, it closed up about 5% after trading up 12% earlier in the day.  As of 1/31, 36% of the float was short.  This was our highest volume day since Jan 15.  New CEO to reveal strategic plan on St Patricks day.\n\nLastly, an article from last fall about some of the difficulty Amazon was having with their pharmacy ambitions:\n\n [https://www.cnbc.com/2019/08/06/amazons-pillpack-expansion-faces-resistance-from-cvs-and-walgreens.html](https://www.cnbc.com/2019/08/06/amazons-pillpack-expansion-faces-resistance-from-cvs-and-walgreens.html) \n\nBuy stocks or calls in Rite Aid.  There are too many stocks shorted and tons of longs underwater since the last walgreens merger fell through, most of whom wouldn't consider selling for less than they paid.", "id": "f3m5fn", "created_utc": 1581650966.0, "score": 13, "upvote_ratio": 0.85, "num_comments": 15, "comments": [{"body": "What is this, 2017? I was initiated with RAD and sold low. WHY DO I WANT TO BUY CALLS?!?!", "score": 4, "replies": [{"body": "You were robbed in 2017, I'm sorry for your loss.  I think a lot of the problem was #4 on this list:\n\n[https://stevetobak.com/2018/12/26/the-worst-ceos-of-2018/](https://stevetobak.com/2018/12/26/the-worst-ceos-of-2018/)\n\nIncidentally, the DISH ceo was also on that list, and he's gone now too.  If RAD works out maybe the betting on their new CEO will work out as well.", "score": 2, "replies": []}]}, {"body": "Fuck are we going to have another RAD fiasco? That shit was humiliating and hilarious.", "score": 4, "replies": [{"body": "RAD strained my marriage last time.     \n     \nBut, I'm ready to be hurt again.       \n      \n...even tho I know diddly about that industry. What calls are we buying, fellas?", "score": 3, "replies": [{"body": "Aye, pass and she'll stay.\n\nBut years from now, dying in our beds many years from now\n\nwould you be willing to trade all the days from this day to that\n\nfor one chance, just one chance\n\nto come back here and tell Cerberus\n\nthat they may take our wives\n\nbut they can never take\n\nOUR TENDIES!\n\nEdit: jk please be responsible.  Anything after st Patrick's day or the first week of April should be higher, they didnt set earnings date yet", "score": 3, "replies": []}]}]}, {"body": "Lol this is my local hood rite aid in the picture.\n\n12th street bart station and broadway. Coakland ca ✊🏽", "score": 3, "replies": [{"body": "Ask them if their stonks will go up.", "score": 1, "replies": []}]}, {"body": "between long stocks and calls, I'm up a ton on this stock.  3/16 is a big day for us RADtards", "score": 3, "replies": [{"body": "It's totally insane that the stock ever went so low.  I think 2020 is going to be huge for rad.  At some point the analysts are going to come out with updated price targets and upgrades,  and the bad quarters under standley are going to drop out of the TTM.", "score": 2, "replies": []}]}, {"body": "I'm gay", "score": 4, "replies": [{"body": "Are you trying to become a mod?", "score": 5, "replies": []}]}, {"body": "What positions in Rite Aid do you have right now? LEAPS?", "score": 1, "replies": [{"body": "I am not in to options yet.  I own a few thousand shares", "score": 2, "replies": []}]}, {"body": "I just doubled down today lol", "score": 1, "replies": [{"body": "Nice.  I am tempted to get more tomorrow.", "score": 1, "replies": []}]}]}
{"title": "🚀🚀 Gearing up for another Tesla liftoff", "selftext": "", "id": "f3nd26", "created_utc": 1581657105.0, "score": 81, "upvote_ratio": 0.93, "num_comments": 16, "comments": [{"body": "Cash gang... Niiiiice....\n\nWhat are you still holding?", "score": 24, "replies": []}, {"body": "Get suuuuuum\n\nPost positions or get mauled by a gay bear", "score": 26, "replies": []}, {"body": "I hopped back on that train today...\n\nYeah, it might dip for a week... but it might jump up $500 for no reason", "score": 6, "replies": []}, {"body": "1k tm confirmed", "score": 6, "replies": []}, {"body": "Just stop shorting Tesla. Elon is killing the boomer hedge funds so there will be no bears on the moon. Daddy Elon is so amazing you can still make money at a horrifically OTM strike price, bears are fuck.", "score": 3, "replies": []}, {"body": "You and me both. I can't wait!", "score": 2, "replies": []}, {"body": "This post aged like milk in pre market", "score": 2, "replies": []}, {"body": "stock offering at like 740. price is going down.", "score": -2, "replies": [{"body": "Clearly that's why TSLA went up...\n\nIt's a trade for me...a very profitable trade... But don't bet against papa Elon...", "score": 5, "replies": [{"body": "If Elon had more companies to buy, I'd be all in\n\nNeed a $ELON", "score": 8, "replies": []}]}]}, {"body": "This guy didn't hear about the recall?", "score": -4, "replies": [{"body": "Non story, ban", "score": 24, "replies": []}, {"body": "None of that shit has harmed Tesla.\n\nEven if it was news, its only a few cars\n\nGo ahead and short it...", "score": 7, "replies": []}, {"body": "2 bn extra cash >>>>>>> 15 000 vehicles recalled. \n\nthat recall news was just gobbled by the stock rally. Papa Musk taking us to Mars boys", "score": 3, "replies": []}, {"body": "Tis just a bolt", "score": 3, "replies": []}, {"body": "Insurance takes care of all costs. There are recalls of every car model in their lifetime. Plus, this was just a small number of Model X's recalled compared to let's say VW's EPA lie.", "score": 1, "replies": []}]}]}
{"title": "Intel Puts", "selftext": "[removed]", "id": "f3pl75", "created_utc": 1581670823.0, "score": 1, "upvote_ratio": 0.55, "num_comments": 15, "comments": [{"body": "That would be the most retarded advice ever! I love AMD and their products but Intel is still the market leader and even if they lose the leader position they can still land huge profits. You have a huge market with only two players unchallenged, even if AMd beats Intel they are still ok", "score": 6, "replies": [{"body": "Up 90% so far :))))", "score": 2, "replies": [{"body": "Good for you! Nice call!", "score": 1, "replies": [{"body": "More luck than anything, could have bought in a little bit later and would have made more but hindsight is 20/20", "score": 1, "replies": [{"body": "I think it may still go a down more", "score": 1, "replies": [{"body": "Yeah I think Tuesday is going to be a interesting day:)))", "score": 1, "replies": [{"body": "Called it. Tomorrow is either going to be sell off or it's going to spike a little bit. Trend still downwards I think", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Agree. This market is gonna get huge. Don't short the banana market because the blueberry market just grew.", "score": 1, "replies": []}]}, {"body": "Apple is dumping Intel processors in the near future for their Macs, Intel stock will go down the day when this new Mac is announced.", "score": 4, "replies": []}, {"body": "Thanks, I'll get calls", "score": 3, "replies": [{"body": "Did you?", "score": 0, "replies": []}]}, {"body": "Intel has been doing buybacks so large, it makes my peepee micro soft just thinking about it. \n\nTheta gang gonna steal yo tendies", "score": 3, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Intel is in a lot more markets than just the cpu game. Im long amd but thats just dumb advice", "score": 1, "replies": [{"body": "Hope you sold", "score": 1, "replies": []}]}]}
{"title": "Time For AAPL Puts?", "selftext": "[removed]", "id": "f3rm11", "created_utc": 1581683931.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 12, "comments": [{"body": "Get a load of this fucking guy. AAPL puts are big gay", "score": 14, "replies": [{"body": "But gay bears on gay stocks are non-gay. It’s a double negative.", "score": 1, "replies": [{"body": "Stfu", "score": 2, "replies": [{"body": "No u.", "score": 1, "replies": []}]}, {"body": "Make sense I'm in", "score": 1, "replies": []}, {"body": "Too much dick diligence for me", "score": 1, "replies": []}]}]}, {"body": "Bull dick in AAPL bears rear ends. Enjoy.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I’m gay for Apple, but I’m even gayer for correction-derived tendies.", "score": -1, "replies": []}]}, {"body": "No; No", "score": 3, "replies": []}, {"body": "Interesting analysis. Hold on while I X^-1 you", "score": 1, "replies": []}, {"body": "Which puts are you buying I might be selling the same ones", "score": 1, "replies": [{"body": "I’d have to sell all of my TSLA calls first, I don’t know if I’m autistic enough yet.", "score": 0, "replies": []}]}]}
{"title": "TGT on sale?", "selftext": "[removed]", "id": "f3sq90", "created_utc": 1581689591.0, "score": 5, "upvote_ratio": 1.0, "num_comments": 14, "comments": [{"body": "You dont think holiday sales, which literally happen every year, arent priced in?", "score": 5, "replies": [{"body": "shhhh....let him buy deep OTM calls...", "score": 3, "replies": []}, {"body": "Nah it’s free money bro just siting on the table", "score": 1, "replies": []}, {"body": "Priced in, sure, but it’s currently on a nice dip with lots of positive upside.", "score": 1, "replies": []}]}, {"body": "i was thinking of picking up some 120C in March", "score": 2, "replies": []}, {"body": "Will they crush more than last year’s holiday sales? Have they opened more stores? Have they expanded? Have they opened more SBUX inside their existing stores to get more white girls shopping?", "score": 2, "replies": [{"body": "Flair checks out", "score": 1, "replies": []}]}, {"body": "I’m buying 3/20 125 to hold through ER.", "score": 2, "replies": []}, {"body": "in all seriousness, what is it about target thats doing so well, when every other retail company besides wallmart and amazon is going through the shitter?", "score": 1, "replies": [{"body": "$BECKY and their $KAREN mothers swiping cuck dad’s card.\n\nIt’s the last brick & mortar for middle class suburban women to be seen shopping.\n\nThe $DONNAs shop at Neiman, Barney’s, and Nordstrom’s.", "score": 1, "replies": []}]}, {"body": "Uhh am I suppose to tell him that shit is announced DAYS after 12-25 and they whiffed on sales?", "score": 1, "replies": []}, {"body": "In January, they announced disappointing holiday sales, which caused a price plummet. This may rule out a huge drop during earnings, but keep in mind they maintained 4th quarter estimates so who knows.\n\nCoronavirus news took them down to \\~110, and I picked up 35 135C MAR20 and 27 140CMAR40. Some, I will ride to the earnings gate and some beyond into Valhalla.\n\nAnecdote: saw a guy on here posting on here about all the \"retards\" he sold naked 120P to because TGT premium was so juicy. That was a day before the January report... IV was high for a reason.  Ouch", "score": 1, "replies": []}, {"body": "Always spikes after releases check the past year", "score": 1, "replies": []}]}
{"title": "The Truth About MSFT", "selftext": "[removed]", "id": "f3srje", "created_utc": 1581689759.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 11, "comments": [{"body": "I like pp", "score": 6, "replies": [{"body": "Dw we know you do", "score": 3, "replies": []}, {"body": "Imagine being a bloomberg reporter coming to wsb looking for a scoop and this is all they find", "score": 2, "replies": [{"body": "It's solid DD bro....", "score": 1, "replies": []}]}]}, {"body": "There’s been 500 of this exact post ban these idiots they’re so annoying", "score": 7, "replies": [{"body": "wahhhhh. I’m a little baby. Let me guess.... you were holding weeklies", "score": 0, "replies": [{"body": "I have March 19 2021 calls you fucking idiot", "score": 2, "replies": [{"body": "ur so smart! the retard is actually Warren Buffet", "score": 1, "replies": []}]}]}]}, {"body": "It was just their time of the month. They had their first period. Don't worry, these things only last a few days.", "score": 2, "replies": []}, {"body": "Red just means it's going up in the other direction.", "score": 2, "replies": []}, {"body": "Going down is still going up if you’re upside down", "score": 2, "replies": []}]}
{"title": "AMD and the Great IV crush", "selftext": "[removed]", "id": "f3tjfa", "created_utc": 1581693271.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 12, "comments": [{"body": "shut up nerd", "score": 5, "replies": [{"body": "Every time lol", "score": 2, "replies": []}]}, {"body": "No, no thoughts.", "score": 1, "replies": []}, {"body": "Buy OTM for July or further on a dip and you’ll reap the tendies on the other side my brother.", "score": 1, "replies": []}, {"body": "so sell calls you fucking nerd", "score": 1, "replies": []}, {"body": "According to my professors at Georgia University at Harrisburg, IV crush is priced in", "score": 1, "replies": []}, {"body": "Compare IV for near and far dated options. Don't forget Vega. Vega will fuck you sideways if you're not careful.", "score": 1, "replies": []}, {"body": "50% isn't that bad", "score": 1, "replies": []}, {"body": "What would come up over the next few weeks to crush IV? Why wouldn't it just keep going up until earnings?", "score": 1, "replies": []}, {"body": "My sincere hope and prayer for you, is that someone picks you up, puts your head in a toilet, and flushes it repeatedly", "score": 1, "replies": []}]}
{"title": "I’m new here. Looks like I’m suppose to all in MSFT option calls, but...", "selftext": "[removed]", "id": "f3tt2z", "created_utc": 1581694452.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 13, "comments": [{"body": "stop", "score": 4, "replies": [{"body": "Stop or stop loss?", "score": 0, "replies": [{"body": "just stop", "score": 3, "replies": []}]}]}, {"body": "Ban. This. Muthafucka.", "score": 5, "replies": [{"body": "Please. I don’t wanna be banned and have to make a new account with “tendies” in my name", "score": 0, "replies": []}]}, {"body": "Buy the stock you will make millions", "score": 3, "replies": [{"body": "I know a guy that became a millionaire from buying GameStop calls.\n\nHe use to be a billionaire", "score": 1, "replies": []}]}, {"body": "Shoulda bought msft stock", "score": 2, "replies": []}, {"body": "I bought my first option today.  \n\n\nMSFT 3/20 200c", "score": 2, "replies": []}, {"body": "Ban", "score": 1, "replies": []}, {"body": "DONT SAY ANYTHING JUST LEAVE IT ALONE. DO WHAT YOU GOTTA DO AND SAY NOTHING.", "score": 1, "replies": []}, {"body": "And then I'm stuck with stock that doesn't go up 600% in a week", "score": 1, "replies": []}, {"body": "Nobody tell him\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
{"title": "Walmart Calls up", "selftext": "[removed]", "id": "f3v2ya", "created_utc": 1581699687.0, "score": 4, "upvote_ratio": 0.84, "num_comments": 12, "comments": [{"body": "What’s your position? I’m thinking of getting some", "score": 2, "replies": []}, {"body": "I am! I’m originally from Walmart land so I totally believe in their trashy potential", "score": 2, "replies": []}, {"body": "Retail was cataclysmic December. Can’t tell where the shrapnel from Amazon hit. \n\n50/50", "score": 2, "replies": []}, {"body": "Yeah I have two $117 calls that are up like 55% sitting at $250 profit right now. Planning to hold them through earnings.", "score": 1, "replies": []}, {"body": "Yea i made a post about it and people called me autistic for thinking about buying calls.", "score": 1, "replies": []}, {"body": "Yup. $127 02/21.", "score": 1, "replies": [{"body": "Yikes", "score": 1, "replies": [{"body": "Haha yup.", "score": 1, "replies": []}]}]}, {"body": "yeah got a 220 call for 3/20", "score": 0, "replies": [{"body": "I think you mixed up MSFT and WMT bud", "score": 5, "replies": [{"body": "God I hope so", "score": 2, "replies": []}, {"body": "Dudes retarded, just like me.", "score": 1, "replies": []}]}]}]}
{"title": "You ruined MSFT 3/20 200C", "selftext": "[removed]", "id": "f3vekg", "created_utc": 1581700952.0, "score": 14, "upvote_ratio": 0.77, "num_comments": 18, "comments": [{"body": "did you try selling and buying again?", "score": 8, "replies": []}, {"body": "it’s called theta and a decrease in IV you fuck", "score": 21, "replies": []}, {"body": "Based and cucked", "score": 12, "replies": []}, {"body": "Just hold, retard", "score": 7, "replies": []}, {"body": "No you ruined it.", "score": 4, "replies": []}, {"body": "MSFT maybe up but you also have to consider the supply and demand aspect of 200C 3/20 because lotta these dude were early bag holders and now that the price has emerged from Bezo's asshole they're jumping the Titanic ship.", "score": 6, "replies": [{"body": "so the title is right", "score": 2, "replies": []}]}, {"body": "Θ", "score": 5, "replies": []}, {"body": "Lmao I love these types of questions", "score": 3, "replies": []}, {"body": "Just hold and stop looking every 5 seconds.  \n\n\n3/20 is plenty of time for you to sell this to someone a decimal more retarded than you.\n\nBest regards,  \n190C 3/20 Gang.", "score": 3, "replies": [{"body": "But more retarded is good. I’m like half retarded, cuz I would buy that shit right now.", "score": 1, "replies": [{"body": "It is good. 200 3/20 has now become very iffy, though.  \n\n\nHopefully Tuesday refreshes everyone's outlook and we see a steady gain.", "score": 2, "replies": []}]}]}, {"body": "It’s all about 3/27 now", "score": 2, "replies": []}, {"body": "no u", "score": 1, "replies": []}, {"body": "Ban", "score": 1, "replies": []}]}
{"title": "Kolanovic: Buy puts in Walmart (WMT)", "selftext": "\n1. We recommend investors purchase Walmart February 114 strike puts for $1.88, indicatively ($115.85 reference price), taking advantage of what we view to be a potentially conservative earnings implied move and our cautious near-term fundamental view.\n\n2. The option market is currently implying an earnings-related move of ~4.4%, roughly in line with its three-year average realized move. However, given our fundamental view and the lingering concerns related to the potential impact of the coronavirus, we believe the implied earnings-related move may be conservative.\n\n3. 4Q earnings and annual Investment Community Meeting on February 18.", "id": "f3vttr", "created_utc": 1581702660.0, "score": 15, "upvote_ratio": 0.89, "num_comments": 18, "comments": [{"body": "Haha short WalMart due to Coronavirus? \n\nHow can I short this retard?", "score": 41, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "How does this affect Q4 2019 earnings? The virus is Q1 2020?", "score": 6, "replies": [{"body": "you can beat earnings and still have the stock price fall, future guidance is what dictates jump or fall after earnings. if they beat earnings and then say q1 is going to be bad,red", "score": 6, "replies": []}, {"body": "Ummm.", "score": 1, "replies": []}]}]}, {"body": "Well amazon is up something nuts like 30% this year. Why drive to walmart when amazon drives to you?", "score": 4, "replies": [{"body": "WM does free 2 day ship as well...", "score": 8, "replies": [{"body": "Walmart doesn't have VR porn", "score": 5, "replies": [{"body": "Who has VR Porn? I need to know....for science", "score": 2, "replies": [{"body": "Oculus rift, or any old Amazon headset you find. \n\nFor a cheap shitty alternative, psvr", "score": 3, "replies": []}]}, {"body": "It has R porn... Just hang around the changing room in the menswear department.", "score": 1, "replies": []}]}]}]}]}, {"body": "Found the guy selling puts", "score": 14, "replies": []}, {"body": "Calls it is", "score": 12, "replies": []}, {"body": "THIS JUST IN: Kolanovic has small pp", "score": 11, "replies": []}, {"body": "Corona virus is not really the rationale for this play. I think it's more that Target had very week 4Q holiday earnings report that dropped their stock considerably on Jan 15th. Target and Walmart generally track each other very well in their earnings...\n\nPersonally, I think this is a shit play.", "score": 3, "replies": [{"body": "I hope it's a shit play, I took a gamble in Wal-Mart calls! Moreso because people used the fuck out of that grocery pick up and I think that'll grow. Felt like a potential upset with the lowered expectations after Target.", "score": 5, "replies": []}, {"body": "This. WMT took a beating the moment TGT missed on toys and cosmetics. The market is just pairing them together.\n\nAmazon proved the consumer is strong. I don’t think WMT fucked it up. They just need to come in at the estimates and it will moon", "score": 2, "replies": []}]}, {"body": "Got it, so buy calls. because coronavirus won't be reflected in this earnings and amazon and shopify both crushed earnings. yeah I'll buy calls", "score": 1, "replies": []}, {"body": "Lol gay bear was tryna (pump n dump)^-1 and got cuckadoodledoo'd.  FREE TENDIES ON AISLE 12.", "score": 1, "replies": []}]}
{"title": "Is theta gonna fuck me on NVDA next week?", "selftext": "[removed]", "id": "f3wftb", "created_utc": 1581705087.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 18, "comments": [{"body": "If you don't already know...", "score": 6, "replies": []}, {"body": "breh you think NVDA gonna go to $298 by next friday or not? that's your answer.\n\nit already did a pop on earnings, now it's anyones guess for folk adjusting to new price with buying/selling.\n\n\ngl with the FD\n\nI'd sell if I were you. even on a good week NVDA rarely pops back up another $5", "score": 3, "replies": [{"body": "Seems smart thank you, I'll go with that, especially with the little boost it's having rn", "score": 1, "replies": [{"body": "Remember, don't look at is as \"I might miss out on gains\", ask yourself if you had a pile of say $1,000 sitting in front of you are you willing to let it go to 0 for the small chance it might go to $1,200?\n\nGains are gains. No one lost by taking profit. \n\nEarn even 20-30% on every single option trade you ever do and *never* take a loss and you'll be a millionare. Does that mean cuck out early always? Nah; It means don't be greedy.\n\nAlways ask yourself if the potential loss is worth just taking cash and reapplying it to the next game.\n\nE: And dont forget about theta. $295 2/21 is 0.35 theta right now? Losing 35 cents a day on that option, and it's about to be a closed-market Monday. $35 gone to the wind right there, increasing more every day closer to expiration. Lotta money you \"lose\" by waiting and praying. Never forget time works against you.", "score": 2, "replies": [{"body": "Yes thank you this is good advice. Took a decent profit on this (small) move but a profit is still a profit.\n\nUnlike my MSFT 2/21 calls that were basically like throwing money in the garbage.\n\nHoping my $210c 3/20 isn't too adventurous.", "score": 1, "replies": [{"body": "See my edit to that comment too.", "score": 2, "replies": [{"body": "Just saw that thanks. I gave up and took a 60% loss on my MSFT 2/21 calls because I was retarded on those anyway (my first ever options and got caught up in FOMO).\n\nI think the 3/20 ones are at least a bit more reasonable.", "score": 1, "replies": [{"body": "EHHHHHHH I would jump out of MSFT too but if you're already down might be just time to say prayers\n\nI really don't know what's gonna happen near-term with them because of the recent news. I'm holding MSFT $170C 9/18 exp. with 193.70 break-even and even that has me going \"man, MSFT might go down another 10 and it'll be close to have it bounce before exp...\"\n\nBe worried. Watch it. Jump out while you still have *some* cash instead of 0% if you can, or have some good faith in it.", "score": 1, "replies": [{"body": "I feel like as long as the court doesn't change the contract and award it to MSFT, it'll be alright. But I think maybe going for $210c 3/20 is gonna be a tough sell. I am only down 20% on my position, I think I'll watch what happens next week and if there's no movement I may get out. In general I'm pretty positive about MSFT outlook though based on fundamentals.\n\nMaybe I'll go long and look for $220c 1/15/21 or something", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I think that if you didn't have an exit strategy when you bought the calls you were fucked as soon as you placed the order.", "score": 2, "replies": [{"body": "I mean I'm technically up still on the position today, just not as up as I was at 11:15, still a newb at options so I don't have much money in this.", "score": 0, "replies": [{"body": "You are missing my point.\n\n**Failing to plan is planning to fail.**\n\nAsking WSB after earnings if your OTM weeklies are going to get hurt by theta is not a plan.", "score": 1, "replies": [{"body": "Fair enough", "score": 1, "replies": []}]}]}]}, {"body": "Sell to lock in break even profit and ride it out if you think they will pop again. I am a 🧻✋🤰 so I always sell when it pops and wait for a drop to get back in. You do you tho get those tendies.", "score": 2, "replies": [{"body": "Good idea, I sold at $3.50, doing much better than my MSFT calls", "score": 1, "replies": []}]}, {"body": "Ez money if you double down if it dips", "score": 1, "replies": []}, {"body": "What about AMD over weekend? Think it'll go up bc pay day?", "score": 1, "replies": [{"body": "I like AMD but I haven't looked at what's going on with them recently", "score": 1, "replies": []}]}]}
{"title": "Aggressive Option Flow (02-14-20) - SPCE/MSFT/NVDA/PYPL", "selftext": "Today  I included the aggressive orders that I see, many of them instead of  just a few into one picture. Today I didn't color code the calls/puts   but did color code the companies.\n\nThese  options orders are on or above the ask. Many have the same expiry and  strike. Also lots of the orders were sweeps so these ppl were breaking  down their order to get filled faster.\n\nAlso all these orders volume of the contracts exceeded the open interest in  multiple trades so it's most likely not closing positions. Either buy to  open orders or sell to open orders and based on the aggressiveness of  the orders one can infer its buy to open. Some of these may be hedges  and some most likely not.\n\nData is here - [https://ibb.co/rKjZXD8](https://ibb.co/rKjZXD8)\n\nIt's from 9:30-2:08pm or so.\n\nWatch NVDA to maybe to to 300 soon, watch DB/SPCE/MSFT/PYPL, all those look really aggressive.\n\nI  will say this, don't just enter into positions based on this data alone in most cases. Use  technicals/fundamentals/options  data-flow/market  sediment all combined  instead of just 1 of these. Use protection like  spreads if you worry  about losing what u put in and be  smart,  understand the risks of putting  $ into weekly expiry's, consider a  longer expiry.", "id": "f3x743", "created_utc": 1581708026.0, "score": 25, "upvote_ratio": 0.87, "num_comments": 19, "comments": [{"body": ">*don't just enter into positions based on this data alone*\n\nMSFT calls it is", "score": 39, "replies": [{"body": "Too late, already placed market orders to blindly buy all these tickets on Tuesday morning", "score": 1, "replies": []}]}, {"body": "$MSFT to the ***MOON !***", "score": 17, "replies": [{"body": "I’m pretty new to this. Holding the following and feeling pretty good although it’s hard seeing red at the moment. \n\n3/27 $200\n\n3/27 $205\n\n6/19 $210", "score": 2, "replies": [{"body": "Seems like a reasonable position.... BAN", "score": 10, "replies": []}]}]}, {"body": "LOL: “use technicals” ... LOLLLLL", "score": 11, "replies": [{"body": "What else do you use dumbo", "score": 1, "replies": []}]}, {"body": "“aggressive”  trades... in other words “WSB autistic YOLO” trades", "score": 12, "replies": []}, {"body": "Printing this sheet off and grabbing a dart. Whatever I hit I'm going all in", "score": 9, "replies": []}, {"body": "I just YOLO our new investment fund on SPCE. 200EOY or divorce. A win is a win", "score": 7, "replies": [{"body": "I’ll be your wife daddy 🍆", "score": 2, "replies": [{"body": "Depends. How fast can you spend my tendies?", "score": 3, "replies": []}]}]}, {"body": "$GILD to the moooon!", "score": 3, "replies": []}, {"body": "So many words to just tell me to buy SPCE calls", "score": 2, "replies": []}, {"body": "I don’t know chief...distrustful of those non-green colors you used....", "score": 2, "replies": []}, {"body": "This is good information! Keep it up. Thank you", "score": 2, "replies": []}, {"body": "Have you done any analysis on the past versions of these to see if there are any patterns?", "score": 1, "replies": [{"body": "could u provide more detail of what u mean? Like what patterns? I have noticed the repeating orders with the same expiry/strike around the same time normally work out.", "score": 2, "replies": []}]}]}
{"title": "Some motivation to everyone", "selftext": "First of all... what the fuck do I flair this as..?\n\nAnyways, as someone who has been here for a brick, my dick is no longer a stick. It’s a limp leaf, today I wanted to share what happens when you don’t have faith. I got in on SPCE with a simple debit spread, or 2 of em’ for like 7/17 and sold them both for profit... them hoes were like 10/12 and 12/14 strike prices so it would be big chillen if I just held... also I was hesitant and didn’t have the cash or balls I do now so I held like 7 shares or some shit (FUCK YOU BRO YEAH I USED TO HOLD SHARES NOW IM GETTING DICKED BY THE KID WHO VOICE MESSAGED ME SAYING HIS DAD WILL BAN ME FROM XBOX) but anyways, I was telling my friends who hardly invest but I got them into it, i was telling my dad, sister, cats, dogs, invisible friends, literally everyone this bitch would go up. It did, my average of like 11.67 or some shit on shares I sold for 18.50 then rebought at 18.69 and sold again at 19 and been leaving alone since cause I’m retarded. \n\nWho cares about the numbers, the lesson here is don’t be a pussy, have faith, and have diamond hands like me and hold 3/20 200c MSFT\n\nThis has been my Ted Talk\n\nEdit: TL:DR: In the comments I drew a pic for you all since I know half of you can’t read anyways", "id": "f3z02j", "created_utc": 1581715240.0, "score": 10, "upvote_ratio": 0.76, "num_comments": 15, "comments": [{"body": ">  lesson here is don’t be a pussy, \n\nInstructions unclear, chickened out of SPCE too early", "score": 18, "replies": [{"body": "That’s the point :( also no one listened to me when I said “twitter not worth 39, puts” and it worked out", "score": 6, "replies": []}, {"body": "Same, got out when it dipped right out 26. Still green today though overall. But still an autist overall.", "score": 2, "replies": [{"body": "Dude I'm so glad I'm not alone.  I made money today, but a measly sum. I ran to Walmart at 7 am to buy a phone charger cuz my phone kept dying with the old shitty charger. I swear I'd be better off if I let my phone die.", "score": 3, "replies": []}]}]}, {"body": "Honestly I went through the same situation as him, had calls from yesterday went negative on those. then doubled down in the morning ended profiting, but decided to throw too much cash at it and when it dipped I sold for a massive loss hoping I’ll be able to make it back. Currently losing my mind and regretting a lot", "score": 7, "replies": [{"body": "It’ll be okay :(", "score": 4, "replies": []}]}, {"body": "Can you make a drawing explaining what you wrote? Lost you after the first line", "score": 3, "replies": [{"body": "[here ya go mate](https://imgur.com/fdQJwZa)", "score": 18, "replies": []}]}, {"body": "this was scatter brained af, I need to see the DD on your next pick!", "score": 1, "replies": [{"body": "I gotchu, I’ll let you know but it’ll be hectic", "score": 1, "replies": []}]}, {"body": "If Diamond hands are 3/20 200c MSFT, then what are 2/21 200c MSFT?", "score": 1, "replies": [{"body": "BedRock hands", "score": 4, "replies": []}, {"body": "I don’t care about your calls at this point... how did you get Thanos’s Glove....", "score": 2, "replies": [{"body": "It’s called using this sub too much and taking advice legitimately. First one is free. \n\nAlso, by the time I realized what had happened, it wasn’t worth losing my dignity and selling.", "score": 1, "replies": []}]}]}]}
{"title": "Early MSFT rally", "selftext": "[removed]", "id": "f3zak3", "created_utc": 1581716442.0, "score": 5, "upvote_ratio": 0.63, "num_comments": 11, "comments": [{"body": "u/cowboy_jow market is closed on Monday because of presidents’ day you stable genius.", "score": 14, "replies": [{"body": "Shit! its all falling apart already!", "score": 4, "replies": [{"body": "Posting this was retarded but again you are a stable genius. So yeah, this is big brain time 🧠.", "score": 5, "replies": []}]}]}, {"body": "This is 🌈", "score": 5, "replies": [{"body": "can confirm. holding puts like a 🌈🐻, this is 🌈", "score": 1, "replies": []}]}, {"body": "Every time yall post about MSFT the stock drops.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "bro i said fuck it and bought 270 and 280 leap calls at ask price and uninstalled my robinhood like a *bitch*", "score": 1, "replies": []}]}]}, {"body": "Speak more of this *sex magic*", "score": 1, "replies": []}, {"body": "I will service you for $10.  I can not afford to pay you $20.", "score": 1, "replies": []}, {"body": "Stock market is closed Monday", "score": 1, "replies": []}, {"body": "Ban", "score": 1, "replies": []}]}
