{"title": "Amazon's ($AMZN) Income Statement 2022", "selftext": "", "id": "10s2wp6", "created_utc": 1675376762.0, "score": 472, "upvote_ratio": 0.97, "num_comments": 91, "comments": [{"body": "These charts are great thank you", "score": 127, "replies": [{"body": "Do you know what these graphs are called?", "score": 6, "replies": [{"body": "sankey", "score": 15, "replies": []}]}]}, {"body": "As a user of Amazon to buy stuff I find the shift from Amazon selling things to Amazon being a storefront to be a major negative on my user experience. We see in the sales data that Amazon 3rd party seller revenue is up 14% but online stores are down 1%.\n\nMy Amazon feed is heavily filled with ads on the opening search pages. It's so bad I downloaded a plug-in to eliminate them and it instantly made searching better. And I ditched Amazon Prime because the value just wasn't there.\n\nI can't speak for others, but Amazon has definitely reduced the value proposition of their services to me.", "score": 140, "replies": [{"body": "crush carpenter crime vegetable slim future wasteful automatic plucky humorous\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 58, "replies": [{"body": "This is 100%… the only reason I still have them is because nobody can match them… Walmart is trying, with their retail but they don’t have a streaming service and stuff like that… if they get a *true* competitor, it would be very nice to see what would happen", "score": 23, "replies": [{"body": "Same here. Love Amazon and really only buy items that are same day delivery or overnight. Tried Walmart same day once but dude was so stoned and my item smelled like weed so I said nope I’ll just stick with Amazon.", "score": 11, "replies": [{"body": "Yeah exactly, if it’s not prime I’ll just go to the store, but nobody can touch prime… and the streaming that comes with prime too… might not have everything you want, but it’s got a lot…", "score": 5, "replies": [{"body": "Yah, the # of benefits with Prime is really what makes Amazon hard to beat. Amazon’s made themself in enough consumer markets that there’s always a reason you want the service. Gaming, streaming, etc. are just a great way to justify keeping Prime “one more year.” With services like subscribe and save too, I’m able to frequent the grocery stores I love rather than hit a Wal-mart or target for toiletries and other expendable products.", "score": 0, "replies": [{"body": "Yes, exactly, pound for pound, it’s the best option as of now…", "score": 0, "replies": []}]}]}, {"body": "1 delivery guy... have you smelled your Amazon guy?", "score": 0, "replies": [{"body": "No cuz those fuckers do it how I prefer. Dump the shit on my porch and leave with no interaction.", "score": 7, "replies": []}]}, {"body": "Sorry how was this Walmart’s fault? Lol", "score": 0, "replies": []}]}, {"body": "Walmart+ had a deal where you got free Paramount+ if you signed up, not sure if they still have it", "score": 2, "replies": [{"body": "True, but that just one channel, they don’t have near the total library amazon does…", "score": 4, "replies": [{"body": "Have you used Paramount+? It has Viacom's library.", "score": 1, "replies": [{"body": "Nah but until I know I can gets goods in  two days or less, 95% of the time, I can’t change from that quite yet…", "score": 1, "replies": []}]}]}]}]}, {"body": "If I don't have a specific brand item I'm looking for to say 'Brand Model' their stores are so congested with cheap 'insert name here' dropship shit it's awful. Like, I want a dog harness. There's an entire page of nonsense letters dog harnesses before you finally find one from any recognizable brand.\n\nI used to be able to look up like, 'laptop bag' and now I do that and it's just... junk. It's 99% relabled junk. I looked up cordless vacuum. It's legitimately ads, relabled junk, ads for not a cordless vacuum, ads for relabled junk, more relabled junk and halfway down the page - my first actual real item. The rest if you go through are highly rated but you go into the reviews and you'll see somebody bought reviews and the actual people bought it hate them.\n\nAmazon is trash these days. Literally.", "score": 6, "replies": []}, {"body": "Seriously, I can barely open the Home Depot site it's so bogged down with scripts. They're like the 3rd largest company on earth and their website is barely usable on mobile.\n\nAmazon's experience is a messy UI that gets more convoluted each month, but at least it runs.", "score": 4, "replies": [{"body": "disagreeable snatch exultant uppity slap different escape pocket smell worm\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 2, "replies": [{"body": "Lowe's won't even let me use the site with a VPN on, so they've totally lost my online business due to that. Also yes when I have used their site it's on par with the terrible experience at HD's.", "score": 2, "replies": []}]}]}, {"body": "Gotta share this , I was having watery eyes don’t really have allergies on a regular basis so I don’t keep any drops around. Doc said to use Pataday I went to CVS Sunday morning picked up a 2 pack it was $39.99, waiting in the checkout line I looked at Amazon to compare price and it was $26.50 same day delivery for the same product. I Ordered it and it arrived 6 pm Sunday. That type of logistics and pricing is awesome as a consumer saving 30-40% on an item and getting it the same day was a pretty good feeling .", "score": 2, "replies": []}]}, {"body": "I rely on amazon too much to be critical", "score": 23, "replies": [{"body": "That's a terrible strategy", "score": 6, "replies": [{"body": "And, at least on the surface, kinda stupid.", "score": 2, "replies": []}]}]}, {"body": "What’s the plugin", "score": 2, "replies": [{"body": "It's titled \"Amazon adBlocker\" and I use Chrome.", "score": 1, "replies": []}]}, {"body": "It's not a coincidence you are experiencing this and advertising revenue is growing.  The sellers are bidding against each other to show up at the top of search results... I.E. \"advertising revenue\".  These sellers operate on razor margins and after paying for \"advertising\" and giving away a bunch of free shit to get reviews there is less revenue leftover and they must continue to drive down the product cost any way possible (cheaper and cheaper shit).", "score": 2, "replies": [{"body": "I wonder how Amazon gets paid for the ads. Do they get paid if someone buys something? If someone clicks on the ad? If the ad merely appears on a search? If I block the ad does Amazon still get money?\n\nWhat I do know is Amazon is usable with the ads gone. I was so used to direct links from affiliates that I was horrified at seeing what search looked like using Amazon.", "score": 1, "replies": []}]}, {"body": "Definitely not my experience. I buy 90% of everything except groceries on Amazon. New leather phone case? $30 for a nice looking one and it’s at my door same day. New entry mat? Unlimited options from $15-$150 and it arrives the next morning. \n\nInfinitely better than any other online experience I’ve had and saves me significant time driving and wandering around stores", "score": 0, "replies": []}, {"body": "What's the browser plug in?", "score": 1, "replies": [{"body": "Amazon adBlocker", "score": 1, "replies": [{"body": "🙏", "score": 1, "replies": []}]}]}]}, {"body": "Man, amazon trades like a tech company in low interest rate environment, but it's so capital instensive. I can't wrap my head around it, how is it valued so high when it has extremely high expenses eating into the profits.", "score": 43, "replies": [{"body": "And to think, their underbelly is ripe with unions. I can see Amazon losing more money.", "score": 8, "replies": []}, {"body": "Well-positioned in more than one market. They’ve got so much R&D that would make the company valuable, even if it stopped operating. Tons of consumer data to leverage, plus AWS and robotics(as was mentioned) the longer Amazon operates, the less reliant on shipping for income they’ll be. \n\nTheir business model is reliable is more reliable than their competitors, making investors a lot more confident in owning stock. Even if Amazon declines, there’s no one market that could make the company collapse, as opposed to brick n’ mortar stores, streaming networks, cloud providers, etc.", "score": 2, "replies": []}, {"body": "AWS and robotics there you go", "score": 1, "replies": []}]}, {"body": "I have 6000 shares since 2003, it used to be just 300 before split. 2020 it was all worth a million and even more during pandemic now 600k. Maybe I should have sold but I am here for the long run. I use it all the time, friends and family too. The building where I live in Miami has a front desk office just for Amazon deliveries. This is serious shit that is why staying long and strong", "score": 41, "replies": [{"body": "When the stock is too good to be true, it will fell eventually and you can buy at cheap price again.", "score": 4, "replies": []}, {"body": "I think you’re doing the right thing. Just hold through the dip, it’s not like they’re going anyway anytime soon and I think they cut almost 20k jobs (so far) to reduce expenses. Earnings sounded optimistic, especially after the rivian losses", "score": 6, "replies": []}]}, {"body": "I’m confused, where’s R&D? Everyone always says AMZN has a high PE because they have profits constantly feeding back into the business that does not directly contribute to constant growth.. \n\nAm I miss understanding their spending or is all of that not necessary for constant growth?", "score": 6, "replies": [{"body": "I'd guess that it's under \"Technology and Content\".", "score": 1, "replies": []}]}, {"body": "30% increase on SMGA. Oh boy, I can sense more layoffs incoming", "score": 11, "replies": [{"body": "What's SMGA?", "score": 1, "replies": [{"body": "Sales Marketing General Administrative", "score": 1, "replies": []}, {"body": "Basically employee salary goes to that category", "score": 1, "replies": []}]}]}, {"body": "SMGA +30% yoy, wow!", "score": 11, "replies": [{"body": "What's SMGA?\n\nEdit: is it sales, marketing, general, administration?", "score": 7, "replies": [{"body": "Sales, marketing, general and administrative", "score": 10, "replies": []}, {"body": "smegma", "score": 1, "replies": []}]}]}, {"body": "Amazon has and always will be full of shit reporting stuff like this.  They spend so much money on growth so they can report their taxes in the red and claim benefits.", "score": 3, "replies": []}, {"body": "Tax benefit 😂 jesus america. Imagine having half a trillion in revenue and getting a tax benefit because you spend all your earnings on r&d", "score": 20, "replies": [{"body": "Spending on R&D in my opinion is a better long run benefit to the economy than paying tax revenue, plus it doesn’t matter anyway because they aren’t making a profit.", "score": 4, "replies": []}]}, {"body": "Does Bezos' yacht deserve it's own ribbon?", "score": 8, "replies": []}, {"body": "I honestly use eBay now more than Amazon. Just a personal preference", "score": 7, "replies": [{"body": "Yes, same. I also use Game Stop since they have good quality stuff.", "score": 6, "replies": []}, {"body": "Good luck with disputes. eBay used to have great buyer protection but they’ve all but washed their hands off that now.", "score": -1, "replies": [{"body": "But do they have the same counterfeit game as Amazon?  ‘Cause Amazon loooves them some counterfeit goods.", "score": 1, "replies": []}]}]}, {"body": "Uff, that’s tight", "score": 2, "replies": []}, {"body": "Thanks for this dawg", "score": 2, "replies": []}, {"body": "I buy lots of stuff from Walmart and pick it up at the store.  Works great.  Fuck Amazon.", "score": 2, "replies": []}, {"body": "Some positive takeaways here. Riv Ian continues to be the ugly duckling hindering earnings but every segment showed continued growth even during a turbulent market sentiment.", "score": 2, "replies": []}, {"body": "If you look at the previous chart from some months ago you could definitely see this coming. Their margins were razor thin. Google and I think Microsoft were much safer bets.", "score": 2, "replies": []}, {"body": "TIL Amazon has physical stores.", "score": 1, "replies": [{"body": "It could be Whole Foods", "score": 3, "replies": [{"body": "Whoops, thanks! I completely forgot about that!", "score": 1, "replies": []}, {"body": "Yeah, how’s that working out?", "score": 1, "replies": []}]}]}, {"body": "I don't use Amazon for anything.", "score": -16, "replies": [{"body": "Maybe true, but a lot of shit you use online uses AWS", "score": 27, "replies": []}, {"body": "Using it right now my man", "score": 20, "replies": [{"body": "Not really", "score": -19, "replies": [{"body": "You are using reddit powered by AWS 🤡", "score": 21, "replies": [{"body": "Didn't realize i was paying for Reddit 🤡", "score": -15, "replies": [{"body": "Who said anything about paying? YOU said use. \n\nWay to move the goalposts. \n\nBut even then, you pay to use Reddit. Not in the form of cash, but in the form of data. \n\nYou view ads when you browse Reddit, that ad revenue goes from Reddit to Amazon to pay for the server you are using right now. Even with ad blocker, your browsing history is also sold. \n\nFacebook, your email, online banking, and “most” websites use Amazon web servers in some form. If you use the internet, you use Amazon.", "score": 11, "replies": [{"body": "I don't have ads\n\nI also don't use Facebook\n\nNice pretension though", "score": -8, "replies": [{"body": "\nYou sure are dense.", "score": 1, "replies": [{"body": "Whatever you say drax", "score": -1, "replies": []}]}]}]}, {"body": "But you are “using” it. Go back to your moms basement", "score": 7, "replies": [{"body": "I liked your mom's basement better champ", "score": -4, "replies": [{"body": "How she doing anyway?", "score": 2, "replies": [{"body": "She says you never call", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I would commend someone who created this chart. A very detailed one", "score": 1, "replies": []}, {"body": "How do you build these charts?", "score": 1, "replies": []}, {"body": "$afrm $$$ and news out on  Mara", "score": 1, "replies": []}, {"body": "As a seller, this is the first year ever that Amazon took a bigger cut of the sales than us.", "score": 1, "replies": []}, {"body": "r/marketpredictors", "score": 1, "replies": []}, {"body": "I think the Prime same day and next day deliveries are hurting their bottom line. I live right out side of Boston and there is 1 up and running distribution center and they are building another 3 miles away. So they need to hire more drivers, pickers, etc. I wouldn’t be surprised if they raise Prime cost to 19.99 from 14.99 to help offset the costs. The ones who use Amazon all the time won’t be phased at all.", "score": 1, "replies": []}, {"body": "How is Amazon getting a Tax benefit ..", "score": 1, "replies": []}, {"body": "Shouldn't this graph be called Loss statement 2022?\nThis, on top of their long term debt of $78 Billion, not looking good tbh", "score": 1, "replies": []}, {"body": "As someone with retail ecommerce, I also struggle with high cost in my operation, and accumulating lost for years, I have been putting in my own money for a while to keep it running, and I was frustrated, until I learned a lot ecommerce big companies also have negative numbers every year, and some big ass company, also have a huge hole, and the stockholders are who are supporting them, in hope of future value. I kept my business also in hope of future value, things are getting better, slightly better. I once had incredible numbers, but those doesn't count, because it was during pandemic.", "score": 1, "replies": []}]}
{"title": "Thursdays earnings report. $AMZN,$GOOG, $APPL", "selftext": "It’s definitely going to be an exciting day. Last year before Amazon and Google split I purchased a pretty good amount of shares.  It’s been in the red as much ad 30% down since last February. Recently it’s been creeping up. Hopeful that the earnings of both Amazon and Google will push the PPS upwards.  \nBased on recent price action, it appears that earnings of leak to the street because Amazon 5.5% and Google 5.37%  today has moved upwards the last two weeks\n\nPredictions on earnings? \nPredictions on where Amazon stock and Google stock will be at the end of the second quarter?", "id": "10rh269", "created_utc": 1675313212.0, "score": 140, "upvote_ratio": 0.94, "num_comments": 87, "comments": [{"body": "I am still a goog bagholder.", "score": 123, "replies": [{"body": "[deleted]", "score": 54, "replies": [{"body": "I am not one anymore right now! Average price 105.60 Edit : Bagholder again.", "score": 12, "replies": []}, {"body": "GOOG is my only heavy bag.  Partly because of when I opened a position, partly because I haven’t averaged down as I’m increasingly skeptical of the companies future growth.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You were right!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I don’t like the current leadership and they haven’t been successful recently with their projects.  I don’t hate the stock but i think there are just more compelling investments out there that seem more likely to beat the market.", "score": 1, "replies": []}]}]}]}, {"body": "Worth still investing in google now even?", "score": 3, "replies": [{"body": "It is the first time I see this stock green in my portfolio. I don't have the best decision making about this stock. Don't ask me, I am an idiot.", "score": 10, "replies": []}]}, {"body": "The people who said to not buy before the split are probably grinning with joy", "score": 0, "replies": []}]}, {"body": "Comfortable stock to own Apple.", "score": 52, "replies": [{"body": "They have have a strong brand recognition and nice portfolio of products. I'm all in.", "score": 3, "replies": [{"body": "Also the most cash on hand and the largest margins.", "score": 2, "replies": []}]}]}, {"body": "Regardless of the results, the big money players seem to be letting it ride. Seems like the pump is on, but rug pull at any time.", "score": 57, "replies": [{"body": "That sums up the market at all times.  Inherently bullish, always an impending rug pull and downturn.  How do you beat it?  Stay long, my friends.", "score": 22, "replies": [{"body": "Agree. But I’m cautious for sure.", "score": 1, "replies": []}]}, {"body": "I want this to happen by Friday", "score": 0, "replies": [{"body": "mid to end of this month we will see rugpull the bull hype is going to continue into next week tho", "score": -6, "replies": [{"body": "What about if Amazon, apple and Google report shitty earning tomorrow.. that could cause some pain to the SPY in my opinion..", "score": 3, "replies": [{"body": "jpow said some dovish ass shit the earnings are going to have to be quite shitty for anything to take a turn for the worst… if 2/3 of the earnings go south it’ll dump for a day and pick itself right back up.", "score": 8, "replies": [{"body": "All of them report today after close.. I might sell at ion my PUTS and buy calls in\nHopes of getting back my losses..it will all depend on how is pre-market", "score": 1, "replies": [{"body": "honestly in my experience don’t play 0dte because ur running a risky game, but do what works best. best of luck Godspeed", "score": 5, "replies": [{"body": "I’ll get back to you when I make my play..", "score": 2, "replies": []}, {"body": "Thanks to apple calls.. my portfolio survived", "score": 1, "replies": []}]}]}]}]}, {"body": "Don't know why you're down voted. I'm in agreement that hopefully we see rally into next week.", "score": 1, "replies": []}]}, {"body": "Same", "score": -1, "replies": []}]}]}, {"body": "I like mine:  Apple, Amazon, Google, Berkshire-B, Altria, P&G, Marsh McLennan, CVS, Disney & Skyworks. Bought all in 2012 and plow the dividends back into more stock. All are in my Roth.", "score": 22, "replies": [{"body": "Skyworks is an underrated pick.", "score": 6, "replies": []}]}, {"body": "There will be something positive in any of their earning call to boost it. \\*decline in revenue, profit but this year we'll launch the iphone 15 for sure\\* Hoppa to the moon", "score": 10, "replies": [{"body": "Seriously. The past week of earnings have been TERRIBLE on extremely lowered expectations too. But a company can fuck up every way possible but have ONE positive thing and they go skyrocketing", "score": 7, "replies": []}]}, {"body": "Either way it's ok I guess. If their earnings are bad then it's discount stock time. If it's good then more money in me pocket. They are solid companies I'd keep and hold indefinitely.", "score": 6, "replies": []}, {"body": "What is the likelihood that all three miss expectations and the SPY sinks??", "score": 10, "replies": [{"body": "*All three miss expectations and SPY rips", "score": 31, "replies": [{"body": "The way the market has been the past month, that's exactly what will happen if all 3 miss, haha", "score": 4, "replies": []}, {"body": "Apple calls saved my portfolio today", "score": 1, "replies": [{"body": "Nice", "score": 1, "replies": [{"body": "I was sweating yesterday when I bought the calls before close and it tanked after hours.", "score": 1, "replies": []}]}]}]}, {"body": "I posted that meta could likely beat expectations a week ago here. Downvoted of course. Twitter lost billions in advertisers. That money had to go somewhere. Also if you see a stock going up steadily before earnings that isn't a sign that it's going to drop after earnings at all.\n\nThe groupthink in this thread is just a repeat of that.", "score": 6, "replies": []}, {"body": "Someday it will happen", "score": 3, "replies": []}, {"body": "[Actually, for the first time in almost 20 years, equity valuations are moving inversely to earnings surprises. ](https://i.imgur.com/dehdxiX.jpg)\n\nSilly season is upon us.", "score": 2, "replies": []}, {"body": "If happens it will be fun... Very fun", "score": -4, "replies": []}, {"body": "RemindMe! 3 hours", "score": 1, "replies": [{"body": "I will be messaging you in 3 hours on [**2023-02-03 00:17:31 UTC**](http://www.wolframalpha.com/input/?i=2023-02-03%2000:17:31%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/10rh269/thursdays_earnings_report_amzngoog_appl/j6ytmuu/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F10rh269%2Fthursdays_earnings_report_amzngoog_appl%2Fj6ytmuu%2F%5D%0A%0ARemindMe%21%202023-02-03%2000%3A17%3A31%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2010rh269)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Aged like wine", "score": 1, "replies": []}]}, {"body": "I think Amazon had a record breaking holiday season and is likely to beat the estimate.", "score": 31, "replies": [{"body": "UPS, FedEx and other global parcel deliverers all said online shopping went down drastically for the past half year or so. Why would Amazon be any different?", "score": 42, "replies": [{"body": "Amazon uses their own delivery for a good chunk of their sales .", "score": 18, "replies": [{"body": "Most of my packages were delivered by Amazon during last holiday. I bought tons of stuff btw.", "score": 6, "replies": []}]}, {"body": "I guess we will find out tomorrow. But Amazon did say they had a record breaking holiday season with their global partners.\n\nhttps://www.aboutamazon.com/news/small-business/celebrating-a-record-breaking-holiday-season-for-amazon-with-customers-purchasing-more-items-than-ever-before-from-our-selling-partners", "score": 13, "replies": [{"body": "“Sales are up an incredible 112% this holiday season compared to last year,” tbf thats pretty inline with actual inflation", "score": 4, "replies": [{"body": "Math ☕", "score": 7, "replies": [{"body": "Math is hard before 8am", "score": 2, "replies": [{"body": "Fair.", "score": 1, "replies": []}]}]}]}]}, {"body": "UPS and FedEx are general earnings reports. They arent company specific so if Company A is struggling with online sales but someone else is doing better you arent going to get that from their earnings.", "score": 3, "replies": []}]}, {"body": "AMZN isn’t going to move based off retail sales… advertising revenue and AWS are what matter", "score": 4, "replies": []}, {"body": "[deleted]", "score": 10, "replies": []}, {"body": "That would fly in the face of all the spending data that came out for the months of November and December", "score": 7, "replies": []}, {"body": "impolite amusing paltry reminiscent psychotic bear ask narrow nutty seed\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*", "score": -4, "replies": []}, {"body": "Amazon’s retail sales don’t move the needle nearly as much as AWS.", "score": 1, "replies": []}]}, {"body": "IT's kind of hilarious how effective inversing this sub is. The hivemind was jock riding GOOG as the best FAANG buy, and shitting on META for months now", "score": 4, "replies": []}, {"body": "Sorry OP, all round massacre with these earnings.", "score": 3, "replies": []}, {"body": "They went up in sympathy with META. If that dumpster fire beat earnings, people are pretty sure these will too.", "score": 12, "replies": [{"body": "Their user base increased. That’s a big metric for online advertising.", "score": 10, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Yes", "score": 7, "replies": []}]}]}, {"body": "It didn’t beat earnings is the weird thing. It went up for buybacks", "score": 5, "replies": [{"body": "Revenue beat, buybacks, and most importantly, more than expected user growth. There was a lot to like in the Meta earnings.", "score": 9, "replies": []}]}, {"body": "Look at PE for meta vs Apple, Amazon.  They are not close.  Meta was in the toilet because of their excess spending budget.  They had a relief rally because they set a more conservative spending tone and up their DAU.   Does not mean their forward PE will get much better only time will tell.   Apple and Amazon are looking at tough times for the next year.   We shall see.", "score": 1, "replies": [{"body": "Meta is a virtual make believe company that nobody uses anymore tho", "score": -4, "replies": [{"body": "Instagram enters the chat", "score": 1, "replies": []}]}]}]}, {"body": "Meta setting the market up for failure on these. No way rallying 5-6% into earnings is sustainable.", "score": 2, "replies": []}, {"body": "This is going to hurt. Sorry, ya'll: Alphabet misses on earnings and revenue as YouTube falls short\n\nhttps://www.cnbc.com/2023/02/02/alphabet-googl-earnings-q4-2022.html?__source=androidappshare", "score": 2, "replies": []}, {"body": "Well you’re probably feeling some good pain right now lol", "score": 2, "replies": []}, {"body": "These are 3 stocks I think everyone should own, It's difficult to see anything but an upward trajectory long term.", "score": 4, "replies": [{"body": "you'll be surprised to see that even Apple can tank after a shit quarter", "score": 1, "replies": [{"body": "I wouldn't be surprised at all that's why I said I hold them long term :)\n\nI don't base my investment stratergy on one quarter.", "score": 1, "replies": []}]}]}, {"body": "All good! Held apple since 2007! It’s been good got in amazon and google before/after split hope they can word for me too! 420 share of APPL @ $5/each!\n\nEdit: work", "score": 3, "replies": [{"body": "Great investment.", "score": 1, "replies": []}]}, {"body": "Important tech stocks.  AA G", "score": 2, "replies": []}, {"body": "My bag looks better today on Amazon down only 22% and one account. With Google it’s 18%.  So perhaps before the end of 2023 \nI will be happy. \npurchased it as a long-term hold, good with the position.", "score": 1, "replies": []}, {"body": "Good thing you bought before they split /s", "score": 1, "replies": []}, {"body": "No one making a profit during layoffs", "score": -2, "replies": []}, {"body": "HOG - Harley-Davidson reported interesting numbers in that their shipments are up as a whole across 2022 from 2021... but behind the curtain we see the real truth. The reason for my post is that motorcycles are a luxury item for most and Harley is one of the most expensive based on cost of entry.   \n  \nInventory at dealers rose by thirteen thousand units from the same time in 2021 after they had spent years trying to knock down those numbers. Sales in the US are down nearly nine thousand units. HDFS, their financial services arm, set aside 51m in Q4 for losses which brought 2022 up to 145m in total.\n  \nFor a brand whose point of entry is over sixteen thousand and typically is in the high twenty thousand range these are continuing to be not good signs. Sales is not be helped by the fact they are continuing their supply chain surcharge which is a thousand or more on their most popular units.\n  \nhttps://investor.harley-davidson.com/news/news-details/2023/Harley-Davidson-Delivers-Strong-Fourth-Quarter-Financial-Results-Successfully-Completing-Second-Year-of-Hardwire-Strategic-Plan/default.aspx   \nhttps://s201.q4cdn.com/697889289/files/doc_financials/2022/q4/HOG-Q4-YE-2022-Earnings-Slides-2.02.23-FINAL.pdf    \n  \nI have no position in their stock, I am just a former owner of their motorcycles and likely a future customer should they choose to remove the surcharge. Dealers are going to be struggling this year and seeing sales decline in the US yet again while inventories are up will put pressure on the dealer network even more. \n  \nOh, on top of all that they will be importing a motorcycle (X350) designed and built in China with only their emblem added to the bike for their riding academy. Harley is no longer able to economically produce bikes they can use for their own riding academy", "score": -1, "replies": []}, {"body": "My dick is so hard right now. Whether earnings go good or bad I’m excited.", "score": -3, "replies": []}, {"body": "Pre market and I'm finally in profit since I started buying this", "score": 1, "replies": []}, {"body": "will it be annoucned today?", "score": 1, "replies": []}, {"body": "I had to roll up and out my GOOGL covered calls today", "score": 1, "replies": []}]}
