{"title": "Coca-Cola Earnings - revenue rises in fourth quarter, fueled by higher prices", "selftext": "https://www.cnbc.com/2023/02/14/coca-cola-ko-q4-earnings.html\n\nCoca-Cola earnings report: https://d1io3yog0oux5.cloudfront.net/_604fcab5fca68b8d216f8c7b19a57b62/cocacolacompany/db/734/7960/earnings_release/Coca-Cola+fourth+quarter+and+full+year+2022+full+earnings+release-2.14.23+FINAL.pdf\n\nCoca-Cola on Tuesday reported quarterly revenue that beat analysts’ expectations, driven by higher prices on its drinks.\n\nBut those higher prices have hurt demand for Coke products like Simply Orange Juice and Fairlife Milk. Coke said its unit case volume, which strips out the impact of currency and price changes, fell 1% in its fourth quarter.\n\nHere’s what the company reported compared with what Wall Street was expecting, based on a survey of analysts by Refinitiv:\n\n\nEarnings per share: 45 cents adjusted vs. 45 cents expected\n\n\nRevenue: $10.13 billion vs. $10.02 billion expected\n\n\nThe beverage giant reported fourth-quarter net income attributable to the company of $2.03 billion, or 47 cents per share, down from $2.41 billion, or 56 cents per share, a year earlier.\n\nExcluding an impairment charge tied to its Russian business and other items, Coke earned 45 cents per share.\n\nNet sales rose 7% to $10.13 billion, driven by 12% growth in pricing and a more expensive mix of drinks sold.\n\nUnit case volume was flat in North America and slipped 5% in its Europe, Middle East and Africa segment. CEO James Quincey said last quarter that European consumers were changing their behavior in response to soaring inflation.\n\n“It looks like the European economy is going to avoid a technical recession, but clearly consumer demand is softening, and I think that’s likely to continue into the rest of the year,” he said on Tuesday.\n\nHe added that Coca-Cola’s U.S. business is still performing well and the reopening of China will likely boost sales this year.\n\nThe Atlanta-based company has been using a two-pronged strategy to appeal to a wide range of consumers. In addition to raising prices, it’s also been trying to offer more affordable options targeted at lower-income customers. Quincey also said that the company has to “earn the right to take price.”\n\nBoth Coke’s sparkling soft drinks segment and its water, sports, coffee and tea division reported flat volume for the quarter, although there were some bright spots. Coke Zero Sugar’s volume climbed 9%, and its coffee business saw volume increase 11% as the company expanded its Costa brand.\n\nThe weakest spot was Coke’s juice, value-added dairy and plant-based beverages segment, which saw its volume shrink 7% in the quarter. The company said the suspension of its Russian business weighed on the division.\n\nFor 2023, Coke projects comparable revenue growth of 3% to 5% and comparable earnings per share growth of 4% to 5%. Wall Street was forecasting revenue growth of 3.9% and earnings per share growth of 3% for the year.\n\n“Inflation is likely to moderate as we go through the year, and therefore we expect the rate in which prices are going to increase will start to moderate and become more normal by the end of the year,” James said on CNBC’s “Squawk Box” on Tuesday.", "id": "1127fr1", "created_utc": 1676386848.0, "score": 140, "upvote_ratio": 0.95, "num_comments": 96, "comments": [{"body": "I guess so coke is $7 a 12 pack here in Louisiana. Had to switch to Sams cola because it’s half the price.", "score": 58, "replies": [{"body": "It is like $9.99 for a 12 pack right now in northern California.... I've stopped buying soda.", "score": 31, "replies": [{"body": "Genuinely not trying to sound sarcastic, good for you man. It’s terrible for your health. Substitute with water!", "score": 2, "replies": []}]}, {"body": "This has been said about them and PEP for 2 decades now. I still remember how upset people were when a 6 pack went up to $2 while generics were still $1. Some vowing to never drink soda again. Others saying they will lose market because of generics. Then came the health people some wanting to sue KO for the obesity \"epidemic\" while others said other options are healthier (they really arent).\n\nWell... KO has doubled since then and paid out loads of divs. PEP has tripled and also paid out divs. \n\n$7 a 12 pack really isnt bad. If you think about that was $2 in the early 90s. That was 33 years ago and we just went through rapid inflation. Thats pretty much on point with inflation. Im sure generics can be sold for less but thats been the case for over 20 years now. Some folks prefer the big brands.", "score": 11, "replies": [{"body": "Yeah it’s the constant advertising that sucks people in- there’s no other reason that brand should be preferred over generics…", "score": 1, "replies": [{"body": "Honestly untrue. I've tried all manner of generic brands to cut my coke addiction (heh) but coke (zero) genuinely has a better taste.", "score": 3, "replies": [{"body": "Or you just prefer that taste because you’ve been tasting it a long time? Face it, you haven’t done a double blind taste test with a lot of other brands, you’ve got bias… I’ve got bias too - I prefer Dr. Pepper over any other…", "score": 1, "replies": [{"body": "I guess I've never done an official double blind test but I actually even tried to buy cheaper local SE Asian coke (Malaysia Coke factories, they sell it for almost 40% cheaper) and it definitely tastes worse than imported coke.  So even within Coke brand there are differences regionally.", "score": 2, "replies": [{"body": "It’s flavored carbonated high fructose corn syrup. Taste is in the mind of the beholder. Different yes, will you die from a different taste? Doubt it…", "score": 0, "replies": [{"body": "People have differing tastes. Its kind of like saying a McDonalds burger is the same as a Wendys burger or Inn-n-out. I can definitely taste the difference even though they use similar ingredients. Things like cooking time, bread, veges used, and ground beef mix matter.\n\nSame for soda. So for me, I prefer higher carbonation content (more fizz), and less sweet. I also hate sugar in soda. Is it just me or does anyone else feel their teeth become more brittle from sugar soda? For me, it feels like the surface of my teeth become \"rough\" like they were stripped of enamel. Dunno. But this seems less of an issue with HFC which I also dont like very much.\n\nI also dislike Diet Coke and Diet Pepsi because they give me a unpleasant aftertaste. But I like Coke Zero. I also like the Walmart generic brand diet soda.\n\nAs you say it wont kill me to drink any of the variations but thats true of all foods. Dont you have preferences in things?\n\nThe point here is people are varied enough that one size doesnt fit all. And to be honest, what the hell is $7 these days? Im not going to select something I like less over a $3 difference... come on. Same with other types of food as well. I can go to McDonalds or Jack in the Box but I wont because their burgers taste the worst to me of any fast food place.", "score": 3, "replies": []}]}]}]}]}, {"body": "Well that and the generics suck.", "score": 0, "replies": []}]}]}, {"body": "Here in TN, I've seen 8 to $9 a 12 pack. It's insane and I'm not much a soda drinker.", "score": 5, "replies": [{"body": "12€ here...", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Ah. I live in Middle TN so we don't have Food City.  Best deal I've seen is a BOGO free on 12 packs from Publix.", "score": 2, "replies": []}, {"body": "That’s a loss leader to get you into the store, where hopefully you’ll buy more profitable items…", "score": 2, "replies": []}]}]}, {"body": "Switched to H‑E‑B brand here in Texas. It does the trick, I’m not going back no matter what the price drop is.", "score": 2, "replies": []}, {"body": "Yeah, if you’re a soda/caffeine addict, the only good deal are the drink subscriptions at like circle K/Holiday. You can get a 64 oz drink once a day for 7.99 a month.\n\n2.50 a 2 liter or 8 a 12 pack is a habit changing.", "score": 1, "replies": [{"body": "That’s also a loss leader to get you into the store as often as possible. If you buy a bag of chips or another snack they make a profit on the whole transaction…", "score": 1, "replies": []}]}]}, {"body": "A 12 pack of Coke is $10 at my local grocery.  I do not buy Coke.", "score": 25, "replies": [{"body": "Same here.  I never drank much soda anyway, but I will drink a glass or two watching a baseball or football game and always buy 2-liter bottles of whatever is cheapest.  They last a week or so if you really tighten the screw cap.    So I might drink 4 glasses from the bottle and throw the rest away and I only spent $1.19.", "score": 5, "replies": []}, {"body": "Do you mean a 12 pack of cans?", "score": 1, "replies": [{"body": "Yep, 12 pack is $9.99 right now, 24 pack is $17.99.  Absolutely crazy.\n\nThat is also \"on sale\".", "score": 1, "replies": [{"body": "It is insane here in Canada they were $3.50-4.00 before Covid not anymore though. I’ve cut back my soda purchases about 80% it just doesn’t seem worth it when all groceries are up so much.", "score": 1, "replies": []}]}]}]}, {"body": "They pay their shareholders a lot of that profit...if you want in...just buy their stock and hold onto it for the long term as it's one of the best dividend returns in all of the stock market.", "score": 30, "replies": [{"body": "Yup, and people are addicted. All of my family drinks boat loads of the stuff.", "score": 9, "replies": [{"body": "Hell I was addicted but I can’t fuck with these prices.", "score": 5, "replies": [{"body": "Yeah, I gave it up entirely though that was more for health reasons but I don’t mind the saved money", "score": 3, "replies": []}]}]}, {"body": "Exactly, a great stock to own", "score": 5, "replies": [{"body": "I buy Coca-Cola, I don't drink it :)", "score": 10, "replies": []}, {"body": "It's really a buy & hold", "score": 5, "replies": []}, {"body": "Was a great stock. Now the payout ratio is super high and the growth will be non-existent as soon as inflation cools down.\n I dont see much potential.", "score": 7, "replies": [{"body": "More foundational than growth, a rock solid dividend stock", "score": 2, "replies": [{"body": "This is a stock you buy $1000 worth of when you’re very young, allow it to reinvest dividends, and then never touch it again except maybe to buy more shares as we go through recessions. Obviously can start with more, and add more over time but letting it grow via dividends will work as well.", "score": 3, "replies": []}]}, {"body": "If your crystal ball is really that good, what are the Powerball numbers for the next drawing?", "score": -1, "replies": [{"body": "The payout ratio is over 70%\nThe dividend growth rate in the last 3 years was 3 %.\nThe revenue is basically the same as in 2010.\nTheir debt is super high.\n\nAll this shows that the good days are over. But if you habe a thesis, that Coke will generate a big amount of new customers with the healthy lifestyle trends and even more cheaper alternatives to reduce their high debt, the high payout ratio and increase the laughable dividend growth rate, go for it.", "score": 4, "replies": [{"body": "$43B is basically $35B? You need remedial math…", "score": 1, "replies": [{"body": "*2011, they generated 46 billion in revenue that year. I know they changed their strategy but their profit didnt move much also.\n\nWhy are you nitpicking my comment anyway? No comments regarding their payout ratio, the debt, the dividend growth?", "score": 2, "replies": []}]}, {"body": "You sound like the guy at Merrill Lynch that’s been trying to get me to sell this stock for 23 years now… he has been wrong the whole time and that is why I moved everything to TD.", "score": 1, "replies": [{"body": "Well the truth is that KO stock only rose about 30% in the last 25 years. Even if you include the dividend thats a shit performance compared to a normal index fund. \n\nSo your guy at Merrill Lynch was probably right.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Greedflation is everywhere", "score": 9, "replies": []}, {"body": "And then they wonder why they talk about corporate greed. This is a prime example .", "score": 56, "replies": [{"body": "Nobody needs these products, they could choose not to buy and prices would go down", "score": 49, "replies": [{"body": "If you aren't wealthy you can't have nice things or enjoy life!", "score": -22, "replies": [{"body": "I mean by that logic everyone should have Mercedes to drive too. It’s honestly good for your health if coke prices you out. If they seriously hurt their units sold then they’ll adjust their pricing. You don’t need soda to survive or any of their other products.", "score": 17, "replies": [{"body": "Yes, you did some kind of logic there. If we give people Coke we must also give them Bugattis.", "score": -9, "replies": []}]}, {"body": "So if you're poor you deserve luxury goods?", "score": -6, "replies": [{"body": "Imagine thinking coca cola is a luxury good that should be reserved for the \"non-poors\"", "score": 6, "replies": [{"body": "Is it a necessity?", "score": 11, "replies": [{"body": "If you work at all you should be able to afford mass produced syrup pumped into water, as your god given right as an American. So yes, if you're poor you deserve one of the lowest luxuries. Also a refrigerator.", "score": 5, "replies": []}, {"body": "Obviously it's not a necessity but it's also not asking for much either? Literally one of the lowest luxuries, a nice tasting beverage after a hard days work, syrup and caffeinated water is somehow a super luxury all of a sudden, being compared to owning a Mercedes", "score": 1, "replies": []}, {"body": "It's not a luxury or a necessity, it's an indulgence", "score": 1, "replies": []}]}]}, {"body": "Is water and sugar luxury?", "score": 4, "replies": []}]}]}, {"body": "Hahaha you can’t actually believe that right?", "score": -23, "replies": [{"body": "You think people need pop, chips and sparkling water?", "score": 18, "replies": []}]}, {"body": "Most people buy what they see advertised a lot. Walmart has a whole line of carbonated beverages, half the price (or less), so it’s not price that Coke and Pepsi are competing on…", "score": 1, "replies": []}]}, {"body": "Profit was right as expected, but revenue increased, so clearly their costs went up also. How is this a good example of greed?", "score": 3, "replies": []}, {"body": "Is this /stocks or /antiwork ?", "score": 11, "replies": [{"body": "I’m banned from r/antiwork lol", "score": 3, "replies": [{"body": "Based", "score": 9, "replies": []}, {"body": "Not sure why you’d come to an investing page and bitch about corporate greed", "score": 10, "replies": [{"body": "It's funny they complain bout corporate greed but at the same time buy stocks and bitch about how they are down and why profits are shrinking. The cognitive dissonance is something else", "score": 17, "replies": [{"body": "It’s nonsense, complaining about profits while asking for investment advice", "score": 4, "replies": []}]}, {"body": "You can be a awesome stock that profits greatly and not be greedy. Costco is a prime example.", "score": 6, "replies": [{"body": "Wrong page again", "score": -5, "replies": []}]}]}]}]}, {"body": "Actually they can’t force you to buy, people buy what they see advertised.", "score": 1, "replies": []}]}, {"body": "Thanks to higher prices I’ve stopped drinking my daily soda. Haven’t lost a pound 😔", "score": 5, "replies": []}, {"body": "take a look at margin decrease folks:-)", "score": 3, "replies": [{"body": "From the doc:\n\n\"• Operating margin: For the quarter, operating margin, which included items impacting comparability, was 20.5%  \nversus 17.7% in the prior year,\"\n\nAm I reading this right, they increased their profit margin 3%? Or is this actually saying they're profit margin decreased by 3%...", "score": 4, "replies": [{"body": "Increased ~300 bps. So they raised price, lower volume, but increased margin.", "score": 2, "replies": []}]}]}, {"body": "warren buffet would agree.", "score": 2, "replies": []}, {"body": "And at all the Dollar Generals and convenience stores around here Coke and Pepsi bottles are all going out of date.  Sales might have been good through the end of year, but volume has fallen off a cliff once people had to go back to higher prices a second time.", "score": 2, "replies": []}, {"body": "I remember first buying my own groceries when I went to college and soda was $6 a 12 pack. Then getting home after and being confused why my parents were paying 8, and then yesterday seeing its 10$ a case now. Shits ridiculous.", "score": 2, "replies": []}, {"body": "Everything they literally sell is sugar. You know what sugar does is that it causes cancer and diseases long term so yea don't drink sugary products. I stopped drinking sugar products like 4 months ago and now only drink milk which has some sugar in it but nothing like pops ice cream and all that", "score": 2, "replies": []}, {"body": "So blame inflation on higher prices but the higher prices makes more profit. Sounds like inflation isn’t the problem", "score": 2, "replies": []}, {"body": "How is Coke even allowed to own so many drink companies?", "score": 5, "replies": [{"body": "Wait till you see Pepsi", "score": 40, "replies": []}, {"body": "Well, there is Pepsi which also owns a large amount as well.", "score": 3, "replies": []}, {"body": "There is enough competition in the industry to prevent Coke from becoming a monopoly and therefore there is no reason to prevent acquisitions. There’s also fairly low barriers to entry in the drinks market, making building a monopoly much more difficult", "score": 2, "replies": []}, {"body": "That’s called diversification", "score": 0, "replies": [{"body": "Sounds monopolistic", "score": -7, "replies": [{"body": "coke buys other drink brands - diversify\n\ncoke buys all other cola drink brands - monopoly", "score": 10, "replies": []}, {"body": "I don’t think you know what a monopoly is", "score": 12, "replies": [{"body": "I didn’t say they were a monopoly", "score": -11, "replies": []}]}, {"body": "Lol wrong", "score": 1, "replies": []}]}]}]}, {"body": "It's a staple good. No matter what the market does, people will keep buying it.", "score": 2, "replies": [{"body": "It's crazy, I used to buy Coke products, but their price point keeps me away anymore. It's such an easily substitutable item and Pepsi is still keeping their prices lower.\n\nI'm honestly shocked that they aren't loosing market share.", "score": 4, "replies": [{"body": "Have to factor in restaurants. When you get a burger you most likely get a Coke product or if you go to a baseball, football, etc game.\n\nThey own so many things like Minute Maid, Powerade, Coke, Sprite, etc.", "score": 4, "replies": [{"body": "That’s why you buy the stock, not only are they in every restaurant/movie theater, they also own energy drinks, water, sports drinks, tea, juice, etc.", "score": 2, "replies": [{"body": "Yeah, I own PEP and KO.\n\nBut more PEP, better management, more diversification with food and snacks.\n\nThey both are getting into Coffee and alcoholic beverages too.", "score": 2, "replies": []}]}]}, {"body": "Because it's still dirt cheap, and it's always cost a little more than pepsi products.", "score": 1, "replies": []}]}]}, {"body": "$4.80 USD equivalent for a 12 pack of cans in Canada.", "score": 4, "replies": []}, {"body": "4 12 packs for $15 here in Utah.", "score": 1, "replies": []}, {"body": "I'm so happy they raised the price because my daily coke habit is no more.", "score": 1, "replies": []}, {"body": "I think I'd be short from here just based on the stock's performance.   \n\n\nKO last price was $ 59.59.  \n In the short term Coca Cola has been accelerating lower. In the long term Coca Cola has been accelerating lower.    \n  \nOver the past 21 days, the KO price increased 10 days and  decreased 11 days.  \nFor every up day, there were 1.1 down days. The average return on days where the price increased is 0.4811%\n\n The average return on days where the price decreased is -0.751%.\n\nOver the past 21 Days, the price has  decreased  by -3.47% percent.\n\n  \nOver the past 21 days, the average return per day has been -0.1652% percent.  \n\n\nhttps://www.volatilityfx.com/posts/coca-cola-trade-idea-how-to-play-the-short-term-trend-accelerating-lower-61f6d334-6763-4080-8601-f79afc84d2b6", "score": 1, "replies": []}]}
{"title": "Tesla all day", "selftext": "", "id": "112fhqf", "created_utc": 1676407090.0, "score": 71, "upvote_ratio": 0.73, "num_comments": 93, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|2 years ago\n**Total Comments**|16|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "How did this lug nut develop sentience?", "score": 52, "replies": []}, {"body": "Why is Tesla up $14?", "score": 23, "replies": [{"body": "You listen to Cathie at all? this shits going to $2.5k", "score": 27, "replies": [{"body": "I did listen to her last year and moved $17k of wife’s retirement to ARKW. Down $11k still.", "score": 16, "replies": []}, {"body": "elon tweeted “looking forward to investor day…”", "score": 2, "replies": []}]}]}, {"body": "Well done OP.  \nI'd just like to say, do not look at how much you could've made with the same capital had you bought 1 month out calls. \n\nDO NOT DO THIS. \n\nIT WILL RUIN YOUR LIFE !", "score": 16, "replies": []}, {"body": "This belongs in [r/stocks](https://www.reddit.com/r/stocks/).", "score": 31, "replies": []}, {"body": "Wtf is this shit. 50 fucking shares. A gain for ants?! You should be ashamed of yourself", "score": 49, "replies": [{"body": "https://preview.redd.it/w9y8kxak6aia1.jpeg?width=1290&format=pjpg&auto=webp&s=d8e22959a142aa4866c12b3b8c4fdc3d90bf7077", "score": 11, "replies": [{"body": "Of course you’d have AMC LOL", "score": 14, "replies": [{"body": "Yes cash out and went in again. Will sell before the earnings 😆", "score": 6, "replies": []}]}, {"body": "I can do math. Also my account is bigger than yours and so is my TSLA position LMAO", "score": 0, "replies": [{"body": "I did cash out early when I bought at 103 I cash out at 200 I was not expecting it will cross 200 but when it did 214 I waited and get in at 195 small I will scale in if it's go down I believe it will make new high this time", "score": 3, "replies": [{"body": "How big was the first position from 105 to 200? And welcome back to the moon rocket!", "score": 0, "replies": [{"body": "300", "score": 2, "replies": []}]}]}, {"body": "Proof?", "score": 2, "replies": [{"body": "https://preview.redd.it/fkm1son6ffia1.jpeg?width=1290&format=pjpg&auto=webp&s=7371aeae712fbb7c4540ebbbb7eafe94de61e4cd", "score": 1, "replies": []}, {"body": "Homie my TSLA position is 75 shares and a LEAP for Jun 2025 with some sold puts at 50 25 and 20. I ain't saying I am a major stakeholder lol. Just that 50 shares is pretty weak", "score": 0, "replies": [{"body": "50 is what left buddy", "score": 1, "replies": []}, {"body": "Bro ik, I was hoping you were gonna say “my source is me” ![img](emote|t5_2th52|8882)", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4276)", "score": 2, "replies": []}]}]}]}, {"body": "I just put up a 2500 sq ft pole barn with my bare hands, but I’m sure you’re a badass", "score": 1, "replies": [{"body": "I was fighting in Afghanistan when you were beating off in your mom's bathroom. Don't worry about me son. I got my shit figured out", "score": 1, "replies": [{"body": "I had been laying bricks for 10 years when Afghanistan rolled around, I beat off in my own bathroom. That must have been where you learned how to be a captain super douche then?  Don’t try to gaslight me, people only come on Reddit and bag on other people because of how inadequate they are in there own lives", "score": 1, "replies": [{"body": "It's 50 shares in a fucking degenerate gambling subreddit. Shut your pussy ass up. God, you are an insufferable cunt", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Why is that you should see my other holdings\n\nhttps://preview.redd.it/y8swzg7i6aia1.jpeg?width=1290&format=pjpg&auto=webp&s=47c21c2d566ed8b1d5fe17b83511c688ef92f670", "score": 2, "replies": [{"body": "https://preview.redd.it/n2z9vjvp7aia1.jpeg?width=1170&format=pjpg&auto=webp&s=64b55503c4958c31e15104f2a2d12b26802b6396\n\n![img](emote|t5_2th52|4270)", "score": 4, "replies": [{"body": "Will buy VTI", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4275)![img](emote|t5_2th52|4258)", "score": 1, "replies": [{"body": "I bought all 3 but small quantity. Will scale in as it go down\n\nhttps://preview.redd.it/2gegxodf9aia1.jpeg?width=1290&format=pjpg&auto=webp&s=997710a860a9d2c69599f5032fe6ae7d6906203e", "score": 2, "replies": [{"body": "It’s a good long term investment. 10 years at least", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Flair checks out", "score": 1, "replies": [{"body": "Bro, unless your pushing mils you can't even step to me. I got 75 shares and a TSLA LEAP with tons of puts sold and that ain't even post worthy on WSB to me. This is the hall of LEGENDS", "score": 1, "replies": [{"body": "Didn't judge I Dont lose I am keep cashing out 50 in my number to get in and bag when stocks goes negative here is my gains\n\nhttps://preview.redd.it/o5bp9486gfia1.jpeg?width=1290&format=pjpg&auto=webp&s=9b69d5d6cf0a4979b6bee0fa17e45c50a0d80b18", "score": 1, "replies": []}]}]}]}, {"body": "I just wanna have a portfolio where 10k is only 2% of my portfolio. Rn that 10k is bigger than my entire portfolio ![img](emote|t5_2th52|4270)", "score": 11, "replies": []}, {"body": "Don’t mind the haters. A win is a win 🥇", "score": 7, "replies": []}, {"body": "gain porn for ants", "score": 16, "replies": []}, {"body": "Made 25 k in a day today was awesome \nGo Tesla !!!", "score": 5, "replies": []}, {"body": "What’s a share?", "score": 3, "replies": [{"body": "Stocks", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4258)", "score": 2, "replies": []}]}]}, {"body": "I had a great day with TSLL!", "score": 3, "replies": []}, {"body": "B", "score": 3, "replies": [{"body": "O", "score": 3, "replies": [{"body": "R", "score": 3, "replies": [{"body": "I", "score": 5, "replies": [{"body": "N", "score": 3, "replies": [{"body": "G", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Posts like this should be permanently banned. It’s 50 shares… not a bet. Fuckwad", "score": 4, "replies": [{"body": "Take you head out from yours ass you want to see gain here it is. I play my way\n\nhttps://preview.redd.it/dmjx6bzfgfia1.jpeg?width=1290&format=pjpg&auto=webp&s=0d4c0ee20ecc6040e563902e941be339f21c206c", "score": 2, "replies": [{"body": "I don’t see any gains here…\n\nAll I see is a loser using Robinhood acting like a big baller", "score": 1, "replies": [{"body": "You are a loser I bet you don't even have 100k in your account. Check your eyes you miss the sell of 200k", "score": 1, "replies": [{"body": "https://imgur.com/a/hNGqHQY\n\nA little more than 100k", "score": 2, "replies": [{"body": "😂😂😂😂 you wish", "score": 1, "replies": [{"body": "Lol I love how once proven wrong you just say “fake” \n\nEnjoy your day, peasant", "score": 3, "replies": [{"body": "Send screenshots not stupid shot", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "3:37 60 $208.64 TSLA 1D 1W 1M 3M 1Y 5Y Your position Shares Market value 50 $10,432.20 Avg cost Portfolio diversity $195.24 2.30% Today's return +$700", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|28553)![img](emote|t5_2th52|2305)![img](emote|t5_2th52|28554)", "score": 2, "replies": []}, {"body": "Good luck this week…", "score": 2, "replies": []}, {"body": "Congratulations on Tesla.  A win is a win and we all need to start somewhere.  I've made the active decision to focus solely on trading Tesla and nothing else. I just bought my first shares last month. I'll be trading specifically using EMA Crossovers on a 30 minute chart for my signal.  For now Tesla should do extremely well going into the March First Investor Forum and as a long term hold", "score": 2, "replies": []}, {"body": "Calls would be better", "score": 2, "replies": [{"body": "Nah because it's expired and you lose stock if I am down I have enough capital to scale in and come out from the trade-in positive. Everyone has their own way to play. Market is unpredictable one bad new can ruined your account in options", "score": 1, "replies": [{"body": "I agree, but your gains would be a lot better with calls. Tesla is going to hit ATH soon as they have cornered the EV market in the western hemisphere, even moreso as we try to separate from Chinese anything", "score": 2, "replies": [{"body": "What you suggest ling term calls", "score": 1, "replies": []}, {"body": "Just add it to the pie\n\nhttps://preview.redd.it/s4zxxseoulia1.jpeg?width=1290&format=pjpg&auto=webp&s=1903e31db9e90ce220ff46e4d955a82d6172e800", "score": 1, "replies": []}]}]}]}, {"body": "Isn't this Rule 6? Mans only made like $700 in one day. \n\ncongrats, but i dont think most people would say it should be kept up", "score": 2, "replies": []}, {"body": "50 share for $195.24 I believe tesla will make new high this year .", "score": 3, "replies": [{"body": "Get this baby shit out of here", "score": 3, "replies": []}, {"body": "It’s called P/E ratio man", "score": 3, "replies": []}, {"body": "OP: convinced Tesla will make new highs this year.\n\nAlso OP: buys a measly 50 shares investing a grand total of 2% of his portfolio.", "score": 2, "replies": []}]}, {"body": "???", "score": 1, "replies": []}, {"body": "Dafuq are “shares”?", "score": 1, "replies": [{"body": "Stocks a shareholder", "score": 1, "replies": []}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": [{"body": "I have 200 shares in Tesla at $139.  My research led me to believe that Tesla is a world leader in the EV market and that market is still in it's infancy so HUGE upside potential yet and will easily be a 5 bagger from this level within the next 8 years.  I use Charts and T/A and will be strictly focusing on Tesla and trading 30 minute ema crossovers whenever they may present themselves which at this point are usually only every 2-3 weeks.  It shows a short trend with extreme accuracy and even with fluctuations in a uptrend I will hold until the signal tells me to sell.", "score": 1, "replies": []}]}, {"body": "Good for you OP !  nice move today ! Remember stocks like TSLA do not go straight up hang with it", "score": 1, "replies": []}, {"body": "Cool shares bro. This guy leverages.", "score": 1, "replies": []}, {"body": "10k is just a casual 2.3% right", "score": 1, "replies": [{"body": "Yes", "score": 1, "replies": []}]}, {"body": "Is this a shit post?", "score": 1, "replies": []}, {"body": "$10k is 2% of his portfolio.", "score": 1, "replies": []}, {"body": "$700. You're rich!", "score": 1, "replies": []}, {"body": "I see suffering.....", "score": 1, "replies": []}, {"body": "Lol shares\n\nGtfo", "score": 1, "replies": []}, {"body": "Im literally both long and short on Tesla and both are red I dont understand the market", "score": 1, "replies": [{"body": "How or why would you trade Tesla long and short at the same time.  You must not be using any Technical Analysis.  If you have a trading platform use a 1 month 30 minute chart and plot a standard EMA with crossover, or just a standard EMA and look for the crossovers yourself.  It shows with extreme accuracy the short term trend whether up or down and just trade the crosses.", "score": 2, "replies": [{"body": "It was kinda an experiment but it didnt work well until now", "score": 1, "replies": []}]}]}, {"body": "What’s a “share”", "score": 1, "replies": [{"body": "https://en.wikipedia.org/wiki/Shares_outstanding", "score": 1, "replies": []}]}]}
