{"title": "Fed Chair Powell says disinflationary process has begun.", "selftext": "***Powell stated:***\n\n* \"Just at the beginning\" of the disinflation process.\n* \"Must keep rates at restrictive level for period of time\"\n* This process is likely to take \"a good amount of time\"\n* \"We expect significant progress on inflation this year,\"\n* Our job is to get inflation down to 2%\n* He is mostly worry about disinflation in core services, excluding housing. He is expecting the housing services to see disinflation in the second half of this year.\n* The Federal Open Market Committee increased its benchmark by 25 bp last week, stepping down from the 50 bp hike in December, and four straight 75 bp prior to December.", "id": "10wb3ju", "created_utc": 1675799153.0, "score": 297, "upvote_ratio": 0.96, "num_comments": 93, "comments": [{"body": "Disinflation is transitory.", "score": 274, "replies": [{"body": "And leads to deflation", "score": 30, "replies": [{"body": "the Fed was originally created because of how quickly and easily it could reverse deflation (which was impossible on the gold standard)...", "score": 19, "replies": [{"body": "Powell has said that the federal interest rate will remain at 4%-5% in 2023-2024. Hopefully, the economic side will not collapse.", "score": 6, "replies": [{"body": " historically 4 to 5% is low ... and Powell is a puppet for the 1%, 4 or 5% is not going to do shit for greedflation i mean real inflation", "score": 9, "replies": []}]}, {"body": "Then they learned about the liquidity trap.", "score": 2, "replies": [{"body": "This is like the SBF scandal on a whole different level. Lol", "score": 2, "replies": []}]}, {"body": "“We print it, digitally”", "score": 3, "replies": []}, {"body": "LOL how did this comment actually get upvoted? \n\n1913: Fed created.\n\n1933: End of gold standard.", "score": -3, "replies": [{"body": "1971*", "score": 2, "replies": []}, {"body": "[removed]", "score": 0, "replies": []}]}]}, {"body": "I don’t think there’s any danger of that.", "score": 2, "replies": []}, {"body": "Leads to stagflation, which leads to mandate 2.", "score": 0, "replies": []}, {"body": "Flacid", "score": -1, "replies": []}, {"body": "That would be not transitory.", "score": 1, "replies": []}]}, {"body": "It sure is ☠️", "score": -1, "replies": []}]}, {"body": "There was a lot of speculation that Powell would want to slap the market down after rallying on his comments during the FOMC meeting last week, but what ended up happening was the exact opposite in my opinion.\n\nPowell didn't just not push back on the market, but sounded surprisingly dovish at times. He was given plenty of opportunities to raise concerns about the tight labour market, but seemed rather unbothered by it. In fact, he basically dismissed last week's jobs number entirely as noise.\n\nIf I'm recalling correctly at one point he even corrected himself from saying, \"we believe ongoing rate increases will be appropriate\" to, \"we anticipate ongoing rate increases will be appropriate\". It was subtle, but the way he hesitated with his wording then went in a more dovish direction was notable.\n\nI also thought his comments around inflation coming down to target at some point next year was interesting... It sounded almost as if he was back to the \"inflation is transitory\" narrative – admitting it would be high this year, but probably sometime in 2024 it should be back to target. To me it sounded like the Fed would be fine with above target inflation for quite some time so long as it was slowly trending in the right direction.\n\nBut I guess to summarise I thought it was extremely bullish. My only hesitation is simply the fact the market feels a quite over-brought near-term. MSFT, GOOG and NVDA all finished up over 4% today lol.", "score": 97, "replies": [{"body": "Powell's objective isn't to cause the stock market to drop. It is to get inflation under control. The stock market is irrelevant to 45% of people in this country.", "score": 75, "replies": [{"body": "Which is the beauty, if inflation goes down, Powell is cool with assets going up.", "score": 27, "replies": []}, {"body": "Sort of.  It still has a notable impact on total consumer spending which obviously ultimately impacts everyone.  Wealth effects are real and well documented.\n\nIt also influences business investment / spending contributions to GDP, executive pay, etc.  Financial conditions are correlated to the stock market as well.\n\nIt is 100% true that the economy, labor, and inflation are primary concerns and stock market is secondary, perhaps even tertiary if you include credit markets.", "score": 10, "replies": []}, {"body": "But not to us, obviously…", "score": 1, "replies": []}]}, {"body": "weird how it was pretty hawkish, and you interpreted it as dovish.\n\nPowell has basically given up on jawboning against market. He's chosen the path to communicate by explaining to the market what the Fed's looking at, so the market's views can align with the Fed the moment new data comes out, instead of having to \"correct\" market's views every week unsuccessfully. The Fed has also chosen to communicate more through the SEP, as hinted by Fed George last year before the December FOMC.\n\nHere are the hawkish points. I'd like to see how you interpreted these as dovish.\n\n\\- Re-emphasized that not seeing ANY disinflation in the core services excluding housing component, which makes up 56% of core PCE, and dominated by the labor market. Re-emphasized currently in the EARLY stages of disinflation and it will likely be well into 2024 for inflation to go back down to acceptable levels\n\n\\- said twice that if the data keeps coming in stronger, won't hesitate to increase the peak rate higher than previously projected (added this on his own, was not asked). Did NOT mention the opposite scenario, which is if inflation comes in cooler, will cut rate earlier or have lower peak rate.\n\n\\- Reiterated that the Fed will not settle for 3% inflation and will do whatever it takes to get it down to 2%.\r  \n\r  \n\\- mentioned that market should not think the disinflation process is gonna be smooth, or guaranteed to be a painless one", "score": 17, "replies": [{"body": "I don't really disagree with you. I think what's changed is exactly what you said – the Fed's simply stopped jawboning markets. But imo that is a massive dovish shift in communication as Powell no longer seems concerned with what the stock market is doing and now seems to be just focused on responding to inflation data.\n\nLast year even if you believed inflation was going to come down you couldn't simply buy stocks on good inflation data because you still had to navigate around the risk that at any moment the Fed could decided to jawbone against a positive market reaction. We saw this happen a few times last year despite it being fairly obvious that inflation would come down.\n\nThis meant for some time good data was irrelevant and bad data was bad.\n\nBut the Fed is now once again showing they're neither consistent or credible in their messaging, and are once again, in effect, rewarding investors who bet against them.", "score": 1, "replies": [{"body": "No Powell is very much concerned with what the (bond) market's doing. In fact, he mentioned that the bond market was \"more aligned with the Fed\" (on their own) after the Friday job report. Powell was never really super concerned with the stock market because there're many other factors that affect it like earnings.\n\nAnd he tried to jawbone the market, but it seems like he failed again. He said they might increase peak rates more, they're not seeing any progress in the biggest inflation component, they're going to hold rates for longer, they're not going to change their inflation target, it's not going to be a one way ticket down for inflation. What else do you suggest he say? That he anticipate there'll be a recession?\n\nIt was obvious inflation would go down from 9%. It was not obvious inflation would go down to below 4%, and it's still not obvious now. The problem last year was the market had no clue about the peak rate because it kept getting revised up every month, because inflation kept getting worse every month. When good inflation data popped up like in the summer of 2022, Fed still jawboned the market but stocks still went up. Stocks only went down again because inflation accelerated up again. Now that the Fed has settled for a peak rate, they've lost an effective jawboning method because they can't just loosely say peak rate will be higher. They can only say they're going to hold rate for longer, which they cannot prove to the market. Furthermore, they're downshifting their rate hikes (since they're close to their peak rate), which appears dovish.\n\nThere was no period where good data was irrelevant.", "score": 3, "replies": [{"body": "I agree with you on Powell being more focused on the bond market then the stock market, but bond yields have a direct impact on asset valuations. If Powell jawbones bond yields higher, then he's effectively lowering the value of all risk assets too. That's what I meant.\n\n\\> And he tried to jawbone the market, but it seems like he failed again. \n\nI guess we're just interpreting what he said differently. Saying that the bond market is more aligned with the Fed is basically him saying the market is accurately pricing Fed policy – implying that yields are fine despite continuing to fall.\n\nBut adding to that he was also saying how financial conditions have tightened which as far as I can tell seem to just be objectively wrong, and again suggests the Fed isn't going to fight the market.\n\n\\> Now that the Fed has settled for a peak rate, they've lost an effective jawboning method because they can't just loosely say peak rate will be higher. \n\nThey can do what they want, but this is what I was touching on – the more they back themselves into a corner the more they erode their credibility and end up rewarding those who bet against their guidance. If we assume inflation accelerates then investors are forced to decide if they believe in the Fed's guidance, or if they'll be forced to guide differently. If you believe the Fed's guidance is credible then in theory the data doesn't matter because it won't change Fed policy. \n\nPerhaps in this regard I think Powell is more hawkish than you because I think they'll throw out their current guidance if inflation accelerates again.\n\n\\> There was no period where good data was irrelevant.  \n\nI wasn't very clear – I always personally thought the data was relevant but that's because I don't believe in the Fed's guidance. Plenty of investors have been arguing stocks will go down because \"don't fight the Fed\". They have been wrong.", "score": 1, "replies": [{"body": "That's totally different from what you meant in terms of bond vs stocks. Bond can predict a recession by inverting the 2 yr/10 yr, but stocks can still rally because a recession hasn't happened yet, and the lower 10 year yield boosts stock valuation. That's actually what's happening right now. Powell can only do so much to influence the 10 year rate. The Fed controls the 2 year, not 10 year.\n\nThe nominal yields are falling, due to the inflation expectation falling. The REAL yield is not falling that much. Fed cares about the REAL yield. What Powell really cares about, is to maintain about 1.5% REAL yield across all short and medium time span.\n\nHow the Fed defines financial conditions is different from how WE define it. The Fed is concerned about financial conditions associated with interest rate. OUR financial conditions include a bunch of extra stuff like stock prices (which is affected more by corporate profits), spreads (which is heavily influenced by risk premiums), currency (influenced by what other countries do), etc.\n\nYou seem to be implying the Fed doesn't care about data, which is flat out wrong. What data is the Fed ignoring? The Fed is dissecting components within the inflation numbers, looking forward 6-9 months out, not backward looking data. Just because you have a 0.3% core PCE MoM data doesn't mean we're out of the woods. Powell said in the last FOMC that the deflation/disinflationary components like commodities, energy, durable goods are all transitory and WILL revert their trends by middle of 2023. Without those deflation/disinflation contributions, we can easily go back to around 4% annualized (not annual) core PCE. As for the job market, the wage inflation is still 1-1.5% above what's consistent with 2% inflation. Outside of wage inflation, every other job number indicate the job market is still extremely tight.\n\nSo exactly what data is the Fed ignoring? Which part of their guidance don't you agree with? The bears have been wrong because SP500 went up to 4150 in 2 months? Did you completely ignore the period when SP500 went up to 4320 from 3650, just to drop back to 3500? By the way, a lot of the bearish strategists told people to buy Sp500 in Oct at around 3600 and predicted a year end rally up to around 4100.\n\nPrecisely, all the bearish strategists who are predicting a recession in the second half of 2023, revised their 2022 sp500 target to 4000 around Sept 2022. See below for 2022 price target.\n\nhttps://www.cnbc.com/market-strategist-survey-cnbc/", "score": 1, "replies": []}]}]}]}]}, {"body": "Hes doing the opposite by using terms like disinflation. To be honest I used to fear this guy and the fed after the ordeal in late 2018, but now I'm starting to believe the market does what it wants without what he says or does. To be fair I don't blame them, he's lost credibility.", "score": 14, "replies": [{"body": "Yup the .25 hike was a huge signal that he isn’t serious about bringing inflation down to 2%", "score": 4, "replies": [{"body": "The market is pricing in a rapid drop in inflation this year. It’s already trending in the right direction, so it makes little sense to continue with 50/75 bp hikes. If the fed signalled that they would soon pivot I would agree with you, but they haven’t expressed that.", "score": 1, "replies": []}]}, {"body": "He has no credibility left imo. He keep changing ideas and plan (which is good in and on itself but not when your word hold so much power)", "score": 1, "replies": [{"body": "How has he been changing ideas and plan?  Target rate has been 5.25 since early last year and has not moved.", "score": 0, "replies": []}]}]}, {"body": "I too watch CNBC", "score": 5, "replies": []}]}, {"body": "Felt the interview was a little more hawkish than doveish -- 2% strict goal, likely not to reach goal until 2024, willing to raise rates higher, core services disinflation has not yet begun -- but overall just a lot of reiterating what he's said before.", "score": 60, "replies": [{"body": "There’s this thing called flexible average inflation target. If you realise powell did not specifically say 2% of which inflation.\n\nEdit: bears getting fked please downvote this", "score": -41, "replies": [{"body": "You’re being downvoted because Powell did specifically say they’re targeting 2% inflation.", "score": 6, "replies": [{"body": "Agree, but there’s this thing called FAIT", "score": -2, "replies": [{"body": "FAIT was part of their policy over a year ago when inflation was just starting to pick up and the transitory narrative was still prevalent. The fed has been pretty clear since then that they’re not going to consider easing until inflation is down to 2% for some time.", "score": 3, "replies": []}]}]}]}]}, {"body": "Niceeeee", "score": 12, "replies": []}, {"body": "That word hurts my brain.", "score": 4, "replies": []}, {"body": "Bullish", "score": 24, "replies": [{"body": "I suppose if you think short term interest rates in excess of 5% is bullish.   I supposes it is for the savers among us.", "score": -6, "replies": [{"body": "It is given where we were just months ago with huge inflation then huge rate increases. People now seeing that temporary act of huge hikes IS actually working and seems like of ot continues in this direction then Powell will start to change his tune. He says we'll need to wait and see but most investors are seeing that it's likely to be good news after waiting. So yes bullish if we really are on track for current rate plan and somewhat soft landing.", "score": 9, "replies": []}]}]}, {"body": "So don’t fight the fed?", "score": 3, "replies": []}, {"body": "Seems Dovish from this interview and the FOMC.\n\nPowell seems happier, even making jokes.\n\nUsually he is very monotone and serious.\n\nMust be forecasting and getting good data..just has to keep jawboning that the job is not done and have to keep going to over 5%.\n\nBy March, data could pivot.\n\nWildcard right now is China. Will that help or cause more inflation. I think it will lower inflation by bringing economies back to normal and alleviate the supply side problems.", "score": 15, "replies": [{"body": "BLS is changing their inflation calculations for January, to only account for previous one year of consumer expenditure data, instead of two years. Data will pivot for January.", "score": 15, "replies": []}, {"body": "In case you don't know, this was an interview, not an FOMC Q&A. During the FOMC Q&A, he's representing the whole committee (with different viewpoints), and the committee specifically coaches him on how to answer or word answers. That's why he's gotta be serious during FOMC Q&A. You could observe the same difference in behaviors between his Brookings interview and December FOMC Q&A, or just watch any of his interviews in 2022.", "score": 3, "replies": [{"body": "I wrote interview in my first line and yes I am aware.\n\nEven the last FOMC presser, Powell seemed happy and relieved. Obviously inflation is starting to not increase as much.", "score": -1, "replies": [{"body": "if you're completely ignoring what he's saying and calling him dovish purely based on his \"happiness\", I don't know what to say.\n\nBy the way, the interviewer asked a ton of small talk questions to ease him off, which is why he \"seemed happy\". In fact, half of the interview was just answers to dumb questions like his salary, does he boss his FOMC fellows around, blah blah.", "score": 1, "replies": []}]}]}, {"body": "China coming online isn't going to lower inflation.. they compete on the same global markets for commodities that the rest of us do.\n\nIncreased demand is increased demand..", "score": 0, "replies": [{"body": "It is expected they will not reinstate the massive real estate market development, so that large commodity demand may be way lower or gone for now (which is a large part of their commodity demand).\n\nTheir outputs are inputs for many goods which can be deflationary for USA goods and consumer costs. This is an offset to their commodity inflation effect.\n\nEnergy consumption will increase , so that is worth watching.  Oil may have a portion of this already priced in as it went from 70 to 80.\n\nMy point, some are starting to believe it may not be a sharp inflationary effect to the US across the board , for the next several months at least.", "score": 8, "replies": []}, {"body": "So parts, chemicals and inputs made by China to go into factories worldwide will not fix prices?\n\nRight now lead times and lack of parts/inputs is causing the prices to rise.", "score": 2, "replies": [{"body": "Unless you can show otherwise, most of the issues you are referring to were from increased demand, all around the world, at the same time rather than from a decrease to supply.", "score": 0, "replies": []}]}]}]}, {"body": "soft landing was real", "score": 13, "replies": [{"body": "[deleted]", "score": 24, "replies": [{"body": "What do you think will happen? Thanks", "score": 5, "replies": []}, {"body": "Nope he should put a “Mission Accomplished” banner and take a victory lap", "score": 3, "replies": []}]}, {"body": "A soft landing would be a couple years of inflation on target at neutral interest rates. This would be a rate of around 2%.", "score": 1, "replies": []}]}, {"body": "Phew, almost thought inflstion and high interest rates were an issue.  No chance of a recession now.", "score": 4, "replies": []}, {"body": "Powell wants to re-inflate the stock market for whatever reason, even at the cost of dragging out inflation.  By hinting interest rates are going to go down by the end of the year, he lends support to earnings and multiples expansion.  Turkey is a good example of a positive GDP growth rate in the context of rising inflation and currency devaluation.", "score": 8, "replies": []}, {"body": "he also said inflation is transitory, so consider the source", "score": 2, "replies": []}, {"body": "Time to start easing into some stocks here and there cause i think in july the market is gonna move up for a while", "score": 7, "replies": [{"body": "I started last week.  But I have stop losses set just in case.", "score": 2, "replies": []}, {"body": "You think it’s happening in July? Where have you been the past 2 months?", "score": 1, "replies": []}, {"body": "I started weeks ago but only dividend stocks.  $T and $KMI are cheap right now also nice for swing trades if you need the cash.", "score": 1, "replies": []}]}, {"body": "Dont worry i’ll speak for all bears: my a** got f*ed", "score": 7, "replies": []}, {"body": "Well, he did say inflation was transitory some time back so that's there", "score": 1, "replies": []}, {"body": "I attended the economic council today and, based on his answers, believe future rate hikes will continue", "score": 1, "replies": []}, {"body": "So if he is trying to get inflation back to 2% without any deflationary period, are we just supposed to accept the 9% higher cost of living for the rest of our lives? And that will grow further by 2% every year? Shouldn't their goal to be return cost of living back to prepandemic levels and not just accept higher costs forever.", "score": -7, "replies": [{"body": ">So if he is trying to get inflation back to 2% without any deflationary period, are we just supposed to accept the 9% higher cost of living for the rest of our lives? \n\nYes\n\n>And that will grow further by 2% every year? \n\nYes\n\n>Shouldn't their goal to be return cost of living back to prepandemic levels and not just accept higher costs forever.\n\nNo. That would result in an economic disaster", "score": 14, "replies": []}, {"body": "Would you like to lose your job?\n\nBecause millions of people losing their jobs is your only actual pathway back to 2019-2020 prices. You'd need a financial crisis to get there.\n\nYes, it sucks. Sorry. You're going to have to adapt in the world where there's no financial crisis and maybe pushback on companies can get prices lowered some, but you won't get it back to 19/20 prices.", "score": 9, "replies": [{"body": "Well duuh. Isn't a financial crisis unavoidable? Especially if monetary policy/politics influences the economy creating negative externalities thereby fucking up everything even more? \n\nI mean we are trying to optimize and stabilize a system that is so complex nobody understands it. The wealth disparity between the rich and poor is getting bigger and bigger. You can literally watch it on the streets how it gets worse. The rich are using housing as a specualtiv investment. Our financial markets are regulating themselves more and more, making up rules by the minute for which you need an army of lawyers and decades to get past. \nNot even gonna talk about what's gonna happen when the whole stock market crashes and shareholders lose hundreds of billions... Because what you gonna do? Price in the next 5000 years into apple stock so it's gonna go to 10 trillion? \n\nYes it's a complex system and we shouldn't make it more complex because it's gonna come down hard like it always has. That's just normal, the severity may differ tho.", "score": -2, "replies": [{"body": "I suppose my point is is if we were to get to the point where millions get fired through the consequences of tightening, we won’t continue beyond then without some easing occurring, so while we might see some deflation in prices, the massive deflation needed to return to 19/20 price wise has a next to 0% chance of occurring without a financial crisis rivaling 08/09.\n\nFolks may have wanted him to be, but ultimately, Jay isn’t Volcker, and Volcker wouldn’t have been able to be Volcker in the modern day anyway.", "score": 1, "replies": []}]}, {"body": "It kinda depends on what kind of prices. Gas prices could return to something like what we've seen over the past 10 years. During the past three months, this was momentarily the case.\n\nHousing prices and rent? Quite possibly not.", "score": 1, "replies": []}]}, {"body": "The only thing that would get those prices to return is if people quit buying stuff, and if you quit buying food then that likely means you have no job and/or money.", "score": 4, "replies": []}, {"body": ">n corrected himself from saying, \"we believe ongoing rate increases will be appropriate\" to, \"we anticipate ongoing rate \n\nif you want that, you know who to vote for", "score": 1, "replies": []}]}, {"body": "[so Cathy wood was right… time to buy growth stocks?](https://www.the-random-investor.com/post/this-is-when-the-stock-market-will-bottom)", "score": -3, "replies": []}, {"body": "Don’t forget history. What did the fed do leading up to the 2008/9 recession? See a pattern?", "score": -5, "replies": [{"body": "Why don’t you just say what they did instead of asking a question where we gotta do the work", "score": 6, "replies": []}, {"body": "What did they do?", "score": 6, "replies": []}]}, {"body": "Disinflation... with Cramer saying it's a bull market...\n\nDeflation Confirmed.", "score": 4, "replies": []}, {"body": "How long is “A period of time “? How long is “quite some time”? I’ve had to shit for “quite some time “ means a few hour, in the context of having a movement. How long is ”quite some time “ when talking about deflation?", "score": 1, "replies": []}, {"body": "The big question in USA and EU, is what power does the worker actually have.   \n\n\nLogic would say to expect tense inflationary salary increases due to lack of man power and tons of available jobs. But that still requires the worker to actually have negotiation power, which we will have an answer to in 2023.", "score": 1, "replies": []}, {"body": "This current fed board is clueless.", "score": 1, "replies": []}, {"body": "Balance sheet was still 8.4 trillion on Feb 1st, though, no?  They gonna start reducing that more or what?", "score": 1, "replies": []}, {"body": "Short term bullish. 1-2 years bearish. Sell SPY buy TLT", "score": 1, "replies": []}, {"body": "Transitory Powell", "score": 1, "replies": []}]}
