{"title": "Why NVDA so green?", "selftext": "", "id": "11aq1by", "created_utc": 1677241005.0, "score": 160, "upvote_ratio": 0.84, "num_comments": 89, "comments": [{"body": "Because I sold yesterday..", "score": 205, "replies": [{"body": "Lol I sold on Tuesday", "score": 13, "replies": []}, {"body": "i bought at top and im red", "score": 6, "replies": []}, {"body": "Sad smh", "score": 5, "replies": []}]}, {"body": "Your graphics card is on overdrive", "score": 30, "replies": []}, {"body": "It was so ordinary earnings. But they said AI  atleast 70 times.\n\nOn the same day of results...earlier folks bought options $240 for ¢40 or lesser. The next day it was going for $3.30", "score": 100, "replies": [{"body": "I thought their enterprise sales missed estimates and their consumer sales exceeded… did I miss something…. I think enterprise sales is more revenue and more important for long term? So it seems earns we’re just okay or even bad", "score": 5, "replies": [{"body": "“Did I miss something” \n\nYou missed the earnings call where they said the letters A and I about 500 times. Investors really like these letters right now so price goes up.", "score": 6, "replies": []}, {"body": "Hype and greed", "score": 6, "replies": []}]}]}, {"body": "because revenue boost from AI, what is it?", "score": 47, "replies": [{"body": "No, that's too much trouble, you only need to say \"AI\" a lot and BOOM, 14% gain", "score": 13, "replies": [{"body": "There is this great ~~tech~~ AI company that you check out - WeWork!\n\nYou might think they rent offices, but rest assured, they are highly sophisticated AI corp.", "score": 3, "replies": []}, {"body": "It makes my head hurt how these corporations/market manipulators can pull the strings. 14% on a company that massive is so absurdly fucked it’s not even funny, and this isn’t even an egregious example.", "score": 2, "replies": []}]}, {"body": "Search Finviz on apple store, you will find it there", "score": 3, "replies": [{"body": "And on Android?", "score": 1, "replies": [{"body": "Use the website", "score": 1, "replies": []}]}]}]}, {"body": "AI", "score": 21, "replies": []}, {"body": "This has been the pattern for most big stocks during this earnings season.  Irrespective of the result the stock jumps 10-15%", "score": 7, "replies": [{"body": "And then falls back down", "score": 2, "replies": []}]}, {"body": "They beat earnings expectations and the ceo came out and talked about how chat gpt and ai is going to boost them further.", "score": 14, "replies": []}, {"body": "Pump and dump scheme to lure retail investors", "score": 12, "replies": [{"body": "Can we pump and dump some INTC please??? 🤣", "score": 3, "replies": [{"body": "No", "score": 6, "replies": []}, {"body": "INTC is the new CSCO", "score": 3, "replies": [{"body": "Omg... Imagine this shit hits $12 and stays there for twenty years? Or worse, it becomes like IMMR or NOK and just languishes.", "score": 1, "replies": [{"body": "It won't. Intel has a viable market.", "score": 1, "replies": [{"body": "So does Cisco", "score": 2, "replies": [{"body": "and cisco has a predictable income/revenue stream.", "score": 1, "replies": [{"body": "Just like Intel. I mean it's quite rocky at times, but Intel manages to make solid margins and Intel is a major player in compute market.", "score": 2, "replies": [{"body": "my point exactly. intel being low just makes it a good buy", "score": 1, "replies": [{"body": "Not at all. It performs decently well financially, but for a lot of bad press the stock value is quite low. Computer hardware stock buyers are really unreasonable. Maybe for investing stock is fine, but now they cut their dividends as well, which used to be a really nice feature of that stock. Tech stocks often don't pay dividends and it's management thing to decide to pay them, as well as shareholder thing. It's in many ways similar to Volkswagen stock, which has been very lowly priced after dieselgate it pays dividends well, despite healthy financials, the just seems to have lost a lot of reputability in US. It's not the greatest stock to buy, but it's not completely awful either. Intel is now Volkswagen of tech sector.", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "maybe last week when the \"safe\" dividend was 65% higher. Whole ass one thing, never half ass two things.  \\~Ron Swanson\n\n  INTC is half assing production and has so much inventory, it is safe to say they half ass the chip design as well.\n\nBut young investors see the low P/E and get sucked in to \"its value bruh\"", "score": 3, "replies": []}, {"body": "They did today... Took fucking 4 hours but price skyrocketed then plummeted promptly.", "score": 3, "replies": []}]}, {"body": "But when will the dump happen?", "score": 1, "replies": [{"body": "When you buy in.", "score": 1, "replies": []}]}]}, {"body": "Because Jensen mentioned AI 75 times during ER.", "score": 5, "replies": [{"body": "To be fair he's talked about AI for over a decade.  Beyond ChatGPT they hope to power a lot of AI technology for  medical research, self-driving auto and other fields that are not currently producing meaningful revenue for them.  \n\n&#x200B;\n\nFrom WSJ recent article\n\nIn the near term, at least, Nvidia’s dominance in AI may position it best to cash in. The company gained its lead by allowing software developers to exploit properties of its graphics chips that proved adept at AI starting about 15 years ago. Now, the company’s chips are the only viable products that can be used to create massive AI language systems, UBS analysts said in a note, adding that they estimate that ChatGPT requires around 10,000 of the company’s graphics chips to train.", "score": 5, "replies": []}]}, {"body": "Powering the recent rush of AI?  Honestly no clue", "score": 4, "replies": []}, {"body": "because of the \"***AI\"*** stuff.", "score": 3, "replies": []}, {"body": "Everyone using A.I to trade, and it's buying it's maker. All hail the Algorithm.", "score": 3, "replies": []}, {"body": "Market manipulation  duh", "score": 10, "replies": []}, {"body": "Earnings bro", "score": 6, "replies": []}, {"body": "Because their sales are down majorly YoY and they need to keep that pe hovering around 100.  Nice to see they added 50% of Intel's market cap in one day haha.", "score": 5, "replies": []}, {"body": "The inverse Cramer didn't work D;", "score": 2, "replies": [{"body": "It can but for today the 0DTE crowd has built a nice put wall at $230 and the market maker doesn't like to pay. Similar there is a call wall at 232.5 and by the looks of it he does not like to pay them either.", "score": 1, "replies": []}]}, {"body": "Already recceding.  Next week back to 230s like before.  These days earning surprises do not stick long.", "score": 2, "replies": []}, {"body": "Microsoft announced it would brings its PC games over to Nvidias cloud services", "score": 2, "replies": []}, {"body": "Cause Nvidia green, AMD red. Simple.", "score": 2, "replies": []}, {"body": "Man sometimes reddit is like... \n\nIdk.  I just don't know.", "score": 2, "replies": []}, {"body": "Right now there’s a gold rush in AI and nVidia announced that they’re selling $10,000 shovels.", "score": 2, "replies": [{"body": "This right here. Semiconductors are the shovels of the new industrial revolution.", "score": 2, "replies": []}]}, {"body": "Why are you so lazy", "score": 1, "replies": []}, {"body": "Jesus bro at least try googling the stock….", "score": 1, "replies": []}, {"body": "Bubble?", "score": 0, "replies": []}, {"body": "People are stupid", "score": 0, "replies": []}, {"body": "Part of the AI pump n dump", "score": 0, "replies": []}, {"body": "Take profits BYND and 🏃‍♂️🔥", "score": 1, "replies": []}, {"body": "Hey Eye!", "score": 1, "replies": []}, {"body": "Because CNBC and Cramer have been pumping relentlessly for 4 days. Multiple times per hour", "score": 1, "replies": []}, {"body": "earnings", "score": 1, "replies": []}, {"body": "Pump and dump!", "score": 1, "replies": []}, {"body": "If BRK was owner of 50% of AAPL, that means it is undervalued? I know it not owner of 50% of AAPL, it just a mental excercise", "score": 1, "replies": []}, {"body": "Apes", "score": 1, "replies": []}, {"body": "#NVDS", "score": 1, "replies": []}, {"body": "Kens program loaded up enough options to cash out liquidity again", "score": 1, "replies": []}, {"body": "That were part of the package deal that bought activision", "score": 1, "replies": []}, {"body": "Because I sold it", "score": 1, "replies": []}, {"body": "AI, and the Mercedes deal.  Better way to invest in the Mercedes deal is LAZR!!!", "score": 1, "replies": []}, {"body": "Exactly. Why", "score": 1, "replies": []}, {"body": "People expected them to underperform the expectations. While their - growth is substantial, it is also a bit to be expected for a cyclical. Though they did just lose the ETH miner customers", "score": 1, "replies": []}, {"body": "It’ll fall next week, too many 0DTE puts today. They would have to pay out so much it’s insane, it’ll stay propped up till Monday", "score": 1, "replies": []}, {"body": "BIG DONKS", "score": 1, "replies": []}, {"body": "chatGPT", "score": 1, "replies": []}, {"body": "Because ChatGPT or something vaguely associated with nvda", "score": 1, "replies": []}, {"body": "🤷🏻‍♂️🤷🏻‍♂️🤷🏻‍♂️", "score": 1, "replies": []}, {"body": "Question for the experts, when do you take profit? Lets say you bought the stock and it goes 30% up, few months later. Do you sell and take profit? You never take profit and just hold them for 10 years, no matter what? I bought like 10 stocks in 2022 that went up between 20 and 30%... but never took profit. Some of them went back down and are at the beginning, so 0% profit in those stocks now. How do you deal with that? Do you set an alarm when the stock goes up 30% you sell, or how do you do it?", "score": 1, "replies": []}, {"body": "Articles about how their last chip is heavily used in AI", "score": 1, "replies": []}, {"body": "What do you think of MULN's amount of short selling? is the strong hand very big?", "score": 1, "replies": []}, {"body": "Aint no telling. Must be getting ready to release some new fancy cards or something because all i see on fb marketplace these days is nvidia 3060’s and up cards being sold everywhere within 250 miles of Northwest arkansas. 🤷‍♂️", "score": 1, "replies": []}, {"body": "Where is googl? I can't find it here!!! (Help?!)", "score": 1, "replies": []}, {"body": "Algos like the term Ai.  Fuck, that’s some irony.", "score": 1, "replies": []}, {"body": "What is this platform right here called? Where it shows you everything?", "score": 1, "replies": []}, {"body": "Because it's the weekends.", "score": 1, "replies": []}, {"body": "It's going red.", "score": 1, "replies": []}, {"body": "For how marginally they beat their Earnings, I can see them dropping pretty significantly this next week or so.", "score": 1, "replies": []}, {"body": "They reported great earnings the other day", "score": 1, "replies": []}, {"body": "AI and ChatGPT driving optimism for NVIDIA product demand.", "score": 1, "replies": []}, {"body": "Think your computer got red and green confused", "score": 1, "replies": []}]}
{"title": "The Kangaroo market continues… 2-24-23 SPY/ ES Futures and Tesla Daily Market Analysis", "selftext": "[removed]", "id": "11b2uqn", "created_utc": 1677274644.0, "score": 118, "upvote_ratio": 0.91, "num_comments": 85, "comments": [{"body": "The VIX has been absolutely infuriating to watch. Tiny moves on massive downside. \n\nI’ve actually joined the 0DTE mania, if you can’t beat ‘em join em. \n\nI’m playing SPY on the 1 minute chart and buying ATM contracts. I’m only using 8 ema and 20 ema. \n\nIf the 8 ema is above the 20 I’m buying calls, if the 8 ema is below the 20 I’m buying puts. Basically buying as SOON as SPY touches the 20 ema on an up or downtrend.\n\nYou can’t wait for confirmation because the move IS the confirmation. You just have to buy and send it, tight stop at 10%, risk is actually reduced by buying right at the 20 ema and not waiting for confirmation. \n\nWith ATM having delta of .5, you can actually scalp decently with these aggressive moves.", "score": 27, "replies": [{"body": "I bought VIX puts after the three big red days. They were dirt cheap. I mean DIRT CHEAP.  Sold them after two days for 30-40% profit.\n\nBuy low sell high... the only annoying part was that bid/ask spreads were as wide as the grand canyon.", "score": 3, "replies": []}, {"body": "[removed]", "score": 3, "replies": [{"body": "Been better for me than trying anything else. Market is just too fucky. If I’m expecting a scalp move in the right now, playing anything with theta is pointless.", "score": 7, "replies": []}]}]}, {"body": "This VIX bullshit is really ticking me off", "score": 22, "replies": [{"body": "Dumped my UVXY calls. Its stoopid as am i", "score": 3, "replies": [{"body": "I too have abandoned UVXY. It's not right. DD thesis on 0DTEs shows in the VIX", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Bro hammers so easy to scalp", "score": 1, "replies": []}]}, {"body": "Vix is crazy complicated, why you trying to make money off it? Why not just buy spy puts if you expect volatility?", "score": 1, "replies": [{"body": "Who says I was?\n\nIt’s just annoying to watch\n\nI do have spy puts and other stuff", "score": 1, "replies": []}]}]}, {"body": "Bought 4/21 190P on NVDA this morning, they ended the day pretty flat (down 2.5%) but overall happy with the buy in. I’m thinking with these hot prints we’ll see another wave of people rotating out of growth/tech and running back to the safety of value stocks or other equities. \n\nMy one concern rn about being bearish is that with how strong/persistent this rally has been that if JPow doesn’t do a 50bps we’ll just go back to rallying until something major breaks.", "score": 17, "replies": [{"body": "You and me both; JPow is all bark but no bite. Here's hoping today's news gets more 50bps hikes. But if JPow really wants to swing a big shlong, let's see 75bps or else ![img](emote|t5_2th52|4263)", "score": 9, "replies": [{"body": "I want him to legit make money 100% and end this fucking drawn out will he won't he scenario. He's a deva. Just crash the system already and wind down.", "score": 2, "replies": []}]}, {"body": "I buy puts back in beginning of February (MP) they aren't doing so well after earnings. I'm hoping they print soon", "score": 2, "replies": []}, {"body": "There's no reason to do 50 bps. They'll just tack more 25 bps on rather than surprise the market", "score": 1, "replies": []}, {"body": "The fed has gone to great lengths not to surprise the market. Why would they change that now?", "score": 1, "replies": [{"body": "I agree that they probably won’t, but I’d make the case that given how the market has thumbed its nose at the FED for months with persistent rallies on rumor, they might see it as a way to bring it back to reality", "score": 2, "replies": []}]}]}, {"body": "i sold all my spy 400p but held on to all my 390p expiring next fri. Hope i made the right call here but im fairly confident market continues its slide next week", "score": 11, "replies": []}, {"body": "I got gaped all week hard on almost every play I made. No capital for me.", "score": 10, "replies": [{"body": "I just waited for people to get gaped then entered the position later after they called it quits.\nGreat week lol", "score": 9, "replies": []}]}, {"body": "Retail investors are getting phucked, as usual.", "score": 8, "replies": [{"body": "I'm down 10% in the past week...wiped out all of my profits from Jan 1st til now...gonna be a long month or two to recoup those losses...", "score": 3, "replies": [{"body": "Escalator up, elevator down is the saying lol", "score": 4, "replies": [{"body": "I think it’s stairs up, elevator down. Escalators and elevators are pretty much the same speed lol", "score": 1, "replies": []}]}]}]}, {"body": "Thanks as always these are the only posts i read on here", "score": 9, "replies": []}, {"body": "Finna cop the position but my capital be the size of mi schlong", "score": 6, "replies": [{"body": "🤏", "score": 4, "replies": []}]}, {"body": "How do you write so well consistently but be down overall", "score": 6, "replies": [{"body": "because everyone who thinks they found a strategy that works doesn't understand that it's all temporary, very-very temporary. Soon enough whatever 'signals' you thought you had figured out stop working, yet you stubbornly try to stay the course, and end up losing all. Just read the (very little) info that on the Medallion fund, which is THE most technically/algo/scientifically traded operation for decades now. Why do you think those guys keep hiring the best minds they can buy? If there was a recipe they wouldn't have to keep changing what they're doing. Yet here they are, constantly dumping indicators that no longer work and digging out new ones.\n\nIt's extremely hard for humans to adapt quickly to market changes when noone has any idea what/how things have changed. Unless you are one of the market makers that can see the flows and everything in between, you are a disadvantage, and trying to trade charts is a fools game. That's why people say TA does not work, because there is no 'secret' that consistently pays out, and by the time you realize you need to change strategy you already gave up your profits.\n\nwell..most do.", "score": 10, "replies": [{"body": "That’s why I rely on price action for trading. The fact that each trading session since past week the $SPY failed to trade above it’s previous day high was a key indicator that momentum to the upside had died and should be looking for shorts. What made this week extremely tricky was does premarket dumps, which unless you were already short or with puts, there just wasn’t much to capitalize on and I don’t like chasing dumps due to the potential for choppiness or mid day reversals. \n\nNow that everyone id staring to get bearish, we will have a bullish week next week, but I would let the price action confirm my thesis first before entering new positions.", "score": 2, "replies": [{"body": "This man fucsk", "score": 1, "replies": []}]}]}]}, {"body": "> That’s exactly what happened on Thursday… if you didn’t see the article there was a whale who bought 26k of 0dte 4000puts on ES futures that caused that massive $6 meltdown… once he sold (took profits) on those we have a massive $6 rally.\n\n&nbsp;\n\nSo according to Goldman desk/ZH, the whale that put that 0dte actually let the option expire until about 2pm (presumably just recovering initial premium). The desk suggests this was almost done by an institution looking to take advantage of a very illiquid market (my guess is they had legacy shorts from last year they wanted to cover).", "score": 7, "replies": [{"body": "26K is a drop in the ocean for SPX", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "It's been constantly happening on the other side too with calls all through January, except it was even cheaper because plenty of dealers were pretty net short already due to what happened in December (so relatively less need to panic add delta hedges, unlike yesterday).\n\n&nbsp;\n\nEver since the introduction of 0DTEs, it's just been a bloodbath for anyone long volatility on maturities longer than pretty much a weekly DTE. There's literally no incentive to buy theta until gamma truly flips.", "score": 2, "replies": []}]}]}, {"body": "Good stuff as usual.", "score": 5, "replies": []}, {"body": "That sucks that you have a 90% win rate and are negative. How would lowering your stop loss help in this case? Seems like it would just turn some wins into losses.\n\nI have given up. I am too dumb to trade. Today my calls expired and I have drained the last of my Roth IRA which had 3 years of savings, as well as my second brokerage account in a year that I put my tax refunds into.\n\nIt's honestly kind of freeing, but finally the depression of not getting to trade anymore and the realization that I could have used that money for the down payment on a house in the next few years (I'm 40 and never owned) is setting in.", "score": 7, "replies": [{"body": "this is why you don't yolo, risk management is very important to survive this market. A bit late now, but have to understand that market is against you on every trade. It is very difficult to make money playing stock market.", "score": 10, "replies": [{"body": "I was very conservative in my first year of trading, but I was breaking even at best. Mostly I just slowly lost money. Got desperate (and a little bored) so started taking bigger risks. My wife having a baby and stopping work probably played a part in the desperation as well.\n\nMostly I just didn't want to admit that I was in the 90% of people who lose money trading and that I didn't have the intelligence to ever crack into the top 10%.", "score": 4, "replies": []}]}, {"body": "[removed]", "score": 5, "replies": [{"body": "How can you differentiate between a string of bad luck or emotion-based losses and just not being good enough anymore?", "score": 3, "replies": [{"body": "Are you journaling your trades to see any patterns to help you distinguish between bad trading or a good trade that just didn’t work? \n\nLike when did you get your calls? If you got them last Friday on 02/17, that was a good trade based on the bounce from previous support levels and a lot of traders took that trade. Now because the market gap down, it triggered all those stop losses and we had an organized sell off through the day. Now hindsight you could have argued that market sentiment was changing due to hot CPI, PPI and possible higher rates, but we have seen how irrational this market is to bad news and it will still go up, so don’t be too hard on yourself.\n\nNow, if you got calls on Tuesday ( like me lol) that was a horrible trade and should have cut my losses by the end of day once the dip buyers didn’t show up for a reversal play. There was no reason to get calls this week as the $SPY broke down from its key $405 level. The risk to reward just wasn’t there. Analyzing my own trade, I should have just stayed on the sidelines as I didn’t want to chase the downtrend, due to a potential reversal, choppiness or get calls because we could head lower (which we did). Hindsight, puts would have been the better play, but it was still a gamble because the data could have easily come cold and wrecked those puts. So in summary there wasn’t really a good easy to follow trend play unless you just day traded the swings from the Low of the day to the High of the day. This week was a day traders market.\n\nNow for next week, retail is getting bearish, and looks like longs are establishing support at the $393 level. The play to get calls would be next week, but after confirmation that bulls are actually holding that $393 support with a potential upside to $400-405.", "score": 6, "replies": [{"body": "Thanks for the response. I bought weekly calls on SPY on 2/17 and TSLA on 2/21. Honestly I bought the SPY because of your convictions of the OPEX bounce.\n\nTSLA looked to have support at 200 and resistance at 208, so I bought at 200 hoping to sell before it went back to 208. Obviously neither paid off.\n\nThere's no point in journaling my trades since I have just mostly been gambling lately. The only minor success I ever had was buying weeklies and selling them within 30 minutes, win or lose.\n\nI have blown through 3 years of savings through desperate trading. I have a couple thousand in my bank account but no reason to have faith I can trade for profit after blowing up 3 accounts ($20k, $4k and $4k) in the last year.\n\nI still don't know what you mean by trading price action. I feel like that's what I have been doing (although I have a penchant for trying to randomly time reversals when something \"seems too high\" on a random pump) but I don't know what constitutes a \"good setup\" or how to identify one.\n\nHow do you know what a trade's risk to reward is? Unless you just mean you have support and resistance laid out and you plan to enter at one and exit at the other.", "score": 2, "replies": [{"body": "Price action meaning momentum, are buyers or sellers in control and I look at the higher time frames 1hour or more. I would just recommend stopping and paper trading for a while if you truly want to learn how to trade. I’m actually in the same spot though, I have lost a lot of money trading and desperation just does not help. Be more patient on your entries or if you do want to continue, go very small, like 1 -5 contracts so that if the loss is small you just wouldn’t care.\n\nWhen you’re in the mindset of I have to get my money back, its a down spiral of more and more losses until you’re completely out of the game. Take it slow, forgive yourself, it will only make you a stronger trader. Learn to trade not gamble like you mentioned. Gambling is easy you just throw money at random entries and hope for the best. Sometimes works and sometimes it doesn’t but that’s not building the correct trading habits ( for example cutting your losses when your thesis is no longer valid and accepting you’re wrong). \n\nReal trading requires hard work, dedication, self discovery, discipline and constant work every day. Markets are ever changing just because something worked last month, week, day, hour, doesn’t guarantee it will work the next time. Learn to adapt with the market and let the market tell you what it wants to do, go up down or sideways. Have a strategy for each environment. Learn your weaknesses and strengths as a trader. Are you a momentum, scalper, trend trader? Not all traders are born equal, so that’s why no one can give you that secret sauce because what works for me, may very well not work for you due to your personality and trading style. Wish you the best of luck and much support as trading is one of the most difficult endeavors a man/women can take as a challenge and I myself know how difficult trading can be.", "score": 2, "replies": [{"body": ">Have a strategy for each environment\n\nThat seems to be the takeaway. If you knew what kind of market was coming up then wouldn't trading be a piece of cake?\n\nThe problem is how to identify what's coming up. I don't know how to do that, and I don't think anyone really does.", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "How long does a strategy have to be unprofitable before you decide to pick a new one? \n\nLast year I had a win rate of almost 70% (admittedly nowhere as good as yours), but my losses were bigger than my wins and I was slowly bleeding out.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tough week to trade for sure if you didn't swing puts and held with big balls. Def not me.\n\n[Looking at 4hr wave, im still seeing some more downside.  A sell down to 391/390 or gap down open down there should get it into oversold buy zone. ](https://i.imgur.com/N3vLSlq.png)\n\nSmaller time frames I use for intra day entries, lead me to believe there is some more selling come Monday. But we'll see. \n\n[I still believe we end up chopping in this $10 ish range if 390 holds next week. if it doesn't then that usually means daily 🌊 will make a full retrace which should lead spy back to 372 eventually ](https://i.imgur.com/5HXUmH1.png)", "score": 4, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": []}]}]}, {"body": "Damn so everything says absolutely bearish and downside expected....gonna buy some more calls on Monday, thx.", "score": 11, "replies": [{"body": "I went in on calls as well for next week too, we're oversold...", "score": 3, "replies": [{"body": "Actually indicators show we aren’t. So good luck with that.", "score": 16, "replies": [{"body": "to both of us, rebound from 200 sma on es chart can also make the case. Again, it's all gamble, right or wrong, we'll find out next week.", "score": 5, "replies": [{"body": "I got burned this week by buying calls on Tuesday by trying to predict the weekly move. Yeah never doing that again! That wasn’t trading , that’s gambling. I rather get a free drink at least. Next week is setting up to be bullish, but the biggest upside move won’t come till Friday once longs confirm support levels. Trading is not that hard if you’re patient enough and let the trade come to you as opposed to you trying to “guess” the next move. Sure, you can have a thesis/bias for the week but let the price action confirm your thesis, not the other way around, market will do what it wants to do, just flow with it and don’t fight it. I’m still learning that myself each day!", "score": 3, "replies": []}]}]}]}]}, {"body": "123 Rollercoaster also know as 12345 elliot wave, it's followed by ABC up", "score": 3, "replies": []}, {"body": "As always, you're doing the Lord's work.   \n\n\nDo you think Tesla day has a net positive effect on the stock, considering they've been cutting prices on their vehicles?", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Never bet against elon except when he’s doing something stupid", "score": 3, "replies": []}]}]}, {"body": "I expect the current bottom to be around 375-380 unless Jpow does a 50 bps increase and comes out unusually hawkish, which I dont expect.", "score": 3, "replies": []}, {"body": "Micheal Burry said to expect gyrations last year because they are the manic swings of the market..\"death wrangle\".\n\nThe market is a child (who wants his own way).  Screaming to be delivered from a parent who desires to impart hard interest rate discipline (on this unholy spawn).\n\nTonight grown men all over the planet are looking at their screens thinking to themselves: \"Powell's not going to be bullied like before. So now what?\"\n\nTime to profit handsomely on the soft hopium underbelly of the bull whales.\n\nNice.", "score": 7, "replies": [{"body": "[deleted]", "score": -9, "replies": [{"body": "Your inner child is raging against the world. Screaming against anyone who commands a view that is different from your own.\n\nYou are a tourist. Sad.", "score": 2, "replies": []}]}]}, {"body": "On times like this week doing some credit spreads bullish or bearish to take advantage of this choppiness works well. Find the range, put it 1-2$ below that range, capitalize on the theta burn intraday and close or let it expire. Did some 390/389P spreads for friday when we started dumping hard and failing to break 393/394 with 90DVOL showed the bearish strength was fading. Only made 100$ that day but its better then entering a trade when premarket is the huge move and its just a guessing game.", "score": 2, "replies": []}, {"body": "This is great", "score": 2, "replies": []}, {"body": "what happened to your 30 and 60 dte puts? made a killing off them this week, about 7500. my only regret is not reversing to calls on those retraces. i am hedging with some calls but they are mostly down. i added puts when we had a clean bounce of the 100 EMA towards EOD yesterday, will keep adding on retrace and possibly shorter term calls.", "score": 2, "replies": []}, {"body": "Interesting write up. For what its worth I've done the best in this market selling 2-4 month dated cash secured puts on relatively volatile stuff I wouldn't mind holding, like NAIL, FANG, and just day trading TQQQ/SQQQ, SOXL, SOXS, etc.  \n\nMade a bundle on sold $100 TSLA puts too but at these prices I don't want to risk getting assigned. I love the cars but believe it's a $80 stock.", "score": 3, "replies": []}, {"body": "Eh I agree with some things you said but disagree with others. I still think we will test the October lows and below before having a massive melt up. Market priced in only 2 more 25’s and then a pause. It’s likely now that we either go 50 and 25 or 3 more 25’s. \n\nThe greed and dumb money confidence this rally was more than the march and august tops last year, so I expect to take out the October lows.  January rally was driven entirely by record short covering and retail buying, so I’m not confident at it being a signal of anything. Was basically a head fake setting up a higher lower on the 1 year time frame. \n\nI’m looking for the market to test bottom at some point in April. SPY 340-350 is what I’m looking for and probably 240-250 on QQQ.\n\nThink people got far too complacent after January and the sideways movement from the likely February 2nd top.\n\nI do think we will bottom soon though as market will rally hard in anticipation of Fed pause.\n\nAppreciate your insights and time taken for your daily analyses. Best of luck in your trading and we shall see what happens over the next 2 months", "score": 3, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "Ok will inverse the person that mostly posts memes.  Puts it is!", "score": 5, "replies": []}]}]}]}, {"body": "when that .50 doesn't happen, the market will rip like there is no tomorrow. The media will do their best to still instill fear of doom and gloom. Recession is coming and it will be bad, conveniently forgetting the recession we had in 2022 which was renamed a non recession because of political reasons.\n\nThe market is going up, but most of wallstreet are still on the sideline and caught off-guard, so they will try to hold the market back as long as possible until wallstreet has time to jump back in.", "score": 0, "replies": []}, {"body": "[removed]", "score": -23, "replies": [{"body": "no u", "score": 8, "replies": []}, {"body": "Someone has calls...", "score": 1, "replies": []}]}]}
