{"title": "Tesla recalls 362,758 vehicles, says full self-driving beta software may cause crashes", "selftext": "", "id": "113wsj9", "created_utc": 1676570508.0, "score": 595, "upvote_ratio": 0.87, "num_comments": 97, "comments": [{"body": "tesla OTA update, this happens every month", "score": 87, "replies": [{"body": "The only really interesting part is that it seems they have 362,758 in the Beta.", "score": 17, "replies": [{"body": "Capitalism has already conditioned us to pay for unfinished products. 400,000 is nothing but a lot for Tesla as they've made less than 2 million cars since 2009. Several hundreds of thousands of people bought FSD on leases and returned the vehicle never actually having had actual full self driving. It's understandable if they fell for the lies but the cat is out if the bag. Anyone who pays $15,000 for it today can't complain about its current status.", "score": 11, "replies": []}, {"body": "I thought the same thing that they would have such a large number of beta vehicles on the road.\n\nRealistically though, when you do think about it, it's really the only way to collect enough data to actually be sure that the software is going to be capable of different types of conditions.", "score": 2, "replies": []}]}]}, {"body": "It's hardly a \"recall\" in the traditional sense. Theyre just sending out a patch.", "score": 179, "replies": [{"body": "Yeah not sure why they used that wording. Nothing is being recalled... would say its the complete opposite.", "score": 34, "replies": [{"body": "They probably have TSLA puts. That's like a instant 20% return getting an article out like that. It was for my puts anyway....", "score": 19, "replies": []}, {"body": "Fear porn. The only thing that media has any more since they lost any credibility with any real amount of journalism decades ago.", "score": 2, "replies": []}, {"body": "They wanna tank elons pockets", "score": 1, "replies": []}]}, {"body": "It’s an industry term. \n\nIn the hospital we get recalls too but it’s just a guy going around plugging in usb to patch the software in medical devices.", "score": 1, "replies": [{"body": "Yes, but this is a stock market sub. How a term is perceived is important.\n\nThere's a massive difference between this type of recall and what everyone thinks when they hear recall.", "score": 1, "replies": []}]}]}, {"body": "Also we have massive shorts and puts", "score": 64, "replies": []}, {"body": "It’s a software update…. Like an update for your iPhone. But of course, nobody will research into that and take the headline and run with it", "score": 120, "replies": [{"body": "There's been plenty of recalls that were just a software update, just a fuse installed, just a whatever. Being OTA doesn't make it less than it is, just more convient to not have to go to a dealership to get it done.", "score": 12, "replies": []}, {"body": "An update to my iPhone won’t kill people.", "score": 26, "replies": [{"body": "iphones cause more car accidents than tesla by far", "score": 55, "replies": [{"body": "I was in an accident because of an iPhone, can confirm \n\nI bought a Tesla after ☠️", "score": 8, "replies": []}, {"body": "It's usually the drivers that cause the crashes.", "score": -1, "replies": [{"body": "Drivers are supposed to monitor the tesla too, not close their eyes", "score": 17, "replies": [{"body": "Or bang.", "score": 5, "replies": []}]}]}]}, {"body": "What about a Samsung?", "score": 5, "replies": [{"body": "It really doesn't matter what brand of phone.\n\nA stupid driver is a stupid driver, no matter what phone they're using or anything else that matter That isn't keeping their attention focuses strictly on what is going on on the road.", "score": 1, "replies": []}]}, {"body": "Yes, driving a vehicle comes with inherent risks, not so much with a phone software update.", "score": 7, "replies": [{"body": "Driving a vehicle that is falsely advertised as “full self driving” is not just an inherent risk though, it’s an enormous risk in comparison to other vehicles", "score": -8, "replies": [{"body": "I don’t agree with your sentiment that it’s false advertised. Every technology that has ever been created has had “bugs” or “issues”, but they were never deemed false advertised. I agree that FSD is a risk, and it’s something I would never use, but people who use fsd should understand the risk they are taking when they give up control of a vehicle to a software. TESLA is the only company that’s really trying to make the firsts full FSD for the roads, and I think that’s a cool and great step in technological advancement.", "score": 3, "replies": []}]}]}, {"body": "What if I told you that autopilot and FSD features when used have a lower % of accident than the average person driving?\n\nDon't get me wrong, FSD isn't 100% operational but it still drives better than the average person on the road in the overwheming amount of instances. The stigma is just difficult to comprehend because if you crash into someone, it's you who is responsible. If FSD/AP crashes into someone, it's the technology even though the technology is technically safer than than when not used.", "score": 2, "replies": [{"body": "I don't think you understand my comment, or software in general. OK, \"FSD\" is safer when it works. If it has a bug that requires a patch... That bug could kill people.", "score": 1, "replies": [{"body": "Do we need AI to screen code?", "score": 1, "replies": [{"body": "Eventually. It can't do it nearly as well as I can yet. It should be better at it than me very soon though.", "score": 1, "replies": []}]}]}]}]}, {"body": "I highly doubt the patch will actually fix the software 😬", "score": -5, "replies": []}, {"body": "So when these updates happen do they happen at any time or the next time you turn the car on because I could see that being a huge problem during an emergency.", "score": 1, "replies": []}, {"body": "The editor shorted Tesla.", "score": 1, "replies": []}]}, {"body": "The recall is basically download an update via WiFi that takes ten minutes. \n\nThere is no physical recall which is what you want to avoid.\n\nEver downloaded an iOS update? It's that simple.", "score": 34, "replies": []}, {"body": "Love overreactions. When the headline came out I bought a put and sold 3 minutes later for a quick 40% gain.", "score": 18, "replies": []}, {"body": "So many Tesla haters in the sub.", "score": 19, "replies": [{"body": "People have the right to criticize a product they have paid a 100 grand for and then were cheated or were over promised and under delivered on. Doesn't make them haters. Tesla+Musk simps on the other hand somehow can't take any criticism it would seem", "score": 7, "replies": [{"body": "Where’d you get the 100 grand from? The full self driving beta software that they are fixing costs 15 grand", "score": 4, "replies": [{"body": "The full cost of the car, not just FSD. Sorry should have clarified.  Been an owner for more than 6 years and my experience has been insanely bad, not just for recalls but general service and quality of updates has been dogwater. To be clear this was a response to the Tesla haters comment which wasn't specific to FSD itself.", "score": 0, "replies": [{"body": "Model 3/Y with FSD isn't $100k. I don't know where you're pulling that number from.\n\nIdk what you mean by quality of updates. No other auto manufacturer even knows how to push updates from their software so they basically just outsource it and it's garbage enfotainment updates.", "score": 4, "replies": [{"body": "Disagree on other manufacturers not being able to push updates. Was fancy when I got my Model S in 2016 but no longer news - agreed that it's not common place.\nMy Tesla infotainment system runs like windows 11 on a raspberry pi. This after 3 recalls, including the one with the dashcam that took 2years for the service center to respond to. Every OTA makes my system more and more unusable and service centers are like nah.\nModel S and Model X owner here - maybe that's why I'm more bitter. Costs 3x my neighbors M3 and gives me 6x the troubles. Basically anything on hardware 2.5 is planned obsolescence including forced super slow charging at superchargers.", "score": -2, "replies": [{"body": "I call bullshit.", "score": 1, "replies": [{"body": "The beauty of the internet is that you have 100% freedom to invalidate other people's lived experiences and facing no consequences, which is completely fine. It's much easier to do as well rather than really examine truths - when they are not your own :)", "score": 3, "replies": [{"body": "You're saying other car manufacturers can push out OTA updates. They are terrible. Volkswagen just gave up and says they will outsource it, aka, use Apple's Carplay features. Many of these automanufacturers have no experience in software. They are just assembly plants who put the vehicle parts together. The technology is outsourced.", "score": 3, "replies": [{"body": "You made a point about absolutely no other car manufacturer in the world even having the capability to push out software updates, and outsourcing infotainment updates to 3rd party. That is not completely true though - is it? We aren't talking about the quality of those updates because personally Tesla's are terrible in my specific case. Comparing them to BMWs, NIOs, BYD and even Ford would mean manufacturers have some capability, limited or otherwise, and infotainment or firmware - to push to their user base.", "score": 1, "replies": [{"body": "Other car manufacturers can't come close to doing what Tesla is capable of doing with software and OTA updates. Rivian, NIO, LUCID, and XPENG are capable of doing it to some extent but you are clearly referring to legacy automakers.\n\nTrade your vehicles in if it's that bad for you. I own a Model 3 and my brother owns a Model Y. Every update has improved the user experience for us both. Again, if you dislike it or it has been frustrating to use, get rid of the vehicles. You're in the wide wide minority to complain about their software, FYI.\n\n\"Your specific case.\" You haven't really listed which updates were bad. You're just saying it gets worse.", "score": 1, "replies": [{"body": "Oh yeah been looking to trade for the longest time - so that's gonna happen as soon as Fisker or Rivian R1S get their ducks in a row, or even BMW. Just one of those things where you really wanted to love something, supporter the company behind it only to be duped - leaves a bad taste.\nAlso, I'm not in the minority - every pre 2018 model S or X owner that I know has some complains or the other especially with performance, terrible build or horrible OTAs. It's a club! The cheaper newer models get a pass now, but let's revisit this sub in 5 years where I really hope you don't have to join our signal group complaining about the same things :)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "$100k wtf? Lol what Model did you get??", "score": 4, "replies": [{"body": "Model S of course. There were no 3s or Ys back in the day ;)", "score": 4, "replies": [{"body": "Oh an old one, I feel you then. The new ones are vasty improved on. I just bought a M3P and am still just blown away with it. And the FSD is so sweet imo", "score": 2, "replies": [{"body": "Yeah I think hardware3 onwards it's almost a new car when it comes to the tech - but it makes me feel even more punished for being an early supporter and being burned for it.", "score": 2, "replies": [{"body": "Yeah man I feel that. I was clueless back then I thought they were all trash even today. Can admit I knew nothing", "score": 2, "replies": []}]}]}]}]}]}, {"body": "In a fairness, unless you have one or actually understand them as a company, ppl just go off what others say. \n\nI just bought a M3P over an M340i and it's an absolute JOY", "score": 3, "replies": [{"body": "I just bought a BMW i4 M50 over a Model 3 P, and it's an absolute JOY 😁", "score": 3, "replies": [{"body": "They are nice! I hear the stability control is a little annoying because it cuts so much power with the wheel turned. How true is that?\n\nBet It's sweet. I landed a M3P with FSD for $40k with 20k miles. Smitten af and it's stupid fast...", "score": 2, "replies": [{"body": "I love how it drives, but it's definitely not a track car for sure. Cuts power, as you said, and is heavy. It makes up for it in solidness, and how well put together it is. I look forward to driving it every time lol\n\nThat is an incredible deal 🤯 Enjoy it my man", "score": 2, "replies": [{"body": "Dude they look soooo nice enjoy!!", "score": 2, "replies": []}]}]}]}]}, {"body": "The Russians have a hate boner for musk", "score": 0, "replies": []}]}, {"body": "I think we all knew this was coming.  Most car companies have a ton of recalls for way less than some of the issues we've seen with FSB the last few months.  I guess the Superbowl commercial was the last straw.", "score": 15, "replies": [{"body": ">  I guess the Superbowl commercial was the last straw.\n\nThe fact that they have fixes ready means they've known these issues for a while and have been working on them.\n\nIt could very well be they were waiting to get a large number of fixes done so as to minimize the number of \"recalls\" and software updates required.  Which is normally an ok thing to do to minimize disruption, but since these were potentially serious safety issues you have to wonder about that strategy.  Either the Super Bowl ad was a big coincidence in timing, or else it did prompt them to send out the fixes they already have ready instead of waiting longer.", "score": 7, "replies": []}, {"body": ">>FSB\n\nComrade!", "score": 3, "replies": [{"body": "I meant FSD just fat fingered it. No idea what your reply means though.", "score": 0, "replies": [{"body": "The FSB is the current Russian version of the Soviet KGB. They were referring to you as “comrade” in jest, making fun of your fat fingering.", "score": 2, "replies": [{"body": "Ah I see thanks didn’t pick up on that one.\n\nFSB also out there causing fatal “accidents” though for whatever that’s worth.", "score": 1, "replies": []}]}]}]}]}, {"body": "Get Lidar", "score": 2, "replies": []}, {"body": " Tesla's OTA update, which takes place each month", "score": 2, "replies": []}, {"body": "Hahahaha CNBC red banner alert! Anything CNBC can push to cause weakness in Tesla or the Market ….", "score": 6, "replies": []}, {"body": "These headlines me up. It's a software update lol\n\nMy car drove me to work just fine this morning 🤷‍♂️", "score": 5, "replies": [{"body": "They me up too!", "score": 3, "replies": []}]}, {"body": "Why is this in stockmarket? It should be in cars...\n\nThere is so much evidence it doesn't work and no one cares.\n\nI am happy for Tesla owners, I wish I could afford one, but y'all need to be careful with 5000 pound cars that can go 0-60 in 3 seconds.\n\nAnd pretend to drive themselves.\n\nI'm not a chef, but that's a recipe for disaster.", "score": 3, "replies": []}, {"body": "Mods delete this, fake news. Not a recall. This guy is def short", "score": 2, "replies": [{"body": "It is a recall technically. Just OTA updated tho.", "score": 8, "replies": []}, {"body": "Mods, delete his comment. It's indeed a recall. The bags that this guy is holding are fucking up his brain.", "score": 2, "replies": []}]}, {"body": "Humans may cause crashes, jesus recalls all humans.", "score": 3, "replies": []}, {"body": "There is no simple “patch.”  Tesla has been working  on this for years and do not have a solution as of yet.", "score": 1, "replies": []}, {"body": "There is no simple “update.”  Tesla has been working  on this for years and do not have a solution as of yet.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -7, "replies": [{"body": "Wow you're lost man. I'll have what you're having lol\n\nIt's a monthly software update my guy. No one is losing sleep", "score": 1, "replies": []}]}, {"body": "But Tesla is the future bro", "score": -9, "replies": []}, {"body": "The recall:\n\nfor user in listOfDrivers:\n     user.disableSelfDrivingBeta()", "score": 0, "replies": []}, {"body": "FML. I closed a call credit spread for a loss about 3 seconds before this news broke. It would be in the clear now for tomorrow's expiration. Curses. Should have waited.", "score": 0, "replies": []}, {"body": "So? Humans cause crashes on a daily basis 100x more often than tesla self-driving does.", "score": 0, "replies": []}, {"body": "No shit", "score": 0, "replies": []}, {"body": "this is important bcuz it shows fsd is bs.", "score": 0, "replies": []}, {"body": "ahah May cause crashes haha.", "score": 0, "replies": []}, {"body": "That ain’t good", "score": -19, "replies": [{"body": "Actually, It's fine.", "score": 1, "replies": []}]}, {"body": "Tesla is a little too musky of a stock for me.", "score": -9, "replies": []}, {"body": "Lmao. What a shit company", "score": -3, "replies": [{"body": "Meanwhile Ford stopes all sales and production ofr their pickup because battery issues.\n\nYeah I'll take the software over air update instead", "score": 1, "replies": [{"body": "What kind of stupid false choice point is that? Just buy a car that works", "score": 0, "replies": []}]}]}, {"body": "Time to buy calls. MASSIVE market overreaction", "score": -1, "replies": []}, {"body": "doesn't acknowledging this alone open them up to lawsuits?", "score": -6, "replies": []}, {"body": "Quoting CNBC. Classic.", "score": 1, "replies": []}, {"body": "Lolz", "score": 1, "replies": []}, {"body": "Delete and repost with an accurate title.", "score": 1, "replies": []}, {"body": "Beta update. I get that but to say recall implies the thought of car is being returned lol", "score": 1, "replies": []}, {"body": "May? Is it not well documented enough that they do?", "score": 1, "replies": []}]}
{"title": "Is there any hope for a bull rally today?", "selftext": "Both the CPI and PPI data were in hotter than expected. And the PPI is piping hot. It’s going to make most of the high earnings and positive signals that triggered this run change into being negative indicators, and a sign that inflation is actually reversing. We might actually see inflation heading in reverse by the next month or two if it keeps going this way. But I think a bull run could still happen because… retail buyers are just going to push through. Is there any shot left or did we top?", "id": "113r7fp", "created_utc": 1676555824.0, "score": 57, "upvote_ratio": 0.72, "num_comments": 89, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|2 days ago\n**Total Comments**|6|**Previous Best DD**|\n**Account Age**|2 days|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Shorts getting unwound triggered this run.\n\nTesla up 100% in a month. Come on .", "score": 62, "replies": [{"body": "No clue why tesla is rallying.", "score": 16, "replies": [{"body": "Cathie", "score": 6, "replies": []}, {"body": "Opening chargers to rivals EV companies with the power of executive order from Joe![img](emote|t5_2th52|4271)", "score": 8, "replies": [{"body": "If it were that profitable he would have done it already. More like he has no choice in the matter. The bromance between joe and elon is smoke and mirrors.", "score": 5, "replies": [{"body": "Indeed", "score": 1, "replies": []}]}]}]}, {"body": "And now 220 calls are fucked so it will tank and puts will print and then people buy calls and we go again.", "score": 11, "replies": []}, {"body": "Or maybe.. the economy is red hot so people are buying stocks. When people buy stocks, the price goes up! Crazy, right?", "score": 4, "replies": [{"body": "I wonder if they expect the same upward movement in the market that we had for 10 years when interest rates were zero.", "score": 6, "replies": [{"body": "The market went up for 100 years when rates were far above 0.", "score": -8, "replies": [{"body": "Not at this pace dumbass", "score": 5, "replies": [{"body": "Hey. Just wanted to check-in mate. You all good?", "score": 1, "replies": [{"body": "Oh I’m good. Partially own shares, partially sitting in T Bills. You’re starting to see the stuff I’ve been looking for at the late stages in the last month or so, so yeah I’m fine. Gotta have ice water in your veins for this.", "score": 1, "replies": []}]}, {"body": "OH SHIT HE'S MAD\n\nSorry I wasn't aware of your short position. Touchy subject, I understand.", "score": -8, "replies": []}]}]}]}]}]}, {"body": "Only a fool‘s hope. But that‘s how Gandalf brought down Sauron", "score": 103, "replies": [{"body": "You know that Gandalf isn’t real, right? RIGHT??", "score": 13, "replies": [{"body": "Ofc he was real. Jesus threw the ring down the chimney of Mordor which is why we celebrate Christmas chimney gifts and honor Legolas the elf for his heroism", "score": 44, "replies": [{"body": "Huh. Never looked at it that way.", "score": 12, "replies": []}, {"body": "Legolas on the shelf", "score": 8, "replies": []}]}, {"body": "Bruce didn’t become Batman until he was 30. It’s never too late to make gains.", "score": 7, "replies": [{"body": "So if I'm over 30 its too late?", "score": 1, "replies": []}]}, {"body": "Downvote", "score": 0, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "So what you're saying is we need a midget to invest in precious metals", "score": 1, "replies": []}, {"body": "So puts on Palantir?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 30, "replies": [{"body": "Perfectly balanced\nas all things should be", "score": 6, "replies": []}]}, {"body": "![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4259)", "score": 10, "replies": [{"body": "![img](emote|t5_2th52|4263)![img](emote|t5_2th52|4263)![img](emote|t5_2th52|4263)", "score": 1, "replies": []}]}, {"body": "There is unprecedented regard retail investors pissing away their cuck wages on their phone like it’s a video game.  Mm’s are gonna kangaroo fuck every penny out of them from here out", "score": 12, "replies": []}, {"body": "Yo. I heard the stock market is just a giant pyramid scheme.", "score": 30, "replies": [{"body": "That's one way to see it.", "score": 4, "replies": []}, {"body": "You don’t know what a pyramid scheme is", "score": 1, "replies": []}, {"body": "Yup. Look at statistics. Institutions always win more than retail.", "score": 1, "replies": [{"body": "if retail win more in general, then there wouldn't be much institutions, right?", "score": 0, "replies": [{"body": "If donuts weren’t chocolate maybe I would be skinnier.", "score": 2, "replies": []}]}]}]}, {"body": "Yea around 10 am market will reverse and bad news will be good news.", "score": 31, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 5, "replies": []}, {"body": "And sure enough this man was correct", "score": 10, "replies": [{"body": "Then he was uncorrect.", "score": 3, "replies": [{"body": "I sold when I was correct, so I had no positions when I was uncorrect.", "score": 1, "replies": []}]}]}, {"body": "Fucking LOLd when I checked the chart after reading this. 10am on the dot", "score": 1, "replies": []}]}, {"body": "Is someone holding spy calls that expire soon?", "score": 13, "replies": [{"body": "Sure reads that way…", "score": 3, "replies": []}]}, {"body": "If I knew, I wouldn’t be in this sub", "score": 10, "replies": [{"body": "Aw c’mon you wouldn’t come back just to play around?", "score": 3, "replies": []}]}, {"body": "50% go up 50% go down", "score": 9, "replies": []}, {"body": "No", "score": 5, "replies": []}, {"body": "Stonks baby.. they only go up 🚀🚀", "score": 3, "replies": []}, {"body": ">There is always a chance for a bull run, however I believe that the chances are slim. The data suggests that inflation is reversing, which could lead to negative signals and earnings being less than expected.", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 1, "replies": []}, {"body": "Mike Wilson????", "score": 1, "replies": []}]}, {"body": "There’s always hope. I hoped that my wife would shut her pie hole during the super bowl, but that didn’t happen", "score": 7, "replies": [{"body": "I hoped my wife would open her pie hole on Valentine’s Day but that didn’t happen either", "score": 7, "replies": [{"body": "That’s cause you’re using the word ‘wife’.", "score": 1, "replies": []}]}, {"body": "There's hope, and then there's gambling on a generational black swan.", "score": 2, "replies": []}]}, {"body": "No...", "score": 2, "replies": []}, {"body": "There shouldn't be but for that reason it will pop", "score": 2, "replies": []}, {"body": "My stocks is going up for the 3rd week. If stays like this for the next 3 months, I will recover my losses and more!", "score": 2, "replies": [{"body": "What are you in?", "score": 1, "replies": [{"body": "Tesla, Riot, and Wish![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "hahaha  I'm shorting RIOT . -20%  you won", "score": 1, "replies": [{"body": "Short term, yes. Long term?", "score": 1, "replies": [{"body": "only short term, ar 5$ I'll close.\non the long term... bankruptcy I think..", "score": 1, "replies": []}]}]}]}]}]}, {"body": "CPI is hot, but still under expectation, this PPI on the other hand, is very hot and completely out of expectations.\n\nDon't forget they changed the cpi formula this time", "score": 3, "replies": [{"body": "CPI was over expectations and would've been even higher under the original formula", "score": 6, "replies": []}]}, {"body": "It goes ⬆️ and down ⬇️", "score": 1, "replies": []}, {"body": "There would have to be some insane beats on the earnings reports today for a reversal.", "score": 0, "replies": [{"body": "Lil peep type beat drops\n\nmarket cries", "score": 0, "replies": []}]}, {"body": "Today the market could go up or it could also go down.", "score": 0, "replies": []}, {"body": "Are you really whining about another bull rally considering how the year has started? Gtfo greedy pig.", "score": 0, "replies": [{"body": "The nasdaq up 16% in 7 weeks. We need another bull run", "score": 1, "replies": []}]}, {"body": "Buy the dip", "score": -1, "replies": []}, {"body": "😂😂😂boy we are fuked", "score": 1, "replies": []}, {"body": "BTFD is in full effect, I think you will be OK.", "score": 1, "replies": []}, {"body": "market is bipolar asf", "score": 1, "replies": [{"body": "I'm enjoying it. Not this often I get to make money with calls and puts on the same day.", "score": 2, "replies": []}]}, {"body": "You should check the daily thread for intraday live info\n\nnot random posts", "score": 1, "replies": []}, {"body": "Twilio carrying me rn", "score": 1, "replies": []}, {"body": "Damn, that sounds pathetic. Take your ass to the casino instead 🎰", "score": 1, "replies": []}, {"body": "You get your answer?", "score": 1, "replies": []}, {"body": "Great news", "score": 1, "replies": [{"body": "Great question haven’t got a clue", "score": 1, "replies": []}]}, {"body": "META shorts after the pop doing just fine", "score": 1, "replies": []}, {"body": "God it’s fun to read these AH.", "score": 1, "replies": []}, {"body": "I have expiring puts on several equities which expire today so I can almost guarantee it.", "score": 1, "replies": []}]}
