{"title": "How to determine whether a news event is priced in?", "selftext": "Hi all. I've recently decided I want to \"gamble\" with 10% of any earnings I make by buying calls two weeks out before big events. This time it's AMD. There's their ZEN release on Tuesday, which is very highly anticipated.\n\nAs you probably know, AMD has been jumping this past week, and has reached around $10 a share. Do you think this was because of Zen? Would making a play before their release be meaningless? \n\nI appreciate any insight and accept all incoming criticism for my stupidity. \n\nEDIT: This is why I love this subreddit, I learned so much from every single comment. Thanks for being such a supportive (and informative) community! I've decided against this bet, because it is most likely priced in. ", "id": "5hnjwl", "created_utc": 1481418880.0, "score": 15, "upvote_ratio": 0.87, "num_comments": 12, "comments": [{"body": "> How to determine whether a news event is priced in?\n\nIf you've heard about it, it's priced in.", "score": 16, "replies": []}, {"body": "If it is a known event (earnings, product release, meeting, conference, etc.) it most certainly is priced in. ", "score": 5, "replies": []}, {"body": "There are two things I like to do. First might be a \"back of the envelope\" estimate on sales/profits and how much that might be worth to company valuation. Of course this requires some grounding in fundamental analysis. This might involve a steep learning curve, depending on a person's educational background.\n\nSecond is more about gauging sentiment on boards, forums and media. If some product is making headlines on Marketwatch, Barrons, and similar venues, there aren't many more people that are going to learn about it later. If something seems under the radar, the odds are better. \n\nBoring products vs. flashy products can be yet another factor. The Tesla Model 3 is near the ultimate in flashy. A big winner stock for a long time has been SHW Shermin Williams. The metaphor of watching paint dry, might be the cliche for boring.\n", "score": 6, "replies": []}, {"body": "Buy the rumor; sell the news.\n\nIt's always priced in.  Buying options is a suckers bet.  You're literally better off playing blackjack or roulette.\n\nWhy not sell the 5/7 put ratio instead if you're bullish?", "score": 5, "replies": [{"body": "Everything is fairly priced but one side is for suckers?? Lol", "score": 2, "replies": []}]}, {"body": "I seem to be a minority here but i dont think anything is ever fully priced in.\n\nTake the rate hike - its priced at 96% likely, meaning prices would be different than 100%. I dont believe any news is 100% unless announced already which would defeat the purpose. So adjusted to reflect the odds, yes. Adjusted perfectly 100%, no. It should account for risk", "score": 10, "replies": []}, {"body": "IV is ~60%... so I would avoid the volatility crush with something like that", "score": 4, "replies": [{"body": "Well it depends on what the mean IV is for that particular stock right? Not all IVs are created equal ", "score": 5, "replies": []}]}, {"body": "The big price jump in AMD is mostly because BofA/ML gave them a double upgrade from underperform to buy with a PT of $12.\n\nAs others have mentioned, IV is higher as Zen demo approaches, and will likely crush afterwards. I see no reason for the stock to skyrocket after the demo. It's just a demo- I wouldn't be surprised to see a dip actually as people \"sell the news\". \n\nAnd that's the problem with buying calls- you have to time the market correctly, if you're playing a binary event there's almost always IV crush, you have to be directionally right, and the price has to move far enough to make it worth your gamble and offset theta/vol crush. \n\nAMD is pricing in some success with Zen already, and when a stock is priced on speculation, it's even harder to predict its movement; a single news story or analyst rating could send it flying in either direction. ", "score": 2, "replies": []}, {"body": "Just gamble on some cheap OTM puts on $SPY that there will be drop or pullback by the end of January. Much better likelihood than your $AMD bet in my opinion.", "score": 2, "replies": []}, {"body": "It's not priced in because no one knows what's going to happen, it could be shitty. ", "score": 1, "replies": []}, {"body": "If you're going to YOLO, why even consider the risk?", "score": 1, "replies": []}]}
