{"title": "WSB Earnings Gambling 101", "selftext": "I wanted to take a break from shitposting and offer something of substance for once.  Although I’m questionably qualified to give advice, here is my guide to gambling your borrowed money on stocks reporting earnings.\n\n**Preface:**\n\nThe purpose of this is to list resources, methods, and thought processes so you can incorporate what I am sharing into your own trading.  I believe this will mostly help the noobs.  Maybe some people with more experience will find this useful?  I’m hoping anyone with more insight than me can add to the conversation.  This is not a suggestion or solicitation to buy, sell, or fuck yourself with any security.\n\n**Components of an earnings announcement:**\n\n•\tEarnings per share (EPS):  How much did the company make or lose per share?  Was it above or below what was estimated?  In my experience EPS has the least amount of impact on share price move.\n\n•\tRevenue:  How much money did the money making part of the business bring in?  You can have great EPS, but if you’re not bringing in the business and report revenue under estimate the stock will probably go red.  Meeting, exceeding, or missing on revenue estimates typically does have an impact on share price move.\n\n•\tGuidance:  Where is the company going?  Good or even great EPS and Revenue can see a stock trade red after-hours if the guidance is below expectations.  While not always the case, I have noticed guidance typically drives the stock’s price movement the most.\n\n\n•\tThe Market:  Yup.  Even if everything logical is saying the stock should go up or go down and it is doing the opposite.  The Market doesn’t give a FUCK about the Shouldland you’re living in.  Never underestimate a trade going completely wrong just because the market doesn’t give a shit about you or anything logical.  \n\n**Who is announcing what when?**  \n\nThat’s the first question you want to ask yourself.  Yahoo earnings calendar is a great start.  I’ve since graduated to [EarningsWhisper](https://www.earningswhispers.com) and [Estimize](https://www.estimize.com).  [EarningsWhisper](https://www.earningswhispers.com) is a nice way to gauge how the stock has performed during past announcements.  [Estimize](https://www.estimize.com) is unmatched in helping visualize past earnings performance and future expectations.\n\n**Take Action:**\n\nYou’ve found the stock you want to gamble on, but what is the best way to do it?\n\n**If you’re bullish you can:**\n\nAction| Pros | Cons\n---|---|----\nBuy the shares outright.    | You own equity.  If shares move up in AH or PM trading, you are poised to profit then or during market hours.  If shares drop, you still own the stock.| Stock needs to move a large % for YOLO gains.  If done correctly this comes with a large capital requirement.\nBuy calls.| Cheaper than buying the stock outright.  Wild gains if stock moves up a large amount.| Can easily take 100% loss even with reasonable strikes and expirations.  IV Crush will fuck your butthole.\nSell Puts.| You get paid right away.  IV crush works in your favor.  If a stock gets put to you, you now own the equity.| Need the capital and privileges to have a stock put to you if you're wrong.\nCall Spread.| Position yourself for upside gains while lowering your cost basis and maximum loss.  Selling premium.| Gains are capped.  Buying and writing contracts increases commission costs.\n\n**If you’re bearish you can:**\n\nAction| Pros | Cons\n---|---|----\nShort the shares outright.  | Simplest way to bet against a stock.| Infinite loss potential.  Covering shares while the stock moves north is very painful.\nBuy puts.| Normally cheaper than shorting the stock.  Wild gains if stock moves a large amount down.| Can easily take 100% loss even with reasonable strikes and expirations.  IV Crush will fuck you butthole.\nSell Calls.| You get paid right away.  IV crush works in your favor.  | Infinite loss potential.  Much higher loss potential than shorting the stock.\nPut Spread.| Position yourself for downside gains while lowering your cost basis and maximum loss.  Selling premium.| Gains are capped.  Buying and writing contracts increases commission costs.\n\nOf course there are other strategies than what is listed above.  You'll see some people suggesting selling Iron Condors as an almost sure way to \"collect premium\" on a volatile stock regardless of which direction it goes after earnings.  Find what works for you and apply it.\n\n**Some of my notable earnings gambles:**\n\nWinners:\n\nOptions| % Gain\n---|---\nCOLM Aug 21 2015 65.0 Call| 460.72%\nWDC Sep 18 2015 85.0 Call| 341.69%\nSYY Aug 21 2015 37.0 Call| 167.79%\nEMN Aug 21 2015 80.0 Call| 143.33%\nNFLX Jan 22 2016 90.0 Put| 835.44%\nAAPL Apr 29 2016 102.0 Put| 308.66%\n\nLosers:\n\nOptions| % Gain\n---|---\nTREX Sep 18 2015 50.0 Call| -100.00%\nKMX Sep 18 2015 60.0 Put| -100.00%\nFB Nov 06 2015 100.0 Put| -99.01%\nBBBY Jan 15 2016 50.0 Call| -100.00%\nMW Jan 15 2016 25.0 Call| -100.00%\nMU Feb 19 2016 15.0 Call| -100.00%\n\nThis by no means is meant to impress anyone.  I fucked up more trades than I've had successful ones.  Maybe one day I'll be able to say I've had more gains than losses in this account, but we're a few good trades away from that still.\n\n**My Methodology:**\n\nAfter some $SPY puts thrashing and almost decimating my play account for a 2nd time I decided to gamble on earnings again with either call or put spreads.  This helps me lower my cost basis, mitigate risk, and maximize return.  For instance I am gambling on $PZZA earnings AH today.  First I will look at [Estimize](http://i.imgur.com/9DPQUmW.jpg) to get a feel for how they've done in the past as well as what to expect for this earnings.  Looking only at the revenue screenshot I'm seeing current Q1 guidance is only slightly above previous Q1 guidance.  My thoughts already are they will deliver good earnings.  Whether or not they will and how the market reacts is completely out of my control.  Next I check the [charts](http://i.imgur.com/bV6jrwV.jpg).  Nothing compelling there beside the stock has traded higher and has sometimes reacted violently to earnings announcements.  Being I'm bullish [I'm now analyzing the profit/loss of a call spread](http://i.imgur.com/EX1pZXS.jpg) that expires 18 days from now.  You can see my maximum loss is $365 while my maximum profit potential is $2,135 even if I only have a 21% chance of the underlying touching that $65 strike.  Without writing calls my cost basis would be closer to $600.  I'd rather lose 100% of $365 than $600.  While trading like this won't spare you from the IV crush, selling a put or call in addition to one purchased helps offset that slightly.\n\n\n**Closing:**\n\nWe all about the yolo swag max gainz around here, nigga.  Trading earnings can lead to explosive returns and it can also empty your account if you go too hard on a trade and end up wrong.  $AAPL, $TSLA, $FB, $AMZN and plenty of other stocks are a blast to trade around earnings and gains are there to be made.  Don't be a fucking retard about it and maybe you'll be posting gains instead of QQ sessions about your account getting destroyed.  Remember you can always trade AFTER the earnings announcement and sometimes get just as good of returns.  Good luck, have fun, and be sure to go fuck yourself!\n\nEdit:\n\n$PZZA AH not looking good.  Solid EPS beat, but revenue did not meet expectations and guidance provided did not impress.  The guidance given is a year over year increase so maybe having this spread out a few weeks will help with the outcome and people will buy the dip.\n\nEdit #2:\n\n$PZZA getting me paid niggggggggggaaaaaaaaaaaaaaaaaaaaaaaaaaa", "id": "4hpi2b", "created_utc": 1462303385.0, "score": 350, "upvote_ratio": 0.96, "num_comments": 81, "comments": [{"body": "since you took all the time to write this up i thought i would add somethings. noob tips. ive only been trading earnings this year so by no means is this great advice. investing 6 years tho and im pretty good with financials and doing my hw.\n\ndouble check earnings dates. make sure you use 2 sites they are sometimes estimates.  also you can visit the companies investor page (google \"investor company name\") and it should have time of the conference call, and if your lucky exact time of report too. \n\nbe aware of when they announce. friday after markets are pretty strange imo, because the whole weekend can shift the market against you.  there are morning and night announcements too. dont hold something accidentally thinking its a post market when its pre, youll have to play something you might not have wanted to.\n\nearnings whisper is pretty solid and is one of my go to sites. it has a chart on the front page with earnings marked with green arrows. you can pull up the ticker on yahoo finance and go along with it too if you want more details. i like the earnings history in the earnings tab and i use that with yahoo open.  it gives rev and eps % beats, estimates, actuals, as well as a gap up or down %. ive seen some sites which also give the trend back -30 days - 7 days and -1 day and forward +1 days +7 days +30 days so you can see if it gained or lost in the time around ER. useful if you arent sure if you should hold or not at open. useful to know if you should buy 2 weeks out or right before, or play a trend in the other way before/after.\n\ni love seeing the %gap because it tells you what kind of jump you can expect on a good beat or miss. you can pick a strike accordingly which isnt too far out. worst is when you pick the right direction but it just doesnt move enough, iv crunch, and the  contract goes to 10% of its value.\n\nalso know that many companies are seasonal. i always like to think of how someone is making their money. look at the last 4 qtr estimates and see if they follow a pattern with the 4 from the previous year. do they make all their revenue in summer? winter? maybe if you are playing the companies best quarter you think of what they did well during the summer. if its their low you think of how they weathered when money isnt coming in. \n\ni got to mention this too since yall are retarts. if your gambling on some shit company just check out the 10-k fast. see what their cash/assets/revenue/netincome/debt looks like. once u do this more and more you will know what they should look like. you can compare to industry or competitors to see how they are doing reletively. financial ratios help, tho i dont use em. i just look at the 10-k. im an auditor so i can breeze through them.\n\nalso you can do all the homework you want, but so can anyone else. ER plays are really really close to gambling. i read somewhere that options carry risk.\n\ngfy etc", "score": 19, "replies": [{"body": "Great input.  When I begin crunching numbers I place trades with more conviction.", "score": 3, "replies": []}]}, {"body": "Da fuq is this education shit? \n\nNoobs: ignore this. Go trade and you'll learn all you need to", "score": 73, "replies": []}, {"body": "That's what I'm doing wrong. I've been doing coin flips", "score": 9, "replies": []}, {"body": "[deleted]", "score": 21, "replies": [{"body": "I'll admit to dabbling with faggot's delight from time to time.  A lot of my first earnings plays that didn't pan out right away were later profitable because they expired weeks or months after.  I've noticed the IV is lower the further out you are too so no nasty IV crush in addition to the underlying going everywhere you don't want it.", "score": 12, "replies": [{"body": "Total faggot here. What the hell is IV crush?", "score": 6, "replies": [{"body": "> Specifically, the expression \"volatility crush\" refers to a sudden, sharp drop in implied volatility that triggers a similarly steep decline in an option's value. A volatility crush often occurs after a scheduled event takes place; for example, a quarterly earnings report, new product launch, or regulatory decision.", "score": 4, "replies": []}, {"body": "[here](http://lmgtfy.com/?q=iv+crush) ya go", "score": -1, "replies": []}]}, {"body": "When you say \"take a 100% loss\" on your calls and puts, do you mean that you take the 100% loss of your premiums paid or you take the 100% loss of the difference between the strike price and initial contract price..(hope I'm explaining that correctly)", "score": 2, "replies": [{"body": "100% on option premiums paid.", "score": 2, "replies": [{"body": "Gotcha.  So you are risking less to potentially make much more, but you also risk losing the entire initial investment, albeit smaller, whereas purchasing the actual stock outright carries less risk as the odds of losing ALL of the investment is much less, but the chances of short term gains are also much less.  ", "score": 6, "replies": [{"body": "10-4, fgt. Gfy!", "score": 6, "replies": []}]}]}]}]}, {"body": "unless you like to bet the market is outpricing a move, like I do. then week of earnings are the way to go", "score": 2, "replies": []}]}, {"body": "Infinite loss potential. That's some flair if I ever saws it.", "score": 6, "replies": []}, {"body": "Is QQ queer on queer sessions? Other than that nice post. Pzza going up in the club on a tuesday ", "score": 9, "replies": [{"body": "QQ is internet slang for \"crying\" because the Q's resemble eyes with tears coming out of the bottom of them.", "score": 0, "replies": []}]}, {"body": "This guy fucks", "score": 10, "replies": [{"body": "Himself", "score": 4, "replies": [{"body": "Your Mother!", "score": 4, "replies": [{"body": "He'd know a low about fucking himself ", "score": 1, "replies": []}, {"body": "Your dad's boyfriend", "score": 1, "replies": []}]}]}]}, {"body": "Op you forgot the delights.", "score": 4, "replies": []}, {"body": ">The Market: Yup. Even if everything logical is saying the stock should go up or go down and it is doing the opposite. The Market doesn’t give a FUCK about the Shouldland you’re living in. Never underestimate a trade going completely wrong just because the market doesn’t give a shit about you or anything logical.\n\nBasically, TSLA earnings 30% below forecast, CFO announces next earnings will be higher than previous forecast, causing stock price to go up anyway.", "score": 4, "replies": [{"body": "That was the earnings I had in mind while writing that.  11 consecutive quarters of earnings misses, but we'll seriously make money next time... maybe...", "score": 6, "replies": []}, {"body": "I've also seen heavy earnings beats with good guidance take a dive or stay flat the following day just because the market was red that day. I think it was RHT that did that to me last quarter.\n\nRGR today is a decent example. Good beat, up 4% or so ah, down then flat today due to all the red. ", "score": 2, "replies": []}]}, {"body": "I like this. Learn from this faggots. ", "score": 18, "replies": []}, {"body": "Fuck this. Inverted options for quick $", "score": 4, "replies": [{"body": "Is this a meme?", "score": 2, "replies": [{"body": "It is now fag", "score": 3, "replies": []}]}]}, {"body": "OP, what tools/news/analysis do you use to determine which companies to bet on, then then in which direction.\n\nHow come you don't use straddles?", "score": 4, "replies": [{"body": "Mostly just go with my dick.  Straddles are awful for earnings plays because implied volatility is at its highest making the options very expensive.  You need a ridiculous move to be profitable. ", "score": 5, "replies": [{"body": "Noob here. What if you used a straddle earlier? (E.g. 2 weeks before earnings) Would that be bad because the of the time decay?", "score": 2, "replies": []}, {"body": "I'd rather take a chance with a straddle on Apple, Tesla, Facebook, and Amazon than guess a direction. Worked out well for me in Apple and Amazon. Looking to reload on Tesla.", "score": 1, "replies": [{"body": "I did one earnings straddle and the 130% gain of the call left me with a much more meager gain when the put expired worthless.  I was actually looking at some Iron Condors for tomorrows earnings and they dont look half bad.  Essentially a call and put spread opened up at the same time.", "score": 0, "replies": []}]}]}]}, {"body": "There was a post yesterday that said around 70% of earnings reports beat estimates, keep that in mind.", "score": 3, "replies": [{"body": "Same % of companies see their PPS increase too?  Beating estimates doesn't mean the share price will go up.", "score": 4, "replies": []}]}, {"body": "Your a savage. Thanks for sharing faggot ", "score": 3, "replies": []}, {"body": "What's with this well-reasoned, useful shit? Get it away from me. ", "score": 3, "replies": []}, {"body": "So you didn't tell me exactly what Im supposed to buy or sell here. 5minutes of my life I can't gave back.\n\n", "score": 3, "replies": []}, {"body": "As a hella noob, thanks.\n\nAlso: Please explain what this IV Crush is.", "score": 3, "replies": [{"body": "Someone shared a good explanation [elsewhere in the thread](https://www.reddit.com/r/wallstreetbets/comments/4hpi2b/wsb_earnings_gambling_101/d2rm49r).  \n\nHere's a real world example:  Currently the $TSLA $230 strike Call that expires Friday is trading for about $6.40 with an IV % of 120%.  After earnings are released that IV % will drop to between 20-40% knocking a tremendous amount of value off of the option.  So whatever they report, if the stock only gets to say $235 on Friday, you will still have lost money because the breakeven price is $236.40. \n\nHigh IV = option is expensive.  Once an earnings announcement comes and goes IV drops making the expensive ass options you just bought worth a lot less than you bought them for.  That is unless the underlying swings wildly past your strike price in which case you get bitchin gains.\n\nHard to wrap your brain around, but keep studying and it literally all clicks at once.", "score": 1, "replies": [{"body": "Ahh I get it, thanks.", "score": 2, "replies": [{"body": "Yeah and I was talking $TSLA when writing that up.  Not too long ago $CMG delivered an early earnings release while they were doing damage control on the ecoli shits.  So here come the actual earnings release, with all the bullshit going on, IV went up again.  People were buying calls and puts and saying how it was going to fucking fly the next day.  Well earnings release came, it went, and the stock couldn't have moved more than 1% up or down the following day.  It's because they already told everyone what their earnings were going to be, and don't get me wrong this has happened and then the preliminary earnings were worse than the actual release, but IV dropped and options near the money lost a shitload of value.", "score": 1, "replies": []}]}]}]}, {"body": "This is a great way to max gainz! Go fuck yourself", "score": 3, "replies": [{"body": "You too, pal.  You too.", "score": 2, "replies": []}]}, {"body": "So you're telling me to put it all in SUNE? On a related note, how much have you made form all your bets?", "score": 4, "replies": [{"body": "SUNE and MOON rhyme, so can't see a reason why not.", "score": 3, "replies": []}, {"body": "I'm negative $1.5k in this account overall, however really putting in the credit hours for Hard Knocks U.  I've recovered from the brink a few times and I'm fairly confident some disciplined and thoughtful trading will pull the account into the green within a few months.  Keeping capital exposure low with gain potential high has been key.", "score": 2, "replies": []}]}, {"body": "in regards to your $PZZA play.. Q1 looks decent, 2016 guidance reaffirmed, but AH volume is dead and price is even lower than the close price.  picked up 200 shares @ 53.75. ex div date is in two days", "score": 2, "replies": [{"body": "Yeah not looking too good.  Nice EPS beat, but revenue coming under estimates which will tank it since the guidance isn't impressive.", "score": 1, "replies": [{"body": "thanks OP.  some pocket change here.  unfortunately i jumped the gun a little and sold $55 strike covered calls this morning, trading at 57.50 now.  oh well, i'll take the profits", "score": 1, "replies": []}]}]}, {"body": "great thanks much", "score": 2, "replies": []}, {"body": "lotta words for 'flip a coin and never short a company that reports non-gaap the day before earnings'", "score": 2, "replies": []}, {"body": "Posting to read this when I'm not drunk and shopping", "score": 2, "replies": [{"body": "Drunk shopping like out and about or on amazon?", "score": 2, "replies": [{"body": "Amazon doesn't give the same experience of shopping luxury, doubt you would know that. Amazon doesn't serve you champagne either whilst you shop.", "score": 1, "replies": [{"body": "They give you anything to deal with being a cunt?", "score": 1, "replies": [{"body": "No the Louis Vuitton phone case didnt really ease my cuntiness to poor faggots who talk shit.\n\nedit: nor did the sunglasses, wallet, manpurse for being in asia, shoes, belt", "score": 1, "replies": []}]}]}]}]}, {"body": "What can cause implied volatility to tank? ", "score": 1, "replies": [{"body": "Implied volatility is the uncertainty factor (i.e how much is this stock gonna possibly move after earnings) Once the uncertainty is no longer there (i.e we know how much it moved) it drops. ", "score": 2, "replies": [{"body": "Ok, so basically if the stock doesn't move the way your option did then it looses all value since the volatility isn't there?", "score": 1, "replies": [{"body": "It doesn't lose all its value but it will lose a lot of value due to iv dropping. If the stocks moves as implied or greater you will still have a very profitable trade. You lose all your money though if it moves the opposite way or flat. ", "score": 1, "replies": [{"body": "Correct me if I am wrong, but $F exhibited this on their earnings last week. PM beat and trading above $14, market opens, $F drops, my $14 calls are worthless. \n\nIt later rallied and I came out on top, but I felt that IV crush hard in the beginning. ", "score": 1, "replies": [{"body": "Yes thats what happened. Iv crush wont automatically kill an option but it will make it much less valuable. This mainly applies to out of the money options. All it really means is that when there is high chance of a huge movement an option becomes over priced from what it would normally be priced at. This effects some securities more than others. \n\nI lost some money on vrx puts last week from this. Vrx has had high iv for months so i didnt think to check if it was even higher in anticipation of 10k. Despite the stock dropping 10% the next day my puts still lost 30% mainly because they were still a few strikes out of the money, but still goes to show. ", "score": 1, "replies": []}]}]}, {"body": "Even if the stock moves in the predicted direction, you might still end up in the red, if the drop in volatility is big enough.", "score": 1, "replies": []}]}]}]}, {"body": "don't forget to have the right date of earnings. don't just rely on googlefinance or briefing.com for earning dates cuz that shit changes a lot and may just be estimates, check the actual investors relations page of the company. ", "score": 1, "replies": []}, {"body": "Thx for this - noob question - can past earnings performance really be used as an indicator of present/future earnings performance?", "score": 1, "replies": [{"body": "No.  Never.", "score": 2, "replies": [{"body": "So when you say \"First I will look at Estimize to get a feel for how they've done in the past as well as what to expect for this earnings\"\n\nHow exactly are you factoring how they've done in the past into the equation?\n", "score": 1, "replies": [{"body": "Looking at previous earnings estimates vs actual, whether they're growing year over year, history of beats or misses, etc.  Gotta go with your dick when deciding how to trade it.", "score": 2, "replies": []}]}]}]}, {"body": "Think you meant minimizing loss instead of maximizing it on the spreads. Overall good information though. ", "score": 1, "replies": []}, {"body": "Who do you trade with? I'm looking for both a good real options trading account and a good simulator options trading account.\n\nI'd like to experiment with some of those ichi-moku clouds.", "score": 1, "replies": [{"body": "TD for now.  I have seen fgts on here keep minimuk acct requirements to have a TD account for charts and research, but then trade with Option House.", "score": 2, "replies": []}]}, {"body": "So nothing about vol or expected moves... interesting.", "score": 1, "replies": [{"body": "Vol as in volume or volatility?  Expected moves and/or volatility?  I touched upon it with the option prices being high with high IV.  One site I didn't mention in my post, http://stocksearning.com/, does a good job of organizing upcoming earnings calls and including % movement statistics.  Can't recommend the site/service though with all the intrusive \"FREE TRIAL\" popups.  Do you have a good suggestion on a resource for option prices and expected earnings moves?", "score": 1, "replies": [{"body": "Bloomberg terminal", "score": -3, "replies": [{"body": "Hmmm... a resource that's not as expensive as an automobile?", "score": 3, "replies": [{"body": "Don't worry about this faggot, im 100% certain he doesn't trade with Bloomberg.", "score": 6, "replies": []}, {"body": "Don't trade earnings then. There are a lot of institutions doing it and doing it better and there isn't going to be much alpha at all if you're at an information disadvantage ", "score": -2, "replies": []}]}]}]}]}]}
