{"title": "The story of my 400% yolo", "selftext": "Not sure why I'm sharing my strategy with you faggots but get ready for a good one. Starting from the beginning..\n\nI was a dumb fuck and knocked my girlfriend up in high school. I never got to go to college, party, fuck random chicks I had work and take care of my kid. Shit job and no money to do anything, barley getting by. \n\nFast forward some years girlfriend gets in bad car accident, gets big insurance payout. Cunt thinks shes hot shit now, takes the kid and ditches me. So I did what any true american would, sue that bitch and take half her money - common law marriage is the tits. \n\nI'm sitting on my ass wondering what to do with 250g's, decide to change everything. Buy suits, a brand new panamera, rent small apartment in big city, spend 8g's on membership to this fucking club called soho house. I sit in there all day eating free food, getting drunk, and socialize with these idiot wannabe actors who think I'm big shit. Start spewing random shit I read on this sub. \"Yeah I net 80% last week selling triple leveraged naked calls.\" No fucking clue what I'm saying. \n\nPeople start trusting me and asking my story. Tell them I trade for a living, takes me 2 hours each morning then I just sit back and hang out. Tell them I could give them some advice if they need it. \n\nFinally I convince this guy to paypal me 10 grand, by telling him I can double it for him in 6 days. In 4 days I give him back his money plus  the last 10 of my own. \n\nWord starts to spread. I travel between new york, chicago and la locations meeting with people talking about shorting the euro and making fucking bank. Get enough customers that I'm paying them with their own money. \n\nTwo weeks ago I decided to exit my trade, told a few people I lost their money then just cancelled my membership and got a new phone number. Locked in my profits. So here I am sitting on my Carver 366 Motor Yacht in palm beach with $800k in my bank account.\n\nYou're welcome you fucking faggots.", "id": "4k7sx2", "created_utc": 1463743900.0, "score": 122, "upvote_ratio": 0.75, "num_comments": 79, "comments": [{"body": "You're making this too easy for the Feds.", "score": 104, "replies": []}, {"body": "If you spent 8 grand on the membership the foods not free dumb fuck ", "score": 67, "replies": [{"body": "Plus, Soho House membership is only $1,800 this year. ", "score": 18, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "He's talking about the one in Meatpacking though. ", "score": 3, "replies": []}]}, {"body": "And the food/drinks still cost money, cute story though...faggot.", "score": 2, "replies": []}]}]}, {"body": "https://t3hwin.com/i/2014/12/The-shitpost-king.jpg", "score": 34, "replies": []}, {"body": "/r/thathappened", "score": 74, "replies": [{"body": "You know it's fake when Soho house membership isn't even that expensive...", "score": 32, "replies": [{"body": "And no free food. ", "score": 14, "replies": []}]}, {"body": "[suck my dick faggot](http://imgur.com/7XneSEs)", "score": -20, "replies": [{"body": "that ain't nothin' bitch\n\nhttps://i.imgsafe.org/318c0e7.png", "score": 16, "replies": [{"body": "Cool inspect element.", "score": 24, "replies": []}, {"body": "The fuck is a chequing? ", "score": 9, "replies": [{"body": "British spelling of checking. Moran.", "score": 3, "replies": [{"body": "The fuck is a moran? ", "score": 3, "replies": [{"body": "http://www.rumproast.com/index.php/site/comments/journalism_a_pictorial_guide_for_terry_moran/", "score": 1, "replies": []}]}]}]}, {"body": "[Hey, we have similar numbers.](http://imgur.com/KU3eS7S)", "score": 3, "replies": [{"body": "I am humbled", "score": 2, "replies": []}]}, {"body": "Can I have 0.01% of that? Pretty please?\n\nEdit: faggots can't handle an obvious joke apparently. Raining downvotes like McDonald's job applications on the %99", "score": -9, "replies": [{"body": "m8...", "score": 3, "replies": [{"body": "Since when Australians came to WSB to YOLO? Go back to eat some vegemite with those aborigines and brah, GFY.", "score": 3, "replies": [{"body": "I'm English fgt", "score": -1, "replies": [{"body": "Yes I feel you want to be English and it is totally okay, I don't judge. Did you know Australians were English once?\n\nWith the loss of its American colonies in 1783, the British Government sent a fleet of ships, the \"First Fleet\", under the command of Captain Arthur Phillip, to establish a new penal colony in New South Wales. \n\nA camp was set up and the flag raised at Sydney Cove, Port Jackson, on 26 January 1788, a date which became Australia's national day, Australia Day, although the British Crown Colony of New South Wales was not formally promulgated until 7 February 1788. The first settlement led to the foundation of Sydney, and the exploration and settlement of other regions.\n\nA British settlement was established in Van Diemen's Land, now known as Tasmania, in 1803, and it became a separate colony in 1825. The United Kingdom formally claimed the western part of Western Australia (the Swan River Colony) in 1828. Separate colonies were carved from parts of New South Wales: South Australia in 1836, Victoria in 1851, and Queensland in 1859.", "score": 3, "replies": [{"body": "tldr", "score": -2, "replies": []}]}]}]}]}, {"body": "That was me logging in with my many sock accounts and downvoting you over and over to let you know you ain't getting a damn penny of my $774M", "score": 1, "replies": [{"body": "Fine I'll buy my own yacht. DAD", "score": 1, "replies": []}]}]}]}, {"body": "Oh snap!", "score": 1, "replies": []}]}, {"body": "pussies like you can sit on the sidelines. Real mother fuckers actually make shit happen. I know it's threatening to read real mother fuckers conquests for a bitch of your nature. But just saying naw its too real for me is a bitch move and bitches stay bitches. Life is but a dream when you a young hung mother fucker of my or ops nature", "score": -18, "replies": [{"body": "K", "score": 13, "replies": []}, {"body": "Yeah, YOLOers. We got a badass in this sub.\n\nToo bad he can not show any proof to substantiate his claim.", "score": 1, "replies": []}]}]}, {"body": "So knock up dumb whore, work shitty job for a few years, make sure my girlfriend gets in accident and leaves me, sue her for half of her $500k settlement, use that money to connect with dumb rich people, pull a ghetto Bernie Madoff on them, and then post about it on a public forum so if it's true I probably end up getting caught... Ok I think I can do this.\n\nEdit: a letter", "score": 44, "replies": [{"body": "pull a ghetto Bernie Madoff lmaooo", "score": 14, "replies": []}, {"body": ">pull a ghetto Bernie Madoff on them,\n\n\nHoly Fuck lol\n\n\n", "score": 2, "replies": []}, {"body": "500m settlement? Can you please learn how to read?", "score": -8, "replies": [{"body": "Goddamnit", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "I so wish you work in my accounting department.\n\nYou can generate Millions out of nowhere.\n\nPlease contact me, I want you to balance our book.", "score": 1, "replies": []}]}]}, {"body": "Screenshot of account or GFY", "score": 26, "replies": [{"body": "This fag has no proof", "score": 9, "replies": []}]}, {"body": "[deleted]", "score": 29, "replies": [{"body": "Good idea. Let's tell the cops that there's some guy on Reddit named \"probablysmarter\" that may have broke the law - we don't know for sure because all the evidence we have is a post on a Reddit thread where people are known for saying crazy sh*t all day. ", "score": 0, "replies": [{"body": "we got his ip, get'em boys", "score": 1, "replies": []}]}]}, {"body": "You paid them with their own money and didn't even take out a brokerage fee? Idiot! Everyone knows that's where the real money is!", "score": 6, "replies": []}, {"body": "So you watched American Gangster? ", "score": 3, "replies": []}, {"body": "Lol yo whats up Madoff I thought you were still in jail man? Hit me up at them digits tho.", "score": 3, "replies": []}, {"body": "Dude, send me that $850k and I'll turn it into $5mil by this time next week. Lightweight pussy", "score": 8, "replies": [{"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.8142 \n > [What is this?](https://pastebin.com/64GuVi2F/48858)", "score": -3, "replies": []}]}, {"body": "Nice meme bro. Soho house is members only, and only by referral or invite. I used to work at soho house in miami. Faggot.", "score": 3, "replies": [{"body": "Hey, probably he sucks dicks to get in!!!\n\nYou can get good  referral after one orgy", "score": 1, "replies": []}]}, {"body": "[deleted]  \n\n  > This comment has been overwritten by [this open source script](https://greasyfork.org/en/scripts/10380-reddit-overwrite) to protect this user&apos;s privacy.  The purpose of this script is to help protect users from doxing, stalking, and harassment. It also helps prevent mods from profiling and censoring.  \n\n  > If you would like to protect yourself, add the Chrome extension [TamperMonkey](https://chrome.google.com/webstore/detail/tampermonkey/dhdgffkkebhmkfjojejmpbldmpobfkfo), or the Firefox extension [GreaseMonkey](https://addons.mozilla.org/en-us/firefox/addon/greasemonkey/) and click Install This Script on [the script](https://greasyfork.org/en/scripts/10380-reddit-overwrite) page.  Then to delete your comments, simply click on your username on Reddit, go to the comments tab, scroll down as far as possible (hint: use [RES](http://www.redditenhancementsuite.com/)), and hit the new OVERWRITE button at the top.", "score": 4, "replies": [{"body": "Tell him Steve-Dave!", "score": 1, "replies": []}]}, {"body": "Soho house bars anyone in finance from membership and the food isn't free. Funny story though.", "score": 2, "replies": []}, {"body": "I chose a dvd for tonight", "score": 2, "replies": []}, {"body": "What even is this? It's not funny. It's not true... it's not a troll. What is this. You entered into a new genre of garbage post", "score": 2, "replies": []}, {"body": "YOLO FUCKING DIEM", "score": 1, "replies": []}, {"body": "Fucking a man", "score": 1, "replies": [{"body": "Probably several", "score": 5, "replies": []}]}, {"body": "doubling money follow me 2 wildy", "score": 1, "replies": []}, {"body": "Great copypasta", "score": 1, "replies": []}, {"body": "WsB theme: \"its like 4chan found a Bloomberg terminal\"\n\nWsB actual: gets mad when some one post shit tier green text like its 4chan\n\n", "score": 1, "replies": []}, {"body": "Are you a internet marketer? well i got 10$ to let you double my account bruuuhh", "score": 1, "replies": []}, {"body": "Pathological liars are the best! GFY fgggttt", "score": 1, "replies": []}, {"body": "This is bullshit. Common law marriage has been abolished but in a handful of states. ", "score": 1, "replies": []}, {"body": "Fake. And gay.", "score": 1, "replies": []}, {"body": "You had a golden opportunity to bait and switch and reveal your true identity to be McAfee...\n\n", "score": 1, "replies": []}, {"body": "if only life worked that way", "score": 1, "replies": []}, {"body": "800k doesnt put you on a yacht in palm beach for lyfe...start suing again ", "score": 1, "replies": []}, {"body": "I know you're lying because Soho House is only 2k a year \n", "score": 1, "replies": []}, {"body": "this is 4chan shitpost quality", "score": 1, "replies": []}, {"body": "sounds like a made up story.", "score": 1, "replies": []}, {"body": "Everyone saying this is fake...  \nNo shit. Kind of funny tho. ", "score": 1, "replies": []}, {"body": "best investment advise ever", "score": 1, "replies": []}, {"body": "Honestly read like 2 sentences in the middle and the last. Sounds like a Ponzi scheme. Can anyone confirm it is indeed a Ponzi? ", "score": 1, "replies": []}, {"body": "marriage is a business, and you're good at it so far my friend", "score": 1, "replies": []}, {"body": "So you're an asshole lying thief who has never made a trade? Can we ban this ~~guy~~ faggot?", "score": 1, "replies": []}, {"body": "Poor man Bernie madoff", "score": 0, "replies": []}, {"body": "Not gonna lie, that's impressive.\n\nOpportunities present themselves via dumb fucks..take advantage ", "score": 0, "replies": []}]}
