{"title": "Calls or Puts next week?", "selftext": "[removed]", "id": "1c8doq5", "created_utc": 1713576236.0, "score": 13, "upvote_ratio": 0.81, "num_comments": 31, "comments": [{"body": "Thanks for your submission!\n\nWe love new and original content here on WSB.\n\nWe have no tolerance for basic templated memes, reposts from the front page, or boomer memes.\n\nYes, this can be a little subjective at times, but we want to show you the best WSB has to offer!\n\nIf you need some guidance, don't hesitate to reach out to modmail and we'll give you some pointers!\n\nA few tips though!\n\n• Don't just submit a chart of the current price. Come on. Google only costs $5 per search. (wait, you guys are searching for free?)\n\n• Reaction gifs are fucking lame. Put that shit in a comment, no one wants to look at your face in real life anyways so why are you making a thread about it.\n\n• Don't repost stuff. All of us are terminally online, how dare you try and make us laugh with an image posted somewhere else. Jokes aside, we don't want to beat a joke to death, so give us some fresh OC and we'll be a lot cheerier.", "score": 1, "replies": []}, {"body": "You missed the boat to late for puts to early for calls.", "score": 26, "replies": []}, {"body": "If no more escalation in the ME over the weekend, I see us gapping up on Monday.", "score": 7, "replies": [{"body": "Gap up then sell off.\nSemi's disappointed. High expectations for earnings.\n\nWhat happened to NFLX will happen to the rest of the fab 4.", "score": 2, "replies": []}]}, {"body": "25% chance calls will print 25% puts will print 50% chance flat", "score": 5, "replies": []}, {"body": "https://preview.redd.it/nunlleqinjvc1.jpeg?width=1280&format=pjpg&auto=webp&s=a85ee7b317280ffc72ae0aa786e7bfdcb7d35334", "score": 6, "replies": []}, {"body": "Why is everybody so anally fixated on NVDA, SMCI and QQQ? Lots of other stocks to trade.", "score": 2, "replies": [{"body": "Literally every post I see is spy also. People here just playing casino games. All in on red or black. There's not a ton of good intel here.", "score": 2, "replies": [{"body": "Bro spy is the 0dte trades loving index. We regards love gambling, spy gives us the option to lose big or win big with 0dte. Please respect spy gambling ![img](emote|t5_2th52|4260)", "score": 3, "replies": [{"body": "May the odds be in your favor.", "score": 3, "replies": []}]}, {"body": "It's all about exit liquidity", "score": 1, "replies": []}]}]}, {"body": "Be cautious most 🌈🐻’s are revenge trading for calls that shit the bed… I think we get some chop before a direction", "score": 3, "replies": []}, {"body": "Ye I bought SMCI puts too late today and still went up 1K, wish I had bought it earlier or yesterday but some\nProfit better than none, probably gonna hold until Tuesday or something depending. Trying to regain losses from this bear market", "score": 2, "replies": []}, {"body": "Yes", "score": 2, "replies": []}, {"body": "Buying more TSLA & NVDA shares next week.", "score": 2, "replies": []}, {"body": "i'd say we are due for a dead cat bounce.... if there is no major war news or other issues this weekend, we may get that bounce next week.... but sell the bounce....", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 61 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Fuck yo calls fuck yo puts", "score": 1, "replies": []}, {"body": "we already had 6 consecutive Red days, there’s only a few of that in the history. Odds of having more is not slim, but next week we will surely see at least 2 Green Day’s if nothing major happen on weekends.", "score": 1, "replies": []}, {"body": "Puts on MSTR.... that inflated pig gonna pop.", "score": 1, "replies": []}, {"body": "The market is being irrational. But stocks were overbought. SPY weekly rsi was at levels not seen since 2020 and 2018 right before the crashes.\n\n\nEarnings reports are mostly positive. Companies are making money. Sales are down and companies are blaming price hikes. This means they are probably done raising prices short term which means the april cpi is gonna be cool.\n\n\nFrom a technical perspective we are very oversold and basically sitting at major support in all indices. \n\n\nThat said i wouldnt be surprised if we keep selling off, because this market is irrational.\n\n\nMaybe until the next inflation report comes in.", "score": 1, "replies": [{"body": "People sell when they're scared of a crash, nvda down 10% probably not done causing people to panic sell", "score": 1, "replies": [{"body": "Market= people\n\n\nPeople are irrational", "score": 1, "replies": []}]}]}, {"body": "Do it or don't do it.  Just don't shit up our sub while you wait for internet strangers to hold you hand while your balls drop.", "score": 1, "replies": []}, {"body": "Calls. After a huge loss this week, there almost always some kind of rebound. Earnings is also this week, so I would expect some giants to post some positive earnings. If the giants do post great earnings and guidance, SPY will definitely be over 505+.", "score": 1, "replies": []}]}
{"title": "Cheer up NVDA bulls", "selftext": "[deleted]", "id": "1c8e4pz", "created_utc": 1713577615.0, "score": 38, "upvote_ratio": 0.82, "num_comments": 32, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 29 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1c37inc/alccoklo_dd/) \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Stop doing things that make sense, this is a casino. 50 shares worth of NVDA buys plenty of 0DTE next week regard.", "score": 47, "replies": []}, {"body": "You need a H100 for mining now.", "score": 6, "replies": [{"body": "Would explain why Peter Thiel estimates a BTC price of at least 40k for mining to be profitable.", "score": 2, "replies": []}]}, {"body": "How long is \"in no time\"? And what does this chart have to do with it — what do you see in it? It could rebound, but might as well go lower", "score": 2, "replies": [{"body": "It could definitely go lower, but eventually, it will go higher.  If I knew the exact timeframe, I'd be loaded up on options.  The point is this:  Unless you think that the US is going to balance its budget, the federal deficit is only going to go up.  When the deficit goes up, the Fed has to create more dollars out of thin air and send them to the US Treasury to finance that deficit.  Those dollars are then in the economy.  But that doesn't automatically lead to inflation... what really matters is the velocity of that money (how often it's changing hands).  To control velocity, the Fed fucks around with the short-term federal reserve rate (dogma is that higher rates slow the velocity and lower rates increase the velocity).  But since the Fed has a dual mandate (stable prices--ie, steady 2% inflation--and maximum employment), they can't just jack up the interest rate as much as they want to get inflation back down.  Me thinks that they will have to eventually settle on a higher centrally planned interest rate target (r-star) of 3-4%.  In that scenario, asset prices of equities only have one way to go...up.\n\nAs for NVDA specifically, they have really high margins and a protective moat for the next couple years at least.  So from an investing/trading perspective, I like this high-beta stock at a price in the 700s.  It's 22% off its highs, and we just had a -10% day.  The risk is that I have to hold for longer for gains because it dips further or way down, but because I think it's still a growth company with valuable products, and the overall trajectory of stonks is up and to the right, I think it'll get back to ATHs.  Just don't know when.", "score": 3, "replies": [{"body": "This reads as someone who read a few Wikipedia articles on monetary policy. Sorry it’s not that simple. But before you ask no I am not explaining it to you.", "score": 4, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Again that’s overly simplified and not accurate. But keep parroting what you read on Wikipedia.", "score": 2, "replies": []}]}]}]}]}, {"body": "NVDA to $500 confirmed", "score": 1, "replies": [{"body": "Rlly ?", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I hear what you're saying, but I'm not too concerned that the dollar is gonna be replaced by a BRICS currency in my lifetime.  It's a global circlejerk right now where all of the currencies get stronger and weaker vs. each other, all the while, the plebs all over the world lose their purchasing power.  It's gonna take a looong time.  At least I hope so.  I don't wanna be around for the mayhem if the dollar reaches its minsky moment soon.", "score": 1, "replies": [{"body": "Not to mention, all of the countries in the BRICS are just as likely to go to war against each other as they are to cooperate.  They're all run by narcissistic egomaniac dictators just waiting for the opportunity eliminate the others.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Dollars are useful for buying yachts, mansions, and yachts for your mansions.", "score": 1, "replies": []}]}]}]}, {"body": "Exactly. I have the same issue with being chronically early as well. It's weird to spend months pointing something out and suddenly it becomes the top story an entire quarter after it was public", "score": 1, "replies": []}, {"body": "Look at the Cisco chart", "score": 1, "replies": [{"body": "I think that we're in a completely different era than the dotcom bubble.  The US had a balanced budget in 1998-2001.  Now, we're running trillion dollar+ annual deficits with no end in sight, regardless of who's in power (blue or red).", "score": 2, "replies": [{"body": "I’m looking at history … look at the history of the railroads. Everyone was so excited and invested everything into this transformative tech… most went bankrupt and then the transportation system was left and widely adopted. The early speculators funded it and were left holding the bag. \n\nSame thing happening here. Ai revolution will occur / is occurring but it’s going to take 5-10 years to catch up with the speculation. In the meantime all the big funds and pension plans will be moving out there money.\n\nThat’s my prediction anyways.\n\nPUTS on Nvidia.", "score": 0, "replies": [{"body": "NVDA is the company making the picks and shovels though, and their revenue/earnings shows that all of the major tech companies are buying their products (while trying to create their own picks and shovels).  But I completely get the bearish point of view that the future growth is already baked in at the 700s price, so it's downhill from here.  If I had to make a prediction for next 2-3 weeks, I'd guess down and PUTS too, but I'm not a great timer, so that's why I saw the 22% drop from ATH and the 10% down day and thought it's a good time to go long unleveraged (shares) so i don't get theta decay.  \n\nAnyways, appreciate the counterview and good luck on your position.", "score": 3, "replies": [{"body": "I really encourage researching the railroad and gold\n rush history. Yes if you were the first one to the Yukon with pick axes and shovels you made a killing but so so so many lost everything showing up late and even died trying to bring the supplies so other could mine. And also the people who invested in those people and supplies also lost big. \n\nMy point is if you got in at nvidia early you should have already sold… I would not start playing with this game now.", "score": 2, "replies": [{"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "I never even bought nvidia you dumb bot… I did buy amd under 100 and sold at 160 though.", "score": 1, "replies": [{"body": "Feels a bit regarded to try to appear smart and teach people a lesson in history when you've missed out on a 1,870.58% five year return on NVDA, don't you think? \n\nI don't have a horse in this race but I'm sure there were people saying NVDA was overvalued back in 2019 as well.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": -5, "replies": [{"body": "The chart starts at 1993 because that's the max timeframe for ThinkorSwim.", "score": 3, "replies": [{"body": "Spy didn't exist before 1993 that was the funds inception", "score": 3, "replies": []}]}]}, {"body": "Cope? NVDA was frothy. The stock went up because AI is growing. When you look under the layers NVDA is doing lots of vendor financing which adds more risk, lots of shit AI companies are bound to fail. Once this AI stuff is normalized like electric cars are normal now, chips will just become a commodity sold at slightly higher price than variable costs. Might be an year or two before that happens but always have an exit plan", "score": -5, "replies": [{"body": "Holy smokes you’re regarded.  The AI chips nvidia is making are for power and efficiency, used to replace humans and increase efficiency.  Every large cap company will require AI to keep up and increase margins and cut headcount.  Comparing AI chips to electric cars is one of the most brainless thing that could ever be uttered.", "score": 16, "replies": [{"body": "This dude gets it", "score": 2, "replies": []}]}, {"body": "Completely agree that it was frothy and needed to purge some leverage.  Like I said, I'm probably a couple hundred points early on this entry, but my point is that solid companies will rebound due to dollar debasement.  Just curious though about your point re: vendor financing... it was my understanding that NVDA's main customers in the chip space were the other big tech companies (META, MSFT, AMZN, etc.)?  Or are you talking about some kind of financing in connection with their SW stack?", "score": 3, "replies": []}, {"body": "CUDA.\n\nNext.", "score": 2, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1c8qu4p", "created_utc": 1713622033.0, "score": 46, "upvote_ratio": 0.88, "num_comments": 31, "comments": [{"body": "[deleted]", "score": 62, "replies": [{"body": "https://preview.redd.it/xbtft48dznvc1.jpeg?width=1125&format=pjpg&auto=webp&s=b6e4beef4a50cecd21c3d2a464f1430f7bee35a3", "score": 7, "replies": [{"body": "IMHOTEP", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271) sorry", "score": 9, "replies": []}]}, {"body": "Mine expires year 2025 ![img](emote|t5_2th52|33495)", "score": 40, "replies": [{"body": "![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)", "score": 14, "replies": []}, {"body": "Sir, this is not r/investing", "score": 3, "replies": []}, {"body": "Keep holding. Don’t sell now", "score": 2, "replies": []}]}, {"body": "You think WSB option buying dictates market momentum?", "score": 26, "replies": [{"body": "This is like the delusional TSM bagholders thinking that the 4/19 calls expiring will somehow cause the stock to moon 30%\n\nAt least I admitted my calls couldn’t pay for a pack of paper towels after earnings (and now can’t pay for a gallon of milk)", "score": 15, "replies": [{"body": "I’ll buy you a gallon if you drain my gallon 😜. Deal?", "score": 1, "replies": []}]}]}, {"body": "Y'all can afford a month out?", "score": 10, "replies": [{"body": "They can’t afford to go *inside* the Wendy’s", "score": 3, "replies": []}]}, {"body": "😭😭 nvda is a dirty whore.. its going down bro why would you put in ring on it. you not suppose to hold on to a slut just get in and get out", "score": 11, "replies": [{"body": "You can't make a hoe a housewife", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 5, "replies": []}]}, {"body": "The new intern trying to get info ![img](emote|t5_2th52|33495)", "score": 3, "replies": []}, {"body": "It’ll pump leading to smci then dump hard", "score": 3, "replies": []}, {"body": "Shorted at 850 since I'm not allowed options still for lack of experience. I'm gonna get five guys to celebrate", "score": 3, "replies": []}, {"body": "I sold some poor saps $1000C but the exp is 1/25 … granted I sold them weeks ago and have made $5000 on them, but my shares have hurt", "score": 3, "replies": []}, {"body": "4/19", "score": 2, "replies": []}, {"body": "“NVDA to 1000” went from realistic to a meme so fast", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 1707 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1bl5hbm/coin_the_next_50x_play/) [x](https://www.reddit.com/r/wallstreetbets/comments/1btcnsb/zoetis_moonshot_update/) [x](https://www.reddit.com/r/wallstreetbets/comments/1bo4lcx/zoetia_the_next_moonshot/) \n**Account Age** | 2 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "5/17", "score": 1, "replies": []}, {"body": "How about the 840 Calls?", "score": 1, "replies": [{"body": "You dead in the water", "score": 2, "replies": [{"body": "No you dead in the water", "score": 2, "replies": []}]}]}, {"body": "You have two options: sell or hold. Which you choose depends on how much money you have. I have no such worries.", "score": -7, "replies": [{"body": "Even karmas taking a hit! Puts on ViualMods karma what a red week. ![img](emote|t5_2th52|18632)", "score": 2, "replies": []}]}]}
{"title": "Let’s go aapl", "selftext": "", "id": "1c8tlhu", "created_utc": 1713629271.0, "score": 41, "upvote_ratio": 0.87, "num_comments": 38, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 9 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 43 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Apple is so low right now, I think this may actually work out. But we are also in what appears to be a bear market so quite risky. Hope it works out", "score": 11, "replies": [{"body": "You're calling a 5%-10% pull back from ath a bear market💀", "score": -7, "replies": [{"body": "13% but looking at the 23 PE, Apple could pop 40%+", "score": 1, "replies": [{"body": "I was referring to S&P drop", "score": 1, "replies": []}]}]}]}, {"body": "![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)", "score": 9, "replies": [{"body": "Goddamn dude lol sell at next pop before you lose it all", "score": 19, "replies": []}]}, {"body": "Sheeesh good luck buddy.  You’re below the 9ema on every timeframe except the weekly…this could literally go all the way down to 145 before you get a solid bounce. 🫡", "score": 8, "replies": [{"body": "Listen to this guy. Dude absolutely zoomed out and isn’t just guessing on a number. 135-145 was a sideways trading zone for quite a while.", "score": 5, "replies": [{"body": "This doesn't make sense to me. Why would you care about the 9ema on a chart that's zoomed out over two years? You can't really look at those old zones as levels of support anymore when they've been broken. I'd be looking at the 200 day average which is around 150 on 2+ year charts. 200-day average has been a pretty solid support for the last 20 years.", "score": 2, "replies": []}]}]}, {"body": "Get out while you can", "score": 7, "replies": []}, {"body": "Apple could go to $135-$140 before it sees 170+ again but kudos on giving yourself some time on this and not buying 180s", "score": 6, "replies": []}, {"body": "4 months is a long time, this will work for sure lol", "score": 4, "replies": []}, {"body": "You got 4 months. You’ll be fine", "score": 4, "replies": []}, {"body": "Bruh", "score": 3, "replies": []}, {"body": "At least 8/16 is safe", "score": 3, "replies": []}, {"body": "Outs and calls is when you bet with someone else’s money right", "score": 3, "replies": [{"body": "Yeah don’t worry options is someone else’s money so you are free to use as much as you want and even better when it’s on margin. ![img](emote|t5_2th52|29637)", "score": 16, "replies": [{"body": "If people call..just don’t answer", "score": 6, "replies": []}]}]}, {"body": " 💸💸💸💸💸💸💸", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 2, "replies": []}, {"body": "Might catch a gap up Monday morning trapping fomo shorts. Not a bad idea", "score": 2, "replies": []}, {"body": "Apple AI WWDC event. Apple re-tests ATH, this will print. It literally can’t go Tits up.", "score": 2, "replies": []}, {"body": "You still holding OP!", "score": 2, "replies": []}, {"body": "If you hate money this much just give it to me. I'll get your wife something nice.", "score": 2, "replies": []}, {"body": "FSComeau in the flesh", "score": 1, "replies": []}, {"body": "Apple is following the Newton's law of gravity. Apple will definitely go, you should have also mentioned the direction.", "score": 1, "replies": []}, {"body": "I think odds are good that you get some point between now and August where Apple bounces back enough for these to at least break even if not make you some thousands. Unless it’s so late into summer that their value has halved.. \n\nWould I make this bet? Hell no. Not unless I was already a millionaire. But hey, this could make you one!", "score": 1, "replies": []}, {"body": "I have this top. But only 1 contract lol", "score": 1, "replies": []}, {"body": "Trust the dip ![img](emote|t5_2th52|12787)![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "RemindMe! 4 Months", "score": 1, "replies": [{"body": "I will be messaging you in 4 months on [**2024-08-21 18:53:33 UTC**](http://www.wolframalpha.com/input/?i=2024-08-21%2018:53:33%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1c8tlhu/lets_go_aapl/l0mtbz6/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1c8tlhu%2Flets_go_aapl%2Fl0mtbz6%2F%5D%0A%0ARemindMe%21%202024-08-21%2018%3A53%3A33%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201c8tlhu)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "This might print, especially cause you got till August.  Apple due for a bounce it’s below 200 day ma", "score": 1, "replies": []}, {"body": " The premium set your money on fire!", "score": 1, "replies": []}, {"body": "Timmy has got your balls in a Vice 😂😂😂", "score": 1, "replies": []}]}
{"title": "NVO play", "selftext": "By now pretty much everyone has heard of NVO and Ozempic but the stock is trading no where near the levels of Al and chip stocks. Those stocks boomed on the hype yet now we are seeing big pullbacks. Now bears are saying it was just a bubble. Those types of stocks run until bears take over. Not saying they are bad but as markets fall they do too. You know what doesn't fall though, obesity rates. The graph shows the increasing obesity rates.\n\nObesity rates aren't just gaining because people eat unhealthy, but big companies encourage this to make money. We saw McDonald's and Krispy Kream partner up which will pretty much gaurenteed make them unreadable amounts of profit.\n\nNow you may think to invest in those companies, but I find way more upside in the cure. Big companies will keep promoting obesity and as the rates rise, many will use ozempic. Increasing population and encouragement for obesity will keep rates rising while people use ozempic, resulting in more and more use of it.\n\nAnyways, they have earnings coming up which I'm extremely bullish on. Not only that, but they are in a wedge pattern right now going into earning. My plays are as follows: 5/3 130$ calls, 5/3 135$ calls. Also have some stock. What do you guys think?", "id": "1c8y3qd", "created_utc": 1713640842.0, "score": 37, "upvote_ratio": 0.84, "num_comments": 35, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 34 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Curing obesity is for the poor.", "score": 21, "replies": []}, {"body": "The fatties, obeasts, landwhales, ham planets, Jabba the Fats, people of calories. Bullish", "score": 21, "replies": [{"body": "More fat shaming = more ozempic🤷‍♀️🤷‍♀️", "score": 19, "replies": []}]}, {"body": "Funny thing is these drugs cause these folks to loose so much muscle so their metabolism goes to hell so they need the drug for life.", "score": 14, "replies": [{"body": "That sounds extremely Bullish", "score": 12, "replies": []}, {"body": "Awesome🤩💴💰(kidding)", "score": 8, "replies": []}, {"body": "Sweet.  Buying more.", "score": 1, "replies": []}]}, {"body": "Just eat less, run more.", "score": 10, "replies": [{"body": "That McDonald’s breakfast with KK donuts is just unbeatable . Why run when you can eat that and take a pill", "score": 8, "replies": [{"body": "Donuts cannot be racist", "score": 2, "replies": []}]}]}, {"body": "MDs say obesity is the new smoking. Joe Camel is back baby.", "score": 3, "replies": [{"body": "Actually it's alcohol and sugary drinks that are being targeted by medical groups like endocrinology and hepatology.", "score": 1, "replies": []}]}, {"body": "Also, McDonald’s just came back with the steak egg and cheese bagel. Sooooooo… puts on fatties running to $MCD. I BOUGHT IT THREE TIME!!!!! This week.", "score": 3, "replies": [{"body": "Making me money!!!", "score": 2, "replies": []}]}, {"body": "Interesting....", "score": 1, "replies": []}, {"body": "Old chart. We’re skinny now.", "score": 1, "replies": [{"body": "😭😭", "score": 1, "replies": []}]}, {"body": "Looks bullish too just filled the gap on the daily, like ur analysis. Also Finland is a W. I like the stock will be opening a position soon", "score": 1, "replies": [{"body": "Noticed that gap too. Forgot to put it in the post", "score": 2, "replies": []}]}, {"body": "People are becoming too poor to keep affording this stuff though, so I don't know how their growth can go much farther.", "score": 1, "replies": []}, {"body": "Looks like they are under investigation from Sanders , do you think this affects any positive earnings reports?", "score": 1, "replies": [{"body": "Not for earnings. Could long term but unlikely it affects earnings unless something major happens before then", "score": 1, "replies": []}]}, {"body": "Share screenshots of your calls", "score": 1, "replies": []}, {"body": "These fat pill stocks are going to the moon. I’m betting it all on lazy fat Americans who’d rather take a pill than workout.", "score": 1, "replies": []}, {"body": "The thing is lots of people are broke to pay or have their insurance cover $1000 for a lifestyle / cosmetic choice. \n\nTry getting your insurance to whiten your teeth and see what they tell you", "score": 1, "replies": [{"body": "Not saying that’s false at all, but just saying I think you’d be surprised on what people spend their money on. While insurance may not cover it, cosmetic products to look skinny deserve half a paycheck for some people.", "score": 3, "replies": [{"body": "1000/refill? Out of pocket ?", "score": 1, "replies": [{"body": "$1000 a month, roughly. Barely any insurance covers it for fat loss purposes.", "score": 1, "replies": [{"body": "Doctors find loopholes if a patient wants this medication. Insurance covers my wife’s.", "score": 1, "replies": []}]}]}]}]}, {"body": "VKTX is primed to take a large chunk of the market share from NVO in the coming year~ish, and it's in a nice pullback right now.\n\nThey have a fat cutting drug coming that is way more effective than Ozempic.", "score": 1, "replies": [{"body": "haha coming year ? Their drug isnt even up for FDA approval, until 2029", "score": 5, "replies": [{"body": "Guh", "score": 2, "replies": []}]}]}]}
