{"title": "Options Questions Safe Haven Thread | Dec 04-10 2023", "selftext": "For the options questions you wanted to ask, but were afraid to.  \n**There are no stupid questions.**  &nbsp;  **Fire away.**  \nThis project succeeds via thoughtful sharing of knowledge.  \n**You, too, are invited to respond to these questions.**  \nThis is a weekly rotation with past threads linked below.\n\n----\n\n###**BEFORE POSTING,  PLEASE REVIEW THE BELOW LIST OF FREQUENT ANSWERS.**   [.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)    \n[..](https://www.reddit.com/r/optionsmods/wiki/)   \n\n---\n\n**Don't exercise your (long) options for stock!**   \n**Exercising throws away [extrinsic value](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value) that selling retrieves.**   \n**Simply sell your (long) options, to close the position, to harvest value, for a gain or loss.**  \n**Your break-even is the cost of your option when you are selling.**  \n**If exercising (a call), your breakeven is the strike price plus the debit cost to enter the position.**  \nFurther reading:   \n**[Monday School: Exercise and Expiration are not what you think they are.](https://www.reddit.com/r/options/comments/m5r8mi/monday_school_exercise_and_expiration_are_not/)**    \n\n**Also, generally, do not take an option to expiration, for similar reasons as above.**\n\n---\n\n**Key informational links**  \n•&nbsp;[Options FAQ / Wiki: Frequent Answers to Questions](https://www.reddit.com/r/options/wiki/faq)  \n•&nbsp;[Options Toolbox Links / Wiki](https://www.reddit.com/r/options/wiki/toolbox/links)  \n•&nbsp;[Options Glossary](https://www.optionseducation.org/referencelibrary/optionsglossary)   \n•&nbsp;[List of Recommended Options Books](https://www.reddit.com/r/options/comments/8qfs14/options_book_list_review_of_all_books_that_helped/)    \n•&nbsp;[Introduction to Options (The Options Playbook)](https://www.optionsplaybook.com/options-introduction/)  \n•&nbsp;[The complete r/options side-bar informational links (made visible for mobile app users.)](https://www.reddit.com/r/options/about/sidebar)  \n•&nbsp;[Characteristics and Risks of Standardized Options (Options Clearing Corporation)](\nhttps://www.theocc.com/about/publications/character-risks.jsp)  \n•&nbsp;[Binary options and Fraud (Securities Exchange Commission)](https://www.sec.gov/files/ia_binary.pdf)   \n[.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)\n\n ----\n\n**Getting started in options**   \n•&nbsp;[Calls and puts, long and short, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/basics)     \n•&nbsp;[Options Trading Introduction for Beginners (Investing Fuse)](https://investingfuse.com/options-trading-for-beginners/)    \n•&nbsp;[Options Basics (begals)](https://www.reddit.com/r/options/comments/gh9vpl/options_basics/)  \n•&nbsp;[Exercise & Assignment - A Guide (ScottishTrader)](https://www.reddit.com/r/options/wiki/faq/pages/exercise)  \n•&nbsp;[Why Options Are Rarely Exercised - Chris Butler - Project Option (18 minutes)](https://www.youtube.com/watch?v=PsZsqiBFnmo)  \n•&nbsp;[I just made (or lost) $___. Should I close the trade? (Redtexture)](https://www.reddit.com/r/options/comments/eunnko/noob_safe_haven_thread_jan_27_feb_02_2020/fg6jjjz/)    \n•&nbsp;[Disclose option position details, for a useful response](https://www.reddit.com/r/options/wiki/faq/pages/trade_details)  \n•&nbsp;[OptionAlpha Trading and Options Handbook](https://optionalpha.com/handbook)   \n•&nbsp;[Options Trading Concepts -- Mike & His White Board (TastyTrade)(about 120  10-minute episodes)](https://www.youtube.com/playlist?list=PLPVve34yolHY43YaBegHMzN9WjrTnQfFr)  \n•&nbsp;[Am I a Pattern Day Trader? Know the Day-Trading Margin Requirements (FINRA)](https://www.finra.org/investors/learn-to-invest/advanced-investing/day-trading-margin-requirements-know-rules)   \n•&nbsp;[How To Avoid Becoming a Pattern Day Trader  (Founders Guide)](https://foundersguide.com/pattern-day-trader/)    \n\n---\n\n**Introductory Trading Commentary**   \n&nbsp;&nbsp;&nbsp;•&nbsp;**[Monday School Introductory trade planning advice (PapaCharlie9)](https://www.reddit.com/r/options/wiki/faq/pages/mondayschool)**  \n&nbsp;&nbsp;**Strike Price**   \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Basics: How to Pick the Right Strike Price (Elvis Picardo - Investopedia)](https://www.investopedia.com/articles/active-trading/021014/options-basics-how-pick-right-strike-price.asp)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[High Probability Options Trading Defined (Kirk DuPlessis, Option Alpha)](https://www.youtube.com/watch?v=DcWHh2co80M)   \n&nbsp;&nbsp;**Breakeven**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Your break-even (at expiration) isn't as important as you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/m0m7at/monday_school_your_breakeven_isnt_as_important_as/)  \n&nbsp;&nbsp;**Expiration**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Expiration & Assignment (Option Alpha)](https://www.youtube.com/watch?v=OnUsu1y1W9w)    \n&nbsp;&nbsp;&nbsp;•&nbsp;[Expiration times and dates (Investopedia)](https://www.investopedia.com/terms/e/expiration-time.asp)  \n&nbsp;&nbsp;**Greeks**  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Pricing & The Greeks (Option Alpha) (30 minutes)](https://www.youtube.com/watch?v=kCJcEOYuuII)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Options Greeks (captut)](https://www.reddit.com/r/options/comments/hl8i2n/option_greeks_101)  \n&nbsp;&nbsp;**Trading and Strategy**    \n&nbsp;&nbsp;&nbsp;•&nbsp;[Fishing for a price: price discovery and orders](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_minimizing_bid-ask_spreads_.28high-volume_options_are_best.29)     \n&nbsp;&nbsp;&nbsp;•&nbsp;[Common mistakes and useful advice for new options traders (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_common_mistakes_and_useful_advice_for__new_options_traders)  \n&nbsp;&nbsp;&nbsp;•&nbsp;[Common Intra-Day Stock Market Patterns - (Cory Mitchell - The Balance)](https://www.thebalance.com/common-intra-day-stock-market-patterns-1031456)    \n&nbsp;&nbsp;&nbsp;•&nbsp;[The three best options strategies for earnings reports (Option Alpha)](https://optionalpha.com/blog/the-three-best-option-strategies-for-earnings)   \n\n---\n\n**Managing Trades**  \n•&nbsp;[Managing long calls - a summary (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/managing_long_calls)  \n•&nbsp;[The diagonal call calendar spread, misnamed as the \"poor man's covered call\" (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/diagonal_calendars)  \n•&nbsp;[Selected Option Positions and Trade Management (Wiki)](https://www.reddit.com/r/options/wiki/faq/pages/positions)  \n\n**Why did my options lose value when the stock price moved  favorably?**  \n•&nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value)\n      \n**Trade planning, risk reduction, trade size, probability and luck**  \n•&nbsp;[Exit-first trade planning, and a risk-reduction checklist (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/trade_planning)  \n•&nbsp;[Monday School: A trade plan is more important than you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/mpk6yf/monday_school_a_trade_plan_is_more_important_than/)  \n•&nbsp;[Applying Expected Value Concepts to Option Investing (Select Options)](http://www.selectoptions.com/Edu-Expected-Result)  \n•&nbsp;[Risk Management, or How to Not Lose Your House (boii0708) (March 6 2021)](https://www.reddit.com/r/options/comments/lyp1uc/risk_management_or_how_to_not_lose_your_house/)  \n•&nbsp;[Trade Checklists and Guides (Option Alpha)](https://optionalpha.com/members/guides-checklists)    \n•&nbsp;[Planning for trades to fail. (John Carter)  (at 90 seconds)](https://youtu.be/N5_OkdvPmUI?t=90)    \n•&nbsp;[Poker Wisdom for Option Traders: The Evils of Results-Oriented Thinking (PapaCharlie9)](https://www.reddit.com/r/options/comments/qfq82a/poker_wisdom_for_option_traders_the_evils_of/)   \n\n**Minimizing Bid-Ask Spreads (high-volume options are best)**   \n•&nbsp;[Price discovery for wide bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/price_discovery)  \n•&nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)  \n\n\n**Closing out a trade**  \n•&nbsp;[Most options positions are closed before expiration (Options Playbook)](https://www.optionsplaybook.com/options-introduction/closing-option-position/)       \n•&nbsp;[Risk to reward ratios change: a reason for early exit (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/risk_reward_and_exits)   \n •&nbsp;[Guide: When to Exit Various Positions](\nhttps://www.reddit.com/r/options/wiki/faq/pages/whentoexit)   \n•&nbsp;[Close positions before expiration: TSLA decline after market close (PapaCharlie9) (September 11, 2020)](https://www.reddit.com/r/options/comments/ipqkua/fridays_tsla_lesson_close_positions_before/)   \n•&nbsp;[5 Tips For Exiting Trades (OptionStalker)](\nhttps://www.reddit.com/r/options/comments/qtwsm5/5_tips_for_exiting_trades/)   \n•&nbsp;[Why stop loss option orders are a bad idea](https://www.reddit.com/r/options/wiki/faq/pages/stop_loss)   \n\n---\n\n**Options exchange operations and processes**     \n•&nbsp;[Options Adjustments for Mergers, Stock Splits and Special dividends; Options Expiration creation; Strike Price creation; Trading Halts and Market Closings; Options Listing requirements;  Collateral Rules; List of Options Exchanges; Market Makers](https://www.reddit.com/r/options/wiki/faq/pages/exchange_operations)   \n•&nbsp;[Options that trade until 4:15 PM (US Eastern) / 3:15 PM (US Central) -- (Tastyworks)](https://support.tastyworks.com/support/solutions/articles/43000435335-options-that-trade-until-3-15-pm-central-)  \n\n---\n\n**Brokers**   \n•&nbsp;[USA Options Brokers (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/brokers)    \n•&nbsp;[An incomplete list of international brokers trading USA (and European)  options](https://www.reddit.com/r/options/wiki/faq/pages/brokers/)  \n\n---\n\n**Miscellaneous: Volatility, Options Option Chains & Data, Economic Calendars, Futures Options**   \n•&nbsp;[Graph of the VIX: S&P 500 volatility index (StockCharts)](https://stockcharts.com/h-sc/ui?s=vix)  \n•&nbsp;[Graph of VX Futures Term Structure (Trading Volatility)](http://www.tradingvolatility.net/p/datasourceurldocs.html)  \n•&nbsp;[A selected list of option chain & option data websites](https://www.reddit.com/r/options/wiki/faq/pages/data_sources)  \n•&nbsp;[Options on Futures (CME Group)](https://www.cmegroup.com/education/files/options-on-futures-brochure.pdf)  \n•&nbsp;[Selected calendars of economic reports and events](https://www.reddit.com/r/options/wiki/faq/pages/calendars)  \n\n---\n\nPrevious weeks' Option Questions Safe Haven threads.\n  \n[Complete archive: 2018, 2019, 2020, 2021, 2022, 2023](https://www.reddit.com/r/options/wiki/faq/archive/safe_haven_2023)\n---\n\n---", "id": "18b6rfl", "created_utc": 1701761667.0, "score": 12, "upvote_ratio": 1.0, "num_comments": 65, "comments": [{"body": "Am I seeing this right that KO options have poor liquidity? I was gonna buy some weekly $KO $62 calls but it looks like a ghost town", "score": 1, "replies": [{"body": "Not a ghost town near the money.   \nYou fail to specify strkes.  \n\nOptions chain.   \n\nhttps://www.nasdaq.com/market-activity/stocks/ko/option-chain", "score": 0, "replies": []}, {"body": "I think mostly investors put up this stock, more of a wealth wheel stock. It has a beta of .60, which is something that doesn't move a lot. Stock got as high as 64 to low 51. Now, it's back at 58 for the year. \n\nThe calls you wanted have less than .10 delta. You may want to use strikes that are two points away from atm strike price to get some volume. \n\nKO is a boring stock for a trader, but it is great for investors explained by the HV it has.", "score": 1, "replies": [{"body": "Exactly, not a lot of movement, so premiums aren’t great, plus a decent dividend adding risk to selling nearer term calls.", "score": 1, "replies": []}, {"body": "Got it. Thank you", "score": 1, "replies": []}]}, {"body": "The 15DEC KO chain shows the 65 long calls having a 0 bid and .15 ask, so very little trades occurring.  OI is 343 so not a ghost town, but a very small population . . .\n\nThe delta is .08 so the probabilities are low this will be ITM at expiration.\n\nYou could put in an order at the mid .08 price, or keep fishing up to the ask of .15 and may get a fill, but as you are seeing this has poor liquidity.", "score": 1, "replies": [{"body": "Yeah. I’ve given up on KO for now. Thx", "score": 1, "replies": []}]}]}, {"body": "I've only traded bought single options and I wonder what it is like to sell options. I know that you collect a premium as long as the price is below/above the strike price, but what does it look like to have an active position? In terms of percentage, how does the contract fluctuate?", "score": 1, "replies": [{"body": "It’s not significantly different from long options except you want to buy to close at a lower price instead of selling to close at a higher price.  Imagine your Greeks of a long position but flip the greeks around.", "score": 1, "replies": []}, {"body": "The premium is in the unchanging past once the short position has been entered.  \n\n\nThe trader is concerned about the cost of closing the position.", "score": 1, "replies": []}, {"body": "Long options are \"bought to open low and sold to close high\" to profit.  Ex. buying an option paying a $1.00 premium debit and then selling to close for a $1.50 credit is a .50 or $50 profit.\n\nShort options are \"sold to open high and bought to close low\" to profit.  Ex. selling an options to collect a $1.00 premium credit and then buying to close for a .50 debit leaves the remaining .50 or $50 as profit.", "score": 1, "replies": []}, {"body": "Looks the same as a long position, only the quantity is negative. So if I sell to open a put on TSLA for this month, it looks like:\n\n-1 TSLA 250p 12/15 at $4.20\n\nMy broker lets me add a column that shows what the initial margin requirement is/was, as a reduction in buying power. So that's a little more complicated than for a long put. If you buy a long put for $4.20, you see a debit for $420 and that's it. If you short a put, you *receive* $420 in cash, but you also see a perhaps $7000 reduction of buying power for collateral. So cash balance goes up but buying power goes down.", "score": 1, "replies": []}]}, {"body": "Im new to options trading and I’m just wondering should I make my call options expiration date like a week out, a month out, a year out? Also how do you determine which experarion date to choose?", "score": 1, "replies": [{"body": "Buying or selling call options?\n\nMany who buy may want to open farther out, ex. 90 dte or longer, to give the analysis time to play out.  They may also open ITM at a higher delta, ex. .80 to .90, as this reduces the negative impact of theta decay.\n\nMany of those who sell options will open 30-45 dte as these trades benefit from theta decay which ramps up around this time frame.  This also allows opening at lower deltas/farther OTM, ex. .20 to .30, for less risk but still bring in a decent amount of premiums.", "score": 1, "replies": []}, {"body": "Time and money are related in options. The further out you go, the more expensive the contract will be. So it's really a cost optimization problem. To answer how far out you should go, you first has to decide how much you want to spend, or receive if you are selling to open.\n\nAs a general rule of thumb, stay under 60 days to expiration, for either short or long trades.\n\nAlso, monthly expirations tend to have better liquidity than other expirations. There is one monthly expiration each month, on the third Friday.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "This is normal. P/L fields in ToS are in actual dollar amounts, not per-share (i.e., divided by 100) amounts.", "score": 1, "replies": []}, {"body": "Ignore the column. The valuation is not so useful.   \n\nAttend to the bids for long positions.", "score": 1, "replies": []}]}, {"body": "Hi r/options! I need help with some Call Options I bought:\r  \n\r  \nBought Call Options $2.50 a year out (ending in the next few months) in a company I liked.\r  \n\r  \nAfter I bought, the company did a stock reverse split. So that, the stock is trading at 15x the price of what it was.\r  \n\r  \n\r  \n\r  \nThe Options Still say $2.50 x 100 shares.\r  \n\r  \n\r  \n\r  \nI thought I should be able to buy the stock at $2.50/share x 100 x #ofoptions. Isn't it: \"on or before the expiration date?\"\r  \nSo I should be able to buy the stock at the $2.50 price and sell it at what it's selling at today, right?", "score": 1, "replies": [{"body": "> The Options Still say $2.50 x 100 shares.\n\nThat is surely wrong. What is the exact spec of the position? Ticker, strike, expiration, opening debit. Without the ticker, it's impossible to look up the adjustment details.\n\nA reverse split usually changes the deliverable, so that instead of 100 shares it ought to be 100/15 = 6 and 2/3rds shares. The fractional share might be part of the problem.", "score": 2, "replies": []}, {"body": "State the ticker for a useful response.", "score": 1, "replies": []}]}, {"body": "LEAP options. What is the reasoning behind buying a deep in the money 70-80 delta option versus something atm instead?", "score": 1, "replies": [{"body": "Less extrinsic value to decay away, and greater leverage than owning shares.", "score": 2, "replies": []}, {"body": "In addition to what u/wittgensteins-boat correctly states, a .70 to .80 delta option will have a much higher probability of being, or staying, ITM at expiration.\n\nIn this example the ProbITM would be around 70% to 80%, so this makes the probabilities much higher than a .30 or .40 delta OTM option that would only have a 30% to 40% probability of being ITM at expiration.\n\nOne last thing is that the higher the delta the closer the option will move with the stock.  A long .90 delta call option will gain $0.90 for each $1 move of the stock.", "score": 1, "replies": []}, {"body": "It's spelled LEAPS, it's an acronym and the S stands for Securities, and don't write \"option\" when you mean \"call\". Option means both puts and calls collectively. LEAPS do in fact have puts and calls, but the 80 delta strat is strictly about calls.\n\nThe 80 delta strat is a stock replacement strat that provides leverage without needing to take out a margin loan. An 80 delta call gets close to the same price movement as the underlying stock, $.80 on the dollar most of the time. However, since you are only entitled to gains above the strike, the up-front cost of the call is a lot less than shares. For example, the 80 delta Jan 2025 LEAPS SPY call is bidding for $76.91 as of this writing. That's the 405 strike, so 100 shares would cost $40,500 but the call only costs $7691, for more than 5x leverage.\n\nTrue, the ATM call would cost even less and provide more leverage, but it also gets around $.50 to the dollar of price movement and has a lower probability of expiring above the strike. Remember, you are only entitled to gains on the share that end up above the strike at expiration.", "score": 1, "replies": [{"body": ">the 80 delta strat is strictly about calls\n\n \"Am I a joke to you?\" - Poor Man's Covered Put", "score": 1, "replies": []}]}]}, {"body": "Complete beginner here, please pardon my naivete.\n\nI use Robinhood. I'm sure it's not the best, but it's what I've got right now. I do not have access to \"Level 3\" options trading.\n\nI want to explore the \"put credit spread\" strategy as a learning opportunity. I grasp the general idea of how the strategy works, I think, but my question is more about the mechanics of placing the trade.\n\nOn the Robinhood app, I see a button labeled \"Put Credit Spread\" under the \"Vertical Spreads\" option. But, since I am not \"L:vel 3\" I can't use it.\n\nMy question is... if I use the \"Cash-Secured Put\" button to sell a contract, and the \"Long Put\" option to buy the downside protection with the same expiration... is that the same thing as using the \"Put Credit Spread\" button?\n\n(I hope I used all those terms correctly).\n\nAnyway, would I have accomplished the same thing or is this somehow different in a way that would affect the math of the trade?", "score": 1, "replies": [{"body": "You would have accomplished the same thing, but without approval to trade spreads (which sounds like it's included in what RH calls Level 3,) the short put would need to be cash-secured.  That is, if the short put strike is 50, you would need at least $5000 in buying power (what RH calls \"collateral\") regardless of whether you're also buying a long put.", "score": 1, "replies": []}, {"body": "A suggestion would be to get a paper trading account so you can explore and practice.  \n\nTDA/Schwab has the ThinkorSwim platform that offers an excellent simulation to learn how options work, practice while developing your trading plans/strategies, and learn a full featured options platform - [https://tickertape.tdameritrade.com/tools/papermoney-stock-market-simulator-16834](https://tickertape.tdameritrade.com/tools/papermoney-stock-market-simulator-16834)", "score": 1, "replies": [{"body": "Really fantastic suggestion- thank you!", "score": 2, "replies": []}]}, {"body": "RH might also disallow the second trade. Any half decent order software would figure out that the resulting two positions amount to a credit spread. Though I admit if any broker was proven to be substandard in this regard, RH would be at the top of my likely suspects list.", "score": 1, "replies": [{"body": "Interesting. In my oversimplified mind, the spreads seem like even lower risks than other trades that new traders should be encouraged to adopt, not prevented from executing. I could be missing something.", "score": 1, "replies": [{"body": "They're not going to disallow it if you have enough cash to make the put cash secured.  There's no rule that you can't have an open cash secured put, and an open long put , on the same underlying on the same expiration date at the same time. But it's a FINRA requirement that you have a margin account to trade spreads.  This is because of the risk of early assignment. If you get assigned early, and you don't have enough cash to make the put cash secured, you will end up buying shares on margin.", "score": 1, "replies": []}]}, {"body": "I use this method on E-trade so simulate vertical spreads, both put and call.  I have been running bull call spreads on Conagra and ATT for a few months.  The e-Trade app allows me to open bull and put spreads as long as I either own the shares (for a call spread), or have the cash on hand (for a put spread).\n\nIf my put spread is profitable by >50% (ie debit $50 for the spread and the spread is now worth a net credit of $75.  $25 / $50 = 50%), I close / roll the spread like you would any other put spread and the app allows me to roll to a new position same day.  The app automatically secures the short put with cash in my account, and that cash is removed from my cash available to trade for the duration of the position.\n\nFor call spreads, if they are profitable by >100%, I close / roll the spread.  I have noticed occasionally that I am not allowed to roll over to a new position same day, I have to wait for the next day for the short option buy-to-close to settle.  Other days, I am allowed to roll a call spread same day.  I am thinking it is because for a few of my trades I started with just a 30 dte covered call, and very soon into the position, the stock dropped in price several % in a short time.  In that situation, I bought a long call on the same expiration, creating a bull spread.  When that spread got profitable by >100%, the app would not let me roll it over as a spread.  I had to close each leg separately and wait for the short leg to settle before I could open a new bull spread.", "score": 1, "replies": [{"body": "Okay, good to know.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "No.  Options trade when the market is open and not before.  There is no way to have an order fill until the market is open and prices have updated.\n\nThis stock had an ER after the market hours last night, so this adds risk to any trade.  Many avoid having trades open over an ER as the price movement can be unpredictable.  Unless you were trying to take advantage of the ER movement.", "score": 1, "replies": []}, {"body": "Greeks do not force anything. Ever.  They are an interpretation of market prices.\n\nYou cannot beat a platform.  Possibly your data is delayed 15 minutes, and possibly you need to request real time data from the broker.    \n\nDid you issue a market order?  If so, almost never trade options with a market order.\n\n\nAlso so, all platforms are at least several seconds behind the market.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "So, you entered a limit order to sell at 1.45, which was presumably fair market price at the time, it filled, and you're complaining that you somehow \"should have\" been able to sell it for more?\n\nI suspect you still haven't really fully grasped how options pricing works.  An option has its own price, the premium, that goes up and down in response to market forces on it, partially independent of the underlying.  If that put was trading around 1.45 at the time, that's what it was worth.\n\nYour complaint is kind of like saying \"stock XYZ had an upcoming earnings report, so I bought 100 shares at $50 per share.  At the earnings report, it absolutely crushed estimates, so I sold, but it was only for $52.  Given how much it beat earnings by, shouldn't I have been able to sell it at like $60?  Did E\\*Trade somehow screw me over?\"  No.  You chose to sell when the stock was at 52.  You might personally think that considering how good the earnings report was, it should have gone higher--but it didn't.  At the time you sold, the stock was trading at $52 per share, because that's what the market thought it was worth.  That's what people who wanted to buy it were willing to pay, and that's what people who were selling it were willing to take.\n\nWell, it was the same with your put option.  At the time you sold it, the market thought it was worth 1.45.  It doesn't matter that you thought it should have been worth more--it wasn't.  This wasn't caused by delayed quotes or anything.  The put was worth 1.45 because what people who wanted to buy it were willing to pay, and that's what people who were selling it were willing to take.  You were one of those people, because you chose to sell it at 1.45.", "score": 2, "replies": []}]}]}]}, {"body": "Please help me to understand.\n\nI just bought AMD puts when AMD was ~$9\n\nAMD fell to $7.70 - great right? No - I lost money and I totally can’t understand why.\n\nAMD - @320 - Buy 5 Jan-26-24 115 Puts @ Market to Open\n\nI sell minutes later because AMD fell over $1 and I lost $320ish\n\nWhy did I lose when I bought puts and the price moved down, as I thought it would?", "score": 1, "replies": [{"body": "This is the most frequent new trader question asked.  \n\nIn the side bar, at at the very top of this weekly list, and on the wiki  is the link.  \n\n**Why did my options lose value when the stock price moved favorably?   \n-- Options extrinsic and intrinsic value, an introduction**    \nhttps://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value. \n\nAlso, almost never buy or sell options via market order.  Limit orders only. \n Generally the bid ask spread can be quite wide, and varies rapidly, by the minute.", "score": 1, "replies": []}]}, {"body": "Hey all. I purchased a corvus call option on 12/6 expiring 12/15 strike price of $1. i paid $0.8 My call option exploded the first day, up to a value of $1.45 somehow. it hovered around there for a while. then, today, 12/8 corvus was up 13.69% to $1.91 per share!!! i was ecstatic. i check my call option however… and its worthless? its valued at $0.01. i dont understand. is my extrinsic value really that low?", "score": 1, "replies": [{"body": "The lessons here are: 1) don't trade options on penny stocks, and 2) the bid-ask spread matters much more on options than it does on stocks, especially low-volume options.\n\nThe last time the 12/15 1 strike call traded was the day you bought it, 12/6.  Only 2 contracts traded that day, both at a premium of 0.80.  It hasn't traded since then.  Any fluctuations in price you saw were solely due to changes in the bid/ask.\n\nIt's not valued at 0.01.  As of market close today, the bid was 0, meaning you couldn't sell it if you wanted to, and the ask was 2.00.  Assuming the stock is at 1.92 (a big assumption, since the stock itself has a wide bid-ask) it should be worth at least 0.92.  You could try leaving a GTC limit order open to sell it for 0.92, but it's anyone's guess as to whether it will ever fill.  There *should* be a bid on it since it's ITM, so maybe the fact that there isn't is just an artifact of the market being closed, and you can try again Monday morning.\n\nBut in general, this is the kind of problem you have when you trade illiquid options on penny stocks.", "score": 3, "replies": [{"body": "thank you very much. i was so successful on my amd and tesla calls i thought hey why not yolo a call on this little bio tech stock. i know PDUFA or FDA stuff is happening with it so i tried something lol. and it failed miserably. but hey, lesson learned. thanks!", "score": 1, "replies": [{"body": "**ALWAYS check, before buying,   \nand to verify a platform's supposed \"value\".**    \n\n- The BID and the ASK.   \n- The VOLUME. \n- The OPEN INTEREST (this number is as of the close, the prior day)  \n\nYour immediate exit from a long option is near the bid.    \n\nWide bid-ask spreads lead to deranged platform valuations, which are typically calculated as  the average of the bid and the ask. The market is not located at the mid-bid-ask.", "score": 1, "replies": [{"body": "thank you!", "score": 1, "replies": []}]}]}]}, {"body": "i wish i could post pictures. the graph for my call option price is very.. blocky. it goes way up in a straight line, plateaus, then steep fall straight down. meanwhile all the stock price has done is go way up. this is on robinhood btw", "score": 1, "replies": [{"body": "You can by hosting the image at  Imgur.com and linking to it.  \n\nOr making a post at r/test, as an image post, and obtaining URL addresses of the images you upload, and copying the links  to your comment here.", "score": 1, "replies": []}]}]}, {"body": "Do you use Standard Deviation in your trading and if so, how does it help you? I've heard people talk about pricing their strikes at one standard deviation for example and am unsure how that is even calculated.", "score": 1, "replies": [{"body": "Implied volatility is a standard deviation measure of, according to a model, interpreting the extrinsic value of an option. Converted to an annualized amount.\n\n\nTo convert to a shorter term, see here:    \n\nConverting an annualized IV to a daily expected move.  \nMacroOption.   \nhttps://www.macroption.com/converting-implied-volatility-to-daily-move/#:~:text=Assuming%20252%20trading%20days%20per,of%20252%2C%20or%20approximately%2015.87.", "score": 2, "replies": []}, {"body": "IV is the better measure as u/wittgensteins-boat indicates.  Higher IV typically indicates higher options premium due to the bigger implied move, and low IV indicates lower options pricing.\n\nSome use higher IV to indicate when to sell options and there is a theory that IV is overstated so there can be an edge when the option premium is higher and the actual move lower.  Low IV and lower premiums are an indication of buying as the cost is lower.\n\nIV is mean reverting in that a low IV is expected to move up to the mean that helps long options profit, and high IV is expected to drop that helps short options profit.  \n\nTo determine the strike look at delta to see the probabilities - [https://tickertape.tdameritrade.com/trading/options-delta-probability-in-the-money-14981](https://tickertape.tdameritrade.com/trading/options-delta-probability-in-the-money-14981)", "score": 1, "replies": []}, {"body": "TL;DR - One standard deviation represents about 68% of outcomes. If we assume 50 delta is the mean of the distribution, 68% works out to 34 delta on either side of that 50 delta mean, so that's 16 delta for OTM or 84 delta for ITM.\n\nFull explainer here: [Options Math 101](https://optionalpha.com/lessons/understanding-the-math)", "score": 1, "replies": [{"body": "Is this important to understand to be a successful options trader?", "score": 1, "replies": [{"body": "IMO, yes. Let me put it this way. You *can* be a successful options trader without knowing this, but you won't understand *why* you are successful.", "score": 1, "replies": []}]}]}]}, {"body": "Are there any popular profit taking strategies when buying options? When selling options I'll close anything above a 30% profit. Idk what they do at WSB it seems like 2000% or nothing but 50% target profit has worked fairly well for me when paper trading unless the underlying is really moving in my favor. Anyways, any thoughts would be appreciated.", "score": 1, "replies": [{"body": "Remember WallStreetBets has above 10 million members.\n \n\nYou could have one 20x gain a day reported, and that is less than one hundredth of the population over a year.  \n\nSmaller threshold exits of 10 to 30 percent are reasonable, and repeatable.", "score": 1, "replies": []}, {"body": "It depends on holding time and other risk management and exit strategy factors, but as an example, when I run 30 day ATM calls on XSP during a bull market, I exit at 10% profit or 20% loss. This means I only need a 67%+ win rate to be profitable, and that's usually achievable during a bull market.\n\nThe important takeaway is that **you should always consider your profit exit in the context of your loss limit and expected win rate**. Profit levels in isolation mean you are not fully considering risk/reward. The higher your profit exit level the higher the win rate you need, since higher profit means higher risk, in both size of loss and frequency of loss.", "score": 1, "replies": []}]}, {"body": "I bought SPY at $380. Then I unfortunately sold CC at $400.\n\nAs expected, a huge loss, but I could roll the option to the next year and get a huge tax loss write off as rolling the option is not consider as a wash sale.\n\nWhat is the catch here?", "score": 1, "replies": [{"body": "Doesn't sound like a loss to me.  You make $2000 on the shares, plus the premium of the call.\n\nYou don't say what credit you received for the call, nor what strike/expiration you're considering rolling to nor what credit you'd receive.  But you'd just be deferring the sale of the shares.  Maybe, depending on whatever else you've got going on this year tax-wise, it would be advantageous to have the loss of closing the call.  But you'd still be taking the gain next year when you're eventually assigned.", "score": 2, "replies": []}, {"body": "You made a very nice profit and there is no “loss”.\n\nWhen you open a CC you are agreeing the sell the shares at the strike price and if you won’t be happy selling the shares at that price then don’t sell CCs to begin with . . .\n\nRolling for a net credit can collect more premium, and possibly move the strike price up, both of which can increase the possible profit.  You didn’t provide the trade superficial, but the chances of rolling for a net credit this deep ITM is very low to impossible, so this is unlikely to be a possibility.  Rolling for a net debit would decrease what profit you already have in the position and would not make sense.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You’re making an assumption that the stock will move up, stay about the sale $135 price, or not drop to $127 or below.  If this happens the trade can win.  If the stock drops below $127 and stays down through expiration then it will be challenged and either need to be adjusted or closed for a loss.\n\nYou didn’t mention the delta, but in looking it up today (weekend and not updated data) it is .18 or 18% estimated probability the price will be $127 or below at expiration.  The converse is an 82% probability it will be above $127 and be profitable.\n\nUsing the delta there is an 82% probability of the trade profiting and at a $1 wide spread the max loss is $100 - credit received of $9 or $91 max loss.  \n\nThe question to ask yourself is - Are you willing to risk $91 over 33 days to have an 82% probability to make a possible $9 profit?\n\nIf not, then go back to the option chain to find a trade that offers the premium and probability you find acceptable based on the assumption of what the stock will do over the length of the trade.  Hope this helps!\n\nEdited to correct max loss amount.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sorry, didn’t finish the sentence which should have said a $91 max loss.  I edited the comment.  \n\nThe $91 risk for $9 is a function of the low delta and high probability.  By increasing the delta it will reduce the probability but increase the possible profit.  It is up to you to find a trade where the assumption is strong enough to support the risk and possible reward.", "score": 1, "replies": []}]}]}]}, {"body": "options volume is insanely higher than normal but open interest is literally zero. Jump in feet first or run for the hills?", "score": 1, "replies": [{"body": "Ticker?\n\nOpen interest is as of the close the day before, updated only once a day.", "score": 3, "replies": [{"body": "It was MBI, it's a moot point now, I just can't recall seeing nearly 10k volume and zero OI", "score": 1, "replies": [{"body": "It happens when the prior day there was no open interest, and a big fund takes a position, or goes in and out of a position.", "score": 2, "replies": []}]}]}]}]}
{"title": "Moody’s cut China’s credit outlook to negative on rising debt risks", "selftext": "(CNBC)-Ratings agency Moody’s downgraded its outlook on China’s government credit ratings to negative from stable, expecting Beijing’s support and possible bailouts for distressed local governments and state-owned enterprises to diminish China’s fiscal, economic and institutional strength.\n\nMoody’s though retained China’s “A1” long-term rating on the country’s sovereign bonds, while expecting China annual GDP growth to slow to 4% in 2024 and 2025 and average 3.8% from 2026 to 2030.\n\nStructural factors including weak demographics will drive a decline to 3.5% by 2030, it said.\n\nThe move underscores concerns over rising debt levels and the impact on broader growth in the world’s second-largest economy as Beijing resorts to fiscal stimulus to support local governments and contain the spiraling debt crisis among the country’s property developers.\n\n“The outlook change also reflects the increased risks related to structurally and persistently lower\nmedium-term economic growth and the ongoing downsizing of the property sector,” Moody’s said in a statement issued Dec. 5.\n\n“These trends underscore the increasing risks related to policy effectiveness, including the challenge to design and implement policies that support economic rebalancing while preventing moral hazard and containing the impact on the sovereign’s balance sheet,” Moody’s added.\n\nChina credit default swaps (the cost of insuring against a government default) rose 4 basis points from Monday’s closing level, according to Reuters data.\n\nBeijing disappointment\nChina’s Finance Ministry expressed its disappointment with Moody’s downgrade decision.\n\n“Moody’s concerns about China’s economic growth prospects and fiscal sustainability are unnecessary,” the ministry said in a statement Tuesday.\n\n“Since the beginning of this year, in the face of the complex and severe international situation, and against the background of unstable global economic recovery and weakening momentum, China’s macro economy has continued to recover and high-quality development has steadily advanced,” the ministry added.\n\nThe central government said Oct. 24 that it had formalized a process allowing local governments to borrow funds for the year ahead — starting in the preceding fourth quarter, according to an announcement published by state media.\n\nBeijing also announced a rare mid-year fiscal revision, which included the issuance of 1 trillion yuan in ($137 billion) in government debt — one of the biggest changes to the national budget in years. The amount was for the reconstruction of areas hit hard by natural disasters — such as this summer’s historic floods — and for catastrophe prevention.\n\nMoody’s also cited the 1.6 trillion yuan increase in central government transfers to regional and local governments in 2022 from 2021, which partly but only temporarily offset the 2 trillion yuan in lost land sales revenue, as a key development that factored in its thinking.", "id": "18b9uiz", "created_utc": 1701775228.0, "score": 123, "upvote_ratio": 0.92, "num_comments": 27, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "[removed]", "score": 64, "replies": [{"body": "Pretty clearly a racist statement. Great job r/stocks", "score": -57, "replies": [{"body": "Is hamburgered in also racist?", "score": 44, "replies": []}, {"body": "^ the kind of person that ruins reddit for everyone then complains that Reddit has changed", "score": 31, "replies": []}, {"body": "The \"P\" is silent.  \nAnd also invisible.", "score": 5, "replies": [{"body": "What about the PP?", "score": 1, "replies": []}]}, {"body": "No point trying to reason here give it a rest everything requires you to hate China no matter what you are not allowed to go deeper into what is happening in China", "score": 1, "replies": []}]}]}, {"body": "baba is going on “sale”.", "score": 15, "replies": [{"body": "I think these rating companies are rating with a purpose and they are just creating another trap.", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 4, "replies": [{"body": "Pretty much. Time will tell", "score": 1, "replies": []}]}, {"body": "A should have bought some yang", "score": 2, "replies": []}, {"body": "Fuck all the ratings agencies. [They are crooked bastards] (https://www.youtube.com/watch?v=9xZx1lf2tvs). Why is anyone listening to them at all?", "score": 3, "replies": [{"body": "To help ppl not get their feelings hurt", "score": 1, "replies": []}]}, {"body": "For some reason the organization of the sentences is off to me, maybe it's just I am dumb.   \nThe \"Moody’s downgraded its outlook on China’s government credit ratings to negative from stable\" is fine as a sentence though I would argue that \"Moody’s downgraded its outlook on China’s government credit ratings from stable to negative\" emphasizes impact more while the former seems to be confusing.   \n\n\nI'm probably splitting hairs , I just imagine it's really bad so the language is kinda soft balled.", "score": 2, "replies": [{"body": "The article writer has a little Yoda in him.", "score": 2, "replies": []}]}, {"body": "We downgrade our outlook because it's going to cost them more to borrow after we do so.", "score": 1, "replies": []}, {"body": "Does that include a dictatorship discount as well? What about war with Taiwan discount?", "score": -3, "replies": []}, {"body": "Boo boo china has trouble don’t care ohh well", "score": 0, "replies": []}, {"body": "Surprised this has happen this early.  It seems pretty clear that China has a ton of problems ahead but it seemed like they had a little more time.", "score": 0, "replies": []}, {"body": "Remember they paid the fine of 800million of moody", "score": -4, "replies": [{"body": "what?", "score": 5, "replies": [{"body": "Moody paid a fine of 850 million in 08-10 and also downgraded US this year and check out S&P 500", "score": 0, "replies": []}]}]}, {"body": "China is spending all their money on US influencers. A lot of the big ones are funded by them. Imagine they actually tried to make a functioning economy instead LOL", "score": -6, "replies": []}, {"body": "And that with estimates and fake data…", "score": 1, "replies": []}]}
{"title": "China EV sales in week 48: BYD 56,200, Tesla 17,600, Nio 3,700", "selftext": "", "id": "18b79vq", "created_utc": 1701763858.0, "score": 24, "upvote_ratio": 0.87, "num_comments": 27, "comments": [{"body": "BYD numbers include any version of electrification…half of those sales are hybrid.  It’s in the article…but who reads that many words?", "score": 16, "replies": [{"body": "“ BYD grew 16%, Tesla 5%, “ that is what really matters", "score": 0, "replies": [{"body": "Any picture of just a week doesn’t matter.  Next week BYD will probably drop by a big amount WoW.  Are you going to say the same thing next week?  BYD fell the week before by ~10%.", "score": 6, "replies": [{"body": "Let’s just see if your “probably” would be right. I find it unlikely. The trend is clear in the past weeks", "score": 0, "replies": [{"body": "Did you even look at the week to week graph?  It was down the week before…and again does it even matter at the week to week timeline?  Also BYD as also mentioned sells hybrids so not knowing the BEV sales can muddy the water in comparing.", "score": 2, "replies": [{"body": "The trend I mean yoy trend as Tesla’s week over week trend is largely skewed by exportation priority", "score": 0, "replies": [{"body": "Right…but this article is about weekly numbers…", "score": 0, "replies": []}]}]}]}]}]}, {"body": "lol carbon copy of this conversation happens every single time these numbers are posted", "score": 1, "replies": [{"body": "Yes indeed.", "score": 1, "replies": []}]}, {"body": "If that’s the case then it is grossly misleading. Why don’t they break it down to just BYD EVs?", "score": 1, "replies": [{"body": "They break it down in the article for previous weeks but don’t have data for current.  And yes that is my point about the headline.", "score": 2, "replies": []}]}]}, {"body": "The competition in china seems absolutely brutal", "score": 3, "replies": [{"body": "Model Y seems to hold quite well in China. New Model 3 not so much.", "score": 5, "replies": [{"body": "Why do you say that? Production seems to be chugging along with a decent ramp back up from zero at end of last quarter. They were still exporting and it seems they are doing just fine.", "score": 5, "replies": [{"body": "Cos new 3 weekly sales are decreasing, Y increasing", "score": 3, "replies": [{"body": "We don't know how many were exported yet, do we? What is the backlog in Europe?", "score": 5, "replies": [{"body": "The export number actually went down month over month, as they prioritize local sale , which is still down for model 3", "score": 1, "replies": [{"body": "Oct had some built up from Sept…", "score": 1, "replies": []}]}]}, {"body": "There has to be a substantial difference in price between the 3 and Y. If not, most consumers will go for Y.", "score": 1, "replies": []}]}]}]}]}, {"body": "I know that BYD is only 1/2 BEV and about 1/2 hybrid, but still they are cleaning Tesla's clock.This article mentions that Tesla November sales were down 18% year-over-year. That's not a good look for a company that is supposed to be growing 40% per year.\n\nhttps://www.reuters.com/business/autos-transportation/teslas-china-made-ev-sales-fall-178-nov-biggest-drop-since-dec-2022-2023-12-04/", "score": 2, "replies": [{"body": "November 2022 was an outlier. Tesla is on track for a record quarter with the highest amount of registrations this far into a quarter yet in China. They have also been raising prices", "score": 3, "replies": [{"body": "They raised prices but offer an insurance subsidy that's worth more than the price raise.", "score": 2, "replies": []}]}]}, {"body": "XPeng 4,800, Yay!", "score": 1, "replies": []}, {"body": "BYD did it with how many factories?", "score": 1, "replies": []}, {"body": "Why do the headlines always skip Wuling?", "score": 1, "replies": []}, {"body": "Source? I don't recall him ever saying that. He said specifically he was not going to sell anymore stock in 2023, which so far he's stuck by. He didn't say anything about 2024, you are making a leap here.", "score": 1, "replies": []}]}
{"title": "Puts on Tesla?", "selftext": "[removed]", "id": "18b8n07", "created_utc": 1701770097.0, "score": 3, "upvote_ratio": 0.6, "num_comments": 19, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 month ago\n**Total Comments**|8|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": ">That's really sad. Poor people are so stupid and deserve everything they get.", "score": 5, "replies": [{"body": "Mr Bot, I'm fairly sure Elon Musk isn't poor", "score": -2, "replies": []}]}, {"body": "So this article basically says you’re 10x safer in a Tesla that is driving itself.", "score": 2, "replies": [{"body": "Not exactly. The article presents some of Tesla's official data as a way to contextualize the whistleblower's claims. It's a normal reporting device.  \n\n\n>Mr Krupski said he had found evidence in company data which suggested that requirements relating to the safe operation of vehicles that had a certain level of autonomous or assistive-driving technology had not been followed.  \n>  \n>He added that even Tesla employees had spoken to him about vehicles randomly braking in response to non-existent obstacles - known as \"phantom braking\". This also came up in the data he obtained around customer complaints.  \n>  \n>**According to Tesla's own data,** at the end of 2022 US customers using Autopilot averaged one crash where the airbag deployed roughly every 5 million miles travelled.  \n>  \n>It claims that Tesla drivers not using it averaged once every 1.5 million miles or so.  \n>  \n>The US driver overall average was once every 600,000 miles. The BBC cannot independently verify Tesla's figures.", "score": 2, "replies": [{"body": "You won’t be able to verify if it was on autopilot, only Tesla has that information. But you could easily verify the 1.5 million miles per crash in a Tesla vs a regular automobiles 600k, that data is public.", "score": 1, "replies": [{"body": "But it doesn’t tell you much about the safety of the car itself. Crash-proneness is very much also a function of driver behavior; and you’ll find a very different type of driver in a Tesla than in a Dodge Charger.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Tbh, I have no instincts and even if I did, they'd most likely be highly regarded.\n\nThat said, as far as giant companies go, Tesla is the one of those whose stock seems the most sensitive to bad news (or tweets).", "score": 5, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": ">being self aware means you're a person who should not be gambling money away\n\nthings you see on WSB lmao", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Thx man, we're all degenerates in here, no point in regard-shaming each other xD", "score": 2, "replies": []}]}]}]}]}, {"body": "I’m not saying buy puts based on this article. \n\nBut calls? On what basis? 🤦‍♂️", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Ligthen up, Francis", "score": 4, "replies": []}, {"body": "It’s all DFV’s fault. He brought 10 million dumbasses to this place in 2 weeks", "score": 3, "replies": []}, {"body": "I think we all can see who's greedy here Mr. Chichiplug.\n\nStocks don't always go up and Tesla is ultra highly valued but also has challenges (increased competition, new Chinese competition, lackluster new products, delays, production difficulties etc.) and a CEO that's increasingly an unhinged liability.\n\nAlso, the Cybertruck didn't really live up to expectations.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You don't know whether it's going up or down, so you don't know whether you saved someone money.\n\nI'm sure you're just the most helpful bloke, caring about others. That has become clear to me after reading your comment, I quote:\n\n\" How in the flying f has reddit become so dumb. Used to be smart people using this platform. Now it's just mind bogglingly stupid. Yall are greedy r tarz who don't deserve a pot to piss in \"\n\nMost helpful and kind indeed! Thank you good sir for contributing to the X-Mas spirit!", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Thanks, man, you're the real hero.\n\nI don't intend on playing options with Tesla either way rn, but I do like to see fellow regards' thoughts on the stock.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "right back at ya! lol", "score": 2, "replies": []}]}]}]}, {"body": "Go for it. I want something to laugh about.", "score": 1, "replies": []}]}
