{"title": "AMD June 2025 call or Intel January 2026 call?", "selftext": "Obviously no one knows, but what would you guys bet your money on if you had to choose one of these two bets, and why? Just looking for opinions\n\nAmd: Strike Around 240, expiring June 2025\nIntel: Strike Around 55, expiring January 2026\n\nI feel with Intel they have a lot of potential because they are starting to compete a little bit better with their new meteorlake chips, and by getting into the AI space. Intel is also a lot more cheaper and I can get a decent price for a further contract. This would give me some more time to hope for them to come up with something good. AMD is a lot more expensive for a contract expiring sooner. This doesn't give me much time and I don't know if they really are cooking up anything different from what they're already doing. AMD is a lot more reliable though.", "id": "18qtwqm", "created_utc": 1703546877.0, "score": 4, "upvote_ratio": 0.57, "num_comments": 28, "comments": [{"body": "So you're comparing a bet where you're hoping AMD doubles in 18 months vs INTC increasing by 15% in 24 months? Obviously the second one is safer.", "score": 29, "replies": [{"body": "Yeah, that's a good point. The only thing is, intel in the money doesn't really make that much vs amd in the money would make a ton. I guess hoping for it to double is a bit much though.", "score": 0, "replies": [{"body": "A lot of this is based on the assumption that what happened last year will continue as the stock prices gets more and more overextended.\n\nAMD and Intel skyrocketed in 2023, but you also have to consider that they dumped more than 50% in 2022. Expecting to the 2 companies to continue going up at this rate and double again for 2024 is pure greed and hopium. At this rate, they are priced beyond perfection.\n\nThere are better valued plays for AI and tech going forward, it’s probably better to short AMD and Intel (especially AMD) as hedge for other tech calls.", "score": 6, "replies": []}]}]}, {"body": "Hahah man, you sound like a total options nooob. \n\nWho the fuck buys such out of money options? It’s no better than burning your money. Hilariously bad trade; AMD especially.\n\nIf you want to a reasonable trade : buy something in the money or at the money.. never out of the money. If you want to finance the calls , sell some puts on the same stock and use that premium to offset the long call. \n\nGood luck", "score": 6, "replies": [{"body": "He would’ve made 6 figures from a $100 price surge, your the options noob 😆", "score": 1, "replies": []}]}, {"body": "0odt options, same strikes", "score": 17, "replies": [{"body": "LOL", "score": 2, "replies": []}, {"body": "What is 0odt?", "score": 1, "replies": [{"body": "Out of the money 0 day til expiration options. Idk if I wrote that right, now to this so I might fuck up some shit.", "score": 4, "replies": []}]}, {"body": "Long Straddles or short straddles?", "score": 1, "replies": []}]}, {"body": "I am personally invested in both of these options, but own a lot more of the Intel Jan 2026 calls which I bought when the stock was in the $26-27 range.  I am very bullish on both and feel that AMD could outperform INTC in 2024, but also think we may get a 5-10% tech correction in January.  That being said, time is a critical component when it comes to a bullish call option position, so I personally may look to buy more Jan 2026 Intel calls over June 2025 AMD calls, especially given the high extrinsic (time) portion of the option premium on AMD calls compared to Intel", "score": 4, "replies": [{"body": "I might lean towards intel more. I'm waiting for intel to pull back to atleast 40-45 first though. AMD is great but I feel like the chances of them going a lot higher is slimmer now cause they have been on a decent bulk run for a while now. I guess the same can be said about intel but intel seems to have a couple more interesting changes coming up in the near future. Intel stock does tend to underperform compared to where it should be though, so I'm not overly confident on either plays", "score": 1, "replies": []}]}, {"body": "Intel has fabs. I don't get why people keep missing this point. Intel literally could be worth AMD + TSMC combined.", "score": 3, "replies": [{"body": "I think a lot of the hate comes from the fact that their stocks tends to underperform a lot. AMD kinda overtook intel years ago and intel doesn't seem to show any real effort on trying to perform against them. Maybe it's management issues but intel has kinda disappointed people the past couple years. I haven't heard much about this TSMC thing before this. How big do you think this TSMC news is, and do you think it's more of a longterm benefit for intel(like it will start improving the company after a couple years of progress)?", "score": 1, "replies": [{"body": "Look up Intel Foundry Services. Basically they are opening up their fabs to external companies (similar to what TSMC has done for years).", "score": 2, "replies": []}]}]}, {"body": "AMD, PE ratio is ~1200, forward PE around 40 and you are expecting it to double value in a year. I mean, it could happen, at this point AMD is completely divorced from reality, so there is nothing preventing a doubling of value. \n\nI personally would not bet on that, unless the price is low.", "score": 6, "replies": [{"body": "Yep, this is pure greed talking. It’s probably better to long GOOGL and MSFT, and short AMD as a hedge going forward, if he really wants to play tech.", "score": 1, "replies": []}]}, {"body": "Personally I have got for Intel options only a small position", "score": 3, "replies": []}, {"body": "Intel. Way better earnings potential and profitability", "score": 3, "replies": [{"body": "Intel does tend to disappoint though. Hopefully they do better in the future", "score": 1, "replies": [{"body": "Chips have a huge lead time, its hard to just turn the ship around and Intel got turned upside down in the last few years.", "score": 2, "replies": []}]}]}, {"body": "if you’re worried about being poor, you can use spreads. With spreads you’ll also be able to afford strikes that are closer to the money, giving you a lot more safety, should you be too early and overly ambitious. You don’t want to be part of that leaps open interest that are worth $0.01 every year. \n\nLong debit spreads. Also, there is call skew on LEAPS, so you would also be saving a little more money than usual. \n\n-source, am poor", "score": 1, "replies": [{"body": "I wouldn't necessarily say I'm worried about being poor. I'm gonna put like a strict 500-550 cap on this play and I'm ready(hoping not though) to lose it all, if it goes down that path. I tried spreads a long time ago and failed horribly, but I'll take another look at them again", "score": 1, "replies": [{"body": "sorry that’s old terminology, never left my keyboard. Spreads and ratios are extremely capital efficient compared to going long a single leg.", "score": 1, "replies": []}]}, {"body": "Spreads are how the poor become bankrupt . Insolvent .", "score": 1, "replies": []}]}, {"body": "These are pretty well tied to P/E, they also pay generous dividends which is going to restrict price move up.  Rather than buying a straight call.  Get creative, do some research, do spreads.  In outs, bull put spreads, OTM bull call diagonals or horizontals.  Investigate before you invest, do your homework -- time well spent, IMHO", "score": 1, "replies": []}, {"body": "If I was crazy enough to take this bet 😂, then I would wait for a pull back and then maybe get $150 or 160 strike on amd.", "score": 1, "replies": []}, {"body": "Just bought Jan 2025 call @35 strike", "score": 1, "replies": []}]}
