{"title": "Mary Barra ready to prove GM stock is as valuable as Tesla", "selftext": "", "id": "svjy9q", "created_utc": 1645196378.0, "score": 54, "upvote_ratio": 0.81, "num_comments": 100, "comments": [{"body": "![img](emote|t5_n9evv|3836)![img](emote|t5_n9evv|3981)![img](emote|t5_n9evv|3836)", "score": 135, "replies": [{"body": "Damn funny", "score": 15, "replies": [{"body": "Not funny anymore. She is destroying GM and American car workers jobs.", "score": 26, "replies": [{"body": "That’s why they’re guaranteed to get bailed out… again", "score": 17, "replies": [{"body": "we will be the ultimate bag holders. The real problems is the bailout will not work and they will fail with or without bailout.", "score": 5, "replies": [{"body": "Stop calling it bailout and start calling it subsidize", "score": 2, "replies": [{"body": "Ok", "score": 1, "replies": []}]}, {"body": "Us tax payers.. the ultimate bag holders", "score": 2, "replies": []}]}, {"body": "Probably not anymore given how woke our society has become. People will be so outraged.", "score": 1, "replies": [{"body": "The people are waking the politicians are paid for", "score": 0, "replies": [{"body": "Did you downvote me because I agree with you?", "score": 1, "replies": []}]}]}]}, {"body": "“Mary you Pb”", "score": 3, "replies": []}]}]}, {"body": "I liked the one /u/space_s3x had earlier:\n\n![gif](giphy|t9vDJ3sOCcGtwyv0ks|downsized)", "score": 9, "replies": []}, {"body": "> 3836:3981:3836\n\nCan you translate that for those of us on old reddit?", "score": 9, "replies": [{"body": "laughing elon emojis.", "score": 12, "replies": []}]}, {"body": "lol", "score": 15, "replies": []}, {"body": "![img](emote|t5_n9evv|3866)", "score": 2, "replies": []}, {"body": "this brings new meaning to the word emBARRAssing!", "score": 1, "replies": []}]}, {"body": "The bar exponentially gets higher and higher for her 🤔", "score": 28, "replies": []}, {"body": "GM is getting it's ass kicked in every metric there is to measure. Yes, they have announced future EVs but there is zero proof that they can manufacture them at high enough scale to make them more than halo cars. Ultium EV tech? Ok, but why isn't any independent journalist or reviewer hailing it as an actual technological breakthrough? They announced this big fancy technology and everyone shrugged and bought a Tesla instead.\n\nMeanwhile, they released a newer version of the Bolt and Bolt EUV recently and it's just not selling. The Cadillac Lyriq is coming soon, but it's probably a Bolt EUV with some tweaks and the Cadillac brand as a whole isn't doing well - they tried to go max-performance, succeeded and the market didn't care. (See the CTS-4  and CTS-5 Blackwing, which are great cars nobody bought.) In other words, even when they build a good car, people don't buy them in quantity. \n\nSo if Cadillac isn't the savior, how's Buick? Didn't they almost sell a couple of Cascadas before killing that off? The Enclave, a good seller for Buick, is getting further and further out of date and they're not doing anything about it.\n\nGMC and Chevy? Sure, they sell a lot of trucks and truck-based SUVs. There's the saving grace, but aside from that and the new Corvette (that cost a fortune to design and build) there's really no bright spots in the lineup. You think the Blazer is going to save the brand?\n\nI think Barra is smart and she's doing her best to make the right decisions for the company, but the tar is already up to the dinosaur's chest and it's still sinking.", "score": 28, "replies": [{"body": "I don't think she's a dummy but I am profoundly unimpressed by her as a CEO.  She communicates like a corporate drone.  With other CEO's I feel like they give little glimpses at times to what they're thinking behind the curtain.  With her, its so robotic.  Think about if you're in that position... It's your whole life.  You'd think you'd have some insightful remarks occasionally.  Maybe it's a boomer thing.", "score": 21, "replies": [{"body": "I think it's that she has so many mixed messages in her head (GM is not doing that well) that she's having to resort to carefully planned talking points rather than riffing on how excited she is about the new technology.", "score": 13, "replies": []}]}, {"body": "> they released a newer version of the Bolt and Bolt EUV recently and it's just not selling.\n\nI don't think these are actually available yet. Didn't GM just recently announce delaying Bolt production restart date to April due to cell constraints/issues?", "score": 6, "replies": [{"body": "It could be due to supply chain, but they are or were available for purchase, it's just that nobody noticed when they went away.\n\nhttps://insideevs.com/news/537998/us-chevrolet-bolt-sales-2021q3/", "score": 3, "replies": [{"body": "They were available very briefly. A couple people around me leased them. One even had to return it because the dealer accidentally sold it to him a couple hours after the recall was extended to all Bolts. \n\nTbf they got it because it was way off MSRP and Tesla's demand is too high to release a lower MY trim.\n\nEUV isn't a bad vehicle from what I saw in my limited experience. It's not good either, but I'm so used to my Tesla that EVs naturally feel so much better to me without all the senseless rumbling and whatnot.", "score": 5, "replies": []}]}]}, {"body": "> GM is getting it's ass kicked in every metric there is to measure. \n\nLol, no. \n\nIn 2021 GM was the #4 auto manufacturer in the world. That is a metric they are not \"getting their ass kicked in\".", "score": -8, "replies": [{"body": ">In 2021 GM was the #4 auto manufacturer in the world.\n\nYes they were, but every metric is trending downward. They're #4 right now... where's it look like they will be for 2024?", "score": 9, "replies": [{"body": "Still selling ass loads of cars", "score": -3, "replies": [{"body": "They sold ass-loads of cars in 2009 when they filed for bankruptcy, too.", "score": 10, "replies": [{"body": "Yeah, so? Your argument was that GM is getting its ass kicked in every metric there is to measure, which is demonstrably not true. \n\nVolume of cars sold in a year is a metric that is very measurable, and one that disproves your comment. Anyways, not even a fan of GM myself, never have been. But damn they sell a lot of cars, which is a measure of success in the automotive industry.", "score": 2, "replies": []}]}, {"body": "How many of those \"GM cars\" are in cooperation with [Wuling Hongguang](https://en.wikipedia.org/wiki/Wuling_Hongguang)? GM owns 50% of the company.\n\nIt's great that GM is #4 but they make $14 on the $5k [Wuling Hongguang Mini EV](https://en.wikipedia.org/wiki/Wuling_Hongguang_Mini_EV) (a golf cart with body panels), the most popular EV in China.\n\nI would not count any of those vehicles towards their #4 status.", "score": 1, "replies": []}]}]}, {"body": "I get your point, but look at it through this lens: back in the day Motorola and Nokia was selling more cell phones than anyone and no one was expected to catch up, then the iPhone came out and the other companies kept making the point that they sell more cell phones and the iPhone is overpriced and no one would buy it. Now look at Nokia and Motorola vs Apple. The point is you may sell more of a product, but when a company comes by with a future product and your sales and specs can’t keep up with that new product despite the rest of your business selling well, eventually you’re going to be extinct. It’s all about the adoption S curve.", "score": 6, "replies": [{"body": "That analogy doesn't really carry over to cars though, in my opinion at least.\n\nGM will still be selling.ass loads of cars ten years from now.", "score": -6, "replies": [{"body": "It kind of does carry over though, GM Ford etc are fossils who have had little to no competition for the last 40 years, they've been minimally innovative and their r&d spending is pretty damn low \nTesla tech is the absolute best innovation and technology easily 10 years ahead. They are manufacturing is top notch.\nI don't have the numbers but didn't Tesla sell a fraction of the vehicles GMC did but doubled GMC's net profit? GMC makes cars but they don't make much money, 100+ billion in debt on top of it, when at the same time they are trying to pivot to evs and spend oodles of money in r+d and factory building. The transition is long and slow, supplies are tight and they haven't spent the time establishing a supply chain for materials. My guess is GMC goes bankrupt in <10 years, us govt bails them out, and they continue making cars for years to come\n\nSo maybe you are right....", "score": 5, "replies": [{"body": "Yes 930k vs ~6M cars. 85% growth yoy vs -10%. \nSo with 70-80% growth next year profits could be quadrupled.", "score": 3, "replies": []}]}, {"body": "It hasn’t carried over yet because there hasn’t been a new generation of car, but all cars are going electric just like all phones went to the smartphone era almost overnight.", "score": 7, "replies": [{"body": "In my opinion, an Electric car vs an ICE car is not a revolutionary change like a simple telephone to a bonafide full fledged pocket computer that also happens to have a phone function. \n\nEV vs ICE is just a different drive train. EV drive trains are not even really new either, though with modern battery technology their use case becomes more compelling. They are both metal boxes on rubber pneumatic tires that take you from A to B, with the different designs each having their own set of pros and cons.", "score": -1, "replies": [{"body": "Go drive a Tesla", "score": 4, "replies": [{"body": "I've driven one, it took me from A to B, same as any other car", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "And I can dunk a basketball from the free throw line!\nAll 5'7\" of me!", "score": 19, "replies": [{"body": "I believe in you ♥", "score": 8, "replies": [{"body": "![img](emote|t5_n9evv|3916)![img](emote|t5_n9evv|3916)![img](emote|t5_n9evv|3916)", "score": 4, "replies": []}]}]}, {"body": "She’s ready , unfortunately GM isn’t.", "score": 16, "replies": [{"body": "Or the other way around. 😂 either way GM is fucked.", "score": 12, "replies": [{"body": "They sure are fucked!\n\nFunny thing is Elon isn't even trying to run them out of business\n\nHe'd probably help them if they asked!\n\nFord too they're done.", "score": 7, "replies": []}]}]}, {"body": "Comedian", "score": 15, "replies": []}, {"body": "so, “GM is a tech company that happens to make cars”? WOW, initiation is the most sincere form of flattery, but cmon GM, that’s quite a stretch!", "score": 23, "replies": [{"body": "\"happens to make cars\" is such a poor choice of words for GM right now...", "score": 20, "replies": [{"body": "They're literally colluding and choking the supply of cars to stay alive right now.", "score": 6, "replies": [{"body": "Went to a Ford dealer yesterday and the salesguy was really happy to tell me they're selling cars right off the truck at well over MSRP.\n\nEnjoy the steaks and strippers while can, buddy.", "score": 17, "replies": [{"body": "All that extra markup, and none of it going back into R&D or capex.", "score": 4, "replies": [{"body": "With total s---boxes going for $45k and more, the Model 3 Performance @ $60k + tax is starting to look pretty good to me.\n\nIf I weren't waiting for the CT I'd pull the trigger now on it.", "score": 6, "replies": [{"body": "Especially considering there are likely to be a model or two under $60k, I'm in the same boat.", "score": 2, "replies": []}]}]}]}, {"body": "So even when Musk says there's still a supply shortage people think OEMs are artificially limiting production?", "score": 1, "replies": [{"body": "Agreed. If they could sell more cars, they'd be delighted to do it.", "score": 3, "replies": [{"body": "Even at a loss?", "score": 1, "replies": [{"body": "That is what would happen, I bet.", "score": 1, "replies": []}]}]}, {"body": "Yes. I think corporations (people) conspire given the opportunity. I think they are inflating the prices of LICE autos while they have shut down all but their most profitable production in order to maximize profits and compete.\n\nIt's not their fault; they're trying not to die.", "score": 2, "replies": []}, {"body": "Too much Cathie Wood influence in this sub tbh.", "score": 0, "replies": []}]}]}, {"body": "ROFL great comment!", "score": 3, "replies": []}]}, {"body": "if you have an empty hand but are all in on the pot, you have to bluff ..... if the other side want's to see ( ramp up production of desireable eletric cars faster than you) you're fucked....", "score": 8, "replies": []}]}, {"body": "Best response: \"lol\"\n\nlol", "score": 6, "replies": []}, {"body": "**Mary Barra ready to prove GM stock is as valuable as Tesla**\n\n\nGeneral Motors CEO Mary Barra is masterful at masking what must be an annoying question she is regularly asked.\n\nIs GM stock undervalued?\n\nIn short, she has said, yes, it is. See Barra has a vision: She has been transforming GM over the past several years to make it a technology company, one that happens to make cars.\n\nShe has promised that GM's future cars will all be battery electric by 2035. Barra has also promised to deliver to market soon a self-driving taxi service through subsidiary Cruise.\n\nLast October, she outlined various ways GM will add profits from future software development connected to EVs and self-driving vehicles, ultimately delivering $300 million in revenue by 2030. That's double what GM makes now.\n\nAnd GM reported pretax profits of a record-breaking $14.3 billion for 2021 compared with $9.7 billion in 2020. That happened despite the ongoing global shortage of semiconductor chips hampering new-vehicle production across the industry, including GM, for nearly all of last year.\n\nYet Wall Street seems blasé when it comes to GM's value, especially when compared to some rivals. The open stock market values GM and Ford at about $73 billion, even though Ford has fewer sales and less profit, whereas Tesla, which has even smaller sales and income, is valued at close to $1 trillion by investors. \n\n\"I’m sure she is tired of being asked why Tesla’s stock is worth so much. I was tired of thinking about that covering Tesla for nearly seven years,\" said David Whiston, auto analyst at Morningstar. \"GM’s EV plans are not timid and they dived into being all-electric well before Ford. They just didn’t have a really cool battery electric vehicle until the Hummer came out last year.\"\n\nWall Street's values\nGM's investment in EVs and self-driving car technology plays a big role in how much investors value the company since market capitalization is based on future innovation.\n\nGM declined to make Barra available for this article, but spokesman David Barnas said Wall Street's valuation of the company will not steer GM off course.\n\n\"We’re confident in our strategy,\" Barnas said. \"Our clear priority is to accelerate our EV plan and drive growth, which is exactly what we’re doing, and we have consistently demonstrated that we’re the team that delivers on our commitments.\"\n\nLate last year, GM launched the 2022 GMC Hummer EV pickup, built at Factory ZERO in Detroit and Hamtramck. The Hummer SUV EV will start production there next year.\n\nThis year, GM will launch the 2023 Cadillac Lyriq all-electric SUV, built in Tennessee, and next year, the 2024 Chevrolet Silverado EV will come out. It will be built at Factory ZERO and eventually Orion Assembly in Orion Township, too, where GM presently assembles the Chevrolet Bolt EV and EUVs.\n\nGMC Hummer EV pickup sits on display before U.S. President Joe Biden speaks at the grand opening of GM's Detroit-Hamtramck EV Factory Zero on Nov. 17, 2021.  The president added $7.5 billion to create new electric vehicle charging stations as part of his infrastructure package recently passed by Congress and signed into law on Monday.\nGMC Hummer EV pickup sits on display before U.S. President Joe Biden speaks at the grand opening of GM's Detroit-Hamtramck EV Factory Zero on Nov. … Show more   \nKIMBERLY P. MITCHELL, DETROIT FREE PRESS\nBut beating the Silverado to market will be Ford's F-150 Lightning pickup, due out this spring. GM sees the Hummers as early competitors to the Ford Lightning. Ford launched the Mach-E all-electric SUV, styled after the Mustang, in late 2019.\n\nGM sold 6.3 million vehicles globally last year, bringing in $14.3 billion in pretax profits. Its market cap as of Feb. 16 was $72.5 billion, a figure Whiston says is undervalued in light of all that GM is doing to transition to an EV future.\n\nMarket capitalization, also called market cap, is the value of a publicly traded company and it matters because it signals investors’ confidence in a company, based on what it has coming in the future. It can inspire more people to buy the stock, thereby boosting the stock price, which is key if any CEO wants to stay employed.\n\n\"A bigger cap can mean more media exposure which can bring more investors to the stock,\" said Whiston. \"It can also make lenders or prospective investors in a secondary stock offering (the offerings that happen after an initial public offering) feel more comfortable because they are investing in a big company.\"\n\nThe market cap amount is calculated by multiplying the company's total number of shares by the company's current share price. Market cap gives investors an idea of the company's size and worth.\n\nSome investors might see a big company as far less likely to fail than a small one because it can more easily raise funds if needed, Whiston said. \n\nGM's market cap pales in comparison with Tesla, especially when considering Tesla's financials are a fraction of GM's. The EV maker reported a 2021 net income of $5.5 billion and it sold 936,172 vehicles globally, yet Wall Street values it at $941 billion as of Feb. 16.\n\nFord reported a profit of $10 billion in 2021, selling 3.9 million vehicles. Its market cap matched GM's at $72 billion as of Feb. 16.\n\nFord and GM market cap values have fluctuated over the years. On March 30, 2020, Ford's market cap sank to a low of $17 billion. GM's, also a low point that day, was $26 billion. Then, on Jan. 10 this year, Ford's market cap shot up to $100.63 billion, topping GM's that day by $12 billion. \n\nWhiston has not covered Tesla for Morningstar since June of last year, but he believes a driver behind the market's faith in Tesla is CEO Elon Musk. \n\n\"He’s an extraordinary person (basically the next Steve Jobs) and the stock gets thought of as a tech company rather than a capital intensive automaker, which gives the stock a premium,\" Whiston wrote the Free Press in an email. \"Tesla is showing growing demand and margins that an internal combustion engine firm can’t do as well as impressive tech.\" \n\nNo matter what the numbers, Whiston says GM remains undervalued. To change that, the automaker must keep beating analysts' consensus earnings estimates and generating strong free cash flow while the company also invests aggressively in EVs, he said. \n\n\"Having good free cash flow consistently has been hard due to the (2019) strike, COVID-19 pandemic, and now chip shortage,\" Whiston said.\n\nBut he added, \"There’s so many cool and transformative things going on at GM and even if they only partly reach their 2030 goal of about $300 billion in revenue and 12%-14% earnings before interest and taxes margin, that’s still a lot more earnings than they do now.\"\n\nBarra vs. Farley\nIt may all come down to messaging.\n\nErik Gordon, a business professor at the University of Michigan, said a reason for GM's market cap being undervalued is mere messaging — and perhaps the messenger.\n\nFord CEO Jim Farley aggressively promotes Ford's plans and any hot-new products such as the Bronco SUV, the Mach-E and the Lightning pickup. \n\nJim Farley, CEO of Ford Motor Company next to Ford's all electric F-150 Lightning at its world headquarters in Dearborn on May 19, 2021.\nJim Farley, CEO of Ford Motor Company next to Ford's all electric F-150 Lightning at its world headquarters in Dearborn on May 19, 2021.  \nJUNFU HAN, DETROIT FREE PRESS\n\"One thing Farley has been very good at is stirring up the excitement,\" Gordon said. \"He’s not Elon Musk, but I don’t think he wants to be Elon Musk or P.T. Barnum. But he stirs up excitement.\"\n\nBut Barra has also shown off GM's new EVs. She has taken a spin in a Hummer EV with President Joe Biden at Factory ZERO's grand opening in November and she virtually introduced the Silverado EV reveal last month at the Consumer Electronics Show in Las Vegas. \n\nPresident Joe Biden with General Motors CEO Mary Barra at GM Factory ZERO in Detroit and Hamtramck as they drive a 2022 GMC Hummer EV on Nov. 17, 2021.\nPresident Joe Biden with General Motors CEO Mary Barra at GM Factory ZERO in Detroit and Hamtramck as they drive a 2022 GMC Hummer EV … Show more   \nJAMIE L. LAREAU/DETROIT FREE PRESS\nBut, Gordon said, she has a more serious style that perhaps doesn't grab investor attention. \n\n\"Mary Barra is one of the best CEOs GM has ever had, but she is not able to stir up the excitement that Farley has,\" Gordon said. \"She is not a flashy person. She’s an impressive person and an excellent speaker. Lots of substance, less flash.\"\n\nBut GM's marketing boss, Deborah Wahl, has said she does have a plan to promote and \"normalize\" EV adoption to the masses. To further that message, GM ran a 60-second spot during the Super Bowl earlier this month starring Mike Myers to tout the automaker's upcoming EV lineup.\n\nMore: GM marketing boss has to work fast to bring buyers to electric vehicles\n\nMore: GM's story behind star-studded 'Austin Powers' Super Bowl ad", "score": 13, "replies": [{"body": "\nFord's 'family jewels' help\nBarra shows no desire to emulate Tesla's outspoken Musk.\n\nWhen asked by a reporter in December for her reaction to Musk's comments about Biden's proposed EV credits and other EV incentives, she said, \"I’m not going to get into a match on that type of stuff because I actually mean what I say and say what I mean.”\n\nBesides personalities, there is perception. Gordon said there was a perception that Ford was far behind GM on EV development and then caught up, so the market rewarded it. But Gordon said Ford was never that far behind GM in the first place, it just got better at messaging its EV mission.\n\nPlus, Ford has been committing some of its most prized brands to EVs: Mustang and the F-150, said Steve Melnyk, professor of supply chain management at Michigan State University.\n\n\"These brands are critical to Ford; they form part of the identity of Ford. They are almost the family jewels,\" Melnyk said. \"The message in committing these brands to e-cars is simple: EV is critical to Ford and its future.\"\n\nThe Ford Mustang Mach-E electric SUV wasn't cleared to use the Mustang name until after chairman Bill Ford drove one.\n\nIn contrast, GM has the Chevrolet Bolt, the Cadillac Lyriq and GMC Hummer EVs, names that don't have the same degree of brand identity, Melnyk said.\n\nAnd sometimes the future doesn't matter as much as the past, Melnyk said.\n\nGM has a long experience with electric cars, but it has also had problems. Most recently, the global recall for the 2017-22 Bolt EVs and EUVs for defective batteries that could pose a fire risk. There were 18 related fires of Bolts, 15 of which GM has confirmed.\n\nThe scene on Sept. 13, 2021 of a 2019 Chevrolet Bolt on fire at a home in Georgia, just north of Atlanta. The fire report read: \"The fire appeared to be coming from a 2019 Chevy Bolt electric vehicle.  The vehicle was pulled from the garage; however, it had already received extensive damage.  Another vehicle inside the garage, a 2017 Dodge Ram, received some smoke damage.\"\nThe scene on Sept. 13, 2021 of a 2019 Chevrolet Bolt on fire at a home in Georgia, just north of Atlanta.  \nPROVIDED BY CHEROKEE COUNTY FIRE & EMERGENCY SERVICES\n\"How can you be an EV leader if I have to park my car outside for the concern of a battery fire?\" Gordon said. \"We always get recalls, but the image of a car setting your garage on fire is a really vivid image.\"\n\nGM's battery supplier LG Electronics Inc., a division of LG Chem, will reimburse GM $1.9 billion for making the defective batteries. GM remains in the midst of fixing the 140,000 Bolts impacted by the recall; both Gordon and Melnyk say investors could perceive it as a bad sign for the future.\n\nMore: GM keeps Orion Assembly idle until spring, leaving no new Bolts to buy\n\n\"Given the difference in problems, as an investor, I would have more confidence in Ford moving forward,\" Melnyk said.\n\n'Homegrown treasure'\nYet both GM and Ford have made good investments in the future and they have been learning, Gordon said. \n\nBoth automakers, Gordon said, are led by strong leaders.\n\n\"Farley and Barra are both good CEOs,\" Gordon said. \n\nBut how secure is her job if GM's market cap doesn't rise in light of GM's financials and future plans? \n\nGeneral Motors chairman and CEO Mary Barra, waves before President Joe Biden speaks on the South Lawn of the White House in Washington on Aug. 5, 2021, at an event on clean cars and trucks.\n\nGordon said her job should not be in jeopardy, \"unless the board has lost its mind. She’s a homegrown treasure. GM is all she’s done since she was a kid. The fact that the stock is languishing that’s on the investors. But you have to be happy with Barra as a CEO.”\n\nWhiston agreed saying, \"As long as the board wants Mary there she does not need to worry and I don’t want her to leave just in some lame attempt to boost the stock price.\"\n\n'We'll prove it'\nAnalysts and industry experts are not the only ones who think GM is undervalued. \n\nIn December, reporters asked Barra why GM's market cap continues to be dwarfed by startup Rivian, then with a market cap of $95 billion, and Tesla.\n\n“Sometimes the iconic traditional company, even though they’re innovating quickly, just gets looked at with a different lens and that’s OK, we’ll prove it,\" Barra said of GM's $87.5 billion value in December.\n\nBut Barra admitted that GM needs to do a better job telling why it will lead the transition to EVs. Then deliver new EVs that consumers want to buy.\n\nGM CEO Mary Barra addresses auto reporters at the Automotive Press Association event on Dec. 9, 2021 at the Gem Theater in Detroit.  \nJAMIE L. LAREAU/DETROIT FREE PRESS\nA month prior, during an interview with Andrew Ross Sorkin during the New York Times DealBook Online Summit,  Sorkin asked Barra her feelings on the fact that GM has made 10 times the profits as Tesla, yet Tesla's market valuation was $1 trillion then, as GM's hovered at about $84 billion.\n\nBarra said such high market valuations prove GM is \"so undervalued\" by Wall Street. But she insisted it doesn't bother her because GM will be rewarded once it completes its EV plan.\n\n“I see it as huge opportunity for General Motors to capture significant more value,\" Barra said.\n\nSlow and steady wins \nOften, stock prices have turbulence as investors either get exuberant or spooked depending on the day's news.\n\nOn Feb. 8, for example, Morgan Stanley's lead analyst Adam Jonas cited GM's 2022 earnings guidance as “well below” Morgan Stanley’s forecast. He had concerns over the pace of the automaker’s EV transition, so Jonas downgraded GM's stock. \n\nOn that news, the stock opened at its lowest point since September. But the price recovered throughout that day to close down by 2.5% to $49.46 a share, topping GM's 52-week low of $47.07 a share.\n\nKate Whitefoot, an associate professor of engineering and public policy at Carnegie Mellon University in Pittsburgh, said it is too early in the auto industry's EV transition to determine true market value. \n\n\"Wall Street is looking at speed to market, but maybe taking a slower approach is better in the long run,\" Whitefoot said.\n\nThe shift to EVs is all consuming for the auto industry from design of vehicles, to working with dealers to ramping up sales of EVs.\n\n\"The market is responding in terms of whether it's GM, Ford or Tesla, are they meeting their expectations of the timing of that transition?\" Whitefoot said.\n\nBest batteries win\nThe winner of this long-term transition will depend on a lot more than just who is first to market with a product, Whitefoot said.\n\n\"GM is taking a strategy in their EVs that is different from Ford,\" Whitefoot said. \"Ford is using their existing platforms and converting them to EVs. GM is creating its Ultium platform. That may be an advantage. But we’ll wait to see.\"\n\nThe Ultium platform will underpin all of GM's future EVs. Barra has said it allows GM to offer a wide array of vehicles across various price points, including developing an EV that will start at $25,000 to encourage EV adoption.\n\nIronworkers at Ultium Cells LLC's battery cell manufacturing facility mark a construction milestone Friday, Feb. 19, 2021 with the final beam installation at what will soon be a 2.8-million-square-foot operation in Lordstown, Ohio. It is a joint venture between GM and LG Chem that will make Ultium battery cells for EVsicles and create more than 1,100 new high-tech jobs.\nIronworkers at Ultium Cells LLC's battery cell manufacturing facility mark a construction milestone Friday, Feb. 19, 2021 with the final beam installation at what will … Show more   \nROGER MASTROIANNI FOR GENERAL MO\nGM also has a joint venture with LG Chem called Ultium Cells LLC to make its own battery cells. GM said it will build four new battery plants in the U.S. It has only given the locations of three so far, one of which will be in Lansing.\n\nMore: GM's huge Michigan investment left out Flint Assembly, leaving workers anxious for future\n\nFord has also committed to making batteries and is investing in building three new battery plants. \n\n\"Tesla entered the market from the opposite direction of a lot of other automakers,\" Whitefoot said. \"They started as an electric vehicle company and now they’re doing this combined approach of working with battery suppliers and using their own factories to realize the sort of volume of batteries they need.\"\n\nWhitefoot said the top-selling EVs in the future will depend on how the batteries perform. So the companies that design and make the best batteries, win.\n\n“If you want to come in, like a Tesla, you have to know both sides of the business: How to make a great battery and also how to build vehicles. It’s not enough to do just one of those sides,\" Whitefoot said. \"Those companies that can build on expertise in both manufacturing and batteries will have a competitive edge.\"\n\nSympathy for Barra\nThat would appear to be GM and Ford. \n\nYet just four months ago, in October, Tesla joined an exclusive club when it topped a trillion dollars in market capitalization. It was the fifth U.S. company to do so, along with Apple, Microsoft, Amazon and Alphabet, the parent company of Google, according to Reuters. \n\n\"I have some sympathy for Barra,\" Gordon said. \"When Barra wakes up and the stock versus Ford or Tesla is languishing, I feel her pain. But I think it’s going to work out. It’s investor perception.\"\n\nMore: GM investigates cause of vehicle fire at Proving Grounds in Milford\n\nMore: GM's chip strategy that keeps production running as Ford goes down\n\nContact Jamie L. LaReau: 313-222-2149 or jlareau@freepress.com. Follow her on Twitter @jlareauan. Read more on General Motors and sign up for our autos newsletter. Become a subscriber.", "score": 5, "replies": []}]}, {"body": "GM announces 1500mi range battery in a self-driving robo-taxi car for $25k. THEN maybe I'd believe it....prob not", "score": 4, "replies": [{"body": "Announces? Hell, no. I believe nothing until they've built 20,000 of them.", "score": 4, "replies": [{"body": "yea 26,000 not 26 ;)  \nand not even, maybe if they cured cancer and ended world hunger and brought peace on earth then they would be worth 700b", "score": 0, "replies": []}]}]}, {"body": "They are going to increase their production by 2 orders of magnitude this Q, so maybe a few 100s if they are lucky 🤣🤣", "score": 4, "replies": [{"body": "That’s gonna leave a mark.", "score": 1, "replies": []}]}, {"body": "This is what you get when you have an actual genius engineer running several companies at once against marketing MBAs who take mostly off the shelf parts with engineers trained 3 decades ago to make what are loosely called automobiles while investing a large percentage of what little  profits they have in naming consultants to come up with names like “Ultium” and making stickers to cover the LG logo on the batteries. \n\nThis lady is very much in over her head.  She’s just strumming the GM tune until the strings break and they boot her off the island with a golden parachute.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "For her?  Yep for sure.  She’ll make millions regardless of outcome.  Poor union schlubs that work for her?  It’ll suck in a few years when they need to be “retrained” for other work and can really find another job", "score": 1, "replies": []}]}]}, {"body": "If I see one of these legacy manufacturers actually jump in with both feet I'll believe.  \n\n1. Stop producing ICE vehicles\n2. Start retrofitting all existing plants to make EVs", "score": 3, "replies": []}, {"body": "I wonder when GM will pay us back the bailout money from 2008??\n\n“In total, GM received $52 billion from the U.S. government, but only $6.7 billion of this amount was considered a loan. The company already paid back $2 billion, so this $4.7 billion is the last payment. This doesn't mean that “Government Motors” is no more.”", "score": 3, "replies": []}, {"body": "30% gross margin would be a good way to do that. \n\n(Ted Knight voice) Well! We’re waiting…", "score": 2, "replies": []}, {"body": "I'm glad that my Bolt has a new 65 kWh battery that GM replaced for free with a new 8 year, 100,000 mile warranty.\n\nThat's nice.", "score": 2, "replies": [{"body": "You get to park it within 50 feet of any cars or living beings now?", "score": 3, "replies": [{"body": "Yup.", "score": 1, "replies": []}]}]}, {"body": "How many HUMMER EV's do they really think they can sell? The reason they are doing it is because they don't want to completely obliterate their financials and want to make a profit on an EV. Hummer might be priced enough to where they can make a profit just like how Tesla did with the Roadster. I don't know a single person who would want to buy a Hummer. Nevermind the fact that it's so inefficient on the road. I heard that the battery alone weighs as much as a Civic. What the hell? Are they looking to run people over with that thing?\n\nNevermind the fact that their Bolt was put on production hold for 8 months. How are you going out there claiming that you are the EV leader when your only EV is production halted? Of course, we all know why Biden keeps sucking off GM... Surely it had nothing to do with this:\n\nhttps://www.detroitnews.com/story/business/autos/general-motors/2022/02/09/biden-niece-former-obama-aide-joins-general-motors-washington/6720560001/", "score": 4, "replies": [{"body": "Yeah the weight is insane.  Imagine how many sets of tires you’re going to rip through in that thing and how much they cost. \n\nMy X chews through tires every 20k miles and they’re like $1500 a set", "score": 1, "replies": []}]}, {"body": "Paywall. Anyone got the content?", "score": 2, "replies": [{"body": "Content... Haha. No one is paying for that hot air.", "score": 6, "replies": []}, {"body": "https://www.reddit.com/r/teslainvestorsclub/comments/svjy9q/mary_barra_ready_to_prove_gm_stock_is_as_valuable/hxgqbk9/", "score": 3, "replies": [{"body": ">\tLate last year, GM launched the 2022 GMC Hummer EV pickup, built at Factory ZERO in Detroit and Hamtramck. The Hummer SUV EV will start production there next year.\n\nThis article is worded confusingly. Is the hummer available to the general public already?", "score": 2, "replies": [{"body": "I think they technically started deliveries 1-2 months ago but they def haven't delivered that many.", "score": 1, "replies": []}]}]}, {"body": "\"Is GM stock undervalued?\n\nIn short, she has said, yes, it is. See Barra has a vision: She has been transforming GM over the past several years to make it a technology company, one that happens to make cars.\"\n\nI refuse to give Detroit a dollar to read the rest...", "score": 2, "replies": []}]}, {"body": "You did it Mary! You led!", "score": 2, "replies": [{"body": "Ok okay I’ll say it.  “Tesla”.  See happy now?", "score": 0, "replies": []}]}, {"body": "😳🤷🏼‍♂️\n\n🤪🤪🤪. what is she smoking 🚬", "score": 1, "replies": []}, {"body": "They are leading, what else prove do you need?", "score": 1, "replies": []}, {"body": "Why does she need to prove anything if she’s already the leader?", "score": 1, "replies": []}, {"body": "Leave it to democrats to steal credit for electric cars from an African American CEO to this White lady CEO", "score": -1, "replies": []}, {"body": "Lets go Mardon!", "score": 0, "replies": []}, {"body": "Just do it\n\nLooks like she has no legs on that thumbnail lol", "score": 1, "replies": []}, {"body": "Barbara decided to work with Trevor is because she found her true match.", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "CBA to wait though Mary", "score": 1, "replies": []}, {"body": "shes been saying this shit since 2020", "score": 1, "replies": []}, {"body": "Mary Barra is a nutjob.", "score": 1, "replies": []}, {"body": "I thought she was already leading the future of EV.", "score": 1, "replies": []}]}
{"title": "Alex Karp May Look Like A 🤡, But He Is Actually Just Dumb: How To Know When PLTR Will 🚀🚀🚀😎 And When To Buy In.", "selftext": "Alex Karp shit the bed. There is no denying it and no way to sugar coat that truth. Anyone who believed in the larger mission of Palantir or the future of AI got burned badly by the clown car of monkeys that are disguised as PLTR executives.\n\nKarp had an army of loyal investors just like Elon Musk and Tesla. That is more than enough for any CEO to patiently build an amazing company and transform the future.\n\nInstead of doing that, Karp voted to give himself 100% of revenue as a bonus and dumped that steaming pile of dilution all over retail supporters who were holding the stock. Karp has all the voting rights, so of course he voted to give all the PLTR growth to himself.\n\nNo one trusts the executive team at this point, and bagholders won’t see stock price appreciation until PLTR leadership resigns or does something drastic.  Why should anyone hold this stock long term when insiders dump it at the first chance they get? \n\nThe only thing Karp can do now, short of resignation, is show investors that he actually likes the company - and the stock - by buying a few shares. Karp could take $200,000,000 of the $500,000,000 he made through dilution and buy the dip on his own company rather than wait to be issued shares for free.\n\nKarp has all the voting power, so of course he can always just vote himself infinity shares. This is why the PLTR executives are a clown car of retarded monkeys when it comes to building the future. If anyone at that company had one ounce of foresight, they would realize that looting the shareholders is a losing strategy long term. Karp may have won round 1, but shareholders will not be lured in so easily in future iterations of the bagholder game.\n\nIf Karp bought the dip at these high prices, it would show current bagholders that there is a floor to the share price and, at the very least, that Karp is sharing the pain alongside his investors. \n\nIn fact, this is the exact strategy Elon Musk used with Tesla. He didn’t dump shares the moment his options vested. Elon took out loans to exercise his options and held those shares for years. Elon waited until every retail investor who believed in the company during the tough times had 12 months to cash out at 10X their investment before he took profits.\n\nThe fact that Elon Musk was willing to share the pain along side the retail shareholders meant that he really did believe in the long term future of his company and it wasn't just a get-rich swindle. Yes, it sucked to see Tesla dip on good news, but holding was easy because I knew that Elon lost more of his wealth as a percent than me every time Tesla stock crashed.\n\nJust be real: Karp doesn’t need $500,000,000 cash on top of his annual cash salary of $3,000,000 on top of his insane share compensation. He is just a greedy 🤡.\n\nOther than an extraordinary move like the one I outlined above, there is nothing that will really restore investor confidence. As things stand, Karp said he would not stop diluting at a rate of at least 10% a year...that means PLTR's 35% growth ends up being 25% growth for shareholders after Karp takes his cut. \n\nI totally believe he will invent another reason to vote himself 100% of revenue as well. That means you are getting less than half of the CAGR that is currently offered by GOOG: a company that is also in the AI game, is already massively profitable, and has an executive team that has proven they can grow wealthy without burning their shareholders.\n\nSo, how do I make money off of this dumpster fire of a company known as Palantir? Easy: wait until PLTR hits $2/share. At this point, Karp will have to stop the dilution or risk getting delisted. Once Karp makes a u-turn, then PLTR will be investable.\n\nTL;DR\n\nIf AI actually worked, PLTR would have shorted itself.\n\nP.S.\n\nI made over 100% on this stock by buying at $9/share, selling a few covered calls, and cashing out  at $18/share when Karp said on CNBC that he would not stop the dilution and the share price would have to go up in spite of the additional shares. I am writing this DD for all the current bagholders who think that a company that endlessly dilutes their investors is a long term opportunity.\n\n&#x200B;\n\n[https://imgur.com/a/MULpP8I](https://imgur.com/a/MULpP8I)", "id": "svj6ta", "created_utc": 1645194308.0, "score": 174, "upvote_ratio": 0.87, "num_comments": 98, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|65|**First Seen In WSB**|1 year ago\n**Total Comments**|749|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/sefkgc/the_only_arkk_dd_you_need_portfolio_construction/) [x](https://www.reddit.com/r/wallstreetbets/comments/sf0dhb/arkk_is_a_sinking_ship_practical_portfolio/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=svj6ta)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=svj6ta)\n    \nHey /u/GME_200K, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": [{"body": "Post your positions.  You will be banned if positions are not provided.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Position: i currently have a small PLTR position (500 shares) with a cost basis on $5/share due to covered calls. I will wait in cash until PLTR hits $2/share. Once Karp publicly announces he will pull back on share compensation, then I’m going all in.", "score": 0, "replies": [{"body": "Bann it is, i guess", "score": 4, "replies": []}]}]}]}, {"body": "Should have known to dump this shit the first time I saw Karp and his fucking pretentious hair.  Now I’m stuck with a bag I bought at $23.  Should I just dump it and move on?", "score": 32, "replies": [{"body": "I’m in at $23 too 😫", "score": 8, "replies": [{"body": "I'm in at $34.66\n\n![gif](emote|free_emotes_pack|sob)", "score": 7, "replies": []}, {"body": "LMFAO I just bought it at 23 on the dot yesterday during the dip. how funny", "score": 1, "replies": []}]}, {"body": "Fwiw even Cathie decided to call it quits and took a massive L on her position. \n\nOnly god knows how she decides which losing trade to dump and which to average down on. It’s probably her research that is ’2nd to none.\n\nIn all seriousness who knows where this turd will bottom out? Could go a hell of a lot lower still", "score": 2, "replies": []}, {"body": "Lol I remember DDs that one of their points was Karp's hair", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 22, "replies": [{"body": "I sold my puts today, but damn Im heavy in PLTR shares with an average of almost $23 🤡", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 38, "replies": [{"body": "LOL", "score": 3, "replies": []}]}, {"body": "Sold out if my position today, $10k loss. My long position was never green. Fuck pltr and fuck alex karp. Piece of shit", "score": 14, "replies": []}, {"body": "Although this opinion won't be popular, he did warn if you are a short term horizon investor, you should not buy the stock.", "score": 16, "replies": [{"body": "long term holder does not mean allow the ceo to funnel 100% of revenue into his pocket. \n\nName one good company that compensates anything near PLTR multiples of free cash flow???\n\nIt’s even worse bc if PLTR is a long term play, they need that cash flow right now more than ever. It is literally 10x-20x more valuable today than when they saturate the market.", "score": 8, "replies": [{"body": "Listen, I get it. Everyone is frustrated as hell that this stock has been dumping forever but this is exactly what the big banks want, frustrate the fuck out of retail investors until they give up and sell. \nSBC is the only way they can compete against the likes of Google etc for talent. If you take a look at the 13 F/G filings, institutions have been loading the boat on Palantir shares in Q4 2021. I believe Bank of Montreal has increased their position by 600%. Morgan Stanley, Citedal, Susquehanna etc also increased their positions substantially. I went through the recent earnings and they exceeded expectations and gave positive guidance. Nothing has fundamentally changed with the business so if $25 made sense a year ago then $12 is a freaking bargain. Someone mentioned to me that Government growth was down to 26% so that's very bearish. Are you kidding me? If they beat on revenue must be  commercial side is growing rapidly which is exactly what I want to see, less dependence on government revenue.\nThis company is not a pipe dream or nearly bankrupt operation, they have rapid growth in a growing sector with NO debt. The CEO said straight up on TV that if you are a short term investor DO NOT buy the stock because the company sole focus is to attract the finest talent and stock based compensation will put pressure on the stock. \nI ain't selling a single fucking share but I guess to each their own. \n\nJust FYI, Cathie Wood sold another $158M in Palantir today so if you ever needed a contrarian indicator here you have it. This beauty has been buying high selling low for the past year.", "score": 12, "replies": [{"body": "I dont know Jack about shit, but have you considered he may have said not to buy the stock if you're a short term investor in order to bait people into holding bags for him indefinitely? Not saying it is, and I have no stake in this. Im just curious if you've considered it.", "score": 5, "replies": []}, {"body": "Comments like OP’s are an overreaction. You’re right that SBC is important-even if it’s bad press. If you’re in cutting edge tech, hiring the right genius can change everything.", "score": 5, "replies": []}]}]}, {"body": "Shh! 🤫", "score": 1, "replies": []}]}, {"body": "in about 18 months or so we will be GAAP profitable thanks to its FCF being positive", "score": 14, "replies": [{"body": "Shh you’re not supposed to say anything based on actual DD about PLTR in this sub", "score": 13, "replies": []}, {"body": "Ok, so I'll wait for it to shit the bed for another 17 months before buying in.  Wjy would someone buy in now knowing there is more SP drops in the short term?", "score": 3, "replies": []}]}, {"body": "Ok, guys you had fun playing PLTR. Now dump it because you're making the wrong people rich. (Hint: it's supposed to be you.)", "score": 27, "replies": [{"body": "Underrated comment.", "score": 8, "replies": []}]}, {"body": "Does this thread mean it’s time to buy?  Kramer and wsb inverse", "score": 10, "replies": []}, {"body": "GOOD DD he is right \n\nAs some one who works in tech / finance \n\nWhat KARP is doing is ruthless greedy shit \n\nHe is fooken retail to make his generational wealth solid.\n\nAlmost scam type\nShit but then again \n\nNo one made retail\nBuy pltr \n\nBesides all that garbage hype", "score": 36, "replies": [{"body": "Alexis Karpal Tunnel is too busy Toobin' all day with his money rather than actually doing anything useful with it.  Read on the mindset of what guides Alexis's decisions at Palantir .", "score": 2, "replies": []}]}, {"body": "Can't wait for all morons in this sub to finally sell and move on to another retarded stock. Let people who understand and have the patience stay in PLTR and all the get rich quick fuckboys move on.\n\nSincerely yours, Mr.Baghoder", "score": 24, "replies": [{"body": "What will be left ??  The KARP Clown car ??  I don't know how long you have been doing this ? But 137 million shares traded so far today  and nobody is coming in to scoop it up at $11 .seem odd to you ? The stock , the tech, the people, the innovation , Fantastic .The mother fucker that runs the company has stuck his finger right up our ass.. Fuck you he says , I will sell my free shares at reckless abandon ! I will dilute the owners of this companies money fuck them ,  No one with any common sense ,civility, and respect for the company and people he works for would do what Alex Karp is doing .  Disclosure I am over 3000 shares deep... And when I believed in this company I actually put some in my 2 daughters college fund . No quick fuckboy here ,But I tell you what If it walks talks and quacks like a douche bag it is one ,And Karp is a douche bag", "score": 10, "replies": []}]}, {"body": "I said about a year ago that this company was just a funnel for money into the execs pockets but everyone downvoted me. Glad to see you are all bagholders, for not having an ounce of common sense to see the obvious.", "score": 56, "replies": [{"body": "I remember there being numerous posts about how crook the exec were. Who would have guess.", "score": 11, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I don’t like Elon too much for a variety of things but the comparison is off my man. Tesla has a product you can see and touch, Palantir’s products are shrouded in secrecy, and despite never turning a profit the CEO was paying himself ridiculous sums for salary. It was easy to see he was simply funneling money into his pockets, some people just didn’t want to see.", "score": 10, "replies": [{"body": "Palantir's products are not actually shrouded in secrecy as such. The company's algorithms are not so much its secret sauce as its staple fayre - it's hard to explain an algorithm that hunts through Boeing's order and logistics history, compares it with that of every other large-scale company on PLTR's books, and identifies cost-savings, or scans the entirety of a company's R&D history to spot bottlenecks etc etc.\n\nMoving into the SPAC/startup field was a bit of a master stroke too, giving Pltr early-adopter knowledge of emerging industries etc etc. The synergies of Pltr's business are phenomenal, think of how internet translation software started off until it hit a critical mass of 'emprical evidence' to enable them to get it right, Or how Amazon swallowed up the entire online retail sector...compare it to Palantir's 4.7-fold increase on US clients YoY for Q4.\n\nBut, ultimately, agreed. Excellent piece OP, the SBC is killing the company, and the SEC should look at companies with just such a dual-ownership structure, It's only the military contracts that let Palantir get away with this. Now it's time for Karp to play fair. Palantir absolutely has not done this so far. After the way the SBC was marketed as a one-time expense at the IPO, I'm amazed there is no talk of class actions on how the company pivoted the excessive SBC into an ongoing  central part of its remuneration policy.", "score": 6, "replies": []}]}, {"body": "I know I'm going to get down voted to hell for this but in my humble opinion the verdict is still out on Elon. That whole Thailand saving the boys with a submarine and calling one of the rescue workers a pedophile with no evidence was the tipping point for me. He seems like a born rich man who hasn't been told no enough. Most of his engineering marvels are terrible ideas and he relies on hype and hopium.", "score": 8, "replies": [{"body": "That pedo was **not** a rescue worker", "score": 5, "replies": [{"body": "\"Elon Musk came under fire on Sunday after launching an extraordinary attack on a British diver who helped rescue the boys trapped in a flooded cave in Thailand, baselessly calling him a “pedo” on Twitter and then doubling down.\"\n\nhttps://www.theguardian.com/technology/2018/jul/15/elon-musk-british-diver-thai-cave-rescue-pedo-twitter", "score": 1, "replies": [{"body": "He's a recreational diver that knew the caved, and was sitting on the sidelines. He never went in.", "score": 2, "replies": [{"body": "Maybe don't call anyone a horrible thing like a pedophile especially when you have a loyal gang of millions of people that will inevitably make that guys life harder?\n\nWhy are you defending that behavior?", "score": 1, "replies": [{"body": "Maybe don't tell someone that wants to help to stick something up their ass, especially when you're the oldest white dude living in pedo ville of Thailand.", "score": 2, "replies": []}]}]}]}]}, {"body": "### UPVOTE", "score": 2, "replies": []}]}]}]}, {"body": "the massive share dilution is the only reason i'm not investing in this company.  Love everything else about it, but that's a deal breaker", "score": 21, "replies": [{"body": "Exactly. Amazing tech, team, story, execution....but no way dilution like this is investable.", "score": 12, "replies": []}]}, {"body": "\"Karp has all the voting power\". (Sad Peter Thiel noises)", "score": 5, "replies": [{"body": "I used to think thiel was a genius, but the way he let Karp hollow out his company is just dumb. \n\nIt turns out these tech bros just speak in arcane talking points to sound good but really just have fewer brain cells than the average McDonald’s assistant manager.", "score": 12, "replies": [{"body": "Your profile is gold", "score": 1, "replies": []}]}]}, {"body": "PSA. Do NOT buy Palantir. Not now, not ever.", "score": 13, "replies": []}, {"body": "You wrote too much to read. I’m just going to buy more shares. To the moon boys!", "score": 18, "replies": [{"body": "Papa carp would never let me hold these bags forever", "score": 6, "replies": []}, {"body": "Thank you for the exit liquidity 💁‍♀️", "score": 7, "replies": [{"body": "Because his 200 shares would be so hard to get rid of", "score": 2, "replies": []}]}]}, {"body": "Karp hasnt sold since Nov has he recently sold more?", "score": 3, "replies": [{"body": "At THESE prices? *laughs in billionaire*", "score": 2, "replies": []}]}, {"body": "Instructions unclear... Bought more", "score": 5, "replies": [{"body": "For real. Don’t ever let some Reddit post tell you what to do", "score": 7, "replies": []}]}, {"body": "hmm,  I've got a friend that rants and raves about PLTR       \n\nSays its the next best thing something something sliced bread", "score": 2, "replies": [{"body": "Sliced bread is taking a beating too.", "score": 6, "replies": []}]}, {"body": "It’s not just Karp, they’re throwing money left and right at everyone and everything. To keep and attract talent and expertise, they are lavishing even the most junior employees with tons of stock options so the dilution will continue ad infinitum. \n\nThe hope was that they will generate enough big government contracts to cover up all these expenses, but DoD and all these other 3 letter agencies are not seeing the return on investment they were promised early on and having second thoughts, it will get worse, much worse, and there be a revolt and board will clean house but that maybe a year or two down the line and stock will have languished in the single digits for too long that the best hope would be to sell to the likes of Microsoft or Amazon at a discount.", "score": 2, "replies": []}, {"body": "I heard a rumour that they are going to release an AI banana slicer very soon.", "score": 2, "replies": [{"body": "Wouldn’t be surprised if it’s the only useful product they make.", "score": 2, "replies": []}]}, {"body": "I honestly added it to my ROTH and now waiting 25 years. Whatever", "score": 2, "replies": [{"body": "Same here. 1000 shares at $24 cost basis sitting in my IRA until retirement.", "score": 1, "replies": [{"body": "haha hell yeah brother....23 avg and 13 avg when I bought again...Ill check back in 25 years", "score": 2, "replies": []}, {"body": "My investment twin!", "score": 1, "replies": [{"body": "950 shares in my ROTH at $23 avg. It's my biggest conviction play", "score": 1, "replies": []}]}]}]}, {"body": "This post aged badly . Who's the clown now lol", "score": 2, "replies": []}, {"body": "Good read", "score": 3, "replies": []}, {"body": "Long salt futures, as you seem to have consumed the entire US supply in writing this post", "score": 1, "replies": []}, {"body": "Wow this aged so well 🤡", "score": 1, "replies": []}, {"body": "Maybe Karp knows a market crash/depression are imminent and is trying to suck out as much $ as possible before it happens.", "score": 1, "replies": []}, {"body": "KARP is a fucking clown !  sold 10 $11 put for 2/18 said to myself IT COULD NEVER HIT $11 ,![gif](emote|free_emotes_pack|scream)  just fucking rolled to April fools day $10 . I would like to meet this guy KARP walking out of a bathroom with no one else around that's all I will say ...When I saw the video of that douche bag swooshing down the slopes ,I said to myself, self you should dump this shit lick your wounds (semi small loss) and move the fuck on! BUT NO I held on...lesson learned.............  holding big time shares", "score": 1, "replies": []}, {"body": "We will see. It took AZO 30 years to go from 10 to 1900. Just because pltr is down right now doesn't mean much. The company has strong financials and is growing. We will see", "score": 1, "replies": [{"body": "At that point, I'll be in a wheel chair and won't give a f'.", "score": 3, "replies": []}]}, {"body": "PLTR to the mooooooon", "score": 0, "replies": []}, {"body": "I own ONE 14 strike call with like 92 DTE.  \n\n&#x200B;\n\nIts red right now.", "score": 1, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "Cuz.", "score": 2, "replies": []}]}]}, {"body": "great DD OP  - bag holder here - drank the kool aid on this one", "score": 1, "replies": []}, {"body": "I like how the price to book is 86 cents lol. Doesnt mean anything but you are investing in a black box.", "score": 1, "replies": []}, {"body": "These two are unrelated in mission, but chart-wise, what I see for PLTR you can see in DM. Check the annual view...", "score": 1, "replies": []}, {"body": "You lost me at losing strategy long term. There is no need for him to have a long term strategy he’s rich.", "score": 1, "replies": []}, {"body": "I bought in at $25 because of some fucking youtube video. Glad I dumped it after a day after seeing someone mentioned the share dilution on wsb.", "score": 1, "replies": [{"body": "Max Maher?", "score": 2, "replies": [{"body": "Chicken genius sg..", "score": 1, "replies": [{"body": "he dropped an apology video today", "score": 2, "replies": []}]}]}]}, {"body": "Great post take my award OP sorry about ranting in the thread but Karp riles me up", "score": 1, "replies": [{"body": "Thanks 🚀🚀🚀😎", "score": 1, "replies": []}]}, {"body": "Wow.  I'm a dumb motherfucker.  This guy on youtube said to buy Palantir and I did.", "score": 1, "replies": []}, {"body": "Exactly.  Warned about this shit train at 29, 25, 21, 18, 16.  Dumb money fools blind to metrics", "score": 1, "replies": []}, {"body": "I dumped all mine and was in 23$ and got in on bbig", "score": 1, "replies": []}, {"body": "Palantir hasn't made a profit in over 18 years? Is this true?", "score": 1, "replies": []}, {"body": "You know, I only found this awesome article cause I typed \"Alex Karp Clown\" so thank you", "score": 1, "replies": []}]}
