{"title": "What stops people from selling puts that are ridiculously out of the money and close to expiration so they can collect the premium with very little risk?", "selftext": "An example being an AUG 10 $160 Put on AAPL for 0.22", "id": "8yh9vb", "created_utc": 1531459569.0, "score": 15, "upvote_ratio": 0.79, "num_comments": 40, "comments": [{"body": "In order to sell something, someone has to want to buy it. ", "score": 62, "replies": [{"body": "If a written out ends up out of the money the seller keeps the premium, no need for a buyer ", "score": -41, "replies": [{"body": "But the “seller” had to “sell” the put to get a premium. If nobody “buys” the put, where does the “seller” get the premium from?", "score": 37, "replies": [{"body": "I love when people like OP come on this sub thinking they know a secret while clearly not knowing options well,  and then have the gall to also be kind of arrogant in the comments.\n\na fool and his money I suppose...", "score": 30, "replies": []}, {"body": "You right", "score": 8, "replies": []}]}]}]}, {"body": "margin requirements or account balance for what amounts to about a 0.14% return in a month or a 1.65% return in a year, especially for the amount of risk involved. A savings account could give you more return and risk free.", "score": 36, "replies": [{"body": "Close to expiration =/= to a year. ", "score": -2, "replies": [{"body": "That's for people who can't do simple math to push the point of how little the gain is. Savings accounts usually say along the lines of \" rate of 2% apy \"  which stands for annual percentage yield. Annual = 1 year.\n\nI was honestly hoping people to be critical about other parts of the sentence.. instead people are just up voting..not even op is replying and he replied to others...", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 33, "replies": [{"body": "Have fun getting hit by the steamroller lol", "score": -29, "replies": [{"body": "He means that far out of the money options rarely have any value in premium. All it takes is one black swan event and all those small premiums will be negated.", "score": 13, "replies": []}]}]}, {"body": "> AUG 10 $160 Put on AAPL for 0.22\n\nThat might not be as risk-free as you think. Apple has earnings on July 31st.", "score": 16, "replies": []}, {"body": "I sign up to a newsletter that advertises a “free money” strategy that does just that.  Sell December $21 GPS puts for .25 each.  It works fine but here’s the issue with what I see with the strategy.  Until you buy to close those options, technically your money is tied up in a long term play for very little money. Sure, the chance that Gap will drop to 21 is very small but you are obligating your money to 2100 for every contract.  So to make any real money you need to buy at least 10 to make even $250. That’s 21k to make 250, that’s a pretty big opportunity cost when you think about what might be possible with 21k in just one month. More risk, but that’s the point right? \n\nThe other issue I have observed is just what someone else mentioned. I’ll read about complaints of those puts never actually selling, as in no one actually wants to buy that same put so people sit on a silly small order and never executes. Just a bad play all around.  \n\nBest strategy is to consider a price where you think the stock is a great deal and it’s a stock you really want. For example IQ at $25 is selling for roughly 1.10 per contract in September. Sell 10 of those and your making 1k for a few months time.  If IQ drops below 25 then you own a stock that is arguably going to be a big winner in the long term for a price that many say is reasonable, if not a great deal. \n\nMaybe you already get this but it’s been something I’ve been thinking about since seeing this strategy proposed.", "score": 12, "replies": []}, {"body": "Did you follow the news about what happened to Broadcom (AVGO)? The stock took a 19% intra-day drop. This is a stock that has a market cap >$100 billion. Point is, nothing is truly risk-free. ", "score": 22, "replies": []}, {"body": "Random news that can destroy you permanently . Avgo July 13 put was up 22700% after the buy out news ", "score": 8, "replies": []}, {"body": "I probably come as close to the outlined strategy as anyone that has replied. I sell 10 Delta, sometimes 5 Delta options all the time. The AAPL Aug 160 put is about 3 Delta.\n\nReturns tend to be modest. Margin requirements can be substantial. Tail risk is real. Most recent big loss was selling some way otm Tesla puts after the pop up on production news. More news came out and the stock was down 20 percent in three days. I took huge percentage losses on several legs.\n\nOverall the odds are in favor of the put seller, or at least have been. If we see a trending bear market, put selling will be among the worst possible strategies. Those on leverage may see their accounts disappear.", "score": 5, "replies": [{"body": "Have you ever done analysis to see where there was a correlation between your big losers and historical volatility or average true range as a percentage of price?\n\nI'm curious since TSLA is prob one of the most volatile stocks I know in terms of a % day movement. There are plenty of others that will have high IV but nowhere near the daily fluctuations that TSLA sees.\n\nDo you ever sell shorter expirations? I know it gives you less leeway to roll but you collect theta faster and because of shorting holding time, less risk of a black swan event. ", "score": 1, "replies": [{"body": "No haven’t look at that data. Crap happens. Another big recent loser was when Steve Wynn was forced out of the company, stock fell over 15 percent in a short time period. Sometimes news comes out of a clear blue sky. I remember Boeing dropping 10 percent in minutes, on a government investigation. I got assigned on Chipotle when one of the food scares happened 45 minutes before the close on expiration day. Trade long enough and the worst case will happen eventually. Don’t YOLO on this stuff, because your number will come up. \n\nIV for Tesla was recently in the 60 range for most expirations. Sometimes I sell the earlier expirations. However, gamma risk is high. The biggest losers have often been these one or two week options far otm. As I said, tail risk is real. There is a rational reason IV is high on many underlyings. It isn’t free money, 95 percent chance means 5 percent losers. A few of the losers are 10 times or 20 times the premium collected. Worst might have been like 30 times on some cheap front week options. \n\nLaw of large numbers means the odds even out over time. Small positions, significant reserves, taking losses are risk management tools. That said if the market goes wacky, losses are still going to happen. If a trending bear market comes, put sellers are going to be hurt real bad. Those that refuse to take losses may see their losses snowball down the hill. Those on heavy leverage may be wiped out. Rule #1 is to live to trade another day.", "score": 1, "replies": [{"body": "Wow gees. Just holding a week or two, I wouldn't have expected there to be much chance of an event occurring in that time period. Crazy.\n\nTotally with you on the last paragraph. Always carefully watching my leverage and never going into margin.\n\nThanks for the insight and sharing your experience. ", "score": 1, "replies": []}]}]}]}, {"body": "Because collecting $0.22 on a $160 stock for a month out is a fucking ridiculously low return.\n\nGo ahead and do it. You'll probably make money. But your return will be so fucking garbage lol.", "score": 5, "replies": []}, {"body": "Better (read: safer) strategy. Buy the securities and keep selling calls OTM and collect the premiums. You win either way even if it hits. MU has been great for this. You can re-load the dips and keep doing covered calls.", "score": 4, "replies": [{"body": "Selling cash secured puts has the same profit/loss diagram, but uses less buying power. The benefit of covered calls is maybe collecting dividends. ", "score": 1, "replies": []}]}, {"body": "You can probably try to sell the put, but it might not actually execute. Just look at the volume and interest. It's extremely low. Also it's usually never a good idea to sell naked puts.", "score": 12, "replies": [{"body": "Aren’t all puts you sell naked? I know a naked call is when you don’t own the underlying, but when selling a put, the “risk” is that you’ll have to buy the underlying, so how could it not be naked?", "score": 2, "replies": [{"body": "Naked meaning you don’t have the cash to cover if it gets exercised. If you have the cash you’re selling a cash covered put.", "score": 6, "replies": [{"body": "If you have like 500,000 in your account, can you just sell relatively\nUnlikely puts and cover them for like 10% return yearly? ", "score": 2, "replies": [{"body": "It works until it doesn’t ", "score": 11, "replies": []}, {"body": ">If you have like 500,000 in your account, can you just sell relatively\n>Unlikely puts and cover them for like 10% return yearly? \n\nWith a 22 cent premium on a $190 stock, you're looking at closer to 2% return yearly. Similar rate with less risk using a savings account. ", "score": 1, "replies": []}]}]}]}]}, {"body": "The risk is disproportionate to the reward.  Say you sell a .10 put with a 99.5% probability of expiring OTM.  With the margin requirement, let's say you're tying up 5000.00 to make that 10.00.\n\nThen someone flys a plain into a building, ot Trump speaks.  Even if the price drops to nowhere near your strike, all of the sudden it could take 500.00 to close the position.  Or you wait it out and now, as the price continues lower, it might take 2000.00 to close.\n\nAnd again, you're trying to make 10.00.", "score": 10, "replies": [{"body": "You keep the premium of it end up out of the money, so I don’t understand why you would have 5000 tied up if the premium if 10?", "score": -5, "replies": [{"body": "Lets say you have a 99% chance of making 10.00.  And you do the trade 100 times.\n\nYou could make 99x10.00 or 990.00.  And you'd (mathematically) lose up to 5000.", "score": 7, "replies": []}, {"body": "Because they tie up the money you will need to cover the loss if your bet is wrong. ", "score": 2, "replies": []}, {"body": "Buying power reduction. ", "score": 1, "replies": []}]}]}, {"body": "The issue is you'll barely sell them for pennies if they are that close to expiration and OTM. Also because no one is willing to buy them", "score": 2, "replies": []}, {"body": "I like far month short contracts. More vega and more credit, less gamma risk and wider deltas; I’ll take vega over theta any day. ", "score": 2, "replies": []}, {"body": "low volume, and usually bad risk reward", "score": 2, "replies": []}, {"body": "What about doing this on an index like SPX or NDX? They rarely suffer from large one day drops. ", "score": 2, "replies": [{"body": "except it only takes 1 \"rare\" event to make you lose everything you gained+more.", "score": 1, "replies": []}, {"body": "It’s pretty much the same concept ", "score": 0, "replies": []}]}, {"body": "By far, the biggest open interest on the Aug 10 puts is at $155 and $165. About 100 times that of the nearby strikes. A large spread, perhaps?", "score": 1, "replies": []}, {"body": "I do this. Rather successfully. Need a bunch of collateral. Look into credit spreads. Liquidity is going to be your main issue that deep OTM. PM me if want to talk further about it. Gonna get nothing but broke ones on here.", "score": -1, "replies": []}]}
{"title": "What names is everyone trading today?", "selftext": "So far pre-market there is a lot of movement. Some of the top movers pre-market we've picked up can be found below.\n\nWe're neither bullish nor bearish on JPM & PNC at this point, but we favor banks like ZION, and BBT\n\nWe view EXPN & AAPL very favorably due to its high quality and value metrics. \n\nAnyone trading off the news?\n\n* **Apple Inc (AAPL)**  will be investing $300 million into a renewable energy fund, which will  seek to provide significant renewable energy resources to China in four  years\n* **AT&T’s (T)** $85 billion merger deal with **Time Warner Inc. (TWX)**  will be appealed by the US Department of Justice. In June\n* **Johnson & Johnson (JNJ)** has  been ordered by a Missouri jury to pay $4.7 billion in damages to 22  claimants, who blame asbestos in the company’s talc-based products as  the cause of their ovarian cancer \n* **JPMorgan Chase (JPM)** reported  2Q2018 EPS that was higher than the consensus ($2.29 vs $2.22  projected). Shares of JPMorgan are trading 0.42&#37; higher to $107.30  pre-market following the earnings beat\n* **Kellogg’s (K)** Honey  Smacks cereal is being recalled from retail stores by the FDA\n* **McDonalds (MCD)** is down 1.06&#37; pre-market to $157.44 after the Iowa and Illinois health departments announced that they are investigating more than 100 cases of cycolspora infections\n* **PNC Financial Services’ (PNC)** stocks  is up 1.43&#37; to $139.97 before the open, after the company posted 2Q2018  EPS that was above expectations ($2.72 vs $2.57 forecasted) \n* **Walmart (WMT)**  has denied recent rumors that the company is considering selling its  Japanese supermarket chain Seiyu, which operates more than 300 stores  across Japan\n* UK information services firm **Experian Plc (LSE:EXPN)**  announced that revenue grew 9&#37; Y/Y in F1Q2018, led by strong organic  revenue growth in North America (+11&#37; Y/Y). Growth in North America was  driven by the company’s acquisition of Clarity Services. Shares of  Experian are trading 0.03&#37; higher to £19.20", "id": "8yjsds", "created_utc": 1531487030.0, "score": 64, "upvote_ratio": 0.87, "num_comments": 46, "comments": [{"body": "These are for kids. I play with high risk Pharma stocks because I love the volatility.", "score": 78, "replies": [{"body": "How do you make your decisions in Pharma stocks? We apply our Quant models to Biotech/Pharma stocks some of which you may trade.. we really like Zoetis, Abbvie, Ligand, Corcept, Depomed, Phibro just to name a few.", "score": 17, "replies": [{"body": "He buys the stocks with the coolest names.", "score": 60, "replies": [{"body": "Some stock nerd, please list the 60 coolest names in alphabetic order. I’ve got some money to invest, looking for high risk, high reward, but most importantly - sweet stock abbreviations", "score": 11, "replies": [{"body": "RUN is my favorite. It also likes to go on ridiculous runs. So that's a bonus. ", "score": 6, "replies": [{"body": "Damn, sounds good, I’m in. What’s the company do?", "score": 1, "replies": [{"body": "They are a solar energy provider based out of California. In January it was trading below 6. It's been flirting with 16 dollars for a week now and it recently had its price target upgraded (again) to 22 dollars. Another good renewable stock with a less exciting acronym is ENPH. It's had a pretty incredible year as well.  ", "score": 5, "replies": [{"body": "I’m so long ENPH", "score": 4, "replies": []}, {"body": "Sounds good, thanks alot. Got any more good renewable energy stocks? I’m real big on that", "score": 2, "replies": [{"body": "The only other renewable I'm invested in it TERP (TerraForm Power) They pay a decent dividend and have been switching strategies to focus on long term growth. I actually heard about them on one of last weeks episodes of industry focus, which is a podcast put out by The Motley Fool. Give it a listen for a good background. Just bear in mind that I am by no means an expert. In fact I haven't been investing for that long either. So take everything I tell you (or anyone on reddit for that matter) with a huge dose of skepticism. ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Ha!  Abbvie has been a top stock idea for us the last few months. Not too risky!\n", "score": 3, "replies": []}]}, {"body": "With Zoetis being $85/share, I'm assuming you swing trade over a couple days and profit of a dollar or two of movement over that time? Seems to me you have need a million bucks to buy enough shares to make any real money from that dollar or two movement. Is this right? Am I missing something?", "score": 2, "replies": [{"body": "You can trade on margin...", "score": 1, "replies": [{"body": "Fair enough. Makes sense. Thank you.", "score": 1, "replies": []}]}, {"body": "You are missing something, a 5&#37; increase on a $100 stock is the same as a 5&#37; increase on 100 $1 stocks", "score": 1, "replies": [{"body": "Money. They are missing money. ", "score": 1, "replies": [{"body": "How would you know?", "score": 1, "replies": []}]}]}]}, {"body": "Not sure... I rode $AMPE from 50 cents to 4 bucks and now I am short the same stock 😹\n\nI just keep digging for info and take a position.", "score": 1, "replies": []}]}, {"body": "$ROPE", "score": 2, "replies": []}, {"body": "Bitcoin cash for me my friend. I also like to live dangerously. ", "score": -1, "replies": []}]}, {"body": "$HMNY cause I felt like losing some money today", "score": 15, "replies": [{"body": "What happened to HMNY? It fell off the face of the planet almost over night", "score": 1, "replies": [{"body": "I mean...Moviepass business model has never been sustainable...", "score": 2, "replies": []}, {"body": "Shorters happened I guess", "score": 1, "replies": []}]}]}, {"body": "I've been riding AMD all year. It's been volatile at times, but has done really well.", "score": 8, "replies": []}, {"body": "Always $SPY", "score": 5, "replies": []}, {"body": "Pennies", "score": 2, "replies": [{"body": "Pennies add up when you have a lot of them...", "score": 5, "replies": [{"body": "Indeed they do!", "score": 3, "replies": []}]}]}, {"body": "CEI is making a fucking run for it. ", "score": 2, "replies": []}, {"body": "Scalped 4% on a bunch of $BJ shares. Holding a few hundred to see where this recent IPO goes. I like the runway.", "score": 2, "replies": []}, {"body": "What do you use to watch pre-market data? Also, I’m not trading so much, but I’m working on getting into visa right now ", "score": 2, "replies": []}, {"body": "got some CSCO at 41.5 after the amazon news. Think it's oversold a bit", "score": 2, "replies": []}, {"body": "Welp, I bought some Netflix last night and that was apparently NOT the move", "score": 2, "replies": []}, {"body": "Anything and everything because of the follow-through day yesterday", "score": 1, "replies": []}, {"body": "sold all positions of DVMT ", "score": 1, "replies": []}, {"body": "Trading? TRCH has had fairly regular drops and spikes all year, right now is a good time to get in low and wait for a 15¢ swing (shooting for a 10% profit here myself)", "score": 1, "replies": []}, {"body": "Anyone in CPAH? ", "score": 1, "replies": []}, {"body": "$PBH to $45", "score": 1, "replies": []}, {"body": "Watt", "score": 1, "replies": []}, {"body": "Sold my position in KDP this morning. Made a 4.5% profit in 2 days, but I’m not long on the stock so I got out. I’ll watch it for now and might get back in at a later date.", "score": 1, "replies": []}, {"body": "ENPH", "score": 1, "replies": []}, {"body": "BBW! I preached this stock once before (a couple weeks ago) and look at it today! It’s finally broken up and could hopefully continue a nice bull rally. This company is still so undervalued.", "score": 0, "replies": []}, {"body": "🤷‍♂️ I use betterment so they give me a portfolio and invest for me....need to get some free time so I can learn how to do the stock market properly", "score": -9, "replies": [{"body": "You have been banned from /r/wallstreetbets ", "score": 12, "replies": []}]}]}
{"title": "Is AMD poised for a long term breakthrough?", "selftext": "AMD has had a very strong year, and even Intel has said they plan to lose market share to them in the near future. Is this a temporary gain? Will Intel's next round of offerings next year put them back in their place, or is AMD actually at a relatively even footing, even long term? ", "id": "8yfjhj", "created_utc": 1531443930.0, "score": 36, "upvote_ratio": 0.76, "num_comments": 43, "comments": [{"body": "So what I'm gathering from this thread is that I should buy more or keep the shares I already have? ", "score": 15, "replies": [{"body": "Donate them", "score": 6, "replies": []}, {"body": "Yes", "score": 2, "replies": [{"body": "Pls no ", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Neither AMD  nor NVIDIA do any sort of computer manufacturing. They are both fab-less design houses.", "score": -3, "replies": [{"body": "Not sure why the downvotes but there is there is a world of difference between fabless-design and manufacturing. It's in our interest to understand the difference.", "score": 1, "replies": []}, {"body": ">Neither AMD  nor NVIDIA do any sort of computer manufacturing. They are both fab-less design houses.\n\nso which one?", "score": 0, "replies": []}]}]}, {"body": "It has come as close as it ever does. Every few years AMD gets a small advantage and it trades up for a few months, then it settles back down. I would not bet the farm on it, but I could always be wrong.\n\nAMD traded under $5 from 2012 to 2017. It has had a good run already, but to go much farther would take a lot.\n\nRight now they have a good CPU to compete with Intel (happens every few years) , and a decent graphics chip, but they are always in the shadow of Intel and NVidia. Micron also graphics and a new type of memory chip that is smaller and much faster, but it is also going down now.\n\nChips are a tough business, you have to look at whole market, not just one company.", "score": 21, "replies": [{"body": "Intel is now working against the laws of physics though, diminishing returns on fabrication shrinks means you get less and less performance for more and more money.  This is a far stretch from Phenom ii vs Sandy Bridge days, Sandy Bridge was about the last large jump we will have, back when AMD was bumbling with the FX bulldozer.\n\nAt least until they figure out Graphene or Gallium.", "score": 7, "replies": [{"body": "There is a clear path toward 5nm but Intel is currently having problems at a node that other fabs have cooked. Moving to gallium-arsinide transistors isn't so much a technical challenge as it is a cost challenge. I understand the material to be prohibitively expensive. ", "score": 2, "replies": [{"body": "Its a heat challenge.  As far as 5nm I dont expect huge performance gains, the last real jump was from Haswell to Skylake when they simultaneously introduced DDR4, since then its been small boosts in frequencies while disregarding TDP.", "score": 1, "replies": []}, {"body": ">There is a clear path toward 5nm but Intel is currently having problems at a node that other fabs have cooked. Moving to gallium-arsinide transistors isn't so much a technical challenge as it is a cost challenge. I understand the material to be prohibitively expensive.\n\nbut  could it bring benefits?", "score": 1, "replies": []}]}, {"body": "AMD is not building chips, they are a fabless company.", "score": -4, "replies": [{"body": "Why is this down voted. It is factual. They are not building chips. They have been outsourcing them to Samsung and other companies.", "score": 1, "replies": [{"body": "Who said they were making the chips?", "score": 1, "replies": [{"body": "AMD...https://www.google.com/amp/s/www.forbes.com/sites/patrickmoorhead/2016/07/25/amd-diversifies-14nm-manufacturing-with-samsung/amp/", "score": 1, "replies": []}]}]}]}]}, {"body": "For the past 5 years AMD has no good CPU to compete with Intel. Coupled with its fab partner losing out in the shrinking game. The reason why AMD is hyping up is because it finally has a decent product to compete with Intel. It's superior architecture allows it to increase core counts with little impact to latency , of course it's IPC performance is no way close to Intel but Zen 2 seems to working towards addressing this issue. Coupled with the ability to partner with GF, TSMC and even Samsung. Finally, AMD is in a good position to compete with Intel. No way it's as simple as \"ups and downs\" as you put it. \n", "score": 10, "replies": []}, {"body": ">they are always in the shadow of Intel and NVidia\n\nwhy?", "score": 1, "replies": []}, {"body": ">Micron also graphics and a new type of memory chip that is smaller and much faster, but it is also going down now\n\nfor example this is  athing I can't explain", "score": 1, "replies": []}]}, {"body": "Based on technicals, it broke out of the 9-16 box range and now 16 which was former resistance is now acting as support. A measured move to 23 is expected. ", "score": 26, "replies": []}, {"body": "You can buy 1 month out options, 100% gains look likely.\n\nIt just made a great move today and support would be $15.25", "score": 6, "replies": [{"body": "What option would you recommend? ", "score": 1, "replies": [{"body": "I only recommend the one I am going on. I don't like it that much to make a plan for it. The NFLX/AMZN plans I posted are better.\n\nAug 17 options with highest volume and close to the money.\n\nThis comes up under a 0.9 in my system so I wouldn't enter but it's still strong.", "score": 1, "replies": []}]}]}, {"body": "AMD i freaking love those 3 letters.  Intel stock already made me back shitloads of money.  AMD also made me good dough and soon I will throw $10k at AMD.", "score": 8, "replies": []}, {"body": "Technicals on the daily look really good for  some continuation. ", "score": 7, "replies": []}, {"body": "Tell me when Amd is the worst company ever and has no long term prospects ... then I'll invest. Seriously, the optimism around amd is insane. I intend to wait until optimism turns into pessimism & there financials look good", "score": 2, "replies": []}, {"body": "Yes.", "score": 1, "replies": []}, {"body": "No short it now ", "score": 0, "replies": [{"body": "Why", "score": 3, "replies": [{"body": "Because someone has to be the schmuck getting incinerated by the afterburners of Lisa Su's Lunar Rocket.", "score": 8, "replies": []}]}, {"body": "Yes, why ", "score": 2, "replies": []}]}, {"body": "Because sue is fixing to drop some bad news ", "score": -1, "replies": []}, {"body": "It is possible AMD will breakout, but it is also possible it won't. ", "score": -1, "replies": []}, {"body": "Crypto miners are dumping their used cards. Trains over. ", "score": -4, "replies": [{"body": "Source?", "score": 1, "replies": [{"body": "Source: His own shit experiences. His post shows signs of loss, self-bitterness, a possible Steam user looking for a GPU upgrade excuse for Mom’s MasterCard privilege. A little harsh and stupid. Humor me. ", "score": 12, "replies": [{"body": "Humor you? You’re the one providing the humor 😂", "score": 2, "replies": [{"body": "I wonder if you wanted to click on \"context\" and maybe review your statement. If not, hit the school and listen to your English teacher once again. ", "score": 1, "replies": [{"body": "Adults can’t hit the school for a refresher", "score": 1, "replies": [{"body": "You can. I guess Reddit is passive way anyways. Either way, you sort of misunderstood, is all I was tryingto say, maybe in a little shitty way, sorry for that. ", "score": 1, "replies": [{"body": "I was honestly giving you a compliment. You were making me laugh, hence delivering the lulz", "score": 1, "replies": []}]}]}]}]}, {"body": "Source is experience in the community. \nAs for Hx its empty you twat. You're just a bag holding fool making shit up. \nThough I do enjoy steam. ", "score": 1, "replies": []}]}]}]}]}
{"title": "Netflix crashing in premarket. UBS and Deutsche are crooks. I lost everything :( (Including 3500 on margin) They want their clients to get a cheap pre-earnings price.", "selftext": "[deleted]", "id": "8yjosp", "created_utc": 1531486177.0, "score": 2, "upvote_ratio": 0.54, "num_comments": 48, "comments": [{"body": "1% and it’s crashing? Boi you one real autist", "score": 46, "replies": [{"body": "Thought the same. Tf did OP buy that lost him 3500 on a 1% dip on margin no less.\n\nYou the king of autists OP!", "score": 13, "replies": []}, {"body": "Went all in on 7/13 $415 calls hoping for small increase", "score": -15, "replies": [{"body": "No one on this sub will be empathetic to your losses when you make retarded trades like that", "score": 25, "replies": []}, {"body": "You have a gambling problem buddy.\n\nI'm dead serious.\n\n", "score": 10, "replies": [{"body": "I really did not expect this. Fuck. ", "score": -2, "replies": [{"body": "Expect? What. The. Fuck. What do you mean expect? This is gambling. Get help. ", "score": 9, "replies": []}, {"body": "You are playing with options that's the risks you take dumbass.\n\nYou know what you signed up for when you play short term expiration crap. It's always like this. Its never straight up Everytime you enter a short term trade dipshit.\n\nIf it were that easy everyone would be rich.\n\nIt's a god damn bull market and it's amazing that folks are necking themselves left and right going all in on short term options\n\nLearn what risk management before you end up back on the corner street begging for change. ", "score": 8, "replies": []}]}]}, {"body": "theyre called fds for a reason man. ", "score": 3, "replies": []}, {"body": "Have to be careful with hit pieces. Clear raid in progress with earnings next week. \n\nStill have all day though. Good luck\n\n", "score": 1, "replies": [{"body": "What do you mean. It is down on high volume and 1.5% in premarket. There is no hope.", "score": 2, "replies": []}]}]}]}, {"body": "POSITIONS/SCREENSHOTS OR BAN  \n  \nEdit: YOUR EDIT DOES NOT SATISFY MY DEMANDS", "score": 13, "replies": []}, {"body": "So you put all of your money on black and it came up red and it's someone else's fault. \n\nYou gambled and lost sorry", "score": 21, "replies": []}, {"body": "There’s no manipulation, you’re just retarded. Who the hell goes all in on 1 stock the week before it’s earnings? Instead of trying to make up excuses analyze this mistake and take this as a lesson on what not to do. ", "score": 7, "replies": []}, {"body": "Hang on, wasn't this the guy making weekly predictions of what's going to happen to the indexes? Fucking LOL!", "score": 7, "replies": []}, {"body": "“They want their clients to get a cheap pre-earnings price”  🤭 no body tell him", "score": 9, "replies": [{"body": "Tell me what lol", "score": 1, "replies": []}]}, {"body": "Bro, money isn't everything. ", "score": 4, "replies": [{"body": "Yeah but have you ever bought faggies? Its like a damn addiction its so fun", "score": 5, "replies": [{"body": "You have to not care about money to buy faggies.", "score": 6, "replies": []}]}, {"body": "Money isn't everything but it can buy just about everything ", "score": 1, "replies": []}]}, {"body": "cant be upset when you lose on 1 day options", "score": 4, "replies": [{"body": "I cant afford anything longer on this stock. ", "score": -1, "replies": [{"body": "Then you should go find a job you poor fuck.\n\nInstead you are playing scratch offs", "score": 10, "replies": []}]}]}, {"body": "You'd be better off getting lotto tickets. It takes longer to scratch off your way through a few g's.", "score": 3, "replies": []}, {"body": "Crashing? My sweet summer child. In 2010 I ate a can of tuna fish for every meal, I was forged in a crash...this is nothing.", "score": 5, "replies": []}, {"body": "what's your break even price?  1% move in this isn't uncommon", "score": 2, "replies": [{"body": "I bought 10 for $2.36", "score": 1, "replies": [{"body": "Haha they are worth $0.23 now\n\nF", "score": 4, "replies": [{"body": "Sold at .52", "score": 3, "replies": []}]}]}]}, {"body": "Dude, come on.  It's still up 100% for the year with this pullback.   These analysts always pull this crooked shit, have to be prepared for it and give yourself a little time, especially heading into earnings.   They were pumping it pretty hard right before this.", "score": 2, "replies": [{"body": "Fucking crooks man. Im gonna start doing spread only. Fuck this.", "score": 1, "replies": [{"body": "Yeah today hurt.   Makes me more bullish though now that some froth is off.   Tempted to double down but probably will just hold what I have and see what Monday afternoon brings first.", "score": 1, "replies": []}]}]}, {"body": "When did u buy these fds", "score": 3, "replies": [{"body": "Yesterday at $412", "score": 2, "replies": [{"body": "This isn't even an FD, it's a gloryhole AIDS party", "score": 9, "replies": [{"body": "Yep.", "score": 1, "replies": []}]}]}]}, {"body": "Stop gambling.", "score": 3, "replies": []}, {"body": "In terms of Elliot wave theory, $NFLX is in a 4th wave and is going back to around $380 before it can go back up to complete the 5th wave, which should be around $450. \n\nDisclaimer: if you believe that, I’ve got this awesome bridge you can lease from me", "score": 2, "replies": []}, {"body": "Rip ", "score": 1, "replies": []}, {"body": "Me on STZ ER. We all do it. Maybe not this bad. But we do it.", "score": 1, "replies": [{"body": "How do you get back?", "score": 2, "replies": [{"body": "Right now I'm using MSFT to get most of it back... As long as earning go well I should be back where I was. When it happens to me.. I usually take a little break and wait until I find the next thing I feel STRONGLY about. Strongly enough to deposit more and try again.. and I have been trying to diversify.. don't throw your eggs in one basket and use hedges. That really makes a difference for me.", "score": 1, "replies": [{"body": "Im afraid of buying empty calls now. ", "score": 1, "replies": [{"body": "I would possibly look into the earnings coming up. Do your research. Dpz is a great stock. I would honestly put it in alongside things like msft in terms of growth. I was going to play DPZ earning I just bought calls to early and had to back out and get msft for gains. But it might be a good play now. I'm personally gonna check it out.. just keep reading and watch what you like before you buy and if it gains momentum in the chosen direction take a shot. That's what I do.. good luck!", "score": 1, "replies": []}]}]}]}]}, {"body": "To be fair, it’s been crashing all week without the UBS, they just helped it plummet yesterday. ", "score": 1, "replies": []}]}
{"title": "NFLX down", "selftext": "[deleted]", "id": "8ylai8", "created_utc": 1531498396.0, "score": 13, "upvote_ratio": 0.89, "num_comments": 37, "comments": [{"body": "Watch from the sidelines. 2spooky4me", "score": 41, "replies": [{"body": "I told myself I'll buy some 8/17 calls if it drops under $400 again but here I am, being a pussy.\n\nMight man up by end of day. We'll see. I just don't see them meeting the high run-up expectations since last earnings.", "score": 6, "replies": []}]}, {"body": "NFLX goes up, NFLX goes down, you can't explain that!", "score": 21, "replies": [{"body": "Big if true.", "score": 2, "replies": []}]}, {"body": "Idk why you guys always want to bet on earnings, it's just pure degenerate gambling. \n\nJust wait for the next earnings run up. ", "score": 25, "replies": [{"body": "its the best way to catch a next day spike without doing any research. you have a 50/50 shot that they beat and shares jump. Thems good odds in my book", "score": 13, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Im going in on this 1 of each cause im poor", "score": 3, "replies": [{"body": "Did you hold on to both?", "score": 1, "replies": [{"body": "I did.  I also picked up a second set of equally otm calls for 7/27", "score": 1, "replies": []}]}]}]}]}, {"body": "“Degenerate gambling” on a sub called wallstreetBETS? That’s unpossible ", "score": 5, "replies": []}]}, {"body": "I just can’t stay away. Got out of AMZN and in for 10 $450c expiring next Friday. Will things go well? Find out what happens on next weeks episode of Dragonball Z", "score": 11, "replies": [{"body": "STAY TUNED FOR SCENES FROM OUR NEXT EXCITING EPISODE OF\n\nA\n\nM\n\nZ\n\n^^^^^^n", "score": 9, "replies": []}, {"body": "450 next week?  I love me some NFLX but even I’d probably be willing to sell those to you...", "score": 9, "replies": [{"body": "Just here to make some money on the pop, don’t care if it actually gets to $450 ", "score": 3, "replies": [{"body": "Who is going to buy them from you though....? The IV on them is more than 80%. How do you plan to save your premium after earnings? I have so many questions.", "score": 4, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I checked after I made the comment. I am just surprised there are people buying it. Maybe I am retarded.", "score": 3, "replies": [{"body": "Maybe we’re all a little bit for even going with NFLX but I’m sticking with them and whatever happens happens ", "score": 2, "replies": [{"body": "I’m with you. So my 7/20. 410/420 call debit spread has a chance ", "score": 2, "replies": [{"body": "I feel good about it. Let’s go", "score": 2, "replies": [{"body": "what a time to be alive", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "wow u can afford AMZN shares?", "score": 1, "replies": []}]}, {"body": "They will beat earnings. Trust me they're huge expanding into international markets, next quarter will be rough with people making their own streaming tho", "score": 7, "replies": []}, {"body": "BTFD", "score": 4, "replies": [{"body": "https://reddit.app.link/todbU66ywO", "score": 0, "replies": []}]}, {"body": "Downgraded yesterday.  2 downgrades today.  Hopefully a blessing so it can go moonbound next.  ", "score": 4, "replies": []}, {"body": "Holding 160 shares and I’ll buy more if it dips. ", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "4-5% is not a dip the highest I ever paid for NFLX was $335 ", "score": 1, "replies": []}]}, {"body": "https://youtu.be/TpCb3xjh-Kk?t=3m59s", "score": 1, "replies": []}]}, {"body": "Lost $100 on FDs. I just bought shares instead like a normie", "score": 2, "replies": [{"body": "At least it wasn’t 1,000", "score": 2, "replies": [{"body": "For real. My real autism lies in AAPL 8/17 195-210s", "score": 1, "replies": []}]}]}, {"body": "I held on to 5 short iron condors that were expiring today, should’ve just closed them earlier like the other 5 I had but I’m a greedy bastard and just had to collect that sweet sweet premium and bask in the feeling of cucking whoever was on the other side of that trade. Didn’t see a 4% drop coming, fucking Deutsche... Ended up losing about a thousand dollars oh well. \n", "score": 1, "replies": []}, {"body": "i bought 2 425.00 C today \n\nhow fucked am i", "score": 1, "replies": [{"body": "Maybe I’ll buy puts. Seems people been losing money left and right on NFLX. Not convinced it’s going to go up.\n\nOr maybe I’ll just go all in on a couple 2,000 AMZN 2/15 calls. I’m pretty sure I’d make a fortune...", "score": 1, "replies": []}]}, {"body": "\"we are a profitable company.. we have nothing to do with this...\"", "score": 1, "replies": []}, {"body": "Tried to tell people https://reddit.app.link/todbU66ywO", "score": -8, "replies": [{"body": "you mean when it was at 360?  You're a fucking genius", "score": 5, "replies": []}]}]}
