{"title": "ULTAmate DD: Betting 6k with a bias against ULTA on National women's day!", "selftext": "[deleted]", "id": "5yah1s", "created_utc": 1489005673.0, "score": 93, "upvote_ratio": 0.9, "num_comments": 78, "comments": [{"body": "Most of those comments are all positive about Ulta, I like the extra effort though. ", "score": 20, "replies": [{"body": "Yes positive, but shopping wise more girls seem to be at sephora. ", "score": 12, "replies": [{"body": "Why not just ask them about their projections of the two stores? ^^^^/s", "score": 7, "replies": []}, {"body": "They're completely different stores tho :(", "score": 2, "replies": []}, {"body": "Is this from subjective or personal experience OP?", "score": 1, "replies": [{"body": "I should have just asked you guys. You're all more girly than anyone at r/askwomen", "score": 29, "replies": []}, {"body": "He surveyed r/ask women ", "score": 1, "replies": []}]}, {"body": "Why i didn't listen to you? I won't ever doubt you again god of stock", "score": 1, "replies": []}]}]}, {"body": "Excellent post", "score": 15, "replies": []}, {"body": "Gonna reverse you tomorrow. Thanks for the DD fam ", "score": 15, "replies": [{"body": "You selling straddles?", "score": 3, "replies": [{"body": "He's not going to, lets be honest.", "score": 4, "replies": []}, {"body": "im going to reverse ur calls by buying puts -wsblogic", "score": 0, "replies": []}]}]}, {"body": "I went ELF", "score": 12, "replies": [{"body": "Congratulations faggot, up 14% after-hours", "score": 8, "replies": [{"body": "thx bby", "score": 5, "replies": []}]}]}, {"body": "Commenting this to check on later to either say congrats fag or congrats fag.", "score": 12, "replies": []}, {"body": "Obligatory inversing comment", "score": 11, "replies": [{"body": "Sell all of those same options at those strikes, naked. I dare you", "score": 8, "replies": [{"body": "Is there a guide to do this on RH", "score": 30, "replies": []}]}]}, {"body": "congrats faggot", "score": 7, "replies": [{"body": "You delivered", "score": 3, "replies": [{"body": "I do what I can. Hella nice play.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Due diligence ", "score": 4, "replies": [{"body": "don't be mean and trick him with something legitimately plausible\n", "score": 4, "replies": []}]}]}, {"body": "[removed]", "score": 10, "replies": [{"body": "I'm certainly aware of IV crush and it was probably stupid of me to dumb it all down. Kind of rushed the post out. I probably have more of a chance to lose half my money, but far from worthless Friday. Even at that, there is money to be made from a large move and that's exactly what I'm betting on", "score": 2, "replies": []}, {"body": "This is why I don't buy around earnings, crush is killer.  Much better to sell, collect premium then buy back cheap", "score": 2, "replies": [{"body": "I've had a lot of success earnings in the past, and pretty much understand Ill lose at least half my money if it doesn't move. Maybe finally it will hit me in the face", "score": 1, "replies": []}]}, {"body": "Hey I'm going to make money tomorrow", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Trading in the range where it hurts most.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm holding all mar 31st's still, deciding what to do. -5300", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Correct. I'm not entirely stupid, luckily. Only can hope. ", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "No, that's spot on. I looked into the concept yesterday when I rolled my positions. I got the time value bonus and basically discounted IV", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Nice work and goodluck!", "score": 5, "replies": []}, {"body": "i love this trade. i was going to just go long if it was red today but the comeback to 275 made me reconsider. i think it will move into mid 280s on a big beat, and drop 12-20$ on a bad report as it did last august. its at the same peaks from last august right now.\n\ni will have to look at those trades and see how well the setup works for me.\n\nquestions\n\n1 - are you not selling any puts or calls even further out?\n\n2 - dont you think that thread, although really proactive, is a little misleading? ulta is the cheaper and more common store. also ulta is the more well known store.  ive been shopping at ulta for 5 years + and only heard of sephora a cpl years ago. you arent even considering men. i understand you dont think they are into this stuff... but thats not accurate. i think alot of guys like the high end soap and moisturizers. i know alot of guys go here for a 1 stop shop for gifts too. you cant go wrong dropping $300 on ulta for your lady, sister, mom, whatever.  \n\nalso i think everyone prefers sephora but that doesnt mean you can always go there. i like 5 guys more than mcdonalds but eat them both once a month.\n\nulta also has great online prices. cheaper than amazon and i dont believe they partner with amzn on many exclusive products. the members club is great as well.\n\ni just dont see it as 300$ tomorrow so i will probably straddle or do a 4 leg trade, with slightly more weight on the puts.\n\nalso prices are still extreme as fuck on the contracts. very tempting to just go super otm and sell a call spread. i really see it falling or blowing out (not sitting or slightly up), but even in a blowout it doesnt go up past 300 imo and it can fall 25 for sure on a big miss.", "score": 2, "replies": [{"body": "Lol that little survey was really just some icing for my insecurity. Not basing my trade off that really. As accurately as possible, with the internet, anecdotal evidence, and family as my only tools - this is the result. I think it's important we consider competitors like sephora and now ELF, which really showed off what online focus can do. Despite all three of those targeting different markets, it's good to look at their relationships to each other. I've been speculating selling some calls on it actually, especially with these premiums. Let me know what you end up doing tomorrow. ", "score": 1, "replies": [{"body": "On aug er it was down 20 during he day and closed down 12 I believe. Don't quote me. That was on a beat too if I recall.\n\nAnd I feel u. It's actually a really good idea to poll, just kinda hard to make it accurate and meaningful. \n\nWill post tomor if I see ulta threads n make a move.", "score": 2, "replies": [{"body": "> On aug er it was down 20 during he day and closed down 12 I believe. Don't quote me. That was on a beat too if I recall.\n\n> And I feel u. It's actually a really good idea to poll, just kinda hard to make it accurate and meaningful.\n\n~ */u/throwaaaaaaw*", "score": 2, "replies": [{"body": "Fuck....", "score": 2, "replies": []}]}]}, {"body": "cant do anything dude. premiums too much. dont want to waste money.\n\ni got one 260 put for next week so i have something to watch but i did not feel confident enough to make any plays.\n\npremium is so fucking juicy. id like to sell put and call spreads a month out or so, but the fear of a huge beat or market crash too good. dont want to foot the bill during macro instability and i think i can find a better trade elsewhere.\n\ngl tho. i expect a +5 and fall tomor on beat or a test of 250 over 2 weeks if miss.\n\ni just cant fuck with contracts that are 5-10 bucks. spreads OTM 10-15 $ and 2 weeks out seemed really nice tho. 5 to 1 payout, i considered buying. 20-25 $ out is 10 to 1 which is what i considered selling. strangles and straddles to expensive. selling a straddle seemed ok and buying far otm on each side.", "score": 1, "replies": [{"body": "That's some good stuff", "score": 1, "replies": [{"body": "prolly did fine with my put. how u make out? \n\nif it hits 250s ill consider calls @ 270 3 months out.", "score": 1, "replies": [{"body": "I moved into like 4500 in puts by the end of the day. soooo...", "score": 1, "replies": [{"body": "so cash money? strike xpy? ", "score": 1, "replies": [{"body": "I expect to be up 6k in the morning. Expiries not till the 31st", "score": 1, "replies": [{"body": "good shit man. FDs and monthlies would be cutting it close. last 2 drops it continued to go down for 2 weeks. just a heads up. if trump does some stupid shit u might get a bigger drop too. i dont see many signs of the rally around lately. \n\npost when u sell. nice nice. pce.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "https://www.reddit.com/r/wallstreetbets/comments/5xh5l5/comment/dei5uab?st=J01L0KON&sh=c281e85a\n\nI commented recently on that thread. I said that they will probably do well. Looking at a 33% earnings growth (from what I calculated). However, I don't think they'll beat the high ball estimate from the analysts. Thus, making the stock take a plunge at least 5%.\n\nAt the end of the day, I'll probably inverse myself and buy ATM call options tomorrow. I'm in a bind. I don't know what to do lmao", "score": 2, "replies": [{"body": "Pretty close my friend", "score": 1, "replies": []}]}, {"body": "What options trading app is that you're using?", "score": 2, "replies": [{"body": "Optionshouse", "score": 2, "replies": []}]}, {"body": "Gj broski", "score": 2, "replies": []}, {"body": "Sold my 17 shares at $80 total profit rather than holding thru earnings thanks to this post, thanks.", "score": 2, "replies": []}, {"body": "So what happened? I'm just starting to learn about options and trying to understand why this worked. I understand what he did but not why it worked. Can someone explain?", "score": 2, "replies": [{"body": "It didn't work.  He bought his puts too far out of the money.  I haven't bothered to check the prices on his against his price paid, but he's probably lost 80% or more.\n\nIf you're going to make a directional bet on earnings using options, using a spread helps a lot, because it offsets the volatility drop.\n\nTo simplify: he bought puts thinking it would go down.  It did not go down (and even when it was down in post-market, it wasn't down enough for him to make money).  Part of what drives option value is volatility, which drops after earnings.  This also cost him money.\n\nTL;DR: OP got fucked.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Half rip", "score": 1, "replies": []}]}, {"body": "You must not have a girlfriend - woman will let their electric get turned off before they skip buying the cosmetics they love... and Ulta is it. ", "score": 2, "replies": [{"body": "Ulta is the only place to buy cosmetics?", "score": 5, "replies": []}, {"body": "Girlfriend says she'd shop sephora but ULTA is more convenient in our area.", "score": 2, "replies": [{"body": "Same. She said sephora is higher end / more expensive but Ulta is ubiquitous and has both inexpensive and expensive lines. ", "score": 1, "replies": []}]}]}, {"body": "Enjoy the vig on those strangles! I went short 245/305 strangle. Last ER Ulta Smashed and the stock plummeted... ", "score": 1, "replies": [{"body": "Vig? \n\nMan, I'm too frightened to sell any form of options on something that can make huge moves on a whim. ", "score": 1, "replies": [{"body": "vig = the juice ", "score": 3, "replies": [{"body": "Juice mmmhmmmm", "score": 1, "replies": [{"body": "I'm happy, you're happy. See you when the bell rings. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Volatility crush is going to wreck your math, unless the stock actually does move 10%", "score": 1, "replies": [{"body": "Me math is bad, but let's hope for 10% my friend", "score": 1, "replies": []}]}, {"body": "to be perfectly honest, i don't think i have ever seen a ULTA store...walking around the mall, or wherever. i'm pretty sure i block it out of my mind because the stores simply do not exist in my life. \n\n..i should investigate this company more..", "score": 1, "replies": [{"body": "Honestly my dude I regret not getting into cosmetics stock earlier. Retail is down but women will always buy makeup. Look at ELF, they're relatively new and since being stocked in Ulta and Walmart that shit has literally boomed and broke expectations on the ER.", "score": 1, "replies": []}]}, {"body": "sell you some straddles sucker?", "score": 1, "replies": []}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I'll probably open up at least ~%100. You can probably expect that, but I rolled into Mar 31st's\n\nHoping for some more selling in the morning. Congrats my friend. See what you're up in the morning, but I wouldn't hold that 250 mar 17th over the weekend.", "score": 1, "replies": []}]}, {"body": "#", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": ">  obviously i buy a call \n\nlots u can do. buy calls. sell puts. buy shares sell calls over 38. just got to learn it man go find some vids or read.", "score": 1, "replies": []}]}, {"body": "> I break even at 280.50 or 270.50 as long as I sell FRIDAY.\n\nYoure stupid for assuming you break even at those points. IV is non-linear with time, around earnings. Your breakeven for March 10th will be around to 255 on the low side and 293 on the high.\n\n**TLDR : OP is placing something close to a strangle with a breakeven of 248 and 298 expiring March 17th.**", "score": 0, "replies": [{"body": "IV will drop about 50% post earnings. My post is misleading, we get it. \n\nI've adjusted my expirations to have less exposure to IV and with that IV crush factored in, the break even is closer to 265 and 285. \n\nI'm not stupid, just blew a post out of my rear in 10 minutes.", "score": 1, "replies": []}]}]}
