{"title": "A (better) DD on Trump brief today.", "selftext": "Throwing shade intentional. lmao only mentions 3M.\n\nMy notes from the call today. TL;DR at bottom for you illiterate degenerates.\n\nAnyways:\n\n* Movers\n   * Big pharma to visit WH Monday to discuss detection solutions, possibly vaccines.\n      * No name mentioned, just 'industry'\n      * Original meeting was to discuss lowering pharma costs (so Trump said).\n   * 3M contracted for 35M more masks. Markets may have reacted to this Friday (see: [https://ibb.co/nrP5n1y](https://ibb.co/nrP5n1y)). Hard to say. I just like pretty pictures don't @ me.\n   * Travel bans and restrictions announced, more considered. Airlines gonna be hurting.\n* Markets\n   * \"Fed should be doing more\".\n      * Wants lower rates for us, as well as to refinance debt for a better rate.\n      * Compared us to other countries with lower rates.\n      * No specifics mentioned outside of doing more, lowering rates.\n   * This is just a funny side note: 10 minutes later, responding to another question, Trump said market will take care of itself. lmao\n   * Asked directly about gov't intervention (i.e., tax cuts). NO TAX CUTS to accelerate market.\n      * Declined to say they were considering anything not already announced (read you idiots: priced in) such as the middle-income tax later this year.\n* New travel restrictions\n   * Travel BANNED from Iran\n   * Travel advisory level 4 (highest) from parts of S. Korea and Italy (where infected people are duh).\n      * Also talking to those gov't about medical screening for incoming travel.\n* Virus Specifics\n   * lmao don't be around sick people.\n   * Will see more cases.\n   * Literally said \"Do not panic\".\n   * Honestly seems like they're making serious efforts to contain it. We'll see how it plays out in practice.\n\n&#x200B;\n\nSummary\n\nLong or short big pharma, who fucking knows. Wanting to discuss lowering prices is probably going to cause fear for investors around profits, but having the WH dick in your honeypot for the cure to the beer flu probably looks good. Goodluck on this.\n\n3M Long, prior to Jan 28th traded for >175, sits at 150. My play would be 4/17 170c and wait for tendies. Will probably spike up though Monday morning on briefing, so, you know, buy high you idiots.\n\nShort AAL, UAL, SAVE, DAL, etc. Further restrictions likely coming.\n\nDidn't really inspire confidence in market but I wouldn't be surprised by a statement from JP Sunday night re: rate cuts and an optimistic market moving into Tuesday. After that who fucking knows I'm not an oracle, just a gambler with a problem.\n\nAs always, disclaimer: My positions are 3/2 3/4 3/6 and 3/6 puts on SPY.\n\nTL;DR long 3m (4/17 170c) short airlines (figure it out) goodluck on pharma", "id": "fbi6i0", "created_utc": 1583006606.0, "score": 72, "upvote_ratio": 0.94, "num_comments": 67, "comments": [{"body": "Your tl;dr is tl;dr", "score": 51, "replies": [{"body": "long 3m short airlines goodluck on pharma\n\ngot you fam - but also edited post", "score": 17, "replies": [{"body": "Thanks fam", "score": 2, "replies": []}]}]}, {"body": "Bro they're not doing anything to contain it. They haven't even tested 500 people.\n\n&#x200B;\n\nGovernment: Can't have new cases announced if we're not testing. Right my boys?", "score": 40, "replies": [{"body": "Maybe I just like it when authoritative men talk down to me. Seemed legit.", "score": 16, "replies": [{"body": "It did seem legit. And I really don’t like trump. He’s actually really radicalized me politically lol. But he seemed legit concerned and speaking very carefully. Still an asshole.", "score": 3, "replies": []}, {"body": "When he starts letting the CDC do their fucking jobs, I'll start believing Trump is trying to contain this.", "score": 1, "replies": []}, {"body": "> Seemed legit.\n\nAnd this is how we know your opinion are (very very) likely worthless", "score": -3, "replies": []}]}]}, {"body": "Yo JFK was empty AF today. Dropped my mother off and flights were nearly empty (JBLU). EXPEDIA PUTS 80", "score": 9, "replies": []}, {"body": "Sounded like he was about to pass out.", "score": 8, "replies": []}, {"body": "Bro my DD was good for the less fortunate people here. But thanks for the actual DD 🐻🌈❤😘", "score": 6, "replies": [{"body": "I was just giving you shit cutie. You did good. No one will read this anyways.", "score": 8, "replies": [{"body": "Probably not 😂", "score": 2, "replies": []}]}]}, {"body": ">Literally said \"Do not panic\".\n\nrofl. Puts, far down, the lower the better. And god help us all.", "score": 5, "replies": []}, {"body": "I’m bout to dumb puts into spy, ccl and dal. Ccl had a sweet little bump on Friday. Bye bye to that", "score": 4, "replies": [{"body": "I am holding puts on Dal over the weekend. I think AAL might be a better play though. More debt, 357s grounded and labor disputes", "score": 1, "replies": [{"body": "Dal is in a much better position to weather the storm.  Puts AAL THE WAY.", "score": 1, "replies": []}, {"body": "Why no UAL mention?", "score": 1, "replies": []}]}]}, {"body": "So I am going to Mexico for Spring break. You think they will ban flights everywhere in the next 3 weeks? Tryna see some college titties for the first time", "score": 3, "replies": [{"body": "Tell your mom to enroll amd stay home", "score": 9, "replies": []}, {"body": "Youre gonna get stuck there in a mexiquarantine", "score": 1, "replies": []}]}, {"body": "I am going to do the exact opposite as what you said because you sound retarded", "score": 4, "replies": [{"body": "Yeah fair", "score": 9, "replies": []}]}, {"body": "a lot of uncertainty. \n\nkept saying its low risk but situation may change \"rapidly\"\n\nif your healthy and young your fine, except the usa is like 40% obese. \n\ndoctor guy said that 70-75% should be just fine which is much lower then what people were wanting him to say", "score": 4, "replies": [{"body": "Yeah I think that was a poor choice of words unless we're actually seeing 25-30% hospitalization rates.", "score": 3, "replies": []}, {"body": "Some chick just died from it and she was a 23 year old althletic soccer player, I don't think you're in the green just because you're young. Do you have a better shot than someone older? yeah probably, but I wouldn't say just because you're young that you're going to survive the shit.", "score": 1, "replies": [{"body": "You have a link or just fake news\n\nEdit scrolled down and saw ty", "score": 2, "replies": []}, {"body": "it definitely can kill younger people, its just more rare.\n\nthe either the kill rate for this virus is higher (doubtful) or the cases reported are a tiny fraction of reality.", "score": 1, "replies": []}, {"body": "Link?", "score": 1, "replies": [{"body": "https://en.radiofarda.com/a/football-games-to-continue-in-iran-as-female-player-dies-of-coronavirus/30458514.html", "score": 2, "replies": [{"body": "They probably stoned her half to death tho", "score": 1, "replies": []}]}]}]}, {"body": "> if your healthy and young your fine, except the usa is like 40% obese\n\nFirst off, through God your is actually you're. And secondly, the death from Seattle was apparently a 19y/o.", "score": 0, "replies": [{"body": "stop being fat bruh", "score": 2, "replies": [{"body": "Loaded up on too many tendies, that's an impossible task at this point", "score": 1, "replies": []}]}]}]}, {"body": "3M might get a pop from the news and be a good trade short term, but don't think it is material to revenue or earnings. Selling a bunch more masks that essentially retail for $1 a piece isn't going to juice results much.", "score": 2, "replies": [{"body": "the government should be giving them out for free to avoid panic", "score": 1, "replies": []}]}, {"body": "Long $GILD", "score": 2, "replies": []}, {"body": "Yeah, I think I'm going to hold off on buying anything Monday morning. There are a few folks here that seem to think Monday will start green, then start falling again. I tend to agree with that.", "score": 3, "replies": [{"body": "When do you plan to buy? Top of green movement on Monday?", "score": 2, "replies": [{"body": "I figure the bump is going to last about an hour. So I'll buy in at about 10:30 a.m.", "score": 2, "replies": []}]}]}, {"body": "Lowering rates will crash the US economy.", "score": 1, "replies": [{"body": "Why’s that?", "score": 0, "replies": [{"body": "Because its an admission that growth no longer exists, as well as the Fed funds steepening against all government yield durations. It will also collapse rate differentials and force carry trades to unwind. You don't want to buy US equities when rates are being cut. You want to sell all rallies and when the curve steepens you want to buy emerging markets.", "score": 2, "replies": []}]}]}, {"body": "Squiggly lines pic mean it’s gotta be true.", "score": 1, "replies": []}, {"body": "Fuk all I heard was buy travel and vacation puts and mmm is gonna skyrocket and then probably level off and drop after the shitshow is over \nOtherwise blah blah fukin blah.", "score": 1, "replies": []}, {"body": "3M won't have much of a revenue increase due to the contracts. Cap of 95B compared to like $1-$10 per mask. That translates to less than 0.1% of their market cap. This is not large enough to prevent the market from bringing it down  - 3M is already following SPY from the picture.", "score": 1, "replies": []}, {"body": "You're saying sell airlines? Weird. I would say long puts", "score": 1, "replies": []}, {"body": "AAL 3/6 15p?", "score": 1, "replies": []}, {"body": "In regards to medical industry and which companies. We can probably safely say jnj due to them already partnering with us government to fight corona like 2 weeks ago.", "score": 1, "replies": []}, {"body": "3M gang reporting in 🙋‍♀️", "score": 1, "replies": []}, {"body": "$MMM all I see are m$", "score": 1, "replies": []}, {"body": "Too many words", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "indiscriminate selling is over. hotels and travel will continue to suffer. if you are making datacenters that power netflix and work-from-home, itll be green.", "score": -12, "replies": [{"body": "Bruh stop copy pasting your own comments in posts", "score": 5, "replies": [{"body": "Let him keep doing it. I’m enjoying downvoting.", "score": 5, "replies": [{"body": "lol you guys are cute. i did it once. go find another copy-paste in my comment history...", "score": 1, "replies": []}]}, {"body": "comment so nice had to make it twice!", "score": -2, "replies": [{"body": "thesis: Netflix is somehow going to magically get more subscribers than everyone.... Or that they'd benefit from a financial crisis. What are the first things to go when money is tight? Luxuries.", "score": 1, "replies": [{"body": "nflx a luxury? lol. every trailer park in america has a 90% subscription rate to cable. television programming is a necessity.", "score": 1, "replies": [{"body": "OK, so by your own logic, everyone has it... Which is what I said.\n\nThey don't profit more because people stream more. Unless it's Amazon which offers rentals and buying.\n\nBut my last point remains. If people are missing work, what's the first things to go? Things you can live without.\n\nI know it sounds crazy, but you don't actually need Netflix.", "score": 1, "replies": [{"body": "Well yeah... eat, sleep, piss, shit, and stay warm/cool. That’s pretty much the requirements. \n\nPuts in sleep", "score": 1, "replies": []}]}]}]}]}]}]}]}
{"title": "Long v. Short expiration dates?", "selftext": "Possibly a dumb question. What is the advantage of buying an ITM call with a distant expiration date? i.e. if there's an ITM $MSFT call expiring in a week, or in three months, why would I buy the longer call, over the shorter? Wouldn't the longer call have a greater risk of ending up OTM?\n\nI'm trying to understand how you build a strategy for trading options that isn't just YOLO and hope. Any suggestions? Anyone want to take a noob under their wing?", "id": "fbjjsg", "created_utc": 1583012313.0, "score": 0, "upvote_ratio": 0.3, "num_comments": 64, "comments": [{"body": "ban", "score": 77, "replies": [{"body": "Reasons to ban this guy:\n\n1. Hes annoying and treating WSB like google \n\n2.  He’s going to lose all his fucking money\n\n3.  He has no fucking idea what he is doing \n\nWe’re doing him a favor by banning", "score": 23, "replies": [{"body": "Concur 🧐🤓", "score": 4, "replies": []}]}, {"body": "Concur. We are not google.", "score": 5, "replies": []}, {"body": "🤣", "score": -3, "replies": [{"body": "oh was that fucking funny?", "score": 5, "replies": [{"body": "Yes Sir", "score": 2, "replies": []}]}]}]}, {"body": "Just buy as many calls as you can on everything. Coronavirus is a hoax, like China and the moon.", "score": 50, "replies": [{"body": "If the moons a hoax, where can those calls send my portfolio?", "score": 6, "replies": [{"body": "To the great spaghetti monster in the sky. SPCE isn't real either, they made it up in a Hollywood basement.", "score": 3, "replies": [{"body": "Buy Call $RAGU", "score": 2, "replies": [{"body": "Always call on the $acred $auce", "score": 2, "replies": [{"body": "Ia Ia, brother.", "score": 1, "replies": []}]}]}]}, {"body": "$SPCE", "score": 1, "replies": []}]}]}, {"body": "Ban", "score": 26, "replies": []}, {"body": "Just buy first and ask questions later", "score": 10, "replies": [{"body": "Did that. Did not end well.", "score": -8, "replies": []}]}, {"body": "Take you under my wing? I'll drop you. Ever heard of Humpty Dumpty?", "score": 10, "replies": [{"body": "He's my cousin.", "score": -4, "replies": [{"body": "Shut the fuck up.", "score": 8, "replies": []}]}]}, {"body": "Man this sub has changed recently", "score": 7, "replies": [{"body": "Yeah, ever since I joined and started classing up the joint.", "score": -41, "replies": [{"body": "How are you not banned yet?", "score": 9, "replies": [{"body": "Mods ain’t doing shit", "score": 5, "replies": []}, {"body": "My roguish good looks?", "score": -14, "replies": [{"body": "It’s called downs syndrome", "score": 2, "replies": []}]}]}]}]}, {"body": "Very long ATM means you’re paying a price to have zero future downside risk on 100 shares of the underlying. You get all gains and the theoretical stockholder is stuck carrying any losses. \n\nThe shorter dated the option, the cheaper the premium.\n\nAssume a fixed investment size, $1k maybe. For sake of discussion you might be able to get 1x ATM ~12 month expiration call contract on $STONK, 5x contracts that expire in about a month, or 20x contracts that expire in about a week. \n\nIf $STONK experiences a 1% move to your benefit or disadvantage, you can imagine what the relative value of your investment will do in each scenario. More contracts means more leverage and therefore a gain is magnified, yet the shorter dated options mean you have less time to recover if its a move against you.", "score": 17, "replies": [{"body": "Bruh this is wsb, let him ask questions at r/investing or google them theirselves", "score": 11, "replies": [{"body": "To be fair investing would probably tell him to invest 70/30 at 18 years old in an s&p fund and to never even think of the word option again", "score": 5, "replies": []}, {"body": "I did. Then asked here.", "score": -2, "replies": [{"body": "Dunno if you could tell but this isn’t really a place for you to learn. It’s best for you to do researches and ask questions elsewhere and come back here to do stupid shit later when you understand the basics. A lot of people came here not knowing anything about option trading and get fucked by the market", "score": 4, "replies": [{"body": "Yep, hence why I asked in a bunch of places. WSB is just more active and I'm willing to wade through the trolls for the few decent responses.", "score": 0, "replies": [{"body": "Well good luck to you then. The market fucks anyone it likes 🐻 or 🐂", "score": 4, "replies": []}, {"body": "try /r/options", "score": 2, "replies": []}]}]}]}]}, {"body": "ban", "score": 1, "replies": []}]}, {"body": "This question in wsb indicates it's a Bear market !", "score": 3, "replies": [{"body": "And that I didn't get an answer in r/options", "score": 2, "replies": [{"body": "Hey stupid ass go to r/thetagang and join us Theta Chads on our journey for risk free tendies. Look at strangles, straddles, put credit spreads, and calendar spreads.", "score": 1, "replies": [{"body": "Done, and done!", "score": 1, "replies": []}]}]}]}, {"body": "Go back to r/options retard. We don’t do that here.", "score": 3, "replies": []}, {"body": "ban", "score": 6, "replies": []}, {"body": "Just inject yourself with mercury and become autistic like the rest of us. Autism is the key to your tendies. In short SPCE calls 3/6 $62 stocks only go up", "score": 3, "replies": []}, {"body": "Dear sirs would you please advise me on how to diversify my portfolio and offset my risks while maximizing my earnings. Also can you please advise me on tax havens for the tendies that I will certainly receive for my purchase of the puts I wish to purchase \n\nUhm no that's what google is for.", "score": 3, "replies": [{"body": "No need to Google tax havens, that's a Double Irish Dutch sandwich all day long.", "score": 1, "replies": []}]}, {"body": ">  why would I buy the longer call, over the shorter?   \n  \nIf you expect there to be alot more upside over a longer term, you pay the premium difference and enjoy the leveraged upside.  However, if the option lasts more than 2 weeks, it will lose the attention span of the traders here /s :)", "score": 8, "replies": [{"body": "Gotcha. Thanks!", "score": 2, "replies": []}, {"body": "Autists here cannot pay attention beyond the weekend.", "score": 1, "replies": []}]}, {"body": "Build a decision matrix.\n\nWhat about an otm call with a distant expiration?\n\nWhat about an itm call with a short expiration?", "score": 2, "replies": []}, {"body": "Simple answer, \n\nLong dated calls (30 days or more) offer more room for error. In other words, the option trades similar to the underlying security. \n\nShort dated calls (30 or less; or weekly) less room for error. It must move quickly.\n\nI always look at it through the following analogy.\n\nLong dated calls are similar to a bike tire that is leaking air (time premium) but barely noticeable.\n\nWeekly and shorted calls are similar to a bike tire that blowing air and you are looking for next gas station air dispenser ASAP", "score": 2, "replies": []}, {"body": "The value of OTM Options decay with time because you have less chance of becoming ITM.  However if you have a bunch of time till expiration you have more time to potentially become ITM", "score": 1, "replies": []}, {"body": "The longer dated call can end of OTM but also even deeper ITM. Longer dated call has time value in it which is why it is priced higher. The advantage of buying an ITM with distant expiration is that it is safer and less risker investment. Its theta decay is much less than a OTM call with shorter expiration.", "score": 1, "replies": []}, {"body": "ban", "score": 1, "replies": []}, {"body": "Would you FUCK RIGHT OFF", "score": 0, "replies": []}, {"body": "Short, the market is clearly going down you dummy.", "score": -1, "replies": [{"body": "MSFT can't go any lower. We're approaching Balmer territory!", "score": 0, "replies": []}]}, {"body": "Why are people saying ban", "score": -6, "replies": [{"body": "Jealousy.", "score": -2, "replies": [{"body": "Oh yeah i have the same q as u so if u get banned im making a mod complaint post and ill get banned too", "score": -7, "replies": [{"body": "Ban bros!", "score": -6, "replies": [{"body": "Straight up, but not straifht cause im a 🌈 🐻", "score": -1, "replies": [{"body": "No Bromo?", "score": 0, "replies": [{"body": "No bearmo", "score": 1, "replies": []}]}]}]}]}]}]}]}
