{"title": "[deleted by user]", "selftext": "[removed]", "id": "ec2h4d", "created_utc": 1576618797.0, "score": 92, "upvote_ratio": 0.9, "num_comments": 88, "comments": [{"body": "[deleted]", "score": 28, "replies": [{"body": "I agree, github is the way to go", "score": 10, "replies": []}, {"body": "My current work is up here , it’s very much in development phase though. Eventually I want to move to a paid API \n\n\nhttps://github.com/mrunalshah6/stock-options/", "score": 9, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Absolutely. Current repo is for personal use only ! I am not selling anything or making money of it", "score": 2, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "We would need to scrap data only once a day for a given stock. I will check out your repo", "score": 2, "replies": []}]}]}]}, {"body": "I’ve made repo private as I am switching to paid API , i don’t want people abusing the scrapers and getting in trouble.\n\nI will open it up as soon as I am done updating new API", "score": 1, "replies": []}]}, {"body": "seconded, dev here as well, bunch of people could contribute", "score": 4, "replies": []}, {"body": "Agreed.", "score": 3, "replies": []}, {"body": "I will make my work available , I already have data scraping part done. Just need to embed different algorithm", "score": 3, "replies": []}]}, {"body": "I would be interested in testing this out", "score": 8, "replies": []}, {"body": "Hey I’d be interested in checking this out. I write my own automated strategies as well.", "score": 7, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Khan academy\n\nhttps://m.youtube.com/user/khanacademy/search?query=python", "score": 6, "replies": []}, {"body": "If you’re new to coding then I would recommend learning to code first prior to learning how to build strategies. Python as others have mentioned is a great place to start. Learn by building small stuff then move over to learning how to work with APIs. Once you have that down find a broker API you can tie into and get stock data. Don’t rush it. Take your time and learn and you will slowly know more and more and figure out how to build anything.", "score": 3, "replies": []}, {"body": "I would start with Python and data structures. Beyond that there are tons of different python libraries to help you code your algorithms.", "score": 2, "replies": []}]}]}, {"body": "I'm interested man\nwhere do you get the option data?", "score": 3, "replies": [{"body": "Currently scraping it from yahoo finance as I don’t make any money out of this. I would be open to moving to a paid API if people find value in the software and are willing to support the API and server costs.", "score": 1, "replies": [{"body": "Just wondering can you tie into the API from thinkorswim? \n\nOn a side note, one thing I’ve been interested in setting up is creating a custom alert for when large ($100k+) short term (less than 5 days) option orders are purchased on the bid. I know there are services out there like FlowAlgo but it’s so cluttered and not customizable for what I’m looking for.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Ive been interested in the software for a long while now. I read on the light speed site that it comes with there software? Have you used LiveVol? What experience do you have with it? Looks like an Option's trader's wet dream come true.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Do you have LiveVol basic or Pro?", "score": 1, "replies": []}]}]}]}, {"body": "This might work for me as an individual, I am not sure how it would work in a public repo though.", "score": 1, "replies": []}]}]}]}, {"body": "I am interested in this as well. If it helps professional python dev", "score": 3, "replies": [{"body": "I will make my code available, you can fork and contribute", "score": 1, "replies": []}]}, {"body": "Ah the classic \"using machine learning for trading\" theory. I knew a professor who said everyone thinks of that and then promptly fails. Best of luck though! I guess that's how new things are made", "score": 3, "replies": [{"body": "Currently it’s just an algorithm.", "score": 1, "replies": []}]}, {"body": "Would love to see this", "score": 2, "replies": []}, {"body": "Interested", "score": 2, "replies": []}, {"body": "So designing a nice interface and history for options on weekly or monthly basis on end of day results? Port close data from ToS or other public source for chains?", "score": 2, "replies": [{"body": "Currently scraping data from yahoo finance", "score": 1, "replies": []}]}, {"body": "I'm interested!", "score": 2, "replies": []}, {"body": "I’m interested. Will pm later", "score": 2, "replies": []}, {"body": "Interested definitely", "score": 2, "replies": []}, {"body": "Very interested", "score": 2, "replies": []}, {"body": "interested", "score": 2, "replies": []}, {"body": "Interested", "score": 2, "replies": []}, {"body": "What quantifies as the “best covered call or put”?", "score": 2, "replies": [{"body": "We would calculate monthly and annualized ROI for a given options combination", "score": 2, "replies": [{"body": "Would whoever downvoted this, please explain why?", "score": 1, "replies": [{"body": "I wasn't the lad; but it's a stupid idea.\n\nContextual elements are key in options. Making such a simple algorithm would wipe you out in no time. Writing covered-calls on stocks like $SHOP would be the way to go, and you'd inevitable get dunked on and lose your ass.", "score": 1, "replies": [{"body": "Never heard of anyone losing their ass selling covered calls, if anything, you are reducing standard risk associated with holding a stock by getting paid a premium. With this algorithm we are just trying to maximize that premium for even additional risk cushion. \n\nBut hey I am all game if you have a better algorithm.", "score": 2, "replies": [{"body": "The loss in covered calls would be using stocks that you aren’t long term bullish on.  You put a bunch of money in bynd and start selling calls, all is well until the stock tanks - then you can lose tons.  Volatile stocks have the best premiums but highest risk.  \n\nI personally like covered calls on stable stocks less risk but less reward.", "score": 4, "replies": [{"body": "Very fair analysis, I am not making recommendations on any stocks though. So not quite sure what’s it gotta do with the algorithm I am building.", "score": 2, "replies": []}]}, {"body": "You literally cannot make an algorithm to do these things more efficiently than a trained human operator currently.\n\nYou'll always lose your ass unless you restrict it to very safe products, and in doing so you'll drastically under-perform the human operator.\n\nStop fucking memeing. Slapping on \"artificial intelligent\" or \"machine learning\" or \"algorithem\" doesn't make something a good idea.", "score": -7, "replies": [{"body": "This is an idiotic comment. There is unlikely to be any area anywhere that is more suited to algorithms than equity trading. The question is not can he compete with Humans, but can he compete with other algorithms.", "score": 2, "replies": [{"body": "No you're just a half-wit who has been woo'd by some stupidtarian and his buzzwords.\n\nAlgorithm's can do micro-trades, although he's unlikely able to make one that's competitive, however they cannot function properly given the parameters the OP lined out, particularly maximizing returns with no limitations on products.\n\nHis algorithm would rightly choose to CC or cash-secured put things like $SHOP, $ROKU, $TSLA, and garbage meme stocks like weed in 2018, then he'd get his ass handed to him, he'd be stuck with the long stock and be down 30%+ with little ability to collect further premium.\n\nOptions aren't baby-tier simple products like most equities, and if you don't have an extreme understanding of them you'll just get your ass handed to you or get pathetic returns in the long-term. Machine-learning is not advanced enough yet to out compete humans in options. They literally have not developed the processing ability yet to achieve beyond analytical results, which means with options they'd pretty much always end net-neutral or blow up if they are given the command to maximize returns due to how options behave.\n\nIf you traded options for years and were/are wildly profitable you'd understand this.", "score": -4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "You're fucking stunted considering my point completely flew over your head; namely that machine learning is not at the stage where it's possible yet.\n\nI mean, or are you completely and utterly insane so far that you believe we have that technology now? Machine learning can only fit within known-systems; it can outperform any specific human in defined-ruled environments like games however it's impossible currently for them to learn and properly factor the subtle aspects that effect options on specific stocks, especially when given commands like to \"maximize returns with minimal risk.\"", "score": -6, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Also very interested, would love to get involved.", "score": 2, "replies": []}, {"body": "I am interested. Thanks.", "score": 2, "replies": []}, {"body": "Sign me up", "score": 2, "replies": []}, {"body": "I would be interested", "score": 2, "replies": []}, {"body": "Very interested!", "score": 2, "replies": []}, {"body": "Definitely interested!", "score": 2, "replies": []}, {"body": "Interested.  Thanks!", "score": 2, "replies": []}, {"body": "Interested", "score": 2, "replies": []}, {"body": "Interested", "score": 2, "replies": []}, {"body": "Interesting. This is really cool. Is that main value prop right now that I don’t have to constantly check for opportunities and instead they get pushed to me?", "score": 2, "replies": [{"body": "Yes , for covered calls you don’t need real time analysis. Instead you input stocks you are interested in and a csv with all calculations get delivered in your inbox daily after markets close.\n\nFor more advanced options traders strategies like “poor mans covered call” would also be delivered .\n\nImplementing everything will take sometime , I am concentrating on covering the basics first", "score": 1, "replies": [{"body": "makes sense!i guess it is pretty annoying to have to go thru 50 tickers to see if there are opportunities.. do u let people custom their deltas and target credit?", "score": 1, "replies": [{"body": "Customize delta of option that you want to sell for covered call ?", "score": 1, "replies": []}]}]}]}, {"body": "This is an awesome idea :)", "score": 2, "replies": []}, {"body": "I am interested in your algorithm, can you pm me please?", "score": 2, "replies": []}, {"body": "Interested here as well.\n\nAre you also factoring dividends in your algorithm?", "score": 2, "replies": [{"body": "Can you tell me what you would like to additional see wrt to dividends ?", "score": 1, "replies": [{"body": "I think at a minimum factoring them into the return if you own the stock during the time they are issued, and perhaps have the algorithm automatically re-invest the dividends set up as an option as well.", "score": 1, "replies": []}]}]}, {"body": "Interested", "score": 2, "replies": []}, {"body": "I am. Put it on github please.  I want to mess around with it in my spare time and use it for other trading options as well.", "score": 2, "replies": []}, {"body": "I’d be siked to test this out", "score": 2, "replies": []}, {"body": "Would it work outside US?", "score": 2, "replies": [{"body": "I am scrapping data from yahoo finance, if data is on there , it should work", "score": 2, "replies": []}]}, {"body": "I'm interested.", "score": 2, "replies": []}, {"body": "Interested sir", "score": 2, "replies": []}, {"body": "This is a great tool for options enthusiasts who are not the best technical analysts such as myself. Please sign me up. I will share my feedback.", "score": 2, "replies": []}, {"body": "Hey I'm interested also.", "score": 2, "replies": []}, {"body": "I'm definitely interested in testing!", "score": 2, "replies": []}, {"body": "Add me to the list", "score": 2, "replies": []}, {"body": "interested", "score": 1, "replies": []}, {"body": "Interested.", "score": 1, "replies": []}, {"body": "Interested", "score": 1, "replies": []}, {"body": "I’m interested", "score": 1, "replies": []}, {"body": "I’m interested", "score": 1, "replies": []}, {"body": "Can you please add me to the private github? I am DM-ing you my github email address.", "score": 1, "replies": []}, {"body": "im looking to build something similar for options that's based on moving average crossover for the underlying. any suggestions?", "score": 1, "replies": [{"body": "Possible , but I haven’t had good luck with making money with options off cross over", "score": 1, "replies": []}]}, {"body": "I’d be happy to try out and share my feedback. VP level in a SaaS startup.", "score": 1, "replies": []}, {"body": "Interested", "score": 1, "replies": []}, {"body": "Here's an idea. Why don't you write an algorithm that replicates the S&P 500 by means of short put exposure with a market cap weight. But the kicker is that you run the wheel on each one of those Securities. Individual stock volatility is guaranteed to be higher than the S&P volatility", "score": 0, "replies": []}, {"body": "There are no algorithms to figure out the best trades, my friend. It is the game of risk vs. reward, and the algorithm can't do anything about that. It's pure statistics and risk-taking instinct.", "score": -1, "replies": []}]}
