{"title": "New options scam PM", "selftext": "", "id": "att266", "created_utc": 1550908679.0, "score": 285, "upvote_ratio": 0.97, "num_comments": 105, "comments": [{"body": "Ahahahah - “use this ID...unless it’s banned...then use this one instead” \n\nThe nerve. ", "score": 164, "replies": [{"body": "PS it's totally not a scam", "score": 110, "replies": [{"body": "It’s literally a sure thing.", "score": 34, "replies": [{"body": "Not a scam, he’s a Nigerian Prince.", "score": 6, "replies": []}, {"body": "Literally can’t go tits up", "score": 1, "replies": []}]}, {"body": "Whew. And I was so worried this was a scam.", "score": 7, "replies": []}, {"body": "Do you mean my 50$ is safe? It was my risky money...", "score": 3, "replies": [{"body": "Literally can’t go tits up?", "score": 1, "replies": []}]}, {"body": "“the only problem you’ll have is that you didn’t join my discord sooner”\n\nthis guy literally just finished watching wolf of wall street", "score": 2, "replies": []}]}]}, {"body": "Sounds legit I really need a 500% play. ", "score": 47, "replies": [{"body": "Per week", "score": 16, "replies": []}]}, {"body": "\"P.S. This isn't a scam.\"\n\nMorgan Freeman: \"Well, it was a scam.\"", "score": 75, "replies": [{"body": "Oh please, gotta give that line to Ron Howard. ", "score": 10, "replies": [{"body": "\"It *was* a scam.\"", "score": 9, "replies": [{"body": "Best r/Beetlejuicing I've ever seen.", "score": 3, "replies": []}, {"body": "This is a great account.  You should post more.", "score": 1, "replies": []}]}]}]}, {"body": "I'm a noobie to the world of options trading. I've been reading books and listening to videos for several months now with a great enthusiasm. \n\nI got this spam this morning. It was my first one. I finally feel like I am making progress. ", "score": 31, "replies": [{"body": "Obviously he only picked the cream of the crop.", "score": 18, "replies": []}, {"body": "Did you buy the program? Because otherwise, whatever progress has been made is being squandered not taking advantage of a sure thing absolutely cannot lose totally not a scam.", "score": 7, "replies": []}, {"body": "Use that basic knowledge to expose their pump and dumps\n\nThen report them to the SEC", "score": 1, "replies": []}]}, {"body": "It literally can’t go tits up", "score": 56, "replies": [{"body": "FrEE mOneY", "score": 23, "replies": []}]}, {"body": "I also got this, honestly couldn't tell if it was a scam or a shitpost.", "score": 18, "replies": [{"body": "Good thing you ignored it, because I can get you 501% gains for $49.94.\n\n\nP.s. this isn’t a scam.", "score": 17, "replies": [{"body": "What is your process though?  Can I TRUST it?", "score": 2, "replies": []}]}, {"body": "I also did. I ignored it. I should have posted screenshot for free internet points.", "score": 4, "replies": [{"body": "I'll send you a scam message for only $49.95. This works and is foolproof. I have dozens of members that will vouch for my method. It's literally a sure thing.", "score": 2, "replies": []}]}]}, {"body": "If he had a fool proof method wouldn't he keep it to himself? Wouldn't $50 be nothing if he can make that in a second?", "score": 13, "replies": [{"body": "scammers arent very intelligent ", "score": 12, "replies": [{"body": "You've got that backwards. Successful scammers are plenty smart. It's the people they prey on who are not smart. ", "score": 2, "replies": [{"body": "most scammers just copy methodology from someone else, id classify both as unintelligent", "score": 1, "replies": []}]}]}, {"body": "Exactly.  If his shit worked, you wouldn't be able to afford his services", "score": 7, "replies": [{"body": "And he will be the first trillionaire", "score": 5, "replies": []}]}]}, {"body": "Got this too. What convinced me it was real was the “ps  this is not a scam”. I mean, would a dishonest person say that??\n\nLooking forward to my gains guys", "score": 7, "replies": []}, {"body": "I know his secret. It's box spreads.", "score": 7, "replies": [{"body": "SHORT box spreads. With a LONG box spread, he's probably onto something.", "score": 5, "replies": []}]}, {"body": "Posting this to r/wallstretbets got me a temp ban", "score": 5, "replies": [{"body": "It literally can't go tits up", "score": 5, "replies": []}, {"body": "Probably because you didn't redact the discord info", "score": 2, "replies": [{"body": "Yeah. Well I didn’t see they made a sticky saying not to post this shit, we don’t care. I didn’t see the sticky but hey whatever. ", "score": 1, "replies": []}]}]}, {"body": "There are dozens of us!", "score": 5, "replies": []}, {"body": "I got this earlier today lol. I replied with sounds like a scam 😂", "score": 3, "replies": [{"body": "My reply was the only thing I can guarantee is that you are full of shit", "score": 5, "replies": []}]}, {"body": "The only regret you will have, is not buying more. ", "score": 3, "replies": [{"body": "I don't even know you", "score": 2, "replies": []}, {"body": "First thing I thought of", "score": 2, "replies": []}]}, {"body": "Funny thing is, I’d gladly pay the guy $50 for a 500% return on a $1.00 option. ", "score": 5, "replies": [{"body": "I’ll give you $5 for $50 any day of the week, come on up here lad, have I got a deal for you! 😂", "score": 8, "replies": []}, {"body": "/r/theydidthemath", "score": 3, "replies": [{"body": "Tell me, what does a person pay for a $1.00 option?", "score": 2, "replies": [{"body": "I guess I really needed a sarcasm tag for you, didn't I? *whoosh*", "score": 2, "replies": [{"body": "My mistake, given your username name I wrongly assumed that sub was for those who have proceeded to do the math wrong.  \n\nPlease pardon my r/wsb reply 🥂", "score": 3, "replies": [{"body": "It's cool. We're on /r/options where many of us do trade options either professionally or semi-professionally. In many cases, we do have some pretty sick math skills.", "score": 3, "replies": []}, {"body": "Here's a sneak peek of /r/wsb using the [top posts](https://np.reddit.com/r/wsb/top/?sort=top&t=year) of the year!\n\n\\#1: [Wallstreetbets screwed us! Upvote this to fill the void with this sub instead!](https://np.reddit.com/r/wsb/comments/9hism6/wallstreetbets_screwed_us_upvote_this_to_fill_the/)  \n\\#2: [If Elon Musk 👦and my girl👸 😍 both drowning 😱👋 and I can only save one 😤😬 catch me at my girl funeral 😔👻🌹 with my space suit on 😏💯🌖🚀](https://np.reddit.com/r/wsb/comments/8laxbi/if_elon_musk_and_my_girl_both_drowning_and_i_can/)  \n\\#3: [Long time WSBer opening a Robinhood account for the first time.](https://v.redd.it/u0qkr7je5hq11) | [3 comments](https://np.reddit.com/r/wsb/comments/9lsi6y/long_time_wsber_opening_a_robinhood_account_for/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/afd0dd/blacklist/)", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I just got this", "score": 4, "replies": [{"body": "Same", "score": 3, "replies": [{"body": "Same!", "score": 2, "replies": []}]}]}, {"body": "Lol so tell them to send you 249.75 and that will cover your 500% gain and then you will send the 49.95 lol", "score": 2, "replies": []}, {"body": "So look 👀 heres the deal. 👌\n\nIts like an MLM facebook mom.", "score": 2, "replies": []}, {"body": "tRuSt tHE pRoCeSs! ", "score": 2, "replies": []}, {"body": "Yo I make 500% gains all day, but I need to sell my strats for 50 bucks\n\nBtw this is not a scam trust me fam", "score": 2, "replies": []}, {"body": "yeah lets keep giving these clowns more attention. block, report, [optional: call him a pussy] and move on ", "score": 2, "replies": [{"body": "Its a bot. No one is reading your replies. ", "score": 1, "replies": []}]}, {"body": "Dude! He said P.S. this isn't a scam. What about that don't you understand?!? It's clearly not a scam.\n\nAnd you apparently cannot lose. So only an idiot wouldn't take that bet!\n\n</s>\n\nAllow him to sell short box spreads with you. It's clearly fReE mOnEy!", "score": 3, "replies": []}, {"body": "https://tenor.com/xve0.gif", "score": 1, "replies": []}, {"body": "$10 says this guy tells people to buy his near-expiration contracts and calls them the \"killer weekly plays\".\n\n", "score": 1, "replies": [{"body": "Should we go 50/50 on the $50 buy-in to figure out who gets the $10?", "score": 1, "replies": []}]}, {"body": "What tipped you off this isn't legit?", "score": 1, "replies": []}, {"body": "Trendies for all", "score": 1, "replies": []}, {"body": "Week lie     oPsEnDz ", "score": 1, "replies": []}, {"body": "This is just a paraphrased version of Leo’s sales pitch in Wolf of Wall Street", "score": 1, "replies": []}, {"body": "there's no way its a scam, he said so right at the bottom!", "score": 1, "replies": []}, {"body": "Anyone claiming to have a “fool proof” strategy is full of shit", "score": 1, "replies": [{"body": "Anyone claiming something is \"foolproof\" clearly underestimates fools", "score": 1, "replies": []}]}, {"body": "[same guy in R/forex](https://www.reddit.com/r/Forex/comments/atsy7k/you_too_could_get_500_a_week_not_a_scam_sarcasm/?st=JSHMZ6CW&sh=a0264d8a) ", "score": 1, "replies": []}, {"body": "I can beat that price. Pay me $48 and I'll just message you every day telling you to have a nice day.", "score": 1, "replies": []}, {"body": "Got the same thing from the same guy 8 hours ago. He's probably sending this to a lot of users of one of the financial subreddits or something ", "score": 1, "replies": []}, {"body": "I got “I have free money for you”", "score": 1, "replies": []}, {"body": "Weeklie", "score": 1, "replies": []}, {"body": "I got that too. Bastard. ", "score": 1, "replies": []}, {"body": "I tried reporting it but there was no phishing one.. just went with scam.. not sure if that'll actually do anything but worth a shot", "score": 1, "replies": []}, {"body": "Got the same one. So many discord spam lately. How do these scams even operate? Pumpin n dumpin?", "score": 1, "replies": [{"body": "This one operates from the direct payment requested.", "score": 1, "replies": [{"body": "Ah didn't know this one asks that. Do the others operate by asking money?", "score": 1, "replies": [{"body": "yeah most offer a 'free' channel and a paid channel where the 'real' picks are... however anything ever said to be 'a sure' shot in options is a scam. ", "score": 1, "replies": [{"body": "Ah ok that makes more sense than trying to p&d. ", "score": 1, "replies": []}]}]}]}]}, {"body": "There is hopefully zero chance anyone took this message seriously.  ", "score": 1, "replies": [{"body": "People get taken in by these scams all the time.  So while most people can identity a scam when they see it, a small fraction of a percentage get taken in.", "score": 3, "replies": [{"body": "True.  This PSA is just a repost of the message, so it's perhaps not that instructive either.  I think the people falling for this aren't likely listening to warnings like this.  They are out there eating gas-station sushi and texting and driving too.  ", "score": 2, "replies": []}]}]}, {"body": "This is either a terrifyingly pathetic human, or a moderately impressive bot.", "score": 1, "replies": []}, {"body": "It's not a scam. It says so.", "score": 1, "replies": []}, {"body": "I’ve gotten a few of these messages in the past couple weeks ", "score": 1, "replies": []}, {"body": "“Hey, I make 500% a week, which means I can literally own all of planet earth within 3 months of compounding, so can you send be $50 bucks?”\n\n", "score": 1, "replies": []}, {"body": "Sec.gov then go to report a scam.  If the person is in the USA and they have US based assets then they will likely go after them.  You may also be eligible for up to 30% of the money they get off the fucker.\n\n", "score": 1, "replies": []}, {"body": "If you can make 500% per week exponentially then there is no need to invest anything greater than $1 or the minimum price of contracts to see if the exponential system works. In just 6 weeks, $1 should become $16,125, instead of needing that number up front, and then you can continue to reinvest that profit for a few more weeks and you'll have millions. ", "score": 1, "replies": []}, {"body": "Lol that last sentence in straight out of every selling scene in every stock movie there ever was. ", "score": 1, "replies": []}, {"body": "Uh he told you it’s not a scam so obviously it isn’t ", "score": 1, "replies": []}, {"body": "But it’s a sure thing 😂", "score": 1, "replies": []}, {"body": "I got the same message. I thought it was a scam at first, but thankfully he put my concerns at ease by clarifying it was certainly not a scam. ", "score": 1, "replies": []}, {"body": "This is fake, right? No one is stupid enough to believe this.", "score": 1, "replies": []}, {"body": "This message is so obviously a Ponzi scheme that it reads as if it's a joke.", "score": 1, "replies": []}, {"body": "Fuck these scams. I've gotten both the original discord and now this one yesterday. ", "score": 1, "replies": []}, {"body": "weeklie\n\nWeek lie\n\nWeak lie", "score": 1, "replies": []}, {"body": "Most autists here would lose their money slower by engaging in this scam.", "score": 1, "replies": []}, {"body": "I tried reporting this (also got a pm) from reddit mobile, but it says sorry and like bugs out. Is there any other way I can report this? ", "score": 1, "replies": []}]}
{"title": "Tesla shares fall after SEC asks judge to hold Elon Musk in contempt for violating deal (CNBC)", "selftext": "Shares of [Tesla](https://www.cnbc.com/quotes/?symbol=TSLA) fell 5 percent after the SEC has asked a judge to hold Elon Musk in contempt for violating its deal. The SEC cited an \"inaccurate\" February 19 tweet about production, Bloomberg first reported. \n\n&#x200B;\n\nMore: [https://www.cnbc.com/2019/02/25/tesla-shares-fall-on-report-sec-asks-judge-to-hold-elon-musk-in-contempt-for-violating-deal.html](https://www.cnbc.com/2019/02/25/tesla-shares-fall-on-report-sec-asks-judge-to-hold-elon-musk-in-contempt-for-violating-deal.html)", "id": "aus76r", "created_utc": 1551138546.0, "score": 207, "upvote_ratio": 0.95, "num_comments": 107, "comments": [{"body": "Plot twist, SEC is actually using Elon Musk's tweet to manipulating the stocks.", "score": 109, "replies": [{"body": "I think musk is using the SEC to make the stock drop further so he can but outright privately. \n\n", "score": 32, "replies": [{"body": "$320/share. Funding secured. ", "score": 34, "replies": [{"body": "420!", "score": 6, "replies": [{"body": "Yeah but now the price is a lot lower", "score": 2, "replies": []}]}]}, {"body": "That would certainly be hilarious.  Tesla could never survive as a private company.  It would go bankrupt even faster than it already is.", "score": -14, "replies": [{"body": "Tell me more of the financial details of your theory. ", "score": 9, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I can certainly spot a fraud when I see one.  If you don’t believe me, ask Einhorn or Chanos.  Or do you think they don’t know much about anything?", "score": 1, "replies": []}]}, {"body": "They will need to keep tapping the capital markets throughout the rest of their limited lifespan.  This would probably prove more difficult as a private entity.  Ask me how!", "score": 1, "replies": []}, {"body": "Beets, bears 🐻,  Battlestar Galactica. \n\nAin’t no space x on the office. Musk will fail. Just like every other time where he’s succeeded? Leading to this failure. \n\nPeriod. Past performance isn’t indicative of future success. \n\nJesus. It’s on every bank. \n\nDuh! \n\n#/S!", "score": 1, "replies": []}]}]}]}, {"body": "Occam’s razor. Is it more likely dozens of career government workers, who are regularly investigated for conflict of interest and who manage all sorts of industries and companies are a secret cabal out to get one company. OR a CEO who has proven time and again he is a hothead douchebag shot his mouth off when he shouldn’t have? \n\nHe agreed to behave a certain way as part of an SEC ruling. He didn’t. End of story. The stock tanked because you don’t shit on the SEC. that’s beyond stupid. ", "score": 10, "replies": [{"body": "not stupid, exactly.... its megalomania, induced from having too much money ....you start to think you can get away with anything ....", "score": 2, "replies": [{"body": "I didn’t mean literally low IQ. However, it’s foolish to try and kick the SEC. Just like it’s foolish to try and kick the IRS. You don’t take on government agency packed with career workers who don’t give a shit if you live or die they’re just punching a time card. ", "score": 1, "replies": []}]}, {"body": "Are you proposing a situation like in \"Billions\"?", "score": 1, "replies": []}, {"body": "Not going to say you are wrong, but I have know some of these government workers. Some with clear conflict of interests and depending on their position they may just get force retired but not after they made enough money to make up for anything lost from staying in. Still collect retirement too. If they are close enough to retirement they don’t care at all. This is military btw and not SEC, so maybe slightly different... of course I wouldn’t argue that what you say is more likely.", "score": 1, "replies": [{"body": "I know more people who workED and currently work in the federal govt than you every possibly could. I knew people in damn near every branch of govt. What you're saying never, ever, ever, ever, ever, ever, ever happens. \n\nGovt workers that almost everyone knows are mail carriers. Mail. They handle all sorts of stuff and could run all sorts of schemes and are paid very low compared to SEC investigators. How often do you hear about mail carrier scams or robberies?\n\nIf you screw the federal got you go to jail. You lose your pension. Any gains you made are clawed back. People just don't do it.\n\nThe espionage cases we know of are almost always contractors. And they almost never did it for money. Because they can't possibly spend it or even bank it.", "score": 2, "replies": [{"body": "I am telling you that it happens. Also I have known mail carriers that rob too. Also, you don’t know me or who I know you little shit. I have known two such instances that pertain exactly to what I mention in the little corner of the military I come from. GTFO dude", "score": 1, "replies": [{"body": "> you little shit\n\nWell, clearly you know what you're talking about.", "score": 3, "replies": [{"body": ">Well\n\nIs a deep subject for such shallow minds gathered here today\n\nYour response was indicative of being a little shit.\n\nI know what I know. You can tell me all about what ever experience you may or may not have, but it doesn’t change the things I have seen with my own eyes.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I have altered the deal, pray I do not alter it further.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "No. That would never happen legally", "score": 1, "replies": []}]}]}, {"body": "[How embarrassing...](https://twitter.com/elonmusk/status/1100215984713957376?s=19) ", "score": 20, "replies": [{"body": "I am actually feeling disappointed that Elon Musk posted this too early. I was hoping a major DIP so I can enter. Since I missed the last one.", "score": 7, "replies": []}]}, {"body": "Musk sends an erroneous tweet, later clarifying what he said to 24m people. A very small percentage hold stock and actually care what he says.   SEC goes ape ship.  \nTrump says whatever the fuck he wants when he wants to who he wants and hardly anyone blinks an eye.   Life is weird. ", "score": 46, "replies": [{"body": "Trump isn't the CEO of a publicly traded company.", "score": 7, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "I'm not that old but I can't remember a president ever doing that. I could definitely see Trump doing this to create FUD so he can have better entry points off those dips. ", "score": -1, "replies": [{"body": "You’re giving a lot of credit to someone who in attention span ranges from goldfish to excited beagle. ", "score": 2, "replies": [{"body": "He's got financial advisors you know?", "score": 2, "replies": [{"body": "he got advisors for everything but he doesnt listen to them", "score": 1, "replies": [{"body": "I agree but I'd bet when it comes to his personal finances and investments he does.", "score": 1, "replies": []}]}]}]}]}, {"body": "Since when has Trump acted \"ethically\". Besides laws literally don't apply to the President", "score": -5, "replies": [{"body": "Despite the fact laws do apply to the president, and Trump has broken them even and at times disobeyed court orders and rulings.", "score": 3, "replies": [{"body": "A president has to be Impeached and then Convicted in the senate. The judicial system has no power in regards to the presidency.\n\n[https://constitution.findlaw.com/article2/annotation17.html#9](https://constitution.findlaw.com/article2/annotation17.html#9)", "score": -1, "replies": [{"body": "I know, why are you pointing this out?  You claimed laws don't apply to the president, they do.  ", "score": 4, "replies": [{"body": "The President can do whatever he wants without the repercussions that any other civilian would have. He has immunity. That was my only point", "score": 1, "replies": [{"body": "He doesn't have immunity.  He can be sued and impeached.  Yes I know he has general immunity but there are exceptions to that.", "score": 4, "replies": [{"body": "I was saying that he has to be impeached. Any criminal prosecution cannot proceed until  he has been impeached, and the president is immune to most Civil suits cause of the Nixon case when they ruled \" The President is absolutely immune in actions for civil damages for all acts within the ''outer perimeter'' of his official duties \". So yeah I guess there can be exceptions but it is rare", "score": 1, "replies": [{"body": "I am not just talking about criminal and civil laws that apply to a person but laws that govern the country. For example the president can't say no muslims are allowed in the country just because they don't like muslims.  The court will rule that illegal.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "No you're right, he's only the President of a huge country.    No biggie.  ", "score": 1, "replies": []}]}, {"body": ">SEC goes ape ship.\n\nYou do realize what the SEC does right?", "score": 5, "replies": [{"body": "Of course.  I get it and the investigation is deserved.  But seeing things about Trump with zero repercussions is just so odd to me. ", "score": 2, "replies": [{"body": "Trump and SEC are two very different things.  More so you do know there's an investigation right?", "score": 2, "replies": [{"body": "Yes,   but it's dragging on and on.  A Tesla investigation with Musk seems to move pretty quick.   Like I said.  I get it but still think it's weird.  ", "score": 1, "replies": [{"body": "It moved quick because it was a single thing, Trump is a whole novel.", "score": 1, "replies": [{"body": "So very true!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Every single manufacturer is moving towards all electric vehicles. They also have the expertise to mass produce them and the consistency in build quality.\n\nThe only thing Tesla has going for it is it's battery technology which other companies are catching up on.\n\nI like Tesla as a company and innovation, I hate it as an investment", "score": 2, "replies": []}, {"body": "At the end of the day the batteries are Panasonic’s and other car companies can probably build a competent EV powertrain and platform. The question really has been for a while if Tesla can expand their production and international presence before everyone else was able to bring their products to market. Toyota already has a deal for Panasonic’s batteries, maybe we’re a few years out from an EV Lexus similar in specs to a Tesla.", "score": 3, "replies": [{"body": "That's a good point, the other car manufactures already have the organizational advantage just in terms of actually making a product, but they're also hamstrung by outdated thinking. It's like Xerox sleeping on all their brilliant IP that MSFT and AAPL would make bank on, or Kodak leaving digital cameras to rot. \n\nIt's a huge headwind to start a car company from scratch given the competition and margins, but it's probably easier than retooling to a non-combustion production line.", "score": 4, "replies": [{"body": "No car manufacturer wants electric to happen, there’s not  as much money in it. GM killed their EV-1 back in the late 90’s because a car that doesn’t rust or need any real regular maintenance doesn’t get replaced as often as they want. Disposable society mannnn. ", "score": 2, "replies": []}, {"body": "Starting an EV car company from scratch is Tesla and Rivian's biggest advantage imo. Audi and Jaguar are floundering on their development of EV amid massive costs that they will likely not recoup for the next 5-7 years while producing an inferior product by markers of range and performance. \n\nThe old way of manufacturing cars and the dealership relationship is fading. Existing ICE factories like you said aren't built for producing good EV's and neither is the companies structure. ", "score": 1, "replies": []}]}, {"body": "I thought Tesla made their own batteries? What's this huge lithium battery plant they built recently?", "score": 1, "replies": [{"body": "That's a joint venture with Panasonic. The idea being that Panasonic assembles the batteries on site, then Tesla packs them for whatever battery products they're creating on site.", "score": 2, "replies": []}]}, {"body": "If Toyota is willing to absorb huge losses, they too can get into the EV game heavily!", "score": -1, "replies": [{"body": "If they made their 4Runner and Tacomas EV, they'd have essentially made themselves a money printing machine- especially if they beat Tesla to the market with their truck.\n\nI don't think people truly appreciate how big the market of contractors is out there that would buy one in a fucking heartbeat. ", "score": 1, "replies": [{"body": "So easy!", "score": 1, "replies": [{"body": "Well, they've all had what, like 10 years, to get ready for this and they have more resources than Tesla. It reminds me of Blockbuster's reaction to Netflix.", "score": 1, "replies": [{"body": "I’m sure their investors would have loved for them to rack up $5B or so in losses while getting there.", "score": 1, "replies": [{"body": "This is why disrupters happen. BTW, I'm old enough to remember that argument over why Amazon.com is garbage.", "score": 1, "replies": [{"body": "“Disrupters” currently happen because interest rates have been at 0% for a decade.  I’m old enough to remember getting paid 10% for a certificate of deposit.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I mean, that only makes sense if you think their valuation is good based on the numbers rather than people's faith in Musk.", "score": 2, "replies": [{"body": "Not really, the past 2 quarters can be interpolated as 30 P/E which is more than reasonable for a stock that have 60% annual revenue growth since it IPOed", "score": 1, "replies": [{"body": "Eh. That's largely because of Q3 which was spurned by their CEO literally sleeping on the floor of the factory while they filled only orders on their highest margin vehicle from assembly lines in tents in the parking lot. I don't think it's right to extrapolate that performance, especially if the CEO responsible for driving their deliveries higher gets forcibly removed from the company.", "score": 1, "replies": [{"body": "How about Q4?", "score": 1, "replies": [{"body": "Q4 was like a 30% drop in EPS from Q3.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Stock is like the cult of Elon. ", "score": 8, "replies": []}, {"body": "ehhhhh", "score": 1, "replies": []}, {"body": "I’ve just never seen another electric car that looked attractive or made sense before Tesla, let alone the best I’ve ever driven. And nobody else has anything close to the superchargers. \n\nIt’s like the Terminator franchise without James Cameron. Someone needs the vision. ", "score": 2, "replies": [{"body": "I mean tbh the more affordable Tesla’s, which is the direction the company is going in, do NOT look good, at least in my opinion.\n\nThe wheel design and front bumper especially, woof.\n\nI guess from a purely pragmatic stand point they could be attractive but looks do play a huge role in people owning a car. Especially one that costs 45k+", "score": 2, "replies": []}]}]}, {"body": "Elon will always find a way to move forward. ", "score": -3, "replies": []}]}, {"body": "I wish the SEC could be put in control of the presidential Twitter account ", "score": 19, "replies": []}, {"body": "\\+300% on my puts.  Yeah buddy!", "score": 11, "replies": [{"body": "at what price and expiration date?", "score": 1, "replies": []}]}, {"body": "The SEC is manipulating the stock market more than him.", "score": 16, "replies": [{"body": "Are they drawing the price down to reality; way passed reality; or somewhere near reality?", "score": 1, "replies": []}]}, {"body": "I have the worst timing. Just bought yesterday. ", "score": 6, "replies": [{"body": "I bought USOU (3x oil) on Friday, so I feel you. One Trump tweet today and I’m down 9%. ", "score": 3, "replies": []}, {"body": "I bought last week at the top :(", "score": 1, "replies": []}, {"body": "Bought at 320 and 345 so ... yeah", "score": 0, "replies": []}]}, {"body": "This is gonna be a shit show for trading tomorrow! Can’t wait. I recently bought the dip last week or so and sold at 300 today. Was thrilled to see it tanked ah on this so I bought again at 285. They will 100% take it to 300 again. ", "score": 5, "replies": [{"body": "$950,000,000 worth of bonds are due in cash on March 1st. This may already be priced in but thread carefully. ", "score": 6, "replies": []}]}, {"body": "And it's still drastically overvalued. They are going to get creamed as more experienced and connected OEMs enter the EV market.", "score": 2, "replies": []}, {"body": "Out at 300 again. Stock is equally a shit show as Elon. ", "score": 2, "replies": []}, {"body": "ik this is r/stocks not r/wsb so i wont say time to yolo tesla calls\n\n\n\nhowever, i do think it's not a bad idea to get some while it's hot droppings", "score": 1, "replies": []}, {"body": "This past year has been a poster child for “watch what you post on social media.” \n\nRoger stone had his gag order suspended, almost went back to jail over an Insta post. Now Elon is found in contempt over a tweet.", "score": 1, "replies": []}, {"body": "This is so dumb. Why is everyone up his ass? We're not letting him be himself and it's really fucked up.", "score": 1, "replies": []}, {"body": "He grossly misrepresented the factors in something that he has tangible control of.", "score": 1, "replies": []}, {"body": "Good , go NIO ", "score": -1, "replies": [{"body": "Just a cursory glance at their site. Where are there quarterly and annual statements? I can't find any of these sec filings for them. ", "score": 5, "replies": [{"body": "It's a Chinese Company that hasn't built a single car yet. ", "score": 0, "replies": [{"body": "They produced like 5000+ in Q4 2018. As for earnings....", "score": 1, "replies": []}]}, {"body": "It's best to just go to EDGAR and search there. It's a pretty easy to use site. \n\nNIO is an ADR and only IPOed about 6 months ago. \n\nER is March 5. ", "score": 0, "replies": []}, {"body": "I read they will report earnings first week of March", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "First get him to stop issuing false statements.", "score": 11, "replies": [{"body": "But he didn’t? Also, the SEC is literally going apeshit over a tweet lmao\n\nhttps://twitter.com/elonmusk/status/1100215984713957376?s=20", "score": 3, "replies": [{"body": "why sec punish daddy elon for violating agreement he make with them earlier :( sec should be focus on thing that the sec doesnt have any control over ", "score": 1, "replies": []}, {"body": "Tweets are, for some reason, taken to be actual statements of some notoriety these days.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "They don’t have the capacity to build another model as they’re pretty much maxing out capacity at Fremont just trying to build the Model 3, and they have so many problems to deal with just trying to manufacture and support that vehicle that I think it would be unwise to attempt to put out another model at this point. They’d probably need to kill production of the S and the X to even have the capacity, or preferably open another facility somewhere. To say nothing of the costs of developing the vehicle and getting it into production.", "score": 2, "replies": [{"body": "What about the semi?  Where’s the semi?  Or was that basically just a giant lie/publicity stunt..?", "score": 1, "replies": [{"body": "IMO, I think that Tesla does have something in the way of R&D into the semi, but it’s the same problem as building the Model Y or a pickup or any other model expansion. Tesla doesn’t have the production capacity to build it, and it doesn’t have the money needed to expand production. I think, charitably, that Musk intended to have a semi and the Model Y on the market, but Musk is pretty terrible about building sustainable, scalable systems at Tesla and as such won’t have the ability to produce these vehicles for the foreseeable future.", "score": 2, "replies": [{"body": "He “intended” to have it on the market?  That’s pretty charitable.  Surely they have folks on staff with expertise in manufacturing - maybe even CAR manufacturing - that could advise on capacity issues, etc.  I mean, did they really plan so badly that they needed to build a tent?  Will they build a bigger tent to build the semi?", "score": 1, "replies": []}]}]}]}]}, {"body": "Nothing will happen out of this. In America you can do whatever you want if you have people and public opinion behind you, Musk is a master at convincing gullible people (99% of the population to follow him)\n\nIt would also be so anti-climatic , this liar has to go down because of a full blown market refusal to buy his company's shitty products, not because of a beurocratic caveat .\n\nMe thinks he did it on purpose because he wants to be fired before inevitable ch.11", "score": -27, "replies": [{"body": "“Me thinks” your wrong. Buy the dip. ", "score": 13, "replies": [{"body": "You’re*", "score": 3, "replies": []}]}, {"body": "Surely you are the 1 in 100 who is wise enough not to be fooled, oh great one.", "score": 2, "replies": []}]}, {"body": " \n\n## Tesla  share closed at $298.77 on Feb, 25 2019 but was peaked at $387.46 two  months ago. Is it a good time to invest now given the latest news  against their founder?", "score": -2, "replies": [{"body": ">manipulating \n\n \n\nThus far from what I read, it seem like its dangerous to own this stock...", "score": 1, "replies": []}]}]}
{"title": "Tesla finally launches base Model 3 for $35,000 with shorter range and new interior", "selftext": "", "id": "avwm06", "created_utc": 1551390877.0, "score": 76, "upvote_ratio": 0.93, "num_comments": 108, "comments": [{"body": "And they said it couldn't be done 👏", "score": 46, "replies": [{"body": "They said it couldn’t be done, and be profitable.", "score": -17, "replies": [{"body": "Haha I'd suggest dropping that bear argument sooner rather than later to maintain some credibility ", "score": 19, "replies": [{"body": "https://twitter.com/nealboudette/status/1101253352195796997?s=19", "score": 4, "replies": []}, {"body": "What it’s going to be very hard for them to show any profit on these models. How is that this controversial?", "score": 5, "replies": [{"body": "Seriously? \n\nOf course it's going to be hard. Everything about starting a new auto company, and an electric auto product is hard! If it wasn't it would have been done by now...\n\nYet here we are, and you're still chirping on about this despite everything?\n\nProfits might be tight to start but we know there's still production streamlining capacity, just like they're still doing with the S and X lines. This will be a profitable vehicle.", "score": 14, "replies": []}, {"body": "I get it, and I think they might be cutting it tight with the base 3 now, but I would not be surprised if the base 3 has a double-digit margin by the end of Q2.", "score": 1, "replies": []}, {"body": "You think most won't spring for Standard Plus and the base Autopilot package? That adds $5k to the price with a simple software activation and seat change with a few more speakers. That's gonna be pushing a 20% margin with their cost savings in streamlining the business and manufacturing. Tesla has spent years doing market intelligence with their products and they know how to up-sell them, really the products stand on their own and up-sell themselves. Get a grip and accept that Tesla has a good roadmap. ", "score": 1, "replies": [{"body": "I believe the ASP will be in the mid 40s", "score": 1, "replies": []}]}]}, {"body": "He's right, we are still yet to see what sort of margins are being made on these builds.", "score": -4, "replies": [{"body": "They said they wouldnt release until profitable.  Here we are.  What he says isnt right lol, he is nobody ", "score": 8, "replies": [{"body": "https://youtu.be/3bImBBTaPDY", "score": 6, "replies": [{"body": "I wanna like you and not like you at the same time. You have these extreme and very strong opinions but then you're just about the only \"other sub\" bear crowd guy who tries to have a useful conversation that's not hostile and you're funny. No homo.", "score": 5, "replies": []}]}]}]}]}, {"body": "flufferbot01 in 2025: \n\n\"They said the 35k model wouldn't be profitable, and not make Tesla run out of cash in 1,000 years\". ", "score": 10, "replies": []}, {"body": "Oh, here we go...", "score": 2, "replies": [{"body": "And\n\nhttps://www.cnbc.com/2019/02/28/elon-musk-tesla-not-profitable-in-q1.html", "score": 3, "replies": [{"body": "Jesus Christ.. \n\nWe knew Q1 would not be profitable. \n\nElon LITERALLY said last year that he expects every quarter going forward to be profitable with the possible exception of Q1. \n\nSimply reiterating this is not ground-breaking news. And does not in any way shape or form, in any POSSIBLE sense under any CONCEIVABLE definition, have anything to do with Margins for the M3. ", "score": 9, "replies": [{"body": "https://www.fool.com/earnings/call-transcripts/2019/01/31/tesla-tsla-q4-2018-earnings-conference-call-transc.aspx\n\n>\tSo, we’re working every aspect of that logistics chain. And I think we’ve —I think it’’ going to be good. I would say at this point, I’’ optimistic about being profitable in Q1. Not by a lot, but I’m optimistic about being profitable in Q1 and for all quarters going forward.\n\nQ4 conference call. ", "score": 4, "replies": [{"body": "...Not exactly a devastating statement either way tbh.", "score": 4, "replies": []}]}, {"body": "He said a tiny profit last time ", "score": 5, "replies": [{"body": "He said maybe.", "score": 9, "replies": []}, {"body": "When your last ditch arguments boil down to semantics and gotchas. ", "score": 1, "replies": []}]}]}, {"body": "I read the article but where did they get that information from? Did Elon tweet about it or what?", "score": 3, "replies": [{"body": "By had a closed door meeting with journalists.", "score": 2, "replies": [{"body": "Shouldn’t this sort of information be disseminated to the public though? Not just to journalists...it’s material information regarding the stock. ", "score": 2, "replies": [{"body": "https://www.reddit.com/r/teslainvestorsclub/comments/avxb2f/comment/ehiqcct?st=JSPFF85R&sh=00d41404", "score": 2, "replies": [{"body": "Great minds think alike", "score": 2, "replies": []}]}]}]}]}, {"body": "That could be seasonal though. It still means that we're going to have to wait to proclaim it *proven* profitable but it doesn't cement it as a money loser either. The information isn't in.", "score": 1, "replies": []}]}]}, {"body": "You will be eating your hat soon, my friend", "score": 2, "replies": []}]}, {"body": "And apparently we were right. No base Model 3 was ever produced.", "score": 0, "replies": [{"body": "Boy you sure are reaching, you know well and good when production is scheduled for. Commenting on shit a month old? Sad", "score": 1, "replies": [{"body": "They're not making the base model ever. They're just software limiting an SR+.", "score": 0, "replies": [{"body": "God forbid people have an option to upgrade without a lengthy and painful battery swap, while still getting access to one of the best car platforms at a great price. Y'all shorts are worse than the most annoying girlfriends at finding shit to bitch about. \n\nAlso, that IS a base model. Manufacturers globally build cars into a platform, then limit access to features available on that platform. You ever seen those plastic filled buttons in car dashboards or paying extra for navigation on an infotainment system? Like wow dude, dense", "score": 1, "replies": [{"body": ">Also, that IS a base model.\n\nWhere's the cloth seats?\n\nIt's not the base model as was described. There is no new interior. Tesla never made that model.", "score": 0, "replies": [{"body": "Boohoooo the interior isn't as shitty as other base models. Dude go find another hobby and leave me alone.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "They could sell them for $15 a piece. ", "score": -4, "replies": []}]}, {"body": "This is fantastic. I'm genuinely so proud for the company, I don't even give a fuck what the stock does tomorrow. Truly.", "score": 22, "replies": [{"body": "How could anybody disagree with this?", "score": 3, "replies": [{"body": "Because I own the stock, so I only agree with the first two things he said (which are arguably the two least important things he said).", "score": 2, "replies": []}]}]}, {"body": "I was expecting this somewhere around late Q3 / early Q4. Wtf? February 5th Elon tweeted \"We’re doing everything we can to get there. It’s a super hard grind.\" \n\nExciting!\n\nhttps://twitter.com/elonmusk/status/1093046377460813825", "score": 17, "replies": [{"body": "He's definitely started under promising when it comes to timelines. Which is really cool to see. This is huge. We don't know the margins but there are 100s of thousands of new orders now. Huge news", "score": 19, "replies": [{"body": "This brought up an interesting thought for me.. had he tweeted this week production to be 350k week and the stock dropped until he clarified 4 hours later, would SEC still attempt to hold him in contempt? If not, It adds to the theory that SEC is focused on protecting the short market.", "score": 4, "replies": [{"body": "Yes, because he shouldn't really be that casual with twitter. ^(I feel dirty just putting those words into one sentence!)\n\nThe point of the review that was supposed to be put in place is so that kind of thing doesn't happen.", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "When you compare it to the mission statement - trying to accelerate the advent of green tech - then releasing as accessible a model as early as possible is the obvious answer. Good for the business or not, I think he decided to release the car the soonest that the company could survive it, not the soonest that they could make it fiscally sensible.", "score": 3, "replies": [{"body": "It’s good business.   Lots of customers will now say “holy shit I guess I can afford a Tesla”.   Some of whom will get upsold.  I was a 35k reservation holder; and now I have a 100d model x.", "score": 2, "replies": [{"body": "I mean fair enough, but in the planning process you can't assume a significant percentage will do that without risk. I'm sure that the folks there know more about it that I do, but it was just the feeling I got that this was more about surviving the flood of low-profit cars than being successful because of them. ", "score": 2, "replies": []}]}, {"body": "Not sure that makes sense though. The soonest the company can survive doesn't mean it's the best thing for their mission statement. Sell low-margin cars with little to no profit means a delay in the ability to invest in things that could actually be more important.\n\nI think they simply are seeing the high-cost M3 demand really tapering off. They'd be pushing high-priced, profitable cars if they could IMO.", "score": 1, "replies": []}]}, {"body": "Its possible that because everyone knew a price cut was coming that it was delaying sales.  ", "score": 2, "replies": []}]}]}, {"body": "wow they are killing stores and selling only online. I never once thought about that possibility.", "score": 15, "replies": [{"body": "That explains the up coming layoffs rumor ", "score": 7, "replies": [{"body": "likely", "score": 1, "replies": [{"body": "Yea fucking sucks.\n\nWe can say a lot of things about Tesla, but it does have a dedicated work force. Those people are squeezing water from sand.", "score": 2, "replies": [{"body": "Not really.   Sales people just walked you through the configurator anyway.", "score": 3, "replies": []}, {"body": "Uh...huh? The fuck does that mean.", "score": 0, "replies": [{"body": "It’s an expression for an impossible task.", "score": 5, "replies": [{"body": "What exactly are they doing that's so special?", "score": -6, "replies": [{"body": "He's not just talking about sales staff. Chill man.", "score": 2, "replies": [{"body": "I mean the guy mentioned layoffs followed by \"those people\". It was a reasonable read. ", "score": 1, "replies": []}]}]}]}]}, {"body": "uh huh", "score": 0, "replies": []}]}]}]}, {"body": "Are they killing showrooms though?  They sales will all be moving online, but I haven't seen any mention of killing showrooms.\n\nHe has said previously that Teslas will be technologically capable of driving themselves, fully autonomous, from the factory to the doorstep probably within the year.  So it makes sense and is capital efficient to not invest in building thousands of dealerships and stores if you don't need them for distributing the cars.", "score": 3, "replies": [{"body": "It was in the blog post on the home page. All but certain high-traffic locations which will serve as showcases. \n\nIt shows how willing they are to pivot and turn on a dime if they need to. They still function like a start-up. Legacy automakers can't compete with that. They don't need to right now because they're so far ahead. But by the time they realize they need to cut their losses on ICE and go all-in on EVs, it may be too late. \n\nI think it's good. They were experiencing a lot of headwinds with \"conservative\" (ie corrupt cronyism) states like TX outlawing corporate dealers. They can take the $ to help with margins. Once they've driven costs down and they've sold millions of vehicles, they can have a sizable force of customers to lobby on their behalf. ", "score": 3, "replies": []}, {"body": "Hell, even to the nearest Supercharger would be great.", "score": 1, "replies": []}]}, {"body": "It does show why a CEO like Elon Musk matters.  You put a manufacturing CEO in and all you are going to get are manufacturing price improvements.  People like Musk really understand where society is going and software improvements have the greatest chance of having the biggest effect.", "score": 1, "replies": []}]}, {"body": "Deliveries within March for all variants.", "score": 9, "replies": [{"body": "Would be v surprised if they actually shipped any Standard Range models before April, but I guess we'll see.", "score": 2, "replies": [{"body": "They needed to generate a large amount of US demand so they can build and deliver vehicles before the end of the quarter. I would be very surprised if they *don't* deliver a large number of Standard/Standard+ models within March.", "score": 4, "replies": [{"body": "Bingo.", "score": 2, "replies": []}]}]}]}, {"body": "Model S and X order pages aren't back up yet, but Model 3 is. Maybe more news to come?", "score": 5, "replies": [{"body": "Standard range S now available at lower prices.", "score": 2, "replies": [{"body": "How much cheaper is it compared to when they removed the 75d?", "score": 1, "replies": [{"body": "It is 3 grand more but has more range. \n\nThe new standard range S is $79k with a 270 mile range. The removed 75D was $76k with 259 miles of range. So 11 more miles of range, about 3kWh, for 3k. Not a great deal not sure if the pack is software limited and can be upgraded for a fee at a later time. Much quicker than a 3LR but 36k more with less range. \n\nLong range is only 83k for 335 miles. I say only because I paid over 103k for my 85D with 270 miles of range. The step up from 79k to 83k is a 4k difference but it gets you 65 miles of range. Totally worth it in my opinion.", "score": 3, "replies": [{"body": "Wow I didn’t catch that 4K was the difference between 65 miles of range plus faster acceleration. Totally worth it, I agree. ", "score": 3, "replies": []}]}]}]}]}, {"body": "This tells me they found substantial efficiency savings likely in battery technology. ", "score": 4, "replies": [{"body": "Maybe it wasn’t about price,  but supplier contracts. \n\nIf Tesla is on the hook to buy all those Panasonic batteries, maybe zero or near zero profit isn’t that bad.", "score": 1, "replies": [{"body": "Do you think they've overcome the battery bottleneck to such a degree yet? Not long ago they were struggling with ramping the 3 production while having to buy batteries for grid storage from Samsung at the same time.", "score": 1, "replies": []}]}, {"body": "Or it won’t have the same gross margins, they can make it with current prices it just won’t produce a profit. It’ll probably be about break even.", "score": -1, "replies": [{"body": "I've got a hunch that this release was not a business decision, but a Musk-style decision. \n\nI don't think they waited until they could make the car profitably, but just until the company could survive it. Musk-like in that the focus is entirely on making the car accessible to the widest consumer base (speed up green tech spread and all that), regardless of the obstacles (prudent fiscal and business sense).", "score": 5, "replies": []}, {"body": "I can't wait to quote this in Q2\n\n* Btw just so we're clear, I do appreciate having you on this sub. A bit of realism never hurt anyone, so thank you for your viewpoint, regardless of how backwards  your logic is most times ;) ", "score": 6, "replies": [{"body": "Please do!\n\nAlso for reference I have been saying Q1 and Q4 will be losses. Q2 and Q3 stand a chance of being profitable.", "score": 3, "replies": [{"body": "Why Q4 out of curiosity?", "score": 2, "replies": [{"body": "Honestly I am going to have to revise this now, it was based on them being able to squeeze more higher margin cars into Q2 and Q3. \n\nI thought the SR would be out in July-ish, and they’d have greater international sales. That combined with the fact I thought they’d hoard ZEV credits for those two months.\n\nFigured most of the demand levers would run out by Q4. And in Q4 they’d be shipping a lot of SR.\n\n(Really interested to see the February numbers tomorrow)", "score": 3, "replies": []}]}]}]}, {"body": "I sure as hell hope they aren't selling the base 3 at a loss. Break-even is tenable because after a few months of cost reduction there will be a small margin, and after a year that will have grown.", "score": 1, "replies": []}]}]}, {"body": "Watching CNBC cover this is making my brain hurt.\n\nMust... hit... stop... button.", "score": 7, "replies": [{"body": "Why are you even watching cnbc? Lol... might as well get your news from seeking alpha", "score": 6, "replies": [{"body": "I sometimes have it on in the background while trading stocks. I heard Tesla so I actually started watching. Dayam they dumb.", "score": 5, "replies": []}]}]}, {"body": "Gonna start trading at 2:40pm. My guess is down pretty hard.", "score": 4, "replies": [{"body": "You right. What was your reasoning?", "score": 2, "replies": [{"body": "Dropping prices doesn't guarantee anything about the direction of costs, so the overall expectation should be that they are cutting into profitability to raise demand. This is a very substantial price cut across the board, not even just the SR model but others as well.\n\nOn the other hand, they offer the 6% cost reduction of closing all the stores, but we don't know that number for certain so it raises uncertainty.", "score": 4, "replies": [{"body": "Makes sense. Thanks", "score": 2, "replies": []}, {"body": "Hey, we agree! I'm getting a plaque made.", "score": 1, "replies": [{"body": "Maybe you know each other better than I do.\n\nIMO, /u/ElonsMonkey is pointing out how it will be read without *necessarily* fully agreeing with that interpretation himself while you probably agree with it, right?", "score": 3, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yes", "score": 1, "replies": [{"body": "But why?", "score": 2, "replies": [{"body": "Markets are closed?", "score": 2, "replies": [{"body": "After hours", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Careful. The Saudis don't like people being impolite to women.", "score": 4, "replies": []}]}, {"body": "https://3.tesla.com/model3/design?#battery", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Pretty sure he was just playing along with the memes that have been all the rage the past few days", "score": 3, "replies": []}, {"body": "elephant is the one for stepping on all the buyers who bought their cars prior Feb 28th 😂", "score": 2, "replies": []}, {"body": "The elephant in the room? Giving competitors the tusks?", "score": 2, "replies": []}]}, {"body": "This is the best tl;dr I could make, [original](https://electrek.co/2019/02/28/tesla-model-3-standard-battery-interior/) reduced by 89%. (I'm a bot)\n*****\n> Tesla is finally launching the long-promised standard Model 3 with a base price of $35,000 - fulfilling Elon Musk&#039;s &quot;Secret masterplan&quot; released back in 2006.\n\n> The automaker is now making several new versions of the Model 3 available with a shorter range and new interior options.\n\n> Along with these changes, Tesla is going to release firmware updates that is going to enable a 325-mile range in the Long Range Rear-Wheel Drive Model 3, which was the first version of the car.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/avxboq/tesla_finally_launches_base_model_3_for_35000/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~386479 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Model**^#1 **standard**^#2 **Tesla**^#3 **range**^#4 **available**^#5", "score": 1, "replies": []}, {"body": "Boooo he rulened the surprise.", "score": -3, "replies": [{"body": "You forgot to switch your account bud", "score": 7, "replies": [{"body": "?", "score": 1, "replies": []}]}, {"body": "How do you mean?", "score": 1, "replies": [{"body": "Fred broke the news early", "score": 2, "replies": [{"body": "How did he even get his hands on it ahead of time?", "score": 1, "replies": [{"body": "It leaked to internal sales staff, that the 35k 3 would launch.", "score": 2, "replies": []}]}]}]}]}]}
