{"title": "Considering buying Pfizer", "selftext": "Pfizer is down almost 20% over the course of a month, and offering a 3.65% dividend. \n\nI’m considering picking some up since the appear cheap at the moment. \n\nI don’t much other than the fact that they are a huge biopharmaceutical company which Is a sector I have little exposure and knowledge.\n\nWould it be fair to say this company trades alongside covid vaccine related news and expectations at the moment? \n\nWhat do you guys think about Pfizer as a company in general and as a potential investment at this point?", "id": "10gzl6s", "created_utc": 1674228076.0, "score": 26, "upvote_ratio": 0.69, "num_comments": 65, "comments": [{"body": "Just a heads up, vaccine production tends not to be a big money maker long term. A bet on PFE is a bet that they used their windfall from COVID to invest in new companies and that those investments will bear fruit", "score": 29, "replies": [{"body": "Long term? True.\n\nWas it the single biggest product they’ve ever had? Yes. They “expected” to make $3bn to $5bn.\n\nThey made $65bn in the first year year from it and 2022 was expected to be $100bn revenue.", "score": 7, "replies": [{"body": "homer simpson buys pumpkins investment", "score": 2, "replies": []}]}]}, {"body": "Why do you think it appears cheap? How much do you expect them to do in net income in 3-5 years? Or in 10? How much growth does that translate to? What's a fair PE for such a growth rate? What market cap does that translate to? How much ARR is that from the current stock price? How big is the risk you're wrong? Does the ARR justify that risk compared to low risk investments (S&P or bonds)?", "score": 39, "replies": []}, {"body": "Pfizer is a pharma giant that has definitely ridden a wave of Covid related income. There’s a debate over how long that income stream will continue but I think there’s also added value in the technology, partnerships and knowledge the business has acquired over the past few years. There are few companies capable of doing what Pfizer did and we know they are strongly connected and positioned for future health crises. In my opinion it’s a reasonable valuation now. There are certainly more catalysts you can envision than downsides for the business in the future. Personally I made a ton on very cheap PFE options, which continue to be underpriced.", "score": 8, "replies": [{"body": "One thing we can say for sure is that in future pandemics, Pfizer/BioNTech/Moderna will get funding. Truthfully, had the mRNA not worked as well as they did, we'd probably be saying how amazing AstraZeneca's vaccine is.", "score": 0, "replies": []}]}, {"body": "Something for us to keep in mind is that there will be another pandemic in about two years. I assume that the DoJ will team with Pfizer just as they did this time.", "score": 4, "replies": []}, {"body": "Have had PFE for decades have 4 figure shares from reinvestment from 100s. My cost basis is 1/3 current price. Covid vaccine generates  >1% of corp revenue. They sell vaccine at cost since NIH give grant for the development. Not sure what elSE they got going. The rating from analysts Moringstar is 3 star and MSCI is rated A. Zacks 3 or B grade. Looks like time to load up these as there are other pandemics on their way.  These blue chip stocks are better than new ones, imo.", "score": 6, "replies": [{"body": "Blue chips are the way to go but I would sell all of Pfizer. Reminds me of the Sackler family.", "score": 2, "replies": []}]}, {"body": "….. Pfizer makes many well known drugs and has multiple in development for cancer and neurological applications.\n\nIf you heard of someone who utilized epipen, Eliquis or viagra they used a Pfizer product.\n\nEdit to add I work in healthcare but am only invested in Pfizer as the diversified holdings in my chosen ETF.", "score": 3, "replies": []}, {"body": "> Pfizer is down almost 20% over the course of a month\n\nbecause there is \"an ongoing investigation into the acquisition of COVID-19 vaccines in the EU\".\n\nhttps://www.fiercepharma.com/pharma/european-public-prosecutors-office-confirms-ongoing-investigation-european-unions-covid-19", "score": 3, "replies": []}, {"body": "Covid vaccines are a tough investment. You’re betting on how much uptake there will be in the future. It’s already become clear, IMHO, that the govt is unlikely to mandate anything other than the primary series. Booster uptake has been low, and this is while the govt has been paying for it. It will go private this year. \n\nThere are companies like NVAX that had a good vaccine but due to poor management and poor execution have made shareholders poor. \n\nI’m not sure I’d feel great betting on Pfizer. I honestly think if we *do* end up with common yearly shots, NVAX has a decent chance if their new CEO is any good and their combination shot works out — they’re trialing a combo flu and Covid shot using their Matrix-M adjuvant and if it works, I think a one-a-year flu and Covid shot will be compelling for a lot of people and insurers", "score": 8, "replies": [{"body": "Pfizer doesn’t just make Covid vaccines…", "score": 27, "replies": [{"body": "Username checks out!", "score": 8, "replies": [{"body": "Explanation: Pfizer made sildenafil (Viagra).", "score": 1, "replies": []}]}]}, {"body": "Covid vacccines are a pretty small fraction of their business.", "score": 2, "replies": []}]}, {"body": "There are no such things as \"cheap shares\", you can see their real value every second during trading hours", "score": 11, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "And who exactly thinks that a company is undervalued? For sure, not the market", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "This is correct but there are also lots of wellknown companies meeting all of these criterias - and investors lost a ton of money nevertheless within last year", "score": 1, "replies": []}]}]}]}]}, {"body": "Wouldn't say Pfizer trades around covid vaccines that much. It certainly gave them a boost but they were a juggernaut before that and will continue to be even as covid vaccines become less common.", "score": 2, "replies": []}, {"body": "\"What do you guys think about Pfizer as a company in general and as a potential investment at this point?\"\n\nVaccines are not a giant part of profits, but I don't know that I have tremendous confidence that what money that is will be reinvested well. Pfizer has had successes in the past, but they've also had misses (they would have overpaid massively for Allergan if it wasn't blocked) and the stock is around where it was a bit over 20 years ago. \n\n\"and offering a 3.65% dividend.\"\n\nEh. Should really not be a part of the thesis.\n\nI agree that you're probably seeing some rotation out of what has done well/safety into what hasn't and that's part of the reason for the PFE decline. It is technically oversold and certainly reasonable at this point - maybe something I'd consider trying to play a bounce in but personally not interested as a long-term holding.", "score": 2, "replies": [{"body": "As someone in the industry, Pfizer is known to be willing to throw a lot of money at things to get problems solved. They make use of a lot of CROs but it works. Pfizer is a reasonably stable company in a volatile industry.", "score": 2, "replies": [{"body": "Stock has been on downtrend for a while and its not reverting back to the mean.\n\nDo you think its a fairly stable company?   I personally think they need new management", "score": 0, "replies": [{"body": "The company is fine, it's a typical blue chip. It's down because it was inflated during the pandemic from vaccine revenue.", "score": 2, "replies": [{"body": "It has been on a non stop downtrend.\n\nI think they are gonna get accused of all the vaccine mess", "score": 0, "replies": [{"body": "The odds of a \"vaccine mess\" is practically zero.", "score": 1, "replies": [{"body": "All righty,  Im gonna follow your advice since you work in the industry.\n\nI typically wheel stocks but I dont mind bagholding PFE and collecting 4.25% dividends", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Did you notice that you think it looks cheap, but mentioned only that it's off its high? I see this constantly on Reddit.\n\nBeing off its high has zero to do with it being cheap. Many stocks are way down from highs but remain expensive.\n\nYou need to think about likely future earnings, cash flow and debt to determine whether it's cheap.", "score": 2, "replies": []}, {"body": "Pfizer is evil. Don’t support the evil.", "score": 3, "replies": [{"body": "Evil is where the money is.", "score": 3, "replies": [{"body": "Not necessarily. Don’t invest in your own genocide.", "score": 1, "replies": []}]}]}, {"body": "Tread lightly my friend, there could be very dark storm clouds ahead for Pfizer as more is revealed about this \"vaccine\".", "score": 1, "replies": []}, {"body": "There is something brewing in the EU around Pfizer. If the conversations between EU and Pfizer that are classified get out, ti could be a shock for the stock. The stock went up because of covid, and the shady stuff they did during that time, could bring it back down if it gets out.", "score": 1, "replies": [{"body": "If you know, what is it that hasn't gotten out yet?", "score": 1, "replies": []}]}, {"body": "Wow lot of vaccine hate here..look..we had to do something..should everyone have gotten it..after delta I got it because virus seemed to be getting stronger so it came to a crossroads of wait and the consequences could be severe so I took the vaccine..\n\nNow..compare us with China. They are still actively getting fucked up by the virus. It wasn’t a perfect fix but it absolutely stopped the maddness around the virus. If China gets smart and adopts the vaccine you’ll crush it. \n\nShould you get Pfizer..idk..it’s safe they are big and powerful. There will likely be a new generation of meds just around the corner here so yeah it’s worth a play. They aren’t a one trick pony.", "score": 1, "replies": [{"body": "China is getting fucked up by their vaccine not covid.", "score": -1, "replies": []}]}, {"body": "There stock will crash, it’s a matter of time, Moderna too, they screwed all of us, it’s a matter of time now", "score": -4, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "They can’t get sued.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -8, "replies": [{"body": "How will you act when your conspiracy theories never become reality?", "score": 3, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "I’d love to see the sources!", "score": 6, "replies": []}]}]}]}, {"body": "Before investing in Pharma, I would suggest you look back at past lawsuits against them, and any that are currently pending.  \nThose will show you a lot about the Pharma company, and how likely they are to have big lawsuits against them in the future.  The bigger the lawsuits, or the more they have, may indicate bad practices that will cause future loses.", "score": 0, "replies": []}, {"body": "is good for a short time, after that the risk increases considerably", "score": 1, "replies": []}, {"body": "Prefer moderna for its technology. They made RSV vaccine in the fastest time", "score": 1, "replies": []}, {"body": "I’m holding 10 shares currently it’s down but I’m still holding", "score": 1, "replies": []}, {"body": "See the post from the Canadian news organization that HUNTED down the Pfizer CEO at DAVOS. One question was,  should all the countries that were lied to by Pfizer get their money back. Ouch, Hugh risk.", "score": 1, "replies": []}, {"body": "Nah man that shit is whack. Keep watching it and if  goes back up then buy. You want to get in with the crowd not buy cheaper shares bc tomorrow it could be cheaper then what?", "score": 1, "replies": []}, {"body": "Good core holding. They have a lot in Pipeline Customized drug", "score": 1, "replies": []}, {"body": "Horrible idea", "score": 1, "replies": []}, {"body": "Yeah, I’m thinking the vaccine specific companies had the biggest bull run they’re ever going to have, but good luck.", "score": 1, "replies": []}, {"body": "I wouldn’t bet on it trading with vaccine news per se. The company has been around a long time. I think PFE is cheap when compared to the rest of the sector. Money is rotating out of pharma right now, and I wouldn’t be surprised to see more downside. DCAing slowly over time is the safest strategy IMO. But DCAing on steroids is another option if you think the discount is worth snatching up shares.", "score": 1, "replies": []}, {"body": "I like it and have added some. It's far more than a Covid vaccine company. Seems like a solid pipeline of products. No guarantees but it's a good long term play that appears to be on sale now.", "score": 1, "replies": []}, {"body": "Personally I wouldn’t, I know too little about the Pharma industry to go into Pfizer. Pharma counts on patents going through to earn revenue, sounds like you’d need too much medical knowledge or information that I’m not equipped with to make any informed decisions.\n\nMost of the argument for Pfizer I’ve read and heard is that “It diversifies my portfolio” which I find to be a one dimensional argument that makes no sense. Yes diversity is important but not diversify into things you have no clue about. If everyone digs a hole, and you decide to follow. When the time comes, they could be using it as a shell scrape while you’re using it as a grave. Analogy for other people would know when to sell but you don’t. \n\nKnow what you’re diversifying into.", "score": 1, "replies": []}, {"body": "I like bullish put spread, or just sell put on pfe", "score": 1, "replies": []}, {"body": "Damn, how rich are you?", "score": 1, "replies": []}]}
{"title": "Elon Musk Sold Tesla Shares Before Company Acknowledged Weakness", "selftext": "", "id": "10gx9h4", "created_utc": 1674222117.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 55, "comments": [{"body": "This FUD article and all the others are also moving the stock price. Whom do I complain to?", "score": 18, "replies": [{"body": "The article is paywalled, but the title is factually correct.\n\nArticles rarely move the stock price.  Elon dumping billions is what kills it (at $300, and more recently ~$170).  Max pain on the 3rd Friday, and it's Jan 2023 leaps people have held for years, is what's moving the stock price today.", "score": 4, "replies": [{"body": "[removed]", "score": -2, "replies": []}]}]}, {"body": "The article is paywalled so I don't know the content but it was obvious he sold it because he needed to fund the Twitter deal asap, not because he knew that Tesla would show weakness.", "score": 8, "replies": [{"body": "\nYou should recheck those timelines.\n\nHe dumped billions AFTER twitter closed.  After he crashed the price from 160 through supports (down to 100) his story become that it was a cushion so that he wouldn't need to sell TSLA again in 2023.", "score": 1, "replies": [{"body": "it probably was to avoid margin call in the near future", "score": 1, "replies": []}]}]}, {"body": "This is monday quarterback special. \n\nBesides a made up timeline sequence of events, the question for an investigation would be if it will hold in court or not.  Now a lot of law firms love the gamble  of a jury in special districts, and the SEC has basically infinite resources for keep on litigating somebody to the death.\n\nin general, there must be some \"traumatic\" news that would have been withhold from public knowledge to pass the bar of \"definitely influencing the market\". \n\nagain, DA and lawyers love the gambles to and have little to risk for it (not their money) especially in light of a person like EM who splits the public opinion.", "score": 5, "replies": [{"body": "Did the stock go down after the news came out? Yes.", "score": 0, "replies": [{"body": "If that was sufficient, sales of stock among executives would not be possible.", "score": 2, "replies": []}, {"body": "Correlation is different from causation.\n\nCausation is what the law says need to be proved. The difference is expressed in term of “circumstantial” events, and the is the jury job to see if these correlations are enough. \n\nHow many stocks in the markets went down at the time the “insider info” was  made of public domain? Was there a downtrend ongoing? Did the market rebound after the initial loss? For how long? Would a delayed sell cause arm or advantage to the party? ( see recent run) was the sell scheduled? (Yes) and following SEC rules ? (Yes)  \n\nAgain using correlation is a tough argument to sustain any thesis. Gamble on a jury dislike of EM may pay off but is really going to be hard to defend during the appeal process.\n\nMost people ope the umbrella when it rains, to make rain happens we just need for everybody to open their umbrella.", "score": 3, "replies": []}]}]}, {"body": "This is a valid point which Gary black had pointed out. \n\nThe company's most recent guidance was that they would hit 50% production. Deliveries were \"just below\" so that leaves some wiggle room. \n\nBut Musk had to know they would miss production targets by tens of thousands of cars and sold without the company making that known. \n\nI believe he did it based on macro worries of the economy but he still has that knowledge which poses the question of insider trading.", "score": 0, "replies": [{"body": "47% is pretty darn close and sticks to their corporate message of roughly 50% growth on average YoY. It's silly to say it's a real miss", "score": 8, "replies": [{"body": "The miss wasn’t so much the small percentage difference as it was the small percentage difference *despite* price cuts.", "score": 1, "replies": [{"body": "Not sure what price cuts have to do with production limits? You do realise that there were still supply and COVID challenges in 2022 that are more likely to affect the 3% miss in production growth. If you even want to call it a miss.", "score": 1, "replies": [{"body": "It doesn’t. I’m speaking to deliveries and didn’t read the parent comment to your reply. Musk has made it very clear that he saw a downturn in market sentiment due to the fed. It’s clear he didn’t sell because Tesla couldn’t produce the cars. He sold because he saw people weren’t buying them at current prices. The fed rates he’s using to justify his short term bearishness has nothing to do with the amount of cars Tesla can produce.\n\nHe sold because he saw the demand issues coming.", "score": 1, "replies": []}]}]}]}, {"body": "Unsure about that. The guidance was for average across several years. In 2021 they over delivered, so on a 2 year timespan, they are on track", "score": 10, "replies": [{"body": "Nope. In the Q3 earnings call they said they would hit 50% production increase for the year.", "score": -3, "replies": [{"body": "Wrong. \n\nElon stated: \n\n>we anticipate continuing to grow our vehicle production sales deliveries by **on average** 50% a year as far into the future as we can see. […] Actually one caveat, I should say, growing production by 50% every year because deliveries… we’re trying to smooth out the deliveries and not have this crazy delivery rate at the end of every quarter, so. In fact, we’re just fundamentally running out of… there weren’t enough boats, there weren’t enough trains, there weren’t enough car carriers to actually support the wave because it got too big. So, whether we like it or not, we actually have to smooth out the delivery of cars intra-quarter because there aren’t just enough transportation objects to move them around.\n\nThey were only 3% off on production and they’d already told us the quarter before that they had logistics issues,\n\nRead the [transcript](https://seekingalpha.com/article/4547634-tesla-inc-tsla-q3-2022-earnings-call-transcript)", "score": 9, "replies": []}, {"body": "This was discussed before. Q3 earnings was reassuring an average production increase.", "score": 9, "replies": [{"body": "\"As we look ahead, our plans show that we're on track for the 50% annual growth in production this year\"\n\n\"On the delivery side, we do expect to be just under 50% growth due to an increase in the cars in transit at the end of the year\"", "score": -1, "replies": [{"body": "\"We continue to expect a long-term volume CAGR of 50%, of which we may materially exceed this in 2021. \" <-- this was the long term guidelines in 2020. Going further back to 2019 or before it's always the same statement. They just over performed in 2021 and slightly underperformed in 2022. Don't over react.", "score": 9, "replies": []}, {"body": "Imagine being upset about missing 50% growth by 3%, in the car business. People are delusional.", "score": 10, "replies": []}]}]}]}]}, {"body": "1. Insiders can trade however the f they want in their own shares in their own companies based on information they know as long as they follow reporting guidelines.  This is not illegal insider trading, there is no “question,” it is normal.  Perhaps you should understand basics of the law before you infer someone is committing a crime.\n\n2. If you know anything about Elon he doesn’t sell based on conditions, he sells when he needs money.    In this case, he did it because of twitter.  The guy doesn’t even have his own house for christs sake.  What does he need to take profits for.\n\n3. Elon sells tesla shares because it’s his only liquid asset on the public market.  Just wait until starlink goes public at a 50B valuation and Elon starts buying Tesla shares and watch this whole stupid narrative about “Tesla Elon pump and dump” be flushed down the memory hole like so many other ridiculous Tesla theses. All the people who susbscribe to this shot will all of the sudden be nowhere to be found like all the hystericals during COVID.", "score": 5, "replies": [{"body": "No they can't sell whenever they want.\n\nAnd Musk knew non-public information which could be seen as negative. Even though he DOES typically sell just because he needs the money, it's still opens the question.", "score": -1, "replies": [{"body": "CEOs will always know insider information, that's why they have to report. If they couldn't trade if they knew insider info they would never be able to buy or sell.", "score": 6, "replies": []}]}, {"body": "Agreed. \n\nElon aside, the amount insiders that have been selling over the last 5 or 6 quarters has been nothing short of stunning. \n\nElon, The board, Kimbal, the executive team.  It’s all out there and everyone invested in TSLA is or should have been aware of it.\n\nEdit:\n\nImo, The only scummy thing Elon did was telling everyone to think “long term” while he was selling.  \n\nThe “first in last out” & “I’m done selling” comments are up for debate.", "score": -1, "replies": [{"body": "> The board, Kimbal, the executive team. It’s all out there and everyone invested in TSLA is or should have been aware of it.\n\nI understood that most of those sales were scheduled a long time before.", "score": 3, "replies": [{"body": "You really should file a 10b5-1 plan if you are an insider, most insiders do.  Huge liability otherwise. \n\nYou can stop them, amend them & initiate new ones depending on your corporate governance which is one of Tesla’s biggest weak spots imo. \n\nThere are two ways to look at Tesla’s insider trading.  \n\nBulls say of course, it’s comp, nothing to see here.  \n\nBears say there have been virtually zero buys over the last two years and a shit ton of non-stop sales.  Why would anyone sell the stock all the way down? The general rule is if all the insiders are constantly selling you should sell too. \n\nImo both are correct.  \n\nHere is a good source if you want to learn more about the 10b5-1 rule.  \n\nhttps://www.investopedia.com/terms/r/rule-10b5-1.asp", "score": 1, "replies": [{"body": "Yes, but were those sales pre-scheduled or not?", "score": 2, "replies": [{"body": "Yes, generically speaking a 10b5-1 sale is by definition pre-scheduled.   Insider sales don’t require a 10b5-1 plan by law and there are plenty of play around timing.  Devils always in the details. \n\nTake Zach’s sales as an example.  Perfectly done from a bullish perspective.  He sells almost everything vested every month and has done so forever.  \n\nKimbal’s sale the business day before Elon’s poll is sketchy as hell. \n\nRead the source if it’s really important to you.", "score": 1, "replies": []}]}]}]}, {"body": "Let's not pretend like Elon no longer has any shares. First in last out being a lie only really makes sense if he liquidated all or most of his shares.\n\nAnd honestly, the Twitter purchase was started when the macro environment looked decent, interest rates were low, and companies were still advertising on the platform and the amount of bots was underreported. By the time the purchase went through, it turned out he needed more cash and the fed kept raising rates.\n\nElon still has the majority of his shares, and nobody with a brain thinks that he would have liked to sell as much as he did to end up buying Twitter and funding it for it to not die. Tesla for him is by far still his best chance of becoming a trillionaire, so to think that he just really wanted to bail out now when the company is now starting to really pump out cash and scale like nuts while keeping everyone on as bag holders is a truly stupid take.", "score": 3, "replies": [{"body": "Like I said, it’s up for debate.  \n\n“First in, last out” is black & white.  But that was years ago and is still a BS argument imo.   First, the first ever shares he sold he had to sell to pay taxes on expiring options.  \n\nHe also Tweeted about selling 10% so fair warning was given. \n\nSame goes for the “I’m done selling”.  Like you said, Twitter deal started in April.  It was very clear for awhile that he had to sell. \n\nBesides the company then & the company now isn’t even comparable.  I think people upset by this one are misguided.\n\nThe one that I have a problem with is the “think long-term” while he was selling even more.   Horrible optics at best, especially on top of all his other sales.", "score": 2, "replies": [{"body": "I think people like me were fine with it because the point is that his forced selling drops the price, which allows long term bulls to benefit instead of him. I've been buying since 2016, so forced selling events from him are always good news for me since I appreciate a good relative minimum. Others have no concept of DCA as a a useful way of expanding wealth, so if someone is going to view a stock going down in the short term as a horrible, deceptive, life-changing event for the worse, then that's just someone who is just a short term trader or at best does not know what it means to have a far off time horizon.", "score": 2, "replies": [{"body": "Seems like many on here aren’t very diversified, that makes it way more emotional.", "score": 2, "replies": []}]}]}]}, {"body": ">the amount insiders that have been selling over the last 5 or 6 quarters has been nothing short of stunning. \n\nIt's less than executives at other auto companies. Why can't you keep it real?", "score": 1, "replies": [{"body": "What auto companies? \n\nElon alone was over $40B.  It’s close to the entire market cap of most auto companies.  \n\nF & GM are $50B.\n\nEdit:\n\nUnless you are saying excluding Elon? Still curious what other auto companies insiders sold more than Tesla’s.\n\nEdit 2:\n\n“Both Tesla and Musk top the aggregate value of sales made by insiders in 2022, with Musk selling nearly $19.4 billion whilst closing a deal on the $44 billion purchase of Twitter.Dec 26, 2022”", "score": 0, "replies": [{"body": "> Elon, The board, Kimbal, the executive team.\n\nThat was you. That's like two dozen people. If you meant one you should have said one.", "score": 1, "replies": [{"body": "I’m assuming you are all-in invested in TSLA?  I’m going to also assume you realize that everyone at Tesla has been selling?\n\n$Bs aside from Elon:\n\nhttps://www.secform4.com/insider-trading/1318605.htm", "score": 0, "replies": [{"body": "That's their pay. They sold on the way up too. Your fearmongering isn't effective.", "score": 1, "replies": [{"body": "You said executives at other auto manufacturers sold more than Tesla’s executives.  You should at least admit you were wrong or provide the details. \n\nAs far as fear mongering goes, that’s ridiculous.  If you look at the comment you initially responded to I’m doing the opposite.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": ">Musk had to know they would miss production targets by tens of thousand\n\nProduction beat wall street's expectations.", "score": 1, "replies": []}]}, {"body": "It looks like OP posted an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.wsj.com/articles/elon-musk-sold-tesla-shares-before-company-acknowledged-weakness-11674177642](https://www.wsj.com/articles/elon-musk-sold-tesla-shares-before-company-acknowledged-weakness-11674177642)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)", "score": 1, "replies": []}, {"body": "Is this not also just after he tried to pump by saying the quarter would be \"epic\", and it fundamentally was not so in any way?\n\nHe has so much form on this that I do think it warrants some further formal investigation tbh. He plays his own investors for his personal gain over and over", "score": -1, "replies": [{"body": "They're still going through extreme growth and it's outperformed every other quarter. Just because Q4 didn't make up for supply chain issues and factory closures doesn't mean it wasn't a great quarter.", "score": 6, "replies": []}, {"body": "It was a record quarter? How can you say “it was not so in any way” when the only stats we have so far are both all time highs?", "score": 2, "replies": [{"body": "Because this guy isn't terribly honest.", "score": 2, "replies": []}]}, {"body": "It’s obvious he does. \n\nAlso not a coincidence his brother sold at close to $1200 high before Musk mass sold. \n\nThe guy plays the stock. ‘Epic’ indeed. \n\nMind you getting screwed on the Twitter deal must have pissed him off he is trying to recoup.", "score": -2, "replies": [{"body": "[removed]", "score": 6, "replies": []}, {"body": ">not a coincidence his brother sold at close to $1200\n\nThat's dishonest as fuck, bud. Kimball is always selling. All the way up, all the way down.", "score": 1, "replies": []}]}]}, {"body": "The way this sub downvotes any article critical of Musk will eventually cause huge losses.", "score": -2, "replies": []}, {"body": "WSJ continues negative articles on TSLA, nothing to see here", "score": 1, "replies": []}, {"body": "So\nweak.  You all make my head hurt.", "score": 1, "replies": []}]}
