{"title": "I’m thinking about buying and selling stocks like amazon and Tesla every day at a low and selling at a decent High", "selftext": "[deleted]", "id": "i4r4vl", "created_utc": 1596717840.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 31, "comments": [{"body": "Yes, it’s very risky.\n\nIt’s more risky because you’ve never lost money, so you don’t understand the *genuine* risk of losing when you bet big.\n\nI wish you luck, but experience tells me if you keep playing the game this way you won’t be playing the game for very long.", "score": 25, "replies": []}, {"body": "If it’s only been two weeks, I wouldn’t consider myself in the market quite yet. You’re in the learning stage my friend.", "score": 6, "replies": []}, {"body": "If it was that easy we'd all be rich.", "score": 12, "replies": []}, {"body": "Did this for 1 month in April with SNAP. Made a quick 2k. Played them from $11-13 buying and selling 800 shares everyday with 20 cent gains etc. All was fun until I missed a premarket rally and the stock jumped from 12.5$ to 17 without me on board. Did I get burned? No, but I missed out on the $4000, 1 day gain because I was fucking around swinging my 800 shares all day\n\ndecided to put my money to work in long term holdings instead.  One way or another you’ll get burned. Either the stock will run away from you premarket or fall midday and you’re trapped.\n\nIf you are going to do it, then learn how a small cap stock behaves. There’s a lot of smaller stocks that literally have the same pattern almost everyday. But be advised, one bad sentiment swing on the Dow can reverse any stock midday.", "score": 4, "replies": [{"body": "Snap is a bs stock anyways.", "score": 0, "replies": []}]}, {"body": "Should we tell him?", "score": 7, "replies": []}, {"body": "When is the high? When is the low? You may make money a couple times but the risk of getting it wrong outweighs the gains massively. There is no “simple trick to make money” otherwise everyone would do it. Wish you the best but, I’d stay away.", "score": 6, "replies": []}, {"body": "Lol", "score": 5, "replies": []}, {"body": "I'm gonna take it you haven't heard of T+2. This means you are limited to trading the money in your account, with a 2 day settlement period after you close your trade (Trade on Monday, your cash settles on Wednesday, etc.) Also, you can't know when the bottom is, nor can you know when the high is.", "score": 2, "replies": [{"body": "OP seems to think the market is just a blackjack table", "score": 4, "replies": []}, {"body": "What happens if you sell before the +2 day period?\nWill one get penalized and if so by how much?", "score": 1, "replies": [{"body": "The 2 day settlement period begins the second your sell to close order gets filled. If you commit enough Good Faith Violations (buying and selling before the funds from the initial sell have settled), your account will be restricted to trading settled funds for 90 days", "score": 2, "replies": [{"body": "Ah ok. Thanks. I ask because I started an individual brokerage account this Monday to start trading and I one of the stocks I bought among the regular ones was a penny stock just to see how the process was. Then the next day when the penny stock was up I sold it to see how selling works. I told my friend about it and he said i shouldn’t do it.\n\nI didn’t get any notification from TD Ameritrade though. Do they usually send a message if you violate stuff like that?", "score": 1, "replies": [{"body": ">Do they usually send a message if you violate stuff like that?\n\nDon't know, because I haven't committed any violations yet.", "score": 2, "replies": []}, {"body": "You didn't do anything wrong there. What you should avoid is this:\n\n1) buy on day 1 using all your funds\n\n2) sell on day 2. Your funds are now \"unsettled\" for two days\n\n3) buy on day 3 using any of your unsettled funds...this is fine\n\n4) sell on day 3, you've committed a good faith violation because you bought and sold using unsettled funds.\n\nInstead you should:\n\n5) sell on day 4, all good, your funds from day 2 have now cleared", "score": 2, "replies": [{"body": "Really appreciate you providing this example. Thanks. Made much more sense for me", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Do it, your never gnna be rich if you don’t try 😂", "score": 2, "replies": []}, {"body": "Do you understand how short term capital gains work?  Many people think they can do this but eventually their tax liability is more than their profit.\n\nhttps://www.dummies.com/personal-finance/investing/taxing-your-income-from-day-trading/", "score": 2, "replies": [{"body": "Can you help me understand how tax liability could be greater than your profit? I understand short term capital gains, but I am not understanding how trading short term options and profiting could lead to more taxes than profited?", "score": 3, "replies": [{"body": "He doesn’t know what he’s talking about", "score": 8, "replies": []}]}, {"body": "How can your tax liability outweigh your gains if your capital losses offset capital gains?", "score": 3, "replies": []}, {"body": "Say what now? ....capital gains taxed at 100%+ of that income? I dont think *you* understand how capital gains taxes work 😂", "score": 1, "replies": []}, {"body": "I'm sorta new but I just opened a Roth and it seems like you could do it there? Of course you can't touch profit til 60 and you won't be able to use any losings to offset gains. And you're limited to 6k per year, but something tells me a lot of these new traders arent using that much anyway.", "score": 1, "replies": []}]}, {"body": "Buy low and sell high, anyone can do it... super easy! That's why day traders succeed 100% of the time. There are no losers, only winners and big winners", "score": 1, "replies": []}, {"body": "Lmao. Try paper trading for few months and see if you make any money", "score": 1, "replies": []}, {"body": "This gets “proposed” every week by someone new.......while we’re at it, why don’t I just double my bet every roulette spin, eventually I’ll win!!!", "score": 1, "replies": []}, {"body": "Idk if this is a troll post or not but if it were this easy everyone would be doing it. You could very easily lose most of your money doing this.", "score": 1, "replies": []}, {"body": "Try swing trading (only difference is every few days vs intraday)\n\nSOXL is good", "score": 1, "replies": []}, {"body": "I love how everyone is laughing at you in this sub. Instead of laughing at you, This is what I can tell you. \n\nTest out your strategy. It will work and sometimes it won’t work. When it doesn’t work do not change your strategy. Nothing works 100% of the time. The issue is once something doesn’t work people move on to a different strategy. You need to stay consistent. \n\nMake sure you don’t risk more then 1-2% of your account.\n\nCalculate risk by $dollar amount / stop loss = shares. This way you can risk the same amount every time. \n\nTry a 1/2 risk reward or a 1/3 risk reward. You will see profit. \n\nSet exit and entry points so that emotions will not get to you. Let it ride.", "score": 1, "replies": []}, {"body": "Well, that’s quite risky and if it was that easy, every one of us would have been rich.", "score": 1, "replies": []}]}
{"title": "Microsoft aiming to buy all of TikTok", "selftext": "Microsoft's TikTok  takeover plans extend to the entire business, the Financial Times reports.\n\nThat includes not only the U.S. operations previously discussed, but also the video app's operations in India and Europe, according to the report.", "id": "i4u1h5", "created_utc": 1596728398.0, "score": 48, "upvote_ratio": 0.86, "num_comments": 33, "comments": [{"body": "Tiktok is big now, but what about for long term?\n\nThe whole app capitalized on the idea of everyone having short attention spans, who’s to say the people on the app won’t get bored and go on something else in a year or two", "score": 23, "replies": [{"body": "TL;DR", "score": 26, "replies": [{"body": "Nice", "score": 3, "replies": []}, {"body": "TL;D", "score": 2, "replies": []}]}, {"body": "it's possible, but FB has kept people for over 13? years now, so I don't see why some other SNS service wouldn't be able to.", "score": 3, "replies": [{"body": "I agree, this does seem possible.", "score": 1, "replies": []}, {"body": "While true, FB offers a lot of ways to communicate, organize, advertise, etc, that TikTok lacks. I have never used TikTok, but I assume it's sort of like Vine where people post short videos. If that's true, it's more of a one trick pony versus a FB.", "score": 1, "replies": [{"body": "I feel gross defending Tik Tok, but after seeing my wife delve into it, it has a surprising amount of content versus the other platforms. It's a lot of really random shit ranging from silly and dumb to actually pretty funny to genuinely interesting and dare I say...educational. \n\nI'm not sure what to think and I recognize the privacy issues and complaints, but I feel like its really easy to hate Tik Tok without realizing how much of a marketshare it is harnessing right now. People get bored going through their social media feeds, Tik Tok is like a neverending feed of random shit.", "score": 4, "replies": []}]}]}, {"body": "Seems like there have been 3 or 4 other apps before TikTok that did the same thing. What ever happened to Vine?", "score": 1, "replies": []}, {"body": "Yeah bc IG was a 1-2 year thing lol", "score": 1, "replies": []}, {"body": "the idea that social media platforms are a fad is an outdated notion by almost 2 decades. Myspace failed because of poor management and bad decisions, not because \"it was a temporary fad\". During the emerging years of the internet 2.0 there were websites that came and went, but any platform that manages to reach the level of popularity of facebook, instagram, twitter, snapchat, tik tok, is here to stay.", "score": 1, "replies": []}, {"body": "Instagram also just released its copy. When they did the same for Snapchat it’s slowly bled out. The Tik Tok platform isn’t proprietary, the audience is its only value, and everyone on Tik Tok already has Instagram...so what does Tik Tok really have in the end?", "score": 1, "replies": [{"body": "a separation from instagram", "score": 3, "replies": []}]}]}, {"body": "Go big or go home I guess", "score": 4, "replies": []}, {"body": "Why do I feel like as soon as MSFT buys this, all of a sudden it won’t be “cool” anymore.", "score": 16, "replies": [{"body": "Like what Yahoo did to Tumblr", "score": 8, "replies": [{"body": "And News Corp buying MySpace", "score": 3, "replies": []}, {"body": "Tbf it was fine in the eyes of the users until they removed the porn", "score": 2, "replies": []}]}, {"body": "Oh so when Msft buys it it’s not cool, but it is cool when Chinese Communists control it.  Ok.", "score": 14, "replies": [{"body": "What do you think the \"C\" stands for in CCP", "score": 12, "replies": [{"body": "Which one?", "score": 1, "replies": []}]}]}, {"body": "Did people say the same when facebook but insta?", "score": 2, "replies": []}, {"body": "Exactly", "score": 2, "replies": []}, {"body": "Bing-o", "score": 1, "replies": []}]}, {"body": "I hope they buy and delete it", "score": 3, "replies": []}, {"body": "Wowow buy buy buy, makes sense tho India and eu will probably ban it too or already did", "score": 3, "replies": [{"body": "India banned a BUNCH of chinese apps, although if MSFT buys it out it may be unbanned.", "score": 1, "replies": []}]}, {"body": "Guess its time is ticking...", "score": 1, "replies": []}, {"body": "I am not sure how I feel about MSFT buying all of TikTok per say. Perhaps the app has lasting power, but I still worry it will be a fad, where we'll see a peak of users before a plateau and decline. Sort of like you see in Twitter and Snapchat. I say this knowing nothing about the app, so I could be very wrong", "score": 1, "replies": []}, {"body": "Confirmed fake news btw", "score": 1, "replies": []}, {"body": "I am starting to invest a lot more in MSFT now. This acquisition makes them even more diversified in their portfolio. CEO is doing the right things. I love product diversification. MSFT will not be a slow moving elephant (read IBM), ever!", "score": 1, "replies": []}, {"body": "I keep seeing this news and I still don't know what TikTok is. Is this good or bad for MSFT stock holders?", "score": -2, "replies": []}]}
{"title": "Is investing in $AAPL now FOMO?", "selftext": "[deleted]", "id": "i503e0", "created_utc": 1596747481.0, "score": 14, "upvote_ratio": 0.89, "num_comments": 30, "comments": [{"body": "I was just looking at their chart and thinking so. This is an unprecedented price spike even for them.", "score": 14, "replies": [{"body": "Yup. Up $80 in 6 trading sessions.  I love it", "score": 6, "replies": []}]}, {"body": "I would expect a few sell offs between now and the split but you’ll most likely make money once the split happens, many people don’t have thousands to invest, but many have a few hundred to invest", "score": 13, "replies": [{"body": "Not sure how you came up with that number. This market is still owned by hedge funds, who can easily afford these Apple shares pre split. \n\n\nhttps://www.google.com/amp/s/markets.businessinsider.com/amp/news/retail-investors-quarter-of-stock-market-coronavirus-volatility-trading-citadel-2020-7-1029382035", "score": 1, "replies": [{"body": "I’m speaking of new buyers but thanks poindexter", "score": 0, "replies": [{"body": "Knowledge hurts doesn’t it?", "score": 1, "replies": [{"body": "My comment was pretty clear, the split will bring new buyers who previously couldn’t bring themselves to buy at 400+ so I’m not sure what knowledge you’re speaking of", "score": 2, "replies": []}]}]}]}]}, {"body": "Pretty sure this stock will go up. \nWhy you ask?..\n\nIt’s fucking apple.", "score": 13, "replies": []}, {"body": "I would invest in AAPL through VOO/SPY or QQQ", "score": 12, "replies": [{"body": "same. VGT/XLK also - 20%!!!!!!", "score": 1, "replies": []}]}, {"body": "Not FOMO AAPL is a safe bet and a blue chip stock at this point. Yes their spike is insane and who knows if it will continue but it is a incredibly recession proof company. I know it sounds crazy for luxury electronics and their last earnings report kinda proved price isn’t the biggest issue for their consumers. \n\nIt’s definitely not a swing trade but long term, absolutely. I’ve been holding to AAPL since 2018 ad have constantly been adding to my position. I always wish that I added more in the past but who the hell knew this would happen.", "score": 8, "replies": []}, {"body": "Yes", "score": 2, "replies": []}, {"body": "I am thinking the same thing, I have been watching and was close to getting 2 shares at 425, but I am thinking it’s the FOMO.. I have Apple in ETFs so I do have exposure there. I am picking up MSFT instead. But still eyeing it", "score": 2, "replies": [{"body": "OK.  I'm new to this.  What's FOMO?", "score": 4, "replies": [{"body": "Fear of missing out", "score": 7, "replies": []}]}, {"body": "I would’ve pulled the trigger, especially with the split coming up.  I’ve been in since $274 and wanted more but it’s gotten pricey. I caved and picked 3 more up at $436. Up $20 since then, and would’ve been up $30 if you bought at $425. But who knows, it could drop $40 or more in - few sessions like it did a few weeks ago. Besides the market cap, there will be a rush to pick up Apple shares after the split.", "score": 2, "replies": []}]}, {"body": "No. There's no competition and products are great. When that changes you can revisit. Same goes for Amazon. Buy", "score": 2, "replies": []}, {"body": "I think the only explanation is a flight to safety, crazy rally", "score": 2, "replies": []}, {"body": "I don't know of anyone ever who purchased AAPL shares and regretted it. Maybe just regret that they sold too early", "score": 2, "replies": []}, {"body": "Wish I had gotten into investing earlier . And not be so scared at the start to invest in better quality companies", "score": 2, "replies": [{"body": "The newbies will be saying the same thing to you in 2030, jf that makes you feel any better", "score": 1, "replies": [{"body": "Hahah that’s true . If my friends ever get into investing in stocks . They will definitely say that", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yes", "score": 4, "replies": []}, {"body": "No one can stop you, however this goes against buffetts method of buying great companies an low prices", "score": -1, "replies": []}]}, {"body": "The parabolic spike is worrisome short term. I was just considering some close to in the money puts out a month or so. I haven’t heard or researched when the split is planned...will do that research before I place my bets.", "score": 1, "replies": []}, {"body": "People were wondering the same back in 2015. They are still waiting for the stock to be less ovarvalued lol", "score": 1, "replies": []}, {"body": "Safest bet besides AMZN and TSLA for long term hold", "score": 0, "replies": []}, {"body": "Apple is shaping up to be the next Enron", "score": -8, "replies": [{"body": "Apple is one of the biggest publicly traded companies in the world.. you really think they are going be in some massive fraud scheme? Lmao they have almost 200 billion in cash.. come on man", "score": 3, "replies": []}]}]}
{"title": "$DIS Puts anyone?", "selftext": "[removed]", "id": "i4ks10", "created_utc": 1596686592.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 34, "comments": [{"body": "You don’t FUCK with the MOUSE", "score": 31, "replies": [{"body": "I do, and I have made money every time I have.", "score": -1, "replies": []}]}, {"body": "Never fuck with the mouse you fucktard", "score": 21, "replies": [{"body": "Thank you for the advice, it’s quite original. Look at Disney’s fluctuations, there have been plenty opportunities to make money shorting DIS, and in fact that’s how I got my first 100% return.", "score": -6, "replies": [{"body": "Just don’t do it man", "score": 7, "replies": [{"body": "Lol, you’re probably right, but I just don’t see how anyone can be that interested in DIS at the current price. It just doesn’t have that much meat on the bone and it’ll be suppressed for at least two more quarters. Streaming revenue will not make up for their lost revenue elsewhere. What’s the point when there are much better tickets to make gains on?", "score": -2, "replies": [{"body": "I agree with you but the mouse will just fuck you. I’m just suggesting that they are much safer plays atm instead of disney that can pull some bullshit on you lol", "score": 5, "replies": []}, {"body": "Hope you took my advice lol", "score": 1, "replies": []}]}]}, {"body": "Idk man. Looks pretty straight up to me outside of major market wide events. Sure, you might catch some downside on the off chance, but I’d rather be playing in the direction it’s normally going.", "score": 1, "replies": [{"body": "This isn’t a YOLO, just a regular old Wall Street bet, so I’m not sweating about it. Why do you think it will continue to move up when it’s ~15% pre covid and still has significantly suppressed fundamentals. If I’m looking to invest right now, a recently popped DIS trading  at that level isn’t something I’d be interested in when there are plenty of better options if I believe the markets going to recover relatively quickly. That’s my gut DD, but I’d be interested in hearing yours.", "score": 1, "replies": []}]}]}]}, {"body": "Disney will never go down. It's a de facto branch of the government at this point.", "score": 6, "replies": [{"body": "It regularly dips. Look at my strike it isn’t like I think it will go bankrupt ffs. Stop parroting and pay attention.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Jesus Christ man congrats. Silver is one of those things I mean when I say I look at the market and Disney looks like an underperformer versus other options.", "score": 1, "replies": []}]}]}]}, {"body": "4% is insane \n\nDisney+ news means uproar", "score": 2, "replies": [{"body": "Disney regularly swings in that range biweekly, and my theory is that it will do that or close to that once things Peter from this bump. Look at its history, it’s not insane.", "score": 1, "replies": []}]}, {"body": "Thinking about it too. D+ and Mulan isn’t going to save the day.", "score": 2, "replies": []}, {"body": "I'll sell some tomorrow. Good luck.", "score": 2, "replies": []}, {"body": "I’m trying to understand why you want to short Disney... \n\nFor 1, it’s fucking Disney. \n\nBut for 2, they have their hands in so much more than just Mulan and their parks.. and their cash reserve is ridiculous. \n\nAre you shorting because it jumped? \n\nThen why not AMD, or Nvidia, or Amazon, or Apple? All have seen the same jump this past week.. \n\nLook dude.. all I’m saying, is you don’t fuck with the mouse. That 4% drop you’re lookin for is asking a lot form a company like Disney - their losses on revenue have already been priced in. This is their slow climb back and will steady like this for awhile.. \n\nMy 2 cents anyway. I could be 1000% fucking wrong of course.. soooooOo.. idunno.", "score": 2, "replies": [{"body": "Lol I appreciate the advice and this is just a fun bet, not like I’m going to rope if it goes $140 tomorrow. I just don’t see anything impressive other than Disney plus to warrant it staying this high. My break evens a little more than $2 off current, so it’s not like I was CRAZY confident, just a hunch based on their fundamentals and thinking this bump was overzealous.", "score": 1, "replies": []}]}, {"body": "You try to fuck the mouse, but the mouse fucks you harder", "score": 2, "replies": [{"body": "I’ve made plenty of money with close strike Disney puts", "score": 1, "replies": []}]}, {"body": "If the market isn’t down with the world on fire and the Fed approving Monopoly money as currency, it isn’t going down before the election. Buy calls on everything til then imo.", "score": 1, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**DIS**|**$129**|**BUY PUT**|**2020-08-14**|**$2.94**|**$127.61**|**1**|**2576**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckdia7r4h3ccs0788e6scwlyv) | [Track Record](https://www.pickmojo.com/user/you_are_a_wanker/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "If DIS passes $130 and holds you're screwed. If it doesn't make it then retracing to about $120 is likely.", "score": 1, "replies": []}, {"body": "YOU DO NOT FUCK WITH Mr. Mouse", "score": 1, "replies": []}, {"body": "Greedy mouse steals tendies", "score": 1, "replies": [{"body": "Lol typically yes he do be like that.", "score": 1, "replies": []}]}, {"body": "you sold? that means it’ll go up.\nalso don’t fuck with the mouse apparently", "score": 1, "replies": []}, {"body": "Do not fuck with the mouse, it will steal your money eventually.", "score": 1, "replies": []}, {"body": "I've got 10/16 80p because I think the parks will close again and scare people. Yolo", "score": 1, "replies": [{"body": "I wish I would have sold those to you...\n\nYou're betting they're going to dip below their March crash low, which was lower than any other point in their 5 year chart?", "score": 1, "replies": [{"body": "Nope, just hoping they drop enough to make me money. 2 dollars more than I have now is 2 dollars. Gotta get the little plays when you can. Made 100 bucks playing earnings this week.", "score": 0, "replies": [{"body": "Just be sure to take profits early unless there's a shitton of selling momentum.", "score": 2, "replies": [{"body": "Appreciate the concern. I learned my lesson with 10k worth of profits lost in April", "score": 1, "replies": []}]}]}]}]}]}
{"title": "GM - MOONING THIS WEEK", "selftext": "GM RELEASING NEW EV VEHICLE COMPETING WITH TESLA. GM to 40!\n\nWe all know Ford mooned off a new vehicle reveal but that was fake news. Well the Detroit News just released that GM debuts the new EV Cadillac tomorrow and it is capable of 400+ mileage range. 100% not priced in yet. Check the TA:\n\nPositions: August 7 - 27c\n\nGM should moon well past 27.\n\nhttps://preview.redd.it/duc3zhl19bf51.png?width=897&format=png&auto=webp&s=461ba06ccccca6d0f6f86b8de655c53d101230b4\n\nhttps://preview.redd.it/fdihsu3g9bf51.png?width=745&format=png&auto=webp&s=ad16393402bd289ec1338cfb310ad9f87dd7b3a8\n\nhttps://preview.redd.it/h8p98biz9bf51.png?width=540&format=png&auto=webp&s=64e6b2780862962e3500905e98c5288c16456a7b", "id": "i4l977", "created_utc": 1596688717.0, "score": 10, "upvote_ratio": 0.7, "num_comments": 36, "comments": [{"body": "Thanks! Just picked up 0 shares.", "score": 89, "replies": [{"body": "In for double urs", "score": 10, "replies": [{"body": "Pussy, I'm going triple.", "score": 5, "replies": []}]}]}, {"body": "Hey I see that color every time I open RH! It must be a good thing!", "score": 4, "replies": [{"body": "It means GM is on sale.", "score": 2, "replies": [{"body": "So is my portfolio :D", "score": 1, "replies": []}, {"body": "Ouch. You and Buffet. Good luck.", "score": 1, "replies": []}]}]}, {"body": "ok gm calls friday $30", "score": 7, "replies": []}, {"body": "Great TA.", "score": 6, "replies": []}, {"body": "Those are nice lines. What do they do", "score": 4, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "Actually if you take a look the lows keep getting higher and GM beat earnings by a lot. The vehicle debut is free money. Accelerating the highs.", "score": 2, "replies": [{"body": "not sure if you knew this, but that trend line is just about every stock since march", "score": 5, "replies": []}, {"body": "Technical's are pure bullshit pseudoscience.", "score": 3, "replies": [{"body": "other than the fact that they work pretty well.  not that i have anything good to say about OP's TA.\n\nthe reason people started doing TA is it gave an edge on purely fundamental based trading people were doing at the time.", "score": 1, "replies": [{"body": "They used to work. (And I guess they still kind of work.) \n\nThey worked before because humans did most trading. It captures the “feeling” and emotion of traders. If they see it hit a support and it bounces back the next time it hits that support they will think “this is a good time to enter” and that thought makes the support a real thing. They enter and the price goes up because a lot of people entered. \n\nTA was horseshit, but the belief it worked, actually made it work. And people believed it worked. \n\nToday however, the preprogrammed algo that is doing 99% of trades has no emotion, it has no feeling. When it hits that support no additional consideration goes into its orders. It will do what it’s going to do no matter what a TA says. \n\nWith out that emotional response TA do literally nothing. And because they were a made up fantasy to begin with, they go right back to being a made up fantasy. \n\nThere are still real traders. It still works on real traders. But it’s effect has diminished greatly in the last 10 years.", "score": 2, "replies": [{"body": "yeah i've been following the momo, and every day i watch shit bounce off the 4/9/20 day, flag, and pop.\n\ni won't dispute that any system you start applying to the stock market will dilute and transform over time.  i also agree that the algos affect TA.  if nothing else, it allows people to create a system around a set of tangible rules that define a probability higher than 50%.\n\nbut TA is bullshit in the same way that all models are bullshit:  nothing predicts the future, and everything is probabilities.", "score": 1, "replies": [{"body": "Confirmation bias. \n\nThere have been impartial studies proving you wrong. \n\nBut, if it works for you. Then fuck what I think. Keep doing you. \n\nMy system is FAR worse than yours. I acknowledge it’s trash. I would never tell anyone to do what I do. But it works for me. \n\n(I sell jumps and buy dips. I ignore any and all fundamental DD.) if that’s not retarded I don’t know what is. I also take into consideration the vibe I am feeling from wsb. Atvi is a good example. I shorted it based 100% on 2 factors. It was up a lot. And wsb was piling into it. \n\nIf I told you that before earnings you would have called me the biggest idiot alive. Especially if you research and do DD. After earnings I look like a savant.", "score": 1, "replies": [{"body": "I'm not really selling TA based on my performance. I haven't been doing this long enough, and I've royally fucked myself repeatedly due to poor psychological tone. \n\nI don't really believe studies unless I look at what they're studying and how. All I know is you can backtest TA strategies and see use that to constrain yourself to a set of parameters. Back testing isn't future testing, but it's okay. \n\nAnd in any case, providing yourself with parameters is really the most important thing. The mind works well in confinement. It sounds like you have a good system, based on price action and sentiment, which is totally 100% legit and plenty of people trade that way.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Call me, grandpa.", "score": 2, "replies": []}, {"body": "All in on 8/21 $15c can’t lose money if you buy the cheapest option", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/AinsOoalBlack don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "hopefully you are right, I am bag holding from earnings still lol", "score": 1, "replies": []}, {"body": "Just put a limit order in for 08/14 30C at $0.10.   \n\n\nA baby bet.", "score": 1, "replies": []}, {"body": "Dude that vehicle won't be for sale before 2023 or end of 2022.\n\nId like to remind you we are in 2020", "score": 1, "replies": []}, {"body": "News on Benzinga: \n\n\" Biden’s next statements are the flashpoint of the whole video, he said “And by the way, theytell me, and I’m looking forward to — if it’s true — to driving one, they’re making an electric Corvette that can go 200 mph. You think I’m kidding? I’m not kidding. So I’m excited about it.” \n\nan some unusual option activity on friday?\n\n&#x200B;\n\nworth Jumping on 8/21 calls?", "score": 1, "replies": []}, {"body": "noob question. should I buy at market price or limit the calls? I use thinkorswim and it defaults to limit. i have put it at nat not min. but im afraid i should put it at market price not limit?", "score": 1, "replies": [{"body": "the only time it makes sense to do market is if you're try to catch stock price on a rip, and still it's risky.\n\nif you do market on options, someone may have an open order that you fill.  say i buy an option at $2.  i expect it might blow up, so i put in a limit sell at $10.  you put in a market order right after me, and you buy my option.  i just made $800 and you just lost $800.\n\na fairly extreme example, but i've gotten fucked for a few hundred like this before.  if you're trying to catch a rip, at least set a high limit to constrain the bullshit.", "score": 2, "replies": [{"body": "ok will do! thanks", "score": 1, "replies": [{"body": "oh i forgot to mention i grabbed some easy gains on a TSLA spread recently because it gapped up and i put in a limit order and it filled at $50 and was immediately worth $150, and went up.", "score": 1, "replies": [{"body": "so you had a limit order at 50$ just in case it ever dropped and it did for a second so you automatically grabbed it? was there any reason you did that or you you do it periodically on hot stocks?", "score": 1, "replies": [{"body": "I just heard it can happen so gave it a shot. it filled during the wild jumping around at the opening bell. but I guess with something like TSLA, it's reasonable enough that a spread would have two strikes swinging in  opposite directions. i will say I wish I did 10 of them", "score": 1, "replies": []}]}]}]}]}, {"body": "Limit. Always.\n\nEDIT: With thinly traded derivatives... always.", "score": 1, "replies": []}]}, {"body": "Lyriq? is that a tyoo?\n\n\nI would be vastly more enticed by news of GM exporting ventilators at on offensive markup or even car sales - if they still do that - than another 3DTV tier meme unveil . useless.havent owned since their post bailout ipo", "score": -1, "replies": [{"body": "Not sure if your blind eyes can see cause you can't even spell or type a complete sentence. If you actually look at the one year chart precovid19 GM was at 35 dollars a share. This is also a debut of a high tech and electric vehicle. Maybe you haven't paid attention to the EV sector?", "score": 4, "replies": []}]}, {"body": "GM is and always will be a shit stock. \n\nOpened after the BK at 33 and today it's 26-something. Any move towards 40 won't last long, and it will fall back just like it did after they made some kind of EV announcement with Softbank a while back. \n\nGood luck.", "score": -1, "replies": []}, {"body": "Whoa, scared me. I thought it was going to be an actual GM vehicle like a Malibu, or an Impala, maybe even a Corvette. A Trax or a Blazer would even be acceptable.\n\nNOT A GODDAMN Cadillac that no one is going to buy.\n\nSeriously, these are just compliance cars right now. GTFO.", "score": -1, "replies": []}]}
{"title": "Intel Massive Data Leak", "selftext": "[https://twitter.com/deletescape/status/1291405688204402689](https://twitter.com/deletescape/status/1291405688204402689)\n\nLooks like there has been a massive data breach at intel, and a lot of confidential data has been leaked. This cannot be good for the stock.\n\nI haven't gone through the leak yet, but there's mentions of backdoors in the source?  \n[https://twitter.com/deletescape/status/1291422841834016770](https://twitter.com/deletescape/status/1291422841834016770)\n\nApparently there is a ton of data still waiting to be leaked. Time to short $INTC?", "id": "i4wtun", "created_utc": 1596737255.0, "score": 87, "upvote_ratio": 0.88, "num_comments": 37, "comments": [{"body": "So my 9/4 puts will print? ANSWER ME RETARD", "score": 87, "replies": [{"body": "Your 10p will never print retard", "score": 9, "replies": []}, {"body": "Looks like a nothingburger. I believe this is NDA documentation provided to some Intel customers, not the keys to the castle.", "score": 5, "replies": []}]}, {"body": "This happens all the time and will have no impact on the stock you baboon", "score": 24, "replies": [{"body": "Idk. INTC has been gaining since the twitter post. Up almost .09% since the twitter post. Big things happening for INTC. Could see HUGE gains if the media picks this up.", "score": 15, "replies": []}]}, {"body": "Lmfao at all the intel bag holders who post daily talking about its undervalued lolz fuck intel", "score": 47, "replies": [{"body": "I work for a supplier in the industry. Agreed, screw Intel.", "score": 8, "replies": [{"body": "Work at a retailer. They went from 100% of processor sales over $150 to 10% last summer. That's why I'm up 200% on AMD.", "score": 7, "replies": [{"body": "Up 200% in the last month with our god and savior Su Bae.", "score": 5, "replies": [{"body": "BAE <3", "score": 1, "replies": []}]}]}]}, {"body": "Well, if they weren't undervalued before they will be soon. I might even buy the dip if they really tank this time", "score": 5, "replies": []}, {"body": "Lmao if intel is undervalued tanker gang would like a word\n\nLiterally half your market cap in cash on hand, and 4x your market cap in other assets minus debt on top of that? Nah super bearish, no way anyone will use these things even though they're reporting their best numbers in company history\n\nTrading at 25% NAV makes total sense\n\nInstead, try something like NKLA! Maybe RKT or W?", "score": 2, "replies": []}]}, {"body": "Do not short a company worth as much as intel after it dropped 10% already.", "score": 9, "replies": []}, {"body": "Stock only has gone up since you posted this", "score": 19, "replies": []}, {"body": "[deleted]", "score": 18, "replies": [{"body": "The timeless legacy of blue chip stocks.", "score": 3, "replies": []}]}, {"body": "Calls on Intel, got it.", "score": 21, "replies": []}, {"body": "AMD tendies here i cum", "score": 6, "replies": []}, {"body": "No one gives a shit about data leaks/hacks.  Your mom's been hacked so many times and there's still demand for her loose data port.", "score": 3, "replies": []}, {"body": "They're either an old out of date company or a tech leader. Can't have it both ways.\n\nIf they are a tech leader then the information is valuable.\n\nIf they are out of date, then who gives a #@$&.", "score": 7, "replies": []}, {"body": "Down .01% since this was posted. Market is starting to react! Could even CRATER .05% if the news picks this up. In for $100.", "score": 3, "replies": []}, {"body": "And to think that I almost bought the dip, looks like I dodged that bullet", "score": 3, "replies": []}, {"body": "They have insurance for this kinda garbage, won't even ping the ticker.", "score": 7, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/GlumBoard don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Data leaks don't matter anymore, they are just a ploy to get the \"cyber security\" department growing.. \n\nThe future is going to be companies trying to make billions with \"cyber security\" this and that..\n\nThe thing you should be paying attention to is Vix.. its at 22...\n\nwatch what it is tomorrow..\n\nNotice TQQQ? $130 today.. meanwhile Silver and Gold holders will just keep missing out on TQQQ..", "score": 5, "replies": [{"body": "Ya, It's been a sad life here with SLV...why just today I've had to suffer a 5% rise compared to 2.8% for TQQQ", "score": 11, "replies": [{"body": "I keep getting the guys who push silver and gold trying to tell me I am some scam artist or shill.. meanwhile TQQQ speaks for itself!", "score": -7, "replies": [{"body": "Found the TQQQ employee", "score": 5, "replies": []}, {"body": "TQQQ is so last quarter... 😁", "score": 2, "replies": []}, {"body": "Personally, I'm not against the Qs.  Great companies that will probably continue to take a larger share of the economy.  I just thought your comment was odd timing considering the outperformance of SLV today.", "score": 1, "replies": []}]}]}, {"body": "NASDAQ will be fine either way, but this isn’t your average user data leak or celebrity Twitter account hack. This is a source code leak for Intel’s IP. Their actual chip designs. If China is able to use this to improve their tech it could end up leading the semi market (since they don’t give a damn about IP law / copyright). This should not be taken lightly.", "score": 5, "replies": []}, {"body": "Wtf does that have to do with intel?", "score": 3, "replies": []}]}, {"body": "Ehh nobody gives a fuck when vulnerabilities come out on intel chips every other year. Good luck.", "score": 1, "replies": []}, {"body": "Ha! I knew it. Bought in yesterday \n\n\nYou're all welcome", "score": 1, "replies": []}, {"body": "As much as people shit on Intel they still print money like it’s going out of style.", "score": 1, "replies": []}, {"body": "Bad press is good for stocks", "score": 1, "replies": []}, {"body": "A lot of data leaks are overhyped. Like the minor scandals over VPNs being hacked, but then everyone realized their personal data could not have been effected because VPNs don't keep any personal data for this very reason.", "score": 1, "replies": [{"body": "Intel is the Equifax of processors.", "score": 1, "replies": []}]}]}
{"title": "Reported Intel Data Breach - BUY PUTS BOYS", "selftext": "https://www.tomshardware.com/news/massive-20gb-intel-data-breach-floods-the-internet-mentions-backdoors\n\nLooks like this hasn't hit the mainstream yet. The article is less than an hour old.\n\nTomshardware is respected within the tech community.\n\nAUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD AUTO MOD", "id": "i4xk4t", "created_utc": 1596739496.0, "score": 41, "upvote_ratio": 0.78, "num_comments": 36, "comments": [{"body": "8/7 $47p is .03, I’ll gamble", "score": 20, "replies": [{"body": "8/14 47p .32\nSame idea but figured it could take the weekend. Good luck!", "score": 6, "replies": [{"body": "Just figure if it blows up, it’ll happen today or AH. If it doesn’t, it was 3 dollars.", "score": 10, "replies": [{"body": "I bought one as well! Hoping this train pays for my internet bill for the month!", "score": 3, "replies": []}]}]}]}, {"body": "Do you really think the people who can actually make this stock go up or down don't already have this info?  In a world where we willingly give away our privacy no one gives a shit about breaches anymore lol", "score": 28, "replies": [{"body": "This is not privacy, its IP. More serious imo", "score": 16, "replies": [{"body": "They should just use a VPN then", "score": 2, "replies": []}]}, {"body": "Yeah last time there was an exploitable vulnerability the ceo conveniently put in a sec stock sell filing a few months prior to it becoming public and sold right before it came out. I have no doubts the execs knew about it ahead of time", "score": 3, "replies": []}]}, {"body": "All in with my $22!", "score": 6, "replies": [{"body": "Position?", "score": 2, "replies": [{"body": "I got a $46.5p 8/7 and 8/14, but I'm not expecting much lol", "score": 1, "replies": []}]}]}, {"body": "Bought some lotto tickets expiring tomorrow, and 2 atm puts for next week. Is this article...real...? Tom's Hardware is a legit publication, but I don't see this being reported anywhere else. They didn't even mention the twitter handle or provide any evidence.", "score": 5, "replies": [{"body": "thats what im wondering. site looks like the goddam Onion", "score": 3, "replies": [{"body": "Nah, Tom's Hardware is real. I've been reading it a lot lately to research building a PC, they have tons of good stuff. It's just weird to me they were so quick on this, and no other site has it. Also INTC stock hasn't reacted at all. Maybe they don't care? lol it's not like they have anything that could help AMD.", "score": 5, "replies": [{"body": "[https://appleinsider.com/articles/20/08/06/intel-hacked-first-wave-of-stolen-chip-data-released-in-20gb-dump](https://appleinsider.com/articles/20/08/06/intel-hacked-first-wave-of-stolen-chip-data-released-in-20gb-dump)\n\n[https://www.zdnet.com/article/intel-investigating-breach-after-20gb-of-internal-documents-leak-online/](https://www.zdnet.com/article/intel-investigating-breach-after-20gb-of-internal-documents-leak-online/)", "score": 6, "replies": []}, {"body": "good to know. and oh it looks like others are reporting on it", "score": 1, "replies": []}]}]}, {"body": "https://mobile.twitter.com/deletescape/status/1291405688204402689\nI believe this is the acct that is leaking the intel on Intel", "score": 1, "replies": [{"body": "Thanks. Also found a thread on 4chan about it.\n\nhttps://boards.4channel.org/g/thread/77108398", "score": 2, "replies": []}]}, {"body": "[https://t.me/exconfidential/590](https://t.me/exconfidential/590)", "score": 1, "replies": []}]}, {"body": "Anyone recall the effect on stock price when the Meltdown vulnerability was discovered?", "score": 4, "replies": []}, {"body": "i dont see how this could not have been priced in, yet it seems like it isnt..", "score": 3, "replies": []}, {"body": "Another AMD fag trying to boost his calls", "score": 6, "replies": []}, {"body": "P R I C E D I N\n\nR\n\nI\n\nC\n\nE\n\nD\n\nI\n\nN", "score": 7, "replies": [{"body": "I N V E R S E\n\nN\n\nV\n\nE\n\nR\n\nS\n\nE", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "United Airlines literally beat the shit out of a man and dragged him off an airplane. Twice. \n\nTheir stock recovered days later.", "score": 15, "replies": [{"body": "buy puts then sell? im not telling you to shit on intel's grave bro", "score": 5, "replies": []}, {"body": "Lol great point", "score": 1, "replies": []}]}, {"body": "Lol intel chips have had exploitable vulnerabilities for fucking years and no one gave a fuck", "score": 0, "replies": []}]}]}, {"body": "In for a quick sharp drop.\nHere's hope.", "score": 2, "replies": []}, {"body": "I can say for fact that everyone would be absolutely fucking shocked at who had access to all of Intel's source code.  This doesn't surprise me.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "No effect on stock price yet so idk", "score": 1, "replies": []}]}, {"body": "> Reports are also cropping up that some of the files are marked with NDA license agreements to \"Centerm Information Co. Ltd., a Chinese company established and existing under the laws of the People's Republic of China,\" meaning this company could have been also hacked. \n\npretty sure if they weren't shills this would read \"responsible for the hack\"", "score": 2, "replies": []}, {"body": "sometimes bad news is good for the stock. twitter jumped a bit up when those ceo accounts got hacked", "score": 1, "replies": []}, {"body": "Well. RIP my INTC calls.", "score": 1, "replies": []}, {"body": "The data breach is old news, the leak is what just happened. Consider that the the big boys as intel were aware that the data would be published eventually.", "score": 0, "replies": []}, {"body": "Where are all the mouth breathing cavemen who were talking about buying Intel stocks last week?\n\n\"Its priced so low, gotta buy\"\n\nIts so low because everday they have terrible news.", "score": -3, "replies": []}]}
{"title": "TSMC--calm before the 🚀🚀 moon🚀🚀", "selftext": "Listen up.\n\nTSMC is gonna skyrocket this year. 2020 is literally TSMC's little bitch.\n\nI'm right and you fucking know it.\n\nThe upcoming PS5, Xbox 1, Big Navi AMD GPU's, Nvidia RTX 3000's, Ryzen 9's, zen 3's are all the most hyped products in recent years within their respective markets. And who manufactures all of these CPU's and GPU's?\n\nTSMC.\n\nThese products are so hyped everyone's gonna buy one or the other from the items above. You'll be asking why these products weren't released when lockdowns were first issued. Lockdown will be voluntary after these products are released.\n\nFace value TSMC's market price (NYSE: TSM) may seem priced in, overvalued, or whatever the fuck you gay bears come up with but I'm telling you this shit is gonna skyrocket by the end of 2020. And I don't give a fuck if Huawei is out of the question.  Any idiot knows that TSMC  has a fucking monopoly on the rest of the CPU/GPU manufacturing market. TSMC spoon feeds NVIDIA, Apple, AMD, and etc all their CPU/GPU demands. They're literally pushing Samsung out of certain deals.\n\nOh right I forgot about the autists. Let me explain.\n\nTaking an example outta the CPU side of things,\n\nX86 is the type of chips that AMD and (the late) intel produce. X86 is the current most dominant and powerful type of  computing chip widely accessible to consumers. You've all heard of Nvidia buying ARM or some shit. ARM is a \"prospective\" type of chip good for low-power consumption. It hasn't been developed enough to produce the same computing power as X86 yet, but in the future it will. In summary, ARM is good because ARM is good for saving power consumption and battery life.\n\nApple uses ARM patents in their Iphones and shit, and ARM basically has/will dominate the mobile devices market. Ipads, Iphones, Ipenis, you name it.\n\nSome people say ARM will replace X86 someday. Who fucking knows.\n\nBut on the manufacturing side of things, ARM, just like X86, is just a manufacturing LICENSE in its essence. It's just a bunch of design drawings. ***Actually*** MANUFACTURING these CPUs and GPUs is so expensive and so complex that practically only two companies can supply and meet the material demand **licensing** companies such as AMD, Apple, and Nvidia ask for. That's TSMC and samsung. And samsung is too gay to trade on NYSE/Nasdaq.\n\nPoint is, all of the incredibly hyped CPU and GPUs of 2020 and in recent years which everyone will buy will be coming out of TSMC in 2020. Oh, and TSMC is also future proof so just  go ahead and buy 10,000 shares and 400 calls.\n\nThank me later.\n\n&#x200B;\n\nTL;DR: Go all in on TSMC short and long term.", "id": "i4xq9o", "created_utc": 1596740033.0, "score": 45, "upvote_ratio": 0.85, "num_comments": 32, "comments": [{"body": "I only know TSM not TSMC", "score": 32, "replies": [{"body": "Literally googled dafaq is tsmc", "score": 6, "replies": [{"body": "Morningstar (total bear on this) calls it that", "score": 1, "replies": []}]}, {"body": "Buying the wrong stock is a winning strategy", "score": 1, "replies": []}]}, {"body": "This is one of 5-7 stocks that I've been holding for the last few months and plan on holding long term. Most everything else, just taking profits where I can.", "score": 20, "replies": [{"body": "What're the rest? Pm please", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 46, "replies": [{"body": "Exactly. This is only the beginning 🚀🚀🚀", "score": 1, "replies": [{"body": "Exactly what every single person who chased after a massive run up already says\n\nDon’t worry bro you totally aren’t late and didn’t miss the boat at all", "score": 8, "replies": [{"body": "What boat? I thought we were trying to board a rocketship?", "score": 4, "replies": [{"body": "Im on a boat to the rocketship!", "score": 1, "replies": [{"body": "Oh shit, are we supposed to bring out our yachts? I forgot!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "TSM working on that monopoly status", "score": 12, "replies": []}, {"body": "I’m Taiwanese and TSM is the best Taiwanese company and to be honest prob the best semiconductor company in the world. We’re all proud of TSM  🇹🇼🇹🇼🇹🇼🇹🇼", "score": 23, "replies": [{"body": "Taiwan seems dope I really want to visit there", "score": 12, "replies": [{"body": "It is legit the best 🇹🇼 \nHope I can go back visit soon whenever possible. We only have 477 Covid cases and 7 deaths IN TOTAL since Jan. We are located so close to China & with tens of thousands of Chinese visitors each day. It’s just unimaginable to see US is pushing towards 5 millions cases. Ok enough of my rant what was I thinking this is WSB. Anyway, own TSM for tendies 2020 & 2021!", "score": 10, "replies": []}, {"body": "As an Asian, I love Taiwan, the culture, the people, the views are amazing.", "score": 3, "replies": []}]}, {"body": "U should be proud its a hell of a company", "score": 7, "replies": []}, {"body": "Not Taiwanese but I have a soft spot for 芋圓", "score": 4, "replies": [{"body": "Gosh my favorite too!!!!!!! Taro balls for anyone who doesn’t read Mandarin LOL", "score": 3, "replies": []}]}, {"body": "Taiwan number one", "score": 1, "replies": []}]}, {"body": "Don’t forget ASML", "score": 6, "replies": [{"body": "This. Tsmc gets all their litho tools from the only euv supplier ww. That's right, monopoly on the high-end. Intel might catch up eventually, Samsung is also just a step behind...go to the source of all of them ;)", "score": 3, "replies": []}]}, {"body": "Now Is The Time Brother!\nTo Infinity Fabric And Beyond!🚀🚀🚀🚀🚀", "score": 2, "replies": []}, {"body": "tsmc's max capacity had already been booked for years, so their booming this hard hasn't made much financial sense.\n\nit's not like they cancelled everyone's contracts and renegotiated.", "score": 6, "replies": [{"body": "As they bring more EUV lines online into 2021 they will have AMD, Apple, Nvidia desperately trying to get those wafers, feels like pricing is gunna ramp up to reflect that.", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/thatssofaraway don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Constrained market in an industry with high capital costs? Should drive up prices", "score": 1, "replies": []}, {"body": "The part about Samsung is just made up by OP, according to Bearoningstar", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "That’s why they’re building a $12 billion factory in Arizona? \n\n\nhttps://time.com/5837274/tsm-chip-plant-arizona/", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Sadly in the semiconductor space 12bn is like nothing, it's a good start but this is a miniscule amount of capacity.", "score": 1, "replies": []}]}]}]}, {"body": "All i see are gaybears and losers", "score": 1, "replies": []}, {"body": "By definition, hyped products are priced in because the market knows they need to be fabbed. You've provided no insight.", "score": 0, "replies": []}]}
{"title": "Is the Power Rangers Portfolio the greatest asset allocation of all time?", "selftext": "[removed]", "id": "i4y949", "created_utc": 1596741624.0, "score": 189, "upvote_ratio": 0.96, "num_comments": 33, "comments": [{"body": "But where is the gold and silver power ranger", "score": 85, "replies": [{"body": "Coming out in the next season, and will totally overshadow all other rangers.", "score": 32, "replies": [{"body": "Will also be using footage from a different Super Sentai show", "score": 1, "replies": []}]}, {"body": "AAAU and SLV", "score": 3, "replies": []}]}, {"body": "Can we taste the rainbow without being a 🌈🐻?", "score": 30, "replies": [{"body": "You taste one rainbow...", "score": 8, "replies": []}]}, {"body": "Can’t forget about the white girl ETF aka “BECKY”\n\nEtsy / Lulu / Ulta / Goos / Sbux \n\nWhite girls are unstoppable", "score": 27, "replies": [{"body": "I prefer the killer robot index.", "score": 2, "replies": []}]}, {"body": "This is so retarded I'm in.", "score": 20, "replies": []}, {"body": "By the power of Greyskull!", "score": 10, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Is there a He-man ticker?", "score": 3, "replies": [{"body": "Horace Mann is HMN.  Best I can do.", "score": 1, "replies": []}]}]}]}, {"body": "Is anyone else color blind", "score": 9, "replies": []}, {"body": "What about pink?", "score": 6, "replies": [{"body": "https://ca.finance.yahoo.com/quote/PINK.V/\n\nfixed", "score": 2, "replies": []}]}, {"body": "Now this is real DD", "score": 16, "replies": []}, {"body": "What about the Tesla coloured power ranger?", "score": 3, "replies": []}, {"body": "S.A. = Sureños Autists", "score": 3, "replies": []}, {"body": "What about 5 years?", "score": 2, "replies": []}, {"body": "No prple ranger?", "score": 2, "replies": []}, {"body": "Since when is there a brown and orange power ranger", "score": 2, "replies": [{"body": "You dont remember the power ranger with the comical-but-racist mexican accent, and his compadre who looks white but claims to be a native american?", "score": 3, "replies": []}]}, {"body": "So add it to Becky and BIGFAAGT", "score": 2, "replies": []}, {"body": "LMAO I own BlackRock and Redfin", "score": 2, "replies": []}, {"body": "Green dot makes debit cards for the poor so you might be on to something.", "score": 2, "replies": []}, {"body": "Add KL for gold, the returns would be even better with them added to the list.", "score": 2, "replies": []}, {"body": "Lol ofc math didn’t lie... SPY beat Power Ranger on both Sharpe and Sortino...", "score": 2, "replies": []}, {"body": "White Ranger; Tiger Power.", "score": 2, "replies": []}, {"body": "When was there a brown ranger?", "score": 2, "replies": []}, {"body": "I read this autistic bullshit so much I thought this said the Powell Rangers", "score": 2, "replies": [{"body": "Also correct", "score": 1, "replies": []}]}, {"body": "Make it public, I want to see this screw up.", "score": 1, "replies": []}, {"body": "I am a bot from /r/wallstreetbets.                                You submitted one or more banned tickers: PRPL.\n\n                                Message /u/zjz if they're above 1.5 billion-ish market cap and not related to crypto/pennies/OTC.", "score": 1, "replies": []}]}
{"title": "APPLE 🚀🚀🚀🚀🚀🚀🚀", "selftext": "[deleted]", "id": "i4y9f3", "created_utc": 1596741649.0, "score": 95, "upvote_ratio": 0.94, "num_comments": 34, "comments": [{"body": "yes everyone listen to this guy and buy $APLE @690c", "score": 66, "replies": [{"body": "Specifically the 8/28", "score": 23, "replies": [{"body": "Yolo on 8/14, will it go itm? Neeeed it", "score": 9, "replies": [{"body": "I think that would be a good YOLO to tell your grand children about!", "score": 3, "replies": [{"body": "you sound theta", "score": 1, "replies": []}]}]}]}]}, {"body": "I got in once they announced the split. \n\nAs long as macro doesn’t tank between now and the end of August this stock is going to run. People will be pulling out of risky assets once Earnings season is done and be getting in on reliable, making money through the pandemic, companies. Like Fucking Apple.\n\nI’m strapped in on this rocket boys. See you after the split!", "score": 26, "replies": [{"body": "Can't wait till my one rocket turns into 4 rockets!!", "score": 26, "replies": []}, {"body": "same sentiment exactly. Shares long term and 1 call thats doing great 450c 8/21. I am almost wondering how high it can get to at expiration. Thoughts?", "score": 3, "replies": []}, {"body": "What exactly do you mean by \"macro doesn't tank\" macro is literal feces right now, the market don't give a shit about the macro set up. The only thing acting somewhat conventionally is the dollar.", "score": 2, "replies": []}]}, {"body": "Never bet against Tim Apple. Aapl 450 C 8/28.", "score": 15, "replies": [{"body": "buying apple leaps 🍏", "score": 3, "replies": []}]}, {"body": "Fuck the moon. AAPL is going to Mars.", "score": 16, "replies": [{"body": "Tim Apple and Musk in one rocket ship", "score": 3, "replies": []}]}, {"body": "Agreed. I put my whole account into 8/7 AAPL calls. Rope or Dope", "score": 7, "replies": [{"body": "i vpte ropw", "score": 3, "replies": []}]}, {"body": "I'll get in when it cucks the fresh buyers a few days before extra shares get distributed.", "score": 5, "replies": []}, {"body": "What happened to SLV, PRPL, and RKT? We done with those FADs?", "score": 7, "replies": [{"body": "It’s up to you if you want to throw away money .", "score": 11, "replies": [{"body": "I’m selling aapl puts right now at 415, free money", "score": 7, "replies": []}]}, {"body": "Prepare for more PRPL posts. Another run up incoming!", "score": 1, "replies": []}]}, {"body": "Calls are up 300%. It keeps going up. Let the retards be retards please. Maybe I’ll be able to afford one of the phones soon?", "score": 2, "replies": []}, {"body": "I’ll buy Apple when it’s back around $150. /s", "score": 2, "replies": [{"body": "So on August 24 ?", "score": 2, "replies": []}]}, {"body": "!remindme 98 days", "score": 1, "replies": [{"body": "I will be messaging you in 3 months on [**2020-11-12 23:49:18 UTC**](http://www.wolframalpha.com/input/?i=2020-11-12%2023:49:18%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/i4y9f3/apple/g0md6qy/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fi4y9f3%2Fapple%2Fg0md6qy%2F%5D%0A%0ARemindMe%21%202020-11-12%2023%3A49%3A18%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20i4y9f3)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "In this F'd up market Apple could hit $550 soon and still seem kind of cheap.", "score": 1, "replies": []}, {"body": "What happens to my 3/21 calls when the split happens?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "With their value divided by 4 i guess?\nI better buy 4 times the calls then like a true retard 😎", "score": 1, "replies": []}]}]}, {"body": "I already bought Apple at $11 mofucka$$$$$$.i couldn't believe it but I opened up Robinhood and AAL was at $11!?!? Put ALL of my money in of course.", "score": -15, "replies": [{"body": "Dude, stahp!", "score": 4, "replies": [{"body": "*when you only know one joke", "score": -3, "replies": [{"body": "Oh no, a clown is trying to offend me.", "score": 0, "replies": [{"body": "I was referring to myself", "score": 1, "replies": [{"body": "Well, this has gone tits up!", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Leveraged ETFs during 2008 -- A Retarded Hypothetical", "selftext": "Let's say that TQQQ was started in the early 2000s, and not 2010. Hypothetically, how would TQQQ have fared through 2008? Or any leveraged ETF for that matter... because I can't find any leveraged ETFs that were around besides a dumb silver ETF started in '06.\n\nA $100k investment in TQQQ in 2010 would be worth $5 million right now, whereas some dumbass vanguard retirement fund would be worth 1/10th that. See fancy chart below for backtesting:\n\n&#x200B;\n\nhttps://preview.redd.it/vbicblpfugf51.png?width=473&format=png&auto=webp&s=628aace4e3e9afa12e2cb42c2da222ec848a1620\n\nBoomers say leverage is dumb. A supposedly wise man once said \"Wall Street mistook leverage for genius,\" but that guy also shorted Tesla. So who's the real retard, huh, Steve Eisman?\n\nSo what would've happened during 2008 when a recession was stretched out over a couple of years and not a month like that silly covid recession? If someone was hypothetically retarded enough to go 100% into TQQQ (maybe 25% TMF), would this hypothetical smoothbrain be living in a cardboard box or a yacht in 2030? Hypothetically, of course.", "id": "i52uoz", "created_utc": 1596756695.0, "score": 39, "upvote_ratio": 0.91, "num_comments": 30, "comments": [{"body": "Well, you’re right.  This post is absolutely retarded.", "score": 34, "replies": []}, {"body": "JPOW wasnt leading fed in 2008. Stonks only go up. \n\nRKT 🚀🚀🚀", "score": 23, "replies": [{"body": "Well, I served as an assistant secretary and as undersecretary of the Treasury under President George H.W. Bush. There, I was responsible for policy on financial institutions, the Treasury debt market, and related areas. Before joining the Trump administration, I worked as a lawyer and investment banker in New York City.\n\nSo yes, now 📈", "score": 6, "replies": []}]}, {"body": "Leveraged ETFs  re-balance daily. You can imagine that this becomes an issue when trying to rebound from a dip because every time the ETF decreases in value, and the positions are re-balanced, the amount of equity the leveraged is applied to decreases. This makes recovering from dips particularity difficult. 2020 being an exception because the market only went down for a few weeks.\n\nAlso, I am thinking you likely forgot to add in the expense ratio on your back testing. I too have back tested TQQQ, and when you include the expense ratio, it does not result in an order of magnitude more money. It is still a lot of money though.\n\nAnyway, in a market that doesn't experience many significant declines, a leveraged ETF kicks ass. If you understand the math behind the leverage you can model a leveraged version of any index through time. Take a look at period after WW2 - lots of volatility in the late 40s and 50s. Or even the late 60s through the 1980 when the economy declined steadily. You will see leveraged ETFs start to perform very poorly. If you go long, make sure you have reason to believe the ride will be smooth.", "score": 12, "replies": [{"body": "Portfolio Visualiser does included all the fees associated with the leverage ETF. If one was going to do a leverage ETF strategies, it would be a mix between TMF and UPRO", "score": 2, "replies": []}, {"body": "Thanks for the explanation, that all makes sense. I guess it's back to FDs", "score": 2, "replies": [{"body": "I didn't say they don't work. The reason TQQQ has worked so far is because tech has made for such a smooth ride. However, take a look at a poor example to understand the risk: UDOW, which is 3x the dow. This peaked at \\~$106 in February, and since the dow has recovered to just below 3.7% of it's high. UDOW, however, is trading at $75, and thus is $31 below it's high, or 29%. If the ride isn't smooth, the re-balancing just fucking kills the returns. \n\nHave fun with your FDs", "score": 8, "replies": [{"body": "Or TNA - the poor guy still has not recovered from the bear ambush.", "score": 2, "replies": []}, {"body": "Not really, Nasdaq 100 just straight up vastly outperformed DOW which is why TQQQ works so well. Similarly, small caps simultaneously had lowed return and higher realized volatility.\n\nThe simulation isn't hard to run.", "score": 1, "replies": []}]}, {"body": "You are better off with TQQQ than FDs I'm just saying. It's not hard to simulate what happened with TQQQ in 2008 with data straight off yahoo.\n\nThe issue is whether we'll see another bull market like 2008-2020 or we will see stagnation like the 70s.", "score": 3, "replies": [{"body": "Yeah I don’t really do FDs haha. Would you simulate TQQQ In 2008 with a backtest of the individual stocks they have? It looks like TQQQ does swaps to get that leverage, which tbh I don’t fully understand or know how to backtest", "score": 1, "replies": [{"body": "You don't need to simulate with the individual stocks. Just use the closing QQQ price to simulate.", "score": 1, "replies": []}]}]}]}]}, {"body": "You saw it. I'd say 3x LETFs went through their trial by fire during the coronavirus crisis. Many got rekt and subsequently shut down. The others survived.\n\nGiven that monetary policy is likely to stay dovish and easy for many years to come. I don't think this is really retarded.\n\nYou would have to endure some soul crushing drawdowns though and have diamond hands. You could try risk parity as well to make it less painful.", "score": 7, "replies": [{"body": ">I'd say 3x LETFs went through their trial by fire during the coronavirus crisis. Many got rekt and subsequently shut down.\n\nLETFs don't shut down from downturns. ETN does", "score": 2, "replies": []}]}, {"body": "Why not compare TQQQ with QQQ? It's a much better comparison as then the difference is purely due to leverage and not the underlying holdings.\n\nIf you want to measure S&P500 then look at the 3x UPRO instead", "score": 8, "replies": []}, {"body": "Related:\n\n[https://www.reddit.com/r/wallstreetbets/comments/dk7wh1/long\\_time\\_lurker\\_here\\_ive\\_decided\\_to\\_close\\_out\\_my/](https://www.reddit.com/r/wallstreetbets/comments/dk7wh1/long_time_lurker_here_ive_decided_to_close_out_my/)", "score": 7, "replies": []}, {"body": "I read a paper in which they simulated 3x S&P buy and hold since 1928 (which includes the Great Depression) and despite 99% draw downs during the Great Depression, holding through 2017 would give something like 300x returns. I can get the link if you’d like", "score": 4, "replies": [{"body": "Please! That sounds fascinating", "score": 1, "replies": [{"body": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2741701    Here you go! And my comment before mentioned \"300x returns\" I meant to say 300x the returns of the S&P, not the initial investment. This is seen in the first table of the above paper.", "score": 5, "replies": [{"body": "You’re the man!", "score": 1, "replies": []}]}]}]}, {"body": "I mean if you're going 3x the results are either going to be spectacular or a unmitigated disaster. \n\nThe better question is how long can we keep this shit up?", "score": 3, "replies": []}, {"body": "I'm trying something similar but with 50% tmf, 25% upro and 25% TQQQ with a quarterly rebalance. Throwing 10k towards it and will try to post yearly results.\n\nGot turned on to the idea [from this](https://old.reddit.com/r/wallstreetbets/comments/hvgd8h/anyone_care_to_share_their_favorite_3x_etfs_and/fyt8o0y/?context=3) post a while back.", "score": 3, "replies": [{"body": "Yup. That comment's been sitting in the back of my mind for the last couple of weeks. I think I'll be doing something more like that, not really 100% TQQQ. Why would you go 50% TMF though, just curious?", "score": 3, "replies": [{"body": "Because of downturns like the one in March. Look at how TMF did compared to TQQQ. The ratio would have been rather lopsided at that point when a quarterly rebalance would come in handy to sell high and buy low. Granted TQQQ still dropped after that, but you get the idea. \n\n 3x has lots of risk and decay and rebalancing can negate some of that. \n\nThe way I see it is the market is more heavily involved in the lives of people now more than ever. It's not just the richest of us. Pensions are gone and 401ks and Roth IRAs are taking over. It's damn near a utility with how many people depend on it for retirement and income. Because of that it's in everyone's interest to keep it from crashing at the very least, much less a sustained downturn, so lots of money and every bit of fuckery available will be used to keep it afloat (i.e. printer go brrrr). This will help keep leveraged etfs from not completely going to shit, although of course there's still the risk. But that's investing.\n\nNow is this sustainable? I have no idea. But if it fails we're all fucked so I'll bet on dying before that day comes and riding until I can retire and switch to safer returns.", "score": 4, "replies": []}]}]}, {"body": "You have to consider the possibility of a liquidation of the etf in case of extreme downturn...", "score": 3, "replies": []}, {"body": "Your money goes to zero in a severe recession. That’s why every 3x ETF says *not suitable for long term holding*", "score": 3, "replies": []}, {"body": "Read about beta slippage and you'll understand why leveraged ETFs aren't as wonderful as you seem to think.", "score": 5, "replies": [{"body": "It's hard to argue with the results. TQQQ has performed like a greased pig in an uphill slip n slide contest.", "score": 5, "replies": []}, {"body": "Wanna say that to my face, punk?", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "True. But over 10 years, SPXL has 4x the returns\n\n [https://www.portfoliovisualizer.com/backtest-portfolio?s=y&timePeriod=4&startYear=1985&firstMonth=1&endYear=2020&lastMonth=12&calendarAligned=true&includeYTD=false&initialAmount=10000&annualOperation=0&annualAdjustment=0&inflationAdjusted=true&annualPercentage=0.0&frequency=4&rebalanceType=1&absoluteDeviation=5.0&relativeDeviation=25.0&showYield=false&reinvestDividends=true&portfolioNames=true&portfolioName1=SPXL&portfolioName2=SPY&portfolioName3=Portfolio+3&symbol1=SPXL&allocation1\\_1=100&symbol2=SPY&allocation2\\_2=100](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&timePeriod=4&startYear=1985&firstMonth=1&endYear=2020&lastMonth=12&calendarAligned=true&includeYTD=false&initialAmount=10000&annualOperation=0&annualAdjustment=0&inflationAdjusted=true&annualPercentage=0.0&frequency=4&rebalanceType=1&absoluteDeviation=5.0&relativeDeviation=25.0&showYield=false&reinvestDividends=true&portfolioNames=true&portfolioName1=SPXL&portfolioName2=SPY&portfolioName3=Portfolio+3&symbol1=SPXL&allocation1_1=100&symbol2=SPY&allocation2_2=100)", "score": 6, "replies": []}]}]}
