{"title": "✅ Daily Chat Thread and Discussion ✅", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "1d7o4up", "created_utc": 1717473630.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 56, "comments": [{"body": "Mizuho analyst Vijay Rakesh maintains NVIDIA (NVDA.NaE) with a Buy and raises the price target from $1180 to $1275.", "score": 13, "replies": []}, {"body": "$1200 before the split. It’s what we need", "score": 11, "replies": []}, {"body": "1200 soon", "score": 9, "replies": []}, {"body": "* Elon Musk told the chipmaker to prioritize shipments of processors to X and xAI ahead of Tesla.\n* Musk has said he can grow Tesla into a major player in artificial intelligence and that the company is spending heavily on Nvidia’s AI processors.\n* By ordering Nvidia to let X jump the line ahead of Tesla, Musk delayed the automaker’s receipt of over $500 million in processors by months.\n\n\n\n[https://www.cnbc.com/2024/06/04/elon-musk-told-nvidia-to-ship-ai-chips-reserved-for-tesla-to-x-xai.html](https://www.cnbc.com/2024/06/04/elon-musk-told-nvidia-to-ship-ai-chips-reserved-for-tesla-to-x-xai.html)", "score": 8, "replies": [{"body": "clown ceo musk", "score": 8, "replies": []}, {"body": "What a weird story, nvidia employees need to stop leaking shit to the media, this is the way to burn bridges.", "score": 3, "replies": []}, {"body": "Wonder what Tesla holders think about this", "score": 2, "replies": [{"body": "Jensen just called FSD the best, so not sure it affects them too much?", "score": 1, "replies": []}]}, {"body": "What an absolute maniac.", "score": 1, "replies": []}]}, {"body": "Rally into close like yesterday, please.", "score": 7, "replies": [{"body": "Ask and you shall receive.", "score": 3, "replies": []}]}, {"body": "About to break 52 week high of $1161.23", "score": 6, "replies": []}, {"body": "comfy holding and waiting", "score": 6, "replies": []}, {"body": "all time high", "score": 5, "replies": []}, {"body": "YouTubers and “Analysts” who say ‘Nah-videa’ need to be dragged out to the alley and slapped", "score": 10, "replies": [{"body": "With straps of C notes across the face.", "score": 2, "replies": []}]}, {"body": "Curious noob here. A few months ago, when the drop began in March, i noticed that the European market would bring Nvidias stock up, and then, after 6h of trading, the American market would open and the stock would drop very quickly. Now, after recovering from the volatility between March and May, its the opposite. Its seems the European market is bringing the stock down constantly and the American is bringing it up. What causes this? Whats the difference between markets, if there is any? Is this a stupid observation that makes no sense? If so, Im sorry. Im still a novice on this.", "score": 3, "replies": [{"body": "I am not sure but thinking volume is the biggest player here", "score": 1, "replies": []}]}, {"body": "I’ve got 0.2 shares in NVDA right now. After the split. Will I have 2 shares or are they only splitting whole numbers bc in the past, I’ve lost some shares in another stock after they did a reverse split and since they only did full shares, I lost the excess that didn’t get split.", "score": 5, "replies": [{"body": "It depends how your brokerage operates. Robinhood 10x everything. Some brokerages only 10x whole shares and liquidate the remainder and add it back to your brokerage account as cash.", "score": 3, "replies": []}, {"body": "X10 to everything", "score": 1, "replies": []}]}, {"body": "Someone spoke to power hour early", "score": 4, "replies": []}, {"body": "TSMC considering raising prices on Nvidia\n\nhttps://x.com/dnystedt/status/1798143892971565346?s=46", "score": 3, "replies": [{"body": "I am not surprised.  NVDA just basically said we can't keep up with demand and we are printing stupid money off of these.  I would raise prices too.", "score": 3, "replies": []}, {"body": "good to hedge w tsmc stock but samsung foundry also happy to help", "score": 2, "replies": []}]}, {"body": "I have just started investing the past two years and currently own 11 shares of NVDA. I have always thought of this a long term investment and I am in no way looking to sell in the near future. I just had a question and hoped to get some opinions from other NVDA shareholders or others interested in this company. \n\nWith Nvidia announcing their new chip, Rubin, this past weekend is there any worry that Nvidia is introducing their product too fast? Will companies like Meta, Microsoft, Tesla, etc, become upset that they just dropped a bag on the last generation of chips that was the “best” only to see another game changing chip drop less than 3 months later? Could this lead to cancellation of orders of Blackwell? \n\nI have full faith in this company and in no way am I trying to bash their business model, I was just wondering if it would pay to take a little bit of time on the roll out between chips. I am interested to hear what others think and feel free to lmk if this is a dumb concern and or question. \n\nTIA!", "score": 2, "replies": [{"body": "They don’t become upset cause they of course know what will come when they bought the chips. Jensen can’t tell them : here buy the chips for billions, and let’s see what the future brings.☺️\nClearly he told them ( long bevor it was public)  the possible upgrade paths with an outlook for the coming years, perhaps even upgrade contracts.\nThey never would spent so much without exactly knowing what upgrade options they have.", "score": 2, "replies": []}, {"body": "Demand for Hooper increased after Jensen provided the details for Blackwell at GTC\n\nDemand is so high for data centers that it likely won’t matter and companies will “average in” as opposed to not buying any compute for 6-12 months to wait for the latest a greatest\n\nWith Nvidia moving to an annual cycle, there will always be something better on the horizon for the foreseeable future", "score": 2, "replies": []}, {"body": "I think Jensen would let Meta, Tesla and Microsoft in on information regarding their upcoming chips. Also, these companies should know by now that NVIDIA will release a new chip each year and would bring that up in any future deals/conversations with NVIDIA. \n\nFrom that point, the decision is up to each one of these companies on what decision to make. Like Elon claimed, hed rather wait.", "score": 1, "replies": []}]}, {"body": "Fake dip in premarket?", "score": 2, "replies": [{"body": "Shake the tree and see what flies out.", "score": 2, "replies": []}]}, {"body": "UiPath is an Robotics Processing Automation (RPA) platform that i use at work. It’s also a stock that some YouTubers recommend since it gets some of the AI halo. It was trading at $25 a share and is now at around $12. I think it’s because of the advancements in AI and NVDA that enable coding to happen via natural language and prompts. Anyone else here have a perspective on existing Robotics Process Automation and the impact Nvidia advancements. In AI have on those platforms?", "score": 2, "replies": [{"body": "uipath is a mouse click automator and a cathie wood trash stock", "score": 3, "replies": [{"body": "Ouch", "score": 1, "replies": []}, {"body": "Ouch. So no value at all?", "score": 1, "replies": [{"body": "Don't take his word, you use it.  What do you think?  Cathie Wood is trash.", "score": 2, "replies": []}]}]}]}, {"body": "Does anyone know what Fidelity will do with fractional shares after the split? Will they converted into fractional shares after the split as well or cashed out?", "score": 2, "replies": [{"body": "Previously it's been said you take your fractional share and multiply it times 10 and that's what you'll have after the split.", "score": 2, "replies": []}, {"body": "The Fidelity website says don't worry about it. As far as fractional shares they are still your shares so they will just be rolled into the split. You won't have to sell or do anything. Anyway, here's the link\nhttps://www.fidelity.com/learning-center/trading-investing/stock-splits", "score": 1, "replies": []}]}, {"body": "What could happen after the split?", "score": 1, "replies": [{"body": "We become more rich", "score": 4, "replies": [{"body": "Richer. FIFY", "score": 2, "replies": []}]}]}, {"body": "We are at a 52-week high of 1,165.48, y'all believe this will hold till the split, or some more volatile action?", "score": 1, "replies": []}, {"body": "https://finance.yahoo.com/news/tesla-likely-spend-3-billion-182841266.html\n\n(Reuters) -Tesla will likely spend between $3 billion and $4 billion on its purchases of chip company Nvidia's hardware this year, CEO Elon Musk said in a post on X on Tuesday.\n\nMusk also said that out of the $10 billion in artificial intelligence-related capital expenditure this year, around half would be internal spend.\n\n\"For building the AI training superclusters, NVidia (sic) hardware is about 2/3 of the cost,\" he said on X.", "score": 1, "replies": []}, {"body": "Its acting weird after hours the last few days.. seems to always be going down the moment it closes. Tree shaking perhaps", "score": 1, "replies": [{"body": "People clearing out their trading positions.  You don't want to be wrong over night with this world.", "score": 1, "replies": []}]}, {"body": "Bad sign today.  My sister in law called and wants to get some shares with her $5K.  To be fair her husband is an engineering director so he understands the tech but she is as street retail as it gets.", "score": 1, "replies": [{"body": "Bad sign your sister in law wants to invest?", "score": 2, "replies": []}, {"body": "Bad sign of what? More demand for the stock is better for everyone", "score": 2, "replies": []}, {"body": "Has your sister in law said the same thing about BITCOIN? :O", "score": 2, "replies": [{"body": "Not yet.  I am glad you got what I was saying.", "score": 1, "replies": []}]}]}, {"body": "The hell people not buying they literally releases blackwells replacement in 2 years about to be #1 company\nThis is a 5 year hold $1000 a week into nvda for 5 years is literally multi millions", "score": 0, "replies": []}]}
{"title": "Passive income from Mag7?", "selftext": "Hey guys,\n\nI have enough capital to get 100 shares of Tesla, Nvidia, Netflix, Meta, Google, Apple, Amazon, Microsoft and Spy\n\nHow much passive income can I realistically make from that by selling covered calls weekly?\n\nAnd would this be a sustainable way to get passive income?\n\nI’m looking to maybe get 2-3k monthly.\n\nI think covered calls is what they’re called.\n\n***I don’t plan on selling my shares unless I have to for whatever reason.", "id": "1d88lsc", "created_utc": 1717536207.0, "score": 27, "upvote_ratio": 0.71, "num_comments": 69, "comments": [{"body": "It’s not going be passive and also depends heavily on the IV environment, but 2k monthly from what, $400,000? is definitely possible. It will be a challenge to track all of these though, why not just do QQQ and/or SPY/VOO?", "score": 29, "replies": [{"body": "Someone else just suggested that and it makes more sense.\n\nI’ll be doing spy and just hold the other Mag 7shares", "score": 9, "replies": [{"body": "That’ll also limit the risk that the price jumps and your shares get called away, but if you’re expecting some downside or flat movement from them and already have the shares, some far-out CCs might not be the worst option. Just depending on whatever your outlook is. Cheers", "score": 5, "replies": []}, {"body": "Do not use etf options, use index or futures options like spx, xsp, /es, etc so you get 1256 tax status\n\nYou also do not have the same contract risk as american style options\n\nhttps://www.cboe.com/tradable_products/sp_500/spx_options/", "score": 2, "replies": [{"body": "Can you explain what the difference would be tax wise to trade spy or Sox?", "score": 1, "replies": [{"body": "SPX = 60% long term gains, 40% short term gains\n\nSPY = 100% short term gains", "score": 1, "replies": []}]}]}]}, {"body": "I second this, the distribution of returns on SPY and QQQ are much more normally distributed, so selling a ~20 delta CC limits the two loss scenarios (stock goes down and you’re stuck holding it, or stock explodes and you miss out on gains).\n\nPlus you can sell the calls daily rather than weekly and squeeze out premium. I’ve been conservatively hitting 1% a week, so having $500k will absolutely yield what you’re looking for in income.", "score": 5, "replies": []}, {"body": "I’d imagine the EV and premiums are higher for the individual stocks vs SPY and QQQ", "score": 3, "replies": []}, {"body": "Another alternative, that might be safer, is to deposit the $400,000 into a savings that pays 5% APY.\n\nThe balance and interest earned at the end of each month for the first year, assuming a one-time deposit of $400,000 with an APY of 5% compounded monthly is:\n\n|Month|Balance|Interest Earned|\n|:-|:-|:-|\n|1|$401,666.67|$1,666.67|\n|2|$403,340.28|$1,673.61|\n|3|$405,020.86|$1,680.58|\n|4|$406,708.45|$1,687.59|\n|5|$408,403.07|$1,694.62|\n|6|$410,104.75|$1,701.68|\n|7|$411,813.52|$1,708.77|\n|8|$413,529.41|$1,715.89|\n|9|$415,252.45|$1,723.04|\n|10|$416,982.66|$1,730.22|\n|11|$418,720.09|$1,737.43|\n|12|$420,464.76|$1,744.67|\n\nBy the end of the year, your balance would be $420,464.76, and the total interest earned over the year would be $20,464.76.\n\nIt's not 2-3K a month, but somewhat safer.", "score": 6, "replies": [{"body": "Why? The S&P 500 historically has a 10% return over the past 60+ years and something like 16% the past 10 years… \n\nEven in a normal inflation year, inflation rate will be around 2%, your high yield savings account will only net you 3% annually plus the compound interest you get if you don’t touch your earnings. Regardless, under your model, OP would be giving up an additional $20k-$30k annually vs putting his money into the market/an ETF. \n\nFinally any savings account would be taxed as normal income vs eft’s are subjected to capital gains tax. So the only thing OP would have to pay in taxes on stocks every year is the dividends on his holdings or until he sold shares vs paying taxes on the entire $20k earnings he’d get every year from his saving. His tax rate would be also be considerably lower with long term capital gains tax vs ordinary income tax. \n\nJust food for thought when you’re talking about stashing your money into a high yield savings account.", "score": 8, "replies": [{"body": "This would assume OP have a long term investment horizon.", "score": 1, "replies": []}]}]}]}, {"body": "selling covered calls and Cash seccured puts is easy, i dont know what everyone here is talking about, it takes about 5 min every monday at open for me to pick my CC strike price on AMZN, usually a .20 delta or lower is safest ive found, i sell weeklies and if my shares get called away i immediately open a cash secured put.... 'the wheel'   i only have the shares to do 1 amzn contract weekly and im netting 80-100 bucks a week for 5 min of work and 1 contract only..... not hard, no stress.  \n\nsure SPY daily would be more income  but i dont have 100 shares of that yet, sounds like you do  so go for it.", "score": 22, "replies": []}, {"body": "It wont be passive income.  \n\nWhen selling weekly, you need is a system on range and timing telling you WHEN to sell otherwise you will just clapped.  \n\nHere are some ideas of systems that I have seen on Reddit:\n\nu/VeteranWallSt has a system for SPX.  Here is a very detailed write up\n\nhttps://www.reddit.com/r/IndieTradersGuild/s/xDhcyuY2ih\n\nRead u/calevonlear posts about hyperwheeling \n\nTammy Chambliss runs multiple entry iron condors.  Dont think she is on here but if you google or search for it here you will find info on it.", "score": 7, "replies": []}, {"body": "I think what you’re looking for more specifically is cash secured puts. The difference is instead of already owning the shares and collecting a premium is the broker set aside or put the amount to buy the 100 shares as collateral meaning you can’t use that money until you close the position but you’re still able to collect the premiums upfront. The cons is if it drop below your strike price you have to buy 100 shares times the amount of contracts you’re selling at whatever strike you chose and can incur a bigger loss than what you received in premium. I’m not an expert on this but there’s a lot of videos and sites that goes in detail on what it is and how to you can use it to generate income from it consistently. Keep in mind this only really works if the stock you’re trading is already in a bullish market and your expecting the stock price to stay above your strike price by expiration, there may be some others ways you can make money from it even in a bear market or side ways market but it just makes the most sense to only do it for bullish stocks mainly the big 7 that you mentioned", "score": 6, "replies": [{"body": "Yes, OP ought to consider cash secured puts if s/he wants to generate cash but not collect dividends. OP states a thought of owning shares,  and  a delta 0.10 csp is also a good way to get some cash and eventually buy shares when they're down (through assignment).", "score": 2, "replies": [{"body": "Even then when op get assigned if he actually like the stock and wouldn’t mind holding it op can start selling covered calls on them to still produce income but cash secured puts is the best way in my opinion to start that process/cycle", "score": 1, "replies": []}]}]}, {"body": "You'll have to decide for yourself how frequently you're willing to deal with your shares being called away, and have a plan for what to do when it happens. A good rule of thumb for thinking about the probability of the calls being exercised is to look at the delta, where -0.02 would represent a 2% chance, for example. \n\nYou might be better off just looking into dividend ETFs if you want something more passive and don't have time to deal with the risk management aspect of options, though.", "score": 3, "replies": [{"body": "What does “called away mean”", "score": 1, "replies": [{"body": "Forced to sell", "score": 2, "replies": []}]}]}, {"body": "Passive income is not selling covered calls . . .\n\nIt is buying the shares and then holding them. Options trading is very active and requires setting up proper trades and then managing them.", "score": 9, "replies": [{"body": "I generate 2% a month on a mid 6 figure account employing a multitude of short selling strategies where it takes 2-3 hours per week to setup and manage. Feels pretty passive to me.", "score": 9, "replies": [{"body": "But you’re barely beating the market this way if at all", "score": 3, "replies": [{"body": "2% compounded monthly is >24% annualized. That’s beating the market’s average annual return. Sure, I won’t beat the market in some stellar years, but that’s not my goal. \n\nMy goal is consistent income, market up or down.", "score": 5, "replies": [{"body": "Ah, you’re upsizing your positions. In that case I retract my reply.\n\nDisregard!", "score": 1, "replies": []}]}, {"body": "The historical S&P annual returns are around 10% so u/r_brockmaniv is beating the \"market\" by a good amount.\n\n[S&P 500 Average Return and Historical Performance (investopedia.com)](https://www.investopedia.com/ask/answers/042415/what-average-annual-return-sp-500.asp)", "score": 2, "replies": [{"body": "If he’s also consistently +2% compounding in a bear market, then yeah\n\nOtherwise, in a bull market the sp500 always has 18-22% returns. The 10% figure is averaged out", "score": 1, "replies": [{"body": "It IS the historical average, and the S&P does NOT \"always: have 18-22% returns . . . Did you open the link and read it?\n\nJust in 2022 the S&P lost 18%, so it can go down and stay down for periods of time.", "score": 1, "replies": [{"body": "Did you read anything I’ve said? Hello? That’s literally my point", "score": 1, "replies": []}]}]}]}]}, {"body": "Congrats on your success! \n\nNot trying to be the definition police, but \"passive\" is buying and holding, not trading even 2-3 hours per week which is active trading - [Passive Investing Definition and Pros & Cons, vs. Active Investing (investopedia.com)](https://www.investopedia.com/terms/p/passiveinvesting.asp)", "score": 1, "replies": [{"body": "Fair enough!", "score": 1, "replies": []}]}, {"body": "2 % monthly seems like a lot, congrats! \n\nDid you explain your strategy in a post somewhere?", "score": 1, "replies": [{"body": "Probably yes. Mixture of put debit spreads financed by far OTM short puts, short strangles, occasional put credit spreads. Almost all on futures.", "score": 1, "replies": [{"body": "Are you always working on the same underlying?\n\nIs it a systematic or discretionary strategy?", "score": 1, "replies": [{"body": "Different underlyings. The PDS trade is the 1-1-2 and I put it on as a campaign using /ES. 120 DTE every 2 weeks. Other trades depend on chart setup.", "score": 1, "replies": [{"body": "Ah, heard about the 1-1-2 trade but never really looked into it. Is that your bread and butter trade?\n\n>Other trades depend on chart setup\nPure price action or do you use indicators?", "score": 1, "replies": [{"body": "It makes up a majority of my trades but it doesn’t come without risk. If there is a large drop in the underlying early on in the trade, it will be felt. I don’t sweat it if I’m not near my stop loss but if there was a black swan event (volmagedden, Covid), there will issues because I have up to 8 trades on at once. \n\nI am running a hedging campaign as well to combat this eventuality. \n\nChart setup on other trades is combination of ATR and RSI.", "score": 1, "replies": [{"body": ">it doesn’t come without risk\n\nWhat doesn't in terms of trading strategy? ;)\n\nI'm guessing you monitor them during the trading session to mitigate the risk?\n\nAlso, I'm surprised this strategy works in the low vol environnement we have right now. A sudden vol increase would make this position quite dangerous. That's why I would only do it in high vol environement IMO.", "score": 1, "replies": [{"body": "Yeah of course :)\n\nMy stop loss is max trap profit potential. No need to monitor until the stop loss is approaching. When Iran was struck a few months back, vol expanded like crazy. I was deep in the red for a bit but none of the positions were even close to stopping out. Left it alone and things settled down. \n\nI've since been putting on the hedging campaign in case such situation happens again but only gets worse.", "score": 1, "replies": [{"body": "Have you calculated your CAGR with this strategy?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "It's easy until it isn't", "score": 3, "replies": []}]}, {"body": "So what you’re saying (mathematically speaking, of course) is that you’re looking to get about a 6% current return “passively” on your approximate amount of invested capital (full disclosure - this was a back of the envelope calculation on the fly). Why go through the brain damage to stare at a screen all week just for 6% returns? There are plenty of safe-yielding stocks out there that can achieve the same cash returns without all the brain damage. Just saying.", "score": 4, "replies": [{"body": "Why you calling me out like that lol", "score": 0, "replies": []}]}, {"body": "Try a 5% CD.", "score": 3, "replies": []}, {"body": "If there is any such thing as passive options trading, and there is not in my view, you could trade .10 - .15 delta covered calls and make 10 - 15% of the account annually.", "score": 1, "replies": []}, {"body": "Might wanna try YMAG. It does this more or less except don't actually own the underlying security.\nFyi", "score": 1, "replies": []}, {"body": "JEPQ 3 yr avg annual return 10% … owning the QQQ’s outright 10 yr avg annual return 20%", "score": 1, "replies": []}, {"body": "What is the total value of your Mag 7 stocks and how much income do you want to generate?", "score": 1, "replies": [{"body": "Like 450k+, I’d like to generate 2-3k monthly in cashflow.", "score": 1, "replies": [{"body": "Do not sell any options on your stocks. Use the buying power of your stocks as collateral to sell index options. I sell NDX options to generate income. NDX is the index that QQQ tracks.\n\nThe 30-DTE Jul 5 16625 put can be sold for $20 generating 2000 in income in a month. Delta of the put is low at 0.038 and it is about 10% OTM. So the risk of assignment is low.\n\nTo get $3000, we can increase the delta a little bit and sell the 17000 put for 30. Delta of the put is 0.056 and it is 9% OTM.\n\nEach put requires 160 K in collateral and can be covered by the value (or buying power) of your stocks. Your stocks have 315 K in buying power.\n\nThis strategy requires a margin account and approval for naked options.", "score": 3, "replies": [{"body": "OP was not sure what covered call is. Wants simple cash flow. \n\nYou are offering an advice to trade naked puts on margin  \n\nFull Stop 🛑", "score": 6, "replies": [{"body": "I said the strategy requires a margin account and approval for naked options.\n\nOP can save this for future use.\n\nI hope it will be useful for others now.", "score": 2, "replies": [{"body": "It would not. \n\nWhat you mention is a strategy. For one to clearly understand the risks, profits and have tools to engage - 10s if not 100s of hours of experience needed. Even with that, this is not for everyone’s risk tolerance and one would not know it unless experienced it more likely in a bad way. \n\nYou should know this if you doing naked puts on margin. Yet, you are advertising it. This strategy could be well profitable yet it is very risky additionally said anything on margin is 10x the risk. This is ok strategy for a qualified investors that “seasoned” in the market with the risks it comes with.", "score": 2, "replies": [{"body": "If you think that a 0.06 delta naked NDX put is 10X riskier than what has been suggested in this thread, you must prove it.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Look into Yieldmax Option Income Strategy ETF’s. Most of the Mag 7 have underlying derivative ETFs that hold call options and some downside put protection as well as T-Bills. Personally I like NVDY and MSTY and CONY if Bitcoin is in an uptrend. Monthly dividend amount should be released tomorrow so still time to buy in to collect the June dividend. 50-100% + monthly yield. Downside is you have to average down and baghold to break even if you don’t DRIP.\n\nhttps://www.yieldmaxetfs.com/our-etfs/", "score": 1, "replies": []}, {"body": "I mean, you'd be far better off selling es strangles and keeping your cash in notes. Earn interest on the notes and earn a couple k in premium with only one position to manage.", "score": 1, "replies": []}, {"body": "Buy KO, idk how much money you have but with 500.000 you can get ~8000 shares and that’s 0.5$ dividend per share every quarter\n\n4k in dividend, 1300$ per month \n\nAlso, with that, you can sell a lot of Covered calls and performed the Wheel strategy if necessary", "score": 1, "replies": []}, {"body": "Why not just TQQQ?", "score": 1, "replies": []}, {"body": "It would be easier to make 4k monthly flat from dividends on stuff like JEPQ from 400k than selling covered calls. Covered calls aren’t passive income cuz you have to maintain them stuff like meta moves a lot so you might get your shares called away and anything way out the money isn’t worth it, stuff like Tesla can fall and then your covered calls won’t justify the loss of capital from those shares. Same with Netflix and definitely nvidia although nvidia currently is one of the better options from this pic. Amazon and apple and google CCs are god shit low lol so don’t even bother. With as much capital as you got just invest into divs and collect monthly.", "score": 1, "replies": []}, {"body": "Might not be the year. I keep rolling mine as the mag 7 climb higher and higher lol", "score": 1, "replies": [{"body": "What do you mean by this?", "score": 1, "replies": [{"body": "The mag 7 are having a hell of a year. When selling covered calls, you can miss out on any gains past your strike price. So I've been rolling my contacts higher and higher, with further expiration date to account for the difference in contract price. The idea is eventually I'll catch the top enough and be fine. Or we get assigned and  lose the shares.", "score": 1, "replies": []}]}]}, {"body": "Just buy an ETF like JEPQ, or QQQI.", "score": 1, "replies": [{"body": "What’s the difference between those and SPY?\n\nAlso, how would I get passive income from them?", "score": 1, "replies": []}]}, {"body": "Bout tree fiddy\nSustainable? Maybe\nPassive? No", "score": 0, "replies": []}, {"body": "If you have the cash, put it in a money market fund and earn interest.  Apply for margin just in case.  Sell cash secured calls on the stock of your choice.  If they get assigned, buy the stock then or just buy to close the calls.", "score": 0, "replies": []}, {"body": "Let me tell you a story, I have TSLA from around $380. You can’t do covered calls on them at a $380 price. You basically get nothing in premium. You might be safer doing covered calls on the index.", "score": 0, "replies": [{"body": "TSLA seems much more volatile than the other stocks mentioned", "score": 1, "replies": []}]}, {"body": "Covered calls allow you flexibility to select and balance your positions, though a major downside is having the share price blow right past your strike price. You can quickly be forced to come up with a lot out of pocket or risk having the shares called away. To reduce this risk, sell for less premium further OTM. \n\n\nPicking up nickels: sustainable, low risk, but not really going to generate high premiums. Closer to the money will get the better premium, with added risk as detailed above. (In any event, your holdings dropping to $0 plus whatever premium collected is true max risk, but that's present in any non hedged long position). \n\n\n3K-4K a week is possible, but it will likely not be consistent enough. Collecting 10k in premium isn't impossible, now is needing to spend that much to protect your position. Honestly, I think it sounds like far more work/risk than value to be found here.\n\n\nI think following each individual company with the goal of trading weeklies is going to be very time consuming. Have you considered maybe buying 2-300 shares of SPY or QQQ instead of maybe Nvidia? Their market cap gives you pretty solid exposure to them, especially through QQQ. If you are already putting in the work, I would think weeklies or even shorter contacts on these are going to produce a better,  safer premium all else considered.\n\n\nBest of luck with whatever you choose.", "score": 0, "replies": [{"body": "Oh that’s makes sense, with using spy instead!\n\nThanks a lot for your thoughtful response.\n\n\nI’ll practice paper trading and go from there", "score": 2, "replies": []}]}]}
{"title": "Time to sell/short Tesla", "selftext": "[removed]", "id": "1d806qi", "created_utc": 1717515411.0, "score": 50, "upvote_ratio": 0.76, "num_comments": 56, "comments": [{"body": "OK so do it and post a screenshot mofucka", "score": 1, "replies": []}, {"body": "You need to somehow properly time when the Elon cult falls apart. There's a substantial number of people who think that Elon/Tesla can do no wrong and will rationalize just about everything. The current forward PE on Tesla is 70 and Tesla isn't growing anymore. It's clearly overvalued but the people who hold Tesla stock don't care. The market can worship Elon longer than you can remain solvent.", "score": 69, "replies": [{"body": "Yeah, I got burnt so hard several times on this fkin stock. Won't touch it anymore", "score": 6, "replies": []}, {"body": "Last week I sold my TSLA shares and exchanged my money for NVDA shares. Probably not properly timed, but I sold at my breakeven point, and fuck TSLA at this point. I'll buy back in if/when TSLA gets their shit together.", "score": 12, "replies": [{"body": "When the shit is together it’s prob up 100% already tho", "score": 1, "replies": []}]}, {"body": "This is the correct take", "score": 3, "replies": []}, {"body": "I bet you felt like a badass when you thought of using that last phrase.", "score": 1, "replies": []}, {"body": "Something makes Tesla 10x as innovative as any other car company. Imo that something is Elon. Innovation requires that you destroy old ways. Few people are willing to do that to the degree that Elon is willing.\n\nA specific example of this is in the cyber trucks switch to a 48v system. That change should've occured in the 70s but every traditional manufacturer was too afraid to take the leap. Mind you that's not a technical leap, it's a logistics leap. No one wanted to put in the research, force the suppliers or deal with issues that may arise. That's 50 years of companies following the status quo. \n\nIf Elon isn't what makes Tesla special then idk what is. Tesla is in a league of their own. You see it in the cars, the stock price and the sales. He does many things that are inefficient but the pros still outweigh the cons.\n\nIf he's so stupid then why can't anyone else do what he's doing? If Elon has an IQ of 100 then the ceos of Toyota, Ford, gm, VW, BMW, stellantis and Mercedes all have an IQ of 50. Tesla may suck but everyone else sucks more", "score": 1, "replies": []}, {"body": "Can’t stand Elon at all, but if you think EV adoption and growth is over you will be proven sadly mistaken by history.", "score": 1, "replies": []}]}, {"body": "Elon Musk is a fool and a liability. I've seen enough. Sell, sell, sell! Next question!", "score": 55, "replies": [{"body": "Someone buy this bot a beer", "score": 8, "replies": []}, {"body": "I see VM's been watching Jim Cramer lately", "score": 10, "replies": []}, {"body": "The bot knows what's up", "score": 8, "replies": []}, {"body": "You can tell it was trained on reddit.", "score": 3, "replies": []}]}, {"body": "Ah yes, after its dropped 60% is when you sell.", "score": 25, "replies": [{"body": "You do realize that the stock can drop 60% several more times going forward, right?", "score": 5, "replies": []}, {"body": "Market is at ATHs and Tesla is down 60%. What is suppose to happen when there’s a market correction?", "score": 10, "replies": [{"body": "Teslatard will downvote you as they carry the bag for elon![img](emote|t5_2th52|8883)", "score": 8, "replies": []}, {"body": "Sometimes you just gotta take the L and exit a trade. I am not saying Tesla is the case for this but not every stock bounces back.", "score": 3, "replies": []}]}, {"body": "Price of anything this guy touches is an absolute mystery, i wouldn't be surprised if we saw another -50% one year from now", "score": 2, "replies": []}, {"body": "That’s what they say on run ups and well and then they miss out on another 60%w This is just the worst argument ever.", "score": 1, "replies": []}]}, {"body": "\"Tesla had no place to send the Nvidia chips to turn them on, so they would have just sat in a warehouse.\n\n\nThe south extension of Giga Texas is almost complete. This will house 50k H100s for FSD training.\"", "score": 5, "replies": []}, {"body": "Time to buy TSLA", "score": 10, "replies": []}, {"body": "I had $1 for every short Tesla posts I’ve seen in the last 5 years I wouldn’t be on here trying to make money", "score": 7, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "This is not a reason the CEO of Tesla to tell Nvidia to give the chips to some unrelated company who is arguably a competitor. If he wants to decline the chips Nvdia should give them to whoever else is next on the list not hop them to xai", "score": 12, "replies": [{"body": "Why would he do that. He paid for it and he can do whatever he wants. Those are his companies too.", "score": -1, "replies": [{"body": "Tesla paid for them, not Elon.  Elon does not own Tesla, he is an employee.", "score": 7, "replies": [{"body": "They actually don’t understand the distinction", "score": 4, "replies": [{"body": "These are the people keeping tsla stock price up lol", "score": 2, "replies": [{"body": "Even if we are keeping the price up what is it with you. If you own the stock without believing then time for you to sell it. If you don't own the stock then keep your opinion to yourself", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I love that this literally discredits the stance he thinks he is defending.\n\nWhen you build out manufacturing facilities you want to have your equipment staged and ready to go into service as fast as possible. He said directly that construction for housing the chips is almost complete. Now the chips probably won't arrive until next year, so that addition is useless for another 6+ months.", "score": 2, "replies": []}, {"body": "yea like he ever said something that is real![img](emote|t5_2th52|4271)", "score": 5, "replies": [{"body": "Yes and we should definitely take the word of CNBC because they are fully informed and definitely aren’t just drawing their own conclusions based on very limited information.", "score": 5, "replies": [{"body": "Drawing conclusions? They just want clicks. Elon circle jerk is oddly successful at click generation.", "score": 3, "replies": []}, {"body": "not like cnbc is pinacle of truth but believing someone who is giving promises and provides shit for a decade?", "score": 1, "replies": []}]}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 2, "replies": []}, {"body": "eh, another hour another \"TSLA sucks\" post. \\*shrug\\*", "score": 4, "replies": [{"body": "Me when I lie.\n\nSearch TSLA and sort by new", "score": 1, "replies": []}]}, {"body": "This would benefit Elon more than anything since he had to sell shares to buy X. You'd be doing him a favor buying back low.", "score": 1, "replies": []}, {"body": "Steps to short?", "score": 1, "replies": []}, {"body": "So calls then, amirite? This guy has 9 lives!", "score": 1, "replies": []}, {"body": "I'm sure that you are going to be correct this time!", "score": 1, "replies": []}, {"body": "Here we go again", "score": 1, "replies": []}, {"body": "Please sell so I can buy the dip.", "score": 1, "replies": []}, {"body": "Any time tesla hits 180, get 170 puts.", "score": 1, "replies": []}, {"body": "Well guess I'll take my loss on calls and short tesla to 50 bucks", "score": 1, "replies": [{"body": "https://preview.redd.it/dne5f93ybl4d1.jpeg?width=1080&format=pjpg&auto=webp&s=21ecd911a422cadc1c777134cd9d771a721d2b4d", "score": 1, "replies": []}]}, {"body": "Even if that is the case why would he decline and give it his competitors. Do you know he is taking it for free?.", "score": 1, "replies": []}, {"body": "Bro you think Musk doesn't know his wealth is entirely toed to TSLA stock price?", "score": 2, "replies": []}, {"body": "TIL: Chips for EV = Chips for AI 🤷🏻‍♂️", "score": 1, "replies": []}, {"body": "Faith, people.", "score": -1, "replies": []}]}
{"title": "Black Berry High Value", "selftext": "I wanted to share my thoughts on BB. The company has made a successful transfer from designing and marketing phones to cyber security and (IOT). Black Berry works with IBM, Amazon Web Services, and intel. Having these direct roots and a now successful business model has resulted -45% debt while expecting a positive with-in the next two quarters. \nInsider trading was insane too. Feb 2024 $332k bought in stock, Jan 2024 $465k bought in stock $58k sold, Nov 2023 $1M bought. They weren't bought by nobodys either it was the Director, CFO, CEO, and president of (IOT)\nBeyond all the boring shit its just a stock i think will bring me a fuck ton if tenddies🤑🤑", "id": "1d83hk5", "created_utc": 1717523668.0, "score": 8, "upvote_ratio": 0.57, "num_comments": 52, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 2 weeks ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "[removed]", "score": 22, "replies": [{"body": "The phone is not a phone no more, they offer edge compute and edge security, both currently active in GM new model vehicles with supercruise, and it’s fckn awesome", "score": 1, "replies": []}]}, {"body": "Yes please pump my fucking bags", "score": 21, "replies": [{"body": "![img](emote|t5_2th52|4258)", "score": 2, "replies": []}, {"body": "Is this what the kids nowadays call handjobs?", "score": 2, "replies": []}]}, {"body": "I know i've been buying it to bring my average cost down. If it doubles I'll be even!", "score": 9, "replies": []}, {"body": "did they sell those fucking  patents  for 1b yet? holding bags at $8. the only thing that will save this is if roaring kitty yolos on it", "score": 8, "replies": [{"body": "We don’t need a roaring kitty yolo, just need automotive delivering the new vehicles like GM super cruise with the upgraded ADAS, blackberry edge computer and edge security is holding it together with Google and android 12.  Not your parents phone company no more", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/wjp2gtxqfl4d1.jpeg?width=1170&format=pjpg&auto=webp&s=4d8bb0f7e9313df370f47c13cb35c778d69858f3\n\nThey've also destroyed their EPS everytime", "score": 11, "replies": [{"body": "Damn", "score": 2, "replies": [{"body": "With them having the support they do and how much AI is imported in are life it it felt right", "score": 4, "replies": [{"body": "I had a lot of BB until recently, my portfolio was a bloodbath because of it. I hope to one day reinvest", "score": 4, "replies": [{"body": "Nows the perfect time🙌", "score": 5, "replies": []}]}]}]}, {"body": "And again", "score": 1, "replies": []}]}, {"body": "I've let go off my heavy bags. And for this reason, I don't want to see this stock mentioned ever again!", "score": 4, "replies": [{"body": "Blackberry", "score": 4, "replies": []}]}, {"body": "1 insider buy last 12 months. The rest were options to execute, which suggests executive pay package. Feel free to look at the sells. Also “blowing out EPS” just means the company is bleeding less than expected.\n\nhttps://www.nasdaq.com/market-activity/stocks/bb/insider-activity", "score": 10, "replies": []}, {"body": " I'm not sure what you mean by Black Berry High Value. Could you provide more context or clarify your question?", "score": 3, "replies": [{"body": "I mean i believe the stock is at a point where its value is not accurately represented. Up above I put why", "score": 3, "replies": []}]}, {"body": "Amazes me how many people don’t realize BB is running most of the ADAS in vehicles now.  Super Cruise etc on GM, yes Google and Android 12 are what you see, but what you don’t see is BlackBerry edge compute with RTOS and BlackBerry edge security.  Just like most don’t realize that Qualcomm is making the chips with Globalstar intergrated for the GPS.  Everyone see Qualcomm and Google but not BB and BB is what ties it all together.", "score": 3, "replies": []}, {"body": "How are you able to view that insider trading volume in Robinhood?", "score": 2, "replies": [{"body": "Its dependent on the stock some show hedge trading and insider trading sum just show robin hood trading", "score": 3, "replies": [{"body": "Weird it doesn’t show up on BB for me where did you click into?", "score": 0, "replies": [{"body": "I was gon send a video but it wont let me so just scroll to the bottom", "score": 2, "replies": [{"body": "I don't see this at the bottom. Is there a link to click?", "score": 1, "replies": [{"body": "Robinhood support says it’s a beta feature not out for everyone yet so I guess that guy is just super lucky", "score": 2, "replies": []}]}]}]}]}]}, {"body": "After you watch and extrapolate it to Blackberry, you will comprehend better as to BB's trajectory in the last three years:   \n[youtube.com/watch?v=Cd2-R8R...](https://stkt.co/AWr_CCwB)   \n   \nDo not forget that if Roaring Kitty can make Gamestop shorts shake with \\~69M shorts but with 45M new shares due to equity raise last month then what will it take for buying deep ITM buying BB call options to its shorts!   \n   \nNote BB has 60M outstanding shares short and does not need to do an equity raise! Already saw 422 contracts of $2 contracts for June 21 but this can be accelerated with this  deep ITM calls! Buying deep in the money calls has an effect on the MM and underlying shares are bought and reducing liquidity.   \n   \nIn addition, the OI is \\~400,000 which is equivant to 40M shares but it would be more effective if the proprtion was deep ITM so that the MM would have to hedge by buying shares.    \n   \nCould be a historic squeeze for BB as intitutions own \\~300M shares, present and past BB employees \\~100M and retail \\~180M.", "score": 2, "replies": []}, {"body": "I’m all in", "score": 2, "replies": []}, {"body": "It's a dud, let it go.", "score": 3, "replies": [{"body": "This is the sleeping giant not a dud! Blackberry is In most of your refined SDV now, super cruise in GM vehicles blackberry edge and edge security are running the ADAS, Google is involved and so is android 12 but BB is running that shit", "score": 3, "replies": [{"body": "Agree!", "score": 2, "replies": []}, {"body": "*Sigh*\n\nSome people never learn.", "score": -1, "replies": [{"body": "Nope, still have my AMD money that I’ve been playing with for some years", "score": 2, "replies": [{"body": "AMD is still a great investment.", "score": 2, "replies": [{"body": "Most definitely, I was buying when it was 1.78-1.87 and through out the low ends, people were saying it was going bankrupt and obviously it didn’t.  I feel the same way about BB so I took some of my earnings and opened up a BlackBerry play, not because of the meme bullshit but for the vision of where i think it’s going.  The super cruise in GM vehicles now is controlled by BlackBerry and the shit is fckn amazing.  I get the feeling from the Gm ADAS as I got when I read about this secretive chip architecture AMD was working on", "score": 3, "replies": [{"body": "I don't think BB is going anywhere. I think there are far better opportunities to focus on.", "score": 1, "replies": [{"body": "I respect your opinion on that but I’ve been in BB for a while and continue buying, got a few more years with them and I’ll reevaluate at that point.  When you get down to the tech that they have and get in the depths of it and start thinking 5g connected traffic lights etc etc, it’s going to do some amazing things.  IMO just my .02 cents.\n\nTake care", "score": 2, "replies": [{"body": "Best of luck. I hope it pays out.", "score": 2, "replies": [{"body": "Appreciate it! Keep them AMD numbers up for me ;)", "score": 2, "replies": []}]}]}]}]}, {"body": "People were telling me then I was pissing money away on AMD", "score": 3, "replies": [{"body": "I can bet I was not one of them. I saw the potential of AMD early.", "score": 2, "replies": [{"body": "Yeah this was the 2012-2016 years, not gonna lie there was a few time I questioned my sanity lol.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "🙅🙅🙅", "score": 3, "replies": []}]}, {"body": "I just swing trade it sometimes and that’s about it", "score": 1, "replies": []}, {"body": "Checks my average BB price at $14.  🫡", "score": 1, "replies": []}, {"body": "By high you mean 0 yea zero value", "score": 1, "replies": []}, {"body": "I like the stock", "score": 1, "replies": []}, {"body": "Can’t even downvote it’s a crappy stock", "score": -1, "replies": []}]}
