{"title": "When everyone is posting their NVDA gains but you're down 20% on SWHC", "selftext": "[deleted]", "id": "5cfjct", "created_utc": 1478883772.0, "score": 618, "upvote_ratio": 0.93, "num_comments": 81, "comments": [{"body": "I feel the same way about my Amazon shares. ", "score": 63, "replies": [{"body": "[deleted]", "score": 48, "replies": [{"body": "I suck at trading.\n\nMy IRA is up thanks to Trump, but he is also crushing my regular portfolio (which is nothing but Amazon shares ATM). ", "score": 20, "replies": [{"body": "[deleted]", "score": 28, "replies": [{"body": ">HUGE \n\ntriggered", "score": 20, "replies": [{"body": "YUGE", "score": 5, "replies": []}]}, {"body": "That P/E though.", "score": 4, "replies": []}]}, {"body": "I told you to sit out trading for awhile dude. :/", "score": 1, "replies": [{"body": "I bought these Amazon shares before I halted my trading. I no longer trade, I just sell calls against this position and that's it.", "score": 1, "replies": [{"body": "that makes u smarter than 90% of fags here  bruh", "score": 1, "replies": []}]}]}, {"body": "My entire portfolio is atvi and amzn", "score": 1, "replies": []}]}]}, {"body": "That's why you sell at the top.", "score": 4, "replies": []}, {"body": "Amazon will come back.\n\nSWHC needs people freaking out about gun legislation and trying to stock up on guns before it is too late. ", "score": 9, "replies": [{"body": "nah guns are safe for at least next 4 years....and decades if Trump puts conservatives on the supreme court", "score": 1, "replies": []}]}]}, {"body": "I'm both up on NVDA and down on SWHC...", "score": 27, "replies": [{"body": "Me too. Luckily put 4x as much into NVDA.", "score": 14, "replies": [{"body": "What made NVDA such a strong buy at the time? I don't really follow semiconductor/tech stocks.  Was it mostly just the kickass earnings report?", "score": 2, "replies": [{"body": "Yes, I was just in it for earnings.", "score": 2, "replies": [{"body": "when did you buy?", "score": 1, "replies": [{"body": "Friday I think", "score": 1, "replies": []}]}]}]}]}, {"body": "You're [not](http://i.imgur.com/thsyiBk.png) the only [one!](http://i.imgur.com/WrDcIdc.png)", "score": 5, "replies": [{"body": "Nice to see a brother", "score": 3, "replies": []}]}]}, {"body": "Or those DUST faggots laughing at me sitting on the NUGT train... shoot me.", "score": 14, "replies": [{"body": "People still haven't figured out that 3x etfs are for day trading? Why would you ever \"hold\" nugt?", "score": 6, "replies": [{"body": "Do you know which subreddit you're in right now?", "score": 31, "replies": [{"body": "\"Wall street prudent investments\"", "score": 20, "replies": []}, {"body": "Haven't been browsing here lately. So yeah kinda forgot how people are here.", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "honestly I'm looking to get long SWHC, just waiting to see how far it's going to drop. It got down to around 9.00 2 years. may just short it for now ", "score": 3, "replies": [{"body": "There is a price that it's a good value at, much more sustainable long term business prospects now.", "score": 2, "replies": []}]}, {"body": "hpa?", "score": 2, "replies": [{"body": "Hearing Protection Act", "score": 1, "replies": [{"body": "what the hell is that all about", "score": 1, "replies": [{"body": "It's a House bill that will de-register suppressors as NFA items. Currently, buying a suppressor requires a tax stamp and a long wait and paperwork. It's a hassle. The revision will put suppressors on the same level as firearms themselves, a background check and purchase from a FFL. No more stamps, waiting or excessive paperwork.\n\nThink about it, suddenly every gun owner can easily and legally purchase a suppressor. Most will want at least one. That's a huge industry waiting to happen.", "score": 1, "replies": [{"body": "ah ok. I've been wanting a suppressor but don't want to pay the bullshit stamp fee. hope it passes", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I was going to do a straddle yesterday on NVDA but thought the premium was too high so backed off.  Kicking myself today.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Can you explain what your play was? I'm still learning options ", "score": 1, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Obama announced that he's giving everyone their guns back before he leaves office so demand has been reduced.", "score": 1, "replies": []}, {"body": "[removed]", "score": -3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "From what I understand, gun restriction announcements/events are good for firearm stocks because people stock up whe  they think theres restrictions coming.", "score": 3, "replies": []}, {"body": "One of Trump's choices for his cabinet or admin. includes some small time sheriff who literally wants the government to take guns from liberals and blacks so they can't kill cops. \n\nNot a joke, the guy is black too and married to a white woman. It's like the civil rights era never existed and it was black people calling women like his wife n*gger lovers back in the day.\n\nAs an aside people don't buy guns to use silencers they buy guns to buy guns, silencers being legal isn't exactly making new customers for more guns", "score": 3, "replies": []}]}]}]}]}, {"body": "Pleasure doing business with ya.", "score": 0, "replies": [{"body": "FUck that, but post some proof", "score": 1, "replies": []}]}]}, {"body": "fuckin A", "score": 3, "replies": [{"body": "M D", "score": 10, "replies": []}]}, {"body": "Short NVDA now that it's up", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I'm second in line.", "score": 1, "replies": []}]}]}, {"body": "I reckon it's close to time to buy some SWHC and RGR", "score": 2, "replies": []}, {"body": "Me and ATVI.", "score": 2, "replies": []}, {"body": "I made about $300 off SWHC (sold before it started to drop after buying in at $20) and $4000 off NVDA, if I'd held NVDA instead of selling off last month I've have made about $12,000 from today's jump.  I hate myself right about now...", "score": 2, "replies": []}, {"body": "Or -5% on ECA :/", "score": 1, "replies": []}, {"body": "I bought calls a couple of weeks ago that were up over 100% on election day.  They are basically worthless now.  Fuck these incompetent pollsters.", "score": 1, "replies": [{"body": "Get caught in IV crush?", "score": 1, "replies": [{"body": "What volatility?", "score": 1, "replies": []}]}]}, {"body": "and down 25% on JNUG", "score": 1, "replies": [{"body": "Why the fuck did you not sell on post Election Day market open?", "score": 2, "replies": []}]}, {"body": "I'm down 25% let's celebrate", "score": 1, "replies": []}, {"body": "Averaging down as we speak. Sigh", "score": 1, "replies": [{"body": "Was about to average down on RGR but will wait a few days to reconsider, if it doesn t goes back to 50 on a bounce next week it is fucked and going toward 35/40 (IMHO)", "score": 1, "replies": [{"body": "Watching the volume is pretty helpful in situations like this. ", "score": 1, "replies": [{"body": "What's your opinion what do you see?", "score": 2, "replies": [{"body": "I just don't like to buy into a lot volume compared to the past or average. Let it settle down first. ", "score": 1, "replies": []}]}]}]}]}, {"body": "And Im losing money still on AMD", "score": 1, "replies": [{"body": "how? there have been so many good swings. Are you just holding from a 7+ position?", "score": 3, "replies": [{"body": "Yeah 7.20\n \n \nLel", "score": 1, "replies": []}, {"body": "It was a joke, people here loves to make fun of AMD.", "score": -1, "replies": []}]}]}, {"body": "Minus 25% $RGR checking in.  At least I own it in my Roth IRA so I can deduct capital los.... oh wait...  fuck.", "score": 1, "replies": []}, {"body": "Dont feel bad. While everyone was making bank I lost a third of my stock money on jnug.", "score": 1, "replies": [{"body": "time to switch to JDST and lose another third. On the upside, a third of your account now is only ~a fifth of your account yesterday, so it's not as bad right? /s", "score": 1, "replies": []}]}, {"body": "I feel the same way with jnug", "score": 1, "replies": []}, {"body": "LOL THIS IS ME RN ON BIOTECHS FUCK NVDA AND THERE 1080 BLESSED BEAUTY (buys a 1080 on newegg from JNUG profits) ", "score": 1, "replies": []}, {"body": "why did it jump so high in one day? i've been holding it since it was $42 and stopped looking at my pleb RH account because of a certain pharma going down to 11 cents from .50 but now a $47 increase on each share is nice", "score": 1, "replies": []}, {"body": "How about deciding to buy either CXR or CGC and buying CXR instead last April.  I hate my life.", "score": 1, "replies": []}, {"body": "why did it jump so much", "score": 1, "replies": []}, {"body": "[When you thought all is over after you lost 16% on SWHC but made it up with a 30% gain on NVDA](http://funnypictures2.fjcdn.com/thumbnails/comments/I+seriously+thought+he+was+gonna+die+_f7de38f7db018f2d09bce98a50886523.gif)", "score": 1, "replies": []}, {"body": "I don't get it, gun regulation is now null, gun manufactures should rejoice, they can now continue to produce, stocks should go up. If Hillary won, SWHC would have gone down cause of regulated production. Trump wins, gold goes DOWN? NONE OF THIS MAKES SENSE!", "score": 1, "replies": [{"body": "Did you miss that a few states passed gun restrictions? ", "score": 2, "replies": [{"body": "Why, yes I have", "score": 1, "replies": []}]}]}]}
