{"title": "Passive investing bubble brought to you in part by ETF’s", "selftext": "[deleted]", "id": "1anzzma", "created_utc": 1707627539.0, "score": 97, "upvote_ratio": 0.78, "num_comments": 61, "comments": [{"body": "It’s an interesting thought. I can follow the idea that Blackrock and the other firms just keep pouring money in the same stocks whenever more investors buy there etf. As opposed to the investors doing their own due diligence on an individual stock and thereby setting the price.", "score": 45, "replies": [{"body": "Thank you, that’s basically the idea. Look at SMCI as an example of this for illustration. It was added to the Russell 2000 and several ETF’s in a rather large weight. Given that SMCI has a relatively small float the money flowing into these etfs containing SMCI led to an absolutely mental push.\nGiven all that’s required when it comes to due diligence, and diversifying a portfolio I can’t say I blame people for buying ETF’s. It’s very costly to build a portfolio that’s properly diversified.", "score": 12, "replies": []}, {"body": "For their funds that track an index, they must buy those stocks if the stock's weighting increases. It's a bit of a positive feedback loop, but at the end of the day the company's fundamentals will determine its value.", "score": 5, "replies": []}, {"body": "*Trading* sets prices, and index funds still only comprise a whopping 5% of all trading.", "score": 2, "replies": []}]}, {"body": "\"I would also hypothesize that more young people are turning to the markets to get ahead more than ever. Let’s face it, the rich housing markets seem out of reach for a lot of people these days. Higher interest rates perpetuate this further. I would be curious to know how many of you also see the equity markets as your means to get ahead in the midst of unaffordable real estate.\"\n\nI'm not sure about the real estate angle, but I think your general hypothesis is sound. I also think that apps and various companies selling stocks direct has made more people buy direct, and buy into the same stocks and ETFs.\n\nPersonally, I've moved more into a global ETF, more into emerging markets, individual stocks. S&P 500 generally feels overheated.", "score": 13, "replies": [{"body": "Thanks for the feedback on that, maybe I’m relying too heavily on local anecdotes. In particular areas of Canada property prices are bonkers, but I guess there are always opportunities elsewhere. Saskatchewan real estate is like 10-20% of the cost. \n\nI agree with you on the benefit of taking a more global approach. There can be negative carry risks when it comes to foreign currency. However, in economic expansions emerging markets generally outperform developed economies, but they also underperform in contractions. So in theory you get better dip buys when the dust settles, and a bigger run. I think Indian and Mexican equity markets have some potential with geopolitical tensions and friend-shoring. The peso has seen quite the run as US companies set up manufacturing that was previously overseas. India like a good candidate to pick up some of Chinas manufacturing business.", "score": 2, "replies": []}]}, {"body": "This is just saying the overall market is overvalued. There are thousands of ETFs and a correction within ETFs is a macro-level market correction.  If you take the S&P500 as an example this is just a large ETF of the top 500 stocks. If it crashes it means the whole market crashes.  This isn't that surprising. Markets do crash and they also recover.  There have been several 30%+ market crashes and there will certainly be more in the future.  Very hard to predict, ETFs aren't new so there's no reason it would crash now vs later.", "score": 33, "replies": [{"body": "That’s fair, yes there are many ETF’s. A lot of them seem to invest in mostly the same group of companies. They aren’t new, but investing in ETF’s has been popularized much more lately. ETF’s became somewhat mainstream around 2010, it takes some time before the effects are apparent. FI’s began using CDO’s to bundle mortgage backed securities around 2002. That took a while to play out as well. Initially it was probably creating a net benefit to the system, until they ran out of mortgages.", "score": 8, "replies": [{"body": "CDO’s are not bad by themselves but once greed took over and banks started to bundling shitty mortgage into them and still get AAA rating this was beginning of the end. \n\nSource: Big short.", "score": 9, "replies": []}]}, {"body": "[deleted]", "score": -6, "replies": [{"body": "''and will probably happen in 2024/2025''\n\nI am curious what makes you say that? The stock market has been flying upwards, rather than melting downwards the past few months. So why would the government need to stimulate it?\n\nAre you expecting a huge drop later this year, and if so why?", "score": 6, "replies": [{"body": "Would like to hear it too.", "score": 3, "replies": []}]}, {"body": "It went well until crypto. There is no reason the gov or the market makers couldn't rig crypto the same way. Actually crypto is working exactly as you describe the stocks already - solely upon demand without any intrinsic value ...", "score": 2, "replies": []}, {"body": "You had me until crypto", "score": 2, "replies": []}]}]}, {"body": "I’ve seen an increasing amount of smart money opt for ETFs or passive investments, particularly indices like SPY, because it’s cheaper than mutual funds or active investments. This is anecdotal but aligns with OPs hypothesis. \n\nSo here’s the real question: what’s the play?", "score": 10, "replies": [{"body": "Buy good businesses not overly represented in common funds. If there is a collapse you should be minimally exposed. If no crash then you still own a good business", "score": 5, "replies": []}, {"body": "As usual, buy stocks thought to be underpriced relative to their fundamentals, and cross-reference those with the pool that would be comparatively less represented in popular index funds. The result: small cap value stocks.", "score": 2, "replies": []}, {"body": "Very good point, the management fees on mutual funds are a rip off. My last job involved selling them, but I could never get comfortable with it. The sales reps are like realtors and only train on overcoming objections. \nI did feel good about getting some of my clients temporarily into fixed income funds when the 30Yr touched 5.1%. \n\nWhat’s the play? I just formulated this idea yesterday, so I’m still thinking. One strategy I’m considering is to look through ETF prospectuses for weightings that seem unusual or suspect. Analyze the individual stock data for volume correlations with the ETF’s, look through SEC filings for 5%+ ownership disclosures by big players, and any other data that could help you locate bloat. Especially look for stocks with particularly small floats that have a material weighting in popular ETF’s. \n\nThen again I suppose it comes down to your risk tolerance. Some are not comfortable with shorting, perhaps for good reason. It can be a good way to blow up your account.\n\nIf there is bloat in one area, and the stock market contains a finite amount of capital it should follow that there are relatively undervalued stocks that are not receiving enough attention. (This also assumes that total capital remains constant, which would need to be factored for). \nMy concern here would be that markets typically move together. If the market takes a turn for the worse and capital exits then value stocks could sell off as well. If the market does sell off you’ll still be in a lot better position than if you were in bloat. It’s possible that money shifts from bloat into value, or simply exits the system. \nI would say money markets or HISA’s are a good play for now. 5.33%/ year is not a bad return. Find some stocks with solid books and keep an eye on them. Buffet’s sitting on a lot of cash and cash equivalents right now.\n\n\nIf you feel comfortable shorting, and you’re confident in your research abilities I would go short through options for 3 reasons. (be mindful of theta decay, and volatility levels)\n\n1) Losses are limited to the premiums paid and volatility is quite low right now 2) No borrowing of shares, your broker can’t close your position if the shares become unavailable to borrow further. \n3) there are many types of bearish options positions, you can manage your risk this way.\n\nSorry if my ideas seem somewhat scattered, I’m trying to make sense of an approach right now as well.", "score": 1, "replies": [{"body": "Sometimes the play is not to play.  \nWait stack cash and patiently look for a good opportunity.", "score": 2, "replies": []}]}]}, {"body": ">Here’s an example: why are AMD and NVIDIA almost equally weighted in the SOXX ETF given that NVIDIA is roughly 6x the size of AMD? They should be weighted proportional to their market caps.\n\nSOXX doesn't claim to be market cap weighted. Their stated goal is : \"The iShares Semiconductor ETF seeks to track the investment results of an index composed of U.S.-listed equities in the semiconductor sector.\"\n\nCRE is often cited as a catalyst for a meltdown. One take I've seen however is that very few crises are forecast to be coming for years. We've known about CRE problems for 2-3 years now. There has been a lot of time to prepare. I'm not saying the problem has gone away, but it's harder to see it shock the economy into a selloff. For comparison, residential housing wasn't broadly looked on as a potential catastrophy in 2006-7.", "score": 14, "replies": [{"body": "I don’t see how OP’s observation plays out in a consistent, snowballing, unidirectional way.  For this example, another large ETF might overweight NVDA.", "score": 2, "replies": []}, {"body": "I read the SOXX prospectus yesterday and they claim to be “modified market cap weighted”. I would appreciate it if you could find me the index that they seek to track?  \nThe closest thing that I could see is the Philly semi index (SOX). If they are trying to track this index then they’re doing a piss poor job at it.\n\nRegardless of this as I’ve said before I think there are 2 components to this problem. Actively managed ETF’s overweighting particular companies, and passively managed ETF’s containing a larger portion of said company as a result.", "score": 1, "replies": [{"body": "Oh, I have no idea what index they follow. I lifted that description from their prospectus. It's one reason I avoid most funds, I'd rather just buy my own stuff. \n\nI do think indexing makes price discovery harder. As far as funds chasing winners....that's what most funds do. It why it's not always bad to look where no one else wants to be, yet. \n\nI don't know how indexing would lead to a crash though. More likely you'll see the biggest names.have lesser performance, while other names start to perform. Then there will be a movement in funds to chase those returns. Repeat.", "score": 1, "replies": []}]}]}, {"body": "There is a video by Ben Felix about the index fund bubble in YouTube (can't share YouTube links here). There is another about the index fund tipping point too.\n\nIt quotes several papers, it is not a completely new fear", "score": 8, "replies": [{"body": "So when is the estimated crash?", "score": 0, "replies": [{"body": "There isn't", "score": 4, "replies": []}]}, {"body": "I’ll check it out, thanks for sharing! I would love to find some quality research on this", "score": 1, "replies": [{"body": "The long and short of it is that it's not the amount of money in an investment that determines the price, it's the last traded price. And even though a lot of money is going into passive funds, trading is still overwhelmingly done by active investors, so the price is still overwhelmingly set as if the market is a bunch of active investors. Ex: on Friday a ton of money flows into VOO because of 401k contributions, so price goes up $1, 10 seconds later 4000 active investors have bought and sold the indexed securities bringing the price to the level the active investors think is appropriate.", "score": 3, "replies": []}]}]}, {"body": "People are free to buy whatever stocks they wish. the allocations of the ETFs are public information.", "score": 6, "replies": []}, {"body": "I suspect passive investing only works when it is a minority in the overall market (which is always what it used to be). Active investors serve to keep the market honest. Since passive is now a majority in the market, I wonder whether it will become like a dog chasing its own tail because who is driving price discovery if everyone is passive? It could be the next financial crisis.", "score": 9, "replies": []}, {"body": "I support this idea. Also, 401ks are everywhere now. That’s channeling more passive money into the market. There is another result besides the one you are saying….the winners will keep winning.  The Mag 6 will get a disproportionate share of the passive income because they become a larger and larger percentage of the S&P or QQQ , which ever ETF you are in.", "score": 14, "replies": [{"body": "The winners keep winning until they don’t.\n\nSee Nifty Fifty.", "score": 14, "replies": [{"body": "yep it's like the Tesla correction that is occurring just now", "score": 5, "replies": []}]}, {"body": "The winners will keep winning… except you just called it Mag 6 because one of the 7 stopped winning ", "score": 4, "replies": []}, {"body": "Everyone focuses on 401ks, but also keep in mind that it's not just Americans auto-buying. I work with people from other countries and all their retirement portfolios are in spy.\n\nIt's become the entire world's retirement, not just Americans.", "score": 12, "replies": []}]}, {"body": "Just curious…what’s the link in your discussion between ETFs and the bad loans?", "score": 8, "replies": [{"body": "One version of this is that because of indexed products large companies get access to more equity financing regardless of their business practices. Instead of looking at cashflow or other types of business health metrics they get more financing because of how big they already are.", "score": 11, "replies": [{"body": "Exactly! Very well said. It seems like I didn’t explain my idea very well. I also believe that the initial overweighting of certain companies in actively managed ETF’s results in these companies forming a larger portion of the index. Then the passive ETF’s start buying them up in larger volumes. Seems like a snowball effect.", "score": 4, "replies": []}]}, {"body": "The integration of new financial products,  and how they can materially alter market conditions in unforeseen ways. CDO’s led to the eventual real estate collapse by encouraging financial institutions to over lever. ETF’s are framed as a the safe choice to invest in for the average person. I’m not directly linking the ideas of bad loans and ETF’s.", "score": 7, "replies": [{"body": "I see your point…encouraging poor decisions", "score": 3, "replies": []}]}]}, {"body": "Michael Burry was sounding the alarm on passive investing back in 2018.\n\nIt does distort actual price discovery when billions are flowing into the highest market cap stocks every two weeks, regardless of what the underlying business is or isn't doing.", "score": 5, "replies": [{"body": "Its a totally meaningless revelation and its obvious. There is always a market maker distorting things in a way someone doesn't like. In other countries it might be the government or some oligarchs. I prefer our way.", "score": 0, "replies": []}]}, {"body": ">I would also hypothesize that more young people are turning to the markets to get ahead more than ever. Let’s face it, the rich housing markets seem out of reach for a lot of people these days. Higher interest rates perpetuate this further. I would be curious to know how many of you also see the equity markets as your means to get ahead in the midst of unaffordable real estate.\n\nI have seen some posters on the reddit Investing and WallStreetbets stating that was what they were doing.\n\nAnd not just stocks, but also probably crypto, gold and other \"alternative\" investments.\n\nI think this even plays a role in \"live service\" video games and microtransactions in general.\n\nPeople who can't afford housing or don't want to go into debt for 30 years to do so redirect their money into other investments or markets.", "score": 2, "replies": []}, {"body": "ETFs is a hidden market maker.\nBut again there will always be market makers.\nYou cant stop ppl on top from controlling things to their advantage.\n(Honor mention to Nancy’s last NVDA deep in the money options making more than 1 million $ in less than 3 months)", "score": 2, "replies": []}, {"body": "This is very interesting, and I think you’re right. The amount invested is proportional to people investing, not value created/held by the individual stocks.", "score": 3, "replies": []}, {"body": "You are seeing ai feed itself.  The ai is performing a few key functions and it knows how to give itself more resources.  Lines are not entirely human at this point.", "score": 3, "replies": []}, {"body": "Are you basically saying that ETFs lag in responsiveness to the market? That due to the way they are implemented, they don't adapt fast enough? And end up dragging their investors, and the whole market, behind them by firmly sitting on their picks?\n\nIf so, that's a very interesting idea. I guess the question becomes are they benefiting the market more by bringing in more aggregated investor dollars than they are holding the market as a whole back.\n\nAnd that could depend on at what stage the market is at.\n\nBringing in passive investors is a huge prop to the market. But as information and access to trading becomes more accessible, investors would presumably become more expert at picking their own stocks, and it would become clear that the ETFs are not the most responsive choice.\n\nI may have misunderstood your point, however.\n\nI also agree about the real estate thing.", "score": 1, "replies": []}, {"body": "If there is a bubble in passive index funds, then active traders will notice the price imbalance and arbitrage the difference away. I'm not worried.", "score": 1, "replies": []}, {"body": "Solid post OP, and an interesting hypothesis. But I would think there are multiples upon multiples more AUM in ‘traditionally weighted’ ETFs than modified. A few hundred billion is a drop in the bucket compared to 10’s of trillions in the overall market.\n\nThat said, yes I do view investing as the path to build wealth; but I focused on exponentially increasing my income for the first 12 years of working. That is the main driver of building wealth - investing allows you to scale that wealth.", "score": 1, "replies": []}, {"body": "I think etf bubble is real\n\nreason it doesnt pop is because governments are enabling it\n\nif bubble last forever, is it really bubble?\n\nI really fking hate this bubble\n\nbut one wise man on the reddit told me\n\n\"If you have determined that the government is manipulating the stock market , wouldn’t you want to be a part of it that you also can grow your money?\"\n\nsame goes for etf bubble. if you know there is etf bubble, dont go against it. join it. make moneys out of other stupid people\n\none man cannot fight thousand monkeys\n\nif you can't beat em, join em\n\nwise man do not fight with idiots. use monkeys to make money out of it\n\nthere is just too much retirement saving tied to stock market. government can't stop the ponzi scheme going forever\n\nwhen politicians are given RIGHT but difficult answer vs Wrong but easy answer\n\nthey will always choose the wrong easy answer\n\n\"I’m fairly convinced that we’re going to see a meltdown.\"\n\nhaha ur comment  just shows u r just inexperienced\n\nI once thought like u. \"bubble will pop one day and they cant let ponzi scheme going forever\"\n\nI was wrong\n\nthey will last much longer than u can ever imagine and it'll outlive ur life\n\njust look at japanese government bond for example\n\njapan held minus interest rate for 10yr+\n\njapan still have minus or 0% interest rate when usa bond pays out 5% interest rate\n\nif it was 'normal' unmanipulated market, japanese bond would have crashed\n\nand no other countries could have sustained lower interest rate than usa bond\n\nreality? : nothing happens. who bet against it r long broke\n\njust look at governments bonds around the world\n\nit's extremely rate to find gov bonds with interest rate higher than usa's which is crazy because usa gov bond is the #1.\n\nit's like ppl r willing to pay more money to buy trash asset (non usa government bond) vs good+better one\n\nin sane market without any manipulations such thing cant exist\n\nthing is governments OWNS bond, currency, interest rate. which is like founding pillars of financial market. with those 3 economic nuclear weapon, they can manipulate any financial asset at their will\n\nonly exception is if the country is in hostile state with western countries because western countries own majority of financial assets\n\nlook at chinese stock market. fking crashed mean while all the stock markets r hitting all time high\n\nlet me give u word of advice.\n\nif u keep thinking like inexperienced stupid shit and keep fighting with the monkeys, u'll be soon be flipping burgers at wendies and stupid fking monkeys will be ur boss\n\nbelieve in bubble n the monkeys will be working for u and u will become rich\n\nthose who r optimistic and believe in bubble will have great chance of becoming rich\n\nthose who r skeptical and doesn't believe in bubble will be forever miserable\n\nthat's the way it is in the market", "score": -6, "replies": []}, {"body": "The exit is the same size but the room gets bigger", "score": 1, "replies": []}, {"body": "OP, what is the scenario under which this bubble would pop?  Any theories?", "score": 1, "replies": []}, {"body": "So what's everyone's thoughts on funds like VIG or VYM? Would the requirements of increasing and steady dividends aka profitable companies take some of the speculative bubble out?", "score": 1, "replies": []}, {"body": "I was pretty much with you until you said it was hard to convert office to residential. It’s nit that hard. This buildings compete very well in the market with the inherent advantages of central locations and being designed for younger, well-heeled occupants.", "score": 1, "replies": []}, {"body": "I'm sure there are outliers as examples, but in aggregate, the simple fact is trading sets prices, and index funds still only comprise a whopping 5% of all trading.\n\nRichard of The Plain Bagel put out a good video recently on some of what you describe. I tried linking it but it got auto-removed. I'm sure you can find it easily.", "score": 1, "replies": []}, {"body": "I've been curious about these risks too. It seems the way the system is set up that money will continue to pile into a very small group of stocks regardless of whether it's a good value. Mag 7 with 800 PE ratios, won't matter because the system will just keep funneling money into them.", "score": 1, "replies": []}]}
{"title": "Boycott Tesla’ ads to air during Super Bowl", "selftext": "", "id": "1aolg3r", "created_utc": 1707693091.0, "score": 49, "upvote_ratio": 0.66, "num_comments": 46, "comments": [{"body": ">O’Dowd’s group said the ads are airing in D.C., California, Delaware and Michigan.\n\nLocal super bowl ads, not national. They are a fraction of the cost and he has been doing this for the past few years. He buys a few cheap local ads and gets 100x the value because the media gives him exposure since they are \"super bowl ads\" and about Tesla.\n\nPretty clever IMO. Tesla should be doing this. Make a big deal about running their first ad campaign during the superbowl, buy a few local ad slots, and let the media do the rest for you.", "score": 83, "replies": [{"body": "This only works if you’re in line with mainstream media.\n\nThe news headlines would be “Tesla can’t afford Super Bowl ads”", "score": 60, "replies": []}, {"body": "That explains why I didn’t see it.", "score": 1, "replies": []}, {"body": "Tesla is running ads on Xitter, next to crypto scams, Only Fans, and Nazi Klans 🤣", "score": -19, "replies": [{"body": "Prove it", "score": 6, "replies": [{"body": "Idk if that’s literal but it’s dirty and stupid that they advertise on Twitter. It’s the smallest platform. It’s roi is pathetic compared to Facebook of google. And musk gets to rob us shareholders to pay for his money furnace", "score": -12, "replies": [{"body": "And the glass house! Don't forget about the glass house!", "score": 5, "replies": []}]}]}]}]}, {"body": "So, instead of buying ad time for Mobileye and promoting his investment and the technology he believes in, he wastes money telling people to boycott a company he doesn't like. Only about half of Tesla's sales come from the US, so most of the world's consumers do not give a crap about the Superbowl. So what exactly is he accomplishing?", "score": 44, "replies": [{"body": "Imagine being that butt hurt over a client turning into a competitor because you were that shit to work with.", "score": 18, "replies": []}, {"body": ">his investment and the technology he believes in\n\nI think we can all tell he doesn't", "score": 5, "replies": []}]}, {"body": "Dude funding the ads owns a company that builds software for vehicles, shocker.", "score": 25, "replies": [{"body": "Software that he claims goes into vehicles of nearly every brand, though there's one company that's never given him a dime... care to guess which one?", "score": 2, "replies": []}]}, {"body": "Will probably drive more traffic than it diverts.", "score": 19, "replies": [{"body": "Also it's mostly for US ground. Europe or Asia will have no idea about this", "score": 1, "replies": []}]}, {"body": "Loser", "score": 10, "replies": []}, {"body": "Free ad for Tesla", "score": 13, "replies": [{"body": "It discourages sales", "score": -4, "replies": [{"body": "Disagree", "score": 7, "replies": [{"body": "How? Most people are just going to see an ad critical of Tesla and that’s it. Why would they automatically assume fud when it’s all they hear", "score": -1, "replies": [{"body": "The critical ad can inadvertently draw more attention to Tesla, keeping the brand in the public conversation and potentially increasing interest and awareness. Criticism can emphasize Tesla's unique selling propositions. By critiquing the brand, the ad may inadvertently remind viewers of Tesla's role as a pioneer in electric vehicles and sustainable technology. The fact that Tesla is deemed significant enough to be criticized in a Super Bowl ad reinforces its position as a market leader. Competitors typically target the top players, so such criticism could be seen as a validation of Tesla's dominance in the electric vehicle market. Tesla's lack of presence in the Super Bowl advertising space differentiates the brand as one that does not follow the traditional marketing playbook. This can reinforce Tesla's image as an unconventional, disruptive company.", "score": 1, "replies": [{"body": "I think you greatly overestimate the intelligence of the average viewer", "score": 4, "replies": [{"body": "I have hope for humanity under the guidance of our God Elon\n\nRejoice brother!", "score": -2, "replies": []}]}, {"body": "Kinda like ads that say \"Our product is better than X!\".  It only drives consumers to investigate X's product!", "score": 0, "replies": []}]}]}]}, {"body": "Lmao there’s no such thing as bad publicity.", "score": 2, "replies": [{"body": "And yet Tesla keeps cutting prices", "score": 1, "replies": [{"body": "Not because of the anti Tesla adds lmaoo", "score": 2, "replies": []}]}]}, {"body": "It doesn't discourage sales. It discourages drivers from operating their vehicles in the safest possible method. That's not a win for anyone.", "score": 1, "replies": []}]}]}, {"body": "Dan O’Dowd’s Green Hills Software has no OTA update capability!  How will he fix all the vulnerabilities in his RTOS deployments?\n\nhttps://github.com/AlixAbbasi/GHS-Bugs", "score": 5, "replies": [{"body": "Ha! That's amazing!", "score": 1, "replies": []}]}, {"body": "Ofc it's this fucking clown.", "score": 5, "replies": []}, {"body": "Fuck that old dude!\nWhat has he ever done for the world?", "score": 9, "replies": [{"body": "Exhibit his tiny penis?", "score": 1, "replies": []}]}, {"body": "!! ... Concerning! 🤣", "score": 2, "replies": []}, {"body": "Tesla should really do some serious advertising. The game has changed, there’s massive EV competition. Missed opportunity not doing a cyber truck x model 3 highland commercial at Super Bowl. \n\nThis BMW EV commercial with Christopher Walken is awesome 👏\n\nhttps://youtu.be/sfB-glrgn5o?si=XDXhrTycJSthp39G", "score": 1, "replies": [{"body": "Cybertruck and Model 3 don't need advertising. The only vehicle with massive capacity to ramp on a moment's notice is Model Y.", "score": 1, "replies": [{"body": "You advertise the Cyber Truck for Tesla brand awareness. \n\nYou advertise the new model 3 so a potential customer preorders that instead of the competition. You really think that everyone knows there’s a refreshed model 3 coming out ?\n\nYou advertise to generate potential customers   \n\nLook up Gary Blacks’s tweet about the cost of a Super Bowl ad  vs Elons tweet over the weekend about a model y 1k price cut.", "score": 2, "replies": []}]}]}, {"body": "Stock will go up!  This is why Tesla doesn’t need to advertise- others do it for them.", "score": 1, "replies": []}, {"body": "Irrelevant", "score": 1, "replies": []}, {"body": "Hate press worked to keep Donald J. relevant, so it may work for Tesla.", "score": -1, "replies": []}, {"body": "OP probably doesn't even hold Tesla shares, he likes only to divide people and spread hate", "score": -4, "replies": [{"body": "xxx holder since 2018, and love the stock + Musk.. Sharing info to the sub I come across. What are you doing?", "score": 1, "replies": []}]}, {"body": "I didn’t even see the add on Paramount+. Based in CA.", "score": 1, "replies": []}, {"body": "This clown again huh..", "score": 1, "replies": []}, {"body": "Love it. “FSD” is false advertising and should be banned from the road", "score": 1, "replies": []}]}
{"title": "Should I sell and try to capitalize……", "selftext": "Should I sell some of my positions and try to use option to capitalize off some of the short term speculation that should be driving the markets upward for the next two weeks like NVDA crossing 1000, PTLR , META or should I sit tight and wait for correction", "id": "1anw1li", "created_utc": 1707614743.0, "score": 27, "upvote_ratio": 0.84, "num_comments": 42, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|3 years ago\n**Total Comments**|17|**Previous Best DD**|\n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "\"If it's good enough to screenshot, it's good enough to sell.\"\n\nI'd personally sell the tech, it's been a massive run that always corrects but that's my personal opinion therefore it'll go to the moon.\n\nBuy some recession proof stocks and sell contracts on them is my personal approach right now. Very WSB of me I know.", "score": 23, "replies": []}, {"body": "everything but NVDA..", "score": 3, "replies": [{"body": "Nd tesla", "score": 0, "replies": []}]}, {"body": "https://preview.redd.it/fi3warwt0vhc1.jpeg?width=1290&format=pjpg&auto=webp&s=157520d16af773d0991439bb1c9a61868c687d36\n\nAlso so you guys can get an idea of my standing in each position", "score": 4, "replies": [{"body": "Nah just sit tight bub. If you want to swap some risk for other stocks then go ahead tho.", "score": 5, "replies": [{"body": "Yeah I think I’ll just sit tight and maybe sell that spy call and throw it on DKING before earning to have some fun", "score": 3, "replies": []}]}]}, {"body": "Keep CRWD until just before earnings. I own the stock. I don’t understand why but it keeps going up and up. Only a reality check like earnings could make it go down", "score": 2, "replies": [{"body": "They have amazing financials bro they’re free cash flow is crazy", "score": 1, "replies": [{"body": "They are not profitable yet. I bought in with the 35% revenue growth a year and they are near break-even so EPS can soar. Stock is getting pretty expensive though, I wasn’t expecting +180% in less than 1 year 😂", "score": 1, "replies": [{"body": "You’re right I was thinking about FIX another stock in my portfolio but yeah they are just about profitable. I think some of it may go hand and hand with the Ai boom that’s going on rn", "score": 1, "replies": []}]}]}]}, {"body": "Sell all and invest in shady options based on mongolian goat breeders", "score": 2, "replies": []}, {"body": "Don't sell META. Keep it for some time. It will go up even more. My long term PT is 650+ based on just charts. Only if you can hold for 1-2 years.", "score": 5, "replies": [{"body": "Thank you I was thinking the same", "score": 3, "replies": []}]}, {"body": "I'm trying to get regarded in here! \n\nWhen will robinhood let me go into massive debt? I opened the account a week ago", "score": 1, "replies": [{"body": "lol huh ? Me ?", "score": 1, "replies": [{"body": "Me man me. 👨", "score": 3, "replies": [{"body": "lol buy NVDA puts 😉", "score": 3, "replies": [{"body": "I can't buy shit. Robinhood won't let.me. \n\nYou only YOLO once.", "score": 1, "replies": [{"body": "How’d you manage to do that", "score": 1, "replies": [{"body": "Opened account last week.\nGo to buy options and it says fuck you. Idk", "score": 1, "replies": [{"body": "Oh you need level 2 trading you gotta go into your settings and enable option’s trading", "score": 1, "replies": [{"body": "https://preview.redd.it/s47q1yvi4vhc1.png?width=1275&format=png&auto=webp&s=57f9380cdca2a681f13b9dd078ff6b59ba70e155", "score": 2, "replies": [{"body": "https://preview.redd.it/11azwice8vhc1.jpeg?width=1080&format=pjpg&auto=webp&s=29064dd05cc8cbbb4a32082cf753c2c85757c48a", "score": 1, "replies": [{"body": "Follow the directions my boy", "score": 3, "replies": [{"body": "I did 😢. Still says the same shit. Wtf am I supposed to do with this refund money", "score": 1, "replies": []}, {"body": "Shit. Full fucken regard. 😤 . Finished profile but still no lol. It's a vicious cycle. I didn't deposit $$ because no options to YOLO and I can't options because no $$$.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "You bet against meta?", "score": 1, "replies": [{"body": "Against? What are you talking about bro", "score": 1, "replies": [{"body": "Oh why are you down I don't know what that is but it says down", "score": 1, "replies": [{"body": "I’m not down", "score": 1, "replies": [{"body": "I bought at 354$", "score": 1, "replies": [{"body": "What ami missing then", "score": 1, "replies": [{"body": "lol shit I have no idea bro. That’s my equity in that screen shot", "score": 1, "replies": [{"body": "https://preview.redd.it/0kfvctk5kzhc1.jpeg?width=1290&format=pjpg&auto=webp&s=a1ef1550bf3434b074db6b968c62411806447b0e", "score": 1, "replies": [{"body": "This is profit", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "ABC", "score": 1, "replies": [{"body": "What ?", "score": 1, "replies": [{"body": "the ABC", "score": 1, "replies": []}]}]}, {"body": "Yes. Why haven’t you?  Longer you wait…", "score": 1, "replies": []}]}
{"title": "NVDA Regardation", "selftext": "[deleted]", "id": "1aoejfn", "created_utc": 1707675538.0, "score": 101, "upvote_ratio": 0.93, "num_comments": 45, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|2 weeks ago\n**Total Comments**|279|**Previous Best DD**|\n**Account Age**|2 weeks|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "I would sell 1 and keep 2 for a ride", "score": 31, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|33495)", "score": 1, "replies": [{"body": "What!? Stonks only go up.", "score": 0, "replies": [{"body": "![img](emote|t5_2th52|29637)", "score": 3, "replies": []}]}]}]}]}]}, {"body": "And here I was going to say he should buy three more. ![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}, {"body": "All or nothing babyyyy![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882)\n\nIn jensens jacket we trust", "score": 16, "replies": [{"body": "Calls on that damn thing all day ![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882)", "score": 3, "replies": [{"body": "This sub needs a Jensen emoji....![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}]}, {"body": "Sell 2 before earnings. Hang onto one. Good or bad, after earnings, it's going to dip at the very least. It always seems to.", "score": 7, "replies": []}, {"body": "NVIDIOTS UNITE! ![img](emote|t5_2th52|8882)![img](emote|t5_2th52|29637)", "score": 6, "replies": []}, {"body": "Man you’re up 162ish%  lmao sell", "score": 20, "replies": [{"body": "I don’t see it not running up to earnings at least ![img](emote|t5_2th52|8883)", "score": 12, "replies": [{"body": "Ok\n\nhttps://preview.redd.it/00npbmssi0ic1.jpeg?width=500&format=pjpg&auto=webp&s=3a6e39a5700e8ea36682117548bc33a595a92b89", "score": 6, "replies": []}]}, {"body": "Don’t do what this poor person tells you", "score": 2, "replies": [{"body": "😂😂😂😂", "score": 1, "replies": []}]}]}, {"body": "I say ride all 3 out, the people who have enough shares to do anything won’t until market close at earnings. 💎💎", "score": 4, "replies": [{"body": "Problem is they release after the bell so those share whales could offload before I have a chance to sell the contracts", "score": 1, "replies": []}]}, {"body": "Really dumb question here but if the \"break-even price\" is $737.50, how are you making that much profit even though the current price is 721.31?", "score": 4, "replies": [{"body": "Because the expiration is 3/8 and the price went up a lot since he bought it, so there's extrinsic value due to volatility and theta. The breakeven is at expiration, when there is no more extrinsic value, and the value is 100% due to the stock price. There's still 4 weeks left, and it's a super volatile stock.", "score": 12, "replies": [{"body": "That was explained beautifully, thank you!", "score": 4, "replies": []}, {"body": "I have been researching theta and time value to death for so long trying to really get a grasp on it. You explained it so much better than anywhere or anyone I have asked. Thank you for confirming what I was thinking", "score": 2, "replies": [{"body": "No way 🤣🤣 you belong here, regard. Can’t tell if you’re being serious…", "score": 1, "replies": []}]}]}, {"body": "It just rose to 728 13 minutes ago 1am pst", "score": 1, "replies": []}]}, {"body": "Get in we're going streaking", "score": 5, "replies": [{"body": "![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882)", "score": 1, "replies": []}]}, {"body": "Even if theta decay after earnings is \\~50%, you will still be up, so hold it till the end.", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882) that’s a bit regarded imo - not sell if touches 850 or 900 even until 3/8. Naturally that’s probably what I’ll end up doing, at least with one call", "score": 3, "replies": []}]}, {"body": "Sell it and buy puts for August", "score": 2, "replies": [{"body": "No thank you sir I’m not regarded enough to try to short this beast", "score": 8, "replies": [{"body": "lol yea sell two of them and let the other ride\n\nAlso\n\nI don’t understand options and eat crayons for lunch", "score": 4, "replies": [{"body": "If it hits 800 this week, probably sell 2 before earnings otherwise just 1 and yolo", "score": 2, "replies": []}]}]}]}, {"body": "would you do a stop loss?", "score": 2, "replies": []}, {"body": "Yoo I'm just starting to look around Wallstreet bets lol\n\nHow the F are u guys making the insane like $2k and $5k money?\n\nOptions mostly?\n\nIs there an easy strat or bot or something to get going with?\n\nAlso, what's this regards talk mean? 😅", "score": -3, "replies": [{"body": "If you don’t know how the markets work, go read up a couple of articles on investopedia… as much as these morons make it seem, it’s not easy money and you’ll lose your shirt.", "score": 1, "replies": []}]}, {"body": "Make it a call construction like a call butterfly, condor or callspread. Now you are playing with 13k but you can get the same gains with only 3k investments in a call construction, Now you are paying all those premiums.", "score": 1, "replies": [{"body": "Nah I don’t do all that regarded shit", "score": 2, "replies": []}, {"body": "hahah shit,  yeahh then go gambling with all you paid optionpremiums.\n\nyou can also play red or black in a casino thats the same with your shit options.", "score": 1, "replies": [{"body": "lol what’s got you so butthurt ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}, {"body": "Wow insider trading!!!!!!", "score": 1, "replies": []}, {"body": "Quit while you're ahead regard", "score": 1, "replies": []}, {"body": "Cash out! Don't be greedy! Recall Buffet here... ", "score": 1, "replies": []}]}
