{"title": "Credit Spreads on NVDA and SMCI: why wouldn’t these be the move?", "selftext": "Betting on IV crush. With both at historical IV  and next week likely to increase, opening credit spreads seems like a great way to capture some action without risking the biscuit. Thinking April exp. \n\nCould even open both bearish and bullish directions and still profit, no? How much more do you think IV could rise?\n\nIt feels too obvious. What risks am I missing here?", "id": "1asvr9z", "created_utc": 1708152826.0, "score": 6, "upvote_ratio": 0.64, "num_comments": 41, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|7 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "The risk of losing money", "score": 27, "replies": [{"body": "![img](emote|t5_2th52|4275)", "score": 1, "replies": []}]}, {"body": "Depends on how far OTM you’re talking. Credit spreads can be great but if the stock price goes past the short leg then you’re gonna lose everything. Stocks like SMCI and NVDA are great options because of high IV, but there were several times this month where a credit spread on these two would’ve incurred maximum loss.", "score": 7, "replies": [{"body": "https://preview.redd.it/bcwjwxzcz3jc1.jpeg?width=1170&format=pjpg&auto=webp&s=8fbad8b9d1f031eec9d61ac8ae5dc084aa2d1bc1\n\nThese were my most recent credit spreads I played today. Limited gains of about $6,000 but a maximum loss of $130,000. Luckily ROKU stayed below 121 on earnings… way below. But that’s how far out of the money I’m comfortable with spreads", "score": 5, "replies": [{"body": "That’s pretty shitty risk vs reward.", "score": 15, "replies": [{"body": "It was 96% to win according to robinhood 🤷‍♂️just trying to explain the risks to OP", "score": 1, "replies": [{"body": "Sure but all it takes is one black swan event and you’re fucked, not worth the risk imo", "score": 3, "replies": [{"body": "Yeah LYFT is a great example nobody saw the 40% gain. If someone was playing credit spreads on that then they got wiped out this week.", "score": 4, "replies": []}]}, {"body": "What if they said they’d get bought out by someone during earnings lmao?", "score": 1, "replies": []}]}]}]}, {"body": "Thank you, needed to hear this. So the strategy is still solidly directional and prone to huge swings not only keeping IV high but blowing through the short. \n\nWould going longer expiry help mitigate? Theta is a friend in this trade, if both are OTM and expire it’s still a profit, right?", "score": 1, "replies": [{"body": "Yes, look at the delta value of the short leg of your spread to understand the risk. For example.\n\nNVDA 1WTE 910/930 credit spreads: \nThe delta on the short leg (910) is -0.08; therefore this option has a roughly 8% chance of finishing in the money (you don’t want this). The premium is approximately $0.75, so your max win is $75, and max loss is $1,925. If the stock finishes between 910 - 930 you will exponentially lose money until at 930, you lose everything.\n\nNow let’s look at a riskier play\n\nNVDA 1WTE $800/$820 spreads:\nThe delta on the short leg is -0.27, so you have a 27% chance of losing money, however you get a $3.60 premium for this play, meaning your max win is $360, and your max loss is $1640.\n\nI could tell you infinitely more about credit spreads but I feel like these are the most important things to not be completely regarded if you do choose to play earnings. \n\nGood luck.", "score": 2, "replies": [{"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}, {"body": "Very helpful, thank you for the detailed examples. I didn’t realize the trade relies so heavily on the short leg and the long is just to cover. \n\nSounds like this is not the move with an account that couldn’t handle assignment. Thanks again.", "score": 3, "replies": []}]}]}]}, {"body": "Credit spreads won't get crushed until IV gets crushed. The problem is that IV will stay high for as long as Realized Vol stays high. So you sell a credit spread when IV is high - great. But Realized Vol stays high for the next week and blows right through your credit spread. Then, and only then, does it calm down and let IV get crushed, but at that point, IV crush is hurting you with your now-in-the-money credit spread. Welcome to selling credit spreads in high IV.", "score": 5, "replies": [{"body": "Thanks, hadn’t thought about this", "score": 1, "replies": []}]}, {"body": "The risk of limited gainz", "score": 3, "replies": []}, {"body": "Spreads are directional and not optimized for volatility changes.", "score": 3, "replies": [{"body": "Copy that. Do you think an iron condor a day or two after earnings would be a better way to capture decreasing volatility?\n\nIs there an options trade that is optimal for decreasing volatility while staying directionless?", "score": 0, "replies": [{"body": "Ultimately, every trade is going to lean towards one direction over the other. \n\nCalendar spreads could be ideal for capturing short-term volatility crushes.", "score": 1, "replies": []}]}]}, {"body": "Spreads generally reduce the influence of volatility, since the volatility from both legs of the spread roughly cancel each other. So it’s not as much about getting profit from volatility changing but rather guessing the correct direction the stock will move.", "score": 3, "replies": [{"body": "One of the main  draws of debit spreads is to be able to buy a position in the presence of high volatility because you’re able to reduce that cost in the options. If you’re looking to profit from “IV crush” then your best bets are selling cash secured puts or covered calls. That comes with risk but it’s how you profit off decreases in volatility the most.", "score": 3, "replies": [{"body": "For sure. I don’t have the funds for either on these two companies but would be doing exactly this if I could", "score": 1, "replies": []}]}]}, {"body": "regards here only know how to buy calls and puts (if they're 🌈🐻s). Get outta here with your multiple leg options!", "score": 6, "replies": []}, {"body": "Credit Spreads are easy. \n\nFamous last words.", "score": 2, "replies": []}, {"body": "If you do it as a day trade, getting filled in the morning when volume is crazy, you can usually fill for a cost of .01-.1, this will be DEEP ITM however. The trick is getting filled when selling however. But with this volatility you’re going to see when it pops or pulls back the spreads start to open up like crazy. I would say to immediately put a sell order that isn’t too crazy. Buying back for .1-.2 and hope for the best. I played this strategy on arm the week of earnings and made 300% in 2 days 🤷‍♂️ but…I’ve also done this before where I’ve sold for .95 and had to buy back at .98 because even though it moved the right direction, it wasn’t fast enough so I couldn’t get a fill. On the other side, if it is moving fast enough, you could potentially make 1000s of %, like if you get filled at 9.99 on 100 spreads and you expire OTM you’re making 100k off $100 😂 so, best of luck!", "score": 2, "replies": [{"body": "So the reason to go ITM with both strikes is to get filled? Am I reading that right?\n\nBut yes I’m realizing maybe this isn’t the move due to wild swings and still needing to get the direction right.", "score": 2, "replies": [{"body": "Yes, a good way to profit off of the volatility is to do what the market makers computers do. We don’t have the capital they do to just sell thousands of otm calls/puts. You use a credit spread. If you think it’s gonna stay the same or go up buy itm put spreads(deeper the more credit you’ll receive but harder to fill/expire worthless), or vice versa if you think it’ll be flat/go down, do itm call call credit spreads.", "score": 2, "replies": []}]}]}, {"body": "Cause it makes a big move and one of your spreads go into the money and you lose more thdn you collected. You can’t sell an iron condor fir more then you can lose", "score": 2, "replies": []}, {"body": "if you say so!! try it and let us know how it goes on Thu", "score": 1, "replies": []}, {"body": "Can't go tits up.  Do it and report back to us.", "score": 1, "replies": [{"body": "Selling puts", "score": 2, "replies": []}]}, {"body": "i don’t understand anything. I have nvidia and smci stocks. should i sell all my positions at first hour of this tuesday? why do people have a bad presentiment? i’m worried. I mean, i’ve seen good news on internet but here everybody is saying that nvidia and smci will go down. I’m learning so I would appreciate it if someone could enlighten me", "score": 1, "replies": [{"body": "i thought nvidia report was gonna increase nvidia price and the same with smci", "score": 1, "replies": [{"body": "That’s what they want u to think. It’s gonna tank your shit", "score": 1, "replies": [{"body": "so you think this is the best moment to sell before it tanks more, don’t you?", "score": 1, "replies": [{"body": "Tell me what happened during their last earnings.", "score": 1, "replies": [{"body": "the price went up, right?", "score": 1, "replies": [{"body": "Right after earnings, no it went down slightly", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "In my humble opinion, everyone seems so hyped about Nvidia, and think they are going to blow it out of the water. I’m sure they are. But people want profits and with the ride up im sure people are going to want less exposure to the growing AI phenomenon at least temporarily until everything pulls back a little bit, create a real support. Just because the alarm goes off doesn’t mean the stock should be going up 10 percent. That’s greed. And a lot of people on earnings that are buying calls at that moment are going to get wrecked. \n\nIf I was a institutional investor, I would want the stock to tank, trap all the bulls, cover their longs. Ride the wave down, once it’s cheap enough - inverse my position and ride it back up again.", "score": 1, "replies": []}, {"body": "I was so regarded for opening this spread, and even more regarded for holding through earnings, but Jensen has saved me. https://i.imgur.com/dk7zUng.png", "score": 1, "replies": []}]}
{"title": "+$47k on options for the week", "selftext": "No semiconductors gains (actually lost a couple thousand shorting SMCI via credit spreads) \n\nMost gains were from long DIS calls, got lucky with a few lotto plays on META and HOOD (check post history)\n\nFeel like my luck is going to run out so I’m mostly in 2026 leaps and shares at the moment", "id": "1at6kio", "created_utc": 1708189241.0, "score": 213, "upvote_ratio": 0.97, "num_comments": 40, "comments": [{"body": "Yeasssss my Disney 150c for 2025 went 4x!", "score": 19, "replies": [{"body": "Cheers 😉", "score": 4, "replies": []}, {"body": "Howww . It’s so far until 2025 and it’s not in the money", "score": 2, "replies": [{"body": "I’ve been randomly keeping an eye on them since October ‘22 when they $8.00. Figured they’d double bottoms around 80-90 and when they did I was able to buy a bunch of them under $1.00. Avg is .75 but they went as low as .56 and then recently back up to almost 3$.", "score": 3, "replies": []}]}]}, {"body": "Congrats and fuck you", "score": 31, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Would be a massive amount of screenshots, but this was my largest win of the week. Traded in and out of DIS several times, except the April calls. Can remake this post with more screenshots if you like\n\nhttps://preview.redd.it/0w5xtvlhh6jc1.jpeg?width=960&format=pjpg&auto=webp&s=0f6fced1a7e5e0488d04acce49bee5a3ed50da1b", "score": 8, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Closed the weeklies on Thursday and half the April calls on Friday 🥂", "score": 8, "replies": []}]}]}]}, {"body": "A very sexy trade. Do you like $WBD I’m thinking of buying calls but scared as I haven’t traded options before", "score": 4, "replies": [{"body": "I grabbed calls. They went ITM before Friday’s red day. I’ll prob assess right before earnings.", "score": 2, "replies": []}, {"body": "Watch videos about options scalping", "score": 2, "replies": []}]}, {"body": "Same just with -", "score": 3, "replies": []}, {"body": "i don’t even know how to do options; also how did you lose money shorting SMCI", "score": 1, "replies": [{"body": "I sold calls against it, covered by a credit spread. Too long to explain, but basically I was writing calls that the SMCI bulls were profiting wildly off of while I was taking the L (except Friday of course ![img](emote|t5_2th52|4271)) It was a small position", "score": 5, "replies": [{"body": "rip", "score": 1, "replies": []}]}]}, {"body": "Can someone tell me what the name of this apps that i can buy contracts from?", "score": 1, "replies": [{"body": "Any app that does stocks. You can buy options anywhere", "score": 3, "replies": [{"body": "Even behind Wendy's", "score": 1, "replies": []}]}, {"body": "Robinhood", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 1, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|4 years ago\n**Total Comments**|132|**Previous Best DD**|\n**Account Age**|11 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "what’s your strategy? do you think it’s plausible to buy an option at market open and then sell at the highest of the day (usually around noon?) that’s what i’m trying to do now\n\nthe only problem i have with this is that it doesn’t link how the premarket is doing as idk if i’ll gap up or gap down at market open which affects the trend during trading hours\n\nedit: spelling error", "score": 1, "replies": [{"body": "I mostly had a bullish thesis on DIS and bought calls on the dips\n\nDIS had a strong earnings report with the 50% increased dividend, new $3b stock buyback, and epic games deal. \n\nI bought DIS long calls on the red day after their earnings gap up.\n\nI doubled down when I noticed DIS gapping up into the green in the morning even during the blood red market CPI day earlier this week. I took profits on my weeklies with stop limit orders\n\nStill long 50 contracts of April $110 calls", "score": 11, "replies": [{"body": "Teach me your ways", "score": 2, "replies": []}, {"body": "I got $15 in buying power right now. Teach me your ways and tell me a wild play that I can do with it\n\n![img](emote|t5_2th52|4275)![img](emote|t5_2th52|8883)", "score": 2, "replies": []}, {"body": "I like what you did here, thoughts on Tesla ?", "score": 1, "replies": [{"body": "I’m just an idiot on wsb, but here goes: From a technical analysis perspective, TSLA seems to be forming a classic inverse head and shoulders pattern, so could fill the earnings gap to 207~ soon and could be a play as a high risk YOLO\n\nI think fundamental concerns with slowing revenue growth and high valuation is genuine though, so it’s not a sure bet. I’m long 100 shares and don’t think I’ll bet with options on it soon. Not financial advice.", "score": 2, "replies": [{"body": "PUT YOUR HANDS UP D3lusions!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|31226)", "score": 2, "replies": []}]}, {"body": "I’m in at $181, I watched the inverse head and shoulders form and now it’s confirmed and gradually going up , I think I’ll stay in till the gap fill as well, Im in shares for the long game but I’m also in options that expire in July , so far , so good, I think short term, it hits $212-$216 in near future …cheers man thanks for taking the time getting back to me", "score": 2, "replies": []}]}]}]}]}, {"body": "Hi everyone what are your thoughts \nFor SPCE  ( Virgin Galactic) right now it's trading  $1.87  do you think its going to move anytime soon ? What do you guys know why is this company trading only for $1.87", "score": 1, "replies": [{"body": "Because it's garbage that is certain to eventually declare bankruptcy.", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "You can make a poop on a stick portfolio. Add Nikola in there too ", "score": 2, "replies": []}]}, {"body": "Got it thanks", "score": 1, "replies": []}, {"body": "according to my analysis , WSB alone made 56 billion this week flinging calls \n\nso who lost .", "score": 1, "replies": []}, {"body": "U made that much return when the calls are only in the money by a single dollar?", "score": 1, "replies": []}, {"body": "know when to hold em, know when to fold em", "score": 1, "replies": []}, {"body": "i could use such a week as well", "score": 1, "replies": []}, {"body": "I’m going to sound like an idiot what are options", "score": 1, "replies": []}, {"body": "Great with long $hood. It cleared resistance seems like could shoot up to $30 in coming weeks?", "score": 1, "replies": []}]}
