{"title": "I build a tool which calculates optimal option strategies and now need some feedback", "selftext": "Hi there,\n\nI've been (mostly) lurking on here for the past year. During that time, I saw a many people lose money where they shouldn't have lost money. This was especially frustrating when people were spot on with their prediction where a stock is going and still lost money because they didn't use options correctly. Or even more frequently, one could have made a lot more money with a different strategy which still would have been reasonable or by using different strike prices.\n\nThis lead me to the creation of a tool over the past few months which does the following:\n\n1. You tell it where you think a stock is going, for example TSLA being at $450 in three weeks or SPY $300 next week.\n2. The tool then takes a look at a lot of different strategies, including all kind of call / put credit / debit spreads, iron condors, even FDs and finds the most profitable one under your prediction.\n3. This optimal strategy is then neatly presented to you along with a PNL graph, some metrics etc.\n\nThis tool is now available at [velistos.com](https://velistos.com), the first ten people can use the code \"optimalautism\" to access the optimizer. I'd love some feedback on the optimizer :)\n\n**TLDR:** Go to [velistos.com](https://velistos.com) and use the code \"optimalautism\" to beta-test a tool that calculates optimal option strategies.", "id": "jkc3ui", "created_utc": 1603985261.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 20, "comments": [{"body": "How is \"optimal\" defined? That's a pretty bold claim, given that \"optimal\" is highly sensitive to a number of factors that I doubt you are taking into account, like the trader's risk tolerance.", "score": 4, "replies": [{"body": "definitely needs a slider \\[Gaybear to Autist\\]", "score": 4, "replies": []}, {"body": "The way the tool basically works is that you enter a probability distribution. The optimizer then maximizes the expected value of the strategies. So optimal means the maximal expected profit.  \nYou can also set a maximum risk you are willing to take, the optimizer will then take that into account. However, it will only take a look at  single long options, call / put credit / debit spreads, and iron condors / flies in that case to keep the runtime reasonable.\n\n/s: Forgot a \"distribution\"", "score": 2, "replies": [{"body": "Well, that's better than I expected, but still, I think calling it \"optimal\" is an exaggeration. It's a recommender, not an optimizer.\n\nHaving a win rate as an input isn't a bad idea, but does it constrain the recommendation for things like holding time and average net gain%? As you know, the higher the win rate, the lower the average net gain% and holding time, for most trade strategies.", "score": 2, "replies": [{"body": "I forgot a \"distribution\" in the original reply my bad. So the optimizer does not take the win rate, it instead takes statements like \"The probability of TSLA being at $410 is 10%, 15% for $420, 20% for $425, 15% 430, etc\". This makes it possible to rate a strategy by calculating the expected return (basically profit at price x times probability of price x) of that strategy. And that can be optimized in the sense of \"there is no other strategy which has a higher expected return\".  \nAs far as holding time is concerned, the tool currently assumes that a position is opened at the current price and closed at the given date. That is one of the current shortcomings of the optimizer. Luckily, I've build the tool in a way that current shortcomings are easily addressable and a more variable algorithm is in the works, but it takes to long on the low-powered server in it's current form.", "score": 1, "replies": [{"body": "Oh, I see. Actually, given that, estimating win rate for a range of holding times might be a good output.", "score": 1, "replies": []}]}]}]}]}, {"body": "I tried it out on SPY and ran into an issue where it recommended options that were not liquid (no volume or OI), and also changed the expiration date to Nov. 19th 2020. I am from the US so I think there is a bug related to the timezone since I selected the 20th but it shows options for the 19th (which isn't a valid expiration)", "score": 2, "replies": [{"body": "Thanks a lot for your feedback. The display bug (hopefully) is fixed now, I put the volume filter onto my to-do list and will implement it within the next few days.", "score": 1, "replies": [{"body": "A volume filter is now implemented in theory. You can use it by enabling it in the advanced settings, but please keep in mind that this feature has gone through only limited testing due the markets being closed right now.", "score": 1, "replies": []}]}]}, {"body": "Is this legitimate?", "score": 1, "replies": [{"body": "Feel free to give it a try, you have nothing to lose :)", "score": 1, "replies": [{"body": "I will, thank you :)", "score": 2, "replies": []}]}]}, {"body": "Why do I need to Login?", "score": 1, "replies": [{"body": "To be blunt, I'm trying to build a company out of this tool and decided to directly code the website that way.", "score": 2, "replies": [{"body": "Typo in code - Losing, not loosing :)", "score": 2, "replies": [{"body": "Fixed, thanks for pointing it out :D", "score": 1, "replies": [{"body": "You’re welcome! Good luck with it, I’m looking forward to checking it out a bit more 👍", "score": 2, "replies": []}]}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "This comment has been automatically removed. URL shorteners are not allowed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/options) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
{"title": "Pinterest’s pandemic surge continues, stock jumps more than 25% toward fresh record highs", "selftext": "Pinterest thrashes earnings estimates while adding another 26 million active users, stock again heads for big gains after earnings and pushes Twitter and Facebook shares higher too.\n\nPinterest Inc. continued to experience a surge in new users during the COVID-19 pandemic, leading to larger-than-expected profit and revenue growth this summer, according to a Wednesday earnings report that sent shares on another ride toward fresh record highs.\n\nPinterest PINS reported a third-quarter loss of $94.2 million, or 16 cents a share, on revenue of $442.6 million, up from $280 million a year ago. After adjusting for stock-based compensation and other factors, the company reported earnings of 13 cents a share, up from adjusted earnings of a penny a share a year ago. Analysts on average expected adjusted earnings of 4 cents a share on sales of $383 million.\n\nPinterest shares jumped more than 25% in after-hours trading following the report, after closing with a 7.1% decline at $48.78. Shares were topping $63 in the extended session after closing with a 6.2% decline at $49.25; Pinterest shares have never traded for higher than $53.87 in regular trading.\n\nPinterest shares have more than doubled to record highs since the social-media company’s last earnings report, which predicted much higher revenue and user growth than previously expected. The online-advertising market seems to have found strength despite the pandemic, as strong third-quarter financial results last week from Snap Inc. SNAP sent stocks in ad-supported online companies higher across the board.\n\nOnline-ad stocks also experienced a jump after Pinterest’s report, which arrived 24 hours ahead of quarterly reports from online-ad powerhouses Facebook Inc. FB , Alphabet Inc. GOOGL GOOG and Twitter Inc. TWTR . Twitter shares gained more than 5% in the extended session Wednesday, while Facebook stock increased more than 2% and Google parent Alphabet added about 1%.\n\nPinterest executives said they expect revenue to grow around 60% year-over-year in the fourth quarter, roughly in line with the 58% growth in the third quarter. Pinterest reported revenue of $400 million in last year’s holiday period, so the guidance suggests sales of about $640 million this year, which again trounces expectations. Analysts on average predicted fourth-quarter revenue of $541 million, according to FactSet.\n\nPinterest stock has gained 165% so far this year, and more than 106% in the past three months, as the S&P 500 SPX index has gained 5% and 5.4% in those periods.\n\n[Source](https://www.marketwatch.com/story/surge-in-pandemic-pinterest-users-continues-stock-jumps-more-than-20-toward-more-record-highs-11603916620)", "id": "jk0lug", "created_utc": 1603933632.0, "score": 60, "upvote_ratio": 0.95, "num_comments": 23, "comments": [{"body": "Bought more today during regular trading hours...had a feeling it would roar yet again just like last earnings release and was encouraged by SNAP's recent pop as well. \n\nDare I say, PINS will roar again at next earnings release as it is demonstrating 60% growth! Incredible. 60% growth is Shopify territory type of growth. Long SHOP as well. \n\nPINS right now is like a Nikola truck rolling downhill...almost unstoppable short of an SEC investigation.", "score": 15, "replies": [{"body": "I got few around $20 level. Should have bought more today instead of worrying about steep run up.", "score": 11, "replies": [{"body": "I will bet we will have another day over the upcoming week where the market gets smoked where the dow will lose 1000 points or so. That could be a buying opportunity again. This is double and triple gainer from here, IMO.", "score": 3, "replies": []}]}, {"body": "Got in yesterday before close at 48. Someone gave me a tip using SNAP as the reason why it would pop after the earnings report. It just keeps going up!!!!! 67.50", "score": 3, "replies": []}]}, {"body": "Love PINS!", "score": 6, "replies": []}, {"body": "The people trashing PINS obviously lost money or sold", "score": 5, "replies": []}, {"body": "Got a few shares back at $19. Will continue to hold long term", "score": 4, "replies": []}, {"body": "I remember the post about the guy saying he sold 110k pinterest shares at 34 and was suicidal or something. I wonder what he's feeling like now.", "score": 5, "replies": []}, {"body": "PINS has execution AND strategy all rolled in to one. This is the next 10x stock. It's not just a pandemic stock, it's a market leader with so much expansion remaining (US, EU, Asia), with no real competitors. When it partners with Amazon, Alibaba, SE, Reliance etc (in addition to Shopify) and this thing goes truly viral we're all going to be wishing we had bought despite this 30% gain today. Any time you see multiple verticals being captured (social, e-commerce) which also are a bulls-eye with the consumer (with no real competition), it's an all-in situation. Also the CEO has such passion for enabling inspiration, you know this one's in good hands. This one is a long term hold with  likely short term BIG gains.", "score": 4, "replies": [{"body": "There are a lot of asian e-commerce websites who would count as Pinterest competitors in Asia. Of course they're not exactly like Pinterest but its not like Pinterest has no real competitors like you say.\n\nI would count at least\n\nXiaohongshu [https://www.xiaohongshu.com/](https://www.xiaohongshu.com/) (Read [https://qz.com/1634577/chinas-xiaohongshu-shows-the-future-of-your-social-shopping-experience/](https://qz.com/1634577/chinas-xiaohongshu-shows-the-future-of-your-social-shopping-experience/) & [https://www.nanjingmarketinggroup.com/blog/Introduction-to-Xiaohongshu](https://www.nanjingmarketinggroup.com/blog/Introduction-to-Xiaohongshu) as introduction if you want to know more)\n\nand Pingduoduo [https://en.pinduoduo.com/](https://en.pinduoduo.com/) (I would invest there too, if you believe in Pinterest, Ping Duo Duo already has far more than 500 million users)\n\nas competitors in the Asia market for Pinterest.\n\nBut I am with you in the believe that Pinterest has a lot of room for growth, especially due to the drawbacks for advertisors on \"traditional\" social media websites.\n\nAll it comes down to is Pinterest ability to take advantage of all the factors and grow with the increasing demand of the consumers. I hope they will be able to grow in Europe and the US, Asia is a tough market, the chinese are very innovative when it comes to (social) e-commerce.\n\nEdit:\n\nBut all that said, I believe in Pinterest because it seems to become the biggest western social e-commerce company. Advertisers will realize by just looking across the pond towards China, that this is the future, and drop Facebook more and more. People would maybe count FB, Instagram etc. also as social e-commerce, but imo Pinterest is it more so in the true sense of the word if we compare it to what is happening in Asia.", "score": 1, "replies": []}]}, {"body": "The sky’s the limit with this one fellas don’t miss this opportunity! 🚀🚀🚀", "score": 5, "replies": []}, {"body": "I’m genuinely happy for whoever owns shares. I just can’t do it. I hate the site with a passion that burns deep in my soul.", "score": 1, "replies": []}, {"body": "I sold 2/3 of my shares today because I was already concerned about valuation and the fact that virtually every stock has dropped after earnings. Now it's just super overpriced.", "score": -2, "replies": [{"body": "Congrats on being wrong", "score": 6, "replies": []}, {"body": "[removed]", "score": 4, "replies": [{"body": "Don't know if you are sarcastic or not but that is just flat out wrong. Pinterest have grown every quarter except one of the last 5 years. They have always been growing.\n\n[https://www.statista.com/statistics/463353/pinterest-global-mau/](https://www.statista.com/statistics/463353/pinterest-global-mau/)", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I am male and a mixed of male/female friends use Pinterest. It is definitely not the next Facebook as Pinterest is used more like a search engine for creative ideas/inspirations and not a media for communication.", "score": 6, "replies": []}, {"body": "Pinterest has worked heavily on creating a perfect environment for e-commerce. For brands, this is a uncharted gold mine. Not just a fad, but a solid business plan and rollout. The targeting possibilities are next level really.", "score": 4, "replies": []}, {"body": "Pins is my only social media outside of reddit, it is the only social media that isn't toxic...the others used to leave me stressed before I deleted them...but I'm happy when I find things on pins, most of my recipes are on there...it is just a really well organized social media sight that actually has useful content...as millennials and younger generations have to be more resourceful I think pins has a great future...More people use pins than twitter...", "score": 2, "replies": []}, {"body": "I have to disagree. I'm a teacher and the whole education community is now using PINS. If things get back to normal the numbers will only go slightly down in the education community because now we know we have a go to resource.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I don't doubt they will continue to grow, which is why I kept some of my shares.  But when I ran the numbers, the valuation was a big concern.  This thing has 4x the number of outstanding shares as ETSY.  Despite posting almost identical quarterly revenue, PINS has quarterly sale/share of 0.96 compared to ETSY's 3.58.  That's huge.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, I wasn't necessarily comparing them as direct competitors just pointing out the share dilution issue.  For a more direct comparison, FB had quarterly revenue of 18.7b with 2.4b shares outstanding for a whopping sales/share of 7.79.  That's more than 7x the sales/share of PINS, and yet with today's jump FB is priced at only 4.5x the share price of PINS.\n\nI'm not a PINS bear by any means - I'm still a shareholder myself.  I just think the jump is a bit of an overreaction and is setting the stock up for a pullback in the future when the growth doesn't quite line up with the valuation.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Puts on Pinterest as the market is going to be red tomorrow", "score": 1, "replies": []}]}
{"title": "Is Boeing a buy right now?", "selftext": "[deleted]", "id": "jk1r67", "created_utc": 1603937987.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 20, "comments": [{"body": "We ask if Boeing is a buy every crash lol 😂", "score": 20, "replies": [{"body": "I would wait for next Max .. crash.", "score": 1, "replies": []}]}, {"body": "I mean it won't go tits up... right?", "score": 8, "replies": []}, {"body": "I bought one share at ~137 back in April(ish) more or less to just track it.  It hit like 230 at one point (if you blinked you missed it) and is all the way back down to today's price.  \n\nI don't see airlines updating their fleet enmasse til covid is well in the rear view mirror.  They'll push their current fleets til that time.  BA will still get revenue from maintenance, corporate orders, military stuff, etc. but orders from the airlines are likely going to be hurting for the next couple of years.  \n\nPersonally I'll be putting my money elsewhere for now, but that's my opinion as a dumb redditor that may have realized I missed out a year from now.", "score": 6, "replies": []}, {"body": "Yes, the best time to buy good companies is when they’re down due to macroeconomic conditions that aren’t self inflicted by the company onto itself.", "score": 7, "replies": [{"body": "I can't tell if this is serious or ironic, because BA is down due both to macroeconomic conditions out of their control, and factors that are the very definition of self-inflicted.", "score": 7, "replies": []}]}, {"body": "Everything is. Buy the dip pussys", "score": 26, "replies": []}, {"body": "I feel like Boeing is screaming buy right now", "score": 4, "replies": [{"body": "Their passengers are also screaming by.", "score": 1, "replies": []}]}, {"body": "Negatory", "score": 5, "replies": []}, {"body": "I've been slowly building a position. I believe it'll come back eventually, but it may be a while. Who knows when we'll be back in full swing.", "score": 3, "replies": []}, {"body": "long term i say yeah. they have military contracts, gov tax breaks and a near monopoly on commercial. i bought as low as 95 but i think under 150 is a decent bet for multiyear play.  i buy little more every time it dips below 155.  sucks for surrounding economy short term but if they can retool and grow in a few years who knows.  im sure theres riskier things to do with more short term upside", "score": 3, "replies": []}, {"body": "Yes, you can buy it. You can also sell it. \n\nMy opinion is that you shouldn't be in the market.", "score": -2, "replies": []}, {"body": "I’d put a little in maybe, but I’d rather put my money in other places for now, I don’t see them going anywhere quick", "score": 1, "replies": []}, {"body": "Long term yes, but ask your self how long are you willing to hold this? Could be years before it recovers if at all but I think it will.", "score": 1, "replies": []}, {"body": "I've been buying these last few days, but I'll admit it takes balls. I'm also prepared to see red for 12-18 months. It takes willpower to hold a dead stock while others are rocketing up. \n\nOne thing to note though: stock prices are forward looking. So the current estimate is about 3 years until air travel returns to 2019 levels (could be longer, but I'm hearing 3 years estimate). You see stocks bounce high on good news all the time. The MAX certification is a few months away tops, and COVID vaccine should be to the masses by mid 2021. Once there's hope again, ppl will start to remember this stock used to trade at $400+ and the price will bump up quickly. \n\nReal question is: if you miss that first bump up and only get in at, say, 200 or 220 before you're confident, but missed out on a year and a half of hand-wringing, are you better off? That's your call. Personally I'm buying the dip every 10% or so all the way until I'm smiling or crying. We'll see. I just don't see this company going belly up, Uncle Sam will bail them out first.", "score": 1, "replies": []}, {"body": "Not in my opinion, Boeing will be hemorrhaging for a long time as I see [COMAC](http://english.comac.cc) gaining ground.  I am expecting China to start to cancel Boeing orders and then COMAC becoming a power, particularly in AsiaPac.  Sadly, I was going to short them then the Max issues happened before I pulled the trigger.", "score": 1, "replies": []}, {"body": "I wouldn't feel safe flying the 737 MAX.\n\nIt's basically a kluged together piece of crap, rather than a wholly from the ground up design.\n\nWatch any informational video about how they designed it, and it's frightening.\n\nIt also killed two entire cabins full of people. Like this isn't disputed by Boeing at all. A fundamental design failure led to the deaths of two cabins full of people.\n\nNow they're trying to \"fix\" or \"patch\" the problem instead of redesigning from the ground up.\n\nNow nothing could go wrong with this, right?\n\nSo that just about sums up my opinion of Boeing.\n\nIf I were to bet, I'd say its 50/50 that the 737 MAX never goes back into service again.\n\nBoeing is waaaay deep in the sunk cost fallacy, and this is gonna cost them dearly. If they were to put the 737 MAX back in the sky, and another accident occurs, they're pretty much done as a company..... like kaput, shut them down immediately and bring criminal charges to every one involved....\n\nThere are now documentaries being made about the foolishness and chain of errors within Boeing that led directly to the two plane crashes... imagine if one of them went up on Netflix just as Boeing gets the okay to start flying the \"fixed\" 737 MAX....", "score": 1, "replies": []}, {"body": "Airbus > Boeing", "score": 1, "replies": []}, {"body": ">I've been tracking boeing closely since the crash in March, \n\n😳", "score": 1, "replies": []}]}
{"title": "Cramer says oil is uninvestable - not quite", "selftext": "Jim Cramer stated that oil is uninvestable.  I may not know all of the context in which he meant that.\n\nThere is still the recovery from the virus to come.  That obviously would be a huge positive upward move for oil companies.  One could sell all one's oil stocks after that.\n\nSome have predictions about the market share of EVs.  But those are a phase in over several years.  How many even need a new car EV or otherwise after shifting to working from home?\n\nThere are still a lot of gasoline powered cars out there.  The oil industry produces chemicals and plastics too.  In eastern MA the electric power grid runs 35% off nat gas.\n\nAgain if oil companies are uninvestable I think it becomes the case after the virus immunity.\n\nAlso, remember how whenever there was a problem in the middle east oil would go up?\n\nIf there is election unrest here in the USA and people start breaking things, would that not also make oil go up since we are an oil producing country?\n\nAnd another thing- you just never know when a rejiggering avacado pumper is going to show up (see comment below).", "id": "jk7xvy", "created_utc": 1603969232.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 24, "comments": [{"body": "Remember when Cramer basically told everyone they should invest in oil tankers lol", "score": 3, "replies": []}, {"body": "I think putting a small portion of your portfolio into oil doesn’t hurt too much, I have 6% PSX in mine and that’s it", "score": 2, "replies": []}, {"body": "oil is such a broad industry.  \n\nIf you look at upstream -  actually getting it out of the ground - then yea I think there's too much capacity out there, I wouldn't want to touch any of that.\n\nMidstream and Downstream - I think certain companies can be positioned well in terms of their moats and products they make, and should benefit from lower feedstock prices.\n\nAll that being said, I'm not divesting, but I'm not looking to increase my exposure", "score": 4, "replies": [{"body": "Totally disagree lol. Upstream requires constant investment because existing projects will run dry. The companies with the best acreage and the best exploration and development expertise have moat. What's more, after the past few years of under-investment, we could be running into a period of undersupply soon.\n\nThe downstream market on the other hand... Its always been somewhat less volatile and WAY less profitable than upstream. There's also massive structural oversupply in the industry. Look at refining margins this year - absolutely terrible. Just because crude oil prices are low doesn't mean refiners will profit from low feedstock costs - product prices always follow crude prices down, and refining margins have completely collapsed this year. What's funnier is that \"simple\" products like fuel oil are way outperforming \"complex\" products like gasoline, which means fancy refineries aren't necessarily doing better than the rest (so much for moat!). At least low cost upstream projects are still making money.", "score": 5, "replies": [{"body": "thanks for the additional perspective", "score": 3, "replies": []}]}]}, {"body": "Cramer is a mainstream moron. Don’t ever listen to anything he says. He cares about viewers and pushing the garbage shit his friends tell him to.", "score": 1, "replies": []}, {"body": "while you're at investing in oil throw some money on airplanes, cruises, movie theatres, and resorts... everyone thinks they cracked the code with oil.......... \"pRe CoVId iT WaS tRaDiNG 3x As MuCh.\"", "score": 1, "replies": [{"body": "OK, I'll pick this one to respond to:\n\nOther than the oil subject---\n\nHow many airplanes crashed, how many cruise ships sank, how many movie theaters and hotels collapsed, how many roller coasters fell over?  None.\n\nAll the big capital assets of these kinds of businesses are still there.  They can lay off customer facing workers who don't have much education and keep the maintainance and engineering staff.   They can take out credit facilities and make it through.\n\nThe news is never good at the bottom.", "score": 1, "replies": [{"body": "what im saying is that we wont be back to precovid levels in a while. we have so much stock piled oil, some of those companies might go bankrupt. if you want to invest in something with some real returns go for renewable energy. everyone has already asked \"what about oil\"\n\nedit: if you wanna invest in oil you should invest in bp only cause the are about to sign a ev charging station..", "score": 1, "replies": []}]}]}, {"body": "And he's absolutely right. Dying investments. Sure they'll be around, but nobody wants to invest in dead dinosaur juice anymore. Not hedge funds. Not millennials.  Not Robinhooders. Meanwhile the whole world is working overtime to make it obsolete. Good luck.", "score": -1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "You're right, you're the Harvard graduate millionaire former hedge fund manager.", "score": 2, "replies": []}]}, {"body": "You were saying ... ?  Thanks one year later for the wish that I have good luck.  Perhaps it helped. \"Not Robinhooders.\"  Funny !", "score": 1, "replies": []}]}, {"body": "Laughs in Occidental", "score": 0, "replies": []}, {"body": "who the hell ever wanted to invest in oil.\n\nyea maybe ive done a swing trade but thats it", "score": -4, "replies": []}, {"body": "If you want to inverse Cramer, feel free to as I know many online do, but oil has a much more complicated story than just the pandemic.\n\nThey were overleveraged before the pandemic hit as one of their problems. I think that industry takes longer to recover than other industries.\n\nIf you want to use it as an \"I believe Trump gets reelected play\" or a play for the next time we decide that we don't feel bad about the virus, and play the bounce off that, than sure, though.\n\nBut it's not for me.", "score": 1, "replies": []}, {"body": "Invest in RDS they are strategically restructuring and most ahead of a shift towards clean energy amongst all the major oil & gas players\n\nQ3 earnings announce today EPS beat by $0.29!", "score": 1, "replies": []}, {"body": "I'm not investing in oil.\n\n**Shit, I'd almost rather invest in avocados.**\n\nThere is a generation of babies being weened on avocado baby food as we speak. The growth rate of avocados is gonna exceed the six percent forecasted.\n\nFavorable rejiggering of agricultural tariffs under Biden administration will be a boon in terms of sales to China, where avocado consumption is growing at much larger multiples than US.\n\nLong: AVO, CVGW", "score": 1, "replies": [{"body": "I bet none of us would have predicted that Angela the rejiggering avacado pumper would show up.", "score": 3, "replies": [{"body": "This is a Reddit Gem.", "score": 1, "replies": []}]}, {"body": "You may not be investing in oil, but eat one too many Avocados and you will turn into a major gas producer yourself.", "score": 2, "replies": []}]}, {"body": "I am firmly pro-Cramer...at a minimum the dude is entertaining. \n\nAnd you can't deny Cramer could have made you rich several times if you paid attention: \n\nRegeneron at $5.00 (had the CEO on the show)\n\nFacebook at $70.\n\nPinterest at $22\n\nTesla at $260\n\nMoral of story is to never shun anyone 100%. Listen to all and do your own DD and be a collector and evaluator of ideas. This is the reason I come to the stocks forum on Reddit, because you never know when or where you can stumble on the next great stock.", "score": 1, "replies": []}, {"body": "Anyone have a video clip of Cramer when he was saying energy is uninvestable?  I can't seem to find one.  It looks like CNBC has a clip but you have to be a \"pro\" subscriber.", "score": 1, "replies": [{"body": "At the time I wrote this, those were his exact words. Not quite at the same time, but there is\n\n[https://www.cnbc.com/video/2020/02/03/jim-cramer-claims-there-is-no-more-money-to-made-in-oil-and-gas-stocks.html](https://www.cnbc.com/video/2020/02/03/jim-cramer-claims-there-is-no-more-money-to-made-in-oil-and-gas-stocks.html)", "score": 1, "replies": [{"body": "Thanks.", "score": 1, "replies": []}]}]}]}
{"title": "Next Apple or Microsoft", "selftext": "[deleted]", "id": "jkapav", "created_utc": 1603980575.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 24, "comments": [{"body": "This sub is quality", "score": 22, "replies": [{"body": "Really stimulating questions and thoughtful discussion for sure lol", "score": 7, "replies": []}]}, {"body": "Hertz", "score": 17, "replies": [{"body": "😂", "score": 1, "replies": []}]}, {"body": "AMD", "score": 6, "replies": [{"body": "lmao", "score": -4, "replies": [{"body": "Think about Apple that was funny too 10 plus years ago wasn’t it?🤔😁", "score": 1, "replies": [{"body": "Completely different companies, products, business model and targetable markets man. Unless they diversify radically to the point where it won't be AMD as you know it now.\n\nI love AMD and Lisa Su, very promising indeed, but very difficult to reach a 2 trillion dollar valuation as is currently. Apple's business model and targetable markets don't remotely compare.\n\nA better answer for example would be Beyond Meat, in my opinion.\n\nMASSIVE targetable market, very early in its growth stage, highly adaptive, visionary leadership, and fantastic macro trend for the future. Just have to solve the competition problem.", "score": 1, "replies": [{"body": "Your looking at things from today’s perspective not 10-20 years ago...it’s all a gamble to pick the next Apple, Microsoft or Amazon stock. I’m sticking with my pick AMD", "score": -1, "replies": [{"body": "It's \"you're\" man, christ.\n\nAMD is a good pick (also holding), but I wouldn't expect it to reach a 2 trillion valuation in 10-20 years.\n\nI mean perhaps.... I guess the real goodies are in the data centre and AI space, and Lisa knows this (Xilinx acquisition), so maybe if NVDA can be a trillion dollar company, so can AMD!", "score": -4, "replies": [{"body": "Oh you’re one of those grammar gurus. Good for you. Christ😂", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Nokia", "score": 6, "replies": []}, {"body": "BONER, ANUS, NKOTB", "score": 7, "replies": []}, {"body": "Idk if anyone will be the next version of those companies but there are companies i see that can or will make moves. Idk if there will be a next apple or Microsoft but AMD looks to me very strong in the future. Idk if there will be a next Tesla but NIO might be able to follow in Tesla’s footsteps. These Mega Companies are so far ahead i don’t think anyone can be them or replicate them but there is still a lot of companies that i feel will become very successful", "score": 3, "replies": []}, {"body": "Don't see one, we need to know what the next big innovation is first. Google cornered the search market, Apple & Samsung really nailed the smartphone market, Microsoft - OS, Amazon killed online ordering, Facebook is Facebook... AI and 5g trends seem to favor the big entrenched companies. There won't be another 'super company' until something changes. \n\nNot saying they're not out there...", "score": 2, "replies": []}, {"body": "I peered into the crystal ball and the only stock that has a chance is gamestop, maybe with nikola as a close contender", "score": 1, "replies": []}, {"body": "Pied Piper\n\nTicker PIPI", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "loool", "score": 4, "replies": []}]}, {"body": "alleged fuzzy yoke prick steep literate fretful attractive aloof zephyr ` this message was mass deleted/edited with redact.dev `", "score": 0, "replies": [{"body": "Why is this downvoted..?", "score": 2, "replies": [{"body": "Idk man.. some people", "score": 2, "replies": []}]}]}]}
{"title": "Why I think you should buy Microsoft at a discount at 202 USD on 2020-10-28", "selftext": "[removed]", "id": "jk1zin", "created_utc": 1603938867.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 22, "comments": [{"body": "Gaming makes up 25% of Microsoft?!? I’m very impressed at how retarded you are. Welcome to WSB.", "score": 21, "replies": [{"body": "I have come up with crazier stuff to convince myself to buy calls", "score": 2, "replies": []}]}, {"body": "I'm pretty sure the reason you should buy this stock is so the op's holdings go up.", "score": 6, "replies": []}, {"body": "Just wait after elections to buy", "score": 4, "replies": []}, {"body": "Nobody tell him.", "score": 3, "replies": []}, {"body": "#Why I think you are lame...\n\n# https://ibb.co/Rh9rL5S", "score": 2, "replies": []}, {"body": "Im voting to remove this sorry", "score": 2, "replies": []}, {"body": "I don't invest in meme stocks. This is sounding a lot like GameStop.", "score": 2, "replies": [{"body": "lmao did u just say msft is a meme stock when it's one of the few companies with the strongest balance sheet out there?", "score": 2, "replies": [{"body": "Lmao did you just not understand a simple joke on WSB?", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Lmao can you all stop being beta cringy cucks?", "score": 1, "replies": []}]}]}]}]}, {"body": "Why catch a falling knife tho", "score": 1, "replies": []}, {"body": "Everyday when I log in to my work computer I’m reminded how much I hate microsoft\n\n&#x200B;\n\nAAPL calls it is", "score": 1, "replies": [{"body": "you should hate your employer for giving you shit hardware. their saas is great.", "score": 2, "replies": []}]}, {"body": "https://discord.gg/9FHcCJM", "score": 1, "replies": []}, {"body": "Lmao yeah it's a ok price atm, but it might drop more sooo🙄", "score": 1, "replies": []}, {"body": "I load up a shit ton of Visa today. Easy money.", "score": 1, "replies": [{"body": "Why", "score": 1, "replies": []}]}, {"body": "Not when it was downgrade on Tuesday from $125 to $100.", "score": 1, "replies": [{"body": "Wtf why, it’s literally the best run company lol", "score": 1, "replies": [{"body": "I had this argument yesterday with another user.  Here's my answer.\n\n MSFT:\n\n209.70 -3.55 (-1.66%) After hours: 7:59PM EDT\n\npriced for perfection with a TTM PE = 37\n\nfair PE = 25 with QE & Stimulus \n\nfair PE = 15 in recession & 2nd wave \n\nfair PE = 10 in depression\n\nin other words\n\nfair price for MSFT = $100 😉.\n\nSmart money would love to sell you calls.", "score": 1, "replies": [{"body": "37 PE is too low with interest rates at zero. fair value would be 70 PE+, imo. but i'm just a retard.", "score": 1, "replies": []}]}]}]}]}
{"title": "Are AMD investors buying the dip.", "selftext": "# Very surprised to see more calls then Puts today for AMD\n\nPremarket up  76.44  + 0.04  (+0.05%) only.\n\n&#x200B;\n\nI know AMD went down recently past 2 days because of buying another company. \n\nBut are big investors buying the dip. \n\nI guess we will find out in 8 hours.\n\nhttps://preview.redd.it/e6xfzbrx6zv51.png?width=1619&format=png&auto=webp&s=fe8aa735e60766d331188953d0e7c285756686bf", "id": "jk4w7n", "created_utc": 1603952083.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 20, "comments": [{"body": "Youre mother was buying my dip", "score": 26, "replies": [{"body": "GET HIS ASS", "score": 8, "replies": []}]}, {"body": "I got all excited about their new generation of GPUs and bought some shares with margin yesterday, since they were down. I don't think AMD will be affected too much by new waves of rona or election drama. The retard rally on this stock will continue.", "score": 4, "replies": []}, {"body": "Buy,buy,and buy.", "score": 3, "replies": []}, {"body": "Doesnt matter amd is a solid company\nTheres absolutely no reason they should be failing", "score": 2, "replies": []}, {"body": "Welcome to another episode of \"WSB retards buying AMD 'dip' and getting burned again\".", "score": 4, "replies": [{"body": "AMD not the only one.\n\nOver 10k Calls and Puts for major stocks\n\nMSFT Calls = 128,053 Puts = 58,701  \nNFLX Calls = 21,338 Puts = 0  \nFB Calls = 36,640 Puts = 0  \nAMD Calls = 60,418 Puts = 10,198  \nNVDA Calls = 0 Puts = 11,522", "score": 3, "replies": [{"body": "You see these big purchases by some magical \"smart money\", but you never know if they decided to dump that position on some WSB retards a few hours later. If winning in market was as easy as following barchart biggest-orders, then everyone would be winning (which is impossible in a zero-sum game by default).\n\nJust remember when some retard spent almost a mil on TSLA calls on battery day. I'm pretty sure many naive retards saw that fat order and thought \"sMArT MaNI\" and bought the same garbage.", "score": 2, "replies": [{"body": "As of writing\n\nAMD  up 1.5%  \nMSFT up 4%  \nFB up\n\nThe other three where quite low in volume.\n\ni.e NVDA and NFLX\n\nMy script polls every 15min.\n\nYou just play the probability and follow the smart money.", "score": 1, "replies": [{"body": "I'm waiting for your post with realized gains because otherwise, this is nothing for the first hour after open. It can moon by the end of the day or jump to abyss, but the only things that will matter is how much realized gains can somebody make on their predictions.\n\nAnd I have no idea about what 4% for MSFT are you talking about, lol. It opened at 204 and now it's on 204.", "score": 1, "replies": [{"body": "Time of writing\nAMD: +3.15%\nFB  +5.47%\nMSFT +2%\n\nNuff said", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Could this be a sign of #TrumpIsLosing which is trending right now.", "score": 4, "replies": []}, {"body": "I don’t get why it dropped so drastically? Anyone have insight", "score": 1, "replies": [{"body": "Today’s drop is because entire market sell off, yesterday’s drop was because AMD acquired a company and shares got diluted", "score": 7, "replies": [{"body": "Earnings were fantastic tomorrow should Gap up hopefully based on futures", "score": 8, "replies": []}]}, {"body": "Because the fucking analysts do not understand anything about any field of technology.", "score": 0, "replies": []}, {"body": "quack versed marry fear ink joke hat subtract enjoy different", "score": 1, "replies": []}]}, {"body": "Investors...", "score": 1, "replies": []}, {"body": "I'm too scared. Haven't sold though. \n\nI still think it's one of the best companies listed and it's PEG it's cheap, but boy oh boy is the market having it's period.", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}]}
{"title": "AMD is going to be yuge", "selftext": "Sup bitches,\n\nGot some interesting info for yall asses.  I have a friend who works in cyber security and is into gaming, and he hit me up today with some interesting dd.  I dont know shit about this stuff but this is basically his word so take this info for what its worth.\n\nBasically AMD just announced its going to be coming out with new gpu that, in his words, is either matching or beating  NVIDEA with less power and for cheaper.  This is huge news because up until now NVIDEA has apparently dominated this space.  He states \"NVIDIAs top GPU the RTX 3090 sells for $1,499.99 and draws 350W and its one of the largest GPUs ever in terms of physical size. AMD took some shots. They released the RX 6900XT for $999.99 only draws 300W and it's the same size as your average GPU.  The only thing the 3090 has is more memory 24Gb vs 16GB but honestly that shouldn't matter.\"  He further states \"They should be getting a lot of sales on both cpu and GPUs because they also made this technology that when you pair one of their cpu with one of their GPUs you automatically unlock this feature NVIDIA and intel cannot provide.  Same feature that's going to allow the new consoles to load games so quickly and just boost the performance.\"  He finishes \"Streams of revenue PS5, XboxseriesX, CPUs (consumer laptops/desktops, high end gaming/workstations, servers google + Microsoft deals) and now GPUs.\"\n\nSo what does all this mean?  Honestly I donno and most of you are too retarded to understand this info let alone read but maybe theres atleast one of you out there autistic enough to find this info suitable, or at the very least school me on this stuff.\n\nTLDR:   buy long dated AMD calls I guess.....", "id": "jk6ek2", "created_utc": 1603960821.0, "score": 13, "upvote_ratio": 0.66, "num_comments": 28, "comments": [{"body": "\"This is basically his word so take this info for what its worth.\"\n\n\nBoth his and Su Bae's word that we all heard from watching AMD's worldwide presentation yesterday.", "score": 28, "replies": []}, {"body": "How is this information free!?!", "score": 14, "replies": []}, {"body": "This MUST be considered insider trading.", "score": 18, "replies": [{"body": "Not sure if we are being sarcastic?\n\nIt's all been public info since yesterday. Anyone who knows anything about basic hardware architecture can come to the same conclusions.", "score": 7, "replies": [{"body": "I can’t speak for you, but yes, I was.", "score": 1, "replies": []}]}]}, {"body": "I would follow you but I'm scared the SEC frags my arse for insider trading.", "score": 4, "replies": []}, {"body": "AMD is worth buying. I recommend buying next week after the election.", "score": 4, "replies": []}, {"body": "Nvidia is developing as well don’t forget", "score": 5, "replies": []}, {"body": "Bought amd yesterday buying more everyday of this sale i want a spread", "score": 3, "replies": []}, {"body": "u lost me at long dated. aint nobody got time fo dat", "score": 3, "replies": []}, {"body": "50% AMD 50% NVDA literally cant go tits up, and fuck INTC that pos.", "score": 3, "replies": []}, {"body": "NVIDEA", "score": 3, "replies": []}, {"body": "Both AMD and Nvidia Leaps are attractive", "score": 4, "replies": [{"body": "Yeah boi", "score": 1, "replies": []}]}, {"body": "The ONLY thing from an average consumer point of view that amd was lacking was highest* end graphics cards(relative to Nvidia). Which they just delivered. For 65% of the price of Nvidia’s top of the line. Insane. It’s a niche market but more importantly it’s indicative of their relentless innovation across the board", "score": 2, "replies": []}, {"body": "Lost me at YUGE", "score": 2, "replies": [{"body": "Had me at YUGE", "score": 7, "replies": []}]}, {"body": "You don't know shit about fuck", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/p3arbear123 don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "What is the exchange rate for AMD/ Xilinx shares? 1 Xilinx share = 1.7 AMD shares for the merger right?", "score": 1, "replies": [{"body": "You sure, thats free money?", "score": 0, "replies": []}, {"body": "exactly", "score": 1, "replies": []}, {"body": "This is the route right now, especially with the pullback. \n\nIf you think AMD will moon, buy a bunch of XLNX and put them in an account you will leave alone for a year. Buying XLNX at $120 will be like buying AMD at $70 by the end of 2021.", "score": 1, "replies": [{"body": "But only if AMD does not tank", "score": 2, "replies": []}]}]}, {"body": "Lol AMD again?? Give it a break Jesus Christ. \n\nHERE IS A NEW ONE FOR YOU TARDS\n\n\n\nMRVL or INFI\n\n\nCHECK IT OUT", "score": 1, "replies": [{"body": "Why INFI?", "score": 1, "replies": []}]}, {"body": "This battle has been going back and forth for over a decade. Doesn't really mean much. Nvidia will just come out with something else right after.", "score": 1, "replies": []}]}
{"title": "The Most Valuable DD WSB has Ever Seen", "selftext": "[deleted]", "id": "jk78sr", "created_utc": 1603965584.0, "score": 5, "upvote_ratio": 0.61, "num_comments": 25, "comments": [{"body": "If you're right the tank will happen pre-market so unless you bought yesterday this is useless.", "score": 17, "replies": [{"body": "I don’t think so, they will continue bleeding until they return to about $25-30 per share by December. So it’s not too late to profit off of casinos’ inevitable bankruptcy", "score": 0, "replies": [{"body": "when do you post your loss porn?", "score": 12, "replies": []}, {"body": "Well looks like you're retarded", "score": 6, "replies": []}, {"body": "Of course bigly thread title deserved bigly results.", "score": 1, "replies": [{"body": "Came back to say I told you so. Fuck you. Penn is down to $52. Anyone who bought puts is celebrating in tendie town", "score": 1, "replies": [{"body": "Wake up bud.\n\nYour 50P is still worthless at 52. Good luck holding through the weekend.", "score": 0, "replies": [{"body": "I don’t think you understand how options work. $50p is up 100% today lmao \n\nFact checked.", "score": 1, "replies": [{"body": "What ever you say bud. Don't ride to zero.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "No money to gamble. They better start downloading Robinhood to earn some money to gamble with.", "score": 7, "replies": []}, {"body": "Update: Penn reported double its expected earnings and it literally went tits up. Back to the drawing board", "score": 8, "replies": [{"body": "A true wsb retard I see", "score": 6, "replies": []}, {"body": "Lol", "score": 1, "replies": []}]}, {"body": "Except that they partnered with [edit] barstool sports book app. Don’t underestimate this.", "score": 4, "replies": [{"body": "Do you mean barstool? Can’t find any info on penn partnering with bleacher report", "score": 1, "replies": [{"body": "Yeah barstool", "score": 2, "replies": []}]}, {"body": "Barstool as well", "score": 1, "replies": []}]}, {"body": "why don’t they buy some poots on themselves, have the call again the next day and say they made money?? like??", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Not a DD", "score": 1, "replies": []}]}, {"body": "After getting burnt to a crisp this spring on PENN puts, I'll never buy one again for PENN", "score": 2, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**PENN**|**$50**|**BUY PUT**|**2020-11-06**|**$1.31**|**$56.59**|**2293**|**0**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckgunpf60bdj307394wsqvi0f) | [Track Record](https://www.pickmojo.com/user/MLG_Ethereum/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 0, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/MLG_Ethereum don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I don’t believe it. Online gambling is booming.", "score": 1, "replies": []}, {"body": "Casinos make a ton of money off their pool parties and night club bottle service. Until those open at full capacity expect bleeding", "score": 1, "replies": []}]}
{"title": "2 questions.. Should I buy apple before earnings? And should I buy APple on margin?", "selftext": "[removed]", "id": "jk8yii", "created_utc": 1603973935.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 21, "comments": [{"body": "1. Yes, stocks only go up. \n\n2. Sure, what could possiblay go wrong?", "score": 25, "replies": []}, {"body": "No. Don't be stupid. Ups killed earnings and went down. The market is on the middle of crashing. Buy apple when it hits 105 and definitely when it gets to 100", "score": 13, "replies": [{"body": "User name checks out.", "score": 5, "replies": []}, {"body": "Clearly no clue what a dip n correction is?!", "score": 1, "replies": [{"body": "I'm trying not not be like all these other dumbasses trolling him. Apple earnings won't be showing any new phone sales or their new subscriptions. I'm pretty bullish but this week is not going the way it should since corona is getting worse and there's an election going on in under a week", "score": 1, "replies": []}]}]}, {"body": "Yes and yes maybe borrow money from a family relative to buy more.", "score": 7, "replies": [{"body": "Thats a fantastic idea... maybe its even possible to borrow money from relatives at margin as well?!", "score": 3, "replies": [{"body": "Remember that losses are tax deductible so it’s a win-win.", "score": 3, "replies": []}]}]}, {"body": "It’s fat bear season, wait a bit until they fall asleep", "score": 4, "replies": [{"body": "😏 you kinda sad soyboy. Its a DIP!", "score": 0, "replies": [{"body": "That’s exactly what I’m sayin’ smooth brain", "score": 3, "replies": []}]}]}, {"body": "Here’s one consideration. The total market cap of US stocks is about $36T. Apples market cap is $1.9T. Basically Apple is now 5% of the value of all stocks traded on US exchanges. Just let that sink in and then think about how much upside you have in this in the near term", "score": 3, "replies": [{"body": "I hear ya......", "score": 1, "replies": [{"body": "Tell me you didn't buy AAPL on earnings and you didn't do it on margin", "score": 1, "replies": []}]}]}, {"body": "YES \nand\nYES, absolutely!!!!", "score": 2, "replies": []}, {"body": "Only Margin is for newbs... real pros follow the below:\n1 refinance their house \n2 reverse mortgage their parents house\n3 cash advance from their spouses credit cards \n4 THEN buy apple with margin", "score": 2, "replies": [{"body": "2 out of 3 ain't bad! On my way to tendie town.", "score": 1, "replies": []}]}, {"body": "literally free money, and should always be trading on margin.  🧠", "score": 2, "replies": []}, {"body": "never don't use margin on blue chip", "score": 0, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Thanks.. and I will", "score": 1, "replies": []}]}, {"body": "I hope you didn't buy apple dude. Never comment and listen to the advice they give. There's some good dds but if you just blindly follow you'll get burned", "score": 1, "replies": []}]}
{"title": "TSLA,SPY,SNAP,FSLY,PLUG,AND VALE GANG", "selftext": "", "id": "jkfkmq", "created_utc": 1603995861.0, "score": 19, "upvote_ratio": 0.93, "num_comments": 20, "comments": [{"body": "Honestly... Nice job man get to zero for full   [**r/wallstreetbets**](https://www.reddit.com/r/wallstreetbets/) **Experience.**\n\n•", "score": 6, "replies": []}, {"body": "How do you feel after something like this?", "score": 3, "replies": [{"body": "Wendy's is a 14 mile round-trip commute.", "score": 11, "replies": [{"body": "Long walk", "score": 2, "replies": []}, {"body": "Have you checked to see how far the nearest 7/11 dumpster is?", "score": 2, "replies": []}, {"body": "I comprehend what you said but idk what the fuck you are saying", "score": 1, "replies": []}]}]}, {"body": "Twitter puts, it’s going to drop hard AH. Trust me man.", "score": 2, "replies": [{"body": "What does your crystal ball say about SNAP monday?", "score": 1, "replies": []}]}, {"body": "Any suggestions on what to do differently?  Other than, \"don't pick the wrong side of puts and calls\"", "score": 1, "replies": [{"body": "Have more money", "score": 2, "replies": [{"body": "More money, and then invested differently how?", "score": 1, "replies": [{"body": "If you have more money you can lose more money!!!!", "score": 3, "replies": [{"body": "You should learn to make money, not lose it! Haha. Get on the other side of the equation... feels good here.", "score": 2, "replies": []}]}]}]}]}, {"body": "ah, to be a hedged option", "score": 1, "replies": []}, {"body": "Maybe next time dont put all your money into one sector?", "score": 1, "replies": [{"body": "I'M not an investor this is a casino", "score": 1, "replies": [{"body": "Dude stop gambling", "score": 1, "replies": []}]}]}, {"body": "oh no oh no oh no sweetie", "score": 1, "replies": []}, {"body": "I am a bot. You submitted a Gain/Loss/YOLO which was a video or GIF.                            Please make it a Reddit gallery of screenshots including entry and position info.", "score": 1, "replies": []}]}
{"title": "EV market is the next dot com bubble", "selftext": "[deleted]", "id": "jkg3fr", "created_utc": 1603997449.0, "score": 4, "upvote_ratio": 0.58, "num_comments": 23, "comments": [{"body": "SBE", "score": 11, "replies": [{"body": "Shhh. I'm still loading up.", "score": 7, "replies": []}, {"body": "Don't buy this one guys it's shit (stfu please I'm still loading up when I get paid)", "score": 1, "replies": []}]}, {"body": "Stay away from HYLN. They have an actual product that will help with the transition from diesel/gas to electric trucks. I have bought in multiple times and it keeps going lower. \n\nAlso, fuck VALE", "score": 22, "replies": [{"body": "Fucking vale", "score": 5, "replies": [{"body": "Vale gang🚀🚀", "score": 5, "replies": []}]}, {"body": "https://youtu.be/ei_8vCobf2I \nIn case you dont watch dude says long term purchase and it was overbought with a price target of 20 for now he predicted the nkla scam too so id listen to him", "score": 3, "replies": [{"body": "Yeah, the nkla scam was really difficult to predict. /s\nEspecially when they admitted to rolling the truck down an hill, and the stock actually rose.\n\nAnyhow. I am absolutely long on Vale. But I hoped for a November/  December rise, and it seems that we are not getting it.", "score": 0, "replies": []}]}, {"body": "Fuck Vale fr tho", "score": 1, "replies": []}, {"body": "Wait I own VALE, why are we fucking VALE?", "score": 1, "replies": []}]}, {"body": "How did the bubble “just start” both nio and tesla have gone up like 200% this year", "score": 6, "replies": [{"body": "Two companies aren't a bubble. There needs to be a handful, and we just started seeing EV companies IPO.", "score": 3, "replies": [{"body": "I mean SOLO, FUV, and NKLA all already popped like 100% back in July as well.", "score": 1, "replies": []}]}]}, {"body": "Imagine the loss porn and gain porn when it bursts", "score": 2, "replies": []}, {"body": "HYLN", "score": 3, "replies": [{"body": "Fuck hyln", "score": 1, "replies": []}]}, {"body": "Tesla will pop first.", "score": 1, "replies": []}, {"body": "BYD", "score": 1, "replies": []}, {"body": "spaq (fisker) has been nose diving and hasnt even hit bottom yet 😫", "score": 1, "replies": []}, {"body": "BEP", "score": 1, "replies": []}, {"body": "Well if you look at the automotive market cap as a whole it just swelled to 3x whilst the total number of vehicles sold has decreased. So the TAM as a whole is shrinking. I expect many will crash to 90% of their current price. Some will be able to raise cash to keep playing others won’t.", "score": 1, "replies": []}]}
{"title": "Will $AMZN announce a split today?", "selftext": "[removed]", "id": "jkh1ps", "created_utc": 1604000360.0, "score": 1, "upvote_ratio": 0.53, "num_comments": 27, "comments": [{"body": "Amazon isn’t splitting, if big head has said he doesn’t want a split, it’s not gonna split.", "score": 9, "replies": [{"body": "big head! lmao!!!", "score": 3, "replies": []}, {"body": "Its bagetti you fuck", "score": 4, "replies": []}, {"body": "Did he say that?", "score": 1, "replies": [{"body": "Many years back", "score": 1, "replies": [{"body": "So when the stock was like 1/4th the price it is now?", "score": 1, "replies": [{"body": "Not sure but look it up, it’s pretty well known", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes", "score": 2, "replies": []}, {"body": "Let's pray together for this to happen.", "score": 2, "replies": []}, {"body": "Maybe", "score": 1, "replies": []}, {"body": "Hope so!", "score": 1, "replies": []}, {"body": "Na", "score": 1, "replies": []}, {"body": "No.", "score": 1, "replies": []}, {"body": "Where have u heard that? Why today?", "score": 1, "replies": []}, {"body": "Why would they? Apple and Tesla split and now every asks if all the other major stocks will split. SMH", "score": 1, "replies": [{"body": "Amazon's been flat since its last earnings report. Literally the only reason I don't see them doing it now is because Bezos hates Trump and a split would help the market before election day.", "score": -4, "replies": []}]}, {"body": "Yes, it's splitting. JayBee  DM'd me.", "score": 1, "replies": []}, {"body": "My vote is for a ban.", "score": 1, "replies": []}, {"body": "I'm liquidating everything and yoloing AMZN if they announce a split", "score": 1, "replies": [{"body": "Huh why?", "score": 1, "replies": [{"body": "Did you see what this retarded market did with the last 2 big splits?", "score": 1, "replies": [{"body": "Nah...but...I'm guessing it bought? Which...literally makes no sense lol. Unless ur just trying to advocate to the poorer side of robinhood so they can afford a share", "score": 1, "replies": [{"body": "lmao; tesla and apple both went up like 50%", "score": 1, "replies": [{"body": "My God...people are dumb", "score": 1, "replies": []}]}]}]}, {"body": "Huge runs, TSLA went up like 80% and I think AAPL went up like 50%", "score": 1, "replies": [{"body": "Gd, people are dumb", "score": 1, "replies": []}]}]}]}, {"body": "Ehhh what's the incentive for a split...it's all the same", "score": 1, "replies": []}]}
{"title": "Thanks everyone for hyping up AMD and MSFT", "selftext": "", "id": "jkhi8q", "created_utc": 1604001770.0, "score": 19, "upvote_ratio": 0.77, "num_comments": 25, "comments": [{"body": "You are the only person to blame listening to the fucking idiots here.\n\nFuck up on your own DD, like me!", "score": 33, "replies": [{"body": "I know it was a bad decision. My friend warned me of buying calls near earnings but I guess I've learned my lesson the hard way. Good thing I didn't invest/bet too much. \nCan anyone tell me why playing earnings is bad idea? Why does MSFT drop even after posting good figures?", "score": 0, "replies": [{"body": "You lost all your money playing earnings and you’re still asking why it’s a bad idea to play earnings lmao", "score": 9, "replies": [{"body": "I want to know why after posting profit the stock went down. If you know it then answer else no need to make fun of someone who is trying to learn from mistakes.", "score": 1, "replies": [{"body": "so let this be a lesson. To answer the basic 'why', AMD acquired Xilinx. Some people are likeining this to their acquisition of ATI which catapulted them into fighting bankruptcy. Basically, there are questions on how well AMD can integrate Xilinx into their products. And if they can't , then their overall growth which wallstreet wants to be like 20% YOY is going to be quite reduced by a much smaller growth company in Xilinx.\n\nall that said here is my sage wisdom:\n\nno DD in the world would've prepared you for AMD. AMD's earnings alone were worth a strong shoot up to 90, on top of that their GPU unveiling is extremely promising for a good NVDA competition, assuming they didn't cherry pick too much for their benchmarking.\n\n but guess what, we all knew xilinx was a possibility, but i don't think too many people expected it this week, esp not during ER.\n\nIn the end, ER is always a gamble there is almost no DD you can do to help your chances with ER. \n\nAMD: good revenue, good profit, good growth in key areas, beat on metrics across the board, improved next q outlook, no major personnel change, **acquisition which wallstreet is apprehensive of.** All that leads to a drop.\n\nMSFT: Smashed through metrics, great growth in key areas. Post ER fall.\n\nunless you can both figure out how well they are going to do, which is hard enough on its own, determine overall market sentiment towards them, and figure out if it is priced in or not, you're probably always going to at best getting a 50/50 chance on ER.\n\nMoral of the story, if you're playing ER, play with money that you can lose, and avoid IV crush be doing spreads instead of naked long calls.", "score": 8, "replies": []}, {"body": "most tech stocks are over valued and earnings reports usually leads to corrections", "score": 1, "replies": []}, {"body": "You know how many people were doing what you were?", "score": 1, "replies": []}]}]}]}]}, {"body": "That's not even a g bro", "score": 10, "replies": []}, {"body": "Fucking 1 contract. Gtfo of here", "score": 17, "replies": []}, {"body": "Lmao I blame you all for me losing money. Get fucked nerd.", "score": 9, "replies": []}, {"body": "You must be new here...inverse wsb...You'll learn", "score": 9, "replies": [{"body": "This is the only way. It seems like a joke but I'm starting to believe it now.", "score": 1, "replies": [{"body": "I assure you...I'm not joking. The pumps are made so people can exit profitably", "score": 5, "replies": []}]}]}, {"body": "dude if you’re gonna listen to WSB, do leaps if anything", "score": 7, "replies": [{"body": "That is the end goal. I have $900 in my account, I don't think I could get a good long call for that amount. Playing weeklies to get to 3-4k and then would buy a leap and delete reddit and robinhood for good.", "score": 1, "replies": [{"body": "GME!!\n\nAlso, check out debit spreads", "score": 1, "replies": []}]}]}, {"body": "Amd and MSFT are for LEAPs bro", "score": 7, "replies": []}, {"body": "MSFT has a fucking market cap over $1.5T and you think its going to spike based on the fact that they were slightly above earnings on estimates that were already adjusted down earlier in the year due to Covid?  $1.5T!  How fucking high do you really think it could spike on quarterly earnings!?  Are you one of those, \"durr GME is going to $100, bro\" dudes?  \n\nAMD announced that they are buying XLNX at a price that many believe to be an overpay.  Everything else in their earnings and guidance was golden, but you got fucked by the XLNX news.  That's why people tell you not to buy FD's and earnings plays.  \n\nBut don't worry, I have a December play and when it blows up in my face, I will post it so that you can laugh at me too and call me a retard.", "score": 3, "replies": []}, {"body": "AMD was bullshit. Let's just all admit that AMD was total bullshit.", "score": 1, "replies": []}, {"body": "Fuck amd", "score": -1, "replies": []}, {"body": "Your fault for not listening earlier. Next time get on the  boat asap.", "score": 1, "replies": []}, {"body": "I learned my lesson on the Microsoft $200 March calls.", "score": 1, "replies": []}, {"body": "AMD hit over $90 a few weeks ago...stop bag holding you fucking retard.", "score": 1, "replies": []}, {"body": "Long msft 1/15/21 230c all day long \nYeah it’s a 1.5t dollar company witch is ridiculous but also the dollar is gonna be worth so little after all that fucking retarded printing that I wouldn’t be suprised if it’s valued at 2t next year", "score": 1, "replies": []}, {"body": "So you lost pennies and still bitching? Lmao.", "score": 1, "replies": []}]}
{"title": "The stock market is a mental institution (sell the news)", "selftext": "I have realized that the stock market is a mental institution.\n\nEverybody sells after the news (earnings or whatever) even if the news are good.\n\nStocks continuously beat estimations and report amazing good results, yet the shares drop big after the earnings are out.\n\nThe only way for the stock to go up after earnings is if they report out-of-this-planet earnings or give out-of-this-planet guidance.\n\nThis also happens when companies give very good news if the content of what they are going to present is rumored (or more or less known) before. Examples:  Tesla battery day, AMD Zen3 day, Apple iPhone12 day, ..\n\nThe funny thing is that once you have some experience on the market, you learn how it works and you do the same because you know everybody does that.\n\nAnd that is autistic friends, why this tradition of sell the news perpetuates itself.", "id": "jkiz2o", "created_utc": 1604006220.0, "score": 27, "upvote_ratio": 0.88, "num_comments": 28, "comments": [{"body": "positions", "score": 12, "replies": [{"body": "In the past week my portfolio got fucked by Apple, AMD and Intel:\n\n \n\n* 2 calls on Apple Jan16 125\n* 3 calls on AMD Nov20 95\n* 1 short put on AMD strike 80\n* 2 short puts on Intel strike 52\n* 100 shares of Intel\n* 200 shares of AMD", "score": 5, "replies": [{"body": "If you buying calls on AAPL at this price you deserve to go bankrupt. Company has pretty much 0 growth, yet has had insane levels of muliples expansion due to its \"insane growth\"\n\nOh wow, they beat the earnings estimate. Whoopdeefuckiditydo. 1% Y/Y Revenue growth while stock is up 100% in the last year.\n\nDumb fuck.", "score": 7, "replies": [{"body": "They hated Jesus because he told them the truth.", "score": 16, "replies": []}]}, {"body": "So like, the problem here is that stocks already went up the last two cycles. Everyone was hopeful.  Now it is not and elections are before us and the mood is very different.  Just because something happened last two cycles, doesn't mean it will have a third time.", "score": 1, "replies": []}]}]}, {"body": "The key is to predict the news...", "score": 8, "replies": [{"body": "So you sell after the news because you have predicted them? Where is the logic on that?", "score": -2, "replies": [{"body": "The logic is to be first in anything with the market- especially when trading options because that’s how you make the serious coin. \n\nIn response to your 3rd paragraph down: get into the trade weeks before the Q reports. They melt up because of the anticipation of the Q report. Meaning it’s getting priced in and sometimes it’s even priced in over the true market value. That’s why you see the downtrend after these amazing reports. It’s fomo people buying and smart people selling. The smart people were there weeks before you. \n\nYour second to last paragraph explains a lot about how you trade. I’m not knocking you either so don’t turn gay on me. If I were to give you some advice I would recommend you rethink that statement. \n\nStop trying be like everyone because just about everyone looses money in this game over the long run. I don’t care what they tell you.", "score": 10, "replies": []}]}]}, {"body": "Any \"realization\" you're having right now is not a good realization. This is abnormal.", "score": 3, "replies": [{"body": "Yeah, tech beats estimates and dumps 5-15%. Such fucking bs. Whatever lmao I bought the dip!!!", "score": 2, "replies": [{"body": "Well, that's my point, look at PINS and SNAP... Once you compare ...", "score": 1, "replies": [{"body": "How those compare to for example Amazon?\n\nAmazon Q3 20 Earnings Results:  \n\\- EPS: $12.37 (Estimate: $7.55)  \n\\- Revenue: $96.1B (Estimate: $92.71B)\n\nStock is 2% down after-hours.", "score": 3, "replies": [{"body": "No. It's the surprise factor. No one in their right mind thought Amazon would do poorly. In fact it's dull. Pinterest, who does absolutely fucking nothing, making money is exciting! Amazon, who has been basically fueling people during the lockdowns, doing amazing is ... well ... it's a given.\n\nYou're not seeing it.", "score": 3, "replies": []}]}]}]}]}, {"body": "No. Try again", "score": 3, "replies": [{"body": "Please share your wisdom with me. What I'm getting wrong?\n\nJust see Amazon now:\n\nAmazon Q3 20 Earnings Results:  \n\\- EPS: $12.37 (Estimate: $7.55)  \n\\- Revenue: $96.1B (Estimate: $92.71B)\n\nstock is now 2% down after-market.", "score": 1, "replies": [{"body": "Yeah. Gotta buy AMZN. The adoption rates are maturing. Adopt some $4000 calls", "score": 5, "replies": [{"body": "My target is $3400 for this year, which hit during prime day but since regressed. All my neighbors are constantly getting boxes from amazon. Sometimes daily. It’s out of control.\nI’m adopting your price target for next year.", "score": 1, "replies": []}]}]}]}, {"body": "When it’s priced in it’s priced in", "score": 2, "replies": []}, {"body": "BAN - he’s trying to manipulate", "score": -1, "replies": []}, {"body": "Game of 🔥🥔 from one autist to another", "score": 1, "replies": []}, {"body": "Instead of trading like a poor person. Trade like big money does 😂", "score": 1, "replies": [{"body": "YOLO on TSLA calls?", "score": 1, "replies": [{"body": "Now you’re gettin itttt", "score": 2, "replies": []}]}]}, {"body": "More like you belong in a mental institution ...", "score": 1, "replies": []}, {"body": "Were you around 6 months ago.  I swear it didn't matter how bad the news got market only went up so earnings are going to need to be incredible for people to justify pushing these prices up, let alone holding.", "score": 1, "replies": []}, {"body": "i agree with so much uncertainty things are not gonna be very green im afraid", "score": 1, "replies": []}]}
{"title": "Puts for AAPL tomorrow !!", "selftext": "[removed]", "id": "jkj6bt", "created_utc": 1604006819.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 29, "comments": [{"body": "Nah bro put was for today. Call tomorrow going into the holiday.", "score": 7, "replies": [{"body": "Yeah doesn’t he know Halloween is the biggest holiday for apple products?!", "score": 7, "replies": [{"body": "Too high already!", "score": 1, "replies": []}, {"body": "Nah dude this is a perfect setup to long call into the shopping season. With election behind us in a week I’m expecting people going to go ham shopping and shit. Will also long amazon call as this covid is going will move all the holiday shopping online. Plus amazon and apple do exceptionally well in November and December and early Jan. The 120 C Jan 2020 is a good bet", "score": 1, "replies": [{"body": "Will sell of to new lows great time to buy", "score": 1, "replies": []}]}]}, {"body": "But look at that huge plummet! Putss", "score": 1, "replies": []}]}, {"body": "The puts should have already been placed.", "score": 4, "replies": [{"body": "Whyyy ?", "score": 1, "replies": [{"body": "These companies already have the reports priced in. That’s why we keep seeing a nice downtrend after earnings are announced.", "score": 1, "replies": [{"body": "So more puts then?", "score": 1, "replies": [{"body": " You buy as many puts as your heart desires then use margin. Can’t fail.", "score": 2, "replies": []}]}]}]}, {"body": "Maybe tmr is the best time for put?", "score": 1, "replies": [{"body": "Maybe tomorrow is the day to blow your account, you def belong here... 🌈🌈🐻", "score": 2, "replies": [{"body": "Confirmed. 1000  60p  11/06", "score": 0, "replies": []}, {"body": "Bear too gayyyyyy", "score": 0, "replies": []}]}, {"body": "Today was. I think you might be able to squeeze a few bucks out though with some puts tomorrow but you would have made about 300% more by getting those puts in before market close.", "score": 1, "replies": [{"body": "Wow. But i dont want to make money tho", "score": 1, "replies": [{"body": "Hope u loose it all 🏳️‍🌈🐻", "score": 1, "replies": []}]}]}]}]}, {"body": "Bought 3 puts right before close.  Hopefully it crashes like twitter!", "score": 3, "replies": []}, {"body": "Just give me your money OP, I'd do better in Vegas than your dumbass AAPL puts", "score": 2, "replies": [{"body": "Should I increase my buy to 1000 puts? I dont like winning money tho", "score": 2, "replies": [{"body": "Hell do AAPL $100P 11/06 if you wanna live on the wild side", "score": 1, "replies": [{"body": "90p is the bestttt", "score": 1, "replies": []}, {"body": "This is an option pricing bot. The latest option price is:\n\nTicker|Strike|Bid|Ask|Last Price|% Change|OI\n-|-|-|-|-|-|-\nAAPL|100.0| 0.49| 0.59| 0.49| -55.05%| 3396\n\n\nAAPL 100.0put 11/06/2020 was mentioned 0 times\n[Click to see where](https://www.reddit.com/message/compose/?to=aRecycleAwayAccount&subject=gajbtm7&message=Show me)", "score": 1, "replies": []}]}]}]}, {"body": "Bear too gay. I dont like them", "score": 1, "replies": []}, {"body": "Jump?", "score": 1, "replies": []}, {"body": "Sold calls against my Dec 115 calls. Looking forward to buying them back for pennies!", "score": 1, "replies": [{"body": "Smart!", "score": 1, "replies": []}, {"body": "Sold a shit load of call against my leap aswell lolz the IV was Over 100%", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "jkls3b", "created_utc": 1604015322.0, "score": 16, "upvote_ratio": 0.9, "num_comments": 22, "comments": [{"body": "* Amazon = 1.9% infection rate\n* United States = 2.7% infection rate", "score": 21, "replies": []}, {"body": "It drops to $2300.00 within 10 days after the election - that’s when you buy it up.", "score": 2, "replies": []}, {"body": "How many died? \nHow many got the flu this year? \n\nAlmost like chi flu or wu flu is the new flu that's really just the old flu designed to take away rights of citizens.....but...nah that can't be it.", "score": -2, "replies": []}, {"body": "Who gives a shit about cases. 99.823% of people recover.", "score": -8, "replies": [{"body": "That's not true you pepperoni. The death rate is way higher and there's also possible long term affects.\n\nhttps://coronavirus.jhu.edu/data/mortality\n\nEdit: whoever downvoted me, your mom's a hoe", "score": 1, "replies": [{"body": "Common sense you fucking clown. Unless you’re a fatty or 89 years old this is a nothingburger. We’re going against every fucking plan ever created with shutting down. Can’t believe people are still scared of this shit. I had it and had the sniffles for two days. I know 0 people who have died from the Rona, I do however know 4 people who have either blown their brains out or od’d from shutdown depression.", "score": 2, "replies": [{"body": "Word my dude. 👌👌", "score": 4, "replies": []}, {"body": "Have a snickers jeez. I'm guessing someone's calls didnt print?", "score": 4, "replies": [{"body": "You you right, Sorry got a little hot bro. This thing is making me testy.\n\nI’m mostly cash now though, thanks for checking", "score": 1, "replies": [{"body": "❤", "score": 1, "replies": []}]}]}]}, {"body": "ef\\_jay, you are looking at case fatality rate (cfr) .  There is about 10 cases for every 1 case reported or so. Look up the (ifr) (infected fatality rate) which is approximated to be about .1-.5%, in line is Beto's claim.", "score": 1, "replies": [{"body": "Source?  So far ~0.07% of the *total* US population has already died from covid, so unless 2/3 of the US population has already been infected, a 0.1% IFR is ludicrous.  \n\nAssuming only 1 out of 10 cases has been reported, a total of ~90,000,000 infections have occurred, and if we’re using a straight 10:1, ~30,000,000 are still considered ‘active.’  \n\nSo far 233,000 people have already died from covid, so if *none* of the 30,000,000 active cases go on to die, the *lowest possible* IFR would be .25% (unless new treatments emerge that drastically improve Covid survival for the remaining 73% of the US population that hasn’t yet been infected with the 10% case reporting estimate.", "score": 3, "replies": [{"body": "[https://www.who.int/bulletin/online\\_first/BLT.20.265892.pdf](https://www.who.int/bulletin/online_first/BLT.20.265892.pdf)  .1 to .67,  The problem with IFR though is that it doesn't take into account that you can catch covid more than once (like once every few months depending on how well your bodies keeps antibodies)\n\n.07% dieing is not ludicrous it sounds. For one There is also something called case mortality rate.  (total deaths / (total number of cases both confirmed and unconfirmed )) which is a slightly different calculation and allows for more deaths with a lower IFR. Also  It is very possible 30-50% of the population has already caught covid once.\n\nLol can't believe one of you down voted me for spitting facts.", "score": 1, "replies": [{"body": "That paper is using numbers from different points in the pandemic (early vs recent), different areas of the world (more vs less developed), and different populations (some random, some around outbreak clusters) to reach those estimates.  And if you look at the *actual* mortality numbers (at least in the US) the paper’s numbers, at least on the low end, don’t hold up.  \n\nEven if we use your 10:1 margin of error, already .25% of the 90M  infections in the US have been fatal.  That’s ignoring the up to 30M cases are still ‘active’ (based on 10% diagnosis rate).  It’s also ignoring the covid deaths that were not attributed to covid (75K excess deaths in US from March-July, unknown how many of thes actually due to covid).  Sure, it looks like covid can reinfect at least some people, but by definition the number of patients with reinfection must be <1/2 the number of total infections (it gets muddier if you think a significant number of the deaths have been 2nd or greater reinfections, but I’ve yet to see a report of anyone with a proven 3rd covid infection).  So even if every covid death has been from a 2nd infection (which it hasn’t), that would put the current US IFR at .125%; and that’s ignoring the up to 30M currently unresolved cases, ignoring the >75K excess deaths, and trusting an (in my opinion flawed) study that suggests a 10% diagnosis rate.", "score": 2, "replies": [{"body": "It is not just this study.  There has been many others by the CDC and other countries analogous CDC's.  Or you can get on google scholar and find countless papers using different methods to approximate these sorts of thing. I would not be surprised if in a few years we will have calculate the IFR to .3%+ with a higher degree of certainty. I wasn't claiming that study was the holy grail or anything.  Of course no one knows the true diagnosis rate but most experts would agree its somewhere in the 5-25% range, depending on the different approximations used.  From some very quick googling \n\nhttps://www.nature.com/articles/s41467-020-18272-4  \n[https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)32009-2/fulltext](https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)32009-2/fulltext)", "score": 1, "replies": []}]}]}]}, {"body": "O fuck, I guess I'm retarded. Do you have a source that 10x more people had covid than reported?", "score": 4, "replies": [{"body": "[https://www.who.int/bulletin/online\\_first/BLT.20.265892.pdf](https://www.who.int/bulletin/online_first/BLT.20.265892.pdf)", "score": 2, "replies": []}]}]}, {"body": "Take my upvote", "score": 1, "replies": [{"body": "😘", "score": 0, "replies": []}]}, {"body": "US\tcases 8,856,4. deaths 227,685 death rate 2.6%\n\nThat is a completely acceptable death rate and not something so serious as to keep me from attending a football game.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Why are you screaming", "score": 8, "replies": []}]}, {"body": "#Who cares.. Amazon will drop yes, but not because of the workers that nobody cares about, Amazon will drop because of profit taking and to prepare for a low before the 4th quarter Christmas report..\n\n# So yes, Amazon will drop some, just make sure you buy it up when it gets to $3000 or lower.\n#My target is $2900 - to even $2700\n\n#I've already sold Calls on it so I make money the further Amazon drops, ThetaGang\n\n#this is one of many calls I sold to you all thinking the market will continue up..\n\n\n#https://ibb.co/K9ZsGp2", "score": -2, "replies": []}]}
