{"title": "If a crash is coming, why not sell and re-buy?", "selftext": "It seems like everybody agrees that a crash is coming, but the advice I read is to not sell and to hold for the long run, Bob-style. Why not sell now and buy it back in a bit and still hold for the long run if everything is pointing towards a huge dip? Yes, I know very little about how this works.", "id": "a8w0fm", "created_utc": 1545582921.0, "score": 213, "upvote_ratio": 0.87, "num_comments": 184, "comments": [{"body": "Making money on a crash requires being right at least twice: knowing when to sell and knowing when to buy.\n\nWhat happens if you sell now and then the market goes up 10%? Buy back in? Or wait for it to drop again?\n\nAnd if it drops, when would you buy back in? When it drops 20%? 30%? 50%? What happens if you set a target and it's never hit? You could sell right now, the market could drop 20%, then recover before you decide to buy back in.", "score": 175, "replies": [{"body": "This is a losing strategy as you have clearly articulated. The trick is take to small percentages unless you have a clear signal that's confirmed by multiple signals.\n\n0.5% compounding gains successfully over 15 trades is equivalent to ~~11% or so~~ 7.78%.\n\nEdit: Made it more clear that I was talking about compounding interest, and fixed the math... This is why you shouldn't math in your head while making trades. :)", "score": 29, "replies": [{"body": "How can you say .5% gains over 15 trades is close to 11%? ", "score": 4, "replies": [{"body": "100*1.005^15 = 107.76, so closer to 7.76% gains.", "score": 2, "replies": []}]}]}, {"body": "Ugh! Who's got a chart showing how the comments below me cut the floor out, much like the current SP-500, as soon as someone brought government ideas up?? ", "score": 1, "replies": []}, {"body": "you only need to sell higher than you buy back in. If I had stocks currently I'd wait for a dead cat bounce and sell into it. then wait probably a year or so in cash.", "score": 1, "replies": []}, {"body": "You're too jumpy. You don't have to make so many moves. You just have to look at the world situation and ask your self, are things getting better, or are they about to get worse?\n\nI've been sitting on cash since the inauguration, and I'm feeling like a genius right now. And I don't want to hear any of this \"you missed the run-up in 2017\". No, I didn't. I am ahead now. \n\nThe secret of timing the market is patience. You can see train coming, way off in the distance, there is no need to wait until it gets closer, just get off the tracks now.  It has been obvious for years Trump was going to reverse Obama's prosperity, and there has been no hint, no clue, that anything else could possibly happen. Anybody who didn't see this, and still doesn't see it, is in for a bumpy ride.", "score": -30, "replies": [{"body": ">I've been sitting on cash since the inauguration, and I'm feeling like a genius right now. And I don't want to hear any of this \"you missed the run-up in 2017\". No, I didn't. I am ahead now.\n\nYou are not ahead if you've been sitting on cash since the inauguration. The stock market is still up 7% since then and inflation has chewed away at your cash 2% annually. ", "score": 38, "replies": [{"body": "Nope! Your logic only applies if I owned index funds. I owned FNMA, LVS, GE, and a few more. The last time I checked, my previous holdings are about $30,000 below my exit point two years ago. I didn't miss anything except the stress and aggravation of watching your hard-earned money evaporate.", "score": -32, "replies": [{"body": "So the lesson is you choose bad stocks?", "score": 35, "replies": []}, {"body": "> I didn't miss anything except the stress and aggravation of watching your hard-earned money evaporate.\n\nTechnically these are paper losses for most people. Furthermore, you have missed a large amount of dividends. \n\nOne stock I bought has given up every paper gain but has paid me a 7% dividend. That industrial firm isn't going anywhere. ", "score": 2, "replies": [{"body": "I don't know, I hope you are right honestly. I don't want other people to lose money. I just think it's inevitable, based on the state of the world.  I hope a recovery happens quickly, and it doesn't take very long for everybody's stocks to recover.\n\nDuring the tech boom, I owned stock in Sun Microsystems, and it shot up to over 100, then when it crashed, it went all the way down to nothing. Same with Netscape. A couple of my biggest winners dwindled to nothing. But I managed to keep some of the money. I sold about half of the SUNW near the top, and then lost the rest. I learned some important lessons in the last few market crashes I have lived through. Like, I wouldn't want to be holding FB right now.", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "Is that the thing you really want most of all? Do you want me to be wrong, and embarrassed about it? Because that is not a clear-headed attitude, and you need to be clear-headed if you are playing the market right now. Well, merry Christmas to you. We will see who wins in the end.", "score": -14, "replies": []}]}, {"body": "[deleted]", "score": -41, "replies": [{"body": "Are you a fucking idiot or did you forget the /s?", "score": 17, "replies": [{"body": "It's a 16-day old account with no karma, probably Russian.", "score": 10, "replies": [{"body": "Possible, not enough data to determine.\n\nSuspect though. \n\nhttps://snoopsnoo.com/u/brodudedoggman", "score": 1, "replies": []}]}, {"body": "Yes", "score": 4, "replies": []}]}, {"body": "> Obama was a socialist \n\nSocialist, noun. Term unilaterally redefined by Trumpers to mean anything they want. \n\nSecond, socialism isn't inherently good or bad, and somethings should be socialized and somethings should not. For instance, the police should be socialized because offering the protection of the law based on capacity to pay is essentially an autocratic  plutocracy that strips the poor of their rights. The military should be socialized because relying on PMCs strips the nation of its moral obligation and responsibilities of the use of force and those it sends into conflict, thereby allowing for very capricious use of state violence in a manner that is divested from society. \n\nNow should the state run a pasta factory? No. But the notion that socialism is always  bad is idiotic.\n\nMost illegals don't come across the border outside of a checkpoint. Most came legally and overstayed their visa. A wall does nothing to stop that. \n\nWant to tell me how Obama made race relations worse? Oh Russian troll?\n\nAnd we need unskilled migrants. There are billions of dollars worth of agricultural products that have, are, or will rot because there is no one to pick them. That is an effective tax cut by keeping food production costs low. And these same migrants are giving their most productive years of their life to OUR economy. We did not need to pay for their education, their childhood medical costs, etc, but we do get their labor in a kind of exploitative way. ", "score": 2, "replies": []}, {"body": "Right.  Of course, obama made race relations hostile.  Not fox news, or right wing media that more and more continues to embrace nazi ideals.  Obama is black afterall, how dare he be president.\n\nAlso hilarious that you declare how bad obama was for race relations, then immediately made an ignorant racist statement.  \n\n\n\n", "score": 3, "replies": [{"body": "[deleted]", "score": -10, "replies": [{"body": "Actually illegal immigrants have a harder time getting hold of benefits in the US and legal immigrants use less benefits than people born in the USA. Immigrants actually provide a net gain to benefits since they put more in than they take out. \n\nBut let trump tell you they are all rapists and murderers so we can take 5b out to spend on a useless wall you fucking moron (or likely troll). ", "score": 3, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Net gain you muppet of course they use those services. And how many languages do you speak? Second generation immigrants are fluent the majority of the time and also contribute to society. It’s not like your country is struggling for money when you give trillions in tax cuts to the super wealthy. ", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "If you need to compete with Spanish speakers to get jobs in the US then you can blame republicans for education cuts.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Maybe you should learn to read English first because you obviously don’t have the ability to read my comment.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Hey well down for that you must be proud of all your hard work being borne in the US!", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Freeloading on your ancestors and being ‘proud’. Hey once again good work for being born in America!", "score": 1, "replies": []}]}]}, {"body": "This says everything I need to know about you. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "How can anybody be this delusional. ", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 276, "replies": [{"body": "The other day, one of my co-workers (who has always been timid about investing since he was working during '07 and '08, has historically opted to stay in cash and stockpile food like he's expecting a nuclear Holocaust next week, and just this year started to dip a toe back in and contributed to his 401(k)) said to me \"Man, the market is bad. Glad I just moved everything to bonds.\"\n\nPeeked over my cube and said \"Oh shit, you retiring soon?!\"\n\nHe said \"Nah, but equities are horrible right now.\"\n\nSo...You started buying into a long term index fund just before one of the biggest drops in the last decade...and sold everything on the way down to ensure you lost on what you bought.\n\nKay.", "score": 97, "replies": [{"body": "This is what most retail investors do though. They don't understand. You should try to help him and explain he should just put everything into the S&P (or if not put everything into HYG or JNK if he wants bonds...). Tell him not to sell anything. They will never know and never thank you but you will help whoever his children are for you taking 5 mins to do that. ;)", "score": 24, "replies": []}, {"body": "In fairness, there's still a lot more room for stocks to drop and most analysts are predicting it will continue to do so into January. ", "score": 28, "replies": [{"body": "Which means dollar cost averaging into that drop will help you lower average cost basis and give you more shares to ride the market back up when it does bounce back (whenever that may be). Peter Lynch famously stated that more money is lost waiting for a correction than in the correction itself, so unless you've got a short term need then historically 'buy and hold' has been successful over the long term.", "score": 10, "replies": []}, {"body": "most analysts can suck a fat space dick and then gag for ten minutes before finally recovering", "score": 30, "replies": [{"body": "Oh sorry, I thought this was a subreddit where we discussed the stock market. ", "score": 70, "replies": [{"body": "I speak jive and can translate.  What they mean is that the analysts mostly can't predict anything until it is already happening.", "score": 39, "replies": []}]}, {"body": "what's a space dick", "score": 12, "replies": [{"body": "Dude. You don’t want to find out. r/spacedicks is a place for the brave. And, the stupid. Those poor fools. ", "score": 4, "replies": []}]}]}]}, {"body": "If you had told this to himself, that would have been real good karma", "score": 1, "replies": []}]}, {"body": "Bought the dip, and the dip dipped.", "score": 15, "replies": [{"body": "When I dip you dip we dip", "score": 27, "replies": [{"body": "You put your hand upon my hip ", "score": 5, "replies": [{"body": "And hold your cash real tight.  \nBut it's the dead cat bounce  \nThat really drives you insa-ya-yaaaane.  \nLet's crash the markets agaaaaaiiiiinn.", "score": 3, "replies": []}]}]}]}, {"body": "Sell when prices are high and your bonds-to-stock ratio is lower. 50-50 bonds-stocks is target.  (Bonds can also be taken to mean long term savings here). If in a given month or quarter, stocks begin to overtake your bond/long term cash assets in your portfolio, sell off a portion of your stocks to rebalance. Likewise if stocks are low, buy stocks to rebalance.\nKeeping half of your assets in cash, CD’s, high grade bonds, high interest savings accounts, etc., is simply a hedge against risk the stock market presents year-to-year. Friends who keep a higher percentage of their assets in stocks likely have a tougher time Years where price levels suddenly dip.", "score": 2, "replies": []}]}, {"body": "Because no one knows if a crash is coming. If you knew a crash was coming 100%, there would be much more aggressive plays than selling and rebuying later. ", "score": 222, "replies": [{"body": "If it was a sure thing, then everybody would have sold, and that means the crash would already be over", "score": 3, "replies": []}, {"body": "we know a crash will come. simple physics. inflated asset markets by a cancerous fiat system tryin to play tricks on physics. we just don't know when.  \n\nI am actually thinking about a short ETF.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": []}, {"body": "[deleted]", "score": -14, "replies": [{"body": "Let them downvote you, but I agree. Sold all my stocks in November. Double top and clear this is going to be bad after years of QE. Many people prefer to close their eyes I guess.", "score": -8, "replies": [{"body": "Me too, sold everything in July. I got stung once by a parabolic run. People can say whatever they want, but when they say you can’t time the market I say bull mother fucken shit.\n\nTo the average maybe undereducated, or people who don’t seek out knowledge the way I do, then yes better not try to time the market. But for me I’ve done enough reading and researching and studying charts, I’m confident my calls are better than willy nilly buy n hold bs. ", "score": -21, "replies": [{"body": "I'm curious though why you'd expose yourself to extra risk when 'buy and hold' has been shown to be successful long term. If you look back to March 2009 when the market officially bottomed out after 2008 we saw a rally of almost 30% in the following few weeks, followed by a selloff due to fears of a \"double dip\" crash only to rally again. When getting timing wrong once or twice opens you up to significant loss in potential total return why risk it, especially when volatility is so high.\n\nI'd be curious what you did at the start of 2016 when we had ~6 weeks of declines and everyone was shouting about the bull run coming to an end only for us to have double digit returns in 16 and 17, from which you'd still be up if you held through the most recent dip.", "score": 4, "replies": [{"body": "I'm torn on this topic. On most things, I'm on the side that you can do more than is typically believed. But with the market it really seems to be impossible to time. You will get survivorship bias in the form of these guys who say they timed everything perfectly, but just as many people who \"knew\" what they were doing got it wrong, and you won't hear from them on reddit because its not as fun to talk about how much you blew it.\n\nI sat on a lot of cash for a long time because my entire financially-aware life has taken place near an \"all time high.\" I missed tons of gains. I'm tired of it. I've been buying in (and going red) all year. I'm getting it over with. At least now I can know I'm not going in at a peak.", "score": 4, "replies": [{"body": "If your time horizon is long then today's highs will be next decades lows. A good read that really hit home for me early on was this anecdote about [Bob, the worst market timer ever](https://awealthofcommonsense.com/2014/02/worlds-worst-market-timer/).", "score": 5, "replies": []}, {"body": "I actually use to preach this to my friends/family. ‘You can’t time the market etc’. But what I’ve seen as of late I have changed my mind.", "score": 1, "replies": []}]}]}, {"body": "Lol", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I don’t know if it’s intentional brainwash per se, but I do believe buy n hold is probably best for most people.\n\n", "score": 1, "replies": []}]}]}]}, {"body": "I’m a trump supporter and still think it’s going to happen on his watch.\n\nHe can’t control the fed raising rates. Unless he fire Powell. And if he did, the market would go down also.\n\nCest la vie\n\nSo I assume I’m being downvoted because folks want another recession?", "score": -24, "replies": [{"body": "Self proclaimed dipshit more like.\n\nWe have an impending debt crisis with various economic issues and a fucking idiot paving the way. Assets are fully priced, interest rates were near 0. Anyone with half a brain and any real investor who has studied really any debt crisis in the past saw this coming.\n\nEven people who aren't idiots like you were coming out in the past few months and telling you assets were fully priced (Dalio, JPM), Dalio even wrote a book this summer on it that you could have read, but I bet you were busy watching Fox and Friends lmao. Hell if you even paid attention to the hedgefund that got your dipshit hero elected (Renaissance) you could have seen this coming, they anticipated this as well as Feb correction.\n\nIt must be easy being such a stupid person. I envy you.", "score": 12, "replies": [{"body": "I already read Dalios ebook and sold at the top in August.\n\nWaiting to hit bottom to get back in, but prices are right right now.", "score": -4, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Wow, someone got on the wrong side of the bed today.\n\nMade 120% riding the wave up.\n\nI should have reversed and played the short in September but didn’t.\n\nCrap.\n\nBtw. Calling people names won’t make your penis larger.", "score": -2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Please buy more cryptos. I can't wait for the day that you won't be able to afford your internet bill.", "score": 2, "replies": []}]}]}]}, {"body": "My puts are up 700% it was kinda obvious a correction was coming lol", "score": -13, "replies": []}]}, {"body": "Why not just continue to buy and bring your cost average down? Speaking for long term investors. ", "score": 59, "replies": [{"body": "I’m buying as much as I can right now and all the way down every month. I don’t have to worry about timing shit. ", "score": 14, "replies": [{"body": "I'm not quite sure I understand this... What happens if the market continues to slide? 20%? 30%? 40%? When is the breaking point that you start losing far more than your risk tolerance?", "score": 1, "replies": [{"body": "it cant go like that cause a drop similar to that would mean all is 0.000007$", "score": 1, "replies": []}, {"body": "Thats the thing, though. You have faith in the US economy or else you have a lot more to worry about than your losses", "score": 1, "replies": []}]}]}, {"body": "The hard part is knowing when to buy to average down.  IE. AAPL was at $235 at its peak.  It dropped and held for a bit a $215, $200, $170, etc.  Its now at \\~$153.  Would you have bought every dip?  Is this the last dip?  Its impossible to know.  Sometimes it is better to cut your losses than get bloody hands catching knives. Even for long term investments its quit a hit going from $235 to $153 and take years to recover....all the while that money could've been making a nice 1-3% on risk free bonds. \n\n&#x200B;\n\nOn a side note I think smart money is saying AAPL bottom is \\~$140, we'll see if that holds.", "score": 14, "replies": [{"body": ">\tsmart money is saying AAPL bottom is ~$140\n\nAnd who exactly is smart money? And where did they say this?", "score": 9, "replies": [{"body": "As the old saying goes, money talks  \n\n\nSmart money talks about bottoms", "score": 2, "replies": []}]}]}, {"body": "Or just buy once and sell ATM calls", "score": 6, "replies": []}, {"body": "Taxes.", "score": 1, "replies": []}]}, {"body": "Here’s the thing: “Everyone believes the market is crashing” is a false statement. There is a vocal minority expressing that point but you’d be surprised how much money isn’t worried and is just buying as it goes down.\n\nThe vocal minority is usually a poor indicator of market trends. Humans are innately more risk averse than opportunistic, so the vocal minority is always saying that stocks are going to drop.\n\nWhen the market is doing well it is overbought. When it starts to go down a recession is coming. At the bottom of 2008s recession it was that fundamentals of the capitalistic world were changing and stocks will never recover. It was a new era. They will always tell you it’s going down.\n\nThe sad part is that on the whole they are always wrong.", "score": 88, "replies": [{"body": "I have to admit, I'm still waiting to be wrong. Please? Pleeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeese  \n\n\n  \nAlso, have we forgotten that further slide was prevented by TARP? How come we keep ignoring that fact so willfully? TARP bolstered the stock market with $700B in liquidity. I don't think it's a trivial thing we should keep ignoring.", "score": -2, "replies": [{"body": "You need to get out of stocks. This 20% drop is trivial. I’ve lost over $50k in a few weeks and it doesn’t even bother me. It’s no big deal. If you are freaking out this much then you have no chance of being a non emotional investor. Put your money in a savings account or money market fund.", "score": -1, "replies": [{"body": "this drop is more of a correction, this year stocks were in the clouds", "score": 0, "replies": []}, {"body": "It is trivial, and luckily my entire portfolio is currently up 12.5%. Come back to me when you've experienced 200% drops in an hour.", "score": 0, "replies": []}]}]}]}, {"body": "In all my long 25 years of life Im pretty sure I have heard someone say that the stock market is going to crash pretty much every single year. The moment the major indexes take a small hit everyone starts screaming recession. There very well could be a big problem headed our way or this could all just be a bump in the road, nobody really knows ", "score": 19, "replies": [{"body": "It’s good for biz on CNBC and the Democrats want a crash so they can blame Trump.   If you visit Drudge Report and CNBC’s websites you’re going to think the end of the world is near.  They stoke fear to make money.  ", "score": 2, "replies": [{"body": "It's much more about confirmation bias than Democrats wanting to \"CRASH AT ALL COSTS\".\n\nThe Liberals have been saying that the stock markets all decline under Republican Presidents, and they want to be proven correct. This does not mean they want the stock market to crash just so that Republicans have a black eye, that would be ridiculous. It's ridiculous because they have made no ACTIONS to 'crash' the market, they are just commenting on it and stoking fears.\n\nIf you start to see them taking actions to willfully crash the market, like doing an Audit of the Federal Reserve, THEN you can start spouting non-sense about Democrats \"crashing the market\".", "score": 3, "replies": []}, {"body": "Try turning off fox, Breitbart etc. It's not healthy to watch lies.", "score": 6, "replies": [{"body": "I can’t watch the 24/7 slam trump fake news networks.  I know liberals outnumber conservatives 10:1 on reddit and that I’m wasting my time.  ", "score": -8, "replies": [{"body": "You need to stop thinking about the opposition, and more about what's sound and solid decision making. If the only reason you are making the decisions, ONE WAY OR ANOTHER, is because someone else says their opinions on it, you need to check if that's what is real and is worth while.  \n\n\nMain Stream Media does not know partisanship. It knows Main Stream. If you are watching Fox, MSNBC, CNN, CNBC, it doesn't fucking matter. They are all MSM. They all spout lies.  \n\n\nListen to local sources. Seek out local journalists that you trust. That doesn't mean you should completely ignore news like Fox and MSNBC, but take it all with a grain of salt.", "score": 2, "replies": []}, {"body": "Get the political bullshit out of here, neither side is honest and the only way you’re going to get decent news is through non partisan companies ", "score": 1, "replies": []}]}]}, {"body": "Quit your conjecture, ie- “Dems want a crash..”", "score": 0, "replies": []}]}, {"body": "Yeah I watch the DJIA index on CNBC live and watch the people in the live chat scream for a recession. These people panic like you couldnt believe. Meanwhile, Im losing $300-500 on red days and not worrying one bit. Why? Because Im getting really cheap prices for amazing companies. Im building up my arsenal and when things turn around, I'll be in the money", "score": 0, "replies": []}]}, {"body": "I know this is a debated topic. If you look to the short term, trying to time the market is dodgy. If you are looking to the long term, buying on dips and re evaluating your portfolio is a normal process. It's true you can't time the market, but you can see the writing on the wall. I approach it as I don't know if this is the bottom, but I do know that a stock I watch is down 40% from aths. Should I buy in? I might. If the stock continues to fall I might buy a bit more to adjust my position. I don't know why this strategy seems so negative here. Its how you can grow your portfolio and try to take advantage when the markets are down.\n\nOne thing I did do this year was during the summer when stocks were an all time high, I sold off about 50% of my position. Which is something I do not normally do. There was no way those gains this year were sustainable in any healthy market. It's not that difficult to see the writing on the wall. I don't look at it like \"timing the market\" but more of re evaluating my position.", "score": 19, "replies": [{"body": "Edit:  I’m bad at reading, never mind.\n\nThe stock market hit all times highs 96 separate times since 2016.  If selling off half your assets is something you “normally do” given such a condition you must have taken out what, like 1/1000 of a penny out of the market this summer?\n", "score": 2, "replies": [{"body": "Yea I don't sell every time there is a large gain. My point is there is nothing wrong with adjusting your position. If a stock you have is up 100+% and you would like to pull some of those gains and put them into another stock that you feel is undervalued or grow an existing position then go ahead. It's what long term investors do. There is this pervasive empty mantra \"don't time the market\" on this sub that doesn't fit every situation or investors goal.", "score": 8, "replies": [{"body": "I missed the the not part of the do not, apologies.", "score": 1, "replies": [{"body": "All good!", "score": 1, "replies": []}]}]}, {"body": "They said it was something they \"normal did not do\".", "score": 2, "replies": [{"body": "Ahhh, I’m dumb, lol.  ", "score": 1, "replies": []}]}]}]}, {"body": "\"Everybody feels like a crash is coming\" isn't sufficiently rigorous analysis to take action on. ", "score": 17, "replies": []}, {"body": "Taxes", "score": 26, "replies": [{"body": "And missed dividends ", "score": 8, "replies": [{"body": "You should be happy to miss out on dividends.\n\nDividends cause a part of your investment to be immediately taxed, rather than taxed after compound growth. Best case it's the same as selling. In some countries, tax rates on dividends are much higher than on capital gains. Getting a dividend is a net loss in those countries.", "score": 0, "replies": [{"body": "That’s incredibly stupid. ", "score": 1, "replies": [{"body": "?", "score": 1, "replies": []}]}]}]}]}, {"body": "There is a reason it is called catching the falling knife. ", "score": 7, "replies": []}, {"body": "Most investors believe that it is impossible to time the market.  No one is able to forecast when/if the market will crash.  Historical data shows that if you hold your positions through a market crash you will end up with positive gains over the long run.  \n\nHowever many investors would also suggest increasing your positions during a crash in hopes of getting securities at a discount when compared to the future values of the security \n\nTl;DR if you're investing for the long-run dont try and time the market ", "score": 7, "replies": []}, {"body": "Let’s answer this in the same way most questions are answered at their root...\n\nIf this is bottom, buy more so you make money when it goes up.\n\nIf this isn’t bottom, sell and wait until bottom.\n\nIf you can’t tell if it is bottom, congratulations, you’re in good company. People that say it’s bottom have about as much evidence as people who say it’s not. In the end, stocks are fickle creatures. All evidence could point at this being a bottom, until the most random event (war, assassination, bankruptcy, even an accidental algorithm trader bot going nuts) causes stocks to drop. \n\nThe best advice I have is: no one knows what will happen. Anyone who says they do, is either purely guessing, lying, trying to sell you something, or a combination of those. ", "score": 7, "replies": []}, {"body": "Going to crash? It already happened.", "score": 5, "replies": [{"body": "The markets definitely taken a hit, but it hasn't crashed...", "score": 1, "replies": [{"body": "NFLX was $400 now it’s $250. AMZN was $2000 now it’s $1350. NVDA is down 50%...\n\nKO and PG and all the other defensive bullshit is only down 10%, but those can never hope to make 10% in a year anyways. They are the only reason the markets aren’t all down 25%. \n\nIt’s crashed, the damage is done. The VIX closes above 30 on Friday, signaling capitulation. And, everyone on this thread is asking about selling because the future seems like stocks will never go up again. That is another signal that the computers are about to buy. \n\nDo NOT sell right now, you will be a pig to the slaughter.", "score": 7, "replies": []}]}]}, {"body": "Everyone, the opportunity to sell was a few weeks ago. If you sell now, when it bounces back, you will miss it. Or, you will buy back on an up day and it’ll drop right back down and you’ll get hosed. Just put your head down and ride it out. That’s the only option at this point.", "score": 5, "replies": [{"body": "Yep.  Just be diversified and don’t look at the market everyday.  Don’t let -3% down days ruin your day, it always comes back.   ", "score": 2, "replies": []}]}, {"body": "Because people don’t have crystal balls.\n\nRemember Feb 2016? The markets took a little dip and everybody in REDDIT was screaming “MASSIVE CORRECTION COMING!”\n\nWhat happened? The markets went on a complete rampage for several years. 😂 \n\nI’m expecting the same to happen. I’m not liquidating any of my positions and I’m just adding dividends and cash regularly. People who try to time the market rarely outperform my portfolio, but the vocal minority in Reddit preach to know the direction of the markets. \n\nVigorous dip, followed by more market euphoria. ", "score": 14, "replies": [{"body": "several years=2....", "score": 1, "replies": []}]}, {"body": "Timing the market like that is harder than it sounds.", "score": 7, "replies": []}, {"body": "It's a brilliant play if you have a crystal ball.", "score": 3, "replies": []}, {"body": "[removed]", "score": 10, "replies": [{"body": "So you believe Uber/Lyft et al who have announced IPO in 2019 and sudddenly just cutting this from the table? or they will launch in arguably the worst time of the decade...TLDR its not so obvious that we are heading to a crash..right..now", "score": 1, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Then you absolutely made the correct decision! One of the few that sold amidst the volatility for the right reasons. \n\nPeople with long time horizons (5+ years) should just be adding more to their positions as the market goes down. \n\nEveryone wants to be a market timer in these times. But it’s legitimately possible we get a 25% “recovery” in the next few months. It’s also completely possible that it tanks another 25% instead. For those of us without a crystal ball, it’s time to buy and hold. ", "score": 5, "replies": []}]}, {"body": "Sooo many other variables here", "score": 1, "replies": []}]}]}, {"body": "The catch-22 is that analysts try and predict what investors are doing, then investors are doing what analysts are predicting about themselves.", "score": 2, "replies": []}, {"body": "Why not sell and buy puts if your forecasting a sell off?", "score": 2, "replies": []}, {"body": "The crash is already here, buy some now and some if you can get a good deal lower.", "score": 2, "replies": []}, {"body": "The problem is figuring out if it is really coming?", "score": 2, "replies": []}, {"body": "Because nobody can predict when the crash will actually occur", "score": 2, "replies": []}, {"body": "Because we could be at the bottom now. \n\nIf you wanted to sell, selling in early October would've been the time. At this point, it could bounce back next week and you'd end up paying more for stocks then you anticipated. \n\nAlso, if everyone thought the same thing then the market would surely crash. ", "score": 2, "replies": []}, {"body": "Although it’s true that no one knows where the market is going to go in the near term, it’s also true that the macroeconomic fundamentals suggest that we are nearing the end of this growth cycle (jobs growth monetary policy and corporate borrowing).  There is still room for consumer borrowing to increase as it has been fairly conservative since the last crisis, but I feel like the rate hikes and generally high asset prices are likely to discourage this.  All said this dip seems a little premature relative to the actual economy, and I’d be surprised if we didn’t see a bounce and some growth before the actual end of this expansion cycle and the subsequent contraction.  I think the best time to transition into a defensive stance was back in September, but at this point it’s probably best to wait for the bounce.  There’s a lot of opinion here sure, but if you’re willing to put in some study time, you definitely can use fundamentals to help you do better than the “index and forget about it” strategy.", "score": 2, "replies": []}, {"body": "The commonly told story is that we can’t time the market.  The reality is that we absolutely can, especially in times like these where big funds take weeks and maybe months unwinding positions that are no longer profitable.  If funds are leaving a space en masse out of a sector of the economy then you can usually get out before they do.  Right now they are reducing their exposure to FAANG stocks because growth expectations in that sector and in the larger economy are being revised much lower which has already resulted in some losses with more to come. ", "score": 3, "replies": [{"body": "If u can consistently time the market feel free to post results in this sub", "score": 15, "replies": [{"body": "crazy that these billionaires come down from their thrones to tell us how dumb we are", "score": 18, "replies": []}, {"body": "Funny how they never show us how they are able to do it huh?", "score": 13, "replies": [{"body": "When they do, it's always some simple formula based on a couple of variables that merely happened to line up with market changes over a certain period, but which won't in the future. But when given the choice between believing you're smarter than everyone else and believing you were just lucky, guess which one most people choose?", "score": 7, "replies": []}]}, {"body": "There was only way the market could have possibly reacted to the recent fed news, regardless of what that news was going to be.  Sentiment towards 4 raises next year was negative.  Not doing the December raise would have spooked the market considerably after the prior 2 months of losses.  Raising now and hinting at reducing to 2-3 next year was a smart move, but continuing to raise rates is going to slow growth considerably so it’s still negative.  They made the best move possible and you still could have predicted in advance that the market would react with a sell off.  You’re telling me it’s impossible to time that?  You have been indoctrinated into the idea that no one can know what markets are going to do so just keep throwing money in no matter the price.  Keep making your regular purchases, Wall Street needs people like you to buy what they are dumping. ", "score": -6, "replies": []}]}]}, {"body": "This huge crash my spring back with fury to overtake the October highs upon January earnings season if things aren't looking anywhere as gloomy as what's in the media. Only insiders with corporate profit knowledge know what's going on day by day in the economy. I was reading that the permanent corporate tax cuts are way more than making up for the bite out profits that the tariffs are taking. The globe is still growing and a good clip and will supposedly stay that way for a bit... no one knows. There could be a trade deal secured until 2020 to see how China behaves. Just some pros to think about!\n\n&#x200B;\n\nWhen will you buy back in?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "Thats whats going on  as well as a combination of other things.  ", "score": 1, "replies": []}, {"body": "How do people feel the market with be on Christmas Eve? Looking for a good opportunity to buy some ETFs such as MGC, XLF, BIP, and FENY. All at a 52 week low. Not sure if I should wait until January or purchase on Christmas Eve or before New year. Also, will be purchasing more shares to cover some loses with my currently owned stocks such as BAC, T, CITI, BX, and MU. Any advise for a beginner investor? Happy Holidays to all! ", "score": 1, "replies": []}, {"body": "Because you don't know if a crash is coming.  In fact, most professional traders use non-professional buy/sell actions as indicators for when the market peaks or bottoms.", "score": 1, "replies": []}, {"body": "Short and re-buy*", "score": 1, "replies": []}, {"body": "Depends do you follow the market constantly? Or are you looking long term? I day trade for a living so my answer may not suit your investing style. I never hold stocks much longer than a few hours or a couple days. But in my retirement accounts I don't worry about the drop cause I'm looking 40+ years down the road. So it can really depend.", "score": 1, "replies": []}, {"body": "just avoid the IRS washsale rules that create unfavorable tax consequences if you repurchase of substantially identical property w/in  30 days before or 30 days after the sale (the \"61 day period\")", "score": 1, "replies": []}, {"body": "Timing the market is incredibly difficult. If we're all honest, we have no idea what will happen in the short term. We do however know where the market will go in the long term. Up. It's better to have an allocation of your money invested in equities. For example, you might decide that a 70% allocation to equities suits you. When the market goes up, you regularly rebalance your portfolio and sell some shares to maintain the 70% allocation (if the market has gone up then equities will represent greater than 70%). Vice versa if the market falls. Some investors also use a \"dynamic\" allocation where the percentage of their money that they have invested depends on their sentiment about the market. When they're feeling that things are a little over heated they might reduce to 50%. After a bear market, they might then increase to 90% invested. It is folly to be ALL IN or ALL OUT. ", "score": 1, "replies": []}, {"body": "It is not true that everyone thinks a crash is coming.", "score": 1, "replies": []}, {"body": "Because you shouldn't sell. You should buy more at the dip. That way your tied up money isn't sold at a loss and can rebound, and you can take advantage of an eventual bull market with the newly bought shares. You've essentially doubled youre return, or more,  by doing so. ", "score": 1, "replies": []}, {"body": "If you can predict the next crash then please PM me your secret, Nostradomus. ", "score": 1, "replies": []}, {"body": "I went all cash earlier in the year.", "score": 1, "replies": [{"body": "I went to all cash in November. Although I sold off most of my leveraged positions near the beginning of the year", "score": 1, "replies": [{"body": "When do we go back in? ", "score": 1, "replies": []}]}]}, {"body": "It's quite funny, go back a few months and anyone saying a crash was coming was chastised on Reddit. \n\nYet now we've had a decent sized dip in the market, it seems all those people have flipped flopped, and now position themselves as having known for ages that a crash was coming.\n\nThese people also tend to parrot the same lines of \"don't try to time the market\", \"smarter people than you have failed\", \"Warren says keep buying\". Many are destined to be bag holders.", "score": 1, "replies": []}, {"body": "The truth is, no body knows. The market tomorrow could gain 3 percent, and again tomorrow. Or it could fall.", "score": 1, "replies": [{"body": "Anything can happen, but the probabilities/risks change depending on market conditions ", "score": 2, "replies": [{"body": "What do you mean when you say that \"probabilities\" change? ", "score": 1, "replies": [{"body": "If the market is stagnating or bad for a year there’s a higher chance it will be the next year. You can look at historical prices to prove it", "score": 0, "replies": []}]}]}]}, {"body": "A lot of market participants think that way, and that's one key reason stocks have a sustained drawdown. The thing is that at some point you run out of sellers. If you can know that the bottom is further away, you should sell and buy later. \n\nBut as WB said, what the wise man does in the beginning, the fools do in the end. \n", "score": 1, "replies": []}, {"body": "You have your answer in your title : \"If\". If not ?", "score": 1, "replies": []}, {"body": "Many people are in denial until they are stuck so bad that the only way they break even is to hold and highbrow the bull traps. Sometimes people wait for a bounce that doesnt come. Some cant cut losses. Even if someone does sell top they often get caught in countless bull traps. The markets greatest catalysts are greed and fear so its a cyclical series of human traps.", "score": 1, "replies": []}, {"body": "Any comment here that is saying to buy more during the dip is also trying to time the market. Be consistent ", "score": 1, "replies": []}, {"body": "You could, but you have to be mad patient to have any hope of making money. ", "score": 1, "replies": []}, {"body": "This was correct in September. Too late to sell", "score": 1, "replies": []}, {"body": "As everyone in here has said if you do it right, sure, you'll make a ton -> but if you can do it right you wouldn't be here asking about it unless you just got really lucky.  \n\nI wrote my financial adviser back in June about my looming fears of this based on a few trends that I had read about here and there.  He wasn't sold on it and maybe I would have been right to move money then and perhaps buy back now, would have limited losses for sure, but had I done that I would also likely try to time for the perfect buy back and miss.  If a fiduciary is all about holding tight I trust them over my limited knowledge.", "score": 1, "replies": []}, {"body": "The problem with trying to time the market is that you may be waiting awhile to get a better entry point if things go back up, which seems to be getting closer to the case each passing day. Why not wait for a green day to sell into? Even bear markets have green days.\n\nIf you are a long term investor, dollar cost averaging on the way down seems to be a winning strategy", "score": 1, "replies": []}, {"body": "I sold a few months ago (not at at all time high at all) and stocks are becoming affordable now in my opinion so it might come to bite you in the ass if you sell now.\n\nThe easiest thing is always to hold.", "score": 1, "replies": []}, {"body": "It’s smart to pay attention to where you are in a cycle and act accordingly. We were late cycle bull market, and now probably the start of a bear. Bears last about 2 years, so I’m selling into rallies for at least the next year.", "score": 1, "replies": []}, {"body": "All that selling that's been happening is not the mom and pop individual investor. It's the full time professionals. The very same guys who tell mom and pop to just \"ride it out\" and \"you'll  be fine\" are making adjustments, and raising cash.", "score": 1, "replies": []}, {"body": "If you were not good enough to call the top, then you won’t be good enough to call the bottom.", "score": 1, "replies": []}, {"body": "Find a financial planner", "score": 0, "replies": []}, {"body": "My puts are up 700% it was kinda obvious a correction was coming.", "score": -1, "replies": []}, {"body": "because if you lost 50%, you need 100% to break-even.\n\nEx: $1 stock, drops 50% to 0.50 cents. You sell to get your 50 cents and buy again at 50 cents. Now you need 100% to get back to $1.\n\nSo your best bet is to average down and keep DCA'ing until the recovery.", "score": -1, "replies": [{"body": "I think the OP is talking about selling now while it is at $1 and waiting for the market to drop another 10%-20% and then repurchase at $0.80-.90.", "score": 1, "replies": [{"body": "Yep that works if you are certain that a bounce will occur at 0.80 - 0.90. If it keeps dropping from there then the amount of % you need to breakeven will be much larger. Hence why in my original post I used a basic example using the same re-entry point for demonstration purposes.\n", "score": 1, "replies": []}]}, {"body": "What in the world do you even think you’re talking about?  Selling and buying at the exact same price?  That’s what you think the OP is asking about?  And also, you say “now you need 100%...”.  No, in the scenario you described you already needed 100% because you didn’t even change the number.  ", "score": 1, "replies": [{"body": "that was an example sir, calm your tits.", "score": 0, "replies": []}, {"body": "He's right though. If you lost 50% and sold then you need 100% to breakeven. That's basic math.\n\nNow apply the same concept to what OP is asking. If $1 drops to $0.50 and sell at $0.50 then the stock keeps dropping to $0.30, why not buy at $0.30? well that is only if you are certain that $0.30 is the bottom and that is the rebound point. If it keeps dropping from $0.30 downward then you will have a much greater loss and much more needed % to reach break-even. \n\nThis is why there are studies out there that Dollar Cost Averaging is best during bear markets rather than selling and re-buying.\n\nIt will be a different story if you have the crystal ball, then by all means go ahead and sell and re-buy.", "score": -1, "replies": [{"body": "If you can’t even make it to the end of a post as short as mine, why are you responding?  Read the last sentence of what I said, and then let me know if you still think you have something to add. ", "score": 0, "replies": [{"body": "I think you still completely missed the point lol...\n\nHappy Holidays and good luck out there.", "score": 1, "replies": []}]}]}]}]}, {"body": "dam i thought last week was a crash\n", "score": 0, "replies": [{"body": "Right!  We’ve been crashing for three months now and people keep saying “there’s a crash coming”.   ", "score": 0, "replies": []}]}, {"body": "Not really a crash coming just more volatility and the rest of the correction.  That’s why...though it would have been smart to sell at the start of 2018 and short all throughout then buy back in at the end of 2018, which a lot of people did actually. ", "score": 0, "replies": []}, {"body": "If everybody 'sees' a crash coming (hearing that for 3 years at least), then there is no crash coming. We will have a correction though. \nIf (and if) a market crash comes, then we're all really scre*** as the hedges will go first, then selling more stable investments to cover the costs, then the lay-offs start to ramp up (they are already) and then we're on to a financial crisis, with little to no bail-out and a crashing quality and food situation along with it.\nA Minsky moment can happen, but there is no escape anyway for that if it happens.\nI always think of the market as going on and recovering, changing from time to time. I believe central banking and nation-thinking needs to go, but eitther way, the market will go on, and re-buying is the same as bottom-seeking. Good luck with that.\nIf something is 100$ now (a stock for example) and you sell it now (probably at a mild loss already seen the last week), then you re-buy ... ok? When? At 80$ 50? 10$? or 0.04$ on the OTC market? Only very good TA people can attempt at putting a number on that and re-buying.\n\nYou make your money on the buying part, not on the selling and re-buying part. There are bots and A.I's doing that far, far faster than you.", "score": 0, "replies": []}, {"body": "I did. I sold at high, and bought penny stocks at lows. \n\nI figure when it crashes people will leave former outdated investments (like GE), and move towards new ones (hemp penny stocks).\n\nWith so many problems, I think that we will see a ton of OTC stuff hit major markets in the new year. No one wants to spend right now. ", "score": 0, "replies": []}, {"body": "Sell 10%-30% now, if it goes down, you will profit. If it goes up you are still invested.", "score": 0, "replies": [{"body": "This is literally exactly what I did.  ", "score": 0, "replies": []}]}, {"body": "Have you ever tried to catch a falling knife? ", "score": 0, "replies": []}, {"body": "Do it lol\n\n\nThat's why ", "score": 0, "replies": []}, {"body": "Hi, I'm a bitcoin holder , i didnt sell at 20k but hodld, even when it crashed to 12k and then to 6k i hodld. Even then i hodld and it crashed to 3k.\n\n\nLets say i had 1 bitcoin. I still have 1 bitcoin but am down 17k on theoretical value.\n\nIf i sold at 20k and and bought back in at 3k i would have had nearly 7 btc now.\n\nBut i hodld. \n\n\nThe only right thing to do if everything is pointing to a crash is to sell and slowly buy back in for the next months/years because its hard to predict a bottom.\n\nBut the stock market graph looks exactly like the bitcoin graph before it came down crashing. ", "score": 0, "replies": []}, {"body": "Exactly", "score": 0, "replies": []}, {"body": "I'm just going to leave [this](https://cdn.shopify.com/s/files/1/0746/2561/files/losers_averga_losers_photo_large.jpg?13823445432066106562) here.\n\n&#x200B;\n\n [https://cdn.shopify.com/s/files/1/0746/2561/files/losers\\_averga\\_losers\\_photo\\_large.jpg?13823445432066106562](https://cdn.shopify.com/s/files/1/0746/2561/files/losers_averga_losers_photo_large.jpg?13823445432066106562)\n\n&#x200B;\n\n&#x200B;", "score": -1, "replies": [{"body": "Paul Tudor Jones, he's going to crush it this time.", "score": 2, "replies": []}]}, {"body": "Market will fix itself when (1) Trade agreement signed with China, (2) Fed stop rising interest rate, (3) Trump gets his border wall funding.", "score": -1, "replies": []}]}
{"title": "Friendly reminder: declining market not the same as recession", "selftext": "I felt the need to post this since I keep seeing a lot of comments equating this market decline to a recession.\n\nA recession is defined as two or more consecutive quarters of negative GDP growth. Check out this site and play around with the chart to get a feel of how GDP growth has been changing: https://tradingeconomics.com/united-states/gdp-growth\n\n(I suggest you change the chart parameters to 10 years and select \"columns\" instead of \"line\")\n\nA market decline could be a predictor of a future recession so I'm not arguing against that. Let's just be careful about our rhetoric around the term \"recession\" and not confuse economic terminology please. There are a lot of people new to stocks and investing here, we don't want to send the wrong message. \n\nThat is all, thanks, good luck to everyone!\n\nEdit: GDP data from the St. Louis Fed:\nhttps://fred.stlouisfed.org/series/A191RL1Q225SBEA#0\n\n", "id": "a8wnz1", "created_utc": 1545587355.0, "score": 371, "upvote_ratio": 0.93, "num_comments": 108, "comments": [{"body": "100% thank you for clearing this up.\n\nI do wonder though if a stock market crash can anyway become a catalyst for a recession or start one with its negative sentiment and massive brokerage drawdowns which discourage people from buying more and have them saving instead.", "score": 72, "replies": [{"body": "I thought about this, the whole psychology of a declining stock market could lead to people tightening their budgets and spending less, leading to a contraction in GDP. Since consumption is roughly 70% of total GDP then it could be a major driver. If people take the stock market decline as a signal to watch their spending then it could be a catalyst toward a recession. It would take a lot though. ", "score": 21, "replies": [{"body": ">It would take a lot though. \n\nPlaying devil's advocate; but I wouldn't be so sure of that. Media has a way of spinning things way out of proportion, and control. And as we saw during the election, the media isn't only being controlled by 'friendly powers'. If I was Putin and Zi, I'd be rolling out the propaganda guns and driving the US into a recession based on this.", "score": 5, "replies": [{"body": "As much as we should guard against that, the Russian propaganda had 1/20th of the outreach over the whole election cycle as popular pundits had in 1 month. I'm substantially more concerned with the \"if it bleeds, it reads\" nature of legitimate media causing negative sentiment. All that said, as long as unemployment is low and wages are up as they are, I'm not particularly worried.", "score": 3, "replies": []}]}, {"body": "Man most of my friends and family don't own stocks and they just contribute to ETFs or mutual funds every month and rarely care/notice if there's a big dip or jump in the stock market.  I think it's tough to accept the possibility that a decline int he stock market would cause a dip in consumer spending. ", "score": 2, "replies": [{"body": "Maybe among your family this is the case but not among the masses. There is a well established economic phenomenon called the wealth effect whereby if people's wealth goes down, their spending goes down.\n\nhttps://en.m.wikipedia.org/wiki/Wealth_effect", "score": 1, "replies": []}]}]}, {"body": "There have been 3 recession-less bear markets in history. 2 of which were pre-1950s and third in ‘87 iirc\n\nI don’t think there are any instances of a bear market *causing* a recession, only coinciding with one. \n\nThat being said, even in recessions, consumer discretionary spending (which I believe you are referring to) typically decreases by less than 5%. It’s business spending that decreases and I think business will be less sensitive to negative sentiment. I don’t think the narrative you’re suggesting will play out to great effect. \n\nMore than anything, i think this current deep correction (I’m still shy of calling it a bear market) is caused by the high level of fear we’re getting in the headlines today, making a noticeable dent on sentiment but not affecting the underlying market fundamentals. ", "score": 11, "replies": [{"body": "Before 87 you could actually earn interest with cash in a bank. Today households have their wealth wrapped up in a house and financial instruments. The average investor isn't timing the market so if they are losing value every month they are going to tighten spending", "score": 5, "replies": []}]}, {"body": "I would suggest:  definitely.", "score": 1, "replies": []}, {"body": "I thought about this also; A self fulfilled prophecy.", "score": 1, "replies": []}, {"body": "It depends on the reasons for the drop in the stock market. Usually it’s the underlying numbers which cause both a recession and a drop in the market.  ", "score": 1, "replies": []}, {"body": "Correlation,  not causation. The drivers behind the stock market correction are primarily interest rate increases and the effects of the tariff war. These factors will also lead to a recession, so basically the market is pricing in the future expectations.", "score": 1, "replies": []}, {"body": "Once this market goes down I'm sure a recession will follow. According to George Soros, markets reflect fundamentals and fundamentals reflect markets. ", "score": 1, "replies": []}, {"body": "Realistically probably not but technically yes. If you mean stocks get overvalued and then correct too sharply causing a recession, that's unlikely, but the financial markets could get so out of hand that the economy is now propped up by it. For the former, look at the dot-com bubble. There was a recession after the crash but the consensus seems to be that it did not by itself cause a recession and it was also not a notable recession. For the latter, look at the 2008 recession. The housing market was in a crazy bubble because markets continued buying the debt so banks continued loaning recklessly. When the delinquencies started, the financial and housing markets crashed taking everything with it. ", "score": 1, "replies": []}]}, {"body": "Powell seemed very optimistic about the current and future state of the economy, so unless there’s something hiding in the background that these economists didn’t notice, I see this as a big burn off after a long ass bull market. They gotta end sometime ", "score": 23, "replies": [{"body": "Are you really under the assumption that Powell or anyone else ever announces a recession? Optimism always precedes a recession. ", "score": 30, "replies": [{"body": "[Larry Kudlow Dec, 2007 - There Ain’t No Recession](https://www.nationalreview.com/kudlows-money-politics/kudlow-101-there-aint-no-recession-larry-kudlow/) ", "score": 14, "replies": []}, {"body": "I see your point, but I think euphoria is a more accurate descriptor (per John Templeton). \n\nI have seen little optimism and certainly not euphoria. I really don’t see this being a full blown bear market, just a heavy correction or a minor bear market, similar in character but not magnitude to the 1987 one ", "score": 3, "replies": [{"body": "Count the amount of Robinhood ads you see this week", "score": 2, "replies": []}]}]}, {"body": "Just wondering, if he DID see a problem, would he come outright and say it? ", "score": 6, "replies": [{"body": "BINGO!\n\nJust like Greenspan keeping mum whilest in charge, but making more forceful statements lately. ", "score": 5, "replies": [{"body": "He warned of irrational exuberance in 1996 with four more years of bull market to run. Didn’t exactly keep mum and certainly was wrong. He’s not the person I would listen to. ", "score": 2, "replies": [{"body": "Are you suggesting there was no IE during the dot-com boom?\n\nHe has no skin in the game now. No reason to mince words. \n\nhttps://www.cnbc.com/2018/12/18/alan-greenspan-has-a-new-warning-for-investors-when-markets-turn-run-for-cover.html", "score": 1, "replies": [{"body": "There was, of course. But if you got out when he was warning of it, you would have missed four years of a massive bull market. His forecasting was bad and if you would have listened, detrimental. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[removed]", "score": 23, "replies": [{"body": "Thanks, I also read OP's post. ", "score": 11, "replies": [{"body": "The market is not the economy. Can’t you see?", "score": 3, "replies": []}]}]}, {"body": "I’m laughing so hard at all of the people screaming recession.\n\nSo many retail traders and investors are going to get left in the dust as the market starts to rip again in January. \n\nEdit: I’ve gotten some PM’s. My portfolio is 99% stock with 1% cash and I’m positioned entirely defensive. Bring on the blood of that’s the case. 😂 ", "score": 40, "replies": [{"body": "And why would it do that?", "score": 20, "replies": [{"body": "Many reasons... \n\n1.  The Fed announces that it will hold off on any more rate hikes in the near future.\n\n2.  US and China reach a deal on ending the tariff dispute.\n\n3.  Earnings announcements start coming in better than expected.\n\n\nEdit: For clarification I’m not saying these things will happen in a month... He asked why it would do that and I gave reasons. Not a prediction.", "score": 33, "replies": [{"body": "RemindMe! 1 Month to comment on the RIPPING of the January market", "score": 54, "replies": [{"body": "I will be messaging you on [**2020-01-01 22:11:28 UTC**](http://www.wolframalpha.com/input/?i=2020-01-01 22:11:28 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/a8wnz1/friendly_reminder_declining_market_not_the_same/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/a8wnz1/friendly_reminder_declining_market_not_the_same/]%0A%0ARemindMe!  1 Month to comment on the RIPPING of the January market) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! ecf2tuo)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 5, "replies": [{"body": "Yeh thats not a month, thats a year...", "score": 16, "replies": [{"body": "Oh no, its Y2.019K! Invest in bottled water companies STAT boys", "score": 3, "replies": [{"body": "RemindMe! 20 days can you do that bot?he reminded me a year later :/", "score": 3, "replies": []}]}]}]}]}, {"body": "1.\tFed has already basically announced they are holding off hikes unless data supports it. The market reacted negatively not because Powell said hikes will be done, but because they also expected the monthly quantitive tightening to be fully stopped as well . \n2.\tChinese deal is just noise if you think about it. Chinese deal would be a short term dead cat bounce as you wouldn’t expect a great deal but rather something minimal at this point. The issues with China is complex and will go into the next administration. \n3.\tyou can report good earning, but if 2019 full year guidance shows any slowdown that’s what’s already given expect multiples to contract. Remember q3 earning no company gave 2019 guidance yet and the majority didn’t guide down+ express optimism. \n4.\t55% of the gains 2017-2018 were on the backs of fangman. If the majority of those names are no longer exponential growth stories, but rather plateauing or slower growth then who takes leadership of the market to push it to new highs? Apple? Googl? Amazon ? Facebook? Netflix? \n5.\tbank of Japan and Europe are ending their qe so where is the extra buying of us asset going to come from if we’re no longer providing free money either? \n6.\tNo one has been buying because your buy the dippers already bought Apple at 200 back in October then 180 in December. They’re investors and bag holders now. These people mentally have been had to deal with this. \n7.\tfiscal policy is used up there’s very little left for trump to stimulate the economy. \n8.\tPotential layoffs are high. Noting several companies started offering severance/ early retirement packages to their workers. Example Verizon offering 44k employees to leave. Gm laying off 16k. AT&T has been laying off and is expected to increase with merger wrapping up. Ford has he talks of restructuring and shedding as well. \n8.\tif earning is okay I would expect a bear flag/ dead cat bounce for the first half of the year, but nothing to gush about. ", "score": 6, "replies": []}, {"body": "It's not the hikes driving the tightening,  it's the qe withdrawal. 4 trillion of fed liquidity drove the market up,  and its removal is now pushing the market down. As long as the fed shrinks its balance sheet the market will fall. All the other stuff is at the periphery here.", "score": 4, "replies": []}, {"body": "1. Is expected so that won’t change much \n2. That won’t happen because China has the Belt and Road Initiative. They will reach 70% of the world’s population through 90 countries.  They won’t need us and they can afford to play the long game, our politics won’t allow because we don’t like to be confused with the facts over here. \n3. Earnings can be great and still stocks will drop. It’s been happening for weeks.  ", "score": 8, "replies": [{"body": "It's because most companies have projected they're far less optimistic about their own futures during those same earnings reports.", "score": 4, "replies": [{"body": "Aka guidance ", "score": 1, "replies": [{"body": "Yep. Being on target this quarter won't be so impressive since they've already walked themselves back.\n\nThey need to slam it out of the park to turn this market around.", "score": 2, "replies": []}]}]}, {"body": "On point 2. I actually think China will make a deal with the US. How substantial that deal will be is in question. But in truth if Xi can convince his side that giving the US some concessions and opening up the market is a net positive for China (which based on what I've read it would be), and on the US side, Trump can brag that he's finally gotten a fair deal from China, both parties win. Yes, there's still a lot of fundamental difference between the two, but, both get to walk away with a \"Win\" which they both need right now. One more than the other, but, you take a guess which is which.\n\n&#x200B;\n\nOn point 3, I think some people don't (or can't?) realize this. Some companies have reported earnings ranging from good, to stellar, and yet, have still taken a huge hit and are down for the year. It's hard for me to imagine \"good\" earnings from Amazon, and \"Ok\" earnings from apple, would change much in the way of sentiment in the market now. Companies would have the CRUSH earnings and raise guidance in order to possibly make a change", "score": 2, "replies": []}, {"body": "Wtf is that 70% of the population buying?\n\nAwesome you built trade routes to dirt poor countries that aren't huge consumers.  ", "score": 2, "replies": [{"body": "I'm under the assumption that we consume most world products the way we consume steak.", "score": 2, "replies": []}]}, {"body": "Seems like someone's selling a lot of bad call options and making a ton of money.", "score": 2, "replies": [{"body": "How can a bad call option make you money? ", "score": 1, "replies": [{"body": "You are the asshole that knows the market is going to keep going down. You keep putting out calls like it's going to go back up.\n\nYes I know it can go up, I'm just saying if you were aware it was going to continue dropping.", "score": 1, "replies": [{"body": "Acerbic response.  And friend, no harshness needed.  I know the market is headed further south and I sell deep ITM calls against my positions to average down AND make profit at the same time.  I’m not misleading anyone. Good day to you and I can verify that I’m an asshole because I’m told this quite often. Apparently, when everyone says it, it must be true.", "score": 1, "replies": [{"body": "Hey that's the game and I support it. I'll be buying puts if it looks right next week.\n\nI'm sure you are an asshole. I'm sure they deserve it.", "score": 1, "replies": []}]}]}]}]}, {"body": "It took the US decades to reap the benefits of its post-WW2 power projection to build the sphere of influence it has today.\n\nYou're thinking of entirely different time frames. Belt and Road allows China to pillage resources and hold hostage developing countries in the near term, much like former Western imperialism, and gives them the long term benefit of having markets in the middle classes that form in those countries. However that long term benefit is decades off.\n\nIn the near term, China still needs the US to buy more shit, or we'll move manufacturing to more favorable locations like Vietnam or India.\n\nI think our trade war is run by morons, so I don't expect a deal favorable at all to the US. But it's in both nations' interest to have a deal. Xi needs to keep growth numbers up or his house of cards will fall. Despite what Western media likes to tell us about anti-American zealots, younger generations in China are more than aware of the benefits of liberalization.", "score": 1, "replies": []}]}, {"body": "or the opposite.\n\nSpeculative either way. \n\nOne thing companies don't like is uncertainty, and this administration has uncertainty as certain as Loompaland has Snozzwangers.", "score": 2, "replies": []}, {"body": "But the turning point IMO is going to be earnings reports. \n\nBecause everything is assumptions till then, then we go \"Oh that's how things are really going.\"\n\n&#x200B;\n\nGreat points.\n\n&#x200B;\n\n&#x200B;", "score": 1, "replies": []}, {"body": "1) that would be seen as trump pressuring the fed into doing what he wants. And markets would react negayively.\n2) Nothing points to that happening unless Trump backs down\n", "score": -3, "replies": []}, {"body": "1.Already announced a more dovish tone, market dropped 5%\n2. Trump has already kicked that can so many times...\n3. Believable", "score": -2, "replies": []}]}]}, {"body": "\"Put simply, the extraordinary and experimental policies of quantitative easing and zero interest rates have not been “good” except in the myopic sense of encouraging a short-term burst of very bad choices and misallocations of capital. While it’s unfortunately necessary to tolerate cartoonish rants on CNBC about a potential Fed “policy error” as it normalizes interest rates, the fact is that the policy error is way, way behind us, and the Fed already made it.\n\nThe financial markets have already experienced years of aggressive yield-seeking speculation, record valuation extremes, and eager issuance of new “product” – in the form of covenant lite debt and leveraged loans – to satisfy the need of investors to “earn something greater than zero.” Now all we have is an unfortunate situation. With the total capitalization of U.S. corporate equities recently pushing $40 trillion, I continue to expect that $20 trillion or more of what investors count as “wealth” will vanish over the completion of this cycle.\" \n\n- John Hussman, [Bubbles and Hot Potatoes](https://www.hussmanfunds.com/comment/mc181128/)", "score": 8, "replies": [{"body": "Spot on.  You can’t make predictions and forecasts of GDP growth when you changed the game plan now with no more free money as part of the calculus.  The talking heads are all in a panic; they just don’t understand why this is happening.  It’s pretty clear to me.  Raising the rates mean the party is over.  I’ll bet my bottom the next 18 months will be in the toilet.  ", "score": 3, "replies": [{"body": "What are your positions?", "score": 2, "replies": [{"body": "Quite a few.  Why?", "score": 1, "replies": [{"body": "Well you said you'd bet your bottom dollar that the next 18 months will be in the toilet. I just wanted to know what positions you had taken to prepare in case I agree with you.", "score": 1, "replies": [{"body": "I have an old fashioned position; cash. Only 33% because I have such step losses it makes no sense to sell atm. Call me crazy but WGO looks like it has bottomed. AVGO has held up well during this tumult. My biggest play is selling calls weekly against positions.  My returns were >26% this way.  This down turn will just cause me to take longer to get to where I’m going.  GL to u!", "score": 3, "replies": [{"body": "Thanks for the input!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Insightful quote, thanks for your contribution ", "score": 3, "replies": []}, {"body": "Not to knock his opinion/predictions, but I was curious, so I took a quick glance at his mutual fund returns over the last several years, and they've done horribly compared to simply index investing. I guess he's supposed to keep you from going down as much in a recession, but what's the point if your 'growth' fund returns -5% annualized since 2008. And the expense ratio for his international fund is 2%. Geeze...", "score": 2, "replies": []}]}, {"body": "I’m laughing at this. \n\nYes, a stock market decline is not the same as a recession. And yes, a stock market decline doesn’t always presage a recession. \n\nBut does any of that mean this market is going to rip higher? Based on what? We’re still overvalued. The blood won’t stop until there’s some stability out of Washington. ", "score": 3, "replies": []}, {"body": "RemindMe! 2 months", "score": 2, "replies": []}, {"body": "Lol yeah the market is gonna rip up while the Fed/ECB/BOJ normalize their balance sheets.      /s", "score": 1, "replies": []}, {"body": "You don’t know jack shit. Just like the others calling for red.\n\nSmart traders / institutions already know earnings are at all time highs, China / us dispute is calming down, and rate hikes are going to happen 1-2 times next year and the market is still dropping", "score": 1, "replies": [{"body": ">You don’t know jack shit. Just like the others calling for red.\n>\n>Smart traders / institutions already know earnings are at all time highs, China / us dispute is calming down\n\n\nYa. Until Trump opens his mouth again.", "score": 2, "replies": []}]}, {"body": "If you don’t think there is a recession coming, why do you have a defensive portfolio?", "score": 0, "replies": []}, {"body": "I'll be laughing hard if the market goes down 50% and doesn't recover  for 30 years like Japan 😂", "score": -6, "replies": [{"body": "This might be the pettiest shit I’ve ever read. Biggest meltdown in market history, likely leading to a worldwide financial collapse which then lasts FOR AN ENTIRE GENERATION, and you’ll be laughing because some dude on Reddit made a prediction?", "score": 2, "replies": [{"body": "I wasn't serious, just making a point that he shouldn't be so confident in the market.", "score": 3, "replies": []}, {"body": "At least *someone* will be happy ;)", "score": 1, "replies": []}]}]}]}, {"body": "RemindMe! 1 week", "score": 3, "replies": []}, {"body": "By the time a recession is formally announced the market has already capitulated and began its recovery.", "score": 3, "replies": []}, {"body": "The market going down is usually a predecessor for a recession. So, we could see a recession next year or not. I'm probably sell where I'm green and sit on cash and see where the market goes. Rather take some profit than nothing at all. ", "score": 10, "replies": [{"body": "> The market going down is usually a predecessor for a recession\n\nThis isnt true at all. Markets heat up and cool off constantly. In mid 2015, the DJI lost around 10%. There was no recession imminent at the time", "score": 19, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "But it doesnt change the fact that \"markets going down\" is usually a precursor of a recession", "score": 6, "replies": [{"body": "I see, but from your comment it sounded like the market was just cooling off for no reason during that 2015 decline even though there was a reason for the Dow decline. My bad for misunderstanding but me and you seems to be on the same page. ", "score": 1, "replies": []}]}]}]}, {"body": "Need to break the bull market uptrend line for that to happen.  A pullback down to a more reasonable growth rate is healthy it's not a bear market.", "score": 2, "replies": []}]}, {"body": "One thing I would add to this: what's different about this selloff than the 2008 selloff? Unemployment is lower, and trending lower.\nThe recession of 2008 was characterized by massive layoffs and a decrease in purchasing power. We're not seeing that now, people still have jobs and the ability to spend money on consumer products. Whether they start tightening their belts or not is yet to be seen. \nhttps://tradingeconomics.com/united-states/unemployment-rate\n", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I would highly doubt it takes longer to build back up because the recovery from the last recession was the longest ever experienced. ", "score": 3, "replies": []}]}, {"body": "What’s different is the underlying cause. One was systemic problems in the market. This appears to be an overpriced market for an uncertain time in international politics. ", "score": 1, "replies": []}]}, {"body": "thanks for clearing up the technicalities, but i think most people are just acknowledging that the market isn’t far very well and that it might continue to sell off for a bit. ", "score": 2, "replies": []}, {"body": "Economy is still breaking records ", "score": 2, "replies": []}, {"body": "Declining market or a plain old market correction? ", "score": 2, "replies": []}, {"body": "This sub reddit is propaganda ", "score": 3, "replies": []}, {"body": "Remind me! 1 month", "score": 1, "replies": []}, {"body": "The definition is slowly morphing as cultural norms change the meaning of a once defined word. Much like people talking about tarmac at airports when tarmac is a material like asphalt or concrete not a location. Actually airports dont even have tarmac anymore. ", "score": 1, "replies": [{"body": "Good example. I still think it's important to differentiate between \"the market\" and \"the economy\" hence why I felt the need to post this. A recession is associated with the economy. It is an economic term. In my economics classes we talked about the economy: output, money supply, employment, etc. In my finance classes we talked about the market: valuation, fundamentals, etc. \n\nWe need to be careful not to conflate the two. Diluting the definition of words is dangerous. ", "score": 6, "replies": []}]}, {"body": "The fed is a more reliable website to get GDP and other economic data. ", "score": 1, "replies": [{"body": "OK here you go:\nhttps://fred.stlouisfed.org/series/A191RL1Q225SBEA#0\n\nSame data. ", "score": 2, "replies": []}]}, {"body": "To add to that, and I think I’ve this in another few threads cause people keep saying recession, but the 2 negative GDP growths are a lagging indicator. So by the time we’ve recorded 2 negative growths, it’s already too late. All we can hope to speculate on is the stock market acting as a leading indicator for a recession (and possibly many other leading and coincident indicators.)", "score": 1, "replies": []}, {"body": "RemindMe! 1 week", "score": 1, "replies": []}, {"body": "RemindMe! 1 month", "score": 1, "replies": []}, {"body": "Absolutely. However, it would be foolish to think there is no correlation between the two.", "score": 1, "replies": []}, {"body": "Stock market can crash well before recession official declared. \n\nThe credit crunch can happen for a while before macro data to catch up, but due to bad credit condition, investors and corproates will urgently need to stacking up cash. stocks price will head lower by ppl and corproate unloading shares for cash to maintain their operations.\n\nThere are few crash in the history did happen well before recession or depression started. ", "score": 1, "replies": []}, {"body": "You mean it's not the end of the world!? I do really appreciate these drops, though. Allows me to pick up additional holdings while retail idiots are running for the exits.", "score": 1, "replies": []}, {"body": "OP, I agree with you 100% and thank you for the reminder.  We all need to remember that and a few other things as well.  For example, we don’t know where the DOW would be if QE never happened and we don’t know if the current GDP forecast is built on QE reality that doesn’t exist anymore.  To me, this is exactly why the market is down; everyone is thinking there is no way things are as good as we think they are. We’re headed south.  I have no doubts and I think it’s for at least 18 months. ", "score": 1, "replies": []}, {"body": "Also, the earnings potential or *value* of companies didn't fall __%--simply the *price* to buy a piece of the companies did.", "score": 1, "replies": []}, {"body": "If people don't understand this without someone posting on reddit, they deserve to lose, and lose a lot.", "score": 1, "replies": []}, {"body": "Someone make sure to post this in wallstreebets", "score": 1, "replies": []}, {"body": "Just because it's not labeled a \"recession\" until it's -30% or whatever, 2 quarters negative GDP growth etc, doesn't mean it's not already IN ONE while it's happening. It's labeled after the fact. Don't say it's not a recession because you don't know!", "score": 1, "replies": []}, {"body": "How bout now bud", "score": 1, "replies": [{"body": "Still not a recession. Market down? Yes it is. Not a recession though.", "score": 1, "replies": [{"body": "The fed is just getting stared!", "score": 0, "replies": [{"body": "Agreed, it might get bad, no argument from me on that. ", "score": 2, "replies": []}]}]}]}, {"body": "Okay thanks", "score": -1, "replies": []}]}
