{"title": "What is everyone’s favourite non-tech stocks at the moment?", "selftext": " I’m kinda tech heavy right now with apple, nvdia, alphabet, and a few more, and would like to get more into other sectors. Anything but tech right now. ", "id": "a2jtbx", "created_utc": 1543801599.0, "score": 182, "upvote_ratio": 0.96, "num_comments": 195, "comments": [{"body": "BRK.B, BAC, C, CVS, DIS, JNJ, MA, PG, V, WM\n\nEDIT: COST", "score": 46, "replies": [{"body": "BRK.B all the way.", "score": 7, "replies": []}, {"body": "Almost the same as mine - I've JPM instead of BAC and AWK instead of WM ", "score": 1, "replies": []}]}, {"body": "WM\n", "score": 70, "replies": [{"body": "I'm a big fan of waste companies.  I like republic more though.  More sustainability pushes and automation investment", "score": 12, "replies": [{"body": "> I like republic more though.  More sustainability pushes and automation investment\n\nwhat's republic?", "score": 5, "replies": [{"body": "RSG", "score": 11, "replies": [{"body": "> RSG\n\nwhat is this? ", "score": 1, "replies": [{"body": "> RSG\n\n[Republic Services, Inc (RSG)](https://finance.yahoo.com/quote/rsg?ltr=1)", "score": 1, "replies": []}]}]}]}, {"body": "As a customer, I switched to Republic Services because there were a few things they accepted for recycling that WM didn't. Just one guy's opinion though.", "score": 3, "replies": [{"body": "As a customer I switched away from Republic because they screwed up my billing and charged me for fixing their screw up and then wanted to charge me again. Just one guy's opinion, though.", "score": 2, "replies": []}]}]}, {"body": "Solid Stock ", "score": 4, "replies": []}, {"body": "I own it,  love it, but I'm thinking of selling if it gets to $95. I think valuation might be too rich the closer it gets to $100, and I'd rather be too soon than too late.", "score": 1, "replies": []}]}, {"body": "I like banks right now so I’m in XLF (financial ETF) , I like Disney so I own them too. XLF I think is relatively cheap whereas Disney might be at the high end of their range for the next few months.", "score": 52, "replies": [{"body": "Are banks a good investment in the event of a market down turn?", "score": 11, "replies": [{"body": "No, but they are typically one of the quickest to rebound out of a recession historically. That said so many regulatory changes and requirements placed on banks, especially large ones, should mean they are in a much better situation to handle economic downturns. \n\nThe amount of work that goes into bank stress tests is pretty insane from firsthand experience. ", "score": 11, "replies": [{"body": "Haven't those requirements been relaxed or eliminated by the current Congress?", "score": 3, "replies": [{"body": "Only for small to mid size banks where the requirements were absolute overkill. These massive players like JPM BAC same as usual. Most mid sized banks are still keeping most of what they were doing stress test wise in place but may just perform the tests to a lesser extent. ", "score": 1, "replies": []}]}]}, {"body": "That’s assuming we are in an economic downturn. I don’t think we are so I’m betting rates will rise (2-3 hikes next year) and we will continue to grow at a good rate.", "score": 3, "replies": [{"body": ">That’s assuming we are in an economic downturn. I don’t think we are so I’m betting rates will rise (2-3 hikes next year) and we will continue to grow at a good rate.\n\nbut if  fed rates  raise, won't it be bad for econmy?", "score": 1, "replies": [{"body": "No, it can effect our economy in either which way. But in my opinion, short term interest rates have been low for a long time. And I think rising rates is a good thing for the economy, it may slow down initial spending. But people will also start saving more (hopefully). It will probably slow down growth, but I think the trade-off is stability. I think its good for the long term. There are a lot of other variables at play that I didn't discuss (dollar, commodities, etc.) nor fully understand. But they all play their part in one way or another. I just trade what happens, and try to guess on direction as much. This is just a simple option traders ad hoc opinion, doesn't mean shit.", "score": 1, "replies": [{"body": "But we don’t want people to save money, we want them to give it to our corporations.", "score": 1, "replies": []}]}]}]}]}, {"body": "Agreed US banks look very cheap right now. I might buy some jpm or bac. I have some bank of Nova Scotia in Canada. ", "score": 15, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Be careful, Canada does have a large dividend withholding tax. ", "score": 5, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "The published rate is 25%, the effective rate is 15% due to tax treaty ", "score": 2, "replies": []}]}, {"body": "Your comment led me onto a google and wiki search trying to understand withholding tax - but I don't entirely comprehend what I read. Could you give me an example with numbers explaining dividend withholding tax?", "score": 2, "replies": [{"body": "It’s pretty simple. Many other countries are going to tax you on dividends you receive from companies that aren’t based in your home country. Canada, for example, usually takes 25% off the top of all the dividend income you receive from Canadian companies. If you live in the US, that rate is only 15%. Regardless,  you still won’t be getting the advertised dividend amount. You can technically write this taxed amount off on your U.S. taxes when it’s time to file, and in some cases even be given a credit. There are some ways around this, but if you use Robinhood, unfortunately none of them are supported. ", "score": 3, "replies": [{"body": "I think I understand - I always thought that capital gains and dividends fell under unrealized income and were either not taxed or taxed much lighter than income. \n\nSo in the example you provided, would an American investing in Canadian companies be taxed less than a Canadian investing in Canadian companies? Would Canada still tax a Canadian's investment dividends from American companies?", "score": 0, "replies": [{"body": "I think it would depend on the Canadian’s income. Canadians aren’t subject to the same withholding tax as foreign investors. Their tax rate would only be determined by their level of income. Yes, technically Canadians would be liable for tax on their American dividend income due to Canadian income tax. However, if they are like the US, any US taxes they pay on that dividend income could offset the Canadian taxes they would be liable for. I’m not sure if Canada does that as I am only familiar with Americans buying Canadian companies, but I’m almost certain they do. ", "score": 1, "replies": []}]}]}]}, {"body": "Just hold it in a TFSA. If you can. ", "score": 0, "replies": [{"body": "If the person had a tfsa, it would imply they are in Canada & investing as a Canadian resident, which therefore means they are not subject to the 25% withholding tax that US residents would be subject to when holding Cdn stock.    The only people who are subject to the US withholding tax on Cdn company dividends are US residents, & they don’t have TFSAs .   Your comment doesn’t really make sense.  ", "score": 2, "replies": []}]}]}]}, {"body": "Don’t try to pick individual banks. Even warren Buffett owns like 5 different bank stocks. Buy a sector etf. ", "score": 2, "replies": []}, {"body": ">Agreed US banks look very cheap right now. I might buy some jpm or bac. I have some bank of Nova Scotia in Canada.\n\nin case of recessions  banks go down", "score": 1, "replies": []}]}, {"body": "Ehh I think I disagree with them being in high end of their range, I think we’ll see a breakout out from the 110-117 range like Starbucks and Nike both did that were range bound like Dis has been the last 2-3 years, hoping we see that sooner rather than later but there are big things on the horizon for DIS, solid long term hold ", "score": 2, "replies": [{"body": "I definitely agree we will see a breakout. I just don’t think it will be until Q1 2019 or later. I think people are concerned about logistics of the DIS FOX deal and where the extra assets are going. Once the details are ironed out and everyone sees how much of a powerhouse this streaming service will be is when the breakout will occur.\n\nI’m long the stock and don’t plan on selling it, but if we don’t see that breakout in the next few weeks there might be a buying opportunity for people to enter at a lower price.", "score": 2, "replies": []}]}]}, {"body": "PEGI - Renewable energy (wind)\n\nTERP - Solar panels\n\nO - Triple net lease real estate\n\n", "score": 39, "replies": [{"body": "Why do you choose TERP instead of BEP? Isn't BEP safer because it's bigger and they own most of TERP? Still learning here :)", "score": 13, "replies": [{"body": "BAM owns a lot of TERP I believe.\n\nBEP, BAM, TERP are all good picks IMHO", "score": 9, "replies": [{"body": "Ah yeah BAM might be what I was thinking of! What would be the reason of buying TERP instead of BAM? I don't understand why I wouldn't want to choose the larger, safer company instead.", "score": 2, "replies": [{"body": "You said it.\n\nHigher risk with TERP. Higher reward.\n\nI predict TERP will consolidate into the larger stakeholders over the next 5 years, and terp holders will get a premium. \n\nIt just boils down to risk, and TERP offers a higher dividend than the safer companies, and I believe fears are overblown, so I’m exposing myself to more risk to reap more reward", "score": 6, "replies": [{"body": "Gotcha! Thank you for the help. One last question: Do you recommend picking one company and sticking with it? I like both NEP and TERP but I feel like since they're in the same space, they will compete with each other so it wouldn't be ideal to own both", "score": 2, "replies": [{"body": "The only downside to diversification is you spend more in fees. \n\n2 buy orders then 2 sell orders eventually. \n\nI would do what makes you feel most comfortable. Likely dividing your allocation between two stocks instead of 1. \n\n\n\nMy IRA:\n\nPEGI\nTERP\nVTR\nO\nSPY\nT\n\nFrom largest positions to smallest. ", "score": 5, "replies": []}]}]}]}, {"body": ">BEP, BAM, TERP are all good picks IMHO\n\nwind, solare.... all overrated", "score": 1, "replies": []}]}]}, {"body": "PEGI has been killing it since October as well (up 8.5% since late September). I have BEP as a renewable, too. ", "score": 1, "replies": []}, {"body": "TERP is losing money", "score": 1, "replies": []}, {"body": "I'm also very passionate about renewable energy so I have NEP as my largest position in my portfolio. I decided to not get PEGI or TERP since I assume they are competitors. Do you think that is smart?", "score": 1, "replies": [{"body": "NEP is great in the space.\n\nNEE is parent and a legit solid parent company.\n\nHard to go wrong in the space\n\n", "score": 2, "replies": []}, {"body": ">NEP\n\nwhy NEP?\n\n&#x200B;", "score": 2, "replies": [{"body": "I have loved the vision and potential of NEE for a long time, and NEP is their Yieldco! Look up what Yieldco means, but I like their potential for sure.", "score": 1, "replies": []}]}]}, {"body": "Why do you pick PEGI?", "score": 1, "replies": [{"body": "Management is legit. \n\nWind is the best cost competitive against fossil fuels.\n\nWind, by cost, is more viable than solar.\n\nPEGI is my largest position. \n\nTheir parent company is pattern dev, which is very stable and can feed ROFO projects to PEGI. They just capitalized on this within the past 2 weeks ", "score": 3, "replies": [{"body": "PEGI has a dividend payout ratio of 112.5%.  Meaning they’re using debt to pay dividends, which is the opposite of sustainable.  Run like the “wind”....", "score": 0, "replies": [{"body": "Completely untrue.\n\nThey are paying out about 99%.\n\nManagement stated on their Q3 CC that: “we are highly confident in our ability to continue to support the dividend at the levels with the existing portfolio.”\n\nPEGI is NOT taking out loans to pay the dividend. The dividend has been frozen with a plan of increased CAFD.\n\nThe 112.5% payout you are referring to is what dividend.com is showing and is using outdated numbers or incorrect numbers. Likely incorrect algorithms because PEGI has never paid out 112+%\n\n", "score": 1, "replies": [{"body": "Earnings per share over the last year is at $1.45, and all of that is wrapped up in Q1 2018.  The other 3 quarters net ~$0.  Forgive my ignorance, but at $.422/quarter I don’t understand how anybody can feel like that dividend is safe at greater than 100%.\n\nEven if you’re correct that it’s actually 99% how can that feel comforting?  The business model is to take out loans and buy existing wind farms.  Interest rates aren’t safe and PEGI has to give away all but 1% of their earnings to investors, how can you feel confident that they’re going to be able to manage the dividend + debt after the fed raises rates by another 1/8th of a percent?\n\nTo me, PEGI has to go in one of two directions.  Slash the dividend to a quarter of what it is now, or completely halt growth so that they don’t take on any new debt, and neither sound like something I would throw money at.", "score": 1, "replies": []}]}]}]}]}, {"body": "Renewable energy? May as well buy toilet paper and wipe my asshole for me you’ll make more money ", "score": -7, "replies": [{"body": "Oil is going to be dead in a decade or so my friend, good luck with those BP and Shell stocks over the long run...", "score": 0, "replies": [{"body": "Decade lmao. Demand isn't projected to peak for another 20 years, and even after it peaks, it's a slow decline. Unless your time horizon for holding shell or BP is 30+ years, it's probably fine to hold them.", "score": 1, "replies": [{"body": "With the rise of EV's and renewables I think oil is on a downward trend soon-ish.\n\nIt will take a few generations of EV's to trickle down for most people to be driving them, but I can't see it being more than 10 years before most people are looking at buying an EV\n\nI know there is a lot more to oil than just petrol and diesel but it makes up a massive chunk of it's uses, and I can't see anything other than a shift from ICE to EV", "score": 0, "replies": [{"body": ">With the rise of EV's and renewables I think oil is on a downward trend soon-ish.\n\nAll of that has been factored into the prediction of oil demand decline in 20 years. EVs, while growing at a crazy rate, still won't reach parity in new car sales until something like 2030. And even then, once they do, that's still half of all new cars being sold as ICE vehicles, and still most of the entire global fleet still running off gasoline until the cars die. And all of that is paired with increasing demand for cars in general because of population increases and growing middle classes in the developing world.\n\n>but I can't see it being more than 10 years before most people are looking at buying an EV\n\nMost prognosticators agree with you, in general. The timeline is a little longer out (12-15 years rather than 10), but close. But again, you're talking about half of **new** car sales.\n\n>I know there is a lot more to oil than just petrol and diesel but it makes up a massive chunk of it's uses\n\nAgreed.\n\n>I can't see anything other than a shift from ICE to EV\n\nAgreed. \n\nWe don't disagree on what's going to happen, but you have a much quicker timeline of how it's going to happen than basically anyone who works in the space or whose job it is to predict these kinds of things. Which is why oil is generally projected to peak in the early 2040s and slowly fall off afterwards. It's not like when EVs become more than 50% of new sales, oil sales fall off a cliff. They just start moving sloooooowly downward instead of upward.", "score": 3, "replies": []}]}]}, {"body": "And you honestly believe Shell and BP will just roll over and die and not compete in renewable energy with their massive financial firepower....seems legit ", "score": 1, "replies": []}]}]}]}, {"body": "I am big on Financials right now. My longs rn are $GS and $JPM", "score": 25, "replies": [{"body": "GS is trading at seriously such a cheap multiple it’s insane. It’s trading under book value. ", "score": 15, "replies": [{"body": "Well the entire sector has a price to book close to 1. Im big fan of Morgan Stanley personally. BAC is also great to add to the two you suggested. The only large bank Id really avoid is WFC. ", "score": 2, "replies": [{"body": "I like MS a lot as well and am long MS already. GS would be a more mid term play. BAC I would rather have JPM.. simply best in class and I agree with avoid WFC.", "score": 2, "replies": []}]}]}, {"body": "Did u buy them cause Buffet bought them?", "score": 3, "replies": []}]}, {"body": "Of the two I like JPM more than BAC, but both look pretty great! ", "score": 12, "replies": []}, {"body": "[deleted]", "score": 17, "replies": [{"body": "I had some Costco, but my stop loss order kicked me out. Oh well, I had a good run with it. He", "score": 4, "replies": []}]}, {"body": "Pot stocks are cheap these days. ", "score": 15, "replies": [{"body": "They going to fall further next round of earnings ", "score": 9, "replies": [{"body": "the reason i like pot is because the smallest news triggers a spike. as long as you sell and arent hoping for more, you're good", "score": 7, "replies": [{"body": "My weedstocks-only portfolio was up 85% mid-October. Held through the first dip, thought about selling, but said fuck it and didn't touch anything.\n\nCurrently sitting 5% up lol", "score": 11, "replies": [{"body": "Still up! ", "score": 7, "replies": []}]}]}, {"body": "Are they? From what I've heard CGC has had amazing sales this \n quarter, why would they fall?", "score": 3, "replies": [{"body": "Canada post strike, still no retail sales in Ontario, Quebec cannabis strike( shut down retail to two days a week) i just drove across the country and poked my head into few dispensaries along the way many citing inventory problems. Most waited a long time to open because of said inventory problems. Im not short or anything so this isint an investment related  emotional argument just citing what I have seen here in Canada. \n\nAlthough I have been pondering putting a small amount into puts on various pot stocks ", "score": -2, "replies": [{"body": "Oh yea I completely forgot about the Canada Post strike, that makes a lot of sense, are they the only deliverers for the weed?", "score": 1, "replies": [{"body": "In Ontario they are. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Based on which technical? Peak to trough?", "score": 1, "replies": []}]}, {"body": "Walmart", "score": 6, "replies": [{"body": "[deleted]", "score": -8, "replies": [{"body": "What the", "score": 3, "replies": [{"body": "[WMT](https://www.google.com/amp/s/www.forbes.com/sites/andriacheng/2018/08/16/walmarts-ecommerce-tactic-against-amazon-is-paying-off/amp/) ", "score": -1, "replies": []}]}]}]}, {"body": "AMZN - They sell books, and hope.", "score": 8, "replies": []}, {"body": "CGC ", "score": 8, "replies": [{"body": "APHA should be next up for an announcement on a deal with an alcohol/tobacco company.", "score": 5, "replies": [{"body": "After today I am not sure if APHA is good deal", "score": 2, "replies": [{"body": "I would have to agree. Was up 85% mid October, rode the dips down to my breakeven and then this shit drops. 33% down after close.\n \nNot looking good, but there was a large amount insider buying today. And I would hope that the Diageo placements would have jumped ship as soon as they were aware of these issues. They're still on-board, so I'm thinking that something is fishy.\n\nThey're probably fucked anyway so I'm attempting to come up with a list of what to buy with the cash from liquidating.", "score": 1, "replies": []}]}, {"body": "I’ve never seen a group become so enamored with a company.  Especially a comp that is in the shadow of its first and second place brothers.  For well over a year this APH fandom has been running rampant.    Y’all gotta come to terms with it.   Better spots in the sector and APH may not be the savior all y’all hopium smokers need.  ", "score": 0, "replies": []}]}]}, {"body": "Disney ", "score": 5, "replies": []}, {"body": "NEE", "score": 4, "replies": []}, {"body": "Walmart, Disney, McDonald's", "score": 5, "replies": []}, {"body": "I feel this. 16/20 of my individual stock picks are tech. These past few months have not been kind. It's taught me to take into consideration value more heavily as before I had the bullish growth mindset approach which has backfired. But even the  non-tech stocks I'm interested in are expensive so I've just been going the VOO route.", "score": 2, "replies": [{"body": "I'm not worried and I'm lucky because I was gonna add an Nvdia position but decided to wait until after earnings lol\n\n&#x200B;", "score": 1, "replies": []}]}, {"body": "LMT or NOC\n\nBeaten up defense sector for no real good reason imo...\n\nThey will always be a strong long term hold imo. Good for diversity in a retirement account. ", "score": 4, "replies": [{"body": "I would go ahead and add RTN to that list too.", "score": 2, "replies": [{"body": "Ya really any of the big 3 or BA. Or a defense sector ETF is fine like ITA.", "score": 2, "replies": []}]}, {"body": "Hell yeah", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Just buy ITA If you want those guys. ", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Agreed not to mention you have about 40% of a bunch of a number of smaller companies that aren’t going to get anywhere the type of contracts that the big 6 typically pull in.  Normally I’m all about a sector ETF but the defense sector is so top heavy. ", "score": 2, "replies": []}]}]}]}, {"body": "AMT and WM here.", "score": 4, "replies": []}, {"body": "OHI", "score": 2, "replies": []}, {"body": "Dexcom, Visa", "score": 2, "replies": [{"body": "Dexcom seems interesting. I own some visa but I will take a look", "score": 1, "replies": [{"body": "Dexcom offers a superior product that other competitors (Medtronic being the main competitor) can't match. When it's a matter of life and death, most will use the superior product.\n\nAlso good because of the obesity epidemic, they're going to sell it like hot cakes in the next 5/10 years", "score": 1, "replies": [{"body": "Yes but DXCM's product is expensive and most people with obesity tend to be lower class and are not able to afford it.  ", "score": 1, "replies": [{"body": "yes - this is a bit like betting on Apple or Tesla, instead of Android or other carmakers. Not everyone can afford, but those who do seem to be total fans of the brand. The company should do well in the next years", "score": 1, "replies": [{"body": "I don't see how a company that sells glucose monitors for diabetics are *anything* like Apple and Tesla which  sell luxury consumer goods. They literally have opposite strategies, DXCM needs to lower its prices to penetrate their core consumer base whereas AAPL and TSLA  keep their prices high to maintain a luxury status. There is no doubt that Dexcom has the industry's superior product, but most people with diabetes can't afford a $1000+ monitor and then a $100 sensor every week($5200/year) when there are perfectly viable alternatives for a fraction of the cost.\n\nEven from a valuation standpoint they're nothing alike.\n\nAAPL's forward P/E: 12\n\nTSLA's forward P/E: 53\n\nDXCM's forward P/E: 508\n\n&#x200B;", "score": 1, "replies": []}]}]}]}, {"body": "Dexcom is a solid company with a great product but if you're looking to diversify from tech, DXCM has all of risks of big tech but amplified. Forward P/E of 508.20, already more than doubled in the last 6 months so it's currently priced to perfection. If I've learned anything from tech this year, 1 bad earnings report will see it drop 50% back to March prices.", "score": 1, "replies": []}]}]}, {"body": "CCF, Chase Corp, a boring small cap material company that makes coatings for pipelines, bridges, underground utilities, and tons of other infrastructure related products. Best part is the management has been stellar, especially with acquisitions and intelligent debt management.", "score": 2, "replies": [{"body": "Never heard of them. Added to my watch list. Thanks for putting them on my radar!", "score": 1, "replies": [{"body": "I'd highly recommend finding their quarterly call transcripts or press releases to get a feel for their products and markets.\n\nMy bet is they have a juicy chunk to gain with any future national infrastructure plan, domestic oil/pipeline boom, steady flow with infrastructure upgrade/maintenance work, solid management, family owned for 70 years, and are active in M&A and turn out quick profits on those.", "score": 1, "replies": []}]}]}, {"body": "O\n\nSolid stock, solid monthly dividend, would buy more if I had $$$", "score": 2, "replies": [{"body": "Yes, it seems to have held up pretty well, and STOR. ", "score": 1, "replies": []}, {"body": "There are better.", "score": 0, "replies": []}]}, {"body": "Either ILMN or ABMD", "score": 2, "replies": []}, {"body": "ABBV, T, ULTA", "score": 2, "replies": [{"body": "Heck yes on ULTA.", "score": 1, "replies": []}]}, {"body": "I like REITs, TCO is looking decently cheap right now. I bought a lot recently and TCO came to make up 14% of my portfolio, but I sold some at a ~5% profit last week bringing me to about a 10% allocation. I'll be looking to reduce that further should the price keep increasing. Unless it winds up overpriced, I'll probably keep about 5%.", "score": 2, "replies": []}, {"body": "ALGN", "score": 2, "replies": []}, {"body": "CVS, DPZ, NKE", "score": 3, "replies": []}, {"body": "$COST", "score": 1, "replies": []}, {"body": "Disney all the way.", "score": 1, "replies": []}, {"body": "STOR and DUK have been my favorites. Consistent dividends and growth. ", "score": 1, "replies": []}, {"body": "XPO", "score": 1, "replies": []}, {"body": "JNJ", "score": 1, "replies": []}, {"body": "NLY and PNNT - less volatile than tech, and pays an 11% dividend. Hard to beat that security. NLY also profits from a lowering rate environment (5 years from now)", "score": 1, "replies": []}, {"body": "If you believe trade war will deescalte then Boeing and Apple (which I consider more consumer goods than tech especially since it does not trade at a tech multiple).  I also agree JPM and GS. Buffet recently bought a number of banks.\n\n\nForeign stocks are extremely cheap right now and can consider an ETF like FXI or EWZ.", "score": 1, "replies": []}, {"body": "Honestly the fact that no one wants to touch tech right now is a great reason to be buying tech, not selling. But I understand if you’re just looking to balance your portfolio a bit.", "score": 1, "replies": [{"body": "Well I’m looking to buy google already as well. I have too much tech though lol. ", "score": 1, "replies": []}]}, {"body": "TPL", "score": 1, "replies": []}, {"body": "For communications I have Verizon", "score": 1, "replies": []}, {"body": "What's a non-tech stock? ", "score": 1, "replies": []}, {"body": "WEC ", "score": 1, "replies": []}, {"body": "OESX - Orion Energy systems, they have a lot of backed up revenue that will be reported next quarter and are on the horizons of securing some healthy contracts. ", "score": 1, "replies": []}, {"body": "Wendy's $WEN", "score": 1, "replies": [{"body": "Same! What’s your plan?", "score": 2, "replies": [{"body": "Just want to bring back the Wild Mountain Chicken Sandwich man. ", "score": 21, "replies": []}]}]}, {"body": "Wdfc fam. It's crushing it", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "GLW is the ticker, for reference.", "score": 1, "replies": []}]}, {"body": "Pfizer", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "What’s your plan for when UTX splits into 3 new companies next year?", "score": 2, "replies": []}]}, {"body": "Norfolk Southern, Union Pacific, and CSX. Cant go wrong with railroads. ", "score": 1, "replies": []}, {"body": "MCD", "score": 1, "replies": []}, {"body": "WWE. GTE. ", "score": 1, "replies": []}, {"body": "$CRON. \n\n", "score": 1, "replies": []}, {"body": "NKE, JPM, V, MA, FDX", "score": 1, "replies": []}, {"body": "Boeing . Anthem. Spirit Airlines.", "score": 1, "replies": []}, {"body": "LULU", "score": 1, "replies": []}, {"body": "CRSP\n\nLong term bet", "score": 1, "replies": []}, {"body": "Goldman", "score": 1, "replies": []}, {"body": "UA", "score": 1, "replies": []}, {"body": "KKR. Great dividend, structural tailwind from converting to a traditional corporation from a LP, diversified portfolio of private equity, real estate, energy...does have some tech exposure though. ", "score": 1, "replies": []}, {"body": "V, BRK.B, AMT", "score": 1, "replies": []}, {"body": "JNJ ", "score": 1, "replies": []}, {"body": "Go with renewable energy stocks, with countries spreading awareness about climate change and efforts to protect it, it is going to be the next big thing.", "score": 1, "replies": []}, {"body": "Consumer staples. KHC, HBI.", "score": 1, "replies": [{"body": "I accumulated some HBI on the most recent dip. I'm a seller if it goes to $17 soon, but I don't mind holding at this yield either. I think the dividend is safe though.\n\nI think they need to sell direct more, but I like what they are doing to get ready for 2019. There is some risk but I like them moving forward, but I love these prices.\n\nI like KHC but I need it to go lower for me to play with them. I think if GIS dumps soon, I'd rather get in that.", "score": 1, "replies": [{"body": "I like GIS too, I think it would be a good safe longer position. \n\nI bought 100 shares of HBI at $14.89 then turned around and sold a $16 call for $50. If you looking to sell at $17 why don't you sell a $17 call right now and make an extra $15-$20?", "score": 1, "replies": [{"body": "That's interesting but I'm comfortable if HBI goes sideways for a while just holding for the yield.", "score": 1, "replies": []}]}]}]}, {"body": "RemindMe! 1 day", "score": 0, "replies": []}, {"body": "Weed stocks. Now's the time to invest. I'd suggest Aurora or Canopy Growth. \n\n&#x200B;\n\nDisclaimer: I'm only 18 and I'm new to investing. So not much experience, but I think weed is a pretty safe bet.", "score": -4, "replies": [{"body": "Do yourself a favor as stay away from stocks for the time being. Only come back after you realize how dumb your comment was.", "score": 2, "replies": [{"body": "Can you explain what is wrong with investing in weed? I'm genuinely curious. ", "score": 1, "replies": [{"body": "Fraud and irrationality ", "score": 1, "replies": []}, {"body": "They're the opposite of \"a safe bet\". Highly volatile, speculative, overhyped, overpriced stocks. Most of these companies will be failures and that's an statistical certainty. Don't go near them unless you know what you're doing, which you clearly don't.", "score": 0, "replies": []}]}, {"body": "OP definitely Robinhoods.", "score": 0, "replies": []}]}, {"body": "\"I don't know what I'm doing, here's some advice\"\n\nCGC is way overvalued and has a negative P/E, it's not exactly the smartest thing to buy into right now.", "score": 0, "replies": []}]}, {"body": "TM ", "score": 0, "replies": []}, {"body": "ARWR - biopharma, RNAi", "score": 0, "replies": []}, {"body": "Top five catching my eye are $SOHO, $MGM, $MGP, $MMP and $OKE.", "score": 0, "replies": [{"body": "Might buy some oke if oil bottoms out", "score": 2, "replies": []}]}, {"body": "Shorting lots of gas right now, prepared to cover and buy when it rebounds.", "score": 0, "replies": [{"body": "I added a quick short position in my wallstreetbets account lol ", "score": 1, "replies": []}]}, {"body": "OLP,MO", "score": 0, "replies": []}, {"body": "SAM......Reason: short interest ;-)", "score": 0, "replies": []}, {"body": "Crude oil prices should go back up after the massive drop. I started a position in APA last week.", "score": 0, "replies": []}, {"body": "AMCX\n\nDE\n\nCBS\n\nCVS\n\nCAH\n\nCMCSA\n\nAMC\n\nTAP\n\nGIS\n\nDIS\n\nWELL\n\nThinking about railroad stocks", "score": 0, "replies": []}, {"body": "SG Blocks", "score": 0, "replies": []}, {"body": "ALK, CWH, DAR, LYV, MINI, MKC, NUE, UNP, ZTS, ROL, MTN, TSCO, HAS are my fav if you’re good enough to hold through the ups and downs", "score": 0, "replies": []}, {"body": "UNH decided to withdraw from Affordable Health Care in April of 2016 when I bought it and has been off to races ever since. On a pullback from the highs, it's a buy as it's the best in class for healthcare.", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Wouldn't telecom be considered tech at this point though? ", "score": 1, "replies": []}]}, {"body": "If they raise too much it will slow the economy. I don’t think 2-3 raises is too much. Banks do well with higher rates because they can charge more for lending the same money. If we see increased rates banks are one of the sectors that should do well. \nIf Powell throws a rate hike at us in December though who knows what would happen. I’d assume another correction down just out of fear.", "score": 0, "replies": []}, {"body": "Just got into BAT stock has been oversold....", "score": 0, "replies": []}, {"body": "Acb", "score": 0, "replies": []}, {"body": "I like VEDL. It's basically Freeport McMoran but smaller, in India, and with a better divident. Their copper smelter looks to reopen soon, which will be a great catalyst.", "score": 0, "replies": []}, {"body": "Glacier Bancorp, GBCI.  This is a bank out west.  They buy little banks and keep growing.  If the little bank is well run with a good rep, it keeps the name.  If the bank needs a rebrand it becomes a Glacier Bank.  I started buying it 10 years ago around $15 a share.\n\nThe company is very generous with it's dividend.  I think last year we got a special dividend at year end that was bigger than the quarterly which was also paid.", "score": 0, "replies": []}, {"body": "Marine Harvest. Biggest salmon producer in the world, solid company, pays good dividends.", "score": 0, "replies": []}, {"body": "I like $JAZZ", "score": 0, "replies": []}, {"body": "GM, but they will probably become more of a tech company as EV and their GM Cruise division grows.\n\nI am going to keep buying some over the next few years.", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I don't know, that report is a little worrisome. ", "score": 1, "replies": []}]}, {"body": "AEP - American Electric Power. Strong dividend, good balance sheet, and they are all domestic supply and business so they're not affected by any trade war concerns.", "score": 0, "replies": [{"body": "Wow why a downvote? ", "score": 1, "replies": []}]}, {"body": "DIS, COS, BRK.B, KO, JPM, PNC, AXP, and V. \n\nAlso F because I have a soft spot for them, not necessarily the best investment though. ", "score": 0, "replies": []}, {"body": "JPM (eyeing BAC too, but don't have a position right now)\n\nILMN\n\nWM\n\nNBEV (in the short term - has already spiked some and I think there is more coming)\n\nBRK.B\n\nBAM\n\nNKE\n\n&#x200B;\n\nWatch list of non-tech: DIS and any that'll be helped by legalized sports gambling - WIMHY, BYD, ", "score": 0, "replies": []}, {"body": "The auto sector is pretty messed up right now but Ford. Sentiment on this sub tends to be pretty hostile towards it though. Someone will usually spout off something about debt or the restructure like they're bad things, which they aren't, or that the dividend is going to get cut, it's not. I just keep buying more while it's still under 10$.", "score": 0, "replies": []}, {"body": "I just started a few months ago, but Coca-Cola. ", "score": 0, "replies": []}]}
