{"title": "$4,000 Overnight Trading $TSLA", "selftext": "Last week, $TSLA had a major \"buy the rumor sell the news\" event after the positive China news, and right before the \"200 magnet\" was hit the bears have since been winning the battle. Looking at the 30 min chart, we can see 4 important details: \n\n1. Failed pushes (weak theme)\n2. 179 Key Level\n3. Lower Highs (textbook bearish)\n4. Weaker than the SPY (not pictured)\n\nRight now, we are in the midst of a strong market cycle, but $TSLA has been consistently weaker than the $SPY. Further, keep in mind TSLA traded higher on poor earnings AND Elon's news of slowing growth. Typically, trading against the market cycle is risky, but in this instance $TSLA was trading higher on thin air. See below for trade details:\n\n* Entry: 1/2 size AM weakness near key level with plan to add on true Breakdown on volume or \"strength\" \n   * Added full size on \"strength\" with an average price of about $0.50\n* Profit Target: Gap fill on 30 min (172)\n* Risk: Failed Push reclaim (183), moved lower to 179 after Breakdown. \n\nFor sizing, overnight trading with options can be tough because I can't exit, so I scaled with a size that I would feel comfortable with being worthless in the AM. The contracts don't always become worthless overnight, but I tell myself they will be for two reason: \n\n* If it happens, par for the course\n* More importantly, I don't stare at the stock all night/morning and can save my emotional capacity for outside of trading. \n\n$TSLA opened with a large gap down a little past my 172 target, and I exited with an average price of about $2.45 for about a $4,000 gain. \n\nhttps://preview.redd.it/kd7knqazl8zc1.png?width=1917&format=png&auto=webp&s=345a09db1278d47d97c7d3a2822e363e7bee1742\n\nhttps://preview.redd.it/qhxl5qazl8zc1.png?width=472&format=png&auto=webp&s=63f1828f938043540411771fedce01fae58d5611\n\nhttps://preview.redd.it/pp08iqazl8zc1.png?width=1916&format=png&auto=webp&s=5c391b8457fb0669cbde56a6d99bef6953ca56d9\n\n", "id": "1cna92a", "created_utc": 1715189285.0, "score": 74, "upvote_ratio": 0.77, "num_comments": 39, "comments": [{"body": "lots of words and pictures for a guess", "score": 74, "replies": [{"body": "You don't technical? Stay poor young man, stay poor.", "score": -17, "replies": [{"body": "Let me guess, youre a billionaire?", "score": 0, "replies": [{"body": "I didn't say that at all, I don't punch a clock though. This anti TA fad started when market ignorant people could just trade for free, good luck with that.", "score": 3, "replies": [{"body": "So TA isnt good enough for you to become a billionaire. Very interesting fact.", "score": 1, "replies": [{"body": "Sure thing", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Very nice", "score": 12, "replies": [{"body": "Now let’s see Paul Allen’s trade", "score": 10, "replies": []}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Yep.", "score": 3, "replies": [{"body": "Thoughts on TSLA making another run soon? Was looking at it this morning.", "score": 1, "replies": [{"body": "Personally not interested in a longs/calls unless it reclaims 172, or picks up on any strong SPY flows. We may moving towards a neutral/weak cycle so we will see how long this lasts.", "score": 3, "replies": []}]}]}]}, {"body": "Still learning about options so I don't understand a lot in the post yet but congrats!! Thanks for sharing, will learn something from it when I understand.", "score": 8, "replies": [{"body": "Right? I swear my imposter syndrome is triggered so hard by some posts hier with all the lingo that is being thrown around. Makes me feel like I know nothing.", "score": 3, "replies": [{"body": "Some make it harder than it needs to be.  I didn’t really understand the bear/bull thing either.  But I make small profits w TSLA.  That’s what counts.", "score": 1, "replies": []}]}]}, {"body": "Am I reading it right 5/10 expiry?", "score": 3, "replies": [{"body": "Yes! I typically trade <5 DTE.", "score": 1, "replies": []}]}, {"body": "Just an another post of someone explaining how he will loose money.", "score": 3, "replies": [{"body": "I’ll need to up my game there.  😉", "score": 1, "replies": []}]}, {"body": "Bro got lucky with the DOJ probe news and now he’s hyping himself up😂", "score": 3, "replies": [{"body": "Exactly. It was literally just lucky news lol. Nice to win a good trade but his technical analysis doesn’t mean jack shit here.", "score": 1, "replies": []}]}, {"body": "Weird. I flipped 20 170 weekly puts from .49 average to 2.5 for almost the exact same win.", "score": 2, "replies": [{"body": "I like the way you trade ( ͡° ͜ʖ ͡°)", "score": 2, "replies": []}]}, {"body": "Remember, the market can remain irrational longer than you can stay solvent", "score": 2, "replies": []}, {"body": "Do you ever post you  unsuccessful Trades ?", "score": 1, "replies": [{"body": "I’m new to Reddit and this is my true first trade review to post. I definitely have losers, I’m not a furu lol.", "score": 1, "replies": []}]}, {"body": "TSLA had bad news about the probe. That wasn’t really much to do with TA lol", "score": 1, "replies": []}, {"body": "I made 4% on a few repeat TSLA stock trades, let the matter sit idle for a week, and bought a handful of shares today to do it again.  I like the stock alone on this one.  I pick the expiration.", "score": 1, "replies": []}, {"body": "He sold?", "score": 1, "replies": []}, {"body": "Do you think it will go down to 170 tomorrow  ? It rejected 175 today", "score": 1, "replies": [{"body": "175 reject not that strong imo. The important level is 179 and now the 174 floor that was created today. For overnight holds I trade on confirmation and we didn’t have that today. Tomorrow, if still in play I’m watching the 174 response (we may wash it AH/PM) or for the 179 test. \n\nA bounce is expected in a gap fill, but the good news about today was there’s now a lot of freshly trapped liquidity. The bad news about today was TSLA was more correlated than normal with the SPY. Now, TSLA’s future may be dependent upon SPY flows. \n\nAll that to say, a setup of mine hasn’t formed so I’ll be sitting on the sidelines until one does.", "score": 3, "replies": []}, {"body": "Could.  My shares will sell at 180, 4% profit.  That’s TSLA.  🤷‍♂️", "score": 1, "replies": []}]}, {"body": "When do you think you would flip over to a bull case for $TSLA?", "score": 1, "replies": [{"body": "179 reclaim on volume, strong market cycle/strong $SPY flows, and Fake Breakdown theme.", "score": 1, "replies": []}]}, {"body": "What candle time frame are you using for your trades? \n\nSo you entered the trade and Exited at open the next day? \n\nI agree with you on how the stock is moving in the market environment with the backdrop of the EV slowdown narrative", "score": -1, "replies": [{"body": "One minute for actual trades, and 30-min (or longer) for context. During the trade I am solely focused on the one minute for entry, but I keep the 30-min up so I can see the larger picture. I've noticed sometimes it's easy to get stuck in the \"one-minute mindset\", and that has caused me to miss out on a ton of gains.\n\nBefore I exit, I always check the 30 min to make sure I am not missing anything.\n\nYes, entered the trade and exited the following day near the open. I exited half immediately and then saved half to see if I could get a push down further, but there were strong buying flows so I exited fully just a few minutes after open.", "score": 10, "replies": [{"body": "Do you got two screens going for your setup?", "score": 0, "replies": [{"body": "I have 3 screens - one for price action of the stock, the SPY chart, and the options chart. My other screen is for the other Magnificent Seven stocks/gappers (if applicable). The other is for trade execution, social media, etc. \n\nIt's pretty challenging to trade with one screen, but that's how I started. Two screens is imperative in my opinion.", "score": 3, "replies": [{"body": "Do you have a certain strategy with gaps? Or mag 7 stocks?", "score": 0, "replies": [{"body": "I have strategies for both - mostly dependent on the current market cycle and theme. Gaps just draw more attention to a stock that wouldn't otherwise have it in my opinion. \n\nThe strategy discussed above (key level breakdown/key level breakout) is one of my favorites.", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Is the Wheel Strat an Option Strat or Just a Buy and Hold Strat", "selftext": "I fully expect people to lose their minds commenting back that yes , for sure it is an option strat. Not really as touted on Reddit. Sure if you got your 600k and 300k tied up in Apple (Meta,...) you sell some calls against it. That is a buy and hold strat.\n\nHere people with Cash accounts buy a stock (a lot of times crappy stocks, since capital is limited) with the view they can then get into this option stuff. So you tie up the little capital you have with stock that you really did not want , so you can sell stock against it , and that makes you an options trader. \n\nThe only traders I have seen that use the wheel strat, are guys that sold naked Calls in their margin accounts (usually as part of a Strangle) and got assigned. \n\n>>Edit: Yes Calls is WRONG, should have been Puts. The Stock is Put to them.\n\nThey really do not want the stock , but feel they can make back the loss by selling calls against the stock for a few cycles. So they pony up the capital and sit back to see what happens over the next few months.\n\nActual traders only use margin accounts, and no I have never paid interest on options positions and neither has anyone else . You only pay interest if you BUY STOCK, do not have the capital and the broker lends you the rest (usually you only need 50% in cash to avoid interest). With options if you Sell an option you need a margin account and BP buying power. The broker puts a hold on a portion of the buying power (roughly 20% of the stock price, but can vary widely ). Niffy thing if you sell a Strangle it is the same BP as Selling just the Call or Put ... hence why people sell Strangles. \n\nYou cannot do this with a Cash account since there is no way to Cash secure a naked Call. A CSP forces you to commit the total price of the stock for the broker to hold. In a margin account you only need about 20% of the stock price to sell the Put. True the margin will increase should the stock fall.", "id": "1cnbpbc", "created_utc": 1715192953.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 34, "comments": [{"body": "Um...what?", "score": 24, "replies": []}, {"body": "I think you misunderstand the wheel strategy a bit. In a simple explanation, with the wheel you aren't selling naked calls you are selling cash secured puts on a stock that you wouldn't mind being assigned if it came down to it. If the option isn't assigned you sell another csp on it. If it is assigned you sell covered calls until the stock is called away again then rinse and repeat. You are making most of your money off of premiums and if the covered calls work properly then you are also making some off of the stock itself.\n\nThere is a lot more too it than that but its not selling naked calls on stocks you don't want.", "score": 12, "replies": [{"body": "Granted traders do Sell puts but in Margin accounts. Taking assignment is not part of the plan. Once you do that you are in a buy and hold strat , which is what most of these Wheel Strat go on forever about. Cash secured Puts assume a Cash account which if you are over the PDT rule (25k)  you would never do if you are trading options. Cash accounts are too restrictive , how do you Sell Calls without owning the stock. No, if you own the stock you are in a Buy and Hold mode.", "score": -2, "replies": [{"body": "\"Taking assignment is not part of the plan.\"\n\nSelling CSPs every week \\* knowing \\* you will get assigned sometime IS part of the plan.", "score": 3, "replies": []}, {"body": "Its not a buy and hold strat though. The goal isn't to get assigned, but you pick stocks that if you got assigned them you would be ok with. From the people I've seen doing it, they usually buy to close their puts once the premium has dropped about 50%. If you do get assigned on the put then you aren't holding the stock for any longer than however long it takes for it to get called away with a covered call or you sell if you think that stock is never going to recover back to where it would be profitable again.", "score": 1, "replies": []}]}]}, {"body": "You may find this guide informative: [https://www.reddit.com/r/options/comments/a36k4j/the\\_wheel\\_aka\\_triple\\_income\\_strategy\\_explained/](https://www.reddit.com/r/options/comments/a36k4j/the_wheel_aka_triple_income_strategy_explained/)\n\nThe salient point is that the strat starts with shorting puts, not with writing calls on shares you already own. Furthermore, you only buy and hold shares for as long as it is necessary to recoup the deferred loss on having a short put assigned, then it is back to shorting puts. Of course, this could be a very long time, months or years, so the admonition in the guide to only trade puts on stocks you would want to own makes it sound like a stock strategy, but again, buying and holding shares is intended to be a temporary back-up plan for deferring a loss from an assigned put.\n\nYou can of course start the Wheel from shares you already own, but I would argue that approaching the Wheel that way is exactly what you are describing: buy & hold of equities with extra steps.", "score": 5, "replies": []}, {"body": ">The only traders I have seen that use the wheel strat, are guys that sold naked Calls in their margin accounts (ususally as part of a Strangle) and got assigned. They really do not want the stock , but feel they can make back the loss by selling calls against the stock for a few cycles. So they pony up the capital and sit back to see what happens over the next few months.\n\nYou are getting calls confused with puts, that being said not reading the rest of that cause you seem really confused", "score": 3, "replies": [{"body": "Typo , What can I say, Noted with an Edit in the original Post.", "score": 1, "replies": []}]}, {"body": "imho, for a novice trader like myself it is buy and hold on a steroid.\n\nI don’t have tools or education for learning complex option strategies.\n\nBut, I would like to see my actual cash getting some good returns + Allowing me to buy some good stocks/etf at attractive prices \n\nSo CSP — assignment— selling CC is buy and hold with optimum returns for me.\n\nAlthough as long as wheel is done on a MSFT and not on DJT, I can breath easy 😀", "score": 3, "replies": [{"body": "if you can't get educated then it's extremely unlikely that options will make you have better returns than buying and holding", "score": -1, "replies": [{"body": "True. \nBut with a 12 hour a day ‘unstable’ job, supporting a family and other issues, getting educated is an uphill battle.", "score": 2, "replies": [{"body": "Im just saying if you don't have the commitment is better to leave it alone. While not zero sum it's very close to it, you are selling this contracts to professionals, it's likely that they are not giving money away for free", "score": 4, "replies": []}]}]}]}, {"body": "Imo, the wheel is just a mechanical, expensive (high BPR), relatively safe (if done wisely), bullish strategy (always + delta).", "score": 3, "replies": []}, {"body": "This is a good question, in essence, and most wheelers are actually confused about it (I'm reading beyond the fact that you are confused about naked call selling vs CSP).\n\nSince the wheel has you longing a stock \"you don't mind holding\"® that implies that you are a long term investor of the stock. That by definition makes you an investor of the stock, and this is where this strategy falls apart for most people.\n\nMost people didn't look at the fundamentals when doing their mental accounting exercise, but rather look at premiums which are high precisely because the market has high doubts about the current performance. I also never see wheelers talking about cheap entry points and selling criteria, just a rinse and repeat of the mechanics. While the wheel is easy to understand, it requires you to exists in this weird mix of a technical options aspect and long term investment.\n\nFinally, the best application of the wheel that I know of is done by financial institutions: since they know that entering a stock will blow up the price, it is convenient for them to write entry/exit points and get paid while waiting. That way they can use their financial position and their plan to increase their return.", "score": 3, "replies": [{"body": "The main idea of the wheel is to simply not be worried about the option getting assigned instead of rolling or taking a loss. The \"don't mind holding\" part isn't because you're a buy and hold investor but because the main risk to the wheel is you get assigned a junk stock that never recovers, and the CC premiums won't recoup your losses. If you're assigned Apple on a dip that's not a big deal, you can sell CCs above your cost basis, and it will recover. In some strategies if you've been holding the stock for a while, it may be beneficial to wait things out to make it a long-term capital gain. I refer to that as a slow wheel.\n\nChasing high premiums will burn you with wheeling. High IV makes it hard to pivot and increases the odds of bag holding something that tanked. Ideally you want something predictable so you can collect a few premiums before the wheel turns.", "score": 1, "replies": [{"body": "Are you contesting any specific part of what I said?\n\nAPPL has taken more than 9 years to recover from its worse losses from ATH, so the \"don't mind holding\" becomes you becoming a long term investor on supposedly a technical play.\n\nAs an aside, I also don't get the I don't mind holding mantra: I always mind holding, especially if it's because of a loss and I can't deploy capital efficiently due to some weird attachment to the stock.", "score": 1, "replies": [{"body": "9 years to recover? At no point in the past decade has AAPL needed more than a few months to recover from a pull back. Unless you were aggressive about selling CSPs you're not going to be assigned at the ATH either. Additionally, you could still pull decent premiums from CCs well OTM, which is critical for not getting caught below your cost basis. The mantra isn't because you're going to hold the stock it's because OTHER people will hold it and that kind of stability is needed for a profitable wheel.", "score": 1, "replies": [{"body": "I didn’t say in the past decade. AAPL has also lost more than half of its value on at least two occasions, once people get out they can all rush through the exits, so the “don’t mind holding” mantra is just asinine. \n\nPeople forget that the darlings of today will become the ugly ducklings of tomorrow. In the 90s like literally everything and everyone had Sony devices. The stock was priced for perfection and it took it 17 years from them to (briefly) recover. Blue chip companies are in the top decile of overvaluation in historical levels at the moment, don’t be surprised when you realize that you actually mind holding them after all.", "score": 1, "replies": [{"body": "That's why I'd never wheel Tesla, Nvidia, or AMD. Apple has a stronger moat with brand loyalty, but yes, that can dwindle over time too. I actually prefer boring dividend stocks because there's rarely any wild swings. The premium isn't sexy but combined with the dividend, the return ends up being pretty solid.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Posts that call some people ' not real traders' are suspect to begin with. Traders isn't an exclusive club of people who trade a certain way or have a certain kind of account. That's ego stuff. \n\nThere's a book out on Wheel strat, there's lots of info out on it\nIf you don't like it, don't do it.", "score": 2, "replies": []}, {"body": "I cannot relate to the \"actual traders do this...\" mentality.\n\nAll you have to do is trade to be a trader my man, there's not some secret club of \"true traders\" that only behave a certain way. There are traders of different ages with different portfolio sizes, different goals, and different risk tolerances, etc.\n\nI think any time I have seen the wheel strategy from some sort of expert, it's been advised to use a stock you would not mind holding. Which totally makes sense with a strategy that involves daring to get caught with puts knowing when you do, you secured a good price to... hold shares!\n\nI have never heard this idea that margin traders don't want to hold stock, or that cash account traders are the ones that do want to hold stock. I think that's potentially counter intuitive since margin accounts get buying power from their stocks, and meanwhile cash accounts are often used for small accounts to get around the PDT restrictions--a feature that suits \"actual traders\" I'd say...\n\nAnother thing I consistently see advised is to minimize the portion of your portfolio that is leverage based to around 5% of the portfolio. Very few wealthy folks are trading options as their primary income. When you speak of how \"actual traders only use margin accounts\" I think what you mean is wealthy people will choose a portfolio margin over a cash account. It's a no brainer if you've got $250K plus and can get that 25%.\n\nI suspect that if you really stop and examine your perspective, you're going to find that you're making assumptions based on wealth but applying those assumptions as based on trading habits. In reality, traders do all sorts of stuff, and margin accounts are often more favorable terms if you have the capital to take advantage of it.", "score": 1, "replies": []}, {"body": "my personal preference is buy shares and sell OTM calls.  if/when i have extra cash from monthly DCA contribution, i’ll sell another put.", "score": 1, "replies": []}, {"body": "You can trade it both ways. If assignment is the last resort and only done in extreme instances, it’s more of an options strat. \n\nIf you are hoping to get assigned, you’re really just a buy-n-holder using an inefficient entry and exit process.", "score": 1, "replies": []}, {"body": "This guy has the good drugs. What in the flying F are you trying to say here?", "score": 1, "replies": []}, {"body": "The wheel strategy by definition is explicitly NOT a buy and hold strategy. You don't buy unless your put option is assigned. Also, you can't hold if your call option is assigned, you HAVE to sell. That's literally the opposite of buy and hold. When you sell a call option against shares you own, you HAVE to sell if you get assigned.\n\nThe money made is mostly from the option premiums. \n\nIf you're wheeling the ideal output is you make good premiums and never get assigned on puts. On calls it's probably good to be assigned and in the process make a cool $100-$200 per option.", "score": 1, "replies": [{"body": "The Wheel is a buy and hold. 90% of the Posts on the Wheel Strat are ... \n\n\"My Call is ITM what do I do now\" ... then we are treated to endless nonsense about buying back the Call, Rolling out the Call ... \n\nThese people want to HOLD the Stock , it is not Option trading but part of Buy and Hold. Also why are all the people posting Cash Accounts if they are trading options, that makes no sense.", "score": 1, "replies": [{"body": "Yeah so these people have a fundamental misunderstanding of what the wheel strategy is. These people want to hold the stock, they shouldn't be trading the wheel. They should then sell puts till they get assigned and keep the stock. \n\nJust because some idiots think walking is done with your arms doesn't mean walking is done with your arms.\n\nAs for cash account vs trading options, those things aren't mutually exclusive. Not sure what you're talking about. If you have cash or equity holdings to back your option play, you don't need margin.\n\nEdit: reading your original post again, I feel like you may misunderstand certain terms related to options trading. It could be a communication gap", "score": 1, "replies": [{"body": "OK , I know this is a BIG MISTAKE, but what terms are mis-understood.", "score": 1, "replies": [{"body": "What are cash accounts? What is the wheel strategy? Do you understand what these terms mean?", "score": 1, "replies": [{"body": "Cash means no margin (really obtuse there ). On Fidelity people sometimes talk about doing a trade as Cash only, even when the account is Margin. I am unware of any option like that. I use Tos.\n\nAn Ira is an example of a Cash account. You have to cover all loses up front to place the trade. In a margin I can Sell a Spy Strangle (15-20 delta) for 8-10k usually. You cannot even do that in a Cash account since the Call cannot be covered. I think Tasty has talked about trying to get their administrators of the Ira trusts to give more leeway. They do allow Future trading.", "score": 1, "replies": [{"body": "Yeah, Cash only means you can only buy stuff worth the settled cash in your account. \n\nJust because you have a margin account doesn't mean you always use margin. If you have enough cash in your account, it will be used to place the trade. \n\nThere's nothing that prevents you from trading options in a cash account. That's why I thought you didn't understand what cash account means. Buying options doesn't require you to have any coverage. Selling puts requires you to have cash, selling covered calls requires you to have the stock. You don't *need* margin. \n\nIf you want to hold a stock, you *could* buy it and sell low probability calls on it. But that's not what the wheel strategy is. On the call side of the wheel strategy you ideally sell calls for the strike you got assigned at or slightly higher if you timeframe is higher, so you get a fat premium and can sell the stock.", "score": 1, "replies": []}]}, {"body": "Wheel Strat, you sell Puts until assigned, then you sell Calls against the Stock you were Put. The only time I have seen it is when assigned Puts, when a Strangle went bad. On Reddit people seem to be all over the place. The basic is selling a CSP, since the only Cash account I have is an IRA I have no interest. If I want a stock for holding I would buy it and sell Calls against. Cash accounts as brokerage accounts seem to be for the RH crowd.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "it's a \"lose money over time\" strat", "score": 0, "replies": [{"body": "Please explain.", "score": 1, "replies": []}]}]}
{"title": "SPY up 3.4% in 4 days on AH/PM moves", "selftext": "After the FED spoke the market completely changed direction.  It went up 3.4% in 4 days.  Most of these gains happen after hours or premarket.\n\n\nI cannot find any pattern anywhere where a stock or index jumped this much on dojis.  \n\n\nAnyone got any ideas on this crazy pattern? ", "id": "1cmrbds", "created_utc": 1715128102.0, "score": 43, "upvote_ratio": 0.83, "num_comments": 34, "comments": [{"body": "Pre and After hours are easier to move direction with less volume. I would be wary when you start getting irregular moves like this.\n\n\nIt can be used as window dressing for counter trades.", "score": 22, "replies": [{"body": "I've been suspicious that it's something like this. It feels like the past week has just been levitation. Everyone keeps calling for the uptrend to resume but I just find it hard to believe.", "score": 2, "replies": [{"body": "Do what the pros do, sit it out on cash. Markets near all time highs, interest rates are not dropping, and the economy is starting to slow down.\n\n\nA pullback is likely sooner rather than later. Whales need to manipulate and be clever to unwind large positions since there is less volume at these levels.", "score": 5, "replies": [{"body": "Exactly what I've done. Closed all positions on SPX about 2 weeks ago waiting to see what unfolds. Hoping that makes me the smart money and not the dumb money!", "score": 1, "replies": [{"body": "Your literally sitting next to Warren Buffet rn so your in a good spot.", "score": 1, "replies": []}]}]}, {"body": "what could catalyze another selloff?", "score": 1, "replies": [{"body": "For me the question is more like \"what would justify hitting new all time highs?\" given the macro situation: no signals that easing or lower rates are coming soon, persistent inflation, mediocre economic data, mediocre earnings, war in the middle east, war (still) in Ukraine", "score": 5, "replies": []}]}]}]}, {"body": "Volatility AH is par for the course", "score": 6, "replies": []}, {"body": "Tomorrow it'll be down by $2", "score": 10, "replies": []}, {"body": "You're not going to make any money gambling on spy if you're trying to use logic to beat it", "score": 16, "replies": [{"body": "I lost a little cash in that reversal.  I like to understand my mistakes and this one has me stumped.  \n\nWhy is SPY on fire outside of normal trading hours and super flat during the trading day?", "score": 5, "replies": [{"body": "Low volume. It's the same reason shitcoins and pennystocks get pumped by one person buying.", "score": 7, "replies": []}, {"body": "Because Wall Street is completely dictated by criminals. Has literally nothing to do with supply and demand.", "score": 11, "replies": [{"body": "Don’t act like you could understand anything if your answer is this. lol", "score": 8, "replies": []}, {"body": "I have an insane but accurate theory on SPY and how the buying and selling is manipulated by the market makers. It’s not our government involved but a certain close ally. When good news hits regarding this ally it goes up and when bombs are withheld it’s bad for business.", "score": 1, "replies": [{"body": "Who could this certain ally be?!?!?", "score": 1, "replies": [{"body": "Based on volume by country? India.", "score": 1, "replies": []}]}]}]}, {"body": "It's to avoid paying out on 0dte calls", "score": 1, "replies": []}]}]}, {"body": "And getting it to give it all back or even half of it back, nearly impossible.\n\nTo me just looks like another massive V.", "score": 5, "replies": []}, {"body": "It’s like you’re buying the dip. \n\nI’m going to google this tonight.", "score": 2, "replies": [{"body": "There is no dip buying during the trading day otherwise we would have normal looking candles.  Why?", "score": 2, "replies": [{"body": "More momentum?", "score": 1, "replies": []}]}]}, {"body": "This morning was irritating. Outta nowhere the market jerked. Looks like it wants to shoot up but still got 503 gaps to fills.", "score": 2, "replies": []}, {"body": "Most of the stock movement in general happens outside of trading hours", "score": 2, "replies": [{"body": "Why tho?", "score": 1, "replies": []}]}, {"body": "easy comes...", "score": 1, "replies": []}, {"body": "You're gonna find a large percentage  of moves happen during off hours. \n\nIt takes less volume to move the price and then during the day the market takes some time to find direction.", "score": 1, "replies": []}, {"body": "Ikkkkzmskekekksskskssmookskskmskskmewo", "score": 0, "replies": []}, {"body": "Since i started investing, I put 2k into SPY and didn't take it out. \n\nBut then i did a few days ago AND OF COURSE THE MINUTE I TAKE IT OUT IT HAS UNPRECEDENTED GROWTH 😩😩\n\nand i put shit into JAGX and then it drops faster than it has in the past month as well as CUTR and FRGE and they both flop faster than in a hot minute.\n\nThere's no way I'm this dumb and terrible at this whole damn thing. I just want money 😤😩", "score": -3, "replies": [{"body": "The first mistake was wanting it. The second mistake was thinking you can time it", "score": 11, "replies": []}, {"body": "Would you have sold after today? No, you would have kept it to see where it could go.\n\nYou’re buying high and selling low. Be patient dude", "score": 4, "replies": []}, {"body": "Secret with Spy and other index funds is to stay in… They always go up in long term. You can’t time it perfectly, maybe get lucky once or twice. Best you can do is buy the dips.", "score": 2, "replies": []}]}]}
{"title": "In Tesla Autopilot probe, US prosecutors focus on securities, wire fraud", "selftext": "", "id": "1cn43oh", "created_utc": 1715173580.0, "score": 131, "upvote_ratio": 0.89, "num_comments": 37, "comments": [{"body": "Its called Full self driving for god sake.\n\nIt hasent been doing that yet.\n\nhow isnt this fraud?", "score": 23, "replies": [{"body": "The usual defense is saying “no reasonable person would believe Red Bull literally gives you wings, so only morons would believe full self driving means full self driving”. Silly but the usual response.", "score": 8, "replies": [{"body": "Thats actually what Elon describes it as.. thats the point its all BS", "score": 3, "replies": []}, {"body": "Red Bull lost that case, and changed their saying to “red bull gives you wiings “", "score": 1, "replies": []}]}, {"body": "When cruise control was invented there was a rash of lawsuits about its inability to brake or steer.  Today it seems dumb, but no one knew what it was then.", "score": 7, "replies": [{"body": "Oh man, cruise control isn’t even blatantly misleading naming. Imagine if they’d called cruise control “total auto driving”", "score": 5, "replies": []}]}, {"body": "My car can self-drive quite well on most SoCal streets.  Freeways and large thoroughfares are smoothest.  \n\nBut…I didn't pay anything for the feature and can turn it off whenever i want.", "score": 2, "replies": []}, {"body": "Because money.", "score": 4, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Full self driving is not a certified legal term. Same as healthy and nutritious", "score": 0, "replies": [{"body": "Fun fact: food/drink brands have gotten in trouble for falsely suggesting their product is health. VitaminWater and Nutella are cases that come to mind. Though, I think brands never get in too much trouble (usually they get fined a little and have to change their advertising practices).", "score": 3, "replies": []}]}, {"body": "I dont know man, I logged like 350 miles of this car doing self driving last month while I just rode along watching. Sure it isn't perfect but it seems pretty much as described.", "score": -5, "replies": [{"body": "Would you put your kids in the back seat and send them across the city in rush hour traffic to Grandma’s house with the front seats completely empty? \n\nI’ve put a lot of miles on FSD as well, but I can’t get any work done while it’s driving. It’s beyond impressive at times, but at the end of the day, there’s more stress and cognitive load supervising FSD than there is just driving. \n\nBasic autopilot on the highway and in stop and go traffic is brilliant. I love it. But there’s no way around it. Full self driving doesn’t exist and taking tens of thousands of dollars from hundreds of thousands of buyer’s for a feature that doesn’t exist is a problem. Many people paid for FSD as far back as 2016 and at the very least, Tesla should refund that money. \n\nInvestors counting on Elon’s yearly promise of robotaxis is an entirely different issue that’s hard to ignore. This isn’t a “naming” issue. Elon has literally been saying year after year that robotaxis were just around the corner.", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Feel bad about TSLA?\n\nDon't like Elon?\n\nDon't like the TSLA sub?\n\nNothing good to write about? Post in here!\n\nThere’s a stickied post made just for you! Simply open the post on the TSLA sub (first sticky post), and comment to your hearts desire. \n\nThe title is “Post all Bearish/Negative Sentiment News/Comments/Thoughts in here!”\n\nJust a fair warning, if you do write anything disrespectful - you will be banned.", "score": 1, "replies": []}]}]}, {"body": ">I logged like 350 miles of this car doing self driving last month\n\nDamn, you must be an expert!", "score": 1, "replies": [{"body": "nope just someone who used it for the first time and thought it was pretty nice", "score": 1, "replies": []}]}]}]}, {"body": "Finally", "score": 3, "replies": []}, {"body": "Good. I bought three Teslas with it. I will join class action suits and can prove damages.\n\nBecause of this, Tesla's labor practices, and Musk, there is very little chance I'll buy another Tesla in the foreseeable future. Bought a Tacan, an EV9, and an EV6 and they are much better cars in almost every way.", "score": 5, "replies": [{"body": "Nobody cares", "score": -1, "replies": []}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "Feel bad about TSLA?\n\nDon't like Elon?\n\nDon't like the TSLA sub?\n\nNothing good to write about? Post in here!\n\nThere’s a stickied post made just for you! Simply open the post on the TSLA sub (first sticky post), and comment to your hearts desire. \n\nThe title is “Post all Bearish/Negative Sentiment News/Comments/Thoughts in here!”\n\nJust a fair warning, if you do write anything disrespectful - you will be banned.", "score": -2, "replies": []}]}, {"body": "Felt like this was overdue but won’t lead to anything.\n\nHonestly the bigger security investigation should be on musk about his tweet about stock buy back and apple.", "score": 6, "replies": []}, {"body": " byd says fsd is pipe dream and this is the first time I believe in anything that they say", "score": 1, "replies": []}, {"body": "I don't see the link between FSD and wire fraud. It feels like this title was written by chat GTP 2.1...", "score": -1, "replies": [{"body": "You dont have much knowledge of prior wire fraud stock cases do you?", "score": 5, "replies": []}]}, {"body": "This is old info they are dragging up from 22. The truth is we have no idea what’s going on. All the articles you see spring from the Reuters article. And we know they do nothing but trash Tesla. People panic sold the last how many times they spun stories.  Fact is Tesla must be getting pretty close to disrupting a whole lot. Bc negative spin and hit pieces are at an all time high.  And so are short positions.   They will lose billions of Tesla stock flies.", "score": -1, "replies": [{"body": "They’re so close! So close! Always and forever so………..close……", "score": 2, "replies": []}, {"body": "Nope I have friends that got laid off the FSD team. It’s nowhere. They laugh when I asked.", "score": 2, "replies": []}, {"body": "Disrupting crowds of pedestrians the 'cars' plough through.", "score": 0, "replies": []}]}, {"body": "The thing is Tesla investors have demonstrably not priced in FSD at all until maybe just recently.\n\nLiterally game changing news would come out about FSD and the share price would just stay flat.\n\nThe things FSD is doing today clearly indicate that it is a real thing that is happening, not fraud. Making optimistic forward looking statements isn't fraud.", "score": -6, "replies": [{"body": "Absolutely delusional tbh. FSD is years behind and no where near where it needs to be based on what was promised and conceptually won’t get there without either A) musk admitting he was wrong about lidar or B) some world changing breakthrough in machine vision algorithms that none of the smartest people in the world working on this stuff has even conceptually thought.", "score": 5, "replies": [{"body": "World changing breakthrough in machine vision algorithms is here, now. I'm being driven by it every single day. It is easily good enough for Tesla to declare it level 3 and turn off driver monitoring in the majority of environments.\n\nI am a robotics engineer. Musk is correct about Lidar. It is a totally useless waste of money given Tesla's existing capabilities.\n\nIf I were adding sensors to a Tesla, the very last thing I would add is a lidar. The failure modes overlap almost entirely with cameras'. A high resolution radar will probably make sense to achieve superhuman capability in poor visibility. A forward facing infrared camera will probably make sense to achieve more nines on VRU perception.", "score": -5, "replies": [{"body": "I mean, you (and Musk) are really out on an island with that viewpoint in the industry. Robotics engineer != ML expert and this is a good example. \n\nAnd no, they absolutely haven't had the breakthrough they need. Basically, to get around the lack of LIDAR, tesla needs to spackle over that gaping hole with a software fix that many in the industry isn't sure is conceptually doable. You're letting your fanboyism of Tesla/musk cloud the reality of the situation. This isn't some big secret in the industry of computer vision. Tesla does not currently possess an answer to the problems they are facing with true autonomy. \n\nMusk making up the fact that LIDAR isn't useful bit him in the ass, and for both investors and drivers, he really should just man up and admit he was wrong.", "score": 4, "replies": []}]}]}, {"body": "So all those times from 2016-now when Musk stood in front of cameras and said you'd be able to rent out your Tesla as a robotaxi or summon it from across the country unassisted and that it was coming THAT year and they were capable of doing it NOW.  Investors didn't price that in?  It's worth like 8x the total market cap of every other automated combined because...it sells cars just like they do?", "score": 2, "replies": []}]}]}
{"title": "NVDA earnings play", "selftext": "Dear Regards,\n\nLast two quarter earnings release NVDA started taking a big dip a week prior to earnings due to the uncertainty. Last earnings release we saw NVDA drop from mid 700s to 650. Prior to that from 500 to 400. We also have CPI coming in hot next Wednesday. CPI forecasts have been off by .1% the last 4 prints. So the 3.5% estimate might end up being 3.6 or 3.7%. If we get a hot CPI, markets are definitely gonna tank. And with oil prices, housing and insurance sky rocketing CPI might hit 4-5% by summer. \n\n# Fed’s Kashkari also indicated that we may get a rate hike.\n\nI'd buy NVDA when the dip comes in a week or two. Try to buy dollar cost average options once NVDA drops below 820.\n\nAnother day, another slay", "id": "1cmv0zv", "created_utc": 1715139409.0, "score": 31, "upvote_ratio": 0.74, "num_comments": 37, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 69 | **Previous Best DD** | \n**Account Age** | 4 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "The poor fool. I suggest you short that bet, AdventurousGood5214 will be broke soon.", "score": 42, "replies": [{"body": "Is this financial advice? Do I sell naked 820 calls on the dip?", "score": 13, "replies": [{"body": "as someone who sells naked nvda calls my advice is to just not do that lmao", "score": 4, "replies": []}]}]}, {"body": "Strangle this bitch", "score": 18, "replies": []}, {"body": "Jpows last press conference assuring no rate hikes this year is essentially insurance against any hot cpi report that might come in. NVDA’s 10% correction created a new support level. It’s only going up from here.", "score": 27, "replies": []}, {"body": "Just buy calls seems like what is logical ends up being the opposite of true in this silly market", "score": 7, "replies": []}, {"body": "Nvidia will probably go down before or shortly after the earnings, even if they are exceeded this could happen, because it is already priced into the share price that they will have to be strongly exceeded.", "score": 6, "replies": [{"body": "A stock split isn't fully priced in though. It's now or never! ![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}, {"body": "More about Europlasma! 🚀🚀🚀", "score": 6, "replies": []}, {"body": "Unless WW3 kicks off... \n\nNVDA gonna keep going up like a fresh Bluechew", "score": 9, "replies": []}, {"body": "Go on and buy PUT on NVDA, there are too many of NVDA PUT loser,you can find them and wipe your tears together even you lose it all", "score": 21, "replies": [{"body": "They will print as you regards buy at 900-1000 levels.", "score": 5, "replies": [{"body": "All it takes is NVDA mentioning a stock split to send it to 1k best to play before earnings because theres been rumors on splits and I aint boutta get railed by NVDA again this year lmaoo", "score": 13, "replies": [{"body": "I mean if it actually does split again just reload on 700 📞", "score": 2, "replies": []}]}]}]}, {"body": "Plot twist cpi comes in cooler than expected.", "score": 9, "replies": [{"body": "no way", "score": 3, "replies": [{"body": "Unemployment ticked up. \n\nThere are indicators that consumers are spending less. \n\nRents are stabilizing and in some areas decreasing. \n\nCould be a surprise.", "score": 8, "replies": [{"body": "Yeah a surprise above expectations ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 0, "replies": []}]}]}, {"body": "Honestly could be bearish for market if it comes in “too” cool. Means recession.", "score": 1, "replies": []}]}, {"body": "Roger that🫡 ill fullport calls again on dip", "score": 3, "replies": []}, {"body": "Simple strategy with guaranteed return: Buy and dca nvdq as nvda stays in 850-950 range. Sell at 850 and below. And buy and dca nvdl at 750-850 nvda range. Rinse repeat.", "score": 5, "replies": []}, {"body": "SQQQ", "score": 2, "replies": []}, {"body": "This aged nicely", "score": 2, "replies": []}, {"body": "Calls", "score": 1, "replies": []}, {"body": "Aged well, nice work sir", "score": 1, "replies": []}, {"body": "Would a bull put spread be a good idea?\n\nOr buying a strangle say 6 months out?\n\nor?\n\nLooking for a low risk play, which will result in lower gains, which is fine", "score": 1, "replies": []}, {"body": "Oil got rejected and went down hard. Good luck", "score": 1, "replies": []}, {"body": "Imagine buying NVDA at $900-1000 levels. Thats like asking to become exit liquidity. Im loading up on puts for earnings. Also the regards doubting me that NVDA is not a bubble dont forget it tanked 10% in a day not too long ago over SMCI not announcing earning estimates.  Its a ticking time bomb and it should not be brushed off.", "score": -12, "replies": [{"body": "I made big mistake not buying after it fell 10%- hope it crashes after earnings", "score": 6, "replies": [{"body": "If everyone hopes to buy on the dip, it wont dip", "score": 4, "replies": [{"body": "Why did it dip 10% that TSM earning aftermath day? Whatever that was need to happen aGain", "score": 2, "replies": [{"body": "the dip might not get bought up if guidance disappoint.", "score": 3, "replies": []}, {"body": "Probably because SMCI not announcing earnings estimate made everyone think that was a sign they will have a bad report which spooked the NVDA crowd", "score": 2, "replies": []}]}]}, {"body": "I think it will dip before earnings because market makers want to buy your shares cheap.", "score": 1, "replies": []}]}, {"body": "I’m not regarded enough to buy puts on NVDA but there is not much upside left short term, wouldn’t be surprised to see $650 before 2025", "score": 0, "replies": []}]}]}
{"title": "Tesla : Is BIG trouble coming by July 1 ?", "selftext": "Per CNBC, Tesla must provide NHTSA with Autopilot recall data by 1st July or face up to $135 million in fines!!!\n\nNow, this is what people have been asking for years but Tesla has managed to avoid so far. But, now NHTSA has finally drawn the line in sand - July 1. $TSLA went down almost 4% today. If the data is as bad as authorities suspect, $TSLA is going to see lot of trouble ahead. Tesla shares recently popped up significantly just because Elon said Tesla will focus on cheaper cars “Robotaxis” for 2025! Well, how many times he has over promised and under or never delivered? I think, Tesla will soon give up these gains and again dip below &150 and eventually down to $125 and $130 range. \n\nhttps://www.cnbc.com/2024/05/07/tesla-must-provide-nhtsa-with-autopilot-recall-data-or-face-fines.html?&qsearchterm=tesla\n\n", "id": "1cmvx0t", "created_utc": 1715142373.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 36, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 73 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Wow OP, u do have a unique skill for clickbaity headlines! \n\nAlso, do you have any puts or is this just mental masturbation?", "score": 33, "replies": [{"body": "I’m not good at puts, so no puts. But, I’ll buy when price is right. It just spiked after earnings call just bc Elon said “robotaxis”.", "score": -13, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}, {"body": "Positions or ban", "score": 20, "replies": [{"body": "Why you’ve to have position to express your opinion?", "score": -12, "replies": [{"body": "If you really believed your opinion you would have a position", "score": 9, "replies": [{"body": "I am not good at shorting stocks and I believe it’s not worth buying at these levels so I don’t have a position. Once it reaches my price range $125-$140, I will definitely buy. \n\nElon has just way too much ego and way too many distractions. Just look at his comments on X about everything.. he just had comments about some posts by JK Rowling, the author of Harry Potter novels, seriously?", "score": -4, "replies": [{"body": "It actually hit $140 in the dip before earnings. Sounds like you might have missed the boat.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I tried shorting some stocks 2-3 years back and lost each time. So, if market is going down I just sit and wait. So, I only invest when market is going up.", "score": 2, "replies": []}]}, {"body": "You can't be \"bad at shorting stocks\" and good at buying them, you were just wrong then and lucky later. You are just bad at timing markets, maybe this isn't your thing.", "score": 0, "replies": []}]}]}, {"body": "Uh…Yes", "score": 1, "replies": []}]}]}, {"body": "NHTSA has an annual budget of less than 50M. Unless politicians get involved, they ain't doing shit.", "score": 7, "replies": []}, {"body": "My theory with tesla is all the issues with used teslas and EVs in general.\n\nResale value will be a factor in a few years Imo\n\nThis has to impact company value.", "score": 6, "replies": []}, {"body": "OP, just say you are bag holding Ps before earnings.", "score": 2, "replies": [{"body": "I’ve no Tesla shares and I see no reason to buy it just bc last week Elon said robotaxis are coming. He’s been saying this forever now. I’ll be a buyer at $125-$130 range.", "score": 2, "replies": [{"body": "Stock was $140 two weeks ago and you weren’t a buyer? 😂 missed out on a quick 20% return…", "score": 2, "replies": [{"body": "Yes, that was close but still not in my target range.", "score": 2, "replies": []}]}]}]}, {"body": "Priced in, also \"fsd\", \"robotaxi\", \"optimus\", \"brain chips\", \"mars colonization\", did I almost forget \"AI\"\n\nAND CARS, lots of them on the lots collecting dust", "score": 2, "replies": []}, {"body": "135 million. Elon blows that on Twitter every day. He wouldn't even notice it gone.\n\nPs elon is a cuck but a rich cuck", "score": 3, "replies": [{"body": "A cuck indeed, but a cuck on a cushion of money.", "score": 1, "replies": []}]}, {"body": "I mean 135 million ain't even that bad anymore with companies being worth trillions of dollars", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That’s precisely I mean. The problem is that if Tesla reveals all the data concerning FSD, their competitors and the world will know lot of things Tesla doesn’t want to share. It could lead to more lawsuits who knows. And, if they don’t share this info, they get fined $130 million, more scrutiny from NHTSA and even more agencies bc hiding info never works. Depending upon what’s in the data, it can have far reaching influence on Elon’s renewed bet on robotaxis project.", "score": 2, "replies": [{"body": "Sounds like a lose-lose situation for Tesla. Time to short those stocks!", "score": 1, "replies": []}]}]}, {"body": "This sounds like a shit post.   What’s your position here????!?!", "score": 1, "replies": []}, {"body": "Be bullish on humanity, feds never cracked down on innovation. It will only provide TSLA more growth in the long term. This inconvenience alone cannot justify losing 30% market cap", "score": 2, "replies": [{"body": "But don't forget they recently went from sub-140 to 198. The company has basically been on fire, and the only thing that made it go up is complete bullshit on a call - robotaxis.", "score": 2, "replies": [{"body": "Exactly!", "score": 1, "replies": []}]}, {"body": "A lot of the best innovators either got laid off or left because they watched all there friends get laid off", "score": 1, "replies": []}]}, {"body": "They just dumped the workforce and in particular the charging station initiative as I understand. 135million fine is nothing.", "score": 1, "replies": [{"body": "Breaking up—it's hard to do.", "score": 4, "replies": []}, {"body": "If everyone realizes Tesla would rather pay $135mm than publish their full autopilot data then that's going to do a lot of damage to the stock when people start imagining how bad the numbers must be to be worth hiding them like that.", "score": 2, "replies": []}]}, {"body": "They should just pay the fine", "score": 1, "replies": []}, {"body": "And now you know why Elon talked about robotaxis! He knew they were getting investigated. So he tried to goose the stock like he always does. It worked", "score": 1, "replies": []}, {"body": "No", "score": 0, "replies": []}]}
{"title": "BA to new lows", "selftext": "[deleted]", "id": "1cmwfhn", "created_utc": 1715144207.0, "score": 14, "upvote_ratio": 0.72, "num_comments": 34, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 7 hours ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Fuck it im in lets roast BA", "score": 13, "replies": [{"body": "Be careful, Agent 47 could be lurking on this sub\nIt’s a great company, all recent incidents are fake and created by propaganda against the company. No one has ever lost their life on a Boeing plane. All planes are so secure down to the single bolt on your seat.", "score": 10, "replies": []}, {"body": "BOeING—the noise the plane makes when it lands with no landing gear this morning in Turkey", "score": 2, "replies": []}, {"body": "LFG!!!!", "score": 1, "replies": []}]}, {"body": "need to kill more whistleblowers", "score": 11, "replies": []}, {"body": "My man planning for a $10 drop so he buys puts $25 out of the money 3 weeks out, would basically need a new ATL to hit. \n\nGood luck with that", "score": 3, "replies": [{"body": "25 contracts at $0.30. -4% in the next two weeks will do just fine", "score": 3, "replies": [{"body": "Get your money up so you can afford contracts that actually have a chance….", "score": 3, "replies": []}, {"body": "That’s still $750 you’re not getting back 😭", "score": 2, "replies": []}]}, {"body": "Boeing was below $100 4 years ago. Kind of weird it hasn’t tanked more as the hey makers keep coming.", "score": 2, "replies": []}]}, {"body": "I’m confused how Will a 1 hour descending triangle signal it’s gonna keep going down for the the next 3 weeks", "score": 3, "replies": [{"body": "You stupid motherfucker. Don’t you see he drew the arrow going DOWN? Jfc. You guys…", "score": 12, "replies": []}]}, {"body": "This is the loading zone....BA is no meme stock... Major defense contractor... One of two aircraft producers on the planet.... Major manufacturing employer. (Aka... too big to fail)\n\nI would only bet against it in the very short term.", "score": 3, "replies": []}, {"body": "They're killing the whistleblowers and you dare sell. Sounds bullish to me.", "score": 3, "replies": []}, {"body": "\"I pitty the fool who mess with BA\"", "score": 2, "replies": []}, {"body": "Ayooo let it be known by the BA “suicided” squad that I have no part in any of this regarded activity", "score": 2, "replies": []}, {"body": "Y'all are ruining my puts", "score": 2, "replies": []}, {"body": "What are you using to draw the lines?", "score": 2, "replies": []}, {"body": "hey everybody, trust this guy!", "score": 2, "replies": []}, {"body": "I have a flight Sat and I refuse to inquire.", "score": 1, "replies": []}, {"body": "Buying leaps around 160 was my plan for a while just didn't think we would get there but Boeing is trying its best to run itself into the ground", "score": 1, "replies": []}, {"body": "How's that going for ye chief?", "score": 1, "replies": [{"body": "Day 1 update: bad", "score": 1, "replies": []}]}, {"body": "I’m loading up on them let’s go!!", "score": 1, "replies": []}, {"body": "I think you left out a pretty important part of that graph to the left 🙃", "score": 1, "replies": []}, {"body": "https://preview.redd.it/dsoxxvgarbzc1.png?width=1170&format=png&auto=webp&s=31e3d591f7bde2d1b77f5bc8d0a3284627fae4a1\n\nBulls don't have weekly timeframes or what?", "score": 1, "replies": []}, {"body": "Good for you.", "score": 0, "replies": []}, {"body": "Won’t happen. It’s doing fine", "score": 0, "replies": [{"body": "Source?", "score": 2, "replies": [{"body": "“trust me bro”", "score": 3, "replies": [{"body": "and 4Chan", "score": 1, "replies": []}]}]}]}]}
{"title": "In Tesla Autopilot probe, US prosecutors focus on securities, wire fraud", "selftext": "", "id": "1cn35ff", "created_utc": 1715170722.0, "score": 122, "upvote_ratio": 0.88, "num_comments": 34, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 225 | **Previous Best DD** | \n**Account Age** | 4 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Did Elon lie to me? Am I not going to drive around with robotaxis this year? I’m ashamed and depressed now.", "score": 46, "replies": [{"body": "Only if you live in China.", "score": 10, "replies": []}, {"body": "Also, he was like \"we are going to make more affordable Tesla\", but if they could, they would just make them to not slash prices on the existing models.\n\nI really need to start making money from scams like Tesla.", "score": 8, "replies": []}, {"body": "Coming up on 10am on a Tuesday in Texas, Elon's probably made another material false statement or omission.", "score": 3, "replies": []}]}, {"body": "What if the autopilot feature was like Amazon fresh checkout. That subscription fee was actually paying somebody’s salary in another country, and they were driving your car remotely ![gif](emote|free_emotes_pack|trollface)", "score": 23, "replies": [{"body": "AI = an Actual Indian", "score": 23, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 4, "replies": []}, {"body": "AI = Actual Idiot", "score": 1, "replies": []}]}]}, {"body": "Head of IR quits immediately after Musk pulls the stock out of a tailspin with more grandiose FSD promises. Nothing to see here...", "score": 19, "replies": []}, {"body": "Enron Musk", "score": 11, "replies": []}, {"body": "I cant promise that Ill be able to turn lead into gold \"any day now\" for 15 years to investors? Yeah, I knew it was a lie, but, you know, free speech, amiright?", "score": 9, "replies": []}, {"body": "A majorty of Tesla owners:\n\nhttps://preview.redd.it/rtcc04q1f9zc1.png?width=658&format=png&auto=webp&s=78880c8e914bb967612f61ecb3569b8916b382a1", "score": 3, "replies": []}, {"body": "TSLA PUT back on the menu boys", "score": 12, "replies": [{"body": "My 28 calls are cooked", "score": 2, "replies": []}, {"body": "yeah its time to sell puts. I think you re late and confused", "score": 5, "replies": [{"body": "Nah, the fun is just getting started. ![img](emote|t5_2th52|31224)", "score": 6, "replies": []}]}, {"body": "brother they've been on the menu for the last 3 months lmfao", "score": 1, "replies": []}]}, {"body": "Elon is going to get obliterated if the SEC ever grows a pair to charge him with something.", "score": 8, "replies": [{"body": "Where do you think this investigation originated? Must’ve been about the four minute mark of their earnings call when said they’d be the market leader in robotic taxis. \n\nYou still won’t have FSD that’s safe but neither will the taxis… because there won’t be any taxis", "score": 6, "replies": []}]}, {"body": "Well good thing all his employees are super loyal. I'm sure no one's gonna blow any whistles or anything", "score": 6, "replies": [{"body": "You can blow my whistle ![img](emote|t5_2th52|4275)", "score": 5, "replies": [{"body": "What's the premium?", "score": 6, "replies": [{"body": "A Dave's single and a Frosty.", "score": 2, "replies": [{"body": "It there a market where I can sell the Dave's Frosty later on?\n\nAlso, what's the theta?", "score": 3, "replies": []}]}]}]}]}, {"body": "\"whether Tesla committed securities or wire fraud by misleading investors and consumers about its electric vehicles’ self-driving capabilities \" \n\nWeird way to avoid saying Musk and divorcing him and his mens rea from the situation.", "score": 2, "replies": [{"body": "Yeah, but the article mention's Elon Musk Statements, so they didn't avoid it at all. It's literally the next paragraph.", "score": 1, "replies": []}]}, {"body": "Wire fraud is the modern tax evasion and think it’s bs. Get em on the myriad of real crimes they committed", "score": 2, "replies": []}, {"body": "Give Elon the FTX CEO treatment.  Elon is responsible for deaths including people who weren’t Tesla owners plus fraud costing billions in damage while SBF merely did fraud.", "score": 1, "replies": []}, {"body": "Maybe they’ll find the evidence next to those windows he was allegedly paying for with Tesla’s money 😂\n\nSuck Elon’s C*ck", "score": 1, "replies": []}, {"body": "Gonna settle and this is a nothingburger", "score": 1, "replies": [{"body": "You can't settle a US Prosecutor's Charge. You can plead guilty and agree to the prosecutor recommending a reduced sentence or reduced punishment. The judge still gets to decide if you should suffer more.", "score": 3, "replies": []}]}, {"body": "Good opportunity to buy Tesla at a discount.", "score": -1, "replies": []}]}
{"title": "Robinhood Q1 Earnings - Is It A Trap?", "selftext": "**Summary:**\n\nI believe Robinhood is poised to blow expectations out of the water for it's Q1 earnings after hours today. The question is whether Q2 guidance is just as promising.\n\n* [Positive GAAP Net Income](https://s28.q4cdn.com/948876185/files/doc_financials/2023/q4/Q4-2023-Earnings-Presentation.pdf) in two of the last three quarters - growth in profitability will show Robinhood has turned it around for good\n* Strong product velocity with introduction of it's Gold credit card and growth of it's Retirement Products\n* International expansion into the UK and EU will grow user base\n* Promising [January and February 2024 metrics](https://s28.q4cdn.com/948876185/files/doc_events/2024/Mar/13/robinhood-markets-inc-february-2024-monthly-metrics.pdf)\n\n**Background:**  It doesn't take much to convince WSB to be bullish on $HOOD. Both equities and crypto have been reaching new all time highs in 2024. A telltale sign is the reemergence of meme stocks and alt coins - degenerate gamblers are once again watching their lifesavings bounce up and down on a stupid green app on their phone.\n\nhttps://preview.redd.it/dvtszvfdd8zc1.png?width=2762&format=png&auto=webp&s=4cf88eeab30867c40464f42ab2f3ae47332e9db1\n\n**Reaching Profitability:** In Q4 2023, Robinhood posted it's second profitable quarter ever with a net income of $30M. Additionally, both equities and crypto have been skyrocketing all of 2024, which drive more active users and more transactions on their platform. Favorable market conditions will likely show Robinhood is maturing out of their growth-at-all-costs stage.\n\nMore importantly however was a decline in Total Operating Expenses. In 2023, Robinhood had $2.4B in expenses, resulting in negative profitability accounting for the whole year. However for 2024, the company projects only $1.9B. This shows the company is finally maturing as a company and will continue to focus on delivering profitability over growth-at-all-costs. If revenues are up and the company has accurate projections on operating expenses, the company will have positive net income again.\n\n**International Expansion:** Some important metrics to look out for are related to Robinhood's expansion of stock trading into the UK and crypto trading into the EU. This is the app's first expansion into the international market.  The number of users only grew 2% (400k funded accounts) year over year between 2022 and 2023, and has essentially become stagnant after Q2 2021. This app desperately needs new users for growth. To determine how much it will grow we can look at a failed attempt to expand in 2019 (due to regulations) - Robinhood announced a 300k waiting list for the UK. Lets be cautious and use this same number despite it likely being higher in 2024. 300k extra users would 1.28% growth in funded customers in the UK alone. We know from it's Q4 report that it generates $81 per user however nearly 60% of revenue comes from margin investing, which is not allowed in the UK due to regulations. Now for some math:\n\n300,000 new users x ($81 rev/user x 0.4 excluding margin rev) = $9.7M additional revenue from the UK expansion. Q4 had $471M in revenue.\n\nNote: This plans were announced last quarter but actually launched in March 2024. These number are more useful in predicting guidance for Q2 rather than earnings for Q1.\n\n**Possible Speed Bumps:**  We've seen many times over the last few weeks where beating earnings expectations has an inverse affect on the stock price. META, TSLA, NFLX just to name a few. Although I am fully confident Robinhood will meet and exceed expectations, I'm concerned it could still tank after hours if it does not forecast another stellar Q2. \n\nConsider that the stock has already gone up 61%(!) over the last three months and is valued at $15B. It is trading at 64 forward P/E. For context Paypal is 12 and Square is 21. It must has very very strong Q2 forecast. \n\nIt's possible Monthly Users and Trading Volume will shrink in Q2 due to the recent slump both equities and crypto. The question is can international users and new products like the credit card offset these losses?\n\n**My Position:** Long 2000 Shares @ 17.82", "id": "1cn9lsy", "created_utc": 1715187647.0, "score": 37, "upvote_ratio": 0.8, "num_comments": 33, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 42 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "https://preview.redd.it/0xtwyvipi8zc1.jpeg?width=1024&format=pjpg&auto=webp&s=28222478d6f5aea04f0ad12461f11acbce89568f", "score": 30, "replies": []}, {"body": "Yeah everything shows robinhood to go up, but weve seen that plenty of times the past 2 weeks\n\n\nBut then again it could be another Crox situation", "score": 17, "replies": []}, {"body": "If rh can actually get their customer support to the level of fidelity, this is the best brokerage hands down.", "score": 15, "replies": [{"body": "I love robinhood but they need to offer a lot of products for corporations to even consider partner with them like HSA, 401k (not only roll over), 529, bonds, etc…", "score": 6, "replies": [{"body": "Also I need to be able to put more than one Roth account in here (one for my wife).", "score": 1, "replies": []}]}, {"body": "The need level 4 and portfolio margin to get some bigger money in there but yea i honestly like Robinhood better than E*trade", "score": 4, "replies": []}, {"body": "Years ago they switched from a phone number to email only support and then switched back. Fuck these fools. Customer support should be 5 stars. It’s the easiest part of all of this. \n\nRH is probably the future gambling, casino app. They probably have the screen time on their side, data wise. Really easy to see them squash these older companies with the younger generations as the elderly pass..however, they’ve proven they suck so fuck Robinhood", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/04qi198mh8zc1.jpeg?width=1290&format=pjpg&auto=webp&s=f0b1dfe28c1ac0562d4bc760405dbb11f7661c06\n\nproof", "score": 15, "replies": []}, {"body": "$18.90 as of right now", "score": 6, "replies": []}, {"body": "200%+ IV fuck that", "score": 5, "replies": [{"body": "Yep that's why I'm playing shares. IV will fuck a lot of people.", "score": 5, "replies": []}, {"body": "What does that mean? Bird brain over here 🥲", "score": 1, "replies": [{"body": "IV measures the volatility of a stock price. More importantly, it determines the premium for an options contract. \n\nIn practice, stocks with high IV need to move drastically in either direction or else it the value of the option contract will decay significantly. Gains will be less, and losses will be greater, whether you predict the side correctly or not. \n\nTL;DR do not play options with high IV", "score": 7, "replies": [{"body": "Thank you Boss!", "score": 2, "replies": []}, {"body": "Is this true for leap options? I bought Robinhood options expiring in 2025", "score": 2, "replies": [{"body": "Yes but the IV will change over the course of time. So some days it will decay faster and others slower. It's also possible the IV can become so high you will gain even if you're on the wrong side. \n\nIf you have a call on a $1 stock and it jumps to $100 then back down to $0.95, the premium will skyrocket. Your contract will be worth more even though the price went down. \n\nTypically the premium is inflated before an earnings. Also, this is why option sellers (institutions) win no matter what happens.", "score": 2, "replies": [{"body": "Wait so does that mean my leap options will be worthless after a year?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I dunno but I bought some $18 calls expiring next Friday so let’s hope you’re right", "score": 5, "replies": [{"body": "Same", "score": 1, "replies": [{"body": "Same, and they’re getting obliterated . I think the V comes soon", "score": 2, "replies": []}]}]}, {"body": "Holy crap good DD on wsb did I go back in time?", "score": 3, "replies": []}, {"body": "Let’s hope guidance is just as solid", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yeah they got hit with a Wells Notice. Soon they'll enter a similar lawsuit that Coinbase is already in where the government wants to have regulation over crypto. Not indicative of wrongdoing but could be bad for business for sure. I think it's further down the road however.", "score": 6, "replies": []}]}, {"body": "Down with Robinhood, I say.", "score": 4, "replies": [{"body": "Good bot, puts on hood", "score": 0, "replies": []}]}, {"body": "Hood is probably going to crash, Short/Puts for hood ER is the correct play.  \n\nToo many people have $20 calls, MMs won’t let the many degens make money. Either going to end up flat or -8%", "score": 4, "replies": [{"body": "Honestly don't disagree with you. The correct play is  inversing WSB and there are a lot of people thinking this will go up.", "score": 3, "replies": []}, {"body": "Haha I have $19 calls!", "score": 4, "replies": []}]}, {"body": "Whether a trap or not it’s criminal that DJT runs at almost 50 a share while making jack shit and a profitable business is questioned, invested in hood just to say fuck em.", "score": 2, "replies": []}, {"body": "I guess $HOOD was a trap", "score": 1, "replies": []}, {"body": "Hmmm I’ll make a case for either due to price action on a certain game stock….\n\nIt will go up: they need to prop up Robinhood to score some more AUM to balance their books to offset short positions in game stock\n\nIt will go down: Robinhood is still the sacrificial lamb in the whole game stock saga. In Jan 2021 Robinhood wasn’t public yet. This could easily be a “dump while taking profits, open short positions” aspect for Wall Street. IF it drops tonight, I don’t expect it to stay down forever but will let the blood drain out for the rest of the week before I enter a long position next week.", "score": 1, "replies": []}]}
