{"title": "Considering buying Pfizer", "selftext": "Pfizer is down almost 20% over the course of a month, and offering a 3.65% dividend. \n\nI’m considering picking some up since the appear cheap at the moment. \n\nI don’t much other than the fact that they are a huge biopharmaceutical company which Is a sector I have little exposure and knowledge.\n\nWould it be fair to say this company trades alongside covid vaccine related news and expectations at the moment? \n\nWhat do you guys think about Pfizer as a company in general and as a potential investment at this point?", "id": "10gzl6s", "created_utc": 1674228076.0, "score": 31, "upvote_ratio": 0.71, "num_comments": 65, "comments": [{"body": "Just a heads up, vaccine production tends not to be a big money maker long term. A bet on PFE is a bet that they used their windfall from COVID to invest in new companies and that those investments will bear fruit", "score": 29, "replies": [{"body": "Long term? True.\n\nWas it the single biggest product they’ve ever had? Yes. They “expected” to make $3bn to $5bn.\n\nThey made $65bn in the first year year from it and 2022 was expected to be $100bn revenue.", "score": 7, "replies": [{"body": "homer simpson buys pumpkins investment", "score": 2, "replies": []}]}]}, {"body": "Why do you think it appears cheap? How much do you expect them to do in net income in 3-5 years? Or in 10? How much growth does that translate to? What's a fair PE for such a growth rate? What market cap does that translate to? How much ARR is that from the current stock price? How big is the risk you're wrong? Does the ARR justify that risk compared to low risk investments (S&P or bonds)?", "score": 39, "replies": []}, {"body": "Pfizer is a pharma giant that has definitely ridden a wave of Covid related income. There’s a debate over how long that income stream will continue but I think there’s also added value in the technology, partnerships and knowledge the business has acquired over the past few years. There are few companies capable of doing what Pfizer did and we know they are strongly connected and positioned for future health crises. In my opinion it’s a reasonable valuation now. There are certainly more catalysts you can envision than downsides for the business in the future. Personally I made a ton on very cheap PFE options, which continue to be underpriced.", "score": 8, "replies": [{"body": "One thing we can say for sure is that in future pandemics, Pfizer/BioNTech/Moderna will get funding. Truthfully, had the mRNA not worked as well as they did, we'd probably be saying how amazing AstraZeneca's vaccine is.", "score": 0, "replies": []}]}, {"body": "Something for us to keep in mind is that there will be another pandemic in about two years. I assume that the DoJ will team with Pfizer just as they did this time.", "score": 5, "replies": []}, {"body": "Have had PFE for decades have 4 figure shares from reinvestment from 100s. My cost basis is 1/3 current price. Covid vaccine generates  >1% of corp revenue. They sell vaccine at cost since NIH give grant for the development. Not sure what elSE they got going. The rating from analysts Moringstar is 3 star and MSCI is rated A. Zacks 3 or B grade. Looks like time to load up these as there are other pandemics on their way.  These blue chip stocks are better than new ones, imo.", "score": 7, "replies": [{"body": "Blue chips are the way to go but I would sell all of Pfizer. Reminds me of the Sackler family.", "score": 2, "replies": []}]}, {"body": "….. Pfizer makes many well known drugs and has multiple in development for cancer and neurological applications.\n\nIf you heard of someone who utilized epipen, Eliquis or viagra they used a Pfizer product.\n\nEdit to add I work in healthcare but am only invested in Pfizer as the diversified holdings in my chosen ETF.", "score": 3, "replies": []}, {"body": "> Pfizer is down almost 20% over the course of a month\n\nbecause there is \"an ongoing investigation into the acquisition of COVID-19 vaccines in the EU\".\n\nhttps://www.fiercepharma.com/pharma/european-public-prosecutors-office-confirms-ongoing-investigation-european-unions-covid-19", "score": 3, "replies": []}, {"body": "Covid vaccines are a tough investment. You’re betting on how much uptake there will be in the future. It’s already become clear, IMHO, that the govt is unlikely to mandate anything other than the primary series. Booster uptake has been low, and this is while the govt has been paying for it. It will go private this year. \n\nThere are companies like NVAX that had a good vaccine but due to poor management and poor execution have made shareholders poor. \n\nI’m not sure I’d feel great betting on Pfizer. I honestly think if we *do* end up with common yearly shots, NVAX has a decent chance if their new CEO is any good and their combination shot works out — they’re trialing a combo flu and Covid shot using their Matrix-M adjuvant and if it works, I think a one-a-year flu and Covid shot will be compelling for a lot of people and insurers", "score": 6, "replies": [{"body": "Pfizer doesn’t just make Covid vaccines…", "score": 27, "replies": [{"body": "Username checks out!", "score": 8, "replies": [{"body": "Explanation: Pfizer made sildenafil (Viagra).", "score": 1, "replies": []}]}]}, {"body": "Covid vacccines are a pretty small fraction of their business.", "score": 2, "replies": []}]}, {"body": "There are no such things as \"cheap shares\", you can see their real value every second during trading hours", "score": 9, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "And who exactly thinks that a company is undervalued? For sure, not the market", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "This is correct but there are also lots of wellknown companies meeting all of these criterias - and investors lost a ton of money nevertheless within last year", "score": 1, "replies": []}]}]}]}]}, {"body": "Wouldn't say Pfizer trades around covid vaccines that much. It certainly gave them a boost but they were a juggernaut before that and will continue to be even as covid vaccines become less common.", "score": 2, "replies": []}, {"body": "\"What do you guys think about Pfizer as a company in general and as a potential investment at this point?\"\n\nVaccines are not a giant part of profits, but I don't know that I have tremendous confidence that what money that is will be reinvested well. Pfizer has had successes in the past, but they've also had misses (they would have overpaid massively for Allergan if it wasn't blocked) and the stock is around where it was a bit over 20 years ago. \n\n\"and offering a 3.65% dividend.\"\n\nEh. Should really not be a part of the thesis.\n\nI agree that you're probably seeing some rotation out of what has done well/safety into what hasn't and that's part of the reason for the PFE decline. It is technically oversold and certainly reasonable at this point - maybe something I'd consider trying to play a bounce in but personally not interested as a long-term holding.", "score": 2, "replies": [{"body": "As someone in the industry, Pfizer is known to be willing to throw a lot of money at things to get problems solved. They make use of a lot of CROs but it works. Pfizer is a reasonably stable company in a volatile industry.", "score": 2, "replies": [{"body": "Stock has been on downtrend for a while and its not reverting back to the mean.\n\nDo you think its a fairly stable company?   I personally think they need new management", "score": 0, "replies": [{"body": "The company is fine, it's a typical blue chip. It's down because it was inflated during the pandemic from vaccine revenue.", "score": 2, "replies": [{"body": "It has been on a non stop downtrend.\n\nI think they are gonna get accused of all the vaccine mess", "score": 0, "replies": [{"body": "The odds of a \"vaccine mess\" is practically zero.", "score": 1, "replies": [{"body": "All righty,  Im gonna follow your advice since you work in the industry.\n\nI typically wheel stocks but I dont mind bagholding PFE and collecting 4.25% dividends", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Did you notice that you think it looks cheap, but mentioned only that it's off its high? I see this constantly on Reddit.\n\nBeing off its high has zero to do with it being cheap. Many stocks are way down from highs but remain expensive.\n\nYou need to think about likely future earnings, cash flow and debt to determine whether it's cheap.", "score": 2, "replies": []}, {"body": "Pfizer is evil. Don’t support the evil.", "score": 3, "replies": [{"body": "Evil is where the money is.", "score": 3, "replies": [{"body": "Not necessarily. Don’t invest in your own genocide.", "score": 1, "replies": []}]}]}, {"body": "Tread lightly my friend, there could be very dark storm clouds ahead for Pfizer as more is revealed about this \"vaccine\".", "score": 1, "replies": []}, {"body": "There is something brewing in the EU around Pfizer. If the conversations between EU and Pfizer that are classified get out, ti could be a shock for the stock. The stock went up because of covid, and the shady stuff they did during that time, could bring it back down if it gets out.", "score": 0, "replies": [{"body": "If you know, what is it that hasn't gotten out yet?", "score": 1, "replies": []}]}, {"body": "Wow lot of vaccine hate here..look..we had to do something..should everyone have gotten it..after delta I got it because virus seemed to be getting stronger so it came to a crossroads of wait and the consequences could be severe so I took the vaccine..\n\nNow..compare us with China. They are still actively getting fucked up by the virus. It wasn’t a perfect fix but it absolutely stopped the maddness around the virus. If China gets smart and adopts the vaccine you’ll crush it. \n\nShould you get Pfizer..idk..it’s safe they are big and powerful. There will likely be a new generation of meds just around the corner here so yeah it’s worth a play. They aren’t a one trick pony.", "score": 0, "replies": [{"body": "China is getting fucked up by their vaccine not covid.", "score": -2, "replies": []}]}, {"body": "There stock will crash, it’s a matter of time, Moderna too, they screwed all of us, it’s a matter of time now", "score": -3, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "They can’t get sued.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -9, "replies": [{"body": "How will you act when your conspiracy theories never become reality?", "score": 3, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "I’d love to see the sources!", "score": 5, "replies": []}]}]}]}, {"body": "Before investing in Pharma, I would suggest you look back at past lawsuits against them, and any that are currently pending.  \nThose will show you a lot about the Pharma company, and how likely they are to have big lawsuits against them in the future.  The bigger the lawsuits, or the more they have, may indicate bad practices that will cause future loses.", "score": 0, "replies": []}, {"body": "is good for a short time, after that the risk increases considerably", "score": 1, "replies": []}, {"body": "Prefer moderna for its technology. They made RSV vaccine in the fastest time", "score": 1, "replies": []}, {"body": "I’m holding 10 shares currently it’s down but I’m still holding", "score": 1, "replies": []}, {"body": "See the post from the Canadian news organization that HUNTED down the Pfizer CEO at DAVOS. One question was,  should all the countries that were lied to by Pfizer get their money back. Ouch, Hugh risk.", "score": 1, "replies": []}, {"body": "Nah man that shit is whack. Keep watching it and if  goes back up then buy. You want to get in with the crowd not buy cheaper shares bc tomorrow it could be cheaper then what?", "score": 1, "replies": []}, {"body": "Good core holding. They have a lot in Pipeline Customized drug", "score": 1, "replies": []}, {"body": "Horrible idea", "score": 1, "replies": []}, {"body": "Yeah, I’m thinking the vaccine specific companies had the biggest bull run they’re ever going to have, but good luck.", "score": 1, "replies": []}, {"body": "I wouldn’t bet on it trading with vaccine news per se. The company has been around a long time. I think PFE is cheap when compared to the rest of the sector. Money is rotating out of pharma right now, and I wouldn’t be surprised to see more downside. DCAing slowly over time is the safest strategy IMO. But DCAing on steroids is another option if you think the discount is worth snatching up shares.", "score": 1, "replies": []}, {"body": "I like it and have added some. It's far more than a Covid vaccine company. Seems like a solid pipeline of products. No guarantees but it's a good long term play that appears to be on sale now.", "score": 1, "replies": []}, {"body": "Personally I wouldn’t, I know too little about the Pharma industry to go into Pfizer. Pharma counts on patents going through to earn revenue, sounds like you’d need too much medical knowledge or information that I’m not equipped with to make any informed decisions.\n\nMost of the argument for Pfizer I’ve read and heard is that “It diversifies my portfolio” which I find to be a one dimensional argument that makes no sense. Yes diversity is important but not diversify into things you have no clue about. If everyone digs a hole, and you decide to follow. When the time comes, they could be using it as a shell scrape while you’re using it as a grave. Analogy for other people would know when to sell but you don’t. \n\nKnow what you’re diversifying into.", "score": 1, "replies": []}, {"body": "I like bullish put spread, or just sell put on pfe", "score": 1, "replies": []}, {"body": "Damn, how rich are you?", "score": 1, "replies": []}]}
{"title": "Sandy Rant: Tesla Margins and Sandy was Right!", "selftext": "", "id": "10gzq4j", "created_utc": 1674228419.0, "score": 112, "upvote_ratio": 0.92, "num_comments": 54, "comments": [{"body": "FUCK YES!  In Munro I trust.  I especially love that Munro started out by publicly hating on Tesla and laughing at their build.  Then seeing him change over time and eventually go all in on EV's has been incredible.", "score": 63, "replies": [{"body": "Honestly if I hadn’t seen that for myself I don’t know what I’d think about him, but he’s done a complete 180 on tesla since his first videos on tesla.", "score": 29, "replies": []}, {"body": "Do you know any videos where he is hating on Tesla? I’ve been following too short of a time to know about it.", "score": 1, "replies": [{"body": "Yeah it's his first model 3 review.  It was before he started his channel.  So it was him and a panel of dudes talking about the model 3.\n\nThen you can watch his first model 3 drive where you can see the very first time he was impressed by the 3.  Then each time he tears down a newer model he gets more and more impressed.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 52, "replies": [{"body": "Got to love Sandy. Also he didn’t clarify specifically which quarter he was talking about for the 40% gross margins but later mentioned it was AFTER the price cuts. So the Q4 report next week could be EXPLOSIVE.", "score": 17, "replies": [{"body": "[deleted]", "score": 31, "replies": [{"body": "I bought more earlier today (been buying since 2011 let’s go). Still #1 conviction buy on the market and obviously largest position.", "score": 14, "replies": []}, {"body": "I doubt Tesla will ever again have the same ratio of ramped to ramping capacity as it did in 2021/2022. \nThey had two factories ramped and were ramping two more. Basically 1:1. They will have four factories ramped by mid year and I doubt they will ever try to ramp four new factories.", "score": 15, "replies": [{"body": "At least not until they have 8 factories (and are still going for 50% growth).", "score": 2, "replies": []}, {"body": "Why not? If it takes 2:2 to get the 50% growth per year, it is inevitable that at some point it will be 4:4.", "score": 2, "replies": [{"body": "Yeah they have to maintain to justify the market cap", "score": 0, "replies": []}, {"body": "You can continue ramping the factories you have already built", "score": 1, "replies": [{"body": "That would be the same my friend. You have 4 units of production capacity and you need to ramp another 4. The only difference is that you have existing employees/talent next door and you can use them to train new talent, which makes it a little bit easier.", "score": 1, "replies": [{"body": "> You have 4 units of production capacity and you need to ramp another 4.\n\nCertainly. But isn't ramping at existing sites cheaper and quicker than at new greenfield sites (like Austin and Berlin were) ?", "score": 1, "replies": [{"body": "It probably is, but I don't think it can provide the scale that we need. You can't ramp existing sites indefinitely. You will eventually need new sites.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Tesla is already amazing in that they’ve had the highest net margins among all volume auto makers. Even more amazing is that’s making only EVs, on which most legacy auto makers are losing money.  And yet even more amazing than that, is that unlike any other large manufacturer in history, Tesla is doing it while simultaneously growing 50%, which, as you pointed out, is very detrimental to profits.", "score": 2, "replies": []}]}, {"body": "Sandy was talking about what a real world margin would be if you add in all the little extras that Tesla makes, in contrast to the little extra *cost* the others pay. The numbers in the audited accounts will be closer to 27% after the first quarter. Last quarter there was too much going on, and that one might be down a bit.", "score": 13, "replies": [{"body": "Very good point. I’m also curious and haven’t seen discussed, the revenue recognition of FSD. Is it to be spaced out over a period of years like other softwares?", "score": 6, "replies": [{"body": "I'm not sure, though as I understand it they are already realizing a portion of it already. Sandy described FSD as pure profit, the rest of the stuff he was talking about was mostly \"swag\" and things like home chargers, charger adapters, that sort of thing. In the case of most manufacturers think floor mats and the like, a lot of which is of benefit to the dealers rather than the manufacturer.", "score": 5, "replies": [{"body": "Acceleration Boost = 2K", "score": 4, "replies": []}, {"body": "I beleive they only “shipped” and thus started realizing the revenue in Q4 so we haven’t seen it accounted for yet in a report.", "score": 3, "replies": []}]}, {"body": "It's recognized based on what Tesla's accountants believe is 'recognizable', e.g., a percentage of it based on the features they believe have been provided and can reasonably be priced in.", "score": 2, "replies": []}, {"body": "I believe I read about 50% has been recognized of FSD revenue.  So there is definitely still upside ahead.  I don’t think it’s unrealistic to think either the expanded Beta rollout they might recognize more… unless the “beta” marketing means something to bean counters.", "score": 2, "replies": []}]}]}, {"body": "He's adding the FSD portion. Since FSD has a low or probably not even existent COGS (depending on how they treat their FSD costs), 40% makes sense. Of course, this would be reliant on FSD actually working as Tesla is marketing them.", "score": 2, "replies": [{"body": "I understand that he’s adding that (which is ridiculous), but I’m curious about the REAL LIFE accounting implications of finally recognizing the revenue. Previously it’s been a liability as far as I can tell. (But cash flow nonetheless)", "score": 1, "replies": [{"body": "It's a liability in the sense that they haven't fully delivered the product and because of that, they can't record the cash they received as earned for FSD as a delivered product fully. It's unearned revenue which is considered a liability. In accounting, it would just be:\n\nWhen received (as an example, if FSD is $10k):\n\nCash $10k\n\nUnearned FSD Revenue $10k\n\nLet's say they reasonably estimated that 50% of FSD is delivered:\n\nUnearned FSD Revenue $5k\n\nFSD Revenue: $5k\n\nSo you basically just subtract $5k unearned FSD revenue from the $10k liability which results in net $5k unearned FSD revenue.", "score": 5, "replies": [{"body": "Yes I’m aware of that. I’m curious over what period or how they plan to recognize the money which will give clues about how the Q4 report shall look.", "score": 1, "replies": [{"body": "The above is how they record it from an accounting perspective. Their CFO already said they record 50% of FSD as earned when they receive payment for it and they gradually treat a percentage of the unearned FSD revenue as earned when they push out more improvements to it. That portion would depend on what their accounting and other departments feel is appropriate without getting into a battle with the SEC so it pretty much varies.", "score": 2, "replies": [{"body": "Got a sauce on that? Must have missed it", "score": 1, "replies": [{"body": "Q1 2020\n\n\"So there is a couple of things on the financials for Full Self-Driving.   \nAnd so, currently, in North America, it's sold for $7,000 as an option.   \nWe take roughly half of that as revenue, and the other half of it goes   \ninto deferred revenue. That's associated with features that will be   \nreleased with time.\"\n\nI'm not sure if that has changed with FSD increasing in price but I don't see why it would have any effect on how they recognize it.", "score": 7, "replies": []}, {"body": "Ir.tesla.com", "score": 0, "replies": [{"body": "Wow so helpful /s", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Talking out of one’s ass as pet detective is about decency, not being woke.", "score": 2, "replies": []}]}, {"body": "They're speculating 35-37% gross margin on the cybertruck. I would like their insight on the 3rd generation platform car once it gets presented. Tesla is already making the competition nervous with the recent pricecuts of the 3 and Y, now imagine when they introduce a <$30k car with 30%+ gross margin\n\nExciting times ahead", "score": 40, "replies": [{"body": "30%+ margin, might be a stretch, but 25%+ is doable in the foreseeable future.", "score": 17, "replies": [{"body": "Is it tho? If they can get enough people to sign up for FSD subscription once it's out of beta, it has the potential to be way more than 30% over the lifetime of the vehicle", "score": 2, "replies": [{"body": "> once it's out of beta\n\nAutosteer is still a BETA feature.  Its going to be a long time before FSD is not BETA.\n\nhttps://www.tesla.com/ownersmanual/model3/en_au/GUID-69AEB326-9831-424E-96AD-4021EABCB699.html", "score": 8, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "It is nowhere close to regulatory approval. It's not even close to being presentable to a regulator for approval as it's an instant failure. \n\nThere are dozens of problems they need to solve, like pulling over for emergency vehicles, that they haven't even really started working on.\n\nMaybe they can adapt it to some kind of L3/L4 solution in 4-5 years and get some kind of approval to run it on known good streets in good weather or something like that, but that will require an immense amount of data on the exact version for each model of car that it's going to run on.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": ">FSD is going to be a level 2 product up until the time they get regulatory approval, which is who knows when.\n\nNot necessarily. Waymo has been operating level 4 vehicles in several cities with the same level of \"regulatory approval\" that Tesla has (I think).", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They have been giving [fully driverless rides](https://www.youtube.com/watch?v=cKriYPN6gNg) to the public for awhile now, albeit with the remote takeover ability.", "score": 1, "replies": []}]}]}]}]}, {"body": "Nah, FSD needs a long time before they will ever get regulatory approval. It doesn't matter what Tesla thinks about it. If they can't get regulatory approval, FSD the way Tesla has imagined isn't going to happen. So still a lot of work to be done. In many areas, it is still not fully functional. Not even remotely close.", "score": 1, "replies": []}]}, {"body": "I have Tesla delivering ~5m cars in 2026. If only 2% of those pay for FSD and drive an average of 10,000 miles that year thats 1 billion miles driven. If my driving is any indication, half of those miles would be using AP/FSD. That’s an additional 500m miles per year input data to add to the current 100k users (what’s the current estimate of FSD users now that it’s effectively open to everyone?) which could be another 500m / year. In the next few years Tesla could be adding over a billion miles driven per year to its training sets.", "score": 2, "replies": [{"body": "Even the cars that don't buy FSD still collect data.  Tesla has a massive data advantage.  I believe Tesla will solve FSD eventually.  I believe they will solve generalized FSD first and it will unlock massive potential far beyond the value of a vehicle itself.  That being said, my timeline for marketable robotaxis is more like the end of the decade if everything goes well.", "score": 8, "replies": [{"body": "Agreed. I'm estimating 2030-2035 for fully autonomous, no human intervention needed, vehicles. And if Tesla is able to achieve that, it's pretty much game over not only for the auto industry but for transportation, how people travel, auto rentals, car insurance companies...", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I would guess the subcompact/3rd gen platform car might have lower margins, but it will be far less of a concern since (Elon said) they think it will outstrip all their current production *combined*. \n \nThat'll seriously put the hurt on the other entrants. The Model 3 may have gotten to the lifecycle cost of a Camry, but the initial purchase price is high for many, but if it's comparing directly to the Corolla's and Civic's of the world, why would I even consider ICE unless I really needed to for some reason?", "score": 2, "replies": []}]}, {"body": "Just watched it, love it", "score": 9, "replies": []}, {"body": "I hope he’s right! Profits could actually be insane in Q4 since the prices were largely at the old level. 🤞", "score": 8, "replies": []}, {"body": "I watched the full hour and a half Farzad / Cory interview on tuesday, so good. Highly recommended if you want to get into the weeds of auto manufacturing.", "score": 6, "replies": []}, {"body": "OT..anyone have experience wit the 'sexy buttons'. I think the idea is kinda cool but at first glance they look sorta cheap. How do they look in reality (specifically when you have a white interior)? Do they integrate well with the look of the interior inyour opinion?", "score": 5, "replies": [{"body": "Tesla should make this concept stock (with better integrated aesthetics). They could let you map 4 smart buttons to any function through the touchscreen like radio or fan speed.", "score": 5, "replies": [{"body": "This!", "score": 1, "replies": []}]}, {"body": "I would straight up hide them. I'm considering them but *really* dislike the look. A possibility would be on the back of the screen where you can drape your hand over the top and rely on muscle memory from there.", "score": 8, "replies": [{"body": "Good idea, and the concept itself is genius. It's one of those \"Why didn't I think of that?\"", "score": 4, "replies": []}]}]}, {"body": "Spoiler: they costed the 4680 Model Y back in July at $39,300. This was the standard range AWD 4680 so the costs would be less than the normal Long Range. However materials costs were a lot higher back then too, and USS was part of the cost. Paired with the additional economies of scale of production they have now, it seems reasonable to me that the LR is probably somewhere around $40k and the Austin 4680 is probably around $38k?\n\nThat would be about 24.5% margins on the base versions, not including FSD, paint, wheels, etc..", "score": 6, "replies": []}, {"body": "Whose ignorant opinion was he ranting about?", "score": 1, "replies": []}]}
{"title": "OK, $GOOGL!", "selftext": "[deleted]", "id": "10gyjec", "created_utc": 1674225468.0, "score": 98, "upvote_ratio": 0.74, "num_comments": 63, "comments": [{"body": "[deleted]", "score": 116, "replies": [{"body": "[deleted]", "score": -19, "replies": [{"body": "Why are you scared?", "score": 14, "replies": [{"body": "Why would L. Bondstuy be scared? Larry B. is never scared.", "score": 8, "replies": []}]}]}]}, {"body": "3800 shares 🤑", "score": 91, "replies": [{"body": "How is owning 3800 shares of Google a bet? Might as well post Index fund gains.", "score": 50, "replies": [{"body": ">How is owning 3800 shares of Google a bet?\n\nI'm pretty sure that buying an index fund is considered a lot more diversified than buying a single stock.", "score": 22, "replies": [{"body": "So slightly more lame than posting single day gains on a large cap blue chip stock. Gotcha.", "score": 7, "replies": [{"body": "I personally think Meet Kevins videos are the epitome of \"lame\". \n\nTo each their own of course.", "score": 2, "replies": [{"body": "Not sure what you mean. His loss porn is great fap material.", "score": 1, "replies": [{"body": "It's probably one of the shittiest channels on the entire YT imo and i can't focus on busting when i'm cringing my ass off anyway.\n\nWSB offers enough loss porn to get my off and in here i don't need to listen to Kevin's dumb shit.", "score": -1, "replies": [{"body": "I have no idea why on earth you're even talking about him. Do you randomly just go off on a tangent about the dude in a thread?", "score": 3, "replies": [{"body": ">Do you randomly just go off on a tangent about the dude in a thread?\n\nYou're the one who bought up things that are lame, not me.", "score": 0, "replies": [{"body": "Furies are also lame, but I don't just randomly rant about them unless someone dresses like them in the subreddit.", "score": 2, "replies": [{"body": "I just found it ironic, that's all.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Got ‘em!", "score": 4, "replies": [{"body": "Got 'em", "score": 2, "replies": [{"body": "Got ‘em", "score": 2, "replies": []}]}]}]}, {"body": "why are you hiding shares and avg cost lmao", "score": 52, "replies": []}, {"body": "All they had to do was lay off 12,000 employees. Blood for the stock machine!", "score": 13, "replies": [{"body": "Everybody copying Elon now.  I wonder how many guys are outside Google now with a box acting like they got fired?", "score": 6, "replies": []}]}, {"body": "The January 2025 calls are still cheap.", "score": 7, "replies": [{"body": "Define cheap", "score": 1, "replies": [{"body": "Well even after a huge rally the Jan 17 2025 Goog 100 c is $20", "score": 5, "replies": [{"body": "20*100= $2000. „Cheap“", "score": 5, "replies": [{"body": "You must be new", "score": 4, "replies": []}]}]}]}]}, {"body": "Fellow chase investor", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4275)", "score": 3, "replies": []}]}]}, {"body": "You're an idiot if you don't own Alphabet stock. It's one of the most innovative and profitable companies in the world. If you don't have at least a few thousand shares, you're missing out on massive potential gains.\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 28, "replies": [{"body": "Bold of you to assume I can afford that", "score": 25, "replies": []}, {"body": "I'm an idiot for buying Alphabet stock a year ago.  Going to take many more of these days to get back even.", "score": 9, "replies": [{"body": "It wouldn't if you were dca'ing like you should've.", "score": 1, "replies": []}]}, {"body": "I don't want Alphabet,  I want to own the company that Alphabet buys.", "score": 3, "replies": []}, {"body": "There's still big risk of them missing the AI boat to MS right now. I've got both.", "score": 4, "replies": []}]}, {"body": "“Ok Google, print me $11,000”\n\n“Sure thing”", "score": 6, "replies": []}, {"body": "Undervalued still.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "You have a little more time. My anticipation is that the economy will have a somewhat of a return to normalcy in late spring which is when I believe all tech companies are set to take offf again.", "score": 1, "replies": []}]}, {"body": "My goog at 119 avg cost 13 shares. I don’t know how long till I can see profit", "score": 1, "replies": []}]}, {"body": "I’m bleeding on puts… lawsuit didn’t do what I thought it would…", "score": 6, "replies": [{"body": "Didn’t they just announce layoffs too", "score": 5, "replies": [{"body": "When will you clowns ever learn layoffs are bullish on big companies", "score": 27, "replies": [{"body": "“We’re now firing most of the people who built our company because our company is capable of maintaining itself with AI”\n\nAll that investors should see is green", "score": 1, "replies": [{"body": "“Most” of the company being 10% of total workforce. Approx half of what was hired during the plandemic.", "score": 0, "replies": []}, {"body": "haha, yeah", "score": 1, "replies": []}]}]}, {"body": "I think so yeah", "score": 1, "replies": []}, {"body": "Layoffs are usually never negative.", "score": 1, "replies": []}, {"body": "Yeah and weirdly that made the price go up. They hired too aggressively during Covid apparently", "score": 1, "replies": []}]}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "My cc are getting obliterated by google deciding it’s gonna wake the fuck up", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|2 days ago\n**Total Comments**|6|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "Just got very short! LFG!", "score": 0, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Not going bad.  Adding to my short", "score": 2, "replies": []}]}, {"body": "![img](emote|t5_2th52|4640)", "score": 2, "replies": []}]}, {"body": "I wish I could catch the absolute bottom:) .Accumulating GOOGL started at $139:( and have been DCA ...since   story of my life too early or late LOL", "score": 0, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "We get it, you have bags.\n\nStop dropping off-topic tickers in threads.  It makes *you* look pathetic and the rest of us think it's spam.\n\nQuit it.", "score": 5, "replies": [{"body": "Chill daddy", "score": 2, "replies": [{"body": "You always know the right thing to say to me.", "score": 7, "replies": []}]}, {"body": "Say you are poor af without saying your poor af", "score": 3, "replies": [{"body": "I'm rich in back hairs.", "score": 6, "replies": [{"body": "Lmfao", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "You want your post shit up with random ticker spam?", "score": 4, "replies": []}]}]}]}, {"body": "His will be up 100% by year end…imo", "score": 1, "replies": []}, {"body": "I’ve been selling CSP’s @ $80 strike price for a bit now on $GOOG, $AMZN & $TSLA… waiting for some red days to buy a few 2024 calls…🫣", "score": 1, "replies": []}]}
