{"title": "What is your biggest holding, and why?", "selftext": "Looks for some more stocks to put in my portfolio. My biggest holdings are. Baba, V, Mcd, Msft and the FANG stocks.", "id": "8hluve", "created_utc": 1525680036.0, "score": 23, "upvote_ratio": 0.87, "num_comments": 72, "comments": [{"body": "AAPL\n\nBecause they print money and have one of  the most loyal fanbase/following I've seen.  ", "score": 25, "replies": [{"body": "Probably one of the best response in this thread", "score": 2, "replies": []}]}, {"body": "$BABA is my largest position because I keep adding while the stock trades sideways. \n\nThe reason I hold the company at all is because of its continued expansion national/regional dominance across so many industries.", "score": 7, "replies": []}, {"body": "APH...for the global cannabis market", "score": 15, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Exactly the same, heavily weighted towards MPX though! ", "score": 1, "replies": []}]}]}, {"body": "NVDA turned into my biggest holding in september 2016 when they had that huge ER that pushed them from the 60s into the 90s. I honestly didn't put much thought into it when I initially bought them. All I thought was that I as a gamer always buy Nvidia graphics cards and I'm very satisfied with them and I saw that gaming was growing. I've done a lot more research since then and I'm convinced that $250 is very very far from the top. NVDA has so much going for it and what Jensen Huang has to show at the presentations is always very impressive. They haven't had a single disappointing ER since I'm holding their stock and even if valuation is high, at the current growth it doesn't take long for the p/e to catch up. ", "score": 7, "replies": [{"body": "Nvda is da future \nI also have 30% in Nvda!", "score": 3, "replies": []}, {"body": "Do you need a girlfriend <3? :)", "score": -2, "replies": [{"body": "Do you need any sort of mime?", "score": 2, "replies": []}, {"body": "[Hey](http://knowyourmeme.com/photos/1247723-i-have-3-dollars) ", "score": 1, "replies": []}]}]}, {"body": "NVDA - I believe they have a significant moat in the GPU market and are getting increasing market share in data center and AI markets. If more and more cloud companies keep offering NVDA processing it can only improve both the top and bottom lines. ", "score": 4, "replies": [{"body": "Be careful, amd has a good chance to release a gpu before nvidia this year. Even though the 11 series from nvidia will be way better the news will probaly cause the price to move a bit. And even though gpu sales isnt everything they do, it's what they're most known for. ", "score": 1, "replies": [{"body": "nvidia currently holds 98.4% of GPU market share globally...", "score": 6, "replies": [{"body": "As a gamer, which is the demographic that makes up the most of that 98 percent, who has gamer friends. I can tell you that within the last year and a half it's gone from, \"you nerd who the fuck buys amd graphics cards\" to an actaul chouce between weather you should get amd or nvidia. ", "score": 1, "replies": [{"body": ".", "score": 1, "replies": [{"body": "Well same tbh. But what I'm trying to convey is that when I buy my next card I will legitimately consider an amd card. And so would a lot of people. So with that in mind if amd does something amazing that market share will shift", "score": 1, "replies": [{"body": ".", "score": 4, "replies": [{"body": "Fair point, I worded it wrong I guess. I should of said to just keep in mind and yeah gpu is only a part of their business but I would argue it's the most covered part by media so it has a decent effect ", "score": 2, "replies": [{"body": "Hey, Alex123432, just a quick heads-up:  \n**should of** is actually spelled **should have**. You can remember it by **should have sounds like should of, but it just isn't right**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Do you have a source for this stat?", "score": 1, "replies": []}]}]}]}, {"body": "BRK.B\nUndervalued with excellent PE and PB ratos right now.", "score": 6, "replies": []}, {"body": "NVDA for shizzle! Bought at 31$", "score": 6, "replies": [{"body": "Wow. Need a hand to spend all your profit?", "score": 1, "replies": []}]}, {"body": "Right now it's MO, because I bought back in July at the worst time, and have been averaging down ever since. Second to that is Apple, because everyone who has an iPhone will most likely never switch to another phone, including me. After that is MA & V, because I bought them last summer and they have grown like weeds ever since. After that is MSFT, because their cloud future looks brigiht. After that is JNJ, because health is never going out of style. I agree with rodrigat's sentiment. I have LMT, NOC, BA in my portfolio. If you watch this video, you will see how huge defense contractors are in the United States, and they will always be funded to the gills. [https://youtu.be/ba63OVl1MHw](https://youtu.be/ba63OVl1MHw)", "score": 9, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Hah, yeah I guess that is not quite a legit answer. But yeah, I like JNJ because they have other products that aren't strictly Pharma that level out the bumpy road that Pharma brings. I have ABBV for the growth, JNJ for the slow and steady. All of my holdings are: SQ, MSFT, MGPI, STZ, HD, AAPL, GOOGL, HII, BA, MMM, LMT, NOC, BRK.B, MO, ABBV, AMZN, HD, JNJ, MA, V", "score": 1, "replies": [{"body": "going to open up an ira soonish and try to get as much abbv as possible.  love everything about them. growth, dividend, pipeline", "score": 2, "replies": []}]}]}, {"body": "BA is currently my largest stock. They've just been killing it and have quickly outsized the other stocks in my portfolio. ", "score": 2, "replies": [{"body": "That's awesome!! BA is such a great company!! ", "score": 2, "replies": []}]}]}, {"body": "defense stocks between rtn/noc/lmt\n\ngetting along is hard (and airplanes are cool). but in seriousness i kinda doubt theyll ever really fall. im torn though - do i buy more with my next paycheck in a few days because of that huge selloff that recently happened, or to expand/initiate positions in other super long holds..", "score": 3, "replies": [{"body": "didnt a lot of defense stocks fall after the NK/SK cooperation news?\n\ni think its temporary cooperation anyway but surely its not great for those stocks short term right?", "score": 3, "replies": [{"body": "yeah, they did. pretty big sell off resulting in about an 8% loss in some cases. theyre rebounding already", "score": 1, "replies": []}]}]}, {"body": "ATVI, just kept on buying the dips since 2008.  It is also my largest gaining stock at 255%.  I believe strongly in the gaming industry and specifically in e-sports.  I also have a small amount of TTWO. I am considering selling some of ATVI since it is now 12.5% of my portfolio, but am hesitant since it is in my taxable account.   ", "score": 4, "replies": [{"body": "Can’t you just withdraw the cash and set 15% of it aside once you sell, for taxes (assuming capital gains rates)? Or you would reinvest the money, so you’d have to pay the taxes from your bank account instead? I’m just getting into investing and am trying to understand these things (USA)", "score": 1, "replies": [{"body": "I absolutely could, but that tax money is then no longer invested. I still believe in ATVI, the sale would just be to lower my overall exposure. I try to make sure no one holding is more than 10% of my portfolio.", "score": 1, "replies": []}, {"body": "He is hesitant to sell because he would essentially be giving up 15% of his gains in taxes when he could just leave it in the stock. \n\nFor example, let's say you want to sell $1100 of ATVI that you bought for 100 a few years ago and reinvest in a different stock. \n\nYou would make a $1000 gain, pay $150 in taxes, and only be able to reinvest 950 instead of $1100 back into the market. Over time, that adds up to a lot if it's a larger amount in terms of compounding gains. If he leaves it in ATVI, he doesn't pay taxes until much later, at which time he has been putting that $150 to work for longer. \n", "score": 1, "replies": []}]}]}, {"body": "Coca Cola. Because I don't want any risky shit.", "score": 3, "replies": []}, {"body": " Microsoft is my biggest holding but V has made me the most profit.", "score": 3, "replies": []}, {"body": "I've been using 10% of my paycheck to buy MMM since late 2011 (I work there and you get a 15% discount on the shares) and haven't sold any yet, so it's by far my largest holding. I knew it was overvalued at 250 but unless I'm out of investing money and need some I'd rather let the pre tax gains work for me. ", "score": 3, "replies": []}, {"body": "GXE cuz I want do oil money \n\n( currently 2.5x)", "score": 2, "replies": [{"body": "That's strictly Canadian exchange right? I'm not finding it on Fidelity here. ", "score": 1, "replies": [{"body": "There's a US ticker , Google ", "score": 1, "replies": []}]}]}, {"body": "Biggest holding is $IVV, which is an index S&P 500 index ETF. But my biggest holding of an individual stock is $BRKB. ", "score": 2, "replies": []}, {"body": "Amazon, just because it constantly goes up and has grown into 20% of my portfolio.", "score": 2, "replies": []}, {"body": "I like to take the Warren Buffet approach and invest in things I understand so rn it’s VISA, Disney, and Waste Management. \n\nVisa because we are transitioning more towards cards.\n\nDisney because they keep buying companies out and putting out top tier movies and should be coming up with their own streaming service.\n\nWaste Management well there is always gonna be trash and someone has to pick it up. Those are my big 3 for now \n\nI’m also buying some bionics type of stuff down in the penny section. I have a feeling  we are close to a break through in the world of bionics. ", "score": 4, "replies": []}, {"body": "Etsy. It’s a huge chunk of my portfolio. They have a surprisingly strong board, have cleaned up their act, and are aggressively rebranding themselves in a positive way. \n\nI fucking love this stock", "score": 2, "replies": []}, {"body": "ELY; good guidance, Tiger Woods always boosts golf viewership, also bought dirt cheap early January. Up way more than I expected to be.\n\nIRBT; Good earnings however, iffy 1st quarter guidance, also bought low in feburary. Was doing really good until Amazon happened. I still believe in them to make it through though. 2nd quarter reports have been great for them.", "score": 1, "replies": []}, {"body": "ELY: good sheet. Premiere golf brand. Stake in top golf. Steadily increasing and so is golf among gen x . Not sure why but it is ", "score": 1, "replies": []}, {"body": "VTI, Apple is my largest individuals stock. ", "score": 1, "replies": []}, {"body": "MDT, and this turd has done nothing lately.  For some reason it’s up 5% today and I can’t find any news on why.  ", "score": 1, "replies": []}, {"body": "SGMO cause I've gotten 400-500% on it, might as well ride it out", "score": 1, "replies": []}, {"body": "Bought LNG last August as it was one of only a couple stocks Seth Klarman was buying at this market valuation. Up 50 pct or so in 8 months and it's going higher based on most recent quarterlies. Needless to say, v happy.", "score": 1, "replies": []}, {"body": "WEED", "score": 1, "replies": []}, {"body": "US bank, but that’s cuz I work there and have been given shares as well as some 401k contributions go into it. ", "score": 1, "replies": []}, {"body": "Between NVDA and Amazon, I’ve invested the most in Amazon but NVDA is an 8 bagger for me (got in at $30).\n\nNvidia because AI is going to be huge and GPUs are going to be more and more needed for high def graphics like VR and AR.\n\nAmazon because they have A huge share of ecommerce, AWS, Prime, Smart Home and they have a huge growing advertising business.\n\nJust writing this makes me want to get more haha.", "score": 1, "replies": []}, {"body": "1. NFLX \\- 6.45&#37;  already covered\n2. AMZN \\-5.39&#37;  already covered\n3. DPZ \\- 5.31&#37; \\- Dominos Pizza is the dominant pizza provider in the USA. If it can continue that trend internationally, this stock will be a fun ride for the next 10 years. \n4. BKNG \\- 5.29&#37; Formerly Priceline, Booking Holdings controls most of the online reservation market and I don't see that changing anytime soon. It's been cruising ever since the name change this year. \n5. BCPC \\- 5.20&#37; \\- small cap Chem company that specializes in Choline for animals", "score": 1, "replies": []}, {"body": "Tencent. Medium to long-term trends both within and outside of China make it a no-brainer.", "score": 1, "replies": []}, {"body": "HALO - a biotech company that has a proprietary technology called ENHANZE that allows medicine to be delivered through the skin instead of the vein. It's less pain for the patient and delivery time is decreased to 5-10 minutes instead of the standard 1 hour +. They also have a drug Pegph20 in phase 3 with promising data. It is a treatment for pancreatic cancer which is known as one of the deadliest cancers and a guaranteed death.\n\n\nSecond largest position is AMD. ", "score": 1, "replies": []}, {"body": "GOOG+GOOGL ~ 14% they’re a ubiquitous part of our lives and will continue to be so\n\nAAPL ~ 13.5% they’re Apple\n\nBABA ~ 13% gateway to China and the growth of their middle class", "score": 1, "replies": []}, {"body": "$AMZN.  Because Amazon.", "score": 1, "replies": []}, {"body": "TCEHY", "score": 1, "replies": []}, {"body": "Brown-Forman (BF.A/BF.B) - maker of Jack Daniels and other spirits.  I like this company because it's family controlled (management is aligned to longterm shareholder interest), has very strong brands, and has great roic, roe, etc.  It's an extremely well run company in an industry which has historically out performed the broad market.  Is the stock expensive based on comparitive valuations with other stocks?  Yes, but when isn't it?", "score": 1, "replies": []}, {"body": "ford.\n\ni like their trucks. thats it, i know im retarded but i like rangers and raptors.", "score": 1, "replies": []}, {"body": "POSCO, margin of safety, along with a solid economic moat with long term prospects. Not really something you see.", "score": 1, "replies": []}, {"body": "I own around 20K in Geely (GELYF). I just can't help but see endless possibilities for them in China with pollution and their EV. Not to mention they own 10% of Mercedes Benz and all of Volvo, so they're not going at it alone", "score": 1, "replies": []}, {"body": "AAPL - got assigned at $150/share been holding since.", "score": 1, "replies": []}, {"body": "I am surprised that so many people here buy individual stocks as opposed to ETFs. ", "score": 1, "replies": [{"body": "It's /r/stocks ", "score": 5, "replies": []}]}, {"body": "Appl because you’re probably reading this on one or you wish you were at least.", "score": 1, "replies": []}, {"body": "DIA. Instant diversification with a bunch of the most solid, consistent performers. I dump a few shares when the market is high, and buy when there's a correction, but I never have less than 30% of my total liquid assets in DIA.", "score": 0, "replies": []}, {"body": "XXII.\n\nAbout half.\n\nHigh risk but possibly also high reward. We shall see ", "score": 0, "replies": []}, {"body": "Whαt: AUPH - 99.8% of my ρorτfolio. \nWhγ: Becαuse I'm Yoυng dυmb & bro-oh-οh-oακ", "score": 0, "replies": []}, {"body": "$BABA because they are just huge. This will let AMZN behind. Ma is a visionair. Expecting a lot here.", "score": -1, "replies": []}]}
