{"title": "Warren Buffett loves Apple", "selftext": "Warren Buffett bought  75 million more shares of Apple. \n\nhttps://www.cnbc.com/2018/05/03/buffetts-berkshire-hathaway-bought-stunning-75-million-apple-shares-in-first-quarter.html", "id": "8gw835", "created_utc": 1525404105.0, "score": 106, "upvote_ratio": 0.88, "num_comments": 73, "comments": [{"body": "I too enjoy companies that have a steady stream of making money.", "score": 32, "replies": [{"body": "Daily calls from open moved 6000&#37;!!!!!!!!!!  [https://imgur.com/a/8RpwGiu](https://imgur.com/a/8RpwGiu)\n\nI bought and sold at 200&#37; in 15 minutes. Good enough!", "score": 8, "replies": [{"body": "I don't understand a thing on there.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Options.  You're happier not knowing.  A call is a financial instrument that gives someone the *option* of buying a share of a stock, at a set price, on or before some expiration date.\n\nFor example, someone might own 100 Call contracts, that give them the right to purchase AAPL shares for $160, with those contracts expiring next week.  That'd be a nice thing to own.  Since the price of AAPL is over $180 now, you could exercise those options, (buying the stock for $160 and share) and immediate sell all that AAPL stock for a nice $20 / share profit.\n\nOf course like many financial instruments that exist, people trade them on the open market.  People buy and sell calls to each other.  The price of those calls depends on a number of factors, including things like:\n* The difference between the strike price (the cost of the shares if you were to exercise the option) and the current share price, \n* the amount of time until the calls expire, \n* and the amount of volatility in the underlying stock's price.\n\nThey're a very great way to lose money.  If you have calls where the strike price is more expensive then the cost of the underlying stock on the date where the contracts would expire, then you have a bunch of worthless calls.\n\nYou most often hear about people using them for speculative purposes, but they can also be used to hedge against risks in any sort of timeframe.  (Look up \"calls\", then look up \"puts\".  See if you can figure out how someone would use puts to hedge against losses in a stock that they had a long position in.)\n\nRead a book on them and the trading strategies surrounding them, before even considering buying an option.  Or just lose a bunch of money when you first discover the joys of theta.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Let me eliminate a few sources of confusion, by eliminating some complexity.\n\nLets talk about some calls that are expiring today, in like an hour.  (Normally, one third of the value of an option is “the amount of time till expiration”, you can ask yourself why that is as an exercise later.). But these options expire today, within the hour.\n\nAt this point, we basically know what the share price will be when the option expires.  Let’s say the ticker reads:  \nQQQ: $47.50\n\nYou have calls for QQQ with a strike price of $46 (you could exercise the contract to buy QQQ FOR $46).  But let’s say you didn’t want to exercise the contract.  Note that options (calls and puts) are usually only sold in sets of 100.  And you just can’t afford to buy $46 x 100 shares, even if it is a great deal.\n\nSo instead, you’re going to sell the options, those contracts, to me.  How much would those options be worth?  Well, each contract is worth $1.50.  (Because $47.50 - $46.). You have 100 contracts, so you’re getting ready to sell the bunch of them to me for $150.  (Presumably, you paid less than $150 for these options when you bought them, because you are wise and fortunate.)\n\nBut wait!  In the last hour of trading before they expire, Warren Buffet makes out with the CEO of Corp. XYZ, on air at CNBC.  The stock market rallies!  QQQ increases in price to $49!!!  For those keeping track at home, that means QQQ has jumped about 3%.\n\nCool,  now your options are also worth more.  How much though?  Well the strike price of the contract never changes, it’s still $46.  The price of QQQ is now $49...  so it makes sense that those calls are now worth $3 a piece.  $3 a piece * 100 contracts = $300.\n\nNote that before QQQ jumped 3%, those options were only worth $150.  They increased in value by 100%!\n\nIn short, the price of the underlying security (the stock) is just one source of an options price, although a major one.  Time and volatility are the others.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Hey, uglyboy11, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 1, "replies": []}, {"body": "> So instead, you’re going to sell the options, those contracts, to me. **How much would those options be worth? Well, each contract is worth $1.50. (Because $47.50 - $46.).** You have 100 contracts, so you’re getting ready to sell the bunch of them to me for $150. (Presumably, you paid less than $150 for these options when you bought them, because you are wise and fortunate.)\n\nLet me try to explain this better:\n\nWhy does the call (with a $46 strike price) cost $1.50, when the underlying stock costs $47.50?\n\nBecause with that option, you could execute the call, get to buy the share for $46, and immediately sell it for $47.50 (the current market price).  \n\nIt's not a random number at all.  If this doesn't make sense now, grab a piece of paper, and try to figure it out.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Man I wish I knew what that meant, I want to get in on that sweet action.", "score": 3, "replies": []}]}, {"body": "And my personal favorite reason- tons of cash in the bank, to make acquisitions or R&D new revenue streams if their cash flow slows down.", "score": 2, "replies": []}]}, {"body": "So did jobs, look what happened to him", "score": 78, "replies": [{"body": "Short chemo", "score": 33, "replies": [{"body": "Long chemo short ancient Far East remedies", "score": 15, "replies": []}]}, {"body": "Steve Jobs loved himself and didn't love the opinions of others, like doctors for example. ", "score": 5, "replies": [{"body": "feelsbad.jpg", "score": -1, "replies": [{"body": "[feelsbad.jpg](http://i.imgur.com/Xo9GNok.jpg)  \n\n\n---\n^(*Feedback welcome at /r/image_linker_bot* | )[^(Disable)](https://www.reddit.com/message/compose/?to=image_linker_bot&subject=Ignore%20request&message=ignore%20me)^( with \"ignore me\" via reply or PM)\n", "score": 0, "replies": []}]}]}]}, {"body": "It’s hilarious, but warren Buffett has been following me for a couple years. I buy apple, he buys Apple. I sell GE, he sells GE. I buy STOR, he buys STOR, I know it’s just a statistical accident, but…", "score": 8, "replies": [{"body": "what is next yo", "score": 9, "replies": [{"body": "if he buys NLY I will be surprised. ", "score": 3, "replies": []}, {"body": "All in HMNY", "score": 1, "replies": []}]}]}, {"body": "I am an idiot for selling off my shares before earnings because of speculation and putting the money elsewhere.", "score": 7, "replies": [{"body": "Buy and hold.", "score": 5, "replies": []}, {"body": "Time in the market always beats timing the market, on average. Buy and hold.", "score": 1, "replies": []}]}, {"body": "Couple old-cranky-guy comments: \n\n1) It's not the Warren Buffett show- well, he's the public face, but he and Munger have worked closely together for, like, 50 years. And they're training up the new guys (I don't know, the new guys are probably 60) so this is probably not a Buffett decision. \n\n2) He has fifty years of quotes, I might be cherry picking, but I think Buffett has said something like \"If you're right 60% of the time that's a really good percentage.\"\n\n3) I can't find the exact Charlie Munger quote but he said something a year or two ago like, we have a giant ton of money and we have to put it somewhere , so we're not buying spectacular companies, just the best ones we can find. \n\nSo if I have a point, it would be that \"Warren Buffett probably likes Apple\" might be a better title. ", "score": 10, "replies": []}, {"body": "He’s been on AAPL forever. He even says he hates tech stocks but he’s always been on this one. ", "score": 20, "replies": [{"body": "> He’s been on AAPL forever.\n\nThey first invested in AAPL just a couple years ago.", "score": 7, "replies": []}, {"body": "He probably just recongnized the value of the vast sums of cash they have. ", "score": 7, "replies": [{"body": "And the cult following I bet", "score": 6, "replies": [{"body": "Same reason he buys Coke honestly. ", "score": 7, "replies": [{"body": "He talked about this in his interview with CNBC. He calls it a moat. That kind of blind brand loyalty because of a vastly superior product or excellent marketing is extremely profitable.", "score": 1, "replies": []}, {"body": "Huge tracts of... cash", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Thats no brainer. It is in consumer goods section in S&P\n\nhttps://finviz.com/map.ashx?t=sec", "score": 2, "replies": []}]}, {"body": "AAPL is not a tech company.", "score": 0, "replies": []}]}, {"body": "How the hell did Apple went from \"omg iPhone is done\" to all time high in two weeks? ", "score": 5, "replies": [{"body": "From fear uncertainty and doubt", "score": 5, "replies": []}, {"body": "People who sold on rumors or just people not sure about jumping in are now putting money to work. The real momentum is going to happen once SERVICES becomes the cash cow like the iPhone.  As long as people are attached to their new or old iPhone the services will continue to grow double digits. \n\nBUY and HOLD for the long run.", "score": 3, "replies": []}, {"body": "Ignore the “noise” between earnings. The noise is simply presumptions and conjecture with very little basis of truth. People are paid to analyze stocks, and many times they reach or cherry pick to generate their “analysis.”", "score": 2, "replies": []}]}, {"body": "Why shouldn’t he?\nMassive economic moat, 95% of people I know use an iPhone, and it’s not like I or anyone else plan to switch.\nFairly valued too", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Well 100B buy back will soar SP to >$200 easily! Dumb to go against huge pile of cash.", "score": 14, "replies": [{"body": "The 100b buyback should already be priced in?", "score": 1, "replies": [{"body": "Nope! Apple is going to buy 100b worth of shares from the open market which means it is going to cause buying pressure in the market. ", "score": 12, "replies": [{"body": ">is going to cause buying pressure in the market. \n\nAnd you don't think this is priced in?\n\nHarder to quantify metrics are priced in the market already, I doubt a 100b buyback program is hard for a bunch of math phds.", "score": 5, "replies": [{"body": "From a theoretical perspective, dividends and buybacks give the same return to investors, so it is really easy to calculate the price appreciation due to the buy back. ", "score": 5, "replies": []}, {"body": "Article says he bought the shares in the first quarter, before the buy\\-back was announced.", "score": 3, "replies": [{"body": "We are talking about the **upcoming buyback**, not about the shares Buffet bought.", "score": 7, "replies": [{"body": "My bad, I read it wrong. ", "score": 2, "replies": []}]}]}, {"body": "Its not about pricing in. Its about buying from open market. Avg volume of AAPL is just ~37M.  Apple can not buy $100 billion worth of shares in a single day. It will take months and months of buying. $100B would approximately be 565M shares at todays price of $177.", "score": 8, "replies": [{"body": "The last buyback of 200b took 5.5 years...\nOfcourse they're not gonna buy in a single day.", "score": 1, "replies": []}]}]}]}, {"body": "Dont get caught up with the \"priced in\" shit. People always think things are priced in, until news, reports and buys/sells prove otherwise.", "score": 2, "replies": []}, {"body": "how is that already priced in if they literally announced it 2 days ago", "score": 1, "replies": [{"body": "Because everyone has known about it for 2 days?\n\nAAPL also adjusted outlook for next quarters, you think people sit around and wait till those quarters have past to take this change into account? \n\n", "score": -1, "replies": [{"body": "well yes. because guidance changes and actuall results does not actually equal guidance. I'm starting to think this priced in shit is just a meme lmao. Not to mention apple hasn't even started the buy back and that will also effect it. ", "score": 1, "replies": [{"body": "You do you man, just know you're essentially betting against institutions that have a bunch math phd's to predict everything.", "score": -1, "replies": [{"body": "The same phd's that were overwhelmingly forecasting doom and gloom prior to earnings.  ", "score": 3, "replies": [{"body": "Who knew?!, game theory isn't an exact science? You're right, better use your gut feeling.\n\nHow's your Switch holding?", "score": 0, "replies": []}]}, {"body": "What are you even trying to say. Who said i even own apple stock.  \n\n\nBut you're doing a good job of keeping the index fund meme going", "score": 2, "replies": [{"body": "Better than keeping the ignorance meme running right?", "score": -1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Buffett is a financial celebrity. He can buy stock whenever he wants and it really doesn't matter in the grand scheme. He isn't like small investors like most of us who actually have to try and buy stocks at a good price. I really wouldn't even pay attention to what he says, he can afford to lose, regular people can't. He's an old lizard with endless cash flow.\n\n**Edit:** Love the downvotes lmao. Look what happened to **Heinz**, another stock Buffett \"*loved*\". ", "score": -10, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "This is one of the more vicious comments I’ve seen this week, well done. ", "score": 4, "replies": []}]}, {"body": "Haha bet against Buffett? Sure not everything he buys is a winner but his fund, Berkshire Hathaway is one of the top producing funds and is very safe with a low risk rating. ", "score": 6, "replies": []}, {"body": "Anecdotal evidence, his lifetime of returns beats the market. ", "score": 6, "replies": [{"body": "Yes. Exactly. Because he can buy stock at any price and it has no impact on his portfolio. He can buy at highs or lows because he holds it for eternity. That does not mean because he says its a a good buy that it is a good buy. If you listened to him about Heinz you got destroyed, especially in the past year. Regular people can't afford to buy stock at any price, that is why you can't be fooled into some hype made by a guy who has no worries of losing on an investment.", "score": 0, "replies": [{"body": "Again heinz is one example therefore anecdotal look at his portfolio returns. You know he recommends index funds right. Also none of your logic is sound at all, are you saying don’t trust rich people because they have a margin of error in their financing I have learned a lot from rich people but not much from poor people. Same with stupid/smart people. ", "score": 6, "replies": [{"body": "This isn't about trust, it's just common sense that the media uses Buffett as a way of driving investments. They have done this for decades now. People like you will listen to him without understanding that he has endless cash flow, and has no worries of risk with any stock he buys. That's why he brushed the financial crisis off in 2007/2008 like it was \"no big deal\" because he just rushed in and bought tons of stock because of his endless availability of funds. He doesn't have to do technical analysis, he doesn't have to manage risk, he can do whatever the hell he wants because he can. Regular people can't do this, that is why you should never take his advice as being an end all good investment choice. Regular people can't afford to lose 40% on an investment, Buffett can. That is my whole point.", "score": -3, "replies": [{"body": "If you can’t afford to lose 40% stay out of market it happens every 10 years. A legal disclosure requirement every quarter is hardly pushing people to buy his stuff. If you’ve seen any of his interviews he does not try to sell other people on what he bought. ", "score": 7, "replies": [{"body": "You're completely missing my point dude.\n\n>If you can’t afford to lose 40% stay out of market it happens every 10 years\n\nThis just tells me how little you know, that is why you have to do analysis and do active management to reduce risk. Again, Buffett and his buddies don't have to do this. That is my point from the beginning. They have endless cash flow no matter what happens in the market, regular retail investors DON'T. Is that hard for you to understand? They keep getting rich because they don't have to manage any risk, they just buy up stocks at any price they want.", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Yes, it's very easy for Buffett to beat the market for 60 years when he can invest endlessly from dividends and constant cash flow. I am not saying he's wrong or that he can't be trusted, but at the same time it's really silly to take what he says into a serious context because of the fact that it's very easy to be a \"great investor\" when you don't have to manage risk at all. The best investments out there are the ones the media doesn't talk about. Once they're a \"good investment\" they take over the financial news. At that point, they've often already gone up considerably. This is the type of thing as an investor one has to understand to make any real money. I mean go look at Apples chart, the smart money got in years ago so it's still a stable investment but you'll make more money else where. Buffett doesn't care because he'll just collect the dividends like he always does. If it goes down, it won't matter to him.", "score": -1, "replies": [{"body": "Yeah, buying and holding forever is ideal", "score": 1, "replies": []}, {"body": "I'm not a math guy, but I'm willing to bet If you lost 40% of APPLE in 2018 but held on to shares (and didn't just throw money into more shares) it would be worth SUBSTANTIALLY more. You don't need billions to understand the power of DRIP and compound interest. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Look at IBM. Berkshire bought a bunch of them, and that’s a freaking dumpster fire. They dropped most of their IBM shares last year", "score": 3, "replies": []}]}, {"body": "And child labor. \n\n", "score": -2, "replies": []}]}
