{"title": "$DIS Earnings Release 11/7", "selftext": "Looking ahead to next week...  $DIS ER scheduled after close on Nov. 7. \n\n$DIS is down \\~10% from its July 29 high. Over last week and a half, support around 129.5 and resistance around 133.5, and its dropping again today.\n\nDisney+ is not available yet, but we should get some actual pre-sale numbers.\n\nI've got 30 11/8 135Cs, but am surprised there isn't more of a run up...\n\nthoughts?", "id": "dob5yo", "created_utc": 1572279928.0, "score": 27, "upvote_ratio": 0.91, "num_comments": 40, "comments": [{"body": "do not be a retard and buy calls expiring the day after earnings. I did that with microsoft and lost my entire portfolio so", "score": 60, "replies": [{"body": "Bruh, same. I had 35 $142 expire on Friday just in time to hear the JEDI announcement and watch it rise to $144 AH. Got cucked big time", "score": 14, "replies": []}, {"body": "Also Disney moves slower than most. If you make a play, consider buying stock because movement rarely lines up with option expiration dates.", "score": 7, "replies": []}, {"body": "F :(", "score": 3, "replies": []}, {"body": "i went even with my calls expiring last friday but i just made about $1050 with calls expiring this friday", "score": 3, "replies": []}]}, {"body": "I have 140 calls Jan. 2020 just waiting for this to print 🐃🐃🐃", "score": 10, "replies": [{"body": "I’m on the same boat but lost 40% so far. Hoping that by Jan would go at least $140", "score": 1, "replies": [{"body": "Yeah but theta can’t hurt us too far out. I can hold till January if I have to.", "score": 1, "replies": [{"body": "I’ve been holding for a month now and I am willing to continue to hold. Good luck,!", "score": 2, "replies": [{"body": " Tendies will be in our destiny.", "score": 3, "replies": []}]}]}]}]}, {"body": "I think earnings will be a priority for DIS because of how close it is to Disney + release. I’m guessing earnings will be positive. I’m no expert though lmao", "score": 8, "replies": [{"body": "I think that's why they ran that buy 2 years get 1 free promo on Labor Day weekend.\n\nIt allows them to show in Q3 how many people subscribed for a long term commitment. Without actually launching the service yet Disney got it's numbers into the previous quarter, they basically get two launches.\n\nPlus all that sweet, sweet unearned revenue.\n\nEdit: technically above should say Q4 because Disney has a shifted fiscal year but the rest of the comment is still accurate", "score": 9, "replies": [{"body": "Avengers End Game revenue is supposed to be on THIS earnings right?", "score": 1, "replies": [{"body": "Endgame came out in April so it'd be in the previous quarter.\n\nI also realize now that Disney has a shifted fiscal year so November is actually Q4/FY earnings", "score": 1, "replies": []}]}]}]}, {"body": "My calls are much further out. But I'm down around 60% on then. Im hoping for higher than expected presale numbers of D+ push the price up sharply. And then again at the next earnings call.", "score": 5, "replies": [{"body": "Most people I know have preordered a year or more of D+\n\nBut we all have kids...", "score": 2, "replies": [{"body": "I'm personally waiting on the bundle that they have said will be available on launch day. I imagine there are quite a few of us as well", "score": 2, "replies": []}, {"body": "No kids here. Three years preordered.", "score": 1, "replies": []}]}, {"body": "Same", "score": 1, "replies": []}]}, {"body": "11/15 $135 calls for me. (Lotta open interest on this one so you know the big dick firms are in on this strike)\n\nEarnings beat + Disney plus = hooker and blow money!", "score": 5, "replies": []}, {"body": "Im holding a lot of DIS but i am short term bearish now. DIS cant hold any rallys. Hopefully earnings changes that. Even if it misses at least it will give the stock some direction instead of fading every pop i think. We ahould  see some clarity on pre-orders and VZ impact. Also hoping park attendance and park revenues in general have picked up. Last Q was bad for attendance and increats costs around bringing up DIS+ infrastructure. Also hoping Fox is not going to drag earnings for this Q and most costs have already asorbed last Q.", "score": 3, "replies": [{"body": "VZ deal should give Disney plus 20-50mill users so I’m not sure why the thing isn’t rallying. Makes no sense.", "score": 2, "replies": [{"body": "$DIS is much bigger than streaming.", "score": 1, "replies": []}, {"body": "If you look at DIS earnings even when they beat the stock still drops so IDK. Somebody raping that mouse on purpose for sure.", "score": 1, "replies": []}]}]}, {"body": "Disney has one of the worst charts...BUT I'm still bullish :).  From the acquisition of Fox they had a 30% revenue increase last quarter (from 15B to 20B).  That's before Disney+.    \n[https://www.macrotrends.net/stocks/charts/DIS/disney/revenue](https://www.macrotrends.net/stocks/charts/DIS/disney/revenue)\n\nit didn't translate on earnings because they did some heavy investing in Disney+.  This will likely continue in this quarter as we see a huge ad/ua spend.    \n\n\nI'm  not sure if the stock falls back to 120 on earnings.  But either way, at some point over the next 2 years.  If revenues can continue through to 100B annually, we'll see a long slow road to $250.  The nice thing about this is that you can get in late.    \n\n\nDisney has too much liquidity to really pop (like it did in April).  So it'll be a long slow accumulation of millions of shares that will move it.  Those accumulations happen through institutional investment who generally hold for years.  \n\n\nDisney has projected 30m Disney+ subscribers by 2024.  I think that's pretty conservative.  If they end up with something crazy like 20m pre-orders then we might see some movement.", "score": 3, "replies": []}, {"body": "Disneys an ass man.. remember that.. raw , unlubricated , slow strokin ass man", "score": 3, "replies": []}, {"body": "lol", "score": 2, "replies": []}, {"body": "Do calls for 11/15 at the earliest, you fucking yourself I think", "score": 2, "replies": []}, {"body": "F. Exp day after earnings (speaking from experience) is a big no.", "score": 2, "replies": []}, {"body": "I bought 180 calls since they're like 1$ rn", "score": 2, "replies": []}, {"body": "It’s down on the day of ATH", "score": 1, "replies": [{"body": "Disney doesn't give a shit what spy does", "score": 1, "replies": []}]}, {"body": "I might buy January 2020 140 calls. In addition to Disney+, Star Wars coming out so Disney should be making bank for that time", "score": 1, "replies": [{"body": "I went in on June 2021 145 calls.", "score": 1, "replies": []}]}, {"body": "I hope so my friend. I been watching $DIS for quite a long time and honestly it’s disappointing. It dropped today as well when the whole market was up. I do think it will have a pre ER run up but as someone else said don’t buy 11/08 and go further out. \n\nI’m personally thinking to go all in 134c 11/15", "score": 1, "replies": [{"body": "hope you did", "score": 1, "replies": [{"body": "My paper hands sold all $DIS calls last week after ER. Honestly I didn’t think it could run up this much on the subscriber numbers. Guess I was wrong.", "score": 1, "replies": []}]}]}, {"body": "Parks will be way down. This summer was brutal in Anaheim. Hong Kong is closing parks early because of protests. Commitments predating Fox merger will drag on performance for a couple of years, and the lack of a tentpole Marvel saga going forward is another downer.", "score": 0, "replies": []}, {"body": "Fuck Disney...that is all", "score": -8, "replies": [{"body": "Yes but can we make money off em?", "score": 5, "replies": []}]}]}
{"title": "Why aren’t we shorting BA?", "selftext": "In the past year and a half, I’ve only read bad news about Boeing and yet their stock is still trading near all time highs. Have i done my DD? Fuq no. Am I degen looking for a quick buck? Yes.\n\nI know they have massive govt contracts. At this point, i think every pension holds BA. And theyve reached the point at which the company has such a large value, its too big to fail.\n\nUPDATE: even this yoloer isnt dumb enough to go toe to toe with a govt backed entity. Good talk though. Sometimes you gotta post the wrong thing online, so 50 people correct you.", "id": "doclcr", "created_utc": 1572285989.0, "score": 27, "upvote_ratio": 0.94, "num_comments": 42, "comments": [{"body": "You answered your own question, too big to fail", "score": 71, "replies": [{"body": "People are in awe and get salty as fuck when some large cap doesn't get ripped apart on bad news and stays down like -50% from it's highs.\n\nLike come on man, the company is not going extinct anytime soon. Like apple or google, big tech in general, even other big shit like jnj or pfe. \n\nThese behomoths have a ton of big money investors and you need them to pull out in large amounts to cause any serious sell off on these too big to fail companies.\n\nThis isn't GE or Sears. This is a king in it's sector with an insanely strong balance sheet, huge backlog of orders , and continued future growth as well as we expand into space. \n\nOnly a fucking moron is saying \"ya I don't wanna hold boeing shares anymore. They might go out of business next Q so I should sell now . I didn't think Boeing was a long term investment anyways\"", "score": 22, "replies": [{"body": "GE, was absolutely king during it’s time. Boeing is 1 crash away from everyone: cancelling their orders and demanding refunds. \n\nYou must be balls deep in BA to get this rattled.", "score": 4, "replies": [{"body": "No they’re not. Airbus has as big of a backlog as BA, so unless all airlines wanna wait 10 years to get an airplane they’re going to keep their orders", "score": 20, "replies": []}, {"body": "GE had dogshit on their balance sheet, made piss poor investments that led to even worse debt, couldn't innovate worth a damn since they had to taper off r&d and capex spending. GE has fundamental issues left and right but investors slowly pull out as always when the company can't right the ship. \n\nBoeing has none of those problems. They just dropped the ball being too greedy and outsourcing their software production to low wage foreigners. They will continue to be Kings for the foreseeable future. This company isn't gonna die anytime soon", "score": 6, "replies": []}, {"body": "There are 2 airline manufacturers in the entire world, both supported by major governments. The capex required to birth a new competitor would be prohibitive. Don’t see too much competitive pressure opening up in the near future.", "score": 7, "replies": []}, {"body": "How is anyone gonna crash a plane that's grounded? And why would any of their existing fleet have a sudden crash issue attributed to Boeing? And do you think that the MAX is gonna have another crash after a year of intense scrutiny?\n\nMy guess is sideways for bit longer until next year. I am banking on the government giving BA a slap on the hand and delaying BA's desired timetable for this year, but allowing it to be put back into the air in January to prevent BA from taking too much damage. It'd be the classic politician move, do something while actually doing nothing. Maybe a law change to reinstate FAA power a bit more, if they feel ambitious.", "score": 2, "replies": []}, {"body": "Ba has a duopoly. They with airbus have a 99% ms in commercial planes. The stock will bounce back some time in 2020 when the planes can fly again", "score": 1, "replies": []}]}]}]}, {"body": "Think about everything that Boeing went through this last year, then about the fact that they were still able to turn a profit. Do not short BA.", "score": 14, "replies": []}, {"body": "the gobbernment has a noose around BA's balls and is dragging them up the peak of Mt. Gains.\n\n&#x200B;\n\n#  its too big to fail", "score": 14, "replies": []}, {"body": "You answered your own damn question son", "score": 8, "replies": []}, {"body": "its backed by the US government just as almost every other major airplane producer is backed by their home country (see the whole airbus/boeing debacle from recent times)", "score": 4, "replies": []}, {"body": "They are almost a monopoly and don’t sell a lot of products to the general public so the bad publicity hasn’t hurt like it would have many other companies in different industries.", "score": 9, "replies": [{"body": "They *are* a *duopoly*.", "score": 7, "replies": []}, {"body": "I know that the 737 was their biggest revenue source before it was grounded.", "score": 2, "replies": [{"body": "Yea n they r going to still use them also. If that was another industry where the general public was buying a product like the 737 with everything going on no way would it be kept on the market.", "score": 4, "replies": []}]}]}, {"body": "Needs one more plane crash,  3rd times the charm.", "score": 3, "replies": []}, {"body": ">it's too big to fail\n\nAlso, the contracts are very diverse. Many different types of long-term government and civilian contracts.", "score": 3, "replies": []}, {"body": "The only way this is a short is if you believe that 737 does start flying by March. They said they will start ramping down production if this is the case. Right now they have all the planes everyone has ordered sitting on a lot and as soon as it's approved to fly they will start making deliveries.\n\nBA announced they think they will have the certificates by year end, I hear most analyst say they have til March til this will really start to effect cash flow.", "score": 3, "replies": []}, {"body": "12/20 380 calls u welcome", "score": 3, "replies": [{"body": "You want to go long?", "score": 1, "replies": [{"body": "Look at the last time BA plummeted on bad news back in August it dropped to 320 and after 1 month it was back to 380", "score": 1, "replies": [{"body": "280 is way in the money though. It would be super expensive contracts", "score": 2, "replies": [{"body": "Woops meant 380", "score": 5, "replies": []}]}]}]}]}, {"body": "It’s a long bro. The down move/news already happened.", "score": 3, "replies": []}, {"body": "Can’t short a monopoly / leading firm in an oligopoly", "score": 5, "replies": []}, {"body": "Look at the chart and look at it’s long term range, chances are high it stays within", "score": 2, "replies": []}, {"body": "Theres not a whole pile of competition in that market against them either and its a biggish deal for an airline to switch airplane provider so shorting would be risky, going long would make more sense considering what theyve been through the last year things can only get better", "score": 2, "replies": []}, {"body": "Everyone saying too big too fall...could be right. But I was posting on Friday how the company isn’t giving any bonuses at eoy...to anyone. Exes don’t get em, unionized engineers don’t get em...no employee. They claim it’s due to the MAX still being grounded...", "score": 2, "replies": [{"body": "Think thats a sign of financial distress? Or discipline, like the japanese nintendo execs. That is interesting news.", "score": 2, "replies": [{"body": "Considering the size of the company...and the fact that those employees are unionized...which to me, says “another strike incoming”...but that’s just me.", "score": 2, "replies": []}]}]}, {"body": "Look at the crash reports: pilot error.", "score": 2, "replies": [{"body": "..maybe you need to look again. Its common knowledge it was a broken sensor that triggers the nose to tilt downwards and that pilots were under trained to shut off the rebalancing system. Summing that up as “pilot error” is dumb. Boeing is just as at fault.", "score": 1, "replies": [{"body": "I get that not everyone knows the fine avionics compinents so try this: Ask your commercial airline pilot friends if it matters that the pilots were climbing to cruise altitude with an airspeed over 250 knots.", "score": 2, "replies": []}]}]}, {"body": "Go ahead and short it lol, I’ll Sell you some puts, I’m sure you’ll make bank😉", "score": 1, "replies": []}, {"body": "How long would it take for the US to build highspeed rail everywhere there's a major airport?\n\nThere's your answer right there.\n\nThe US doesn't do public transportation.  Long BA.", "score": 1, "replies": []}, {"body": "Short it, it's your turn to shine.", "score": 1, "replies": [{"body": "Based on the overwhelming WSB consensus BA is too big to fail, i probably should.", "score": 1, "replies": []}]}, {"body": "Whenever there's bad news and that stocks dips you should buy calls.", "score": 1, "replies": []}, {"body": " BA + airbus combined have at least 90% of the large plane market ([https://www.cnbc.com/2019/01/25/why-the-airbus-boeing-companies-dominate-99percent-of-the-large-plane-market.html](https://www.cnbc.com/2019/01/25/why-the-airbus-boeing-companies-dominate-99percent-of-the-large-plane-market.html)) and that not gonna change anytime soon.  The world needs a lot of airplanes now and in the future with all the flying everyone does now.\n\nBA has oodles of projects with the US government for defense, etc and partners up with others.  No, the government does not want to kill BA or see it damaged to where it can't produce airplanes everyone wants and needs now.  There is plenty of dip buyers in BA for those looking at long term holds.\n\nYou wanna shut BA and ride in older airplanes in 10 years?  Didn't think so.\n\nQuick buck will be some news plays like the Friday gap down a couple weeks ago and continuation the following Monday before ER.", "score": 1, "replies": []}, {"body": "You're tarded because Boeing had like trillions of future contracts in the future to fulfill and a massive backlog. They're super safe due to this and some crashing plane bullshit isn't going to stop the Boeing train. Be patient half a year to a year and it'll be back to 400 on the problems being fixed. How hard is it to fix a plane, jeez", "score": 1, "replies": []}, {"body": "They're an awful company that will probably collapse eventually but it won't be anytime soon", "score": 1, "replies": []}]}
