{"title": "Elon tweet reconfirms the Tesla Pickup reveal to be happening next month.", "selftext": "[deleted]", "id": "dflsob", "created_utc": 1570648285.0, "score": 170, "upvote_ratio": 0.98, "num_comments": 45, "comments": [{"body": "So far, I think Tesla has been spot on when it comes to design aesthetics. I’m just hoping the truck doesn’t deviate *too* far from the norm.", "score": 40, "replies": [{"body": "I would not be upset if it looked like this: https://www.caranddriver.com/tesla/pickup-truck", "score": 18, "replies": [{"body": "I'm pretty sure it will be more sci-fi than that. [Here's a few other mock-ups](https://insideevs.com/reviews/364925/tesla-pickup-truck-price-specs-more/).\n\nI disagree with all of them, because IMHO Franz and Elon will reinvent the pickup truck and will make forward visibility and maneuverability the front and center theme - and you just cannot do that by putting a huge chunk of cargo space, in a volume that used to host a big ICE engine, in front of the driver...\n\nCargo doesn't care whether it's in the front or the back - the only role of the front will to act as an efficient crumple zone in collisions, but other than that good visibility will IMHO be the primary design factor.\n\nSo I think [this mock-up is probably closer to reality](https://i1.wp.com/electrek.co/wp-content/uploads/sites/3/2019/10/duelj_tesla_truck_conecept-e1563640039917.png?resize=2500%2C0&quality=82&strip=all&ssl=1), the Tesla Pickup Truck will IMHO look closer to the Tesla Semi Truck than any of the traditional pickup trucks.", "score": 16, "replies": [{"body": "I would buy that.", "score": 7, "replies": []}, {"body": "Crumple zone is important\n\nWith autonomy, visibility won't matter as much in the future", "score": 7, "replies": []}, {"body": "That last one looks plausible to me. Different, unconventional, but not too extreme to hamper sales.", "score": 3, "replies": []}]}, {"body": "I like that design too.", "score": 3, "replies": []}, {"body": "I reckon he isn't going to stick to such conventional front space usage. I'm not expecting much of a frunk. Rather, I expect something sharper and more aerodynamic. More like a small semi.", "score": 2, "replies": [{"body": "A frunk in the pickup would be great.  Look at most pickups, you have to put a locked toolbox on the back taking up lots of bed space, and if you don’t want to leave something visible in the truck when parked there is no place to put it.  As a truck owner, I am all for the frunk on the truck", "score": 3, "replies": []}, {"body": "Agreed, but even the semi has a frunk.", "score": 1, "replies": [{"body": "True. But less of one. Not like this rendering not a Rivian.", "score": 1, "replies": []}]}]}, {"body": "Sold!", "score": 2, "replies": []}, {"body": "Am I the only one who thinks the light strips don't look good? Especially on the front. For me, it screams weirdmobile.", "score": 1, "replies": []}]}]}, {"body": "I’m so excited to see this. \n\nThe pipeline of Tesla products is rarely discussed. Only this week did we get a small boost on the potential for Tesla Semi.", "score": 12, "replies": [{"body": "The Semi + Roadster unveiling was 2 years ago. Since then there was the Y unveil. Now there will be the pickup unveil without having an actual date for the first two. Lately these product pipelines seem to have a beginning but no end.", "score": 12, "replies": [{"body": "Username checks out", "score": 18, "replies": [{"body": "Lol", "score": 3, "replies": []}]}, {"body": "Battery production has been a disaster. The sooner Tesla gets their own in house battery cell manufacturing off the ground, the better. Everything is being held up by batter cell constraints.", "score": 1, "replies": [{"body": "Or they just don't have enough money.  \n\nMinimal initial production semis or roadsters wouldn't use a significant amount of batteries.", "score": 2, "replies": [{"body": "True for the Roadster, but even a slow semi production line would use several GWh of batteries per year.\n\nI think they were hoping for better battery energy density by now for both projects, but the only one that has missed a target date is the Semi. The Roadster has another year to start production from the original timeline even.", "score": 1, "replies": []}]}, {"body": "Panasonic is the bottleneck, I think. The amounts they're willing to invest aren't sufficient to keep up with Tesla's ambitious growth plans.", "score": 1, "replies": []}]}]}]}, {"body": "I really hope it isn't TOO out there ... a pickup could bring in MAD profit because there is so much margin due to high price anchoring from the big three.", "score": 5, "replies": []}, {"body": "They can still beat Rivian to the first big truck numbers. Rivian just took a 100,000 vehicle order from Amazon, but is nowhere near ready to deliver. Telsa already has the process down. When the trucks come out they will be bigger than the Y.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Always feels good when you can guess the Video before clicking the Link", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "ah yes right click inspect element.", "score": 2, "replies": [{"body": "wow I can change people's words on the internet for my own viewing pleasure? This seems like such an easy way to trick someone into thinking that someone tweeted something they didn't. Funny trick!", "score": 3, "replies": []}]}]}]}]}, {"body": "\n\nThis is obviously the latest pre-order \"equity raise\" but with almost zero official news about the TMY (or the Semi, Solar Roof, Roadster 2, etc) , who is going to put money down up front when history tells us they can just as easily buy when/if it's ever produced?", "score": 6, "replies": [{"body": "Super fair point. Also since the first makes are usually the worst.", "score": 4, "replies": [{"body": "I could easily see Tesla judging that most buyers would still not be aware of the issues with early vehicles. All of the previous early adopters are a minority.", "score": 1, "replies": []}]}]}, {"body": "It will be interesting to see what it will look like.", "score": 2, "replies": []}, {"body": "You guys think the pickup event itself will..  pick up..  the stock?", "score": 2, "replies": [{"body": "Definitely. If there is one product reveal that can pop the Tsla stock, it is the pickup reveal -- huge market, great margin, and the most important piece for Tsla to dominate the US auto market. There is nothing else like that. Not Semi, not roadster, not Y, not solar, it is the pickup.\n\nWe all remember how terrible the Y event is ... but Elon needed to downplay it so that Y does not cannibalize 3 sale back then. The semi & roadster was a good event, because they are new products and do not compete with 3&S&X directly.\n\nFor that reason, I believe Elon will do great for the pickup reveal, which may also significantly prompt the Tsla brand and motivate existing product sales. And if pickup is attractive, hopefully with excellent spec, and they can announce some exciting reservation number a few days later, it will boost the stock a lot.\n\nOption is a risky play to hold for these events, or maybe pickup some and sell before the event; but definitely worth holding the stock around the event.", "score": 10, "replies": [{"body": ">  huge market, great margin,\n\nI agree about the huge market, but the great margin, normally is experienced by ICE manufacturers, may not be true for the Tesla pickup. \n\nIf it lives up to all the promises; 500 to 600 mile range, 120 and 240 volt inverters, “lots of great technology” and a price tag of $50,000, then the margins might be a little tight.\n\nWe’ll see", "score": 3, "replies": []}, {"body": "I tend to agree with this, but..  for a balanced perspective..\n\nWhat do you think /u/flufferbot01 ?", "score": 1, "replies": [{"body": "Psh... man idk. That’s a though one.\n\nI agree with the OP about the Truck, but when it launches not at the reveal. I’m not sure how the market will react much to another product launch when the solar roof, Semi, roadster, and Y still aren’t in production.\n\nIdk I normally wouldn’t chime in here because I don’t have anything but an opinion. So I’ll ask everyone, will the market like another reveal? \n\n(I don’t want to shit on this before we see it, I’m genuinely excited to see it. However, I do wish it’d come after the Y and Shanghai are going. Just my 2 cents)\n\nEdit: All I know is I’ll definitely tune in and watch the reveal. Also I will add I was more impressed with the Y launch than others seemed to be. Maybe that’s because I don’t really like the 3, but the Y looks a little better in my opinion.", "score": 11, "replies": [{"body": "> So I’ll ask everyone, will the market like another reveal?\n\nI honestly think the market is done with Elon's promises and is waiting for profits before it'll actually move the stock in a significant way", "score": 5, "replies": [{"body": "I think the Y might be Tesla's first--albeit mild--flop. To me it's more like a larger Mercedes A-class than crossover, in the very least due to ride height. If they have larger wheels (and wells) planned as a surprise to lift it a few inches more, I think it'll be a total hit.  \n  \nThe truck, on the other hand, could become such a huge platform. Stretch it, put it on small wheels, and it's a box truck. Stretch it some more and you'd have the hottest RV out there. So I think the stock might move when people see that Tesla's still got the speed of innovation after 2 years with no real exciting hardware.", "score": 1, "replies": []}]}, {"body": "How much do you think aesthetics will matter?  \"Truck country\" is all about identity, and this truck can haul, but it's just *different*.  My own view is a more normal fleet truck targeted at large commercial contracts would be a better way to get EV trucks out there initially.", "score": 2, "replies": [{"body": "Idk the 10th Gen f series sold well and was a big departure. Ugly as hell too.", "score": 3, "replies": []}]}, {"body": "I contacted my haruspex, who tells me the stock will crash because all the auto analysts will say it looks stupid and not like a truck anyone will buy. Which will be the source of “no demand” comments on CNBC for the 30 months before it enters mass production.", "score": 0, "replies": []}]}]}]}, {"body": "... [and the crowd goes](https://gph.is/1hgXBv0) ...", "score": 1, "replies": []}, {"body": ">You guys think the pickup event itself will.. pick up.. the stock?\n\nIt depends on what flavor of cyberpunk it turns out to be. I suspect there’s a fine line between bad ass & cool ... or a weird-mobile. Hopefully it’s the former.", "score": 1, "replies": []}]}, {"body": "November 2020", "score": 1, "replies": []}, {"body": "Dear Elon, before my calls expire on 11/15, please.", "score": 1, "replies": []}, {"body": "I'd like to see them drop a fat pickup ad right in the middle of Thanksgiving football.\n\nTrump sucks! Trump is awesome! Ooooh.. tesla.", "score": 0, "replies": []}]}
{"title": "VIx barely did anything and still under $20 after all this trade war.", "selftext": "https://ibb.co/tMnCVMV\n\n\nJust wanted to remind everyone that all this terrible tariff and trade war and oil destruction and repo crap and oh so terrible things recession incoming and etc. Yet VIX can't even stay above $20.\n\n\n4th quarter will be up and earnings will be good. \n\nI'm calling it right now.\n\n\nNow I want you to explain to me and WSB why VIX is under $20 and we have all this noise going on yet why is vix down?", "id": "dfp965", "created_utc": 1570663233.0, "score": 22, "upvote_ratio": 0.9, "num_comments": 43, "comments": [{"body": "Because VIX is a average of IV on a OTM sample of rolling 30 day SPX options meant to represent what the implied 12 month 1 standard deviation move is for SPX. For example, if VIX is 15 there is an implied 68% chance the S&P will be between + or - 15% in the 12 months.\n\nIn essence, it's a point in time measure of risk appetite since option prices (specifically puts) will get bid up on risk off days. However, over the past few years institutional put selling has become very popular on down days which can suppress put prices and thus VIX if it's widespread (which won't lead to a VIX blowup - different scenario than Feb 18 - unless you get a huge move that causes a lot of short covering on all these short gamma trades).\n\nSo the question becomes how do I short or go long vol? It's extremely hard to go long vol unless you can time it to the week (this is through VIX options - you can't trade \"cash\" VIX and the ETN/Fs are horribly structured for long positions, but are great for shorting over long periods of time; I have some other posts on this but nothing in depth), but if you have a strong conviction on a complete market blowup the best plays are that months' VIX option in the low to mid 20s (given VIX and VVIX are low) or OTM SPX puts with high gamma.", "score": 44, "replies": [{"body": "Came back to upvote you filthy autist.", "score": 7, "replies": [{"body": "Nice.", "score": 3, "replies": []}]}, {"body": "Well that was the best answer hands down. \n\nI feel there is something up and when is Tvix going to reverse split?", "score": 3, "replies": []}, {"body": "Wow, you evidently did your homework", "score": 4, "replies": []}, {"body": "Or just trade the front month futures while hedging with the options.", "score": 2, "replies": [{"body": "Over the length of the contract you'll get killed as the relative beta of 1st month VIX future to spot VIX increases.", "score": 3, "replies": [{"body": "In my example the use is to short vol at the beginning of the contracts, while buying calls to hedge. Since the contract typically coverages toward the end (not always). If it spikes the return on the options covers the downside risk (beta). \n\nExample short 5 contracts at 20 + 100 calls on the Spot", "score": 2, "replies": []}]}]}, {"body": "How are the ETFs, like uvxy, horrible for a long position? Uvxyis like all time low Right now, and you can straight up buy it like a stock. Just sit and ride it until the next pump", "score": 2, "replies": []}, {"body": "This should be in Bloomberg", "score": 2, "replies": []}, {"body": "Awesome description of the VIX. Do you trade TVIX?", "score": 2, "replies": []}]}, {"body": "Twink, you are so money and you don't even know it!", "score": 15, "replies": [{"body": "I'm waiting for any bigger drop late October or November and then buying any and all dips into next year.", "score": 3, "replies": []}, {"body": "HOw money was I!? Look at vix now.", "score": 1, "replies": []}]}, {"body": "You’re in luck - calls should be on sale tomorrow. Have fun", "score": 5, "replies": [{"body": "I still want to know why you think VIX is consistently down during trade war, oil problems, repo, fear of incoming recession and more?", "score": 1, "replies": [{"body": "It's not \"consistently\" down. VIX gets its value from a complex formula that calculates its value from 30 days of SPX between the 15th and the 45th day in the future (- (weekends + 24 hours)) since minutes matter.\n\nHypothetically if volatility of future put and call options go in same directions, VIX will actually stay flat and that's what happing during trade war. For example VXX dropped today because SPX's put/call ratio in near term future was above 1.\n\nNote that VIX have had -98% YOY return value\n\nI might be wrong, but if you want more info, read CBOE' VIX white paper that is 19 pages, and I'll be happy to read your TL;DR lol", "score": 8, "replies": [{"body": "Ok so I should buy tons of call spreads to negate waiting for the spike and then sell call spreads after a spike on Vix to capture the yoy return of usual negative per year?\n\nI guess they have to be 6 months expiry.", "score": 1, "replies": [{"body": "Or just watch the 20 days channel high...", "score": 1, "replies": []}]}, {"body": "Is [this](https://www.cboe.com/micro/vix/vixwhite.pdf) the CBOE VIX white paper you're referring to?", "score": 1, "replies": [{"body": "Yesir", "score": 1, "replies": []}]}]}, {"body": "For me to have an answer to that I’d need to understand exactly how VIX works. I don’t and you don’t either\n\nMy guess is that despite the volatility we’ve yet to see any real balls to the wall market wide panic selling", "score": 3, "replies": [{"body": "Well only because the algos aren't selling.. who sells when the market goes up and up in the long long run? \n\n\nSo we are just waiting for the computer selloff again right ?", "score": 0, "replies": []}]}, {"body": "Because it’s FUCKIN FIXED!! cockers suckers are holding it down until they load up. Just matter of time before it skyrockets. \nLast year vix moved higher in prices on lesser news. Look at the charts.", "score": 1, "replies": []}]}, {"body": "so, How is Vix doing and all the Calls I was always selling on Volatility? \n\nHOw they doing now? \n\nHow is Uvxy and all volatility doing?", "score": 1, "replies": [{"body": "No one cares. You’d have been better off just longing any equity or index if you’re so sure of direction on VIX. \n\nYou’re in love with the trade that can blow up in your face worse than any other. See you on your next alt account ya moron", "score": 1, "replies": []}]}]}, {"body": "Curious how well this post ages tomorrow as Dow futures just fell 250 points on 'trade talks going nowhere'.", "score": 5, "replies": [{"body": "so, how did Vix and volatility hold through, should we all have sold tons of calls on it since 5 days ago? now what do you think?", "score": 1, "replies": [{"body": "I dunno, I have an algorithm that trades volatility for me but it doesn't hold overnight.\n\nBut, judging by it's trading there is a pattern shift from just a few months ago to today.", "score": 1, "replies": [{"body": "In a sense that it's going lower or higher? Because I think Vix is going back to $10 and we are going up 4th quarter for sure on the S&P etc..", "score": 1, "replies": [{"body": "In a sense that the VIX itself has become more volatile than a few months ago. I don't really trade it long-term I just ride the waves up and down and there has been more of them.", "score": 1, "replies": []}]}]}]}, {"body": "It's going to age fine. If you read it again I said 4th quarter will be up and this drop is just to waste time and keep the market held back.\n\nIts computers trading.\n\nBut I want you to watch Apple stock tomorrow and take note of anything.", "score": 1, "replies": []}]}, {"body": "til vix is reported in dollars", "score": 3, "replies": []}, {"body": "Imagine thinking VIX is an accurate representation of anything", "score": 3, "replies": []}, {"body": "hahahahahaha. Bro your Vix 20 just arrived. Check back tomorrow.", "score": 1, "replies": [{"body": "well, what is vix at 5 days later? go ahead, say it.", "score": 1, "replies": []}]}, {"body": "What kinda autist juice are you drinking?\n\n Trade war update came AH, vix has been up trending. It broke out of the falling wedge and has been consolidating on the trend-line, while holding the midpoint of the channel its in...\n\n[Long Vix](https://imgur.com/gallery/HZ8SZ6P)", "score": 1, "replies": [{"body": "Every single time we drop 400 points down on the Dow, within that same week Vix plops right back down under $20.. what are you drinking?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "How is Vix doing now? 5  days later?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "that was stupid, how are they doing, market is still going up.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "someone in this thread writes for bloomies", "score": 1, "replies": []}, {"body": "VIX needs continuous red days to compound itself.  When the market falls, there are small green days in between.\n\nFed threat is pretty much gone now so only China trade to deal with", "score": 1, "replies": [{"body": "Brexit maybe", "score": 1, "replies": []}]}]}
