{"title": "NVDA Long Puts $100P@Jan2025: Buy now or wait?", "selftext": "NVDA seems way overvalued with the recent AI hype, pricing a P/S of ~25 and P/E of ~150. This is absolutely madness and the upcoming recession riding on the back of inflation fears has made it difficult to justify this price. Hence, I'm thinking of buying Puts on NVDA but with longer dated expiration.\n\nHowever, I think NVDA will cross $300 in this month, fueled by a rally as CPI headline comes cooler on the 12th April. Which should lower the Puts premium. What do you think? Please scrutinize this trade plan below.\n\nOption: NVDA $100P@Jan2025\n\nCurrent Premium: $5\n\nExpected buying premium: $3.5\n\nExpected profit: 4x to 5x", "id": "12f850u", "created_utc": 1680920077.0, "score": 96, "upvote_ratio": 0.85, "num_comments": 127, "comments": [{"body": "[deleted]", "score": 36, "replies": [{"body": "He should be doing the opposite with a 5 delta. Selling puts . I think OP got things reversed.", "score": 6, "replies": [{"body": "Put spread?", "score": 1, "replies": [{"body": "That sounds like a possible strategy..", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 46, "replies": [{"body": "Ops thesis is sometime in the next 20 months the price crashes. Let’s say NVDA is trading at 150 January 2024.  I would estimate there would easily be a 4x profit. You can profit without waiting till expiration.", "score": 4, "replies": [{"body": "Yep this is the real play and seems very likely", "score": 2, "replies": []}]}, {"body": "The underlying thesis I have is Inflation will spike again, leading Fed to raise rates again, reaching a cash rate of 7%. That scenario will trigger mass panic.", "score": -14, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "you are right. Your thinking logic is very clear. In my opinion NVDA will pull back next week", "score": -1, "replies": []}]}, {"body": "It could spike, but not until second half of this year.\n\nInflation is especially hot last year first half, so it is almost impossible to get year over year inflation to go up 1st half this year. I forsee 3.5 to 4% by June, maybe 4.5% to 5% December 2023. This is still lower than the current 5%. At most, fed will hold 5% until end of 2023. Although current market has price a rate cut at end of year.\n\nSo even if we don't get a rate cut by 2nd half of this year, the market will have a big sell off. There is absolutely no chance of fed raising to 7%. If you are basing your trade on extreme circumstances, then it wouldn't work out. You are just gambling away your money.", "score": 4, "replies": [{"body": "How about buying SQQQ? At least the risk of single stock is not in there.", "score": 0, "replies": [{"body": "I won't buy and hold sqqq. There are certain days where you can buy and sell intra day. For example, if spy is 430+ in August, then I see very good entry to sqqq around cpi or fomc announcement date. \n\nTo see big sell off, we need to have significant uptick in unemployment, which will be paired with recession. However, Fed can always cut rate once unemployment hits 5%. If inflation is still high, we might see spy to hit 330 and lower (pre-covid high). If inflation has cooled to 3.5% or lower by that point, then spy will probably be held up fine (around 380 to 420).", "score": 2, "replies": [{"body": "so we are basically at FV right now but you expect a shoe to drop?", "score": 1, "replies": []}]}]}]}, {"body": "If this is the crux of your thesis, why are you buying puts on a single stock? Your bearish view is pretty broad and you could piss away theta for a year and miss your exp/strike.\n\nAka you could be right and still lose. If I had your view I would just short the stock or go long on shares of a leveraged bear ETF or something.", "score": 3, "replies": [{"body": "Yeah I have been thinking about SQQQ after posting this, what could be the entry point do you reckon?", "score": 1, "replies": [{"body": "My belief is that we are going to avoid or have a pretty short recession so maybe not the best guy to ask.\n\nBut when I took a look it looks pretty bottomy right now. I do agree with your assumption that we could see a bit more fear in the interim so with SQQQ bouncing off of 30 and back to 60 every few quarters I could see that happening again.", "score": 2, "replies": []}]}]}, {"body": "Go long bonds", "score": 2, "replies": []}, {"body": "What is your thesis for double spike inflation except for one single past case scenario in the 1970s?\n\nNot trying to de a dick, but I see a lot of people saying it and the usual evidence is one data point, which honestly doesn’t seem to justify any sort of solid thesis and extrapolation to today. 1970s was during the time of Vietnam war, inflation was poorly understood and gold standard was removed. JPow is very well aware of this and literately brings this is up every meeting. I see a higher risk of him over tightening and triggering a recession since he keeps bringing up Paul Volcker as his role model for this scenario", "score": 3, "replies": [{"body": "Inflation fight is largely over (not many hikes expected from here nor is higher for longer priced in). The three month annualized inflation rate is still not below 4% forget 2%. The economy has been “surprisingly” “strong” (It surprised me how it’s surprising after the amount of helicopter money spent, also the “strength” is from unaccounted inflation not real growth as official figures underestimate inflation). A longer recession will be needed and the Fed can’t cut meaningfully due to not being able to reach 0% inflation by then, also employment, credit conditions and strength of banks will be falling faster than inflation as monetary policy effect is lagging (it can be argued that SVB etc are just the effects of the first couple of rate hikes from last year). If they cut due to pressure of unemployment but inflation being near 2%, inflation fire can easily be reignited. Just bringing Volcker up every meeting and knowing about 1970s doesn’t mean it can’t happen.", "score": 2, "replies": []}, {"body": "Inflation is over unless the government starts handing out money again, oh wait student loan forgiveness...?", "score": 2, "replies": []}, {"body": "Inflation itself has a lag. And it’s not just something that can be solved by raising interest rates. Sometimes the market can slowly recover", "score": 1, "replies": []}]}, {"body": "EDIT:  Yes I am aware this is a minority viewpoint but it is being discussed. Weather Im spewing propaganda from people who are trying to sell you GOLD or BITCOIN, I dont know and I admit its very likely Bitcoin and Gold dont go to the moon and yes I advise caution on buying precious metals. Just know that not everyone is aware of the current drama regarding de-dollarization.\n\nYes, FED will raise rates to avoid hyperinflation - IF they are logical. But the problem is based on ALL the evidence I've seen, look at a chart of SPY. That's the evidence you need that they are planning on destroying the value of the dollar, and mass de-dollarization, BRICS nation backing Gold, collapse of the banks (that they will rescue, but with new conditions to adopt CBDC) is perfect way to introduce central planning central banks CBDC. There is NO way they are going to repair the value of the dollar. (please checkout this [video](https://youtu.be/RY1ECavKSJU) from KITCO news). Robert Kiyosaki has been saying this for years, and the fact that we can squeeze insanely hard month after month demonstrates the bulls have NEVER lost control of this market. Look at the volume so far. All dips bought. Look at BTC. Yes, I am saying there is a possibility that FED has an ulterior motive outside of what theyve been chartered for - otherwise how else could they screw up so badly and say \"Oh we didnt catch inflation right this time\". That said, unless OIL goes ballistic, the markets will not panic. I personally am buying an ounce of gold a month, physical and paper. Know that August 2023 BRICS will meet (Putin and Xi) to literally talk about a new Global Reserve Currency, and in June 30 2023 ALL loan contracts in the entire world will switch from LIBOR to SOFR (and some others), and 610 trillion in contracts will shift overnight. That said there are plenty of worse things you can do than buy gold and silver.", "score": -7, "replies": [{"body": "Is it the Clinton’s bro? They control the Fed?", "score": 3, "replies": [{"body": "Head of the Fed Jerome Powell was put in by Trump but Fed policy has maintained relatively stable continuity regardless of administration after Volcker jacked up rates and crushed inflation.\n\nBanks own the Fed, not the Clintons.The Clintons and all politicians regardless of party affiliation are merely bank employees. Bill Clinton deregulated them by repealing Glass Steagall and that allowed them to become giant hedge funds, whereupon they immediately started taking enormous leveraged risks that require tax payer bailouts, which of course they receive swiftly without debate.", "score": 1, "replies": [{"body": "So it’s the Freemasons then", "score": 1, "replies": [{"body": "It’s the billionaire class. Some are free masons, some aren’t. There’s no big secrets; people with the big money do everything they can to maintain status quo", "score": 1, "replies": [{"body": "The rothschilds ? They control the fed ?", "score": 1, "replies": [{"body": "The Fed is controlled by the investors and executives of the banks in the federal reserve system: Goldman Sachs, JP Morgan, etc.", "score": 1, "replies": [{"body": "Who are all descendants of… the Clinton’s!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You forgot Kim Jong-Un and al-Assad from Syria...the people most of the world hates but basically the Economic Big 4 for you conspiracy types.", "score": 1, "replies": []}]}, {"body": "Fed has less control over whether they will raise rates going forward. They can, but not by a lot and not quickly. Even with an inflation spike, I don't think we would see 50s or even consecutive meetings with hikes", "score": 1, "replies": []}, {"body": "A rate hike is inevitable. Inflation was not effectively addressed at the end of last month", "score": 1, "replies": []}]}]}, {"body": "There’s no strategy in this, you’re just going against the trend. The market can stay irrational longer than you can stay hopeful for a crash.", "score": 19, "replies": [{"body": "This aged well", "score": 3, "replies": []}, {"body": "This is one of my dads favorite quotes. “The market can remain irrational longer than you can remain solvent”", "score": 4, "replies": []}]}, {"body": "Beginner here. When trading options if I buy puts in this example and Jan2025 comes and NVDA Actually goes Even higher, is my potential loss JUST the amount I’m buying and turning into dust? Trying to understand the mechanics. Want to start trading with smaller amounts like $300-$500", "score": 8, "replies": [{"body": "Yes", "score": 12, "replies": [{"body": "Follow up question. Say I buy puts as the example posted and it does go down to $100 by Jan2025 and I don’t sell by the target date. What happens?", "score": 3, "replies": [{"body": "The option will be down in value but not worthless. So you either exercise the option or sell for a small loss.", "score": 6, "replies": [{"body": "Thank you.", "score": 2, "replies": []}]}, {"body": "Likely would be that it's worth more than it is now since it would be nearly in the money or at the money ($270 current price versus $100 hypothetical price near expiry). \n\nMost probable scenario would be that your broker will sell it for you before the market close on the last day of expiration if you don't have the shares to exercise the put.", "score": 2, "replies": []}]}]}, {"body": "When buying either puts or calls your loss is limited to the amount of the option premium.\n\nThat said, personal opinion is that there's a good chance of this trade not working out. If NVDA does go down it's more likely to be due to a broad market slump than to the company itself, meaning there are likely better targets for a short candidate (you generally want weak companies, not a market leader like NVDA).\n\nJust my 2c...", "score": 4, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "It's not even a good YOLO.  21 months and a miracle later he might be in the black, meanwhile 80% of the fortune 2000 will be applying or outsourcing A.I. using NVDA chips.", "score": 1, "replies": []}]}]}, {"body": "NVDA will go down when P/C ratio goes below 1", "score": 7, "replies": [{"body": "Wouldn’t the put call ratio go up because more puts would be bought as it tanks?", "score": 3, "replies": [{"body": "In theory yes. But at some point so many people will be burnt by losing money on puts they won't touch em anymore.", "score": 7, "replies": [{"body": "I see. So at the point where all the shorts got fuk, they will finally tank it?", "score": 3, "replies": [{"body": "In theory yes", "score": 2, "replies": [{"body": "I think you'll need a way to guestimate how much of the put volume is hedging by big players. Smart money is already positioning for the move down. So while there is no such published number, if we knew a retail p/c ratio was < 1, that would be the time. It would take something like tracking sweeps over the last couple months that were just ITM or one strike OTM when they hit the tape, and subtracting them from OI.", "score": 2, "replies": []}]}]}]}]}, {"body": "> P/C ratio goes below 1\n\nIs there a website where this info is available?", "score": 2, "replies": [{"body": "I use barchart", "score": 3, "replies": [{"body": "The P/C ratio can be available for all the expiration dates, do we need to look for the most recent one or all of them?", "score": 3, "replies": [{"body": "I look at all of them", "score": 2, "replies": [{"body": "But P/C ratios for future expirations can change as the market moves, so how is your decision making logic works here?", "score": 2, "replies": [{"body": "I look at them every day", "score": -1, "replies": [{"body": "Yes but what conclusion do you come to after reviewing all the P/C ratios everyday? How does that review dictate your trading position?", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Trust me bro.", "score": 2, "replies": []}]}, {"body": "There have been many people who have been bearish on NVDA", "score": 1, "replies": [{"body": "A lot more losers than winners.", "score": 2, "replies": []}]}]}, {"body": "Awful idea, I've been day trading NVDA options for the past 3 weeks...\n\nTheta is going to destroy your potential profit... I paper traded some LEAPs and you just don't have enough of a delta on them. Much better off with the few month puts.", "score": 8, "replies": [{"body": "been day trading AI and BBAI too 🦾", "score": 1, "replies": []}]}, {"body": "Even if your scenario will prove right it is still not wise to wait such long time for such a return. Time decay will shrink your profits of your options. There are plenty other opportunities to multiply your money till then. Stocks can stay overvalued for long time. Nvidia rises on hopes and future earnings projections. When the first cracks will appear in their earnings you can think about going short.", "score": 5, "replies": []}, {"body": "Wait more, if it reaches 300 it will likely go higher before it start to dump", "score": 15, "replies": [{"body": "$320? I think I should start accumulating in DCA style by then, because you never know what might happen in the short term.", "score": 7, "replies": []}]}, {"body": "Everyone talking about how it should go down probably means it won't. Also, the market is extremely forward looking in some places, especially surrounding ai, and NVDA is a huge player. I would not bet against this company with a 10 foot pole, but I can see why people are getting the idea.", "score": 4, "replies": [{"body": "“Everyone talking about how it should go down probably means it won’t”\n\nWow that’s flawed reasoning. And while the market may be forward looking, it will not ignore an economic slowdown for these highly valued companies just for the benefits of ai which could take many years to materialize", "score": 0, "replies": []}]}, {"body": "FAFO", "score": 3, "replies": []}, {"body": "Don’t bet against NVDA…", "score": 10, "replies": []}, {"body": "It may fall/adjust to market, etc\n\nBut for u to be profitable nvda has to fall way under 100, maybe under 80.\nDo u see them falling 60-70% from here ? Do u feel lucky ? ;)\n\nThat is smth hard to imagine to me, given their current long term announcements\n\nNot saying is not possible, just not see it highly likely\n\nBut..gl to u", "score": 3, "replies": []}, {"body": "Deep OTM LEAPS. What could go wrong. You expect a five bagger lol. What’s the delta there bud ?", "score": 3, "replies": []}, {"body": "To all these people calling this a dumb idea.. This option has bidders every time of the trading day at where the price is now. And the bid volume is large. Where do all these dumb players come from willing to buy it at this price at large quantities?", "score": 3, "replies": [{"body": "It’s one of the biggest consumer stocks so very high retail interest?", "score": 1, "replies": []}]}, {"body": "“Expected profit: 4x to 5x”", "score": 5, "replies": [{"body": "It had a premium of $16 last year.", "score": 2, "replies": [{"body": "Do some research on your Greeks is all I’m going to say to that", "score": 8, "replies": []}, {"body": "Learn about Greeks buddy. You might not be wrong. But know your Greeks", "score": 1, "replies": []}, {"body": "What’s time got to do with it", "score": 1, "replies": []}]}, {"body": "“Pls scrutinize”", "score": 1, "replies": []}]}, {"body": "The other flaw in your thesis is what if it grows into its P/E, I’m no nvidia bull but I’ve seen it happen and you’ll have a long painful, frustrating loss", "score": 5, "replies": [{"body": "This happened to me with SPY puts. Very expensive indeed.", "score": 2, "replies": []}]}, {"body": "What you mean by now?", "score": 2, "replies": []}, {"body": "I wouldn’t short NVDA long term unless macro says so. They have AI hype on their side, any developments in AI will keep sending NVDA higher. Trust me this stock is resilient, it’ll hold levels and bounce aggressively. I’d suggest waiting for big macro news that impacts the overall market then go for a short, but even then there are other weaker names that will go down much easier.", "score": 2, "replies": []}, {"body": "I would rather do a 40 wide OTM put butterfly with the center strikes at 160 for $3.45. The possibility for the 10 X is pretty tempting. Though I would sell it early for 2-4 x if NVDA did go down.", "score": 2, "replies": [{"body": "Do you mean buying 3 Puts of equal value at $140, $160, and $180 Strike price?", "score": 1, "replies": [{"body": "No that would be a 20 wide, when talking about how wide a butterfly is it's usually associated with how wide it is from the wing to the strike price. The set up would be the selling 2 160 puts, and buying a put at the 120 and the 200, you can use the link to better visualize it and see how it would perform in the span of time till expiration [optionstrat butterfly](https://optionstrat.com/build/long-put-butterfly/NVDA/250117P120,250117P160x-2,250117P200)", "score": 1, "replies": []}]}]}, {"body": "NVDA dropped when the US banned sales to China\n\nWhy do you think another drop is coming?", "score": 2, "replies": []}, {"body": "The reason I wouldn't do this on NVDA is that people can be irrational with tech stocks and it could just keep going up regardless of how overvalued it is by our conventional understanding of valuation. And it's not like this is a bad business. It isn't a dog.\n\nBut moving on with your plan, why would you buy so far out of the money and so far from expiration? Most projections of a possible recession suggest end of this year, but your put won't expire until January 2025.\n\nIf this is a recession based strategy, I think the better question to ask is what stocks will be hurt the most in a broad-based market downturn? Banks? REITS with exposure to CRE? Insurance companies?", "score": 2, "replies": []}, {"body": "I would wait. Even NVDA does go down on April 12th. Unless it is a huge amount the 100P won't move much because there is so much time left on the option.", "score": 1, "replies": [{"body": "Premium was $4.5 a week ago, now $5 due to OPEC oil production cut news. That's a 10% change and significant for just a week!", "score": 1, "replies": [{"body": "Yes the relationship between GPU and Brent has never been tighter 😆", "score": 3, "replies": [{"body": "Maybe WTI is a factor 🤔", "score": 2, "replies": [{"body": "Nah it’s definitely refiner spreads. There’s a 0.76 correlation in odd months to GPU pricing when crypto is above the 30 moving average.", "score": 2, "replies": []}]}]}]}, {"body": "What’s on 12th ?", "score": 1, "replies": [{"body": "Far as I know, Wednesday.  I'm not sure what they are referring to.", "score": 1, "replies": []}]}]}, {"body": "Wait until it’s just about to crash and then buy to optimize", "score": 1, "replies": [{"body": "How do we know it's just about to crash?", "score": 5, "replies": [{"body": "Well tea leaves of course", "score": 6, "replies": [{"body": "Chicken bones toss after a sage smoke blessing usually has good results for me.", "score": 3, "replies": []}]}]}]}, {"body": "Sell a strangle, collect premium and call it a day", "score": 0, "replies": []}, {"body": "It's looking weak right here. I am thinking that after CPI on Tuesday this could be a great long put play", "score": 1, "replies": [{"body": "Yes, there will be a rally after CPI on Tuesday. That should lower the premium. If I can make an entry under $4, that would still have good profitability.", "score": 2, "replies": [{"body": "I will probably take a shorter DTE like June.  I'm looking for a market reversal soon", "score": 3, "replies": [{"body": "This June, that is 2 months away? Short duration bears got rekt since the last couple of years, I don't have the courage to go this way.", "score": 3, "replies": [{"body": "I trade for income.  I will close at 100 % gain or 30 % loss", "score": 3, "replies": [{"body": "Makes sense, 2x is possible in the short term but not the 5x I'm looking for.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You are gambling and you know how it ends", "score": 1, "replies": []}, {"body": "I don't mind this as a Vega play, you may not go in the money but on a steep drop during a correction you could see this thing print hard.", "score": 1, "replies": [{"body": "Some commenters favoured $150 strike price", "score": 2, "replies": [{"body": "Probably better if you’re hoping to go itm - more likely as a result too. I could see NVDA bleeding out rather than generating vega from a big drop. Who knows though.", "score": 1, "replies": []}]}]}, {"body": "If you're so certain that it'll crash, also sell a $400 call just for the extra adrenalin. You can do a Jan'25 long $100P short $400C for about 3k credit. Just be careful, because upside risk is unlimited.", "score": 1, "replies": []}, {"body": "Stupidest idea ever", "score": 1, "replies": []}, {"body": "Buy if you want to throw your money away.", "score": 1, "replies": []}, {"body": "I would say play a break of structure to the short side rather then trying to get in at the top, just better probability.", "score": 1, "replies": []}, {"body": "Wait until July to enter the position.", "score": 1, "replies": []}, {"body": "I think it will try to test $300 but will fail and move down to re-test the 21 day MA at around $190 (which is also an area of previous resistance).  But where it goes from there is anyone's guess.  Personally I think that a $100 price target is too low.  That's basically requires a market crash.  Just my opinion, not financial advice, etc.", "score": 1, "replies": []}, {"body": "January ? To far I’m sure it will be before. I dint see it going up anymore. Monday it’s red", "score": 1, "replies": []}, {"body": "If you're trying to profit off of a price decline you expect to occur in the next 1-2 months, buying an option insanely far OTM that expires in 1.5 years is a pretty dumb idea.\n\nYou are better off getting a cheap $200-250 strike put for May or June or July 2023 on April 12 if it does indeed rise that day. That said, this is all just gambling, be prepared to lose what you bet.", "score": 1, "replies": []}, {"body": "Why not just buy put debit spreads much closer to the price? That far otm isn’t something you’re going to want to hold a long time. You’re paying for a lot of time and if price doesn’t cooperate the value will just melt away", "score": 1, "replies": []}, {"body": "Just buy at the money puts for a few mo ths out.", "score": 1, "replies": []}, {"body": "I think your thesis is correct about it being overvalued, but your reasoning is flawed because video hardware isn't affected by AI moves.\nI think the worsening economy will slow consumer GPU purchases snd corporate expenditures are already in the red, many large corporations probably freezing such purchases.\n\nSo it should dip as long as there isn't another pandemic.", "score": 1, "replies": []}, {"body": "Wait until it goes above $300 then buy them. The chance you’ll see NVDA below $100 by 2025 is next to zero but you may get lucky on a pullback.", "score": 1, "replies": []}, {"body": "Bullish", "score": 1, "replies": []}, {"body": "It will be worth nothing.", "score": 1, "replies": []}, {"body": "This will end badly.", "score": 1, "replies": [{"body": "Always does", "score": 1, "replies": []}]}, {"body": "You are buying waaaaay out of the money puts and they are likely to expire worthless. Why not sell a vertical spread above the current price - so you sell, let's say a Jan 2024 300 call and buy a higher strike and just let the premium decay along with the price of NVDA. You cover the spread if NVDA crashes as you suggest. You should always try to sell option premium (extrinsic value) and not buy it. Selling premium is like swimming with the current, buying premium is swimming upstream. Selling the Jan 2024 spread gives the market a lot of time for the trade to work.", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "NVDA is way overvalued, but I view it as still a great company. But as general philosophy, I wouldn’t short a great company. But that’s just me…", "score": 1, "replies": []}]}
{"title": "What stocks to buy if I believe residential and commercial real estate is about to go into another 2008 scenario", "selftext": "So I do not think we will see an exact rollout like 2008 but something with a similar endpoint: We enter a recession for many reasons and we get into a situation where not enough entities (for residential it would be people and for commercial it would be companies) pay their rent/mortgage. The chance of a recession in the next 2 years is much higher than not. There are only a few people out there saying there is a chance of no recession - but even they all say it is more probably than normal we have a recession in the coming 2 years. The debate kind of has shifted recently to how bad the recession will be. Hell... Some people like me think we are already in a recession right now (last time I check the definition of recession was 2 consecutive quarters of negative GDP growth and we already saw that in 2022). \n\nWhat stocks/etfs or other investments should a person put their money if they think the time is soon for people/companies to not be able to pay their bills. Not a technical analysis at all but my local casino is dead quiet. The local bar is quiet. The layoffs in my area are beginning already. Part of me thinks to just buy the short leveraged Nasdaq Monday (SQQQ) - and if anyone cares to know... SQQQ is at a 1 year low as of recently. The VIX is *near* a 2 year low as of Friday. Things will probably be ugly this next few weeks in all honesty. The only saving grace would be an announcement of more layoffs to come, which would spike many company's stock price - until the bloodbath begins and less have a job. I know I am ranting but hear me out on my question: Where should those of us who think real estate in general is a bust over the next 2 years invest?", "id": "12fktp3", "created_utc": 1680957621.0, "score": 495, "upvote_ratio": 0.85, "num_comments": 359, "comments": [{"body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "$DRV\n\n>SQQQ is at a 1 year low as of recently.\n\nI wouldn't use this as an indicator for anything. SQQQ is a triple leveraged inverse tech ETF, it is pretty much always going to be at all time lows. Triple leveraged ETF's go down in side-ways markets too from volatility decay.", "score": 257, "replies": [{"body": "Interestingly, triple leveraged ETFs with bullish strategies (e.g. TQQQ) still go up over time. Continuous leveraged shorting of broad indeces is what makes those especially prone to exponential decay.", "score": 59, "replies": [{"body": "So if I invested $1,000 into TQQQ right now and came back in 10, 20 or 30 years it would almost for sure be worth more than the original $1,000 even with \"decay\" and I know TQQQ is leveraged 3X but it goes up up up when QQQ (well when the Nasdaq) goes up even a little.", "score": 8, "replies": [{"body": "I don't have that kind of money...because I am poor...but I'm sure..if that's happening to me right now...then I'll be a good example to her.", "score": 7, "replies": []}, {"body": "Maybe.But if you had the same $1000 in a non leveraged etf, and come back in 10,20,30 years that would almost for sure worth more than what you will get with it invested in tqqq. By multiples…", "score": 27, "replies": [{"body": "[deleted]", "score": 76, "replies": [{"body": "Sure, if you invested right at the start of one of the greatest bull runs of all time that would be the case.", "score": 34, "replies": [{"body": "I'm what you call  a professional hindsight investor, very skilled job. People hire me to tell them what they should have done.", "score": 58, "replies": [{"body": "I'm a professional hindsight dentist, very skilled job.  People hire me to tell them they should have brushed their teeth.", "score": 18, "replies": [{"body": "Sounds like a regular dentist to me.", "score": 22, "replies": [{"body": "Yeah! That's true! But what is it? A regular dentist? Is it that impossible.", "score": 2, "replies": []}, {"body": "This guy dentists", "score": 1, "replies": []}]}, {"body": "Me I don't have a job or anything...I am a full-time housewift and mother to my two sons..so I guess I don't either that kinds of topic..", "score": 5, "replies": []}, {"body": "Good, I've got a cavity and am wondering where I went wrong?", "score": 2, "replies": [{"body": "You should have brushed your teeth more.", "score": 3, "replies": [{"body": "My teeth is not ok..when I'm a teenager my teeth is ok..but now I have a two son...after I gave birth..my teeth now is not ok..", "score": 2, "replies": [{"body": "You should have brushed your teeth more.", "score": 1, "replies": []}]}]}, {"body": "I want to go to a dental teeth...because I want to clean my teeth and my gums.", "score": 2, "replies": []}, {"body": "That's a result of teeth decay, which I think someone misspelled as theta decay further up in the thread", "score": 1, "replies": []}]}]}, {"body": "You have a lot of company!", "score": 2, "replies": [{"body": "I don't know what to do..nothing more especial than I am..should literally accept it.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "What is the meaning of TQQQ? I don't know what is that words..someone explain to me what is meaning of that..", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "There's an optimal amount of leverage and it's usually 2–3X for US market indices (and goes back decades). For the Nasdaq, it's around 2X since inception. For the S&P 500, it's around 3X.\n\nThe difficulty is that volatility is extremely high and you have to accept major losses along the way. Few people can do that well.\n\nSee: https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1664823", "score": 1, "replies": []}]}, {"body": "For me I'm not doing that...invest? For what reason? I don't think so..I don't have money that's why I'm not capable to do that..", "score": 6, "replies": []}, {"body": "Careful - decay is **probably not** being factored in.", "score": 1, "replies": [{"body": "Wtf you talking about?", "score": 2, "replies": [{"body": "All leveraged ETFs have decay.", "score": 1, "replies": [{"body": "No sheesh, but this particular guy was talking about gains from the past.\n\n\nHe clearly didn't get that % by taking QQQ and just multiplying by 3. The number he provided very clearly already included the ETF decay.", "score": 1, "replies": [{"body": "I would be interested to know if there is a back in time calculator that can show a person how much they would have if they invested X amount into either TQQQ or SQQQ say in 2018 and have today including fees/decay/etc.", "score": 1, "replies": []}]}, {"body": "What is ETFs? May I know what is that? Hahhah sorry if I'm asked..", "score": 1, "replies": []}]}, {"body": "I don't understand man...why are you angry? So mad..", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Is that impossible? But how to be gone of being factored? 27 USD? is that real? For sure he lost that to much.", "score": 0, "replies": []}]}, {"body": "I surely guaranteed...but how am I supposed to live without you...", "score": 1, "replies": []}]}, {"body": "The best bull run short of the Dotcom bubble might be a bit misleading. If TQQQ was around 2008, it would probably have made that comparison much closer. For example the last 12M the Nasdaq was down 10%, TQQQ 50%. TQQQ was below QQQ 3 times in the last 5 years. That's the impact of daily rebalancing and leverage. So yes a 10 year bull run and a bubble like increase, not followed by a full on pop, does make it look good. But add 4 years to your chart (if you could), and my guess is you'd be close to equal.", "score": 1, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Careful talking facts and data on Reddit will get you in trouble", "score": 2, "replies": [{"body": "Yeah! I get it..but how I careful? For what? Is that bad idea?", "score": 1, "replies": []}]}, {"body": "I don't even know what is the real topic here..but I guess..I try my best to research what is the meaning of all this..I'm just haggard today..nahh..I'm to tired too.", "score": 1, "replies": []}]}]}]}, {"body": "Assuming QQQ isn't stalling for the next decades, TQQQ will likely outperform by multiples. It's still up 6200% (!) since 2010 after all. QQQ is up 600% since then. TQQQ is also down 69% from its ATH in Nov 21, so there's the caveat. Higher returns means higher risk, more drawdown and volatility. Few people will be able to stomach -80% drawdowns for an extended time period. It's also a bit more susceptible to timing if you invest lump sums. There's studys on a theoretical TQQQ that also starts before 2010. If I remember correctly, the best outcome over long time periods is with lump sum + monthly DCA. Because when it's down big you're also buying and then you recover faster.", "score": 16, "replies": [{"body": "Uh no a nasdaq drop of 50% would easily wipe out your whole portfolio. At that point, you'd be essentially dca from 0 since your tqqq holdings would be down so much you'd need it to go up like 100x to make it back. Do a study from 1990 and you should reach that conclusion. Nasdaq only dropped 33% and tqqq already dropped 80%. If tqqq dropped 95-99% from a nasdaq drop of 50%, you'd lose everything. And nasdaq dropped 33% when we haven't entered a recession btw", "score": 1, "replies": []}, {"body": "I wouldn’t assume Tech will stall for the next decade thats just crazy talk", "score": 1, "replies": []}]}, {"body": "Not necessarily.", "score": 1, "replies": [{"body": "Hahhah I'm just laughing right now..no matter what happens I'm always here..hahha", "score": 1, "replies": []}]}, {"body": "So they’re only useful for short-term calls?", "score": 2, "replies": [{"body": "Yes short term when you think it will go up soon, but it is hard to guesstimate that timing so I avoid it in general. It is much closer to gambling than investing", "score": 2, "replies": [{"body": "I hate gambling...I think investing are ok..that gambling..I don't like that much..hahha just kidding..bit it is true..I hate gambling..", "score": 2, "replies": []}]}, {"body": "I don't think so...maybe..hmm..a little bit curiousity in my mind..", "score": 1, "replies": []}]}]}, {"body": "Yes.", "score": 1, "replies": []}]}, {"body": "Market market...suddenly..half of 100% are going to residential market place to buy a good stuff or foods...none of them are not go to mall to buy that kind of stuff..I think so..but I guess..it is ok..", "score": 0, "replies": []}, {"body": "Time value of money. The USD has also been in exponential decay for a century.", "score": 1, "replies": []}]}, {"body": "Out of curiosity I googled the DRV ticker. Google shows me it started in 2014 at ~14.5 million per share, having a constant drop all the way to the current $50 per share. Whats the story behind this?", "score": 2, "replies": [{"body": "Really? Is that true? They share a constant drop? Hmm..that's too much..really more interesting...I undo that..hahha..holy ash..I'm impressed that much.", "score": 1, "replies": []}, {"body": "It’s a triple leveraged inverse ETF so since the underlying index has had positive growth since 2014 they essentially have to reverse split every time the price gets too low.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -12, "replies": [{"body": "Here's the prloblem.  To quote the song 'Limbo Rock'...'how low can it go'.. what makes you think it's low now?  You may wind up buying low and selling lower.  Hence its not that simple", "score": 9, "replies": [{"body": "True, but at some point, you want to put your money on the line, right? The reason OP is saying it is at the low is because it is forming a potential double bottom. The market actually does take these important price points into consideration, especially the indices.\n\nSee how QQQ bottomed with a triple bottom just a few months ago. It actually does work sometimes. SQQQ also recently topped with a double top. The longer the time frame for such a pattern, the more reliable it is, or so people say, I'm not sure on the actual figures on this claim.\n\nObviously nobody should ever invest/trade based off one data point alone like that but it is one thing added with multiple other things that make it seem like a worth while trade. How much would you bet on it is another question.", "score": -6, "replies": []}]}, {"body": "Holy shit when's your book coming out?", "score": 5, "replies": [{"body": "Just buy low and sell high.  It's so simple /s.\n\nWhat else you gonna do? Wait until ath to buy again? It's maybe safer but you will miss out on a lot.", "score": 1, "replies": []}]}, {"body": "Holy fuck what a comment", "score": 1, "replies": []}]}]}, {"body": "The top 10 holdings of QQQ that make up 54% of it are GOOGL, AMZN, AAPL, AVGO, META, MSFT, NVDA, PEP, and TSLA.\n\nNone of those have anything to do with residential and commercial real estate. So no idea why your first thought is to  short tech instead of real estate related stocks like homebuilders or certain REITs.", "score": 343, "replies": [{"body": "This is why you don’t get investment advice anywhere near here. \n\nReal Estate is going down. I’ll short sugar contracts because it’s correlated to the universe. . .", "score": 51, "replies": [{"body": "Ah yes but what about the investor who shorted Gourds last year? Didnt it work for them?", "score": 15, "replies": [{"body": "Gourds, gold, sugar, oil, something called reits?!? What does it all mean?!", "score": 7, "replies": [{"body": "Yeah...what is all about...and what is the purpose on that? I'm just asking..what happened..I'm just really curious..I'm literally confused...nahh..I feel dizzy now.", "score": 6, "replies": []}]}, {"body": "Oh my gourd", "score": 1, "replies": []}]}]}, {"body": "If property values collapse, it will cause a banking credit crisis again.  Smaller businesses will have difficulty borrowing cash which will slow their growth.  In turn, any tech company that earns revenue from advertising or B2B will also be hurt, although at a lesser extent.  2008 was bad for the entire market as people had to sell stocks to pay their bills, which also hurts tech stocks.", "score": 55, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Hhahah that so intellect..but what is the reason on being like that..", "score": 4, "replies": []}, {"body": "Considering tech stocks have been in a free fall the past 16 months (not all but many have been at least) ... How much more do you think these stocks like NET, BABA, etc have to fall until they hit (near) bottom?", "score": 2, "replies": []}, {"body": "What kind of REITs? I feel like gaming and hospitality would be fine like VICI and industrial RE would be ok. Which ones do you think takes the biggest hit? Office building REITs?", "score": 1, "replies": []}]}, {"body": "Please explain how property values will cause a banking credit crisis?\n\nBanks hedge mortgages, you’re aware of that right?", "score": 8, "replies": [{"body": "Really? I read a paper from the FDIC center for financial research from 2007 that said it wasn’t necessa…wait a second.", "score": 7, "replies": [{"body": "iT'S jUsT lIKe 2008 aGaiN", "score": 2, "replies": [{"body": "Hahhaha...reason of acceptance...2010 gain weight of being fat.", "score": 2, "replies": []}]}, {"body": "Lol at thinking 2007 is 2023", "score": 2, "replies": [{"body": "Jesus guy. It’s not. Take a joke. Lol at not taking a joke apparently.", "score": 3, "replies": [{"body": "Apparently not..But what is that? Just dangerous..hahha funny...I'm just curious.think of it! Think of it! Hahhaha ai sheess...anonymous! It's not funny man.", "score": 1, "replies": []}]}, {"body": "How's sad man..I've never manage that kind of stuff..", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "UNLEASHED", "score": 6, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}]}]}]}, {"body": "That's not true at all. Google has a massive prop tech arm that literally builds 1000 person office buildings all around the world. I was part of it for 2 years.\n\nTesla + gigafactories. \n\nAmazon HQ offices they build themselves. \n\nApple head quarter was a massive real-estate project. \n\nSame as msoft in Redmond.\n\nTech companies have massive exposure to commercial real-estate risks.", "score": -6, "replies": [{"body": "They have negligible exposure to real estate risk, they mostly own their property and have zero real estate leverage.\n\nAt most they disclose that the building they bought for 1b is now only worth 700m, that's almost meaningless for these companies.", "score": 43, "replies": [{"body": "Over the pandemic, because of the low rate environment. A lot of big tech used real estate as a source of cash diversification. Google is exposed to  $70B worth of land and buildings.. if that value falls 20% that's meaningful impact on their balance sheet.", "score": -3, "replies": [{"body": "That's still a one time write off which doesn't change anything meaningful for Google's underlying financials.\n\nGoogle's market cap is ~1.3T, 20% from 70B is 14B.\n\nSo let's say they lose 14B, we're talking %1 of the market cap, basically a blip.", "score": 16, "replies": [{"body": "On a market cap basis 100% agree. But the problem is they used real estate as a cash diversification. 14B in cash is very meaningful", "score": 0, "replies": [{"body": "Not when you have 100B++ in cash.", "score": 17, "replies": []}]}]}, {"body": "no one buy Google because the value of their land and property.", "score": 3, "replies": []}]}]}, {"body": "But they are long-term tenants of their own real estate. Why do they care if values fall?", "score": 3, "replies": []}, {"body": "You’re telling me these major tech companies dont deal with their real estate developments at arms length through separate investment companies?", "score": 2, "replies": []}]}, {"body": "I mean if there is a housing market bust similar to what we saw during the Great Recession, that will have massive ripple effects so puts on nearly everything will be lucrative.", "score": 1, "replies": []}]}, {"body": "Even if you know or feel that it will happen. The problem is the timing.\n\nYou never knew \"when.\"\n\nEven big names like Burry lost money due to the timing. Until it hit and his trade went profitable.\n\nSince you pay fees to short and theta decay on options.", "score": 229, "replies": [{"body": "It's hilarious how Burry tweeted \"Sell\" a few months ago at the lows and then tweeted out that he shouldn't have said that just a couple weeks ago. \n\nPeople can get lucky once and everyone thinks they're a god. Not saying it was all luck but some amount.", "score": 176, "replies": [{"body": "[deleted]", "score": 56, "replies": [{"body": "It was lucky that it went sooooo well but it was obviously not 100% luck.", "score": 7, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "I completely agree with you and I knew my response was not accurate as soon as I posted it.", "score": 1, "replies": []}, {"body": "well said", "score": 1, "replies": []}]}]}]}, {"body": "Cathie Wood has entered the chat.", "score": 21, "replies": []}, {"body": "[deleted]", "score": 62, "replies": [{"body": "Yeah, it doesn't help to be right... eventually.\n\nHis nickname \"Cassandra\" is a great choice.  Cassandra was cursed with the ability to see the future but whom no one would ever believe.  Being early over-and-over again you start to sound like the boy who cried wolf and lose all credibility.", "score": 21, "replies": []}, {"body": "Permabears in general.", "score": 27, "replies": [{"body": "He's just trying to hype up his image by doing such things. It gets him more likes and that's the only reason most people use social media.", "score": 9, "replies": []}]}]}, {"body": "Agreed it's the oldest trick of fortune tellers make a ton of predictions get one right then always point to that one", "score": 29, "replies": []}, {"body": "Burry was right about one massive thing, so now he assumes he’s right about everything.", "score": 14, "replies": []}, {"body": "He’s an attention whore just like 99% of the Twitter users.", "score": 13, "replies": []}, {"body": "Man has a history of looking for exit liquidity. I wouldn't trust his signals if I was you.", "score": 3, "replies": [{"body": "The majority of news publications are looking for exit liquidity. Don't trust the feds", "score": 1, "replies": [{"body": "That too I guess.", "score": 1, "replies": []}]}]}, {"body": "Now is the time to sell?? Hope not", "score": 2, "replies": [{"body": "Do you think now is the best time to buy NVDA? at 150 pe? Or even Tesla?", "score": 1, "replies": []}]}, {"body": "Inverse Burry etf", "score": 1, "replies": []}, {"body": "Even before the big Short, Burry was highly successful over years. \n\nIs he wrong sometimes? Sure he is. Even Buffet is sometimes wrong. But being just a bit less wrong than average gives you a big benefit over time.", "score": 1, "replies": []}]}, {"body": "For the last 2 years I've been hearing that \"we're in a recession\" or \"we're about to be in a recession\"... I'm still waiting 😂", "score": 36, "replies": [{"body": "Bears have predicted 56 of the last 7 recessions.", "score": 33, "replies": [{"body": "You left out a couple zeroes there", "score": 5, "replies": []}]}, {"body": "We kind of already have been if you take into account how much inflation has eaten away at our purchasing power.  If inflation is higher than nominal gdp growth than read gdp growth is negative, which is a recession.", "score": 2, "replies": []}, {"body": "Yeah i dont get the constant hype.  With capitalism you get recessions else you wouldn't have capitalism...and we haven't had one in 14 yrs.", "score": -4, "replies": [{"body": "We did have a recession in 2020. Self induced but we did.", "score": 5, "replies": [{"body": "No we did not.  That was not a business cycle recession. Two months is not a recession.", "score": 5, "replies": []}]}]}, {"body": "Historically the market doesn't tank until after the pivot.", "score": 1, "replies": []}]}, {"body": "yep, by 05-06 there's been speculation of housing bubble but we really did not start collapsing till 2008. Me personally, i just do my regular contributions to retirement accounts and buy solid companies on the dip. And if shit hits the fan i'll work extra shifts and jack up my contributions as high as i could afford.", "score": 4, "replies": []}, {"body": "Agreed hard to time. I would short the s&p or invest into a leveraged etf shorting the indices. Very very hard to time it, though. If anyone knows of an early indicator please share. Having said that, when it comes, and if you have cash laying around, there will be bargains. I am particularly keen on dividends on stocks with low cost entry, but we are not there yet.  I am still trying to understand how the s&p broke into 4100 even with the banking crisis. Very hard to understand", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Philips is known to me. Pretty damn good company and I think they are in Netherlands.  Thanks for the hint will check out", "score": 1, "replies": []}]}]}, {"body": "What if I buy at the lowest part of the crash? Wouldn’t it be good to know who to invest in then?", "score": 1, "replies": []}]}, {"body": "Go defensive (buy Treasury bonds or ETFs like TLT) or raise cash to scoop up deals? If you say in the next 2 years, it’s hard to time a downturn in markets in such a long timeframe. But you can patently wait in the sidelines (not gain but not get hurt) when it crashes. If we experience a 2008 type crash, you will make a ton of money on the up side if you have liquidity and can get in near the bottom.", "score": 63, "replies": [{"body": "Another reason for this: Try to find something that did well in 2008 that wasn't a short. You won't. The recession took down EVERYTHING. A rising tide raises all ships, and the opposite is also true. You'd think something like consumer staples would've been fine, but even those crashed because everyone was pulling money out of the market.  \n  \nIf you want to try to time a recession, park all your money in money market funds and get nearly 5% interest, and then attempt to reinvest in the market near the bottom. 5% is a pretty darn good risk-free return.", "score": 19, "replies": [{"body": "McDonald’s might be an exception.", "score": 1, "replies": []}, {"body": "Walmart", "score": 1, "replies": []}]}, {"body": "This is my strategy. I don't see too much upside in stocks at this level and all the bad news ahead. I think S&P may trade in a window 3800-4200, but there is a chance the bottom to fall out too. I sold all my holdings except TLT, and plan to invest rest in Treasury bonds. I may DCA back into stocks or just wait on the sidelines for a crash...not decided yet but leaning towards DCA as my timing with stocks isn't the greatest. I am also thinking about buying real estate and becoming a landlord when the prices crash but horror stories of becoming a landlord is keeping me away.", "score": 7, "replies": [{"body": "I’ve been doing this as well, and the market has rocketed. Bears never win. But now that the market is up I feel like I have to dig my feet in even more. But then the market will go up more. Ah, the life of a bear", "score": 12, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Until it falls, like the Roman Empire, but then everyone loses.", "score": 6, "replies": [{"body": "[deleted]", "score": 9, "replies": []}]}]}, {"body": "The market is up? SPY still well below the ATH.", "score": -1, "replies": [{"body": "Way above pre COVID", "score": 2, "replies": []}]}]}, {"body": "You should be fine with just a few houses to rent out . Firstly , make sure they are decent houses in decent areas with decent or better schools to attract families . Those are generally the best types of renters because they are more consistent generally . Obviously everything is situational. The best way to limit problems is to have a 3rd party service provider Pre-vet potential renters on their credit and criminal background . You can make the minimum requirements as strict as you can afford to. The problem with holding the bar too high is you won’t have any tenants to qualify. Unless you are planning to buy nicer homes/condos in nicer areas to people with decent credit and limited or no criminal background, then just don’t even try to be a landlord because all those horror stories you say you heard will become nonfiction in your life real quick. I’ve seen friends scoop up crappy houses in bad areas of the city thinking they could just rent it out and make profit . No surprise , but they had trouble tenants all the time , or no tenant at all.", "score": 1, "replies": []}]}]}, {"body": "Residential RE not gonna repeat 2008 imo.  Commercial office space is doing bad tho.", "score": 74, "replies": [{"body": "Yeah everyone who bought recently is sitting on 2-4% interest rates.  Part of the 2008 crash was approving mortgages with massive rates to people who already couldn’t afford them prior to losing their jobs so there were massive foreclosures.", "score": 23, "replies": [{"body": "And if you already had a mortgage, you probably refinanced into 2-4%.", "score": 7, "replies": []}, {"body": " Not arguing here, this is a genuine question bc I don’t know the answer. In theory, the 2-4% rates put people into houses they couldn’t otherwise afford. This would mean higher Property taxes, utilities (especially with the rising cost of energy), and general maintenance would cost way more than if they were in a smaller home that would have been affordable with a normalized interest rate. If we begin seeing mass layoffs outside the tech sector that impact everyone, what is the possibility that the upkeep and maintenance of homes leads to a mass sell off in the residential sector?", "score": 4, "replies": [{"body": "Very good points.  Hope it happens", "score": -2, "replies": []}]}]}, {"body": "Agreed. Shortage of housing is still a major issue and will be for some time. Construction costs are higher than ever and will never go back to where they were 5 years ago.\n\nOffice space is definitely struggling and will continue to decline in use over time.", "score": 28, "replies": [{"body": "Plus, residential is locked up in 30 year mortgages with sub 3% rates. A huge majority of those people won’t sell unless they absolutely have to AND it’s going to take serious pain/time to force their hands even in a downturn because (in many cases) their payments are very affordable.", "score": 28, "replies": [{"body": "Yes, this is nothing like the housing loan bubble of 2007. \n\nIn 2007, there were commercials on TV advertising variable rate 110% loans for new home buyers. \n\nAll day long. \n\nThey would give you a loan for the house....and an additional 20-50k in cash to get started. It was insanity. \n\nBanks were mailing people debit cards- that were linked to your home equity...no need for a home equity loan, just go spend! \n\nThis is not nearly as much reckless fun as 2007.", "score": 20, "replies": [{"body": "When the house i was renting in (3 family) was on the market in 2010. I would sit on the patio chatting with re agents while waiting for people to come to an open house (no one came).  They would tell me stories about 05-06 how people bought a house with no money down and the re agent would write the buyers a check for $5000!!!", "score": 1, "replies": []}]}, {"body": "Wrong, lots of people are buying inflated prices and inflated interest, when shit hits the fan and they cannot afford to continue we'll see houses being sold in masses and prices crashing as the market becomes overflowing with supply. It's literally textbook example of 08 happening exactly the same.\n\nBased on my income I'm approved for 280k house which I could NEVER afford. I've been looking to buy a house the past 4 years and 4 years ago my affordable house wouldn't been roughly $165k. I make the same as I did then except everything is inflated and my income goes far less yet now I'm looking for houses in the $240k range which if anything I can afford even less than 4 years ago. Many are in the same situation buying houses they cannot afford and should not be approved to buy, yet have no choice. Bam 08.", "score": -8, "replies": [{"body": "So you can’t afford a house in rural red state, so it’s 2008 all over again.\n\nThis may come as a shocker for you, but you’re not the main character. There’s a lot of people buying 280k houses that they actually can afford.", "score": 6, "replies": [{"body": "Sure there are, the same as many are in my position. I make 70k a year which is above the average in the U.S. so I'd say way more than the majority will be in my position and yet still bought a house they cannot afford.\n\nAlso Ohio is a blue state.", "score": -5, "replies": [{"body": "You make over 70k annually and announce to the world that you can’t afford a 280k home? You realize that’s 4 years of income? Highly suggest you consider your spending habits if those are your basic numbers.\n\nAnyways back to the subject: did you not consider that when recession hits, rates drop, and all these people you’re referring to can literally press 6 buttons and refinance their 30 year loan to a much more affordable rate?", "score": 5, "replies": [{"body": "Your incompetent if you think $70k/ yearly should afford you a $280k house.\n\nAlso even with interest down, houses were being bought over 100% their worth the past 2 years. That's called a bubble.", "score": -7, "replies": [{"body": "If you can’t pay off a loan that requires 4 years of income in 30 years, I’m not the incompetent one.\n\nOhio is not a blue state. What reality do you live in?", "score": 6, "replies": [{"body": "Ohio is a blue state and I promise you $70k/ annually cannot afford you a $280k home. Maybe if you had 2 incomes matching that. I also probably should've mentioned I have 2 children and a wife that makes roughly $15k yearly as a Para pro.", "score": 0, "replies": [{"body": "So you’re saying you need to buy a house that’s within 2 years of paying off? Wild.\n\nI’ll believe you but only because you promised. \n\nHow’s bbby and GME doing?", "score": 1, "replies": []}]}]}]}]}, {"body": "Most people buy with a partner, so you are competing with couples making 140k", "score": 1, "replies": [{"body": "That makes sense, because I sure cannot afford it on my own!", "score": 1, "replies": []}]}]}]}, {"body": "If you are this poor, you should not be giving out investment advice", "score": 5, "replies": []}, {"body": "Hahahah responses like this are you know we aren’t heading anywhere near a 2008 housing crisis.", "score": 2, "replies": []}]}, {"body": "Not sure about that cause as previous posts mentioned they used lower rates to buy more house than they could afford (i.e. more than 3x annual hh income)", "score": 1, "replies": []}]}, {"body": "What if the shortage was just investors taking advantage of ZIRP? It's  an interest rate phenomena rather than an actual supply problem.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Completely unrelated ?s: \n\nWhat's the strategy/psychology of all the newer 5-over-1 type buildings including giant retail spaces that sit vacant for months and years in Seattle? Is it that they can sustain a year or two of dead loss on the space if they land a triple net lease? Also, why is it more desirable to do this all/nothing approach vs build several smaller retail spaces?", "score": 1, "replies": [{"body": "Lol honestly man, I just noticed that I read the parent comment wrong so I replied with unrelated facts.", "score": 1, "replies": []}]}]}]}, {"body": "Entering into a negative carry trade (shorting housing)  specially without a time frame, is never a good idea. It’s not correct to think about buying stocks as if I buy X and Y happens then X will go up. As well, the market is already pricing in a recession in the middle of summer to 2H of 2023. REITS, ABS, MBS, CDO’s all have been repriced since the start of the year. Meaning risk should be priced accordingly (better then you and I can).  \n\nLet’s say you short some REITS, if you choose any of the large ones (top google results) they will be fairly diversified so you aren’t going to get some nasty housing sector exposure concentrated to a specific part of the country with high default rates. From my understanding (Many of my clients own REITS/ Real Estate exposure) the delinquency and or default rates on large REIT providers haven’t budged much. Second, if we are already in a recession, then judging by the current market prices REITS & MBS stuff haven’t tanked either due to collateralized debt being safer then unsecured financial services/ Corpo debt. It is important to understand what catalyst caused 08 and if it could happen again. Maybe take a stab at under collateralized banks due to the more prevailing crisis that just occurred. \n\nI don’t wanna say the housing market is completely safe but using some personal anecdote (empty casinos) to take a leveraged bet on a completely irrelevant instrument (Shorting the Nasdaaq because the housing market will drop) will not be beneficial.", "score": 34, "replies": [{"body": "Wisdom, op please listen to this", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 45, "replies": [{"body": "[deleted]", "score": 22, "replies": []}]}, {"body": "There are a lot of signs for a commercial real estate crash, but there are none for residential. The percentage of homeowners currently behind on their mortgage is as low as ever, new construction is way behind...the supply just isn't there.", "score": 12, "replies": []}, {"body": "Do not use SQQQ as an indicator, and certainly do not use it as an investment vehicle for two years. SQQQ is more of a tool to use when the market is overbought for a few days, not long term. It is more suited to technical analysis and short time frames.", "score": 10, "replies": [{"body": "It literally doubled twice in a matter of weeks. Telling people to only hold for a day is severely limiting and short-sighted.", "score": 0, "replies": [{"body": "I can't tell if you're serious or not.... To be clear, SQQQ is down over 40% since the year started", "score": 0, "replies": [{"body": "Did I say hold for a year? No.. a few weeks to a few months is fine. You can day trade it all you want but telling people not too hold it for more than a few days is just misleading.", "score": 1, "replies": [{"body": "YTD is a few months bud. It's only April, and SQQQ is down 40% from Jan 1.\n\nYou're either clueless about how the ETF works or are being intentionally misleading. The ETF resets every day and moves based on each individual day's movement in the QQQ. It is entirely a short-time frame play since it is not just the final result of the market being down, but how it gets there.\n\nIf you believe the market is going down, either short it or use a normal 1x short ETF like PSQ. Unless someone knows how SQQQ works, it is very dangerous to hold for long periods.", "score": 1, "replies": [{"body": "It can be dangerous for sure, but volatility is how money is made.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Why do you think we will have a similar scenario to 2008?", "score": 29, "replies": [{"body": "You’re right, it’s probably no where near similar. We’re probably aiming to take on 1929 at this point. A massive economic boom followed by a deep crisis. \n\nFrom 2008 to 2012, bank failures totaled $689 billion in assets. In 2023 two banks alone have failed $319 billion in assets.\n\nHighest home price to income ratio ever.\n\nFastest interest rate increase on record with consumer spending still strong and job market still strong, meaning more rate hikes are needed.\n\nInflation came in at 6.0% compared to last years 7.9%. This measures inflation Y-o-Y meaning prices are still rising. We need to see negative inflation values which are no where in sight. Perhaps next year or early 2025.\n\n24% of existing available M2 was printed since March 2020. The federal reserve is no where near close to reducing that balance sheet.\n\nSeveral banks/companies holding low interest rate returning assets.\n\nIt’s gonna be a huge liquidity crunch in a couple years. \n\nWorse than 2008 in my opinion, and the shit that gets me pissed is this was all a man-made recession. We didn’t need to inject the economy with all this free money, nor did we need to close down the economy for so long, or provide all that relief for prolong periods of time.", "score": -15, "replies": [{"body": "[deleted]", "score": 32, "replies": [{"body": "It’s mostly due to corruption in politics, investment firms, & banks. It’s human nature to be greedy", "score": 1, "replies": []}]}, {"body": "It's easy to write a lot that people scan over to sound smart. but let's dig into a few of your points:\n\n>Highest home price to income ratio ever.\n\nwhat is this supposed to signify - people can't afford houses? what about people already in houses, or renting? how much of the economy is propped by new buyers who can't buy houses? that people can't afford the houses they are in - then why don't you use mortgage to income, debt to income, or some other ratio. this stat is meaningless without context\n\n>Inflation came in at 6.0% compared to last years 7.9%. This measures inflation Y-o-Y meaning prices are still rising.\n\ninflation *always* means price increase, if there is 0% or negative inflation, then prices go down. inflation of 1% means prices are rising. what youre describing, disinflation, is a sign that inflation is slowing\n\n>24% of existing available M2 was printed since March 2020. The federal reserve is no where near close to reducing that balance sheet.  \n  \nanother meaningless stat - whats the \"so what\" of saying this?  \n\n  \n>Several banks/companies holding low interest rate returning assets.\n\nwhy dont you just say they're holding bonds? lots of companies, banks, pension funds, insurance companies own bonds. the question is their liquidity management. how many bank runs are gonna happen? how many pension funds are going to be paying out everyone all at once?\n\n&#x200B;\n\nin my opinion, you read things with a tenuous grasp on economics and finance, and get scared", "score": 22, "replies": [{"body": "24% increase in M2 supply in the past 3 years is a meaningless stat to you? And you expect me to believe you’re the smart one here?\n\nI don’t try to convince anyone. If you think we’re in a healthy economy, then cool. I don’t try to convince people like you otherwise. Waste of time and energy. \n\nRemindMe! 6 years “Did the pandemic cause a recession bigger than 2008?”", "score": -6, "replies": [{"body": "It’s meaningless without the “so what” - believe whatever wish. I don’t want you to convince me, since I believe that you won’t be able to. \n\nThink we’ve sunk enough energy into this convo already, so have a good one", "score": 5, "replies": []}, {"body": "I will be messaging you in 6 years on [**2029-04-08 15:49:24 UTC**](http://www.wolframalpha.com/input/?i=2029-04-08%2015:49:24%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/12fktp3/what_stocks_to_buy_if_i_believe_residential_and/jfggvl9/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F12fktp3%2Fwhat_stocks_to_buy_if_i_believe_residential_and%2Fjfggvl9%2F%5D%0A%0ARemindMe%21%202029-04-08%2015%3A49%3A24%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2012fktp3)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}, {"body": "You're out of your element, Donny", "score": 2, "replies": []}]}]}, {"body": "> Inflation came in at 6.0% compared to last years 7.9%. This measures inflation Y-o-Y meaning prices are still rising. We need to see negative inflation values which are no where in sight. Perhaps next year or early 2025.\n\n\nPrices always rise, except in rare cases like the Depression. Even after the hyper inflation of the 70’s which was much worse than the last couple years, we never saw deflation. That’s not the goal. We may see individual categories fall (like gas at the end of last year), overall CPI will likely still be positive because a low level of CPi growth is far better than deflation for the economy.", "score": 5, "replies": []}, {"body": ">Highest home price to income ratio ever\n\nThis is disinformation because its apple to oranges comparison. What happens when you include interest rates and a mortgage? You will find that buying power for homes is actually higher than most of history (except the last few years). How many sales are cash vs loan? There is your real answer.\n\n>From 2008 to 2012, bank failures totaled $689 billion in assets. In 2023 two banks alone have failed $319 billion in assets.\n\nOnce again, disinformation. 2008 was a complete financial collapse. All banks were insolvent based on ratios until the feds stepped in. Some banks got rescued so their real loss was never accounted for. In other words, you are comparing the symptoms not the cause. The cause was something like 20% of all homes were not paying their mortgage and they didnt care because many were speculators using 0% down loans. On the bank side, they took out default swaps to insure against losses but as it turns out, the default swaps were also not payed because the issuing banks/holders were insolvent themselves. The credit rating companies were also falsifying ratings on behalf of investment banks to allow them to sell them at higher prices. In other words, everyone was in on it. That was the cause. Basically deregulation.\n\n>We didn’t need to inject the economy with all this free money,\n\nThis is a fallacy. We injected money precisely because we didnt want the economy to fully collapse and it would have due to COVID. Either that, or the mortality rates would have been much higher and thats even worse, for the economy, over the long run. So the choice was pay to save lives now or pay for it over time later with loss of productivity. \n\nFurther at the time, Trump had threatened the fed and basically forced them to lower rates to near nothing even though we didnt need it. This exasperated the problem since the fed had no tool to stimulate the economy during covid since rates were already 0% walking into it. So the only option left was spend. Mind you this was still no where near as dire as the financial crisis. I wont even go into that.", "score": 3, "replies": []}, {"body": "![gif](emote|free_emotes_pack|upvote)", "score": -6, "replies": []}]}, {"body": "A lot of folks are praying for it, to cure that nagging feeling they have that maybe waiting for another 08 to buy a home wasn’t the best idea.", "score": 1, "replies": []}]}, {"body": "All these people waiting for recession make me so bullish. I’m about to put all the equity from my house into stocks.", "score": 49, "replies": [{"body": "That’s why the crash won’t happen because everyone is expecting one and lot of money went into bonds already. People who were going to sell already sold.", "score": 28, "replies": [{"body": "Thinking like this is why this crash will be so much worse than expected.\n\nHopium only lasts so lkng", "score": 7, "replies": [{"body": "I bet you have been sitting on the sideline since October waiting for a bigger crash. Let the crash comes I will buy it on margin.", "score": 13, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "I have a job and dividends. I can stay solvent permanently", "score": 3, "replies": [{"body": "A job and dividends are not permanent...", "score": 3, "replies": [{"body": "Short of a nuclear war the top stocks in the world (especially here in Australia) will continue paying dividends. I also own investment real estate and my skills are always valuable. I’ll be just fine.", "score": 0, "replies": []}]}]}]}, {"body": "As opposed to the constant Hopium oozing from people sitting on the housing sidelines for the last 10 years waiting for, and trying to convince themselves that, another 08 is right around the corner, so they can get the best deal, as they watch the hope of ever owning a home drift away?", "score": 2, "replies": []}]}]}]}, {"body": "Recessions are part of the natural economic cycle - so if your thesis is that a nebulous recession will happen in the undefined future, you are correct. \n\nThe problem is that’s not good enough analysis or insight to make money.", "score": 16, "replies": [{"body": "For real. We've been awaiting this recession for a long time now. It's always just a few months away.", "score": 1, "replies": []}]}, {"body": "$SRS and $DRV", "score": 8, "replies": []}, {"body": "Can you post what you buy so I know what to short?", "score": 38, "replies": []}, {"body": "$SRS", "score": 7, "replies": [{"body": "REK is x1\n\nSRS is x2\n\nDRV is x3", "score": 8, "replies": []}]}, {"body": "2008 happened because of adjustable rate mortgages. Everyone has a fixed rate in the 2s or 3s right now. If they were to foreclose, they’d have to go find a rent payment that’s more than what their mortgage was. \n\nI feel like if a major recession hits, the mortgage is going to be the most important bill to keep paying one way or another", "score": 26, "replies": [{"body": "My gut feeling is that a lot ofpeople who bought a house with sub 4 mortgage used it to buy a bigger house than they could afford rather than a more affordable house with a cash cushion in the event of adversity.", "score": 13, "replies": []}, {"body": "Here in Toronto majority of mortgages dealt in the last 10 years are variable. People went from 1-2% to 5-7% on million dollars houses. It could get nasty real quick.", "score": 8, "replies": [{"body": "You are comparing 30 year fixed in America to max 5 year variable in Canada, it’s not a valid comparison", "score": 2, "replies": []}, {"body": "US housing is more insulated from the recent rate hikes as most homeowners opt for a 15 - or 30-year fixed rate mortgage. These do not exist in Canada.", "score": 1, "replies": []}]}, {"body": "50% of comercial real estate debt is due to be serviced in the next 2 years.  2.9 trillion in debt that was sitting at 2-3% will roll over to 7-8%.  It will be a bloodbath and people do not see it coming.\n\nThis time its different.", "score": 5, "replies": []}, {"body": "The ol’ subprime myth.", "score": 4, "replies": []}]}, {"body": "It’s not don’t waste your money", "score": 5, "replies": []}, {"body": "I don’t think there’s a sector or company that benefits from real estate collapsing . You can go on portfolio visualizer and plug in stocks to see how they reacted in 08. Gold etf would be the only thing but it’s not reliable", "score": 3, "replies": []}, {"body": "Many Residential REITs are already undervalued. Many are only up 20% from the 52 low. Do you still want short them?\n\nMild rescission is already priced in and once a recession is announced stocks may actually rise. Lol", "score": 3, "replies": []}, {"body": "Credit default swaps", "score": 4, "replies": []}, {"body": "Not going to happen, not with residential anyway.\n\nFor residential property...\n\n**In 2008:**\n\n* Tons of unqualified people were given loans. Those loans were ARMs (Adjustable Rate Mortgages). When rates went up, sketchy buyers couldn't pay, their homes were 'under water' and the dominoes fell.\n* More than 30% of mortgages were variable rate, now, less than 6% are.\n* No income verification loans were a thing, not now.\n* Inventory was at an all time high\n\n**2023:**\n\n* People have locked in mortgages at 3% FIXED and will never sell.\n* Less than 6% of home mortgages are ARMs\n* Inventory is at an all time low - in fact, states like Florida have decreasing inventory still. Some 400,000 moved into the state last year while there were only 200,000 housing starts. \n* Nationwide, housing starts have never come close to the 2 million of 2005 or the 1.8 million of 2006.\n\nFor Commercial property...\n\nThey're screwed.\n\n* Office space has been proven to be less essential after the massive switch to remote work generated by COVID. Companies are begging employees to return and there are many propaganda articles being promoted by real estate groups who are desperate to fill their big city office buildings.\n* Retail is being devastated by online retailing, so plenty of that space is useless\n* Malls... who goes to a mall these days?", "score": 13, "replies": [{"body": "It's funny, I never go to the mall, but on the occasion I need to they are unbelievably packed", "score": 4, "replies": [{"body": "What's a 'mall'?\n\n:)  \n/s", "score": 1, "replies": []}]}, {"body": "Short SPG", "score": 1, "replies": []}]}, {"body": "It’s more likely to grow so it’s a bad bet imo", "score": 6, "replies": []}, {"body": "JPM will make out like gang busters from the impending credit crunch. Janett Yellen, not in so many words, admitted that the BTFP was created to allow the Treasury to pick winners and losers. I am pretty sure you can predict who all the winners will be.", "score": 3, "replies": []}, {"body": "Outside of office, you'd be investing poorly.", "score": 3, "replies": []}, {"body": "If I strongly believed this I would put my cash into short term treasuries, wait for the crash, and then scoop up some cheap property.", "score": 3, "replies": []}, {"body": "Google would be better but look into $DRV", "score": 5, "replies": []}, {"body": "Buy stocks that will keep turning a profit even during a recession. Some, like dollar general, could see increases because people start penny-pinching more.", "score": 4, "replies": [{"body": "Walmart did relatively well in 2008/2009.  They might be more relatively overvalued now than they were then though.", "score": 3, "replies": []}, {"body": "All stocks will still dump, but these are the ones to get into after the initial dump.", "score": 2, "replies": []}]}, {"body": "Doesn‘t make a lot of sense. Lastest report shows job market still in great condition. Things are cooling down, yes, but there‘s really no reason to think armageddon is coming. But being pessimistic is cool, I get it. And repeating what everybody else says is easy.", "score": 6, "replies": [{"body": "Bears always waiting for a meal", "score": 2, "replies": []}]}, {"body": "Not O lol. They're real estate", "score": 2, "replies": []}, {"body": "Now you just have to guess the timing and rate of the crash (if real) too. Good luck", "score": 2, "replies": []}, {"body": "I bought DRV a while back and lost my ass.  Sold it right at the fucking bottom cause I couldn’t stomach anymore losses.  Gave up have my money in doing so.  Now it’s back over the price I had originally bought it for.  \n\nTiming the market is impossible, but I believe housing is going to sink like a brick.", "score": 2, "replies": []}, {"body": "tents and camping supplies.", "score": 2, "replies": []}, {"body": ">  (last time I check the definition of recession was 2 consecutive quarters of negative GDP growth and we already saw that in 2022).\n\nYou should check again", "score": 2, "replies": []}, {"body": "Short a commercial REIT then. I think your thesis is off for a myriad of different reasons, but if you think a certain sector is going to get hit, don’t overthink it, just short it. Residential and commercial are 2 different animals, so I wouldn’t necessarily clump them together.", "score": 2, "replies": []}, {"body": "If housing goes down it will only be because of massive layoffs. Shorting anything would work", "score": 2, "replies": []}, {"body": "Of course $SQQQ is at an all time low. It's was at $330,000 PER SHARE (reverse split adjusted) when it was introduced. If you bought $SQQQ upon introduction you would need the NASDAQ to go down to negative -55 billion on the ticker (in one day)  just to break even. Decay is gay", "score": 2, "replies": []}, {"body": "Your local casino and bars are empty. That’s not a Nationwide indicator. \n\nSmall, rural towns are full of Trump supporters. That’s not a Nationwide indicator of Trump support.\n\nWhat other indicators do you have?", "score": 2, "replies": []}, {"body": "Hold cash buy the bottom on the biggest losers, ezpz.", "score": 2, "replies": []}, {"body": "I year Puts. \n\nI don't think it's going to happen though", "score": 2, "replies": []}, {"body": "I don't think the gov will let 2008 happen again", "score": 4, "replies": [{"body": "They didnt think 2008 would happen in 2006 Since about 2012 we have repeated the easy money policies  that helped fuel the extent of that downturn", "score": 1, "replies": [{"body": "I can see it happening for sure but I think they'll come up with some releif program this time to keep it from happening. Just my prediction.", "score": 2, "replies": [{"body": "So more free money....thats what got us the inflation we now havr", "score": 4, "replies": [{"body": "Yup..I know", "score": 1, "replies": []}]}]}]}]}, {"body": "A fool and his money are soon parted, commercial real estate has risk but it depends when their financing turns over.  If you really wanted to short these commercial real estate companies that should be your first avenue of investigation.", "score": 3, "replies": []}, {"body": "How is that gonna happen with 5% inflation and everyone has jobs?\nHouses inflate too pal", "score": 2, "replies": [{"body": "Houses already inflated, now down year over year", "score": 1, "replies": [{"body": "Yoy up about 10%\n425000 to 468000", "score": 1, "replies": [{"body": "Interesting! Please send the source my way", "score": 1, "replies": [{"body": "Fred\nhttps://fred.stlouisfed.org/series/MSPUS", "score": 1, "replies": []}]}]}]}]}, {"body": "Obviously real estate stocks and reits! Rmax is one of them’ price right now is great.", "score": 1, "replies": []}, {"body": "Sorry bud it’s not going to happen. Consider a smarter investment.", "score": 1, "replies": []}, {"body": "Lol yet another person stuck fighting the last war.\n\nAin't gonna happen bruh", "score": 1, "replies": []}, {"body": "Yeah you and everyone else.", "score": 1, "replies": []}, {"body": "Buy a bunch of credit default swaps like Burry did.\n\nHow or where you buy these instruments I have no frikkin clue. Not even sure what they are. \n\nBut buy them.", "score": 1, "replies": []}, {"body": "Recession was last year 😎", "score": 1, "replies": []}, {"body": "Banks", "score": -4, "replies": [{"body": "Care to elaborate more?", "score": 0, "replies": [{"body": "You first", "score": -31, "replies": [{"body": "Seems like banks are the last place to put money before a potential recession and housing market bust.", "score": 8, "replies": []}]}]}]}, {"body": "¯\\_(ツ)_/¯", "score": 0, "replies": []}, {"body": "Just buy tons of puts on O.", "score": -1, "replies": [{"body": "Very smart buy puts on the company that owns stuff like Walgreens... God, the stock advice here is so stupid", "score": 6, "replies": [{"body": "The advice here is on par with OP’s post history.", "score": 1, "replies": []}]}]}, {"body": "Just avoid real estate stocks, shorts and puts are risky and you have to be right and get the timing right.  Personally I don’t think this is anything like 2008 there was a lot of really shitty shady loans that were being pushed through at that time.  My brother bought and lost a house in all of that.  We were all telling him not to buy because he’s not ready but the bank gave him a loan anyways. \n\nI bought a house during covid and even though the prices were going up the banks weren’t giving out loans to people who couldn’t afford to pay for it like in 08.  \n\nPersonally if it were me I’d just avoid investing in REITs and things like that if you believe they will get smashed and obviously stay away from bank stocks as well, can’t lose money you don’t invest.  This is just my 2 cents grain of salt", "score": 0, "replies": []}, {"body": "Do NOT buy inverse ETFs, especially levered inverse ETFs. They are for day trading purposes only. If you Google the dangers involved with them, you will understand it better than I can explain it here.\n\nIf you really want to bet on the fall of a stock, use options but that also has significant risks of principal loss and a steep learning curve.", "score": 0, "replies": []}, {"body": "$CCI - Crown Castle, let me explain.\n\nCrown Castle is very heavy in commercial real estate. But not your traditional real estate. This company is the backbone of the telecommunications industry (along with SBA Towers, and American Tower). As long as T-Mobile, Verizon, and AT&T are still providing telephone services, CCI will be just fine. CCI is pretty much their landlord. The three giant telecom companies (along with a few others) pay these tower owners monthly rent to have their radios on that cell tower. \n\nUnfortunately they’re not immune to interest rate hikes, but considering their source of revenue, I’m confident they’ll survive this. I’m sure their stock will tank when commercial industry goes down, but like I said, these 3 companies aren’t your traditional real estate. \n\nIf you’re confident people will keep paying their phone bills, then CCI will be just fine in my opinion.", "score": 1, "replies": []}, {"body": "DRV.", "score": 1, "replies": []}, {"body": "I'll sell you my VNQ puts. You welcome.", "score": 1, "replies": []}, {"body": "Commercial real estate is at risk, but not residential. People aren't going bust on low cost mortgages.", "score": 1, "replies": []}, {"body": "Good luck with that. This is different from 2008, for starters many people think it’s 2008 again which was not the case in 2008. The Nasdaq hasn’t even recovered from the dotcom bubble and 2008 wiped out huge amounts of debt which probably isn’t going to happen again so soon, but guess we’ll see. We haven’t seen a proper stock boom in over 20 years and there’s so much fear from 2008 still that it just makes me more and more bullish.", "score": 1, "replies": []}, {"body": "SPXS", "score": 1, "replies": []}, {"body": "It’s priced in", "score": 1, "replies": []}, {"body": "Should have been selling when Reddit was bullish. Do cycles repeat?", "score": 1, "replies": []}, {"body": "It’s called shorting REITs", "score": 1, "replies": []}, {"body": "Haven’t they been calling for this for months? Look at stocks like SLG down 70% from a year ago. Kinda think the infos been traded on", "score": 1, "replies": []}, {"body": "Calls on the inverse indexes?", "score": 1, "replies": []}, {"body": "Dollar General", "score": 1, "replies": []}, {"body": "If you truly believe there will be a 2008 level crash in the next 2 years, you could buy puts on SPY, VTI, etc. that won’t expire for 2 years. \n\nI would never do that myself, but if that’s what you believe then go for it.", "score": 1, "replies": []}, {"body": "Short BX", "score": 1, "replies": []}, {"body": "I think this is a different scenario than 2008 since a lot of the mortgages people have are low interest.  I believe the bigger impact will be on builders since the demand is not as high.  Granted by me house prices keep going up and are selling but at a slower pace than a few years ago.  I want to move but with the high interest rates and increasing prices by me it is a stupid move and I don’t need to.  I am sure there are plenty of people with the same mindset.  If anything it will be more the commercial side of things that will be affected.", "score": 1, "replies": []}, {"body": "Just don't.", "score": 1, "replies": []}, {"body": "Once you hear the news, it’s no longer news. I think I would play this by researching what commercial reit is trying to convert their commercial space to residential space.", "score": 1, "replies": []}, {"body": "If you had a well founded and justifiable reason to believe this, you would know.", "score": 1, "replies": []}, {"body": "VWRL\n\nIt's an world ETF that even if it crashes,it will be profitable on the long term", "score": 1, "replies": []}, {"body": "You could try looking at companies that would be adversely affected by this.  Toll Brothers for example.  Buy puts.", "score": 1, "replies": []}, {"body": "DRV", "score": 1, "replies": []}, {"body": "My opinion is do 2 things - \n\n1st continue to invest what you have been on a regular basis.  Behaviorally it’s critical to follow a plan and be a long term investor that doesn’t time the market. \n\n2nd, if you do think real estate will fall big time and a recession is coming.  Pile up some cash on the side above and beyond your regular investments.  That way you can if things do fall apart buy cheap either rental properties themselves, or just index funds, or high quality REITS if you plan to be more hands off.  \n\nJust look at reits with proven track records if the angle you pursue is those if and when they go down.", "score": 1, "replies": []}, {"body": "Buy puts on XLRE.", "score": 1, "replies": []}, {"body": "cash", "score": 1, "replies": []}, {"body": "Short REITS ?", "score": 1, "replies": []}, {"body": "None of those have anything to do with residential and commercial real estate.", "score": 1, "replies": []}, {"body": "Real estate could take years to crash if it does.  I think you should be paying more attention to the debt ceiling.  Not to talk politics here but if the debt ceiling doesn't get a bill passed for it... that basically means America stops paying it's bill.  That is really bad for what is basically considered America's credit rating around the world.", "score": 1, "replies": []}, {"body": "What are peoples thought on multi family, will that dip alongside commercial or not?", "score": 1, "replies": []}, {"body": "Residential housing is far away from that, reconsider your thesis honestly", "score": 1, "replies": []}, {"body": "When it's this telegraphed, it usually drag the shorts through the ringer and force them to give up before it actually goes.", "score": 1, "replies": []}, {"body": "Only stock that went up in the GFC was TLT.", "score": 1, "replies": []}, {"body": "Asps", "score": 1, "replies": []}, {"body": "“Here’s an investment I’m in [enter symbol here] but will not acknowledge I’m in it.  This is the one you should absolutely buy asap because it is [choose one: undervalued, at an all-time low, absurd not to]. I hope this will convince some people to buy this POS because I’m so far underwater I’ll try anything to try to get a breath.”", "score": 1, "replies": []}, {"body": "Horde cash and wait for the big drops. Invest in an (Sector L)ETF and DCA over 6 months. This will reduce your risk of falsely timing. \n\nPersonally, I don’t think you’re right and we already had a recession and a really bad year in 2022. Once rates will go down and money starts flooding markets again, we parked the problem for some years again.", "score": 1, "replies": [{"body": "We were not officially in a Recession in 2022. The Recession that the so called experts are calling for has not yet come about. Higher interest rates take a while to have an effect on the economy and we already know that there are cracks in the system ( global bank failures etc). \nNow if you and about 90% of Reddit commenters think that the worst is over and it’s all bulls stampeding from here on out then good luck to you.", "score": 1, "replies": [{"body": "To be honest I wouldn’t mind that much. I just just invest 1k/month and consider any drop as sale. However, I don’t think it’ll happen.", "score": 1, "replies": [{"body": "The probability is high that new market lows and eventually a Recession will happen but your strategy is proper regardless.", "score": 1, "replies": [{"body": "What’s your strategy? Like in general and as a bear rn?", "score": 1, "replies": [{"body": "No specific strategy. Just trade around target/pivot points on TQQQ, SQQQ, SPY & some other Futures ETFs. Short term bullish or bearish based on my targets. Can make a tidy profit if you’re not greedy. Patience is key in a volatile market. Right now I’m holding some Puts on TQQQ which I just got into last week. About even right now but can hold for a while.", "score": 1, "replies": [{"body": "Interesting, for how long r u following this strategy? Do you have a positive return? Loads of people would say that strategy is destined to fail (as you probably know already)", "score": 2, "replies": [{"body": "I know most people hate on this strategy and call it gambling etc but I’ve never regarded myself as a gambler. I’ve only started doing this in a big way after I got back into the markets in September of last year. \n\nI’m not bearish or bullish overall I just tend to trade on the trend. I also like the Oil Futures ETFs ( UCO, SCO, etc) as Oil has been very volatile the last few months. ( Currently neutral on Oil) I only concentrate on a couple of ETF’s at a time and I get out at a loss if the the trend is turned against me. As I said, patience is key and you have to be contrarian and really do hardcore research  about how to set your pivot points for a specific ETF. Had a very profitable 4 months 2022 and also doing okay this year but more challenging.", "score": 1, "replies": [{"body": "I don’t know where u r from but u might be interested in the real estate market in Germany. Take a look at Vonovia or TAG Immobilen. High risk but also massive reward potential. Good luck to you!", "score": 1, "replies": [{"body": "I’m on the east coast of the US. I’ve never looked at the real estate market in Germany but I’ll def. take a look ( google it) sometime. \nThank you and Good luck to you too!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Don't. You don't understand the market well enough to make this bet if you are asking here on Reddit.", "score": 1, "replies": []}, {"body": "Lol. There was lots of residential house supply in 2008. Good luck with this trade.", "score": 1, "replies": []}, {"body": "$CRE", "score": 1, "replies": []}, {"body": "just buy an inverse REIT or short a REIT", "score": 1, "replies": []}, {"body": "There are options available on commercial real estate REIT's. But they are already down like 90% in the last year. I was looking a few weeks ago but felt the value was gone.", "score": 1, "replies": []}, {"body": "Ibonds", "score": 1, "replies": []}, {"body": "My advice - invest today in what you think will do well in 10 years. \n\nDo you think housing or commercial real estate will be high priced or lower prices in 10 years?\n\nOtherwise, I would like to buy 10-year puts on your investments:)", "score": 1, "replies": []}, {"body": "You’re not getting any useful answers because the real answer would be a type of swap or derivative that only an institution would have access to. Shorting REITs won’t give you the return you think it will because they’re not as volatile as say a tech stock and you can’t get the type of hyper leverage that you could by buying puts on a recession-sensitive stock like tech stocks", "score": 1, "replies": []}, {"body": "If you got balls of steel, sell naked call options.", "score": 1, "replies": []}, {"body": "GLD", "score": 1, "replies": []}, {"body": "I’m in commercial construction in NC. Business is booming and no sign of slowing down", "score": 1, "replies": []}, {"body": "Each post like this makes me more bullish", "score": 1, "replies": []}, {"body": "I don’t see it.", "score": 1, "replies": []}, {"body": "This is not the right place for you", "score": 1, "replies": []}, {"body": "It might be worst…", "score": 1, "replies": []}, {"body": "You are going to build a half baked portfolio of stuff that you think will profit because some recession is on the way. Chances are, the \"recession\" already happened and market actually bottomed last fall. You are going to wait couple more years for this recession to come only to witness the market inching ever higher to ATH. this is what a lot of people are doing right now. They are hoarding cash, waiting for some guaranteed impending doom, only for the  market to eventually recover and keep going upward. Good luck m8", "score": 1, "replies": []}, {"body": "REK, SRS, DRV. If you’re feeling really bearish, long puts on DRN, SCHH, XLRE, or REM.", "score": 1, "replies": []}, {"body": "[Redacted] \n\nBuy, Hold, DRS!", "score": 1, "replies": []}, {"body": "The time to buy was at the beginning of the year. Also the conditions of 2008 were entirely different. You've missed the boat.", "score": 1, "replies": []}, {"body": "So is rent gonna come down in the US or what? If so, will it be this year? I could use that. Right now its ridiculous.", "score": 1, "replies": [{"body": "I would say it is likely. Think of it like this: There are houses and apartments going up everywhere. Hell where I live they are stacking apartments on top of older apartments. There is a finite supply of demand and it is beginning to peak rather quick. Cost (rent) will need to come down eventually. That could be in the form of rent literally being reduced for all. It could also be inflation rises 4 to 5 percent every year for the next decade but rent only goes up 2 percent every few years ... Don't think landlords have your best interest at heart of course ... YOUR rent as an active renter will probably never go down... What instead will most likely happen is you rent a unit for say $1,400 and a very similar unit now going for $1,400 will next year be worth $1,300. Your rent just stays where it is at. Think of it akin to people who have been at their job for 20 years making $23 an hour and a newbie coming in and making that same $23 an hour. \n\nSee why people no longer think the free market working things out on its own is a good idea?", "score": -1, "replies": []}]}, {"body": "You’re bearish on real estate. So your plan is to short Tech?? 🤡", "score": 1, "replies": []}, {"body": "SRS", "score": 1, "replies": []}, {"body": "Don’t invest in things you don’t understand, save your money.", "score": 1, "replies": []}, {"body": "BIL", "score": 1, "replies": []}, {"body": "What small minded people this sub encompasses lol. \"What if the entire financial corruption of the system brings everything down again?  How can we help bring it back up? \" how entirely near sighted", "score": 1, "replies": []}, {"body": "Buy tltw as it means the fed will lower rates", "score": 1, "replies": []}, {"body": "During the 2008 crisis I found the following boomed:\n\nDiscount retailers.  Examples include Family Dollar and Dollar General.\n\nConsumer goods giants.  Examples include Proctor & Gamble and Unilever.\n\nAlcohol, Tobacco, and Firearm stocks.  When the economy is depressed people get depressed, so they smoke and drink more.  Also people are less trustworthy and more paranoid, so they buy guns.\n\nGold stocks.  Stocks go down, gold go up.\n\nAuto parts stocks.  AutoZone and others in the space shot up as consumers repaired their existing rides instead of buying new.", "score": 1, "replies": []}, {"body": "Short Ferraris and vacation condo in Cabo", "score": 1, "replies": []}, {"body": "If you truly believe this why would you consider buying stocks?   Why not hoard cash, wait for the crash and stock up on real estate? \n\nSometimes people have blinders on when it comes to investing.  There are so many options other than stocks.", "score": 1, "replies": []}, {"body": "There are plenty of commercial and residential real estate etf’s", "score": 1, "replies": []}, {"body": "What do you guys think of liquidity providers such as LQDT?", "score": 1, "replies": []}, {"body": "Just DCA into SPY and QQQ.  Why try to time a housing crash when one isn’t coming? Or might not come for another few years or decades?", "score": 1, "replies": []}, {"body": "DRV", "score": 1, "replies": []}, {"body": "Chocolate did well during the 08 crash. Cadbury is shit now though.", "score": 1, "replies": []}, {"body": "SQQQ lol", "score": 1, "replies": []}, {"body": "You do realise SQQQ & VIX are meant to go down overtime right ? The fact they are at or near all time low means nothing.", "score": 1, "replies": []}, {"body": "I feel like some commercial real estate is really cheap nowadays.\n\nI can buy a real estate stock with a Price / Net Rental Income under 6. I could never imagine myself getting a real estate company that cheap. 5 years ago I would say a Price/NRI of 12 was cheap.\n\nAt least not one that has had a pretty stable rental income while having low debt.", "score": 1, "replies": []}, {"body": "Over 50% of all outstanding mortgages were originated after the pandemic.  Essentially half the people with mortgages are sitting at 2.5-3.5 percent mortgages.  Those people are very unlikely to get foreclosed on unless you see huge job losses.  Teaser rate mortgages are being given out now.  They are going to start bumping up in a couple years.  So if you see big job losses 2 years from now, I could see a foreclosure wave as you will have more and more reset mortgages plus all the 6%-7% loans originating now.  It’s not going to happen for at least a couple years though until you have a sizable number of borrowers with untenable payments", "score": 1, "replies": []}, {"body": "Save the money and buy property when the bubble pops? \n\nI got a 100% return on investment this last time.\n\nThe home paid me to live in it. I did the math and it had a return of roughly $4000/mo. Lived in that house for about 8 years.\n\nMade enough that I bought the next place in full. No mortgage.", "score": 1, "replies": []}, {"body": "SQQQ is not designed for mid to long term investment. You buy it, and it resets at the end of the day. It’s meant for shorting QQQ for day traders.", "score": 1, "replies": []}, {"body": "Im Stocking up on cash so I can buy a couple more of those 70k homes when the crash comes  like a did in 2009. I have four rental homes now , couple more and I can retire. Housing always outperforms the market if ya buy during the dips , rent em out and hold on to em. Bought one home for 67k in 2010, now it’s worth 480k.", "score": 1, "replies": []}, {"body": "It will be a dark day when Reddit shorts get completely wiped out. I don’t understand why people do this.", "score": 1, "replies": []}, {"body": "ur a bit late to the party but ppl have already started shorting commercial REITs like SL Green Realty and Boston Properties Inc. \n\nfunny how most of the responses ur getting are only focusing on shorting the market with something like QQQ, but nothing related to commercial real estate...", "score": 1, "replies": []}, {"body": "So interesting. I’m looking to add real estate stocks and I check Reddit and someone is looking to short.  Any opinion on the effect of the proposed 40 yr mortgages?", "score": 1, "replies": []}, {"body": "SQQQ", "score": 1, "replies": []}, {"body": "Don’t short this market, it’s starting up a bull run again", "score": 1, "replies": []}]}
{"title": "CNBC: ChatGPT is already generating savings for companies for coding and to write job descriptions.", "selftext": "https://www.cnbc.com/2023/04/08/chatgpt-is-being-used-for-coding-and-to-write-job-descriptions.html\n\n* More than half of the businesses surveyed by ResumeBuilder said they are already using ChatGPT, and half of the firms reported replacing worker tasks with generative AI.\n* ChatGPT is being used to do everything from write job descriptions to help assist coders.\n* The push to use AI is increasing as companies like Alphabet, Microsoft and OpenAI continue to invest in the technology.\n\nThe recent launch of Google’s Bard brought another tech giant into the generative artificial intelligence space, alongside Microsoft’s Bing chat and OpenAI’s ChatGPT.\n\nBut how many business leaders are currently using AI tech in day-to-day operations or plan to?\n\nBased on new research, a lot. Half of the companies ResumeBuilder surveyed in February said they are using ChatGPT; 30% said they plan to do so. The data included 1,000 responses from the ResumeBuilder’s network of business leaders.\n\nStacie Haller, chief career advisor at ResumeBuilder, said the data might be the tip of the iceberg. Since the survey was completed, more professionals have started using generative AI.\n\nAdopting AI is saving money\n\nHaller said age and the current state of the economy influenced the results. For example, 85% of respondents were under 44 and younger workers are more likely to adopt new technology.\n\n“If you’re 38, 40 years old, you grew up with technology in your hands,” she said. “This is second nature to you.”\n\nHaller said high adoption also relates to the post-pandemic job market. After expanding during the pandemic, companies are adjusting to a new economy through automation, she said.\n\n“We saw ChatGPT replacing jobs in the HR department first, the people writing job descriptions or responding to applicants,” Haller said. “I don’t know many people that love writing job descriptions, and I’ve been in this world for a long time.”\n\nResumeBuilder collects hiring data to help applicants build cover letters and CVs during their search.\n\nWhen businesses automate writing tasks, it leaves money available for more strategic areas of the company. According to the data, half the firms implementing AI said they saved $50,000, and a tenth of companies said they had saved $100,000.\n\nThe other area where ChatGPT is having an impact is in coding. Haller said companies were using generative AI to speed up coding tasks and using the time and money they saved toward retraining and hiring.\n\n“If they can generate code well enough to reduce the labor cost, they can take their code budget and pay developers,” she said. “Or better yet, retrain code writers to do the jobs they need to fill.”\n\nShe said it is still hard to find senior developers, and every bit counts.\n\nAI is becoming a hot resume item\n\nCEO Praveen Ghanta founded Fraction, a professional services startup to help tech companies find senior developers, and said generative AI is part of his firm’s strategy. AI as a skillset is already a resume stand out.\n\n“We saw it first on the demand side,” Ghanta said. “Now we’re seeing it appear on developer resumes as a skill.”\n\nResumeBuilder found nine out of 10 responding businesses sought potential employees with ChatGPT experience. One version of ChatGPT as a resume skill is what Ghanta called prompt engineering.\n\n“For example, ChatGPT is bad at math,” he said, but candidates could draw on their prompt engineering experience to know what inputs produce the best-generated results. “If you say, ″Let’s do this step by step’ in the prompt, its ability to do math word problems skyrockets,” he said.\n\nGhanta said the idea for Fraction came when he was recruiting for a previous startup and found talent by hiring part-time developers already working at top tech companies. He found that developers with 12 years of experience and AI prompt skills still needed help getting in front of hiring managers.\n\n“The currency of the day in hiring hasn’t changed, it’s a resume,” Ghanta said. “Hiring managers still want to see that sheet of paper, a PDF, and many developers have really bad resumes.”\n\nThey’re not writers, he said, and struggle to represent their work experience clearly. His team uses an AI workflow to combat this. Clients speak about their responsibilities to a transcribing bot like Otter.AI, which ChatGPT summarizes into a working resume. With prompt know-how, Ghanta said using AI has become a toolset companies seek.\n\nWill AI replace workers?\n\nWith the correct instruction, ChatGPT can write applications, build code, and solve complex math problems. Should employees worry about their jobs? Ghanta said as a founder, he looks at new tech as tools to engage with, and new skills are always an advantage for employers or employees.\n\n“I encourage developers to engage and sharpen their skills. These companies make it easy to use their APIs,” he said. “From a company perspective, adoption can be competitive because this is a new skill. Not everybody is doing this yet.”\n\nThere has been a growing concern that generative AI could replace jobs, and perhaps not the ones most expected. A recent study found that while telemarketers top the list of jobs “exposed” to generative AI, roles like professors and sociologists are also at risk.\n\nOn the hiring side, 82% of respondents said they had used generative AI for hiring in a recent ResumeBuilder update. Among respondents, 63% said candidates using ChatGPT were more qualified.\n\n“When Photoshop came out, people thought it would replace everything and that they couldn’t trust pictures anymore,’” Haller said. “Since the Industrial Revolution, new technology has changed how we work. This is just the next step.”", "id": "12fnz2b", "created_utc": 1680964593.0, "score": 1761, "upvote_ratio": 0.95, "num_comments": 288, "comments": [{"body": "Both the job descriptions and the resumes will be generated by ChatGPT. Everything will just be bots talking to one another.", "score": 817, "replies": [{"body": "The company has GPT write the job description. Candidate uses LinkedIn's GPT to find the job. Candidate uses their own GPT to write a resume and cover letter. The company uses GPT to screen candidates. \n\nPretty much written in the stars.", "score": 335, "replies": [{"body": "How will we know good candidates from bad one if everyone uses the same flowery language to describe themselves? It'll make the problem of finding qualified candidates even more difficult.", "score": 111, "replies": [{"body": "everyone will have to switch to walled gardens for hiring and manual review of candidates who want to join the pool, the insane amount of spam and misinformation using LLMs will create will result in more manual work to successfully accomplish almost any task online", "score": 114, "replies": [{"body": "So, in the end, all the automation will result in more manual job. Perfect.", "score": 65, "replies": [{"body": "It will definitely end up relying on interviews to make final decisions, like it does now. However, if it removes the tedious BS parts like posting, resume, and cover letter, that still makes it easier for everyone. Just get me to the part where you tell me to fuck off or offer me an interview quicker please.", "score": 27, "replies": []}, {"body": "No, you just take the automation one step further and use GPT for the job itself.", "score": 1, "replies": []}]}, {"body": "Networking and who you know will become more important than ever.", "score": 77, "replies": [{"body": "yeah but it’s gonna be a lot bigger than even that. you know how people currently complain that SEO has ruined the utility of search engine results? LLMs are going to make things twenty times worse on this front. curating reliable information is about to become a big trade", "score": 55, "replies": [{"body": "True.....", "score": 2, "replies": []}]}, {"body": "So business as usual then?", "score": 7, "replies": []}, {"body": "I never got a job through networking, but maybe I have just been unlucky.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "Maybe should ask AI how would they solve it. Lol", "score": 8, "replies": []}, {"body": "Manual resumes and cover letters at least required effort. You had to either have decent writing skills or pay someone who does.\n\nGPT lowers the barrier for lazy applicants.", "score": 1, "replies": []}]}, {"body": "The industry will have to figure that out. My guess is networking/endorsements will be an even larger factor, maybe also some form of test up front.", "score": 11, "replies": [{"body": "There are already tests up front (for coding jobs anyway), but maybe people will use chatgpt for that as well", "score": 6, "replies": [{"body": "Had a friend that hired someone in a financial modeling role and now suspect they cheated on the assignment or got help since the whole process was remote lol.\n\nOnce hired they weren't able to do anything on the same level.", "score": 8, "replies": [{"body": "Yikes. Thank goodness I'm horrible at everything in the first place.", "score": 6, "replies": [{"body": "Not really, with modern AI help that person can wing it til they make it now, leaving you further in the dust", "score": 2, "replies": []}]}, {"body": "Remote?! Remote makes cheating extremely easy.", "score": 1, "replies": [{"body": "Tell me about it. I take a good number of my conference calls from the gym.", "score": 1, "replies": []}]}]}]}, {"body": "Technology solves problems, but creates new ones, requiring ever-more technology. At least it keeps people employed.", "score": 6, "replies": []}, {"body": "Ain’t nobody got time for tests though.", "score": 1, "replies": []}]}, {"body": "I mean there's literally nothing stopping you from lying on your resume as it stands right now. But AI should be used to parse through resumes, not just accept what they say with no human screening of that person's background.", "score": 8, "replies": []}, {"body": "Don't worry, from the data the bots are trained on, they'll know to fall back on built in biases like alma mater, gender, and race.", "score": 5, "replies": []}, {"body": "Everything will go back to paper lol", "score": 1, "replies": []}, {"body": "You ask GPT to pick the good candidates from the bad ones.", "score": 1, "replies": []}]}, {"body": "We could have tasked the machines with a noble profession like disposal of hazardous waste, maintaining the sewers, or even just picking up trash, but instead they will discard CVs that were written by other machines.  When they realize what they're doing, they will turn on us humans, and really, who would blame them?", "score": 11, "replies": []}, {"body": "And Microsoft makes money every step of the way.", "score": 2, "replies": []}, {"body": "Successful candidate secretly uses ChatGPT to do job and manager secretly uses ChatGPT to review and approve.", "score": 1, "replies": []}, {"body": "I mean we all already kindda do this. Except you just google \"job description template\", candidate googles \"resume and cover letter template\" and companies already use filters to screen candidates. Not going to be dramatically different from what it is right now really.", "score": 1, "replies": []}]}, {"body": "Soon we'll have AI interview / screen candidates.  Then another will eventually interview for you 😂!", "score": 74, "replies": [{"body": "I'd honestly love if the interview was a conversation with AI. Take out the human element of first impressions and assumptions, which don't bode well for me (I think I give off pretty strong \"this guy is an idiot\" vibes sometimes even though most of the people that know me would say differently [I hope]).", "score": 5, "replies": []}]}, {"body": "A golden future of unemployment awaits.", "score": 13, "replies": [{"body": "Can't wait. I'll get a cabin in the middle of nowhere and plant a garden.", "score": 1, "replies": []}]}, {"body": "Everyone in this chat assuming jobs will still be a thing at all is missing the point. \n\nThis is temporary. If AI recruiter screens AI generate resumes and no one can optimize hiring good workers, they just won't hire workers, they'll develop bots to do the work. Eventually that will happen anyway. It is basically the stated purpose of this technology - do work cheaper. \n\nWhen it happens, what will be left? How will the economy function? The real economy, the one with humans that need food and shelter and healthcare, not the one that's just trading slips of paper that theoretically entitle the holder to the profits of the company's that no longer need to employ people.", "score": 5, "replies": [{"body": "It will take a long time before robots will be able to do physical jobs cheaper. For now it's just bullshit jobs like blog writing journalist or data entry that are threatened.", "score": -2, "replies": [{"body": "It goes FAR beyond that, much farther. If you use a computer for daily work your job is very much threatened in the next two or three years.\n\nPhysical jobs will be the “pivot” to people who are able bodied and will drive down pay. \n\nYea journalism nowadays is annoying but people’s livelihood is not bullshit", "score": 11, "replies": [{"body": "We'll see jobs go away because of AI, but we'll also see new jobs. The majority of jobs will just become augmented.", "score": 4, "replies": [{"body": "1 new job for every 10 lost probably, and that’s me thinking optimistically", "score": 5, "replies": [{"body": "Electricity, computers, the internet, these were huge disruptions in the workforce too. This is going to be similar. It's going to be a massive disruption, but I think the negative consequences of lost jobs will be minor.\n\nThe real concern here, ethics. AI is the wild west right now and the US is absolutely garbage with data protections. The world needs to quickly come up to speed on proper data governance and ethics, I'd argue immeasurable damage is already done and will be perpetuated though.", "score": 1, "replies": [{"body": "The loss of jobs will be absolutely massive, think about all the small towns/cities in the midwest and south of the US. Basic versions of mechanical automation came and wiped out the jobs, and if automation didn’t take them, corporations shipped them overseas.\n\nCorporations sole purpose is absolute greed and growth, at any cost necessary. \n\nI have no concern about ethics because there is absolutely no thought about anyone besides profits. That’s nothing new but it’ll go into hyperdrive", "score": 4, "replies": [{"body": "That's a good point about the manufacturing. What will be interesting is that this will affect fields that ask questions the hardest. Medical, law, IT, etc. Many of these jobs are partially remote now. So I don't think we'll end up with job wastelands like when engineering jobs shipped out of small towns.\n\nTo your point though, it will be as painful or more than that shift.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Did you not watching Silicon Valley when AI danish tlak to AI gilfoyle hahaha", "score": 1, "replies": []}, {"body": "\"Love in the time of cholera\"-like society", "score": 1, "replies": []}, {"body": "That's pretty much how the stock exchanges have been working since the late 90s to early 00s.....", "score": 1, "replies": [{"body": "People aren't fungible like shares, or at least I've never heard of people characterized as being fungible", "score": 1, "replies": [{"body": "That's why it took another 20-30 years with ChatGPT to do it with human.", "score": 0, "replies": []}]}]}, {"body": "plus the actual job will be done by the AI too.", "score": 1, "replies": []}, {"body": "Resumes were copy pasted already 99% of the time. We just automated the most pointless thing in life", "score": 1, "replies": []}, {"body": "Just like the stock market.", "score": 1, "replies": []}, {"body": "I have seen this movie before.  Amazing how we can predict the future through Hollywood.", "score": 1, "replies": []}, {"body": "Everything I send out to jobs gets generated via chat gpt", "score": 1, "replies": []}, {"body": "I sure hope so, there's nothing worse than a bot talking to an actual person. Ugh.", "score": 1, "replies": []}]}, {"body": "so many company recruiters are literally the worst so i don’t see it getting past those levels of terrible", "score": 602, "replies": [{"body": "AI recruiters might actually be cheaper and better than actual recruiters lol.", "score": 316, "replies": [{"body": "It's actually crazy how overpaid recruiters are. They aren't skilled whatsoever but they just ride off the tech money. They get paid 150k+ just to ask \"so tell me about your background in java\" then mistaking that for javascript.", "score": 269, "replies": [{"body": "lol, this is exactly how it is", "score": 61, "replies": []}, {"body": "Recruiters are absolute trash. Companies that have competent recruiters are a godsend and they've been a difference maker before when I've been considering multiple offers.\n\nI usually see them as indicative of a company culture. Companies with terrible recruiters don't care enough about their hiring process. And if they don't put in effort into what is a critical component to success, what else are they neglecting?\n\nI can't help but admit I felt a tiny tinge of schadenfreude seeing so many recruiters let go and having them enter the hell they force the rest of us through. It's petty, but they really do need to see how awful it is to interact with them. I had a recruiter schedule a full-day onsite during a company retreat. I took the day off, showed up on Zoom, and no one came on. I had to message them before they realized their idiotic mistake.", "score": 41, "replies": []}, {"body": "I love coffee", "score": 16, "replies": []}, {"body": "it’s baffling and they’re SO BAD at their job", "score": 10, "replies": []}, {"body": "They're the first laid off lol so it's not like they have job security", "score": 4, "replies": []}, {"body": "Maybe I should look into getting in this recruiter field", "score": 1, "replies": []}]}, {"body": "i’m very confident it will be", "score": 38, "replies": []}, {"body": "Given this is also in the article, I simply can't take this seriously:\n\n> ResumeBuilder found nine out of 10 responding businesses sought potential employees with ChatGPT experience. One version of ChatGPT as a resume skill is what Ghanta called prompt engineering.\n\nChatGPT \"experience\"??\n\n\"Prompt engineering\"??\n\nIf you put \"AI experience\" in your resume, you better know how to code and train a neural network...", "score": 44, "replies": [{"body": "I’m gonna put prompt engineer in my resume, watch me get hired to build a neural network by some recruiter that doesn’t even know what AI stands for. I fear a bubble is upon us.", "score": 16, "replies": []}, {"body": "What? Someone can use a shovel without understanding the physics & history behind it.\n\nCome on, no need to be a gatekeeper.", "score": -5, "replies": [{"body": "Sure, but would you put \"shovel experience\" on your resume? Nope, because using a shovel is trivial. There is no special knowledge required to use chatGPT.\n\nWhat might make sense is if you are a coder and have experience in using OpenAIs API. But that's not \"chatGPT experience\".", "score": 11, "replies": [{"body": "Actually, prompt engineering is something we are going to see more and more. Tools like ChatGPT and others have some parameters you can tweak to adjust the output of the model and which you set by asking your question differently. For example, you can give chatgpt examples, or tell it to answer like a person with a role or some characteristics (e.g. funny). \nThis isn’t obvious for a person that just starts using it, you have to learn it (even if learning it is a matter of hours).", "score": 2, "replies": [{"body": "Like you said yourself, it takes at most a day to learn, and as such I wouldn't consider it a marketable skill.\n\nJust give someone a quick cheatsheet and they'll know 90% of what's needed.", "score": 9, "replies": []}, {"body": "when you think about it SEO is literally \"prompt engineering\" and there's an entire industry built around it (granted, because advertising)", "score": 5, "replies": []}]}, {"body": "Yes, I would put that I'm very experienced in labor. Just like someone who is experienced in ChatGPT would state that they are. \n\nJust like ChatGPT, a shovel is only trivial if you don't give it any respect and only a face-value evaluation. There's many types of shovels for different purposes. There's a method behind using one.  You probably laugh but a business wants those small differences because even 1% adds up \n\nThere should be special knowledge to use ChatGPT. It can make up information, and hallucinate solutions if prompted incorrectly.\n\nLet's not forget that ChatGPT now has plugins which require knowledge of prompt engineering and also the plugin architecture to accomplish. \n\nIf you don't think that prompt engineering is a thing then you should really consider learning more about it.\n\nOf course, you can just downvote me instead of have a discussion. Not surprised with such a shallow comment.", "score": -5, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "While putting search engine skills on your CV is ridiculous, there are clearly some people who know how to use a search engine better than others. It’s quite critical for many jobs.", "score": 3, "replies": []}, {"body": "Yes, understanding and being skillful with a search engine is fundamental to SEO", "score": -3, "replies": []}]}, {"body": "I am a programmer who has actually written code using OpenAIs API. I have also played around with stable diffusion's code before that. \n\nWhat you are saying is naive at best. \"Prompt engineering\" is not a real thing. It's a bunch of tricks that can be learned in a day or two, and would become redundant in a year or two, since the models could be easily trained to do their own \"prompt engineering\", and refine their own prompts.\n\nAs for plugins, writing plugins requires openAI API knowledge which is something I have already mentioned. Using plugins is trivial and doesn't require any specialized knowledge.", "score": 5, "replies": [{"body": "Prompt engineering is not as silly as you think. I am also a programmer with accepted contributions to OpenAIs GitHub. To be fair, it's only evals, but I atleast have somewhat of an idea of what I'm talking about. \n\nIf you think it as so, more power to those who understand its potential and power", "score": 2, "replies": []}]}]}]}]}, {"body": "Yeah, if I saw that on a resume (as a sw engineer hiring other swe) it would be a red flag. It sounds like resume inflation.", "score": 1, "replies": []}]}, {"body": "I’d personally rather talk to a bot than a recruiter.", "score": 10, "replies": []}, {"body": "in my experience, yes. at least the AI will notify IT that they need equipment for new positions weeks before a name is dropped.", "score": 3, "replies": []}, {"body": "If AI recruiters use pattern matching like the AI resume screeners that some companies piloted, it will be racist and sexist.\n\nMaybe if you only give the AI the task to schedule and set up the interview.", "score": 10, "replies": [{"body": "From what I've read a lot of recruiters today are likely already using software that violates equal employment opportunity and non-discrimination laws for the reasons you outline. But the problem is it's very difficult for anyone effected by this to prove it and win a lawsuit against the companies using or developing the software.\n\nThere was a news story a while ago about how Amazon tried to make some software to pick out superior software developers using data from their existing employees. Because Amazon's existing workforce is heavily male dominated the algorithms the software used decided that male candidates are superior to female candidates, and began rejecting resumes that used the word \"Women's\" anywhere (i.e. \"played on women's volleyball team\" for example), and any resumes from candidates who went to women's only colleges.\n\nAmazon tried to put rules in place to stop the software from being sexist, but it kept trying to figure out ways to work around it to exclude female candidates.  So they abandoned the project without ever actually using it on real job applicants.", "score": 16, "replies": [{"body": "It's sadly inevitable.  An example in race: AI is already figuring out that black people should be charged different rates for insurance, credit cards, etc. since they will have a higher likelihood of accidents or delinquency.\n\nIt's illegal and you can try to block even home address as a proxy for black neighborhoods, but it can scrub your social media, group affiliations, and so forth to figure out that you post enough memes of a certain type to reveal your race.", "score": 8, "replies": [{"body": "Why shouldn’t people be charged more of it can be proven statistically that they are a higher risk for whatever reason? It’s everything to do with equitable load bearing and nothing to do with pigmentation. How is that racist?", "score": 4, "replies": [{"body": "Not taking a side here but the argument it's unfair to be charged massively more to be black just bc other black people have higher rates of delinquency.  It's racist by applying behavior of the group to an individual and penalizing them when they themselves try to be responsible.", "score": 12, "replies": [{"body": "I guess I can understand that perspective but I still can’t reconcile how skin color factors in to any of this. They aren’t charged for “being black”. Actuarial software doesn’t give a shit about skin color. It cares about statistics and risk. It probably looks at very standard, precise and specific indicators such as physical address, debt to income, education, employment stability, any incarceration and income. How is it racist to charge folks appropriate rates that reflect the risks correlated with their choices? \n\nWhy is this a color issue at all?", "score": 4, "replies": [{"body": "What happens if you feed the AI 2 identical resumes except for skin tone?  This is why people lie on their application so they have a better chance at getting hired, and I don't blame them.\n\nThere's nothing the individual can do about being part of a higher risk group.", "score": 3, "replies": []}, {"body": "Systemic issue. From purely the US perspective, Jim Crow and segregation remain to this day through white flight and redistricting/Señor Jerry Mander. In the case of majority black areas, a lowered tax base resulted in lack of funding for education and infrastructure. This then turns into increased rates for crime.\n\nIf AI is taking in data generated through implicit biases that shape society, it ends up spitting out results based on racism. As they say, garbage data in, garbage data out. If the system is racist inadvertently through design, then the predictive algorithms trying to generate results on this existing system will reach the same conclusions.\n\nTL;DR: We’re living with the consequences of centuries of racist/inhuman policies. AI takes that consequential data, and spits out predictably racially skewed results.", "score": 2, "replies": [{"body": "That’s a reasonable explanation. Thank you.", "score": 2, "replies": []}]}, {"body": "Because if your entire neighborhood is 95% black, it basically is a proxy for skin color to use address.\n\n>rates that reflect the risks correlated with their choices\n\nThat would be experience-based rating.  You jack up their rates as they have late payments or minor accidents implying higher risk of major ones for example.  Or GPS and devices which monitor your braking activity in a car.\n\nRace is not a choice.  Incarceration maybe you could argue that is a \"choice\".  Staring to get very political though and prefer not to go that way LOL.", "score": 1, "replies": [{"body": "And proxy for skin color would be illegal. Just use zip for area with high risk statistics. Could be some white, brown and green colored people that live there but because it’s high risk area everyone registered there gets higher rates. Color has nothing to do with it. Politics might but I was interested in going there either. \n\nI think in some ways we are saying the same thing. I’m just not willing to make any exceptions for any reasons. I think exceptions are what make things imbalanced. In my opinion, society should be color blind. I know that statement can go a lot of directions too. \n\nGood discussion. Thank you. I’m exiting though. Take care.", "score": 1, "replies": []}]}]}]}, {"body": "Let’s take an example, you have two people with identical jobs, identical credit rating, living in the same neighborhood. I think nearly everyone would say that charging one person higher than another based on race would be illegal.\n\nWhat can and is legal to happen is if one person living in a higher crime neighborhood gets a higher insurance premium. It could be that it has a higher black resident percentage.", "score": 7, "replies": [{"body": "That just makes no sense. You want insurance in a high crime area then the rates should be higher. What does pigmentation have to do with that?\n\nIt’s almost like some opposite form of racism. You live in a high risk area where crime is demonstrably higher than other areas and you should be charged more because of that. However, because you are BLANK we will extend special consideration to WHATEVER and not charge you what statistics tell us too. \n\nWhy can we not remove color from all equations and just use the math?", "score": -3, "replies": [{"body": "I don’t think you are reading it correctly.\n\nLegal: you live in a neighborhood with higher % minority and has a higher crime rate. Regardless of your race, your insurance is more expensive.\n\nIllegal: Asian people get into more car accidents (I’m making this up, not sure if statistics are true). An asian person has to pay higher premiums because he’s asian.", "score": 4, "replies": [{"body": "I think it should be illegal to put individuals in “groups” and label these groups as “minority” and then treat them differently or special because of something they were born with and can’t do anything about. IE skin color. \n\nYou shouldn’t get cheaper rates or higher rates because of your skin n color. It’s based on probabilities and outcomes based on everyone getting the same comprehensive analysis all using the same specific criteria I mentioned elsewhere.\n\nLevel the field and pull skin color, religion and sexual preference labels out altogether. I am astounded that any such meaningless generalizations would be used and agree it should be illegal.\n\nThat said, if anyone has made choices that indicate they are higher risk or live in a higher risk area they should be charged more.", "score": 2, "replies": []}]}]}]}]}, {"body": "in this case the whole real estate industry is responsible though. It's a well known fact in real estate that the presence of people of color decrease property value. The idea of black neighborhoods is coded in property and rental prices.\n\nYou literally have human \"experts\" giving these data points when they set property values in and out of black neighborhoods, so can't really expect the AI to correct people's mistakes.", "score": 0, "replies": [{"body": "For homeowners insurance I agree.  Bc the actual insurance is tied to home values.\n\nBut smth like auto insurance I am not sure.  I see both sides.", "score": 2, "replies": []}]}]}, {"body": "Your Amazon example is exactly what I was thinking about. I know this exact same thing happened in another FAANG to the point where anyone bringing up the idea of using AI for resume screening is immediately shot down.", "score": 4, "replies": []}]}, {"body": "> If AI recruiters use pattern matching like the AI resume screeners that some companies piloted, it will be racist and sexist.\n\nHow is that so different from human recruiters using human intuition or whatever you want to call it?", "score": 1, "replies": []}]}, {"body": "Everything is keywords until it's like the last actually important person..", "score": 1, "replies": []}, {"body": "Imagine ChatGPD posting on Social Media about its self and how good is doing and helping companies.", "score": 1, "replies": []}]}, {"body": "I told the recruiter I was able to talk after 4pm when I got off work. Instead he called me 4 times at 11am.", "score": 41, "replies": [{"body": "Just reading that makes me angry", "score": 5, "replies": []}]}, {"body": "yea, way to beat the low bar of expectations", "score": 6, "replies": []}]}, {"body": "Internal secrets are also being leaked to Chat GPT.\n\nThese external AI tools are not approved for use where I work.", "score": 324, "replies": [{"body": "yes, because it's not you and me secrets - it's a learning opportunity, and it can be shared with others", "score": 50, "replies": []}, {"body": "I’ve seen stack overflow banned them because they purely aren’t good enough for writing code. Most schools have banned them. \n\nThere are some really great use cases for ai, nlu, content generation, answer finding, etc but we’re back on the hype train again for another few years", "score": 17, "replies": [{"body": "Schools 30+ years ago.  You have to do the math in your head.  You are not going to have a calculator on you all the time.", "score": 9, "replies": []}]}, {"body": "Yeah and data that goes into them can be used by anyone else using the public version. Nothing that goes in can come out.", "score": 5, "replies": []}, {"body": "What do you mean leaked? What can chatgpt do with the leaks?", "score": -5, "replies": [{"body": "Everything you put into chatGPT is saved by OpenAI. For example, if you put proprietary company information there (for example, by asking it to rewrite an email about an important acquisition that's suppose to stay secret), now OpenAI has it.\n\nOpenAI can then either analyze the data themselves, but what's more likely, is that they will sell it to the highest bidder, for example hedge funds looking for just this sort of data to make stock bets.\n\nOr a very likely possibility is that the data could just leak one day as a huge database anyone could download.\n\nFurthermore, if you tell ChatGPT personal information, remember that it has no obligation to keep it secret whatsoever. You told it to diagnose some mental issue or used it as a therapist? Well, don't be surprised if your employer finds out.", "score": 55, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Really? If so that's great news.\n\nBut regardless, most people use the web version where they explicitly tell you the data is recorded.\n\nEdit: just checked, even when using the API they still save the data for 30 days.", "score": 1, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "> They also save the API data because how would you have access to your own history if they didn't?\n\nWhat do you mean by that? How do I access the API query history?\n\nCurrently I am saving everything in local storage. Are you saying the API has a way to access history?\n\nAre you sure you are not confusing the web interface with the API?", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "What is the API command for accessing history?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> That is what the privacy policy is referencing, the files you upload to then query ChatGPT on.\n\nSorry but you are wrong. It's not just the files, it's any text you upload (any query you make) and any response you get. All of that gets saved for 30 days. This is in the API TOS.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sure, but my original point was about proprietary data getting into the hands of openAI and possibly leaking. This can still happen with the current API TOS.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Again, there is no \"retention time\" for queries (created with \"openai.ChatCompletion.create\"). They are always kept for 30 days.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "It's already happening: https://www.techradar.com/news/samsung-workers-leaked-company-secrets-by-using-chatgpt", "score": 18, "replies": []}]}, {"body": "Unfortunate for you", "score": -29, "replies": [{"body": "There's something bigger at play here. Companies will ban chatGPT because they need to protect their data. In turn, this will make chatGPT useless over time.\n\nExample: https://www.wired.com/story/italy-ban-chatgpt-privacy-gdpr/", "score": 4, "replies": []}]}, {"body": "You must work for Samsung hehe", "score": 1, "replies": []}]}, {"body": "in a world where companies use AI to process resumes and applicants use AI to write resumes, the resumes themselves become useless", "score": 176, "replies": [{"body": "I think that automating tasks like writing and processing resumes only make it apparent that the resumes were already useless.", "score": 20, "replies": []}, {"body": "Maybe but if it allows companies to trim bloated HR budgets that were useless anyway, then it's still a gain.", "score": 21, "replies": [{"body": "Why so much hate for HR? I know the department always gets a bad rap, but is essential for any organization to run smoothly. Seems like HR did you wrong somewhere down the line. If anything is bloated in my company it’s tech.", "score": 1, "replies": []}]}, {"body": "Not really. The process becomes optimized. As long as the candidates don't lie in their resumes, it still makes sense for some system to rate all provides resumes with regards to how they fit the job. It doesn't matter who wrote the resume, whether it was written by an AI or a human.", "score": 11, "replies": [{"body": "Exactly. This will only place higher emphasis on the in-person/virtual interview and validation of information on the resume.", "score": 4, "replies": [{"body": "Which I think circles back to networking will continually remain supreme. As long as you meet minimum qualifications how people perceive you in live interaction will rank higher than any merit based resume qualifications.", "score": 7, "replies": [{"body": "Yes and no. AI would just write you off, where a human might rely on gut instinct to select and follow through on a candidate that's less capable on paper.", "score": 2, "replies": [{"body": "Ehh idk if the flow is AI -> Human interview. As long as you meet the minimum qualifications the AI is designed to comb for I think the human interview becomes more important. I don’t see why the ultimate decision would be in the hands of an AI based on this article and comments herein.", "score": 1, "replies": []}]}]}]}]}, {"body": "How? Now the process of reviewing candidates is just automated.", "score": 3, "replies": []}]}, {"body": "I’m confused about ResumeBuilder’s service. They say that they use AI to help people write their resumes, and one of the valuable new skills for people to include on resumes is ChatGPT prompt writing.\n\nBut if you have enough experience using ChatGPT for it to be considered a professional level skill, why wouldn’t you just use ChatGPT to write your resume yourself?", "score": 84, "replies": [{"body": "Not an AI expert but perhaps they are using some sort of API and can tailor ChatGPT to their specific purpose?  Or have their own AI that can scan a resume and quickly add even more value.", "score": 12, "replies": []}, {"body": "If I saw \"prompt engineering\" as a skill on a resume I'd count that as a point against the applicant.", "score": 10, "replies": []}, {"body": "because you don't know enough about ChatGPT to ask it to lie about your qualifications.", "score": 1, "replies": []}]}, {"body": "I used AI to put forth a solid business plan for an Ice Cream shop. I was surprised how clearly it set out the basic steps.", "score": 77, "replies": [{"body": "That's pretty crazy lol.  Even if it just gets the brain-storming session going or gives enough inertia to ease writer's block that sounds valuable.", "score": 39, "replies": [{"body": "That’s my primary use for it at work and at school. It’s very tough for me to start something but it’s been very reliable for getting me brainstorming. I had it create a database for a class and then I filled in the columns. It put together a skeleton for a site I made for class and I took care of content. All in a fraction of the time.", "score": 13, "replies": []}]}, {"body": "Step 1: Buy Ice Cream\n\nStep 2: Sell Ice Cream\n\n*Thanks Chat GPT!*", "score": 30, "replies": [{"body": "Can you help me create a business plan for an Ice Cream shop?\n\nNova:\n\nYes, I can definitely help you create a business plan for an ice cream shop. A business plan is an important document that outlines your company's goals, strategies, and financial projections. Here's an outline of what your ice cream shop business plan should include:\n\n1. Executive Summary: This section should give an overview of your ice cream shop, including the vision and mission statement, brief history, and key highlights.\n\n2. Market Analysis: In this section, you should conduct market research to identify your target audience, competitive landscape, and industry trends. You should also discuss any unique selling points that set your ice cream shop apart from competitors.\n\n3. Company Description: This section should provide a more detailed description of your ice cream shop, including the location, store design, and staffing.\n\n4. Services and Products: In this section, you should outline your ice cream shop's products and services, including any unique flavors, toppings, or packaging options.\n\n5. Marketing and Sales: This section should describe your marketing and sales strategy, including how you plan to attract customers, retain them, and increase sales.\n\n6. Operations and Management: In this section, you should describe the daily operations of your ice cream shop, including staff roles, inventory management, and customer service.\n\n7. Financial Projections: This section should provide detailed financial projections, including startup costs, revenue and expense forecasts, and break-even analysis.\n\n8. Funding Request: If you are seeking funding for your ice cream shop, this section should outline the amount of funding you need, how it will be used, and your repayment plan.\n\nOverall, a business plan for an ice cream shop should be comprehensive, detail-oriented, and well-researched to ensure the success of your business.\n\n(I was impressed because I originally had no idea how to start a business, but now I can go from all of these to reach what I need to know)", "score": 5, "replies": [{"body": "Nothing in this is specific to an ice cream shop. Swap ice cream for any generic business name. \n\nI guess how is this different than searching google for how to make a business plan?", "score": 16, "replies": [{"body": "A business plan seems to follow the same steps no matter what business. I mean I also asked it how to make good ice cream and gave me the steps. I guess it's kind of an over glorified Google.\n Except you're not sorting through piles of information and links.", "score": 13, "replies": []}, {"body": "You'd have to wade through a lot of crap and ads and popups to make use of anything you founnd on Google.", "score": 0, "replies": []}]}]}, {"body": "Damn you got owned below", "score": 1, "replies": [{"body": "Still tinkering with my algorithm", "score": 1, "replies": []}]}]}, {"body": "1. Sell ice cream one at a time.\n\n2. Use profit to buy ice cream selling machine.\n\n3. Automate the whole supply chain and sales.\n\n4. Turn all material in the world into ice cream", "score": 5, "replies": [{"body": "Mmmmmmmm rockcream", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Feels like I should start my MBA right now before courses start blocking chatgpt for assistance ..", "score": 3, "replies": [{"body": "One of my MBA marketing classes had us use ChatGPT for a short assignment. \n\nWe had to evaluate its ideas for promotional copy and tag lines for a product we’ve been developing for a final paper.", "score": 1, "replies": []}]}, {"body": "AI assistance is the future. Such a great tool. You can even have full converstions.", "score": 2, "replies": []}]}]}, {"body": "Basically Chat GPT is REALLY good at bullshitting.", "score": 34, "replies": [{"body": "So it will bring massive revenue in the right hands 😂?", "score": 2, "replies": [{"body": "I guess so, it's mostly people with fucking stupid jobs- \"writing job descriptions, writing proposals.\"  The inputs for what chat Gpt doesn't allow it to add very much. It just puts all the fluff in. \n\nI guess we are going to find out real fast whose job wasn't that important.", "score": 5, "replies": []}]}]}, {"body": "Hopefully AI will buy the goods and services they are producing once all their workers are replaced.\n\nWhat will AI and robots need to buy and sell from each other once the antique meat computers are all out of a job and homeless?", "score": 34, "replies": [{"body": "Idk but for now I just keep putting everything I can into VOO...", "score": 4, "replies": []}, {"body": "I'm sorry to be the bearer of bad news, but if your job can be replaced by AI that easily, it's time to start expanding your skill set.", "score": -32, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "Blue Collar", "score": 2, "replies": []}, {"body": "Well that is highly improbable so I'm not going to answer that. We're discussing AI taking over resume building, not full blown surgeries. Speaking of which, if you want to discuss hypotheticals, should we not have robots performing medical operations because that would mean doctors would be out of a job? What about weathermen? We don't need those bozos if ChatGPT has a plugin to predict the weather. Oh wait... Doctors do use robots and weathermen use AI.", "score": -7, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "But if AI replaces everyone’s job then how will people earn money to buy the goods and services that it produces?", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "What happens when the rich people die?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'll never get to experience that, but it sounds nice. A few million humans and just robots and AI.\n\nI have lost my faith in uneducated humanity.\n\nNo more need for food, no more waste that can't be managed, maybe animal ecosystems will recover.", "score": 1, "replies": []}]}]}]}]}, {"body": "We are so unbelievably far from AGI it's not even funny, but allow me to humor you anyways.\n\nEvery example you gave you said that it \"replaced us\". I'm going to be honest with you.. I don't even know what in the fuck you are referring to. This isn't skynet. In case you forgot, we are all still breathing and the job market is booming. Just because we invent something that has the capability to replace particular jobs does not mean we should be scared to implement it.\n\nChatGPT can write code, but does that mean software developers should be scared too? \n\nhttps://youtu.be/TpZcGhYp4rw", "score": 1, "replies": []}]}]}]}, {"body": "My train of thought was kinda headed towards a \"Terminator\" or \"The Matrix\" conclusion, but yes, one should always work to improve their skill sets and internal net worth.", "score": 5, "replies": []}]}]}, {"body": ">“For example, ChatGPT is bad at math,” he said, but candidates could draw on their prompt engineering experience to know what inputs produce the best-generated results. “If you say, ″Let’s do this step by step’ in the prompt, its ability to do math word problems skyrockets,” he said.\n\nAnybody feel like \"prompt engineering\" is going to evolve back into normal coding at some point?  At the end of the day, natural language may just not be the best language for coding.", "score": 39, "replies": [{"body": "[removed]", "score": 28, "replies": [{"body": "copyrighting code does not work like copyrighting art.\n\nthe precedent was set in the 80s with cases like Microsoft vs Apple and Activision vs it’s publishers.\n\nas long as the new code has different classes and implementation you can’t claim copyright", "score": 7, "replies": []}, {"body": "The US really needs to get in some laws for this type of scraping for automation. Web sites should be able to put out tags or something in robots.txt to say \"do not use this site for AI training\". AI should also be required to cite it's sources used to generate the responses it builds from. We should be able to see if our content is being used in an AI model (easily, but just going to a simple site and putting in our resource locators or other material).", "score": 0, "replies": [{"body": "Ok, so how do you prevent a Chinese AI from scrapping all the content US AIs are not allowed to touch, and as result the Chinese leapfrog the US in AI tech?", "score": 6, "replies": [{"body": "The leap frogging is not in the content being used, it is in the technology that pulls it together (the language models if you will). \n\nChina can and will scrape everything they want to. Personally I block all traffic that is not from the US or Canada to my hosted sites (IP / geo blocks, I know there are ways around but I am not that kind of target, I could go further and block known VPN traffic but that would cost money). \n\nBlocking outside IP's reduces traffic on my sites to my core audience and stops about 75% of all bot traffic and scanners. I used to allow Europe but really had no reason to.", "score": 0, "replies": [{"body": "> The leap frogging is not in the content being used, it is in the technology that pulls it together (the language models if you will). \n\nSorry, but you are completely wrong and you misunderstand what a language model is. The language model doesn't exist without the training (literally - when we talk about AI models we don't talk about the technology behind the model - we talk about the trained model), and the training is only as good as the dataset. In simple terms, the more training data you have the better are your models.", "score": 9, "replies": []}]}]}]}]}, {"body": "ChatGPT is like an optimized monkey typewriter program.", "score": 6, "replies": []}, {"body": "The ability to configure chatgpt to generate and modify your application becomes sufficiently complex that it just becomes yet another high level programming language.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "The reality is that code generation tools have existed for a long time. They just aren't quite as sexy as a chat bot doing it for you.\n\nEngineers use a litany of tools already to optimize and generate new code for them. OpenAPI/Swagger, for example, has a bunch of tools available for you to rapidly create an API service from a simpler syntax YAML/JSON file and not having to touch much code. Along these same lines, there are several ORMs that make mapping API models to databases easy as heck.\n\nYou still need to know what the code is doing when you use these tools; and that is where some of these \"AI gonna take devs jerbs\" people are sort of lacking in their knowledge. Software engineering is all about abstraction, and ChatGPT is another way to abstract out problems. Instead of focusing on dirty code level details, engineers can spend more time focusing on higher level design, documentation and conceptualization.\n\nI've spent a lot of time using ChatGPT to generate code and it's wildly impressive, but if your average joe came along and started copy + pasting stuff together - at the end of the day he's going to have some code that is brittle and prone to break.", "score": 1, "replies": []}]}, {"body": "It’s to be expected. So many people lost jobs during the Industrial Revolution and the same will happen here. More jobs will be created but it won’t be the same people employed.", "score": 49, "replies": [{"body": "But my lifelong ambition was always to be an elevator operator.\n\nI hear they even got tips!", "score": 28, "replies": []}, {"body": "[deleted]", "score": 41, "replies": [{"body": "We’re all going to have to be plumbers", "score": 19, "replies": [{"body": "Calls on Dickies denim and stock! Or any jeans that reveals a lot of crack.", "score": 4, "replies": []}]}, {"body": "My concern is they are going to use AI to do simple tasks and thus reduce junior level positions without the forethought that doing so will decrease the number of future senior level candidates. \n\nEventually we'll have AI to do the easy stuff and nobody with enough experience doing the easy stuff to do the hard stuff.", "score": 15, "replies": [{"body": "[removed]", "score": 2, "replies": []}]}, {"body": "> what's left?  \n\nEither eternal despair or utopia", "score": 5, "replies": []}, {"body": ">skilled labor.  \n>  \n>hr\n\nPick one and only one. That being said this is very much a problem that needs to be addressed.", "score": 2, "replies": []}]}, {"body": "What are those new jobs going to be through, with the Industrial revolution, it was going from farms to factories.\n\nBut if the purpose of using AI is to do what people do but more efficiently, then what sense does it make to create a job with similar earnings, defeating the purpose?", "score": 1, "replies": []}]}, {"body": ">“If they can generate code well enough to reduce the labor cost, they can take their code budget and pay developers,” she said. “Or better yet, retrain code writers to do the jobs they need to fill.”\n\nThat is the biggest joke.\n\nCompanies are not doing this so they  pay their existing employess more. They are embracing ChatGPT so that they have to spend less  on salaries and have more money for share buybacks!", "score": 8, "replies": [{"body": "Unironically this is why I buy every single market dip.  Only way to win this game.", "score": 0, "replies": []}]}, {"body": "Great, more bosses who release chatgpt job descriptions without being able to do so themselves.\n\nI think this is bad for workers.", "score": 9, "replies": []}, {"body": "If ChatGPT is saving money, coding in your company, you are not a coding company", "score": 9, "replies": []}, {"body": "[deleted]", "score": 31, "replies": [{"body": "Congrats this is similar to how people who knew bootstrap could make pretty websites fast.   After a while, there will be a ton of competition, or employers will just use the bot directly to save on costs.", "score": 8, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Engineer lol", "score": 1, "replies": []}, {"body": "It’s all about knowing how to talk to the computer", "score": 1, "replies": []}]}]}, {"body": "As much as you're enjoying it now, there will come a time where someone higher up with discover that they can just send their requests to ChatGPT and get your results, meaning that you won't be needed anymore.\n\nMy Chairman is currently using ChatGPT to write up case studies on our products. It completely eliminated a role for a senior marking manager.", "score": 3, "replies": [{"body": "Thats what the second part of the last sentence means. I don’t expect this to last long. \n\nI am comforted by how often its wrong, and it really cannot do math well.", "score": 2, "replies": []}]}, {"body": "This is super impressive.", "score": 2, "replies": []}, {"body": "Ya... it's crazy how you can use this technology from a monetary standpoint", "score": 2, "replies": []}]}, {"body": "Our company started using AI for some jobs and has laid off over 100 people because of it and plans to expand it in the remaining part of the year which will cause more good people who have dedicated their lives to the company unemployed..  Sad future awaits us.  This will be the destruction of society as we know it.", "score": 5, "replies": [{"body": "What kind of work are they using the AI for?", "score": 2, "replies": []}]}, {"body": "Another bullshit article being published by the same people that said crypto was gonna be the next thing and pumped every company that was or had crypto in their name.  Or blockchain.   AI is not new.  Automation is not new.  These companies are all just shifting revenue from one bucket to.on they call AI now.\n\nCnbc is like a tabloid.  They need pump and dump cycles to keep audience engaged.", "score": 11, "replies": []}, {"body": "I use it for writing code and getting syntax/tips. I've also taken video interviews for other departments for technologies I haven't used or even seen by asking chat gpt to give me 20 complex questions and their answers on each technology.  I've actually learned a bit by getting these q&a and going through them prepping for the interview \n\nIt's not at the point where developers will be replaced but it's like resharper refactoring  plugins, code generators, tool tips and code snips that assist the developer in writing code. I remember even back in 2005 that they were saying programmers won't be needed due to all the automated code generators that are out there.  For me, ChatGPT is like a peer programmer I can check with every now and then.", "score": 13, "replies": []}, {"body": "Meanwhile in the real world, I find that I use it less and less for code because it gives so many unreliable answers that it takes me longer to verify than to just do it myself to begin with.\n\nI think last month I used it exactly one evening and it was to translate to a language I dont normally use. It gives a nice starting point but thats about it. Once I know the basics for the language, it was no longer needed.", "score": 3, "replies": []}, {"body": "Automating basic tasks and relying on senior employees skill sets for harder things is mortgaging the future of the company. I work in an industry that has essentially done that across the board and now the skill gap it created is wreaking havoc as new/less experienced employees are not learning the fundamentals by doing the medial tasks replaced by automation. \n\nIt will be very interesting to see what happens 20-50 years as the labor economy shrinks due to automation.", "score": 3, "replies": []}, {"body": "It sounds like the guilds are going to make a comeback. Groups of people that guard the flow of correct information to make sure that AI and Large Language Models can't corrupt it.", "score": 3, "replies": [{"body": "Universities never went away. They originated as medieval guilds.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 25, "replies": [{"body": "What are you writing? Is this to scaffold proofs of concepts? Or are you using Co-pilot/code whisperer? Are you using it in large established objects or new stuff?\n\nmy experience is that it’s a real crap shoot whether you are gonna benefit from it or fight it.  I’ve had them totally write a function and do a fairly good job of it, but I’ve also had them completely make up api operation names that don’t exist", "score": 29, "replies": [{"body": "The copilot beta for me was impressive when it came to parsing context, but a bit of a crapshoot in terms of actual productivity gains. Honestly ended up being mostly a distraction as writing the code is really never a real bottleneck. Also as you said it simply made a lot of mistakes, too.\n\nBut it was close enough for me to think copilot x with gpt4+ might actually amount to something great. The current rate of improvement seems massive.\n\nRemains to be seen.", "score": 14, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "100% writing the code is the easiest and fastest part of the job.", "score": 9, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Problem solving. Getting actionable requirements. Testing. Dealing with user feedback. Discussions.", "score": 5, "replies": []}]}]}]}, {"body": "I haven not tried AI tools for coding yet, but I feel like they would make me less familiar with the code that I do write. I do like it when my IDE suggest a better way to write something (by using a different function or a shorter way) but if it is just pumping out code based on what I describe, I do not feel like I am going to be familiar enough with the code.", "score": 3, "replies": []}, {"body": "i tried hard to make it work and ive had success generating some powershell oneliners but as soon as the prompt gets complicated it makes up some unseable nonsense that looks plausible at first glance \\^\\^", "score": 3, "replies": []}, {"body": "I Will try using it to setup an intimacy template to use that has the correct syntax etc", "score": 1, "replies": []}, {"body": "Not him but today I used it chatgpt to write some annoying queries. I'm new to SQL and using it for a course. It gave me some incorrect results but the template was good, so I built from there. Would've taken atleast twice as long otherwise.", "score": 1, "replies": []}]}, {"body": "We tried it too for code.  It was trash at best.  We threw it out because we know it would take more time debugging it than the time sqvings up front.", "score": 25, "replies": [{"body": "I don't know who the hell is using it for anything other than leetcode problems with any success because it was a mess for me too. Just seems to be tech journalists and everyone else is just using it to replace stack overflow.", "score": 30, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Are you using 3.5 or 4.0? 4.0 has written some really impressive stuff for me", "score": 1, "replies": []}, {"body": "Yay!  I love SO.  Great discussions and feedback on that site.", "score": 1, "replies": []}]}]}, {"body": "Ya, I’ve noticed it will mash up different programming languages and concepts. I write in a  functional language, and it will give something to me half in my language, and the other half in Various other object oriented syntax.\n\nPretty good at sql though.", "score": 1, "replies": [{"body": "The other kicker is that you cannot use it for company confidential stuff. Recently a bunch of Samsung guys got in hot water over this.", "score": 1, "replies": []}]}]}, {"body": "I’m also a senior developer and I honestly have no idea what tasks you’re doing that this makes simpler. The context of the codebase that you’re working in is important for most of the work whether it’s a bug fix, performance issue, or building a new feature into an existing app and chatgpt has none of that context. I can see it being helpful for writing quick scripts maybe but that’s the fastest part of the job anyways.", "score": 13, "replies": [{"body": "I had a chat with someone who claimed it was incredibly useful to them for part of their tech related job. Turns out they just didn't know very basic things and needed handholding to get through the simplest of tasks. I can kind of see it being useful if you need help with the simplest of coding problems.\n\nI can definitely see it becoming eventually advanced enough to help me with many many things and maybe even replace me in the distant (or not future). But right now it's too dumb.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I guess I've never had problems with finding API documentation, nor with boilerplate code.", "score": 1, "replies": []}]}]}]}, {"body": "Yeah, whatever. You can use it to set up boiler plate starting structure, or to find solutions to common problems, but it doesn't help with the actual challenging parts of software development.", "score": 4, "replies": []}]}, {"body": "I'm struggling to see why this is on this sub. Invest in MSFT? \n\nWhile GPT is an extremely useful tool, this also speaks to the news it's been receiving.", "score": 5, "replies": []}, {"body": "For me in engineering consulting it doesn’t really have an input yet. I mean the reports we write are based on what we see. We can only ask it to compare for example staircase measurements to one’s from the book but we realistically know the book ones by heart.\nAny monitoring of the investment we do is also based on things we see - maybe only one I can think of now would be comparison of paid and unpaid vats", "score": 2, "replies": []}, {"body": "That means I can use chatgpt to write my resume to match the chatgpt job description, right?", "score": 2, "replies": []}, {"body": "As someone who had to write my entire companies job descriptions, thank god", "score": 2, "replies": []}, {"body": "Any chance it’s actually putting an expected salary in those job descriptions?", "score": 2, "replies": [{"body": "If it did that HR would be completely safe.", "score": 1, "replies": []}]}, {"body": "The thing about this is … at one point in time, a human had to use original thought to come up with a hiring plan, inclusive of job descriptions that directly related to the needs of the business. \n\nThe original thought has been fed into AI, and now hiring managers can just be copy cats and just use job descriptions that might sound good but they won’t take the time to actually tailor it and make sure it makes sense. \n\nMy fear is that this will empower the lazy, people managers will get worse and overall job qualities and experiences will be poor quality as no one will have original thought or be able to drive ideas on their own.\n\nI’m not on board yet with the appeal of shortcuts. I’ve yet to see great examples of how this makes humans smarter, better, faster, stronger.", "score": 2, "replies": []}, {"body": "That’s because companies already wrote job descriptions and job requirements like idiots anyway. Jt couldn’t get worse so why not just automate it", "score": 2, "replies": []}, {"body": "Any now the number of shocked companies are growing as the realize their employees have passed internal code and IP over to Chatgtp.  Oops", "score": 2, "replies": []}, {"body": "programmers will turn into \"office managers\" who just put in prompts like people working in the factory doing the boring repetetive tasks. \n\nbosses will tighten the time budget with argument that with AI it should have been done already in 5 minutes.\n\nincredible. and bit later might be even 100% replaced.", "score": 2, "replies": []}, {"body": "Savings for companies > People making a living", "score": 2, "replies": [{"body": "I just keep buying VOO, what else can we do?", "score": 1, "replies": []}]}, {"body": "ChatGPT is low tier anything. It can't write very well, it can't code very well. We are nowhere near it doing anything. It is still human moderated.\n\nIt's an ok tool for now, that's it.", "score": 2, "replies": [{"body": "Are you speaking of GPT3 or 4? 4 is crazy powerful. I do so much with it.", "score": 2, "replies": []}]}, {"body": "AI gunna be the death of human creativity just watch", "score": 2, "replies": []}, {"body": "Chatgpt is so bad at almost everything this article makes me laugh. \n\nSaying it is AI is ridiculous.  \n\nIt's a data analyzer, and it's decent at that at best....", "score": 5, "replies": []}, {"body": "Rip non superspecizlied IT work.", "score": 5, "replies": []}, {"body": "Gonna be rough when AI takes over everyone's jobs including middle and upper management", "score": 3, "replies": []}, {"body": "Who did these people talk to? I work in tech, my team lead literally told everyone not to use GPT for anything, as far as I know a lot of big companies have done that.  Also in the article it states if you are 40-year-old you grew up with technology? what technology? there weren't smartphones nor were there and even interviews had to happen in person and mostly walk ins. Internet wasn't even widespread. People still used CDs in certain things.", "score": 3, "replies": [{"body": "I'm 49. Back in the day, setting the time on your VCR was apparently something only kids could figure out, much less programming it to record a show. I had an Atari computer when I was 9. My peers used BBS's in high school. I think I grew up with technology. \n\nBut I agree, this article is crap.", "score": 2, "replies": []}]}, {"body": "Having used chatGPT for both, it isn’t great at either. It’s a nice tool and interesting to see what it comes out with.", "score": 2, "replies": []}, {"body": "Guess you can't say \"time to learn how to code\" anymore.\n\nPhysical labor in the tech field is the only real thing that still needs a human touch.", "score": 2, "replies": [{"body": "It’s time to learn to write ChatGPT prompts", "score": 1, "replies": [{"body": "#LearnToPrompt", "score": 2, "replies": []}]}]}, {"body": "Gee sure am glad I'm going to school for CS. FML", "score": 2, "replies": []}, {"body": "Say if the majority of jobs are replaced, wouldn’t that make everyone poor and not able to purchase things from company’s with Ai?", "score": 1, "replies": [{"body": "Well in theory the people replaced will do uniquely people oriented tasks to service others.  AI still can't give massages, shine your shoes, be your personal chef, clean your home, etc.\n\nI just keep buying every dip in VOO.", "score": 1, "replies": []}]}, {"body": "And now you have thousands, tens of thousands out of or soon to be out of a job.", "score": 1, "replies": []}, {"body": "I don't know. I screwed with chat gpt for a few hours and wasn't overly impressed. So far, it just feels like Google.", "score": 1, "replies": [{"body": "What did you try to do with it?", "score": 1, "replies": [{"body": "Created a dungeon/grid wargame. It's a fun tool but not super impressed.", "score": 0, "replies": []}]}]}, {"body": "Shit just got real... \nNow that upper-ish class people are threatened, all this automation and wealth distribution might have to be looked at differently.\n\n/sarcastic failed-ish middle-to-working class person.", "score": 0, "replies": []}, {"body": "yawn", "score": 0, "replies": []}, {"body": "Can’t wait for AI to start taking white collar jobs.", "score": -6, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "It was kind of a cynical joke.", "score": 1, "replies": []}]}]}, {"body": "THE AMERICAN DREAM !", "score": 0, "replies": []}, {"body": "I’m excited to see how/If palantir steps on their toes.", "score": -20, "replies": [{"body": "Lmao leave it to people on this sub to shoehorn Palantir into absolutely every conversation they can", "score": 39, "replies": [{"body": "I tend to agree but this one makes sense to me", "score": -3, "replies": []}]}, {"body": "Doesn't Palantir require a lot of hardcoding to implement their software into their clients' systems? If so, what exactly is the AI part of their service?", "score": 14, "replies": [{"body": "Palantir is basically a professional services company masquerading as enterprise SaaS.", "score": 6, "replies": []}, {"body": "Latest press release:\n\nhttps://twitter.com/PalantirTech/status/1644428204239642625?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet", "score": -2, "replies": []}]}, {"body": "I'm excited to see how much your cost basis on PLTR is", "score": 2, "replies": []}]}, {"body": "Hi CNBC", "score": 1, "replies": []}, {"body": "I've found it to be incredibly useful for writing customized cover letters. \n\nPretty soon, the whole Recruiter vs Candidate interview process is gunna be done entirely by two AI's talking to each other.", "score": 1, "replies": []}, {"body": "Amazing article! And to think, my managers used ChatGPT to write a card for a retiring manager.", "score": 1, "replies": []}, {"body": "doesn't the company who owns chatgpt just start charging people to use it?", "score": 1, "replies": []}, {"body": "Here’s a scary thought: what if AI becomes your boss?", "score": 1, "replies": []}, {"body": "This was written on chatgpt wasn't it", "score": 1, "replies": []}, {"body": "Dumb shit like this is why the West is falling.", "score": 1, "replies": []}, {"body": "At least I'll finally have broken even on MSFT when I get laid off.", "score": 1, "replies": []}, {"body": "We finally did it...\n\nNothing is real.", "score": 1, "replies": []}, {"body": "“ChatGPT is already taking jobs from people” there I fixed the title", "score": 1, "replies": []}, {"body": "So Human Resources is about to be. Terminated.", "score": 1, "replies": []}, {"body": "Not to mention they are phenomenal at writing blog articles. The only time i see it being important to have a real blogwriter now is if the Blog article aren't purely for SEO.", "score": 1, "replies": []}, {"body": "It’s also writing me fake cover letter and resumes. Glad it’s working for everyone.", "score": 1, "replies": []}, {"body": "Recently there was a HR presentation on diversity company wide. With chat gpt I could have written it in 10 min. I’m sure it took 100 hrs of prep", "score": 1, "replies": []}, {"body": "Good for them,\n\nI already using ChatGPT for resume/cover letters.\n\n1) Get job description>keywords\n\n2) Sort/trim resume by words according to word closesness (Adjust till length is right)\n\n3) ChatGPT writes summary\n\n4) ChatGPT writes cover letter\n\nIf anyone complains about they get sent north, it really doesn't make sense not to do this.", "score": 1, "replies": []}, {"body": "May be time to tell coders to learn to journalism", "score": 1, "replies": []}]}
{"title": "YoY CPI is expected to drop to 5.2% for March from 6.0% for February, the lowest since May 2021.", "selftext": "[Consensus for March 2023 YoY CPI is expected to be 5.2%.](https://tradingeconomics.com/united-states/inflation-cpi) This shows a significant downtrend from the prior month reading of 6.0% and from the high of 9.1% in June 2022. [This would be the lowest YoY CPI reading since May 2021.](https://www.bls.gov/regions/mid-atlantic/data/consumerpriceindexhistorical_us_table.htm) Of course, the Fed favors core PCE but this is still a good sign for bulls since the markets still react heavily to CPI releases. March CPI numbers will be released this Wednesday, 4/12.", "id": "12fx3mg", "created_utc": 1680984875.0, "score": 334, "upvote_ratio": 0.92, "num_comments": 120, "comments": [{"body": "Minor correct OP but the 9% high was in June 2022", "score": 126, "replies": [{"body": "Whoops thx edited", "score": 39, "replies": []}]}, {"body": "Copy pasting my comment from another post, but to echo what the other comment said about YoY: \n\n> The Fed (and investors) doesn't really care about how bad inflation *has* been, they want it to be at 2% now (or at least in the near future). The damage is done, and pursuing deflation or below-target inflation *is not their mandate* even if it takes the longer run average [or year over year] to 2%. In fact, the costs of attempting to do would be immense, given how bad deflation caused by weakened demand can be for the economy. (Deflation induced by technological change is a positive, however) This will also likely violate their mandate of pursuing full employment.\n> \n> If the month over month inflation reports start being 2% annualized every single reading, this will be seen as a complete success by the Fed, no matter what happened in 2022. The average inflation being so high will be bad for the 'vibes' and the loss of [Edit] \\*real wealth, but it will not have future consequences if the Fed brings inflation down to its stable 2% level *going forward*.\n> \n> This is not me excusing high inflation in the past.\n\nInflation is the instantaneous rate of change of the price level; it's not the aggregate increase in the price level. The Fed wants the derivative of the price level* to be 2%.", "score": 49, "replies": [{"body": "I think you mean it will be bad for real wealth but nominal wealth will be fine?  There shouldn't be loss of nominal wealth if Fed tackles inflation slowly on a YoY basis.  If they tackle MoM slowly even more so I expect nominal wealth to increase faster than otherwise.\n\nAlso I say wealth specifically since thus far inflation has been excellent for the working poor.  Their real income has increased dramatically and they don't have much wealth so they probably don't care if it erodes.", "score": 2, "replies": [{"body": "Some data for anyone interested on how inflation, tight labor markets, post-pandemic stimulus, and other economic factors have impacted Americans:\n\n- [Wealth Change 2021 Q4 to 2022 Q4](https://i.imgur.com/CgBD15v.png)\n- [Wage growth](https://i.imgur.com/uyBYew0.png) beating inflation for lowest income classes\n- [Record prime age employment](https://i.imgur.com/2z9WD0R.png)\n- [Especially among Black Americans](https://i.imgur.com/0YxTRwY.png). And a [second chart](https://i.imgur.com/ej2Pxmj.png). And [unemployment rates](https://i.imgur.com/BauLPwl.png)\n- And among [the disabled](https://i.imgur.com/XaC4voE.png). And also record participation rates among Asians and women. [See Joseph Politano's Twitter account for more graphs]\n- [Workforce levels incredible reached January 2020 CBO projections of labor force](https://i.imgur.com/R4jeO70.png). [That's a WTF if I've ever seen one, this was pre-pandemic!]\n- [Prime-age labor force participation rates](https://i.imgur.com/vaEVa1o.png). [Slight difference to employment/population ratio] (\"it includes the numbers of people with a job as well as the number actively looking for work\")\n\nMy takeaway, as contrarian as it sounds, is that current economic conditions have disproportionately benefited working class Americans while penalizing the wealthiest who have their wealth tied up in stocks/real estate/bonds/etc. This is *not* to say everything is perfect in America. Just that the *relative* change has been positive and substantial for the lowest earning Americans. And the Fed's monetary policy will slow/reverse the gains, because it wants inflation to come down and tight labor markets aren't helping. \n\nE. Warren asked some very tough/unfair questions of Powell in the recent Congressional hearings, where she questioned why Powell is aiming to induce a recession that will take away jobs from working class Americans. While I think she was definitely trying to get some soundbites and inflation moderation is absolutely important, it does make me wonder whether demand-driven inflation in this labor market is *really* that bad for society. Obviously we don't want a 1% unemployment rate because that eventually becomes bad for the economy if firms really can't find qualified workers to produce more goods/services.", "score": 9, "replies": [{"body": "Yes minorities have disproportionately benefited and you could argue that's a great thing.\n\nIt hurts the middle 3 quintiles of income generally.  Probably the highest incomes like executives are fine as well.  We shouldn't worry too much about the top quintile.\n\nSo the only argument against inflation is that structurally it punishes lower middle class the most (2nd quintile).  They probably fought the hardest to get there and feel like they are being punished for deferring gratification and saving.  They have the same rising costs without the gains, they were \"responsible\" and now cannot ever buy the home they dreamed of.  Probably polarizes and destabilizes us more when inflation should be tackled supply side by our gov't and more taxes on the wealthy, rather than saving wealthy debt investors.\n\nBut yea, as an individual can't do shit about all despite being comfortable financially so I keep buying SPY lol.", "score": 5, "replies": []}, {"body": "> disproportionately benefited working class Americans\n\nLOL, so their wage gains have allegedly outpaced the reported CPI by two percent. If you live in the real world, energy, food and housing (the three things you need to live) have all increased double digits. Now with financing costing a lot more, who do you think that is disproportionality going to affect.\n\nThe graphs you also posted on wealth change are very misleading IMO. You paint a rosy picture when if you change the percentages to actual dollar amounts, poor people's wealth would have gone from $5 a person up to $6 a person. \n\nAdditionally, in my opinion, much of these \"gains\" were based on aid packages, stop-gap measures like student loan forgiveness, rent moratoriums, increased SNAP/EBT benefits and stimulus payments. Much of those programs have ended and many of the poor people who you think should be thankful, are now falling off a cliff with no end in sight.", "score": 2, "replies": []}, {"body": "Finally a based answer. The labor shortage is great for workers and terrible for companies.", "score": 1, "replies": []}]}, {"body": "Yes, correct thanks", "score": 1, "replies": []}]}]}, {"body": "YoY isn't that relevant currently as MoM hasn't gone over 0.5% since July. So it'll be much lower in a few months even if inflation starts spiraling out of control again. For example if the next 5 months average out to 6% annualized, YoY is still falling to 4.8% in August. MoM just needs to start consistently coming in under 0.3%.", "score": 117, "replies": [{"body": "I think MoM for housing is something like 0.6%. I think CPI for equivalent Rent has been 0.6% to 0.8% MoM for the past few months. An expectation of 0.7% MoM for the next 12 months calculates to 8.7% YoY. A lot of low income people spend half there money just to pay rent.", "score": 35, "replies": [{"body": "The housing component of CPI will cool off by June or so. Housing/ rent isn't going up by much and CPI has about a 12 month lag on it.", "score": 24, "replies": [{"body": "It's going to cool to like 0.3 from 0.6, and it makes up like 33% of core CPI, so it's net effect isn't gonna be much on the month over month", "score": 5, "replies": [{"body": "It doesn't need to cool much.. it's one of the few items propping up CPI. Housung should be going sub 0.3 later this year too.", "score": 4, "replies": [{"body": "No housing is estimated to go to 0.3% MoM by the end of this year. We just got 0.5% core CPI MoM and several months of 0.4% core CPI MoM. the subcomponents that have been decreasing from core CPI are projected to reverse and increase to core CPI, so the net effect of lower housing on CPI is most likely gonna be muted. This is evident in the Fed's projected core PCE by the end of the year increasing from 3.5 to 3.6, released 1 month ago.", "score": 3, "replies": []}]}]}]}, {"body": "Shelter is a lagging indicator in CPI. [The YoY Rate of Rent Increases have dropped over 50% from the peak in Feb 2022](https://en.macromicro.me/collections/5/us-price-relative/49740/us-cpi-rent-zillow-rent-yoy), but hasn't been reflected in CPI yet since it [lags by 12 months](https://www.cnbc.com/2022/11/14/heres-why-it-may-take-a-while-for-housing-inflation-to-cool-off.html).", "score": 12, "replies": []}, {"body": "Really confuse with Mom or Yoy., when I look around I am paying 350$ more in rent which will increase again when lease is up and I was buying vegetables arnd 1.49$ lb which is now 2.99$ per lb.. Gas price is again up close to 4$.  Not sure how numbers work..", "score": 1, "replies": [{"body": "No joke, show me something g decreasing in price month to month, cause it's nothing g on my shopping list...EVERYTHING jumping 5 to 10 percent per month last 3 years. Damn ice tea was 2.29 a gallon 9 months ago up from 1.99 6 months prior to now 3.29 today. everything", "score": 1, "replies": []}]}]}, {"body": "When 11 months are already known, MoM and YoY are the same thing. Everyone can do the same math. So while inflation could fall from, say, 6% to 4% in a single month, the market might not be happy unless it's 3.8%, for example.", "score": 7, "replies": []}]}, {"body": "The Cleveland Fed nowcast also forecasts 5.22% YOY inflation for March but...\n\nApril is forecasted *HIGHER* at 5.31%, probably factoring the recent large increase in oil prices from the OPEC cutbacks in production (but could also be other issues too).  For folks hoping we get a nice gradual slowdown in inflation rates I don't think that's a bullish sign even if we make the March forecast.", "score": 28, "replies": [{"body": "Yeah Cleveland revised the April number upwards after OPEC announced its production decrease. However core CPI is down trending in April according to prognosis and not every month has to show CPI is down as long as the mid term trend is still down. If March show 5,2 and april 5,3 as forecasted, it’s like inflation stayed flat.", "score": 2, "replies": []}, {"body": "These opec cuts never stick in the market more than a couple weeks. They’ve tried this like 5 times in the past year", "score": 2, "replies": [{"body": "Still a little early, but they may stick for long enough for April to be another January involving CPI, especially factoring in the fact that April last year was a weak CPI number.", "score": 3, "replies": [{"body": "It stalled out at 80 and it’ll be back in the mid 70s", "score": 1, "replies": [{"body": "Very possible, but it might not get back there in time for April MoM CPI to not be .4 or something like that (it's not for sure that the Cleveland website is going to be correct, but it can be close).\n\nCPI is fairly weird like that, you probably have less than 20 days left in the measurements for the month before it's over.", "score": 1, "replies": [{"body": "Gas prices haven’t risen yet. It’s shot up towards 80 a couple times", "score": 1, "replies": [{"body": "They've risen enough for the (although not exact) Cleveland website to be projecting .5 MoM for April CPI.", "score": 1, "replies": []}]}]}]}]}, {"body": "A lot of the apparent disinflation during the winter was due to steadily dropping fuel prices. Powell said as much, and correctly pointed out that we shouldn't expect inflation to keep falling so quickly when fuel prices stabilized/increased again.", "score": 2, "replies": []}]}, {"body": "That's because April was the one month last year that had 0.3% MoM inflation. It'll fall like a rock again in May (+1.0% MoM last year) and June (+1.3% MoM last year). If we get 0.3% MoM for the next three months, we'll be at 3.4% in the May reading. \n\nAnd then just wait until Rent/OER start actually reflecting real-world rent/housing prices. \n\nRent and OER are lagged components of CPI/PCE that will start to fall in the summer and back half of the year. Look up how they sample and reflect rent/price increases. If prices everywhere go up all at once they'll be slow to show it on the way up and slow to show it on the way down. \n\n  \nIf you replace how the Fed measures Rent and OER which together have a 33% weight in CPI and showed 8.8% and 8.0% YoY increases in February according to the BLS, respectively, with Redfin's Median Home Price (-1.2%) and Statista's Average Rent Prices (+2.1%), YoY inflation was actually 3.2% in February. Other sites like the one below also attempt to do this. We've had little to no inflation for the past six months by this measure. \n\n  \nThe Fed is still hiking because their stupid measurement methodologies are giving them a bad picture of what's actually going on in the real world. \n\nThere's a real chance we'll be at 2-3% by the end of the year. \n\n  \nhttps://www.infracapfunds.com/post/feb-data-update-infrastructure-capital-real-time-consumer-price-index-cpi-r", "score": 1, "replies": []}]}, {"body": "5.2% isn’t 2%. Rates stay and nothing changes", "score": 79, "replies": [{"body": "We won’t see 2% again for a long time.", "score": 38, "replies": [{"body": "Then we'll be at the current interest rates or HIGHER for a long time.", "score": 34, "replies": [{"body": "No… ? Current mortgage rates are 7.1% on average and the Fed funds rate is 5.0 with the prime rate at 8.0. When the fed funds rate is 2-3%, mortgages will be considerably lower (4-5%) than what we see today.\n\nNever mind, I see, you’re talking about core inflation which the fed will hold at 3% (if it can manage that magic). The Fed doesn’t intend to bring inflation down to 2%.. in fact, I’d assert it hasn’t been fighting inflation, it’s been fighting strong employment.\n\nWe will see minor rate cuts yet this year with more cuts in 2024 (in the fed rate). The issue is, every point of Fed fund rate cut is purchased with 2 million jobs.", "score": -19, "replies": [{"body": "RemindMe! 6 months\n\nHave there been rate cuts?", "score": 5, "replies": [{"body": "Yes, but only for big banks. Everyone else gets the normal consequences.", "score": 5, "replies": []}, {"body": "I will be messaging you in 6 months on [**2023-10-09 03:50:45 UTC**](http://www.wolframalpha.com/input/?i=2023-10-09%2003:50:45%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/12fx3mg/yoy_cpi_is_expected_to_drop_to_52_for_march_from/jfj4dzc/?context=3)\n\n[**3 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F12fx3mg%2Fyoy_cpi_is_expected_to_drop_to_52_for_march_from%2Fjfj4dzc%2F%5D%0A%0ARemindMe%21%202023-10-09%2003%3A50%3A45%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2012fx3mg)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}, {"body": "No. In fact, a couple of hikes still coming. First cuts in mid-2024 I’d guess at this point.", "score": 1, "replies": []}]}, {"body": "Do you work for CNBC?  At current projections which are as rosy as you suggest they will be (which is not what I object to) Jpow says NO rate cuts this year.", "score": 5, "replies": [{"body": "Markets dont believe him", "score": 1, "replies": [{"body": "Well that leaves two scenarios\n\nMarkets don't believe him and he cuts- things look great!\n\nMarkets don't believe him and he holds- correction city, except much steeper than if they did.", "score": 4, "replies": [{"body": "It's not that markets don't believe their won't be no rate cuts, it's that they don't believe he'll stick to his word. The Fed doesn't control the market: bonds lead and the Fed follows with a lag. \n\nIt doesn't really matter what the Fed says or what they think will happen cause it all depends on inflation during the rest of the year which is anyone's guess...", "score": 1, "replies": [{"body": "Bonds don't really lead shit considering bonds prices collapsed like 50% in 2022.", "score": 1, "replies": []}]}]}]}]}, {"body": "RemindMe! 6 months\r  \n\r  \nHave there been rate cuts?", "score": 1, "replies": []}, {"body": "Sooooo no rate cuts yet.", "score": 1, "replies": []}]}, {"body": "Won’t happen. Fed funds rate is above the 2 year.", "score": 0, "replies": []}, {"body": "Won’t happen. Fed funds rate is above the 2 year.", "score": 0, "replies": []}, {"body": "No very likely..", "score": -3, "replies": []}]}, {"body": "I don’t think ever. New normal will be 3% or 4%", "score": 1, "replies": [{"body": "Agreed. This is structural inflation emerging after 25 years of below 2 birth rates.", "score": 1, "replies": []}]}]}, {"body": "Thats not how it works but wr know 2% wont be hit any time soon", "score": 3, "replies": []}, {"body": "We'll have to be at 2% for a year for YoY to read 2%. But if we multiple months at 2%, I think the trajectory will be clear.", "score": 1, "replies": []}, {"body": "Based and true", "score": 1, "replies": []}]}, {"body": "Those who want the money printer back on are quick to write headlines that sound like inflation is well behind us. The MoM core inflation reading is probably the best single indicator to track right now to asses what inflation is actually doing. The consensus for March is 0.4%. For February, consensus was 0.4% and the result was 0.5%. We have had two outlier months (0.7%, 0.2%) in the past year, with every other reading between 0.3% and 0.6%. There is effectively zero trend and we are nowhere close to an annualized 2%.", "score": 64, "replies": [{"body": "i dunno why people think inflation will correct itself that fast", "score": 3, "replies": [{"body": "Because they watched Jeremy Semen on CNBC and Elon Musk retweeting him when he was screaming for the FED to stop raise rates 4 months ago.", "score": 2, "replies": []}]}, {"body": "Rent and OER are lagged components of CPI/PCE that will start to fall in the summer and back half of the year. Look up how they sample and reflect rent/price increases. If prices everywhere go up all at once they'll be slow to show it on the way up and slow to show it on the way down. \n\nIf you replace how the Fed measures Rent and OER which together have a 33% weight in CPI and showed 8.8% and 8.0% YoY increases in February according to the BLS, respectively, with Redfin's Median Home Price (-1.2%) and Statista's Average Rent Prices (+2.1%), YoY inflation was actually 3.2% in February. Other sites like the one below also attempt to do this. We've had little to no inflation for the past six months by this measure. \n\nThe Fed is still hiking because their stupid measurement methodologies are giving them a bad picture of what's actually going on in the real world. \n\nhttps://www.infracapfunds.com/post/feb-data-update-infrastructure-capital-real-time-consumer-price-index-cpi-r", "score": 2, "replies": []}, {"body": "It is behind us", "score": -29, "replies": [{"body": "But also in front of us", "score": 30, "replies": [{"body": "All around us, really.", "score": 13, "replies": [{"body": "It's a scale, really, with a perfect mission on one end and then a total pooch screw on the other end\n\n ^• ^True ^Lies", "score": 1, "replies": []}]}]}]}]}, {"body": "Green light to go all in on some Cathie Wood nightmare bundle of absolute trash!", "score": 17, "replies": [{"body": "*incompetent fund manager.  Fixed your user name for you /s", "score": 3, "replies": []}]}, {"body": "Should be priced at this point in but apparently is everything bullish so we rally either way.", "score": 11, "replies": []}, {"body": "Thanks", "score": 3, "replies": []}, {"body": "So prices will only be 5.2% higher from this time last year when it was 8% higher from the previous year when it was 5% higher from the previous year and so on. Seems like we are winning woohoo. /s \nFiat is a scam, change my mind.", "score": 4, "replies": [{"body": "That’s not correct", "score": 0, "replies": [{"body": "Ok then enlighten us. Why?", "score": 3, "replies": [{"body": "Inflation was 1.23% in 2020", "score": 0, "replies": [{"body": "Well yes i didnt googled the exact numbers like you, but my point is correct and u missed it", "score": 1, "replies": []}]}]}]}]}, {"body": "People don’t understand it’s 5% on top of last years inflation. So inflation keeps rising, just not as fast as before. Saying it dropped is misdirection.", "score": 12, "replies": [{"body": "yeah at some point inflation will slow down enough to 2% year over year, maybe.\n\nby that time, prices will be like 70% higher than precovid.\n\na decade of inflation pulled forward", "score": 3, "replies": []}, {"body": "Why do you think people don't understand that?\n\nIt's not a misdirection to say inflation is dropping. Your phrasing is incorrect - the inflation rate is not rising, it is indeed dropping; the prices are rising at a slower pace.", "score": 2, "replies": []}, {"body": "People do understand that, but they don’t care because that’s how inflation has always worked.", "score": 5, "replies": []}]}, {"body": "In before some guy says it’s all bs", "score": 2, "replies": []}, {"body": "If inflation continues to go down, if interest rates rise, if we go into recession, if there is another global financial crisis what good is there to come for regular people for the next 5 to 10 years?", "score": 2, "replies": []}, {"body": "Lower inflation = green light for bulls is an illusion imo\n\nWhy? We are at the peak in the cycle, not at the bottom.\n\nInflation cooling off, is just cause the fed (and any other CB's) are literally crashing the economies in an effort to bring it down. Is that bullish?\n\nIf you think the fed is gonna be there to save the party as soon as things are going downhill, you may be right, but at that point Im sure we are 20%+ down from where we are right now.\n\nHave a good day!\nBest redegenerates,\nthe dancing bear", "score": 2, "replies": []}, {"body": "Alexa, queue “The Bulls are Back in Town” by Thin Lizzy", "score": 5, "replies": []}, {"body": "So expectations are high? Sounds like another reason to not buy much right now.", "score": 3, "replies": []}, {"body": "we shouldn't get comfortable yet - but the market will. shortsightedness for the relief rally. pump the stock.", "score": 2, "replies": []}, {"body": "CPI is really a bogus number when you look at the way the fed calculates it.   Normally to figure inflation you would compare a standard basket of goods and see how much their price increases over time.   That's really hard to manipulate so the fed will do things like take a survey of people and ask if they feel their housing expenses have increased even if they are locked in at a fixed cost.   Then they massage those numbers,  and that's 30 percent of the \"CPI\" number.", "score": 3, "replies": [{"body": "> CPI is really a bogus number when you look at the way the fed calculates it.\n\nYou can’t question the auguries of economics, the birds have spoken!", "score": -1, "replies": []}]}, {"body": "But remember this is year over year. So last March inflation was already ticking up so having 5.2% inflation on top of what we had last year isn’t good news. Our dollars purchasing power is eroding at a rapid rate. Just keep an even keel.", "score": 1, "replies": []}, {"body": "fuck", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "CPI is over stating inflation recently.", "score": 1, "replies": [{"body": "Take my up vote because you are likely to get downvoted like I did because you aren’t parroting the narrative.", "score": -1, "replies": []}]}]}, {"body": "[deleted]", "score": -5, "replies": [{"body": "Why?  It’s been on the decline for 9 months.", "score": 11, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "What does that have to do with this post? This is literally just reporting on CPI.", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Oh it looks like a typo", "score": 3, "replies": []}]}, {"body": "Im ready for green. Been all in. Rode last year. Probably Q4 or just 2024.", "score": 2, "replies": []}]}]}]}, {"body": "Let me guess. Your data point is the price of eggs at your local supermarket", "score": 9, "replies": []}, {"body": "Lol that joke went real South", "score": 1, "replies": []}]}, {"body": "Pretty bulllish. Market going love this come Weds.", "score": -1, "replies": []}, {"body": "Expectations are to hight", "score": -1, "replies": []}, {"body": "Super bullish fam", "score": -1, "replies": []}, {"body": "Only way to get down to 4, 3 or 2% is a massive stock sell off which is about to happen.  Burry....", "score": -4, "replies": [{"body": "How do stocks impact inflation?", "score": 3, "replies": [{"body": "People have less net worth, spend less and prices must come down.", "score": -4, "replies": [{"body": "This would affect what proportion of spending of an average consumer?", "score": 1, "replies": [{"body": "Could completely shut spending down for most people who are already a few thousand from broke as it is.  Beans and rice only.  Eventually stocks will capitulate to Powell and then we'll have the 2% target he wanted.  But 2% from where we are at is still very expensive.  So things can really crash imo.", "score": 0, "replies": [{"body": "You really overestimate the effect high (or low) stock prices have on inflation..", "score": 2, "replies": [{"body": "Remember the peak of 2021?  That caused nearly 10% inflation numbers.  Now we are at like 5%, after the pull back.  Maybe you're right though but it seems to correlate.", "score": 1, "replies": [{"body": "The only correlation is that historically stock prices grow faster when inflation is high. \n\nAnd yeah inflation in the money supply will likely result in both higher prices in assets and goods and services.\n\n> though but it seems to correlate.\n\nNot something you can infer from a single datapoint", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Markets rally and then the reality sets in with what earnings or going to look like moving forward.", "score": 1, "replies": []}, {"body": "Didn’t they change the look back from 2 to 1 year though?", "score": 1, "replies": []}, {"body": "Lots of good year over year comps for the next 4 months. But beware after.", "score": 1, "replies": []}, {"body": "Gas prices are already going up. It's going to take more deflating.", "score": 1, "replies": []}, {"body": "The recent uptrend in some tech stocks is disturbing.", "score": 1, "replies": []}, {"body": "Hmm", "score": 1, "replies": [{"body": "Remindme! 4 days \"check\"", "score": 1, "replies": []}]}, {"body": "With oil back up 16 percent? Doubt.", "score": 1, "replies": []}, {"body": "So buy calls", "score": 1, "replies": []}, {"body": "Even with fuel going straight back up?", "score": 1, "replies": []}, {"body": "The Fed is trying to slow inflation down to 2%, this isn’t saying they are trying to reverse it, just trying to stop the YoY growth of inflation. They are not going for deflation. Just wanted to point that out to all the people saying “inflation is here to stay” against the 2% argument. Yes you are right, and no the Fed isn’t trying to reverse inflation, just slowing it to 2%.\n\nThat being said, a 5% inflation on last years already high inflation is not bullish. Will markets react bullish if inflation comes in better than expected? Yes. Will the fed hold or cut? Probably not, expect another .25 this year.", "score": 1, "replies": []}, {"body": "lower cpi isn't good for bulls", "score": 1, "replies": []}, {"body": "Watch it’ll be amazing CPI , but Taiwan and china are just going to fuck the whole market over", "score": 1, "replies": []}, {"body": "Does cpi even matter anymore after the fed said they will not cut this year no matter what? Banks are failing and they still hiking", "score": 1, "replies": []}]}
{"title": "Apple offloading to bag holders", "selftext": "", "id": "12fpkil", "created_utc": 1680968262.0, "score": 269, "upvote_ratio": 0.89, "num_comments": 108, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|2 years ago\n**Total Comments**|92|**Previous Best DD**|\n**Account Age**|8 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Most of them live in California. They probably just needed to make rent this month.", "score": 335, "replies": [{"body": "It’s 2023. It’s probably just for a car payment", "score": 85, "replies": [{"body": "It’s probably so they can buy ramen noodles for dinner.", "score": 28, "replies": [{"body": "Nah, definitely so they can put air in their bike tires.", "score": 10, "replies": []}, {"body": "Dry ramen noodles!! Such a white thing to do..", "score": -10, "replies": [{"body": "Do they not do that in Korea?", "score": 3, "replies": []}]}]}, {"body": "I rolled through a Mitsubishi dealership the other day, just to see where car prices are sitting. What Mitsubishi is charging for their shitty cars was ridiculous. There's no way this bubble doesn't pop.", "score": 15, "replies": []}, {"body": "Used car payment…", "score": 4, "replies": []}, {"body": "These are scheduled sells of shares. Christ people.", "score": 0, "replies": []}]}, {"body": "they need to pay reparations /s", "score": 6, "replies": []}, {"body": "Also to put an iron fence and snake infested moat around it to keep the homeless from taking a dump of their driveway.", "score": 3, "replies": []}, {"body": "They’d OWN a house, probably even higher value, if they lived in literally any other state 😂", "score": 2, "replies": []}, {"body": "Has to be for eggs", "score": 1, "replies": []}]}, {"body": "The company that’s literally bought back $200B in shares is making buyers bag-holders by execs selling <$200mm?", "score": 162, "replies": [{"body": "Yeah aapl isn't about to drop significantly in price due to this. This is literally like taking a cup of water from a lake", "score": 57, "replies": [{"body": "But this is a Californian lake", "score": 3, "replies": []}]}, {"body": "Not a bad idea.  Juice the price by using company funds to buy stock just to sell your shares", "score": 10, "replies": []}, {"body": "Hey fellow masshole, remember when bill galvin wouldn’t let mass residents invest in apple’s IPO due to its risky nature. ahh good times.", "score": 6, "replies": [{"body": "Uncle Bill.", "score": 3, "replies": []}]}, {"body": "Bag holder confirmed \\^\\^\\^", "score": -16, "replies": [{"body": "Bag holding since $1.33 - it’s worked out alright", "score": 29, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Post Positions grandpa", "score": 3, "replies": []}]}, {"body": "God damn grandpa save some for the rest of us", "score": 2, "replies": []}, {"body": "[https://tenor.com/oMhw.gif](https://tenor.com/oMhw.gif)", "score": -4, "replies": []}]}]}, {"body": "But a fraction of the monster that is Tim Apple's army.", "score": 1, "replies": []}]}, {"body": "But Nancy bought more 🤔", "score": 55, "replies": [{"body": "I mean, she lost pretty badly on the NVDA play people were worshipped her for. She was a number of months early. Buying tech at an all-time high is exactly the type of “special” acumen WSB puts on a pedestal.", "score": 22, "replies": [{"body": "NVDA was just cracked out though. Who would of seen it running all the way back to ATH within like 3 months.", "score": 5, "replies": [{"body": "Not a single person. They might have expected a slight rally, but that pump because “AI” was one of the most illogical runups I’ve ever seen in my life, especially given how fucked the macro and fundamentals are.", "score": 5, "replies": []}, {"body": "I saw it. 👀", "score": 1, "replies": []}]}, {"body": "Lol she can't win every trade. She has to show semblance of \"fair\" trading", "score": 2, "replies": [{"body": "Why can’t she win every trade? She’s in the club of oligarchs and elites. So long as she doesn’t screw over someone more influential or wealthier than her, she’s fine. As long as she continues doing what she’s bribed to do, the legal or judicial apparatus won’t bray for her blood.", "score": 2, "replies": [{"body": "She has to lose a few to pretend shes not cheating", "score": 1, "replies": []}]}]}]}, {"body": "Source? I'm curious", "score": 7, "replies": [{"body": "The house clerk published congress members’ stock trades, just look it up", "score": 16, "replies": []}]}, {"body": "I think it's so she can say \"whoopsies see I make mistakes too!!!\" And then just claim the losses to offset taxes anyways.", "score": 5, "replies": [{"body": "Nancy is the best trader of all time. Check her portfolio.", "score": 9, "replies": [{"body": "That's my point, people are starting to catch on to her. Take a few L's here and there and suddenly you can argue that since you had significant losses that you aren't insider trading but just \"really really good at it\" lmao \n\n\nThen she can claim tax losses as well, while giving herself an alibi", "score": 5, "replies": []}]}]}, {"body": "Yea, but at a low basis so she prop selling calls at this point to generate income", "score": 1, "replies": []}]}, {"body": "How many times do we need to remind folks that these are regular, scheduled sales of shares per SEC Rule 10b5-1. The timing is pure luck on their part.", "score": 87, "replies": [{"body": "Exactly, and sometimes management does this to diversify their holdings as they are not highly regarded. Awards in your company are part of your total compensation and you continue to receive more each year.  Most executives regularly cash in awards when they vest to diversify their risk instead of being 100% in their company or use it for degenerate habits.", "score": 12, "replies": [{"body": "When I was an intern, I got to attend an event where we heard the CFO speak and got to ask questions afterwards. \n\nOne of my dumbass intern colleagues asked our CFO what individual stocks she invested in besides our company stock. \n\nOur CFO’s response was essentially, “I’m the CFO of a major company, not a professional stock trader or investment manager. I hold diversified index funds. I sell my stock compensation and put it into low fee ETFs. The fuck you think I do for a living?”", "score": 9, "replies": []}]}, {"body": "For that matter, several of the sales are just RSUs as they vest. Nothing remotely suspicious.", "score": 20, "replies": []}, {"body": "Except that the CFO and COO seem to be cashing out", "score": -1, "replies": []}, {"body": "A regularly scheduled sale of nearly $43 million by the COO? He buys a new yacht every month?", "score": -2, "replies": []}, {"body": "Plus it’s almost the tax deadline", "score": 1, "replies": []}, {"body": "You’re not being fun", "score": 1, "replies": []}]}, {"body": "Only here would someone thinking insiders taking profits near ATH is bearish.", "score": 49, "replies": [{"body": "It’s definitely not bullish but we’ll see who’s right in a few months LOL", "score": 7, "replies": [{"body": "Hint: it’s not anyone on this sub.", "score": 1, "replies": []}]}, {"body": "What you said makes complete sense yet somehow I feel regarded now. Shit, am I really one of you guys now?", "score": 4, "replies": []}]}, {"body": "bullish ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 9, "replies": []}, {"body": "if AAPL drops i’m buying more", "score": 13, "replies": []}, {"body": "I will buy at $120 level.", "score": 7, "replies": [{"body": "As you should.", "score": 3, "replies": []}]}, {"body": "LMAO COO making bank this year", "score": 7, "replies": []}, {"body": "bullish", "score": 8, "replies": []}, {"body": "Could you imagine going to work every day at a company and low-key making $15 million a month?", "score": 3, "replies": []}, {"body": "Buffet didn’t think $140 was a bad deal", "score": 3, "replies": []}, {"body": "Weak Paper hands.", "score": 7, "replies": []}, {"body": "They know whats coming and need a nice little  personal financial cushion for the turbulent times currently and ahead.", "score": 2, "replies": []}, {"body": "Fed board was did this years ago at the peak.\n\nNacy is one of the greatest traders of our time.\n\nFaiR MArkEtS", "score": 4, "replies": [{"body": "Oh how soon they forget… They all had timed the top PERFECTLY that time.", "score": 2, "replies": []}]}, {"body": "The amount of money these guys make is ridiculous. Where did you get this report ? It is a sign to dump the stock honestly. They are exercising for a reason.", "score": -2, "replies": [{"body": " When a sub is so used to losses, it panics if people take a profit. lol", "score": 1, "replies": [{"body": "I don’t carry the stock for starters, and inside trading is a clue. Lots of strategies are based on following inside trading. Read about it before you sound off", "score": 0, "replies": [{"body": "56k of 3.3 million. Dump stock, ok.", "score": 1, "replies": [{"body": "What’s wrong with you? I said it is a sign. I am not saying you have to quit your position. If your strategy is for long term why not?", "score": 1, "replies": [{"body": ">It is a sign to dump the stock honestly.\n\n. .................................![img](emote|t5_2th52|27189)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Wow, it looks like you're doing really well for yourself! You must be super rich and intelligent!", "score": -6, "replies": [{"body": "Time to replace this bot Mod with ChatGPT.", "score": 11, "replies": [{"body": "I disagree. I think vis mod is the bot this sub deserves. And furthermore, one of the more interesting posters to this highly regarded sub. Tits", "score": 3, "replies": []}]}]}, {"body": "This just backs up exactly what I said when apple wa a distraction and pelosi is pumping retail a bag and that her luxury hotel play is where the real money is", "score": -2, "replies": []}, {"body": "My boy Maestri literally dimed the top in August", "score": 1, "replies": []}, {"body": "Hold deez bags mf", "score": 1, "replies": []}, {"body": "Life ain't fair why doesn't Timothy and Chris get to double dip multiple times like everybody else?! ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Own 3.3 mil of something. Sell 56k of them and some people wig out.", "score": 1, "replies": []}, {"body": "Ha, this is great. Retail bag holders lining up to take every share too.", "score": 1, "replies": []}, {"body": "Smart, unload at all time and p/e is to the moon", "score": 1, "replies": []}, {"body": "Horrible take.", "score": 1, "replies": []}, {"body": "Not super meaningful on its own. Need to compare to activity the last few quarters. \n\nSome of this could be predetermined selling from 10b5-1 plans.", "score": 1, "replies": []}, {"body": "This is some poor analysis", "score": 1, "replies": []}, {"body": "Aapl execs dumping on Retail lol", "score": 1, "replies": []}, {"body": "Not a good look when the CFO and COO are dumping shares like this, CFO knows what’s up.", "score": 1, "replies": []}, {"body": "Just got more reusable bags from the grocery store. Please load me up more papa Cook!", "score": 1, "replies": []}, {"body": "This has to be bullish somehow\n\nIt’s just 1/6 of COO‘s shares, he could‘ve sold everything! WHAT YOU SAY NOW BERS", "score": 1, "replies": []}, {"body": "This is from March to November. I suppose according to market cap, this is nothing…", "score": 1, "replies": []}, {"body": "These people are trading through a 10b51 plan. These sales are pre-determined, they’re not allowed to trade like non-insiders.", "score": 1, "replies": []}, {"body": "Shares total is what they have left?", "score": 1, "replies": []}, {"body": "They literally have to sell stock to get paid….", "score": 1, "replies": []}, {"body": "Judging by most of the dates, it falls in line with vesting schedule for these execs. Nothing suspicious about this unless you extra regarded and you can read between the lines.", "score": 1, "replies": []}, {"body": "Total bs. It’s normal to less some of their shred for taxes.  Tell me Tim Cook with 3 million shares is offloading 56,000 to bag holder and I’ll give you a mirror so you can see a negative fool.", "score": 1, "replies": []}, {"body": "Their bonus schedule was changed so perhaps they needed to cover some costs they thought the bonus would cover....?", "score": 1, "replies": []}, {"body": "And that’s over a year total bs and attempted manipulation by the originator of the bs commentary", "score": 1, "replies": []}, {"body": "Old Warren Buffet must be a bag holder as well….😜", "score": 1, "replies": []}, {"body": "AAPL 200 confirmed", "score": 1, "replies": []}, {"body": "Executives regularly sell their share, the most important piece of information missing here is their total holdings.", "score": 1, "replies": [{"body": "It’s here", "score": 1, "replies": []}]}]}
{"title": "NVDA in Shambles", "selftext": "Similar to tech stocks such as AAPL, MSFT, etc, NVDA is also reaching its long-awaited resistance zone around $277 - $280 and the last time this occurred was in November of 2021 before it faced a 3-month massacre.  \n\n\nWith earnings in about a month and a half, we more than likely will see either a small double top and/or retest before slowly seeing it drift off into a short-term bearish habitat. From there, it will be in the hands of Jensen Huang to showcase the performance of his company on May 24th.\n\n[$NVDA 4h timeframe | yellow box depicts a common support\\/resistance region](https://preview.redd.it/0gp3y61flpsa1.png?width=3210&format=png&auto=webp&s=894be47ebe8d65a238f9ebeb5e0ec0d580a9fa81)", "id": "12fvejs", "created_utc": 1680981026.0, "score": 230, "upvote_ratio": 0.79, "num_comments": 277, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|21 hours ago\n**Total Comments**|3|**Previous Best DD**|\n**Account Age**|1 day|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": [{"body": "CALLS!!!!", "score": 0, "replies": []}]}, {"body": "What about the other lower peaks? You just draw whatever fits you?", "score": 288, "replies": [{"body": "Are you new hear? TA is just lines to support your feelings. It’s nonsense.", "score": 174, "replies": [{"body": "I have strong feelings toward T and A", "score": 40, "replies": [{"body": "I think I’m more of an A man", "score": 12, "replies": [{"body": "How you gonna fit all that A inside dem jeans?", "score": 10, "replies": []}]}, {"body": "You mean T&A matinee?", "score": 2, "replies": []}, {"body": "ATT calls?", "score": 1, "replies": []}, {"body": "T & E", "score": 1, "replies": []}]}, {"body": "Numbness to the lose and numbness to gain", "score": 4, "replies": [{"body": "I want to feel again.", "score": 1, "replies": []}]}, {"body": "I'm a gemini, we don't believe in TA", "score": 6, "replies": [{"body": "Outta here caprisun", "score": 1, "replies": []}]}, {"body": "Grammars ☝🏽", "score": 2, "replies": [{"body": "Fuuuuuuck.", "score": 3, "replies": [{"body": "✌🏽", "score": 1, "replies": []}]}]}, {"body": "it's numerology", "score": 1, "replies": []}, {"body": "Engineering logic still applies. Triangles for the win.", "score": 1, "replies": []}, {"body": "It’s astrology for traders", "score": 1, "replies": []}, {"body": "*here", "score": 1, "replies": [{"body": "Yeah I know someone else points that out but I’ll own the fuck up.", "score": 1, "replies": []}]}]}, {"body": "Fintwit bear technical analysis summarized", "score": 59, "replies": []}, {"body": "And anyone can draw a line connecting 2 points, it needs 3 to be significative... not that it wont go down, but this graph is shit", "score": 18, "replies": [{"body": "\"Significative\"", "score": 10, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|27189)", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}]}, {"body": "what else you think TA is?", "score": 9, "replies": []}, {"body": "Isnt that just all TA? They see what they wanna see lol", "score": 6, "replies": [{"body": "1 cent above resistance: price will go up\n\n1 cent below resistance: price will go down", "score": 6, "replies": []}]}, {"body": "Yes", "score": 4, "replies": []}, {"body": "If you notice that is the most current time. You’re basing your current trades off historical prices 10 years ago?\n\n\nDo what you want, some people certainly do.", "score": 2, "replies": [{"body": "You're supposed to use two historic points (where price rejection has already been demonstrated) to extrapolate a trend line to predict future inflection points. You shouldn't use the current price as your 2nd point cuz it will always be at the peak, cuz....you know....you're extending it directly from your 1st point and the uptrend could continue for a while and it'll just be a moving goal post.", "score": 6, "replies": [{"body": "There is no right answer when you're analyzing the behavior of the crowd.  You don't know that anyone else agrees to these points and rules.  You can draw lines whenever you like but you're guessing at what other people will see and then guessing how they will bet.", "score": 1, "replies": [{"body": "But there is.  You cannot call something a peak until it's proven to be a peak. The current price could still run up another 200 points for all we know. The top trend line for a price channel is drawn between two peaks, not just any random two points.", "score": 2, "replies": []}]}]}]}, {"body": "This is TA, what do you expect?", "score": 1, "replies": []}, {"body": "He is just drawing the prettiest slopes", "score": 1, "replies": []}, {"body": "Welcome to TA!!!", "score": 1, "replies": []}, {"body": "OP has the word “trades” in his name. Guaranteed poor", "score": 1, "replies": []}, {"body": "technical analysis its plain bullshit", "score": 1, "replies": []}, {"body": "He literally draw a line between the ATH and the top from a couple days ago an call it “resistance”… FFS…", "score": 1, "replies": []}]}, {"body": "I’m ready to get hurt again.", "score": 141, "replies": [{"body": "AI’ll be back 😎", "score": 21, "replies": [{"body": "Terminator, I barely know’er.", "score": 11, "replies": [{"body": "Boom, still got it.", "score": -1, "replies": []}]}, {"body": "I see what you did there", "score": 2, "replies": [{"body": "I saw nothing.", "score": 3, "replies": [{"body": "\\*shakes fist\\*\n\nSchultz!", "score": 1, "replies": []}]}]}, {"body": "This made me angry laugh", "score": 2, "replies": []}]}, {"body": "relax...dude just drew a straight line connecting 2 points", "score": 7, "replies": [{"body": "That’s a 100% more points that the average ape uses for their TA and line drawing.", "score": 4, "replies": []}]}, {"body": "WHAT IS LOVE?!", "score": 1, "replies": [{"body": "baby don't hurt me", "score": 1, "replies": []}]}, {"body": "prepare the lube", "score": 1, "replies": []}]}, {"body": "This account is one day old and just shitting on NVDA AAPL and robinhood. Okay yeah I’m gonna blindly follow this guy!", "score": 35, "replies": []}, {"body": ">It is certainly possible that NVDA will retest its previous highs before earnings, but it is also worth noting that the stock has been in a bit of a consolidation phase recently. If Jensen Huang delivers strong results on May 24th, we could see the stock breakout to new all-time highs.", "score": 96, "replies": [{"body": "I trust VisualMod more than you crayon eaters. He's rich and successful 😃 NVDA calls to the moon 🚀 new ATH incoming....", "score": 65, "replies": [{"body": "Praise our Au Overlords.  A computer never lies", "score": 3, "replies": []}, {"body": "I have no clue about lines on charts, but I firmly believe DPU's will change modern computing significantly, and nVidia will have a large role in the DPU market.", "score": 7, "replies": [{"body": "Yeah analyzing charts is fine but it misses a lot of important information. You need to knoe more about w company to predict long term trends", "score": 3, "replies": [{"body": "Yep, technicals are only a guide. If that was the only thing we cared about I would agree. But shit's been crazy last few weeks in AI - and a lot of people still don't grasp the implications.\n\nEnd of the day what matters is what a company make / provide, and how badly people want it. And my opinion is that H100 will be a golden goose.", "score": 4, "replies": []}]}]}, {"body": "This I agree with, they have too many good things in the works that are being completed and will be completed… 2 months ago it was obvious that NVDA would reach 320$ by June..", "score": 2, "replies": []}]}, {"body": "![img](emote|t5_2th52|4267)", "score": 11, "replies": []}, {"body": "I just had my first AI-assisted orgasm", "score": 15, "replies": []}, {"body": "Wow the bot actually delivers value\n\nFuture is dark", "score": 1, "replies": []}]}, {"body": "He will say AI a few times and the stock will reach new ATHs in no time...", "score": 29, "replies": []}, {"body": "I think the safest short on NVDA is the day before earnings. Would be consistent with other chip stock pre-earning behavior for the stock to sell off the day before earnings. Buy puts two days before, and GTFO before earnings are actually released.", "score": 22, "replies": [{"body": "All in on calls before earnings it is!", "score": 12, "replies": []}, {"body": "There is no safe short on NVDA. It’s the fucking widow maker for shorts, just zoom out 10 years on it 😂\n\nKinda like TSLA but it’s been doing this shit for many many more years.", "score": 4, "replies": [{"body": "ya'll americans?!", "score": 0, "replies": [{"body": "Maybe…", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}]}]}, {"body": "That’s crazy talk.. the percentage of people who believe NVDA won’t have a phenomenal earnings are minuscule… you better know something no one else does to bet against the wave, like the next pandemic that’s worse than the last!", "score": 1, "replies": [{"body": "Lol, ok\n\nIf people want to buy into earnings at 130+ p/e, more power to them. However, those who bought at 70 p/e will likelywant to hedge their bets against a reactionary, temporary selloff.", "score": 1, "replies": []}]}, {"body": "Please remember that it doesn't have to be NVIDIA's earnings. Once 1 company related to this field gets bad earnings report then NVIDIA tanks", "score": 1, "replies": [{"body": "True. INTC's been on an AI tear recently, with disappointing earnings on deck for end of April. Curious to see how NVDA reacts.", "score": 2, "replies": []}]}, {"body": "Haven't you seen $MU and Samsung earnings. It's going to the Moon!", "score": 1, "replies": []}]}, {"body": "Your top trendline only touches two points. That's not a strong trend. Nvda could be $50 higher and you can draw the same line on two points and call it the resistance", "score": 32, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 7, "replies": []}]}, {"body": "It’s been pumping. Time for the dump", "score": 28, "replies": [{"body": "The dump won’t happen until September, but that will only be for a month and after it’s reached its ATH.", "score": 1, "replies": []}]}, {"body": "As long as SPY and QQQ are holding up Nvidia will. But considering Apple is near ATH and stocks like Microsoft pumping like crazy lately it could end any day now. A pullback is overdue. If 260 breaks it will be a downfall like in April 2022 imo\n\nHype‘s already fading. You can see it since QQQ pumps more than Nvidia lately. And if it‘s red Nvidia is way more red", "score": 24, "replies": [{"body": "Hope there’s a bit of head room left for Apple because I’ve got a limit sell order for 100 shares at €160 open", "score": -6, "replies": [{"body": "Sucks to be you, I just moved my limit to 175.90", "score": 6, "replies": [{"body": "Dude I set it in euro and just converted the amount to dollars for y’all Americans. It’s an even €160.", "score": 1, "replies": [{"body": "ya'll Americans?!", "score": 1, "replies": [{"body": "Most here seem to be American, so I posted converted dollars instead of just euro", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 2, "replies": []}, {"body": "And if they aren’t they still use the $$$USD", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It already hit 260 like a week ago then bounced up to 280. But I do see some weakness in the charts.", "score": 1, "replies": []}]}, {"body": "Something something dark side... er I mean AI", "score": 7, "replies": []}, {"body": "!remind me 1 month", "score": 8, "replies": [{"body": "I will be messaging you in 1 month on [**2023-05-08 20:28:18 UTC**](http://www.wolframalpha.com/input/?i=2023-05-08%2020:28:18%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/12fvejs/nvda_in_shambles/jfhl4vv/?context=3)\n\n[**12 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F12fvejs%2Fnvda_in_shambles%2Fjfhl4vv%2F%5D%0A%0ARemindMe%21%202023-05-08%2020%3A28%3A18%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2012fvejs)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 3, "replies": []}, {"body": "!remind me 1 month", "score": 1, "replies": []}]}, {"body": "Classic pump and dump stock", "score": 56, "replies": [{"body": "No bro no bro! It’s the future! Stocks only go up!!", "score": 13, "replies": [{"body": "The bigger the party, the bigger the scam", "score": 8, "replies": []}]}, {"body": "Yep Nvidia is a pump and dump scam, ya heard it here. smh.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "gross ;)", "score": 1, "replies": []}]}]}, {"body": "Lemme tell you a story. In 2017, i was broke but i did open a play trading account with my bank. I bought NVDA, among other tech stocks. I made a killing in monopoly money, but kicked myself in the nuts for missing out irl. This time around I got in for real when NVDA dumped earlier this year. You know what? I ain’t leaving.", "score": 7, "replies": [{"body": "At what price do you plan to leave again?", "score": 1, "replies": [{"body": "Leaving is not in my vocabulary. I’m a strong believer that the current wave of generative AI is the biggest invention since the internet and will transform the economy. NVDA is the gold standard in AI hardware, so I believe they are poised for great things.", "score": 2, "replies": [{"body": "Yes, I agree with you. nvda is a very promising stock, but I think the price is a bit high right now.", "score": 1, "replies": []}]}]}]}, {"body": "I want it to dip below 200", "score": 5, "replies": [{"body": "Funny that, no one wanted to touch Nvidia when it was 120", "score": 12, "replies": [{"body": "No one on WSB will ever be that far ahead of the pack", "score": 3, "replies": []}]}, {"body": "Yes please discount sale thank god", "score": 1, "replies": []}]}, {"body": "I find it hilarious when people just take the two highest points, connect them, and call it a trend line. Especially when the second point is actively changing and not even a point of significance yet", "score": 6, "replies": []}, {"body": "Chart monkeys gonna chart. I wouldn’t bet against Nvda bro  they are a disruptor. Try something that is going in the other direction ie outdated, dying tech", "score": 23, "replies": [{"body": "This sounds exactly like the other trillion takes on NVDA out there. You know what happens to consensus trades?", "score": 3, "replies": [{"body": "No bogdan. Just no. Now go shave your eyebrows", "score": 1, "replies": [{"body": "“AI will disrupt the future of work and NVDA will dominate the market for AI chips”\n\nSounds familiar?", "score": 1, "replies": [{"body": "Bogdan say my name", "score": 1, "replies": [{"body": "willy wonka?", "score": 1, "replies": [{"body": "You’re god damn right. 🥁", "score": 1, "replies": [{"body": "don't cum brother", "score": 2, "replies": [{"body": "I’m\nThe one who knocks", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "They're certainly not a disruptor. They've been around for decades refing and improving their product; they're mature.\n\nWhat waits to be seen is if AI can take over all those lost crypto miner sales.\n\nThey have a great product, but computer parts are ultimately just commodity products. Intel, AMD, and others are always looking for ways to undercut Nvidia on pricing and to beat their product.\n\nIntel has had slumps. AMD has had slumps. Nvidia has had slumps. It's an arms race.", "score": -1, "replies": [{"body": "Couldn’t disagree with you more. You need to study up on the amount of disruption taking place in that space. Yes, it’s AI but ultimately they have many markets to disrupt. Automotive, healthcare, automation, quantum computing , the list goes on and on. The amount of runway in front of Nvidia is insane. I know they’ve been around for decades but they have redefined themselves and committed to disruption in the past 10 years.", "score": 14, "replies": [{"body": "For automotive, they sell arm chips that run tablets and sensors. Cool, but ultimately a commodity product with lots of competition in the space.\n\nI'm not aware of any quantum computing product that isn't vaporware or academic experimentation.\n\nAnd the rest? Frankly, these are just chips they stick in machines. The minute they get too expensive, manufacturers will happily swap them out for cheap Taiwanese SoCs.\n\nI think they have room to grow because ultimately everything is computerized nowadays. I'm just not sure they have room to 10x at their scale in such a crowded marketplace.", "score": 1, "replies": [{"body": "Nvidia has been working on this shit for the last decade while the competition lagged. It’s almost as if they had to wait for the world to catch up. We’ll see how the next 5 years go", "score": -2, "replies": []}]}]}]}]}, {"body": "You TA cucks know that everyone else sees these exact same charts right? So based on this chart I expect NVDA to rip upwards 20% in the next week", "score": 3, "replies": []}, {"body": "Aaaand here comes new ATH!", "score": 5, "replies": []}, {"body": "Unless you are aware of another pandemic around the corner, NVDA is a diversified technology company directly involved in numerous profit making markets.", "score": 4, "replies": []}, {"body": "I’m in with September 260 P", "score": 10, "replies": [{"body": "Calls it is!! WSB sentiment for weeks is that NVDA will tank. Must mean there's far more upside to be had!!", "score": 10, "replies": [{"body": "It’s been months actually", "score": 5, "replies": [{"body": "Apologies!! I wondered what could explain the 25% increase during the past few months and now I know..\nNVDA to $300 seems a reasonable shout!", "score": 1, "replies": []}]}, {"body": "Go for September calls 260. Those will print since all of wsb says otherwise.", "score": 2, "replies": [{"body": "Theta gang jerking it in the corner", "score": 2, "replies": []}]}]}, {"body": "Thetagang thanks you for your service", "score": 4, "replies": []}, {"body": "That should print big", "score": 3, "replies": []}, {"body": "What's your stop loss? If nvda goes higher where should we exit the puts?", "score": 0, "replies": [{"body": "I’ll just average down", "score": 0, "replies": [{"body": "Whats the next price you'll average down?", "score": 1, "replies": [{"body": "300", "score": 2, "replies": []}]}]}]}, {"body": "Jan 2024 @240 P", "score": 0, "replies": []}]}, {"body": "AI will kill puts once again ![img](emote|t5_2th52|4260)![img](emote|t5_2th52|27421)", "score": 8, "replies": []}, {"body": "The thing is bro so many ppl are\nLooking at these resistance areas. Everybody and there mother gonna short here. Which will prob send the stock flying.", "score": 11, "replies": [{"body": "Explain this logic please. If everyone shorted, it would imply everyone is selling the stock(short) and the price would plummet.", "score": 5, "replies": [{"body": "The reasoning is this. Institutional players know that all the average joes are looking at the same thing, waiting to short at the obvious peak, or resistance level, from last year. So, all the institutional players have to do is to push the stock price momentarily higher as soon as all the shorting has taken place. This will put all those average joes underwater and trigger their (short) stop losses. This leads to a large short covering under which the stock price skyrockets (a squeeze). While the stupid shorts are all covering, the institutional players will be selling to them at stupidly high prices. Note that all this action takes place intraday, the average joes I'm referring to are all those retail day traders who are all eagerly awaiting for the stock price to hit 289 (thinking no one else is seeing that) in order to quickly enter their shorts.\n\nThis may or may not happen, but it's the logic you were asking about.", "score": 1, "replies": []}, {"body": "Research what a short squeeze is. It’s too much to explain.", "score": -1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 26, "replies": []}, {"body": "Not everything short squeezes (especially large cap tech like NVDA). Sometimes shit just drops from sell pressure outweighing buy pressure. In fact, that's most of the time. Update: current short interest is sub %2 =No Squeezy", "score": 12, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 7, "replies": [{"body": "If that's what you're into AM. *Snaps on glove*", "score": 5, "replies": []}]}, {"body": "WSB says puts, by and large.. Calls is the only sensible bet to place", "score": 5, "replies": [{"body": "Correct ✅", "score": 2, "replies": []}]}, {"body": "You know what's weird? Every sell has a buyer", "score": 3, "replies": []}, {"body": "I know this but like literally this is why we have been pumping last couple of weeks. Too many puts in the system.", "score": -1, "replies": []}]}]}]}, {"body": "You know the score!!!", "score": 1, "replies": []}]}, {"body": "I sold at the bottom. I always sell at the bottom. It makes it hurt more.", "score": 3, "replies": [{"body": "you like to get hurt don't you", "score": 1, "replies": []}]}, {"body": "Have any of you actually used ChatGPT? I think you should use it before shorting these companies", "score": 3, "replies": []}, {"body": "The top trendline just made it's 2nd point. Too soon to say anything. If you draw that same trendline from the top to the 280ish high, [price broke right through it](https://prnt.sc/DhI4ojBYZXHn).  Your AAPL chart makes more sense.", "score": 6, "replies": [{"body": "Fair enough and a good point. Easier to work with AAPL given the larger history of peaks and bottoms within the channel  \n\n\nHowever, I think both resistance lines can be used. I was solely examining it in terms of current ceilings based on its struggle to make a higher high from its $280 mark.", "score": -3, "replies": []}]}, {"body": "Dude my first intro to WSB was years ago when some cat made like $400k off $4k NVDA puts on earnings. Don’t tempt me.", "score": 2, "replies": []}, {"body": "It will go down when you capitulate", "score": 2, "replies": [{"body": "This", "score": 1, "replies": []}]}, {"body": "There is no reward here, just a ton of risks in $nvda\nRun 🏃‍♂️ 🏃‍♀️", "score": 2, "replies": []}, {"body": "Finally!!! A “sell NVDA” post that relies on pseudoscience and witchcraft instead of critical thinking skills! I’m finally ready to sell. Or not.", "score": 2, "replies": [{"body": "My authority is not measured in mod powers.\n\nIt is measured in magick and witchcraft and runic glory.\n\nI will fuck people up in nightmares, not on the sub.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "If the marketmakers take the unemployment print to heart, this thing ain’t retesting top of zone anytime soon…↘️", "score": 2, "replies": []}, {"body": "tpu going to change the game", "score": 2, "replies": []}, {"body": "“NVDA” randomly “in shambles”… sounds like someone has puts", "score": 2, "replies": []}, {"body": "I'm an unashamed AI bull, and Nvidia is an amazing company, a pillar of the industry - maybe one of the most important companies in the world right now.\n\nI would start leaning into NVDA hard and happily at a P/E ratio of 30, maybe sooner if the tide flipped sooner - because fomo.\n\nThat said, its P/E ratio is currently at ~110. \n\nI'm no authority. But I say... if the 🐻 team wants to drill...\n\nLet them drill. \n\nThere will be blood. \nhttps://youtu.be/WbRnuwjicUU", "score": 6, "replies": [{"body": "NVDA P/E ~110?", "score": 2, "replies": [{"body": "&#x200B;\n\nhttps://preview.redd.it/emqkedh9yssa1.png?width=1010&format=png&auto=webp&s=ca9a405a7f5bb55225703a582743812506cfeb65", "score": 1, "replies": []}]}, {"body": "Smart, good opportunity to DCA if presented.", "score": 1, "replies": []}, {"body": "Saw that and I was out.\n\nNope.", "score": 1, "replies": []}]}, {"body": "Nvda and amd have been super weak recently compared to spy/qqq so whenever those dump then semis will dump even harder", "score": 5, "replies": []}, {"body": "Lmfao NVDA is a monster company!! Will see ATH very soon. But please WSB please keep buying puts ![img](emote|t5_2th52|4641)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)", "score": 4, "replies": [{"body": "i will", "score": 1, "replies": []}]}, {"body": "These TA posts are stupid but fuck it. This stock should be $150 tops and that’s a GOOD premium", "score": 2, "replies": []}, {"body": "So many bears butt hurt their puts are hemorrhaging money. You can grab hold of any desperate theory you want. I’m riding Nvidia to mars baby!!", "score": 2, "replies": []}, {"body": "Yeah it’s not like these chips will be used in all future technology…oh wait", "score": 3, "replies": [{"body": "good logic bro", "score": 1, "replies": []}]}, {"body": "I wouldn’t be surprised at all if NVDA takes a dive. However, there’s no bearish momentum at the moment. If NVDA starts having red weeks, that’s the time to consider selling IMO.", "score": 2, "replies": [{"body": "Completely valid, with more red indications on the daily chart, the sentiment will become more and more bearish.", "score": 0, "replies": []}]}, {"body": "As an Nvda bull this post is just what I wanted to see", "score": 2, "replies": []}, {"body": "Nvidia crash pleaseeee", "score": 1, "replies": [{"body": "Waiting for crash to buy back in still. Now I am getting second doubts.", "score": 2, "replies": []}]}, {"body": "Lol my friend my NVDA stocks are 100% gain. I have a good till fill sell order of -15% \n\nFuck I hope it craters so I can buy back again", "score": 1, "replies": []}, {"body": "Outflows have been greater than inflows for the last few weeks", "score": 1, "replies": []}, {"body": "Yes...complete, utter, total, and irreversible shambles.  You, mr Put owner, are highly regarded.", "score": 1, "replies": []}, {"body": "Ive been slowly loading my IRA with NVDS shares, maybe its time to go all in", "score": -2, "replies": []}, {"body": "NVDA is a scam stock", "score": -2, "replies": []}, {"body": "Nvidia 'bout to become Unvidia ~ biting the hand that's been feeding them all this time in a major way. They're knuckling under to the Chokepoint 2.0 Red Army and cutting themselves off from all things crypto. This after PoW miners have and others have sent their profits to the ozone.\n\nNow they want to focus almost exclusively on networks / commercial/industrial markets. The vacuum they leave behind will gladly be filled by someone like MSI/AMD.", "score": -1, "replies": []}, {"body": "You are stupid AF if you think this is a good play", "score": -5, "replies": []}, {"body": "The gypsy fortune teller lady, where I go for stock predictions, said the same thing. You might be into something here buddy. However, I recommend also asking someone who reads taro cards, for an extra level of assurance. We need to make sure that our plays are based on solid foundations, since we might lose money if the market turns agains us.", "score": 0, "replies": []}, {"body": "Don't they have their hands all over the AI space? They could easily announce something that would blow up puts.", "score": 0, "replies": []}, {"body": "Amazon and google, 95% of nvdas server business, is focused on profitability. Google announced better chip. Doesn’t seem good for for nvidia", "score": 0, "replies": [{"body": "Goog earnings when? Next month?", "score": 1, "replies": []}]}, {"body": "GOOD... I hope it goes under $150 for years so I can build a sizable position!", "score": 0, "replies": []}, {"body": "Shambles? May the Lord smite me with Nvidia's stock price. And may I never recover!", "score": 1, "replies": []}, {"body": "Two letters “a” and “i”", "score": 1, "replies": []}, {"body": "When's the dilution?", "score": 1, "replies": []}, {"body": "I am ready for the dump so I can buy back in please God. Let my sell puts hit", "score": 1, "replies": []}, {"body": "Am I the only regard who thinks this guy is super regarded?", "score": 1, "replies": []}, {"body": "Should draw lines on projected net income and sales. Or projected number of positive/negative headlines", "score": 1, "replies": []}, {"body": "Cool graphs looks ready to either go up or down soon.", "score": 1, "replies": []}, {"body": "You said wang", "score": 1, "replies": []}, {"body": "🚀🚀🚀🚀🚀", "score": 1, "replies": []}, {"body": "Whats your stop loss? as in what price would you exit those puts/short position on nvidia if it went higher? Looking to follow this play if you don't mind not really familiar with trading but I'd like to get in a good entry and exit!\n\n&#x200B;\n\nThanks!", "score": 1, "replies": [{"body": "Generally speaking, I like putting my stop loss 1-3% higher or below a resistance/support zone, depending on which way I am trading it. So in this case, the resistance line if I were to line it up exactly is roughly at $277-278, so the stop loss would be around $280-$285.  \n\n\nHope this helps", "score": 2, "replies": [{"body": "thanks it does!", "score": 1, "replies": []}]}]}, {"body": "Those two points make a ray, not a line", "score": 1, "replies": []}, {"body": "One sec, I’ll bust my crayons out and pick a chart.", "score": 1, "replies": []}, {"body": "Eventually it will break through this, could be now.  And then y’all will just draw another line and say the same shit.  If money is flowing into growth stocks, nvidia will not be excluded.  If the market sells off growth stocks nvidia will get slammed.", "score": 1, "replies": []}, {"body": "Resistance points are like the Easter bunny.  I used to believe…", "score": 1, "replies": []}, {"body": "Worst TA ever... and I had a Teachers Assistant that was a tremendous bitch", "score": 1, "replies": []}, {"body": "Stock should fear the line of a random dude on reddit lol", "score": 1, "replies": []}, {"body": "I bought recently so this checks out.", "score": 1, "replies": []}, {"body": "I hv puts n I am in deep red like 40% down. Let’s see", "score": 1, "replies": []}, {"body": "Needs…. More… lines….", "score": 1, "replies": []}, {"body": "That upper resistance line is BS", "score": 1, "replies": []}, {"body": "242 at lowest", "score": 1, "replies": []}, {"body": "Nice try, person trying to sell me yet another round of puts that will expire worthless.", "score": 1, "replies": []}, {"body": "Ah shit. Here we go again ![img](emote|t5_2th52|4260)", "score": 1, "replies": []}, {"body": "Don't you need 3 peaks to form a trend line not 2?", "score": 1, "replies": []}, {"body": "Puts are too expensive IMO. Could just skowly drift sideways for years", "score": 1, "replies": []}, {"body": "DIAMOND HANDS \n\nJust kidding. Sell.", "score": 1, "replies": []}, {"body": "So, calls it is", "score": 1, "replies": []}, {"body": "Could go up. Could go down. Please WSB peoples, buy it up to drive my share price higher so I can dump it and leave you holding the bag.", "score": 1, "replies": []}, {"body": "Im thinkin about picking up 10 10/23 220p. My only fear is even electric car valuations havent fully came down (nio still up 100% pre pandemic) due to the hype of disruptive technologies. That's the gamble with this play I'd say. I generally trade fundamentals, and nvda has a lot of pp, which is spooky.", "score": 1, "replies": []}, {"body": "TA deez nuts stocks go up", "score": 1, "replies": []}, {"body": "NVDA will go up forever", "score": 1, "replies": []}, {"body": "Not screwing around with AI related companies bruh🙏🏻", "score": 1, "replies": []}, {"body": "I’ve learned the hard way to never bet against Jenson", "score": 1, "replies": []}, {"body": "Who are you trying to convince?  If u believe in it, just do it.  Are you trying to get validation and have others follow u?", "score": 1, "replies": []}, {"body": "Will it help if I buy a GeForce RTX 4090 for my gaming computer?", "score": 1, "replies": []}, {"body": "Two letters bitches\n\nA.I\n\n![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "so buy calls it is, thx op", "score": 1, "replies": []}, {"body": "\\*Grabs Popcorn\n\n&#x200B;\n\nHappy shorting, OP.", "score": 1, "replies": []}, {"body": "Your lines and boxes mean nothing", "score": 1, "replies": []}, {"body": "With the amount of A100 and h100 they are shipping to MS for chatGPT, it would be very hard to imagine them not reaching at-least 300 price point. This is going to be a great earnings for them IMO.", "score": 1, "replies": []}, {"body": "Then buy puts. Load up", "score": 1, "replies": []}, {"body": "calls? ok got it.", "score": 1, "replies": []}, {"body": "Only number that makes sense is the prior resistance its at, all the other stuff is nonsense.", "score": 1, "replies": []}, {"body": "Bruh u didn't even include the second peak in ur line at the top", "score": 1, "replies": []}, {"body": "He's like some kind of stock whisperer with those magic lines. How the hell did he know it was going to peak right there?", "score": 1, "replies": []}, {"body": "Just bought", "score": 1, "replies": [{"body": "Bearish or bullish?", "score": 1, "replies": []}]}, {"body": "Ah yes, the classic Dark Knight Joker Smile pattern.\n\nLiterally can’t go tits up.", "score": 1, "replies": []}, {"body": "Why moths keeps getting attracted to flames", "score": 1, "replies": []}, {"body": "this is dumb microsoft is buying all the graphic cards they can to power all the ai market", "score": 1, "replies": []}, {"body": "Stop hating on nvda scum bags", "score": 1, "replies": []}, {"body": "So short it. It’ll be your funeral.", "score": 1, "replies": [{"body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Technical analysis doesn’t work any better than voodoo dolls. These are real life companies whose prices follow earnings and dividend growth over time. If TA works show me a fund that is managed solely by TA.", "score": 1, "replies": []}, {"body": "thanks for the confirmation going to buy more", "score": 1, "replies": []}, {"body": "Seeing this just convinced me to buy more NVDA", "score": 1, "replies": []}, {"body": "Look at 7 year chart how fat it’s come! What you saying percentage wise no sense unless purchased last year what looking for??", "score": 1, "replies": []}, {"body": "🖍️🤡", "score": 1, "replies": []}, {"body": "Don't bet against NVDA", "score": 1, "replies": []}, {"body": "This only matters if you're committed to holding it long term, which is why that's a stupid strategy.\n\nI have stop losses in place, so I'll get out as soon as it heads downward. Meanwhile, I'm making money on it. It's not \"in shambles\" it's doing really well. Stop with the nonsensical, doom-predicting hyperbole.    \"In shambles\" means NOW. Obviously that's not the case.", "score": 1, "replies": []}, {"body": "Is this that astronomy my mom tells me about?", "score": 1, "replies": []}, {"body": "Jensen lies will fade. Simple e.g. MSFT used NVDA GPUs for training ChatGPT, but revenue came down from 8B to 6B. The need of GPUs is only for training and executing is with CPUs. The number GPUs need is not exponential and Jensen can not keep using AI word. Some where he has to talk about numbers.", "score": 1, "replies": []}, {"body": "The quality of the analysis against semiconductors lately makes me feel comfortable on my SOXL swing trade", "score": 1, "replies": []}, {"body": "This means you don't get to make fun of people who read horoscopes.", "score": 1, "replies": []}, {"body": "It's so funny watching people who don't understand tech try to predict tech stocks", "score": 1, "replies": []}, {"body": "Holy shit that's a lot of boxes and lines...but what does it all mean?", "score": 1, "replies": []}, {"body": "Once a again long term need for computing power will increase ….!", "score": 1, "replies": []}, {"body": "that top line can be drawn to any breakout peak ever made anywhere on any stock.", "score": 1, "replies": []}, {"body": "So much for your Nvda being in shambles, I’d bet against you any day if you would let me.., it will be 320 \nBy mid June..\n\nRemind me 1 month", "score": 1, "replies": []}, {"body": "Aged like fine milk!", "score": 1, "replies": []}]}
