{"title": "We thought China was paranoid but they were right about Telsa privacy issues", "selftext": "[https://www.nst.com.my/opinion/columnists/2023/04/897695/tesla-workers-shared-sensitive-images-recorded-customers-cars](https://www.nst.com.my/opinion/columnists/2023/04/897695/tesla-workers-shared-sensitive-images-recorded-customers-cars)\n\n> But between 2019 and 2022, groups of Tesla employees privately shared  via an internal messaging system sometimes highly invasive videos and  images recorded by customers' car cameras, according to interviews by  Reuters with nine former employees. \n\n&#x200B;\n\n>Since about 2016, Tesla has employed hundreds of people in Africa and  later the United States to label images to help its cars learn how to  recognise pedestrians, street signs, construction vehicles, garage doors  and other objects encountered on the road or at customers' houses.  \n>  \n>Two ex-employees said they weren't bothered by the sharing of images,  saying that customers had given their consent or that people  had given  up any reasonable expectation of keeping personal data private.  \n>  \n>Three others, however, said they were troubled by it.  \n>  \n>\"It was a breach of privacy. And I always joked that I would never  buy a Tesla after seeing how they treated some of these people,\" said  one former employee.  \n>  \n>Another said: \"I'm bothered by it because the people who buy the car don't know that their privacy is not respected …   \n>  \n>\"We could see them doing laundry and really intimate things. We could see their kids.\"  \n>  \n>One former employee saw nothing wrong with sharing images, but  described a function that allowed data labellers to view the location of  recordings on Google Maps as a \"massive invasion of privacy\".", "id": "12g8ub4", "created_utc": 1681014779.0, "score": 731, "upvote_ratio": 0.88, "num_comments": 226, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|2177|**Previous Best DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/oopeyq/covid_us_delta_impact_could_be_overblown_ontarios/) \n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: Tesla workers shared sensitive images recorded by customers' cars", "score": 1, "replies": [{"body": "Then post exit data on facebook", "score": 1, "replies": []}]}, {"body": "China: \n\nhttps://preview.redd.it/toq5jorf5usa1.jpeg?width=680&format=pjpg&auto=webp&s=d2789ed9101b6d6770a31916479cccc2b3d07883", "score": 693, "replies": [{"body": "Lol takes one to know one", "score": 95, "replies": [{"body": "The US: that’s great keep up the good job", "score": 22, "replies": []}]}, {"body": "basically they can record what you are doing 24/7, that is what cameras 🎥 do.\n\nhttps://preview.redd.it/xpqvks16g0ta1.jpeg?width=740&format=pjpg&auto=webp&s=e5d5bf544760399ec93024de6892cea85f924741\n\nCome on the people who were not ok with it. Was the people seeing the dirty things at the back 😂", "score": 4, "replies": []}, {"body": "Lol I think it's wise", "score": -7, "replies": []}]}, {"body": "Every country should be paranoid when using tech from a foreign country. Data is the new warfare and whoever gets access to other's data can have a upper hand in case of a conflict.", "score": 303, "replies": [{"body": "I'm paranoid about tech, period.", "score": 99, "replies": [{"body": "And AI hasn't really got going yet.", "score": 6, "replies": [{"body": "A.I isnt the A.I that you are thinking. It is still a program being implemented by coders.", "score": 1, "replies": []}]}, {"body": "I’m one more oddly-specific-response-to-my-posts away from ditching cell phones altogether.", "score": 15, "replies": [{"body": "Ditched cell phone here in December 2022. Well, kind of. Smartphone ditched actually.\n\nWhile terribly inconvenient at first, esp for looking up \"contacts\" saved in the phone, SMS messaging, ease of snapping and sending pictures, and secure login verifications;\n\nIt's been unbelievably more peaceful and less stressful every single day. Ease of keeping tasks and priorities in order and not knocked off track has steadily improved.\n\nStopped hearing phones ringing that aren't ringing & 24x7 notices of message arrivals. No more impulsive reaching for the smartphone display during conversations or waiting rooms (have actually started keeping a book at the ready for appointments).\n\n\\-we do keep one dumb phone (wife carries it) for emergencies, and a landline because it's practically thrown in with our DSL for another $40.\n\n\\-funny anecdote about the dumb phone. It's a ruggedized type with like 2 *days'* talk time. No fooling, its a chubby brick. No one will steal it. Was accidentally left at WalMart during Xmas shopping chaos. No one bothered to steal it. Try that with an iPhone.\n\nNot going back. No desire to be that \"connected\" again.", "score": 17, "replies": [{"body": "Interesting, not much posted about the before and after of smart phone use", "score": 7, "replies": [{"body": "Well yea, how would they post it? I haven’t seen a desktop in ~10 years", "score": 3, "replies": [{"body": "Laptops", "score": 1, "replies": []}]}]}]}]}, {"body": "It really is insane just how much leeway lawmakers give tech companies.  Talk all the shit about Europe you want, but at least they are very strict about consumer privacy and data protection.", "score": 8, "replies": [{"body": "On paper", "score": -3, "replies": [{"body": "No.\n\nhttps://techxplore.com/news/2022-09-europe-big-tech-billions-fines.html", "score": 3, "replies": [{"body": "lmao grow up", "score": -4, "replies": [{"body": "What?", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes, if someone is invading my privacy I'd prefer it to be a foreign government than my own. Better to be exposed to strangers than to people you know.", "score": 21, "replies": [{"body": "Are you worried about your privacy being seen by people you know will have a bad influence?", "score": 2, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Please take all unbabying talk to another subreddit. No one wants r/wallstreetbets to become a political hellhole.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Please take all unbabying talk to another subreddit. No one wants r/wallstreetbets to become a political hellhole.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -3, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "Proof literally anyone a liberal doesn't like is a fascist.", "score": 0, "replies": [{"body": "And everyone right wingers don’t like are anti fascists, communists, socialists, BLM, etc etc etc.  Go look up psychological projection, before you make more comments about fascism.", "score": 4, "replies": []}]}]}]}, {"body": "I agree with your point of view, in fact, the current social situation is relatively tense. China is still too far away from us. This is actually a political issue.", "score": 0, "replies": []}, {"body": "I need a sauce on that abortion arrest claim lol that’s absurd", "score": 1, "replies": [{"body": "Please take all unbabying talk to another subreddit. No one wants r/wallstreetbets to become a political hellhole.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "I am because of how easy it is to obtain the data. Like local businesses can petition for cell phone data to see how many people are geolocated on any given day close to their business but don't enter.", "score": 2, "replies": [{"body": "It is indeed necessary for enterprises to apply for mobile phone data. Because he wants to protect the property safety of his company. In this way, he can better protect the life and property safety of himself and his employees. i think it's a good thing", "score": 0, "replies": []}]}]}]}, {"body": "Mad that people willingly install Alexia, Google hub into their houses. Privacy statement says one thing and then it turns out years later the interns are forwarding voice clips of people's intimate moments to each other.", "score": 6, "replies": []}, {"body": "I’m paranoid, period.", "score": 2, "replies": []}]}, {"body": "New warfare?!?? Information brokering and blackmail are some of the oldest and best proven methods of warfare. Its like you are saying \"Prostitution is the fastest growing new career field\"\n\nLOL", "score": 4, "replies": []}, {"body": "Trust when I say eventually data will lose its value. If the fidelity of the data is lost (AI looking at you), the source won’t matter because we won’t know whether it’s true or not. Lmao we’re headed for a world where people can do whatever they want due to manufactured evidence and loss of trust in institutions", "score": 5, "replies": []}, {"body": "I think with the arrival of chatGPT and the massive global investment in the biological sciences as well as therapid development of vaccines using mRNA tech, we’ve moved firmly past the Information Age and we’re now in the Biotech age.", "score": 7, "replies": []}, {"body": "Especially Chinese tech lol", "score": 0, "replies": [{"body": "nope. It’s even a stretch to say it’s bilateral. Google, Facebook, Apple are not Chinese and they blanket every modern device, browser, and communication channel in the world. And they have back doors in every layer that they open for CIA/MI6 to spy on both the western world and global south and anyone who opposes the western  elite’s agenda. PRISM has ran for decades. Snowden and Twitter files have both exposed the depths of US tech spying.\n\nThe only notable ban is Huawei and for that there was not even any infrastructure back doors proven. Just “risk of backdoors”. Same with TikTok, no sensitive data being collected nor any of it being pipelined to CCP (what use are our dance videos to Chinese autocrats?)\n\nWe actively spy but it’s ok because we are America. Other people should be actively policed in case they ever spy like we do. We crush soveirgn nations, commit genocide in the millions, install puppets for corporate interests, and use taxpayer dollars to do it. But other countries should be barred from fair business deals in case they ever have the opportunity to do what we already do.\n\nDo you see the nonsense?", "score": 2, "replies": []}]}, {"body": "I share your point of view. It would be a very scary thing if they could know our movements anytime, anywhere. We are like being stripped naked in front of technical management.", "score": 1, "replies": []}]}, {"body": "privacy should be government mandated. the opt in is basically a black mail that accept our terms or dont use our product and coz all big tech sing from the same hymn sheet its a blanket ban essentially.", "score": 59, "replies": [{"body": "> privacy should be government mandated\n\nIt's like people forgot about [PRISM](https://en.wikipedia.org/wiki/PRISM). Government don't give a fuck about your privacy, they only care about your ability to generate taxes and keeping the money flowing to them.", "score": 12, "replies": [{"body": "Actually, governments hate privacy. They love churning data for developing military and economic tools, and controlling societies. One guy’s data is nothing, but when you have 100 million people’s data, you got a tool and information.", "score": 8, "replies": [{"body": "Yup! Privacy is at odds with security.", "score": 2, "replies": []}]}]}, {"body": "100% agree !!!!!! This is the way .", "score": 3, "replies": []}, {"body": "\"communist\" EU Europe already does this. They dont even bend everyone over to apple.\n\nI wish US was that sensible", "score": 2, "replies": [{"body": "No they are not. That is why they are consistently trying to ban encryption.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "yeah and they store it in FEMA deathcamps of course \n\nunlike the freedom loving google or facebook that are completely unregulated and have incentive to pump their stocks", "score": 0, "replies": []}]}]}]}, {"body": "The most alarming aspect for me is this:\n\n\n>> One ex-employee also said that some recordings appeared to have been made when cars were parked and turned off.\nSeveral years ago, Tesla would receive video recordings from its vehicles even when they were off, if owners gave consent. It has since stopped doing so.\n\n\nEverything else seems sketchy but akin to an Alexa: if you’re actively using it, you might be sharing some personal data. But the fact that the cameras can be activated even when the device is turned off, without any indication that they’re recording, that’s on another level.", "score": 78, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "Every test of Echo devices that checked their network traffic came to the conclusion that they don’t send any data when the blue LEDs aren’t on. Sure it’s something to keep in mind and test – but the main issue is how the data that’s knowingly collected is stored and used. \n\nAmazon links everything to the user’s account, afaik for an unlimited amount of time unless you delete the stuff manually, and company employees and I think even third-parties can access it. That’s the main issue, and that’s the same as the issue with Tesla. Compare that to one of their competitors who doesn’t link the data to your account, anonymizes it so that each recording is isolated, and only lets employees access it if you opted in. \n\nThere’s always a remaining risk, of course, but even with the same hardware, what happens on the server matters greatly. I think it’s dangerous to look at the worst offenders and just say “oh well, they’re probably all doing the same anyway.” Amazon’s use of user data is a problem and so is, evidently, Tesla’s.", "score": 4, "replies": [{"body": "The problem is that Echo devices still sometimes record when they shouldn't. The wake word recognition (\"Alexa...\") might have 99.99% accuracy but it will still sometimes trigger erroneously. When it's running 24/7 99.99% sounds nice on paper, but it won't be a rare event that it eventually missfires. And then it records and sends whatever is recorded to Amazon.", "score": 3, "replies": [{"body": "That’s absolutely true! Amazon should fix that, and I hope that Apple won’t go through with its plans to change the “hej Siri” wake word to just “Siri”, because then accidental activations could become even more frequent. \n\nBut – whether accidentally or on purpose, once active, those devices always indicate their recording status via their LEDs. Teslas don’t. There’s zero indication that Teslas would record anything when they’re off, yet apparently they can and did. And that, I believe, is categorically unacceptable without any indication. And even when you’re using the car, sharing camera data should be opt-in, and the data should only be stored for a limited time.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "I don’t have a Tesla", "score": 1, "replies": []}]}]}, {"body": "> I say this as a guy with multiple Alexa  type devices.\n\nYou know that applies to your phone as well, right? Ever use it on the toilet? Or look up porn on it? Ever have a \"private\" conversation while your phone is in your pocket?", "score": 1, "replies": []}]}, {"body": "So when someone comes over to key your car and break out a windshield you don’t want it to record that?", "score": -9, "replies": [{"body": "I don’t see any scenario in which it would need to send that data to Tesla’s servers to be used at their discretion.", "score": 17, "replies": [{"body": "What if Jim and his gang of dumpster divers come have a soup kitchen in your car?? I bet you would change your stance", "score": -2, "replies": [{"body": "If they have that *in my car*, I feel like the real issue isn’t whether my car should have cameras but whether it should be that easy to get in", "score": 0, "replies": []}]}, {"body": "Your car is set on fire by a group of pyromaniacs.", "score": -2, "replies": [{"body": "Yeah that happens all the time.", "score": 8, "replies": []}]}]}, {"body": "That's why I have insurance and a bat", "score": 0, "replies": [{"body": "Soup Kitchens happen all the time ma'am, especially when you're not around", "score": 1, "replies": []}]}]}]}, {"body": "Did you really expect something different from a Musk company, wait till the Starlink shit is released.", "score": 122, "replies": [{"body": "imagine all the ppl that were having sex while car was in auto. There must be a million of those videos shared.", "score": 76, "replies": [{"body": "It finally makes sense why he was so happy to boast about how he works so many hours. He’s locked into his office watching Tesla branded amateur porn.", "score": 117, "replies": [{"body": "Or how they got the federal government to back off. They got dirty videos on somebody for every politician they needed to swing.", "score": 33, "replies": [{"body": "Videos of conversations inside teslas. Thinking on it though what’s it even matter to him honestly he is so rich why would he even be do things like that?\n\nhttps://mkorostoff.github.io/1-pixel-wealth/\nThat’s Jeff’s at 185 B… around Musks current net worth", "score": 14, "replies": []}]}, {"body": "Elon “Giggidy” Musk", "score": 9, "replies": []}, {"body": "He's basically the head of the TSA in *South Park*", "score": 3, "replies": []}]}, {"body": "This would def trend on cornhub. Thanks for the million views. “Fake Taxi, autonomous edition”", "score": 7, "replies": []}, {"body": "If theyre fucking on the open road I dont think they care that other people see", "score": 2, "replies": []}, {"body": "So why would people opt into sharing their cabin camera data when they r having sex in their car?", "score": 3, "replies": []}, {"body": "Think chat Gpt could find a few for me", "score": 1, "replies": []}]}, {"body": "Just look back at Projects Shamrock and Minaret :)", "score": 0, "replies": []}, {"body": ">wait till the Starlink shit is released\n\nIt is. What do you mean?\n\nI am sure muskrat is going to find some way to use the internet traffic to further his personal goals.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "Because once the data is stolen, there will be irreparable losses", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "So do you think the Tsla staff are watching behind the scenes in such a video? I believe it was not stolen. But someone listens to your privacy in a place you can't see", "score": 2, "replies": []}]}]}]}, {"body": "If you think the same type of privacy breaches aren’t happening in companies like Apple, Twitter, Instagram Facebook etc then you’re fucking regarded", "score": 85, "replies": [{"body": "Lots of cases of Siri and google catching audio in intimate moments.\nIf you are not comfortable with your affairs becoming public, keep microphones and cameras out of private spaces.", "score": 22, "replies": [{"body": "The difference is, Apple is the only company that made meaningful changes to stop this from happening. The others just waited the shitstorms out and kept doing business as usual.", "score": 13, "replies": [{"body": "After how many years of private data being farmed out to contractors??? And miss me with the privacy shit, Apple made the Airtags, a stalkers and predators best friend. The amount of ways the Airtag has helped car thieves is insane. And only users of iPhones will ever be alerted, if at all. And if you don't use an Apple product you are now a sitting duck for robbery for a problem Apple created.", "score": 2, "replies": [{"body": "Tell me you don’t know how an AirTag works without saying it ☝🏻 AirTags alert nearby devices if they are separated from their owners device so they can’t be abused by stalkers. Bluetooth is a universal tech that devices can communicate with, so NO you don’t need an apple product to see that an AirTag is following you around", "score": 0, "replies": [{"body": "Tell me you can't read without saying it! That ONLY WORKS IF YOU HAVE AN IPHONE!\n\nIf you don't you are a sitting duck. Literally NO ONE is opening their Bluetooth settings/app to check for Airtags all day. It only notifies you on its own if it's an iphone, you have to manually search for it or download an app to do so with any other phone. Apple now has forced you to have an iPhone to protect yourself from Airtags they created.", "score": 6, "replies": [{"body": "If you're using an Android device, you can download the Tracker Detect app to find an AirTag or Find My network accessory that's separated from its owner and might be traveling with you. You act as if downloading a free app that protects you is a problem?", "score": -4, "replies": [{"body": "Fam you are hitting the nail on the head, my grandmother is not downloading some app just to stay safe from Airtags, why should she all of a sudden need some app to protect her from a device Apple created and is not doing enough to keep the public safe from?\n\nWhat, my 5 year old should download this app too? What about people who don't have the app and know nothing about it's existence?? This app has not solved the problem, ask the many victims of crime specifically linked to the use of Airtags. What about the people who don't use Android or iPhones, what about them? You can  defend Apple all you want, this is their problem and they haven't done enough to make this not a issue.", "score": 7, "replies": [{"body": "Your 5 year old shouldn’t even have a smartphone lol but that’s a whole different story", "score": -5, "replies": [{"body": "My exact point, my 5 year old doesn't have a smartphone, people without an iPhone are vulnerable unless they know to take certian precautions, a problem created by the company that makes the iPhone...\n\nMake the poison (Airtags) sell the antidote (iPhone) all while claiming you're doing it in the name of Privacy and Security.", "score": 5, "replies": []}]}]}]}]}]}, {"body": "Is there a source for the claim that AirTags helped thieves that much? My AirTags beep quite often if they haven’t been connected to my phone in a day or so. So the window of opportunity there is pretty low. \n\nIt’s also not a new product category, less precise than competing products, and a completely different topic than what I was talking about (company usage of Siri data). In other words, whataboutism of the highest degree.", "score": 0, "replies": [{"body": "All the other devices never had such an ubiquitous network that's always on without added cost. Every iPhone is a node, this is on by default, no other tracking product comes close in terms of reach and network size. Also the beep means nothing, it's so simple to open one up and disconnect the speaker aka Silent Airtags.\n\nA simple Google search will give you tons of article and YouTube a ton of videos. Try it yourself. Find a stat yourself, I'm not doing that homework for you, have a chat with your local police department and they will have notes for you.", "score": 2, "replies": [{"body": "A) If you’ve never heard of actual GPS trackers before, I’ve got news for you. They are much more precise, work in remote areas, and have existed for ages. Newer models are very slim, too. I’m not saying there aren’t issues with AirTags, but they aren’t a new or unique issue, and they aren’t related to the privacy situation with Siri. \n\nB) “Here is a claim but sorry I don’t give away my sources, I’m not doing that homework for you” is just a cumbersome way of saying that you’re talking out of your ass. Thanks for clearing that up", "score": 2, "replies": []}]}]}]}]}, {"body": "I make sure to set up my phone camera just right whenever I’m about to plow the ol lady just in case it ends up on the dark web one day", "score": 3, "replies": [{"body": "Dark web? Wait, how old is your lady... 🤨", "score": 1, "replies": []}]}]}, {"body": "Yet they’re not holding active defense contracts by their sister companies", "score": 10, "replies": [{"body": "No, they just work for intelligence agencies directly.", "score": 25, "replies": [{"body": "Apple isn’t maneuvering satellites to nav drones to kill.\n\nTesla bros are ridiculous", "score": 1, "replies": [{"body": "They are just producing Airtags so stalker and predators can rob or kill you. And heaven forbid you don't use an iPhone and have to be part of a problem Apple created.", "score": 5, "replies": [{"body": "There is plenty of criticism to go around.\n\nOnly one is utilizing satellites for war and changing how they are used on the whim of an ethically questionable ceo that’s violating privacy simultaneously without oversight.", "score": 2, "replies": []}, {"body": "Seriously, this is an issue.\n\nBut Apple isn’t so entwined with government contracts / subsidies that they would potentially fail to be profitable at all without them", "score": 1, "replies": [{"body": "Personally I'm good with private companies working with governments in an effort to reduce crime but specifically only for that reason. And the crime has to be intentional and the focus shouldn't be only a specific set of people, but I get that's a whole can of worms and I can fully understand not wanting this. But I think about the many times major criminals could have or have been caught by this private and government relationship. Beyond that I don't really know how to feel.", "score": 2, "replies": [{"body": "I think i understand your idealist stance on private and government collaboration to reduce crime, and who doesn’t want to reduce crime, but the reality is that when private companies are brought on they are not subject to the same oversight, transparency, or repercussions that a government agency is.\n\nBecause authority in any context will always ultimately have abuse, i am partial to not incorporating private contractors in reducing crime or our Justice system.\n\nSame for private military contractors.\nIt opens us up to abuse of civilians and National security issues.", "score": 1, "replies": []}, {"body": "I feel the ideal military /private contracts are for manufacturing goods. \nNot in dealing directly with civilians. \nNot in outsourcing our key National defense or intelligence components.\n\nIt feels like shifting accountability with how civilians are treated and it makes us weak in security and defense.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "They're doing it, so can Tesla. What a shit mentality for a consumer to have", "score": 9, "replies": [{"body": "Didn’t they roast Facebook over it? What happened to that?", "score": 1, "replies": []}, {"body": "Or some consumer thinks his privacy can be shared", "score": 1, "replies": []}]}, {"body": "What is even the point of letting customers and users keep data on *their* servers if they can't mine it?\n\nIt is foolish to believe that whatever you keep that is not on a hard drive or disc only is safe.", "score": 0, "replies": []}, {"body": "What you’re talking about those companies are perfect fine, the Congress didn’t call for a ban on them", "score": 0, "replies": []}, {"body": "Exactly !", "score": 1, "replies": []}]}, {"body": "I banished my car from my laundry room.  It would just stare at me with dead-headlights...judging me.\n\n\"Back to the garage Devil!  Leave me to mix darks and whites in peace.\"", "score": 10, "replies": []}, {"body": "It’s basically a drivable computer", "score": 4, "replies": []}, {"body": "Tesla is not a car company.\nThey are a tech / surveillance company.\nThey don’t deliver on car expectations but they deliver on increasingly invasive surveillance", "score": 30, "replies": [{"body": "It's these kind of shallow nonsensical arguments that bring me to Reddit.", "score": -3, "replies": [{"body": "I come here to see Elon dick riders get upset", "score": 7, "replies": [{"body": "lol I see your world revolves around Elon then..", "score": -5, "replies": [{"body": "It does for you, clearly", "score": 5, "replies": []}]}]}, {"body": "Tesla truck.\nRobo taxi \nHyper loop\nFive billion other bullshit promises that others would have gone to jail for misleading investors.", "score": 1, "replies": [{"body": "What are the other 5 billion?", "score": 1, "replies": [{"body": "The collective sperm he’s expended trying to impregnate staff instead of doing his job", "score": 2, "replies": [{"body": "The saltiness is palpable", "score": 1, "replies": [{"body": "From his balls youre gargling? Yeah.\n\nFan bois are pretty nasty. But I’m not salty, just disgusted.\n\nAnd y’all don’t accept any criticism so i gladly point that the man doesn’t wear pants in the office, investors are paying all his baby mama’s of which there are many, and as a polarizing figure - he’s costing his associated companies losses on equity value.\n\nBut you won’t listen. Just roll those balls around and gargle ‘lord elon’ as loudly as possible while we all laugh at you ![img](emote|t5_2th52|4271)", "score": 3, "replies": [{"body": "lol you haven't levied any worthwhile criticisms. Your hate for Elon is quite visible. Maybe go outside?", "score": 0, "replies": [{"body": "I was just outside gardening ten minutes ago.\n\nYou’re projecting, elon fuck boi.", "score": 1, "replies": []}, {"body": "I wasnt hiding my disgust.\nMaybe you have a reading comprehension problem", "score": 1, "replies": [{"body": "Right, perhaps stop hating someone you never met and take a breather lol", "score": 1, "replies": [{"body": "But we both know that will never happen", "score": 2, "replies": [{"body": "You'll never take a breather or relent from hating Elon lol?", "score": 2, "replies": [{"body": "Why would i change my opinions?\nJust because you’re ball gargling Elon?\nPretty sure he doesn’t need you defending him on Reddit like a tool\n\nEdit: and you took that personally and blocked me.\n\nGood.", "score": 2, "replies": [{"body": "I'm not defending him.. I'm pointing out how weird it is for you to hate him with such passion lol", "score": 3, "replies": []}]}]}]}, {"body": "I will if you get his balls out of the back of your throat", "score": 1, "replies": [{"body": "lol what does that even mean. what world are you living in. are you 12 or just incel?", "score": 2, "replies": [{"body": "Elon has a severance package for you, just sign this form from HR", "score": 2, "replies": [{"body": "?", "score": 2, "replies": [{"body": "Just assumed you had ![img](emote|t5_2th52|4263) since your entire existence revolves around defending him", "score": 2, "replies": [{"body": "incel it is", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": ">This is a clear violation of people's privacy and it is disgusting that Tesla would do this. I hope that the people who were affected by this will take legal action against Tesla.", "score": 26, "replies": [{"body": "It’s a bot. It post comments 13-17 times per hour.", "score": 7, "replies": []}, {"body": "Your comment history shows a great story of love and hate with Tesla. Pick a side bot", "score": 24, "replies": []}, {"body": "Ok. How would you know your privacy was invaded if Tesla's data doesn't leave Tesla?\n\nHow about ask yourself why your phone gives you ads based on even just conversations you have around it?", "score": -19, "replies": [{"body": "You're talking to a bot, bro.", "score": 19, "replies": [{"body": "So a normal, completely authentic Reddit experience then 😂", "score": 10, "replies": []}]}]}]}, {"body": "I don’t give a shit, and usually disclose every intimate encounter with “if you are watching or listening or can hear me then I’m sorry”", "score": 10, "replies": [{"body": "Ya,  I just fuck in my car with impunity .  All women from now will be given a blindfold.  \n( that sounds sketchy after typing it . )", "score": 5, "replies": [{"body": "Masques required in my car.", "score": 3, "replies": [{"body": "Ya masks are better ! Cheers", "score": 1, "replies": []}]}, {"body": "Dude good\nIdea", "score": 2, "replies": []}, {"body": "What if you drive a Tesla and pick up prostitute and your wife calls Elon and demand for those videos, cheat with your brain hahaha", "score": 2, "replies": [{"body": "Elons my homie", "score": 1, "replies": []}]}]}]}, {"body": "CHINA TO THE MOON !", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Kicks you or I will never understand", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "They were downsizing. Not about wrond doing.", "score": 1, "replies": []}]}, {"body": "Oh my, but China bad? Where y’all hypos now", "score": 15, "replies": [{"body": "There are good reasons to criticize China mate for how it handles the internet. The Great firewall policy, social credit surveillance, the Bitcoin controversy etc.", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "It’s a real issue indeed.", "score": 3, "replies": []}]}]}, {"body": "Yeah. China is the worst. What of it", "score": -2, "replies": [{"body": "China lumber huan ☹️😘", "score": -2, "replies": [{"body": "Look here, China berry bad", "score": 0, "replies": []}]}]}, {"body": "Yes, China very good, not only ethnic cleanse, kidnap, imprison and murder pro-democracy groups and critics of Winnie Pooh, not only kill kids wanting democracy and freedom in big square.\n\nChina very good, https://www.youtube.com/watch?v=51fWzJ-A5w4", "score": 1, "replies": []}]}, {"body": "Most of the tech companies has tracking technologies embedded. It depends after, how safe are our infos with them and what they do with our data. Targeting ads, data mining, Ai training, Data Services and Collection, etc.", "score": 5, "replies": []}, {"body": "Telsa", "score": 2, "replies": []}, {"body": "As an American, all our personal data became a commodity to collect and sell in 2016. Just need to be an \"edge company\" somewhere between you and your internet and they can sell that shit however they want. Corporate IPs get more protection than citizens personal data.", "score": 2, "replies": []}, {"body": "China after TikTok, chip back doors, basically stealing an entire division of ARM, social credit scores, embedding surveillance in mobile network infrastructure, and offering loans to poor countries they’ll never be able to pay back ![img](emote|t5_2th52|27421) “u crant droo dis troo mree!!”", "score": 2, "replies": []}, {"body": "I researched this and there is more to it then this article going around implies for clickbait. Although it is still troubling...\n\nThe instant messenger is for 1 on 1 and is only for images that were sent to one person (a supervisor for example). This happens all the time at huge call centres that do tech support and customer support, and depending on the office environment...comments will be made....\n\nAlso they shared pictures of Elon's garage with the sub from a James Bond movie, so it's something that Elon is not aware of that's for sure. \n\nThirdly, it doesn't seem systematic but more so untrained employees being too cavalier. \n\nAnyways, if left unchecked could be a huge issue.", "score": 2, "replies": [{"body": "It seems rather naive to believe Elon doesn’t know about this. He might just not have known about video of his own garage being shared as well", "score": 2, "replies": [{"body": "As someone who runs their own business, you can't get into the daily interactions of employees or it will drive you nuts. I am sure Elon running multiple multi national corporations there is a lot that goes on that he is not aware of or wants to be aware of for that matter as he needs to focus on bigger things. That's why I am saying it's probably not systemic. I don't think that's naive, it's just the reality.", "score": 2, "replies": [{"body": "In the book Power Play it stated Elon specifically wanted all employees to come talk to him about anything going on , he's a control guy.", "score": 2, "replies": [{"body": "I know, but we're talking about tech support Tesla employees, do you really think they have access to just \"come and talk\" to him?", "score": 1, "replies": [{"body": "I don't see how they could but in his mind I'm sure he is saying \" all employees can come talk to me I don't know why this happened\"", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The irony of China being worried about privacy is palpable.", "score": 2, "replies": [{"body": "Yes", "score": 2, "replies": []}]}, {"body": "The China bot gaslighters are out in full force today. It really is peak Reddit when unsubstantiated and non specific claims of violations of policy by a private company are used to take heat off of the greatest human rights abusers in the world who actively sterilize and murder political dissidents.\n\nKeep doing you Reddit 👍", "score": 4, "replies": []}, {"body": "So why is nobody paranoid about TikTok?", "score": 4, "replies": [{"body": "Some people are but no one will do anything about it because they are all scared that banning it will cause people to be upset because they can't watch their videos any more and lawmakers might not get reelected. Chinese don't need spy balloons just a slick video app.", "score": 5, "replies": []}, {"body": "They are?", "score": 2, "replies": []}]}, {"body": "Yet another episode of CHINA was right", "score": 2, "replies": []}, {"body": "we thought China had banking issues but look at what happens to us??", "score": 1, "replies": []}, {"body": "If China was concerned about privacy it was because they are not the ones invading it", "score": 1, "replies": []}, {"body": "Don’t have things that can track you if you’re worried about being tracked. I for one hope there’s someone getting paid to sit and watch my boring life", "score": 0, "replies": [{"body": "I hope I could get a job just paid to sit and watch someone’s boring life. Easy gig. Lol", "score": 3, "replies": []}]}, {"body": "China, number 1 in worrying about peoples privacy concerns…", "score": -1, "replies": []}, {"body": "We thought? Oh no, sweetheart, you thought.\n\nelon musk has the gadgets to spy on you and think won't use them?", "score": 0, "replies": []}, {"body": "Got damn you Telsa", "score": 0, "replies": []}, {"body": "Dog, you don't have to be China to realize that they'll misuse your info. \n\nSame with TikTok and China. People don't care though because of dancing videos.\n\nSame with Tesla. The car is fun so people don't care", "score": 0, "replies": []}, {"body": "Imagine what shady shit Facebook does.", "score": 0, "replies": []}, {"body": "This is an obvious Tesla hit piece because EVERY car manufacturer since about 2005 and certainly by 2010 has incorporated software which tracks your cars every move, speed, direction, usage, location and listens to you and your occupants conversations.\n  I personally think it's a part (there are other controls) of the reason the Gov keeps pushing EVs even though it is well established EVs are far worse for the planet than ICE powered vehicles.", "score": 0, "replies": [{"body": "Tracking? Different then sending back videos and audio. Even when the car is off/not in sentry mode.", "score": 1, "replies": []}]}, {"body": "Fuck China and musk", "score": -2, "replies": []}, {"body": "It’s not an issue… it’s there in the fine print. It’s intended. Buyer beware needs to be aware \n\n-tumadrelover", "score": 1, "replies": []}, {"body": "Remember the Alexa recordings?\nPeople are worried about the cameras on their car,-which is kept outside or in a garage, when your phone is with you in every room while you do EVERYTHING. Your PC sits in the corner of your room. Think of all the audio or video of you, that those phone hardware and software companies may have access to, all for the purpose of “improving the product” or targeting ads. \nSomeone on here will say “That never happens. It cant happen.” Are you sure?", "score": 1, "replies": []}, {"body": "Telsa? Is Frozen 3 being funded by Elon Musk?", "score": 1, "replies": []}, {"body": "So we going all in on NIO calls?", "score": 1, "replies": []}, {"body": "I honestly don’t care anymore… we’re already hopelessly fucked for having any sort of privacy. If you own a phone there are multiple companies with an entire build out of your life.\n\nIt doesn’t matter anymore. People need to just adjust to this being normal.", "score": 1, "replies": []}, {"body": "China is the king of spying. If they are suspicious you better listen.", "score": 1, "replies": []}, {"body": "But I mean, they gave consent to it…. Now if it’s a breach of contract then I get what the fuss is about. But if it is already agreed upon and no breach, then the complaining is rather adolescent.", "score": 1, "replies": []}, {"body": "I rented one last weekend and would never own one, the constantly being watched by cameras and all the outside one’s. I was able to see where everyone else who had rented one went and had video, very creepy. Deleted all my stuff but who knows I’m sure it’s somewhere.", "score": 1, "replies": []}, {"body": "Who thought China was being paranoid?  I think most sane people assumed Tesla could and would.", "score": 1, "replies": []}, {"body": "So they’ve definitely seen me doing laundry naked in my garage. That’s great", "score": 1, "replies": []}, {"body": "Yet people still use TikTok and drive around in Polestars", "score": 1, "replies": []}, {"body": "For you regards who don't know why China having a file on your kids would matter, I will tell you.  A file w all your kids friends, family and contacts w full text, chat, emails and calls is in that file. Their likes, thoughts, fears are in that file. Imagine a day when they grow up and have to fight a enemy who knows everything about them. God forbid they are captured and their guards know their family's names and where they are.  Think about that", "score": 1, "replies": []}, {"body": "It's Google Street Maps on steroids.", "score": 1, "replies": []}, {"body": "Can you turn off recording inside the car?", "score": 1, "replies": []}, {"body": "i didn't because i know this shit happens all the time. if a company has a way to spy on you they fucking are.", "score": 1, "replies": []}, {"body": "Car cover and an extra garage don’t seem too expensive for tesla owners", "score": 1, "replies": []}, {"body": "So the political Tesla hate is on I guess.", "score": 1, "replies": []}, {"body": "Game recognizes game", "score": 1, "replies": []}, {"body": "I don’t believe a major government bans something out of pure whim. Their agencies likely had Intel on what is going on and the capabilities of Tesla cameras.", "score": 1, "replies": []}, {"body": "You didn’t know? CHlN@ cares deeply about the privacy of their citizens", "score": 1, "replies": []}, {"body": "When will you see Tesla turn RED into BLUE? Thanks to “crazy” liberal put more funds on changing infrastructure.\n\nSomeday dollar bills state In MUSK we trust😉", "score": 1, "replies": []}, {"body": "China wasn’t worried about Tesla employees peaking at cameras numb nuts. China was concerned about a camera system and microphones on wheels rolling around government buildings.", "score": 1, "replies": []}, {"body": "Dude.. what the f do you think all those starlink satellites literally surrounding the entire globe now are? Really? Interwebs?🤣 US gov was just like.. yeah ok. Have at it, surround the world with space trash so people can check their reddit page in the middle of the sahara desert? Nah. You have no privacy and haven't for a long time. They are trying to legalize it now with the RESTRICT act. Teslas are smol pp problem compared to the the guy they told ya not to worry about🤣", "score": 1, "replies": []}, {"body": "Here comes the shorts![img](emote|t5_2th52|4271)![img](emote|t5_2th52|29093)![img](emote|t5_2th52|29637)", "score": 1, "replies": []}, {"body": "now we think Italy is paranoid about the whole world feeding a chatbot ai", "score": 1, "replies": [{"body": "Terminator has this in their latest movie", "score": 1, "replies": []}]}, {"body": "How can I request a video of me and wife in my model 3? I pitched a near perfect game that night at a super charger. I was like a Viking!", "score": 1, "replies": []}, {"body": "Thats what cameras are supposed to do, gather visual data", "score": 1, "replies": []}, {"body": "Of course they are right, they have all of the information!", "score": 1, "replies": []}, {"body": "So I should’ve kept my puts on Tesla and not sold on Wednesday of last week", "score": 1, "replies": []}, {"body": "There are a lot of tools to help you hide your identity online. But it's hard to hide from a fucking camera in your car.", "score": 1, "replies": []}, {"body": "Who's we, Lone Ranger?", "score": 1, "replies": []}, {"body": "When two 16 year olds have sex in a Tesla.....", "score": 1, "replies": []}, {"body": "And here i am still waiting for my cybertruck lol. Even the bus drivers are joking with me  because i keep telling them my truck is coming soon.", "score": 1, "replies": []}]}
{"title": "Tesla slammed with class-action lawsuit following report that employees internally shared private photos and videos taken from car cameras", "selftext": "", "id": "12gcxbe", "created_utc": 1681027452.0, "score": 2285, "upvote_ratio": 0.96, "num_comments": 247, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|4 months ago\n**Total Comments**|169|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "It’s a junker but at least my ‘08 Mercury Milan didn’t record me pissing in a McDonald’s cup yesterday", "score": 949, "replies": [{"body": "True true, but let me know if you want a copy brother, nice schmeat", "score": 216, "replies": []}, {"body": "Way of the road bud", "score": 72, "replies": [{"body": "Way of the road, bubs?", "score": 28, "replies": [{"body": "Greasy…", "score": 19, "replies": []}]}, {"body": "I todaso, I fuckin todaso", "score": 1, "replies": []}]}, {"body": "There wasn’t anything to see tho", "score": 10, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Name Checks out", "score": 7, "replies": [{"body": "It does…. I can verify.  I’m his cousin and my usual username is penishole_methlab", "score": 1, "replies": []}]}, {"body": "Not driving, but I live in a very rural area with very solid privacy vegetation. So yeah, I’m concerned about being sued by Tesla employees for inflicting mental anguish \n\n😳", "score": 1, "replies": []}]}, {"body": "ya but I did", "score": 4, "replies": []}, {"body": "Mine is an 02 Silverado. But it didn't record me getting head in my front seat and sent it to everyone at the plant.", "score": 10, "replies": [{"body": "“Yeah I have sex!”", "score": 28, "replies": []}]}, {"body": "Hell my 2012 cls559 doesn’t do that either old is golden", "score": 1, "replies": []}, {"body": "HEY. Don’t refer to my wife’s ass like that again buddy.", "score": 1, "replies": []}, {"body": "Would rather drive your Milan than an EV.", "score": 1, "replies": []}, {"body": "But I did ;)", "score": 1, "replies": []}, {"body": "How do you drive and hold your wanker with tweezers at the same time ?", "score": 1, "replies": []}, {"body": "It did, it's just that it isn't considered anything special for a Mercury driver so it wasn't shared around.", "score": 1, "replies": []}]}, {"body": "Elon fans can knock one out in the car while making eye contact with the camera knowing Musk will be watching. Bullish.", "score": 645, "replies": [{"body": "My god now I’m thinking of all the Tesla nerds savagely choking their chickens looking into the camera while whispering sweet sayings to Elon..", "score": 176, "replies": [{"body": "You didn't need to type that out.", "score": 37, "replies": [{"body": "Pound it out instead.", "score": 14, "replies": [{"body": "🤢", "score": 8, "replies": [{"body": "Make sure you don't on the keyboard!!", "score": 1, "replies": [{"body": "Don’t worry, wont make that mistake a third time", "score": 3, "replies": []}]}]}, {"body": "furiously.", "score": 3, "replies": []}]}]}, {"body": "[I hear the secret to getting blonde girls to put out, is to make out with them in Teslas while whispering in their ear \"Elon is watching\"](https://www.youtube.com/watch?v=HqPu6bdgULU)", "score": 35, "replies": []}, {"body": "I resemble this remark….except I keep trying to contact Franz instead", "score": 1, "replies": []}]}, {"body": "You cover yourself in shame and pretend you were just bending over to grab something. I suck my own dick in company wide zoom meetings. \n\nWe are not the same.", "score": 25, "replies": [{"body": "Got damn...", "score": 3, "replies": []}]}, {"body": "I’m pretty sure that’s the only way to assert your dominance with Musk. I think if we consider the transitive property, you may actually own twitter now, but IANAL so DYOR. Bullish AF though. \n\n*not financial advice* \n\n^Unless ^you ^make ^a ^profit. ^Then ^I ^want ^a ^% ^of ^your ^gains. ^Downside ^risk ^is ^entirely ^yours ^though", "score": 13, "replies": [{"body": "I ANAL too brotha.. I ANAL too.", "score": 13, "replies": []}, {"body": "PUT YOUR HANDS UP Grilledcheesus96!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 13, "replies": []}]}, {"body": "Good guy Elon watching out and keeping me safe while I succ so I don't die with my wife's boyfriends dick in my mouth . \n\n🐂 on TSLA.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -12, "replies": [{"body": "Oh so that makes it all ok then? The sun really shines out of elons arse doesn’t it? Wake up", "score": 5, "replies": []}]}]}, {"body": "I dont own a tesla, but I have walked by a few, and im kinda tall. So if it took a photo of me it would have been from below and unflattering, can I sue for big bucks?", "score": 182, "replies": [{"body": "Also I don’t want them recording me wanking on the car window", "score": 50, "replies": []}, {"body": "But seriously does anyone else like to put on a little show when the Tesla parked next to you gets uppity?", "score": 5, "replies": []}, {"body": "No. But your mom works the Tesla Supercharger lot, so if you can find her on pornhub.com getting railed [in a Tesla], you should have grounds.", "score": 4, "replies": [{"body": "Ty friend, just subbed and can now pursue charges.", "score": 2, "replies": [{"body": "$$$", "score": 2, "replies": []}]}]}, {"body": "Walking by a camera in public where there is no expectation of privacy? Good luck.", "score": -12, "replies": [{"body": "No it was on private property, not mine, I was just looking at things.", "score": 1, "replies": []}, {"body": "Still doesn't make it legal", "score": 0, "replies": []}]}, {"body": "Could you sue tesla and sue the car owner aswell![img](emote|t5_2th52|12787)", "score": 1, "replies": []}, {"body": "No reasonable expectation of privacy in public", "score": 1, "replies": [{"body": "No I was inside your garage, it was private property", "score": 0, "replies": []}]}]}, {"body": "How many of you regards were banging out prostitutes in your Tesla?", "score": 142, "replies": [{"body": "Besides the dude suing because his wife found out? Well I as doing lines off her backside; does that count?", "score": 73, "replies": [{"body": "\"backside\" what a gentleman", "score": 22, "replies": [{"body": "Is that code for asscrack?", "score": 12, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "User name checks out.", "score": 8, "replies": []}]}, {"body": "Only its the freebase form", "score": 2, "replies": []}, {"body": "Taint.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "![img](emote|t5_2th52|27189)![img](emote|t5_2th52|4271) This is the way", "score": 3, "replies": []}]}, {"body": "I forewent that opportunity when I optioned for white seats. 😂", "score": 0, "replies": []}, {"body": "About a bakers dozen and busted eleven-teen nuts", "score": 1, "replies": []}, {"body": "Yes, yes, banged many prostitutes in my Tesla and definitely not concerned about videos of myself recording myself with my iPhone defecating parked on the side of the highway and getting cheered on by passers-by.", "score": 1, "replies": []}]}, {"body": "Well, well, well. How can it be more ironic?\n\nhttps://youtu.be/hrHGK9AdWHQ\n\nWHAT HAPPENS IN YOUR TESLA, STAYS IN YOUR TESLA.\n\nYou can not make up such things.", "score": 23, "replies": [{"body": "the slob comments on that vid will not age well ;p", "score": 3, "replies": []}]}, {"body": "SLAMMED!!!\n\nEDIT: if any of you, regards are journalists, you need to substitute bodyslammed, DDT, pile drives, roundhouse kicked or some other combat sport term for slammed.", "score": 45, "replies": [{"body": "S l a m m e d", "score": 13, "replies": [{"body": "What else would you expect from business insider?", "score": 4, "replies": []}]}, {"body": "Tesla is dazed and confused by being SLAMMED so hard!", "score": 4, "replies": []}, {"body": "Da duh duh, da duh duh", "score": 2, "replies": []}, {"body": "RKO!", "score": 1, "replies": []}]}, {"body": "Now what ?", "score": 39, "replies": [{"body": "We send angry tweets for a few days then forget it ever happened.", "score": 158, "replies": [{"body": "That’s the American way", "score": 51, "replies": []}, {"body": "Unless you own a Tesla…\n\nYou’ll always wonder if anyone was watching when you put your wife’s fuckbuddy’s dead body in the car", "score": 25, "replies": [{"body": "Well guess what, how many amazon devices do you have?\n\nLmao so many people ignorant to the shit they have in their lives", "score": 9, "replies": [{"body": "But the difference is that Amazon doesn’t hide it. They explain [what data they collect and how they use it](https://www.amazon.com/gp/help/customer/display.html?nodeId=GX7NJQ4ZB8MHFRNJ). It should not be a surprise how much Amazon tracks you, but people don’t feel like reading 150 pages of legal documents to utilize a service based on convenience. \n\nOn the other hand, [Tesla’s privacy policy](https://www.tesla.com/en_eu/legal/privacy) explicitly states that data is not linked to a person/vehicle. On the website it literally says \n\n>Your in-vehicle experiences are also protected.\n\n The lawsuit is not about data and privacy. Its about Tesla’s misuse of their own agreement. Tesla owners agreed to having protected in-vehicle experiences, not having that data shared and spread around.", "score": 17, "replies": []}, {"body": "I have zero. And have my cameras covered in tape and bandaids so the NSA or State Police can watch me.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 6, "replies": []}, {"body": "Never will I have have an Amazon device .  No bullshit Elexa recording me bitch slapping my ho cause she said something to piss me off , and if her dad stands up and begins to shout , don’t want a recoding of the right cross that knocked his old ass out.", "score": 2, "replies": []}]}]}, {"body": "And then musk removes them.", "score": 2, "replies": []}, {"body": "Your tweets have been removed due to freedom of speech violations.", "score": 2, "replies": []}, {"body": "Sad and true", "score": 1, "replies": []}, {"body": "This is the way", "score": 0, "replies": []}, {"body": "Forget what?", "score": 1, "replies": []}]}, {"body": "Three years of litigation. Class certification would make stock drop; lack of certification will see at least a nominal rise. \n\nAfter a hit, we would see a couple years of litigation, and then a settlement. Traditionally, settlements make stock go up because the risk is handled (see J&J announcement about talc settlement leading to an immediate $5 rise)", "score": 3, "replies": []}, {"body": "Tesla CLAPS BACK with an answer to the lawsuit", "score": 1, "replies": []}]}, {"body": "Elon is gay", "score": 47, "replies": [{"body": "His simp army will attack you now", "score": 31, "replies": []}, {"body": "![img](emote|t5_2th52|27189)", "score": 3, "replies": []}, {"body": "They say ape can tell ape just like g4y can tell g4y", "score": 1, "replies": []}]}, {"body": "Guess what? Bullish", "score": 35, "replies": [{"body": "Yeah it was priced in, obviously.", "score": 3, "replies": []}]}, {"body": "Bullish!!", "score": 70, "replies": [{"body": "Tesla to $420 by the morning…", "score": 33, "replies": [{"body": "Yeah 4.20", "score": 20, "replies": [{"body": "4.20 =Gay Bear wet dream", "score": 14, "replies": []}]}, {"body": "Happy Cake Day!", "score": 2, "replies": [{"body": "🙏", "score": 2, "replies": []}]}]}, {"body": "Believe it or not... straight to bullish, 250 by EOM.", "score": 5, "replies": [{"body": "EOW would be nice.. Packing calls for the next two weeks.", "score": -1, "replies": []}]}]}, {"body": "Tsla puts are back on the menu", "score": 16, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Pfff 160? Try $69.\n\nThe crash will happen right before 2024 election", "score": 1, "replies": [{"body": "If it hits 69 I’ll sell everything else I own and just buy TSLA. Bring it back down to 130 for me plox", "score": 2, "replies": [{"body": "It won’t recover after that", "score": -2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 65, "replies": [{"body": "Google tells you that it's taking a peep.", "score": 24, "replies": [{"body": "Not really Gmail told me it wasn't putting ads from my scrapped Gmail stuff. So when I got an ad because of an email they be lying.", "score": 5, "replies": [{"body": "Hi - Professional marketer here: \n\nJust because it doesn't scrape your emails doesn't mean that there aren't other signals on the web that give away your interests. \n\nI can pretty much tell you what kind of car you drive, what your pets are, and where/when you might be interested in taking a vacation based on your buying habits.\n\nI might not know an individual's name, but I can learn a TON about someone just via Google/ LinkedIn / Meta.", "score": 13, "replies": []}, {"body": "Could have heard you over a microphone, pulled from elsewhere that you wouldn't think is connected, or got very lucky.", "score": 1, "replies": []}]}, {"body": "If I was a gambling man, I'd be there is disclosure in the paper work that Tesla is entitled to all recordings.", "score": 3, "replies": [{"body": "Could be, but what a sorry state we’re all in if so.. your own vehicle isn’t private unless you have a much older car … \n\ndo you know if other car companies state that they’re entitled to recordings? If so , that would likely also mean insurance companies.", "score": 2, "replies": []}]}, {"body": "You actually have to consent to sharing video with Tesla. It’s not enabled by default.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "No it’s not and that’s not what the article says. Only some versions of FSD require you to allow access but if you don’t want to then you just can’t use FSD. Many companies have in-cabin driver monitoring cameras. Tesla wasn’t even the first to do this. \n\nThis lawsuit is a fishing expedition to see whether anything was mishandled. We don’t even know what GM, Ford, or any of the other companies are doing with their camera data. They could be even worse given that they’re trying to monetize every scrap of customer data they get.", "score": 1, "replies": [{"body": "As someone who’s worked with ford in the past, they do collect a lot of information, but again this is all public knowledge and written out in the vehicle purchase/leasing agreement, as well as the fordpass app.\n\nYou can see in the Apple App Store what information is collected (which communicates with the vehicle). Ford vehicles can even be equipped with network capabilities now (cellular connection). The vehicle purchase/leasing agreements states they can collect; vehicle location, driving data, vehicle data, as well as audio/visual data.\n\nYou’d even be surprised how much information even the dealer collects on you before you’ve even signed any piece of paper. They use software such as CRM to database all your contact information, and can even use software such as ZoomInfo to see all your intent data (ie search data).", "score": 2, "replies": []}]}]}]}]}, {"body": ">Is this any different to what Google does to Gmail? Meta with photo scraping? Twitter with messages?\n\nYes there is. TSLA didn't include the fact that they have access to your camera and can watch what you're doing into their t&c, that is a very big difference. People already know what's going on and accepted it, those who didn't have tried or threatened to sue but it never even got to discovery because your own lawyer will just point the t&c out for you. Is it moral? No. Is it legal? Unfortunately. \n\nDon't like it? Get rich enough to lobby against it like how these companies lobbied for it.", "score": 32, "replies": [{"body": "They did, you have to opt in to sharing, unless you have the fsd beta, then it’s a requirement. So it’s def in “terms and conditions”.", "score": 12, "replies": [{"body": "Ah I see, looks like what got them is this\n\n>[Tesla states in its online “Customer Privacy Notice” that its “camera recordings remain anonymous and are not linked to you or your vehicle.” **But seven former employees told Reuters the computer program they used at work could show the location of recordings – which potentially could reveal where a Tesla owner lived.**](https://sg.news.yahoo.com/tesla-workers-shared-sensitive-images-172742259.html)\n\nPlus if your face is not auto blurred and could be seen, then it's already considered not anonymous at all despite what their own t&c say", "score": 21, "replies": []}, {"body": "Is this true with all recordings in cars?", "score": 1, "replies": []}]}, {"body": "You see, the flaw in your thinking is that's ok for billionaires to do what they want, so you should become one to do so.\n\nNo one should be able to do what they want because of money or power.", "score": -3, "replies": [{"body": "I didn't even imply any of that, but the fact that it's all you manage to infer is actually hilarious. The system is in place for you to deal with such issue, and that system involves you buying power with money. If you dislike it, then go out there and start a revolution from scratch with 0 logistics, money and connection.", "score": 6, "replies": [{"body": "\"Don't like it? Get rich enough to lobby like this companies did\". I think that's pretty clear.\n\nYes, I don't fucking like that. Because that allows the 0.1% of people fuck the other 99.9%. And unless you are on that 0.1%, you should be cheering for me, not for pieces of shit like musk.\n\nAnd I can't start a revolution because idiots like you get into climax by being jizzed in the ass by billionaires.", "score": -4, "replies": [{"body": "He’s not saying it’s right, just that it’s the cold hard reality of todays world.", "score": 3, "replies": [{"body": "Yet, accepts this reality as the only reality.\n\nI refuse to do that, and I'm getting backlash for it.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I would start with taxes on capital gains. Most billionaires are so because of equity.\n\nThen tax corporations, the fact that they're allowed stonk buybacks is a cheat code.\n\nThe central dogma should be to limit the ability to make money from someone else's work and reward your own work.\n\nAnd I don't think it's possible to separate them, that's why you have to distribute both power and money, to avoid getting it concentrated.", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I don't know tax law, but the fact that musk is the 2nd richest man in Earth because he owns tesla stonk says something is wrong. Either the law is wrong or not being applied. Same for corporate taxes.\n\nYes, I believe companies should share profits with employees. After all, the guy cleaning the floor all the way up to the CEO contribute to earnings. And of course you need a fair distribution of those profits and regulate outsourcing to avoid corporate shell companies that make the profits while the real company reports loses.\n\nI tell you, it's a rigged game. I'm a pawn, like you probably are too. But for some reason, most people believe in musk instead of their alikes.", "score": -1, "replies": []}]}]}]}]}]}, {"body": ">\"Don't like it? Get rich enough to lobby like this companies did\". I think that's pretty clear.\n\nYes having money is the first step to lobby, but you immediately assume you have to be a 1%er when politicians get bought off for less?\n\n>Yes, I don't fucking like that. Because that allows the 0.1% of people fuck the other 99.9%. And unless you are on that 0.1%, you should be cheering for me, not for pieces of shit like musk.\n\nCheering for a regarded keyboard warrior who can only vent his frustration at life in a gambling sub because he is negative ytd and looking for a way out of his miserable life hoping market finally crash with multiple postings of 2008 vs 2022 comparisons? Realize the diff between economy and market before you respond, you are too much of a moron to have this much ego.\n\n>And I can't start a revolution because idiots like you get into climax by being jizzed in the ass by billionaires.\n\n\"I must wait for others before I can do something\", just stop embarrassing yourself and say you're a bitch. You say so little and I can already assume how much of a loser you are. You won't be any different from the rich people if you have money as well, this is basically a cliche. All the \"socialists activists\" who got money magically stopped doing anything but tweeting and doing mini protests to keep the donations going, but hey keep blaming others for the reason why \"you can't start a revolution\".", "score": 2, "replies": [{"body": "You really dedicated so much time to check all my posts and write that long reply?\n\nI must say... I'm kind of flattered.", "score": 2, "replies": [{"body": "It takes a few second to click on your profile and click 'submitted' tab, this kind of sarcasm just makes you look extra regarded. Keep holding onto your ego, it's pretty obviously it's the only thing you have left even though it's as worthless as your expired puts.", "score": -2, "replies": []}]}]}, {"body": "Okay so it’s a capitalist forum for stocks so great yeah whatever.\n\n\nThis is a guy asking how is this data inspection any different from Gmail et cetera.\n\nPossible answers: photos versus typed letters, metadata versus literal photos…\n\nStupid Answers: Qualified legal advice, unhinged high school rants against capitalism.", "score": 0, "replies": [{"body": "I'm pointing at a phrase that invalidates his post, to my point of view.\n\nThe fact that many believe the paradigm that having money allows you to bully, sorry lobby, the rules is capitalism; is a twisted vision of things.\n\nBut what can you expect from someone defending tesla for spying on people without their consent.", "score": 1, "replies": []}]}]}]}]}, {"body": "You have to opt in to sharing in-cabin video with Tesla, so not sure what you’re talking about. Fake news! 😂", "score": 1, "replies": []}]}, {"body": "I think the issue is Snowden tried to expose the government. Antitrust is slow and too often indifferent but occasionally will actually go after companies.\n\nTesla has been a long overdue target.", "score": 5, "replies": []}, {"body": "The difference is Tesla got slammed.", "score": 9, "replies": []}, {"body": "Yeah different Eula agreements about what’s being recorded.  You are definitely in the right place for your investing needs though. Should fit right in.", "score": 2, "replies": []}, {"body": "That’s my favorite Weird Al song - “I didn’t finish all my food…”", "score": 1, "replies": []}, {"body": "Google doesn't do that with Gmail though", "score": 0, "replies": []}, {"body": "Waiting on this to happen with Ring cameras and such.", "score": 1, "replies": []}]}, {"body": "WTF BRO I JERK MY CAWK IN MY TESLA BRUH", "score": 3, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "So don’t sell?", "score": 1, "replies": []}]}, {"body": "Here comes all the bearish articles over the weekend as the market enters double top", "score": 10, "replies": []}, {"body": "The lawsuit is on the ropes. Bodyslam!!!\n\nThe people who make these headlines are stupid", "score": 11, "replies": [{"body": "Why is the lawsuit “on the ropes”? All I see is a class action based upon an alleged but not unconvincing breach of privacy by Tesla. It won’t be the end of the company or even a substantial hit on profits but it’s certainly not implausible now, is it?", "score": 6, "replies": [{"body": "I was making a reference to when people use shit like \"slams\" in the title of article. It had nothing to do with the content. The lawsuit won't \"slam\" anyone. It will be litigated and probably settled for $300k and the attorneys will take 40% and the world will go on.", "score": 4, "replies": [{"body": "I don’t know at what amount it will settle - depending on circumstances it could be substantially more - but as I said it won’t in any case have serious impact on Tesla. Except maybe publicity is not the best from this.\n\nI understand your point about headlines. Typical clickbait.", "score": 0, "replies": []}]}, {"body": "Because it's one guy suing on behalf of all owners.\n\nThe way class action lawsuits works,  is that one person files suit and says lots of people are angry. \n\nJudge then says, okay,  bring me all these people. \n\nGuy comes back with all the angry people and the actual lawsuit can proceed. \n\nWe're still on step 1. \n\nIt's not an angry mob. It's just 1 guy.", "score": 2, "replies": [{"body": "Thats not at all how it works. At least Google something if you're going to pretend to know it. \n\nTesla will remove to federal court and file a motion to dismiss. If the complaint is properly plead, it will proceed. \n\nTesla then will oppose a motion for class certification on the basis that there are individual issues that override common questions of law or fact. If Tesla loses that, they'll go to mediation and settle. \n\nAt that point, the class will be administered and other class members will be notified and sign up to join. Then the court will approve the settlement. \n\nThe biggest hurdle for the plaintiff is CA district courts love to strike down privacy claims for a lack of article III standing for failure to plead actual injury.", "score": 4, "replies": [{"body": "I bet you're really popular at parties", "score": 1, "replies": []}]}, {"body": "Well, that’s SOP for a class action so I don’t see it as on the ropes in any way. OP said he wanted to comment on the baity headline and that’s understandable", "score": 1, "replies": []}]}]}]}, {"body": "Damn if I knew my car was recording me at all times only to be sent to some third party that’s a huge invasion of privacy", "score": 3, "replies": [{"body": "It likely is", "score": 2, "replies": []}]}, {"body": "What did you think would happen with cameras in your vehicles?\n\nThink about all the other cameras and mics throughout your household.  You are an ignorant fool if you think this isn't happening everywhere.", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 1, "replies": []}]}, {"body": "Slammed or not idc. Buying tsla.", "score": 3, "replies": []}, {"body": "Can't wait to buy some more tsla short 😍 fuck elon and everyone who cucks for him", "score": 22, "replies": [{"body": "I bet you TSLA gonna be green this week 😂 just the nature of the sport", "score": 9, "replies": []}, {"body": "I was just about to say puts on Tesla following the news. 😅", "score": 5, "replies": []}, {"body": "![img](emote|t5_2th52|27189)", "score": 2, "replies": []}]}, {"body": "Que surprise", "score": 6, "replies": [{"body": "*quelle", "score": 11, "replies": [{"body": "Yes. That is correct.\n\nThank you.", "score": 0, "replies": []}]}, {"body": "Con carne.", "score": 0, "replies": []}]}, {"body": "Glad I always check to see that there's no Telsa parked by the dunpster at Wendys when getting a handy.", "score": 4, "replies": []}, {"body": "Bullish.", "score": 2, "replies": []}, {"body": "The only sex in a car y’all having is with your hands and it shows.", "score": 2, "replies": []}, {"body": "It’s not like the car is your smart phone or doorbell camera!", "score": 2, "replies": []}, {"body": "Is that hard to store the data only on the car and make it delete automatically every 2 days?", "score": 2, "replies": [{"body": "They can't sell it and use it to manipulate your purchases and political tendencies unless they take it.", "score": 1, "replies": []}]}, {"body": "So stocks down the toilet tomorrow?", "score": 2, "replies": []}, {"body": "**SLAMMED**", "score": 2, "replies": []}, {"body": "Where’s the Homer Simpson meme backing into the shrubs (*as apple)", "score": 2, "replies": []}, {"body": "This has potential to be a massive invasion of privacy lawsuit. Nothing will come of it, of course, but it has potential.", "score": 2, "replies": []}, {"body": "If you really wanna print those puts get a Tesla brand fappening to happen.", "score": 2, "replies": []}, {"body": "Quick do something hilarious with Twitter!", "score": 2, "replies": []}, {"body": "There is nothing going on exciting in my car so feel free to record all you want", "score": 2, "replies": []}, {"body": "Tesla employees making OnlyFans accounts and uploading these videos", "score": 2, "replies": []}, {"body": "People who are long tesla are delusional idiotic cultist freaks who are obsessed with Elon and wanna suckle his musky nuts", "score": 2, "replies": []}, {"body": "SLAMMED!!!!!!!", "score": 2, "replies": []}, {"body": "I’ve stopped reading articles with “slammed” in the title", "score": 2, "replies": []}, {"body": "Sounds like a signed confessional list of people doing horny things in their car.", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 2, "replies": []}]}, {"body": "Yo, I have watched Suits I know what this is", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|29637)", "score": 2, "replies": []}, {"body": "so tesla will rally soon.. gotcha", "score": 2, "replies": []}, {"body": "Lemme get this straight.  \n- You overpay for a poorly built car.  \n- You pay $15,000 on top of that for the right to pay $199/month for an AutoPilot that you have to constantly baby-sit if you don't wanna crash.  \n- on top of that Tesla knows exactly where you're going all the time.  \n- on top of that you have your private pictures allegedly shared among Tesla employees.  \n\nAll of this for the kick of going 0-60 in 3 seconds every now and then and showing off with your friends once.  \nDo I get this right?", "score": 2, "replies": []}, {"body": "start of another targeted attack to bring the stock price down to $100 ?\n\n![img](emote|t5_2th52|29093)", "score": 5, "replies": [{"body": "Take it to $50 and I’m all in", "score": 5, "replies": []}, {"body": "Why targeted if musk is the one jerking off to people being watched?", "score": 1, "replies": []}]}, {"body": "People mad about this, but will still TikTok. Something about cake and eating [blatant political incorrectness, swear words] *goes on for five more paragraphs*\n\n¡Dies!", "score": 2, "replies": []}, {"body": "Apparently someone doesn’t share Titter me Elmo’s humor", "score": 1, "replies": []}, {"body": " Wait are there internal cameras (showing the cabin) on a Tesla? I’m confused", "score": 1, "replies": []}, {"body": "Love it 😍", "score": 1, "replies": []}, {"body": "I wonder if they have the video from my girlfriend giving me road head. Best I have ever gotten and genuinely interested in a copy lol", "score": 1, "replies": [{"body": "Yea I saw it. She used too much teeth", "score": 1, "replies": [{"body": "If you’re into that, it was just enough. Stop being a pussy.", "score": -5, "replies": []}]}]}, {"body": "Whoopsies", "score": 1, "replies": []}, {"body": "Tesla's employees allegedly violated personal privacy, which is unethical and illegal. Tesla should take immediate steps to ensure that its employees comply with ethics and laws to protect the privacy and safety of its customers. At the same time, it should strengthen its regulatory and punitive mechanisms to ensure that similar incidents do not occur again. Otherwise, it will have a huge impact on the stock price.", "score": 1, "replies": []}, {"body": "As a Tesla owner, they need to held accountable and forced to implement strict privacy controls. So the car can become that much better.\n\nBut really, I just hope they don’t leak my hours-long visits to the Wendy’s in the neighboring town. I swear it’s worth it so I can afford my Tesla", "score": 1, "replies": []}, {"body": "This guy Henry yeh is like a professional victim/plaintiff in frivolous civil suits that get thrown out by the judge. Google his name and youll see. In this complaint the only claim he has against Tesla is that he bought and took delivery of one in February 2022. He has no evidence that he is an actual victims of sensitive videos being leaked to and by Tesla employees.\n\nEdited to add: LOL he just sued Twitter like two weeks ago for selling his info to advertisers without his permission. He’s just looking for handouts. It also looks like $900k was seized from him by the feds from his Charles Schwab account if I’m reading it correctly.", "score": 1, "replies": []}, {"body": "I’ll never buy a Tesla because of privacy concerns. Elon is cool and all, but it doesn’t change the concerns of a lot of people. So this isn’t surprising.\n\nEdit: Guys we can like a guy and disagree with him on a lot can’t we? Why are we turning tribal here?", "score": -5, "replies": [{"body": "Elon is in no way cool.", "score": 10, "replies": []}, {"body": "You had my upvote until the \"elon is cool\".", "score": 5, "replies": []}, {"body": "What’s cool about Elon allowing Russian trolls on twitter and being a right wing conspiracy theorist who hangs out with Ken griffin and Fox News owner?", "score": 3, "replies": [{"body": "I don’t understand how this is political? But if you want to make it so, so be it. Because to anyone that’s not political like myself, it’s quite obvious that leftism is a mental illness at this point. I am an ex democrat. Or are you telling me they are doing a great job out in Washington? They managed to destroy the economy, push degenerate ideologies and get the dollar to collapse and to no longer be the worlds reserve currency all in a single term presidency. And the division of the country is beyond repair in my view. Or is that a conspiracy theory too?", "score": -4, "replies": [{"body": "Yes all of that is a conspiracy lol exactly nothing you said is provable just more culture war BS.", "score": 1, "replies": []}]}, {"body": "Simp", "score": -3, "replies": [{"body": "Coping much? Found the Elon simp.\n\nHow much are you down? You should sell before TSLA is $69", "score": 3, "replies": []}]}]}]}, {"body": "So let’s say I got a hummer or 7 in my Tesla can I automatically sue even if I don’t actually know if they viewed it?", "score": 0, "replies": []}, {"body": "Getting calls", "score": -1, "replies": []}, {"body": "Look what happens when someone bucks the system. Tesla has been riddled with legal action since Elon ousted the political works for colluding with Twitter.", "score": -1, "replies": []}, {"body": "Sue the pervert likely leftists employees not Tesla wtf", "score": -1, "replies": []}, {"body": "Wonder if they were watching the girl filming porn while in a tesla that was self driving.", "score": 1, "replies": []}, {"body": "Bet theyre sharing pics of Elong's dong too", "score": 1, "replies": []}, {"body": "Watch TSLA moon tomorrow just to slam everyone with common sense & brain! Boolish AF! ![img](emote|t5_2th52|29093)", "score": 1, "replies": []}, {"body": "Foresight to create an offensive litigation team... not paying dividends. Perhaps he saw legal costs are mounting and needed cash flows.", "score": 1, "replies": []}, {"body": "So…calls right? Market gives 0 fucks about controversy surrounding musk.", "score": 1, "replies": [{"body": "Market doesn’t care about lawsuits Lmao. IV still low on calls for earnings.", "score": 1, "replies": [{"body": "Search Tesla Lawsuit or Musk lawsuit and see just how often similar things are posted. For a normal company, there may be a reaction when the lose (3M for example) but Tesla has no attributable reaction to these types of things.", "score": 1, "replies": []}]}]}, {"body": "How can you sue if they didn’t share your photos?", "score": 1, "replies": []}, {"body": "How do I get in on this?", "score": 1, "replies": []}, {"body": "\"slammed\"", "score": 1, "replies": []}, {"body": "Well, the only time I’ve been in a Tesla the owner was playing porn on the screen the whole time. While speeding. \n\nGood luck to him.", "score": 1, "replies": []}, {"body": "Relax.  Unless your Wang is a stunning 12 inches erect, you won't be going viral any time soon.", "score": 1, "replies": []}, {"body": "\"slammed\" lol looks like we know who bought puts before he put the article out", "score": 1, "replies": []}, {"body": "We are seeing an uptick of California-only class actions because of how consumer friendly California laws are. E.g. Mattel and Fisher-Price over advertising the sometimes lethal rock and play (the MDL is in the Western District of New York, but that’s just a procedural mechanism; the CA class has already been certified, and they are trying a NY class now too).\n\nEver since California made privacy/data breach issues have a minimum statutory damage of $100, max $800 (that’s absent proof of other damages mind, it supplements and does not replace actual damages) I have been eagerly waiting for the class fall out. Normal data breach classes are valued at $1 or less per person; when one sticks, it could be worth billions.", "score": 1, "replies": [{"body": "$800 max with proof is nothing for this. I think this law protects the companies more if that’s the max penalty or is this similar to the “do not call” and spam calls law? If it’s a penalty on top of everything else that’s great , but not alone.", "score": 1, "replies": [{"body": "$800 max *without* proof.  Per person. So when these 20M person classes come around, dollars are suddenly very high", "score": 2, "replies": [{"body": "I see. Thanks for the clarity~ I misread", "score": 1, "replies": []}]}]}]}, {"body": "Elon probably set up a new category on the hub Fake Tesla", "score": 1, "replies": []}, {"body": "Wouldn't engineers/developers need that kind of data to deal with issues in production? This seems like a non issue if everything is internal", "score": 1, "replies": []}, {"body": "This is good for Bitcoin.", "score": 1, "replies": [{"body": " ???", "score": 1, "replies": []}]}, {"body": "So no more doing 8 balls off the dash at 80 miles an hour while listening to the Weekend?", "score": 1, "replies": []}, {"body": "Wonder if he’ll just tweet a poop 💩 emoji…", "score": 1, "replies": []}, {"body": "Sooo.... Like I walked by a Tesla and it started recording me. I didn't consent to it. Free tendies?", "score": 1, "replies": []}, {"body": "PUTS TO TANK ERON", "score": 1, "replies": []}, {"body": "Where are the blind spots? I’d like to watch porn in peace!", "score": 1, "replies": []}, {"body": "Where do I see said photos", "score": 1, "replies": []}, {"body": "Users opt in to share it. case closed. try something else dumbfucks", "score": 1, "replies": []}, {"body": "Auto PornHub Live", "score": 1, "replies": []}, {"body": "Where is the substance? Seems all hearsay....\n\n *»Reuters wasn’t able to obtain any of the shared videos or images, which ex-employees said they hadn’t kept.«*", "score": 1, "replies": []}, {"body": "If only internal, no big deal.", "score": 1, "replies": []}]}
{"title": "Tesla to build Shanghai factory to make Megapack batteries - Xinhua", "selftext": "", "id": "12go0l1", "created_utc": 1681057571.0, "score": 265, "upvote_ratio": 0.86, "num_comments": 155, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|1 month ago\n**Total Comments**|121|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "In unrelated news, Chinese car battery technology leaps to parity with west.", "score": 180, "replies": [{"body": "[deleted]", "score": 78, "replies": [{"body": "Why do you think Musk tows the Chinese line so hard?", "score": 5, "replies": []}, {"body": "Musk knows where to keep his boundaries…twitter has been banning and censoring accounts of modi critics in india and most of his free speech cult probably don’t even know about it(https://www.theguardian.com/world/2023/apr/05/twitter-accused-of-censorship-in-india-as-it-blocks-modi-critics-elon-musk) … few weeks ago when covid lab leak report came out and musk was commenting on some posts, china came out and gave a warning to musk and he hasnt commented on any of those posts since then.(https://fortune.com/2023/03/01/elon-musk-free-speech-twitter-tesla-china-covid-wuhan-fauci/amp/) … he shared conspiracy theories about the husband of a sitting us speaker and later deleted it…constantly disparages us president and democratic party and yet hes freely allowed to operate and his companies still get govt subsidies…if he was operating in china and does any of those things in china..forget what happened to jack ma, he would probably be given bo xilai treatment. He has abused the freedom and free spech hes granted and is somewhat responsible for the extreme polarization and division we seen in this country.", "score": 38, "replies": [{"body": "Free speech is there so that you can talk trash about a government. There isn’t a point to having free speech if everyone only says pleasant things about a government. Musk talks crap about US politicians and government because we are able to here. Otherwise, you’re basically rooting for state clamping down on what you say, especially about the state itself (China, India, etc)", "score": 10, "replies": [{"body": "I am not saying elon should not be allowed to trash talk about govt..i understand banning any kind of speech(except hate and violent speech) is a slippery slope and it could easily be weaponized by ideological groups..however there is a difference between free speech and amplifying misinformation.when elon spreads conspiracy theory about pelosis husband, there are consequences to it..pelosis could sue him for defamation. Elon has 130m+ followers on twitter, his cult looks up to him and believes whatever he says..when he interacts with obvious conspiracy theory and misinformation peddlers accounts like kim dotcom, ian miles cheong, catturd..he bears some responsibility and has consequences in the society..kimdotcoms account has exploded after elon started interacting with his posts. I suggest you go look at his tweets, the guy is constantly peddling anti american conspiracy theories and many people start believing it even if its false. Let me ask you..do you think everything you believe is truth? I don’t think so…every person in their life at some point will believe in something false/misinformation…most people are bad at identifying misinformation or digging deep when they read something on twitter. Misinformation can be effectively used to create polarization and division in a society and that is exactly what russia and china are doing on twitter(read art of war or watch yuri bezmenovs kgb speech on youtube).", "score": 8, "replies": [{"body": "You are part of the problem if you think banning \"hate\" speech is acceptable. Who defines hate? It is yet another move in the long line of eroding freedoms and mobile goalposts. Western culture is going to get absolutely fucking railroaded at some point in the future when the next superpower (or conglomerate) emerges in a true total war fashion. Might not be the next 10 , 20, or 50 years, but it is coming. The West is in decline as a whole and it is comical to watch", "score": 6, "replies": [{"body": "What a fucking tangent", "score": 5, "replies": []}, {"body": "Sure..i can see how who gets to define hate speech can be a slippery slope but do you think threating to kill somebody or their family should be allowed? What if somebodys hate speech leads to a riot or some violent crime? Every society has rules and laws to maintain peace and harmony…balancing those laws without eroding fundamental rights can be a delicate process sometimes.", "score": 1, "replies": [{"body": "Bro, define “Hate” speech. Because dumb people with zero emotional intelligence riot. Source: Cipolla’s 5 laws of human stupidity. I consider it hate speech when I eat shit on my options play and you all make me feel bad about myself.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "He tends to follow domestic laws where he operates.", "score": 4, "replies": []}, {"body": "They won’t need him soon, they must have reverse engineered anything useful. Probably left the autonomous software for someone else", "score": 0, "replies": []}]}, {"body": "Batteries have always been from China. CATL lol. Even the new giga factory by Ford will be paying licensing fees to CATL... because it's their batteries.\n\nAt this point in time, CATL runs this show because the price to quality ratio is there. There are better quality battery options out there... but not worth the price... at the moment.\n\nTesla is doing the Ford thing but even cheaper, at the risk of future potential geopolitical issues.\n\nMan's a gambler too.", "score": 8, "replies": []}, {"body": "In unrelated news, Chinas Twitter account is now free to do whatever the hell it wants.", "score": 21, "replies": []}, {"body": "As someone who actually works in academic battery research in the US, China battery technology is already better than the US in at least some areas lol. Our collaborators had to stop ordering battery supplies from China due to new regs, and everything they tried from US companies is crap compared to Chinese staff. Not sure about car batteries specifically tho, I mainly work with \"promising\" batteries for grid storage.", "score": 15, "replies": []}, {"body": "China is eventually just going to steal his factory. I can’t believe that we allow this guy to put everyone else in danger just so he can father a horde of useless kids.", "score": 31, "replies": [{"body": "yep. a lot of companies will just forfeit their buildings in the contract. it will be something like 5 years , which is enough for whatever product they are trying to mass produce and make money on then China takes control and the company leaves.", "score": 16, "replies": [{"body": "I cannot believe that you westerners are this blinded by Western Media Propaganda", "score": -13, "replies": [{"body": "I work for a company that handles the negotiations. I cannot believe that you from wherever you are could be so naive. This is a common and known practice. it's business as usual. stop being silly.", "score": 13, "replies": [{"body": "What company is it if i mind asking?", "score": -3, "replies": [{"body": "will not say. but we are pretty small compared to others.", "score": 2, "replies": []}]}, {"body": "Ahhh the BAU card. Mind telling me how long Apple has operated in Zhengzhou and how long CCP has confiscated those factories? How about Airbus in Tianjin? BMW in Shenyang? Mercedes in Beijing?\n\nYou working for whatever 8-digit annual revenue fifth-tier firm operating out of Des Moines Iowa doesn’t give you a say in matters concerning complex global supply chains.", "score": -10, "replies": [{"body": "Me working for such a company that does handle these kinds of contracts does give me a say. did I say I worked for Apple or BMW? you are oddly triggered when this is a common practice.", "score": 3, "replies": [{"body": "\"These kinds of contracts.\"\n\nTrust me bro. Lmaooo. \n\nYou can reserve your energy on commenting about BBBY's global expansion ambition.", "score": -1, "replies": [{"body": "ah. I see you are a Towel boy. i'm sorry your piece of shit \"investment\" dropped 90% in 3 months or whatever it was. no need to rage in WSB though.", "score": 1, "replies": [{"body": "You're a funnily curious guy. Having the bravery to \"make a fortune\" on Bobby but not the guts to admit it?\n\nOr are you simply battling with dementia and not remembering a thing at all?\n\nThere there.", "score": -2, "replies": [{"body": "I guess you can come to any conclusion you like. doesn't really bother me.", "score": 3, "replies": [{"body": "I’m not surprised. Enjoy your imaginary China connection, boardgame/WSB/pcgame boy.\n\nWish you a speedy recovery.", "score": 1, "replies": [{"body": "mmhmmm. I am fake because I don't post in mmc or sports? is that what you mean you pom ? childish.", "score": 3, "replies": [{"body": "Finish your community college degree first before your dementia fully takes over man.\n\nBest of luck there.", "score": -1, "replies": [{"body": "ah the ego of the internet. it's a shame how quickly it infects the youth. take care child.", "score": 3, "replies": [{"body": "Your dementia giving you Parkinson's affecting your remaining fingers senor?\n\nQuite a pity.", "score": -1, "replies": [{"body": ";) it's nice knowing i'm right.  take a seat kid.", "score": 2, "replies": [{"body": "How does it feel holding Bobby while not even a GED senor?", "score": 0, "replies": [{"body": "yeah I don't actually own any Bobby. nice try though. go deeper bro. I love how I am wasting your time right now. ;)", "score": 1, "replies": [{"body": "Not at all dementia high school grandpa. I'm waiting for you to delete your posting history lmao.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I can’t believe you capitalize random words", "score": 3, "replies": []}, {"body": "nice try elon", "score": 2, "replies": []}]}]}, {"body": "Lol no, China likes foreign investment", "score": -8, "replies": [{"body": "Yes but they have also hosted a lot of hostile takeovers. They also stop investments from leaving the country. Investors have a love/panic relationship with China.", "score": 3, "replies": []}]}]}, {"body": "Where do you think Tesla is getting their cells from?", "score": 9, "replies": [{"body": "Kids forced to work at gunpoint in the Congo. The American way.", "score": 14, "replies": [{"body": "The Tesla models built in China is all using the heavier less energy dense cobalt free battery chemistry LFP. Very likely the new storage is using LFP too.", "score": 11, "replies": [{"body": "Is this some of that awesome Tesla battery tech I’ve been hearing so much about?", "score": 1, "replies": [{"body": "Actually it is Chinese tech Tesla is buying from CATL, BYD others. Tesla is keeping their proprietary battery manufacturing in US and Europe.", "score": 4, "replies": []}]}]}]}]}, {"body": "LOL what fantasy world do you live in where you think the west has better car batteries than China?", "score": 8, "replies": []}, {"body": "Typical white superiority mentality. Tesla don't even make any lithium battery cells until recently, and its performance is very meh so far. BTW Megapack use battery cells from a Chinese company.", "score": 2, "replies": [{"body": "Not white dick hole", "score": 0, "replies": []}]}, {"body": "China is already ahead with electric batteries, CATL is a world leader in the technology.", "score": 5, "replies": [{"body": "Sounds like they’ve been able to do wonderful things with all the IP they’ve stolen.", "score": 2, "replies": []}]}, {"body": "Lolwut.", "score": 1, "replies": []}, {"body": "You mean the west tries to catch up with china, stupid racist", "score": -1, "replies": []}, {"body": "We need to turn our Indian reservations into manufacturing hubs!", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 0, "replies": []}, {"body": "No fun in that. Whorehouses is what’s needed", "score": 1, "replies": []}]}, {"body": "In related news Musk is a Chinese and Russian asset.", "score": 1, "replies": [{"body": "I see him like Trump. He’s for himself first and foremost and will work with whoever if it gets him ahead.", "score": 2, "replies": []}]}]}, {"body": "Can’t wait for Musk to tweet something like, “man, I wish American labor laws let me force workers to work for 20 hours straight with no rest. Chinese workers love their jobs!”", "score": 68, "replies": [{"body": "I believe he has already said this:\n\n“There is just a lot of super talented hardworking people in China who strongly believe in manufacturing. They won’t just be burning the midnight oil, they will be burning the 3am oil, they won’t even leave the factory type of thing, whereas in America people are trying to avoid going to work at all.”", "score": 53, "replies": [{"body": "I love this man", "score": -35, "replies": [{"body": "Why?", "score": 9, "replies": [{"body": "He makes me money, $TSLA been very good to me", "score": -22, "replies": [{"body": "Fair ![img](emote|t5_2th52|12787)", "score": -1, "replies": []}]}]}]}]}, {"body": "Love or hate china, but at least they get shit done. Yeah momentarily their progress is built on the exploitation of cheap labor. But no one will care how they achieved \"china numba one\" in a few years. Coming generations will reap the benefits of all the tech and infrastructure.", "score": -22, "replies": [{"body": "You forgot the monumental amount of IP theft as well", "score": 15, "replies": []}, {"body": "Yeah except that's not how a highly capitalist economy like China operates. They depend on endless growth and bodies to support that. Why do you think they're always propping up their labor with construction projects and having kids assemble your iPhone.\n\nThe coming generations won't reap shit unless they're in the upper echelons.", "score": 3, "replies": []}]}]}, {"body": " Can’t wait to see what the tech and geopolitical experts say in the comments.", "score": 28, "replies": [{"body": "Belive it out not, straight to jail", "score": 17, "replies": [{"body": "But but but…", "score": 2, "replies": []}]}, {"body": "The amount of Tesla news that has occurred this weekend is silly. Cutting prices again, more car video recordings released, now this new battery factory in China. If the market was open over weekend the stock would have tanked then mooned already. I literally have no idea what it’ll do when it opens but it’s gonna be provocative", "score": 5, "replies": []}]}, {"body": "So now China will get to see all private customer videos.", "score": 15, "replies": [{"body": "Yeah but I might finally be able to afford one 😅\n\nJust a little duck tape here and there…", "score": 2, "replies": []}]}, {"body": "Musk will never say anything about the CCP taking away people’s right to free speech.", "score": 22, "replies": [{"body": "Musk's not going to jeopardize Tesla's China factory, and it's significant contribution to fighting climate change, just to bitch at the Chinese gov, which has zero chance to produce results.", "score": 3, "replies": []}, {"body": "as well as about slave labor and forced organ harvesting", "score": 1, "replies": [{"body": "Don't forget poor Uyghurs", "score": 2, "replies": [{"body": "yeah, it’s what I meant", "score": 2, "replies": []}]}]}, {"body": "Of course he won't, he's not an ideologue, he's an oligarch. Nor is free speech a right in china.\n\nMusk no more cares about the average Chinese person than he cares about a fly. If you're looking to musk to drive social  change in china you're very much looking in the wrong place.", "score": 1, "replies": []}]}, {"body": "French President Macron visits China.  Tim Cooks is going.  Elon will visit this year too.  China stopped the war between Iran and Saudi.", "score": 6, "replies": []}, {"body": "It is now chinas mega factory", "score": 3, "replies": []}, {"body": "TSLA 300 EOW", "score": 10, "replies": [{"body": "If that happens I can retire lol", "score": 4, "replies": []}, {"body": "It's going up, not sure by EOW. I want to buy a bunch of shares but now too worries it's going to open sky high. Maybe the price cuts will keep it down a little.", "score": 0, "replies": []}, {"body": "Hope it’s 220s this week", "score": 0, "replies": [{"body": "Hmmm, not looking good so far", "score": 2, "replies": []}]}]}, {"body": "Release the bad news at the beginning of a long weekend (price cuts), and the good news right before the market opens", "score": 2, "replies": []}, {"body": "Is there any kind of estimate on how much energy storage the world has versus needs?", "score": 5, "replies": [{"body": "Yes.", "score": 24, "replies": [{"body": "Good to know.", "score": 10, "replies": []}]}, {"body": "Less than 0.1% of  the storage needed.", "score": 2, "replies": []}, {"body": "Here you go. This is a link to Tesla Master Plan Part 3. The first link on the page is to a pdf that describes the plan and the other 2 links are to the supporting data.\n https://www.tesla.com/blog/master-plan-part-3", "score": 1, "replies": [{"body": "Ah, thank you.", "score": 1, "replies": [{"body": "You might want to start at the beginning with Tesla Master Plan. Here's the link. https://www.tesla.com/blog/secret-tesla-motors-master-plan-just-between-you-and-me\nThen move on to Tesla Master Plan Part Deux. Here's that link. https://www.tesla.com/blog/master-plan-part-deux\nPay attention to the dates and you will learn the reasons behind the formation of Tesla. Since this is wallstreetbets I feel the need and opportunity to let you all know that Tesla has an overarching mission to bring the world to a sustainable and renewable energy future. Of course they need to be profitable to accomplish the mission but it's worth noting Tesla is different than any other corporation in that profitablity is not their number one goal. This is why Tesla will be able to drive down the cost of their vehicles more than and faster than the rest of the industry.", "score": 1, "replies": [{"body": "It’s a good mindset. Thanks!", "score": 1, "replies": []}, {"body": "fuck /u/spez", "score": 1, "replies": [{"body": "Of course they have to be profitable. I am stressing that it is not their number one goal. IOW, Tesla needs to be profitable enough to satisfy the capital needs necessary to meet their actual goal of turning the entire world towards renewable and sustainable energy production, i.e., every battery produced by them or any other will be used to further their mission. This one fact is what so many Tesla bears do not realize. Oh and while I'm at it, I might as well opine that Tesla will not be issuing any stock dividends as long as they can put their profits to good use scaling the corporation anywhere they need to. And that reminds me that Tesla has already stated they are spending their profits as fast as they can and this too is another reason they are so different than the other corporations in their industry.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Keep on handing that IP over to China.", "score": 6, "replies": []}, {"body": "Another big Corporation taking the jobs away from their own, & taking them somewhere they are able to pay lower wages, & no Healthcare. Hence, allows alot of things to happen, however the two I think that are up there is #1, no jobs in America means no paycheck that the otherwise paid employee could have earned a check, then spent on purchasing consumer items here which in affect keeps our economy going. It is so sad not seeing anything I purchase having the words, \" Made In U.S.A.\" printed on it. Then #2, allowing major bonuses for the executive positions in the company that decided to the build their factory out of the country!", "score": 4, "replies": []}, {"body": "Go Brrrrrrrrr", "score": 4, "replies": []}, {"body": "Bullish", "score": 4, "replies": []}, {"body": "Imagine not buying and holding the stock here as it bases and sets up for the run back to 400.", "score": 3, "replies": [{"body": "I’m bearish long term on this move since I fully expect a near identical battery but cheaper battery to be made by a Chinese company within a year of them manufacturing there. Say goodbye to any IP they have", "score": 7, "replies": [{"body": "Chinese company BYD already makes superior batteries and they make battery cells which Tesla does not, at least not yet. There are a bunch more companies coming up too. This is a crowded market in China.", "score": 2, "replies": [{"body": "Tesla's battery manufacturing goal is 3 Terawatt-hrs by 2030. No way BYD is close to that. That's about 300 giga Nevada factories' worth.", "score": 0, "replies": []}]}, {"body": " . . . . Hasn't China's CATL always been Tesla's main battery supplier? ? ? ? Why do you think Tesla's battery technology is better than Chinese companies?*📷*", "score": 1, "replies": []}]}, {"body": "You really think tsla going to 400??", "score": 3, "replies": [{"body": "Of course. Tesla might earn more from these batteries over time than their cars. So many ways to make money and Elon is beefing up now while the global economy and his competition is sputtering.  Going to make mad moves higher when we get past this trough.", "score": 4, "replies": []}]}, {"body": "they too blind by jealousy lol", "score": -1, "replies": []}, {"body": "What’s it going to open at is my question", "score": 1, "replies": [{"body": "Ha, probably down.", "score": 2, "replies": []}]}]}, {"body": "Let's see, has Musk done anything to appeal to China recently?", "score": 2, "replies": []}, {"body": "Breaking news, rich person is just a delusional and insane as all the others", "score": 2, "replies": []}, {"body": "elon was licking Vinnie’s ass very well…", "score": 1, "replies": []}, {"body": "I like the theory that he can’t get his money out of China so he has to keep undertaking new capex within China lest people find out", "score": 1, "replies": [{"body": "Tesla is very profitable in China.", "score": 0, "replies": [{"body": "Yea doesn’t change the hypothesis that he can’t repatriate the profits", "score": 3, "replies": [{"body": "My bad, thought you meant China's factory isn't profitable and they can't divest, so they keep building like in some kind of pyramid scheme.", "score": 1, "replies": []}]}]}]}, {"body": "What an obviously bad idea\n\nTSLA investors are delusional idiotic cultfreaks", "score": 0, "replies": [{"body": "A rare Tesla bear has been found out in the wild", "score": 4, "replies": [{"body": "You'd have to be such a fucking idiot to not be a Tesla bear, it's the most obvious short since the dotcom bubble", "score": 2, "replies": [{"body": "Go all in on puts then, and let us see the loss porn. \nWhen do you predict the price will crash out of interest?", "score": 2, "replies": [{"body": "Absolute longest before Tesla crashes 90% is maybe 2 or 3 years. The yield curve inversion is gonna predict some terrible contraction will happen within the next couple years.\n\nThis timeframe gets much shorter once it uninverts, down to 1-12 months maybe, probably on the very short side of that around a month or two. Seems like this has already started but we're still negative so the jury's still out.\n\nI'm expecting TSLA massively crashes this spring and summer and by the time 2024 arrives the cult is mostly destroyed.\n\nAny liquidity problems or general crash will make Tesla crash incredibly hard compared to other stocks because it's objectively overpriced to a hilarious 1999 extent like some Pets.com total regard stuff.", "score": 5, "replies": [{"body": "Haven't you people been saying this shit for years? \nI appreciate there was a hefty drop in stock price recently, but the price seems to be creeping it's way back up there again..\n\nI'm not a part of a cult, I personally hate Elon Musk. I think he's completely full of shit.. However, he makes a product that people enjoy purchasing.\n\nIs the stock overpriced? Well, if investors are prepared to pay for it with a ridiculous PE ratio, it's surely not overpriced.. As investors wouldn't buy the stock otherwise..\n\nI think the stock will decrease if the general economy starts tanking again... If the economy holds up, I see no reason why the stock doesn't remain valuable.", "score": 1, "replies": [{"body": "I haven't been saying it for years,\n\nYield is inverted so it crashes 90% within 2 years imo\n\nThe product is trash, go evaluate it again, nobody enjoys his products, his products are enjoyed by nobody, it's just cult obsession that makes people ignore how terrible the products are\n\nI don't think the economy will hold up. Even if it does, I think TSLA crashes 90% eventually, but luckily the economy will explode soon to crash this most overpriced stock ever 90%", "score": 3, "replies": [{"body": "See previous comment", "score": 1, "replies": [{"body": "By your logic of \"it's not overpriced if people are willing to pay\" then 1929 wasn't overpriced or Pets.com or ARKK\n\nIn the real world, people do not continue to pay extremely high PEs for long, because it's exceptionally regarded. Recession will sort this out and no idiots willing to pay super high multiples will be left, except the bagholding cucks in this sub", "score": 1, "replies": []}]}]}, {"body": "By that logic no stock is ever overpriced or underpriced", "score": 1, "replies": [{"body": "How can people say Tesla is due a 90% drop in share price though? So Tesla is an $18 stock?\n\nThat would make their market cap $58 billion. They turned over $81 billion last year alone. \n\nTesla bulls might be slightly regarded, but the bears are next level", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You seem upset", "score": 5, "replies": [{"body": "Yeah, upset with cultist 'gards everywhere who think it's 1999\n\nThey're such trash people, so arrogant, hard not to be upset when we're stilling waiting for the crash to dispose of these losers", "score": -4, "replies": []}]}, {"body": "Tesla is not stupid. Battery technology is in China, and China also controls the refining technology of rare earths. Only in China can Tesla maintain a sufficient price advantage", "score": 1, "replies": []}, {"body": "You forgot rich.", "score": 1, "replies": [{"body": "They're not even rich though, the cult is just a bunch of average joes with below average joe intelligence wasting money they don't have on his dumb cars and dumb stock", "score": 1, "replies": []}]}]}, {"body": "⭐️", "score": 1, "replies": []}, {"body": "What happens to the factory if China attacks Taiwan?", "score": 1, "replies": [{"body": "I wonder, like, does this have any influence on whether china backs down?", "score": 1, "replies": []}]}, {"body": "Ever order an Amazon battery?  They last about 3 days in an Xbox controller (good for about two sessions). \n\nNow imagine that in these already shitty teslas lmao", "score": 1, "replies": [{"body": "I can tell you understand batteries.", "score": 6, "replies": [{"body": "Ever year the saying \"you get what you pay for\"?", "score": -6, "replies": []}]}]}, {"body": "Further reinforces that China owns Tesla\nand Enron Musk", "score": -2, "replies": []}, {"body": "You all sour cry babies, why don’t Tesla built it in American if you are so afraid of china stealing tech.", "score": -3, "replies": []}, {"body": "Musk is hitching his wagon to the wrong horse.  World will likely change a lot in the next few years especially the wests relationship with China.", "score": -1, "replies": []}, {"body": "Chiii na", "score": 0, "replies": []}, {"body": "Than tsla stocks down ? :)", "score": 1, "replies": [{"body": "Oop you spoke too soon", "score": 1, "replies": [{"body": "What about you think for tsla ?", "score": 1, "replies": []}]}]}, {"body": "Why create factories on enemy land...", "score": 1, "replies": []}, {"body": "Wait… I thought Elon was a Trumper?! Aren’t they all about keeping jobs in America?!", "score": 1, "replies": [{"body": "Consistency is definitely that crowd’s strong suit.", "score": 1, "replies": []}]}]}
{"title": "TSLA share price after I buy puts", "selftext": "", "id": "12gsk8t", "created_utc": 1681067488.0, "score": 4584, "upvote_ratio": 0.89, "num_comments": 334, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|2 years ago\n**Total Comments**|209|**Previous Best DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Deeply unsatisfying\n\nJust like OPs mom", "score": 1991, "replies": [{"body": "Speaking of mom’s…Facebook marketplace is the way to go…perfect place to hook up with divorced or about to be divorced women looking for dik", "score": 284, "replies": [{"body": "This isn't even in the top 50% of most degenerate advice I've seen on wsb today.", "score": 195, "replies": [{"body": "We need a DD on marketplace cougars", "score": 67, "replies": []}, {"body": "Degenerate but a decent money maker", "score": 16, "replies": []}, {"body": "Sounds like solid rebound trading advice.", "score": 4, "replies": []}]}, {"body": "Bruh u giving out secrets!! But here is another tip, search for engagement rings for sell.", "score": 101, "replies": [{"body": "or wedding dresses, then you can sort by size", "score": 123, "replies": [{"body": "💀", "score": 22, "replies": []}, {"body": "This guy hooks", "score": 35, "replies": [{"body": "Naa he just seen another funny vid saying the exact same thing lol", "score": 2, "replies": []}]}, {"body": "Dame", "score": 6, "replies": []}, {"body": "This guy fucks the right women right here", "score": 6, "replies": []}, {"body": "shoppin' for cougars", "score": 1, "replies": []}]}]}, {"body": "I love me some milf's", "score": 15, "replies": [{"body": "Amen…wasn’t even looking for ass but the chick was all flirty and touchy…I just wanted an antique humidor…it was nice", "score": 38, "replies": [{"body": "Oh, she was humid alright.", "score": 18, "replies": [{"body": "Moist", "score": 9, "replies": [{"body": "*don't forget antique!*", "score": 6, "replies": [{"body": "You need to read up on vaginal rejuvenation…", "score": 6, "replies": []}]}]}]}]}]}, {"body": "This is actually decent advice.  What the fuck is going on here?", "score": 12, "replies": []}, {"body": "They have a whole ass men's wardrobe listed, they on the prowl", "score": 10, "replies": []}, {"body": "let him cook", "score": 6, "replies": []}, {"body": "Elaborate some more", "score": 9, "replies": []}, {"body": "teach me, sensei", "score": 4, "replies": []}, {"body": "Elaborate please 🙏", "score": 3, "replies": []}, {"body": "Dik seems too short", "score": 2, "replies": []}, {"body": "How?", "score": 1, "replies": []}, {"body": "Uhhhh....\n\nHappy Easter to you, too?", "score": 1, "replies": [{"body": "Found different kind of eggs…with my Benis", "score": 1, "replies": []}]}, {"body": "Hey, don’t giveaway for free. We need keep secrets. But they will not care the woman’s love getting attention from us so it is a win win for everyone 😂.", "score": 1, "replies": []}, {"body": "Bro, stay out of facebook marketplace jfl", "score": 1, "replies": [{"body": "How I met your mother", "score": 1, "replies": []}]}, {"body": "I'm tired of Facebook Adverts", "score": 1, "replies": []}, {"body": "I still just go to the supermarket must be old school.", "score": 1, "replies": []}, {"body": "Look at that subtle username, the tasteful flair, OMG even the degenerate comment....", "score": 1, "replies": [{"body": "Thank you for your irrelevant opinion. You’re probably the kind of dude that looks at a beige car and goes yes…that’s exactly what I want 😘", "score": 1, "replies": []}]}, {"body": "Shit need to try that.", "score": 1, "replies": []}]}, {"body": "I finished", "score": 6, "replies": []}, {"body": "I don’t get this meme🥲", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|29093)", "score": 1, "replies": []}]}, {"body": "Been watching it on repeat for a few minutes just waiting for impact not realising my efforts were worthless, not high at all though", "score": 305, "replies": [{"body": "[A Delorian would just blast right through that wall... unless it was travelling under 88 mph....](https://www.youtube.com/watch?v=c2rytceMYOU)", "score": 37, "replies": [{"body": " The delorian became a subcompact quickly. No survival zone at all", "score": 10, "replies": [{"body": "You'd be fine at 8.8 mph..... Maybe", "score": 5, "replies": []}]}, {"body": "Damn they weren’t thinking fourth dimensionally at all", "score": 3, "replies": []}]}, {"body": "After 15 minutes something is a bit of a high feeling.\nI also consider tesla putts now", "score": 1, "replies": []}, {"body": "Same!!!", "score": 1, "replies": []}]}, {"body": "I've tried to play Tesla on both sides.\n\nToo many fanbois and angry short sellers.\n\nWon't again - ever \n\nThere are other mega caps to trade that don't have the drama.", "score": 236, "replies": [{"body": "Tesla is great if you are long and 50% cash. Just buy or sell to readjust back to 50% cash every time it moves more than a certain percentage. 8% and 13% worked best in my backtesting, but that was specific to my setup.  \n\nThis way you profit from volatility, it's an opportunity whether the price goes up or down. If you prefer higher risk/reward, go 25% cash instead, or swap out 50% cash for 50% something else. (like doge lol)", "score": 56, "replies": [{"body": "Sir this is a casino", "score": 76, "replies": []}, {"body": "What do you mean 50% cash? Noob here.", "score": 17, "replies": [{"body": "If you have $1k, you’d buy $500 of Tesla shares. If it goes down, you now have $400 of shares and $500 cash. So you buy $50 of shares to have 50% share value and 50% cash ($450 each). If it goes up, and you have $550 share value and $450 cash, you sell $50 of shares and have $500 of each. \n\nIt’s not free money though, and you’re paying capital gains since you’re not holding for a year. So buy fucking calls to the moon and enjoy the rocket ride, rookie", "score": 26, "replies": [{"body": "Yeah, that's pretty much exactly it. \n\nThe system I was using was similar but not the same. With the $1000 example, instead of 50% each way I tried to maintain $500 in Tesla (+/-8%) so if it dropped to $400 I'd buy $100, basically doubles whatever you'd buy and sell to maintain 50%, but only your cash balance increases which is great if you're drawing a wage from it. You do make more that way, but it has the potential to wreck you if it drops 75% or more like it did. That's why I suggest 50% cash, rather than a fixed amount of share value. Sure, I made more on the way up, but I got wrecked after the cash ran out on the way down.", "score": 6, "replies": [{"body": "What if it falls to a hundred dollars all the time? Will you continue to buy 400", "score": 2, "replies": [{"body": "Yes, until I own more than 50% of the company for under $50,000. My reply makes no sense, because in reality it can only lose 75% so many times.", "score": 1, "replies": [{"body": "If you are buying put options on Tsla, I actually think it is a very gambling mentality to keep adding positions", "score": 1, "replies": [{"body": "Not put options, I buy the stock.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "I did it for five years (2014-2019). Then it grew tenfold and I missed more profits than I did in those five years. Lesson learned. Hold, don’t sell", "score": 4, "replies": [{"body": "Good idea. Hold the vastly overvalued and highly volatile stock.", "score": 7, "replies": [{"body": "Yes, as history has shown, you would have been rich had you done this.", "score": 8, "replies": [{"body": "Yes, because you should have in the past means you definitely should in the future.", "score": 1, "replies": []}]}, {"body": "better than to keep buying when it’s going down", "score": 1, "replies": []}]}, {"body": "That's the risk you took though. Could have easily went the other way and you'd be like \"thank god I did that\".", "score": 5, "replies": []}]}, {"body": "Ok I am 50% long TSLA calls and 50% cash.  Dollar cost averaging FTW yeah baby!", "score": 1, "replies": []}]}, {"body": "I thought I was the only one to lose money on TSLA in 2021.", "score": 14, "replies": [{"body": "It's 2023 now", "score": 3, "replies": []}, {"body": "Nope", "score": 2, "replies": []}]}, {"body": "Tesla stock price is so irrational you might as well be in a literal casino.", "score": 5, "replies": []}, {"body": "Yeah these things aren’t for trading. I’ve learned the lesson multiple times. Anything with this much irrational manipulation can’t be traded. You can still invest long term but trading is guaranteed suicide", "score": 3, "replies": []}, {"body": "my mom got in years ago for $500 and bought me some. he share is now multiple shares and they’re doing numbers i sold mine for $400 profit and i think that was the best thing i could’ve done at this point lol long term is really the only way to go about tes", "score": 0, "replies": []}, {"body": "weak hands", "score": 1, "replies": []}]}, {"body": "Fuck you OP", "score": 106, "replies": [{"body": "Yeah this is like edging I didn’t ask for", "score": 16, "replies": []}, {"body": "Seriously, watched this like 4 times waiting for the smash.", "score": 23, "replies": [{"body": "This video is a complete waste of our time", "score": 17, "replies": []}]}]}, {"body": "This is giving me so much anxiety", "score": 44, "replies": [{"body": "No need to worry. Tsla will go up", "score": 1, "replies": []}]}, {"body": "High af, watched this for atleast 3 mins.\n\nHeart beating faster and faster. Anxiety rising waiting for them to hit the wall.\n\nI died.", "score": 45, "replies": []}, {"body": "That underside shot is such an incredibly good troll that it just elevates the aggravation of the entire video.", "score": 25, "replies": []}, {"body": "[deleted]", "score": 84, "replies": [{"body": "Here’s a company that isn’t afraid to show their crash test \n\nhttps://youtu.be/h4nVXwdo35M", "score": 32, "replies": [{"body": "Wow, that crash is almost as brutal as investing in Canoo!", "score": 28, "replies": [{"body": "Meh I’m happy. Picked up 100k shares\n\nhttps://preview.redd.it/08086ztvtysa1.jpeg?width=1113&format=pjpg&auto=webp&s=e4299567f15861e90430c81a96de1c7014cc4d12", "score": 15, "replies": [{"body": "Uncensore the quantity loser. Verify or ban?", "score": 7, "replies": [{"body": "https://preview.redd.it/i5irx5e6nzsa1.jpeg?width=1124&format=pjpg&auto=webp&s=abed0cf943a631d894bd5933badd00e94eccece4", "score": 11, "replies": [{"body": "This is what I wanted to see. ![img](emote|t5_2th52|29637)![img](emote|t5_2th52|29637)![img](emote|t5_2th52|29637)", "score": 6, "replies": []}, {"body": "5% already gone? dam", "score": 3, "replies": [{"body": "In vanguard that’s the days action not mine. I bought the dip of the dippy dip dip", "score": 3, "replies": [{"body": "be blessed !!!", "score": 1, "replies": []}]}]}]}]}, {"body": "Ah yes, because “happy” people downvote my (at least somewhat funny) obvious jokes. \n\nIf you’re butthurt now, just wait!", "score": -9, "replies": [{"body": "For what? I’m not butt hurt about anything", "score": 6, "replies": [{"body": "Missing another joke I see. \n\nYou must be the only thing dumber than Canoo’s product design team!", "score": -10, "replies": [{"body": "What joke? The US Army, NASA, Walmart seem to like their designs.", "score": 8, "replies": [{"body": "Highly regarded sheep.", "score": -5, "replies": [{"body": "How does investing in a company people overlook make me a sheep? It’s not mainstream and is clearly hated on by Elon simps.", "score": 4, "replies": []}]}]}]}]}, {"body": "r/downvotesreally", "score": 0, "replies": []}]}, {"body": "Wow are they dead or the market is pricing in severe dilution or what", "score": -2, "replies": [{"body": "Yes it’s basically worth zero. Garbage EV company with zero future.", "score": 1, "replies": []}]}, {"body": "[I googled Canoo stock price and this image came up](https://investorplace.com/wp-content/uploads/2020/06/death-stocks-to-sell-1024x576.jpg)", "score": -4, "replies": []}]}]}, {"body": "Tesla totally have 0 crash videos:\n\n[https://www.youtube.com/watch?v=9KR2N\\_Q8ep8](https://www.youtube.com/watch?v=9KR2N_Q8ep8)", "score": 3, "replies": []}, {"body": "So you say buy?", "score": 2, "replies": [{"body": "I loaded heavy last week but it’s every regard for themself", "score": 1, "replies": []}]}, {"body": "Neither is Tesla... Just got to buy one and use autopilot, you'll see.", "score": 1, "replies": []}]}]}, {"body": "I checked \"Getting edged by Elon Musk\" off my 2023 bingo card", "score": 8, "replies": []}, {"body": "Is this the modern version of THAT gif?", "score": 12, "replies": [{"body": "Seems so!", "score": 3, "replies": []}]}, {"body": "Omfg! I've never wanted to see a car hit a wall so badly in my life", "score": 6, "replies": []}, {"body": "Fucking damnit....", "score": 18, "replies": []}, {"body": "That video let me know what it feels like to have a stroke.", "score": 5, "replies": []}, {"body": "First mistake: Buying Puts Of TSLA", "score": 22, "replies": [{"body": "New factory in China. TSLA about to moon again", "score": 18, "replies": [{"body": "Never know, price cuts are bad, deliveries are just meh but factory announcement in normal times is bullish but this aint a normal mkt. Sureit will have green few minutes and red candles with heavier volume comes again.", "score": 0, "replies": [{"body": "I think it depends what it opens at. I think it's going to open in 190's. Question is where does it go from there", "score": 3, "replies": [{"body": "Why do you think it opens in green?", "score": 1, "replies": [{"body": "Because of the factory in China announcement", "score": 5, "replies": []}]}]}]}, {"body": "For <5% margin products.", "score": -6, "replies": [{"body": "Their margin is much higher than that, more impotently after the cuts it’s still higher than ford/gm etc. I don’t even have skin in the game and I can see that.", "score": 5, "replies": [{"body": "I meant the new factory is for a low margin product, the megapack.", "score": -6, "replies": [{"body": "Actually, Megapacks have pretty high margins.", "score": 3, "replies": [{"body": "Q4 2022 cost of revenue for energy generation and storage: 1.151 bil.  Revenue for the same: 1.31 bil.\n\n\nMaybe Tesla management is good at it and thus far have chosen to make money selling wheeled battries with a wider supply chain of parts compared to something simple that can sit on the side of house.  One of those has much higher margins than the other.", "score": -2, "replies": [{"body": "That includes solar panel and solar panel installs as well as solar PPA’s. As well as Powerwalls. Even so, that’s 13% gross margins.\n\nWith prior cell availability constraints and using high nickel cells, it wasn’t as profitable and management did prioritize automotive for cells.\n\nMegapacks, however, use LFP and Tesla has their own power electronics and software to drive much higher margins and with new incentives, could rival or exceed top end automotive margins. Obviously that won’t last for a decade+, but it should remain healthy.", "score": 2, "replies": [{"body": "How does electronics and software increase margins?  Could you expand a bit more?\n\nAre you saying the packs would be owned by Tesla and the electronics and software would be better at capturing the peak demand on the grid versus LFP packs supplied by others?", "score": 2, "replies": []}]}, {"body": "Look up IRA credits for the commercial energy storage", "score": 1, "replies": [{"body": "Sure, in this case, unlike cars, the playing field is even and open to everyone who wants to get into it.  As long as they build it in the US.\n\nPanasonic, lg, sk, etc.  Surprised those corps don't see the value in it.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "You mean not buying enough tsla puts", "score": -5, "replies": []}]}, {"body": "Wheres the actual crash?", "score": 16, "replies": [{"body": "Exactly", "score": 21, "replies": [{"body": "No I wanna see how the tank handles the wall", "score": 14, "replies": [{"body": "And I want my puts to print", "score": 17, "replies": [{"body": "Why are you betting against a 21st century all American tech company?", "score": -14, "replies": [{"body": "Not a tech company. Car manufacturer with a rapidly deteriorating first-mover advantage, erratic CEO, and killer software.", "score": 19, "replies": [{"body": "Double digit growth is rapidly deteriorating?    They are ramping capacity faster than anyone in the world, and so far they have sold every single unit.    They just announced a new megapack factory, and megapack still has a 2 year backlog.    They sell electricity and have the world's largest charging network.    They do have excellent software.    Elon might be erratic or crazy; idk, idc.    The company has massive future upside, and I'm holding shares for the run.\n\nI don't care if the stock goes down 50% this month.    People are strange.    Tesla makes ai software, circuit boards, chipsets, literal humanoid robots, and sells energy.    If that's not a \"tech company\" then apple and nvdia certainly aren't either.\nPeople in this sub will probably downvote this to oblivion because they have so much Tesla hate, but the takes her are hilarious.    Massive growth?  Demand issues and vanishing advantages.    It's pretty funny.", "score": 7, "replies": [{"body": "Massive growth, but still relatively small. What *is* massive is their market cap, quality issues, and the number of attractive alternatives that are finally coming to market that have things like, ya know, an actual service network. That said, the problem isn't Tesla itself. They make an okay product, as long as you get a good one (which is a crapshoot), and don't mind paying luxury prices for playskool interiors, and don't ever use the self-driving software. The problem is their valuation. Even if you believe in Tesla, the idea that it's worth more than Ford, GM, Toyota, Honda, Nissan, Volkswagen, BMW, and the rest of the market combined is delusional. \n\nWhat's funny is people buying Tesla at these valuations and believing it's anything other than a bet that the market will remain delusional long enough for you to profit.", "score": 6, "replies": [{"body": "\n\nI agree that the valuation is high, for a car company, but Tesla has income streams that are already up and running in software, energy(megapacks), and electricity(chargers).   \n\nLook at the total sales of those car companies you listed.   Look at total units sold 3 years ago vs last year, or their own projections for this year.    Notice how all of them have shrinking unit volume, and sales projections?    Tesla sold 499k units in 2020, and sold 422k units in the last 3 months.     \n\"still relatively small\"   They have the worlds highest volume car for 2023 sales.  They will almost guarantied sell more vehicles than ford next year, and just as many units this year.  \nLuxury prices?   The model s plaid is 100k for a car that has no competitors anywhere near that price.   The model 3 can be had for around 40k after the rebates, and that is the best value of any ev available.    The new ev6 gt is 20k$ more for 2/3rds of the range.  \nDo you use FSD and hate it?    I have found it to be very impressive personally, but I know that its not perfect yet.    \n\nI believe that 5 years from now, they will sell enough software and electricity to make the valuation make plenty of sense.    They currently have 0 debt and innovate constantly, while pocketing billions in profit.   \n\nI agree to disagree with you on certain things.   I can certainly see that the main bull case is that the company will only be 5-10 larger in a few years and the stock could fall etc, but thats the risk of investing my friend.", "score": 6, "replies": []}]}]}]}, {"body": "Because it’s owned by a South African troll that hates democracy.", "score": -7, "replies": [{"body": "Open sources Twatter and calls for less bans. \"hates democracy\". Truly regarded.", "score": 4, "replies": [{"body": "You understanding of democracy is very deep. I withdraw my opinion that Elon musk is a rat from South Africa and practices apartheid on a regular basis. You’re so right and I’m soooo wrong that Elon musky is the best democratic role model for the human race! Go Eron!", "score": -7, "replies": []}]}]}, {"body": "Have you read his username?", "score": 1, "replies": []}]}]}]}]}, {"body": "When tsla hits $69 next year", "score": 3, "replies": []}]}, {"body": "I really hate this video.", "score": 3, "replies": []}, {"body": "It literally fell 10% last week. Did you buy puts AFTER it fell 10%?????", "score": 3, "replies": [{"body": "$69 strike 4/20 expiration", "score": 4, "replies": []}, {"body": "I think there will be a rally next week.", "score": 1, "replies": []}]}, {"body": "When I buy puts Powell pumps another $300B into market with a mini-bank-bailout. \n\nJust so everyone knows he’s serious about inflation…", "score": 3, "replies": []}, {"body": "Anticipation", "score": 3, "replies": []}, {"body": "This sub is returning to its previous glory. I’m down for the ride.", "score": 3, "replies": []}, {"body": "Never short a cult", "score": 11, "replies": [{"body": "Except for DWAC, that shit is going to fail.", "score": 6, "replies": [{"body": "I still wouldn’t fuck with DWAC. Crazy boomers getting reverse mortgages on their farms so they can screw their kids and prop up bullshit.", "score": 3, "replies": []}]}, {"body": "His cult is more like a simp army.", "score": 2, "replies": []}]}, {"body": "Happens to me all the time.", "score": 2, "replies": []}, {"body": "I can no longer afford the Wendy's 4 for $5", "score": 2, "replies": []}, {"body": "Man this things long. Been watching for hours.", "score": 2, "replies": []}, {"body": "Fuk man I was waiting forever for this to crash.", "score": 2, "replies": [{"body": "Your word seems to be missing a letter C", "score": 1, "replies": []}]}, {"body": "I kept watching the video confused and then it came to me LMFAO", "score": 2, "replies": []}, {"body": "Whenever Tesla dips, I open a long put ratio spread. So if it’s at $190, I sell a put at 200, then buy 2 puts at $180, all for like 30 DTE. I know it’s not going to stay at $190, so if it goes below $180 I make money and above $200 I still have the premium collected. I can usually close the trade in a few days either way.", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "GOD!!! I fucking hate this!", "score": 2, "replies": []}, {"body": "This is the WORST video I’ve ever seen", "score": 2, "replies": []}, {"body": "This video gives me anxiety. Lol", "score": 2, "replies": []}, {"body": "The comments in this thread are more entertaining than a new episode of GOT", "score": 2, "replies": []}, {"body": "Where still like a few weeks or month out from the next crash. The fact that everythihgs taking longer. It could even be farther out then that. \nWhich means the longs are going to start pinching this crap eventually and youll see some real crazy nonsense movements. Then when it all goes belly up it will all implode.", "score": 2, "replies": []}, {"body": "I am angry.", "score": 2, "replies": []}, {"body": "you bastard", "score": 2, "replies": []}, {"body": "r/maybemaybemaybe", "score": 2, "replies": []}, {"body": "(NIO) (Nio) 🔥🔥🔥🔥🔥🔥🔥☄️", "score": 2, "replies": []}, {"body": "Every Fucking time", "score": 2, "replies": []}, {"body": "Sat here expecting some breakthrough in safety, now I don't feel my legs", "score": 2, "replies": []}, {"body": "Vehicle deliveries will begin any year now.", "score": 2, "replies": []}, {"body": "that stressed me out", "score": 2, "replies": []}, {"body": "So puts than", "score": 2, "replies": []}, {"body": "You'll eventually be right, these obsessive ponzifreaks who wanna suckle on Elon's nuts are gonna be wrong, they're really dumb. Everyone going long TSLA is stupider than a brick and not thinking straight because they're in a cult. It's gonna crash just like the dotcom stocks because it's incredibly overpriced overhyped trash only owned by actual idiots.", "score": -6, "replies": [{"body": "Kinda seems like you're mad because you lost.", "score": 20, "replies": [{"body": "I didn't, I made money shorting it, just not very much because it hasn't crashed enough yet\n\nIf you are long Tesla you're really fucking dumb and in a cult, grow up", "score": -12, "replies": [{"body": "You do realize they make decent cars, right? And you do realize the cars sell a lot, right?", "score": 9, "replies": [{"body": "they make okay cars but were first in the door for EVs but they're massively overpriced as far as car companies go. plus all of their competitors are catching up and slowing chipping away at the EV market.", "score": 0, "replies": []}, {"body": "They don't you're fucking regarded, they make trashy overpriced cars with poor QC\n\nThey sell a lot of cars at high margin because the cult of delusional idiotic garbage-brained freaks has become very large because there are millions of absolute cucks out there who wanna suckle Elon's nuts", "score": -7, "replies": [{"body": "> They sell a lot of cars at high margin \n\nShareholders are shaking in their boots at this terrible news", "score": 6, "replies": []}, {"body": "Someone’s so salty. Go out and enjoy your day and relax.", "score": 8, "replies": [{"body": "Giant cults of garbage-brained fuckup cuck losers make me salty\n\nSame with beanie babies\n\nSame with MLM\n\nSame with religious fundamentalist cults\n\nSame with Bitcoin\n\nIt's a giant cult of cuck loser freaks who don't know anything about anything and are being tricked\n\nThey don't make high quality well-engineered products, that's a bunch of BS, it's all marketing like MLM", "score": 0, "replies": [{"body": "You are an idiot.", "score": 5, "replies": [{"body": "I don't know.. he makes some good points.  The part where he talks about \"garbage-brained fuckup cuck losers\" really resonated with me", "score": 9, "replies": []}]}]}]}, {"body": "Your regardedness is commendable but at least make better arguments, lord knows there are better ones to make.\n\nFor example, the margin compression that has started is likely going to continue to worsen. Net income is not going to grow at a palpable amount compared to its multiple and eventually it will be rerated.", "score": 2, "replies": []}]}]}, {"body": "Tesla 250 by EOM", "score": 3, "replies": [{"body": "Banbet?", "score": 1, "replies": []}, {"body": "You're a freak, go back to 1999 and buy some Cisco", "score": 1, "replies": []}]}]}]}, {"body": "You could be right, but timing is key here. If TSLA crashes in (say) 5 years, a lost of short positions will see themselves reduced to nothing until then. The problem with it and the other cult-dependent financial instruments is that the cult members refuse to let go, and this ill-placed blind devotion can go on for years. For instance, I am looking at how the BB*Y stock holders talk about the company preparing a major U-turn, and I cannot believe that adults can choose to hang on to their dellusional dreams so badly. I hope that you are not short TSLA, because it will take a while to see its price shrink as it should.", "score": 4, "replies": [{"body": "It will not be 5 years\n\nIdk exact timing, but the yield curve inversion imo means these delusional techponzifreaks have a max of 2 years before they get destroyed. Once the yield curve uninverts they only have a matter of months\n\nI am not directly short tesla, just long vix. And as you can imagine, hasn't gone too well. But I think the end js very close to the point where going long on any stock doesn't really make sense and I also think DCAing into shorts every single paycheck eventually will work fantastically", "score": 2, "replies": []}]}, {"body": "Leave elons nuts out of this chump", "score": 3, "replies": [{"body": "You must be another dumb cult freak\n\nYou gotta involve his nuts or he won't give you the horse, just a heads up\n\nBasically everyone who likes Tesla is ABSOLUTELY OBSESSED with Elon, to the point where it's some delusional fullblown cult stuff. I think making the jump to people wanting his nuts is not that crazy, seems like a small jump, lots of cults devolve to that point. There are literally thousands of stupid losers on this sub who would suck his nuts for a Tesla, the cult is wildly delusional, I'm not even embellishing this.", "score": -3, "replies": [{"body": "Nah i like my good ol gas powered but i fux wit big elon the long way 💪🏽💪🏽", "score": 4, "replies": [{"body": "Elon is dumb and immature and absolutely horrendous at engineering things, and also he's doing a terrible job as CEO at every company he's involved with, especially Twitter\n\nYou should find someone to follow who is less of a stupid loser. There's no point joining the TSLA cult now, it's too late, 2018 was the time to join, now the cult is shrinking and Elon is unravelling, this is the time to stop caring about him and start enjoying the downfall his cult of dumb cucks as they unravel\n\nElon peaked so long ago, there's nothing interesting gonna happen, except the downfall of his extremely regarded empire of regards", "score": -1, "replies": [{"body": "Lol you really think he’d still be the head if he was as incompetent as you claim? I dont expect someone of his skills to be a master at running one of the least popular social media options even though hes clearly bought it to level the playing ground when it comes to the “news” being released. You can hate on him all you want he still the top dog while you here arguin with my dumb ass on a reddit feed", "score": 6, "replies": [{"body": "Yes, absolutely, 100%\n\nHe's also terrible at doing marketing and news\n\nWhen the cult was growing, his immature memeing 'gard stuff was helpful and growing the cult\n\nHe took it too far and now he's a marketing liability and the cult is shrinking\n\nHe's absolutely not top dog, he'll likely be forced out of the CEO position at TSLA because he's so terrible at it, and also he doesn't have nearly as much money as you think because he squandered almost all of it doing irresponsible regard stuff, so imo he's like barely even rich anymore, he already blew a huge portion of his money and what little is left is tied up on TSLA shares he will be forced to dump on bagholding cultists\n\nHe's not the leader because he has good skills, he's just an incompetent immature meme lord who managed to amass an incredibly large cult because he's very charismatic to loser dorks who wanted an immature meme lord autist to pray to and make altars to.\n\nAll cult leaders are top dogs... for a while..\n\nHe cannot maintain top dog position because he has none of the skills required for that. His cult is shrinking because he's a bad cult leader, and once the cult shrinks just a little bit more, the entire house of cards will unravel and everyone will lose everything\n\nI will not be wrong about this, I know stupid delusional loser fuckups when I see them, and the cult is just a bunch of delusional losers on a path to lose", "score": -2, "replies": []}]}, {"body": "Dumb. Immature. Horrendous. Terrible. Stupid loser. Cuck. Regarded.\n\nU big mad.", "score": 1, "replies": [{"body": "I mean, alright?\n\nLike, I'm not really young enough to care if I'm mad, that's some absolute teenage CoD lobby type stuff you're saying, who cares\n\nRather be mad than extremely regarded like 100% of Tesla investors, everyone who buys that trash needs a helmet, absolute shit-for-brains losers, I'm amazed they can even type or breathe being so fucking dumb", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Sounds like an endorsement to buy TSLA", "score": 2, "replies": [{"body": "If you wanna find out what it's like living with a 90 IQ deluding yourself into feeling like you're a genius techbro, then yeah, TSLA is perfect", "score": 0, "replies": []}]}, {"body": "So the idiots you speak of are making money at Tsla. And you don't. are you angry?", "score": 1, "replies": [{"body": "They're not making money, have you seen the chart? It went down like 50%\n\nMost bulls bought the top\n\nAnd now dipshits like you are buying the top again\n\nWhy would you be bragging about how much money people made on a stock that crashed 50%? You know how stupid you sound?", "score": 1, "replies": [{"body": "Do you know how stupid you are? I bought 3000 shares of Tsla at 123.5. I am earning quite a bit now. When did it plummet by 50%. you tell me idiot", "score": 1, "replies": [{"body": "From the top it plummetted over 50% in a short amount of time\n\nThe same will happen again soon\n\nMost bulls did not make much, I have nothing to be jealous of\n\nYou never sold because you're a cultist, that's all unrealized gains\n\nYou said you made money. That implies you sold. I bet you didn't\n\nYou're gonna baghold that dumb dotcom bubble trash back to 50 because of how fucking stupid you are\n\nI bet you lose all your unrealized gains in the next few months like an absolute fucking idiot", "score": 1, "replies": [{"body": "If you mean when Tsla stock was at $414. So why don't you compare it with the price when it was first released. Stupid, if you can make money in the stock market, it proves that the bull market is coming", "score": 1, "replies": [{"body": "First released? Why didn't I compare it then? Because no bulls bought it when it started, most bulls bought it at higher prices than it is now\n\nYou didn't make money in the stock market, you have unrealized gains\n\nThinking a bull market is coming when the yield curve is inverted is something only dumb people do", "score": 1, "replies": [{"body": "So you better hope Tsla drops to 123.5 to hit me in the face", "score": 1, "replies": [{"body": "It will you fucking idiot, it's going below 50 bucks soon, it's probably the most obvious short since the dotcom bubble\n\nIf you think the current price makes sense you are INCREDIBLY FUCKING STUPID, just remarkably stupid, like a lab specimen that should be studied for it's remarkable stupidity\n\nThis is equally as regarded as 1999, all you dumb fools will get rekt and realize you were not 5% as smart as you thought you were, you're just some generic average idiot who doesn't know shit about fuck", "score": 1, "replies": [{"body": "Ok. you are right", "score": 1, "replies": [{"body": "I am right, you're gonna get rekt because you're dumb-as-fuck", "score": 1, "replies": [{"body": "If not down to $50. i wish your mother was a whore", "score": 1, "replies": []}]}]}, {"body": "You fucking idiot. If it doesn't fall to 50 dollars, you call me mother. Dare you bet?", "score": 1, "replies": [{"body": "I'm not gonna bet, it's foolish to mak3 agreements with extremely stupid people\n\nAnd yes, it's going below 50 bucks, and you're going to KNOW you're a fucking idiot when it happens", "score": 1, "replies": []}]}]}]}, {"body": "What you said is in the past tense. idiot. The stock market looks at the present and the future. You compare it to the future. First post for less than $1. You see how much it is now. really stupid", "score": 1, "replies": [{"body": "NOBODY BOUGHT IT AT $1, NOT A SINGLE BULL ON WSB, SO WHY THE FUCK WOULD I CARE?\n\nMost bulls, provably including you, bought it when it was over 200, whereas NOBODY on WSB bought at $1\n\nWhy does it matter where it started? All that matters is where it's going from here. And where it's going from here is down 90%", "score": 1, "replies": [{"body": "So what the fuck is the point of your $400. Now 182. The lowest at the beginning of the year is 101. People in this range are not making money? so fucking stupid", "score": 1, "replies": []}]}]}]}]}, {"body": "You are suitable to buy stocks that will only rise and not fall", "score": 1, "replies": [{"body": "Idk about that, but I'm pretty sure you're gonna do the exact opposite and only buy stocks that will drop and you'll own none that will rise, because you're an absolute fucking idiot falling for dotcom bubble cult scams", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Do you all think TSLA will hit 210 before earnings?", "score": 1, "replies": [{"body": "God I hope so, would love to get out of these calls alive", "score": 2, "replies": []}]}, {"body": "Motherfucker", "score": 0, "replies": []}, {"body": "TSLA will hit $69 before the 2024 election", "score": -9, "replies": [{"body": "That has about the same likelihood as TSLA hitting 690$ before the 2024 election.", "score": 8, "replies": [{"body": "lol, I also prefer to see TSLA shares reach 500+ in the 2024 election", "score": 1, "replies": []}]}]}, {"body": "I seriously would not be a friend with anyone who owns a Tesla.", "score": -1, "replies": []}, {"body": "https://youtu.be/xK-Px5S4hqw\n\nThank me later", "score": -14, "replies": [{"body": "That didn't help at all", "score": 8, "replies": []}]}, {"body": "...", "score": 1, "replies": []}, {"body": "wtf", "score": 1, "replies": []}, {"body": "Fucking hell mate, I am deeply triggered now :(", "score": 1, "replies": []}, {"body": "Hahaha almost win", "score": 1, "replies": []}, {"body": "Ya dude, what a cock tease this is", "score": 1, "replies": []}, {"body": "I was wondering who was buying my puts", "score": 1, "replies": [{"body": "$165 strike 4/14?", "score": 2, "replies": [{"body": "No not that low 175,180,185, and 190", "score": 1, "replies": [{"body": "It turned out to be a decent move. Bought for $0.47 on Thursday, sold this morning for $0.79.", "score": 2, "replies": []}, {"body": "What price do you think TSLA will be at next week?", "score": 1, "replies": [{"body": "Probably around 190", "score": 1, "replies": [{"body": "I hope it will go back to $200", "score": 2, "replies": [{"body": "It will but probably not for another month", "score": 2, "replies": [{"body": "Yes, I gave you a private message and hope we can talk more", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I do not recommend buying put options at this time", "score": 1, "replies": []}]}, {"body": "If those were kids it wouldn't stop", "score": 1, "replies": []}, {"body": "I got a good little giggly out of this one", "score": 1, "replies": []}, {"body": "Highly disturbing", "score": 1, "replies": []}, {"body": "More like NVDA", "score": 1, "replies": [{"body": "Seriously. I’m going longer expiry on NVDA puts. Expensive premium though.", "score": 1, "replies": []}]}, {"body": "Yeyy", "score": 1, "replies": []}, {"body": "BTC price after Friday at 4pm", "score": 1, "replies": [{"body": "Is there any connection between the two?", "score": 1, "replies": []}]}, {"body": "*everything reminds me of her*", "score": 1, "replies": []}, {"body": "Video gave me blue balls", "score": 1, "replies": []}, {"body": "seams like tesla failed the crash-test and letting users come up with their own interpretation.", "score": 1, "replies": []}, {"body": "I still have faith that it will crash", "score": 1, "replies": []}, {"body": "How much do crash tests cost companies?", "score": 1, "replies": []}, {"body": "This is nothing but a giant cocktease.", "score": 1, "replies": []}, {"body": "Never crashes.", "score": 1, "replies": []}, {"body": "It's just like that forever crash truck", "score": 1, "replies": []}, {"body": "Such a tease", "score": 1, "replies": []}, {"body": "Even worse, it drives of the crash track and transforms into ten robots that furiously start assembling more teslas…..effectually destroying your non-heterogeneous puts.", "score": 1, "replies": [{"body": "So when he collides. people can't control", "score": 1, "replies": []}]}, {"body": "I really hope it will moon tomorrow lol", "score": 1, "replies": []}, {"body": "This is the most unsatisfying video I have ever seen.", "score": 1, "replies": [{"body": "this is a pointless video", "score": 1, "replies": []}]}, {"body": "Durable", "score": 1, "replies": []}, {"body": "Fucking crash already!!!!!", "score": 1, "replies": []}, {"body": "Smart traders would first check the clip length.", "score": 1, "replies": []}, {"body": "I h8u, OP, for posting this damned video.", "score": 1, "replies": []}, {"body": "So is the wall ok?", "score": 1, "replies": [{"body": "Calls to the walls", "score": 1, "replies": []}]}, {"body": "all the way to OPEX", "score": 1, "replies": []}, {"body": "They dont deserve a 53 P/E", "score": 1, "replies": [{"body": "why not", "score": 1, "replies": []}]}, {"body": "Scrolling through comments desperately looking for blue. Where’s the sauce!?!!!??", "score": 1, "replies": [{"body": "Tesla twitter", "score": 1, "replies": [{"body": "Omg so we really don’t get to see it smashed!", "score": 1, "replies": []}]}]}, {"body": "Testla stock is highly undervalued at the current level; as rates crash over the next cycle the price will soar higher ![gif](emote|free_emotes_pack|upvote)", "score": 1, "replies": []}, {"body": "Tesl just freezes time untill Elon invents time machine and able to safe passengers.", "score": 1, "replies": []}, {"body": "I really wanted to saw the damage", "score": 1, "replies": []}, {"body": "Ill be here for ever arent i", "score": 1, "replies": []}, {"body": "This is more suited for r/maybemaybemaybe lol", "score": 1, "replies": [{"body": "You can post your puts there too 😂", "score": 1, "replies": []}]}, {"body": "I swear to fucking god if i see one more cut or a different camera view im gonna blow up tesla.", "score": 1, "replies": []}, {"body": "Well your definitely going to make money of tesla there  Essentially the number one car production company", "score": 1, "replies": []}, {"body": "wait, is there really no released version in which you actually see the result ?", "score": 1, "replies": []}, {"body": "I’m screaming in pain right now because i am not getting closure from this video.", "score": 1, "replies": []}, {"body": "BDHDJDJDJDJDJNCNCJCNC DUCK OFFFFFFFFF", "score": 1, "replies": []}, {"body": "That clip is pi****g me off! Hit the f ing wall!", "score": 1, "replies": []}, {"body": "Took me a minute", "score": 1, "replies": []}, {"body": "Has anyone heard anything about China buying SGML lithium first production?", "score": 1, "replies": []}, {"body": "I thought that was Elon Musk who was thinking about buying SGML...", "score": 1, "replies": []}, {"body": "Electric Drive Evergrande crash", "score": 1, "replies": []}, {"body": "I want a cyber truck so bad", "score": 1, "replies": []}, {"body": "This video is not good for anyone’s mental health. Fuck. You.", "score": 1, "replies": []}, {"body": "Take a long position in YELL (Yellow Corporation), before positive news releases begin later this month.  It's inarguably the most undervalued large U.S. publicly traded company.", "score": 1, "replies": []}, {"body": "Fuckin tease.", "score": 1, "replies": []}, {"body": "Please just show it in one clip instead of a million jump cuts. This makes me actively dislike Tesla if this vid was put together by their team", "score": 1, "replies": []}, {"body": "OP just likes to edge.", "score": 1, "replies": []}, {"body": "Should I buy", "score": 1, "replies": []}, {"body": "$187 😭", "score": 1, "replies": []}]}
