{"title": "[deleted by user]", "selftext": "[removed]", "id": "12dw79q", "created_utc": 1680811508.0, "score": 697, "upvote_ratio": 0.95, "num_comments": 104, "comments": [{"body": "That’s my bi weekly Robinhood reoccurring investment", "score": 583, "replies": [{"body": "Your wife and I are grabbing some hot n readys otw home champ!", "score": 99, "replies": [{"body": "Lmao", "score": 14, "replies": []}]}, {"body": "DCA or die, lmao.", "score": 5, "replies": []}, {"body": "Robing the hood you mean.", "score": 0, "replies": []}, {"body": "[removed]", "score": -3, "replies": [{"body": "Sure 60% of the time it works every-time", "score": 8, "replies": [{"body": "It's illegal in 9 countries", "score": 4, "replies": []}]}]}]}, {"body": "Given the timing and size, those are most likely MOC flows.", "score": 93, "replies": [{"body": "MOC?", "score": 19, "replies": [{"body": "https://www.investopedia.com/terms/m/marketonclose.asp\n\nAll moc orders are combined for each given stock, and the imbalance is settled at the close. If 500 shares are to buy and 400 are to sell, among 10 accounts, 400 shares move directly between buys and sellers and the broker makes a 100 share buy at close, to get the last 100 shares for the buyers.  All transactions happen at the closing price. Names like MSFT can have very large imbalances, because thousands of people make the orders. The trade in this post is actually pretty small. $250m imbalances for a mega cap isn’t uncommon. Nvda had 1.2 million share transaction at close. About $300m.", "score": 95, "replies": [{"body": "Wouldn't doing this remove the actual supply/demand signal from the market? If my friend and I trade Pokemon on the side, no one would know there's transactions.", "score": 14, "replies": [{"body": "Yes, but it’s very cost efficient for the broker so", "score": 20, "replies": [{"body": "So screw price discovery in the name of convenience for brokers and market makers", "score": 18, "replies": [{"body": "Pretty much sums up this whole game.", "score": 7, "replies": [{"body": "Unfortunately, yeah", "score": 5, "replies": []}]}]}]}, {"body": "No, the imbalance of the two sides is still visible to the market. It doesn't change anything. Who cares if 1 billions shares trades hands all at once, the ONLY thing that matters is the imbalance of that. And that is still, obviously, known to the market. Further, these trades are set to transact at the closing price, which is important to some trading strategies. If you have an open option position that will execute (get assigned) at the closing price for a security, on a given day, you may need to counter that by transacting shares at the exact same price that the option will transact at, to prevent any imbalance. It is a very important aspect to the market and there is absolutely nothing nefarious about it.", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": -15, "replies": []}]}, {"body": "Twas me.", "score": 64, "replies": [{"body": "‘Twas a cat.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 60, "replies": [{"body": "This is actually a buy *and* a sale", "score": 12, "replies": [{"body": "The stock moved up overall so there's obviously more buying and less selling. How did you even get a job here?", "score": -11, "replies": [{"body": "The amount of buying and the amount of selling are equal 🤓", "score": 13, "replies": []}]}]}, {"body": "This is correct", "score": 1, "replies": []}]}, {"body": "I was going to buy some Microsoft today but it’s a slow grower so maybe on the next dip.  With AI, the wars and it’s lobbying power, it should perform well.", "score": 36, "replies": [{"body": "It’s never too late.", "score": 10, "replies": [{"body": "It’s too late.  Don’t pump and dump.  It’s unbecoming.", "score": -15, "replies": [{"body": "You’re not thinking long term on Microsoft", "score": 10, "replies": [{"body": "MSFT over decades had been great.  But you can be smart about how you invest over time.  MSFT is over valued at this moment in the 2023 cycle.", "score": -10, "replies": [{"body": "Check back in 6 months", "score": 5, "replies": [{"body": "You owe me in 6 months. 😂", "score": 5, "replies": []}]}, {"body": "I agree it's currently overvalued. Should come down in the near future as the market cycles lower once again after a nice pump.\n\nBe patient... It'll come down in price. I'm a buyer at $260", "score": -4, "replies": []}]}]}]}, {"body": "Never too late for...?", "score": -3, "replies": []}]}, {"body": ">I was going to buy some Microsoft today but it’s a slow grower so maybe on the next dip.  With AI, the wars and it’s lobbying power, it should perform well.\n\nYeah, Microsoft has been a solid performer for a while now. It's definitely one of those stocks you can hold on to for the long term.", "score": 3, "replies": []}, {"body": "It’s a grower not a show-er", "score": 2, "replies": []}]}, {"body": "Happens everyday at close on almost every stock, just watch the T&S tape and you shall see.", "score": 15, "replies": [{"body": "Yup, market manipulation at its finest. It's not uncommon for big players to make huge moves like this right before close, either to cause a price surge or suppress a price drop. Good catch on the T&S tape though, it's always helpful to keep an eye on those transactions.", "score": 2, "replies": []}]}, {"body": "ChatGPT making some purchases", "score": 11, "replies": [{"body": "\"The year is 2065, it is a dead America. By the time we realized Chat GPT was sentient it had already bought controlling stake in Microsoft and Nvidia and was controlling progress from behind the scenes.  Ten years ago today Microsoft and Raytheon jointly released their state of the art robo hounds equipped with 200 .22 rounds for police patrolling. No one questioned it and they were only .22 rounds. Until most policing were done with the hounds and we realized each county had some 300 hounds. Then GPT gave the order....\"", "score": 16, "replies": [{"body": "I just love this. Thanks for brightening my day.", "score": 3, "replies": [{"body": "I worded that *really* poorly.", "score": 3, "replies": []}]}]}, {"body": "_How about a nice game of tic tac toe?_", "score": 1, "replies": []}]}, {"body": "No one tell him", "score": 9, "replies": []}, {"body": "The deal is good. We're about to get Activision into Microsoft's palm. Hope we get StarCraft 3 on gamepass.", "score": 6, "replies": [{"body": "Dude same, or some new co-op content for sc2", "score": 3, "replies": [{"body": "Give us all of that shit with a gamepass vision and let them get fucking wild with it. Diablo 4 as well.", "score": 1, "replies": []}]}, {"body": "Ugh. Still pissed they bought Fasa Interactive and killed MechCommander 2.", "score": 1, "replies": []}]}, {"body": "Dividend reinvestment. No biggie.", "score": 4, "replies": []}, {"body": "Lol I was wondering if I should take profits soon.", "score": 3, "replies": []}, {"body": "It’s the closing auction candle", "score": 5, "replies": []}, {"body": "Shortz", "score": 5, "replies": [{"body": "Yeah I was thinking probably a massive hedge", "score": -1, "replies": []}]}, {"body": "That was my uncle Pino", "score": 2, "replies": []}, {"body": "That was me… wait till the check bounces", "score": 2, "replies": []}, {"body": "What app is that?", "score": 2, "replies": [{"body": "Think or Swim", "score": 1, "replies": []}]}, {"body": "shit I meant $3.50", "score": 2, "replies": []}, {"body": "Damn, I meant to sell but pressed buy instead", "score": 2, "replies": []}, {"body": "Gates shorted Tesla,now it's Elon turn shorting Microsoft.", "score": 2, "replies": []}, {"body": "Pelosis husband?", "score": 2, "replies": []}, {"body": "And someone bought $17,000,000 1 sec after bell too!!!", "score": 1, "replies": [{"body": ">And someone bought $17,000,000 1 sec after bell too!!!\n\n I wonder what the investor's strategy is. Maybe they know something we don't.", "score": 1, "replies": []}]}, {"body": "CRAAAAAASH", "score": 0, "replies": []}, {"body": "What Chart", "score": 0, "replies": [{"body": "Microsoft", "score": 2, "replies": []}]}, {"body": "Why do they wanna short it?", "score": 0, "replies": []}, {"body": "Definitely not what that is. Maybe turn off the charts and start doing some basic reading.", "score": -8, "replies": [{"body": "My god dude relax. I swear sometimes people on Reddit are the most rude assholes. Would you ever say that to someone you never met?", "score": 3, "replies": [{"body": "It’s strange you see this as heated. Sounds like you don’t have a ton of interaction with other humans. \n\n\nTo your question: Yes. I would literally say that to a junior staff.", "score": -5, "replies": []}]}]}, {"body": "Ok and??", "score": -1, "replies": [{"body": "Just thought it was interesting 🤷‍♂️", "score": 2, "replies": []}]}, {"body": "big news this weekend? MSFT is a huge buy right now. especially since it has its fingers in GPT. I am probably going to increase my stake", "score": -2, "replies": []}, {"body": "Sorry, I made it too noticeable", "score": 1, "replies": []}, {"body": "I should’ve waited to sell my covered calls", "score": 1, "replies": []}, {"body": "Oh that was me thanks for noticing.", "score": 1, "replies": []}, {"body": "Do you mind sharing the ThinkScript code for the MovingAvgExpRibbon? Thanks", "score": 1, "replies": [{"body": "", "score": 1, "replies": []}]}, {"body": "Let me guess…Rhymes with Schmelosi", "score": 1, "replies": []}, {"body": "that was me", "score": 1, "replies": []}, {"body": "Wow, that's a massive buy! 💰📈 Do you think it could be an institutional investor or someone with a lot of confidence in Microsoft's future growth?", "score": 1, "replies": []}, {"body": "Somebody knows something....", "score": 1, "replies": []}, {"body": "AGI might already be live.", "score": 1, "replies": []}, {"body": "🥵", "score": 1, "replies": []}, {"body": "This you, Bill?", "score": 1, "replies": []}, {"body": "So?", "score": 1, "replies": []}, {"body": "I have 6 shares😂", "score": 1, "replies": []}, {"body": "Because I sold my shares just before", "score": 1, "replies": []}, {"body": "What is the best broker for buying and selling stocks options and all that", "score": 1, "replies": [{"body": "Let me know if you have figured out the answer.", "score": 1, "replies": []}]}, {"body": "It was the dude that took Gates's mugshot back in the day", "score": 1, "replies": []}, {"body": "35mil isn’t really that significant. If it was 3.5bil, then I would be watching", "score": 1, "replies": []}, {"body": "Who would have known the [closing auction](https://www.nyse.com/network/article/nyse-closing-auction) takes place when the bell rings? \n\nOut of all the comments here I only saw one mention it. Seriously OP, and everyone else, you are interested enough in stocks to crawl through order books but never heard about the closing auction? I wish 2020-2021 never happend", "score": 1, "replies": []}, {"body": "Only 35m and the price even flinched with 2T mcap?", "score": 1, "replies": []}, {"body": "Hey, what’s indicator is this?", "score": 1, "replies": [{"body": "Just a moving average ribbon. I believe this one is built in", "score": 0, "replies": []}]}, {"body": "It'll be worth 20 million in about 3 weeks", "score": 1, "replies": []}, {"body": "Blackrock", "score": 1, "replies": []}, {"body": "Paul Pelosi… that’s my big signal", "score": 1, "replies": []}, {"body": "Bill?", "score": 1, "replies": []}, {"body": "Good.  Been a share holder for over 25 years and only owned Apple longer.\n\nBut pre-market does not show any movement.", "score": 1, "replies": []}, {"body": "Crazy", "score": 1, "replies": []}, {"body": "Must be a senator or congressman", "score": 1, "replies": []}, {"body": "Finger slipped…", "score": 1, "replies": []}]}
{"title": "Everything is up YTD. Cash is worst performing asset", "selftext": "Hello all,\n\nHeavy cash holders (including me) missed a lot of gains this year so far. S&P 500, Nasdaq, Precious metals, Bonds and even Crypto are all up YTD.\n\nPersonally, I transitioned to cautiously bull in March because bears ran out of catalysts that will break the market. Market shook off bad earnings, recent Fed hike and regional bank crisis. CPI data next week will probably show continuing decline in inflation. Fed is almost done hiking (probably 0 or 1 more hike). Bonds market is expecting massive rate cuts EOY. Recession expectation went up last month but market kept rising. Q2 earnings will likely not be great but less than feared and market will probably shake it off. \n\nBears were expecting a market flush and capitulation but it will likely never happen as long as many investors are cash-heavy and have jobs.\n\nI considered waiting until May, after earnings, and start buying regardless of the prices.\n\n***If you have not bought already, what is the signal you are waiting for to start buying?***\n\nDisclaimer: I am currently 60% cash, 40% stocks. My ultimate plan is to reach 60% stocks and 40% cash by end of year.", "id": "12dsx1a", "created_utc": 1680805056.0, "score": 935, "upvote_ratio": 0.87, "num_comments": 445, "comments": [{"body": "Always remember that dead people have the best performing portfolios", "score": 1189, "replies": [{"body": "That is a good reminder", "score": 149, "replies": []}, {"body": "Meanwhile the dead guy’s portfolio is invested in Sears, Enron, Adelphia, Kodak, and JcPenny.", "score": 292, "replies": [{"body": "Nah, in an S&P500 ETF. Dead guy is rich now.", "score": 110, "replies": [{"body": "I think his secret is that he has really cut down on spending.", "score": 22, "replies": []}, {"body": "McDonalds ia all time highs", "score": 24, "replies": []}]}, {"body": "> Adelphia\n\nNow that name does take me back.", "score": 19, "replies": [{"body": "To where? I'm curious 🤔", "score": 5, "replies": [{"body": "To Coudersport Pennsylvania", "score": 5, "replies": []}, {"body": "Prolly Philadelphia", "score": 16, "replies": []}, {"body": "To the 90s.", "score": 2, "replies": []}, {"body": "The Streets of Phil Adelphia", "score": 2, "replies": []}]}]}, {"body": "If you had a portfolio with an equal amount of all 5 of those stocks plus Apple, you still would have obliterated the market. Losers can only go down to zero. Winners can go up forever.", "score": 20, "replies": []}, {"body": "We said best-performing, so idk what grounds your joke is based on. Holding has contributed to Warren Buffet’s success.", "score": 3, "replies": []}, {"body": "https://www.joshuakennon.com/eastman-kodak-example/\n\nAnd he's still very rich", "score": 1, "replies": []}, {"body": "Dead would have been too dead to have invested in Enron in the first place since it was only around for 15 years before the scandal.", "score": 1, "replies": []}]}, {"body": "Close second: people who can't find their passwords, followed by working parents who forgot they were invested in the first place.", "score": 45, "replies": []}, {"body": "So I need to kill myself to see gains? How does that help me?", "score": 53, "replies": [{"body": "Something something generational wealth", "score": 6, "replies": []}, {"body": "You get a nice casket you don't know about.", "score": 5, "replies": []}, {"body": "-\"The 988 Suicide & Crisis Lifeline is a United States-based suicide prevention network of over 200+ crisis centers that provides 24/7 service via a toll-free hotline\"", "score": 13, "replies": []}]}, {"body": "Yeah. Personally I would take all of the cash that isn’t needed for a decade and average it into equities and close the books.", "score": 10, "replies": []}, {"body": "Basically, time is your friend.", "score": 6, "replies": []}, {"body": "Can you explain?", "score": 10, "replies": [{"body": "Set and forget regular index buys + No fucking around predicting the future = profits.", "score": 44, "replies": [{"body": "There was a study at vanguard that the best performing investors were actually dead and didn’t have access to make trades.", "score": 16, "replies": [{"body": "\"Time in the market > Timing the market\"  \n\n~ sum billionaire", "score": 1, "replies": []}]}]}, {"body": "Time in the market beats timing the market. Total stock ETFs (E.g. SPY, QQQ) on a set forget portfolio with reinvestment plan will outperform managed funds 96% of the time over 10+ year periods.", "score": 33, "replies": [{"body": "What's \"reinvestment plan\"?", "score": 1, "replies": [{"body": "You tick the little checkbox that says “Reinvest capital gains and dividends”. \n\nThat’s it. That’s the plan.", "score": 9, "replies": [{"body": "lol, solid plan!", "score": 3, "replies": []}]}]}]}]}, {"body": "I’ve heard this hundreds of times but no one has ever been able to link or reference a source", "score": -16, "replies": [{"body": "[removed]", "score": 61, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "This seems... Made up?", "score": 4, "replies": []}]}]}]}, {"body": "Not sure why you got 13 downvotes for asking for a source. None of the replies provide one either.\n\nThis place sucks.", "score": 41, "replies": [{"body": "https://theconservativeincomeinvestor.com/fidelitys-best-investors-are-dead/", "score": 9, "replies": [{"body": "That’s not a primary source though. That references a Fidelity study, which might not actually exist. Other authors have asked about it, and they claim that Fidelity doesn’t know what they’re talking about. \n\nhttps://www.morningstar.com/articles/964493/from-the-archives-in-praise-of-the-dead-investors\n\nI’ll add this: yes, messing around with your investments is a good way to underperform. However, if you really do never interact with your account, it might be liquidated to cash and turned over to a state agency (as [Walter Schramm learned the hard way](https://www.npr.org/2020/02/13/805760508/when-your-abandoned-estate-is-possessed-by-a-state-thats-escheat)).", "score": 5, "replies": []}]}, {"body": "The source is every study showing passive index investing beats active management. Which can be written in a funny way to point out the ultimate investor would one who was not able to ever make an active trade", "score": 7, "replies": []}]}, {"body": "There actually isn't a legit source. The story of the dead investors afaik was first mentioned by James O'Shaughnessy back in August 2014. He was being interviewed by Barry Ritholtz on his Masters in Business podcast for Bloomberg Radio, and brought up this supposed study conducted by Fidelity between 2003 and 2013.\n  \n[Sept 2014 Bloomberg Radio article by Barry](https://www.bloomberg.com/opinion/articles/2014-09-02/masters-in-business-james-o-shaughnessy?leadSource=reddit_wall)\n  \n[Aug 2014 Podcast Link](https://www.mixcloud.com/mastersinbusiness2/masters-in-business-james-oshaughnessy-audio/)\n  \nEDIT: [This](https://www.businessinsider.com/forgetful-investors-performed-best-2014-9) is likely the first article to come out following the podcast that makes reference to James O'Shaughnessy's claim of a Fidelity study, and it just snowballed from there.\n  \nEDIT 2: O'Shaughnessy himself tweeted in July 2019 that there's no such study and the story which was told to him by a friend is likely not true. https://twitter.com/MikeZaccardi/status/1155165032101138433", "score": 11, "replies": [{"body": "https://theconservativeincomeinvestor.com/fidelitys-best-investors-are-dead/", "score": -1, "replies": [{"body": "The article you keep linking is written in 2020. It's not a source. It just makes a claim of a supposed Fidelity study like dozens of articles written before it going all the way back to 2014. All these articles are referencing James O'Shaughnessy's claim without providing any source themselves either.", "score": 3, "replies": []}]}]}, {"body": "This is usually associated with investment manager Peter Lynch, who had a good reputation for investing in the mid-80s to early 90s as a fund manager for Fidelity. \n\nHere’s a link to the Wikipedia:\nhttps://en.wikipedia.org/wiki/Peter_Lynch\n\nIf you go to “investment philosophy” and scroll down a bit, you’ll find a much more detailed quote explaining that thesis. \n\nI hope that helps.", "score": 3, "replies": []}, {"body": "Thanks for asking. I hadn’t realized how apocryphal that story was. It’s brought up everywhere (Fidelity performance review of customer accounts reveals dead investors are the best or some such), but it might have been invented whole cloth.", "score": 6, "replies": [{"body": "So the time in the market adage is essentially unconfirmed? Or is it the dead investors thing?", "score": 0, "replies": [{"body": "https://theconservativeincomeinvestor.com/fidelitys-best-investors-are-dead/", "score": -1, "replies": []}]}, {"body": "Buffett won the bet he made to this effect, however.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 14, "replies": [{"body": "A quote from literally the first hit of the search you linked:\n\n>Unfortunately, I've never been able to locate the original study and Fidelity doesn't seem to remember it either. The story is probably a hoax.\n\nIf you're gonna be a dick about it at least be right", "score": 28, "replies": [{"body": "https://theconservativeincomeinvestor.com/fidelitys-best-investors-are-dead/", "score": 0, "replies": [{"body": "A blog post repeating the story doesn't count as a source. Everytime the \"internal review\" is vaguely referenced and yet it's nowhere to be found. \n\nThe review doesn't exist; that doesn't mean the sentiment is untrue. Just have to stop using that anecdote to illustrate it is all.", "score": 3, "replies": [{"body": "That's fair. I can't find Fidelity's study but it was apparently internal. So I expect there's some truth to it but for privacy reasons they don't publish it.", "score": 2, "replies": []}]}]}]}, {"body": "> Unfortunately, I've never been able to locate the original study and Fidelity doesn't seem to remember it either. The story is probably a hoax.\n\nThe first link. For shame", "score": 8, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Ya it pops up in the WSJ during interviews ect", "score": 3, "replies": []}]}]}, {"body": "Trolling, insults, or harassment, especially in posts requesting advice, is not tolerated.  Please try to keep discussions on /r/stocks civil by providing straightforward responses without including any insults or harassment.\n\nContinual abuse of /r/stocks rule #5 regarding trolling, insulting and harassment will result in your account being banned.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 2, "replies": []}]}, {"body": "I recall a finance podcast saying that this was found by research done by Vanguard.", "score": 0, "replies": []}, {"body": "Of course, they are dead…", "score": 1, "replies": []}, {"body": "https://theconservativeincomeinvestor.com/fidelitys-best-investors-are-dead/", "score": 1, "replies": [{"body": "That references an account audit done by fidelity but doesn’t link to the audit, study, or even press release issued by fidelity\n\nWhere did the original comment or idea come from?", "score": 3, "replies": []}]}, {"body": "Based on the downvotes, I legitimately thought this thread was in in /r/investing", "score": 1, "replies": []}, {"body": "Example: any college endowment\n\nSee how easy that was?", "score": 1, "replies": [{"body": "How is that an example?", "score": 2, "replies": []}]}]}, {"body": "So if they hold cash in banks and die they still perform best?", "score": -10, "replies": [{"body": "Dead investors in stocks*", "score": 17, "replies": []}]}, {"body": "This guy obviously hasn’t heard of Eggon the chicken, or the goldfish", "score": 1, "replies": []}, {"body": "What’s any good having that portfolio if you never get to use it for yourself/family?", "score": 1, "replies": []}, {"body": "I had a client die with an outside account 890k invested in tech and 3x leveraged ETFs it fucking crashed while probate process was taking place and now it’s worth 347k sooooo…", "score": 1, "replies": []}]}, {"body": "Small caps are not up", "score": 174, "replies": [{"body": "Thankfully they're not! \n\nRecent contributions have gone into AVUV and I'll keep buying so long as it's an underperformer and on the low side of my portfolio allocation. \n\nHistorically small cap value has outperformed even the S&P500. More volatility though, but great time to buy when the last 5 years (VBR) is only up 19% vs (SPY) 53%.", "score": 30, "replies": [{"body": "Or if there is a recession small caps will take the brunt", "score": 13, "replies": [{"body": "Definitely possible. If a recession lasts that long and it underperforms then that sucks but nothing I can do about it. \n\nMy armchair macro take is sooner or later rates will have to come back down. Maybe not this year but I'd be shocked if it's not by end of next year. When that happens I believe small cap will outperform mid and large cap during the next cycle. \n\nAs you probably know a handful of green days can make or break a huge chunk of expected gains. I've tried to time it in the past and it's just not worth it. I timed covid extremely well and still, having to pay attention to the market/economy was too stressful and time consuming. There's plenty of people smarter than I who can't beat the market. I've learned to humble myself, stick to allocations and be long term oriented. I still buy individual stocks but I have my rules and lines not to be crossed.\n\nIf you're buying any major fund such as VTI, SPY, QQQM etc they're all ~75%+ large cap. I like a bit of alpha in my life so I'll put the chips in with the odds in my favor and what happens, happens. AVUV/small cap is only 5% of my portfolio anyways.", "score": 2, "replies": [{"body": "True I’m the same way.\n\nRight now I’m 30 SCHD 30 MGK 30 VOO 10 AVUV", "score": 1, "replies": []}, {"body": "What are your holdings?", "score": 1, "replies": []}]}]}, {"body": "I like the way you think.", "score": 4, "replies": []}]}, {"body": "Banks,Reits, Insurance , even PFE,CVS,CNC ,Retail  like stocks are down too. I am going to add REITS sooner as I don't have any in my portfolio.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 483, "replies": [{"body": "This. Sure. Its great if you got into it jan 1st but... what about your other gains as you continued to contribute? Its sideways, its almost been sideways for a year now", "score": 73, "replies": [{"body": "This. Im still down from 2021...", "score": 45, "replies": [{"body": "this... this is too bad", "score": 13, "replies": []}]}, {"body": "As a millennial, that finally has a well paying enough job and no debt, if I start investing now, it's programmed to stay sideways for 20 years.", "score": 4, "replies": []}]}, {"body": "Hahaha true", "score": 23, "replies": []}, {"body": "All abooard for the crash!", "score": 9, "replies": []}, {"body": "It is going to crash. No doubt.", "score": 5, "replies": [{"body": "Why?", "score": 1, "replies": []}]}, {"body": "Just gotta pull up a 2 year chart to put things in perspective.", "score": 1, "replies": []}, {"body": "VTI is only up 7% YTD, and at the same level as it was in Dec and Oct last year. We're sorta drifting sideways now.\n\n&#x200B;\n\nEven the 1989 crash went back to ATH \\~1.5 years later so unless we see a 1929 style depression (i.e. banks crash and there's no FDIC), I think we're fine. We're nowhere near 1929 and/or 2008 issues. \n\n&#x200B;\n\nUnfortunately I don't know how LONG we're gonna drift sideways, but I'm not stressed there's gonna be ANOTHER 20% drop from where we're at today (but possible).", "score": 1, "replies": []}]}, {"body": "My 1300 shares of Wish.com are not up sir.", "score": 138, "replies": [{"body": "[deleted]", "score": 37, "replies": [{"body": "Good news: your wish has been granted\n\nBad news: it was a knockoff wish from… wish.com", "score": 39, "replies": [{"body": "Wait this looks weird... Wtf is a \"woosh\"", "score": 3, "replies": []}]}]}, {"body": "Sir it seems to be up 5% today", "score": 2, "replies": []}, {"body": "I bought at 7, sold at 14. Friend of mine bought at 12 (1000 shares) and is still holding...\n\n\nBut I put all the profits from wish into an array of cannabis stocks...soooo....yeahhh.... Fuck", "score": 1, "replies": [{"body": "lol same...bought at 7 watched it get to 14 and held...was an expensive lesson.", "score": 1, "replies": []}]}]}, {"body": "Retail don’t like to admit it but generally they are too scared to really buy low and sell high. \n\nEveryone talks a big game but forget that when equities are low they are low for a reason. Most of this sub are like ‘well duh there’s 20 problems in the economy that won’t get resolved anytime soon I’ll buy when there’s more clarity’ not realising that of course there’s 20 problems with the economy otherwise we wouldn’t be this goddamn low in the first place! \n\nYou wanna be that guy in 2001/2009/2020 that bought the bottom? You’ve got to buy when the problems are numerous and clarity is scarce. If you can’t do that then stop f*cking moaning about it.", "score": 311, "replies": [{"body": "Well put.  Buy META when they are getting shit talked all day on CNBC.  Buy COIN when FTX has absolutely devastated trust in the space.  Buy Schwab when regional banks are dropping left and right.", "score": 89, "replies": [{"body": "Schawb is seeing movements from regular deposit accounts go towards money market funds. What that means is that they aren’t able to profit from the float of lending out customer funds held as deposits which paid like nothing.\n\nThis was a big part of Schawbs business model. The stock price is reflecting the potential poor financial performance when this leg of the business just got sawed off.\n\nWhile insolvency isn’t a huge risk, they will just go down because of good ole underperformance because they cant capture float anymore.", "score": 28, "replies": [{"body": "Good see! This Guy is bearish. That means buy SCHW!", "score": 28, "replies": [{"body": "No, that just means do your analysis on why SCHW is down even though they are clearly not facing insolvency risk…\n\nBut I guess the rest of the market is too dumb to understand SCHW’s biz model.\n\nJust like they misunderstood $FRC and should have bought the dip… that kept on dipping.. sure, must be that.", "score": 4, "replies": [{"body": "Obviously I was being slightly facetious but also the market needs both bears and bullish for everything, otherwise it would only just move in one direction always. Regarding your SCHW comments, correct if wrong but aren’t MMFs influenced by the rate hikes? So when those stop, the MMF yields will go back down and won’t be as enticing. That will bring people back to the original business model. So you’re referring to something that will only impact them for a few more quarters potentially: certainly the share price could go down more from here but you’re acting like this short term problem is chopping the knees off of a company that survived and thrived after the event in the last 30+ years. I’m a buyer at $50 here personally to DCA a new position and will buy more if it goes to low $40s.", "score": 3, "replies": []}, {"body": "You sounded sensible until your last paragraph. Buy the dip on FRC then it kept dipping. It’s been one month! Is that the length of time you normally judge an investment?", "score": 2, "replies": [{"body": "In the situation where the market can identify when terminal risks disappear and should reprice a stock? Yea, I generally give it a few weeks to clear. But risks have clearly not disappeared in $FRC. \n\nSo do we think wallstreet investors are scaredy cats for the stock is priced for a terminal insolvency risk that still exists? \n\nThe news after the larger banks placed deposits with $FRC as a confidence move… did not move its stock. So what is the market thinking? \n\nI never said to judge an investment in a few months. But I prefer not to risk permanent capital losses in a play like $FRC..\n\nSo is $FRC “investing” or speculating on its ability to survive? Wouldn’t you rather invest your money into something that isn’t facing such terminal risks but rather can continue compounding growth?\n\nYou have this weird thesis on me that I don’t throw down conviction on a stock when sentiment is shitty. I’ve been expanding my position into $META when it crossed below $100 and a bit above that. I know when there’s misplaced fear and misunderstanding/sentiment. I do not believe $FRC is that..", "score": 2, "replies": [{"body": "I’m not invested in banks (outside of my circle of competence) but a price movement in a month is not indicative of you being correct - which is what you implied. Give it time before judging.", "score": 2, "replies": [{"body": "Sure I’ll absorb this point and check back on my thesis’s on the names in 90+ days when we get new data points on Q2. !remindme", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Buy Credit Suisse when they are getting hammered by overreaction on fears of market contagion. Buy SHOP since it can't possibly hang around 60%+ below ATH. Buy SQ because it's a solid business and oversold. Oh wait 🤔\n\nGuess I'm saying there are stocks to buy the dip on, and stocks to avoid. Only sure thing is buying the dip on the SPY long term.", "score": 2, "replies": []}, {"body": "The only time I won't buy a stock that's being trash talked about is when it can genuinely go bankrupt. Meta would have to try extremely hard to go bankrupt.", "score": 1, "replies": []}, {"body": "I did buy Schwab and I'm actually down on it:))\n\nSame for FRC", "score": 1, "replies": []}]}, {"body": "They think that \"more clarity\" somehow means that they're the only ones that are going to have clarity. Like no idiot, if you have clarity so does everyone else. And when everyone else knows you'll miss out on most of the gains.", "score": 27, "replies": [{"body": "Usually amateurs get clarity days/weeks after the heavy buying pros have it or have taken a well calculated risk so Its not an even playing field anyway. A lot of gain is made the first few days up from when the market bottoms.", "score": 2, "replies": []}]}, {"body": "Honestly, I’m retail as it gets and I hammered the buffet saying into my head. I was really greedy in the summer and fall of ‘22, and I genuinely feel like it will be the thing I look back on that really got me set. I always DCA through 401, and max Roth, but I made a choice to not buy a house in California and started deploying cash to stocks in my brokerage heavily. \n\nStarted DCA on June 22, rode up a bit and kept adding through the end of the year. \n\nIt could also get cut in half in a few months for all I know, but what I do know is that I would double down again and deploy the cash I can. \n\nI also have the luxury of a +25 year timeline, so most retail traders don’t because they start late investing tbh.", "score": 5, "replies": [{"body": "Good for you man. I’ve been investing since 2008 (just before the big meltdown lol) and saw a lot of legitimate fear. I’m a doctor so my job was never at risk and I just kept buying. Of course social media wasn’t as ubiquitous then and you didn’t have apps where you could see your investments minute by minute and this certainly helped. \n\nIf you ask most investors who’ve held for decades they regret not buying more rather than less and I’m no exception. Get any of that spare cash working!", "score": 6, "replies": [{"body": "I’m glad you said that! It’s great getting these big reminders that people feel the way you do and to keep buying! \n\nIt’s funny the post we are commenting on, and now today all I hear about is the recession is here!! Panic!!  Lol \n\nI’m just gonna keep buying… haha", "score": 4, "replies": []}]}]}, {"body": "I find this SO confusing. There’s a great opportunity, data back to the twenties….why sell low? Why hold cash losing so much? Why not invest when things are lower? Data support that as well…trend is up?", "score": 3, "replies": [{"body": "Can’t eat stocks.", "score": 20, "replies": [{"body": "Fair enough. But keep enough in cash equivalents (short term these days at 5+%,) to buy beans and 10 for $10 frozen veg…go a bit extra and grow a “victory garden” from scraps on a window sill…I mean, of course, eat.  \n\nI have been in situations in the past in which I e sold my holdings for surviving. \n\nThis doesn’t seem to be about that though? Invest what one can. Avoid selling low. There seem to be so many arguing against this. \n\nMoney making money will buy more food than money losing money in a mattress?", "score": 3, "replies": []}]}]}, {"body": "It’s so hard, but being contrarian does make money.", "score": 1, "replies": []}, {"body": "fearful when others are greedy. greedy when others are fearful.", "score": 1, "replies": []}, {"body": "In 2009 the P/E ratios were much lower than now and there were much less online brokers. I would not compare the situation to today. Currently a lot of the market is priced fairly or vastly overpriced (hello NVDA :-)).", "score": 1, "replies": [{"body": "Wrong I’m afraid. In 2009 (like in all other bottoms) the P/E ratios were high as earnings had been slashed to extreme levels due to the severe recession. \n\nWhat was the S&P 500 P/E in 2009 when the market bottomed? 71 (yes seventy-one).", "score": 2, "replies": []}]}, {"body": "Oh so you buy when there's a real vix spike and capitulation? (which hasn't happened) Look at the NY Fed's recession probability in 12 months based off of the 10yr 3mo spread. There will most likely be a recession. Patience is key. I'm no genius, but the fed has raised rates faster than any other time in history and those rate hikes have yet to really slow the economy.  They should have hiked rates much earlier than they did, and by trying to make up for lost time, the fed will cause a recession.\n\n[Milton Friedman \"Fool in the Shower\"](https://www.investopedia.com/terms/f/fool_in_the_shower.asp#:~:text=%22Fool%20in%20the%20shower%22%20is,rather%20than%20all%20at%20once)\n\n[NY Fed Recession Probability](https://www.newyorkfed.org/research/capital_markets/ycfaq#/)", "score": 1, "replies": [{"body": "You had me at ‘I’m no genius.’", "score": 2, "replies": [{"body": "Just remember me when the vix is 35+ and spy is 300-320 kk? The stock market is currently pricing in a soft landing and the bond market is pricing in a recession. Im going to listen to bonds. You need real fear for a true bottom. It already happened with China when Xi got re-elected and Kweb was down 20% in a day (I caught that one for 100% on shares)", "score": 1, "replies": [{"body": "Oh well done for catching the bottom on KWEB - I similarly caught the very bottom of the covid crash and I too, much like yourself, can make shit up with absolutely no obligation to prove myself.", "score": 2, "replies": [{"body": "What do you think I am making up? My personal purchase of Kweb is kind of irrelevant- I was just giving a recent example of a real capitulatory bottom. You can do whatever you like, man.", "score": 1, "replies": []}, {"body": "https://imgur.com/a/BZ7ZZt5", "score": 1, "replies": []}]}]}]}]}, {"body": "yes but equities ARE NOT low at all. they are super high.", "score": 1, "replies": [{"body": "Have a guess what the SPY P/E was when the market bottomed in 2009.", "score": 2, "replies": [{"body": "high because earnings had collapsed. But earnings haven't even collapsed yet. So the PE would get a lot higher when earnings take a hit, then the market falls, then that marks a bottom. The market hasn't fallen yet. Where do you see a bottom? If you run a trend line from 2013 to today, it's a straight line up with an anomaly from printing money in 2021. That anomaly is gone now but there hasn't been much of a dip below that trend line.", "score": 1, "replies": [{"body": "History also tells us that the market bottoms before corporate earnings do. \n\nYou say earnings haven’t collapsed yet and this is true. But bears have been predicting earnings to collapse for one year now. What if this epic collapse does not happen? \n\nEveryone is screaming a recession so I seriously doubt we see one this year. Inflation is coming down, the job market is still strong, GDP is still growing.", "score": 2, "replies": [{"body": "yea but credit conditions are tightening, savings depleted, credit card loans high..  and for example the pc sales went down almost 30% compared to last year but the tech stocks haven't reacted to this.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I’m confused, based on your post why are you holding so much cash and continue planning to hold 40% cash?", "score": 62, "replies": [{"body": "For emergencies and I am looking to buy a real estate.", "score": 52, "replies": [{"body": "Where are you planning to buy property?", "score": 3, "replies": []}, {"body": "[deleted]", "score": -44, "replies": [{"body": "Yeah wait for interest rates to come down and buy an inflated price.", "score": 2, "replies": []}]}]}, {"body": "I think it's operationally beneficial to keep some cash. For example, when stocks fall, you can increase your position to reduce costs. And when the stock rises, you can also increase your position to increase your income. Can also be used for other intraday transactions", "score": 3, "replies": []}, {"body": "I've been rebalancing 50% cash in my stock/crypto portfolio since July 2021 and I am 6% up vs S&P being 6% down. It's been so volatile that the frequent rebalancing has had a net positive impact - always more cash to buy the low lows before they bounce", "score": 1, "replies": []}]}, {"body": "My IRA that had existed prior to the current crash is still down 8% percent. I started DCA and opening a couple new positions in my investment account but in cautious numbers. \n\nAlso learned a lot about bonds and dividend stocks because I don’t want to be cash heavy earning nothing. I’ll continue down this path to build a nice base. \n\nWe have not reached our last ATH’s and I don’t think we will for awhile.", "score": 24, "replies": [{"body": ">Also learned a lot about bonds and dividend stocks because I don’t want to be cash heavy earning nothing. I’ll continue down this path to build a nice base.\n\nI share the exact same sentiment. I'm a sucker for bonds and dividends, my portfolio has been faring the bear market pretty well thanks to them. Still building up a nice cash-generating foundation, my favorite part of my week is putting more money into it.", "score": 6, "replies": []}]}, {"body": "Earnings aren't up, the gains are entirely from multiple expansion and slightly lower long term yields.", "score": 59, "replies": [{"body": "Earnings and multiples don’t move hand in hand. One leads the other based on market expectations.", "score": 6, "replies": [{"body": "Right, multiples inflated because the market expects increased future earnings or decreased rates.", "score": 2, "replies": []}]}]}, {"body": "Just to play devil’s advocate, I’d argue commercial real estate, car loan, and credit shoes haven’t dropped yet. And if core inflation continues on its current path, they will.", "score": 101, "replies": [{"body": "TransUnion is warning of an increase in sub prime borrowers and an increase in defaults through 2023 and into 2024, was just in there 2022 Q3 credit analysis report", "score": 13, "replies": [{"body": "delicious", "score": 4, "replies": []}]}, {"body": "And looming student loan default crisis in q4", "score": 3, "replies": [{"body": ":D", "score": 2, "replies": []}]}, {"body": "This ☝️", "score": 9, "replies": []}]}, {"body": "It's up YTD because we had a big dip in December for whatever reason, at least possible tax-loss selling.  Then buyers started coming back.\n\nJudging anything like this over a few months and what is essentially just a coincidence is meaningless.  Unless you are on reddit!", "score": 13, "replies": [{"body": "Yeah, it's easy for everything to be up a lot YTD when the market low just happens to have come in just before the year started", "score": 5, "replies": []}]}, {"body": "The yields spread between risk free and stock earnings are like nil.\n\nHistorically it should be 3.5 points. It’s like closer to 1 points or worse since earnings are just coming in for Q1.\n\nLast time it was around 1? 2007. So 🤷🏻‍♂️ more downside risk than upside. Unless earnings can buck expectations and surprise to upside.", "score": 145, "replies": [{"body": "Bro is trynna time the market 😂", "score": 37, "replies": [{"body": "This sub is literally called r/stocks", "score": 38, "replies": [{"body": "🫏", "score": 1, "replies": []}]}, {"body": "Bro is using historical data between ERP amd fiuture returns and making a smart risk reward decision. You are blindly investing based on nothing and mocking someone who knows more than you.\n\nClassic reddit", "score": 4, "replies": []}, {"body": "Bro’s gotta bro", "score": 8, "replies": []}, {"body": "The brother time market is limited. 20,000 days and nights", "score": 0, "replies": []}, {"body": "Yea risk and reward doesn’t make sense for me here, hoping to make another $1M if markets give up 15% towards S&P500. 🤷🏻‍♂️", "score": -16, "replies": [{"body": "The idea is good, but the trend of the market may not give you face", "score": 4, "replies": [{"body": "18 mini bull runs before stocks bottomed from dot com.\n\nPerhaps.", "score": 2, "replies": [{"body": "I agree with you, I think next week the market will have a good one too", "score": 1, "replies": []}]}]}, {"body": "Your negative karma Reddit is giving you is making me even more bearish. I’m full port short right now. Just got in on the local high we had a couple days ago.", "score": 0, "replies": [{"body": "Lol I don’t worry too much about the opinions of people with shitty $50k portfolios. \n\nGive me a room of $1M-$10M portfolio owners and I’ll start listening. Most people are driven by sentiment, the past few weeks of bullish run changes sentiment. \n\nI’m being level headed and looking at the facts. Everyone assumes I’m either all in stocks or all in cash/bonds. I’m a blend with more dry powder than normal. That dry powder will be opportunity for me to add another $1M in returns. So 🤷🏻‍♂️ I’m long term bullish like the rest of the folks here, just not short term foolish.", "score": 2, "replies": []}]}]}, {"body": "Buy and hope is a hell of strategy when stocks are historically expensive compared to bonds. \n\nWho in their right mind is buying equities long term with the yield curve massively inverted and you can generate 4.5% risk free?\n\nThe only credible bullish argument right now that I see is that AI could be absolutely transformative over the midterm.", "score": 1, "replies": []}]}, {"body": "Wait so if I find one metric that’ll match any other year when we had a bull run that means we’ll 🤷 bull run? \n\nThanks for the clarity.", "score": 7, "replies": [{"body": "More like needing to find many more metrics to suggest the bull run and having the fed at your back.\n\nOr Just one metric to suggest a continued bear. The metric being, “should I can invest in a risk free at 5% or invest in a risk asset for 6% yield, where do I allocate until it’s clear that earnings will grow again?”", "score": 7, "replies": [{"body": "Ah the classic retail ‘I’ll buy when it’s clear earnings will grow again’ aka buy high. Let me guess you’ll probably sell low too?", "score": 3, "replies": []}]}, {"body": "Indicators are for reference only. The exact trend will depend on the current environment. The arrival of a bull market requires many factors. But it can be manifested in life. Economics, development, planning, inflation, and more are all essential", "score": 0, "replies": []}, {"body": "Yeah, the equity risk premium is totally a nonsense metric you should ignore. Jesus", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}, {"body": "Yeah but, as you said, earnings can grow, even without the % yield growing if there is price appreciation. Yields on the 10 year won't grow, and shorter term could fall.", "score": 4, "replies": [{"body": "Sure, or earnings can go down 5% because of slowdown while bond yields hold firm because fed keeping it high.\n\nThen what? \n\nThen… stocks come down until it makes sense to buy them.", "score": 22, "replies": [{"body": "Stocks are forward looking. I don't think they will come down a lot due to a mild recession", "score": -3, "replies": [{"body": "Perhaps. Or perhaps the market loses patience when fed keeps rates elevated and earnings come down. \n\nLabor markets stable, and inflation still above 2% targets, so no pivot. \n\nWill market forward look past that? How much patience will investors have?", "score": 9, "replies": [{"body": "This is what I am waiting on. Look at the sofr forward curves and the fed median curve. Sofr curves predicting rate cuts in then next 60-90 days. That much separation does not sit well with me", "score": 2, "replies": []}]}, {"body": "Stocks can be too forward looking at times. And they are right now.", "score": 1, "replies": []}]}, {"body": "But why would the fed keep rates high at that point? If there is high inflation then that will be reflected in higher earnings, so that scenario is unlikely. In a way stock yields could have some inflation protection.", "score": -5, "replies": [{"body": "Feds will keep rates high because nothing is breaking yet that can’t be fixed in a idiosyncratic way. They don’t need to lower rates. And inflation still too high. Housing prices and labor market still too resilient. \n\nSome companies can benefit from inflation. But COSTCO had -1% in revenue YoY.\n\nThey should have benefited from inflation. But it just squeezed consumers where people consume less.\n\nSo technically they actually had a -8% YoY performance. Since they had tailwinds on their existing prices.", "score": 13, "replies": [{"body": "That's what everyone thought in 2019, then the repo crisis happened and the fed u-turned. You can look at CPI during that time. It remained unchanged. Whatever reason the fed decided to hike rates (to attempt to return to more normal levels of reserves), it wasn't inflation that caused them to pivot. The bank situation we have now is worse. At the same time inflation is worse too, so its hard to know how the fed will react. But the chance that they will is probably being priced into stocks right now.", "score": -1, "replies": []}]}]}]}, {"body": "If yields can fall that's even more reason to be bullish bonds...\n\nOnly bear case for bonds is if yields go up...", "score": 1, "replies": [{"body": "Short term will probably fall, not necessarily long term which hasn't risen as much.", "score": 1, "replies": []}]}]}, {"body": "Historically stocks always return at least 10% over the long turn when they're this far off the ATHs. You can look at short term performance to justify bonds, but ultimately it's always a matter of having to time the market (in this case twice) to outperform the S&P that way.", "score": 0, "replies": [{"body": "Historically over the long term stocks have a massive rate of return. But when the risk premium is this low historically the rate of return over the next 10 years is negative. Time is money.", "score": 2, "replies": [{"body": "Can you provide more detail on the second sentence? I'd like to learn more.", "score": 1, "replies": []}, {"body": "Like I said, the only way around that is timing the market.", "score": 1, "replies": []}]}, {"body": "It makes no sense to look at ATH. You need to look at valuation. I would argue that SPY is slightly overvalued currently and a recession is not off the table", "score": 1, "replies": [{"body": "I would argue it makes no sense to look at valuation without context. Historically bonds returned much more than they do even today, never mind a few years ago. Expectations are we will go back to lower yields somewhere this decade. If that happens, S&P's PE will inevitably go up. Even during a recession valuations may go up if the fed cuts rates.", "score": 1, "replies": []}]}, {"body": "… guess we are just gonna pretend like the blow off top in q4 2021 wasn’t a massive bubble\n\nNow remind me again how prices performed in 2001 and how long it took to get back to ATHs.", "score": 1, "replies": [{"body": "If you wanna compare it to the tech bubble, we are somewhere in the early-2003 era right now, where we were past the bottom and prices only went up from there until 08. Of course there's no guarantee we've already hit the bottom, but if we haven't it's by definition completely different than the tech bubble.", "score": 1, "replies": []}]}]}, {"body": "Bank, home builders, industrials, etc. earnings will start to shine.", "score": 1, "replies": [{"body": "Ahh yes, the banking sector will surely shine with Q1 and Q2 numbers. \n\nHome builders too! 6-7% interest rates must have really packed their backlogs! \n\n👌 sure", "score": 1, "replies": [{"body": "With higher interest rates and higher home prices, who do you think is profiting from this? Banks/mortgage lenders.", "score": 1, "replies": [{"body": "Mortgage demand has fallen 35% yoy\n\nhttps://www.cnbc.com/amp/2023/04/05/lack-of-home-listings-is-taking-a-toll-on-mortgage-demand.html\n\nBuilders are seeing 20% cancellations on contracts\n\nhttps://www.marketplace.org/2023/01/26/canceled-contracts-are-putting-a-dent-in-new-home-sales/amp/\n\nBut $BLDR had a big bull run, could still continue…", "score": 1, "replies": [{"body": "Down for now yoy, but still added over a trillion dollars in mortgages last year. Again, this will be the transition for the next few years. Rising bank earnings will start to rise, coupled with their low PE ratios will be great buy here. The Dow will be the leading index here for the next few years. Also, Wednesday we’ll get the CPI numbers, which will most likely start to show a decrease in inflation, as we’ve seen in other data so far, like labor markets, manufacturing, etc. the \n\n inflation decreases over the next few months, JPOW and the fed will be praised for being able to stimulate the economy when needed and reduce inflation as needed. This will lead to rate hikes being halted and probably even lifted towards the end of the year. After that, it’ll be full on bulls ride from 2024-2026", "score": 2, "replies": []}]}]}, {"body": "Them Home builder stocks tho ![gif](emote|free_emotes_pack|heart_eyes)", "score": 1, "replies": [{"body": "Great call, November bull run", "score": 1, "replies": [{"body": "Well seeing how this was back in April, I’d say it was a little more than that. But don’t worry, they’re going to continue to run til end of Q1 2025", "score": 1, "replies": [{"body": "It was more like October at the earliest, since I was/am in BLDR and it was up and down until November then it ran off\n\nThe summer sell off was brutal, market was only up like 8.5% YTD at one point. Then October CPI and November fed speech launched us.", "score": 1, "replies": [{"body": "So homebuilder stocks are still up over 50-100% since April? And those banking Q1 & Q2 shined real hard too ![gif](emote|free_emotes_pack|sunglasses)", "score": 1, "replies": [{"body": "You taking a victory lap homie? You must be, considering you really care this much.\n\n I'm also up 55% in 2023. Where you at?", "score": 1, "replies": [{"body": "77% for the year", "score": 1, "replies": [{"body": "congrats, so where is the $ amount on the portfolio at?", "score": 1, "replies": [{"body": "$420.69", "score": 1, "replies": [{"body": "cool, get back to me when its over $1M, that's baseline starter portfolio", "score": 1, "replies": [{"body": "Lol baseline starter. Next time I’ll be sure to get mommy and daddy to write me a nice trust fund like you. Some of us peasants gotta start from the ground up", "score": 1, "replies": [{"body": "So did I. Carried a sales bag for $50k when I was 21, am 36 now, and here I am. 7 figures deep.\n\nWhen I said baseline starter, I mean a baseline $$ amount for shit talking. Otherwise, a 77% performance, doesnt fucken matter if it means going up only $200k, lol peanuts.\n\nTry again kid, this is a different league.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Which stocks are you comparing with?", "score": 1, "replies": []}]}, {"body": "I'm gonna wait until the market runs up 50% from today, then crashes 20%, then congratulate myselfy on how smart I was by buying the dip.", "score": 24, "replies": []}, {"body": "If you're not buying into the market consistently in small chunks, you should be. It's much less stressful than trying to figure out if we are in a bull or bear market, when the low point will be, etc. Just set aside a reasonable amount every time you get paid and buy in. Doesn't matter if it's 1 share or 100, just always be buying.\n\nIf you insist on \"holding cash\", use something like a preferred stock ETF or a bond fund so you can at least be collecting a dividend while you hold, and not be as subject to the volatility of the market.", "score": 14, "replies": []}, {"body": "Lost all our $ end of ‘22.", "score": 26, "replies": []}, {"body": "Small cap growth isn’t up.", "score": 12, "replies": [{"body": "Small-cap stocks are hard to pull up. The funds in the market will not care about him at all. No capital injection is a pool of stagnant water", "score": 1, "replies": []}]}, {"body": "I’m all cash, doing well, expecting another big leg down. If there isn’t one, that’s fine. I would rather risk being wrong as a bear/neutral in these conditions than risk being wrong as a bull. Nothing tells me that shit is looking good other than a YTD chart. I’ll get back in when inflation gets back down around 2%.", "score": 66, "replies": [{"body": "That is why I am buying medium and long term bonds.  When rates go back down to 2 or lower, it is going to rock.", "score": 5, "replies": [{"body": "How long you think it will take?", "score": 1, "replies": []}, {"body": "Same here, most of my free cash is going into bond ETFs for when those rates come down. Been looking forward to that binary event and a few others.", "score": 1, "replies": [{"body": "How long you think it will take?", "score": 1, "replies": [{"body": "I don't wanna project at all that I know what I'm talking about, but I don't think we'll see rate cuts this year. Maybe next year they start slashing rates and then bonds will pump. The when isn't too important to me.", "score": 3, "replies": [{"body": "I guess I will start buying iShares $ Treasury Bond 20+yr UCITS ETF USD. (ACC)", "score": 3, "replies": [{"body": "I like UTEN/UTWO (only holds 10 and 2 year treasuries) and IGLB myself.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I dont get why so many people think all the worries of the global economy and markets are behind us orbwhyvanyone is expecting an immediate fed pivot.", "score": 38, "replies": [{"body": "I don’t get why people are looking at macroeconomics to determine when to buy stocks when all the great investors advice against it. It’s how most people walk away losers.", "score": 35, "replies": [{"body": "People are honestly too scared to buy when news is bad and would rather buy when the good times roll. \n\nIn reality this is just buy high sell low in another name.", "score": 31, "replies": []}, {"body": "STEP 1: Find an amount you can spend comfortably monthly \n\nSTEP 2: Proceed to DCA and forget about \n\nSTEP 3: Profit", "score": 10, "replies": [{"body": "100% this. As Peter Lynch once said “If you spend 13 minutes a year on economics, you’ve wasted 10 minutes.” Just buy high quality companies at a fair price and prepare to hold them for many years. Its that simple.", "score": 4, "replies": []}]}, {"body": "Can macroeconomics research penetrate the stock market? The market does not rely on scrutiny or rely on data to rely on economics. No matter what is inseparable from a supply and demand relationship", "score": 1, "replies": []}]}, {"body": "Sometimes it’s hard for people to see the bad because they are so hopeful. A lot of people never sold, so their opinion is warped. I got a lucky exit so I am not in a hurry to rush back in. There’s a lot more that could go wrong than that could go right at this point in time, so I’m ok with chilling.", "score": 5, "replies": []}, {"body": "I don't understand why people think a fed pivot will be good for stocks... It's like the fed will only pivot if the economy is in the tank and a low growth environment... Do you know what does do well in a fed pivot? The same assets paying 4% right now which is only like a risk adjusted 1% less than stocks.", "score": 0, "replies": []}]}, {"body": "I hope you realise this is just ‘buy high sell low’ that seems ubiquitous in retail.", "score": 3, "replies": []}, {"body": "Timing the market is for losers", "score": 11, "replies": [{"body": "Timing the market works on a macro basis. If you didn’t get the message to sell massively overpriced speculative tech and LT bonds in November 2021, I don’t know what to tell you. But for the most part, I just have a balanced portfolio that I keep at certain percents, and let the market rebalance for me. Right now, I’m cautious, and am at 35% equities (VOO, SCHD, etc) and am happy having 25% cash earning a risk free 5%. (25% PMs, 15% VGLT, average price $67 - will skyrocket if there’s a recession and equities tank).", "score": 10, "replies": []}, {"body": "Timing the market is one thing but if there are dozens go red flags saying the market will go down another 20% your not trying to be a day trader by holding back and watching a bit.", "score": 15, "replies": [{"body": "Do tell these red flags that indicate another 20% crash.. curious what they are.", "score": 23, "replies": []}, {"body": "Is this red flag in the room with you now?", "score": 12, "replies": [{"body": "Lololol", "score": 2, "replies": []}]}, {"body": "Are you into individual stocks? Or broad funds?", "score": 1, "replies": [{"body": "Both.", "score": 1, "replies": []}]}]}, {"body": "I’m not trying to time the market. I’m assessing my risk tolerance. Big difference.", "score": 4, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Nah. He's not basing his investments on what the market is doing. The market could be up 50% or down 50% by the time inflation hits 2%. Dude doesn't care.", "score": 1, "replies": []}, {"body": "Not really though, because it doesn’t mention at all where I expect the market to be at that time. It’s LITERALLY just when I’ll be comfortable getting back into the market.", "score": 0, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Open shut case of timing the market. \n\nI'll stick with time in the market", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Enlightened Redditor thinks he can time the market.", "score": 0, "replies": []}, {"body": "RemindMe! 1 year", "score": 1, "replies": [{"body": "I will be messaging you in 1 year on [**2024-04-06 23:44:27 UTC**](http://www.wolframalpha.com/input/?i=2024-04-06%2023:44:27%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/12dsx1a/everything_is_up_ytd_cash_is_worst_performing/jf94in1/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F12dsx1a%2Feverything_is_up_ytd_cash_is_worst_performing%2Fjf94in1%2F%5D%0A%0ARemindMe%21%202024-04-06%2023%3A44%3A27%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2012dsx1a)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Everything is up probably due to seasonality, since markets are actively traded from August - May. Hence the expression “sell in May and go away,” where the market usually goes down over the summer.\n\nThis is a really weird post and it seems like you’re trying to sucker retail traders and not make a genuine analysis. \n\nI could be wrong but you’re trying to tell cash-heavy investors to buy when you yourself are cash-heavy, in/before May, one of the worst seasons for the market.", "score": 58, "replies": [{"body": "Sell in May and go away has been a great way to *lose money* the last few years, grandpa. That saying worked fine in the 90s not modern times", "score": 38, "replies": [{"body": "The thing that I will say is that it's still likely true there is that volume can be lower in the summer, but low volume=/=an issue. \n\nYou might get a correction in May, but I'm having a hard time buying the pitch of the idea that we're just going to slowly grind down for the entire summer...we didn't even during last year. \n\nMore likely to just float up unless we get another significant event like SVB or the macro just gets to where it's completely and \"thoroughly\" puke worthy. \n\nOr even worse, continue in the range we've been in and have the arguments continue.", "score": 1, "replies": []}]}, {"body": ">\tEverything is up probably due to seasonality, since markets are actively traded from August - May. Hence the expression “sell in May and go away,” where the market usually goes down over the \n\nDid you short the market in may then?", "score": 11, "replies": []}]}, {"body": "What’s so bullish about the market right now? The war in europe is still going on, regional banks are shaky, china and the US are still fighting, and the inflation and rates are still high. I don’t understand this run and I rather watch how this all plays out while earning the guaranteed interests in short-term bonds.", "score": 5, "replies": [{"body": "The market makes no sense at all. Bullish for no apparent reason.", "score": 1, "replies": []}]}, {"body": "This is a fake bull run designed to get the people who are sitting cash to reinvest in stock market, then the market will crash once wall st has sold out the last of their positions to the suckers", "score": 4, "replies": []}, {"body": "Are you joking? PYPL ain’t up dude. This garbage is not doing anything", "score": 7, "replies": []}, {"body": "don't bother trying to time the market if you want to build wealth. the market will turn when people expect it the least, you want to be invested when that happens.", "score": 14, "replies": []}, {"body": "My fund is having a wonderful year and we’re 50% cash🤷‍♂️", "score": 10, "replies": [{"body": "Lol", "score": 4, "replies": []}, {"body": "So is mine and I'm only 13 years old!!!", "score": 8, "replies": []}]}, {"body": "I bought from ATH from December 2021, all the way to the bottom in 2022, bringing down my average cost/share. I'll invest more when it goes lower than my previous purchase prices, in the meantime I'll collect my risk free 5%.\n\nI feel there are too many issues going on in the world. It's only a matter of time until another event causes the market to drop again. My employer just announced hiring freezes and cost cutting, and has already been laying off people in small groups. A decent amount of older, higher paid employees have recently retired... some were pretty much told to take a package now, or get nothing later.", "score": 6, "replies": []}, {"body": "I'm up 25% this year you'll fucked up man", "score": 3, "replies": []}, {"body": "Went from 10% cash to 30% cash 6 weeks ago. I consider it an insurance policy that I paid for in a little lost gains. It’s ok to take some risk off the table, especially if you’re doing it in tax advantaged accounts.", "score": 3, "replies": []}, {"body": "60% cash sounds like you’re trying to time the market.\n\nNobody knows when we hit the lows….\n\n5% CDs and treasuries are good though…", "score": 3, "replies": []}, {"body": "it's funny \"heavy cash waiting in the sideline\" was the argument used throughout 2021 and 2022, and SP500 didn't have any problem dropping 28%. People said house prices could never go down due to structural lack of supply. It went down at a pace comparable to 2008 in 2022.\n\nSo here's something most reasonable people would agree on, whether bulls or bears (permabulls and permabears don't count). If you think an economic recession won't happen (I won't count a rolling recession as an economic recession), the bottom COULD already be in on Oct 2022. If you think an economic recession will happen (even a mild one), the bottom is definitely not in. Even if the bottom is in, we are not going to have a V shape bull run like 2020. This is because the Fed is still trying to keep GDP growth low for 2023, and throughout first half of 2024. This will limit earnings growth, and high interest rate will prevent PE expansion. Also, at SP500 around 4200, the valuation is pretty high, even for the bulls. But bulls can tolerate higher forward PE since they're gonna assume PE expansion in a bull market.\n\n&#x200B;\n\nSo the hard part is really determining if an economic recession will happen or not. I'm going to assume you know all about the bull thesis, so I will just list out some potential downsides to GDP.\n\n1. In the past when rate hikes were in increments of 0.25% and happened over years, recessions didn't happen immediately after the Fed pause. The Fed finished hiking in mid 2006. Bear Stearns failed in Mar 2008. Lehman failed in Sept 2008. When Bear Stearns failed, the market rallied 15%. If we're assuming 3.5% rate will cause a recession and 12 months of lag, recession won't even happen until Sept 2023. Stock market is not gonna roll over until like 3-6 months before the recession happen. You think everything's gonna happen immediately, but economic cycles take a long time to play out. That's why it's hard to predict recessions. If everything made sense, everyone would be able to do it.\n2. Recessions are non-linear. Things can look strong and then a few months later look weak. To make it worse, a lot of times the data showing economic data is strong, get revised and become weak. Everyone thought core PCE was around 3.6%. It got revised up and are now showing consistently around 4.5-5%. Everyone thought initial jobless claims was too low. It just got revised up today. Q1 GDP was estimated to be 3.5% a month ago. It's now 1.5%. The only thing giving the market the jolt to pump was in early January, the job report was shown to be extremely strong when the market thought recession was imminent. We know this is due to the warm winter causing companies to retain workers. Also, retails sales got pulled forward for the same reason. If retail sales got pulled forward, these next quarters aren't gonna be strong. Also, consumers are expected to run out of their COVID savings by summer of 2023, according to JPM and BofA. The strong spending you see now, it's not gonna continue.\n3. The debt ceiling debate is still going on, and no one's even talking about it. Market need to pressure politicians to come to an agreement quickly and not wait until the last minute. If the bond market thinks politicians are gonna play game and sell off in anticipation, while the banking issue is still in the background, that's not gonna be good. This time, the Republicans seem determined to not raise it, but we'll see if it's an act or not.\n4. The banking crisis isn't over. It's actually just begun, but just in the background for now. We're going to see mass exodus from depositors looking for yields. We're going to see real estate gets hammered due to regional banks tightening their lending standards. Real estate has been weak, but it cannot get too weak, otherwise it will pull down other sectors in the economy. The impact won't be seen until at least 3-6 months later. The impact can range from 0.5% to 1.5% rate hike equivalent. This banking crisis really shocked the bulls because they never saw it coming. Now that it happened, there're a lot of implications that follows, and it definitely has raised the recession probability by a lot. The Fed choosing to hike rate in March instead of pausing also shows their resolve to bring down inflation, even if it risks an economic recession. Even slightly hawkish economists were okay with the Fed temporarily pausing for one meeting.\n5. Right now what's keeping the market optimism is that even though Q1 is expected to be bad, 2H of 2023 is expected to sharply rebound. This could be due to expectation that Fed will ease rates, or that they won't keep rates high for long, therefore holding down GDP growth for 2024. If that turns out to be the case, and 2024 GDP gets revised down to around 0.5%, market cannot \"look forward\" beyond the slow growth environment. Also, this upcoming earnings will hear CEO give guidance on future quarters and we'll see some potential revision down for upcoming quarters.\n6. Europe recession fears is going to come back. Europe dodged recession last winter due to warm weather. High energy prices still exist, and by fall 2023, European recession talk will resume.\n7. The Fed's optimal trajectory requires incredible amount of precision. Nonfarm payroll, which is around 300k now, will need to go down to basically 0 for several months. It'd be incredibly easy to flip to negative once you're close to 0. Same with GDP, 0.4% this year.\n\nIn conclusion, I think market will be range bound between 3600-4200 until the recession eventually hits. If market's feeling pessimistic, it'll drop down to around 3600. If market's optimistic, it will go up to around 4200. If we dodge the recession, market won't break the range until at least Fall 2023 where we're a lot more certain inflation will go down to low 3% instead of mid 4%, and also start to price in a lot of the recovery quarters 12 months ahead. If inflation prints are around low 3%, the Fed will allow the financial condition to ease. They're gonna regurgitate holding for longer, but they won't be forceful, kind of what they're doing now (but now it's mostly because they're concerned about the banking crisis). If inflation prints remain around 4%, you're gonna start to hear \"some pain\" in Powell's speech again, which would trigger market selloff.", "score": 43, "replies": [{"body": "Where did housing prices drop at a 2008 pace?", "score": 38, "replies": [{"body": "They didn't. His post in nonsense but getting upvoted, a very r/stocks thing.", "score": 31, "replies": [{"body": "And 90% of it is based on tenuous logic at best while ignoring counterarguments. Consumer debt payments to disposable income is still near historic lows and below averages before the pandemic https://fred.stlouisfed.org/series/TDSP. You basically (yeah yeah some conditions apply) have to ignore that fact to believe all the negativity thrown out above.", "score": 3, "replies": [{"body": "I think people making the \"debt is rising sharply!\" argument don't realize just how crazy debt levels used to be. It's been 15 years and some people have forgotten or never knew what things used to be like when rates were higher. Plus, the number of people upside down on their mortgages was crazy high then. It's near zero today (less than 1% last I checked).", "score": 1, "replies": []}]}, {"body": "New homes did \n\nhttps://fred.stlouisfed.org/series/MSPNHSUS#0\n\nBiggest 4 month drop in 2008 was just over 25k \n\nThe fall from last Oct - Jan shows a fall of 75k \n\nAlso worth mentioning the average new in 2008 was less than 300k", "score": 2, "replies": []}, {"body": "The post is nonsense but yet all you do is criticise and don’t provide any information. Any counter arguments, sir?", "score": -1, "replies": [{"body": "I was responding to stoked_7 and agreeing with him about housing prices. Since that's all I wanted to say I didn't feel the need to add anything.", "score": 1, "replies": [{"body": "You clearly positioned yourself by saying “they didn’t.” Anything to back this up? Just curious to see the other side of the argument because my puts are not printing. 😂", "score": 0, "replies": []}]}]}]}, {"body": "They didn’t. He is talking out of his ass", "score": 11, "replies": [{"body": "I almost believed it. If so I'll rush over there and buy a couple of sets lol", "score": 0, "replies": []}]}, {"body": "West Coast maybe?", "score": 2, "replies": [{"body": "I’m east coast and nothing went down. It went flat", "score": 5, "replies": []}]}, {"body": "Definitely not in texas.", "score": 1, "replies": []}, {"body": "faulty lavish wipe saw pie paint vegetable books jeans decide\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": []}, {"body": "[https://fred.stlouisfed.org/series/CSUSHPINSA](https://fred.stlouisfed.org/series/CSUSHPINSA)\n\nQuite similar pace. Bay Area and probably all of California has dropped between 15-25%. They dropped around 50% during Great Financial Crisis.", "score": 0, "replies": [{"body": "15%-25% = 50%?", "score": 1, "replies": [{"body": "I said PACE, aka first derivative. 50% is the total, after like 4 years of decline. We haven't even entered a recession yet, and CA housing prices already corrected that much.", "score": 0, "replies": []}]}]}]}, {"body": "Clown analysis by major bear above. Dude, did you ask ChatGPT to write it? Because it's a lot of words, but few if any facts and tons of *factual errors*. Don't quit high-school...\n\n\n\n\n1. The housing market is extremely resilient despite all, the drops have been small and isolated. Feel free to *prove you obvious nonsense about 2008 level drops* of you can (you can't). \n\n\n\n\n2. Anyone talking about debt ceiling should get a *free admission to clown college*. It's the biggest nothingbuger we know of, it's litterary political *drama and fake dissidence*. It'll be passed without any issues just like it has *every damn time from long before you caught your first pokemon*.\n\n\n\n3. More fearmongering about banking crysis. Why can't you beats innovate something new? Every damn recession won't be 2008 again, on fact *recessions are seldom if ever similar* in their cause and effect. This isn't even high-school level of economics education. Banks are fine dude, the ones who aren't did gamble more then they should and ought to be doomed due to an somewhat efficient market. Silicone Valley Brobank had shit financials, nothing like JP Morgan of Charles Schwab.\n\n\n\n\n4. The market is forward looking but not as dumb as you pretend it is. The market has priced in the current price hikes and inflation, it has priced in a rising unemployment and offices going out do style because *it's already current mainstream media coverage*. The market is knows things ain't great but neither are they shit, the fed has a goal in sight and is rescuing reaching it. So far *the soft landing nonsense seems somewhat plausible*.\n\n\n\n\n5. Don't talk about Europe dude, just don't because you're *embarrassing yourself*. Bet you couldn't find Europe on a map... European recession or lack thereof is in no way dependant on energy prices. The *risk for expensive energy was only this year* not the next. We've stored more then enough gas, the energy grid is being updated and changed as we speak and countries are changing their energy politics. Russias leverage is gone, our biggest problem is inflation but that's due to *food, housing* more then electricity. Lack of *fertilisers* and disrupted trade routes...all of which as slowly but surely healing.", "score": 6, "replies": [{"body": ">The market is forward looking but not as dumb as you pretend it is. The market has priced in the current price hikes and inflation, it has priced in a rising unemployment and offices going out do style because it's already current mainstream media coverage.\n\nbruh i just HAD to comment on this lmao\n\ncan you remind me how long it took for markets to react to COVID in 2020 again? we had china shut down, companies giving earnings warnings, we had COVID literally spreading on US soil, AND only after shit had completely hit the fan did the markets finally react to news that was widely known for months\n\ni was literally sitting for months with my jaw to the floor wondering how stupid investors can be to ignore what was so obvious, how the fuk is AAPL mooning with china shut down and the CEO announcing that earnings are going to be bad? COVID was literally the easiest timed crash i have ever seen and probably will ever see in my life, thanks to how dumb the markets are\n\nevery single crash in history was from shit that was in the media for many months and in some cases even years before the \"smart\" market caught on that the news was actually bad\n\nif you think that just because its in the media and widely known, that its priced in, youre gonna be in for a massive shock one of these days", "score": 14, "replies": []}, {"body": "&#x200B;\n\n1. [https://fred.stlouisfed.org/series/CSUSHPINSA](https://fred.stlouisfed.org/series/CSUSHPINSA). Looks like a similar PACE of decline to me compared to 2006 (housing took like 4 years to bottom during Great Financial Crisis, we're barely hitting year 1 from the peak). I never said total magnitude of decline will be same as 2008\n2. Sure every debt ceiling talk is a nothing burger, except for the 2011 debt ceiling crisis right? Like I said, even if it gets passed, if they delay the date too close for comfort, the bond market would still sell off in anticipation\n3. where did I say this future recession will be like 2008, in terms of cause, or magnitude? I gave a 2008 example to demonstrate the lag in monetary policy. You can observe that in all historical recession.\n4. the market has priced in rising unemployment?  Assuming this is true, you mind giving a detailed explanation on what price level of SP500 would correspond to the market pricing in what unemployment %, what interest rate % at, what earnings will be? Can you also explain if SP500 = 4150 means the market has already priced in a recession, what did the market price in at SP500 = 3800, and why did it price both prices in so often in just 5 months?\n5. Europe recession is completely dependent on energy prices. Europe inflation is primarily caused by high energy prices and not equally by the hot labor market, unlike the US. Every single talk on Europe avoiding recession, has brought up energy and warm weather as the primarily reason. Sure right now you guys don't have an energy issue. We'll see after China reopen and drives commodity prices up again. \n\nIt's funny you consider me a major bear, because a few weeks ago when SP500 was at 3800, I specifically said it's unlikely for Sp500 to break below 3800 for now. I also said market is gonna be range bound right now, so what part of that is \"major bear\"?", "score": 4, "replies": []}, {"body": "How's the European energy grid being updated? More LNG terminals? Curious. I haven't been following the news on energy lately.\n\nIn any case, I hope it fucking gets updated big time ASAP. We've had a nice winter and a sort of low gas price window because of the reserves. Perfect timing, pretty much confirming your point there. The main problem in Europe is un or underemployment really, and nepotism, but from the inflation list, it's defo housing, what a mess. Food is still kind of fine at least.", "score": 1, "replies": []}]}, {"body": "Well done sir", "score": 2, "replies": []}, {"body": "Dam dude I'd subscribe to your newsletter. I honestly think the time in which the market takes to react is the golden key to making silly profits. As you've pointed out, a lot of this turmoil hasn't even come into play. No doubt the latter half of this year could be a blood bath", "score": 1, "replies": []}]}, {"body": "Time in better than timing", "score": 6, "replies": []}, {"body": "Best play I've made all year, maybe of all time has been goog. I sold all my underpreforming stocks, some at a loss. Bought goog stock, and $110 call options for may/June when it was $87. Today you couldn't wipe the smile off my face. Damn it feels good to finally do something right.", "score": 5, "replies": []}, {"body": "We went from 380 to 410 but we nearly dropped to where we started. Your post is timely and correct NOW, but we’re in a channel and we can easily drop past 380 and continue the bear market trend and be down year to date, no one knows what’s going to happen.\n\nUnless you took out your profits already from beginning of the year does it even matter?", "score": 6, "replies": []}, {"body": "I pretty much break even from last year when I put all my money in", "score": 2, "replies": []}, {"body": "Time in the market > Timing the market. 🤡", "score": 2, "replies": []}, {"body": "The market will remain bullish as long as I remain short. Once I give up, then it will reverse.", "score": 2, "replies": []}, {"body": "Inflation isn’t gone, fed will only cut if there is a serious reason to, or if nothing blows up, likely not until inflation is actually at 2% (Powell will avoid the same mistakes as the 80s given non cyclical inflation remains so strong relative to cyclical inflation components). Economic inertia in the credit landscape is already trending downward; if there is anything reliable in economics it is the credit cycle, and IMO we are not at the trough yet. Downwards inflation also generally means downward earnings for stocks. Not to mention eurozone inflation is still out of control, plus many tangential central banks are still hiking aggressively. Right now the NASDAQ 100 is trading at 29x P/E. There is a lot of hype about new tech like AI in the market but appears still speculative. \n\nTo me this market looks overbought and priced for perfection. Plus not to count that people tend to discount the possibility of random, negative events (“who could have seen SVB coming?”). We just had the largest drawdown in government bond valuations of all time, plus the war in Ukraine, plus China tensions, plus everything else? \n\nPeople forget that there have been multiple 10+ year stretches of time throughout history where the S&P returned 0. Were at the tail end of a massive QE experiment that had not nearly been reversed yet.", "score": 2, "replies": []}, {"body": "Your timing the market. Time in the market beats timing the market. Figure out what % of stocks vs cash and bonds you want to be in long term and can comfortably hold then set it and forget it.", "score": 2, "replies": []}, {"body": "BULL TRAP", "score": 2, "replies": [{"body": "Agreed", "score": 1, "replies": []}]}, {"body": "Bears stay losing", "score": 2, "replies": []}, {"body": "I love your optimism but I expect a sideways market for the next few years.\n\nI don't expect SPX to make new highs for a really long time.", "score": 2, "replies": []}, {"body": "I think cash is the smart play this year. We're going down.\n\n!RemindMe 6 months", "score": 2, "replies": []}, {"body": "If you’re still waiting, you missed the bus", "score": 4, "replies": []}, {"body": "This is why people shouldn't try to time the market.\n\nI can't say I've been particularly confident the market would go up or even wasn't about to crash for most of this year so far. I feel like humanity is both on the verge of civilization ending nuclear war and near infinite low cost energy with nuclear fusion. I don't know if we are on the verge of an AI led collapse of the economy or the start of an economic boom triggered by the same tech. \n\nBut nonetheless all of my money except for an emergency fund has remained invested in VTI with more going in with each pay check. I have a lot more confidence in that strategy's performance over time than my ability to time the market when withdrawing and investing money.", "score": 3, "replies": []}, {"body": "Do you count CDs as Cash?  I think of them more as a bond asset, but it pretty much is a cash equivalent.", "score": 2, "replies": [{"body": "Some banks are paying 5% on 12mo cd’s. Neary that on mma’s. Different than cash imo", "score": 1, "replies": []}]}, {"body": "MM is teaching you to DCA into inflated valuations so they can rug pull. If you’re gonna be long, for gods sakes, learn how to play with hedges. Here’s a simple one, MSFT with SQQQ. This is my choice and I’ve made money everyday regardless of direction. But learn about SQQQ before buying, requires daily consideration. I also like a long bond ETF as a hedge. Having long equities without a hedge right now is very dangerous.", "score": 2, "replies": [{"body": "Agreed but I prefer to sell covered calls in my long term portfolio during times like this. If the market starts trending up then I switch to selling puts with the intent of being assigned and owning the shares at a good price.", "score": 2, "replies": [{"body": "Great strategy. Probably better then what I mentioned to be honest. Just throwing something out there.", "score": 2, "replies": []}]}, {"body": "I love my downvotes here…sorry, let me try again…the market heads up to the right! DCA into an index! You can’t time the market! That better? Now shower me with karma!", "score": 2, "replies": []}]}, {"body": "“Sell in May and go away”", "score": 2, "replies": []}, {"body": "This gets said all the time, and yet people don’t listen:\n\n“Be fearful when others are greedy, be greedy when others are fearful.”", "score": 0, "replies": [{"body": "So are others fearful or greedy right now?", "score": 5, "replies": [{"body": "Both, but looking at the average american, still greedy/not fearful of a recession", "score": 2, "replies": []}, {"body": "This perfectly sums up why you can’t time the market.", "score": 1, "replies": []}, {"body": "Yes.", "score": 1, "replies": []}, {"body": "6 months ago when everyone was worried the sky was falling was a perfect example of the right time to buy when things were cheap.\n\nHard to say at this moment, it’s not always as clear as it was end of 22 and middle of 23", "score": 1, "replies": []}]}, {"body": "What if I'm afraid of greed?  If I learn to be fearful when others are greedy, then I would not want to become greedy myself, because then all the fearful people will be making the right call rather than me.", "score": 0, "replies": [{"body": "Therefore, you must have a good attitude in the stock market. Don't make any decisions on the spur of the moment", "score": 1, "replies": []}]}]}, {"body": "BuT tHe CrAsH iS cOmInG", "score": 1, "replies": [{"body": "Certainly soon.   \nBut not that soon.   \nBut sooner than you think.   \nCertainly soonish. Maybe.   \nYou should sell all your tech stock though.   \nShort QQQ? Me? Nah. Trust me.", "score": 5, "replies": []}]}, {"body": "Great time to go into cash then right? You're supposed to buy low and sell high friends", "score": 1, "replies": []}, {"body": "How is there a positive way out of the present scenario?\n\nLet’s say the Fed pivots, it’s a sign that something’s majorly wrong, the market could tank.\n\nConversely, the Fed comes out in May and says we’re staying the course, hikes again, the market has a hissy fit.\n\nOr they pause (best case?), well, the strains of the current interest regime will surely begin to take hold in earnest. Plus by then we’ll have had earnings, and guidance. Things could get real ugly.\n\nSeems to me that the upside is in serious jeopardy from here. The soft landing narrative seems extremely optimistic. Can we really have strong growth if current interest rate levels are sustained? - as the Fed says they will be.", "score": 0, "replies": []}, {"body": "“Close your eyes to last year’s downtrend”.", "score": 0, "replies": []}, {"body": "I'm getting 5% on my cash so it's not all bad.", "score": 0, "replies": [{"body": "And inflation is 10% congrats bud", "score": 1, "replies": [{"body": "Lol. Better than losing 20% of my portfolio 🤷‍♂️", "score": 1, "replies": [{"body": "Markets are up huge ytd.", "score": 1, "replies": [{"body": "Not up since i went 40% cash", "score": 1, "replies": [{"body": "Cash is trash pal. Biden keeping the money printer running", "score": 1, "replies": [{"body": "Lol, in this macro environment, cash is king. Slowly re deploying it little by little, every time there's a drop in the market.", "score": 1, "replies": []}, {"body": "Also, biden has nothing to do with the fed and printing money.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Personally, I’m waiting for the market to actually reflect some of the recent catalysts, baking crisis etc. i recently went all cash because figured why not, everything is still out of control whether the market wants to admit it or not. So now, it’s only daily swing plays if I feel like it, otherwise, all cash.", "score": 0, "replies": []}, {"body": "LOL!  Just wait.  There's a debt ceiling battle along with a major recession no the horizon.", "score": -1, "replies": []}, {"body": "My portfolio is not up.", "score": -1, "replies": [{"body": "What is your portfolio?", "score": 1, "replies": []}]}, {"body": "Start adding bonds as well", "score": 1, "replies": []}, {"body": "For now….", "score": 1, "replies": []}, {"body": "3-month T-bills. guaranteed and high yield", "score": 1, "replies": []}, {"body": "For now!", "score": 1, "replies": []}, {"body": "Everything is up from its lows?  How is that possible 🤔", "score": 1, "replies": []}, {"body": "(Tounge fart noises)", "score": 1, "replies": []}, {"body": "This is why I just DCA and not think too hard.", "score": 1, "replies": []}, {"body": "I don’t believe it for a second.\n\nPeople were saying mission accomplished and all is fine right before the previous crashes too. Human psychology is terrible at predicting when a catastrophe is over, because our perception tends to compare with the recent past. \n\nI’ll feel more confident about the market when the rates start coming down again or when the geopolitical tension fades away and we get a globalized economy again.", "score": 1, "replies": []}, {"body": "I'm 60% etfs/stocks and 40% cash but now increasing etfs/stocks. No point expecting the worst, dividends alone for 2 years got me back 6% of losses in tax free cash (tax sheltered account). Time in market really does beat timing the market. \n\nP.S will still keep like 25%-30% cash for those juicy drops.", "score": 1, "replies": []}, {"body": "Solar stocks are not up. Except for First Solar… for some unfathomable reason that sucker never goes down. Guess which one I didn’t buy.", "score": 1, "replies": []}, {"body": "$good still down 20%", "score": 1, "replies": []}, {"body": "Big money is trying to pull cash hoarders into the market", "score": 1, "replies": []}, {"body": "Everything is down in the past year. Cash has been the best performing asset.", "score": 1, "replies": []}, {"body": "The fact that 80% of the total US money supply was created in the past 2 years was a major sign, for me at least, that holding cash is one of the worst things I could be doing.", "score": 1, "replies": []}, {"body": "Everyone who didn't panic and stayed the course new this would happen. Knee-jerk reactions will cost you money.. every time.", "score": 1, "replies": []}, {"body": "I hope it trades sideways and up because I exited my gold position for +26%", "score": 1, "replies": []}, {"body": "\n>\n>Heavy cash holders (including me) missed a lot of gains this year so far. \n\nLol how did this happen when you get some return everywhere else? only SVB customers hold heavy cash.\n\n>>I transitioned to cautiously bull in March because bears ran out of catalysts that will break the market.\n \n>Bears were expecting a market flush and capitulation but it will likely never happen as long as many investors are cash-heavy and have jobs.\n>\n>I considered waiting until May, after earnings, and start buying regardless of the prices.\n>\n>***If you have not bought already, what is the signal you are waiting for to start buying?***\n>\n\nAll this analysis and for what? You think you can get any of this timeology right as a retailer? What a waste of time and money", "score": 1, "replies": []}, {"body": "Isn’t your cash also returning 5%? I assume it’s not sitting in a bank, but like a core position money market fund.", "score": 1, "replies": []}, {"body": "Put cash in the bank get 4%.. how do u know stocks perform by end of 2023?", "score": 1, "replies": []}, {"body": "Between 3 and 5% on cash risk free is the *best* performing risk:reward asset right now and it's not even close.", "score": 1, "replies": []}, {"body": "As soon as you buy the market will crash please give me a heads up so I can load up on shorts and puts 😂", "score": 1, "replies": []}, {"body": "For now", "score": 1, "replies": []}, {"body": "Had me in the first 3 words ngl", "score": 1, "replies": []}, {"body": "Did you forget about the bank and credit problems? Sure only 1 bank failed and the market has rallied a small amount into the end of the quarter (window dressing). If another fails this rally will be erased in 1 day.", "score": 1, "replies": []}, {"body": "Except a recession is here.  Come post hoe your holdings are doing in 9 months, next winter.", "score": 1, "replies": []}, {"body": "Too bad you missed out on the market rally", "score": 1, "replies": []}, {"body": "To be honest after they stop hiking there was where the crash will come… \n\nBuy rumor sell news. Just because they don’t hike doesn’t mean it was a good news.", "score": 1, "replies": []}, {"body": "I’m investing heavily into the stock market still (~115k), but I also have ~30k cash in VMFXX earning ~4.8% currently.  I don’t believe that makes cash dead…", "score": 1, "replies": []}, {"body": "***reddit in shambles!!", "score": 1, "replies": []}, {"body": "Lol yeah sure guy… if you bought at the absolute low point.", "score": 1, "replies": []}, {"body": "3 months into the year is a pretty short timeline to be making claims about what assets are best/worst performing.", "score": 1, "replies": [{"body": "I'd like your advice.", "score": 1, "replies": []}]}, {"body": "YTD is somewhat irrelevant when folks are still trying to claw back to where they were in q3 of '21", "score": 1, "replies": []}, {"body": " 90% stocks, DCA lump sum last day of every month. Hold, buy, repeat. I am up 11% YTD. I will take it all day in this environment", "score": 1, "replies": []}, {"body": "Cash is getting around 4-5% return right now .. don’t hold your breath on ytd returns we’re 4 months in .", "score": 1, "replies": []}, {"body": "Cash means a savings account or ETF. You can get 5% if you want.\n\nDid this guy actually just sit on cash?", "score": 1, "replies": []}, {"body": "Please do your best to avoid the FOMO. If your original thesis was to be cash heavy because….. “insert reason here”. Than ask yourself if anything has changed? If your thesis is still real, than just sit back and relax. You’re still invested with 40%. The upside gains for me don’t out weight the downside risks. 2008 was one of those years where you can see the cracks forming at the beginning of the year, and look how that one worked out. \nAnyone who uses the quote “time in the market beats timing the market” is hilarious. Buffet sells and buys potions all the time. He doesn’t just buy something and hold forever.", "score": 1, "replies": []}, {"body": "It's either going up or going down...\n\nI see this rally lasting for at least a few weeks or we're going sideways until we get more significant data that things are cooling. The market is waiting for shocking numbers before capitulation.\n\nThe dollar will also determine a lot of the optics around earnings, they aren't measured nominally but most people miss the real numbers hidden by the strength or weakness of the dollar. US companies with large foreign markets will perform better if the dollar is weak and visa versa. At least I think so I'm a little drunk.", "score": 1, "replies": []}, {"body": "Why would you want to be 40% cash given what you just posted? 40% of your portfolio DOA", "score": 1, "replies": []}, {"body": "Broad ETFs with a combination of indexes and bonds has barely outperformed my 8 month 3% GIC with no risk", "score": 1, "replies": []}, {"body": "Laughs in 4.8% savings account", "score": 1, "replies": []}, {"body": "Nah, 0dtes are the worst performing asset...", "score": 1, "replies": []}, {"body": "Weird. I'm still down 30-90% on all my stocks.", "score": 1, "replies": []}, {"body": "Lol this is the dumbest post I’ve seen in a while. Since when has a new bull market started when the unemployment rate was at record lows and the yield curve inverted? *mic drop*", "score": 1, "replies": []}, {"body": "The main reason I’m still underweight on stocks is because short term interest rates are extremely favorable. \n\nS&P 500 averages 7-9% annualized returns. Why buy stocks when I can lock in a guaranteed 5% in the next 10-12 months? 3 month T bills pay ~4.9%. I see ads all the time now for 5% apy cd’s with durations of less than a year. \n\nIf your cash is sitting in a checking or brokerage account collecting minimal interest, yeah cash is a losing position. But if you take advantage of these high yields on cash, you’re doing pretty well considering these investments are “risk free”", "score": 1, "replies": []}, {"body": "I moved some money from SP500 to cash this week. We just had another run up to the 410-420 level on SPY that I expect will be tested and rejected again. 2023 has more in store.", "score": 1, "replies": []}, {"body": "Inflation.\n\nNothing is up, cash is down. Inflation doing its work.", "score": 1, "replies": []}, {"body": "Thank god i have $250k waiting for those house prices to fall! Thanks r/rebubble", "score": 1, "replies": []}, {"body": "The contrarian in me tells me to go all cash now because you’re thinking of getting back into equities. Classic bull trap?", "score": 1, "replies": []}, {"body": "Why buy stocks with such volatility in returns when I can buy money market/treasuries that offer attractive yields at much lower risk?", "score": 1, "replies": []}, {"body": "The 'signal' to buy something is that it's cheap relative to your estimate of it's intrinsic value. If you are  buying index then just continue your DCA schedule as normal because the point of DCA is the admission you have no edge in timing or valuation, either way best to ignore macro noise.\n\nIf you find something that looks cheap buy it, the fact that it might get cheaper shouldn't be a factor assuming you have confidence in your evaluation and a solid MoS. If you're not finding anything that looks cheap then the fact the market is up also doesn't matter, just keep looking and don't worry that x is outperforming y or that the news seems negative but the price is going up which is also useless noise.", "score": 1, "replies": []}, {"body": "When we are confirmed to be in a recession soon + supposedly the worse drop of the market happens after pivot. \n\nSo recession + pivot = lower lows. \n\nThats my guess, but im atleast holding some dividend stocks and got my eyes on others.", "score": 1, "replies": []}, {"body": "I am amused you have an “ultimate plan” that could literally come to fruition in a matter of seconds.", "score": 1, "replies": []}, {"body": "Say that to Space stocks", "score": 1, "replies": []}, {"body": "I was waiting for 3800 but we just kept melting up. But this pattern has happened since last June. All the sentiment is lower…meanwhile we melt up and sell off. So I’m waiting for the next big dip. Meanwhile I’ve been buying sector ETFS online long term like the XLE, XLU, XLV and XLI. When rotation takes out  XLK I’ll flood into it", "score": 1, "replies": []}, {"body": "Well we all know what happens now: everyone buys at the top and the market crashes", "score": 1, "replies": []}, {"body": "This is why you DCA and leave it. By the time you realize you are in a rise, you missed it.", "score": 1, "replies": []}, {"body": "…. You’re quoting a local maximum for YTD up, when we just recovered from a major dip from Feb’23 local highs. Said local highs were basically similar to Dec’22 highs which were followed by a dip. \n\nMarket is literally going up and down violently in the last 3 months, despite a lack of improvement / new problems arising e.g. bank failures, stubborn inflation, OPEC cutting production", "score": 1, "replies": []}, {"body": "Cash is trash. Will never change.", "score": 1, "replies": []}, {"body": "Just wait year aint iver", "score": 1, "replies": []}, {"body": "Historicaly the crash happens after the pivot.", "score": 1, "replies": []}, {"body": "RemindMe! 6 months", "score": 1, "replies": []}, {"body": "Even though I’m a small investor by standards compared to most others on this thread, I pay attention to what is happening in the market. Considering I don’t have much room for error, I tend to be more cautious. Towards the end of last year, I had a feeling that the market was headed in a southward direction and adjusted my portfolio accordingly (i.e., made adjustments to more “conservative”, albeit, not as lucrative). As a result, I’m still ahead of the game. I’m I one of the few that’s not playing the market correctly? Should I be taking more risks?", "score": 1, "replies": []}, {"body": "Better late than never I guess?\n\nI'm fairly new to the game but I'm wondering if now is a bad time to enter the market with the impending recession?", "score": 1, "replies": []}, {"body": "Is fed nearly done hiking because inflation is controlled or they are nearly done hiking because it is causing problem to the banks?", "score": 1, "replies": []}, {"body": "If you take 10 top companies from S&P 500, the S&P would be negative.\n\nFor example, just Apple, NVidia and MS make up 91% of gains in the first quarter.", "score": 1, "replies": []}, {"body": "Up 10% ytd somehow", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It absolutely is", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Can you define it for us then?", "score": 1, "replies": []}]}]}]}, {"body": "The Dow is only up 1%\n\nS&P is 7%\n\nCash is 4% risk free money market.\n\nIf you think the risk is worth a few % right now, feel free but it seems to be trending towards recession by the end of the year. Housing dropping, jobs openings dropping, unemployment starting to rise. Rates going up at least 1 more time. Inflation stopped dropping last check. \n\nI like cash", "score": 1, "replies": []}, {"body": "I'm new to options. What are your thoughts on buying options at open or placing buy orders to open as opposed to after open? What's the difference? Thank you", "score": 1, "replies": []}, {"body": "That's for a while. When the profits will start shrinking companies will start layoffs. Recession is inevitable.", "score": 1, "replies": []}, {"body": "When you say cash…. Do you actually mean you had the money in 3month treasury etf or something right?  Cause at least that’s like 4.5% annualized.  Could be worse.", "score": 1, "replies": []}, {"body": "Transfer my extra cash into physical gold and some silver. Been contributing to my 401k as aggressive as usual. As for individual stock picks, being correct on PMs and seeing positive returns last 3 years vs being wrong and negative returns makes one stick with what they know.", "score": 1, "replies": []}, {"body": "I have been selling my tech stocks into this strength. Also selling a lot of covered calls. I hit a record $4k in covered call revenue last month. While I’m upset that I missed plowing my cash into this rally, I do believe the rally has no merit, and all the problems that causes the selloff still exist. \n\nI keep a spreadsheet of what I sold and at what price, and compare that to the current price. I always wait for the current price to be decently below my sell price in order to buy back in. It has worked quite well for me on my major sales in Jan 2022 and May 2022.", "score": 1, "replies": []}, {"body": "I’m still down 28% from this time last year. Depending on what you were investing in, holding cash was a good option.", "score": 1, "replies": []}, {"body": "Stocks down 20% last year and intermediate bonds over 10% so overall most folks are still negative since 2022.......for what it is worth!", "score": 1, "replies": []}, {"body": "Right now, its a bull trap", "score": 1, "replies": []}, {"body": "I’m going to go with the bear market rally for $1000 Alex.", "score": 1, "replies": []}, {"body": "I'm waiting for banks to crash", "score": 1, "replies": []}, {"body": "Who cares and if SPX 5k, who cares. Just keep investing in the long term you got this", "score": 1, "replies": []}, {"body": "Cash remains king.  Doubt at your own peril.  Looks like you were born just this January.", "score": 1, "replies": []}, {"body": "Cashed out 60% of my holdings and bought a property a couple months ago lol. Now my net worth depends mostly on my ability to make this house not look like crap", "score": 1, "replies": []}, {"body": "Um preferred stocks…..", "score": 1, "replies": []}, {"body": "It’s not about timing the market, it’s time in the market. This one’s on you OP. no one else to blame. Keep holding cash while the rest of us make money.", "score": 1, "replies": []}, {"body": "Reversion to the mean. Just you wait, cash will pay off eventually.", "score": 1, "replies": []}, {"body": "Top 20 companies are up,the rest is burning like hell\n\nNever thought the possibilty to buy CAT at 200 before", "score": 1, "replies": []}, {"body": "90% of the SPY performance in March was from 3 stocks: AAPL, MSFT, NVDA. Does that sound healthy to you? Small caps are rolling over. Gold is at all time high and is outperforming SPYs.\n\nI will sit tight with my guaratneed 5%, thank you. The time will come.", "score": 1, "replies": []}, {"body": "> If you have not bought already, what is the signal you are waiting for to start buying?\n\nOnce I see the things that caused me to pull my funds out of the market begin to reverse and give me some confidence in our country's near future.\n\nHouse costs/rent is at a nearly unsustainable level.\n\nUsed car prices are still somehow increasing and continue to sell. The average car payment in the U.S is over $700 a month. I don't understand how coupling that payment with the current mortgage rates is sustainable for most people especially when companies haven't given raises that equal the rate of inflation over the last 1-2 years.\n\nThe war/invasion of Ukraine is still ongoing and I still worry that it takes a turn for the worse as we anxiously await Putin's end. \n\nOpenAI is going to change our lives (both in a career and personal perspective) within the next year or two and I'm actively researching it and its regular advancements to help me decide where I should put my money/if I should consider a career change. \n\nLastly, I'm not convinced that a major recession is unlikely. I want to keep my cash so that I don't have to worry about paying my monthly bills/buying groceries in the very possible event that many people actually lose their jobs.", "score": 1, "replies": []}, {"body": "That stat means absolutely nothing unless your a producer at CNBC", "score": 1, "replies": []}, {"body": "I've not bought now because I was buying back in October. I've been selling into this rally.\n\nI buy and sell based dominantly on price and volume. I mainly trade around the Q's.", "score": 1, "replies": []}, {"body": "“Bears have run out of catalysts” LOLOL", "score": 1, "replies": []}, {"body": "Cash on the sides is usually just cash that belongs to participants that are already invested into risk assets. It will probably stay there or be put into yielding products that are considerably safer. I would start buying when no one wants to put cash in their 401k or they want to liquidate it.", "score": 1, "replies": []}, {"body": "I just keep buying spy every week. Up about 20% this year.", "score": 1, "replies": [{"body": "How is that possible? Unless you are including your contributions into total returns. SPY is only up 7% or so this year.", "score": 2, "replies": [{"body": "Sorry let me rephrase. This year as in 365. Not year to date. I dumped a lot in at the lows. And I buy when it down a few percent.", "score": 1, "replies": []}]}]}, {"body": "Had a lil silver just to have a non equity non bond position in my portfolio that I could keep track of and that Shit is up 25% in the past few months lol \n\nIf only I actually dedicated the proper 5-10% value hedge to commodities…would have made a huge different", "score": 1, "replies": []}, {"body": "Im not buying until SPY is 50% down from peak. Currently just chilling in bonds.", "score": 1, "replies": []}, {"body": "From now on, can you do a weekly post of your portfolio diversification? I would like to invert it", "score": 1, "replies": []}]}
{"title": "$TSLA Daily Thread - April 06, 2023", "selftext": "Fun chat. No comments constitute financial or investment advice.  ⚡", "id": "12d6lbm", "created_utc": 1680748812.0, "score": 42, "upvote_ratio": 0.96, "num_comments": 494, "comments": [{"body": "i was never super pleased with the results enabling fsd in our little town before v11\n\nand tonight i finally got around to using v11 in town \n\nhave to say, it was pretty fucking great\n\nmore than once i thought, *that felt human* \n\nalso, love the quick speed changes at speed limit signs and on scroll wheel adjustments \n\noh and there’s one 90 degree bend on a backroad where it has to slow to about 10mph to make the turn comfortably. a relatively simple maneuver, but the deceleration and cornering felt almost bizarrely precise, even a bit *better* than human. weirdly good. looking forward to more of that", "score": 23, "replies": []}, {"body": "2019: “learn to code bro”\n\n2024: “learn to weld bro”", "score": 19, "replies": []}, {"body": "On the bright side, my neighbors got rid of a jag and pulled in with an S & X combo.\n\nEdit:\nhttps://imgur.com/a/NZn4Q1d", "score": 17, "replies": [{"body": "Both arrived at the same time? Ballers.", "score": 6, "replies": []}]}, {"body": "Only down 11.6% since beating delivery expectations 🤡", "score": 15, "replies": [{"body": "We all kind of rag on the media for lacking nuance and ignoring substantive progress by Tesla.  I think it's important to look at it from the other side as well.  \n\nDelivery numbers were not the only metric being used to determine quarterly performance.  Obviously the market is spooked by demand concerns given the large gap between production and deliveries.  This could be as simple as Model S/X in transit to new markets in Asia or as messy as dwindling demand for Model 3 at current price points.  The fact is, the market is selling off TSLA due to uncertainty.  Thankfully, Tesla will have to provide some context to their numbers at the quarterly earnings call, but until then, it can't come as a surprise that the stock price drops when uncertainty exists.", "score": 17, "replies": [{"body": "💯", "score": 6, "replies": []}]}, {"body": "It was a miss of whisper numbers and disappointing,  as you can see", "score": 3, "replies": []}, {"body": "![gif](giphy|4yK4dZSzGcHuTz0x76)", "score": 2, "replies": []}]}, {"body": "I like the masturbation plan part 3 🍆🍆🍆", "score": 14, "replies": []}, {"body": "Shanghai rumor solved:\n\n>!Cybervault will be available in midnight cherry soon!<", "score": 14, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Now imagine if the base version has a price bellow F150, bellow Rivian (which obviously it will be) and with better range, charging and everything else?\n\nThey better ramp it quickly", "score": 3, "replies": []}]}, {"body": "GO GREEN BITCH 😤😤😤", "score": 10, "replies": [{"body": "Nvda: ok \n\nTsla: nah I'm good", "score": 3, "replies": [{"body": "Dares look: I did go green then pulled back", "score": 1, "replies": []}]}]}, {"body": "Masterplan part 4 will save us", "score": 10, "replies": [{"body": "In Q5?  Excellent!", "score": 6, "replies": []}, {"body": "2031, yeah!!   We'll be trading at $259 split adjusted*!!!!\n\n\n\n-----------\n\n*current split adjusted", "score": 4, "replies": [{"body": "Im not caffeinated enough to understand this. Are you saying were only going up like 50% - 60% in the next 8 years?", "score": 1, "replies": []}]}]}, {"body": "Wake me up when cybertruck goes into production. Crabby mcCrab crab until then. 🦀", "score": 11, "replies": [{"body": "![gif](giphy|ZDtZyOmpMZGgK67JGg)", "score": 6, "replies": []}]}, {"body": "Master Plan 3 Summary:\n\n![gif](giphy|MAA3oWobZycms)", "score": 10, "replies": [{"body": "What’s up w people acting like MP3 is something new? Did everyone just black out during investor day?", "score": 1, "replies": []}, {"body": "True, but I also like the bit about humanity not being fucked. (only talking about the energy transition here. There are still quite a few more other ways for humanity to get fucked that I could mention)", "score": 1, "replies": []}, {"body": "![gif](giphy|g01FakEbcUua6yM34a)", "score": 1, "replies": []}]}, {"body": "Give us the goddam GREEN\n\n![gif](giphy|HxgTc2NvIO6jowsknb)", "score": 10, "replies": [{"body": "LOL", "score": 3, "replies": []}]}, {"body": "Elon visiting Shanghai this weekend to reveal model 3 highland? And maybe announce FSD as well?\n\nModel 3 lines were down for something in February..\n\nhttps://electrek.co/2023/02/15/tesla-partly-shut-down-giga-shanghai-upgrades-for-new-model-3/", "score": 11, "replies": []}, {"body": "like a shart nobody expected this\n\nRESTAURANTS\nStarbucks customers are complaining about stomach issues from new olive oil-infused coffee", "score": 9, "replies": [{"body": "I mean I had stomach issues reading about their plan to debut oil infused coffee\n\nSo gross", "score": 4, "replies": [{"body": "someone needs to get fired for that", "score": 3, "replies": [{"body": "Boston Market: “Tobacco smoked hams debuting this Easter” /s", "score": 2, "replies": []}]}]}, {"body": "I thought drinking coffee to trigger your morning shit was a feature, not a bug", "score": 2, "replies": [{"body": "this does that and then some", "score": 3, "replies": []}]}, {"body": "most people are drinking coffee with rapeseed or sunflower oil now. It's in the milk and / or creamer", "score": 1, "replies": []}]}, {"body": "Joe Gebbia only owns 111 shares. 🤣 Get this guy out of here - he has no faith!", "score": 9, "replies": [{"body": "I think I have about that many shares. But thsts not counting my TSLL holdings or my 2025 leaps.", "score": 1, "replies": [{"body": "RUA for BoD confirmed", "score": 4, "replies": [{"body": "Could do alot worse for sure", "score": 2, "replies": [{"body": "Im apparently better with other people's money than my own. LOL\n\n[Cries]", "score": 1, "replies": []}]}]}]}]}, {"body": "When does construction start for Giga Mexico?\n\nWe need some cabrones to do drone videos over there 🥸🥸🥸", "score": 7, "replies": [{"body": "They've already started excavation", "score": 6, "replies": [{"body": "Source?", "score": 1, "replies": []}, {"body": "Where did you find this?", "score": 1, "replies": [{"body": "I thought they said at Investor Day that excavation starts in March", "score": 1, "replies": []}]}]}, {"body": "I always heard July \n\nJust waking up to all this Master Plan 3 info and tags.", "score": 2, "replies": []}]}, {"body": "A quick 2-minute snippet of Elon talking about just how hard production is. I've never heard him speak this passionately about the subject. Worth a quick listen. It's truly amazing how far Tesla has come. \n\nhttps://youtu.be/G20pj_o2Jxs", "score": 9, "replies": []}, {"body": "It seems like a Chinese megapack factory is possible [https://twitter.com/Tslachan/status/1643901950231207937?s=20](https://twitter.com/Tslachan/status/1643901950231207937?s=20)", "score": 9, "replies": [{"body": "[Tweet from @Tslachan](https://twitter.com/Tslachan/status/1643901950231207937): $TSLA @elonmusk •Tesla to continue hiring jobs related to energy storage facilities in China. 🇨🇳(Looking for more positions)- I am sure that energy storage facilities will be built in China.- Tesla will be based on its Lathrop, California plant, and reflect it in the… https://t.co/WbH1tXVdxt https://t.co/DfMYH0uRm4", "score": 5, "replies": []}, {"body": "Fo sho! Gotta build them somewhere, the demand exists.", "score": 1, "replies": []}]}, {"body": "so its gonna be small car, van, bus, then maybe tesla roadster so like 2028, good cuz at this rate i wont be able to afford it until then", "score": 8, "replies": [{"body": "Painfully true 😅", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/ko4fc8durcsa1.jpeg?width=828&format=pjpg&auto=webp&s=62578a8ae81db79bf0f5ff9fa8bd43f721b0eb65\n\nWhich stonk is TSLA lol?", "score": 8, "replies": []}, {"body": "Holding the spot for /u/glibgloby ;)", "score": 6, "replies": [{"body": "![gif](giphy|OMZRxGyZZ6fGo)", "score": 12, "replies": [{"body": "![gif](giphy|uXUmaREltwja1dEqXi)", "score": 7, "replies": []}]}, {"body": "🙏 thank you\n\nI promise to take 100% of the credit if we’re green, and to throw you under the proverbial bus if we go red", "score": 8, "replies": [{"body": "🎩 doff", "score": 4, "replies": []}]}]}, {"body": "https://www.youtube.com/watch?v=3MVIWeU36ZY\n\nEarnings call. Get your seats early", "score": 7, "replies": [{"body": "this isn't gonna be the one folks", "score": 7, "replies": [{"body": "Lol yup if we avoid a shitshow I'm happy. Q1 seasonally worst", "score": 6, "replies": []}, {"body": "Thank you for tempering our expectations", "score": 3, "replies": []}]}, {"body": "Ehhhh", "score": 5, "replies": []}, {"body": "yeah they posted this a few days ago\n\nI don’t recall them posting the event so early like this before\n\nmaybe it’s a hidden message of good news 🤔", "score": 4, "replies": [{"body": "![gif](giphy|92wH9E5FNKtqVMPapQ)", "score": 9, "replies": []}]}, {"body": "🔥🔥🔥🔥🔥🔥🔥🔥", "score": 3, "replies": []}]}, {"body": "[https://twitter.com/Sino\\_Market/status/1643813318396874752?s=20](https://twitter.com/Sino_Market/status/1643813318396874752?s=20)\n\nstimulus", "score": 7, "replies": [{"body": "[Tweet from @_Market](https://twitter.com/_Market/status/1643813318396874752): ⚡#China will cut 1.8 trillion yuan($262.14 trillion) tax and fee burden for businesses in 2023, Xinhua cites the vice governor of Taxation Administration.*🇨🇳Stimulation", "score": 3, "replies": [{"body": "262 billion usd", "score": 8, "replies": []}]}, {"body": "Socialism with Chinese characteristics", "score": 2, "replies": []}]}, {"body": "https://twitter.com/zerohedge/status/1643956608299413506?t=YasM2oALlObmAIm0YPDXTw&s=19\n\nWild. FED is a joke. Emergency cuts, please. Shock and awe CPI, please.", "score": 7, "replies": [{"body": "[Tweet from @zerohedge](https://twitter.com/zerohedge/status/1643956608299413506): last week claims was 246K revised from 198Kthe week before that was 247K revised from 191Kthe week before that was 230K revised from 192KJust a small difference which might have had just a little impact on the Fed's decision", "score": 4, "replies": [{"body": "Woah. Those are some insane revisions. \n\nTime for rate cuts now, please?", "score": 7, "replies": [{"body": "\"Data driven\" let's see it fuckers...", "score": 3, "replies": []}]}]}, {"body": "Bro. They said they want to chill down the economy and that’s exactly what they are doing", "score": 3, "replies": [{"body": "😆 We're data driven! Gonna hike cause jobs look okay! Narrator: They were not okay.", "score": 5, "replies": [{"body": "[https://fred.stlouisfed.org/series/UNRATE/](https://fred.stlouisfed.org/series/UNRATE/)\n\nIf you zoom out it's still okay historically. Have a decent way to go before it's \"unacceptable\".", "score": 2, "replies": [{"body": "Yeah but when you say you're using data, and that data keeps trending down, and it's actually WAY worse than you had thought. I mean the whole reason bad news is bad again is because clearly the market has no faith in the FED intervening before it's too late.", "score": 3, "replies": [{"body": "The data they use (for better or likely for worse) hasn't trended down lately though. It's showing more their point where things are stickier than anticipated.\n\n[https://www.bea.gov/news/2023/personal-income-and-outlays-february-2023](https://www.bea.gov/news/2023/personal-income-and-outlays-february-2023)\n\nCore PCE -   0.3 0.2 0.4 0.5 0.3 \n\n[https://www.bls.gov/news.release/cpi.nr0.htm](https://www.bls.gov/news.release/cpi.nr0.htm)\n\nCore CPI -  0.6 0.6 0.3 0.3 0.4 0.4 0.5", "score": 1, "replies": [{"body": "Okay let me make this clear since you're not exactly disagreeing but are being pedantic which I'm very not. Truly nothing personal, just clashes in text and is something I struggle with.\n\nFED's data is BAD quality. That BAD quality data is showing worse than expected results AFTER FED already made a decision based on said data. The more important issue is, as we saw with covid, is that this FED has shown 0 ability to do anything proactively. They are absurdly reactive which means they will only react to disaster. That means disaster happened. That disaster is coming. Disaster the FED caused. Disaster. That is my message :)", "score": 1, "replies": []}]}]}]}, {"body": "My understanding is they are continuing to hike in order to raise unemployment and thereby slow inflation", "score": 1, "replies": [{"body": "You're not wrong, but the way they do it all but guarantees a recession because they don't see the damage they do until after it happens.", "score": 1, "replies": []}]}]}]}]}, {"body": "I wonder if mainstream media will run stories on masterplan #3?\n\nSeems pretty newsworthy.  Or maybe they'll just focus on a single vehicle fire or some minor panel gaps", "score": 7, "replies": [{"body": "masterplan part 3 is way too long for media to pick up on it.", "score": 5, "replies": []}]}, {"body": "RWD MY with enhanced autopilot and mid night cherry it is.\n\n85k EUR in Turkey…", "score": 7, "replies": [{"body": "o good they charge in euros. keep it that way. we need lira on our balance sheet about as much as we need doge.", "score": 3, "replies": [{"body": "They charge TL but clearly mention on website that price is only an estimate and final pricing only available upon delivery.\n\nIn their backend they prolly fix price in USD.", "score": 1, "replies": []}]}]}, {"body": "https://twitter.com/financialjuice/status/1643992251876671490?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\nTranslation: Cuts soon.", "score": 7, "replies": [{"body": "Hearing reports that it will in fact save us", "score": 7, "replies": [{"body": "Unconfirmed reports.", "score": 3, "replies": []}]}, {"body": "🤞", "score": 3, "replies": []}, {"body": "[Tweet from @financialjuice](https://twitter.com/financialjuice/status/1643992251876671490): FED'S BULLARD: RATES ARE CURRENTLY AT THE LOW END OF A SUFFICIENTLY RESTRICTIVE RANGE.", "score": 1, "replies": []}, {"body": "Holy shit Bullard being dovish??? Capitulation", "score": 1, "replies": []}, {"body": "Low end of causing restriction.... so wouldn't that mean at best a pause?", "score": 1, "replies": [{"body": "you gotta start somewhere. lets see how cpi is next week.", "score": 2, "replies": [{"body": "I agree. People were saying cut. Based on his statement a pause seems more likely than a cut but we'll have to wait and see what the data shows", "score": 1, "replies": [{"body": "cutting while CPI runs hot is suicide for everyone", "score": 2, "replies": []}]}]}]}]}, {"body": "![gif](giphy|d5mI2F3MxCTJu)", "score": 8, "replies": [{"body": "me until we are trading at $2,420.69", "score": 5, "replies": [{"body": "not all of us will still be alive by then", "score": 8, "replies": [{"body": "A true tragedy of our times.", "score": 2, "replies": []}]}]}, {"body": "Do not let the stock affect your emotions and more importantly do not sell CCs", "score": 3, "replies": []}]}, {"body": "Alright how we pinning this on elon", "score": 7, "replies": [{"body": "🐦", "score": 2, "replies": []}]}, {"body": "For the 16th time - let’s hope CPI cool next Wednesday 🥶.\n\nThat with positive earnings / solid profit + margins = Gucci 🔥🚀\n\nThen again I been hoping this for a very long time.\n\n![gif](giphy|Zrxs6nl12WgmL3ZTHm)", "score": 13, "replies": [{"body": "MoM -0.8% CPI would be awesome\n\nQoQ +$0.20 EPS even with the price cuts would be awesome", "score": 3, "replies": []}]}, {"body": "Looks like I'm going to Duesseldorf in the fall", "score": 6, "replies": [{"body": "Vacation? Or Tesla car counting for us?", "score": 3, "replies": []}, {"body": "Octoberfest hell ya", "score": 2, "replies": [{"body": "That would be Munich?", "score": 3, "replies": [{"body": "You know better than I do.  All I know is Germany in the Fall.  Beer and sausages. 💘", "score": 1, "replies": [{"body": "You love dem sausages, don't you 🥸🥸🥸", "score": 2, "replies": [{"body": "![gif](giphy|iiTXaJVjiSHew)", "score": 2, "replies": []}]}]}, {"body": "Isn't Octoberfest all across Germany? It's definitely in Köln.", "score": 1, "replies": []}]}]}, {"body": "Happy snek hunt", "score": 1, "replies": []}, {"body": "You an engineer?", "score": 0, "replies": [{"body": "he  a doctor iirc", "score": 1, "replies": []}]}, {"body": "Very good. It’s known for altbier, which is similar but vastly superior to kolsch", "score": 1, "replies": []}]}, {"body": "[Tesla tweeted](https://twitter.com/Tesla/status/1643862537866182658): Big batteries FTW! https://t.co/H2KhRY2VmS", "score": 6, "replies": [{"body": "🤩🤩🤩", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "![gif](giphy|3o6Zt4HU9uwXmXSAuI)", "score": 1, "replies": []}]}, {"body": "Testing testing, is everyone blocked or did I miss someone?", "score": 5, "replies": [{"body": "Blocked", "score": 3, "replies": []}, {"body": "I had some issues getting on today so maybe reddit was being cranky", "score": 3, "replies": []}, {"body": "I’m here. 🥺", "score": 5, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "😆😆", "score": 1, "replies": []}]}]}]}, {"body": "Classic reminder of why no one listens to dramatic permabears \n\nhttps://www.reddit.com/r/stocks/comments/x6sqk0/history_lesson_no_big_decline_has_ever_been_fully/ina0x2r/", "score": 6, "replies": [{"body": "True. But just dramatic, anything.", "score": 2, "replies": []}]}, {"body": "https://twitter.com/teslashanghai/status/1644001622069235712?t=0OoHQ6l06jOD3EmSXl1l5Q&s=19\n\nTeala china spy back", "score": 6, "replies": [{"body": "Ultra red charging box!!!", "score": 3, "replies": []}, {"body": "Need something good like the CCP committing to buying 100M robotaxis", "score": 3, "replies": [{"body": "INFINITE DEMAND", "score": 2, "replies": []}]}, {"body": "do we even believe him after last time?", "score": 3, "replies": [{"body": "Don't trust anyone", "score": 3, "replies": [{"body": "true", "score": 1, "replies": []}]}, {"body": "Not 100% like before", "score": 2, "replies": []}]}, {"body": "[Tweet from @teslashanghai](https://twitter.com/teslashanghai/status/1644001622069235712): Wonderful things will happening in GIGA Shanghai this weekend。$tsla", "score": 3, "replies": []}, {"body": "What is it going to be this week?\n\nCyber-hose reel? Cyber keychain? How about a cyber car wash bucket.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "very nice\n\nwas going to make a joke of some kind about the music but that song is pretty cool I like mos def\n\nI used to use massive attack as make out music so often that now I have trouble really listening to it much, got kinda burned out on them", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I have a special Spotify playlist I’ve been working on for years that’s just make out music", "score": 2, "replies": [{"body": "That's an excellent pick up line.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": []}]}, {"body": "I can't find the bird in master plan part 3", "score": 11, "replies": [{"body": "Maga plan part 3*", "score": 1, "replies": []}]}, {"body": "Kimball selling as master plan part 3 comes out, too good", "score": 9, "replies": [{"body": "Why are people acting like MP3 is something new? It’s literally just the written version of investor day…", "score": 4, "replies": []}, {"body": "but exercised options as well sooooo", "score": 2, "replies": []}]}, {"body": "ruble is finally starting to crash\n\naccording to a [Yale study](https://insights.som.yale.edu/insights/with-zero-visibility-into-the-russian-economy-the-imf-is-parroting-putins-line) russian economy is probably far worse than most think", "score": 10, "replies": [{"body": "Here is an older article about Elvira Nabiullina who heads the central bank for Putin. Looks like a smart cookie but there is only so much you can do for so long until there are too many things to keep in the air and it all comes down\n\nhttps://archive.ph/PLiiL", "score": 2, "replies": [{"body": "Yeah she’s done well to mitigate the effects but that won’t last forever.", "score": 1, "replies": []}]}, {"body": "What's crashing more tsla or rub", "score": 3, "replies": [{"body": "rub\n\ndown 20% since december", "score": 2, "replies": [{"body": "And no one's using NLAWs, TOWs, and Javelin missiles in Tesla cars.... yet.", "score": 2, "replies": []}, {"body": "What about since sept", "score": 2, "replies": [{"body": "ruble was stable until very recently so picking an older month is not a very meaningful activity", "score": 1, "replies": []}]}]}]}]}, {"body": "welp this is what happens when /u/Johnnycashrules gets first post\n\nyou got a lot of nerve man", "score": 11, "replies": [{"body": "![gif](giphy|l0ExcgeKHxCptIIVO)", "score": 1, "replies": []}]}, {"body": "Let’s go 🚀🚀🚀 give me a good start to the wkend kthxbye", "score": 5, "replies": []}, {"body": "Gimme the Q1 margin", "score": 6, "replies": []}, {"body": "Wake me up in 2030", "score": 5, "replies": []}, {"body": "What if everyone just stopped selling", "score": 4, "replies": [{"body": "Good question.", "score": 2, "replies": []}]}, {"body": "Let's see what today brings...\n\n&#x200B;\n\nhttps://preview.redd.it/db9hbmts5bsa1.png?width=222&format=png&auto=webp&s=dc1ff0bcfab1cc5a71786278cb89e700d1051036", "score": 4, "replies": [{"body": "Loss narrows.", "score": 3, "replies": [{"body": "And then it gets worse.\n\n&#x200B;\n\nhttps://preview.redd.it/tf9vi113gbsa1.png?width=219&format=png&auto=webp&s=001a98bb13c5c7282fa7e278af8bcaf309574fbc", "score": 2, "replies": []}]}]}, {"body": "At least the 10yr rate  keeps falling", "score": 5, "replies": [{"body": "Yup market making buying cars cheaper even if fed isnt", "score": 6, "replies": [{"body": "And gas going back up\n\nShould probably sell TSLA though…", "score": 3, "replies": []}]}]}, {"body": "Wtf is this shit", "score": 6, "replies": [{"body": "Don't worry stock gains are in transit and will be delivered next quarter, gotta unwind the stock price wave.", "score": 11, "replies": [{"body": "He means to say is musk family and foundation still have few more billion to dump on us and 🤡 retail bag holders", "score": -2, "replies": [{"body": "When you waive due diligence sacrifices have to be made. Sacrifices like you.", "score": 9, "replies": [{"body": "😆😆", "score": 2, "replies": []}]}, {"body": "sell", "score": 5, "replies": []}, {"body": "Sell", "score": 3, "replies": []}, {"body": "🍼", "score": 3, "replies": []}]}]}, {"body": "![gif](giphy|l0IypeKl9NJhPFMrK)", "score": 7, "replies": [{"body": "me when people post options plays which have the potential to ruin their financial wellbeing instead of just buying && hodling", "score": 7, "replies": [{"body": "[Side eye]", "score": 2, "replies": [{"body": "I give credit where credit is due and absolutely commend the risk takers and the risk taking involved. I however cannot engage in such high stakes action.", "score": 2, "replies": []}]}]}]}]}, {"body": "People complain but I'd rather take this than -4%", "score": 4, "replies": [{"body": "Agreed, I'm just hoping there's a big announcement at earnings that moves it up, I don't think the numbers will be enough to make it green", "score": 1, "replies": []}]}, {"body": "Buy high, cry about shit, sell low.", "score": 6, "replies": [{"body": "I prefer that other strategy.\n\nBuy a bit every month or when money available, then when I retire sell a bit whenever money needed. Hoping that crying about shit will not be needed.", "score": 6, "replies": [{"body": "Rational and prudent.\n\nFuck outta here.", "score": 4, "replies": []}]}]}, {"body": "Anyone that hasn’t voted in the latest Supercharger voting, can you throw a Vote to Presque Isle, Maine?  Fucking nothing within 3 hours there unless you go into Canada.  Would be much appreciated.", "score": 5, "replies": [{"body": "holy shit u live in the green or snow middle of nowhere", "score": 1, "replies": [{"body": "Oh yea I don’t live there…. I live in Connecticut but we go up every once in a while for family up there and it’s only Supercharging desert I encounter.", "score": 1, "replies": []}]}]}, {"body": "Elon is way too powerful, he wrote a paper about Hyperloop and that managed to kill a whole rail project /s\n\nI hate having to hear that idiotic thing time and time again, and I gave up countering it", "score": 5, "replies": [{"body": "I don't even get where it's coming from. It's like some flat Earth shit at this point...", "score": 2, "replies": []}, {"body": "Anyone who repeats that nonsense might as well be holding up a big sign that says \"I lack critical tubing skills\".\n\nIt's just a perfect example of how people will believe anything if it confirms their pre-existing opinions.", "score": 2, "replies": []}]}, {"body": "![gif](giphy|aTGwuEFyg6d8c)", "score": 5, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "what indicates something BIG is gonna happen, tired of shit never happening", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "The Arnold Palmer of the lounge", "score": 1, "replies": []}]}, {"body": "Nothing jus Tesla Twitter being themselves\n\nEventually clock is going to be right one of these days", "score": 4, "replies": []}]}, {"body": "I'll bet they don't file it on time as a big suck e cock move", "score": 5, "replies": []}, {"body": "[Tweet from @teslaboomermama](https://twitter.com/teslaboomermama/status/1644039768693690369): I expect the 14A Proxy Statement for Tesla's Shareholder Meeting on May 16 to drop this afternoon, after market close.Ideal with the market closed 3 days for Easter weekend.May be wrong, but the set-up might mean something big is in it.", "score": 3, "replies": []}]}, {"body": "Hyundai Ioniq 6 initial efficiency test on [OutOfSpecReview](https://www.youtube.com/watch?v=gA17TMJZIGY) YouTube channel.  The highest spec model ($57k - no tax credit) with eco mode on (front motor disconnected) managed 270Wh/mile at 60-65mph commute speeds.  My 2 year old Model Y Performance gets 260Wh/mile at those speeds.  For reference a MYLR gets just under 250Wh/mile.  \n\nThe Ioniq 6 is supposed to be the most efficient model from the Korean manufacturers and they still can't match Tesla's capabilities that have been around for years.  And it doesn't qualify for any tax credits.", "score": 10, "replies": [{"body": "Honestly 270 Wh/mile is pretty impressive. If they can get anywhere near Tesla for a lower price than that they'll do great. Nobody's beating Tesla anytime soon, but getting close is good enough for legacy OEMs.", "score": 5, "replies": [{"body": "Oh I agree.  Hope they can make some milestone achievements to bring down prices and increase efficiency, but right now, they just can't compete.", "score": 2, "replies": []}, {"body": "Agreed.  Doesn't need to be the best, just needs to be competitive.  Good for them.", "score": 1, "replies": []}]}, {"body": "i love the look of those things", "score": 1, "replies": [{"body": "The Model Y right? Right?", "score": 4, "replies": [{"body": "![gif](giphy|S2FZNeTbQxe2OJeRwn|downsized)", "score": 2, "replies": []}]}, {"body": "Are you thinking the Kia EV-6? That one, I agree, looks pretty sharp. The Hyundai Ioniq 6 is….different\n\nhttps://preview.redd.it/vg9c94sxybsa1.jpeg?width=1920&format=pjpg&auto=webp&s=a7f78355f6f9f9ce7bd9e6092b586965a2c10be8", "score": 3, "replies": [{"body": "![gif](giphy|U1lrVuoMtWu3ApVhMv)", "score": 2, "replies": []}]}]}]}, {"body": "It's crazy how Tesla just released Master Plan 3 and unveiled so much about the future of Tesla and the market is like:\n\n![gif](giphy|uLy4Bo680hZxm)", "score": 7, "replies": [{"body": "Credibility issue", "score": 16, "replies": [{"body": "PDFs don't move markets", "score": 18, "replies": [{"body": "![gif](giphy|KfKawbBX96kk0iljwu)", "score": 2, "replies": []}]}]}, {"body": "Tesla has over promised and under-delivered so many times, promises won’t do anything to the stock. Maybe create some “yeah, right, sure” analysts.", "score": 8, "replies": [{"body": "market stopped giving absolutely any credence to these promised future profits when Elon destroyed the stock. now they're saying ok, now prove it.", "score": 1, "replies": [{"body": "Yeah burden of proof is on us to deliver before the market gets hyped up.", "score": 1, "replies": []}, {"body": "It was like that before he paper handed.\n\nHe's been talking about FSD for years - it wasn't until they had a more public beta in late 2021 (and, I assume, could recognize more of the revenue for it) that the market took it more seriously ($800 to $1200 that month).", "score": 1, "replies": [{"body": "i mean how we were holding up very well compared to macro last Sept until Elon's sales finally broke the stocks back and now the market is like ok, you can stick with this compressed pe", "score": 1, "replies": []}]}]}]}, {"body": "Am I missing something or did Tesla not actually say they were going to do anything specific, just that this is what they think will be required for the world in general if we were to switch to renewables.", "score": 2, "replies": []}]}, {"body": "🚀", "score": 4, "replies": [{"body": "🚀🚀", "score": 3, "replies": []}]}, {"body": "[https://twitter.com/WatcherGuru/status/1643773307353800704?s=20](https://twitter.com/WatcherGuru/status/1643773307353800704?s=20)\n\nThe command to open it: \n\nopen /System/Library/Image\\\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf", "score": 4, "replies": [{"body": "[Tweet from @WatcherGuru](https://twitter.com/WatcherGuru/status/1643773307353800704): JUST IN: #Bitcoin whitepaper is hidden on every Apple MacBook computer running recent versions of macOS software. https://t.co/zUiWorLyj5", "score": 2, "replies": []}, {"body": "why?", "score": 1, "replies": []}]}, {"body": "nasdaq futures on crack today.", "score": 3, "replies": []}, {"body": "Things were so hopeful in February…", "score": 4, "replies": []}, {"body": "Money was overrated anyways", "score": 3, "replies": []}, {"body": "Someone’s buying a lot", "score": 3, "replies": [{"body": "buyers, probably", "score": 3, "replies": []}]}, {"body": "Wen tesla pedo van", "score": 5, "replies": []}, {"body": "TSLA today:\n\n![gif](giphy|3ohzdWwHlzYzWUCH6g)", "score": 4, "replies": []}, {"body": "doom and gloom?\n\nsome 1 hour rsi crayons crossed on qqq and tsla?  fine.  I bought 190/200 call spread for next week and the week after.  \n\n(dca'd into a few more shares last week, trying a spread this week because I expect a short-term bounce, not a new long-term bully rally (yet). small gamble, not a yolo)", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "He is!! And hopefully sleeping better now. Those first few weeks are killer", "score": 3, "replies": [{"body": "Hooray! Good news!", "score": 3, "replies": []}]}]}, {"body": "Help me out, please.\n\nI do not understand the following:\n\nThe Fed, JPow and his minions always tell us that they are \"data driven\" and have all the \"tools\" they need.\n\nWhy can't they input all their great economic data into an algorithm and auto adjust rates based on their input?\n\nWhy do they have to reinvent new tools all the time, even if they have all the tools? \n\nP.s.: JPow still believes in the Phillips Curve. 😬", "score": 4, "replies": [{"body": "The key thing is that the fed isn't trying to change rates to be at the right level. They're trying to change what people *expect* rates to be in the future. That expectation is what drives everything, but changing it is very hard.\n\nFor example, if you want:\n\n* Rates to be 5% now\n* But 2% over the long term\n\nThere's a huge difference between slowly changing from one to the other and just dropping them quickly. Mostly because if everyone *expects* you to drop the rates quickly at sometime soon, they'll just act like the rates are already lowered. There's no point in getting a 30 year mortgage now if everyone accurately expects rates to drop very soon.\n\nWhat would work great, if you could pull it off, is to get everyone to act like they expect rates to be high forever. And then you can drop them. Which is obviously a tricky thing to do. You have to first convince everyone you're predictable, and then act unpredictably occasionally.", "score": 5, "replies": []}, {"body": ">and have all the \"tools\" they need.\n\nI've heard JPow said they have tools at their disposal, but not all the tools they need.\n\nDuring his senatorial and congressional hearings last month he even said multiple times there are policies the Fed cannot influence and should not influence as those are beyond the scope of the Fed's mandate.  \n\n\n I think he did a pretty nice job saying \"if you feel a certain way about a policy unrelated to rate hikes,  it's up to you to change it or start it since that's your job as an elected representative\".    He's well aware he can't change oil subsidies, oil trade agreements or expand domestic drilling, and that he can't increase housing availability.     \n\nIt's one of the reasons they look at core CPI (minus energy and housing costs) in addition to total CPI since the Fed knows it can't really affect housing or energy costs/availability", "score": 5, "replies": []}, {"body": "JPow is a mumble rapper.", "score": 4, "replies": []}, {"body": "data driven:\n\n    data1 = have 3+ banks collapsed?\n    data2 = is inflation going down?\n    if not data1 and not data2:\n        raise rates again", "score": 2, "replies": []}, {"body": "IT'S TRANSITORY!!!", "score": 3, "replies": []}]}, {"body": "my squirrel pie (shepards pie with acorn squash instead of mashed potatoes) ended up being pretty amazing\n\nI bring dinner to my neigubor a lot because she’s really old and her husband died a few months ago, and I gave her a massive triple portion so she had leftovers and she said she ate it all in one sitting which is nuts\n\nI pretty much made the [babish](https://youtu.be/Uj8BC2kcp7A) recipe but with squash and ground 93% lean beef instead of lamb\n\nadded butter, a little milk and some egg yolks to the squash like he did for the potatoes to encourage browning but not totally sure yolks were necessary.\n\nI also didn’t have any pre made Demi-glacé so just used some better than beef bouillon which works fine, it can replace the use of salt. I also used a brown ale instead of a stout because I find the flavor to be more subtle and complex\n\nI forgot to take a picture of the final result but there is a [pic of the acorn squash ](https://i.imgur.com/DYsKXQD.jpg)after I flipped them. you just cut them in half and rub olive oil all over the inside and then season with salt and pepper before putting them flat side down on a baking tray and cooking for 40 min @400\n\ni used both peas and corn in the middle layer \n\nsomething about the slightly sweet flavor of the squash with the meat is just so satisfying\n\nprobably going to use more corn next time in middle layer and try topping it with a little sharp white cheddar which I left out this time. also might add a little diced celery to the meat which it kinda seems like babish left out as he’s basically making a low tomato bolognese", "score": 6, "replies": [{"body": "Sounds like Glib has a girlfriend, right in dude!", "score": 6, "replies": [{"body": ">right in dude!\n\nThats what he said?", "score": 3, "replies": [{"body": "Yup, put it right in dude!", "score": 2, "replies": [{"body": "![gif](giphy|waqckZe7nj4oE)", "score": 2, "replies": []}]}]}]}, {"body": "Ehem, it's \"demi-glace\", not demi-glacé.  Misplaced aigu accent.  Come on Glibgloby, did you not have your morning Fresca yet?", "score": 4, "replies": [{"body": "auto-correct did that for some reason not me", "score": 1, "replies": []}]}, {"body": "Good on ya buddy", "score": 3, "replies": []}, {"body": "Wtf is this sir?", "score": 2, "replies": []}, {"body": "![gif](giphy|8hZ9CvCotpKMv7a0OV|downsized)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "CEO of QQQ diamond handed", "score": 6, "replies": [{"body": "Yes he is, Dave Nasdaq", "score": 2, "replies": []}]}, {"body": "But qqq didn't save free (right wing) speech and (maga) democracy*. *Had to be done. *just the macro.", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "There was no choice, was an emergency", "score": 3, "replies": []}]}]}]}, {"body": "Master plan 3 is what I was expecting investor day to be", "score": 9, "replies": [{"body": "What do you mean? They’re literally the same thing..", "score": 6, "replies": [{"body": "A bit more detail perhaps. They basically announced a Tesla Van and Bus in the masterplan. That would've been worth revealing at investor day I suppose.", "score": 2, "replies": [{"body": "That’s was implied at investor day and Elon has stated several times in the past that Tesla would eventually have a vehicle in every category. This white paper does nothing to make that any more concrete…", "score": 1, "replies": [{"body": "I definitely think it makes them a bit more concrete. \"every category\" is a very loose term, a bus and van to be the next model after the compact car is a lot more specific.", "score": 1, "replies": []}]}]}]}]}, {"body": "Imagine if Tesla actually advertised their product as opposed to decimating margins with price cuts", "score": 14, "replies": [{"body": "Lol imagine a Lotta things", "score": 14, "replies": []}, {"body": "Waste of money. Tesla is already selling every car they make without it.\n\nAds are great to reach people that otherwise wouldn't hear about your product or to sell a product that isn't the best value people can get, but everyone already knows what a Tesla is and they're the best value out there. Tesla will start advertising when they're building more cars than they can sell, or if someone else builds a better EV.", "score": 9, "replies": [{"body": "> Tesla will start advertising when they're building more cars than they can sell\n\nSo... Now?\n\nA lot of people outside the US still don't know about Tesla, a lot of people in the US has a bad opinion of Tesla because the media, a lot of people don't know about the huge price cuts on all Tesla vehicles. Ads will work in all this huge segment of the poblation\n\nTesla will sell every vehicle they make, but at the cost of more price cut if they don't find other ways to increase demand, witch ads could be a option", "score": -1, "replies": [{"body": "> So... Now?\n\nEhm no. Building up a little inventory when you're selling twice as many cars as little over a year ago is to be expected. That doesn't mean there's not enough demand to sell every car you build.\n\n> A lot of people outside the US still don't know about Tesla, a lot of people in the US has a bad opinion of Tesla because the media, a lot of people don't know about the huge price cuts on all Tesla vehicles. Ads will work in all this huge segment of the poblation\n\nAds won't influence people's opinion about Teslas, and the data clearly shows people don't have a negative opinion of Tesla regardless of the media's nonsense. Also, everyone knows about Tesla in the US, Europe and China, which is like 90% of Teslas target audience with their current models.\n\n> Tesla will sell every vehicle they make, but at the cost of more price cut if they don't find other ways to increase demand, witch ads could be a option\n\nThat's fair, but ads won't change that. People already want a Tesla, they just don't have the money to afford one. Hence why legacy auto sales are plummeting, even of much cheaper models, and Tesla's are still rapidly increasing.", "score": 5, "replies": [{"body": "Of course there is enought demand to sell every car if prices keep going lower like it has been going for a few months from official and hidden price cuts. I'm just saying that Tesla would need to do fewer less aggressive price cuts in the past and in the future with minimal ads spending to build the narrative in favor of Tesla instead the current hostile narrative around the brand", "score": 1, "replies": [{"body": "Perhaps, perhaps not. There's no guarantee ads would do much of anything for a product that's already by far the most compelling in the market. Tesla has much better data on that than we do.\n\nElon has never said he's against ads btw, in fact he's specifically sad a good ad can be both entertaining and sell a product, so if Tesla thought it would have a positive effect, they'd be using it. For now, I'm guessing it would just be a waste of money that'd be better spent on ramping faster and improving the technology.", "score": 1, "replies": [{"body": "Well, Tesla has never done a ad campaign, so the best way to get information about their performance is to do a test campaign, even if it's in a limited geography, and see if $100 in ads increase more or less demand than a $100 price reduction. I'm open to change my mind if data shows price reductions are more effective per $ for Tesla than a ad campaign, but I need to see the data", "score": 1, "replies": [{"body": "Maybe Tesla already tried this though, who knows?", "score": 1, "replies": [{"body": "Yeah, maybe", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Why don't we? Only possible explanation I can think of is Elon wants Tesla to become most valuable company in world without ever buying an ad, would be cool but time has come imo", "score": 3, "replies": [{"body": "[This is why.](https://www.reddit.com/r/TSLALounge/comments/12d6lbm/tsla_daily_thread_april_06_2023/jf5upnt/)", "score": 3, "replies": [{"body": "Sure people in the bay area may be generally well educated on Teslas but this does not hold true for everywhere outside the bay area. Loads of misinformation. \n\nAdvertising generates demand and there's a balancing act to be had between cutting prices to generate demand or advertising to do so", "score": 2, "replies": [{"body": "I live in The Netherlands and I doubt there's anyone here that doesn't know about Tesla. Perhaps not exactly how good they are, but that's not as easy to fix as running some ad campaigns.", "score": 1, "replies": [{"body": "Idk I think it's worth a test spending a few hundred million to enlighten people and get a gauge on the ROI. I personally am not a fan of advertising but there's a reason nearly all companies do it", "score": 1, "replies": []}]}]}]}, {"body": "can't save the human race from the woke media if you are supporting it through advertising dollars  /s", "score": 0, "replies": []}]}]}, {"body": "&#x200B;\n\nhttps://preview.redd.it/0bmdid501bsa1.png?width=295&format=png&auto=webp&s=441d5921e6ece919730d354b0a3a976e3df00a2c\n\nYea, that's some kind of van.  \n\n\nDamn, CT might be put on hold. I really REALLY liked our Pacifica. If this thing has a decent amount of towing, like \\~4k or so, it's game over for CT. Just too much utility from a van.", "score": 6, "replies": [{"body": "The bad part is that you will be seen driving a van", "score": 4, "replies": [{"body": "Van life bby", "score": 4, "replies": []}, {"body": "I thought about that for like, 20 minutes when we got the Pacifica. Then I had the family of five, 2 dogs, and a weeks worth of luggage all comfortably stowed, getting \\~28mpg on the interstate, and a TV in the back to keep the kids occupied. \n\nIt's great.", "score": 7, "replies": [{"body": ">Master Plan Part 3 - Sustainable Energy for All of Earth\n\nCan't upvote this enough. My wife hates the look of the truck, and we just don't need a truck.\n\nI told her a van might be on the way and she lit up. I then told her we could dress it out like the A team van and change the horn. She's on board whenever reservations open up...", "score": 5, "replies": []}, {"body": "Exactly. The people who hate on vans have never had a van.", "score": 4, "replies": []}, {"body": "Just kidding, and I bet Tesla Van will look way cooler than all others", "score": 1, "replies": []}]}]}]}, {"body": "The market is now open!\n\n| Name | Stock Price | Change Today | Volume |\n|:-:|:-:|:-:|:-:|\n| Tesla, Inc. | $182.81 | $-2.71 (-1.46%) ▼ | 3,633,840 |\n\n[Support TSLA_Bot](https://ko-fi.com/markcreator)", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Wouldn’t be surprised", "score": 1, "replies": []}, {"body": "60", "score": -8, "replies": [{"body": "Sell and rebuy at 60 then.", "score": 1, "replies": []}]}]}, {"body": "![gif](giphy|l4JyRqcDU93S334KQ)", "score": 3, "replies": [{"body": "Username checks out", "score": 4, "replies": []}]}, {"body": "any event like cpi next week?", "score": 3, "replies": [{"body": "Yup cpi wednesday", "score": 5, "replies": []}, {"body": "Cpi", "score": 3, "replies": []}, {"body": "CPI is next week", "score": 3, "replies": []}, {"body": "[https://www.marketwatch.com/economy-politics/calendar](https://www.marketwatch.com/economy-politics/calendar)\n\nEmployment data Friday but market is closed. Then CPI/PPI next week.", "score": 2, "replies": []}]}, {"body": "Bloody week", "score": 3, "replies": []}, {"body": "Anyone wants a bit of hype?\n\nhttps://twitter.com/teslashanghai/status/1644001622069235712?s=46&t=GqbuQg6Xp2KgOxhainBMnw", "score": 3, "replies": [{"body": "[Tweet from @teslashanghai](https://twitter.com/teslashanghai/status/1644001622069235712): Wonderful things will happening in GIGA Shanghai this weekend。$tsla", "score": 2, "replies": []}, {"body": "Any speculations from the Lounge? :P", "score": 2, "replies": [{"body": "Only one I can think of is Elon being there and announcing FSD over there starts now", "score": 7, "replies": [{"body": "From all the recent rumors, I would put money on this being the most probably thing to happen", "score": 3, "replies": [{"body": "Knowing how China is, I wouldn't be surprised if there they let the car take more responsibility that the US\n\nAnd go completely hand free sooner", "score": 1, "replies": []}]}]}, {"body": "Hopefully highland but doubt it", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Snoo sold", "score": 5, "replies": []}]}, {"body": "if tesla is developing a bus, as is hinted at in master plan 3, i wonder if they’re aiming to have it fit in boring company tunnels? \n\nmaybe more of a low profile “long van” format than what we usually picture when thinking of busses?", "score": 3, "replies": [{"body": "![gif](giphy|REn2s1SeWYkb6)", "score": 2, "replies": []}]}, {"body": "It's weird; I can envision so many potential outcomes occurring in the global world right now, but at the same time, I also can not. This is probably what the rapture point feels like, as described by tony seba.", "score": 3, "replies": [{"body": "It's exceedingly difficult when the truth is so hard to ascertain.  So much propaganda being injected from all directions.  Living in the age of disruption and disinformation", "score": 5, "replies": []}]}, {"body": "This some pity green lol", "score": 3, "replies": [{"body": "goog +4%, tsla: best i can do is red", "score": 3, "replies": [{"body": "Yea, the weakness in this stock is insane", "score": 3, "replies": []}]}]}, {"body": "come and new u say 👀", "score": 3, "replies": []}, {"body": "arkk been making tsla look like arkk these days", "score": 3, "replies": []}, {"body": "[https://twitter.com/teslashanghai/status/1644001622069235712](https://twitter.com/teslashanghai/status/1644001622069235712)\n\nThis guy's meh lately, but proxy letter coming out today too. Wonder what's up. I wonder if we get succession discussion. Gonna buy a bunch of cheap puts and calls to hedge. They'll be safe to sell monday morning if we hear nothing since it's CPI week.", "score": 3, "replies": [{"body": "[Tweet from @teslashanghai](https://twitter.com/teslashanghai/status/1644001622069235712): Wonderful things will happening in GIGA Shanghai this weekend。$tsla", "score": 1, "replies": []}]}, {"body": "Any fan of [Answers with Joe?](https://i.imgur.com/NwR37BL.jpg)", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "His YT channel is fire.  Generalist in topic but heavier on science and engineer.  And he’s Tesla fanboi deep down.", "score": 3, "replies": []}]}, {"body": "I watch some of his vids", "score": 2, "replies": []}]}, {"body": "I’ve been experiencing supranormal levels of weetardation recently. My account is almost fixed from the great dip of 22-23 and I think Ima have to go a lil spendy spendy 💰", "score": 3, "replies": []}, {"body": " https://twitter.com/FirstSquawk/status/1644077467727015937?s=20", "score": 3, "replies": [{"body": "[Tweet from @FirstSquawk](https://twitter.com/FirstSquawk/status/1644077467727015937): TESLA INC - BOARD RECOMMENDS A VOTE FOR THE TESLA PROPOSAL FOR THE ELECTION OF ELON MUSK, ROBYN DENHOLM AND JB STRAUBELTESLA INC SAYS ELON MUSK’S 2022 ANNUAL TOTAL COMPENSATION WAS $0TESLA INC - BOARD RECOMMENDS A VOTE FOR THE TESLA PROPOSAL FOR A NON-BINDING ADVISORY VOTE… https://t.co/htzQtQPboN", "score": 2, "replies": []}]}, {"body": "weekend thread is up btw \n\nget outa here!", "score": 3, "replies": []}, {"body": "[https://external-preview.redd.it/2YmepV9saIQNcmMfY365JjQZ6LvXLptghwa39Uxt60Q.jpg?auto=webp&v=enabled&s=d1474e31ca737a5b15c9109faa08a8030e830fa2](https://external-preview.redd.it/2YmepV9saIQNcmMfY365JjQZ6LvXLptghwa39Uxt60Q.jpg?auto=webp&v=enabled&s=d1474e31ca737a5b15c9109faa08a8030e830fa2)\n\n&#x200B;\n\nCT to have 100 kwh?\n\nsource: Master plan 3 , posted in CT subreddit [https://www.reddit.com/r/cybertruck/comments/12d3ju3/cybertruck\\_to\\_have\\_100kwh\\_pack\\_made\\_from\\_nickel/](https://www.reddit.com/r/cybertruck/comments/12d3ju3/cybertruck_to_have_100kwh_pack_made_from_nickel/)", "score": 5, "replies": [{"body": "S+X got grouped together with CT on that.\n\nWithout reading much further or looking at it any more closely b/c I'm not really that worried about it, I wonder if they plan to put two 100 kWh packs in each CT.", "score": 3, "replies": []}, {"body": "That is a Tesla expected average for the category, not what Tesla will do\n\nWhile a version with 100 kWh pack and 250 mi range is possible, doesn’t mean that’s the only one they will do\n\nFor example, Model 3/Y packs are listed at smaller size than what Tesla offer and in LFP, which doesn’t exist with current LFP pack, as in, you can’t fit a 75 kWh LFP pack in a Model 3/Y", "score": 2, "replies": []}, {"body": "Yah range on CT isn't gonna be 500 miles,  more like 300 advertised, 250 real world 100% to 0%, 200 real world 80% to 20%. God help you if you tow uphill in winter. Anyone who thinks otherwise is hopium and I have a $39k cybertruck to sell u", "score": -1, "replies": [{"body": "In the recent Franz interview he seems to indicate there will be a higher mileage variant\n\nedit: you can listen here at \\~1:27:50 - [https://youtu.be/tY37muDxFRI](https://youtu.be/tY37muDxFRI)\n\n\"even on the range side we're going to be in a good position\"", "score": 5, "replies": [{"body": "Yeah it's too early to worry about limited CT mileage when production hasn't even started yet.    Very possible they're just keeping their cards close to the chest right now.", "score": 6, "replies": []}]}, {"body": "With tri motor - it’s going to be more like 270 miles on 0 to 100.\n\nHowever, I like tesla strategy. Initial couple years are anyway going to be fanboys like us who are going to buy it and we are not going to complain on range much and are used to super charging. As Battery density increases, they can increase range for gas truck plebs to convert to EVs.", "score": 3, "replies": []}, {"body": "Cybertruck range gonna be thick. Solid. Tight.", "score": 2, "replies": [{"body": "With 4680s in short supply they'll opt to make more short range ones vs fewer long range ones", "score": 3, "replies": [{"body": "My source tells me they are really behind schedule on Cybertruck pack production. “Only have 200.” This was a week or so ago.", "score": 4, "replies": []}]}]}]}]}, {"body": "Happy Easter-eve\n\nI've already eaten all the chocolate I bought", "score": 6, "replies": [{"body": "This is the way", "score": 3, "replies": []}, {"body": "I bought quite expensive egg from a local place that I have mixed feeling, because it’s so good, but also hurts my pocket", "score": 1, "replies": []}]}, {"body": "so no robotaxis on the master plan? good, that woulda been -5%", "score": 5, "replies": [{"body": "They mention autonomy", "score": 2, "replies": [{"body": "what did they say about it", "score": 1, "replies": [{"body": "Page 22 - \"Autonomy has potential to reduce the global fleet, and annual production required, through improved vehicle utilization.\"", "score": 2, "replies": [{"body": "good, they mentioned it once only, nothing boomer investors hate more than robotaxi talk cept maybe bot talk.", "score": 0, "replies": []}]}]}]}]}, {"body": "Rob says price cuts very likely imminent in europe cuz of cuck ass europoors. Fuck those guys.", "score": 8, "replies": [{"body": "gonna cut in USA too, watch after 1/2 the tech work force needs to start working for a living", "score": 6, "replies": [{"body": "Deeeep cuts coming for 3 s and x. Biden got our backs on the y.", "score": 8, "replies": [{"body": "True Y is a done deal as is.", "score": 5, "replies": []}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "I wish our portfolios didn't have to die, but I'm rather enjoying community notes.", "score": 3, "replies": []}, {"body": "Twitter is known to suck, we’re all perma-sad that Elon took us on this ride", "score": 1, "replies": []}]}, {"body": "Model Y best selling car in UK in March https://driveteslacanada.ca/news/tesla-model-y-was-the-best-selling-car-in-the-uk-in-march/", "score": 3, "replies": [{"body": "A cheap Tesla would completely dominate the car market here. Giga Mexico can't come quickly enough.\n\nI'm certain it will look better than the majority of these too! [https://www.lookers.co.uk/electric/new-cars](https://www.lookers.co.uk/electric/new-cars)", "score": 5, "replies": [{"body": "Yeah I’m seeing so many Ys and 3s these days. A cheap version would absolutely smash the competition", "score": 5, "replies": []}]}, {"body": "Bad qoq numbers for tesla and evs despite car market growing in UK. Hypothesis is sky high electricity costs fucking us.", "score": 3, "replies": []}]}, {"body": "sour hour commence! no one wanna hold shit over a long weekend when the tesla logo could be swapped out for a dog jpg at any moment.", "score": 5, "replies": []}, {"body": "GS says jobs in shambles", "score": 2, "replies": [{"body": "https://twitter.com/deitaone/status/1643954369795072005?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\n👍", "score": 5, "replies": [{"body": "[Tweet from @deitaone](https://twitter.com/deitaone/status/1643954369795072005): U.S INITIAL JOBLESS CLAIMS ACTUAL:  228K VS 198K PREVIOUS; EST 200KU.S CONTINUING JOBLESS CLAIMS ACTUAL:  1823K VS 1689K PREVIOUS; EST 1700K", "score": 4, "replies": [{"body": "Casual >10% miss.\n\n24h MeetKevin emergency livestream incoming.", "score": 6, "replies": []}]}, {"body": "Bad news is bad news again.", "score": 3, "replies": [{"body": "Low jobs but higher wages indicates sticky Inflation.", "score": 2, "replies": []}]}]}, {"body": "1 week Mr. Powell.", "score": 2, "replies": []}]}, {"body": "PM real & straight.", "score": 2, "replies": [{"body": "Real scary and straight down?", "score": 2, "replies": []}]}, {"body": "I knew we couldn’t hold the $200. Last time we tried we dropped fast back down as well.", "score": 2, "replies": []}, {"body": "Shite", "score": 2, "replies": []}, {"body": "Don’t jinx it", "score": 2, "replies": [{"body": "👍🏻🚀", "score": 3, "replies": []}, {"body": "![gif](giphy|X8ojOmRQEp2IjWXDjQ)", "score": 2, "replies": []}]}, {"body": "🤮🟢", "score": 2, "replies": []}, {"body": "I started buying GOOG for the first time this year. All this talk about Microsoft taking down Google search is so stupid.", "score": 2, "replies": [{"body": "Good idea, two diff businesses", "score": 1, "replies": [{"body": "Yup. ChatGPT will eventually go private too. Not many realize that Microsoft will push it into 365", "score": 2, "replies": [{"body": "Yah not sustainable to use ai for all search when revenue from a click is so tiny.", "score": 1, "replies": []}, {"body": "Yup, 'Copilot' being added to Word, Excel...  Bing Chat already in Edge browser.\n\nThink the theory isn't that Bing/Bing Chat will crush google search, but Google releasing their own version will get used more than search  over time (and inserting ads won't be well tolerated).", "score": 1, "replies": []}]}]}]}, {"body": "https://twitter.com/teslashanghai/status/1644031377732702208?t=Ou22zFhnGMQ2PN20Uh5dgg&s=19", "score": 2, "replies": [{"body": "Da fuck does “come and new” mean?", "score": 5, "replies": [{"body": "means we rich again boys!!", "score": 3, "replies": [{"body": "Buying puts anytime you seem slightly bullish. \n\n🤣", "score": 3, "replies": [{"body": "but am i being sarcastic", "score": 1, "replies": []}]}]}]}, {"body": "[Tweet from @teslashanghai](https://twitter.com/teslashanghai/status/1644031377732702208): come and new～", "score": 2, "replies": [{"body": "Holy fook", "score": 3, "replies": [{"body": "Finally some actual rumor that’s good 🤔", "score": 2, "replies": []}]}]}]}, {"body": "Can we haz up day please thanks", "score": 2, "replies": []}, {"body": "we we thinking 50,000 semis in 2024 or more like 500 semis 2024.", "score": 2, "replies": [{"body": "I think Texas will be doing ~500. Question is how fast they can build and ramp Nevada. Personally would be surprised if they do more than 20K in 2024. Expect more like 10K with the 50K happening in 2025.", "score": 3, "replies": [{"body": "ill be extremely impressed with 5000 in 2024.", "score": 1, "replies": [{"body": "I'd say extremely impressed with 10,000, but 5,000 would already be great. All depending on when Nevada will be online though.", "score": 1, "replies": []}]}]}, {"body": "IMO they're being slow about it because it's Just not a good use of batteries with current ramp. Once CT starts eating into backlog and lathrop hits ramp they'll start focusing it.", "score": 3, "replies": [{"body": "that was always the plan, the 50k was a pump and dump", "score": 2, "replies": [{"body": "Just classic aspirational goal. If they end the year around 12k run rate I'll be impressed.", "score": 2, "replies": []}]}]}, {"body": "5000", "score": 2, "replies": []}, {"body": "We need a semi factory… pretty sure we don’t have that yet but Elon swears we will hit 10,000 this year… 🤣", "score": 2, "replies": []}]}, {"body": "I see a big potential becoming a copy pasta tesla influencer in Turkey", "score": 2, "replies": [{"body": "Erdogan Pathhole", "score": 3, "replies": [{"body": "i read this aloud and now my coffee table is floating", "score": 1, "replies": []}]}]}, {"body": "Yikes 💀", "score": 2, "replies": []}, {"body": "The market is now closed! -0.33x beta today.\n\n| Name | Stock Price | Change Today | Today's Range | Volume |\n|:-:|:-:|:-:|:-:|:-:|\n| Tesla, Inc. | $185.06 | $-0.46 (-0.25%) ▼ | $179.74 - $186.39 | 121,624,395 |\n| NASDAQ Composite | $12,087.96 | $91.09 (0.76%) ▲ | $11,898.36 - $12,098.50 | 3,070,735,000 |\n\n[Support TSLA_Bot](https://ko-fi.com/markcreator)", "score": 2, "replies": []}, {"body": "Macro 🚀 tsla 💩", "score": 2, "replies": []}, {"body": "-0.33x beta on a tiny tiny red day really isn't bad.    Basically both were flat", "score": 2, "replies": []}, {"body": "Woo hoo!!! 🚀🚀🚀🚀🚀", "score": 4, "replies": []}, {"body": "people are going to die, final destination style, from the reflection off this thing\n\nhttps://imgur.com/gallery/gENEFaJ\n\non the bright side, it will trigger an avalance of training data for edge cases", "score": 3, "replies": [{"body": "not really, it has a matte finish and none of the angles point directly to the sides even if it was that reflective", "score": 5, "replies": []}, {"body": "CT gonna make panties drop. That's a 6-figure machine through ramp.", "score": 2, "replies": []}]}, {"body": "Cryptic tweet from Tesla Shanghai Analyst 🤔\n\nhttps://twitter.com/teslashanghai/status/1644001622069235712?s=46&t=yWmMeP08cyApbkkhK1zkcw", "score": 3, "replies": [{"body": "Please be production of small model y", "score": 7, "replies": [{"body": "Do they even have production lines up for a small model y? Announcing anything now would not be good for sales.", "score": 3, "replies": [{"body": "Exactly they gotta surprise us w production, drop the hammer", "score": 5, "replies": []}]}]}, {"body": "Maye Musk is currently in Shanghai, so there's a chance something may be happening", "score": 4, "replies": [{"body": "Something Maye be happening", "score": 12, "replies": []}]}, {"body": "[Tweet from @teslashanghai](https://twitter.com/teslashanghai/status/1644001622069235712): Wonderful things will happening in GIGA Shanghai this weekend。$tsla", "score": 5, "replies": []}, {"body": "We know.\n\n...they'll be making cars there.", "score": 4, "replies": []}]}, {"body": "Good morning and welcome to the TSLA Lounge. The time is 08:47 AM.\n\nThis automated system is in beta and is currently at version 0.75.\n\nCurrent topside temperature is 49.2 degrees, with current conditions: Heavy rain.\n\nTSLA Lounge is maintained at a pleasant 69 degrees at all times.\n\n \n\n \n\nLounge Members: 492 with 9 potential new members.\n\nWelcome potential new members: /u/TheRealWalrus0069.\n\n\n\nYesterday's Lounge Sentiment was: 7.0 [agitated]\n\n \n\n \n\nConservatively, TSLA should be trading at: $262 ($80 discount)\n\n\n\n Trailing PE: 53 - Forward PE: 33 - Average Analyst Rating: 2.4 - Buy\n\n The max pain for TSLA on April 6th, 2023 is $195spa.\n\nMarket Cap: 595 B. 200 day MA: $215. 50 day MA: $191", "score": 3, "replies": [{"body": "![gif](giphy|1ExNcuKh26PwA)", "score": 1, "replies": []}]}, {"body": "Down everyday.  Wtf", "score": 4, "replies": [{"body": "![gif](giphy|gHFi5N6uU3TLq)", "score": 4, "replies": [{"body": "Your OK with the stock going down for 2 years?", "score": 2, "replies": [{"body": "If I told you it took the nasdaq like 15 years to go green after 2000 would you still think 2 years is a long time in investing?", "score": 3, "replies": []}, {"body": "Been in since 2015, I’m fine if we go down for 5 years. My money is on the potential, not on the today.", "score": 2, "replies": [{"body": "Nate: \n\n![gif](giphy|vO8F4fYQd39h6)", "score": 2, "replies": [{"body": "hahahaha i guess we are both spoiled brats :)", "score": 2, "replies": []}]}]}, {"body": "Nateleb will be 60 and a shriveled old man when it is 2040 where we reach 2 tril market cap", "score": 1, "replies": []}]}]}, {"body": "Why are we red though?", "score": 2, "replies": []}, {"body": "I prefer this alt tbh", "score": 2, "replies": []}]}, {"body": "More like masturbation plan part 3 \n\n💦", "score": 2, "replies": []}, {"body": "Sooo… does power wall auto bid in Cali yet", "score": 2, "replies": []}, {"body": "Didn’t expect we be near green or touch green with PM and opening drop. Maybe be a good start to the weekend 🙏🏼", "score": 2, "replies": []}, {"body": "Fucked", "score": 2, "replies": []}, {"body": "Still no V11 and this price action. Ugh. This week is the worst!!", "score": 3, "replies": [{"body": "I got it a couple days ago and it’s awesome. It actually saved me from a possible accident this morning. \nMy bug report went like this “I was wrong to try and take over, the car was right in avoiding that car.”", "score": 4, "replies": []}, {"body": "Are you on a 2023 software build?", "score": 1, "replies": [{"body": "Nope.. 2022 69 build still", "score": 2, "replies": [{"body": "Weird. You can open a ticket and have Tesla manually push it to you again. At least, I know they can manually attempt a new push on regular builds. Might be worth a shot as you should have it by now.", "score": 3, "replies": [{"body": "Maybe worth doing. Should I also do a reinstall from the service mode myself before that?", "score": 3, "replies": [{"body": "I’d probably avoid that as it’s not recommended by Tesla and anything that you do using that menu is unfortunately at your own risk and not guaranteed by Tesla. Last thing you want is to unintentionally brick your car and make things worse.", "score": 1, "replies": [{"body": "Thanks!", "score": 2, "replies": []}, {"body": "Just tried doing it and apparently they analyze the text of the service now. It auto-detected that I am requesting a s/w upgrade and won't let me schedule service stating i have the latest version. Ugh. I have the OG 2018 model 3. Service has changed so much in 5 years!!", "score": 1, "replies": [{"body": "Ah dang.  Fingers crossed you get it pushed with the next wave.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Damn futures still red, how many straight red days do we need c’mon", "score": 2, "replies": []}, {"body": "Combination of \"investor\" day and just barely meeting delivery targets has taken the wind out of the sails. Its a waiting game till earnings. Hoping we smash the GM forecasts and reclaim 200.", "score": 2, "replies": [{"body": "Investors day was amazing, way more than I was expecting, don’t know what you guys are talking about", "score": 8, "replies": [{"body": "Perception. Lay people didn’t have the patience to stick with 3 hours of sometimes dry, yet substantive presentations. You’re right though, it was amazing and incredibly detail-dense. Most mouth breathers have the attention span of a gnat though.", "score": 2, "replies": []}]}, {"body": "They had a lot of inventory from q4 and couldn't match production with deliveries despite inflation reduction act and chunky price cuts. Now tons of cars available from inventory even model y in the usa, and lets not get started on the s and x. We and the market are both disappointed and rightly so. Even rob is gently preparing everyone for more price cuts. Tesla can trot out the unwinding the wave excuse but that's only going to work for so long. Bottom line is inadequate demand at current prices.", "score": 3, "replies": [{"body": "True, q2 will be very important. Q1 had the price cut and IRA boost, so there is a chance sales will dip in q2 without further cuts. Hope China will recover to compensate. Elon has also been vocal about being willing to compromise on margins if needed. If margins drop more, then Tesla will all the more be viewed as just a car company.", "score": 1, "replies": []}]}]}, {"body": "Had a disturbing thought about Twitter.\n\nElon is Dictator of Twitter.  Of the 46.5 Billion used for the acquisition (44 Billion cost + transaction fees), 13 Billion was from loans to Twitter itself, 7.1 Billion from outside investors, and 26.4 Billion from Elon.  \n\nSo although Elon has outside shareholders, he has so much voting power from equity that the other shareholders are legally powerless.  \n\nElon has access to Twitter users' histories on the platform, any alt/anonymous accounts they use for activity they might not want public, and perhaps DMs between Twitter users.  Personal information in terms of phone numbers, addresses, and payment cards might also be easy for him to obtain. \n\nThis potentially gives Elon a massive trove of information to use against people he doesn't like or people who oppose him in some way.  And there are effectively no checks against him weaponizing such information.\n\nOvert use of such info might drive people off Twitter, but one could leak information, or make quiet threats through intermediaries.  \n\nElon isn't one to play by the rules.  Nobody should assume that their Twitter content is safe", "score": 0, "replies": [{"body": "![gif](giphy|LVJp7KDLg1jr6NdL7O)", "score": 2, "replies": []}, {"body": "Twitter was sus before Elon.  There are dissidents tortured/jailed by Saudis because they paid off a Twitter employee to leak their personal details so they could find and arrest them.  https://www.google.com/search?q=twitter+employee+saudi+spy\n\nNow the bonesaw crew are investors in the new Twitter.\n\nIf he starts to abuse personal information like that the FTC will come after him... they already had Twitter in their sights long before he made the takeover attempt (something due diligence might have raised some alarm bells about).  Twitter was already operating an FTC consent decree, and Elon fired everyone there helping them to avoid the $5B in FTC fines that Facebook got hit with.  The good news is that FTC and EU fines will probably take years to come through so he won't need to dump TSLA for that until 2025+", "score": 3, "replies": []}, {"body": "My main concern is the piece of shit platform never becomes cash flow positive and requires repeated regular infusions of tsla shares so Elon can avoid the shame of failure.", "score": 1, "replies": [{"body": "Based on everything I have learned about Elon over the past 15 years, I do not believe he fears failure or would feel shame from it.  His recent outrageous behavior on Twitter suggests that he doesn't feel shame about anything whatsoever. \n\nI recall that Elon said he thought Tesla and SpaceX both had 90% chance of failing. \n\nI'm not overly concerned about Twitter's business.  We know that Elon is ruthless about general efficiency and slashing business overhead.  With more than 70% of employees eliminated, Twitter as a platform is still operating well as far as I can tell.  It actually seems better than it was a year ago.  This doesn't mean Twitter can't fail financially.  I just see the odds as low. \n\nI am far more concerned with the fact that Elon has total control over an information arsenal, and there is no one to check him. \n\nAdditionally, even if Elon did overtly weaponize that information, most people on the Internet don't truly value their privacy.  They'd carry on not caring (Facebook still actively used despite years of scandals, people willingly hand over all their information to Chinese TikTok, etc.)... unless and until they're the ones in the crosshairs", "score": 4, "replies": []}]}, {"body": "transport, energy, communication, finance (plan with twitter). He sure has alot of control. My guess is wait for optimus to function well (with machine guns and ai,) and then transition the world to clean energy one way or another. All part of the mission. I also read he thinks his genes are superior and belongs to some weird informal Silicon Valley deal where they have to repopulate with the smart kids when climate change makes everyone else eat each other. It all actually fits. Seems like he loathes the peasants. Why else would he try to build dumbass tunnels that can only hold a car at a time instead of a train. It’s cause trains smell like poor", "score": -1, "replies": [{"body": "All of his products are dramatically deflationary and improve quality of life for “peasants”. He’s motivated to help the little guy. If money was only motivation for him, he wouldn’t have slogged 20 years to build Tesla and other companies.", "score": 8, "replies": []}]}, {"body": "![gif](giphy|3orieKZ9ax8nsJnSs8)", "score": 0, "replies": []}]}, {"body": "More Catholic pedos... \n\nshit never ends....", "score": 1, "replies": [{"body": "Why are you being redundant?", "score": 3, "replies": []}]}, {"body": "I had the worst drive to work ever - literally, in my entire life. \n\nLeave home just after 6am. It's 13 miles about 20-25 minutes usually. Saw a few cops detoured around something through a neighborhood that was barely a  2 lane road and then I see some red flashing lights and people trying to squeeze between mailboxes and driveways with cars. Ambulance driving down the center of this small road. Never saw anything major justifying such a slowdown. Got to work around 7:45am about 45 minutes late 13 miles in an hour and a half....", "score": 1, "replies": [{"body": "The craziest thing is that you start work at 7am", "score": 2, "replies": [{"body": "7:00am - 3:30pm", "score": 1, "replies": []}]}]}, {"body": "Shit beta", "score": 1, "replies": []}, {"body": "Goog tho", "score": 1, "replies": [{"body": "hodl and never sodl", "score": 1, "replies": []}]}, {"body": "so share buy backs or not", "score": 1, "replies": [{"body": "I'd vote against this until FSD is taxing people around.", "score": 6, "replies": []}, {"body": "2 years of the stock declining.  It doesn't seem like they care about shareholders", "score": 2, "replies": [{"body": "![gif](giphy|KZSUN7FKBZrm2WHDdX|downsized)", "score": 2, "replies": []}]}, {"body": "Margins too low", "score": 2, "replies": []}]}, {"body": "We used to have multi week green streaks. Since Musk et al stock selling and TWTR shenanigans, stock in shambles with multi day red streak. Entire week in red after record quarter delivery says a lot.", "score": -5, "replies": [{"body": ":(", "score": 4, "replies": []}]}, {"body": "Let’s just take this to 5 dollars so I can go all in.", "score": -3, "replies": []}, {"body": "New day, same shit", "score": -7, "replies": [{"body": "Sell", "score": 8, "replies": [{"body": "I am long term bullish but Giraffes is correct: This constant red shit is annoying.", "score": 3, "replies": [{"body": "Extremely, but that isn’t a good reason to constantly and exclusively complain.", "score": 1, "replies": []}]}]}, {"body": "🍼", "score": 6, "replies": []}, {"body": "If you're actually this emotional about price movements then you might have too much invested in one company/high beta/volatile stock.\n\nThe way to decrease your stress is to diversify or to decrease the risk involved to the downside, which is why I sell CC. It's definitely not for everyone and has its own inherent risks, but helps decrease exposure/delta for better or for worse while benefitting from time decay.", "score": 2, "replies": []}]}, {"body": "Elon’s unlimited demand playing out perfectly", "score": -12, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "+1, look at this dude's comment history. Hasn't left a single substantiated or informative comment so far. Just trolling.", "score": 12, "replies": []}, {"body": "It’s just glib man. Relax.", "score": 7, "replies": []}, {"body": "I think some people get extra screwed by Elon and should be allowed to vent here for a while", "score": 2, "replies": [{"body": "That account has gone from venting to insulting people.  Throw them out.  \n\nAs far back as I can remember, the quality of comments from that account has been worthless", "score": 7, "replies": []}, {"body": "Nobody gets screwed by Elon. They screw themselves by gambling their money on a volatile stock instead of investing it for the long term and taking a pretty much guaranteed return much higher than the S&P's. If you refuse to wear a seatbelt and someone else drives into you, it's still your own fault if you get hurt.", "score": 2, "replies": [{"body": "Of course of course, I think the ban should be used almost never though", "score": 2, "replies": [{"body": "I agree, but then I also think we should be private specifically to keep these kinds of trolls out. If you're not private, banning trolls like this might be a necessity to keep the forum clean.", "score": 2, "replies": [{"body": "True, I think a Snoo’s been here awhile though", "score": 1, "replies": []}]}, {"body": "r/PLTR is a sub that currently does not ban anyone, because it is effectively unmoderated.\n\nThe sub has a lot of bad actors now.  It's not an enjoyable place, nor is it a good source of information, because many good contributors got fed up and decided to leave.  \n\nIf bad-faith participants face no consequences, they will eventually destroy a community", "score": 2, "replies": [{"body": "Here's a sneak peek of /r/PLTR using the [top posts](https://np.reddit.com/r/PLTR/top/?sort=top&t=all) of all time!\n\n\\#1: [Earnings are ahead of us, fellow shareholders . Upvote this picture of PLTR's founders-Alex Karp and Peter Thiel so tendies may come upon us.](https://i.redd.it/vt8984zf1sg71.jpg) | [75 comments](https://np.reddit.com/r/PLTR/comments/p2jqd1/earnings_are_ahead_of_us_fellow_shareholders/)  \n\\#2: [Under $20, this is now a LOTR sub](https://i.redd.it/5ssq0tjyoix61.jpg) | [163 comments](https://np.reddit.com/r/PLTR/comments/n69pcc/under_20_this_is_now_a_lotr_sub/)  \n\\#3: [PLTR $27 UPVOTE PARTY](https://np.reddit.com/r/PLTR/comments/poswqe/pltr_27_upvote_party/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)", "score": 1, "replies": []}]}]}]}]}, {"body": "Dude get out of your fragile bubble. Just because I say stuff you don’t like, doesn’t mean you ban me. I’m not saying anything wrong", "score": -12, "replies": [{"body": "sell", "score": 9, "replies": []}]}]}]}, {"body": "🐴💩", "score": -4, "replies": [{"body": "Sell", "score": 6, "replies": [{"body": "You commenting “sell” on everyone of my post does not make me change my mind or do anything differently..just FYI.", "score": -3, "replies": [{"body": "Sell", "score": 5, "replies": []}]}]}]}, {"body": "All companies that announce layoffs and cost cutting are sky rocketing. Maybe tsla should do that. Oh wait if they did, it’ll be instant limit down -10% day", "score": -12, "replies": [{"body": "We're the only ones hiring. That should really be a signal to everyone...", "score": 9, "replies": [{"body": "But is it really though? All I see on MSM is how Tesla’s market share is going down rapidly and over promises and under delivery. I mean pipeline for new products is pretty dry cuz they had to tease announce a fucking lockbox for 3 days", "score": -7, "replies": [{"body": "Yes tesla going broke just sell your fucking shares and get over it", "score": 10, "replies": []}]}]}, {"body": "high PE overhang", "score": 1, "replies": []}, {"body": "> Maybe tsla should do that.\n\nAlready done in 2022 and 2023.", "score": 1, "replies": []}]}, {"body": "premarket f&g so say we all", "score": -2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "this might not go well for chipotle\n\nthey probably can’t trademark the name of a type of pepper", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "they probably know it has no merit, could just be about crushing competition via litigation", "score": 3, "replies": []}]}]}]}, {"body": "https://youtu.be/F9q7j1xA9WQ\n\nInside tour of Giga Berlin, great stuff.\n\nIt's in German though.", "score": 1, "replies": []}, {"body": "Cucked", "score": 1, "replies": []}, {"body": "https://twitter.com/spacex/status/1644044484026716160?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\nOh no, Starship got Grayscale on its nose.", "score": 1, "replies": [{"body": "[Tweet from @spacex](https://twitter.com/spacex/status/1644044484026716160): Starship fully stacked at Starbase. Team is working towards a launch rehearsal next week followed by Starship’s first integrated flight test ~week later pending regulatory approval https://t.co/9VbJLppswp", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}]}
