{"title": "Should I sell NVDA at a loss and then immediately buy back and then sell at a loss again?", "selftext": "Looking for everyone to take random guesses ", "id": "1evf2o8", "created_utc": 1724002843.0, "score": 154, "upvote_ratio": 0.84, "num_comments": 88, "comments": [{"body": "Sell for loss. Buy short term put options at $10 strike. Hold until you lose it all.", "score": 61, "replies": [{"body": "This is it", "score": 11, "replies": []}, {"body": "Finally, some real advice", "score": 7, "replies": []}, {"body": "This is the way, the notion. The ideology.", "score": 3, "replies": []}, {"body": "This only works whilst eating green crayons 🖍️", "score": 5, "replies": []}, {"body": "This is the way", "score": 2, "replies": []}]}, {"body": "Please sell, because then it will go up and I’ll make money", "score": 23, "replies": []}, {"body": "Research the wash rules", "score": 16, "replies": [{"body": "This is a troll post >.>", "score": 3, "replies": []}, {"body": "Absolutely not.", "score": -7, "replies": [{"body": "I've got enough loss built up that I'll be able to collect that sweet $3000 per year tax break until I'm 82.", "score": 14, "replies": [{"body": "🤣🤣🤣", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, that single year.\n\nThis happened like 3 years ago.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">You can offset unlimited capital gains within any single year with capital losses. Once the year is done the only option is $3k per year until that amount is expended.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "This is where you started\n\n>You can offset $3k in ordinary income per year with carried over capital losses. You can offset unlimited capital gains in any (FUTURE) year with carried over losses.\n\n\n\n[Prove It](https://imgur.com/gallery/h6fVInA)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": ">Net capital losses in excess of $3,000 can be carried forward indefinitely until the amount is exhausted.\n\n>Note it states “net capital losses”\n\nRather than making a statement that I'm wrong maybe make a attempt to explain how I'm wrong?\n\nI'll kick in $100 to your PayPal if you wade through all those pages and find that sweet nugget you imagine is there...\n\nEdit - Offer for $100 only valid if you manage to find something outside of the scope already discussed. \n\nIf you lose $100k in one year and don't use that loss to offset gains within that year you can carry that capital loss forward until it's expended at $3k per year. 100 / 3 = 33 years with $330 left for the 34th. This deduction is only against earned income not capital gains.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "82.5 for me.", "score": 1, "replies": []}, {"body": "Oh I know this tax credit well", "score": 1, "replies": []}]}]}]}, {"body": "Wait until Tuesday. Sell and rebuy on thursday/Friday.\n\nI had a dream and that's what I am doing.\n\nThis is not financial advice", "score": 8, "replies": []}, {"body": "Sounds like a solid plan, followed by many here.", "score": 7, "replies": []}, {"body": "Yes, do it, you'll lose more money and faster by doing so. :)", "score": 6, "replies": []}, {"body": "U should short it. And when stock rises +20%. Close position and go long. Then let it drop -20% then close. Keep doing this until u see the number 0", "score": 5, "replies": []}, {"body": "Yes. I’d take it a step further and buy and sell for a third time, at a loss of course.", "score": 4, "replies": [{"body": "How can we be sure the third time will be at a loss?", "score": -4, "replies": [{"body": "Only way to combat this is to do it a 4th time. It’ll minimize the margin of error.", "score": 2, "replies": []}]}]}, {"body": "Yes this is the way", "score": 2, "replies": []}, {"body": "Sell for a loss, then buy it at the top. Then panic sell on a (5%) day then watch it rally 15% for the next 3 months. Then you buy back in and repeat the process until you’re out of money", "score": 2, "replies": []}, {"body": "Yes sounds like a good plan", "score": 1, "replies": []}, {"body": "i would hold it for probably 2 years.. after that the growth will slow to a normal amount", "score": 1, "replies": []}, {"body": "Yes the more wash sales the better", "score": 1, "replies": []}, {"body": "You need Leverage .\n  Load up and buy OTM Puts ,\n   \nThen Load up sell  Naked ATM calls !!\nThat should fix the problem ! Lol", "score": 1, "replies": []}, {"body": "You need Leverage .\n  Load up and buy OTM Puts ,\n   \nThen Load up sell  Naked ATM calls !!\nThat should fix the problem ! Lol", "score": 1, "replies": []}, {"body": "You got it. Buy high. Sell low. Buy in more. Sell even lower. This is the way", "score": 1, "replies": []}, {"body": "🤣🤣🙌🏼", "score": 1, "replies": []}, {"body": "Do it on margin🔥", "score": 1, "replies": []}, {"body": "Why would you keep selling at loss? Mad?", "score": 1, "replies": [{"body": "This ONE TRICK will make you broke", "score": 1, "replies": [{"body": "Why", "score": 1, "replies": [{"body": "I mean him, he has this ONE Trick to make him broke", "score": 2, "replies": [{"body": "True that", "score": 1, "replies": []}]}]}]}]}, {"body": "Wash rule", "score": 1, "replies": []}, {"body": "It's a complex situation. The complex part is that you have to usually have a 30 day window of selling and buying and then selling again for tax purposes. Meaning, you can't just swap shares and take the loss. It's called a wash sale. I think you have to be a day trader to try and gain that capability. I don't really know but it's something like that. \n\nAlso, I don't know what you mean by buy back and then sell at a loss again. lol wtf are you doing.", "score": 1, "replies": []}, {"body": "No. Save time and just venmo me your money.", "score": 1, "replies": []}, {"body": "Good idea", "score": 1, "replies": []}, {"body": "Wendy’s!!", "score": 1, "replies": []}, {"body": "What a freaking nonsense is this", "score": 1, "replies": []}, {"body": "This sounds like a viable strategy for losing! I like it. 🔥", "score": 1, "replies": []}, {"body": "since regards are thinking to sell it means perfect time for me to hold... was looking for these kind of posts and seeing them more pop up since past two weeks makes me think my estimates for hitting 150 before earnings day are not out of whack but reasonable... looking for 140 by end of week so please sell when casino opens tomorrow at 9.30 am sharp. I was telling regards to sell before the major crash about two three weeks before that it will will hit 115 and lower and regards were bashing me... now when I am saying 150 before earnings they are bashing me so I am happy as that is what I look for to consolidate me and my thinking", "score": 1, "replies": [{"body": "You're just guessing like everyone else that I'm making fun of", "score": 0, "replies": []}]}, {"body": "I should know, I'm an expert at this point", "score": 1, "replies": []}, {"body": "How long have you had this position?", "score": 1, "replies": []}, {"body": "Yes keep selling for a loss", "score": 1, "replies": []}, {"body": "This is the way", "score": 1, "replies": []}, {"body": "Buy baskin robins! They have 31 flavors", "score": 1, "replies": []}, {"body": "Excellent plan!  Don't forget to screenshot your loss-porn and post to wallstreetbets 😳🤣", "score": 1, "replies": []}, {"body": "I say keep nvda", "score": 1, "replies": []}, {"body": "Tax rules require 30 day time between sales and repurchase. Called the wash rule. You can buy  more now and sell the first lot at a loss after 30 day limit.", "score": 1, "replies": [{"body": "I decline", "score": 1, "replies": []}]}, {"body": "🤦 🤦", "score": 1, "replies": []}, {"body": "Fuck it, sell everything and make some chicken parm.", "score": 1, "replies": []}, {"body": "What does Cramer say?", "score": 1, "replies": []}, {"body": "This is the way", "score": 1, "replies": []}, {"body": "No. Thats called a wash loss sale. You cannot deduct the losses if you buy back within 30 days (or 30days before)", "score": 1, "replies": []}, {"body": "Just HOLD baby, check back in 3 weeks", "score": 1, "replies": []}, {"body": "Dont buy if you don’t believe.", "score": 1, "replies": []}, {"body": "Buy high and sell the dip", "score": 1, "replies": []}, {"body": "By RKLB in pre market and sell end of day at -6%; then by NVDA and sell in two months at -10%", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "When in doubt, Zoom in", "score": 1, "replies": []}, {"body": "Just keep selling for less than you payed and you’ll work forever!", "score": 1, "replies": []}, {"body": "🤣🤣", "score": 1, "replies": []}, {"body": "For tax reasons?", "score": 1, "replies": []}, {"body": "Absolutely instead of DCA, why not DCL it? Dollar cascading loss harvesting is an ingenious tactic, too bad only a few people know about it", "score": 1, "replies": []}, {"body": "I suggest you stop overthinking this. One either has faith in this company and this stock or they don't. One must take emotions out of the equation.  Research, do your due diligence and make a logical decision.  Look at the history, consider what their products are.  I use Market Chameleon, there is a lot of good info on this app.  Check NVDA history and what comments on the stock from seasoned individuals. I would not necessarily put my money on advice I received from Reddit, unless it is mine of course.  LOL\n\n[Nvidia Stock (NASDAQ:NVDA): The AI Boom Isn’t Over Yet](https://www.tipranks.com/news/article/nvidia-stock-nasdaqnvda-the-ai-boom-isnt-over-yet?utm_source=marketchameleon.com&utm_medium=referral)\n\nTipRanks (Fri, 16-Aug 1:33 PM ET)\n\nThis is from Market Chameleon. There are lots of news feeds and press releases to read.  Just check the dates.", "score": 1, "replies": [{"body": "Don't work yourself into a shoot brother", "score": -5, "replies": [{"body": "I'm a sister not a bro.  Thanks for your input.  Now we all know the problem. You asked, I felt obliged to answer. 😊", "score": 1, "replies": [{"body": "Everyone is a brother to Hulk Hogan, brother", "score": 2, "replies": [{"body": "🤣🤣🤣🤣🤣🤣🤣🤣", "score": 1, "replies": []}]}]}]}]}, {"body": "This is the way.", "score": 0, "replies": []}, {"body": "No.", "score": 0, "replies": [{"body": "Not the advice I wanna hear get out", "score": -3, "replies": [{"body": "?wth do you want to hear?", "score": 3, "replies": [{"body": "He’s trolling lmao. $nvda investors are a different breed bruh", "score": 3, "replies": []}]}]}]}]}
{"title": "SVIX: A Theta Gang ETF", "selftext": "This is hands down my new favorite ETF.  It's one of the only inverse ETFs that actually appreciates.  I believe it does so by selling options, most likely CSPs.\n\nThis looks like it could be the type of fund that you can dump a pile of money in after a major crash, forget about it, and come back 5 years later to find 10x gains.\n\nVIX is calculated by using the price of 30+ DTE options on a basket of stocks.  Any VIX related ETFs most likely achieve parity by buying these options.  Options decay, of course, and that's why VIX related ETFs depreciate so fast.  To inverse VIX, I imagine that you would simply sell those options instead of buying them... and I think that's what this fund does.\n\nIt's holdings show as 196% cash and -96% stock.  This makes sense in light of the recent drop.  Before the drop, it's holdings were 100% cash.\n\nThis could be a really good fund if you want theta gains but not be hands on with options.  A hard drop (and boost in VIX) is a good time to enter.  If VIX keeps going up, and the price drops more, doubling down is a no brainer.\n\nI put 10k in when it dropped to 40.  I lost half when it dropped to 20, but threw another 10k at it.  It went back up to 30 in a week, I cashed out that second set of shares, and now I'm 2.5k up and will be 5k up when it gets back to 40.\n\nJust thought I'd share this with you guys...\n\nEdit: To the people of the future, this post was downvoted to oblivion, but I thought I'd add some pertinent information to it in case someone searches for information on SVIX and stumbles upon this post, as you just did...\n\nI assumed that SVIX appreciates by theta from selling options.  I was wrong.  One particular user seemed to have the answer, yet only gave ambiguous and vague hints, acting as if he were doing me a favor for just dropping those crumbs alone.  He also thought it was better to passive aggressively berate me under the mantle of safeguarding the quality of the sub and welfare of its users.  Ironically, providing an actual answer would have immensely increased the quality of this post, and subsequently the sub as well.\n\nHowever, after a brief scroll through his profile, I now understand and sympathize with his motivations.  Edison is famously quoted as saying that success is 10% inspiration and 90% perspiration.  While this user seems to have a fair amount of knowledge about option trading, he unfortunately appears to lack the necessary fortitude, perseverance, and capability to perform it.  He apparently gave up, realizing that he wasn't cut out to play this game, and put most of his money in SPY at the apex of the market. l too would possibly harbor some insidious insecurities that could drive me to use any opportunity to exalt myself over others in attempts to try to ignore and obfuscate my perennial mediocrity and ineptitude.\n\nBut enough of that... Let's get to the answer!  SVIX doesn't appreciate via option theta, but it does appreciate via the force underlying theta... time.\n\nFirst, VIX is usually in a state of contango.  Contango occurs when the price of an instrument's futures are higher than the spot price of the instrument.  The price of those futures decrease and get closer to the spot price as they approach expiration.\n\nSecond, SVIX achieves an inverse relationship with VIX by shorting/selling VIX futures.  Putting both of these together, and assuming that the value of VIX remains unchanged, SVIX sells VIX futures at a higher price, and then buys them back at a lower price as they approach or reach expiration.\n\nAs an example, if VIX is at 15, a future that is a month out might be priced at 16.  SVIX would sell that future for 16, and assuming that VIX doesn't change for the month, buy it back at 15... earning a $1 on the contract and increasing the cash/assets that the fund holds.\n\nOf course, this is a VIX based fund and is extremely vulnerable to spikes in VIX.  SVIX and SVXY both seem to have recovered and achieved new ATHs after major spikes in VIX (e.g. the covid spike), but I would still approach it with caution.  I casually mentioned that an ideal time for entry would be AFTER a major spike in VIX, and this should be emphasized.", "id": "1ev1bu5", "created_utc": 1723957283.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 110, "comments": [{"body": "SVIX and SVXY are shorting VIX futures and attempting to replicate a 30-day VIX future. Volatility ETFs don't usually have positions in options (Except SVIX is actually long VIX call options).\n\n  \nThe way shorting VIX futures earns money is similar to \"Theta Gang\" though.", "score": 22, "replies": [{"body": "Did you mean to say that SVIX is short/selling VIX call options?  If it were long, it's price would increase with an increase in VIX...\n\nEither way, it makes sense that they would just deal in options on the VIX index instead of managing all of the individual stock option positions.", "score": -16, "replies": [{"body": "please inform yourself first before spreading misinformation by reading the prospect of SVIX", "score": 11, "replies": [{"body": "To be fair, I read it and am more confused", "score": 4, "replies": []}]}, {"body": "No you need to read up on futures", "score": 3, "replies": []}]}]}, {"body": "OK, this is what makes the internet so dangerous. OP, please don’t take this personally, but you are cheering up and promoting a product without even understanding how it’s actually designed. \n\n\nIt’s one thing to YOLO into an ETF with your own money, but what you are doing here is not ethical. \n\n\nPlease go ahead and read the prospectus first. Understand how it’s structured. Do some google search on why they decided to come up with this ETF. I’ll give you a hint, SVYX. From there, go to vix central, understand the concept of contango\n\n\nYou’ll see that the information you provided here is wrong and the way you put it is not helping anyone. Someone buys this ETF and gets burnt after reading this, it’s on you.", "score": 53, "replies": [{"body": "you know what they say, little knowledge is more dangerous than no knowledge.", "score": 3, "replies": []}, {"body": "No shit.  VIX based funds are volatile.  Water is wet.  Of course there is risk with it.  There is a lot of risk in trading/writing options in general, and the purpose of the sub is to discuss these things.\n\nWhere did I tell people to YOLO into it?  Maybe instead of being a drama queen you should actually contribute something useful and tell us what the pitfalls of it are and explain why it should be avoided.  Dropping vague comments about SVXY and contango doesn't help anyone.", "score": -29, "replies": [{"body": "Life is too short to argue with strangers online. I shared my opinion. You can take it or leave it. But for the sake of the quality of content in this community, please don't share information on instruments where you don't understand how they work.", "score": 17, "replies": [{"body": "You don't like to argue? Then why did you kick down the door and come in guns blazing, criticizing without giving any useful feedback?  I know about everything you mentioned, and I don't see what they have to do with this ETF. \n\nBelieve it or not, I'm actually genuinely interested in what the problems with it are.  I know a lot of about market dynamics.  However, I also know that there are plenty of things that I don't know.", "score": -20, "replies": [{"body": "Bruh go read the svix prospectus", "score": 5, "replies": []}]}]}, {"body": "Water is not wet. Water causes things that it comes in contact with to become wet. Pretty great analog to your partial/mis-understanding of how SVIX functions.", "score": 12, "replies": []}, {"body": "You're getting these kind of responses because your post is full of bad interpretations on how the ETF works... which in itself is a problem because that shows you didn't do the basics : RTFM of the fund ;]\n\n\nAs such, you're spreading misinformation with enthusiasm, which is dangerous as there are people reading this that don't understand anything and will take your post as financial advice.\n\n\nps: Even without reading SVIX's prospectus, it's pretty obvious it does so by shorting VIX futures. Options on VIX are a totally different beast (≈ SPX vomma play). If that doesn't seem obvious to you, I would recommend against trading vol products, be it VIX or options. And this is financial advice :p\n\npps: See CBOE PUT index for an example of what a theta-based strategy could look like", "score": 10, "replies": []}]}]}, {"body": "> I believe it does so by selling options, most likely CSPs.\n\nRead the funds prospectus. Theyre required to publish it. ", "score": 11, "replies": [{"body": "The SVIX product page has it's current holdings. OP must have just read the brief on his brokers site and finished his research there. Who buys a complex ETF without first seeing what's in it? He thought the fund sold options, wild.", "score": 5, "replies": []}]}, {"body": "> I put 10k in when it dropped to 40. I lost half when it dropped to 20, but threw another 10k at it. It went back up to 30 in a week, I cashed out that second set of shares, and now I'm 2.5k up and will be 5k up when it gets back to 40.\n\nIdiocy and courage. The only way SVIX goes \"back\" to 40 is via reverse split and further drop.", "score": 7, "replies": []}, {"body": "LOL terrible advice.\n\nIf you are fucking around with daily short ETFs the worst thing you can do is “forget about it 5 years”.\n\nYou are probably unaware that prior to SVIX there was another short ETF that blew up during volmageddon. \n\nShorting volatility is hard and entails substantial risks if you buy SVIX you have to accept a disclaimer that they do not endorse holding it for long periods of time.", "score": 5, "replies": []}, {"body": "Inverse volatility ETFs work a little different to what you’re describing but you’re on the right track. I bought some SVXY in the Covid crash and it’s my best performing stock ever (until very recently). I got really excited on this stock so here’s everything I learned to save you some time\n\n- There is never a free lunch in finance. The trade off is you’re buying a stock that grinds up in perpetuity but it’s a complex opaque product that can have enormous and quick drawdowns or completely blow up to 0. See XIV ETF. \n\n- Wouldn’t bother selling CSP. I tried. Liquidity and  spreads were low & wide, would have been better performance just owning the stock\n\n- Overall it’s a great stock for chucking some money in every time you see VIX above 40 but don’t put any more money than you’re prepared to lose into it", "score": 5, "replies": [{"body": "Thank you.  You seem to be one of the only ones that seems to be getting why I'm bringing it up and what I'm trying to say.  People are missing the point I made about putting money into it after a crash.\n\nMore importantly, I'm bringing it up because it appreciates over time, unlike other inverse/leveraged ETFs.  That blows my mind... and is why I'm posting it in a theta sub.\n\nYeah, I looked at SVXY too.  I like SVIX a bit more because it seems to move more and have better option liquidity.  But you're right... buying/selling options on either isn't ideal.", "score": -3, "replies": [{"body": "It appreciates over time but there is risk of the fund going to $0 and quick.", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Agreed... but it will back to 52 eventually.  Even though VIX went up slightly from beginning to mid July, SVIX still went up $1.\n\nThen again, I think it will be a while before 52 again.  I'm expecting another hard drop at the turn of the month.  I'll sell off what I have beforehand and buy back in afterwards.\n\nIt seems that a boost in VIX exponentially damages the fund.  The covid drop destroyed SVXY.  It took 3 years for it to get back to its ATH.  It's definitely not a fund to sit in at the moment.  I'll be in and out until we hit a bottom and I put money in on a longer term basis.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "If I had a long term position, I'd start selling .25 delta CCs when VIX hit equilibrium again.  It would be an easy way to make 5%/month.\n\nBut man... if you have a big position, you might want to consider selling or hedging before the end of the month.  I'm serious about that drop.  Liquidity is running so thin that it kills the market when the Treasury takes in a big chunk of money.  Mid April with tax payments and two weeks ago with debt issuance are examples.  They'll do a big chunk of debt issuance at the turn of the month again.", "score": 3, "replies": []}]}]}]}, {"body": "We've forgotten volmageddon (2018) already? This is what everyone sounded like back then.\n\nLook up the 90% drop it had in 2018. Its still down about 70%.", "score": 3, "replies": [{"body": "2018? Its only been around since 2022.  Im guessing that you're referring to SVXY?  Yeah, it got demolished.  What's interesting is that VIX went to 50 and destroyed SVXY.  VIX went to 80 with covid, and SVXY only lost 50% that time.\n\nEither way, I should have put more emphasis on the part about waiting until a major crash to enter.", "score": 0, "replies": [{"body": "Ah, my bad, I did think we were talking about svxy.", "score": 2, "replies": [{"body": "No worries.  It's a ticker worth bringing up here.  I've looked at them both, but think I prefer SVIX more, personally.\n\nIt's also worth bringing up that event.  These are risky funds.  I said something about putting a bunch of money in and forgetting about it, but people are taking that too literally.\n\nI mentioned in another comment that I think there will be a lot of volatility in the near future, and that it wouldn't make a good long term hold right now.  However, I also want to be ready in case there is another major crash.  I wish I knew about SVXY when the covid crash hit.", "score": 1, "replies": []}]}]}]}, {"body": "Lol theta and Vega are different my guy.", "score": 4, "replies": [{"body": "Of course.  This fund fluctuates with volatility, but I'm brining it up for discussion because it appreciates in value via theta.", "score": -3, "replies": [{"body": "That's not theta. There are no options it's a play on VIX futures and VIX futures are a play on the market expectations of the VIX which is a statistic on ATM SPX options pricing. In order words the pricing is based on the market expectations of volatility. It has literally nothing to do with theta...", "score": 2, "replies": [{"body": "Yes. You're right in that I was wrong about the fund using options.  It uses VIX futures... and there is theta on futures contracts.", "score": -2, "replies": [{"body": "Futures contracts do not have theta (options on these contracts do).", "score": 5, "replies": [{"body": "I think they're talking about the carry priced into the futures.  Although I'm not sure if that is expressed in terms of hedge parameters like theta or rho.", "score": 1, "replies": []}]}, {"body": "No offense my dude but you are being obsessive about theta. You seem so obsessed about it that you try to fit it into everything including where it doesn't belong. This is a recipe for disaster and while many on this sub share your obsession and lose money as a result, you don't have to go down that road. Stop it now! For your sake, please recognize that there is no edge inherent in theta. Everybody knows about it and the market won't pay you for knowing it's a thing.\n\nYou want to be successful in trading/investing? You need a system or set of strategies that have an edge. You can make plays where theta is a tailwind but theta itself is not an edge. My advice to you is to study up and spend a few decades devising a system that works and has an edge. You'll be much more successful that way.", "score": 3, "replies": [{"body": "Hahaha I think you're being obsessive about some idea you've created in your head that I'm being obsessive about theta.\n\nI brought this ETF up as a point of interest because it's one of the only leveraged or inverse ETFs that actually appreciates... via theta.  And yes, as I mentioned, I think it's something to consider after a major drop/spike in VIX.\n\nThe irony with your comment is that I don't even have a theta positive position right now.  IV is too low and HV is too high.  Most of my positions are gamma and vega positive, and slightly delta negative.", "score": -2, "replies": [{"body": "I don't know man. I will let the other people here decide but it seems to me you really want to claim a volatility product as theta for some reason. You know there are other subs to discuss volatility trading if that's what you're into? I should know I'm primarily a vol trader.", "score": 2, "replies": [{"body": "Let's say that the market drops, like it did, and you sell a put spread.  Then, it goes back up the next week, like it did, and IV drops back down.  Did you just make money on theta, delta, or vega?  You made money via all three, of course.\n\nLike you said, trying to make money via one greek is one dimensional and detrimental.  The way to really capitalize is to know how option pricing works and build positions that have a high probability of success, based on the conditions.\n\nYes, you're right... SVIX is primarily a volatility instrument.  However, I assumed that it decayed like most of these types of ETFs, and was pleasantly surprised when I realized that it actually appreciates. I thought it was something people would want to know about.\n\nAlso, as a volatility trader, I don't have to tell you... volatility trades are some of the easiest trades on the planet. There aren't many opportunities that you can be reactive instead of proactive. If IV goes up high, then it will most likely come down.  However, not many people know how to set up volatility trades correctly, and trying to sell spreads on things like UVXY isn't that great.\n\nSo, that's why SVIX is attractive to me.  It's an easy way to take advantage of a VIX/IV spike, and the theta component is just the cherry on top.", "score": 0, "replies": [{"body": "You misunderstand I have no issue with SVIX. I personally prefer SVXY and hold SVXY like 70% of the time based on one of my strategies. My objection is characterizing it as theta when it is a vol play. BTW in the example of the put spread you give you'll notice money isn't necessarily made on Vega. The reason is that the volatility may be lower before you open then when you close. Typically volatility goes up when the market goes down and then back down when the market recovers. But like in recent weeks volatility is still higher now than a month ago, although it recently came back down. So again I don't understand the conflation between theta and volatility. You can make money on volatility while losing some on theta and the other way around. They are just different things.", "score": 1, "replies": [{"body": "SPY had an IV of 30% at its nadir on the 5th, and 15% on the 13th, after rising for a week.... and you don't think vega would affect the price of that spread?\n\n\nActually, nevermind.  You're right.  I'm an idiot.  Hahaha I should have known better to engage with someone that thinks it takes a few decades to develop an option strategy and begins dialogs with \"No offense, but...\"", "score": 1, "replies": []}, {"body": "ooof, you just gave him theharshtruth.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "RemindMe! 1 month “OP’s gonna be broke”", "score": 2, "replies": [{"body": "I will be messaging you in 1 month on [**2024-09-18 12:25:20 UTC**](http://www.wolframalpha.com/input/?i=2024-09-18%2012:25:20%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/thetagang/comments/1ev1bu5/svix_a_theta_gang_etf/lipgf0r/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fthetagang%2Fcomments%2F1ev1bu5%2Fsvix_a_theta_gang_etf%2Flipgf0r%2F%5D%0A%0ARemindMe%21%202024-09-18%2012%3A25%3A20%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201ev1bu5)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Jokes on you... I'm already broke", "score": 0, "replies": []}]}, {"body": "I made a killing on SVXY last week but I just bought shares.  If the VIX Spikes to the same level as a global financial crisis and one of the fastest spikes in history over something much less dire it seemed like a safe bet the only place it can go is down.", "score": 2, "replies": [{"body": "Nice. Yeah, it's such an easy play.  Even if VIX keeps going up and I lose initially, I feel totally comfortable throwing more at it... because VIX will eventually come back down.\n\nThere will probably be another, similar move at the turn of the month.", "score": 1, "replies": [{"body": "exactly how I feel in both directions. The vix spikes have actually become more volatile over time, not the average level necessarily but the short term spikes and their speed.  Probably due to High Frequency and algorithmic trading and the popularity of daytrading.\n\njust let it sit there until the next spike which will almost certainly happen eventually.", "score": 3, "replies": [{"body": "My theory is that it has to do with low liquidity, low volume, and low IV.  There's a lot to it, but the short of it is that the option price/distribution curve is smaller with lower IV.  This makes gamma on options higher, and delta changes more rapidly with price movements.   MMs try to stay delta neutral and the big fluctuations in delta cause them to buy/sell more in the direction of movement.  As in, MMs are put in a position to buy more when the price goes up, and vice versa.  it's a self feeding phenomenon.  Also, low volume/order book means there are less orders to absorb/buffer the swings.\n\nRemember when it was a big deal if the SnP moved over 1%, and happened only a few times a month? It seems to happen every other day, and rarely seems to move less than .5%.", "score": 1, "replies": [{"body": "i def need to look into your perspective.  I am new to options and volatility and this sub is a goldmine of knowledge and information.", "score": 2, "replies": []}]}]}]}]}, {"body": "I made some nice money buying in at $20 or so last week when VIX spiked, I sold a little early though.\n\nthis play is over now though unless VIX spikes again. for now I’m gonna be looking to sell weekly CSPs on UVXY", "score": 2, "replies": [{"body": "As I just mentioned in another comment, I think we could see another spike at the turn of the month", "score": 1, "replies": [{"body": "yeah I’m expecting increased volatility as we get closer to the election", "score": 2, "replies": []}]}]}, {"body": "Why can't I just buy puts on vix?", "score": 2, "replies": [{"body": "I'd like to take a moment to reflect back on this...\n\nNotice that even though your question was dissenting, I didn't interpret it as an attack, thought it was a valid question, and gave it a full response?\n\nI feel like the standard shithead on here would have said something like, \"Just asking that question shows that you don't know anything about options and wouldn't even understand my response.  You need to go spend a few months learning the basics before you post/comment here.\"\n\nAnyways, I thought you might get a kick out of this... sometimes, when I have some time, I like to be petty as fuck.  Check out the edit I made to this post.  In a day or two, I'll let the guy that was the inspiration for the edit know about it and thank him.", "score": 2, "replies": [{"body": "You're a fucking beast!\n\nNot only did that edit get into some serious important details. Stuff that most, myself included, would not seek out in almost any circumstance. it just goes to show your dedication to the craft.\n\nI missed your comment earlier my bad, got distracted being petty in another thread 😂\n\nI'm just an asshole, but as you noticed, not without reason. I try to avoid asking useless questions and making false statements, but as you know being that direct comes across anti social.\n\nYou have every right to be petty, trust me.\n\nAs someone trying to start an automation consulting service you make me feel unprepared lol.\nBut In a good way. You give me hope for humanity, and are a reminder that dedicated and smart people still exist.\n\nNot even sure if I properly responded as this was the most intellectually stimulating thing I've read In a long time. Maybe I'm slacking lately, hanging in the wrong grouos. but I hope you know what you are. A unicorn. Know your worth king. I appreciate you making sure I see this.\n\nSide note:\nI especially liked your point that theta isn't just a measurement but a physical mechanism in the market. I had no clue that inverse products sold the future price blindly.\n\nThat makes me wonder what the fund does to balance out losses after selling too low. Or perhaps they act differently under backwardation?", "score": 2, "replies": [{"body": "Haha thanks man.\n\nI don't think very many inverse funds sell futures like that.  Inverse funds usually decay because they use debit options.  This and SVXY are pretty much the only inverse or leveraged funds I've found that appreciate.  That's why I was interested in it and wanted to share it.\n\nBut yeah, that's a good question... I should try to reconstruct some of the big drops and see how things played out, but I don't think I'll go that far yet.  I'm just going to use it for short term plays and won't open any long term positions until this market bottoms out... and that's probably going to be at least over a year.\n\nIn fact, I've been thinking about how to play that turn of the month drop.  I was planning on just using SPY/QQQ, and still will a bit, but I might actually use UVXY too.  I NEVER play UVXY, but the odds are looking good.  I'll open something ATM at 14dte and roll back at 7dte.  It will cost me 25%/week, but it should be worth it.  If it does anything close to last drop, it will pay massively.\n\nThen I'll roll that into SVIX and ride VIX back down.", "score": 2, "replies": [{"body": "Is it only these two 'short' funds that appreciate?\nThat would make sense, if yes, as not many products short products can be consistent long term..\n\nI'm curious, besides giving you the tools to see the market for what it is, was becoming a software developer worth it? Not to diss your work, but to point out the developments in technology. The more we inch towards an effective AI model the less inclined I feel to go back and finish my degree.\n\nI was the type to skip college after they switched up who was coaching the baseball team without warning. \n\nPersonally I'd be looking into buying MARA and selling JPM while waiting for any further drops but that's more of a correlation play than anything. And well banks own both of those markets right now, so it's fairly reasonable that it's a terrible idea lol. \n\nLet's say you buy 14 day long calls in UVXY.. does the upward momentum combined with gamma create a 'double win' effect?", "score": 2, "replies": [{"body": "Software development has treated me well... but I've always been into computers and \"figuring shit out\".  I don't know if I'd go to college for it at this point though, with tuition costs this high.  A college curriculum won't have many programming classes.  I learned most of my skills outside of school.\n\nI haven't gotten too much into AI assisted code, but it's still just a language model.  It can spit out a bunch of code, but it's still at a point that anything with complexity still needs to be reworked and organized.  My guess is that AI will start eliminating off shore development.  Also, there are a lot more office/clerical jobs that will be shaved off first.\n\nThat UVXY play is just simple, straight up calls.  It looks like the 20 strike has the lowest IV and best efficiency.\n\nI wouldn't get too deep into MARA.  I said that a drop is coming at the turn of the month, but I was wrong.  It's coming sooner.  The Treasury snuck in a 35B CMB.  There will be a 55B issuance/redemption imbalance on Tuesday.  We should see a solid drop around then (if not sooner).\n\nHowever, that drop at the beginning of Sept will still probably happen too.  It might be like a double rug pull.  Just as the market gets footing from that first drop, the second will hit.  WSB permabulls are going to get obliterated.", "score": 1, "replies": [{"body": "Makes sense.\n\nYou right, but how much longer till snippets of clean code are available? 5 years?\n\nMaybe I'm a perma bull om crypto lol \nI also consider it a very short or a very long term vehicle.\nNo need to get chopped up and you're just confirming that for me with data here.\n\nYou working on anything outside of trading?\nI get the feeling that whatever you do, you're going to be one of the best alive.", "score": 2, "replies": [{"body": "Depends on the layer.  AI cam probably handle a lot of backend/database/API stuff right now, but it will probably be a looong time before it can successfully do UI stuff.\n\nI dunno man, I like the idea of crypto, and I even have a Kraken account that I trade on a bunch, but I think crypto is going to go through some hard times over the next couple of years, as this market winds down.\n\nI have a couple other projects that I'd like to spend some time on, but I'm mostly doing this stuff full time until I can get some solid protocols in place.\n\nYourself? Is this a full time thing?", "score": 2, "replies": [{"body": "Gotcha glad to know people aren't completely replaceable yet 😂\n\nI'm with ya, I just consider that a long time. If trump is elected I could see it popping back up soon than later tho.\n\nYe also full time. In a slump right now though and doing my best to stay hands off as I tend to revenge trade. I missed the opportunity (unrealized gains) to be in the top 3-7% of earners in my age bracket this year, went on a bit of a bender and am now using the time to build a consulting service around Automation. I was initially gonna seek out someone in your shoes, but with technology these days i found it cheaper and easier(for me atleast) to partner with a software to handle the heavy lifting. Still undecided if I like options alpha or surmount.ai better. But for now only options alpha has option capability and can link to tasty.", "score": 1, "replies": [{"body": "I'm telling ya... you can crush it by trading on liquidity alone.  My chart on Fred is broken right now, but I'll fix it sometime soon and show you the correlation.\n\nOptionAlpha used to have a deal with Tradier.  Even if they don't, it's worth looking at.  Their web UI is dogshit, but 0 option contract fees is nice.  Also, I didn't really notice a difference in order fulfillment between it and TD/Schwab.​", "score": 3, "replies": [{"body": "Agreed, but its too reliant on opinion.\n\nUnless your on another level of liquidity that I'm unaware of.... When I hear people say that I think ICT bullshit\n\n\nI think they still do, good to know that tradier is solid !", "score": 1, "replies": [{"body": "No.  It's based on data.  This looks like it might explain it a bit...\n\nhttps://trium-capital.com/library/trium-talks/liquidity-is-still-plentiful#:\\~:text=We%20measure%20actual%20liquidity%20using,increase%20or%20when%20RRP%20decreases.", "score": 2, "replies": [{"body": "Okay so you're on another level then. Quantified liquidity.\n\nI'm so used to 'look at the chart pattern, it broke here and liquidity rollowed'", "score": 1, "replies": [{"body": "It sounds advanced, but it's not too difficult to follow.  I'm surprised more people don't.  It's gold.  I've seen it posted and ignored on WSB.​\n\nThere's still some subjectivity to it.  I don't try to predict target levels.  I only care about direction.  If the sum of RRP and the TGA goes up, the market is probably headed down, and vice versa.  For example, on 8/1, RRP + TGA went up to 1267.  You saw what happened.  On 8/7, it went down to 1070, then the market climbed.  A change in liquidity also doesn't always guarantee movement.  Often times a catalyst is still needed.\n\nSo, when I say that the market will probably crash on Tuesday and the beginning of September, it's because I've looked at the debt issuance schedules and calculated that the TGA amount will go up... and send the market down.\n\nAlso, remember how I said that the news is bullshit and just noise?  90% of the time the market moves based on liquidity.  The media just tries to find some bullshit explanation to fill in the narrative post facto.  It's pretty funny once after you've seen it happen a few times.  Sometimes I play a game and try to predict what reason they'll come up with.\n\nLastly, you know that whole bit that no one really knows which way the market will go and it's almost impossible to time the market?  It's utter fucking bullshit.", "score": 2, "replies": [{"body": "The market has been up since the start of September. How will you reason this with respect to liquidity. Do you calculate liquidity daily or monthly?", "score": 2, "replies": []}, {"body": "Shh don't tell the normies 😂\n\nReminds me of 'watching the tape' the time and sales.\n\nIn the short term, day trading stuff, you can 'predict' as well with sheer volume of trades bought or sold at any given time. Much like how HFT operates but with a human touch, as you know the only issue is staying detached.\n\nYou can't convince people to believe something unless you already have influence lol\n\nNot sure what rrp or tga stand for to be honest but I can tell what your doing to be true. Sometimes the liquidity gets eaten up and sometimes if it 'shocks' the market a large move happens.\n\nI bet if you compare the debt Liquidity to recent trading volume, you'd be able to spot when a big move is ready to happen (low volume being more affected by liquidity shifts)\n\nYou ever look into the ADD or TICK? I believe they measure similar things but across the market as a whole.\n\nI also wonder if your liquidity metrics are able to be made into an indicator on think script?", "score": 1, "replies": [{"body": "Oh... yeah... then there is the whole order flow stuff.  In a nutshell, we're getting such wild swings because liquidity is low, IV is low, gamma is high, volume is low, and the order book is thin.  You know about opex and vixperation, right?\n\nRRP - [https://www.newyorkfed.org/markets/desk-operations/reverse-repo](https://www.newyorkfed.org/markets/desk-operations/reverse-repo)\n\nTGA - [https://fiscaldata.treasury.gov/datasets/daily-treasury-statement/operating-cash-balance](https://fiscaldata.treasury.gov/datasets/daily-treasury-statement/operating-cash-balance)", "score": 1, "replies": [{"body": "Oh... Did I miss something or do you see order flow as different than liquidity?\n\nHow are you able to quantify gamma in a general sense?\n\nI don't often consider operating expenses, as I see it as priced in for most situations.\nVixperation, I'm assuming is when the monthlies contract expire?\n\nP.s. that all time Reverse repo chart is hilarious to see", "score": 1, "replies": [{"body": "So, important part first... that RRP chart is why the market will be fucked soon.  It pretty much represents all the available USD.  It can't go to 0 right now, because the economy and companies need cash to operate. It's the reason that these big debt issuances are so crippling to the market.\n\nThe paradigm will change when rates start getting cut, but I have no idea what the new one will be.  There will be a shift from RRP to RP, but I can't even speculate right now.  The economy/markets will need liquidity.  Cutting rates won't do much, and QE helps more... but it's not a good look to start QE again right after getting inflation under control.  There will probably be quite a bit of pain for a few months.\n\nI'm referring to order flows as the concept of tracking option open interest and orders.  Are you familiar with how MMs keep themselves delta neutral and how it affects PA?  Here is a video that explains it a bit...\n\n[https://youtu.be/0oJqC9QK-I0?si=6Fk75a8880z\\_RHt0](https://youtu.be/0oJqC9QK-I0?si=6Fk75a8880z_RHt0)\n\nThese forces occur during the week before monthly options expire.  Concerning Vixperation, VIX is calculated using 30+ day options, as those options cross the 30 day threshold, there is some rearranging that can have similar effects.   Vixperation usually happens the same week as opex, but sometimes can be delayed a week, like it was this month.", "score": 2, "replies": []}, {"body": "FYI, the announcement for the 2, 5, and 7 year note auctions came out today and confirmed what I had thought.  The imbalance is going to be huge, at about 85B.  It would have been 120B without that preemptive CMB.  For reference, the imbalance on 7/31 was about 65B.\n\nAlso, I'm going to purge a bunch of these comments.  If you need to, get this stuff copied down and let me know when I'm good to delete them.", "score": 2, "replies": [{"body": "Sheesh that's a lotta money getting pumped around.\n\nLooks like it's it won't take full effect until the 3rd, I'll be watching to see what happens. Seems like the next year or two are gonna be a traders wet dream.\n\nPurge whatever you need to. I'm more of a conceptual guy than a purely numbers and facts guy. I'll be able to find relevant information when needed, or I know who to reach out to if I can't.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Oh yeah, remember how I said that the Treasury just snuck in a CMB?  It's most likely because they know that the debt issuance on 9/3 is going to tank the market.  So they're trying to spread it out and mitigate the damage.  The market probably wouldn't have dropped much on Tuesday, but I think they're hoping that 2 drops will be smaller than 1 big one.", "score": 1, "replies": [{"body": "That's a good theory. I'll.be watching with this in mind", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I'm going to take a wild guess that you got fucked in May.  I did... and I felt pretty stupid because I wasn't watching liquidity, and I would have dodged a bullet if I did.", "score": 1, "replies": [{"body": "I think I recognized my tilt in April, possibly May.\n\nBut the trigger was Feb 24-28 mara. I saw an opportunity, over leveraged, hit it big, wanted more, made some money but then gave it back on tilt. \n\nThat's when I was like oh yeah, this is why we play it slow. Been working on the other stuff since, will probably go back to active full time next year so I don't lose any more gains on the year", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Also, you're preaching to the choir about reddit decorum.\n\nI genuinely want to help, be helped, and have positive interactions on reddit.  I've cultivated a fair amount of fruitful knowledge.  I got a lot of seeds from this and other subs, and I'd like to pay it forward.\n\nWhile I know a fuckton about option trading, I know there's a fuckton I don't know.  I still have an epiphany every few weeks and realize how a mathematics concept is expressed and/or can be used in trading. (I mentioned that I'm software dev, but I'm also a couple classes shy of a math degree too.)\n\nI firmly believe that there's a good chance even the biggest idiot here has a bit of knowledge, information, or perspective of value that I don't have.  I try to initially approach all interactions with tact, courtesy, and respect.  However, that quickly changes if they start being an arrogant douche.\n\nHere's a pretty good example from about a year ago.  I know a ton about market liquidity, Treasury operations, and bond price movements, but I wanted to see if this kid that was making minimum wage at some place like Little Ceasars knew something I didn't.  Hahahaha he did not...\n\n​https://www.reddit.com/r/wallstreetbets/comments/15ia5n6/comment/juths7c/?context=8&depth=9", "score": 2, "replies": []}]}]}, {"body": "You can.  However, I think there are two advantages to SVIX... It seems like the liquidity on VIX options isn't very good.  You might lose a bit on the bid/ask spread.  Also, most importantly, buying a put option would come with theta decay.  What I was trying to point out is that SVIX actually appreciates, and would be more like selling a call instead.  Of course, selling a naked call is a bit riskier and not many accounts even have that elevated permission.", "score": 1, "replies": [{"body": "An appreciation of volatility is nothing more than a paradox. An artifact in time.\n\nAs for liquidity, I haven't looked but if you're right, hell yeah.\n\nSure it would decay, but gamma could also sky rocket it\n\nFor example I bought calls at 20 on vix before this recent crash. They expired worthless and then 30 days later we're seeing numbers like 40-60. \n\nSurely the expansions of gamma would offset the decay of theta I would've endured to renew the contract", "score": 2, "replies": [{"body": "I spend a lot of time trying to gauge market liquidity by tracking Fed and Treasury operations.  If you dig through my history enough, you'd could probably find where I called the drops in April and a couple weeks ago.  There should be another one at the turn of the month, and these drops/swings should get bigger and bigger.\n\nIt's funny that you mention the time/volatility thing.  I'm trying to come up with a metric/greek that combines the two.  I see time as occurring in \"cycles\" and an option with higher IV can be viewed as predicted to go through more cycles than one with lower IV.\n\nOf course, things like rho come into play, but coming up with that metric would make it easier to compare options across different DTEs.", "score": 2, "replies": [{"body": "Look into second order Greeks, they are what you're seeking and can be easily applied in excel\n\nI'd have to agree that higher IV = more potential movement \n\nI'd disagree that you'll be able to mathematically time it with just one metric. I'm sure your prediction had a lot to do with general awareness of general economic discomfort as well.\n\nAt for time and IV, that's what theta is. You just only see it as a risk metrics and not a reward metric, from what I'm reading here. Just reverse the equation and don't get trapped in short volatility mindset.\n\nAs for the cycles, your probably better off following the Treasury. I saw their web page that said they distribute debt every 90 days, which just so happens to correlate with ideal premiums for options trading while still allowing room for predictable stock movement \n\nNot sure if the Fed is important for anything but stirring up emotions but that's more your expertise.", "score": 2, "replies": [{"body": "So, a good example of what I'm talking about can be seen over the weekend.  Notice how IV on Monday options is a lot lower?  The BSM model treats the weekend as regular days, but the market doesn't.  This discrepancy causes a distortion on the greeks.  I want to come up with a way to normalize the IV between them and get more accurate greeks.\n\nYou're correct.  The Treasury has more affect on liquidity like the moon has more affect on the tides.\n\nIt issues debt every other day, but long term debt is issued at the mid and end of each month.  More importantly, there are surges in issuance at certain times of the year that put downward force on the market.  We just entered one of those seasons.", "score": 1, "replies": [{"body": "Not sure you'll be able to unless we get 24/7 trading.\n\nOtherwise that feels to me to be a human-only type of discretion \n\nHowever I applaud the unique thoughts process and opportunity seeking and want to note that on Mondays and start of day options tend to be more chaotic. Other than a feeling and understanding I'm not sure you can quantify a mechanical effect of market \n\nAt what point is the downward force become unbearable?\n\nAsking bc in my mind that can only lead to further growth. Much like how inflation gave us a larger than normal return overall in broad market.", "score": 1, "replies": [{"body": "Yeah, it's more of a side project.  I haven't done too much with it yet.\n\nNormally that debt could cause inflation, but traditional money creation via fractional reserve lending went out the window when the Fed abolished banking cash reserve requirements at the onset of covid.\n\nOne theory is that there is an inverse relationship between the sum of money in RRP and the TGA.  If the amount of money in there goes up, the market goes down, and vice versa.  The idea is that if it's in there, it's not available to drive the markets.", "score": 1, "replies": [{"body": "Gotcha, you got an IG or something where I can stay updated?", "score": 2, "replies": [{"body": "Not really at the moment.  I don't have much social media.  However, I'll follow your profile for now.  Feel free to do the same.  I like to check up on a handful of people and there's a good chance you'll see me pop up in some comments somewhere or get a message.\n\nAlso, thanks for stopping by.  I was regretting making this post.  I remember why I usually only post on shitpost subs and not \"serious\" subs.  Interactions with you and a couple others made up for all the twats.", "score": 2, "replies": [{"body": "Agreed, this reddit shit is asscheeked with bots and human batteries. The matrix is real.", "score": 2, "replies": [{"body": "It's amazing.  I think I just came up with a solution though.  I'm not the type of person that \"blocks\" people, but I think I'm going to start blocking people left and right, and see what happens.  It probably won't make a difference on big subs, but maybe small ones like this.  On here I've only blocked GallowBoob, and that was a good choice.", "score": 1, "replies": [{"body": "Sounds like work. I'd rather farm the free karma", "score": 2, "replies": [{"body": "we'll see.  I'll only keep doing it if it's simple, fast, and effective.  I won't put much thought into it.  if I see someone be a prick... two clicks... block. Next.\n\nWe'll see if it makes the reddit experience any better.", "score": 1, "replies": [{"body": "I'll take pricks > bots and hivemind", "score": 2, "replies": [{"body": "Ha well... I consider people in the hivemind as pricks.  Just look at how many idiots in this post try to get a lick in on me by piggybacking off of someone else's asinine ​comment.", "score": 1, "replies": [{"body": "Lmao. Fair enough. Pricks", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I like how you think tho.\n\nIgnore the noise and watch what the source of the economy does.", "score": 2, "replies": [{"body": "Exactly.  People place too much importance on news.  Events affect sentiment and short term prices, but only long term if they alter liquidity flows.  On the macro level, there are X amount of dollars.  Unless people withdraw it from their accounts and burry it, it's going to go somewhere.  It's just a matter of figuring out where (bonds, equities, cash, etc..).", "score": 1, "replies": [{"body": "You should work an AI sentiment recognition of these metrics you seek.", "score": 2, "replies": [{"body": "Ha I have a laundry list of stuff to do.  I'd love to look into some AI assistance, but first on the list is to get my data collection and market api stuff running again.  Then, I need some position management to fully execute the strategy that I've been working on for the past few years.", "score": 1, "replies": [{"body": "Position management is the easy part brother\n\nOnly saying that bc we trade similar but opposite side of the coin.\n\nJust know as long as you take profit when you are able to afford the fees and find the balance of max profit without taking a win rate hit you've perfected it.\n\nAs for losers, minimize cost and maximize time.", "score": 2, "replies": [{"body": "I'm actually a software dev by trade, and had something basic, but would like to build something robust.  Ultimately, I'd like to build a trading engine.  Have you seen OptionAlpha.com?  Something a bit along those lines.  It's a decent app, but didn't do some basic things I need.", "score": 1, "replies": [{"body": "What are they missing? I was considering becoming an affiliate to run my services through them.\n\nIf not another AI company but they don't have options just yet.", "score": 2, "replies": [{"body": "They could use more option structures.  They don't have things like regular condors or calendar spreads.  You have to build them synthetically... and doing so can overshoot their bot capital limit or screw your DTBP up.\n\nAlso, I'd really like to be able to calculate, store, and use some basic calculations.  For example. to pick options I'll use extrinsic value instead of delta.  Instead of finding the .25 delta option, I'll get the option with a value that's 40% of the max ATM value.\n\nInstead of storing variables, you have to set tags.  That gets wonky.\n\nThere is some other stuff, but that's off the top of my head.", "score": 1, "replies": [{"body": "Gotcha. I don't ever go that complex tbh\n\nThey probably don't allow it because of the caps. I'm sure you could email them to figure out if theirs a way around the cap and therefore a simple way to do it.\n\nWhat do you consider a regular condor?", "score": 1, "replies": [{"body": "4 legs on the same side.  They only do iron condors.", "score": 1, "replies": [{"body": "Neutral volatility exposure, while profiting from minimal stock movement and extreme stock movement?\n\nSeems over complicated, what's the ideal scenario?", "score": 2, "replies": [{"body": "It is a bit. I pair them up, one on each side.  It most allows for a high level of granular control over greeks and consistent delta during price movement.\n\nAn iron condor uses reserves, but I condor can be made to use the same amount, with the benefit of enhancing the greeks and profit range as well.\n\nAlso, there is massive IV skew on SPY/QQQ.  You can take better advantage of it with two condors.", "score": 1, "replies": [{"body": "I'll let you handle all that. Naked longs and spreads are usually good enough", "score": 2, "replies": [{"body": "Oh yeah, that's another reason why I can't use OptionAlpha... those condors aren't level.  I have the quantity on the credit spread boosted to use all of the reserve provided by the debit spread.  Then I'll also jack up the debit leg of the credit spreads as well.  Also, I'll push the credit leg a half logarithmic interval ahead.  As in, if the main body is 7 dte, the credit leg will be 5 dte.\n\nBut yeah, I'll switch it up at times too... I might just use some skewed butterflies on the put side for that upcoming drop I'm expecting, etc...  it just kind of depends on the instrument and scenario.  I'll get killed on fees if I use that double condor on TLT.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "This one is pretty good.  I can't tell if you're messing with me or being serious... The irony of thinking your wisdom has enough value to type out and give as unsolicited advice, about being humble and keeping your words to yourself, is absolutely perfect.\n\nHowever, you're completely right... I should have kept this information to myself.  Other than a few positive interactions, this has been a regrettable waste of time.", "score": 1, "replies": []}]}, {"body": "after reading all the comments, I have to say seems like OP has too much ego to accept he is wrong.", "score": 1, "replies": [{"body": "And markets sure don't reward ego :P", "score": 1, "replies": []}]}]}
