{"title": "Boeing Leaves 2 Astronauts Still Stranded In Space For 2+ Months, Nasa Says SpaceX Could Potentially Rescue Them", "selftext": "NASA has revealed that two astronauts, originally on an eight-day mission that began in June, could remain stranded on the International Space Station until 2025 due to issues with Boeing’s Starliner capsule. Astronauts Butch Wilmore and Suni Williams, who were the first to pilot the Starliner, may need to return on SpaceX’s Crew Dragon in February 2025 if Starliner is deemed unsafe for reentry.\n\nNASA is in discussions with SpaceX to leave two seats vacant on an upcoming Crew Dragon launch, as they and Boeing work to resolve the situation. The mission, which was expected to last just over a week, has been extended due to propulsion system failures on the Starliner, raising doubts about the spacecraft’s ability to safely bring the crew back to Earth.\n\nBoeing has acknowledged issues, including thruster malfunctions and helium leaks, but maintains confidence in Starliner’s capability to return with the crew. However, if NASA decides otherwise, Boeing has stated it will prepare Starliner for an uncrewed return. The situation is a significant setback for Boeing, which has struggled to compete with SpaceX’s more reliable Crew Dragon.\n\nThe government needs to stop giving Boeing billions of dollars for projects they simply cannot complete. This is a PR nightmare. This year alone it was Boeing headline after headline. This seemed to have happened before the new CEO took over so maybe there's still a possibility of a turnaround.\n\nSource:https://www.nytimes.com/2024/08/07/science/boeing-starliner-nasa-spacex.html", "id": "1eqfkbn", "created_utc": 1723473811.0, "score": 518, "upvote_ratio": 0.97, "num_comments": 83, "comments": [{"body": "How is this not getting more attention lol? Boeing literally got 2 people stuck in space!", "score": 292, "replies": [{"body": "Because campaign elections.", "score": 53, "replies": []}, {"body": "Yeah as I see this more and more over the weeks, I think about how if this was happening 30(?) Or so years ago, I feel like all channels would be in emergency broadcast mode.\n\nNow I'm just wondering if I should buy a $9 bag of chips or $17 value meal at McDoanlds.", "score": 19, "replies": [{"body": "even in 2010 they would be broadcasting this way more lmao", "score": 3, "replies": []}, {"body": "30 years ago NASA was hiring people based on their skills and merit.", "score": 2, "replies": []}]}, {"body": "But they haven’t identified the hit man, so it’s all good for now.", "score": 1, "replies": []}, {"body": "This tory isn't friendly to dei policies", "score": -15, "replies": [{"body": "I don’t think it’s DEI. Pretty sure it’s just Boeing , aka McDonnell Douglas being a terrible company.", "score": 3, "replies": []}]}, {"body": "I mean…it’s been in the mainstream news repeatedly. Both on tv and on the internet. It’s been all over Reddit. I’d argue it’s gotten quite the amount of attention", "score": -7, "replies": []}]}, {"body": "Boeing CEO just got fired, not that it helps the 2 Astronauts get home faster but its something at least.", "score": 75, "replies": [{"body": "No just failed upward $34 million payday and a seat on the board.   For comparison Jensen the head of NVIDIA also got $34 million in compensation.", "score": 50, "replies": []}]}, {"body": "Boeing is knowns a think or two about leaving customers stranded . Just be thankful they don’t use oops you died because of us ? It was probably some intern !", "score": 17, "replies": [{"body": "Will be cheaper to pay off the relatives of the deceased than the cost of a rescue. NASA lawyers know this.", "score": 5, "replies": [{"body": "Sadly true .blame it on computer software and spend years filing motions / appeals.", "score": 1, "replies": []}]}]}, {"body": "A nice mile marker of American societal decline. When we decide to abandon two NASA astronauts in space and not have the media cover it because it would make a huge corporation and the US Govt look bad.", "score": 48, "replies": [{"body": "[deleted]", "score": 27, "replies": [{"body": "That's what they want you to think. Corporate PR saying \"we meant to do that\" is so sad.", "score": -1, "replies": [{"body": "Moving the goalpost already? Abandoned asking with media blackout", "score": 7, "replies": []}]}]}, {"body": "If they were not expected to survive you’d have a point. Having your space trip take longer than expected is not the worst reasonable outcome when you strap yourself to a space missile", "score": 10, "replies": []}, {"body": "1. They can deliver food and water just fine.\n\n2. The ISS has a life boat they all can use at any time.\n\nDefinitely not stuck.", "score": 3, "replies": []}, {"body": "A single search for “stranded astronauts” on the Google News search shows this is being covered my every major American news outlet though…….", "score": 3, "replies": []}, {"body": "imagine if Musk's dragon was in this predicament. that should tell us a lot about the media.", "score": 0, "replies": []}]}, {"body": "How is Boeing stock not crashing", "score": 7, "replies": [{"body": "They're still making weapons and winning contracts. Turns out getting stuff to fly isn't hard, but getting stuff to work regularly is, which means when they offshored all their QA to cheap Indian labor (not to be confused with competent Indian labor) we got this mess, among many others (looking at you Boeing max).", "score": 12, "replies": [{"body": "I wouldn't want them making weapons if they can't even make planes properly.", "score": 1, "replies": []}]}]}, {"body": "Is Boeing the worst company in America?", "score": 11, "replies": [{"body": "Nestle: Am I a joke to you?", "score": 8, "replies": [{"body": "Nestle is swiss…", "score": 3, "replies": [{"body": "The comment said \"worst company in America\" not \"worst American company\". Nestle has offices in America, so the original comment still applies.", "score": 1, "replies": []}]}]}, {"body": "Monsanto", "score": 3, "replies": []}]}, {"body": "This is why I don’t go to space", "score": 3, "replies": []}, {"body": "I wonder what the politics of leaving astronauts in space is like when they could send a dragon capsule up there in a couple days to get them but they won't make that phone call because they don't want to give Musk that political win.", "score": 6, "replies": []}, {"body": "SpaceX should go pick them up and deliver them to Boeings front door without their permission, it would be too funny", "score": 2, "replies": []}, {"body": "\"Yeah, can you just reserve us two seats on your rocket..?\"   I wonder what the cancellation fee is.", "score": 2, "replies": []}, {"body": "Space is awesome, so staying there longer is a good thing. Bullish.", "score": 1, "replies": []}, {"body": "Yes! Musks next cluster fuck!  Send em up!", "score": -5, "replies": [{"body": "I’m sorry?", "score": 4, "replies": [{"body": "Just saying musk is kinda eating a shit sandwich right now and might as well see if can fail to save these astronauts and add a like throw up to the sandwich and eat it up", "score": -4, "replies": [{"body": "They are plenty of actual evil billionaires to go after bro. If space x can get those people home great!", "score": 1, "replies": []}]}]}]}, {"body": "I really hope they don’t have to rely on Elon.\n\nEdit: ah you pitiful fanboys.", "score": -48, "replies": [{"body": "why not? Especially if SpaceX could get the job done", "score": 37, "replies": [{"body": "Ya id rather 2 people die than Elon get some good press amirite", "score": 6, "replies": [{"body": "Who the fuck is dying? They are on ISS that is well supplied, without any threat of life loss.\n\nThey will get out of space during next astronaut rotation at the start of new year, which is much safer than hero shenanigans that could be tried by SpaceX and potentially fail.\n\nIs it safer to get them out during long planned rotation or during a rescue mission that was planned in a span of a few weeks?", "score": -3, "replies": [{"body": "What hero shenanigans? Even the post specifically says it would be two seats left empty on the next scheduled crew dragon. \n\nElon deserves most of the shit people throw at him, he's an ass. SpaceX on the other hand as a company remains pretty impressive IMO, regardless of who owns it.", "score": 3, "replies": []}, {"body": "Sorry, what hero shenanigans exactly? Crew Dragon has successfully docked with ISS 9 times and transported astronauts. It's proven technology, unlike Boeings failed capsule.", "score": 2, "replies": []}, {"body": "You’re absolutely right. Leave ‘em up there, they can wait.", "score": 1, "replies": []}, {"body": "Right? What a ridiculous and mindless comment to make  to protect their all mighty Elon", "score": -2, "replies": [{"body": "I didnt even react to Elon part. Just to the fact that he said \"2 people dying\".. what a clueless comment", "score": -1, "replies": []}]}]}]}, {"body": "Elon will brag about it", "score": -34, "replies": [{"body": "reddit moment", "score": 7, "replies": []}, {"body": "So we shouldn't get these two hero's home cause it could be used by Elon musk as an ego boost? Tf?", "score": 39, "replies": [{"body": "This is the absolute dumbest take. \n\nSpace -X: the only means of getting to space \n\nTerribly bad faith argument that paints the premise as evil when in fact it was just, “anyone but Elon.”", "score": 1, "replies": []}]}, {"body": "what a reply", "score": 8, "replies": []}]}, {"body": "Why not? Especially when anyone but Elon could get the job done? Especially since it’s not ELON doing the work. NASA/ESA maybe? It doesn’t matter. Nationally we shouldn’t have to be subjected to the whims of a single corrupt billionaire.\n\n\nBut go on tell me more how you are DEEP TSLA. If not I’m going to posit that you will be pleasuring Tucker Tate next with your sloppy mussy.", "score": -5, "replies": [{"body": "I mean I asked why not rely on SpaceX to save astronauts and you responded with a bunch of assumptions lol", "score": 2, "replies": [{"body": "The whole premise was an assumption. What world are you living in?", "score": -2, "replies": [{"body": "you said “ tell me more how you are deep tesla “", "score": 1, "replies": [{"body": "And you said why not? If space-x can get it done. Which is a fucking assumption. What’s also an assumption is the shit meaning you pulled out of, “I hope they don’t have to rely on Elon.” Absolute nutter trying to cherry pick to fit your narrative.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I don't think nasa wants elon to personally go pick up the astronauts. SpaceX is more than musk. It's Gwynne Shotwell and all the engineers and other personnel that make spacex. In fact, musk barely has anything to do with spacex beyond owning it. Thank god.", "score": 5, "replies": []}, {"body": "Yeah I wish NASA was properly funded so we didn’t have to rely on a private corporation", "score": 3, "replies": [{"body": "NASA has always, since day one, relied on private corporations to design and build their equipment.", "score": 2, "replies": [{"body": "Which is different than hiring a private corporation to use their equipment", "score": 2, "replies": []}]}, {"body": "You want nasa properly funded ?…. You do know the history of nasa and the nazis and the US gov right ?", "score": 1, "replies": []}]}, {"body": "Two people are there. And I suppose you consider yourself to be on the good side of the political fight.", "score": 0, "replies": [{"body": "Political what now? Y’all take an opinion of someone else and conflate it into anything you want huh? Knee jerk reactionists triggered by disdain for ya boy. Shameful and sad really.", "score": 0, "replies": []}]}, {"body": "Yeah ide just off myself then and there if I had to rely on some overweight incel on twitter 24/7 to rescue me ngl", "score": -15, "replies": [{"body": "Touch grass", "score": 9, "replies": []}]}]}, {"body": "Could? How about can?! Pay Elon.", "score": -9, "replies": []}, {"body": "[deleted]", "score": -8, "replies": [{"body": "I mean stranded also means unable to leave somewhere / stuck , so for the time being they are stranded", "score": 2, "replies": []}, {"body": "If they are not stranded then what are they?\n\nThis whole things seems suspicious to me. Surely Boeing could work 24-7 to get a second craft ready. Surely SpaceX could send a craft if necessary, why wait until 2025? Is this actually a test of how future astronauts may react to similar issues when they are headed to Mars and beyond. Conveniently both astronauts are “older” so it’s unlikely anyone comes back pregnant.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -81, "replies": [{"body": "Probably, given that they're college educated!", "score": 49, "replies": []}, {"body": "Lowest IQ comment of the day on reddit.", "score": 21, "replies": []}, {"body": "First anti-astronaut opinion I’ve ever seen", "score": 18, "replies": [{"body": "You should have seen my fake moon landing post! Was incredible!", "score": -3, "replies": []}]}, {"body": "Bruh. Braindead comment. No one deserves to die because you don't agree with their politics... The fuck?", "score": 1, "replies": [{"body": "Pretty sure your response is braindead. prob a liberal green haired degenerate imo. Never heard of anyone dieing on the space station!", "score": 1, "replies": [{"body": "Nah, I’m a Republican and voting trump. Shit like this doesn’t help the perception of our party one bit", "score": 0, "replies": []}]}]}]}, {"body": "[removed]", "score": -13, "replies": [{"body": "that has nothing to do with the discussion", "score": 4, "replies": [{"body": "Who cares. If there is a crisis guarantee some one will profit. If Elon sends up a rocket best believe he will get paid.", "score": 3, "replies": []}]}]}]}
