{"title": "✅ Daily Chat Thread and Discussion ✅", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "1enq87e", "created_utc": 1723176036.0, "score": 6, "upvote_ratio": 0.88, "num_comments": 82, "comments": [{"body": "\\*pokes ticker with stick", "score": 5, "replies": []}, {"body": "For the third day in a row I'll say, if it closes at $105 I'll be happy.", "score": 8, "replies": [{"body": "Friday's are usually take profit days but I'll also say the same. Like someone else said here, if the 105 Calls are expiring today, next week could be different in terms of buy volume. ", "score": 8, "replies": []}, {"body": "maybe you shouldn’t be saying it then.  you are jinxing it.", "score": 2, "replies": [{"body": "LOL, this isn't the Craps table.", "score": 0, "replies": []}]}]}, {"body": "Hope we hold the bullish momentum to the moon baby💚", "score": 7, "replies": []}, {"body": "You guys think we can break $110 next week?", "score": 5, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "I like that, hoping to see around 110 or so, I want to roll my calls over to for earnings.", "score": 3, "replies": []}, {"body": "I don’t think so.", "score": 1, "replies": []}]}, {"body": "I do. Options chain is keeping us from holding higher moves though. On the 16th the monthly calls expire", "score": 2, "replies": []}, {"body": "Wait for Aug 15 report on inflation ", "score": 1, "replies": []}]}, {"body": "whos selling all his NVIDIA after earnings and only buying ETF from now on ? YES ME LETS GO FK GENERATIVE AI have you tried coding with this trash can xd ?", "score": 2, "replies": []}, {"body": "For those who portfolios are heavily weighted by NVDA, is anyone looking to sell post earnings to rebalance their portfolio? Why or why not?\n\nLooking forward to hearing different perspectives.", "score": 3, "replies": [{"body": "I hope to take some profit by selling 75%. The trick as always is deciding the sell price. Although, I have to say once NVDA starts the climb (whenever it happens), the only reason you'd take profit is if you need the cash. Selling at 130 as an example is foolish if all signs point to a greater climb. I know these things are to be taken with a grain of salt, but the price targets for this year are as high as 200 and as low as 85...so make what you will from that. My personal hunch is we will see 150 by the end of this year. ", "score": 5, "replies": []}, {"body": "I have 570 shares which is half my portfolio lol.  I've been buying my way with margin trades into a lower average but I expect to keep \\~500 shares for a long hold (1+yrs)\n\n30% of my portfolio is INTC which turned into a bad gamble for the short term.  I expected something out of their foundry business by now.  It'll happen eventually, it's the only competition to TSMC that i see in the future.  It is looking bad tho.  If i were to trim NVDA, it would go to INTC.  idk i think that company is worth way more than $19 a share, once their foundry business gets going\n\nI have wendy's as my dividend fund lol  I just pump a few shares in there when it's below $17\n\nI need to diversify more tho.  I have a few shares in small caps but nothing i expect to boom into anything big just yet", "score": 1, "replies": []}, {"body": "I always sell at new highs.", "score": 0, "replies": []}]}, {"body": "What does next week look like for us? When will the institutions rotate back into semis?", "score": 2, "replies": []}, {"body": "Do I buy now or wait for a greater dip?", "score": 4, "replies": []}, {"body": "Nvdia will be to the moon! It is all an set up! They spread rumour about the delay and drop the price so they can buy more before earnings! Nvdia is going to the moon few days before earnings!", "score": 3, "replies": [{"body": "Forget the moon. For all this suffering I want to see Mars.", "score": 8, "replies": [{"body": "The fuck suffering are you talking about!!!\n\nLOL...this stock has been INCREDIBLE in the last few years. \n\nI bought in Jan of '20 at 48 a share. 48K. That split 4-1, 4,000 shares. Then what happened....40,000 shares. \n\nIt's...been absurd! Suffering? \n\n  \nYou sound like you bought Intel!", "score": 3, "replies": [{"body": "Here we go again… this stock has been suffering ever since it hit 140.", "score": 3, "replies": []}, {"body": "Gotta say this sub is full of super-impatient fly-by-night types. Investing is at least a mid to long term thing...and I see people here cry about volatility within the same day. If you don't have the sac for investing, let your daddy buy you stock.", "score": 2, "replies": [{"body": "Yeah...it's like people think it's some get-rich-quick scheme. It is not.", "score": 2, "replies": []}]}, {"body": "Go back to bed boomer!", "score": 2, "replies": []}]}, {"body": "I feel you man", "score": 1, "replies": [{"body": "Always great seeing another man with hopes of seeing Mars.", "score": 1, "replies": []}]}]}]}, {"body": "Is this anything important? They created a chip at a university which in my opinion needs years and billions to mass produce. What are your thoughts?\n\n[Nvidia's H100 GPU Surpassed By China's New AI Chip That Operates Entirely On Light In Energy Efficiency](https://www.benzinga.com/news/24/08/40275356/nvidias-h100-gpu-surpassed-by-chinas-new-ai-chip-that-operates-entirely-on-light-in-energy-efficienc)", "score": 2, "replies": [{"body": "We are talking of China here.\n\nThe chances are almost 100% that the chip in question does not come even close to what they claim.\n\nThey are most likely just been pushing this to get more government funding.", "score": 5, "replies": [{"body": "Probably, I heard that alot of their research papers have alot of fabricated data (not in AI, in general) So i'm always sceptical about it.", "score": 4, "replies": []}]}, {"body": "anything done at uni level wont make it to market for at least a few years if ever. based on many different variables", "score": 1, "replies": [{"body": "So what i suspected, yeah it's nothing. But seems they are still pushing whatever negative article they can about Nvidia.", "score": 1, "replies": [{"body": "Dude...we just heard about a chip China developed that was like...30X faster than NVDA.\n\nThat was \\~6 months ago and...like Kizer Soze...poof. Nothing. \n\nPropaganda. Why are they buying these scaled-back NVDA chips en masse?", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Did you do your research and due diligence beforehand?  If you you did, you should have enough information than asking random people on the internet about this.", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "He's right. No one knows what the future holds and no one can tell you if your investment can turn into something special. All we know is NVDA has a higher chance to be successful than failed. That's why it's an investment with risks.", "score": 1, "replies": []}, {"body": "The amount you specified is a lot for anyone to want to bare any type of responsibility over. But yes, the responses you got are dismissive and we certainly have more precise information than the notion of the company having \"a higher chance\".\n\nAs far as market speculation, Nvidia is in the lead with the data center gpus, which is what is driving the revenue growth. There is no indication of their largest customers slowing down, and no indication of AMD or other companies approaching them as direct competition. Also the market for data center gpus has not reached its capacity, and is expected to expand for a number of years.\n\nPer business speculation. Nvidia's catalog is backordered for the current generation mark of gpus. AMD just came out with something that is comparable to Nvidia's, but Nvidia has another product finished that is exponentially better, as well as a design for another product after that.\n\nThe most prominent hiccup in their business has been the delay of the upcoming product Blackwell by a few months. It's a significant road bump in the current speculation of stock as far as the company itself is concerned. There's also mounting concern about firms selling out of Taiwan amidst Chinese economical authority. Most of these concerns amount to some clouds on a pretty sunny day for Nvidia, but are definitely worth being informed about.", "score": 1, "replies": []}, {"body": "Yeah that was harsh", "score": 1, "replies": []}]}]}]}, {"body": "Lots of 105 calls expire today, that's why they try so hard to krep it under 105. If NVDA ends above 105, then it will moon next week because the call sellers will have to buy the shares to deliver.", "score": 3, "replies": [{"body": "So tired of the term ‘moon.’", "score": 5, "replies": []}, {"body": "Could you elaborate on how option volume affects underlying stock price?", "score": 2, "replies": [{"body": "If the stocks ends above 105, a call option contract has value, and for each contract, the seller has to deliver 100 shares to the buyer at 105/share. That's what a call option is for: to buy the stock at strike price rather than at the market price (which is above 105 in this case).\n\nIf the stock ends below 105, the call expires worhtless, and the seller keeps the premium.", "score": 3, "replies": [{"body": "Ahhh… the corruption is immense", "score": 1, "replies": []}, {"body": "If most sellers would be institutions, then am I correct in assuming that retail won't have enough volume to get the options ITM, so would it be up to another institution to get the price over 105 if they bought the options to make a profit?", "score": 0, "replies": [{"body": "Retails can never move the needle at all. The contracts you bought were (most likely) sold by the MMs (market maker). They need your cash for liquidity to do other trades. Usually for hot and hyped stocks they make a lot of money due to many people buying their options. You can only hope other institutions buy and make your contracts ITM, but most wouldn't do that on Friday, which is the options expiring day, unless there's something crazy like a super bullish news coming out.", "score": 1, "replies": []}]}]}]}, {"body": "Who is \"they\" and how do they \"try\"?", "score": 0, "replies": []}, {"body": "It won’t then", "score": 0, "replies": []}]}, {"body": "It's up to you to save the day, americans! 🇺🇸", "score": 1, "replies": []}, {"body": "I’d be happy to end the week sideways after the past 8 days.", "score": 1, "replies": [{"body": "Glad that's what happened eventually 😅", "score": 1, "replies": []}]}, {"body": "Insider Alert: *HUANG JEN HSUN is selling shares----> yet again*  \n[\\[Go to NVDA\\]](http://url3797.altindex.com/ls/click?upn=u001.muxWLEkVpxNOghr7Vf0k8TqR7d2O5MVmqyUZLIXIo3c54N0hEe3bK-2FRnjPBdojKnGwaC_CoOEZKWM-2FJ96-2FAYelDs4nm6kW6plZuLz5wymE388yA2YFDYGn51CjbrGZ6s9ozU-2FcChVmeygc-2Fv7p17-2Bgcx8C4zZ41dK-2BfqVlFNeYcypFOTkTD5qPRNUFX-2FnTrBLIti61P7Jy5BTxUW-2BamjIMJNbfyw1pHN6a79iT6nCUjiIImZt6Svf3sU3LOpZk2p91D6G2zsUshpofLaPIpS2KfYxvQ-3D-3D)", "score": 1, "replies": []}, {"body": "Hey, haven't looked at my NVDX and NVDL over the last few weeks. What'd I miss?", "score": 1, "replies": []}, {"body": "ugh this rollercoaster ride", "score": 2, "replies": [{"body": "What rollercoaster? 2% is nothing my dude. Its just a no news day.", "score": 1, "replies": [{"body": "Just talking about this past week, up +5% down +5%", "score": 3, "replies": [{"body": "Look at the price historically, its nothing new. Set your graph to % and you'll see nvidia is always volatile", "score": 1, "replies": [{"body": "Yes...... like a rollercoaster......", "score": 2, "replies": []}]}]}]}]}, {"body": "Kind of refreshing that it’s just trading sideways today.", "score": 1, "replies": []}, {"body": "There she goes dippin", "score": 1, "replies": []}, {"body": "Praise our lord and savior Jensen Huang! Amen", "score": 0, "replies": []}, {"body": "I liked green better.", "score": 0, "replies": []}, {"body": "You know... it doesn't help sentiment and public perception of the \"AI Revolution\" when Elon Musk is using his Twitter platform to send out Generative AI deep fake political hit ads.", "score": -3, "replies": [{"body": "That must be a MAGA downvote.  Using generative AI for nefarious purposes is in no way good for NVDA bulls.", "score": 4, "replies": []}]}, {"body": "Honestly glad we closed the week sideways after what happened in the past week.", "score": 0, "replies": []}, {"body": "Shit is drilling again…", "score": -4, "replies": []}, {"body": "[removed]", "score": -4, "replies": [{"body": "You’re not a really nice person. Your parents wont be proud", "score": 6, "replies": [{"body": "LOL!!!", "score": -7, "replies": [{"body": "I repeat my question.\n\nyou seem like a reasonable person. why do you get kicks from shitting on other stock subreddits? I see your intel post too.\n\nAlso why do you think you are free from this same fallacious attack (if one wanted to pursue it) due to your interest in AMD stock?\n\nPlease use critical thinking and mature.", "score": 5, "replies": []}]}]}, {"body": "mate.... you seem like a reasonable person. why do you get kicks from shitting on other stock subreddits? I see your intel post too.\n\nAlso why do you think you are free from this same fallacious attack (if one wanted to pursue it) due to your interest in AMD stock?", "score": 5, "replies": []}]}, {"body": "pump and dump. Lower high, lower low", "score": -10, "replies": []}, {"body": "So analyst are predicting Q2 revenue to be around 28B while NVDA estimates it to be around 11B.\n\nThis huge discrepancy got me wondering. Will it beat that ? Because the huge increase prediction sounds like a big shot in the dark estimate", "score": -5, "replies": [{"body": "Where did you get the 11B? Nvda guidance for Q2 is around 28B iirc.", "score": 5, "replies": [{"body": "You’re right. I read some BS elsewhere. It’s expected to 28.5B. Yeah Nvda def gon beat everything and raise guidance for next year. Ima try to forget about stocks till September and see where I end up. GL everyone.", "score": 4, "replies": []}]}]}]}
{"title": "Bumble Put - dogsh dating app", "selftext": "https://preview.redd.it/k1bbyzl2gjhd1.jpg?width=822&format=pjpg&auto=webp&s=7840944a722d952a6f19f3a9f92efc5c1373fa34\n\nI always knew this pos app would never go anywhere. It's sucks that I didn't buy puts before I lost 100k on bullshit monthly nvda calls, coulda been a millionaire maybe lol\n\nCoulda woulda shoulda ... sigh\n\nWomen rarely ever make the first move, even if they do it's with guys that are so out of their f-ing league it's like trying to pair up a f-ing hobbit with Shaquille O'Neal. They just get pumped and dumped and then curse at the worlds average looking average height average earning men for being average and not being exceptional enough for them to swipe right on lol\n\nNot only that but dating apps in general are extremelyyyyyyy difficult to monetize. If she wants to F she'll just give you her number and you'll be off to the races on the third or 4th date none of this wait till 6 months horsesh\n\nSo how does a company like Bumble make money off of its lonely average men not getting any attention on Bumble? THEY DONT. Or at least it's getting harder for them to do so given its abysmal year outlook", "id": "1enmsvp", "created_utc": 1723165748.0, "score": 105, "upvote_ratio": 0.84, "num_comments": 84, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 6 months ago\n**Total Comments** | 32 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "You can say fuck on reddit, dad.", "score": 94, "replies": [{"body": "Based on the post OP isn't anyone's Dad.", "score": 52, "replies": [{"body": "Factz prevent fatherhood apparently lol", "score": 8, "replies": []}]}, {"body": "It kept deleting the post didn’t know what the FUCKING issue was lol", "score": 20, "replies": []}]}, {"body": "Bro now you can put this screenshot as one of the bumble profile pics.", "score": 34, "replies": [{"body": "Women don’t care about $ they care about your face and height and once they see that they like your face and height THEN they care about your money lol", "score": 21, "replies": [{"body": "i agree but also did someone hurt you", "score": 18, "replies": [{"body": "Clearly 💀", "score": 7, "replies": []}, {"body": "Lmfao I mean at this point if you haven’t been hurt then you haven’t understood the world around u well enough clearly", "score": 5, "replies": []}]}, {"body": "Word of advice: stop taking these red pill generalizations so seriously. There are plenty of attractive women dating unattractive losers for whatever reason. The world isn’t that deterministic.", "score": 5, "replies": [{"body": "Lmao look it’s giving a political lecture on a DD and profit post.\n\nMoney talks, so clearly you’re wrong. Begone olive.", "score": -1, "replies": []}]}]}]}, {"body": "Imagine going on dates so bad you slam bumble puts.", "score": 57, "replies": [{"body": "It’s not bad dates that did this it’s the premise of the app itself lol", "score": -2, "replies": [{"body": "His joke was funny… we’re seeing more n more why bumble doesn’t work for you", "score": 23, "replies": [{"body": "And why doesn’t it work for me captain? ", "score": 2, "replies": [{"body": "You take zero responsibility for the behavior your obviously biased sentiment is the likely cause of. Basically don’t short a stock based on sentiments that mainly boil down to being mad at women.\n\n\nYour gains could be a result of the factors that made you short it, but given how many other possible causes exist for price movement it’s highly unlikely the correct reason was your unmilked boner.\n\nRegardless, congratulations on the gains.", "score": 6, "replies": [{"body": "It has absolutely nothing to do with being mad at women captain \n\n My sentiment is not the cause of women’s carefully surveyed and studied online dating habits. My sentiment and understanding is the RESULT of those now well understood habits. I did not drive women away on Bumble cuz I wrote a mini rant in fact i often wrote very little\n\nIt has to do with very very basic reality. If a woman likes u, she will give you her number/email/snapchat/instagram or other contact info within the first few messages that are sent. If she is mostly uninterested, she won’t. It’s as simple as that \n\nThere are certain websites that have monetized the first message. Those sites are doing very well I would say \n\nUnless the first few interactions or messages are monetized it is extremely difficult to build a consistent stream of revenue for a dating app. Why would average looking men PAY to send messages knowing that women are still likely to read those messages and remain uninterested in them? Tell me, why on earth would they do that?", "score": 8, "replies": [{"body": "You know, fair enough. That’s a solid argument, point rescinded.", "score": 1, "replies": []}, {"body": "Crazy you’re getting downvoted for this opinion. I fully agree with your thesis based on personal experience. Bumble is possibly the worst dating app for retaining straight men which are the highest monetizable population in the dating market imo. I used Bumble for a year, barely got any dates or likes. When I switched to Hinge I met so many women that I couldn’t keep up with convos and dates. The reason? I used the prompt response (DM slide feature on Hinge) to break the ice and start convos. Bumble is very restrictive in comparison and doesn’t serve straight men at all. I tell all single men to boycott Bumble. Congrats on a 6 bagger OP. Oh and FUUUUUCK YOU.", "score": 1, "replies": []}]}]}, {"body": "I ain’t your captain mate", "score": 2, "replies": [{"body": "You’re arguing with a hamburger helper skeleton", "score": 1, "replies": [{"body": "I should provide details. That I have only met crazy on bumble lol.", "score": 3, "replies": [{"body": "Crazy easy to fuck", "score": 0, "replies": [{"body": "Goes without saying lol", "score": 2, "replies": []}]}]}]}, {"body": "Alrighty soldier", "score": 1, "replies": []}]}]}, {"body": "Why thank you", "score": 1, "replies": []}]}]}]}, {"body": "Post this on an incel sub, and they will crown you their king.  Now that I typed it out, it actually doesn't seem very appealing.  Never mind, as you were.\n\nP.S. Congrats and FU.", "score": 28, "replies": [{"body": "I mean my analysis is probably not wrong … probably … lol", "score": 5, "replies": []}, {"body": "he’s not even an incel, you can have these opinions & get laid.", "score": 1, "replies": [{"body": "I never implied that OP is an incel.  I just said that he can enjoy some popularity within that community if he's into that sort of thing.  His mating behavior analysis is highly reflective of reality.", "score": 0, "replies": []}]}]}, {"body": "Out of my limited time using dating apps, my best conversations and dates have come from bumble. The rule of ladies messaging first keeps away some of the weirdos and attracts relatively normal women on the app lol", "score": 15, "replies": [{"body": "I will just stay out of betting against or for dating apps altogether. On one hand, I fucking hate dating apps. On the other hand, it is really difficult to meet people nowadays with everything moving online.\n\nOf the dating apps I have tried, Hinge and Bumble are usually the best ones.", "score": 9, "replies": [{"body": "I agree", "score": 2, "replies": []}]}, {"body": "how old are you? might depend on age/ generation", "score": 2, "replies": [{"body": "24", "score": 0, "replies": []}]}, {"body": "You are a cut above the average in all likelihood", "score": 2, "replies": []}]}, {"body": "Sounds like you got experience waiting on that first message huh", "score": 6, "replies": [{"body": "What’s your failure rate son? 95%? 🤣🤣🤣🤣🤣🤣\n\nCuz mines like 85-90% no need to be ashamed lol", "score": 14, "replies": []}]}, {"body": "I've always had good experiences on Bumble.  Never thought about trading it.  Glad you're doing well.", "score": 7, "replies": [{"body": "You probably didn’t need the app if your experiences were mostly positive", "score": 6, "replies": []}]}, {"body": "Who hurt you bro?", "score": 9, "replies": [{"body": "Geee wowza that is such a fucking articulate critique of my view of dating apps and dating in general waow broski that’s next level, just incredible I feel so enlightened ", "score": 0, "replies": []}]}, {"body": "Edit: I said things insulting OPs ability to get women. I retract them and ask op not to murder a bunch of women out of his own frustrations. Dating is really hard. It takes a lot of time and effort, especially on dating apps.", "score": 7, "replies": [{"body": "Just looked at his profile. r/WallStreetBets and r/truerateme, Let’s hope he makes a lot of money on bumble, or this guys dropping a manifesto and showing up on the news.", "score": 11, "replies": [{"body": "Posts a filter pic on r/truerateme. Dude belongs here. I hope they roasted him for that, kinda defeats the purpose of that sub.\n\nAlso what dude posts filtered pics? That might be his problem. Probably have a lot better luck with grindr, both in real life and the market.", "score": 6, "replies": [{"body": "The filter was because it was taken using Snapchat and it’s not possible to remove it. Believe it or not I’ve been told I have the clearest skin ever so I def don’t need the filter I can promise u that lol", "score": 0, "replies": [{"body": "I agree you don't need the filter. But it's definitely possible to take pictures on Snapchat without a filter.", "score": 2, "replies": []}]}]}, {"body": "🤣🤣🤣🤣🤣🤣 lmfao 🤣 🤣🤣🤣🤣 \n\nmy manifesto will be of peace. It will promote true understanding of human female biology and psychology. The plebeians of the earth such as yourself will never know it was me that wrote it lol. I don’t care to be remembered \n\n Plus I get enough so I have no reason to show up on the news lol", "score": -3, "replies": []}]}, {"body": "Lmfao don’t worry dude I’m not gonna do that I get enough lol \n\nMy point with this post is that even if dating is becoming more difficult because of peoples lack of effort + rising expectations + time constraints, that doesn’t change the fact that even getting women to CONSIDER pursuing something with u is becoming hard as hell. That’s why these apps are failing  \n\nExposure to above average looking men on TikTok Instagram and other apps will do that to most women, inevitably. These other apps will also indirectly affect the success of the dating apps and whether or not there will be meaningful relationships formed because of them", "score": 1, "replies": [{"body": "You're getting a lot of shit here because that's what this sub is about, but I'll give you some honest advice. Instead of ranting here about how hard dating is, you should be making yourself better. If you want the girl of your dreams you gotta be the guy of her dreams. \n\nBasically work on being better and the women will come. If 10% of guys get 90% of the women, then you can either become an incel, hope you get super lucky with a girl out of your league, or you can become that 10%.\n\nBasically quit being a bitch and be better.", "score": 3, "replies": [{"body": "JuSt bE bETtEr bR0 ", "score": 0, "replies": [{"body": "Yep there's your problem. Someone tells you maybe try being better and you think it's a joke, as if improving yourself isn't possible. No woman wants a guy like that. \n\nI swear you incels set the bar so fucking low you make it so fucking easy for normal guys like me.", "score": 2, "replies": []}]}]}]}]}, {"body": "Lmfao tell me you're ugly without telling me you're ugly. I've had lots of success on bumble and the quality of women was way higher than tinder on average. I recommend it to all my single friends.\n\n99% of the time on bumble the woman makes the first move by saying \"hey\". Then the app will let you make the actual first move. If you ever had a match there you'd understand this.", "score": 5, "replies": [{"body": "I have had matches on there mostly just people visiting or the occasional land whale. I didn’t pay very much at all for the matches I did get\n\nMy experiences would strongly have me believe that I’m not ugly. Not model tier, but certainly not ugly\n\nI can only surmise that your “quality” matches are self hating ethnic women and lower tier Beckie’s. Only way to know for sure what kind of matches u get is to see how you look or how tall u r because for the most part those are the only factors that matter to most women esp women on bumble or Tinder\n\nAre you genuinely fucking dumb? Have you not seen how women swipe on dating apps in those YouTube videos? Just search one up to get an idea .. less than half a second on each profile …", "score": -1, "replies": [{"body": "Bro... Quit watching YouTube videos about how women swipe on apps and quit complaining about your height. You're falling down the incel rabbit hole.", "score": 3, "replies": []}]}]}, {"body": "It's always the people who get absolutely 0 kitty calling other people incel. Calling other men incels will not get you laid. I've got like 50 bodies at 27 (not bragging) and OP was on point about everything he said.", "score": 4, "replies": [{"body": "Finally someone that gets it. It’s not about being incel or not being able to get pussy it’s about highlighting why these companies are failing in the first place. \n\nNone of these guys wanna address the underlying causes and instead wanna throw around the incel diss, which is neither true nor is it even relevant\n\nI get plenty of Punani boys don’t worry lol", "score": 7, "replies": [{"body": "You're also catching a trend. There's been a serious decline in dating app subscriptions since covid ended.", "score": 5, "replies": []}]}, {"body": "I also think no one here understands how age affects dating apps. the younger generation cares a whole lot less about women making the 1st move", "score": 2, "replies": [{"body": "This is probably true", "score": 1, "replies": []}, {"body": "Younger generations of women definitely make the first move more on average", "score": 1, "replies": [{"body": "yea but they don’t need an app to force them to do it as it’s less of a “groundbreaking idea”", "score": 1, "replies": []}]}]}]}, {"body": "I can't trade options but I've been short the common since February, up about 50%. Debating whether to cover or ride this thing to zero. I just don't see how they turn their business around and who would buy them out or why anyone would.", "score": 1, "replies": [{"body": "Yea it’s a good position but you will have to cover at some point. I think it will grow because of simple population growth and also because there will always be a steady stream of lonely guys who sign up to give it a shot, hoping the app changes their predicament \n\nIt will be a zombie company like Snapchat, a company that most investors have a small investment position in and one that barely produces any profit at all. It’s presence however is notable and important in the social sphere which is why it will remain", "score": 1, "replies": []}]}, {"body": "I have heard of Tinder but I never heard of this one. Interesting.", "score": 1, "replies": [{"body": "It's way better than tinder if you're actually looking for a quality woman to date and not just a hook up. You still have to follow rules 1 and 2 though, which OP obviously had a problem with.", "score": 2, "replies": [{"body": "what’s funny is bumble ended up being where most of my hookups came from", "score": 1, "replies": [{"body": "🤣🤣🤣🤣🤣 the person above you needs a reality check lmao doesn’t matter the dating app women are picky and if she hooks up with u on the app she’ll hook up with u in real life too lol\n\nIf she rejects u on the app it’s highly likely she’ll reject or ghost u in real life too", "score": 1, "replies": [{"body": "if she rejects u in the app don’t let her reject u irl, ur bordering on stalking 😂", "score": 1, "replies": []}]}]}, {"body": "Hinge is definitely the best imo.", "score": 1, "replies": [{"body": "Had great lunch on hinge as well but I was only on for like a week because it immediately led to a long term relationship.", "score": 1, "replies": []}]}]}]}, {"body": "I only bought 5 contracts\n\n $30 each and sold for $220", "score": 1, "replies": [{"body": "Noice", "score": 1, "replies": []}]}, {"body": "It’s gamified dating. Like any app game, the developer makes most of their money off the small percentage of people buying in-game upgrades and subscriptions. The free users just create value through the network effect for paying users. The model can work if enough people join. \n\nRecently, they have gone from significant overvalued against analyst consensus to significantly undervalued. It’s selling at half the P/E ratio of Match. Revenue per user declined, and total revenue did not meet expectations, but earnings per share is still projected to grow by 40%. \n\nIt’s clearly in a downtrend, but it may be oversold at this point. If the price declines to $5.50 from ~5.95, it’s probably a buying opportunity, if it isn’t already. The most pessimistic analyst of 17 has set a target of $5.50. I don’t think it’s a good short at this level like it was two months ago.", "score": 1, "replies": []}, {"body": "Surprising that we don’t have a good dating app yet…", "score": 1, "replies": []}, {"body": "You’re probably below average looking", "score": 1, "replies": [{"body": "My experiences would suggest otherwise. I do have a trait that is below average tho it’s not my face lol", "score": 1, "replies": []}]}]}
