{"title": "How will you react to NVDA’s earnings?", "selftext": "If it drops 20% or goes up 20%?", "id": "1ej6ezn", "created_utc": 1722699920.0, "score": 18, "upvote_ratio": 0.74, "num_comments": 85, "comments": [{"body": "Tequila!", "score": 37, "replies": [{"body": "This is the way", "score": 8, "replies": []}, {"body": "I act krazy when I drink tequila", "score": 5, "replies": [{"body": "Clothes fall off ?", "score": 2, "replies": [{"body": "GUN go off", "score": 1, "replies": []}]}]}, {"body": "only right answer", "score": 1, "replies": []}]}, {"body": "I think they need to crush earnings and raise guidance. If they beat really small or if anything is off then I think there will be a sell off. The market is so touchy right now. I'm seeing so many companies drop for no good reason. It's the market leader and they are sold out for a while. Such high demand. I'm hoping it goes well. It's been a wild ride so far.", "score": 30, "replies": [{"body": "Yeah meta earnings made me happy though I know they’re two separate companies but seeing how earnings has been for tech idk if NVIDIA is going to per se, “crush” earnings but it should be a profitable quarter for them no doubt.", "score": 1, "replies": [{"body": "Same with Apple like that’s a very good sign if those companies are holding even at 2% while everybody else is completely falling", "score": 0, "replies": []}]}]}, {"body": "Don’t wanna jinx but there is no way it drops 20%. Even if it drops because of fear it’s gonna blast through the roof shortly after", "score": 28, "replies": []}, {"body": "its not going to pump +20%\n\nSource: That would make my long calls profitable", "score": 21, "replies": [{"body": "lol", "score": 2, "replies": []}]}, {"body": "If it goes up 20%, I will be happy. If it goes down 20%, I will be sad. Either way, I won't sell because I'm already in trouble with short-term capital gains.", "score": 19, "replies": [{"body": "Samesies. If I sell it would be worse than a drop. I think I bought at 700. Regardless, the world needs processing power and they're the best.", "score": 2, "replies": []}]}, {"body": "Unhappy if it drops 20% and happy if it goes up 20%", "score": 5, "replies": []}, {"body": "Nvidia and chill. 😎😌", "score": 9, "replies": []}, {"body": "Goes up? Sell after a week or two before the pattern selling kicks in (depending on earning dates and other news catalysts).\n\nGoes down? Sell the loss on my leveraged nvidia stocks and buy mountains more nividia overtime on dips.", "score": 11, "replies": [{"body": "Nancy bought 10000 shares of Nvdia before. She is a inside trader. She knows something.", "score": 14, "replies": [{"body": "Her husband, Paul Pelosi, owns an INVESTMENT COMPANY.\nDoesn't take a genius to see Nancy gets her info straight from the source. Just like all our Federal elected representatives.\nSend Ossoff has a bill to stop this, of course the Republicans will kill it.", "score": 2, "replies": []}, {"body": "If she knows something, she should buy after NFP yesterday. Buying at 110s and 120s is not wise", "score": 1, "replies": [{"body": "U say that till its at 180-200 lol", "score": 3, "replies": [{"body": "But you can surely agree that buying at $105 would be more profitable, yes?", "score": 2, "replies": [{"body": "Yeah ofc, my original position was 111 then I bought more at 120 and continued to buy the dips. She can’t just time the market and buy the bottom every time, it would be too sus lol", "score": 1, "replies": []}]}]}]}]}]}, {"body": "If it drops 20% I go all in", "score": 4, "replies": []}, {"body": "Jizz everywhere", "score": 5, "replies": []}, {"body": "Lotion and Kleenex", "score": 3, "replies": [{"body": "Please expand on that thought.", "score": 2, "replies": [{"body": "My Dick", "score": 1, "replies": [{"body": "What have I done.", "score": 3, "replies": [{"body": "Whenever I finish…I yell out NVDAAAAAAAAAAAAAAA!!!!!!!!", "score": 2, "replies": [{"body": "Is there any other way?", "score": 3, "replies": [{"body": "Does Jensen ever wear something else other than his Leather Jacket?", "score": 2, "replies": [{"body": "Let me call him really quick to clear things out.", "score": 1, "replies": []}]}]}, {"body": "Oh shit, I thought I was the only one who did that", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Really strange this past week.  Some report Good earnings, but stocks drop.  Need to stay calm  if earning is good but stock goes down.", "score": 3, "replies": [{"body": "In times like these good earnings don’t really make much of a difference. When the market wants to go down it goes down.", "score": 5, "replies": [{"body": "i feel the same. all the insurance bought to protect against downside has to show value. once that’s done, market will get back to exuberance. this whole soft landing is messing up with natural order.", "score": 1, "replies": []}]}]}, {"body": "Too many hungry wolves want to get in on low prices. It would take massive drawbacks to bring the prices down 20%. I think Blackwell delay is already priced in considering the hype. If it dips, it won’t stay there for too long. Maybe I’m wrong.", "score": 4, "replies": [{"body": "There's no Blackwell delay lol. People are still paying for shipped h200 there is no Blackwell production", "score": 0, "replies": [{"body": "There is no delay quit reading click bait hit pieces", "score": 2, "replies": [{"body": "That's my point", "score": 2, "replies": [{"body": "To be fair, I meant to reply to the top level comment", "score": 1, "replies": []}]}]}]}]}, {"body": "I have a sell order in for half my position at $150. I’m way overexposed and will take some profit.", "score": 2, "replies": []}, {"body": "Earnings aren't till August right? Why do they publish earnings two months after the end of the second quarter?", "score": 3, "replies": [{"body": "Tis august now I think earnings on the 28th?", "score": 2, "replies": [{"body": "Ya but isn't the end of the second quarter in June..?\n\nDoes it really take two months to figure all that out and announce it? You'd think you'd want to put it out asap.", "score": 1, "replies": [{"body": "Their quarter end is later. It ends in July, and to account and report on tens of billions of dollars in revenue and expenses takes time to prepare and process.", "score": 2, "replies": [{"body": "Gotcha, that's what I thought", "score": 1, "replies": []}]}, {"body": "FY begins in Feb", "score": 0, "replies": []}]}]}]}, {"body": "Sell, go on vacation, and continue with SP500 ETF...?", "score": 1, "replies": []}, {"body": "My plan is to sell when it gets really high and see if it does the same thing again each quarter if I have the balls of stell", "score": 1, "replies": []}, {"body": "EPs 0.7 30bill over 140$", "score": 1, "replies": []}, {"body": "Laying down on the floor", "score": 1, "replies": []}, {"body": "Start licking windows", "score": 1, "replies": []}, {"body": "I'm just buying calls for 1 week before earnings", "score": 1, "replies": []}, {"body": "Tears - of joy or heartbreak depending…", "score": 1, "replies": []}, {"body": "Still no one has a clue how organizations are going to reap the benefits of AI and billions of $ spent on it.", "score": 0, "replies": [{"body": "No one has a clue but one thing is for sure, companies want to 100% eliminate their payroll and AI/robotics is the only thing out there that has a chance of doing such a thing at the moment", "score": 6, "replies": []}]}, {"body": "already have my call options line up. I don't think this ER  will be bad especially with productions of new stuffs are ramping up. Hopefully, they will include that in this ER to make things more spicy.", "score": 0, "replies": []}, {"body": "I'm still holding my 50% OTM covered calls, so if it moves 20% in either direction I'm happy", "score": 0, "replies": []}, {"body": "Sell on the news!!", "score": 0, "replies": []}, {"body": "Everything in time will be be fine, as another wise one said \" Nvdia and chill \"", "score": 0, "replies": []}, {"body": "people will sell the lead up to, and also after if it pops, \n\nhell, they will sell if it doesn't pop", "score": 0, "replies": []}, {"body": "I'll do some jumping jacks!", "score": 0, "replies": []}, {"body": "-/+50%", "score": 0, "replies": []}, {"body": "Going to $70 a share.", "score": -3, "replies": [{"body": "That’s a perfect opportunity to buy", "score": 5, "replies": []}]}, {"body": "Blackwell design flaw?", "score": -1, "replies": []}]}
