{"title": "Would you buy puts on tesla?", "selftext": "[What do you guys think? ](https://i.imgur.com/YU8lJ0k.jpg)", "id": "auzmcc", "created_utc": 1551188770.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 7, "comments": [{"body": "It just dropped. Why do you think *now* is a good time to buy puts? ", "score": 6, "replies": [{"body": "^^ at LEAST wait for a pullback or another strong strong move downwards.", "score": 2, "replies": [{"body": "Then say to yourself \"It just dropped. Why do you think now is a good time to buy puts?\" wait for a pullback or another strong strong move downwards.\n\nRepeat. Or just all in on the FOMO", "score": 1, "replies": []}]}]}, {"body": "What about buying a call", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "No. They have product announcement tomorrow you idiot.\n\nShort stock when it's above 350$. Although it is certain TSLA will go much higher, it's also certain that I won't happen in 2019 due to their forecast. On the other hand, 2020 will be very tricky to predict.\n\n(I'm long)", "score": 1, "replies": []}, {"body": "Wtf is that image? Dear god. Also, if you’re asking if now is a good time AND the put is contingent on more than a $10 loss on the stock than you’re fuckn dreaming dude. \n\nBut yeah get the put. ", "score": 1, "replies": []}]}
{"title": "Question: What determines how far a stock drops on bad news?", "selftext": "[deleted]", "id": "auulpb", "created_utc": 1551152807.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 12, "comments": [{"body": "There are buyers waiting to buy stocks at lower prices. Think of it as two lines of people facing each other. One of sellers and one of buyers. The buyer and seller closest to each other are trading at the current price. Each buyer behind the first has a lower price that they would buy for and each seller behind the first has a higher price that they higher price that they would sell for. \n\nWhen bad news comes out some of the buyers at the front of the line go home. How far it drops depends on how many buyers go home. There is no formula. Market participants estimate what the bad news does to the price and react. Many times the stock keeps moving because the news gets worse or more information comes out that helps market participants better estimate the impact of the bad news. \n\nIt’s basically supply and demand. Hope this helps. ", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Do you have a formula for how you buy and sell a car?", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "painting the car rusty red doesn't make it worth any less or more (or it shouldn't... much..) though.\n\nIt's condition does - state of engine, wheels, etc\n\nthis translates into stocks as potential growth, expected gains/loss, etc. affecting the stock's value. it's just that unlike a car where you can visually see the state of those core parts, in stocks it's more personal opinion based, which is why there is no 100% telltale sign for how far a stock has deteriorated (drops in value) ", "score": 2, "replies": []}]}]}]}]}, {"body": "Supply and demand literally does determine the price of a stock. If demand for a stock drops a lot, then the stock price is going to drop a lot. The change in demand has a lot of factors, besides bad news.", "score": 2, "replies": []}, {"body": "If it's time for the stock market to make major headlines, then stocks will drop enough to have a -1000 point day on the Dow.  Then a couple days later it'll go up +1200 points because free money from the Fed.", "score": 2, "replies": []}, {"body": "A big difference between TSLA and KHC is that KHC had a bad quarter and slashed their dividend.  Reducing dividend cuts the value of the stock dramatically, hence the crater.", "score": 2, "replies": []}, {"body": "It’s purely based on the market’s reaction. Look at Heinz ", "score": 1, "replies": []}, {"body": "The market estimates the severity of the bad news. Aka what is that news”worth” to the company today and on the future?  \n  \nTSLA down 5% with Musk in trouble? Possible pretty bad news long term, but it isn’t entirely clear that the result will be...  Musk has always been a little out there. \n  \nKHC massive writedown, SEC probe, lowered div, and strong evidence indicating that the overall plan to reform and “fix” the business has been unsuccessful. Loss of confidence in management...  pretty negative.\n  \nIt just depends. ", "score": 1, "replies": []}, {"body": "1% of your decision making should be because of news 99% of their financial statement. KHC didn't drop because of the news but the extremely disappointing quarter.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I don't know of an investor which can't do this in a day? You know the company,Done the research and only have to change the future cash flow.", "score": 1, "replies": []}]}]}, {"body": "See how the volume is at support and resistance levels. Market/volume profile will tell you how much in demand a price level is from previous volume history. These can be and usually are good bottom entry points. Look into POC and TPO. ", "score": 1, "replies": []}]}
{"title": "Sell WMT NOW", "selftext": "[deleted]", "id": "av1w63", "created_utc": 1551201388.0, "score": 0, "upvote_ratio": 0.09, "num_comments": 15, "comments": [{"body": "None of this will even mildly glitch WMT.", "score": 9, "replies": [{"body": "a bad outcome in the trade war/negotiation might... ", "score": 1, "replies": []}]}, {"body": "Do you hold any positions in it or will you be getting any?\n\nAlways announce your bias so we know how to respond. ", "score": 4, "replies": [{"body": "He could easily lie, just tackle it at face value. Shouldn’t make a difference", "score": 3, "replies": [{"body": "Or he could easily man up and be honest about his holdings so we’d know what his angle is, if any.", "score": 0, "replies": []}]}]}, {"body": "Wmt is a consumer staple and are innovative with their curb side pickup", "score": 3, "replies": []}, {"body": "No one should give a shit on what Buffett does anymore.\n\nHe isn't what he used to be. Dude doesn't give a shit anymore, he already won at this game.\n\nMost of his recent investing decisions for the past 5 years or so have been garbage. IBM, Kraft Heinz lmao, buying AAPL super late...etc \n \n", "score": 2, "replies": [{"body": "Still he hasn't lost any money on those stocks and never lost more as 5% on a single stock Buffet is still Buffet.", "score": 1, "replies": [{"body": "Yeah but just cause buffet is buffet doesnt mean you can be you😒 a lot of you losers on here think being like buffet is the golden rule", "score": 1, "replies": [{"body": "Never losing money on a stock is a pretty great record at his age. You don't have to be jealous about it.", "score": 1, "replies": [{"body": "Warren buffet has lost at least 1 trade", "score": 1, "replies": [{"body": "Name one with a higher loss as 5%?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Trash Post. The Wally is here to stay.", "score": 2, "replies": []}, {"body": "Bad PR was a buying opportunity for Apple, Facebook, Johnson & Johnson, the list goes on and that’s only recent examples. I don’t recommend selling because of some bad headlines.", "score": 1, "replies": []}, {"body": "I don't hold any positions in Walmart but at the current market price i would sell. Thanks to Amazon their margins keep decreasing and a once very much profitable business is not that profitable anymore. I do believe that the company won't go anywhere but i don't think it will outperform an sp500 fund.", "score": -1, "replies": []}]}
{"title": "Elon Musk is Guilty - Short $TSLA", "selftext": "[removed]", "id": "auyz3o", "created_utc": 1551184537.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 17, "comments": [{"body": "Uhhh, did you forget the title of this sub?  Aside from the trolls, every here buying the dip, bruh.", "score": 7, "replies": []}, {"body": "😂 I can't wait to see this SEC interpretation (underlined) laughed out of court by the judge. SEC's interpretation, taken to the extremes, means that Elon has to seek approval again in, say, year 2022 if he wants to republish material information that was already published in 2019. 🙄\n\n[Tesla policy & SEC interpretation](https://teslamotorsclub.com/tmc/attachments/upload_2019-2-26_21-46-23-png.380659/) \n\nPoint ii is the relevant section - this should be correctly interpreted as requiring pre-approval AGAIN if there is a delay > 2 days BETWEEN getting pre-approval AND releasing MATERIAL information. (or as per point i, if there are further edits)\n\nOnce the material information is released, only an idiot would interpret as material, re-releasing the same info again! This is as good as saying a photocopy is the same as the original.:rolleyes:\n\nSEC is deliberately misinterpreting and worse, misrepresenting information.", "score": 3, "replies": []}, {"body": "Except the tweet didn’t contain any new material", "score": 6, "replies": [{"body": "It doesn't have to - did you even read?", "score": -4, "replies": [{"body": "‘It doesn’t have to’ in your Elon lynching fantasies ", "score": 11, "replies": [{"body": "'It doesn't have to' in the settlement agreement Musk signed with the SEC.", "score": 1, "replies": [{"body": "Freedom of speech may override that contract though", "score": 2, "replies": [{"body": "No, that is not how the law works.  ", "score": 1, "replies": []}, {"body": "That's the most dumbass thing - I've ever heard. You think freedom of speech overrules gag orders?", "score": 0, "replies": []}]}]}, {"body": "That's your assumption it has to contain new material - the original agreement states nothing of the sort- stop being ignorant. ", "score": 0, "replies": []}]}, {"body": "If the information is not new and was already disclosed on the earning call (which it was) then it was already reviewed and is not reasonably a material statement. It is just repeating information and thus would not require any additional vetting. ", "score": 2, "replies": [{"body": "That's not what the original agreement stated, stop putting your own interpretation on it", "score": 0, "replies": [{"body": "What do you think material means?", "score": 1, "replies": [{"body": "God damn read for yourself and stop being ignorant\n\nhttps://teslamotorsclub.com/tmc/attachments/upload_2019-2-26_21-46-23-png.380659/", "score": 0, "replies": [{"body": "Only if it’s a material statement. Which it’s not. The SEC has no control over any non-material tweets he makes. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "This post has been removed for trolling. Your intention appears to be to get a rise out of Tesla investors and not in engaging in meaningful discussion. ", "score": 1, "replies": []}]}
{"title": "Maxwell shareholders look to abort Tesla deal", "selftext": "", "id": "av2khq", "created_utc": 1551204845.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 21, "comments": [{"body": "How many Maxwell shareholders? I’m going to guess less than 50%, probably significantly.", "score": 14, "replies": [{"body": "Seeking Alpha  \n\nThats all the answer you need.", "score": 22, "replies": [{"body": "But you say that like the news is false. It’s not. What about the source is so bad?\n\nI know some authors post there, with a negative slant. But why does that make the news headlines bad? ", "score": -1, "replies": [{"body": "> But you say that like the news is false. It’s not. What about the source is so bad?\n\nIt's a blog site. It's like citing /r/wallstreetbets. No vetting of articles or half decent editorial oversight whatsoever. Electrek is the WSJ compared to SA.  \n\nYou got one point right - this is an attack on the source rather than the claim. Just answering your question.", "score": 3, "replies": []}, {"body": "SA Editor Clark Schultz is consistently anti-Tesla", "score": 2, "replies": []}]}]}]}, {"body": "> A group of Maxwell shareholders alleges the all-stock acquisition was struck at an \"unfair\" price in an \"unfair\" process.\n\n> Previously: Maxwell +52% after Tesla deal (Feb. 4)\n\nLol", "score": 12, "replies": []}, {"body": "Seeking alpha lolol\n\nBut yea tsla got a good deal, stock got creamed in 18 and tsla bought before could run back to those levels", "score": 9, "replies": [{"body": "> Seeking alpha lolol\n\nIndeed, Seeking Alpha is what many refer to as the plausible deniability \"news\" website started by a convicted stock manipulator, with an explicit editorial policy that doesn't fact check content and allows semi-anonymous contributions.\n\nThere are some good contributors overall, and some of the stocks they are covering fairly, but their Tesla coverage is a breeding ground of $TSLAQ conmen, by a large margin.\n\nThe manipulation is so bad that Seeking Alpha content is banned on Reddit.", "score": 3, "replies": []}, {"body": "Fine, but SeekingAlphas news is pretty good. It’s just the contributors that write articles.\n\n> Tesla’s new battery tech acquisition could be blocked by Maxwell investor class action\n\n\nhttps://electrek.co/2019/02/26/tesla-battery-tech-acquisition-maxwell-investor-class-action/", "score": -8, "replies": [{"body": "Seeking alpha lol for life", "score": 5, "replies": []}]}]}, {"body": "This is unfortunately pretty much standard for any buyout.  Company might settle to throw a few bucks at the lawyers to make this go away, but this is no big deal.", "score": 12, "replies": [{"body": "> Company might settle to throw a few bucks at the lawyers to make this go away, but this is no big deal.\n\nFirst instance in a long time I agree with you: these days it's much easier to count corporate mergers that are ***not*** sued by ambulance chasing firms.\n\nIn fact I'd argue that mergers where shareholders do not sue are much more likely to be duds where the acquiring company overpaid: \"They *really* want to buy our company? Where do I sign??\" 😉", "score": 2, "replies": [{"body": "97% of mergers have some sort of lawsuit associated with them.", "score": 1, "replies": []}]}]}, {"body": "I don’t give clicks to seeking alpha anymore sorry", "score": 2, "replies": []}, {"body": "Did this go through?", "score": 1, "replies": []}, {"body": "**Maxwell shareholders look to abort Tesla deal**\n\n• A class action filed in a San Diego federal court aims to stop the takeover of Maxwell Technologies (MXWL -0.1%) by Tesla (TSLA).\n\n• A group of Maxwell shareholders alleges the all-stock acquisition was struck at an \"unfair\" price in an \"unfair\" process.\n\n• Previously: Maxwell +52% after Tesla deal (Feb. 4)\n\n• Previously: Cowen points to Tesla-Maxwell synergy (Feb. 4)", "score": -3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I hope that’s not his day job but he keeps this forum going. He’s like 80% of the posts. He posts and responds to himself, it’s pretty rad. ", "score": 2, "replies": []}, {"body": "That’s an odd position, this is on topic. It affects the stock, and the acquisition.", "score": 1, "replies": []}, {"body": "I can't stop laughing when people expect this user /u/flufferbot01 is a paid short. Just shows the delusion of some Tesla longs/fanboys.", "score": -1, "replies": [{"body": "Thank you ", "score": -1, "replies": []}]}]}]}]}
{"title": "any possibility of a recovery back to $54-$56 for $Shak, tomorrow morning?", "selftext": "[removed]", "id": "auu46r", "created_utc": 1551149876.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 19, "comments": [{"body": "I'll go get a burger tmrw for lunch to help your cause ", "score": 4, "replies": [{"body": "Buy a Coke for me and daddy Buffy while you're there.", "score": 1, "replies": []}]}, {"body": "Someone bought calls", "score": 3, "replies": [{"body": "why yes,yes i did.", "score": 1, "replies": [{"body": "How many. I’m tied up in other shit so I bought one hahaha", "score": 1, "replies": [{"body": "25 @54.5 3/1", "score": 1, "replies": []}]}]}]}, {"body": "No, stock is garbage. Valuation way too high for a burger joint", "score": 3, "replies": [{"body": "agreed,but im only in it to get out of it at $55 to recover lost profit ", "score": 0, "replies": [{"body": "Understandable, but that mentality of “recovering lost profits” will fuck you in the long run. Good luck Kurt ", "score": 4, "replies": [{"body": "Putting this one in my pocket , Howie ", "score": 2, "replies": []}]}]}, {"body": "Chipotle is 15x for burritos though?", "score": 0, "replies": [{"body": "Have you ever had a chipotle burrito? Argument over. JK, I’m not bullish on CMG either, never said I was so don’t see the relevance. Plus, one could argue Chipotle’s a unique restaurant in the sense that they provide “healthy” options at a quick and affordable cost. SHAK is just another burger joint with marginally better burgers then the next place in town. Also, SHAK is valued as though it’s going to take over the Midwest, but lemme tell you as a midwestern man that Culver’s will forever reign supreme. Don’t even know why I entertained this, as I would not be a buyer of either company, but at least CMG is offering something that is hard to replicate. SHAK has to compete with mom and pop burger joints, the big fast food companies, and other pricey franchise burger joints. I don’t know many mom and pop shops who are in the non-GMO quick service Mexican food business. ", "score": 3, "replies": [{"body": "Wisconsin boi, can confirm we are creatures of extreme state loyalty, you’ll never compete with Culver’s here.", "score": 2, "replies": [{"body": "big facts", "score": 1, "replies": []}]}]}]}]}, {"body": "They got chicken nuggies now so there's clear upside potential", "score": 2, "replies": [{"body": "Whoa. Nobody told me they had chicken nuggies. That’s easy money for sure.  Going all in on the open tomorrow ", "score": 1, "replies": []}]}, {"body": "Maybe ", "score": 1, "replies": [{"body": "you 2 huh?", "score": 1, "replies": []}]}, {"body": "Shake and burger shortage in Venezuela will get you your 7.5% pop tomorrow for sure.", "score": 1, "replies": []}]}
{"title": "\"SEC Asks Manhattan Federal Court to Hold Elon Musk in Contempt\" for not getting permission to tweet what he had already said on the Q4 2018 conference call. Tesla falls 2% after hours despite tariff de-escalation. 2nd time SEC sues Elon? Of course they do it after hours RIGHT after the trade deal.", "selftext": "", "id": "auuu1z", "created_utc": 1551154224.0, "score": 102, "upvote_ratio": 0.93, "num_comments": 14, "comments": [{"body": "Tesla Production stats:\n\n[https://www.reddit.com/r/wallstreetbets/comments/aqgkhk/tesla\\_car\\_production\\_delivery\\_sales\\_revenue\\_cost/](https://www.reddit.com/r/wallstreetbets/comments/aqgkhk/tesla_car_production_delivery_sales_revenue_cost/)\n\n&#x200B;\n\nTesla VIN stats:\n\n[https://www.reddit.com/r/wallstreetbets/comments/ardrol/did\\_you\\_see\\_model\\_3\\_vins\\_website\\_looks\\_like\\_tesla/](https://www.reddit.com/r/wallstreetbets/comments/ardrol/did_you_see_model_3_vins_website_looks_like_tesla/)\n\n&#x200B;\n\nTesla quarterly update letters all summarized:\n\n[https://www.reddit.com/r/wallstreetbets/comments/aobvgf/i\\_read\\_through\\_every\\_tesla\\_quarterly\\_update/](https://www.reddit.com/r/wallstreetbets/comments/aobvgf/i_read_through_every_tesla_quarterly_update/)", "score": 18, "replies": [{"body": "Lmao yea I’m sure the Chinese prefer American dick head arrogance brands like tsla over pure bread German engineering. Even the TTM street shitters going to load those spoiled Chinese up with more range rovers than they can handle while tsla keeps building suvs that look like a Prius with 20 inch rims   ", "score": 2, "replies": []}]}, {"body": "Solid post with amazing data so you got my +1, but why two shades of blue? Would be easier to read with a different color. ", "score": 12, "replies": []}, {"body": "I don’t understand why the SEC would need to sue him. Aren’t they a fucking enforcement agency? Can’t they just headlock someone if they see fit?", "score": 5, "replies": []}, {"body": "500k is a lot different than 350-500k. \n\nRegardless, it's clear he wasn't abiding by the settlement that everything needed to be pre-approved by GC. Otherwise GC wouldn't have resigned.", "score": 5, "replies": []}, {"body": "Did you make these graphs?", "score": 2, "replies": [{"body": "Yea", "score": 4, "replies": [{"body": "Then enjoy your gold. ", "score": 1, "replies": []}]}]}, {"body": "To be fair there wasn’t a trade deal yet, just delayed. Might not miss out on much, which means a lot of my fellow autists on this sub will probably go YOLO right about now. ", "score": 2, "replies": []}, {"body": "Bro what in the FUCK am I looking at. Just tell me to buy calls/puts", "score": 3, "replies": []}, {"body": "There's a trade deal??", "score": 1, "replies": []}, {"body": "Please note revenue growth rate was set to 100% instead of:\n\n431% for 2013 vs 2012 for Honda in sept. quarter\n\n891% for 2014 vs 2013 for Honda December quater.\n\n1419% 2013 vs 2012 Ford June quarter\n\n760.90% 2013 vs 2012 Tesla September quarter\n\n1762.27% 2013 vs 2012 Tesla March quarter\n\n1420% 2013 vs 2012 Tesla June quarter.\n\n&#x200B;\n\nI set them to 100% because it skewed the graph and I could figure out how to set breaks on line graphs because Excel sucks.\n\n&#x200B;\n\nPlease note I used the FX conversion rate for JPY for Honda and Toyota as of 2-23 or 2-24-2019 and EUR for Volkwagen for same day instead of converting using the rate as of quarter end because I wanted a rough estimate with all companies in USD currency. All #s are in millions of USD", "score": 1, "replies": []}, {"body": "The dude needs to turn over control of the company to someone that knows what they're doing. \n\nHe'll be able to focus on Space X and R&D and tweet to his heart's content", "score": -5, "replies": [{"body": "Perhaps you didn’t understand the post, Elon literally did nothing wrong (it was old already public info), the SEC fucked up by making a (false) accusation against him causing the stock to tank. If anything the SEC should be the ones in trouble here", "score": 0, "replies": []}]}]}
{"title": "Who needs Tesla when NIO shoots through the roof?", "selftext": "", "id": "av0to9", "created_utc": 1551195876.0, "score": 11, "upvote_ratio": 1.0, "num_comments": 16, "comments": [{"body": "Bought some calls yesterday ", "score": 6, "replies": []}, {"body": "It just keeps going up. ", "score": 2, "replies": [{"body": "*ding ding ding* 10$", "score": 2, "replies": [{"body": "Omg. ", "score": 2, "replies": []}]}]}, {"body": "Had calls that I got out of this morning. Was trying to hide NIO share prices from my sight so that I wouldn’t see the extra tendies I left on the table. Thanks a lot for the newly developed fomo. 20% profits not good enough.", "score": 2, "replies": [{"body": "Congrats! I bought at 8$ but I wait with selling till a real hype occurs.", "score": 1, "replies": []}]}, {"body": "If this is the early stages of a bubble. Like the amd to 30$ one. How long are we looking for that 25$ price? ", "score": 2, "replies": [{"body": "I guess this will become a bubble. As soon as NIO gets enough attention from the media the price will rocket up. I don't know yet when I'll sell, I prefer to observe the curve.", "score": 3, "replies": [{"body": "I followed up and looked at the most recent bubbles. And I'm thinking we might see nio pull a tilray", "score": 1, "replies": []}]}]}, {"body": "This shit is going up so fast the IV is going down on my shitty calls! ", "score": 1, "replies": []}, {"body": "What you guys think it will pull back at? ", "score": 1, "replies": [{"body": "I actually never believed it would go so far. 10.50 maybe? (At least for today)", "score": 1, "replies": []}]}, {"body": "im doubling down on puts until i profit. NIO is gonna get sued if people don't realize this Chinese knockoff is a garbage company first. ", "score": 1, "replies": [{"body": "I think they've done their best so far. But surely it's still a long way to become a company like Tesla. Nevertheless I by myself am not thinking of betting on put yet. In my eyes NIO is not yet enough overvalued for that.", "score": 1, "replies": []}]}, {"body": "Meanwhile NIO passed the 10.50 mark", "score": 1, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Click here to find more YOLOs](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3AYOLO). \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}
{"title": "Just saw this on Twitter, long $TSLA?", "selftext": "[removed]", "id": "av5tkm", "created_utc": 1551221787.0, "score": 31, "upvote_ratio": 0.85, "num_comments": 9, "comments": [{"body": "Your title is stupid but the chart is amusing ", "score": 8, "replies": [{"body": "Well guess which one was the OC", "score": 4, "replies": []}]}, {"body": "Gotta provide the [source](https://twitter.com/enn_nafnlaus/status/1100525747607953409?s=21)", "score": 2, "replies": []}, {"body": "This is the most retarded thing I've seen in this sub yet.", "score": 1, "replies": []}, {"body": "The real question is where is the civil lawsuit from shorts who lost billions because of his misleading 4:20 tweet.", "score": 0, "replies": [{"body": "They're filed in SDNY, like virtually every other shareholder suit. I'm not sure what you're asking when you say \"where,\" though.", "score": 1, "replies": [{"body": "I meant where in the sense of when is it gonna make the news. I was wondering when it was gonna happen and how much, so I guess it is underway.", "score": 1, "replies": [{"body": "The first ones were filed literally days after the funding secured tweet. It was definitely in the news, you just weren't paying attention, and could've resolved this question on your own in less than 10 seconds by googling.", "score": 1, "replies": [{"body": "Why google when I can have you do the work for me.", "score": 1, "replies": []}]}]}]}]}]}
