{"title": "Apple stock", "selftext": "[deleted]", "id": "aqajpq", "created_utc": 1550086909.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 7, "comments": [{"body": "Christ ", "score": 6, "replies": [{"body": "Agreed", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Why do you think strangers on Reddit are a good source with making important investment decisions?", "score": 2, "replies": []}]}]}, {"body": "Apple is almost the biggest company in the world and your first thought is to do your DD on reddit?\n\nSave Reddit for small/medium cap advice and then do the opposite.", "score": 1, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "I am getting it. You’re not getting it.", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I’m ignoring your request. I am getting it. You’re not getting why.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Lmao nice delete", "score": 1, "replies": []}]}]}]}]}]}]}]}
{"title": "Elon Musk, Joe Rogan insider trading?", "selftext": "I don't know how to answer this and was curious what you guys thought. So i'm sure we're all aware of the scandal when Elon Musk went on the Joe Rogan podcast and smoked weed. Tesla's stock dropped 12% the next day as a direct result of their CEO's actionss. \n\nMy question is, what if Joe Rogan had shorted Tesla stock before the interview with the intention of Musk smoking weed on his podcast? Is that considered insider trading? Or illegal in some way? ", "id": "aqb8oq", "created_utc": 1550090593.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 10, "comments": [{"body": "I think you’re lost, try the below sub. \n\n/r/conspiracy \n\n", "score": 11, "replies": [{"body": "HA that's pretty funny. Genuinely curious though and most people here seem to know their stuff. Last time I posted it went well so thought i'd give it a shot!", "score": -2, "replies": [{"body": "if somebody took action to manipulate the price of a stock where they would profit, for sure. \n\nJust a funny story. You smoke? Buy high and sell high 🔥", "score": 2, "replies": [{"body": "Get high profits ", "score": 1, "replies": []}]}]}]}, {"body": "Let say I'm Joe Rogan, I don't see how this is insider trading. I may short TSLA prior to the interview and ask negatively leading questions regarding TSLA but it's not like it's insider trading. \n\n\nWhat if I buy calls and ask positive leading question????", "score": 3, "replies": []}, {"body": "He addressed this on another one of his podcasts , im having trouble finding a clip of it but Joe was saying one of the guys was very worried about the SEC getting onto them for market manipilation or something\n\nEdit: FOUND IT!\nhttps://m.youtube.com/watch?v=lHFndUYt9G4", "score": 3, "replies": []}, {"body": "It would be in a gray area.  \n\nBecause Rogan did not \"know\" Musk would do something stupid like that on air, it probably would not technically be insider trading if he had shorted it before the interview.\n\nIf Musk told Rogan he was going to smoke weed on the show and not the general public, and then Rogan shorted the stock on that info, that would possibly be a case of insider trading.  \n\n", "score": 1, "replies": []}, {"body": "not going to lie, i dont think joe is smart enough to know how to short a stock. even though he could google it, but from his interviews he seems to never google anything", "score": 1, "replies": []}, {"body": "Imagine being so retarded that your best trading strategy is to short the companies that you’re going to be working with in the near future because the retardation is guaranteed to wear off.", "score": 0, "replies": []}]}
{"title": "Unreal Engine Adds Ray Tracing Support Giving NVIDIA RTX GPUs a Shot in the Arm", "selftext": "", "id": "aqaoe7", "created_utc": 1550087562.0, "score": 14, "upvote_ratio": 0.79, "num_comments": 10, "comments": [{"body": "Sounds like good news, but Unreal Engine isn’t what it use to be. Don’t get tricked.", "score": 11, "replies": [{"body": "UE isn’t what it used to be? What do you mean?", "score": 7, "replies": [{"body": "I’m not sure what he means, it’s not the near monopoly in the triple a industry anymore, but it’s still the engine used by the majority of triple a releases, and has a growing indie segment as people get tired of unity’s bullshit", "score": 4, "replies": [{"body": "Majority is considerably pushing it. Besides Fortnite in 2018, what other big games ran Unreal? \n\nThere’s much more competition in engines now, and more in-house engines as well. Like I said, it’s good news, but I wouldn’t be ecstatic about this.", "score": 4, "replies": [{"body": "Unity will follow suit.     \n    \nThey'll have to -- else the memes begin.", "score": 5, "replies": [{"body": "Currently using both engines. Both have their place for different types of games. Just my opinion.", "score": 1, "replies": []}]}, {"body": "PUBG?", "score": 1, "replies": []}]}]}]}]}, {"body": "This is honestly pretty big for NVDA because there will finally be games that make use of the RT cores in the RTX series cards. Maybe this card generation can be saved after all.", "score": 2, "replies": [{"body": "Tell that to my calls I just bought an hour ago right before that 2% selloff 😂", "score": 8, "replies": []}]}, {"body": "Great, hoping raytracing and raymarching get to be more common on GPUs so that scene rending can become way more parallel. Then they'll be able to make cards with loads and loads of GPU cores and spread the load out better and have really great scenery.\n\n&#x200B;", "score": 1, "replies": []}]}
{"title": "Ex-Apple Exec Who Oversaw Insider Trading Policy Profited On Inside Info, SEC Says", "selftext": "", "id": "aqbv92", "created_utc": 1550093929.0, "score": 98, "upvote_ratio": 0.98, "num_comments": 18, "comments": [{"body": "I’ll never understand the multi millionaires making obvious insider trades to save themselves from a couple hundred thousand in paper losses. I hope this bitch gets 5years in the slammer.\n\nSummary: dude had $10 million in Apple stock. Insider traded to save himself $200,000 in short term losses. What a clown.", "score": 62, "replies": [{"body": "Allegedly* \n\nHa-ha.", "score": 16, "replies": []}, {"body": "The numbers get bigger, but the percentages stay the same.", "score": 4, "replies": []}, {"body": "I know, if you know AAPL is going to go down why not just buy puts as a hedge ", "score": -7, "replies": [{"body": "That’s still insider trading ", "score": 18, "replies": []}, {"body": "Son, delete this. ", "score": 6, "replies": []}, {"body": "Oh man.", "score": 1, "replies": []}, {"body": "There, there, my boy...", "score": 1, "replies": []}, {"body": "Mychal Kendricks wants to know your location ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Everyone caught for insider trading is barred from the industry. Only question is jail or fine. ", "score": 5, "replies": []}, {"body": "Source? Just curious ", "score": 3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Oh shit, how did I miss this. Why the fuck do these guys always get caught for such small amounts of money? ", "score": 1, "replies": []}]}]}, {"body": "Link?", "score": 1, "replies": []}]}, {"body": "Ironic he could save others from death, but not himself", "score": 11, "replies": [{"body": "Moronic ", "score": 5, "replies": []}]}, {"body": "This is seriously stupid. Where did they find this guy? He had a job working as Apple's senior director of corporate law and decided to blow it all because he didn’t want to see his $10m in stock drop 4% due to earning. lol. My account easily sees swings of 4% per day. What an absolute fool.", "score": 4, "replies": []}, {"body": "If his dumbass just held he would’ve been fine.", "score": 2, "replies": []}, {"body": "This guy sucks but I mean am I wrong assuming hedgies do this all the time with much larger sums and the SEC turns a blind eye because it's easier to take down a dude like this?", "score": 1, "replies": []}]}
