{"title": "This is It for Gold", "selftext": "For those that follow me regularly, you will know that I have been tracking a set-up for the SPDR Gold Trust ETF (NYSEARCA:GLD), which I analyze as a proxy for the gold market. I also believe that gold can outperform the general equity market once we confirm a long-term break out has begun, and I still think we can see it in occur in 2018. This week, I will provide an update to GLD.\n\nWhile I have gone on record as to why I do not think GLD ETF is a wise long-term investment hold, I still use it to track the market movements. For those that have not seen my webinar about why I don’t think the GLD is a wise long-term investment, feel free to review this link for my webinar on the matter. https://www.elliottwavetrader.net/videos/201411131445.html\n\nFor the last year and a half, the metals complex has frustrated everyone who has invested in the complex with a sideways consolidation. Many have been certain that it is setting us up to break below $1,000 gold, and the voices for that have been getting louder and more numerous.\n\nAs I noted to the members of ElliottWaveTrader:\n\n“Calls for sub $1,000 gold are being heard quite loudly. Many are 'feeling' that the metals bear market has not ended. And, we have the usual suspects who have been terribly whipsawed in this market following trendline analysis highlighting the current trend line break down again. Isn’t this all too familiar to you already? \n\n\"Each time this has happened over the last two years, the metals have staged a “surprising” rally to the upside. Yes, when the beachball gets pushed too far down, it is bound to rise to the surface, and often with strong force. And, with this market only going sideways for well over a year, there does not seem to be many left who are looking higher in this market. But, that is how major rallies begin – when most are looking lower or are completely disinterested. Major rallies often begin with the fewest passengers aboard the train.\"\n\nAs I looked around the web on Friday, I felt quite lonely maintaining an expectation for an imminent bottom in the metals complex. While most of the market is totally disgusted with the lack of movement in the complex for the last year and a half, and whereas the great majority of the market seems quite bearish (other than the perma-bulls), it is hard to see how the market is going to accelerate lower from here. Rather, I think the signs are pointing to the market bottoming rather than heading to sub-$1000 gold, which many believe is imminent.\n\nFor the two weeks before the last downside was seen in the metals complex, I warned my members that we will likely test support in the complex, as the market had a short-term downside setup in place:\n\n“At the end of the day, we still have immediate set ups, as noted above, which are pointing a bit lower in the complex . . . until the market takes out the noted resistance, we have to respect the micro set ups which are pointing a bit lower before the next rally takes hold.”\n\nCurrently, we have almost reached those support levels to which we were pointing weeks ago. For those that have read my metals analysis over the last few months, you would know that my perspective has been that, as long as GLD holds the 119 support region, we still have a very powerful rally setup in place. And, as long as GLD holds that 119 region as support, the market still retains a set up to rally strongly towards the 150 region in 2018. It would take a break down below 117.40 to invalidate that immediate setup, but a sustained break down below 119 would begin to get me concerned.\n\nAnd, since we deal in probabilities and not certainties when analyzing financial markets, we have to maintain an objective perspective to understand if the market will follow through on the setups we see, or if they will invalidate those setups. Many took me to task for being too bearish in the metals complex until the end of 2015. But, once the structure pointed to a major low being near, I turned quite bullish, and even rolled out the EWT Miners Portfolio in September 2015 as a new service to the members of my trading room, and began to buy mining stocks which looked to have bottomed. I think we all know how that turned out.\n\nIn fact, I wrote this in public articles at the end of 2015:\n\n\"As we move into 2016, I believe there is a greater than 80% probability that we finally see a long term bottom formed in the metals and miners and the long term bull market resumes. Those that followed our advice in 2011, and moved out of this market for the correction we expected, are now moving back into this market as we approach the long term bottom. In 2011, before gold even topped, we set our ideal target for this correction in the $700-$1,000 region in gold. We are now reaching our ideal target region, and the pattern we have developed over the last 4 years is just about complete. . . For those interested in my advice, I would highly suggest you start moving back into this market with your long term money . . .\"\n\nSo, for me, it is all about what the market is telling me from an objective standpoint. Remember, we have been strongly, and correctly, bullish the stock market when many others have been quite bearish, especially in early 2016, when we were looking for a test of the 1800 region before we expected the market to rally to 2600+. And, that has served us quite well.\n\nWhile I certainly could not foresee the complex moving sideways for almost two years (as I am only an analyst and not a prophet), at least for now I will have to retain a bullish bias of the GLD for as long as the 119 region holds as support. And, it looks like the next few weeks will tell us if the market will follow through on this pattern or not. Should we see such follow through, it will likely take most by surprise, as they have been lulled to sleep over the last two years by the price action in the complex. Yet, this is how markets seem to work. The train often leaves the station with the fewest possible passengers aboard. And, then, as they say, the chase is on.\n", "id": "8tmv5x", "created_utc": 1529892439.0, "score": 17, "upvote_ratio": 0.65, "num_comments": 68, "comments": [{"body": "Can you give us a short and sweet summary? ", "score": 23, "replies": [{"body": "TL;DR Gold is a good buy now, probably, or maybe wait a few weeks, it's hard to say. ", "score": 48, "replies": [{"body": "Tldr:  stocks can go up or down", "score": 21, "replies": []}]}, {"body": "* GLD is not gold. \n* Gold is widely hated as an asset, which is bullish. \n* OP has been publicly anticipating a bottom in gold for years, and is finally declaring the bottom is in. ", "score": 4, "replies": []}]}, {"body": "Is this not considering shilling or advertising? Damn long read for not much actual worth. ", "score": 39, "replies": [{"body": "He's given his full view for free. Why are you begrudging the inclusion of a link?", "score": -1, "replies": [{"body": "If it's worthless, it doesn't matter if it's free or not. He doesn't join in the conversation or start any talks. He strictly posts his website and some wall of text that's worthless. Half of his posts are fearmongering and the other half is bulling gld while both are hoping to drive traffic to his website which doesn't have any worthwhile information or new thought. He almost strictly posts during dips or corrections hoping to get scared money to listen to him. ", "score": 4, "replies": [{"body": "Worthless is just your opinion. You're entitled to it.", "score": -2, "replies": [{"body": "Yeah, well that's just, like, your opinion man. ", "score": 4, "replies": [{"body": "Nobody forced you to read it if you didn't like it. ", "score": -1, "replies": []}, {"body": "Do you even have a point?", "score": -2, "replies": [{"body": "Nobody forced you to read it yet here you are. If you ignore predatory shilling just because you don't think it is then... well sucks to be you i guess. If someone strictly posts during downswing, always links to his benefit, and never adds to the conversation, then that's the type of person you don't want here. They'll overreact the newbies and weakhands and those are the exact people he is hoping to benefit off of. If you can't understand how that's a problem then shit man, you're beyond help. Or it's actually your account. ", "score": 4, "replies": [{"body": "ldtenterro\n\nbefore you opine about what I am doing here, I suggest you actually learn a bit more about me.   You are clearly impugning my character with your posts, and you  do not know me, nor do you know my work.   So, I would suggest you learn more about me and my work before you start posting \"crap\" like this.\n\nI challenge you to find any metals analyst who has been more accurate than I have been over the last 7 years that I have been publishing my analysis.\n\nUntil such time that you can prove otherwise - which you will not be able to do - I suggest you take your false implications about me elsewhere.", "score": 0, "replies": [{"body": "Read my lips. I don't care. You post during downswings in hopes of scaring newbies into clicking on your site. You do not join the conversation or further any topic that's not your business. Your only comments are effectively telling people to go to your site. Your post is only this long because you need to get around Rule 2. \n\nIf you act like a scummy salesman, why would anyone care to look at your background.\n\nYou are such a professional that there are six errors and two misspellings in your writing. I challenge you to write like a professional and suggest you try to be a member of the community before trying to use said community as a cold calling station.\n\nAs, i told the other guy, thanks for the genuine laugh. Seeing this reply in my inbox was actually chuckle worthy start to the morning. ", "score": 1, "replies": [{"body": "Sir,  I post my public analysis all the times.  Just because YOU read it during a downswing does not mean that I only post during downswings.\n\nBut, since it is illegal in your view to be posting articles if one runs a business, then I am certainly glad I do not live in the country you run.   Since I live in America and, as far as I know, I am not doing anything against the law by owning a website and posting articles as well, then I will continue along my merry way.   If you take issue with that, you may want to simply ignore me.\n\nFor those that do follow me, you would know that most have the same opinion of me as what some of our 450+ money manager clients have noted:\n\n“I see the best quants, strategists and technicians the street has and you and your group are amongst the absolute best. My trading desk is floored at turning levels you are able to provide.”\n\n“Joining EWT, and using it to be a better portfolio manager has been the smartest thing I’ve ever done in my 30-year career. Not only is it another great tool in my toolbox, it has become the single most important tool.”\n\n“I've worked on the street for about 15yrs and the analysts here are better than most I've worked with. You guys balance the emotions with your thesis, and are extremely diligent in your process. It's been a pleasure and quite profitable following your work. Thank You!”\n\nSo, while you may disagree with them, and you are entitled to do so, I suggest you refrain from impugning my good name in this industry with your use of innuendo and false attacks.  ", "score": 1, "replies": []}]}]}, {"body": "Who gives a crap about newbies and weak hands? Who the hell do you think I make money off? And who appointed you God of this sub? Nobody.", "score": -1, "replies": [{"body": "Bahaha so you're one of those idiots who believe the market is a zero sum game **and** you have such an amazingly unique thoughts and knowledge that sharing it will end your investment. If a newbie can understand your astonishingly game changing idea off of a reddit comment or decipher what you have uncovered from a few sentences then guess what? It is also useless information you so endearingly hold. \n\n[MFW idiots think they are geniuses](https://media.giphy.com/media/jQmVFypWInKCc/giphy.gif)\n\nI'm done with you. Thanks for the legitimate chuckle though. ", "score": 3, "replies": [{"body": "No, you are the idiot. Try learning how to read.", "score": 1, "replies": [{"body": "I am seriously amazed at some of the things you guys post.\n\nIf you do not get anything out of this article, then you clearly are not reading the article.\n\nMoreover, if you think I fear monger, then you are clearly not reading my articles.\n\nI was appropriately bearish at the highs in 2011 - calling the top within $6 of the actual high struck, and then appropriately bullish in late 2015.\n\nIn fact, this is what our broker has said about us:\n\n“Your timing on buying the dips is uncanny Avi! People should be aware of this if you don't mind. . . I can attest to your accuracy on actually buying both gold and silver from us as close to the bottom as one could. With gold you called it to the letter and your limit order which was placed well in advance executed perfectly. The silver limit orders were within a tight range of the lows as well.”\nDoug Eberhardt of Buygoldandsilversafely.com\n\nSo, before you post \"crap\" about us which is completely not true,. please get your facts straight about my record in this market.\n\nThanks!!", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "> I am only an analyst and not a prophet\n\n\nThis post is long on text and short on analysis. I respect your right to have a view, and for your \"system\" to generate positive investor returns over time, but to be pursuasive it has to be more than just \"having the feels\". ", "score": 8, "replies": [{"body": "Maybe you should actually read the article before posting something like this.", "score": -1, "replies": [{"body": "Given that I quoted a sentence from the last paragraph, maybe you should assume that I have.\n\n\nNot only that but I also summarised your wall of text into one sentence: You \"feel\" the time is right to buy gold. Now you may or may not be right but it is not a persuasive argument to me. Let's break down what you wrote:\n\n\n> For those that follow me regularly, you will know that I have been tracking a set-up for the SPDR Gold Trust ETF (NYSEARCA:GLD), which I analyze as a proxy for the gold market. I also believe that gold can outperform the general equity market once we confirm a long-term break out has begun, and I still think we can see it in occur in 2018. This week, I will provide an update to GLD.\n\n\nYou think that gold will outperform the general equity market once we start to see it beginning to outperform. Got it. Mind you, have you ever thought that it might underperform once we start to see it beginning to outperform?\n\n\n> While I have gone on record as to why I do not think GLD ETF is a wise long-term investment hold, I still use it to track the market movements. For those that have not seen my webinar about why I don’t think the GLD is a wise long-term investment, feel free to review this link for my webinar on the matter. https://www.elliottwavetrader.net/videos/201411131445.html\n\n\nSo you are using an instrument to track whether you are right or not that you wouldn’t advocate investing in. Got it. Still not analysis.\n\n\n> For the last year and a half, the metals complex has frustrated everyone who has invested in the complex with a sideways consolidation. Many have been certain that it is setting us up to break below $1,000 gold, and the voices for that have been getting louder and more numerous.\n\n\nFalse narrative. Gold has broadly traded in the $1100-1400 range for over 4 years but you’ve no idea who has been frustrated by this. The guy who bought at the beginning of 2016 below $1100 is probably not unhappy. The jeweller that has to buy gold for his raw materials is also alright with the price stability. Almost certainly one can find online posts from people expecting gold to fall below $1,000 but where is the analysis that it is getting “louder and more numerous”? And what is the implication even if proven that they are?\n\n\n> As I noted to the members of ElliottWaveTrader: “Calls for sub $1,000 gold are being heard quite loudly. Many are 'feeling' that the metals bear market has not ended. And, we have the usual suspects who have been terribly whipsawed in this market following trendline analysis highlighting the current trend line break down again. Isn’t this all too familiar to you already?\n\n\nSame deal – still no analysis.\n\n \n> \"Each time this has happened over the last two years, the metals have staged a “surprising” rally to the upside. \n\n\nFinally, a hint of some analysis – except that you haven’t defined what “this” is so we don’t know whether “this” is happening again. I suspect you make “this” whatever you want it to be so effectively you are saying that every time is goes down a bit it goes back up a bit.\n\n\n> Yes, when the beachball gets pushed too far down, it is bound to rise to the surface, and often with strong force.\n\n\nNice visual – priming your prospective customer for a surge in the share price. You haven’t said what beachballs have to do with the gold price though so we have to assume that it’s an analogy rather than analysis.\n\n\n> And, with this market only going sideways for well over a year, there does not seem to be many left who are looking higher in this market. But, that is how major rallies begin – when most are looking lower or are completely disinterested. Major rallies often begin with the fewest passengers aboard the train.\"\n\n\nHow do you know there aren’t many left looking higher in this market? Is it based upon evidence? Have you done a survey? Is this based on analysis or just your opinion again?\n“Major rallies often begin with the fewest passengers aboard the train.\" ????? Riddle me this Batman – if hardly anyone is owning gold, who owns the gold that is out there? Are there little ownerless golden sheep wandering around waiting for someone to come along and pluck them up?\n\n\n> As I looked around the web on Friday, I felt quite lonely maintaining an expectation for an imminent bottom in the metals complex.\n\n\nEven assuming that you accessed all of the web and it’s gold commentary, how much of the gold trading market does the “web” represent? Same deal though – no analysis, just feels.\n\n\n> While most of the market is totally disgusted with the lack of movement in the complex for the last year and a half, and whereas the great majority of the market seems quite bearish (other than the perma-bulls), it is hard to see how the market is going to accelerate lower from here.\n\n\nIs the market disgusted? Any evidence to support this? No analysis, just feels. At this point, I’m just going to use the acronym “NAJF” for this because it’s going to get used a lot.\n\n\n> Rather, I think the signs are pointing to the market bottoming rather than heading to sub-$1000 gold, which many believe is imminent.\n\n\nNAJF\n\n\n> For the two weeks before the last downside was seen in the metals complex, I warned my members that we will likely test support in the complex, as the market had a short-term downside setup in place:\n\n\nNAJF. You may have the best spidey-sense in the world and be brilliant at market timing – but it has all been JUST FEELS so far.\n\n\n> “At the end of the day, we still have immediate set ups, as noted above, which are pointing a bit lower in the complex . . . until the market takes out the noted resistance, we have to respect the micro set ups which are pointing a bit lower before the next rally takes hold.”\n\n\nThis is not analysis but it is interesting. You’re saying you think it will go up but there are indications that it might go down and we should respect that. Tides go in, tides go out – you can’t explain that!!!\n\n\n> Currently, we have almost reached those support levels to which we were pointing weeks ago. For those that have read my metals analysis over the last few months, you would know that my perspective has been that, as long as GLD holds the 119 support region, we still have a very powerful rally setup in place. And, as long as GLD holds that 119 region as support, the market still retains a set up to rally strongly towards the 150 region in 2018. It would take a break down below 117.40 to invalidate that immediate setup, but a sustained break down below 119 would begin to get me concerned.\n\n\nNAJF. “As long as it doesn’t go down, I think it’s going up”.\n\n\n> And, since we deal in probabilities and not certainties when analyzing financial markets, we have to maintain an objective perspective to understand if the market will follow through on the setups we see, or if they will invalidate those setups. Many took me to task for being too bearish in the metals complex until the end of 2015. But, once the structure pointed to a major low being near, I turned quite bullish, and even rolled out the EWT Miners Portfolio in September 2015 as a new service to the members of my trading room, and began to buy mining stocks which looked to have bottomed. I think we all know how that turned out.\n\n\nNAJF. “But look! I was right before so trust me!”\n\n\n> In fact, I wrote this in public articles at the end of 2015: \"As we move into 2016, I believe there is a greater than 80% probability that we finally see a long term bottom formed in the metals and miners and the long term bull market resumes. Those that followed our advice in 2011, and moved out of this market for the correction we expected, are now moving back into this market as we approach the long term bottom. In 2011, before gold even topped, we set our ideal target for this correction in the $700-$1,000 region in gold. We are now reaching our ideal target region, and the pattern we have developed over the last 4 years is just about complete. . . For those interested in my advice, I would highly suggest you start moving back into this market with your long term money . . .\"\n\n\nNAJF. “I was right before so trust me!”\n\n\n> So, for me, it is all about what the market is telling me from an objective standpoint. Remember, we have been strongly, and correctly, bullish the stock market when many others have been quite bearish, especially in early 2016, when we were looking for a test of the 1800 region before we expected the market to rally to 2600+. And, that has served us quite well.\n\n\nNAJF. “I was right before so trust me!”\n\n\n> While I certainly could not foresee the complex moving sideways for almost two years (as I am only an analyst and not a prophet), at least for now I will have to retain a bullish bias of the GLD for as long as the 119 region holds as support.\n\n\nNAJF. “I got the last 2 years wrong but now I’m going to be right so trust me!”\n\n\n> And, it looks like the next few weeks will tell us if the market will follow through on this pattern or not. Should we see such follow through, it will likely take most by surprise, as they have been lulled to sleep over the last two years by the price action in the complex. Yet, this is how markets seem to work. The train often leaves the station with the fewest possible passengers aboard. And, then, as they say, the chase is on\n\n\nYou already used the train thing. Still no analysis.\n\n\n", "score": 3, "replies": [{"body": "\"Any fool can criticize, condemn and complain and most fools do.\"\n\nBen Franklin\n\nAnd, if you do not believe my PUBLIC ARTICLES does not represent analysis, then I suggest you simply stop reading me.  ", "score": 0, "replies": [{"body": "> \"Any fool can criticize, condemn and complain and most fools do.\"\nBen Franklin\n\nA logical fallacy. So you're saying that no-one is allowed to criticise you, or if they do they are a fool? What if your prediction is wrong? Would that still make me a fool? When you take a counter position to the bears on gold, are you not inherently criticising their position?\n\n\nIs sticking Ben Franklin's name after the quote supposed to impress me or make me decide I was wrong to criticise you? It doesn't - it just makes me think that you are a thin-skinned commentator who blushes rather visibly when their bullshit is called on.\n\n\nAs an aside, I have made zero comment regarding whether I think you will be proved right or not. My comments have been entirely to do with your lack of justification for your prediction.\n\n\nI haven't read any of your other articles, I am merely commenting on the public article that you posted above. Your other articles could be as insightful as Buffett or Graham but I'm not writing about them, I'm writing about this one.\n\n\nIf you can't take valid criticism then either improve your analysis so that you don't get so much of it or don't post at all.", "score": 2, "replies": []}]}]}]}]}, {"body": "The DJI growth relative to gold has been in an uptrend since 2011. The last cycle was 20 years (1980-2000). So that implies equities will out perform gold if the current trend continues. Just a bearish view to consider. ", "score": 3, "replies": [{"body": "Can be, unless there will be a major downturn - in that case all analysis goes out of the window.", "score": 2, "replies": [{"body": "If there is a major downturn I would see the relationship between the two switch and the trend invert. That’s what this type of analysis is for, to be able to identify when the trend changes.\n\nLike after 2000 when the trend inverted you could have still bought gold between $300-$400 an ounce up to 2005. ", "score": 1, "replies": [{"body": "Cause and causality may, or may not be true - I'd say that gold (usually) tracks the weighted USD average, which coincidentally started to decline after 2000.\n\nMy point was rather that there is no reliable silver bullet that predicts a crisis - it only seems evident in the aftermath, never before.", "score": 1, "replies": [{"body": "I see what your saying but I’m not trying to predict anything. I’m comparing two equities against each other and identifying which one is currently performing better. You can see the chart I linked to below.\n\nhttps://www.tradingview.com/i/wYqEmFzg/\n\nThe author of this post is using TA, so I am using a trend analysis to compare GOLD to equities. Gold is not outperforming equities until that trend breaks. \n\nFrom a TA perspective I would not be bullish on gold until I see that trend line break. Which is why I said it’s the bearish case for gold.", "score": 1, "replies": [{"body": "Fair enough - I also accepted the fact that on the long run gold is being outperformed, I only went overweight gold as I started trading last year only and figured I can wait until something hits the fan.", "score": 1, "replies": [{"body": "I bought my children a host of miner stocks at the end of 2015 . . . those accounts are now up over 100%, even after this pullback.  So, you tell me if they are \"underperforming?\"  :)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You should read the intelligent investor.  Your logic is incorrect. ", "score": 2, "replies": [{"body": "I’m looking at current relationship between two assets on a chart, DJI/XAUUSD . There is nothing incorrect with what I said, it’s fact.\n\nBut if gold starts out performing the market you will see the current trend reverse. No guarantees on when/if  the trend will change but currently equities have outperformed gold since 2011.", "score": 0, "replies": []}]}]}, {"body": "Man I hope your right.  I work at a physical PM company and boy are we hurting.  Only so many can be laid off.", "score": 2, "replies": [{"body": "Sorry to hear. It's a shame the metals can't hold gains and continue runs during breakouts anymore ", "score": 3, "replies": []}, {"body": "Ouch. The mining industry has had a rough few years.", "score": 1, "replies": []}]}, {"body": "Gold is *extremely* overvalued. Pass", "score": 2, "replies": [{"body": "By what metric is it overvalued?  It's wayyy undervalued imo.  Scarcity and all that jazz.", "score": 1, "replies": [{"body": "It is actually a pretty cool metal that can be quite useful in many cases and it is rare. The problem is that a lot of misinformed people invest in it just to hold it which is about the dumbest possible thing you can do with gold. It has been a miserable long term investment despite being propped up by what I would refer to as ignorant demand. If it isn't driving economic output and/or pumping out dividends it's a loser.", "score": 4, "replies": [{"body": "It's an easy way to diversify 1-2% of your assets. That's about it.", "score": 2, "replies": []}, {"body": "I think the demand for it comes from the fact that it's uses and rarity have meant it holds value better than other commodities over time.  Look at nearly every other metal and they are worth less over time.  Gold more or less holds its value.  Personally, I'd buy a bond if I just wanted to hold the value of my money, but gold is great for people who don't trust government.  That's why it's always being advertised on Fox News and conservative radio.  It has a market that's half rational and half political.", "score": 1, "replies": [{"body": "I prefer gold as a hedge against the next downturn for the fact that it cannot be created out of thin air. Bonds won't protect you against inflation and people seem to forget we are on the uncharted waters of the unprecedented monetary expansion.", "score": 1, "replies": [{"body": "As long as the economy and population growth you should be in a time of unprecidented monetary expansion.  Otherwise you'll experience deflation which is basically economic death because it encourages keeping you money in cash instead of investing or purchasing.  As far as historical inflation goes, we're actually experiencing close to ideal rates and the fed is turning monetary spigots down with interest rate increases.  So I'd say at this exact moments not buying bonds because of inflation is pretty non-sensical.  Especially when the value gold over time has been relatively consistent as a security.  You might read the classic Warren Buffet article on how inflation hurts equity investors because the same thing but more so is true of gold investment.", "score": 1, "replies": [{"body": "I'd say if stockmarket and housing bubble way exceeds real growth, with unsustainable debt, then at the very least there must be huge imbalances in the world economy. Inflation may appear low, but that is because of the basket excludes housing. I am no doomsday believer, but I think it is highly unlikely that we have arrived into the economic nirvana of goldilocks.", "score": 1, "replies": []}]}]}]}, {"body": "I can't say whether or not it's overvalued, but I will say that owning gold is one part of Ray Dalio's all weather portfolio. So it isn't just for out of touch ignorant people.", "score": 1, "replies": []}, {"body": ">ignorant demand\n\nScarcity isn't ignorant demand, it is a theoretical mathematical conflict over the entire supply.\n\nIt doesn't need to pump out dividends to appreciate, there is a market for it like any other market.  It goes up, it goes down depending on supply and demand like anything else.\n\nDividends are a terribly inefficient waste.  I don't have any tax to pay to hold my gold indefinitely, that I'm already up a good at least 20 bucks per 1/10th oz (good luck getting similar returns from bond interest or dividends in the same amount of time for a similar capital investment).", "score": 0, "replies": [{"body": "The scarcity is real. The fact that people buy it just to hold it when it generates no income is the delusion. Gold *should* be like any other raw material... You buy it to use it - not store it indefinitely. Clearly this delusion isn't going away for the foreseeable future but that doesn't matter in my mind. It still underperforms productive assets badly. Even with the delusion propping the demand up. I honestly think you'd have to be crazy to feed into that nonsense.", "score": 3, "replies": [{"body": ">  I honestly think you'd have to be crazy to feed into that nonsense.\n\nSo the people who trade futures contracts for gold are crazy?  ...Or is it just another market like any other....\n\nYou cannot transfer stocks very easily, I can hand a gold coin to someone.  \n\nStocks can go out of business, there is no business for gold to go out of.", "score": 1, "replies": [{"body": "If you have a diverse selection of stocks you kick the crap out of gold because gold just sits there and produces nothing. As for people that trade gold are they crazy? Who knows maybe they're just opportunists. The people that hold gold long-term as an investment, however, are not too bright.", "score": 2, "replies": []}]}]}]}]}, {"body": "Scarcity with respect to what", "score": 1, "replies": [{"body": "Paper gold is something like 100x the value of physical gold currently accounted for. If something happens that causes redemption of the physical gold, most people that think they own it will be left with nothing more than a piece of paper. Also probably why OP doesn't think GLD is a good way to own gold.", "score": 2, "replies": []}, {"body": "….Scarcity with respect to the amount mined up relative to other precious metals....", "score": -1, "replies": []}]}]}]}, {"body": "I have been holding GLD for a while and I'm amazed the value has been holding very steady... I don't plan on selling.. I look at it as portfolio insurance.. everyone needs some ", "score": 2, "replies": []}, {"body": "I've heard CEF hold physical gold and silver for you, even though it trades as an ETF. \n\n\n\nAnybody confirm/deny?\n\nAre there other ETFs than can do that?", "score": 1, "replies": []}, {"body": "Gold are not going up anytime soon in times when credits are available.", "score": 1, "replies": []}, {"body": "Lmao, go buy gold then.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "There's only one gold. There's at least 100 Bitcoin wannabes that all claim to be better than one another with no really discernable differences. Some of them might be better than gold, but what sure your chances of picking the right ones? You're taking on the risk of an untested asset class *as well as* the risk of selection.", "score": 5, "replies": [{"body": "[removed]", "score": -5, "replies": [{"body": "You're not what? I didn't call you anything", "score": 2, "replies": [{"body": "I followed you. You just can't speak ill of bitcoin on here is why he is confused. \n\nI'd never own bitcoin, gold is unlikely holding but not never (girlfriend has a necklace come to think of it). I am buying up defensive stocks and a couple of bets on high debt companies as I believe inflation will hiccup pretty high and run above average for the Next several years. ", "score": 1, "replies": [{"body": "Which high debt companies did you find compelling? ", "score": 1, "replies": [{"body": "T and DUK", "score": 1, "replies": []}]}]}, {"body": "when you used the generic \"you're,\" he thought you were referring to him specifically.", "score": 1, "replies": [{"body": "I see the confusion. Still don't see why he/she got defensive since he specifically asked why bitcoin *instead* of gold and I answered that question directly.", "score": 1, "replies": []}]}]}]}]}, {"body": "Gold has proven to be valuable in all markets for all of human history.  It's a low volatility vehicle for people to hedge their portfolios.  Bitcoin is high volatility investment on the downswing of a bubble that has proven to have a reslient downward tail.  If you're replacing your gold with Bitcoin you definitely don't understand one commodity or the other.", "score": 1, "replies": []}]}, {"body": "Folks, I would suggest you actually learn about my record in this market before you post disparaging comments to my articles.\n\nWe called the high in 2011 within $6 of the actual high struck.  We then nailed the bottom so well at the end of 2015 that our broker wrote this about us:\n\n“Your timing on buying the dips is uncanny Avi! People should be aware of this if you don't mind. . . I can attest to your accuracy on actually buying both gold and silver from us as close to the bottom as one could. With gold you called it to the letter and your limit order which was placed well in advance executed perfectly. The silver limit orders were within a tight range of the lows as well.”\nDoug Eberhardt of Buygoldandsilversafely.com\n\nSo, before you disparage me, maybe you need to consider that we have done better in this complex than most in the market.  ", "score": 0, "replies": []}]}
{"title": "Netflix down 6% so far this morning", "selftext": "[deleted]", "id": "8tqwjd", "created_utc": 1529936626.0, "score": 45, "upvote_ratio": 0.77, "num_comments": 58, "comments": [{"body": "Seems like the whole tech market is down today. ", "score": 106, "replies": []}, {"body": "Trump said he was going to curb Chinese investment in U.S. tech.  So, pretty much all tech is getting hit.", "score": 45, "replies": [{"body": "He said that this morning?\n\nI've already heard that there has been massive pullout of chinese money in other investment sections.   They have a FUCKTON of money in real estate, too, so that could be another landmine we walk over.", "score": 16, "replies": [{"body": "God I wish Trudeau would do this. China basically owns Canada at this point", "score": 24, "replies": [{"body": "Yeah, I know that in Portland at least, wealthy chinese investors are soaking up all the free real estate available, sitting on it and letting apartments sit vacant during a housing crises and refusing to lower rental rates, etc.\n\nIt's fucking maddening.", "score": 18, "replies": []}, {"body": "We should just sell them all our real estate and then switch to Georgism. Imagine paying zero income taxes while foreign landowners are stuck with the bill:D", "score": 3, "replies": []}, {"body": "It makes me so jealous that Americans have trump while we have a virtue signalling neo con that is content with selling us out. ", "score": -19, "replies": [{"body": "As opposed to a whiney man-baby who sells you out?", "score": 3, "replies": [{"body": "He’s not selling shit out. Jobs and investment in US is at an all time high, he’s trying to correct trade imbalances and bring back manufacturing, and trying to curb unfettered mass illegal migration. This is all amazing for the country and it’s citizens and those who are choosing proper legal channels to immigrate to try and better themselves and their families.", "score": -4, "replies": [{"body": "How is Trump bringing back manufacturing when even Harley-Davidson, an iconic American company, is moving its production out of the US because of his policies and tariffs? ", "score": 5, "replies": [{"body": "Ah, one example of a lackluster motorcycle company moving one factory to Europe that was highlighted by CNN all day. I see where you get your news from LOL.", "score": -3, "replies": [{"body": "So give us some examples of large American companies that are moving their manufacturing back to the US due to a direct cause from Trump's tariffs", "score": 2, "replies": [{"body": "That steel company just announced their spending 2 or 3b to open up a steel mill in Idaho I believe l. ", "score": 0, "replies": [{"body": "Fuck off ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 55, "replies": [{"body": "I will be very satisfied with my purchases at the end of the week then. I usually view crises like these as temporary setbacks that people overreact to making it the perfect time to buy. \n\nDisclaimer: Sometimes you are burnt and they are not temporary.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Yeah I just don't look these days ", "score": 9, "replies": [{"body": "I'm just becoming desensitized to it. Dow and SP is down 1.5% and it isn't really freaking me out. I closed out my calls early this morning and picked up some puts on SPY and MU \n", "score": 4, "replies": [{"body": "I get locked up. I can't make any moves :/", "score": 1, "replies": []}]}, {"body": "hmm good call on not looking at it. every morning i've been getting mild anxiety from this shit.", "score": 2, "replies": [{"body": "Then you shouldn’t be so exposed. Be smart, invest easy and smart with a few ‘fun’ plays. ", "score": 1, "replies": [{"body": "Hence the \"good call on not looking at it everyday\" ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The stock is up, what, 100% this year? Its honestly about time it dropped off some. It can't go up every day forever ", "score": 18, "replies": []}, {"body": "I'll take it at $330", "score": 8, "replies": [{"body": "You haven't seen the bottom yet my friend. ", "score": 1, "replies": [{"body": "Should take over a week \n\n330 may not be the bottom but I can't catch the exact bottom \n\nAt 330 I won't be red on it for more than a few months ", "score": 3, "replies": [{"body": "Fair enough. I think Trumps manipulation of the market is going to have cumulative effects though. People are going to start exiting the market altogether. ", "score": 1, "replies": [{"body": "For a while. Then they'll come back in as they realize it's no big deal and that China will capitulate", "score": 5, "replies": []}]}]}]}]}, {"body": "https://i.redd.it/cnh5aptdc0611.jpg", "score": 7, "replies": []}, {"body": "In 2 weeks, we'll be at the high again. No biggies.", "score": 8, "replies": [{"body": "is now a buying opportunity then?", "score": 7, "replies": [{"body": "Potentially ", "score": 5, "replies": [{"body": "I got back in this afternoon just because of this. It’ll hit $420 by the end of July, prob a couple times.", "score": 3, "replies": []}]}, {"body": "Netflix stock on sale! ", "score": 1, "replies": []}]}]}, {"body": "Damn it I should've bought those puts...", "score": 2, "replies": []}, {"body": "Buy moar", "score": 2, "replies": []}, {"body": "It's a good pullback honestly, if you're a long term holder.  Without a pullback/consolidation, this thing is most definitely parabolic.", "score": 2, "replies": []}, {"body": "Last week of the quarter, hedge funds are booking profits now and taking off early for the holiday this weekend.\n\n\nSeriously though, this has been due for some profit taking for a while.  We're right where we were this time last week and that was coming off +10% run up in the first two weeks of the month.  Price target adjustments were overdue which fueled last week's rise and honestly, it probably doesn't hurt to have things cool down a little bit before earnings next month. ", "score": 6, "replies": [{"body": "Yeah, definitely buying calls Before end of week", "score": 2, "replies": []}, {"body": "A 12% correction is healthy. Prepare to be able to run a marathon ", "score": 1, "replies": []}]}, {"body": "Can you guess when it went up so hard ? I think this is just a selloff and should bounce back up eventually.", "score": 4, "replies": [{"body": "It went up after their impressive Q1 profits and increased subscriber growth. ", "score": 2, "replies": [{"body": "I don't disagree with that, with high PE stocks this kind of stuff is normal.  Afterall it's high growth high risk stock.", "score": 1, "replies": []}]}]}, {"body": "End of the quarter... people are cashing out.", "score": 3, "replies": []}, {"body": "Make that 6.51% down ", "score": 1, "replies": []}, {"body": "7% now ", "score": 1, "replies": []}, {"body": "7.12% down \n\nWhat do you think it'll be at close? 7.5%\n\nCould the  selloff at the close could push it to -8.00%", "score": 1, "replies": []}, {"body": "shorting till 370 :) hold me", "score": 1, "replies": []}, {"body": "Netflix up 600% so far since 2014. ", "score": 1, "replies": []}, {"body": "only 9% to go", "score": 1, "replies": [{"body": "Until?", "score": 2, "replies": [{"body": "Just gotta keep an eye on it.  And the market as a whole, and the news", "score": 1, "replies": []}, {"body": "Hype", "score": 1, "replies": []}]}]}, {"body": "6.22% down...so far\n\nHeavy institutional selling so watch out below ", "score": 0, "replies": []}, {"body": "Everything is down. Your Netflix investment doesn’t make you special ", "score": -27, "replies": [{"body": "[deleted]", "score": 27, "replies": [{"body": "There’s already a post about Netflix specifically. There are 10 other posts about things being down. \n\n\nA simple google search. Or maybe just opening up literally any stock app can tell you the answer. \n\n\nIf the guy is asking this question he should just sell. It’s not meant to be. ", "score": -18, "replies": [{"body": "I’m guessing you bought in at $415 last week and now you’re just mad at everyone talking about the company? ", "score": 2, "replies": [{"body": "No because Netflix is overpriced. Sorry you’re upset about your loss though. ", "score": -11, "replies": []}]}]}]}]}, {"body": "Hold onto your dicks. Between the resignation and the Trade War™ this sucker's gonna tank", "score": -1, "replies": []}]}
