{"title": "AMD put holder thread 6/12", "selftext": "", "id": "8qjebl", "created_utc": 1528814010.0, "score": 23, "upvote_ratio": 0.88, "num_comments": 61, "comments": [{"body": "I have 7/20s I’ll hang out till this balloon pops thanks very much ", "score": 23, "replies": [{"body": "I'm just buying more at this point for 7/20. Got them all the way down to $11 strikes. ", "score": 7, "replies": [{"body": "F", "score": 5, "replies": [{"body": "No.", "score": 1, "replies": [{"body": "F", "score": 4, "replies": [{"body": "This is our safe space dammit!", "score": 4, "replies": []}, {"body": "F", "score": 1, "replies": []}]}, {"body": "I hope you average down till you are all so you lose everything", "score": 0, "replies": []}, {"body": "I hope you average down till you are all so you lose everything", "score": 0, "replies": []}]}]}]}]}, {"body": "I bought some puts today. Fuck it we'll do it live. ", "score": 16, "replies": []}, {"body": "I'm up 10% should I sell? /s\n\nIt's goin down, I'm yellin timber, you better move, you better dance", "score": 11, "replies": []}, {"body": "YOLOing $14p for 6/15. Fml", "score": 8, "replies": [{"body": "14p 10/19 I think I'll be okay. ", "score": 3, "replies": []}, {"body": "rip", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 12, "replies": [{"body": "They haven't been competitive for about 5 years, but in the last year or so have been very competitive.\n\nTheir cpus are on par with Intel and gpu have been ok but seem like they are about to get a decent leap.\n\nBecause their cpus are better now companies like dell are gateway are putting amd cpus in their better laptops. Intel has pretty much dominated laptops for years except a few weak alternatives for amd.\n\n\nSo, basically, company is doing much better so stock price rises ", "score": 11, "replies": [{"body": "I’m not buying it. I think this is another fake out because I haven’t seen anything fundamentally different except some segment of the market suddenly convincing themselves that AMD is about to leap past Intel.\n\nPeople seem to underestimate the importance of marketing and name brand that Intel has which gives it much better pricing power not to mention there is zero evidence that AMD is actually significantly taking share from Intel who completely dominates the market. At this point it all seems like speculation. Once people who have been piling into the stock for the past month realize that it’s going to come crashing down IMO. ", "score": 3, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "[deleted]", "score": -1, "replies": []}, {"body": "I don’t, no. This week I’ve seen Intel get hammered and AMD spike and I assume it’s because reports are coming in that suggest AMD will steal share from Intel because of the 10nm delay. Add to that the supposed comments made by Kryzanich about competition in the later half of the year and it all feels like an overreaction based on nothing people want to run with. Personally I think Kryzanich is sandbagging and knows they are about to blow earnings out of the water (again). I’ve been adding to my INTC calls this week (Oct expiration). Will be interesting to see what happens.", "score": -2, "replies": [{"body": "Why is royally fucking up now considered 3D chess, designed to build confidence in your competition, but really a trap that will be sprung at an opportune time in the future? Trump’s America is retarded.  ", "score": 3, "replies": [{"body": "Sorry where did they royally fuck up? As I recall they’ve crushed earnings for the past several quarters and the stock is up about 75% in the last 12 months.\n\nActually, nope just checked my account and it looks like indeed they have not fucked up.\n\nMost people can’t seem to separate fundamentals from noise, it’s not really 3D chess. Talk to me when they revise down full year guidance and/or miss a number.", "score": -2, "replies": [{"body": "See you in a few weeks.  Krzanich’s retarded comments yesterday about market share were just a prelude to more bad news.  Even meeting expectations would be a negative for them in this environment of actually having a competitor.  The mkt will chase the growth.  \n\nOh, the royal fuck up was resting on their laurels, like you are doing with your portfolio’s past performance.  ", "score": 2, "replies": [{"body": "That’s fine I don’t take it personally. I don’t work for intel and Kryzanich isn’t my daddy. Like I said if they revise down or the story changes I’ll cut my position. I don’t see any evidence at this point that that’s going to happen. We can revisit in a few weeks.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "> People seem to underestimate the importance of marketing and name brand that Intel has which gives it much better pricing power not to mention there is zero evidence that AMD is actually significantly taking share from Intel who completely dominates the market.\n\nDude, AMD didn't just come out of nowhere. They have been around for 40 years. First gigahertz CPU, first 64-bit desktop CPU.. Just folks who are nostalgic about having an AMD powered computer again alone and its pent up demand is significant.\n\nHow do you explain 40+% market share in DIY? https://imgur.com/a/PIKGs#pw25T7W\n\nAlso look at the avg. rating and the sheer number of reviews on this AMD laptop: https://www.bestbuy.com/site/hp-envy-x360-2-in-1-15-6-touch-screen-laptop-amd-ryzen-5-8gb-memory-1tb-hard-drive-hp-finish-in-dark-ash-silver/6124570.p?skuId=6124570\n\nAlso people running datacenters don't give a shit about marketing. AMD is seriously doing amazing stuff here. And that's only with their first iteration on Zen. Zen2.. is going to completely blow Intel out of the water and it's coming in about 8 months.", "score": 6, "replies": [{"body": "I disagree. First, DIY and the laptop market in general is a dying animal and is not why Intel stock has rallied in the last year. It’s all about the data center and there I think name brand matters a lot. \n\nAs one piece of evidence, the market barely reacted when Apple reported they were moving away from Intel starting 2019.\n\nHow do you sell cloud servers to enterprise customers? By leading them to believe you are running the best hardware and software. AMD May have chips that are on par with Intel but it doesn’t matter if the people buying them want Intel. Intel spends billions on marketing to convince customers their chips are the best and that’s very difficult for AMD to overcome. Looking at it that way it becomes easier to understand why AMD has been able to make inroads into the laptop market and hasn’t had as much growth in the data center.", "score": 1, "replies": [{"body": "> I disagree. First, DIY and the laptop market in general is a dying animal and is not why Intel stock has rallied in the last year. It’s all about the data center and there I think name brand matters a lot. \n\nI work in this industry. Datacenter doesn't care about the brand in the least. Particularly hyperscale Super 8 cloud providers. Perhaps you aren't going to convince an enterprise customer to switch to AMD.. but enterprise customers almost don't even matter to AMD. Hyper-scale cloud it's where it's at, because that's where the major expansion is happening. AMD can offer 2-3 times more IO, and similar performance for half the price. Zen2 on 7nm will offer all that, plus more performance and about 30% better perf/watt.. which is the #1 thing datacenter cares about.\n\nThe original Opteron captured 25% of the market, and it was a flash in the pan type product, before cloud even existed. Zen has a multi-generational roadmap. \n\n> As one piece of evidence, the market barely reacted when Apple reported they were moving away from Intel starting 2019.\n\nApple's entire contract is worth about $1.5B in revenue to Intel. It's a nice chunk but not a game changer.\n\n> How do you sell cloud servers to enterprise customers? \n\nYou are not selling them servers. You are selling them cloud services or virtualized instances.. the customer doesn't get access to the bare metal. That's the whole thing with cloud. The customer doesn't want to even think about bare metal. When you as an enterprise customer go to Microsoft Azure for a Hadoop cluster, you are not told what hardware it runs on, because it's not your job to care about those SLAs, it's Microsoft's job. That's the selling point. And Azure has already started adopting Epyc in their datacenters.\n\nReddit for instance runs on Amazon's AWS. Reddit wouldn't even know when Amazon migrates their instances to Epyc. What do they care? as long as the service is up?\n\nAlso even if they do care, these people are informed. They know that Epyc is based on Zen, which is arguably the best CPU architecture on the market. And AMD has already announcement engagement with all the major cloud providers. So this is already old news.", "score": 1, "replies": [{"body": "I also work in this industry so let’s agree to disagree on some of these points. When I sell AWS services to an enterprise customer they care about reliability and so implementation teams do care about bare metal.\n\nGo to https://aws.amazon.com/ec2/instance-types and take note of the first bullet point for each type of instance. I don’t think they are listing specific brand and model numbers because purchasing decisions don’t consider bare metal.\n\nI think what AMD has is a lot of potential but people who are piling into the stock in the past month are greatly underestimating the time required to build the brand equity Intel has.", "score": 1, "replies": []}]}, {"body": "Data center has a much longer adoption cycle. AMD market share was at 1&#37; around the beginning of 2018. Krzanich says Intel's job is to make sure they don't get above 15\\-20&#37;. That doesn't sound to you like AMD is posing a serious threat??", "score": 1, "replies": [{"body": "No because (and I admit this is just my speculative opinion) Intel leadership has an incentive to make things sound more questionable than they probably are so they have a lower bar to clear when they report earnings. Leadership also said that the FY guidance remains unchanged because the AMD threat has been factored in. I think it’d be a mistake to read too much into comments made in a single quote. \n\nIf they lowered guidance that’d be a different story for sure.", "score": 1, "replies": [{"body": "Fair enough. These next couple quarters will tell a lot.", "score": 0, "replies": []}]}]}]}]}, {"body": "> People seem to underestimate the importance of marketing and name brand that Intel has which gives it much better pricing power not to mention there is zero evidence that AMD is actually significantly taking share from Intel who completely dominates the market. At this point it all seems like speculation. Once people who have been piling into the stock for the past month realize that \n\n\nI agree for most of us that know something about tech, but go and ask a non-techy person the laptop or desktop they have.\nThey will hardly say Intel, or NVidia. They will just say HP, Acer, MacBook, etc. That's the brand name they will follow.   \nI've known computer science major students that would answer me their laptop is HP, it would drive me nuts when they couldn't tell the difference between ram and hard disk space. \n\n\n", "score": 2, "replies": []}, {"body": "Exactly, AMD is in a nice position right now but they won't sustain a high valuation until they prove their growth with ERs, as well as give a long term plan now that one of their biggest talent left for Intel.", "score": 0, "replies": [{"body": "Wat. They've been destroying ERs for quite a few quarters now. Their stock value has been sitting low for no reason except what a lot of people have suspected to be market manipulation.", "score": 2, "replies": [{"body": "lmao  \n  \nYou have a very different definition of \"destroying ERs\" from me and the rest of the market.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Mine expired worthless lul", "score": 4, "replies": []}, {"body": "How are you morons still alive ? Every fucking dip has been bought up violently for the past month lol...and even when it does dip, it's barely a percent.", "score": 11, "replies": [{"body": "This time is different.\n\nPs\\- last dip was 5&#37;", "score": 12, "replies": [{"body": "And it got bought up how hard?", "score": 4, "replies": [{"body": "Not enough to break $16....dayyyum son rekt.", "score": 11, "replies": []}]}]}, {"body": "Well i got 10/19 $15s, so i kinda feel like im watching from the sidelines. Have fun in the short term though [with this news of AMD pushing back new GPUS](https://wccftech.com/exclusive-amd-navi-gpu-roadmap-cost-zen/)", "score": 5, "replies": []}, {"body": "There are dozens of us!", "score": 3, "replies": []}, {"body": ">for the past month", "score": 1, "replies": [{"body": "Trend is your friend", "score": 1, "replies": [{"body": "oh so buy high?", "score": 2, "replies": [{"body": "Motherfucker this is low compared the sector...it just now hit high of last year...\n\nY'all dumbasses act like there's some serious downside here. There's not much...it would have broke through and fell under $14 last week if there was a fundamental reason to sell...there isn't, get on the train or get fucked. \n\n", "score": 0, "replies": [{"body": "where was your dumbass when it got rejected like a bitch the past year at 14", "score": 2, "replies": [{"body": "Riding the trend with puts lmao.\n\nTrends change...it's not forever going to go buy $12 and under sell $13 and over...", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Can’t wait for tomorrow", "score": 3, "replies": [{"body": "Any reason why? I need a fucking catalyst for this thing to drop.", "score": 2, "replies": [{"body": "The volatility in opening times -13.5% to +6% suggest it’s going to either skyrocket or drop, but historical indicators say it’s going up", "score": 3, "replies": []}]}]}, {"body": "AMD put holder suicide thread FTFY\n\nChances my 6/15 15.5 puts breakeven at 14.64? Cmon 10% crash", "score": 3, "replies": []}, {"body": "Bought $15.5 calls on the cheap and sold them before breaking even to buy puts. FUCK MY LIFE.", "score": 3, "replies": []}, {"body": "I have puts for July but I regret that choice, forgive me Bae.", "score": 2, "replies": []}, {"body": "Big fan of puts here.\n\nSince we're a contingent group of WSB, we should join the calls. Then when Wsb is 100% bullish the stock will drop because who wants to be associated with us put holders? Classic bull-trap.", "score": 2, "replies": []}, {"body": "Triple top on the daily, ready those puts boys", "score": 2, "replies": [{"body": "Ready the lube", "score": 3, "replies": []}]}, {"body": "If AMD breaks $16 I'll buy puts but now? yall cray", "score": 2, "replies": []}, {"body": "im down a good 67&#37; on 6/29s. FML ", "score": 2, "replies": []}]}
