{"title": "Next Week earnings for the degenerate gamblers who have any money left after going all in on NFLX puts -> $GOOGL $CMG $INTC $WIX $AMZN", "selftext": "", "id": "6ovc6j", "created_utc": 1500734801.0, "score": 786, "upvote_ratio": 0.93, "num_comments": 209, "comments": [{"body": "1065 companies reporting this week vs. 332 last week", "score": 133, "replies": [{"body": "You thought last week and the week before were crazy? Get your butt hole ready.", "score": 65, "replies": [{"body": "Been grabbing my ankles for at least the past 7 days", "score": 54, "replies": [{"body": "I was grabbing my phone to call my broker but I guess this works too.", "score": 1, "replies": []}]}]}]}, {"body": "Holy fuck this week is stacked", "score": 72, "replies": [{"body": "Strip club with a million singles(or 20s if your a baller)", "score": 27, "replies": [{"body": "(Or  20 singles if you're on WSB)", "score": 23, "replies": [{"body": "Bag full of pennies and a early 90's Civic Hatchback. ", "score": 12, "replies": [{"body": "Ballin on a budget ", "score": 3, "replies": []}]}]}, {"body": "Or a rope", "score": 3, "replies": []}]}]}, {"body": "Earnings porno", "score": 144, "replies": []}, {"body": "[the only ones that matter](http://i.imgur.com/njCJzYc.jpg)", "score": 92, "replies": [{"body": "Please please please let NOK go up. It is shitting the bed lately. ", "score": 16, "replies": [{"body": "sell it and take one for the team! ", "score": 8, "replies": [{"body": "...huh?\n\nI bought in at like 5.4 and bought some options recently after the big dip. I am not losing money on this stock yet, but I am worried. ", "score": 5, "replies": [{"body": "Proof or petition to ban", "score": 9, "replies": [{"body": "Is that a thing here? Can't talk about your positions without proof? \n\nhttp://imgur.com/6kDfxGT", "score": 11, "replies": [{"body": "Only if you're OP or claiming a big position. He's really just hitting on ya.", "score": 12, "replies": []}, {"body": "It's expected if you're bragging about your dick size or pretending to know what you're talking about.", "score": 3, "replies": [{"body": "Was I bragging? I'm honestly curious if that's how it came across. ", "score": 3, "replies": [{"body": "No, just telling you that's what the \"rule\" was. The other guy was being hyper serious about it as a joke.", "score": 6, "replies": []}]}]}, {"body": "If I had a nickel for every time someone said to ban me I'd have 10 nickels.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Just...\"word of mouth\" shit. Kinda looked like it had potential major upside. \n\nBelieve me...I am giving it like a 50-50 shot. Which isn't exactly great in such a bull market. I'm kind of an idiot I guess. What do you think about the stock?\n", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You just admitted you have no knowledge of Nokia's business, or even took the time too look at their financial statements. How can you have any sort of opinion?", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Why would you buy a buissness without looking at their financials? They could be on the verge of bankruptcy, but their business sounds good so you invest?\n\nDidn't mean to trigger you, but what you are saying makes zero sense...\n\n>so you're telling me every investor can't potentially invest into a company without understanding their financial(s)\n\nNo, but if you want to know what you're investing in then that's probably something you'd want to take a look at. \n\nYou think Warren Buffet became a billionare investor by NOT reading financials? Or he just bought businesses based on gut feeling, or because the business sounded good?\n\n>Try not to invest into a company unless you read through every single financial statement and earnings report\n\nThat's exactly what I enjoy doing, I like to make informed decisions as an investor to minimize my risk. It's necessary to read the quarterly and annual reports as an active investor. \n\nMaybe you are ok with not knowing anything about the financial standing if your business but to me (and professional analysts) it's very important information.\n\nAlso, notice how I didn't personally insult you.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The ~~joke~~ sad reality is when we buy a stock it crashes, when we sell it soars.", "score": 1, "replies": []}]}]}]}, {"body": "You forgot Amazon", "score": 3, "replies": []}, {"body": "You forgot Paypal*", "score": 1, "replies": []}]}, {"body": "Alright how do I lose money", "score": 33, "replies": [{"body": "Listen to 70% of the people that have posted", "score": 37, "replies": [{"body": "Ok so who is the 30%?", "score": 3, "replies": [{"body": "They broke even", "score": 3, "replies": [{"body": "That sounds like my kind of investment. ", "score": 3, "replies": []}]}]}]}, {"body": "$TQQQ", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "... if you BUY options.\n\nSell them instead. :)", "score": 10, "replies": [{"body": "I have a 35 and 37 July 28 calls out. I am almost certain I am not getting exercised. ", "score": 2, "replies": [{"body": "How much cash do you keep on hand per contract in the event you do get called?", "score": 1, "replies": [{"body": "They are in my IRA so its covered. I don't have the balls for naked selling.", "score": 3, "replies": [{"body": "How do you trade using your IRA?", "score": 1, "replies": [{"body": "You just sell the call and bet against yourself. Pretty sure most ira let you trade opinions just no margin.", "score": 1, "replies": []}]}]}, {"body": "Covered", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm going to lose so much money this week!  Exciting times!", "score": 18, "replies": []}, {"body": "AMZN calls who's with me?", "score": 16, "replies": [{"body": "You! Im inversing you!", "score": 39, "replies": []}, {"body": "I'm still holding on to my September 15 $980 call, currently deep in the green and definitely gonna sell if they have a nice pop on earnings. ", "score": 9, "replies": [{"body": "Theta decay: how does it work????", "score": 4, "replies": [{"body": "Exponentially?", "score": 3, "replies": []}]}, {"body": "Why not lock in profit and roll it to a higher strike?  ", "score": 1, "replies": [{"body": "Cause I'm not that smart", "score": 35, "replies": []}, {"body": "[mah n-word](http://i2.kym-cdn.com/entries/icons/facebook/000/013/723/mah-nigga.jpg)", "score": 4, "replies": []}]}]}, {"body": "Amazon's 2017 quarters have been baked in since 2013-14, this is free money we're talking about", "score": 2, "replies": [{"body": "If there a is something like a pattern with this sub, when it is that the proclamation of \"basically free money\" leads to surprising substantial losses.", "score": 12, "replies": []}]}, {"body": "I GOTCHU FAM", "score": 1, "replies": []}]}, {"body": "I'm not sure if I can handle another heartbreak like MSFT.", "score": 23, "replies": [{"body": "How did you play MSFT? Calls?", "score": 5, "replies": [{"body": "Yup. Saw it was up like $3, went to the gym, came back and it was down $.80.", "score": 12, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Or bought stock and sold AH.", "score": 1, "replies": []}]}, {"body": "how you sell options after hours?!?", "score": -1, "replies": [{"body": "I think he meant the share price.", "score": 4, "replies": []}]}]}, {"body": "My August calls lost over 30 pct", "score": 2, "replies": [{"body": "Strike? ", "score": 1, "replies": [{"body": "73.5. It's barely in the money. Paid 1.74, now probably a bit over $1. Good thing I sold half my position right before earnings.", "score": 1, "replies": [{"body": "deleted", "score": 2, "replies": [{"body": "Wait to see if Monday will be kind", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 32, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Why would a company falling apart worry you? That's prime put money right there.", "score": 1, "replies": []}]}, {"body": "Not a bad idea. The fd puts still have great value. Might see how the market starts and hop in with a 337.5/340 credit put spread ", "score": 2, "replies": []}, {"body": "They would really really reallyyyy have to crush on earnings, and outlook and have to give more satisfactory answers to how theyre gonna control all the food safety issues which theyre not really about disclosing. Short bet is thr likely play, i seriously doubt anything at this point is gonna make em jump the next month", "score": 2, "replies": []}, {"body": "Im hoping for a bounce back", "score": 1, "replies": []}, {"body": "You are right. I believe they will beat the earnings really well, but I am not sure if the stock will rise out continue to decline. They already have a lot of growth priced in, but seem to have many negative news.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "chickies wouldn't be buzzing on the choppin block na mean fam get these tendies", "score": 3, "replies": []}]}]}, {"body": "Wow. Such fun.", "score": 12, "replies": [{"body": "Is that a yacht I see on the horizon? \n\n\nWill update after FB earnings. Could be  a large chicken tender.\n\n ", "score": 6, "replies": []}]}, {"body": "Correct me if I'm wrong here but earnings plays only make sense for small cap companies who can gain big exposure and publicity with a big beat if they show massive yoy growth and huge potential for scale-ability. Like another massive baeTOS beat. Anything like that for mega cap companies is already priced in and if anything will bring a correction. Also\n\n>INTC\n\n They just axed an entire division Thursday that they started 3 years ago cause no sales.\n\n>CMG\n\nI'm surprised no IBM. laffin @ ur life m8.", "score": 17, "replies": [{"body": "Small-caps that are not covered nearly as much as big caps name likely have a better chance to be mis-priced and offer a decent RvR - but can still find some big movers on the big caps name.. ie. NFLX last week", "score": 5, "replies": [{"body": "Or it could go like msft", "score": 8, "replies": []}, {"body": ">the beat is known and already priced in\n\nedit: I'm dumb \n\nedit 2: in perfect hindsigt it was actually very obvious [looking at the chart](http://imgur.com/a/CdyXc). The 50 SMA gets a sharp cross over the 200SMA  meanwhile the SP is rising ~10% and never taps that 50sma even mid day over the course of the whole week ", "score": 0, "replies": [{"body": "um...no", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Great point bringing up the ETF issue. Also markets have become so automated that arbitrage and dispersion strategies on the single name equities cause an even heavier distortion as they try and chase the future's non-stop rally. The ETFs, index, and total basket can't diverge too far in price from the future so you can be sure there are some price corrections to be had this quarter.", "score": 2, "replies": []}]}, {"body": "Depends on what your play is - if you're talking about long calls, then sure.  IV goes up before earnings, and premium along with it, so if you mostly write options, large-cap earnings can be awesome.\n\nI sold an $AMZN 950/960 put spread expiring Friday for about 20% return on risk, and that would mean that Amazon would have to drop about 6.5% as a result of earnings in order for me to start losing money.  I made a similar credit spread on $NVDA (140/145, or 14% below), and I was able to do a buy-write for $NVDA at 158ish because I sold the $170 08-18 call for $800/contract.  That covered call pays about 7.5% return on risk, but $NVDA only requires 30% for margin, so it's actually 25% return on capital hold.", "score": 5, "replies": []}, {"body": "ibm already missed. they dropped 4% made tendies from puts", "score": 1, "replies": []}, {"body": "Holy fuck did I just read some good advice on this sub?", "score": 1, "replies": []}]}, {"body": "MCD for me, also if its a good week for the FANG stocks QQQ calls/ SPX calls look pretty good too.", "score": 8, "replies": [{"body": "Man id love to play mcd if I wasn't tied up", "score": 3, "replies": [{"body": "Hopefully it'll be a repeat of its last earnings, Mcdelivery has been picking up quite a bit of steam.", "score": 6, "replies": []}, {"body": "How would you play it?", "score": 1, "replies": []}]}]}, {"body": "Preheating the oven for more $GLW tendies.", "score": 12, "replies": [{"body": "Welcome to the party! Be sure to pick up your $NOK party favors by the bar.", "score": 2, "replies": []}, {"body": "What's your play on GLW? Thinking about doing a short put spread but dunno where to pick my strikes. ", "score": 1, "replies": [{"body": "My play is just holding 175 shares w/ average $28.13. It's jumped about 5% past two earnings although this upcoming earnings might be priced in a bit. Selling the $32.50 should be a safe bet. Doesn't matter which put you buy cuz this thing isn't dropping anytime soon.\n\ndisclaimer: have only ever paper traded options", "score": 3, "replies": [{"body": "I'm thinking about selling the 30.5 and buying the 29.5 expiring next Friday. 30.5 is outside of the implied move that the options are pricing in, could make $100 after commission if I buy and sell 10 contracts each leg. ", "score": 2, "replies": [{"body": "I wish you the best of luck!", "score": 1, "replies": []}]}]}]}]}, {"body": "my asshole is puckering in overdrive looking at this picture. so much in fact that my asshole on its own is generating almost enough power to propel me to the moon all in $NOK bois", "score": 10, "replies": []}, {"body": "Whatever happens we're guaranteed to lose money.", "score": 4, "replies": [{"body": "So if we are guaranteed to lose money can I buy an option on that?", "score": 2, "replies": []}]}, {"body": "MCD is the way to go", "score": 9, "replies": [{"body": "Whats your play", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Ether has consumed many", "score": 1, "replies": []}]}]}]}, {"body": "Big if true", "score": 8, "replies": []}, {"body": "Thanks, saving this post as we for whatever reason either don't pin these or pin these for just a couple days SMH", "score": 3, "replies": [{"body": "You don't have 12 favorite bars with links all leading to nasdaq?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Why? What's all the fuss about junior? Transformers?", "score": 2, "replies": []}]}, {"body": "Wish I got into GOOGL back in 2016. Seems like tech giants will continue to rise", "score": 3, "replies": [{"body": "Buy now if you think it will continue to go up.... ", "score": 5, "replies": []}]}, {"body": "Just got approved for options and deposited 1k. What do?", "score": 6, "replies": [{"body": "find a different thread... your 1K will be zero by weeks end... wait, thats overly optimistic. Let me rephrase, your 1k will be zero by Tuesday open...", "score": 23, "replies": [{"body": "Tuesday open? That's optimistic. I expect him to place a pre-market order on an OTC that goes under by 9:35", "score": 2, "replies": []}]}, {"body": "Aaaaaand it's gone", "score": 10, "replies": []}, {"body": "Nothing here. IV too high. Unless you wanna pick up a LEAP or two.", "score": 8, "replies": [{"body": "What you said was that IV is too high to make money. What I read was write options and print tendies. ", "score": 23, "replies": [{"body": "I think you belong here", "score": 3, "replies": []}, {"body": "He Can't do that with a 1k account.", "score": 1, "replies": [{"body": "Sure he can on tastyworks. I opened a margin account with less than that.", "score": 2, "replies": []}]}]}]}, {"body": "Sell bull put spreads on amazon. You can still get some nice deltas", "score": 3, "replies": [{"body": "Nah, sell naked puts on AMZN, never fails.  If it fails you roll em up.", "score": 3, "replies": []}, {"body": "As I mentioned above, I sold the weekly 950/960 for just under 20% return on risk, which means that I make the max as long as $AMZN doesn't drop 6.5% ($66/share).\n\nSelling put spreads against $AMZN is as close to printing money as you're going to get.", "score": 3, "replies": []}]}, {"body": "Puts on CMG and calls on MCD. ", "score": 2, "replies": []}, {"body": "Iron condors. Puts on CMG", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I wish I could agree but I think that with the recent fears brought by Norovirus and the mice, this could head lower. However, if the earnings beat nicely, it could see a good upswing as people might not have had faith in the company.\n\nI've been working at CMG the past month. Great food, usually great service, and I can tell you we are still selling a lot of food each day. I guess we'll see what happens next week, GL.", "score": 1, "replies": []}]}, {"body": "I just put 5% position on CMG in my portfolio.  Wish i could play options but im restricted. Also, i need to hold it for at least 30 days...so we'll see what happens", "score": 2, "replies": []}]}, {"body": "So how is it going?", "score": 1, "replies": [{"body": "Down on AMD puts FD up on TER long calls ", "score": 1, "replies": [{"body": "Nice move with TER.\nWhat broker do you use, if you don't mind to share?", "score": 1, "replies": []}]}]}]}, {"body": "So puts on subae?", "score": 8, "replies": [{"body": "Or maybe calls", "score": 7, "replies": [{"body": "Staddle that bae", "score": 7, "replies": []}, {"body": "Yes", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "The guys who put their logo in the top left", "score": 4, "replies": []}]}, {"body": "$CLF", "score": 2, "replies": []}, {"body": "wonder if ups is undervalued atm but gonna have a good er?", "score": 2, "replies": [{"body": "I would rather buy shares than play options. It's had a slight runup, but I believe that shrinking margins is still going to be part of the story due to ecommerce. I believe it's going down after earnings, but only slightly. It's close to the bottom already. ", "score": 2, "replies": []}]}, {"body": "Thinking huge week for spy all around. Thinking about Friday exp 247.5 calls. They're last price was 0.48 \n\nOR thinking FD on QQQ. 145 strike call at 0.56", "score": 2, "replies": []}, {"body": "Wonder if the two massive fedex attacks that happened will effect Amazon. Fedex was infected by Wannacry and notpetyr, and have stated that it caused large delays in operations, and permanent data loss, Fedex said notpetyr would cost them millions in damages for the quarter.", "score": 2, "replies": [{"body": "This market so crazy, seems these attacks actually fuel the stock", "score": 2, "replies": [{"body": "I'm expecting Amazon to buy out Fedex at 40% over market price Monday morning.", "score": 3, "replies": []}]}]}, {"body": "Ride the rails baby. NSC + CNI. Little worried after seeing CSX", "score": 2, "replies": [{"body": "CSX buy the dip", "score": 1, "replies": []}]}, {"body": "$AZN Thursday BMO. Should be decent earnings and they have phase 2 and 3 drug trial announcements July 31st that I expect will be good", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "It's literally the first one listed on Wednesday.", "score": 3, "replies": []}, {"body": "this isnt the 1990s", "score": 3, "replies": []}]}, {"body": "Gone all in long.", "score": 2, "replies": []}, {"body": "Anyone else in like a flare gun with Amazon?", "score": 2, "replies": []}, {"body": "Missing Conoco Philips on Thursday morning, they've got a nice liquid chain I'll be selling puts", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Right there with ya 16k tho. It will probably be a bloodbath.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "My guess is everything US down 5% next week. ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Most likely. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "That's *Monopoly's Burgers*. Dude, everyone knows that...", "score": 3, "replies": []}, {"body": "dominos", "score": 1, "replies": []}]}, {"body": "Let's go LUV!!!", "score": 1, "replies": [{"body": "I don't know. Airlines aren't doing too well  this quarter", "score": 1, "replies": []}]}, {"body": "Logitech gonna be sweet ", "score": 1, "replies": []}, {"body": "Hoping for a run-up before LRCX and maybe unload half my position day of ER. Actually, I'll probably just let it all ride, see an ER beat, good guidance, and watch it trade flat to slightly lower the next day.", "score": 1, "replies": []}, {"body": "Beat me to the post. It gonna be one hell of a week for earnings!! ", "score": 1, "replies": []}, {"body": "WYNN, LVS, and MGM? Anyone been to Macau lately?", "score": 1, "replies": []}, {"body": "Title is so accurate it hurts.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "i was wrong", "score": 1, "replies": []}]}, {"body": "I'm thinking an Iron Condor on 3M and bear put spread for Intel and American Airlines.\n\nBull put spreads for Alphabet / Logitech / McD / Dominos", "score": 1, "replies": []}, {"body": "I axpect my $QQQ shares to soar as high as that one Pink/Nate Russ duet....you know the one....", "score": 1, "replies": []}, {"body": "I'm flush, need best tips", "score": 1, "replies": []}, {"body": "What do you guys think about $STX? I feel like if I can get a good position in this stock I can retire off the dividends.", "score": 1, "replies": []}, {"body": "ayy", "score": 1, "replies": []}, {"body": "looks like im buying calls on MCds and Dominos", "score": 1, "replies": [{"body": "mcd should be doing well as they continue to replace the lazy morons crying for 15$ with kiosks! ", "score": 3, "replies": []}]}, {"body": "Broke bitches with the Netflix puts", "score": 1, "replies": []}, {"body": "Anyone know what percent of the NDX is reporting this week?", "score": 1, "replies": []}, {"body": "I'm having anxiety...", "score": 1, "replies": []}, {"body": "Is there a good video you guys recommend to learn more about puts and calls like shadowing some guy doing some investing I understand it vaguely but I'm not comfortable enough to use my money yet.  I've just been doing boring regular investing =p", "score": 0, "replies": [{"body": "Tastytrade.com", "score": 0, "replies": [{"body": "r/options", "score": 0, "replies": []}]}]}, {"body": "General Dynamics", "score": 0, "replies": []}, {"body": "Let's see exactly how fat that Apple settlement with Nokia actually was!", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Keep listening to Mr. Market.", "score": 0, "replies": []}, {"body": "Was 2 billion 👌", "score": 0, "replies": []}]}]}, {"body": ">claiming we're not all in in ether since last week", "score": 0, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "never short AMZN.", "score": 5, "replies": []}, {"body": "McDonalds has negative equity lol", "score": 0, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "What?", "score": 2, "replies": []}]}]}]}, {"body": "I've seen this chart before once or twice. What is the purpose of them? Do I just put 50k into those companies on those days and hope for the best? ", "score": -2, "replies": [{"body": "Binary events... boom or bust... prom queen or pimple faced virgin... first class or economy... \n\nIn summary - $50k could be $500k or zero- and most likely zero ", "score": 3, "replies": []}, {"body": "Yea", "score": 1, "replies": []}]}, {"body": ".", "score": -2, "replies": []}, {"body": "I use squarespace. Short (maybe) $wix. But... My websites are not looking like nothing in those demos... So its a coin toss now.", "score": -3, "replies": [{"body": "What the fuck does squarespace have to do with anything?", "score": 5, "replies": [{"body": "It's where he posts the pictures of the tendies he can't afford ", "score": 2, "replies": []}]}]}]}
{"title": "Venezuela’s annual inflation, soars to 756%...", "selftext": "[deleted]", "id": "6ovr46", "created_utc": 1500739472.0, "score": 137, "upvote_ratio": 0.92, "num_comments": 105, "comments": [{"body": "You mean socialism ISN'T sustainable? wtf", "score": 183, "replies": [{"body": "but muh comrades at /r/socialism said it works! ", "score": 105, "replies": [{"body": "[deleted]", "score": 61, "replies": [{"body": "I mean everytime you point to a communist country failing they either say UM ACKCHYUALLY that's state capitalism or reee about the nitty gritty of the word \"communist state\"", "score": 54, "replies": []}, {"body": "more like they will claim socialism has never been done properly but these so called commies know the answer how to make it succeed! REEEEEEEEEEEEEEEEEEEEE \n\n90% of reddit is against capitalism but yet loves all of its perks! ", "score": 47, "replies": [{"body": "90% of Reddit doesn't know what capitalism, or its perks, actually are. It's sad honestly. This shit should be better taught in grade school.", "score": 19, "replies": []}, {"body": "Guarantee 90% of the fags who complain about capitalism are posting from their Apple laptop while drinking Starbucks.", "score": 23, "replies": []}, {"body": "All I care about is being able to bet and lose my tendies on some sort of market ", "score": 13, "replies": []}, {"body": "That is everybody. If capitalism didn't work it would be gone a long time ago.  Everyone hates it including established companies - competing is hard", "score": 3, "replies": []}, {"body": "That sentiment fits the rest of the general population, but its not to say there aren't things that could be better.", "score": 2, "replies": []}]}, {"body": "\"TRUE SOCIALISM HAS NEVER BEEN TRIED\"\n\n\nREEEE", "score": 9, "replies": []}]}, {"body": "\"Venezuela isn't real socialism!\"\n\n-r/socialism", "score": 36, "replies": [{"body": "Then they proceed to ban any and all Venezuelans on sight and then labeling the Venezuelan subreddit a fascist sub because they were trying to say how bad the conditions were in their country.", "score": 29, "replies": []}, {"body": "\"It was when it looked like it was working, but it's not anymore.\"", "score": 12, "replies": []}, {"body": "\"And Nazis weren't socialists!\"\n\n-/r/socialism ", "score": 3, "replies": [{"body": "\"National socialism totally isn't socialism!\"\n\n-r/socialism", "score": 4, "replies": [{"body": "Because socialism shouldn't be nation-run. It should be run by a separate entity controlled by the people. We can call this entity a government. Totally and completely different from a nation.   \n\nEDIT: noting that this is sarcasm. Not so that people won't get mad at me, but so r/socialism doesn't turn me into a religion.", "score": 7, "replies": [{"body": "What if socialism was created by some guy just being snarky and sarcastic?", "score": 2, "replies": [{"body": "Maybe he should have added an edit like me and this wouldn't have happened.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Reeeeeeeeeeeeeee it's not real socialismmmmmmmm. Sanders can still win", "score": 38, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "No refunds!", "score": 5, "replies": []}, {"body": "Jane says she has da money. ", "score": 5, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Your post has been automatically removed because Gabriel loves sucking D.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Bill already spent it on hookers and coke . Tough luck bud ", "score": 1, "replies": []}]}]}, {"body": "I tried to type out a snarky reply. But Venezuela is just depressing. ", "score": 2, "replies": []}, {"body": "Leveraged one industry socialism*", "score": 1, "replies": []}, {"body": "Well definitely not if you're a country already prone to corruption with complete reliance on oil money....", "score": 1, "replies": []}, {"body": "Tbf Venezuela is a lot closer to a dictatorship than a socialist state.", "score": -8, "replies": [{"body": "Tbf nobody is going to give away their money without a dictatorship ", "score": 48, "replies": []}, {"body": "That's because \"true\" socialism/communism can't exist, it's a spherical cows in a vacuum concept when applied to a world populated by generally selfish organisms, so whenever the results are not entirely utopian they have the scapegoat of \"But it's not true socialism!\".", "score": 25, "replies": [{"body": "it can't exist bc \"true\" communism is communism that actually works ", "score": 6, "replies": []}, {"body": "It does exist as a mix with capitalism, see the Nordic model. I tend to agree with you about \"pure\" socialism, but that doesn't mean it can't exist at all.", "score": -13, "replies": [{"body": "The prime minister of Denmark says:\n\n>I know that some people in the US associate the Nordic model with some sort of socialism. Therefore I would like to make one thing clear. Denmark is far from a socialist planned economy. Denmark is a market economy.\n\nIt's a social democracy underpinned by capitalism. Private individuals own the means of production. \n\nThe closer you get to \"true\" communism/socialism the more quickly you accidentally kill a few tens of millions of people. See: every time it's been tried, ever. Ever heard of the [holodomor](https://en.wikipedia.org/wiki/Holodomor)?\n\n", "score": 17, "replies": [{"body": "Another example: [The Great Leap Forward](https://en.wikipedia.org/wiki/Great_Leap_Forward#Famine)\n\nHistory has proven time and time again that government is unable to respond to market conditions like the free market can.  A good example in the US was in the 1970s when Richard Nixon was experiencing stagflation he fixed food prices.  As a result, it became impossible for farmers to make money on their chickens.  Farmers began drowning their chickens while there were food shortages in the US.  Issues like this were actually the real source of Reagan's \"supply-side economics\" (often simplified to \"trickle-down economics\"), and it's the reason why it was so successful.  It pulled us out of stagflation by allowing both sides of the market to balance themselves out.", "score": 5, "replies": [{"body": "What's sad is that we have such well documented history of the failure of socialism and many people alive who have fled a socialistic country and yet we still have idiots who think it works. \n\nFree college isn't going to solve your problems, you'll still be a lazy piece of shit. ", "score": 11, "replies": [{"body": "> Free college isn't going to solve your problems, you'll still be a lazy piece of shit.\n\nLol.", "score": 8, "replies": []}, {"body": "It's uncouth to say it like this, but if you want to read/listen to some \"how bad could it really get under communism\" porn check out \"The Gulag Archipelago\" on Audible (or just download one of the youtube uploaded readings of the audiobook). It's really incredible how bad it can get.\n\n\"Remember, parents, don't eat your children!\"", "score": 7, "replies": [{"body": "You appeal to your audience. I'm not going to go to china and speak English. ", "score": 1, "replies": [{"body": "黑鬼他妈的你说什么?", "score": 5, "replies": [{"body": "Ching Chong ding dong", "score": 2, "replies": []}]}]}]}, {"body": "Socialists don't care about facts or history. They care about spouting moralistic bullshit to make themselves feel like better people. ", "score": 4, "replies": []}]}]}, {"body": "I literally said that it's a mix of the two. So yes?", "score": -1, "replies": []}]}, {"body": "all these European countries depend highly on U.S. to provide national defense for them if they were to lose our support their models would come to a complete collapse. ", "score": 3, "replies": [{"body": "That's sort of a stupid statement. Come on bro. Nato without the US would still represent the highest GDP in the world. And if they raised military spending from 2% of GDP to 3% of GDP they'd have higher military spending than the US.\n\nSo they'd have the 2nd largest military in the world without changing a thing. Or for 1% of GDP or 10% of healthcare spending they could have the biggest military in the world. Not exactly choices that lead to the \"complete collapse\" of their \"models\".\n\nedit: I should add, for how much Trump is right that they shuck their financial commitments to NATO, they're not idiots. It's 100% in the US's best interests to keep NATO together and lead NATO. The US bridges the divide between countries that otherwise don't get along and more-or-less unites and leads the whole partnership. It is not smart to lose that role over 0.2% of GDP or whatever, it's idiotic honestly, and so please stop jerking off to Trump weakening NATO. The only people that should be cheering that on are the Chinese and Russians.", "score": 5, "replies": []}]}]}]}, {"body": "Dictatorship of the proletariat, bruv.", "score": 2, "replies": []}]}, {"body": "they should try communism instead", "score": 1, "replies": []}, {"body": "It is.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -10, "replies": [{"body": "Norway isn't socialist you moron.", "score": 22, "replies": []}, {"body": "Username checks out ", "score": 4, "replies": []}, {"body": "I mean if you want to eat rotten fish and moss your entire life. Be my guess.\n\n What innovation has come out of Norway? Let's see how Norway deals with the continued low oil prices.", "score": 2, "replies": [{"body": "Responding only to the low oil part, I think their SWF will be able to pick up the slack for quite a long time.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 20, "replies": [{"body": "They bought the debt for pennies on the dollar and they are actually an entity that might be able to seize assets in the case of a default that might be worth more than what they paid for the debt to begin with.  It's not that simple.  They decided the risk/reward profile of either getting insanely high interest rates (I'm sure the debt was in US dollars so they can be shielded from inflation) or pieces of assets that are worth more than the debt.  It's the kind of investment people like you and I could never afford to make, but large, powerful entities can find huge profits either way.", "score": 19, "replies": [{"body": "How are they going to seize the assets? They are crazy down there.\n", "score": 5, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Finally the capitalists can rise up and seize the means of production from commies.", "score": 11, "replies": []}]}, {"body": "Maybe GS can pull an East India Trading Company thing and hire Blackwater (Academi) to take over Venezuela.  It's only been 100 years since something like this happened publicly.\n\nhttps://en.wikipedia.org/wiki/Company_rule_in_Rhodesia", "score": 9, "replies": [{"body": "**Company rule in Rhodesia**\n\nThe British South Africa Company's administration of what became Rhodesia was chartered in 1889 by Queen Victoria of the United Kingdom, and began with the Pioneer Column's march north-east to Mashonaland in 1890. Empowered by its charter to acquire, govern and develop the area north of the Transvaal in southern Africa, the Company, headed by Cecil Rhodes, raised its own armed forces and carved out a huge bloc of territory through treaties, concessions and occasional military action, most prominently overcoming the Matabele army in the First and Second Matabele Wars of the 1890s. By the turn of the century, Rhodes's Company held a vast, land-locked country, bisected by the Zambezi river. It officially named this land Rhodesia in 1895, and ran it until the early 1920s.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/wallstreetbets/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.24", "score": 2, "replies": []}]}, {"body": "This just in, Goldman Sachs now owns Venezuela. ", "score": 5, "replies": [{"body": "There ain't shit to own", "score": 1, "replies": [{"body": "No where to go but up!", "score": 4, "replies": []}, {"body": "O I L \n\n", "score": 1, "replies": []}]}]}]}]}, {"body": "These Jooz rule the world, they aren't getting cucked by nobody.", "score": 5, "replies": []}]}, {"body": "/r/LateStageSocialism", "score": 82, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "That's a good place though? Maybe you confuse it with the liberal shithole that /r/latestagecapitalism is.", "score": 38, "replies": [{"body": "Oh I just saw late stage and got trigged ", "score": 81, "replies": [{"body": "understandable", "score": 25, "replies": [{"body": "Have a nice day", "score": 1, "replies": []}]}, {"body": "Dude, your trigger is weak. You need to hit the gym.", "score": 1, "replies": []}]}, {"body": "Why did I think I could survive reading there...", "score": 1, "replies": []}]}]}]}, {"body": "why can't i just short the entire country?", "score": 20, "replies": [{"body": "U can by buying Venezuelan credits swaps or shorting their bonds", "score": 5, "replies": [{"body": "Good luck pulling that off without being Morgan Stanley", "score": 5, "replies": [{"body": "Or GS", "score": 1, "replies": [{"body": "Goldman would probably be the only ones nutty enough to actually sell those swaps", "score": 2, "replies": [{"body": "I am actually srs . Gs has a couple billion Venezuelan bonds\nhttps://www.washingtonpost.com/opinions/goldman-sachs-makes-an-irresponsible-deal-with-the-corrupt-venezuela-regime/2017/06/04/f3e3994c-47a8-11e7-bcde-624ad94170ab_story.html?utm_term=.2b6c24bfa02a", "score": 1, "replies": [{"body": "Oops, well that's not gonna work ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "At what point does this kind of suicidal inflating inspire national terrorists to make attacks on the minting facilities? ", "score": 9, "replies": []}, {"body": "Brazil is going the opposite way of Venezuela, buy EWZ.   ", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "It's following IMF austerity guidelines and has a non leftist or populist government. ", "score": 1, "replies": []}]}]}, {"body": "r/latestagecapitalism", "score": 4, "replies": [{"body": "I've been to a lot of retarded subreddits....but this one is by far the stupidest group of retards I have ever come across. These guys make /r/wallstreetbets not look like a bunch of faggots.", "score": 17, "replies": [{"body": "Making WSB not look like a bunch of faggots is unpossible.", "score": 2, "replies": []}, {"body": "Yep.  It's really quite hilarious to see the shit they produce.  ", "score": 3, "replies": []}]}, {"body": "that whole subreddit is filled with morons who reap the benefits of capitalism and shit talk it through their iphones/macbooks which was produced by capitalism. ", "score": 35, "replies": [{"body": "Basically. Most of Reddit is shit. Some of it is good. But the garbage must be downvoted.", "score": 15, "replies": []}, {"body": "[deleted]", "score": -13, "replies": [{"body": "Yes, because there was something about being communist that made it happen and nobody else in history would've cracked it at around the same time. ", "score": 4, "replies": [{"body": "[deleted]", "score": -8, "replies": [{"body": "I don't waste my time studying up on fatally flawed and endlessly debunked ideologies. ", "score": 5, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I know enough to know how shit the idea of communism is and how it'll never ever work, so not necessarily nothing. ", "score": 4, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Oh hell no, this is not continuing after bad faith action like trying to get me doxxed by posting my account on a shaming sub. But if you're running back to the compound to bang rocks together with the comrades for a week then I guess it doesn't matter. Douchebag. ", "score": 4, "replies": []}, {"body": "> burkino faso\n\nYes yes everyone is rushing to the utopia that is Burkina Faso (claims to be an expert; can't even get the country's name right).", "score": 2, "replies": []}, {"body": "The penny stocks of countries. Get on our level", "score": 1, "replies": []}]}]}, {"body": "https://www.reddit.com/r/ShitLiberalsSay/comments/6p2k2i/ill_argue_something_i_know_nothing_about/\n\nYou are such a bitter spiteful moron. ", "score": 2, "replies": []}]}]}]}]}, {"body": "**Leonid Kupriyanovich**\n\nLeonid Ivanovich Kupriyanovich (Russian: Леони́д Ива́нович Куприяно́вич, July 14, 1929 – January 1, 1996) was a Soviet engineer from Moscow who is credited for early development of a mobile phone device.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/wallstreetbets/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.24", "score": 0, "replies": []}]}]}]}, {"body": "Why is the Caracas stock market index up almost 1000% in a year then ? Is it due to inflation ?", "score": 1, "replies": []}, {"body": "[deleted]", "score": -10, "replies": [{"body": "Something tells me you don't know what you're talking about and this isn't worth getting in to.", "score": 6, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "Enjoy being poor, commie. Meanwhile my covered calls are printing trendies because people marginally smarter than you are buying them ", "score": 3, "replies": []}]}]}, {"body": "Oh yes the typical \"Venezuela is not socialist because it's the dirty politicians who own the means of production, but Norway is totally socialist!\" It's only socialist to you guys when it fits the narrative.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I used to know a Norwegian who'd claim that it is.", "score": 1, "replies": []}, {"body": "And if you did, you would claim they weren't \"True Socialists\"", "score": 1, "replies": []}]}]}, {"body": "Many people mistake state capitalism with socialism.", "score": 1, "replies": []}]}]}
