{"title": "Top picks for early 2021 gains - AMZN, FB, NVDA", "selftext": "What do these three tickers have in common?\n\n- Been forming lower highs and higher lows since their last all time high\n\n\n- Demand for their products was, is and will still be high in the near future\n\n- Over 10% down their last all time high (FB almost 20% down)\n\n\n- Comfortably sitting at critical support levels (AMZN: 20&50 daily EMA; FB: 100 daily EMA; NVDA: support trendline that touches every lowest lows since September 8th)\n\nI think they can be pretty safe picks going into 2021 for a reliable 10%-20% gain without significant chances of dropping any further.\n\nWhat are your top 3 safe picks for short term (1-2 months) gains and why?", "id": "kl643u", "created_utc": 1609085381.0, "score": 11, "upvote_ratio": 0.84, "num_comments": 41, "comments": [{"body": "I actually think Facebook's best days are behind them.  People are catching on to the idea that it is a terrible product and the unintended negative consequences of its introduction to the world greatly outweigh the positives.  The ESG movement is really picking up steam and it's only a matter of time before people start throwing companies like this into the basket.  Investing in Facebook will eventually be looked at the same way as investing in tobacco or whatever.", "score": 23, "replies": [{"body": "US users need to remember FB is super global and US trends don’t necessarily reflect others.", "score": 8, "replies": []}, {"body": "> I actually think Facebook's best days are behind them.\n\nPeople say this a few times a year but then we have earnings calls and their DAU (or is it MAU they quote?) are still climbing", "score": 5, "replies": [{"body": "The times are a-changing.  Lots more focus on monopolistic practices and privacy issues now.  And people aren't really talking about the impact of policy changes around the use of cookies and targeted advertising.", "score": -1, "replies": []}]}, {"body": "Honestly is the western world problem though. They are very strong in some part of Asia. And I think there can be a turn around play for Facebook. I think google just track as much but mark lizardberg always get painted as the villian", "score": 3, "replies": []}, {"body": "I agree that Facebooks best days are behind. I disagree that it's because people care about the negative consequences though.\n\nPeople are using the site less than they used to, and I haven't seen Facebook develop or innovate with new products. Facebook will stay as a way for people to chat through Messenger, invite to events and follow some celebs. But their other social media stuff is taken care of on other sites like Twitter, YouTube and Instagram (which FB owns but it shows they need to buy competition to expand).", "score": 6, "replies": []}, {"body": "Wait, Whatsapp and Instagram are terrible products?\n\nI haven’t invested in FB, but surely they’ll turn things around. Mark isn’t going to let his empire just slide.", "score": 3, "replies": []}]}, {"body": "I just hope FB doesn't pull an Alibaba on me, with government seemingly wanting to have them on a leash.", "score": 3, "replies": []}, {"body": "I like AMZN & FB. In addition to AWS taking off nx year, I think AMZN could announce their own delivery service (pure speculation) to get away from USPS. To me it makes sense especially with all the new distribution centers they’ve announced recently. \n\nSee link:\n\n https://www.theverge.com/2020/10/8/21507495/amazon-electric-delivery-van-rivian-date-specs\n\n\nI like FB cuz of its social media platform + Instagram, I think advertising could regain some of its customers after covid eases up, and its endeavors with digital currency could gain traction with the rise of Bitcoin.", "score": 5, "replies": []}, {"body": "Good list. I also recommend you consider EXPI, tradeDesk", "score": 2, "replies": [{"body": "EXPI is amazing", "score": 1, "replies": [{"body": "It is. And I’m surprised more people don’t know about it", "score": 2, "replies": []}]}]}, {"body": "Amazon might go down once everything opens back up, no?", "score": 1, "replies": [{"body": "Not at the rate my wife is buying stuff...", "score": 53, "replies": [{"body": "I mean I’ve always shopped on amazon for convenience, even before pandemic. But your wife and myself aren’t everyone and still a lot of people prefer to buy stuff in person.", "score": 3, "replies": [{"body": "Maybe. This is speculation here, but I am guessing a number of older folk don’t often (or never) buy stuff online and they have recently been forced to do so. There is a good chance this is going to be sticky.\n\nFor us we never bought groceries online pre pandemic. We are doing a lot of that now, and expect post pandemic to cut the number of in store grocery trips in half.", "score": 6, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "That’s what I’ve been trying to say...consumer behavior was forced to change and now a portion of it will stick.", "score": 3, "replies": []}]}]}]}]}, {"body": "Lots of opportunity with their pharmacy and healthcare plays.", "score": 5, "replies": []}, {"body": "AWS is huge reason Amazon has a positive outlook in the future", "score": 5, "replies": []}, {"body": "Maybe yes maybe no. I think there is a permanent change occurring with consumer behavior. The need to go to the store for recurring items is over with Amazon able to ship it to you in 1 day, soon to be same day. My view is that Amazon isn’t really valued for the retail business...it’s everything else under their umbrella. AWS, Prime Video, Prescriptions, Zoox, etc. You could argue they’re incredibly undervalued.", "score": 1, "replies": [{"body": "Before the pandemic, Amazon was priced under $2,000. It definitely isn’t undervalued right now. If anything it is overvalued", "score": -2, "replies": [{"body": "Using pre-pandemic prices vs now is not appropriate. The world changed during the pandemic. If you invested solely off past performance/history you wouldn’t fare well.", "score": 1, "replies": [{"body": "That’s not necessarily true though. It’s changed but it hasn’t changed THAT much lol things are going to go back to normal", "score": -3, "replies": [{"body": "You sure? Check in on how brick and mortar retail is...that was dying before COVID. Look at cloud growth.", "score": 1, "replies": [{"body": "I’m 100 percent sure lol and also you can invest on past performance and history. Why do you think people even invest in the first place? If it didn’t have a history or a past of success, no one would invest in the first place. Your comments are completely false and misleading.", "score": -3, "replies": [{"body": "I said invested solely, if you’d take time to read. Nobody is being misleading here, or stating anything false. Not sure what reality your living in, but Amazon is changing the world. Not to mention the vaccine has been here for over a month now...any negative price action is baked in.", "score": 0, "replies": [{"body": "You’re arrogant as fuck dude", "score": -3, "replies": [{"body": "Sorry, bro. You debate with strangers on the internet and offer no facts/or statistics. I’ve simply brought up the pandemic changing behavior with consumers and you’re saying...maybe people will go back to stores. I mean cmon, dude. You’re looking at one portion of a company and failing to offer any backup.", "score": 1, "replies": [{"body": "You brought up no facts of statistics either. You are just trying to predict that things are going to stay the same or that it’s completely changed when in reality people want things to go back to normal more than ever, AND THAT IS A STRAIGHT UP FACT. You are an arrogant dumbass lol", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Not really lol but what ever helps you sleep at night clown", "score": -1, "replies": [{"body": "Dude have you been living under a rock for like the last decade or something? I mean it's not like Amazon hasn't just been relentlessly marching towards global domination for the last 10 years or anything, lol.\n\n82% of US households owned Prime memberships...in 2019. Pre-covid...think about that for a second.  Vaccines and re-openings ain't gonna do shit to Amazon.", "score": 1, "replies": [{"body": "82% in 2019, and what’s it at now? You sound ignorant as fuck. How much more is it going to go up? It’s only going to go down when everything opens back up and people aren’t afraid to leave there houses anymore. That’s a fact.", "score": 0, "replies": [{"body": "How can something that hasn't happened yet be a fact?", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "I've been wary of these big monopoly-like companies such as Amazon, Facebook, and Google. I think there will continue to be antitrust litigation", "score": 1, "replies": [{"body": "So they get broken up and you get the new companies stock.", "score": 3, "replies": []}]}]}, {"body": "AMZN and NVDA have room to grow. I wouldnt hold on to FB for very long, seems like popular opinion is turning on them.", "score": 1, "replies": []}, {"body": "NVDA a better buy than AMD?", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "kl0367", "created_utc": 1609056975.0, "score": 26, "upvote_ratio": 0.8, "num_comments": 40, "comments": [{"body": "[https://www.nasdaq.com/articles/book-profits-stocks-hit-new-highs-strategists-2013-03-08](https://www.nasdaq.com/articles/book-profits-stocks-hit-new-highs-strategists-2013-03-08)\n\n\"I expect a big sell-off to follow soon. Initially, I think we could see  a 15% drop but ultimately I am expecting a decline well in excess of  50%,\" Hunter said in an email, **like a total cuck** **in 2013,** **just a few minutes into the longest bull market in human history**. \"I believe the global economy is  continuing to move toward a recession, one that will ultimately be very  deep due to the enormous leverage in the system.\"", "score": 35, "replies": [{"body": "In essence = perma 🌈🐻", "score": 19, "replies": [{"body": "That's exactly right. It depends on how it was interpreted. \n\nGay bears have been saying the markets have been going down for ages. Since the dawn of time. But we all know the aholes are so dry and bleeding from the fckin they have been getting", "score": 7, "replies": []}]}]}, {"body": "These guys made their money and are now pulling it out to protect it, but they also don't want us making money while they sit on it and hope for a big crash...boomers are so fucking selfish and miserable.", "score": 60, "replies": [{"body": "This 🌈🐻 just sad he missed the bottom and wants a do-over", "score": 16, "replies": [{"body": "Its boomers being comfortable but also incredibly jealous of us who have to play the risks to get hard gains.  Boomers loathe others who succeed", "score": 15, "replies": []}]}]}, {"body": "There will be but it is mostly depend on the government and the fed whether how long they want to keep this game going", "score": 22, "replies": [{"body": "Yeah they aren’t going to let this shit fall apart because of pension funds. Think of what it might look like if they all went tits-up.. boomer holocaust. \n\nI fully expect that the post-boomer generation will be bag-holders for these fucks, which is why we need to get low interest loans and juice this situation for all it’s worth.\n\nTLDR: Calls on errythang.", "score": 18, "replies": [{"body": "Indeed, if it crashes then say by bye to 401K and social security, we younger generation don't need those atm but boomers do, it may sounds crazy but as long as interest is low, stonks can only go up.", "score": 3, "replies": [{"body": "You are counting in manipulated boomer currency, you need to count using a fixed value.", "score": 2, "replies": [{"body": "What do you think about this?", "score": 1, "replies": []}]}]}]}]}, {"body": "Everyone knows market will crash.. but no one knows when... like life, everyone will die one day but no one knows when.  Are you going to worry about it everyday when you’ll die? Dont worry about it keep trading", "score": 32, "replies": [{"body": "If the market crashes it will drop by maybe 50% at the worst. So when times are good you have to jump in and make 300% gains to offset that loss. The only losers in the long run are the people that sit on the sidelines the whole time.", "score": 16, "replies": [{"body": "That’s why I always play otm options even a 1% gain is the same as a 90% drop to me so I don’t have to worry about it", "score": 2, "replies": []}]}]}, {"body": "Guy is talking like it’s the Inception of economic cycles.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 18, "replies": [{"body": "They live in the past. Nobody helping the old with their bags no more.", "score": 2, "replies": []}]}, {"body": "https://outline.com/kuyPhC", "score": 3, "replies": [{"body": "Well done", "score": 3, "replies": []}]}, {"body": "Not sure, the Fed has gold and silver price under a brutal control.", "score": 3, "replies": []}, {"body": "okay, bring it, I'll fucking buy the dip, try me bitch, you won't", "score": 4, "replies": []}, {"body": "These retards are 100% click-bait; some variant of this story shows up EVERY DAY in Apple News.", "score": 2, "replies": []}, {"body": "Dude probably loaded to tits with gold under his bed. Might have to check under his bed later when I fuck his mom", "score": 3, "replies": []}, {"body": "look at that they make em all wear vests", "score": 2, "replies": []}, {"body": "Equities like TSLA are the new gold. Inflation is going to skyrocket but so will the market. It's easier than ever to move money from bank accounts into stocks to protect against inflation. Can't say the same for gold.", "score": 1, "replies": []}, {"body": "Fuck boomers. Miserable pieces of shit.", "score": 1, "replies": []}, {"body": "Ok, but to play the devil’s advocate it may still be better to call a crash seven years early than seven months too late", "score": 0, "replies": [{"body": "Literally not the case at all. Just look at the 2008 crash, there was a guy who figured out it would all crash a couple years early but in reality the crash was a year or so longer than he thought it would be. The resulting premiums he had to pay to banks to keep his puts open nearly bankrupt him", "score": 5, "replies": []}]}, {"body": "i read that article he sounds like a fucking moron", "score": 0, "replies": []}, {"body": "Fucking pay wall", "score": 1, "replies": [{"body": "This will bypass it:\n\nhttps://outline.com/kuyPhC", "score": 2, "replies": [{"body": "😍", "score": 1, "replies": []}]}]}, {"body": "How do you stop the page from loading to avoid having the subscribe bullshit pop up?", "score": 1, "replies": [{"body": "This will bypass it:\n\nhttps://outline.com/kuyPhC", "score": 1, "replies": [{"body": "How did you do that?", "score": 1, "replies": [{"body": "Go to outline.com and enter any URL", "score": 1, "replies": []}]}]}]}]}
{"title": "Why GME will continue crashing on Monday using Technical fundamentals. (Not enough retail to break the balance board.)", "selftext": "Now many people are confused about some past posts so I figured we need to go into the deep technical fundamentals on why people hoping for a \"rocket\" so called on Monday will be instead met with a continuing crash. let me break this down with 3 fundamental stock activity charts that focus on the last 5 days of GME trading activity below.\n\n&#x200B;\n\n[Technical charts showing stock activity, shows the rise, start of doom, and crash which will continue on Monday. Click to zoom in.](https://preview.redd.it/mtey1hnv7s761.png?width=1326&format=png&auto=webp&s=618569d9fbfb1e252c6cbd62736bcd17bc2100fd)\n\n**Now then, the dissection:**\n\n1. **The first chart shows the full 5 days and what is called the \"balance board\" the balance board is usually a heavily resistant and stubborn point that if broken, usually leads to a massive spike that may have short or long duration. As you can see within the last 5 trading days of last week (today is Sunday so new week) even with inflated retail, fomoing, and a squeeze, GME could not break the balance board, and in fact declined as attempts to continue to fail.**\n2. Also on image 1 is the clear visual of when the rocket took off, Dec 22nd. That's the end of the flt lower line on Image 1 before the spike up.\n3. Image 2 points out the drop later on that week, showing that the big firms, hedges, and other rich conglomerates that control a significant portion of the market where starting to pull and retail and other smaller conglomerates were losing the ability to pump up the stock,\n4. Finally in image number 3, on Thursday the last day of the week, the big firms, hedges, and rich conglomerates did not go in or pulled back leading to a crash, you can tell by the trajectory of the fall and the grey line (which is for after hours trading) that the amount of investment and pumping by retail and smaller conglomerates were not significantly less than before.\n5. Expanding on point number 4 above, if you look at the after hours grey line, retail and others were still trying to push the stock up but because too much of the market controllers pulled back or/and stopped investing they were not able to not only keep up the pace from days before, but to bring back the GME stock into the green after hours.\n\n**All the points above show that more big movers will pull or stall while retail and other smaller investor individuals and groups will lose the ability to move the stock higher**, it will keep crashing until some part of the bigger market movers jumps in to give a platform for all that retail pump to bounce off.\n\nAs you can see on chart 3 the trading activity of these individuals in groups did not drop, the only thing that dropped was big funding and big money either stalling or pulling the rug a bit. And look at how it crashed the stock, and how even with low volume during after hours retail still couldn't get the stock back up even back to the CLOSING LEVEL they failed.\n\nWe should prepare for a continuing crash on Monday and possibly a bigger major crash back into the low 10's or single digits later this week. Do not be fooled, no time has WSB continued a long fomo has it ever kept going up, there is no exception, get out and/or buy puts now. People were expecting the squeeze on Wednesday and Thursday, it came and couldn't break the balance board, and crashed on Thursday. People are forgetting about Thursdays crash and are hand waiving it as some temporary feet\n\n***But there are no fundamentals or technical analysis to support this stock moving past the balance board***, and with no big major cash movers to help retail or smaller conglomerates move the stock, they can't move the stock by themselves, this just isn't possible. All you are doing is wasting money at this point until more major movers go into the stock, or stalled ones start investing again.\n\nHopefully the breakdown, and stock charts above will finally help people understand why you can't float something without support, or launch something without gas. What is the balloon floating on? If there's nothing there the balloon can't float, this is common sense.", "id": "kla3d9", "created_utc": 1609098626.0, "score": 0, "upvote_ratio": 0.17, "num_comments": 47, "comments": [{"body": "[deleted]", "score": 198, "replies": [{"body": "My man here with the real dd", "score": 80, "replies": []}, {"body": "Ding ding ding", "score": 19, "replies": []}, {"body": "you are OPs biological father", "score": 10, "replies": [{"body": "He is a huge disappointment to his mother and I.", "score": 11, "replies": []}]}, {"body": ">and now you're trying to do astrology on a chart with a 5-day time frame.  You don't know what the fuck you're talking about, son.\n\nastrology... love ya!", "score": 6, "replies": [{"body": "😘😘😘", "score": 4, "replies": []}]}, {"body": "had me at \",son\"", "score": 4, "replies": []}, {"body": "I think I’m in love with you", "score": 3, "replies": []}, {"body": "Holy shit! HAHAHHAHAA", "score": 3, "replies": []}, {"body": "Hmm that thread doesn't say anything about yoloing on GME, interesting out of context post.", "score": -37, "replies": [{"body": "It's literally in the title \"Which stock should I YOLO before AH? GME, CHWY, or others?\"\n\nYou can delete your post, but the title stays retard", "score": 15, "replies": [{"body": "So you sabotaged your own argument gme isn't the only ticker in the title. Not very smart I see.", "score": -17, "replies": []}]}]}]}, {"body": "Shut up bitch", "score": 92, "replies": []}, {"body": "\"[...]crashed on Friday\" Didn't know that the market was open on Friday🤡", "score": 39, "replies": [{"body": "Wait, you didn't trade on Friday?? The biggest 100-baggers were to be had.", "score": 10, "replies": []}]}, {"body": "Technical fundamentals? What kind of oxymoron is that.", "score": 39, "replies": [{"body": "This new and retarded form of hybrid analysis has serious meme potential.", "score": 9, "replies": []}]}, {"body": "I can’t tell if this is a joke or not", "score": 29, "replies": [{"body": "Switched to a daily chart on the third image as a projection of monthly movement. Pretty sure this is satire.", "score": 13, "replies": []}]}, {"body": "Not even reading this, Melvin. No you can't have my shares for a penny less than $200", "score": 41, "replies": []}, {"body": "My asshole is for GME", "score": 20, "replies": []}, {"body": "Fuckin Melvin.  Not today. Not. Today.", "score": 17, "replies": []}, {"body": "\"Single digits\"", "score": 16, "replies": []}, {"body": "> We should prepare for a continuing crash on Monday and possibly a bigger major crash back into the low 10's or single digits later this week.\n\n[lol](https://youtu.be/oavMtUWDBTM)", "score": 14, "replies": []}, {"body": "Nah.", "score": 14, "replies": []}, {"body": "These sad and desperate attempts fuel my 💎👏", "score": 10, "replies": []}, {"body": "This is retarded even for WSB. GME is up 30% last week and a 3% pullback on a half day, low volume holiday signifies a huge crash? \n\nI do think there will be some pullback to the upper teens (as it’s done twice already) before it rockets again, the short attacks will probably keep coming, but this shit isn’t crashing unless RC pulls. Considering he’s recently been buying more makes that a very low risk.", "score": 9, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 9, "replies": []}, {"body": "This may be the worst write up I've ever seen. 10/10 satire though.", "score": 9, "replies": []}, {"body": "Literally buying more gme as soon as market opens just because fuck Melvin.", "score": 9, "replies": []}, {"body": "Can’t see your positions, post puts 10k+ or ban", "score": 6, "replies": []}, {"body": "Technical analysis is BS.", "score": 5, "replies": []}, {"body": "This guy is probably being fed talking points from bears, or did 3 minutes of research and thinks he is a genius", "score": 6, "replies": [{"body": "Definitely the latter. Just a few days ago he was wondering how option price works", "score": 1, "replies": []}]}, {"body": "Someone ban this melvin sympathizer. Youre dd literally reeks of a boomer trying to pretend to be an autist. Fucking retard", "score": 4, "replies": []}, {"body": "Google search... WTF is technical fundamentals and how do I short u/jasoncolin", "score": 5, "replies": []}, {"body": "Is Melvin Capital recruiting out of special needs classes", "score": 7, "replies": []}, {"body": "This is a lot of work where you completely and purposely ignored Lord Cohen. May he have mercy on your soul.", "score": 3, "replies": []}, {"body": "Please ban this fucker for posting a bunch of shitty fake charts twice in a row", "score": 3, "replies": []}, {"body": "How much Melvin pay to be a tard?", "score": 2, "replies": []}, {"body": "The squeeze came? The shorts only got bigger iirc.", "score": 2, "replies": []}, {"body": "You're a phoney fraud, delete this garbage.", "score": 1, "replies": []}, {"body": "I bought puts Wednesday for December 31.  I suck my own dick if hit 10 dollars by then lol. I’m hoping for mid 16s", "score": 0, "replies": []}, {"body": "It should but it won t due to the power of the meme", "score": -1, "replies": []}, {"body": "sHoOt tHe mEsSeNgEr", "score": -3, "replies": []}, {"body": "[deleted]", "score": -12, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "This dumbass is at it again. Fuck you Melvin fanboy\n\nEdit: where's the crash bitch?", "score": 1, "replies": []}, {"body": "This is embarrassing", "score": 1, "replies": []}]}
