{"title": "16 year old looking to invest", "selftext": "[deleted]", "id": "6huex9", "created_utc": 1497718060.0, "score": 6, "upvote_ratio": 0.75, "num_comments": 41, "comments": [{"body": "Not going to comment about your stock choices.  But make sure that you can buy shares without commissions. If you're buying relatively small amounts commissions can have a big effect.  Maybe someone can make some suggestions of a brokerage.", "score": 3, "replies": [{"body": "brokerage with no commission? Not many of them but they most known should be Robinhood. ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "He is definitely a Newbie. My recommendation is stock market games. ", "score": 3, "replies": [{"body": "Disagree. I think everyone needs to pay for lessons. There's no replacement for real actual funds being manipulated in the real market. \n\nI played stock trading games for the longest.. but never really cared or learned anything until it was my money on the line. \n\nEdit: Plus, alot of times, the stock market games are either fictional markets or delayed more than 30 minutes. Which for me, totally fucks with my learning curve. ", "score": 2, "replies": []}]}]}, {"body": "Maybe use the Robin Hood trading app. It charged no commission fees ", "score": 2, "replies": [{"body": "The starting capital is still quite small to make a reasonable earning. ", "score": 1, "replies": []}]}, {"body": "I'm new to investing in the stock market and I'm only assuming you are too (I have been investing now for about a year). Before spending your hard earned money in the stock market, I would recommend that you do some research before making your final decision. You should learn about fundamental and technical analysis as well as how to read financial statements.", "score": 2, "replies": [{"body": "Investopedia is not a bad place to start. Investing without basic knowledge can only lead to losses. ", "score": 2, "replies": []}]}, {"body": "Get robinhood. Don't invest in penny stocks. Good picks besides Costco, i'm thinking long term amazon deal with whole foods might take out a lot of competitors other then that, its a solid company. ", "score": 2, "replies": [{"body": "Amazon is so big that one may begin to wonder if it can get bigger. Regardless, I think it is a strong buy for a long term investment. ", "score": 1, "replies": []}]}, {"body": "If you can handle the volatility of the stock market, then invest in an index fund that mirrors the stock market.  You have a long term horizon so the fund will go down at points, but it will also increase many times over.", "score": 2, "replies": [{"body": "This investment for a novice is practically not attachable. It's a one way traffic. ", "score": 1, "replies": []}]}, {"body": "The question is, how much do you know about these stocks (ie growth potential, earnings, revenues). Don't invest in a stock just because you use the products", "score": 1, "replies": []}, {"body": "The question is, how much do you know about these companies? Earnings, growth, revenues. Don't invest in something just because you use their products", "score": 1, "replies": []}, {"body": "The question is, how much do you know about these companies? Earnings, growth, revenues. Don't invest in something just because you use their products", "score": 1, "replies": []}, {"body": "The question is, how much do you know about these companies? Earnings, growth, revenues. Don't invest in something just because you use their products", "score": 1, "replies": []}, {"body": "Are you investing in these because you understand ecstock, or simply because you use their products?", "score": 1, "replies": [{"body": "Hmm. Food for thought", "score": 1, "replies": []}]}, {"body": "Check out opening a Roth IRA account. Unless you are looking to try and day trade honestly with the stock market the amount you have is not much at all. I would suggest checking out crypto trade if you want quick action. But I would defiantly check out a Roth account first.\n\nI should say I am by no means a veteran investor and their are a lot of others here that know much more than me this is just some advice with anything please do your own research :).", "score": 1, "replies": [{"body": "Day trade is definitely not the answer as well especially for a beginner. Why not try index fund or anything of lower risk like governmental bonds. At least you keep your money safe until you safe enough to start trading properly. ", "score": 1, "replies": [{"body": "I agree I day traded crypto for awhile not knowing anything and lost pretty much every cent because the advanced guys knew how to make my emotions make them money.", "score": 1, "replies": []}]}]}, {"body": "Never understood the point of buying 1 or 2 shares of a company. Like jesus, even with massive gains youll earn what, couple hundred bucks?", "score": 1, "replies": [{"body": "That money is simply too small to start anything meaningful in the stock market. ", "score": 1, "replies": []}]}, {"body": "Making investments based on this thread will bite you in the ass. Best thing you can do at this point is buying a book called **The Intelligent Investor**. I'd read this before doing *anything* with your money. ", "score": 1, "replies": [{"body": "Have you read it yourself? If you have, then you would know it's not a book for newbies. ", "score": 1, "replies": [{"body": "I have and it was okay. You might need to consult Investopedia for unknown terms a couple of times, but that's about it. ", "score": 1, "replies": []}]}]}, {"body": "Good stock choices. But with just 2k, I doubt you will do much. ", "score": 1, "replies": []}, {"body": "May I suggest https://stockpile.com ? The biggest win is that you buy fractional shares with Stockpile. To me, that really gives a lot more room to experiment. It's also at just $0.99 fees per trade.", "score": 1, "replies": []}, {"body": "You're 16 and you have 2k and are interested in trading stocks? You're gonna do fine in life. \n\nThat being said. You should also download acorns. Put half in acorns and use the other half of the money to play around in Robinhood. If you are employed, you should also do your absolute best to see if you can contribute to a 401k or something similar. I haven't done the research for kids your age.. But right now, the more places you can be investing money, the better. Robinhood is risky and should be more of a hobby.. I would advise that it shouldn't be your only investment strategy. \n\nLemmie know when you're rich af at 35 and ready to retire by 40.. We can go out to lunch with our big wallets and buy each other drinks for days.  ", "score": 1, "replies": [{"body": "Why is Robinhood risky?", "score": 1, "replies": [{"body": "Not Robinhood necessarily, but the stock market in general has more risk than.. say a 401k or a Roth IRA. Obviously skill and experience are variables.. which most people don't have. \n\nAcorns still uses the stock market but IMO it's still less risky because they purchase mostly ETFs and manage their portfolios to minimize risk for you. For me it has ended up netting a pretty consistent 8%. I sometimes see dips.. but they don't last very long. \n\nGranted. You also have the opportunity to make FAR more in the stock market than you could using another investment strategy. Plus, if you know what you're doing, it can be pretty reliable. ", "score": 2, "replies": [{"body": "Yeah I was thinkin about an ETF to buy via Robinhood.", "score": 1, "replies": []}]}]}]}, {"body": "Costco over Amazon?", "score": 1, "replies": []}, {"body": "Would highly recommend NVDA, since you have TSLA.", "score": 1, "replies": []}, {"body": "If you want to invest go to /r/invest, this is where people play in the stock market and hope to make massive gainz", "score": 1, "replies": []}, {"body": "Buy spy$ l", "score": 1, "replies": []}, {"body": "Investing is honestly not going to get you far with just $2k. You might want to consider day trading, Check out my article on Day Trading Tips for Beginners http://www.bprising.com/articles/20-day-trading-tips-for-beginners", "score": -4, "replies": [{"body": "Day trading is very complex and you are a lot more likely to lose money. I recommend investing your 2k into an index fund since it's relatively safe and long term you will get sizable gains.", "score": 6, "replies": []}, {"body": "I won't recommend day trading at all either will I advice you to trade with 2k. Day trading would have been best if you were in any way more knowledgeable than you are in the stock market than you are at the moment. \nTherefore, find a lower risk investment or simply safe your money until you understand how the market works and have enough money to invest. ", "score": 1, "replies": []}, {"body": "Very good read. Thank you!", "score": 0, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "This is true. Overstatement anyway.. ", "score": 1, "replies": []}]}]}]}]}
{"title": "Project to Beat the Dow", "selftext": "I'm working on a project. I try to beat the Dow. Every week I select stocks from the Dow (usually 1-10 stocks) that I think will beat the Dow. Last week was AXP, GE, IBM, CSCO, and DIS, a few weeks ago was XOM and NKE, you get the idea. I select stocks using a machine learning algorithm I created (engineering undergrad, compsci masters, interned as a quantitative analyst). It can make predictions for any arbitrary portfolio, but people care about the Dow - it's a reasonable benchmark.\nThere's a more in depth explanation on my blog, please check it out:\n\nhttps://beatthedowbyacow.com/\n\nIt's a time-stamped log of all my stock predictions, and a plot of my performance compared to the Dow. It should give you some idea of what I do. You can use the blog to copy my trades in your own portfolio (hypothetically! don't do this! entertainment only etc.) because predictions for Monday mornings are always posted Sunday nights. It's only 9 months of data, but it's all verifiable in an interactive brokers account. I have another 6 months of paper trading data (unverifiable unfortunately) that can be prepended to the graphs.\n\nI've put a lot of work into developing the algorithm. Let me know what you think. I'd love to hear about how to improve things: what kinds of features and sections people want to see. Would people like to be able to log in and be on an email list? Perhaps you like the simplicity? Please, let me know. That's what this post is about. I want feedback on how to improve this.\n\nHeads up iOS users, the graphs don't seem to display properly in iOS safari (OS X safari is fine).\n\nEDIT I'm making some changes to the website, so it may go off temporarily over the next few hours.", "id": "6hvdwq", "created_utc": 1497728686.0, "score": 17, "upvote_ratio": 0.79, "num_comments": 37, "comments": [{"body": "Hello. A few issues I'd like to address. Give my perspective about some things and hopefully, we can have a nice discussion!\n\n(I'm a finance graduate with a bachelor in actuarial sciences)\n\n1. transaction costs. Do you take them into account when computing the cumulative performance? I guess not, It seems to me like one of those (sadly many) systems that seem short-term perfect, but once you include transaction costs the picture is not so rosy anymore. \n\n2. Perhaps your algorithm includes biases that have led you to overweight weekly those stocks with characteristics that are yielding considerably good returns in the recent bull market. Hence it is no guarantee of any sort of future performance whatsoever until tested.\n\n3. Looking at the backtest, it looks very exposed to the momentum factor. I believe you are underestimating the crash risk that comes with it in fragile market times. ", "score": 8, "replies": [{"body": "Hello, thank you for taking the time to read my blog and form insightful questions. I'll address them in the order you presented:\n\n1. Transaction Costs: In the backtest I posted, and on my blog, transaction costs are not included. I agree that transaction costs can have a very big impact on some higher frequency strategies. To address this, I generated a backtest that discounted $10 per stock traded on an imaginary $100,000 portfolio, and indeed performance was not as good. However, In the test, I still beat the Dow considerably over time. There wasn't a huge impact. If there is interest in seeing that, I'll try to recreate the test by Monday evening. That said, $10 per transaction is somewhat arbitrary because cost depends on your broker. I chose to test $10 per transaction because it represents high trading costs and was a good sanity check. In reality, trading costs are nowhere near this high. I use interactive brokers, and I hardly feel trading costs at all. My real money performance is very close to hypothetical. If there is enough interest, I'll see if I can show my IB account. Some of the money in there is my Dad's, so I'd have to ask if he's okay with that.\n\n2. Biases towards high returns stocks: There is no step in the algorithm designed with a bias towards high return stocks in a bull market. However, if the machine learning process determines that this is a good strategy for a given week, then there's nothing stopping it from doing that. That said, simply picking high returns stocks during a bull market will not get you performance anywhere near that of my backtest/paper trades/real trades. It's just not that great of a strategy in my opinion. I've tested pure momentum, and I've found it not very predictive on its own. This kind of rolls into the next question...\n\n3. Momentum Sensitive Strategy: I share this concern with you, and I'm impressed with your insight here. The model does strongly depend on momentum factors, and there is a crash risk associated with that. However, I find that my algorithm has the most difficulty with regime shifts, but has unexceptional, yet not terrible, performance during crashes. Look at the 2008 region in my backtest. Performance turns down before the crash, then actually slightly outperforms during it. And you can see this in other places too. I'm actually very interested in studying this aspect of my model more, because identifying/predicting regime shifts is a very hot area of research. Every model is going to have its weaknesses, and regime shift sensitivity is a common issue. In my opinion, you need to model regime shifts on their own, then overlay that on top of an existing model. It's very hard to roll everything into a single model. I'd like to finish this answer by saying that I also have a daily version of my code. Transaction costs could be more of an issue for daily trades, but anyways, the bactest demonstrates more data points, so it could give you a better gauge of my model's behavior. I can post my daily backtest if you'd like.\n\nFinally: \"Hence it is no guarantee of any sort of future performance whatsoever until tested.\" Follow my blog and find out :).\n\nI appreciate the interest in my model. I'd also like to know more about how to improve the website.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah. Re-balance every Monday morning. However, the algorithm can recommends the same stocks multiple weeks in a row.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Thank you :). Yeah, it's not everyone's cup of tea, but I need data to train the algorithm, so the trading period needs to be somewhat short. If it was trading every six months, that's only 2 data points per stock per year.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yes, I use historical data to train the algorithm. But, say I have 3 stocks and I want to train my algorithm on 6 month data. Even if I look back 30 years, that's only 180 data points. And much of that data would be from the 80's and 90's, which wouldn't really be meaningful (in my opinion). In my analysis, I've found that data can eventually go stale and be non-predictive. So I have to make sure my algorithm doesn't look at data so old it'd do more harm than good, but I needed as much data as possible. It's a balancing act.", "score": 1, "replies": [{"body": "I don't follow. You can train your algorithm to make a decision every day, predicting 6 months ahead. There is no reason to only have 2 data points per year unless there is some magical about two specific dates.", "score": 5, "replies": [{"body": "> You can train your algorithm to make a decision every day, predicting 6 months ahead.\n\nWhile theoretically this is possible, with each prediction you make, a certain error/inaccuracy is added to it. When you use that prediction to make a further prediction, you're just adding more inaccuracy to your predictions.\n\nBasically, you're suggesting to use daily data and make daily predictions up to 6 months ahead, while he's suggesting that to make 6-month ahead predictions, he has to use 6-month returns (hence 2 data points a year). Right now, he's most probably using weekly returns to train his algorithm and making one prediction that's a week ahead.", "score": 2, "replies": [{"body": "Yeah, this is correct. I use supervised learning, so it makes the most sense to train on the same timescale as I trade. However, perhaps temporal difference learning could be used to update predictions daily on returns in 6 months. I'm actually interested in exploring this more.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Quick question - why the Dow? Why not the S&P?", "score": 2, "replies": [{"body": "The Dow seems easier for readers to follow. If you wanted to go through my time-stamped posts and verify everything by had you could do that easily because the universe is  small. My algorithm performs equally well in the S&P and Dow, so I decided to go with the Dow. The algorithm picks between 15 and 50 stocks per week with the S&P. If there's interest in seeing an S&P implementation, then I'm happy to do that. But there's also the tech sector, the Russell 2000, and on and on... I thought the Dow was a reasonable place to start - just to demonstrate my algorithm.", "score": 2, "replies": []}]}, {"body": "This is really cool.\n\nWhat software are you using for this? Are you using Neural Networks?\n\nAlso, have you backtested this strategy?", "score": 2, "replies": [{"body": "Thank you :). I'm not using Neural Networks. I find that they over fit the data - there's a lot of noise, and ANNs have trouble with that. I coded everything in Matlab, and I've backtested back to 2005. I'm very happy with the results. Backtests are not trivial; it's easy to make a lot of mistakes. So to be certain, I made sure to run my strategy for a few months then back test over that period to make sure everything matched. I was already trading by the time I did this, it was mostly a sanity check. I'd be happy to share my backtest results if people are interested.", "score": 2, "replies": [{"body": "It's really nice to see someone using MATLAB. I'd be interested in your backtest results. Especially when the market is bearish.", "score": 2, "replies": [{"body": "I did my undergrad in engineering, and old habits die hard hahaha I love matlab. Okay, I'll generate those right now.", "score": 1, "replies": []}, {"body": "http://imgur.com/iVNxbL9\n\nThat's going back 565 weeks from today, so about a year before the 2008 recession. The red line is my portfolio, the blue line is the Dow, and the yellow line is the complement of my portfolio - so if my portfolio is 5 stocks, the yellow line would be the other 25.\n\nAs you can see, my algorithm pretty much matches the Dow during 2008, but demonstrates steady outperformance past that. So it doesn't underperform... but I decided to not hyper-focus on 2008 in my analysis. Some people do, but I don't think its really beneficial.\n\nAlso... to clarify, the blue line represents the average returns of the current components of the Dow since 565 weeks ago (minus VZ and V because I couldn't get data that far back). This applies to the other lines too - they can only contain stocks from the current components of the Dow. That's my stock universe for the backtest. So this is not a perfect representation of the Dow. However, the test does demonstrate my algorithm's ability to beat a benchmark, and I think this is what's important.", "score": 1, "replies": [{"body": "This is great! Are you factoring in commissions in these performance graphs? \n\nWeeks 460-470 are interesting. Your portfolio dropped much more than the drop in DOW. I've also noticed that a lot of your picks repeat every week. Have you considered tuning this over say, 2 to 3 weeks or maybe a month, rather than keeping the interval at one week?\n\nI did a PhD trying to adapt systems engineering methods and algorithms to predict financial returns with some success but I've just lost interest in trying to tweak it further - I find some strategies like just holding good A-list scrips for longer periods have much more success than chasing the holy grail.", "score": 2, "replies": [{"body": "Thank you for the support :). Actually, weeks 460-470 aren't that much worse than the Dow, but because of compounding and how it's a linear plot (not log) the dip looks more exaggerated. Wow you did your PhD in this? I'd love to talk more about your work. I have an email in the \"About\" section of my blog. Please contact me, I'd really like to know more.\n\nAs for transaction costs and different trading intervals, I address that in my 3 part answer to Jasonmilo911.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Since it is a machine learning algorithm, is the idea that the performance of the machine improves over time? Also, around week 19 on your website there is a marked divergence from the benchmark. Any explenation for this?\n\nThanks for doing this!", "score": 2, "replies": [{"body": "The way my algorithm is designed, performance should be similar all the time because I have a fixed training window size. Around week 19 there's a divergence: there's inevitably going to be good, bad, and slow periods. I happened to start my blog at a slow period. I wish every week was as good as week 19.", "score": 2, "replies": [{"body": "Maybe a good chart to show would be \"% difference from benchmark\" that would show if your algorithm is showing improvement in performance over time. ", "score": 2, "replies": [{"body": "That's a good point, and I've generated this before. I plan on adding this to the website. I can show you the results over my paper trading/real trading. I have this on hand.", "score": 1, "replies": [{"body": "I'm interested in seeing it. I do love me some data and charts. Haha", "score": 1, "replies": [{"body": "http://imgur.com/QrcxHTJ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I started by trying to use machine learning to trade bitcoins just as a fun side project. I had some success with that, and that's what got me an internship as a quantitative analyst. I decided to apply what I learned to real markets, and get a master's degree in computer science, so that's where I am now.\n\nBitcoin is a really good place to start playing around with ideas. Real markets can be overwhelming at first. You have to be comfortable coding, and revising code. It's a long process. Let me know if you have any more specific questions, like how I started trading bitcoins etc.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'd say, with an an engineering background you're in a good place to learn about quantitative analysis. Try it yourself, see what's out there, there's many different ways to analyse the market. Quantopian is a good resource, and a good way to see what other people are doing. But there's so much more to finance than quantitative analysis, and it's all important to know. In fact, learning about things that are not considered quant can help you do better analysis. So, if you have friends in industry who aren't quants, talk to them too. The world of finance is very big.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sure :). \"Introduction to Time Series and Forecasting, Second Edition\" by Peter J. Brockwell and Richard A. Davis could be a good place to get started. It goes into a lot of detail with ARMA models. It can be dense in some places, but it has a lot of good stuff. You should be able to find it online pretty easily.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No sweat. I'm happy to talk more. I know some other good resources and perhaps I can help you get started with some simple backtesting.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Is your blog down? Cant access it", "score": 1, "replies": [{"body": "It's back up. Sorry, about that. Let me know if you like it.", "score": 1, "replies": [{"body": "no, that wasn't it. For some reason I can view the website on my PC but not on my phone.", "score": 1, "replies": [{"body": "Oh hahaha yeah... there's an issue with plotting in iOS, I'm going to fix it soon I'll let you know when I do. The site is pretty slapped together, but I'm getting more views lately so I'm going to improve it.", "score": 1, "replies": [{"body": "Im on an android phone", "score": 1, "replies": [{"body": "Oh, okay I need to look into this.", "score": 1, "replies": [{"body": "It might be my browser. I couldn't  see anything when I opened it with mozilla. I switched over to the generic browser on my phone and it worked", "score": 1, "replies": []}]}]}]}]}, {"body": "Can you put a CAP on the stock price? id love to follow the picks but buying a couple shares of GE or AAPL is just too much lol. ", "score": 1, "replies": [{"body": "I don't recommend using your own money to replicate my trades... I have to say that. Internally, I do rank my picks. Picking, for example, the top 3 stocks instead of 5, will work. just the top 1 is a little too much risk; my analysis indicates it's not a good strategy. As it stands, I just post the top 5 in no particular order. If there's demand to see the ranks of every stock in the Dow each week, I'm open to doing that.", "score": 1, "replies": []}]}]}, {"body": "It's hosted in my friend's laundry room, and he tripped on the cable hahaha but it's all good now.", "score": 1, "replies": []}]}]}
