{"title": "Fannie Mae (FNMA) and Freddie Mac (FMCC) are the Most Undervalued Stocks in the Entire Market - Here's Why", "selftext": "[removed]", "id": "4i46c5", "created_utc": 1462521631.0, "score": 52, "upvote_ratio": 0.87, "num_comments": 38, "comments": [{"body": "RemindMe! 1 year \"check FNMA and FMCC\"", "score": 9, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "you're welcome", "score": 3, "replies": []}]}, {"body": "I will be messaging you on [**2017-05-06 08:50:46 UTC**](http://www.wolframalpha.com/input/?i=2017-05-06 08:50:46 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/4i46c5/fannie_mae_fnma_and_freddie_mac_fmcc_are_the_most/d2ux8ci)\n\n[**58 OTHERS CLICKED THIS LINK**](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/4i46c5/fannie_mae_fnma_and_freddie_mac_fmcc_are_the_most/d2ux8ci]%0A%0ARemindMe!  1 year ) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! d2ux8na)\n\n_____\n\n|[^([FAQs])](http://www.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^([Custom])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^([Your Reminders])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^([Feedback])](http://www.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^([Code])](https://github.com/SIlver--/remindmebot-reddit)\n|-|-|-|-|-|", "score": 2, "replies": [{"body": "RemindMe! 3 months \"check FNMA and FMCC\"", "score": 1, "replies": []}]}, {"body": "RemindMe! 1 year \"check FNMA and FMCC\"\n\n", "score": 1, "replies": [{"body": "BEEP BOOP:: REQUEST RECEIVED:: Reminding you about this whenever I remember, which might be when it's too late. Man one time I forgot to remind someone to give their grandma medication. That sucked.", "score": 5, "replies": []}]}]}, {"body": "I am also invested in Fannie and Freddie. This is nothing but theft of private property. Watch this short video explaining how the US Treasury is sweeping profits that should have been there for shareholders. The conservator who is supposed to preserve and conserve assets of these companies, is not doing his job, in fact he is doing exactly the opposite. \nhttps://www.youtube.com/watch?v=R5cmjVmeGuE", "score": 6, "replies": [{"body": "meh cry me a river; if you don't want the government to take your profits maybe don't run a business that needs a government bailout.", "score": -2, "replies": [{"body": "It is being argued that Fannie and Freddie never even needed a bailout at all, but was taken over by the government to act as a scapegoat for all the big banks who needed bailouts.  \n\nBut you just keep on smugly making ignorant posts about a subject you know nothing about.\n\nOg BTW, here's a list of other companies that needed bailouts.  \n\nhttps://projects.propublica.org/bailout/list", "score": 3, "replies": []}]}]}, {"body": "Legendary fund manager Peter Lynch wrote extensively about both of these companies and how they were some of the greatest businesses in America. \n\nThis letter is an interesting opinion on this Fannie Mae http://www.valuewalk.com/2016/02/bruce-berkowitz-2/", "score": 6, "replies": []}, {"body": "Always short stocks with elaborate write-ups on Reddit.", "score": 12, "replies": [{"body": "A wise word of advice in marketing that applies fairly well here: \"Products without a sales pitch normally sell faster\"", "score": 3, "replies": []}]}, {"body": "At what pricing point did you buy into FNMA?", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "So what average cost are you currently looking at per share?", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Appreciate the answer. I'm pretty naive around this complex situation - is there a timeline, roughly, when a definite court decision can be expected?\n", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I've been waiting for years and years on this .. the wheels of justice turn very slow so I would not plan for any quick gains. Having said that, we could have substantial results in the next 6-8 weeks due to the appeals court overturning a decision and another Delaware State court decision", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Freddie just bought my home loan..... Load up fellas they stand to make a whole 20k off of it if I don't sell it by 2046. ", "score": 3, "replies": []}, {"body": "A great source for a complete view of information relating to the GSEs and the stockholder interests is www.gselinks.com, it hosts links to both positive and negative articles, pundits, opinionated people, etc.  and is pretty much an encyclopedia for the issues.  ", "score": 2, "replies": []}, {"body": "I've been following this saga since 2009. If anyone wants a quick catch-up, [this blog post by former FNMA CFO (not goalie) Tim Howard](https://howardonmortgagefinance.com/2016/05/02/getting-from-here-to-there/) is the best summation I've ever read.", "score": 2, "replies": []}, {"body": "Do you see any major difference between FNMA and FMCC (or their preferreds) in terms of risk/reward?", "score": 2, "replies": []}, {"body": "It is a binary situation. But the outcome is either >$25 (possibly >$100) or $0. If the lawsuits fail, then no profits will ever see the light of day for shareholders and FNMA will be dismantled. ", "score": 3, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "> Under HERA that decision gives us rights under the legislation to initiate litigation again.\n\nBut what exactly would you sue for? If all litigation fails today, what's left to litigate? I'm all for an educated investment with binary outcomes, I'm want to wrap my head around all possibilities. If legal precedence is set with the current lawsuits, barring any additional information being brought to light at a later point in time, what legal arguments are left then, that haven't been utilized already today?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "After seeing something on Reddit months ago I did the same thing. If only I put more.... I'm up 40% on FNMA. It's really a cheap gamble if you think about it. $100 investment could see 3000% return or 100% loss. That's worth throwing a $100 or 200 into. ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "I got 2200 from 2 months ago.  Hoping this gamble pays off.  My anticipation of a down market for the next months worries me.", "score": 1, "replies": []}, {"body": "I'm very interested to learn more about this. It seems like you're very informed on the topic and this is a well written post. However it also seems like you're saying this is a no lose situation and the shares will jump to at least $33, and my instincts tell me anything that sounds too good to be true normally is. Do you have any insight on the negatives to investing in fanny or maybe know of somewhere I can read more about what's going on?", "score": 1, "replies": [{"body": "If the courts uphold the current profit sweeps then the stock price will go to 0.", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Your points are reasonable and I'm not arguing against them. My point was that the binary outcome is not between $25 - $150 and that there is a very real chance capital loss. This is not a 'sure bet' - if it was, it would not trade where it trades today.\n\nYour original post makes it sound like it is and retail investors should be aware of the risks involved to determine their own estimate of risk/reward and investment appetite.\n\nThat aside, thank you for providing all these links. I have started reading up on the situation yesterday night and today. Since I'm still very naive about the topic, I'll refrain from posting an opinion about the current risk/reward and wish you all the best with the trade. Maybe I'll join you after my DD is completed.\n", "score": 1, "replies": []}]}]}]}, {"body": "I've been yoloing on this for years. I don't expect it to pay out cause who beats the government. If the lawsuits fail expect the next congress to take the GSEs out to the woodshed when they stop making money. It's been the stated intention of both parties to kill off the GSEs, they just can't do it because of political infighting, and right now it's a golden goose.", "score": 1, "replies": []}, {"body": "I try to stay away from OTC penny stocks. ", "score": 1, "replies": []}, {"body": "RemindMe! 1 minute \"poop\"", "score": 1, "replies": [{"body": "This is like the 4th time one of you assholes interrupted my Ocarina of Time speedrun for a fucking reminder, fuck you", "score": 2, "replies": []}]}, {"body": "RemindMe! 1 hour \"poop\"", "score": 1, "replies": [{"body": "Remind you of what? Sorry man most of my RAM is currently being taken up by watching Hydraulic Press videos", "score": 2, "replies": []}]}, {"body": "What are the reasons, if any, the government would have for *not* taking their 79.9% stake?", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "I appreciate the response and the time you must have given in researching this situation.\n\nAs a side question, do you think there could still be legitimate basis for fear on the part of the govt that has them thinking that relinquishing control of Fannie and Freddie could lead to more instability given current economic conditions? In other words, despite being profitable and fully paid off, can the govt still feel that Fannie and Freddie are \"not ready\" to go back to how things were?", "score": 1, "replies": []}]}]}, {"body": "Bought $50 of each in February of 2015 when I read a similarly convincing article about a Wall Streeter's lawsuit potentially forcing the government to free Fannie and Freddie. Figured it was better odds than a lottery ticket. All these months later, I'm down $13. Seems like nothing's really changed. Maybe I'll put a few more bucks in but it's still a lottery ticket, not a sure thing.", "score": 1, "replies": []}, {"body": "Here's the counterpoint. Congress doesn't really do anything right now and no one knows who the next POTUS is and none of the remaining candidates are really great for business ", "score": 1, "replies": []}, {"body": "lol.  It warms the cockles of my heart to see these assholes are OTC now.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": "[deleted]", "score": -1, "replies": []}]}]}]}
