{"title": "NVDA Calls--a good buy?", "selftext": "NVDA calls seem very cheap with low IV (\\~40%) relative to the stock price and movement. It seems like IV will probably increase closer to the split date? What are your guys' thoughts on something like $1150 C 6/21? \n\nWould rather get level headed advice here over WSB", "id": "1d1676l", "created_utc": 1716743907.0, "score": 14, "upvote_ratio": 0.64, "num_comments": 77, "comments": [{"body": "If you don't know what direction its going to go then why bet on direction.  \n\nIf you know NVDA will be making good earnings, why not go with leaps for the future?  Most here Don't know how to manage short term calls. \n\nYou will end up with profit and magically lose it all.", "score": 38, "replies": [{"body": "Thanks for the insight, aren't LEAPs betting on direction too?", "score": 6, "replies": [{"body": "The key word there was short term. I also gave you insight on why the stock market goes up. \n\nWhen using options, you have different greeks that go against you. When using leaps, you have a longer time horizon to be right in simple terms. \n\nA swing trade on Nvidia when using calls is a gamble , when you are just guessing.", "score": 9, "replies": [{"body": "Do you exercise the options to avoid a big tax hit or just sell the leap? I’ve been successful with some leaps, but never sure what the smart move is when it’s time to get out I’ve been selling them but I know I’ll have to pay significantly on the gains.", "score": 2, "replies": []}]}]}, {"body": "Yupp. Had 05.17 1000 call. It went 7000 -->9500-->100-->1000+-->0.  \nFirst mistake was not to sell at 8-9k. Second not to sell 1000+. Third was that I thought I bought it for week after earning, not a week before...", "score": 5, "replies": [{"body": "Riding your profits up and down like that is gambling. AFAIC, ​if you have large games like that either hedge them or book some of them. When you were near the top, If you were still bullish , you could have bought a put(s), locking some in some gain. Or you could have rolled your long call(s) up, pulling out some profits at the cost of some delta. Learn to manage your risk as well as your gains.", "score": 2, "replies": [{"body": "Yeah, it know. Stupid gamle. To be fair, if FEDs didnt slow down rate cuts, it would have paid off.... but.. \n\nIm OK managing risk with stocks, but I have no idea how to properly do it with options. I dont have any strategy for that. \n\nI checked stuff like selling the put or collar, but I dont really get them. When I do quick maths, it seems like I would be better off just selling whole position in that case?", "score": 1, "replies": [{"body": "Managing the risk of a option isn't terribly different from managing the risk of a stock.\n\nWhat's best to do now depends on what the stock does going forward.", "score": 1, "replies": [{"body": "Problem with options is how leveraged they are and expiration dates. With stock you can hold for a while and (most likely) they will come back. You can add on the dip. It's harder to do so with options. \n\nIm ok with risk management on 0dte (its almost like trading spy/penny/etc), but I need to find a decent strategy for medium-term options (few months out).", "score": 1, "replies": []}]}]}]}]}, {"body": "To be fair, even cheap LEAPs for NVDA are in the thousands at this point.", "score": 5, "replies": []}, {"body": "Or he could you know, just buy shares in the company.", "score": 1, "replies": []}]}, {"body": "how many do you want? I'll write a couple for you. My risk tolerance lets me write 6 for 43 vol", "score": 10, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I have less than 600 shares", "score": 1, "replies": []}]}]}, {"body": "Yeah as long as you don’t plan on holding till expiration. Although the buy frenzy might halt short term while people wait for the stock split, I doubt this is going to be the high between now and June 21st. If you buy on Tuesday I’d sell as soon as your up.", "score": 5, "replies": []}, {"body": "IV is low because it's right after earnings", "score": 3, "replies": []}, {"body": "Better than puts", "score": 3, "replies": []}, {"body": "Have just been getting LEAPs, currently have Jan 25 1360. 6/21 1150c is pretty risky although obviously there’s huge upside.", "score": 3, "replies": []}, {"body": "OSS", "score": 2, "replies": []}, {"body": "We just got through earnings. IV is low because it just crashed. Has nothing to do with the split.", "score": 2, "replies": []}, {"body": "You’re welcome guys.", "score": 2, "replies": []}, {"body": "IV for LEAPS will go up briefly after the split (that won't matter too much for deep ITM LEAPS) - but generally I expect IV to go down though after the split for earlier dates.", "score": 1, "replies": []}, {"body": "yeah", "score": 1, "replies": []}, {"body": "You’re gonna get burned", "score": 1, "replies": []}, {"body": "They are so expensive I could never pull the trigger", "score": 1, "replies": [{"body": "Do a spread.", "score": 3, "replies": [{"body": "I will read on it. Not familiar with how to place a Spread", "score": 1, "replies": [{"body": "You'd just sell a further otm strike on the same date.\n\nSo instead of buying a 1200c, you buy that call and then sell a 1250c.", "score": 1, "replies": [{"body": "Gotcha.", "score": 1, "replies": []}, {"body": "My problem with this strategy is that if it goes up higher/faster than expected and you want to exit, you can lose a lot of profit.", "score": 0, "replies": [{"body": "Ok but what's the alternative? If you have capital limitations you have 2 options.\n\nOpen a spread or buy a much further otm option. Which may not even react to a move in your favor.\n\nIf it moves up higher and faster than expected, you hit max profit at expiration. Congrats. You just got the best case scenario for your trade. Why are you spinning this as a negative.", "score": 1, "replies": [{"body": "I just don't like the way spreads behave. You don't predict only direction, but also how fast it's going to get there. And a capital limitation shouldn't decide your trading strategy. My position on NVDA is 10 950c 16Aug.", "score": 0, "replies": [{"body": "You do that with any long option position. You're predicting direction and speed. That's why you're picking expiration dates.\n\nDude that's a 150k position. Most people don't have that kind of money to just drop in calls on one company. So yeah if course you would think that way. Why would capital limit you when you can afford any position you want.", "score": 1, "replies": [{"body": "Thats my point. I have the money. Just not the balls. I know you are not an Advisor.\nCan you show me your spread play?\nYou can message me screen shot. Ty.", "score": 1, "replies": [{"body": "I usually just do an atm spread for however much I'm comfortable spending. In this case it was a 1020/1060 call spread. It closed itm by the end of the day that I opened it.", "score": 2, "replies": [{"body": "How does the Sell side react react to stock increasing?", "score": 1, "replies": [{"body": "It goes up. Just not as much. Because it's a lower delta. The spread as a whole will gain value. Which is what you want. But profit is capped at the width of the spread. \n\nThe closer to itm it gets, the better your spread is going to perform.", "score": 1, "replies": [{"body": "Gotcha. I will look at the atm spread in the morning. Much Appreciated. Ty!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What was the cost? Risking?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Just saw on Redditt Musk to build Super Computer using Nividia Chips", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "This place is for learning", "score": 2, "replies": []}]}, {"body": "The split is already priced in.", "score": 0, "replies": [{"body": "The expectation of the split is priced in, but there could be more realized IV than implied. I bought a 6/21 reverse iron condor for this.", "score": 2, "replies": [{"body": "Basically just betting on the volatility being higher than the 40% IV, correct? Where direction doesn't matter", "score": 2, "replies": [{"body": "Basically yes; you can adjust the spreads for different risk profiles.   \nI have break-evens at 972 and 1087", "score": 1, "replies": []}]}]}, {"body": "The split is priced in? WTH does that mean?", "score": 1, "replies": [{"body": "It means that the news of the stock split is factored into the current price. Which is arguable. Its also arguable that the new price will generate new buyers and new traders, especially in the retail options market.", "score": 0, "replies": [{"body": "Companies are investing heavily in AI technology.   NVDA and other chip makers are benefiting from this demand. Earnings reported last week tripled from a year ago.\n\nNot only is a split a large expense cost for the company but a split doesn't change the value of one's holdings. It is not a driving factor here. A future stock split isn't driving NVDA's price.", "score": 1, "replies": [{"body": "But stock splits are bullish and usually push the price up. It happens all the time. I'd you're saying it won't affect the price of nvda then you're saying it's priced in already.", "score": 1, "replies": [{"body": "To repeat: Companies are investing heavily in AI technology. NVDA and other chip makers are benefiting from this demand. Earnings reported last week tripled from a year ago.\n\nA stock split is irrelevant to all of the above.  Buying a stock because there's a pending stock split isn't any better than buying a stock because it has a high yield.  Fundamentals matter.", "score": 1, "replies": [{"body": "Expirations around major events, like a split, tend to have more volatility. Both implied and realized. This does matter.\n\nYou're basically saying the split doesn't matter because other things matter more. They don't cancel each other out.\n\nEdit: nevermind I'm not doing this with you.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What makes you say that?", "score": 1, "replies": []}]}, {"body": "If you want to express a long view of NVDA with options why would you buy long calls and not a ratio spread like a ZEBRA or a synthetic long.", "score": 0, "replies": [{"body": "For me it's because those have vastly different capital and margin requirements.", "score": 1, "replies": [{"body": "That’s like saying you’d rather get a train ticket than a car because it’s cheaper, while the car is much more useful. And if you’re buying more than 1 call a zebra isn’t a higher capital requirement. \n\nI’m not giving investment advice, but there are a couple of things you should keep in mind. Be careful about buying at the top. No one knows if we’re there or not, but we could be. And be careful about where the fed is, and whether we have a market correction. \n\nAny long calls you buy are going to need a move up to profit, a ZEBRA profits on a sideways or up move.", "score": 1, "replies": [{"body": "Again, it depends on your risk level and portfolio. One 3 month atm call on nvda is 9k right now. If you have a 50k port, then that's more risk than most people are comfortable with. A 1200c is 4k. And you can manage it even more by doing a debit spread. \n\n2 900c and a short atm call is a debit of 30k. Which is waaaay more risk than most people are comfortable with with that port size. And these will only get bigger as you buy longer dte. \n\nIf you're rocking a half a million port it's probably not a big deal. Maybe you are. I'm not. \n\nI appreciate the advice but it's nothing new. Nvda has had strong upward trajectory because it's had the actual growth to back it up. And the fed hasn't been that unpredictable. Things were a little chaotic mid last year, but now?", "score": 2, "replies": [{"body": "The August 1200c is $4k. The August 930/1060 +2/-1 is ~$25k. But you get 2 calls between 930 and 1060 so it’s not 6X the price. \n\nAt 1065, current price, you lose $4k on the 1200c and make $1500 on the ratio spread. At 1200 you lose $4k on the 1200c and make $15k on the ratio spread. At 1275 you make $3500 on the 1200c and $22,500 on the ratio spread. But 1275 is where the return on risk of the 1200c catches up to the ratio spread. So unless you’re buying 6 1200c and expecting a high probability of going over 1275 which is +210, the ratio spread is a better position. \n\nThe other issue is, because you sell more extrinsic than you buy with the ratio spread, you don’t need to have a lengthy expiration to give the underlying time to move. You can get a cheaper position on an earlier expiration.\n\nEdit - and let me be clear, the ratio outperforms the 1200c on any distribution of the underlying price that isn’t skewed hard above 1275 in August, which would be a very abnormal distribution.", "score": 2, "replies": [{"body": "I don't disagree that the ratio performs better. But it has an up front cost that I simply can't afford. And a lot of people either can't or won't commit that much capital to one trade.\n\nLet's say you're trading with a 10k port. The ratio could be entirely risk free and it wouldn't matter because you can't enter the trade to begin with. Or if you have a 25k port now you're betting your entire account on one stock. That's all I'm saying. In a world with infinite money and risk tolerance sure. There are definitely better things than buying a call.\n\nPersonally I'd put that 4k on 1060/1160 debit call spread. That would be 150% RoR on a 10% move in one quarter with a breakeven at 3.5% above current price. Assuming I wanted to use that amount to bet on that direction. The 1200c would have to gain 16% to breakeven and have a 20% gain on the underlying to exceed the profit on the spread.", "score": 2, "replies": [{"body": "That ratio spread gets significantly cheaper moving it on closer expirations. \n\nI think the main issue is what your view is of the probability distribution and then maximizing your position to fit that view.  Unless you’re heavily right skewed on your view of that distribution, long calls are not the answer. You’d be better off doing a risk reversal with spreads and you can get that for less capital than long calls.", "score": 1, "replies": [{"body": "Can you slow me an example of how you'd construct that trade? I usually don't have the margin to sell a put spread and buy a debit spread. And if I shorten duration then I have to be right on direction within a much smaller window.\n\nI tried simulating a ratio on nvda and the dates don't change total cost.\n\nEdit: moving it closer didn't reduce cost but pushing it further out increased it significantly.", "score": 1, "replies": [{"body": "You can play with the risk but something like a 1000/970 bull put with a 1150/1210 Bull Call will get you a $140 credit on a $3k credit spread. \n\nSo max risk is $2860, max return is $3140, most likely scenario is +$140. That’s the 7/14 expiration. \n\nI like to put the short put where I think support is, and then decide how much call I want to buy with the credit. It’s a balance between taking a larger credit and giving your call a higher probability of profit.\n\nYou can make it more or less aggressive. You can push it out farther but you’ll have to adjust the strikes. The closer you get to the money, the higher the probability of both your spreads getting touched or passed, so more risk and reward. The farther you are from the money, the more likely you take your credit and walk. \n\nTheta is on your side as long as your bull put isn’t tested.\n\nEdit: to get the ratio cheaper you have to move the strikes higher on nearer expirations. The way you analyze the zebra is by the break even so premium divided by 2 (on a 2/-1) plus the back strike is the break even.", "score": 1, "replies": [{"body": "So I'm looking at that trade now. Breakeven is quite a bit lower. Profit at 1200 would be about the same as my call debit spread on its own. But it's lower risk due to the large range of prices where it stays above breakeven. But it's not much above breakeven. It seems like a much more conservative strategy. \n\nI think the advantage to doing a straight debit spread is that you need less movement to hit max profit. The likelihood of getting there is higher, but the chance of taking a loss is higher too. With yours, you're creating a big zone of safety barely above breakeven, in exchange for pushing your max profit price further away. It's a very Theta focused structure to me. It could be worth it. It's probably more consistent. I think I would do your strategy on a shorter timeframe, but do a debit spread on its own, on longer time frames. \n\nLike for example, I took out a 1020/1060 debit spread right after earnings. It was atm when I bought it. It's 33 dte now. Breakeven is 1035. Max profit is at 1060. \n\nHad I done a synthetic futures spread, I'd have to push quite a bit further to get past the initial credit in terms of P&L at expiration. Probability of profit is higher, probability of profit above the credit, is lower though. Spreads atm are too expensive to be covered by a credit spread, so you have to buy further otm. But spreads atm have much higher chance of expiring itm.\n\nI'm glad I saw what you showed me though. It does seem very useful. It's definitely something to think about.", "score": 1, "replies": [{"body": "Well you can move the strikes anywhere you want. If you like the 1020/1060 bull call you can make it cheaper/reduce the breakeven/increase the profit by selling the 1000/970. You can double up on the 1000/970 or add a bear call on top of your 1020/1060 like a 1200/1230. Giving you a bull call partially financed with a condor. \n\nThe main exercise that you need to do is come up with an objective probability density function and exploit the areas where the market has a different view than you. \n\nNVDA’s 1 week range is between about 925 and 1070. That’s an amazingly large range. I think that range is more likely than not to be smaller next week. I think we could see a continuation of the bullish move or a slight correction. Market seems to think there’s a 63-64% chance of staying between 965 and 1165. I think it’s more like 80% and I think it’s skewed higher. So I’ll be acting accordingly.\n\nEdit: also let me be clear, I don’t like out of money long call positions. Spreads are much less objectionable. So I don’t really have a problem\nWith the spread you suggested.", "score": 1, "replies": [{"body": "Problem with doing that is the increased margin usage on top of the cost of the debit spread. But otherwise I agree.\n\nI don't know that I want to find out where my views differ from the market. I just want to figure out what the market views are and follow that. Well that, plus gut feeling. Which I know is impossible to quantify so I won't try. \n\nI think nvda is set for a slow climb. I basically bet that it would make a 4% move up in a month. That's not even crazy for a one day move so I felt pretty confident after the earnings surprise and the news of the split. \n\nI'm with you. I hate otm long options on their own. They're very inefficient and prone to disaster. A lot of the time they feel like coin flips. In a perfect world I'd be buying primarily itm options for directionality. But I have a really small account so I have to work around my constraints.", "score": 1, "replies": [{"body": ">I don't know that I want to find out where my views differ from the market. I just want to figure out what the market views are and follow that. Well that, plus gut feeling. Which I know is impossible to quantify so I won't try.\n\nThen you’re stuck at martingale which is break even. If you don’t think NVDA has a higher probability of moving up than moving down, you shouldn’t be putting bullish positions on. \n\nOptions are priced at expected value. Draw a symmetrical bell curve with the peak above the last price. That’s typically what the market thinks and that’s typically how premiums are priced. If your view is the bell curve, you’re going to break even. If your view is the bullish slice of the bell curve and you’re right, you make money.", "score": 1, "replies": [{"body": "What I mean is that if the market is bullish on the stock, and I think it is, especially after the last ER. So options that follow that view is what I want. I don't want to fight trends. I'm not out here trying to predict a peak and short it, I want to ride the wave up.\n\nI want to use higher probability options to take advantage of that, as I can afford them. But there's a balance between return and risk that I want to achieve. Which is why I don't do itm call debit spreads, but I also won't go and buy 30 delta calls.\n\nI do however, use that bell curve and implied/expected move to buy/sell around earnings. Especially in contrast with average historical move.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Calls are allways a good buy, really never loose money.", "score": -5, "replies": []}, {"body": "[removed]", "score": -1, "replies": [{"body": "I don’t disagree but I remember saying it was overbought in January at $500 💀", "score": 8, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "It gets converted into a new set of contracts. If you had 1 1k call, you'll get 10x 100c.at least that's what happened in the past when I held through a split.", "score": 3, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "There would have to be a pretty significant revenue drop for things to turn. This whole ai movement would need to stall out. Nvidia has been a strong company for years, this was just their moment to prove it.", "score": 1, "replies": []}]}]}]}]}, {"body": "And then it comes back the next day. Or the next week. We just had a significant correction. It's overbought because we just had an earnings spike. Doesn't mean it's going to drop.", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Nvda has had business growth to back it up though. This is like the 5th straight quarter of it being like this. Most companies who have this kind of growth don't have the stability to retain it.", "score": 5, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I think it depends on your timeframe. I don't usually trade anything less than 30 days exp. So a couple little bumps in the road aren't going to make or break.", "score": 2, "replies": []}]}]}]}]}]}]}
{"title": "Recession Update: Through the +/-1 Sigma Birthing Zone, the Cradle of Recessions (Key Takeaways Below)", "selftext": "[removed]", "id": "1d18nop", "created_utc": 1716750553.0, "score": 69, "upvote_ratio": 0.77, "num_comments": 69, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 26 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Do your fancy shmancy charts account for AI? I didn't think so smart guy. Don't you know AI canceled all future recessions?", "score": 126, "replies": [{"body": "On gawt", "score": 1, "replies": []}]}, {"body": "A recession did not arrive this year, at least not before the presidential erection contest. After that, shit might unfold", "score": 39, "replies": [{"body": "But OP said 99% chance before the election. \n\nAre you saying some random fucking regard on the internet, doesn’t actually know the future?", "score": 29, "replies": [{"body": "I am highly regarded", "score": 6, "replies": []}, {"body": "Homie probably rents a Trailer Park behind Wendy’s", "score": 6, "replies": [{"body": "ban bet it then", "score": 1, "replies": []}]}]}, {"body": "Wait....what kinda contest are we having ?", "score": 4, "replies": [{"body": "🍌🍆🥕🥒", "score": 1, "replies": []}]}]}, {"body": "Holy fuck. Go look at OPs post history. He’s been posting this same shit for 5+ years saying a recession/depression is right around the corner.\n\nWho the fuck are you? A gay fucking citadel bear tasked with attempting to scare bulls?", "score": 53, "replies": [{"body": "There's a couple of years of this same graph showing recession and then a few posts about UFOs. So we should probably take him seriously.", "score": 25, "replies": [{"body": "The aliens gave him the charts, and like the internet, aliens are never wrong.", "score": 6, "replies": []}]}, {"body": "It’s a numbers game, keep throwing shit at the wall until it sticks. Then he’ll have been  a prophet and economic genius the whole time.", "score": 3, "replies": []}, {"body": "Come on. You're totally exaggerating.\n\n[This](https://www.reddit.com/r/Recession2020/s/jLTx9uR35L) was OP's first use of a bell curve to predict the recession, and it clearly says 4Y ago, not 5. 🤭", "score": 2, "replies": []}, {"body": "A broken clock is right twice a day so after posting this for 10 years it might become true !", "score": 2, "replies": []}]}, {"body": "Love this bear porn.", "score": 17, "replies": []}, {"body": "Yes. A recession has been coming tomorrow, everyday, for years. \n\nThanks for your insightful input.", "score": 66, "replies": [{"body": "Also I heard the dollar is about to collapse any day now...", "score": 21, "replies": []}, {"body": "if you say it daily for many years eventually you'll be correct!", "score": 8, "replies": []}]}, {"body": "Keep shorting. Thank you for your contribution. \n\nInsert quarter (of your account) to play again.\n\nOh, and go ahead and try to time when that recession everyone thinks is coming. Your liquidity (liquidation?) is appreciated.\n\nNow that is off my chest, what are you actually going to do about any of this? That's a serious question.", "score": 7, "replies": []}, {"body": "Recessions help creative destruction, and the weak deserve to fall.", "score": 28, "replies": []}, {"body": "Never ever seen a bell-curve so foolishly used in an utterly ridiculous way.", "score": 19, "replies": [{"body": "He even signed his work. To make sure this work is not mistaken to be from some other idiot", "score": 3, "replies": []}]}, {"body": "Sigma Birthing Zone???![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271) bers get it together", "score": 6, "replies": [{"body": "Ligma birthing zone.", "score": 4, "replies": [{"body": "Ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Shove your sigma birthing zone up your ass you dumb bear.", "score": 4, "replies": []}, {"body": "There is an 87.8888876% chance that the next recession will be gey", "score": 3, "replies": []}, {"body": "recession cancelled stocks only go up", "score": 5, "replies": []}, {"body": "Sigma birthing zone? ![img](emote|t5_2th52|8882)", "score": 3, "replies": []}, {"body": "Sigma ballz", "score": 2, "replies": []}, {"body": "2 more weeks!!!", "score": 2, "replies": []}, {"body": "Is the recession in the room with us now?", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|8882) Birthing Zone?", "score": 5, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "I’ve been hearing that since 2010 (these calls got more intense after 2012). Stocks only go up and the FED will pull all stops to avoid recession, especially now that they have something they can actually do in the form of lowering interest rates and bringing back QE. Particularly given the fact that this is an election year. I would argue that the new paradigm is easy money as every action taken at the federal level will prop up the dead zombie economy as best it can irrespective of implications and corrections.", "score": 1, "replies": []}, {"body": "I have to say I raised cash last week. The huge bearish engulfing after NVIDIA earnings needs to be negated first. Even if we go higher another 3 months we will eventually drop.", "score": 1, "replies": []}, {"body": "I'm looking into my crystal ball and I see your future, and it is grim. \n\n\"I'll suck your dick if you'll write me a SPY put\"\n\nThere is still time to change this, my son. Come bask in the warm white noise of GPU data centers. All are welcome.", "score": 1, "replies": []}, {"body": "Isn’t the yield artificially controlled by old rich white guys?", "score": 1, "replies": []}, {"body": "It's a self fulfilling prophecy at this point. Recessions only occur when that line recross the 0 axis upwards.", "score": 1, "replies": []}, {"body": "Calls it is. GTFO of here", "score": 1, "replies": []}, {"body": "Based on the amount of people I've seen shopping this weekend, recession reschmession", "score": 1, "replies": []}, {"body": "Recession was April ya nut sack gobbler", "score": 1, "replies": []}, {"body": "This is so funny. Recession is a slow growth or negative growth, but market will get dumped as hell like 40% if this happens. Is this legal at all?", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "We’re literally in a recession, the media doesn’t acknowledge it bc unemployment is still relatively low.", "score": 1, "replies": []}, {"body": "What about the ligma birthing zone?", "score": 1, "replies": [{"body": "ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "OPs post history is hilarious", "score": 1, "replies": []}, {"body": "Sigma ball lmao", "score": 1, "replies": []}, {"body": "This is crayons on steroids.", "score": 1, "replies": []}, {"body": "See you tomorrow. ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Is the bottom chart consisting of only 8 data points? I think there’s a sample size problem on the bottom chart. top chart makes sense.", "score": 1, "replies": []}, {"body": "all you fucking tired bots have the same canned responses as if you can string a coherent sentence as to why there will never be another recession you absolute clowns", "score": 1, "replies": []}, {"body": "So, buy the dips and sell the rips?\n\nHow should this inform my decisions going forward as a degenerate gambler?", "score": 1, "replies": [{"body": "You can make as much money on the downside as the upside.  Shorts and PUTS.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Sig ma balls", "score": 1, "replies": []}]}, {"body": "I read a lot of dumb stuff here, this is certainly one of them", "score": 1, "replies": []}, {"body": "Oh boy are you telling me that there is a chance of recession in the future? No way. For realzy this time? \n\nGuys, I think this guy is onto something real. Please pass me the red crayon this time.", "score": 1, "replies": []}, {"body": "Erhm what the sigma ![img](emote|t5_2th52|4276)", "score": 0, "replies": []}, {"body": "Ligma?", "score": 0, "replies": [{"body": "Ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
{"title": "Apple should not create its own Generative AI", "selftext": "2000s there were so many search engines but who won: Google. Why did they win they secured a deal to make Google a default on Apple devices. Apple didn’t spend building and marketing their search engine, they instead made billions from the real estate in everyone’s pockets. I think they should repeat this, it takes  tens of thousands of Nvidia H100s plus Datacenters, years, data, thousands of engineers and megawatts of electricity to make their own. why not just make the AI companies compete for the Real Estate. The Nvidia H100s are gonna be depreciating asset as more advanced chips such as Blackwell or other competitors replace them. Not to forget that most companies haven’t found a way to monetize this except adding to current products or optimizing production.", "id": "1d1bbxh", "created_utc": 1716757919.0, "score": 60, "upvote_ratio": 0.64, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 hour ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 2 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Bro knows nothing about why google actually succeeded lol", "score": 190, "replies": [{"body": "Such an unhinged take. They probably weren’t even old at the time if that’s their recollection. Google was already the winner well before the iPhone came along.", "score": 91, "replies": [{"body": "Such a perspective indeed reeks of nascent intelligence and has no place here amongst the seasoned, rich, and sophisticated.", "score": 44, "replies": [{"body": "Mmmmmmnnnn, quite 🧐", "score": 11, "replies": [{"body": "Hmmm yes, I am very seasoned, with salt.", "score": 4, "replies": []}]}]}, {"body": "I mean considering they’ve been posting to applying to college subreddits it’s evident they didn’t even have a pulse during this period let alone have a fully developed brain capable of assessing things they didn’t directly experience.", "score": 6, "replies": []}]}]}, {"body": "I take it you haven’t been paying attention to Google’s recent AI shitshow.  My favorite bit so far is that it said cockroaches get their name from crawling into males’ urethras.", "score": 73, "replies": [{"body": "Well where else does the cock name come from Mr wrinkle brain", "score": 26, "replies": [{"body": "From roosters, Mr Smooth Brain.", "score": 1, "replies": []}]}, {"body": "New fear unlocked, or for some people, new fetish?", "score": 6, "replies": []}, {"body": "I thought you meant that that's how individual roaches get their name. Like they crawl in and some cockroach ancestor spirit is like \"I dub thee Bill.\"", "score": 9, "replies": []}]}, {"body": " Apple is applying the Apple strategy that Apple has always used which is to allow others to take the risk of first and second move, and then harvest the winners using the massive pile of cash that Apple has and use that as the foundation for their products. They let the market figure things out, just like they did with apps, and just like they did with the iPhone, and then buy the very best and let the others duke it out.\n\nWhat Apple is doing with AI is exactly what Apple has done with every other technology wave. They’re not going to miss it. They’re just going to come out with the absolutely most kick ass version of it that everybody wants years after investors and entrepreneurs have done all the work and let everybody else make all the mistakes first.\n\nSop.", "score": 118, "replies": [{"body": "I’ve been working with the Apple ecosystem professionally since 2008, not only did I build my career as a iOS engineer I also have quite a few friends working at Apple.\n\nI have to say I completely disagree with your take here. Apple’s strategy rarely worked outside of the hardware domain, in which they had/have some of the best talent in the world in terms of engineering,  design, manufacturing, supply chain, etc.\n\nBut when it comes to service software, Apple doesn’t have such advantage. Apple Maps and Siri do not live up to the standard of their hardware. Apple TV is decent but it’s got no tech advantage over any of the other streaming services.\n\nNow when it comes to AI, follow the talent. The best and brightest are going to a few top companies in the world right now but Apple isn’t one of those destinations. It’s a field that requires just as much compute as it requires human talent.\n\nFor example Apple succeeded in the SoC product line because it managed to get some of the best talent in the world through [acquisitions](https://www.nytimes.com/2010/04/28/technology/28apple.html#:~:text=Apple%20wants%20the%20fastest%20chip,often%20found%20in%20mobile%20devices. ) and aggressive hiring. But unless Apple buys Mistral (unlikely) or OpenAI (almost impossible), it won’t have the talent war chest required to fight this campaign.\n\nBtw not only did I work for 15 years in the valley, a close family member of mine recently got a ML/AI PhD from a top university/advisor and the offers he’s been getting almost makes *me* jealous lol.", "score": 55, "replies": [{"body": "I helped launched the iPhone and am a former Apple senior engineer myself. I just disagree with you. But I respect your opinion.", "score": 31, "replies": [{"body": "I mean even in your original comment you agreed that acquisition has always been a major component of Apple’s strategy.\n\nBut the reality is that the tech industry has consolidated so much now, and even tiny *startups* in the AI space now command sky high valuations. Apple was able to buy Intrinsity for a fraction of the value of what AI startups are worth today.\n\nDoes Apple have a huge cash reserve? Yes it does, but making huge acquisitions has never been its modus operandi. What’s the largest acquisition Apple has ever done? It's barely $3B when they bought Beats. \n\nBy comparison Anthropic is valued at $20B, and OpenAI is valued at $100B. Apple has never made purchases close to that size.\n\nWhich is why I don’t think Apple’s traditional playbook applies in the software world today.\n\nThen there is the culture differences of building software vs. building hardware. Apple Maps and Siri are prime examples of Apple's software game being significantly behind their hardware game. \n\nBut again, it would be great if you can share some insights too. I’m sure you have valuable perspectives.", "score": 10, "replies": []}]}, {"body": "Apple has been doing ML, these days called AI, for a decade and a half.", "score": 2, "replies": [{"body": ">Apple has been doing ML, these days called AI, for a decade and a half.\n\nAI has existed for a lot longer than a decade and half, but that doesn't matter.\n\nThe current hype is the result of the successful application of transformers, a concept introduced by the landmark paper Attention is All You Need. \n\nAlmost everyone has been caught off-guard by the quick and successful implementation of applications using transformers (LLM being the prime example), including Google (where the paper came from), and of course Apple is completely behind in this area.", "score": 2, "replies": [{"body": "https://machinelearning.apple.com/research", "score": -2, "replies": [{"body": "You listed me a couple hundred papers. What does that tell me? \n\nDo you have any idea how many papers get submitted to a *single* ML conference these days? Thousands and *thousands*. \n\nOf course Apple spends $$$ in ML, and they have achieved successful applications in many areas (Photo, iMessage, etc come to mind), but that doesn't change the fact they are behind in the post-AIALY world.", "score": 6, "replies": [{"body": "In the latest hype.", "score": -2, "replies": [{"body": "Do people really just call what they don't understand and don't like as hype?\n\n*Nobody*, not even Apple, calls the latest shift being \"hype\". Transformers is just a huge jump forward, just like when NN was introduced.\n\nDo you call NN a hype?", "score": 2, "replies": [{"body": "“The current hype is the result of the successful application of transformers, a concept introduced by the landmark paper Attention is All You Need.“ -someone mad about it being called hype…", "score": 2, "replies": [{"body": "That's fair lol. Talking about foot in mouth moment.\n\nI do think the hype is well justified, FWIW.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Where is the top talent going? And where is the mid to low talent going?", "score": 1, "replies": [{"body": "Top *top* talents: OpenAI and DeepMind are the holy grail. Yes despite Google's fuck up they are still super well-respected in the field. Total Comp for senior engineers at those places are well into the 7 figures.\n\nAmongst other big companies, I would say Meta stands on it own. Not only do they pay top $$$, stuff like [Segment Anything](https://segment-anything.com/) is almost the standard in the industry. They are a heavy weight that contributes a lot.\n\nThen there are super high profile startups like Anthropic and Mistral. Not very familiar with the latter since it's not a SV company, but Anthropic's offer package is known for having as much *salary* as the TC of other FAANG companies ($4-600k), *plus* ISOs that's likely worth millions down the road.\n\n>And where is the mid to low talent going?\n\nAlmost all tech company are hiring AI talents, the non-top tier talents will most likely work in the application domain instead of cutting edge research.", "score": 7, "replies": [{"body": "TY these were all my targets for ML internships. The only new company is Mistral. The goal was always Apple given their past success with new tech, but perhaps I should look at the other companies.", "score": 1, "replies": []}]}]}, {"body": "How much is your friend being offered? 500K/year?", "score": 1, "replies": [{"body": "Somewhere around that, for a fresh Ph.D grad. But he does have good publications and research and *top* internship experiences.", "score": 2, "replies": [{"body": "Dude that’s unreal. My dad makes around that per year, but that’s after 30+ years of running his own practices. Your friend could literally retire in the next 10-15 years, especially if he invests the money right. \n\nGood for him.", "score": 1, "replies": []}, {"body": "How much money do you nerds make? We eat crayons round here. Psshhh", "score": 1, "replies": []}]}]}]}, {"body": "First to the market. First to overcome the initial market. First to a polished finished product. All three are viable options, and yep, apple often is the later. But not always, newton and some other interesting results when they tried first to.", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Ah, well then, I’m just too old to let you get away with that but we would generally agree. Steve slightly better after learning some lessons, and apple learning some too, was a match made in heaven. ThTs from the outside, sounds like you had more fun inside so I yield to you.", "score": 2, "replies": []}, {"body": "Steve was right about one thing: he was the only person who could not be replaced at Apple. His singular greatest strength was “we shall do this” and no one could tell him otherwise.\n\nHe bet the company on the iPod, won big. Took those winnings and doubled down (betting the company a second time) on the iPhone. And that as they say is that.\n\nPost Steve Apple is a bunch of dick waving and empire building.", "score": 4, "replies": []}]}]}, {"body": "What was all that self driving car shit then?", "score": 6, "replies": [{"body": "A mistake.", "score": 7, "replies": []}]}, {"body": "You can say it’s like picking Apples! 🍎", "score": 1, "replies": []}, {"body": "*chefs kiss* Happy cake day regard", "score": 1, "replies": [{"body": "Much loves! Very appreciate.", "score": 1, "replies": []}]}, {"body": "Happy cake day bud!", "score": 1, "replies": [{"body": "Thanks fren! So kind!", "score": 1, "replies": []}]}]}, {"body": "Google won long before the iPhone was invented.", "score": 8, "replies": []}, {"body": "If Apple doesn't want to be a fast follower and instead, a market leader, it needs to invest its resources now.", "score": 13, "replies": [{"body": "This is a \"selling the shovel\" type scenario, except instead of making shovels you actually own a fifth of all the river banks/wherever pioneers would dig.\n\nGen AI is going to be a winner-take-all market. Google pays Apple $20 billion just for it to be the default search engine on Safari, which makes up a sixth of Apple's total operating profit. For 0 incremental capex, 0 incremental expense, and 0 risk, they can simply sell that pocket real estate instead.", "score": 13, "replies": []}, {"body": "Apple is a company that has made a name for itself by not harvesting user information.  It seems uniquely poorly positioned to be a market leader here compared to companies that know everything you ever did on the Internet.", "score": 9, "replies": [{"body": "They can buy that data to benefit AND advertise privacy to their buyers? Sounds like a win win.", "score": 2, "replies": []}, {"body": "I thought they were some sort of fruit company", "score": 0, "replies": []}]}, {"body": "They should have just bought NVDA stock.  Most of us didn’t have that foresight but they should have.", "score": 2, "replies": [{"body": "It’s easy to look back and call shots", "score": 4, "replies": [{"body": "there's still time to buy, current average price target is around 1200 pre-split", "score": 0, "replies": []}]}]}]}, {"body": "How old are you?? Google was by far the search engine leader by then, people were already “googling” not searching before the iPhone was even announced.", "score": 3, "replies": []}, {"body": "Apple and OpenAI need each other.\n\nGoogle has the llm and the apps. They can add AI to phones, websites, etc. Google assistant with gemini can already set reminders, write code, etc. It will only get better. \n\nApple has the hardware and apps but is behind on llms. Siri is trash. Open AI has a state of the art llm but no apps or ecosystem.\n\nIt makes a ton of sense for these two to combine forces.", "score": 7, "replies": [{"body": "My brother in Christ just tell me who to invest in", "score": 4, "replies": []}, {"body": "Their corporate culture seems somewhat similar as well I think (at least from outside)", "score": 1, "replies": []}]}, {"body": "Yo calm down!  We want them to help push NVDA up.", "score": 1, "replies": []}, {"body": "You do realize that Apple was on a brink of bankruptcy and essentially not known at all in the beginning of the 2000s? PC dominated the market.", "score": 1, "replies": []}, {"body": "Ok. I’ll let Apple know", "score": 1, "replies": []}, {"body": "Bro they’re not lol", "score": 1, "replies": []}, {"body": "Bless your heart", "score": 1, "replies": []}, {"body": "Apple ain’t gonna have a generative AI", "score": 1, "replies": []}, {"body": "OP is a teenager that has no fucking clue what he is talking about.", "score": 1, "replies": []}, {"body": "Maybe at this point generative AI is not rocket science, but just a matter of being able to scale and having the money to do that.\n\nCheck, and check!", "score": 1, "replies": []}, {"body": "Hope Tim apple sees this so he doesn’t make a poor decision based on billions in market research/RND", "score": 1, "replies": []}, {"body": "\nLol apple already begun Ai chip with M4 🙈🤦 what are you blabbering about?? For the moment they have the chip but on the LLM side their are still behind I'm sure soon they will developer their own , just like Meta , Google, OpenAi and more coming...Software is the gold mine...Chip is just another niche of their margin for revenues", "score": 0, "replies": []}, {"body": "Anthropic was founded in 2021 and their GenAI has them valued at $18bn already.  Telling me Apple can’t beat that with their resources? Lol", "score": -4, "replies": []}, {"body": "[deleted]", "score": -1, "replies": []}, {"body": "They have tons of creatives' data on their cloud, of course they're going to train on it.", "score": -1, "replies": []}, {"body": "Google secured big wins by aquiring and merging the right companies with Maps, & Youtube, later Gmail caught fire because you had to make an account to use youtube … all in the mid 2000s before iphones. They were the default search engine for yahoo back in 2000 or so and thats what made them a household name", "score": -1, "replies": []}]}
