{"title": "Apple nears deal with OpenAI to power upcoming iPhone features with ChatGPT, says Bloomberg", "selftext": "After talking with both OpenAI and Google about their AI models, Apple is nearing a deal to partner with OpenAI and leverage ChatGPT for upcoming iPhone features, reports Bloomberg. We can expect to see the workings of both companies as soon as next month, during Apple's Worldwide Developers Conference (WWDC).\n\nAccording to Mark Gurman, who spoke with \"people familiar with the matter,\" Apple first renewed talks with OpenAI to use the startup's tech to power new AI features coming to future iPhones, and is now nearing a formal partnership. \n\nThis comes shortly after Apple was reportedly in talks with Google to license Gemini for various iPhone services. \"Those discussions haven't led to an agreement, but are ongoing,\" says Gurman.\n\nThe news comes shortly after OpenAI announced it would be unveiling new ChatGPT features this upcoming Monday, a day before Google I/O. Talks between the Microsoft-backed AI company and Apple were apparently pretty far along, Bloomberg previously reported, as discussions of an agreement had occurred for some time.\n\nWhile Apple has plenty of researchers working on the company's own AI models, those don't seem quite ready to be the star of the show, so the company has been looking for outside help.\n\nThe next big iPhone update, iOS 18, will most likely be announced during WWDC on June 10. With Apple nearing a deal with OpenAI, we may see some familiar ChatGPT capabilities integrated across popular iOS features like iMessage, FaceTime, and, of course, Siri.\n\nIt's worth pointing out that OpenAI's ChatGPT app came to the iPhone about two months before landing on Android. Apple hasn't officially announced any AI features for the iPhone, but if you look at the Pixel 8 Pro or the Galaxy S24, you can get an idea of what the new features might be: generative AI photo editing, transcription of voice memos, webpage summarization, text generation, custom wallpapers, and so on.\n\nThere aren't any details about what iPhone models the new AI might be available on, but if Apple follows its competitors, the features will likely debut on the newest flagship and slowly trickle down to other models.\n\nSource: https://www.zdnet.com/article/apple-nears-deal-with-openai-to-power-upcoming-iphone-features-with-chatgpt-says-bloomberg/", "id": "1cp6s0v", "created_utc": 1715393866.0, "score": 232, "upvote_ratio": 0.92, "num_comments": 85, "comments": [{"body": "I think this a leak for leverage but they will end up going with Gemini.", "score": 33, "replies": [{"body": "I have a pixel pro and I have yet to see Gemini contribute to anything special.\n\nA lot of things like translate, OCR, etc were tools I have always had before the whole AI thing.\n\nMeanwhile, it still random thinks someone called out the activation phase due to something unrelated while watching a video.", "score": 2, "replies": []}, {"body": "Lol really strong cope from google shareholders", "score": 1, "replies": []}, {"body": "Open AI is vastly superior to Google in the AI department... They were badly leapfrogred", "score": -17, "replies": [{"body": "On what ways? I’ve been testing out both and they’re close. In many of the questions I’ve put to both, I’d say Gemini edges it out in terms of the quality of responses. This is from a sample size of one though, so I’d be interested to hear about more broader analysis.", "score": 22, "replies": []}, {"body": "They are not. In fact Google R&D is the one that kickstarted this whole AI wave.", "score": 8, "replies": [{"body": "That's the problem with Google, they start many things but almost never continue. Same happened with AI, they were substantially ahead of every for many years until they weren't", "score": -2, "replies": [{"body": "It's really just that OpenAI went public with their chat bot before Google did, largely because OpenAI stands much less to lose from a buggy/racist/hallucinating AI and could take the risk. Google was too careful maybe, but Gemini today is definitely within the same ballpark as ChatGPT, in other words amongst the best.", "score": 13, "replies": [{"body": "I mean, the truth is that a chatbot is about the lamest possible use case for AI, anyway. \n\n\nGoogle is deploying AI to drive cars around without a human and find new medicine. A robot to replace a $5/hour Indian is not that compelling. ", "score": 3, "replies": []}]}, {"body": "> they start many things but almost never continue. \n\nThey stick with the things that MOST matter.\n\nTake the TPUs.  They started them 12 years ago.  Stuck with it.   Now have the fifth generation in production and working on the sixth.\n\n\nThat gives Google a HUGE competitive advantage.  They are the only big tech that does NOT have to pay the Nvidia tax.\n\nCompare that to Microsoft that is only now going to try to copy Google and do their own TPUs.  OpenAI has nothing.\n\nOr Waymo.  Google spent billions and been at it for over a decade and now years ahead of next best.\n\nJust completed their 1 millionth rider only fare.", "score": 1, "replies": []}]}]}, {"body": "I read this while drinking my coffee and spit it all over the place.\n\nWhat in the world are you basing this on?\n\nNobody would even have heard of OpenAI if not for Google and how they roll.\n\nThey make the great AI innovations, patent them and then let everyone use for free.\n\nJust never see that from anyone but Google.\n\nBut AI is a lot more than just LLMs. Which again would not exist if not for Google.\n\nBut things like\n\nAlphabet years ahead of everyone else. Just did their 1 millionth rider only fare.\n\nOr things like AlphaFold which is now used by a majority of research biologist.\n\nThe best way to judge AI leadership, IMO, is to look at the canonical AI organization NeurIPS.\n\nGoogle had twice the papers accepted as next best. BTW, next best was NOT OpenAI.\n\nGoogle has actually led in papers accepted every single year for the last 10+ years. Without exception.\n\nWith every year besides the last being #1 and #2. They use to split out Google Brain and DeepMind.\n\nThen there is silicon. Google is the only big tech not dependent on Nvidia as they started the TPUs over a decade ago.\n\nWhere OpenAI is completely dependent on Nvidia.\n\nGoogle now has the fifth generation TPUs in production and working on the sixth.", "score": 2, "replies": []}]}]}, {"body": "At this point, I'll believe it when it's official.\n\nI have no doubt Apple wants to license existing AI models. Apple has never invested anything in AI, they are horribly behind in this game. However, whether they go with Google, OpenAI, Anthropic, who knows. I'm sure they are exploring lots of options, and they have enough power in the market to get a good deal.", "score": 92, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Feels like Apple is peaking, milking your existing line of products until it dries out, they can ask INTC what they think about the strategy.", "score": 2, "replies": []}]}, {"body": "I suspect it'll become official on Monday considering that OpenAI says that they're announcing new features then. Announcing this on the same day would be a nice prize for them.\n\nIt most likely will hit Google again even though they're supposedly still talking about using Gemini as well (apparently the OpenAI stuff is closer). Fully expecting it to drop 2-3% on this and honestly, not bothered but then again, the market is not open, and I'm expecting it to do nothing for a while anyway.", "score": 1, "replies": [{"body": "Add in that OpenAI is expected to announce their own web browser and we're looking at potentially a larger hit imo.", "score": -7, "replies": [{"body": "The search engine that had been talked about as a possibility isn’t happening though next week.\n\nSource was the tweet by Sam around 2 PM.", "score": 12, "replies": []}]}, {"body": "What would cause the shares to drop?", "score": 0, "replies": [{"body": "The fact that there just isn’t much trust in the company right now. Apple finalizing a pact with OpenAI first (news that Apple might use Gemini had caused Google to pop a couple months back) makes it look worrisome that they may eventually get knocked down a peg. \n\nIf they have a good counter for their conference, I think it’ll be a one day thing though. If not, the earnings day gap probably fills and I see $152-155 or so before turning up.", "score": 0, "replies": [{"body": "Thanks for the explanation. Is this more of an indictment on OpenAI then? Or that Apple itself just doesn’t have much going on in the AI pipeline? Trying to understand how all these big tech and AI companies relate to each other and affect investor sentiment.", "score": 2, "replies": [{"body": "Apple's even further behind then the perception you get with Google, even if unfair, which is why you get these talks.\n\nI'm really not following how you come to \"possible indictment on OpenAI\" at all.", "score": 3, "replies": [{"body": ">Apple finalizing a pact with OpenAI first (news that Apple might use Gemini had caused Google to pop a couple months back) makes it look worrisome that they may eventually get knocked down a peg.\n\nI wasn't sure if that meant it was a negative that Apple was going with OpenAI (vs AI competitors like Google) or Apple itself.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Similar to Toyota with EV, what has Apple missed out on?", "score": 0, "replies": [{"body": "Toyota is doing it deliberately. They say they can build 90 hybrids with the rare earth metals required for one EV. They don’t assess EVs as sustainable or industry scalable technology.\n\nThey also claim that 90 hybrids have a lifetime carbon footprint 37 times smaller than a single EV.\n\nhttps://www.axios.com/2023/05/27/electric-vehicles-carbon-emissions\n\nToyota doesn’t believe EVs are the environmentally responsible choice.", "score": 32, "replies": [{"body": "Im sure Toyota is not doing it out of environmental reasons and not out the fact they dont have the tech needed to compete commercially.", "score": 8, "replies": [{"body": "I don’t think it’s a tech problem at all. They are the world’s largest automaker.", "score": 6, "replies": []}, {"body": "Also that its not profitable for most companies. Tesla might be the only one to actually turn a profit in the EV space.\n\nSimilarly, Apple might just be waiting until AI is actually profitable before implementing it.", "score": 4, "replies": []}]}, {"body": "Man I hope they get the hydrogen tech going ", "score": 2, "replies": []}, {"body": "Although you explained how it’s different, you didn’t answer my question", "score": 0, "replies": [{"body": "I was refuting that Toyota is missing out on anything at all.", "score": 5, "replies": []}]}]}, {"body": "The thing is Toyota has EV tech, they can jump anytime they want.", "score": 3, "replies": []}, {"body": "I don't think that's a very good analogy.\n\nAI encompasses a lot of different things. AI that's good at one thing isn't necessarily good at another thing. AI is potentially a lot like the invention of the Internet with all the broad changes it can enable overtime as the technology improves.\n\nEV's on the other hand are literally just a new technology cannibalizing an old outdated technology.", "score": 2, "replies": [{"body": "So what has Apple missed out on", "score": 1, "replies": []}]}]}, {"body": "Can't see Apple working with Google who's basically their biggest competitor with Android.", "score": -5, "replies": [{"body": "Wait till you find out who makes the screens for their iPhones.", "score": 9, "replies": []}, {"body": "And Microsoft isn't a competitor?", "score": 2, "replies": []}]}]}, {"body": "Siri still gonna be dog shit somehow.", "score": 11, "replies": []}, {"body": "All of this is what we already have and most of it we don't want. How is this AI? Seems like gimmicky software features we'll overuse and make content dumber", "score": 21, "replies": [{"body": "A lot of people seem to like digital assistants. Siri is widely known as the worst and OpenAI integration could easily make it better.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "We are just starting in the area of AI and LLMs, if you really think its a bubble u r crazy. It's gonna change the world.", "score": 1, "replies": []}]}]}, {"body": "I hope they're working on their own in the background", "score": 5, "replies": [{"body": "AI is extremely expensive and there are a lot of companies in the space already. It would make more sense to partner with an AI company in need of cash.", "score": 1, "replies": []}, {"body": "Even if they are it will be difficult and expensive to catch up.  Right now the top players are hardware limited and making huge investments into the electoral and refrigeration infrastructures required to run the massive compute.  Apple is 1-2 years behind in software and 1-2 years behind in compute and infrastructure.", "score": -4, "replies": [{"body": "Usually that doesn't matter for Apple because any AI software they do release will be for their products only so it doesn't need to be the best, but it needs to have good value add to their hardware line up.", "score": 2, "replies": []}]}]}, {"body": "AI uses an incredible amount of electricity. The owner of the model will have to pay that cost and pass it onto the end user. AI will be powerful but it won’t be cheap. Competition means these companies (MS/Google/Amazon) are fighting for market share - at the expense of margins.\n\nMaybe Apple can play the providers against one another to get itself a good deal - all the benefits of AI without the cost. All whilst learning about this new innovations and developing their own product ready to be released with iPhone 20", "score": 3, "replies": []}, {"body": "Great, I guess I’ll be adding discounted shares to my GOOGL position on Monday morning. Enjoy your weekend everyone!", "score": 6, "replies": [{"body": "Not familiar with all this, what would cause the shares to drop?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Got it, thanks for the explanation.", "score": 1, "replies": []}]}]}, {"body": "It’s down like 1% from the ATH…", "score": 3, "replies": []}]}, {"body": "Apple's shifting from in-house to external partnerships in crucial technologies like AI…", "score": 5, "replies": []}, {"body": "So do we immediately buy more shares of AAPL before the announcement?!!!", "score": 2, "replies": []}, {"body": "Hope they don’t go with chatGPT tho.  That thing censors answers to logical questions if the answer isn’t PC.", "score": 3, "replies": [{"body": "I wouldn't expect Apple to be any different. Nobody wants to be the first with an AI that is remotely controversial.", "score": 1, "replies": [{"body": "Facts shouldn’t be controversial…", "score": 1, "replies": [{"body": "What’s an example of a question with a factual answer ChatGPT won’t answer?", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Even if they go with ChatGPT, Apple will no doubt use a custom version with their own system prompts at the very least. Which is to say it'll still be censored but according to Apple's rules instead of OpenAI's.", "score": 1, "replies": [{"body": "Still, getting “I’m sorry, I can’t answer that because it could perpetuate _________woke shit _______”\n\nIs dumb", "score": 1, "replies": []}]}]}, {"body": "Google’s days are numbered.\n\nOpenAI search engine coming soon too.", "score": -13, "replies": [{"body": "Have you used any of googles AI products? Literally anything from google is better than openAI", "score": 13, "replies": [{"body": "Please give me one example, I have the exact opposite experience. Open Ai and anthropic seem miles ahead of Google and It will probably take years for them to catch up (if they ever do)", "score": 1, "replies": []}, {"body": "Were the founding fathers and nazis black?", "score": 1, "replies": [{"body": "Maybe Ai knows something we don’t. Have you ever met a founding father?", "score": 1, "replies": [{"body": "🤣 ", "score": 1, "replies": []}]}, {"body": "The only error you can mention regarding google. Which they immediately fixed btw.", "score": -2, "replies": [{"body": "It’s intentional error, and it makes me never try google ai. If they did that, imagine what else is behind the scenes.", "score": -3, "replies": []}]}]}, {"body": "I much prefer Co-Pilot. It's built right into Edge, and there's no limits on how many queries a day I can use with a free account. \n\nI tried Bard and Gemini but haven't been impressed enough to switch away from Co-Pilot.", "score": 0, "replies": [{"body": "Gemini is directly integrated into google. If you type anything into google, without going to Gemini’s page, it will give you an answer.", "score": 1, "replies": []}]}]}, {"body": "If google never changed then you would be correct.\n\nGoogle is changing.  They have to, they are, and thats all there is to it.", "score": 1, "replies": []}, {"body": "Google is just too familiar of a search engine to go away. I try and change search engines a few times a year but after a couple days of using DDG or Bing it just feels off. They are also licensing it to Microsoft so it probably won’t be as soon as everyone thinks.", "score": 1, "replies": []}, {"body": "You seem to have insider information, cool! When is the search engine coming? And what does it better than Google? What is their plan to make consumers change their behaviour? How are they going to tackle the billions of android devices with pre installed chrome browser and Google search bar? How are they going to tackle the billion safari users with Google search as default? What is Microsoft’s role in all of this? Are they financing a search engine and cannibalise Edge/Bing and Co-Pilot?\n\nSince you know that Googles days are numbered, you seem to have all these answers.", "score": 0, "replies": []}]}, {"body": "Another hey siri fiasco", "score": 0, "replies": []}, {"body": "Fuck google", "score": 0, "replies": []}, {"body": "Thank God they went with open ai and not shitty Gemini", "score": -6, "replies": []}, {"body": "To be honest, I’d rather have copilot. Chatgpt feels like a lazy google at this point, pass.", "score": -3, "replies": [{"body": "Does anyone want to tell him.", "score": 4, "replies": [{"body": "Tell me what? I like copilot, I don’t care if it’s unpopular, chatgpt fucking sucks.", "score": 1, "replies": [{"body": "Copilot and the ChatGPT UI both use the same APIs from OpenAI. They’re the same models but tuned differently", "score": 3, "replies": [{"body": "Ok, so again, I like Copilot better. I didn’t know it had anything to do with tuning, I’m ignorant AI enjoyer, so what lol.", "score": 1, "replies": [{"body": "So nothing lol - I was just passing on the info. Enjoy your upcoming week 🫡", "score": 0, "replies": []}]}]}]}]}]}]}
{"title": "Starting today, Tesla is offering a loan rate of 0.99% APR for all new Model Y finance orders in the U.S.", "selftext": "", "id": "1cpdjlx", "created_utc": 1715419517.0, "score": 215, "upvote_ratio": 0.89, "num_comments": 119, "comments": [{"body": "That's a really good price. Much less than I paid, but that's life. Although I'm glad that Tesla doesn't spend money on running TV commercials, it does come with some downsides. So my mother,  who's retired, has shown a lot of interest in the model Y after seen mine. She watches other car companies run TV spots about how they're \"now offering 0% APR!\" or \"starting at $31,500!\", but it's different with Tesla. I told her today about this offer and she's definitely interested. She's also wondering why she hadn't heard anything. \n\nI guess my point is with the exception of occasionally checking the company's website, reading somebody posting about it on Reddit like this, or some random tweet from Elon, the news of new pricing deals and discounts doesn't really travel as much. I think in some ways, especially with older people who aren't sitting on their computers, it limits who is made aware of these deals. Unless you're in the loop, I don't think any of it travels well.", "score": 29, "replies": [{"body": ">Unless you're in the loop, I don't think any of it travels well\n\nIt doesn't, and that's why people advertise. Its like nuance has been lost in this conversation around advertising and distilled down to either do nothing, or pay journalists for good coverage. People won't know about a product that will sell itself if they never hear about it, because people live in groups and social circles and communities where there's only so many ways to even get a word in. And the answer to bad faith advertising against tesla does not only have the two answers of do nothing or act in bad faith back. It's understandable that on one hand its hard to trust the marketing and advertising and SEO industry, but on the other, it is not a monolithic industry with uniform practices and there are clear returns on investment to advertising that tesla is leaving on the table, because of the way elon feels about it and that he is incapable of separating the nuance.", "score": 8, "replies": [{"body": "Well the thing is word of mouth selling is the best and you really should only advertise to get the remaining market you don’t have cause it’s the most expensive to acquire", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": ">Until their production far exceeds demand we won't see these ads anymore.\n\nTesla wouldn't be cutting prices like this if their production didn't exceed demand.", "score": 2, "replies": []}, {"body": "If you want seniors, don't make then relearning driving. Give them Cockpits like Volkswagen or Hyundai in their EVs with good driver assist systems.", "score": 2, "replies": []}]}, {"body": "They were selling all their inventory by running the factories at full capacity till like a quarter or two ago. Tesla is just an entitled spoiled little brat of a company mostly because Musk is like that. They probably don't have the talent to go Just In Time like Toyota is also why they increase margin cheapening up manufacturing. It'll take them a while to understand how to actually market a car when it just doesn't sell itself because you are the only supplier on a heavily subsidized market.", "score": -1, "replies": []}]}, {"body": "I've been waiting for them to pull this lever for awhile, I wonder why now and not sooner?", "score": 17, "replies": [{"body": "Halfway through the quarter. Sales must be abysmal", "score": 35, "replies": []}, {"body": "Expectation that interest rates will not rise in the future and will start to fall relatively soon, i.e. less risk now than a year ago", "score": 1, "replies": []}, {"body": "I think as FSD becomes more ready, they can justify less profit on the initial sale with the hopes of recouping it in FSD subscriptions.", "score": 0, "replies": [{"body": "Or just the need to capture more and more edge cases asap", "score": 0, "replies": [{"body": "Yeah that also makes sense", "score": 1, "replies": []}]}]}, {"body": "Tesla does not have the capital requirements to provide their own financing, so I’d imagine it’s a combo of getting things sorted with the banks, plus just waiting for the right time to launch.", "score": 1, "replies": [{"body": "They're not providing any financing out of pocket, they're selling the cars and instead of getting paid $35k up front they're deferring cash flow in order to sell more cars and book more revenue now. It's different from a traditional bank providing financing where they would indeed need the cash up front to provide the loan to the borrower.", "score": 6, "replies": [{"body": "Deferring cash flow where?", "score": 1, "replies": [{"body": "To the future", "score": 1, "replies": []}]}]}, {"body": "They have 26.86 billion cash on hand https://companiesmarketcap.com/tesla/cash-on-hand/", "score": 3, "replies": [{"body": "Hahaha yeah methinks they probably do have enough money LOL.  \n\nTbh the Tesla hate on reddit (and really everywhere) is so absurd--if you are not excited about EV's that is totally fine, but I find it comical the amount misinformation that is being spread by others", "score": 1, "replies": []}]}]}]}, {"body": "That's an awesome rate. Id buy one. I was looking for a car and checked the rates in the UK and it priced me out the market. 0.99 and I would have clicked buy", "score": 23, "replies": [{"body": "Haha exactly I checked as well seemed too good to be true, I will buy one outright when I have sold half my shares", "score": 4, "replies": [{"body": "I mentally convert the price of a Tesla to # of shares.  I'm hoping by the time my late registration for the cyber truck gets called the price in share will have improved, it has FSD and they have the bugs worked out.", "score": 5, "replies": [{"body": "lol", "score": 0, "replies": []}]}]}]}, {"body": "https://twitter.com/SawyerMerritt/status/1789096416872165858\n>This means the monthly car payment (before any incentives & savings) is now ~15% lower than it was yesterday.\n>\n>Monthly car payment before the special loan rate of 0.99% APR:\n>* Model Y Long Range RWD: $706/month\n>* Model Y Long Range AWD: $756/month\n>* Model Y Performance: $815/month\n>\n>Monthly car payment after the special loan rate of 0.99% APR:\n>* Model Y Long Range RWD: $600/month: \n>* Model Y Long Range AWD: $643/month\n>* Model Y Performance: $693/month\n>\n>All of these figures DO NOT include the $7,500 Federal EV credit or probable gas & maintenance savings.", "score": 25, "replies": [{"body": "Still more than my gas burning Lexus RX", "score": 1, "replies": []}]}, {"body": "Now reenable FSD transfers too", "score": 4, "replies": []}, {"body": "Holy shit This is a great deal", "score": 9, "replies": []}, {"body": "I’ve been tracking the deals for a while. From seeing this offer to buying the car took me 15 mins. Its a no brainer if you want to a Model Y", "score": 3, "replies": [{"body": "Bingo me too. I have a 2020 Model 3 and have been looking to size up to a Y with a growing family and as soon as I saw the email for 0.99% APR I’m like yeah I’m doing this. And add in the federal tax credit, it is a no brainer. Already ordered and picking up Tuesday.", "score": 2, "replies": [{"body": "Howd you get it so fast? Mine says arriving in February 2025 on the app please let me know thank you", "score": 1, "replies": [{"body": "Depends on the country/state you love in. I live next to the Fremont factory", "score": 1, "replies": [{"body": "Lucky duck!", "score": 1, "replies": []}]}]}, {"body": "I picked it up past Wednesday! Loving it so far.", "score": 1, "replies": []}]}]}, {"body": "What a great use of capital reserves!  Keep the transition going and factories humming despite the Fed!", "score": 3, "replies": []}, {"body": "*for well qualified buyers", "score": 8, "replies": [{"body": "You think the preapproval matters or nah?", "score": 1, "replies": [{"body": "Nope. Preapproval does not guarantee anything. They say that when you go through the preapproval process.", "score": 1, "replies": []}]}]}, {"body": "This looks great but if doesn’t move the needle drastically back to where sales were around the time of low interest rates, then it proves a very very sad fact: people no longer want to buy teslas and affordability is not the issue and demand is not “infinite”. 5 months from now the stock either moons like 50% or plummets around the same.", "score": 7, "replies": [{"body": "bro the entire economy has completely shifted.  affordability is the issue for car sales across all sectors and 5% decrease in rate is not going bring sales to where they were.", "score": 0, "replies": []}]}, {"body": "can i refinance the MYP i bought a month ago hahhahah", "score": 2, "replies": [{"body": "Did you find out if you can refi to this rate? I bought a MY in January with Tesla financing.", "score": 1, "replies": [{"body": "I did, it’s only for new purchases unfortunately", "score": 1, "replies": [{"body": "You contacted support and that's what they told you?\n\nWhen did you buy yours?", "score": 1, "replies": [{"body": "I purchased mine in February and I was told that it was for people applying for their first loan only. I asked if there was a cutoff and they reinforced that it was only for people seeking to finance any new purchase. So it didn’t even have to be a brand new car, it could from their used inventory but it’s the first time you are seeking to purchase.", "score": 1, "replies": [{"body": "Dang that sucks. I guess the flip side is that we got to take advantage of the inventory discounts that they got rid of.", "score": 1, "replies": [{"body": "That’s exactly how I’m trying to view it! I’m at 2.99 from my credit union which at the time was a fantastic rate for what was out there so I’m not going to beat myself up over this", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Things must not be going well.", "score": 5, "replies": [{"body": "Instead of paying non-essential and unproductive employees at TSLA, Elon puts the savings to offer lower prices.  Smart move.", "score": -9, "replies": [{"body": "Yes off course the entirely unproductive…. Checks note… supercharger division.", "score": 10, "replies": []}, {"body": "How would you even know how productive they are?", "score": 4, "replies": []}, {"body": "It's perfectly fine to say he's screwing up. He wont find and hurt you.", "score": 2, "replies": []}, {"body": "Found an Elon worshipper.", "score": 0, "replies": []}]}]}, {"body": "This is an amazing deal.   But I think prices are going lower.  Not the rates.", "score": 2, "replies": [{"body": "Yeah I test drove a Tesla Model Y last week and the Tesla salesman told me he was expecting there to be a lot of great deals on 2024 models once the 2025 models start coming out.  \n\nTelsa has been ramping up production and supercharger installation for years, but EV sales have recently slowed, so it definitely makes sense that we will start seeing more and more deals.\n\nI wish I knew if they were going to offer a financing promotion like this as it expires tomorrow, and I am totally on the fence right now LOL.", "score": 1, "replies": []}]}, {"body": "Sales are in deep shit for this and a new y is around the corner", "score": 3, "replies": []}, {"body": "Can anyone explain the odd math I witness when calculating auto loans (this is not just a Tesla problem)\n\nCar price:  $100,000 (selected for easy math)\n\nCar loan: 1%\n\nLogical Monthly payment for 100 month loan: $1010\n\nActual Monthly payment: $1046\n\nIt comes out to around 4.6%\n\nTry it with Tesla.  The math is a little harder because it’s not 100 months, it’s 0.99% and  the sale price is not even, but when you calculate it out it’s still 4.6%\n\nWhat am I missing here?", "score": 4, "replies": [{"body": "Compound interest. They don't charge you 1% at the beginning and just stop. They charge 1/12 of 1% each month based on what you owe. You can look up amortization if you want to learn more.\n\nSource: Am a math professor.", "score": 19, "replies": [{"body": "Ahhh…that’s why paying extra principal is such a huge savings.\n\nThanks", "score": 6, "replies": []}, {"body": "Don’t need to be a math professor to understand or explain amortization. It’s a shame people grow up without basic financial learning.", "score": 2, "replies": []}]}, {"body": "What you described is how a loan works when you get it from the mafia.", "score": 10, "replies": [{"body": "Underrated comment", "score": 2, "replies": []}]}, {"body": "You are missing the work Annual. Yearly. They are charging you 1% of the total per year.", "score": 1, "replies": []}, {"body": "Come on man it's an ANNUAL interest rate. You're kidding me right", "score": 1, "replies": [{"body": "Ahhh the fake outrage of the internet.  Where keyboard warriors act as if everyone should no everything they do.  \n\nWell buddy, here is a good old fashion salute to the asshole in the room.", "score": 1, "replies": []}]}]}, {"body": "Just spoke with a potential bot from Tesla. He stated that if I qualify for the federal tax credit, I can use it to pay for the down payment for the 0.99% APR financing option. Can anyone confirm if this true?", "score": 1, "replies": [{"body": "Any luck on getting an answer about this? I'm interested but 10% down may be a bit of a stretch.", "score": 2, "replies": []}, {"body": "Confirmed,", "score": 1, "replies": []}]}, {"body": "Car Price increases. Good job Elon! :-)", "score": 1, "replies": [{"body": "That's not true? Stop spreading false information", "score": 1, "replies": []}]}, {"body": "Clearing inventory for Model Y refresh?", "score": 1, "replies": []}, {"body": "I purchased my Tesla MYP last month on 4/20 in Ultra Red and white seats with a 6.39% APR & a $5650 inventory discount. Is this deal better than the one I got? And is it too late to get this one?", "score": 1, "replies": [{"body": "From what others have said apparently the promotion is for new loans only.\n\nSounds like you got a great deal though--curious as to how you got such a large inventory discount?", "score": 1, "replies": [{"body": "This was right before they removed the inventory cars to streamline their purchase process and increased the price of the car by $2000. However the monthly for financing is lower with the 0.99% APR. Glad to know it's still a good deal nonetheless!", "score": 1, "replies": [{"body": "Ah okay gotcha.  Thanks.", "score": 1, "replies": []}]}]}]}, {"body": " Checked canada prices without reading the title and seeing on “US orders”.", "score": 1, "replies": [{"body": "Yeah would have bought today if this was available in Canada.", "score": 1, "replies": []}]}, {"body": "What are the drawbacks of this? I dont know how car financing works, but would this mean they are using their cash to finance it themselves? I doubt banks offer interest rates at these prices.", "score": 1, "replies": [{"body": "Its just a price cut in a different form", "score": 1, "replies": []}]}, {"body": "It's pretty funny that Tesla has to do this. RIP", "score": 1, "replies": []}, {"body": "Chinese electric vehicles close to be on our market 1/10 of the value. Not a surprise.", "score": 1, "replies": []}, {"body": "I literally bought my model Y on FRIDAY at the the 6.49%. Anyone have tips on how I can get them to give me the .99%? I bought one day too early and it’s an almost $200 per month difference.", "score": 1, "replies": [{"body": "Did you call tesla and speak to them about getting honored?\nWe bought our tesla y maybe a day before", "score": 1, "replies": []}, {"body": "Contact support", "score": 1, "replies": []}, {"body": "Did you get any help with this? Did they adjust your rate? I’m on the same boat as you. I literally just got it on Friday and that’s when they announced it. ", "score": 1, "replies": []}]}, {"body": "We bought the tesla y literally yesterday. Can I still be eligible for this offer? I am upset", "score": 1, "replies": [{"body": "Let me know if you get anywhere with this. Same thing happened to me. ", "score": 1, "replies": []}, {"body": "I thought this was you cousin's car loool", "score": 1, "replies": []}]}, {"body": "I do wonder, if you buy now, will you get a unit fresh from the factory or something which may have been waiting in a lot for a couple of months?\n\nAs I understand, if it was in a lot for a while, they have to check it out to make sure everything is still good before they send to the buyer. Do they do that?", "score": 1, "replies": []}, {"body": "Curious if this will go to other models. Have been eyeing a model x", "score": 1, "replies": []}, {"body": "If I were in the market, I'd be buying.  Even with the upgrades, it's only a $350/mo lift over my current payment to go from a '14 Verano to a '24 Model Y.  Then add to that about $2,500 in gas savings per year, probably $750 in maintenance costs, less the insurance hike...\n\nIf only I (1) didn't have a 1-mile commute to the office right now, and (2) wasn't in the midst of changing jobs and locales, which will throw my budget out whack.", "score": 1, "replies": []}, {"body": "I ordered a Model Y and it says 9%", "score": 1, "replies": []}, {"body": "I bought a model Y in January with Tesla financing. Am I eligible to refinance to this new rate?", "score": 1, "replies": []}, {"body": "When did Tesla increase the interest rate on Model Y back to 6%?", "score": 1, "replies": []}, {"body": "It’s clearly selling well 🥲", "score": 1, "replies": []}, {"body": "This totally seems like what a company with extremely healthy financials and $25 billion in the bank would do. 🙄", "score": 0, "replies": [{"body": "Huh? Lots of car companies are offering financing deals right now.  Hyundai and Kia both I know for sure, and those are just the two companies I am looking at.", "score": 1, "replies": []}, {"body": "To be fair, I think car companies in general are facing a growing crisis. The used market is capitulating, inflation is forcing buyers to make tough decisions, so a lot of buyers are looking at used cars right now. Car manufacturers are seeing an increase in inventory, so not only are they competing with the used car market, they’re also competing with the other companies that have increasing inventory numbers. It’s kind of the pendulum swinging back the other way finally after all the supply squeezes+increased money supply due to Covid", "score": 1, "replies": [{"body": "Great points.  This issue is compounded when your whole company is a Ponzi Scheme.", "score": -5, "replies": [{"body": "Ponzi Schemes pay dividends, really high dividends. You don't run a Ponzi scheme with no dividends for 20 years.", "score": 2, "replies": [{"body": "You would if you could.", "score": 1, "replies": []}]}]}]}]}, {"body": "So happy I just bought mine a month ago 🥲 that 1% is an insane deal", "score": 1, "replies": [{"body": "Yeah ... same boat, I bought when they dropped the price 2K. Wish I had waited. C' est la vie ...", "score": 1, "replies": []}]}, {"body": "Can it also offer a loan for my electricity costs", "score": 1, "replies": []}, {"body": "Reminder in June 2023 they did 0% APR for the Model 3. Wait it out. Better deals to come.", "score": 1, "replies": [{"body": "Price was higher", "score": 1, "replies": []}, {"body": "Ah yes, good to know--thanks for the info.\n\nEspecially if there is a Model Y refresh, there will be all kinds of deals they run.", "score": 1, "replies": []}]}, {"body": "Oh this might be a good time to hunt for EV deals.", "score": 1, "replies": [{"body": "100%--the EV market has been on fire for the last several years, but it finally cooled down in the last few months, so right now is the perfect time to be shopping for an EV, especially a Tesla", "score": 1, "replies": []}]}, {"body": "Im guessing this doesn't apply to the model X plaid?", "score": 1, "replies": []}, {"body": "Sales have got to be historically bad for them to be doing this", "score": 1, "replies": []}]}
