{"title": "The $BB DD You Should Probably See Before Buying", "selftext": "Someone recently posted their $BB yolo yesterday, and that piqued my interest again in the stock. Most people remember BB as the dominant cellphone of the 2000s before Steve Jobs and his pancreas released the iPhone. BB phones were practical, resilient, and most importantly *secure* for a device of that era.\n\nSo like a bitch in heat, I passionately purchased calls earlier today. But soon thereafter, buyer's regret took a hold of me after sifting through $BB 10-Ks and old DD. I compared some data between competitors, and **soon realized how much of a shitshow this stock currently is.**\n\n**2021: Bad - No offense to the guys that made $BB DD in the past, but it was all pure speculation, probably so that the highly esteemed** ***ritards*** **of WSB would buy their bags.**\n\n* Pros: Very high short interest, nice lemon squeezy; plus tons of business potential with their tech in the EV sectors, IOT, and Cybersecurity.\n* Cons: BB had practically no revenue growth; bad financials; an exciting deal with Amazon whittled away to nothing. \n\n**2024: Slightly less bad, still not worth buying without chance of short squeeze**\n\n* Pros: Less debt, stronger sales and resilience in cybersecurity; sales strategies starting to look promising; meme buzz\n* Cons: Flat revenue growth, difficult financials; **much less short interest, 8% so no squeeze likely**; customer dissatisfaction/stronger competition\n\n**Financial:** I created a spreadsheet to calculate data pulled manually from 10-Ks to compare past years numbers, but figured this would be too much to add to the post and frankly it's a lot of extra work than needed. I know most of you would just skip over the numbers.\n\nBB been spending tons in R&D in past years, and this has taken chunks of what would be juicy profits. Now in what seems like a move to gain interest from investors, they are making cost cuts to improve financials. This could mean falling behind in tech advantage to larger companies like MSFT.\n\n* Total revenue was up $853mil (2024) vs. $656mil (2023) from last year, but still down from 2020 and 2021\n* Net income (money that you take home) was negative 3 out of the 4 last years (due to very high operating expenses)\n\n|YEAR|2021|2022|2023|2024|\n|:-|:-|:-|:-|:-|\n|**Net income**|**-$1.1bil**|**$12mil**|**-$130mil**|**-$734mil**|\n\n* Debt slashed by 45%, and traded for longer term repayment, but with higher interest rates.\n\n**Technology:** Competition in this sector is *ROUGH*... tons of different endpoint management and security products out there... including Microsoft, Cisco, and Google. Cybersecurity companies such as CrowdStrike, Palo Alto and IBM, make it difficult for BB to get their foot in the door. Not to mention there's tons of posts from actual IT/Security folk on reddit that have moved away or avoided using Cyclance, BB's security platform.\n\n[Why is Cylance doing so poorly Business Wise compared to Crowdstrike, Palo Alto, Microsoft etc. : ](https://www.reddit.com/r/cybersecurity/comments/18o9ksn/why_is_cylance_doing_so_poorly_business_wise/)\n\n[Is Cylance I’m still a thing in 2021+? : ](https://www.reddit.com/r/Cylance/comments/kbj08e/is_cylance_im_still_a_thing_in_2021/)\n\n[Endpoint protection options : ](https://www.reddit.com/r/sysadmin/comments/ps2yeh/endpoint_protection_options/)\n\n**Buzz:** Only way in short term that BB price will drive up is if retail buys a fuck ton, and while the cheap price is appealing, the other meme stocks are more attractive.\n\nIn conclusion, I regret my financial decision to buy calls and hope this will help others make better decisions than me.\n\n# TL;DR: $BB is not worth your money unless you like pain.", "id": "1csbwfg", "created_utc": 1715745686.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 70, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 105 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "Ive been holding my $BB since 2021 :(", "score": 2, "replies": []}]}, {"body": "So…buy?", "score": 122, "replies": [{"body": "I ran this post through ChatGPT 4o and that’s what the lady said", "score": 21, "replies": []}, {"body": "That's what I'm doing. Was waiting for the impetus and here it is!", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|27189)", "score": 2, "replies": []}]}, {"body": "I stopped reading at $BB, i’m in mf let’s gooo", "score": 109, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4258)", "score": 7, "replies": []}]}, {"body": "this person has puts", "score": 78, "replies": [{"body": "![img](emote|t5_2th52|31225)", "score": 2, "replies": []}]}, {"body": "Wayy too much effort to not have shorts or puts.", "score": 45, "replies": [{"body": "The winning strategy as usual", "score": 1, "replies": []}]}, {"body": "Sounds like I’m buying!!", "score": 46, "replies": []}, {"body": "Vote me up as a dislike button ⬆️", "score": 94, "replies": []}, {"body": "Who said this was about company values and sich?", "score": 33, "replies": []}, {"body": "It’ll probably go up because I’m not buying", "score": 28, "replies": []}, {"body": "mf has puts. buy buy buy 🚀🚀🚀🚀", "score": 25, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}, {"body": "All I read was buy as much BB as you can see", "score": 11, "replies": []}, {"body": "dont be deceived lads, keep buying", "score": 43, "replies": []}, {"body": "jokes on you sir. i have a degradation kink. ALL IN 🚀🚀🚀🚀", "score": 10, "replies": []}, {"body": "Explain how SentinelOne and other major cybersecurity endpoint providers do similar revenue with some more cash on hand but are worth 3x Blackberry then. One is undervalued or the other is overvalued.\n\n|Metric|SentinelOne|Blackberry|\n:--|:--|:--|\n|Revenue|174M|173M|\n|Net Income|-72M|-56M|\n|Cash on Hand|0.926B|0.23B|\n|Net Profit Margin|-41.33%|-32.37%|\n|Market Cap|6.68B|2.04B|\n\nTL;DR BlackBerry still undervalued ??", "score": 30, "replies": [{"body": "So… short sentinel one?", "score": 5, "replies": []}, {"body": "because $BB end-point security is not an enterprise solution. SentinelOne also delivers a lot of high margin services compared to $BB.", "score": 1, "replies": [{"body": "> High margin\n\n> Worse margin %\n\n> same quarterly revenues \n\nok.jpg", "score": 2, "replies": []}]}]}, {"body": "BB is a turtle surrounded by hares. However, instead of training in speed, it fortifies its defence. Why? Because it knows that regards will find it one day and will use their regarded strength to throw it to the moon. And if it doesn’t reach and falls, at least it survives to wait for other regards. Source: some investment booklet talking about turtles and hares or something ![img](emote|t5_2th52|8882)", "score": 17, "replies": []}, {"body": "BB to $35🚀🧨", "score": 13, "replies": []}, {"body": "Time to buy!!", "score": 13, "replies": []}, {"body": "I’m buying more…", "score": 12, "replies": []}, {"body": "Cant read and bought $15k worth of shares", "score": 6, "replies": []}, {"body": "The 2021 DD was shockingly bad.\nI wonder what regard was responsible for posting that...\n\nhttps://www.reddit.com/r/wallstreetbets/comments/nrh0wu/the_bb_resistance_is_a_good_sign_dd_refresher/?utm_medium=android_app&utm_source=share", "score": 4, "replies": [{"body": "yours was one of the good ones, don't worry ;)", "score": 1, "replies": []}]}, {"body": "This person fucks and is also making money off me right now", "score": 6, "replies": []}, {"body": "The only thing that matters in short term speculation is whether or not people are willing to buy it.", "score": 9, "replies": []}, {"body": "Institutions are buying the fck out of BB what are you even mumbling about.  Everything you said was expected as well during the pivot to software.  Ain’t many bag holders most have DCA and are holding long term.  In the end the bears will get fckd and I can’t wait so we can say told you so.  BB has a lot going for it as long as we continue to execute, so buy or don’t buy most don’t give a fck", "score": 21, "replies": [{"body": "Lol what in the \"trustmebro\" is this?\n\nLet's start off by naming some of these institutions that have recently started \"buying the fck out of BB\"\n\nBecause everything else you said after that can't be proven", "score": 13, "replies": []}, {"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 10, "replies": []}, {"body": "Bags heavy, knees sweaty, longs unsteady, moms spagetti.", "score": 5, "replies": []}]}, {"body": "But more BB ![img](emote|t5_2th52|31224)![img](emote|t5_2th52|4276)", "score": 3, "replies": []}, {"body": "Degenerate option players are getting priced out of game store options.  Looking for the cheaper option to 10x.  I'd guess it's got room to run.", "score": 3, "replies": []}, {"body": "SI was lower in 2021 than it is now. \n\nMost of the bad parts of the revenue were NON CASH write offs. It's disingenuous to use GAAP numbers, as they include things like a 600m write downs of legacy programs, or 1 time restructuring costs. That is to say it can \"lose\" 700m, yet basically break even on cash. \n\nI agree on Cyber Security. Tough market, lots of competition, no growth. It's worth at best liquidation value. \n\nThe crown jewel is still the IoT/IVY. It's been actually growing, up to 30% in the last couple years, and although it's pulled back, is still growing, 80%+ margins.", "score": 4, "replies": []}, {"body": "Squeeze my dongus", "score": 11, "replies": [{"body": "Calls on your dongus that it squirts", "score": 1, "replies": []}]}, {"body": "John Chen gone this time. That alone is bullish", "score": 8, "replies": []}, {"body": "So you’re saying buy right?", "score": 3, "replies": []}, {"body": "guys $BB end-point security is trash AND the market is saturated with high-quality, well run competition. On top of all this - they are Canadian.", "score": 3, "replies": []}, {"body": "I bought because I like black berrys they are tasty", "score": 3, "replies": []}, {"body": "Get outta here Put put boy", "score": 5, "replies": []}, {"body": "OP I too share your regrets. I’m just hoping for a huge pop and sell with the lowest loss I can get.", "score": 5, "replies": []}, {"body": "It's refreshing to see some solid introspection amongst all the dopamine-highs of regarded meme FOMOing for the sake of it. Good job. \n\nNow if only people would apply the same introspection to AMC because holy god that's a diluted mess too.", "score": 10, "replies": [{"body": "Nah DFV had \"AMC 🚀\" on his tiktok Account, so ofc it's gonna rocket duh", "score": 1, "replies": []}]}, {"body": "I was exicted! Then I have to thank you for reminding me of my bags. Heavy bags....next time move the TL;DR to the top.", "score": 2, "replies": []}, {"body": "I put all my $8 in!! To the mooon!! Or maybe stock price of $4… 😁😁", "score": 2, "replies": []}, {"body": "What is this, r/investing?", "score": 2, "replies": []}, {"body": "Nice move OP, make the universe think you’re against BB so you can secretly inverse yourself. I like your thinking!", "score": 2, "replies": []}, {"body": "The DD no one asked for but everyone needed", "score": 2, "replies": []}, {"body": "I stopped reading at ritard. Could we all use that now? It sounds much better than regard. Or maybe reeree?", "score": 2, "replies": []}, {"body": "Don’t buy bb.", "score": 5, "replies": []}, {"body": "What did I tell you people", "score": 2, "replies": []}, {"body": "yolo ur bag for bb", "score": 1, "replies": []}, {"body": "BB has a large qnx backlog though that keeps increasing, i.e future profits. In addition, ivy hasn't starter monetization yet, which is where the BB bet should be made.", "score": 1, "replies": []}, {"body": "I bought shares to sell covered calls to you hahaha. Bought the back for 66% off, will sell another CC next pop!", "score": 1, "replies": []}, {"body": "Nah he’s not wrong tho.", "score": 0, "replies": []}, {"body": "All people i met during my work who have been working for BB were unpleasant to deal with. That was enough for me.", "score": -2, "replies": []}]}
