{"title": "I really believe in Nvidia but it always seems \"too high,\" and then it goes higher. Should I just bite the bullet and invest now?", "selftext": "[removed]", "id": "1ctgvaa", "created_utc": 1715876513.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 78, "comments": [{"body": "Sorry -- we removed your post or comment because it's low effort.  Please put effort into what you post to r/stocks.  Any of the following are considered low effort and will result in your post or comment being removed:\n\n* Posts or comments that rely on memes to get your point across\n\n* Posts or comments which are basic one/two sentence questions\n\n* Posts or comments that are similar to ones made several times recently\n\n* Posts or comments where no actual research was done before asking the question or starting the discussion\n\nIf you need more information on a stock, try looking it up on finviz.com or a business news website.  After that, come back and back up your statements with a source or provide a more in-depth question.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "This post just seems like the definition of FOMO", "score": 130, "replies": [{"body": "This is financial advice: don’t get FOMO. YOLO and put your $40k on calls", "score": 18, "replies": [{"body": "Done. Any other financial advice you can share with us?", "score": 9, "replies": [{"body": "I am glad you ask. Invest in biotech companies that still wait on FDA approval. If that doesn’t work out you can always buy Oil futures and wait till they expire and get those barrels delivered at your house. Hold on to them and wait for the next energy crisis.", "score": 4, "replies": [{"body": "I like the Oil venture but unfortunately I live in a tiny apartment so not feasible. What’s your take on Monster? I’ve heard is a healthy sports drink consumed by the elites with a lot of potential to expand. It has become the paradigm of social success in the opinion of many analysts. Is it a yolo financially advised in this case?", "score": 2, "replies": [{"body": "Well since you seem like a nice guy I will give you some more advice (and feel sad that you cannot yet store barrels of oil). Currently they are a bit overvalued. Their Q1 results were impressive, the stock still didn’t outperform SPY. Firstly buy the stock and all the cans of Monster at your local grocery stores. The rumor will spread and the stock will puuuuuump before they report their Q2 results. After the stock has reached $65 sell it get that put option. The stock will drop. POTUS will declare an Energy Drink crisis and you will be filthy rich. Now you can sell cans of Monster instead of barrels of oil.", "score": 1, "replies": []}]}]}]}]}, {"body": "This.  \n\nSure, it may go higher but you (and I) already missed the boat. \n\nAt this level, imho, it’s speculative to say it’s going to go higher without a correction.  It’s possible, but it’s also quite possible something will happen that knocks the feet out from under the supports.", "score": 0, "replies": [{"body": "Nvidia is simply priced to turn the same revenue and profit as it currently is, plus that it keeps a growth rate similar to what we have seen. So you just have to ask yourself if the reason they turn such a high profit and grow is here to stay, plus has enough runway to keep growing. In other words, is the AI boom sustainable and useful, and will it continue to grow.\n\nIf yes, Nvidia is not more expensive than it was before the run-up. In fact, it could even be cheaper.", "score": 2, "replies": []}]}]}, {"body": ">I am so impressed by Nvidia and I use ChatGPT multiple times per day\n\nThis made me lol", "score": 92, "replies": [{"body": "ChatGPT wrote this", "score": 19, "replies": [{"body": "Actually it was a guy named Chadra Gipiti wait a minute...", "score": 7, "replies": [{"body": "His cat probably complains about his farts...", "score": 3, "replies": []}]}]}]}, {"body": "It was 760 a month ago, why didn't you buy it then?\n\nCan you handle the drop like that?", "score": 26, "replies": [{"body": "Because he wanted to make this very post.", "score": 11, "replies": []}]}, {"body": "So you thought it was too high months ago, when you waited for a pullback that never happened. Now it’s even higher. So you want to buy now?", "score": 16, "replies": []}, {"body": "That is FOMO. If you want to truly invest then do some research, set a price target and buy at that price target. There is a good chance that even if NVDA goes up over time it won't be a straight line, so you can buy during a dip that matches your price target.", "score": 10, "replies": []}, {"body": "Last earnings there was a small sell off a few days in advance because people were getting cold feet. Perhaps that might become an angle for you in the upcoming few days.", "score": 7, "replies": [{"body": "I agree with this comment. The price will priced in before the next announcement. You either buy it now and hope the profits are high or cry when they go down.", "score": 3, "replies": []}]}, {"body": "When you finally buy it will crash. Please let us know…\nPS don’t own NVDA rn", "score": 7, "replies": [{"body": "Lmao this", "score": 2, "replies": []}]}, {"body": "You're not a dumbass. In fact, the vast majority of people who cut their teeth stock trading it was on the FANNG, now it's the Mag 7 (some same names, some changes).\n\nAnd you can totally make money buying stock in a great company, trading at ATH AND is over-priced based on fundamentals even when it is ludicrously over-priced.\n\nFor me the biggest flip side of the coin is expected returns. Take NVDA, great company, large moat on their technology as they're so ahead of the game. The problem is their size. NVDA is so massive that it's one of the most valuable company in the world, almost $2.5T, that means $250B in share have to be bought to raise the price a further 10%.\n\nAnd if you look around, NVDA is a stock on a lot of peoples' lips and while I don't think we've reached peak price saturation, but if you were looking for say a 20% profit, this company needs to find $500B in buyers before you can get there.\n\nAdditionally, due to the already high valuation the company can't make a mis-step or at least not much of one until you start seeing capital flight or at least stagnation (see APPL).\n\nWhat I'm ramblingly trying to say is, you could make money buying NVDA, but there is a lot of risk buying shares in a company which has had a huge run-up and now has a valuation so high you need a very large number of buyers to even move the needle.", "score": 4, "replies": []}, {"body": "You can’t batch up google, amazon and msft with nvidia.  They’re not competing in the same market at all. Same with saying you use ChatGPT multiple times a day.. ok maybe it runs on their GPU but a competitor could sweep in and take over.. AI doesn’t care on the brand of the component it runs on. As long as it fast.", "score": 9, "replies": [{"body": "payment rain complete physical long aware steer meeting seed adjoining\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 4, "replies": [{"body": "Doesn't matter. They don't need to lose all their market share, just a few percentage points. Their current market value is based on the idea that endless growth and extremely high margins can just continue on, but virtually any competition will bring those down. Nvidia is unlikely to lose its market dominance until at least 2030(just based on the current software advantage), but AMD, Intel, and tech companies like Microsoft will slowly eat away at their margins and market dominance.", "score": 3, "replies": [{"body": "you clearly have zero real knowledge of the space. You are just spouting generalities. The fact that you brought up AMD and Intel as competitors tells me you are clueless. NVDA will have competition but it's not AMD and Intel. LOL", "score": 0, "replies": [{"body": "What? Intel and AMD have dominant knowledge in the space, tons of resources, software engineers to bat, and an already established production pipline. My uncle just so happens to work for AMD, and has worked for Nvidia, Intel, Broadcom, and Qualcomm in the past. I can assure you that, from his experiences alone, he says it will be about 5 years, but the software gap between CUDA and its rivals will close, making headway for the companies like Intel and AMD(which already have neural processors out, which compute faster and cheaper than Nvidia chips) to compete. I'm not sure where your background in computing and semiconductors is, or who else could even begin to compete with Nvidia other than the giant chip makers, but I don't see you proposing any alternatives", "score": 1, "replies": []}]}, {"body": "How is anyone gonna compete with a company so far ahead of them who actually focuses on engineering and innovation.  Nvda has enough cash to press the advantage hard and really shit on amd.  It's not just gpu's nvda has associated hardware and a software stack that's been used for 10 years now.  Nvda can pay top dollar for the best talent.  The gap will increase exponentially without a paragon shift", "score": -3, "replies": []}, {"body": "Intel lmao", "score": -2, "replies": []}]}]}, {"body": "I don’t think what you say is accurate in the slightest.", "score": -2, "replies": [{"body": "And yet you didn't provide even a single counterpoint. ", "score": 1, "replies": [{"body": "Because it’s an absurd thing to say “that a competitor can sweep in and take over” without considering the impact of the firmware and software that make the NVDIA gpus way better than their counterparts. \n\nAMD has the same exact physical hardware but the performance differences are staggering. The difference is in the software.\n\nIts like if I said “a competitor can sweep in and take over Apple” 🤣… after all why buy Apple stuff when other manufacturers make computer hardware as well 🤔", "score": 1, "replies": []}]}]}]}, {"body": "Come earnings next week and Nvidia will shoot to the moon. That is unless they issue a lower guidance for next quarter.", "score": 3, "replies": []}, {"body": "When it goes to $1350 you’re going to think $950 was cheap.", "score": 4, "replies": [{"body": "That's why I posted this. Feels like it's just going to keep going up. They have so much momentum and the new stuff coming out is going to be insane.\n\nIn another reply I posted about a text I sent my partner in January that it seemed \"too high\" for me to buy in at $610. If I'd have bought 60 shares then, I'd be like $20k richer right now.\n\nAlmost all of my money is in mutual funds, and they have done well for me. This is the first company that I have personally believed in so much as to want to invest heavily in them.", "score": 2, "replies": []}]}, {"body": "We are literally in the model T days of AI. I can’t believe anyone says this is a boom and it will be over. If you think chat bots are the pinnacle of human imagination for AI then we don’t give ourselves enough credit. \nOnly question is which company will keep having break through.", "score": 4, "replies": [{"body": "What companies are you investing in and why?", "score": 1, "replies": [{"body": "I’m in on Nvidia currently for the obvious reasons. For fun I’m seeing where AITX is going as well. Need  to invest for the robots so they appreciate I’m the support when they take over lol.", "score": 2, "replies": []}]}]}, {"body": "Dude just keep DCA-ing", "score": 2, "replies": []}, {"body": "You've been eyeing it for months... where were you 4/19 when it touched $760? You probably thought it was going lower, and here we are.", "score": 2, "replies": [{"body": "Just looked back in my texts and I sent my partner on January 26, \"I almost feel like Nvidia would still be a good buy because they're just continuing to become more successful. But it's so high idk. Apparently the last time they did a split at $740, so I'm tempted to try and buy before another split.\" It was at $610 on January 26th. Grown more than 50% in less than three months. Which is why still I feel the same way now - torn over whether to buy because what is \"high\" today may not look high in 3 months.\n\nAnd I can guarantee if I had posted this exact same post to reddit on January 26th, I'd have gotten the same mocking, know-it-all answers, telling me I'd missed the gravy train.", "score": 2, "replies": [{"body": "I’m not mocking you, everyone has their own strategies and naturally they all look like they overlooked something in hindsight.", "score": 1, "replies": [{"body": "Oh I know you weren't. Just a lot of mocking comments ITT, but what else can you expect lol", "score": 2, "replies": [{"body": "Not much else, most of us missed NVDA run up too lol", "score": 1, "replies": []}]}]}]}]}, {"body": "NVDA’s PE and PS ratios looked high when I bought it. \n\nIn 2014 at $5/share.", "score": 2, "replies": []}, {"body": "If you always listen to the naysayers, every good stock that is doing well is “overpriced” … dont listen to them. \n\nI look at a company’s revenue, their profit, and their price … if revenue and/or profit goes up 250% over last year, and price reacts similarly (up 250% - or close) I dont see a problem - thats just me. That is NVDA … in fact, profit and revenue up almost 300% in 2023 compared to 2022 … but price of stock only up abt 220% … so in my mind, stock price justifiably has room to go up even more, and it is actually underpriced right now, before earnings even come out… \n\nSo many people cant believe the growth, they claim it is overpriced … without actually analyzing the numbers or belief that the growth is gonna continue for at least a couple years - if not more. All these big companies are just now gearing up to put serious money/investment in AI … they have all said so … and often mention NVDA directly as their supplier they are using/going to use. \n\nYou make your own decision … but I havent been so convinced of exponential growth for a company over the next 2-3 years … ever.", "score": 2, "replies": []}, {"body": "If they do a 10 to 1 split next month, would you still be hesitant to buy nvidia at $95?", "score": 2, "replies": []}, {"body": "Just buy a momentum etf and chill", "score": 5, "replies": [{"body": "All my money is in ETFs. This is the first time a new company has come out that I'm passionate enough about to want to invest money.", "score": 1, "replies": [{"body": "Go ahead  but I’m just saying that the momentum effect is the best way to buy high sell higher.  Do it systematically over the long term", "score": 1, "replies": []}]}]}, {"body": "\"Man, this stock just keeps going higher! I just gotta buy this, the suckers going up\" \n\n\"What? The stock crashed down and I lost almost everything? How? I could've sworn the stock went up!\"\n\nUnless there's something other people are missing, just stay away. Nvidia is in a place where, unless the news is catastrophic, the stock will continue going up. Just wait. Eventually, the company will be priced according to its actual value, and maybe below it.", "score": 2, "replies": []}, {"body": "Probably better to buy when it pulled back rather than near ath.\n\nHuman condition to be excited after a run and discouraged after a pullback.", "score": 2, "replies": []}, {"body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Hardware takes a lot of time an resources to develop. It will be hard for other companies to catch up, like in the time frame of years. Google is probably the closest since they have been working on this hardware for a while. Demand way outstrips supply and production capacity. Price for hardware from Nvidia is as a result climbing. It's probably a safe bet for a while for dip buying. But nothings for certain.", "score": 1, "replies": []}, {"body": "Take all the money you want to invest, park it in a HYSA and periodically buy the stocks you want on a regular cadence.", "score": 1, "replies": []}, {"body": "Sell puts?", "score": 1, "replies": []}, {"body": "The market says FOMO your savings in there.", "score": 1, "replies": []}, {"body": "There is a dip now.", "score": 1, "replies": []}, {"body": ">I'm not trying to get rich fast or anything. This is something I would hold\n\nYea, you're not going to by waiting for a stock to jump over a 100% and then buy in", "score": 1, "replies": [{"body": "Thank you for the clarity on how I won't get the thing that I explicitly said I'm not trying to do", "score": 1, "replies": [{"body": "You're right,I should've just quoted your \"am I a total dumbass?\" And said yes.\n\nAt least the mods agreed that this fomo post was low effort and removed it", "score": 1, "replies": []}]}]}, {"body": "If you think like OP you shouldn’t be investing in individual stocks\n\nThere’s no analysis of the company going on here.", "score": 1, "replies": []}, {"body": "Just grab intel at near 52 week lows and ride", "score": 1, "replies": []}, {"body": "Time in the market > timing the market", "score": 1, "replies": []}, {"body": "I’ve been shorting it since $500 and been hating myself ever since…I would not buy or short it right now…if I owned shares I would probably sell some (like half)", "score": 1, "replies": []}, {"body": "Like everyone else is saying, FOMO. But besides that, nobody is pointing out the “$950 stock” comment? The share price is irrelevant - the 2 trillion valuation isn’t. Do you know anything about valuing the business?", "score": 1, "replies": []}, {"body": " I’m waiting this stock out even though I’m grinding teeth.", "score": 1, "replies": []}, {"body": "I had this exact same thought 2 years ago. Bought the top at 350-400. Then 2023 happened and it went down to 100 ISH. Averaged down to 260. It rocketed up on this AI boom so fast that I thought it must be done sold at 240 ISH. It carried on to 900. \n\n\nYou just don't know dude.", "score": 1, "replies": []}, {"body": "I'd price it to buy at between $600-$700/share, as it currently is. If the growth madness continues we may see another split on it, but I would not touch it at the current price.", "score": 1, "replies": []}, {"body": "The boat left about 6 months ago", "score": 1, "replies": []}, {"body": "I almost never buy a stock if it’s near its 52 week high.", "score": 1, "replies": []}, {"body": "Could always go the ETF way for lower risk maybe? I invested in SMH after all of the recent hype. 25% of the fund is in Nvidia alone. So far I’m up ☺️", "score": 1, "replies": []}, {"body": "I know this is a stocks subreddit, not an ETFs one, but given your intense dysphoria in relation to this stock you should probably just invest in an ETF that holds Nvidia, such as VOO/SPY. You can still root for it as a major holding of your ETF and not have fomo, while also not putting too many eggs in one stock, which as you have stated, may be overpriced.", "score": 1, "replies": []}]}
