{"title": "Tesla Rehires Some Supercharger Workers Weeks After Musk’s Cuts", "selftext": "", "id": "1crap1q", "created_utc": 1715634947.0, "score": 121, "upvote_ratio": 0.87, "num_comments": 83, "comments": [{"body": "Shocker", "score": 28, "replies": [{"body": "They have GFCI, shouldn’t be any shocks.", "score": 9, "replies": [{"body": "You can definitely have shocks as long as the current goes through your body back to neutral instead of ground.", "score": 1, "replies": [{"body": "This is an interesting point. I am familiar with GFCIs. Since it measures the current differential between hot and neutral you are saying like if you took your left hand and stuck a paperclip in neutral and with your right hand stuck a paperclip into hot it may not trip the GFCI. I would not want to test it 🤣🤣. \n\nMy reply has nothing to do w Tesla 😂.", "score": 1, "replies": [{"body": "Right. Where it will save you is if its going from hot through you to ground. If it's going back to neutral, that's expected.", "score": 1, "replies": []}]}]}]}, {"body": "Definitely not.  Elon has even said that if you don’t cut so many that you have to hire some back, you didn’t cut enough.  Elon was aware going in to this that it would likely be the case.", "score": -1, "replies": []}]}, {"body": "Elon: if you're not adding at least 10% back because you find you actually really needed it, you aren't cutting enough.\n\nHe applies to same principle to people as he does to engineering processes. While I would argue that they are different and the \"cut til you're adding 10% back\" mantra is quite damaging in an HR context, the people who say that this shows Elon \"had no idea what he's doing\" are wrong. He knows exactly what he's doing, and hiring back some percentage of laid off workers is exactly in line with his plans.", "score": 44, "replies": [{"body": "He cut the entire department.", "score": 20, "replies": []}, {"body": "[removed]", "score": 46, "replies": [{"body": "[removed]", "score": 19, "replies": []}, {"body": "[removed]", "score": 4, "replies": [{"body": "[removed]", "score": 7, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}, {"body": "We don't know what his plan is precisely but I agree with the sentiment that he is doing this intentionally. I think the approach is what he thinks is the most efficient, even if it seems belligerent.", "score": 22, "replies": [{"body": "Good way of putting it", "score": 3, "replies": []}, {"body": "We actually know, it's written in the biography.", "score": 2, "replies": []}]}, {"body": "Let’s hire back the people we pissed off by laying them off. Sounds like a great strategy…", "score": 25, "replies": [{"body": "You only hire back a small part of them, a bit chaotic but you probably end up with way less people and mostly the essential people. Some won't come back, but you just keep hiring.", "score": -16, "replies": [{"body": "And those people almost immediately have one eye on other job opportunities because they now know their positions aren't safe. \n\nWhatever mental backflips you want to do, and whether he meant it or not, this is just a stupid way of doing it.", "score": 30, "replies": [{"body": "Those people probably also demanded higher compensation to come back.", "score": 15, "replies": [{"body": "And you lost weeks of productivity getting them re-onboarded. Completely moronic. The people defending it are delusional.", "score": 3, "replies": []}]}]}, {"body": "You lose the best people though as they will be the first to look for other options", "score": 6, "replies": [{"body": "Yes that is a risk but if you look at Musks track record it seems to have netted out positive", "score": -4, "replies": []}]}]}, {"body": "In this case we see those that were useful and  actually want to come back. \n\nCould also be a reaction to BP", "score": -4, "replies": []}]}, {"body": "No. Elon is not a genius. Don’t give him this much credit for his ego.\n\nIf someone let go my entire department and wanted me back, I would not be a loyal worker. Their behavior shows I’m not valuable to them and my job is temporary. So I would take the Tesla offer just so I can get paid while I look for jobs at Rivian or other companies.", "score": 22, "replies": [{"body": "If I were in that situation, I'd tell them either you pay me ALOT more than you were paying me before (and reinstate any stock options and other seniority benefits) or I'm just not coming back.  If they're going to screw me, they're going to pay for it.  And if they accepted, I'd probably be looking out for a better opportunity elsewhere because they're probably going to screw me again.", "score": 17, "replies": []}, {"body": "I would be afraid of sabotage/quality issues and we all know Tesla never has quality issues.", "score": 6, "replies": [{"body": "Intentional sabotage sounds like a great way to get fired, lose all your stock options, and get reported to police. Vs keeping your severance package for being laid off. If people don't want their job back, they shouldn't take it. They'd be better off using their months of severance to find something else - they should be very employable with experience at Tesla.", "score": 1, "replies": []}]}, {"body": "I'm not saying he's a genius. I literally said the strategy is \"quite damaging in an HR context\". I disagree with it \n\nAll I'm saying is that hiring people back is 100% consistent and expected from his strategy. It is not a sign that \"he realized he screwed up\" or anything like that.", "score": 1, "replies": []}, {"body": "> Their behavior shows I’m not valuable to them and my job is temporary.\n\nYour job is likely not a paycheck-to-paycheck thing, but a 150k-200k engineer. If you're even touched by those cuts.", "score": 0, "replies": []}, {"body": "Yeah.  I guess that whole Tesla and SpaceX and Starlink thing was just a major fluke.  \n\nI mean, we know how many car companies are successful in the U.S.  Really, it was all very obvious.\n\nIt cannot possibly be that he has an innate talent for figuring out which industries are ripe for disruption, finding the right people, making a plan, and then sticking to the goals.  Nah.  Total fluke.  Because lots of people do this all the time.", "score": -1, "replies": [{"body": "A smart person if not humble can become an arrogant person which in turn reaches the final evolution of a foolish person.\n\nElon is on that journey.", "score": 1, "replies": [{"body": "That is rambling nonsense, and I think you know it.  It also completely avoids the point you yourself set up in your previous comment.", "score": -1, "replies": [{"body": "Elon was smart. He was the underdog. He isn’t anymore. Now he’s arrogant and success has gotten to his head. Now his attitude reflects his foolishness.\n\nI can tell you want to be right. I hope you won’t join Elon’s mindset. Have a good night.", "score": 0, "replies": [{"body": "I agree that he is no longer the underdog.  He has had great success.  And that is what bothers a certain type of person.\n\nI suspect you are that kind of person, and that is why although Elon Musk never changed, your perception of him did.  If he would have failed, you would still see him as smart and daring.\n\nAnd of course I want to be right.  Again, this is rambling nonsense that is supposed to make me ashamed at attempting to find objective truths.  I have also been very successful in life.  I suppose that makes me the same in your eyes, and I further suppose I should interpret this as confirmation that I am doing something right.\n\nYou have a good night too.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "This was Innes Ireland complaining about Chapman's shitty race cars that literally killed people.", "score": 0, "replies": []}]}, {"body": "So much drama for those that get fired and brought back lol - I hope they asked for some raise or something", "score": 1, "replies": []}, {"body": "It is good principle and could definitely be applied to people although I would argue with the method of implementing it. Usually you think who you need then fire the rest, not fire everyone and then think who you need. You don't need people to leave to figure out if they were needed and could definitely just spend a day doing this thinking on paper or whatever and then put it in action once you have thought it out. Would not hurt morale same way and people who you want to keep can continue their work without disruption.", "score": 0, "replies": [{"body": "This is the catch, adding parts back into a vehicle or rocket doesn't hurt anyone's feelings or engender ill will (except for maybe a couple engineers' egos, but in that case they need to get over it). Whereas mass layoffs and rehires can really hurt morale and loyalty in the long term.", "score": 1, "replies": []}]}, {"body": "In the book he also mentions firing people, because they get comfortable with their salary and position and stop trying as hard.", "score": 0, "replies": []}, {"body": "Cool. So there are at least two people we know of that don’t know what he’s doing.", "score": 0, "replies": []}, {"body": "Agree. It’s kind of like the story about his assistant/secretary who asked for a pay raise. \n\nElon supposedly propositioned that if he could survive day to day trial without her on a 2 week vacation, she’d be let go *because she was a generalist and Musk needed specialists at that point in time*. \n\nGuess what happened.", "score": -7, "replies": [{"body": "There’s 3 more mini Elon’s that will be raised by a single mother and a wad of cash?", "score": 7, "replies": [{"body": "Very possible.", "score": 1, "replies": []}]}, {"body": "Lots of lawsuits she kept him out of previously", "score": 6, "replies": [{"body": "*Sounds like we need to this secretary to prevent lawsuits.* /s", "score": 1, "replies": []}]}]}]}, {"body": "Lol everyone will be asking for a raise", "score": 14, "replies": []}, {"body": "[removed]", "score": 23, "replies": [{"body": "[removed]", "score": -3, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "[removed]", "score": -9, "replies": [{"body": "[removed]", "score": 8, "replies": []}]}]}]}]}, {"body": "Elon is such a F#cking clown. Hope they got a pay increase.", "score": 8, "replies": []}, {"body": "\"Yah fired...yah hired...yah fired...yah hired...yah fired...yah hired...gimme 56 billion!!!\"", "score": 2, "replies": []}, {"body": "No matter how much they offer me, I am not going back.", "score": 2, "replies": []}, {"body": "Since there is the typical and predictable infighting over this, let me ad my two cents as somebody that has actually worked at a place where they did this. I have also worked at a Fortune 500, San Francisco Tech company that went through layoffs, but they were not the same place.\n\nThe first company had a management change, after some turmoil and overall missed targets. The President of the company fired the manager and stepped in to temporarily manage this location to get things back on track until they hired his replacement. He fired everybody at that location and made them interview for their jobs back.\n\nThe, non-shocking result, is that moral did not improve and that location remained a problem for the entirety of my tenure with the company (around 5 years). Worse, we all knew it and it spilled over to the rest of the business. A few years after I left the company, the president was fired by the board and the board sold to be absorbed by a larger company.\n\nI have also worked at a F500 SF tech company for around 10 years. We went through layoffs a few times and I have seen them handled in different ways. Attempts at Stack ranking, wholesale team cuts, early retirement offers, you name it. Morale is always impacted, but never anything like what I saw above. The more that the exec team allows direct managers to have involvement into the process is always better and the more forewarning also softens the blow.\n\nI have also seen people with specific domain knowledge let go, were it wasn't discovered until later that we lacked and needed their expertise. Reaching out to past employees, were you either get asked to offer a huge sum to help out, or you get laughed in your face. \n\nWhat Tesla is doing here is a terrible way to fire people and a terrible way to retain people and anybody that thinks this won't have negative consequences running the business of Tesla moving forward is frankly wrong here.", "score": 2, "replies": [{"body": ">Attempts at Stack ranking, wholesale team cuts, early retirement offers, you name it.\n\nSound a lot similar what has happened at my work place during layoffs. Management gets on the table with employee representative and they discuss posibilities how employees can go about the layoffs. Early retirement, unpaid vacation periods, taking vacation bonuses as extra vacation instead of money, not renewing temporary positions and reasigning people to open positions if able to are methods that are usually on the table and most of the time we are able to avoid half of the layoffs with these measures. Of course some will always get laid off in the end but people certainly feel better when they are given choices and option to find resolution to satisfy most. Even those that get laid off usually get open recommendation from company to help them finding a new job.", "score": 2, "replies": []}]}, {"body": "Yeah someone needs to do the work to install all those superchargers that Elon wants. But this is part of his modus operandi - delete until you have to add at least 10% back.", "score": 1, "replies": [{"body": "They didn't cut the people installing chargers. ", "score": 2, "replies": [{"body": "They cut the design managers, project developers, and construction managers. The people doing the actual installs are usually 3rd party construction contractors and utility workers", "score": 1, "replies": []}, {"body": "They cut everyone.", "score": -1, "replies": []}]}, {"body": "No wonder parts are falling off cars.", "score": 9, "replies": []}]}, {"body": "Very deliberate. Make an example of the exec that didn't follow his orders by laying them all off.\n\n\nIdentify the keepers and begin rehiring them, letting them steer who comes back and why.\n\n\nEnd result - rehire a big chunk of the employees, and arriving at a similar outcome had the exec made the cuts required of her.", "score": -10, "replies": [{"body": "While doing massive amounts of unnecessary collateral damage in the process.\n\nThis is not good leadership. He only gets away with a lot of nonsense because he has enough money to insulate him from mistakes that would tank anyone else.\n\nDeliberate. Yes. Smart or good for the company, no.", "score": 14, "replies": []}, {"body": "Yes and humans don’t have emotions so this won’t backfire…", "score": 13, "replies": []}, {"body": "What a great way to build loyalty among your most skilled employees. Absolutely astoundingly great leadership. \n\n*insert the worlds largest /s*", "score": 9, "replies": []}, {"body": "This is not a way to run a company. Imagine if your CEO did this to you and wanted to rehire you, you may come back, but you'd start your job search. You can't treat employees this way, I'm sure the whole company has taken notice.", "score": 19, "replies": [{"body": "I'm not saying I agree with it. I'm saying that was his logic.", "score": -5, "replies": []}]}, {"body": "Just absolutely terrible leadership", "score": 1, "replies": []}]}, {"body": "He never fired the entire supercharger team in the first place.", "score": 0, "replies": []}, {"body": "The easiest way to clean your closet is to take out everything and only put back what you need.", "score": 0, "replies": [{"body": "So basically Elon hired back the people who sparked joy.", "score": 4, "replies": []}]}]}
