{"title": "MSFT's press conference well-received, Windows 8/new tablet highly anticipated - thoughts on long MSFT?", "selftext": "In case anyone doesn't care much for or follow tech stocks (they're my bread and butter), MSFT just held a press conference today where they unveiled the new [Surface tablet](https://www.google.com/search?q=surface&ie=utf-8&oe=utf-8&aq=t&rls=org.mozilla:en-US:official&client=firefox-a#q=surface&hl=en&client=firefox-a&hs=JhV&rls=org.mozilla:en-US:official&prmd=imvnsu&source=univ&tbm=nws&tbo=u&sa=X&ei=mfLfT_z4O-ry0gHy-520Dg&ved=0CCYQqAI&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.,cf.osb&fp=325795e3fec301ce&biw=1920&bih=962). Ever since, the community is abuzz with talk of Windows 8 and Surface, with most agreeing that this may finally be the David that takes on AAPL's iPad Goliath. \n\nSensationalism aside, I see some good potential for growth - MSFT's been in a steady uptrend since December, some resistance at 33 but it's hovered around the 30s for a good fifty days, with the lowest support level being at 28. ([chart](http://bigcharts.marketwatch.com/advchart/frames/frames.asp?show=&insttype=Stock&symb=MSFT&time=100&startdate=12%2F1%2F2011&enddate=6%2F18%2F2012&freq=1&compidx=aaaaa%3A0&comptemptext=&comp=none&ma=0&maval=9&uf=0&lf=1&lf2=0&lf3=0&type=4&style=320&size=4&x=57&y=7&timeFrameToggle=false&compareToToggle=false&indicatorsToggle=false&chartStyleToggle=false&state=9))\n\nThoughts from anyone on where we'll see this stock go?", "id": "v9d73", "created_utc": 1340077663.0, "score": 2, "upvote_ratio": 0.63, "num_comments": 18, "comments": [{"body": "I think while initial reviews are sour, MS has hit a home run.\n\nAs a programmer and LONG time user of windows, I was really concerned when I saw the initial reports, but much of the initial negative reaction is turning out to be FUD.\n\nTake the desktop for instance.  Once upon a time, we were told that the only way to access it would be by some registry mod.  That was really scary.\n\nBut, in the preview, we see all you have to do is press the windows key, and poof, you switch modes.\n\nAlt-tab works.\n\nAlt-R works.\n\nThe start button is gone, but frankly I never use it any more anyway as I have so many programs it's impossible to find what I want.  Search and pinning works so much better.\n\nMetro mode sucks for desktops, but that's not what it's for.  It will rock on a slate.  Desktop mode is not going anywhere.\n\nThe App store that microsoft has built kicks the apple app store to the curb.  Apple's apps store is impossible to use.  You can't find anything in it.  The new Win 8 app store is neatly divided by category and much easier to browse.\n\nBut, most importantly, Microsoft has a HUGE install base.  People WILL use Windows 8, period.  That means they will be exposed to Metro.  As they get used to the idea of using metro, it will seem like an obvious choice to get a Metro slate.  Everything will be compatible, and it will be a unifying experience.\n\nFinally, Win 8 won't be the sealed walled garden that the iPad is.  You won't have to jailbreak to get access to the code Apple (Microsoft?) deems unacceptable.  Apple, being Apple, will continue to make jailbreaking harder and harder, and that will just isolate them more and more.\n\nI have been waiting for something to come along so I can jump ship from the insanity that is the iPad.  Looks like I may have finally found my lifeboat.\n\nEveryone loves the iPad because there is nothing out there that is better.  The funny thing about people is that they tend to poo-poo the possibility that anything better can ever come along.\n\nApple continues to make brilliant additions to their products, but Win 8 is going to kick some serious iPad butt.  Not so much the iPhone.", "score": 5, "replies": []}, {"body": "A 2.6% divi is nice, but when it comes to tech, there is still only one name, AAPL. \n\nI like this tablet, but think Zune vs iPod.\n\nI guess we will have to wait to see what kind of sales this tablet gets.", "score": 3, "replies": [{"body": "You're definitely right to bring up that comparison, as it's one I was thinking about earlier.\n\nHopefully, since the tablet runs the full-fledged version of Windows 8, that will help break through AAPL's 'app store' strangehold and start bringing over developers. Also helps that this is being done in concert with the new Windows phone and Xbox - they're going for increased vertical integration. Hit the consumers hard and fast with multiple products, maybe take a slice of AAPL's pie. \n", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Microsoft Surface yes, Margin might possibly be low/none.   But the Licenses for OEM tablet manufactures, very real revenue stream.", "score": 1, "replies": []}]}, {"body": "Love the tablet, however before I put my money on MSFT, im thinking of the zune =/\n", "score": 1, "replies": []}, {"body": "should have seen this coming when MS announced \"smart-glass\" for the 360 (a tabloid app-extension to enhance your video-gaming experience as you play)  ", "score": 1, "replies": []}, {"body": "Windows 8 is a train wreck. The Metro interface is terrible for non tablets but unavoidable and creates interface inconsistency and a separation of apps.\n\nMS is going to hurt their desktop customers in an attempt to chase down the tablet market.  This is finally the weak point in the Windows cash cow.", "score": -1, "replies": [{"body": "Competing against licensees is a valid point, but I just wanted to mention that Windows 8 isn't unavoidable - since the beta, pressing the Windows key switches modes between Metro and traditional Windows desktop.", "score": 1, "replies": [{"body": "Actually, from the reviews and coworkers I know using the beta this is an oversimplification.  The Start Menu is gone; the basic paradigm of application launching is now different.  It highly encourages you to go through Metro.  You can't quickly launch programs from the start menu and you can't quickly use the search function from the start menu that Vista introduced.\n\nThere's all kinds of user interface issues created by these basic changes that are going to effect end users.  I see very little reason for corporate environments to upgrade and I suspect Windows 8 is going to be despised by enterprise customers.\n\nOn top of that there's the competing against licensees aspect- Microsoft will be able to sell their tablets for less than any competitor due to lack of a Windows license cost.\n\nAnd there will be confusion introduced from the fact that the ARM version of Windows 8 will have the traditional desktop but will be unable to run regular Windows applications compiled for x86 processors.\n\nMicrosoft is trying to enter the tablet space, but I fear this might erode their Windows empire.", "score": 1, "replies": []}]}]}, {"body": "People don't want tablets.  People want iPads.  That's the main reason why this will likely fail.  They got nowhere with Zune, what makes anyone think that this will actually take off?  My guess is that this is going to be more expensive relative to the iPad, and it's going to be some hybrid experience between Windows and iPad and people will probably be confused and annoyed.", "score": -2, "replies": [{"body": "I think Zune fell through because it didn't feel like an attempt at setting trends, it felt like MSFT playing catch-up after seeing the success of iPod. Plus, it doesn't help that iPod had the jump on Zune in everything from software to form factor (I will always maintain that the scroll wheel since the fourth-generation iPod is the most-intuitive non-touchscreen interface ever made). Zune felt like MSFT trying to put their foot in the door.\n\nMeanwhile, this looks a lot better. Full keyboard support, full-fledged Windows operating system (hopefully, that allows for easy transfer from tablet to desktop for consumers), USB ports - it's already got a bit of an edge on iPad with those last two features alone. And, to boot, the operating system closes up the upgrade MSFT has been doing with Windows Phone and Xbox. \n\nOf course, I'm just a hopeful. You're right when you say people want an iPad - with the catastrophic failure of the HP Touchpad and RIM's... I can't even bring myself to say its name, everyone's just grown accustomed to iPad being the king. If it's priced right and marketed right (speaking of which, they're marketing this a lot more aggressively, which is good), I think it may yet surprise us.", "score": 1, "replies": [{"body": "If we learned anything from the touchpad disaster, its that people will line up outside bestbuy and clear out your entire stock if its priced right.\n\n", "score": 2, "replies": [{"body": "The touchpad was being sold for a $400 loss. That can't be replicated.", "score": 1, "replies": [{"body": "Thats why I called it a disaster.", "score": 1, "replies": [{"body": "The PS3 taught us that the size of the subsidy doesn't always edge out on sales.", "score": 1, "replies": []}]}]}]}, {"body": "I have a feeling it will be woefully underpowered, and expensive.  Microsoft doesn't have AAPL's economies of scale when it comes to manufacturing, so I can't see how they will be able to fit this at the same price point as an iPad. \n\nI admit it looks nice, so I will be interested in seeing how it performs.  But my guess is that it will be extremely compromised in some way like power and/or price.  People will probably ask \"Why would I spend $1000 for this underpowered laptop/tablet that won't run many of my apps, when I just need to spend $100 to get Windows 8 on my current laptop?\"", "score": -1, "replies": [{"body": "Windows 8 is reportedly extremely efficient, so hopefully they'll be able to compromise between pleasing performance and attractive price. But you raise very good points. \n\nAs always, we'll have to let the consumers decide!", "score": 1, "replies": [{"body": "There's also the message this sends hardware manufacturers.\nThis is the first time that Microsoft is directly competing against its own licensees.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "BAC +5%, MS+3%, GS +3% banks on the move this morning", "selftext": "Buyers stampeding over each other to get into financial stocks this morning.\n\nJulius Baer is in talks with Bank of America about buying Merrill Lynch's non-US wealth management unit, reported to be worth up to $2 billion and which would see the acquisition-hungry Swiss private bank land another big deal. Bank of America shares gained 0.8 per cent to $7.82 premarket. ", "id": "v9yq5", "created_utc": 1340115383.0, "score": 8, "upvote_ratio": 0.91, "num_comments": 11, "comments": [{"body": "This is really pathetic. Rumors that moody might downgrade US banks, Bernanke saving us all with another stimulus, Greece is still a piece of shit. This markets heading lower, I guarantee it. \n\nI would love to own $BAC eventually, but prices are heading lower. ", "score": 3, "replies": [{"body": "I hope you're right because I'm too cash-poor to jump in on BAC right now.  I would love to start a long position.", "score": 2, "replies": [{"body": "Lets put it this way, on 3/13 we needed 488MM shares to break 8.50., followed by a week of consecutive buying to keep the stock up. Yesterday, we traded at 140mm (about a third in volume). We'll need some heavy upside volume for verification of a rally. Imo, we don't have the cause or the right market for a bear reversal.\n\nhttp://imgur.com/AVAay", "score": 3, "replies": []}]}, {"body": "=)'\n\nbefore it reaches then, be prepared to be losing out on money for sitting on the sidelines", "score": 1, "replies": []}]}, {"body": "I started eyeballing BAC when it dipped under $7.  I thought the Greek vote would go differently and we'd see this guy dip under $6.  Looks like I got a little too greedy and missed out on a great opportunity.  Alas. ", "score": 2, "replies": [{"body": "I think there will be a good opportunity on the short side soon enough", "score": 2, "replies": []}]}, {"body": "Got in on BAC at 6.87. Been treating that position like a bunch of hot coals ever since. \n\nHopefully we get a bit more squeezed out of this before the bears come in.", "score": 1, "replies": []}, {"body": "Dimon is testifying again today for JPM as well.  We could see more movement depending on what the market thinks of its testimony.  There was a big rally during his senate hearing.", "score": 1, "replies": [{"body": "Jon Stewart Examines the Silliness of Jamie Dimon’s Senate Testimony\n\nhttp://gawker.com/5918618/jon-stewart-examines-the-silliness-of-jamie-dimons-senate-testimony?tag=television", "score": 2, "replies": []}, {"body": "We should castrate Jamie to ensure he doesn't produce any more offspring. Can't believe he still has the audacity to lobby for less regulation.", "score": -1, "replies": []}]}, {"body": "Fuck that shit. New lows for everyone soon enough.", "score": 1, "replies": []}]}
