{"title": "When will see the unprofitable companies going bunkrupt?", "selftext": "From time to time someone here reminds us the fate of all the high flying stocks of the dot com bubble. Pets.com, etoys.com, kozmo.com, etc\n\n2020-21 bubble saw similar money burning companies rising to astronomical (based on the fundamentals) levels and crashing hard.\n\nBut now those cash burning machines do not have access to free capital. Cannot issue new shares, cannot get loans, cannot attract new long term investors. \n\nPTON. No one buys their bikes anymore so how to achieve profitability? \nSPCE. Cannot deliver their promise to fly people to space so how to gerenate renevue? \nRIDE. They scale down operations  so I guess it will take some time to see a Lordstown EV in the roads\nWISH. I guess nobody uses them so how they could achieve success in the future? \n\nThere are so many other companies, with terrible balance sheets, negative EBITDA, no access to free money, so inevitably they should bunkrupt or bought by others. \n\nSo my question is when will start seeing those Covid darlings, fail? \n\nMaybe this will be a sign that we are closer to the bottom, since no more (scarce) society recourses are wasted on them, we completely forget them and let liquidators do their job.", "id": "voojhg", "created_utc": 1656639137.0, "score": 25, "upvote_ratio": 0.84, "num_comments": 33, "comments": [{"body": "Bankruptcy tends to take time as assets tend to delay an immediate collapse.  Some established brands limp along for many years despite real financial deterioration.", "score": 39, "replies": [{"body": "Still, it’s hard to predict who will randomly pull ahead. It doesn’t take a very long look at Apple’s history to understand that even a mostly-garbage cash-burning machine can come back from the brink of oblivion.", "score": 2, "replies": [{"body": "Yes, we still have GE.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Exactly. This is one of the points of low interest rates. To allow companies to expand operations, which will bring more prosperity to the society since they pay rent, hire employees, pay taxes, outsource production, etc. So finally everyone is happy. Think how the 2010s started with collapsed housing market and demonstrations outside Wall Street \"we are the 99% against the 1%\" and see how that decade ended in 2019.\n\nAlso allows more risky ventures to exist and who knows, they may succeed and become profitable in the future.\n\nOne great example is space tourism.\nRecent boom is not about technology, its about interest rates. The technology to send a rocket to space exists from 1960s. Someone could gather all the Nasa engineer from the cancelled Apollo space program and built a rocket to send wealthy people to space back in 1970s and 1980s. However back then the interest rates were in the double digits. How would fund such company when you could put your money in the bank and gain 15% return every year doing nothing. It would be suicidal to open a risky company with questionable profitabililty sometime in the distant future with such high interest rates.  The business should achieve profitability immediately like restaurants now.\nI see in my neighbourhood many individuals open a restaurant and close within 3 to 6 months.\nYes because if it is not profitable, better to cut losses early, rather than keep operating hoping something will change in the future.\n\nBut till now was different. As Musk said \"it rained money to fools for a lot of time\"\n\nLast year someone bought Beeple NFT for USD69 million!!!!!!!\n\nImagine you have 69 million and you decide to spend them on a fucking NFT.\n\nReally it rained money to fools for long time, and all this due to low interest rates...", "score": 2, "replies": []}]}, {"body": "“Nobody buys pelotons anymore”, “Nobody uses FB anymore”, “Nobody uses PayPal anymore”, etc.\n\nWhenever I read this kind of reductive “analysis” it’s hard to take the rest of the post seriously.", "score": 7, "replies": []}, {"body": "grab simplistic reminiscent secretive bewildered direful melodic boast steer concerned\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 16, "replies": [{"body": "All they have to do is xyz doesn’t mean they’ll actually do it.", "score": 5, "replies": [{"body": "Or they do cut r&d and marketing and then fewer people buy the product so they cut more and bam, they’re in a death spiral.", "score": 5, "replies": [{"body": "Yeah I mean cutting R&D is one thing, but I don't know that cutting marketing for a status brand is gonna be a good move", "score": 1, "replies": []}]}]}, {"body": "> you look at Peloton's financials for example, all they really have to do is stop spending 300m+ on marketing and R&D, reduce some of their sales staff, and they will be cash flow neutral.\n\nWhat?\n\nAre you assuming that inflows would remain the same if they stopped spending on advertising? \n\nIf they could just cut sales staff and stop advertising and keep selling their bikes at the same level they’d have done it..", "score": 2, "replies": [{"body": "historical modern rotten rich correct cable grandiose pie amusing materialistic\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 4, "replies": [{"body": "> It would, because they make money from subscriptions and classes, not selling equipment. They actually lose money on every equipment sold if you factor in marketing, but have a >90% subscriber retention rate which means a strong source of locked in revenue.\n\n… and how do they get those subscriptions? By selling the bike to them first. \n\nThere’s also the fact that the psychology of advertising is complicated. Many have posited it’s effects are actually both pre *and* post-purchase. Ads for a product you bought make you feel good that you bought it. There’s no telling if their subscriptions would remain the same if they stopped selling bikes.\n\nBut I concede your point that in the short term their inflows may stay the same.", "score": 1, "replies": []}]}]}, {"body": "Right, who'd buy/keep uaign PTON without their massive advertising?\n\n\n\nStay at home moms 30+ was their target audience, and some actually working ones who were stuck home due to the pandemic. Since the pandemic is no longer a threat people go to the gym instead, get better exercise, and *train with friends*. Things PTON can't offer or surpass.\n\n\n\nHeck, they'd need 10x in R&D to desperately find any reason to stop bleeding customers, a killer feature. Otherwise they'll be gone soon, about as much to remember as the Ouya", "score": 0, "replies": []}, {"body": "It is kinda funny that a stationary bike manufacturer spends anything in R&D. Nothing they do is proprietary. What they need to do is convince the consumers that they are the \"cool\" spin class.", "score": 0, "replies": [{"body": "I assume Research and Development for Peloron is a mix of consumer analytics for research (what audience are we hitting, what is our intended audience, which classes are doing poor/well) and finding ways to more accurately fit their metrics.\n\nAlso they most definitely do have proprietary stuff (in the K-cup coffee pod or I-phone charger sense). Many of the attachments for their bike and equipment are things that are engineered to be needlessly different in an attempt to get customers to buy PTON biking shoes and PTON water bottles etc.", "score": 1, "replies": []}]}]}, {"body": "I checked just because you asked, but Peloton revenue for last quarter was almost $1B. I suspect they'll just ramp up their prices on their subscriptions and cut their spending.  That should save them for at least next year. Barry McCarthy seems to have a handle on what the company needs to do to turn it around. But... I have serious reservations about their future because I think the idea of a bike with a T.V. monitor attached to it is kinda dumb, but what do I know?", "score": 4, "replies": []}, {"body": "Some companies are unprofitable because they choose to invest in themselves for the future. If there vision, strategy, market and service or product is solid then bankruptcy is not in the cards. Due diligence will show you to the promise land.", "score": 6, "replies": [{"body": "I agree with you.\nHowever for those companies to be unprofitable someone else should cover the costs and send them money to continue day to day operations. This could be investors, banks, equity firms, who will see the potential and keep sending them checks till they reach the promised land.\n\nAmazon is such an example, which could be unprofitable for many years, but they always had access to cheap money. \n\nBut who will put additional money to WISH or RIDE in this environment. \nTheir stock price is below 2USD so what they could do to raise cash so they keep investing in the future? Issue new shares? They could do this when price was 20USD but can they keep doing it now?\n\nFor Pets.com, our favorite Dot com stock, they eventually reached one point that no one was willing to fund their loosing money operations and had declare bunkrupcy. \nI assume many companies will have the same fate now, but I don't know if their are artificially kept alive, or there are other reasons behind.", "score": 7, "replies": [{"body": "I suppose they were losing money, too?", "score": 1, "replies": []}]}]}, {"body": "Been thinking this as well. I imagine that it depends on the particular company and their specific debt structure. Rates are not yet painfully high, I can't imagine that most companies can't survive the current environment but as rates go up who knows. Banks are flush as well, but obviously lending is decreasing. I imagine that there would be tiers of bankruptcy, not like every meme stock or unprofitable name with 50%+ yoy growth will just go all at once. I wasn't investing during dotcom, and it certainly feels like the rug got pulled out for some companies, but some of them were only ideas without any revenue. I guess we'll learn more in a few weeks with earnings.", "score": 3, "replies": []}, {"body": "You can try to model out their cash flows and see when they go negative. Some will still be able to raise debt and roll a bit longer.\n\nYou can also look when their large debts mature. That can be a pretty big one.", "score": 2, "replies": []}, {"body": "I doubt you see many bankruptcies - at least for those companies with solid potential.  They'll be merged/acquired if they run into 'trouble'.\n\nYou mention PTON... that one has long been talked about as a perfect target for AMZN.  An add-on for their Prime members.  \n\nBut the big question for mega-cap acquisitions is if the FTC would allow it.  They're so against large orgs getting any bigger, they'd likely rather a small org go belly-up than allow it - assuming they can find even the smallest reason against an M&A.\n\nYou'll likely just see a whole lot of mid-cap M&As.", "score": 2, "replies": [{"body": ">\tYou mention PTON… that one has long been talked about as a perfect target for AMZN.  An add-on for their Prime members.\n\nThat’s mostly wishful thinking from PTON holders.", "score": 2, "replies": []}]}, {"body": "Unprofitability ≠ bankruptcy. A company can run at an operating loss for years as long as they have steady cash flow and/or grow at a stable rate.", "score": 0, "replies": []}, {"body": "Gme has like $1B cash on hand and burning $200-300m/quarter so either bankruptcy, take in more debt at high interest rate or share offering in the next 3-4 quarters \n\nThe company also has too much inventory that they can't get rid of fast enough\n\nTheir hail merry is the nft marketplace that hasn't launched yet, but crypto is plummeting so that doesn't seem too promising", "score": 0, "replies": []}, {"body": "Soon. SPCE is interesting one, they have literally spinned off the profitable bit of company (whole satellite delivery), so they clearly are oreparing for bankrupcy in case shit does go tits up.\n\nAs for the bottom... I'm not buying  until nasdaq touches 4000. Better safe than sorry.", "score": 1, "replies": []}, {"body": "The companies who have cash on the side will be better off and can use their advantage to growth further while  those debt ridden ones will slow growth and loose competitiveness", "score": 1, "replies": []}, {"body": "Not public company related, but the first sign you’ll see are zombie startups folding. Then more established startups that rely on ARR (SaaS companies) from said startups and as it all starts to unravel, every major subscription based company takes a hit. \n\nDoes it affect any of the companies you mentioned, not really, but it’s a similar effect.", "score": 1, "replies": []}, {"body": "Takes years. \n\n&#x200B;\n\nAsk Sears", "score": 1, "replies": []}, {"body": "\"Zombie\" Corps.\n\n&#x200B;\n\nThey shuffle along on by devouring cheap debt.   No more cheap debt means the weakest will start dropping soon.   So...yeah don't invest in companies that can't pay the interest on their debt.\n\nalso....brraaaiiinnnzzz.", "score": 1, "replies": []}, {"body": "Any day now...", "score": 1, "replies": []}]}
{"title": "What the bond market is telling us ?", "selftext": "*Hello everybody, my understanding about bond yields is pretty basic so please feel free to correct if I am saying anything wrong.*  \n *The federal reserve has started quantitative tightening , selling about 95 billions in bonds and mortgage-back securities every month.*  \n *After one month, especially yesterday the 10 year yield has decreased from the  peak 3.50 to 3.0.*  \n *Why yields are not going higher , is it a sign people are buying bonds so the yields would go down ?*  \n*Why is it a sign for recession ?*", "id": "vopc6g", "created_utc": 1656641529.0, "score": 45, "upvote_ratio": 0.88, "num_comments": 33, "comments": [{"body": "A couple of factors:\n\n1. Bond yields shot upwards even with only a couple of rate hikes because the market was pricing in future rate hikes.  Now it kind of looks like there is some damage being done to the economy already and so the Fed and other central banks may not have to raise rates as much as had gotten priced in.\n\n2. A lot of fear out there and higher bond yields are becoming attractive, and so people are buying more bonds.  This pushes down yields.", "score": 27, "replies": []}, {"body": ">Why yields are not going higher , is it a sign people are buying bonds so the yields would go down ? Why is it a sign for recession ?\n\nThe bond market prices in where the market believes the fed funds rate will go, similar to how the equity market prices in a company's future cashflows.\n\nLonger duration bonds like the 10 year tend to be less sensitive to movements in the Fed funds rate and can be seen more as a market prediction for where terminal rate will be. on the other hand short duration bonds like the 3 month tend to follow fed rate hikes much more closely.\n\nWhen shorter duration bonds yield similarly to longer duration bonds that's basically the bond market saying they don't believe the Fed will be able to continue raising rates. When longer duration bonds yield less than shorter duration bonds (yield inversion) that's the bond market suggesting that the Fed is likely to cut rates in the near-future suggesting recession is coming.\n\nTherefore you're right that the 10 year yield decreasing is a sign that the market believes the economy is weakening and that the Fed won't be able to hike as aggressively as previously thought. However it's important to also look at moves in the 10 year in relation to shorter duration bonds to get a better understanding of what the bond market is pricing. Currently the 2 year and 10 year are near inversion and the 3 month is beginning to follow. If we see a second inversion of 2/10s, especially if it becomes significantly inverted and stays inverted for longer than say a day or two that will be a very strong sign of recession.", "score": 24, "replies": [{"body": "Thank you that makes sense!", "score": 1, "replies": []}, {"body": "> Longer duration bonds like the 10 year tend to be less sensitive to movements in the Fed funds rate and can be seen more as a market prediction for where terminal rate will be. \n\nAka, the bond market is saying inflation is transitory.", "score": 1, "replies": [{"body": "It would have made much more sense for the fed to start tightening when they started thier stupid transitory narrative.\n\nNow they get to look incompetent twice by raising rates into a recession and claiming there is no threat of recession until the literal definition of recession says otherwise.", "score": 1, "replies": [{"body": "If you look at the details published today it looks like they haven't been serious about tightening at all even after claiming they would.\n\nAbsolutely wild. Powell's Fed has zero credibility.", "score": 1, "replies": []}]}]}, {"body": "That's a very good explanation, really nails the key points.", "score": 1, "replies": []}]}, {"body": "Pce lower than expected. Slow down happening. Market thinks rates will\nStart getting cut next year instead of 2024. Markets think inflation will come down quick second half of the year", "score": 25, "replies": [{"body": "Makes sense ,except quantitative tightening has just started tho \nMaybe I’m missing something or giving it too much importance to qt.", "score": 4, "replies": [{"body": "The truth is that no one really knows what the effect of QT will actually be because it really hasn't been done before (when Powell first tried it the market had a fit, then Trump had a fit, and QT quickly ended).", "score": 14, "replies": []}, {"body": "Also look at the wording is that the qt cap is 95 billion. Implying that they can sell that much, not having too", "score": 1, "replies": []}]}, {"body": "I'm personally seeing it real-time.  WMT parking lots 3/4 full at times of the day when they used to be packed.  Gas station queues non-existent.\n\nCrazy how the lack of regular stimulus-checks combined with $5 gas & $5 saltine crackers cuts back demand.\n\nAt this point I'd be beyond shocked if interest rate hikes don't drop off a cliff during the 2nd half of the year.", "score": 13, "replies": [{"body": "People have just changed their spending.  Airports, restaurants, bars, tourist attractions are all packed.\n\nPeople are no longer staying home and buying widgets for TikTok", "score": 5, "replies": []}]}]}, {"body": "Yeilds went up very quickly. This has been one of the worst, if not THE worst markets for bonds in a loooooong time.\n\nThings rarely move in a straight line though and volatility looms large in bear markets. I took today as a buying opportunity and made a very large wager that yields will get back above 3% by EOY.\n\nThe fed has told us its going to be around 350bps ffr by year but the market just doesn't believe them. I think the market is (currently) wrong. Yeilds haven't hit their yearly high yet.", "score": 9, "replies": []}, {"body": "active managment traders are simply unwinding short positions. this is causing yields to go down. \n\nas long as it is above 2.90%, nothing changed. US Feds will continue to raise rates.", "score": 6, "replies": [{"body": "No, 3.2 is what you actually want to watch as a treasury bond bear.\n\nYou want it to reclaim easily next week (reclaim and hold instead of fail) and shoot over the CPI panic highs during the next CPI reading as a bear.\n\nBecause if it doesn’t, right now 3.5 looks like an overshoot and fail.\n\nMy current thought is that it sets a lower high on the next CPI reading, then it’s bye bye no matter what the Fed does.", "score": 1, "replies": []}]}, {"body": "Oh God, oh God we are all going to die?", "score": 4, "replies": [{"body": "Yes. Every single one of us.", "score": 7, "replies": []}]}, {"body": "It's not just the market.  It's the S&P and really digital assets as well.\n\nIt's plain knowledge that the ECB, JCB, and Fed cannot raise rates much.  Above neutral is 4% tops.  The governments of these central banks will not cut spending.  Thereby they will go insolvent if JP tried to \"Volcker\" inflation.  \n\nS&P looks like it hits a trampoline at 3600.  The primary digital asset dips below $20K and it does not stay their long.\n\nBonds are doing the same thing.  Every single major financial market is calling these central banks liars.  \n\nAs such, you have stickier inflation.  The market isn't calling for the end of inflation, imo, it's calling for a higher level of \"neutral\" inflation.  5 years from now, the Central banks could be worried that they can't get inflation to stick above 5% which is the \"new normal.\"\n\nWhich makes sense considering ESG headwinds against further refinery capacity and resource extraction.  Oil drives everything.  And debt levels, without increased taxation and spending cuts cannot be decreased through any means besides inflation.  \n\nI have been researching Forex as a primary macro indicator because Gold and Silver haven't worked as of yet.  They probably will eventually but their markets are also heavily manipulated to suppress paper valuations.  It's not perfect but the best analogy to what Gold is supposed to be so far has been USD.  Mainly because USTs have nominally positive rates.", "score": 5, "replies": []}, {"body": "Large countries have been divesting from US bonds for months. That selling has slowed down for now.", "score": 2, "replies": []}, {"body": "I would not be shocked if that CPI panic earlier in June turned out to be THE top for TNX this year.\n\nIt isn’t for a good reason. Bond market is screaming that the Fed has swung toward being too tough. HYG selling and treasuries rallying was a hallmark of what was seen before the Fed wussed out in 2018. QT was going on for a little while after TNX peaked in 2018. Just because the Fed is doing QT, doesn’t mean that treasuries are going to sell if something bad is going on.\n\nCurrent thought is that we do see one more run higher, mainly with CPI on July 13th, but set a lower high and then it’s ta ta to the TNX run for 2022, because economic fear is going to overwhelm inflation fear.", "score": 2, "replies": [{"body": "Lmao too tough.\n\nThey JUST started QT and the ffr is 150bps.\n\nThe market thinks the fed is gonna bail them out but its not happening.\n\nSentiment is in the shitter because people are looking at big increases at the pump and grocery store, but the reality is that society as a whole is still sitting on massive amounts of savings. Everyone is worried but outside of short term cutbacks I don't expect people are going to change their behavior until the money runs out. Wages are also still increasing fairly rapidly. \n\nWe've got a decent run ahead of us. This latest pull back in yields is just short term noise.", "score": 1, "replies": [{"body": "I didn’t necessarily say the Fed was going to pause this year, and this move isn’t necessarily because the bond market says it thinks the Fed is going to pause.\n\nIf they do go through with ending the year at 3.5 on policy rate, TNX won’t be following because the bond market thinks the US economy is too weak to handle that rate.\n\nThey’re correct, and you’re wrong that the US economy is still strong, ALL of the data that’s been coming out lately is very, very weak.", "score": 0, "replies": [{"body": "> ALL of the data that’s been coming out lately is very, very weak.\n\nLike what?", "score": 1, "replies": [{"body": "Lmao, did you miss this morning? \n\nPMIs missed across the board and we're well on track to see an ISM below 50 pretty soon, which in case you're unaware, is contraction (and it's also triggered pauses by the Fed in the past...although not saying it will here).\n\nY'all can choose to dislike this, but unless the Fed actively sells treasuries or we start seeing some better economic data (only good economic data recently was new home sales last Friday, everything else has been missing), if they do go to 3.5 on policy rate by EOY, TNX won't be following because the bond market is correctly saying the country is too weak to handle even relatively elevated interest rates.", "score": 2, "replies": []}, {"body": "He means all the doom and gloom posts he reads on reddit.", "score": 1, "replies": []}]}]}]}]}, {"body": "I don't understand the bond market very well wither but there are more obvious indicators as to why we are entering a recession.", "score": 2, "replies": [{"body": "Absolutely, I actually think it’s an indicator because the yields get closer to invert.( I could b wrong)I still don’t understand how bond yields are going down , with quantitative easing just in the beginning why would people buy bonds .", "score": 2, "replies": [{"body": "The bond market thinks it can outplay the fed.", "score": 5, "replies": [{"body": "What could go wrong?", "score": 2, "replies": []}]}]}]}, {"body": "Learn to walk with heavy feet when they begin to make noise. Then find reasons to walk sround", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "vowex5", "created_utc": 1656666513.0, "score": 148, "upvote_ratio": 0.93, "num_comments": 28, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Everything is crazy expensive in southern France", "score": 14, "replies": []}, {"body": "It's even worse in reality. My grocery store prices are up 30% to last year, I know it exactly because I'm using supermarket apps with digital receipts. So I can compare prices from today to last summer.\n\n&#x200B;\n\nOfficial inflation is more than 10% in Spain and 20% in Estonia.", "score": 10, "replies": []}, {"body": "[deleted]", "score": 22, "replies": [{"body": "Yeah, what would these numbers look like without the Ukraine conflict?", "score": 0, "replies": [{"body": "In Oct 2021 it was already around 4% (double the ECB self imposed target)", "score": 6, "replies": []}, {"body": "Still high, but likely not as high. Inflation in my country is now the highest it's been since the 70s.", "score": 6, "replies": []}, {"body": "Not nearly as bad. Most of it is directly and indirectly caused by skyrocketing energy prices. Supply chain issues are starting to relax already. We'd be at 2-3% inflation instead of almost 9%.", "score": 3, "replies": []}, {"body": "Not much different IMO. 90% of the price increases you see today have nothing to do with Ukraine", "score": 2, "replies": []}]}]}, {"body": "EUROZUELA", "score": 31, "replies": []}, {"body": "Does the ECB still have negative interest rates?   They r destroying their Euro.", "score": 10, "replies": [{"body": "No, at least on bonds.\n\nDeposit facilities yes, but that’s the least to worry about.\n\nOMO nope.", "score": 1, "replies": []}]}, {"body": "I wonder how long Europeans will put up with inflation until they let Putin have ukraine", "score": 2, "replies": [{"body": "Then what? Let him march to Poland or Finland? This doesn't get better with Putin winning this war, it gets even worse.", "score": 9, "replies": [{"body": "then nato will fight. ukraine alone has not enough man power to fight as it seems.", "score": 4, "replies": []}, {"body": "The argument is sooo hackneyed as if Russia could pose any threat to any other country now or in the next 5 years. The NATO quick reaction force alone now has 140k troops in Eastern Europe, more than Putin had in February when he attacked Ukraine. In terms of missiles and fighter jets, NATO is probably even 10 times stronger.", "score": 1, "replies": [{"body": "If Russia goes after Taiwan and Iran stirs up some drama at the same time that will benefit Russia tremendously. Very very possible too", "score": 0, "replies": [{"body": "Russia going after Taiwan? Yeah, sure, very possible.", "score": 2, "replies": [{"body": "I meant China", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Fuckin Biden", "score": 1, "replies": []}, {"body": "Counties like Spain/Italy/Greece will default in a few months if the war continues. Or better, people of these countries will default, governments are very happy at the moment sadly for them", "score": -12, "replies": [{"body": "They will not default because rates won't increase in Europe, or not enough.\n\nThey are going to let inflation run and erase debts, as well as savings. This is the plan.", "score": 2, "replies": [{"body": "In fact i wrote the second statement. If people lose 10/20% of their savings in a year, i consider these people defaulted. I don't care if my state (Italy) is happy to have is debt reduced. \n\nAnd here in Italy it's not like in the usa or North europe, wages are the same of 10 years ago, that's why i consider ourselves in trouble as normal people", "score": 0, "replies": [{"body": "It's not a default, a default for people is bankruptcy, it's when you enter negative wealth. -50% wealth is not a default.", "score": 2, "replies": []}]}]}, {"body": "Countries*", "score": 1, "replies": []}]}, {"body": "So europe being economically crippled and having its poor population suffer since they cant keep up with inflation to protect the borders of a country thats wasnt even in the EU???? Makes sense why US is involved to sell energy and weapons to EU but why would Europe do this to itself?", "score": -8, "replies": [{"body": "It allows them to fight a proxy war without direct engagement, and will set Russia back economically for decades. This isn't without some struggle, but it is a win, and I don't see why they *wouldn't* take this opportunity.", "score": 1, "replies": [{"body": "Yes Tard, you set back Afghanistan and Iran and now they have a radicalised population, Russia has 6000 Nukes so im sure NATO “setting them back” and radicalising young Russians is a good idea", "score": -1, "replies": []}]}]}]}
{"title": "Selling for a loss to buy something else cheap.", "selftext": "I’m new, just 3 years in stock trading and Bottom line in the last 3 years was positive. Now I have a stupid question. While reviewing my portfolio. I noticed a few stocks that might take time to recover and down by about 20%. Other stocks have a higher chance of recovery very soon. Is it a bad idea to sell A with 20% loss to buy B which is cheap by also about 20% ?", "id": "vpawu1", "created_utc": 1656709259.0, "score": 14, "upvote_ratio": 0.77, "num_comments": 33, "comments": [{"body": "It’s usually wise to examine your portfolio to see if your reasons for buying a particular stock are still intact. If the macro situation has changed, as it has now with rates rising instead of staying near zero It’s time to alter your portfolio. Selling a Stock that is producing no returns is wiser than holding onto a losing position. Then you can use that money to put into something you determine through research to be potentially more profitable. Good luck.", "score": 11, "replies": []}, {"body": "Not only a good idea, but also good for taxes (see tax loss harvesting)", "score": 6, "replies": []}, {"body": "I'm not a financial panther but the broad advice is to buy low and then sell high.", "score": 7, "replies": [{"body": "I'm also not a financial panther.", "score": 2, "replies": []}, {"body": "What are the ticker symbols for low and high?", "score": 2, "replies": [{"body": "$TQQQ and $SQQQ", "score": 2, "replies": []}]}]}, {"body": "What do you think the future holds for the two?  If you think one is going to be better in the near term future, go with it.  Sometimes getting rid of a dog that’s going to continue to be a dog and replacing with something better is the best thing to do.", "score": 3, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}, {"body": "If it's a dividend payer with a history of dividend increases I don't use a trailing stop. Otherwise a 25% trailing stop is what I use and I do exactly what you  suggest. I did it in 2018, 2020 and this year too.\n\nIt's worked out very well for me. I'm not married to a stock if it dips 25% I bounce. Sometimes I'm in a stock for days or years but I ride it on the way up.", "score": 3, "replies": []}, {"body": "No, selling at a loss could be used as tax loss harvesting for the fiscal year. Buying something you think will make you money is always an option you could make money. And if you think the stock youre in will eventually go back up you can purchase leaps (long options) to try to recoup some $ out of that play.", "score": 3, "replies": [{"body": "Judging from the OP's question and post, it doesn't seem like he or she is at a point where options are a good idea.", "score": 5, "replies": [{"body": "Only reason I'm suggesting long options is because like I said if it's something OP thinks will go back up with time they can still maintain a small position without having to really pay much attention to it over time until it's closer to expiration. Though I'm unsure of how much capital/liquidity they have. Definitely doesn't have to do just a suggestion to maintain a position in a stock they're long in with less upfront of an investment", "score": 1, "replies": []}]}]}, {"body": "do the losers pay dividend?", "score": 2, "replies": [{"body": "sure", "score": 1, "replies": []}]}, {"body": "it is always wise to accepting loss and cut the loss rather than margin call..", "score": 2, "replies": []}, {"body": "I sold FB at a loss, and moved the money to scoop up BRK.b which also dipped drastically. I am confident with the move. Just gonna put the loss as a tax loss harvest.", "score": 2, "replies": []}, {"body": "Sure thing. It's called opportunity cost (look it up).\n\nOften people think in terms I can not sell this since it is in the red. It is already in the red so keeping it or selling it does not change the fact.\n\nThe only three reasons not to sell I can think of:  \nA) Your transaction costs are very high,  \nB) taxes and dividends and   \nC) You are bad at estimating the near term price movement velocities.", "score": 2, "replies": []}, {"body": "Make sure you buy a great company cheap\nThan a bad company for free\n\nSometimes, many times people see something dropped 75 percent and say it's cheap only to watch it get cheaper", "score": 2, "replies": [{"body": "Good advice, thank you", "score": 1, "replies": []}]}, {"body": "Nothing wrong with that", "score": 2, "replies": []}, {"body": "Depends what you are selling and what you would like to buy", "score": 0, "replies": []}, {"body": "I’m heavily invested in CHRS, a promising biotech that will launch four new products within the next year. Check it out", "score": -1, "replies": [{"body": "No thanks. No biotech or pharmaceutical for me. Worst industries ever.", "score": 0, "replies": [{"body": "Please save this post and check back in a year", "score": 0, "replies": [{"body": "Save mine too. Check it back in a few months.", "score": 0, "replies": []}]}]}]}, {"body": "Its always a bad idea. Just the other day this serial killer held my mom hostage and told me to sell a stock for a loss of 5$ or he will murder her.  Since selling for a loss is always a bad I told him to go fuck himself and now I don't have a mom", "score": -2, "replies": []}, {"body": "This is a smart thing to do if you think the other thing is going to grow faster than the one you hold.\n\nIf you hold the new thing over a year the tax issues are negated. If you hold it less than a  year then make sure your predicted growth differential is discounted by the additional tax you'll have to pay on it. If you held the existing thing less than a year then tax issues are irrelevant.", "score": 1, "replies": []}, {"body": "If you are very confident that the other option is a better long-term investment and will give you a higher return over these years, yes, perhaps rotating is a good choice.\n\nThere are some things that you should keep in mind, however:\n\n\\- The overall structure of your portfolio. Be careful not to over-concentrate.\n\n\\- Your risk management. While another stock may offer a higher upside, be careful to consider risk as well. You don't wanna rotate into all the high risk high potential upside plays.\n\n\\- Keep your long-term mindset and evaluate thoroughly. You do not want to get in a \"this stock might recover more in the next couple of months, so I'm gonna rotate into it now, then rotate back into the other one\" mindset.\n\n\\- Where a stock once was does not, in any way, determine where the stock price will go. 2 stocks may be down 20%. Doesn't mean they're both gonna get there again. They might for all intents and purposes, but that's not a guarantee. There are plenty of stocks down bad that are still trading very rich, and that might well stay flat if the multiples people are willing to pay come down.", "score": 1, "replies": []}, {"body": "Other than for tax reasons, you really shouldn't anchor your valuations on past prices. If you would not buy a stock at its present price, you should sell it. If you feel another stock has a better future, you should sell it, and buy the new stock. Any stock you hold, is the same as buying it that day. Taxes aside.", "score": 1, "replies": []}, {"body": "I’ve been taking money out of stocks that are flat or down just a few % ytd and throwing it back into s&p index funds. The s&p doesn’t dip like this often and I think it’s a safe long term play.", "score": 1, "replies": []}]}
{"title": "Shareholder Vote Guide 2022 | Tesla Investor Relations", "selftext": "", "id": "vosxf8", "created_utc": 1656653076.0, "score": 62, "upvote_ratio": 0.95, "num_comments": 37, "comments": [{"body": "I went with the board recommendations.  Not because I don’t think some of the things are bad, but because it seems everyone has such a hate-on towards Musk that they’re trying to dig up any dirt they can, and if that kind of stuff is going on, we’ll hear about it.", "score": 9, "replies": []}, {"body": "I hold shares through two different brokerages. I already voted through one of them, can I vote through the other as well or will that be discounted/void my vote altogether?", "score": 5, "replies": [{"body": "Yes you should vote at the other brokerage too (if they also offer that service). If you have 4 shares at one broker and another 6 at the other broker, you need to vote at both to cast all the 10 votes you are entitled to. It's completely independent and you can even vote differently at the other broker, in which case you could end up with 4 \"for\" votes and 6 \"against\" votes.", "score": 7, "replies": []}, {"body": "Yes both. You have only voted with some of your shares so far. Not through all your shares. \n\nRemember each share is a vote. Not one vote perperson. If you have twice as many shares as I do than your vote is stronger than mine.", "score": 2, "replies": []}]}, {"body": "Can someone explain to me how the shareholder questions are chosen?", "score": 2, "replies": [{"body": "Some are questions from the Tesla board, these are typically the ones that the board recommends to vote \"for\", else they would not have asked.\nOther are requested by shareholders. I think that bar is very low, you need to own at least one share, but there are few other requirements, so these questions are sometimes more of a statement than having any chance of receiving a positive vote. The board usually recommends against questions proposed by shareholders, because if they agreed they would have made the proposal themselves. As far as i know the board can't choose from shareholders questions, they have to put all of them up for vote, if they meet all requirements.", "score": 1, "replies": []}]}, {"body": "I know the board doesn’t want it but I think transparency on some of these issues is important for the Tesla brand as Elon has become more antagonistic towards ESG focused customers and investors.", "score": 3, "replies": []}, {"body": "I have a hard time seeing Tesla's board's opinion on some of these proposals. Reporting on child labor? against. Reporting on water use? against. Reports on anti-harrasement and discrimination? against. WTF.", "score": 4, "replies": [{"body": "They are for minimizing child labor, water usage, discrimination, etc., and always have been. They are against becoming a reporting company instead of a car company.", "score": 13, "replies": [{"body": "That doesn't make any sense. Reporting issues in your company doesn't make you a reporting company.", "score": 2, "replies": [{"body": "These are broad, often unanswerable questions, often requiring a team of full-time employees to research and report. Adding 6 of these teams every quarter does affect the production of EV's. Note that Tesla is already reporting these things, the proposals are for making the reports more detailed. I think that time spend on finding more details is better spend on actually doing something about it.", "score": 2, "replies": [{"body": "Hogwash. \"Tesla is currently being sued for failing to address documented child labor in its supply chain\"\n\nhttps://www.sec.gov/Archives/edgar/data/1318605/000121465920007479/d826200px14a6g.htm", "score": 1, "replies": [{"body": "I don't see \"documented child labor\" in the Tesla supply line in that link. Sure you could \"document\" a theoretical possibility, and I'm sure Tesla is aware of those, but how do we know Tesla did not address this? And then it suddenly switches to corruption. The proposals lists many whole countries but is not very clear about what Tesla should actually do, which is a disappointing shortcoming of this proposal.\n\nIf there is a clear action Tesla could do to reduce child labor in their supply line, or even an effective way to reduce that theoretical possibility, I would be all for it, but I don't see that in this proposal.", "score": 1, "replies": [{"body": "A clear action is a combination of 1) attestation, 2) activity metrics and 3) outcome metrics.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Well I'm guessing they aren't enjoying children, so why should they do a report about it", "score": 1, "replies": []}]}, {"body": "Just vote as the board ask and not what wokes want.", "score": 8, "replies": [{"body": "There's really no need for another woke/anti-woke debate here in this sub. That's what the rest of reddit is constantly plagued with, no reason to let it ruin this sub as well. \n\nWe all like Tesla, just use your votes and we'll see what happens.", "score": 9, "replies": [{"body": "This sub very frequently just believes Musk is never wrong though.", "score": 0, "replies": [{"body": "Elon is quite often wrong, but these shareholder proposals would mostly mean voting against my money.  I don’t see a reason to do that.\n\nIf I didn’t like the way they ran their business, I’d sell rather than tie their hands.", "score": 14, "replies": [{"body": "Because Tesla ownership and Tesla vision, is about more than money?", "score": 1, "replies": [{"body": "Many of the shareholder proposals are coming from entities attempting to harm Tesla and push their own agenda.", "score": 1, "replies": []}]}]}, {"body": "Elon is wrong from time to time, but overall he is intelligent and usually right.\n\nJust check out his Master plan I and II.", "score": 7, "replies": []}]}]}, {"body": "No, vote however goddamn you want to vote. I am gonna vote against the board on a few items most likely.", "score": 26, "replies": [{"body": "I voted against (extra) restrictions on which accounting firm Tesla could choose. That's just politics.", "score": 4, "replies": []}]}, {"body": "Among retail investors, large investors tend to vote with the board recommendations. Wealth is linked to intelligence.", "score": 4, "replies": []}, {"body": "Yeah, like who cares about making sure child labor doesn't occur in Tesla? Shouldn't be reported /s.... Also discrimination against people doesn't exist. Tesla absolutely shouldn't care about that /s...Water management....it's not like Tesla, like every other company, should be open about its water use when it's trying to campaign as a climate change/green EV company right.", "score": -2, "replies": [{"body": "They don't need another useless reporting to care about it.\n\nIf you need to have to report to behave correctly, you're not a decent human being.", "score": 0, "replies": [{"body": "A lot of people aren't \"decent\" human beings. Some of them work in tech. Reporting isn't \"useless.\" You can pretend there are no problems by not looking.", "score": -1, "replies": []}]}]}, {"body": "[deleted]", "score": -7, "replies": [{"body": "And what's happened to those companies?", "score": 2, "replies": []}, {"body": "Disney is definitely unrecognizable after being woke.", "score": 2, "replies": [{"body": "Woke is a disease, once a company got it, it's difficult to cure. The good thing is the disease eventually will kill the companies or severally weaken them. New stronger companies will emerge.", "score": 2, "replies": []}]}]}]}, {"body": "When do we vote to shut Elon up?", "score": 0, "replies": [{"body": "Unpopular opionion but objectively true it seems. The Musk cultists annoy me.", "score": 3, "replies": [{"body": "I was once one of them, some of them will come around in time. \n\nMy main concern is “big picture” electrification. EV is Tesla in the US, Tesla is still 70% of the EV market. The words EV, Tesla and Elon are all interchangeable to many people, the ones that still need convincing about electrification. I have had more than one person tell me, IRL, “I don’t want an EV, that Elon guy is an asshole”. \n\nWhen Elon says stupid shit it just feeds the O&G propaganda machine. He makes it too easy for them. He needs to shut up and let some other bright people at Tesla into the spotlight. We need new faces for the company but not tech bros.", "score": 2, "replies": []}]}, {"body": "I don't remember exactly which quarter, but I think there has been a question in that spirit. It didn't get a majority in voting. You need to find a LOT of voters for such a proposal since Elon has about 20% of all votes and is likely voting against it...", "score": 2, "replies": []}]}]}
