{"title": "$TSLA Daily Investor Discussion - January 01, 2020", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "eiggmo", "created_utc": 1577870028.0, "score": 21, "upvote_ratio": 0.97, "num_comments": 137, "comments": [{"body": "First comment of the decade- predicting we will be past 4000 by the end!", "score": 21, "replies": [{"body": "I hope you’re right.", "score": 3, "replies": []}, {"body": "Fact is, 2020 is the final year of the second decade of the 21st century. Decade means 10 years. Just like the number 10, the tenth year od a decade ends in a zero. There was no “year zero” n the Gregorian calendar.", "score": -42, "replies": [{"body": "Imagine commenting about something nobody cares about this many times", "score": 23, "replies": [{"body": "Imagine people investing in a tech stock that cannot count to 10.", "score": -8, "replies": [{"body": "Lol, that was actually funny. +1", "score": -2, "replies": []}]}]}]}]}, {"body": "Dutch Marketshare stats over 2019\n\n1. VW 10.9% \n\n2. Opel 7.3\n\n3. Tesla 6.9\n\n\nAs to best sold models\n\n1. Tesla model 3 30k\n\n2. VW polo 12920\n\n3. Ford Focus 10478\n\nSource NOS app", "score": 22, "replies": [{"body": "And Model 3 deliveries didn't even start until late February. Amazing.", "score": 3, "replies": []}, {"body": "Woa, that is telling, when the Tesla small car comes out...", "score": 1, "replies": []}]}, {"body": "https://www.dropbox.com/s/rmbrlmq6vxzchc8/Stanphyl%20Capital%20Letter%20-%20December%202019.pdf?dl=0\n\nStanphyl Capital (Mark Spiegel’s ‘fund’) letter dated December 31st. Haven’t had time to read it, but it’s gotta be good. Enjoy!", "score": 18, "replies": [{"body": "Thank you! Hope the holiday’s good fun!\n\nFirstly, the fund was down -11.4% in December 😂\n\nIt’s their third down year in a row so he’s having to reevaluate all positions and apologise. \n\nThey’ve halved the size of the Tesla short. It was 20% of the fund and is now 10%.\n\nAnd he’s cancelled all short positions that were profitable and kept only Tesla, their worst one?!\n\nHow is his whole investor letter just a childish review of his hate for Tesla?! How do his investors put up with this?!\n\nHe’s officially lost the plot.", "score": 22, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Right,  there is no way he’s legit.  But to their credit it worked.  He got on cnbc many times.  Everyone’s heard of him.  We’re talking about him.  Sort of maniacally brilliant.", "score": 2, "replies": []}]}, {"body": "If you had a million bucks and PAID somebody to burn a thousand bucks a day all month you'd still end up with more money in your bank account on new years day than of you had invested it with Spiegal.", "score": 10, "replies": []}, {"body": "Yes, Zanzibar is awesome!", "score": 4, "replies": []}]}, {"body": "Ok couldn’t resist and quickly went through it... dude sounds as unhinged as ever. I pity the fools who’ve trusted him with their money.", "score": 16, "replies": []}, {"body": "TL;DR he was outperformed by every index fund and blames it on TSLA fraud, again. He even states that \"if you wanted to hire somebody who was successful with each short position except for in the auto market\" he's your guy! And then goes on to say he's still going to short auto companies (TSLA) LOL.\n\nImagine admitting where you made your mistakes, and then saying \"I'm going to continue making these mistakes and you will pay for them\".", "score": 14, "replies": []}, {"body": "Still maintains a 10% short in TSLA, and he can't help but throw in that there's \"major league fraud\" going on.", "score": 10, "replies": []}, {"body": "He literally referenced ‘a great Seeking Alpha article’ to explain one of his big investments.  Is this guy serious?\n\nAlso:\n\n> For December 2019 the fund was down 11.4% net of all fees and expenses. By way of comparison, the \nS&P 500 was up 3.0% while the Russell 2000 was up 2.9%. For all of 2019 the fund was down 6.5% while\nthe S&P 500 was up 31.5% and the Russell 2000 was up 25.5%. Since inception on June 1, 2011 the fund \nis up 53.7% net while the S&P 500 is up 187.5% and the Russell 2000 is up 121.8%. Since inception the \nfund has compounded at 5.1% net annually vs. 13.1% for the S&P 500 and 9.7% for the Russell 2000.\n\nhaha.jpg", "score": 8, "replies": [{"body": "Don't you want your hedge fund manager to get his information from seeking alpha??", "score": 3, "replies": [{"body": "I get my investment advice from seeking alpha. But I always do the opposite from their recommendations.", "score": 2, "replies": []}, {"body": "Makes sense when you think about it", "score": 1, "replies": []}]}]}, {"body": "Mark Smeagol?", "score": 6, "replies": [{"body": "Smeagol was only a sad poisoned hobbit. Spiegel is also a piece of shit.", "score": 3, "replies": []}]}, {"body": "Who is this staphylococcus guy? \"Major League\" fraud? I see 10 Model 3 a day here in Florida.", "score": 3, "replies": []}, {"body": "Haha. MSB has just gathered a bunch of negative stories (and there have been plenty of fud stories last year) on Tesla like a mindless bot. And is creating a wonderful fantastical narrative of it. His emotions - on probably losing bunch of money and vitriol to Musk - oozes all over. How investors can take this as objective analysis is beyond me.  Poor guy - 2020 will be an even worse year for him.\nOh well, at some point, I hope he gets help and recovers.", "score": 6, "replies": []}, {"body": "A psychopath's manifesto", "score": 3, "replies": []}]}, {"body": "Well we haven't had any leaked emails on \"we are within striking distance of delivering a new record or 1xx k\" (paraphrase mine). Musk has been rather tight lipped.\nMy guess is 108K.", "score": 17, "replies": [{"body": "The new pattern is underpromise and over deliver,  be quite and let the results talk.  Official estimate is 106k.  Let’s see what happens.", "score": 24, "replies": [{"body": "Street estimate is 106k? So annoying - if they do 105k they hit their guidance which none of the analysts thought they would six months ago, but all the headlines will read 'tesla misses estimates'.", "score": 9, "replies": []}, {"body": "As it should be. Stop having everyone interpret the secret meaning of each email. Strong companies let the results speak for themselves and simply guide the narrative on earnings call / investor days.", "score": 8, "replies": []}, {"body": "I think 120k deliveries.  They said in the Q2 letter that their goal was a 130k/q run-rate at Fremont.  If they ramped evenly during Q3 and Q4 to that number, that puts their Q3 deliveries within a couple thousand of the actual results, and it puts Q4 deliveries at 120k.", "score": 9, "replies": [{"body": "I hope that is correct. Anything more than 107k will be great.", "score": 8, "replies": []}, {"body": "I think it’s possible you’re right and if you are I think it will be the end of times for short sellers.  Nothing to do but wait and see.", "score": 6, "replies": []}, {"body": "I really want what you’re smoking dude. If they deliver 120k cars I’ll eat a shoe and post it", "score": 8, "replies": [{"body": "Can't eat your shoe and post it too.", "score": 4, "replies": [{"body": "They could post the video of the act.", "score": 1, "replies": []}, {"body": "Underappreciated comment IMO", "score": 1, "replies": []}]}, {"body": "Do sandals count, or are we talking combat boots?", "score": 2, "replies": [{"body": "Fresh pair of Reebok’s", "score": 1, "replies": []}]}, {"body": "Oh man you’ve started something now!", "score": 2, "replies": []}, {"body": "Hmm, may I suggest [chocolate shoes](https://www.gayleschocolates.com/chocolate-golf-shoe).\n\nOr would that be cheating?  :)", "score": 2, "replies": []}, {"body": "How's that fleshlight treating you? Been thinking of picking one up myself", "score": -3, "replies": []}]}, {"body": "I wanted to say 120k too, but I thought it'd look silly... I figured someone's probably got a spreadsheet with likely production rates showing why that'd be nearly impossible.\n\nI think before I wrote 7-10k above, or 111-114k.  I consider that conservative...", "score": 1, "replies": []}]}]}]}, {"body": "Dutch numbers in December (total 2019)\n\nModel 3 12043 (29969)\n\nEtron 3032 (4336)\n\nLeaf 1068 (9499)\n\nZoe 1014 (6152)\n\nMG ZS 1066 (1218) (this is really impressive, btw. The car was launched in November, if I’m correct. Cars cost 2/3 of a SR Model 3, are well equipped and the range is not bad. Elon really should come with a car that is affordable for regular people).\n\nTotal BEVs in December 22895 of a total of 42270 passenger cars sold.\n\n2019: 62464 BEVs compared to 330519 passenger cars on gas. \n\nDiesel cars sold in 2018 63k slashed to 35k in 2019.\n\nSource kentekenradar.nl", "score": 15, "replies": [{"body": "Bjorn Nyland has a bunch of videos on the MG, has even bought one in Thailand. Looks quite interesting for places where you can’t buy a Model 3.", "score": 6, "replies": []}, {"body": "> Elon really should come with a car that is affordable for regular people\n\nI think prices can go down drastically if the cars get manufactured in the continent in which they'll be sold in.\n\nIf the Germany factory can have a line for each model, and supply all of Europe, the prices should come down.\n\nShipping cars across the Atlantic isn't cheap.\n\nHowever, if FSD comes fast enough, a Tesla's sticker price won't matter, as you can send the car out to make you money when you're not using it.", "score": 2, "replies": []}, {"body": "The Etron selling pretty well, surprised.", "score": 2, "replies": [{"body": "Good thing for Tesla", "score": 0, "replies": []}]}, {"body": "What caused the etron spike?", "score": 1, "replies": [{"body": "The benefit in kind tax law changes. Any car sold in 2019 has the benefit of a more advantageous tax. Lease company/companies bought the cars so they can continue to offer them to clients with the reduced tax rate.  The etron sales benefitted from that.", "score": 3, "replies": []}]}]}, {"body": "Happy 2020, hoping delivery numbers crush Cowen's credibility once again later this week.", "score": 14, "replies": [{"body": "Would be awesome if they release the numbers before market open tomorrow.", "score": 2, "replies": []}]}, {"body": "Start the decade at 420 end it at 4200", "score": 26, "replies": [{"body": "/u/Peel7 and others could probably argue for $42000 lol", "score": 9, "replies": [{"body": "If I had to bet money on it being closer to $4200 or $42000 on the 31st of December 2030, I honestly would have to think about which one I'd choose. I'm honestly not sure. I don't think \\~$20k at the end of 2030 is that far fetched if you run the numbers.", "score": 10, "replies": [{"body": "What is overlooked is that Tesla is becoming a manufacturing company. I expect them to come out with all kinds of products once they’ve covered cars, trucks, solar, batteries, robots, mining, ... \n\nOn area might be building factories, since they need to build tens of factories. And housing, for their hundreds of thousands of employees. And desalination, to recover minerals from sea water. And so forth.\n\nMusk might push some of this since he needs the ability to manufacture anything on Mars. Although he might use SpaceX instead or a new company.", "score": 7, "replies": [{"body": "See my comment.  We are on the same page I think.", "score": 1, "replies": []}]}, {"body": "It comes down to 3 dates.  I’m not a bean counter so no big spreadsheet from me.  But the world is changing:\n\n1.  FSD feature complete\n2.  FSD no driver assist.  This will be a historical marker indicating the beginning of the automation age.  It will be the first example of a non trivial job ( driving ) being automated.  \n3.  An automation machine producing another automation machine.  This changes life as we know it.\n\n\n1 and 2 I expect in the next decade.  If they happen near the beginning of the decade then I can see Tesla being worth Trillion (s).", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Check out my blog:\n\n[https://teslainvestor.blogspot.com/2019/12/my-tesla-investment-thesis-20-teslas.html](https://teslainvestor.blogspot.com/2019/12/my-tesla-investment-thesis-20-teslas.html)\n\nIt's very long, but a good read. Some of the numbers towards the end are aggressive, and one should factor in some more risks/uncertainties, but those are actually well above \\~$20k stock price. I think a $20k-$25k price target for end of 2030 is pretty reasonable.", "score": 2, "replies": []}]}]}]}, {"body": "2020 is the last year of the decade. There is no year zero in the Gregorian calendar. The new decade starts 2021.", "score": -25, "replies": [{"body": "While technically true and interesting trivia, it's rather counterintuitive and pretty much just a historical accident. I vote we ignore it.  :)", "score": 8, "replies": [{"body": "When I examine the policy effects of a decade (like governments do), I have to measure properly. The census in the US, for just one example, is taken in the last year of every decade. I find it very counterintuitive to count from zero to nine and count the first ever decade from 1BC to 9AD. When I count ten things, I do not start my counting at zero.\n\nI’ll just leave this sub to do its own thing.", "score": 0, "replies": [{"body": "Well, in the common usage of saying \"the 80s\", 90s, 40s, etc people think of those as decades.  It's more intuitive that way really, at least in my opinion.\n\n<placeholder for a joke about starting at zero and C/C++>", "score": 3, "replies": [{"body": "You are not wrong about the cultural wisdom. Of course, for many, many Americans, the cultural wisdom is that the best way for Tesla’s stock to go up is through organizing prayer and the intervention of Angels.\n\nWhat is intuitive is entirely subjective, so no argument there. Switching the Gregorian calendar to base 8 could at least create interesting results.", "score": -1, "replies": [{"body": "[XKCD's thoughts on the matter.](https://imgs.xkcd.com/comics/i_love_the_20s.png)", "score": 1, "replies": []}]}]}]}]}, {"body": "Do you also correct everyone by telling them that their 1st birthday was actually the day they were born?", "score": 7, "replies": [{"body": "No, 1st birthday is one year old. People are not calendars.", "score": 4, "replies": [{"body": "A decade refers to **any** 10 year time span. \n\nSo you could call 2014 the end of a decade.  It would be odd, but you can’t technically call it wrong.  It would be useful if you’re talking about the significance someone’s employment, relationship, etc.\n\nIt’s common for people to refer the change in the 3rd digit in the year as a new decade.  Makes no sense to try to get everyone to think the way you do.  Now please try to think the way 64% of Americans think.", "score": 6, "replies": [{"body": "Those Americans also believe in angels intervening in their lives.\n\nOf course the Gregorian calendar is arbitrary about what it has as decades. In other calendars, it is not the end of a decade as well.", "score": -2, "replies": []}]}]}]}]}]}, {"body": "Final number for the Netherlands. Over 12k model 3's delivered this month. 17k delivered in Q4 including S/X", "score": 13, "replies": [{"body": "17k for one country is just bonkers, I know the BIF will increase to 8% next year (which decreases the tax benefit), however with the new emission regulation I do expect tax benefits to return from 2021/2022 again", "score": 5, "replies": [{"body": "There's talk about replacing it with a 6k tax return. That way everyone benefits, not just ppl that get a company car.", "score": 4, "replies": []}]}]}, {"body": "On deck for 100 shares tomorrow", "score": 13, "replies": [{"body": "Where is all this cash coming from lol", "score": 5, "replies": [{"body": "I can finally sell my other bullshit stocks since it's Jan 1st!", "score": 8, "replies": [{"body": "Haha gotcha. Just see that you’ve been loading up lately.", "score": 1, "replies": [{"body": "Gonna have to do something like ten shares a month after this, sad!", "score": 3, "replies": []}]}]}]}, {"body": "Atta guy, keep collecting!", "score": 2, "replies": []}]}, {"body": "This is the start of an amazing decade to come!", "score": 12, "replies": [{"body": "The new decade starts 2021. The tenth year of decades ends in a zero just like the number 10. The first year of the new millennium, likewise, was 2001.", "score": -29, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "The first decade of the Gregorian calendar starts year 1 and ended year 10. Where are you suggesting the extra year came from? Days of the week are unconnected to the year and constantly in rotation.", "score": -8, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "That’s nothing. When the Pope reworked it, nearly a couple weeks were declared to never have happened, calendar-wise. Days of the week are rotating constantly because 7 day weeks do not accurately align with one rotation around the sun.\n\nWhen analyzing policy effects into decades, I have to actually group based on actual decades.", "score": 2, "replies": []}]}]}]}, {"body": "https://xkcd.com/2249", "score": 3, "replies": []}, {"body": "Litterally nobody counts 1990 or 1979 as part of the 80s. It started in 1980 then went on to 81,82,83,84,85,86,87,88,89 (that's 10) then the 90s started. 90,91,92,93,94,95,96,97,98,99(that's 10 again!)\nYou're just wrong and annoying. \"Butbutbut no year zero!\" Nobody cares, that's not how we measure our decades.", "score": 3, "replies": [{"body": "A decade is 10 years and when talking about “the 90s” you are literally not talking about the decades of the calendar,  but talking about a set of 10 years off by one year from the calendar decades.\n\nLiterally many people care and many people do know how to be right about it. Like, say, the US government. The decennial census, taken at the end of a decade, happens in 2020. The push to have a mid-decade census to improve tracking despite the enormous costs is to have one in 2025, not 2024 because 2021 is the first year of the second decade of the 21st century. The push to have one in the 70s was to have a mid-decade census in 1975, not 1974.\n\nI am not repeating some twitter meme, I have to use what a decade is on the calendar in my work.\n\nMany people care and I commented a few times because this is a tech stock investor site and people should know better.\n\nAlso, take as a warning not to be rude.", "score": 0, "replies": [{"body": "Cool story bro, we aren't in your office. You should know better that the colloquial use (the way everyone except you is using it in these conversations) describing a decade on the calendar starts on the 10,20,30,40, ect.\n\nYou going \"uM AcTuALlY iTs On tHe 21St\" is not only annoying it's wrong. You can say SOME PEOPLE count it that way, but no, you want to be the weird guy with no social skills saying \"this way that I use it is right and everyone else is wrong!\" \n\n\nGood luck with being a twat dude.", "score": 1, "replies": [{"body": "All I have been saying is that 2020 is the last year of the 202nd decade of the Gregorian calendar. You are free to use whatever calendar you want.\n\nAlso, please constrain your urge to use abusive language. We generally issue warnings before bans.", "score": 0, "replies": [{"body": "No, you're saying stuff like \"imagine not being able to count to 10\" and bringing up people who believe in angles. You're just being a dick. Nobody gives a damn about what your office uses in this context. \nEveryone celebrated the new millennium between 1999 and 2000, not 2000-2001. Maybe you can try counting to 10.", "score": 1, "replies": []}]}]}]}]}, {"body": "Nerd", "score": 2, "replies": [{"body": "Well...yeah.", "score": 1, "replies": []}]}]}]}, {"body": "Is it illegal when journalists don't post their name when they write an article?The Guardian has been writing hit pieces on Tesla and Elon Musk for the past 3 months some of which were borderline fake news. Like this article, that says Tesla was on auto pilot when clearly it wasn't, it was speeding, ran a red light and crashed into a Civic  [https://www.theguardian.com/technology/2020/jan/01/tesla-autopilot-california-crash-two-deaths](https://www.theguardian.com/technology/2020/jan/01/tesla-autopilot-california-crash-two-deaths)  What was weird about this 1 is no name of the writer.", "score": 9, "replies": [{"body": "Unfortunately, it's legal. \n\nI get it, but at the same time it's beyond ridiculous at this point.", "score": 4, "replies": [{"body": "I hope that doesn't become a trend from big publications, like when a hit piece comes out from the La times and it's Russ Mitchel most people ignore or Charley Grant from the WSJ but when these clowns start hiding their names, that might trigger some kind of panic in the investor/// consumer base. These journalists have made it their life long mission to attack and spread misinformation about the company. Even the Tesla Q s have to disclose their positions on twitter. This is crazy.", "score": 4, "replies": [{"body": "If a journalist refuses the by line, that should tell you everything you need to know.", "score": 1, "replies": []}]}]}, {"body": "If there is no name then it’s not journalism. The Guardian is respected, I’m surprised it would sink that low.", "score": 3, "replies": [{"body": "True", "score": 1, "replies": []}]}]}, {"body": "https://cleantechnica.com/2020/01/01/did-tesla-reach-its-guidance-of-more-than-360000-vehicles-delivered-in-2019/amp/?__twitter_impression=true\n\n\n“That brings deliveries to over 118,000 vehicles, beating guidance by about 14,000 vehicles and ending the year at around 374,000, according to my calculations.”", "score": 9, "replies": [{"body": "If that happens the Stock will explode, most people expect a tiny beat or even a miss.\n\nNot sure how much stock i want to give cleantechnica, regardless the next few Days will certainly be interesting.", "score": 5, "replies": []}, {"body": "Sounds a lot more reasonable than that cowen hit piece", "score": 1, "replies": []}]}, {"body": "Does Tesla announce Q4 deliveries today or tomorrow? Also is the info up on the investor relations page or elsewhere? Thank you in advance and Happy New year!", "score": 8, "replies": [{"body": "#s Jan 2-3 but the meat & potatoes like auto gross margins, Megapack and Solar sales for Q4, and other key things like overall revenue, cash flow, etc will be Jan ~29th (https://www.nasdaq.com/market-activity/stocks/tsla/earnings). \n\nMaybe we get more on FSD before this though. They’re itching to release something.", "score": 9, "replies": [{"body": "Pretty sure that earnings date isn't confirmed. From your link:\n\n> The upcoming earnings date is derived from an algorithm based on a company's historical reporting dates. It is possible that this date will be updated in the future, once the company announces the actual date. \n\nI'm hoping it's the 22nd because (1) I'm inpatient and (2) I'm own a couple jan 23 calls", "score": 5, "replies": [{"body": "Yes unconfirmed. Just going off expected date from Nasdaq.", "score": 2, "replies": [{"body": "Hehe... Nadsaq", "score": 3, "replies": []}]}]}]}, {"body": "They need time for money confirmation and accounting confirmation.", "score": 6, "replies": [{"body": "Ahh, and today being a bank holiday means tomorrow. Thank you sir/madam.", "score": 1, "replies": [{"body": "Could be Friday too.  I actually think it will be Friday.", "score": 5, "replies": []}]}]}, {"body": "Tomorrow I think", "score": 3, "replies": [{"body": "Yeah I could not find it this morning so I figured tomorrow since people have the 1st off", "score": 1, "replies": [{"body": "Even when people are working on the first the numbers often come out on the 3rd. I expect them to come out Friday or Monday", "score": 2, "replies": []}]}]}, {"body": "22 January", "score": -3, "replies": []}]}, {"body": "If December 2019’s been tough for Mark Spiegel, January 2020 will be even tougher. \n\n\nhttps://mobile.twitter.com/ElonsWorld/status/1204074581226594306/photo/1?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 7, "replies": [{"body": "When was the last time the stock market was down three years in a row?\n\nCan you imagine underperforming the market by a factor of 3 over the lifetime of your investments?", "score": 5, "replies": [{"body": "Well this guy's whole shtick is that the market is a big bubble and he's shorting the bubbliest parts. He started the fund in 2011 and it's been a bull market ever since. His objective seems to be to make money when the market isn't making money. If you had a lot of money, wanted to hedge 1% of your wealth against the market, and thought electric cars were stupid (which represents an oddly large subset of wealth in the US), MBS might interest you. I have very little money relative to a lot of people, but even I keep a portion of what I have in S&P puts to hedge against the market. If I had a lot of money and some guy offered me -5% annual compounding performance vs the S&P during bull markets and + 20% annually in bear markets, I'd check it out. \n\nWith that said, Spiegel is a moron and shitty guy from what I've seen, and I would never consider giving him money", "score": 2, "replies": []}]}, {"body": "He almost certainly closed those positions for a massive loss already. And anyway, if those options already lost 98% of their value, they can't have much of an impact on the fund from here", "score": 2, "replies": []}]}, {"body": "welcome to 2020 ladys and gentelman! \nlets get rich.\n#tesla", "score": 15, "replies": [{"body": "It’s 2020 and I now identify as a Tesla. Please be more considerate next time.", "score": 21, "replies": [{"body": "Ah crap. Elon, I think one of your autopilot computers has gone sentient again...", "score": 10, "replies": []}, {"body": "sorry tesla", "score": 2, "replies": []}]}]}, {"body": "Been reading a lot of tweets from Mark Speigel over the past hour for the first and last time. \n\nI can’t believe his views, he’s just moronic. \n\nThis was a tweet he put out about Greta - https://twitter.com/markbspiegel/status/1211743590151536640?s=21\n\nIt seems that not only does he hate Tesla but he doesn’t believe that carbon emissions are damaging the planet. He wants to keep burning fossil fuels and ruin anyone trying to help the situation.\n\nElon needs to execute quickly and take this guy out once and for all.", "score": 13, "replies": [{"body": "The guys short bets are taking him out fine... He lost money in a year where the index gained over 30%", "score": 11, "replies": []}]}, {"body": "Tomorrow may be one of the most interesting trading days for Tesla. \n\nDeliveries are likely out tomorrow. But we are going to be missing a lot of info until the actual quarterly release so it’ll be interesting what sort of +/- activity we get with the stock. \n\nIf they end up coming within range that’s amazing, though headlines could say otherwise. Will it drop if #s are only okay? It really shouldn’t even if they do 100K-105K, but it’s a wild ride so who knows. Plus, maybe Elon will release news on other catalysts like the # of megapacks and solar roofs installed. Maybe he comes through on the driver-supervised FSD (said it would be close in terms of getting this out by YE), or that China will be doing 2,000/week+ by the end of January. \n\nAll I know is I went for more on that dip and cannot wait. Anyone else feel the same way about tomorrow?", "score": 7, "replies": [{"body": "Yes, trying to transfer funds into my account to buy more. Process might take until Friday. I'm really hoping for minor movements until then. That said, yes I am excited. I see various possibilities, it's the best kind of surprise: \n\nIf it does go down (miss numbers or whatever): I'm buying more\nIf it goes up: I'm buying more, but will be temporarily sad\nIt it stays about even: great, will buy more.\n\nPlanning on another 3K into as many shares as I can get!", "score": 5, "replies": [{"body": "Good on ya", "score": 2, "replies": []}]}]}, {"body": "Anyone wanna speculate on Q1 2020 yet? I'm confident we will hit guidance for 2019, but we'll find out soon.\n\nMy thoughts: might be dip Q1 2020, but depends on Model Y ramp. I don't forsee a major dip after Q1 2020...", "score": 3, "replies": [{"body": "It depends mostly on gf3 ramp and Europe demand", "score": 2, "replies": []}, {"body": "Tesla has intentionally left Q4 demand unsatisfied in the US outside California and Europe outside the Netherlands. So that will need to be filled. Plus China at 1500-2000/wk. \n\nImprovements to the FSD preview will push demand. I think this will start a major shift in public expectations. When we can say that a Tesla assists you along your entire drive from home to work, it will be clear that Tesla offers more. The day of Level2+ on BOTH highway and city streets is rapidly approaching. Single features should deploy in Q1.\n\nPlus more DLC like the 1/2 second acceleration improvement.\n\nPlus grid storage and solar. They offer real cost savings, so they should continue to grow regardless of the quarter.", "score": 2, "replies": []}]}, {"body": "Where do you look for delivery estimates ?", "score": 3, "replies": [{"body": "You won’t get that niche data on the public sources. You likely need Facstet, Refinitiv, a Bloomberg terminal, or CapitalIQ. But you can get high-level analyst info on yahoo finance: https://finance.yahoo.com/quote/TSLA/analysis/.", "score": 2, "replies": []}]}, {"body": "https://top.teslastats.no/", "score": 1, "replies": []}, {"body": "We were told that feature complete FSD is on track to be released to early access customers by yesterday. Do we know whether it was released yet?", "score": 1, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "I know, and you're right, but a decade is 10 years starting when I choose.\n\n2005-2015 is a decade just like 2010-2020 is also a decade.\n\nLikewise 1895-1995 is a century.\n\nI can choose to start counting whenever I want because these things are units of measurements, not calendar events.", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Some people have to make Gregorian calendar charts by decade using, for one example, the end of decade census that happens every 10 years in the US. That will be happening in 2020 if you are not from there, since 2020 is the last year of the second decade of this new century. Some are even fighting to have a mid-decade census despite the costs. That mid-decade census would happen in 2025, not 2024.\n\nThe push failed back in the 70s when they tried to create a mid-decade census for 1975.\n\nThe Gregorian calendar is arbitrary, but works for many governments.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Having it at the end of each calendar decade is why they only put it off for three years at the start. Cultural conventions aside, the government uses the actual decades of the calendar. It is only a year ending in zero if you use the Gregorian calendar and 2020 is factually the last year of the 202 decade of the Gregorian calendar. (Heck, it was only a “new year’s day” if using that calendar.)\n\nMy wife is a literature professor and has long since given up on fighting cultural conventions for ignoring the basic rules of grammar in the English language (outside her classroom and scholarship).\n\nI clearly need to do the same when it comes to innumeracy. I had people sending me vitriol in private messages and even stating 11 year spans as composing a “decade”. Even this little tech and financially competent corner of the internet is pointless to try in. It was like I jumped into a Southern Baptist sub and pointed out that Jesus, assuming just the Catholic Church teachings in seminaries, was a Jewish “apocalyptic prophet”, one amongst many in his time.\n\nI have respected your opinions on this sub, so I throw in the proverbial towel and leave the world to its own devices.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The days of the week are unconnected to how many days there have been and they rotate constantly within years. Heck, a handful of days were removed (as in canceled out to no longer have happened within the time measured by the calendar) to fix the calendar during the shift from Julian to Gregorian.\n\nI am rather shocked by the by the vulgarity and vitriol I have been sent over a simple fact of time keeping. I brought the topic up just to push back slightly against the cultural herd-mentality a tiny bit.\n\nI'm actually very put off by an investment community that fiercely adheres to a herd mentality, rather than civil and intelligent conversation. (I don't mean you.)", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks for the reasonable reply, even if we disagree.\n\nHonestly, people who do social media for a living and have to deal with huge flows of insults and vulgar abuse must have a different mentality than I do. Maybe for some it is ok since it comes with being paid.\n\nFortunately, I earn nothing from reddit. I hope you have a joyous Year of the Rat when it starts later this month. \n\nAlthough it might be rough. I just spent an entire semester teaching a class that prominently featured Soleimani and his role in militia organizing in Syria. Apparently, my country just killed him (to say nothing of al-Muhandis, who I know little about). I have no viable model for what will happen next, especially with our particular President in the mix. When individual psychology becomes too strong of a variable, normal predictions (as bad as even those are) becomes impossible.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "FYI, you have 11 years in both your decade examples and 101 years in your century example.", "score": 1, "replies": []}]}]}]}
{"title": "2019 1st Annual Wallstreetbets Awards Winners", "selftext": "#Welcome to the 1st Annual Wallstreetbets Awards!\n\nHere we will celebrate some of the most notable WSB users and posts of 2019. It was an interesting year with a lot of colorful characters and crazy plays. Let's toast to 2020 being just as wild. Who knows what the rest of the year will bring. I'm excited to find out and hope to see some of you here next year!\n\n######**Categories**\n\n- ##**Autist of the Year**\n - Winner: >!u/RobinhoodTeam as voted by the community for their lack of control over their own platform. The runner ups would not be possible without Robinhood.!<\n - Runner ups: >!u/ControlTheNarrative (GUH), u/analfarmer2, and u/1R0NYMAN!<\n\n- ##**Thread of the Year**\n - Winner: >![No bamboozles, everyone who comments in this thread will be invited to become a mod of r/WSB.](https://old.reddit.com/r/wallstreetbets/comments/b87viz/no_bamboozles_everyone_who_comments_in_this/) by u/OPINION_IS_UNPOPULAR. This was great and had over 78k comments. It picked up very quickly and reached #1 on all. Of the 78k commenters, around 7k people were modded before the operation was canceled!<\n - Runner up: >![A Message From The Mods](https://old.reddit.com/r/wallstreetbets/comments/at3nf1/a_message_from_the_mods/) (paper trading competition results) by u/CHAINSAW_VASECTOMY. Unfortunately over 200 people fell victim to this trap.!<\n\n- ##**Plays of the Year**\n - Winner: >!u/TheTriviaTribe for turning **$766 into $108,000 in TWO trades.** Link to [imgur album with two images of plays](https://imgur.com/a/E99lJaC). Link to [thread of first play](https://old.reddit.com/r/wallstreetbets/comments/d6xlct/thank_you_roku/) and link to [thread of second play](https://old.reddit.com/r/wallstreetbets/comments/d8pmeu/thank_you_spy/).!<\n\n- ##**Most Overall Realized Gain of the Year**\n - Winner: >!u/thesmd1 for making **$1,020,882.86** from AMD day trades! Link to [thread here](https://old.reddit.com/r/wallstreetbets/comments/ec6jrx/822mil_of_amd_in_one_year_average_trade_of_200k/). Link [to image of gain](https://i.imgur.com/mNTGTrD.jpg). Note that there are others that have made more but for privacy reasons, they do not want to reveal their gains!<\n\n- ##**Most Gains from a Single Play**\n - Winner: >!u/analfarmer2 for making $277k+ after news helped his play. Image [of the play](https://i.imgur.com/WTfR06Y.jpg). And [thread here](https://old.reddit.com/r/wallstreetbets/comments/cksrsf/spy_puts_277k_profit_in_1_minute/).!<\n - Runner up: >!u/Fuyuki_Wataru for making [+$212,092.68 with his BYND play](https://old.reddit.com/r/wallstreetbets/comments/cptdkw/cook_hookers_it_is_boys_update_on_old_500k_bynd/).!<\n\n- ##**Most Percent Gain from a Single Play**\n - Winner: >!u/VacationLover1 for having a 16,000%+ gain from a single options play. Picture [of the gains here](https://i.imgur.com/8EY7SFS.jpg).!<\n - Runner up: >!u/Yoloking25 with a 10,836.73% gain with BIIB. Link [to thread here](https://old.reddit.com/r/wallstreetbets/comments/ed4d5g/600_bucks_to_53k_last_biib_earnings_never_gets_old/)!<\n\n- ##**Loss of the Year**\n - Winner: >!u/analfarmer2 for losing over $600k. It started with [this play](https://old.reddit.com/r/wallstreetbets/comments/ckycr2/600k_yolo_in_fds_expiring_tmrw_if_i_die_remember/), and then an [update to that play](https://old.reddit.com/r/wallstreetbets/comments/cl4sku/at_the_end_of_the_day_money_is_just_paper/), and finally ended [with this play](https://old.reddit.com/r/wallstreetbets/comments/cnrj9t/doubling_down_wasnt_the_best_idea/). Here is [an album of six screenshots](https://imgur.com/a/aUEWN6E) that show the rise and fall of his portfolio. We definitely feel for analfarmer2 as the $600k he lost can be quite life changing. Be well, and remember that it's just paper.!<\n\n- ##**Meme Maker of the Year**\n - Winner: >!u/Haupt91 for all of his amazing work throughout the year, and for being the first to do a [live interview format meme](https://old.reddit.com/r/wallstreetbets/comments/dtf7s0/wsb_yolo_king_lands_interview_on_cnbc/). Most memes that people make are images or videos with text, but this one went above and beyond and set a new standard. We hope to see others try this style. Keep up the great work haupt. Looking forward to seeing what you come up with this year.!<\n\n- ##**Meme of the Year**\n - Winner: >![The Legend Of 1R0NYMAN](https://old.reddit.com/r/wallstreetbets/comments/ahy7dy/the_legend_of_1r0nyman/) by u/EffingDankrupt. This was very well made and came from someone who hadn't previously made any memes for wallstreetbets. This also happens to be his only meme thus far. Hopefully he has another great one in store for this year.!<\n - Runner up: >!Various works by u/haupt91. He made so many great ones in 2019. Way too difficult to come to a consensus and choose one.!<\n\n- ##**Live Stream of the Year**\n - Winner: >!u/ControlTheNarrative for being the first to do a live stream of a loss. We hope others follow suit (but hopefully in gains). Thread [link here](https://old.reddit.com/r/wallstreetbets/comments/dpnzup/i_recorded_todays_marketopen_and_the_instant/). And direct [video link here](https://www.youtube.com/watch?v=A-tNkuYV4_Q).!<\n - Runner up: >!u/Dejula for his live stream of TSLA losses. Thread [link here](https://old.reddit.com/r/wallstreetbets/comments/e01t9k/watch_the_downfall_of_dejula/) and direct [video link here](https://www.youtube.com/watch?v=Nq5AhzKOrJw). However, see below.!<\n\n- ##**Comeback of the Year**\n - Winner: >!u/Dejula for recovering from his TSLA losses in a very short time when TSLA went from 320s to 420s. Link [to thread here](https://old.reddit.com/r/wallstreetbets/comments/ed4cok/guess_whos_back_bitches/). If you don't want to read, here is an [imgur link of the rebound graph](https://i.imgur.com/OEOFGvG.jpg). If you'd like to watch, here is a [video of him explaining the comeback live](https://www.youtube.com/watch?v=LZjjNvwY9Xo). !<\n - Runner up: >!u/socialist_baby for recovering from $15k to $65k. Thread [link here](https://old.reddit.com/r/wallstreetbets/comments/dwssnw/if_youre_going_through_hell_keep_going/). And imgur album of [two screenshots found here](https://imgur.com/a/EF0SiQN).!<\n\n- ##**Gilder of the Year**\n - Winner: >!u/Fuyuki_Wataru for gilding over $2k worth of reddit awards [in this thread](https://old.reddit.com/r/wallstreetbets/comments/cptdkw/cook_hookers_it_is_boys_update_on_old_500k_bynd/).!<\n - Runner up: >!u/riskit4debiscuit for randomly gilding people throughout the year. We are all thankful for your random acts of gilding!<\n\n- ##**Phrases of the Year**\n - >!It literally cannot go tits up!<, >!Funding secured!<, >!It's just paper!<, >!Priced in!<, >!Trades talks are going well.exe!<, >!Mods are gay!<, >!Personal Risk Tolerance™!<, >!GUH!<\n\n- ##**Gang of the Year**\n - Winner: >!Bull Gang!<\n - Runner ups: >!Theta Gang!< and the critically endangered >!Bear Gang!<\n\n- ##**Selfie of the Year**\n - Winner: >!u/WilliamNyeTho with [this picture](https://i.imgur.com/iu5145v.jpg) of him wearing [official WSB merch](https://www.redbubble.com/people/officialwsb/shop). We hope to see more selfies with WSB merch this year.!<\n\n- ##**Song of the Year**\n - Winner: >!u/hooker_reacharound for playing and singing [this amazing song](https://streamable.com/bd10r) on the spot. He was banned, and the mods made him do a song to get unbanned. Link [to the thread here](https://old.reddit.com/r/wallstreetbets/comments/b3v5hj/banned_for_political_comments_ive_asked_the_mods/).!<\n - Runner up: >!u/Orgasimo for making [Say Something I'm GUHving Up on You (oFfIcIaL Music Video)](https://old.reddit.com/r/wallstreetbets/comments/dr3eki/say_something_im_guhving_up_on_you_official_music/). Direct link [to video here](https://www.youtube.com/watch?v=rASpieLvH7c).!<\n\nSuggestions for other awards are welcome for 2020, and may be added if there is enough interest.\n\nSome of the winners may receive a free hardcopy book that u/jartek (CEO of wallstreetbets) is working on. It should be released this year!\n\nThank you to all the regulars and lurkers for making wallstreetbets what it is today. Without you, this subreddit would not be possible. Our current target is to have *one million subscribers* by the end of the second quarter. I hope you all enjoyed the year in review, and I wish each and every one of you a great year. May 2020 bring tons of fond memories and gains for all of us!", "id": "eihjak", "created_utc": 1577878961.0, "score": 4197, "upvote_ratio": 0.98, "num_comments": 201, "comments": [{"body": "u/analfarmer with multiple awards on both sides of the spectrum. This is why we're all here.", "score": 1270, "replies": [{"body": "u/analfarmer2*", "score": 559, "replies": [{"body": "I feel like he should win based on name alone", "score": 161, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Is this Cheems alt?", "score": 3, "replies": []}, {"body": "Cum Francisco Bay.", "score": 1, "replies": []}]}]}, {"body": "Sooo that nigga dead right?", "score": 14, "replies": []}]}, {"body": "He sure is on the spectrum that’s for sure.", "score": 65, "replies": [{"body": "He keeps me cumming *on his*  back", "score": 12, "replies": []}]}]}, {"body": "Let's take a moment and pray for our fallen soldiers u/analfarmer2, and u/1R0NYMAN \n\n\nIn 2020 new individuals will be born to take up their spots, let's pray for them as well lmao\n\n\nThanks for the award!", "score": 784, "replies": [{"body": "Well deserved award. Grats on your gains! Best of luck in 2020 :)!", "score": 142, "replies": [{"body": "He started 2020 with 250k long ACB. Literally can’t go tits up.", "score": 8, "replies": []}]}]}, {"body": "Do you think Robinhood risk management had a good 2019", "score": 379, "replies": [{"body": "Its just one guy. Lots of masturbating alone in a closet.", "score": 273, "replies": []}, {"body": "Doesn’t exist. They spent that part of the budget on artisan water for the break room.", "score": 86, "replies": []}, {"body": "The ones that weren’t fired?", "score": 15, "replies": []}, {"body": "LMAO I spit out my coffee once i unveiled the spoiler tag and saw robinhoodteam.", "score": 14, "replies": []}]}, {"body": "Autist of the year being Robinhood’s account that posted like one thing in their entire reddit career, of which was downvoted quicker than the NASDAQ in 2008. Incredible work, WSB community. Keep it up.", "score": 176, "replies": [{"body": "...and banned. Lol.      \n     \nWSB mods should win \"Gayest Mods\" category, with Automod the runner up.", "score": 27, "replies": [{"body": "On one hand it’s fucking funny that they got banned, on the other hand it’s a shame because of the opportunity meme cost.", "score": 7, "replies": []}]}]}, {"body": "Thanks. This is truly the retarded version of the Grammys. I want you to picture me in a bright blue turtle neck, with a noticeable boner through my skinny jeans. I'm wearing sunglasses on my way up to the podium to give my speech. I pause to reflect how the most impact I had last year was by making fucking gif videos about the stock market.  The crowd waits with bated breath as I stand at the podium - taking it all in. I lift my hand to quiet the room. And after what seems like eternity, I give the signal... \n\nA remote control device pulls my pants down in one fell swoop to reveal a speedo, fully pitched, with the words \"Theta Gang\" prominently displayed. The crowd screams in approval. I grab the mic. \"I HEREBY RESIGN AS GENERAL OF THE BULL GANG.\" The crowd is delirious.  Women are crying. Men have tears in their eyes. I turn the whole thing into a retarded gif meme. \n\n\n\nI'm legitimately looking forward to Jarteks book. 2020s will undoubtedly become the most autistic decade. We will make sure of it.", "score": 174, "replies": [{"body": "\"I want you to picture me in a bright blue turtle neck, with a noticeable boner through my skinny jeans.\" - haupt91, January 1, 2020.\n\n\"2020s will undoubtedly become the most autistic decade. We will make sure of it.\" - haupt91, January 1, 2020", "score": 58, "replies": []}, {"body": "I'd suck dick to see a gif meme involving your hard penis no homo", "score": 21, "replies": [{"body": "2020 might be the year this happens. Stay tuned.", "score": 21, "replies": []}]}, {"body": "Had me at \"noticable boner\".      \n     \nCongrats, daddio 😘", "score": 4, "replies": []}, {"body": ">  I want you to picture me in a bright blue turtle neck, with a noticeable boner through my skinny jeans\n\nI'm picturing you naked\n\nn-no homo", "score": 2, "replies": []}]}, {"body": "How did personal risk tolerance not make it in phrases of the year?", "score": 134, "replies": [{"body": "Been editing post a bit. Just added that! Thanks", "score": 88, "replies": []}, {"body": "I’m just waiting for “IF YOURE CONFUSED LOOK ST THE PICTURES”", "score": 23, "replies": []}]}, {"body": "Lost 1.75 million in two weeks because of over leverageing and went bankrupt. Not even an honorable mention.", "score": 206, "replies": [{"body": "If we did a 2018 version you'd totally be in there. Sorry, just trying to keep it current -- nothing against you. Was inspired to do the awards after so many neat things happened last year.", "score": 138, "replies": [{"body": "Classic case of blowing your load too soon", "score": 123, "replies": [{"body": "The sooner you get one out of the way, the sooner you can recover for another one.", "score": 58, "replies": []}]}]}, {"body": "There’s always this year to do it again", "score": 72, "replies": []}, {"body": "How are you doing nowadays with that tax liability. Make any money this year?", "score": 21, "replies": [{"body": "Well, I was able to pay off 7300 bucks, at the beginning of 2019 I owed about 220k  and now I owe 240k after penalties fees and interest.", "score": 56, "replies": [{"body": "Jesus Christ. Why only 7300 bucks? I was reading your post history and it looks like you have a good job. And even a second job.", "score": 29, "replies": [{"body": "The 7300 I paid was for my missed 2018 tax. I sent an offer in compromise to ask that the 200k I owe for 2017 taxes be forgiven since the entirety of the money was lost. I’ve been saving every penny the last year and have close to 80k in my checking account after working two fulltime jobs. Worst comes to worst I’ll be stuck for another year working two jobs and have to liquidate my 401k", "score": 50, "replies": [{"body": "Dude you really got fucked. Sometimes I get jealous at the people making tons in the stock market but then someone like you comes along and makes me so happy I’m only investing a few hundred dollars here and there.", "score": 38, "replies": [{"body": "I mean, I could take my 80k and yolo into some amzn puts. That shit is bound to drop like 20% any day now", "score": 41, "replies": [{"body": "That's the spirit!", "score": 26, "replies": []}, {"body": "You’d be beyond saving at that point", "score": 14, "replies": [{"body": "He really wants a spot on next year's list!", "score": 8, "replies": []}]}]}]}, {"body": "Best of luck man. Hopefully the IRS works something out with you.", "score": 26, "replies": []}]}]}]}]}, {"body": "Just reinstall the app.   ;)", "score": 21, "replies": []}, {"body": "Holy moly", "score": 13, "replies": []}, {"body": "No one caress except you and the IRS", "score": 32, "replies": [{"body": "I care", "score": 9, "replies": []}]}, {"body": "You can't be serious. I respect you for still being here, if nothing else ... I'd be asking my doctor if suicide is right for me!", "score": 4, "replies": [{"body": "It sucks trust me", "score": 7, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "1) getting margin called when your stocks go tits up is not gambling 2) I never blamed trump anymore than you’d blame a ceo who’s making statements causing your portfolio to have extreme swings due to his statements. 3) go ducking kill yourself", "score": 2, "replies": []}]}]}]}, {"body": "Do it again this year and get on the awards list!", "score": 2, "replies": []}]}, {"body": "Can't believe I forgot about no bamboozles and the paper trade threads. Evidence that the mods were slightly less gay twice this year.\n\nThis one about the reddit moderation survey was also a great thread: https://www.reddit.com/r/wallstreetbets/comments/cj3l52/filled_out_a_survey_with_my_experience_as_a_wsb/", "score": 141, "replies": [{"body": "While they were both epic events,  I dont like that the paper trading event is mentioned here.  I feel like some new members could *really* benefit from round 2 and I'd hate for them to get an unfair advantage...", "score": 48, "replies": [{"body": "Seconded", "score": 10, "replies": [{"body": "Thirded", "score": 5, "replies": []}]}]}, {"body": "YES I've wanted to find this one", "score": 2, "replies": []}]}, {"body": "GUHd job mods!", "score": 71, "replies": [{"body": "Thanks! It took me a couple hours to put it together. Wanted to get it done on New Year's Day since it's a day off.", "score": 40, "replies": [{"body": "U da real mvp storm. \n\nI don't care what they say about you: ur ogay with me.", "score": 25, "replies": []}]}]}, {"body": "> Phrases of the Year\n\nPriced in", "score": 46, "replies": [{"body": "Not sure how I forgot to include that one, but it's added now. Thank you!", "score": 21, "replies": [{"body": "EVERYTHING IS ALWAYS PRICED IN", "score": 12, "replies": [{"body": "Me forgetting to include it was priced in.", "score": 15, "replies": []}]}]}]}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 163, "replies": [{"body": "Good Bot.", "score": 16, "replies": []}]}, {"body": "Phrase to start the year?", "score": 33, "replies": [{"body": "2020 vision: \n\n*noun*\n\n1. To be confident in one's prediction\n\n - \"SPY is going to 420 this year. Trust me, I've got *2020 vision*.\"\n\n - \"Market is going to be green tomorrow. Believe in my 2020 vision.\"\n\n - \"Alright guys, if you're wondering calls or puts, my *2020 vision* says to buy calls.\"", "score": 102, "replies": [{"body": "I’m amused but also angry", "score": 28, "replies": []}]}]}, {"body": "These are truly destructive times we live in my fellow degenerates. It is amazing to be alive to witness the beauty of the full spectrum this sub unleashes. \n\nIt truly has been a memorable year and couldn’t agree more with all your winner selections.", "score": 29, "replies": []}, {"body": ":')\n\nhappy new year gang", "score": 26, "replies": []}, {"body": "Congrats to Haupt on his well deserved victor as meme maker of the year!", "score": 22, "replies": [{"body": "😘 I personally wouldn't be able to vote against The Legend of 1ronyman, but I'm not complaining", "score": 25, "replies": [{"body": "Much appreciated my friend, but I had just one moment of inspiration and a gif that really wrote itself. You are out there putting the blood sweat and tears in day after day.  Congrats on a great year.", "score": 5, "replies": [{"body": "Thanks man. Your shit was hilarious tho.", "score": 5, "replies": []}]}]}]}, {"body": "What about \"I'm guhving up on you\" as runner up for song of the year?", "score": 17, "replies": [{"body": "Added. Thanks for reminding!", "score": 6, "replies": [{"body": "A runner up should be the “take my money to the Robinhood and buy till I can’t no more”", "score": 4, "replies": []}]}]}, {"body": "Shanghai Stock Exchange opens in just under 10 hours, start your year right with hoisin flavored tendies.", "score": 12, "replies": []}, {"body": "Wait where can I buy wsb merch?", "score": 11, "replies": [{"body": "It's linked in the sidebar, as well as the post for one of the award winners.\n\nhttps://www.redbubble.com/people/officialwsb/shop", "score": 7, "replies": [{"body": "I just lost my shit at the Subprime shirt", "score": 9, "replies": [{"body": "I don’t get it.", "score": 1, "replies": []}]}]}]}, {"body": "Keep em coming fellow retards. It is better than buying lottery at the gas station.", "score": 9, "replies": []}, {"body": "It's been real.", "score": 10, "replies": []}, {"body": "Congrats to all the winners. Very well deserved. Your autism does not go unappreciated 😊  Hopefully we can do some prizes next year.", "score": 11, "replies": [{"body": "Best I could do is maybe offer some stickers since there are so many winners. I'm gonna either buy a bunch of stickers from the shop for this purpose, or ask the guy who runs it to kindly donate a batch to use as prizes. We'll see how I do in the first couple months.", "score": 5, "replies": []}]}, {"body": "2020 Year of Tendies !", "score": 8, "replies": []}, {"body": "“Field of Tendies” for meme of the year!", "score": 17, "replies": []}, {"body": "Cannot click on any links in Apollo Reddit App 🥇", "score": 14, "replies": [{"body": "Sorry about that, just fixed it, will be in the next build! For the longest time you couldn't link inside spoilers so this took me by surprise a bit.", "score": 2, "replies": [{"body": "Thanks!!", "score": 2, "replies": []}]}]}, {"body": "I am proud to have at least commented in many of these threads.\n\nHere's to another year of WSB shenanigans.", "score": 7, "replies": []}, {"body": "**Mod of the year award** goes to u/stormwillpass - hands-down one of the chillest mods out there.", "score": 7, "replies": [{"body": "Automod and SwineFluPandemic as runners up.", "score": 1, "replies": []}]}, {"body": "This place saved me about a year ago and now life’s turned around - love y’all and I hope ya had a good new year!!!", "score": 11, "replies": [{"body": "Make a Storytime thread about it!", "score": 10, "replies": []}]}, {"body": "Happy New Year fellow retards!!", "score": 5, "replies": []}, {"body": "2020 is guhnna be great", "score": 5, "replies": []}, {"body": "This is a quality post. Can’t wait to see what 2020 brings.", "score": 5, "replies": []}, {"body": "Haha this is a nice fun list!", "score": 5, "replies": []}, {"body": "Thanks for this nice looking leg lamp thing.  It's quite a prestigious award.\n\nThanks to u/1ronyman for giving us such an in-depth look at what its like to be truly autistic. \n\nThanks to the mods for being so incredibly gay.\n\nAnd thanks to [u/haupt91](https://www.reddit.com/user/haupt91/) [u/\\_\\_rosebud\\_\\_](https://www.reddit.com/user/__rosebud__/) [u/Bipedal-Moose](https://www.reddit.com/user/Bipedal-Moose/) and [u/argus456](https://www.reddit.com/user/argus456/) for putting way too much time and effort into such beautiful shitposts.\n\nYou are truly an inspiration to autists and lurkers everywhere.", "score": 6, "replies": []}, {"body": "Congratulations to all the winners!  Happy New Year!", "score": 4, "replies": []}, {"body": "Tons of gains in May 2020 you say... Can't wait", "score": 5, "replies": []}, {"body": "What a great year in review. \n\nI can't wait to see what causes the next great wsb purge but I'll enjoy watching it all go down", "score": 5, "replies": []}, {"body": "Can we top 2019?", "score": 3, "replies": [{"body": "I'm sure we'll all be surprised by how things turn out in a year. I don't think there will be any glitch related things. If anything, it might be a boring year, but I guess we'll soon find out!", "score": 4, "replies": []}]}, {"body": "Learning about the story of U/1RONYMAN has made my 2020 worth living. God bless him/it", "score": 4, "replies": []}, {"body": "man so many autists we could create our own country full of autists", "score": 3, "replies": []}, {"body": "Thanks for the percent gain award. I’m pretty mad cause I had a 21k percent gain on ulta but didn’t screenshot it cause I wasn’t active on here.  Making me true king of the autist for forgetting to even screenshot it", "score": 4, "replies": [{"body": "Of course! Congrats on your BIIB gain and for posting it.", "score": 2, "replies": []}]}, {"body": "It's the inaugural not the 1st annual. Why does no one know this...", "score": 11, "replies": [{"body": "https://old.reddit.com/r/wallstreetbets/comments/dgg1ze/2019_inaugural_wsb_pumpkin_designing_contest/\n\nI used Inaugural for this thing, but 1st Annual looks better IMO.", "score": 8, "replies": []}, {"body": "1st analyall", "score": 2, "replies": [{"body": "Says the bottom", "score": 2, "replies": []}]}]}, {"body": "Mods are gays.", "score": 7, "replies": []}, {"body": "Everyone?", "score": 3, "replies": []}, {"body": "Suhhhhh", "score": 3, "replies": []}, {"body": "Idk how you gave a nod to bear gang but not GOLD GANG. We're coming for you in 2020!", "score": 3, "replies": []}, {"body": "Nice work storm can't wait for the 2020 awards", "score": 3, "replies": []}, {"body": "Crazyy", "score": 3, "replies": []}, {"body": "Thanks for this mods, really makes me emotional to see all that has been accomplished in a year", "score": 3, "replies": []}, {"body": "GUH", "score": 3, "replies": []}, {"body": "Wow, it truly has been a blessed year for our little fucked up community. Thanks for putting the time into putting this together!", "score": 3, "replies": []}, {"body": "I love this place I'm sticking around because no other sub will take me. 💪😎", "score": 3, "replies": []}, {"body": "my new years resolution: take the autist award home", "score": 3, "replies": []}, {"body": "looking forward to losing more money with you wonderful autists next year!", "score": 3, "replies": []}, {"body": "Did the moonyacht93 guy make it there somewhere? The guy that leveraged 4k into 1.7 million or whatever the numbers were during the Robinhood infinity money glitch fiasco.", "score": 3, "replies": []}, {"body": "Great thread but stonks only go up should've been a phrase of the year", "score": 3, "replies": []}, {"body": "The paper trade scheme should be somewhere in the awards. Great list though", "score": 5, "replies": [{"body": "It's there. You must have missed it in the sea of text.", "score": 8, "replies": []}]}, {"body": "Not to brag but I was nominated for top shitposter award I probably would’ve won if it was an actual thing💁‍♀️", "score": 4, "replies": []}, {"body": "Mod me", "score": 2, "replies": []}, {"body": "Make me a mod pl0x", "score": 2, "replies": []}, {"body": "Recessions are just one big bear trap", "score": 2, "replies": []}, {"body": "Yo the paper trading thread should have won over the mod thread lmao", "score": 2, "replies": []}, {"body": "Great job with this list!", "score": 2, "replies": []}, {"body": "Thank you for this!", "score": 2, "replies": []}, {"body": "I almost forgot about the paper trading contest lol, that video is fucking hilarious 2nd time around", "score": 2, "replies": []}, {"body": "Happy new year and may the gains always be in your favor", "score": 2, "replies": []}, {"body": "I'd switch the song of the year and the runner up, say something is a classic.", "score": 2, "replies": []}, {"body": "How can someone make 100k from 700 with 2 trades ? Im new here and just interested can someone ELI5?", "score": 2, "replies": []}, {"body": "Only reason I have a reddit account. Wallstreetbets for life.", "score": 2, "replies": []}, {"body": "Al-theta gang?", "score": 2, "replies": []}, {"body": "This is fucking wholesome and certainly a portent of things to come in 2020. Cheers to you all.", "score": 2, "replies": []}, {"body": "Who sells wsb merch?", "score": 2, "replies": []}, {"body": "I’m going to make it on the list in 2020 jk", "score": 2, "replies": []}, {"body": "I’m so proud of what this sub has become", "score": 2, "replies": []}, {"body": "What an incredible year!", "score": 2, "replies": []}, {"body": "If you win, do you get a new sick flair?", "score": 2, "replies": []}, {"body": "Hey mod plz dont bamboozle I would like to control powaaaaa", "score": 2, "replies": []}, {"body": "I don’t understand what it is that you guys do here, but it is entertaining and I appreciate it", "score": 2, "replies": []}, {"body": "This thread is tremendous", "score": 2, "replies": []}, {"body": "When is Wallstreetbets launching its own inverse ETF?", "score": 2, "replies": []}, {"body": "we should have these more often. in monthly format", "score": 3, "replies": []}, {"body": "Literally cannot go tits up had been something I've said continually since that chonk of a legend posted it.", "score": 2, "replies": [{"body": "this guy is why the anti vaxxers exist", "score": 1, "replies": []}]}, {"body": "Glad to have joined this community this year", "score": 2, "replies": []}, {"body": "Threads like these make me wonder how you neckbearded basement dwellers made the money in the first place.", "score": 2, "replies": []}, {"body": "Gayest post of the year \n\n&#x200B;\n\n* Winner - This post", "score": 2, "replies": []}, {"body": "lovely", "score": 2, "replies": []}, {"body": "This is great.", "score": 2, "replies": []}, {"body": "GUH", "score": 2, "replies": []}, {"body": "Meme god sub", "score": 2, "replies": []}, {"body": "Gayest Mod of the year?", "score": 2, "replies": []}, {"body": "Looking forward to what kind of ridiculous shit 2020 brings.", "score": 2, "replies": []}, {"body": "If the 20s end without a WSB induced market crash, we could've been more retarded.", "score": 2, "replies": []}, {"body": "This is fantastic, well done good sir!", "score": 2, "replies": []}, {"body": "I vote for the OP of this thread for putting links inside spoiler tags that way you can click the links without revealing the spoiler and have to figure out what the fuck is going on for yourself", "score": 2, "replies": []}, {"body": "Wow, only 7k accounts got modded? I feel special. And not in the usual short bus sense.", "score": 2, "replies": []}, {"body": "Phenomenal recap of the pure degeneracy herein", "score": 2, "replies": []}, {"body": "Good shit.", "score": 2, "replies": []}, {"body": "Hey u/stormwillpass thanks for putting this together. Looks like a ton of work. Appreciate your efforts.", "score": 2, "replies": []}, {"body": "Update on u/TheTriviaTribe: [looks like he fell victim to his own autism.](https://imgur.com/a/MBlKLiz) Dude’s back to hustling with gift cards.", "score": 2, "replies": [{"body": "LOL. I haven’t been trading, but maybe 2020 will call my name again. And psh. Don’t hate. 🤣", "score": 2, "replies": [{"body": "No hate fellow autist, it’s the circle of life.", "score": 1, "replies": []}]}]}, {"body": "I made it Mom!", "score": 2, "replies": []}, {"body": "Why are the winners hidden as \"spoilers\"? Anyone know how to turn this off?", "score": 2, "replies": [{"body": "Yeah, I had to open my lap top.\n\nOf course, once on my laptop,\nI spent time (2hrs) micro managing my tickets for tomorrow instead of reading, then my back got sore. - back on the couch with reddit in-hand, I now realize **I can't click the links through the damned  spoilers lol!**\n\nCan't wait to see tomorrow.", "score": 1, "replies": []}]}, {"body": "It’s inaugural awards, no such thing as 1st annual.", "score": 2, "replies": []}, {"body": "What’s the best way to use options to make money?", "score": 2, "replies": []}, {"body": "I feel like “Sir, this is a Wendy’s” should be included in phrases of the year", "score": 2, "replies": [{"body": "That one is too widespread. It should be reserved for wsb phrases", "score": 4, "replies": [{"body": "Haha really I’ve only heard it on wsb I’m uncultured", "score": 1, "replies": []}]}]}, {"body": "How do I buy puts on /r/wsb?  Looking for expiry 06/30.", "score": 1, "replies": []}, {"body": "How can we not acknowledge ‘The Great Automod Gilding’?! That autistic tsunami consumed Reddit for a day and had me rolling.", "score": 1, "replies": []}, {"body": "I wanna mod", "score": 1, "replies": []}, {"body": "Goddamit i love this sub, can we start a brokerage?", "score": 1, "replies": []}, {"body": "My dude  u/carlcarbonite had the comment of the year.\n\n\"This is why all that technical line bullshit is bullshit. This dude thought he had a cup and handle or some shit but instead he got satans drill cock up his ass.\"\n\n(To the guy who lost $1500 and live streamed it)", "score": 1, "replies": [{"body": "⚠️♻️✅🥴", "score": 1, "replies": []}]}, {"body": "How about a meme stock of the year? Either based on number of mentions or most sorrow it caused. \n\nSome have been around for years, like TSLA and AMD, but 2019’s meme stonk of the year would have to be BYND.", "score": 1, "replies": []}, {"body": "Great post lmao. I know CTN won Live stream of the year and mention in phrases of the year, but \"GUH\" might be the hardest I have laughed at anything all year period. That fucking killed me.", "score": 1, "replies": []}, {"body": "I have started following this sub and it’s incredibly interesting but I am having trouble understanding what Calls and Puts are. Can someone link me to an easy explanation? I seem to understand that you are betting on the price going up or down, but how do you buy these options are you liable for the whole cost? A little confused. Thanks.", "score": 0, "replies": [{"body": "Investopedia.com", "score": 7, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}, {"body": "Robinhood. From your post, it sounds like you have more than enough knowledge and experience investing for Robinhood’s risk management to approve you for options. Start out small, like selling naked call options on ROKU", "score": 6, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}]}, {"body": "WTF is this? That is too much work having to click to see the spoiler. Add \"this is the way\" to phrase of the year next time.", "score": -13, "replies": []}]}
