{"title": "Gold mining stocks up 40% over the past year, outperforming SPY and still highly undervalued. Gold at $1563 an oz (up around 20% over the past year, 50% in the last 4 years).", "selftext": "40% is the average, but if you have your own picks of quality companies you’re up anywhere from 60-100%. The correction in gold is over and we are well on our way into the new bull market. The gold stocks don’t get much coverage, but they’ve been the best performing sector and will continue to do so. \n\nThe federal reserve has injected over 500 billion into the repo markets; if you take a look at a chart you can see spikes of green directly corresponding with the amount of liquidity injected. We’re well into QE 4, it’s laughable that the fed won’t call it that; but if they did they would be admitting to debt monetization. Who gives a fuck what they say, care about what they do. They flip flopped on monetary policy last winter, rates going back to 0. Its honestly fucked up how they teach monetary policy and inflation to children. Scumbags would rather see the stock market up in nominal terms, than actually do their jobs and not get involved. \n\nWe’re headed right into a currency crisis. Surprisingly gold has gone up before the drop in the dollar has even started; shows just how weak the dollar is, and how the risk premiums are starting to be built in. \n\nNow I don’t expect the public/general investors to hop into gold until it is well over $2000 an oz. Increasing demand has come from central banks globally, they’ve been buying large amounts of gold and selling off US treasuries. Some people will take advantage of this undervalued asset and buy while it’s cheap; most will be deterred from the stigma. \n\nA lot of people will get caught up in the passive investing scheme. General investors WILL ride this market all the way down. Out of greed they won’t sell, they’d rather lock up their money for years while waiting for it to come back.", "id": "en8qxz", "created_utc": 1578756599.0, "score": 273, "upvote_ratio": 0.85, "num_comments": 129, "comments": [{"body": "If goldbugs were right, the USD should already be worth less than the paper it’s printed on. Instead it’s still among the best performing currencies and inflation is right around where it should be. \n\nGold should be a small part of a portfolio and nothing more.", "score": 39, "replies": [{"body": "You are measuring the USD against other inflating and hyperinflating  currencies. The USD is the best horse in the glue factory. This does not mean it has a long, vibrant life ahead of it.", "score": 7, "replies": [{"body": "It also doesn’t mean that it doesn’t. The world runs on fiat currency and that’s unlikely to change anytime soon.", "score": 10, "replies": [{"body": "That doesn’t make it a good store of value", "score": 1, "replies": [{"body": "Nobody is saying holding cash under your mattress is a good store of value.", "score": 3, "replies": []}]}]}]}, {"body": "Yeah some 4% of a portfolio should be allocated to gold. Not enough to ruin u when it goes south but enough to make something decent if it spikes", "score": 1, "replies": []}, {"body": "fiat USD vs other fiats, USD will be worth more since it's the reserve currency and the whole world's also printing money.\n\nUSD vs Gold and Gold vs other fiats, you'll see gold is gaining value vs fiats.", "score": 1, "replies": []}]}, {"body": "Good gold miners are overvalued in my opinion. You should have bought them in 2018. Not now that everyone is into gold.\nAt least that how I see gold miners atm.\nHowever a lot of other commodities are low, and a lot of miners are undervalued. So there are opportunities there.", "score": 61, "replies": [{"body": "How are we defining undervalued? Like mining companies trading well below their NAV? Seems like it should be pretty easy to do (assuming you're confident about which way gold prices will go....)", "score": 5, "replies": []}, {"body": "I’ve been in them for over a year personally. But other people should have hopped in during 2018 yes. There’s so cheap still, especially compared to what the gold price will be and how that will effect their earnings.", "score": 8, "replies": [{"body": "> especially compared to what the gold price will be\n\nYou got next week’s lottery numbers too?", "score": 17, "replies": [{"body": "No, but he has last week’s!!", "score": 9, "replies": []}]}, {"body": "What are good gold miner stocks?", "score": 4, "replies": [{"body": "Barrick Gold for me.", "score": 6, "replies": []}, {"body": "KL is the best imo. Other good ones are AEM, NEM, etc.", "score": 2, "replies": [{"body": "How do these companies like these perform when an economic crisis breaks out?", "score": 1, "replies": [{"body": "When gold goes up they go up more. So I would say very well, considering gold is a hedge against inflation and viewed as a safe haven.", "score": 6, "replies": []}]}]}, {"body": "I’m really loving gold streaming companies. I bought into SAND a few years ago at $2.60, now 6.89. This past summer I started buying into MTA at $0.60, kicking myself for not buying more. Since then They had a reverse split and got listed on the NYSE this past week. I’ve more than doubled my money just wish I trusted my gut and put more in. I’ll be adding more, possibly adding some options.", "score": 1, "replies": [{"body": "> I’m really loving gold streaming companies.\n\nStreaming companies are the least risky way to play. A 10 year chart for FNV Franco Nevada  makes Berkshire Hathaway look like a failure.", "score": 1, "replies": []}]}]}, {"body": "what are the symbols?", "score": 4, "replies": [{"body": "I really recommend KL at this point. 800 million in cash, 0 debt, increasing production yoy, increasing gold reserves through M&A. \n\nSome people might consider NEM, they just increased their dividend by 80% to a dollar per share. But I think Kirkland lake has so much more growth there.", "score": 13, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Why do you think I didn’t buy the gold miners until last year? I knew the general tards that live in the US wouldn’t be smart enough to realize what the federal reserve is doing. I knew they would fall for the sham of debt monetization. Instead of facing with the recession in 08, we reinflated the bubbles until now. Which has made the underlying problems so much worse. Over the last decade we’ve been stuck at sub trend growth around 2%. Since we haven’t been able to grow at 4-5% annually, we have left over 5 trillion dollars on the table. That money is gone forever. \n\nWe’re going to see inflation start to spike soon, even if you track it using the government CPI. Best thing to do is let the government run wild with spending and QE and laugh while you own gold as the dollar tanks. The mining stocks are forward looking, they’ve been beaten down over the years due to the low gold price. Which made them a great buy for me personally. It’s a horrible business to be in if you pick a company with poor management and bad mining jurisdictions. I only invest in companies whose mines aren’t at risk from government intervention. Typically USA, Canada, and a couple of European nations. There’s just so much upside compared to so little downside when comparing gold to the S&P; which is at all time market highs and way overvalued.", "score": -10, "replies": [{"body": "Not to mention all the extra trillions of USD chaseing the same safe heaven assets when things goes South. \n \n87% on CNL\n46% on FNV \n49% on SNL\n10% on FNV\n7% on SILV\n-20% on AUX\nMag silver and metalla -3/4% that i bought last week.\n\nLooking forward i am quite happy with my position in the PM stocks.", "score": 3, "replies": [{"body": "Good that’s great, glad to hear you got in. Some of my favorite picks depending on how risky you want to get is NUGT. But I highly recommend KL, there’s big upside in EGO if you’re patient. I also have some MTA. Honestly the GDX is decent too. FNV looks good, never pulled the trigger on it because I had more upside in KL.", "score": 3, "replies": []}]}]}]}, {"body": "> I really recommend KL at this point. 800 million in cash, 0 debt, increasing production yoy, increasing gold reserves through M&A.\n\nWouldn't you want to be increasing reserves a cheaper way (like through exploration?) rather than doing it the expensive way through M&A? Sorry, I work in upstream E&P valuation/finance, so I assume the valuation methodology for gold companies is strikingly similar in terms of fundamentals.", "score": 1, "replies": [{"body": "At these lower gold prices, it’s more favorable to buy and get exactly what you’re looking for. With KL they needed more gold reserves for the long term. I think they’re buying out detour gold, it will increase their mine life and reserves greatly. I wouldn’t be surprised to see them buy a couple of mining companies and start increasing their dividend greatly.", "score": 1, "replies": []}]}, {"body": "MMX\nMaverix Metals is an interesting one too.", "score": 1, "replies": []}]}, {"body": "GDX", "score": 1, "replies": []}, {"body": "Mentioned it to some in comments above", "score": 1, "replies": []}]}]}, {"body": "My view: market quite good for royalty/streaming companies, barely warm for majors and barely a pulse for juniors.\n\nIf not for Eric Sprott dispersing $150 plus  million worth for funding into the junior exploration sector, it would be a devastated market.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 72, "replies": [{"body": "Can buy gold miners", "score": 4, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I actually said gold mining stocks are up 40% in under a year. Gold the metal itself is up around 20-25% in under a year. The mining stocks are up more because they offer more leverage due to them being forward looking. They’ll typically go up double what gold does. \n\nI threw in gold up 50% in 5 years because we bottomed out around 1050 in 2016. Now we’re at 1560+. I just threw that in as a fun fact, but it also shows that this is the start of the next bull market. We were expecting a 50% retrace after it hit $2000, and then a 50% bounce back into the next bull market. I don’t feel like typing out the history of gold, in fastest terms possible; we were in a correction for the last decade and now gold will climb back up and well over $2000.", "score": 5, "replies": [{"body": ">\tI threw in gold up 50% in 5 years because we bottomed out around 1050 in 2016. Now we’re at 1560+. I just threw that in as a fun fact, but it also shows that this is the start of the next bull market.\n\nAnd SPY is up 60% over the same timeframe. So we must be starting a bull market there too, right?", "score": 9, "replies": [{"body": "The third great gold bull market, which began Dec. 16, 2015 with gold at $1,050 per ounce. Prior bulls were 1971-1980 & 1999-2011. Retraced down 50% from 2011-2015, and is now back up 50% and starting the new bull market. Based off of the weakness in the dollar, trillion dollar deficits, below trend growth avg 2% over a decade. Hold your SPY and ride it all the way down. I’ll take the gold thanks.", "score": 4, "replies": [{"body": "You do you and I’ll do me. Care to share your returns over the past five years? \n\nWeakness in the dollar, deficits...haven’t heard that for the last 20 years and counting 😂\n\nJust to be clear, I think SPY is overvalued. I’m merely pointing out your ridiculously flawed logic in how you determine that gold is just starting a bull market. There are several strong value plays in the market that I’m very confident will outperform gold over the coming years. \n\nhttps://i.imgur.com/unYGU6T.jpg", "score": 3, "replies": [{"body": "First of all those things do matter. Second of all since the fed flopped on monetary policy and started QE 4, they waived the white flag and showed everyone that they are monetizing the debt. You know what’s fucked up, I’ve made 80-100% in under a year (let alone combing 5). Look it’s not a competition I don’t want to be mean.", "score": 6, "replies": [{"body": "I’m up 135% in the last year, over 350% in the last 5 years and over 700% in the last six. Do the math from the pic I attached. I know what I’m doing. \n\nWhat the Fed has proven is that they will support the market at almost any cost. I don’t agree with the policy but that’s what their actions show. You may be right that one day it will all unravel, but it may not be in our lifetime , or it may be after the market has doubled from here. \n\nGold is appropriate as a portion of a portfolio, to protect against such downside. To be all in gold pretending to know when things are going to unravel is stupid, and gold bugs have been trying to do it unsuccessfully for decades. Good luck.", "score": 1, "replies": [{"body": ">I’m up 135% in the last year, over 350% in the last 5 years and over 700% in the last six. \n\nCare to share what were your holdings that got you 700% in 6 years. I have been holding VTSAX and barely made 40%.", "score": 1, "replies": []}, {"body": "You too man. Are you doing options or just stocks? I definitely think we’re going to see passive management be less favorable than active management in the next downturn, as well as the decade. \nPassive management has had its time to shine over the last 10 years. With 4 trillion in stimulus, you would have to be a stone cold retard to pick a losing stock. Basically everything went up. Everyone just funneling money into the same Vanguard SPY etc. It’ll bite them in the ass when they can’t sell. Since everyone has gotten memory holed, they can’t remember what happened in past downturns. They have frozen the market before, and what ends up happening is those big banks sell all their shares when everything is going tits up, and you don’t even have the chance to sell because your account is frozen. They’ve done the same loony shit when they closed the banks for a week, and nobody could get any money. \nWhat cracks me up is how invulnerable people think the US is. Tons of countries in recent years have frozen bank accounts and also limited how much $ you can withdraw, if they let you withdraw. Hell people were getting on planes, flying to a nearby country, filling up their suitcase with cash, and flying back home. Random rant tbh but it’s been fun", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Who's saying this has to be long term? Am I in /r/investing? Fact is gold is trending strongly right now and you can capitalize off that, nothing more needs to be said really.", "score": -1, "replies": []}, {"body": "The purpose of gold isn't too outperform stocks, but to outperform cash (which it does).", "score": 0, "replies": []}, {"body": "> A productive asset will easily outperform a non productive asset such as gold over the long term. It's not even close.\n\nAbout 40% of these Wall Street productive assets are money losers. Just wait until a recession comes. Just wait until AOC or Bernie Saunders become president.", "score": -7, "replies": [{"body": "Dude he's talking about physical productive assets like electric companies, agriculture, livestock, etc. Not spooky evil financial assets that are built on a house of lies built by the underground lizard people living in the hollow flat earth beneath us.", "score": 7, "replies": []}]}, {"body": "Did you really miss the entire point? You buy gold to keep your purchasing power, as well as profit off of it at these prices. \n\nI’m not sure why you brought up anything about “productive assets”. Gold is a form of currency, and so are dollars. The difference is you’re going to want to decrease your cash reserves and increase your gold reserves. No real reason to buy bonds or hold cash since you’re getting near 0% interest. At most you’re making under 2% which is under inflation, a money losing bond and dollar. You basically need to make 2% a year to break even with your purchasing power, but most people don’t know about this hidden “tax”. \n\nIf you want a productive asset in gold you buy a gold mining stock buddy. Which also offers more leverage.", "score": -23, "replies": [{"body": "Why are you comparing gold to cash and not equities? This board is about stocks, not cash.", "score": 7, "replies": [{"body": "You can connect some dots on your own buddy. If gold goes up, so will gold stocks. Gold stocks over the next decade > S&P over the next decade. But I bring up the dollar because the value of the dollar is the main driver is gold price, not whatever our stock market is doing.", "score": -17, "replies": [{"body": ">\tGold stocks over the next decade > S&P over the next decade.\n\nPossible. But I’m not an index investor. I outperform the market in the long term. My picks > gold stocks over the next 10 years.", "score": -2, "replies": [{"body": "I’m not an index investor either, I pick the best performing ones. It’s just a sector that’s going to do great, but if you pick the real winners you’ll do amazing.", "score": -3, "replies": []}]}]}]}, {"body": "Gold is a terrible investment, and has been for ages. \n\nGold doesn't pay dividends. You often have to pay some kind of a storage fee if you own gold, and your gold can be stolen. And good luck getting anything close to fair value for your gold if you try to walk into a business and sell it.\n\nGold is a terrible inflation hedge to, especially when the economy is doing fine. \n\nThis article explains things far better then I could: https://www.doughroller.net/investing/6-reasons-gold-is-a-terrible-investment/", "score": 12, "replies": [{"body": "Gold went up 650% from 2001 to 2011. SPY returned -2.5% during that same period. It has taken SPY 26 years to return 650%. \n\nClearly gold can be a good investment. Of course productive assets will outperform in the long run, but not every investment needs to be for the long run.", "score": 1, "replies": [{"body": "nice cherrypicking, wanna compare 2009 to 2019?", "score": 0, "replies": [{"body": "When trades aren't long term you can cherrypick all you want... that's the point of a short term trade, to cherrypick exposure. Read the last sentence of my last comment again.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Which mining companies are you referring to? At a cursory glance, I'm not seeing any gold mining companies anywhere near 40% growth over the course of 1 year.", "score": 6, "replies": [{"body": "GDX", "score": 1, "replies": []}, {"body": "RISE", "score": 1, "replies": []}]}, {"body": ">We’re well into QE 4, it’s laughable that the fed won’t call it that\n\nIt's not laughable, it's rational. Pow Pow doesn't want to call it that because QE is synonymous with \"bailing out the banks/helping the rich\".", "score": 5, "replies": [{"body": "Yeah they’re lying to you. Do you want daddy to baby you? If we’re all adults here call it like it is, it’s debt monetization. It’s rational from what point of view? Do you think it’s rational to risk sending us into hyperinflation? I know daddy Jerome will lie to us on tv because he wants to stretch the market out until the election. But they’re going to tank the currency in the end, and it’s not going to be so “rational” when a majority of us are poor. Then you have to deal with poor people crime.", "score": -7, "replies": [{"body": "Lol, cute story. And yes, if we *were* all adults it wouldn't have to be called a \"technical operation\" for the sake of optics..", "score": 4, "replies": []}, {"body": "Shh, you're scaring the children dear", "score": -1, "replies": [{"body": "Hahaha", "score": -2, "replies": []}]}]}]}, {"body": " This sector is still in recovery mode after a devastating 8 years . There are still juniors out there trading for less than the cash they have  in the bank.\n\nMaybe not the bottom, but close.", "score": 3, "replies": [{"body": "Yup, it’s a bargain at these prices.", "score": 0, "replies": [{"body": "> Yup, it’s a bargain at these prices.\n\nThe junior exploration stocks are where the major returns will be made when this market finally turns--and it has not turned yet--maybe starting to turn though. In a hot market, most of them would be trading at 5 times plus  their present valuations.", "score": 2, "replies": [{"body": "Yeah, their earnings will go from losing or breaking even to tripling their earnings.", "score": 1, "replies": []}]}]}]}, {"body": "My favourite tagline about gold is its \"perceived\" safety.", "score": 3, "replies": [{"body": "Safer than fiat currency, can't print more gold and devalue it", "score": 1, "replies": [{"body": "Fiat currency is worth whatever people can buy with it, and is backed by the value of goods in a country that produces the currency. Gold is worth whatever the market’s emotion is at the moment. Not necessarily a better situation.", "score": 3, "replies": []}, {"body": "Okay, but why would you buy gold over Cobalt or lithium?", "score": 2, "replies": [{"body": "Never said you wouldn't", "score": 1, "replies": []}]}]}]}, {"body": "Are you Peter Schiff?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "No positions on oil. I have a large position in KL, and NUGT (I like the leverage in NUGT). NUGT isn’t the safest and I recommend the actual mining companies themselves, but since I think money is going to flow into the GDX I stay in my position. I also really like gold bullion, the fact that no one can “freeze your account” or take away that purchasing power is a great form of insurance to me. % wise most people recommend 10% but I’m well over that. You still need cash of course, cash offers great optionality. Especially when everyone’s accounts blow up and they’re forced to sell quality assets, due to how over-leveraged they are in bad ones. \n\nPeople talk about diversifying their portfolio by investing in different sectors through stocks. In reality tons of people have a majority of their net worth % wise in the stock market. That’s not diversification. Diversification is having a cash position, buildings or land (not homes, a house is a liability and a money pit), bonds, stocks, gold, etc.\n\nI also like silver as an investment, % wise it’ll probably outperform gold; as it has every gold bull market. It’s good to have some silver on hand, it’s easier if you ever need to buy smaller things.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Probably AG and PAAS.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Well you just have to look at the current situation we’re in. The bottom didn’t drop out of the dollar before because the fed was able to sell the lie that this expansion in their balance sheet was a temporary measure. The federal reserve expanded their balance sheet from 800 billion to 4+ trillion. Fast forward a couple years, they start QT and start to raise rates. Since I knew the federal reserve would not act independent, i knew they would run in to save the stock market at any chance. Gold is at 1200 around summer time. Then a couple of months later during last December the fed hiked to 2.5% and it was too much for the market to handle. The market pulled back like 5%, which isn’t even that much (just shows you how worried they are), and the fed comes out and says they’re cutting rates. They’re calling this a “mid-course adjustment” acting like they’re going to go back to raising rates soon. Over the last couple of months the fed restarted QE 4, more stimulus for a market at all time highs. The balance sheet has expanded by half a trillion and will continue to grow. Inflation by definition is the expansion of the money supply. So If we’re going to go off of that, the realistic inflation rate is 7%. \n\nSo now the fed is stuck. Rates will be at 0 soon and the fed will have no “monetary ammo” to get us out of the next recession. You typically need 4-5% of rate cuts during a recession to lift the economy out of it. Without the stimulus of the rate cuts the fed can only do one other thing, and that’s print money. The fed will either be forced to raise rates during a recession or send us into stagflation (high unemployment and inflation). The loss of confidence in a currency is one that’s very hard to gain back. Hyperinflation and economics are also a psychological phenomena. \n\nIf we have trillion dollar deficits now, imagine during the recession, it’ll be 2-3 trillion in the midst of it. Save some of your purchasing power in gold as the government either defaults on the debt or prints way more money to pay off the debt. \n\nWe’ve seen big moves towards dedollarization. China and Russia have been dumping T bills and buying gold. Globally, central banks have also been stocking up on gold. \n\nI’m too tired to keep typing but If you have any questions lmk", "score": 6, "replies": [{"body": "I don't think we will see stagflation. The USD will be in high and increasing demand as worsening global environmental crises drive foreign reserves to the Fed. While the US will be printing mega bucks for the forseeable future, I can imagine the demand for said $ will be high both domestically and abroad. \n\nI think there will be a market crash sparked by the election of a far-left Democrat in 2024, or due to natural occurrences between then and 2028 should that not happen (perhaps it could even be delayed til 2029+ with the most irresponsible of fiscal measures). \n\nAt least for the next year or two, I think the Fed is going to keep printing money and the markets are going to respond bigly. Like, S&P 2-3X current levels come 2024. The impending hyperinflation is going to hit assets, not consumer goods.", "score": 1, "replies": [{"body": "What you said in your first paragraph is what already happened between 2008 and 2020. Since the fed lied about temporarily increasing their balance sheet and that they would eventually taper in down, people hopped into the dollar. I think trump will probably will win, but I don’t think the market has priced in how real of a chance Bernie Sanders has if he runs against trump. The republicans and democrats are both socialists, they both buy your votes, and they both lie and piss our money down the drain. \nAll of the inflation from the ~4 trillion dollars printed has already gone into the stock market. There’s no denying it, we went from dow 16,000 in 2016 to 29,000 in 2020. If you ask me, that’s pretty fucking retarded to see over a 10,000 point gain in under 2 years of poor economic performance. \nAfter the market tanks all of the inflation, coupled with the reverse wealth effect, will hit consumer goods. Hell it already has. You don’t need to listen to the government lying to you about its arbitrary handpicked basket of goods in the government CPI. Just look at the prices at the grocery store, school, healthcare, restaurants, etc.", "score": 2, "replies": []}]}]}]}, {"body": "Gold stream stocks are always valued stocks in any economic cycle. Gold and precious metals are always good as cushion or investment.", "score": 1, "replies": []}, {"body": "GOLD like spdr bar etc... Invest in gold and silver  fck bonds", "score": 1, "replies": []}, {"body": "1650 at least", "score": 1, "replies": []}, {"body": "id like to see your numbers compared against the SP500 or Dow personally. Don’t pretend like there haven’t been insane gains there in the last 5 years.", "score": 1, "replies": [{"body": "Nobody said there weren’t insane gains in the last 2 years. Last 5 was meh, but sure. Have you sold? Or are you going to be like everyone else and ride it all the way back down? Most will just hold SPY and never touch it. It’ll be fun to look at a chart over the next 5 years and compare gold and gold stocks to the Dow.", "score": 1, "replies": []}]}, {"body": "Literally every asset class has put preformed gold in long term, no amount of gold fan boys pumping up it up will convince me to hold more than 4% at any given time in my portfolio", "score": 1, "replies": [{"body": "I don’t think you get the reasoning behind buying it right now at this exact moment in time. But I understand being hesitant towards it. Depends on your risk tolerance, I think it’s going to be the safest asset class; as well as, the best performing in our near future. Who tf knows though, we’ve never done anything like this in monetary policy before. All I know is I’m not trying to get completely robbed of my purchasing power. Some people worry about that some don’t, just don’t hold only cash and stocks. Cash has the best optionality, 10% gold is preferred. Real estate should be a great buy after the crash, I think you’re going to see a real trend of people moving towards hard assets.", "score": 1, "replies": [{"body": "I personally dont think there is going to be a crash, this imminent recession a lot of people are talking about is being prepared for too much. 2008 was a shock, so was the tech bubble and the 87 crash this one is the one everyone is expecting I think the can is going to be kicked down the road for a lot longer yet", "score": 1, "replies": [{"body": "The federal reserve artificially setting interest rates (which they have no right to do, but it happens anyway) and printing money has caused all of those crashes. The crashes will continuously get worse and worse. It’s pretty funny, not thinking that this bubble is going to burst. It would be like me telling you the bubble in 2001 had no chance of popping. Except in this stock market mania we have surpassed the delusional highs of 2001; relative to debt cost vs gdp growth, were in very dangerous territory (over 100%). Of course I expect people not to see it, and then they’ll all kick each other in the ass later.", "score": 2, "replies": [{"body": "Thats your opinion mate, I have been hearing in Australia were I live that we have been in a property bubble since 2012, people have been actively calling a crash since. All I'm saying is no one can definitely know when or if a crash will come till I see more weakness in jobs and growth I;m all in on the bull train making gains", "score": 1, "replies": []}]}]}]}]}, {"body": "What does this mean for my week out options on JNUG?", "score": 1, "replies": []}, {"body": "Sounds like you've been listening to a little too much Peter Schiff...", "score": 1, "replies": []}, {"body": "Why would anyone invest in this business? The mining industry is just an open sewer where pimps and thieves run free and shareholders die like dogs. And there's a downside.", "score": 1, "replies": []}, {"body": "Yet (at least the major) gold mining companies are either losing money or making very little per share. I wonder if the rise in stock price is because people THINK that the rising price of gold SHOULD make these companies profitable, even though in actuality they are not doing very well. Partially asking because I looked into gold mining companies some months ago and was unimpressed, but obviously I was at least partially wrong since their share price is rising.", "score": 1, "replies": [{"body": "That’s the whole point. When you’re buying stocks you’re looking for earnings growth. The more they double and triple their earnings the higher the stock goes. When gold was at 1200 an oz most companies were breaking even, some lose, some make. The point is you want to buy those companies when they’re breaking even or losing (if you think gold is about to higher). What ends up happening is for every 100 dollars rise in the price of gold, the miners get a massive % gain in their earnings. After $1200 it’s all profit. That’s why you see such a big gain in their share prices.", "score": 1, "replies": [{"body": "But who has actually shown profits? Stocks are also sometimes a popularity contest rather than a scale.", "score": 1, "replies": [{"body": "Tons of companies have shown profits, what do you mean? KL is my personal favorite, but there’s AEM, NEM, IAG, EGO, FNV, etc. Theres tons of gold miners that are profiting off of gold. Some have AISC of around $900, others $600.", "score": 1, "replies": [{"body": "\"Tons\" seems like hyperbole. Looks like Kl has been modestly profitable recently, with a p/e 41. AEM -1.07 eps; NEM does make money (curious what is different about it); IAG small loss per share;EGO -1.44 eps; FNB 89 p/e.\n\nPerhaps rising gold prices is improving this, but when you start out in a pretty poor position you have a long way to go. I'm not an expert in gold/gold mining at all but from a normal stocks perspective there look to be a lot of question marks.", "score": 1, "replies": [{"body": "Well I bought at the lows so I have nowhere to go but up. It’s been very lucrative. The main thing that matters is gold price. At $1600 an oz they’re all profitable. But when we’re back over $2000+, those share are going to be flying up. I expect great returns mainly through the stock price going higher, but as a bonus I think the dividends these companies are offering will be steadily increasing. We’ve already seen it with KL, and more recently NEM with a 80% dividend increase to a dollar per share.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "waiting on the shit post brother", "score": 1, "replies": []}, {"body": "The fed has printed 400 billion of repo market liquidity in the last few months. Assuming there is about 12 trillion USD floating around, the US just injected \\~3% of inflation in 3 months that has not hit main street yet. At $1550/oz gold is undervalued by at least 3% in my opinion. I think gold will float around 1600-1650 over the next few months.", "score": 1, "replies": [{"body": "The fed is actually printing money at a faster rate right now than they did in the midst of the 2008 crisis. At 500 billion printed, the balance sheet is back over 4.5 trillion. Over the last decade the US added 11 trillion in debt while growing gdp by only 7 trillion; for every dollar of growth, added over 1.5 dollars of debt.", "score": 1, "replies": []}]}, {"body": "We're waiting... It's been days...", "score": 1, "replies": [{"body": "For what? What are you waiting for? Only some retard who thinks this happens overnight would comment that. This is long term investment plan. Not your 1-2 year crap.", "score": 1, "replies": []}]}, {"body": "Well looks like OP having to defend his post eorked out considerably well for him. Im also in gold so reading back on this makes me laugh. All of the people who think they understand Economics makes me laugh.", "score": 1, "replies": []}, {"body": "I’m just happy I bought gold a year ago", "score": 1, "replies": [{"body": "Yessir, it’s a great feeling.", "score": 2, "replies": [{"body": "So what do you recommend buying now then? Is there a gold producers etf?", "score": 1, "replies": [{"body": "There’s a couple investments that I like. Gold bullion is always good to have on hand. ETF wise you can invest in the GDX, GDXJ. Now if you want to make a risky trade but have tons of upside you might go into NUGT or JNUG. These are triple leveraged etfs that naturally decay. It’s based off of the GDX And GDXJ. For example GDX up 3%, NUGT up 9%. Very risky but if you think money is going to flow into the miners, it’s very lucrative. \nIndividual companies that I like are KL (by far my favorite), AEM, NEM, FNV. \nIf you want some risk and some major upside EGO is decent.", "score": 2, "replies": [{"body": "Awesome thanks I’ll look into it", "score": 1, "replies": []}]}]}]}]}, {"body": "I agree.\n\nEdited to add a prediction: Gold will make a new ATH in USD terms this year.\n\nRemindMe! 8 months", "score": 1, "replies": [{"body": "There’s a chance that could happen. I was thinking 1700 by election time.", "score": 2, "replies": [{"body": "Listen for the term ‘force majeur’ in the next 12 months.", "score": 1, "replies": []}]}, {"body": "There is a 3.1 hour delay fetching comments.\n\nI will be messaging you in 8 months on [**2020-09-11 23:27:00 UTC**](http://www.wolframalpha.com/input/?i=2020-09-11%2023:27:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/en8qxz/gold_mining_stocks_up_40_over_the_past_year/fdyzmpu/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fen8qxz%2Fgold_mining_stocks_up_40_over_the_past_year%2Ffdyzmpu%2F%5D%0A%0ARemindMe%21%202020-09-11%2023%3A27%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20en8qxz)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "RemindMe! 12 months", "score": 1, "replies": []}]}, {"body": "Please correct me if I'm wrong, but investing in gold at any time is rewardable?", "score": 0, "replies": [{"body": "Not really esp it was $1900 before, don't jump on it, 0.2% of a portfolio is enough to invest in it. No one can foretell a recession.", "score": 1, "replies": []}, {"body": "Very rewardable, idk if people realize that gold was $300 an oz back in 2000. It then went up to $2000 and is now on track to break that high.", "score": 1, "replies": []}]}, {"body": "Why are we even debating the merits of \"investing\" in gold? This is obviously a gold-shill post.", "score": 0, "replies": [{"body": "Go buy more vanguard etfs little boy.", "score": 1, "replies": []}]}, {"body": "Um, you're trying to market gold and gold mining with inflammatory statements about the FED. Anyone who actually knows what the repo market is, isn't going to get caught up in your bs about \"guvmint\", or conspiracy theories about how fiat currencies are \"just paper\".\n\nTry to pay for your groceries with worthless gold. It's just not going to work. Why not be honest and run your sales pitch like \"are you a paranoid person whose afraid of the future, but also think you'd be king of the hill in a Mad Max world? Well have I got a deal for YOU! We all know gold bricks are a versatile weapon when swung in a bag like a slock, but did you know that most of the gold is stashed away in bunkers owned by bankers and corporate overlords? Our totally innocent commune of cruelty free gold liberators are looking for humble patrons with good homes for newborn bricks. However, at adolescence gold bricks go through private school, get refined, and start going on and on about their purity and superiority. This makes them too dangerous to keep in your house, so you need a professional banker or corporate overlord to rent you some space in their fortified bunkers. Don't worry, when the Mad Max world manifests (and it definitely will because money is made from linen and cats have fur on the outside)... when the apocalypse comes you'll definitely be able to just walk right up to the armed guards in front of the easily identifiable bunker where your specific gold bricks are held, and collect your extremely valuable weapons (socks and pillow cases sold separately) no problemo!\"", "score": -11, "replies": [{"body": "> worthless gold. \n\nIt is a shame that after 30 plus centuries, some people still have not learned.", "score": 1, "replies": [{"body": "By your logic, drinking yourself to death or hoarding newspapers is a good idea, since people have been doing it for centuries.", "score": 1, "replies": [{"body": "Gold has kept value all that time.", "score": 1, "replies": []}]}, {"body": "Yeah well 30 centuries is only a 120 people ago so..", "score": 1, "replies": []}]}, {"body": "Not only did I not read any of this but you are example #1 of how to be ignorant in history. Yeah you mean how the repo rates shot up to 10% over night and the fed had to come in and save everyone’s ass with half a trillion in liquidity? Yes I do remember that happening. And nobody said get rid of all your dollars Nancy, you fucking cancer cell of a human, learn to diversify your shit debt note like the rest of us. At least we know we’re holding a private company’s liability note, it’s not even from the US treasury. It’s laughable, our government doesn’t print its own money because it was worried about it interfering with monetary policy based on what the stock market is doing. Guess what you dumb hick, it’s happening anyways. The point is not to keep all of your purchasing power in one basket. That means real estate, dollars, stocks, gold, etc. You’d have to be a retard who went to a public college and studied finance from a McGraw hill book to hold only dollars and stocks.", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Oh gee. You should invest in canned goods. When the economy collapses and businesses fail because there's no credit left, you won't be able to get food. You can then sell the food for waaaaaaaay more gold than you can afford now.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Speaking from decades of experience as an electronics engineer, you don't know what you're talking about. Cobalt is actually a scarce resource with properties that are currently difficult to replace in modern electronics. Gold is easily replaced. Also, the amounts of gold used in electronics is so miniscule that it doesn't affect the price. That's why you don't see price spikes based on demands for electronic goods.", "score": 1, "replies": []}]}]}]}
{"title": "$TSLA Daily Investor Discussion - January 11, 2020", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "en5ad1", "created_utc": 1578733866.0, "score": 18, "upvote_ratio": 1.0, "num_comments": 145, "comments": [{"body": "[deleted]", "score": 28, "replies": [{"body": "😂\n\nI bought stock on Wednesday, first time I buy stock of anything, first thing it did was to go down. Can't wait for Monday!!", "score": 11, "replies": [{"body": "Cost average, if you can! I'm planning on buying more next week myself :)", "score": 2, "replies": [{"body": "Haha, it's an option, but I do not think I'm comfortable with buying any more. I wanted to make a token investment with money that I won't miss if I lose. Also, I have a  rule of \"never get greedy\" with  this things (works well in casinos, when you're winning, show restraint).", "score": 4, "replies": []}]}]}]}, {"body": "Funny experience today.  Walked out of the supermarket to see an E-Tron hooked up to the charger, hood popped up, father and son fidgeting with the cable.\n\nAfter loading my trunk with our groceries, they’re still messing around with that cable, so I go ask if they need some help.  Turns out the charging cable remained locked at the charger-end and they can’t remove it.  I told them that it should normally just unlock as soon as the car unlocks its part.  We tried reconnecting the car, and unlocking it but it didn’t work.\n\nI offered to park my car next to them, and to plug their cable into mine so I could unlock it from my car to see if the problem was with the car or the charger (i assumed it was the charger, but wanted to rule out it was the car).  \n\nWhen I unlocked the charging port, the other end unlocked as well.  The son, in a tone that only a 14-year old kid can master, says “See dad, I told you you should’ve gotten a Tesla” 😅\n\nI have no idea why it didn’t unlock properly from the e-tron.  The owner said he hadn’t had any problems with his home charger, and I kinda doubt that this is a common issue but it was definitely weird.\n\nBefore I left I asked him if he was happy with the car, and he immediately said “well... the range is terrible.  The interior is really nice and all. But the range is terrible”.\n\nHe asked me about my range and when I said I routinely get between 440 and 490km out of it, his jaw dropped and his son again went “See?!”.\n\nAt least he’s happy with his interior 🤷‍♂️", "score": 63, "replies": [{"body": "You know what I call other electric vehicle owners?\n\nFuture Tesla owners.", "score": 26, "replies": [{"body": "Haha, for some of them: sure.\n\nBut I have no doubt that there will always be a group of people who want their typical Audi/BMW/Merc/Porsche interiors.  It’s not for me, it might not be for you either, but you can’t blame people for thinking the same thing about our Tesla interiors.", "score": 4, "replies": [{"body": "Oh for sure. But I’m willing to bet there are a lot of volt and leaf owners who will make the jump to a model 3 for their next car. Similarly with the I-pace and étron.", "score": 3, "replies": [{"body": "I’m also yet to meet a kid that doesn’t think Tesla’s are the coolest cars ever. (Also future buyers)", "score": 3, "replies": []}]}]}]}, {"body": "lmao this is like something out of a movie", "score": 6, "replies": [{"body": "Sounds like a boring movie though 😅", "score": 3, "replies": [{"body": "No its like a set up scene in the beginning", "score": 1, "replies": []}]}, {"body": "Or a Tesla advert if they did them :)", "score": 3, "replies": []}]}, {"body": "Did the manual release not work?", "score": 2, "replies": []}, {"body": "This is actually a very common problem with the E-tron. This is [an e-tron road trip gone horribly wrong](https://www.audiworld.com/forums/audi-e-tron-232/locked-charge-port-door-solution-another-terrible-holiday-trip-failure-audi-ea-2984096/) due to charging cable getting stuck issues from AudiWorld forum.\n\nThere's a whole host of issues with the e-tron as described in [this TMC post](https://teslamotorsclub.com/tmc/posts/4292600/).", "score": 3, "replies": []}, {"body": "Gonna be a bit of a devils advocate here and say two things:  \n1. Don't underestimate the ability of interiors to sell cars.  \n2. Do not forget that this is the other automaker's first attempt to serious EVs. Mistakes will happen, some will learn, the others will go bankrupt.  \nNotice here that Tesla will not remain static, they can offer better interiors (it's not rocket science) and they can improve in other issues they have.", "score": 1, "replies": [{"body": "Agreed. I am not happy with Tesla's quality or amenities. Has me thinking of switching ...I won't but always makes you think what you can really get for 70k when you sit in a Benz or Audi.", "score": 1, "replies": []}]}]}, {"body": "Good news in China just keeps coming: https://twitter.com/KelvinYang7/status/1215964820467527681?s=20", "score": 17, "replies": [{"body": "I'm confused by this?", "score": 0, "replies": [{"body": "Subsidies prolonged for at least another half year.", "score": 7, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "They should just start a pollution tax.  Problem solved and in the best way.", "score": 2, "replies": []}]}, {"body": "I was reading it the opposite. Thanks for the clarification", "score": 1, "replies": []}, {"body": "They mean july 2021 right?", "score": 1, "replies": []}]}]}]}, {"body": "Started seeing more hydrogen car ad’s and articles over the last couple of days and have just seen this video with Elon’s take on them. I didn’t know much about them but it sounds  as though there are a significant amount of drawbacks including the complexity of getting the hydrogen initially, ability to get it on the road, overall efficiency, it’s very flammable and loads more. \n\n[It’s a good 2 minute video if anyone wants a quick overview](https://twitter.com/ajtourville/status/1215857105543946246?s=21)", "score": 15, "replies": [{"body": "Hydrogen infrastructure would need to be built out first before it can be a viable option. The difference with EVs is that your home is the “gas” station. Unlike EVs you can’t come home and top off every night with hydrogen vehicles.", "score": 12, "replies": [{"body": "Well, if gas stations get converted to hydrogen gas stations, then that is only a temporary problem. A permanent problem is the inefficiency of generating hydrogen (from electricity) and converting it back into electricity. While  processes are bound to improve, they are not close to the efficiencies of battery storage. \n\nA major advantage of hydrogen is that it can be stored in large quantities. That could be interesting for seasonal storage where plentiful and cheap summer electricity is stored as hydrogen for the winter.", "score": 2, "replies": []}]}, {"body": "Hydrogen is so dangerous it's not going to take off with consumers. It's a bad idea no matter how you look at it.", "score": 10, "replies": []}, {"body": "I had a quite juicy discussion on \"the other sub\" about viability of hydrogen.\n\n&nbsp;\n\nIf we can put a huge hydrogen tanks on top on the roofs of public transport, like buses, then we can make it more clean.\n\nBut, at the same time we need solve how to get such amount of hydrogen with as much help of renewable sources of energy as possible. Because if I am burning excessive amount of coal/gas to get that hydrogen, it completey defeats the purpose.  \nJust like it defeats the purpose to make a battery cells, if I spend more energy mining/extracting materials for them than the final energy output stored in those cells.\n\nFor example, I can see a montrous hydrogen tanks in container ships - that would curb the emissions like nothing else. Then again, we currently don't have the means to create such amount of hydrogen without emitting more emissions.\n\n&nbsp;\n\nMy point is, unless somebody is ready to blindside us with some absolutely nasty breakthrough that would allow us to make huge amounts of hydrogen with near to equal energy input, the whole discussion about hydrogen is pointless, and I am quite pissed that there are still articles in news about hydrogen viability. It is not. Not now. End of story.\n\n&nbsp;\n\nNinja edit: I am surprised nobody is thinking about putting solar panels on every single roof in the cities. Practically free energy that could offset a lot of other sources.", "score": 4, "replies": [{"body": "> If we can put a huge hydrogen tanks on top on the roofs of public transport, like buses\n\nMight as well give the terrorists free, already assembled bombs.", "score": 9, "replies": [{"body": "> Might as well give the terrorists free, already assembled bombs.\n\nIf anybody can lay hand on powerful weapons, then you have bigger problems to worry about.\n\n[Here, have a video about Mirai's hydrogen tank penetrated by 50-caliber bullet.](https://www.youtube.com/watch?v=jVeagFmmwA0)\n\n&nbsp;\n\nI just wish somebody would figure out fusion reactor, so the world can collectively stop worrying about renewable sources of energy.", "score": 3, "replies": [{"body": "> I just wish somebody would figure out fusion reactor\n\n\"Fusion is less than 10 years away\" - Physicists every 10 years.", "score": 2, "replies": []}]}, {"body": "People might call them Hydrogen bombs... 🤔", "score": 1, "replies": []}]}, {"body": "Undoubtedly if we had fusion the gov would swoop up and classify it and weaponize it.  Public wont get it for 10 more years until someone else can make it in another country and the US has to release the tech\n\n\nhttps://www.forbes.com/sites/arielcohen/2018/08/01/will-lockheed-martin-change-the-world-with-its-new-fusion-reactor/#10bdf5444c49", "score": -1, "replies": []}]}, {"body": "[https://youtu.be/f7MzFfuNOtY](https://youtu.be/f7MzFfuNOtY)", "score": 3, "replies": []}]}, {"body": "[Mark Spiegel’s family have started buying Tesla’s. Haha!!](https://twitter.com/tslacybertruck/status/1215459874118631424?s=21)", "score": 26, "replies": []}, {"body": "Just looked into ordering performance model 3, the delivery time is saying 8-11 weeks now. 7-10 weeks for standard +, 🧐", "score": 12, "replies": [{"body": "Buy it - you will not be disappointed.  Have Performance model 3.", "score": 7, "replies": []}, {"body": "Obligatory \"Demand problem\"", "score": 5, "replies": [{"body": "Was a lot longer than expected. Need it by April here in Texas, AC went out.", "score": 3, "replies": [{"body": "Where in Texas?  Houston here.", "score": 1, "replies": [{"body": "San Antonio!", "score": 2, "replies": []}]}]}]}, {"body": "Holy cow. I thought you must have been from some country far from a Tesla Gigafactory where they had to actually ship it across the sea & hundreds of miles on land.\n\nBut no, I'm seeing a 7-10 week delivery time for the East coast of the US.", "score": 5, "replies": []}, {"body": "Wow, why are they all at 7-11 weeks to delivery?  Thats a longer time than I would have thought", "score": 3, "replies": [{"body": "All production for the next 7 weeks goes to the EU and world. It will be loaded on boat after boat. Then they will give US customers a chance.  Some might not get their cars if they order late in the quarter.", "score": 4, "replies": [{"body": "Yeah this sounds right.  Ok makes sense", "score": 1, "replies": []}, {"body": "And obviously that is because all production near the end of Q4 was going in the US (before incentives run out). Time for EU customers to get their cars. In the meantime, any production cost improvements will add up and Tesla may be able to reduce prices in 7-11 weeks when they restart US deliveries, to make up some of the stopped incentives.", "score": 1, "replies": [{"body": "No need to reduce prices.", "score": 1, "replies": [{"body": "I’m speculating, but yeah no need. They’ve done it a few times.", "score": 1, "replies": []}]}]}]}, {"body": "My guess is either\n\n- demand is very high right now -> good news\n\nor\n\n- they have some planned down time in Fremont in order to set up Model Y production lines -> great news which will actually move the stock price!\n\nor bear case (just to play devil's advocate) \n\n- battery shortage for some reason", "score": 3, "replies": [{"body": "No battery shortage.  Just heavy demand from the EU and they get the first 7 or more weeks of production.", "score": 4, "replies": [{"body": "Agree, that's the most likely reason.", "score": 1, "replies": []}]}, {"body": "Remember they delivered more cars than they can produce this last quarter, so it would make sense that they'd have less cars on hand at the start of Q1.", "score": 2, "replies": [{"body": "Yeah that's a very good point", "score": 1, "replies": []}]}]}]}, {"body": "5-8 weeks here in Canada (all trims).", "score": 3, "replies": []}]}, {"body": "Elon says fsd complete soon on Twitter. Gonna get 100 more shares. Gonna juice q1 results.", "score": 12, "replies": [{"body": "Link to tweet?", "score": 3, "replies": [{"body": "[Link](https://twitter.com/elonmusk/status/1216030166733901826?s=21)", "score": 3, "replies": []}, {"body": "https://twitter.com/elonmusk/status/1216030166733901826?s=20", "score": 2, "replies": []}]}, {"body": "😂😎", "score": 1, "replies": []}, {"body": "SoonTM like blizzard releasing their games soonTM 🤣", "score": 0, "replies": []}]}, {"body": "Interesting to hear that although Waymo have publicised they have removed drivers. This Reddit user has been using them for a year and has never not had one. Also described an intervention and it sounds like they are still common even though it’s in a mapped out geofenced area.\n\nIt also seems as though it doesn’t do highways yet.\n\nThe bike over take and animation looks impressive though. \n\n[Link](https://www.reddit.com/r/waymo/comments/en1qmg/waymo_moving_over_for_bicyclist/fdvos7r/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n[More detail](https://www.reddit.com/r/waymo/comments/en1qmg/waymo_moving_over_for_bicyclist/fdw41wc/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "score": 10, "replies": [{"body": "Waymo currently has a more functional product than Tesla, but I do not think they can compete at scale and in the long run. They have two major issues:\n1. Hardware cost  \n2. The need for HD maps to operate  \nThe first problem means that they need to focus on areas where they will work close to capacity for 24 hours, effectively the big cities only. The second is an even harder problem, they have to produce those maps city-by-city and it will take a long time to do it globally. I think that in the end they will only offer it big US cities and nowhere else.  \n\nTesla doesn't need HD maps, but they need to train their network for the different roads in the various countries. This does come with costs, but doesn't take as much time as having a team of people drive everywhere in a city to create HD maps. In effect, they will be switching on new areas in country-by-country basis, which will give them access to large numbers of potential customers. They also already have vehicles in many countries, so no need for expensive investment to get started.", "score": 1, "replies": []}]}, {"body": "Why does the official Tesla investor relations website not list the q4 earnings release date as an upcoming event? Is this date officially known?  Ive heard both jan 29 2020 as well as mid feb 2020.", "score": 7, "replies": [{"body": "Tesla has the freedom to choose the date. Typically in the past they'll report earlier if numbers are good and later if not. Here, the last week in January would be earlier and anything in Feb would be considered later. We prob will find out the actual date next week or early the following week.", "score": 8, "replies": [{"body": "Q1 2019 ER was early and i remember how everyone got excited because that meant the numbers might be good after all. We all know how that turned out. I really don't think you can read anything into that.", "score": 10, "replies": []}, {"body": "I’m sorry but I have to ask: how do cows make you happy?", "score": 3, "replies": [{"body": "They make great pets.  They’re friendly and playful.  And if they’re not you can just kill them and enjoy the meats.  What’s not to like?", "score": 3, "replies": []}]}]}, {"body": "Because they have not set a date yet. Don't rely on rumors.", "score": 3, "replies": [{"body": "How far ahead do they usually announce the date?", "score": 1, "replies": []}]}, {"body": "AFAIK not yet known.", "score": 2, "replies": []}]}, {"body": "How does everyone think autonomous transportation will impact our cities?", "score": 5, "replies": [{"body": "The thing I want is a driverless campervan / RV holiday. You tell it to take you to a museum in another city for 10 am tomorrow, you go to sleep, you wake up, chill for a bit, step out right at the door, spend as long as you want looking round, press the button on the app, get back in, tell it to take you to an overlooked rural restaurant for dinner while you chill for a while watching tv. Then you tell it to take you to the beach for the next day.", "score": 12, "replies": []}, {"body": "The positive: better flow of traffic. Less parking required. Lower car ownership.\n\nThe negative: empty cars on the road, causing extra traffic. Also a lower threshold to drive instead of walking / biking. Causing more traffic again.", "score": 7, "replies": [{"body": "It will make sense to pick up multiple people during rush hour. That could have a profound impact on congestion.", "score": 2, "replies": [{"body": "I don't think many people would carpool with complete strangers every day. Maybe in a few generations when car ownership is only a thing your dad talks about.", "score": 3, "replies": [{"body": "I almost always use Uber pool when going somewhere that doesn't require me arriving at a set time. I'd never pool to work though, there are just too many possible delays.", "score": 0, "replies": []}]}]}]}, {"body": "Exponentially better traffic flow.", "score": 2, "replies": []}, {"body": "I hope it will make inner city flow better and open up the streets for walk and bycile traffic.", "score": 2, "replies": []}, {"body": "I've been thinking about it we might see a proliferation of single and dual occupancy vehicles via the robo-taxi companies. If you could order a taxi that has exactly as many seats as you have passengers, then that is going to be more efficient than one person being driven in a 5 passenger vehicle. And if you are just hiring the car as opposed to owning it, then when you need to move you and your spouse and 2 children, you order a 4 passenger car.", "score": 1, "replies": [{"body": "Too early for such differentiation. It will happen eventually but don't wast time thinking about it, we need real, true FSD first.", "score": 1, "replies": []}]}]}, {"body": "So... predictions for Monday?\n\nMondays have been usually good for the stock.", "score": 6, "replies": [{"body": "I hope so, I got calls which expire Wednesday.", "score": 4, "replies": [{"body": "Wednesday?", "score": 4, "replies": []}, {"body": "There’s no Wednesday expiring calls afaik.", "score": 2, "replies": []}, {"body": "@ $$ ??", "score": 1, "replies": [{"body": "500 strike, I won't say how much but rest assured if we don't get there I'm losing a lot of money, but hey, can't win em all!", "score": 3, "replies": []}]}]}, {"body": "Monday is the tension release from 60+ hours of news, rumors, drone footage and Elon tweets.", "score": 1, "replies": []}]}, {"body": "So I've heard some people talking about S&P 500 inclusion. \n\n1. At what market cap would that happen?\n2. What happens to stocks when they are included? Do they get a boost from passive funds buying them or something? If so don't people trade based on that already?", "score": 9, "replies": [{"body": "There’s certain rules and I think the only one Tesla doesn’t hit currently is sustained profitability over a year. So if Tesla continues to be profitable, maybe q2 or so.\n\nSome get a boost, some go down. I saw a chart somewhere showing stock charts before and after inclusion and it was about 50/50.", "score": 6, "replies": [{"body": "On the short term it should cause a price increase. But the different s&p trackers all have different balance moments, so it's not a 1 day thing. It's stretched out over 3 months, so you probably won't notice.\n\nOn the long term. It binds some shares to the s&p. So less shares available for trading = more volitile stock on tesla news. It also means the stock will move a little more with the market on macro news, because people trading the ETF will also be trading those tesla shares.", "score": 8, "replies": [{"body": "Less shares available would also mean current short sold shares will be more difficult to cover yes? So even more dramatic short squeeze coming up I think.", "score": 4, "replies": [{"body": "That's right, I guess this is part of the plan to squeeze shorts to hell. Once those 20 million shares go to index, they are permanently gone. There are not enough shares available for shorts to cover. That's why $900 call option is marked for $30. We probably will see spectacular price movement in the next few years.", "score": 2, "replies": []}]}]}, {"body": "Cool thanks.", "score": 2, "replies": []}, {"body": "Fact/Data is the most misleading thing. Always look at the reasons. \n\nSome companies do financial engineering, generate 2 or 3 strong quarters (by shifting demand and payments), so they could join the index. Then right after joining, they get terrible quarters. Twitter is one example. They had two great quarters to join, then the next quarter is back to loss. Of course this type will rally then drop.\n\nSome companies have turned the conner. They start to make significant profit due to scale or new products. They join the S&P and continue to rally 1000% in the next 10 years.\n\nTesla doesn't need to engineer anything. They start to make profit, Q1 will be great. Later this year will be even stronger. Next two years will be much stronger than this year.", "score": 2, "replies": []}]}, {"body": "I posted something that should hopefully answer all your questions [here](https://www.reddit.com/r/teslainvestorsclub/comments/en6tej/tmc_member_reflexfunds_thoughts_on_what_sp_500/), in a separate thread.", "score": 7, "replies": [{"body": "I imagine you meant to link [here](https://www.reddit.com/r/teslainvestorsclub/comments/en6tej/tmc_member_reflexfunds_thoughts_on_what_sp_500/). Thanks for writing it up, will have a read later.", "score": 5, "replies": [{"body": "Yes, thank you. Fixed the incorrect link.\n\nNot my write up though :) I just quoted somebody else.", "score": 6, "replies": []}]}]}, {"body": "Short answer is they need to make $266MM  in GAAP profits in Q4 + Q1 combined, and Q1 must be profitable. \n\nThe math can be found in top comment here:\nhttps://www.reddit.com/r/teslainvestorsclub/comments/dtkyet/what_is_everyones_thoughts_on_tesla_making_it/?st=K5A7KEXM&sh=de5794bf", "score": 3, "replies": [{"body": "Ah ok that's really interesting, could be quite soon then. \n\nI think it makes sense there would be a move with all that passive money coming in.", "score": 1, "replies": []}]}]}, {"body": "I know this is unrelated to Tesla but wanted to hear some thoughts about this as those who are into Tesla tend to be into SpaceX as well.\n\nSince we know we can’t directly invest in SpaceX I am looking at Google options 1-2 yrs from now. Google has a 5% stake in SpaceX. Starlink is projected to come online by September 2020 if all the launches until then are carried out on time and without a hitch. The Starlink project is projected to be the main revenue generator for SpaceX’s mission to Mars and disrupting the telecommunications market will be very lucrative.\n\nJust not sure how a profitable SpaceX with a successful Starlink project would correlate with a potential greater than normal growth in Google, especially post Q3, Q4.", "score": 3, "replies": [{"body": "I don't imagine SpaceX will return any profits to investors for a VERY long time. As you indicated, LEO launches, Starlink, etc. while they should be very profitable, exist almost exclusively to fund R&D for the Mars mission(s) and beyond over the next several decades (which is why SpaceX is not and will not be public). I'm not sure SpaceX's progress in the short-term will have any impact at all on Google's SP -- but MUCH longer-term -- sure.", "score": 3, "replies": [{"body": "Good points, Elon will for sure dump any and very profit into further R&D. The goal for SpaceX I guess is not to be profitable but to achieve their mission, profitably or not lol", "score": 1, "replies": []}]}, {"body": "All starlink profit will go towards advancing launch capabilities.  So its probably better to almost ignore starlink and focus on mars launch profitability and that timeline/ramp up.  If that never happens starlinks revenue might as well be zero (other than launch IP) because its all going to be burned into building out launch for a series of the most expensive space endeavors in humanities history.\n\nSpacex is not public because there mission is to make humans a multi planetary species.  That may or may not offer any positive returns and most investors would restructure the company toward profits removing risk and possibility of the dev that it needs.  It could entirely be basically a non-profit lab that never delivers a profit other than launching space payloads and starlink, which would completely be burned off as R&D towards a mars launch that is basically a non-profitable scientific endeavor.\n\nNo one wonders about NASAs profitability.  The gov partly exist to spend money.  Spacex wants to be what NASA was in the space age, but fully funded by any profits the company could have.  How does this become a profitable company when the mission is basically to burn cash of a decade long effort on a scientific endeavor?\n\nSpace mining could change this but thats very far out and impossible to evaluate at the moment.  \n\nSo really the bigger question is not starlink, but how could travel to mars be profitable?  Not by sending a few astronauts there.  Discovery of scarce resources on mars?  Whats the timeline for anything that could drive that?  For example, mining mars and having the economy to support those logistics my never over shadow mining earth.  Then what? The reduction of launch cost and that value doesn’t matter if the money is then spent on a scientific space mission that doesn’t provide a profit either.", "score": 2, "replies": [{"body": "Thanks for the response! The last paragraph really raises important questions I hadn’t thought about and make a lot of sense. I guess SpaceX isn’t particularly aiming to be profitable for the sake of making money but to achieve their ultimate mission. Any potential of profitability will be decades down the road but what those sources of revenue will be is unknown at this point.", "score": 1, "replies": []}]}, {"body": "It's still a blip on Googles market cap", "score": 2, "replies": []}, {"body": "Lol good luck getting exposure to SpaceX.\n\nSpaceX represents less than 0.1% of Google's market cap.", "score": 2, "replies": []}]}, {"body": "Anyone think it’s going to go any lower before earnings? Got some funds ready and want to buy more but idk if I should wait. I feel like some people who got on the train that aren’t really too much into TSLA are going to panic and sell. I know timing the market is a bad idea but what do you guys think?", "score": 2, "replies": [{"body": "usually the stock runs up to earnings, although the recent run up was more than you usually see before earnings, so it's anyone's guess at this point.  if you're going long, why not buy half now, and half after earnings?", "score": 6, "replies": []}, {"body": "Nobody knows for sure. Nobody expected the meteoric run up to new ATHs of $420 so quickly by the end of 2019. And then once again nobody expected the further run up to $500 in just a single week of trading in 2020.\n\nI wouldn't expect it to massively break through $500 before earnings, but then again I didn't expect it to get to $500 so quick in the first place. So who knows, it could.", "score": 6, "replies": []}, {"body": "Same problem here. Want to invest some more, dont even know if its better before or after earnings.", "score": 1, "replies": []}, {"body": "I would expect it retest 420 at some point.  Maybe even 380.  Be patient, keep something on the sidelines for the scary drops.", "score": 1, "replies": []}, {"body": "IMO there should be a dip on Monday due to the large number of calls that expired on 2020-01-10.  Market makers often hedge calls by buying the underlying, which they would then be selling at open Monday.\n\nStock chart has a small support line around 472-473 forming, so that's a pretty straight forward buy in point.  If you're feeling more ambitious there's another mini support around 460.", "score": 1, "replies": [{"body": "How do you hedge calls by buying the underlying?\n\nMM’s may sell covered calls and then sell the underlying the following Monday?  This is really a thing?  Wouldn’t it make more sense to sell another round of calls in their stock holdings?\n\nAlso, with the run up it is more likely (if they didn’t buy to close Friday) that they are now short a bunch of stock when those calls they sold and then subjected themselves to a $40 run up that they may want to buy back on Monday to not hold a $million short position going into earnings.", "score": 1, "replies": []}]}]}, {"body": "What will the production guidance be for 2020?\n\nI would guess 700,000 cars.", "score": 4, "replies": [{"body": "420,000 to 690,000", "score": 24, "replies": []}, {"body": "Guessing around 500.000 - 550.000.\nGF3 is still ramping up.", "score": 10, "replies": [{"body": "Sounds about right to me: they will not aim more than 50% growth and suffer another production hell .", "score": 1, "replies": []}]}, {"body": "I’m thinking they’ll guide for 550K", "score": 6, "replies": []}, {"body": "I think Elon’s leaned an awful lot about guidance over the last 12 months. Even if 700,000 is possible, I think he’ll guide around 500,000 and aim to absolutely smash it.", "score": 10, "replies": []}, {"body": "360k s3x from the US. 100k 3 from GF3.\n50k y from the US and 50k y from GF3.\nAnd a token amount of semi for internal use.\nTotal 560k.", "score": 4, "replies": [{"body": "They currently at a ~110k/Q runrate of s3x from US. I think 360k is an underestimation. And 50k model Us from GF3 seems high considering they have only just announced the production. I think they could start as late as EOY.", "score": 1, "replies": []}]}, {"body": "Could go as low as 10", "score": 4, "replies": []}, {"body": "120k GF3, 410k US, total 530k is my guess.\n\n2021 and 2022 will be much more significant.", "score": 5, "replies": [{"body": "410k US seems low. They're at a rate of 420k right now and the Model Y line isn't running yet. I think closer to 450k and 100k in China", "score": 3, "replies": [{"body": "You maybe right. Seems to me battery pack production is the limiting factor. Q3 and Q4 will be big.", "score": 1, "replies": []}, {"body": "I’d assume that any model Y production in freemont will be at the (at least some) expense of Model 3 production", "score": 0, "replies": []}]}]}, {"body": "I think 600k might be possible.", "score": 3, "replies": []}, {"body": "5x0k or so.", "score": 1, "replies": []}, {"body": "Sounds about right", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "With the amount of people coming on and asking \"is Tesla going to go up or down this week??\" It can be hard to tell when someone is making a joke.", "score": 5, "replies": []}, {"body": "No,  looks like the threshold for panic was higher than we thought.  Prob still happen in the next week or two after we hit 550sh.  Def interesting to watch.", "score": 2, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Ah", "score": 1, "replies": []}]}]}, {"body": "Lol, I was so used to Tesla going up every day, I quietly felt sad on Thursday and a Friday.   These  are the days when patience is perfected.", "score": 2, "replies": []}]}, {"body": "Don’t read, just venting. I’m glad it’s the weekend. I can finally take a deep breath and calmly relax and think about how to play my TSLA shares. This previous week I almost bought a put on Wednesday when market price was $498 and then almost bought a call when market price was $477 but didn’t because the price is so volatile. I don’t have many shares but my avg. buy in is $273 and I could easily profit if I choose too. I could also buy options but that’s just gambling on ER. Maybe I can sell a few shares to break even and then pick up more next time TSLA dips. Or just keep all my shares and buy a small put just to hedge my shares. In the long run I’m bullish but in short term I want to optimize according to market price. For example knowing the violate tendencies of TSLA it will most likely experience a strong dip sometime this year allowing me to pick up more shares but will it be lower than what it is now? Will ER skyrocket it? Also if sounds like I’m trying to time the market that’s exactly what I’m doing haha.", "score": 1, "replies": [{"body": ">if sounds like I’m trying to time the market that’s exactly what I’m doing haha.\n\nDude, you are most likely going to get burnt. Tesla is a ticking time bomb with over a billion dollars of deferred revenue waiting to be recognized, as well as continuously improving their margins and sales numbers each quarter. When it explodes you'll wish you had held onto your shares.\n\nPeople can claim all they want that FSD or profitability is years (lol, decades) away, but the truth is you and I do not know when this will happen, but when it does I won't be \"timing the market\".", "score": 13, "replies": [{"body": "This is exactly what I needed to hear", "score": 3, "replies": []}]}, {"body": "I would focus on saving money and buying more if it dips. \n\nNot against trying to time the market, but Tesla is a growth story.", "score": 5, "replies": []}, {"body": "Sell deep ITM covered calls", "score": 0, "replies": [{"body": "Not a bad idea, basically covers you through volatility, then if shares drop, you buy em back.  Only problem is if stock goes up you don't get to see any of those gains", "score": 1, "replies": [{"body": "that's why you sell deep ITM such that you could reasonably expect a rebound at some point. Find something with 2-sigma profit chance. If TSLA skyrockets, hope for a dip to buy back.", "score": 0, "replies": []}]}]}]}, {"body": "Me when I look at stonk price\n\n\nhttps://imgur.com/gallery/AqO1TMp", "score": -2, "replies": [{"body": "hell yeah baby !", "score": 1, "replies": []}]}]}
{"title": "How the Repo Liquidity Is Driving Your Stonk Gains", "selftext": "Leverage.\n\nInvestment arm of the big banks can get more cash on hand by putting up heir treasuries as collateral. This provides cheap dollar funding because the fed is keeping repo rates low.  \n\nThey use the extra cash on their books to increase leverage on their current/new plays, since they are still within the Frank-Dodd risk parameters.\n\nIt's that increment leverage that is pushing up the market.\n\nItll build a bubble but bubbles always pop. So expect a crash when the party is over. Like a BIGLY crash similar to the dotcom.\n\nThis is the millenial avocado toast bubble.Enjoy it because when it pops, markets will crash, you'll lose your job, and be eating white bread again.\n\nIt's not bear or bull gang. Its fuck the Fed gang. BLAme the Fed when the market crashes and you lose your job.\n\nAddendum:\nhttps://www.reddit.com/r/wallstreetbets/comments/cd7w09/fed_fund_rate_insurance_cut_is_really_an/\n\nBasically, the Fed can no longer cut rates, or else it drives itself into a liquidity trap. The Fed is doing repo, to not freak out main street, and doesn't care about blowing bubbles.\n\nRepo were initially for the spike in repo rate in October. We're now in January with no official end to them.\n\nSo yes, we are in bubble. STONKS can only go up. But then there will be a huge crash so wear condoms later, unlike papa Musk", "id": "en7yk3", "created_utc": 1578752511.0, "score": 184, "upvote_ratio": 0.96, "num_comments": 136, "comments": [{"body": "The gains have been good and steady.\n\nWhat bothers me is the lack of healthy 5-10% pull backs every now and then.  There’s a lot of money on the sidelines waiting for a pull back to get in.", "score": 92, "replies": [{"body": "That sideline money are boomers who have experienced 3 crashes.  No fucking way they enter again until they see another crash, or are comfortable with holding bonds and living life cheaper.  Consequently, this would be a huge drag on the economy.", "score": 65, "replies": [{"body": "Can’t remember the guy but he had a pretty interesting take on this. \nEssentially baby boomers “de-risking” their portfolios as they get older will cause a large outflow imbalance of US equities, since boomers will be selling stocks for bonds in aggregate faster than millennials are buying stocks with their new income. Partly due to population size imbalance. And it’s that de-risking of boomer’s portfolios that will limit companies’ access to funds, which will make it harder for millennials to get hired and increase wages, save money and invest, which refuels the self-fulfilling cycle of de-risking.", "score": 52, "replies": [{"body": "Imo it's going to be really interesting to see how it pans out. Boomers will also be spending 100% of their yearly income on retirement and hospitality services. So even if their generation is holding a disproportionate amount of wealth right now, they're going to start spending it. Probably on dumb shit like QVC", "score": 23, "replies": [{"body": "> Probably on dumb shit like QVC\n\nCan confirm. Been trying to get my boomer mom to stop blowing her money on useless shit from QVC & HSN that never even gets used for years now and use the money to buy stonks since 2014. She has a massive collection of cookware & kitchen appliances (most of which has never been used) and no portfolio since she cashed out her 401k about half a decade ago.", "score": 3, "replies": []}, {"body": "Long healthcare?", "score": 2, "replies": [{"body": "That and anything else pandering to old people. I'm still trying to figure it out. I think at home health care is going to pop off", "score": 2, "replies": []}]}]}, {"body": "Bond inflows have surpassed equities for several years, no?", "score": 9, "replies": [{"body": "yes but there's a lag from outflows to price action. Basically people sell as there are new buyers, so price randomly walks. Eventually sellers or buyers run out and only thing left are the other party. Eventually the remaining party runs out of things to sell or money to buy with.\n\nHowever, keep in mind there's also other demographics that may join in. For example, as Boomers exit, Chinese investors may replace them.", "score": 3, "replies": []}, {"body": "The bond market has always been much bigger than the stock market.  Does this mean that bond inflows are always bigger than equity inflows?", "score": 1, "replies": []}]}, {"body": "Was it  Robert Kiyosaki ?  He wrote a book on that topic.  I think many others have had the same idea though.", "score": 2, "replies": []}, {"body": "The youngest millenial is 23 and the oldest is 38. If they're still unemployed at this point you cant blame the stock maket.", "score": -1, "replies": [{"body": "A bit more clarification : Most boomers are still majority equities. It hasn’t happened yet. The shift will occur over the next 10 -20 years as millennials enter their prime, not their early careers.", "score": 9, "replies": [{"body": "But most equities are owned by rich people.   Rich people have no real reason to de-risk as they get older.   The vast majority of people's \"retirement investments\" is just a rounding error because it's so small.   \n  \nIt's only those with \"barely enough retirement savings\" who have any business at all reducing exposure as they age, because they are planning on needing to \"spend them down\" to pay bills.", "score": 8, "replies": [{"body": "Yeah,  $100k is like one options play around here. That won't even get you one lot of Amazon", "score": 4, "replies": []}]}]}, {"body": "You're setting the bar a little too high for what millennials will or won't blame.", "score": 3, "replies": []}]}]}, {"body": "The markets (incl. bond) may be fine so long as the Europeans flock to where rates aren’t negative", "score": 5, "replies": []}, {"body": "And a lot of them probably just won't because they're at that phase in life where they want a safe retirement, so they're trying to convert to bonds, maybe even an annuity, to ride out til death. With the big boomer population aging, and millennials not doing great, there is going to be some serious money coming out of the markets at large in the coming years. If everything is timed right, we could see a correction then a boomer scare, where they all panic sell to protect their retirement, and we have a yuuuuge fucking crash on our hands.", "score": 9, "replies": [{"body": "Most people in the UK buy an annuity. The annuity is covered by the lenders investments..", "score": 2, "replies": []}, {"body": "this already happened exactly a year ago when spx touched 2400 again.  The bulk of the selling is over.", "score": -1, "replies": [{"body": "There's still more. Boomers are a huge group.", "score": 2, "replies": []}]}]}, {"body": "The whole \"money in the sidelines\" is more a myth than anything in my opinion.", "score": 3, "replies": []}, {"body": "its very simple what will happen. It is impossible for so many boomers to pull out of the stock market. Returns are so incredible that most of retail is in head over heels. then they crash the fuck out of it not a short and sweet one but the long and dirty style. boomers are ripping their gains to shreds and living frugal as they can which in turn fuels the next downturn. when things get as bad as they could get the liberals to toss away our future and pump everything back. Boom! money in the pocket of the uninvested buffets of the world and they save it like usual...", "score": 2, "replies": []}, {"body": "Agreed  - waiting for an epic crash before buying in first time !", "score": 0, "replies": [{"body": "You're a year late. The next \"epic crash\" already came, went, and recovered.\n\nIf you had bought this time last year, you'd have raked in money. I was up 42% with just basic shares, no options. Sitting on the sidelines waiting for a drop is just a guaranteed-loser strategy.", "score": 8, "replies": []}, {"body": "Congrats on missing out on all the gainz!", "score": 12, "replies": []}]}]}, {"body": "Wait for late Jan into early Feb", "score": 7, "replies": [{"body": "What gives you the evidence in that timeframe?", "score": 6, "replies": [{"body": "They're feeling the market.", "score": 25, "replies": []}, {"body": "Repo ends", "score": 4, "replies": [{"body": "Rumor is repo till at least April", "score": 3, "replies": [{"body": "\"Not QE\" forever", "score": 8, "replies": []}, {"body": "Last time the I heard a rumor on this it was going to end the month it started.", "score": 3, "replies": [{"body": "When was that", "score": 1, "replies": [{"body": "2 years ago", "score": 1, "replies": []}]}]}]}]}, {"body": "Option chain positioning, vix bets and rotation", "score": 3, "replies": []}, {"body": "Earnings growth slowed along with all the below/above", "score": 1, "replies": []}]}, {"body": "It wont blow until trumps second term", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "When did we get a -20% in Q4 2019?  Think before you type BS", "score": 5, "replies": []}]}, {"body": "U must be new. Last year was awful.", "score": -1, "replies": [{"body": "Last year was 2019.....", "score": -1, "replies": [{"body": "Yes last year dec 2018...", "score": 2, "replies": []}]}]}]}, {"body": "Is the Fed continuing REPOS till April or stopping next week?", "score": 20, "replies": [{"body": "Last I read, they would start tampering til april but may extend the tapering til June.\n\nIf market crashes, they'll continue indefinitely. Not QE though, /s.\n\nYou can go to the New York fed site to see their repo purchases and the velocity of the buying.", "score": 31, "replies": [{"body": "Can you provide a link showing the purchases?", "score": 5, "replies": [{"body": "Or you could google for  New York fed", "score": 2, "replies": [{"body": "Already tried that. Where the hell do you click after that?", "score": 1, "replies": [{"body": "[here is what I found ](https://apps.newyorkfed.org/markets/autorates/tomo-results-display?SHOWMORE=TRUE&startDate=01/01/2000&enddate=01/01/2000)", "score": 3, "replies": []}]}]}]}]}, {"body": "Officially Tuesday. Unofficially unknown.", "score": 10, "replies": [{"body": "It’s not “Not QE” after Tuesday\n\nJP: Stop calling it Not QE!!", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "If the Fed is trying to solve liquidity issues with Repo they're retarded. The Fed is a void where money is created and destroyed. If they are LENDING money, it gets paid back in interest... Then all that interest gets deleted. So by doing repo, they're temporarily stopping the problem but making the underlying issue worse.\n\nIf they want to solve liquidity, they need to RAISE rates so that issued government bonds create more actual dollars to go around.", "score": 15, "replies": [{"body": "You should also consider the fact that they can’t raise rates without risking bankrupting government and many businesses. High debt companies DEPEND on low rates. I’m all for deflating this bubble a bit but FED doesn’t have the balls for it.", "score": 13, "replies": []}, {"body": "Fed raising interest rates too fast is partially what caused the liquidity issues. There are also plenty of zombie companies around that would collapse if they couldn't borrow cheaply. Also, Chinese companies have around 3T **US dollars** in debt, which they also probably cannot repay without low-interest rates\n\nIf the Fed raises interest rates the global economy will get fucked. If they do QT they'll end up with a liquidity crisis. If they don't do anything they may end up with a repo crisis\n\nThis whole shitshow is due to how massive banks have gotten. If the system were more decentralized the 2007/09 crisis could have been allowed to unravel without the need for QE and the economy would have self-corrected. But no, greedy fucking Washington can't be fucked to do anything useful. Bunch of fuckers. The Fed can hardly do anything at this point", "score": 3, "replies": []}, {"body": "What you described is the source of all money in the system.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Do you honestly think the fed listens to what Trump wants? Why would they? The cuts were in response to evident weakening economic conditions, they would have cut no matter what Trump was tweeting.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You're always investing. Regardless if you're buying stocks or not. If you're hoarding cash, you're investing in US currency. If you're hoarding food, you're investing in food futures. If you bought a house, you've invested in real estate. Perhaps a bit indifferent in each case sure, but you choose what to invest in, not if you want to or not. Gold and cash are just a couple of things guaranteed not to produce any value. Even in a complete economic collapse, some companies will come out ahead.", "score": 21, "replies": [{"body": "What if your a degenerate gambler who loses his paycheck every week at the Casino? Are you investing in Indian Futures whose return you've never seen?", "score": 6, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Some of you are taking my comment way too literally.", "score": 1, "replies": []}]}, {"body": "Don't be such a degenerate. Have some patience for delayed gratification and put it on a declining penny stock or buy some Tesla on margin and gamble like an American.", "score": 2, "replies": []}]}]}, {"body": "There’s always a pull back in feb. idk it’s lunar New Years month and pretty much all the countries that celebrate it goes afk.", "score": 22, "replies": [{"body": "Plus we all blew our load from Christmas and theres only shitty valentine's day to look forward to", "score": 6, "replies": []}, {"body": "Dem Primary begins feb 11, so if bernie wins he could be the excuse to sell off.", "score": 3, "replies": []}, {"body": "lunar new year is January this year. Uh oh.", "score": 3, "replies": []}]}, {"body": "The Boomer Fed is going to screw us all", "score": 15, "replies": [{"body": "Didn't they do that two decades ago when they cut interest down to <1%(after tech bubble crash) making saving a pointless endeavor creating a real estate bubble which destroyed a whole lotta people. Few years later savings still pretty pointless have to invest it in equities to have any real return. Can't believe Boomer fuck wads had good shit like 4 to 8% return just in savings and a lotta of them are somehow screwed when retirement comes. Fuck anyone who would coddle these stupid fucks who didn't plan better.", "score": 14, "replies": []}]}, {"body": "Fed will struggle to leave the short-term repo market because other parties won't substitute them at these low rates. To resolve this Fed needs to leave, leading to a spike in rates.... which they don't want nor do most institutions involved due to the grinding to a halt of liquidity that will ensue.   \n\n\n  \n\n\nTL;DR MU $90", "score": 9, "replies": []}, {"body": "Sorry, I couldn't hear you over all this free money.", "score": 8, "replies": []}, {"body": "Bubble but? I love bubble buts..", "score": 7, "replies": []}, {"body": "I bet we don't see a market pull back for 3 to 5 years.", "score": 11, "replies": [{"body": "Famous last words.", "score": 7, "replies": [{"body": "Remind me 3 years", "score": 2, "replies": []}]}]}, {"body": "For a second there I thought this was /r/investing for a moment", "score": 6, "replies": []}, {"body": "Except economic data still matters along with earnings. Fed liquidity is important but everyone’s idea of a major crash is laughable. You still need data to be bad including jobs and earnings growth. Eventually there will be a sell off but a “crash” makes it sound like 1987. That’s not going to happen unless we have major cracks in the underlying data not just the stopping of liquidity.", "score": 15, "replies": [{"body": "Ok,  if theres a market crash in 18months and you still have money, donate something to charity in my name.\n\nIf there isnt a crash, I'll donate to charity in your name.\n\nThe definition of a crash would be a 20% pullback from ATH within 6 months \n\nRemindMe! 18 months.", "score": 26, "replies": [{"body": "I will be messaging you in 1 year on [**2021-07-11 14:48:53 UTC**](http://www.wolframalpha.com/input/?i=2021-07-11%2014:48:53%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/en7yk3/how_the_repo_liquidity_is_driving_your_stonk_gains/fdw1kcw/?context=3)\n\n[**13 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fen7yk3%2Fhow_the_repo_liquidity_is_driving_your_stonk_gains%2Ffdw1kcw%2F%5D%0A%0ARemindMe%21%202021-07-11%2014%3A48%3A53%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20en7yk3)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 10, "replies": []}, {"body": "Still if the market gains 30% before that 20% pullback you  would have gained from investing now", "score": 4, "replies": [{"body": "Yeah. You're right. It makes financial sense to value tesla at 1000/share and AmD at 150 share.\n\nBut oh wait, that would price in their cash flow for the next 100 years! So why not buy stock in something where they needs to generate the same cash flow for the next 100 years today.\n\nPs.  Would you give out a loan of 100 years times someone annua pay, today, so you can get it paid back 100 years from now?", "score": 10, "replies": []}]}, {"body": "*ahem*", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That’s why you play both sides and meanwhile collect that sweet theta premium down the middle.", "score": 2, "replies": []}]}, {"body": "Yeah that’s not happening. In 2021 there will most likely be a recession but more than 20% is laughable.", "score": -2, "replies": []}]}]}, {"body": "But Panera's sourdough is so good tho.  Cant we postpone till 2056?", "score": 5, "replies": []}, {"body": "Well, no point in staying in gold and silver if fed money is drying up.", "score": 3, "replies": [{"body": "If deflation ever rears its ugly head again, the Fed can always go negative and QE. Considering the astronomical levels of gov, corp, and household debt the world over, printing is the only way out. Unless Jubilee and/or a great monetary reset. 5-10% in gold/silver isn’t stupid", "score": 8, "replies": [{"body": "Girlfriend, NUGT was so last month. Also, 5-10% in anything is straight normie trash. All or nothing 👈 the wsb way.      \n      \nSeriously, tho, debt levels are insane, and you're right. Last month I was deep in gold, but I'm currently at 3% gold and 2% silver. Cheers.", "score": 8, "replies": []}, {"body": "Negative Rates seems like it would only exacerbate deflation. If you issue $1000B in say 1 year treasuries yielding -2%, what happens is you delete $1020B and put back in $1000. So if the problem is that people are trying to hold onto money because the currency keeps appreciating more than it should... Then why the fuck are you talking money out of the system?\n\nAsset purchases are likewise retarded. Sure, let me buy a 30y MBS (inject temporarily) for $100M, and take out $5M/year ($150M total) from the money supply. Simultaneously you are making assets more expensive, and thus lower yield for anyone else trying to pay you back. Brilliant, you are actively deflating your fucking currency in the aim to \"iNjEcT lIqUiDiTy\". Amazing. \n\nI think there's just no more money that isn't ultimately owed to central banks anymore, which is what's driving the global liquidity decline. You need positive rates to have real inflation as opposed to asset inflation, and you need significantly positive rates to have people spend what they've saved. Otherwise people will just stuff their money into savings because nothing is worth investing in with such low yields.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "A good portion of Europe has negative rates... It's definitely on the table.", "score": 1, "replies": []}]}, {"body": "i google it but got nowhere.. wtf is QE", "score": 2, "replies": [{"body": "https://en.wikipedia.org/wiki/Quantitative_easing", "score": 4, "replies": [{"body": "Sweet. Thank you. Gives me plenty to go on (I didn't even know what it stood for).", "score": 3, "replies": []}]}, {"body": "queen elisabeth", "score": 2, "replies": [{"body": "I'd let her sit on my face", "score": 2, "replies": []}]}]}, {"body": "printing is not a way out, just a way of prolonging this insanity unless you mean hyperinflation.", "score": 1, "replies": []}]}]}, {"body": "I don’t know what the HELL you’re talking about but ima keep pumping my entire life savings into RH, bruh.", "score": 4, "replies": []}, {"body": "Does the FINRA debt levels [here](https://www.advisorperspectives.com/dshort/updates/2019/12/23/margin-debt-and-the-market-up-1-6-in-november) include margin debt that OP claims investment banks are using to buy more stocks? Because that chart shows margin levels pretty flat since September.", "score": 5, "replies": []}, {"body": "I thought Repo operation was like a band aid solution that has to last forever because the Fed can’t fix the problem. \n\nHeard it somewhere that the solution to the problem is less regulation(allowing to use treasury bonds for capital requirement) but senates like Elizabeth Warren are so vocal about not easing regulations that the Fed is forced to extend the repo operation over and over. Am i understanding the issue correct?", "score": 6, "replies": [{"body": "Yeah, Basel IV the main culprit.", "score": 7, "replies": [{"body": "From what I understand Basel 4 regs go into effect in 2022?", "score": 1, "replies": []}]}]}, {"body": "Most likely the democratic primaries starting in february will trigger a correction if Bernie is winning. It's an easy excuse to sell, earnings coming in will not be great to justify these high prices at the same time.", "score": 7, "replies": []}, {"body": "Similar to the dotcom? Okay bud.", "score": 3, "replies": []}, {"body": "What happens to the USD when the crash happens? Is cash gang the place to be? Or will QE start in earnest driving the USD down?", "score": 3, "replies": [{"body": ".", "score": 3, "replies": [{"body": "Yeah but gold sometimes gets it in the ass initially", "score": 2, "replies": []}]}]}, {"body": "Sell everything! Your wife, your kids, your home! Fuck it, quit your job because youre going to lose it anyway.  Run far far away and hide.  Portion out the remaining cash you have and eat 5 pieces of grain a day because the FED is coming.  The stock market might drop like 50% and if you're too stubborn to sell before that your net gains might only be 150% instead of 300% if you stick it out until then! I repeat, go to cash immediately because the FED! Said no intelligent investor.", "score": 3, "replies": []}, {"body": "A rational discussion of the repo operations: [https://am.jpmorgan.com/us/en/asset-management/gim/liq/fun-in-funding-land](https://am.jpmorgan.com/us/en/asset-management/gim/liq/fun-in-funding-land)", "score": 3, "replies": []}, {"body": "[Here is a great video put out Yesterday by Ciavacco Capital Management highlighting the differences between taking a defensive position at the right time, and the 100% hold strategy](https://m.youtube.com/watch?v=EC7RbbYQi78)\n\nIt should be a bit of an eye opener to all the buy and hold idiots out there.\n\nBut quite frabkly, I could give a shit when all these smart r/investing fucking retards hold through the next 50% pull back erasing between 17 and 29 years worth of portfolio gains because hey\n\n\n#STONKS ONLY GO UP", "score": 7, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "Learn technical analysis.\n\nLuckily, if you watch the vid, you'll see we may infact be at the very beginning of a new secular trend, after a cyclical low.\n\nSo we may once again see wild expansion of p/e ratios beyond historical limits. \n\nThese p/e expansions are the reason ppl like Warren Buffett miss out.  Because theyve never happenned in the history of the market. \n\nThey are 110 year cycles so at some point anyone that spent a life in the markets will be sure things are overvalued.  But in reality all just a cycle. \n\nBuy and hold may work out for another 8-10 years yet before the next major cyclical low, withing the current secular trend. \n\n... As Mr. Ciavacco will more elegantly explain if youre interested", "score": -9, "replies": []}]}, {"body": "Erasing X years is a dumb way to look at it imo, because the year after those dumps is a rocket ship. What am I missing?", "score": 3, "replies": [{"body": "A lot.\n\nDid you watch the video?\n\nSome examples would be the equivalent of your portfolio retracing back to when you were 29, if youre 56 right now.\n\nAnd you think it fucking matters if the stock market goes up 10% when youre already 56 and have less money than when youre 29.\n\n\nGive youre fucking head a shake and try to think critically for once in your life.\n\nSorry for the harshness.", "score": -3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "He's about as unbiased as you get.  Probably wouldnt see that on fast forward. \n\nDont worry about the harshness, I dont get offended by opinions of r/investing cucks", "score": 2, "replies": []}, {"body": "Uh, he explicitly said he wasn’t shitting on buy and hold and that buy and hold works if you hold 100% of the time. So it seems like you’re in agreement. But not everyone is comfortable watching 20 years of their gains evaporate and for them it makes sense to exit at some point and miss out on a tiny part of the upside.", "score": 2, "replies": []}]}]}]}]}, {"body": "I hope it pops Monday hewhewheh", "score": 6, "replies": []}, {"body": "Whatever it is, it's pushing up prices without any indication earnings or 2020 will be a better year than 2019.  All indications are still it will be weaker.  Forward PE is higher now than a year ago and we're closer to a recession.  Typically higher PEs are justified  by greater growth and earnings opportunities.  But maybe things are finally different this time.", "score": 2, "replies": []}, {"body": "Cool story bro. Did you know that the mint just prints money? Like, who the fuck do they think they are just making money from nothing?", "score": 2, "replies": []}, {"body": "The main problem is the interest rates. It’s fueling the consumer economy and what is really keeping equities alive. Repo is merely keeping the banks alive so that liquidity is able to continue.", "score": 2, "replies": []}, {"body": "Well said.  I guess the question “when will the market pull back?” Is on many people’s minds.\n\nI’m sitting on cash and haven’t profited from my SPY puts.\n\nThe FED may actually be stuck in the repo market for a long time because there doesn’t seem to be a clear exit strategy.", "score": 2, "replies": []}, {"body": "https://www.amazon.com/Creature-Jekyll-Island-Federal-Reserve/dp/091298645X\n\nShould be required reading. Everyone I’ve gifted this to let out a collective WTF?!?!  It’s amazing how big of a scam this whole thing is.", "score": 4, "replies": [{"body": "Author of this is a total nut job, lmao\n\nhttps://en.m.wikipedia.org/wiki/G._Edward_Griffin", "score": 13, "replies": [{"body": "That’s what the Rothschild family told you to say!!! 😂", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I mean, I dont disagree but edie griffin aint gonna be the one to show me the truth", "score": 4, "replies": []}, {"body": "Calling someone a “conspiracy theorist” is one of the more effective ways of controlling public opinion.", "score": 0, "replies": []}]}]}, {"body": "The guy has never even remotely worked on anything related to Fed, banking or finance, he's a fucking speech and communications major, please stop trying to peddle shitty books here.", "score": 12, "replies": [{"body": "You never read the book how do you know it’s shitty. It captures a lot of good detail on the Fed just because he  didn’t work there doesn’t discredit him automagically.", "score": -2, "replies": []}]}, {"body": "Illuminati. I will take my tendies from you. Buy gold. Sell $AMZN.", "score": 4, "replies": []}, {"body": "That guy is crazy", "score": 4, "replies": [{"body": "Did you read the book though? It’s not like the majority of what’s being described is wildly incorrect or opinion", "score": 0, "replies": [{"body": ">> He is the author of The Creature from Jekyll Island (1994), which promotes false theories about the motives behind the creation of the Federal Reserve System.[2][5]\n\nFrom the Wikipedia article", "score": 1, "replies": []}]}]}]}, {"body": "This is the most intelligent WSB conversation I have read in weeks.", "score": 1, "replies": []}, {"body": "Does this mean that we should see positive earnings surprises for BAC, WFC, & GS this week?", "score": 1, "replies": []}, {"body": "I cannot wait.  I'm buying a condo, a blonde and an M3.  With the money I have left over I'm buying a condo, a colombian and a Wrangler.", "score": 1, "replies": []}, {"body": "I've been slowly moving to only short calls/puts for things like earnings, and I've got trailing stop loss orders on anything I don't plan on holding for at least 5 more years. \n\nAs soon as I hear news about the Fed rolling back repo, I'll buy some low cost puts on all the meme shit stocks like BYND and PTON and cash in gains if it goes south. Like softening the blow to all my long holds.", "score": 1, "replies": []}, {"body": "When markets tank, people across usa and perhaps canada need to vote to go back to the gold standard.", "score": 0, "replies": [{"body": "Man the company I work for is already balls deep in the year end 280 and below puts and funding it by selling short dated calls. I feel everyone understands the shit that is going on, just exploiting the opportunity to ride the wave to Valhalla. Nonetheless we do not do much of US purchases anymore, we hold the books hedged.", "score": 3, "replies": []}]}, {"body": "Music wont stop until probably 2023. !RemindMe 3 years", "score": 1, "replies": [{"body": "when the God Emperor will be on his way out anyway.", "score": 1, "replies": []}]}]}
{"title": "From a single AAPL call on Dec 20th: 13000% gains", "selftext": "", "id": "en90jv", "created_utc": 1578757842.0, "score": 2489, "upvote_ratio": 0.93, "num_comments": 234, "comments": [{"body": "Yeah we going to need to see the strike and expiration date you know what fuck it just post your sell history and we will do the rest", "score": 790, "replies": [{"body": "I’m running some errands but I’ll get them posted shortly.\n\nEdit: I guess I’m an asshole. I never meant to imply this was one trade or position. \n\nhttps://imgur.com/a/nGES7VO", "score": 386, "replies": [{"body": "OP is busy photoshopping those right now, leave him alone!", "score": 318, "replies": []}, {"body": "!remindme 20min", "score": 81, "replies": [{"body": "!remindme 2 hours", "score": 47, "replies": [{"body": "!remindme gofuckyourself", "score": 163, "replies": [{"body": "gofuckyourself", "score": 92, "replies": [{"body": "Thanks for the reminder", "score": 48, "replies": [{"body": "No problem", "score": 19, "replies": []}]}]}]}, {"body": "!remindme 4 hours", "score": 15, "replies": [{"body": "!remindme 3 hours", "score": 2, "replies": []}]}, {"body": "There is a 1.1 hour delay fetching comments.\n\nI will be messaging you in 51 minutes on [**2020-01-11 19:58:09 UTC**](http://www.wolframalpha.com/input/?i=2020-01-11%2019:58:09%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/en90jv/from_a_single_aapl_call_on_dec_20th_13000_gains/fdx587n/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fen90jv%2Ffrom_a_single_aapl_call_on_dec_20th_13000_gains%2Ffdx587n%2F%5D%0A%0ARemindMe%21%202020-01-11%2019%3A58%3A09%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20en90jv)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 4, "replies": []}]}, {"body": "There is a 1.1 hour delay fetching comments.\n\nI will be messaging you on [**2020-01-11 18:09:15 UTC**](http://www.wolframalpha.com/input/?i=2020-01-11%2018:09:15%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/en90jv/from_a_single_aapl_call_on_dec_20th_13000_gains/fdx3l5l/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fen90jv%2Ffrom_a_single_aapl_call_on_dec_20th_13000_gains%2Ffdx3l5l%2F%5D%0A%0ARemindMe%21%202020-01-11%2018%3A09%3A15%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20en90jv)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "I HAVE TO GO RETURN SOME VIDEO TAPES", "score": 68, "replies": [{"body": "Its cran apple", "score": 5, "replies": []}, {"body": "great line", "score": 4, "replies": []}, {"body": "WTF? Is this 1998?!?", "score": -5, "replies": [{"body": "It’s a line from the movie American Psycho featuring Christian Bale", "score": 5, "replies": [{"body": "Ah! Great movie, I seriously thought you were going to return some video takes for a moment. 😂", "score": -5, "replies": []}]}]}]}, {"body": "“This post may contain erotic imagery”\n\nHell yeah it does", "score": 28, "replies": []}, {"body": "So you basically bet that SPY and AAPL would go up over the last month or so? Or were you swing trading call options?", "score": 7, "replies": []}, {"body": "> single\n\nUhh yeah you did", "score": 6, "replies": []}, {"body": "You mean \"imply\", not \"infer\".", "score": 11, "replies": [{"body": "🙄", "score": -9, "replies": [{"body": "Well, don’t use words you don’t know. :p", "score": 9, "replies": []}]}]}, {"body": "Can someone interpret this for me?", "score": 4, "replies": [{"body": "He's buying Apple Call Options and then selling them at a higher price a day later. Options are a type of contract that people can buy where they have the \\*option\\* to purchase a designated amount of stock at a designated price at a certain time in the future. A Call Option is an option contract that believes the price of a stock will go up.   \n\n\nEx. AAPL $300 Call 1/17 in the above picture means that he bought a contract for a fee that allows him to purchase 100 shares of AAPL stock for $300 on January 17th. If the price of AAPL stock on January 17th is $310, then he has the option of purchasing 100 shares at a $10 discount, a $1000 value.   \n\n\nHowever, OP isn't exercising these Options. OP is buying these Options for a fee and then reselling them for a higher fee when the price of Apple stock goes up and makes the Option contract more valuable. Options get a lot more complicated than this but just to help you figure out what OP is doing, in a similar fashion to buying AAPL stock low and selling high he's buying AAPL Call Options low and reselling them higher.", "score": 42, "replies": [{"body": "Where around the money is he buying? Just in/just out?", "score": 2, "replies": [{"body": "Not sure. You would have to go back to the dates specified in the pic and look at what AAPL stock was selling at on those days.", "score": 2, "replies": []}]}]}]}, {"body": "You are.  Plus it's hilarious that robinhood marks your deposits as a return%.....  Nowhere near the % in title.", "score": 4, "replies": []}, {"body": "I am not getting it. Can Someone or OP explain it to me what’s happening Pls :c", "score": 1, "replies": [{"body": "He's buying Apple Call Options and then selling them at a higher price a day later. Options are a type of contract that people can buy where they have the \\*option\\* to purchase a designated amount of stock at a designated price at a certain time in the future. A Call Option is an option contract that believes the price of a stock will go up.   \n\n\nEx. AAPL $300 Call 1/17 in the above picture means that he bought a contract for a fee that allows him to purchase 100 shares of AAPL stock for $300 on January 17th. If the price of AAPL stock on January 17th is $310, then he has the option of purchasing 100 shares at a $10 discount, a $1000 value.   \n\n\nHowever, OP isn't exercising these Options. OP is buying these Options for a fee and then reselling them for a higher fee when the price of Apple stock goes up and makes the Option contract more valuable. Options get a lot more complicated than this but just to help you figure out what OP is doing, in a similar fashion to buying AAPL stock low and selling high he's buying AAPL Call Options low and reselling them higher.", "score": 14, "replies": []}]}]}, {"body": "Thanks jakeel for responding what everyone was thinking", "score": 7, "replies": [{"body": "Yo! Who the fuck ask you anything", "score": 20, "replies": []}]}, {"body": "Why does anyone put an expiration date instead of a stop loss? The latter seems. To make more sense? Especially if you plan to hold? I'm confused.", "score": 2, "replies": [{"body": "Good plan", "score": 1, "replies": []}]}, {"body": "Posted", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "https://imgur.com/a/nGES7VO", "score": 6, "replies": []}]}]}]}, {"body": "Let me log into your account to see if this is really true", "score": 322, "replies": [{"body": "Same here, I'll make sure Ninety6ixx logged into the correct account", "score": 64, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Raw bin Hood", "score": 26, "replies": [{"body": "ThrobbinWood\n\nEDIT - spelling bc I can’t spell one word", "score": 36, "replies": []}]}, {"body": "robbin da hood", "score": 1, "replies": []}]}]}, {"body": "Did you buy at .05 and sell at~ 6.50?\n\nMy st0nk math is a little rough I dont know how to calculate gains as I dont have any experience \n\nFucking lets go!", "score": 86, "replies": [{"body": "Also I worded my title poorly. I had a single call worth about $48 at market close on 12/20. MANY trades have happened since, but without depositing additional funds. \n\nI’ll post the highlights shortly.", "score": 55, "replies": [{"body": "How do you have time to keep writing bullshit but won’t post the damn details", "score": 303, "replies": [{"body": "Trading course incoming.", "score": 75, "replies": [{"body": "Fuck is this Ross?", "score": 7, "replies": [{"body": "Ricky", "score": 10, "replies": [{"body": "Buy Oil!", "score": 1, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "Shut up and post more videos from your hot sister, Ricky.", "score": 2, "replies": []}]}]}]}]}, {"body": "OP is brazenly gay", "score": 3, "replies": []}]}]}, {"body": "Need to know now :)", "score": 3, "replies": []}]}]}, {"body": "Strike and expiry?", "score": 70, "replies": [{"body": "I'm curious with options. Can you share significance of your question? Does it mean he can't realize this income immediately?", "score": -2, "replies": [{"body": "He’s asking for the strike price of the contract and the day the contract expires. Literally the two most important parts of any option contract.", "score": 6, "replies": []}]}]}, {"body": "Clickbait title. ......OP said “many trades have happened” while the title says 13000% on a single AAPL contract.  Surprised the post didn’t come with a subscription link to a service.", "score": 175, "replies": [{"body": "[deleted]", "score": 41, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "The only way to purchase something with this type of gain would have been to go so far OTM that the price was pennies for the contract. Essentially because of the pump his contracts may have increased sizeably but they would still be so far OTM with the expiry approaching he would have trouble selling them regardless.\n\nHowever it’s complete bullshit. AAPL has only pumped 10% since then. Which is still amazing at a 280+ stock for a month specially one of AAPL stature. \n\neveryone who trades knows this is didn’t happen.\nOP then goes to say other trades happened...??\n\nOkay... So then your posting click bait? Fuck outta here.", "score": 26, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}]}, {"body": "Seriously misleading af, no way his contract returned 6k on apple", "score": 2, "replies": []}, {"body": "The title is definitely misleading, but i’m not sure intentional.  \n\nI think OP meant to show his run over the past month that started with a single contract.  Obviously this type of gain in that amount of time cannot be accomplished with a single contract alone.", "score": 2, "replies": [{"body": "Thank you.", "score": -5, "replies": []}]}]}, {"body": "Hope this doesn't motivate you to recklessly gamble.\n\nMost people, since they are irrational, would think \"Damn, if only I bet 10x or 100x more\" rather than \"Wow, I sure got insanely lucky on a lottery ticket\".", "score": 585, "replies": [{"body": "Had he taken out $100k loan for this move, he’d be retired by now. What an idiot.", "score": 940, "replies": [{"body": "Yeah OP is a pussy. Either live in your gains or die bankrupt", "score": 295, "replies": [{"body": "Pretty sure Warren Buffett said something like that.", "score": 113, "replies": [{"body": "Warren Buffet, after being on Bang Bros once said \"bang or bust BABYYY!!!\"", "score": 68, "replies": []}, {"body": "Who's Warren Buffet?", "score": 22, "replies": [{"body": "He invented restaurants where you can eat as much as you want, the stable of capitalism.", "score": 53, "replies": [{"body": "He invested in Coca Cola when it was made from coke for a reason", "score": 12, "replies": []}]}, {"body": "Probably some broke guy who eats at buffets", "score": 14, "replies": []}, {"body": "im pretty sure thats the guy that invented stocks n shit", "score": 9, "replies": []}]}, {"body": "Every day when he wakes up.", "score": 3, "replies": []}]}, {"body": "Bankruptcy is nature do over -Creed Bratton", "score": 17, "replies": []}, {"body": "I feel like that would be the official motto for this sub", "score": 5, "replies": []}, {"body": "me irl", "score": 1, "replies": []}]}, {"body": "This is the way", "score": 34, "replies": [{"body": "This is the way", "score": 10, "replies": [{"body": "This is the way", "score": 10, "replies": [{"body": "This is the way", "score": 9, "replies": [{"body": "This is Patrick", "score": 18, "replies": [{"body": "hi pat", "score": -2, "replies": []}]}, {"body": "This is the way", "score": 1, "replies": [{"body": "\nI have spoken.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "OP should have leveraged his children and sold his liver to raise more capital. That’s the WSB way.", "score": 44, "replies": []}, {"body": "There's the wsb I know", "score": 7, "replies": []}, {"body": "Yeah, I tried that...", "score": 5, "replies": []}, {"body": "Dude, even just a $5k bet would have been over $4m after taxes.  That's retirement at any age, really.  \n\nThat's $150k/year forever money.", "score": 8, "replies": [{"body": "I’m going to guess you were never great at math", "score": 23, "replies": []}, {"body": "It would be 650k", "score": 7, "replies": []}, {"body": "In what world does 5,000 \\* 130 equal 4 million?", "score": 3, "replies": [{"body": "In my fantasy land where 13000% is 1300x.  Guh", "score": 12, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "10x, yeah.  Moving decimals is hard when you're autistic.", "score": 5, "replies": []}]}]}]}, {"body": "13,000% is 130 multiple.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Don’t be poor.", "score": 11, "replies": []}]}]}, {"body": "And also \"I did it once, I can do it back to back! 13000*13000= 169 million! I'm gonna be rich, can't go tits up!\"", "score": 61, "replies": [{"body": "It is decidedly so", "score": 12, "replies": []}, {"body": "\"You either do it again, or you don't. That's a 50/50 chance!\"", "score": 6, "replies": []}]}, {"body": "But imagine if he HAD bet like $5,000.....", "score": 40, "replies": [{"body": "That Veronica Vaughn is one hot piece of ass, I know from experience dude. If you know what I mean.\n\nNo, you don't.\n\nWell, not me personally but a guy I know. Him and her GOT IT ON. WOOO-EEEE.\n\nNo they didn't.\n\nNo, No, they didn't. But you could imagine what it'd be like if they, eh, eh... everybody on, good, great, grand, wonderful, NO YELLING ON THE BUS.", "score": 62, "replies": [{"body": "Take my upvote prodigal moon", "score": 7, "replies": []}, {"body": "Sooooo hot, want to touch the heiny ooooOooOoowee!", "score": 7, "replies": []}]}, {"body": "$650,000\n\nNot even a millionaire. Chump change\n\nIf he then invested that $650,000, though....", "score": 15, "replies": [{"body": "\"Invested\"", "score": 4, "replies": []}, {"body": "analfarmer3", "score": 2, "replies": []}]}]}, {"body": "Listen to this, will save you a lot of grief and your marriage", "score": 13, "replies": []}, {"body": "A single $48 call is hardly gambling buddy.", "score": 4, "replies": []}, {"body": "AI researcher, technically that's not an irrational inference for him to make with his sample size.", "score": 6, "replies": []}, {"body": "Of course not. I was already motivated to gamble reeeeecklessly", "score": 1, "replies": []}, {"body": "no no silly, the only way to think is - what if i bet everything i have", "score": 1, "replies": []}]}, {"body": "Nice. I never have this luck with single calls or any amount of calls.", "score": 29, "replies": [{"body": "\"Only with puts, goddamn it, I'm trying stop the money from coming but it just won't stop! I mean look at this thing, so many zeroes without a decimal point that now I have to reduce the font size again!\"", "score": 3, "replies": []}]}, {"body": "This title is trash. Literally that’s like saying on dec 20th I took a shit and now I have $6k. Cause your ONE Apple call DIDNT get you to $6k lol", "score": 18, "replies": []}, {"body": "Username checks out.", "score": 11, "replies": []}, {"body": "Positions or ban, op. Clock is ticking motherfucker.", "score": 8, "replies": []}, {"body": "Take $6K, invest it something safe, and play with options with the rest.   \n\n\nWho am I kidding? You're probably going to split it 50/50 between MU $69 calls and TSLA $690 calls lol", "score": 14, "replies": [{"body": "Go on.... I want to hear the MU $69 calls. Is this a sure bet?", "score": 3, "replies": [{"body": "On February 29th at 4:20 pm, MU will be at $69. It is known.", "score": 3, "replies": [{"body": "You have a decent strike price and confidence, so I am following and buying on Monday. I don't care what it is, I follow confidence.", "score": 3, "replies": []}]}]}]}, {"body": "I can see where you went ITM \n\n*nice*", "score": 6, "replies": []}, {"body": "The inverse GUH", "score": 5, "replies": [{"body": "Is that a HUG?   There should be more hugs here.  \nMaybe we can start a /r/wallstreethugs sub.", "score": 7, "replies": [{"body": "Nah sounds gay", "score": 11, "replies": [{"body": "Probably the mod lounge.", "score": 5, "replies": []}]}, {"body": "Wall stree thugs", "score": 2, "replies": []}]}]}, {"body": "Better cash out before Tim Cook closes the sweat shops now that Ricky blew the lid off that one", "score": 4, "replies": [{"body": "Well depending on the expiration he may hold if its longer expiration because AAPL is about to report earnings by the end of the month and they going to beat and the stock will go up further.", "score": 2, "replies": []}]}, {"body": "Screenshot history link - again my bad for implying I made one magical trade. It wasn't my intent.\n\n&#x200B;\n\n[https://imgur.com/a/nGES7VO](https://imgur.com/a/nGES7VO)\n\n&#x200B;\n\n https://imgur.com/stYyKtM  - all time screenshot.  I'm not sure what my total deposits are, but I've only withdrawn once - $3900 shortly after Tesla Earnings for Q3. I got lucky on some long shots and had been playing with the leftovers.\n\nI was just trying to show the growth in my RH account since it’s low point", "score": 12, "replies": [{"body": "Nice. Do you not hedge ?", "score": 2, "replies": [{"body": "What is hedge?", "score": 7, "replies": [{"body": "It's the blue fast thing that's coming to cinema soon.", "score": 1, "replies": []}]}, {"body": "For the most part no. I’ve withdrawn what I invested and then some. I tend to swing for the fences on RH. I may get more conservative if my luck continues.", "score": 3, "replies": [{"body": "How old are you", "score": 10, "replies": []}]}]}]}, {"body": "This post will spring wsb to go full autist on their next trade", "score": 5, "replies": []}, {"body": "This makes me hate myself for scalping aapl calls since mid December...", "score": 3, "replies": [{"body": "Around NYE I was so proud of myself for making like $80 in 5 minutes and cashing out. Shit would’ve been worth thousands if I held to expiration 🤷🏼‍♂️", "score": 3, "replies": [{"body": "I feel you bro", "score": 2, "replies": []}]}]}, {"body": "Did you just lie to us retards in your title and we bought it up? You should start doing DD posts and baiting people into buying what you're selling.", "score": 3, "replies": [{"body": "I honestly didn’t think anyone would infer it was one magical trade or position. I’ve grinded my account back from basically nothing a few days prior to Christmas.", "score": 1, "replies": [{"body": "Wait...\"back\"?   You can't really claim 13000% gains if you are just recovering from a dip.  What is your all time return on the portfolio?", "score": 1, "replies": [{"body": "Posted elsewhere in the comments, but here you go.\n\nhttps://imgur.com/stYyKtM\n\nI withdrew $3900 on November 4th. Decided to play with what was left. Had a nice run then lost most of my portfolio holding onto otm calls and refusing to cut losses. \n\nMy low point was 12/20. I owned a single AAPL call that had dropped to $48. Without any additional deposits I’ve made numerous trades to get to where I am now.", "score": 1, "replies": []}]}]}]}, {"body": "Mods please ban this lying shitposter", "score": 5, "replies": []}, {"body": "Is it possible to learn this power?", "score": 3, "replies": [{"body": ">\tIs it possible to ~~learn this power~~ be this lucky?\n\nfixed that for you", "score": 19, "replies": []}, {"body": "Not from an investor.", "score": 12, "replies": []}, {"body": "all of us have the tism, few of us know how to use it", "score": 4, "replies": []}, {"body": "Not from a WSBer", "score": 4, "replies": []}]}, {"body": "Ban", "score": 4, "replies": []}, {"body": "Now, do the same with tesla.", "score": 2, "replies": []}, {"body": "Geez, that's insane.", "score": 2, "replies": []}, {"body": "Dream scenario.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Thanks, I hate it.", "score": 17, "replies": []}, {"body": "Bad bot.", "score": 1, "replies": []}, {"body": "Is this like a STD you catch in your sleep? The fuck bot.", "score": 1, "replies": []}]}]}, {"body": "idgi what happened", "score": 2, "replies": []}, {"body": "Nice! More details?", "score": 2, "replies": []}, {"body": "Soooo you got that strike and expiration?", "score": 2, "replies": []}, {"body": "what's the strike??", "score": 2, "replies": []}, {"body": "S T O N K S", "score": 2, "replies": []}, {"body": "🐻=🤡", "score": 2, "replies": []}, {"body": "If real, thats a 2020 WSB award - nice job brah", "score": 2, "replies": []}, {"body": "Congrats!", "score": 2, "replies": []}, {"body": "Thanks Tim Apple!", "score": 2, "replies": []}, {"body": "Intrinsic value is a mofo", "score": 2, "replies": []}, {"body": "Pretty cool", "score": 2, "replies": []}, {"body": "Get this guy a job at Goldman", "score": 2, "replies": []}, {"body": "Completely full of shit.\n\nI bought 300 strike JAN 31st Exp on Dec 20th as well.\n\nMy calls I Sold Thursday Market Close for 350% profit.\n\nFuck outta here with 13,000% FAKE", "score": 2, "replies": [{"body": "Same.  I bought 3/20 300c around that time, and while it's awesome it's up 300+%, it's a far fucking cry from 13000%.  Gtfo", "score": 5, "replies": []}, {"body": "BETA MALE", "score": 1, "replies": []}]}, {"body": "I made a move like this once. \n\n...once. \n\nIronically, it was also AAPL calls.", "score": 1, "replies": []}, {"body": "fuck! my dick can't even get that high. congrat!", "score": 1, "replies": []}, {"body": "You have to lose it all before you’re welcome here.", "score": 1, "replies": []}, {"body": "Looking forward to the highlights", "score": 1, "replies": []}, {"body": "Good job, boyo!  👍👍", "score": 1, "replies": []}, {"body": "How deep in the money is that now and what’s liquidity like on those options? I imagine it’s pretty good but you may want to close it sooner than later or you could get stuck needing to exercise it or sell for less than it’s actually worth.", "score": 1, "replies": []}, {"body": "This. This right here is why I am the degenerate I am.", "score": 1, "replies": []}, {"body": "so you're a billionaire now right?", "score": 1, "replies": [{"body": "Can you explain why he would be a billionaire?", "score": 1, "replies": [{"body": "He knew the outcome in advance so surely he sold his house, took out a loan, and bet it all.", "score": 1, "replies": []}]}]}, {"body": "!Remindme 1 day", "score": 1, "replies": [{"body": "There is a 1.6 hour delay fetching comments.\n\nI will be messaging you in 22 hours on [**2020-01-12 19:39:04 UTC**](http://www.wolframalpha.com/input/?i=2020-01-12%2019:39:04%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/en90jv/from_a_single_aapl_call_on_dec_20th_13000_gains/fdxpgy3/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fen90jv%2Ffrom_a_single_aapl_call_on_dec_20th_13000_gains%2Ffdxpgy3%2F%5D%0A%0ARemindMe%21%202020-01-12%2019%3A39%3A04%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20en90jv)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "!remind me 1 hour", "score": 1, "replies": []}, {"body": "Holy goddamn, this puts my BYND June call profit % to shame.", "score": 1, "replies": []}, {"body": "Sweet Jesus", "score": 1, "replies": []}, {"body": "Can someone tell me what this was", "score": 1, "replies": []}, {"body": "I've got the same chart but it's upside down from this one.", "score": 1, "replies": []}, {"body": "WTF", "score": 1, "replies": []}, {"body": "Decent call", "score": 1, "replies": []}, {"body": "Please explain what vehicle you did this with. Calls, call spreads? Selling porn?", "score": 1, "replies": [{"body": "I’ve posted links to my history but it was all calls. Almost exclusively Apple with a couple SPY positions. Typically hold overnight & look to reposition the next trading day. I do my best to be patient and ride out lulls before cutting my losses.", "score": 1, "replies": [{"body": "Thats definitely a simple strat and most people will say you're retarded...but you're the one who actually made money sooo.", "score": 2, "replies": []}]}]}, {"body": "All time graph screenshot?", "score": 1, "replies": [{"body": "Posted previous but here you go. I withdrew $3900 a few months ago.\n\nhttps://imgur.com/stYyKtM", "score": 1, "replies": []}]}, {"body": "Dank trade #2", "score": 1, "replies": []}, {"body": "OP please keep us updated for the post where you lose all this...\n\n&#x200B;\n\ngood job btw :D", "score": 1, "replies": []}, {"body": "What strike would you buy the calls and when would you sell?", "score": 1, "replies": []}, {"body": "Can you keep posting updates? You’re a G.", "score": 1, "replies": []}, {"body": "I made 15,000 in a day and lost the same amount in a day. Get as cocky as you want but just saying", "score": 0, "replies": []}, {"body": "\"A lot of trades happened in between\"\n\nyou moron", "score": 0, "replies": []}, {"body": "Ban OP", "score": 0, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "It is still the only platform with 100% free option trading", "score": 3, "replies": []}]}, {"body": "Now do Facebook", "score": 0, "replies": []}, {"body": "why is the chart green?", "score": 0, "replies": []}, {"body": "Ban for wasting giant gains on pathetic fake tiny positions", "score": 0, "replies": [{"body": "why is OP bragging?! he should be hiding in shame??", "score": 0, "replies": []}]}, {"body": "Fuck you fake ass bitch", "score": -1, "replies": []}, {"body": "How can i trade ?", "score": -1, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "This is not what a Robinhood screenshot looks like.", "score": 7, "replies": [{"body": "What’s the easiest way to post them?", "score": 4, "replies": [{"body": "Upload to imgurl", "score": 4, "replies": []}, {"body": "Uhhh take a pic with someone else’s phone and send it to yourself then upload it.  You figured out how to make $6k off AAPL but can’t figure out how to use the phone to post a pic.  Come on guy.", "score": 4, "replies": [{"body": "Sounds like he fits right in", "score": 1, "replies": [{"body": "This is very true.", "score": 1, "replies": []}]}]}, {"body": "Screenshot, post to IMGUR. Put link in comment. Done", "score": 1, "replies": []}]}]}, {"body": "Boo this man", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -14, "replies": [{"body": "Post details you fuck", "score": 25, "replies": []}, {"body": "Fucking post the details or GTFO", "score": 7, "replies": []}, {"body": "It’s clickbait then.", "score": 3, "replies": []}, {"body": "“Quick SPY double up” lol. So it wasn’t just a single Apple call", "score": 3, "replies": [{"body": "It’s a lot of trades. I certainly didn’t mean for it to sound like I made one magical trade. Poor wording on my part.", "score": 1, "replies": [{"body": "OP is the kind of fuckboy dating 15 people but claims they are \"single\"", "score": 2, "replies": []}]}]}, {"body": "This fucking guy...", "score": 4, "replies": []}]}]}
