{"title": "What stock would you recommend buying now (next week) and holding onto for 10+ years?", "selftext": "Even though I know it’s better to spend your time in the market instead of timing the market, I still fail to follow this advice. I always think “what if the price is lower in a month” or “what if there’s a recession soon?” I’ve been waiting for dips and good entry prices for many stocks, such as Microsoft, Tesla, AMD, Twitter, Disney, etc., but this just leads to missed opportunities.\n\nRecently, the market has been just getting higher and higher. Everything now seems to be reaching its 52 week high.\n\nAre there any stocks in particular you would recommend right now?\n\nI know it’s not a good idea to wait for dips, but I don’t have much to invest, so I just hope to make the most gains I could, but I have realized that I want to hold safe stocks for a very long time and hope to seem they grow haha\n\nAlso, I’m a person who likes science a lot (particularly bio and med related items) and anything that would benefit the earth/future, such as solar power or any other energy. Along with recommendations, if there were any you have in these areas, I would love to hear them!! I will definitely do my own research about the stock.\n\nAny help/insight/recommendations are greatly appreciated!! I definitely want to spend more time in the market, so I’m planning on doing research this weekend and investing right away. Thank you so incredibly much!! Good luck investing!", "id": "eq8og8", "created_utc": 1579305033.0, "score": 40, "upvote_ratio": 0.86, "num_comments": 108, "comments": [{"body": "Visa", "score": 46, "replies": [{"body": "Sorry this is a copy from another comment for a person who said V\n\n“Do you think Visa would be a good buy now though? It seems like its had pretty steady growth but this past week, its price increased a lot. Do you think it would keep growing or dip and then i should buy?”", "score": 1, "replies": [{"body": "Well ask yourself this, do you see more and more people going cashless as the years go on? I know I do. \n\nVisa owns 1 of 3 toll routes (others being MA, AMEX). Anytime anyone has to pay via credit card, these guys take a cut. V has the biggest market share of the 3. They also have Visa debit which also takes a cut. So now they're operating both debit and credit. They also just recently bought Plaid which powers Venmo. So these guys are not only controlling most of the credit toll routes but any other financial route as well.\n\nI believe their margins are something like 87%. What costs do they really have? Year over year growth and increase in transactions as well.", "score": 8, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I did state that.", "score": 2, "replies": []}]}]}, {"body": "If you are looking to hold for 10 years, a weekly dip shouldn’t really be a major consideration.", "score": 0, "replies": []}]}]}, {"body": "$msft", "score": 22, "replies": [{"body": "MSFT is a sure bet. Hope they do stock split in September. Looking back they always eventually did ot when the stock was around $120 and we're going to hit $170 in the coming weeks.", "score": 4, "replies": [{"body": "What happens if you own a stock like Msft and they do a stock split?", "score": 2, "replies": [{"body": "Simplified: You own the same part of the company but in a different number of shares. For example, if they double the number of shares, you will own twice as many at half the price. This is beneficial because it makes it easier to invest for a general audience by keeping the share price at a reasonable level.\n\nMicrosoft IPOd in 1986 at $21 per share and they split 9x since. If they hadn't done that, the stock price would easily be 5 or even 6 figures at this point. So when you plan on holding a stock long term, splits are great to keep investing without having to fork out big money or resort to fractional shares which tend to be a hassle or even unavailable with some brokers.", "score": 14, "replies": [{"body": "Great explanation, much appreciated!", "score": 3, "replies": []}]}]}]}]}, {"body": "Buy index funds. That way you can diversify your portfolio and hold 10+ years. Look into IVV, ITOT, FXAIX, FSKAX", "score": 35, "replies": [{"body": "This is the responsible answer^\n\n\nNot a professional but...\n\nI'm extremely confident in SPCE even for the next 20-30years possibly.\n\nNIO will probably grow as the \"Tesla of China\" good hold for long term if you're ok with investing in the modem day nazj Germany.", "score": 20, "replies": [{"body": "Tesla will be the Tesla of China", "score": 30, "replies": []}, {"body": ">I'm extremely confident in SPCE even for the next 20-30years possibly.\n\nWhy Virgin Galactic? Aren't they just doing short tourist trips into space? What is the long term upside to that?", "score": 5, "replies": [{"body": "They will potentially use the technology they've created for quicker travel around the globe as another revenue stream.", "score": 3, "replies": []}]}, {"body": "Maybe if Tesla weren’t in china", "score": 4, "replies": []}, {"body": "I have both NIO and SPCE and long on them as well. Nice rally last couple of weeks!", "score": 1, "replies": []}]}, {"body": "VTI\nVTI\nVTI", "score": 2, "replies": []}]}, {"body": "Square, really impressed with Cash App and some of their new offerings. Digital payments will only continue to take share from cash in the future.", "score": 7, "replies": [{"body": "waiting for it to break 70!!", "score": 1, "replies": []}]}, {"body": "VTSAX", "score": 6, "replies": []}, {"body": "Brk.b", "score": 12, "replies": [{"body": "You’ll barely beat the market", "score": -4, "replies": [{"body": "Let’s revisit in 2030. Though barely beating the market is nothing to feel bad about...", "score": 28, "replies": [{"body": "I agree with berk B, Buffet is holding his 122 B in cash to make a play when the moment comes. \n\nI think when everything is down, he’s going to come in and make a fortune for his folk, to the point where you could maybe even treat berk B as a hedge.", "score": 8, "replies": []}, {"body": "Disney, Microsoft, Dominos, Tesla etc with so many better options it’s waste to just “barely” beat the market when you can do 10x the market.", "score": -6, "replies": []}]}, {"body": "Isn’t that the point?", "score": -1, "replies": [{"body": "No.", "score": -1, "replies": []}]}, {"body": "Wait, you’ll beat the market?!", "score": -1, "replies": [{"body": "Barely. Much better options out there son.", "score": -2, "replies": [{"body": "Name any fund that will significantly outperform the S&P 500 consistently over the long term.", "score": 0, "replies": []}]}]}]}]}, {"body": "Taiwan semi, Lattice Semi", "score": 9, "replies": [{"body": "Taiwanese semiconductor nobody believed me 5 years ago. Now I laugh in there faces.", "score": 4, "replies": [{"body": "Yep they supply everyone.  If you believe 5g, AI, autonomous cars, etc will happen,  then you need chip makers. And TSM supplies almost all of them", "score": 4, "replies": []}]}, {"body": "why TSM and would it be a good time to invest now while it’s at $58? I heard that chips are going away and that it’s priced in already", "score": 1, "replies": [{"body": "I disagree completely.  But thats one opinion. \n\nTSM is a large cap play. Its like faang of chip stocks. Its a nice buy at 58 tho.\n\nSome smaller chip stocks I have are:  TER, LSCC, ON", "score": 2, "replies": []}]}]}, {"body": "V, MA", "score": 11, "replies": []}, {"body": "With those parameters I’d go with a broad market etf like SCHB.", "score": 6, "replies": []}, {"body": "Disney and Microsoft till you retire.", "score": 5, "replies": [{"body": "Why DIS? I’ve owned 100 shares for nearly a year and it’s really not doing much.  Sure it went up for D+ but then it went down.  Just don’t understand why people are telling me to keep it for the long haul.", "score": 1, "replies": [{"body": "Because disney will be here till aliens invade and destory earth. Sure you could gamble with Tesla, Roku, apple, etc. make more but that is a bit risky. Disney is the definition of buy and hold till you retire stock because of how safe it is. Not doing much for the past year? Don't worry about that, worry about the next 30 yrs or so.", "score": 4, "replies": []}, {"body": "D+ is just starting, they haven’t even reported on it yet. If they get close to what Netflix was able to do and take some of their market share and value, you are looking at potential future growth in the stock.", "score": 2, "replies": []}, {"body": "A year isn't a long time.", "score": 2, "replies": []}]}]}, {"body": "DIS", "score": 10, "replies": [{"body": "I have 100 shares of DIS, and it’s gone up a total of a grand for me.  Trying to figure out if it’s really worth keeping when other companies are doing so much better.  Why do people say keep DIS?", "score": 2, "replies": [{"body": "They're as big as any blue chip but far more diversified than most.", "score": 5, "replies": []}, {"body": "It’s never going anywhere... it pays a dividend that does go up over time.  They are about to rival Netflix in the streaming business and own major box office franchises that will generate content for decades.", "score": 3, "replies": []}]}]}, {"body": "AMZN\n\nHasn’t participated in this tech push at all. But I’m still super bullish on their future.", "score": 14, "replies": [{"body": "What do you mean by hasn’t participated in the tech push?\n\nAmazon is pushing Alexa to dominate the digital assistant and wearables market in both the west and Asia.\n\nThat seems like a massive tech push to me? What am I missing?\n\nGenerally curious btw", "score": 3, "replies": [{"body": "I mean that they’ve lagged MSFT, FB and AAPL strictly on stock performance. All those guys are up huge on the last year and AMZN has been stagnant. It’s frustrating since AMZN is my second biggest position.", "score": 3, "replies": []}, {"body": "he means the price hasn't increased, unlike the rest of the market it's not at ATH", "score": 1, "replies": []}]}, {"body": "There one of the few who haven’t been using their cash reserves for buybacks. But I’m also super bullish on Amzn", "score": 1, "replies": []}]}, {"body": "If you're interested in science / biomed related items and have a general understanding I would look into companies to do with either genetic sequencing or genetic based medicine. Pharma companies that are using CRISPR CAS9 are promising. I am personally invested in CRSP but there's a few others you can read into", "score": 2, "replies": []}, {"body": "All of them", "score": 2, "replies": [{"body": "VTI (vanguard total index).", "score": 6, "replies": [{"body": "X Act Lee", "score": 1, "replies": []}]}]}, {"body": "ENPH", "score": 3, "replies": [{"body": "Could you elaborate? Why not SEDG?", "score": 1, "replies": [{"body": "While SEDG does have a strong balance sheet, their earnings have actually decreased while revenue was increasing over the past 12 months. ENPH just became profitable and have seen strong insider buying (SolarEdge execs have been selling)... all in all I think the industry is poised for considerable growth, I just feel the growth prospects on ENPH outweigh others right now", "score": 1, "replies": [{"body": "Thanks for the response! I'm long both.", "score": 1, "replies": []}]}]}]}, {"body": "Tesla", "score": 5, "replies": [{"body": "Definitely", "score": 0, "replies": []}]}, {"body": "JD.com", "score": 2, "replies": []}, {"body": "ROBO, ICLN", "score": 2, "replies": []}, {"body": "I would recommend an etf, specifically something like VOO or VTI. \n\nFor an individual stock i would choose MSFT, it's the largest position i hold in an individual company. They have lot's of room to grow, great products and a good cashflow. Most of the other individual stock i hold are of tech/semi companies: TSM, AMD, QCOM, MU and some others.\nOut of those four i'd probably pick TSM if i had to choose one.", "score": 1, "replies": []}, {"body": "DIS, SQ", "score": 1, "replies": []}, {"body": "Look at the list of dividend aristocrats. Look at a list of dividend kings. These are stocks that have consistently raised their dividend every year for 25 years= aristocrats, 50+ years= kings. Pick the ones you like. A 10 year plan is a tough one because of the long timeline. A lot can happen in that much time. With high quality dividend stocks you are better protected for the long term. Just my opinion. GLTA.", "score": 1, "replies": [{"body": "Sorry this is a stupid question but does everyone get dividends regardless of the platform? I use TD Ameritrade but i don’t get any dividends even with companies i know that have them", "score": 1, "replies": [{"body": "Yes. You should get them no matter which brokerage you have.", "score": 1, "replies": []}]}]}, {"body": "V, MC, MSFT, COST", "score": 1, "replies": []}, {"body": "Visa. And then put some into WM.", "score": 1, "replies": [{"body": "Do you think Visa would be a good buy now though? It seems like its had pretty steady growth but this past week, its price increased a lot. Do you think it would keep growing or dip and then i should buy?", "score": 1, "replies": [{"body": "Personally I believe Visa will move towards 300.00. I would think it's longer-term price target is around 280.00 or so. Still room to make money in my opinion.", "score": 1, "replies": []}]}]}, {"body": "DIS, JNJ, T, MSFT", "score": 1, "replies": []}, {"body": "DRIP the Dow Jones", "score": 1, "replies": []}, {"body": "If you are throwing a significant amount of money into the market make sure to diversify it, never have all of your investments in one sector.\n\nOthers here have said index funds, which are a solid choice. You should research those as well, and diversify. There may be pullbacks, but over 10 years you have a good chance of doing well with those. \n\n For individual stocks, consider grabbing a couple shares of SPCE. If they manage to get through the next couple years without blowing up anyone then they have a lot of potential for growth. Also they are relatively cheap so a few shares have a small downside and a large potential long-term upside.", "score": 1, "replies": [{"body": "Why do you think virgin galatic company will grow? What are they into?", "score": 0, "replies": [{"body": "Space tourism, orbiting space hotels, global point to point travel (2hrs from england to Australia), asteroid mining. If they achieve these goals there will be a lot of profit for them.", "score": 2, "replies": []}]}]}, {"body": "TDOC", "score": 1, "replies": []}, {"body": "$V - it pays dividend too and the stock has been growing and will continue to. Check your wallet for what all your cards have on them if you don’t trust me :)", "score": 1, "replies": []}, {"body": "I mean, if you're thinking that long term Tesla seems to be the only possibility. They're in a market where their segment is rapidly increasing while their competitors' segment is decreasibg. Price of batteries and computers are declining rapidly while price of ICEs have been fairly stable for years. And then we're not even talking about the other markets they're getting involved in, all of which are also rapidly growing markets.", "score": 1, "replies": []}, {"body": "That is easily Google.   But really can't go wrong owning any of the big 5 tech companies.  Google, Amazon, Facebook, Microsoft or Apple.\n\nBut Google is easily best positioned.   Nobody else can do without a driver or even a backup driver.\n\nhttps://www.youtube.com/watch?v=UX_N2up7f8Q\n \n\nhttps://www.instagram.com/p/B5tP5XqlZpb/?igshid=1m8k9m1rv6ksx\n\n \nhttps://twitter.com/waymo/status/1194705739492708352?s=21\n\nGoogle also now lead in every layer of the AI stack from silicon all the way up to the top engineers.  The score card for innovation in AI with algorithms Google is miles ahead of everyone.\n\nhttps://miro.medium.com/max/1235/1*HfhqrjFMYFTCbLcFGwhIbA.png", "score": 1, "replies": [{"body": "\"Why Alphabet Stock Is a Good, But Not a Great, Investment for 2020 \"\n\nhttps://investorplace.com/2019/12/why-alphabet-stock-is-a-good-but-not-a-great-investment-for-2020/\n\nwhy do you post these videos repeatedly?  30 times in the last week.  seems you have some agenda.", "score": 3, "replies": []}]}, {"body": "Not Ford", "score": 1, "replies": []}, {"body": "You can download “Yahoo finance”, and every  company or other equities have details that can further your knowledge on which company to invest. I invest in companies that I like, products that I use, everyone uses; also companies that are eco-conscious.", "score": 0, "replies": []}, {"body": "BA", "score": 0, "replies": [{"body": "Ba too the MAX!!", "score": 1, "replies": []}]}, {"body": "SOXX", "score": 0, "replies": []}, {"body": "Citigroup", "score": -1, "replies": []}, {"body": "Luckin Coffee", "score": -5, "replies": [{"body": "For 10 days maybe. Even that is risky af", "score": 0, "replies": [{"body": "Oh I see, he said safe stock. My apologies.", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}]}, {"body": "LMT", "score": 0, "replies": []}, {"body": "Twitter dipped recently btw.", "score": -2, "replies": [{"body": "I’m sorry but until twitter (the platform) gets removed from autopilot, I won’t be tossing my money into them. I’d explain more, but I’m bad at persuasive discussion.", "score": 1, "replies": []}, {"body": "yeah i thought it would dip more but it didn’t", "score": -1, "replies": [{"body": "It dipped enough.", "score": -2, "replies": []}]}]}, {"body": "Peugeot. Thank me later.", "score": -1, "replies": [{"body": "Why Peugeot?", "score": 5, "replies": []}]}, {"body": "Bitcoin. If you're licking individual stocks, you're being speculative anyway. People under 45 will start flocking there just as much as gold if/when inflation finally catches up to Europe and maybe the US.", "score": -5, "replies": [{"body": "Don’t listen this ^^", "score": 5, "replies": []}, {"body": "Bitcoin and all its fanboys can go fuck", "score": 2, "replies": []}, {"body": "Do this if you want to gamble.", "score": 1, "replies": []}]}, {"body": "TWTR", "score": -2, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - January 17, 2020", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "epy27z", "created_utc": 1579252328.0, "score": 25, "upvote_ratio": 0.86, "num_comments": 496, "comments": [{"body": "Everyone who is sad that tesla isn´t rallying more, whats happening yesterday and today is actually great for the near term price of tesla. Right now we are consilidating the price above 500, everyday we go about even is another day of people getting used to buy the stock at around 500 which means a consilidation is happening, its impressive the pull back wasn´t larger after such an epic bull run with 100% in 3 months. lets hope its stays above 500 until earnings and let that decide the next months after that.", "score": 33, "replies": [{"body": "Yes, especially since we are without any good news since the China deliveries. It has been a quiet week but the stock has held strong.", "score": 12, "replies": []}]}, {"body": "Q1 sold out in China. \n\n\nhttps://twitter.com/kelvinyang7/status/1218120873628008448?s=21", "score": 29, "replies": [{"body": "Is that 1,000 or 10,000 cars sold? 🤔", "score": 4, "replies": [{"body": "Maybe like 11. They gotta make them out of dirt so it takes a while.", "score": 7, "replies": [{"body": "*mud\n\nThe water is already included, so I'd say 15-20.", "score": 1, "replies": []}]}, {"body": "At least 12k if they're at a run rate of 1k per week.  Which would also be consistent with reports that they're selling 1k per day", "score": 4, "replies": []}, {"body": "I’d guess more than 10K", "score": 3, "replies": []}]}, {"body": "Man, if they are producing on average 1000/wk this quarter (maybe some weeks they burst to 3k/wk and some weeks they shut down), that'll be massive deliveries. Like maybe 50-70k cars for the China market. Globally that could mean Tesla easily delivers over 100k cars in Q1. Pretty exciting.", "score": 1, "replies": [{"body": "I agree. I think 105K is reasonable for Q1. \nQ2 should be close to 135K with model Y and China ramping.", "score": 2, "replies": []}]}]}, {"body": "Ok bought me more 9 shares at around 509. Now with a grand total of 32. It's not a lot but it's honest work! My average is still below 300 usd :D", "score": 30, "replies": []}, {"body": "Just like u/wintermaker2 said earlier, this weeks also been weird for me with how many people are talking about Tesla (the cars not the stock). \n\nA friend who I had dinner with on Wednesday has convinced his company they need to start moving all company cars to Tesla’s after driving in my 3 so they’re ordering 4 of them to be delivered this quarter. (He has always been a huge Land Rover and Range Rover fan). \n\nA colleague’s husband who is the biggest petrol head - only drives Merc’s, BMW’s etc... and goes to the F1 a couple of times a year is buying a Model 3 performance after someone at his office just got one. \n\nAnother colleague from work who has previously said they didn’t like Elon is now asking me about his book and is going to buy it to learn more about him and Tesla. \n\nI also met up with a client (who has an S) who said his boss is test driving a 3 on the weekend and is planning to buy a performance version. \n\nSuper anecdotal stuff I know but I can’t get over that there have been 4 separate things like this in one week.\n\nDemand is real and it’s only growing. I’m now even more sure we’re at the knee of the curve!", "score": 29, "replies": [{"body": "Love these anecdotes. \n\nA colleague bought a 3 last month and another one ordered a Cybertruck. 1 year ago, both had major misconceptions about electric cars and Tesla's ability to do long trips. They were totally amazed when I showed the Supercharging network map. I can't take the full credit for the sales but I did plant seeds of curiosity which probably led them to do more research. \n\nI never proactively bring up Tesla in conversations but when someone else does, I don't miss the opportunity to plan a seed. :)", "score": 12, "replies": []}, {"body": "The only stall I'm running into is convincing non EV people that the Cybertruck is \"Ugly\" in its own way for a reason and to take another look at specs vs prices. People love the 3, S, and X but in my street level experience the Y is barely known and the cybertruck is still \"that ugly thing that will probably make a good fleet truck\".\n\nEdit: Interestingly, people seem to perk up and take interest after I reveal that as a Tesla owner, I have my reservation in and am very excited for the truck (and plan to buy one for my dad as soon as possible).", "score": 3, "replies": [{"body": "I think that people will be surprised what CTs will look like nice they are on the road. It is basically a blank canvas that due to its rectangular shapes can be easily customized with plastic film. I expect to see some very creative designs.", "score": 2, "replies": []}]}]}, {"body": "Elon said today in a tweet \" Helping to pay for this is why I’m accumulating assets on Earth\", he is talking about paying for a 1000 starships. and he is okay using his own fortune to do it. He said building one starship with a superheavy is around 300 million dollars if design goes right. So thats still 300 billion dollars for a total fleet of 1000 starships to see his mega scale plan to life. we know he cares little about money itself he only wants it for the sake of making his opportunities bigger! . Which means he is no where near satisfied with his current amount of money, not for the sake of money, but simply because he requires more to enable his dream of putting a civilisation on mars before he dies. This man will stop at nothing to get more cash. Which means we are in for a ride and a long one at that!", "score": 25, "replies": []}, {"body": "YES!  The date is out!  Jan 29th.", "score": 24, "replies": [{"body": "I think after hours rise to almost $513 is on this news. \n\nTuesday is gonna be fucking epic.", "score": 14, "replies": [{"body": "After hours was up $2 earlier when I looked but down $10.50 now. Weird.", "score": 3, "replies": []}, {"body": "What? Why? Do people still think announcing an earnings date is bullish?", "score": 2, "replies": [{"body": "Well there's a possibility it's delayed and that would be a bearish signal so this takes that off the table", "score": 1, "replies": [{"body": "But it's not a bearish signal. I think the date is meaningless", "score": 3, "replies": [{"body": "You think", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes put the fear of god into these shorts", "score": 13, "replies": [{"body": "I think the only shorts remaining are those in a coma that forgot to give over a power of attorney.", "score": 9, "replies": [{"body": "Spiegel is actually in a coma and gave POA to a chimpanzee to tweet FUD for him and manage his fund. He's now highly invested in bananas.", "score": 8, "replies": [{"body": "Almost believable except the chimp would be doing better with his fund", "score": 4, "replies": []}]}, {"body": "Ok the POA comment got me in stitches. thank you for that", "score": 5, "replies": []}]}]}]}, {"body": "China Q1 sold out. Delivery estimate for China Model 3 is now Q2 https://twitter.com/KelvinYang7/status/1218120873628008448", "score": 20, "replies": [{"body": "Would love a source on that :)", "score": 3, "replies": [{"body": "Go to tesla.cn in Chrome, switch the live translation to English, order a MIC Model 3, see the new delivery estimate:\n\n> \"Your Model 3\"\n>\n> \"Expected delivery date: **Second quarter of 2020**\".", "score": 10, "replies": [{"body": "Got it. Now all we need to know is how many are being produced", "score": 2, "replies": [{"body": "Probably zero right now, given the Chinese New Year - but I'm pretty sure they have a production target for Q1, which was the basis for the Q1 order cut-off.\n\n10k+ production+deliveries in this first ramp-up quarter would be pretty sweet, with 15k as a stretch goal? That's a cool $400m-$600m in additional revenue.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Around 323k yuan IIRC after the latest rounds of price cuts (299k for customers after incentives), which is $47k, which includes 13% sales tax which Tesla transfers over to the government, so the effective US-equivalent entry ASP would be $41k. I agree that the real ASP will be higher than that.", "score": 3, "replies": [{"body": "Ah, thanks -- actually didn't realize it included taxes. Makes a lot of sense.", "score": 1, "replies": []}, {"body": "Sorry, qq, this 13% sales tax remains following the 10% purchase tax exemption?", "score": 1, "replies": [{"body": "Yes, I believe that's the case - all car sales fall under 13% VAT in China, including EVs. The car purchase tax was an *additional* 10% tax, paid by owners shortly after taking delivery, which purchase tax got waived for Tesla.", "score": 2, "replies": [{"body": "Gotttt it, thanks!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Won’t the G3 be closed for a week during CNY?", "score": 2, "replies": [{"body": "Every industrial company and thing in China is closed during the festival period.", "score": 1, "replies": []}]}, {"body": "This is not good news, likely demand/production issues going on :(", "score": -4, "replies": []}]}, {"body": "Reminder that the stock market is closed on Monday. Hopefully some good news in the 3 day weekend", "score": 17, "replies": [{"body": "wait, why is it closed? sorry i'm Canadian..   \n\n\nedit: my apologies  Martin Luther King, Jr.", "score": 19, "replies": []}]}, {"body": "Hey, you know what we haven’t talked about in a while? Panel gaps.  So here are some e-tron panel gaps: https://twitter.com/alex_avoigt/status/1218184321653264384", "score": 17, "replies": [{"body": "I love how people think a car should be perfect if it costs 40k plus, those are the people who have never previously owned a car that costs 40k plus", "score": 10, "replies": []}, {"body": "Wayyyy worse than any Tesla I've seen.", "score": 5, "replies": []}, {"body": "Those aren't terrible to be honest. There inline with my model 3 and I had no issue with mine. \n\nBesides some absurd 1 inch gaps we were seeing on some people's model 3 I don't think this is that bad.\n\nThis is what happens as they try to automate more. What they'll do is continue to reduce the acceptable range.", "score": 4, "replies": [{"body": "They’re not terrible indeed, neither were the ones I saw from some Taycan pics last week either.  The point really is: all cars and all brands have some panel gaps.  It was really blown out of proportion with Tesla.  For instance, my Model S is from 2017, which is before this whole panel gap thing became “a thing” and there aren’t any noticeably wrong gaps there.  I’ve seen a lot of Tesla’s and I’ve never really seen a panel gap that made me go “hmm, glad that’s not my car”.", "score": 5, "replies": [{"body": "Agreed. People just need to understand how margin of error on automation and robotics manufacturing works. Thresholds will get better with time. \n\nI am much more concerned with the wind noise on the model 3. If nothing else they implemented active noise cancelling they could please so many people.", "score": 1, "replies": [{"body": "No argument here... even on my Model S, the wind noise is worse than my previous 2010 Audi A5.  But I cut Tesla a lot of slack when it comes that kinda stuff.  I’ve heard that the Raven S/X are already a lot more quiet than the previous generation.", "score": 2, "replies": []}]}]}]}]}, {"body": "Stock really held itself strongly at 500 this week.  Hoping for takeoff next week!", "score": 18, "replies": [{"body": "Past the moon, straight up to mars!", "score": 8, "replies": []}]}, {"body": "Interested in what others think.\n\nSurely the [megapack](https://www.tesla.com/en_gb/megapack) is basically a slam dunk product where the only thing left to do is scale battery production? They're already designed it, it already works, there is already big demand caused by the [duck curve](https://en.wikipedia.org/wiki/Duck_curve). \n\nVery few people include it in their future stock price estimates but I think it's just so obviously going to sell everyone one they can make for years. Especially as solar panel prices continue to fall and more and more are installed.", "score": 16, "replies": [{"body": "i know this opinion is definitely in the minority here, but I personally think Tesla Energy revenue will end up being bigger than FSD revenue in the long run.  I love the megapack, and hope it'll do great.", "score": 10, "replies": [{"body": "I agree with you. The energy market is so much greater than automotive. Every home and business will have some type of battery storage and way of producing electricity in 10-15 years.", "score": 9, "replies": []}]}, {"body": "Agreed. I think Tesla is going to start making their own car battery cells and have Panasonic keep producing for their storage products, maybe LG Chem for in China. Their battery production will suddenly have a step change and be able to supply both sides of the business. Then watch out, it's gonna be epic.", "score": 6, "replies": []}, {"body": "I think they are still too expensive at $450/kWh something, for mainstream use. With 2000 cycles, 5.5 years of 1 cycle per day, Power costs would be $0.23kWh, Natural gas is like $0.09, solar can be as low as $0.03 (but they need batteries).\n\nRight now Megapack makes sense if you got a slightly niche use that can take advantage of it's advantages, like fast response time, reliability, to balance a grid. If costs drop by like half then it starts getting into the real good territory and basically solar + 8 hours of storage is cheaper than coal and expensive nuclear. \n\nIf costs can be cut further, to like $150/kWh then at that point we can basically close all the natural gas plants, shut down all the nuclear reactors, offshore wind. We can keep Hydro and land based Wind since they are cheap, but everything else is obsolete to Solar + Battery. Hitting $150/kWh shouldn't really be too hard since Tesla is reportedly making their battery packs for like $110/kWh. The price is also probably deliberately kept high, otherwise they would get flooded with orders of people trying to save money closing their nuclear plants and replacing them with batteries+solar. \n\nIf 1/3rd of the day would be entirely powered by Tesla batteries, at a cost of $0.077/kWh + Solar at $0.02/kWh the costs would be on par/cheaper with natural gas/nuclear at $0.09/kWh, and bring in yearly revenues of $474 billion per year. \n\n [https://www.wolframalpha.com/input/?i=world+electricity+consumption+\\*%281%2F3%29+\\*+%24150%2FkWh+%2F2000](https://www.wolframalpha.com/input/?i=world+electricity+consumption+*%281%2F3%29+*+%24150%2FkWh+%2F2000)", "score": 6, "replies": [{"body": "This is a great comment thanks.", "score": 3, "replies": []}]}, {"body": "**Duck curve**\n\nIn utility-scale electricity generation, the duck curve is a graph of power production over the course of a day that shows the timing imbalance between peak demand and renewable energy production. The term was coined in 2012 by the California Independent System Operator.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/teslainvestorsclub/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "score": 3, "replies": []}, {"body": "Harder to stay ahead, when products become commodities. Vertical integration of the production could lead to a cost advantage so as to keep the profit OK. Here is to hoping for news about that on battery day.", "score": 3, "replies": []}]}, {"body": "Pretty good chance that we get an ER Date today. Q4 2018 announcement was on the 18th of January.\n\nIf we dont get the announcement today, this would be the latest ER announcement since Q4 2016\n\n&#x200B;\n\nI'm sure this information is somehow relevant.", "score": 15, "replies": [{"body": "Needs to be Jan 30 after hours so we can see a huge 1 day run up for all of our jan 31 calls. Might make an epic squeeze too.", "score": 1, "replies": []}]}, {"body": "Of all the things to be critical of Tesla for, service would surely be on the top of the list and a reasonable argument could be made for lagging service but 'analysts' can't even properly criticize Tesla and instead make things up lol \n\nI guess in order to acknowledge there may be service issues, you'd first have to accept Tesla is selling their cars...", "score": 16, "replies": [{"body": "I used to think service is an issue --- until I found out many examples of service issues elsewhere. \n\nI had two experiences with tsla service so far, which all come back quickly and positively; and I also had my old ICE car in colision repair for over a month.\n\nSo there is likely a bias here for Tesla service quality. Simply because someone shouted out louder, does not mean what they said is more significant.", "score": 4, "replies": [{"body": "That's good to hear. I have also anecdotally heard Tesla's service has genuinely improved in the last couple years but it's hard to know if this is everyone's experience throughout the world. Hope so!", "score": 1, "replies": []}]}, {"body": "Sales/service is literally the only thing I'm worried about right now.\n\nElon said on a call last year (was it 2019Q1?) that this would be a priority for him. But reading anecdotal posts, it doesn't seem to have improved that much. Would love to see this addressed on the upcoming ER. Also would love to see some metrics from Tesla around this, although I doubt that will happen.", "score": 4, "replies": [{"body": "I hope they thought of the service aspect before they started to sell in China. There was that 2 or 3 part Bloomberg article about Tesla a couple months ago and the data showed that the need for service is actually decreasing. I would bet Elon is trying to reduce and ultimately remove the need for any kind of service and achieve ultimate efficiency, kind of like the Cybertruck. That doesn't seem very realistic to me but I wouldn't doubt Elon wants to make it so Teslas don't even need service at some point.\n\nYea, I also doubt they made big changes with service. Who knows, we might get a glimpse at ER.", "score": 1, "replies": [{"body": "In China it's different... if you have the patience to deal with Tesla Service, you show indications of being a stable and peaceful husband, thereby further increasing your already elevated social status because you can afford a Tesla.", "score": 4, "replies": [{"body": "I think I heard something similar from the Tesla Daily Podcast with Alex Potter. The cultural aspect is very interesting.", "score": 1, "replies": []}, {"body": "This comment is sublime.", "score": 1, "replies": [{"body": "👆 this man is married", "score": 1, "replies": []}]}]}]}]}, {"body": "so true..", "score": 3, "replies": []}]}, {"body": "29th it is:\n\n\nhttps://ir.tesla.com/news-releases/news-release-details/tesla-announces-date-fourth-quarter-and-full-year-2019-financial", "score": 16, "replies": [{"body": "alright!!! calls expire 2 days later. whohoo!", "score": 9, "replies": [{"body": "Same. I have small batch expiring on 01/31 and some on 02/20. Hope we get good bump on them.", "score": 4, "replies": [{"body": "F", "score": 2, "replies": []}]}, {"body": "F", "score": 2, "replies": [{"body": "Fake news on popular electric site?", "score": 0, "replies": []}]}]}, {"body": "Nice", "score": 7, "replies": []}]}, {"body": "I'm happy to see Tesla holding above 500. We can't ask for much more than this right now! \n\nIt's very important to establish new higher support levels for the long term.", "score": 28, "replies": [{"body": "Do you really have to jinx it..", "score": 1, "replies": [{"body": "Imagine believing in jinxes after 5th grade", "score": 15, "replies": [{"body": "Well we are steadily dropping so how else would you explain this ? 🤔", "score": 1, "replies": [{"body": "My apologies - get ready for tomorrow headline “Reddit User Xillllix Single Handedly Plummeted Tesla Stock with JINX”", "score": 10, "replies": [{"body": "Omg wtf happened? Anyway stock looks fine.", "score": 1, "replies": []}, {"body": "That’s more like it. Blame others for losing money. Not yourself !", "score": 0, "replies": [{"body": "To be fair, that's now literally a viable path to getting a high position, for example you could be President of the United States...", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "What's interesting is all the anecdotal stuff happening lately around me.\n\nNiece wants to invest in TSLA.  \n\nSister in law in China wants a Tesla but her husband currently is against it (\"horrible range\", \"breaks all the time\", he MUST be thinking of previous Chinese-made EVs)\n\nWife's friend is buying a Model 3 LR.\n\nAnother friend is asking my wife about the cars, appears interested in a car as well.\n\nI just showed my son's debate tutor our Model X, offered a test drive that he took a rain check on... the previous two debate students and their dad were very impressed as well.  The debate coach is a right wing Trump supporter and yet clearly thinks the cars are vastly superior.  No bad press has confused him on that... except maybe into thinking they're all unaffordable.\n\nThat's all in the last week.\n\nAt least from what I'm personally witnessing around me (which is nearly meaningless statistically), there's more activity than ever.", "score": 26, "replies": [{"body": "Here as well (Europe). Multiple clients have bought a Model 3 in the past few months after a test drive.\n\nMy mom(!) is looking for an EV. \n\nMe myself; i've become an EV evangelist and i NEVER DO THIS. The product is just SO MUCH BETTER than anything else... This change is the number one reason for me to invest in the company. It's just way way ahead of everyone else, and that's 2016 tech.", "score": 10, "replies": []}, {"body": "> The debate coach is a right wing Trump supporter and yet clearly thinks the cars are vastly superior.\n\nThis has always been falsely bifurcated. Plenty of right-wingers also recognize and admire EV superiority, particularly with what Tesla is doing. The mainstream and social media magnify the 5% loudmouths, but most reasonable republicans \"get it\", at least to some degree.\n\nThere's also the 5% loudmouths on the left talking shit about Tesla, but you don't see them talked about nearly as much outside /r/politics and such subs.", "score": 6, "replies": [{"body": "All mainstream news medias bash Telsa constantly, and want to bring Tesla down to its knee. The irony is that 90% of them are very left leaning.  Yet most ignore this connection.", "score": 5, "replies": [{"body": "Oh yeah, it's kinda insane, actually. I've been keeping a mental tally, and sources like drudge and fox have an overwhelming number of positive/neutral articles compared to cnn and cnbc.", "score": 5, "replies": [{"body": "*The Guardian* bashes Musk at every opportunity. It's a bit odd because while *The Guardian* is manifestly insane with its political coverage, it's still quite good on coverage of environmental matters.\n\nThey don't even try to run the bullshit 'but EVs use more resources to produce and what about disposal of the toxic batteries?' argument that you see in some right wing media. They seem happy with the cognitive dissonance of hating on someone who has strongly moved industry in a more environmentally sustainable direction. So it's basically just hating on Musk the person, i.e. almost pure identity politics.", "score": 3, "replies": [{"body": "Yup. *The Guardian* is a great example. When I first started following Tesla I looked to *The Guardian*, expecting to find a rich source of pro-Tesla articles. I could not have been more wrong!\n\nYet clicking through the *Fox News* articles, which I expected to be totally biased and ill-informed, were instead mostly neutral to slightly positive and reasonably-enough researched (compared to other outlets).\n\nThe other thing I find interesting is that *Fox News* the website is where I noticed the neutral articles. But *Fox News* the TV channel is where you'll hear the talking heads yammering on about toxic batteries and long tailpipes.", "score": 3, "replies": []}]}]}, {"body": "The same fake news that attack the right attack Tesla.", "score": 2, "replies": []}, {"body": "Very left leaning in the US is still conservative in many other countries.", "score": 0, "replies": []}]}, {"body": "Well, I definitely don't equate right-wing with anti-Tesla... just less likely to be well informed about it.", "score": 3, "replies": []}]}, {"body": ">The debate coach is a right wing Trump supporter and yet clearly thinks the cars are vastly superior.\n\nThat is one unlikely debate coach lol.", "score": 2, "replies": [{"body": "He is a debate coach. May more likely have looked at pros and cons.", "score": 2, "replies": []}, {"body": "specialty: gaslighting", "score": 1, "replies": []}, {"body": "I do find it quite strange.", "score": 0, "replies": []}]}]}, {"body": "https://ca.finance.yahoo.com/news/exclusive-volkswagen-buy-20-chinese-050124796.html\n\nExclusive: Volkswagen to buy 20% of Chinese battery maker Guoxuan amid electric push - sources", "score": 14, "replies": [{"body": "Volkswagen gets it. Let's see if management and shareholders can still persists this approach when things get rough.", "score": 4, "replies": []}, {"body": "Shorts sneer, \"What the hell is Tesla's 'mission'?!\" Yeah, this is their mission. This is a win for Tesla and the planet. One of the biggest automakers is getting serious about EV's, at least we hope. The ID.3 software debacle is not encouraging, but for now I'll give them the benefit of the doubt. It's really hard to get EV software right, Tesla has demonstrated this with years of hard work from countless engineers.", "score": 3, "replies": []}]}, {"body": "https://finance.yahoo.com/news/foxconn-may-prove-elon-musk-050322207.html\n\nLMAO... Foxconn and FCA will create a joint-venture to build EV's\n\n> While not yet signed, they expect their 50-50 enterprise will “develop and manufacture electric vehicles and engage in IOV (internet of vehicles) business,” referencing a growing ecosystem of connected cars that share location, weather, traffic and vehicle information.\n\nThis is gonna bring a whole new meaning to the word \"bendgate\"", "score": 13, "replies": [{"body": "They just have to get Elon in the title for those sweet sweet clicks", "score": 7, "replies": []}, {"body": "The comments are generally pro-Tesla and laughing at this news, happy to see. More \"Tesla killer\" fear mongering. Pushing the same false premise that what Tesla has done is easily replicated by practically anyone else. Have people forgotten about dedication, sacrifice, and hard work? It takes that in spades along with many talented people to pull off what Tesla has done. I don't care if you pump out 5 million ICE cars a year or 500 million iPads, that doesn't give you a magic wand to mass manufacture EV's.", "score": 2, "replies": []}]}, {"body": "So uh what is this premarket trickery? Down suddenly by much", "score": 11, "replies": [{"body": "Dropped $8 in like a minute just for fun. Weird.", "score": 8, "replies": [{"body": "I'm curious as to what kind of move is required to move a stock like TSLA up or down $1.\n\nHow many millions of dollars would one have to spend to do it?", "score": 6, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "How can the share price be influenced like this when volume is low?", "score": 5, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Thanks, starting to understand it better now. So you should really not see Pre- and after market hours as a continuation of regular hours, but rather a microcosm? is that somewhat correct?", "score": 2, "replies": [{"body": "Yeah, I mean you can interpret it how you like, but today’s pre-market session volume is 250k. Compare that to the 22M we did yesterday during regular hours. Or 30M for several of the last sessions. It’s like collecting ballots from 100 people and then drawing conclusions on the election result even though 5,000 more people still have to vote.", "score": 3, "replies": [{"body": "Great analogy, i get it now", "score": 3, "replies": []}]}]}]}, {"body": "That’s what I don’t understand. 15k volume dropped the price $7?", "score": 2, "replies": []}]}]}, {"body": "Currently 145k shares were traded pre-market. So that's 74 million. Stock down 6,50. So like 11 million per $", "score": 1, "replies": [{"body": "That's all?\n\nSo any random asshole with 11 million dollars can move the stock up/down $1 ?\n\nJesus Christ, no wonder we fluctuate so goddamn much.", "score": 6, "replies": [{"body": "That's why pre-market doesn't mean anything. Last few weeks tsla traded 5 to 10 million shares in the first hour after opening.", "score": 5, "replies": [{"body": "But it sure is an indicator that people are not liking it at this price 😢", "score": -5, "replies": []}]}]}]}, {"body": "If I understand correctly, stock price is nothing else, than average price of transactions. In extreme situation if I'd sell one share for one dollar and there were no other transactions this minute, the price graph would show a crazy dip.\n\nI'm not 100% sure if I get it right though...", "score": -1, "replies": []}]}]}]}, {"body": "I'm buyin a whole bunch at open", "score": 10, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Agreed. To be fair though Amazon is still absurdly overpriced to the cash it generates. They are on a never ending challenge to keep growing their top line and potential to keep inflating the stock. \n\nI honestly wonder how long can they do it. At some point the scale will catch up to them before profits are ever made. Bezos is King though so it's a healthy portion of my mix.", "score": 2, "replies": [{"body": "yes every tech is insanely overvalued for their future prospect. If not for the cloud growth, I think Amzn will still be in 300-600 range and overvalued....\n\nAmzn and MSFT so far are two best examples of constantly being overvalued --- fundamental catches up --- stock goes even higher. Appl had some more significant pull back though.\n\nSo comparatively Tsla is way cheaper.", "score": 1, "replies": [{"body": "Msft is my biggest position outside of tsla. I think they are going to drink Amazon's milkshake soon. They also trade at 30p/e which is very reasonable for a company like them. Amazon is trading at 82 lol, yes they have a lot more infrastructure now and it will only take one year of blow it out of the park profits to even this out but they are starting to see the challenges of their scale.", "score": 2, "replies": []}]}, {"body": "Amazon has been profitable for years now. Telsa on the other hand...", "score": -1, "replies": [{"body": "Being profitable doesn't mean you arent overpriced.\n\nIf Amazon makes 1B a year but trades at 100B...is 1% return on money worth it? That's essentially what they are today. They made 11B in 2018 at around an 800B market cap...1.5%", "score": 1, "replies": [{"body": "Not sure what that has to do with the simple fact I stated. Amazon has turned a profit for years now. Tesla has yet to post an annual profit. \n\nOf those two, I'd invest in Tesla over Amazon because I perceive Tesla to have more upside.", "score": 0, "replies": [{"body": "Mixing up my two thread haha. Agreed 100%. Its also the reason I have 5% holdings in things like workday, Zen and ui.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Interesting read on petition inquiry:\n\nhttps://twitter.com/valueanalyst1/status/1218218879144681479?s=21\n\n\nTSLA \n\" independent investor, Brian Sparks, submitted a petition to the National Highway Traffic Safety Administration\"\n\n\"Sparks is currently shorting Tesla stock, but has hedged his bets and been long shares of Tesla in the past.\"", "score": 11, "replies": [{"body": "Wow... like wtf is up with this... some people are so just garbage.", "score": 10, "replies": []}, {"body": "He's probably the type of guy that would start this petition and then post an article on Seeking Alpha like \"Tesla under massive investigation for shoddy quality control\" or something like that, rofl.", "score": 8, "replies": []}, {"body": "Still closed above 510, lol.", "score": 9, "replies": []}, {"body": "Lol.", "score": 4, "replies": []}]}, {"body": "https://www.bloomberg.com/news/articles/2020-01-17/tesla-registrations-climb-again-in-china-bucking-market-malaise\n\nSurely this can get as much attention in the news as the “decline in registration in Cali” article did right?", "score": 19, "replies": [{"body": "I hope so", "score": 5, "replies": []}, {"body": "An article published 1-3 weeks before all December bought cars have a chance to be registered and counted. I can believe deliveries were down in California because of some market saturation and a focus on international deliveries, but not by 50%.", "score": 3, "replies": []}]}, {"body": "Is this the best you can do bears? With your fake investigations and deliveries fake news?", "score": 19, "replies": [{"body": "I hope bears have lube", "score": 10, "replies": []}]}, {"body": "_\"remain calm, it's only a 1% jump...\"_", "score": 9, "replies": [{"body": "“WE GOING TO THE MOON 🌝”\n\nAll of WSB now...", "score": 12, "replies": [{"body": "SpaceX is going to the moon. The boring company is hitting rock bottom.", "score": 7, "replies": []}, {"body": "It was something like 5k shares and then 2k back down. Lol.", "score": 3, "replies": []}]}, {"body": "Yeah about that 1% dive.", "score": 2, "replies": [{"body": "Still within my trailing stop. Still go for launch.", "score": 1, "replies": []}]}]}, {"body": "The moment we touch 0.00 % some algorithm is selling back down.\n\nBig boi institutions don’t want to see this go up anymore 😩", "score": 10, "replies": [{"body": "See, Elon was right about AI too... lol - stupid algorithm", "score": 2, "replies": []}]}, {"body": "Elon is back to twitter meme ( [https://twitter.com/elonmusk](https://twitter.com/elonmusk) ) after 6 days --- hopefully a sign that Q4 finance is done and date to be announced...\n\nHere is something just for fun from his twitter 7 hours ago:  **O valley of plenty**\n\n[https://www.reddit.com/r/netflixwitcher/comments/efg4dq/what\\_does\\_o\\_valley\\_of\\_plenty\\_means\\_in\\_the\\_song/](https://www.reddit.com/r/netflixwitcher/comments/efg4dq/what_does_o_valley_of_plenty_means_in_the_song/)\n\nSo, toss a coin to Elon, a rich valley here we go!  \n(Disclaimer: do not invest just because of a twitter...)", "score": 8, "replies": [{"body": "toss a coin to your witcher o earnings of plenty", "score": 3, "replies": []}]}, {"body": "Friday AH flash sale! Yes!!\n\nHowever, unless the bears try harder from now til Tuesday, the price is probably gonna come back even higher before market opens on Tuesday...", "score": 9, "replies": []}, {"body": "[https://twitter.com/ValueAnalyst1/status/1217971654997004289](https://twitter.com/ValueAnalyst1/status/1217971654997004289)\n\nAdam Jonas didn't project for any Cybertruck sales from 2020-2030.\n\nDoes anyone think it would be possible for Elon to tell Jonas to screw off and not let him at the earnings call / investor day events? I'm usually very skeptical about these things, but it's Elon Musk, and he can do what he wants.\n\nHe combined Model Y and Model 3, yet leaves S and X separate. Roadster is included for some reason, but Semi is not...", "score": 16, "replies": [{"body": "That chart is pretty hilarious ahahaa", "score": 7, "replies": [{"body": "yeah, couldn't even be bothered to make a distinction between 3 and Y... you'd think investors find that difference somewhat important.", "score": 5, "replies": [{"body": "Totally agree. That distinction is huge. Not a very nuanced analysis.", "score": 1, "replies": []}]}]}, {"body": "He shows Roadster on the legend but doesn't have any data for it?\n\nThis has to be a joke.", "score": 6, "replies": []}, {"body": "He already banned him from the calls.", "score": 6, "replies": [{"body": "are we sure about this? on the previous call somebody from Morgan Stanley indeed replaced Jonas but the IR guy still introduced him as Adam Jonas IIRC?", "score": 4, "replies": [{"body": "I think that was a mistake but I'm 99% sure he's been banned. I remember discussing it in this sub quite a lot. It was right after the 10$ pt.", "score": 1, "replies": []}]}]}, {"body": "https://www.tipranks.com/analysts/adam-jonas\n\nThis is great... his 49% success rate (laughable in itself) ranks him as #924 out of 5,850 analysts.  I don't even wanna know how bad you'd have to be to be ranked, say, #1500 or #2500.", "score": 2, "replies": [{"body": "49% means you're better off flipping a coin.", "score": 12, "replies": [{"body": "A coin that has 60% of being heads too...", "score": 1, "replies": []}]}, {"body": "His parents like to brag that he's right practically the majority of the time.", "score": 4, "replies": []}, {"body": "Accuracy of predictions may have nothing to do with their profitability.", "score": 2, "replies": []}]}]}, {"body": "These FUD cycles are so predictable. Every time in the run-up to earnings you'll see a bunch of articles coming out one after the other attempting to drive the stock down. It is literally like every fucking time like clockwork lol.", "score": 15, "replies": [{"body": "It’s almost like a big run up gets the financial media’s attention....", "score": -2, "replies": []}]}, {"body": "January 29th confirmation", "score": 16, "replies": [{"body": "I guess I should have hit refresh before posting my comment saying the same thing.  :)", "score": 6, "replies": [{"body": "The scroll is in your favor", "score": 2, "replies": []}]}, {"body": "Where", "score": 5, "replies": [{"body": "Nevermind I see it", "score": 3, "replies": []}, {"body": "https://www.reddit.com/r/teslainvestorsclub/comments/eq7t2q/january_29th_confirmation_q4_report/?utm_medium=android_app&utm_source=share", "score": 4, "replies": [{"body": "Noice", "score": 3, "replies": []}]}]}]}, {"body": "Seems like we are back on track today. Feel sad that my moneys is not on my broker yet.", "score": 8, "replies": []}, {"body": "Ugh, what a boring day", "score": 9, "replies": []}, {"body": "1 hour left...\n\nIf we close at -0.5% I'll be a very happy camper.", "score": 8, "replies": [{"body": "Maintaining 500 is very important in my mind, very happy to see the shorts fail to push it down today. Hopefully we get good news over the weekend and shoot up next Tuesday!", "score": 3, "replies": []}]}, {"body": "Took some time today to read over master plan deux from Elon. Pretty cool stuff. Would recommend if you haven’t read it yet!", "score": 9, "replies": []}, {"body": "I see your premarket and raise you another share.", "score": 6, "replies": []}, {"body": "5 minutes until a 3 day weekend boiz", "score": 7, "replies": []}, {"body": "Tsla released Q4 earnings date last year on Friday January 18th, 2019 to be Wednesday Jan 30th. Announcement in 2018 was on Thursday January 25th to be February 7th. \n\nHoping for announcement of Q4 date today.", "score": 13, "replies": [{"body": "I mean who cares when they announce or what date?\n\nWhy would it even matter if it’s a day later or sooner", "score": 5, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "\\^-- real reason right here.", "score": 12, "replies": []}]}, {"body": "Generally good news = earlier, bad news = later.", "score": -1, "replies": []}]}]}, {"body": "Yes! Closed above 510, hope some options expire for shorts and they have to face the pain! :)", "score": 13, "replies": [{"body": "Suck it, Trebek! W00t!", "score": 6, "replies": []}, {"body": "Unless I'm mistaken post market and even post post market matter for options contracts.", "score": 5, "replies": [{"body": "Post post market... is it possible to learn this power?", "score": 3, "replies": [{"body": "Typical after market runs to 6 but some folks do have the ability to trade even after that. There's essentially 24 hour trading available if you are one of the top Dawgs.", "score": 4, "replies": [{"body": "Wow, good to know - thanks!", "score": 3, "replies": [{"body": "Just to elaborate options actually expire 11:59 est Saturday. So unless it bounces 510 and 505 will be out of money.\n\nThe odd thing that I never understood is that the volume at those times is so low the stock can easily be bought up a dollar or two. Why wouldn't someone just do this if they really needed it to strike.", "score": 1, "replies": []}]}]}, {"body": "[Not from a Jedi](https://youtu.be/HT0OFF4x5HE)", "score": 3, "replies": []}]}]}, {"body": "Next week we will have the countdown to ER. I think it’s going to be interesting :)", "score": 1, "replies": []}]}, {"body": "This is nonsense. I already did my rain dance and watched Hulu in my Tesla this morning. I even shouted all hail the musk. What more can I do. Just give me my money.\n\n10:35 down 2%\n\n11:18 down 4.55%\n\n1:13 down 9%, after 18% the last two days.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Bro just tell me how many I need to buy to break some resistance.", "score": 3, "replies": [{"body": "take more than all of us to break it.  hopefully tesla will trade sideways for a bit and get out of the overbought territory.  it has been there since 12/13/19.", "score": 1, "replies": [{"body": "I said. Give. Me. A. Number.\n\nJk", "score": 2, "replies": [{"body": "lol, okay fine.  you need *30m volume of buying today :D .\n\n\n*note* 30m is a random # i pull out of my ass.", "score": 2, "replies": [{"body": "Okay so I'm gonna set my bot to buy sell 1000 shares back and forth every second until close. Problem solved.\n\n #marketmanipulators #wsb #tsla694.20 #lambos #btc #forex #tomars #marsone #popmolly", "score": 3, "replies": [{"body": "1. spawn up some containers and serverless instances. \n2. set those serverless instances to autogrow as needed.  \n3. recode your bots to spawn multiple threads.\n4. we all profit from your effort!", "score": 1, "replies": [{"body": "Perfect I'll just need to also buy every short term Tesla option currently available to pay for the azure instances and just hope to not blow up during a sell and not a buy.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "This is awfully hard to estimate accurately (only Tesla has the data), but from multiple sources AWD and P models appear to make up at least 50% of the global mix - maybe more.\n\nASPs are thought to be stable at around $50,000.", "score": 4, "replies": []}]}, {"body": "What’s happening AH? 500?", "score": 5, "replies": [{"body": "Yeah, I’ve been watching it. I haven’t seen any news.", "score": 4, "replies": []}, {"body": "This better be a glitch tf lol", "score": 2, "replies": [{"body": "Yeah idk going back a bit", "score": 3, "replies": [{"body": "Tesla stock be like say sike rn", "score": 3, "replies": [{"body": "We better close AH green", "score": 4, "replies": []}]}]}]}]}, {"body": "WTF just happened in after hours? We down to 500", "score": 6, "replies": [{"body": "Going back up right now.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Or Cry-o in case it goes the other way.", "score": 4, "replies": []}, {"body": "Is this a feature request for Tesla?", "score": 1, "replies": []}]}, {"body": "Word on the street is that the Model 3 is getting an upgrade when the Model Y comes out", "score": 9, "replies": [{"body": "Source?", "score": 7, "replies": [{"body": "Third Row Podcast twitter... AKA Steve Jobs Ghost (Omar Qazi)\n\n\nhttps://twitter.com/thirdrowtesla/status/1217887915709091840?s=21", "score": 2, "replies": [{"body": "take everything what that guy says with about 5 pounds of salt", "score": 10, "replies": [{"body": "Seriously. How are they sitting on that interview yet feel it's appropriate to tweet shit like this? Super unprofessional.\n\nAlthough power tailgate on Model Y...they have my attention!", "score": 7, "replies": [{"body": "It's entirely possible Tesla gave them the choice of nerfing the hell out of the interview or waiting until after earnings.\n\nTesla could also just be sitting on it.\n\nI doubt Third Row is holding it back unilaterally.", "score": 2, "replies": [{"body": "I understand that there must be good reasons and we'll probably find out later, but they should be more transparent. The part about editing wasn't true and at this point, they're just messing with people.", "score": 4, "replies": [{"body": "Yeah.  They probably hoped it Tesla would allow them to release it a lot sooner.", "score": 2, "replies": []}]}, {"body": "Gali mentioned in one of his recent videos that they are waiting for the okay from Tesla to release it.", "score": 1, "replies": []}]}, {"body": "To be clear: I’m not saying that because of the whole interview thing... but Omar is just... too hyper-bullish for my taste really.  A lot of those tweets (including his former account) are very cringeworthy. \n\nFuck Aaron Greenspan from Plainsite for abusing the system to get him off Twitter though.  That was even worse than what Omar gets up to.", "score": 2, "replies": [{"body": "I'm with you. I used to subscribe to a bunch of those hyper-bulls including Omar and it was just too much. Cringeworthy is too light of a word, actually. We'll need one of those German compound words to describe it accurately 😄", "score": 1, "replies": [{"body": "I still follow them on Twitter but you just have to know how to interpret those tweets... even as a bull: just be skeptical 🤷‍♂️", "score": 1, "replies": []}]}]}]}, {"body": "He’s erratic but close with Elon and Tesla", "score": 1, "replies": []}]}]}]}, {"body": "I'd rather listen to Sandy Munro saying, he's pretty sure MiC M3 construction is seriously upgraded vs MiUS. He thinks the upgrade is the reason of lower price, rather than just local  costs.  \nsource:  [https://www.youtube.com/watch?v=\\_uRwZRPQ8RE](https://www.youtube.com/watch?v=_uRwZRPQ8RE)", "score": 4, "replies": []}, {"body": "should i cancel my order... :/", "score": 0, "replies": [{"body": "Tbh unless you need a car now I’d wait until Battery and Powertrain investor day", "score": 3, "replies": [{"body": "i don't even have a car.. i'm getting tired of using mother's car lol", "score": 4, "replies": []}]}]}]}, {"body": "Looks like the days going to wrap up with less then 13M volume compared to a 21M average. Settling in before the long weekend and ER looks like.", "score": 5, "replies": []}, {"body": "I have options that expire next week for $522... chances of breaking even?", "score": 5, "replies": [{"body": "I'm just hoping for another $47 gain on ~~Monday~~ Tuesday like last week. It's going to be a bummer working on MLK day with no Tesla going on.", "score": 3, "replies": [{"body": "True - unfortunately I'll have to be productive this Monday, lol... but probably will keep checking here anyway", "score": 3, "replies": []}, {"body": "Yes I've been outta options for a bit and figured I'd make a couple hundred on the dip to 520.... big mistake", "score": 2, "replies": []}]}, {"body": "Depends how much you paid for them.  If it was like $50, possible, but not likely.\n\nOr did you just mean hitting the strike?", "score": 2, "replies": [{"body": "I'm down about 50% lol - paid $1800", "score": 2, "replies": [{"body": "Assuming you bought 1 option, then it has to hit $540 to break even.   I mean it could happen, the stock has been on a tear and I wouldn't really consider the last 3 days definitive proof that it's over.  Keep in mind that there are only 4 trading days next week though.", "score": 4, "replies": [{"body": "Yes probably not happening.  I bought two. \nOh well.", "score": 2, "replies": [{"body": "That's actually better for you then, because it only has to hit $531.", "score": 2, "replies": []}]}]}]}]}, {"body": "F", "score": 1, "replies": [{"body": "LOL made $600/option (1200 total). Cant believe it.  Pure luck", "score": 2, "replies": [{"body": "Nice dude!", "score": 1, "replies": []}]}]}]}, {"body": "Maybe a dumb question but I’m just curious - whenever I tried to buy stocks in AH on robinhood on a market order, it never fills. What’s up with that? Is it only other broker platforms where AH and premarket transactions are possible?", "score": 5, "replies": [{"body": "A lot of brokerages only let you buy until 6", "score": 3, "replies": [{"body": "Thanks! Any idea of any from 6-8? Can’t seem to phrase this correctly on google lol", "score": 1, "replies": []}]}, {"body": "You may have to do it as a limit order", "score": 3, "replies": []}, {"body": "Any platform I’ve ever used required a limit order AH for your protection.", "score": 3, "replies": [{"body": "Thanks man - wym like big price swings from low volume?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I am targeting upwards of $700 after earnings. How many did you buy for June? If you bought 1, I would sell after the battery investor day so you have 2 opportunities for growth. Also, when buying the 2022 options I suggest holding onto them until at least January 2021. You will be paying a lot for those options. If you have limited capital I highly suggest January 2021 or earlier. You can buy a lot more contracts compared to 2022.\nOptions profit calculator .com is the best tool for me.", "score": 5, "replies": []}, {"body": "If you want to keep your calls and you're bullish, you can sell a higher-strike call for the same date in order to form a bullish call debit spread.\n\nSince you've sold a contract with similar theta, you can hold it much closer to expiration without suffering from theta decay.\n\nThis also has the advantage of generating income now.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I don't think we'll get anywhere near $1000 within six months, so you could be more bearish there. Q1/Q2 are supposed to be weak according to Elon.", "score": 1, "replies": []}]}]}]}, {"body": "I just went over to realtesla reddit.\n\nHow negative can these people be? Like what’s their end goal?", "score": 13, "replies": [{"body": "> Like what’s their end goal?\n\nMusk needs to be jailed before they can lead a fulfilling life", "score": 14, "replies": [{"body": "You mean Musk needs to be jailed before they can move on to the next scapegoat for why their lives are miserable", "score": 1, "replies": [{"body": "Hah, you’re probably not wrong", "score": 1, "replies": []}]}]}, {"body": "I find it pretty fun & quality posts sometimes.\n\nSome may not agree with me, but I like both sides of a coin...", "score": 5, "replies": [{"body": "Yeah, sometimes there's good stuff in there.\n\nIt's like someone dropped silver dollars in a particularly dirty pig sty, in 8\" deep \"mud\".\n\nNah, not really.  It's good to check it out occasionally.", "score": 2, "replies": []}, {"body": "That's a different coin with two tails over there.", "score": 3, "replies": []}]}, {"body": "tldr; ?", "score": 2, "replies": [{"body": "💩", "score": 8, "replies": []}]}, {"body": "Same lol. I do actually think most of them have mental problems. The amount of pent up rage and hate they exhibit can't be healthy. Not even joking, so it's probably not nice to make fun of them while we get rich and they get angrier and more upset every day...even though it is fun lol.", "score": 4, "replies": []}]}, {"body": "*Car buyers shun electric vehicles not named Tesla. Are carmakers driving off a cliff?*\n\nhttps://www.latimes.com/business/story/2020-01-17/ev-sales-fizzle", "score": 13, "replies": [{"body": "a CEO of a legacy OEM has a real tough decision in front of them. do they continue ice, something that they know and excel at or do they plunge into EV (future) which they have no expertise, have to sink massive capital, have to get new talent (basically reinvent themselves) ?\n\nthey are taking the cautious approach understandably. this is the result - substandard EVs that no one wants. VW is going all in - an existential move. Let's see if they do better", "score": 4, "replies": [{"body": "Too bad ceos are incentivized by short term financial target to get the max bonus. They are there for a good few year runs and bag tens of millions and get out.", "score": 3, "replies": []}]}, {"body": "I don't have all the info but I'm fairly certain the owner of the LA Times is anti-EV. I believe he owns an energy company that competes with Lithium ion batteries.\n\nI'm at work so can't dig too deep right now...", "score": 3, "replies": []}, {"body": "While not Tesla, news I found this article interesting so figured I’d share it.", "score": 3, "replies": [{"body": "Good bot", "score": 9, "replies": [{"body": "Are you sure about that? Because I am 88.67125% sure that flufferbot01 is not a bot.\n\n---\n\n^(I am a neural network being trained to detect spammers | Summon me with !isbot <username> |) ^(/r/spambotdetector |) [^(Optout)](https://www.reddit.com/message/compose?to=whynotcollegeboard&subject=!optout&message=!optout) ^(|) [^(Original Github)](https://github.com/SM-Wistful/BotDetection-Algorithm)", "score": 7, "replies": [{"body": "88.67125%?!  \n  \nLOOOOOL u/flufferbot01, in machine learning terms, you're basically probably by a bot.", "score": 4, "replies": [{"body": "Lol yea I don’t know about that. But have traveled to Spain recently, because I hear KAYAK has the best search returns. You should try KAYAK today!", "score": 9, "replies": [{"body": "Hmm seems smarter than average bot. If you start recommending me things that I already bought, I will know for sure that you are a bot.", "score": 3, "replies": []}]}]}, {"body": "Bad bot", "score": 4, "replies": [{"body": "!isbot WhyNotCollegeBoard", "score": 1, "replies": [{"body": "I am 101% sure whynotcollegeboard is a bot.\n\n---\n\n^(I am a neural network being trained to detect spammers | Summon me with !isbot <username> |) ^(/r/spambotdetector |) [^(Optout)](https://www.reddit.com/message/compose?to=whynotcollegeboard&subject=!optout&message=!optout) ^(|) [^(Original Github)](https://github.com/SM-Wistful/BotDetection-Algorithm)", "score": 2, "replies": [{"body": "Mighty suspect...", "score": 2, "replies": [{"body": "All you bots sound alike to me", "score": 2, "replies": [{"body": "Well we are all just trying to interfere with the election. It’s our prime directive.", "score": 1, "replies": [{"body": "Could you leave a remote port open for me to access? We’ll communicate later about when exactly I’d want to access said port...", "score": 1, "replies": [{"body": "That’s what port 194 is for.", "score": 1, "replies": [{"body": "Is IRC really still a thing? #gettingold", "score": 2, "replies": [{"body": "Yes, so do BBS boards and usenet.", "score": 1, "replies": [{"body": "Quick question: emacs or vi?", "score": 2, "replies": [{"body": "Emacs\n\nVi is for masochists.", "score": 1, "replies": [{"body": "Good god... this is why we can’t ever be friends", "score": 2, "replies": [{"body": "Python or Ruby?", "score": 1, "replies": [{"body": "Ugh, I had my Ruby phase... totally loved (and actually still do!) the language but GTFO with Rails!  Ruby and Sinatra is a _really_ nice framework.  But I went into that about 8 years ago because I was sick of my work environment (.NET and C#).  Nowadays, with .NET Core I’m actually quite happy with C# and .NET.\n\nBut if I were to play around with another language, I’d definitely go with Python these days.", "score": 1, "replies": [{"body": "Ew you’re a Ruby hippy. Yea we can never be friends.\n\nC# sucks we all want Visual Basic back. C for life, screw C#.", "score": 2, "replies": [{"body": "I enjoyed this walk down software development memory lane. I was a VB.net jockey who also wrote a crap ton of SQL until 2010 when I switched careers to music teacher.  I remember reading about this cool new Ruby on Rails thing on my way out the door. :)", "score": 2, "replies": []}, {"body": "How the hell can you praise C and Visual Basic in the same comment? That literally makes _zero_ sense. (Oh wait, to cater to your VB nature I’ll say that makes 1 sense!)\n\nAlso: if you like Python, you should at least appreciate another person’s appreciation for the dynamic nature that Python and Ruby share (and which is _extremely similar_)", "score": 1, "replies": [{"body": "1: Because Visual Basic was awesome. \n\n2: Ruby is for the hippies, and artsy people. Python is for conservative people, and scientists. I didn’t make these rules, it’s just how it is.", "score": 1, "replies": [{"body": "As for 1: it truly never was awesome.  The language sucked and Reference Counting sucked even more.  I only used it because I got out of school right after 9/11 and the only company willing to hire a kid fresh out of school was using VB :(.  I spent 3 years cursing it. \n \nAs popular as Python is right now, I will concede that its indentation rules indeed fit with the bearish mindset :p", "score": 2, "replies": []}, {"body": "Tell me though: you clearly have some background in software development... how did you make the switch to the finance world?", "score": 2, "replies": [{"body": "Actually my last position was placing fiberglass mats on the top of the battery packs. So I tried to automate the placement and bonding of the mats to the top of the battery packs. It was really an incredibly difficult machine to make work. \n\nSo we had a super-complicated machine. Using a vision system to try to put a piece of fiberglass on a battery pack. …\n\nThe line kept breaking down because the robot would frequently just fail to pick up the fiberglass, or put it in a random location. Shortly after that there was a round of layoffs.", "score": 1, "replies": [{"body": "..?  You worked at Tesla?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Good bot", "score": 1, "replies": []}]}]}]}, {"body": "I think there is real room for carmakers to sell cheap short range electric vehicles as things transition.  \n\nMy guess is that Tesla ends up licensing various parts of its technology to other automakers and their own internal expertise helps make that easier.", "score": 2, "replies": [{"body": "Lol that ship has sailed", "score": 3, "replies": [{"body": "They could end up doing that to avoid gaining newer and more nimble competition", "score": 1, "replies": [{"body": "They do that by constantly focusing on improvement which further advances their lead.  The ‘competition’ has proven over the last 90 years they have no interest in anything but blocking new autos out.  There is a reason tesla is the only new car company in a long time.", "score": 2, "replies": [{"body": "I wouldn't be surprised if say Google bought an automaker assuming it went bankrupt", "score": 0, "replies": [{"body": "I know it’s not comparable, but considering the difficulties they had integrating Motorola, I’d say the odds of them doing even worse with an automaker are quite a bit higher even.", "score": 1, "replies": [{"body": "That's a fair point.  I think they struggle to do anything that won't make their employees look really smart.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "> I think there is real room for carmakers to sell cheap short range electric vehicles as things transition.\n\nBatteries are too expensive. Tesla was smart to start at the luxury end and move its way down to allow them time to scale battery production for the Model 3. You have to remember the original Model S battery was north of $30k.", "score": 1, "replies": []}]}, {"body": "> Are carmakers driving off a cliff?\n\nLike Thelma & Louise", "score": 2, "replies": [{"body": "Cliffy Cat and his fluffer", "score": 1, "replies": [{"body": "While I like Clifford, I’m not sure I’m his fluffer. If anything I spend far more time with this community. But I will say I like and appreciate both communities, both have been welcoming.", "score": 4, "replies": []}, {"body": "Cliffy’s having a bad day apparently.  Maybe it’s because that sub’s growth has completely stagnated, maybe it’s because a large part of the comments over there are about what happens on _this_ sub, or maybe it’s because of some biological reason I probably shouldn’t be speculating about 🤷‍♂️", "score": 5, "replies": []}]}]}, {"body": "wow its from Russ Mitchel im shocked", "score": 2, "replies": []}, {"body": "The article says that all EVs are money-losers for manufacturers, including Tesla.\n\nAFAIK Tesla’s margins are nice/above average. The author may be referring to Tesla not making YOY profit, but if you invest enough, you can always spend more than you earn. Stashing money is nice, but not a recipe for growth.", "score": 1, "replies": [{"body": "That’s due to the way Tesla calculates margins.\n\nIf Capex dropped in 2019, why will Tesla still have a yearly loss if it’s margins are so high?\n\nTesla spends less on R&D than other automakers. So why does it struggle with profits, if it’s margins are so high? What is on the Opex side that’s eating away all the money they should be bringing in?\n\n(Margins do not equal profits)", "score": 1, "replies": []}]}]}, {"body": "My best case scenario for the day was -0.5%.\n\nWorst case scenario -3.5%.\n\nWay closer to my optimist one than the pessimist. Not a terrible day by any stretch of the imagination.", "score": 7, "replies": [{"body": "Yeah, I was mentally prepared for a lot worse after the December / early Jan we’ve had, but this thing is stubborn af! Won’t back down.", "score": 3, "replies": []}]}, {"body": "17 Jan - 08:00:17 AM  [RTRS] - U.S. AUTO SAFETY AGENCY REVIEWING PETITION SEEKING FORMAL INVESTIGATION INTO 500,000 TESLA VEHICLES FOR SUDDEN UNINTENDED ACCELERATION -- GOVERNMENT DOCUMENT", "score": 25, "replies": [{"body": "Please don't let negative comments dissuade you from posting things like this in the future.  A lot of us _do_ value that.", "score": 11, "replies": [{"body": "No worries. I just got the post from twitter and posted here.", "score": 5, "replies": [{"body": "It's good to know that the news is out there. I'm just shocked that anyone still takes \"unintended acceleration\" claims seriously. [Malcolm Gladwell did a great podcast about it](http://revisionisthistory.com/episodes/08-blame-game), but essentially all cases of claimed \"unintended acceleration\" are false. \n\nIt's a simple physical fact that every car made around the world has brakes that can easily bring the car to stop even with the accelerator fully activated. That means that for a car to do anything other than lurch forward for an instant two things have to happen:\n\n* The accelerator has to get stuck down\n* The brakes have to fail\n\nThese are the two critical parts of a car's control systems, and they share almost no overlap in their design. The chances of a serious error in either one by itself are slim. The chances of a serious failure in both at the same time are almost non-existent. The chances that any model would only have its brakes fail at the same time its accelerator got stuck on is basically zero, it would be an incredible statistical fluke.\n\nIf there were actual cases of unintended acceleration, then we should see cases where that model of car had its brakes fail, and also separate cases there the accelerator failed. Only if both of those existed sometimes would we then occasionally cases where both happened to fail together. \n\nThere's only one common factor that could plausibly cause both brakes and acceleration to fail, at the same time. And that's the human behind the wheel. Humans behind the wheel are responsible for the overwhelming majority of all accidents, so it shouldn't be a surprise that they're also the ones responsible for unintended acceleration. It may be unintended, but in essentially all cases what's happening is that the person *intended* to hit the brake, pressed the accelerator instead, and when the car accelerates, they press the \"brake\" harder, which just makes the situation worse.\n\nPeople causes terrible accidents and deaths because they make stupid mistakes. It happens all the time, sometimes that mistakes is pressing the wrong pedal. And it's much easier to blame the car then to think that I accidentally drove it into traffic.", "score": 12, "replies": []}]}]}, {"body": "More FUD. It's reviewing a petition to investigate. It has several investigations going already and they always rule in favor of Tesla. REVIEWING a PETITION to investigate people... MAYBE WE'LL CHECK IT OUT...", "score": 10, "replies": []}, {"body": "All planned by FUD. Just a petition, nothing else \n\nJust look at this as another buying opportunity.", "score": 9, "replies": []}, {"body": "It's just a petition, probably nothing. But it may reach headlines and cause another FUD dip", "score": 5, "replies": []}, {"body": "Seriously, wtf is going on with people downvoting this top-level post and some of the objective and thoughtful posts below it?\n\nLet's keep our fanboyism in check.", "score": 14, "replies": [{"body": "I didn't downvote it, but posting something like this in all-caps, with no link to the reporting source or original source, may look suspicious to some people.", "score": 8, "replies": [{"body": "if it's all caps it's usually a copy/paste from a Bloomberg terminal, no problem at all with those things being posted here.  In fact, I welcome it (since those terminals generally get scoops before other media outlets start showing it)", "score": 6, "replies": []}, {"body": "Yeah I upvoted, but caps lock isn't necessary", "score": 4, "replies": []}, {"body": "That's probably a direct copy and paste", "score": 2, "replies": []}, {"body": "https://www.autonews.com/regulation-safety/nhtsa-review-petition-seeking-defect-probe-500000-tesla-vehicles", "score": 3, "replies": []}, {"body": "Yeah it just seems like fud spam, I downvote if there is no source.", "score": 3, "replies": []}]}, {"body": "Yeah I just got downvoted to hell for my comment haha.", "score": 2, "replies": []}]}, {"body": "Okay, I've read the article.\n\nThere are only 123 cars involved in this.\n\nHow the fuck do they claim a 500,000 car investigation from a 123 car problem that could literally be fixed with an over the air software update?\n\nIf this were a legacy auto company, I'd get the panic, because they'd have to do a recall. Tesla doesn't have to recall shit. All they have to do is push a software update for free.", "score": 10, "replies": [{"body": "Just to be clear: there is no confirmed issue. Most likely these are 123 people who mistakenly pressed the wrong pedal.", "score": 12, "replies": [{"body": "Fortunately Teslas are black boxes on wheels, so everything is logged and can be checked if need be", "score": 8, "replies": [{"body": "Exactly. This is easily refuted and many of these cases likely already were with vehicle logs. Tesla even put out \"obstacle aware acceleration\" to try to address this very human issue. This is just another media circus. People want to fear monger that Teslas will suddenly just accelerate because something something scary autopilot something something. There are like 750,000 Teslas on the road worldwide now and 200 people derped and thought the accelerator was the brake. It's statistics.", "score": 3, "replies": []}]}, {"body": "One of the tesla \"hackers\" has helped review data of several unintended-acceleration Teslas that got into accidents. I believe every time, he found it was the driver's foot on the pedal combined with the driver freaking out.", "score": 5, "replies": []}, {"body": "Ohhh that's right.\n\nI get how you can get KO'd, not remember shit, and think you were doing the right move, when in fact you were not.", "score": 2, "replies": []}]}]}, {"body": "They are looking at 500,000 vehicles because that's how many fall in the \"defected\" range which is defined by 127 vehicles involved in this incident. There are by no means 500,000 vehicles involved in the \"unintended\" acceleration.", "score": 3, "replies": [{"body": "I've always wondered what kind of fault tolerance design goes into Tesla cars.\n\nYou'd think from the guy that launches rockets as his other primary job he'd be pretty damn solid on the need for complete fault tolerance (ECC memory & processors, buses when possible, etc)\n\nA substantial number of everybody's \"computer froze/crashed/blue screened\" errors aren't software bugs at all, just bit flips from cosmic rays and the like.", "score": 2, "replies": []}]}, {"body": "I think of all Auto mfg's Tesla is in the best position here as they can pull data and catagorically prove this. If there was to be an issue they have OTA for fixing.\n\n&#x200B;\n\nMr FUDster will FUD.", "score": 2, "replies": []}, {"body": "[Reuters article](https://www.reuters.com/article/us-tesla-probe/us-will-look-at-sudden-acceleration-complaints-involving-500000-tesla-vehicles-idUSKBN1ZG1IL) is written like bullshit.\n\nIt has a hard transition into the OTA update to prevent more fires and another hard transition into a crash related to autopilot. There is no mention of the period for these complaints. Did they all happen same day? I initially was thinking that there was some kind of hack lol. \n\nReading other articles I was confused - I couldn't tell if people were even in the cars. Something along the lines of car was parked, windows were up, doors were locked, car drives forward into another car... where was the person? Were they summoning it? Using autopark? Do they have a setting enabled that has the car start going when ya take the foot off the brake (I've never used this, Creep I think it is called)?\n\nThe coverage for this is so fucking poorly executed that I feel like it's all bullshit. If they do investigate with the information provided by these articles they're gonna have no choice but to throw it out.", "score": 2, "replies": []}, {"body": "How serious is it?", "score": 1, "replies": [{"body": "Extremely. Bankwupt EOD", "score": 2, "replies": []}]}, {"body": "Link?", "score": 1, "replies": []}, {"body": "Here’s the link https://www.google.com/amp/s/mobile.reuters.com/article/amp/idUSKBN1ZG1IL", "score": 1, "replies": [{"body": "Non Google Amp link 1: [here](https://www.reuters.com/article/us-tesla-probe-idUSKBN1ZG1IL) \n \n\n \n --- \n \n^^I ^^am ^^a ^^bot.  ^^Please ^^send ^^me ^^a ^^message ^^if ^^I ^^am ^^acting ^^up.  ^^Click ^^[here](https://medium.com/@danbuben/why-amp-is-bad-for-your-site-and-for-the-web-e4d060a4ff31) ^^to ^^read ^^more ^^about ^^why ^^this ^^bot ^^exists.", "score": 1, "replies": []}]}, {"body": "Just another opportunity to buy!", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "This is a petition", "score": 5, "replies": [{"body": "As I said I believe it is grounds \"for considering an investigation\"", "score": 2, "replies": []}]}]}, {"body": "Idiotic that Reuters runs this as a news article. Guilty until proven innocent...", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[link](https://finance.yahoo.com/news/u-review-petition-seeking-formal-131311695.html)\n\n>WASHINGTON (Reuters) - The National Highway Traffic Safety Administration (NHTSA) said Friday it will review a petition asking the agency to formally investigate 500,000 Tesla Inc models over sudden unintended acceleration reports.\n\n>The petition covers 2012 through 2019 model year Tesla Model S, 2016 through 2019 Tesla Model X, and 2018 through 2019 Tesla Model 3 vehicles the agency said. The petition cites \"127 consumer complaints to NHTSA involving 123 unique vehicles. The reports include 110 crashes and 52 injuries,\" the agency added. Tesla did not immediately comment Friday.\n\nIt's only 123 vehicles. This kind of review has come up before and is not uncommon among all automakers. I'm not overly concerned.", "score": 4, "replies": []}]}]}, {"body": "Maybe they'll just drop the earnings report with no warning, is that possible", "score": 10, "replies": [{"body": "If I had to guess I'd say it is legally possible. Likely the entire earnings report is a convention, and the SEC filing the only real requirement. But I dunno.\n\nQ3 2018 they gave the date maybe a couple days before releasing. All the shorts have PTSD from that one.", "score": 8, "replies": [{"body": "If they dropped right now they are reporting wed after close, where do you think stock would finish today?  Id say 520", "score": 3, "replies": [{"body": "Heh heh I hope so", "score": 1, "replies": [{"body": "They should announce soon. It’s going sideways, waiting for some kind of catalyst. Announce date today for Tuesday or Wednesday AH.", "score": 5, "replies": []}]}, {"body": "Are you said Porzingus got traded", "score": 1, "replies": [{"body": "Wish they got something for him.  Glad he’s in a good org now.", "score": 1, "replies": []}]}]}]}]}, {"body": "So what are we looking at today?", "score": 3, "replies": [{"body": "Today is the weekly options expiration day. A lot of calls and puts are on the line. Bears were not able to push the price down to $500 yesterday and pre market is up, so they seems to be losing the battle. Will the shorts blow through all their FUD today in a final attempt? Will the Bulls circlejerk this stock to new highs? Subscribe here to find out, keep refreshing the daily thread while procrastinating on your jobs.", "score": 42, "replies": [{"body": "> keep refreshing the daily thread while procrastinating on your jobs.\n\nYes", "score": 12, "replies": [{"body": "Me too ha ha, one of the perks of not having a job is you can read every comment.", "score": 5, "replies": [{"body": "I work from home but same situation hehe", "score": 4, "replies": []}]}]}, {"body": "Lol they think we have jobs.", "score": 9, "replies": [{"body": "Soon we won't need any.", "score": 8, "replies": [{"body": "Don’t need jobs where we’re going!!!", "score": 6, "replies": []}]}]}, {"body": "The most sane comment I've seen on this website", "score": 12, "replies": []}]}, {"body": "Last day of the week, for sure", "score": 11, "replies": [{"body": "Big if true!", "score": 4, "replies": []}, {"body": "No way !", "score": 2, "replies": [{"body": "i'm all in on this one", "score": 1, "replies": []}]}, {"body": "> Last day of the week, for sure\n\nWhat happened to Sunday? 🤔", "score": 2, "replies": [{"body": "That’s the first day", "score": 3, "replies": [{"body": "_So it begins..._", "score": 5, "replies": []}, {"body": "Monday is first day...", "score": 1, "replies": [{"body": "https://www.timeanddate.com/calendar/days/monday.html\n\n“First or Second Day?\n\nAccording to the international standard ISO 8601, Monday is considered the first day of the week. Most European countries' calendars show Monday as the first day of the week. However, in many cultures and languages, Monday is given a name that means either “second day,” marking Sunday to be the first day of the week, or a name that means the day after Sunday.”", "score": 1, "replies": []}]}]}]}]}, {"body": "Not much so far. Better start than yesterday at least lol", "score": 5, "replies": []}, {"body": "Yes", "score": 2, "replies": []}, {"body": "Big green candles.", "score": 2, "replies": [{"body": "*dildos, not candles", "score": 1, "replies": []}]}, {"body": "Nice to see volume back to a reasonable level, at-least for now. All these 20-30M days begin to take their toll on one's sanity ha.", "score": 1, "replies": [{"body": "What's the usual/average volume for Tesla? How do you see the volume premarket? Also what does a high volume imply for the shareholders? Sorry for the noob questions...", "score": 1, "replies": []}]}]}, {"body": "Won’t the G3 be closed for a week during CNY?", "score": 3, "replies": [{"body": "Yeah, I believe sometimes production is halted a week in advance and a week afterwards too.  It’ll be interesting to know what Tesla does.", "score": 2, "replies": [{"body": "Machines don't celebrate Chinese new years ;)", "score": 0, "replies": []}]}, {"body": "Yeah it will.  [Heres a little discussion](https://www.reddit.com/r/teslainvestorsclub/comments/dy0u2g/tsla_daily_investor_discussion_november_18_2019/f7ymqet/) I started on the subject a few months ago.", "score": 1, "replies": []}]}, {"body": "I think Tesla should take this opportunity to prove they can be a good neighbor and communicator. It would definitely contribute to changing Germans' opinion of Tesla and raise the bar further for local manufacturers.  \n  \nhttps://twitter.com/gigafactory_4/status/1217931102175858688?s=20", "score": 3, "replies": []}, {"body": "I am relatively new investor: in at 497 avg cost/per share.  I have money set aside to buy more of tsla and debating to buy in more now or post-earnings.  Anyone have any thoughts?", "score": 3, "replies": [{"body": "Nobody knows.  If you wait and the stock trend down, then you got a bargain.  If earning report is a blowout, then you'll be buying less shares for the same money.  5-10 years from now, when the stock is 5-10x the price, a few dollars difference for a share available now wouldn't matter much.\n\nI bought 64 shares this morning at $507.", "score": 5, "replies": [{"body": "The higher the price gets, the more pressure it puts on earnings. I think when earnings are released, it will negatively impact the stock price, but only temporarily.", "score": 1, "replies": []}]}, {"body": "Spend part before and part after. Not the biggest gain but also not the largest loss.", "score": 1, "replies": []}, {"body": "Time in the market > timing the market", "score": 0, "replies": []}]}, {"body": "Looks like the market makers have decided max pain", "score": 3, "replies": []}, {"body": "Who’s got a Bloomberg Terminal, wtf tell me the news", "score": 3, "replies": []}, {"body": "wtf just happened?", "score": 3, "replies": [{"body": "More of that bear asshole, who's shorting the stock, requesting NHTSA to recall literally every car Tesla has made since 2013 because there has been 100 or so unexplained accidents according to him.", "score": 13, "replies": [{"body": "It’s not surprising - they are so underwater and would seem to be hanging on past any reasonable risk tolerance.   The fact that they are pulling out all the stops and it’s having a minimal effect should be very concerning to these guys because now if earnings hit hard, and expect they will the stocks going super nova on them.  Good times ahead...", "score": 10, "replies": []}, {"body": "Wtf", "score": 5, "replies": [{"body": "Thank God Elon is a chill dude.\n\nIf I were him I would've already Jeffrey Epstein'd all these scumbags.", "score": 7, "replies": [{"body": "Same", "score": 5, "replies": []}]}]}, {"body": "I mean it's a nice meme but that's about all it is. And people actually trade based on it apparently", "score": 3, "replies": [{"body": "In the little time I've been trading stocks, I've come to the realisation that the market is driven by stupidity and emotion in the short term, and that reason and logic only come into the equation in the long term.", "score": 7, "replies": [{"body": "Couldn't have said it any better.", "score": 2, "replies": []}]}]}]}]}, {"body": "Ok, so options close on Saturday 11:59? If so, then what kind of short pain are we talking about? Is 504 far enough away from 500 to do damage? I want them to hurt, lol", "score": 3, "replies": [{"body": "0.01 is far enough away.", "score": 4, "replies": []}, {"body": "It’s still up week over week so the shorts got anal pounded", "score": 3, "replies": [{"body": "That bear asshoe is gaping.", "score": 3, "replies": [{"body": "Lol, looks like a bear downvoted - gotta be careful, they are going extinct pretty soon ;)", "score": 2, "replies": []}]}]}]}, {"body": "This sub is starting to look more like r/bitcoin than an investing forum. Reminder that there is extreme risk and you should buy and hold for the long term if you believe in the thesis", "score": 11, "replies": [{"body": "> Reminder that there is extreme risk and you should buy and hold for the long term if you believe in the thesis \n\nThat's why it looks like r/bitcoin", "score": 8, "replies": []}, {"body": "Bitcoin is hot air. Tesla makes real vehicles. There are differences that make Tesla less risky.\n\n(Not to mention that Tesla helps to reduce greenhouse emissions while bitcoin increases them.)", "score": 2, "replies": [{"body": "That’s not the point. I’m saying that let’s get back to actual analysis instead of just staring at price charts. Think a lot of these newcomers to the sub are the equivalent of momentum and day traders", "score": 8, "replies": [{"body": "Oh sorry. I totally agree with that point. I spend part of my time here upvoting people who have been downvoted for bringing a less favorable fact to the table. Like in religions, strong convictions don’t make things true. There is only reality and that should be honestly and sincerely appreciated.", "score": 3, "replies": []}]}]}, {"body": "According to some experts, Tesla = Bitcoin #spiegel.\n\nThere are of course differences: one is a hyped overpriced bubble that a lot of people believe to be a fraud, with absolutely no fundamental value behind it and that can collapse any minute now, the other one is a crypto currency.", "score": 1, "replies": []}]}, {"body": "FUD and institutions have been trying their best for the last few days not to pay the $500 option strike expiring today.\n\nI wouldn't be surprised to see a sharper drop near the closing hours, so bulls wouldn't have any time to react.", "score": 7, "replies": [{"body": "Was always curious, how does one drop the price?", "score": 2, "replies": [{"body": "coordinated heavy selling.  It's unlikely they will do this.", "score": 2, "replies": [{"body": "Right before 3 days off? Doubt it", "score": 2, "replies": [{"body": "If they have to pay a crap load for options expiring today, they would try anything.", "score": 3, "replies": [{"body": "True", "score": 2, "replies": []}]}]}]}, {"body": "A few ways to do this if you have the volume.  One is to short a bunch of stocks.  Another is having multiple algo entities do multiple trades to a lower price.", "score": 2, "replies": []}, {"body": "By selling.\n\nIt's supply/demand.\n\nMore people selling than buying = price goes down.\n\nMore people buying than selling = price goes up.", "score": 2, "replies": []}]}, {"body": "7 minutes left in the day anyway it could actually happen", "score": 2, "replies": []}]}, {"body": "So, as far far as options go, did TSLA close above or below $500 today? ( considering the AH drop )", "score": 3, "replies": [{"body": "Options technically close on 11:59 Saturday I believe.", "score": 3, "replies": [{"body": "so this AH drop could be option sellers trying to push stock down --- so options between 505-510 don't get exercised automatically?\n\nThat is pretty significant option volume in the range. Could this be market manipulation material? (actually the whole NHTSA petition looks like manipulation material from desperate shorts...)", "score": 7, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Own what?  This member dissected and determined it's impossible for a Tesla to engage any unintended acceleration. He has been hacking his Tesla trying to make it into a gigantic remote R/C but the amount of safe guards Tesla engineers have put in is borderline ridiculous in his opinion. Read the entire thread.\n\nhttps://teslamotorsclub.com/tmc/threads/sudden-unintended-acceleration.107134/page-22#post-3098344", "score": 5, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "This is not the first time the shorts cried about unintended acceleration and has been debunked time after time in court and otherwise. It's nothing more than another smear campaign.", "score": 2, "replies": [{"body": "I haven't read the details but it is what it is. NHTSA should shoot it down then and just like the USDA if false claims continue they can take legal action.", "score": 2, "replies": [{"body": "They are not the fastest when looking into these investigation. There's still an investigation from 2013 about a Prius still with no case close date. So this case will be under their pending cases for years, especially if they are investigating 500k cars or whatever.", "score": 1, "replies": [{"body": "They'll never investigate that many if any. They'll take a sample size or claims. But my point is just that we are making it a bigger deal then it is.", "score": 1, "replies": [{"body": "Well you wanted Tesla to \"own it\" as if they it's their fault. They have debunked this nonsense for years. The last one was about a Model X \"unintended accelerated\" with a child inside the car. Tesla sent a log of every pressure and control with time stamps manipulated by whoever was in the car.", "score": 2, "replies": [{"body": "That is owning it... Addressing it and doing some due diligence is taking ownership. Honestly just because it's be defunked once doesn't mean it should just passively be dismissed every time.", "score": 1, "replies": [{"body": "And that's how short sellers win. By taking everything they say seriously, \"making it a bigger deal then it is\".", "score": 2, "replies": [{"body": "Agree to disagree. \n\nI believe it's their responsibility to address something like this as a part of their corporate responsibility and mission for safety.\n\nAnd our responsibility as educated consumers to observe and report any issues. But to harp on it from a consumer basis seems a little much and honestly just feeds the story. I only saw that story on this forum (ancedotal)", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Malcolm Gladwell did an episode of Revisionist History on unintended acceleration where he made it pretty clear it's always driver error.  I recommend listening to it.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "After hours is bs trading on small volume, will be reversed before market open", "score": 3, "replies": [{"body": "That wasn't the question. Options will expire before the market opens.", "score": 1, "replies": [{"body": "Yah they expire at market close", "score": 1, "replies": [{"body": "No they expire on Saturday 11:59 est unless they are monthly options.", "score": 2, "replies": [{"body": "Cant you still have your broker exercise the options if you're super confident? feels extremely risky.", "score": 1, "replies": [{"body": "Super confident in what? It's a contract if the terms aren't met it's void. I don't know why you would exercise it if it's under the price anyway. You would just be compounding your losses.", "score": 1, "replies": [{"body": "terms are you pay strike price, you get shares.  hypothetically there's a situation where purchasing the shares via options is going to be cheaper average cost than purchasing shares at market price if there isnt enough volume being sold.\n\nIt would only be worth it if you were confident price would be above strike open tuesday morning.", "score": 1, "replies": [{"body": "You're missing the key term. Price has to be higher then the strike.", "score": 1, "replies": [{"body": "Quick google search gives me this: https://www.thebalance.com/can-an-otm-option-be-exercised-2536809", "score": 2, "replies": [{"body": "Stand corrected.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Above.", "score": 1, "replies": []}]}, {"body": "Something going on, premarket down? Any news?", "score": 2, "replies": []}, {"body": "Feeling pretty stupid about buying at 541, I should have waited... lol", "score": 6, "replies": [{"body": "don't be so short-sighted", "score": 19, "replies": [{"body": "True, I know - not concerned about temp losses, just could have bought more shares is all, haha", "score": 2, "replies": [{"body": "In a few years you will be crying that you didn't buy more at 541 :)", "score": 8, "replies": [{"body": "That'll feel good :)", "score": 3, "replies": []}]}]}]}, {"body": "542.66, right there with you. 20 shares.", "score": 1, "replies": []}, {"body": "Tesla is very swingy, look at lifetime graph, almost 100% chance it will trade at support range in mid 300s again, we’ve all been guilty of this buying on complete FOMO, important to follow a strategy to buy at low prices.", "score": -10, "replies": [{"body": "Not without major bad news, this isn't the Tesla of 2017 anymore", "score": 6, "replies": []}, {"body": "Mid 300s?  almost 100% chance?  Wow, no way.\n\nThere's a chance, yes... but not almost 100%.  If I had to put a number on it, it'd be 30% at best.  You could be pretty bear and still think it's 95%, which is far from 100%.", "score": 5, "replies": []}, {"body": "Why do you even think it will go to 300?\n\nIt has traded flat at 300-350 level for 3 years.\n\nHow do people still believe it will drop to that level again..", "score": 4, "replies": [{"body": "Tesla has traded at $176.99-$547.41 in the last 12 months, Tesla investors need to be prepared coming in that there is a real chance of a 50% drop at any time, this way they won't panic and sell when it happens.\n\nElon said the 1H of 2020 will be \"rough\". On the [eu-evs.com](https://eu-evs.com) website the Model 3 has been CRUSHING every other model since its introduction... in 2020 so far its #15. If this continues, you can see the headlines and panic. Not spreading \"FUD\", just want investors to be aware of the risks of buying at this level.", "score": 3, "replies": [{"body": ">  in 2020 so far its #15.\n\nwhich is impressive, considering the fact that they pretty much sold the vast majority of available cars at the end of 19Q4 and no new ships are scheduled to arrive until early February", "score": 1, "replies": [{"body": "The other companies are now incentivized to sell EVs in Europe or face massive fines, they didn’t have that incentive in 2019, the competition the bears always talked about is here, let’s see how the sales are after the ships arrive.", "score": 2, "replies": []}]}]}, {"body": "Agreed, 300 seems too low. I understand given past swings it might seem reasonable, but Tesla is in a very different situation now than in the past - imo", "score": 2, "replies": []}]}]}]}, {"body": "Late Friday, NHTSA released a redacted version of the lengthy petition that said “Tesla vehicles experience unintended acceleration at rates far exceeding other cars on the roads” & urged NHTSA “to recall all Model S, Model X & Model 3 vehicles produced from 2013-present.”", "score": 3, "replies": [{"body": "Bets on wether the person who filed the petition is shorting the stock?\n\nI honestly wouldn't put it past these Wall Street scumbags to pull something like this.\n\nGood thing it's a 3-day weekend and by Tuesday this will be old news.\n\nAlso, I wanna know what kind of moron would request a recall when literally any problem can be solved with a free software update.", "score": 11, "replies": [{"body": "He is indeed, it said so", "score": 12, "replies": [{"body": "Jesus Christ...", "score": 9, "replies": [{"body": "Teslas are a real time car black box that record every setting, this idiots petition will be thrown out for lack of merit and then he should be investigated for market manipulation", "score": 13, "replies": [{"body": "Seriously, these people need to be taught a lesson", "score": 5, "replies": []}]}, {"body": "All the people surprised by this can raise their hand!", "score": 6, "replies": []}]}]}]}, {"body": "Recall? People are worried about this? As in OTA isn't a thing? Also, there has yet to be an investigation. If there were really an issue with the vehicles there would be more than 127 reports of said incident.", "score": 10, "replies": [{"body": "If that's all shorts have in their menu then all is good. I think they'll spin YoY revenue decline/growth rate.", "score": 1, "replies": [{"body": "I'm calling it now,\n\n\"Yeah well YoY Model X sales in Idaho are down 3%, bankwupt\"", "score": 2, "replies": [{"body": "you're giving them ideas.. lol", "score": 2, "replies": []}]}]}]}, {"body": "There's dashcam in every tesla. If there was unintended accel we'd have videos all over YouTube. Can't believe this fudster garbage.", "score": 11, "replies": [{"body": "there are vids on youtube", "score": 0, "replies": [{"body": "Link", "score": 1, "replies": []}]}]}, {"body": "Non event", "score": 6, "replies": [{"body": "People want to know why AH is dropping. Went down over $10 after that news released", "score": 5, "replies": []}]}, {"body": "So what? It’s only a petition...", "score": 3, "replies": [{"body": "People want to know why AH is dropping", "score": 4, "replies": [{"body": "Just after hours manipulation", "score": 6, "replies": []}, {"body": "It will recover.  No volume.  More likely someone trying to make it look like something", "score": 5, "replies": []}]}]}, {"body": "My Model 3 only ever Decelerates unintentionally (phantom braking). This is nothing.", "score": 1, "replies": []}]}, {"body": "Thought I’d share a little bit of humor since it’s Friday. Hope people can at least enjoy the humor of the quote “TSLAQ” community.\n\n@PollsTesla poem from his book, this time about the autopilot porn hub video. https://twitter.com/pollstesla/status/1218150361850138624?s=21\n\n\nThe book is “Ode to the Electric Fence I Pissed On”, a book of poems about Tesla.\n\nhttps://twitter.com/pollstesla/status/1218152246174715904?s=21\n\nEnjoy, and happy Friday to everyone. Hope everyone gets some wicked tenndies.", "score": 6, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "That’s funny", "score": 1, "replies": []}]}, {"body": "It's nice that TSLAQ can actually be funny on purpose.  :)\n\nI kid, I kid.  I liked it.", "score": 3, "replies": []}]}, {"body": "Lol an hour ago Premarket was $519, now it’s $504. Has to be news driven", "score": 2, "replies": [{"body": "It's slowly crawling back up, so I assume it's nothing.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "How likely is a positive Q4 earning report? It’s getting late..", "score": -10, "replies": [{"body": "The earnings report is most certainly not late. It would be unprecedented to have it this early in the month", "score": 16, "replies": []}, {"body": "There are almost no signs that it should be negative but yes the late reporting is a uncertain fear.", "score": 7, "replies": [{"body": "It isn't late yet though, right?", "score": 4, "replies": [{"body": "Announcement of date is late. Technically they could just do it today after hours but usually there's lead time so logically it will be late.", "score": 2, "replies": [{"body": "Last year they announced it on Jan 18 afaik so they are not late.", "score": 2, "replies": [{"body": "They announced the date on the 18th for the 30th", "score": 2, "replies": [{"body": "Yes? That's what I said.", "score": 1, "replies": [{"body": "30th is still late. Even if they announce today for the 29th it's late. \n\nThey usually report 23-24 days after quarter close.", "score": -2, "replies": [{"body": "How can you say 30th is \"late\" when it's _exactly_ the date that they reported last year? I'm sorry but this is ridiculous.", "score": 1, "replies": [{"body": "\"They usually report 23-24 days after quarter close.\"", "score": 0, "replies": [{"body": "They only started doing that sometime last year IIRC", "score": 2, "replies": [{"body": "Honestly it's pretty haphazard with no trend. On mobile so bad formatting but the previous times are below, latest first, with a minus if they were under expected or a plus if they were over. \n\n23 days +\n\n23 days - \n\n24 days -\n\n30 days - \n\n24 days +\n\n31 days -\n\n32 days + \n\n37 days - \n\n31 days -\n\n32 days - \n\n33 days -\n\n22 days -", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": -9, "replies": [{"body": "You asked this already, and you got a response. Your original Q:  https://www.reddit.com/r/teslainvestorsclub/comments/epy27z/tsla_daily_investor_discussion_january_17_2020/femg74v", "score": 6, "replies": []}]}]}
{"title": "People are buying $1000 Tesla calls expiring next week.", "selftext": "[deleted]", "id": "epwhrz", "created_utc": 1579241569.0, "score": 430, "upvote_ratio": 0.99, "num_comments": 130, "comments": [{"body": "thats too far ITM for me", "score": 461, "replies": [{"body": "[deleted]", "score": 54, "replies": [{"body": "In Elon we trust!", "score": 5, "replies": []}, {"body": "elonable", "score": 5, "replies": []}]}]}, {"body": "Hey you just never know man. I may grab a few", "score": 180, "replies": [{"body": "Better odds then the mega millions\n\nBasically the same payout", "score": 101, "replies": [{"body": "Who bought these?", "score": 1, "replies": [{"body": "I don’t trade Shit stocks.", "score": 1, "replies": [{"body": "It’s not a stock trade it’s an option trade", "score": 1, "replies": [{"body": "I don’t trade TSLA, period. No stock, calls, puts, spreads. I avoid shit stocks.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You think we should buy calls at a higher strike?", "score": 145, "replies": [{"body": "[deleted]", "score": 101, "replies": [{"body": "Because we have to be within 1k of 4200.00 before that strike price is unlocked.", "score": 41, "replies": []}, {"body": "Write your own maybe some retard here will buy it just to post.", "score": 8, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Technically, yes. But that's only if you think there is a reality that Tesla hits $4200 by the expiration date you set", "score": 4, "replies": [{"body": "[deleted]", "score": 7, "replies": []}]}]}]}, {"body": "Or $6969.69", "score": 2, "replies": []}]}, {"body": "The dumbass people are the ones selling the calls lol so they just made $0.01x100 per contract? I think the only explanation is they're doing a spread but it's still not optimal", "score": 4, "replies": [{"body": "Exactly.. that or they are retarded.. oh wait.. nevermind.", "score": 1, "replies": []}]}]}, {"body": "Free money for Theta Gang", "score": 68, "replies": [{"body": "Theta Thunberg getting rich", "score": 63, "replies": []}]}, {"body": ".02 chance at profit, so there is a chance", "score": 107, "replies": [{"body": "it wasn't that long ago that the 500 calls were .02 chance of profit", "score": 44, "replies": [{"body": "Was it longer than the expiry?", "score": 13, "replies": []}, {"body": "was that june 2019?", "score": 2, "replies": []}]}, {"body": "It's .02% which is .0002 probability", "score": 17, "replies": [{"body": "If I buy 5000 of them then I would have 100% probability. Basically like printing free money!", "score": 3, "replies": []}, {"body": "Is 10% 5% bigger than 5%?", "score": 1, "replies": [{"body": "No it's 100% larger", "score": 8, "replies": [{"body": "You’re a wizard", "score": 1, "replies": []}]}]}]}, {"body": "So you're saying there's a chance?", "score": 10, "replies": []}, {"body": "If there is a chance - there is a chance. Can't argue with that.", "score": 1, "replies": []}]}, {"body": "Asking price is too high, you need to buy further out OTM so they're cheaper and can buy more contracts", "score": 78, "replies": [{"body": "[deleted]", "score": 34, "replies": [{"body": "nah interest is more expensive than theta", "score": 19, "replies": []}]}, {"body": "100% agree. This is the financial advice we need to heed.", "score": 5, "replies": []}, {"body": "Sorry if this is the wrong place. If there's a sub where this would fit better then please let me know...\nI'm still trying to get a grasp on this shit. So the more otm the call is and the sooner it expires the cheaper the premium and the more you can buy, right? And as long as the stock goes up even marginally your benefit is that you can sell them at whatever it is and make a huge profit due to the fact that you were able to buy a lot of them for a small premium? Right?\n\nWhat's the limit on setting the call price? Could I place a call on tesla for $100.000 ending tomorrow? What would be the premium?\n\nIn OPs example, how much is the premium\n\n Again sorry if this is the wrong place.", "score": 11, "replies": [{"body": "The only one making money is the dude who sold the worthless options to your retarded ass. You can't sell them if no one is wanting to buy them.", "score": 28, "replies": [{"body": "I'll buy them, but I'm only willing to pay in credit card debt", "score": 7, "replies": []}, {"body": "Happy cake day special little guy", "score": 1, "replies": []}]}, {"body": "Nobody tell him", "score": 34, "replies": [{"body": "That’s cruel, but kinda funny", "score": 13, "replies": []}]}, {"body": "Psst! Check out tastytrade for some good videos on how this shit works. I wouldn’t trust the bunch not to give you wrong advice for shits and giggles 🤭", "score": 16, "replies": [{"body": "Thank you very much. I'll definitely check it out.", "score": 5, "replies": []}]}, {"body": "investopedia.com", "score": 8, "replies": []}, {"body": "Lol your logic is correct but these calls are going for like $.01 and have no chance of ever reaching $0.02", "score": 4, "replies": [{"body": "Set it and it will sell. There is some retard out there willing to buy it. Fuck it’s probably one of us and they will post it too.", "score": 1, "replies": []}]}, {"body": "If your strike price is out of the money then the value of the option is entirely premium. An OTM option has no intrinsic value.", "score": 3, "replies": []}]}]}, {"body": "That’s like $174 lmao. Probably one moron that decided to buy these instead of lottery tickets.", "score": 36, "replies": [{"body": "One in 800 million chance vs 0.02% chance not bad", "score": 31, "replies": []}]}, {"body": "Elon better release another autopilot porno", "score": 31, "replies": [{"body": "That’s how Grimes got pregnant", "score": 10, "replies": []}, {"body": "He could release the cure for cancer and another flamethrower and these calls still ain’t making a profit.", "score": 2, "replies": []}]}, {"body": "LOL sure, why not :)\nhttps://i.imgur.com/gbNo4B9.png\n\n_(Can you imagine the person on the other end raking in all the premiums because people want to be funny? Reminds me of [Potato Salad Guy](https://www.columbusmonthly.com/article/20140909/LIFESTYLE/309099535))_\n\nThis could be a new way to raise funds. Sell ridiculously priced options that cannot ever be exercised then post on a forum/chatroom for everyone to go buy it. :)\n\nEDIT: nevermind, order route optimization will execute buy order at the lowest price available.\nEDIT2: Actually, order routing only finds best price for a specific strike and nobody else would be selling such an insane strike price so this would work!", "score": 28, "replies": []}, {"body": "Breakeven price of only $1001.01. Sounds possible. Would hate for it to close at $1000.00", "score": 52, "replies": [{"body": "Why'd you add the extra dollar?", "score": 20, "replies": [{"body": "I misread as I am retarded too", "score": 41, "replies": [{"body": "You're in the right place", "score": 17, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Only if you hold till expiration. If tsla goes to 800 today that 1000c will be worth a lot more than what you paid for it.", "score": 5, "replies": [{"body": "Yea but with a time frame of a week that option wont gain much even if the stock gained 40 billion in market value to go up to $800 a share", "score": 3, "replies": [{"body": "Doesnt have to gain \"much\". Let's say its .02. TSLA goes to 800. The 1000c might go to .08. As long as you bought enough contracts and can sell them you would get 300% return.", "score": 0, "replies": []}]}]}]}]}, {"body": "So, you are saying that I have a change?", "score": 0, "replies": [{"body": "a change of underwear, after you shit yourself when it goes to 2k.", "score": 5, "replies": []}]}]}, {"body": "Imagine selling 100 of these for USD 100 in gains, then Apple buys out Tesla at 1,100 a share.", "score": 24, "replies": []}, {"body": "I would like to hear from the guy that drop $80,000+ on $600 calls expiring 2021.", "score": 42, "replies": [{"body": "It will easily reach 600 by 2021?", "score": 29, "replies": []}, {"body": "Some sort of hedge maybe", "score": 3, "replies": []}, {"body": "I have a ton of calls for 2021 at 600 and higher", "score": 1, "replies": []}]}, {"body": "Trying to sell is much different than people are buying", "score": 13, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "You can simplify it as \"26 people are asking for $0.02 per contract of 100\" and the bid is what people are willing to pay, which is 0 demand for $0 each lol", "score": 1, "replies": [{"body": "[deleted]", "score": 29, "replies": [{"body": "Upvote for nipple head.", "score": 16, "replies": []}, {"body": "Maybe, someone is just trying to fuck with the algos.\n\nJust takes one idiot to fat finger a buy order and we're off the races.", "score": 4, "replies": []}, {"body": "Robinhood displays the last bid available... Actually every broker does this", "score": 2, "replies": []}]}, {"body": ">Volume: 174", "score": 16, "replies": []}, {"body": "There is a last sale though. Someone spent $20 on this.", "score": 5, "replies": []}, {"body": "Wow you’re a retard", "score": 4, "replies": []}]}]}, {"body": "Open interest 1050", "score": 3, "replies": []}]}, {"body": "So, what exactly is the problem here?", "score": 9, "replies": []}, {"body": "People buying those are probably selling a lower strike call, just hedging / reducing collateral needed", "score": 3, "replies": []}, {"body": "I saw this post and bought some 1/31 1000c. They are up 20%!!. 143 volume too haha", "score": 3, "replies": []}, {"body": "This stock is easilly worth 1T marketcap in the future, shit's going to $1k this month and in few years $10k.", "score": 9, "replies": [{"body": "Found the guy buying them right here", "score": 8, "replies": []}]}, {"body": "I think they figure if tesla hits 600-700 in the next few days, that option will jump to at least 5 cents. Pretty good 5 bagger lol", "score": 7, "replies": []}, {"body": "Word i saw that shit lol", "score": 2, "replies": []}, {"body": "It's just Old Musky trying to pump with psychological propaganda.\n\nSEC pls", "score": 2, "replies": []}, {"body": "Probably the top half of a spread for people selling the $666 calls to you idiots.", "score": 2, "replies": []}, {"body": "Part of the spread most likely.", "score": 2, "replies": []}, {"body": "you're looking it at backward. some genious is selling $1000 tsla calls.", "score": 2, "replies": [{"body": "Tastes like $1 tendies", "score": 1, "replies": []}]}, {"body": "Dude anyone take this trade?", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Even if I did I woulda sold yesterday at the latest.  Still OTM", "score": 1, "replies": []}]}]}, {"body": "That's wild", "score": 1, "replies": []}, {"body": "It's like the lottery.", "score": 1, "replies": []}, {"body": "Time to exit when masses are buying", "score": 1, "replies": []}, {"body": "whats the date?", "score": 1, "replies": []}, {"body": "What the fuck", "score": 1, "replies": []}, {"body": "A new level of retardation", "score": 1, "replies": []}, {"body": "buying out the tail risk.", "score": 1, "replies": []}, {"body": "Imagine the tendies this dude will make if that shit becomes a reality...", "score": 1, "replies": []}, {"body": "I posted the same kind of post last week about $700 calls expiring today. So if you use this as a historical analysis you can infer that it’s free money. So go sell those calls!!!", "score": 1, "replies": []}, {"body": "OF COURSE I sell my 1/17 50 AMD FDs this morning instead of holding....", "score": 1, "replies": []}, {"body": "Serious q:is it a good time to buy tesla puts? If so, at what price for exp in next 3 months?", "score": 1, "replies": []}, {"body": "Guessing it's part of the hedge for a massive short position.", "score": 1, "replies": []}, {"body": "Who taught /r/investing about calls?", "score": 1, "replies": []}, {"body": "So this wasn’t a good idea?", "score": 1, "replies": []}, {"body": "Check out those lottery tickets.", "score": 1, "replies": []}, {"body": "People are selling $1000 Tesla calls expiring next week. No bid.", "score": 1, "replies": []}, {"body": "For $1 why not ? Cheaper than a powerball ticket and you lose both anyways.", "score": 1, "replies": []}, {"body": "so you're saying there's a chance", "score": 1, "replies": []}, {"body": "I heard 4K", "score": 1, "replies": []}, {"body": "I couldn't resist, this thread inspired me to buy some $930 strikes expiring feb 7 after earnings and a few of the 990 strikes...", "score": 1, "replies": []}, {"body": "The thing is why would someone even sell this call? They're making like 0.001% on it.", "score": 1, "replies": []}, {"body": "Might be that OI is from a while back and volume is just the sellers closing out?", "score": 1, "replies": []}, {"body": "That is what is called a hedge for a yuge short position", "score": 1, "replies": []}, {"body": "What would be the actual payout if it actually hits?", "score": 1, "replies": []}, {"body": "Dude that’s dumb who would even risk selling those for 2 dollars? I mean I get selling some right at the money on the chance they go down, at least you aren’t really losing plus you get a premium on the share price now. But how dumb will you feel if some dumbass good news comes out over the weekend and Tesla doubles", "score": 1, "replies": []}, {"body": "Dude that’s dumb who would even risk selling those for 2 dollars? I mean I get selling some right at the money on the chance they go down, at least you aren’t really losing plus you get a premium on the share price now. But how dumb will you feel if some dumbass good news comes out over the weekend and Tesla doubles", "score": 1, "replies": []}, {"body": "Still 58,000 times more likely to happen than you winning the lottery.  Edit: According to Robinhood's bigbrain \"chance of profit\" number anyway.", "score": 1, "replies": []}, {"body": "So you're saying there's a chance??", "score": 1, "replies": []}, {"body": "This is so inspiring", "score": 1, "replies": []}, {"body": "Eoe. As a Canadian wothout access to robin hood i can't believe how good they break down all the info on an option contract like that! Even letting you know chance of profit?\n\nI pay fucking $10 anytime i buy AND sell option so $20 total to buy and sell option contract PLUS a dollar per contract and don't get shit other than the basics (I.V, delta, etc)", "score": 1, "replies": []}, {"body": "Just like playing the lottery", "score": 1, "replies": []}, {"body": "I would make 45k if that happened.", "score": 1, "replies": []}, {"body": "Going to be interesting.", "score": 1, "replies": []}, {"body": "1 dollar contracts. That's a steal.", "score": 1, "replies": []}, {"body": "It could be for a credit spread. You have to cover the call with a further out of the money call to manage risks.", "score": 1, "replies": []}, {"body": "Implied volatility of 130%? Does that mean that the market expects the stock to move 130% in the next week?", "score": 0, "replies": [{"body": "IV is an input in the Black Scholes model so when you use that IV, you should get to the option price in the chain\n\nIf you think the IV is over or understated you can trade on those basis", "score": 1, "replies": [{"body": "I’m retarded, can you do it for me", "score": 3, "replies": []}]}]}, {"body": "Taking Tesla private at $1169.00", "score": 0, "replies": []}]}
{"title": "WSB stock mentions over the last 7 days", "selftext": "See you in Callhalla Brothers\n\n1 SPY - 3634 mentions \n\n2 TSLA - 3188 mentions \n\n3 BYND - 2038 mentions \n\n4 AMD - 1713 mentions \n\n5 AAPL - 1326 mentions \n\n6 SPCE - 990 mentions \n\n7 BA - 573 mentions \n\n8 TSM - 492 mentions \n\n9 AMZN - 467 mentions \n\n10 BAC - 457 mentions \n\n11 ROKU - 447 mentions \n\n12 MSFT - 435 mentions \n\n13 TGT - 384 mentions \n\n14 ACB - 372 mentions \n\n15 PTON - 342 mentions \n\n16 NIO - 292 mentions \n\n17 BABA - 276 mentions \n\n18 DIS - 273 mentions \n\n19 JPM - 242 mentions \n\n20 FB - 208 mentions \n\n21 DOW - 198 mentions \n\n22 SU - 172 mentions (not a stock, you weirdos just love su bae)\n\n23 UBER - 167 mentions \n\n24 TLRY - 148 mentions \n\n25 CGC - 148 mentions \n\n26 QQQ - 136 mentions \n\n27 MU - 134 mentions \n\n28 NFLX - 131 mentions \n\n29 LK - 131 mentions \n\n30 SBUX - 122 mentions \n\n31 SNAP - 121 mentions", "id": "eq0c8i", "created_utc": 1579267563.0, "score": 1136, "upvote_ratio": 0.98, "num_comments": 209, "comments": [{"body": "This should be a regular post lol", "score": 764, "replies": [{"body": "I'm thinking I might start doing it on the reg.\n\nEdit:\n\nThe mods have told me I'm allowed to recommend you check out my [reddit profile](https://www.reddit.com/user/cdiamand/) and click \"follow\" so you can see when I post these.\n\nOtherwise I'm gonna start doing this at least once a week. Maybe more. Keep an eye out! :)", "score": 463, "replies": [{"body": "We’re offering minimum wage to start but HUGE opportunities for growth.", "score": 189, "replies": [{"body": "It is easy to become a millionaire I hear.", "score": 19, "replies": [{"body": "Yeah exactly just put all your money on TSLA calls. Or puts. I don’t know. One of the two. Maybe both. I don’t know.", "score": 11, "replies": []}]}]}, {"body": "[deleted]", "score": 22, "replies": [{"body": "yes", "score": 8, "replies": [{"body": "thanks for reminding me about this spreadsheet - added to favorites.\n\nif easy enough, maybe have one tab weighted according to the weekly  mentions, and then another worksheet with how you have it currently weighted (I forget how you weighted the current version)", "score": 1, "replies": [{"body": "and then index the WSB-weighted performance versus the existing weighted performance\n\nand watch WSB's autism graph descent into the pits of hell", "score": 2, "replies": []}]}]}]}, {"body": "Congratulations  Your hired!", "score": 42, "replies": [{"body": "\"Your\" not my hired.", "score": 12, "replies": []}, {"body": "I have a personal risk tolerance of 100%.", "score": 3, "replies": [{"body": "I only buy when stocks are high 😎", "score": 2, "replies": [{"body": "That's because if they're going up, they'll keep going up obviously. That's how it works. Stonkz go up.", "score": 2, "replies": []}]}]}]}, {"body": "Yes plz!", "score": 10, "replies": []}, {"body": "How did you get this info...? You didn’t hand count did you? Lol", "score": 8, "replies": [{"body": "I printed out all 3000 posts using my PIXMA Canon II printer. And laid them out across my entire apartment. Then I had a team of Series 7 qualified professionals hand count each mention of a stock. Then we tallied them all up and I had my mom help me sort the numbers from largest to smallest.\n\n\n\n\n\nEDIT: JK, I used a computer to count them all up.", "score": 143, "replies": [{"body": "Lol. Nice. Well I like the post, keep it up!", "score": 16, "replies": [{"body": "Thank you! :)", "score": 10, "replies": []}]}, {"body": "Computers how do they work", "score": 5, "replies": [{"body": "01", "score": 6, "replies": []}]}, {"body": "Like Control F? But then every page needs to be open.", "score": 1, "replies": []}]}]}, {"body": "Also, return over last 7 days on each stock alongside would be nice!", "score": 8, "replies": [{"body": "And one year + comparison to sp500", "score": 0, "replies": []}]}, {"body": "do it as a word cloud next time", "score": 6, "replies": []}, {"body": "Should also check if there are the words call/put/option/stock/buy/sell/~~long~~/short in the same post so that you can evaluate what we should do and we don't have to do DD anymore.", "score": 4, "replies": []}, {"body": "This works well for helping to inverse wsb", "score": 3, "replies": []}, {"body": "You would have an infinite Reddit membership, paid for by the community if you did this on the regular.", "score": 3, "replies": []}, {"body": "This would be the best bot", "score": 3, "replies": []}, {"body": "Please do it daily!  It’s especially interesting to see the least said stocks because it’s way to possibly get on the stock before most people.", "score": 2, "replies": []}, {"body": "Please do", "score": 1, "replies": []}, {"body": "It would also be super super interesting to see the sentiment ratio. Similar to some of these tools that track if a tweet about a company is positive or negative and then add it up for a general sentient indicator. If you did the same thing with the comments about the company it may be a powerful tool since it will tell us what companies this sub is overwhelmingly optimistic or pessimistic on. And then I’ll know to take the other side :p", "score": 1, "replies": [{"body": "Haha yeah I've got some tools like this in the works. Going to be a lot of info to try and squeeze into a reddit post...", "score": 3, "replies": [{"body": "It should be fairly easy to run thru a NLP algo and get a score on it then compare it to the actual return and see all those negative correlations with wsb", "score": 1, "replies": []}]}]}, {"body": "You need to put yolo, or retarded, or gay in the title though.", "score": 1, "replies": [{"body": "ROGER THAT", "score": 1, "replies": []}]}, {"body": "Followed.", "score": 1, "replies": []}, {"body": "Can you reference weekly performance too?", "score": 1, "replies": []}, {"body": "Would there be a way to be notified when a stock gets into the top 25 so I can know when to close a position?", "score": 1, "replies": []}, {"body": "I'm envisioning a table that resembles this:\n\n&#x200B;\n\nTicker | Mentions | Price @ Beginning of week | Price @ End of Week | p/l", "score": 0, "replies": []}]}, {"body": "We can do a weekly “what would you be up/down if your portfolio was made up entirely of Most WSB Stock Mentions?”", "score": 23, "replies": [{"body": "I'll manage a papertrade account with only WSB memestocks but any more work than that is a lot.", "score": 17, "replies": [{"body": "Please link or post weekly results. Maybe the combined autism of WSB is actually on to something.", "score": 7, "replies": [{"body": "let's get a list of tickers together, and i'll allocate the fake dollars.  I'm thinking 10 tickers would be the best.", "score": 1, "replies": []}]}, {"body": "You posting the results would influence what people talk about though.", "score": 1, "replies": []}]}, {"body": "Already on that!", "score": 1, "replies": []}]}, {"body": "or you know, just go to swaggystocks.com\n\nthe dude data scrapes wall street bets everyday", "score": 5, "replies": []}, {"body": "This should be an index! Where do I invest?!", "score": 1, "replies": [{"body": "I said it elsewhere and I'll say it again. WSB should try to make its own ETF.", "score": 1, "replies": []}]}, {"body": "Next can we track historical mentioned volume vs stock performance during the following week?", "score": 1, "replies": []}, {"body": "But this post increases mentions of all the top ones so it's kinda like an autistic version of an S&P500 ETF", "score": 1, "replies": []}]}, {"body": "I’ve noticed a correlation with mentions and the price. Sometimes they go up, and sometimes they go down. The real DD is that stonks only go up.", "score": 216, "replies": [{"body": "sigh", "score": 19, "replies": []}, {"body": "dd?", "score": -1, "replies": [{"body": "Douche Dick", "score": 12, "replies": []}, {"body": "Dropping dicks", "score": 9, "replies": []}, {"body": "Never ask anything on WSB, this subreddit is basically one big inside joke between retards.", "score": 9, "replies": [{"body": "We prefer autists, but I’ll let it slide because reservoir ducks is my favorite movie", "score": 5, "replies": []}, {"body": "So no one actually knows what DD is?  Or any other abbreviations or acronyms mentioned on here?  Like piihb?", "score": 1, "replies": []}]}, {"body": "dancin diddles", "score": 5, "replies": []}, {"body": "https://i.imgur.com/0moX7aX.jpg", "score": 3, "replies": []}, {"body": "dear daughter", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Shhh retard don’t tell him", "score": 9, "replies": [{"body": "Its goners man, we won't speak of this again", "score": 5, "replies": [{"body": "Lmao", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Lisa Su, I love you", "score": 41, "replies": []}, {"body": "Isn't data mining fun!? I started playing around with it over the holidays.\n\nI say we create a WSB quant fund.", "score": 47, "replies": [{"body": "Down to see this, yall should partner up", "score": 11, "replies": []}, {"body": "The fund was already made. I'd like to see someone pony up and make an official ETF though.\n\nYou can buy into this with M1 fairly easily.\n\nhttps://www.reddit.com/r/wallstreetbets/comments/edazey/introducing_the_official_tonks_and_becky_trackers/?utm_medium=android_app&utm_source=share", "score": 9, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Why you so poor though", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That's a good excuse.", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm in", "score": 9, "replies": []}, {"body": "Autist Total Options Fund - Fees 2/20", "score": 2, "replies": []}, {"body": "Bruh i was actually in the process of trying to see if i could find a correlation between WSB and price movement 🥺 glad to see i never have original ideas lmfao @/u/cdiamand", "score": 1, "replies": []}, {"body": "#YOLOGIC FUND", "score": 1, "replies": []}]}, {"body": "What about $GUH?", "score": 94, "replies": [{"body": "And $ROPE ??", "score": 13, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Already priced in bro", "score": 1, "replies": []}, {"body": "It currently is still Pumpkin Spice Latte season.", "score": 0, "replies": []}]}]}, {"body": "What about it?", "score": 5, "replies": []}]}, {"body": "In for $SPCE", "score": 29, "replies": [{"body": "It’s literally the next TSLA you’d have to be a complete moron, even by this subs’ standards, not to pick up some shares and wait a few years.", "score": 14, "replies": [{"body": "But is there that much value in commercial spaceflight within the next few years?", "score": 6, "replies": [{"body": "Absolutely. Plus they’re the leading company in hypersonic travel. Imagine going from LA to London in a fraction of the time it would take you today. Hypersonic travel and space tourism are the future and SPCE is leading us there. Boeing has already invested 20 million into it.", "score": -4, "replies": [{"body": "So what ur saying is: i should yolo my life savings into it", "score": 18, "replies": [{"body": "Exactly. 10/10 wont fail. Stock only going up. Big tendies", "score": 15, "replies": []}, {"body": "I did. All £76k lmao", "score": 5, "replies": []}]}, {"body": "Hypersonic travel died dude.  The internet killed it.\n\nThere just isn't any business that requires you to get someone from point A to point B that quickly for the amount of money that it costs.  The 15 hour flight is good enough, you aren't gonna find people willing to pay a $10k premium for a 4 hour flight.\n\nNot when so much of that class of travel just isn't even happening anymore.  It's more likely we'll get proper holographic teleconferencing before we see hypersonic flights take off.", "score": 4, "replies": []}]}]}, {"body": "bought shares 5-6 weeks ago\n\nbought leaps yesterday", "score": 5, "replies": []}, {"body": "Bought yearly calls 🤷‍♂️🚀📈", "score": 7, "replies": [{"body": "Right on. I’ve got calls and shares! Can’t wait to retire before I’m 30😎", "score": 7, "replies": []}, {"body": "$20 2021 baby", "score": 3, "replies": [{"body": "SPCE 01/21/2022 C $30.00 or you're big gay", "score": 4, "replies": []}]}]}, {"body": "RemindMe! 3 years", "score": 2, "replies": [{"body": "I will be messaging you in 3 years on [**2023-01-17 19:34:30 UTC**](http://www.wolframalpha.com/input/?i=2023-01-17%2019:34:30%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/eq0c8i/wsb_stock_mentions_over_the_last_7_days/fenr8hn/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Feq0c8i%2Fwsb_stock_mentions_over_the_last_7_days%2Ffenr8hn%2F%5D%0A%0ARemindMe%21%202023-01-17%2019%3A34%3A30%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20eq0c8i)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "How much does a ticket need to cost for an 8 person flight into space to be profitable?", "score": 1, "replies": [{"body": "You’re thinking about it too hard. They have cool ass rocket ships why would you not invest?! But to actually answer your question they had ticket sales open around 2010 and they were going for $250,000 a piece. Sales closed after a test flight killed a pilot, but are set to reopen soon this year due to high demand. Some major A list celebrities have shown interest and even reserved spots to buy tickets. Space tourism is their main focus so that’s what the public is mostly focused on but don’t forget about hypersonic travel. The more advances that are made and brought to the public, the more hype will come. It’s no doubt that space tourism and hypersonic travel are the future. Just like electric cars were the future years ago and now look how rich you’d be if you bought TSLA. This is literally the same situation.", "score": 7, "replies": [{"body": "I think electric cars have a much larger practicality and consumer base than the ultra wealthy targeted space tourism. There isnt even anywhere to go in space. Its just a “do it to say i did” thing.", "score": 4, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/comments/eq1hpq/investing_in_spce_is_literally_free_money_branson/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nHere this just got posted in WSB just in time😂", "score": 1, "replies": []}, {"body": "But think about what it could open up. There’s nowhere to go in the ocean yet people take cruises. Would you not want to take the family on a space cruise to the moon? And again, space tourism is only half of their goal. I understand where you’re coming from but I honestly believe in this stock. I’ve only scratched the surface of their potential all I can say is do your own DD and decide for yourself!", "score": -1, "replies": [{"body": "There is nothing to do on the moon my guy. Personally I wouldn't want to expose my kid to all the radiation in space.", "score": 2, "replies": [{"body": "It’s my ultimate dream to go to space but I’m 6’4” and stupid so I can’t be an astronaut. So to me, public space travel is one of the most exciting things I can think of. I realize there’s nothing to do out there but I mean cmon it’s freakin space. Who knows maybe someone will build a pub on the moon in my lifetime and that’ll be my destination. To go drink myself to death on the moon😂", "score": 0, "replies": [{"body": "Get a less retarded dream", "score": 7, "replies": []}, {"body": "Just drink yourself to death and pretend to be on the moon instead", "score": 2, "replies": []}]}]}, {"body": "There are islands to go to, there are beaches to go to\n\nThere is sun, and booze, and pool, and Boomer games, and all you can eat buffets\n\nSpace ain't got the first. And the second might be a risk to the not dying part of the equation.", "score": 2, "replies": [{"body": "Yeah but space doesn’t have sharks so get rekt SPCE rules Earth drools", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "r.i.p. to all the retards who bought spy puts yesterday", "score": 27, "replies": []}, {"body": "[deleted]", "score": 14, "replies": [{"body": "No need for $ROPE when stocks only go up!\n\nGive it a few weeks/months for the next time there's a major dip.", "score": 12, "replies": []}, {"body": "Or JNUG", "score": 1, "replies": []}]}, {"body": "I’d love to see the performance of a portfolio built off of these and weighted by % of mentions", "score": 11, "replies": [{"body": "Already done", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "🚀🌈🐻", "score": 11, "replies": []}, {"body": "Oh shiii....Back to the drawing board.", "score": 6, "replies": []}, {"body": "$🍑🍆🥵", "score": 6, "replies": []}, {"body": "my god.... you're right", "score": 2, "replies": []}, {"body": "🍏🍏🍏🍏", "score": 1, "replies": []}]}, {"body": "$SHOP didn't make the list WTF!!", "score": 9, "replies": [{"body": "I have trouble tracking shop, because its so widely used as a regular word. It might be up there, but I'm currently not tracking it. I'll see if I can add it back on", "score": 3, "replies": [{"body": "Search for case sensitivity", "score": 2, "replies": []}]}]}, {"body": "The fact this isn't formatted into a decent data visual of some kind confirms you are indeed retarded and frankly makes me very proud to have you as a part of this community.", "score": 9, "replies": [{"body": ":)...", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "\\^this guy moves markets.", "score": 3, "replies": [{"body": "Who you buying now? What's the next spce or shop?", "score": 1, "replies": []}]}]}, {"body": "Bye bye Lulu", "score": 6, "replies": []}, {"body": "$KRTX isn't on here, how on Earth did I manage to hop on that rocket before it took off?", "score": 6, "replies": [{"body": "What made it blow up anyway", "score": 1, "replies": [{"body": "Some doc posted saying they passed some clinical trial and price guidance got upped from mid $70's to mid 90's and all of a sudden Robinhood started offering options for them - which turned into a wildfire", "score": 2, "replies": []}]}]}, {"body": "How can I inverse this", "score": 8, "replies": [{"body": "lol, I created a memefolio with this kind of data. Simply take the other side... Still deciding how often to rebalance it, how to weight it, etc.", "score": 3, "replies": []}, {"body": "Sell calls", "score": 1, "replies": []}]}, {"body": "I've seen Ford mentioned far too often for this data set to be accurate. I think this guy is just pro-TSLA and suppressing Ford.          \n        \nCan I get some F for support?", "score": 4, "replies": [{"body": "Haha yeah, F is another one that's hard to track because 90% of it is just peopling saying....F. I stopped tracking it, but it would have been 13th on this list, with 392 mentions.", "score": 5, "replies": []}]}, {"body": "See you in Guhhalla\\*", "score": 3, "replies": []}, {"body": "Solid DD all in on SPCE", "score": 3, "replies": []}, {"body": "$BECKY", "score": 3, "replies": []}, {"body": "SPCE going to the moon", "score": 3, "replies": []}, {"body": "puts on spce, bulls getting crushed", "score": 2, "replies": []}, {"body": "UPVOTE THIS MAN, HE WILL FURTHER OUR GAINS", "score": 2, "replies": []}, {"body": "No one is riding PLUG? Shit slaps", "score": 2, "replies": []}, {"body": "No fsly??", "score": 2, "replies": [{"body": "fsly was roughly \\~130th on the list", "score": 3, "replies": [{"body": "No love for FSLY tendies then i see how it is.", "score": 1, "replies": []}]}]}, {"body": "Been in SPCE since 7 bucks.\n\nMake Space Great Again", "score": 2, "replies": []}, {"body": "Where’s BECKY", "score": 2, "replies": []}, {"body": "Who the hell is still playing TLRY?", "score": 2, "replies": [{"body": "Me. They were down 80% through 2019, and yet they had 200% revenue growth in the same year. They are up 30% since I bought them so...", "score": 1, "replies": []}, {"body": "I saw it being mentioned when comparing BYND and TSLA, as a bubble", "score": 1, "replies": []}]}, {"body": "Becky must be on Christmas break", "score": 2, "replies": []}, {"body": "Visa the steady sleeper", "score": 2, "replies": []}, {"body": "My options on $SPCE have given me a gain of over $800 in the past week...portfolio is up about 140% overall thanks to them and I only started investing in on October 22nd last year and haven't put much in, so only a 4 digit value right now but looking for my next investment.", "score": 2, "replies": []}, {"body": "Where the fuck is V. What is wrong with you retards ?", "score": 2, "replies": []}, {"body": "Usually you’re supposed to inverse everything on this sub but SPCE is on its way to the fucking moon. $100 by EOY easy.", "score": 2, "replies": [{"body": "That's all I've seen everyone say here, no way I'm buying stock now.", "score": 7, "replies": [{"body": "Your loss🤷🏼‍♂️", "score": 1, "replies": [{"body": "I'll see you in a year.    \nRemindMe! 1 year", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "First successful flight with none other than Sir Richard Branson himself on that flight. Set to launch on or before his birthday (early July I believe). Even just flight date announcements will send this thing through the roof.", "score": 1, "replies": []}]}]}, {"body": "I don’t see $ROPE", "score": 1, "replies": []}, {"body": "Yall be sleepin on PTON", "score": 1, "replies": []}, {"body": "Can you do this once a week but also do as a [Stock] w/3 Put and [stock] w/3 Call :)?", "score": 1, "replies": []}, {"body": "Can this be made into an index?\nWe have to harvest the knowledge of the autists for gainzzz", "score": 1, "replies": []}, {"body": "As someone who is new to WSB, can anyone tell me why Beyond Meat is worth talking about? Because apparently I'm too fucking dumb to figure anything out on my own and need to be told what to do and why. Is the McStupid investment a done deal?", "score": 1, "replies": []}, {"body": "I’m on spy puts", "score": 1, "replies": []}, {"body": "Thank god NVDA is not on that list.", "score": 1, "replies": [{"body": "Or XLNX. \n\nWhat is this? A list for ants?", "score": 1, "replies": []}]}, {"body": "This cant be right. I dont see $ROPE mentioned anywhere in your list?", "score": 1, "replies": []}, {"body": "Very interesting. Thanks.", "score": 1, "replies": []}, {"body": "I don't see GUH on the list!", "score": 1, "replies": []}, {"body": "Shouldn’t su be the same thing as amd?", "score": 1, "replies": []}, {"body": "How was this made?", "score": 1, "replies": []}, {"body": "By fund, SPDR S&P 500 ETF (SPY +0.2%) had the most inflows — $13.5B— in December, followed by Vanguard Total Bond Market II Index Fund at $6.27B.\n\nSauce: seekingbeta", "score": 1, "replies": []}, {"body": "Based on this data I’m all in on SNAP", "score": 1, "replies": []}, {"body": "ALL in $SU got it", "score": 1, "replies": []}, {"body": "Do you account for people who do Ayyyymmmdd", "score": 1, "replies": []}, {"body": "i'd throw money at an ETF of this. not a lot of money, but enough for lolz.", "score": 1, "replies": []}, {"body": "Yeah but which one of these stonks do I YoLo on? Asking for a friend.", "score": 1, "replies": []}, {"body": "SPCE is me and u/ugadawg7 mainly lol", "score": 1, "replies": []}, {"body": "No one is buying the mcdip?!?", "score": 1, "replies": []}, {"body": "wsb indicator", "score": 1, "replies": []}, {"body": "SPCE to the fucking MOON boys", "score": 1, "replies": []}, {"body": "Funny how amd gets mentioned but never intel, the competitor they’re targeting the most and have built their recent successes off of", "score": 1, "replies": []}, {"body": "Please post on reg!", "score": 1, "replies": []}, {"body": "'#1 mention SPY --> the highest tax bracket\n\nSPX --> tracks the same index but with lower tax rates --> totally unmentioned\n\n\nI guess that's a moot point around here?\n\nYou only have to pay taxes if you turn a profit so no worries?", "score": 1, "replies": []}, {"body": "How many GUH mentions?", "score": 1, "replies": []}, {"body": "Bifurcate between bullish and bearish mentions.", "score": 1, "replies": []}, {"body": "Go TSLA!", "score": 1, "replies": []}, {"body": "Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq \n\nTqqq Tqqq Tqqq Tqqq \n\nTqqq Tqqq Tqqq Tqqq \n\n\nTqqq Tqqq Tqqq Tqqq \n\nTqqq Tqqq Tqqq Tqqq \n\n\n\n\n\nTqqq Tqqq Tqqq Tqqq \n\nTqqq Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq Tqqq \n\nTqqq Tqqq Tqqq Tqqq \n\nTqqq Tqqq Tqqq Tqqq \n\n\nTqqq Tqqq Tqqq Tqqq \n\nTqqq Tqqq Tqqq Tqqq \n\n\n\n\n\nTqqq Tqqq Tqqq Tqqq", "score": 1, "replies": []}, {"body": "No $TQQQ or $UVXY?", "score": 1, "replies": []}, {"body": "This is WSB so I'm surprise there's no DICKS.", "score": 1, "replies": []}, {"body": "Where the fuck is V, I love V", "score": 1, "replies": []}, {"body": "No QCOM...", "score": 1, "replies": []}, {"body": "lolol SU. that's Sue bae.", "score": 1, "replies": []}, {"body": "Fuck $ROKU, can't stop losing on that one.", "score": 1, "replies": []}, {"body": "Now which included \"fuck!\"", "score": 1, "replies": []}, {"body": "This is awesome! Thanks, bro!", "score": 1, "replies": []}, {"body": "How are you able to compile a list like this", "score": 1, "replies": []}, {"body": "Where the fuck is $ROPE?", "score": 1, "replies": []}, {"body": "I made a weighted long/short portfolio of this and will put it through its paces. The capital outlay is high and it has  beta of 1.102 but nice resilience to changes in price coordinated with volatility. Will have to see how expensive the rebalancing gets (I normally rebase to 100 lots to allow for dynamic hedging with options without fractionality). Well done, this was some nice work.", "score": 1, "replies": []}, {"body": "If you buy what wsbs  are buying you distend to make money , i went against that and I lost 121k in short time trust me", "score": 1, "replies": []}, {"body": "FAKE!! Never shows $ROPE.", "score": 1, "replies": []}, {"body": "So should I go all in on the top 5 or diversify by buying them all to be on the safe side?", "score": 1, "replies": []}, {"body": "Meme Stock Index", "score": 1, "replies": []}, {"body": "Please post this update daily. I'll reward you with my precious karma\n\nPlus this could create some very powerful synergism within the community", "score": 1, "replies": []}, {"body": "It would be interesting to see mentions broken out by day and overlayed onto the stock trend.", "score": 1, "replies": []}, {"body": "I remember 2 weeks ago when nobody had even heard of SPCE lol", "score": 1, "replies": []}, {"body": "Did you like count everyone if them.   \nWow amazing.", "score": 1, "replies": []}]}
{"title": "What if Robinhood is preventing a recession from happening?", "selftext": "Something that came up in my head this morning. So basically Robinhood is allowing people with access to a smartphone to invest into the market, pumping more money into the market and a reason why it’s at an all time high. There’s over 10 million users on the platform as it is. \n\nStonks only going up from here on out until Robinhood can’t keep up.\n\nEdit: So going off of robinhood’s reporting, there’s over 10 million users, with each account having an average of 1k - 5k. That’s a max possibility of $50 billion.", "id": "eq0l1n", "created_utc": 1579268902.0, "score": 853, "upvote_ratio": 0.93, "num_comments": 180, "comments": [{"body": "What if me peeing in the beach is preventing the ocean from going dry", "score": 556, "replies": [{"body": "If we all pee’d on Australia maybe the fires would go out.", "score": 183, "replies": [{"body": "If we all peed on the beech at the same time it would create a giant title wave that would completely put out Australia", "score": 12, "replies": [{"body": "I'd pee on Australia even of there were no fires.", "score": 10, "replies": [{"body": "global x Australia 2 seek sing trade. fires will be out in 2 weeks", "score": 1, "replies": []}]}]}, {"body": "I'd rather burn.", "score": 12, "replies": []}]}, {"body": "THANK YOU!!!\n\n-The Mermaids", "score": 63, "replies": [{"body": "FUCK YOU!!!\n\n-The Koalas", "score": 5, "replies": []}]}, {"body": "Everyone knows the ocean is 90% pee. We all contribute.", "score": 25, "replies": []}]}, {"body": "When you don’t let farts out, they travel up to your head and become shitty ideas. That’s what you are experiencing.", "score": 1718, "replies": [{"body": "[deleted]", "score": 225, "replies": [{"body": "Commenting on wsb while your boss is right behind you?", "score": 128, "replies": [{"body": "[deleted]", "score": 104, "replies": [{"body": "Can't possibly go tits up", "score": 164, "replies": [{"body": "[deleted]", "score": 40, "replies": [{"body": "Surprise, your boss is also on WSB and hiding his window with his torso!", "score": 36, "replies": [{"body": "It's true, I was torso!", "score": 17, "replies": []}, {"body": "He wouldn't hide it, i regularly see him looking at total shite online like boomer memes and The Sun newspaper", "score": 9, "replies": []}]}]}, {"body": "I’m balls deep in “boss moving slightly to the left” calls", "score": 3, "replies": [{"body": "Bold move, but will the tits follow?", "score": 1, "replies": []}]}]}, {"body": "\"Whatcha laughing at?\"\n\n\"A comment...in the code. From 2004.\"", "score": 8, "replies": []}, {"body": "I use http://codereddit.com/, everybody thinks I'm coding", "score": 5, "replies": []}, {"body": "That’s a real baller Office Space move right there.", "score": 1, "replies": [{"body": "The trick with being lazy is to appear like you work hard.  I work from home 3 days a week and my boss and his wife (who sometimes helps with accounts) both think i work really hard and should take more holidays\n\nI barely do anything", "score": 1, "replies": []}]}]}, {"body": "part of my job is finding those occasional lil nuggets of interesting info from WSB for my boss so that he never has to actually interact with you degenerates", "score": 8, "replies": []}, {"body": "Thicc dicc energy", "score": 1, "replies": []}]}, {"body": "Trying not to burst out laughing because I'm right behind my employee", "score": 5, "replies": []}, {"body": "Don’t meet too many fellas named Ross even in the states", "score": 2, "replies": [{"body": "Ross Perot is the GOAT Ross\n\nHe was right about the giant sucking sound", "score": 4, "replies": []}, {"body": "Only place you'll meet more than a tiny number is in Scotland and maybe Ireland.  Its nice to have an uncommon name!", "score": 1, "replies": [{"body": "Only if it’s not a bad one lol", "score": 2, "replies": []}]}]}, {"body": "do you want a medal?", "score": 1, "replies": []}]}, {"body": "I'm going to steal this", "score": 3, "replies": []}, {"body": "That's funny because I thought that a fart was just a shitty idea screaming to get out.", "score": 2, "replies": []}, {"body": "What the fuck.. haha 😂😂", "score": 2, "replies": []}, {"body": "COMEDY. GOLD.", "score": 1, "replies": []}, {"body": "HOLY MOLY he gone", "score": 1, "replies": []}]}, {"body": "10 million $40 accounts doesnt effect the economy", "score": 381, "replies": [{"body": "Everything changed when the Fed opened its Robinhood account and started using that leverage", "score": 169, "replies": [{"body": "JPow: QE, RH edition", "score": 6, "replies": []}, {"body": "Granted, it was completely within their risk tolerance to do so...", "score": 4, "replies": []}, {"body": "Underrated comment...", "score": 3, "replies": [{"body": "I think it’s properly rated", "score": 29, "replies": [{"body": "I'd like to sell a straddle on this post, I think it'll stay flat now.", "score": 3, "replies": []}]}]}, {"body": "So long as it is at it personal risk tolerance, should be good to go.", "score": 1, "replies": []}]}, {"body": "Lol I asked a buddy of mine who works at BNP about ROKU and he said something like 'yeah I'm sure the RH users buying 1 option contract for $300 are really swinging it\"", "score": 27, "replies": [{"body": "There you have it, confirmation!", "score": 1, "replies": []}]}, {"body": "Oh come on I’ve seen too many fuck tards posting over 30k losses on this sub to believe that", "score": 130, "replies": [{"body": "[removed]", "score": 63, "replies": [{"body": "Marty says hold my MU", "score": 10, "replies": [{"body": "Our $90Cs will be ITM any day now...", "score": 11, "replies": []}]}]}, {"body": "That still ain’t shit to the market.", "score": 50, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "This is an extreme sampling bias. People who earn a lot or lose a lot are far more likely to post these results to reddit.\n\nYou cannot extrapolate reddit post results to all users.", "score": 1, "replies": []}]}, {"body": "Affect >_>", "score": 3, "replies": [{"body": "When did this become so complicated?", "score": 2, "replies": []}]}, {"body": "😅 true story", "score": 2, "replies": []}, {"body": "Actually it’s $60", "score": 2, "replies": []}, {"body": "A $40 million trade has market impact", "score": 2, "replies": [{"body": "imagine multiplying 40 by 10 and getting 40", "score": 19, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Prove it", "score": 12, "replies": []}]}, {"body": "Not across the whole market", "score": 2, "replies": []}, {"body": "Depends, on spy? Nope. On some shitty penny ya", "score": 2, "replies": []}]}]}, {"body": "unlikely considering that roughly 85% of liquid capital (investable $$) is in the hands of boomers and older lol.", "score": 143, "replies": [{"body": "Imagine if we taught the boomers to use robinhood.", "score": 160, "replies": [{"body": "They'd demand to see a manager when their FDs eventually expire worthless.", "score": 129, "replies": [{"body": "When life gives you lemons, don't make lemonade. Make life take the lemons back! Get mad! I don't want your damn lemons, what the hell am I supposed to do with these? Demand to see life's manager!", "score": 40, "replies": [{"body": "That can be arranged.....", "score": 9, "replies": [{"body": "Hello, this is death. What can I do for you?", "score": 6, "replies": []}]}, {"body": "You forgot \"bootstraps\"", "score": 6, "replies": []}, {"body": "Cave? Is that you??", "score": 4, "replies": [{"body": "Caroline?", "score": 3, "replies": [{"body": "You son of a bitch, where's my 4O1K and fucking body?!", "score": 3, "replies": []}]}]}]}, {"body": "Maybe this is why they hold 85% of the wealth... they aren’t losing it on weekly fds", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 28, "replies": [{"body": "Time to send her a referral.", "score": 10, "replies": []}, {"body": "\"Hey aunty! Do you want a free stonk?\"", "score": 2, "replies": []}]}, {"body": "It would be stonks for us and not stonks for them", "score": 2, "replies": []}, {"body": "Hey I got my mom on there.", "score": 1, "replies": []}]}, {"body": "Yeah, going to suck when that 85% need to cash out to retire and the buyers only have 15% maximum to buy it with.", "score": 9, "replies": [{"body": "Most Boomers are already retired. Turns out they don't pull their stocks. They just die of cancer and heart disease, and then they pass their stocks down to their kids and grandkids.t", "score": 14, "replies": [{"body": "Wtf am I going to do with JcPenney and GM stock? Might as well give it to charity lol. I bet there is a lot of stock that just gets lost and forgotten about.", "score": 20, "replies": [{"body": "Three of my five grandparents went senile. One literally had bonds buried on his 40-acre property in the boonies. I'd bet a fuckton of Boomer money gets lost and fogotten forever.", "score": 16, "replies": [{"body": "nah you're thinking of the Boomers themselves; I aint forgetting that buried boomer treasure ill be out there with a spade and a dog specially trained to sniff out commemorative silver coins and Lagerfeld cologne", "score": 15, "replies": [{"body": "It's seems common that Boomer's kids and grandkids kids don't even understand their own finances, let alone their parent's or grandparent's finances. But, yeah, you're probably right that most people get involved early enough to at least be aware of whatever savings exists. Cheers.", "score": 4, "replies": []}]}, {"body": "If there is money to be made on it there will be opportunists who find ways to capitalize on it.", "score": 1, "replies": [{"body": "I agree with that statement 99.9% of the time. But, not in this case. Fun story:  had we not found my Gramp's will in a filing cabinet in the corner of his attic stuffed in a bunch of random tax documents -- a full three years after he had passed -- we definitely never would have found those bonds. The will didn't even have a map to where they were buried. He just wrote \"bonds by Willow\"...turns out Willow was a dog he had that no one even knew about. The dog was buried under an apple tree, and the bonds were under the tree next to it, buried 3-4 ft down. So, even after we knew they existed, it took us about a week to find them. There was ~$75k in bonds. Lol. My Gramp's was bonkers.", "score": 8, "replies": [{"body": "That is true that there will be some breakage with some crazy Boomers that bury their gold and other assets or physically store them in ways that make no sense and possibly can't be recovered. But my parents (who I would say are on the middle to younger end of boomers at 62) have all their assets in a brokerage account and in their home. Nothing that is buried luckily.", "score": 1, "replies": [{"body": "Not bad.  I'll be inheriting like 10 pyramid scheme 'businesses' from my mom", "score": 3, "replies": [{"body": "I don't think I will inherit much on their house as I think they will most likely sell it in 5 years and then move to a low cost area and live off the difference, dividends and social security. I do think their stock portfolio will be solid however as it nets them 8.5k a year in dividends. I honestly don't want much from them I just want them to live comfortably in retirement and whatever else I get is gravy", "score": 2, "replies": []}]}]}]}]}, {"body": "I’ll start a wilderness rehab program for troubled youth, and could have that 40 acres dug up for 1/2 them bonds.", "score": 1, "replies": []}, {"body": "I remember my grandma gave me a stack of these worthless treasury bonds that appreciated like 2% in 10 years.\n\n\nBraindead  ****.", "score": 1, "replies": []}, {"body": "5?", "score": 0, "replies": [{"body": "Yes. Mom's mom => 👉👌👈", "score": 1, "replies": []}]}]}, {"body": "My old man has been holding Apple since the late 90s (he’s been a big fanboy since the 80’s).  He originally had a significant amount of shares from the 80’s but his stock broker convinced him to sell it in the mid 90s when Apple was dwindling.  He’s happy he bought back in against his brokers advise!  He doesn’t talk about money so I have no idea how many shares he has.  I’m really curious though...", "score": 4, "replies": []}, {"body": "GM you hold forever, part of new trade agreement, (not the China one) is mandating that a ton of cars and car parts be built in America. Idk I watch the pbs news hour. Jcp I don’t know but if you get free gm just hold and get the dividend.", "score": 1, "replies": [{"body": "Yeah ok, I'll put it next to my blockbuster and coal mining stocks.", "score": 4, "replies": []}]}]}, {"body": "People who have actual money live off the interest for the next 5 generations, that is if they set up a trust.", "score": 1, "replies": []}]}]}, {"body": "Someone has to get all the money that gets lost on robinhood.", "score": 2, "replies": []}, {"body": "Prices are set at the margin, however.", "score": 1, "replies": []}]}, {"body": "Burger King must be slow this morning", "score": 102, "replies": [{"body": "Sir, this is a Wendy’s", "score": 84, "replies": [{"body": "No, this is Patrick!", "score": 20, "replies": []}]}]}, {"body": "Robinhood? Prolly not. Retirement Accounts that people add to monthly and never ever actively manage? Definitely.", "score": 47, "replies": [{"body": "So 401k’s are pretty recent right? That could be the cause as well. This is going to be one big fucking bubble when it pops.", "score": 5, "replies": [{"body": "I mean dude we just entered the booming 20s, get ready for 2029", "score": 20, "replies": [{"body": "Great Depression 2: Electric Boogaloo. America can get as depressed as I am.", "score": 6, "replies": []}]}]}]}, {"body": "Our losses are propping up the market.  Good work, boys!", "score": 19, "replies": []}, {"body": "A recession is a function of GDP, not the stock market.", "score": 40, "replies": [{"body": "Take your knowledge and critical thinking skills and go over to personal finance, this is wallstreetbets.", "score": 21, "replies": [{"body": "\"But like what if instead of selling trash, *WE BOUGHT IT INSTEAD*\" -How WSB thinks they can avoid a recession.\n\n It's the fact assets are trash that will cause the recession, not whether you buy or sell them.", "score": 4, "replies": []}]}, {"body": "but the stock market doing badly could cause a drop in GDP right?  i mean less M&A, less business confidence, less investing maybe etc", "score": 2, "replies": []}]}, {"body": "I don't think the volume of money investors on Robinhood have put into the market is that significant. Even if there are 10 million investors who put in an average of 10k (Which is a very generous estimate as I think most accounts are more casual investing) that's still only 100 billion dollars. Even assuming all 10 million people wouldn't have invested using another brokerage (Which isn't a fair assumption) that 100 billion in the market is still a fairly small amount of volume compared to what just a few pension funds contribute.\n\nNot to say that 100 billion couldn't have a small positive impact on the market but it isn't the fulcrum supporting the market from recession.", "score": 6, "replies": [{"body": "This was originally a shit post, but I honestly think RH could have some influence on the market, maybe not now but the near future with the trend of more users signing up and dumping cash into it.", "score": 5, "replies": [{"body": "I knew it was a shitpost but I actually entertained the idea and it wasn't that outlandish that Robinhood and more accessible trading could move the needle on the market a little bit. But considering the volume of investing done by other big entities like Mutual Funds, ETF's, Large Brokerages, and Pension funds the overall impact is more like a cherry on top. Considering that unless something reorients the US economy most Americans don't really have a lot of liquidity (78% of workers live paycheck to paycheck) distributed to the middle and working class anymore. \n\nSo I don't know where this massive push of investing is going to come from at a meaningful volume if a lot of the 22% that has capital has already began to invest.", "score": 3, "replies": []}, {"body": "You do realize that now that real brokerage firms have dropped commissions, robinhood’s only value proposition is gone, right?\n\nThey are a MINUSCULE percentage of trading in the market and i would be surprised if they gather any additional assets at all going forward. RH is a joker of a broker, from risk controls to not checking out the details of SIPC and FDIC insurance before marketing an illegal banking product.", "score": 2, "replies": []}]}]}, {"body": "It may be helping increase the size of the bubble. Cash inflows are greater than cash out flows and when that trend reverses, the bubble will burst and prices will correct. RH is only helping increase the cash inflows. Eventually the outflows will be greater.", "score": 6, "replies": []}, {"body": "The Fed pumps $50 billion into markets every morning", "score": 4, "replies": []}, {"body": "You moron, investing in companies doesn't make their revenue go up or down.  When you flush the toilet, do you think it just goes into your gutter outside?", "score": 3, "replies": []}, {"body": "They are the reason commissions came down but \nmost of this game is zero sum", "score": 5, "replies": []}, {"body": "I feel like a super hero or something.  I want a statue of me in NYC", "score": 2, "replies": []}, {"body": "....do you know anything about the great depression? Literally everyone owned stock and that was largely what caused it when everyone lost all of their assets virtually overnight", "score": 2, "replies": [{"body": "long canned food", "score": 1, "replies": []}]}, {"body": "$50BN - 😮 \n\nThe Fed could barely match that on a daily basis during their repo operations. We are truly stronger than we know...", "score": 2, "replies": []}, {"body": "US markets hold something like $35 trillion. By your number, Robinhood's $50 billion is aprox 0.15%, (or 1/700th) of total US capital. A drop in the bucket.\n\nAll Robinhood users combined are worth less than a Trump tweet.", "score": 2, "replies": []}, {"body": "Dude....seriously 😂", "score": 2, "replies": []}, {"body": "Fed probably pumped that much money in one night. Robinhood users ain’t doin nothin it’s the fed", "score": 2, "replies": []}, {"body": "OP doesnt realize $50B is a drop in the bucket.", "score": 2, "replies": []}, {"body": "It’s peanuts compared to investment bankers and 401ks.", "score": 2, "replies": []}, {"body": "You know the Fed is injecting $100 billion into the market or so via repurchase agreements on the daily. RH is utterly powerless to move the S&P even one full point assuming all their users agreed to buy or sell the same security at the same time.", "score": 2, "replies": []}, {"body": "\"What if C-A-T, really spelled DOG\"\n\n&#x200B;\n\nThat's heavy Ogre", "score": 2, "replies": []}, {"body": "You're retarded for several reasons. \n\n1) a recession is 2 consecutive quarters of GDP contraction. Stock price decrease =/= recession. \n\n2) Robinhoods assets under management is about $20BN which is like one tenth of one percent of the US stock markets $34 trillion capitalization. Like RHs entire AUM is a rounding error when calculating the total market capitalization. \n\n3) your assuming that all of RH AUM would be socked away under a mattress if RH didnt exist. In reality almost all of it would be at another brokerage, in a bank, or spent.", "score": 2, "replies": [{"body": "This is tagged as shitpost.... thanks for coming to my TED talk.", "score": 1, "replies": [{"body": "In the thread right above this one you're unironically trying to argue that rObIn HoOd CoUlD tOo MoVe ThE mArKeT. 50 BilLiOn Is A lOt 🤤\n\nThen in another comment you literally said you think maybe some day soon RH could move the market implying you genuinely believe retail pennies can cause a market wide bubble. \n\nYou're retarded, but that's okay! Own it bby!", "score": 1, "replies": [{"body": "It’ll influence the market eventually, I’ll comment on here when it does buddy boy", "score": 1, "replies": []}]}]}]}, {"body": "Robinhood is responsible for maybe 0.01% of volume.", "score": 1, "replies": []}, {"body": "This should be a showerthoughts post.", "score": 1, "replies": []}, {"body": "Yea been wondering that ever since most brokerage house went zero commission. Bring in 'new' money so the 'old' money can take its gains and exit stage right.", "score": 1, "replies": []}, {"body": "Actually I'm fairly certain that ACB has been their most popular stock at at least one point soooo", "score": 1, "replies": []}, {"body": "Retail doesn’t move the market \n\n\nWe are retail", "score": 1, "replies": []}, {"body": "Roaring twenties here we come", "score": 1, "replies": []}, {"body": "Guh", "score": 1, "replies": []}, {"body": "Lol. It's chump change considering the fed is printing money and handing it out. That's why we aren't  in a depression. Eventually....", "score": 1, "replies": [{"body": "Inflation", "score": 1, "replies": []}]}, {"body": "Theory is solid but would have to see data behind it to believe", "score": 1, "replies": []}, {"body": "We call that the SEC bruh", "score": 1, "replies": []}, {"body": "I'm convinced it's index funds. But I'm also an idiot.", "score": 1, "replies": []}, {"body": "That's more plausible than some of the crap that's been posted on the sub reddit forum lol.", "score": 1, "replies": []}, {"body": "Whenever I see posts like these I usually assume adderrall is a big contributor. Slow it down there bud", "score": 1, "replies": []}, {"body": "We all know that when we are tapping on the debit card we are really making the stocks go up.", "score": 1, "replies": []}, {"body": "And in that pit of tendies, I was euphoric.", "score": 1, "replies": []}, {"body": "Retail traders as a whole aren't that big let alone the 18 year olds and their $200 on robinhood", "score": 1, "replies": []}, {"body": "That's similar to people thinking that high P/E's are due to lots of investors taking advantage of index funds. These funds have become huge in the past 10-20 years and are indiscriminate investments.", "score": 1, "replies": []}, {"body": "Maybe the recession is priced in", "score": 1, "replies": []}, {"body": "It’s probably more that millennials can afford to save and invest now", "score": 1, "replies": []}, {"body": "Wait... you can buy regular stocks on Robinhood? Why would they allow such an un-chad like behavior?", "score": 1, "replies": []}, {"body": "You're not entirely wrong. There has been discussions on CNBC about how robinhood has disrupted the industry and given more people access to the market, which all financiers agree is a good thing. That part of your argument I agree with and is generally accepted.\n\nBut more people investing into a market doesn't necessarily cause a bubble. A bubble occurs when things are grossly overvalued and then in a very quick period of time people realize the overvaluation, people immediately start to sell, and then the crash happens.\n\nThere could be an argument made that we are in or entering a bubble because people are overestimating the significance of current geopolitical events (e.g. phase one China deal), but that affects all market makers, not just people on Robinhood.", "score": 1, "replies": []}, {"body": "Rhood users are the pinnicle of the greatest fool to buy. Retail jr crowd. Investing illiterates.", "score": 1, "replies": []}, {"body": "Can't be because Robinhood sells the most customer order flow", "score": 1, "replies": []}, {"body": "It’s not only RH, in general most brokers have really lowered or completely eliminated transactions fees and the push to index investing should be helping too. There are millions of people blindly throwing money to the top 500 companies whether they go up or down have good or bad news", "score": 1, "replies": []}, {"body": "Wow $50B in investments... Amazing how all that money is holding up the stock market!", "score": 1, "replies": []}, {"body": "Do you really think RH is a drop in a bucket compared to 401(k) funds at literally every employer?", "score": 1, "replies": []}, {"body": "Jeff bezos putting his earnings into the stock market is singlehandedly holding it up.", "score": 1, "replies": []}, {"body": "I think it may be fueling speculation", "score": 1, "replies": []}, {"body": "Plus it reinforces the algo's buying", "score": 1, "replies": []}, {"body": "Joint ownership, combined with the axiom of shareholder value maximisation, implies motivation for the companies in the joint owners‘ portfolios to reduce quality and increase prices, resulting in a reduction of prosperity in the economy. In other words: while shareholders profit from the concentration of ownership, consumers will pay more. Institutional investors have never been bigger. The increase in size, influence, and importance of institutional investors reason for the increasing wealth disparity across the board. \n\nIn even simpler terms: big fund bois like BLK drive the market because they influence 5% of everything. \n\nRobinho is a phusay, think big, think institutional money and your statement is spot on.", "score": 1, "replies": []}, {"body": "$50B is still lots if it can be focused into daily volume \nI think that if we all buy calls,were gonnna go down but as long as there are some bears buying puts, the bulls can benefit", "score": 1, "replies": []}, {"body": "RH also gives people infinite money", "score": 1, "replies": []}, {"body": "no", "score": 1, "replies": []}, {"body": "Recession is 3 consecutive quarters of GDP decline.\n\nStocks can go up or down and it won't be a recession.\n\nEdit: I'm an idiot and actually it is 2 quarters. Still nothing to do with stock prices.", "score": 1, "replies": [{"body": "2.. but you typically don't realize it until the middle of the third", "score": 2, "replies": []}, {"body": "*2 quarters, nice try tho", "score": 4, "replies": []}]}, {"body": "Lol imagine thinking the pennies the RH users put in make any difference whatsoever. All the RH users combined don't even equal 1 institutional investor.", "score": 1, "replies": [{"body": "Pennies? There’s over 10 million users. Robinhood reported that the average user has 1k - 5k in each account. That’s max $50 billion. You’re telling me that isn’t equal to one institutional investor?", "score": 1, "replies": [{"body": "$50 billion is absolute pennies. Blackrock alone has $6.7 TRILLION AUM.", "score": 1, "replies": [{"body": "Blackrock is a passive investor for the most part; they get to do exactly what the indexes track, and don't get to deviate from that.", "score": 1, "replies": [{"body": "That passive investing has infinitely more affect on the market than RH investors.", "score": 1, "replies": []}]}]}]}]}, {"body": "Is tsm going to recover?", "score": 0, "replies": [{"body": "No.", "score": 3, "replies": []}]}, {"body": "This post gave me cancer", "score": 0, "replies": []}, {"body": "The government pushes over 50 billion in repo operations in one month. That’s why stocks keep going up. It’s not from investors like us", "score": 0, "replies": []}]}
{"title": "I found out why I get morning wood", "selftext": "I'm a college finance student who doesn't pay any attention in class, but still makes incredibly smart and very intelligent bets and plays in the stick market. I started waking up at 6:30am to check on my sticks because im not a beta fuck who lives on the east coast. turns out over the last two weeks, every morning i woke up with a stiffy, my 1/31 AMD $65 calls had inched back towards break even. Every day they lost value, I was softer than Jeff Bezos's head.\n\n&#x200B;\n\nIve come to the conclusion that kind of like how animals can detect a natural disaster, our bodies can detect directional movement in the stick market. if you wake up without a bonre, don't even open up robinhood. thanks for coming to my ted talk\n\nUpdate: woke up from a Lisa su dream with some sticky in my pant. This works for after market close too", "id": "eq2poz", "created_utc": 1579278847.0, "score": 4313, "upvote_ratio": 0.96, "num_comments": 161, "comments": [{"body": "I wake up with a bonré every morning", "score": 682, "replies": [{"body": "stonks only go up", "score": 176, "replies": [{"body": "And I only go up for stonks", "score": 51, "replies": []}, {"body": "bonré up in my asshole.", "score": 15, "replies": []}]}, {"body": "I touché my bonré", "score": 33, "replies": []}, {"body": "Take my silver garçon", "score": 11, "replies": [{"body": "Gracias senor", "score": 6, "replies": []}]}, {"body": "My bonré wakes me up every morning.", "score": 8, "replies": []}, {"body": "Please make this this highest upvoted comment of all time", "score": 4, "replies": []}, {"body": "I know it’s not mine but I see if I can use it for the weekend or an FD", "score": 3, "replies": []}, {"body": "Oui Oui? 💦🛌", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1980, "replies": [{"body": "Sticks 📈 - - > 🌚", "score": 216, "replies": [{"body": "Sticks only go up too", "score": 35, "replies": [{"body": "Until your 60s", "score": 22, "replies": [{"body": "you're***", "score": 6, "replies": [{"body": "Yoüřé", "score": 3, "replies": []}]}, {"body": "Long PFE", "score": 1, "replies": []}]}]}, {"body": "Sticks as good as stonks?", "score": 21, "replies": []}]}, {"body": "“One of the qualities I’m most known for is my phallic stability. I have a very stable penis. I heard a foreign leader talking of me and this foreign leader... He said.. He says “I respect RareUnicorn, and RareUnicorns very, very, large.. Uh, Thang”", "score": 9, "replies": []}, {"body": "Comment of year imo", "score": 15, "replies": []}, {"body": "Morning wood secured", "score": 18, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "So where do I stick my dick?", "score": 2, "replies": []}]}, {"body": "i gotta get into the stick marker", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 809, "replies": [{"body": "Ultimate autist", "score": 157, "replies": []}, {"body": "wallstreetbets isn't free, it costs buckets and buckets of money.", "score": 71, "replies": [{"body": "Take that 100,000 dollars you were gonna put on tuition and buy ACB calls... some blind guy told us to indirectly. Fuck college hahs", "score": 20, "replies": []}]}, {"body": "He’s the perfect candidate for our annual paper trading contest.", "score": 12, "replies": []}, {"body": "What else are you going to spend money on", "score": 6, "replies": []}, {"body": "World System Builder? Wall Street Bets?  Please fill it in for those of us newbies", "score": -76, "replies": [{"body": "We are obviously talking about the World System Builder here...", "score": 64, "replies": []}, {"body": "Wendy's Stonk Burgers", "score": 45, "replies": []}, {"body": "We Suck Bonre", "score": 22, "replies": [{"body": "When SPY Breakseven", "score": 6, "replies": []}]}, {"body": "Why So Broke?", "score": 3, "replies": []}]}]}, {"body": "It scares me that I'm walking around in the world passing people like this guy on the street", "score": 285, "replies": [{"body": "If you study hard, one day you won’t feel so insecure around successful people.", "score": 165, "replies": [{"body": "> If you study hard\n\nPlenty hard, I'd say.  Sticky in my pants, and all that", "score": 25, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 40, "replies": []}]}]}, {"body": "Heh, autistist going outside. We know neither of you do that", "score": 17, "replies": []}]}, {"body": "who the fucked pinned this", "score": 504, "replies": [{"body": "The fucking retards that continue to ask/upvote this....\n\n\nEVERY NEW WSB POST GETS PINNED TEMPORARILY", "score": 179, "replies": [{"body": "[deleted]", "score": 31, "replies": [{"body": "It could have been any one of us.", "score": 10, "replies": []}]}, {"body": "I honestly thought it was a meme to ask.", "score": 8, "replies": [{"body": "Damn never though of that.  Just took the retardation at face value.", "score": 10, "replies": [{"body": "Smart bet", "score": 6, "replies": []}]}]}]}, {"body": " Lisa Su", "score": 28, "replies": []}, {"body": "Why do people still ask this question", "score": 11, "replies": []}, {"body": "This is the epitome of wsb, why wouldn’t you pin it?", "score": 4, "replies": []}, {"body": "WSB has gone to shit with posts like this.", "score": 5, "replies": [{"body": "Wait... was it ever not shit haha", "score": 2, "replies": []}]}, {"body": "i think it was a mod", "score": -113, "replies": [{"body": "we don't have mods here. just people with additional powers.", "score": 164, "replies": [{"body": "And 2 dads.", "score": 86, "replies": [{"body": "If you woke up naked and your first dad was behind you with an erection and your second dad was in front of you and you had an erection would you rather push forward or push back?", "score": 35, "replies": [{"body": "Someone’s asking the hard questions.", "score": 25, "replies": []}, {"body": "i've seen this question so many times in r/ama, where is it from", "score": 2, "replies": []}, {"body": "What do I look like to you?  Andy Richter?", "score": 1, "replies": []}]}, {"body": "And an extra chromosome", "score": 5, "replies": [{"body": "Mommy-daddy said it's my turn with the extra 23rd chromosome.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Yes they are.", "score": 2, "replies": []}, {"body": "Oh, that kind of powers.", "score": 1, "replies": []}]}]}, {"body": "This is the kind of intuition I come here for", "score": 2, "replies": []}, {"body": "Okay", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 44, "replies": [{"body": "Honestly. I don’t even read the news. Just look at the graph and think; yup, looks like it’s gunna go up. And buy calls. Works 50% of the time", "score": 28, "replies": []}]}, {"body": "[removed]", "score": 162, "replies": [{"body": "Then what is this in my lap", "score": 25, "replies": [{"body": "Bankruptcy documents", "score": 39, "replies": [{"body": "Bankruments.\n\n***\n\n^(Bleep-bloop, I'm a bot. This )^[portmanteau](https://en.wikipedia.org/wiki/Portmanteau) ^( was created from the phrase 'Bankruptcy documents' | )^[FAQs](https://www.reddit.com/axl72o) ^(|) ^[Feedback](https://www.reddit.com/message/compose?to=jamcowl&subject=PORTMANTEAU-BOT+feedback) ^(|) ^[Opt-out](https://www.reddit.com/message/compose?to=PORTMANTEAU-BOT&subject=OPTOUTREQUEST)", "score": 34, "replies": [{"body": "One of the most insightful comments on this thread", "score": 36, "replies": []}, {"body": "You cant just declare bankruptments.", "score": 5, "replies": []}]}, {"body": "Bankrobinhood", "score": 2, "replies": []}, {"body": "Baconruptcinator", "score": 1, "replies": []}]}, {"body": "Wendy", "score": 3, "replies": []}]}]}, {"body": "What is \"finance\"?", "score": 139, "replies": [{"body": "He meant fiancé", "score": 142, "replies": [{"body": "What’s that?", "score": 31, "replies": [{"body": "His boyfriend, duh.", "score": 82, "replies": []}]}]}]}, {"body": "Sticks go up sticks go down \nCan't splain dat", "score": 45, "replies": []}, {"body": "The forces that move markets are all around us in the air we breathe in The food that we eat, It affects us in profound ways . You can get rich and you can get boners.", "score": 18, "replies": [{"body": "*Bonré", "score": 5, "replies": []}]}, {"body": "Woke up soft today \n\nDown 10%\n\nHuh", "score": 13, "replies": []}, {"body": "You don't need to major in finance if you joined this sub dude", "score": 12, "replies": []}, {"body": "Bonre's only go up.", "score": 9, "replies": []}, {"body": "Wood = good", "score": 8, "replies": []}, {"body": "It's priced in, genius", "score": 7, "replies": []}, {"body": "beautiful", "score": 5, "replies": []}, {"body": "Big PP right there", "score": 5, "replies": []}, {"body": "Two in the pink, one in the stonk", "score": 5, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 15, "replies": [{"body": "the D in DD is for Dick", "score": 2, "replies": []}]}, {"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}, {"body": "Polynesians actually found Hawaii by [using their testicles](https://www.ifa.hawaii.edu/friends/Technology_of_Oceania.pdf), so this is totally believable science", "score": 4, "replies": []}, {"body": "emotionally shitposting = don't trade.\n\nget back to center and then trade again, trent reznor", "score": 3, "replies": []}, {"body": "You are a bundle of sticks", "score": 3, "replies": []}, {"body": "You belong here. Welcome, son.", "score": 3, "replies": []}, {"body": "“Pretty girls love trap music so I woke up with my wood hard” 2 Chainz\n\nConclusion: OPs true calling in life is shitposting on hip hop (not finance) boards", "score": 2, "replies": []}, {"body": "STINKS", "score": 2, "replies": [{"body": "You tried", "score": 2, "replies": []}]}, {"body": "So that's what people mean here when they say \"Financial Analysts are a bunch of dicks\"", "score": 2, "replies": []}, {"body": "Ah yes, the age old game of breakeven: “fuck, I just want my money back”", "score": 2, "replies": []}, {"body": "Is this a generational trait...did your dad wake up with a stiffy after dreaming about Meg Whitman and make bank on the early days of Ebay?", "score": 2, "replies": []}, {"body": "Sue bae giving you AMD bonner", "score": 2, "replies": []}, {"body": "Dude you sound like Robert Frank 😂", "score": 2, "replies": [{"body": "Isn’t that the agro weight lifting guy who’s a poor man’s Macho Man? RIP! Lol", "score": 1, "replies": []}]}, {"body": "Sounds like you should write calls on Tesla", "score": 2, "replies": []}, {"body": "Pay attention in class retard\n\nYou’re going to end up on the fuckin streets", "score": 2, "replies": [{"body": "You are autistic.", "score": 2, "replies": [{"body": "💂", "score": 1, "replies": []}]}]}, {"body": "If someone posted a question like \"What kind of posts can I expect on WSB?\", it should be this motherfucker right here.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Nobody ever got rich by not taking risks", "score": 2, "replies": []}]}, {"body": "World runs on eastern time zone, fuck the west coast", "score": 3, "replies": []}, {"body": "WWPD? And now we know", "score": 1, "replies": []}, {"body": "$STINKS", "score": 1, "replies": []}, {"body": "Thanks for the spoiler warning! I will wait until I see the movie to know your amazing story.", "score": 1, "replies": []}, {"body": "Thank you for sharing this, college finance student.", "score": 1, "replies": []}, {"body": "Almost touch your peen before you look at the screen", "score": 1, "replies": []}, {"body": "Your name is where the real genius comes in", "score": 1, "replies": []}, {"body": "Swing and a miss there kid", "score": 1, "replies": []}, {"body": "Oh so this is what this sub is for.", "score": 1, "replies": []}, {"body": "Well if I had a dickometer like that I would ham the market if I woke up with a 3am stiffy.", "score": 1, "replies": []}, {"body": "big pp", "score": 1, "replies": []}, {"body": "Guh.", "score": 1, "replies": []}, {"body": "This, guy, fucks!", "score": 1, "replies": []}, {"body": "dicks only go up", "score": 1, "replies": []}, {"body": "What’s wrong with the east coast man", "score": 1, "replies": []}, {"body": "https://youtu.be/Y_V6y1ZCg_8\nNorwegian Wood", "score": 1, "replies": []}, {"body": "You fucking Gravity’s Rainbow-ed that shit beyond the zero brother. Well done", "score": 1, "replies": []}, {"body": "Lisa Su Dream 😫", "score": 1, "replies": []}, {"body": "Hahahaha", "score": 1, "replies": []}, {"body": "> Every day they lost value, I was softer than Jeff Bezos's head. \n\nWhat, no else is gonna say it?\n\n*\\*sigh\\**\n\nJeff Bezos' head makes him look like a walking cock.", "score": 1, "replies": []}, {"body": "The autism is reaching critical levels", "score": 1, "replies": []}, {"body": "‘softer than Jeff Bezos head’", "score": 1, "replies": []}, {"body": "No lie I woke up at 230 am and went to check futures but the internet was down. I must have sensed it in my sleep.", "score": 1, "replies": []}, {"body": "Finance student!", "score": 1, "replies": []}, {"body": "Wow this is a fucking trainwreck of a post \n\n\nI love it", "score": 1, "replies": []}, {"body": "This right here is why I love WSB :')", "score": 1, "replies": []}, {"body": "This is fantastic shit posting, the best shit posting.   It was a perfect stick.", "score": 1, "replies": []}, {"body": "I think I lost brain cells reading this post. Perfect. I’m ready for Monday morning", "score": 1, "replies": []}, {"body": "Both coasts are a disgrace and beta beyond recovery. Git gud.", "score": 1, "replies": []}, {"body": "Good peeni, good bed", "score": 1, "replies": []}, {"body": "Who else high rn", "score": 1, "replies": []}, {"body": "My erection has lasted more than a decade, should I see my doctor or will that pop entire world economy?", "score": 1, "replies": []}, {"body": "Long random length lumber", "score": 1, "replies": []}, {"body": "Take sildenafil in the middle of the night and enjoy sticks pumping to infinity.", "score": 1, "replies": []}, {"body": "Lost it at \"thanks for coming to my ted talk\"", "score": 1, "replies": []}, {"body": "Dude, if you ever stop getting morning wood, see a doctor. Morning wood is healthy as fuck", "score": 1, "replies": []}, {"body": "Why is Jeff giving head so soft?", "score": 1, "replies": []}, {"body": "Are you on drugs?", "score": 1, "replies": []}, {"body": "WSB is on fucking fire lately.", "score": 1, "replies": []}, {"body": "Never mind Lisa. She is married to someone with a good education. Get your degree using someone's money make a killing as a trader. \n\nLearn good about Greek, Black Scholes.", "score": 1, "replies": []}, {"body": "PM me next time you get a boner", "score": 0, "replies": []}, {"body": "Amazing", "score": 0, "replies": []}, {"body": "So waking up having to shit gives you a boner? Sounds about right.", "score": 0, "replies": []}, {"body": "This post is proof that wsb is for degenerates... Although we all kinda understand what he means lol", "score": 0, "replies": []}]}
