{"title": "Google is getting close to breaking Amazon record as fastest to $1 trillion in market cap", "selftext": "Google is currently at $962B and up in pre market and with a $974B market cap as I type this.\n\nAmazon is four years older than Google and therefore Google should get to $1 trillion ultimately faster than Amazon.\n\nAmazon passed $1 trillion on  Sept 4, 2018 or after 8,827 days since being founded.   Google today is 7,797 days old.   So they have to pass in the next 1,030 days.", "id": "em9x46", "created_utc": 1578577988.0, "score": 612, "upvote_ratio": 0.96, "num_comments": 129, "comments": [{"body": "Feels like Google has been around for much longer than Amazon", "score": 470, "replies": [{"body": "I think its because Google was more useful. Amazon didn't have the web or delivery infrastructure to be a powerhouse but coupled with the power of the internet (thanks to search engines like Google) and delivery logistics it had room to be more practical to consumers. \n\n&#x200B;\n\nImagine ordering packages from amazon on dial up internet and then waiting a week and a half for it to get delivered.", "score": 131, "replies": [{"body": "Yeah that was awesome.  I remember having to write a letter to the seller, and waiting 6 weeks for delivery.  Impulse shopping was a lot harder back in the day.", "score": 46, "replies": [{"body": "Six weeks is a lot longer than I ever imagined! Geez. Especially since sometimes they deliver it to the wrong place. I remember one-time they accidentally delivered a box set of 24 to my house on accident. Imagine waiting 6 weeks for that.", "score": 16, "replies": []}]}, {"body": "Remember when there was more than just one search engine? RIP Ask Jeeves ;___;", "score": 13, "replies": [{"body": "DuckDuckGo ftw", "score": 18, "replies": []}, {"body": "Just having a search \"engine\" was revolutionary.  Alta vista was mind blowing.\n\nBefore that, we used manually curated directories from Yahoo and others.  And before that, people exchanged numeric IP addresses that corresponded to given sites.", "score": 6, "replies": []}, {"body": "Bing?", "score": 2, "replies": []}, {"body": "Bing says hi.", "score": -1, "replies": [{"body": "Let me google that...", "score": 3, "replies": []}, {"body": "Who is Bing?", "score": 2, "replies": [{"body": "Down to 1/2 a percent share on mobile.   Compared to Google with 96%.  Think that might be why people do not know Bing.\n\nhttps://gs.statcounter.com/search-engine-market-share/mobile/worldwide\n\nWorse is Bing lost about 50% of their market share on mobile in the last year.", "score": 1, "replies": [{"body": "I was being sarcastic, but that’s actually really interesting. Bing has been such a massive failure for Microsoft. I don’t think that Cortana is doing much better.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "For most people, it has been around much longer. I think the average person was using google as their search engine going all the way back to like 2000ish (or shortly after, someone can correct me on exact dates) whereas the average person didnt start really using Amazon until 2010 give or take.", "score": 25, "replies": [{"body": "I think I started using Google since around 2000.\nAmazon around 2002 when I started manually importing album arts into my iTunes.", "score": 11, "replies": [{"body": "Oh man this throws me back", "score": 2, "replies": []}]}, {"body": "This makes me feel old. I used Amazon a ton before Google was launched. Back then it was just a bookstore and I bought a lot of books.\n\nAlso my first experience using the Internet was Gopher, before the new-fangled World Wide Web started getting popular. So yeah, I'm old.", "score": 6, "replies": [{"body": "My internet was well before that using cobbled connections through dial up bulletin boards and Usenet and things that created a slow and batched form of \"internet\".  Then college connections in which you used numeric codes for text and file transfer.  Gopher was interesting but the jaw dropping day was when I saw the first http modified view of gopher pages.  The way many links could hyper link to many other links seemed like there would be endless possibilities.  And apparently, there were!\n\nI changed my life view that very day, same as when I first saw a practical demonstration of Fraunhofer audio compression.", "score": 4, "replies": [{"body": "There is a whole generation (or two) that has never heard the chirping sound of a dialup modem synching. I am feeling my age at the moment", "score": 3, "replies": [{"body": "Not sure I would say chirp noise.  Maybe static or whistling?  Early ones we popped rubber cups onto a phone handset.", "score": 2, "replies": [{"body": "One person's whistle is another's chirp XD\n\nWe had the handset modems when I was in elementary school. We could log onto the state library to play ASCII Start Trek. IIRC 2400 was all the rage by the time I got to college.", "score": 1, "replies": []}]}]}]}, {"body": "Yup, gopher and mosaic chiming in.  36 y/o here.  Shit changed *fast* as a kid.", "score": 1, "replies": []}]}, {"body": "I dunno, I've been using Amazon since the late 90s. It was still \"Earth's largest bookstore,\" but the price of books on the site was so cheap. And, if you were in college, it was absolutely the first place you would look to order textbooks.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "that's because most of the venue came from aws", "score": 0, "replies": []}]}, {"body": "Amazon is actually four years older.\n\nAmazon founded in 1994 and Google 1998.\n\nInteresting fact is Bezos saved Google at one point\n\nhttps://www.growthink.com/content/story-jeff-bezos-250000-investment-google-1998\nThe Story of Jeff Bezos' $250000 Investment into Google in 1998", "score": 20, "replies": [{"body": "Just like Bill Gates saved Apple at a point as well. Interesting. Didn't know that about Papa Bezos. Gates did it to tamp down the heat that he had a monopoly I believe.", "score": 11, "replies": []}]}]}, {"body": "[deleted]", "score": 24, "replies": [{"body": "Wouldn’t be surprised if it’s true. The human brain has weird biases like that. Being more inclined to invest in something because it hits a certain number is irrational though. A company doesn’t magically become better overnight because of their stock price being even.", "score": 8, "replies": []}, {"body": "It's more likely that people will buy a stock after a split. For whatever reason buying 10 shares at $100 a piece seems better than buying 1 share for $1000.", "score": 2, "replies": []}]}, {"body": "Pretty amazing when consider the founders could not even get a million for Google at one point.\n\n\"'When Google Wanted To Sell To Excite For Under $1 Million — And They Passed\"\n\nhttps://techcrunch.com/2010/09/29/google-excite/", "score": 76, "replies": [{"body": "[deleted]", "score": 33, "replies": [{"body": "Best I can do is $5.", "score": 20, "replies": []}, {"body": "That is for sure.   Google is into just about everything today.\n\nWhich is why they look to be the fastest to a trillion .\n\nWould never have got there with just search.\n\nThey have 93% of search \n\nhttps://gs.statcounter.com/search-engine-market-share\nSearch Engine Market Share Worldwide | StatCounter Global ...", "score": 6, "replies": [{"body": "Loosing search share to duckduckgo though", "score": 3, "replies": [{"body": "Google share is actually increasing.  Slowly but increasing.   There is not much left.\n\nhttps://gs.statcounter.com/search-engine-market-share\nSearch Engine Market Share Worldwide ...", "score": 9, "replies": []}]}]}]}]}, {"body": "Facebook is gonna then improve the record.\n\nNo company which was founded in the QE era seems to be poised to get there though, maybe capital is indeed sparsely misallocated elsewhere.", "score": 22, "replies": [{"body": "Do think the next will be FB.  But has a very long way to go.    Only $620B right now.", "score": 14, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "Highly doubtful.  There are 2B people on FB.  FB is only useful because your friends are on it.  Getting people to switch social media sites would be tough.  Look at Google+.", "score": 33, "replies": [{"body": "It's also very diversified. They are staying on top partially because they assimilate competitors into their ecosystem as soon as they break the surface. IG, WhatsApp, who knows what's next.", "score": 11, "replies": [{"body": "Along with killing snapchat by taking their best features like stories/filters", "score": 3, "replies": []}]}]}, {"body": "It is more about Instagram at this point.", "score": 9, "replies": []}, {"body": "I agree. Deleted my Facebook along time ago and so did many other people I was friends with. The younger generation is also not on Facebook.", "score": -4, "replies": [{"body": "Instagram?", "score": 22, "replies": [{"body": "People know FB owns Instagram right?? Feel like I say this way too often", "score": 1, "replies": []}, {"body": "Curious how IG is going to fight against TikTok. I’m seeing a lot of momentum in the latter with younger ppl\n\nEdit: looked into it, apparently FB has a [TikTok clone](https://www.google.com/amp/s/techcrunch.com/2019/10/01/instagram-vs-tiktok/amp/). Will be interesting to see how this plays out", "score": 1, "replies": [{"body": "It's a fad", "score": 8, "replies": [{"body": "Perhaps. Idk I thought it was a fad last year but I’m seeing more and more of ppl I follow on IG going there. They’ll still also post the same video on IG, but still, shows ppl transitioning over", "score": -4, "replies": []}]}, {"body": "Yeah, Tik Tok seems a fad as mentioned, and No apparent Stock quote offer.  Snapchat maybe a close competitor to FB if you need to compare young social demographic. And then Tencent, with wechat is the Chinese counterpart of a bit like FB, but it does payment too, so can't be a direct competitor.\n\nVR of FB, and AR of SNAP can collide with each other.", "score": 2, "replies": [{"body": "I completely forgot about snapchat haha. I think the demographic of snapchat and tiktok are much more similar. TikTok probably poses a bigger threat to SNAP than it does to IG", "score": 2, "replies": []}]}, {"body": "Tik Tok is cool, I use it to see memes and other cool shit. However, I don’t see myself ever posting on it. Most of my friends just use it to browse for interesting things. So yeah, it’s working but most people aren’t there to make Tik Tok’s themselves other than kids and influencers. Can’t see myself dancing on camera than posting it on the internet unfortunately.", "score": 1, "replies": []}, {"body": "They'll compete by taking what makes tiktok popular and applying it to their own app, just as they've done with snapchat and vine already.", "score": 1, "replies": [{"body": "What makes TikTok popular though is it’s ability to show content without it being chronological. So a post from someone a year ago can still show up on your news feed if the algorithm thinks you’ll enjoy it. Don’t see how IG can emulate this, it’s such a fundamental difference. Thoughts?", "score": 2, "replies": [{"body": "I just got Instagram back after a few years without so I'm definitely no expert but I know on the explore page if I click a video it will play then automatically scroll to the next related video. Instagram could devote a section of the app to play the videos non-chronologically like on tiktok, or perhaps have it as as setting to be turned on and off", "score": 1, "replies": []}]}]}]}]}, {"body": "I am the younger generation. Everyone is on Facebook.", "score": 2, "replies": []}, {"body": "I’m 19, still use FaceBook with many of my friends. Instagram and Snapchat are the other two big ones, IG being owned by FB and SC isn’t worth buying into, they just implemented stories on IG and FB instead. They have a ton of cash, if anything comes out that Zuckerberg thinks is worthwhile, he could just make acquisitions like he did with IG. FB is still growing, their revenues grow even faster from ads despite small growth in userbase. I don’t see them going anywhere, they’re too established. Trying to make a social media platform is extremely difficult right now. The only reason people are on there is because friends and celebrities are on there, building the network is the most crucial and difficult task in the business.", "score": 1, "replies": []}]}]}, {"body": "Facebook isn’t going to be making money from their own platform for many years longer. The only people who still use Facebook are either old, using it as a SSO, or are trying to sell something. It’s lost its grip as a social media platform because of their egregious privacy policies.\n\nPeople are still into the Instagram fad, but I feel like that might dwindle too, when the average user realizes how Facebook is using their data since being acquired.", "score": -3, "replies": [{"body": "If really believe this then sell short.    But be careful as think you are wrong.  \n\nFacebook right now is growing at over 25% and has some room to run.\n\nDo think Google is the better investment but think can not do wrong owning FB.", "score": 1, "replies": []}]}]}, {"body": "No way FB gets there without major acquisitions.", "score": 5, "replies": [{"body": "FB rev and earnings grow at roughly 20-30%, which implies a double in roughly 3 years assuming the multiple remains constant", "score": 3, "replies": [{"body": "Mostly because of instagram I'd imagine.  I don't think it can hold that growth.  Maybe I'm wrong, I dunno.", "score": 1, "replies": []}]}]}]}, {"body": "It’s crazy to think that without google amazon would likely not have been as big as it is today or maybe even existed at all", "score": 3, "replies": [{"body": "Plus what would have happen to Google without Bezos?\n\n\"The Story of Jeff Bezos’ $250,000 Investment into Google in 1998\"\n\nhttps://www.growthink.com/content/story-jeff-bezos-250000-investment-google-1998", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Read the thread again", "score": 21, "replies": [{"body": "Reading: the bane to reddit comment sections everywhere and my comment today smh", "score": 5, "replies": [{"body": "To be fair, the title is phrased a bit wonky. I thought the same as you initially and had to read it multiple times before going “ohhhhh”", "score": 4, "replies": [{"body": "Key word is.  FASTEST", "score": 1, "replies": []}]}]}]}]}, {"body": "Honestly I'm shocked Google hasn't reached 1t before Amazon could be because they absolutely have sucked in the past with hardware but, are not doing much better with thier laptop and, phone line up", "score": 2, "replies": [{"body": "Amazon is a decent amount older than Google.    Over 4 years older.", "score": 1, "replies": []}]}, {"body": "GOOG is up 21% from when I bought it. What's the move here? Is it becoming overpriced? Or should I keep holding?", "score": 2, "replies": [{"body": "Hold", "score": 3, "replies": []}, {"body": "Google is up over 1000% since purchased the first share.   I added many times through the years and would continue to add.\n\nGoogle has barely even got started.\n\nGoogle is far from overpriced.   But Google is the type of company you buy and forget about.", "score": 2, "replies": [{"body": "GOOG is up 1000% since may 2005.  since that time, AAPL is up 5000%, AMZN is up 5200%, and FB is up 10,000%.\n\naim higher, you can do better.", "score": 2, "replies": []}]}, {"body": "A lot of people think Google are done innovating because they haven't released a mainstream web app in a few years. These people are wrong. Game streaming and robo taxis are next. Google is also the world leader in AI which has implications we can't even predict yet. Google have no serious rivals for advertising, search, YouTube or Maps. Android is dominant. Gmail is dominant. Hold.", "score": 2, "replies": [{"body": "Best way to score AI innovation is papers accepted at the canonical AI organization.\n\nGoogle was #1 in 2019 by a wide margin.   Also was #1 in 2018.\n\nhttps://miro.medium.com/max/1235/1*HfhqrjFMYFTCbLcFGwhIbA.png\n\nGoogle leads in every layer of the AI stack.  From silicon all the way up to engineers and every layer inbetween.", "score": 0, "replies": []}]}]}, {"body": "As inflation continues, there will newer companies in the future thet would cross the mark fairly early.", "score": 2, "replies": [{"body": "Do not think it is just inflation.   It is more the big tech eating up other industries and being just huge companies.\n\nAds had almost zero being taken by big tech 20+ years ago and now Google and Facebook dominate.  Google and travel\n\n\"How Google Has Become The Biggest Travel Company\"\n\nhttps://www.forbes.com/sites/stephenmcbride1/2019/12/06/how-google-has-become-the-biggest-travel-company/#58565cb24e09\n\nFuture it will be things like transportation.   Google sister company is Waymo and here is three examples of no driver or backup driver from their service from last year.\n\nhttps://www.youtube.com/watch?v=UX_N2up7f8Q\n \n\nhttps://www.instagram.com/p/B5tP5XqlZpb/?igshid=1m8k9m1rv6ksx\n \n \nhttps://twitter.com/waymo/status/1194705739492708352?s=21", "score": 1, "replies": []}]}, {"body": "Wow. I would have guessed Google was at least five plus years older than Amazon.", "score": 1, "replies": [{"body": "Several have indicated similar in the comments.   It is not true for me but I am in the US and was one of the first Amazon customers.\n\nI am thinking some it is because they are not in the US.", "score": 2, "replies": []}]}, {"body": "You really got Google's dick up your ass. They will go the way of Yahoo! and AOL in the 2020's.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "How else would companies be able to generate interest in their products?\n\nI hear often times on Reddit the anti advertising sentiment.   Which has never really made a ton of sense to me.   Advertising plays a necessary role.\n\nI have also heard more than once where people have suggested advertising will go away.     Which also has never made a ton of sense to me.\n\nBTW, advertising is a big reason we have the incredible Internet services we enjoy on a daily basis.", "score": 34, "replies": [{"body": "Advertising is fine but the overhaul of running ads has gotten ridiculous, all these incredible internet services are going to either get very expensive or require us to get molested by ads every 5 seconds in every corner of our phones and devices", "score": 12, "replies": [{"body": "Not sure I am following what is changing?   The wording of \"but the overhaul of running ads has gotten ridiculous\" is not making sense to me.\n\nWhat is \"overhaul\"?\n\nI do not see ads with search changing.  With YouTube it could be but we have YouTube Premium so do not get ads.   YouTube TV is now even better with ads as no longer forcing VOD with shows you DVR.  It was never an issue for me as I watch shows right away.  But had heard others were bothered by the ads when DVR something and get the VOD version.", "score": 0, "replies": [{"body": "Ads doubled on youtube, news apps and snapchat running ads as if they were actual news articles, instagram showing more ads than the posts of people you follow. Essentially social media and the like are becoming one elaborate commercial. \n\nMight not bother you rn since you pay for no ads but whats to stop these companies from all charging more to avoid ads? Its going the same route that streaming services are going. So while it might not bother you now trust me it bothers a whole bunch of people lol", "score": 1, "replies": [{"body": "You're not entitled to use of their **free** apps/services without ads though? You literally don't pay them a dime and spend hours daily using their services, would you rather they go out of business? Are you surprised that a business is doing what businesses do?", "score": 5, "replies": [{"body": "Same way they are not entitled to use our personal information to target ads at you. No one has to use their service youre right but they want people to use their service and know people will but theres a fine line between putting ads to keep the business afloat, make money and taking full advantage of their consumer base.", "score": 1, "replies": [{"body": "They actually are. You agreed to it by using their service lol. Not saying it's not scummy but you can't complain just because you accept any and all terms of use.", "score": 5, "replies": []}, {"body": "No they are absolutely entitled to do so, and you agreed as soon as you checked off their TOS. \n\nAlso what is everyone’s problem with target ads? Seriously I’ve never gotten it I’d rather get ads for something I’m interested that mccormick spices or baby food...", "score": 1, "replies": [{"body": "Just because something is in a TOS doesnt mean its binding lol. If it was than COPPA and similar legislation wouldnt be needed. \n\nDidnt it come out that 23 and me (a company owned by googles parent company Alphabet)  was giving info to the FBI? Dont you think its rather dangerous to say oh well you signed the TOS when it puts your civil liberty at risk? Whats to stop the government from saying you dont have a reasonable expectation of privacy in your home and therefore no warrant needed to search your home because you agreed to amazons TOS to record and collect data in your home from alexa. \n\nThat logic isnt sound, it might be fine to you now but both in terms of your personal freedom and financial costs youll be paying a lot more longterm. Yea businessess will do what businessess do but to just say oh well just take what you can get and dont complain is a dangerous way to think and gives too much power to companies over their consumers.", "score": 3, "replies": [{"body": "Complaining doesn’t do shit, if you have a real problem with it stop using the service, they’ll either fix their shit, or go out of business. If the latter happens another company will fill the gap. Unless ofc there’s no real way to make money in which case well you’re shit outta luck.", "score": -1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Well then you're going to have a tough time on the internet because that's like 90% of it.  \n  \nGet Ublock origin/Adblock and it's slightly more tolerable.", "score": 2, "replies": [{"body": "I do use an adblocker.\n\nand websites that don't allow adblockers, I simply don't visit them.", "score": 2, "replies": []}]}, {"body": "This service isn't to my liking, bring me another.\n\nYes, Admiral Privleged.", "score": 1, "replies": [{"body": "customer is king. \n\nI'll pay for less ads.", "score": 2, "replies": [{"body": "The costumer is only a product.", "score": 1, "replies": [{"body": "then i refuse to be the product", "score": 1, "replies": [{"body": "That's perfectly viable, now you have nothing to complain about.\n\nEverything is solved.", "score": 1, "replies": [{"body": "I'm not complaining. I'm just explaining why advertising is the bane of society right now", "score": 1, "replies": [{"body": "I love it personally.\n\nFree shit and I can use multiple computers and adblock tools to avoid ever seeing an ad, good by me.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Each add is about .3c they’d literally have to show an average user (which is how they calculate it) thousands of ads in order to justify trying to force you to watch ads... and I really don’t think people spend THAT much time on social media...", "score": -1, "replies": []}]}]}]}, {"body": "I'm sorry but I can't hear your post over the crinkling of my tinfoil hat. Would you mind sending a handwritten letter to me instead?", "score": 7, "replies": []}, {"body": "It’s not necessarily the ads but the data mining that leads to Ads. Fuck off and pay us for our data", "score": 2, "replies": [{"body": "If going to get an ad I do prefer a targeted one.", "score": 4, "replies": []}, {"body": "They do, they let you use a service for free... that’s how they’re paying you....", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "If the average person would pay for these services, they would be charging for them instead of using ads. A paid social media platform similar to FB launched a few years ago and they could only get users by giving them the first year free and then can't keep many.", "score": 7, "replies": [{"body": "Problem is these companies are charging way too much for these services. I would be okay with a compromise. I don't mind ads, but the trend now is having obnoxious ads on all these services. Or just as bad they track you and your privacy.\n\nThe problem is companies like Google and Facebook are greedy. They already rake in billions in profits. But they want to make more so they keep making more and more intrusive and obnoxious ads.", "score": 1, "replies": [{"body": "Facebook makes almost all of their money by selling your data to advertisers. Like... 85% or more of their revenue is ad money.\n\nIt has nothing to do with being greedy, it has to do with demand from their consumers. These platforms are enormously useful for marketing and building a brand/lead generation and they haven't hit anywhere near a saturation point on their platforms for consumer participation.\n\nGiven that they aren't close to market saturation, they have no interest in stopping sales. It has nothing to do with greed, but basic demand of people who want to sell you something. If Facebook didnt do it, someone else will.", "score": 3, "replies": [{"body": "And thats the problem with Facebook.\n\nThe only way for them to grow significantly is to feed us more and more obnoxious ads and breach our privacy even more.", "score": 1, "replies": [{"body": "Then don't use the service.", "score": 3, "replies": []}]}]}]}]}, {"body": "I spent much of my day online.  Really do not see the level of advertising from Google a major issue today.\n\nI really do not find the ads with search to be a problem.   Plus one of the ads really helped us this week.  We needed to rent a dumpster and that is the ad we received with the company we rented the dumpster from.\n\nWe do now have YouTube Premium which avoids YouTube ads.   Which anyone can purchase if the ads are too annoying.\n\nThe biggest problem with ads is the random web site.   I would agree this is a problem in many cases.  But that is not so much Google.\n\n> I would and absolute do pay extra money for ad free experiences.\n\nSo you have YouTube Premium?", "score": 7, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "> Its not just Google but Youtube ads are getting out of hand. I simply don't watch Youtube as much now.  \n  \nI used to get mad about this too until I realize that it's the content creator (owner of the channel) that decides how many ads to put in their videos. If you're going to be upset, be upset with whoever is providing you with all the \"free\" content you love.", "score": 2, "replies": [{"body": "really? did not know that. \n\nSo the content creator decides how many ads to show on their videos?\n\nThe ones that piss me off is when the ad is in the middle of the video.\n\nOr if the video is 30 seconds and the ad is 15 seconds.", "score": 0, "replies": [{"body": "Yes sir, that's how they make their money. If you check out any youtubers that make videos for kids, you'll see they have more ads than anyone because kids don't know any better and are just desperate to see \"what happens next :O\". My little brother was watching a 20 minute video and I swear there was an ad at least every minute.", "score": 3, "replies": []}]}]}, {"body": "> Its not just Google but Youtube ads are getting out of hand. \n\nWas not aware.   We have a family YouTube Premium now so not been an issue for us.\n\nDo find YT Premium to be worth it.  I watch a ton of YouTube but my wife is really into the maker scene and watches even more than me.   \n\n> I just record stuff on YouTubeTV and skip the ads.\n\nDo the exact same.  But have heard ads are now less on YT TV as you no longer are forced to watch VOD version.   Was never an issue for me as do no wait to watch things but heard from others.\n\nGoogle makes it super easy to skip ads with YTTV.    They provide a nice scrub.", "score": 2, "replies": [{"body": "at this point I can't justify playing for YT premium. I simply don't watch it enough. But if I did, I would have no problem paying.", "score": 1, "replies": [{"body": "Gotcha!   If is well worth it for us.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Ads are excessive, not necessary. Most advertisements are artificially creating demand, regardless it it's necessary or not. If you need or want something you could go look/ask for it but with ads you literally get products shoved down your throat whether you like it or not. That's not a necessary role. Also, internet services cater to ads, not the other way around. Youtube was great before ads, so was reddit, twitch, google, facebook etc. The only thing that changed with ads was more money for their ad algorithms.", "score": -2, "replies": [{"body": "exactly.\n\nThe world was fine before mega massive advertisers like Facebook, Google, ect were raking in TENS OF BILLIONS of profit every year.", "score": -1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": []}, {"body": "I actually don't mind non-intrusive targeted advertising as long as I'm being notified of what data is being collected and by whom. I find out about a lot of things I want via advertising.", "score": 1, "replies": []}, {"body": "So many things you love would not even exist without advertising.", "score": 1, "replies": [{"body": "So many things I love would still exist without obnoxious advertising.\n\nI'm not against all advertising. I'm against obnoxious advertising and stuff that violate my privacy.", "score": 0, "replies": []}]}]}, {"body": "Can't wait for TSLA to beat them both", "score": 0, "replies": [{"body": "You kidding right ? Tesla is a big bubble that's waiting to burst open.", "score": 4, "replies": [{"body": "I don’t think so. Look at their roadmap, they consistently hit goals.\n\n\nhttps://youtu.be/hXuch9WbKyI", "score": 0, "replies": []}]}, {"body": "Beat them in what manner?     Self driving we have Waymo showing without driver and backup driver.\n\nhttps://www.youtube.com/watch?v=UX_N2up7f8Q\n \nhttps://www.instagram.com/p/B5tP5XqlZpb/?igshid=1m8k9m1rv6ksx\n\n \nhttps://twitter.com/waymo/status/1194705739492708352?s=21\n\nTesla you are required to have hands on the wheel at all time.    Does not seem Tesla is competitive with Waymo does it?\n\nPlus how many years ahead of Tesla is Waymo?\n\nOr did you mean Tesla will beat Google to a trillion dollar market cap?", "score": 1, "replies": []}]}, {"body": ">Amazon is four years older than Google and therefore Google should get to $1 trillion ultimately faster than Amazon. \n\nWhat kind of retarded logic is this lol", "score": -12, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "That statement is completely meaningless though. $1trillion will be worth less by the time peleton makes it there. It’s an arbitrary benchmark that doesn’t tell us anything", "score": 0, "replies": []}]}]}, {"body": "When was the last time Google donated to good cause...in forgotten places like Edmonton,AB, Canada?", "score": -4, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - January 09, 2020", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "em785i", "created_utc": 1578561155.0, "score": 30, "upvote_ratio": 0.95, "num_comments": 613, "comments": [{"body": "Reminder that we're all hyperfocused on seeing $500 and that we've enjoyed a great run-up. An intraday dip of 2% is nothing to get excited about, especially given the volume we are seeing. It's going to be bumpy at times. Let the traders/algos/institutions do their thing. Absolutely nothing has changed with the Tesla story.", "score": 38, "replies": [{"body": "Need to tell myself this before looking at the stock ticker everyday.", "score": 2, "replies": [{"body": "I want the big burn so I can sell on the 2k spike and then go back to being stable long", "score": 2, "replies": [{"body": "You're day dreaming tho.", "score": 1, "replies": [{"body": "What's life without whimsey", "score": 1, "replies": []}]}]}]}]}, {"body": "Bought a call at the open.  Killed the bull run.  Everyone can go home now", "score": 29, "replies": [{"body": "It wasn't you. It was me. The price tanked as soon as it executed.", "score": 7, "replies": []}, {"body": "Yeah, me too.", "score": 5, "replies": [{"body": "I bought 3", "score": 5, "replies": [{"body": "But now I'm thinking.... should I grab a 4th call? 500 1/24 price is looking good", "score": 2, "replies": [{"body": "It'd be smart to buy some more right now to average down... but I don't want to even talk to my wife until after close...  so I guess I won't be doing that today at least.", "score": 1, "replies": []}]}]}]}, {"body": "Yeah I bought 2 right at open. Should have waited to see the morning. Whatever, it will go back up.", "score": 4, "replies": [{"body": "Same", "score": 2, "replies": []}]}, {"body": "Thank you for killing it so i can get in.", "score": 5, "replies": []}, {"body": "This sort of resistance is totally normal after such a bullrun", "score": 3, "replies": []}]}, {"body": "This setback is necessary for an earnings run.", "score": 24, "replies": []}, {"body": "I remember when my avg 275 shares were deep in the red", "score": 23, "replies": [{"body": "😭😭😭😭😭🇺🇸🇺🇸🇺🇸\nWow\n\nTo think u are now winning because u held and never gave up on that stock that u truly believed\n\nEven when ever one else told u it ain’t shit \n\n\n\nGood for u", "score": 15, "replies": [{"body": "I was pretty prepared to go down with the ship!", "score": 10, "replies": [{"body": "IRON HANDS !!", "score": 2, "replies": []}]}]}]}, {"body": "Love it. 2-3% pullback and people freaking out. Settle down folks. Enjoy the show. Adding a few at $477 here. In it for the long haul.", "score": 22, "replies": [{"body": "Same", "score": 6, "replies": []}, {"body": "Bit pissed it dropped today to be honest. Bought my first two shares at 492$, but I'm trying to keep calm and not get cold feet, since I have faith in Tesla 👍🏼", "score": 4, "replies": [{"body": "I bought at 259 before it dropped to 180.. I considered selling because I got nervous, but believed in Tesla enough to hold. So glad I made that decision!! Just wish I bought even more!", "score": 8, "replies": [{"body": "Yeah I spent $20k which was all my savings at $305. Then it tanked to $180. So I took a loan out for 15k to buy the dip. Incidentally I couldnt beleive how easy that loan was to get. I still think Tesla are going to absolutely smash it long term. And we're in such a privaliged position as there is so much info out there on tesla that it becomes far easier to make informed decisions when investing.", "score": 2, "replies": []}]}]}]}, {"body": "To everyone who just bought shares, Hold them long term and you’ll be fine. Do not get scared because you are down. \n\nTo everyone who bought 1/10 $600 calls yesterday... I’m sorry. Lol", "score": 23, "replies": [{"body": "I bought a single 1/17 call this morning.  It's 2/3rds down.  I'm holding on...  the last two times I decided time decay would kill me and took a small loss, the options went up 5x and 15x a few days later.\n\nApparently, I'm just really bad at short term options.", "score": 2, "replies": [{"body": "I bought 1/31 600 calls and they are now up. Figured that was my safest bet. \n\nI like buying options on pull backs more than when we are going up.", "score": 3, "replies": [{"body": "Yeah, if I'd seen the pullback that would be nice... but I executed around ... what?  8:32am EST???  Wow.  That felt like 10 minutes after open.", "score": 1, "replies": [{"body": "I think $600 calls are looking nice right now especially since they’ll be after earnings.", "score": 2, "replies": []}]}]}, {"body": "Everyone is. I did it for a long time because when I had long term options I would see the short term gain potential and get envy. Then you realize you lose 50% of the time on short term and 50% of the time you're out of the market you miss out as well. Long term options are lower risk, you gain every gain tsla gains and don't have grey hairs in your 20s.", "score": 2, "replies": []}]}, {"body": "My shares are never being sold. I'll die with them, haha", "score": 1, "replies": [{"body": "Wait, then what’s the point of buying them!? Sell when they are $5000+ :)", "score": 0, "replies": [{"body": "I am telling myself I'll hold till they pay a dividend. Only in my 20s with 250-500 shares so it'll be a nice nest egg, hopefully a 5% dividend will also generate enough for me to retire, and a dividend will signal that Tesla is in its mature phase.", "score": 3, "replies": [{"body": "What do you mean 250-500 shares? You have in between there?", "score": 1, "replies": [{"body": "250 is my baseline, I have some that get included in my 401k and if I'm not using the money on options I'll throw it into straight equity.", "score": 2, "replies": []}]}]}, {"body": "I'm kidding. I'll probably keep them until retirement", "score": 2, "replies": []}]}]}]}, {"body": "20 MM volume. This is a **shakeout** of weak hands. Institutional investors taking positions scooping stop loss orders. Hold on to your shares.", "score": 22, "replies": [{"body": "So volumey", "score": 4, "replies": []}, {"body": "Definitely feels like it, just keep reminding myself I rode from 360, down to 176, to where we are now. Picked up some more shared a long the way which has been a huge win.", "score": 2, "replies": []}]}, {"body": "Elon was right about the short squeeze of the century, we just didn't adjust for Elon time.", "score": 22, "replies": [{"body": "The squeeze isn’t here yet. 🙂", "score": 8, "replies": []}, {"body": "That palm still belongs to VW.", "score": 2, "replies": []}]}, {"body": "Brandenburg approves the GF4 purchase: https://www.tesmanian.com/blogs/tesmanian-blog/gigafactory-4-forest-drone-footage-shows-teslas-progress-so-far\n\n(No relationship with Tesmanian, I just saw it linked elsewhere.)", "score": 21, "replies": []}, {"body": "The battle for 400 is over. The battle for 500 is about to begin.", "score": 20, "replies": [{"body": "LOTR?", "score": 7, "replies": [{"body": "Looks like the stock does not simply walk into Mordor.", "score": 5, "replies": []}]}]}, {"body": "Bought 20 more shares @ 498 today. Not too bothered by this. Looking forward to earnings and Battery and drivetrain investor day. Every time i hear someone dismiss EV's / Tesla i get the urge to buy more.", "score": 19, "replies": [{"body": "Probably pass 498 before Tuesday :)", "score": 7, "replies": []}, {"body": "I think battery/drive train day will be huge. Elon likened it to a new product launch so this won’t be some really marginal improvement. It will be meaningful and will likely make the entire product line significantly more attractive once implemented. I believe that and any future FSD announcements could trigger a huge rally.", "score": 5, "replies": [{"body": "Ever since the Cybertruck announcement I've been thinking the current Tesla models are coasting on older tech (while still being profitable). \n\nOr at least, the new tech that Tesla has been developing hasn't been implemented in Model S3XY so far.\n\nCybertruck-like efficiency in a Model 3/Y/2 (compact model 3 made in China) would instakill the competition on a price/km basis.", "score": 3, "replies": []}]}, {"body": "that's the spirit!", "score": 2, "replies": []}, {"body": "\"Met the guy who set the ATH on reddit.\"", "score": 1, "replies": []}]}, {"body": "CHina Model 3 sales rumour: https://twitter.com/bennywu45/status/1215189453095849984", "score": 18, "replies": [{"body": "I have a feeling China alone has the potential to be a 1m car per year business for Tesla.", "score": 12, "replies": []}, {"body": "Big if true", "score": 4, "replies": []}, {"body": "Image transelation from google :\n\n1 \"Seven stores in Beijing booked 1040 cars on Friday\"\n\nJanuary 5, Zhou mi 18:30, sister-in-law stepped into Beijing overseas Chinese\nTesla store in Fufang Meadows, shocked upon entry into door sister\n7 because never seen in a Tesla store such as\nThis \"busy\" too, not just me, even the store's sales staff\nThe same feeling is true.\nSince Friday (January 3), our store has been\nIn this way, we are all too busy, these days into the shop customers", "score": 4, "replies": []}, {"body": "I have no doupt they will sell all they can produce for years to come.", "score": 3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Yes, i think this was the biggest news there. As someone without a car, since there is a great train network here in Switzerland, this is the car i am looking forward to buy. \nI work in the construction/energy business, i think the energy side of Tesla is also wildly undervalued and will take off like crazy as soon as they have more batteries than they need for cars.", "score": 7, "replies": []}, {"body": "Yep, look at the MG ZS EV, a chinese made car which is already selling well in Europe.", "score": 2, "replies": []}]}]}, {"body": "I think the big question is: are they saying \"sold\" meaning deliveries of vehicles, or sold meaning taking orders?", "score": 1, "replies": [{"body": "I'm sure taking orders...", "score": 1, "replies": []}]}]}, {"body": "Remember when the ATH was 380?\n\nPepperidge Farm remembers.", "score": 18, "replies": []}, {"body": "Analysts upgrading their price targets are closing the barn door after the horse has bolted", "score": 18, "replies": [{"body": "Actually I think you're hitting on a good point. TSLA is still heavier on the sell side. we have 13 analysts who have yet to update their thesis. Not saying all will come onboard as bulls, but they'll look pretty foolish if they don't. Cramer, lulz ate crow as they saw the tide shift, perhaps analysts will follow soon. Every upgrade will get a huge bump. And S&P here we come. I'm not selling any more covered calls for a while. riding it up. We'll see what Q1 and battery investor day looks like.", "score": 4, "replies": []}]}, {"body": "That morning dip!", "score": 15, "replies": [{"body": "aaaaand it's gone", "score": 8, "replies": []}]}, {"body": "Hold on to your pants, this is going to be a major roller coaster. Try not to soil on the shorts ;-)", "score": 15, "replies": [{"body": "I forgot to add *Whee!!*", "score": 5, "replies": []}]}, {"body": "Don't care about today's pullback...it's still higher than yesterday's open.", "score": 15, "replies": [{"body": "I’m a little bummed a full blown short squeeze didn’t materialize.  That said the pull back showed a lot of underlying strength in the current SP.", "score": 8, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Yes, I saw that and agree it def still on the table.  Maybe the intense resistance at 500 means that’s where some major risk tolerance gets crossed🤷‍♀️", "score": 3, "replies": [{"body": "That’s the new limit at which Speigel closes his short position according to his twitter.", "score": 2, "replies": [{"body": "Thats probably not coincidence since he's clearly a crony.", "score": 1, "replies": []}]}]}, {"body": "I mean, if you're ever going to bet on a stock going down, the all-time-high is a better price to do that than the 2-year low.  Smart shorts, if they exist, would behave a lot like longs, thinking hard about selling now and buying on the dips.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I agree that there are also a lot of really foolish shorts in the mix. Normally I would expect short interest to be the inverse of share price.  Tesla has an unusual number of shorts that are literally betting on it being worthless, not just overbought, so the trend is different.\n\nAlso, I agree this is a good sign for future short squeeze potential.", "score": 1, "replies": []}]}]}]}, {"body": "So much volume", "score": 2, "replies": []}]}, {"body": "It's healthy to have a red day, gotta zig to zag", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 29, "replies": [{"body": "Yes, and 2% now is a whole lot more than it used to be. No big deal at all. Seeing -10.80 was a shock back when the stock was below 200. Not anymore.", "score": 3, "replies": [{"body": "Was going to say the same thing. Its really hard adjusting to $10 being normal. But it is now. We shouldn't get excited about a few bucks either way", "score": 5, "replies": []}]}, {"body": "obvious reason is short term cashing out. Other than that, well put.", "score": 2, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "It's been a wild roller coaster ride. That Iran bombing is making me more conservative with my options. Still very happy that didn't escalate.", "score": 3, "replies": []}]}]}]}, {"body": "The squeeze in effect: [78% buyers.](https://i.imgur.com/hUf6Kvp.png)\n\nUp from 75% just 2 days ago.\n\nQuickly approaching AAPL which is 84% buyers.", "score": 13, "replies": [{"body": "Curious to see how strong the resistance at $500 can be. Everyone knows earnings is gonna break all records, and that's still a month out.", "score": 10, "replies": [{"body": "We break $500 today for sure.\n\nBet the house.", "score": 6, "replies": [{"body": "And the kids!", "score": 10, "replies": [{"body": "who needs a college education anyway? 🤷‍♂️", "score": 3, "replies": [{"body": "College is overrated", "score": 1, "replies": [{"body": "Not to mention kids in college. Just tell them to buy Tesla stock for their weekly allowance and they can retire at 18 and skip college all together.", "score": 2, "replies": []}]}]}]}, {"body": "I hope this ages well ;-P", "score": 2, "replies": [{"body": "Have faith.", "score": 1, "replies": [{"body": "I'm long TSLA. $500 is imminent.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Hold on, guys! \n\nThis is gonna be a bumpy ride to $500.", "score": 13, "replies": []}, {"body": "Looks like TSLA is having a stock sale!\n\nTime to buy some more, boys!", "score": 14, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Will buy more in the morning", "score": 1, "replies": [{"body": "picked up 60 shares total today at different price point.  it has penetrated pretty deep into yesterday's gain... probably due to the two 'downgrade' so their friends can buy more.", "score": 2, "replies": []}]}]}]}, {"body": "Was waiting for this buy, just bought some", "score": 14, "replies": []}, {"body": "I know people (including myself) are skittish about the huge run up and they feel like a massive correction could be imminent. However, one thing I can't stop thinking about is how Waymo was last valued at $150B and afaik most analysts aren't giving Tesla's self-driving efforts any significant valuation. Thoughts?", "score": 12, "replies": [{"body": "I've been waiting for a slight pullback since $330.  \n  \nDon't try to be a trading hero like me. Go long.", "score": 15, "replies": [{"body": "Yeah I learned that a while ago. I've been holding since $230", "score": 1, "replies": [{"body": "Did you hold down to $180?", "score": 1, "replies": []}]}]}, {"body": "It's a good point, and part of the reason why I'm not worried about a correction down significantly from where it is now.", "score": 6, "replies": [{"body": "Hi not worried about a correction down significantly from where it is now, I'm Dad👨", "score": 3, "replies": []}]}, {"body": "It might pull back. But the company is growing massivly, thats whats important to me.", "score": 7, "replies": []}, {"body": "Lol what a joke valuation, and the media is trying to convince us that TSLA is overpriced....This is why I ignore all the haters trying to tell me its worth 300$. Holding till 4K!", "score": 1, "replies": []}, {"body": "Waymo is \"valued\" at $105B, but that's just some random analyst's number (should we give him more credibility than the TSLA $10 \"valuation\"?). Last I checked I couldn't even find what Google valued it at when they bought it, we don't know Google's total investment in it. My point is that this so-called valuation is just some PT garbage, we have no clue how much Google paid for it or values it at.", "score": 1, "replies": [{"body": "Okay I messed up, I thought that was a funding round. The info that I can find now is that UBS estimates Waymo at $25 to $135 billion, and Morgan Stanley at $45 to $175 billion. GM's Cruise last raised money at a valuation of $15B.", "score": 1, "replies": []}]}]}, {"body": "::loud speaker::\n\n\"Attention Everyone! This is your last chance before big push. I repeat. This will be the last chance for the big push\"", "score": 26, "replies": [{"body": "If only I hadn't spent $10k on shares this morning. \n\nOh well, it'll be up big time sooner or later :)", "score": 15, "replies": []}, {"body": "Yeah, next week we'll have some genius in here the day after earnings call asking when's a good time to buy. You'll see\n\n haha", "score": 12, "replies": []}, {"body": "Time to pick up some calls before Earnings.", "score": 1, "replies": []}]}, {"body": "I’ve been buying shares since 2015. Rode the highs and bought more when it hit the lows. If you believe in TSLA for the long run just sit tight and enjoy the ride and block the noise. If your scared of big movements, then you should be investing into index funds instead.", "score": 13, "replies": []}, {"body": "940K shares traded in premarket already", "score": 12, "replies": []}, {"body": "Good morning to everyone.\n\nMay all your calls come true!", "score": 12, "replies": []}, {"body": "From ihor:\n\n&#x200B;\n\n$TSLA short int is $13.69bn ; 27.82mm shs shorted; 20.79% of float; 0.30% borrow fee. Shs shorted up +464k shs, +1.7%, over last 30 days as price rose +45% & up +132k shs,+0.5%, last week. Shorts down -$2.02bn in January mark-to-market losses after being down -$632mm yesterday.", "score": 11, "replies": [{"body": "I hope they're right.  That would mean short interest is up from 12/15 and that the squeeze hasn't happened at all yet.", "score": 22, "replies": [{"body": "A lot of new blood are shorting at the higher prices I think. I k now of one person who just shorted it today", "score": 10, "replies": [{"body": "That's playing it risky. What if the profits beat expectations at it rises to 600?", "score": 6, "replies": [{"body": "Indeed. I'm expecting things just to hover around where it is now a bit below 500 until we see the earnings and then up past 550 and hopefully, tackling 600 or back down to 400 depending on how it goes. Personally I'm expecting up past 550", "score": 3, "replies": []}, {"body": "How much is not priced in at this point? If Q4 shows any weakness at all given this run up, then this could go down very fast.", "score": 1, "replies": []}]}, {"body": "I opened deep ITM covered calls to take some premium.", "score": 1, "replies": []}]}, {"body": "that's insane if true", "score": 7, "replies": [{"body": "Is it? It’s likely new positions, looking for the fall after this rise.", "score": 7, "replies": [{"body": "Well yes, correct.  But what I mean is that there's a lot more squeeze effect to come.  I'm sure many of people were squeezed throughout the ride from 180 to now.", "score": 4, "replies": [{"body": "And I’m sure peoples stop losses triggered at $180.\n\nThe stock is volatile.", "score": 1, "replies": [{"body": "But that doesn't affect the number of shares shorted which to me indicates how much squeeze remains.\n\nAll I'm trying to say is that if that number is growing, than as long as Tesla does well (which I think they will), all it represents to me is potential energy to shoot upwards.  Like a spring that's loading.", "score": 1, "replies": []}]}]}, {"body": "fair enough", "score": 3, "replies": []}]}]}, {"body": "Agreed", "score": 4, "replies": []}]}]}, {"body": "Could this be a bear trap?", "score": 11, "replies": [{"body": "Hopefully they try to short us even more now, the run up is going to be absolutely massive", "score": 13, "replies": []}]}, {"body": "I am scared 😅", "score": 12, "replies": [{"body": "First time?", "score": 19, "replies": [{"body": "Yes sir. Averaged on 460", "score": 4, "replies": [{"body": "Lol. Dont worry. Starting to look like we ll have a lot of fluctuations below 500 and some profit taking for the next while now until earnings.", "score": 5, "replies": []}, {"body": "how long are you holding for?", "score": 2, "replies": [{"body": "Well long term in the end. Just started with 5 shares.\n\nBut I don’t have extra cash to buy big dips so it’s quite frustrating..", "score": 3, "replies": [{"body": "Don’t sweat it!  It’s critical not to judge a decision by the outcome.  If a parent walks into a casino and bets their child’s college fund on roulette and wins did that person make a good choice?  The answer if course is no.  It was a terrible decision regardless of the outcome.  If you believe in Tesla then you believe your shares will be worth thousands of dollars each eventually.  Maybe that won’t pan out but that’s your investment thesis.  What the stock does this week or next is no investment thesis.  That’s gambling and gambling can ruin your life.  My account had lost over a hundred thousand dollars in value this last summer.  But I believed my investment thesis then as I do now.  I didn’t sell then and I’m not selling now.  I’m in it to make 10 to 30x my investment because of how the company does over time not the whimsical sentiment of Wall Street.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Hey guys finally bought in this morning after following this sub a few days.. I'm a little confused because the price is going down, not up?  Did I do it wrong?", "score": 12, "replies": [{"body": "Turn your screen around. Everything is fine.", "score": 10, "replies": []}, {"body": "yup", "score": 6, "replies": []}, {"body": "You caused the price to drop.", "score": 1, "replies": []}, {"body": "No.  Someone said sell so a bunch of people are selling.\n\nhttps://finance.yahoo.com/news/battle-worn-tesla-backer-recommends-144245995.html\n\nJust hold on. It'll go back up.", "score": 1, "replies": []}]}, {"body": "just transferred another $1k into my RH account and bought two more shares at $477.\n\nAverage cost now at ~@273 across 14 shares (was $240 across 12 shares).\n\nReady to ride the wave!", "score": 11, "replies": [{"body": "Same here! I transferred 1K to my Roth IRA and bought two more at 475.0. Buy the dips ride the wave!", "score": 5, "replies": [{"body": "You guys are awesome. I just average down on the 780's range. I can never call the bottoms.", "score": 2, "replies": []}, {"body": "Great work, guys! :)", "score": 1, "replies": []}]}]}, {"body": "Don't buy stock with borrowed money. Margin can wipe out your account. Other than that, I feel pretty comfortable about where the company is, both the business and the stock. Shorts couldn't get my shares in the past 7 years, they are not going to get them in the next 10 years either.", "score": 11, "replies": [{"body": "I agree. Even though I do it all the time.", "score": 8, "replies": []}, {"body": "I'm very glad I borrowed money to buy at $270 so can't say I agree with your advice. I only did it for Tesla though...", "score": 6, "replies": []}, {"body": "I 100% agree even though I've invested with mostly borrowed money. I'm a hypocrite...", "score": 3, "replies": []}]}, {"body": "Good news via Rob our boi! https://twitter.com/TeslaPodcast/status/1215480141046079493?s=20", "score": 11, "replies": [{"body": "Is this new or old?", "score": 2, "replies": [{"body": "I believe they upgraded it to $423 a few weeks ago, but appears to have upgraded again today. Maybe this will help a bit tomorrow after the double downgrade today.\n\nEdit: The podcast episode he's linked with this analyst is old, but he's likely just promoting.", "score": 4, "replies": [{"body": "Yes the re-raised target would be new.  No article source provided as of yet...", "score": 1, "replies": []}]}, {"body": "https://www.reddit.com/r/teslainvestorsclub/comments/emm88e/tesla_daily_teslapodcast_1h_piper_jaffray_raises/fdpqdtz/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 3, "replies": []}, {"body": "Looks old to me", "score": 1, "replies": []}]}]}, {"body": "For some reason a certain subset of people around here seem to assume that just because a stock goes up for a bit it has to come back down.  Why don't you go take a look at the charts from NVDA and AMD a few years back when they rose well over 500% before a major correction. TSLA is finally on the rise for not even 3 months yet after nearly 5 years of supression, the way I see it the fun is still only just getting started!", "score": 29, "replies": [{"body": "This! I hate those \"what goes up, must come down\" people. Try zooming out on the S&P. Even if you went all in before the 2008 crisis, you still made bank. The stock market is not a zero-sum game.", "score": 9, "replies": []}, {"body": "I also thinks so, but i don't think it will be a smooth ride. Lots of people take some profits out after such gains and i don't blame them at all. Everyone has to decide on his own what risk and what opportunities he likes to take.", "score": 5, "replies": [{"body": "Of course it won't be a smooth ride, but taking profits before Elon gets even his first payday?  That's just being impatient.  You either believe in Elon or you don't.", "score": 8, "replies": [{"body": "Oh i do and for sure i wont sell shit. But there are different people at different places in live. Some might don't have the time to wait...", "score": 3, "replies": []}]}]}, {"body": "For me, I'm expecting around breakeven in Q1 2020 based on good but not great delivery numbers. Car sales are highly seasonal after all. I expect analysts to completely forget this seasonality and downgrade the stock, and for bears to have a resurgence as a result. This could send the stock down quite a bit until Q2 deliveries are announced. \n\nLots of uncertainty on this of course. I've certainly been wrong on the direction of the stock price more often than not! So I don't plan to sell our small holding to try and time a possible dip like this.", "score": 5, "replies": [{"body": "Tesla started deliver Model 3 to Europe and China in Q1 2019. The demand was just by early adopters then. This year I expect the demand to be stronger. This is just an assumption and I haven’t looked into current delivery time for Model 3.\n\nI wonder if Tesla will build up an inventory again by end of Q1 or if they will continue to sell everything, just like end of 2019.", "score": 4, "replies": [{"body": ">Tesla started deliver Model 3 to Europe and China in Q1 2019. The demand was just by early adopters then. \n\nThis. There was not even a way to test drive a Model 3 in Europe. I had the opportunity to drive one in the states in 2018, which made me confident enough to pull the trigger on an order, but the demand is probably higher now in Q1 2020.", "score": 3, "replies": []}]}, {"body": "This was the case last year since they were just only starting to ramp up European deliveries and US sales fell to a slump in Q1. This year they have much lower prices, Europe and China sales. Hopefully that will be enough.", "score": 4, "replies": []}]}, {"body": "God I hope you are right", "score": 2, "replies": []}, {"body": "this aged so fucking well holy shit. this man literally more than tripled his money within the last month from these call options that everyone here told him not to buy. the balls are insane", "score": 2, "replies": []}, {"body": "Underrated comment ...", "score": 1, "replies": []}]}, {"body": "\"You shall not pass\"\n\n(Stock goes to $500)\n\n\"Tis but a flesh wound\"", "score": 10, "replies": []}, {"body": "Me, thinking I'm cleaver enough to time the market, having a near heart attack. Lesson learned.", "score": 9, "replies": [{"body": "Learned it my first week. Welcome to the club!", "score": 5, "replies": []}, {"body": "You too?   :)", "score": 3, "replies": []}, {"body": "I still think I’m clever enough, even though it never worked for me. Is there a cure for this?", "score": 2, "replies": [{"body": "Well, after yesterday's personal fuck up, I'm gonna make a personal 10 COMMANDMENTS FOR STOCKS- rules I have to make myself follow, to lessen the chance of future fuck up. Maybe an idea to make your own? :)", "score": 2, "replies": []}]}]}, {"body": "Rising again. Time for \"Funding secured at 520\" Elon tweet", "score": 10, "replies": [{"body": "You mean 690, right?", "score": 10, "replies": [{"body": "694.20", "score": 12, "replies": [{"body": "I have found my new price target, thanks", "score": 5, "replies": []}, {"body": "Nice!", "score": 2, "replies": []}]}]}]}, {"body": "This insane volume is implying strong upward potential. However,  there are >10M expiring calls tmr >490, and another 5M calls from 480 to 490. Due to the strong option resistance, it is likely stock ends up no more than 490 tmr -- then the rising pattern may resume from next Monday onwards.", "score": 18, "replies": [{"body": "Stupid question, but where do you see all the options?", "score": 7, "replies": [{"body": "should be available from your brokerage with up-to-date price. Open interest is the outstanding amount of option at each date / price, and is updated daily after market closes.\n\nCan also check out Yahoo finance (price is not real time though), search tsla and there is an option tab.", "score": 4, "replies": [{"body": "Thank you!", "score": 2, "replies": []}]}]}, {"body": "So what you are saying is....that if it hits 500 then its going to 520?\n\nAll the ITM call holders would never exercise just to sell their shares into a weekend....right?\n\n:)", "score": 2, "replies": []}, {"body": "I think if had gone over 520ish the real squeeze would have hit.  Makes me wonder if Einhorn eat all sold hard this morning to avoid that crisis.  Who knows.", "score": 1, "replies": []}]}, {"body": "Back to green, crisis averted!", "score": 9, "replies": [{"body": "And back to red", "score": 4, "replies": [{"body": "Lol yup 😂", "score": 3, "replies": []}]}]}, {"body": "Anyone know if JB Straubel has an aversion to public markets like Elon? I hope Redwood Materials has an IPO", "score": 10, "replies": []}, {"body": "Why does Ford issue a large dividend instead of fixing their horrendous balance sheet? $100B in debt why burrow to pay out div?", "score": 10, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Almost seems like they know when the moment comes they get in trouble the gvmt will come in to bail them out.", "score": 3, "replies": []}]}, {"body": "People that hold F stock don't do it for the growth", "score": 3, "replies": [{"body": "They do it out of self torture ?", "score": 2, "replies": []}]}, {"body": "Press F to pay respect", "score": 3, "replies": [{"body": "$F", "score": 2, "replies": []}]}]}, {"body": "New here--jumped in this morning with 400 shares at $493.78.\n\n.. And then watched that drop to $473 almost immediately after. Wrote $505 (1/10) calls on the way down at least. The volatility feels just like AMD.", "score": 9, "replies": [{"body": "Casually dropping almost $200k into shares like it's no big deal, I wouldn't be able to sleep at night, best of luck to you.", "score": 16, "replies": []}]}, {"body": "fun fact: when the stock reaches 560, my (theoretical) gains would be 120K €, or what I paid for my Model S 2 years ago.", "score": 17, "replies": [{"body": "I opted to not buy one last year and held a larger position instead, my wife has no idea lol", "score": 3, "replies": [{"body": "smart move... i regret telling my wife that the stock went up so much recently.  Plans for upcoming holidays became more exuberant :(\n\nNow I just don't talk about the stock at all anymore at home", "score": 2, "replies": [{"body": "Yeah, don't disclose too much to the wife...  Otherwise then get micromanaged.  I'd rather be like, oh wow - where the F did this extra $1M come from when it's too late for her to spend it :)", "score": 3, "replies": []}, {"body": "She doesn’t know how to look up a stock price on her own?", "score": 0, "replies": []}]}]}]}, {"body": "Green!  I forgot what this felt like...I'm like a fish with 15 seconds of memory.", "score": 15, "replies": []}, {"body": "Wondering if we'll finally see the coast-to-coast demo this ER.\n\nOf course I've been suggesting this for the last two years, including every ER, unveiling, annual call, and special day. Eventually I'll be right 😁", "score": 9, "replies": []}, {"body": "$TSLA downgraded to Neutral @ BAIRD , but  raising price target to $525\n\n\"we would not short the stock and remain positively biased over the long run\"", "score": 14, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I guess they are saying not much point buying a risky stock that is already quite near its price target but if you already own it then don't sell.", "score": 6, "replies": []}, {"body": "It means they're being dicks by calling a raise in price target a fucking \"downgrade\".", "score": 8, "replies": []}, {"body": "Since no one answered (at least about the meaning of neutral), neutral means they expect similar gains to the broader markets.", "score": 1, "replies": []}]}]}, {"body": "My 2020 resolution was to make an extra 100k this year vs last year.\n\nI think I may have to upgrade it to 500k.\n\nThis is the best problem I've ever had in my entire life.\n\nI love you, Elon.", "score": 14, "replies": []}, {"body": "10 mins to go.\n\nI'M JACKED!!! I'M JACKED TO THE TITSS!!!", "score": 14, "replies": [{"body": "> ~~THE TITSS~~\n\nWe prefer man-boobs as of late yesterday.", "score": 12, "replies": [{"body": "the only thing that makes that comment even better is reading it out of context", "score": 6, "replies": [{"body": "🤣", "score": 2, "replies": []}]}, {"body": "My moobs are ready for 500.", "score": 2, "replies": []}, {"body": "DO YOU FEEL IT?!?!", "score": 1, "replies": [{"body": "I feel like a priest on alter boy audition day. Something's definitely going on, but I'm not allowed to talk to anyone about it.", "score": 8, "replies": []}]}]}, {"body": "This is nuts!!!", "score": 4, "replies": []}]}, {"body": "Spiegel has reduced his short position to 5% following yesterday's run\n\nhttps://twitter.com/Teslaconomics/status/1215273865242431488", "score": 14, "replies": [{"body": "Hahaha right on the peak he stepped out 😄", "score": 8, "replies": [{"body": "I'm not giving his link a click but LOL", "score": 2, "replies": []}, {"body": "The Spiegel way", "score": 2, "replies": []}]}, {"body": "I love it. I wonder how his blood pressure is right now that it's down 3.7% from yesterday when he sold? LOLOLOLOL!!!", "score": 6, "replies": [{"body": "Yeah I just read this and my sides hurt right now. What a fucking looser.", "score": 2, "replies": []}, {"body": "He actually got back in https://twitter.com/markbspiegel/status/1215297926940983297?s=20\n\nPatience... :)", "score": 1, "replies": []}]}, {"body": "Welp, I'm definitely adding \"trading sardine\" to my vocab.", "score": 6, "replies": []}, {"body": "Actually, he took it back up to 10% this morning in “low 490s” , with a stop at 499, which admittedly looks like a good move so far.\n\nhttps://twitter.com/markbspiegel/status/1215297926940983297?s=20", "score": 2, "replies": [{"body": "Though honestly .... we probably shouldn’t follow this person so closely . I guess it’s a good cautionary tale at least?", "score": 2, "replies": [{"body": "We don't need to follow him at all. He's so so so wrong on everything TSLA", "score": 3, "replies": []}]}]}, {"body": "\\^ That explains why it went up so much yesterday.", "score": 1, "replies": [{"body": "Not really, his fund is pretty small.  He’s just very loud so he got more attention than he ever really deserved.", "score": 1, "replies": [{"body": "this makes me happy", "score": 1, "replies": []}]}]}, {"body": "I knew it was one of the big shorts capitulation that lead to yesterday lol", "score": 1, "replies": []}]}, {"body": "TESLA 500 EOM", "score": 7, "replies": [{"body": "EoM = End of Minute?", "score": 16, "replies": [{"body": "By 9:31 EST", "score": 11, "replies": [{"body": "Not 9:31 EST today.", "score": 1, "replies": []}]}]}]}, {"body": "This volume is ridiculous", "score": 6, "replies": [{"body": "Have rarely seen it swinging between red and green so much lol", "score": 3, "replies": [{"body": "where can i see the live trading volumes as they go?", "score": 2, "replies": []}]}, {"body": "Average daily volume in the first hour.", "score": 2, "replies": []}]}, {"body": "If the stock dips big, great chance to buy. If it goes up, I’m thrilled, but I’m in this for the long game and I’ll take either direction right now.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "What a strange reality we live in ...", "score": 6, "replies": []}, {"body": "Pump to short maybe?", "score": 2, "replies": []}, {"body": "What a clueless old fart.", "score": 2, "replies": [{"body": "Well, it does sound like Elon put the ‘art’ back into the old fart.", "score": 1, "replies": []}]}]}, {"body": "Anyone down for a split at 1,000? I am - would help us smaller guys buy shares more quickly, lol", "score": 13, "replies": [{"body": "No. More volatility is bad for this stock. Keep it high and reward long term buyers.", "score": 7, "replies": [{"body": "Ah, good point - just thinking about my ability to buy more asap, but that's more important!", "score": 5, "replies": [{"body": "M1finance baby", "score": 7, "replies": [{"body": "True - I just love Fidelity so much lol", "score": 3, "replies": []}]}]}]}, {"body": "Robinhood lets you buy fractional shares", "score": 6, "replies": [{"body": "Not yet though right? It has a waiting list of like a million people.", "score": 1, "replies": [{"body": "Oh, my bad.", "score": 1, "replies": []}]}]}, {"body": "Most brokerages allow fractional shares.", "score": 4, "replies": []}, {"body": "How does a split work for existing stock holders?", "score": 3, "replies": [{"body": "If you own 5 shares and Tesla announces a 1:2 split, then on the day of the split your broker changes the number if shares you own to 10. You now have twice as many shares at half the price. It is not a dilution.\n\nMore indirectly, people like hearing a stock is splitting, so it might promote positive investor sentiment.", "score": 2, "replies": [{"body": "Thanks, figured that was it, but seeing some reactions to the idea over the last few days made me wonder if there was more to it.", "score": 1, "replies": []}]}, {"body": "You have more shares that all are worth less.", "score": 2, "replies": []}]}]}, {"body": "yesterday thread had double the comments.. i expect a full crowd tomorrow .. :)", "score": 13, "replies": [{"body": "Pretty crazy how this sub is able to make the stock go up and down just by the number of comments!", "score": 11, "replies": []}]}, {"body": "Before hours volume through the roof... again.\n\nTSLA is moving 2x what AAPL is moving in premarket.", "score": 12, "replies": []}, {"body": "Bought a 600 call for 2/14 on the dip, today was necessary set back for another big push... hopefully", "score": 12, "replies": []}, {"body": "Hello, new TSLA investor here and discovered this sub today.\n\nHad shares at 485 and sold at 473 due to weak hands only to watch it go back to 480s levels.\n\nSmall loss for a big lesson. Bought back in at 485s and hodling strong this time.", "score": 12, "replies": [{"body": "I have done this!  I had 615 shares.  I traded them for 605.  Live and learn :P.", "score": 8, "replies": [{"body": "Haha emotions get the best of us. Now we know better!", "score": 5, "replies": []}]}, {"body": "Tesla isn't a short term stock. The market around it is too irrational", "score": 6, "replies": [{"body": "Agreed. Bury me with my shares lol", "score": 6, "replies": []}, {"body": "Myeah, learned that the hard way.", "score": 1, "replies": []}]}, {"body": "If you can, hold till 2025. Thank me later", "score": 7, "replies": []}, {"body": "Yep, thanks y’all. Learned my lesson. It helps to understand the long term vision of Tesla (ie. master plan deux). I’m young and got a long horizon ahead of me. Only looking to add to my position!", "score": 2, "replies": [{"body": "Yea I mean - if you're young than you are looking at maybe 10k/share in 10 years or 4.85M woot!  Or maybe 50k/ share in 20 years.  Of course at some point hopefully we transition out of a scarcity based economy and at that point does it even matter?", "score": 2, "replies": [{"body": "Wow 10k-50k per share, Im long TSLA, but is that possible?? Asking genuinely!", "score": 3, "replies": [{"body": "10k sure. That's only a 2T valuation. High but in ten years there will be over a dozen trillion dollars companies and not many of them have as many key revenue drivers as Tesla. \n\n50k next to impossible. Everyone in this forum likes to think Tesla will go uncontested forever now and will actually win every one of their battles but it's just not happening or going to happen. 10T market cap would mean it is worth about the same a the current s&p combined.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Just pictures home Simpson drooling going nurseeeeees for some reason..... Should probably stop redditing at 4 am.", "score": 2, "replies": []}]}]}, {"body": "It's possible but not likely in /u/Soooohatemods timeline IMO.\n\nIf the current auto, software, and energy businesses were valued at $1T each that would equal a share price of $16k.\n\nTo justify that kind of valuation they would definitely need to be building 10M+ robo-taxis per year, fully invested in developing  and promoting the auto entertainment ecosystem, deploying many gigafactories worth of batteries and solar roofs around the world, and probably a full execution of Master Plan Part Trois.\n\nIf a SpaceX merger/buyout were to ever occur that could also make the valuation more likely.", "score": 2, "replies": [{"body": "I do get a little ahead of myself sometimes.  Maybe I'm on Elon time :D", "score": 3, "replies": []}, {"body": "When robotaxis exist, particularly those that are electric with 1M+ mile batteries, there's no need to make 10M/year. The whole point is people stop building/buying new cars and better utilize and share the ones that exist (1 robotaxi should eliminate the need for up to 9 cars). That said, the cars will be printing money every hour of every day, so this isn't really a problem, you're just thinking about the business model a bit incorrectly. Also, what $1T software business do you anticipate Tesla having?", "score": 2, "replies": [{"body": "We will need **\\~84 M** robotaxis per year. (depending on future short-range public transit options)\n\nI doubt robotaxis will be able to beat owned vehicles by more than 3x for \\~30 years. People will want to spend even more time and distance driving if driving becomes easier. I'd be willing to say they might be able to do 5x especially in urban areas and 3x in rural areas.\n\nHowever, we currently need 90 M vehicles per year with something like 30% of the population using vehicles and a population of 7.8 B. Population will soon be about 11 B.\n\nSo we will need approximately *90 M / 0.3  \\* (11/7.8) / 5* robotaxis per year. Plus 100% electric trucks, semi-trucks, boats, ships, planes, and heavy duty equipment.\n\nAs for software, I am including FSD/robotaxi in that potentail $1T, but also the car entertainment ecosystem and potential there.", "score": 1, "replies": [{"body": "I could not disagree more on your 84M taxis each and ever year requirement, each running 24/7 for several years, but each to their own.", "score": 1, "replies": [{"body": "We're going to need more than 10 M a year for Africa alone for the 4+ billion Africans, and that'll still only be 1 vehicle per 26 people with a service life of 15 years.", "score": 1, "replies": [{"body": "I invest and model for the long-term, but not 100 years long-term.", "score": 2, "replies": []}]}]}]}]}, {"body": "How likely is a SpaceX merger/buyout??", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "If I remember correctly he never said \"leave\" company in the meaning of completly abandoning - just not being CEO any longer and taking some role as product designer or something. But don't worry - his compensation plan is due to 2028 so I guess he will try to reach 650 bln $ market cap until then as CEO.\n\n&#x200B;\n\nEDIT: [https://fortune.com/2018/03/22/elon-musk-compensation-tesla/](https://fortune.com/2018/03/22/elon-musk-compensation-tesla/) unfortunately Chief Product Officer still grants him compensation so can quit CEO job before 2028, but as You can see - that is important role and at some point of the time maybe it will be more feasible to him if Tesla grows rapidly being much bigger company than now...", "score": 2, "replies": [{"body": "Compensation won't keep him, but it will motivate and reward him while he's here. Once he has $100B+ dollars, he's not going to stay for more when he can change the course of history by being the individual that made human life multi-planetary. I personally don't think he's even staying now for the money, it seems it's all about the mission and the legacy.", "score": 1, "replies": [{"body": "But that compensation can make him really better suitable (like he is nr 1 on Earth still, but probability rises) to be that man with SpaceX. Also why not Tesla start making Mars transportation and be second company on Mars with factory after SpaceX? Too much fun for him it will be always his child ;)", "score": 1, "replies": []}]}]}, {"body": "You think he would leave Tesla?", "score": 1, "replies": [{"body": "He talked several years ago about committing to sticking around until around now and then evaluating. Obviously much has changed since then and I think he'll be here for quite a while longer, but once this beast has reached escape velocity and isn't so dependent on him, I do think he'll prioritize SpaceX (honestly, who wouldn't in that position).", "score": 2, "replies": [{"body": "Makes sense, but it also kinda makes me really sad. Elon means a lot, and I love being able to support him. Ultimately, I suppose this makes the most sense and is the best for the company to be self-sustaining. No king rules forever", "score": 2, "replies": [{"body": "If this ever does happen, if you've held your shares until then, you won't be sad. :) I don't think he'd ever leave the company imperilled, but just the opposite. Once Tesla has accomplished its mission and is more-so just a business to continually be optimized, he can better serve our species (and quite frankly, his legacy) by focusing on the SpaceX mission.", "score": 2, "replies": [{"body": "Very true, thank you - I doubt we'll have a chance to invest in SpaceX (other than the Goog route), but I just bought some merch to do what I can to support it! Not that they need merch, lol", "score": 1, "replies": []}, {"body": "Although, worth noting Elon seems to like synergy between his companys - so we'll probably benefit as SpaceX does, to a lesser degree imo", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "It depends on what you think Tesla is good at.  If its just EVs then maybe not.  If they are in and maintain a leadership position in automation and specifically disconnected autonomous agents i.e. robots (this looks at a self driving car as the first example of a robot sophisticated enough to automate a non-trivial job in the economy) then absolutely; Tesla owns the future.", "score": 2, "replies": []}]}]}]}, {"body": "It's okay, most of us have done it. It sure makes you feel stupid, but lesson learned", "score": 2, "replies": []}]}, {"body": "Ok I'm going to sound lame here and give some advice no one asked for.  Pursue investing as a hobby not a job.  Find a way to add  value to the world.  Pursuing money can warp you into a crazy place - like Tesla bears - trying to destroy value in order to make a profit.", "score": 22, "replies": [{"body": "There is huge difference between investing to help company values you believe in while also making money and hoping everything crashes and burns down so you can make money. Shorts have their place in the market to maintain balance or even uncover fraud but TESLAQ is much more than just believing TESLA is overvalued and placing their bets. They spread FUD and conspiracies day in and day out about Elon and Tesla so they can profit off of their positions. Experienced TSLAQ shorters while taking losses are likely hedged, its the small guy who listened to their propaganda and went all in on shorting Tesla who is getting killed by recent rise\n\nAnyways, do not bet against tranformative companies like Apple, Amazon or Tesla because on average stonks only go up and these stonks go up much faster.", "score": 5, "replies": [{"body": "Agree 100% which is why I'm proud of being a Tesla investor.  TelsaQ is full blown short and distort.   I think investing is great but rarely is it a full time job.  Trading on the other hand can be.  I just think more happiness comes from steadily creating value than speculating and betting.", "score": 2, "replies": []}]}, {"body": "> Find a way to add value to the world\n\nWithout us, the investors, Tesla wouldn't be able to make cars and push the green revolution towards renewable energy.\n\nI think we're adding value here. We're also looking to make money while doing it. \n\nYou can do both. We're doing both.", "score": 3, "replies": [{"body": "‘Us’ should be both investors and customers.  Both are needed to survive and grow.", "score": 3, "replies": []}, {"body": ">You can do both. We're doing both.\n\nI agree but I think it's good to have a creative career - especial for the new young investors in here.  Obviously Gali and Rob are creating a ton of value *in the field* of investing.  But yea, I'm saying don't become a trader, crony analyst,  or any other wall street douchebag.   Also fuck ~~accounting~~ managing creativity from purely financial perspective - but thats just me :P.", "score": 2, "replies": [{"body": "> it's good to have a creative career\n\nOh for sure!\n\nI'm a professional photographer.\n\nI'm doing this so I can take photos of whatever the fuck I want, and not what people want to pay me to do.", "score": 3, "replies": [{"body": "Ha, totally!", "score": 2, "replies": []}]}]}]}]}, {"body": "Do you guys think it will stabilize today around $500 or will it go even higher?", "score": 6, "replies": [{"body": "If we could accurately predict what a stock will do, we'd all be billionaires in here.\n\nWhat we CAN do is estimate the most likely outcome.\n\nMost likely we're on a one way train to $700+ from here all the way into Q1 earnings report in April.\n\nI think we're actively witnessing escape velocity. It's the positive feedback loop of shorts covering, which drives the stock price up, which causes more short covering, and on and on until all the shorts are almost gone.", "score": 16, "replies": [{"body": "Short interest is still pretty high though. It has actually gone up.", "score": 8, "replies": [{"body": "Good!\n\nThat'll make them have to cover later and drive the stock even higher.", "score": 7, "replies": []}, {"body": "Well that can mean 2 things.\n\nEither we have a correction downwards and more people are expecting it as price goes higher.\n\nOr they are cucking themselves and will lose even more.\n\nWho will win?", "score": 3, "replies": []}, {"body": "lol, short interest has gone up?! Where can check this?", "score": 2, "replies": [{"body": "https://fintel.io/ss/us/tsla\n\n8.9 million shares shorted. As opposed to 5.2 the day before.", "score": 1, "replies": []}]}, {"body": "I thought last night there was a chart showing it dropping...  what's it at now?", "score": 1, "replies": []}]}]}, {"body": "It's going to keep going higher.", "score": 10, "replies": [{"body": "Remember when TSLA tripled in about 6 months from $30 to $90 in 2013.  Same could be starting now.  I freaked out and sold (and quickly bought back) at $90 within a couple of days.  I tend to get just as nervous on the up side as the down side.", "score": 3, "replies": [{"body": "It's already up from 178 so... I don't know.", "score": 1, "replies": [{"body": "178 was an anomaly, around 300 was the true baseline valuation for a while.", "score": 1, "replies": [{"body": "Well yeah you are probably right. I will follow your advice and will buy 8 more shares! Will pay you a beer if it goes to 900 soon enough :P", "score": 1, "replies": []}]}]}]}]}]}, {"body": "algo push vs institutional investors have begun...insane volume and swinging dollars at a time", "score": 5, "replies": []}, {"body": "It’s kinda insane that just 7 months ago I (as well as many others) was in the red 10s of thousands of dollars. I really was just hoping for 300 by EOY (Mainly so I could cheaply add to my position). Yet here we are. I knew this rise would come, just didn’t expect this soon. Congrats everyone. China will change everything.", "score": 6, "replies": [{"body": "Same here. Went through the valley with -40 % and now up +38 % again. Reading the comments here makes me feel poor & dumb, but on the balance sheet it's one of my best investments.", "score": 5, "replies": [{"body": "Don’t feel that way. People mostly only comment when it’s going well and they won. No one who lost or is doing just ok comments. You’re doing great.", "score": 2, "replies": []}]}]}, {"body": "Looks like I'll have to be patient and wait longer for 500 to come, but that's the essence of being long.", "score": 6, "replies": []}, {"body": "If I had more courage I’d have bought another call on the dip.", "score": 6, "replies": []}, {"body": "Ok, I'm done speculating on short squeezes for a while looks like.\n\nIt's really not that bad, the stock pulling back a little...  it's just I finally put money into calls this morning thinking it would continue to squeeze.  At least they're far off dates (Sept 2021).", "score": 6, "replies": [{"body": "Same lol.  I literally just bought 3 Jan 2022 calls and it does this.  Oh well, I guess I could always average into a better cost basis position :)", "score": 2, "replies": [{"body": "That'd be the smart thing.  I just didn't want to bring that up to the wife.\n\nFunny thing is she called, told me she put in an order for 5 Jan 2022s... but she still doesn't understand option pricing (although she thinks she does) so the stock would have to hit somewhere around 450 for it to execute.", "score": 1, "replies": [{"body": "Ahahaha that’s so cute.  Or perhaps TSLA will become such a low IV stock that her orders will catch.\n\nFor me I just ignore the 2 dollar spread and submit market orders.  Won’t be looking at it for another year at least so a few hundred dollars literally makes no difference", "score": 2, "replies": []}]}]}, {"body": "Any idea why the stocks took a dip today?", "score": 4, "replies": [{"body": "Seems to be some profit taking today driven by two analyst reports.", "score": 13, "replies": []}]}]}, {"body": "I'm HODLin on to my calls way past Q4 ER. However, I am no longer sad that I zeroed out my cost basis on at least on of my positions yesterday.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "That's a great observation. Thank you. It could very well trade sideways now till Q4 numbers come out", "score": 1, "replies": []}]}, {"body": "I am not jacked to the tits today", "score": 10, "replies": [{"body": "Where's the meme for that one?  :)", "score": 5, "replies": []}, {"body": "Eh, I've given them a loan.  They'll pay me back with interest.", "score": 2, "replies": []}, {"body": "It's rising again, don't worry", "score": 2, "replies": []}]}, {"body": "Flip postmarked to premarket eh? Not that that has guided much.", "score": 5, "replies": [{"body": "Baird downgraded Tesla to neutral while upping the price target from $335 to $525. Hopefully we’ll shrug it right off. \n\nEdit: 525 not 550", "score": 7, "replies": [{"body": "How can we be downgraded with a higher price target?\n\nWhat the actual fuck...\n\nEdit: I mean... if the stock isn't at the target yet, the rating should be \"buy\" 100% of the time, no?\n\nCan anybody explain this to me? Or does this have no explanation and it's just Wall Street shenanigans?", "score": 11, "replies": [{"body": "There is only $32 between the current price and their target so you would be taking quite a lot of risk for a small return hence neutral. If the target was $525 and the current price was $250 then I'm sure they would have a buy rating.", "score": 9, "replies": [{"body": "Okay, that kinda makes sense.", "score": 5, "replies": []}]}, {"body": "> Can anybody explain this to me? Or does this have no explanation and it's just Wall Street shenanigans?\n\nNo. Yes.", "score": 5, "replies": [{"body": "I don't think I've ever hated Wall Street more than after having to directly deal with these scumbags.", "score": 3, "replies": []}]}]}, {"body": "They did it so CNBC could have this mornings headline \"Wall Street starts to turn cautious on Tesla with two downgrades..\" bunch of insincere cunts. Trading Tesla has made me a lot more aware that any recommendations, wether positive or negative, always have an underlying motive.", "score": 3, "replies": []}]}]}, {"body": "This is guacamole for ants.", "score": 4, "replies": []}, {"body": "Any idea when the earnings call will be?", "score": 5, "replies": [{"body": "the last one got anounced on the 9th, so maybe we get a date today", "score": 4, "replies": []}, {"body": "January 29th after hours is the consensus.", "score": 3, "replies": []}, {"body": "End of January.", "score": 2, "replies": []}]}, {"body": "holy molly. 2 million trades in the first minutes.", "score": 5, "replies": [{"body": "I think this number includes after-hour and pre-hour volumes before opening.\n\nStill a very crazy number. And added 0.6M in 4 minutes...at this rate we are looking at another huge day in volume.\n\nedit: now 1M extra volume in 6 minutes... probably the craziest volume I have ever seen other than earning days.", "score": 8, "replies": []}]}, {"body": "Wow, these fluctuations are fucking wild!\n\nI've never seen TSLA do this before.", "score": 5, "replies": [{"body": "Some agressive selling from big bois...", "score": 2, "replies": []}]}, {"body": "lotto 01/10 500c in, and already up 50%", "score": 4, "replies": [{"body": "Ya that’s what I shoulda done haha. Say it every morning.", "score": 2, "replies": []}, {"body": "Nice. Wish I had the balls to do that stuff.", "score": 2, "replies": [{"body": "Yeah, well I'm down $5k on options I got today so far.  :/\n\nPerhaps the people that don't do so well just don't talk about it as often as the ones that succeed.  My calls are Sep 2021, so there's a lot of time to recover and do better... but right now I started off poorly today.", "score": 3, "replies": []}]}]}, {"body": "It ain't over till it's over.", "score": 4, "replies": []}, {"body": "This volume is something to behold...", "score": 6, "replies": []}, {"body": "rising from the grave. Ill take it", "score": 5, "replies": [{"body": "Grave?  I hope you never get medical power of attorney over anyone.", "score": 13, "replies": [{"body": "shhhhh with the momentum weve had any little set back hurts, but like most here im holding for the long.", "score": 0, "replies": []}]}]}, {"body": "Looks like Ben is telling people to take profits, might explain this selling pressure...", "score": 10, "replies": [{"body": "That's what I was thinking. But I hoped that one dude saying that wouldn't have that big of an influence.", "score": 7, "replies": [{"body": "it's fucking insane how much people trust these \"analysts\" - Not hard to do one's own research! lol", "score": 10, "replies": [{"body": "It is kinda funny, especially because it's a known fact that the average analyst recommendation is not a good basis to trade on.", "score": 1, "replies": []}]}]}, {"body": "Who's Ben?", "score": 7, "replies": [{"body": "Hi", "score": 3, "replies": []}, {"body": "Ben Solo", "score": 4, "replies": []}, {"body": "Ben Kallo", "score": 2, "replies": []}, {"body": "https://finance.yahoo.com/news/battle-worn-tesla-backer-recommends-144245995.html", "score": 1, "replies": []}, {"body": "Some rando analyst", "score": 1, "replies": []}]}]}, {"body": "If you were looking for a time to buy. Now is that time. It will rise again before financial earnings. just bought two calls. \n\nCan't wait to hear everyone post \"I should have bought when it was down last week\" on Monday", "score": 9, "replies": [{"body": "Wish I had the money to buy more - literally bought all I could yesterday...", "score": 9, "replies": [{"body": "What type of margin are you at?", "score": 1, "replies": []}]}, {"body": "Bought two when the stocks opened this morning at 492$. Bit pissed, but a great time to pick up some shares today. Will deffo keep close eye to the stocks until the market closes for today.", "score": 4, "replies": [{"body": "I added 30 this morning at $493. I guess I should have waited a bit but it won’t matter much in the long term.", "score": 4, "replies": []}]}, {"body": "Just curious, do you think Tesla will announce positive earnings guidance after earnings?\n\nLike will Q1 Q2 this yaer be profitable?", "score": 2, "replies": [{"body": "Honestly, I'm not sure. I think this intense ride will end at some point. But not today. This is correction is normal", "score": 2, "replies": []}]}, {"body": "Which calls did you buy?", "score": 2, "replies": [{"body": "500 on 1/24. I think we will hit that 500 mark", "score": 1, "replies": [{"body": "Just wondering why not the 500 1/31 ones as it'll allow for more time to run up before earnings?\n\nI do like the much lower premium on the 500 1/24 but think that extra week would be nice to have.", "score": 1, "replies": [{"body": "I'm just guessing and wanted to pay less. But that sounds good as well! Who knows, maybe I lose out! Could drop to 400 tomorrow and I'll be out of luck", "score": 1, "replies": [{"body": "Crossing my fingers we waste no time and hit > 515 soon! I think I'm gonna wait a week and buy 1-2 490-500 1/31calls as the premiums will be lower but who knows lol", "score": 1, "replies": []}, {"body": "Change of plans. The premium dipped a tiny bit further so officially bought my first call option! 500 strike 1/24. Hopefully roll those gains into another call nearing 1/31. Lets gooo", "score": 1, "replies": [{"body": "Woo! Let's ride!", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "2% fall hurts so bad after 100% bull run lmao", "score": 9, "replies": [{"body": "I feel your pain, hehe.", "score": 3, "replies": []}]}, {"body": "Transfering more funds to try and catch this dip - might take until 1/16/20... rip lol", "score": 9, "replies": [{"body": "That's what margin is for. To capture buying opportunities while funds are on the way.", "score": 5, "replies": [{"body": "literally the only good use of margin\n\nAnd some brokers wont even charge you fees if you cover within 2 days or something", "score": 4, "replies": []}]}, {"body": "Y'all should be wiring!", "score": 3, "replies": []}]}, {"body": "Just called $600 for first february week after earnings. Excited!", "score": 8, "replies": []}, {"body": "Crazy volume and crazy spikes/drops/recoveries. We might break nasdaq today - hope their computers can keep up!", "score": 4, "replies": []}, {"body": "I'm getting whiplash from this.", "score": 5, "replies": []}, {"body": "Option traders, and momentum traders concerned?", "score": 4, "replies": [{"body": "For today, yes. I want it to close already. For tomorrow, no. \n\nI think we'll still hit 500 before end of the month", "score": 7, "replies": [{"body": "What truly matters will be ER", "score": 15, "replies": [{"body": "Very true. That will put the stock numbers right were they need to be", "score": 2, "replies": []}]}]}]}, {"body": "I am a student with €1000,- to spend without the risk of not being able to pay my liabilities. I also am a big fan of Tesla, but haven't had the courage to buy the shares (considered it at a price tag of €320, painfull i know). What would you do?", "score": 5, "replies": [{"body": "Don't invest. Even if tesla tripled from today you would only make 2000 profit. Less after fees.\n\nInvest that 1000 into your education and get yourself a good career with a high salary. Then use your disposable income to invest big in whichever area you like.", "score": 11, "replies": [{"body": "Thanks for the respons! Completely agree on the low possible profit. Really want to develop a steady portfolio though", "score": 1, "replies": [{"body": "There is a time in your life when it is right to build a portfolio. \n\nRight now you are in the education phase. Focus on that and once you have a steady income you can build your portfolio with all the knowledge you have gained.", "score": 3, "replies": []}, {"body": "They could go down if we have a recession in the next couple of years. But over 5-10 one would assume it's a very good investment. It's just hard atm as they've shot up so ridiculously fast and may be due for a correction. Id buy when u can and not worry about it too much. Impossible to predict the macro.", "score": 1, "replies": [{"body": "Yes totally agree. It is somehow against my guts to step in on an ATH", "score": 1, "replies": []}]}]}]}, {"body": "I’m also a student that started with $1000 and made little over $4000 only by *trading* Tesla. I don’t own stock, I trade CFDs, with 5x leverage. So far it worked for me. It was difficult at first, but I learned that patience is truly a virtue.\n\nThe reason I don’t invest in proper stock is something that’s already been said: I have so little disposable income, that even if the stock tripled, I wouldn’t make any significant profit. That’s why I chose to risk my money on CFDs.", "score": 4, "replies": [{"body": "Cfds are illegal in the states from my understanding. Have to trade options.", "score": 3, "replies": [{"body": "Oh, really? I’m from Europe, so I wouldn’t know.\n\nI’m still learning about options, really wish to start trading them.", "score": 1, "replies": [{"body": "Yeah we were going back and forth on another thread yesterday haha. Haven't had a chance to elaborate.", "score": 1, "replies": []}]}]}]}, {"body": "Honestly I'm a first time buyer today. Bought my first two shares today at 492$ this morning and honestly in my opinion wait an hour or two and see where it's at. Stock exchange is still open for another three and a half hours.", "score": 2, "replies": []}, {"body": "wait for $320 entry point\n\nso overbought rn, also short covering is over", "score": -6, "replies": [{"body": "Doubt it's going down to 320$ lol", "score": 9, "replies": [{"body": "ya thats wishful thinking it will ever get that low again", "score": 2, "replies": []}]}]}]}, {"body": "Honestly, if we land on -2% today I'm happy, my options doesn't get too fucked that way, but it's understandable with a drawback rn.", "score": 5, "replies": [{"body": "There are you happy. You welcome.", "score": 2, "replies": []}]}, {"body": "THAT'S MY BOY!", "score": 3, "replies": []}, {"body": "For those wondering if they should sell, zoom out to the weekly and monthly charts should give you a good idea.", "score": 10, "replies": [{"body": "Meaning?", "score": 3, "replies": [{"body": "Meaning today is a blip. We're up $230 in the last 3 months (based on current price). Whats one $20 down day against an increase of $230? He's saying don't sell.", "score": 6, "replies": []}, {"body": "He means don't sell", "score": 4, "replies": [{"body": "See, the market calmed down after I made the comment :)\n\nWeak hands won’t get you 500% gains in 5 years.  Stop looking at the price day to day and focus on the big picture.", "score": 1, "replies": []}]}]}]}, {"body": "Question of the day: $500 during pre-market or after?", "score": 7, "replies": [{"body": "After", "score": 12, "replies": [{"body": "Wait for it...", "score": 2, "replies": [{"body": "I'd love nothing more than being wrong on this one lol", "score": 2, "replies": []}]}]}]}, {"body": "wtf just happened?", "score": 6, "replies": [{"body": "Somebody took profits...", "score": 16, "replies": [{"body": "Fucking losers", "score": 4, "replies": [{"body": "What goes up is likely to come down.", "score": 1, "replies": []}]}]}, {"body": "Maybe Ark Invest rebalancing their portfolio again.", "score": 0, "replies": []}]}, {"body": "TSLA is now 10% of my portfolio. the Rest is more traditional investments (Broad market ETFs) and another 10% is a tech heavy ETF.\n\nIron hands from here on out boys. I'm maxing my risk tolerance here and don't plan to buy anymore shares. Best of luck to you all and I look forward to checking in!", "score": 6, "replies": [{"body": "10%?. Those are rookie numbers. You got to pump that up!", "score": 11, "replies": [{"body": "That’s irresponsible to tell people. A single stock shouldn’t be more than 10% of your portfolio, at least if it isn’t a broad market ETF.", "score": 3, "replies": [{"body": "I am half joking. Everyone should hold it to whatever their risk tolerance is. My retirement accounts are all mostly index funds. I only \"play\" with individual stocks on my taxable accounts.", "score": 1, "replies": [{"body": "Many people can take this advice seriously, especially when people talk big about their gains from a run up like this. Anyone new to investing should have caution emphasized to them.", "score": 1, "replies": []}]}]}]}, {"body": "Lol rook", "score": 0, "replies": []}]}, {"body": "Side question: since deliveries were so great, is earnings priced in? Efficiency improvements are less likely to be priced in already, correct?", "score": 3, "replies": [{"body": "That's my thinking.  I think the efficiency improvements will outpace what the consensus expects for at least a few more quarters...", "score": 2, "replies": []}, {"body": "from yahoo finance, current Q4 earning estimate is 1.6 per share, while Q3 was 1.86 per share at lower delivery...\n\nSo for now, the estimate is pricing in slightly worse margin than Q3 -- this could be because Q4 GF3 delivered 15 model 3, which can drag down the margin a bit due to fixed cost. (I think Tsla did this on purpose so Q1 finance will look better)\n\nEfficiency-wise, I also expect it to improve gradually each quarter in Fremont. But it is hard to say overall, as GF3 is in ramping-up mode, and Model Y will soon enter production.", "score": 2, "replies": [{"body": "please explain this statement:  this could be because Q4 GF3 delivered 15 model 3, which can drag down the margin a bit due to fixed cost. \n\nhow does delivering 15 cars drag down margin?", "score": 1, "replies": [{"body": "I'm not an expert so this probably isn't exactly right, but it goes something like this...\n\nIn corporate accounting you don't need to recognize the depreciation of a capital investment until you start using it. While GF 3 was just sitting in China not producing cars they could claim the full value of the factory/production lines as assets. Once they start selling cars they need to depreciate those assets to 0 over some fixed time frame so every quarter they recognize $X in losses due to the factory being \"used up\" to some degree. That depreciation goes against the value of the cars sold from that factory and effectively becomes our earlier $X divided by the #cars sold. \n\nIf $X = $100,000 and cars sold = 10 then you basically add $10K to the cost of goods sold for each car thereby reducing the margin (obviously if COGS increases and sale price stays the same, margin decreases). So at 10 cars, $10K of each sale is factory depreciation, at 100 cars, $1K of each sale is depreciation and at 100,000 cars $1 of each sale is depreciation. As you produce more care the deprecation is spread over a greater number of cars and the cost per car drops so margins go up.", "score": 2, "replies": [{"body": "thx for the info.  I recall my accounting 101 class now :D .", "score": 1, "replies": []}]}, {"body": "The initial cost to produce goods is typically much higher when production starts, and stabilizes once production ramped-up. \n\nIt has happened in the past when model S / X / 3 starts / ramp-up production at Fremont, the balance sheet margin typically take a hit first, then stabilizes and improves as quarters go by.\n\nI don't think it is a big deal in long term, and merely accounting tricks -- the cash and revenue are still gonna be great, just a slight trade-off for profit between Q4 and Q1. But a factor to be cautious for short-term ER play.", "score": 1, "replies": []}]}]}]}, {"body": "500 price calls from yesterday. HODL till earnings? :D", "score": 3, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "That's my short term options strategy.  I'm apparently good at it.", "score": 2, "replies": []}, {"body": "Wrote puts 12 times since stock was 350. Bought my first call yesterday and it goes down. Guess I should be back to writing puts again!", "score": 1, "replies": []}]}]}, {"body": "How do people trade call options in the UK? Is there a recommended platform?", "score": 3, "replies": [{"body": "I don't do it myself but I think u can on degiro.", "score": 1, "replies": []}, {"body": "I believe you need to join a US stockbroker that allows International investors\n\nUK rules mean that you won’t be able to do this using a UK stockbroker unless you are a professional investor, to trade Tesla options", "score": 1, "replies": []}, {"body": "I used the app called Freetrade after recommendation from the Tesla Facebook group. I was extremely reluctant in the beginning and took me a month  to commit. In the end it is extremely easy.  \npm me for reveal if you want, it gives a random share as reward.", "score": 1, "replies": []}, {"body": "Edit: I meant to say “pm me for referral”", "score": 1, "replies": []}]}, {"body": "Tomorrow is going to be very interesting in the short-term, we haven't had b2b down days in what 5 weeks?", "score": 3, "replies": [{"body": "6 weeks.\n\nEdit: wait no... 6 days.\n\nDec 27 (Friday) December 30th (Monday) both down days.", "score": 1, "replies": [{"body": "ha, -0.1% is flat (12/27) -- you know what I mean :p", "score": 2, "replies": []}]}]}, {"body": "So, just to make sure I understand this, at around $560 Elon gets ~$7 billion of compensation. The stock has to sustain that market cap on average for a couple quarters, right? But after that, when he does get his first compensation, does it have the same effect as a ~$7 billion equity raise?", "score": 4, "replies": [{"body": "No, he only gets less than $1 billion in options. And I don't know what his exercise price would be so it could be even less.", "score": 2, "replies": [{"body": "He made more than a billion just yesterday from the rising stockprice. So I don't think he's to concerned.", "score": 2, "replies": []}]}, {"body": "I think it's 1 billion, but i might be wrong.", "score": 2, "replies": []}, {"body": "There are 12 tranches, each is 1% of the shares on the date of grant, January 21, 2018. That's 1.69m shares in each tranche. His exercise price is $350.02 per share (fair mkt value on the date of grant). So when the 1st tranche vests (not for at least 6 months) he has the option to exercise and would have to pay the exercise price to Tesla ($350.02 x 1.69m = $592m). If shares are then trading at say $500 then the tranche would be worth $845m a paper profit of $253m. Since vesting requirements include that the market cap must be in excess of $100B for 6 calendar months trailing average and 30 calendar days trailing average it's likely that the share price will have moved significantly.", "score": 2, "replies": []}, {"body": "He actually owns roughly 38.6 million shares so they've gone up around $12B in value in The past 6 months or so. I wonder what his price average is.", "score": 1, "replies": []}]}, {"body": "He is right you know! hahahhahaha\n\n[https://twitter.com/realDonaldTrump/status/1215299143066947584](https://twitter.com/realDonaldTrump/status/1215299143066947584)", "score": 4, "replies": [{"body": "lol 409k", "score": 3, "replies": [{"body": "covfefe!", "score": 1, "replies": []}]}, {"body": "409k", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Hope Canada doesn’t get pulled into this. Today Trudeau insinuated that Iran shot the plane. Also as a Canadian I hope Trudeau would refrain from jumping to conclusions (if he indeed said that) and wait for the investigation to provide evidence as to what happened.\n\nEither way, horrendous news. The Iranian community is big throughout Canada.", "score": 5, "replies": [{"body": "There is a video that looks legit and it makes sense", "score": 5, "replies": [{"body": "Getting to 500 shares tomorrow?", "score": 1, "replies": []}]}, {"body": "Just to clarify he didn't insinuate, he stated that all the evidence they've received themselves and from allies indicates it was shot down. Anyway, I really just wanted to comment on how close macro came from falling through the floor. Terrible development.", "score": 3, "replies": [{"body": "Thanks for clarifying. Hope the truth brings some peace to those suffering. Yea macro would’ve tumbled if Americans were onboard.", "score": 2, "replies": []}]}, {"body": "Trudeau is widely considered a farce tbh.", "score": -1, "replies": []}]}, {"body": "The fact that there was zero americans is kind of suspicious... Maybe they did it on purpose to show what mistakes can happen when they are put on high alert.", "score": -2, "replies": []}]}, {"body": "Took my healthy profits at $488. Cautiously looking into getting some puts, impl. volatility is brutal on this stock though...\n\nIMO new trading range is roughly $300-$500, up from previous trading range of $200-$400.\n\nIn long term I'm definitely bullish. It is entirely possible this will be trillion dollar company within 10 years...", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "... well, they had great cash flow and reserves last I saw.  Why raise?\n\nMaybe to add lines to GF3...", "score": 2, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I'd be a little nervous about owing them too much, honestly.", "score": 1, "replies": [{"body": "If you're nervous about China now, you're going to be admitted to a white padded room in a few years with where this partnership is headed lol.", "score": 3, "replies": []}]}, {"body": "China just cut rates an hour ago apparently", "score": 1, "replies": []}]}, {"body": "Should they wait for their stock price to be cut in half as they did for the last raise?", "score": -1, "replies": []}]}, {"body": "They prefer debt over selling more stock whenever possible.", "score": 1, "replies": []}, {"body": "To be honest today’s prices point to the stupidity of when they did their last capital raise", "score": -7, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "They hedged it all and lost no money.  Suggesting  they raise now is quasi trolling.", "score": 4, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "exo has been here since the beginning. Would be very surprised if he was trolling", "score": 2, "replies": [{"body": "xkj? All I’ve ever seen him/her do is troll here, for months.", "score": 3, "replies": [{"body": "Oh I thought you guys were talking about exo_night. Nowww I understand haha.", "score": 2, "replies": []}]}]}]}]}, {"body": "If the fears of insolvency were ridiculous, then why raise?", "score": -6, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "But if they had no cash troubles, why listen to that noise? \n\nAlso even Elon claimed they were weeks from insolvency in 2018. I don’t understand how both narratives can be true.", "score": -4, "replies": [{"body": "Tesla needed a cushion so they raised. dpet assumes that a bull market was guaranteed and therefore the raise was stupid. If you price in a recession into the forecast before the raise, then the raise was a good idea.", "score": 5, "replies": [{"body": "Well, you're assuming Tesla couldn't raise money whenever they wanted, even in a recession. I believe they could, but raised when they did given their value was cut by half in a few months and showing no signs of slowing, largely due to fear.", "score": 2, "replies": []}, {"body": "I’d describe raising capital at a price 2.5x greater than it could be as a substantial management error, to be honest.", "score": -2, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "No, it is. Any other company whose management did similar things would be roundly criticized for missing opportunities to raise capital more efficiently. Warren Buffett has often criticized himself for using stock in purchase which ended up being worth far more later. Why should this management not be criticized?", "score": -1, "replies": [{"body": "Have explained this to you 3 times, they did what they did to put fears to bed and this has helped the company almost triple its overall value since. It netted out much more positive, given the value appreciation since (+$50B) -- even if that came at the expense of an underpriced raise (-$2.5B). No shareholder is complaining about this.", "score": 4, "replies": [{"body": "Easy to criticize in hindsight but the extra cash cushion definitely made me feel a lot better. 5bn should have been enough to last through a moderate downturn", "score": 3, "replies": [{"body": "My criticism is that it appears relatively obvious that they could have got this at better prices", "score": 1, "replies": []}]}, {"body": "Why do you believe that the stock price increase is so based on their capital raise?", "score": 1, "replies": []}]}, {"body": "Instead of funding secured, Elon should’ve raised at 380 but I don’t really see your point. You can’t expect to time the market", "score": 1, "replies": [{"body": "If you’re the CEO of the company, yeah, you should be expected to have some market timing. Similar criticism exists for Tim Cook and how Apple has structured its stock purchases. And should.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Look at the data, remove the raise and Tesla still has more cash today than they did prior to the raise. They haven't touched the money. The raise was entirely a response to the insolvency fears by investors, which again, was destroying their share price. They took a bad deal on the raise so that we'd all never have to wonder if there's a bankruptcy risk. It all netted out positively, given where the company is valued today, which would not be the case had the insolvency fears not been put to bed.", "score": 4, "replies": [{"body": "Why would Elon state that in 2018 they were weeks away from bankruptcy then? \n\nAlso, where has this extra cash gone? It certainly hasn’t increased their equity - debt substantially. So much of Tesla’s current cash is due to sustained negative working capital, CapEx being less than depreciation, and their use of capital leases instead cash to finance things.", "score": -2, "replies": [{"body": "You know why. You know the full context of that quote and you are leaving it out because you're a troll.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "They should", "score": -4, "replies": [{"body": "Ser?  At least pretend not to be pushing the they can’t make money message.   They expect to be profitable every quarter going forward.", "score": 3, "replies": [{"body": "Still if they get good terms it can't hurt them to have extra cash.", "score": 1, "replies": [{"body": "This isn't actually true. Not if they can't use it efficiently.", "score": 1, "replies": [{"body": "They can start a giant hedge fund like Apple.", "score": 2, "replies": [{"body": "That would be a distraction.  Not sure jobs would have approved of that either but regardless Elon is more focused than Jobs anyway.", "score": 1, "replies": [{"body": "I meant it sarcastically. It is a distraction.", "score": 2, "replies": [{"body": "Oops,  I got wooshed 😬😏", "score": 1, "replies": []}]}]}]}]}, {"body": "Exactly", "score": -2, "replies": []}]}, {"body": "They’ll be profitable Q4 probably 250 ish million. I don’t expect them to be Q1, but it’s too early to call. Overall I expect 2019 to be about a 500M loss.", "score": 0, "replies": [{"body": "500M is chump! :)", "score": 1, "replies": []}, {"body": "Q4 is all about gross margin. Will it keep expanding, or will it pull back a little after last quarters massive gain?", "score": 1, "replies": [{"body": "Gross margin is falling. However S and X sale were up in Q4.", "score": 1, "replies": [{"body": "Read up Q3 ER bro, margin improvement it the number one reason we've seen this rally since fall.", "score": 1, "replies": []}]}]}]}]}, {"body": "If they can get Apples 1% loans then for sure they should raise $5B. But banks usually want to lend to companies who need it the leat.", "score": 1, "replies": []}]}]}, {"body": "R.I.P to all trying to time the market", "score": 2, "replies": []}, {"body": "haha Cramer is all about Tesla now lol what a clown :)", "score": 5, "replies": [{"body": "Is he talking tsla today?", "score": 1, "replies": [{"body": "Plenty..", "score": 1, "replies": []}]}]}, {"body": "This pullback is ridiculous.", "score": 7, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I was expecting a 5-6% pull back any day now. Too many people taking profit of this rise.", "score": 2, "replies": []}]}]}, {"body": "Solid recovery", "score": 3, "replies": [{"body": "early morning margin calls", "score": 4, "replies": [{"body": "Do those margin calls typically happen mostly pre market, early after open, before noon...  any idea?", "score": 2, "replies": [{"body": "I have no idea, but I saw the same pattern yesterday ( in this time )", "score": 4, "replies": [{"body": "That was probably Iran deescalation related.", "score": 3, "replies": [{"body": "Yeah, I figured there's no way to know how much of that was Iran.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "What's up with the big uptick that then quite fast goes down, that we have seen at market openings? Seems weird to me.", "score": 4, "replies": [{"body": "Pretty sure they were talking Tesla on CNBC about 15 minutes ago. Not sure if that's the reason", "score": 1, "replies": [{"body": "Pretty sure it’s not", "score": 4, "replies": []}]}]}, {"body": "Alphabet's Verily hires former Tesla CFO Deepak Ahuja\n\n&#x200B;\n\nI thought he was retiring..", "score": 4, "replies": [{"body": "Working at Google compared to Tesla probably is the equivalent of retiring.", "score": 20, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Still seems weird that he’d leave Tesla for “retirement” only to join another organization months later", "score": 2, "replies": [{"body": "Not sure why you're getting downvoted. It is a little weird. Dude left, came back, left again to retire \"for real this time\", and now joined Google.\n\nI'm not reading too much into this, but it is unusual.", "score": 5, "replies": [{"body": "I smell interference from a spouse.\n\n\"We have enough, I want you to retire to spend time with me.\"\n\n\\*retires\\*\n\n\\*gets really bored\\*\n\n\"I'm going back to work\"\n\n\\*time passes\\*\n\n\"I really want you to retire!  You didn't give it a real chance last time.  This time really try, please?  For me.\"\n\n\\*retires\\*\n\n\\*gets really bored again\\*\n\n\"Goddamn it.  I'm going back to work\"\n\n\\*old job is no longer available\\*\n\n&#x200B;\n\nEdit: I am about 75% sure something like this is going to happen to me.", "score": 4, "replies": [{"body": "> I am about 75% sure something like this is going to happen to me.\n\nMe too, probably. But goddamn am I ready to try.", "score": 3, "replies": []}]}, {"body": "thanks, i don't know why i'm getting down voted.. just wanted to create discussion.. but i find it really weird the optics of this announcement..", "score": 1, "replies": []}]}, {"body": "He's retired 2 times already, probably having nothing to do all day is too boring for him.", "score": 3, "replies": [{"body": "Which is why you’d think this one would stick.", "score": 2, "replies": [{"body": "Maybe but since he did it again I'd say he's about to do it a third time.", "score": 1, "replies": []}]}]}, {"body": "Maybe retirement didn't suit him.", "score": 3, "replies": [{"body": "The classic “spend more time with your family” only to realize you hate your family", "score": 6, "replies": []}]}]}]}, {"body": "Why retire when you can make a million dollars relaxing and selling corporate secrets. \n\nNot saying he's doing it but wouldn't be surprised if he was in a lot of waymo meetings.", "score": 7, "replies": []}, {"body": "He seems to be a workaholic. He retired from Tesla twice, after all. Glad to see him contributing to the medical field now, he's a great CFO.", "score": 2, "replies": []}, {"body": "Snakes in the grass....", "score": 1, "replies": []}]}, {"body": "\n*Tesla is going to have new head of its Advanced Battery Research in Canada*\n\nhttps://electrek.co/2020/01/09/tesla-jeff-dahn-new-head-advanced-battery-research-canada/", "score": 3, "replies": [{"body": "Is this a positive way of saying Dahn is quitting?", "score": 2, "replies": [{"body": "No.  tldr: Dahn is hiring someone who may someday succeed him.", "score": 3, "replies": []}]}]}, {"body": "AMD just broke another ATH. Grats to all who are holding!!!", "score": 2, "replies": [{"body": "I bought 30 shares at around 12 dollars because I had it sitting around, have always loved AMD as a brand, and heard some rumors new applications.  Forgot about it until about a month ago... really with i had had more play money back then.", "score": 3, "replies": [{"body": "Very nice!\n\nI started at $3 and averaged to around $6. It's going to be my first 10-bagger.", "score": 2, "replies": []}]}, {"body": "I’m new to trading and my first two stock purchases have been TESLA at $399 and AMD at $39. Excited!", "score": 1, "replies": [{"body": "Nice, and good luck! Keep an eye on AMD. I think we'll see $60 EOY. But if we start approaching $100 this year then expect a pullback. It's a great stock, but also a lot of hype right now. Need to wait for this ER and then a few more to see, quantitatively, how real all this is.", "score": 1, "replies": [{"body": "AMD is going to sell a shitload of chips this year", "score": 1, "replies": []}]}, {"body": "I was thinking AMD was going to dip down to $45 or so before going back up before earnings. Was I wrong or what...It's going to $65 come end of year.", "score": 1, "replies": []}]}]}, {"body": "Wow, volume at 11:30AM over 12 mm. Make or break day.", "score": 3, "replies": [{"body": "probably burning rsi", "score": 4, "replies": []}]}, {"body": "What is the chance that it drops even further?", "score": 3, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "I should go buy a crystal ball just to be able to say I \"Yes I do\" on comments like this.", "score": 9, "replies": [{"body": "My marbles all say, go for it. Do marbles count?", "score": 2, "replies": [{"body": "Well, maybe.  Just make sure you don't lose them.  I hear that's bad.", "score": 2, "replies": []}, {"body": "If you have tiny hands they do.", "score": 2, "replies": []}]}]}, {"body": "True that. The Saudis have them all.\n\nhttps://assets.realclear.com/images/41/414782.jpg", "score": 3, "replies": []}]}, {"body": "You cant go up 40% in a month without the odd pull back.", "score": 8, "replies": []}, {"body": "Don't short it. Its going higher than a giraffe's vagina soon", "score": 12, "replies": [{"body": "Sorry how many ducks nuts is that?", "score": 4, "replies": [{"body": "Depends of how stretched it is", "score": 2, "replies": []}]}, {"body": "I love this", "score": 3, "replies": []}]}]}, {"body": "anyone know when Q4 data is to be released? I think of buying before release some more.", "score": 1, "replies": [{"body": "You mean Q4 earnings? Should be Jan 29 after hours.", "score": 1, "replies": []}]}, {"body": "Both Xetra and premarket having some sips though..", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I think you mean lower price... and it'd be more lucky than wise.\n\nLiterally the only good move in investing is \"buy low, sell-high\"... the fact is though that for most people it's luck that drives that.", "score": 2, "replies": []}]}, {"body": "Oh wow, that thing pretty much touched my highest stoploss and only didn't trigger it because of the spread.\n\nNice", "score": 1, "replies": []}, {"body": "The stock was overbought - a natural correction is happening - hopefully it drops closer to 400$ or under so I can buy a whole lot more of it", "score": -5, "replies": [{"body": "Wow downvotes haha. Do people not realize that \"overbought\" is a technical term that's very accurate for Tesla right now? \n\nFor sure it could still be 'underbought' in terms of how much the stock should be worth but the RSI says overbought. But it's been saying overbought since $350\n\nAlso really should note that although no one here wants this, a drop back to $400 would definitely not be out of character for this stock. But the company is positioned for some seriously epic growth, and people are realizing that like never before.", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Nice", "score": 1, "replies": []}]}, {"body": "I'd happily have it drop to $400 if only so I could buy more before q4 earnings.", "score": 1, "replies": [{"body": "Earning should be good but depending how much it runs up beforehand it could drop even on good earnings. I'd prefer to see $700 though", "score": 1, "replies": [{"body": "Normally I'd agree that Tesla earnings are hard to predict. But given the record deliveries and the improving energy business. I would be stunned if it went down.", "score": 1, "replies": []}]}]}]}, {"body": "If you want bearish talk you're in the wrong sub.", "score": 2, "replies": []}]}, {"body": "I am kinda wishing it pulls back even more as people take profit before earnings", "score": -1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Maybe", "score": 4, "replies": [{"body": "Maybe not", "score": 10, "replies": [{"body": "Just depends", "score": 1, "replies": [{"body": "It’s possible", "score": 2, "replies": [{"body": "[Plausible](http://m.quickmeme.com/img/54/54851b2b7389a90c2e90f6e7c865f8b47f6a46c77020e39966a71601ad6e3a3c.jpg)", "score": 2, "replies": []}]}]}, {"body": "[https://giphy.com/gifs/reactiongifs-annoyed-person-12eNicYP5cDnwY](https://giphy.com/gifs/reactiongifs-annoyed-person-12eNicYP5cDnwY)", "score": 1, "replies": []}]}]}]}, {"body": "Did you guys see this.... huge if true!!!\n\n\nhttps://twitter.com/supermantibody/status/1215405207976398848?s=21", "score": -1, "replies": [{"body": "This is dumb. First of all wtf is \"Tesla Truck Team\"? Secondly even if it's real it just means they achieved quarterly GAAP profit. Also financials are closely guarded before earnings and low level employees wouldn't have access to it.", "score": 14, "replies": []}, {"body": "Twitter thinks its fake or even a teslaq ploy to overset expectations", "score": 5, "replies": [{"body": "If it is, the CharIn bit is a reallllly good subtle touch because this is true and not many people would think about it....", "score": 1, "replies": []}]}, {"body": "Fake", "score": 2, "replies": []}, {"body": "Of much greater interest is that this is suggesting a start to Semi production in H2 2020. Suppose they build ~1000, and have an ASP of $180,000, that would be an extra $180 million in revenue. Not bad at all!", "score": 1, "replies": [{"body": "This was already known.", "score": 4, "replies": [{"body": "Not for me! And for those who did already know, confirmation that timelines are being met is always handy.", "score": 1, "replies": [{"body": "haha fair enough!", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "That would make more sense.", "score": 2, "replies": []}]}]}]}, {"body": "I've never been invested in a stock which is going through a short squeeze before, for example if Tesla starts this at \\~500 what kind of price movement could we be looking at? or is that impossible to answer?... basically If this happens should I start looking for Lambo's or proceed with caution?", "score": -2, "replies": [{"body": "> should I start looking for Lambo's\n\nOnly if you wanna be left in the dust at the stop light by a Model S P100D.", "score": 11, "replies": []}, {"body": "Lambos? Really? No P100D?", "score": 7, "replies": [{"body": "Is the Tesla Roadster going to become the new Bitcoin Lambo? Oh dear, that’s the scariest thing I’ve heard about the stock in a while. 😂", "score": 2, "replies": []}, {"body": "I'd definitely buy something from Tesla, but to be honest it would be a house first and I don't actually have any interest in Lambo's just trying to gauge where this could go if such a thing happens.", "score": 1, "replies": []}]}, {"body": "I don't think anyone knows.  Maybe 2 to 3x from here?  or maybe only up to 750/share.  Hard to say...", "score": 2, "replies": []}, {"body": "It's not possible to know.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -14, "replies": [{"body": "You're not wrong but why's this relevant?", "score": 9, "replies": []}, {"body": "oof man - they're just people", "score": 1, "replies": []}, {"body": "I have to say, this is highly relevant to a Tesla Investors subreddit.", "score": 1, "replies": [{"body": "It's related to the macro", "score": -3, "replies": [{"body": "its bullshit", "score": 11, "replies": []}]}]}]}, {"body": "[deleted]", "score": -11, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "And on December 27th, 2 weeks ago", "score": 5, "replies": []}]}, {"body": "You obviously don't remember when Dumbface Mcdumberson said TSLA would miss deliveries.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": -16, "replies": [{"body": "No you’ll FOMO and buy back in like 520 with less shares.", "score": 16, "replies": []}, {"body": "Wow... so we have you to thank for it rocketing back up?  :)", "score": 15, "replies": []}, {"body": "o_O", "score": 5, "replies": []}, {"body": "I would be happy if 400 happens again.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Just buy more... #cost-average", "score": 1, "replies": []}]}]}
{"title": "BOEING once, BOEING twice.. SOLD", "selftext": "", "id": "em4ynd", "created_utc": 1578546166.0, "score": 4392, "upvote_ratio": 0.98, "num_comments": 161, "comments": [{"body": "Put some of that Flex Tape on my holdings, I'm going all in on JCP making a comeback in 2020!!", "score": 358, "replies": [{"body": "You might be just joking, but seeing your comment after all the weeks I've been thinking about JCP is the push I needed.", "score": 56, "replies": []}, {"body": "Nice name Mr.Dildobagginz", "score": 117, "replies": [{"body": "weak", "score": 71, "replies": [{"body": "Your account has been active for 5 years and you've left one comment, this comment.  You sir, are a legend.", "score": 59, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "As long as it’s consensual, amiright?", "score": 3, "replies": []}]}]}, {"body": "Weak", "score": 25, "replies": []}]}]}, {"body": "I mean, that's idiotic, but those calls are cheap af. I'll throw some pennies at it.", "score": 41, "replies": [{"body": "If they were to recruit someone that enabled them to have a semblance of online presence.. They were the pioneers in mail order goods, THE FUCKING PIONEERS - this is no exaggeration.  Their mail order catalog was revolutionary in the goods it allowed Americans to buy.  The fact that they did not transition to the net is a fucking travesty and those execs responsible should be burned at the fucking stake.", "score": 44, "replies": [{"body": "That goes double for Sears. They used to be able to mail you a fuckin house.", "score": 58, "replies": [{"body": "I know it!  When I am getting bored and stupid late night I look at the houses you can order on Amazon and a few other sites.  Where I live land is VERY CHEAP.  While I am moving in 2 years I've thought of building something to rent out when I leave.  I'm into a lot so I probably won't do this.", "score": 9, "replies": [{"body": "lol got a link to those amazon houses?", "score": 5, "replies": [{"body": "There are many different types and many different companies that do this---- https://www.amazon.com/Allwood-Avalon-Cabin-Triple-Windows/dp/B07BYV3T9X/ref=sr_1_4?crid=2G0EWGEKUO1TS&keywords=allwood+kit+cabin&qid=1578617675&sprefix=allwood+%2Caps%2C193&sr=8-4", "score": 2, "replies": [{"body": "The door to the bathroom is outside....", "score": 2, "replies": [{"body": "**There are many different types**", "score": 3, "replies": []}]}]}]}]}, {"body": "But where do they mail it? To your...house?", "score": 4, "replies": [{"body": "It's a real catch 22", "score": 2, "replies": []}]}]}, {"body": "and AOL was the king of online", "score": 18, "replies": [{"body": "You're about to get ToS'sed. Hang on, let me load up AOHell....", "score": 10, "replies": []}, {"body": "Asl?", "score": 11, "replies": [{"body": "15/F/Behind you", "score": 16, "replies": [{"body": "#NANI?!", "score": 8, "replies": []}]}, {"body": "18/f/Cali", "score": 3, "replies": []}]}, {"body": "And Prodigy was before that.", "score": 2, "replies": []}, {"body": "Before GOOG there was Yahoo!\nBefore the Facebook there was MySpace", "score": 2, "replies": [{"body": "Before your mom there was me.", "score": 0, "replies": []}]}]}, {"body": "You have to imagine they just like didn’t believe in the internet catching on or something right? (Which is hard to type with a straight face)\n\nHow else can they explain not transitioning to it?  It practically comes across as a breach of their fiduciary duty looking back on it lol", "score": 5, "replies": []}, {"body": "FUCKING PIONEERS that died of dysentery.", "score": 3, "replies": []}]}, {"body": "Post ur buy", "score": 8, "replies": [{"body": "It used to be an unwritten rule that you only post your positions if:    \n 1. Loss porn worse than 50%.       \n 2. Gain porn greater than 100%.     \n 3. It's part of some DD.     \n 4. Someone calls your bullshit.     \n 5. You're really fucking stupid.     \n      \nI supposed this would count as 4 or 5. So, sure, if I'm dumb enough to actually but any later, I'll let you know. Rn I'm looking for any reason to believe they'll have any comeback. After 30 minutes, I've got nothing other than more proof they'll be another Sears.", "score": 18, "replies": [{"body": "Right on", "score": 2, "replies": [{"body": "Nah. I bailed. I've made some idiotic trades in my day, but after looking at JCP, I don't even think I can be dumb enough to buy calls. Lol. Cheers.", "score": 0, "replies": []}]}]}]}]}, {"body": "Military Contracting price for that tape $23,595 per application.", "score": 18, "replies": []}, {"body": "I own JCP bonds. 17% yield. Mature in June", "score": 12, "replies": [{"body": "where did you get the opportunity to buy corporate bonds, I am trying to get my hands on some but bond ETFs is the best i can find at the moment.", "score": 3, "replies": [{"body": "You look up the bond by company and select bonds. \n\n:) every broker has them except RobinHood.", "score": 2, "replies": [{"body": "Minimum purchase?", "score": 2, "replies": [{"body": "They are usually in increments of $1000", "score": 3, "replies": [{"body": "What was the YTM where you bought it and when did you buy it?", "score": 2, "replies": [{"body": "16.81% YTM on Nov 19th 2019\n\nThey still trade at a 16.8% ask and an 18% bid. \n\nYou might still be able to get a 17% YTM fill. They trade at a 95 handle. Meaning there’s still a 5% return to be made on just the price alone! Scoop them up at a great discount.", "score": 3, "replies": [{"body": "Got a CUSIP I can look up? Can't find it on merrril lynch under retail category.", "score": 3, "replies": []}, {"body": "Made my first corporate bond purchase!  Hoping for no BK until at least after June!  If I'm reading it right, got in at $95.82.  Not great, it looks like.  But I think it's decent.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "16% annual but 8% up to June only, right?", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Hope they make it 'til then!", "score": 2, "replies": [{"body": "I am very certain they will make it through 2020. Especially after expressing they can easily do so and a quick look at their financials. I should have purchased the 2097 bonds.", "score": 3, "replies": []}]}]}, {"body": "I think it’s personal with jcp. They need to go the Ross way and leave the malls and just do lone stores", "score": 5, "replies": []}, {"body": "Ha! Dildobaggins is what we used to call our school principal back in the day.", "score": 5, "replies": [{"body": "Would this happen to be in HS in NJ arnd 2004, cause this was one of the iterations of his name haha", "score": 4, "replies": [{"body": "No, but im happy to hear we are not alone!", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}]}]}, {"body": "if you’re interested in retail, nordstrom seems a half decent bet", "score": 3, "replies": []}, {"body": "Why the hell not! If you can’t beat them, best to join them!", "score": 3, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "That... is actually brilliant...  Too bad they don't have a similar model of Whole Foods with great centralized locations, etc.  The JCPs around Omaha (before they all died) were usually around the outskirts malls, they killed the higher end mall locations.  But you're absolutely on to something, that Amazon should start buying out preexisting brick and mortar chains nationwide that are still open (i.e., buildings still in operation w utilities, staff still in place, etc.)... You're absolutely right!", "score": 1, "replies": []}]}, {"body": "Flex SEAL, asshole.", "score": -19, "replies": [{"body": "Flex TAPE is literally in the fucking picture, illiterate asshole.", "score": 28, "replies": [{"body": "Sheesh! Why so angry? Small dick?", "score": -2, "replies": []}, {"body": "Oh wait, you don't have any FLAIR, asshole, so you're a fuckin NOBODY. Next time speak when spoken to, PEASANT.", "score": -2, "replies": []}]}]}]}, {"body": "It’s the new bailout tactic that doesn’t piss off taxpayers", "score": 195, "replies": [{"body": "And only raises eyebrows at the WTO", "score": 47, "replies": [{"body": "Very legal, and very cool... unlike those Europeans and Canadians", "score": 9, "replies": []}]}]}, {"body": "one day boeing will bring out a software patch **that really fixes** real world physics and you guys will stop laughing", "score": 103, "replies": [{"body": "If we stop laughing, *how else* are we gonna mask the pain in going bankrupt???", "score": 16, "replies": [{"body": "Tell them to patch gravity upside down.", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 107, "replies": [{"body": "God tier title", "score": 19, "replies": []}, {"body": "God tier title", "score": 12, "replies": []}, {"body": "God tier title", "score": 9, "replies": []}, {"body": "God tier title", "score": 9, "replies": [{"body": "God tier title", "score": 7, "replies": [{"body": "God tier title", "score": 3, "replies": []}]}, {"body": "God tier title", "score": -8, "replies": []}]}, {"body": "God tier title", "score": 3, "replies": []}, {"body": "God tier title", "score": 4, "replies": []}, {"body": "God tier title", "score": 1, "replies": []}, {"body": "God tier title", "score": 0, "replies": []}, {"body": "shit...I only just got it", "score": 0, "replies": []}]}, {"body": "You don’t know the half of it, friend. I’m a federal contractor and see this shit first hand.", "score": 65, "replies": [{"body": "Boeing calls?", "score": 28, "replies": [{"body": "You can’t go wrong.  They have offices in the pentagon along with Lockheed and Raytheon.", "score": 70, "replies": [{"body": "Don't forget about Northrop and L3 Harris", "score": 42, "replies": [{"body": "Yep them too. Got half a ring.", "score": 21, "replies": [{"body": "Working in the defense sector is so awesome. Job security for days thanks to TS clearance. Decent pay. America will never stop funding the war machine. Even though most of it’s completely unnecessary shit. So much overkill.", "score": 21, "replies": [{"body": "Biggest welfare program of all, for corporations and citizens alike.", "score": 3, "replies": []}]}]}]}, {"body": "what?\n\nfor real?", "score": 1, "replies": []}]}]}]}, {"body": "Using that patented your-tax-dollars technology.", "score": 16, "replies": []}, {"body": "Should be:\n\nIran Government,\n shooting down airplanes,\n “technical error”", "score": 59, "replies": [{"body": "Boeing should make the missiles, as well as the planes. Its a win/win", "score": 2, "replies": []}, {"body": "Thanks for this information mister reddit expert", "score": 8, "replies": [{"body": "He's basically telling you that STONKS ALWAYS GO UP", "score": 13, "replies": []}]}, {"body": "Nope false flag you russian bot you\n\n/s apparently not obvious", "score": -7, "replies": [{"body": "Don’t think it’s the Russians that would be doing that one mate", "score": 3, "replies": []}, {"body": "Calm down dude, it’s just a joke I wrote blackout drunk", "score": 2, "replies": [{"body": "I was joking too but who's counting", "score": 1, "replies": []}]}]}]}, {"body": "All 737 Max plans purchased as troop carriers..", "score": 28, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I thought the osprey failures were about maintenance and pilot error...kind like the Starfighter (deadly but in a predictable way).\n\nThe max is deadly in a random number generator way.", "score": 1, "replies": []}]}]}, {"body": "thank you US gov <3", "score": 13, "replies": []}, {"body": "When he slapped that bad boi. And it went up \n\nI felt that", "score": 30, "replies": []}, {"body": "A third of Boeing's revenue is from the US Military. Insane.", "score": 10, "replies": []}, {"body": "Hey I pay taxes. Might as well get some of that money back.", "score": 10, "replies": []}, {"body": "Who doesn't want 2*10^18 new stealth fighters?", "score": 8, "replies": []}, {"body": "The FARA downselect is in march, guess we'll see if Boeing wins a slot", "score": 6, "replies": []}, {"body": "With boring having two different plane modes having issues aparently, is anyone else looking at their company trade value and making moves ?", "score": 5, "replies": [{"body": "What two plane models?  Sure the 737 MAX has legitimate issues, but the fact a normal 737 can’t surviving a Iranian surface to air missile is not a bug, it’s a feature.", "score": 4, "replies": []}]}, {"body": "Used to work for a DoD contractor. Boeing routinely overcharges, underdelivers, and gets away with a crazy amount of shit that a smaller company would be crucified for. Yet they still have incumbency on some of the largest contracts in history (i.e. the $1T death trap F-35)\n\nEdit: buy Boeing, they have plot armor", "score": 33, "replies": [{"body": "That is because they have the infrastructure to handle large contracts.  I mean, most of the large defense companies overcharge and underdeliver but that is what you do when almost every contract is a cost-plus contract.\n\nIf any of you don't know, cost-plus is a money making machine where you literally can't not make money.", "score": 40, "replies": []}, {"body": "Not sure if you are mixing Boeing with Lockheed Martin. F-35 is LM's Prime Contract, and Boeing isn't even a Major Sub. Boeing and Lockheed are Integrators, they don't make jack shit. They just subcontract all the work out and charge a passthrough fee to the government.", "score": 38, "replies": [{"body": "Can confirm. I am a PM for a Defense company and I am on Reddit while I am working right now. Pass through fees, but Dod now has limits on that.....at 70% lol.", "score": 15, "replies": []}, {"body": "Damn you’re right, I was thinking if the X-32. And exactly, but you’d routinely see cost modifications on gov contracts itemized as “accounting error” where Boeing would be paying back the DoD or a sub-agency hundreds of thousands if not millions of dollars; make of that what you will. The real benefit is that they can do everything at scale in a way where they only compete with LM, L3, etc.", "score": 4, "replies": []}, {"body": "Don’t make jack shit - not true.", "score": -3, "replies": []}]}]}, {"body": "Y'all should read up on how the KC-46 contract was awarded to Boeing", "score": 4, "replies": [{"body": "Can you give a tldr? Curious about this...", "score": 1, "replies": [{"body": "Originally Airbus won the next gen tanker contract, but Boeing bitched, and they changed the requirements that magically allowed Boeing to win. It was also delayed years before when they found someone in the decision chain who was actively trying to make Boeing win, so they fired them and started over from scratch", "score": 2, "replies": []}]}]}, {"body": "You could also use the Cybertruck event where they break the glass with the metal ball for this.", "score": 13, "replies": [{"body": "I think you mean as the opposite of this...\n\nStill, could be a big 🅿️🅿️ meme format.", "score": 11, "replies": []}]}, {"body": "yeah..but Spaceforce!!!", "score": 2, "replies": []}, {"body": "The best part about memes and the media is that the suppliers to Boeing, Lockheed, etc, also have Military contracts (since they span the supply chain) and they're never in the news or memes", "score": 2, "replies": []}, {"body": "Just out on Twitter that that shit was shot down officially by Iranian anti-aircraft missiles\n\n\nLong Boeing", "score": 2, "replies": []}, {"body": "lol NOC cries poverty the most. LMT and BA actually know what they're doing", "score": 3, "replies": [{"body": "If by know what they're doing you mean are optimized to remove money from the gov, I agree. If you mean technical competence, lol.", "score": 1, "replies": []}]}, {"body": "If it's Boeing, I ain't going..", "score": 4, "replies": [{"body": "Glad to be knowing you ain’t showing..", "score": 4, "replies": []}]}, {"body": "Muh jobs. Muh STEM programs.", "score": 2, "replies": []}, {"body": "The military contracts are literally like 80% of the companies business. Boeing will be just fine", "score": 2, "replies": []}, {"body": "im holding boys", "score": 1, "replies": []}, {"body": "Boeing's planes crashing is the literal metaphor we autists needed to understand $BA crashing", "score": 1, "replies": []}, {"body": "MERICA BITCH !!", "score": 1, "replies": []}, {"body": "How else do you launder tax dollars into your friends pockets?", "score": 1, "replies": []}, {"body": "Corrupt board is working directly with Team Trump to boost stock and cover up their crimes.", "score": 1, "replies": []}, {"body": "BA won a multi-billion dollar contract in 2019 for unmanned planes on air craft carriers.. barely a blip on the radar when the news came.\n\nTheir 737 Max is a clusterfuck, but people seem to forget they make a ton of stuff for the military.  PR is a helluva drug - just like JNJ and the \"asbestos scare\".. when it turns out the lab that tested for asbestos was FUCKING CONTAMINATED by asbestos", "score": 1, "replies": []}, {"body": "So true. I need to join bullgang this year but not until 1/29 earnings report.", "score": 1, "replies": []}, {"body": "Boeing looking weird when written in all caps", "score": 1, "replies": []}, {"body": "BA short int is $1.82bn; 5.49 mm shs shorted, 0.98% of float. Shs shorted only up +313k shs, +6% since Jan 1, 2019. Shs shorted down -631k,-10%, over last 30 days as its price fell -13% and down -314k -5.4%, over the last 7 days\n\n\nhttps://mobile.twitter.com/ihors3/status/1215367038400716801?s=21", "score": 1, "replies": []}, {"body": "I'm going to make so much money selling puts.", "score": 1, "replies": []}, {"body": "Yeah, this gave me a 2k loss on a put yesterday", "score": 1, "replies": []}, {"body": "How Boeing is still above 300 is insane. That company fucked up big time in 2019, and started 2020 with the same M.O. Fuck this company.", "score": -7, "replies": [{"body": "Yeah because they don't have more products than 737 MAX", "score": 29, "replies": []}, {"body": "Boeing is still a 400+ company assuming they are able to resolve the plane issue, which they definitely will. But i guess retards like you cant see past the bad news and react to them like flies to light", "score": 25, "replies": [{"body": "I bought the dip right after the crash (the earlier one, not the recent one), but later on sold again because I still see a small risk they won't be able to software-fix this. It's completely intransparent on which issues they are working right now. If they would have to actually rework the planes it would fuck them up very big time. But yeah, most probably they will software-fix it and the stonk will go up. But i won't bet on that this time.", "score": 3, "replies": []}, {"body": "This statement is fucking hilarious.. *assuming they are able to resolve the plain issue* while describing a fucking company whose business it is to build fucking planes.  The lunacy of this market kills me sometimes.", "score": 3, "replies": [{"body": "I mean, they need to fix a small issue in a VERY VERY VERY successful aircraft with 5000 orders on the books.  It has been almost a year and it is politics that keep this thing grounded.  I be the test engineers that were tasked with recertification are already on to different programs.\n\nBefore you get on your soap box, yes it is a small issue.  Small issues crash planes.  It was a new system and they just didnt' do enough regression testing apparantly.", "score": 6, "replies": [{"body": "This guy is actually correct. Boeing will resolve the issue and this will move on. Look at the 727", "score": 3, "replies": [{"body": "What was wrong with the 727?", "score": 1, "replies": [{"body": "https://www.reuters.com/article/us-ethiopia-airplane-history-idUSKCN1R62HB", "score": 2, "replies": [{"body": "\"The plane eventually became one of Boeing’s best sellers and was in widespread use for another 30 years.\"\n\nLong BA!\n\nWell atleast if you put $10k into Boeing immediately after that last crash in 1965 it would only be worth $7.8M compared to $350k in the S&P", "score": 3, "replies": []}]}]}]}, {"body": "No soap box.. it was simply funnily worded and I had to repeat it.. plane company needing to fix a plane issue.", "score": 1, "replies": []}, {"body": "We will see.  My prediction is they apply another software fix and another plane crashes.  Using software to compensate for a aerodynamic design flaw is not a recipe for success.", "score": 0, "replies": [{"body": "I am an engineer and I work in the same field (aviation certification).  At this point, the issue has so much visibility that the low level managers and engineers working on the issue actually have control.  They can stop the cert and change the design without too much pushback from the muckity mucks if they call it a safety issue even if it takes more time.  \n\nThis is the way safety concerns should always be addressed but if we did that we would have safe and incomplete airplanes and bankrupt companies.", "score": 2, "replies": [{"body": "I am literally god and created the earth and heavens and I say another plane crashes due to software bandaids.", "score": 1, "replies": [{"body": "So God lives in Huntsville with me?!?  Which government money funneling company does he work for?", "score": 1, "replies": [{"body": "All of them, and yet none of them.\n\n*waves hands awkwardly*", "score": 1, "replies": [{"body": "I think I see you.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "One word, duopoly....", "score": 5, "replies": []}]}, {"body": "Boeing never should have merged and moved HQ to Chicago...", "score": 0, "replies": []}, {"body": "Project management 101\n\nIran threat not only distracted from impeachment, but now Trumps haphazard war is the tug boat trying to pull Boeing and GE from its shit covered positions. Aviation sales are projected at 2020 for like what 1%?\n\nDeployed soldiers will likely return mid election after the massive fucking amounts of paperwork and soccer balls they’ve kicked with poor, unvaccinated kids is met. Gotta make sure we can get Kid Rock over there too. . bravo Trump advisors please come fix my life next yeehawww", "score": -1, "replies": []}, {"body": "yes please anything to make these bags lighter. Should've sold when it was at 400+ god damnit", "score": -1, "replies": []}]}
{"title": "The $65k I previously made from selling naked options on TSLA may or may not be all gone and more now.", "selftext": "Hey everyone, I appreciate the welfare checks after TSLA went up today. I had previously only posted about TSLA plays a few times, so it's flattering that you guys associate and know me for TSLA plays. I wasn't going to post this since I'm really embarrassed and ashamed that I let things get out of control. I feel like I let myself and everyone down.\n\nYes, I got screwed very hard. As I have been the past several weeks or so as it has been continuing up. I previously made over $65k at the peak of selling options (both puts and calls) on TSLA in 2019 in just eight or nine months, but that may or may not be gone now with TSLA's surge to the upside.\n\nI fucked up pretty badly and did not manage the trades like I should have. As with a lot of people here, I'm shocked and in disbelief that it hit $498.49. It'll probably break over $500 this week to reach another milestone.\n\nA couple months ago I did talk shit about how TSLA would not get above $400 or even $420 anytime soon. Boy was I dead wrong. You guys are more than welcome to talk shit to me now if you like. I'm happy that a lot of you were able to make massive gains. It did have to come at the expense of people on the other side of the trade.\n\nYou might be wondering if I still have short calls on TSLA. The answer is yes, and I'm not quite sure why. Stubbornness, inability to take a loss at the high even though it keeps making new highs, etc. Basically the opposite of bagholding a long position. Nobody wants to sell for a loss at the bottom similar to not wanting to sell for a loss at the top.\n\nEven the \"no way it will reach this point\" call strikes that I have sold ended up becoming deep in the money. If you'd like to capitalize on this information, some of the \"no way it will reach this point\" strikes that I have are in the $500s.\n\nThe really annoying part is having to pay taxes on gains that may or may not have all been lost and more in the first five trading days of 2020. Even though I did say to myself that I wouldn't sell naked calls as a new year's resolution, I ended up doing so anyways and I paid the consequences.\n\nIf others are in a similar boat after selling calls, I hope you're doing okay and that you didn't put yourself in a really bad situation. Taking a loss is tough. By the time we do, it gets way out of control and ends up being an even bigger one.\n\nDon't worry about me, I'll be fine and will continue trading. My trading confidence took a huge hit and the entire experience has been humbling. This was not how I was hoping 2020 would start. I guess you could let this post/update be a cautionary tale to manage risk better and not take on positions with potentially unlimited risk. More pain will probably come as I still have short calls that I have yet to close.\n\nI do still plan on messing with TSLA once the dust settles from the current positions. Best of luck to everyone out there. Might not post/comment as often since I want to focus on trading and getting on the right track first. Will still answer PMs and mod when I can though. Thank you again for everyone's concerns.", "id": "em6pwa", "created_utc": 1578557237.0, "score": 1008, "upvote_ratio": 0.98, "num_comments": 251, "comments": [{"body": "stonks go up you already know this", "score": 805, "replies": [{"body": "If the naked calls are still open the losses could be much higher than the $65k gains in 2019 - naked option losses are open ended and leveraged...\n\n$500-ish strikes were going for around a dollar just a few weeks ago. To make $65k-ish gains per year from writing such options I fear he has dozens of calls open, maybe more. That's thousands of shares worth of short position exposure, with tens of thousands of dollars of losses for every $10 rise once the stock gets closer to the strike.\n\nThis guy lost millions of dollars and bankrupted himself writing naked TSLA options from $250 to $350:\n\nhttps://www.reddit.com/r/teslainvestorsclub/comments/egps4i/investor_loses_millions_of_dollars_shorting_naked/\n\nI hope the best for /u/stormwillpass, he seems like a decent dude pushing no TSLAQ disinformation, but friends don't let friends write naked TSLA calls: limited upside, unlimited downside, ***worse*** than a straight short due to the exponential nature of options pricing.\n\nAll this on a once in a generation stock that has 100,000 new, happy, affluent owners every quarter who just bought a $50,000+ car and may end up buying TSLA stock after a few days of ownership. This process alone removes millions of TSLA shares from circulation every quarter... This is what happened with AAPL as well: a \"cult stock\", until it wasn't and hit $1T valuation.\n\n\"Picking up nickels in front of a steamroller\" is not giving it justice, it's more like \"picking up nickels from under a launching Falcon Heavy\".\n\n(But options are risky in both directions, and /u/stormwillpass might still end up earning money, so not advice.)", "score": 143, "replies": [{"body": "I was curious how he was doing since he said he weathered previous big drops and rises fine before.  I guess a stock more than doubling in less than 6 months can fuck up anyone's strategy though\n\nIt's stuff like this that despite my stupid mistakes so far that I only play with covered puts/calls", "score": 20, "replies": []}, {"body": "he can get infinity losses if he's not careful", "score": 8, "replies": []}]}, {"body": "Too soon", "score": 2, "replies": []}]}, {"body": "You truly deserve that mod status", "score": 294, "replies": [{"body": "you dont pay taxes on the gains if you turned around and lost it all  (assuming both sides are short term)", "score": -2, "replies": [{"body": "*only if realized in the same calendar year", "score": 18, "replies": []}, {"body": "He had gains in calendar year 2019 and didn't realize the losses until calendar year 2020. So he's fucked on his 2019 taxes.", "score": 9, "replies": []}]}]}, {"body": "Hey fam. \n\n*unzips pants*\n\nIf you need a meme on this one. Let me know. I'll make a gif.", "score": 144, "replies": [{"body": "Yeah we really need a meme for this one. Otherwise it'll be long forgotten with all the other smaller retarded plays people have made.", "score": 29, "replies": [{"body": "Memes are modern hieroglyph carvings on the pyramids. Stories in pictures that will stand the test of time. Words fade away and memories are forgotten but memes are forever.", "score": 24, "replies": [{"body": " \"Song of the Storm\" - A threnody for the Theta Gang fallen\n\nAs dawn begins the rising storm cloud waits  \nfor those who dare to pass beneath his spell.  \nA force that none who lived can yet explain  \nwill call to them like whispers straight from hell...\n\nThe shadow of the cloud insipid seems  \nso unsuspecting fools take refuge here.  \nThey focus on the tendies that the rain  \nwill surely bring to them, the gains, so near!\n\nFor many years this cycle had gone on.  \nThose put beneath the cloud would sacrifice.  \nThey'd burn their paper, gold, and electrons  \nScreaming to the storm, \"IV crush, why?!\"\n\nThe long night is engulfed within his shroud  \nAnd Theta Gang rejoices in the dusk.  \nBut no -- a blinding light has split our cloud!  \nBut who?! Of course... a Naked Elon Musk.\n\nA Theta Warrior's will cannot be broken.  \nFor many are called, but few are chosen.", "score": 8, "replies": [{"body": "God bless", "score": 3, "replies": []}]}]}]}, {"body": "How else will future generations remember this historic event?", "score": 6, "replies": []}, {"body": "Make a meme with the good times theme. The line \"easy credit rip offs\" fits this well. LOL\n\n&#x200B;\n\n [https://www.youtube.com/watch?v=R8YYTBnFkY8](https://www.youtube.com/watch?v=R8YYTBnFkY8)", "score": 2, "replies": []}, {"body": "Did someone say memeloaf????", "score": 2, "replies": []}]}, {"body": "Mini update:\n\n- Of course TSLA happens to drop two days in a row after I hit my pain threshold and closed out on numerous naked calls for a loss on Wednesday.\n\n- The $475-490 strike calls would have been profitable and became a gain, so I lost money for nothing.\n\n- I sold lots of puts on Wednesday to help \"hedge,\" but those puts are in the red because TSLA fell two days in a row.\n\n- I would have been better off doing nothing, but I had to close due to negative buying power. Probably could have tanked a couple days, but didn't want to risk due to \"managing risk.\"\n\n- You've got to be fucking kidding me.\n\n___\n\nEDIT/update Jan 19, 2020:\n\nOkay so last week it mooned even harder and hit a 52 week high of $547.41. I was shitting myself because I still had too much short exposure. I closed some of the naked calls and opened up even more naked puts. You can already guess what happened. TSLA tanked to $490s briefly and closed the week around $510. The naked calls I closed would've been profitable, or at least a lesser loss. And the naked puts ended up being a bad idea and I lost 3x the credit received (sold $520 strike and others below it).\n\nThis is a snippet of how bad it got on one of the days last week: https://i.imgur.com/rGtQn64.png\n\nGoing into this upcoming week, I basically need TSLA to stop tanking since the naked puts are at the money (ironic because tanking was all I wanted them to do the past several weeks when the call side was getting crushed).", "score": 1, "replies": [{"body": "Christ you're autistic", "score": 5, "replies": [{"body": "He's a WSB Mod. Duh.", "score": 4, "replies": []}]}, {"body": "Feel better about closing them now?", "score": 2, "replies": []}, {"body": "Oof, just reading this now.\n\nI’m really sorry that you’ve taken this hit. \n\nI’m sure you’re aware that the whole flow of this loss is textbook, from the not wanting to to take a peak loss, to the capitulation and reactive reversal at an inopportune moment. \n\nI suspect that most of us who’ve managed to find consistent success in trading, have been through losses like this. Personally, the handful of gut-punch losses I’ve taken, have each preceded major growth in my trading ability. \n\nYou’re clearly an accomplished enough trader that you don’t need this advice, but I just want to reaffirm that your confidence will return with time, and with disciplined plays, that protect your emotional capital.\n\nGood luck out there, and thanks for the work you do keeping WSB running.", "score": 2, "replies": [{"body": "Dude holy shit i love the phrase \"emotional capital\" it makes so much sense, lately ive been playing calendar spreads and i love the defined risk and the fact that if the stock drops atleast i receive some credit. That puts me in a good headspace even though if I had just bought calls I would be much higher now I would be way more stressed about every tiny drop. \n\nI am essentially buying Leaps and selling calls every 2 days against it till the strike is reached.", "score": 1, "replies": []}]}, {"body": "Thought about you this morning. I had some put credit spreads at 475 that expired today. Flirted with it but I was rooting for you to recover. Damn. Sorry bro. Hopefully what you sold is low enough? Or already severely burned on those?", "score": 1, "replies": []}, {"body": "Buddy I respect you as a mod the most... And as a Marty MU observation lurker all in leveraged options to the tits since 2016 ( just to see my profits vaporized in a crash, with big dick losses ever since)... I humbly tip my hat and understand.\n\n Also as a gay autist who couldn't let go and went short from UnJuStIFIEd $48 to $58 run... don't fucking fight the trend..", "score": 1, "replies": []}]}, {"body": "Thank you for sharing. I just started with options this year and maybe i should just cancel that robinhood gold", "score": 56, "replies": [{"body": "Scared money don't make money. No offense to swp but he made phenomenally stupid plays, I'm sure he knows that, the lesson here is don't fucking sell fucking naked fucking calls unless you want a fucking.\n\nDon't let this scare you away from options, unless you are going to stay scared instead of getting educated, then let it scare you far, far away into a cushy job where you can spend your entire miserable existence working for peanuts and maybe retire to a job as a door greeter at Walmart when you are 97. \n\nGood luck.", "score": 77, "replies": [{"body": "Ya over half my portfolio is calls and credit spreads and ive only done this a few days", "score": 44, "replies": [{"body": "Dude you were made for this sub.", "score": 58, "replies": [{"body": "Thanks", "score": 17, "replies": [{"body": "Did you not read the post?! That's a bad thing!", "score": 4, "replies": [{"body": "People in here look away when there's actual rules and logical shit", "score": 1, "replies": []}]}]}]}, {"body": "wow thats fucking grade a stupid", "score": 9, "replies": [{"body": "Well i got lucky so its mostly house money on the table", "score": 9, "replies": [{"body": "ez money ez life", "score": 6, "replies": [{"body": "Can't go tits up that's why I'm rolling a months pay", "score": 7, "replies": [{"body": "position or GTFO", "score": 6, "replies": [{"body": "Account is 9k\n\nMax loss over 6k\n\nThe trend is my friend", "score": 6, "replies": []}, {"body": "https://ibb.co/jkjWp8H\n\nSorry bot", "score": 3, "replies": []}, {"body": "My 1 year chart for comedy purposes only\n\nhttps://ibb.co/4Rxh86c", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Don't trade options unless it's a stock you don't mind holding IMO.  You can be right but still get fucked by one week's (or even day's) timing.\n\nIf get rich schemes worked, everyone would be rich.", "score": 16, "replies": [{"body": "I think you mean don’t sell options unless it’s a stock you don’t mind holding", "score": 1, "replies": [{"body": "You don't hold a stock if you are writing naked calls... Naked puts yes you will have to buy it. Naked calls you will have to buy it at mkt, then sell it at the strike price and swallow the difference.", "score": 2, "replies": [{"body": "I know. They said don’t trade options unless you don’t mind holding the stock. That mostly only applies to option sellers though.", "score": 1, "replies": []}]}]}]}, {"body": "Paper trade. For longer than you want to.  You'll blink twice and end up in a 8 foot hole.  That or set a strict loss limit before you step back and play on paper.", "score": 4, "replies": []}]}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 354, "replies": [{"body": "Fucking bots are trolling now.  This place is seriously peak-Internet.", "score": 127, "replies": [{"body": "> Fucking bots are trolling now.\n\nHave you met the Bobby-B-Bot, that shit is sentient af.", "score": 8, "replies": []}]}, {"body": "Shut the f*rick up!!!", "score": -1, "replies": []}]}, {"body": "Theta gang... works until it doesn't.", "score": 49, "replies": [{"body": "Eh. I stick to puts and stay away from calls.\n\nI sell a puts on higher price stocks for the covered cash amount of my account and naked puts in 2-3 other stocks that have a much lower share prices. \n\nWorst case scenario for me is all 3-4 stocks go ITM and I have to use a mixture of margin while having to sell off some VOO shares I've been collecting for the last six years.\n\nFrom there just start selling covered calls or liquidate the shares. Hasn't happened yet but I am ready for the day it does.", "score": 24, "replies": [{"body": "public correct smile complete elastic puzzled hateful cough quack lush", "score": 4, "replies": []}, {"body": "[deleted]", "score": -7, "replies": [{"body": "I'm selling uncovered puts that will technically be covered by my margin and other equity I have from my shares in VOO. If everything I'm selling goes ITM I will take the shares and sell covered calls as I stated before.", "score": 14, "replies": [{"body": "Basically the wheel method?  That's what I've been doing too, too bad I walked into a stock that's potentially going bankrupt", "score": 11, "replies": [{"body": "The wheel is selling cash covered puts my puts are only cash secured because of my margin and shares.", "score": 5, "replies": [{"body": "Same deal though. Strategy is the same, you’ve just added leverage.", "score": 1, "replies": [{"body": "No one is a strategy set on doing this. Mine tries to avoid it unless my hand is forced. \n\nAlso as part of the wheel you sell more puts while selling covered calls when you get assigned.", "score": 2, "replies": [{"body": "Gotcha, yeah, I approach it the way (I think) you do: Wheel strategy isn’t a goal, but a possible outcome if the trade moves against me.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "How the fuck are we supposed to make fun of you? No one expected this... not even the perma bulls", "score": 112, "replies": [{"body": "Stocks only go up. Everyone should have expected this", "score": 45, "replies": []}, {"body": "rOuGe WaVe", "score": 27, "replies": [{"body": "[rogue wave](https://cdn2-img.pressreader.com/pressdisplay/docserver/getimage.aspx?regionKey=xSdJrlZzEocg0h%2FUoifNpw%3D%3D)\n\n[rouge wave](https://media.npr.org/assets/img/2018/08/09/red-wave_wide-546592e64762be7b2db1999fb426adb11c756a81-s1100-c15.png)", "score": 3, "replies": [{"body": "Rouge wave is that time of the month", "score": 2, "replies": []}]}]}, {"body": "Dude, for two years now everyone's been talking about how if it breaks 420 their could be a huge short squeeze.", "score": 12, "replies": [{"body": "The consultant just revised the short squeeze target to 690", "score": 24, "replies": [{"body": "Reality has gotten too dank for me", "score": 26, "replies": [{"body": "Pretty sure all the \"Professionals\" are just getting their dd from the daily moves threads here.", "score": 8, "replies": []}]}]}, {"body": "Right? It’s like people only hear what they wanna hear", "score": 1, "replies": []}]}, {"body": "No, the bulls still think it's underpriced or about right.  Tesla was always a stock that would 20x or go to zero and now that their risk of bankruptcy is much less I'm not sure if going to zero is a greater than 1% chance likely outcome anymore.", "score": 5, "replies": []}, {"body": "What is this, the spanish inquisition?", "score": 1, "replies": [{"body": "Who the fuck am i, your dad?", "score": 2, "replies": []}]}, {"body": "Actually I know a few people who were expecting this and have been long. Unfortunately I did not size as large as I should've.", "score": 1, "replies": []}]}, {"body": "Is that why the weekend thread was late?", "score": 26, "replies": [{"body": "savage .. He couldn't get the ROPE$ to hold😂😂😂", "score": 11, "replies": []}, {"body": "Dude...do you have to ask?", "score": 1, "replies": []}]}, {"body": "This is how you survive in the trading game.   Admitting your faults and learning painful lessons.  Takes a big man to admit to everyone (and yourself) that you fucked up and it’s your own fault.\n\nDon’t let it hurt your confidence.  If you start doubting yourself then you are more likely to overtrade for smaller quantities and miss the big winners.", "score": 58, "replies": [{"body": "This comment should be the top comment. u/stormwillpass is providing a perfect example of how to grow as a trader. Don’t focus on the loss porn, focus on how they are handling the loss, and learning from it.", "score": 4, "replies": []}]}, {"body": "You got greedy and let your sizing get out of control. Dig yourself out of it. You got this. Learn the lessons and move forward.  👨‍🚀🚀🌑", "score": 19, "replies": []}, {"body": "Sold a 400 and 405 naked calls last Dec, rolled them to 425 and 420 C expiring end of Jan, both are about -100%, to close both will cost $5k. \n\nThe lesson I learned is to never doubt papa Elon, lol.", "score": 18, "replies": []}, {"body": "Thanks for sharing and modding. No worries, bro. You gained a lot in the past. You will gain again in the future. You got this. 😻", "score": 40, "replies": [{"body": "bro 😎💪", "score": 35, "replies": [{"body": "What is a naked call", "score": -20, "replies": [{"body": "He gave Elon a call while sitting naked in his Tesla.", "score": 61, "replies": []}, {"body": "investopedia is a thing", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "For added clarity: It’s worth pointing out that for a call, you’re selling the popsicle for $4 even though the price has risen from $4 to $5.  \n\nYou’re betting against the price rising above $4, so you sell a naked call with a $4 strike price. Someone buys it for $0.XX in premium, not enough to cover your loss. The popsicle’s value increases, and they exercise the option, so now you owe 100 four-dollar popsicles that you’ve got to buy for $5 each.", "score": 0, "replies": []}]}, {"body": "[deleted] apparently I’m retarded!", "score": -11, "replies": [{"body": "You've somehow managed to be 100% wrong.", "score": 17, "replies": [{"body": "It’s a skill", "score": 1, "replies": []}]}, {"body": "It's fascinating that you can be so confidently wrong about something. You're a perfect example for the Dunning-Kruger effect.", "score": 5, "replies": []}]}]}]}]}, {"body": "That's why you're the boss.", "score": 10, "replies": []}, {"body": "This is what I expect from a wallstreetbets mod lol", "score": 11, "replies": []}, {"body": "I look at it like this: because there are NO options that are older than 18 years old, you should NEVER fiddle with naked ones.\n\nAt least with spreads, your lawyer can explain by saying you were offering those underage option contracts peanut butter jelly \"spreads\" on their sandwhich, but that is also an obvious dangle off a cliff, legally speaking.\n\n\nIn all seriousness, it takes guts to be so open about mistakes like this. Even if you aren't in the best financial health right now, always be aware that you have a good life otherwise: you are an esteemed mod of reddit's best sub, and you only sometimes get called a fag.\n\nStay golden, ponyboy.", "score": 11, "replies": []}, {"body": "Now for the really shitty news.\n\n1. You do owe taxes on your 65k gains for last year.\n\n2. You cannot deduct your current (potential) loss of that 65k from last years taxes.\n\n3. You can’t even deduct more than 3k of that (potential) loss per year from ordinary income.\n\nThis all means that unless you have extra “tax paying” money laying around for last year, the IRS is about to grease you up, and unless you make more than 65k in gains this year as well, it’s going to take you a very long time to recapture your tax loss.", "score": 11, "replies": [{"body": "Unfortunately true.", "score": 3, "replies": []}]}, {"body": "Just read your own username. Just another hurdle to get over! (with a price) . I mean as long as you don't double down like some autists here. \n\nObligatory GUH\n\nAlso\n\nSir, this is a Wendy's", "score": 27, "replies": []}, {"body": "Got burned a bit by selling strangles as well. Will go back to selling puts (after earnings).", "score": 7, "replies": [{"body": "Fucked up thing is i got burned by selling puts last year, no one knows what this shot is worth but i guess somehow it is worth 50% more this month because elon danced and china factory made 30 cars whooopaaddeeedooooo", "score": 2, "replies": []}, {"body": "There's this $400 downside you are not seeing...", "score": 0, "replies": []}]}, {"body": "Sending you my good vibes.  Into exile you must go, return with big gains you will.", "score": 8, "replies": [{"body": "what’s the next big play Mr Fog?", "score": 2, "replies": []}]}, {"body": "U/stormwillpass Thanks for posting your updates. I enjoyed reading your posts. \n\nTo be honest I agreed with many of your points you made in previous posts about why TSLA should go down, however after I bought one in December it changed my outlook and with the GIANT short interest this squeeze was months/years in the making.\n\nBack when tsla first came into the scene I said \"oh that'll never catch on\" (I drive V8s and Diesels) and here I am several years later buying one myself.\n\nTSLA is a stock that if you're going to buy and hold forever then that's cool... But the volatility in it marginalizes the average investor who doesn't own a model S and doesn't believe in the mission.\n\nClearly we are in for a pullback at some point but for the same reasons AAPL became a trillion dollar company, I can see the case for tsla becoming a 100 or 200B company.\nIt's not just the cars... It's battery tech. It's drivetrains. It's autonomy. It's logistics. It's storage and energy products...\n\nValuing tsla as a \"car company\" is like reducing AAPL to the company that came out with the ipod.\n\nYMMV. IANAL. etc etc etc.", "score": 14, "replies": [{"body": "Good points. There’s gonna be a pull back at some point. Some type of retracement to support but I’ve obviously mistimed it. Lol.", "score": 2, "replies": []}, {"body": "As someone who barely understands anything on this sub this was the most cogent comment I have read.", "score": 2, "replies": []}, {"body": "There's no moat for their batteries; at least not beyond them being willing to make them for as cheap as possible and allow the car to to max out how much they can be tapped (risk being unreliability , at worst fires.)  Their motors and controls are an advantage.  Their autonomy is a joke, but they've got a frothy enough reality-distortion-field that they're starting to monetize it like software (OTA update taketh away, sell it back to the lemmings for a few g's.  Give away a few kWh of battery and then later badger your customer into paying to unlock it, etc.  Bringing software licensing / pricing models into super expensive physical goods is a huge advantage - it's fucking stupid that people are happy to pay for it, esp in the context of how much Elon has lied/overpromised.)", "score": 0, "replies": [{"body": "People get so caught up on deadlines and promised dates. The car still drives it met all the expectations and then some within a couple of years of when promised. Surprise surprise when you try to do something innovative or changing the r&d schedule changes a lot. Boeing promised the 787 in 2010 yet they didn't start delivering until 2013-14 yet nobody is talking about how they keep \"over promising\" and missing deadlines. Fuck even Elon wildly underestimated falcon heavys development saying it would be ready in 2012 and it only flew in 2018. Yet the product now works, everything is there, no broken promises only broken dates. People who keep shilling that point don't get how development works. Obviously the 2021 Toyota camry isn't going to miss the deadline it's the same fucking car as last year, so you can't hold the same timeline expectations to products that require actual development. All in all, the products work and a couple of years off should be expected if not the norm.", "score": 3, "replies": []}, {"body": "You're not wrong there.", "score": 1, "replies": []}, {"body": "Elon brought the DLC model of Games to cars. It's genius.", "score": 1, "replies": []}, {"body": "Thanks, Buffett. No offence, but fuck off with your ''moat.'' Fundamental guys are as fucked as technical guys. There is nothing in your assessment of moat that is more valid than trend lines on a graph.", "score": 0, "replies": []}]}]}, {"body": "Seeing red in your portfolio is never a good thing, even if it's just by $0.01. Here's to hoping you'll get back in the green.", "score": 6, "replies": []}, {"body": "We all ❤ you 🌩. But please for the love of jesus switch to selling puts or at least turn the dangerous calls like tsla and amzn into spreads", "score": 6, "replies": []}, {"body": "Hey man don't sweat it. You made 65k once, you can do it again. LETS GET IT!", "score": 6, "replies": []}, {"body": "Now write puts and get obliberated the other way :D", "score": 6, "replies": []}, {"body": "I’m impressed with your humility. i will say when you’re in the thick of it, it feels truly awful and I’m sorry you’re going though it. The best thing to do is to keep a positive attitude (which you’re doing) and stay focused! In a few years, you’ll look back and see how much this caused you to grow- if you keep your chin up and persevere. \n\nAnd regarding your call selling. It is risky, but if you want to be net positive over the long term, you have to let the probabilities play out. If you stop trading a strategy with a positive expectancy during drawdown you are doing yourself a disservice. Maybe hedge your position with a long option to reduce your risk a little. Or reduce size. But don’t give it on it.", "score": 5, "replies": []}, {"body": "At least you're still getting a cool laser engraved thing from that one guy on here!\n\nEdit: hate to see you go but love to watch you flair", "score": 4, "replies": []}, {"body": "Fellas take this post down he’s reverse jinxing fucking string him up for this", "score": 4, "replies": []}, {"body": "Stay strong brother. I had a 25k portfolio.. it went down to 3k (not from options but stupid Canadian oil and gas and weed stocks) I learned options and now I'm slowly back up to 8k.", "score": 4, "replies": [{"body": "If you play your cards right, you can turn that 8k into -100k. You got this, man.", "score": 9, "replies": [{"body": "Actually thanks to tim apple, it's at 11k now", "score": 3, "replies": []}]}]}, {"body": "This is why New Years resolutions are always a terrible idea, only going to let yourself down", "score": 3, "replies": []}, {"body": "I didn’t think that you would’ve rolled your naked calls out this far. I truly hope that you break even on your TSLA plays. But maybe stick with selling naked puts on Tesla because it is a legit cult stock. GUHd speed brother", "score": 3, "replies": [{"body": "Yeah double down on it’s epic pull back going in to Feb XD. \n\nI enjoy rolling the dice on TSLA, but any sizeable position is so risky.", "score": 1, "replies": []}]}, {"body": "Good to see the positive attitude. Stick with it, when the recession hits you can capitalize then.", "score": 3, "replies": []}, {"body": "Kudos for the honest tale.", "score": 3, "replies": [{"body": "I really enjoyed seeing this post. It's much easier to post a gain than a loss. This sub is really like r/roastme for some people.", "score": 2, "replies": []}]}, {"body": "God that is really shitty. That’s no fun at all. \n\nMy question is once it looked like your calls were going to be hit, why not buy a call over top so that at least you’re taking a $500 loss compared to $3000? Or turn it into a call spread and then make money", "score": 3, "replies": []}, {"body": "The very first thing you should have done when it surged past 450 was to buy some leaps to cover yourself. Then roll it up and out. Because you didn't you've allowed yourself to be in this situation. Dont sell naked calls on a high momentum stock without some plan to cover yourself. This situation was entirely manageable compared to the gas spike that occurred in 2days.", "score": 3, "replies": [{"body": "Can you give any thoughts to criteria for doing this? I.e., when the strike price or break even are breached? How does an earnings cycle factor in? Why does this move work in the long term? How do you manage the leap on a pullback?", "score": 1, "replies": []}, {"body": "You say 450, but isn't that number arbitrary? Maybe he was going to do that at 500.", "score": 1, "replies": [{"body": "exactly. The trade as executed defies logic. There were so many much MUCH earlier indicators this was a horrible short position to be on. Why wait until $450 to start taking corrective action?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "You should post a thread about lessons learned to help others. You can sticky it since you're a mod already. (1) Your mistake can help others which makes your experience extremely valuable (2) don't let this affect your self-worth. Money makes it harder to get into heaven, so you and the rest of us should all get in pretty easily.", "score": 3, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 8, "replies": [{"body": "wtf", "score": 1, "replies": [{"body": "Sticky", "score": 1, "replies": []}]}]}]}, {"body": "Thank you for sharing and sorry for your losses. You're still my favorite mod ♥️", "score": 3, "replies": []}, {"body": "You just got analfarmer2'd", "score": 5, "replies": []}, {"body": "Same boat. Sold dec 400 naked. Have another load in Jan 400 naked. Getting to my pain threshold.   I’ve been fighting the losses with weekly naked puts as the price has run up. May cap my losses with a long 500 call but I’ve sold Jan 550, feb 650 a s mar 800 recently. \nI just can’t imagine tsla going from 400 to 500 in less than 9 days. Fucking crazy. I mean whole stock market is frothy af.", "score": 2, "replies": [{"body": "seems like a cool tattoo.   \"Tesla went from $400 to $500 in the first 9 days of 2020\"  and on the tenth day  Grimes was pregnant", "score": 2, "replies": []}]}, {"body": "Sell naked puts to recoup the loss. ez.\n\nHang in there man.", "score": 2, "replies": []}, {"body": "Are you too fucked to roll some of your short calls out for a credit? I realize this could get you more hosed, but I think just about anyone with a brain is fully expecting some sort of pullback in the market sometime around the DNC pick for president.", "score": 2, "replies": []}, {"body": "Oopsie daisy 🤪", "score": 2, "replies": []}, {"body": "Storm ⛈ will pass! You got this", "score": 2, "replies": []}, {"body": "Sorry man. This market has been pissing off anyone who does naked options selling or condors.\n\nThen this stock bubble party will end and we will be more pissed off that we were going to be correct all along.", "score": 2, "replies": []}, {"body": "Why do only some calls wear clothes and others are naked?", "score": 2, "replies": []}, {"body": ">The answer is yes, and I'm not quite sure why\n\nThank you for your sacrifices.\n\nAutists like you are the reason I keep holding my stock, because eventually even retards need to cover during short squeeze\n\nThe rally hasn't even begun yet🤡", "score": 2, "replies": []}, {"body": "Damn dude.  Hopefully the dust will settle in a couple of weeks, and you make a rebound.  Good luck!", "score": 2, "replies": []}, {"body": "FUCK they got me too, 490 strike is what I sold.  I rolled out to next week to 505 but I am 100% ready to just eat the 2-3k loss.  I don't do but a single contract(of tsla that is) and I always have the free capitol to just buy the stock if I need to but shit I dont want to own 500 dollar tesla shares.  Glad yours was all gains!  I got into selling tsla because of your first post, thanks asshat(JK JK)!", "score": 2, "replies": []}, {"body": "Ouch.\n\nKeep us posted. I do enjoy your posts.\n\nFrom a purely technical standpoint there might be opportunity to recoup some losses today and maybe tomorrow. The hourly has a nasty red candle on open today and the daily candle is far above the 5 MA of $468.13 so I would expect it to at least drop down and touch the daily 5 MA today or catch up a bit tomorrow around $480-485 or so. After that the daily and weekly charts are still super strong. I personally would not be short calls. It could go parabolic for all I know.", "score": 2, "replies": []}, {"body": "Its happening", "score": 2, "replies": [{"body": "number was so high even back in Nov-Dec that Elon Blew his Load Early  re: Grimez Preggers", "score": 1, "replies": []}]}, {"body": "Good to see you refuse the give up!  One (... or more) bad trades doesn't mean you're a dumb dumb.  Just try to learn from it and realize things aren't always logical and luck doesn't always swing your way.", "score": 2, "replies": []}, {"body": "Sorry dude, I know the \"TeSlA is RAngEbOunD, jUsT sElL iRoN coNdorS\" play worked really well for the past few years but circumstances and the narrative behind a company change all the time.\n\nWhen it comes to Tesla, all the cards seemed to fall into place and the sentiment did a full 180 - no one would've expected market manipulation(yes, I really do believe there's collusion to squeeze out shorts) on this scale.\n\nI'm in disbelief too but thankfully, I closed my short positions for a 5% loss and sat on the sidelines - when the big boys come to play, I humbly take a step back and let them do whatever they want. Obviously, the smarter play would've been to join them by going long on straddles with a strong bias towards the upside but hindsight is 20/20.\n\nThere will always be more opportunities though.", "score": 2, "replies": []}, {"body": "Sorry for your lost: few things I learned myself;\nQuantity of uncorelated assets is much better than quantity of contract. \nCheap wings are worth a dozens smart moves.\nIf you get paid a lot back to back on high IV ticker reduce your size each time\nIf you do not have wings closing at a lost of 2x the credit is a much better use of capital than waiting and rolling inverted. \n\nDisclaimer: bagholding a few credit call spread on Tesla, exp 21... let’s see", "score": 2, "replies": []}, {"body": "Yeah, I just read about other people using options on here and hold TSLA stock....I can't time things (especially TSLA for shit.)  I banned myself from options after I sold Covered AMD calls when it was around $10/share, thinking I could make a few easy bucks.....and lost all of my AMD shares when it skyrocketed.", "score": 2, "replies": []}, {"body": "Autist here so question. Naked calls are when you sell options where you have to cover, correct? I’m making baby tendies on FD’s (buying calls and reselling). I don’t think I can get fucked like this other than getting marked as a pattern day trader (bummer cause it’s so easy to make money like this but I don’t have 25k equity for RH).", "score": 2, "replies": []}, {"body": "The storm will pass...", "score": 2, "replies": []}, {"body": "Outperformed by an Ally savings account.  Mod this man.", "score": 2, "replies": []}, {"body": "Sorry to hear. Good you posted this.  \n\nI really recognize the psychological aspect you describe of stubbornness, the thinking \"it has to go down now\" and therefore the inability to take a loss. \n\nI lost $75k (all my 2019 gains and then quite some more) when I started writing call credit spreads on SPX back in October when it reached ATH's at 3015. This level feels like ages ago, but back then it was the high after quite a rally already with China tension still ongoing. I was so confident it would bounce, I even put on a position much bigger and closer to the money than I normally do, but instead, it blasted right through my shorts. \n\nI figured it had to reverse soon and kept rolling my position over and over. Well, obviously it didn't and early December I finally decided to cut my, now massive, loss.\n\nIt was a HUGE mistake and the psychological aspect of not wanting to give up, made a bad situation much worse. My loss would have been only $20k had I taken it directly. \n\nI also continued trading, but have changed my trading style & tactics to not come into such a situation ever again.  I don't trust myself I will make the right decision then, as the mind is difficult to comprehend.", "score": 2, "replies": []}, {"body": "lol dude\n\ni had sold 500c's last week when tesla was 430. i was like, no fukin way it hits 500 thats asinine, literally free money (read: pennies in front of a steamroller)\n\nyesterday was some deep shit but actaully thank the lord for today there was a dip so the 500c's expiring 1/10 aren't going to lose me anything UNLESS tomorrow it moons\n\ni ended up selling a couple puts as well to \"hedge\" the call sells so its officially an IC now. 440/460//500/540\n\nso if tesla ends between 460 and 500 tomorrow ill actually have profited from this potential disaster.\n\nthe real problem is my huge short on Apple that just refuses to go down.", "score": 2, "replies": [{"body": "> huge short on Apple that just refuses to go down.    \n      \nPosting this reply from my iPhone 11. Good luck, Apple isn’t going down.", "score": 1, "replies": []}]}, {"body": "👊👊👊. I expect NOTHING LESS FROM A WSB MOD !!\n\n🇺🇸🇺🇸🇺🇸🚀👍😏", "score": 2, "replies": [{"body": "ruthless👊👊👊😎💯", "score": 2, "replies": []}]}, {"body": "Yeah I'm thinking about buying a 550 put on TSLA tomorrow. This rally has pushed the stonk to insanely overbought levels and I see a reversion to 370 or 430 very likely in 30 days from now a week after earnings. Or it has the best earnings yet and hits 540, who knows.", "score": 4, "replies": []}, {"body": "Why didn’t you put aside money for taxes?", "score": 2, "replies": [{"body": "Because he wanted to 10x it DUH!", "score": 3, "replies": []}]}, {"body": "how high can it get?", "score": 1, "replies": []}, {"body": "Rogue waves on those sold naked calls", "score": 1, "replies": []}, {"body": "You're true downfall was pulling an all nighter so early in the new year. This act is not for the faint of heart and im sure it contributed to 100% of your losses. Perhaps you should consult with Winker before taking on such a challenge next time.", "score": 1, "replies": []}, {"body": "Rogue wave..", "score": 1, "replies": []}, {"body": "Just buy a few 600c 1/31 and you’ll be fine", "score": 1, "replies": []}, {"body": "Tesla is set to test 530 for Jan 17 If it cracks $500", "score": 1, "replies": []}, {"body": "But daddy stonks literally can't go tits up", "score": 1, "replies": [{"body": "Stonks go up, bears go down", "score": 1, "replies": []}]}, {"body": "F", "score": 1, "replies": []}, {"body": "There's only one thing to do: double down. We can beat Elon. We have to", "score": 1, "replies": []}, {"body": "Honestly, IMHO in your shoes I'd probably roll them and hope it crashes at some point and I could bail.", "score": 1, "replies": [{"body": "The problem with this is do you have the margin to cover your loss if this hit 2k before 200? And will it crash or is this coke in the 80?", "score": 1, "replies": []}]}, {"body": "Take it as a learning lesson and better yourself, sorry to hear about the rough start but you’ll bounce back", "score": 1, "replies": []}, {"body": "\"The (Theta) Gang Learns About No Free Lunch\"", "score": 1, "replies": []}, {"body": "Hey man, Steve Eisman was short Tesla too so don't feel too bad", "score": 1, "replies": []}, {"body": "As much as so many people here jerk off about being positive theta, it also means being negative gamma.  Negative gamma with no hedge and an underlying that continuously moves against you is far worse, imo, than losing 90%+ on option purchases.  And if you go with spreads, they are harder to manage, and you can get ass blasted by slippage **several** times in a single trade.\n\nWith \"theta gang\", you are also far more likely to see screenshots of gains than catastrophic losses, not only because gains are far more likely to be posted, but also because marginal gains are far more likely than catastrophic losses when selling out of money options.", "score": 1, "replies": []}, {"body": "Still has room to run into this quarter earnings my broski.", "score": 1, "replies": []}, {"body": "I lost  \\~9k being short on calls from 365 to 380. Glad I called it quits instead of rolling them out.", "score": 2, "replies": [{"body": "F", "score": 2, "replies": []}]}, {"body": "Why are you selling naked options??? 😭😭😭", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "Well you didn’t get screwed you screwed yourself lol", "score": 1, "replies": []}, {"body": "lol", "score": 1, "replies": []}, {"body": "Don’t be a prude and show us your chart.", "score": 1, "replies": []}, {"body": "😂😂😂😂 selling naked calls on the daddy Elon, you gotta face punishment", "score": 1, "replies": []}, {"body": "C'mon dood. Sell Naked Call. Execute stop limit just below your strike to hedge... Every trade needs a management strategy", "score": 1, "replies": []}, {"body": "What percent of your account did you have in play?", "score": 1, "replies": []}, {"body": "When you were doing these trades, were you holding your arms out in front of you, imagining yourself steering a boat?", "score": 1, "replies": []}, {"body": "explain to me how shorts positions lower the price of a stock? I've always thought that the underlying asset is a long position by the broker on the stock.", "score": 1, "replies": [{"body": "When you short a stock you sell the shares causing the price to go down", "score": 1, "replies": []}]}, {"body": "Dang well at least you're honest.  Were you all in tsla?  Diversification is important.", "score": 1, "replies": []}, {"body": "Feeling better today?", "score": 1, "replies": []}, {"body": "Good news!", "score": 1, "replies": []}, {"body": "Tesla is heading to $4,200.69 you neckbeard!", "score": 1, "replies": []}, {"body": "dayum son you better hope they find kiddie porn on Musk's computer or something", "score": 1, "replies": []}, {"body": "Did you end up holding them.... down 10 bucks today so thats like 1k per call that was ITM and it might sell off more in tmrw going into the weekend :)", "score": 1, "replies": []}, {"body": "Keeping it real. Thanks for the story, sorry for your loss. You're a cool guy for sure.", "score": 1, "replies": []}, {"body": "3x leveraged semiconductor ETFS\n\nthese options things are too complicated", "score": 1, "replies": []}, {"body": "I feel your pain", "score": 1, "replies": []}, {"body": "The worst part is, if you close and TSLA starts to drop hard.. That happened to me 2 night ago with ES. Had 20 short puts spreads at 3200/3190, bought when ES was 3245. When it dropped past 3200, I sold em all because if I didn't my losses would be 8x more..but then it shot back. I got burned with short put spreads on /GC too yesterday morning.\n\nI found the best way to deal with this is to buy long contracts in the direction of the momentum, so since tsla was ripping up, buy calls on it because rolling up and out can only do so much.", "score": 1, "replies": []}, {"body": "Sold 480 weekly calls earlier this week thinking now way tsla goes up that much... Then I bought back yesterday near the top... kept waiting for hourly consolidation to happen before buying and it didn't so I bent the knee", "score": 1, "replies": []}, {"body": "That’s why I just bought puts, naked sold calls are scary", "score": 1, "replies": []}, {"body": "Big oof man but if you made $65k you can do it again. I’m very new to trading securities and it’s always humbling and encouraging to be reminded that everyone stumbles, but in order to fall hard you have to fall from a high place. Looking forward to the next $70k you make!", "score": 1, "replies": []}, {"body": "Can we get a welfare check on OP? I call dibs on his xbox!", "score": 1, "replies": []}, {"body": "Would be great for my 1/10 4.95 calls if TSLA hit 500 tomorrow", "score": 1, "replies": []}, {"body": "Why sell naked options when selling spreads are both more buying power efficient and less risky? I don't get it", "score": 1, "replies": [{"body": "Selling naked allows you some great returns, just at an even greater risk. Spreads make you take some loss of profit. Its a toss up really. its really the naked call side thats dangerous since its undefined.", "score": 1, "replies": []}]}, {"body": "We traded messages once, back and forth, when you posted one of your screenshots of massive short positions.\n\nI said people didn't understanding short premium trades, and were confusing it with yolo stuff. You agreed.\n\nYou seemed like you were managing trades, keeping your deltas in line, etc. But something went wrong. Is there anything specific you can share about where you think you went wrong? I.e., too many contracts? Too much short delta? Not closing losers at a set percentage? Etc. And then what was your attitude at the time that let those things happen?", "score": 1, "replies": []}, {"body": "I thought WSB mods get secret Trump texts?", "score": 1, "replies": []}, {"body": "Remember storm will pass... if those are long dated is there a chance you weather the storm and your trade actually plays out?  I just did the same thing with SN, I tend to get the trends correct but the timing wrong so have started buying further out expiry", "score": 1, "replies": []}, {"body": "Stay strong buddy. This is a crazy time...", "score": 1, "replies": []}, {"body": "Post a screenshot of the losses", "score": 1, "replies": []}, {"body": "Why not buy futures (when the spot gets close the strike price) to hedge against the short calls?", "score": 1, "replies": []}, {"body": "I have no ideea why some people on theta gang don't hedge by buying a higher strike (or lower in case of selling puts) . like, if you don't do that you are just gonna end up losing everything you made ifthe stock moves against you. And it doesn't even have to move much for you to wipe out all your  gains. Like you you don't want to pay a premium but fuck. Better to earn less and be safe than lose a year of premiums lmao. Selling options is so shitty when it goes wrong, losses are limitless and your gains are capped.", "score": 1, "replies": []}, {"body": "Damn capital gains tax in the US is a bitch!", "score": 1, "replies": []}, {"body": "Taxes? Ha", "score": 1, "replies": []}, {"body": "At some point we are all humbled.", "score": 1, "replies": []}, {"body": "I love you.", "score": 1, "replies": []}, {"body": "Oof. I remember when Tesla first mooned after Q3 thinking storms gonna get fucked. Tesla bulls eatin well tonight", "score": 1, "replies": []}, {"body": "Ayyy yo, remember this?\n\n\nhttps://www.reddit.com/r/wallstreetbets/comments/bpkxbo/tsla_naked_options_are_free_money_update_1733359/enukxdp/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nTesla short calls was your rogue wave. One of the few times it makes me sad to have been right. Godspeed", "score": 1, "replies": []}, {"body": "How are you doing ? Any naked calls/puts on TSLA ?", "score": 1, "replies": []}, {"body": "How much in taxes will you since you didn't get to enjoy the tendies", "score": 1, "replies": []}, {"body": "Well I fucked up too, baghold $45k of $NET for 4 months then I sold deep ITM covered calls and that backfired, ended up making 1% holding the junk for 4 months. At least you saw tons of gains in 2019, I got nothing buy misery.", "score": 1, "replies": []}, {"body": "the initial plays weren't too retarded. Everything after that was seriously fucking stupid", "score": 1, "replies": []}, {"body": "What is a naked call? Asking for a friend...", "score": 1, "replies": [{"body": "When you strip naked and start calling random strangers explaining that you're super naked and horny af, and here's your address. Sometimes you get laid. Sometimes you run into that serial killer that nobody knows about.", "score": 3, "replies": []}, {"body": "Why would you ask that here. You know you don't get real answer, or maybe you are new? Google.com -> stocks naked call define", "score": 1, "replies": [{"body": "That’s why I ask for a friend. I know if I ask for myself that will happen", "score": 1, "replies": []}]}, {"body": "Limited profit, unlimited risk.  You sell a call, and get a premium.  You win if stock stays below the strike, if stock goes up you pay for the entire rise.  Worst move possible to make on a volatile stock with a huge short interest (artificially depressing price), and working on moonshot technologies that could 20x the value of the stock.  This rise was years in the making, that risk of the rise is why the premiums looked attractive.", "score": 1, "replies": [{"body": "Its like tsla has reached trumps level of saying f the haterz. But ouchie. Sorry to our friend! Wishing you good fortune in the wars to come!", "score": 1, "replies": []}]}]}, {"body": "I lost $40 yesterday.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "And taxes..", "score": 9, "replies": [{"body": "Yea imagine buying a brand new Tesla and financing it 100% with 26% APR and then totalling it the next day with no insurance. Now you're paying for a car you no longer have for the next 5 years.", "score": 3, "replies": []}]}]}, {"body": "This is why its always better to buy premium rather than sell. Higher ROI, and much less stressful.", "score": 0, "replies": []}, {"body": "Why the fuck aren't you a mod.", "score": 0, "replies": [{"body": "Might wanna use your eyeballs", "score": 1, "replies": [{"body": "You damn well know we're all retarded here. Some just have eye retardation.", "score": 3, "replies": [{"body": "Fair. I have pointer finger retardation", "score": 1, "replies": [{"body": "No way. I was told that i was the only case of that they'd seen in years. #honkers", "score": 2, "replies": []}]}]}]}]}, {"body": "TSLA is still a piece of shit stock. The current valuation is only justified by zealotry. Nothing more. It's too bad people still think this stock does, or ever will make sense. As long as musk is the CEO the company could lose five trillion a year and its sycophants would still think he's the second coming.\n\nIt's an impossible stock to trade. Stay away.", "score": 0, "replies": []}, {"body": "If TLRY, a stock quite literally worth not more than 2 wooden nickels, can go up to $300/ share, why can't TSLA go up to $500? You guys kill me with your fucking can't go here can't go there price predictions.", "score": 0, "replies": []}]}
{"title": "Thank You AMD", "selftext": "I am a broke college student. Thanks to AMD and Su bae, I can now afford the paperwork and website hosting to start my own business selling fish online. Gone are the days of being a wagecuck. I shall now force fish to fuck and sell their children for more AMD calls. How has AMD changed your life?", "id": "emc4nl", "created_utc": 1578587864.0, "score": 714, "upvote_ratio": 0.98, "num_comments": 120, "comments": [{"body": "I can now continue funding my coke and hooker addiction", "score": 397, "replies": [{"body": "Now you can afford a decent escort.", "score": 78, "replies": [{"body": "Hey don't talk shit about Crystal she's a nice lady", "score": 59, "replies": [{"body": "Does “Crystal” have surprisingly strong hands, and Adam’s apple, and a 5 o’clock shadow?", "score": 26, "replies": [{"body": "[removed]", "score": 10, "replies": [{"body": "Kristhole", "score": 1, "replies": []}]}, {"body": "and an affinity for the other type of \"crystal\"", "score": 13, "replies": []}]}, {"body": "Yeah she prefers to be called a HOOKER not an escort! Jeez the nerve of some people, so inconsiderate", "score": 12, "replies": [{"body": "Long HKRS", "score": 7, "replies": [{"body": "Short $hkrs", "score": 1, "replies": []}]}, {"body": "You only call them hookers after they're dead. RIP Crystal.", "score": 3, "replies": [{"body": "Theres nothing better than a closing a position on $HKRS after they expire. Just make sure to go to your lawyer right after or else the sec will go undercover as the fbi and arrest you.", "score": 1, "replies": []}]}]}, {"body": "It’s promised KRIS-STAL like the champagne", "score": 1, "replies": []}]}, {"body": "Well, it's not like Ford is a luxury car to begin with, so yeah.", "score": 5, "replies": []}, {"body": "Now he can afford a real woman. No more ladyboys!", "score": 2, "replies": []}, {"body": "Hey, I'm not sure if having a \"clever man\" tag on WSB is a good thing.", "score": 1, "replies": [{"body": "We are just on different levels. I would much prefer mine over yours.", "score": 1, "replies": [{"body": "Well in the land of the blind, the one-eyed man is called a crazy retard.", "score": 1, "replies": []}]}]}]}, {"body": "those feels when you have a bad week and have to downgrade to fat trannies and baking soda from the homeless guy on the corner who said he only sells “good shit”", "score": 8, "replies": [{"body": "Not everyone considers fat trannies a downgrade.  That's so pre-2009.", "score": 5, "replies": []}]}, {"body": "I prefer Pepsi, but whatever.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "cokesandhooks.cum/signup", "score": 1, "replies": []}]}, {"body": "Proud of you", "score": 2, "replies": []}]}, {"body": "When can I yolo calls on your business?\n\nSrsly making fish fuck sounds like aquaculture which is a thing. /S", "score": 53, "replies": [{"body": "I got a solo cup with 3 fish fry, shares start at $1.00", "score": 43, "replies": [{"body": "Pic of the solo cup with fried fish?  Need to do my DD before investing.", "score": 25, "replies": []}, {"body": "Picturing an autist scooping goldfish and koi out of restaurant and malls then rain dancing around a small tank in his bedroom", "score": 8, "replies": []}, {"body": "Sold! Take my m o n e y", "score": 3, "replies": []}, {"body": "shit ill go all in.", "score": 3, "replies": []}, {"body": "Do you sell fractional shares? I don't want to dive in too deep.", "score": 3, "replies": []}]}]}, {"body": "Still broke, but slightly less broke.\n\nIf these $70 long calls pay off I may actually scratch middle class.", "score": 81, "replies": [{"body": "Reach higher, Middle class is going down. hold my hand we can skip to wealth together!", "score": 35, "replies": []}, {"body": "When did u buy them ? For how much ? Was going to go in on it too", "score": 9, "replies": [{"body": " ~ 45/ share. Got them for .14", "score": 7, "replies": [{"body": "Nice !", "score": 4, "replies": []}]}]}, {"body": "Being broke is a spectrum (most WSB members are on it).", "score": 1, "replies": []}]}, {"body": "What in the shit fuck did I just read?!?", "score": 99, "replies": [{"body": "OP is going to sell his moms pussy on the interwebs.", "score": 82, "replies": [{"body": "Op mother is a pussy fish, op is pussy mermaid. Flair material.", "score": 11, "replies": []}, {"body": "Implying anyone would pay for that old fat fuck.", "score": -2, "replies": [{"body": "Why would you be so disrespectful to a mom who raised an autistic child. Her puss is probably tighter than your asshole.", "score": 25, "replies": []}]}]}]}, {"body": ">website hosting to start my own business selling fish online\n\n*SoftBank has entered the chat*", "score": 27, "replies": [{"body": "Imagine how good the blowjob from adam neumann must have been for the mayoshi guy to invest 5BN into WeLoseMoney.", "score": 7, "replies": []}, {"body": "Dead.", "score": 4, "replies": []}]}, {"body": "Sorry...fishfucker.com is already registered to Jason Momoa", "score": 25, "replies": [{"body": "Or The Deep, from the show The Boys", "score": 2, "replies": []}]}, {"body": "my robinhood account is green for the 2nd time in 2 years", "score": 23, "replies": [{"body": "I genuinely sometimes go days without opening my app because I know I'm hard in the red.", "score": 12, "replies": [{"body": "If a tree falls, my man", "score": 6, "replies": [{"body": "Got it, short $TREES", "score": 6, "replies": []}]}]}, {"body": "Lose it all end of 2018?", "score": 1, "replies": []}]}, {"body": "Who the fuck buys a fish online? This is the most autistic thing I’ve ever read and I love you for it no homo, god speed", "score": 23, "replies": [{"body": "some loaded fish f\\*cker [https://www.liveaquaria.com/divers-den/product/488918/hawaiian-deepwater-anthias](https://www.liveaquaria.com/divers-den/product/488918/hawaiian-deepwater-anthias)", "score": 6, "replies": [{"body": "Fuckin lol at paying 4K for a tiny goldfish", "score": 4, "replies": []}]}]}, {"body": "AMD undid all of the $25k losses I took from MU calls in 2019. Thank you, AMD.", "score": 18, "replies": []}, {"body": "I sold my AMD calls and made a computer with an AMD processor.", "score": 15, "replies": [{"body": "This is what I'm trying to do but with Tesla", "score": 5, "replies": []}]}, {"body": "Long $SHOP sell fish babies online", "score": 6, "replies": []}, {"body": "They ruined me. I bought puts from 32.", "score": 11, "replies": [{"body": "Stocks only go up doe", "score": 23, "replies": [{"body": "yea why would you buy puts", "score": 6, "replies": []}]}, {"body": "Dude :(.", "score": 1, "replies": []}]}, {"body": "I now own a Tesla and a house due to the glorious greatness of Su Bae.", "score": 4, "replies": []}, {"body": "I'm in on 20 contracts of Jan 31 50.5C", "score": 3, "replies": []}, {"body": "If you sell Salt Water, I will be your best customer <3", "score": 6, "replies": [{"body": "I'm doing freshwater, might dabble in saltwater once my resale license is processed.", "score": 7, "replies": []}]}, {"body": "congratulations btw !! for me...i can now buy lube to masturbate with instead of coconut oil", "score": 3, "replies": []}, {"body": "I can now afford a decent ladyboy without a mustache", "score": 3, "replies": []}, {"body": "Will you sell fish sticks", "score": 6, "replies": [{"body": "fish dicks", "score": 7, "replies": []}, {"body": "Kanye, is that you?", "score": 7, "replies": []}]}, {"body": "I'll suck some options knowledge for a cheeseburger", "score": 2, "replies": []}, {"body": "meanwhile in true WSB fashion, I have purchased 45 1/10 50.50 @ an average price of .24\n\nsame option is now trading at .08\n\nfuck me", "score": 2, "replies": [{"body": "I got my 1/10 50c for .545", "score": 1, "replies": [{"body": "Pray", "score": 1, "replies": []}]}]}, {"body": "HOW MUCH IS THE FISH?", "score": 2, "replies": []}, {"body": "yo show us the fish", "score": 2, "replies": [{"body": "Bro if I don't see some fishh...", "score": 1, "replies": []}]}, {"body": "My AMD gains ( i bought it at 25$) have let me look like I know what im taking about when i tell my classmates and coworkers that i invest while in college", "score": 2, "replies": []}, {"body": "i bought in at $19 and i had no idea what the fuck i was doing because i recently had downloaded robinhood at the time and i’ve never invested ever and only bought AMD because i own an AMD CPU. thank you AMD", "score": 2, "replies": [{"body": "That's kinda cute.", "score": 1, "replies": []}]}, {"body": "I’m retarded and bought a put. Y’all really be beating the living bear out of me", "score": 2, "replies": []}, {"body": "I.... Huh you know what, nevermind", "score": 1, "replies": []}, {"body": "Screenshot tendies pls", "score": 1, "replies": []}, {"body": "Didn’t come through on CES.", "score": 1, "replies": []}, {"body": "Can i buy a fish that has a visible sign a retardation so i can trade with someone who's similar to me?", "score": 1, "replies": []}, {"body": "Koi? Betas?", "score": 1, "replies": [{"body": "Wish I had a pond for Koi, working on betta breeding tanks.", "score": 2, "replies": []}]}, {"body": "Please post a link to the website once you are up and running, I would like to purchase your fish creations :P", "score": 1, "replies": []}, {"body": "hol- up", "score": 1, "replies": []}, {"body": "Sell me marbled crayfish to feed my puffer", "score": 1, "replies": []}, {"body": "I’m starting to get high blood pressure why is AMD going down now? Is it just weak hands and a healthy correction?", "score": 1, "replies": [{"body": "The weakest hands. \n\n\nOr it's smart money moving into the fish sex business.", "score": 5, "replies": []}, {"body": "Hold tight my man", "score": 1, "replies": []}]}, {"body": "Ok I'm a bull. How do I get in on this at the ground floor. \n\nIf I give you 15 dollars can you turn it into a boat?", "score": 1, "replies": []}, {"body": "It would have changed my life when it was less than 3 bucks less than 3years ago", "score": 1, "replies": []}, {"body": "'selling fish online' - is that what you call selling your sister's pussy on a discount hooker website?", "score": 1, "replies": []}, {"body": "Why didn't you use Shopify for the business and cash for hookers?", "score": 1, "replies": []}, {"body": "Sold all 3k shares @ ~$4.89 when the new video card (R460?) had voltage issues out of the gate. I still cry myself to sleep.", "score": 1, "replies": []}, {"body": "A true American hero 🦸‍♂️", "score": 1, "replies": []}, {"body": "Real talk tho, I had a friend in college who made fucking bank breeding koi fish. Apparently they can be really valuable. Dude legit paid for his degree by making fish fuck.", "score": 1, "replies": []}, {"body": "Good. Notify me when you start so I can buy puts on your business", "score": 1, "replies": []}, {"body": "I hear the real money is in harvesting their eggs  into a peel top aluminum can so you can smear that shit on a dry cracker. Stupid richies!", "score": 1, "replies": []}, {"body": "How do you plan on shipping the fish?", "score": 1, "replies": []}, {"body": "AMD changed my life too. I now have the money to start my money printing business which is netting me millions. I can afford Robinhood Pro with it!", "score": 1, "replies": []}, {"body": "You better make this fish f\\*ck trade it for AMZN tendies $4grand each [https://www.liveaquaria.com/divers-den/product/488918/hawaiian-deepwater-anthias](https://www.liveaquaria.com/divers-den/product/488918/hawaiian-deepwater-anthias)", "score": 1, "replies": []}, {"body": "Imagine my confusion when I thought this was the wasteland2 sub", "score": 1, "replies": []}, {"body": "Could name the fish fucking site PrawnHub.com", "score": 1, "replies": []}, {"body": "why still go college \n\nYolo tuition fee on AMD OTM CALL", "score": 1, "replies": []}, {"body": "You monster! Every sperm is sacred!", "score": 1, "replies": [{"body": "Tell that to the sperm I dump into tissues...", "score": 2, "replies": []}]}, {"body": "My favorite thing to waste time on at work is buying AMD. I work at Intel 😎", "score": 1, "replies": []}, {"body": "Do guppies my nigga! Everyone likes guppies! They fuck a lot too!", "score": 0, "replies": [{"body": "Their lifespans are pretty short tho, not good for longterm storage.", "score": 1, "replies": []}]}, {"body": "Tilapia fucking is zen", "score": 0, "replies": [{"body": "I heard they eat shit so it can be unealthy to eat them", "score": 1, "replies": []}]}]}
{"title": "Never get FOMO, never think you missed out", "selftext": "Opportunity in the market is everywhere, all day. You should never feel you missed out on something. Calls or puts, specifically short dated ones and otm gives you the power to decide when and on what you enter for huge gains.\n\nA basic understanding of support levels will ensure your entries are at the right time. And other basic charting understanding. The other requirement is to only play good company tickers (no pharma, weed, etc).\n\nDid you know that half a percent movement can make you 100% gains? Did you know averaging down near a support level (esp in a market like this) is arbitrage as long as you stick to your plan? It's because it will bounce off (and by bounce off all it needs to move is half a percent). And you will get your 100%+ gains.\n\nStop FOMO. Be patient and enter positions at your own speed. You're not missing out on anything by ignoring TSLA, or not playing that PTON dip, or even by not jumping on the LK or BYND bandwagon. Stop. Breathe. Be patient.", "id": "emhpsz", "created_utc": 1578611221.0, "score": 340, "upvote_ratio": 0.97, "num_comments": 116, "comments": [{"body": "I didn’t read this", "score": 271, "replies": [{"body": "\\#MeToo", "score": 77, "replies": []}, {"body": "Then shut up", "score": -81, "replies": [{"body": "Eat a dick", "score": 47, "replies": [{"body": "I offer mine in tribute", "score": 16, "replies": []}]}]}]}, {"body": "Girl in college asked me if I wanted to go back because she could find me a bed in her sorority.\n\nNext question was me asking my friend if we should go look together. My friend and I were stranded at the time. She did not ask him.\n\nI still think about it", "score": 133, "replies": [{"body": "This was not the way", "score": 69, "replies": [{"body": "This was not the way", "score": 16, "replies": [{"body": "This was not the way", "score": 10, "replies": [{"body": "This was not the way", "score": 8, "replies": []}]}]}]}, {"body": "“Yeah so I asked him to come back with me and he asked another guy to come....idk girls I guess he was gay.”", "score": 44, "replies": [{"body": "r/yourjokebutworse", "score": 20, "replies": [{"body": "r/suckmydick", "score": 37, "replies": [{"body": "Hahahah", "score": 12, "replies": []}]}]}]}, {"body": "A lesbian girl in college asked me if I ever had a threesome and later asked me if I could give her a ride pick up her girlfriend and I said no because I was tired, I didn’t connect the dots until some other girl that was there mentioned a few days later... that same week I decided to sell my $8k in TSLA and TNA, this was December 2011. My life could’ve been very different", "score": 66, "replies": [{"body": "i almost downvoted you out of anger", "score": 48, "replies": []}, {"body": "How are you not a mod here?", "score": 22, "replies": [{"body": "He's on the WSB board", "score": 8, "replies": [{"body": "He's a VC.", "score": 5, "replies": []}]}]}, {"body": "Bruh I'm legit upset for you.", "score": 7, "replies": []}, {"body": "You sold TNA and didn’t get any TNA that night either. *solemnly pours a 40oz*\n\n(FWIW I’ve been that dumb before too)", "score": 4, "replies": []}]}, {"body": "You belong here.", "score": 22, "replies": []}, {"body": "r/brosbeforehoes", "score": 7, "replies": []}, {"body": "I teared up, RIP", "score": 10, "replies": []}, {"body": "Mods being mods", "score": 10, "replies": []}, {"body": "There's a thing called Uber you know.", "score": 2, "replies": []}, {"body": "F", "score": 2, "replies": []}]}, {"body": "So AMD $69", "score": 20, "replies": []}, {"body": "I heard/read some quote from Ted Williams (baseball player) applied to the market. He basically talked about how he wouldn’t chase bad pitches, and would wait until there was one squarely in he strike zone. The point was about how there’s no strike count in trading - you can wait as long as you want, do all the research you want, and not put your money on the line until you see a great situation. I try to keep that in mind. Like you said: with the sheer number of stocks, and knowing about options and the ability to take a short position with puts, you can basically use anything as an opportunity to make money.", "score": 40, "replies": [{"body": "Papa Buffet uses this story in his HBO doc. Even has a picture of Williams and his batting percentage mapped out over different parts of the strike zone.", "score": 15, "replies": [{"body": "https://www.theladders.com/career-advice/warren-buffett-and-ted-williams-on-how-to-make-better-decisions-in-life-and-work", "score": 2, "replies": []}]}, {"body": "Stats and charts geeks:  The Science of Hitting by Ted Williams.  Dude was a genius.", "score": 3, "replies": []}, {"body": "There are so many similarities between trading and baseball it's crazy. Patience, timing, mindset, probabilities, the list goes on. Listen to any post-game press conference and it could apply seamlessly to trading.", "score": 3, "replies": []}]}, {"body": "Why would you tag it shitpost?! I needed to hear this. I didn't touch TSLA and yet it has me mindfucked for the last few weeks. Good post. I like it.", "score": 50, "replies": [{"body": "You don’t touch Tesla, it touches you", "score": 22, "replies": []}, {"body": "After being at -30% i sold my stocks at +10%, just to see it to full retard and beyond 420. Feel like shit now.", "score": 8, "replies": [{"body": "Over the summer it was bouncing between 220 and 250, and I was DCAing the whole time. Figured I’d get out by earnings in Sept and did. Made a nice little profit, but JFC If I just held.......", "score": 1, "replies": []}]}, {"body": "I know. This man is making sense.....burn him!!!", "score": 3, "replies": []}, {"body": "He's reinforcing the idea that someone can make money. We are all losers here. Classic shitpost.", "score": 2, "replies": []}]}, {"body": "I missed spy 300 305 310 315 320 325 and 330 soon. FOMO IS REAL.", "score": 13, "replies": [{"body": "that's good-I played spy 298 put, 304 put 307 put and 311 put during that period.....you'll get in eventually..", "score": 10, "replies": [{"body": "Can you let me know when you buy more puts please?", "score": 6, "replies": [{"body": "Following", "score": 1, "replies": []}]}, {"body": "Still holding $100k worth of AAPL puts 255 expiring 1/17 I’ve watched since October. Not worth $100k anymore.  It’s not over til it’s over.", "score": 7, "replies": []}]}]}, {"body": "Actually OP, you couldn't be more wrong. Opportunity in the market never exists. Ever. Because its all priced in", "score": 23, "replies": [{"body": "Exactly. There are no opportunities. Never ever. And shorting TLRY at $290 was certainly NOT an opportunity either. And neither was long TESLA at $220.", "score": 5, "replies": [{"body": "Tesla is going to 900 dude it's okay", "score": 2, "replies": []}]}]}, {"body": "I’m fuckin gay", "score": 28, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Long $dks", "score": 1, "replies": []}]}]}, {"body": "I want to say\n\n>\tI didn’t read this.\n\nBut I did... and you make a good point. Especially during crazy times in the market like this one. Good post... for a flaming downsy autist.", "score": 9, "replies": []}, {"body": "r/investing called and wants their pussy shit back", "score": 20, "replies": []}, {"body": "WTF is this inspirational shit. Thanks though.", "score": 12, "replies": []}, {"body": "What’s the point of this? This is the same as Just tell the sub to buy LEAP on a good company but they never do.", "score": 4, "replies": [{"body": "Not really. A lot of peoples losses are due to the psychology of thinking you're missing out so you try to put money somewhere and it turns against you. Point of this is to remind people that sometimes doing nothing is the best thing so you can make correct entries.", "score": 6, "replies": [{"body": "But the people here posting those 5 baggies will makes them FOMO hard", "score": 2, "replies": []}]}]}, {"body": "What the fuck did you just fucking say about me, you little bear? I'll have you know I graduated top of my class at Devry University and I've been involved in numerous bull runs, and have over 300 confirmed RobinhoodBux™. I'm trained in margin exploit warfare and I'm the top autist in the entire WSB. You are nothing to me but just another target. I will wipe you the fuck out TSLA and AMD earnings, the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my network of CEOs across the USA and your robinhood account is being traced right now so you better prepare for the storm, cub. That's right. You're fucking dead. I can be anywhere, anytime, and I can outearn you in over seven hundred ways, and that's just with my jerking off hand.\n\n&#x200B;\n\nso do us all a favor. Take your grubby little bear paws and delete the app, delete Reddit, and delete your bank account. Maybe if you're lucky, we won't delete your species.", "score": 5, "replies": [{"body": "I bet you go to renaissance fairs", "score": 7, "replies": [{"body": "I like this insult", "score": 4, "replies": [{"body": "😘", "score": 2, "replies": []}]}]}]}, {"body": "Oh for fucks sake now you tell me. I’m down 60% all time", "score": 6, "replies": []}, {"body": "My cure for FOMO is stocks to test the waters.  If the stock loses, I stop out and feel better that it wasn't options. If I think it will go down the moment I buy options, I will buy stocks and build up a gain until I \"get\" the stocks daily sentiment.  Holding the stock means I get a feel if its going up or down without gambling options and even stock position getting stopped out can build into a good options entry or a put candidate.  Generally I will start selling my stock and replacing the position with equivalent or more options.  Sometimes the stock has a daily dip or a morning rocket and you can roll options to win big in a short time which is the only option play I like.", "score": 3, "replies": []}, {"body": "I prefer the Babe Ruth method. Homerun or strike out.", "score": 3, "replies": []}, {"body": "By 'Be Patient', I'm assuming you mean YOLO Jan15th $330 SPY calls instead of Jan 13th $330 SPY calls?", "score": 3, "replies": []}, {"body": "Yeah but I fucking sold AMD at 35.", "score": 3, "replies": []}, {"body": "Except for AMD, NVDA, AAPL and TSLA. If you have missed those you have missed infinite tendies.", "score": 3, "replies": []}, {"body": "You can't feel FOMO if you always buy when you feel it", "score": 3, "replies": []}, {"body": "Which options do I get for 100% gain?", "score": 2, "replies": [{"body": "Any. Just need to be sure of half pct move that day", "score": 3, "replies": []}, {"body": "AMD, AAPL, SPY, PYPL, V, SQ, MSFT, BA. If SPY opens up >0.5%, buy calls, if SPY opens negative, buy puts.", "score": 3, "replies": [{"body": "Almost. No matter what SPY does, buy calls. Papa Jerome says so.", "score": 4, "replies": []}]}]}, {"body": "Saving for next FOMO", "score": 2, "replies": []}, {"body": "Sold Sony an hour before the car announcement. I missed out on 6%. FOMO becomes AMO.", "score": 2, "replies": []}, {"body": "YOLO is life for some of us though.", "score": 2, "replies": []}, {"body": "Is this gay literotica?", "score": 3, "replies": []}, {"body": "Sorry, couldn't read this over the sound of me market ordering in", "score": 2, "replies": []}, {"body": "Gay", "score": 1, "replies": []}, {"body": "Too much txt for my peanut size brain. Just tell me the ticker and direction.", "score": 1, "replies": []}, {"body": "I feel attacked", "score": 1, "replies": []}, {"body": "My AMD calls that expire today...", "score": 1, "replies": []}, {"body": "i need this so bad. thanks man.", "score": 1, "replies": []}, {"body": "Too late I fomoed into BYND yesterday", "score": 1, "replies": []}, {"body": "Good post. There will be plenty of trains to jump on.", "score": 1, "replies": []}, {"body": "“Opportunity in the market is everywhere”\n\nFuck! I’m missing out *even more* than I initially thought! 😱😱😱", "score": 1, "replies": []}, {"body": "Really appreciate this. But you cant tell me I didnt miss out on LK. I saw their share offering opportunity tuesday night and forgot about it the next morning following retards here on AMD and TSLA instead. I really regret not mentioning it myself in the nights thread because we all should have been on it. Did you know LK 1/10 40c from open yesterday to peak today was a 500 bagger? As in, 2k-->1 million in two days. I will never live down this missed opportunity as it was the opportunity of a lifetime. That one was game over. But thank you, thank you for the good words. There are indeed massive gain opportunities everywhere if you choose your entries well. Godspeed to all of us, may we never pass up the next 10 bagger staring us in the face again, because there will be many more to come.", "score": 0, "replies": [{"body": "1. Stop following WSB during market hours.It's a distraction\n2. You want to trade the stocks that institutions are active in. Volume from tutes is what makes these type of trades not random  WSB talk.\n3. Create a watchlist. You should have at minimum 40 stocks on the list\n4. Sort the watchlist by rvol\n5. Follow the volume.\n\nI caught the LK trade yesterday, simply because it was on my watchlist and had a high rvol. Caught it again today for the same reason.  Also hindsight is 20/20. LK was up 10%+ and the IV is over 100%. There was not any intelligent reason to hold overnight.", "score": 7, "replies": [{"body": "What platform do you make your watchlist on?", "score": 2, "replies": [{"body": "Thinkorswim.", "score": 2, "replies": []}]}, {"body": "Is there a way to sort by rvol on Robinhood?", "score": 1, "replies": [{"body": "No, you need a real broker to do that", "score": 3, "replies": []}]}]}, {"body": "All you need is SPY and AAPL calls for now. AAPL is going to beat earnings so by calls past the end of january into February and you will be fine. Also the big hedge of the market SPY is the real deal and again buy a month longer expiration. Weekly is a bit risky because if it drops you can get fucked but longer expiration will give you time to recover.", "score": 2, "replies": []}, {"body": "How would you even find news about a stock like LK? Is there apps that could tell you about potential happenings on tickers nobody knows about?", "score": 2, "replies": [{"body": "I've been playing LK almost every day for two weeks. Got burned last Friday when I was greedy for 40+. Watched it go down this week and shook my head, saw someone comment tuesday night \"LK :(\" and checked the news, saw the share offering and thought hey that's a good opportunity, proceeded to get distracted by some other shitpost about fucking RIOT and only remembered LK when my secondary account started mooning half an hour in on LK 40c I picked up on Monday. Fuck me. I had every reason to go all in at open and get rich and I forgot about it because of a cluttered mind at open putting RIOT and AMZN on my front page instead of good ol LK with the once in a lifetime share offering buy up opportunity. I apologize to all of you for not shouting about the share offering because we all should have been on that train. I want to see some serious gain porn from this play because it was the biggest one anyone could make that I've ever witnessed.", "score": 6, "replies": [{"body": "Newby here, can you please explain why the share offering resulted in the higher LK price? Online articles indicate it was due to new product announcement.", "score": 1, "replies": [{"body": "The stock was being pulled downward all week in anticipation of the new share offering, allowing them to be snapped up at low prices in high volume, resulting in a quick move upward to where it peaked last week at 40 and beyond that today. The news was released to coincide with the offering and make the pump that much harder", "score": 1, "replies": [{"body": "You're saying that the buying pressure from the low stock price due to anticipation of the offering overpowered the selling pressure from the offering itself? Is this a common occurrence with share offerings? Don't stocks tank when lots of shares are offered? How did you know it would go up? \n\nI'm not sure if I'm a complete retard, but everyone talks about pton lockup expiry in March and how the stocks gonna tank it's ass off. Not sure why it's diff here.", "score": 1, "replies": [{"body": "Look at the graph. The offering itself happened after hours tuesday and pulled the price down as low as 32.5 very quickly. That immediately pulled back to 34 premarket and then it was off to the races at cash open. You've heard of pump and dump? This was dump and pump. I believe the price movement in the days leading to the offering was orchestrated by insiders", "score": 1, "replies": [{"body": "following your newsletter", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I needed to hear this", "score": 1, "replies": []}, {"body": "You're saving lives", "score": 1, "replies": []}, {"body": "Great content, not shitpost.\n\nit will break your heart if you think about the number of shares you had in the past. \n\nthe percent gains are the important metric", "score": 1, "replies": []}, {"body": "There is always another trade developing. Always!", "score": 1, "replies": []}, {"body": "Thank you 🙏", "score": 1, "replies": []}, {"body": "I think r/investing is missing you Mr Rogers", "score": 1, "replies": []}, {"body": "Is there any good resource for determining what the support levels of a stock are?", "score": 1, "replies": [{"body": "WizDaddy", "score": 1, "replies": []}]}, {"body": "Do you trade the same handful of stocks over and over again and just don't bother with anything else?", "score": 0, "replies": [{"body": "I only trade a max of 3.5. But I really worship those four. Jack of all trades is master of none.", "score": 0, "replies": []}]}, {"body": "Lol gay", "score": -1, "replies": []}, {"body": "Any good resources you’d recommend", "score": -1, "replies": []}, {"body": "Markets move in cycles. Once you figure it out you’ll be rich", "score": -1, "replies": []}, {"body": "Not only fake but also gay", "score": -2, "replies": []}]}
