{"title": "first few options trades killing me", "selftext": "Recently started trading options by starting with credit spreads. First few went well, but my current positions are killing me!\n\nI have an AAPL sept 25 107/112 put spread that I felt pretty good about at the time, but it's dipped to sub 110!\n\nI placed a sept 18 iron condor on IWM at 110/115/131/136 when it was hovering around 123, and now it's at 115!\n\nMy SPY sept 18 iron condor at 194/199/222/227 is also tanking. \n\nSo my question is... With all the negative news looming about an epic global meltdown, should I cash out now and just take this epic loss? Or do I have enough time for a little recovery? \n\nI recently learned that it's better to protect the downside move in an iron condor as it's easier for stocks to drop in price than to increase. Is this correct?\n\nThanks guys! :/ ", "id": "3hut6q", "created_utc": 1440169046.0, "score": 8, "upvote_ratio": 1.0, "num_comments": 25, "comments": [{"body": "There's no good reason for this selloff. Fed minutes were dovish, bonds are up. China is old news at this point. Oil is holding 40.\n\nIt's possible some sort of bad news comes out now and pushes it lower, but I definitely see it going back up based on current fundamentals.\n\n>should I cash out now and just take this epic loss\n\nI would at least roll the trade if I had a credit spread go in the money.", "score": 3, "replies": [{"body": "I would disagree.  The Fed is dovish only because China is showing weakness and in turn the world economy is perceived to be extremely fragile.  \n\n\nThe Fed being dovish only increases uncertainty of when a rate will happen.  There is a weird situation happening where the Fed being dovish is actually bad for equity because investors were expecting a rate rise in or a little after September.  Since it looks like that is not going to happen, equities are selling off as investors move money back into bonds.  \n\nChina's first glimpse of economic well being, the PMI numbers, showed contraction.  This foreshadows possible bad numbers coming out of China.  It is definitely not old news, and it is further increasing the volatility in the Chinese market that spills over into global equities.  Oil stocks have been selling off as a hut glut of supply and a slowing Chinese economy worry its investors.\n\n\nAll this in tandem with an incredible bull market for U.S. equities the last couple of years makes it ripe for a correction.  I expect next week to downtrend.", "score": 3, "replies": []}, {"body": "I really think this is just the market overreacting to news about China's slump and that there's going to be a turn around within a couple weeks. I'm just hoping the turn around happens fast enough to bring all my positions back in the green haha", "score": 2, "replies": []}, {"body": "If you cannot see the logic behind this selloff then you're not putting enough thought into it.", "score": 2, "replies": []}, {"body": "If oil doesn't hold 40 I'm expecting 32s eventually.", "score": 1, "replies": []}, {"body": "Fundamentally, I'm bearish. The market has been in a bull market for too long, we were due for a correction for about ~1.5 years now. \n\nTrading-wise, I pray for a bull market so that I can get out of all my tested spreads on the put side! Only thing I can do now is to roll down the untested side every time the market tanks; hoping for a bounce so I can lose money on my call side too for a change, and get out of my put side. \n\nBut I don't think any bounce we get, if any will make any iron condors or put spread put prior to this week whole. My entire goal now is reduce cost basis and look to get out as soon as theta on my spreads turn negative and/or gamma gets unmanageable. ", "score": 1, "replies": []}, {"body": "*There's no good reason for this selloff. Fed minutes were dovish,  bonds are up. China is old news at this point. Oil is holding 40.* \n> This is why I wanted to brake my PC today...this sell off is totally irrational!\n\n", "score": 1, "replies": []}]}, {"body": "Here's a thought that I keep in mind that I have been using successfully all year.  The SPY has been inside of a range all year long. 204 - 212. It's just these past few days that caused the premium sellers a lot of pain.\n\nAnyway, when the SPY is at 210+ish as a rule I do not put on any new bull put spreads.  Same goes with bear call spreads when the SPY is near 204-206.  It just doesn't make sense. The risk / reward isn't there.\n\nAs far as your losses go, always remember this: It's painful to take a series of small losses, but it's even more painful to file chapter 11, so, I've been told.  Good luck!", "score": 4, "replies": [{"body": "Here's another good rule of thumb I just remembered that you should write down.  When the SPY as at it's upper Bollinger band, do not put any new longs on.  Vice versa when it's the lower one for shorts.", "score": 4, "replies": [{"body": "Exactly.  And often IV is inversely related on those.", "score": 3, "replies": [{"body": "Bingo!", "score": 1, "replies": []}]}]}, {"body": "I think I'm gonna hang on until next week to see if any positive news comes out. \n\nI still have hope in my SPY 194/199 side of my iron condor.\n\nMy SPX 2000/2005 is a little concerning though since its currently at 1993.  \n\nAAPL and IWM is just making my heart sink right now haha", "score": 2, "replies": [{"body": "I've got Qs sold too and some additional SPY 195/175s. You can pry those out of my cold dead hands. :P", "score": 1, "replies": [{"body": "I have faith but It may be dumb faith at this point :| ", "score": 2, "replies": [{"body": "Even though it may not feel like it, we are still in a bull market. Long until wrong, my friend!", "score": 2, "replies": [{"body": "The way you guys go about trading is just a total losing strategy. Hope and faith is not what makes money nor is ignoring what the market is telling you. You can hope and pretend we're in some magical bull market but as of right now you should be managing risk.", "score": 0, "replies": [{"body": "You have no idea about any of my methodology or risk management.  You're making assumptions on my strategies based off comments I made that you intentionally took out of context. Like a bad trade; Next.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Big picture is HUGE and something I still struggle with. Should set a tab on your workstation to auto open a scan of all the sectors and another tab with the SPY or SPX daily chart.  \n\nhttp://finviz.com/screener.ashx?v=211&t=XLY,XHB,XRT,XES,XOP,XLF,KRE,XLU,XLP,XLE,XLV,XBI,XLB,IYR,IYT,XLK,FXI,EEM\n\nThat ^ is a sector scan. Credit to /u/OPT_HUNTER for that one. ", "score": 1, "replies": []}, {"body": "Here's a good reference http://i.imgur.com/qKUYIsf.png\n\nIt's call a Point and figures chart.  All it is, is price action. There's no volume, and if price doesn't change the data doesn't move forward. It's one of the cleanest and simplest ways to look at big picture data.  Now look at the range the SPY has traded in for almost the entire year.  This has been a premium sellers dream. Now, perhaps, it got too obvious and the trend is changing. It will take a few days to know for sure.   \n\nAlways buy rehashed old news, but this one might have something to do with pricing in a SEP rate hike. I doubt it, but can't know for sure.", "score": 0, "replies": []}]}, {"body": "i think a lot of us are in a not-so-great spot right now.\n\nA lot of our credit spreads that are still within the tent of the trade are getting inflated because of volatility.\n\nReally what it comes down to is your opinion. You shouldn't trade based off anybody's opinion but yourself.\n\nIf you think this is the end, we're crashing; you may cash out here because IV will only increase and your credit spreads are going to get more expensive.\n\nif you think it's a minor correction with an upside to come within your expiration, you can stay in.\n\nNobody knows, but sept expiration is about 28 days away, so it's a bit short. You could potentially roll, or you could just let em go.\n\nMaybe set up a stop loss (mental); if you lose 50% of your credit, you exit. Something like that. It's really up to you, nobody can tell you how to trade.", "score": 2, "replies": [{"body": "Wouldn't rolling out at this point cause me to take in a further loss? For example, my sept 25 AAPL 107/112 spread would turn into a debit if I moved it out to say 95/100 right? \n\nAlso, I've read that people say you should sell out once you lose 50% of your credit, but, maybe this is due to my lack of experience or understanding of the system, my tos always shows my trades in the red after I place them. \n\nI feel like 28 days would be enough time for a little recovery, but it's kind of risky lol. ", "score": 2, "replies": [{"body": "Yeah not sure about rolling, but dont do it unless u get a credit. \n\nLike i said its your call, vix is huge now though. \n\nJust keep your sizes small. ", "score": 2, "replies": [{"body": "Isn't it okay to roll up/down for no credit, to reduce expected losses or margin req, or even just to delay assignment if you think this is a dip in the market?\n\nIt seems to me that if you have unlimited patience, you should be able to roll eg. a short put down and forward repetitively until you get lower than the stock price and it expires worthless. It may take a long time and you might be compounding losses as the put prices increase (but still making trades for around 0 credit), but as long as there's time value to reap and the company doesn't go bankrupt, won't you eventually come out on top? (With ages of lost opportunity cost perhaps, as you've been selling all that time value premium.)\n\n\n\\* Edit: I think I have a bag-holder mentality on this. I think this is similar to holding a dividend-paying stock forever after it's crashed, until it pays itself off. Earning dividend is like earning premium. A risk is that the div may be slashed. Analogously the short put may go deeper ITM and the premiums and bid/ask spread gets worse.", "score": 1, "replies": [{"body": "I've read up on options rolling before and have watched lots of videos on it, but I haven't fully grasped the concept. So if I roll my position further out, let's say from AAPL 107/112 to 95/100, what would happen to the credit that I originally received? Would the new position cancel out the credit? The only benefit I see from doing this is to mitigate potential losses by extending more time for the option to move back into a positive position. Am I right? ", "score": 1, "replies": [{"body": "You would roll it with a limit order that specifies the minimum credit (or max debit) you receive. I'll use a simpler example (for my sake!)... say you're short one 112 put that expires today and you don't want it assigned. Say it's worth $4, and you want to roll down to 100 strike for nearest expiration with no debit. The nearest is Nov... the 100 put is about $4.50. Say you factor in the bid/ask and put in a limit order for .40 (instead of holding out for .50 or more and it might not get filled).\n\nSay you originally got $2 for the 112 put. Now you've bought it back at around $4 so that's a $2 realized loss, but you got $4.40 credit selling the 100 put. So you now have $2.40 cash (per share), and are short a put that is worth -4.50.\n\nDoes that make sense? You keep the credits you've got from selling, and are trading your short position to a roughly equal-priced short with a smaller strike and a farther off expiration. If you must avoid debit trades, you may be trading for more expensive short, that will cost more to get out of.\n\nIt lowers the price you're committing to (strike), it lets you hold onto a position that's down (instead of being forced to exit at a loss due to expiration --- but remember an option can be exercised at any time so you're not guaranteed to be able to hold it), and it gives you more time to let your plan work, since it's not working at the moment. On the other hand it gives the market more time to work further against you.\n\nSee http://www.optionsplaybook.com/managing-positions/rolling-cash-secured-puts/\nThey recommend \"You should usually roll out the shortest possible time period. That way, you will be faced with less market uncertainty.\" So for example, instead of rolling down to 100 you might roll to Sep11 108, still for around $4.", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "About 1,000 point drop on Dow today? Anyone", "selftext": "[deleted]", "id": "3hu6sm", "created_utc": 1440157784.0, "score": 3, "upvote_ratio": 0.58, "num_comments": 19, "comments": [{"body": "Go home you're drunk.", "score": 8, "replies": []}, {"body": "I think it will be down, but 1000 points would be historically bad ", "score": 3, "replies": [{"body": "not % vise ", "score": 2, "replies": [{"body": "True. I doubt Black Monday will ever be topped. A greater than 22.5% loss in a single day is nearly unimaginable. ", "score": 2, "replies": [{"body": "yeah, fuck that, id be ordering ammo way before that number", "score": 1, "replies": []}]}]}]}, {"body": "no", "score": 4, "replies": []}, {"body": "Wtf? No", "score": 1, "replies": []}, {"body": "I think today will see a modestly small decline, followed by another big drop on Monday.", "score": 1, "replies": []}, {"body": "buy the dip", "score": 1, "replies": []}, {"body": "one day yes, today hmm tough call there", "score": 1, "replies": []}, {"body": "all bearishness aside, 2000 on the sp should give us a bounce.", "score": 1, "replies": []}, {"body": "the vix is at 22 today, will get troublesome if it takes out 25 today", "score": 1, "replies": []}, {"body": "I think it will turn around today.   Guess we will see.", "score": 1, "replies": []}, {"body": "https://www.tradingview.com/x/rthCR17M/", "score": 1, "replies": []}, {"body": "maybe Monday if all hell breaks loose in Asian markets.", "score": 1, "replies": []}, {"body": "I'd wait to jump in till Dow reaches 13800.", "score": 1, "replies": []}, {"body": "It will have to turn around today. We just have to wait and see, as always in this market. ", "score": 1, "replies": []}, {"body": "Friday was the 9th largest drop in the history of the Stock Market.\n\nhttps://en.wikipedia.org/wiki/List_of_largest_daily_changes_in_the_Dow_Jones_Industrial_Average\n\nBear market is here. I wonder what the Federal Reserve will do to reinflate this bubble again. I suspect No interest rate hike in September and more QE down the road. Even if the Fed does raise rates, they will end up cutting them again and then reapplying QE. Too bad none of these options have ever worked though.\nhttps://www.youtube.com/watch?v=e2wTdcvSffY\n", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Gotta love Asset inflation right? \nIt's ridiculous. They are destroying the middle class with these policies. They need to just let it go. Until the debts are liquidated there is never going to be a real recovery. But people don't want to deal with the pain. So they instead, want to extend this fleeting moment only to make it worse down the road. \n\nIt's like people never learn from history. So they have to be crushed by consequences. \n\nI agree with you bro. Things are going to get a whole lot more interesting in the coming months. The Currency wars is looking real from where I'm sitting.", "score": 1, "replies": []}]}]}]}
{"title": "Do you think Apple and Disney will make it back to $120 per share?", "selftext": "[deleted]", "id": "3hw73t", "created_utc": 1440190017.0, "score": 7, "upvote_ratio": 0.89, "num_comments": 11, "comments": [{"body": "Yup", "score": 8, "replies": [{"body": "I think Disney will bounce back lightly with Star Wars and Shanghai opening. Media is hurting do to lower revenues so ABC and ESPN will need to turn it around. \n\nApple scares me. Phone companies are not subsidizing as much and I think mobile device sales will begin to slow. On top of that, the Apple Watch and Apple music aren't doing so great so Apple will really need to pull of the Apple TV with deals with content providers. \n\nThat being said, I bought 90 shares of Disney and 100 shares of Netflix today.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "pretty obvious, comparing[ cord cutters\n](https://www.google.com/trends/explore#q=cord%20cutters%2C%20cord%20cutting&cmpt=q&tz=Etc%2FGMT%2B4) to [cable](https://www.google.com/trends/explore#q=cable%20tv&cmpt=q&tz=Etc%2FGMT%2B4)", "score": 1, "replies": []}]}]}]}, {"body": "Yes, but what is your horizon and tolerance for unrealized loss?", "score": 3, "replies": [{"body": "[deleted]", "score": -8, "replies": [{"body": "> I have no tolerance for any sort of loss. Could I afford to take a loss? Sure. Am I willing to? No.\n\nlol good luck with that", "score": 3, "replies": []}]}]}, {"body": "I used to work in an elementary school; so let me tell you, Star Wars **is** bigger than Frozen. But with that said, I feel like the merchandising for Star Wars occurred *before* its release, so the release in theaters is going to bring a comparatively reduced cash flow because you couldn't very well sell Elsa dolls and backpacks to kids until after they fell in love with the movie; Disney saw profit from the theaters *and* from merchandising when they released Frozen, but that entire half of the Star Wars market has already been capitalized on.\n\nNonetheless, $DIS is going to go back up. I can't tell you how long that might take; I only recently started investing in the stock market and quite frankly, this recent downturn scares the crap out of me.", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I trust Disney very, very much; and I'm sure the Marvel brand will carry its weight for the foreseeable future.\n\nI actually don't know anything about this Shanghai Disney news. It is by nothing other than the grace of God that I sold out of $DIS on August 4th at $121.90. So, I've been watching the biotech industry, which hasn't been as affected by this downturn.\n\nI made about 7% on $ACI today, also. It's a strange time for energies (I've lost about 50% on $SUNE, and I believe solar has nothing but growth so I'm staying long on that note). What are you doing to stay afloat in this market?\n\n(To clarify: I day trade with some liquid assets, e.g. $ACI, but I also have some sleeper stocks that I expect to grow over time, e.g. $SUNE.)", "score": 1, "replies": []}]}]}, {"body": "Almost certainly. It's just a matter if you're able to stomach the losses in the short term.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You have no clue what you're talking about and it would do you well to realize that before you lose your lunch.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You have to keep in mind expected returns, minus a time premium, from Star Wars are already priced in. So, if you believe it's going to be a good play it would do you well to figure out not only why Disney will bring in xyz, but also why its metrics will exceed priced in expectations.\n\nIf you believe Star Wars is going to lift Disney you should explain why your expectations are beyond the market's. If you can't quantify the markets expectations then you have no argument.", "score": 1, "replies": []}]}]}]}]}, {"body": "I do not think that Apple reaches 120 dollars per share this year. Not unless they release iPhone 7/7 (which is not going to happen in 2016, right? I have not been following their trends for a while here, so correct me if I am wrong). \n\nBesides, new Star Wars movie coming out this year, so there's so hope as well for Disney...unless it turns out really bad, of course. It will  most likely give Disney a nice bump for quite some time. \nThe potential is here for both of them, we just have to wait and see, I guess. ", "score": 1, "replies": []}]}
{"title": "VIX (Volatility Index) records its largest weekly percentage increase in history this week", "selftext": "", "id": "3hwhe9", "created_utc": 1440194546.0, "score": 11, "upvote_ratio": 0.87, "num_comments": 23, "comments": [{"body": "Check out a monthly chart...October 1987 from 20 to 172...lol ", "score": 3, "replies": [{"body": "That was VXO", "score": 1, "replies": [{"body": "http://i.imgur.com/74qImSr.png\n\nIs this different? I dunno I just typed VIX into freestockcharts lol", "score": 1, "replies": [{"body": "Anything before 1990 was calculated a little differently. \n\nIn the space of five days VXO went from 25 to 150, so your point is completely correct. ", "score": 1, "replies": [{"body": "Ahh ok thanks!", "score": 1, "replies": []}]}]}]}, {"body": "Where are you getting a monthly chart?\n\n", "score": 1, "replies": [{"body": "freestockcharts.com has it! :)", "score": 1, "replies": []}]}]}, {"body": "and may go to 50 monday, the way this market is behaving", "score": 2, "replies": []}, {"body": "officially up +118% for the week ... yowza", "score": 1, "replies": [{"body": "how did you get 118%? it started on Monday at 14.32 and ended today at 28.03 - that's 96% unless my maths is off :/", "score": 1, "replies": [{"body": "It gapped up on Monday. You use Friday's close as the initial measure, or: [weekly chart](http://stockcharts.com/h-sc/ui?s=%24VIX&p=W&b=5&g=0&id=p13214523130)", "score": 1, "replies": [{"body": "always assumed a weekly chart was from Monday open to Friday close. you mean to say it is from Friday close to Friday close?", "score": 1, "replies": [{"body": "The weekly candle is from Monday open to Friday close.\n\nThe weekly percentage change is from Friday close to Friday close.", "score": 1, "replies": [{"body": "hmm, check out the factset chart in this article:\nhttp://www.marketwatch.com/story/this-might-be-the-correction-investors-are-looking-for-2015-08-22\n\nthe also cite 96% for the weekly\n\nmay I ask, what is your source for this?\n\n\n> The weekly candle is from Monday open to Friday close.\n> The weekly percentage change is from Friday close to Friday close.\n\n", "score": 1, "replies": [{"body": "http://stockcharts.com/h-sc/ui?s=%24VIX&p=W&b=5&g=0&id=p21699905746\n\nTop right: +118.47%\n\n>The weekly candle is from Monday open to Friday close. The weekly percentage change is from Friday close to Friday close.\n\nMy source is myself. You can deduce it by reading the chart... and comparing it with the daily chart.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Well it sounds about right but it's still surprising to see. Thanks for sharing", "score": 0, "replies": []}]}, {"body": "This is the cash. The current front month future went from around 15 to 20.", "score": 1, "replies": []}, {"body": "when all is said and done we will see the vix at 75 at least once before year end.", "score": 1, "replies": [{"body": "Why's that?", "score": 1, "replies": [{"body": "I think a 30% or more crash is coming in the upcoming months", "score": 2, "replies": [{"body": "Why's that? I am genuinely curios - I am new to this game. ", "score": 1, "replies": []}]}]}]}, {"body": "8/1/11 to 8/8/11 went from 23.66 to 48", "score": 1, "replies": []}, {"body": "you know trouble is on the horizon, big trouble Vix looking very bullish on both long and medium term frames.", "score": 1, "replies": []}]}
{"title": "What stocks have the craziest valuation right now?", "selftext": "NFLX has PE of 250 right now which I find incredible. What other stocks are way overvalued in your mind?", "id": "3ht9bq", "created_utc": 1440133076.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 20, "comments": [{"body": "Stocks with a PE of NULL lol. Tesla?", "score": 6, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "How is P/E not extremely important?", "score": 2, "replies": []}]}]}, {"body": "Amazon is worth hundreds of billions despite not making any money, I find that incredible. Netflix is another great example with its PE in the hundreds.", "score": 6, "replies": [{"body": "$AMZN $NFLX Looks like these big boys are all selling to preserve their 2015 profits. I predict another 8% to 12% downside today.", "score": 2, "replies": [{"body": "deleted", "score": 1, "replies": []}]}]}, {"body": "Shak", "score": 3, "replies": []}, {"body": "Coal companies are pretty overvalued right now.", "score": 2, "replies": [{"body": "lol", "score": 2, "replies": [{"body": "I'm serious.", "score": 2, "replies": [{"body": "I agree they are melting cubes but I don't think coal stocks warrant 'craziest' over valuation at less than 0.2x Sales.\n\nWhat is your valuation of them? Zero?", "score": 1, "replies": [{"body": "Looks like it.", "score": 1, "replies": []}]}]}]}]}, {"body": "tesla, netflix, amazon\n\ntech companies are notorious for this since new investors always think it's the next best thing. ", "score": 2, "replies": [{"body": "Lemmings.", "score": 2, "replies": []}]}, {"body": "$ACI volume with a spike, looking for opening moevents\n$CLTX nice movements, looking for setups with min risk.", "score": 1, "replies": []}, {"body": "deleted", "score": 1, "replies": []}, {"body": "Stocks are priced based on future earnings. PE's are past earnings. So a high PE doesn't really mean that much. ", "score": -2, "replies": [{"body": "I'd like to see the 2016 balance sheets you have.", "score": 1, "replies": [{"body": "I'm getting downvoted because people don't understand how the stock market works. Stocks work on expectations, estimates, etc... A stock will move based on an analyst estimate. It's also why Tesla and Amazon are worth so much, despite negative EPS.", "score": 1, "replies": [{"body": "You're still buying something on hype and with the expectation that at some point it'll be worth what you paid for it. You can be a lot safer by buying things that are already worth what you're paying for them.\n\nI'm afraid to look at what TSLA, AMZN, and NFLX do if this correction gets worse.", "score": 1, "replies": [{"body": "You're always buying on expectations it'll grow. What makes a stock grow? Future earnings. It doesn't matter if a company has a trillion dollars in cash. If they lose 50% of their contracts, the stock will plunge because it affects future earnings.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Been doing some research on AVXL.", "selftext": "I've been doing research on numerous articles for avxl as it is a company that has massive promise and there is a very good amount of upward pressure on this stock. This primarily a result of the phase 2a trial, however I've done some personal research on the science of it, because the financials are irrelevant, what everyone wants to know is if the science is good. \n\nThus I consulted my 28 year old sister who is currently done taking a 5 day a week 3 hour a day crash course on biology. She has also taken organic chemistry so I figured that she might know something. Anavex specifically says that it unfolds proteins in the brain that are linked to the neurodegenerative diseases. These proteins that were once folded in a correct way so that their functions were proper have now folded in a way that makes sense energy wise but not function wise. Thus they have folded incorrectly and this is what spawns the diseases. \n\nWhile anavex plus claims to cure this by simple unfolding the proteins and keeping them like that, my sister mentions that there are about 250-400 different types of proteins in the brain, so unfolding specific ones is very very difficult. Furthermore all proteins are made of 21 basic building blocks so this pill could turn out to cause massive detrimental side effects that have not been encountered. I say this because targeting a specific protein based on what it's made off could accidentally trigger other ones to unfold. This makes the science much more questionable, since it's very early to tell. \n\nThe human brain is the organ we know least about so there is the most possible risk in this bio sector. I caution any of you that are playing AVXL seriously (5000$ and up) to re asses your risk and to take a step back from all the bullishness. I really think this could help people with Alzheimer's but if you've read \"flowers for algernon\" this could take a different turn, especially with something as delicate and mysterious as the brain. \n\nTL DR: Science for the wonder drug is not just hard it's fucking 5% probability of success hard. ", "id": "3hsciu", "created_utc": 1440116279.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 27, "comments": [{"body": "I am three years into my neuroscience PhD, and while not an expert in this exact field, nothing you said really makes any sense. Targeting specific proteins is not magic, its actually fairly reliable. The fact that proteins are made of 21 amino acids is not a problem at all, and the numerous types of proteins is still not a problem. One type of protein contains a specific number and arrangement of amino acids, folded in a certain way, covered with a specific number, type, and arrangement of associated molecules. Saying that there are too many types and they are too similar for a drug to be accurate is like saying that the mail service will never work because there are too many houses, even though they all have unique addresses. \n\nThe problem with Alzheimer's research is that there is not silver bullet to cure it, only a multiple of drugs to alleviate symptoms and slow progression. Without wanting to give the whole sub a neuro lesson, Alzheimer's has two main hallmarks - Beta plaques and Tau tangles. One occurs outside the cell, disrupting cell to cell communication, while the other occurs within the cell preventing the movement of certain signaling molecules and disrupting other cell processes. One drug can't fix both problems, and currently we don't know how to perfectly address either problem individually.\n\nThe science here is actually really solid. Again, it can't and won't cure Alzheimer's, but as far as alleviating symptoms, improving quality of life, and slowing disease progression it looks very promising. Especially enough to make a successful company out of.\n\nEdit: There is a little too much making fun of OP for my liking. I don't expect people to have a understanding of cutting edge neuroscience in an investing forum. That being said, his post should probably have been phrased as a question, not something to be taken as fact.", "score": 20, "replies": [{"body": "> There is a little too much making fun of OP for my liking.\n\nMuch (perhaps most) of the content in this sub is absolute shit (I'm certain I've contributed some myself) and deserves mockery.", "score": 4, "replies": [{"body": "Really, I WANT to hear concerns like this!   Even if they're dumb, they usually elicit valuable responses like orfane's.  The OP gets an upvote from me because nobody should ever feel hesitant to bring up a concern about a stock -- if its valid I want to know why!  If its not valid I want to know why!   :)\n\nEdit: and seriously take a look at the posts in this thread!   Just WOW!", "score": 3, "replies": [{"body": ">Edit: and seriously take a look at the posts in this thread! Just WOW!\n\nGood point.", "score": 3, "replies": []}]}, {"body": "mocking someone for trying to understand is like teasing a fat person at the gym.  at least it sparked an interesting discussion.  \n\nwe are all here to learn, so i think we need to lay off the rhetoric a little you dumb faggot.", "score": 1, "replies": [{"body": "That was so unimaginative that I actually feel sorry for you and hope you do better with your next reply.  If you're gonna go, then go; don't half-ass it ... I'm insulted by the lack of effort you put in.  I'm almost curious what \"lay off the rhetoric\" means to you, but I'm afraid any attempted explanation may give me cancer.\n\nBut no, I wasn't talking about mocking someone for trying to understand.  I was talking about mocking someone for thinking they understand something on the basis of absolutely nothing.  That and mocking the fucking innumerable shitposts that even 120 mods can't seem to mitigate.", "score": 1, "replies": [{"body": "good lord i was just joking.  next time ill use an emoji or something.", "score": 2, "replies": [{"body": "Alright then, fuck the fatties at the gym.", "score": 2, "replies": [{"body": "lets grab some TBEV and smooth this over", "score": 2, "replies": [{"body": "http://i.imgur.com/bGaA2dw.jpg", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Good to know, thanks! ", "score": 1, "replies": []}]}, {"body": "Isn't part of the idea of anavex plus that it combines aricept and anavex 2-73 and may tackle both beta and tau?  Serious question and I'm seriously ignorant.   I think aricept tackles plaques and 2-73 goes after tau tangles?   I dunno if I am way way off base though.  This is all way over my head  Thanks!", "score": 1, "replies": []}, {"body": "FUCK YEAH BABY. This is the type of response I was hoping for. I understood full well that obviously a protein has its own unique combination, and that making a drug that targets that specific one is possible, however what if the pill only wishes to unfold the ones that are causing the disease and accidentally unfolds the ones that are folded normally. If there is a possibility of this, this could throw the whole thing off. \n\nI appreciate the time you took, and I sincerely hope you aren't bullshitting.", "score": 1, "replies": []}, {"body": "lol, but he talked to his sister who has done a high school bio class... wtf/ ", "score": 0, "replies": []}]}, {"body": "As I understand it, they're not unfolding proteins, they're preventing misfolding.  Also, I asked my sister and she said YOLO.", "score": 11, "replies": []}, {"body": "Cleared phase 1 trials already, side effects were basically nausea at higher than clinical doses.   10 of 12 patients on unoptimized dosages showed improvement, all requested the trial be extended for them.   Search the yahoo message boards on AXVL for p300 and you'll see some very scientific back and forth on the effectiveness of anavex's measurement.\n\nAlso anavex claims to TREAT, not cure.\n\nIn short, so far the science presented is solid.  It may be hard, but it appears anavex -- at least on initial results -- does the hard stuff well.", "score": 3, "replies": []}, {"body": "For what it's worth I'm a chemical engineer with an extensive organic chemistry background in product R&D.\n\nWhen pharma companies make new drugs, a lot of times, for the sake of money and time, they use a top down approach. Back in the day they used to take plants that contained molecules with specific functional groups (carboxylic acids, amines, aromatics, sulfides) that showed promise in treating something, or it was something they thought might work.\n\nSo basically they would take a plant and send it through a plasma stream to pretty much annihilate it into a multitude of compounds. Compounds would break up, rearrange, fuse together, etc. They would get this nasty black gel that they had no idea what was inside of and start testing.\n\nThey would pipette the disease they were trying to prevent into a petri dish and drop some of the black gel onto the disease and see if it stopped growing. If it did stop growing, they would then take the gel and send it through a liquid chromatrograph and separate out the compounds that were created after the plasma injection.\n\nThey would then prepare hundreds of petri dishes with the disease in them. Then they take each individual fraction of the column after the separation and drop it onto the petri dishes with the disease and see which of those compounds stopped the disease stopped growing. If any of them were successful, then they go to NMR, GC/MS, FTIR and figure out what the exact compound comprises.\n\nThis is obviously a rudimentary explanation but you get the premise. The point is a lot of the time when a drug works it's not from purely an extensive theoretical background, it's just the end result using clever methods to derive the final product. Basically as long as it works that's all we care about. \n\nWe are getting pretty good at targeting specific receptors in the brain nowadays. Actually a lot of the trouble is adding protecting groups to the molecule so it doesn't get destroyed in the stomach or liver. It is Alzheimer's though so it's a long shot if it works but worth the ride. \n\nEver see Deep Blue Sea? Shark brain. Hot English doctor. Samuel L. Gets bit in half. That's the key.", "score": 3, "replies": [{"body": "They specifically screened for sigma-1 receptor agonists", "score": 2, "replies": [{"body": "I just lol'd at your username after my last edit.", "score": 2, "replies": []}]}, {"body": "Thanks for the post! It's a very hood practical explanation. ", "score": 2, "replies": []}]}, {"body": "Honestly, I'm just waiting for one of these to be the drug from the beginning of I Am Legend.\n\nDuct tape futures, kids, that's where it's at.", "score": 2, "replies": []}, {"body": "The Anavex drug is an agonist for the sigma-1 receptor. Activating this receptor induces heterodimerization with the muscarinic-1 receptor. The S1R-M1R complex is involved in the misfolded protein pathway. In Alzheimer's there is an accumulation of misfolded proteins, so by increasing the activity of these proteins involved in refolding misfolded proteins, you are not only preventing the accumulation of further misfolded protein, you end up removing some of the already existing misfolded proteins. Prior Alzheimers treatments simply tried to clear the misfolded proteins without preventing more from accumulating...they were treating the symptom, but not the cause. Anavex's drug combo treats both the symptom and the cause.\n\nThe drug doesn't unfold proteins. It takes the misfolded proteins and refolds them into their proper structure. It is not specific for beta and tau, it's just your body's natural mechanism to refold ANY misfolded protein\n\nEdit: That doesn't mean this stock is a sure thing though. As with any experimental drug, they won't know until they try it in people. This is just a far better approach than has been previously tried, so if it works the possibilities are enormous.", "score": 3, "replies": [{"body": "You had me at heterodimerization.", "score": 6, "replies": []}, {"body": "So my (rudimentary) understanding was that Amyloid Beta results from improper cleaving of Amyloid precursor protein, and that the Beta molecules then clump to form plaques. Preventing misfolding wouldn't really help with this correct? As the problem isn't misfolding but improper cleavage of the protein. Or am I missing something? My research is much more system oriented, molecules confuse me.", "score": 1, "replies": [{"body": "http://www.ncbi.nlm.nih.gov/pubmed/25230234\n\nAbstract\n\nIn general, proteins can only execute their various biological functions when they are appropriately folded. Their amino acid sequence encodes the relevant information required for correct three-dimensional folding, with or without the assistance of chaperones. The challenge associated with understanding protein folding is currently one of the most important aspects of the biological sciences. Misfolded protein intermediates form large polymers of unwanted aggregates and are involved in the pathogenesis of many human diseases, including Alzheimer's disease (AD) and Type 2 diabetes mellitus (T2DM). AD is one of the most prevalent neurological disorders and has worldwide impact; whereas T2DM is considered a metabolic disease that detrementally influences numerous organs, afflicts some 8% of the adult population, and shares many risk factors with AD. Research data indicates that there is a widespread conformational change in the proteins involved in AD and T2DM that form β-sheet like motifs. Although conformation of these β-sheets is common to many functional proteins, the transition from α-helix to β-sheet is a typical characteristic of amyloid deposits. Any abnormality in this transition results in protein aggregation and generation of insoluble fibrils. The abnormal and toxic proteins can interact with other native proteins and consequently catalyze their transition into the toxic state\n\nEdit: I'm definitely not an expert on Alzheimer's, so take my quick google research with a grain of salt. I do however understand biology very well and I see logic in Anavex's approach. ", "score": 1, "replies": []}]}, {"body": "Thank you, I now have a much better understanding and have no doubts this is a decent shot. I'm glad my idiocy caused this conversation, it's cleared up my, along with others questions.", "score": 1, "replies": []}]}, {"body": "http://imgur.com/gallery/ItJB523", "score": 1, "replies": []}]}
{"title": "Guys, wtf", "selftext": "Look at any weekly chart out there and get your head together. We are just starting down the hill and momentum is gaining. Anyone jumping in on calls or going long right now deserves the loses. Good time to buy more I keep hearing. Fuck no it's not. Give it a few weeks, let it keep dropping harder and then take another assessment. \n\nAlso fxe is on its way up long term. USD is coming back from orbit. Commodities will rally before anything else\nApple calls now? Really? \n\nEdit - also, please don't cry if the market does a quick 180 short term. Always remember it doesn't owe you anything.", "id": "3humn4", "created_utc": 1440166138.0, "score": 19, "upvote_ratio": 0.91, "num_comments": 22, "comments": [{"body": "[deleted]", "score": 12, "replies": [{"body": "RemindMe! 1 month \"People are calling for a large downswing and here the market is at near all time highs.\"", "score": 7, "replies": []}]}, {"body": "Puts I bought yesterday 110 are actually down now. Glad I dumped most at the open.\n\n*Edit:* Oh shit!", "score": 6, "replies": [{"body": "you gone done wrong", "score": 14, "replies": []}, {"body": "I've learned this lesson too many times. I just sleep in now and wake up 3 hours into the trading session. That way I won't sell during any weird swings in the morning.", "score": 5, "replies": []}]}, {"body": "People losing their minds because the market is correcting. I have had recurring buy orders for the last few years and they're all being hit right now. I'm happy. I don't mind that my portfolio is down 100K, it's part of life. I made a lot of money last few years on the market, I'll take some tax losses now but I'm a buyer. Their are good companies at discount rates right now. Don't try and time it, if you believe in the company than buy it and hold. GE, DIS, APPL, MSFT, BP, XOM all good strong companies and they'll weather the storm. \n\n\n&nbsp;\n\nThis has been your YOLO talk off the roof...please be advised the author of said message is sitting in a dark corner sucking his thumb and crying. Go to your happy place ppl", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Next week we'll have a rally at some point...maybe not Monday but we'll rally next week and I'll be a lot happier about my buys then ;)", "score": 1, "replies": []}]}]}, {"body": "I mean, the market's not actually doing too badly today. Heck the BNY China select index is actually up for the day.", "score": 2, "replies": [{"body": "Sike", "score": 3, "replies": []}, {"body": "I'm talking big picture. Of course there will be up days on the way down. I'm sure a lot of people here will be fine and know how to navigate. this PSA is for the rest.", "score": 2, "replies": []}]}, {"body": "Got in on VXX and TVIX to ride out these times of darkness...", "score": 2, "replies": [{"body": "Is it too late to get into vxx and tvix?", "score": 1, "replies": [{"body": "it's a binary 20% gain or loss, with odds stacked towards loss. ", "score": 5, "replies": []}, {"body": "Its up another dollar.  Its Friday and who knows what Monday will bring.  To me its more of hedge as I am losing on other stocks so its not all gravy.", "score": 1, "replies": []}]}]}, {"body": "completely agree", "score": 1, "replies": [{"body": "Did u end up getting those VIX spreads for aug sept octo dec?\n\nI only could afford jan calls. At least im up on that", "score": 1, "replies": [{"body": "just calls", "score": 1, "replies": [{"body": "Shit. 16 strike? Expiring next wednesday? Congrats buddy. ", "score": 2, "replies": [{"body": "thanks bruh", "score": 1, "replies": []}]}]}]}]}, {"body": "RemindMe! 3 Months", "score": 1, "replies": [{"body": "Messaging you on [**2015-11-21 15:40:51 UTC**](http://www.wolframalpha.com/input/?i=2015-11-21 15:40:51 UTC To Local Time) to remind you of [**this.**](https://www.reddit.com/r/wallstreetbets/comments/3humn4/guys_wtf/cuar3ug)\n\n[**CLICK THIS LINK**](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/wallstreetbets/comments/3humn4/guys_wtf/cuar3ug]%0A%0ARemindMe!  3 Months) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! cuar4is)\n\n_____\n\n|[^([FAQs])](http://www.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^([Custom])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^([Your Reminders])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^([Feedback])](http://www.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^([Code])](https://github.com/SIlver--/remindmebot-reddit)\n|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Hm fxe up again. How bout that. You're welcome.", "score": 1, "replies": []}, {"body": "Market actually looks oversold as opposed to a bigger bear rally. This correction was long overdue but I highly doubt we see this going on much longer.", "score": 1, "replies": []}]}
