{"title": "MSFT entry point?", "selftext": "I thought I was buying the dip at $206 earlier this week but it is continuing to go lower. Do you anticipate a spike before and after earnings and this is a great entry point? Looking to hold long term, >5 years.", "id": "ht0e2x", "created_utc": 1595008444.0, "score": 13, "upvote_ratio": 0.64, "num_comments": 41, "comments": [{"body": "These kinda posts are ridiculous. “I thought I was buying the dip at $206 now its $3 lower. But I plan to hold 5 years” lol", "score": 71, "replies": [{"body": "I'm also only buying 1 share", "score": 49, "replies": [{"body": "My one share of MSFT is down 7$, should I make my own thread about it?", "score": 16, "replies": [{"body": "Yes, when you own 2 shares you own microsoft.", "score": 6, "replies": [{"body": "And it’s plural.  Microsofts.", "score": 5, "replies": [{"body": "No its not.", "score": -2, "replies": [{"body": "When you buy two.. ok", "score": 6, "replies": []}]}]}, {"body": "Oh good I can tell Bill Gates to stop infecting people with his fake vaccines.", "score": 1, "replies": []}]}]}]}, {"body": "Nah it's a Robinhood user who bought $1 of Microsoft.", "score": 1, "replies": []}]}, {"body": "If you’re long, the fluctuation over the next couple of weeks should be meaningless.", "score": 64, "replies": [{"body": "I bought 100 shares at 213 AMA", "score": 8, "replies": [{"body": "Sell a covered call, nice and OTM, start making back some money.", "score": 1, "replies": [{"body": "Yeah haha Im long MSFT and sold a covered call for the IV premium from earnings for 7/24. Feelsbad when you’re down 5% after a few days. Guess I’ll be selling ccs for a while", "score": 2, "replies": [{"body": "What's a ccs", "score": 2, "replies": [{"body": "Covered call", "score": 2, "replies": []}]}]}]}]}, {"body": "yeah.. look at the last 5 years on msft, this is literally a blip on their track record. buy MSFT and fucking forget about it, dont worry about 'buying the dip'\n\ntime in the market > timing the market", "score": 12, "replies": []}, {"body": "Tbf many tech stocks jumped as much in the last 3 months as they would have in 4 years. So holding bag isnt that unimaginable if it turns out that the last 3 months are going to be reset", "score": 1, "replies": []}, {"body": "That’s not what long means", "score": 0, "replies": []}]}, {"body": "Similar buy-in as you. I wouldn't worry too much about it, check back in 5 years.", "score": 21, "replies": [{"body": "Wouldn't worry too much???!?\n\nIf Microsoft has not risen in 5 years there won't be a stock market.", "score": -4, "replies": [{"body": "I'm buying bow and arrow companies stock to prepare for the next stone age.", "score": 6, "replies": []}]}]}, {"body": "If you plan to hold for at least 5 years then a good entry point for Microsoft is ___________.\n\nFill in the blank with whatever the current price is because there is never a bad time to buy Microsoft stock if you plan to hold for at least 5 years. Do you think that possibly getting Microsoft for $10 cheaper is really going to matter in 5 years?\n\nJust buy and relax and then do like the rest of us and just setup a Google Alert to alert you if there is news of Steve Ballmer coming back to Microsoft. As long as that alert doesn't go off, you will be fine no matter what price you buy at.", "score": 20, "replies": []}, {"body": "just buy jesus christ", "score": 49, "replies": [{"body": "Nice try, evangelist.", "score": 16, "replies": []}]}, {"body": "Ur fine with long hold, dw", "score": 11, "replies": []}, {"body": "Lmao I bought 40 shares on Wednesday. Didn’t even know what price it was trading at. It’s Microsoft. Every major corporation in a America runs their software. Buy it.", "score": 11, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Any thoughts on Google as it's the only FAANG stock that is below its pre-covid highs?", "score": 2, "replies": []}]}, {"body": "I’m at 175 and I’m buys like 40$ a week when I see it’s red", "score": 3, "replies": []}, {"body": "If you're holding long term, buy now. This dip is decent enough to where you will make profit in less than a year since MSFT is always growing.\n\nIf you're doing short term, like maybe less than a year I would buy Covid-19 stocks such as AZN or MRNA.", "score": 4, "replies": []}, {"body": "MSFT is always a buy. I wouldnt wait, this thing will keep going up.", "score": 3, "replies": []}, {"body": "Just bought a handful of shares at 202, thinking 10 years.", "score": 2, "replies": []}, {"body": "Posts like these are really living proof of the amount of dumb money leaving and exiting the market.\n\nNo wonder Goldman Sachs and JPM made a killing this quarter.\n\nIf your timeline is 5 years, what’s the difference of a few dollars in the price of the stock? Buy now and DCA if it drops. It’s that simple.", "score": 2, "replies": []}, {"body": "I  have 25 shares at $210, I might be under but thats okay. I know it will continue to grow, its close to its estimated value unlike Apple. So I'm bullish and I might buy more.", "score": 2, "replies": []}, {"body": "Nearly everyone here is going to tell you to just buy because they'll always go up. Don't count on it. Plenty of people have lost their ass thinking that way.\n\nI like MSFT and have a position at an average of about 112. As of today, I wouldn't pay more than 179 for it. That doesn't mean I'm right, and that doesn't mean they won't continue to go up, but I have a method and I stick to it. I have never lost money this way and have beat the index over 20 years. That said, I have certainly missed out on big run ups.\n\nIt's a simple method and it's based on fundamentals. Fundamentals don't have as much influence on stock price in a situation like we have now (and have been fostering for nearly a decade now), but over long periods of time they always do. \n\nSo I'm not buying now. I'm sure I'll get downvoted to hell and told I'm a moron, but this has always worked for me and has protected me from three crashes in the last 20 years.", "score": -3, "replies": [{"body": "You're not a moron. You're a disciplined investor. Thank you for sharing.", "score": 5, "replies": []}, {"body": "just buy and shut up", "score": 6, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Ummmm... go f u c k yourself?", "score": -7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Haha what a moron. I don't feel the need to dig through two decades of account history to show some dipshit on reddit my rate of return, you're right. So yeah, \"case closed\" I guess. Idiot.", "score": -7, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "I'm not getting defensive, you're just an obvious moron. Believe me or not, it doesn't matter, but expecting people to provide records to back up a meaningless comment on reddit, when the bit you have an issue with is tangential at best? 100% dipshit. I've wasted more than enough time already just responding to you.", "score": -2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Weird how you said \"bye\", yet continue to make comments.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "hsowfa", "created_utc": 1594958455.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 41, "comments": [{"body": "Pretty sure most of the Fortune 500 is using DOCU lol", "score": 11, "replies": [{"body": "That was my logic when I bought $220C lol but I’m not so sure about it anymore. Prolly hold it for a few more days but doesn’t look good", "score": 3, "replies": [{"body": "Yeah, theta would be scaring me a tad", "score": 4, "replies": []}, {"body": "Sell a call above it and make it a spread.  Don't do this if you are using a play brokerage account like Robinhood.", "score": 2, "replies": []}, {"body": "I mean, murica seemingly can't really handle the pandemic, so I think they have a bright future", "score": 1, "replies": []}]}, {"body": "bUt tHaTs oNlY 500 cOmPaNiEs", "score": 1, "replies": []}]}, {"body": "You've got this, diamond hands, it's going to rocket and you'll be in great place!!!", "score": 5, "replies": []}, {"body": "Hold pussy! You still have 9/18. Once Tech Rebound Docu will follow nicely. Don’t sell for the loss unless expired tomorrow or in view days.", "score": 7, "replies": [{"body": "I really want to...been debating....but seeing Netflix drop 12% kinda scared me", "score": 2, "replies": [{"body": "Netflix has been way over priced. Think about all the alternatives (Amazon has prime, google has YouTube...)", "score": 3, "replies": [{"body": "True.... GUH.", "score": 1, "replies": [{"body": "Lolll, always think about competition", "score": 1, "replies": [{"body": "Yea Docu also has a few...", "score": 1, "replies": [{"body": "#bothbadcalls?", "score": 1, "replies": [{"body": "I believe so lol", "score": 2, "replies": [{"body": "#moneyprinterdoesntgobrrrrrrrrrrr", "score": 1, "replies": [{"body": "I may have to convert to Jpowellism.", "score": 1, "replies": [{"body": "Just buy some dinar", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "This", "score": 1, "replies": []}]}, {"body": "Welcome to the world of legalized gambling lol.", "score": 3, "replies": [{"body": "Word. I convinced my wife it’s not. She may be paying a visit to the neighbor’s husband after this, to discuss an intervention ofcourse.", "score": 2, "replies": [{"body": "Oh wow, so that's all it means when my wife puts other men's penises in her mouth??", "score": 3, "replies": []}]}]}, {"body": "Holding $220 9/18 and $210 8/21. Not super thrilled about it but haven’t bailed yet. Just one solid day and I’d close the 8/21. Two months is an eternity in this market, but I’d settle just for close to breakeven here. Tomorrow (today for those not on the west coast) likely going to hurt more.", "score": 3, "replies": [{"body": "Same boat with the 210's. Down about 40% on a $4k worth of options. Need a couple of face ripping days to get out even 🤞", "score": 2, "replies": []}]}, {"body": "In the same boat as you but with $240 09/18s. Averaged down to $8 with these dips the last few days and going to dump next time it has a pop. Not buying any calls on anything that’s run up anymore until there’s a big dip.", "score": 2, "replies": [{"body": "Pretty much what I’m thinking about...not much upside and a lot of downside at this point. Even if DOCU rallies past 220, I don’t see my calls worth that much more...", "score": 1, "replies": []}]}, {"body": "I’m sitting on 260c 8/21 DOCU and AAPLE 450c 8/21 I’m holding. Just like jpow is holding my nads.", "score": 2, "replies": [{"body": "Will you hold mine too?", "score": 2, "replies": [{"body": "Wife’s boyfriend only 🙅‍♂️", "score": 2, "replies": [{"body": "Was worth a shot", "score": 1, "replies": []}]}]}]}, {"body": "Stripe? What?", "score": 2, "replies": [{"body": "Sorry meant to say Square lol", "score": 2, "replies": [{"body": "Maybe in 2021. Who knows", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "F. Meant to say Square. Been working on something using Stripe lol the Loss must be causing the delirium.", "score": 1, "replies": [{"body": "That project better print because those calls will not for the moment", "score": 2, "replies": [{"body": "Seriously", "score": 1, "replies": []}]}]}]}, {"body": "I bought the weeklies in June and got fucked. You’re smart enough to buy time. You should be fine", "score": 2, "replies": []}, {"body": "Netflix tanked because they torpedoed their rest of the year numbers in their call. Said this year was front loaded for subs and announced estimates lower than expected. Buy Netflix.", "score": 2, "replies": []}, {"body": "Adobe put out a Competing product to Docu and they can probably offer it cheaper.", "score": 2, "replies": []}, {"body": "**I am a bot. Is this submission violating the [content guide](https://www.reddit.com/r/wallstreetbets/wiki/contentguide)? Vote below.**\n\n| **Remove It** | **Keep It** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=hsowfa&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=hsowfa&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=hsowfa)\n___\n ^comment ^will ^disappear ^--- ^14 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 1, "replies": []}, {"body": "Hold DOCU until before earnings, I'm $300 9/18 and $250 9/18", "score": 1, "replies": []}]}
{"title": "Nio bag holders consider...", "selftext": "New positions in these two weekly charts\n\nMOMO and jmia. \n\nMOMO is tinder or match of China. Love me long time \n\nJmia is amazon of Africa. Slower cause they deliver on elephants that’s why it hasn’t skyrocketed yet\n\nAll that aside both charts look good. MOMO seems to have formed a bottom. Jmia seems to have consolidated at top of BB band and holding the 20/50 MA\n\nThinking doing some calls a couple months out By closing out my airline and cruise puts since AzN gonna report some vaccine shit Monday im sure whatever it says no one will read it and pump the market", "id": "hswef7", "created_utc": 1594995252.0, "score": 17, "upvote_ratio": 0.81, "num_comments": 42, "comments": [{"body": "Wait so you’re telling me NIO isn’t gonna work out", "score": 15, "replies": [{"body": "😂 I’m gonna do nio calls when it settles selling off around $9", "score": 4, "replies": [{"body": "Fuck Man I bought in at 13", "score": 12, "replies": [{"body": "Same lol RIP", "score": 6, "replies": [{"body": "Me too woke up this morning to a fucking shit show", "score": 3, "replies": []}]}, {"body": "I bought in literally the day before the big crash at its ATH", "score": 3, "replies": []}, {"body": "Buy after it goes up like 2-300% then sell on the pull back. That's how a real trader does it.", "score": 2, "replies": []}]}, {"body": "It got downgraded to $7 so I would be cautious about that", "score": 4, "replies": [{"body": "Analysts are tards their price targets mean dick. It’ll settle around $9", "score": 12, "replies": [{"body": "Just pick the analyst that confirms your position, there’s always one. That’s what I do.", "score": 6, "replies": []}]}]}]}]}, {"body": "Lost $400 on calls this week. Glad I joined this sub to help me realize my true potential.\n\nGood news is I bought a put yesterday that is up $4.00", "score": 10, "replies": [{"body": "😂😂 welcome to the club", "score": 5, "replies": []}]}, {"body": "SPCE is gonna keep rising to thirty imo", "score": 4, "replies": [{"body": "Fly baby fly", "score": 1, "replies": [{"body": "rocket ship emojis", "score": 2, "replies": []}]}]}, {"body": "Already lost 50% on MOMO calls since last week 😤", "score": 4, "replies": [{"body": "Double down!", "score": 1, "replies": []}]}, {"body": "Bro if you are single and beta in China your mom has to go to a park with a picture and a resume to try to get you laid.\n\nIf you think we got problems here with bots, fake profiles, IG girls, its going to be ten times worst in China.\n\nWhat am I saying this could actually work. Li is not getting laid though.", "score": 3, "replies": [{"body": "Not the worst long term play. Some big bank just downgraded China stocks. This is gonna piss them off and they are gonna pump their shit stocks up", "score": 0, "replies": [{"body": "Now that I think about it. The CPC will probably back them too. Since is just another data point for the MASSIVE surveillance and digital life infrastructure that is China.\n\nThey will probably be few to no bots, Chinese digital lives are tighted up to so many things you have a better way to verify identity than anywhere else in the world.", "score": 2, "replies": [{"body": "Yah got into nio today for a fuck u pump from China. And one long shot contract for momo", "score": 1, "replies": []}]}]}]}, {"body": "i thought you were an eternal 🌈🐻, but now im convinced that you’re bisexual.", "score": 2, "replies": [{"body": "I’m tired of losing money and need to get some back on meme stock pump :(\n\nWith that said puts on mrna can not go tits up!", "score": 2, "replies": [{"body": "Top confirmed.", "score": 2, "replies": []}]}]}, {"body": "Everyone my NIO $11P 11/20 thanks you for your contribution", "score": 2, "replies": []}, {"body": "Jumia is never going to take off because of the several local domestic comeptition across more business and urbanized oriented african countries (which they don't tell you about and still show stock footage of random villages on CNN despite people having camera phones and you can see the cities on Youtube.)\n\nNigeria, Capital and North Ethiopia, Ghana, Gabon, Rwanda, Kenya, Botswana, Luanda, etc all have a crap ton of local and international competition (mostly private Carribean, European, and some Asian companies not on exchanges) that all compete for deliveries and ecommmerence, until there's consolidation don't expect there to be not only any big rocket out of Africa, but any other region on the planet.\n\nTHe only reason for BABA is because of CCP assisted consolidation. Same with a couple others. You probably won't see consolidation for another few years due to stiff competition.\n\nAlthough South America sees to be in the consolidation process now so the next big ecommerence stock will probably come from there next.", "score": 2, "replies": [{"body": "Yah I was gonna say it’s a consolidation / acquisition play mainly to get into Africa long term", "score": 1, "replies": [{"body": "Too much competion for Jumia to be an acquisition play unless it's to spread Jumia in NA or Europe msking it a more international brand.", "score": 2, "replies": []}]}, {"body": "Wrong. Have you looked at their app download for both JumiaPay and their main app? Compare it to ANY of their competitors. Further, are their competitors listed on an American exchange? Further, they are going to get an injection of capital soon with their offer for more ADS's. Their competors are FLEAS.", "score": 0, "replies": [{"body": "Ignoring ;ocal competition is beyond stupid and several of them have major backing and access to marketing and partnership channels Jumia has to pay massive amounts to even have access to you.\n\nIt's hwy it's not big of a deal and why it's share price is low. This argument was settled awhile ago, if you don't know the background for Jumia then your post is only based on a bias for stocks on an American exchange (which is filled with companies basically bankrupt in all but name or companies with decent prices but zero growth) and likely a belief that Africa doesn't have anything else.", "score": 1, "replies": [{"body": "We have a difference of opinion.", "score": 2, "replies": [{"body": "No, one is a fact and has been reflected in the share price and mentioned at their earnings call, and the other is you.", "score": 1, "replies": [{"body": "What ever..", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Atleast their not Netflix bag holders", "score": 2, "replies": [{"body": "This is what they get for announcing ozark only has one more season left 😒", "score": 4, "replies": [{"body": "Bruh I have qqq calls expiring today and Netflix is single-handedly making sure they are otm. Fuck Netflix", "score": 3, "replies": []}]}]}, {"body": "NIO just got downgraded FYI", "score": 1, "replies": [{"body": "I know", "score": 1, "replies": []}]}, {"body": "MOMO upward potential aren't that high. Airline is my go to when I'm too pussy for the tech market.", "score": 1, "replies": [{"body": "Better go long term and delta and southwest only. Other two might go bankrupt", "score": 1, "replies": [{"body": "I bought the best Canadian airline: Air Canada which is way safer than those US airlines because they started doing cargo deliveries by removing plane seats.", "score": 2, "replies": [{"body": "To the moon!", "score": 1, "replies": []}]}]}]}]}
{"title": "AMZN C $3200 7/24", "selftext": "My current average price is $66.88. Should i keep averaging it down or just give up and take the loss? This is sorta acting like TSLA now just stuck in one place and getting fcked by theta \n\n.\n\n.", "id": "ht0erz", "created_utc": 1595008512.0, "score": 17, "upvote_ratio": 0.91, "num_comments": 44, "comments": [{"body": "All of tech is getting theta fucked. Right with you brotha", "score": 16, "replies": [{"body": "Do you think tech will get a boost next week?", "score": 2, "replies": [{"body": "Idk my qqq calls expire today so down a cool 10k today", "score": 7, "replies": []}, {"body": "I believe. It will!", "score": 3, "replies": [{"body": "I think so too. Looking at the chart it is higher highs and higher lows. We might be at a new low at the moment.", "score": 3, "replies": [{"body": "So the question is. Are you still holding or dump it today ?", "score": 1, "replies": [{"body": "I'm massively long in tech stocks, and I will keep buying the dips!", "score": 2, "replies": []}]}]}, {"body": "You were right!", "score": 1, "replies": [{"body": "🚀🚀🚀🚀", "score": 1, "replies": []}]}]}, {"body": "Earnings are early next week its not my money so i say Hold em", "score": 3, "replies": [{"body": "Question is are people buying tech stuff if they don't have jobs??", "score": 1, "replies": [{"body": "When the government pays you to stay home, you have a job being a professional PoS", "score": 1, "replies": []}]}]}, {"body": "some fuck on yahoo finance said its likely tech will keep rallying", "score": 1, "replies": []}]}]}, {"body": "I literally sold everything today, my entire portfolio was tech and I lost $7k this week I’m done till this market starts to calm down after earnings or in hopes of another crash when the fed stops printing", "score": 4, "replies": [{"body": "I’m down 4K from tech, yippy", "score": 3, "replies": []}, {"body": "qqq IS cooling down, it’s been heavy to the upside and is regaining some sanity", "score": 1, "replies": []}]}, {"body": "When in doubt double down", "score": 3, "replies": [{"body": "Ayyyy . Theta gang", "score": 1, "replies": [{"body": "What? That's not theta gang", "score": 1, "replies": []}]}]}, {"body": "Just wait we’ll be good earnings on everything next week yuge Donald pump", "score": 3, "replies": []}, {"body": "I rolled msft back another week and lowered strike to 210", "score": 3, "replies": [{"body": "Yea I thought I was gonna take a quick 15-20% today on msft on that initial dip... but it dipped again and going sideways... I’m out with 30% loss on that play... cash gang for now", "score": 2, "replies": [{"body": "Yeah i thought those 7/17 205 were a sure thing. I dont understand whats going on with this ticker it should be a hot ticket", "score": 1, "replies": []}]}]}, {"body": "If you average down better make it 7/31 for delayed earnings", "score": 3, "replies": []}, {"body": "Dude you're rect.  Take the loss and live ti fight another day.", "score": 2, "replies": [{"body": "Glad i didn't pull out", "score": 1, "replies": []}]}, {"body": "Would sell and take a loss at the bump at open on Monday or Tuesday.", "score": 2, "replies": [{"body": "In the moneyyy", "score": 1, "replies": [{"body": "I know eh congrats man! TSLA went crazy too.", "score": 1, "replies": []}]}]}, {"body": "Down 20k this week but holding my contracts, next week has to be a reversal", "score": 1, "replies": [{"body": "I hope you're up 🚀🚀", "score": 1, "replies": []}]}, {"body": "Current price for that option is $23.53. Ouch that's a big loss.\n\nE: just checked 30 sec after I posted this, now $20.93, get out of this position asap.", "score": 1, "replies": [{"body": "$84 now 🚀", "score": 1, "replies": []}]}, {"body": "This Q is going to be reverse of last. No matter what the earnings are, market is tanking. Including tech stocks.", "score": 1, "replies": [{"body": "Nope", "score": 1, "replies": []}]}, {"body": "I would wait that strike is still possible to hit based on what the chain is pricing in", "score": 1, "replies": [{"body": "Right on! Almost 10% UP 🚀🚀", "score": 1, "replies": []}]}, {"body": " I think AMZN is going up this upcoming week. I bought 1 call debit spread @ 14.55, expiring 7/24. 🤞🏼🤷🏽‍♂️", "score": 1, "replies": [{"body": "Ayyy! $$$$", "score": 2, "replies": [{"body": "Ayyy, got that right! Glad you held and are ITM! Let it rain, playa! 🤑🚀💰", "score": 1, "replies": []}]}]}, {"body": "Had the same call and dumped it today for a sizeable loss. May jump back in for a day trade next week if it runs.", "score": 1, "replies": [{"body": "I'm glad i didn't xD", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "lol", "score": 1, "replies": []}, {"body": "At least something is Fucking me", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "ht12kv", "created_utc": 1595010633.0, "score": 20, "upvote_ratio": 0.81, "num_comments": 37, "comments": [{"body": "If we get super Mario galaxy ported, I'll drink pickle juice out of a beer bong, bet.", "score": 31, "replies": [{"body": "paper mario came out today, might pick that up\n\nbut i'm with you on the galaxy port", "score": 7, "replies": []}, {"body": "I hope you like pickles!", "score": 5, "replies": [{"body": "I hope so too because lately, my bets havent gone my way.", "score": 1, "replies": []}]}, {"body": "Bro please please. I want it to be real just to see this crazy shit 😂", "score": 3, "replies": [{"body": "Can you do a remind me for July 20th? I don't know how and I don't bet unless I'm serious.", "score": 1, "replies": [{"body": "RemindME! 3 days", "score": 3, "replies": []}, {"body": "I'll keep the meme in my head DW. You'll get a reply on here 😂", "score": 2, "replies": []}, {"body": "It's July 20th", "score": 1, "replies": []}]}]}, {"body": "Remindme! 3 days", "score": 2, "replies": [{"body": "Thank you!", "score": 1, "replies": [{"body": "Fuck", "score": 1, "replies": []}]}, {"body": "There is a 41.0 minute delay fetching comments.\n\nI will be messaging you in 3 days on [**2020-07-20 18:48:32 UTC**](http://www.wolframalpha.com/input/?i=2020-07-20%2018:48:32%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/ht12kv/nintendo_big_announcements_monday_the_best_video/fydxzgt/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fht12kv%2Fnintendo_big_announcements_monday_the_best_video%2Ffydxzgt%2F%5D%0A%0ARemindMe%21%202020-07-20%2018%3A48%3A32%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ht12kv)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Fuck it. I second that sentiment. Here here", "score": 1, "replies": []}, {"body": "I guess you won't have to drink pickle juice just yet ;)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Nintendo peaked at 80$ during the boom of the wii. I believe that the switch will outsell that console and the ecosystem will create much more profit per the average customer. I think 120$ is possible.", "score": 2, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "This is the way", "score": 3, "replies": []}]}]}]}, {"body": "Mario sunshine on switch? That’s at LEAST 8 trillion more to the market cap.", "score": 9, "replies": []}, {"body": "Both videos you listed are straight up dedicated rumor Channels. It’s like meet Kevin and his stimulus check videos", "score": 6, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "ya you will probably only make 40% in a few months. better to lose everything next week on amazon right?", "score": 13, "replies": [{"body": "You’re in the wrong subreddit buddy.", "score": -2, "replies": [{"body": "Shut up new guy. Stfu", "score": 5, "replies": []}]}]}]}, {"body": "I feel like most gains are priced in, with new consoles from the other guys and not too many \"new\" games coming this summer I feel better buying Sony tbh", "score": 3, "replies": []}, {"body": "Personally nintendo appeals to the man children of reddit \nDefinitely gonna buy this I've seen how crazy the switches are being scalped \nNot to mention how much switch lite sales they're making since they're the only thing in stock right now \nLowering regular switch production\nTo boost switch lite sales \nNot to mention this direct and the up coming earning calls yea definitely just bought nintendo shares", "score": 3, "replies": []}, {"body": "are you trading the OTC NTDOY?\n\nyou seriously have a $120 PT? \n\ni love the switch and understand the demand. i sold my used one for $450 in march and bought a refurbished one straight from nintendo for $260.\n\nanyway, the games being released is been known for a long time. ring fit was a slight surprise on the upside but everything else is priced in.\n\nfantastic product and great games but i don't see why it would more than double in 6 mo.", "score": 5, "replies": [{"body": " Nintendo peaked at 80$ during the boom of the wii. I believe that the  switch will outsell that console and the ecosystem will create much more  profit per the average customer. I think 120$ is possible. yes NTDOY", "score": 3, "replies": [{"body": "nintendo has ramped up production of new switch untis\n\nyou think they will sell out the next run again? and leave store shelves empty for weeks again?\n\nif that cycle of completely running out, manufacturing and selling out happens 4-5 times, i could see doubling their stock but not before that", "score": 1, "replies": [{"body": "They have already sold out of many games and consoles again in north america and japan. Yes I think the demand is here to stay.", "score": 2, "replies": []}, {"body": "I forgot to mention that the switch is still in the process of being available in china that alone will double sales. Just like it did for the wii", "score": 2, "replies": []}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/cupnhandle don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "When is earnings???", "score": 1, "replies": [{"body": "Forgot that I meant to jump in for Switch Earnings", "score": 1, "replies": []}, {"body": "I believe its july 28th", "score": 1, "replies": [{"body": "August 6", "score": 1, "replies": []}]}]}, {"body": "Mario sunshine 2", "score": 1, "replies": []}, {"body": "Fuck Nintendo", "score": -5, "replies": [{"body": "this man hates money", "score": 2, "replies": []}]}]}
