{"title": "MCD is a buy and here is why", "selftext": "McDonald's is getting expensive. Gone are the days of great deals. Profit margins are up. Revenue is up. And best of all, groceries are up so much that more people will turn to fast food. \n\nIf inflation continues, McDonald's has such a firm grasp on their supply chain they can likely expand profits further with more price increases. And the real estate McDonald's owns will benefit from inflation as well. \n\nBe greedy when others are fearful!", "id": "t1oima", "created_utc": 1645851319.0, "score": 4, "upvote_ratio": 0.57, "num_comments": 46, "comments": [{"body": "You’re paying 26x free cash flow for a business struggling to grow revenues… Seems pretty rich.", "score": 30, "replies": [{"body": "I feel like the only reason McDonalds stock is doing well is because they own their real-estate and their franchise structure benefits corporate. I know they’re far and away more popular than Wendy’s, but Wendy’s literally can’t stay open later than 6 in my area due to being understaffed. Maybe McDonalds offers somewhat better benefits to their employees but I can’t imagine that’s enough of a difference to make it not a future problem if it’s impacting similar restaurants to such a degree. I’m probably just wrong and I’m definitely speculating but that would definitely worry me about buying the stock", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Revenue is up 13% compared to 2020, a year when revenues understandably declined. Revenues have been hovering in low $20B range for the last 10 years. There’s more attractive opportunities elsewhere", "score": 6, "replies": []}]}]}, {"body": "Going to be selling a Filet Mcgnon soon at these prices.", "score": 17, "replies": []}, {"body": "I don't find that remotely compelling. MCD is still expensive and for a boring, lackluster business with poor growth potential.", "score": 8, "replies": [{"body": "In an inflationary environment, the companies with the best supply chains will outperform.", "score": 6, "replies": [{"body": "doesnt look like it", "score": 1, "replies": [{"body": "Technically hasn't mcd done better than most stocks since I posted this? I'm March it was at 222. It's up from there while a lot of other stocks are lower", "score": 1, "replies": [{"body": "It has but it will go down eventually too.", "score": 1, "replies": [{"body": "You think so? I'm willing to take that bet. Still see it outperforming the S&P, I've got a 14% cushion YTD.  You think I lose all 14% of that over the S&P by Dec 31? I don't. In fact maybe I should buy more mcd. Nice dividend. Recession proof product. You think people eat healthy in this environment?", "score": 2, "replies": [{"body": "Because its its getting not going down while earnings are , microsoft and apple are going and their eps isnt decreasing -50%", "score": 1, "replies": []}, {"body": "2% is not even great dividend, pretty mediocre", "score": 1, "replies": []}, {"body": "If i was you i would buy healthcare companies= UNH", "score": 1, "replies": [{"body": "I bought some UNH the second Biden won super Tuesday.  \n\nWhy should I buy more now?\n\nMCD I could see why I might buy more now. Heck the last time i went to an MCD everyone and their mother was paying $13 for an \"adult\" happy meal.", "score": 1, "replies": [{"body": "Valuation always matters, MCD is so overvalued right now it wont move anywhere. There is already bargains on the market", "score": 1, "replies": []}, {"body": "Yea but mcd makes most of their monyes from rents", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "McDonald’s is not even close to a buy and way overvalued.", "score": 13, "replies": []}, {"body": "My teenager asked to stop at MCD the other day for a snack.  I said sure, we don't do that very often. Quarter pounder meal plus nuggets cost $16. Yea, we won't be doing that again.", "score": 7, "replies": [{"body": "Better than $8.29 for a latte at Starbucks. This was Vegas so knew it was expensive. But it was only $1 less not in Vegas. I don’t usually go. Know they’ve raised their prices 2x in last few months and a bunch of stores have closed. I’m skeptical that people will keep paying that.", "score": 4, "replies": []}, {"body": "MCD charges like $5 for their nuggets . You should have just got the meal\n\n\nBurger King charges like $1 for nuggets", "score": 4, "replies": [{"body": "Yes we did that. Meal was $9, nuggets were $5. With tax came out to $16. And he ate it all in 5 minutes.", "score": 3, "replies": []}]}]}, {"body": "While i get where your coming from your just wrong. Mcdonalds is definitely a safe buy because of how little overhead they have and how well ingrained in society they are. But they are actually struggling to grow especially in the current market. They aren’t even close to being the growth play your trying to sell them as.", "score": 10, "replies": [{"body": "19% income growth in last year. \n\n> But they are actually struggling to grow especially in the current market.\n\n13% revenue gain.", "score": -5, "replies": [{"body": "They only grew revenue by 19% because they were down by 10% in FY20. You can't just extrapolate out and expect that to continue", "score": 2, "replies": []}, {"body": "Last quarter they failed to meet extremely generous EPS estimates by $.11 per share. We’ll have to wait and see how they do this quarter to really be able to judge how they are doing in this market but it’s not looking great.\n\nAlso the numbers you cited (larger income growth than revenue growth) indicates some amount of downsizing. The only way income can grow faster than revenue is if they spend less money which while it’s not necessarily a bad thing it’s not exactly a promising metric when looking at a company like Mcdonalds. I suspect some of the less profitable locations where forced/chose to shut down.\n\nAgain not saying mcdonalds *isn’t* a buy. Just that it’s not as exciting as you seem to think and it will probably pay off to wait a month or 2 before jumping into a new position.", "score": 4, "replies": []}]}]}, {"body": "Groceries are up so people turn to fast food.  But McDonald’s is getting expensive and can further increase prices. So which is the better option again?", "score": 5, "replies": [{"body": "Groceries, cook for your kids, do not feed them crap.", "score": 12, "replies": [{"body": "I know this is a stock page but this is so real", "score": 2, "replies": []}]}]}, {"body": "My family can get take out from a sit down restaurant for less than it cost to eat McDonalds. I don’t know how people afford to eat it all the time. I probably get it a few times a year and I’m always shocked at the cost.", "score": 4, "replies": []}, {"body": "OP. McDonalds has the app with deals all the time.\n\nYou can still get a $1 McDouble and $2 Breakfast sandwich.", "score": 3, "replies": []}, {"body": "I don’t like McDonalds due to secular trends in how people eat. People are more health conscious nowadays, so I think that creates a headwind.", "score": 2, "replies": [{"body": "They took away the salads, grilled chicken sandwich, snack wraps and egg white breakfast sandwich!! 😓 (not that it’s that healthy but I do miss their healthier options)", "score": 3, "replies": []}]}, {"body": "McDonald’s announcing the shamrock shake?\n\n-shares skyrocket-", "score": 2, "replies": []}, {"body": "Paying more at Mickey D's, less customers now, shorter lines, guess it's a tradeoff.", "score": 2, "replies": []}, {"body": "would you rather buy apple or microsoft with lower valuation than this bubble stock , look how their earnings are dropping right now -46% net income last quarter=TERRIBLE and the stock is not even moving down how ridiculous", "score": 2, "replies": [{"body": "Operating income is about the same. I'm guessing they took some special write off no?", "score": 1, "replies": []}]}, {"body": "The most compelling case I’ve heard for mcd is as a real estate company as opposed to strictly a fast food business", "score": 3, "replies": [{"body": "...and even that isn't necessarily compelling.  They have a lot of debt associated with their real estate.\n\nYou could argue they have a large moat in their brand - McDonald's is one of the most recognizable brands in the world.  However, this is still tarnished negatively from \"Super size Me\" and as long as the health concern remains, McDonald's is vulnerable.\n\nI would pass on MCD myself.  But OP seems determined....", "score": 1, "replies": []}]}, {"body": "$2.99 for double cheese and fries", "score": 1, "replies": []}, {"body": "Plenty of companies had crazy big-time growth during the pandemic and stimulus that is most likely unsustainable.\n\nEPS  by year:\n\n2017: 6.37\n\n2018: 7.54\n\n2019: 7.88\n\n2020: 6.31\n\n2021: 10.04\n\nDid they *really* grow 59% YoY, or is this a fluke that's going to mean-revert?\n\nI think anyone with half a lick of sense knows the answer to this.", "score": 1, "replies": [{"body": "They don't need to grow at 59% a year to be a good investment", "score": 2, "replies": [{"body": "Stock prices are based on future earnings growth (in this market). Compare MCD with any of the tech giants. How does a company sell exponentially more french fries? Can they charge customers 9.99 a month to enter the store?  \n\nThis is why you're not getting the enthusiasm you expect.", "score": 5, "replies": []}]}]}, {"body": "I think they did really well when they added breakfast all day three years back. That’s gone with their staffing issues.", "score": 1, "replies": [{"body": "Ironically they sold their R&D dept to IBM who is working on automated drive through for them.  Trying to solve staffing issues with AI.\n\nI'm an IBM investor, but not MCD.", "score": 3, "replies": []}]}, {"body": "If they start serving McNuggets for breakfast I will buy", "score": 1, "replies": []}]}
{"title": "Drive Tesla 🇨🇦 on Twitter: BREAKING: First Giga Texas VIN assigned to Model Y Performance reservation holder with March delivery date (and it looks legitimate this time)", "selftext": "", "id": "t1xroi", "created_utc": 1645884103.0, "score": 157, "upvote_ratio": 0.97, "num_comments": 38, "comments": [{"body": "It will be very interesting to see what build quality and overall drivability are like in these cars. I have given them a lot of slack on previous cars because of the promise of these new factories. Now is the time to execute.", "score": 25, "replies": [{"body": "Considering Fremont is a dinosaur facility and the cars from Shanghai are as good as any other brand, I'd expect them to be just fine.", "score": 15, "replies": []}, {"body": "Elon has previously said that build quality is best at the beginning of a production ramp, or at the end when fully ramped. In between is most likely to have issues.", "score": 6, "replies": [{"body": "Yeah but that might’ve been true then and meaningless now with new factories and build processes", "score": -2, "replies": [{"body": ">that might’ve been true then and meaningless now\n\nIt's true in principle. It's a general statement, not one specific to Freemont.", "score": 2, "replies": []}]}]}]}, {"body": "Have a '18 3, definitely wouldn't want an early version again", "score": 5, "replies": [{"body": "No quality issues with my 18 m3. Had delivery issues but no other issues.", "score": 9, "replies": []}, {"body": "my 2018 model 3 was perfect at delivery and still is.", "score": 10, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "same, mine is one of the first tent cars", "score": 1, "replies": []}]}, {"body": "Cries in creaks and rattles 18’", "score": 1, "replies": [{"body": "If it creaks from the front when you turn the wheel that is the control arm and Tesla will fix it under warranty. Source: my 2018 model 3.", "score": 6, "replies": [{"body": "More like the plastic panels in cold weather", "score": 4, "replies": []}]}]}, {"body": "Mine is a \"tent car\" and it hasn't had any of those issues that others see.  The trunk had a minor realignment needed, but I just did it myself, it was quite minor.", "score": 1, "replies": []}]}, {"body": "I wonder how many people will switch to Performance?  I still think it would be smart to go Performance only from Austin.  People want a way to get the structural battery and 4680 they heard so much about.\n\nMight as well collect a few extra dollars while making people happy.", "score": 8, "replies": [{"body": "If I were in the market for a new Tesla, I'd definitely upgrade to performance in order to get an Austin Model Y.\n\nI'd probably get a Plaid Model S though if I were actually buying a new Tesla.", "score": 4, "replies": []}, {"body": "Are they not building LR model Y's out of Austin?", "score": 3, "replies": []}, {"body": "Weren't the ones spotted in the parking lot LRs?", "score": 3, "replies": [{"body": "Based on wheels yes. But maybe they were test builds or they'll swap wheels.", "score": 2, "replies": [{"body": "I guess, but if they're doing LR test builds, then LR production is indicated. \n\nDefinitely possible they were Performance test builds on LR wheels, though.", "score": 2, "replies": []}, {"body": "My guess is they’ll make employee cars first.", "score": 1, "replies": [{"body": "How do employees order the MY from Texas?", "score": 1, "replies": [{"body": "I’m not an employee, but I’m guessing they order and then fill out a form.", "score": 1, "replies": []}]}]}]}]}, {"body": "I’m suspecting they went out of their way to keep the cars as close as possible regardless of the underlying battery style, precisely for this reason. It’s mostly just a manufacturing improvement anyway.", "score": 2, "replies": [{"body": "Why would they change anything?", "score": 3, "replies": []}]}]}, {"body": "I think the most important thing is they committed to ramping with 4680 cells tbh, as much as I am also happy the factory is fully online. 4680 cells is going to push that margin up to 35% and beyond", "score": 2, "replies": []}, {"body": "I just think it’s so cool that American cars are being made in Texas. And not just cars, but the future of automotive.", "score": 2, "replies": [{"body": "Why does Texas matter?", "score": 0, "replies": [{"body": "It doesn’t, really. Just cool to see a new industry growing in another metro.", "score": 1, "replies": []}]}]}, {"body": "Does this signal Austin is opening in the next week or two? Holy shet.", "score": 1, "replies": []}, {"body": "Can’t wait", "score": 1, "replies": []}, {"body": "This isn't breaking news...", "score": 1, "replies": [{"body": "The first post regarding VIN assignment was not ever confirmed to be a legit VIN. This one was", "score": 1, "replies": []}, {"body": "It was breaking news yesterday, it had to make its way to Canada.", "score": 1, "replies": [{"body": "Factory that everyone knew was about to come online _actually_ started production.\n\n_WOWW such breaking news!_\n\nIt's news. It's not breaking news.", "score": 0, "replies": []}]}]}, {"body": "Did Austin get the official green light approval to deliver cars yet?", "score": 1, "replies": [{"body": "Could have. We don't know.", "score": 2, "replies": []}]}, {"body": "Maybe Berlin will be online by next march?", "score": 1, "replies": []}, {"body": "With no rail access, how will Austin produce and deliver product at any scale?  Are there any other auto factories anywhere without a rail connection?", "score": 1, "replies": []}]}
{"title": "Wonder how LEAPS play out? Data from 7/21!", "selftext": "LEAPS are brought up quite a bit.  Some people swear by them and others not so much.  We know they are expensive.  Have you ever wondered how they worked?\n\nI made this excel file back in July when I was doing research on PMCC.  Most of these values were recorded on 7/26 and they are 1/23 leaps.  Here are the results:\n\nCompany    Price    Strike   Delta  LEAP     Current Price   LEAP\n\nAAPL           149.74           110       .81       45.6                 164.45                58.93\n\nXOM               57.79          50         . 7            9.8                 77.7               28.33\n\nAMD        92.05        67.5C    .8     31.05           120.87           57.28\n\nNVDA       193.76     137.5   .8      70.12            241.2            111.00\n\nThe gains on these are pretty substantial.  XOM went from $980 to $2800! You can imagine the returns on NVDA and AMD when they were at 300 and 150 respectively.  I had data from that time but I cannot find it.\n\nFB         372.77       280     .81     115.3              210.12          8.05\n\nPYPL    306.85       230     .81      90.2                110.55          1.08\n\nAnd this is what happens to LEAPS when the stock takes an absolute nose dive.  It is quite painful.\n\nI thought some of you may find this information useful when considering LEAPS and PMCC.", "id": "t1qd4t", "created_utc": 1645857336.0, "score": 25, "upvote_ratio": 0.79, "num_comments": 33, "comments": [{"body": "Markup enabled:\n\nCompany|Price|Strike|Delta|LEAP|Current Price|LEAP\n---|---|---|---|---|---|---\nAAPL|149.74|110|.81|45.6|164.45|58.93\nXOM|57.79|50|.7|9.8|77.7|28.33\nAMD|92.05|67.5C|.8|31.05|120.87|57.28\nNVDA|193.76|137.5|.8|70.12|241.2|111.00\nFB|372.77|280|.81|115.3|210.12|8.05\nPYPL|306.85|230|.81|90.2|110.55|1.08", "score": 27, "replies": [{"body": "I chuckled thinking my Paypal would ever recover to anywhere near 230$", "score": 6, "replies": []}]}, {"body": "Doing backtests on paper LEAPS is a useless exercise. Holding LEAPS is difficult. Most people cannot handle the psychology because the time pressure and swings can be brutal. Meaning it’s all well and good until you get punched in the nose. \n\nMost people that buy LEAPS - as a point of fact - don’t understand why or what they’re doing. What they should be doing is expending far less capital and buying 30-45 DTE because that’s how they actually want to play options. That’s what they have the attention span and nerve to deal with. Instead they play LEAPS and then cry when the market is down 12% and their 372 DTE LEAPS tank. Often they generate alpha and lose it over and over again because they think their LEAP is gonna turn into a 10 bagger. They’ll buy into high volatility. They sell into low. Then they cash out 120 DTE up or down 10% and the. DO IT ALL OVER AGAIN.  Great job wasting 6 months, holding up cap, and basically running to stand still.", "score": 56, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Spend less, buy regular options. They fit your actual timeline better. \n\nIf you want to buy leaps you need to be realistic. They should be part of a longer strategy. Medium duration trade where you hold shares and then basically more shares via LEAPS.", "score": 7, "replies": []}]}, {"body": "Respectfully, I disagree with your assertion of 30-45 DTE being superior to LEAPs with one reason being timing the market being impossible (I understand TA, fundamentals, etc can give you an edge, but the underlying could continue to trade sideways or even down trend over such a short time frame). LEAPs allow for leverage without margin, with a much more forgiving timeframe. Theta decay is almost non-existent if you only hold your LEAPs for a month\n\nYour point of crying about losing money in a market down term for LEAPs feels moot, as they would also be crying when their 30-45 DTE is down with even less time to recover and theta eating away. (Deep enough ITM would mitigate, but it would still exist)\n\nI'm genuinely interested in your counterpoint", "score": 10, "replies": [{"body": "Right. Deep ITM leaps are where it’s at if you’re chill and patient person", "score": 3, "replies": [{"body": "and sell 30-45 DTE covered calls against those leaps", "score": 6, "replies": []}]}, {"body": "Firstly, my main point and I stand by it 1000% is that there is a **psychology to holding LEAPS that is unlike holding stock or regular options. **\n\nSecondly, at no point did I say regular options are better than LEAPS. I stated they are better for 90% of the people that buy LEAPS. \n\nWhy? Because those people want high reward with the lowest possible risk. No shit you say? Buckle up because this is going to hit close to home for many people. \n\nThe problem is that people think that buying LEAPS will give the underlying stock time to climb back up in the event of a drawdown, while still the retaining significant leverage that options afford. To some degree this is correct. If they were using LEAPS properly. \n\nBut no. What do most people do when buying LEAPS? They buy the lowest cost LEAPS (very OTM) they can find and because they have a year or two to sit back and make money they ALWAYS put in more money than they can afford to lose. \n\nWhat happens next? Johnny McOptions put his life savings into very OTM MSFT LEAPS. There’s a drawdown and he sees his investment reduced by 10, 15, 25%. This isn’t money he can afford to lose. He has 343 DTE, is down 25% and panics. What do they almost always do? Wait or sell? Yep. You got it right because they sell. 2 months later MSFT is back at or past their breakeven maybe even 10% up. Guy kicks himself for selling early and losing 25% when they coulda been up 20% had they just held. \n\nNow at what point did Theta come in to play? Right it did not. It didn’t even matter. Nor would it. \n\nOk so why are 0-45 DTE better for these people? Because they are gambling and know it when it’s on those timelines. They will (usually:more often) adjust their expenditure so they are not throwing their life savings at the short term options. \n\nWill they still lose money? Yes. But more importantly the fire will burn them more times in smaller doses (instead of third degree burns across the entire body all at once from LEAPS). And maybe getting burned more times for less will teach them how to not be idiots with their finances. Maybe they’ll even learn how to use LEAPS properly. \n\nWhich is? Buy ITM/ATM LEAPS for leverage along with real stock. 30/70 split or whatever floats your risk tolerance boat. Is it sexy? Yes. Is it 10 bagger sexy? Not unless you’re name is DeepFuckingValue. \n\nHopefully this explanation helps more than just you.", "score": 2, "replies": []}]}, {"body": "Agree 100% unfortunately, I personally can't hold naked ITM LEAPS. You never know when it's the top and you never know how far it will drop. Plus logging in to the account every day doesn't help me either.\n\nIn my example I bought a $90 2023 AAPL and a $60 2023 AMD LEAPS when they were trading like ass the early part of 2021. Eventually I got sick of my capital being held up on the tickers moving sideways for weeks and wouldn't you know POS decided to start their sharp moves up literally the 2 weeks after I sold for a small profit in June.", "score": 4, "replies": [{"body": "This hurts my soul. Don’t feel too bad, that’s also when Cathie Wood also sold all of ARKs AAPL. \n\nIf you’re deep in the money and getting really antsy, sell covered calls against your ITM options. Same number of contracts. Same expiry. Strike price is really up to you. You’re making a vertical (debit) spread out of your long call with no margin/cash requirements (collateral are your ITM calls). \n\nYes it will limit (and cap) your remaining upside, but you will collect a large premium to offset your initial cost. I can tell you that it makes a huge difference psychologically in wanting to sell, especially when you’re in a drawdown and seeing losses in the call offset by gains in the covered calls. \n\nThe nice thing about LEAPS done this way is you can do some magic you normally can’t (easily) do with vertical debit spreads. So for example if you have 190/160 AAPL spread, once AAPL goes under 158 you start getting to a point where you can buy to cover your CC, meaning you just paid yourself for borrowing money from yourself, and removed the upside cap for your long calls. This is great for cyclical stocks that you know are going to take a dump in winter for example, but you’re holding LEAPS and you want some stability and some capital freed up. \n\nHope that makes sense. Good luck.", "score": 9, "replies": [{"body": "Yes that's a good idea to deal with the psychological side of it. I did that on some smaller tickers like SOFI and CHPT. Thankfully closed those out before the big drop that started in November.", "score": 1, "replies": []}]}]}, {"body": "How do you mean generate alpha? Thank you", "score": 0, "replies": [{"body": "Generate capital.", "score": 1, "replies": [{"body": "Kapital", "score": 1, "replies": []}, {"body": "As in the option/leap was at a profit?", "score": 1, "replies": [{"body": "Yes that is correct.", "score": 1, "replies": [{"body": "Ty", "score": 1, "replies": []}]}]}]}]}, {"body": "This is why I play quarterly spreads: I avoid earnings, deploy less capital, and can still sell calls on my itm long call for the 3-5 months I bought. Only drawback is the tax liability.", "score": 1, "replies": []}]}, {"body": "1. Wait til Google splits. \n2. Buy leaps on google..\n3. Sell .1 delta calls weekly... \n4. ????\n5. Profit", "score": 9, "replies": []}, {"body": "Plug in the data on optionstrat. It’s not rocket science. The UI update last week makes it more friendlier.", "score": 8, "replies": []}, {"body": "So much delta I can't find the theta.", "score": 5, "replies": [{"body": "ditto", "score": 1, "replies": [{"body": "Where is Deltagang at??", "score": 1, "replies": [{"body": "Foreal. Wish there was a sub for that and leaps.", "score": 1, "replies": []}]}]}]}, {"body": "(Reddit fully supports tables in Markdown. Just saying!)\n\n| Company | Price | Strike | Delta | LEAP | Current Price | LEAP |\n|---|---|---|---|---|---|---|\n|AAPL | 149.74 | 110 | .81 | 45.6 | 164.45 | 58.93 |\n|XOM | 57.79 | 50 | .7 | 9.8 | 77.7 | 28.33 |\n|AMD | 92.05 | 67.5C | .8 | 31.05 | 120.87 | 57.28 |\n|NVDA | 193.76 | 137.5 | .8 | 70.12 | 241.2 | 111.00 |", "score": 3, "replies": []}, {"body": "thanks… can you help me with this?  i’ve some RCL call options that is already  deep in the money.  $78c exp 2022 Sep 16. stock price is now $83.  i think RCL can still run until Dec 2022.  to maximise my profits, should i sell the Call Options 44 days before expiration date / or exercise the option then? \n\nby my own calculation that i made when i purchased the calls, the call options have reached its my target return.  can these call options still go up in value due to delta/ vega?  if yes i’ll wait until theta kicks in. that way i can be still selling .2 delta calls for a few month.", "score": 1, "replies": [{"body": "If you want to hold the stocks before the expiration date then exercise it otherwise sell it. I’d prefer to sell even if I believe in the company long term but profit is profit for now.", "score": 4, "replies": [{"body": "thanks for the reply", "score": 1, "replies": []}]}, {"body": "dude we are in uncertain times and you are sitting on profits? Take some profits now, reduce your position.", "score": 4, "replies": []}]}, {"body": "I bought leaps on a few things back at the March drop that worked out well. Sure it wasn’t a crazy gain for the time I held it but over 100% on a few of them.", "score": 1, "replies": []}, {"body": "Losses in FB and PYPL takes up all the other gains and a lot more. Overall this leap portfolio is down about 75%", "score": 1, "replies": []}, {"body": "In 2020 I bought a bunch of 1/2023 leaps.  My carnival cruise lines $15 is doing very poorly right now.  \n\nBut the crown of my collection was AMC $1.50 leaps.  Paid $210 for them.  When AMC hit $14.50 for the second time I figured, wow they haven't been that high since 2017... So I sold it.  2 days later I could have sold a 70c for more than that, and could have again every week after.\n\nI just needed to tell someone that...\n\nAlso, it's hard to know when to sell your leaps.", "score": 1, "replies": []}, {"body": "Leaps sucks. I'm down $15k in last 8 months. Unless the market is going wayyyy up and only up then don't buy leaps.", "score": 1, "replies": []}]}
{"title": "Major early warning signs of a coming market crash", "selftext": " \n\nI tried my best to be optimistic. Loading up long positions a couple days ago. [https://www.reddit.com/user/boomerdoomer22/comments/szuf5y/got\\_my\\_full\\_long\\_positions\\_back\\_on\\_today/](https://www.reddit.com/user/boomerdoomer22/comments/szuf5y/got_my_full_long_positions_back_on_today/)\n\nThese were positions that worked out profitable with a quick exit but I have sincere concerns this rally can be setting up something much worse. [https://www.reddit.com/user/boomerdoomer22/comments/t07zyc/big\\_rally\\_like\\_now\\_but\\_4400\\_4500\\_bear\\_risk/](https://www.reddit.com/user/boomerdoomer22/comments/t07zyc/big_rally_like_now_but_4400_4500_bear_risk/)\n\nHere are my thoughts as they directly pertain to stocks/SPX [https://www.reddit.com/user/boomerdoomer22/comments/t13ymz/3900\\_and\\_3300\\_spx\\_is\\_the\\_bear\\_risk\\_in\\_next\\_swing/](https://www.reddit.com/user/boomerdoomer22/comments/t13ymz/3900_and_3300_spx_is_the_bear_risk_in_next_swing/)\n\nHere are some non-stocks warning signs I think we'd see before there was a major market crash.\n\n&#x200B;\n\n* BTC under 25K.\n* NZDJY under 73.\n* NZDUSD under 0.62.\n\nIf these things happen, I think we'll see SPX under 3500.", "id": "t1w0bz", "created_utc": 1645878530.0, "score": 0, "upvote_ratio": 0.13, "num_comments": 35, "comments": [{"body": "You know we can see your post history, right? Like four days ago when you were predicting SPY to 550. Is it possible that you have absolutely no idea how to predict the stock market?\n\nFrankly, for the rest of you, because I don’t care what this guy does, theta gang doesn’t depend on these predictions anyway. Diversify, play with good stocks so you’re able to confidently shift to buy and hold during a down market, and have some money on the side (either cash in your account or via continuous contributions) to keep buying more. And definitely don’t listen to some random guy on Reddit who can’t make up his mind and thinks price of BTC will crash the overall American economy.", "score": 48, "replies": [{"body": "He’s a moron", "score": 11, "replies": [{"body": "And ur a jenius", "score": -1, "replies": []}]}, {"body": "I said what would make me wrong. That happened. I was wrong.", "score": 0, "replies": []}, {"body": "You know I linked all my posts ... right? \n\nI said if we hold 4200 - very good. Nice and bullish. If we break, not good. \n\n&#x200B;\n\nWhen we broke I posted at 4100 saying to look for a 7 - 10% rally. That happened. Now I am saying what I think would follow that. \n\n&#x200B;\n\n\\>who can’t make up his mind and thinks price of BTC will crash the overall American economy.\n\n&#x200B;\n\nI can make up my mind and it's based on what the market does. I don't make up my mind and stick with it no matter what, that's foolish. It has NOTHING to do with BTC. By that logic I also think a crash in the New-Zealand currency brings down the US. Stop being pedantic. What I've explained are EARLY RISK-OFF SIGNALS.", "score": -1, "replies": []}]}, {"body": "your predictions are based on btc abs strength of USD?", "score": 15, "replies": [{"body": "And NZD. Lmao no one gives a shit about NZD, OP definitely comes from New Zealand and that’s all he knows", "score": 6, "replies": []}]}, {"body": "u/satireplusplus please  ban  this  latest  reincarnation of  Holey.    \nHe  only  spams  and  has  nothing theta  related  to   post.", "score": 9, "replies": [{"body": "Agreed", "score": 2, "replies": []}]}, {"body": "Lol ok", "score": 7, "replies": []}, {"body": "Name checks out…", "score": 7, "replies": []}, {"body": "As bitcoin goes, so goes the economy says absolutely no one lol", "score": 6, "replies": []}, {"body": "Man I’m so fucking tired of these “sincere concern about a crash” posts.  You can easily make a bear or bull case for markets at any point in time… develop a strategy and manage risk, and know that trading/investing is individualized and difficult.  Reddit was the most bearish I’ve ever seen early last week and what did we get?  A face-ripping reversal that burned everyone’s puts, followed by dozens of “why is the market rallying when it’s supposed to be crashing??” posts.  Market gonna market! 🤷‍♂️", "score": 6, "replies": []}, {"body": "Head shoulders knees and toes", "score": 6, "replies": []}, {"body": "Holeyprofit returns!", "score": 5, "replies": []}, {"body": "username checks out", "score": 3, "replies": []}, {"body": "Make sure you load up on gold bro or go all cash, you'll be alright.", "score": 2, "replies": []}, {"body": "No one can predict a crash.  It's not impossible because they have happened before, but they're not probable enough to trade in anticipation.\n\nI agree we're in uncharted waters with the highest inflation in 30 years, a major war in Europe, and multiple asset bubbles brewing (crypto, real estate, and some stocks).  I'm thinking that the war creates more uncertainty than the other risks.\n\nI'm keeping my theta positions to shorter term expirations (mostly <30 days), keeping lots of spare buying power, and leaning delta short after big rallies (like Thursday and Friday).", "score": 2, "replies": []}, {"body": "Why does NZD matter lol", "score": 2, "replies": [{"body": "Because he's a moron in New Zealand. Imagine thinking fx moves the equity market in any meaningful way lmao", "score": 1, "replies": []}]}, {"body": "Ya cause everyone knows, the world hinges on the New zealand dollar…", "score": 2, "replies": []}, {"body": "This guy is Dean Black Reddit reincarnated for the 5th time. Google him or search for his past profiles. He changed up his writing style after being criticized for it the last three user names, but there are several other unmistakable parallels.", "score": 2, "replies": [{"body": "This guy? \n\n&#x200B;\n\nPeople should read these scam warnings about that guy. [https://www.reddit.com/r/BeatTheBear/comments/qc1rq3/when\\_will\\_holey\\_profit\\_admit\\_he\\_was\\_wrong\\_about](https://www.reddit.com/r/BeatTheBear/comments/qc1rq3/when_will_holey_profit_admit_he_was_wrong_about)\n\n&#x200B;\n\n&#x200B;\n\n[https://www.reddit.com/r/thetagang/comments/mprpf0/can\\_we\\_all\\_agree\\_that\\_holeyprofit\\_is\\_a\\_permabear](https://www.reddit.com/r/thetagang/comments/mprpf0/can_we_all_agree_that_holeyprofit_is_a_permabear)\n\n&#x200B;\n\nLet's see how this warning ages ... not that I am Dean Black, but just out of curiosity.", "score": 1, "replies": [{"body": "There's an whatthefx account and 2020sbear or something. \n\nNone of that penis-faced morons warnings aged well. If you're 1/100, does that mean you knew your shit? I don't even believe this house of cards the market is propped up on and hope it does go down, yet don't buy his/your (if you are Dean Black) bullshit.\n\nAll of the characteristics are there. Will you start asking people for money in way, shape, or form? That's how we'll know.", "score": 2, "replies": []}]}, {"body": "Can you name the past profiles we should be looking for? So I can look them up and see what the other forecasts were.", "score": 1, "replies": []}, {"body": "Did a bit more research. It looks like the person in question said the risk to look out for was SPX trading 4,000 by EoY during 2021.  I suppose that technically was wrong. But probably a bit better than your forecast, if we're being honest.\n\n&#x200B;\n\n\\>but there are several other unmistakable parallels.\n\nLike good forecasts in the face of random abuse?", "score": 1, "replies": [{"body": "Lol you're definitely Dean Black. Replying \"aloofly\" multiple times over to one comment, obsessed and overrating one comment potentially exposing you (if you weren't, you'd just say idk what you're talking about or ignore), accusing me of being wrong at something I didn't even predict, and downplaying years of bad calls. You really don't learn, do you, Dean?\n\nYou can prove me wrong by never asking for $ here. If, by some crazy coincidence, you're not him, I still feel bad for you. Why? Your behavior is akin to a scammer", "score": 2, "replies": [{"body": "\\>You can prove me wrong by never asking for $ here\n\nPlease give monies!", "score": 1, "replies": []}, {"body": "Holey smokes, batman! I just looked up this Dean fella and YOU'RE RIGHT! He has a newsletter where he charges people $10 a month. \n\nWHAT A FUCKING SCAMMER. He must be making gazillions!", "score": 1, "replies": []}, {"body": "Final multiple aloof comment.", "score": 1, "replies": []}, {"body": "Dean is back. Sickening. I took this motherfucker down last time. Thankfully it looks like he's not getting anymore traction.", "score": 1, "replies": []}]}]}]}, {"body": "NZDJPY opens 100 pips lower and does not insta bounce. This is a fat tail in the Forex markets. That almost never happens.", "score": 1, "replies": []}, {"body": "It’s crashing for sure. \n\nAll the gains since the initial market collapse will be pulled out of the market.", "score": 1, "replies": []}, {"body": "Yeah this is why they say don't take financial advice on reddit. Even the fed probably can't bring us down to 3500. It would take a catastrophe", "score": 1, "replies": [{"body": "\\>It would take a catastrophe\n\nYeah.", "score": 1, "replies": []}]}]}
{"title": "Warren Buffett: Buy Stocks At Wartime", "selftext": "Stocks around the world rose on Friday as investors welcomed talk of renewed diplomacy after Russia's invasion of Ukraine, and as coordinated Western sanctions left Russia's energy sector largely untouched. The U.S. dollar fell and oil prices dipped as investors bet that the sanctions wouldn't have a significant impact on the global economy.\n\nFor U.S. companies, the Russian and Ukrainian operations are small potatoes. Businesses in both countries account for just 1 percent of total S&P 500 sales, according to FactSet, a research firm. But American manufacturing companies and catering companies have been entering the Russian market one after another since the 1990s--until the Crimea crisis in 2014 when many firms reduced their Russian operations.\n\nGM and Ford Motor exited the Russian passenger car market in 2019, after years of struggling to compete against local producers. Exxon Mobil dismantled an exploration-research business partnership with Russia's state-owned oil company Rosneft following the Crimea crisis.\n\nU.S. chemical and agricultural companies are still doing business in Russia, albeit on a smaller scale than before the sanctions were imposed. Dow, which manufactures resin products and industrial tape outside Moscow, closed down 2 percent yesterday. Shares in Caterpillar, which has factories such as excavators outside St Petersburg, also fell 1 percent.\n\nWarren Buffett has warned investors not to buy gold in times of war, as stock prices have a tendency to rise during such periods. The famed investor made the comments in an interview with American media, citing the Cuban crisis and 9/11 terrorist attacks as examples. Buffett's first stock investment was in 1942, when he was just 11 years old. At that time, stocks were depressed due to the intensifying Second World War, but Buffett later recalled that they would have been worth much less if they had been exchanged for gold instead. In spite of falling oil prices in 2015, stocks only declined modestly compared to the 70% plunge seen in oil prices over 18 months.\n\nOn February 24, the price of WTI crude oil surged above $100 a barrel, approaching the record high of $107 set in June 2014. The rise in prices reflects investors' willingness to challenge the ongoing crisis. While ordinary investors may not be as daring as Buffett, understanding the dynamics of the stock market during this crisis will provide a reference for future investments.\n\nsource: [https://www.riskbrew.com/news/621a2c6c0204e20edcf75c18](https://www.riskbrew.com/news/621a2c6c0204e20edcf75c18)", "id": "t1yek1", "created_utc": 1645885962.0, "score": 45, "upvote_ratio": 0.82, "num_comments": 35, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|10 months ago\n**Total Comments**|2|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=t1yek1)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=t1yek1)", "score": 1, "replies": []}, {"body": "Its been working for him since world war 1 lol", "score": 28, "replies": []}, {"body": "McDonalds & Starbucks operate around 1900 stores there combined.", "score": 9, "replies": [{"body": "So my Puts on McDonald's are safe?", "score": 6, "replies": [{"body": "Not with my fat ass keeping them in business. The day you read my obituary smash those puts, bro.", "score": 12, "replies": [{"body": "50% up in the first 5 minutes, your big ass not enough to prevent what's coming!", "score": 1, "replies": []}]}, {"body": "No. Even during wartime I'm sure that McDonald's franchisees need to pay their rent.", "score": 1, "replies": [{"body": "I counted 49 locations closed in Ukraine", "score": 1, "replies": []}]}]}]}, {"body": "Was this written by a Russian?", "score": 12, "replies": [{"body": "Lol the site it’s from is basically all Russia and China knob slobbing.", "score": 7, "replies": []}]}, {"body": "The wealthy have long made profits off war and suffering.", "score": 15, "replies": [{"body": "The money machine", "score": 6, "replies": []}]}, {"body": "bruh whoever invests in a shiny rock is somewhere else anyway", "score": 5, "replies": [{"body": "Lol shiny rock has done very well ytd. Compared to the sp500 it’s done much better.", "score": 5, "replies": [{"body": "yeah and that tells us that it will outperform sp500 in the long run because sp500 ytd didnt do as well as shiny rock", "score": 1, "replies": [{"body": "Lol you buy shiny rock in inflationary periods as a hedge. Always keep a ounce in a safe somewhere. You never know when you might need it.", "score": 1, "replies": [{"body": "yes because I buy shiny rock out of fear because investing out of fear is always better than investing in companies with the believe that humanity will manage and profits will be there despite occassional downturns because Im an idiot", "score": -1, "replies": [{"body": "lol ok retard. People who bought gold made more than you this year. It’s ok. You’ll get em next time. This sub is for traders, not long term investors.", "score": 2, "replies": [{"body": "They made shit this year cause theyre retarded - like me", "score": 0, "replies": [{"body": "Lol if anything your the retard. If the market always has better returns, go buy voo and get the fuck off wsb.", "score": 0, "replies": [{"body": "*your", "score": 1, "replies": [{"body": "Ban", "score": 1, "replies": [{"body": "Jorge Ayala", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Bought his first stock at 11?\n\nI still place orders by chewing up crayons and spitting them out really hard at my phone.", "score": 4, "replies": [{"body": "So…Robinhood?", "score": 2, "replies": []}, {"body": "I didn't know you could do that I'll try later", "score": 1, "replies": []}]}, {"body": "Doesn't look like he's buying much, still has 144B cash stockpiled...", "score": 2, "replies": []}, {"body": "Of course he would say that the war dodging Warren buffet.", "score": 0, "replies": []}, {"body": "Oil to $200 or $300? Russia gas and oil will produce enough revenue.", "score": 1, "replies": []}, {"body": "Yup,  unfertility drugs STONKS.", "score": 1, "replies": []}, {"body": "Gold is outperforming", "score": 1, "replies": []}]}
