{"title": "SPY OTM Bear Put Spread to Hedge Against a 15%-25% Crash", "selftext": "I was wondering if these is a common hedge here. It seems to me you get the best risk reward with using these option as oppose to a long put. Particularly looking at: \n\nSPY Buy 440 03/18; Sell 425 03/18. \nQTY= 2 contracts for $940,\nMax Profit=$2060\nMax Loss=$940\n\nMain reason for this play is to cover $3K of margin. If market tanks margin is paid. If it goes up margin increases to $3,940. I’m not oversstretched either this is on a $68K portfolio.\n\nThougths ?", "id": "sr3c4m", "created_utc": 1644705875.0, "score": 24, "upvote_ratio": 0.84, "num_comments": 32, "comments": [{"body": "I hope Putin waits till the markets open Monday before making a move. I need to hedge some (all) positions.", "score": 16, "replies": [{"body": "They invade wednesday", "score": 6, "replies": [{"body": "They don't invade", "score": 5, "replies": [{"body": "They wait until the following week after the Winter Olympics.", "score": 4, "replies": [{"body": "I agree. If they do, it will be after the Olympics.", "score": 2, "replies": [{"body": "Sorry guys, you can't give different days here. Please tell me when they will REALLY invade now.", "score": 1, "replies": [{"body": "Text Putin", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "Thats a bit expensive play $3,295, hence why I'm looking at the bear put spread. QQQ @ $380 I would buy if Putin strikes this weekend,lol.", "score": 6, "replies": []}, {"body": "It’s time for 🐻 to be slaughtered on next morning Monday.", "score": 6, "replies": []}, {"body": "It isn't terrible. In round numbers, 33 percent chance of making $2k, 50 percent chance at losing $900. The rest is a result in between.\n\n$900 may not sound like much cost, but it is 1.4 percent of the portfolio for five weeks of coverage. Run similar all the time and that's about 14 percent in annual headwind if the market goes up.\n\nIt is also only $2k in coverage in case of decline. That's only about 3 percent worth of insurance on $68k.\n\nI've seen a lot worse..", "score": 4, "replies": [{"body": "In the event of the market going lower, I only care to cover the margin so that I dont get margin called. If there is market crashes and my portfolio decreases significantly I’m not too worried as I’m long and don’t need that money in particular within the next 3-5 years.", "score": 1, "replies": [{"body": "If that's what you are doing, it's a good way to control risk. You are most likely paying a bit of EV for that (long puts mostly have negative EV) because of exactly that reason -- controlling risk if valuable to people. And because of puts very steep skew, making it a spread makes it cheaper more so than, say, with calls.\n\nTwo issues is: \n\n1). If market drops past your long leg are you still covered enough? If so, great.\n\n2). If this works, awesome, but resist the urge to use it to \\_make\\_ money -- these will always be negative EV. They are awesome for risk control, but if you try to get net benefit from market going down you no longer get risk benefit, and it'll likely lose in the long run. It is a semi-common mistake after a few successful hedges.", "score": 1, "replies": []}]}]}, {"body": "You’ll be heading forever. That’s a huge crash", "score": 5, "replies": []}, {"body": "Spreads against the crash are not that great", "score": 3, "replies": []}, {"body": "Don't waste your money it's not going that low this week. Probably will see $436 ish and bounce back up.", "score": 2, "replies": [{"body": "Looking at 3/18 expiration, potentially we have Putin’s invasion and the dreaded 50-100bp hike talks and execution early March. Thats enough conviction to me that we will not see ATH anytime soon. But the market is crazy and you may be right. \n\nI personally think a 420 bounce at the lowest again. It bounced a coiple times in the 440 but we all know that is not going to last long.", "score": 1, "replies": [{"body": "Yeah the issue is most of the time these big low bounces happen before market. The fed machine and AI Algorithms will sweep in and buy the dip very fast. \n\nImo I believe it's already priced in.", "score": 1, "replies": [{"body": "I think the fed will do .33 or .25 rate increase as they say they would stay nimble. In which case its already sort of priced in. We will trade sideways with some ocasional volatility from Putins threat.", "score": 1, "replies": []}]}]}, {"body": "Isn’t this coming week SLD? There have only been 2 months in the last year the market was green during SLD and one was only as a result of holiday deferrals in November.", "score": 0, "replies": []}, {"body": "Agreed. Options interest is at options interest highs at 440. Looks like a put wall that wall street wouldn't want to pay out.", "score": 1, "replies": []}]}, {"body": ">25% Crash\n\nLol", "score": 1, "replies": [{"body": "QQQ already down about 10% add 25% and that is a 35% crash. I’m being positive here and hopefully it doesn’t dive deeper than that.", "score": 3, "replies": [{"body": "??? you may lose a lot of money on your puts, like ya said qqq is already down, leaps don't look bad on dips", "score": 2, "replies": []}]}]}, {"body": "I will be short the QQQs @380", "score": 0, "replies": []}, {"body": "Yeah I was thinking spreads but if we start testing new lows, the IV is gonna spike and I want that sweet premium", "score": 1, "replies": []}, {"body": "Could sell something on the call side to reduce cost a little. Highly unlikely we're making ATHs or anywhere close in the immediate future.", "score": 1, "replies": [{"body": "I’ve exhausted that option already with expiries going all the way to March. I’m waiting until the end of Feb to roll up to April. Perhaps I just do CC and wait it out. \n\nWhat attracted me to OTM spreads is you risk less $ for a bigger profit and again we pribably going to 420-430s again in the near future.", "score": 2, "replies": []}]}, {"body": "Need more info there is a  25 pt wingspan 445-420 - sounds like break even is 2500 - 940 leaving max gain 2060. \nS&P is at 440 now . \n\nYou are out there a long time and selling 425’s . How do you know there isn’t a bounce back Mon \nAM where you are at 4550 and stalled there while decay happens \n\nYou went ATM on the long  440 to get a good credit on the short 425 but still you are paying a premium for it - I would have gone out less time maybe end of this week where we have Fed reports , Russian invasion and inflation at the forefront \n\nTake the profit and run on a shorter time frame  I think this one blows up on you by 3/18 out too long and too much IV this weeks", "score": 1, "replies": [{"body": "I see, I see, thanks for the input. I haven’t bought anything yet just browsing options. The only thing on going weekly is theta decay runs much fatsr I think. \n\nMy plan with the 3/18 expiration is to sell at a profit on a sudden drop, let say Putin invades and we see a sudden god forbid 400-430 drop. I would sell at a profit in that case. I guess weekly will work similar but I think if by Thursday it has not dropped Theta will have already eaten half my premium.", "score": 1, "replies": [{"body": "If that’s your goal wait for war to be declared - by 10-20 QQQ ATM puts - hang  in for a few minutes and sell - Friday while the speaker of the house was talking I made a quick 3k on the same money you are talking about - the second it dipped I sold", "score": 1, "replies": []}, {"body": "This whole week will be walking on eggshells - I’m playing SHOP and NVDA calls - maybe DKNG puts.", "score": 1, "replies": []}]}]}, {"body": "I've been eyeing VIX calls for protection against a big downward move", "score": 1, "replies": []}]}
{"title": "Apple when i buy new iPhone and have to buy extra charger bcs its not included:", "selftext": "", "id": "sqq8as", "created_utc": 1644667957.0, "score": 362, "upvote_ratio": 0.84, "num_comments": 33, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|2 weeks ago\n**Total Comments**|6|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sqq8as)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sqq8as)", "score": 1, "replies": []}, {"body": "how is this relevant to this sub?", "score": 33, "replies": [{"body": "Revenue\n\n\n- Sent from my iPhone", "score": 15, "replies": []}]}, {"body": "Is this your first iPhone?", "score": 9, "replies": []}, {"body": "Amazon basics or Walmart for knockoffs 👍🏻", "score": 3, "replies": [{"body": "I agree get knockoffs but get the braided ones. The cheapo ones are fucking terrible and you’ll debate in your mind why you didn’t shell out a couple more bucks for a better product", "score": 2, "replies": [{"body": "Agreed as well, I just replaced a braided one I had for 6 years and spent maybe $6 on with another for $10. It survived 3 phones and 2 cars.\n\nThanks inflation", "score": 1, "replies": []}, {"body": "Why are braided better?", "score": 1, "replies": []}]}]}, {"body": "And you don’t need it, it’s just if you want to charge faster, but you already know that right?", "score": 2, "replies": []}, {"body": "This is why I have yet to buy $AAPL. At some point customers will geet tired of being dicked around", "score": 8, "replies": [{"body": "The year is now 2040 with the new release of the Iphone XXI, cpu, screen, ram, charger and C software sold separately", "score": 16, "replies": [{"body": "Lol exactly.\n\nApple is a pirate, a smart pirate.  Assuming people are still willing to buy Apple products, by taking things out of the box, changing charging port sizes or shapes, etc, they create for themselves recurring revenue streams outside of the physical phone itself.\n\nEvil but smart.", "score": 5, "replies": [{"body": "Imagine going to college for 12 years, PhD only to find out the whole point was to learn to talk in technical jargon in order to con people out of money", "score": 7, "replies": [{"body": "Wait... are you saying that's *not* the whole point?", "score": 1, "replies": []}]}, {"body": "To me it’s a clear sign that they think they cannot increase their topline just by selling phones. That’s the reason why I haven’t been into AAPL.", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Can't buy extra storage without monthly subscription to iCloud, can't get necessary cables, chargers etc without paying extra for donkles, little things like that. Can't pay the monthly for iCloud? We'll just delete all your shit. Sry not sry\n\nTBH if that's how they want to do business it's fine with me I just won't buy any of their products. What pisses me off is how Microshaft is starting to copy them with the whole pushing you to the Office/windows subscription bullshit.", "score": 5, "replies": [{"body": "You don’t have to buy new stuff all the time. I use $10 Aukey wireless chargers most of the time, and the phone still uses the lightning connector (same since 6 I believe).\n\nWall chargers shouldn’t be getting damaged to the point you need a new one every two years, let alone 4. The MacBook thing pissed me off though, changing the ports was such an asshole thing to do. \n\nI never buy Apple accessories though, since they’re ridiculously overpriced. Just be smart with your money (wait I just noticed the subreddit)…", "score": 2, "replies": [{"body": "In fairness, at least they changed it to USB-C which seems a new standard", "score": 0, "replies": [{"body": "It was a few years early and all the ports were C, lol. A $15 add on fixed it but still annoying.\n\nBut their products hold up longer over time. I sold my 2011 MacBook Pro to a friend when it wasn’t enough for newer IDEs, he still uses it. I don’t see many PCs lasting that long. \n\nSo there is an argument to be made that cost over time is better than other brands. Just their marketing machine is wild and baits people into upgrading way too early so they can resell the old stuff a second time. It’s brilliant\n\nEdit: I’m poor and don’t own Apple stock, just a disclaimer.", "score": 1, "replies": []}]}]}, {"body": "\n>Can't buy extra storage without monthly subscription to iCloud, can't get necessary cables, chargers etc without paying extra for donkles, little things like that. Can't pay the monthly for iCloud? We'll just delete all your shit.\n\nNot exclusive to apple though? This applies to a vast majority of smartphones and non-business laptops (I'm thinking of ThinkPads here)", "score": 1, "replies": []}]}]}, {"body": "Lol no they won’t.", "score": 1, "replies": []}, {"body": "\"tired of being dicked around\"\n\nI'm pretty sure most of humanity loves getting fucked, especially females *(high % of Apple customers)*. I'm short AAPL, and I guess I like being dicked around as well.", "score": 1, "replies": []}]}, {"body": "Tbh the same thing happened when I bought a Pixel", "score": 4, "replies": []}, {"body": "AMC holders when they go to see a movie every day in a sad attempt to increase the stock price.", "score": 4, "replies": []}, {"body": "You know what? This is the kind of shit that makes me understand why shitty fucking memes from fucks like you were banned.", "score": 2, "replies": []}, {"body": "Nobody actually sends chargers with phones anymore, just a USB cable.\n\n\"It cuts down on waste!\"\n\nCuts down on me owning your name-brand wall chargers with 87% profit margin.", "score": 4, "replies": []}, {"body": "I just grabbed a 13 all I got was the cord lmao", "score": 0, "replies": []}, {"body": "It's not an \"extra\" charger if you didn't have one in the first place lol", "score": 0, "replies": []}, {"body": "It’s a good thing Samsung includes a charger!\n\n…", "score": 0, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "You don't have a USB port charger?", "score": 2, "replies": []}]}]}
{"title": "Keep Calm and Carry On: A level view of 2022", "selftext": "Mass human psychology will always lag reality. \n\nConsider the below bullets points and the TL/DR at the bottom. **2022 is going to turn out just fine.** \n\n* **Rate hikes will be slow and steady**\n   * Inflation is not out of control: the Biden admin is (admittedly) right that supply side shocks are heavily influencing key elements of the CPI basket. There is ZERO reason for the Fed to panic and drop a .5 bomb on everyone on Monday, or even in the near future. This is an extremely delicate process, and the Fed is going to continue to combine (1) hawkish language with (2) slow and steady rate hikes. I will borrow a phrase from Deng Xiaoping here and say that in 2022, the Fed is going to 'cross a river feeling for stones'. \n   * A slowly increasing rate hike environment is not destiny. Everyone here needs to move beyond the extraordinarily simple money printer paradigm. YES, QE absolutely contributed to high valuations, but NO, a slowly paced rate hike in combination with an easing in COVID/Supply Side issues (see below) is not the recipe for a crash. Are some companies going to be naked when the water slowly recedes? Yes--but corporate profitability is very high right now. If AMC and other bullshit fake companies go out of business, the huge employment needs in EVERY sector (not just Wendys) will catch those workers. \n   * Everyone with an IQ above 80 has known that COVID QE was going to cause inflation, and require rate hikes. Retail capitulations over the past \n* **COVID is fading away and becoming seasonal like the Flu**\n   * Look at the numbers, they are there for everyone to see. Already the Biden admin is talking about rolling mask mandates back. Sure, another variant could pop up, but we are on the brink of Summer and COVID is now becoming a seasonal phenomenon. \n   * Therefore, people will start to go back to normal. This is beneficial for consumption, as well as for easing supply-shocks (particularly in China). \n* **Supply Side issues are already easing and will continue to ease as COVID concerns globally start to lessen**\n* **Ukraine is not going to become the global crisis many here think it will**\n   * Read the room: major players in Europe and the U.S. are NOT going to throw down over Ukraine. Literally, Berlin runs Europe, and Berlin sent helmets to Ukraine. If that doesn't tell you the degree of European resolve, I don't know what else will. \n   * If a conflict occurs, it is more likely limited (Think: Crimea lite) for Putin to save face. This means that limited war is possible without massive contagion. Far Western Ukraine (Donbass) already has political, culture, and linguistic splits with Kyiv, and in material terms, the only major consequence is that a larger % of the European grain supply will be Russian-owned. Now the French will have to start buying American grain for their pastries. \n* **Incomes are pacing with inflation**\n   * I saw an advertisement at Chipotle for $15 an hour this week. I'm a big four bro on the services side, and I got a 10% raise this year. Salaries are up across the board: in Consulting, new hires are making WAY more than they did two years ago. McDonalds literally just came out and said at all company owned restaurants, its $13 an hour average, and will be $15 by 2024. \n   * Yes, I know you can find articles like this ([NYT](https://www.nytimes.com/2022/02/10/business/dealbook/inflation-pay-prices.html)) that says that prices are outpacing inflation, but we are in a SUPPLY SIDE crisis. This is NOT a demand side crisis. Logistics bottlenecks and COVID easing are critical to this going away. \n* **Corporate profits are at all time highs**\n* **Biden is afraid of 2022 midterms and will not rock the boat with China this year.** \n   * Yes, shaking a sword at China is politically popular, but Biden is *very* unpopular right now and the DNC does NOT want to worsen the bloodletting its destined to suffer late this year by aggravating an already bad supply chain crisis. \n   * The new tariff options the Admin is exploring are punitive measures. It is a continuation of the low level friction that will define U.S.-Sino relations for the next decade. \n\n# TLDR\n\nMass human psychology will always lag reality. **There are very, very good reasons to think that the bottom is in, and 2022 is going to be smooth and steady**.", "id": "sqtjit", "created_utc": 1644678542.0, "score": 30, "upvote_ratio": 0.73, "num_comments": 31, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|1 month ago\n**Total Comments**|226|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sqtjit)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sqtjit)\n    \nHey /u/IS_JOKE_COMRADE2, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "Making a lot of big assumptions here and simplifying problems drastically. \n\nAdditionally, you make the dangerous assumption that everyone at every level will behave rationally using the same arguments you use. You're not accounting for rampant political incompetence, pursuit of goals other than those explicitly stated, and uncertainty.", "score": 18, "replies": [{"body": "I know, but the phenomenon I’m describing takes the huge, structural factors and big issues that underpin the bear narrative and states what the probability outcome is. This is the null hypothesis", "score": 11, "replies": []}]}, {"body": "Need some helmets? Take these, we werent usin em.", "score": 10, "replies": []}, {"body": "\"Incomes are pacing with inflation\"\n\n what are you smoking?", "score": 16, "replies": [{"body": "Mine has ¯\\\\\\_(ツ)_/¯ \n\nIf you’re not making 20-50% more than you did in 2019 it’s time to find a new job. \n\nI cleared 100k for the first time ever in 2021. In 2019 I was making roughly 55k. I have not changed careers.", "score": 7, "replies": [{"body": "So you base your investments on your personal experience. Just go to the casino instead.", "score": 3, "replies": [{"body": "How is this comment relevant as a reply to my op? I didn’t mention a single ticker or strategy.", "score": 3, "replies": [{"body": "and how is your personal experience relevant when we talk about inflation? not even if you were Bill Gates", "score": 4, "replies": [{"body": "Look around bro. Bestbuy is hiring at $15 an hour *starting, across the board*\n\nThey paid like 11 tops for super qualified applicants in 2019. \n\nAll I’m saying is that the market has dictated higher prices and if your employer doesn’t recognize this it’s time to ditch them and find another before the music stops. \n\nThis isn’t controversial advice in the slightest.", "score": 4, "replies": [{"body": "> All I’m saying is that the market has dictated higher prices and if your employer doesn’t recognize this it’s time to ditch them and find another before the music stops.\n\nI tend to agree with this. I've just made a pivot and will be making 50% more (hourly)*. \n\n**Overall my annual income will be similar, but i'll work 780 hours less.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "About Russia: It is not about just Ukraine. If shit hits the fan in Ukraine, yes, NATO won't be directly involved, but eyes will turn to China and Taiwan. Can you imagine what is going to happen to supply chains/semi conductor/oil if that happens? And inflation by extension?\n\nAbout QE: the market run up in the last two years very obviously was tied to QE by the hip. Interest rates hikes are secondary at that point. QT is going to deleverage the system, which is badly needed. If QE continues, yes, valuations will be maintained high at first, but markets will become more and more dysfunctional, with high volatility, as we have seen lately, because companies will need to ramp up earnings to justify these high valuations, meaning they will have to increase prices, causing inflation at the consumer end, or they will have to grow at impossible rates. If they are not able to do it, they will sink in value. Not to mention high real state prices caused by QE will push rent up, increasing inflation in the long run as well. Housing is like 30% of CPI... The argument that the problem with inflation is only on the supply side assumes that demand is not part of the equation. Rising prices are always about the interaction of the two sides. There is a higher quantity of money with increasing velocity chasing fewer goods. It is both supply and demand. Arguing wether inflation is caused by supply shortages and fueled by QE or vice versa is irrelevant.", "score": 3, "replies": [{"body": ">Can you imagine what is going to happen to supply chains/semi conductor/oil if that happens?\n\nThis will be bad on the other hand BigCorps have already been starting to move production outside of China for reasons besides Taiwan. And wafer fabs are being build outside of China while moving away from Oil has also started and it's gaining momentum. Since supply chain issues are already expected to last until 2023/2024, I'd say some part of this is already priced in. Also I think Xi isn't as obsessed of restoring a pre-1990 world order as Putin is (just think of the economic consequences for China)", "score": 3, "replies": []}]}, {"body": "Crimea was russian land given to Ukraine for all you retards screaming putin already invaded Ukraine... he didn't. It wasn't even that long ago that shit was part of Russia and nobody there gave a shit about Ukrainian sovereignty. \n\nPutin isn't a retard like the majority of this sub. The so-called Invasion is mostly a propaganda issue. He's not going in there.", "score": 3, "replies": []}, {"body": "There are structural issues at play which will cause inflation to continue to run rampant. Energy (oil especially) is facing a supply/demand crisis that won’t be fixed in the near-term. This will ripple into fertilizer and food price increases. This is just the beginning and quarter-point rate hikes won’t do anything to stop it.", "score": 6, "replies": [{"body": "That’s one element of the CPI basket", "score": -1, "replies": [{"body": "It impacts all elements in the basket. Food costs, lumber costs, housing costs, etc. All these items require fuel to transport, heat, or refrigerate.", "score": 2, "replies": []}]}]}, {"body": "Rising wages make inflation more sticky/persistent. Which leads to MORE rate hikes.", "score": 5, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}]}, {"body": "I wonder if you’ll ever admit to being wrong or if you’re just gonna go down with the ship of your opinion over the coming years. Inflation is here to stay my guy.", "score": 3, "replies": []}, {"body": "That was far too logical and rational.  You clearly don't belong here.", "score": 4, "replies": []}, {"body": "Is this joke, comrade?", "score": 3, "replies": []}, {"body": "Amazingly, wrong in all points.", "score": 1, "replies": []}, {"body": "“Biden is afraid of mid terms.” Stopped reading this baloney right there…", "score": 1, "replies": []}, {"body": "“Biden is popular”? Isn’t his approval rating one of the lowest ever?", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Yeah but omnicron is pretty much a joke.", "score": 5, "replies": []}, {"body": "At what point does that number stop mattering though? There has to be a point where covid becomes just another virus - which is what is happening. Unless another fucked up variant spawns I really don't see covid being a factor anymore. I might be bearish (I know) but it's not because of covid...", "score": 6, "replies": []}]}, {"body": "does anybody remember when this guy was the bear gang general ? \n\ni made a lot of money cuz of you my G -- EEM EWM IWM POOOOTS", "score": 1, "replies": []}, {"body": "Energy prices are up because of government policy set by this administration.\n\nHas nothing to do with supply or demand, those energy costs are baked into the price of everything and then the price to get it you.\n\nForfeiting our energy independence was retarded", "score": 1, "replies": []}, {"body": "If inflation doesn't ease up, then wages will have to keep going up, going into a inflation-wage spiral.\n\n&#x200B;\n\nTrust me, I'm from Argentina, I know this shit, it's not good.", "score": 1, "replies": [{"body": "btw, the CPI is a bad indicator, since it changes when inflation hits, so it always lags inflation. That means inflation if always higher than the CPI, since consumers change what they consume based on inflation.", "score": 1, "replies": []}]}]}
{"title": "Might Meta announce a acquisition next week?", "selftext": "[Meta To Hold Company All-Hands Meeting To Detail Metaverse Plan](https://www.theinformation.com/briefings/meta-to-hold-company-all-hands-meeting-to-detail-metaverse-plan)\n\n\"Meta Platforms plans to provide more details to its employees next week about how it will realize its vision for the metaverse. The company is encouraging staff to tune in to an all-hands meeting on Tuesday, according to two current employees, **one of whom said they were told that a major announcement would be made**.\"\n\nMicrosoft bought Activision Blizzard in part for it's Metaverse potential so perhaps Meta (Facebook) is also looking into buying a game studio / publisher to bolster it's metaverse plans.\n\n[Microsoft CEO argues that buying Activision Blizzard will help him build the metaverse](https://www.polygon.com/22917625/microsoft-activision-blizzard-metaverse-satya-nadella)\n\nTo be clear this all just speculation so take it with a massive grain of salt.", "id": "sqtqda", "created_utc": 1644679100.0, "score": 31, "upvote_ratio": 0.76, "num_comments": 39, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|13|**First Seen In WSB**|10 months ago\n**Total Comments**|12|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sqtqda)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sqtqda)", "score": 1, "replies": []}, {"body": "If this is true. Meta buying Roblox.", "score": 42, "replies": [{"body": "That would make sense. Seems weird time though with FB down so much and RBLX earnings this week. Even with Meta money it ain’t cheap", "score": 9, "replies": [{"body": "Meta is getting a discount roblox just got a price cut on marketplace", "score": 2, "replies": []}]}]}, {"body": "Pelosi is tits-deep in roblox calls 👀", "score": 27, "replies": [{"body": "What if those Roblox calls were bought in response to bungled inside Information about Microsoft acquiring Activision?\n\nMaybe she caught wind of an acquisition, and wrongly assumed it was Roblox since that would kinda make sense at the time given the Minecraft acquisition.", "score": 2, "replies": [{"body": "If she loses that big on bungled inside info, there will be a new addition to the Clinton body count…", "score": 2, "replies": []}]}, {"body": "I bet they hang to the floor.", "score": 1, "replies": [{"body": "No doubt!  Can’t see her feet with a bra on, can’t see her feet with it off either! 🤢", "score": -3, "replies": []}]}, {"body": "Remember: she does it \"for the children!\"", "score": 1, "replies": []}]}, {"body": "We’re buying imaginary California next week.", "score": 8, "replies": []}, {"body": "meta buying taketwo", "score": 5, "replies": []}, {"body": "They are going to buy Unity or Epic for sure. They need the right tools for their platform and both will be great. Epic CEO is apratnely not very keen to be part of any big boys teams so I'm betting they are going to buy Unity. More than half of their applications on oculus quest 2 already using this engine.", "score": 4, "replies": [{"body": "Tencent owns a stake in Epic too. Wonder how that will shake out. Pretty sure it’s a big stake as well.", "score": 1, "replies": []}]}, {"body": "“an” basic grammar", "score": 4, "replies": [{"body": "You're on wsb...", "score": 5, "replies": [{"body": "Aren't we just here to better each other?", "score": -4, "replies": [{"body": "No we're here for the money and then some", "score": 2, "replies": []}]}]}]}, {"body": "It already acquired a bunch of bag holders money. Why not?", "score": 5, "replies": []}, {"body": "I hope they acquire Playtika , my calls would Print", "score": 2, "replies": []}, {"body": "Go tell market rebelion boyz to pump it more", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4267)market rebelion suggestions are as good as cramers", "score": 2, "replies": []}, {"body": "This would be great for my 2/25 calls, lol.", "score": 2, "replies": []}, {"body": "Metaverse is Latin for “We don’t know what the fuck we are doing”.", "score": 5, "replies": []}, {"body": "Metaverse is a downhill bet, every company that even mentions it get immediate backlash from everyone.\n\nSeems fit that the most hated company and CEO out there go for it. There is no bottom.", "score": 3, "replies": []}, {"body": "I’ve been kinda expecting a move like this for a while, I’m kinda surprised they haven’t already made some type of move like this already, so I wouldn’t be shocked, Roblox is at a really good price rn too.", "score": 2, "replies": []}, {"body": "I read last week FB has acquired over 89 companies so far so I guess this makes sense.  Even though most people I speak to have no interest in the MetaVerse.  Personally I hope it keeps tanking.", "score": 3, "replies": [{"body": "I have noticed something very interesting regarding adoption of their hardware. So far nobody in my circle got convinced from just talking about the quest 2 and pretty much everyone got sold on the spot as soon as they tried the whole experience for real. Their issue is that all of their ads (including their super bowl ad) doesn't really want me to even try it.", "score": 2, "replies": []}]}, {"body": "Doesnt this instead imply lay-offs? I might be wrong tho", "score": 1, "replies": [{"body": "In my experience working for tech companies, yes this sounds a lot like a lay off.", "score": 2, "replies": []}, {"body": "that would create the nasdaq crash we've all been clammoring for. fb has turned into a bedrock employer in tech. if those jobs go, negative earnings growth company jobs look shaky at best", "score": 1, "replies": [{"body": "Lay offs are always bullish wym", "score": 8, "replies": [{"body": "it means the companies that have been getting by with cheap debt and high speculation will probly fold, or substantially trim fat. BK obviously wipes the cap. substantial trimming cant be met with an even higher cap imo", "score": 1, "replies": []}]}]}]}, {"body": "Does any of this actually matter? Any potential price impact will be muted by the fed and/or Russia.", "score": 1, "replies": []}, {"body": "Fuck Meta\nFuck Zuck\n\nI see no beneficial importance to to society from this company.  You can buy your calls and I will buy my puts \n\nYou can put lipstick on a pig, it’s still a pig. This companies business model is trash, and the younger generation KNOWS IT", "score": -7, "replies": []}, {"body": "Yea…\n\nThey should buy Tick-tock, Snap, and Twitter…\n\nAnd, shut them all down… \n\nBoom…no more competition.\n\nThe Metaverse has a 1% chance of happening…\n- Do people really want it? \n- Will the tech ever happen?\n- Maybe just for games and fapping.\n\nAnd, Meta isn’t gonna be the company that makes the Metaverse happen…", "score": -6, "replies": []}, {"body": "God i hope not. If they announce acquisition FB price will drop again. After it already lost 30+%. And you know we have only so much of these %", "score": 1, "replies": []}]}
{"title": "Bear Market vs Bear Trap: how Russia plays into it?", "selftext": "Everyone wants to time the market, but it has been shown over and over again that DCA’ing is a much better approach. As long as you are DCA’ing into stocks / projects that can survive a true bear market, then it really doesn’t matter if the sell off over the last 48hrs is the continuation of a bear market or just a bull trap fabricated by nonstop Russia / Ukraine fear mongering.\n\nPutting aside that point, I really don’t think Putin am has any interest in going to war with US/NATO. \n\nI am purely speculating, but here is a stance that can explain Putin's actions…and one that would turn him for someone who is bat shit crazy into someone who is playing 4D chess. \n\n1. He knows our financial system is already unstable. Inflation, stimulus no more, the fed has stopped printing, rates are going to be increased, and asset prices are at record high valuations and primed for a correction. All of this is causing uncertainty and many are starting to believe the markets are standing on the edge of cliff. \n\n2. Additionally, Ukraine's pro west leader, Zelenski, is relying on the west for stimulus and general stability. If the west cannot provide the aid or if it falls into a recession, Zelenski loses support from his base and Putin is given a narrative that says, 'the west is dealing with their own problems, their is no way they can help Ukraine'.\n\n3. So Putin fabricates the threat of war in an attempt to push the US markets over the edge. That creates opportunity for Putin and an opportunity for Russian backed, Ukrainian politicians to gain back popular support. \n\nNow, the risk in him playing this game is steep. Because if he pushed the west too far, and they impose sanctions, it will crater Russia’s economy. So if this is his strategy he is walking a very thin, but manageable line. I say this because all he has to do is to continue to posture and cause uncertainty right up until the point where the US is about to put sanctions in place…and then back down. In that time, the markets will either fall off the cliff or not, but they will certainly be weakened per how they have responded over the last 48hrs. \n\nWould be interested in others thoughts on all this as week. \n\nNot financial advise. I know nothing about anything.", "id": "sqz1pu", "created_utc": 1644693782.0, "score": 18, "upvote_ratio": 0.7, "num_comments": 39, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|1|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sqz1pu)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sqz1pu)", "score": 1, "replies": []}, {"body": "I’ve been dcaing forever but my options keep expiring worthless", "score": 19, "replies": [{"body": "This guys does it right", "score": 10, "replies": [{"body": "Diamond handing options.\n\nThis is the way.", "score": 7, "replies": []}]}]}, {"body": "I am wondering why the market (i.e. SPY) did not give a fuck about the Crimea ~~annexation~~ situation in 2014.", "score": 11, "replies": [{"body": "Yes, good point.", "score": 2, "replies": []}]}, {"body": "War is allowed only during US trading hours. Breaking!", "score": 10, "replies": []}, {"body": "Putin is looking for an exit strategy that will not humiliates him or cause his government to collapse ….. in another headline news …. The Media is not talking about Covid anymore , no one is busy searching for the next Covid variant to cause panic and fear …. It’s all Russia-Ukraine now", "score": 6, "replies": [{"body": "And we never figured out who Ghislaine sold those young girls to either. Such a shame", "score": 3, "replies": []}]}, {"body": "Dca and safe plays? Thefuck is this shit? Go to r/investing", "score": 6, "replies": [{"body": "r/investing is just a bunch of boomer snowflakes who learned how to use a computer.", "score": 1, "replies": []}]}, {"body": "If he's not invading, whatever his plan is, is an extremely costly one. Hundreds of thousands of troops and a heck of a lot of equipment. If this would collapse the western economy, it might be worth it, in a MAD kind of way. \n\nHowever, stock markets are not the economy. He crashes the stock market but wrecks his actual economy(which is already not that strong), while the west quickly bounces back. Also ensuring Ukraine's position is reinforced if in the future they do decide to invade ?\n\nIt really doesn't make much sense if he doesn't invade. It's not even a bargaining chip as they don't seem to be negotiating anything.", "score": 5, "replies": [{"body": "but it also doesnt make sense if he does", "score": 2, "replies": []}]}, {"body": "the cost of deploying the military at that scale is huge, probably more than Putin can afford to just put on a bluff.  It is very likely that the invasion will occur very soon.   I wouldn't be surprised that China will make a move for Taiwan soon after.", "score": 5, "replies": [{"body": "This!.. it's not all coincidence this has been planned way in advance.  Can the world afford to sanction China & Russia? NO WAY IN HELL! China has been building up fortification and troops around Taiwan for years. Who has putin been buddies with in all this? Xi... Can the west protect 2 countries on different sides of the world? NO!.. both Taiwan and the Ukraine will fall with the west not being able to do much about it. Sanctions on both Russia and China will cause a global recession it will not happen.", "score": 2, "replies": []}]}, {"body": "Support for Russia in Ukraine has always been overexaggerated and even at the highest point was still below 20%.  Now 75% of Ukrainians see Russia as a \"Hostile State\", so Putin has in fact lost significant support with the vast majority of Ukrainians hating his guts.  \n\nPutin's strategy is a losing strategy that will just push the Ukrainians into the arms of the West and possibly even result in the end of his reign of terror if he actually invades.  The chances of Ukraine becoming Putin's Afghanistan are very high in the case of invasion.", "score": 5, "replies": [{"body": "lol no. russai is right next door...they can  smother ukraine to death. the problem with the us and afghanistan was that we were trying to wage war literally half way across the globe.", "score": 2, "replies": [{"body": "Putin's Afghanistan was a reference to the Soviet-Afghan War that basically broke the Soviet system and lead to the collapse of the Soviet Union. (amongst other things)  Invading Ukraine is likely to have the same effect on Putin's Russia.", "score": 1, "replies": [{"body": "fair enough", "score": 1, "replies": []}, {"body": "The Soviets withdrew from Afghanistan in 1989, after almost a decade of trying to instill a regime change into one that was more Soviet-friendly. The USSR collapsed not long after around 1991.\n\nIt took the US twice as long (two decades) to come to the same conclusion. The US withdrew in 2021. What are the chances this circus economy implodes by 2023?", "score": 1, "replies": []}]}]}]}, {"body": "Putin is definitely pushing Biden’s buttons and testing the weaker administration. Certainly could be trying to create market panic. In the end it does t seem like a good bet for them to go to war over Ukraine although NATO must mean business.", "score": 2, "replies": []}, {"body": "Putin is just trying to get in GME cheap.", "score": 2, "replies": [{"body": "Lol. This ☝🏻 explanation makes the most sense. \n\nThis is the way.", "score": 1, "replies": []}]}, {"body": "How invading a country în Europe în the 21st century is possible and not punished more severally is beyond me. They should be punished at every level, economically cut all ties, no other country should let a russian step foot în it, ban all russian athletes to compete în any sport that is hosted în the West or under a world organization. Just let them know there will be no iphone, coca cola, mercedes, facebook, google etc în their country if they did.", "score": 2, "replies": [{"body": "I couldn’t agree with you more. This level of aggression, even potential aggression, at this day and age, is shocking to me.", "score": 4, "replies": []}]}, {"body": "It smells like trap. Because this story of an incoming world war is not valid. I mean just think of the atomic wapons. All of us would bei fucked. Who would care about the market if the fallout comes down. So the story is almost impossible.", "score": 2, "replies": [{"body": "there will be no winner in WW3.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Ummmm, bear market or bear trap. No bull. It’s okay tho. learning how to read is admirable.", "score": 3, "replies": []}]}, {"body": "Russia is puffing their chest, nothing more. My friend told me that they do this frequently.", "score": 1, "replies": [{"body": "Last time they puffed their chest they annexed Chrimea.", "score": 3, "replies": []}]}, {"body": "It’s definitely some ballsy shit to see who’s going to blink first— even as Germany signals to the west they support sanctions on the Nordstream 2 pipeline. Also, with the administration targeting which wealthy Russians they’ll impose sanctions on if russia does invade will truly test the strength of this administration.", "score": 1, "replies": []}, {"body": "Energy prices will remind high because that’s why U$A wants as to make Europe uncompetitive globally. \n\nSo buy electricity and oil companies.", "score": 1, "replies": []}, {"body": "Ukrain will be fine I will be able to give them all the AIDS they want. After my $SPY puts print next week.", "score": 1, "replies": []}, {"body": "EU tension always benefits the US. The fed is going to raise interest and the market is going down. But as long as EU market, or Asia or somewhere else crashes even more, wall street will find a way to profit", "score": 1, "replies": []}, {"body": "When did WSB become political?", "score": 1, "replies": []}, {"body": "DCA? Who let this guy in here?", "score": 1, "replies": []}, {"body": "Putin is flexing because he is surrounded by NATO bases, this is all.", "score": 1, "replies": []}]}
{"title": "$AAPL, a safe bet if Russia invaded Ukraine.", "selftext": "https://imgur.com/a/TxLxqrG\n\nFor all of you wondering where to stick your cash if Russia goes to war with the Ukraine; while Putin says he doesn’t have a cell phone… we all know it’s an iPhone. Here’s the proof.\n\nThis is not financial advice, Putin and I just like the stock.\n\nEdit: I told you guys, fat chance apple complies.\n\nhttps://www.reuters.com/world/ukraine-vice-pm-urges-apple-cut-products-services-supply-russia-2022-02-25/?utm_source=reddit.com", "id": "sr01tr", "created_utc": 1644696566.0, "score": 45, "upvote_ratio": 0.75, "num_comments": 39, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|1 year ago\n**Total Comments**|99|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sr01tr)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sr01tr)", "score": 1, "replies": []}, {"body": "Calls on military contractors my guy", "score": 31, "replies": [{"body": "Calls on all American companies nobody profits off wars like America that’s why they are so involved", "score": 18, "replies": [{"body": "Murica gonna lose my friend, Gazprom calls", "score": 1, "replies": [{"body": "You got a deep dive I can use this morning wood to?", "score": 2, "replies": []}]}]}, {"body": "tickers my g", "score": 0, "replies": [{"body": "Lockheed ($LMT) and Raytheon ($RTX)", "score": 3, "replies": []}]}]}, {"body": "Who’s going to buy $1000- $1500 IPhones, if consumers are paying $300/month for natural gas to heat their home and $500/month to fill their car 🚗", "score": 12, "replies": [{"body": "Trust me if seen People having a 1800€ job, buying a iPhone13pro Max and paying it off monthly. Since the release of the 13, i have never seen so much expensive Phones in the working class. \nI assume 9/10 paying them off monthly.", "score": 4, "replies": []}]}, {"body": "The iPhone 6 Plus finally made it to Russia", "score": 9, "replies": []}, {"body": "I thought AAPL said they didn't want villains with iPhones in the media?", "score": 6, "replies": [{"body": "Villain is a matter of perspective.", "score": 7, "replies": []}]}, {"body": "If Russia invades Turkey from the rear, will they need Greece?", "score": 6, "replies": []}, {"body": "“u take 🤳 with me” - Putin", "score": 4, "replies": [{"body": "Puts on black berry.", "score": 2, "replies": []}]}, {"body": "He’s holding that phone gently like a dic tator.", "score": 5, "replies": []}, {"body": "I have read somewhere that Putin likes Apple Cider. Just find more confluences. I agree with your assessment", "score": 3, "replies": []}, {"body": "Oil calls you tard", "score": 2, "replies": []}, {"body": "AAPL is a safe bet no matter what happens on this planet. If anything every happens to AAPL... the world already has bigger issues.\n\nI have YOLO'ed on AAPL and I am so happy for this (I always sleep well at nite).", "score": 2, "replies": []}, {"body": "Jokes on all you guys. The west and the block reach a diplomatic agreement and your puts are fukt", "score": 3, "replies": []}, {"body": "AAPL is a stock that defies all logic and sound investment strategies. For the P/E ratio it is waaaaaay overpriced. \n\nI own AAPL and have no desire to sell because AAPL is one of those stocks for which everything gets tossed out the window.\n\nAAPL is a stock you buy and HODL knowing that when you buy it for \"$X\" in Year 1 when you get to Year 10 it will be worth at least \"3-5 $X\" and 20 years later maybe \"$10X.\"", "score": 2, "replies": [{"body": "Same, I treat apple stock like a savings account.", "score": 2, "replies": []}]}, {"body": "Russia isn’t invading Ukraine. Stop", "score": -2, "replies": [{"body": "How deep are you in calls?", "score": 11, "replies": [{"body": "10 - 12 feet", "score": 1, "replies": []}]}]}, {"body": "Of course it’s safe if you’re asking whether parking investment money there will be rewarded with positive returns within 3-5 years. \n\nIf, however, you’re asking whether aapl could drop to 155 or even 145 in a bear market - the answer is also yes. \n\nThis is WSB so your timeframe is probably 1 week so I’d say +/-5pts", "score": 0, "replies": [{"body": "Lol this is from the guy bragging about his 50-100x gains !!! Lets see it! Post or BAN !! Just another HS dropout ! LOLLLLLL", "score": 1, "replies": []}]}, {"body": "Or maybe it a that girls phone? Don't be a clown to support your bias.🤡🍆🤏🏿", "score": -1, "replies": [{"body": "It’s literally flaired shitpost. Climb off your high horse and roll around in the shit with the rest of us.", "score": 3, "replies": []}]}, {"body": "I suggest don’t. If you see consumer confidence is going down very fast which people are expected to spend less and Warren buffet kind of investors anytime can pull the rug as they are calling everything bubble.", "score": 1, "replies": []}, {"body": "Aerospace and defence dude", "score": 1, "replies": []}, {"body": "Buy the extreme dips and HODL AAPL, own your shares like you don't need the money!", "score": 1, "replies": []}, {"body": "Lol Russia isn’t going to war, it’s no coincide Boris Johnson and let go Brandon the two most unpopular dick head leaders who desperately need a flag waving distraction right now are pumping this, \n\nThe US doesn’t put on cnn it’s troop movements if they are doing anything, this is a three card Monty game to get you distracted from the fact your pay check can’t buy shit anymore", "score": 1, "replies": []}, {"body": "Pltr calls go brrr?", "score": 1, "replies": []}, {"body": "Don’t know about AAPL, just know that LMT is going just fine in 2022 …", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "sr28xu", "created_utc": 1644702849.0, "score": 70, "upvote_ratio": 0.97, "num_comments": 37, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|229|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sr28xu)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sr28xu)", "score": 3, "replies": []}, {"body": "Well, you tell me if you think these weed, EV, and other bullshit stocks are worth billions of dollars. And I will tell you, that Lucid has made about 200 cars and Asana is some productivity bullshit with no special anything has a market cap of 11.3 billion dollars while making 0 profit. I know eventually many of these companies are headed to the drain but 1 year, 2 years? I don't know but I'm buying weekly puts and trying to keep my nerve.", "score": 48, "replies": [{"body": "Main difference I’d say is that the market is heavily weighted to large, profitable companies like MSFT, APPL and AMZN.", "score": 5, "replies": []}, {"body": "what about monday.com bruh? I keep seeing those ads all over youtube. it must be worth fifty brazillian dollars and IPO with stocks to moon? and what about cheap china shit exercise bikes? surely their stocks will sky rocket?", "score": 2, "replies": []}]}, {"body": "I mean Japan has been looking for inflation for the past 30 years.", "score": 27, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "No because the japs will just hide it all under their mattresses like they do with all their savings.", "score": 6, "replies": []}]}]}, {"body": "Now read about 1929 and the Dotcom bubble", "score": 28, "replies": [{"body": "And mix in some late 70s inflation", "score": 17, "replies": []}]}, {"body": "Go read the book The Princes Of The Yen.", "score": 11, "replies": [{"body": "Or the free YouTube movie", "score": 6, "replies": [{"body": "Good idea.", "score": 2, "replies": []}]}, {"body": "Just put it on my wishlist", "score": 3, "replies": []}]}, {"body": "I wonder if back then also everyone expected a crash , just like 11 million of retards on wsb are aware of possible crash.", "score": 8, "replies": [{"body": "Roger Babson was the Burry of the 1920's and he warned people before the crash. Lots of people were expecting the Dotcom crash.\n\nSo yes people were expecting it.", "score": 4, "replies": [{"body": "Interesting. I recently watched the Big Short again and i realized they portrayed the movie in a way that only a handful of people knew the crash was coming whilst everyone around was greedy AF. And I think that is a right psychology behind a crash. \n\nBut on the other hand if everyone is pushing fear on each other it could create a self fulfilling prophecy.", "score": 3, "replies": [{"body": "2008 was a long time ago but from what I remember a lot of people knew what was going to happen. Many people profited off subprime mortgages and a lot of people should have gone to jail. Lots of people knew tech stocks were in a bubble in the 90's but it didn't pop until 2000. In 1929 lots of people knew the market was going to crash. There's a saying from the 1920's, \"when shoeshine boys start giving stock tips it's time to get out of the market\". Smart money knows exactly what is going on, that's why they sold at the top.", "score": 7, "replies": []}]}]}]}, {"body": "You got me at “Japanese ass…”", "score": 12, "replies": [{"body": "Doesn’t exist", "score": 16, "replies": [{"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4270)", "score": 2, "replies": []}]}]}, {"body": "A person just read a thing and then immediately applies it to the current situation.\n\nSolid.", "score": 5, "replies": []}, {"body": "there are parallels between many historical events and whatever is going on in the present but most of them are not that deep or meaningful and of those that are, it's rare or impossible that the exact same event happens twice. this seems like a pretty weak connection. America in 2022 is not Japan in 1991. they're very different.", "score": 14, "replies": [{"body": "It's different this time /s", "score": 12, "replies": [{"body": "I promise I wont hit you this time.", "score": 1, "replies": []}]}]}, {"body": "The US Economy will soon experience a \"Lost Decade\".", "score": 6, "replies": [{"body": "The last decade was a lost decade - interest rates stayed at/near zero, only people who really profited from anything were the 0.01 %", "score": 9, "replies": [{"body": "The last decade? As in 2012 to 2022 where the stock market went up like 180%? How is that a lost decade? The 0.01% weren’t the only ones who profited…anyone holding any kind of index fund almost tripled their money. The last lost decade was 2000-2010.", "score": 2, "replies": [{"body": "You're post is precisely case in point.\n\nWho has how much money in the stock market?\n\nWe've had a bubaru economy where there's been no growth so money chased yield into junk bonds, and rolexes and Bitcoin and NFTs - precisely because it had nowhere productive to go.  If there was money to be made building factories or providing worthwhile services that would actually generate profit, there wouldn't have been so much money in Silicone Valley patiently allowing businesses to operate with zero profits in return for so long otherwise.\n\nCapitalism is at a point where the only way to really profit with a new business is through the Amazon model, where you burn so much money for so long, that everyone else gets run out of business and you have a monopoly.  Existing businesses have to merge their way into a monopoly.\n\nEntrepreneurship in the US meanwhile has been dropping steadily and has been below European nanny state levels for at least the last decade as well.\n\nMaybe my 0.01% is too much hyperbole, but there's a chart in a bunch of other posts showing how much better the .01% did compared to the 0.1% and the 1%, the rest of the top quintile... In the last ten years, everyone earned nothing compared to what Gates, Musk, Bezos... The rest of the Jeffrey Epstein crew earned in the average day.  \n\nJapan's lost decade didn't mean the rich got poorer. There was a crash, then the rich continued getting richer in more or less similar circumstances.", "score": 7, "replies": []}]}]}]}, {"body": "Every crash is different. Next crash will be caused by Vladimir p.", "score": 5, "replies": []}, {"body": "But they didn’t have crypto", "score": 6, "replies": []}, {"body": "We just getting started here.", "score": 2, "replies": []}, {"body": "BOJ also hiked 5x  in 8 months, from may 89 to aug 90. then ran to a liquity trap. dont know if that plays put.\n\nhttps://www.spfusa.org/wp-content/uploads/2015/01/Paper_Monetary-Policy-during-Japan%E2%80%99s-Great-Recession_Kuttner-20140530.pdf", "score": 2, "replies": []}, {"body": "We have an asset bubble but we also have growing corporate earnings and gdp growth. Nonetheless prices have come back down a decent amount. \n\nSp500 multiples are at 23.3x trailing but historically when we have a 2% yield on the 10yr, the multiples should be at 20x. That means a further 15% drop should happen. As you may be aware, interest rates are the risk free return rates and therefore determine what the price for risk on assets should be. \n\nNot too long ago many thought the bond market was pricing in more rate hikes than would actually occur, which would mean the amount of multiple compression that would be needed to get to fair value would not be as much. I think that’s been completely flipped and now most think more rate hikes will be needed thus the seemingly quick asset repricing that we’re facing.\n\nHowever, the idea that the SP 500 will drop 50% similar to the bursting of the asset bubble in Japan is completely unfounded", "score": 0, "replies": [{"body": "The Shiller CAPE ratio disagrees.", "score": 2, "replies": []}]}, {"body": "Look at the [“princes if the yen”](https://m.youtube.com/watch?v=p5Ac7ap_MAY) documentary on the Japan crash.\n\nIt’s shocking that their central bank has pre-meditated this and put their country through a decade of misery to force free market economy and lower the power of their finance ministry.\n\nSomething similar is happening in the US now, except there is a certain video game retaiiler StoNk which means banks can’t just gobble each other up, because all of them are holding these toxic bags of shit loans to short hedge funds.", "score": 0, "replies": []}, {"body": "The Japanese People somehow managed to create their own World. As long as they are mostly in debt by themselves and keep everything as it is they will will just keep going.", "score": 1, "replies": []}, {"body": "Had me at bukake economy", "score": 1, "replies": []}]}
{"title": "VIX 📈", "selftext": "", "id": "sr4mc3", "created_utc": 1644709552.0, "score": 231, "upvote_ratio": 0.83, "num_comments": 34, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|11 months ago\n**Total Comments**|835|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sr4mc3)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sr4mc3)", "score": 1, "replies": [{"body": "Stfu mod", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)", "score": 38, "replies": [{"body": "![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4267)", "score": 18, "replies": [{"body": "that’s the biggest green crayon that OP has ever seen", "score": 3, "replies": []}]}]}, {"body": "Green and going up!", "score": 24, "replies": [{"body": "Got monthly calls, hopefully it blast off to Mars", "score": 8, "replies": []}]}, {"body": "VIX’s retarded cousin UVXY is looking to 🚀as well.", "score": 28, "replies": []}, {"body": "Shrek is love", "score": 12, "replies": [{"body": "Shrek is life", "score": 7, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 7, "replies": []}]}]}, {"body": "Always never forget VXX as a whole other dimension to stocks.", "score": 6, "replies": []}, {"body": "![img](emote|t5_2th52|4276)", "score": 5, "replies": []}, {"body": "SOME", "score": 3, "replies": [{"body": "BODY", "score": 3, "replies": [{"body": "ONCE", "score": 1, "replies": []}]}]}, {"body": "This is the quality DD I CUM here for", "score": 6, "replies": []}, {"body": "Wixxen in Germany literally means to Jerk Off.\nWixxe = Jizz\n\nSo bring it on, VIX!\n\nVIXEN! VIX the Stockmarket!", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4275)", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "🤦‍♂️🤦‍♂️🤦‍♂️ on almost any exchange even fukin cashapp has VIX", "score": 1, "replies": []}]}, {"body": "So down? Because I’ve done well doing the opposite of every Mai page WSB article.", "score": 2, "replies": []}, {"body": "Dix", "score": 1, "replies": []}, {"body": "Never hold over the weekend.", "score": 1, "replies": [{"body": "If you think Monday will be fubar you absolutely do.", "score": 9, "replies": [{"body": "What’s a fubar", "score": 1, "replies": [{"body": "Fucked up beyond all retardation", "score": 7, "replies": []}]}]}]}, {"body": "TIME TO YOLO WEEKLY CALLS ON VIX BABY 🚀🚀🚀🚀🚀🚀🧠🚀🚀🚀🚀🚀🚀🚀🚀✈️", "score": 1, "replies": []}, {"body": "Shrek hanging dong, huh? Monday is going to be crazy. Can't wait.", "score": 1, "replies": []}, {"body": "Based", "score": 1, "replies": []}, {"body": "I’m not gonna lie. I want to it. Haha", "score": 1, "replies": []}]}
