{"title": "Setting trailing stop loss % on all owned stocks and option orders?!? Why wouldn't everyone suggest this to mitigate risk?", "selftext": " Hello,  Thanks to these subs I've learned more about the market and how it works regarding options and plays than talking to paid financial advisors.   Some literature suggest setting a trailing stop loss on all owned stocks and options when you think a downturn is looming. Obviously, everyone can sense a downturn is coming in the following months with rate hikes and inflation and xyz. Although I think there could be positive isolated bull runs before a big correction comes in March after rates are hiked up.   My question is, why wouldn't everyone set a trailing stop loss at say 5-10% on all your stocks and option plays In Order to mitigate risk? I'm trying to understand why no one has mentioned setting a trailing stop loss on stock and option plays?   Is there any reason not to set trailing stop loses?   I exited some of my gainers to try to get back in them at a cheaper price, did this before I even knew about trailing stop loss was a setting.   What is the pros and cons of setting a trailing stop loss? I can not seem to find many negatives so I'm asking the people to help us mitigate loses and lock in gains. Thank you for any and all quality responses and good trading boys!  One example is having 1,000 Apple shares at an average price of $92.00. Now I don't think Apple will ever go below $90 and I could enter at a cheaper average price, but I still have a trialing stop loss of 10% set on my Apple stock and I'm wondering if this is the right thing to do when I believe a big market correction is coming with inflation and rate hikes.   Doing option plays as well and wondering why not set trailing stop losses on those plays as well. Thank you.", "id": "srr49b", "created_utc": 1644781539.0, "score": 7, "upvote_ratio": 0.64, "num_comments": 30, "comments": [{"body": "Stop loss orders do not work well with options as the pricing can move much faster than stocks and trigger closing orders that can cause losses on trades that might profit if left alone.\n\nThis is why you don’t see it mentioned anywhere . . .", "score": 20, "replies": [{"body": "They sure do change quickly. It's hard not to get caught up in the options price movement. I bought Nvidia options Friday morning when market was green and nervous it would cost more if market kept green and once placed BoOm the market u turned and I'm down 35% ahhhh got to love it", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 11, "replies": [{"body": "I sure did haha I'm learning more and more and I tell you what I sure do love the market. It's strange holding stocks and options but wanting a huge correction at the same time in order to load up more lol", "score": 3, "replies": []}]}, {"body": "It works well for trading stocks and futures. For options it doesn't work because the option price is more volatile that the price of the underlying. You will get stopped out of option positions early in trades unless you time the market perfectly, or you hold the options for very short time.", "score": 5, "replies": []}, {"body": "You cannot stop-loss a spread.\n\nAlso, they're not great even for stock if the bottom falls out. Order might execute well below your stop loss. And it exposes you to stop hunting on really volatile stocks.\n\nhttps://www.investopedia.com/terms/s/stophunting.asp", "score": 5, "replies": []}, {"body": "Also note that options pricing on mid- or low-volume options can deviate from fair market value. Think of any case where the bid-ask spread is wide - in such a case, the ask price can fluctuate wildly even if the underlying price doesn’t change based on recent trades of that contract (or lack thereof). Even for fairly decent volume options contracts, a stop-loss can still trigger far away from the fair value of the content. In my view, watching the underlying price is much more reliable than setting stops on options.", "score": 2, "replies": []}, {"body": ">when you think a downturn is looming. Obviously, everyone can sense a downturn is coming in the following months with rate hikes and inflation and xyz. Although I think there could be positive isolated bull runs before a big correction comes in March after rates are hiked up.\n\n[historical data since 1950s begs to differ](https://www.bloomberg.com/news/articles/2022-01-23/u-s-stocks-historically-deliver-strong-gains-in-fed-hike-cycles). if you think the bear market is coming, why aren't you buying otm puts instead of selling options?\n\nthe point of selling option is that time is on your side via theta decay. even if you're wrong short term, given properly selected underlying, enough time and carefully managed positions, you'll eventually come out ahead. trailing stop losses would defeat the purpose and it's much better suited for buying options or shares", "score": 2, "replies": []}, {"body": "There is no downside of it. I set it on all my stocks/options. I set it just under the 20EMA for stocks.  You can always buy in later at a lower price if you like the stock, but there is no point to hold it and erase all your gains if big correction or downtrend starts.", "score": -2, "replies": [{"body": "I appreciate the response. I have set a 10% trialing stop loss on all my stocks just as a safe guard and sort of wondered why more people don't talk about doing so. Thank you", "score": 1, "replies": [{"body": "Because people get brainwashed into holding long term and DCA when stock drops and people believe that you can't win by trading stocks only holding pays off. \n\nWhere is if you sell while up (with stop for example) and rebuy again at lower price, you'd be much better of. \nAnother reason would be that it take more time and effort than just holding.", "score": 1, "replies": [{"body": "Your absolutely right. Keep the good enlightening comments flowing. It's greatly appreciated. I'm wondering if a 10% trailing stop loss is too high of a % but then again AMD dropped almost 9% Friday so who knows I suppose it's a comfort level.", "score": 1, "replies": [{"body": "Everyone thinks they'll \"buy back in at the bottom\", like they can actually time the bottom. What ends up happening is your stop loss will get triggered and then the price will bounce, and you then have to decide if you want to wait until the stock drops further to buy back in (hint: you won't), or you end up having to buy your own stocks back for \\*higher\\* than you sold them for.", "score": 8, "replies": [{"body": "It's hard to time the exact bottom, you are right. You sell with stop loss and start accumulating small positions when stock starts showing an uptrend. It'll be higher then an absolute bottom, but still better off than holding all the way", "score": 2, "replies": []}]}, {"body": "10% is actually a very balanced and healthy gap for a trailing stop loss. You let the stock price wiggle a little and not get stopped out easily.", "score": 1, "replies": [{"body": "Where have you been the past 6 weeks?\n\nIf I had set 10% stop losses, I think every single one of my stocks would have been sold off.", "score": 5, "replies": [{"body": "Did you buy all the stocks in the market? If you are getting stopped out with a 10% stop loss your timing is pretty bad.", "score": -1, "replies": [{"body": "Trailing stop loss vs stop loss.", "score": 3, "replies": []}]}, {"body": "Everyone would of  been sold off for a 10% loss, buying back close to where he started, then get hit again for a 10% loss. Yeah he can have his losses.", "score": 1, "replies": []}, {"body": "Would that be a bad thing? You would've locked in profits in a scenario that seems like there is more drops to be had and you can buy them back at a discount.", "score": 1, "replies": [{"body": "You don't know that. Nobody knows that. You're a fool if you think you can time the bottom, or the top. \n\nSay my portfolio was 100% SPY. If I got stopped out with a trailing stop at -10%, then I would have sold at around $432 (SPY had a high of around $480). The vast majority of the time since then, SPY has been higher than $432. So when do you think you would have bought back in? Do you think you would have been so smart that you would have bought during that day or two where it was below $432?\n\nOr would you have thought \"no, not yet... I'll wait for it to go a little lower...\"? \n\nHow long would you keep your money on the sideline before you realized you had no choice but to buy back in, at a higher cost than you sold for? \n\nYou would have probably watched SPY go to 450, then 460, then 470, then 480, then 470... and then bought back in, patting yourself on the back for \"buying the dip.\"", "score": 1, "replies": [{"body": "I wasn't focusing on the #% with my comment, just the concept.  Personally, I have a 15% trailing stop loss on my investments (not trades) because my research indicated if the 15% got triggered then the market/stock typically went much lower, whereas 10% had a much greater chance of being a bounce point that would match your description.\n\nTo me, there comes a point where you have to trust your strategy + research and getting rid of the emotion.  If my stop loss of 15% gets triggered, I would be watching for stability to advise when I get back in...which we definitely don't have right now. That could mean I end up re-entering higher this time if it ended up turning around at 15%. However my research makes me think I have a greater probability that it allows me to preserve my winnings and a re-entry at a considerably lower price (which does not necessarily mean timing to hit the bottom).", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "it depends on how well you are at trading. I think apple will go down further and that's going by the economy news like Russia and rate hikes. I always just have a price in mind to get in at like with apple it would be start back in at 138 then slowly add as it drops . I use 138 because that was the lows of oct but it has held up really well so you just don't know if it'll get back down to those levels or not. i personally would just sell cc to raise money to buy more of your favorite stocks or more apple.", "score": 1, "replies": []}, {"body": "The volitility is just too much on options.  I did this when I first started selling options and some of my contracts ended up buying to close way too early because the stock jumped for a couple hours.  On stock they work great though.", "score": 1, "replies": []}, {"body": "It doesn’t work well when the crash happens after hours. Consider Buying puts to limit your loss in case of a rapid price drop after hours.", "score": 1, "replies": []}, {"body": "Yeah, locking in those losses.", "score": 1, "replies": []}, {"body": "Stop Losses work great.... during a single day. They do not trigger AH. So a large move AH will kill you.", "score": 1, "replies": []}, {"body": "The first time I set a stop loss, it was on a somewhat volatile stock I had bought. Within a few days the price had dropped, triggered my stop loss, and then gone right back up. The Market can always find a way to screw you.", "score": 1, "replies": []}, {"body": "If your security gaps down you can trigger a sale much lower that what you intended.", "score": 1, "replies": []}, {"body": "You're building in an automatic \"sell at the bottom\" if the stop loss gets triggered. Plus, with less liquid options, if the stop loss gets triggered, a market order might be issue and you will sell the option at the bid price which could give you a terrible fill. You could set a 10% stop loss, then lose another 10% because of the bid-ask spread, giving you a 20% loss on what could have been a temporary dip.", "score": 1, "replies": []}]}
{"title": "Inflation", "selftext": "", "id": "sr8n6e", "created_utc": 1644721810.0, "score": 83, "upvote_ratio": 0.87, "num_comments": 31, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|13|**First Seen In WSB**|9 months ago\n**Total Comments**|84|**Previous DD**|\n**Account Age**|9 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sr8n6e)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sr8n6e)", "score": 1, "replies": []}, {"body": "Going in for a gallon of milk at Costco and remortgaging your house because of your purchase.", "score": 16, "replies": [{"body": "I went in for catfood and I don’t even know what I bought, but I’m $300 lighter.", "score": -1, "replies": []}]}, {"body": "Never shop hungry.  You'll end up broke and fat.", "score": 6, "replies": [{"body": "Sucks when you shop hungry and high and forget you can't fit any of that shit in your freezer", "score": 3, "replies": [{"body": "You just have to smoke some more and cook all that shit up.  You'll have the munchies after you get done with the bowl anyway.", "score": 2, "replies": []}]}]}, {"body": "HEB is taking pieces of our soul. We pay them to take it. 3 days a week I stroll through HEB. Usually for just a few items. Never works out", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Also a terrible STI called Herpes Encephalopathy Botulinum.  Causes your brain to swell and your dick to go limp.  It is a real problem on WSB.", "score": 7, "replies": [{"body": "You deserve an award for this one!", "score": 1, "replies": []}, {"body": "That and bankruptcy are the two main causes of death on WSB. And that's a proven statistical fact.", "score": 1, "replies": []}]}, {"body": "It’s a grocery store in Texas.", "score": 10, "replies": [{"body": "That's kinda underselling it. It ain't a fucking food lion. Some of those fuckers are the size of an ikea", "score": 8, "replies": []}, {"body": "Wait, what other states? I couldn't even find it in other Texas cities\n\nOk I guess I'm bad at using Google maps", "score": -2, "replies": [{"body": "There’s used to be some in Arkansas and Louisiana in the 90s. Just googled and they are gone now I guess but I’m in Dallas and there’s 3 here.", "score": 1, "replies": []}]}]}, {"body": "OP probably does not realize HEB only exists in Austin, TX\n\nEdit: nvm, guess I didn't do my research", "score": -9, "replies": [{"body": "Ninja doesn’t know what he’s talking about, there’s branches in Dallas/ FTW, Houston and headquarters in San Antonio.", "score": 7, "replies": [{"body": "It’s also in Mexico lol.", "score": 4, "replies": []}]}, {"body": "There’s literally 300+ HEBs in Texas.  The company is valued at over $32 billion.", "score": 2, "replies": []}]}, {"body": "Grocery store in Texas and a couple other states\n\n\nIt stands for\n\nHere\n\nEverything is\n\nBetter", "score": 1, "replies": []}]}, {"body": "I walk into Costco needing one thing, all all of a sudden I’ve spent $200.", "score": 0, "replies": []}, {"body": "Do they have a casino inside?", "score": 1, "replies": [{"body": "They do have Buddy bucks so technically yes", "score": 3, "replies": []}]}, {"body": "HEB has Pecan treasures shortbread cookies", "score": 1, "replies": []}, {"body": "HEB is meta", "score": 1, "replies": []}, {"body": "Heb is great.  Let’s not get things twisted.", "score": 1, "replies": []}, {"body": "Texas life", "score": 1, "replies": []}, {"body": "Fort worth only has expensive HEB aka central market", "score": 1, "replies": []}, {"body": "Literally had this conversation this morning 😂 H‑E‑B is addicting.", "score": 1, "replies": []}, {"body": "Easy answer - I bought a bottle of Cristal", "score": 1, "replies": []}, {"body": "No kidding, went and got a gallon of milk, two bags of Fritos, a box of popcorn, a small gift for my daughters teacher and ended up paying like $50.  WTF, but for real.", "score": 1, "replies": []}]}
