{"title": "$NIO: Realistic Expectations for Monday and Beyond", "selftext": "[deleted]", "id": "ku3v4z", "created_utc": 1610240561.0, "score": 49, "upvote_ratio": 0.93, "num_comments": 62, "comments": [{"body": "I feel like last week's run was based on the December delivery numbers...And they just killed it with NIO Day.  Was anybody expecting a partnership with Nvidia?!\n\nIn my amateur opinion, we're more likely to see $70 before $50.", "score": 58, "replies": [{"body": "More like $30 imo.", "score": -11, "replies": [{"body": "You are a bear who missed out!", "score": 3, "replies": [{"body": "They dont have any innovations that screams nio.. It's like all they do is catalog shopping. Nvidia for this catl for that..", "score": -1, "replies": [{"body": "You know they have a product right? Do you keep up with an actual production updates?", "score": 1, "replies": [{"body": "I know they have but outsource their manufacturing process. I am not keeping up with nio production updates. I am keeping up with Tesla information.\n\nAs far i see Nio succeed is in china only. I dont believe they will succeed in europe. But everything better then sh.tty ice vehicles.", "score": 0, "replies": []}]}]}]}, {"body": "!Remindme 1 day", "score": -1, "replies": [{"body": "!Remindme this comment 36 hours", "score": 2, "replies": []}, {"body": "!Remindme 1 day", "score": 1, "replies": []}, {"body": "There is a 11 hour delay fetching comments.\n\nI will be messaging you in 1 day on [**2021-01-11 12:12:28 UTC**](http://www.wolframalpha.com/input/?i=2021-01-11%2012:12:28%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/ku3v4z/nio_realistic_expectations_for_monday_and_beyond/gir9mhf/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fku3v4z%2Fnio_realistic_expectations_for_monday_and_beyond%2Fgir9mhf%2F%5D%0A%0ARemindMe%21%202021-01-11%2012%3A12%3A28%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ku3v4z)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "well that didnt take long for that comment to age badly", "score": 1, "replies": [{"body": "It didnt hit 70 tho", "score": 0, "replies": [{"body": "you said 30. Came a lot closer to 70, still close in fact", "score": 1, "replies": [{"body": "Whatever dude started with 58.. What matters if they can get profitable instead 1.4billion in losses every quarter... Nio burns cash quick", "score": 0, "replies": [{"body": "lol so does most expanding businesses. Your argument has the same value as your past comment predicting it to be 30 today, that you also quickly dismissed yourself as \"not being the point\" once you were proven wrong.\n\nbest of luck in your investments", "score": 1, "replies": []}]}]}]}]}, {"body": "Hey there", "score": 1, "replies": []}]}]}]}, {"body": "70 EOW", "score": 41, "replies": []}, {"body": "I swear you guys are all looking at share price like it’s some imaginary instead of looking at the company market value. If it hit 100 it would become a top 80 market cap company in the entire world. I’m not saying it’s impossible since the market is crazy these days but gotta consider that", "score": 43, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Been reading more and more that big investor opinions are that with ease of trading and zero cost commissions that people who \"don't care about fundamentals and metrics\" are driving the market big time. Among other things of course.", "score": 3, "replies": []}]}, {"body": "But Matthew McConaughey say it just fugazzi", "score": 8, "replies": []}, {"body": "I feel like that’s how the markets operate these days for early stage companies. People look at the price and think “a few dollars more is still worth it” even though it actually adds a billion onto the company’s value. Then that price becomes normalized and the same process happens.", "score": 8, "replies": []}, {"body": "Fundamentals don’t matter in this market. Stop thinking valuations sell more than Memes, bc they don’t...", "score": 0, "replies": [{"body": "Fundamentals don’t matter for sub 50b companies yes I’ll agree. Getting to 200b is a little different", "score": 4, "replies": [{"body": "Tell that to Tesla.", "score": 4, "replies": []}]}]}, {"body": "Why not. If company like Dash and QS can be over 100, so can Nio which has actual solid, products. The only stopping block is CCP", "score": -3, "replies": [{"body": "Share price doesn't just start from $1 and count upwards. Market capitalization is what matters", "score": 5, "replies": []}]}]}, {"body": "Great questions, I'm interested too. Putting in close to the same amount.", "score": 5, "replies": [{"body": "I know everyone speculates, but what comes next after NIO day. Stagnation or gradual increase in stock value. No one discussed that expected the long term year outlook.", "score": 3, "replies": []}]}, {"body": "$70 EOW but also expect XPEV and LI to ride along.", "score": 10, "replies": []}, {"body": "NIO day was fairly anticlimactic for me. I'm a bull on NIO but I was hoping for expansion into other countries or something earth shattering... a lot of what they talked about was no secret.  \n\nThe Nvidia partnership is a bit of a surprise and helps establish them as a real serious automaker.\n\nThe timelines given for the new vehicle (ET7) is not very aggressive...\n\nMy price prediction is flat until the 20th and then once Biden is sworn in we should see steady climb to $80 before eoy", "score": 11, "replies": [{"body": "> The Nvidia partnership is a bit of a surprise \n\nI don't get the partnership part tbh. They're Nvidia's customer. Same with Qualcomm.", "score": 3, "replies": []}, {"body": "Their production capacity ramp up increase would not be able to accommodate for a new vehicle earlier on. The technology for et7 is also obviously still under development - they didn’t showcase any features live.\n\nBattery/battery station upgrade was really good, with carbon credits = great, with direction of 2022 with et7 = amazing.", "score": 2, "replies": []}, {"body": "i think nio day was priced in along with delivery numbers with this past week's runup. pretty sure we see a sell the news and then a slow and steady consilidation/growth afterwards, maybe looking for the new stimmy spike.\n\n(tbh i sold a bunch of 75c and im looking for confirmation bias 😅)", "score": 1, "replies": [{"body": "Selling the news is a common theme, look at Tesla battery day. If you zoom out though that was just a blip on the chart. The reality is nobody knows what's gonna happen and most of us are making wild predictions that fit out narratives", "score": 3, "replies": []}, {"body": "Usually it's sell the news right ?", "score": 1, "replies": [{"body": "right. id say that nio day wasnt so massively \"revolutionary\" for it to explode anymore than it has, but rather provides strong guidance for future. so it might even continue growing but vol would still drop. maybe an example would be SE, when they had earnings they missed but provided very strong guidance and even though it dipped its continued its rampage even now", "score": 1, "replies": []}]}]}, {"body": "Aren't they looking into Norway already?", "score": 1, "replies": [{"body": "Yes, they didnt really talk about that or other expansion though", "score": 1, "replies": []}]}]}, {"body": "Buy a 2022 leap and forget about it. That's what I did a few months ago and working out great so far.", "score": 5, "replies": [{"body": "I'm thinking about going for 2023. Will do you think it'll be by then?", "score": 2, "replies": []}]}, {"body": "🤟", "score": 3, "replies": []}, {"body": "If NIO is still in the low 50$ range, i think there will be lots of buyers getting in. This stock is going to blow up big time. Everything what they have announce has been really good. I am thinking 65-70 range end of week.", "score": 3, "replies": []}, {"body": "Something tells me they’ll be a slight sell off in the beginning of the week and bounce back towards the end", "score": 2, "replies": []}, {"body": "I think it won't go up significantly in the short term because of the present run up, not to mention if the price was fixed in. Plus there should be some people profit taking, I hope there is a drop followed by another run up.", "score": 2, "replies": [{"body": "I agree, I think it’ll trade sideways for a bit, probably dip for a day or 2 then continue it’s run. I wonder however if it’s strong enough to stay positive if there is any type of economic downturn which doesn’t seem to likely.", "score": 2, "replies": []}]}, {"body": "Thinking about buying Nio, I was resisting but I missed the boat with Tesla so don’t want to miss this boat either. Is there going to be an extra fee because it’s a Chinese stock? Using vanguard", "score": 2, "replies": [{"body": "I'm mean this thing is up 2000 percent since that start of 2020 so I think you missed the boat already", "score": 12, "replies": [{"body": "That’s a fair assessment", "score": 5, "replies": [{"body": "It’s not done yet. Still some room to go. You could’ve said the same thing after Tesla split", "score": 2, "replies": []}]}, {"body": "I disagree. Nio is at $60 or so now. Getting in now and if Nio makes it to $100 in a year. that'd not be \"missing\" the boat completely.", "score": 2, "replies": [{"body": "Why do people belive a company can gain 60 billion in market cap by just revealing a new car, its a bubble and he could ride it further or he could be putting money at the top", "score": 5, "replies": [{"body": ">by just revealing a new car, \n\nnever said that. Nio grew tremendously the past year. I'm just saying, if you believe in the company (and do your dd)... there's always room to grow. You don't know what's gonna happen in the future.\n\nFor all we know Nio might be selling their cars in SE Asia 2-3 years from now. Who knows?", "score": 1, "replies": [{"body": "Nio company is great just like tesla but it is so overvalued, why should it gain 60 billion dollars in market cap, thats not a small number, nio may deliver 100 thousand cars this year, that in no way justifys 60 billion dollars in market cap, I owned some nio, I bought at 11 and rode up and sold at 49, because its simply way to overvalued, not because its a bad company, its priced for years and years of growth and then some, I would not buy now but thats just my choice", "score": 4, "replies": [{"body": "I agree it's overvalued but look at Tesla. how long has the \"it's gonna crash\" comment been made. Even elon himself said the stock is overpriced in March 2020 or so.. yet it's been growing ever since.", "score": 2, "replies": [{"body": "If you honestly think tesla will just continue to go up forever you are wrong, tell my why in every bubble people always say \"this time its diffrent\" that quote was literally created because its never diffrent. Don't get caught up in the euphoria, its nice while it lasts but when it ends its not so pretty", "score": 0, "replies": [{"body": "I don't understand why you keep putting words in my mouth. I never said Tesla will continue to go up forever and I'm not saying NIO will continue either.\n\nWill Tesla and Nio get corrected? Likely yes. When? Who knows. That's my point, no one knows. That's it. There might still be time to get on board. But you can't say for certain they have missed the train. For all you know Nio could have the Tesla experience for the next year or so before correcting itself. but you could also be right and Nio could crash next week.", "score": 2, "replies": [{"body": "As I wrote bellow bubbles are dangerous and you need alot of discipline to get out before the burst", "score": 0, "replies": []}]}]}, {"body": "Also, getting out before a bubble bursts is extremely difficult because, the bubble pop will not be obvious go on macro trends and look at any tech stock from 2000 you will see the pop is really gradual, it looks like a dip so you hold and eventually you ge wiped out, bubbles are dangerous because its hard to get out early and miss out on potential profits because of fomo", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "70 mid-week easy. Those were major announcements and revelations.", "score": 2, "replies": []}, {"body": "I’m bullish on Nio long term but watch Meet Kevin’s latest video on his unbiased insights on Nio day. He is credible and ain’t a bear since he has >$500k worth of Nio stocks/options himself. \n\nhttps://youtu.be/yyU9lSXcbVs", "score": 2, "replies": [{"body": "Never justify what a stock is worth based on some YouTuber trying to get clicks.... it’s no better than a Morgan Stanley or Goldman article.", "score": 5, "replies": []}]}, {"body": "20-30 easy. 100-200 end of year. it’ll jump like fiver. Steady growth.", "score": -3, "replies": []}]}
{"title": "TSLA recent article", "selftext": "Apparently lots of flaws are coming out with delivery of new Tesla’s, cant see it having much effect on stock value but may be a useful comparable when looking at other EV producers.\n\n\nhttps://driving.ca/tesla/auto-news/news/tesla-vehicles-shipped-with-missing-bolts-and-gaps-between-panels", "id": "kuknh7", "created_utc": 1610306061.0, "score": 38, "upvote_ratio": 0.79, "num_comments": 62, "comments": [{"body": "+ 8%", "score": 49, "replies": [{"body": "This is so bullish. If they can grow 800% with quality issues, imagine what the stock price will look like when the issues get fixed!", "score": 15, "replies": []}, {"body": "Laughed way too much reading this hahah", "score": 4, "replies": []}, {"body": "TSLA 2000c", "score": 3, "replies": []}]}, {"body": "This won't have any effect on the stock price.\n\nTesla build quality has always been known to be lower quality, and usually improves significantly as vehicles ramp up in production.\n\nI've been seeing these articles since I bought at $200 pre split. If it didn't hurt Tesla then, I doubt its gonna hurt them now", "score": 30, "replies": [{"body": "“If you have this issue let us know, we’ll just give you a new model after it’s fixed. Here’s $500 too, idk what else to do with it.” - Elon", "score": 11, "replies": [{"body": "Where I work, we see a lot of different cars. New cars, many of which we see up to a year before you can buy them.\n\nIt's almost unanimous here that Teslas, particularly the 3 feel...how can I say? \"Disposable\". More so than just about any other marque.\n\nEven the budget TATA thing we had in not that long ago, whilst cheap and objectively not as nice as something like a Tesla at least felt properly put together. \n\nID3 is much the same actually. Definitely less svelte inside. It's minimal like the Tesla but somehow more austere, but the thing feels like it would still look like new in 10 years time. It's solid.", "score": 6, "replies": [{"body": "Damn, that sucks. I never tried one, good to know though.\n\nJust means NIO has a better opportunity than I thought", "score": 1, "replies": []}]}]}]}, {"body": "Tesla cock cleaners will ignore anything that isn’t positive news", "score": 58, "replies": [{"body": "This man is correct. source: me, the Tesla cock cleaner", "score": 32, "replies": [{"body": "You're like that one DC protestor who gargled animal cum.", "score": -11, "replies": [{"body": "No sir, that does not sound like something I would do.", "score": 9, "replies": []}, {"body": "WHAT??", "score": 4, "replies": []}]}, {"body": "In Papa Elon we trust.", "score": 1, "replies": []}]}, {"body": "😂 good point!", "score": 5, "replies": []}, {"body": "They’ve had crazy QA issues since they’ve come out. Uneven gaps, design flaws, poor quality of parts, some even catch fire due to the cooling systems...this has always been the case, none of this is a surprise.", "score": 1, "replies": [{"body": "There are plenty of reports of Kias and BMWs alike catching fire while parked. I'll give you that Tesla has had QC problems in the past (not sure about currently-I'd expect more at end of qtr), but the fire thing is enormously overblown.", "score": 1, "replies": [{"body": "It's certainly a combustible topic", "score": 1, "replies": []}]}, {"body": "Rear bumpers tearing off Model 3’s in rainstorms is a recent one. That’s a design problem that was solved by every other OEM decades ago.", "score": 1, "replies": []}]}]}, {"body": "There is a gap to fill between TSLA and Tesla the business.  Either TSLA will crash or Tesla will grow to justify its valuation.  I have no idea what will happen so I'm not touching TSLA.", "score": 37, "replies": [{"body": "You’re wrong, Elon Musk figured out the infinite money glitch", "score": 8, "replies": []}, {"body": "I’m cautious of it as well, but I do find they are a good basis to compare up and coming companies against in the ev market", "score": 4, "replies": []}, {"body": "Cool story bro.", "score": -9, "replies": [{"body": "Go back to 2007.", "score": 3, "replies": []}]}]}, {"body": "Have you ever seen recall lists for normal automobiles? they are insane", "score": 6, "replies": [{"body": "Yep! But they also affect stocks on each negative report", "score": 3, "replies": [{"body": "Not usually. Every model ever has a huge list. Some not found out until years after release", "score": 5, "replies": [{"body": "That’s true yes, but the “premier” models are the ones of concern, especially if they continue to use the same components as what failed", "score": 1, "replies": []}]}]}]}, {"body": "Yeah, but in 10 years Elon has promised to adopt me and said that Tesla will be perfect!!! You're just a hater!!!!\n\nOr something like that...", "score": 13, "replies": []}, {"body": "I think TSLA will remain insanely overvalued until one of two things happen.  (1) some sort of black swan event like a massive law suit related to quality control issues or (2) there is finally a competitor.  Right now they are really the only show in town.", "score": 5, "replies": [{"body": "NIO might kind of a competitor in a way. Just for the cars and a few other things. \n\nI was actually wondering if TSLA will go flat while NIO spikes tomorrow", "score": 3, "replies": [{"body": "NIO is not really a competitor. They only sell in China and said themselves that they were selling in the high-end, luxury car space. Telsa is on a mission to drive costs down and commoditize EV's. Maybe XPENG or Li Auto is more of a competitor for value cars. \n\nThere is lots of competition brewing in the EU. VW has some great EVs and there are others showing up every quarter.", "score": 6, "replies": [{"body": "With how US and other European countries banning Huawai, it might be a risk that they will also ban Chinese EV citing security concern.\n\nI'm staying away from all Chinese stocks.", "score": 3, "replies": [{"body": "I doubt it, especially with Biden as president. Plus, Nio teaming up with Intel and Nvidia is huge. I think it truly legitimizes them. Nio also plans to sell cars in Europe by the second half of this year. I'm not sure what the obstacles to that would be, but I'm going to keep buying and hope for the best.\n\nIf they blow up, even 60 a share looks like a steal. Or I could just lose all my money lmao", "score": 1, "replies": []}]}]}, {"body": "Was wondering the same thing. I already put 1 TSLA into NIO before NIO day.", "score": 2, "replies": []}, {"body": "Have you ever seen a NIO vehicle in person though?", "score": 1, "replies": [{"body": "Yea dude, my uncle works at NIO and I got tickets to NIO day.", "score": 3, "replies": []}]}]}, {"body": "truth", "score": 1, "replies": []}]}, {"body": "Don't know much about cars, which car company has the best tolerances for gaps and spacing?", "score": 2, "replies": [{"body": "Honestly I don’t know either, I posted this more for comparable info going forward", "score": 1, "replies": []}, {"body": "Porsche.", "score": 1, "replies": []}, {"body": "Germans", "score": 1, "replies": []}]}, {"body": "LEGIT 8 days ago: [here](https://www.reddit.com/r/stocks/comments/kozaga/tesla_reached_its_target_of_500k_vehicles_despite/ghufe3u?utm_source=share&utm_medium=web2x&context=3) I wrote Tesla makes no sense at $685B\n\nToday 4 hours: [here](https://www.reddit.com/r/CanadianInvestor/comments/ku6x3z/tesla_had_a_revenue_of_28_billion_in_2020_how_is/girr82c?utm_source=share&utm_medium=web2x&context=3) I wrote Tesla makes no sense at $835B\n\nIn 8 days, nothing changed for the firm. NOTHING. Yet it increased $150,000,000,000 in market cap, and the markets don't seem to flinch.\n\nI AM SO annoyed because I know when it (eventually) tanks, it will cause a mass hysteria with headlines like NASDAQ VICIOUSLY DROPS, TRADERS RUN FOR THE HILLS, HAS YOUR ETF INDEX LOST 30% in 1 month?\n\nIt will fuck all of us. Stonks.", "score": 7, "replies": [{"body": "The reason for the recent increases have been because the benchmark funds that pace with the S&P 500 have been buying up shares. \n\nWhen there are more buyers then sellers the stock price increases", "score": 3, "replies": []}, {"body": " 🌈🐻", "score": 2, "replies": []}, {"body": "Not trying to hate, but are you just annoyed that you didn't jump onto the meme rocket? Sometimes the mind will try to do mental gymnastics to justify why you didn't make money.", "score": 1, "replies": [{"body": "No not at all. I am annoyed because it is getting to the level of hysteria and it will hurt everyone including those who are not in it.\n\nThere are many stocks running up all the time. None at this level, so very impressive but very scary.", "score": 2, "replies": []}]}]}, {"body": "Tesla has always delivered cars with quality control problems. This will never change under Musk's leadership. The stock price is all that matters, the cars can keep sucking as long as they're EV and people buy them to support a mission to Mars.", "score": 4, "replies": [{"body": "Yup, 3 years ago my car went straight to the body shop for 3 weeks after pick up to fix flaws. Last year same thing with my coworkers car. Stock has only gone up during that time. People overlook the QC issues because it’s a Tesla.", "score": 1, "replies": []}]}, {"body": "These are NOT flaws it’s just that the cars are actually designed for Mars. /s", "score": 2, "replies": []}, {"body": "And sour Grapes Tesla haters will always be bummed they missed the boat and trash Tesla to quell the FOMO.", "score": 4, "replies": [{"body": "Very true, I made a killing so I’m happy! But it’s a good basis for comparison for up and coming ev’s!", "score": 3, "replies": [{"body": "Unrealized or realized return?", "score": 1, "replies": [{"body": "I sold 1/3 of my tesla stock to buy a cyber truck. The rest is still riding this crazy moon ride...", "score": 3, "replies": [{"body": "TSLA into Tesla I like that", "score": 3, "replies": []}, {"body": "I sold all on the hopes there’s a slight dip or “correction” as they say in the next couple weeks where I’ll rebuy", "score": 2, "replies": []}]}]}, {"body": "Me too. I'm buying a Cybertruck  with  my Tesla stock gains. Haters gonna hate.", "score": -1, "replies": []}]}]}, {"body": "There was a big story reported recently about quality issues at the Shanghai factory:\n\nhttps://ah5ogmuvk7u6254pbafpxyevdu-adwhj77lcyoafdy-www-pingwest-com.translate.goog/tag/17360\n\nBecause it's a Chinese outlet, many dismissed it as pro-Nio propaganda.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "GM has already been selling sub-$30k EVs in the form of the Bolt after all the discounts and subsidies. It's a perfectly capable vehicle and seemingly nobody wants it.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The Bolt is, you're thinking of the Volt which was discontinued. VW could be a credible competitor in the near future (I'd put them and Hyundai-Kia as the best there if battery supply is adequate).\n\nLucid has only announced a Taycan or Model S equivalent currently and has mostly been known for delays. Maybe they'll be more of a factor come 2023 depending on what \"Project Gravity\" winds up being.", "score": 1, "replies": []}]}]}]}, {"body": "All vehicle producers have similar issues; Tesla needs to just get in front of it, and fix these issues for the vehicles affected; and put processes in place to make it not occur again.\n\nJk this is the end of Tesla", "score": 0, "replies": []}]}
{"title": "I bought a CBOE subscription, gather up lads.", "selftext": "Greetings fellas, I've been working on a website for viewing options data. RH straight up doesn't have the chart for a lot of contracts, and even then it's a week of data maybe. thinkorswim is great with the thinkback feature, and you can find a lot of things you need, but no expired contracts for the FOMO lovers, and the whole platform isn't written in crayons like RH is, so it's pretty hard to digest.\n\nMeet [https://diamondhands.trade/](https://diamondhands.trade/), a website hooked up with that fishscale straight from CBOE. I have a subscription for EOD quotes that I bought like 2 weeks ago (Dec 28th). All strikes, all names (4000 of them), if CBOE knows, diamondhands knows.\n\nhere's a couple FDs that would have paid bigly last week:\n\n[https://diamondhands.trade/?symbol=SNOW&strike=300&exp=2021-01-08&bear=false](https://diamondhands.trade/?symbol=SNOW&strike=300&exp=2021-01-08&bear=false)\n\n[https://diamondhands.trade/?symbol=TSLA&strike=800&exp=2021-01-08&bear=false](https://diamondhands.trade/?symbol=TSLA&strike=800&exp=2021-01-08&bear=false)\n\nThere's lots of data points, underlying, greeks, IV, Volume, OI, etc.\n\nhave fun lads n lass", "id": "ku2zrg", "created_utc": 1610237618.0, "score": 110, "upvote_ratio": 0.97, "num_comments": 59, "comments": [{"body": "This is awesome, but can you provide me this date BEFORE it has happened... that’ll be great\n\nAnd that TSLA call... fuck me!!!!", "score": 33, "replies": []}, {"body": "Hey you may be violating some CBOE data redistribution rule for sure so hide your tracks if possible.", "score": 26, "replies": [{"body": "holy shit I hope not. I mean I checked the box that said I planned on distributing it. Are you a cop?", "score": 29, "replies": [{"body": "I wish I was a cop. I would be close to pension for life and not need to talk to you retards.", "score": 8, "replies": []}, {"body": "~~You have to be careful redistributing real-time data. Options data is entitled and you are liable for the fees that come with that.~~\n\n~~These fees include but are not limited to:~~\n\n~~Up to $1.25 per user, per month (non-professional)~~\n\n~~Up to $31.50 per user, per month (professional trader)~~\n\nOOPS: I now see that it’s EOD!", "score": 6, "replies": []}]}]}, {"body": ">please rotate your device\n\nNo ty", "score": 24, "replies": [{"body": "pls :(", "score": 12, "replies": []}]}, {"body": "You and /u/pizzabeercode combine forces plz so I can lose my money faster.", "score": 11, "replies": []}, {"body": "i realize it's a new site but here are some notes/thoughts:\n\n* the purple color on black background is hard to see\n* using variable names for filters/display isn't aesthetically pleasing\n* format the numbers pls\n* pls make the search bar have suggestions and then update the available expirations/strikes accordingly", "score": 8, "replies": [{"body": "1. Fair, I could probably add a feature to let you pick your own colors.\n2. Yup, agreed, I'm just a tad lazy and I don't mind it.\n3. Yup, agreed, I'm just a tad lazy and I don't mind it.\n4. Harder than you might think, but maybe one day.\n\nThank you for the feedback!", "score": 7, "replies": [{"body": "\\#4 difficult because the structure of the data or wot?\n\nalso would be nice when entering a ticker if the available strikes are returned for a selected date. even if you return a dictionary where the key is the expiration and each expiration contains a list of strikes. basically if the intent is to see option activity it isn't time efficient to have to enter each strike manually. what i'm getting at is make an api and lemme bypass the ui while reaping all the benefits and sending your bank account to oblivion!", "score": 2, "replies": [{"body": "reads on my db are capped, go nutz. You'd be hoggin' the data bigly tho, kind of a dick move IMO.", "score": 3, "replies": [{"body": "can you expose some sort of rest or gql api? or refactor the frontend with bootstrap? its a pretty solid standard design.", "score": 2, "replies": [{"body": "Nice use of buzz words.", "score": 4, "replies": [{"body": "This is standard software design lol.", "score": 2, "replies": [{"body": "I know. Theres already a rest api exposed, otherwise the app wouldn’t work. Bootstrap is just a css library, I’m not choosing to use it on this project, in lieu of material ui.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "also /u/King_Tendie_69 do you have all tickers and all strikes/expirations? or is it a curated subset based on some criteria?", "score": 2, "replies": [{"body": "all tickers, all strikes.", "score": 1, "replies": []}]}, {"body": "Hey buddy, i changed the blue to be lighter, should be easier to see now. I also removed the glip glop from the variable names, should be nicer now too. I also gave you dollar signs on the axis when applicable.", "score": 2, "replies": []}]}, {"body": "Wth is this good for....? Will it tell me what to put my money on?", "score": 4, "replies": [{"body": "It shows you fomo lines that will have you dropping stacks on way otm fds on tsla and nio watching your RH account tank week after week.", "score": 5, "replies": [{"body": "The key is to turn your phone upside down", "score": 2, "replies": []}]}]}, {"body": "This is great.\n\nAny chance of overlaying the stock chart?", "score": 3, "replies": [{"body": "You can plot the underlying price, play around a bit, if you find a bug be a lad and lmk.", "score": 3, "replies": []}]}, {"body": "Very cool.  How much does that run you for the data feed?  How do you personally use it to place bets?", "score": 4, "replies": [{"body": "the data itself is 1k yearly. AWS and heroku fees eat me monthly too. I like to plot IV to see how it effects the price, but you can play around with it however you want!", "score": 5, "replies": []}]}, {"body": "u/King_Tendie_69 Thanks for this! it would be great if u could add feature to see the price change based on Implied volatility.", "score": 2, "replies": [{"body": "You can plot IV.", "score": 1, "replies": [{"body": "Hmm I see. But would it be possible for you to add an option to check the change in the options price based on IV CHANGE? Also does it only show the price history of the last two weeks ?", "score": 2, "replies": []}]}]}, {"body": "Remind me! 5 days", "score": 2, "replies": [{"body": "There is a 12 hour delay fetching comments.\n\nI will be messaging you in 5 days on [**2021-01-15 01:58:13 UTC**](http://www.wolframalpha.com/input/?i=2021-01-15%2001:58:13%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/ku2zrg/i_bought_a_cboe_subscription_gather_up_lads/gipwz52/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fku2zrg%2Fi_bought_a_cboe_subscription_gather_up_lads%2Fgipwz52%2F%5D%0A%0ARemindMe%21%202021-01-15%2001%3A58%3A13%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ku2zrg)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Remind me! 4 weeks", "score": 1, "replies": [{"body": "I will be messaging you in 28 days on [**2021-02-12 02:29:10 UTC**](http://www.wolframalpha.com/input/?i=2021-02-12%2002:29:10%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/ku2zrg/i_bought_a_cboe_subscription_gather_up_lads/gjauzk4/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fku2zrg%2Fi_bought_a_cboe_subscription_gather_up_lads%2Fgjauzk4%2F%5D%0A%0ARemindMe%21%202021-02-12%2002%3A29%3A10%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ku2zrg)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Sorry but for tye dummies, how can I use this productively to make a little scratch?", "score": 2, "replies": []}, {"body": "Please rotate your device. Tried to flip my MacBook. Didn’t work.", "score": 2, "replies": []}, {"body": "What is this website made on?", "score": 2, "replies": [{"body": "This website is a react app hosted using firebase, a node.js API hosted on heroku, and a DynamoDB instance hosted on AWS.", "score": 2, "replies": [{"body": "Thank you good sir.", "score": 3, "replies": []}]}]}, {"body": "That TSLA 120x bagger", "score": 2, "replies": []}, {"body": "Great tool - have been looking for something like this for a while now.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah I just got off the phone with a homie at CBOE, he couldn't give me a 100% cut and dry answer, the legal mumbo jumbo is egregious. I pointed the site out to him, and he's gonna get back to me. Nice fella.", "score": 1, "replies": []}]}, {"body": "Ban this mofo. We need option that's going to print not would have. Who cares about last week?", "score": 2, "replies": []}, {"body": "Thanks !!!!", "score": 2, "replies": []}, {"body": "External links to guru cliques are sus.", "score": 2, "replies": [{"body": "You think I'm a guru? I'm flattered.", "score": 5, "replies": [{"body": "A possible faker. There's plenty of scammers on finance spaces across the internet where they give links to get them into a site they control where they can ask for money for this/that service that doesn't exist. Mind you, there have been actual market manipulation schemes on this sub.", "score": 1, "replies": [{"body": "Yup I'm a market maker trying to front run you, ya got me. Jigs up.", "score": 8, "replies": []}, {"body": "Dumb advice, but if you use any site and want to make sure they're not front running you, check the network tab in chrome dev tools. I like [stonks.fyi](https://stonks.fyi) (someone posted about this, not mine), and this one seems pretty neat too", "score": 1, "replies": []}]}]}]}, {"body": "wtf does it says \"plz rotate ur device\" when I click ur links?", "score": 2, "replies": [{"body": "because the site is designed to be used in landscape mode.", "score": 4, "replies": [{"body": "wtf is that? I've never heard of that", "score": -8, "replies": [{"body": "It means you have to check the site out on an open field otherwise doesn't work...", "score": 11, "replies": []}]}]}]}, {"body": "Honestly, looks like shit. But I'm hoping that's because much of the design was an afterthought and you wanted to get the data and functionality right first. Has potential if you formatted it better. Some of the functionality is broken though. You zoom in then out and you can't zoom in again. The UI needs some major improvements as well.\n\nBut maybe I'm just salty because I've been working on something similar and have been just cURL'ing CBOE's Options JSON data per stock.", "score": 1, "replies": [{"body": " Ok 🌈🐻", "score": 3, "replies": []}, {"body": "Sounds like someone is jelly", "score": 1, "replies": []}]}, {"body": "u/King_Tendie_69 your website was helpful so far but unfortunately it doesn't graph for calls exp in march. Tested for SKLZ & FUBO. Happen to know why? Thanks!", "score": 1, "replies": [{"body": "[https://diamondhands.trade/?symbol=SPY&strike=380&exp=2021-03-19&bear=false&sc1=bid\\_1545&sc2=ask\\_1545](https://diamondhands.trade/?symbol=SPY&strike=380&exp=2021-03-19&bear=false&sc1=bid_1545&sc2=ask_1545)\n\nit definitely has march exp data. Regarding those tickers, maybe the contracts only became available yesterday?", "score": 1, "replies": [{"body": "I’m not sure since I didn’t have a pos previously. Will give you an update next week. Thanks!", "score": 1, "replies": []}]}]}, {"body": "I know I'm a bit late but I'd been looking for this data for a long time. Thanks a bunch my man!", "score": 1, "replies": []}]}
{"title": "Some TSLA loss porn among all you winners", "selftext": "", "id": "ku3dkn", "created_utc": 1610238882.0, "score": 129, "upvote_ratio": 0.95, "num_comments": 66, "comments": [{"body": "Yeah bruh you goin have to explain this one for sure", "score": 75, "replies": [{"body": "I bought presplit at 1650 thinking that this thing cant get any higher and I have just been proven wrong over and over again. Pretty much it.", "score": 36, "replies": [{"body": "If you have enough to cover margin, we will see $500, so might be okay eventually", "score": 7, "replies": []}]}]}, {"body": "Ahhh yes I love jacking off to this loss porn I’m cumming", "score": 14, "replies": []}, {"body": "Jesus take the wheel.", "score": 13, "replies": [{"body": "its gotta come back down sometime right?", "score": 9, "replies": [{"body": "Hmm what’s that saying about the market, time and solvency? 🤔", "score": 7, "replies": [{"body": "The market can remain irrational longer than you can remain solvent", "score": 1, "replies": [{"body": "In fact I'm pretty sure the market chooses some people to specifically screw over.  There's a lot of collateral damage/winners but it sure gets that one guy/gal.", "score": 1, "replies": []}]}]}, {"body": "Don’t short the tulip mid bloom my friend. This is a once in a life time shift for humanity to the stars. People aren’t buying telsa, they are buying the dream of humanity colonizing space. Please think before you get margin called and consider using some options to hedge your short shares. <3", "score": 10, "replies": [{"body": "Tulip mania", "score": 2, "replies": []}]}, {"body": "Don't bet against meme stocks.  They don't follow natural laws.", "score": 3, "replies": []}, {"body": "Sorry, another split won't count.", "score": 2, "replies": []}]}]}, {"body": "If you're going to just give your money to Elon you might as well buy a Tesla", "score": 22, "replies": [{"body": "That's not how any of this works", "score": 9, "replies": [{"body": "How is Denverdude98 wrong?  Elon is the biggest stock owner and gets bonuses if the stock goes up.  Selling low and then being forced to buy high, as will happen here, will cause the stock to go up.", "score": 1, "replies": [{"body": "That isn't \"giv[ing] your money to Elon\"", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "I bought presplit at 1650 thinking that this thing cant get any higher and I have just been proven wrong over and over again. Pretty much it.", "score": 7, "replies": [{"body": "still doesn’t make any sense", "score": 25, "replies": [{"body": "I shorted the stock at 1650 or 330 after the split and since its rising im getting killed.", "score": 28, "replies": [{"body": "damn can’t believe you haven’t sold yet", "score": 15, "replies": [{"body": "I was a little greedy but I really didnt expect it to go up over 100$ in the last week.", "score": 5, "replies": [{"body": "What about all the other times it went up $100?", "score": 21, "replies": []}]}]}]}]}, {"body": "Yea, wtf, are you short... -130 shares?", "score": 5, "replies": [{"body": "yes I shorted 130 shares at 330$", "score": 6, "replies": [{"body": "And you held that position since then.. as in continued to balloon the fuck up.\n\nWell if you're hoping TSLA will drop back to below 330....  you might be MORE insane than the people that think It'll cross 1000.", "score": 26, "replies": [{"body": "I am 100% sure I will be taking a loss. I just hope it will drop back to a reasonable price first.", "score": 5, "replies": [{"body": "I'd love to see a sizeable dip so I can get on that train.\n\nTSLA is cult status in retail but now the institutions have bought in with S&P add.\n\nI don't think a nice drop is coming any time soon.\n\nGod speed short bus passenger!", "score": 9, "replies": [{"body": "thanks man good luck on your future trades", "score": 4, "replies": []}, {"body": "I think some of the institutions and big bois have started to scale out of the market for the short term. You can tell by the sell volume that's been coming in this past week. Senate race and capitol break in were perfect \"reasons/excuses\". They sold it off a bit on Friday too.", "score": 1, "replies": []}]}, {"body": "There's still chance of 20- 30% drop with institution correction base on this spike as they adjust portfolio size. It's just when and you'll have to quickly get out because I suspect lots of people going to go back in.\n\nIf you hold out for too long and Tesla decided to do another round of stock split... then it's going to be scary.\n\nbest of luck.", "score": 1, "replies": []}]}]}]}]}, {"body": "People would understand you, if you use the right terms.  You didn't buy, you sold.  Shorting a stock begins with borrowing the shares in order to sell them.  When you close the short position, you buy the stock back and return the borrowed shares (so you stop paying interest on the borrowed shares).", "score": 2, "replies": []}]}]}, {"body": "Haha you shorted it ya retard", "score": 4, "replies": []}, {"body": "Damn I went bearish for a little by buying $700 puts and losing almost instantly but with a meme stock like this you limit losses by going with capped loss plays. Can't do a naked short like this. You're going to get murdered", "score": 4, "replies": [{"body": "He was murdered.  It's just beating a dead horse at this point.", "score": 1, "replies": []}]}, {"body": "Bruh", "score": 4, "replies": []}, {"body": "Burry is that you?", "score": 3, "replies": [{"body": "Burry's losses are probably astronomical.", "score": 2, "replies": []}]}, {"body": "The only way to get it back is by doubling down on more puts. 👑", "score": 9, "replies": [{"body": "lol ive thought about it", "score": 1, "replies": []}]}, {"body": "I’m lost those are shares right? Or can someone explain to me please I’m special", "score": 2, "replies": [{"body": "He shorted it, meaning he took a bearish position on TSLA like an absolute tard", "score": 5, "replies": []}, {"body": "ya those are shares of tesla", "score": 1, "replies": [{"body": "💀💀💀", "score": 1, "replies": []}]}]}, {"body": "F\n\n^(tho once you close this short, it’ll likely fall)", "score": 2, "replies": [{"body": "F", "score": 3, "replies": []}]}, {"body": "Do you hate money?", "score": 2, "replies": []}, {"body": "I guess for you, \"In Burry you trust\"", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Pretty sure he’s short the stock not in put options which isn’t actually considered short", "score": 1, "replies": []}]}]}, {"body": "I'm surprised you haven't gotten a margin call with that loss.\n\n\"The market can remain irrational than you can remain solvent.\" \n\n\\- John M. Keynes", "score": 1, "replies": []}, {"body": "Just sit tight. Our savior will bring you salvation. In musk we trust.", "score": 0, "replies": []}, {"body": "Rekt. I never held TSLA consistently; held it through various ETFS indirectly. Couldn't validate the cost but now diving deeper into the solar and home battery etc ive actually put in market orders for Monday 10 mins ago.\n\nYou're rekt close those shorts this stock is not a car company, its not a technology company... its a fucking utility company sucking juice from the sun to power all the stuff it sells.", "score": 0, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/zortar the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "You’re fuckin retarded hahaha", "score": 1, "replies": []}, {"body": "this is a short... i don’t even need to look\n\ngay bears gonna gay", "score": 1, "replies": []}, {"body": "Rule number fucking 1 and 2 bruh. Never bet against Elon. Never short TSLA. Cover and hold man.", "score": 1, "replies": []}, {"body": "Take your loss now lol. Stonks only go up im never gonna understand why people choose to bet against a company. Its way more easy to buy a good company especially a company that will make the world better lol. We wont see 600 a share for tsla anytime soon. There is so much buying pressure plus big stimulus is coming and earnings is coming donkey.", "score": 1, "replies": []}, {"body": "I thought only Mr. Pleas Fly Again was capable of losing money on Tesla during the recent run.  You need a catch phrase for us to remember you by.  Pleas Charge Again?", "score": 1, "replies": [{"body": "Pleas die again", "score": 2, "replies": []}, {"body": "LOL Pleas Charge Again is pretty funny", "score": 1, "replies": []}]}, {"body": "F", "score": 1, "replies": []}, {"body": "hold my friend and enjoy watching the headless chicken over here once the bubble pops", "score": 1, "replies": []}, {"body": "My god, you're the type of retard that is oft talked about but rarely seen, at least people buying puts have fixed losses but to actually short the stock and have unlimited downside, wow. You got balls man, balls.", "score": 1, "replies": []}, {"body": "How do you have the mental balls to hold a short position this long? I sold a naked call last week and can't handle the emotions. This may plummet sometime but seeing the cult trend on it and people moving their 401ks and life savings into it, it's going to be while", "score": 1, "replies": []}]}
{"title": "Why NIO can't compete with Tesla. (both will continue mooning but Tesla is more legit)", "selftext": "[removed]", "id": "ku76rg", "created_utc": 1610252200.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 61, "comments": [{"body": "If the CCP wants electric vehicles to happen, it'll happen.", "score": 74, "replies": [{"body": "In less time than anyone can estimate", "score": 14, "replies": []}]}, {"body": "nio has more room to grow retard", "score": 39, "replies": [{"body": "Yeah and it has 1.4 billion people. If just a fraction of the city dwellers buy a NIO, we're in the green.", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 26, "replies": [{"body": "[deleted]", "score": -21, "replies": [{"body": "We are not talking about %.  We are talking about #.  China has the biggest EV market by number.", "score": 11, "replies": []}, {"body": "Per capita is irrelevant in this instance", "score": 8, "replies": []}]}]}, {"body": "Imagine knowing how to read", "score": 25, "replies": [{"body": "I just learned", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "How to read", "score": 1, "replies": []}]}]}]}, {"body": "So... calls on NIO?", "score": 26, "replies": [{"body": "Worth it, I’m picking some up", "score": 8, "replies": []}]}, {"body": "Autists 80 dollar leap calls expiring in 2023 are insanely cheap at 20$. Stop listening to these overly analyzed posts.  Nio is the chinese tesla  2 year i'm sure nio will surpass 100 🌕🌕🌕🌕🌕.", "score": 8, "replies": [{"body": "It has a multiplying factor of 100 u dumb fuck. It cost 2.2k now", "score": 4, "replies": [{"body": "i know that you idiot i said it costs 20 at the strike price .  you want one fuckn contract you pay 2k.  What i meant is getting to 100 share price in two fuckn years won't be that difficult.  mark my words nio will be at 100 by eoy", "score": 2, "replies": []}]}, {"body": "Isn't 600+ mile range expected to be in cars not before 2023? Or am I wrong?\n\nI think the newer models will be out before then just not with that battery. That possibly leads to lots of upgrading battery at 2023 release being a luxury ev.", "score": 1, "replies": []}]}, {"body": "China has like 56 cities with a million people according to The Office so your theory about rural areas making a difference is poop", "score": 16, "replies": []}, {"body": "I haven’t been to China, but don’t know if I would consider 4 months over 5 years extensive. That said if If China goes to even 30% ev that’s a huge increase in one of the biggest markets in the world. If you believe Tesla is fairly valued and think NiO could be  worth half, that’s like 8x from current price. Also you didn’t mention the new nio model as 620 mile range. Partnered with Qualcomm for 5g and Nividia for chips. Enough said.\n\nI own both Nio and Tesla.", "score": 7, "replies": []}, {"body": "I’d just like to point out. America being 100% ev. Is the Chinese equivalent of 30%. Since they have about 3x the population...", "score": 8, "replies": []}, {"body": ">This is important because electric cars will be nothing but a luxury item for rich people to buy in major cities, and not something the average person will want, or even be able to use effectively, if they live in the 90% of China which isn't a major city. It would be IMPOSSIBLE to build or maintain something like Tesla's impressive super charger network in China. Too much of it is rural\n\n\nOk and yet you’re saying buy Tesla\n\n\n> Basically, no one wants to own a NIO. Even if it isn't just a cheap chinese knockoff, it feels like that. \n\nThe only thing that feels like a knockoff is this retarded post, clearly you haven’t been to China recently at all", "score": 8, "replies": []}, {"body": "Lots of dumb arguments.\n\nNIO will keep growing and NIO will sell. You can be part of this journey or enjoy watching while sitting on your overpriced Tesla stock.", "score": 14, "replies": []}, {"body": "I would take a step back. Thinking anything is impossible for China is way too close minded. Those guys have the political will to do anything.", "score": 5, "replies": []}, {"body": "Didn't read all that, but heres some useful info:\n\nChina sold about 25m cars in 2020, about 1m (4%) were EVs.  China has a mandate where 20% of cars sold have to be EVs by 2025.  China is projected to sell 30m cars by 2025, about 6m (20%) will be EVs.\n\nThat is 6x more EVs than sold this year...within 5 years.\n\nUS sold about 400k EVs in 2020.  There is no mandate though maybe Biden admin may push something.\n\nIn any event, China is where it is at and will be for EV sales over the next decade.  Their population is more than 2x that of US and Western Europe combined.", "score": 7, "replies": []}, {"body": "NIO to $70 Monday", "score": 18, "replies": [{"body": "Ye. I’m here for it.\nHappy Nio day retard", "score": 5, "replies": [{"body": "And to you, autist", "score": 3, "replies": []}, {"body": "🚀🚀🚀", "score": 2, "replies": []}]}, {"body": "No sell off? Or will that be mid week?", "score": -2, "replies": [{"body": "No sell off. Straight rocket mission up to the moon🚀🚀🚀🚀", "score": 3, "replies": []}]}]}, {"body": "I'm quite sure NIO will be China's next golden goose. Thinking in the future might be more valuable than tiktok and the telecoms.", "score": 5, "replies": []}, {"body": "Lol that doesn’t make you an expert about foreign countries retard", "score": 4, "replies": []}, {"body": "I think what you are not noting is that NIO never claimed to serve the middle class market. They were aiming to be a luxury brand from the beginning. Tesla is trying to capture the market by cost cutting and selling their basic model Y at lower costs than NIO. NIO on the other hand is targeting consumers who buy BMW, Audi and other similar luxury brands. Their new battery as a service (BaaS) costs are a lot lower than Tesla for someone who owns the car for less than 10 years (most people in that wealth category). This might have pushed their immediate profitability due to technology costs associated with it but they created a separate entity to handle \"battery asset management\" to keep the books separate while working with CATL which is also working with Tesla btw. The battery swapping ability qualifies it for a big ev incentive which otherwise it won't get (hence the low cost of vehicles which opt for BaaS).\n\nSecond, market sentiment will favor Tesla for now and maybe even in the long run because everyone wants the famous Western brand name which is a very ingrained mindset in Asian countries (I grew up in South Asian country and still catch myself doing that after moving out to US 6 years ago).  That will go away I feel since Tesla started production in China and having a Tesla is no longer a status symbol saying - \"I can pay extra for imported cars\". NIO is already ready to capture that sentiment shift offering better range, specs, and comfort. Also they release car much more often than Tesla which is important for Asian markets. All this combined with long range support in terms of battery size, swapping technology (which Tesla tried and gave up on) and charging stations should give room for both NIO and Tesla to grow exponentially in China even in a bear case. \n\ntldr - both have room to grow in China, NIO and Tesla to the 🌕🌖🌗🌘🌑🌒🌓🌔🌕. Obligatory 🚀🚀🚀🚀", "score": 8, "replies": []}, {"body": "Market cap worth 4 to 5 trillion? What the fuck are you smoking? Thats more than Google, Apple, and Amazon COMBINED. Some of the dumbest shit I’ve ever heard.", "score": 3, "replies": []}, {"body": "The f you talking about...of course it's not something the average person would want. The average person can't even think to afford it.\n\nHell...the average American can't afford an EV, dipshit.\n\nChina is the biggest EV market (currently) and has the highest number of EV companies (also fact). Maybe put the dots together.", "score": 3, "replies": []}, {"body": "Nah NIO is better", "score": 10, "replies": [{"body": "Convincing argument\n\n$NIO 60 2/5", "score": 12, "replies": []}, {"body": "Solid reasoning.", "score": 3, "replies": []}, {"body": "Agreed", "score": 3, "replies": []}]}, {"body": "Battery swap vs future Battery Supply constraint is gonna deep Dick the fuckkkkkkk outs NIO 🍆💦🍆💦🍆💦🏳️‍🌈", "score": 2, "replies": []}, {"body": "Should be in the discussion thread.", "score": 2, "replies": [{"body": "There are no rules anymore", "score": 1, "replies": []}]}, {"body": "Wait...Are you saying a foreign car company will not sell cars in the US?  Pretty sure Toyota and Honda are doing ok here....", "score": 2, "replies": []}, {"body": "Lost me at “studied abroad in Korea.” Korea does not exist. It’s either North or South. So which one is it retard?", "score": 2, "replies": []}, {"body": "You do know that smaller cities in China are still bigger than most north American cities. Also, china needs to move towards renewables as their air quality sucks.", "score": 2, "replies": []}, {"body": "You are talking bs, obviously you have no idea or you visited China before 2000. In China, already 25% of all cars are electric and China will be the first country to go full 100% EV, as someone said: If the CCP wants it, they do it. There is no discussion like in western countries that may delay that decision over several years.\n\nAnyway my point is: NIO 🚀🚀🚀🚀🚀🚀", "score": 2, "replies": []}, {"body": "60% of cars will be EV by 2035 in China. It will happen. The CCP's five year plans get done, no matter what.\n\nThe CCP is going to 👑 national champions like NIO.\n\nThey will not let an American company be the EV market leader in China for very long.", "score": 2, "replies": []}, {"body": "Nio doesn’t have Elon.", "score": 2, "replies": []}, {"body": "Invest in growth, lesson #1", "score": 1, "replies": []}, {"body": "Why not include facts in your post?", "score": 1, "replies": [{"body": "Bc, feelings....", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "PE doesn’t matter for growth companies", "score": 2, "replies": []}, {"body": "You sound all tarded and shit, go to a doctor, make sure you’re not tarded", "score": 1, "replies": []}]}, {"body": "What I really like about this:   **Why NIO can't compete with Tesla. (both will continue mooning but Tesla is more legit)**   Cool story Bro.  Tell us all something we don't know Dbag.", "score": 1, "replies": []}, {"body": "Will the new EU China investment deal give Nio an opportunity in europe?", "score": 1, "replies": []}, {"body": "Doesn’t align with Xi’s plan. Ban from China.", "score": 1, "replies": []}, {"body": "(More legit) lol", "score": 1, "replies": []}, {"body": "Bro you‘re retarded and the funniest part  is that you meant it serious \n\nTesla🚀🚀🚀🚀🚀Nio🚀🚀🚀🚀🚀🚀🚀\nEverybody eats", "score": 1, "replies": []}, {"body": "Lol man what a retard. Who wants premium quality goes for NIO instead as well as lifestyle user benefits. Tell that to the massive growing user base. Go study ;)", "score": 1, "replies": []}, {"body": "What? CCP is not demanding the WHOLE country to go electric. They are targeting the largest cities because they aren’t retarded and know rural growth will take time.\n\nAnd have you tested a NIO? You can’t say it feels like a cheap knockoff if you haven’t.", "score": 1, "replies": []}]}
