{"title": "NVDA stop loss or hope it's a dip", "selftext": "NVDA dropped due to a change of rating. Is it market nervosity or will it collapse even more?", "id": "5vr88l", "created_utc": 1487866116.0, "score": 64, "upvote_ratio": 0.87, "num_comments": 90, "comments": [{"body": "I bought Nvidia shares yesterday AMA", "score": 61, "replies": [{"body": "Ha I bought NVDA shares at 120 AMA", "score": 30, "replies": [{"body": "I'm 116. Doubled down today at 100.50. ", "score": 9, "replies": [{"body": "Very ballsy. A move like this is gonna create some big sell off. I did a quick technical analysis showing the 3 main trends on the daily. The higher trend has been broken and is in a very \"open\" space to which I believe it will most likely fall to the support of the lower trend line with the yellow circle, which is my target. Like i said, that big of move will trigger sell off and it can likely drop even further and may even land to the lowest trend line which would not be a surprise. However, that being said there is no clear trend reversal. Very strong uptrend and this is just a mere pullback to which it should continue along its trend making for a good medium term hold.\n\nSee chart here https://invst.ly/3bxkp", "score": 7, "replies": [{"body": "Wait, so that wasn't the sell off today? ", "score": 1, "replies": [{"body": "Yes, A sell off happened today along side the natural gap down in price. But people like OP and anyone else who decided to hold through may not want to go further in the coming days and finally decide to get rid of their shares if it happens to continue to drop.", "score": 4, "replies": [{"body": "I expect the stock to continue to drop, as sad as that makes me. Do you think it will break below $100? ", "score": 1, "replies": [{"body": "Yes. My best advice is to get some more knowledge on this whole thing. Sure picking big companies can work out but if you dont know what your doing its just gambling. Heres a link to a great place to learn about charts http://stockcharts.com/school/doku.php?id=chart_school\n\nAnother thing I highly recommend is instead of putting in \"real\" money, get out a pen and paper and write down the price at which you wouldve bought with real money, then with use of the charts decide where a plausible sell point is, and where a plausible stop loss is. This way you get a feel for the market and get in well needed experience.\n\nHope this helps!", "score": 5, "replies": [{"body": "Thanks for this.\n\n I haven't been investing for too long, but I was doing exceptionally well, which I think made me a lot too overconfident in my investments, instead of equating my success with the overall success of the market. Kind of like a gambler on a hot streak, just wanted to keep winning. Now I know to spend a lot more time researching.", "score": 2, "replies": []}]}, {"body": "Its at $98.79 in after hours", "score": 4, "replies": []}, {"body": "it already has in AH\n", "score": 1, "replies": []}]}]}]}, {"body": "dude please tell me you are trolling. I legit understood nothing", "score": 1, "replies": [{"body": "Im sorry if my technical words confused you. What dont you understand? ", "score": 1, "replies": [{"body": "so you were not? my apologies. I guess I understood nothing of your comment. If you have the time and the energy to explain it in baby words that would be appreciated, if not; I will still breathe a sight of relief and fret not because i am currently new to this world and i'm learning alot and i'm pretty sure your above comment will make sense soon. Have a good night / day. p.s. I must admit i do not consider myself a trader nor i want to be consider one in the future. I'm just here to relief my hunger for learning.", "score": 1, "replies": []}]}]}]}, {"body": "Danger", "score": 2, "replies": []}, {"body": "I'm planning on doubling down too, but I'm going to wait to see if it drops more. ", "score": 1, "replies": []}]}, {"body": "I bought at ~30 and sold at 60. AMA.", "score": 4, "replies": [{"body": "Did you cry?", "score": 2, "replies": [{"body": "Yes, but for an unrelated matter.", "score": 5, "replies": [{"body": "Good answer.", "score": 1, "replies": []}]}]}, {"body": "Bought in at ~30 and sold today to cover initial investment. Letting the rest ride or die. ", "score": 1, "replies": []}]}]}, {"body": "Do you have someone to delete your browser history for when this doesn't turn around?", "score": 4, "replies": []}, {"body": "Do you feel a slight sense of regret my dear?", "score": 3, "replies": [{"body": "I invested in AMD and Nvidia yesterday. I like AMD, always used their graphics cards over Nvidia. I had this inkling that it would be traitorous to buy Nvidia stocks, so I guess I'm getting punished for it.", "score": 3, "replies": [{"body": "You bought and like AMD cards pre 2017 over Nvidia?! No fucking way. You're lying, no one does that. \n\nOr you're just on a budget, which is totally fine.", "score": 7, "replies": [{"body": "My first build I was running crossfire 5770s, currently i'm on a 480x. Those 5770s carried me a long long way, was sad letting them go.", "score": 3, "replies": []}, {"body": "If you buy an AMD card you kind of have to kid yourself in to thinking that you're getting NVIDIA quality so that the pain isn't so bad.", "score": 2, "replies": [{"body": "I've just always felt that AMD gets me where I want to be graphically for a more affordable price. You get what you pay for in my experience with AMD. \n\nMaybe if Nvidia stock had skyrocketed today instead of plummeting I could actually afford a 1080.", "score": 4, "replies": []}]}]}]}]}, {"body": "At least you didn't buy calls :'(", "score": 2, "replies": []}]}, {"body": "It will bounce back. Most of analysts upgrade/downgrade are meant to make money for the position they are already in and not actually analysis of value. Wells Fargo said the stock was overvalued last year when it was at $50 and said it should be in the $30-$35 range. We see how that prediction went. ", "score": 26, "replies": [{"body": "12 days ago this same analyst company gave NVDA a buy rating and upgraded their PT. What a joke.", "score": 18, "replies": [{"body": "So do these analysts downgrade it, so it drives the money down, so they can buy more of it?", "score": 6, "replies": [{"body": "Freedom of speech, baby.", "score": 5, "replies": []}, {"body": "Or they open a short position first. Pretty sure there were puts up 15000% today. Being an \"analyst\" is very profitable", "score": 3, "replies": [{"body": "How is that not market manipulation", "score": 3, "replies": []}]}]}]}, {"body": "Agreed. NVDA's technicals (specifically, price relative to 50MA and RSI) just so happened to go super-bearmode at this news, and I'm sure the analyst and firm were aware of this, hence why they released this news now of all times. \n\nNow, does anyone wanna tell me with a straight face that these guys (or their pillow talk buddies) didn't have shorts ready to go before the news release?", "score": 8, "replies": [{"body": "Not saying this isn't a possibility but firms have very strict divides between groups that publish analysis and the trading arms. If there is collusion that is very illegal. ", "score": 5, "replies": [{"body": "You're blind if you don't think there's some kind of collusion. It's so difficult to prove word of mouth.", "score": 5, "replies": []}]}, {"body": "Also released it on ex-dividend day, for that extra .55% of panic drop", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I can't predict what it will do in the future but the cause in the drop has nothing to do with a fundamental change in the company. It should be back above the 50 day moving average of 107 very quickly unless there's some unexpected economic news.  A 10% drop over downgrades that are as accurate as a Magic 8 ball in predicting the future is way oversold in my opinion.", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Even if it drops tremendously (down to like $85), I'd keep holding. These analysts might have a point, and maybe the stock is actually overvalued, but as others have said nothing about Nvidia itself is in question. I see it climbing back up by the end of 2017.", "score": 3, "replies": []}]}]}]}]}, {"body": "-10 dollars today what the fuck happened ", "score": 13, "replies": [{"body": "Downgrades from analysts", "score": 17, "replies": [{"body": "Sooo.... am I crazy for wanting to buy more right now for that long term investment?", "score": 8, "replies": [{"body": "Not crazy at all, thats what you do...", "score": 16, "replies": []}, {"body": "Wait till the dip meets resistance, buy on the upside of the dip", "score": 7, "replies": []}, {"body": "I wouldn't say crazy.  I also wouldn't be sure it's done going down.  Long term I think it's still a safe bet.", "score": 5, "replies": []}]}, {"body": "This\n", "score": 0, "replies": []}]}, {"body": "I think its because of AMD. Maybe, I don't know.", "score": 6, "replies": [{"body": "I had the same thought, especially with the surfacing of Ryzen. But there are so many other factors. On the flip side, I do think AMD is a good investment. ", "score": 2, "replies": []}, {"body": "That makes no sense.  NVDA doesn't compete with Ryzen.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I can't see how.  /u/ryho12 is suggesting that AMD's Ryzen release is impacting NVDA's bottom line, but it isn't, because they don't compete in the CPU market.", "score": 1, "replies": [{"body": "Idk man, it's just an assumption. I was just thinking the majority of people assume they compete with nvdia. ", "score": -1, "replies": [{"body": "Nobody assumes that AMD and Nvidia compete in CPUs. Ryzen has nothing to do with Nvidia. ", "score": 0, "replies": []}]}]}]}, {"body": "Another successful launch of a new product from a company that does compete in your sector? Sure it was a cpu launch but the market is probably pricing in amd's recovery. Ryzen proved the successful gpu launch wasn't a fluke.", "score": 1, "replies": [{"body": "You're not making sense.  Yes, AMD and NVDA compete in the GPU market, but AMD's Ryzen is a CPU and will not compete with NVDA's GPUs, their Tegra line, or anything else NVDA makes.\n\nIf your assertion is that the market is overreacting to something it doesn't understand well, then I agree with that.", "score": 1, "replies": [{"body": "Any growth for amd, regardless of where it comes from, can be seen as a threat. ", "score": 1, "replies": []}]}]}]}]}, {"body": "overbought. ", "score": 1, "replies": []}]}, {"body": "Well its kinda obvious it has some downside. It can't go up forever. I stated in my previous post, about two weeks ago, that it is going to at least a 100 before making new highs...\n\nThe sell-off after the earnings beat told everything. The market was overbought and it ought to have gone down. I myself sold at 113.75 and I'm thinking of closing now and maybe buy some with a tight stop below 100 with another limit sell order set below 100 in case of a move even lower. The only problem would be a false break due to stop-hunting. Maybe waiting patiently would be best. Just thinking out loud.\n\nWe'll see what happens next week. The 100 level should be important. As I see it there are two options.\nOption a) the stock consolidates at around 100-105 for a few days, building stops below 100 and then making a false break to trigger those stops just to reverse and continue its rise to previous highs. \nOption b) the stock consolidates at around 100-105 trying to break on the downside and actually succeeds. The price is then falling towards 70-75 which some consider as a stock's fair value.", "score": 7, "replies": []}, {"body": "They've beat expectations for earnings quarter after quarter, they've got solid products in the pipeline and an emerging AI market. I think this is the price correction that has been overdue for some time. It'll probably take another month, but eventually it should resume its upward climb.", "score": 6, "replies": []}, {"body": "I'm betting a lot of this money is moving from NVDA to AMD after yesterdays price announcement. (although, these prices were for CPU's not the new GPU's that are coming out in a few months, I think in general people are more bullish on AMD than NVDA right now). ", "score": 3, "replies": [{"body": "AMD has cherry picked stats and only shown multi-core performance, from what they've released and with some quick math it looks like single-core performance is 2.5x in Intels favor. I don't think Intel is shaking in their boots just yet, and it makes the price point for AMD seem about right, maybe even on the high side. I do like AMD and want them to do well, but Ryzen is not going to \"beat\" intel as bad as you might think.. at least technically, who knows what the market will do.", "score": 2, "replies": [{"body": "Oh I fully agree I don't trust the benchmarks released, or at least take them with a few grains of salt. Until we see actual independent benchmarks (which I think are allowed to be released next week?) We'll know the true answer. However, with what i have seen, AMD is at worse case pretty close to intel, and best case, ahead of them in some specific areas. \n\nThe BIG question will be to see how Intel responds to this with their next release. you can see they already responded a little bit in Kaby lake by allowing the Pentium Dual Core's to use hyper threading (basically making the i3 a waste of money). So their $89 CPU is now as good as their $130 CPU from Skylake. ", "score": 1, "replies": []}, {"body": "Did you not watch any videos on the launch? Cherry picking stats? Lul, you amd bears refuse to give in. ", "score": 1, "replies": []}, {"body": "Cherry picked? Lol pretty obvious you dont closely follow amd otherwise you would know what they showed was impressive for them. The only thing up for debate at this point is the OC capability but even then there are videos showong positive remarks. Spreading false information doesnt help anyone and if you didnt intend to please do more dd before you post", "score": 1, "replies": [{"body": "[AMD are up to their usual tricks](https://i.imgur.com/rUxVWPH.jpg), fanboys gonna fanboy.", "score": 0, "replies": [{"body": "That has the base and boost clocks at the same....gunna call fake.", "score": 2, "replies": []}]}, {"body": "If its not cherry pick then show me the single core benchmarks?", "score": 0, "replies": [{"body": "Cinebench benchmarks are all anyone needs to see. There a good enough indicator to show single thread performance.", "score": 2, "replies": []}]}]}]}]}, {"body": "so buy AMD ", "score": 3, "replies": []}, {"body": "I have seen rumors of a 1080TI announcement on Feb 28 with a release mid march. ", "score": 3, "replies": [{"body": "Yes the website is counting down right now for the announcement", "score": 1, "replies": []}]}, {"body": "After how amazing Ryzen's benchmarks have shown to be, many investors seem to be getting worried the upcoming Vega release will potentially take significant market share from Nvidia. The downgrade from the analyst was the catalyst for the sell-off though.", "score": 2, "replies": [{"body": "I own both stocks.  I don't think it should be an either/or decision necessarily.\n\nFor one, I think both are viable acquisition targets for a couple of companies, primarily IBM and Intel.  I could see Intel coming in and buying either for a nice return.  \n\nI also don't think that a strong Vega release will dramatically hurt Nvidia's growth prospects as a huge amount of their potential comes from the SoC business rather than GPU's (though GPU's still make up a huge chunk of revenue).  \n\nI considered buying today but am holding off, though it seems like there's support at $100 and it doesn't look like it's going to break through.", "score": 2, "replies": [{"body": "If intel were to buy it, there would be anti-trust worries.", "score": 1, "replies": [{"body": "Maybe.  But I doubt it.  The government would have to argue that a monopoly over x86 chip market is sufficiently anti-competitive to justify blocking a buyout.  That would be a pretty specific market for the government to get involved in. \n\nGiven what they've allowed Intel to do in the past with their contracts with OEMs I'd be kind of surprised if they dropped the hammer now.", "score": 1, "replies": []}]}]}, {"body": "The fact nvidia focuses on other stuff such as artificial intelligence and self driving cars hurts them", "score": -2, "replies": [{"body": "I disagree, in fact it will help them", "score": 3, "replies": []}]}]}, {"body": "In it for the long run now", "score": 2, "replies": []}, {"body": "Only because I watch CNBC with Cramer every morning I'll tell you they had NVDA in the discussion.  Cramer owns it and is long in his charitable trust and doesn't get the drop either.  He's not worried at all so put as much (stock) in his opinion as you will.  From others on this thread I think they agree.", "score": 2, "replies": []}, {"body": "It's holding that $100 resistance pretty good.\n\nI wonder how many other people (like myself) have limit buys at $100. I know I just picked up some, I'm sure other are as well.", "score": 2, "replies": [{"body": "opening at 96 rip ", "score": 1, "replies": [{"body": "Everything is opening up low, even  Vangaurd etfs. Every single stock on my watch list is opening at a loss, except CSX, that's the only exception ", "score": 1, "replies": []}]}]}, {"body": "Mlg 1337 Value investor here, according to cash flow and dat astronomical P/E nvda fair value = 43 usd. The upcoming deflation will help it reach that. ", "score": 2, "replies": []}, {"body": "Bought in at 113.88. I was so confident they were going back up.... Was planning on holding until it hits 120. Now debating if I should cut my losses", "score": 2, "replies": [{"body": "hold bro hold - it will definitely go back up", "score": 3, "replies": []}]}, {"body": "Put simply, the drop was because of AMD's Ryzen and more particularly, Instinet devaluing NVDA due to \"concerns over a slowdown in gaming\". Even if this were true, NVDA is heavily invested in the VR market which will not only net a large amount of gamers, but has applications outside of the gaming sector from design to business to medicine. The target audience is huge. NVDA has also secured a stake in [self driving cars](http://www.nvidia.com/object/tesla-and-nvidia.html), [data centers](http://www.forbes.com/sites/aarontilley/2016/11/10/nvidia-reports-huge-data-center-business-boom-stock-is-jumping/#61e42c8079db), and [Deep Learning AI](https://www.nvidia.com/en-us/deep-learning-ai/). Key to NVID's success is its recent diversification in growing industries, leaving it with plenty of room to run.\n\n\n&nbsp;\n\nAs far as the AMD GPU battle goes, NVID and Intel have a [long history of screwing over AMD](http://www.forbes.com/sites/quora/2016/05/25/why-did-nvidia-win-the-gpu-market/#1608a7b33559) and AMD has a 20 year history of cyclical, declining ROI and the current upsurge seems to fall in line with historical spikes. That doesn't mean this won't be their chance to break out (I've heard that Intel is even working on a chip with them) and steal a larger share of the graphics card market, but it doesn't mean NVID doesn't have a strong business model to fall back on for years to come.\n\n&nbsp;\n\nThat said, we can certainly still see NVID drop to $90, but this is a stock to hold onto for a long time so I wouldn't sweat it. ", "score": 1, "replies": []}, {"body": "Bought in at 71. Waiting for a slight dip then will double down. ", "score": 1, "replies": []}, {"body": "this is Nvidia's first time at a real peak - so its very volatile and there's no true steady trend yet - until thats determined, I'll look to see if this is worth my investment.\n\nIf your already in, Idk. AMD had peaks before in the past, they became very low twice. So not sure if you want to use this as long term. ", "score": 1, "replies": []}]}
