{"title": "Elon Agrees that NVIDIA will dominate for a long time but not forever. Competition is coming...", "selftext": "https://twitter.com/elonmusk/status/1666479033817653249?s=20\n\nIt is well known that Amazon, AMD, Facebook, Google and even Tesla are developing TPUs specifically for training larger AI models. However Nvidia does have a software moat as most of the current development is done via CUDA. What do the others need to do to take away NVIDIAs dominance ?", "id": "143w0ig", "created_utc": 1686189419.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 28, "comments": [{"body": "NVDA isnt sitting on their hands either.  They're innovating.  Will others catch up to their current h100?  Sure eventually.\n\nBut where will NVDA be then?", "score": 9, "replies": [{"body": "Z9000", "score": 4, "replies": []}, {"body": "How'd things work out for Intel?", "score": 3, "replies": [{"body": "That’s why you look at management changes. If it’s run by business people, RUN, they don’t care about innovation.", "score": 2, "replies": [{"body": "Jensen has transitioned to pump the stock part of his career", "score": 1, "replies": [{"body": "He is still the founder of the company, intel’s original founders have been long gone.", "score": 4, "replies": []}]}]}]}, {"body": "Originally Tesla wanted to use Nvidia chip for their self driving but it wasn't powerful enough... Tesla went and built a GPU that's way more powerful... Now if they release it to general market ...", "score": 1, "replies": [{"body": "Nvidia works with plenty of other car makers eg Mercedes \n\nhttps://insideevs.com/news/630075/mercedes-first-to-offer-level-3-self-driving-in-the-us/", "score": 2, "replies": []}, {"body": "This is different. For training AI models Tesla still uses NVIDIA. They are trying to build their own via Dojo but I don't think that is running yet.", "score": 2, "replies": []}]}]}, {"body": "Literally can say that about EVERY SINGLE market leader in EVERY CATEGORY!!!  Duh!", "score": 6, "replies": []}, {"body": "This question could have been framed much better if not around an Elon tweet lol\n\nI’m bearish on NVDA just like I’m bearish on TSLA. They’re both massively overvalued, but they are both worlds ahead of their competitors in terms of their operations. If they lose their dominance it will be from their own missteps more likely than the threat new entrants, IMO.", "score": 6, "replies": [{"body": "Good luck with nvda, lol. Maybe wait until there is ACTUAL competition before shorting??", "score": 3, "replies": [{"body": "Well, Intel's 300$ GPUs like the ARC 770 have shown to be massively fast in ML applications just recently compared to much pricier Nvidia product like the RTX 3070. That's not a small feat.\n\nTech world moves fast, you can get outdated in few years and it may take you a long time to recover (see Intel).\n\nAMD GPUs power like what, 3 out of the 4 fastest supercomputers out there? Instincts are good products.", "score": 2, "replies": [{"body": "Nvidia is designing their low end GPUs specifically to be non useful for ML so people have to buy their enterprise level GPUS\n\nIntel has no enterprise level GPUs 😂", "score": 1, "replies": [{"body": "Enterprise-level doesn't mean anything. What matters is the performance you get per dollar and per watt.\n\nAI is a vague term, there's very different applications and software out there, not everything relies on cuda.\n\nIf you ever bothered to train anything locally from ml inference models to llama/alpaca or gpt you would know, but you're talking about stuff you've never even bothered trying.", "score": 0, "replies": []}]}]}, {"body": "I’m not going to short, but I’m not going to go long either.", "score": 1, "replies": []}, {"body": "NVDA will drop below 270 before the end of 2023", "score": 1, "replies": []}]}]}, {"body": "Nvidia could win the AI battle and it still doesn’t justify their current valuation", "score": 2, "replies": []}, {"body": "Now go tell that to the $400+ bagholders.", "score": 0, "replies": []}, {"body": "Time. \n\nExample intel v amd..except the companies you mentioned are for the most part loaded. So maybe it won’t take as long..Nvidia’s to lose", "score": 1, "replies": []}, {"body": "The problem with Nvidia is the same problem you get in every single market: high volumes and high margins attract competition and investment. But worse, because you're in tech and you're only as good as your latest products. Companies very often get complacent when they are market leaders (see Oracle, IBM, Intel recently).\n\nAMD was never lured to fight much Nvidia on the peanuts of the gaming market, they never made any money on pc GPU, but this may change with AI. Intel too has recently started competing.\n\nPoint is: what really matters to customers of those GPUs eventually is how much computing power they get for their money. There's different models and different software out there.\n\nAnybody expecting Nvidia to dominate without a competition for a decade clearly does not understand the complexity of long term dominance in tech which is very hard to obtain and maintain.", "score": 1, "replies": [{"body": "Nvidia understood early to lock in customers on the software side", "score": 3, "replies": []}]}, {"body": "Tesla also won’t dominate forever, probably not even till 2025. Elon need to focus on his business.", "score": 0, "replies": [{"body": "He is. But the question is which one🧐", "score": 1, "replies": []}]}, {"body": "Tesla can't even make a door and a fender line up properly.", "score": -3, "replies": []}, {"body": "Probably the first and only thing hes said that I agree with", "score": 0, "replies": []}]}
{"title": "Is this one big problem with the belief of a recession?", "selftext": "Okay so there are actually many problems with the belief of a recession including but not limited to: There are still too many open jobs, inflation is not getting under control with fed raising interest rates, etc. However the one big problem anyone should see that will make a recession hard is the fact that the wealthy are not investing like they normally do. The wealthy, who typically own 55% to 60% of the entire stock market are not investing as aggressively. They are hoarding cash and wouldn't this mean they will prop up stock prices if they fall too much? Leading to what we saw in March/April 2020 where we just have a flash crash and a booming recovery?  I do not see us having a recession like 2008/2009 possibly ever again. Good chance our \"recessions\" will be akin to 2020 if even that - and on top of this even if we do have flash crash recession like 2020 we will almost for sure just keep rebounding and have a bull market lasting at least a year. \n\nEdit: Removed a sentence that was inaccurate. ", "id": "143xtuf", "created_utc": 1686194474.0, "score": 5, "upvote_ratio": 0.63, "num_comments": 29, "comments": [{"body": "Germany is currently in recession, and their stock market is at all-time highs. Stop worrying whether or not we're going into a recession.", "score": 32, "replies": [{"body": "Exactly. After all, the stock market is not the economy.", "score": 12, "replies": []}, {"body": ">Germany is currently in recession\n\nbased on the 2 quarters of decreasing GDP. \n\nhere in the US our White House redefined that. \n\nhow can our news agencies report on a recession in another country due to 2 quarters of decreasing GDP, while these same news agencies report that the US was not in a recession in 2022 even though we had 2 quarters of decreasing GDP? Also, in 2019 those same news agencies were reporting on a recession due to 2 quarters of decreasing GDP in the US.\n\ngaslighting.", "score": 2, "replies": [{"body": "2 quarters has been an indicator that points towards a possible recession. It has never been the definition of one.", "score": 3, "replies": [{"body": "It's amazing how many people don't get this. The NBER declares a recession, usually after it passes or near the end. They only declared one in late 2008 when it started in 2007.", "score": 2, "replies": []}]}]}, {"body": "Germany is barely in a technical recession. Does the average German even notice? Also Germany will be the first EU country to roll out of recession", "score": 1, "replies": []}]}, {"body": "I am not on the huge recession train. Also don't think it could start for at least 6 months.  Even if there is a garden variety recession, I'm in cyclicals that are so beaten down, I think they account for a recession already.\n\nTo me the risk currently is no recession, persistent inflation, and higher rates. Meaning the huge move in tech stocks has to be unwound.", "score": 5, "replies": [{"body": "The reason why a huge recession is super unlikely is that the US labor participation rate is still abysmal.\n\nhttps://fred.stlouisfed.org/graph/fredgraph.png?g=15ixM\n\nUnemployment is a shitty ass measure of \"full employment\" since GFC and Covid fucked a lot of people up and discouraged them from ever working.  EU by comparison has 74.7% participation.\n\nThere's going to be a lot of people slowly re-entering the work force.  We've had nothing but surprise upside, blockbuster jobs numbers month after month and it's unlikely to stop any time soon.", "score": 3, "replies": []}, {"body": "What cyclical are you looking at? I was thinking about buying some shipping and land cargo but a recent article put me on hold", "score": 1, "replies": []}]}, {"body": "People are holding more cash and equivalents than ever. I never had TBills or have this much cash in savings in my life. Slowly investing it into equities but I know that I’m not alone.", "score": 4, "replies": [{"body": "Same here. I’m just keeping my powder dry for whatever comes our way. Even if nothing happens, at least I still have the cash.", "score": 3, "replies": []}]}, {"body": "I never understood the argument about how much cash people are holding as a reason to support stock prices.\n\nIf someone buys a stock, paying cash, then someone else receives cash, therefore net cash and stock = 0.\n\nThe only thing I can understand that would pump money into stocks is debt. If someone borrows money to buy stocks, new money supply is created, then they buy shares with it (share supply is unchanged) that means there's more money around to bid up stock prices.\n\nSo instead of looking at how much cash people are holding, maybe look change in money supply to determine the avg valuation of the market", "score": 6, "replies": [{"body": "The reason why \"cash on the side\" matters is because where the cash sits matters.  Banks or insurers for example have to hold a certain amount of cash and liquidity buffers.  If a fund with borrowed money blows up and liquidates their equities to try and pay back lenders, free cash on the side goes to them and eventually may settle somewhere that may not be able to buy more equities.\n\nAnother scenario is loans or bonds could default and all of a sudden paper assets disappear and money in the system is essentially destroyed and vanishes.  So money ready to buy to support equity prices is relevant.  If people lose their jobs, a lot of savings would also prevent them from being forced to sell holdings at a loss.\n\nThe fact that retail MMF balances have ballooned to $1.4T and $5.7T in total money market funds is nontrivial.", "score": 3, "replies": []}]}, {"body": "The stats certainly don't point strongly to a recession. \n\nDue to higher rates, being \"in cash\" can mean holding money market funds that yield 4+%. That undercuts equities, because why take more risk than you need to? But if the stock market does become clearly discounted, that would draw some of the cash in.\n\nI think the persistent belief in a coming recession is due almost entirely to high inflation and the Fed raising rates in response. Traditional wisdom and economic history indicate that recessions are the cure for high inflation. The good news is that, unlike the 1980s, we are so far on course for a pretty soft landing. However, getting inflation from 4% to 2% could still cause some pain.", "score": 5, "replies": []}, {"body": "We are already in a 'recession' but it will slowly get worse. It's gonna be a slow grind, not flash crash as seen in 2020. Most likely what will happen is that there will be momentary dips (5-7 trading days) where there is a correction but the bull rally has shown no really sign of slowing down. Big focus is ride the wave up with tight stop losses and get bigger entry when there is a sale", "score": 4, "replies": [{"body": "People forget recessions take a while to play out. The market has been below ATH for ~18 months now. Valuations have corrected about 25%. FMV of S&P has gone from 2,400 to about 2,800 in that time. If it took another 6 months to go down again FMV will be 3,000. \n\nDownside risk is collapsing: supply chains are correcting; on shoring is occurring; the budget and FED have been correcting their balance sheets; employment is high. \n\nFor a 10-year+ time span it’s not a terrible time but I hope for a 1-2 week 10% drop and fail to retest 3,600 before the real bull market can begin again.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I really don’t think it’s fully understood right now by some that at this point technically at least, the S&P made a low in June of last year and October was the sweepage of it instead of a meaningful lower low.\n\nThat’s it, or we have a secular bear market (and I suppose one is still possible as long as 4800 is not exceeded because really you can argue that a secular bear can be a rangebound market too). I’m in the camp that believes that if 3492 is breached, we go a lot lower than folks think (probably really at this point, 3860ish is the big, big time line in the sand).", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "He's saying that he needs to see another retest of the lows basically.\n\nI'm saying that it wouldn't be a good omen to go back to where we were in October and if folks get their wish, they may get more than what they bargained for.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "When his neighbor lost a job?", "score": 1, "replies": []}]}]}, {"body": "Cash hasn't been a viable position in a long time.\n\nRates have to go higher.  RBOC paused and then just had a surprise 25 point raise.\n\nThe Fed may skip June but the rate hikes aren't done yet.  \n\nIt is consistently lost that full employment is 5% unemployment.  The Fed likely has to tighten to get UE to 5.5% and that would be the \"soft landing.\"\n\nThe Fed has 2 mandates, price stability is mandate 1.  Full employment is mandate 2.\n\nCongress doesn't help on either side of the aisle.  One side cuts taxes, the other doesn't stop spending.\n\nI expect that longer bond rates have to go up because the bond market is fucking stupid right now.  \n\nI just went through this discussion with my FA.  There is a lack of understanding in general about the see-saw here.  And even if the Fed raises the acceptable inflation target to 3-3.5%, it won't be until they get to 2.5 first.  And that means rates have to keep going up.", "score": 3, "replies": [{"body": "This is a good response btw. Thanks.", "score": 2, "replies": []}, {"body": "Totally agree. Even if they pause, they’re still high! I don’t think people understand this concept.", "score": 1, "replies": []}]}, {"body": "Rising rates coupled with record consumer debt, commercial real estate teetering, producer manufacturing numbers going off a cliff, less demand for commodities. All the evidence is there that a peak has been hit and it’s downwards from here. The money has always been there, just in different places. Money is currently placed the way it is because the market believes the Fed will have to cut rates aggressively this year because of the amount of damage being done, and we haven’t yet seen the impact of the highest rates yet. Even if there’s an eventual pivot, as rate hikes work through, there’s going to be a steep decline in demand. The issue with cutting rates too fast is that you end up with inflation shooting off again.", "score": 1, "replies": []}, {"body": "The wealthy aka big or smart money controls the market. If they want the market to go up then it will go up. If they want the market to crash the market will crash. State of the economy does not matter to them. They are here to drain money out of the market. They pump up to lure stock buyers. Once enough people buys then they will dump. As we have been witnessing this recently.  News says inflation and rate hikes market go up. Reason was the market is forward looking and is expecting many rate cuts later this year. Now it is clear there will not be any rate cuts as the jobs report and Inflation are high. So no rate cuts is confirmed, market rallies still because we are pausing. Then instead of cuts we are expecting more hikes in July yet the market still rallies more. What happened to all that rate cuts that got priced in? IMO they are just pumping the market to lure buyers. This is like fishing to them casting out the bait and waiting for fish to bite. Most ridiculous pump is nvda.  It is pumped up to 1T marketcap. Google is 1.5T and they bring in 60B+ revenue each quarter minimum.  Now nvda best revenue last year was 8B this year best was 7B now suddenly they projected 11B next quarter and they are near Google valuation?? Clear pumping happening here. Big money manipulating for sure.", "score": 1, "replies": []}, {"body": "Trickle down is not a valid economic theory. Never has been... never will be.", "score": 1, "replies": []}, {"body": "Thing is, not all recessions are felt equally or felt at all.  You can technically be in a recession but if enough people think they're doing alright, stocks will at best move sideways instead of a characteristic gradual decline.", "score": 1, "replies": []}, {"body": "I don't pretend to know what's going to happen but here's some things to think about...\n\nWe're losing part time jobs and career jobs and picking up a bunch of low wage part time service sector and hospitality jobs. Those jobs are plentiful right now but as AI and automation kick in those will also be the biggest losers as well. \n\nIts also odd how banks are trying to give away houses to anyone to get someoe in the market, hey blacks and hispanics, buy a house no questions asked, hey need a 40 year mortgage cool, oh yeah covid has been over for years but we'll pay your mortgage for you if you can't pay it and just tack it on at the end\n\nInvestors are fleeing from real estate like never before, even etf's and dividend stocks as it makes zero sense to take risk when you can get 5% plus risk free doing nothing.", "score": 1, "replies": [{"body": "Racist comment. ***White*** people with low incomes who could not afford their mortgages were the majority who took out sub prime mortgages in the early 2000s that then crashed the economy.", "score": 1, "replies": []}]}]}
{"title": "Tesla the New AI powerhouse ( not priced in)", "selftext": "Just got an alert from a yahoo article about musk promising NVIDIA won't have a monopoly.\n\n'Musk does not name potential Nvidia rivals in this market. The billionaire is building his own AI platform. In addition, he also promised last month a ChatGPT moment for Tesla this year or next. Basically, the electric vehicle manufacturer is very advanced in AI so that its vehicles will be completely autonomous in the coming months.'\n\n&#x200B;\n\nIf this is true and TESLA gets a price to sales of 50-75 for being AI company, what will the market cap be?  Puts us around 4 trillion at todays revenue.     \n\n\nIf AI takes off we might be around 10-30 trillion valuation, the low side of what some youtubers were claiming.  \n\n&#x200B;\n\nif this is the case Tesla is cheap here.", "id": "1448ymy", "created_utc": 1686229986.0, "score": 0, "upvote_ratio": 0.22, "num_comments": 28, "comments": [{"body": "No reason to take anything Elon says at genuine face value.", "score": 45, "replies": [{"body": "[Indeed](https://fortune.com/2023/01/18/elon-musk-tesla-lawsuit-fsd-video-autopilot-ashok-elluswamy/)", "score": 1, "replies": []}]}, {"body": "Tesla is… a car company, battery company, solar company, humanized robot (???) company, and now an AI company too?\n\nSeeing how functional Tesla’s AI windshield wipers are… I wouldn’t put much faith in their AI.", "score": 27, "replies": [{"body": "It's a ~~camera~~, ~~advertising~~, ~~data~~, real estate company.", "score": 6, "replies": []}, {"body": "no you see, they will have an absolute monopoly in everything in 3 years.", "score": 4, "replies": []}]}, {"body": ">Basically, the electric vehicle manufacturer is very advanced in AI so that its vehicles will be completely autonomous in the coming months.\n\nIs the writer quoting Musk here or is this his own opinion?", "score": 6, "replies": [{"body": "That was the funniest part of the write up haha", "score": 1, "replies": []}]}, {"body": "Ah yes Tesla will be a 100 trillion company. You'd be a fool to not mortgage your house into it.\n\nBecause ***ai***", "score": 12, "replies": []}, {"body": "IMO Tesla is a bargain right now and I expect my investment to go up another 5X . But I’m not gonna risk my house for any stock and that isn’t a great idea for anyone for any stock.  But Tesla is a leader in several different huge potential growth areas. And if they continue to preform your investment should be rewarded.", "score": 9, "replies": []}, {"body": "I’m not sure if you’re trolling or not?", "score": 3, "replies": []}, {"body": "He's known for overpromising  and underdelivering. Tesla's self driving function has been promised for years and not even close to functioning.\n\n>he also promised last month a ChatGPT moment for Tesla this year or next.\n\nHighly unlikely.", "score": 1, "replies": []}, {"body": "Has Tesla shown any actual capability in this area or is it just him trying to juice stock prices again?", "score": 1, "replies": [{"body": "They gotta distract people from the fact that they still don't have fully autonomous cars after almost a decade of Musk claiming it's coming \"next year.\"", "score": 6, "replies": [{"body": "Wonder if Tesla or Waymo will be first.", "score": 1, "replies": []}]}]}, {"body": "People still believe anything elmo says?", "score": 1, "replies": []}, {"body": "Is there an extension to hide musk/tesla from the web", "score": 2, "replies": []}, {"body": "So um that AI thing that’s a fancy predictive text search engine. Has anyone figured out how to make money with it yet?", "score": 0, "replies": [{"body": "Its not about money silly, its about potential.\n\nJokes aside, Nvidia has been smashing it selling shovels during a gold rush. Other than them, I think everyone else is trying to figure out how to make money with AI.", "score": 1, "replies": []}]}, {"body": "Nvidia not having a monopoly =/= Tesla will go into silicone.\n\nIn my opinion AMD is in a better position to cream nvidia, but their software stack is lacking behind.   \nAlso, i'd not count intel out.\n\ntl;dr; i fucking hate nvidia, and i genuinely think AMD have better hardware solution, for a wider range of tasks.....", "score": -1, "replies": []}, {"body": "I hear Musk is also promising perpetual motion.  Long PM. OP, are you going to volunteer for Musk’ s Neuralink human trials?", "score": 0, "replies": []}, {"body": "Currently we need to put our hand on the wheel for Tesla FSD.  I personally believe that'll be the case for a very long time.", "score": 0, "replies": []}, {"body": "Fake solar-roof and Cybertruck fail isn't priced in either", "score": 0, "replies": []}, {"body": "Elon can gargle deez nuts", "score": 0, "replies": []}, {"body": "Perfect opportunity for Elon to pump money out of Tesla to fund r&d for another company he wants to start.", "score": 0, "replies": []}, {"body": "Oh yes, I too like take everything Elon says at face value. He never over promises and under delivers. What an honest guy.", "score": 1, "replies": []}]}
{"title": "CBOE VIX Long Term Play", "selftext": "The Cboe VIX is currently hovering around the 14,.. mark which is at least a new 3 year low. \nConsidering the fact that statistically speaking, there is a recession every few years, here’s my plan: \n\nThe CBOE VIX all time low was on Friday the 3rd of November 2017 with a close at 9,14 and for this strategy I assume it to not get below a level of 9,0.\n(See the list below for the 20 lowest closing levels of the VIX)\n\nIf the VIX falls to a level of around 9,0 and you opened a long position at around a level of 14,… (aka now) your position will loose around 35% and therefore you would need a gain of 53,8% to recover your position and end up break even. \nBasically you need the VIX to get back to wherever you bought in to your position. \nHowever, during a time of market turmoil and uncertainty with the next recession waiting behind every singe door one could possibly open, it is to expect that the VIX will within the next few years spike to something between 40 to 60+, and even dough you may make a huge loss and see your position dead in the red for quite some time, there will be a day when the VIX skyrockets to the Moon and give you a 350%+ gain. \n\n\nThe list I was talking about: \n  20 lowest VIX closes:\n     Fri 03 Nov 2017 =  9.14\n     Wed 03 Jan 2018 =  9.15\n     Thu 05 Oct 2017 =  9.19\n     Thu 04 Jan 2018 =  9.22\n     Fri 05 Jan 2018 =  9.22\n     Wed 22 Dec 1993 =  9.31\n     Mon 11 Dec 2017 =  9.34\n     Fri 21 Jul 2017 =  9.36\n     Mon 06 Nov 2017 =  9.40\n     Fri 15 Dec 2017 =  9.42\n     Mon 24 Jul 2017 =  9.43\n     Tue 25 Jul 2017 =  9.43\n     Mon 02 Oct 2017 =  9.45\n     Thu 23 Dec 1993 =  9.48\n     Fri 29 Sep 2017 =  9.51\n     Fri 14 Jul 2017 =  9.51\n     Tue 03 Oct 2017 =  9.51\n     Mon 08 Jan 2018 =  9.52\n     Mon 18 Dec 2017 =  9.53\n     Thu 28 Sep 2017 =  9.55", "id": "1448lpj", "created_utc": 1686229096.0, "score": 10, "upvote_ratio": 0.73, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|2 months ago\n**Total Comments**|76|**Previous Best DD**|\n**Account Age**|2 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: The CBOE VIX is currently hovering around the 14,.. mark which is at least a new 3 year low.", "score": 1, "replies": []}, {"body": "http://vixcentral.com\n\nFutures already have a pretty big rise priced in. The way I am playing this is by selling UVIX CSPs because IV/premiums are high. If the VIX spikes, I will close my short puts for pennies and then buy long puts. It’s too hard to time a spike, but it’s relatively easy to time when a spike will end (within days). At that moment, if it turns out that this is already priced into UVIX premiums, I will buy shares of SVIX or SVXY.", "score": 5, "replies": [{"body": "i could've bought shares to short vix this entire time?! Fuck my life im regarded, thanks for the information", "score": 3, "replies": []}]}, {"body": ">You're an idiot if you think the VIX is going to spike that high. It's not even close to being at levels seen during previous recessions.", "score": 5, "replies": [{"body": "Well that’s y it’s a LONG TERM PLAY", "score": 5, "replies": []}]}, {"body": "This is the dumbest idea ever.  If youre looking for a low vix in the 9s, wait for it to get to the 9s.  If you think were on the verge, then go for it now.  Regardless, short an index or something else.  Dont use the VIX.", "score": 2, "replies": [{"body": "Well isn’t this the place to present such ideas. An you know what people say: always reverse WSB. So I guess you could be right, but I promise to you that I will post my gains and mention you if this works", "score": 1, "replies": [{"body": "It just isnt a smart way to go about shorting something man.  Its a decaying asset in general.  Short it another way.", "score": 1, "replies": [{"body": "Yooo you have a fundamental misunderstanding here. I’m playing Long not short\nNo wonder this shit doesn’t make sense from your point of view", "score": 2, "replies": [{"body": "VIX decays over time is what the man is trying to tell you lol", "score": 1, "replies": [{"body": "Yes I know but that’s not the important point of this idea", "score": 1, "replies": []}]}, {"body": "Yeah, I know youre playing long.  It still decays.  Youre making this hella hard on yourself.", "score": 1, "replies": []}]}]}]}, {"body": "This. Besides why do I want to do a long term etf play that will decay.", "score": 1, "replies": []}]}, {"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Is there a zero decay (no theta or equivalent) instrument for playing the VIX? It sounds far fetched that all you have to do is wait to make a few bags every time the market acts up.", "score": 1, "replies": [{"body": "Not exactly, but I've had good success (11/12) shorting VIX when there's a large spike (usually 30%+) within a couple of days when VIX has been relatively flat beforehand.\n\nI go full port on ATM puts a couple months out. Usually target around 10% gains. You could theoretically make much more with more aggressive strike/dte but I'm not going that hard since I full port it.\n\nIt's not a super common occurrence, last one I did was the bank crisis deal in March. But I made 5k in a day and called it good. \n\nThe one time it failed and I sold for about a 10% loss is because I got greedy and tried to double dip on the same spike.", "score": 1, "replies": [{"body": "That's a fair strategy, though time sensitive.", "score": 1, "replies": [{"body": "Certainly. It's not fool proof but yields good results. The only downside to it is you need a fairly large portfolio otherwise the gains are small", "score": 1, "replies": []}]}]}]}]}
{"title": "Up $60k on $TSLA. Tesla to the moon! I came to collect.", "selftext": "", "id": "144cfxl", "created_utc": 1686238446.0, "score": 127, "upvote_ratio": 0.91, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|3 years ago\n**Total Comments**|176|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "I turned a 3k option to 7k in the past 40 days.. I wish I could make 60k but I'm poor unfortunately. I used plasma money to buy this 3k option and got blessed. Not sure when to cash out.", "score": 13, "replies": [{"body": "Plasma money lmao", "score": 1, "replies": [{"body": "I cashed out at 8k. Ya I make 6k a year on plasma donations so I can buy a couple 3k options.", "score": 1, "replies": [{"body": "What is a plasma donation", "score": 1, "replies": [{"body": "They take your blood, take the plasma out and give the rest of your blood back. You regenerate the stuff back and can give it twice a week. I usually make over 500 monthly.", "score": 1, "replies": []}]}]}]}]}, {"body": "The stock market is a zero-sum game. For every winner, there must be a loser. I will do whatever it takes to make sure that I am the winner and you are the loser.", "score": 25, "replies": [{"body": "That’s right.", "score": 14, "replies": []}]}, {"body": "Up 4% AH… ![gif](emote|free_emotes_pack|money_face)", "score": 11, "replies": []}, {"body": "You going to double down next week?", "score": 3, "replies": [{"body": "Always. Don’t be like me.", "score": 7, "replies": [{"body": "I have Tesla already", "score": 4, "replies": []}]}]}, {"body": "Tomorrow will be a good rally", "score": 3, "replies": []}, {"body": "gonna look even better at 930 am tomorrow.   i got $5 in my webull on this..  let's go!", "score": 3, "replies": []}, {"body": "TSLA will definitely increase over the next week", "score": 2, "replies": [{"body": "What do you think it’ll hit ? Personally 280$", "score": 1, "replies": []}]}, {"body": "70% is a good gain!", "score": 2, "replies": []}, {"body": "Damn. Congrats!!! 🙀💪🏼", "score": 1, "replies": []}, {"body": "Damn. I should really learn how to trade options.", "score": 1, "replies": []}, {"body": "We mooning 0DTE June 9th 260 calls. See you after hours for some loss porn", "score": 1, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "144e7jg", "created_utc": 1686242491.0, "score": 144, "upvote_ratio": 0.94, "num_comments": 29, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|367|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "AAPL has been loading up every 3months", "score": 48, "replies": []}, {"body": "AAPL employing the buy high, sell low strategy loved by WSB.", "score": 27, "replies": []}, {"body": "[deleted]", "score": 59, "replies": [{"body": "He also told a story about “understanding” the iPhone when a friend of his left one in a cab and his reaction was as if he lost a child.", "score": 27, "replies": []}, {"body": "Buffet invested in FTX and Sam blow face. Buffet talks bs!", "score": -7, "replies": [{"body": "Uhh buffet had nothing to do ftx.", "score": 10, "replies": []}]}, {"body": "Let me guess you're a 40 year old boomer.", "score": -5, "replies": [{"body": "Nobody is a 40 year old boomer. Literally. Not one person.", "score": 6, "replies": []}]}]}, {"body": "Explains the why 180 call expiring this Friday has the most ridiculous volume for a contract Iv ever seen", "score": 19, "replies": []}, {"body": "about 20 Billion buy back. thats not very significant relative to market cap. but how much is stock expected to rise?", "score": 17, "replies": [{"body": "Do the math: 20 billion / 3 trillion (roughly) and you get about 0.67 percent.", "score": 14, "replies": [{"body": "you're saying stock can go more than 250 in the long run?", "score": 4, "replies": []}]}]}, {"body": "200 a share confirmed", "score": 3, "replies": []}, {"body": "Wasting more money on buybacks to prop up the price. NTA is down to under $4 and still falling. Debt is now almost twice equity. In a couple of years the NTA will be zero,", "score": 0, "replies": [{"body": "You need to learn the difference between total debt (a mostly meaningless number) and net debt (the metric that actually matters). Apple still holds $60B in net cash.", "score": 20, "replies": []}, {"body": "You do understand finance right?\n\nYou understand that debt is at very preferential rates? And is actually a smart finance move?", "score": 28, "replies": [{"body": "This is a Wendy’s. Why would he understand finance?", "score": 8, "replies": []}, {"body": "You think they are going to keep getting funding at low rates?\n\nAAPL has always been a one trick pony with constant  boom and bust cycles. Every 2-3 years it drops 30-50%. Every decade it crashes 70-80%. \n\nThe entire product range is now little more than variations of the iPhone and some earbuds.  Even the Macs are now ARM powered 'phone' hardware that rely on virtualisation to run most non-Apple software.", "score": -3, "replies": [{"body": "This is the dumbest comment I've ever seen on WSB", "score": 9, "replies": [{"body": "I don’t think he likes money", "score": 6, "replies": []}]}, {"body": "And they’re also making vast quantities of money, being one of the most profitable companies to ever exist. The margins are legendary  and revenue outstrips many *countries*.", "score": 6, "replies": []}, {"body": "Looks like you missed the part where they double after falling 30%.", "score": 4, "replies": [{"body": "Truth.", "score": 2, "replies": []}]}]}]}, {"body": "They keep the debt so they don't have to pay tax", "score": 1, "replies": []}]}, {"body": " There's allot to gripe about but AAPL has been good to me. I'll be watching how they resource their manufacturing out of the slave state CCP/PLA. That said, in the future I'll be bullish AAPL again. Pretty sure.", "score": 1, "replies": []}, {"body": "Stock buyback is the most stupid shit ever.", "score": -3, "replies": [{"body": "If you make the float smaller it increases the EPS and you're not taxed on it like a dividend... 👍", "score": 4, "replies": []}, {"body": "It was once an criminal activity classified as stock manipulation.", "score": 1, "replies": []}]}, {"body": "Maybe that's why they made the announcements of all that stuff so meh... Tank the stock price, get more shares back for their money or something.", "score": -3, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "144kjbl", "created_utc": 1686257047.0, "score": 59, "upvote_ratio": 0.86, "num_comments": 23, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|9466|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "GM just announced they’re partnering with Tesla for charging as well \n\nhttps://twitter.com/sawyermerritt/status/1666905756132597795?s=42&t=xyXZ6hd2gFb5KOjeWqto4w", "score": 15, "replies": []}, {"body": "You're right, I am better than everyone else. And anyone who says otherwise is just jealous of my success.", "score": 7, "replies": []}, {"body": "So this guy has shares but buys puts for next day ☠️", "score": 3, "replies": [{"body": "Its called hedging or protection. Not that any regard here would understand that", "score": 9, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|8883)", "score": 2, "replies": []}, {"body": "_I’m playing both sides, so that I always come out on top_", "score": 2, "replies": []}, {"body": "Gotta hedge you noob.", "score": 2, "replies": []}, {"body": "Don’t hate, a gain is a gain. All I see is a responsible person hedging a position.", "score": 3, "replies": [{"body": "Hedging 75 shares? Who let the boomers on WSB?", "score": 3, "replies": []}]}, {"body": "Gotta make sure you artificially lower your returns in the long term when holding stock in a high quality company.", "score": 1, "replies": []}, {"body": "thats Mr. mysuruhuduga to you bud.![img](emote|t5_2th52|4267)", "score": 1, "replies": [{"body": "Bro click on his profile and it says “the big bull” smh 😂", "score": 0, "replies": []}]}]}, {"body": "You dont think tesla might tank next week with CPI coming out?", "score": 2, "replies": [{"body": "If it does, I am buying more shares, TO THE MOON BABY!!!!", "score": 2, "replies": []}, {"body": "Why do you think that?", "score": 1, "replies": []}]}, {"body": "Bad timing!", "score": 1, "replies": []}, {"body": "Unless it fucking dumps you are fucked my friend it’s at 246 in the afterhrs", "score": -3, "replies": [{"body": "yeah that $186 loss will sting... /s", "score": 2, "replies": []}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "How much has Tesla (TSLA) gone up in the past month? 41.44% ![gif](emote|free_emotes_pack|surprise)! I could have gained 101.62% on 2x leverage (TSL2) 😫", "score": 1, "replies": []}, {"body": "Buying puts by being a bull is like eating meat and saying I am a proud vegan😂", "score": 1, "replies": []}]}
{"title": "Apple 🍎 Stock could run to $200 $APPL", "selftext": "[deleted]", "id": "144nl3v", "created_utc": 1686264008.0, "score": 50, "upvote_ratio": 0.77, "num_comments": 27, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|368|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": [{"body": "I mean ‘23 forecast is between 200 and 225", "score": 1, "replies": []}]}, {"body": "Yes. Also, I could be a millionaire by trading options!", "score": 43, "replies": []}, {"body": "my peenoos could grow to 12 inches", "score": 27, "replies": [{"body": "Wow that's like 10 inches more than my peeno", "score": 4, "replies": [{"body": "Lucky", "score": 1, "replies": []}]}]}, {"body": "420 easy", "score": 20, "replies": [{"body": "420.69", "score": 7, "replies": [{"body": "Giggity", "score": 3, "replies": []}]}, {"body": "Are you Tim Apple? Coz you sound a lot like Tim Apple.", "score": 2, "replies": []}]}, {"body": "All stocks could go up, down or sideways", "score": 5, "replies": []}, {"body": "BTC to 100k vibe, the dump at 69k was glorious. I guess this is destined to rug at 185 with articles like this...", "score": 6, "replies": []}, {"body": "Well considering they are buying Disney why the hell not lol", "score": 7, "replies": [{"body": "Wait what?", "score": 4, "replies": [{"body": "[Apple, Inc. to Purchase Disney for $109 Billion. If One High-Powered Analyst Gets Her Way](https://www.disneydining.com/wall-street-analyst-suggests-apple-should-buy-disney-bb1/)", "score": 1, "replies": [{"body": "Never going to happen.\n\nAlthough I must say watching Disney present at Apple's WWDC was pretty cool.", "score": 7, "replies": []}]}]}]}, {"body": "Puts", "score": 2, "replies": []}, {"body": "another clown with a technical analysis title, this is your sell signal right here", "score": 2, "replies": []}, {"body": "\"APPL\"\n\nLOL", "score": 2, "replies": [{"body": "Big PP between A&L", "score": 1, "replies": []}]}, {"body": "Puts it is! Thanks WSB", "score": 2, "replies": []}, {"body": "“Could”", "score": 1, "replies": []}, {"body": "300 this time next year", "score": 1, "replies": []}, {"body": "calm your tits Tim, nobody is gonna buy that new thing", "score": 1, "replies": []}, {"body": "If you account for inflation which was more expensive the apple vr headset or Google glasses ?", "score": 1, "replies": []}, {"body": "Could? More like should’ve happened 2 years ago", "score": 1, "replies": []}]}
{"title": "CNN: It’s official. We’re in a bull market.", "selftext": "", "id": "144owr9", "created_utc": 1686267278.0, "score": 59, "upvote_ratio": 0.81, "num_comments": 29, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 year ago\n**Total Comments**|611|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "CNN: ‘Bull Market!!!’\n\nJ.P. Morgan- ‘Bull Market!!’\n\nKramer- ‘BULL MARKET’\n\nThis means you buy puts", "score": 100, "replies": [{"body": "Yup my thoughts exactly", "score": 14, "replies": []}, {"body": "They just let resistance break, next week should be still good as they wait FOMO to play out", "score": 4, "replies": [{"body": "Agreed maybe even two weeks. Wait for the shoe shiner to start picking calls", "score": 2, "replies": []}]}, {"body": "Truth. Buy bullets, bandaids, tillable land, water rights, lots of long term storage food stuffs. Oh, and puts. We're going to need lots of puts.", "score": 1, "replies": []}]}, {"body": "Bull shit", "score": 12, "replies": []}, {"body": "Thank god. Was really gettin sick of all this shit being on sale.", "score": 8, "replies": [{"body": "Puts were on sale, so load up now and let them rip!", "score": 1, "replies": [{"body": "Idk, i don’t want to fight the trend. I have my VIX bags ready if the apocalypse happens", "score": 2, "replies": []}]}]}, {"body": "We all know what this means.", "score": 8, "replies": []}, {"body": "puts for Monday? calls for Tuesday?", "score": 12, "replies": []}, {"body": "Time to sell i guess", "score": 5, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "If you have to ask us, you’re going to fuck up the timing anyway", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Honestly I'd stay away from VIX - it's been artificially held down for a while and not functioning like it was meant to. If you wanna make money off of pumps up or down just go for good ol fashioned puts and calls, and take profits FAST.", "score": 7, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "SPY or QQQ", "score": 5, "replies": []}]}]}]}]}]}, {"body": "Sounds ominous. Economic collapse and stock market collapse incoming then.", "score": 4, "replies": []}, {"body": "Sell the news", "score": 3, "replies": []}, {"body": "This is laughable. 1 day above “the price to exit the bear market” and they go on with this. \n\nI bet the banking crisis somehow pops back up by fall and we go back to bear heading into 2024", "score": 3, "replies": [{"body": "The market is already up 20% from October lows and could go up even higher by the end of year.", "score": 1, "replies": [{"body": " Might go up. Might go down", "score": 1, "replies": []}]}]}, {"body": "Inverse", "score": 2, "replies": []}, {"body": "Red day tomorrow for sure. Playing the short side tomorrow.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Very good, I bought tsla puts in the morning rip and sold all end of day for a nice gain. I wanted more, but can’t fight the overall bullish trend.", "score": 2, "replies": []}]}]}, {"body": "InB4 “Fake News” comment.", "score": 1, "replies": []}]}
