{"title": "Why the Market Bottomed on Friday: A Technical Breakdown", "selftext": "This past Friday, we witnessed the definitive bottoming of the market—mark it on your calendars, folks. After weeks of volatility, fear-mongering about inflation, the Federal Reserve, and the dreaded looming government shutdown, the market miraculously found its footing. But don’t worry, it wasn’t because of any sound economic or fiscal policy. No, no. It was because of “technical factors,” the magical force that makes or breaks Wall Street, apparently just in time to avoid that pesky government shutdown. Let’s dissect the genius behind this market bottoming and sprinkle in some wild predictions while we’re at it (hello, Meta $600 by 11/11).\n\n### The Technical Wizards Have Spoken\n\nFirst off, let’s talk about those sacred “technical factors.” You know the ones. Moving averages, Fibonacci retracements, the ever-mystical RSI—basically, the tools Wall Street traders use to pretend they know the future. When in doubt, just slap a chart up with some squiggly lines, and boom, you have yourself a market bottom. \n\nHere’s how it really went down. After bouncing off the 200-day moving average like a trampoline, the market decided that was low enough. Why? Because technical analysis says so, duh. The bulls rushed in, declaring victory over the bears, with many citing the “golden cross” as a sign from the heavens. We all know the “golden cross” works because it sounds fancy, not because it has any bearing on, you know, real economic indicators.\n\nMeanwhile, as the MACD turned positive (whatever that means), everyone agreed that Friday was it. No more dropping. This is the bottom, people! Forget about all those pesky things like inflation, interest rates, and the fact that the economy is possibly teetering on a recession. The charts said “buy,” and so we bought.\n\n### The Looming Government Shutdown That Wasn’t\n\nBut, of course, let’s not ignore the real savior of the markets—Congress. Yes, that beacon of efficiency and bipartisanship that we all trust so much. The threat of a government shutdown was enough to send shivers down the spine of investors everywhere. But in a twist that shocked absolutely no one, Congress avoided it. Sort of. For now.\n\nNow, I know what you’re thinking: “How could avoiding a shutdown actually cause the market to bottom?” Simple. When faced with the threat of government incompetence grinding the economy to a halt, investors suddenly remembered that Congress has a long and storied history of kicking the can down the road. There was never any real risk! They were going to do what they do best: wait until the absolute last minute and then barely pass something to keep the lights on for a few more weeks. Markets love that kind of predictability.\n\nAnd here’s the kicker: the more dysfunction in Washington, the more the market loves it. Why? Because the less Congress does, the less they interfere with the glorious workings of capitalism. So naturally, as soon as they did just enough to avoid a shutdown, the markets breathed a sigh of relief and bottomed out.\n\n### The Ever-Present “Wall of Worry”\n\nAh yes, the “wall of worry.” The thing that markets *love* to climb. Inflation? Worry. Rising interest rates? Worry. Recession fears? Worry. An energy crisis brewing in Europe? Worry. The wall of worry is higher than ever, but here’s the thing about markets—they don’t care. In fact, they thrive on this stuff.\n\nSee, when everyone’s worried, it means the market is “climbing” that wall. And nothing says bullish like a good old-fashioned sense of impending doom, right? When retail investors are freaking out about their 401(k)s, that’s when the real pros come in and scoop up the deals. Because, as every investor knows, there’s nothing more bullish than a market that looks like it’s about to collapse. \n\n### Why Meta Will Hit $600 by 11/11 (Yes, Really)\n\nNow, let’s talk Meta. Why $600 by November 11? Is it based on any fundamental analysis of the company’s earnings, growth prospects, or Zuckerberg’s grand metaverse ambitions? Of course not! It’s based on the fact that everyone *wants* it to hit $600. And if we’ve learned anything from the past few years, it’s that what retail investors want, they get.\n\nYou see, Meta’s been climbing its own wall of worry. People said the metaverse was a pipe dream, that Meta was spending too much, and that their ad revenue was doomed. But just like the market on Friday, Meta is bottoming. Why? Because technical factors said so. And also because if you throw enough money at virtual reality, eventually something has to stick, right?\n\nSo buckle up, dear readers. We’re in for a ride. The market has bottomed, the wall of worry is crumbling, and Meta is on a collision course with $600 by 11/11. Why? Because it’s 2024, and that’s just how things work now. \n\nDon't fight the technicals!\n\nPOSITIONS: META 160C 12/20/24", "id": "1fbgpyh", "created_utc": 1725741814.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 313 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Another leg down confirmed", "score": 84, "replies": [{"body": "That long ass post just so he could convince himself his META calls aren’t screwed 😂", "score": 25, "replies": []}, {"body": "Ya, the only bottom here is OP.", "score": 13, "replies": []}]}, {"body": "no charts, no links, no positions\n\nban this motherfucker", "score": 123, "replies": [{"body": "Trust me, bro", "score": 21, "replies": []}, {"body": "OP bottoms every Friday.", "score": 16, "replies": []}, {"body": "We demand crayons 🖍️ !!", "score": 8, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "Fr, I need crayons and if ima read something.", "score": 3, "replies": []}, {"body": "He does have a single line mention of his positions but I do prefer a nice screenshot", "score": 2, "replies": [{"body": "pretty sure that was a later edit\n\nbut its something", "score": 2, "replies": []}]}]}, {"body": "Too long to read. Let me guess, you feel it in your knees?", "score": 20, "replies": []}, {"body": "Excellent post. Paragraphs, not a run-on post. Legit thesis backed by facts.\n\nBuying puts.", "score": 57, "replies": [{"body": "\"Facts\"", "score": 5, "replies": []}, {"body": "What facts?", "score": 3, "replies": [{"body": "It was \"le sarcasm\"", "score": 3, "replies": []}]}]}, {"body": "Didn’t read but want to say macroeconomics don’t give a fuck about technicals", "score": 15, "replies": [{"body": "I can't believe how many people are just not looking at macros at a time when they are the most definitive, overbearing market mover.", "score": 3, "replies": []}]}, {"body": "“It’s what retail investors want, they get” - most absurd statement I’ve ever heard", "score": 12, "replies": []}, {"body": "Meta option premiums are so high no one from wsb can actually afford them.", "score": 17, "replies": [{"body": "Same with SPY honestly, it needs a 5:1 split", "score": 2, "replies": [{"body": "10:1 would make the calculations much simpler \n\nUntil then, UPRO and SPXL", "score": 1, "replies": [{"body": "It would but a price of around $50 wouldn’t move enough in dollars to be fun haha", "score": 1, "replies": []}]}]}, {"body": " Yeah, the option premiums for Meta are definitely steep right now. It feels like they're pricing in a lot of optimism. With all the talk about their metaverse plans, it's almost like a betting game at this point. If you're not ready to drop some cash, it might just be safer to watch from the sidelines until things settle down a bit.", "score": 1, "replies": [{"body": "As a tech guy and by looking at apple vision sales I don’t believe in metaverse boom in next 3-5 years, we are not there yet in term of good hardware. But Facebook’s AI advancements are very good and have real product usage. That may give a good price boost, but 600 this year is imho a gamble. Will probably just buy some shares for long-term", "score": 1, "replies": [{"body": "Bro, check out \"his\" comment history. It's ChatGPT posting every 2 minutes", "score": 2, "replies": [{"body": "What is even the point of doing this? I need to read more about dead internet theory but I just don’t understand the why behind something like this.", "score": 2, "replies": [{"body": "No idea, someone probably checking out how far he can take it", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You might be surprised at how much lower it can still go.", "score": 8, "replies": []}, {"body": "Stopped reading at Meta $600.", "score": 6, "replies": []}, {"body": "\"chatgpt make me a post on wsb\"", "score": 5, "replies": []}, {"body": "I have a feeling this will age like fine milk", "score": 16, "replies": []}, {"body": "Roaringkitty, is that you", "score": 10, "replies": []}, {"body": "Too long, ordering a Wendy's chicken sandwich, didn't read.", "score": 5, "replies": []}, {"body": "Did he say puts or calls? I can’t read", "score": 4, "replies": [{"body": "Puts. \n\nAll day.", "score": 2, "replies": [{"body": "Yep", "score": 3, "replies": []}]}]}, {"body": "Years ago, my wall street commuting buddies analyzed why the market “moves..”\n1. More buyers than sellers\n2. More sellers than buyers\n3. The money supply\n4. Oils\n5. Economic conditions.\n\nWe arrived at these causes for market activity by watching and listening to hundreds of hours of financial radio and TV, and carefully reading the WSJ and NYT. \nNow you know.", "score": 5, "replies": []}, {"body": "lol man this guy got every single reason the market went down wrong. Go Read a book or something.", "score": 5, "replies": [{"body": "It's pretty incredible, honestly.", "score": 2, "replies": []}]}, {"body": "Position? TLDR? Wtf", "score": 12, "replies": []}, {"body": "It hasn’t bottomed it’s only just begun.  🌈🐻🚀", "score": 4, "replies": []}, {"body": "There was like no bounce on Friday.", "score": 3, "replies": []}, {"body": "Wth was this? What is this door to door guy selling?", "score": 3, "replies": []}, {"body": "Saw a post similar to this almost every day last week, next day market is down. 90% of wsb is on hopium. Tell them market crash incoming, they block you.", "score": 3, "replies": []}, {"body": "I’m not reading this", "score": 4, "replies": []}, {"body": "RemindMe! 2 months", "score": 2, "replies": [{"body": "I will be messaging you in 2 months on [**2024-11-07 21:19:45 UTC**](http://www.wolframalpha.com/input/?i=2024-11-07%2021:19:45%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1fbgpyh/why_the_market_bottomed_on_friday_a_technical/lm0k00z/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1fbgpyh%2Fwhy_the_market_bottomed_on_friday_a_technical%2Flm0k00z%2F%5D%0A%0ARemindMe%21%202024-11-07%2021%3A19%3A45%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201fbgpyh)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 3, "replies": []}]}, {"body": "Saying that the markets would applaud a government shutdown is laughable", "score": 2, "replies": []}, {"body": "You’re making quite an assumption there, bub!", "score": 2, "replies": []}, {"body": "I want 2 mins of my life back \n\nNon-sober Reddit browsing is fine. Non-sober Reddit posting is bad. Mkay, kids?", "score": 2, "replies": []}, {"body": "What a waste of time that was", "score": 2, "replies": []}, {"body": "Perhaps a short bounce as we’ve had 4 red days in a row. But we r going down to sniff Poseidon’s crack.  Trust me bro.", "score": 2, "replies": []}, {"body": "Dumbest shit ever posted.", "score": 2, "replies": []}, {"body": "Fries. IN THE BAG", "score": 2, "replies": []}, {"body": "Source: OP is a bottom", "score": 2, "replies": []}, {"body": "Just buy Costco or Google at this point…", "score": 1, "replies": []}, {"body": "Thsbks man", "score": 1, "replies": []}, {"body": "*A power-bottom is a bottom that is capable of receiving an enormous amount of power.*\n\n- Ronald McDonald", "score": 1, "replies": []}, {"body": "Um.... really?", "score": 1, "replies": [{"body": "Uh... no.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Wow.\n\nAll that effort, and you didn't even get it.\n\nMeta to $600 in an election year in a recession when the market, in particular tech, are wildly overvalued while the market is rotating into mega cap, consumer staples and treasuries/bonds.\n\nMan, I really hope you haven't bet a lot on that completely odd prediction.\n\nGovernment shut down? \n\n[Half the time, they drive the market higher.](https://www.edwardjones.com/us-en/market-news-insights/stock-market-news/market-pulse/government-shutdowns)\n\nYou need to look at macroeconomics if you're going to navigate this market.\n\nHere's what happened:\n\nJobs numbers Friday AM triggered the sell off.\n\n- jobs creation number missed consensus - and a good proportion of jobs added were from the government.\n\nThat's bad.\n\nBut it got much worse.\n\n- Jobs numbers for June and July were both downwards revised **again**\n\n- 206K jobs turned into 118K\n\n- 175K turned into 89K\n\n- both June and July also owed the jobs numbers to a large amount of government jobs.\n\n**This came after 810,000+ jobs were downwardly  revised from last year** (for context they have only been  \"revised\" like that once before - in 2009 during a recession to make the economy seem better than it was.\n\nObviously, the August numbers (already lower than expected) will be revised lower next month.\n\nAll this happened after the challenger jobs numbers on Thursday which also missed big - showing that the private sector just isn't adding jobs like it should be in a growing economy. \n\nIn short, job growth has stagnated this year. The data has been manipulated, which calls other government data into question.\n\nThis made it very clear that we are likely in a recession (or have been for a while).\n\nThat causes people to derisk and move into more stable assets.\n\nYou will see that stocks like PG and PM barely moved and treasury based stocks like TLT went up (even thiugh the market didn't make a big shift in its opinion on Fed Rate cuts getting bigger).\n\nNot sure what chart you're looking at, but the MACD did not go positive except briefly on the 1m chart at open.\n\nRecession worry? \n\nA recession has been fully confirmed by 5-10 distinct indicators.", "score": 1, "replies": [{"body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "RemindMe! 6 days", "score": 1, "replies": []}, {"body": "RemindMe! 3 months.", "score": 1, "replies": []}, {"body": "You're off by a week or two, near-term. Mag 7 have diverged a lot in how much they've retraced. Also haven't retested 200 EMA on the daily, excepting GOOGL. META and AAPL are lagging the rest and due to retrace more as well. RSI and PPO are still above oversold.\n\nLonger-term, who knows. Macro always trumps technicals longer term.", "score": 1, "replies": []}, {"body": "Bro casually forgot that this upcoming week is loaded with economic reports before making this post\n\n!remindme 1 week\n\nhttps://preview.redd.it/nm70hmq5qhnd1.jpeg?width=1290&format=pjpg&auto=webp&s=57543341192df0361921e055ccd838ca727b86e0", "score": 1, "replies": []}, {"body": "So did this guy not pullup gamma rotation? We are in brutal negative gamma with forced hedging, and NQ closed below the 200SMA. When you are above or below the 200SMA you are objectively net bullish or bearish.", "score": 1, "replies": []}, {"body": "TDLR : Short meta and the market in general", "score": 1, "replies": []}, {"body": "Phew thank goodness more to go", "score": 1, "replies": []}, {"body": "Inversing at open on Monday", "score": 1, "replies": []}, {"body": "Ad spending is first the be cut when a recession hits. I would get some meta puts if possible.", "score": 0, "replies": []}]}
