{"title": "TOMORROW MU AND NVIDIA UP 🚀🚀🚀 ", "selftext": "Do your own research but aha I’m buying calls tomorrow to expire next week 😈😈", "id": "1fpeeec", "created_utc": 1727295992.0, "score": 56, "upvote_ratio": 0.97, "num_comments": 78, "comments": [{"body": "If MU EPS is more than $1.10 we will 🚀🚀🚀🚀🚀🚀🚀 based on my 16 hours without any sleep looking on internet , ok", "score": 12, "replies": [{"body": "Their eps is $1.18", "score": 5, "replies": [{"body": "🚀🚀🚀🚀🚀🚀🚀😭🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀 I’m so happy rn", "score": 4, "replies": [{"body": "Hopefully mooning starts in pre market", "score": 3, "replies": [{"body": "Started after hours and will tank when market opens", "score": 1, "replies": [{"body": "It always is like that", "score": 3, "replies": [{"body": "There’s no other way! Fuck retail investor to make the richer when I’m just trying to to get 20 gas moneu", "score": 1, "replies": []}]}, {"body": "I know", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Seems like TSM may join aswell", "score": 8, "replies": [{"body": "This actually seems like a good idea. Thank you!", "score": 2, "replies": []}, {"body": "Also LRCX, AMAT, QCOM, KLAC, AVGO. We’re cooking", "score": 2, "replies": []}]}, {"body": "Show me $134 LETS GO", "score": 7, "replies": [{"body": "LETS GOOO 🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 4, "replies": []}]}, {"body": "Perfect!  Great investment day", "score": 7, "replies": []}, {"body": "Bagged off of MU earnings today", "score": 6, "replies": []}, {"body": "Hope so. This market is not the same", "score": 6, "replies": [{"body": "That’s why you just gotta listen to regardless like me and make your own decisions ok", "score": 4, "replies": []}]}, {"body": "Nvidia $200", "score": 17, "replies": [{"body": "🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 8, "replies": []}, {"body": "🚀🚀🌙", "score": 6, "replies": []}]}, {"body": "Hold the line men ⚔️🛡️", "score": 4, "replies": []}, {"body": "Whoever’s sold,,, good job!!!", "score": 4, "replies": [{"body": "Now I’m buying puts 🫠", "score": 2, "replies": [{"body": "Too late for that too,", "score": 3, "replies": []}]}, {"body": "But I'm so mad lol I bought back calls I sold at a loss. And then it immediately tanked. Gah u hate this stock.", "score": 2, "replies": [{"body": "Yes i hate it lol i keep trynna time it. Todays was a good day", "score": 1, "replies": []}, {"body": "I did the same.  And they had appreciated hugely and now are around where I sold them.  Fucking rooking move on my part.", "score": 1, "replies": []}]}]}, {"body": "I need it to get back to 140 to turn green", "score": 3, "replies": [{"body": "Patience grasshopper..: NVDA is in full production of their blackwell chip and expected $10b in revenue in q4 alone. The stock is ready to print!", "score": 1, "replies": []}]}, {"body": "NVIDIA road to $1000", "score": 6, "replies": [{"body": "In Jensen we trust", "score": 5, "replies": []}, {"body": "50trillion$", "score": 1, "replies": []}]}, {"body": "Actually… tonight.", "score": 2, "replies": []}, {"body": "I hate when I window shop a earning list and the stock that caught my eye actually hits. 😭", "score": 2, "replies": [{"body": "it’s tough when a stock you had on your radar takes off without you. It feels like a missed shot, and that can sting. But here’s the thing: that gut feeling you had? It’s real. Trust it. If you don’t back your own intuition, no one else will. This time, the stock slipped by, but next time, you’ll be ready—and more confident to act on what you know. You’ve got the instincts, just don’t second-guess yourself. Keep believing in your ability to see the opportunities before anyone else does!", "score": 1, "replies": [{"body": "Thank you. I brought TSLL cash secured puts instead. Hope the print off the traction of this.", "score": 2, "replies": [{"body": "You got this", "score": 1, "replies": []}]}]}, {"body": "Don't let it get to you very few things are predictable earnings are not beat expectations, good guidance, secretary on the 4th floor quit -20% a good way to play MU today was SOXL when 1 semiconductor stock pops they all do. Spreads on er don't make that much unless it's a serious move and it's expensive usually. Honestly the best way I still think is if you have disposable income and can risk it. the thing is you get hooked on the rush of playing earnings and it's not a wining strategy. TTD AFFIRM  were my 2 best. A good play is to see a good ER  stock is flat or taking off get in.", "score": 1, "replies": []}]}, {"body": "Hmm down 0.65% at 1:17pm today", "score": 2, "replies": [{"body": "Sold my calls at profit 320% today at 9:39 am", "score": 1, "replies": [{"body": "Nice!", "score": 1, "replies": []}]}]}, {"body": "Sold all my AMD and bought PLTR", "score": 2, "replies": []}, {"body": "Don’t forget LRCX, AMAT, KLAC. Semiconductors to the moon.", "score": 3, "replies": [{"body": "Are you listing smh holdings?", "score": 2, "replies": []}, {"body": "🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "It’s regarded actually", "score": 2, "replies": []}, {"body": "And I was chosen to provide this info you’re just talking nonsense ok 👍🏽", "score": 2, "replies": [{"body": "Let me guess your next post will be buying GoPro?", "score": 1, "replies": [{"body": "No,\n\nAt the moment, I see all AI-related stocks as bullish heading into October-November. Micron Technology (MU) is breaking out of its bearish trend, which is a strong indicator that we’re back on track for growth. As a key supplier of memory chips, Micron plays a crucial role in the AI and tech ecosystem, especially in providing DRAM and NAND flash memory, which are essential for processing and data storage in AI applications.\n\nThis rebound in Micron signals a positive shift not just for them, but also for major players like NVIDIA, whose GPUs rely heavily on these memory components to handle AI workloads. As demand for AI technologies continues to rise, MU’s recovery bodes well for the entire sector, amplifying the potential for further gains across AI stocks.", "score": 2, "replies": [{"body": "What about LUNR?", "score": 1, "replies": [{"body": "The hype around Intuitive Machines (LUNR) after securing the NASA contract could last several weeks to months, depending on their project success and market reactions. If the company continues to make progress and deliver on expectations, interest could be sustained for a longer period. Ultimately, the market cap will likely reflect the company’s performance and overall market sentiment in the space sector.\n\nI already took my profits on LUNR so I’m onto AI stocks again as I’m very regarded", "score": 1, "replies": [{"body": "Okay I will edit my previous post, my apologies", "score": 2, "replies": []}]}]}, {"body": "WDC got a good bump based on the DRAM NAND connection but I think WDC is the most undervalued semiconductor stock in. The market convince me otherwise.", "score": 1, "replies": []}]}, {"body": "Who the fuck wants in on GoPro?", "score": 1, "replies": []}]}]}, {"body": "Absolute bollocks. Penny stock crap. Rug pull imminent- please be careful", "score": 1, "replies": [{"body": "I removed post as it was a joke/jab at the gentleman who started this thread. He unfortunately whipped my a$$ with actual facts and I ran away to hopefully live another day.", "score": 3, "replies": []}]}]}, {"body": "Nvidia forever 😂 was eyeing up MU this week actually", "score": 1, "replies": []}, {"body": "I’ll sell you those calls what strike ?", "score": 1, "replies": []}, {"body": "I’m planning to buying calls today as well for $130 NVDA strike price and 2 weeks expiry", "score": 1, "replies": []}, {"body": "I’ll break even on the way to the moooooooon 🌒", "score": 1, "replies": []}, {"body": "Tomorrow will be another bloodbath. Sorry, i lost all confidence in this stock and the market. \nI guess tomorrow we will see a lot of selling and profit taking. I lost all hope", "score": 1, "replies": [{"body": "Im taking profit at $129", "score": 2, "replies": [{"body": "Bye Felicia…", "score": 0, "replies": []}]}, {"body": "Sucks to be you… Learn to invest vs yoloing on the hype and hearsay.  MU is printing 💰 as I speak…", "score": 0, "replies": [{"body": "Haha...", "score": 1, "replies": [{"body": "Keep the faith brotha!", "score": 1, "replies": [{"body": "You too, keep the faith in your meme stock, bwhahaha", "score": 1, "replies": [{"body": "👍 up 13 points today and I got in at $89. Sucks to be me… Gonna have to figure how all these taxes Im gonna have to pay on this meme stock.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I was not wrong, lol. It started dropping as i predicted", "score": 1, "replies": []}]}]}, {"body": "Yo please for the love of monkeys don’t sell I wanna make another gme out of this stock", "score": 1, "replies": []}, {"body": "MU is going to tank tomorrow watch", "score": 0, "replies": [{"body": "Explain your thesis", "score": 1, "replies": [{"body": "Have you been paying attention to Earnings with other companies? Good earnings tanks! Bad earnings we in the green baby!", "score": 2, "replies": [{"body": "But history doesn’t have to repeat itself", "score": 1, "replies": [{"body": "It does, lol", "score": 1, "replies": []}]}]}]}]}]}
{"title": "I feel sick", "selftext": "My dumbass just getting into options decided to yolo almost my entire portfolio into nvidia calls today. And that would be good if I wasn’t 1 day trade away from getting flagged. Any Recommendations? ", "id": "1fp7uy2", "created_utc": 1727279639.0, "score": 0, "upvote_ratio": 0.2, "num_comments": 76, "comments": [{"body": "If your entire portfolio is only about $2,000 youll be fine… dont be so impulsive next time!!", "score": 97, "replies": [{"body": "True", "score": 7, "replies": [{"body": "I got a loan of 130k at 10% interest thinking the 20% apr would outrun the ust terra stable coin and it collapsed, lost all of it. Recently, just earned enough to get out of the hole working 2-3 jobs at a time. That's sick. \n\nThis is a drop in the bucket, you got a long life + inflation ahead of you. Don't even sweat it.", "score": 40, "replies": [{"body": "Thanks man. I’m sorry about your loss though.", "score": 14, "replies": [{"body": "\"Takes money to make money\" was my justification at the time. \"Earn a passive income!\".. etc.\n\nThe better line is \"Don't gamble/play with money you don't have.\" Do whatever you want to with money you do have.. when you're young.", "score": 8, "replies": [{"body": "You're why we need banking regulations. A financial institution shouldn't have been allowed to loan you that money to put into stocks.", "score": 5, "replies": [{"body": "Indeed, except it wasn't for a stock. It was an ad off of creditkarma saying I was qualified for a 100k personal loan with SoFi. One night I got the bright idea and said \"well, I could just pay it off if I don't use it.\" Three clicks later I had an approval and the money in my account a day later. It was scary fast. Predatory loan doesn't even begin, I didn't even have to say what it was for. However, if I were to have filed bankruptcy, it would have gone with that, but I didn't.. mainly because I didn't even know that was an option, also it ruins your credit for 10+ years.", "score": 5, "replies": [{"body": "Yeah it's a messed up industry. Sorry that you fell into it.", "score": 2, "replies": [{"body": "The irony of using credit karma to manage my networth+student loans and credit report accuracy also credit karma leading me to be in 180k in debt at once, with the loan, student loans, and credit card debt.\n\nNow I'm actually up a few grand for the first time since college, with 401k put away on the side, starting a new on Monday with the government 200k/yr job that pays enough to live a comfortable life/WLB.\n\nAs Trump said about COVID when he got it \"I LEARNED A LOT.\"", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yep. \"It's not gambling if you know what you're doing.'\" Luckily they're tax write offs eventually so I'll get it all back (my partner sells stock as compensation, so when we get married those capital loss carry-overs will come out of the tax bill). But I paid it all off by working hard and didn't create a go fund me or ask for handouts. I quietly went on a bunch of Adderall and doubled down on my engineering. Got engaged during it and my son from my first relationship has everything he's ever wanted. People have made worse mistakes than me.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "It was the terra stablecoin. It's about as creditable as tether was for a long time.\n\n>In May 2022, the Terra blockchain was temporarily halted after the collapse of the stablecoin TerraUSD (UST) and LUNA, an event that wiped out almost $45 billion in market capitalization within a week.[1][2] On January 21, 2024, the company filed for bankruptcy.[3\n\n https://en.m.wikipedia.org/wiki/Terra_(blockchain)", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Not a rug pull. The algorithm for the token failed. The Terra UST collapse happened because it was designed to stay equal to $1 through a system linked to another coin, Luna. When confidence in UST dropped, many people tried to exchange it for Luna all at once. This overwhelmed the system, causing both UST and Luna to lose most of their value quickly.\n\nA rug pull is when project creators intentionally drain funds and disappear, leaving investors with worthless tokens.\n\nIn contrast, the Terra UST collapse wasn’t intentional. It resulted from a flawed design in the system linking UST to Luna. When trust broke down, the system couldn’t handle the sudden rush to sell, causing the crash. It wasn’t a deliberate scam, but rather a failure in the mechanism that was supposed to keep UST stable.", "score": -1, "replies": []}]}]}]}]}]}, {"body": "dude", "score": 2, "replies": []}, {"body": "Lmao holy shit", "score": 2, "replies": []}, {"body": "To be fair, literally every single person in crypto advises against doing just that. I asume you're one of them now. Hard lessons to have to learn firsthand though.", "score": 3, "replies": [{"body": "Indeed, I did it before there was a general consensus that you shouldn't do that. These days you can find articles and stories like myself a dime a dozen. To my defense, the de-peg of Luna/Terra was not really gambling so much as taking a risk I didn't even fully understand even as a computer scientist and web3 dev, putting my trust into what I considered smarter people (that are now in jail).", "score": 1, "replies": [{"body": "I meant it more like \"loaning money to invest\" even without the specifics of the investment. Sorry that happened to you though, but it looks like things are soon looking up for you", "score": 1, "replies": [{"body": "Loaning money to invest is the cornerstone of our economy and world. Student loans are an investment in education for hopes of return in salary, mortgage is a loan with hopes of building equity/owning the home. It's not hard to see the justification of borrowing money to invest with if you feel the returns will be better than the cost, but my research and optimistim was just too dumb and I made a mistake. The issue I had though was how volatile and terrible the crypto world is (MEV bots, etc).", "score": 0, "replies": [{"body": "Borrowing money to buy crypto was never the same as buying a house. I get that was the justification but even if you're a hardcore believer in the mythical usecases of crypto, it is not the same as owning a physical object of which the entire world already agrees it is worth something. Ohwell, it doesn't matter", "score": 1, "replies": [{"body": "Think of it more like, I decided to borrow a bunch of USD and then converted it to Zimbabwe dollars before they lost all their value. Cryptocurrency is actually as real as fiat and holds some value, however, the value of it is changing every day, just like real currency, and the technology is still in its early stages, not something to gamble on as a person who has to borrow money to invest in it. Oddly I've always been one of those people who thought all crypto would go to zero like NFTs, however, the idea of a stablecoin earning interest made sense to me.", "score": 0, "replies": [{"body": "the lack of any sovereign state backing a crypto asset makes it not really comparable to a real fiat currency. While \"loaning money to invest\" is inherent to actual businesses using loaned funds for actual materials, labor, overhead, etc. - speculative asset / currency gambling is no where in that realm. It was a bet.", "score": 1, "replies": [{"body": "The cryptocurrency was a stablecoin meant to match the value of the dollar with a bunch of tokennomics behind it.  So, every investment is a bet. Those who invested a few thousand in crypto (like me, long ago when I was mining it and bought 20 btc for a few dollars, but sold it at 1k), have made plenty of money and there are plenty of businesses with real material, labor, etc that have gone belly up. You're talking to a startup guy that has seen 50% of the places I've worked, out of 26 employers, go belly up and bankrupt.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Just deposit $25k into the account.", "score": 11, "replies": [{"body": "I’m 19 this is pretty much a yolo 💀", "score": 2, "replies": [{"body": "You are good then, let it expire.", "score": 9, "replies": []}, {"body": "Not to preach but you shouldn't yolo. Ya 2k isn't much money but over time that can become a lot by the time you retire. I highly suggest reading The Richest Man in Babylon. It's short and very informative.\n\nEven if you double this you'll wanna do it again and again and it'll only take one bad trade to wipe you out.", "score": 3, "replies": [{"body": "You’re right. I’ll pick up the book by the way. Always open to knowledge and other peoples experiences", "score": 2, "replies": []}]}]}]}, {"body": "Your on a marginal account. Switch it to a cash account and you’ll be able to sell it if you want.", "score": 9, "replies": [{"body": "He can't switch with open trades I'm pretty sure", "score": 3, "replies": []}]}, {"body": "Can you guys explain what this post means?", "score": 16, "replies": [{"body": "Those are options contracts I can’t close", "score": 4, "replies": [{"body": "I don’t know what that means tbh\n\nAlso don’t see where it’s showing this in the pic, all I’m seeing is the profit you made", "score": 16, "replies": [{"body": "So in the picture it says he bought 7 NVDA contracts,  he's not buying the actual stock, it's more like he's being loaned it from the 25th until the 27th.\n\n As far as I know there are two main types of accounts; Margin Accounts, and Cash accounts. He, at the moment has a \"Margin Account\" meaning that he can day trade to his heart's content, as long as he has 25k or more in his portfolio. Meaning that he could buy those 7 contracts, and sell them within a few minutes. It's great because you CAN make money like that and you don't run thr risk of holding the next day and possibly losing said profit. For example, let's say he has 30k in his account, and he buys 25k NVDA Call contracts, and he waits a few minutes for the market to do it's thing and sells it for 28k. As soon as he sells he can use that same amount to buy some more contracts of whatever company. There's some possibility to make a lot like that, or lose lol... because your funds are readily available. If you do not have 25k in your account though, you'll only be permitted to make the max of 3 same day trades, or else you'll get your account banned, that's called Pattern Day Trader rule(PDT).\n\nA cash account on the other hand is a little, let's say he has 10k in his account and he buys 8k worth of Contracts, and he sells it after a few minutes for 15k. He will not have the money he used until the following day when the market opens.  With a cash account you don't have to worry about PDT because well you can only play with what you have for the day.\n\nSo the issue OP is having is, he probably already used all three of his allowed trades for the day, and he probably wants to sell the profit he makes because he's worried about it becoming negative tomorrow, due to NVDA being very Volatile. He can probably still sell and get off with a warning. They usually give people a warning for doing this for the first time, but repeating the offense is where the issue lies and can get him banned.\n\n\n\nAnyway man, I hope I didn't make too many typos and it made sense to you.\n\n\nEDIT: got some clarification from another user. You won't get banned, your account will be restricted", "score": 8, "replies": [{"body": "Your account won't get banned, but will be restricted from buying. \n\nWhich means you can only close your positions, and will be forced to put in enough for your portfolio to be at least 25k before the restriction is lifted.\n\nYou do have one grace where you can call them only one time to get it lifted, but after that you have no more.", "score": 3, "replies": [{"body": "Yeah, thanks for the clarification, will edit my post.\nAppreciate you 🙏🏿", "score": 1, "replies": []}]}]}]}, {"body": "Wait wait wait. You day traded max occurrences. Was warned you couldnt day trade anymkre and yolod your entire portfolio into options you couldn't get out of and waited until after you purchased them to feel sick?", "score": 11, "replies": [{"body": "Yes I know I’m a degenerate. Also I forgot I was on my max", "score": 4, "replies": [{"body": "how could you forget you’re at max when they warn you with a pop-up notification that takes up half your screen when you attempt to place the order?", "score": 4, "replies": []}]}]}, {"body": "First pdt reset is free", "score": 3, "replies": [{"body": "Really?", "score": 0, "replies": [{"body": "Yep. Google for the steps", "score": 1, "replies": []}]}]}, {"body": "Switch to a cash account and you can sell my man. \n\nNext time have an exit strategy. Or don’t. “What’s an exit strategy?” - DFV", "score": 2, "replies": []}, {"body": "Take PDT penalty and use the one time penalty remover.", "score": 2, "replies": []}]}]}, {"body": "If you cannot afford to lose the money, take the penalty and pull your money imo, and dont touch options in till you have a better idea of what they are and what your risk is.", "score": 8, "replies": []}, {"body": "You can turn it into a spread. Sell 7 contracts one strike above (NVDA 124C 9/27). This will basically turn it into a much smaller trade. Then tomorrow you can close the spread without incurring a day trade. Next, turn your account into a cash account and never worry about PDT rules again.", "score": 8, "replies": [{"body": "This", "score": 1, "replies": []}]}, {"body": "Why can't you sell it? Your cost basis is 1.95 and the current price is 2.1, so you're up...\n\nSell to close 7 contracts at 2.1 \n\nThe break even price only matters if you exercised the contracts.", "score": 4, "replies": [{"body": "I’m currently 1 day trade away from being flagged", "score": 1, "replies": [{"body": "Well getting flagged for PDT isn't a life ending thing. Just don't day trade until you have 25k\n\nSo if you get flagged you should be prevented from day trading anymore, but you might be able to call the broker and get it removed. You can also convert it to cash only, though that limits you too since you have to wait for settlement\n\nYou could also just call the broker and see what they can do.", "score": 4, "replies": []}]}]}, {"body": "You belong here. First options play and you choose 2dTE", "score": 4, "replies": [{"body": "Here? more like r/wallstreetbets", "score": 12, "replies": [{"body": "Literally", "score": 1, "replies": [{"body": "lol my bad. Thx for posting the link. OP you’re posting on the wrong subreddit", "score": 1, "replies": []}]}]}]}, {"body": "He bought? Dump it", "score": 2, "replies": [{"body": "ha", "score": 2, "replies": []}]}, {"body": ">enters position\n\n>asks for advice\n\nMaybe flip that order around next time (if you're not at zero by Friday)", "score": 2, "replies": []}, {"body": "Degen option trader/scalper 5 years running. \n\nSwitch to a cash account asap.  PDT rules are a massive trap for small accounts if you're trying to be a degen. \n\nI had margin on for like a year before changing and HOLY shit. You can buy and sell same day, but the cash is locked up until next morning. Cant trade w it anymore same day, but it's safe.\n\n(Also, if you can't sell those, you can go to the option chain and write a call against that. Do 1 position otm relative to yours. You'll lock in most of your gains as premium and now you have a spread. Close it out tomorrow. You won'tbe able to do this on a Cash account but for now it'll protect you. )\n\nIts messy, but better than being forced to hold a short dated green position. \n\nNow if you'll excuse me, heading back to WSB to talk about dicks or camps for the ber. Or some other asinine shit. 😘✌", "score": 2, "replies": [{"body": "This is the best suggestion. Writing a call against it is a great way to lock in gains", "score": 2, "replies": [{"body": "Your comment makes me happy to know I might have learned a thing or two along the way. XD", "score": 1, "replies": []}]}]}, {"body": "It’s 2k. If you feel sick over gambling 2k you need to delete the apps now.\n\nYou’re buying options that expire in 2 days, you are no longer investing. Straight up gambling.", "score": 2, "replies": []}, {"body": "You don't have to wait for the breakeven price bruh. Just sell at 2.1, you already got profits", "score": 3, "replies": []}, {"body": "Good luck man lol", "score": 1, "replies": [{"body": "Thanks.. I need it", "score": 1, "replies": []}]}, {"body": "Just as an example of not being a dumbass I'm 120x + on NVDA in 8 yrs. Patience grasshopper. That's not to say I'm not a dumbass elsewhere, but AMD and NVDA seemed like good bet. MU is probably a good play rn. And it always comes around again if you miss it.", "score": 1, "replies": [{"body": "Oh, right, your broke. Don't trade, if anything Blackjack has better odds", "score": 1, "replies": []}]}, {"body": "It looks like expires Friday - just go on tomorrow morning and sell for profit tomorrow. \n\nWhat's the problem?", "score": 1, "replies": [{"body": "I’m just hoping it doesn’t dip.", "score": 1, "replies": []}]}, {"body": "Sell $125 calls, then close out both legs Tomorrow", "score": 1, "replies": []}, {"body": "go to settings and switch to cash account very easy. Sell. wait till cash settles. switch back", "score": 1, "replies": []}, {"body": "NVDA is currently at $124.56.  do you have an extended hours sell in. Nvidia could pop overnight. ", "score": 1, "replies": []}, {"body": "lol well this turned out for the best", "score": 1, "replies": []}, {"body": "You will be fine, NVDA is the new break out king 💪", "score": 1, "replies": [{"body": "🙏🙏", "score": 1, "replies": []}, {"body": "Not anymore", "score": -1, "replies": []}]}]}
{"title": "How can I ensure I am a millionaire in the next 2 years?", "selftext": "[removed]", "id": "1fpacz3", "created_utc": 1727285803.0, "score": 0, "upvote_ratio": 0.09, "num_comments": 69, "comments": [{"body": "No. Not without taking unreasonable risk.", "score": 92, "replies": [{"body": "And that would be anything but assurance.", "score": 7, "replies": []}]}, {"body": "Why 2 years? You absolutey can if you extend the time frame.", "score": 22, "replies": [{"body": "Noted. Do you have any suggestions on how I can go about setting a reasonable target? Any books, link, etc would be very helpful.", "score": -12, "replies": [{"body": "Don't set a timeframe. You can focus on growing your wealth through sound decisions. You will just end up making weird decisions and taking unnecessary risks to make within the arbitrary set timeframe.", "score": 16, "replies": [{"body": "Ah gotcha. People seems to be very polarized in i should hold or sell Nvidia stock.", "score": 2, "replies": [{"body": "I hold NVDia but it is a small portion of my portfolio. The thing is, if NVDIA crashes, you are fucked.  If you put it into total market accounts you are more diversified. If you go to sell I would talk to an accountant to look at tax liabilities. You may be able to sell some this year and next to split taxes.", "score": 12, "replies": []}]}]}]}]}, {"body": "Is it possible? Absolutely. Just be prepared for it to be 50k also\n\nIf you're talking about strictly NVDA investments, it's unlikely that it will hit 1m in 2 years", "score": 14, "replies": []}, {"body": "With that kind of money you can just leave it in a ETF that tracks the S&P 500 and be a millionaire in about 6-8 years without the unnecessary risk Smfh 🤦🏻‍♂️", "score": 46, "replies": [{"body": "Based on a historical 10% return it would be more like 10-12 years.", "score": 5, "replies": []}, {"body": "Do you have an ETF you prefer?", "score": 2, "replies": [{"body": "VOO or VTI", "score": 2, "replies": []}]}]}, {"body": "According to Richard Branson the best way to become a millionaire is to start off with a billion dollars and buy an airline.", "score": 4, "replies": []}, {"body": "Lets assume you will continue to be a employee and participate in the ESPP. If so, I think it is very realistic to hit 1m but I do not know how much you are contributing or what the price of NVDA will be in the future. Do you also get any RSUs?", "score": 4, "replies": [{"body": "Yup I do. Above value is vested RSU + ESPP.", "score": -1, "replies": [{"body": "about how much are you contributing annually at the current stock price (RSU + ESPP)?", "score": 1, "replies": [{"body": "15% of my income goes to ESPP. \nRSUs are coming in roughly $25k a year on average.", "score": 1, "replies": [{"body": "I am in a similar position. I do 10% ESPP and receiving RSUs. Something like 98% of my portfolio was in the company I work for. This is dangerous because you are super exposed to a single company but at the same time you may not want to sell your shares because of the tax on the gains and you may want to hold your position. I have been keeping my ESPP shares and 10% of the RSUs. I sell the rest of the RSU as soon as they vest and move into broad market index funds. This way you won't get a tax hit on selling the shares and you will diversify your portfolio. Obviously this is not for everyone and I am not trying to encourage you to do the same. I just wanted to point out a way to diversify without shooting yourself in the foot the next time you do your tax return.", "score": 3, "replies": []}]}]}]}]}, {"body": "vegas. roulette. your favorite color. then get lucky.", "score": 3, "replies": []}, {"body": "In this case I would send your money to me so I may invest ( drive) more classic Porsche’s….its the smart play here", "score": 5, "replies": [{"body": "Makes sense to me", "score": 2, "replies": []}, {"body": "God I love this comment. My air cooled portfolio has out performed the S&P 500 over the years...", "score": 1, "replies": []}]}, {"body": "Taking advantage of the high price of NVDA, selling some of your shares and investing in ETFs is the safest way. But it is also difficult for you to reach 1 million in 2 years", "score": 2, "replies": [{"body": "You can read some of Buffett's writings or read some books about investing such as \"Rich Dad Poor Dad\", \"The Intelligent Investor\"", "score": 1, "replies": []}]}, {"body": "Sell the stocks. Pay the taxes. Open a vanguard or fidelity account, buy VOO. Direct your ESPP investments on a monthly basis to VOO. And chill.", "score": 2, "replies": []}, {"body": "Put it in an etf, two years is too short term. If you can make a million in two years with 300k, you can lose 300k in a month the same way lol", "score": 2, "replies": [{"body": "It's basically a guarantee in a decade", "score": 2, "replies": []}]}, {"body": "ODTE options will work", "score": 2, "replies": []}, {"body": "I mean if NVDA 3x you’re basically at a mil. lol just sit tight man, I have recently retired failing to pick stocks, and just buy VOO or SPY now. Best advice I can give.", "score": 2, "replies": []}, {"body": "Get a million dollars bonus. Boom!", "score": 2, "replies": []}, {"body": "The use of the word \"ensure\" means without risk. And that is not possible in the investment world.", "score": 1, "replies": []}, {"body": "Challenge Jensen Huang to a boxing match", "score": 1, "replies": []}, {"body": "Pick undervalued stocks with potential.  Right now I have my eye on Intel and Boeing as an example.  Intel because they still dominate enterprise compute and Boeing because we have zero other options available for domestic commercial aircraft that can meet demand.  Both stocks deeply in the shit right now (for good reason) but I could see a future where that isn't the case.  No doubt there are other similar options, these just come to mind.", "score": 1, "replies": []}, {"body": "Yes, leave it in NVDA", "score": 1, "replies": []}, {"body": "Possible? Yes. Will you do it? Probably not. ", "score": 1, "replies": []}, {"body": "If a yearly 80% profit was doable without significant risk everyone would be a millionaire. For example 1k would be over a million within 12 years, without investing more. It's ludicrous", "score": 1, "replies": []}, {"body": "Become a billionaire in the next one,", "score": 1, "replies": []}, {"body": "Forget about 2 yrs\n\nNo one knows what the market is going to do in such a short time", "score": 1, "replies": []}, {"body": "Man big gamble with NVDA could win big or get demolished", "score": 1, "replies": []}, {"body": "No one knows for sure if you'll get that $million, but diversify out of some of that NVDA if possible.", "score": 1, "replies": []}, {"body": "Drugs?", "score": 1, "replies": []}, {"body": "Put it all into uxin", "score": 1, "replies": []}, {"body": "It’s possible but you can’t ensure it.  Remember pigs get slaughtered", "score": 1, "replies": []}, {"body": "Your principal is in a great spot. I'd get out of the 2 years mindset, that kind of thinking is dangerous and leads to people losing/gambling their principal. Once you hit 700k the exponential gains really start hitting (10% on average per year in s and p). \n\nI'd focus on pumping all extra income into the market and in a couple years you will have a lot of passive income.", "score": 1, "replies": []}, {"body": "By an inheritance", "score": 1, "replies": []}, {"body": "Well, since you're an employee, then you tell us. what you are you hearing on the inside?  :-)\n\n(We know the CEO is very bullish)", "score": 1, "replies": []}, {"body": "You can have it tomorrow if you play with 0dte’s. You could also be bankrupt though.", "score": 1, "replies": []}, {"body": "Have a million now?", "score": 1, "replies": []}, {"body": "Ensure? No way to ensure but there's one possibility.\n\nIf Trump wins and really does do the federal strategic bitcoin reserve, that's certainly possible. Especially if you buy BITX which is a 2x multiplier ETF for bitcoin.", "score": 1, "replies": []}, {"body": "Yes. Prob bitcoin. It can also turn to 10k lol", "score": 1, "replies": []}, {"body": "“How do I guarantee 3x returns in 2 years?” If that was possible we’d all be retired sitting on a beach, not on this subreddit.", "score": 1, "replies": []}, {"body": "I assume your plan is to hit the lottery in that time frame as well :-)", "score": 1, "replies": []}, {"body": "Just give me your $310,000 and I'll give back $1,000,000 two years later. Trust me, bro.", "score": 1, "replies": []}, {"body": "You’d need about a 300% increase to get to a million", "score": 1, "replies": []}, {"body": "2 years is tight for that much reward without risk. Ask yourself if you need that money in 2 years. If so, that risk is too high. If not and you’re willing to risk the bisque then find some 2x 3x leveraged tech stocks and get after it! 😂\n\nBut in all seriousness, if you’re risk adverse and want to see a milli (almost guaranteed!?) put it in VOO for 10 yrs. \n\nNot financial advice\n\nEdit- call me silly but I do think NVDA has at least a two year upside/ run here. We’re not done yet. Will it be the highest gains? Probably not. But imo, it could be a safe spot to store your $ given their purse and forward looking p/e. (Just my opinion and what I’m currently doing)", "score": 1, "replies": []}, {"body": "Buy bitcoin. RemindMe! 1 year.", "score": 1, "replies": [{"body": "I will be messaging you in 1 year on [**2025-09-25 20:41:16 UTC**](http://www.wolframalpha.com/input/?i=2025-09-25%2020:41:16%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1fpacz3/how_can_i_ensure_i_am_a_millionaire_in_the_next_2/lowyrhe/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1fpacz3%2Fhow_can_i_ensure_i_am_a_millionaire_in_the_next_2%2Flowyrhe%2F%5D%0A%0ARemindMe%21%202025-09-25%2020%3A41%3A16%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201fpacz3)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Sell the NVDA stock or at least a decent portion of it. More like to become a 100k’er than a millionaire holding all your savings in one stock. Diversify.", "score": 1, "replies": [{"body": "The logic is right but I wouldn’t sell NVDA if my life depended on it.", "score": 1, "replies": []}]}, {"body": "Start selling calls", "score": 1, "replies": []}, {"body": "Become the Ceo", "score": 1, "replies": []}, {"body": "You cannot.", "score": 1, "replies": [{"body": "You cannot without taking an unreasonable risk*", "score": 3, "replies": []}]}, {"body": "I have a friend in Nvidia who has been working there since 2016, how much do you think her stocks are worth? $50mil?", "score": -4, "replies": []}]}
