{"title": "Stocks to buy at high inflation era ?", "selftext": "Hey everyone,\n\n\nAs everyone talking about high inflation due to rise of commodities and high demand, what stocks do you keep eye ?\n\nI do think companies with great competitive advantage can easily rise its own product prices. But who are they ?", "id": "n8h7vn", "created_utc": 1620576208.0, "score": 17, "upvote_ratio": 0.75, "num_comments": 22, "comments": [{"body": "You are likely better off buying great companies than trying to hedge against an inflation spike which nobody is certain will happen over the long run.\n\nThat said, physical assets, commodity producers, and energy tend to hold up well. Gold does as well (though that has some other variables thrown in for fun).", "score": 26, "replies": []}, {"body": "Commodities", "score": 10, "replies": []}, {"body": "Energy, Banks, Financials, Insurance\n\nPlaces where raising prices is not as hard to do", "score": 14, "replies": [{"body": "My health insurance has been raising by double digits % yearly for the past 5 years", "score": 3, "replies": []}]}, {"body": "Any one whose profit margins are fully exposed to everyday spending. \n\nVisa/MA / AXP might be good options, I think the only large  spending they are not exposed to is housing and vehicles? \n\nNot saying this is the best option, or all options, just saying they may be 1 option.", "score": 3, "replies": []}, {"body": "Not everyone talking. Not inflation era.", "score": 7, "replies": []}, {"body": "What about utilities?  Like VPU?", "score": 3, "replies": []}, {"body": "Companies with pricing options. High margins and lots of cash on the books. Commodities and real estate do well in inflationary environment. Companies operating in the red and with narrow margins will likely struggle.", "score": 2, "replies": []}, {"body": "Commodities look good right now; steel has been booming, will probably start slowing down later this year tho, and BDRY has been doing phenomenally. Definitely look into some of the agriculture commodities as well, I personally like $CORN", "score": 2, "replies": []}, {"body": "Mining stocks", "score": 2, "replies": []}, {"body": "Banks", "score": 2, "replies": []}, {"body": "Commodities like Gold and Platinum the best. Can put in ETF like Gold trust. Individual stocks like harmony gold, goldfields GFIJ, Impala platinum and sibanye stillwater Gold, silver and platinum.", "score": 1, "replies": []}, {"body": "Unpopular opinion, we are looking at deflation, not inflation.  Companies are not thriving because of inflation, or they have warehouses full of unsold goods.  Companies are not thriving because they are unable to purchase the goods and services to make stuff to sell.  That has been the common theme in forward guidance all earnings season in every thing I have read.\n\nAs more states cut off enhanced benefits and people finally get back to work the economy is going to moon.", "score": -5, "replies": [{"body": "No we’re definitely looking at inflation lol https://demonocracy.info/infographics/usa/us_stimulus_package_10_trillion_2020/us_stimulus_package_10_trillion.html", "score": 7, "replies": [{"body": "\"Inflation is when government spend money\"", "score": 1, "replies": [{"body": "https://www.investopedia.com/ask/answers/111314/what-causes-inflation-and-does-anyone-gain-it.asp\n\nKEY TAKEAWAYS\nInflation is a measure of the rate of rising prices of goods and services in an economy.\nInflation can occur when prices rise due to increases in production costs, such as raw materials and wages.\n\nA surge in demand for products and services can cause inflation as consumers are willing to pay more for the product.\n\nSome companies reap the rewards of inflation if they can charge more for their products as a result of the high demand for their goods.\n\nHmmm sounds familiar.", "score": -2, "replies": [{"body": "That is assuming that the economy is operating at full capacity. There is an argument that the American economy is operating way under full capacity and this argument is supported in part by the unemployment numbers. In my opinion, the spending is justified because the American economy has so much room to take the increased spending in. Economists spend their entire career trying to piece together what causes inflation really, a short Google search won't get you all the factors and answers.", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Xme 1000%", "score": 0, "replies": []}, {"body": "VXX and UVXY", "score": 1, "replies": []}]}
{"title": "Google shareholders and sideliners please share your thoughts", "selftext": "As we know Google is receiving most of its money from advertising. New strategy from Apple targets \"typical users\" to increase their awareness regarding privacy.  Are you worried? Apple can afford that with multiple streams of income and high margins. \n\nGiven we see more and more regulation towards protecting end users activity is Google in trouble?\n\nThey want us to pay for their subscription, do you think a lot of users will pay up?\n\nWhat is your insight?", "id": "n8kofx", "created_utc": 1620586166.0, "score": 12, "upvote_ratio": 0.75, "num_comments": 25, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "I swear I’ve thought of something random and then and seen an ad before", "score": 1, "replies": []}]}, {"body": "The largest risk I see is if the DoJ blocks Google from paying Apple billions of dollars a year to be the default search engine on iOS devices or if Apple comes out with their own search engine. Apple maps has taken a big chunk of market share from Google maps on iOS devices because a lot of people just use whatever is the default app.", "score": 8, "replies": [{"body": "Apple porched Googles head of search in 2018 btw", "score": 1, "replies": [{"body": "*poached", "score": 1, "replies": []}]}]}, {"body": "Google is so much more than an ad company lol. This isn’t fucking Facebook.", "score": 23, "replies": [{"body": "About 80% of total revenue is ad revenue.\n\nSure, they have their cloud business and some other small revenue streams, but they are for sure highly dependend on ad revenues. \n\nStill, I get what you are saying. You are exposed to much more than just Google search (see YouTube, Waymo, X, Deepmind, ...)", "score": 2, "replies": [{"body": "Ad services and as revenue in total is NOT user data selling... or even tracking. A lot of people pay to put adds on google.", "score": 1, "replies": [{"body": "Uhm, what are you trying to say? I don't understand.", "score": 1, "replies": []}]}]}, {"body": "If that’s the case then what else do they do that actually generates money? Please enlighten me", "score": -6, "replies": [{"body": "Cloud, data center, google services, chromeOS products, etc", "score": 4, "replies": []}, {"body": "Google Cloud at 7.15% operating income", "score": 3, "replies": []}, {"body": "Why don’t you just short google bud. I’m an idiot and have no idea what I’m talking about.", "score": 1, "replies": []}]}]}, {"body": "Nothing to worry about. Google itself is following Apple and making it harder to track users (read about their changes in browser cookies). They don't need to track people to display relevant ads. They have all the information they need in every product you use.\n\nIf you think about it, this is actually good for Google. Let's say you're a mattress company looking to advertise for people who are looking to buy a mattress. With tracking enabled you can advertise on FB to users who you know visited mattress websites recently. If you cannot track users then where will you go? Google and Amazon where you can display ads to people who query for a mattress.", "score": 5, "replies": []}, {"body": "Facebook relies on building an advertising profile for a person, and then targeting ads to the person. Google's ad revenue relies on targeting ads to a search. They don't need to know anything about the person, so their ad revenue is more or less safe and locked in as long as people still use Google as their primary search engine.", "score": 4, "replies": [{"body": "My youtube commercials look suspiciously close to subjects I google.", "score": 1, "replies": [{"body": "If you are logged into Google and Google services they can obviously track your activity too. They don't need IDFA for any of that. They control the browser and the web search, they control the world.", "score": 2, "replies": []}]}]}, {"body": "While Google does receive most of its money from advertising, I wouldn't worry about it at all. They have investments in sooo many different sectors, like AI, hardware, IoT, autonomous driving, SpaceX, just to list a few. Besides, most people still use the Youtube website and Google search engine, so it isn't exactly going to do much to topple them. Youtube and Google's utter monopoly in their respective ad spaces will let them coast through Apple's new privacy thing.", "score": 4, "replies": [{"body": "  You mentioned a lot of different investmens but those are not generating any cash am I right?", "score": 1, "replies": [{"body": "Of course they are. Hardware probably generates the most amount of money after ads, Google gave SpaceX 1 bil in 2015 with a valuation of 12 billion. Now, spacex is worth 74 billion. There's also other things that I'm forgetting that you should probably go look up.", "score": 2, "replies": []}]}]}, {"body": "Google has had lawsuit after lawsuit thrown at it. Maybe it settles one and pays a few billion dollars in fines. To Google, that's the equivalent of finding a few dollars scrunched up in its ass pocket and handing it to a homeless man before getting back in its self driving prototype car and heading to your mother's house for \"hot coffee\".\n\nThey'll still have a monopoly on web traffic, they'll still have a monopoly on video sharing, and they'll still have a duopoly on the mobile OS market. I probably missed a monopoly. Oh well.", "score": 0, "replies": []}, {"body": "Google and Facebook are fine.\n\nIt would be reflected in their share price if there was a genuine concern that their businesses were in trouble.", "score": 1, "replies": []}, {"body": "Google cloud, enterprise SAAS like Docs/Drive, and Android/Fi will provide nicely diversified revenue sources for the next few years (not to mention online ad market is still growing each year). After that, I presume further growth will come from at least one of their Other Bets (Waymo, Verily, etc), where they’ve already invested much more in fundamental R&D than any other company. Also their smarthome/assistant investments (Nest, Home, etc) and venture-capital arms will probably payoff huge in 5+ years.", "score": 1, "replies": []}]}
{"title": "Skyworks expands into Automotive Semiconductor Industry! SWKS new hot stock!", "selftext": " On April 22, Skyworks Solutions, Inc. (**SWKS**) announced that it has entered into a definitive agreement with Silicon Laboratories, Inc. (**SLAB**), under which Skyworks will acquire the infrastructure and automotive business of Silicon Labs for $2.75 billion. \n\n Skyworks is already one of the leading chip suppliers to smartphone manufacturers including Apple, Inc. (**AAPL**). The acquisition of this business line will not only help Skyworks gain market share in the fast-growing mobile networks industry, but will also help the company venture into the EV (electric vehicle) space. \n\nSee the full Article Bellow:\n\n[https://mosttraded.com/2021/05/09/swks-great-chip-stock/](https://mosttraded.com/2021/05/09/swks-great-chip-stock/)", "id": "n8coni", "created_utc": 1620561142.0, "score": 29, "upvote_ratio": 0.74, "num_comments": 21, "comments": [{"body": "Cramer loves skyworks", "score": 7, "replies": [{"body": "Are you trying to get this downvoted in here? Cramer in WSB.... Man", "score": -4, "replies": [{"body": "You know you should do the opposite of whatever he says right?", "score": 11, "replies": [{"body": "This is the way", "score": 9, "replies": []}]}]}, {"body": "Saks is quite undervalued now. once AAPL makes its next big move up Saks will follow and outperform. no Brainerd buy here.", "score": 1, "replies": []}]}, {"body": "I’ll stick w TSM thanks tho", "score": 6, "replies": [{"body": "Are they even in the RF design space?", "score": 1, "replies": [{"body": "They are in cars and smartphones mostly iPhones.  Same as skws so that’s a hard pass from me TSM all day", "score": 0, "replies": []}, {"body": "TSM is a contract manufacturer.  They make chips designed by other companies that don't have their own fabs.", "score": 0, "replies": [{"body": "I know they are a CM. What I am saying is they occupy different spaces. SWKS designs and manufactures RFICs, iPhones and playstations all have multiple SWKS chips already. My question wasn’t based on my unfamiliarity with TSMC, rather they are not direct comparisons.", "score": 1, "replies": []}]}]}]}, {"body": "So new. So hot. 💦💦", "score": 2, "replies": []}, {"body": "Skyworks is one of the most oversold stocks in the market now considering its strategic position and value.  They were at 205 a few weeks ago and now 165 on no particular news. And the Apple chips are not going to affect them.  AAPL itself is also a buy today but I figure more bang for the buck with Skyworks so I am selling some T and VZ (my parking places for cash) and buying SWKS and will buy more tomorrow if it sinks any further. Last time there was a big tech sell-off SWKS bottomed around 165 so this may be the extent of it", "score": 2, "replies": []}, {"body": "Something worth watching\n\nhttps://news.stocktradersdaily.com/news_release/90/Skyworks+Solutions+SWKS+Technical+Update_050921091019.html", "score": 0, "replies": []}, {"body": "Does anyone know anything about the 5G-volta microchips, stock symbol or manufacturer's name. It's a chip to control overloads in electrical grid and alternative energy systems. Supposedly approved by the last and present administration for funding.", "score": 1, "replies": [{"body": "GE Verizon partnership thing collaboration nah it’s akts", "score": 1, "replies": [{"body": "Thanks, these other advisory outfits want to charge you for a investment program to get that stock symbol.", "score": 1, "replies": []}]}]}, {"body": "Huge pent up value in this stock.  Good earnings reports with adjusted expectations as well.  It will go to the moon on a rocket or not", "score": 1, "replies": []}]}
