{"title": "ARKs - Daily Trade Information [05/14/2021]", "selftext": "||Fund|Date|Direction|Ticker|CUSIP|Company|Shares|% of ETF|\n:--|:--|:--|:--|:--|:--|:--|:--|:--|\n|1|ARKF|05/14/2021|Buy|PATH|90364P105|UIPATH INC|48,037|0.0976|\n|2|ARKF|05/14/2021|Buy|TWLO|90138F102|TWILIO INC|12,138|0.1034|\n|3|ARKF|05/14/2021|Sell|9923HK|G9835C108|YEAHKA LTD|517,200|0.0957|\n|4|ARKF|05/14/2021|Sell|MKTX|57060D108|MARKETAXESS HOLDINGS INC|1,100|0.0146|\n|5|ARKF|05/14/2021|Sell|NVDA|67066G104|NVIDIA CORP|500|0.0083|\n|6|ARKG|05/14/2021|Buy|MASS|65443P102|908 DEVICES INC|27,838|0.0129|\n|7|ARKG|05/14/2021|Buy|RPTX|760273102|REPARE THERAPEUTICS INC|2,713|0.0011|\n|8|ARKG|05/14/2021|Buy|RXRX|75629V104|RECURSION PHARMACEUTICALS INC|69,020|0.0187|\n|9|ARKG|05/14/2021|Buy|SGFY|82671G100|SIGNIFY HEALTH INC|202,015|0.0680|\n|10|ARKG|05/14/2021|Buy|IONS|462222100|IONIS PHARMACEUTICALS INC|159,649|0.0787|\n|11|ARKG|05/14/2021|Buy|EXAS|30063P105|EXACT SCIENCES CORP|18,300|0.0229|\n|12|ARKG|05/14/2021|Buy|CMIIU|125842203|CM LIFE SCIENCES II INC|2,179|0.0003|\n|13|ARKG|05/14/2021|Buy|CDXS|192005106|CODEXIS INC|27,900|0.0065|\n|14|ARKG|05/14/2021|Buy|BLI|084310101|BERKELEY LIGHTS INC|75,937|0.0357|\n|15|ARKG|05/14/2021|Buy|ACCD|00437E102|ACCOLADE INC|1,415|0.0007|\n|16|ARKG|05/14/2021|Buy|SURF|86877M209|SURFACE ONCOLOGY INC|1,302|0.0001|\n|17|ARKG|05/14/2021|Sell|VRTX|92532F100|VERTEX PHARMACEUTICALS INC|2,077|0.0058|\n|18|ARKG|05/14/2021|Sell|TMO|883556102|THERMO FISHER SCIENTIFIC INC|2,800|0.0166|\n|19|ARKG|05/14/2021|Sell|SYRS|87184Q107|SYROS PHARMACEUTICALS INC|204,414|0.0141|\n|20|ARKG|05/14/2021|Sell|SRPT|803607100|SAREPTA THERAPEUTICS INC|179,845|0.1730|\n|21|ARKG|05/14/2021|Sell|RHHBY|771195104|ROCHE HOLDING AG|103,334|0.0562|\n|22|ARKG|05/14/2021|Sell|PSTI|72940R300|PLURISTEM THERAPEUTICS INC|37,570|0.0018|\n|23|ARKG|05/14/2021|Sell|PHR|71944F106|PHREESIA INC|6,500|0.0038|\n|24|ARKK|05/14/2021|Buy|ZM|98980L101|ZOOM VIDEO COMMUNICATIONS INC|6,432|0.0096|\n|25|ARKK|05/14/2021|Buy|U|91332U101|UNITY SOFTWARE INC|22,735|0.0096|\n|26|ARKK|05/14/2021|Buy|TSP|90089L108|TUSIMPLE HOLDINGS INC|75,990|0.0140|\n|27|ARKK|05/14/2021|Buy|PLTR|69608A108|PALANTIR TECHNOLOGIES INC|71,866|0.0073|\n|28|ARKK|05/14/2021|Buy|PACB|69404D108|PACIFIC BIOSCIENCES OF CALIFORNIA INC|25,469|0.0030|\n|29|ARKK|05/14/2021|Buy|CRSP|H17182108|CRISPR THERAPEUTICS AG|20,000|0.0109|\n|30|ARKK|05/14/2021|Buy|COIN|19260Q107|COINBASE GLOBAL INC|80,412|0.1067|\n|31|ARKK|05/14/2021|Sell|BIDU|056752108|BAIDU INC|19,000|0.0180|\n|32|ARKK|05/14/2021|Sell|ONVO|68620A203|ORGANOVO HOLDINGS INC|11,890|0.0004|\n|33|ARKK|05/14/2021|Sell|TREE|52603B107|LENDINGTREE INC|102,911|0.0965|\n|34|ARKK|05/14/2021|Sell|SNPS|871607107|SYNOPSYS INC|29,680|0.0354|\n|35|ARKK|05/14/2021|Sell|REGN|75886F107|REGENERON PHARMACEUTICALS INC|1,121|0.0030|\n|36|ARKK|05/14/2021|Sell|HUYA|44852D108|HUYA INC|502,100|0.0402|\n|37|ARKK|05/14/2021|Sell|PCAR|693718108|PACCAR INC|4,300|0.0021|\n|38|ARKW|05/14/2021|Buy|DIS|254687106|WALT DISNEY CO/THE|150,556|0.4893|\n|39|ARKW|05/14/2021|Sell|TCEHY|88032Q109|TENCENT HOLDINGS LTD|135,332|0.1974|\n|40|ARKW|05/14/2021|Sell|NVDA|67066G104|NVIDIA CORP|218|0.0024|\n|41|ARKW|05/14/2021|Sell|NFLX|64110L106|NETFLIX INC|26,621|0.2495|\n|42|ARKW|05/14/2021|Sell|FSLY|31188V100|FASTLY INC|2,400|0.0019|\n|43|ARKW|05/14/2021|Sell|CRWD|22788C105|CROWDSTRIKE HOLDINGS INC|420|0.0015|\n|44|ARKW|05/14/2021|Sell|BIDU|056752108|BAIDU INC|3,300|0.0117|\n|45|ARKW|05/14/2021|Sell|API|00851L103|AGORA INC|283,508|0.2030|\n|46|ARKX|05/14/2021|Buy|IRDM|46269C102|IRIDIUM COMMUNICATIONS INC|8,518|0.0508|\n|47|ARKX|05/14/2021|Buy|KTOS|50077B207|KRATOS DEFENSE &amp; SECURITY SOLUTIONS INC|26,211|0.1038|\n|48|ARKX|05/14/2021|Sell|SPCE|92766K106|VIRGIN GALACTIC HOLDINGS INC|6,000|0.0156|\n|49|ARKX|05/14/2021|Sell|WKHS|98138J206|WORKHORSE GROUP INC|136,395|0.1686|", "id": "ncmkme", "created_utc": 1621037319.0, "score": 13, "upvote_ratio": 0.68, "num_comments": 27, "comments": [{"body": "Dis? Interesting. Must be a cash like position?\n\nAlso selling nvda and Netflix and others to load up on the memes pltr and coin and others. 👌", "score": 14, "replies": [{"body": "> Dis\n\nin the next generation ETF, no less", "score": 6, "replies": [{"body": "I don't see it here, is this outdated or am I blind:\n\nhttps://ark-funds.com/wp-content/fundsiteliterature/holdings/ARK_NEXT_GENERATION_INTERNET_ETF_ARKW_HOLDINGS.pdf", "score": 1, "replies": [{"body": "I just got this email a few minutes ago, maybe they are slow to update PDFs", "score": 2, "replies": [{"body": "Ok, maybe it'll show up by Monday.", "score": 2, "replies": []}]}]}]}, {"body": "They buy a meme in large qty, stories get written, people follow, meme goes up, they quickly sell, meme crashes.\n\nrinse and repeat", "score": 9, "replies": [{"body": "Except she just keeps buying PLTR and it keeps going down.", "score": 11, "replies": []}, {"body": "Yeah this is not accurate in the slightest. Almost all her picks have been deep red for weeks/months now.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "How is their past solid? They’ve consistently (for 15 years) not made a profit.", "score": 2, "replies": []}]}]}, {"body": "> Sell AGORA INC\n\n> Sell HUYA INC\n\nConsidering when ARK purchased these, they are selling these duds at a *big* loss.", "score": 12, "replies": [{"body": "And WKHS 3m shares sold at a 50% loss Lol", "score": 4, "replies": []}, {"body": "Yeah. Do they explain their rationale behind sells which lead to net loss ?", "score": 3, "replies": []}]}, {"body": "Cathie is really buying high and selling low lately. She was loading up on Bidu for awhile now she is selling?? Selling Huya now??? Bought fastly in the 90s and sold out completely at 40? Wtf\n\nThat and she bought zoom at the absolute top.", "score": 7, "replies": [{"body": "Selling WKHS at the literal bottom...\n\n\nShe’s lost her touch....", "score": 2, "replies": []}, {"body": "She bough $COIN at the top too, but she is still buying, so she might recover.", "score": 1, "replies": []}]}, {"body": "Lost $900k on Workhorse lol", "score": 12, "replies": [{"body": "Why she just doesn’t hold WKHS for the long term is beyond me.\n\nAnybody eating a 50% loss in WKHS is an idiot, and it’s gotta be more than 900k\n\nShe bought most of her shares between $19 and $35", "score": 5, "replies": []}, {"body": "\"5 year horizon\" sure Cathie.. sure", "score": 4, "replies": []}]}, {"body": "I swear these always look like she just threw darts at a dartboard", "score": 10, "replies": [{"body": "Well she did say her stock picks fulfill the will of god so she very well could be throwing darts.", "score": 1, "replies": []}]}, {"body": "Disney!!!!  Yes!!!!!", "score": 1, "replies": []}, {"body": "Are these the infamous WOODSTONKS?", "score": 1, "replies": [{"body": "she did buy DISNEY when it was the only stock that dipped... so it can't be all bad", "score": 1, "replies": [{"body": "hahah yeah ik. I feel like Cathie Wood is severely overhated on wall street. While people talk about the past, she focuses on the future and that's what I like about her. I'll prolly be investing in arkk soon since its heavily discounted rn", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "That escalated quickly...", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Well she is the Crimson Chin", "score": 1, "replies": []}]}
{"title": "Huya: severely undervalued.", "selftext": "Huya: The most undervalued company in the market.\n\nhttps://i.imgur.com/dVC4QND.jpg\n\nWhat is Huya? \n\nHuya is the largest game streaming platform in all of China, it’s basically the Chinese equivalent of Twitch. \n\nEsports is absolutely huge in China, bigger than in the west, it’s like a real sport over there. They hold tourneys in giant $900m stadiums and offer substantial cash prizes to winners. This is an industry with strong tailwinds and we know there will only be massive growth for the foreseeable future.\n\nThe majority shareholder of Huya is Tencent, which is great news for Huya because they can buy exclusive streaming rights for all Tencent games like League of Legends and Dota2 as well as exclusive broadcast rights for tournaments, which is creating a very nice moat. Add the network effect and you can forget about anyone ever challenging Huya’s dominance in the industry. We all know Google and Microsoft could never even compete with Twitch despite sniping the largest streamers Ninja and Shroud, because the network effect for game streaming is just that strong.\n\nSo what makes Huya so undervalued?\n\nWell, just look at these numbers:\n\nMarket Cap: $4b\n\nSales: $1.67b\n\nP/S: 2.4\n\nPE ratio: 28\n\nPEG ratio: 0.3\n\n2020 Revenue growth: 30%\n\n2020 Earnings growth: 89%\n\n5 yr revenue cagr: 20-30%\n\nCash: $1.6b\n\nDebt: $0\n\nCompare these with a somewhat similar company, Bilibili, the Youtube of China.\n\nMarket cap: $37b\n\nSales: $1.8b\n\nP/S: 20.5\n\nPE ratio: 0\n\nPEG ratio: 0\n\n2020 revenue growth: 50%\n\n2020 earnings growth: -118%\n\n5 yr revenue cagr: 35-45%\n\nCash: $2b\n\nDebt: $1.29b\n\nBut why?\n\nHuya had been hit with the perfect storm of terrible news. We all know tech and growth stocks are crashing right now because of inflation, add the fact that Chinese stocks are getting hammered right now because of the new regulations that threaten to delist some of the shadier Chinese companies out there. But that’s not all, there is something else holding this stock down, a pending merger with their largest competitor Douyu.\n\nThis potential merger would basically double Huya revenue instantly, double the cash on the balance sheet, while giving them a new market cap of roughly $7b, and they would instantly capture 80% of all game streaming market share in China. Basically a monopoly in a hyper growth industry. They could also increase margins substantially with no competition and no need to outbid competitors with large contracts to their streamers to keep them on the platform.\n\nUnder normal circumstances this potential merger would be the most bullish development of all time, but not today. The CCP really doesn’t like it. They don’t like Tencent buying up smaller companies within an industry, merging them together, and creating a monopoly. These days it seems like there is an article every day about how the Chinese government is really starting to crack down on Tencent and Alibaba. The Huya Douyu deal is at the center of all of that China stock FUD, and there is a real good chance that this merger gets blocked outright within the next month or two.\n\nThis is bad for Huya? \n\nNot really. Whatever happens, it’s good for Huya share price. Right now Huya is one of the most shorted stocks in the market. There are a large number of shorts looking to take advantage of the price difference between Huya and Douyu shares, Arbitrage shorts. They will have to cover either way once the merger decision is reached, leaving Huya to run higher once the merger FUD is over. Over time, Huya will rise to reflect the strong fundaments and growth of the company. \n\nThis stock should be 5x the price it is today at a bare minimum.\n\nIf you have a bear case, please share.", "id": "ncotuc", "created_utc": 1621045407.0, "score": 3, "upvote_ratio": 0.54, "num_comments": 29, "comments": [{"body": "Another recent ipo backed by ten net was waterdrop which ipo d a few weeks ago. China stocks are not the current outlook atm", "score": 2, "replies": []}, {"body": "The future of streaming in China is questionable. Even without considering government intervention, the future outlook of the industry isn’t bright.", "score": 2, "replies": [{"body": "Can you explain? How is that possible?", "score": 1, "replies": [{"body": "You could google it. Huya and Doyu were already cannibalizing each other’s market share. Doyu merger talks have been delayed over and over with threat of failing. \n\nThere’s even more news. If you can read Chinese, do a search query on Baidu and even more negative news comes out.", "score": 1, "replies": [{"body": "Cannibalizing each others market share and yet growing earnings 89% a year and growing revenues 30%? The merger succeeding or failing is bullish for huya either way imo. Game streaming TAM is expected to grow at a cagr of 35% a year over the next 5 years from reports I have seen, with Huya as the clear leader. Baidu is not involved in the industry.", "score": 1, "replies": [{"body": "Never said Baidu was in the industry, I said use Baidu aka China Google to google. If you believe in Huya, great. I believed in Huya for a time but I’m off that wagon. I might trade it for quick profit but I am not optimistic about it.", "score": 1, "replies": [{"body": "Ah i see what you are saying. I can’t read Chinese, but I can read livestream fails here on reddit and get some pretty negative things said about Twitch regularly. Twitch keeps chugging along as the clear leader despite competition on all sides from microsoft and google.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Chinese company: added risk. \nPlenty of US stocks to chose but unlikely fraud of government interference.", "score": 2, "replies": []}, {"body": "Corsair is currently at a 17 pe ratio", "score": 2, "replies": [{"body": "I own Corsair, very undervalued. I still think Huya is more undervalued considering they have $1.6b in cash, no debt, they may have a potential monopoly in the coming months in a hyper growth industry, they are growing earnings at a blistering 89%, and they are guiding for double the revenue growth % that Corsair is guiding.", "score": 4, "replies": []}]}, {"body": "Has anyone here actually downloaded Huya app and see the viewership?  It’s fucking insane.  I was watching live stream of some League tournament and it had 15 million people watching on just one channel.", "score": 2, "replies": []}, {"body": "love them. people on here who got burned by their fall will be bitter and disagree but I love the space they're in and their growth. I loaded up on them today. \n\nI feel like there should be a sub to discuss chinese stocks exclusively, or chinese + japanese + southeast asian stocks.", "score": 3, "replies": [{"body": "I agree, the only place that talks about Chinese stocks that aren’t the big three is Stocktwits and I hate that place lol.", "score": 1, "replies": []}]}, {"body": "Happily dumped this tanking garbage.", "score": 2, "replies": []}, {"body": "No dividends and no voting rights. Why do you want to own them?", "score": -2, "replies": [{"body": "Why do you doubt a dividend in the future? They are giving a special dividend if the douyu deal concludes successfully.", "score": 1, "replies": [{"body": "Honestly, don’t listen to people on here when it comes to Chinese stocks. This dudes favorite stock is probably Amazon or some other American tech company that doesn’t pay a dividend. But suddenly a dividend needs to be paid from a Chinese growth stock to be a worthwhile investment lol. \n\nPersonally I’ve been eyeing Huya because of their growth numbers and balance sheet, unfortunately the cash I delegate to Chinese shares is already tied up in other battered stocks. But I’ll definitely look to move profits over to huya if my companies move up before huya does.", "score": 4, "replies": []}]}]}, {"body": "At a PE of 28 it is definitely not cheap. More like extremely expensive for a company like this that can go bankrupt in two years.", "score": 0, "replies": [{"body": "28 pe with 30% yearly growth is EXTREMELY cheap.  It has a 14 forward pe as well.\n\nAnd bankrupt??? Lol, they have 10 billion in cash, 0 debt, and are backed by tencent.", "score": 5, "replies": [{"body": "In 1993 (28 years ago) the best games were X-wing, Day of the tentacle, Mortal combat 2, the arcade version, Syndicate and Doom. Most likely you never heard of them. This industry experiences dramatic changes in a few years to the point where whole genres of games rise in popularity and then vanish into obscurity, whole methods ofplay emerge and vanish. For instance have you been to a LAN party lately? Well it was all the rage when Doom 2 was popular, we played a lot in some kids basement by physically transporting our conputers there and connecting them with a cable. Nowadays this seems ridicolously arcane, like playing chess through a telegram.\n\n In this market betting on that a now popular company with a lucrative business model will exist in twelve years is extremely shaky and probably impossible to say what a now prospering business will earn in 27 years is impossible. \n\nRemember Interplay for instance? They were hot as hell in the late nineties, yet stock price fell to 1% of what it was worth when Fallout, Baldurs Gate and Planescape Torment were released. It was just 22 years ago, not even 28 and that whole gaming style went out of fashion.", "score": 0, "replies": [{"body": "What are you on about, you are talking specific games, this is a whole streaming platform we are talking about. \n\nIt’s like saying twitch will be worthless because GTA won’t be played anymore. No, people will just watch other games??\n\nHuya has a shit ton of money and has a huge platform to work with, they should be fine", "score": 5, "replies": [{"body": "No, I am talking about whole companies and whole technologies. In the nineties LAN parties were the technology to play esports, which were not called like this back then. I highly doubt that streaming will be the technology which will be used even in 2121.\n\nIn this industry a PE of 28 is insanely high, simply because the rapid turnover of the underlying technology.\n\nAnd yes, twitch was founded in 2011. Whole ten years ago. I would not bet my money on it still being in business in 28 years.", "score": 1, "replies": [{"body": "2121 is a whole ass 100 years from now my guy. The nineties are 30 years ago. If you are looking at a timeframe of 100 years you might as well not buy anything because everything will have changed in 100 years", "score": 2, "replies": []}]}]}, {"body": "They are backed by the largest company in China, they have an insane moat where they get exclusive streaming rights to the most popular games in China, and game streaming is here to stay for the long term. It’s already like a sport over there, they compete in massive tourneys in giant stadiums in front of hundreds of millions of people watching live through HUYA.", "score": 3, "replies": [{"body": "Do not feel threatened by me, you can bet all your savings on this company for all I care. I just wanted to add that computer gaming is the fastest changing industry on Earth. In this environment I highly doubt that you can project the current status quo into the far future. At least not more than the success of Day of the tentacle heralded todays insane popularity of adventure games (yes, this was meant as sarcastic).", "score": 1, "replies": []}]}]}]}]}, {"body": "Hey OP did you only buy calls or did you buy shares as well?", "score": 1, "replies": [{"body": "I bought LEAPs $20 01/23c", "score": 1, "replies": []}]}]}
{"title": "How to short the market", "selftext": "I’m curious, if the chicken littles of the world, and I’m one of them, are correct and the market experiences a significant correction, Is there a  spread or long term option to buy or sell to realize gains in an impending  bear market?", "id": "ndbsrw", "created_utc": 1621122798.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 21, "comments": [{"body": "If you have to ask this question then you are probably not equipped to have a thesis on the market direction. \n\nJust my two cents.\n\nEdit: I'm sure someone here will gladly sell you spy puts.  Which is what you'd 'want' to buy", "score": 41, "replies": [{"body": "those worked out quite well for me last week", "score": 2, "replies": [{"body": "Which, the selling or the buying? \nThe buying woulda been niceeee. Till Friday that is.", "score": 2, "replies": [{"body": "I sold spx puts on Tuesday and Wednesday (weeklies and longer dated) last week.   IV spiked so hard on Tuesday and Wednesday that buying also didn't work out for most unless you bought on Monday and cashed out wednesday.", "score": 2, "replies": []}, {"body": "Bought when SPY was $419, sold when it was $405.", "score": 1, "replies": []}]}]}]}, {"body": "I know this is theta gang and what I do is like 2nd grade level stuff but honestly when I feel like we’re topping out I grab some SQQQ and out of sheer chance I actually didn’t lose all my money", "score": 5, "replies": [{"body": "I buy calls on this to hedge… 2022 calls, just in case :)", "score": 3, "replies": []}]}, {"body": "You can buy puts on $SPY", "score": 8, "replies": [{"body": "tie meeting butter sip tease license humorous include murky person\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 7, "replies": []}]}, {"body": "Got your tits all jacked after watching The Big Short or something?", "score": 7, "replies": []}, {"body": "Puts on spy, calls on vix, buy uvxy shares, buy sqqq shares. The list goes on", "score": 6, "replies": []}, {"body": "The big gainer “covid”  tech stocks have all started a downtrend. NDX bear incoming, stay safe. I’m expecting a slow steady decline through year end. Puts and short calls for me. I also bought $25k of spy puts last week. Spy will follow", "score": 3, "replies": []}, {"body": "Buy puts on SPY...", "score": 2, "replies": []}, {"body": "As an alternative buy calls on vix", "score": 2, "replies": [{"body": "Use the bull spread on vix as you'd use on spy", "score": 1, "replies": [{"body": "Or if feeling ballsy puts on spy and calls on vix", "score": 2, "replies": []}]}]}, {"body": "Sell calls or call spreads.  Buy puts or put spreads.  Sell covered puts (short stock, sell a put).", "score": 1, "replies": []}, {"body": "ITM put LEAPS / PMCP", "score": 1, "replies": []}, {"body": "Sell a call, sell a call spread, sell SPY stock directly (that you don't own, so borrowing then selling), sell a futures contract /ES or /MES (also that you don't own)", "score": 1, "replies": []}, {"body": "I'm in agreement that a downtrend is imminent. I've shifted a lot of my positions to index etf's and hedging 4:1 with inverse etf's, holding oil as an inflationary hedge and any bullish plays have been credit spreads 30dte on QQQ and SPY. I recommend just using call credit spreads on index etf's if you have a bearish sentiment because stocks usually \"melt\" upwards and when they go down they go down hard. It's a lot easier to be right in terms of \"I don't think SPY will gain 5% this month\" Instead of constantly trying to time the top and or bottom.", "score": 1, "replies": []}, {"body": "Sell call spreads, buy put spreads, short the stock outright, buy puts, do calendar spreads on a lower strike.\n\nYou also have ETF's which mimic a short position in SPY, or 2x or even 3x the short equivalent of SPY (Spy goes down 1%, ETF goes down 3%). You can also trade options on those as well.", "score": 1, "replies": []}]}
{"title": "Broke $8000! After putting $5800 in ETFs and TSLA back in March last year. Not the typical WSB stuff but this sub inspired me to give stocks a shot.", "selftext": "", "id": "ncpb1q", "created_utc": 1621047220.0, "score": 63, "upvote_ratio": 0.79, "num_comments": 27, "comments": [{"body": "Come, child, and take my hand and try out some options. First ones always free 😉", "score": 18, "replies": [{"body": "😂😂😂", "score": 1, "replies": []}]}, {"body": "Why isn’t this red like mine? Is there something wrong with yours?", "score": 25, "replies": []}, {"body": "Wrong sub, but congratz! Now go to r/investing", "score": 37, "replies": []}, {"body": "This sub has one speed. Fast. Now, get the fuck out and go buy a bond, or something.", "score": 8, "replies": []}, {"body": "Look at Mr. Smartypants actually making money on stonks instead of throwing all his reitrement money at Gamestop calls.", "score": 14, "replies": [{"body": "This is the way?", "score": 1, "replies": []}]}, {"body": "Great work. Working that slow and steady long term. Nothing wrong with that.", "score": 5, "replies": []}, {"body": "So your wall street bet was to bet on Wall Street. Gratz retard. Lever the fuck up and come back when your life is in shambles", "score": 4, "replies": []}, {"body": "am i missing something? Didn't SPY return like 52% over the last 12 months? How dis guy only 18%?", "score": 7, "replies": [{"body": "Cause I'm a scared little bitch boy who only buys slow stuff apparently", "score": 2, "replies": []}]}, {"body": "My 98 year old grandma had a bigger return% last year", "score": 6, "replies": []}, {"body": "Which etfs if you don't mind me asking.  High yield or high divs?", "score": 3, "replies": [{"body": "High divs, and lots of oil", "score": 1, "replies": []}]}, {"body": "Only porn here I guess. \n\nStop making garage porn and do something memorable.", "score": 3, "replies": []}, {"body": "While I do support this.... In order to belong and stay here I'm going to need you to buy at least one FD or else go to r/investing", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I hear ya, been in since January and other than my dividends which are fantastic (10.4% per quarter right now) I'm up and down hundreds weekly with today finally getting me 11 cents up overall...", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I’m learning the hard way too; this is a casino", "score": 2, "replies": []}]}]}]}, {"body": "🥱😴", "score": 1, "replies": []}, {"body": "You must have been in the all time most shitty  ETF’s to ever exist if you bought March of last year and only went from 5800-8000.  You woulda been at like 50k if you just put your 5800 in TSLA alone.", "score": 1, "replies": [{"body": "I'm well aware, but it's my first year trading and I didn't lose any money besides $500 on GME (that I'm still holding) so I'm considering it an overall win.", "score": 1, "replies": []}]}, {"body": "Enjoy your tendies", "score": 1, "replies": []}, {"body": "hey maybe try out some call debit spreads you don’t neeeed to jump into calls, get out and get those jewish toes wet. though it could turn into an outrageous paper chasing fear of missing out buying peaks selling lows full blown gambling addiction who’s to really say, but who cares anyways that’s what wsb is about.", "score": 1, "replies": []}]}
{"title": "Standardized Options by CBOE: the next evolution in trading available today!", "selftext": "\"These shares just aren't cutting it! My account value barely moves, at most a few measly percent a day. It's been years and I'm barely keeping up with inflation!\"\n\nNow there's another way. Hi, I'm u/Flying_Madman, here to offer you financial advice. Introducing standardized options by CBOE, your go-to source for derivatives trading instruments. For years options trading was limited to market makers and large institutions but now you too can swing with the big boys!\n\nAt the CBOE we believe that you, the retail trader, should be empowered to make irresponsible financial decisions and blow up your account just like the professionals. With their wide array of strikes, expiries, and underlying securities, there are options to fit any trader's financial goals and personal risk tolerance. \n\nStandardized options are highly leveraged derivative instruments that amplify your buying power to never before seen levels. Going all in on just three 0 DTE SPY calls a week have been mathematically proven to make you a millionaire in less than one year\\*.\n\nWhat are you waiting for? Ask your financial advisor if standardized options trading is right for you today, then disregard their dumb advice and do it anyway!\n\n&#x200B;\n\n^(\\*These statements have not been evaluated by the SEC. Standardized options are not intended to diagnose, treat, or cure any medically recognized illness. Trade standardized options at your own risk. CBOE and WSB are not liable for any losses incurred while trading standardized options. Side effects may include headaches, heart palpitations, dizziness, nausea, uncontrollable giddiness, insanity, and a desire to long ROPE. Consult your physician if you experience profits for three or more consecutive trading sessions while using standardized options as this may be a sign of a serious dissociative disorder. Don't trade standardized options if you have a heart condition or are a risk adverse pansy. Having trouble affording trading fees? Your broker may be able to help.)", "id": "nd7a89", "created_utc": 1621109106.0, "score": 55, "upvote_ratio": 0.72, "num_comments": 25, "comments": [{"body": "[deleted]", "score": 31, "replies": [{"body": "QQQ? Wow you must not have any balls whatsoever. Try TQQQ, make sure you use some margin as well.", "score": 21, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I added to your joke?", "score": 10, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "+1. Its fairly recent though, I believe", "score": 3, "replies": []}]}]}, {"body": "Ironic.", "score": 2, "replies": []}]}]}]}, {"body": "I am a bot from /r/wallstreetbets. News should be a screenshot or link to a news story, can't be a selfpost.", "score": 13, "replies": [{"body": "Happy Cake Day, VisualMod!", "score": 14, "replies": []}]}, {"body": "Never have to worry about theta gang if you only roll 0dte contracts.\n\n🙂👈", "score": 12, "replies": []}, {"body": "Mmm I’m usually skeptical believing a madman, but since you can levitate, all in on 0dte calls, can’t go tits up 🚀", "score": 8, "replies": []}, {"body": "Can't go Tits up!", "score": 7, "replies": [{"body": "Better not tell you now", "score": 4, "replies": []}]}, {"body": "why not at this point", "score": 5, "replies": [{"body": "What's the worst that could happen?", "score": 6, "replies": []}]}, {"body": "So what's new? Aren't we doing this already on every Mon, Wed, and Fri?", "score": 4, "replies": [{"body": "There seem to be some who remain unaware, surely they just need to see the promotional materials", "score": 4, "replies": []}]}, {"body": "First ones free 😉", "score": 4, "replies": []}, {"body": "yup, all in", "score": 3, "replies": []}, {"body": "Secret account of celebrity Tom McClure.", "score": 3, "replies": []}, {"body": "Risk averse like 'aversion' not adverse.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Hey that’s an OTC ticker - don’t talk about that here. Review the rules first.", "score": 2, "replies": []}, {"body": "But it's OTC, tho[&#xFEFF;][asdf]\n\n[asdf]: /u/FannyPackPhantom", "score": 2, "replies": []}]}]}
