{"title": "Sometimes it (always) pays to be an autist", "selftext": "So I've been holding Apple 155 calls for all of this last week. They were slowly bleeding out my account. Thinking I should cut my losses I went to sell my contracts yesterday mid-day as Apple sank below 152. Instead, my dumb ass bought more contracts by complete accident. When you click on the option in RH the tab to buy or sell auto defaults to buy. Through full scale autism I doubled the amount of Apple 155 calls I was holding, all destined to expire worthless the next day, Jan 25. Realizing my mistake, I decided to keep holding until the next day (date of expiry), otherwise I'd become a pattern day trader. *Sigh* This morning I awoke with the satisfaction of seeing that beautiful green color that nobody here on WSB has had the privilege of seeing. With the help of my MU 36 calls that were just around break even until that morning, I ascended. Embrace your inner auteeeast, and never give up on the powers of the spectrum. My scarred brain tissue saved me in my darkest hour, profiting >1200% on the shittiest tech company of our day. Praise Lord 1R0NYMAN.", "id": "ajwo75", "created_utc": 1548469185.0, "score": 749, "upvote_ratio": 0.97, "num_comments": 60, "comments": [{"body": "Autists make the best traders. This is one of the best examples ", "score": 344, "replies": [{"body": "Looks like we have quite the savant over here", "score": 64, "replies": [{"body": "Autist savant.", "score": 11, "replies": []}]}, {"body": "The guy in the big short was portrayed as pretty autistic.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "LOL I don't think you can be normal and trade options.", "score": 1, "replies": []}]}, {"body": "How much you make", "score": 100, "replies": [{"body": "$27", "score": 262, "replies": [{"body": "that's about $127 more than i make on any given day, nice", "score": 123, "replies": []}]}, {"body": "About three fiddy", "score": 27, "replies": []}, {"body": "Three money and no kids ", "score": 7, "replies": []}]}, {"body": "moral of the story. inverse yourself.", "score": 74, "replies": []}, {"body": "Hell yeah dude! Use profits to wheel in more profits via risk free box spreads ", "score": 144, "replies": [{"body": "It literally cannot go tits up! ", "score": 27, "replies": []}, {"body": "[deleted]", "score": 21, "replies": []}]}, {"body": "Congrats on rolling the floating tits up corpse into a full tits down situation.\n\nThe tits do not always tell the full story \n\nPraise lord 1RONYMAN, May his trading days long and his positions longer ", "score": 65, "replies": [{"body": "Retarded squirrels sometimes find a nut. I was bag holding SPY 264 FD calls. I bought them for 1.15. End of day Thursday they were worth .31. Sold them about 10am Friday for 2.50.", "score": 11, "replies": [{"body": "I did something similar with some qqq puts. Lol", "score": 6, "replies": [{"body": "Same", "score": 1, "replies": []}]}]}]}, {"body": "Can someone explain how money was made?", "score": 28, "replies": [{"body": "Central bank print it!!", "score": 87, "replies": [{"body": "after the money was loaned out by a private bank, led by lizard people", "score": 12, "replies": []}, {"body": "REEEE the treasury operates the mint REEEEE", "score": 19, "replies": []}, {"body": "Truth, but I meant in this transaction ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 29, "replies": [{"body": "So, how did he make a 1200% profit? ", "score": 11, "replies": [{"body": "When I doubled down on my Apple 155 calls the option was worth 45 cents. My initial buy on Jan 18 the contracts were worth $3.40. Sold both at $2.40 today (day of expiry). I guess the gains from the contract 45 cents to $2.40 outweighed losses from initial contracts purchased for 3.40.", "score": 36, "replies": []}, {"body": "Also, the 1200% figure was on the day. Unfortunately I do have more than one brain cell maybe someday I will be able to achieve maximum autisticity.", "score": 18, "replies": [{"body": "Thank you both for clarifying! ", "score": 5, "replies": [{"body": "It's the same op retard", "score": 26, "replies": [{"body": "Holy fuck this killed me", "score": 9, "replies": []}]}]}]}, {"body": "He bought options, not stock", "score": 5, "replies": [{"body": "Lol yup (no ill intent meant, I’m just in wholeheartedly full agreement)", "score": 1, "replies": []}]}, {"body": "The price of the contract went ffrom 0.02 on Jan 24 to 2.7 on close today. ", "score": 3, "replies": []}]}, {"body": "Thanks... you save my time ", "score": 2, "replies": []}]}]}, {"body": "You’ll just lose it all on the next trade anyways ", "score": 9, "replies": []}, {"body": "Imagine you could purchase an inverse, triple leveraged ETF based on your life. You literally can not go tits up no matter what you do.", "score": 14, "replies": [{"body": "Have you been drinking", "score": 12, "replies": [{"body": "I drink before I trade and yes", "score": 16, "replies": []}, {"body": "This stuff has to be much more powerful than alcohol", "score": 2, "replies": []}]}]}, {"body": "Cheers boyo! Looks like drinks are on you this weekend.", "score": 7, "replies": []}, {"body": "Dude. I thought it was just me who has accidentally bought options instead of selling on that ridiculous robinhood website design. Nicely done.", "score": 6, "replies": []}, {"body": "Next time you trade, wear a blindfold.", "score": 5, "replies": [{"body": "bird box style", "score": 3, "replies": []}]}, {"body": "This is hilarious. You accidentally *averaged down* and *doubled down* on your calls and made bank. Congrats! At least tell us how much you made with a screen shot, you autistic plebe. ", "score": 5, "replies": []}, {"body": "I did the exact same thing, but different.", "score": 4, "replies": []}, {"body": "Pics or it didn’t happen", "score": 3, "replies": [{"body": "https://imgur.com/a/H1rjRZf\n\nInitial 155 call buy was Jan 18 (not shown here). Emphasis of post was more oriented toward antivax and autism not about gains or profit.", "score": 3, "replies": [{"body": "Why you not post that then. reads like some fucking wsb fanfic m8 LMAO like wtf :D", "score": 0, "replies": [{"body": "Yikes, get a life.", "score": 1, "replies": []}]}]}]}, {"body": "You just told me your best greatest trade happened to be an accident. How's this gonna make me want to trade?", "score": 25, "replies": [{"body": "You must be new around here", "score": 143, "replies": []}, {"body": "No one gives a fuck if you trade or not bozo", "score": 51, "replies": []}, {"body": "This is a Warren Buffett approved method of trading. On Wall Street it's called IAM the Inner Autist Method. Basically you just think what a rational sane individual would do and do Yolo the exact opposite for easy gains", "score": 17, "replies": []}, {"body": "according to your mom, you were an accident. it's time to embrace your destiny", "score": 18, "replies": []}, {"body": "Do you know where you are?", "score": 5, "replies": []}]}, {"body": "I also had submitted a sell order on the MU 36 call I referenced at 3:59pm Jan 24 for 87 cents which eventually got canceled. Sold the next day for $2.10. This is all to say that instincts are insanely bad, but my execution is autistic.", "score": 2, "replies": []}, {"body": "Pics as proof or ban this mf", "score": 2, "replies": []}, {"body": "proof or ban", "score": 2, "replies": []}, {"body": "Pic or banned ", "score": 2, "replies": []}, {"body": "Reddit is love.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Do you know where you are?", "score": 5, "replies": []}]}]}
{"title": "Big money is going to dump AMD in the last minute/in the after hours the day of their earnings", "selftext": "Big money is planning on completely selling off their AMD shares in the last minute of the day before AMD earnings. It's happened more than once now. \n\nI actually love AMD. I prefer their products over Intel/Nvidia but their stock has been telegraphed to be something big money abuses.\n\nhttps://imgur.com/a/8nHJNyw\n\nIn this album there's 3 images. One (AMD 1) shows AMD's run up before CES 2019 and the immediate sell-off once the AMD keynote started. Picture two (AMD 2) shows AMD's current run up. It's hitting all time highs and most of tech is getting pulled up with the exception of Intel. I see AMD hovering between 21-22 before the big money sell-off.\n\nIn image 3, I show you an example of them doing this very recently with Intels recent earnings report. Big money did a gigantic sell-off on Intel before their earnings report. This would have happened no matter what they reported. I do think Intel would have made a small bounce back if they guided higher for the next quarter, but they issued fairly weak guidance.\n\nSo basically, if you're in AMD, you're pretty much as good as you'll get. Sell now.\n\nIf not, all in AMD puts while they're on the cheaper side", "id": "ak3ekp", "created_utc": 1548526760.0, "score": 47, "upvote_ratio": 0.77, "num_comments": 65, "comments": [{"body": "Usually stocks that run-up prior to earnings tend to selloff", "score": 44, "replies": [{"body": "Sometimes, but not always. AMD is like big moneys toy though and these run-ups are always followed by massive sell offs. \"Buy the rumor, sell the news\" type events", "score": 13, "replies": [{"body": "Buy on the dip?", "score": 2, "replies": []}, {"body": ">these run-ups are always followed by massive sell offs.\n\nGreat for swing trading? What indicators do you use to identify it has bottomed out?", "score": 1, "replies": []}]}, {"body": "My assumption has always been the common insight of this was that people tend to close their positions after the event their investing in takes place.\n\nFeel free to aware me on the autism in my logic.", "score": 3, "replies": []}]}, {"body": "Thank you. I will do the opposite of this.", "score": 34, "replies": [{"body": "Basically try to catch the knife at open and pick up amd shares for like $16 per? ", "score": 7, "replies": []}]}, {"body": "all time highs? where were you in September? ", "score": 16, "replies": [{"body": "In wsb, recessions last for hours and ATH's are measured from last week.", "score": 31, "replies": []}]}, {"body": "I‘ve got bear spreads on AMD. The fact that wsb advocates bearish positions too makes me feel S T R E S S E D.", "score": 14, "replies": []}, {"body": "What caught my eye about AMD was the last 5 minutes of AH trading from 755PM-8PM on Friday. Someone drove the price up 2% on just 30k shares.\n\nWhy would you want to do that in last 5 minutes of trading unless you were trying to push it up past some resistance level to pump the stock, hope algos pin to that price and dump on Monday at same price.\n\n\ntl:dr --- my conspiracy brain thinks someone knows results of Q4 and they are bad or FG is bad.", "score": 24, "replies": [{"body": "All of this sub is high on AMD which is enough reason to go all for Puts.", "score": 11, "replies": [{"body": "Except that they actually have a lot of potential with their Zen 2 architecture, especially on the datacenter market. If they can absorb some of Intels marketshare, which seems very likely to happen within the next few years, then I understand why many go long on AMD. \n\nHowever longterm investments arent really preferred by people who buy $90 MU calls", "score": 4, "replies": [{"body": ">  If they can absorb some of Intels marketshare\n\nHow could AMD ever hope to do this? All AMD has is 64 cores per chip and in a dual socket configuration 128 cores and 256 threads with a lower TCO and lower power consumption than Intel.\n\nIntel is sure to have a 128 core, uh, 64 core, uh, 32... oh boy.", "score": 2, "replies": [{"body": "Yup and this will especially make sense for completely new datacenters where you can effectively get twice the compute capacity at half the power and physical storage/volume. Either denser datacenters or more powerful ones. \n\nI'm stoked for Epyc", "score": 2, "replies": [{"body": "The disconnect between the market and the forward PE on AMD is just shocking. They'll figure it out someday.", "score": 2, "replies": []}]}]}]}, {"body": "I actually have both bearish and bullish positions on AMD. ", "score": 1, "replies": []}]}]}, {"body": "I love AMD as a stock , I come to terms with it's up and down. ER became such a gamble I rather ride the run up and cash out right before ER .\n\n&#x200B;", "score": 7, "replies": []}, {"body": "I have all in on AMD stock. My future is suicide or suicide", "score": 6, "replies": []}, {"body": "Not to mention holding through ER is risky as hell anyway.", "score": 5, "replies": [{"body": "Absolutely, but a lot of people I see are holding through earnings lately. BAC/SYF/etc all ran up quite a bit after favorable earnings/guidance and people who held made a bunch, but there's a definite risk/reward. But with AMD I'm absolutely certain the stock will tank and even with favorable numbers/guidance, not be able to reach the current highs", "score": 2, "replies": [{"body": "I'm sure the numbers aren't going to be that bad but enough to drop it down , I can't see this dropping to 17 . I see them being more around 19 after ER , after seeing what happened to the numbers on Weds of the CES show was pretty obvious . ", "score": 2, "replies": []}]}]}, {"body": "\\>making financial decisions based on 2 (two) datapoints", "score": 5, "replies": [{"body": "Yeah that's pretty good for wsb dart board analysis standard", "score": 4, "replies": []}]}, {"body": "So what you’re telling me is to set really low but limits for day before earnings and see if they fill minutes before close ", "score": 4, "replies": []}, {"body": "I sold all AMD shares on Friday near closing time and waiting for 1st or maybe even 2nd quarter results to buy back in. \nAt this point i believe AMD doesn't have much hype and momentum left. Their Epic sales will kick in at least 1 year ahead with adoption announcements and hype at least in 6 months. Old gen CPUs are being slowly overshadowed by Intel and the new Vega will lose almost half of the 1st quarter sales due to being released on Feb 7.  \nNot to say 1st Quarter won't be great, just not as good in my opinion as it should be for a strong and steady stock uptrend. ", "score": 4, "replies": []}, {"body": "Is this insider information?", "score": 6, "replies": [{"body": "No it's free money ", "score": 37, "replies": [{"body": "*risk-free money*", "score": 15, "replies": []}]}, {"body": "I have Ryzen inside my computer does that count?", "score": 38, "replies": [{"body": "just got a ryzen PC.  Intel too pricey for performance... ", "score": 7, "replies": [{"body": "You don't want a quality Intel flagship i9-9900 processor that ties or slightly loses to AMD's $170 8 core low-end?\n\nSorry, maybe it is the $219 version.", "score": 10, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "https://www.youtube.com/watch?v=CX-xPst-3FI\n\nThe leaked prices I saw were $179 and $219 iirc. And AMD is just throwing 8 cores and they're capable of 16+ on that package, and we know they can go up to 64 on a different socket.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I bought two 21.50 puts right before close. I also sold a 22.50 and 24 calls as Cover Calls. Average cost of my shares being 19.80", "score": 3, "replies": []}, {"body": "Why is the EPS estimate so low? The street appears to be expecting numbers from a year ago and with Intels miss, wouldn't it be logical to assume that AMD took share and should easily beat?", "score": 3, "replies": [{"body": "AMD gave low guidance last quarter. Su's very, very conservative in her management. She's going for long term marketshare and growth.", "score": 1, "replies": []}, {"body": "Just think about the inputs/outputs. All we know is AMD guidance and INTC's miss. Was INTC's miss because they lost market share, or is the industry in a downturn? It's hypothetically possible for INTC to have gained market share over AMD but the industry sucks. Or AMD gained market share, but their price run-up the past few weeks didn't warrant it.\n\nI don't know which way it will go, but right now I'm super skeptical of anything \"obvious.\"", "score": 1, "replies": []}]}, {"body": "I'm going to do what I do every month and sell covered calls on this stock,  because I have no fucking clue what will happen next.  Especially before earnings,  that premium is gonna be sexy", "score": 2, "replies": []}, {"body": "Well, this didn't aged well.", "score": 2, "replies": [{"body": "tbf nvidia kinda messed it all up. But if you had a straddle like I said and just reversed what I told you to do, ezpz money", "score": 1, "replies": []}]}, {"body": "What day is their earning post", "score": 1, "replies": [{"body": "Tuesday after hours", "score": 1, "replies": []}]}, {"body": "You don't know shit ", "score": 1, "replies": [{"body": "YoU DoN'T KnOw sHiT \n \n--- \n \n^(I'm a bot! PM me if you want a subreddit included on the whitelist) ^&#8226; ^[FAQ](https://np.reddit.com/ah6jjn/) ^&#8226; [^(Click here to be added to the blacklist)](https://www.reddit.com/message/compose/?to=mockingbot&subject=Blacklist&message=I%27m%20triggered) ^v0.2.1", "score": 8, "replies": []}]}, {"body": "You prob should have used a throwaway/diff account lol\n\n-\nAlso. AMD is an obvious short. If they do well there is alway dilution. It is way overbought. Plus semis are down for the rest of 2019. ", "score": -9, "replies": [{"body": "Why?", "score": 11, "replies": [{"body": "Bc /WSB ", "score": -3, "replies": []}]}, {"body": "Tell that to my semi puts that got obliterated last week. ", "score": 5, "replies": [{"body": "Wrong timing buddy", "score": -1, "replies": [{"body": "I timed it right the last 6 months. ¯\\\\\\_(ツ)_/¯      \n       \nAlso, if you're right and semis will be down thru 2019, I should just let my puts roll. They don't expire for a while. Cheers. ", "score": -2, "replies": [{"body": "Last 6 do not mean future 6?", "score": -4, "replies": [{"body": "LaSt SiX dOn'T mEaN FuTuRE SiX!!!    \n      \nThe last 6 months of semis was down big. You just said the next 6 will be down.     \n     \nDo you even read the things you type? ", "score": 4, "replies": [{"body": "Yes. But since you need help let me rephrase. There is no correlation between the two. Stop trying to think in a cyclical way. \n\n-\nPs. Fuck off", "score": -2, "replies": [{"body": "You're an idiot. I'm not correlating anything. I'm staying that 1) semi went down the last 6 months, and 2) you said it would be down thru 2019.  Those are independent, ya twat.     \n     \nP.s. (<--are you fucking 12?), you're downvotes are as impotent as your boyfriend is limp. Pathetic. ", "score": 1, "replies": [{"body": "You are arguing over something you misunderstood on a weekend.\n\n\n-\nI just browsed your post history 😂😂😂😂 pretty sure you are the 12 year old here kiddo", "score": 0, "replies": [{"body": "You are arguing over something you misunderstood on a weekend cuz u dum dum.\n\nI had already browsed your post history 😂😂😂😂 which is how you knew you were an idiot. Also, had you actually browsed my history, it's pretty obvious that I'm old, kiddo. ", "score": 2, "replies": [{"body": "AlSo, HaD YoU AcTuAlLy bRoWsEd mY HiStOrY, iT'S PrEtTy oBvIoUs tHaT I'M OlD, kIdDo. \n \n--- \n \n^(I'm a bot! PM me if you want a subreddit included on the whitelist) ^&#8226; ^[FAQ](https://np.reddit.com/ah6jjn/) ^&#8226; [^(Click here to be added to the blacklist)](https://www.reddit.com/message/compose/?to=mockingbot&subject=Blacklist&message=I%27m%20triggered) ^v0.2.1", "score": 1, "replies": []}, {"body": "https://nvidianews.nvidia.com/news/nvidia-updates-financial-guidance-for-fourth-quarter-of-fiscal-year-2019", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "> Plus semis are down for the rest of 2019\n\nWhy would this be? Semi did really well last week and much of Jan.", "score": 1, "replies": [{"body": "https://nvidianews.nvidia.com/news/nvidia-updates-financial-guidance-for-fourth-quarter-of-fiscal-year-2019", "score": 1, "replies": []}]}]}]}
