{"title": "$SUNE will explode on monday", "selftext": "[deleted]", "id": "4bz0kz", "created_utc": 1458949690.0, "score": 16, "upvote_ratio": 0.86, "num_comments": 72, "comments": [{"body": "Remind me on Monday.  I don't fuck with bots, so OP, I want you to personally remind me.", "score": 51, "replies": [{"body": "I'll remind you if you give me your number for dat bootycall", "score": 4, "replies": [{"body": "(646) 217-2783 ", "score": 2, "replies": [{"body": "RISE AND SHINE YA FILTHY ANIMALS", "score": 2, "replies": []}]}]}, {"body": "I'm here to remind you! OP was right, $SUNE exploded. ;)", "score": 3, "replies": []}, {"body": "So did everything go like thought?", "score": 1, "replies": []}]}, {"body": "my brain says no but my heart says yes", "score": 18, "replies": [{"body": "https://www.youtube.com/watch?v=OtVyEZymUFo", "score": 3, "replies": []}]}, {"body": "I mean, you were right about solar city. But this is hella risky. ", "score": 6, "replies": [{"body": "I was right about AMD too.", "score": 3, "replies": [{"body": "This feels like a whoooole different story. Isn't there just as much chance that the stock is about to TANK?", "score": 4, "replies": [{"body": "The blackout is very good for investors IMO.\n\nhttp://charts.stocktwits.com/production/original_51773067.png?1458955669", "score": 2, "replies": [{"body": "The blackout has absolutely zero bearings on their shitshow of financials. Idk why you're so focused on insider activity restrictions.", "score": 4, "replies": []}, {"body": "what position do you have? ", "score": 3, "replies": []}, {"body": "Did you read the actual 8-K?  Specifically the part in italics where they emphasize \"*Participants will continue to be able to transfer amounts out of the Stock Fund to another investment option.*?\"", "score": 2, "replies": []}]}]}, {"body": "Oh look at this guy thinking he got some kind of winning streak... ", "score": -2, "replies": []}]}]}, {"body": "> There's a blackout period imposed for Directors and Executive officers from buying more shares\n\nYeah, THAT'S why they're not buying any more shares.", "score": 9, "replies": [{"body": "To prevent insider trading\n\nhttps://en.wikipedia.org/wiki/Insider_trading", "score": 4, "replies": [{"body": "That wasn't the point of my comment, dude.\n\nhttps://en.wikipedia.org/wiki/Chapter_11,_Title_11,_United_States_Code", "score": 9, "replies": [{"body": "They are require to disclose BK in the 8-k filing yesterday, and guess what?  No BK.", "score": 4, "replies": [{"body": "> They are require to disclose BK in the 8-k filing yesterday, and guess what? No BK.\n\nThis is retarded.  They don't have to disclose that they went bankrupt *because they haven't gone bankrupt yet*.  That will be happening this coming week if I've read my noteholder docs right.", "score": 11, "replies": [{"body": "Keep your sorcery to yourself.", "score": 7, "replies": []}]}, {"body": "Adorable. Try crunching the numbers yourself and see what you get.", "score": 1, "replies": [{"body": "SUNE's 8-K item 5.04 filing explicitly mentions that the blackout period will last until current w/ annual financial filings, strongly indicating that a 10-K will be filed next week.", "score": 3, "replies": [{"body": "Why are you so sure a 10-K will deliver ANY kind of good news?  If they had good news, they wouldn't have flaked twice on delivering it.  If anything, they were buying time for something good to happen, and I'm pretty sure the fact that they're only announcing earnings when their back is seriously, legally against the wall doesn't offer any positive expectations.", "score": 3, "replies": []}, {"body": "That's great, but you still didn't look at the numbers yourself, otherwise you'd see its going to zero very soon. Maybe not next week. Or the week after. But it's on borrowed (HA!) time.\n\nEDIT: Downvoted for saying to run the numbers yourself. Bunch of fucking amateurs. Keep buying MNKD and AMD you tools.", "score": 5, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "- Market cap: $380M\n- Net debt: $7B\n\nSo I guess the entire market is wholly unaware of this marvelous, firm-saving project??\n\nAlso, as others in /r/investing who have personally dealt with SUNE (working in the solar industry), several have repeated the exact same claim that it's impossible to collect from SUNE. Writings on the wall.", "score": 4, "replies": []}]}, {"body": "The correct response to downvoting is \"You all can go fuck yourselves.\"\n", "score": 3, "replies": []}, {"body": "Unless there's a merger or buyout.  Something is brewing with this blackout from insiders trading.", "score": 2, "replies": [{"body": "You gotta be joking me. In what world is SUNE going to merge or be acquired? Didn't their deal with Vivint just fall through?? ", "score": 2, "replies": []}, {"body": "Wow SUNE is sure exploding today lol", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "maybe theyre trying to stop short sales that would be an obvious dump.", "score": 2, "replies": []}]}]}, {"body": "Fuck it. How much lower can it go? (Obviously, $1.20)", "score": 3, "replies": [{"body": "Go look at alpha bank", "score": 1, "replies": []}, {"body": "Still risky but it's looking very promising due to the blackout.", "score": -1, "replies": [{"body": "I'm in 700 shares @1.93. But I have a open covered call position I need to close if this thing skyrockets. ", "score": 3, "replies": [{"body": "New to the concept of covered calls, but how do you close them without screwing yourself?", "score": 1, "replies": [{"body": "Same as any other short position, buy it back. If it goes up like crazy on Mon, I'll pay higher at a loss to get out (buy to close) because my 700 shares would see a higher gain. If Mon, this stock doesn't pop, then I'll let my cov call expire on Apr 1 (Fri). I'll then sit and see if there is any other news for a week or so then continue selling cov calls again. ", "score": 2, "replies": [{"body": "And if someone exercises those calls, why is it that you don't lose anything?", "score": 1, "replies": [{"body": "I write at a strike price I'm willing to let go of the stock. And I keep the premium if they exercise. Right now I'm selling weekly at $1.50 strike. Sure, I lose big on upside if stock goes to the moon but that's the risk. So far I've been able to bring down my SUNE cost basis from $3.86 to $1.93. Like I said, if the stock has indication of exploding then I may just buy back this week's cov call and sit tight to see if they file their 10-k. \n\nNervous to say the least, this thing could go to $0 in a few weeks so I may get out completely and start with another stock. ", "score": 2, "replies": [{"body": "Damn, you brought your cost per share down about halfway by selling your covered calls? So what's to stop you from bringing that cost basis all the way down to 0 with all that premium money? I guess that's way easier said than done right? Cuz if it rallies, you're screwed?", "score": 2, "replies": [{"body": "Mostly covered calls but there was a time when SUNE went to $1.42 before going back to $2.11 where I bought 200 shares. \n\nAs for the future, I'll keep selling and see what happens. Just want to be careful right now because if the stock goes to $0 I'm screwed since I'm still not net positive on the stock. Less screwed if the stock rallies because no matter what the cov call for that week is at, I'll gladly pay to buy it back since my 700 shares would be worth much more with that rally than the loss of buying back my cov call. Since I sell weeklys for this stock, the theta decay is high so each passing day, it costs less to buy it back. ", "score": 2, "replies": [{"body": "You have no idea how good it feels to actually understand all that. Thanks for the patience, good lucky man. Wait no, I mean go fuck yourself?", "score": 3, "replies": [{"body": "Thanks. I lurk here answering questions I'm capable of. Still pretty new to trading options. Good luck to you and your learning process. \n\nGo fuck yourself. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Pay your money, take your chances.  I own puts.\n\n(You understand that the material information they're talking about could be **a forthcoming chapter 11 petition**, right?", "score": 3, "replies": [{"body": "That's what I was thinking, though why would they be worried about employees buying more shares before filing chapter 11?", "score": 2, "replies": [{"body": "For the answer to that, you have to go back to Enron.  \n\nUp until the actual bankruptcy filing, the rank and file employees, who didn't know any better, were still buying ENE in their retirement accounts.  The officers knew what was coming, though, and obviously stopped.\n\nSo when the company went banko, employees got fucked twice: first by many of them losing their jobs, and second by many of them losing huge portions of their retirement accounts.\n\nSarbanes Oxley, which was passed in the aftermath, says among other things that if a company has big news coming up that they enforce a blackout period for the employees' retirement plans.  That big news could be the long-delayed filing of the 10-K, I suppose... but it could be a bankruptcy filing as well.", "score": 2, "replies": [{"body": "That is a very, very good point that I did not consider because I don't have particularly high expectations of corporate leadership looking out for their employees like that.  You may be right.  But the bottom line is that this is definitely not categorical evidence that SUNE is about to take off.", "score": 1, "replies": []}]}]}, {"body": "because they could short sell for 100% profit maybe?", "score": 0, "replies": []}]}, {"body": "I got the email alert at 4:11PM central yesterday, and EDGAR shows the form was accepted at 4:03 central (about an hour after market close). There was no price movement in after hours because of this, so... if it was really that big of a deal why wouldn't it have done something? I'm long a ton of JUL $4 Calls so I would love for this to be a big deal, but the market had a chance to react to this... and it chose to do nothing already. Why would Monday be vastly different?", "score": 3, "replies": [{"body": "This is complete non-news.", "score": 2, "replies": [{"body": "I would love for this stock to go sideways for another 4 weeks. ", "score": 1, "replies": []}]}]}, {"body": "Hope.  It's something no algorithm can emulate.  You got that going for you, which is nice.", "score": 2, "replies": []}, {"body": "lol", "score": 2, "replies": []}, {"body": "This would make sense if someone was planning to buy/merge with $sune company exec's and employees would be barred from acquiring stock at a price discounted to the price of acquisition.", "score": 2, "replies": []}, {"body": "No BK? Whats BK? And by explode you mean implode?", "score": 2, "replies": [{"body": "It means no Burger King, because you either:\n\nA. won't be able to afford Burger King, or\n\nB. won't ever have to eat Burger King again.", "score": 37, "replies": [{"body": "I'd still have Burger King helicoptered out to my yacht on occasion ", "score": 3, "replies": [{"body": "As any real man should. ", "score": 2, "replies": []}]}]}, {"body": "bankrupt.  Stock most likely will go up due to the news.", "score": 1, "replies": [{"body": "Don't they still need to do the 10k though? That's what I read here earlier atleast  ", "score": 1, "replies": []}, {"body": "Yeah up in smoke.", "score": 1, "replies": []}, {"body": "Pretty sure SUNE still has $500M cash.  So you're ignoring the possibility that the restriction on insider trading is to prevent employees from *capitalizing* on bankruptcy in case stockholders get a share of the liquidated assets that's greater than the price of each share of stock (aka soon to be zero.)", "score": 1, "replies": [{"body": "Shareholders are the last to get anything from liquidation. Isn't their debt huge at the moment? ", "score": 1, "replies": [{"body": "Yeah, wasn't sure.  Bonghits96 offered an alternative explanation saying the 8-K was possibly done for the employee's benefit to prevent them from dumping anymore money into the plan before it tanks.", "score": 1, "replies": []}]}]}]}]}, {"body": "If I have Puts on $SUNE and it does go bankrupt, are they worthless or are they max value?\n\nWhat if the SEC freezes trading of their stock?\n", "score": 1, "replies": []}, {"body": "Not gonna comment on this anymore, and it's gonna get buried anyway.  Just going to say, I cannot imagine a better opportunity to make bank with far OTM faggot's delight strangles.  I'm short, but I just realized 2.50 APR1 calls are 2 fucking dollars.  Fuck it, I'm making money whatever the fuck happens.", "score": 1, "replies": []}, {"body": "The blackout period is standard practice for public companies including companies that have absolutely nothing of value going on. You might have been right about something going on, but it wasn't because of the blackout period. ", "score": 1, "replies": []}, {"body": "Yup. Sure did.", "score": 1, "replies": []}, {"body": ">SUNE will explode\n\n>No BK\n\nWow. You sold me.", "score": 0, "replies": []}, {"body": ">There's a blackout period imposed for Directors and Executive officers from buying more shares\n\nOr!  Or....from unloading whatever's left before it's worth complete dog shit.", "score": 0, "replies": []}, {"body": "Wouldn't a blackout prevent them from selling like crazy? Because they're going bankrupt?", "score": 0, "replies": []}]}
