{"title": "$TSLA short squeeze hasn't even begun", "selftext": "* The latest short interest figures show over [34 million shares](http://www.nasdaq.com/symbol/tsla/short-interest) held short as of 2/29 settlement.  That's **an all time high** and an increase of about 3 million shares shorted between $140 and $190.  That means millions of bears got greedy and are already 20-60% underwater in a matter of weeks.\n* The evidence shows that there hasn't been any significant covering since that time, and shorts are getting deeper and deeper underwater as share price creeps up on low volume.\n\nWhat's the evidence?\n\n* Both of my brokers report zero shares available to borrow at this time.  Prior to this, I was seeing hard-to-borrow messages with estimated borrow rates up to 7%.  Other investors I have spoken with report zero shares to borrow and have reported borrow rates as high as 12%\n* Put/Call open interest is at the [98th percentile](http://www.schaeffersresearch.com/content/options/2016/03/16/interest-on-tesla-motors-inc-tsla-options-hits-fever-pitch?utm_source=SR&utm_medium=Link&utm_campaign=Recap) which means intransigent bears are just digging themselves deeper\n* Put-Call parity has completely broken down.  Jan 17 $230 calls are trading at $31 while the puts at this strike are $45.  If there were any shares available to short, an investor would have an arbitrage opportunity here and would be able to guarantee themselves a risk-free 6% upon expiration.  Breakdown of Put-Call parity is evidence that short interest is still completely pegged.\n\nSo what does it all mean?  Short interest is at an all-time high, millions of those shares are already underwater, a reveal event in two weeks that's been anticipated for years and a Q1 delivery announcement just a few days afterward.  I think this is an obvious set up for a hell of a short squeeze that might propel this stock to all time highs.  The dip to the $140's last month may have been the mother of all bear traps.  ", "id": "4avp2c", "created_utc": 1458256929.0, "score": 49, "upvote_ratio": 0.97, "num_comments": 66, "comments": [{"body": "Great post. Holding strong, bought at the dip, looking forward to the next month. Shit is gonna be carazay.", "score": 18, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "To expand on what happened with VW. Porsche was acquiring shares en masse without reporting it correctly, driving the share price up a bit. Speculators saw this price rise as unreasonable and many shorted the stock. The price kept rising, they kept shorting. Until no one was left to sell, since so many had sold to Porsche who weren't going to sell for shit. Then they squeezed the shit out of VW.", "score": 8, "replies": [{"body": "IIRC they greatly increased their influence by holding call options which did not need to be reported until they were exercised and it was too late. But they ended up losing the war and got bought by VW.", "score": 4, "replies": []}]}]}, {"body": "So, how many shares should I short?", "score": 4, "replies": []}, {"body": "good DD - some shorts won't also start to cover until SPX hits new highs...", "score": 3, "replies": []}, {"body": "I'm convinced, in for $5k ", "score": 3, "replies": []}, {"body": "It's quite possible that those bears are hedged with low exercise price calls as well, in which case they won't be forced to cover until those expire.  (or maybe not even then, if it jumps before expiration and then tails off afterward they'll still be making money).\n\n&nbsp;\n\n>So what does it all mean?\n\nThat [this dude](https://www.reddit.com/r/investing/comments/4apos8/all_in_on_tsla/) will have a yacht and you won't, because he went overboard yolo.", "score": 10, "replies": [{"body": "> It's quite possible that those bears are hedged with low exercise price calls as well, in which case they won't be forced to cover until those expire.\n \nI don't see what difference that would make.  Exercising those hedges will exert the same upward pressure on the stock.\n\n> That this dude will have a yacht and you won't, because he went overboard yolo.\n\nI have a six-figure TSLA position...I think I'll be OK", "score": 5, "replies": [{"body": "these guys are not grasping what your saying.  you are spot-on in your analysis.\n\nelon has said over and over that he is going to make this release compelling... theres a good chance there will be things no one was expecting.", "score": 3, "replies": []}, {"body": "> I don't see what difference that would make.\n\nBecause the big option expirations hit mid-month, which isn't going to help squeeze the release announcement on March 31.\n\nJust looking at September as a rough example, I'm going to ballpark there are about 2.6 million shares per month covered by calls that are currently ITM.  I don't know how many of those are hedges against shorts, but it gives a potential covered total of around 12 million shares out of the 34 million you quoted.\n", "score": 1, "replies": [{"body": "Sure we can speculate on what sorts of hedges the shorts may or may not have in place.  Maybe the latent buying pressure represented by shorts in the near term is just extreme, instead of really fucking extreme.", "score": 3, "replies": [{"body": "My **point** was mainly to tone down the fanboyism a bit and make sure you're evaluating it unemotionally.  Sure, it might turn out well, or people might sell the event. ", "score": 1, "replies": [{"body": "My **point** was mainly to demonstrate that all the TSLA bears who are claiming that this current bounce off last month's lows is *the squeeze* are full of shit.", "score": 0, "replies": [{"body": "Yes, I'm *sure* your feelings about TSLA have nothing to do with that opinion.  Going on 2 years now, 75% of what you post is either /r/teslamotors, or TSLA related stuff in stock market subreddits.\n\nI don't mind DD, but I do mind when the person is so blind to their bias that they can't even admit it exists.", "score": 5, "replies": [{"body": "Yes I'm a shareholder, am enthusiastic about the company and use this account to post about the company and stock.  I have no idea what that has to do with the validity of the arguments I raised in this post.  I find it ironic that you are accusing *me* of being biased while simultaneously launching into an ad hominem.", "score": 1, "replies": [{"body": "It's relevant because the opinion *\"it might go up, or people might buy the news and sell the event\"* just got the reaction *\"TSLA bears are full of shit!\"*\n\n*\"Fuck those guys that don't like something I like!\"* is not a rational investing strategy.  ", "score": 4, "replies": [{"body": "Are you for real? I made a detailed post and provided actual evidence, and you are trying to claim I am blindly attacking people I disagree with.  Maybe I made a mistake trying to emulate the irreverent tone of this sub while responding to you.  Let me try again Mr. PC Police:\n\n> Based on my analysis of a number of factors as posted above, it is my opinion that short sellers of Tesla Motors Inc. who claim that a short squeeze has already commenced are incorrect.\n\nIs that rational enough for you?", "score": 9, "replies": [{"body": "Go fuck yourselves, dam.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "TSLA, a LARGE CAP, is up 62% already in 1 month, and into the 200MA. I'm not going long here, because I'm not an idiot. This is a shit post. ", "score": 11, "replies": [{"body": "So large caps are immune from short squeezes and the laws of supply / demand?  I'm sure all those Volkswagen shorts who got completely assraped a few years ago will be glad to hear this.", "score": 10, "replies": [{"body": "This is pretty shittly logic. You don't see a short squeeze start when a stock is up 62%. The move already happened. This is holding up because its options expiration. My june puts will pay me ez. I got in at 212.", "score": -7, "replies": [{"body": "You are mistaken.  Short squeezes happen when positions are underwater, a positive catalyst sends them even deeper underwater and forced covering commences.  If you had read my original post more carefully, you would understand why the move has not \"already happened.\" Good luck to you.", "score": 13, "replies": [{"body": "some of these commenters make my brain feel tired.", "score": 1, "replies": []}, {"body": "Whatever logic you want to  try to superimpose onto this move, TSLA is one of the best short opportunities this year, at these levels.", "score": 0, "replies": [{"body": "RemindMe! Mar 30 2016 \"All in short TSLA!\"", "score": 8, "replies": [{"body": "I will be messaging you on [**2016-03-30 00:00:00 UTC**](http://www.wolframalpha.com/input/?i=2016-03-30 00:00:00 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/wallstreetbets/comments/4avp2c/tsla_short_squeeze_hasnt_even_begun/d147d8z)\n\n[**1 OTHERS CLICKED THIS LINK**](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/wallstreetbets/comments/4avp2c/tsla_short_squeeze_hasnt_even_begun/d147d8z]%0A%0ARemindMe!  Mar 30 2016 ) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! d147dww)\n\n_____\n\n|[^([FAQs])](http://www.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^([Custom])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^([Your Reminders])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^([Feedback])](http://www.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^([Code])](https://github.com/SIlver--/remindmebot-reddit)\n|-|-|-|-|-|", "score": 3, "replies": []}]}, {"body": "What is you thinking here apart from 'it's gone up, therefore it must go down?' It's still way off the all time double top of ~280 and I think we're still below the 2014-2015 average price...", "score": 3, "replies": [{"body": "AND we're still in a downtrend.", "score": 1, "replies": []}]}, {"body": "Open wiiiide for the tsunami! ", "score": 3, "replies": []}, {"body": "Please please strengthen/create a short position. I'm ready to take your money. #tsunamiOfHurt", "score": 3, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I was in at $146, out at $203, and now just may buy into it again.", "score": 2, "replies": []}]}, {"body": "Another guy calling the top of TSLA! Can't wait to short this now!\n Go fuck yourself!", "score": 5, "replies": [{"body": "> Can't wait to short this now!\n\nYou literally can't short right now.  Did you read the post?", "score": 9, "replies": [{"body": "Dude ofc you can short... I use CFDs to short my broker never limits me, may only raise the spread a bit if there is too much speculation on a stock. You can also use options or other derivatives even if you don't have access to paper stock.", "score": 2, "replies": []}]}]}, {"body": "great post. too late? i been thinking about it all week.\n\nreading elons book now.\n\n\ncalls over buying outright?", "score": 2, "replies": [{"body": "If this guy is right it isn't too late from my understanding. If it was happening  people would know.", "score": 1, "replies": []}]}, {"body": "As long as you get in before the 30th it's never too late, those trading options know once that car is revealed (on the 31st) we're either seeing a huge spike up or down and some people will be doing the fucking while some will be receiving a fucking\n\nThe stock should just gradually rise up until the set date but obviously if we get some spoilers or leaks we could see some sexy early spikes", "score": 2, "replies": []}, {"body": "I bought in on the 1st March and will hold at least until 1st of April because in Mu$k I trust and as all the celebs are buying them they are the must have item. Thanks short sellers for making this share affordable - looking forward to the squeeze later on...", "score": 2, "replies": []}, {"body": "How about the last time I couldn't borrow shares of a stock to sell short? The last stock that my broker didn't have any shares to borrow was SCTY, when it was above $50 in Dec 2015. that got hammered 70% from that level. Also Elon Musk's baby, you fan gays.", "score": 3, "replies": []}, {"body": "There are just as much unusual covered calls on TSLA too. While i think a slight pull back may happen soon, TSLA looks to be continuing up. \n\nAlso SI doesn't just meam bears are greedy, but potentially investors are bearish on it holistically...i mean from your examples it's like me going to my nearest walmart and saying there's a shit ton of people, i should invest just because of that.\n\nMaybe I'm not understanding your evidence, and it looks even in your source they're simply saying there's plenty of upside due to the large amount of short interest, and their new unveiling in March.", "score": 2, "replies": []}, {"body": "I can never tell if I should buy Tesla as ppls comments are so divided. ", "score": 2, "replies": [{"body": "Comments: the best deciding factor for any investment.\n\nDIS! DIS! DIS!", "score": 4, "replies": [{"body": "> DIS!\n\nhuh?", "score": 1, "replies": []}]}]}, {"body": "What if the reveal event of the new model gets pushed back. How is that going to affect the \"short squeeze\" ", "score": 1, "replies": [{"body": "Invitations have already gone out, the stores have been advised of the game plan and the company has already started with teasers and promotion.\n\nThey've definitely delayed events that were on softer timelines, but never after doing stuff like this: https://twitter.com/TeslaMotors/status/709865605101301760", "score": 7, "replies": []}]}, {"body": "33% short... its not SCTY or SUNE short... but maybe...\n\nhttp://shortsqueeze.com/?symbol=TSLA&submit=Short+Quote%99\n", "score": 1, "replies": [{"body": "I was considering jumping into SCTY soon. They are about to open the Gigafactory, and political officials seem to be really impressed. It's also already dropped 40% in the last few months since their announcement of being under pacing growth expectations. \n\nWhat makes you think it'll further fall?", "score": 1, "replies": [{"body": "I don't think anything really. Not sure where its going. Wanted to get in around $200. I don't move quickly and I tend to overthink my buys... and my sells.\n\nMy biggest concern are all the other companies working really hard to get into the space. GM, Ford, etc. Curious about the Toyota / Honda move towards fuel cell too.\n\nI really like Tesla and what they are doing but that doesn't mean it would be a good move.\n\n", "score": 1, "replies": [{"body": "I was talking about SolarCity, not Tesla lol... I still think Tesla is going to have a dip in the coming days leading up to their new model announcement, from there it'll either raise or fall... And to me it's a literal gamble so I'm out.\n\nBut SCTY, they have an earning report coming up soon, which could turn them back around. In fact, I know some managers there, I'm going to ask them if numbers have substantially been doing better. ", "score": 1, "replies": [{"body": "fuck... sorry. I havent had enough coffee yet.\n\nI have a ton of solarcity. So that run up to $56 and down to the teens almost made me throw up. I am up over all though but still taking a slight loss for SCTY.\n\n$SCTY is up in the air right now. I am in for the medium term, not sure if I will hold for a year.", "score": 1, "replies": [{"body": "I just contacted a bunch of managers and associates there. Once they get back to me when they wake up, I'll give you an update so you have an idea where they are at before their next earnings report :P", "score": 1, "replies": [{"body": "Uh... ok.\n\nAnyway, I heard a rumor that $SCTY was probably going to be taken private.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, was only able to talk to one manager there, but he's not really the smartest guy when it comes to these things. He said he expects another drop in price. When I asked why, all he said was, \"Predictive patterns.\" Whatever the fuck that means. So instead I just asked a sales person how it's going there. He said the average employee conversion rate is much higher, and every group within the company is exceeding their targeted goals.\n\nSo there is that. But he also said a lot more customers are asking about the issue in NV where the utility really screwed over existing owners by changing the terms.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}, {"body": "don't go bro, we're in this. ", "score": 1, "replies": [{"body": "k", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "My target price is around 231 which may happen in next couple of days.If it fail it probably will start to shit bed.", "score": 1, "replies": []}, {"body": "excellent post!   im holding april $250 calls that are up about 500% and climbing.  \n\nthank you for the detailed and researched analysis that is rare on this sub.", "score": 1, "replies": []}, {"body": "Yeah, this makes sense. But what about the fundamentals though?  I'll just stay away.", "score": 1, "replies": []}, {"body": "I don't know enough to know if this is brilliant or not, but it certainly sounds like it. I'll go in with a few shares for shits and giggles.", "score": 1, "replies": []}, {"body": "Why is it that everyone assumes shorts are based at the bottom?  I knew a lot of shorts in TSLA when it was near $280.  In fact, I was one!", "score": 1, "replies": [{"body": "I'm not sure where you read that.  All I said was that the 3 million shares representing the increased SI at the latest reporting period must have been shorted between 140 and 190.\n\nCongrats on your profitable trade.", "score": 4, "replies": []}]}, {"body": "I shorted some next week call spreads, don't think it'll go up much more without taking a break. We'll see though", "score": 1, "replies": [{"body": "I just pulled last night before market close at 224... I suspect there is going to be a dip, then rebound.\n\nTSLA behaves a lot like Apple where they get overhyped prior with every new product launch, then soon as the product is announced, they always seem to get a dip... It's easy money. ", "score": 1, "replies": []}]}, {"body": "It's not impossible to get short TSLA now. I'm seeing borrows around 10%.  \nHowever, it's wrong to say that put call parity has broken down and that there is an arb in reversing and collecting the 6%. That 6% goes away when you consider the rate paid to borrow + the risk of being bought in.  \nThere is, however, an actual arb opportunity here. ", "score": 1, "replies": []}]}
