{"title": "New to the game", "selftext": "New to the stock market... just bought a single share of $F $RNN $AMD... what do you think.? ", "id": "6av1vb", "created_utc": 1494635320.0, "score": 7, "upvote_ratio": 0.76, "num_comments": 27, "comments": [{"body": "One thing to be careful about is the Pharmaceuticals industry. Lots of uncertainty and outlook is not too good. Doesn't mean you have to get out of RNN, but maybe read more into it & make sure you're still comfortable holding on to the stock long-term. I don't know anything specific about RNN, other than it being a pharmaceutical company.\n\nOther than that, happy trading!", "score": 3, "replies": []}, {"body": "My best advice is to stay far, far away from /r/wallstreetbets", "score": 3, "replies": []}, {"body": "$F is Meh. I don't see much growth potential unless they fix their quality issues. And even then, it'll take a year to reflect on price stock.\n\n$AMD is good shit. Under bought and on its way up. But expect it to take a while. I'd buy in when there's a dip, but whatever. \n\nI have a policy of not trading pharma companies. There's too many uncertainties, and most of it is hype. Most of their money is being poured into R&D with minimal profits, gambling for the big score. Personally, I was in research, so I know how sketchy r&d can be especially in an environment where there is pressure to publish positive results.\n\n", "score": 7, "replies": [{"body": "Thank you for the input .. ya I was thinking of selling the $F and purchasing more of the $AMD or $RNN", "score": 2, "replies": [{"body": "Yea, don't forget to upvote my comment. I don't do this shit for free, ya know.", "score": -3, "replies": [{"body": "I'm new to Reddit never knew to upvote lol", "score": 1, "replies": []}]}]}]}, {"body": "Watch a lot of YouTube vids (grain of salt), pick up a reputable book, read the financial reports daily. It's a slow process and you have to allow yourself to make mistakes along the way. I set a yearly allowance that I trade with. It's an amount I'm comfortable losing. I also set some well defined boundaries for my trades and a trade plan for each stock I buy. That helps mitigate any foolish behavior on my part. Good luck to you sir! ", "score": 2, "replies": []}, {"body": "Don't know what broker you use but mine charges through the roof when trading on NASDAQ so it's basically impossible for me to make money on single shares unless I buy Tesla, Amazon or Google.\n\nI'm a noob and I have learned that nobody knows how much weed stocks are worth, biotech is volatile, penny stocks are penny stocks for a reason - don't buy stocks just because they are cheap and you get to buy a bunch.\n\nI read an article (in Norwegian) that it wasn't profitable to invest in losers, over time you gain much more by investing in successful companies.\nThe losers don't always bounce back.\nThis has been my experience as well; I bought GoPro on the dip, then on the second dip to average out, and then on the third dip because I thought it couldn't possible go any lower, but it did.\nOn friday I just threw $6500 to rescue $2500 from my misguided GoPro investment.\n\nMy GoPro investment has been dead money.\nIt's the same with several other Norwegian stock that I own, just waiting to brake even.\nI should have done some research before buying into some of these companies.\n\nI wouldn't buy Ford, AMD looks like a good deal, I don't know $RNN.", "score": 2, "replies": [{"body": "That makes a lot of sense.. ", "score": 1, "replies": []}, {"body": "That makes a lot of sense.. ", "score": 1, "replies": []}, {"body": "I guess I'm starting off slow.. trying to build money and don't really have the money to throw in to big stocks like Apple, Google or Tesla ", "score": 1, "replies": [{"body": "A slow start is better than no start. I waited too long before getting into the stockmarket, should have done it years ago. Personally I learn best by doing. ", "score": 1, "replies": []}]}]}, {"body": "Stop thinking it's a game before u lose a bunch of money.", "score": 2, "replies": []}, {"body": "Im new to the stock market as well. Bought amd at 11$ a few months ago, sold at 10.50$ after it dropped cause i got scared. Now its back up to 11$ so i learned not to let emotions get in the way of DD. One thing to figure out right off the bat is your level of risk. How much cash can you afford to lose. Whats your worst case scenario. Figure that out and use it to guide your investment practices. I sold my AMD shares and bought TCX and SLGN. The growth is slower but the companies are solid and will give consistent returns. (At least thats my idea haha) ", "score": 2, "replies": [{"body": "What's your advice on purchasing more stocks? Should I just keep investing more shares in the stocks i have now, or just buy single shares of other stocks.? I'm not too sure what direction I should go to make a profit at least ", "score": 0, "replies": [{"body": "if you want some return and don't wanna lose it all, go Facebook or Apple or Amazon or an ETF like VOO or VTI. bio stocks like RNN (though looks promising) are super risky. really just depends what you want though. ", "score": 2, "replies": []}, {"body": "One thing you wanna consider is diversity in your stocks. For example some technology, some energy, some manufacturing, some food, some banks, etc. Dip your toes into different markets. But also dont over-diversify. Spreading yourself to thin will make it difficult to keep track and make profit. Find companies you agree with morally, and financially. Look at their quarterly earning, their ceo, their business practices, are they involved in lawsuits every other day, etc. That's just one way to look at it. ", "score": 1, "replies": []}]}]}, {"body": "Thank you for the advice I really appreciate it... I don't have much money to throw into this thing maybe 100$ a month and nothing more... it nice to be able to use these threads for advice...  it's a slow process for me I guess just be patient and not let me emotions come to just like you had mentioned... I don't know if I should just buy single shares all scattered around or keep buying shares of my stocks now? ", "score": 1, "replies": [{"body": "As a disclaimer not really that qualified to give advice lol. But from noob to noob, i do alot of lurking on some of the forums here, r/personalfinance has alot of good info that is relevant to investing. I also youtube alot to learn my investing lingo. I look at growth charts going back 5 years of each company stock i consider purchasing. I have a scottrade account which provides me with alot of basic info when im looking at stocks. I also recently have been considering IRAs and mutual funds as opposed to trying to beat the stock market. All in all its like you said a slow learning process and for me its at best kept to a modest hobby for now until i learn more and become more skilled in doing research.  ", "score": 1, "replies": [{"body": "Advice on buying single shares on different stocks or more of buying a bundle of shares on one stock? ", "score": 1, "replies": []}]}]}, {"body": "yep that's the reddit starter box. ", "score": 1, "replies": []}, {"body": "Haha so that's the right direction I hope", "score": 1, "replies": []}, {"body": "Learn 1 or 2 sectors in depth.  Study it well.  Not their products, their industries, their competition, and everything that effects that sector.  Study the shit out of the companies in that space.  Buy low, sell high. \n\nWith other sectors just get an index fund with a low expense ratio and a high dividend.  Sit back and relax on these, and collect the money in 20-40 years. ", "score": 1, "replies": []}, {"body": "Pretty silly way to start off by investing in the stock market. Learn the fundamentals before you start making speculative plays. ", "score": 1, "replies": [{"body": "Gotta start somewhere right.? ", "score": 1, "replies": []}]}]}
