{"title": "Somebody teach me options and I'll teach you equities", "selftext": "Decade+ of experience, will give you insights if you cut the shit and don't withold and let's trade info I'm trying to maximize my personal gains for fun - fuck it\n\nPM me", "id": "68mrgy", "created_utc": 1493653900.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 24, "comments": [{"body": "\"Teach me options\" is incredibly vague. There are a million strategies. ", "score": 7, "replies": [{"body": "As is with equities - break it down for me?", "score": 0, "replies": [{"body": "I mean, what do you want to do with options? There are textbooks written on the subject. One Reddit reply isn't enough to teach you everything when you're that vague.\n\nHonestly I think the best way to make money with them is to build a model and capture inefficiencies. That requires quite a bit of math knowledge though.", "score": 5, "replies": [{"body": "I have considerable math knowledge. It seems like most options-math involves statistics (linear regression, kurtosis), binomial trees, and calc...no? \n\nBy inefficiencies do you mean arbitrage, cause I'm a big fan of free money. ", "score": 1, "replies": [{"body": "Correct and yes. There's no perfect arb but this one was really fucking good when I did it.", "score": 1, "replies": [{"body": "How are you getting there so fast, are you just operating smaller margins, large principal or illiquid/exotics? ", "score": 1, "replies": [{"body": "These days, you have to automate. We are not as fast as the biggest shops but our model is better so there is plenty to capture.", "score": 1, "replies": [{"body": "Automation is mostly for market making, I wouldn't trust it for case studies - I trust my reading. Why don't you pick up programming, I didn't want to learn VBA to do my macros in Excel, I didn't want to learn Python to crawl databases but eh what are you going to do when some acne ridden nerd in the valley from some third world village is willing to code the next trend 100 hours a week until they burn out and go for management or a smaller company. ", "score": -4, "replies": []}]}]}]}]}]}]}]}, {"body": "tastytrade\noptionalpha ", "score": 5, "replies": [{"body": "I feel like tastytrade is a gimmick only out there to make themselves money - like the CNBC of options.", "score": -1, "replies": [{"body": "You're right, one of their goals is to make money. Just like any business or human on Earth, most of us spend the majority of our day trying to make more money. I hate when people say that in a negative way about something. No shit they want to make money, we all do. \n\nTT actually has good content and can be used to form a great foundation for premium selling strategies. Just like with everything, take what you learn with a grain of salt. You can't follow anything blindly hoping to copy it exactly and make money. ", "score": 9, "replies": [{"body": "So if TT is like CNBC, let me know what the WSJ/Barrons/Bloomberg of options is. ", "score": 0, "replies": [{"body": "Sorry I'm not understanding your analogy. Our views of those networks could be vastly different. It doesn't sound like to me you've put any effort into learning to trade options. The most \"help-able\" people are the ones who have been intently studying and trading small for a couple weeks to months. Then they can ask intelligent questions and get the most from a mentor.  Like I said, I will be happy to be a mentor and help in any way, but not a teacher from the ground up. You won't find many people that will do that, if any. You'd be much better to just start watching TastyTrade or options alpha. ", "score": 3, "replies": [{"body": "I'll have to start looking into TT and options alpha. I respect that you think a trader should develop their own foundation before looking to a mentor I am just getting into options and am loving the research and studying side of it. Looking forward to frequenting this sub for nuggets of info as I train myself up in the art form. ", "score": 2, "replies": []}]}]}]}, {"body": "both TT and OA are 99% free resources and a wealth of knowledge, plus high production value. What they are doing is incredible! I have learned a ton in 6 months. With low cost brokerage fees, one can manage winners earlier and roll into risk reduction much more actively and aggressively without the heavy rake. \n\nBottom line, it's a lot of work, they never promise quick exponential gains. If you have $25k, and are willing to make 75-100 trades a month, you can reasonable make $1000+ per month.  I make like 3-4 trades a day more or less. Does that meet your personality and goals?\n\nSelling covered calls and collars are the most widely used application of options. What TT and OA talk about are things like Iron Condors, Strangles and Straddles...not far off the path. \n\nYou have a long way to go in your journey. Good luck. ", "score": 2, "replies": [{"body": "Just curious because I've never seen a readout like that with numbers and it got me thinking... That's a lot of commissions.\n\nThe typical TT behavior of opening and closing an iron condor. 4 options per order, 2 orders. How many \"trades\" is that in terms of \"75-100 trades per month\"?\n", "score": 1, "replies": [{"body": "I use IB at .70 per contract or 5.60 a roundtrip for a IC. TT is $1 per contract but no closing/rolling costs. Commissions are unavoidable but manageable cost....going with wider wings, higher premiums help increase P/L.", "score": 1, "replies": []}]}, {"body": "25k, 1,000+ a month...you're telling me TT gives strategies & the knowledge to be making 50%+ a year...now I know you're full of shit. Thanks for clearing that up, iron condors are straddles are rookie stuff I'm past my beginner knowledge. It seems like selling out of the money puts/calls and collecting premiums is the surest way or working those implied volatility plays if you know what kind of risk you're eating up but you never really know do you, and decays always working against me, same with equities but tvm much less drastic. ", "score": 0, "replies": [{"body": "If you're selling, in what way is decay working against you?\n\nDefined risk trades are not \"rookie stuff\" BTW. If you want to go out on the risk spectrum and either a) win big or b) lose often then that's an acceptable route. Most people are pretty blind to the actual risks they're taking on, though. People are bad at the maths, as a general rule.\n\nPure options strategies are puts and calls. You have long and short calls and long and short puts. Everything else is just some larger combination of that. You can call them 1,000 different names but they're a series of puts and calls. You can buy and sell at 20 different price points or expiration dates and they're still, at the base, long and short puts and calls.\n\nSo what would make something \"not rookie\"?", "score": 2, "replies": []}, {"body": "actually yeah, I've made about $1400 per month since January. March and April being the bigger months. Small sample size, but I'm delta neutral in a bullish market. I'm risking about $16,000 in a month over 75-100 defined risk trades. The hardest problem is scaling it up from there. Not sure that if you gave me $50k, that I'd be able to double the trading volume and P/L. I'm still placing single lot trades, \"trade small, trade often\". ", "score": 1, "replies": []}]}]}, {"body": "You are not wrong, although some of their videos are educative.", "score": 1, "replies": []}]}]}, {"body": "options are just price guarantees for equities. calls mean you have the right to buy at a set price (if you pay a premium) and puts mean you have the right to sell at a set price (if you pay a premium). these obviously expire at some given point in the future. there are many different \"strikes\" which are the set prices mentioned above. you can also sell these to other people and give them those rights, and you collect the premium. generally 1 contract = 100 shares of the underlying. if you buy and sell different combinations of calls, puts and at multiple strikes, you can devise and create elaborate and catered strategies. The behavior at which the prices of options fluctuate are based on the price of the underlying, the time until expiration, and the volatility of the underlying. How to calculate volatility is controversial, though beginners use the black-scholes model which is the most common.\n\nexample time: AMZN is going for $900.   I own 100 shares but I'm slightly bearish but not enough to sell, after all its AMZN! So I will sell a call instead, giving someone the right to buy my shares at the price I determine (lets say 910) 2 weeks in the future. The call premium for 875AMZN calls expiring in 2 weeks is currently going for $5 (makes sense right? factor in the time left and how volatile a stock AMZN is, so theres a $5 premium to give someone the right to make bank if it rises above 910). I sell ONE call since my purpose in this strategy is to protect my shares from a potential fall, and I'm comfortable selling AMZN if it hits 910. If AMZN falls, the call option expires worthless and I get to keep the premium (though AMZN fell). If it stays flat, same thing. If AMZN rises to 920, I keep the premium still, but I have to sell my all my AMZN stock for 910, even though I could get 920 in the open market (because he has price guarntee). This situation is called a covered call\n\nThis highlights how you can use options as leverage, for protection, or to hedge. If you expect stock XYZ to rise to $100 within a shorter timeframe than normal and it is currently at $50, you should likely buy calls since you are paying a premium to lock in a cheaper price and have unlimited profits. Or you could take the safer route and sell puts, that would give you a flat premium, the option would expire worthless, but your gainz would be capped. Thus options can either be \"in the money or out of the money\". I'll leave this to google as this post is getting too long, but as you buy options further OTM, you get more leverage, but with severely decreasing odds of probability of success.....like a lottery ticket. \n\nBasically if you can predict where the underlying is going AND WHEN, you can make alot of money using simple options. If you don't know when or where you can still make money, but it will involve different strategies.", "score": 2, "replies": [{"body": "Thank you for the long reply. I should have added I know the text book stuff, and have had exposure to them - I just do not know them in an advanced level. I used Black-Scholes in analyzing the ESO of my company's as well but for equities there is market making, momentum trading, long/short, fundamental, technical, cash flow, projected earnings, leveraged buyouts - I need to know the \"paths\" in options. ", "score": -1, "replies": []}]}, {"body": "I posted this in another thread, but it seemed to help and it partly addresses your question about how to move beyond just basic strategies.\n\nhttps://www.reddit.com/r/options/comments/68rtt7/complex_strategies/dh1hg3v/", "score": 1, "replies": []}]}
{"title": "$AAPL climb", "selftext": "What's up with the climb today? I'm not complaining, just curious. ", "id": "68nluj", "created_utc": 1493662010.0, "score": 4, "upvote_ratio": 0.68, "num_comments": 22, "comments": [{"body": "Earnings coming up. Also beginning of the month.", "score": 12, "replies": [{"body": "Indicates bullish expectations for the earnings report?\n\nAnd what does the beginning of the month have to do with it?", "score": 2, "replies": [{"body": "A lot of stocks run up prior to earnings because that's just the nature of the market. People like to gamble on earnings so they try to get a position to profit off an earnings surprise. Stocks usually sell of at the end of the month and increase during the first days of the new month.   This is caused by a few things: mainly belief that the first day of the month is the best time to buy and the action of mutual funds who have to sell near the end of the month to create cash liquidity and then buy back in.", "score": 8, "replies": []}]}, {"body": "Everyone thinks it will go up, so most likely the stock will go down after earnings. ", "score": 1, "replies": [{"body": "Very little short interest in AAPL ahead of earnings. Very little chance that AAPL will sell off after earnings unless it's historically bad. Any miss in revenue will just be billed as people waiting for the iPhone 8.", "score": 2, "replies": [{"body": "I've been a AAPL shareholder for 10+ years now. Run up to the earnings call followed by a dip after would not be out of the ordinary, although just random enough to not bet on it.", "score": 3, "replies": [{"body": "Same and agreed. Had mine since 05. Bought $500 worth in 5th grade ", "score": 3, "replies": []}, {"body": "If there's a dip I would just buy more, one would have to be quite braindead to sell AAPL", "score": 2, "replies": []}]}, {"body": "Depends on how overbought it is. Like if it's above 70 RSI it would need a much better earnings report than if it was below 40 RSI. So to have statistics on your side, it's best to just sell before earnings if it's had a strong run up into earnings. \n\nBut I say this from a purely tech analysis standpoint. I'm very bullish long term on both FB and AAPL, however if the price keeps moving how it is I am selling AAPL tomorrow and FB the day after just to minimize my % chance of loss. From there I will most likely buy back into very similar positions a few days afterwards. \n\nRisk aversion methods have personally worked best for me. ", "score": 1, "replies": [{"body": "can you explain this tactic a bit further? if you are selling off and buying back in for the same amount what is the long term gain of doing so?", "score": 1, "replies": [{"body": "The long term gain is that if tactic works out even say 60% of the time, I will slowly be making higher returns than if I was to just hold through all earnings no matter what. Essentially I'm just trying to get more bang for my buck by actively managing my portfolio rather than passively investing.\n\nMy most recent example is I used to have 95 shares of SBUX, but because of it's huge run-up into earnings I was weary of holding through earnings as I believed the percent chance of it dropping after was higher than the chance of it going up or sideways. So I sold 300 shares at 61.50. The next day I bought back in at 59.35 and now hold 310 shares.\n\nSo I essentially made a roughly a 3% gain on the stock (in position size at least) when the stock actually went down. The only difference between this approach and just taking a short position is that I am still bullish on SBUX long term, but I thought they would not meet expectations this quarter and saw it as an opportunity to increase my position size for free essentially (the risk of being wrong was the price I paid).", "score": 1, "replies": []}]}]}]}, {"body": "I'm new wouldn't we be seeing spikes after the anniversary iPhone comes out this year?", "score": 1, "replies": [{"body": "not necessarily, depends on iPhone :)", "score": 1, "replies": []}]}]}]}, {"body": "is up because people want to get in before the iPhone 8 super cycle.\n\nPlus the other tech names had strong earnings so far.\n\nAlso tax law changes seem more possible now then a month ago. ", "score": 3, "replies": [{"body": "Yeah I was wondering if the tax law was going to affect it. \n\nDo you think we are in the phone cycle? I was thinking June. ", "score": 1, "replies": [{"body": "investors are trying to get into the stock BEFORE the cycle starts in Sept. That is when the new iPhone suppose to come out. The one with a new design that everyone in China is waiting for.  ", "score": 2, "replies": [{"body": "Ah gotcha. Oh well I'm not complaining ", "score": 1, "replies": []}]}]}]}, {"body": "The Wall Street Journal has multiple bullish articles on Apple front and center on their Web site and probably also on today's newspaper.", "score": 1, "replies": []}, {"body": "http://www.investors.com/news/technology/click/apple-q2-earnings-preview-what-to-expect/", "score": 1, "replies": []}, {"body": "What could be better? One thing remains is to see better-than-expected earnings. ", "score": 1, "replies": []}, {"body": "Tomorrow's gonna be fun, GS is going to come up with a fresh rating. ", "score": 1, "replies": []}, {"body": "As long as apple people keep blinding supporting it, it will continue to rise. Apple is planning to market Apple branded ice in Canada next winter. I heard it's going to do extremely well because it has an Apple logo on it.\n", "score": 0, "replies": []}]}
{"title": "When will the next recession arrive?", "selftext": "", "id": "68jvg4", "created_utc": 1493610812.0, "score": 4, "upvote_ratio": 0.58, "num_comments": 18, "comments": [{"body": "[deleted]", "score": 40, "replies": []}, {"body": "Ask an economist. They have predicted 8 of the last 2 recessions. ", "score": 18, "replies": []}, {"body": "September 15", "score": 11, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "Because it do", "score": 3, "replies": []}]}]}, {"body": "When you finish licking every inch of my asshole", "score": 16, "replies": []}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Live expectancy went up again.", "score": 1, "replies": []}]}, {"body": "Go all in on $SPY and see what happens. ", "score": 5, "replies": []}, {"body": "69 420 911 666", "score": 5, "replies": []}, {"body": "Based on my portfolio, since I started trading ", "score": 4, "replies": []}, {"body": "Ill tell you. Let me come inside!!", "score": 2, "replies": []}, {"body": "August 11th", "score": 2, "replies": [{"body": "Why?", "score": 1, "replies": []}]}, {"body": "not today", "score": 2, "replies": []}, {"body": "2030", "score": 2, "replies": []}, {"body": "9-16 months", "score": 2, "replies": []}, {"body": "2030, look at 1930' and 1830's. The great cuckening happens every 💯 years.", "score": 1, "replies": []}, {"body": "Where is he? You know who I speak of.\n\nI know you're out there! Show your flair!", "score": 1, "replies": []}, {"body": "When your mom stops putting out... ", "score": 1, "replies": []}]}
{"title": "Can anyone explain why AMZN stayed the same when they beat their earnings projections by 50%?", "selftext": "", "id": "68k7fa", "created_utc": 1493615771.0, "score": 3, "upvote_ratio": 0.57, "num_comments": 20, "comments": [{"body": "That is normal. There is something called the Fibbonaci Gentleman's Agreement or FGA. This is an agreement among market makers to collectively sell their position at a pre-determined time, creating a sharp decline in a stock's price. When the average person wakes up and sees the stock price a panic ensues and the public begins to sell. This is when the market makers reenter, benefiting from a reduced entry price point. ", "score": 37, "replies": [{"body": "Fuck, can't believe I searched for that", "score": 9, "replies": []}, {"body": "........... the autism is strong in this one ", "score": 6, "replies": []}, {"body": "FGA is an anagram for FAG", "score": 2, "replies": []}, {"body": "Would the smaller trading companies not have algorithms that would just buy all the stock? I mean, can you really get everyone in the market, including foreign countries to be \"in on it\"?", "score": -5, "replies": [{"body": "woosh", "score": 20, "replies": []}, {"body": "Lol", "score": 3, "replies": []}]}]}, {"body": "Bezos is just going to spend anything he earns.", "score": 3, "replies": [{"body": "Gotta build that 🚀 to the 🌙 ", "score": 1, "replies": []}]}, {"body": "Yes", "score": 2, "replies": []}, {"body": "Jesus ", "score": 2, "replies": []}, {"body": "You buy a stock not based on past results but future growth/earnings.  Amazon beat the estimates and the price rallied, but then they came out with soft guidance for this quarter, meaning they don't expect to do as well as one would estimate based on their most recent quarter. \n\nAMZN is not easily quantifiable based on its eps or almost any traditional metric, so investors get scared when future growth seems to be slowing down because they have no idea what the actual downside of lower FCF and EPS might mean to the street price. ", "score": 2, "replies": []}, {"body": "someone get this guy some medication ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Could you explain in more detail? Is the EPS forecast not \"priced in\" as well?", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "If I read someone say this 'priced in' bullshit again I swer I'll kill a goat", "score": 1, "replies": []}, {"body": "How could they be factored into the stock price, if no one knew what they were? I mean, don't the use the projected EPS for their price?", "score": -1, "replies": [{"body": "The stock is already up huge since last earnings. The earnings showed that company is performing in line with market expectations.", "score": 1, "replies": []}]}]}]}]}, {"body": "AMZN is great but also a nightmare. Bezos returns the profits back into the company trying to push it further and further, with some of them being utter failures like prime pantry and amazon china. Stock is priced in super far into the future. Bezos and Trump publicly hate each other, and AMZN is one of the big companies that uses offshore banking to avoid taxes, which trump is trying to crack down on. Even though the retail sector is having tough times, ones like Target (TGT) are seen as being oversold with fine fundamentals and a better return for the next year.", "score": -1, "replies": [{"body": "So much bullshit in one comment. Incredible.", "score": 1, "replies": []}]}]}
