{"title": "Anyone still bullish on RKLB?", "selftext": "Found this stock here of all places and am actually really thankful for it. I've been looking for a stock like this for awhile and to see it fall into my lap like this almost seems to good to be true. Of all the stocks I've really put time and effort into researching, RKLB definitely takes the crown. It has such an promising future ahead of itself for $5.00 a share. I bought 25 $4.00 calls expiring 6/24/25 several months back and am already up by a lot. Also have 500 shares selling covered calls too. I'm basically dumping $1,000 each month into shares/options and another $1000 into BLK (shares). \n\n*For those who are also following, where do you think RKLB will be in 10 years from now?*\n\nI honestly think this is a $100-$200 stock by then--maybe more in less time. I'm 99% sure they are building rockets for Amazon's Kupier mission which is 10 years of buck time dollars. They have several other massive contracts too which leads me to think about how much these guys will grow and rack it in.\n\nOnly thing that worries me at this point is the overall economy--which isn't all too much. I'm pretty sure it would take an act of God for Amazon's contract along with other big names to cancel them because of an poor economic climate. Who knows though.\n\nI can write a whole book on the damn thing, but the point of the post is to shed some light on it if you're looking for a stock with real potential that is less than $10 a share.", "id": "14apcoy", "created_utc": 1686897639.0, "score": 70, "upvote_ratio": 0.89, "num_comments": 67, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|3 weeks ago\n**Total Comments**|46|**Previous Best DD**|\n**Account Age**|3 weeks|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: RKLB is an amazing company with a very bright future and you should buy their stock while it's still cheap.", "score": 1, "replies": []}, {"body": "I bought at IPO....\n\nUnfortunately I have regerts....paperhands.  buy high, sell low.", "score": 23, "replies": [{"body": "That's the spirit. Make us proud.", "score": 8, "replies": []}]}, {"body": "I bought 2,800 shares on Monday. No regerts.", "score": 18, "replies": []}, {"body": "They have a path to $1.5bn - $2bn revenues by 2030 if they can retain their share of a very fast growing segment in both launch and space solutions and thier road map delivers. That said, $30-$40 a share is more realistic rather than $200 (we can only dream). The amount of information and media on the company is great, just following them is a tutorial in the space industry. They are very good at managing risk which will win the NASA/DOD contracts and as the CFO mentioned on Wednesday, there will be supply side challenges to satelite manufacture eventually, which they are better placed than anyone to deal with as they have the vertical integration strategy from raw materials up to launch, and thereafter. Holding this forever.", "score": 22, "replies": []}, {"body": "RKLB is an amazing company and will be worth a ton but it may take a few years. I wish I had bought more at $4 but I'm still buying anyways. They will be massive this decade.", "score": 40, "replies": [{"body": "Couldn't agree more. I started getting in when it was above $5 back in January. Bought the dip until my average cost was $4.33 /share.  Still buying more shares.\n\nI plan to hold for a long time, I think they could become one of the major space companies. They do not make the big headlines like SpaceX, but I think that is a good thing. Their growth is based off business fundamentals, not CEO hype.", "score": 13, "replies": [{"body": "Yes, and even though they're not all about CEO hype their CEO Peter Beck is awesome. It was great to learn more about him in the recent Ashlee Vance book. He sounds like a true genius craftsman who is completely dedicated to rockets", "score": 9, "replies": []}]}, {"body": "Too many challenges still ahead that could make things go sideways. Too early and too big of a gamble still for me to go long on it yet", "score": 2, "replies": []}]}, {"body": "I'm up 40-50% YoY -- specifically, up 51% since I got back into investing 14 months ago -- and it's basically all actively trading RKLB, maybe a trade or two per month.\n\nI started doing that because the market was, mind-bogglingly, treating Virgin and Astra as though they were the same, or near-peers of RKLB!!\n\nPffffft. Sometimes the market is just so out of tune with what enthusiasts know about a space, it's comical; like a mass delusion ...\n\nI'd trust my life to Peter Beck's engineering. I wouldn't trust any other non-SpaceX aerospace CEO to cut a BAGEL for me.", "score": 8, "replies": []}, {"body": "700 share here. Planning to triple that amount soon. If all goes well With the development of neutron, can go easy at 40-50$/share. \nThey also have a good amount of cash, si no worry to be diluted", "score": 6, "replies": [{"body": "Sweet!", "score": 1, "replies": []}]}, {"body": "17K shares - holding until 2030 minimum - my fav company 🚀🚀🚀", "score": 15, "replies": [{"body": "🚀🙌", "score": 2, "replies": []}]}, {"body": "Going to buy more shares today just because you wrote this sexy post. My monkey brains wants to go all in but still dca'ing for now", "score": 15, "replies": []}, {"body": "My average cost is still like $8", "score": 5, "replies": [{"body": "Should be more than that in 2 hours. Keep holding!", "score": 3, "replies": []}]}, {"body": "I like and own the stock. That being said, there are downside risks beyond just the overall economy. The elephant in the room is the large amount of competition in the space, namely SpaceX. Until they can successfully launch Neutron, Rocket Lab's payload capacity is tiny compared to SpaceX. Also, with any rocket company, it just takes one failed launch or lost contract to tank the stock price.", "score": 8, "replies": [{"body": "I agree with u, but i think that SpaceX might collapse if they manage to blow up enough starships making rklb a potentially better investment.\n\nI once heard in SpaceX documentary that they were on the edge of bankruptcy just before succeeding with falcon9. This time imo is no different.", "score": 5, "replies": [{"body": "Starship is a HUGE undertaking, you're not wrong in that sense. But I will say this: even if SpaceX runs out of cash, they have Tesla and Elon Musk to fund things, on top of the US government and lots of other whales. \n\nI don't see them going bankrupt unless the whole Starship project fails for years and never manages to get off the ground, so to speak.", "score": 5, "replies": []}, {"body": "The initial proof of concept of the falcon rocket is very different than where they are now. They have a proven track record now, Starships are expected to explode right now because they’re in basic engineering phase, and Starships are also meant to be manufactured en masse for cheap. Even if Starship is a dud, the Falcon 9 is still the best rocket for years to come.", "score": 3, "replies": []}]}]}, {"body": "Got in when it came out as a spac. Love the rocket technology they are advancing. I like the stock.", "score": 12, "replies": []}, {"body": "I have 200 shares because I find what they do interesting. I want 20,000 shares, though, and will be working my way towards that.\n\nProblem for me is, I'm fairly new to investing and don't know if I should take the securities I have now (TSLA, NVDA, PLTR, F, SPYD, SPYG, JEPI, and a few more) and DCA into them, or keep buying into new securities that could prove promising.\n\nThere are so many exciting companies to invest in, so little capital to inject into my portfolio...", "score": 4, "replies": [{"body": "RKLB is such a solid company I would not hesitate to sell many of your current positions and jump into RKLB instead. \n\n\nNVDA and all the others you listed will never be 20-50 baggers at this point in their lives. RKLB will be in 5-10 years. If you're young, and you've made money in those other investments already, I'd jump into RKLB and even consider QS (a potential 100 bagger in 5-10 years).", "score": 2, "replies": [{"body": "Did not age well", "score": 8, "replies": [{"body": "6 months after your post, doubly so. Hope he didn't listen to that guy because he's up more than 100% if he kept that nvidia", "score": 1, "replies": []}]}]}]}, {"body": "Very bullish on rklb. Hang onto it. Seeing more and more companies popping up with space based communication and data networks. 🚀🚀", "score": 4, "replies": [{"body": "Also have to hold out and see how their heavy launch vehicle is going. Supposedly fully reusable, an alternative to papi elons starship", "score": 3, "replies": []}]}, {"body": "RKLB is an incredible company with a solid foundation and path to positive revenue. \n\nI have a little over 7200 shares in them at $3.85 avg\n\nI also own a bunch of AMD, and in recent weeks have started playing around with QS and planning to invest more in them as well.", "score": 9, "replies": []}, {"body": "Same here. Long term holder and happily so.", "score": 10, "replies": []}, {"body": "Yep I'm quite bullish on them, 10K shares currently and no plans to sell any time soon.", "score": 7, "replies": []}, {"body": "Yup, crazy how this hasn't been discovered yet by WSB. Just a matter of time before it blows up", "score": 8, "replies": []}, {"body": "Holding 10k shares , waiting for Neutron.", "score": 8, "replies": []}, {"body": "I've been buy and holding since the SPAC. Most of my shares are post-SPAC. I'm still long RKLB.", "score": 3, "replies": []}, {"body": "Love em. Don't have boat load of shares like some of you do but we buy more regularly and watch the launches every once in a while. They get to space....unlike a lot of the other jerk wads out there trying to pretend they did too when really it was a just a really big jump. *looking at you BO and Virgin*", "score": 3, "replies": []}, {"body": "So I read your post and bought 1000 shares, I am up +40% now in a month...thanks bruh!", "score": 3, "replies": []}, {"body": "Yea sir. 20 net Liq in this. I like it.", "score": 5, "replies": [{"body": "If you think about it it’s the only Spacex competitor. That’s all. They’ve had dinner. It’s all that matters.", "score": 7, "replies": []}]}, {"body": "Shit I hope it goes up. I bought some shares when it was at 14 so I guess I'm in it for the long run...", "score": 7, "replies": []}, {"body": ">RKLB definitely has a lot of potential, but I wouldn't put all my eggs in one basket. The economy is always unpredictable and things could change rapidly. Amazon might not need their services in 10 years if they develop their own technology. There are a lot of variables to consider, but overall RKLB is a good stock to buy into right now.", "score": 6, "replies": []}, {"body": "13200 shares at $4.20 average", "score": 4, "replies": []}, {"body": "I bought RKLP calls mid April based on a post here. Doubled my money, sold on Tuesday. \n\nSold when the price was $6.\n\nI took that money to buy a NVDA 2024 put that’s up $4 so far!", "score": 2, "replies": []}, {"body": "Sure, but buy either stocks or leaps. Anything less is going to be nuked. RKLB isn't on a lot of people's radar right now, but they're legit.", "score": 2, "replies": [{"body": "Agreed. Leaps is all I have", "score": 1, "replies": []}]}, {"body": "You literally provide 0 evidence of this stock being worth more than what it’s trading at.. it already has a 2.75B market cap in a sector overwhelmed by other govt contract giants. I agree it’s getting more attention but to say it’s fundamentals warrant a 100-200$ evaluation is ridiculous at this point. Returns are all negative. Net income is negative. EPS yearly and qoq are negative. Again this could be a turning point but there’s no guarantee and it’s only just started turning around due to the pump we just had in the entire market.. let’s see how it plays out by the end of this year then maybe entertain a longer play on it", "score": 4, "replies": [{"body": "Would you like me to take the post down?", "score": 1, "replies": [{"body": "Do whatever you want to. I don’t like when people put a ticker on a pedestal and then fail to provide any substantial reason for projections", "score": 2, "replies": [{"body": "I honestly don’t care.", "score": 5, "replies": []}]}]}]}, {"body": "Just thought about it. The guy boasting RKLB to the Moon is also betting market goes to the crapper. Does this gamble make sense?", "score": 0, "replies": []}, {"body": "I am highly skeptical, the demand for their products  is unpredictable and also I would not bet against space ex, and Elon.", "score": -4, "replies": []}, {"body": "SPCE🚀", "score": -1, "replies": [{"body": "This didn't age well 🤣 ", "score": 1, "replies": []}]}, {"body": "Fuck no", "score": -6, "replies": [{"body": "Why?", "score": 9, "replies": []}]}, {"body": "It's overpriced right now. I would wait for a dip before buying. Buy on dips, sell on any space news. It's not a stock you want to hold long term. There are many better stocks. Only hold if you're just a big space nut and don't care about making the most of your money", "score": -2, "replies": []}, {"body": "Beck pretends he can fund neutron with 250m \n\nYou have to be a clown to believe that, dilution is inevitable for a product that can’t and wont ever compete with starship\n\nRKLB shills are passionate about their stocks tho so there is regard strength behind it", "score": -2, "replies": [{"body": "Look at the price now fuck face.", "score": 0, "replies": [{"body": "U r such a loser lmao\n\nStill down 70% from ath and you are cheering for gains that every other speculative stocks had in the last 8 weeks ![img](emote|t5_2th52|18630)\n\nGo back to your echo chambers of idiotic shills", "score": 1, "replies": []}]}]}, {"body": "7000k shares at ($10 avg yikes) with a goal of getting to 10k. Long term hold for me. Very confident.", "score": 1, "replies": []}, {"body": "before you buy please watch this video mentioning all the bad things RKLB is doing and why they do not have a future as bright as you might think! [https://youtu.be/VuAKM3gfg58?si=6l-TXXVfSZlek8E8](https://youtu.be/vuakm3gfg58?si=6l-txxvfszlek8e8)", "score": 1, "replies": []}]}
{"title": "Wish me luck🫡 All in $PYPL", "selftext": "", "id": "14b6n21", "created_utc": 1686946050.0, "score": 120, "upvote_ratio": 0.94, "num_comments": 66, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|2 years ago\n**Total Comments**|26|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "If you lose it just open a dispute", "score": 21, "replies": [{"body": "It’s a win win😏", "score": 1, "replies": [{"body": "damn boy show us them gains", "score": 2, "replies": []}]}]}, {"body": "I like how you waited for a 10% rally week to go long.", "score": 39, "replies": [{"body": "Bought them when stock was at $62", "score": 17, "replies": [{"body": "Well, I'm blind & stupid it seems. Gj", "score": 10, "replies": [{"body": "You belong here no worries.", "score": 19, "replies": []}]}, {"body": "Mark this date and my prediction. Remindme! 9 months “PYPL”  \n\nUnfortunately, I hold PYPL stocks since $150 onwards, do not like to take loss now. I have protective puts (strike $65) until Jan 2024.\n\n https://imgur.com/XK5bPW0 \n\nAssuming market peak today (SPX=4448.37), there is a potential chance Tuesday it can exceed this peak. Then, market dives for volatility to touch some low (less than 5% drop). \n\nOnce it touches that low, SPX will peak again above 4448.37 (or Tuesday peak) and that will the last one we see SPX peak of 2023 !\n\nThe second peak may happen within next 30-40 days. You need to sell this call profitably anytime during that time.\n\nIt is nothing to do with PYPL, but market will be going for big correction from here. This is not intuition, but algorithmic prediction, worked past 5 years.", "score": 3, "replies": [{"body": ">Assuming market peak today (SPX=4448.37)  \n>  \n>  \n>  \n>This is not intuition, but algorithmic prediction, worked past 5 years. \n\n![img](emote|t5_2th52|8883)", "score": 3, "replies": []}, {"body": "I will be messaging you in 9 months on [**2024-03-16 21:44:28 UTC**](http://www.wolframalpha.com/input/?i=2024-03-16%2021:44:28%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/14b6n21/wish_me_luck_all_in_pypl/joegez3/?context=3)\n\n[**5 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F14b6n21%2Fwish_me_luck_all_in_pypl%2Fjoegez3%2F%5D%0A%0ARemindMe%21%202024-03-16%2021%3A44%3A28%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2014b6n21)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Uhhh spx goes to 4600 in a month then sells off in September and sky rockets to 5000 by November. As is tradition", "score": 1, "replies": [{"body": "No way ! \n\nSPX came to an extreme position to drop. This is very unique stage in my algorithmic finding comes rarely once in two or three years.\n\nThe drop must be 50% or more which means SPX can touch 2220 level.\n\nImportant: Spx will soon retouch and exceed current peak 4448 ( or Tuesday max ). When it happens that is the final peak for 2023.\n\nPut a reminder for 9 months, if it is not happening ask me!", "score": 1, "replies": []}]}]}, {"body": "I bought at $255.49 so I feel stupid.", "score": 3, "replies": []}, {"body": "And you bought basically ATM at the time... you're too smart to be posting here.", "score": 3, "replies": [{"body": "Thank you my friend, hopefully this is just the start🙏", "score": 3, "replies": [{"body": "What's your current profit?!?!", "score": 1, "replies": [{"body": "About $54k (26.5%)", "score": 3, "replies": [{"body": "What about now?", "score": 2, "replies": [{"body": "About the same, 28% now", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Good job, bro. Been thinking of you today", "score": 2, "replies": []}, {"body": "how long to you think you'll be holding these leaps???", "score": 1, "replies": []}]}]}, {"body": "Jesus I’m hard. Good luck friend.", "score": 5, "replies": [{"body": "Thank you soldier🫡 we’ll see what happens", "score": 1, "replies": [{"body": "What’s your thesis for the long $PYPL?", "score": 1, "replies": [{"body": "his thesis is that it isnt already at the moon so it must be going there", "score": 14, "replies": [{"body": "Elite bull mindset I love it", "score": 3, "replies": []}, {"body": "This right here", "score": 2, "replies": []}]}]}]}]}, {"body": "Have 11 calls for jun 2024. GL TO you", "score": 6, "replies": [{"body": "GL to you also🤝", "score": 2, "replies": []}, {"body": "Is that a good idea", "score": 1, "replies": []}]}, {"body": "God damn boy", "score": 5, "replies": []}, {"body": "I'm up about 35% on my PYPL calls.\n\nI'm riding them out til we hit the $120-135 range.\n\nGlad I caught the bottom properly at about $60", "score": 6, "replies": []}, {"body": "I feel like this play is free money. I’m in!", "score": 6, "replies": [{"body": "Turn the money printers on😛", "score": 1, "replies": []}]}, {"body": "I’m still holding 40 shares I bought at $244 …", "score": 3, "replies": []}, {"body": "Good luck soldier I'm in pypl as well. Not regarded in with an all in but I have enough faith wr will get paid", "score": 5, "replies": [{"body": "I believe🙏", "score": 2, "replies": []}]}, {"body": "I think pypl is oversold but not sure how much fednow will impact its price moving forward", "score": 5, "replies": []}, {"body": "Why not buy some shares…? Paypal could just sideways for a very long time.", "score": 3, "replies": [{"body": "$PYPL to $100 by Q1 2024 dummy", "score": 9, "replies": []}, {"body": "High risk high reward my friend", "score": 4, "replies": []}]}, {"body": "can i have three fitty if this goes up 420%", "score": 3, "replies": [{"body": "Best I can do is tree fiddy", "score": 2, "replies": []}]}, {"body": "When in doubt inverse Cramer it out. I’m all in on this trade too. https://youtu.be/rgMBd1IGnS8", "score": 3, "replies": []}, {"body": "I LOVE THIS MOVE. THIS WILL BE A BIG HIT. NICE YOLO", "score": 2, "replies": [{"body": "YES THIS IS THE ENERGY I NEED RIGHT HERE", "score": 2, "replies": []}]}, {"body": "Dumb amateurs talk about luck. Don't be a dumb, clown, amateur. Be a professional.", "score": 1, "replies": [{"body": "Professionally regarded", "score": 8, "replies": []}]}, {"body": "Have you used Paypal ?? You would sell these in a jiffy if you did. Shit Product and the poor engineering shows. good luck brother.", "score": 1, "replies": [{"body": "Totally disagree. The product is sticky and not getting replaced any time soon.", "score": 1, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "Good luck!", "score": 0, "replies": [{"body": "Thank u🙏🤝", "score": 1, "replies": []}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "I’m regarded", "score": 3, "replies": []}]}, {"body": "Good luck op, it's been 2 rough years. Most of my networth is in another fintech and it's depressing.", "score": 1, "replies": []}, {"body": "I've been considering, but I hate for my nuts to get smashed. That shit sucks.", "score": 1, "replies": []}, {"body": "Why what changed in pypl?", "score": 1, "replies": []}, {"body": "I have YOLO 62$ call for 15.12.2023", "score": 2, "replies": []}, {"body": "This will go 40 soon 📉", "score": 1, "replies": []}, {"body": "What's your target price for pypl leading up to their August earnings?", "score": 1, "replies": []}, {"body": "How much you up so far?", "score": 1, "replies": [{"body": "$22.50 is price now", "score": 1, "replies": [{"body": "Sweet!  Well played.  I just own the shares cost basis in the mid 60s.  Fingers crossed for a good run as long as the Fed keeps interest rates high.", "score": 1, "replies": []}]}]}]}
