{"title": "APPL Earnings [Discussion]", "selftext": "two hours away from figuring out if apple can set a record for profit in a calendar year. I for one am hoping for the apple stock to finally be fair value price (based on P/E), but i know that its a stretch for that large of a jump", "id": "3e3ll7", "created_utc": 1437502683.0, "score": 9, "upvote_ratio": 0.81, "num_comments": 56, "comments": [{"body": "121 AH right now \n\nedit: didn't dare to pull the trigger at $119 when it was dropping like a rock but have a buy open at $120 as of now.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I can't tell you what it will open with - just that I feel confident buying right now at $120. The reason I did not buy before when it was dropping, was because I didn't see the earnings report, but I feel the market is overreacting (as it likes to do with AAPL).", "score": 2, "replies": []}]}]}, {"body": "I'm with you all the way /r/bceagle411, I'm expecting continued success. It cracks me up how Google's earnings success made a lot of investors bullish on Tech and Apple while IBM's lack of success has made people's outlook change overnight, the market and Apple are in the Red today.\n\nI'm sticking with APPL, people will be looking close at the Apple Watch numbers (which won't be impressive) but there is tremendous potential in Apple Pay.", "score": 2, "replies": [{"body": "this is what struck me the most in the forbes article: \"Here’s the hard truth: we don’t know yet whether the Apple Watch will be a success. Apple sold less than 1.4 million iPhones during the first two quarters after its release, and it is today’s most successful electronics product.\"\n\nthe watch has no bearing on earnings yet", "score": 2, "replies": [{"body": "but that was before apple was established in these kind of things, now that apple has its brand, it shouldn't take that long for a new product to be successful, the iPad was a fast hit, and the watch definitely does have a bearing on earnings", "score": 1, "replies": [{"body": "\"Apple Watch sell through was higher than comparable launch periods of original iPhone and iPad.\"\n\n-Tim Cook during today's earnings call", "score": 1, "replies": []}]}]}, {"body": "> It cracks me up how Google's earnings success made a lot of investors bullish on Tech and Apple while IBM's lack of success has made people's outlook change overnight\n\nThat's humans for you. Jumpy critters.", "score": 2, "replies": []}, {"body": "I think the only number that might cause the stock to jump is the computers number.  The watch - meh.  Apple Pay - maybe a couple quarters away.  iPhones - probably about what is estimated.", "score": 1, "replies": []}]}, {"body": "Why is AAPL down right now? I don't see financials released yet.\n\nNevermind, just came out this minute.", "score": 2, "replies": [{"body": "where though? I still can't see any information anywhere", "score": 1, "replies": [{"body": "http://www.wsj.com/articles/apple-earnings-boosted-by-iphone-sales-1437510647?mod=pls_whats_news_us_business_f\n\nhttp://forums.macrumors.com/threads/apple-reports-q3-2015-earnings-of-10-7b-on-49-6b-revenue-47-5m-iphones-10-9m-ipads-4-8m-macs.1902406/", "score": 2, "replies": []}]}, {"body": "Because Apple's watch is a failure.", "score": -7, "replies": [{"body": "Considering Watch revenue was not disclosed, where are you getting your information?", "score": 2, "replies": [{"body": "Internet, observing people, public opinion. \n\nI haven't seen a single person with an iWatch yet. How many have you seen? Everyone I know wants a GoPro. \n\nYou can buy an Android watch for like $100. The iWatches are way overpriced. Not everyone even likes watches, people that do don't really want to spend that money on a digital watch.\n\nI work in the tech industry. All my friends and co-workers aren't even high on the watch. Check Reddit technology threads about the watch. It has overwhelmingly bad reviews.", "score": -5, "replies": [{"body": "You are confusing your limited experience with tangible information. \n\nWhile your experience is definitely important from your own investment point of view, the world view of one person is nowhere near enough to claim a company's product is a \"failure\" full stop. ", "score": 6, "replies": [{"body": "Here you go:\n\nhttp://www.cnbc.com/2015/07/08/apple-watch-online-sales-plunge-90-in-us-report.html", "score": -4, "replies": []}]}]}]}]}]}, {"body": "Out of curiosity, why is their P/E so low?", "score": 2, "replies": [{"body": "Unprecedented amount of profit for a company with that big of a market cap. People are thinking it's got little room for growth due to economy of scale so people are a bit more cautious. Both sides are right in that they are huge, but they are also extremely profitable like no company has ever been.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "Doesn't make sense to me but the market doesn't have to make sense. They beat EPS and still drop... I expected the phone to be a joke but didn't expect the run up to the 130's to be due to the Watch. C'est La Vie", "score": 1, "replies": [{"body": "Lower guidance and Watch didn't do well. I think there was some expectation that the watch would be a new, great post-Jobs source of profit for the company, which doesn't look great right now. Not saying the Watch is bad or a failure, just seems like people were expecting it to be on within the same magnitude of an iPhone, which is/was unrealistic.  ", "score": 1, "replies": []}, {"body": "I don't understand this - it beat earnings and revenue estimates. the only thing it didn't beat is sales targets for specific items, but was within 10% of those projections.\n\nHow does a stock fall 8% after posting a quarter like that? Some companies gain simply by meeting earnings expectations. Plus add in all the other metrics in AAPL's favor as a profitable company....it makes no sense....(I am somewhat of a novice investor)", "score": 1, "replies": [{"body": "DJ Quik > Dre... All Day\n\nAnd it dropped because the future outlook changed. People don't just buy stocks for now, they buy for the future. And that future is different without the watch flying off the shelves.", "score": 3, "replies": [{"body": "Quik all day! Seriously though, I thought Watch numbers weren't even released? ", "score": 1, "replies": []}]}, {"body": "> it beat earnings and revenue estimates\n\nThe market is a forward-looking beast. It's something that all investors must learn. Apple lowered guidance.", "score": 1, "replies": [{"body": "How come when other companies beat earnings and revenue estimates the stock goes up?", "score": 0, "replies": []}]}]}]}, {"body": "The big question, sell or not to sell at current price? Will it go up after opening bell or go further down? Should i set a 'stop on quote'? kinda freaking out here...help please. ", "score": 1, "replies": [{"body": "Sit on it. They had great earnings, the company's in no threat of failing in the next few years. The price'll be up eventually.\n\nIf you're talking options, well, take whatever you can get. ", "score": 1, "replies": [{"body": "What do you mean by options? \nAs of now I have it set to 'stop on quote' at 129$. I figure of it falls further than that, I can buy more for a lower price and hope it'll go up again. ", "score": 1, "replies": [{"body": "If you don't know what I mean by options, then don't worry about it :) separate kind of trading from stock.\n\nApple's currently trading at 121 after hours, and it's very likely it'll open around 120, so your current setting is a terrible idea. Unless you think Apple's going to continue to fall and never recover, which is pretty much impossible, you should cancel your sell order and sit and wait for it to bounce back up. ", "score": 1, "replies": [{"body": "Oh God... I'm gonna lose so much money! Thank you for your advice, any thing else I should know? I mean, WHY THE HELL DID THIS HAPPEN?? They reported record numbers! Except 3 million iPhones below predictions, is that really necessary for dropping a stock 10 points? I just don't get it.", "score": 1, "replies": [{"body": "130 --> 120 isn't THAT much loss. Less than 10%. People trading options contracts on Apple likely lost all their money, straight to 0, and their contracts expire in a few days. You get to hold the stock until it recovers!\n\nApple's the \"biggest\" company in the world, and it regularly beats expectations. People expect every report to be legendary, and when anything is even a little amiss, people sell high, then people panic sell, causing it to plummet. \n\nIBM didn't meet expectations, which cast a pall on the tech market. The post-coital glow of Netflix and Google was erased by IBM's falter, right before Apple. \n\nApple was also up quite a bit in anticipation of earnings, so you could argue the next day or two will \"correct\" back to what its value should be. \n\nBut ultimately, my opinion would be: don't sell. You have shares of Apple, which as you said just had a pretty good report. It'll go up eventually. Next time you can sell prior to earnings and buy in the dip afterward.\n\n(People buying in the dip afterword may also cause the price to recover a fair bit tomorrow)...", "score": 2, "replies": [{"body": "Awesome! Thank you very much fellow redditor! I really do appreciate your help! ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I sold it at $124.5, took a ~$750 loss", "score": -1, "replies": [{"body": "i cant afford that loss, ive decided to keep it. and lets see when it'll go up. I'm sorry to hear you had to go for a loss. its really a shame. goddamn skittish investors. ", "score": 1, "replies": [{"body": "Yeah its my biggest loss until now, however, I shorted SNDK stock since I'm pretty sure it'll take a massive hit especially that people are taking their money out of technology sector right now. If everything goes as planned, I'll make up for my loss the same day.", "score": 1, "replies": []}]}]}]}, {"body": "AAPL has been in a channel for over 6 months. Breaking out of it might be harder than it looks, so I dont expect it to go higher, probably drop into 120s. Some predict even 110s, but I'm not that skeptical. Time will tell", "score": 1, "replies": []}, {"body": "Already recovered to 124.50$ today", "score": 1, "replies": []}, {"body": "BUY AT 120! Gains in past week or two have been normalization, not just pre-earnings hype. This drop has been, as usual, a negative reaction to a few earnings numbers, which are somewhat subjective reactions. The numbers are still absurd! 200 BILLION CASH, rev% increases, year/year % increases, etc. are still SO healthy.\n\nAlso... hype machine letdown, drop to 120, buybuybuy, price goes back up, normalizes, and potentially makes gains once iWatch is detailed further and the MARKET, those who simply own Apple and react on price, recognize the significance of the massive #'s.\n\nIMO, it's a buy, but not for long. It will go back up. 120 billion left in buyback program, 80+ billion remaining cash post buyback. not including rev% growth. Q3 is typically slower and to think they can predict perfectly is bogus; contrast b/t outsider expectations, inside expectations, and results, create the hype machine that is insanely reactionary but not too logical in the after-hours post-release.\n\nTLDR; BARGAIN BOUTIQUE RIGHT HERE LADIES AND GENTLEMAN!", "score": 1, "replies": [{"body": "agreed, it does look like a bit of a buying opportunity right now", "score": 1, "replies": []}]}, {"body": "I bought the stock yesterday at $132 thinking that AAPL will destroy expectations, which it did, and now I'm at a HUGE loss. I don't understand it! why were YHOO, CMG and MSFT reaction to earnings better than AAPL ALTHOUGH AAPL had the best numbers ??? I hate this market that is driven by rich old farts.", "score": 1, "replies": [{"body": "My guess? IBM spooked everyone, then Apple didn't give the bigger traders the answers they wanted (China, the Watch, etc.) ", "score": 2, "replies": [{"body": "Are those traders kids or something? ", "score": 1, "replies": [{"body": "A group of people who have millions if not billions in personal wealth, and whose only purpose in life is to acquire more for the sake of having more?\n\nHmmm.", "score": 2, "replies": []}]}]}, {"body": "I wouldn't have bought it at a level that it tried to break through for many many weeks and many times. Now, you should have bought it at 119. AAPL's a weird stock. I bought it on 130.5 on the Q1 earnings thinking it would go way up, but I learned this time that people have way too high expectations of AAPL.", "score": 1, "replies": [{"body": "I've read somewhere (Unfortunately after I bought it at the damn $132 price) that when it comes to AAPL, people look at how much did it beat the estimates rather than whether it beat it or not. So its on freakin two level of expectations :/", "score": 1, "replies": []}]}]}, {"body": "Don't see how nobody expected this... Watch sales slump 90% since launch and the only product moving units is the lowest priced one.\n\nThe whole hype train into the 120s-130s was due to the watch. ", "score": -3, "replies": [{"body": "This was according to Slice Intelligence. Look at their methodology - an opt in program with very questionable metrics. Their sample size is a maximum of 2 million people and all theyre doing is scanning emails. Compare actual data with what they've said in the past and you'll understand that the 90% figure constantly touted might not be entirely true.", "score": 3, "replies": [{"body": "Well they were certainly close enough to the mark. It's a given that it wouldn't be 100% accurate unless they get figures directly from Apple. Main takeaway though is that market has spoken and Gen 1 is almost worthless for all intents and purposes. Gen 2 likely be a different story once they make it more than basically just a reason not pull your phone out of the pocket... And knowing Apple, that's probably only a few months from release. <-- Joke obviously, kind of", "score": -2, "replies": [{"body": "\nCook also pointed out that Apple Watch sales during its first nine weeks of availability were higher than sales of the original iPad and iPhone when those devices first became available for sale. **June sales, he said, were higher than those in April or May, suggesting reports of falling demand in June were inaccurate.**\n\nI wouldn't call the data that Slice spat out anything near statistically significant. Of course if it was an accurate and random sample of 2 million Americans, I'd pay more attention to it. \n\n\"**Slice does not have access to Apple's email receipts, uses only those people who have agreed to use their App (read self-selected participants)**, and is limited to only the US market which represents only 38% of the Apple Watch revenue, if they even have any usable data. \"\n\nAny data != good data", "score": 2, "replies": []}]}]}, {"body": "do you see the p/e though? i mean the whole stock is not just P/E but still, its very \"cheap\" relative to the actual earnings it produces", "score": 2, "replies": [{"body": "Yup P/E is low, but it still moves largely on hype throughout the quarter. ER always helps to ground it back to reality.\n\nIf you want to buy-in then next couple days is best bet, otherwise month or two down the line it'll be priced out of reality once again.", "score": 1, "replies": []}, {"body": "You gotta look at the peg for a name like this. How much growth in next five years? You might still get growth in the emerging markets especially in China but look at what they posted this quarter. They also need to \"invent\" a brand new category to drive growth and the watch was suppose to be it. I personally think they need to either return the cash or step up share repo.", "score": 1, "replies": []}]}]}, {"body": "Turds.", "score": 0, "replies": []}, {"body": "Boom. Another week like this and GOOG will be bigger than AAPL.", "score": -3, "replies": [{"body": "They still have quite a ways to go. ", "score": 4, "replies": []}]}]}
