{"title": "Carl Icahn amassed a Twitter stake worth over $500 million in the past few months and made a $250 million profit yesterday", "selftext": "Activist investor Carl Icahn amassed a Twitter stake worth more than $500 million in the past few months and made a sizable profit on Tuesday after Elon Musk proposed to go ahead with his takeover of the social media platform, the Wall Street Journal reported.\n\nTwitter shares jumped more than 22 per cent to end at $52.00 on Tuesday, after a securities filing showed Musk intends to go ahead with his April offer of $44 billion to take the company private, signaling an end to a legal battle that could have forced Musk to pay up.\n\nIcahn paid in the mid-$30s a share for the stake, the report said, citing people familiar with the matter. The estimated profit for Icahn Enterprises LP could exceed $250 million, it added.\n\nIcahn made the investment on the belief that Tesla Inc chief Musk wouldn't go through a trial that he looked likely to lose, the report said. He also believed that the stock was worth close to the mid-$30s in the long term.\n\nOther investors, including D.E. Shaw Group and Daniel Loeb's Third Point LLC, also placed bets on Twitter shares in recent months and could make sizable gains as well, according to the report.\n\nSource: [https://www.wsj.com/articles/icahn-others-clean-up-on-musk-s-twitter-about-face-11664926249](https://www.wsj.com/articles/icahn-others-clean-up-on-musk-s-twitter-about-face-11664926249)\n\nCarl Icahn made a $250 million profit yesterday after purchasing Twitter (TWTR) shares worth over $500 million months ago, betted Elon Musk will end up buying TWTR one way or another. TWTR rallied 22% yesterday after Musk revived the buyout deal. Did you also think Musk will eventually buy TWTR same view as Icahn?", "id": "xw95vx", "created_utc": 1664972427.0, "score": 464, "upvote_ratio": 0.97, "num_comments": 89, "comments": [{"body": "Step 1. Have $500 million", "score": 213, "replies": [{"body": "Step 2. Have insider information", "score": 118, "replies": [{"body": "Tbf the \"insider information\" was that Musk is still bound by contracts like anyone else.", "score": 67, "replies": []}, {"body": "It was a pretty obvious play if you were barely versed in deleware corporate law which Icahn may not be but he definitely has people that are", "score": 13, "replies": []}, {"body": "Step 3. Take pennies from the richest man in the world", "score": 14, "replies": [{"body": "lol you dont understand how it works at *all*", "score": 6, "replies": [{"body": "Technically, if Elon buys and the shares are privatized then it's correct, Elon will pay for the $250M profit.", "score": 6, "replies": [{"body": "if elon buys carl’s shares then that’s exactly what happens", "score": 6, "replies": []}, {"body": "its not taking anything from elon that he wasnt already going to give literally anyone else. he profited off the people who sold their stock underpriced vs its final sales price. elon was paying the same amount regardless. icahn will technically receive payment from elon but in reality the profit came from the people who sold icahn their stock.", "score": 1, "replies": [{"body": "Those people would have sold their stocks at a lower price to someone else.", "score": 1, "replies": []}]}]}, {"body": "U do?", "score": 1, "replies": []}, {"body": "I don’t think you understand how it works lmaoooo", "score": -2, "replies": [{"body": "elon was paying same amount regardless. icahn is not getting one over on elon by getting paid what elon already agreed to pay per share. icahn really profited from the people who sold their stock at a discount.", "score": 1, "replies": [{"body": "no. icahn hasn’t sold yet. Elon will buy Twitter and since Icahn owns part of twitter he may sell his shares to Elon.  That’s literally taking money from Elon. No one said he is getting one over on Elon? He made a bet and it’s paying off and as I said it’s pennies to Musk.", "score": 1, "replies": []}, {"body": "just to give you a lesson on the stock market that you know all about. if someone is buying a company or stock in a company. someone else has to be selling those shares to them. Elon has to buy the company/shares from shareholders. Carl is a shareholder", "score": 1, "replies": [{"body": "ok question: If Icahn was taking a loss on the trade would you still make the same statement ‘he is taking elons pennies…’? or was your original statement not in regards to him profiting but in regards to the technical transaction of stock for cash?", "score": 1, "replies": [{"body": "Icahn literally can’t take a loss if the deal goes through. Technically he hasn’t gained or lost anything yet but if the deal is court ordered to go through. Icahn is taking Elon’s money because he bought under deal value and is going to sell at Elon’s $54 price. I never said he one upped him or outsmarted him.", "score": 1, "replies": [{"body": "you didnt answer my question", "score": 1, "replies": [{"body": "the question is impossible and irrelevant. *if the deal is court ordered to close* then Icahn will have technically taken money from Musk. that is exactly how it works. the profit was handed to Icahn from Musk", "score": 1, "replies": [{"body": "the question is neither impossible or irrelevant.", "score": 1, "replies": [{"body": "in the hypothetical that elon musk is court ordered to buy twitter then yes it is", "score": 1, "replies": [{"body": "musk is buying it. it wont be court ordered because musk has come out and said he is moving forward with purchase. who cares about the court ordered part? The question is whether you would say icahn was still “taking elons money” even if icahn had theoretically purchased the stock for higher than the bid and was losing money on the trade. He would still be “taking elons money” in that case, correct? because how much icahn made or lost on the trade matters not to your original statement. That icahn was taking pennies from elon. You said he is technically receiving the payment from elon, which is true. My question is whether you would have said that in response to the theoretical situation of icahn making a loss on the trade (aka if he had bought higher at like $50/share). He would still be “taking Elons pennies” from your perspective, yes? My point from the get go was that the profit was not coming from Elon, but rather from the price he purchased the stock at. If Icahn had theoretically made a loss on the trade, in reality you would not have said he was taking Elons pennies. Also, for all we know, Icahn believes the shares are worth more and doesnt wanna sell but is forced to by Elon following through.", "score": 1, "replies": [{"body": "If Elon purchases Icahn’s shares then *that is literally the profit coming from Elon* - common sense he profited because he bought low and arbitraged. The money still comes from Elon.", "score": 1, "replies": [{"body": "If it were a loss, would the loss come from Elon as well?", "score": 1, "replies": [{"body": "A loss isn’t tangible. How could something that doesn’t exist come from Elon. The some money that he would get back would come from Elon, *obviously*.", "score": 0, "replies": [{"body": "And he would still be “taking pennies from Elon” in this context correct? Because regardless of how much he paid for it, Elon is paying him the same amount for X amount of shares, correct? \n\nSo you believe in one sense that Icahn’s profit on the trade is *coming from Elon*. \n\nAnd you believe losses don’t exist (simply stunning).\n\nSo if Icahn had a *loss* on the trade you would *certainly* not say that Icahn’s loss came from Elon, correct? (You would be correct)", "score": 1, "replies": [{"body": "Well if he’s at a loss then he is technically collecting his remaining investment from Elon, yes. Elon would be who is paying him.", "score": 0, "replies": [{"body": "I know who is paying who. Who is paying who tells us nothing. It’s a simple exchange. \n\n\nYou keep not answering the basic and easy questions. I’ll attempt to say it differently. If the trade were for a loss, would you say Elon was taking Icahn’s money? \n\nNo, right? \n\nSo therefore a profitable trade by Icahn does not result in him “taking” money from Elon unless you mean it in the most literal sense that the actual money is being paid out by Elon, and in which case the statement he is “taking pennies from Elon” would apply equally and therefore meaninglessly to the same situation if it were an actual loss for Icahn. Because he would literally still be “taking pennies from Elon” the same way someone “takes” money from the bank. So either you make meaninglessly banal statements on the internet as a matter of habit that waste every persons time for having read, or you don’t understand the nature of profits, losses, trading etc. Because in the non-banally literate way, Icahn is *not* taking Elon’s money because Icahn purchased a stock for cheaper than Elon is going to pay for it. \n\nThe examples could go on and on. For instance, the stock price has already shot up. What if Icahn sells now? Is he taking money from xyz investors who bought the shares from him? lol. No, if he’s made money off anyone in this situation, its off the people who sold it to him. But then by your logic they were taking his money lol because they literally received “his” money.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Step 2. Have an extra $100k to hire the best lawyers in Delaware to tell you the odds of the deal being found valid.", "score": 1, "replies": []}]}, {"body": "Did he sell though ??", "score": 2, "replies": []}]}, {"body": "It's a damn near certainty that TWTR approached Icahn as [White Knight](https://www.latimes.com/archives/la-xpm-1986-11-26-fi-15513-story.html) insurance.\n\nFriendly reminder to the members of the Fraud Squad in this thread: if you don't understand something you see in the financial news, it doesn't automatically presume that what is happening is illegal.", "score": 38, "replies": []}, {"body": "Congrats?\n\nHe took a gamble and it paid off.  There could have been a settlement for a lower amount.  Could have been an unexpected ruling to help him get out of it.  Could have been an extended legal fight so that even if Musk paid up your money could be tied up for a long time. Etc.", "score": 6, "replies": [{"body": "A voice of reason…retail investors also conduct a post-mortem of a trade and kick themselves for not taking a chance which in their minds no longer reflects a range of possible outcomes, but a near certainty and easy money. He took a gamble is right…", "score": 3, "replies": []}]}, {"body": "Carl Ichan has been around forever.  He is 86 years old.  \n\nNot many 86 year olds place $500 million bets in the stock market.", "score": 17, "replies": [{"body": "Too be fair, not many 86 year olds have $500 million.", "score": 4, "replies": [{"body": "My Uncle Bob has a huge bucket full of pennies in his basement.  Probably not $500 million worth though.  LOL", "score": 4, "replies": []}]}, {"body": "$500mm is what about 3% of $18bn (Icahn's net worth)\n\nWhat % of total net assets were being put on the line by redditors during COVID and the RH boom?\n\nProbably more than 3%.", "score": 2, "replies": [{"body": "My point was that most 86 year old are sitting in rocking chairs.  Ichan is a very wild old dude to be playing Twitter poker with $500 million.   LOL", "score": 1, "replies": []}]}]}, {"body": "Dudes the real deal. Sharing the wealth with everyone that holds IEP.", "score": 8, "replies": [{"body": "How do it looks like if you bought 5 years ago and been holding you wouldn’t have made much.", "score": 1, "replies": [{"body": "It is incredibly solid and does exactly what you want it too...It's for income. It pays a ton in distributions and it's an MLP somehow so eventually your taxed at 0.", "score": 2, "replies": []}, {"body": "The dividend is 15% at the moment, but has always been over 12%. That's cash money in my account, compounding for as long as I want, without selling a thing. \n\nI mean sure there are plenty of \"growth\" stocks that showed better performance over the past few years, on paper. This year has been absolute murder and plenty of people are in for a net loss on big tech names, again on paper. I'd rather just take the cash, thanks.\n\nRemember the rule of 72. Divide 72 by your rate of return, and that's approximately how many years it will take to double your money. So, unless my math is horribly flawed it will take 5-7 years to double my IEP position, another 5-7 to double again, etc. These news items can only boost the share price which is a bonus I guess. \n\nThis year IEP printed enough cash for me to pay the rent with it, if I wanted. Paper gains are great and make me feel like a genius, but paper gains don't pay the rent.", "score": 2, "replies": []}]}, {"body": "Somewhat… stock’s been up and down.", "score": 1, "replies": []}]}, {"body": "Talk about insider trading", "score": 30, "replies": [{"body": "How is that insider trading…?", "score": 22, "replies": [{"body": "People are assuming he had some insider knowledge that the deal would go thru at the original price. There’s probably no hard evidence at this point, but seems like reasonable speculation that all these billionaires are in bed with each other, exchanging info that makes them even richer that us plebs will never have access to.", "score": 9, "replies": [{"body": "Lol, you guys gotta step into the real world of how these dudes operate. They have the best access to lawyers, accountants, corporate finance personnel, etc., They knew the likelihood that Musk could prove a material adverse effect caused by the % of spam bots would be difficult to do. \n\nNot everything is insider knowledge. I also purchased some shares around $38. Plenty of people bought ATVI and the price of it has stayed relatively consistent as they await the MSFT purchase to go through of which I bet the stock will rise in anticipation of that date. \n\nThe dude has the money, access to info (knowing that Delaware's legal system has never allowed a verdict based on material adverse effect under the ordinary course of business of a buyout), and did what many people have done with previous companies when a company is about to get bought out....", "score": 8, "replies": []}, {"body": "That is absolutely the case. If people don’t believe that billionaires are out there making connections and talking amongst themselves then those people are beyond naive. This obviously also happens between CEOs all. The. Time.  I’ve seen it happen more times than I can count. C suite types getting the low down that’s not out there for public consumption, placing big bets on the stock, and then low and behold they make a crap ton of money. My guess is that insider trading and info disbursement between CEOs and similar, including billionaires and multi millionaires, happens so often that it’s the norm for them vs not. It’s rampant and is definitely happening in the government as well.", "score": 2, "replies": [{"body": "Or, he knew that Delware's legal system has never sided with the purchasing party in a buyout involving material adverse effect and that the likelihood that Musk would be forced to pay would be high so in anticipation of the court proceeding, it was highly likely he was going to make a profit.\n\nStep into the real world, man. These dudes have access to the absolute best people in their respective field. Not everything involves insider-trading. This certainly doesn't. Are you insider trading if you bought ATVI knowing that the MSFT acquisition is likely to close? They just have more capital to risk but you'd probably do the same.", "score": 6, "replies": [{"body": "I live the real world day and day out - insider trading and dissemination of insider information within the millionaire and billionaire networks is rampant.  That’s the absolute truth and reality. You are a moron if you don’t think this guy had more to go from other than a historical hunch with $500MM at stake.", "score": 4, "replies": [{"body": "No one is disputing that insider trading doesn't happen.\n\nI'm disputing the fact that you think every billionaire who makes a sound business investment must be doing so based on insider info.\n\nYou don't need insider info for this. You're a moron for thinking that you do. It's not about historical hunch. It's about having access to the best corporate lawyers and asking if they think Elon has a case. Almost every single one would probably tell you no based on how Delaware has handled these cases in the past. Maybe update your knowledge on how things work and just stop resorting to generalities.", "score": 4, "replies": []}, {"body": "Yep what they put Martha Stewart in jail for happens every fuckin day on WallStreet", "score": 2, "replies": []}, {"body": "You don't live in the real world. This comment proves it.", "score": -1, "replies": []}]}]}]}]}, {"body": "You think guys are just throwing $500 million dollar buys down that are pretty much a guaranteed loser unless Elon bought twitter but didn’t have any information to base it on? No.", "score": -3, "replies": [{"body": "Musk was either going to buy Twitter or give them a billion. Despite his tantrum he isn't above legally binding contracts.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "I wouldn’t call 1/30th of your entire net worth “pennies”.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "It's like making a few thousand bucks on a trade as a middle class six figure earner. Percentage wise it's not a big deal but damn...I can't imagine managing that much capital. So much cash that $250M gain is mere percentages.", "score": 3, "replies": []}]}, {"body": "um... yeah, lately 1/30th of my worth feels like pennies.", "score": 0, "replies": [{"body": "Jokes aside, I imagine you are worth more than $30", "score": 1, "replies": []}]}]}, {"body": "1/34 of your networth isn't pennies.", "score": -1, "replies": [{"body": "When you're worth 17 billion it is pennies considering you could lose 33/34ths of that number and experience zero change in lifestyle.", "score": 0, "replies": [{"body": "1/34th of 1 million is around $30k. I would hardly call that pennies. Plus, a lot of their 'networth' is tied to investments. It's not pure cash. After liquidating their investments, they would likely end up with less than what their networth states just because of how depressed the asset would be if the investments were unloaded all at once.", "score": -1, "replies": [{"body": "But we aren't talking about 1 million, we're talking about 17 billion.", "score": 0, "replies": [{"body": "You honestly think $500 million is pennies? That's the entire budget of some small cities. It doesn't matter if you're a billionaire or not. If you had $17 billion, I highly doubt you would consider $500 million 'pennies.'", "score": -1, "replies": []}]}]}]}]}]}]}]}, {"body": "Yup. It’s all shit", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "Anyone could have bought shares. Icahn happen to buy a lot of them from willing sellers.", "score": 20, "replies": [{"body": "Love Icahn, good for him!!", "score": -1, "replies": []}, {"body": "This is this is why market manipulation is prohibited. If there was coordination, Icahn would be buying with a lot more certainty than “anyone” else. The average investor would have to price in any risk that exists in a free market, Icahn may not be investing in a free market.", "score": 1, "replies": []}]}, {"body": "In what sense is this coordinated?", "score": 4, "replies": []}]}, {"body": "What are the tax implications of this, in terms of short term vs long term capital gains? If you don’t want to sell for short term, but you have to because of a buyout…?", "score": 3, "replies": [{"body": "Depends on what the consideration mix Icahn receives - cash (taxable event) or TSLA stock (non-taxable event)", "score": 0, "replies": [{"body": "Is that an actual reality? Him receiving TSLA stock??", "score": 1, "replies": [{"body": "F", "score": 1, "replies": []}, {"body": "No. Tesla holders wouldn't approve of this because Twitter is a separate company and this isn't a Tesla buyout - it's Musk's own personal dealing. It wouldn't make any sense for Tesla investors to want to dilute themselves for Twitter.", "score": 1, "replies": [{"body": "Exactly so not sure if the guy was joking or serious", "score": 1, "replies": []}]}]}]}]}, {"body": "i wonder how many stocks Elon bought at a discount thanks to making 1 or 2 tweets but he isn't making market manipulation apparently ...", "score": 3, "replies": []}, {"body": "Hahah ahhhh “activist”.", "score": 1, "replies": []}, {"body": "The rich get richer baby.", "score": 1, "replies": []}, {"body": "Nothing to see here.. move on", "score": 1, "replies": []}, {"body": "Unrealized lol", "score": 1, "replies": []}, {"body": "Beast mode", "score": 1, "replies": []}, {"body": "I wondered who had been doing that", "score": 1, "replies": []}, {"body": "Curiosity as to what this 250 million is taxed at?", "score": 1, "replies": []}, {"body": "Uncle Carl knows the game.... $IEP\n\n🎼  If I had (500) million dollars  🎶\n\nWe wouldn't have to eat Kraft Dinner", "score": 1, "replies": []}, {"body": "These people all congregate in the same places. Places so expensive it's considered loitering for anyone else to step foot in. It really is a club. If your in the club you can simply do whatever the fuck on earth you want with no repercussions for the most part.", "score": 1, "replies": []}, {"body": "I’m pretty happy with my 3 shares, but I mean I guess $500 million is cool. 😂\n\nIn before “UN checks out”", "score": 1, "replies": []}, {"body": "Google Hertz, you win some, you loose a lot...", "score": 1, "replies": []}, {"body": "I smell insider infomation", "score": 1, "replies": []}]}
