{"title": "Meta is probably going to take off.", "selftext": "Dude I just watched that video by MKBHD and I had no idea the Metaverse had such good augmented reality capabilities. When he showed the virtual 3 desktop thing it just kind of clicked in my head.\n\nI know it would be pretty intense as far as bandwidth, but imagine being able to work remotely on videos, photos, media, or software development from a headset and a keyboard? That would be so dope dude. \n\nI know we're heading into a recession, but I really do think that the Metaverse is going to be a thing. Mark just sucks at presenting, he's like Alex karp. All they need is the right hype man and I bet it takes off.\n\nEdit: the post has 38% upvotes, so that means it's a great idea. Meta will probably 2x by the end of the year.", "id": "yhnwst", "created_utc": 1667159116.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|88|**First Seen In WSB**|1 year ago\n**Total Comments**|2109|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/lkujx7/amd_strong_upside_for_this_week/) [x](https://www.reddit.com/r/wallstreetbets/comments/lb6qjk/what_nobody_is_telling_you_about_investing_life/) \n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=yhnwst)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=yhnwst)", "score": 1, "replies": []}, {"body": "Meta bagholder spottet", "score": 107, "replies": [{"body": "OP bought at $300 🤣", "score": 39, "replies": [{"body": "He bought Jan 2023 $500 calls", "score": 14, "replies": [{"body": "![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 0, "replies": []}]}]}, {"body": "Meta VR headset holder spotted (that shit heavier than a bag)", "score": 5, "replies": [{"body": "How else are going to train to headbutt the shit out of the Zuck?", "score": 2, "replies": []}]}]}, {"body": "Horrible DD", "score": 39, "replies": [{"body": "It’s dope though.", "score": 5, "replies": [{"body": "Dope is actually better for you than strapping a apparatus on your noggin for 12 hours a day", "score": 18, "replies": [{"body": "Hahahah", "score": 1, "replies": [{"body": "^---obviously prefers dope to metaverse.", "score": 0, "replies": [{"body": "I think the correct way to put its only Dopes live in the Metaverse ;-)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I can’t for one second believe you’re serious with your fake enthusiasm for working on documents with a headset … \n\nfuck out of here", "score": 17, "replies": []}, {"body": "“Meta is probably going to take off”\n\nInto your butt without lube", "score": 43, "replies": [{"body": "Lmao", "score": 1, "replies": []}]}, {"body": "No one cares.", "score": 25, "replies": [{"body": "Yup, but I have to agree that if say, you mom starts using a headset to watch her shows or chat with her book club or whatever it can take off. The tech is cool but its not accepted by the average joe.", "score": 0, "replies": [{"body": "yo mama so fat, she turned VR into AR", "score": 7, "replies": []}, {"body": "Those Meta VR headsets cost $1500 each.  So mom won't buy into this anytime soon.\n\nAlso, it's official, Meta is a Disaster https://nymag.com/intelligencer/2022/10/meta-earnings-company-formerly-known-as-facebook-is-a-mess.html", "score": 3, "replies": [{"body": "A basic head set does not cost that much, but yes its still a mess.", "score": 0, "replies": []}]}]}]}, {"body": "Cant reach for, or drink coffee with a stupid headset. Is a nogo", "score": 10, "replies": [{"body": "Not true.  You can get a virtual coffee, and it'll be half the price of a Starbucks coffee.", "score": 18, "replies": [{"body": "Attach a tracker to your coffee cup.", "score": 2, "replies": []}, {"body": "Coffee nft", "score": 2, "replies": []}, {"body": "Also 0 calories.  Huge pro for the health / diet crowd 😂😂", "score": 2, "replies": []}, {"body": "Will be better tasting too!", "score": 1, "replies": []}]}]}, {"body": "Headset motion sickness or whatever is called. No one will use this for long periods. Hardware to big. Make that, small glasses and maybe.", "score": 9, "replies": [{"body": "They equipment is also pretty pricey", "score": 6, "replies": []}]}, {"body": "Well Cramer said he was wrong about Meta so it’s pretty much set in stone that it’ll run, at this point lol", "score": 12, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "At least Tom didn’t want us all to be cyborgs with goggles on our face all day to escape reality into an illusional world", "score": 5, "replies": [{"body": "Tom is still waiting for us in the friend zone.", "score": 1, "replies": []}]}]}, {"body": "It will be fun once the Mverse achieves a modern video game level of graphics-with suitable haptic attachments. *The dudes know what I'm talkin' about.*", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "It wasn’t clear to me watching if that was METAs technology or if he was just highlighting what’s possible.\n\nAlso, like 25% of people get nauseous", "score": 2, "replies": []}, {"body": "$META may be $50 next year. And I'll buy the SHIT out of it. I personally believe in the long run the zuck will make it out alright and everyone will be kissing his pp and saying they believed in him all along.", "score": 2, "replies": []}, {"body": "The world’s most valuable race horse (Flightline) will be auctioned off next month using the Metaverse platform. \n \nFrom Thoroughbred Daily News - “The auction will be conducted with a first-of-its-kind Metaverse experience which intends to replicate the excitement of the November Sale. This user-friendly virtual experience is hosted on Spatial and accessible via Oculus headset, desktop computer, or mobile phone. Participants will have a front-row seat in a virtual sales ring modeled after Keeneland's and will also have the opportunity to learn about Lane's End, Keeneland and the Thoroughbred industry through a series of pre-event activations.”", "score": 2, "replies": []}, {"body": "Funny. I think META will do well in the long run, too. \n\nBut when stock-investing, this description kind of gives all the wrong reasons to invest into something.", "score": 2, "replies": []}, {"body": "Meta will be a good buy at 55", "score": 3, "replies": []}, {"body": "TL:DR imagine working remote using a smaller screen infront of your eyes and a virtual keyboard instead of the other keyboard and screen. YAAAAAAAAAAAAAAAAAAAAAYYYYYY META TO THE MOOOOOOOOOOOOOOOON", "score": 2, "replies": []}, {"body": "No one on here knows how to read a F statement. META makes more more than Amazon and has a P/E of 7. This is with its burn rate. META is not going anywhere and still one of the worlds most profitable companies with over 3 billion users. Would never overestimate them. People did this to Steve Jobs and he literally built the biggest cash cow.", "score": 2, "replies": []}, {"body": "Why use the meta verse when real life exists", "score": 1, "replies": []}, {"body": "It’s totally the future. It’s just gotta be done correctly. Basically by the right aliens. Zuckerbergs a freaking lizard. You need thumbs.", "score": 2, "replies": []}, {"body": "Augmented reality is the near future. Not sure if virtual reality will come to fruition.", "score": 1, "replies": [{"body": "Virtual reality will just be a fad, you’re right about AR though. Why live in the world of make believe when we can inject make believe into the real world", "score": 1, "replies": []}]}, {"body": "If they provided the goggles for free it would be huge.", "score": 1, "replies": []}, {"body": "I love watching MKBHD videos", "score": 1, "replies": []}, {"body": "R labs needs significant downscaling in funding, esp before a recession. That said, I wouldn't discount Zucc just yet. He needs to invest more in AI/AR and not VR.", "score": 1, "replies": []}, {"body": "Someone just posted here that Meta would be sub $50 next year.  \n\nNow I’m confused.", "score": 1, "replies": [{"body": "Oh then it must be true!..lol I heard all this crap when Face book IPO'ed . You have an opportunity to buy cheap. All tech stock has been hammered! Meta / Facebook is printing cash and ensuring the company can run on it's own. Apple can rot to the core.", "score": 1, "replies": []}, {"body": "Blue Collars of the Reddit world who have zero insight how to read financials.", "score": 1, "replies": []}]}, {"body": "IF it recovers, it won’t be for a while. It’s going further down before any recovery occurs\n\nNFA", "score": 1, "replies": []}, {"body": "Long dated otm options will do for me", "score": 1, "replies": []}, {"body": "I upvoted. Not that I necessarily agree with you but stranger things have happened than something like Meta taking off.", "score": 1, "replies": []}, {"body": "Not for a long time, mark dropped the ball big time & blew a lot of free cashflow on this.", "score": 0, "replies": []}, {"body": "Derp", "score": 1, "replies": []}, {"body": "Id look for better ideas to lose 60% in a year.", "score": 1, "replies": []}, {"body": "You got to be careful looking at votes, the votes might be inversed already, in which case you must inverse, then keep inversing until you're about to blow and you'll find the answer.", "score": 1, "replies": []}, {"body": "I just took a shit that was worth more than meta stock....  meta to 50", "score": 1, "replies": []}, {"body": "Only thing it has in common with real world, their stock is tanking (like the stock market)", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "META is drier then a popcorn fart !! Relax it will come back someday", "score": 1, "replies": []}, {"body": "Bag holder spotted", "score": 1, "replies": []}, {"body": "Dog with fleas....and the owner doesn't even know what the fleas are.", "score": 1, "replies": []}, {"body": "Hi Mark!  I lol'd - thanks for the lol's :D", "score": 1, "replies": []}, {"body": "Not touching this until the next bottom has passed.", "score": 1, "replies": []}, {"body": "Are all those meta posts just trolls? Or people really want to offload the bag?", "score": 1, "replies": []}, {"body": "Imo, depends 100% on what Apple comes up with.", "score": 1, "replies": []}, {"body": "Show us your positions", "score": 1, "replies": []}, {"body": "Is that you, Cramer?", "score": 1, "replies": []}, {"body": "Wonder how this would work for people who have to see the keyboard while typing", "score": 1, "replies": []}, {"body": "You must use the 420 technique like Musk.", "score": 1, "replies": []}, {"body": "It's a really cool headset for social stuff, but this shit is ahead of its time, way too soon. The zucc is trying to force it. It'll be cool on like 7 years.", "score": 1, "replies": []}, {"body": "or Buy shares in Nintendo wii", "score": 1, "replies": []}, {"body": "Fb absolutely need to anticipate the next stage of growth, if you believe internet will stay  a statiic thing and the humans in 50 years will be using a keyboard and a mouse while looking at a small flat screen then you lack vision.\n\nThe internet in 50 years is most definitely gonna involve AR or VR or some immersive form, zuck is hanging with futurists and clearly he has better insights than yall dumbfucks", "score": 1, "replies": []}, {"body": "You’ll need the neck of a rugby tight head prop to wear that headset for more than 2 hours a day for five days every week or you’ll need a neck brace very soon.", "score": 1, "replies": []}, {"body": "Yep… you should have sold this OP. This won’t see AH again with a recession in the wind.", "score": 1, "replies": []}, {"body": "I purchased leap calls for 2024 when they announced the shift a year or so ago. I’m down 99.8% on those. LMAO", "score": 1, "replies": []}, {"body": "Nice try mark", "score": 1, "replies": []}, {"body": "Pumping in billions into a VR game that looks like Minecraft. LOL", "score": 1, "replies": []}, {"body": "Meta is a huge buy - from Jim Cramer!   -- NOT  \n\nhttps://www.youtube.com/watch?v=s4R3B1xWslI\n\nThis was from 4 months ago when Cramer identified massive upside after trying the metaverse for himself.\n\nIgnore that Meta fell another $60 from its $156 price at the time.", "score": 1, "replies": []}]}
