{"title": "[deleted by user]", "selftext": "[removed]", "id": "xybrqs", "created_utc": 1665180681.0, "score": 28, "upvote_ratio": 0.76, "num_comments": 79, "comments": [{"body": "I DCAd more AMD and TSM today. I've also been buying UMC since 2020.", "score": 20, "replies": [{"body": "I nibbled on AMD too.", "score": 8, "replies": [{"body": "I sold out of Netflix completely today to buy more AMD. It's too juicy at these prices.", "score": 7, "replies": [{"body": "It's delicious. If it goes sub fifty or sub forty I'll be right there buying.", "score": 6, "replies": [{"body": "I sold a 45 strike out for AMD; would be thrilled to buy it at that level; at todays price not sure I am as enthusiastic.", "score": 5, "replies": []}]}, {"body": "Call me crazy but I sold all of my apple shares today to start DCAing into TSM and maybe eventually amd", "score": 2, "replies": [{"body": "This week was the first week that retail investors were net sellers in the market (except for ETF, interestingly). A bottom is not formed when retail starts to sell, its when they capitulate. What I see as the most telling sign of a bear market rally is its ferocity. We did +6-7% on 2 days. Then we broke down after not even recovering to some resistance; we dove before hitting this resistance telling us this rally was not even serious. Yes the dive was driven by some news events but we did close below june lows again...on the weekly. This is confirmation of a fake break out technically speaking.\n\nFundamentally, markets are not cheap except if fed pivots in 2023 and resumes an easing cycle which many believe is not going to happen.\n\nI know what you think now. These look like some nice contrarian indicators, right? Everyone thinks fed keeps tightening, interest rates are going to be at 4% for a couple years. Retailers are selling. We put in a potential double/triple bottom on the weekly. Everyone and their mum are selling. Best point to buy. Maybe. Or its another 20% down and a flattish 2023. On the other hand you can make \\~4.3% on short-dated US treasuries. 4.3%. Let that sink in. And if you dont mind currency risk you can get even more in europe. Why would I buy a cyclical tech stock that does bad in high interest rate environments and is now in its down-phase that is known to laste for 1.5-2y? And again, this sounds like a good contrarian pick. But there are too many factors now weighing on stocks that need to see a 180° turn before anything gets better. If you already have a position I mean there is nothing bad in staying in bonds right now.", "score": 8, "replies": []}]}]}]}, {"body": "I bought some TSM today too. My plan is to inject most of my small trading portfolio into it in the coming weeks. \n\nI am mainly a boring index investor, but I have a “fun money” account too.", "score": 2, "replies": [{"body": "I've got weekly buys on VGT, but more than 80% of my invested capital goes in to MSFT, AMD, GOOGL, AMZN etc. I dabble in some smallcaps like ABST, MRAM and OPRA - I consider those my fun money buys. I don't really trade in and out of anything though.", "score": 1, "replies": [{"body": "I typically don’t trade in and out of things quickly either. I’m more of a swing trader. Try to buy when things look oversold and sell when I’ve made some money. Sometimes that means holding for a year or more. At the end of the day I want companies that I think have solid fundamentals so I feel comfortable if it becomes a buy and hold situation. I’d be happy to hold TSM or Amd for a couple years if I need to. You’re going to be fine with those large caps too I think. \n\nI’d comment on the small caps but I don’t know much about those particular companies and like I said, 90% of my money is just VTI and other indexes. My “fun money” account oddly enough has done so much better lately.", "score": 2, "replies": [{"body": "Hey fair enough! \n\nFor small caps I'm very thorough in the screening process, I look at pretty much every single financial metric, customer reviews, competitors, tech, etc. There are a lot of opportunities there, but it's so easy to choose wrong. Because of where I bought ABST at, it's actually my highest returning asset this year.", "score": 1, "replies": []}]}]}]}]}, {"body": "$qcom is an interesting play at this point", "score": 14, "replies": [{"body": "My last buy. Got 11 of them. New position.\n\nNext month I imagine I'll be splitting my contribution between TSM and QCOM.", "score": 3, "replies": []}, {"body": "QCOM is starting to look real interesting to me too. If it drops below $110 I'm opening a large position. Still a good deal where it's at, but I'm very risk averse on individual names.", "score": 2, "replies": []}]}, {"body": "Been averaging down on Intel since 40 broke mainly because their divided is really nice at this point and are down to levels from like....2000.  There's a lot of emphasis on US based manufacturing, they just got lazy and it takes time to return to growth.  It's honestly gone lower than I expected but the market is angry right now.", "score": 15, "replies": []}, {"body": "Amd with a 26 pe. That shows that big caps are overvalued at 23 like aapl and msft", "score": 12, "replies": [{"body": "More concerned with Costco and Chipotle PEs to be honest", "score": 7, "replies": [{"body": "Costco is safe in a recession. People will buy in bulk or families who can’t afford bulk will chip in and then share up the big Costco buys.\n\nChipotle on the other hand……ain’t no one got time for a flatbread with rice, beans, meat and salad for $10 in a recession.", "score": 1, "replies": [{"body": "Flatbread? What?", "score": 2, "replies": []}]}]}]}, {"body": "ON makes chips for electric cars so I think they're good.", "score": 6, "replies": []}, {"body": "The entire semiconductor industry is taking a beating. Instead of picking winners, I am rolling with SOXQ here.", "score": 6, "replies": []}, {"body": "Looking at the AMD weekly chart it doesn’t seem far fetched that the price could settle back in the $30 range depending on how the market triage continues", "score": 16, "replies": [{"body": "That would be below book value per share, highly doubt", "score": 7, "replies": [{"body": "Book value assumes full value for the Xilinx acquisition though. You have to assume they'll be taking a fairly large impairment charge for that.", "score": 2, "replies": []}]}, {"body": "Yeah personally I am waiting on AMD to settle down. I love the company but I think it could fall further.", "score": 2, "replies": []}]}, {"body": "Bought a little bit of TXN today. Keeping money on the side and just going to keep nibbling on the way down.", "score": 5, "replies": []}, {"body": "Just going to keep buying after this earnings season slaughters them. Bout more AMD, TSM, and ON today. Will wait for cycle of reports and continue to do so. Demand for auto semis (NXPI, ON, etc…) is off the walls right now. And AMD at $58 is a gift for someone looking at this 5-10 years down the road. Everyone knows PC market is garbage and should have been expecting that.", "score": 4, "replies": []}, {"body": "GFS has been a rock in 2022 while all else crumbles", "score": 3, "replies": [{"body": "I’d say the real semiconductor “rock” is CDNS, Cadence design systems. They are the app that practically every chip company uses to design their chips. Think Photoshop but for chips. They are so important to the industry that it doesn’t really matter what macro headwinds are facing their clients. Their clients aren’t going to stop using them to design chips in a downturn. Their -13% YTD is better than the benchmark indexes and way better than semi companies. However, their p/e is rather high.", "score": 2, "replies": []}]}, {"body": "I've been accumulating AMD, MU, TSM, and QCOM.", "score": 3, "replies": [{"body": "Why not just get SOXQ at that point?", "score": 1, "replies": [{"body": "Because I don't want the other 80% of SOXQ? Weird question...", "score": 11, "replies": []}]}]}, {"body": "I stupidly sold some 70 puts for AMD and its chewing my ass up, I am looking to add more at 55.", "score": 3, "replies": []}, {"body": "TSMC has closer to like a 9 month advantage over Samsung and 2 year advantage over Intel. A decade is just... sort of ignorant of the burden of being those who have to pioneer new advances. There's even been a suspicious adaptation of one of the Asian fabs quickly adapting their upcoming Gate All Around ribbon FET designs after Intel revealed theirs. In spite of how amazingly ahead TSMC fabs are always claimed to be, nobody seems to have a convincing justification as to why they have failed to achieve anything more than negligible areal feature densification.", "score": 3, "replies": []}, {"body": "I think so. I think TSM, Micron, Western Digital, and Intel are clear buys. AMD is a bit too pricey at the moment but reasonable. NVIDIA is far too pricey.", "score": 2, "replies": []}, {"body": "I find it funny that Intel is expanding massively, will benefit from CHIPS act unlike AMD, is trading $1 above its book value, and people are still terrified of it.\n\nI'd still buy AMD here, but I would for sure be nibbling on INTC for a 5 yr hold minimum.", "score": 2, "replies": [{"body": "AMD won’t likely benefit but TSMC will. It’ll help them build their Arizona foundry.", "score": 1, "replies": []}]}, {"body": "Intel has been given sacks of free government money, a direct tie to ASML for national security reasons, and a GPU coming out to eat Nvidias lunch.\n\nhttps://www.protocol.com/enterprise/chip-export-restrictions-tsmc-intel\n\nMicrosoft will also partner with Intel for laptop GPU and for a machine learning framework, because these companies are dependent on eachother to maintain their natural monopolies.\n\nIntel is a no brainer to me.", "score": 8, "replies": [{"body": "Their GPU is absolutely not eating Nvidia's or AMD's lunch right now. But the silicon itself shows promise for maybe competitive future generations.", "score": 10, "replies": []}, {"body": "That’s what I thought when I bought at 46.", "score": 8, "replies": [{"body": "$39 here. *cries*", "score": 1, "replies": []}]}, {"body": "Eating Nvidia’s lunch source? 🤣", "score": 6, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "> Does Microsoft use AMD chips?\n\nYes they have been using epyc for years, also use their gpus for ai and Xilinx fpga for inferencing. Microsoft and amd have a strong relationship", "score": 3, "replies": [{"body": "The Xbox's CPU is made by AMD.\n\nSurface has an AMD option as well.", "score": 2, "replies": [{"body": "AMD makes the CPU and GPU for both the Xbox and the Ps5", "score": 1, "replies": []}]}]}]}]}]}, {"body": "not yet. I am bearish on tech and bearish on semiconductors bc not only recession fears, but also energy. When the system is short energy, oil will go up and semiconductors cannot overcome those strong macro headwinds. Not to mention the tech boom pulled demand forward.", "score": 2, "replies": []}, {"body": "I think Intel is the best company here.  100 billion market cap and the US and EU are giving them 50 billion to build new plants.  I still think they have a lot going for them even without gov't money and the new CEO is making tough choices.  \n\nI'm interested in picking up AMD if it gets into the teens.  AMD is now a growth co without any growth.  AMD could go really low.\n\nIntel has some really interesting products coming out.  I could see intel 10X ing in the next 10.  \n\nI use both AMD and Intel products daily and don't really have a preference.", "score": -1, "replies": [{"body": "Teens? GTFO", "score": 4, "replies": [{"body": "You know if it dropped to teens he'd say he'd only pay $1 lol", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I saw in 2008 that stocks can get irrationally low.  I don't think sub twenty is out of the question for AMD.   \n\nHeck the Reddit crowd said buy AMD at $150 nothing can go wrong also NVIDIA at $300+.", "score": 3, "replies": [{"body": "I’ve been swing trading AMD for almost 2 years now. People laughed at me when I said I would buy back in to AMD when it falls back below $100 when I sold it at $115 and then it ripped to $150. Reddit has a bit of an irrational love for that company. Which is why a lot of us get downvoted for suggesting it might fall below their current PE. \n\nAre they reasonably priced in the 20s considering their growth? Absolutely. Do I think the market will continue selling them off next week into the teens? anything is possible in this market.", "score": 2, "replies": [{"body": "I'm bagholing Intel and probably going to buy more.  How do we not buy a company that governments are about to give half its market cap to in free money to build factories.\n\nI would be much more interested in AMD if they had any sort of chip fabricating abilities even bad ones.\n\nI owned Russian stocks when they invaded ukraine.  I just didn't think it would happen, so I am now hesitant to buy any company that 100% relies on another country's manufacturing facility that might get invaded.", "score": 1, "replies": [{"body": "To be clear, they aren’t getting the full $50 billion. They will get a lot of it. TSMC gets some of it to help build their Arizona foundry for example.\n\nI can’t find exact numbers though.\n\nThe brilliance of fabless companies is that it takes out of the equation a lot of the extra r&d involved as well as the upfront costs of building a many many billion dollar foundry. The highest margin part of the business is the part where they take the chip and sell it to a business not the part where TSM gets a cut for making the chip. TSM has all of that money they have to put back into their business to keep an edge on Intel.", "score": 1, "replies": [{"body": "So Intel is getting $30 billion from the US govt, But Europe is giving intel another $20 billion from  \"EU chips act\" to build some factories over there.  That is where I get the 50 Billion.\n\nI view being fabless as a liability.  I understand the economics of it, but AMD and NVIDIA have put themselves in a position where they are out of luck if something happens to TSMC.  They should probably lay out a contingency plan in their annual reports.  \n\nThe history of chip-making though is when capacity runs out you hire the next fab over for overflow.  Intel made all their graphics cards at TSMC, and once upon a time ago in 1982 you could buy an Intel chip made at the AMD fab.\n\nFor the first time too, Intel is opening up their fabs for outside customers.  mediatek looks to be the first customer with their low end ARM chips.  This could get really interesting.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "AMD still overvalued. Looking to get in mid 40s", "score": -1, "replies": []}, {"body": "We are going into WW3- starting with an economic war, it will end up with a major war, maybe nuclear. Doubt too many chips will be sold when everyone is fighting. Wait, there will be another chip renaissance.", "score": -6, "replies": [{"body": "I think if anyone is betting on nuclear war why even invest at that point? If you even survive, we likely won’t even have a currency or economy anymore. Buy guns and if you’re already rich, a bunker. \n\nImo the world always seems like it’s headed toward one disaster or another. It is almost always just noise.", "score": 13, "replies": [{"body": "Exactly this, I make my investment choices based on the assumption that WW3 is not happening. WW3 would destroy all investments and likely all of our lives so it is an irrelevant thing to consider when it comes to whether or not I buy something. My money will be gone and I will be dust, so what good does planning for that do?", "score": 5, "replies": [{"body": ">  *WW3 would destroy all investments and likely all of our lives*  \n\nNot exactly.  War is good for business.  Also tons of innovation during war.  \nVTI Total Market fell 2.86% today and that did not include a foreign power invading our land.  \n\n\"The Dow increased 10% on the first day of trading after Hitler invaded Poland in 1939. When the attack on Pearl Harbor occurred, stocks fell 2.9% but regained those losses in one month. From 1939 until the end of the war in late 1945, the Dow saw increases of 50%, more than 7% per year.\"", "score": 0, "replies": [{"body": "Regular war sure, but WW2 didn’t yet have the threat of total nuclear annihilation. That was the scary thing about the Cold War. There’s that saying about how ww3 will be fought with nuclear weapons and ww4 will be fought with sticks and stones.", "score": 2, "replies": []}, {"body": "That was not a nuclear war.", "score": 1, "replies": []}]}]}, {"body": "WW1 and WW2 were real. It will happen again. Do not underestimate the odds of it happening again. The oil shortages are the main driving force.", "score": 1, "replies": []}]}, {"body": "Actually… intel may be a great resource for chips in drones, killer robots. Airplanes and jeeps, ICBM’s etc. \n\nWar requires a lot of resources, and that includes chips. Ask Russia.", "score": 3, "replies": []}]}, {"body": "We?\n\nLol.\n\nYou're on your own, friend.\n\nI think chip stocks are good right now, but what the hell do I know.", "score": 0, "replies": []}, {"body": "I’m only riding with Skywater technology $SKYT & globalfoundries $GFS at the moment. Skywater is a long term play & I’ve been slowly adding like $10 here & there, globalfoundries I’m still doing my research on but I threw like $15 at it a few months back for the hell of it.", "score": -1, "replies": []}, {"body": "I think people are so... Putting always their live savings into some random shit.. Just buy in, when you have the money and wait, or dont do it.", "score": -1, "replies": []}, {"body": "Yikes.", "score": -1, "replies": []}, {"body": "When market will rally again this is the first Semi ETF to double, I already made 100% on it from May low to august high and going to enter again soon SOXL", "score": 1, "replies": [{"body": "I do love dabbling in a good leveraged fund. Most of my strategy relies on what could be a several-year rebound though. Maybe I’ll toss some fun money in that when the time is right.", "score": 1, "replies": []}]}, {"body": "Is AVGO not considered a chip stock? I hardly see any mention of AVGO when people talk about chips? Just want to understand.", "score": 1, "replies": [{"body": "They’re definitely one of the stronger long term hold names out there right now, solid 3.5% dividend. One of the larger cap semi companies. I just don’t quite know enough about them to figure out at what point they are undervalued? Just from looking at their chart I see that they haven’t really traded down like some other semis have. They’re still at inflated Covid-era 2021 prices.", "score": 1, "replies": []}]}, {"body": "What's everyone's thought on qualcomm I bought 4 stocks at 149 and I feel like I'm bad holding now", "score": 1, "replies": [{"body": "They’re one of the few that isn’t back down to 2 year lows. That can be taken in a positive way, showing that their business is robust, or it could mean they could fall? So far, they’ve been still beating expectations narrowly. \n\nThey are the leader when it comes to the specialized internet-related chips that are used in phones and cars. With that said, I don’t know much else about their business.", "score": 1, "replies": []}]}, {"body": "What about Intel?", "score": 1, "replies": [{"body": "I mentioned them toward the bottom. They are definitely the most “value” of the bunch on paper. I am hesitant about them because their management absolutely shit the bed on several decisions over the last 5 years or so, and it’s a business where you really don’t reap what you sow for another 5 years. Technology moves so fast these days that I’m afraid they’re kind of like betting on IBM instead of Apple in the 2000s. I totally get that they’re getting a lot of money from the government to prop them up, but I’m not sure it’ll really make them catch up to TSM or the fabless companies.", "score": 2, "replies": []}]}, {"body": "Look at the good chip stocks, not AMD. Fundamentals matter. \n\nTSM, QCOM, MU, UMC, AMAT.", "score": 1, "replies": []}]}
{"title": "Up 125K this month!", "selftext": "Most SPY Puts and Calls, but some TSLA puts.", "id": "xy8bez", "created_utc": 1665171886.0, "score": 343, "upvote_ratio": 0.93, "num_comments": 87, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|12|**First Seen In WSB**|3 years ago\n**Total Comments**|26|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xy8bez)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xy8bez)", "score": 1, "replies": [{"body": "Great job! Certainly have some guts", "score": 1, "replies": []}, {"body": "Dude dont fuck around. Put a majority aside and do it again.  \n\n\"Not financial advise.\"", "score": 1, "replies": []}]}, {"body": "How are puts with that low of a strike worth anything?", "score": 72, "replies": [{"body": "This is a genuine question, if anyone actually has an answer.", "score": 20, "replies": [{"body": "The price value of an option consists in part of a premium paid for variation of the stock price, since the price is  constantly floating in the market.   Presumably OP bought this option when the stock was trading essentially flat for a few weeks in September, resulting in the volatility component of the price to be low.\n\n\nRecently, TSLA has taken a staggering nose dive on the chart which illustrates that the historical price of the stock has high mathematical variance.  This variance is now factored into the volatility premium of the options OP owned, therefore he could sell at a profit versus his original purchase price (even though his strike price is obviously nowhere close).\n\n\nFor more information, research \"Implied volatility\"", "score": 52, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "Options are for taking money from those who think they know what they are doing and giving it to those who really know what they are doing.  This has been my experience so far anyway.", "score": 10, "replies": [{"body": "I am the person that is being taken from 🤣my hard work $1000 a month deposits get flushed", "score": 5, "replies": [{"body": "stop doing it", "score": 3, "replies": []}]}]}]}]}, {"body": "Supply and demand. Someone wants to sell it, someone wants to buy it.\n\nHow is anything worth anything? Because someone attaches value to it, whether real or not.\n\nIn short, fuck OP", "score": 20, "replies": [{"body": "Yeah but I mean, TSLA has no chance of hitting that low.  Why would it have value?", "score": 5, "replies": [{"body": "Ok looking again I see that they are dated 1 and 2 years out but still.", "score": 11, "replies": [{"body": "it's a hedge for when things like this happen where their TSLA position took a huge dump.  OP made money speculating, but if someone who has a large TSLA position want to hedge their downside risk they would buy those options to protect themselves.", "score": 14, "replies": [{"body": "Thanks for at least trying to explain it unlike that other dipshit who is preaching supply/demand.  There is far more going on with options this far out of the money than simple supply/demand.  Fuck me for trying to learn something.", "score": 24, "replies": [{"body": "Sandier this. The fact that there is a market for these suggest an anticipation of a very low probability of TSLA going literally tits up on tail-risk events, such as\n\nWWW III\n\n\\-Loss of giga-factory in China to CCP due to US-China escallations.\n\n\\-EU giga-factory nonprofitable due to lack of resources due to EU regulations (rough winter).\n\n\\-etc. etc. There is a lot of tail risk.", "score": 5, "replies": []}, {"body": "Aside from the churning of buying/selling pumping the price, the big dip did raise premium for leaps significantly. Time always causes extra ripples deeper into the chain. Things become more “technically possible.”", "score": 2, "replies": []}]}]}, {"body": "Let me spell it out for you.\nI list a spec of dirt for 1 million gazillion dollars. Is it \"worth\" that much? NO! Not until bajillionaire playboy comes around and buys it up! Now, it's \"worth\" 1 million gazillion dollars because some schmuck decided to buy it off me!\n\nSans twitter", "score": 1, "replies": []}]}, {"body": "I know you can't read, but look at my reply again. Jesus christ", "score": 2, "replies": []}]}, {"body": "I’m bricked up", "score": 0, "replies": []}]}]}, {"body": "Those aren’t the puts I made money on. I tried to post the images but couldn’t. I did explain in more detail in another reply.", "score": 2, "replies": []}, {"body": "The real answer I didn’t see in the top comment replies is:\nExtrinsic Value\n\nThe call with value is 2024 dated, this alone gives the position value before applying incredibly bearish movements and increased IV.", "score": 1, "replies": []}, {"body": "It’s not worth anything unless you can find someone to buy them. There isn’t always a market for options that far out of the money. Pay attention to volume on those contracts to make sure there is enough activity otherwise it’s just paper gains that you can’t realistically convert to actual cash", "score": 1, "replies": []}]}, {"body": "Damn, my line goes the other way. Nice work.", "score": 47, "replies": []}, {"body": "Alright, so are you gonna withdraw that and realize those gains or keep going back in on puts because you know what you're doing? ![img](emote|t5_2th52|4275)", "score": 14, "replies": [{"body": "We all know the answer", "score": 13, "replies": []}]}, {"body": "Hey man don't post gains. Everyone going to blame the federals for printing money.", "score": 33, "replies": [{"body": "I’m trading on the feds moves, I made this mostly from puts.", "score": 23, "replies": [{"body": "What are your plans for Wednesday?", "score": 2, "replies": [{"body": "For CPI release? I’m not sure yet. Last month I bought puts a YOY inflation showed September 2021 CPI increasing after 2 consecutive months of decreases, and I was right about that. I’ve actually been on vacation in Europe for the past two weeks (and about 60% of those gains were during that period), so I haven’t been able to do great DD. I think it’s going to be stagnant or slightly lower. I think SPY still has a a ways to go on the downside though.", "score": 3, "replies": []}]}]}]}, {"body": "If I had that I would no longer need to be here. I’d be in Thailand already", "score": 5, "replies": [{"body": "Instead your Kok is getting Banged by SPY daily.", "score": 7, "replies": [{"body": "Nope averaging $200 to $300 a day in puts printing from spy. Just gonna take time to get to 150k. Palantir really gaped my ass last year Which is preventing me from retiring. It’s my only bag until It goes back to $20.", "score": 3, "replies": [{"body": "You're planning on retiring on 150K usd?", "score": 2, "replies": [{"body": "In Thailand, that's more than enough", "score": 1, "replies": [{"body": "For real? What are the monthly costs there? Would have to be able to live under 15K USD a year...", "score": 1, "replies": [{"body": "It's not about the cost, it's about the conversion from American dollars to Thai baht.", "score": 1, "replies": [{"body": "I'm not really sure what you mean. You need to spend money to live. Is 15K USD a year enough to live in Thailand? It seems absurdly low to me.", "score": 1, "replies": [{"body": "An American dollar is more than one Thai dollar in Thailand.", "score": 1, "replies": []}]}]}]}]}, {"body": "You can literally live in Thailand for less than 1,000 a month. Try looking up prices for condos and then condos for rent prices. You’ll be mind blown on how cheap it is and the food is cheap. Beer is less than a dollar. I need 150k to ride out until my government pensions kick in.", "score": 1, "replies": []}]}]}]}]}, {"body": "How tf am I losing so much money while yalls are doing this", "score": 7, "replies": []}, {"body": "I would never boast my gains on tesla puts. Good for you man. It's the only one I dare not post. Only via pm", "score": 14, "replies": [{"body": "Why?", "score": 2, "replies": [{"body": "Elon is regard", "score": 4, "replies": []}, {"body": "I get shit on and down voted. Elon has a spell on some people. Or is it desperate to follow Cathy wood to the bottom.", "score": 5, "replies": []}]}]}, {"body": "Outstanding! This is the way! Puts on insanely inflated TSLA, excellent 👍💯", "score": 9, "replies": []}, {"body": "Honestly, I looked at TSLA puts beginning of this week, and the premium is insane. Seems like everyone knows TSLA is a dead man walking. \n\nHow do you make sure you're not in a situation where you're right, but still don't turn a profit?", "score": 4, "replies": [{"body": "Tesla is worth less than 100bil let alone the 700bil is currently is at.", "score": 4, "replies": []}, {"body": "This.  Well tsla isn't a dead man walking, they're just way overvalued by their cult.  I would love to buy puts on tsla but that damn premium  makes it hard to justify.  Same thing looking at calls now.", "score": 3, "replies": []}, {"body": "Buy in the money puts 120 days out", "score": 1, "replies": []}]}, {"body": "What’s the trading strat for the SPY puts? How many weeks out you buying? Grabbing 10% swinging in and out of them?", "score": 3, "replies": [{"body": "I’m pretty much swing trading at this point. Mostly puts only because things are heading south, always overnight, always purchased right before close, and always sold at open.", "score": 15, "replies": [{"body": "lmao you swing trade with long dated so probably low volume,  about as far out the money as you can get,  options.  Holy shit.  How does trading like work out for you?", "score": 0, "replies": [{"body": "Those aren’t the swing trades I made. Those options I still have are just insurance for the inevitable downfall of Elon. The swing trades I made were with mainly SPY options usually 10+ days for expiry (I didn’t want to get burned if I was wrong). I held SPY puts overnight a few times too.", "score": 2, "replies": []}]}]}]}, {"body": "Sell now don't watch it disappear", "score": 3, "replies": []}, {"body": "TSLA $6.67 puts?", "score": 2, "replies": [{"body": "They were purchased a year ago.", "score": 8, "replies": []}]}, {"body": "You Bastard, Congrats", "score": 2, "replies": []}, {"body": "Why you here with this green shit. Congrats. And fuck you.", "score": 2, "replies": []}, {"body": "Well, time to kill myself.", "score": 5, "replies": []}, {"body": "Boss of Steel shorting tesla", "score": 4, "replies": []}, {"body": "What’s ur positions tho. Those ones in the pic don’t make sense. They way OTM.", "score": 1, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "All mine are going down except for BHP billton", "score": 0, "replies": []}, {"body": "here i am, negative using e*trade and you’re using RH making a killing", "score": -1, "replies": []}, {"body": "Can I have 1k plz", "score": -3, "replies": []}, {"body": "![img](emote|t5_2th52|4258) congrats OP", "score": 1, "replies": []}, {"body": "Hell yeah! congrats", "score": 1, "replies": []}, {"body": "Yeah, but you are only getting 2 bars and your battery is almost dead. So suck itemote:t5\\_2th52:4271", "score": 1, "replies": []}, {"body": "Give me your secret", "score": 1, "replies": []}, {"body": "LMAO the bottom put option!?\n\nThis is my favorite trade on the site, hands down. Well done, regard!\n\nI'm also convinced that I need to have an almost dead phone to make good/lucky trades.", "score": 1, "replies": []}, {"body": "Let me give u my credentials. Just trade for me. We can split 50/50.", "score": 1, "replies": []}, {"body": "Begging you to take profits.", "score": 1, "replies": []}, {"body": "6$ huh..🤣 …Take a dagger and kill the guy already.", "score": 1, "replies": [{"body": "He said he bought them last year, so pre stock split. Their strike would’ve been adjusted for the stock split.", "score": 2, "replies": []}]}, {"body": "Do it again 2 more times", "score": 1, "replies": []}, {"body": "Why me no money", "score": 1, "replies": []}, {"body": "The puts are worth that much cus of TIME, if op don’t sell em quick theta bouta fk em up. \n\nIf someone is smart enough to make 100k+ in a week probably k owes what they’re doin. \n\nI WANT AN UPDATE ON THOSE PUTS WHEN YOU SELL EM K PAL?", "score": 1, "replies": []}, {"body": "all put tesla????", "score": 1, "replies": []}, {"body": "Turn off margin", "score": 1, "replies": []}, {"body": "That is amazing.", "score": 1, "replies": []}]}
