{"title": "VIX, the volatility index, is at its highest level since 2011", "selftext": "this is pretty crazy:\n\nhttps://i.postimg.cc/3R7176FS/vix.jpg\n\nIs this high level of fear and volatility warranted?\n\nTo be honest I don't think we are going to see a new 2008 in terms of how badly the world is hit, because of the corona virus.\n\nOf course the corona virus will have negative economic consequences, but I think the stock markets will rebound slowly around 6 or 12 months from now.\n\nI think the worst thing now, for the stock market is the uncertainty about how many people will get sick from coronavirus and how the states and economies will react. \n\nHow do you think this will all play out and evolve?", "id": "feuzyt", "created_utc": 1583587038.0, "score": 437, "upvote_ratio": 0.96, "num_comments": 188, "comments": [{"body": "The stock market in large part is taking its cues from this administration and the CDC. Pence and the CDC have said they won't be able to provide the test kits on time and just the other day trump said about bringing infected cruise ship tourists into the United States **\"I don't want to bring them in because that will raise our numbers\"**\n\nThink about what that means. Trump is taking measures to keep the outbreak numbers **artificially** low, his CDC is also operating off these low numbers. \n\nWhen the stock market finally gets confirmation of the numbers being false it's going to tumble, and panic will set it in.", "score": 34, "replies": [{"body": "Regarding the cruise ship, I'm pretty sure he was actually referring to how infected passengers could infect other people. There were people from many different countries on that cruise ship anyway. \n\nRegrading the test kits, yeah I think you're right there, the U.S. has definitely not been testing people thoroughly.", "score": 2, "replies": [{"body": "He was, but how do you get upvotes without saying orange man bad?", "score": 2, "replies": []}]}]}, {"body": "The coronavirus was just the fuse that would light the fire to the recession.\n\nRelevant things that were happening before the coronavirus:\n\n1. Corporate profits were already in a recession.\n\n2. Huge piles of corporate debt, we are at the end of a credit cycle, meaning people and corporation will have to spend less to cut back on debt.\n\n3. The P/E ratio of the S&P 500, for example, had valuations comparable to previous markets just before the crash, like 2000 and 2008.\n\n4. The Fed already wasted almost all of it’s ammo, reducing it’s ability to keep the economy going, the stock market has been relying for years on the Fed to keep the party going, now that they realize they are on their own, investors could finally realize every price is pretty much inflated.\n\n5. Even though interest rates are historically low, the inflation rate is low, even with a low unemployment rate. This definitely means there is some core problems with the economy since it is a clear show of how much pressure the Fed, consumers and the producers are putting to stimulate growth but it’s still lackluster and clearly show signs of contraction.\n\n7. Millennials and Generation Z are becoming more important every year for the economy. They are probably the most indebted populations there are, reducing their ability to consume, work and to defend themselves against a recession.\n\n8. Even though we have unemployment at record lows, Americans suffer from low wages, almost no working rights, and low capabilities to consume since household debt is at record lows (can’t stimulate growth in the economy if all the households are using their paychecks is just to stay afloat and live up to the next paycheck, leaving little room to actually consume).\n\nSo, you have that in mind, and also a Bull Market that has been going since 2009, for 10 years, when the average is 8. \n\nSo, if it wasn’t coronavirus it would be something’s else, but let’s examine it’s economic impact.\n\n1. The virus will cause a huge supply shock because of low volume of commerce since China is basically on quarantine and the world depends on China to many of it’s goods.\n\n2. On the side of the consumers, you can cut rates as much as want, but a huge household debt won’t disappear out of nowhere it these lackluster wages workers are given, have that in mind, the virus is another incentive to consume even less.\n\n3. These halts on supply on demand can cause huge problems on corporations that today are up to their eyeballs in debt, failing to pay short term debts, causing a huge death spiral.\n\n4. The outbreak is not even a it’s peak and already caused a huge economic impact that will only get worse.\n\nSo yeah, I don’t see the next month with good eyes.\n\nAlso, one last thing to make things clear:\n\nYou don’t do a emergency cut of 50 bps on a national interest rates if you think the economy is strong and have good foundations, you do it because shit is going down fast and the gears of the economy are starting to break down even faster and you are trying to keep it going by cutting the rates.", "score": 278, "replies": [{"body": "#4 is the big one. The newer generations, any money we get goes to debt, not growth. \n\nOh, and this COVID thing is just bringing to light the dark underbelly of this inflated market (high healthcare system stocks despite no infrastructure for a pandemic etc) ... which is hollow to an extent because of many things.", "score": 64, "replies": []}, {"body": "It's not just a supply concern with China.\n\nAt the end of the day, consumer spending (and confidence) is the driving force behind the American economy (and elsewhere). If people are to scared to go out of their homes and spend, that will have a huge effect (you may have mentioned this point, apologies if I missed it).", "score": 28, "replies": [{"body": "People don't need to go out of their homes to spend, brotha.", "score": 23, "replies": [{"body": "Small and local businesses still need them to. SXSW itself should be ok bc of nonrefundable tickets. But what about all those independent restaurants and vendors? That’s what, a $353mm hit to the local economy in Austin? \n\nYes, it’s a short-term but huge influx of tourists. But a prolonged coronavirus threat that drags other local economies down over months...this could really suck. Furloughs, layoffs, and defaults aren’t far behind as credit and share options for small businesses are either limited or, in the case of the latter, nonexistent.", "score": 19, "replies": [{"body": "My personal opinion is that this will hit harder (than it is now), but it will bounce back even harder, as everyone rallies. I agree w what you're saying. Those small businesses don't have the moat big ones do. It's devastating, on a micro level.", "score": 6, "replies": []}]}, {"body": "And you think online retail sales make up a large enough portion of GDP to sustain the economy?", "score": 4, "replies": []}, {"body": "Apple hasn't seen an uptick in app purchases like they'd hope yet. We'll see going forward, but many consumers need to work to buy things, so leaving home for work is important.", "score": 2, "replies": []}, {"body": "Tell that to restaurants, hotels, airlines, uber drivers, shopping malls, bars, football stadiums, concert venues, Oh but it doesn't matter becuase i still order the iphone online, meanwhile apple wastes money on rent for retail locations.\n\n&#x200B;\n\nThey spend less when they don't leave thier homes.", "score": 4, "replies": []}, {"body": "If people can't go to work to support the online retail supply chain how are they going to get their stuff?", "score": 2, "replies": []}]}, {"body": "Look up what happened to citizens of London during ww2 bombing runs. The govt expected panic but got the opposite. Every night that people survived made them feel more alive. Imo spending increases, people make gut decisions to splurge on items they have been saving for because we could all die tomorrow.", "score": 5, "replies": [{"body": "I’m going to live it up with my -45k net worth.\n\nEdit: I guess some people don’t see the self deprecation in this post.", "score": 15, "replies": [{"body": "Lol. You could always borrow! Interest rates are looking good these days ;)", "score": 6, "replies": [{"body": "I am! Just bought a house last week.", "score": 3, "replies": [{"body": "Haha, nice.", "score": 2, "replies": []}]}]}, {"body": "Oh shit dude. Must be rough having that much debt forced upon you. It’s a damn shame that you never agreed to pay those amounts back and yet get stuck with it.\n\nIt’s a tragedy that you didn’t get a single thing for this forced debt. You poor baby.\n\nOr maybe, you signed the agreements and you accepted that debt and you lost at this level of the game of life.", "score": -12, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Entitled to what? \n\nThe only thing I think I’m entitled to is death.", "score": -6, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "I enjoyed this one. \n\nYou sir are what I get for the price of death. These laughs run eternal my friend", "score": -4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "But I’ll take them from you anyways.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Hahaha. I’m doing just fine in life. I have a union protected government job and a wife. Just bought a house last Wednesday in fact.\n\nDoes it make you happy to talk to people like this?", "score": 2, "replies": [{"body": "Hahaha!! You think you’re saying something valid.", "score": -3, "replies": []}]}, {"body": "What the hell are you even going on about?", "score": 2, "replies": [{"body": "Inverted earth theory.", "score": 0, "replies": []}]}]}]}, {"body": "Spending on luxury items most definitely didn’t increase in London during WW2.\n\nJesus Christ.", "score": 3, "replies": [{"body": "Haha, true. Just saying, this is a short lived event, months, not years like a war and when we emerge from events like this there is usually heightened animal spirits leading to big rallies and spending. Speaking to the psychology of these events that can be counter-intuitive.", "score": 1, "replies": [{"body": "True.", "score": 1, "replies": []}]}]}, {"body": "Most people don't think they could die from the coronavirus, though, It's a disease that kills the elderly, pretty much exclusively.", "score": 1, "replies": [{"body": "Anyone above 60 probably has some fear of this...and that’s where most of the wealth is. I’m also just speaking to the psychology of events like this and how they can be counter-intuitive...we’re complex animals.", "score": 1, "replies": []}]}]}, {"body": "From what i see in LA people's don't give a f about the Virus. So far at least.. now if there's a big enough mortality rate I can see it all going to hell fast. We'll see ..", "score": 1, "replies": []}]}, {"body": "There's always a catalyst that no one expects that sets them off, and disrupting the world supply chain is certainly one of those catalysts.", "score": 5, "replies": []}, {"body": "might I add  that institutional accounts have adopted strategies that are essentially destabilizing in a sell-off ala 1987 style portfolio insurance. Pension funds have purchased dynamic hedging solution that are silent until the market breaks down a certain percentage. The potential for a 1929 style meltdown are bigger than ever. I expect exchange closings, government interference and arrests of anyone selling stocks short or buying puts without permission.", "score": 2, "replies": []}, {"body": "There's a rumor that without the rate cut the international banking community would be fucked 2008 style.", "score": 2, "replies": [{"body": "Nah that has to do more with the repo markets", "score": 2, "replies": []}]}, {"body": "Given that over 30 million people in the US have no health insurance, and the cost of a single Coronavirus test is estimated to be as high as $3000, people living paycheck to paycheck create the perfect conditions for the virus to bite particularly deep and long into the US economy. .", "score": 2, "replies": [{"body": "Reminder-as of yesterday they are to be covered by medical insurance or free at public health, and subject to a doctors order, in US.", "score": 1, "replies": []}]}, {"body": "Goodshit u sound like me.", "score": 1, "replies": []}, {"body": "Great points.  I know the market looks ahead, but just wait until the quarantines start and there is evidence of widespread community spread of Covid19.  What do you think the VIX will be?  What will the Fed do?  How will the politicians and the electorate respond?", "score": 1, "replies": []}, {"body": "Let’s make this clear while you sit in your ivory tower I am out in the real world and things are booming our here to the extent that there are backlog orders so there isn’t going to be any recession anytime soon so kiss your freak ass commie wannabes good bye !", "score": 1, "replies": []}, {"body": "Wait Trump told me the stock market was doing the best ever, greatest economy, are you suggesting the market was propped to make it look good?", "score": 1, "replies": []}, {"body": "These are really good points. I almost forgot about the fed. Sources? I’m interested in exploring about it myself.", "score": 1, "replies": []}, {"body": "👏👏👏👏", "score": 0, "replies": []}, {"body": "8.  There's a strong chance a socialist will be the next president.", "score": -6, "replies": [{"body": "A socialist is what we need right now. We didn't get good wage growth under Bill or Obama, we need someone so left it'll make the right compromise on common sense laws. Fucking traitors new age Republicans are.", "score": 5, "replies": [{"body": "As a relatively young investor, I'd be happy to have a major market correction right now.  As a citizen, I would like to see a new president this year.  As a libertarian, I'll take the Bern for 4 years to balance what Trump has done (assuming Bernie would get anything done).", "score": -2, "replies": [{"body": "I'm entirely perplexed by your Bernie support and libertarian label. I feel like those could not be more opposing viewpoints. This is not a Trump supporting comment by the way. More so a suggestion that you should revisit the definition and ideals of a libertarian so you are more informed about your political views.", "score": 3, "replies": [{"body": "I don't like to label myself politically, I think ideologically there are good ideas on both the left and right sides, but just looking at the current political situation in the US it's clear that Bernie's policies are much healthier for the country than Trump's. In many ways the left/right polarization is a red herring that allows politicians to get away with astonishing amounts of corruption and lies, simply by accusing the opposition of something that emotionally triggers voters enough to distract them for a while.", "score": 1, "replies": []}, {"body": "I don't support Bernie any farther than saying I'd rather see him in office than Trump for the next 4 years; that said, I'd never vote for him.  While I can relate to your loathing of people calling themselves libertarians then supporting Bernie, fuck off with your policing the \"label\" and stay perplexed.", "score": 1, "replies": [{"body": "Sorry if that came off as offensive. That wasn't my intent. I didn't label you a libertarian. You claimed to be one, then in the same sentence said you wouldn't mine having a self proclaimed socialist as a president. I don't care what ideals you support, I'm just letting you know that your comment is analogous to me saying \"I'm a die hard vegan, so I wouldn't mind giving the carnivore diet a try for a while.\"", "score": 1, "replies": []}]}]}, {"body": "Yeah exactly. Trump didn't ban abortion, make religion mandatory, deport many immigrants, because the left pulls to their side hard. When Bernies president the right will pullback hard too, not like we're genuinely going to turn into a socialist country with a socialist president.", "score": 3, "replies": [{"body": "Bernie is an FDR democrat. We won't see real change until the senate changes. We put too much onto the president that is really for Congress to oversee.", "score": 1, "replies": []}]}]}]}, {"body": "Or worse, 4 more years of a Zionist president. I just want our tax money spent here not in some desert", "score": -2, "replies": [{"body": "d", "score": 1, "replies": [{"body": "What's goin on big guy", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Yeah that's why I said 4 more years. I feel like a lot of the development he's funded is so he can go back to it after his term is over", "score": 3, "replies": []}]}]}, {"body": "I’m an independent. Fuck trump. \n\nBut I really don’t think there’s a strong case for that.", "score": -5, "replies": []}]}]}, {"body": "That’s usually a buy signal for long stocks", "score": 11, "replies": [{"body": "Or sell. It indicates a top *or* a bottom.", "score": 3, "replies": []}]}, {"body": "It's not done yet.", "score": 16, "replies": []}, {"body": "I think it has to get bad enough in the US that we stop caring to read it in the newspaper. Based on how fast it’s spreading, that’s probably 3-4 months away. Unless the US magically forces people to stay inside for a month, you will then start to see a the stock market level out, and then it’ll slowly rise from there, with a huge jump when the vaccine comes out in 12-18 months.", "score": 26, "replies": [{"body": "Do you know anyone working for Fortune 500 companies? Virtually across the board, there are emails going out to staff at all levels -- all nonessential travel is being restricted and massive work-from-home projects are being tested next week, *starting Monday*.\n\nThe news is getting more grim and the panic levels aren't going down anywhere at all. The economy will hit a standstill and then things will start going into freefall.", "score": 7, "replies": [{"body": "I can second that. I work for a big international company and they’ve said at any moment they will implement it.", "score": 3, "replies": []}, {"body": "If we travel we’re supposed to report it and stay home for the next 2 weeks.....but they prefer us to stay in the states. Also told us try not to shake hands lol", "score": 1, "replies": []}]}, {"body": "\"We have done an incredible job. We're going to continue,\" Trump said during a Black History Month reception at the White House. \"It's going to disappear. One day it's like a miracle, it will disappear. And from our shores, you know, it could get worse before it gets better. Could maybe go away. We'll see what happens. Nobody really knows.\"", "score": 24, "replies": [{"body": "It astonishes me how we have devolved from presidents who speak confidently, intelligently and with conviction to this.  I’m embarrassed every day this man is our president.  And the dems have nobody stepping up to instill that confidence. Our forefathers would be disgusted.", "score": 52, "replies": [{"body": "The establishment Dems want him to be president. They directly benefit from all his policies because they are wealthy, but get to blame it on the republicans. That’s why they don’t support an outsider like Bernie.", "score": -18, "replies": [{"body": "That's utter nonsense.", "score": 16, "replies": []}, {"body": "I'm to the point where Bernie supporters and Trump supporters are effectively the same thing from opposing viewpoints to me. Everything is always the fault of the crooked media or the biased media, the swamp or the establishment, the closet Democrats or the closet Republicans. Conspiracy theories, hyperbole, acting like your guy is the only guy qualified to save the world. You guys wonder why \"centrists\" are scared of Bernie, this is it. *You* are the reason. The way you talk is eerily similar to the thing we're trying to get rid of.", "score": 6, "replies": [{"body": "The one thing I do not want is additional spending fees on my money. I am already on the bottom and am far from being completely financially established. “Less than 1 percent less than normal be percent!!” 1% in an expense ratio is FAT on a on a years gains, how would that continuous fee play out in my favor in any way? \nI believe some people would say I am not considering the well being of other when I say that, seeing as the money is intended for social programs. I am, however, looking out for myself as I NEED MY MONEY", "score": 0, "replies": [{"body": "I like Bernie's ideals in a vacuum. I just have a problem with his supporters (more so his supporters on Reddit) because they bitch and moan about Trump supporters talking in a certain way and then seem totally oblivious when they do the same exact things.\n\nI get your point, and I don't feel that's an important enough factor to not vote for somebody for me personally, but to each his own. I also have a ton in student debt so in that sense Bernie is better for me. In any case, my problem isn't with the candidate it's with his base online.", "score": 4, "replies": [{"body": "I get that we’re all frequent reddit supporters and we see these things much more, but I can tell you that supporters of other candidates do the exact same things as Bernie and Trump. It’s been harder to see, since they have been dwarfed by the online presence of Bernie and Trump, but supporters of other candidates are equally as bad. I’m not saying that Sanders supporters are angels; they definitely aren’t. But if you’re worried about the existing toxicity growing, then unfortunately I don’t know where you turn.", "score": 2, "replies": [{"body": "I don't agree with that. Even on Reddit, people supporting other candidates seem to perfectly cordial to each other. Yang gang, for example is one that has strong belief in their own candidate but I can't say the Yang supporters I've run into on Reddit spew the kind of BS that I've seen from Bernie supporters. It's this total disillusionment of reality. This sense that it's just a handful of \"us\" versus the entire world, including the establishment of both parties, the media, Russian disinformation, and status quo \"centrists\" that support.... Elizabeth Warren. The irony of that last part seems to be completely lost on these people. I had a guy try to tell me how I'm against universal healthcare *after* I told him I was a Warren supporter...\n\nI can't say I've run into this kind of rhetoric form supporters of any other candidate *except* Trump. It just so happens that I tend to agree more with Bernie's ideals than I do with Trump (err... not sure if he has any ideals), otherwise the bases of both candidates are effectively the same to me.", "score": 0, "replies": [{"body": "https://threadreaderapp.com/thread/1231435182537936896.html\n\nHere’s a Harvard social scientist looking at whether or not tweets from people supporters are positive or negative. The data don’t suggest any significant differences.", "score": 2, "replies": [{"body": "Looks like you're right man. I'm not a big twitter user but I guess based on that data (I'm assuming it's trustworthy, seems like a lot of work to misinform) it's pretty fair over there. I'd like to see the same study done for Reddit because I have a *really* hard time believing it would be anything close to fair in the same way. In any case, your original comment is correct in terms of Twitter users so I can imagine Facebook might be similar. That being the case, you've convinced me to your side. I don't think I'll change my views as posted in my last comment in reference to Reddit unless you have similar evidence because I've just had too much anecdotal experience to the contrary.", "score": 1, "replies": []}]}]}]}, {"body": "One of the few balanced comments I’ve seen on reddit", "score": 1, "replies": []}]}]}]}, {"body": "That's utter nonsense.", "score": 2, "replies": [{"body": "Just cause you don’t want it to be true doesn’t mean it’s nonsense. It makes sense if you think about it...", "score": -4, "replies": [{"body": "No, it literally makes no sense.  It just myopic Bernie bros doing their best to throw another election to Trump.", "score": -3, "replies": [{"body": "Of course it makes sense, you’re just antibernie and don’t want to talk about it beyond “no that’s dumb”. Bernie represents a huge shift of wealth with universal healthcare and tax changes. The DNC are comprised of wealthy elite who benefit from conservative policies. You would have to be willfully ignorant to not notice that.", "score": 1, "replies": [{"body": "Voted for Bernie in '16 and will in '20 too.  Just utter nonsense by immature, myopic voters.  We will have you to thank for Trump 2020, just like we did for Trump 2016.", "score": -1, "replies": [{"body": "Thank you for proving my point.", "score": 1, "replies": [{"body": "I don't know how that can be (considering I've refuted your central point that I'm in any way \"anti-Bernie\"), but you're welcome I suppose.  \n\nAlso, do you care to respond to my specific point regarding the status quo under Trump and Biden's plan for a public option?  Or did bringing that up also prove your point somehow?", "score": 1, "replies": []}]}]}, {"body": "I mean, consider how great of a benefit just a public option would be.  Sure, its no M4A or straight single payer.  But it would be fucking enormous improvement- a health insurance plan that wasn't profit based that was available to anyone.  \n\nBut you're ready to cut off your nose to spite your face.  Because establishment Ds are basically Trump (lol).", "score": -1, "replies": []}]}]}, {"body": "Lol. Maybe it makes sense when YOU “think” it. But others with a base level of reasoning would disagree with you.", "score": 0, "replies": []}]}]}]}]}, {"body": "you forgot this quote: \"the virus will not enter the united states we have the best boarder protection in the world\"", "score": 7, "replies": []}]}, {"body": "by the time you stop caring to read about it, you'll be watching it in real life. Your local family/friends/coworkers/yourself will be sick.", "score": 0, "replies": [{"body": "And then 96% of us will get over it and stop caring.", "score": 1, "replies": [{"body": "And 3.4% of us will *fucking die*, which is... let me math....:\n\n12 million people.", "score": 5, "replies": [{"body": "Yeah, I agree it’s terrible. But I’m trying to talk about why the stock market might not just keep plummeting. I don’t think this is going to be a fun 6-12 months...", "score": 1, "replies": [{"body": "Go look at the economic impact the holocaust had. Multiplied by two", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The implied vol suggests daily moves between 2-3%.  (The vol of vol is so high that this range is so wide). We are actualizing that range everyday.  So I would say the vol is justified. \n\nAlso remember that in 2 weeks we went from a low vol environment (12-14 vol) to current vol (40-50 iv).  There are so many strategies that just sell re-insurance type options, Manage them and hope for the best.  Those are probably not having a good few weeks this week.  Lots of short covering in these options and no real mm’s left to manage the risk either because they are maxed out or have blown up.", "score": 13, "replies": [{"body": "My strategy is net short vol. It's been an ugly 2 weeks for my p/l that's for sure. I will say liquidity has been fine in everything I trade except bond futures options.  The liquidity providers in there did a shit job this week (although it is understandable).", "score": 4, "replies": [{"body": "How do you implement that strategy? On equities the only way is selling strangles. Otherwise, do you buy VIX puts or buy a VIX inverse ETF?", "score": 1, "replies": [{"body": "I like to sell strangles skewed to the short side and recently have been doing more ratio spreads because vol is obviously jacked.  Right now I also have some short call spreads in vxx to hedge a bit just because it's so high but that's not a regular position of mine. I never buy or sell shares of anything (absolutely horrible capital efficiency) or have any position that's net long premium.", "score": 1, "replies": []}]}, {"body": "Lol it's been the same for me. It'll pay out bigly eventually", "score": 1, "replies": []}]}]}, {"body": "We're in the early phases of a bear market. Prices will go up as demand is much greater than supply.\n\nHigh levels of corporate debt will cause bankruptcies and further shocks.\n\nAnd Trump will blame Obama.", "score": 15, "replies": [{"body": "He already tried to do that on the test kits shortage if you missed the news - https://www.theguardian.com/world/2020/mar/04/donald-trump-obama-administration-coronavirus.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Let's hope you're right. Bear markets are usually short and sharp unless the system breaks down.", "score": 2, "replies": []}]}]}, {"body": "Economists are projecting Coronavirus to peak in late March to early April and contained and whine down by July/August time frame.  Revised full year estimate of GDP growth in US to be 1.85% instead of 2%.", "score": 18, "replies": [{"body": "Seems like a prediction an epidemiologist would be more qualified to make than an economist", "score": 43, "replies": [{"body": "Australia, its Summer and its spreading....\n\n  \n**It's a 'false hope' coronavirus will disappear in the summer like the flu, WHO says**\n\n[https://www.reddit.com/r/Coronavirus/comments/feh02z/its\\_a\\_false\\_hope\\_coronavirus\\_will\\_disappear\\_in/](https://www.reddit.com/r/Coronavirus/comments/feh02z/its_a_false_hope_coronavirus_will_disappear_in/)", "score": 10, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "And it would be foolish for a president to not take into account the epidemiology but look at where they have put us now.", "score": 4, "replies": []}]}]}, {"body": "That would be a best case scenario, I hope that's correct!", "score": 7, "replies": []}, {"body": "And we should also remember that the entire govt was shut down for an extended run last year with very little effect on GDP. \n\nChina is mostly back to work now so any big supply chain issues are unlikely. Some people in the USA may need to take a forced two week vacation in the next few months...whoop! \n\nAnd unfortunate to say but, worst case, a big portion of the elderly who are taxing the system may be pushed over the edge...reducing entitlements and creating inheritances - an economic positive but obviously not a popular opinion to be voiced.\n\nMany experts also say that death rate stats often reduce from here because people with minor symptoms never reported and were not recorded - this is why people compare covid-19 to the flu, our stats are very very biased in the fear direction right now. (Additionally, an unverified post indicates that Caucasian genetics will experience covid at half severity compared to Asians, Persians and Europeans - Italians - based on how the virus attacks the ace2 receptor...)\n\nThe fear is at peak right now IMO. Market slowly climbs from here until we get some other unexpected event.\n\nFYI, I sold ALL my equity early feb when China cases were ramping up and then averaged all the way back in over the past two weeks.", "score": 4, "replies": [{"body": "Your buying too early.", "score": 2, "replies": [{"body": "Let him attempt to catch a failing knife and fail", "score": 1, "replies": [{"body": "I appreciate the well wishes ;)...I assume you also predicted this and sold out at the right time and are determining your re-entry point? What will be your trigger? \n\nBuying back into my long positions at a 20% discount is a success in my eyes. Timing the market perfectly is impossible but getting solid investments at discounts compared to holding them through dips any day is nice. I’m actually only 85% invested now and will hold the last 15 for another possible dip this week or next. But, the markets are going to move on news cycles and the biggest fear cycle just went by in my opinion (developed nation getting an outbreak, deaths in the US, supply chain disruptions priced in). I’ll be selling many positions if I get a 10% bounce back in the next two weeks because yeah, hospitals MAY fill up and we could see another fear cycle. \n\nWe had the fastest market drop ever...the market moves faster these days, just look at how long it took to recover from previous routs these past two years (1-2 weeks for the majority of the recovery) gotta have fast reflexes or you miss it.", "score": 1, "replies": []}]}, {"body": "Matter of opinion but I concede I may be. Got some great discounts though :). What’s your trigger to buy back in? (And I trade pretty frequently, I’ll dump some positions if I feel we swing into optimism over the next week or two, the market is VERY undamped in fear cycles like this...playing the waves on waves).", "score": 1, "replies": []}]}, {"body": "Thank you for a rational non-fear mongering post.", "score": 2, "replies": []}]}]}, {"body": "Time to short VIX?", "score": 6, "replies": [{"body": "That's what I'm doing. Up 13% from Friday alone.", "score": 5, "replies": [{"body": "Lol. This aged well.", "score": 2, "replies": [{"body": "I don't wanna talk about it.", "score": 1, "replies": []}]}]}]}, {"body": "The high level of fear as indicated by the elevated VIX levels is a clear indication of the market's sentiment.  The markets have always reacted negatively in periods of uncertainty.   \n\nThe markets downturn this year has no resemblance to what happened in 2008.  If you want a historical perspective, consider the markets reaction to the demise of Long Term Capital Management in 1998.\n\nToday we are dealing with unknown supply chain issues - In time, we will achieve a level of clarity and the market will adjust, but we are not there yet. The impact of the virus will clearly be seen in April and July earnings reports. \n\nThe market still has room to go lower, but trying to pick the bottom is like trying to catch a falling knife. \n\nShort term trading with big size on small moves is my strategy for now when the next shoe drops and news can't get any worse, that is when I take long term positions.", "score": 3, "replies": []}, {"body": "Sounds like a good time to SHORT THE VIX", "score": 3, "replies": [{"body": "Works every time", "score": 2, "replies": [{"body": "Pour one out for the fallen brothers of XIV", "score": 2, "replies": []}]}, {"body": "Lol go for it", "score": 1, "replies": []}]}, {"body": "Q3 is going to blow. Q4 will be a bit of a boon. Q1 2020 business as usual", "score": 12, "replies": [{"body": "Q1’20 or Q1’21?", "score": 8, "replies": [{"body": "He meant q1 2021\n\nIf you forgot we're kinda in the middle of q1 2020 now", "score": 9, "replies": [{"body": "Yeah. Hard to believe. Time flies when you’re going broke", "score": 16, "replies": [{"body": "Going broke buying stocks here 🙈", "score": 3, "replies": [{"body": "I already spent half my money buying into the market. Waiting for the good news to buy more. Hopefully I don't lose too much next few weeks.", "score": 1, "replies": [{"body": "Lol. I still have some more disposable income I’ve been saving for stocks to drop.  Averaging down as much as possible.  I’m not actually going broke. Just putting this money to good use lol", "score": 0, "replies": [{"body": "Right there with ya'.  I sold out mid January.   \"Missed\" some profits.  Had a good feeling there would be a much, much better time to buy coming soon.  \n\nDidn't know it would be this soon.  I'm averaging down on DIA, I bought right after the big drop and have been buying in on red days.  My quick wins are coming from VXX, VXM, VIXY.  I think I misunderstood SVXY because it hasn't panned out.  \n\nI think I'm just talking to myself at this point but maybe someone on here that really knows what they're doing can slap some sense into me.", "score": 2, "replies": [{"body": "Nah you're good fam, the fact that you even know about those tickers show you know more than 95% of people here", "score": 1, "replies": [{"body": "Little bit of luck, little bit of research.  I appreciate it, but I wouldn't give me that much credit.  One thing that makes it difficult is having a full time job and being 3 hours behind eastern time.  I can't always be up at 6am.", "score": 1, "replies": [{"body": "People generally lose money if they buy at opening time, so don't worry about that", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "How many people get the flu in the summer? Hate to say it but Trump is somewhat right, these pathogens have a hard time spreading in warm seasons. The groundhog says we have an early spring, at least where I’m from. Q3 2020 is going to see some seriously awesome consumer spending when it’s clear we’ve all survived this and a vaccine will be here for next year.", "score": 1, "replies": [{"body": "Pretty damn hot in Singapore and despite the strictest measures to contain which we could never institute her in the US due to the size of our country they have had cases and continue to have new ones albeit less.", "score": 5, "replies": [{"body": "Fair point, but it’s definitely not spreading like Italy or Iran though...the case spread seems very much direct contact with no mysterious infections of unknown origin.  https://www.moh.gov.sg/covid-19", "score": 2, "replies": [{"body": "I think we don’t know how wide spread the numbers are yet.  To be clear we will be fine this will pass.  But it’s been 11 years since a recession and that virus is canceling events and keeping people at home so I have to imagine it sets us in a direction that is long in the making", "score": 2, "replies": []}]}, {"body": "within the last few days, the number of newly infected started going up dramatically in Singapore:\n\nhttps://en.wikipedia.org/wiki/2020_coronavirus_outbreak_in_Singapore", "score": 1, "replies": [{"body": "**2020 coronavirus outbreak in Singapore**\n\nThe 2019–20 coronavirus outbreak was confirmed to have spread to Singapore on 23 January 2020.\n\n***\n\n^([ )[^(PM)](https://www.reddit.com/message/compose?to=kittens_from_space)^( | )[^(Exclude me)](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme)^( | )[^(Exclude from subreddit)](https://np.reddit.com/r/StockMarket/about/banned)^( | )[^(FAQ / Information)](https://np.reddit.com/r/WikiTextBot/wiki/index)^( | )[^(Source)](https://github.com/kittenswolf/WikiTextBot)^( ] Downvote to remove | v0.28)", "score": 1, "replies": []}]}]}, {"body": "That's completely wrong and this is not the flu. It is already spreading globally in warm and tropical areas.", "score": 1, "replies": [{"body": "What areas? Iran is cold right now 57F during day and  47 at night. It’s a virus that spreads similar to the flu via droplets and surface contamination. 10 degrees has a huge effect on the R0 value for these things. So far we have an R0 value for cool weather and Chinese population densities.\n\nI haven’t seen news of community spread in warm areas. Tropical places have imported cases so far from travellers afaik.", "score": 2, "replies": [{"body": "To be fair, we're officially a week into Autumn here, but Australia would still classify as warm to hot & we've got community spread incl. healthcare workers.\n\nWe've also got no loo paper thanks to the Govt. telling everyone to go & stockpile. This virus will get much worse before it gets better. The official stats are the tip of the iceberg.\n\nMy plan involves lots of hand washing, hand sanitiser & a DCA strategy over the next 9-12 months", "score": 2, "replies": []}]}]}, {"body": "You don’t hate to say it. You hope to say it every chance you get and grasp at straws for those chances.\n\nYou act like a groundhog has weather telling powers. You’re a fucking idiot.", "score": 1, "replies": [{"body": "The groundhog was a joke man, and I’m Canadian so I’m not a trump thumper. So much prejudice and hate inside you. Some personal growth, you could use.", "score": 2, "replies": [{"body": "No, this hate reminds me this shit isn’t normal. \n\nFuck magas", "score": -1, "replies": [{"body": "Also Canadian. If you grow a set of testicles, slide in to my DMs... I will show you a good time.", "score": 1, "replies": [{"body": "This is where if I were an idiot such as you I’d talk shit.  But your testi comment don’t phase me, Because considering the source, the subject matter becomes hilariously ironic.  Lol... Canadians", "score": 0, "replies": [{"body": "You are famous at /r/drama. And not in a good way lol. See ya around, champ.", "score": 1, "replies": [{"body": "Don’t forget to screen shot with name and comment in there, so you can post it as a follow and feel edgy.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "You make a good point. Epidemiologists can estimate when coronavirus will be somewhat under control. However, I think business will be slow for a while even after corona gets reduced.", "score": 0, "replies": []}]}, {"body": "Short the VIX!", "score": 5, "replies": [{"body": "The inverse vix has 30% backwardation till May. Unless volatility goes down quickly you'll get crushed.", "score": 3, "replies": []}]}, {"body": "It’s all about media\nMedia stop giving importance to this news and as soon as China is back to normalization\n\nIt’s more about supply chain issue that market is more concerned than demand", "score": 5, "replies": [{"body": "I'll bet money that the media is *still* underplaying (knowingly or unknowingly) how bad the situation is in terms of number of people infected. I said the CDC and WHO was underplaying it back in [January](https://www.reddit.com/r/StockMarket/comments/extdpq/china_to_inject_174b_of_liquidity_on_monday_as/fgdvwt8/) and I still think they're doing it now. \n\nIt's being compared to SARS, MIRS, and the flu when there is no reason to compare it to any of those other than it falls into the same taxonomic classification as those viruses. The spread has always been faster than the first two and we have no way to combat this viruses like we do the season flu, so there's no comfort in the fact that the symptoms might be similar. \n\nI'll eat my own sock if we don't see infected numbers in atleast 8 digits before it breaks--and that will only happen if WHO/CDC and the other health organizations get their shit together and stop playing politics with the US and China.", "score": 5, "replies": [{"body": "Merely increasing cases will not cause more crashing.", "score": 0, "replies": [{"body": "Then just take the other side of my puts my man", "score": 5, "replies": [{"body": "I sold all long positions early feb and am completely back in after averaging in over the past two weeks, missed purchasing cheap puts before the crash because I was going on vacation and thought we had one more week before collapse. I’m back to playing options on the volatility now that they are priced better as people grapple with this. So yes, in essence I have taken the other side, but am also playing short term vol as well.", "score": 2, "replies": [{"body": "Short term calls? Some FDs??", "score": 1, "replies": [{"body": "On the money, usually intraday, calls or puts depending on whether we’ve swing too far either way, and very event driven. Happy with 50% return in a day, FDs if I’m feeling lucky.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "it sometimes grinds my gears when you see that \"market selloff\" icon on CNBC where you have a flashing red light rotating over and over. They are trying to make things overly scary and sensational. They are doing whatever they can to get more viewers.", "score": 1, "replies": []}]}, {"body": "Perhaps its worth remembering, since the VIX was at its high in 2011, the DOW has \"crashed\" from 12,000 up to 29,000. The Nasdaq utterly withered from 2,500 up to 9,700 points. And the S&P500 withered from 1,200 up to 3,600 points.\nEven the UK's FTSE, one of the grottier markets, made its way from 5,000 up to 7,900 points.\n\nI'm pretty far from convinced the VIX dare be trusted.", "score": 4, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Spicy.", "score": 2, "replies": []}, {"body": "I think people search for reasons to be afraid. Quite odd.", "score": 0, "replies": []}]}]}, {"body": "My fucking call option with a $16 strike price expired one day before the fucking corona crash.", "score": 2, "replies": [{"body": "Why let it expire? Sell way before then.", "score": 1, "replies": [{"body": "It was so close to $16 at the time, and had bounced up to $18ish a couple weeks before. I thought I had a chance to hit. Had it expired a day later, I'd have a fee extra grand.", "score": 2, "replies": []}]}]}, {"body": "I honestly think that this will cause people to YOLO and spend more of their money, live everyday like it’s your last - this episode is a reminder that we can all die tomorrow. This is another big nail in the coffin for retail imo though, online shopping is going to spike.\n\nOnce people realize they’re still alive on Monday people will desensitize themselves to the rising cases. \n\nHospital overflows may cause another shock, but the Govnt is already preparing many quarantine areas in military bases around the country (these were designated early Feb)...and we’re like 3-4 weeks away from that if it happens. Might not happen or be all that bad.", "score": 2, "replies": []}, {"body": "what was happening in 2011 ?", "score": 1, "replies": [{"body": "Nothing. The media were promoting a lie about a \"double bottom\" on the markets, due to the 2009 crash. Somehow, none bothered to check (if double bottoms are indeed a thing) that 2009 has matched the prior crash from 2002.", "score": 1, "replies": [{"body": "Wow I had forgotten about the double bottom", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The virus will be done by April or may but what about the economic fallout. Unknown.", "score": 1, "replies": []}]}, {"body": "This is a great historical analysis of how markets perform after large volatility spikes: \n\nhttps://www.youtube.com/watch?v=ddTRrc0A7Vo", "score": 1, "replies": []}, {"body": "So trader in Chicago on Friday was responsible  for an 8 pt increase in the VIX. He lost so much money that try had to carry his ass out of the pit. Somebody lost some big monies.", "score": 1, "replies": []}, {"body": "1929 style", "score": 1, "replies": [{"body": "the funny thing about 1929 was that the market was extremely overbought before the 1929 crash and everyone and their grandmother invested. Often using borrowed money. The parallel to today is hard to miss:\n\nhttps://vantagepointtrading.com/wp-content/uploads/2018/02/1930-crash-chart.jpg", "score": 3, "replies": []}]}, {"body": "bought TVIX it about a week ago and it is treating me very nicely so far", "score": 1, "replies": []}, {"body": "They took Rrrrr jobzzzzz!", "score": 1, "replies": []}, {"body": "Trump screwed the stock market by demanding that the fed lower the interest rate, which scared a lot of investors into believing that the economy is in big trouble.", "score": 1, "replies": []}, {"body": "I think it will play out the same as ebola,swine flu, bird flu,et al this is nothing-more than using the media to rip off the useful idiots and drive the yields on Treasuries to zero so we can keep pretending to be a rich country", "score": 1, "replies": []}, {"body": "No it's not warranted.\n\nPeople don't understand that the $VIX futures market is very small: just a few billion dollars in size. All the kiddies here who've bought TVIX have artificially boosted the $VIX, but when it finally comes down it'll rip their faces off in the space of a couple hours.", "score": 1, "replies": []}, {"body": "It is a matter of few weeks and coronavirus will start disappearing. Market will start back up starting April onwards", "score": -12, "replies": [{"body": "Yeah in a few weeks we will see well over 1,000 cases in the US...most likely over 2,000. This isn’t going away within weeks and not necessarily because it is going to spread at exponential rates, rather the increase in testing is going to confirm cases at an exponential rate.", "score": 6, "replies": [{"body": "19 deaths suggests the number of cases is already in the thousands. The lack of testing means it's still spreading unimpeded. In a few weeks it will be in the tens of thousands.", "score": 1, "replies": []}]}, {"body": "Weeks.... you obviously get your news from r/wallstreetbets huh ?", "score": 6, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Hold up... what does “virus gone in a few weeks” have to do with autism?\n\nIf anything, an autistic person would be nailing the stats behind spread so far, incorporating what's confirmed about the disease & supplying evidence/thought process for a logical conclusion.\n\nI'd expect an autistic response to be closer to “Testing rates are too low to provide a realistic infection count, which is also hampering containment efforts as carriers don't know they're spreading the disease. Due to the long asymptomatic incubation period & an apparently high R0, a lot more ppl (>x10 current reported figures) will contract the virus with varying outcomes from nothing to death”", "score": 1, "replies": []}]}, {"body": "Probably peak hysteria by early April. Markets will probably return to normal in July/August timeframe according to economists best guess.", "score": 2, "replies": [{"body": "That was based on the old theory that coronavirus was like the flu and would die down in the summer.  What makes you think the coronavirus will go away?", "score": 1, "replies": []}]}, {"body": "I think April is a bit optimistic", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": ">as a scientist\n\n\nAhahahahah. Credentials or GTFO.\n\n“As a bachelor of science in gender studies...”", "score": 6, "replies": []}]}, {"body": "Lol exactly no words - racist", "score": -3, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - March 07, 2020", "selftext": "\nThis thread is to comment on daily $TSLA movements, as well as any short-term trading around it (in fact, such discussions will only be allowed in these daily threads).  For discussions about news/thoughts/opinions about $TSLA and/or Tesla as a business, please check out our Weekly thread(s). This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Tesla - Investor Relations Overview](https://ir.tesla.com/investor-relations).", "id": "fesal3", "created_utc": 1583568827.0, "score": 19, "upvote_ratio": 0.95, "num_comments": 102, "comments": [{"body": "Just wanted to give my contribution being in the position I’m in.\n\nI work for BMW new car sales in the UK and over the past couple months have seen a massive spike in customers saying they are looking to switch from their current BMW into a Tesla. Customers who have been with the BMW brand for over a decade are making the move to electric. We have nothing to offer them apart from the BMW i3... which is similar price to a Model 3 but gets 1/3 of the range and is not a very good seller here in the UK.\n\nEurope is going to play a MASSIVE part in the Tesla story over the coming years especially when Giga Berlin is producing vehicles and our supercharger infrastructure is more established here in the UK.", "score": 38, "replies": [{"body": "I have a 4 series from 2019, dying to replace it for a Tesla with autopilot/fsd features", "score": 8, "replies": []}, {"body": "I just looked at the BMW i4 specs and price... Quite a letdown for a 2021 car. They seem far behind Tesla technologically, range seems low ... and it's $50k+ too. \n\nCould it be that expensive because they are trying to maintain their ICE cars profit margins?", "score": 5, "replies": [{"body": "My understanding (correct me, someone) is that their margins on actual cars are super low, but they make it up on service. EVs don’t make money that way, so I guess you’d have to make that money on the front end?", "score": 1, "replies": [{"body": "That’s basically what Elon sais at the third row podcast. He even said traditional ICE maker make NO profits on cars but only on repair services If I recall correctly.\nThey give you a car so they can repair it and then make money. What a crazy world.", "score": 2, "replies": []}]}, {"body": "Tesla margins are way better than ice cars. Issue is ice cars service centers usually make most money. Evs, needing less service, make a lot less at service centers", "score": 1, "replies": []}]}, {"body": "How out numbered are regular charging stations to tesla supercharger stations in the UK?", "score": 2, "replies": [{"body": "To be honest, there are far less Tesla superchargers than standard regular public chargers. I am based in Birmingham which is the second largest city albeit to London so I can’t speak for London however this seems to be the case currently. Although the UK is really pushing the EV movement with regulations for petrol and diesel cars in major cities and charging high premiums for anyone with ICE vehicles entering the city centres. So it is only a matter of time until more and more people adopt EV’s and sitting where I am working within the automotive industry, the is no competition that comes close to Tesla... and that is even before we get European production in Berlin. Everyday I see more and more model 3’s driving around and I can see them gaining more and more market share here in the UK over the next couple years.", "score": 6, "replies": []}]}]}, {"body": "Would you guys like a deliveries estimates thread when we approach the end of March (let's say 3 days before the EOM)? Could be fun to see the consensus here.\n\nMaybe even award a flair to whomever gets the closest? Let me know what you think.", "score": 19, "replies": [{"body": "100% agreed.\n\nMaybe there could also be a quarterly earnings thread - like WSB is doing it for more popular companies. Often there's a Tesla earnings thread there but not here on the investor sub. 😁", "score": 11, "replies": [{"body": "Great idea!", "score": 6, "replies": []}, {"body": "I like both of these ideas", "score": 1, "replies": []}]}, {"body": "Yes", "score": 10, "replies": []}, {"body": "Cool idea!", "score": 5, "replies": []}]}, {"body": "Elon’s quote from interview with arstechnica.com: “Now Tesla, I think, is in a good situation here, so that’s why I’m pretty much camped out in Boca...”\n\nThis is a very good sign that Elon consider Tesla is now a well oiled machine that is running on Autopilot.", "score": 19, "replies": [{"body": "One of my black swan downside risks is actually Elon retiring to focus on SpaceX.  His heart is clearly in space.  I hope he sticks around at least 10 more years though.", "score": 7, "replies": [{"body": "His heart is in spaceX but he needs that Tesla money to  get mars settled. The way his pay package is set up, he only gets the ludicrous payout if he stays CEO. I think we’re good", "score": 4, "replies": []}, {"body": "Most of Elon's money is in Tesla. He's also stated that his money is last out. I don't think he's leaving Tesla any time soon.", "score": 5, "replies": [{"body": "Things change.", "score": -4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Not saying he won’t stay for a while but I could definitely see him leaving in 2030. Space is where his heart is", "score": 1, "replies": []}]}]}]}, {"body": "He has a nice compensation waiting for him in the next 10 years at Tesla.", "score": 5, "replies": []}, {"body": "If Elon does retire, that means he’s confident that Tesla is strong enough to push the world toward a sustainable future without his involvement. That future would include self driving taxis, massive renewable energy and battery deployment, and underground transportation system. He’s pushing toward that future as fast as possible no matter what.", "score": 2, "replies": []}, {"body": "yea pretty sure he recently said that he plans to stay with tesla for the foreseeable future. he said this like a year ago so", "score": 0, "replies": []}]}]}, {"body": "GF3 Q1 prediction of 15,300\n\n\nhttps://twitter.com/jpr007/status/1236312857026760704?s=21", "score": 18, "replies": [{"body": "If we can get some verification on this Monday will absolutely fucking fly. That Feb is insane holy shit.", "score": 5, "replies": [{"body": "I agree. Macro needs to get in control first.", "score": 2, "replies": []}]}, {"body": "This is huge!", "score": 3, "replies": []}, {"body": "That's a great start.", "score": 2, "replies": []}, {"body": "This matters.", "score": 2, "replies": []}, {"body": "Are these the official February GF3 production figures?", "score": 1, "replies": [{"body": "I don’t know but the poster is reliable and does tweet lot of tsla stuff.", "score": 3, "replies": [{"body": "He also posted the source link, which is official Chinese data, and the numbers all work out!\n\nThis is huge news!", "score": 6, "replies": []}]}]}]}, {"body": "3800 vehicle deliveries in February from GF3. Not bad at all. Looks like Q1 will be 10K from GF3", "score": 13, "replies": [{"body": "They may have a chance beat 112k number from Q4.  Big impact on SP if true, especially with Q1 and virus headwind.", "score": 6, "replies": []}, {"body": "source? Big if true.\n\nIn January they delivered 3.5K. With virus situation almost gone in China, we may look at >7K March delivery & >15K for Q1 in China.", "score": 2, "replies": [{"body": "http://www.cbea.com/", "score": 3, "replies": []}]}, {"body": "Source?", "score": 1, "replies": []}, {"body": "Where do you see that?", "score": 1, "replies": []}]}, {"body": "Baillie Gifford: @Tesla is winning in the electric-vehicle market ☀️🏣🔋 “The opportunity for #Tesla has gotten greater, not just in the extent of its leadership over the industry, but in many of the other activities from solar onwards…” $TSLA #EV\n\n\nhttps://twitter.com/teslany/status/1236351934132518912?s=21", "score": 13, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "If the macro stops with the fear those that sold may have trouble getting back in cheaper than what they sold at.\n\nAnyway, amazing news, this ramp of M3 in China and MY is just a beautiful thing to see.", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I agree depending on what you mean by bad. I think all this corona nonsense might drive expectations so damn low that Tesla surprises big time. I made a long post here BEFORE the virus saying that Q1 sentiment was so low that Tesla would likely surprise; I can only imagine now.", "score": 4, "replies": [{"body": "It's really hard to know. I now think Q1 is going to be much better than the street expects. So that's great. But with all this fear I'm not sure which big players are willing to buy in. We'll have to see. Maybe the stars will allign and the virus panic will subside at about the same time", "score": 3, "replies": [{"body": "Let stock price dominate macro in your mind. How much of a deal is 700 normally? A week ago? A month ago? 6 months ago?\n\n750 to 900 was my guess for new normal, far more aggressive than historical valuation, but that was before macro issues.", "score": 2, "replies": []}]}]}]}]}, {"body": "That's Insanely bullish.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Dyslexia?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That was my second guess", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Hey guys, just some anecdotal stuff.   \n\n\nI made a video about Tesla Insurance the other day. Didn't expect a huge amount of interest. I mean, it's about an insurance product.  \n\n\nBoy was I wrong. The YouTube algo is spreading it far and wide so lots of interest.  \n\n\nLoads of people in the comments wishing it was available in their state/country and ready to switch the moment it is too. Bodes well as Tesla expands its offering outside California.", "score": 26, "replies": [{"body": "THIS MATTERS", "score": 4, "replies": []}, {"body": "Tesla insurance is actually a factor in me considering moving to California lol", "score": 5, "replies": [{"body": "Lol any savings there will be erased by the double price of everything else.", "score": 3, "replies": []}]}, {"body": "The data advantage is huge, but the option to select insurance as you finish ordering the car is what will lead to insane conversion rates.", "score": 3, "replies": []}, {"body": "Was it the one talking about how they have the best data?", "score": 1, "replies": []}, {"body": "For sure. Imagine having to buy something and you’re told it’s illegal to use unless you do the runaround for insurance rates? Seems crazy not to have the product ready to use when you buy it without doing any extra legwork.", "score": 1, "replies": []}, {"body": "California is Tesla’s 30-40% sales, they are targeting the wider customer base to refine their insurance algorithms. Once they are ready, I think they will open to other markets soon. Elon also mentioned this in their Q4 call.", "score": 1, "replies": [{"body": "They were building a state/country agnostic insurance framework to scale and ship everywhere faster", "score": 1, "replies": []}]}, {"body": "I wish it was available in Texas", "score": 1, "replies": []}, {"body": "I'm counting on it being available in my state when my CT reservation turns into an order. I don't hate my auto insurance provider, but I very strongly expect Tesla will be able to beat their rates in a hard-to-resist way.", "score": 1, "replies": []}, {"body": "Buying insurance is pain in the ass.\n\nThe same as buying car through dealership and be obliged to do yearly maintenance at dealership.", "score": 1, "replies": []}]}, {"body": "Alright my strategy will be buying every 25 points down from 650, while selling mar 2021 900 calls on those share. The calls are going for just above 100. It is essentially like buying shares for 100 less than actual price but giving up everything above 900. this is still a net long position. I expect a long period of knock on effects from the current situation which is why I accept the top end cap.", "score": 4, "replies": [{"body": "thx for sharing ElonsMonkey, been enjoying your posts very much. What's your current exposure to stocks vs cash? how much do you plan to go into stocks if SP500 corrects say 20% from ATH, 30% from ATH etc?", "score": 1, "replies": []}]}, {"body": "if you are long, accumulating TSLA as I am, this next week or three will be difficult to time purchases. Will Fremont stay at capacity? Will Shanghai ramp back up?  Are purchases being delayed? The old ‘where’s the bottom’ question after TSLA’s recent blast to new highs is an especially difficult one.", "score": 2, "replies": [{"body": "let me help u\n\nyes, yes, no, you cant time the market, buy and hold.", "score": 4, "replies": []}]}, {"body": "*crickets", "score": 3, "replies": [{"body": "It looks like most retail sold shares and/or lost gambling options and therefore lost interest in subreddit.\n\nThey'll be back when SP will rise sharply again.", "score": 6, "replies": [{"body": "Maybe. I just find this sub isn't that useful right now because there's nothing specifically Tesla happening right now. This is all macro. I'll pay more attention when Q1 numbers come out, and I'm sure others will too", "score": 9, "replies": [{"body": "Personally I think macro is going to completely dominate the conversation for the next 6 months.  BYND for example beat high expectations and dropped like 20%", "score": 6, "replies": [{"body": "I wouldn't compare a company that's been on the market for less than a year with terrible numbers and which heavily relies on fast food sales during a virus scare to Tesla. \n\nI agree macro will dominate for a while because I'm confident we hit new all time highs in 6 months to a year. It's going to spring back from this nonsense so obscenely hard that Tesla's biggest green days won't neccessarily be battery day/ERs.", "score": 3, "replies": [{"body": "I think long term TSLA will do great\n\nIts just that the volatility for it will probably be pretty extreme.  The mentality will probably be if you want to buy shares, why not wait and buy them at a lower price?", "score": 0, "replies": [{"body": "That volatility goes both ways though right? We saw it last friday/Monday and might see it again this Monday; people are already trying to time the bottom. \n\nHonestly considering how high Tesla flew and how hard the market crashed, the support is very impressive. Feels like a spring being loaded.", "score": 3, "replies": [{"body": "If macro issues turn out to be less than expected then yeah I think it could take off.  Its really just that its a bet on macro at the moment (or FSD developments).", "score": 1, "replies": [{"body": ">macro\n\nWhat does MACRO mean? sorry just trying to follow along, :)", "score": 1, "replies": [{"body": "Macro is the wider market. If a bunch of related stocks all fall, people assume this means something about that market segment, and so other (previously unaffected) stocks fall as well. \n\nRight now the whole market is down, which is a macro issue that then weighs Tesla down.", "score": 1, "replies": [{"body": "Thank you, now re-reading it I finally get it, it's going to gain again soon :)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Good point. If we're still swimming against the tide still at Q1 then we could be in for a long haul", "score": 0, "replies": []}]}, {"body": "When do q1 numbers come out? And when is earnings call? Battery day likely April 20th or there abouts. Three key dates to consider in terms of buying movement, either before or after I'd imagine.", "score": 1, "replies": [{"body": "I would expect April 22nd or 29th. 4th Wednesday is the 22nd. Last Wednesday is the 29th. 2018 earnings was May 2 I think. All on Wednesday.", "score": 1, "replies": []}, {"body": "Unofficial Q1 delivery numbers will come out very early in April", "score": 1, "replies": []}]}]}, {"body": "I'm a degenerate gambler but still very much here, but I'm transitioning from options to holding shares and waiting in general until battery day and next financial. Plus it's the weekend people are doing their own thing.", "score": 5, "replies": []}, {"body": "Buy $900 sell $650", "score": 10, "replies": []}, {"body": "Nah we are all still around. Nothing to really talk about atm with focus on the virus.", "score": 4, "replies": []}, {"body": "It's the weekend!!", "score": 2, "replies": []}, {"body": "And that’s great for us", "score": 1, "replies": []}, {"body": "Yep... this is a complete fool's market right now. Back in a few months.", "score": 1, "replies": []}]}]}, {"body": "I think we should hit peak hysteria within next week or so", "score": 3, "replies": [{"body": "4 to 6 weeks. \n\nI think the key in general is to focus mostly on sheer price points. Ideally you set up a buying program so that every x points down you buy y (and same in upward direction if you have more than target share count)... but the #1 sin is buying aggressively early and then panicking if it drops more than you thought. If this is a black swan scenario and it is the highest chance of that in 10 years imo, then you might see 400 or 300s again. At least plan for that.", "score": 4, "replies": []}, {"body": "You spelled year wrong", "score": -11, "replies": [{"body": "I don’t get why you’re downvoted. Funny comment.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It didn't the last 5 times.", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}]}, {"body": "Do we think the Fremont factory would shut down if an employee was found to have covid-19? Feels like that’s just a matter of time", "score": 1, "replies": [{"body": "Elon will resist aggressively defensive solutions. He doesn’t like sissies. I think he will implement every strategy except for shut down, and I hope they have already started strategizing because I’d bet 50:50 an employee there already has gotten it. The workforce should skew well under 60 so actual CFR would be low. However, there is too much money involved to shut down.\n\ni would let anyone with a fever stay home with paid time and I would screen for fever entering the building. In April they can ‘afford’ lower production.\n\nthe culture of California is more susceptible to hanging CEOs that don’t behave cautiously so this all looks risky to me.\n\nif it is legal I may very well let all 60+ skip out with half pay or similar.", "score": 4, "replies": []}, {"body": "No. They just need to test other employees.", "score": 1, "replies": []}]}, {"body": "Advisory to users: We want to limit the COVID discussion in this thread as it's been fairly rampant in recent days. If you have comments to make on it, put them in this [COVID Megathread](https://www.reddit.com/r/teslainvestorsclub/comments/fccesx/covid_megathread_all_covid19_news_and_discussion/?utm_source=reddit&utm_medium=usertext&utm_name=teslainvestorsclub&utm_content=t1_fj9r59a) which will be linked in a stickied comment in each daily so long as the subject remains market-relevant.\n\nPlease focus any discussion not *immediately relevant* there.\n\nCheers!", "score": 1, "replies": []}, {"body": "Now that China is seeing a calming of the virus l, I wonder if there is a drop in sales in US, they can shift US production toward China.  I wonder if they are considering regional sales drop to places where they are on the increase so improved total deliveries\n\nEdit:confused of the downvote, I’m just asking if u think Fremont could ramp up asia deliveries if US is on a long term downturn, that’s what I would do. As we have more gigafactories, their output should vary", "score": -1, "replies": [{"body": "In USA we'll also see calming when people like Warren finish filling their wallets with our cash.", "score": -4, "replies": [{"body": "Why attack?  Surely you know most of us Tesla supporters are big democrats.  Why attack our base?", "score": 3, "replies": [{"body": "Maybe he was referring to Buffett?  Also I don't know if you're right on the Democrat thing.  I'm in an affluent city in the south and there aren't a lot of Dems but there are a hell of a lot of Teslas.", "score": 2, "replies": [{"body": "Affluent cities in the South US are usually the strongholds of Dems in blood red states. \n\nSource: Am from Virginia (see NOVA, Richmond, Charlottesville, Harrisonburg)", "score": 1, "replies": [{"body": "*Looks around at Trump signs on 3 adjoining properties*\n\nNope not here", "score": 1, "replies": [{"body": "Not a definitive rule but often works for many Southern states? What city?", "score": 1, "replies": []}]}]}]}, {"body": "Def Buffet. Sorry about ambiguity.", "score": -1, "replies": []}]}]}]}]}
